{"title": "Chapter 74: Shurian", "id": 74, "volume": 1, "url": "http://boxnovel.org/mmorpg-rebirth-of-the-legendary-guardian-chapter-74-shurian", "volume_title": "Volume 1", "body": "<h1>Chapter 74: Shurian</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 74: Shurian</p><br/><p>Translator: Zenobys Editor: TheRealSeal</p><br/><p>Zhang Yang quickly used Charge. He did not expect to land a successful stun on a Gray-Silver boss; he only wanted to generate enough aggro to draw its full attention. If it were to strike anyone aside from the tank, it would be safe to say that certain death would be imminent!</p><br/><p>Just after Charge made contact, Zhang Yang quickly landed a normal attack and activated Provoke.</p><br/><p>‘-310!’</p><br/><p>‘Immune!’</p><br/><p>Argh, Provoke is ineffective against this boss; and such a strong defense at that! By the looks of it, there could be over 100 points into it!</p><br/><p>Zhang Yang then switched to Cripple Defense to quickly reduce 50% of its defense, allowing the rest of the party to deal more damage.</p><br/><p>With the limited usage of the antidote and the overwhelming amount of HP, the party knew that they had to put all their effort in to kill the boss in time, or the antidote will wear off and they would die from the poison.</p><br/><p>Shurian drew its giant sword and wielded its shield. With a light huff and puff, the rider pulled the horse up to its hind legs, raising it up high and growling furiously!</p><br/><p>Shush! Kriin… The rider, dragging its long sword on the ground, charged towards Zhang Yang and swung it once it was close enough. The swing was so fast and wide that Zhang Yang knew he could not dodge it and quickly activated Block</p><br/><p>“Block!”</p><br/><p>“-984!”</p><br/><p>Weirdly enough, Zhang Yang blocked the attack but Drizzler, who was standing beside him, received heavy damage.</p><br/><p>“Little brat, go stand behind the boss and fight him there! This boss’ attack has a Splash effect, so anyone standing to close to its target receives the same damage as well!”</p><br/><p>Drizzler quickly obeyed and jumped back a few steps. “Tch! Noob tank! I was attacked because of you!”</p><br/><p>“Hah!” Zhang Yang scoffed. He continued to stack 5 layers of Cripple Defense on the boss. Even when the boss had 100 Defense value or more, with the 5 layers of Cripple Defense and Eagle Eye, Zhang Yang’s attacks increased dramatically as it completely ignored all defense.</p><br/><p>“Futile resistance! Wail in pain at the depths of the abyss!” Shurian spoke softly as it swung its sword fatally at Zhang Yang.</p><br/><p>His reaction rate was very fast; however, his in-game character could not match his actual speed. There was only a 50/50 chance that he could dodge the boss’ quick attacks. With his HP dropping like an open faucet, Little Snow was on high alert to ensure he did not die.</p><br/><p>98%, 96%, 94%...</p><br/><p>The boss had just too much HP. Even with the armor reduction, the party’s strong attack power could only bring down its health as fast as a snail!</p><br/><p>“Foolish beings! You dare to challenge the mighty Shurian? Die by the hands of the Abyssal Shadow!” Shurian let out an automated speech as soon as his HP dropped down to 90%. He gained another skill!</p><br/><p>Shush! A black skull burst out from the boss’ body and hit Zhang Yang.</p><br/><p>“-400!”</p><br/><p>Zhang Yang quickly checked the battle log.</p><br/><p>-You have received the effect of Death Shadow, receiving 500 Shadow damage (100 points reduced damage).</p><br/><p>“Give me a break! I can’t keep up any longer!” Little Snow cried with her eyes full of tears. Her job was already tough enough, and it got tougher with the boss’ new skill. Luckily, the new skill’s activation rate was not too frequent, triggering only once every 10 seconds or so; but to accumulate that much of damage from the boss’ regular attacks and Death Shadow, Little Snow was indeed unable to keep up with the damage and left Zhang Yang in a very precarious situation.</p><br/><p>89%, 87%, 85%!</p><br/><p>“Come forth, my loyal servants! Serve and fight for your only lord!” Shurian raised its sword into the sky and two pillars of dark light blasted from both sides of the blade.</p><br/><p>‘Ding! Shurian has summoned Death Servant!’</p><br/><p>Two Skeleton monsters crawled out from the ground and rushed towards Shurian.</p><br/><p>[Death Servant] (Normal)</p><br/><p>Level: 25</p><br/><p>HP: 3,000</p><br/><p>“Hundred Shots, Fatty! Take down those minions!” Zhang Yang commanded.</p><br/><p>He knew not what those minions could do, but he was not going to sit around to find out as they were summoned by the boss itself. He dared not send Drizzler to fight too since there was a chance that the minions would explode!</p><br/><p>Both Hunters switched their targets, taking one minion each. Even so, with their divided firepower, it would take at least 20 seconds to kill of 3,000 HP. There was something odd about the minions though; even when they were attacked, the ignored the attacker and ran towards Shurian.</p><br/><p>The boss laughed maniacally as it swung at one of the minion, turning the poor soul into a pillar of dark light.</p><br/><p>Shoom!</p><br/><p>‘+50,000’</p><br/><p>The boss recovered its HP to 97%!</p><br/><p>‘Ding! Shurian has used Absorb Soul, recovering 50,000 HP!’</p><br/><p>The boss swung again at the other minion and fully healed itself with another ‘+50,000’!</p><br/><p>“Oh, f*ck!” the party cried.</p><br/><p>“It’s alright, guys! Just treat it as a restart!” Zhang Yang explained.</p><br/><p>“The next time Shurian summons the minions again, Hundred Shots and Fatty will both hit on just the left minion! Little brat, I want you to Charge to the right minion and control it for a while. Hundred! Fatty! Once you’ve killed your minion, help with Drizzler’s immediately! I’ll try my best to drag the boss away from the minion and give you more time and space to deal with them!”</p><br/><p>Zhang Yang turned around to find Little Snow and screamed, “Little Snow! How’s your mana?”</p><br/><p>“I’m good! I still have around 85%. I can still fight on with a mana potion!”</p><br/><p>When a Priest reached Level 20, they could learn the skill Meditate, allowing them to constantly recover Mana Points even during the battle; the recovery rate increased with their Spirit value. Little Snow had the second best equipment among the party, only to rival Zhang Yang as he held the best. That was why her mana recovery rate with high. Her current strength could now have easily be ranked as the best Priest in the White Jade Castle.</p><br/><p>98%, 95%, 90%... slowly and steadily, the party attacked the boss and brought down its HP once more.</p><br/><p>“Come forth, my loyal servants! Serve and fight for your only lord!” Shurian raised its sworcd once again, summoning two Skeleton minions to his aid.</p><br/><p>‘Ding! Shurian has summoned Death Servant!’</p><br/><p>Two summoned minions appeared on the far right and left of the field and began rushing towards the center where Shurian was. Hundred Shots and Fatty Han quickly turned and attacked the minion on the left.</p><br/><p>‘Concussion Shot!’</p><br/><p>[Concussion Shot]: Deal 100% ranged damage to a target and reduce 50% movement speed for 4 seconds.</p><br/><p>Cooldown time: 30 seconds</p><br/><p>Range: 30 meters</p><br/><p>The two Hunters fired as many arrows as they could. After 4 seconds, Fatty Han shot another Concussion Shot to further slow it down. After the second shot, the monster moved back at its original speed for only another 3 to 4 seconds before it was defeated.</p><br/><p>Zhang Yang was at the other end of the field, luring the boss to the maximum distance he could get to separate the boss from its minions. The atmosphere was tense but was immediately lifted when Drizzler and the two Hunters killed the last minion standing.</p><br/><p>“Aw, yiss!” Everyone cheered happily, as if they had already won the battle.</p><br/><p>“F*cking good job, guys! Don’t stop! Keep it going!”</p><br/><p>84%, 80%, 75%!</p><br/><p>Shurian pulled up the horse and stood tall. It then pointed its sword at Hundred Shots and said, “Hundred Shots! Bow before your master!”</p><br/><p>‘Ding! Player Hundred Shots is affected with Shadow Control!’</p><br/><p>A black shadowed skeleton floated behind Hundred Shots, forcing Hundred Shots to turn towards Fatty Han and attacked him.</p><br/><p>“Holy shit! What on earth is that?!” Fatty Han was shot at like a beehive but he could not return fire; he could only attack the boss with all his might.</p><br/><p>“I’m being controlled!” Hundred Shots posted in the party channel.</p><br/><p>Zhang Yang quickly replied, “Take a look at the skill description! Is there a time limit? Could it be dispelled?”</p><br/><p>The skill will expire and dispel automatically if there was a time limit, otherwise, players would have to dispel it with a special method like killing the target or using a special tool.</p><br/><p>“Zhan Yu! There’s a time limit, and it’s about 15 seconds! It can’t be dispelled!”</p><br/><p>That’s good. 15 seconds is not as long as it seems.</p><br/><p>Zhang Yang called out, “Little Snow, you need to put more effort in healing! We have a traitor now amongst us!”</p><br/><p>Hundred Shots laughed, “Hey! It’s not me!”</p><br/><p>With an extra enemy to handle, Little Snow’s burden doubled! Luckily, the controlled Hundred Shots did not have a fixed target; he merely turned to one target to attack once and then changed target after. Little Snow simply casted Regeneration on everyone and that removed Hundred Shots as a threat to the team. It was good luck that he did not team up with the boss to attack Zhang Yang, or else he would have not survived the onslaught.</p><br/><p>After the unfortunate spell, 15 seconds went past and Hundred Shots returned to normal, and the attacking rhythm went back to its original pace.</p><br/><p>72%, 71%, 70%...</p><br/><p>“Come forth my loyal servants! Serve and fight for your only lord!” Shurian raised its sword for a third time. Zhang Yang concluded that the boss only activated this skill at every 15% HP interval.</p><br/><p>Sticking to the plan, Hundred Shots and Fatty took one minion while Drizzler handled the other, and the battle progressed smoothly.</p><br/><p>“Haha! Smelly, rotting boss! You better give up that cool horse!” Drizzler’s eyes were fixated on the horse that she wanted to own so eagerly.</p><br/><p>Two minutes had past and the boss’ HP was brought down to 55%. It summoned its minions once more but they were killed off in the same manner.</p><br/><p>“Guys, don’t lower your guard!” Zhang Yang quickly poured cold water on their overly-excited heads. “When the boss’ HP is at 50%, I’m sure there’s going to be another controlling skill. I’m not sure if there isn’t any other ultimate skill! We have to be wary!”</p><br/><p>54%, 53%, 52%, 51%, 50%!</p><br/><p>“Drizzler, bow down to me!” Shurian pointed its sword to Drizzler to cast the skill. It then got down from its horse and bellowed, “Shadow Moon, fight with me!”</p><br/><p>“Shi ling ling…” the skeleton horse let out a weird breath and raised its front hooves and charged towards Zhang Yang.</p><br/><p>The tide of the battle has now been turned, from a 5-on-1, to a 4-on-3!</p><br/>\n</div>"}