{"title": "Chapter 72: Lincar The Slaughterer", "id": 72, "volume": 1, "url": "http://boxnovel.org/mmorpg-rebirth-of-the-legendary-guardian-chapter-72-lincar-the-slaughterer", "volume_title": "Volume 1", "body": "<h1>Chapter 72: Lincar The Slaughterer</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 72: Lincar The Slaughterer</p><br/><p>Translator: Editor:</p><br/><p>[Lica The Slaughterer] (Green-Copper)</p><br/><p>Level: 25</p><br/><p>HP: 250k</p><br/><p>“Let’s hope that this boss has the same skill as the Skeleton Guard.” Said Zhang Yang. “The Elite Skeleton Guards attacks are strong but not particularly deadly. But when compared with the boss…that’s a whole different story…”</p><br/><p>“Sigh…Looks like the load is on me!” Little Snow winked at Zhang Yang. “Later when we’re done, I expect you to treat me to relaxing spa session!”</p><br/><p>Fatty Han eyes gleamed!</p><br/><p>“Requesting to tag along!” He raised his flabby arm up high.</p><br/><p>Drizzler snorted and said, “Fatty Bro, where you should go is not the spa but a gym!”</p><br/><p>“Hmph! I exercise every day! Now that you mentioned it, I remember back then when I’m at the gym doing my workout, there will always be ladies starting at my sexy butt. Argh, I was so ashamed!”</p><br/><p>“Yeah! Like that would happen! Only in your dreams!” Drizzler laughed and everyone else followed.</p><br/><p>“Alright, let’s get started!” Zhang Yang unsheathe his sword.</p><br/><p>Zhang Yang walked a few steps and entered the aggro range, triggering the boss. The giant Skeleton growled in a deep, thundering voice, and the entire cave resonated with its sheer power. The blackened eye sockets lit up in emerald fire.</p><br/><p>Lincar the Slaughterer unsheathed its sword and behaved almost exactly like the Skeleton Guards, slicing the floor with its sword, producing a spark of lighting.</p><br/><p>Zhang Yang quickly dodged and jumped to the other end. Fortunately, that attack did not activate the effect.</p><br/><p>The battle started as the boss cracked open its jaw to speak.</p><br/><p>“ALL. THAT. LIVES. MUST. FALL. TO. THE. ASHES!” roared Lincar as it swings it sword towards Zhang Yang.</p><br/><p>“Tch! A boss that talks a lot bleeds a lot!” Fatty Han laughed.</p><br/><p>“Hehe! Big ass boss! Give me all of your equipment!” Drizzler laughed as well.</p><br/><p>“Muahah! That’s right! You’d better listen to what my little Drizzler says!”</p><br/><p>Being a computer program, Lincar the Slaughterer did not talk or debate with a player, it only cared to do the one thing that it was programmed to to; eliminate the players with its best effort.</p><br/><p>Lincar dragged its sword and raised it up high. Just when Zhang Yang was about to dodge the highly telegraphed attack, a flash of blue light struck him, sending a surge of electricity that rendered him completely immobile! Zhang Yang could not even move a finger!</p><br/><p>‘-160!’</p><br/><p>‘-748!’</p><br/><p>Zhang Yang received two direct hits from the boss, the lower one from the and the higher damage from the normal attack.</p><br/><p>Zhang Yang heart sank. He then realized that he received 700 over damage, even with his 20% damage reduction skill and 70 points Defense status. That would mean that the boss’s unsuppressed damage would reach up to 1,000 damage!</p><br/><p>“Ha! HA! HAAA! PUNY. WEAK. MORTAL. BEING.” Lincar spoke in a weird manner, one word at a time, slow and heavily enunciated. Every syllable was heavily oppressive. Suddenly, its emerald eyes blazed fiercely and the sword in its hand ignited into similar emerald green fire.</p><br/><p>‘Ding! Lincar the Slaughterer has used . All melee attacks will have an extra 30% Shadow attack. Lasts for 1 minute!”</p><br/><p>“Shit! It’s strong!”</p><br/><p>“DIE!” Lincar the Slaughterer bellowed as it swung its sword, cutting through air, leaving a trail of emerald light in its path.</p><br/><p>Zhang Yang frantically moved around, dodging those that he can and used against those that he could not. Even though the sword attacks could be easily blocked with , he could not prevent the damage completely since the did not nullify the Shadow damage it carried. Every time the enemy sword swung, Zhang Yang would always receive around 250 Shadow damage.</p><br/><p>“Pick up the pace!” Zhang Yang screamed.</p><br/><p>Bzz!</p><br/><p>A flash of blue light flashed as Zhang Yang was hit again by . Paralyzed and helpless, Zhang Yang was slashed 3 times by the boss.</p><br/><p>‘-160!’</p><br/><p>‘-250!’</p><br/><p>‘-767!’</p><br/><p>Little Snow hurriedly healed Zhang Yang with everything she had; she could not afford to let him die!</p><br/><p>“HAHAHA! Weaklings! Scream and wail by my sword!” After a few speeches, the boss could finally deliver a proper sentence. It then raised its sword up to its forehead and a progress bar appeared above its head!</p><br/><p>Without delay, Fatty Han and Hundred Shots quickly shot a to it without Zhang Yang needing to remind.</p><br/><p>‘Immune!’</p><br/><p>“Oh crap! What is he up to?!” Fatty Han muttered.</p><br/><p>The skill took 3 seconds to cast; it was not too long, neither too short, however what was even more surprising was the fact that a huge meteor appeared in the sky and smashed down on Zhang Yang and Drizzler.</p><br/><p>BOOM!</p><br/><p>‘-2,500!’</p><br/><p>‘-2,000!’</p><br/><p>‘Ding! Player Drizzler had died!’</p><br/><p>‘Ding! Player Zhang Yang had died!’</p><br/><p>“F*ck! What power!” Fatty Han gazed at the boss’s 73% remaining HP and immediately lost all hope, choosing to give up.</p><br/><p>The entire team was killed in the blink of an eye.</p><br/><p>“Noob tank! How did you and Drizzler die?” At the graveyard, Little Snow asked Zhang Yang.</p><br/><p>Zhang Yang quickly refer to the battle log and checked.</p><br/><p>‘You have received 2,000 Fire damage (500 point reduced damage) from .’</p><br/><p>Drizzler followed suit and found out that she had also received 2,500 damage from the same skill.</p><br/><p>“How do we fight this?” Fatty Han said. With only 1,900 HP, not even Zhang Yang could endure the skill.</p><br/><p>“We can… Little Snow juts needs to heal us to full health at the moment of that skill and also cast a !” Zhang Yang replied.</p><br/><p>Little Snow’s magic attack had exceeded 300 and her could absorb up to 600 over damage. Its endurance could help increase the limits of one’s maximum HP!</p><br/><p>After the team revived and recovered to full health, the boss returned to its previous posture, standing still like a statue, emotionless.</p><br/><p>After a minute, everyone returned to their full health.</p><br/><p>“Little brat, I want you to pay full attention. When the boss starts casting the skill, you need to withdraw as fast as possible!” said Zhang Yang.</p><br/><p>“Okay!” Drizzler nodded.</p><br/><p>Zhang Yang walked ahead and started the battle.</p><br/><p>90%, 80%...So far so good…</p><br/><p>Suddenly, the boss spoke a smooth taunt and started to chant a spell. Drizzler quickly ran away from her current position. The total spell incantation was 3 seconds, providing enough time for her to reach a same place if her reflexes were swift enough.</p><br/><p>BOOM!</p><br/><p>The boss completed the incantation and a huge rock fell down from the sky, hitting Zhang Yang on the head.</p><br/><p>‘-3,386!’</p><br/><p>Zhang Yang crumpled to the ground, completely burnt into a crisp.</p><br/><p>‘Ding! Player Zhan Yu has died!’</p><br/><p>“Weak little beings! All of you will die!” Lincar started its massacre and killed everyone before they could react.</p><br/><p>“Argh…what a lost! We were killed twice now!” Little Snow sighed.</p><br/><p>“Why has the damage increased?!” Fatty Han questioned.</p><br/><p>Zhang Yang referred to the battle log again, he intended to find out the reason behind it.</p><br/><p>‘You have received 3386 Fire damage (1,000 point reduced damage, 614 damage absorb by ) from .’</p><br/><p>Zhang Yang calculated and found it the truth behind its skill! The total damage will always be 5,000!</p><br/><p>“Guys! I’ve found out! The boss’s skill has a fixed damage! It will always be 5,000 damage. If the skill hits anyone in the area, the damage will be distributed equally to everyone!”</p><br/><p>The first time they were strike by the skill, both Zhang Yang and Drizzler received 2,500 damage each. The second time, since Zhang Yang was the only one who tanked the skill, he alone received all 5,000 damage! That was why he died!</p><br/><p>Now that he understood the boss’ mechanism, he could then device a plan to counter it.</p><br/><p>“Guys! Change of plans! When the boss starts to chant the skill, I need everyone to gather to my position! If it’s 5 of us, everyone should receive only 1,000 damage! If Little Snow could pre-cast us with , we could all recover to full health in a blink!”</p><br/><p>“Sounds good to me!”</p><br/><p>“Okay!</p><br/><p>Everyone agreed and quickly revived and recuperated.</p><br/><p>“Let’s go!”</p><br/><p>Zhang Yang started the fight.</p><br/><p>“Rape his ass!”</p><br/><p>Everyone joined the fight once Zhang Yang activated his .</p><br/><p>The boss fight started for the third time and it progressed slowly, with the boss gradually losing HP.</p><br/><p>90%, 80%, 70%!</p><br/><p>Lincar raised its sword and chanted a spell.</p><br/><p>“Everyone! Gather!” Zhang Yang quickly called out. He turned around and started running back while Little Snow and the range players ran towards him. With everyone gathered together, Little Snow quickly cast on everyone.</p><br/><p>BOOM!</p><br/><p>The huge meteor strike and everyone received damage.</p><br/><p>‘-1000!’</p><br/><p>‘-1000!’</p><br/><p>‘-1000!’</p><br/><p>‘-1000!’</p><br/><p>‘-800!’</p><br/><p>After unleashing its skill Lincar growled and went back to attacking Zhang Yang.</p><br/><p>Zhang Yang used again and resumed on the offensive.</p><br/><p>“Cousin, the guy named Lu called again, he said that he will come over in a few days!” said Drizzler as she swung at the boss.</p><br/><p>“What?!” Little Snow raged. “How could he be so shameless?!”</p><br/><p>“Hehe! It can’t be helped since you’re so beautiful. That guy will never give up since he is a fly!” Drizzler giggled.</p><br/><p>Little Snow clenched her fist. “Hmph hmph…If that guy would even try to do anything at all, I’ll will smash his face in! What an arrogant man! He thinks that all the women would grovel at his feet since he has such a young and handsome face! Pui! It irritates me!”</p><br/><p>Fatty Han quick interjected. “Little Snow! Tell me who the scoundrel is that dared to disturb you! I’ll personally beat the shit out of him!”</p><br/><p>“Pervy Fatty! If you were to help out, does it count as a self-induced Trojan horse? To let the danger into your own house?” Drizzler giggled.</p><br/><p>“Hmph! I am a man of honor and pride! People even call me the King Arthur of Honesty! Do you think I would do something as dishonorable as that?!”</p><br/><p>“F*ck! Shut the hell up and move your fat ass!” Zhang yang screamed. The boss was about to unleash its skill again.</p><br/><p>Everyone quickly stopped their conversation and sprinted towards Zhang Yang to share the burden of the damage. With only 30% HP left, the boss’ doom seemed imminent.</p><br/><p>“Seriously, if things get out of hand, you can rely on Fatty Han to help you!” said Zhang Yang. He had high hopes on these two girls in the Professional League, he did not want anything bad happening to them!</p><br/><p>Zhang Yang could not remember seeing the name Little Snow nor Drizzler in his previous life. He thought that they might really have met with some malicious events in the past that had caused them to drown among the nameless crowd. On the other hand, Fatty Han was quite dependable since he was famous in society around his area. Whenever he said something, people would listen, or perhaps in that annoying man’s case, shiver.</p><br/><p>Little Snow shook her head and still clenched her fist. “Tsk tsk tsk…This elder cousin here is a Black Belt Karate fighter. Do you think that a simple guy like him could do anything to me?”</p><br/><p>While they were having their conversation, the boss unleashed once, not long after having its HP dropping down to 5%.</p><br/><p>When it died, the boss gave out quite a huge chunk of experience to the point where Zhang Yang, Hundred Shots, and Fatty Han levelled up.</p><br/>\n</div>"}