{"title": "Chapter 85: Exploration", "id": 85, "volume": 1, "url": "http://boxnovel.org/mmorpg-rebirth-of-the-legendary-guardian-chapter-85-exploration", "volume_title": "Volume 1", "body": "<h1>Chapter 85: Exploration</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 85: Exploration</p><br/><p>Translator: Editor:</p><br/><p>The second stage of the boss was fairly easy; from the attackers’ perspective, that was. In the healers’ eyes, they were having the time of their life healing like there was no tomorrow!</p><br/><p>The boss was just too powerful! His staff looked like it was made from wood but it felt like it was really just the Monkey King Sun Wo Kong’s golden staff. Zhang Yang’s HP was being whacked down like how Sun Wo Kong whacked the high heavens upside down!</p><br/><p>“Damn you, Zhan Yu! Why are you so squishy like a tofu1!?” Little Snow complained violently.</p><br/><p>Zhang Yang smiled bitterly. He thought to himself, “Hmph! Keep on complaining, b*tch! If I were to trade with another tank, you wouldn’t even have time to open your mouth at all! You’d be too busy healing crazily. The moment you’re distracted, you’d be sure to have the tank killed!”</p><br/><p>Being attacked by Sun Wu… Marzerway, Zhang Yang did not have any spare time to do anything else. He was fully focused on doing one thing, evading every attack. He could not even spare some energy to open his mouth to remind the party members nor command them!</p><br/><p>“Be pierced to death by my rocks!” Marzerway bellowed. He waved his staff around and 12 circular dark pits with a diameter of 3 meters wide appeared randomly on the battle field.</p><br/><p>“MOVE, MOVE, MOVE!” Zhang Yang was so preoccupied that he could only scream as loud as he could.</p><br/><p>‘Ding! Marzerway has used !’</p><br/><p>Almost everyone was able to dodge in time, but there was a small group of players that were slower and became inflicted with the slow effect, eventually being pierced by the spikes that jolted out from the pit. One by one they were attacked and the damage text appeared on their head.</p><br/><p>‘-400!’</p><br/><p>‘-400!’</p><br/><p>This skill’s attack rate was one strike per second, and since the slower players were inflicted by slow, they took 3 to 4 attacks before they could escape the pit’s attack radius.</p><br/><p>Luckily the healers were efficient enough to heal them in time or they would be killed too!</p><br/><p>But this placed the healers in a worse position. They were already busy enough taking care of the main tank, but when they had to babysit the rest of the party, the entire healer’s team was turned upside down.</p><br/><p>Fatty Han sucked in a cold breath and said, “Damn, being poked so many times, I think my assh*le is bleeding now!”</p><br/><p>“Hell no! It’s the balls that’s hurting!”</p><br/><p>“Wrong! Even your balls are now in pieces!”</p><br/><p>Zhang Yang was infuriated with the party’s halfhearted behavior.</p><br/><p>“SHUT THE HELL UP AND PAY ATTENTION!”</p><br/><p>Everyone froze.</p><br/><p>“Focus on the boss and predict what skills he will cast next! How many of you really memorized the skills from before?! How you could still miss it and get killed!? Didn’t I asked you to get used to the boss’ skills?! Why did I bring you to the Normal Mode for?! Fishing for girls?! The next person who gets hit by any skill is a pig head!”</p><br/><p>After hearing Zhang Yang’s rage-induced scolding, the party did not dare to joke around anymore. All of them started to pay attention and attacked the boss. Zhang Yang truthfully did not want to put a wet blanket on their fun, but before enjoying the moment, they needed to first ensure the dungeon’s victory! Of course Zhang Yang would get angry! They were in the exploration team yet none of them seemed to understand the importance of it! Someone of them even behaved like the boss would automatically drop dead without them needing to lend a hand!</p><br/><p>“Strength! I will show you my strength! Bear witness to the power of Marzerway!”</p><br/><p>The boss smacked Zhang Yang strongly and his body shook a little from it! The boss expanded in size!</p><br/><p>‘Ding! Marzerway has gained effect (1 stack). All physical attacks have been increased by 5%!”</p><br/><p>“Pick up the pace! We must quickly end this stage within 2 minutes! Do not let him grow up to 10 stacks or else no one in this world could endure his attacks!”</p><br/><p>Everyone started to give all that they had! Arrows flew, spells were shot, and blades were clashing!</p><br/><p>76%, 74%, 72%...</p><br/><p>“Be pierced to death by my rocks!”</p><br/><p>“…”</p><br/><p>“Strength! I will show you my strength! Bear witness to the power of Marzerway!”</p><br/><p>“…”</p><br/><p>64%, 63%, 62%!</p><br/><p>Marzerway gained 10 levels of , his attacks were increased by 50%, ’s damage per second increased to 600! Those who were slower and did not manage to avoid the pits were killed off instantly. Many of the players here had recently just reached Level 20, so their weapons and armors were quite mediocre; their HP was only a little over 1,000.</p><br/><p>60%...</p><br/><p>The boss finally entered the third stage. But the initial number of players were reduced by a whole lot. Right now, the only players remaining accumulated to one third of the original number!</p><br/><p>“Little Yang, should we just give up and try again?” Fatty Han asked.</p><br/><p>Zhang Yang shook his head. “No. We continue. Treat this as practice!”</p><br/><p>They already lost 7 members and they boss had only lost 40% HP. The following events to come would definitely be harder and uglier.</p><br/><p>Luckily, when the boss entered the third stage, he did not carry over the 11 stacks of . Unless the team could end the stage quickly without any trouble or death, the bonus effect would definitely pose as a threat for Zhang Yang.</p><br/><p>“O Spirt of Fire and Immolation! Be one with me!”</p><br/><p>Marzerway raised his staff high and struck the ground with great strength. A wall of fire emerged from the ground and blasted everywhere, with him as the center of it.</p><br/><p>Peng! Peng! Peng!</p><br/><p>All melee range players including Zhang Yang were knocked back 3 meters away!</p><br/><p>‘Ding! Marzerway has used !’</p><br/><p>‘Ding! You are now affected with . All fire attacks received will be increased by 50%!’</p><br/><p>Zhang Yang quickly dashed forward and used to attack when he was in the melee attack range.</p><br/><p>Marzerway reverted back to a magic-based boss when he entered the third stage. After he struck Zhang Yang a few times, he quickly casted a .</p><br/><p>Boom!</p><br/><p>Zhang Yang received a devastating 1,500 damage in just one attack.</p><br/><p>One of the characteristics of a magic attack type was that it will use physical attacks once in a while. The damage was unlike the physical attack type, where it could feel as heavy as a bulldozer! But even so, physical attacks were no match for a magic attack type that could chain a combo!</p><br/><p>For example, after the boss casted a , he could cast another which could kill a tank with a 90% success rate! A tank would need to depend heavily on his equipment to survive. If his HP was not high enough, he could not even fight the boss at all!</p><br/><p>“Healers! Please listen carefully. I want you all to make sure my HP is full before the boss cast a ! To everyone else, do not die! This is an order!” said Zhang Yang.</p><br/><p>His current maximum HP was 2,200. If he were to be carrying , he would receive 1,500 damage from and 600 damage from . He could be killed with just another light attack from the boss, and that was why Zhang Yang had to maintain full HP!</p><br/><p>In the third stage, the boss would gain one buff that increased 50% damage whenever someone dies. Unless they could quickly force the boss to enter the fourth stage, the team would be walking on fire whenever anyone dies!</p><br/><p>“O Flames of truth! Cleanse the souls of these sinful beings!” Marzerway raised his staff. 16 rivers of molten lava burst out from his body and flowed onto the battle field, covering the ground with burning lava.</p><br/><p>‘Ding! Marzerway has used !’</p><br/><p>“Avoid it! Avoid it!”</p><br/><p>Zhang Yang kited the boss to a safe location. This skill did not need the boss to continuously channel. As long as it was casted, it would continuously flow out from a fixed location until the end of the duration. The party was in total chaos; some managed to avoid the lava while others were in such a panic that they accidentally walked into the lava and died.</p><br/><p>‘Ding! Player 4th Grandfather had died!’</p><br/><p>“Hahaha! The power of the soul shall grant me more power!’ Marzerway laughed cynically.</p><br/><p>‘Ding! Marzerway has gained a effect. All attacks have been increased by 50%!’</p><br/><p>Boom! A was casted and it hit Zhang Yang.</p><br/><p>‘-2,250!’ Zhang Yang was instantly killed!</p><br/><p>Ironhill quickly took over his role but Drizzler, Frost Night, Fatty Han, and Hundred Shots had more aggro than he did. Marzerway did not attack him, and instead casted a and killed Drizzler.</p><br/><p>When the boss turned to face Frost Night, she quickly whipped her right hand and disappeared with .</p><br/><p>Marzerway then quickly switched his attack target and shot two killing off both Fatty Han and Hundred Shots.</p><br/><p>The situation was f*cked up beyond any recognition. Marzerway now had 5 stacks of effect. He could just kill anyone in sight with just the alone.</p><br/><p>Complete annihilation!</p><br/><p>In the graveyard, Zhang Yang could not bring himself to scold the party. He only laughed and said, “Oh well, I guess we did quite well for our virgin battle! Still, those who died before me, please pay attention. If you ever make any careless mistake like that ever again, the first offence will cost you 20 guild contribution points. The second offense will cost you 50 and that’ll be the last straw. If you commit the third offence, consider yourself kicked out from this party! I’d rather wait a few more days than fighting a fruitless battle!”</p><br/><p>The players that died in the early stages dropped their head low. They had to take some form of punishment for making fatal mistakes.</p><br/><p>“Still, I had to admit that I made a mistake at the battle arrangement!” Zhang Yang self-critic.</p><br/><p>“Later, all melee attackers shall stand behind the boss and attack. All range attackers must get together with Little Snow! I will tag her with the ‘Ball’ symbol. So, when you see the ‘Ball’ move, I don’t care whether you are taking a shit, I want you to follow the ‘Ball’! If you could not even follow this, I’d have no other way to lead you!”</p><br/><p>“You idiot! Change the symbol!” Little Snow was not fond of the symbol and stared at Zhang Yang.</p><br/><p>Zhang Yang was confused. “Huh? What…?”</p><br/><p>Fatty Han scratched his head for a while and finally understood why Little Snow was angry.</p><br/><p>“Little Yang. Don’t use ‘Ball’ since…well…” He pointed at Little Snow. His fingers was a little lower, towards her chest.</p><br/><p>“Ah… right. Okay.”</p><br/><p>Zhang Yang understood what he meant and laughed bitterly. He then changed the “Ball” into a “Star” instead.</p><br/><p>“Ok… Follow the star!”</p><br/><p>“Follow the star! The Super Star!” Fatty Han started to act like a woman and cat-walked around while shaking his hips. Everyone laughed.</p><br/><p>“Pervy Fatty! Just drop dead!”</p><br/><p>Everyone revived and went back into the dungeon.</p><br/><p>Zhang Yang drew out his sword and struck it into the ground.</p><br/><p>“Cheer up guys! We can do this! Let’s go!”</p><br/><p>The second battle started with Zhang Yang’s standard .</p><br/><p>The first stage went fairly well, and everyone did their job properly; the interruption team managed to prevent every spell from being casted. The melee attackers followed Zhang Yang’s instructions and attacked from behind the boss whilst following Zhang Yang as he kited Marzerway. With this strategy, they could evade every casted by the boss. Ranged attackers stuck to Little Snow like glue, following her everywhere she went. Listening to Zhang Yang this time ensured that no one got hurt at all!</p><br/><p>Still, even though no one died, the team’s attacking power seemed to drop tremendously!</p><br/><p>Zhang Yang opened the Damage statistic and found out that the problem was from the ranged attackers. They were probably thinking too much on avoiding the skills rather than focusing on attacks. However, Zhang Yang could not ask too much of them. It was good progress when no one died. He could not expect them to be as good as Hundred Shots or Frost Night.</p><br/><p>Zhang Yang was afraid that the low damage rate would allow the boss to gain in the second stage, but the problem could be solved even though they had lost several party members. The boss entered the third stage with 11 stacks of and 60% HP!</p><br/><p>1 Gamer’s term; squishy like a tofu meant the player had low defense that he or she would easily have their HP drop at a tremendous speed.</p><br/>\n</div>"}