{"title": "Chapter 88: Mess with me? I’ll mess with you!", "id": 88, "volume": 1, "url": "http://boxnovel.org/mmorpg-rebirth-of-the-legendary-guardian-chapter-88-mess-with-me-i%E2%80%99ll-mess-with-you", "volume_title": "Volume 1", "body": "<h1>Chapter 88: Mess with me? I’ll mess with you!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 88: Mess with me? I’ll mess with you!</p><br/><p>Translator: Editor:</p><br/><p>The announcement of Lone Desert Smoke’s achievement spread abruptly across the entire server. Those who were still in the middle of raiding the same dungeon were devastated!</p><br/><p>The entire China server had at least 20 to 30 elite guilds and their own exploration teams had been stranded at the fifth stage of the dungeon. The fifth stage was the last round it was the only remaining obstacle that kept them from the highest glory! But, no matter what they did, they just could not pass that stage!</p><br/><p>Most of them had the idea that they were failing their chances due to the lack of strong equipment which led to players being unable to perform at their best. This led them to rely on brute force. The stronger guilds could only fight until the boss was reduced to 10% HP made no progress beyond that.</p><br/><p>Perhaps they had thought that was a matter of farming for some stronger equipment, or a matter of the party’s class arrangement. But just as they were still cracking their heads for more brilliant ideas, Zhang Yang’s guild had claimed the First Clear Achievement.</p><br/><p>It could have been dismissed as beginner’s luck the first or second time, but when Lone Desert Smoke took the First Clear Achievement for the third time in a row, no one could ever look at them the same way as before!</p><br/><p>Lone Desert Smoke, all this while still being dismissed with skepticism, was now being flooded with guild applications! No one dared doubt the capability of this guild any longer! The name Zhan Yu had engraved deeply into everyone’s hearts. Every guild master now acknowledged the rise of a new competitor, Zhan Yu’s very own Lone Desert Smoke!</p><br/><p>…</p><br/><p>After equipping the new shield, Zhang Yang HP shot up to 2740 HP and his defense rose similarly to 236! Now, he could leisurely take several hits from a Hardcore boss!</p><br/><p>Once the loot was distributed, Zhang Yang brought the team to fight the Hard mode of the Main Wing and collected an additional 6 pieces of Green-Copper equipment for the team. Even though the equipment there were weaker than Gray-Silver, it was still on par as 5-man Hardcore dungeon equipment drops. Furthermore, they were set equipment! The best news was that different tiered equipment could still activate the set equipment effect! For example, if the player was wearing Gray-Silver boots, a Black-Steel helm, and a Green-Copper chest plate, the 3-set equipment effect would still trigger! The only condition was that the equipment had to be in the same set, if the player had collected 5 different tiers of the same equipment set, he could still trigger the set equipment effect!</p><br/><p>Among the party members, the little brat was the luckiest. She had gotten a pair of boots from the Hardcore mode and another piece of the set from the Hard mode! She managed to activate the first set equipment effect! Once they had completed the Hard mode, Zhang Yang disbanded the party and allowed the member to go off on their own. However, he kept his 4 friends close at hand, with the addition of Frost Snow.</p><br/><p>“We are going to fight the Skeleton Horse Knight at the Cave of Bones!”</p><br/><p>“Aw Yiss! Horsie!” Drizzler leaped and jumped around with joy.</p><br/><p>They had headed down to the Cave of Bones yesterday to fight, only to find that none of the bosses on the 5 floors had re-spawned. Everyone concluded that since the final boss was a Gray-Silver tier, it had effected all the other bosses upon death, and they would re-spawn at the same time as it does, which was 3 days.</p><br/><p>The first time they had raided this cave, they had a tough time. But now, they fought and went down each floor with ease since thanks to their vastly improved equipment. Not to mention, they had a new strong attacker in their team!</p><br/><p>However, luck was not on their side this time. After killing 4 bosses from 4 floors, there were no signs of any Shape-Shifting or Magic Scrolls, or even the Indian God Oil! The reason why they could get so many item the previous time was probably because that was the first time the boss died. Now that this was the second time they are fighting, the drop rate must have reduced!</p><br/><p>When the party arrived at the fifth floor, Zhang Yang was worried that they might be unable to endure the poison effect of the mist since they did not have the antidote to counter its effects. But when the party entered the area, there was no such mist whatsoever. The air was clean and fresh. The effect must have been a quest triggered scenario, or else the party would have had to depend on level 50 equipment to fight this boss!</p><br/><p>This round, Zhang Yang had brought along his [Beginner Anti-Shadow Potion], and so the party manage to kill of Shurian with ease. This time, Shurian was as stingy as the upcoming floor boss. It only dropped 3 Gray-Silver equipment which were taken by Drizzler, Little Snow and Frost Night. The body disappeared after all equipment had been distributed.</p><br/><p>It was already 2pm by the time they were finished with the Cave of Bones. Zhang Yang disbanded the party and everyone logged out to have their lunch. Zhang Yang logged back in after having a good meal and adequate rest.</p><br/><p>As he was strolling in the city, Zhang Yang suddenly recalled the encounter with Humbly Gentleman and his trickery to sabotage his raid.</p><br/><p>Hehehe…In that case, time to let him suffer for a bit. Humiliation and regret! Let him suffer in poverty!</p><br/><p>Zhang Yang opened his friend list and found that Humbly Gentleman was online. He grinned sinisterly to himself and send a private message.</p><br/><p>“Guildmaster Humbly Gentleman! Are you busy right now?”</p><br/><p>“My my, it’s the famous Zhan Yu!” He replied swiftly. “Haha! Oh my! I forgot to congratulate you for obtaining another First Clear achievement!”</p><br/><p>“Ahahaha! It’s nothing really. It was pure luck, I must admit! Fortune happened to smile upon me!” Zhang Yang sent over the description of the [Beginner Anti-Shadow Potion] to him and said, “I was really fortunate to have been able to farm this peculiar item! Without it, I’d have never have been able to get pass the fifth stage of Marzerway!”</p><br/><p>Humly Gentleman face was completely drained of color.</p><br/><p>Just the day before yesterday, Humbly Gentleman’s guild The Dominator has tried to take on the Hardcore mode of Marzerway’s Lair. They were completely wiped off after 30 seconds into the fifth stage! They had tried many methods. They had tried increasing the healer count in the party but because of the high number of healers in the party, the attacking power was so low that they could not even get through the 4 stages before the final one! The next time, they tried a more conventional arrangement and focused on raw attacking power instead. Still even though they could keep the party alive till the last stage, they still could not kill the boss within 2 minutes. Once the boss cast a huge AOE skill, everyone was killed. The more survivors only meant more death!</p><br/><p>No matter how many time they revised their battle plan, the god-like fifth stage was impenetrable!</p><br/><p>Now that Humbly Gentleman had seen the potion’s properties, he was completely stunned! If only they had this item as well when they raided the dungeon, they would have already claimed the First Clear Achievement without cracking their brains for ideas!</p><br/><p>WHY! WHY! God damn it! Why is that cheeky brat is so god damned lucky!</p><br/><p>Inside, Humbly Gentleman was so angry that he would have punched Zhang Yang in the face if he was standing right in front of him! It took all his will to maintain his composure and say, “Zhan Yu! Let’s make a deal. Could you sell a bunch of these potions to our guild?”</p><br/><p>Hmph! I was waiting for you to say that! Zhang Yang purposely delayed his reply. “Guildmaster Humbly Gentleman, I’d only have a few of these left for the next raid. The ingredients for the potion are extremely hard to come by.”</p><br/><p>“Haha! The 20-man dungeon would only re-spawn after 3 days! You would have that much time to farm for the ingredients no?” Humbly Gentleman tried to reason with Zhang Yang. Even though he could not get the First Clear Achievement, he could still be the second guild to clear the dungeon, he could surpass both Crimson Rage and Sky High!</p><br/><p>Furthermore, there is always the speed record! If he could gather a bunch of Gray-Silver equipment to strengthen his team, he could easily beat the time record of the 5-man dungeon!</p><br/><p>The third reason involved his longer termed planning- he could prepare his guild for the level 30 dungeon First Clear Achievement! Try raiding the dungeon with a Green-Copper equipment instead of the Gray-Silver equipment. The difference would be heaven and earth!</p><br/><p>That was why, no matter how high a price Zhang Yang set, Humbly Gentleman would gladly accept it!</p><br/><p>Zhang Yang acted coyly. “Well…since you insist, I could…sell you some! However…the price would be…erhm…”</p><br/><p>Humbly Gentleman cursed aloud on his side where Zhang Yang could not hear. Damn! What’s with this dilly dallying?! All you wanted is money right!? Tch!</p><br/><p>Even though he wanted to say that out loud, he would have never stoop as lowly as that. He calmed himself down and speak carefully.</p><br/><p>“How many bottles do you have there?”</p><br/><p>“100!”</p><br/><p>Humbly Gentleman started to calculate. With the help of this potion, his guild’s team capability could easily raid the dungeon without much problem! So far, his team consisted of players at around level 22, and it would take about 15 days before he could bring the team’s player level to 30. If they would take 2 days to raise one level.</p><br/><p>The dungeon would respawn every 3 days, this would mean at least 5 raids. 100 bottle would be just the right amount!</p><br/><p>What a coincidence! Humbly Gentleman smiled with satisfaction and replied Zhang Yang. “Ah. I see. In that case, I like to buy them all!”</p><br/><p>Hehehe the number 100 was not just a random thought, Zhang Yang had already predicted Humbly Gentleman going through that exact calculation.</p><br/><p>He quickly replied, “Oh no! I can’t just sell them all! The ingredient is just that hard to farm. If I were to sell them all to you, what’s going to happen on my end here?!”</p><br/><p>“Hehehe. Your guild had already claimed the First Clear Achievement! You would not need to raid the dungeon anymore now do you?”</p><br/><p>There was a short pause in the conversation. Zhang Yang was waiting for him to make the first move.</p><br/><p>“I’ll pay 10000 gold for it! 10000 gold! How does that sound?”</p><br/><p>“Erhm…10000 gold is just…I mean, money is not a problem…but the ingredients are just too hard to come by!”</p><br/><p>“Erhm..2. No! 50000 gold!” Humbly Gentleman grit his teeth till the point that you can actually see some pieces of enamel chipping off.</p><br/><p>“Hm…Very well then...” Zhang Yang pretended to accept the offer with a heavy heart. But on his side, Zhang Yang smiling from ear to ear.</p><br/><p>So far, the exchange ratio for gold piece to real-life currency was 1:7, and 50000 gold pieces would cost approximately over 300 thousand dollars! Truthfully, Zhang Yang did not care about the money he was earning from this single trade. That’s because the money he is bound to earn would exceed that amount by the millions when more players begin farming the dungeon for the first set equipment in the game!</p><br/><p>Zhang Yang only want to mess with him since he was being such a hypocrite. To think that he would dare name himself Humbly Gentleman when in reality, he was such a jerk.</p><br/><p>“Well. I guess I should mail you the item with the fees as well.”</p><br/><p>“Alright. Please hurry!”</p><br/><p>Zhang Yang closed the deal with Humbly Gentleman and started to search another name and sent a private message to Snow Seeker.</p><br/><p>“Guildmaster Snow Seeker, may I interest you with this item?” He posted the item over to her.</p><br/><p>After a while, she replied. “At first I was wondering about how you guys manage to survive past the fifth stage of Marzerway. Now that you have sent me this, my question were answered.”</p><br/><p>“Haha! You guess right. I was just lucky! So how about it? Would you like to stock up a little?”</p><br/><p>“Name your price!” Snow Seeker was alert and straight to the point. She did not try to go around the bush, trying to get to his better side.</p><br/><p>“1 gold coin per bottle!”</p><br/><p>1 gold coin per bottle was the same price in his previous life. Zhang Yang gave her this offer since he did not want to take advantage of her guild. Since he had already had his fun tormenting his real target, selling 1 bottle for 1 gold would rub additional salt on his wound.</p><br/><p>“Alright. I’ll take that offer. How many bottle could you sell?” Snow Seeker was thinking much further than Humbly Gentleman was. Of course there was no doubt that the exploration team would require the potion to raid the dungeon. However, there were also normal players in their guild who could take the potion to raid the Hard or even Normal mode! A guild could have only a certain number of elites, not every player in an elite would be equally strong. The building blocks of a strong guild are the normal players. Without them, the few numbers of elite could not even make up a proper guild!</p><br/><p>“1 thousand, 10 thousand, you name it! I have it!” Zhang Yang replied.</p><br/><p>“Hahah! Looks like we’ve got ourselves a millionaire over here!” Snow Seeker had already forecasted the probability of his market value. Top guilds would only need this potion when they raid the Hardcore mode, but many regular players around could also buy this potion to raid Hard more or even Normal mode! It’s always better to use the potion since it could lower the difficulty of the dungeon and increase the success rate of conquering the dungeon!</p><br/><p>Furthermore, the item was not that expensive. It’s only 1 gold! That would only cost 7 dollars in the real world! You could even have the chance to get yourself a set equipment!</p><br/><p>Come on, bro! It’s a set equipment! The game’s first set equipment! You don’t have it? Well, you’re out then!</p><br/><p>Besides, normal players made up most of the game’s population! There are almost 40 million players in the entire game! The amount of the players have almost doubled since the server was initially launched! Just White Jade Castle alone had 500 thousand players occupying this city! If each player bought 1 bottle from him, he would have earned 500 thousand gold coins!</p><br/><p>One successfully dungeon raid would drop only 6 pieces of set equipment! In a 20-man party, you would need to raid at least 15 to 16 times to have everyone equipped with a full set of the equipment! To have that many potions would cost them at least 80 million gold coins!</p><br/><p>Holy smokes! If Snow Seeker did not calculate its probability, she would not have known its impending fortune! Even if the ratio dropped down to an exchange rate of 1:1, Zhang Yang would still earn at least 80 million dollar!</p><br/><p>Still, it was just her estimation, there were still other factors that might come into play. For example, the time taken to make a potion. There was a limit to how many Zhang Yang could produce.</p><br/><p>“*Ahem* So, I’ll send you 1 thousand bottles of [Beginner Anti-Shadow Potion], is that correct?”</p><br/><p>“Yes! I’ll pay by mail. Thank you for your hard work Guild master Zhan Yu!”</p><br/><p>“Thanks!”</p><br/><p>“Bye!”</p><br/><p>Humbly Gentleman, you son of a bitch, I’ll see to it that you’ll cry a river by the time you find out that you have been duped!</p><br/><p>Zhang Yang searched for another name and sent another private message.</p><br/><p>“Hello! Guildmaster Sky Shaman! Are you busy right now…?”</p><br/>\n</div>"}