{"title": "Chapter 82: Decide with a Battle!", "id": 82, "volume": 1, "url": "http://boxnovel.org/mmorpg-rebirth-of-the-legendary-guardian-chapter-82-decide-with-a-battle", "volume_title": "Volume 1", "body": "<h1>Chapter 82: Decide with a Battle!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 82: Decide with a Battle!</p><br/><p>Translator: Editor:</p><br/><p>“No!” Frost Night rejected Zhang Yang’s invitation outrightly.</p><br/><p>“But. If you defeat me in a battle, I’ll participate in just one raid!” she added after a little while.</p><br/><p>“Ok!” Zhang Yang nodded.</p><br/><p>‘Ding! Player Frost Night has sent a battle request (Brawl). Will you accept it?’</p><br/><p>Zhang Yang accepted the request and the system announced their fight on the arena announcement board.</p><br/><p>Room 179, Zhan Yu Versus Frost Night (Brawl). Battle starts in 5 minutes</p><br/><p>The arena got rowdy again. The crowd from the battle before had not yet dispersed after the match and had remained around the arena. They quickly noticed the announcement and the atmosphere that never had the chance to settle down quickly burst into an uproar again. On one side was the fresh, still unknown merciless challenger while on the other was the all-time people’s champion. Both had killed Ghostly Leaf with an extraordinary feats in their own right. To think that these two fighters would actually fight each other. This fight would be the battle of the ages to come.</p><br/><p>One by one, friends called on more friends, guild mates called on more guild mates to come over, and the events snowballed into chaos. In merely 3 minutes, room 179 was occupied with more than 10000 spectators! 5 minutes later, Frost Night and Zhang Yang was teleported in to the battle field.</p><br/><p>Count down start!</p><br/><p>5,4,3,2,1,0!</p><br/><p>Poof!</p><br/><p>Frost Night disappeared without a trace.</p><br/><p>Zhang Yang did not dare to lower his guard, even though her equipment was weaker and Ghostly Leaf, her skills were on a completely different level! Especially when she had the skill that could be consecutively used twice in a row.</p><br/><p>Outside the field, every spectator’s eyes were glued to field, paying close attention any sudden changes. Frost Night might appear anytime and kill Zhang Yang before he could even draw breath!</p><br/><p>The tension got more and more intense with each passing moment.</p><br/><p>Foosh!</p><br/><p>A shadowy figure appeared behind Zhang Yang and struck the back of his head! Simultaneously, Zhang Yang sword was already flying through the air and just as the back of the dagger made contact with his head, Zhang Yang’s sword struck Frost Night.</p><br/><p>“-387!”</p><br/><p>“!”</p><br/><p>Both of their attack seemed to have landed at the same time. Frost Night lost a huge portion of her HP while Zhang Yang was stunned for 4 seconds!</p><br/><p>A loud unison gasp could be heard from the audience.</p><br/><p>“These two players are hella strong!”</p><br/><p>“Damn! Zhan Yu could even detect a hidden Thief! What kind of force user is he?!”</p><br/><p>“Frost Night is considered as strong as he is, if she could even stun him!”</p><br/><p>“That weapon that Zhan Yu is holding must be some sort of high tier weapon. What else could explain the ridiculous damage done to Frost Night?”</p><br/><p>“I see your point there, fellow player. But Frost Night is now in a dangerous position. If she could not kill Zhan Yu in that 4 second opening, she would be in a huge disadvantage!”</p><br/><p>“Your argument is invalid my young apprentice. You seemed to ignored the law…”</p><br/><p>As the audience started to discuss among themselves, Frost Night kept calm and quickly consumed a health potion. She then raised her dagger and stabbed Zhang Yang’s back, the beginning a chain of damage. Each damage was not particularly high but her attacks were fast and continuous, the accumulated damage amounted to quite a bit!</p><br/><p>After 4 seconds, the stun was lifted, but before Zhang Yang could turn, Frost Night had landed a , knocking him out and stunned for 6 seconds.</p><br/><p>Zhang Yang is an armored class character. Furthermore, he had 20% damage reduction passive skill, his armor and defense was not something a Thief could compare to! Frost Night could deal more than 1300 damage to Ghostly Leaf, but when she faced Zhang Yang, she could only deal about 800 damage to him, that was only less than one third of Zhang Yang total HP!</p><br/><p>Frost Night still remained calm. The moment the 6 seconds’ stun ended, she quickly flicked her right arm and activate .</p><br/><p>Zhang Yang grinned. He slashed his sword horizontally and stomped the ground firmly at the place where Frost Night disappeared, casting and . Being damaged for 10 seconds without any opportunity to resist, Zhang Yang had generated more Rage than his gauge could hold in.</p><br/><p>“-765!”</p><br/><p>“-117!”</p><br/><p>Frost Night was forcefully broken out of her invisibility, her HP was emptied instantly. She surrendered.</p><br/><p>Shush! Two of them were teleported out of the field.</p><br/><p>“One more!” Frost Night sent a private message to Zhang Yang.</p><br/><p>“Oh. But if you lose, you owe me two raids now!” Zhang Yang laughed.</p><br/><p>“…..Fine!”</p><br/><p>After agreeing, the both of them entered the fight again and battled.</p><br/><p>In the second round, Frost Night learnt from her mistake. This time when 6 seconds’ stun was at its last second, she stopped attacking and immediately used to disappear.</p><br/><p>When he recovered from the stun effect he quickly headed to where she disappeared and ran around there. He slashed out and killed her again.</p><br/><p>“How did you find me!?” Frost Night had to ask.</p><br/><p>Zhang Yang had been fighting Bandits for at least 3 years, thus he had developed a kind of trick to locate a hidden Thief! The worse side effect of stealth was the movement speed reduction. Once you have turned invisible, your speed will be reduced by half. Once other had seen you disappear, they can easily locate your position quite fast.</p><br/><p>“Private and Confidential!”</p><br/><p>Frost Night grit her teeth furiously. “Tch! One day, I will defeat you!”</p><br/><p>Such strong determination! Zhang Yang laughed. “You cannot beat me! Your equipment is still too weak! Otherwise, you could have defeated me the first time when you had stunlocked me! Follow me into dungeons for a few times and you’ll get the equipment you need to defeat me!”</p><br/><p>Frost Night was speechless for a few moments. “I’ve lost two rounds. That’s two dungeons raid I owe you…Call me when you’re going for the dungeon!”</p><br/><p>She did not want to continue fighting Zhang Yang when she had roughly gauged the difference in equipment between the two of them.</p><br/><p>Zhang Yang smiled and sent a friend request.</p><br/><p>She did not reject nor accept it immediately, but instead replied with a question mark.</p><br/><p>“?”</p><br/><p>Zhang Yang explained. “Let’s just add each other, it’ll be easier for me to find you the next time!”</p><br/><p>Frost Night walked away without saying anything.</p><br/><p>Zhang Yang sighed. He thought that she would reject his request but eventually, he received a system notification.</p><br/><p>‘Ding! Player Frost Night has accepted your friendship request!”</p><br/><p>Nice! This girl is now in his hands! Just like a mice that entered the trap, she will not be able to escape from him now!</p><br/><p>Zhang Yang snickered like a fool who won a jackpot. After a while, he opened the guild window and wrote a new announcement: “There will raid for Marzerway’s Lair, Main Wing 2 days from now. The raiding party will have the following fixed members: Zhan Yu, Drizzler, Little Snow, Slim and Handsome, Hundred Shots. The party requires the following character class: 1 Tanker, 3 Healer, 11 Attacker. Whoever who could reach level 20 by the day after tomorrow and wishes to participate in the exploration party could register their names as such. Tankers report to Zhan Yu, Healers report to Little Snow, Attackers report to Drizzler, Slim and Handsome, and Hundred Shots. Registered players will be narrowed down and only the best will be chosen to participate.”</p><br/><p>Excitement filled the guild once Zhang Yang posted the new announcement on the guild notice. Everyone wanted to joined the expedition, sure of themselves to conquer the dungeon once their submissions were accepted.</p><br/><p>“Haha! Good luck, and train faster, guys!” Zhang Yang posted in the guild channel and went to the Desolated Ghostly Flatland to grind his level.</p><br/><p>In his bag, there was the unusable Skeleton Warhorse. It could be used only when Zhang Yang reaches level 30. That was why he wanted to grind as fast as he can. Imagine what kind of reaction will he garner when he takes a stroll around White Jade City with that horse.</p><br/><p>“What a pity…if only I could sell this off…” Zhang Yang mused.</p><br/><p>If only he could take the horse up to the auction house and sell it off, he would be literally killed by the hands of Little Snow and Drizzler!</p><br/><p>Zhang Yang spent the entire day just to grind, grind, and grind. Nothing else. To gain one level after level 20 is truly terrifying. If he were put everything he had just into grinding, he would need two days or so to gain one level! By the time, Zhang Yang logged off to have his dinner, he was only at level 23, with 42% Experience points in the progress bar.</p><br/><p>After his dinner, Zhang Yang spent some time on the internet and hang out at the forums. He found out that the Ghostly Leaf case had been a heated topic in the forums since morning. Some said that he wanted to be a lone hero, to try to fight for glory of being able to kill every single player in the city alone! While some were explaining his behavior, others were busy throwing insults and flaming his actions. Why would he travel all the way to White Jade Castle to fight? Has he already fought all and won every one there in Crimson Moon City? If that was the case, him being defeated would mean there are no strong players in Crimson Moon City!</p><br/><p>There were players who supported him, but the odds were overwhelming.</p><br/><p>Zhang Yang had a good laughed and logged back into the game. Zhang Yang, Little Snow, Drizzeler, Fatty Han, and Hundred Shots each led a team to raid Bangar Crypt. Once they were done with that, Zhang Yang summoned the 5 of them to the battle arena for PK training. There, he found out that besides Fatty Han, the rest of the party were quite skillful in fighting players. They could be even stronger with more training. Fatty Han however, was completely oblivious in PK style of fighting. He only knew how to attack without the sense of moving his position, like a human turret. Hunter is a ranged character, he would need to maintain a certain distance between the target to allow maximum attacking potential. This common knowledge was not in Fatty Han’s mind when he attacked like a fixed machine gun. Even though he knew how to utilized he did not fully utilize the skill’s slowing effect to ran away from the target.</p><br/><p>Once cornered, a Hunter would be completely useless.</p><br/><p>Zhang Yang tirelessly adviced Fatty Han to keep his distance, to be light on his feet, and to move dynamically. But what entered from the right ear will smoothly flows out from the left ears like a good beer bong. Fatty Han could not follow his orders properly nor remember the fighting tactic! Zhang Yang was at a loss. He did not know what else to do! It was him that suggested Fatty Han start off as a Hunter because he knew very well that Fatty Han would never excel in PK!</p><br/><p>A diamond cannot shine without polishing. But no matter how much effort you put in polishing a brick, it would never shine bright like a diamond!</p><br/><p>This fat f*ck could only raid dungeons and not participate in any battle arena fights. Zhang Yang could not involve him in any future Professional League competition!</p><br/><p>Zhang Yang really wanted to drag this brother to join the competition but a Professional League needed a team, and the team need to cooperate perfectly to win any fights. Zhang Yang could not be selfish and include a liability like Fatty Han in the team, which would lead to the team’s demise. Sigh!</p><br/><p>After the day was over, Lone Desert Smoke’s experience point had reached 42%, and at this rate, it would take just another 4 to 5 days’ time to reach the maximum experience point.</p><br/><p>For the next following 2 days, Zhang Yang was only busy collecting herbs, selling shields, buying stacks of minerals plates from Mining Specialist, and leveling up his Smithing mastery. Two nights later, 15th of July, 15 days after the launching of the game, Lone Desert Smoke had produced 24 Level 20 players! Zhang Yang himself had reached level 24 with 47% experience points!</p><br/><p>Now that it’s time to do the party member selections, Zhang Yang and the 4 of them chose the party members carefully. However, truthfully speaking, it was not a selection, but to find 5 members to remove from the team since they needed to leave one spot open for Frost Night. Once they were done with the team organization, Zhang Yang ordered everyone to log out earlier today and have a good night rest. The upcoming battle would be most arduous.</p><br/><p>Zhang Yang sent a private message to Frost Night before he logged out.</p><br/><p>“Hey, we are going to raid Marzerway’s Lair Main Wing tomorrow morning 9am. Don’t forget to gather at Snow Sprite City dungeon entrance!”</p><br/><p>“Noted. I’ll take a work leave tomorrow!”</p><br/><p>Requesting a leave just for the sake of gaming, 1much determination, very gamer, so Frost Night.</p><br/><p>TL note:</p><br/><p>1Doge meme which is rather prevalent on the internet, involves a shiba inu’s adorable face along with captions in fragmented sentences such as “Much wow, so woof.” etc.</p><br/>\n</div>"}