{"title": "Chapter 92: Multimillionaire", "id": 92, "volume": 1, "url": "http://boxnovel.org/mmorpg-rebirth-of-the-legendary-guardian-chapter-92-multimillionaire", "volume_title": "Volume 1", "body": "<h1>Chapter 92: Multimillionaire</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 92: Multimillionaire</p><br/><p>Translator: Editor:</p><br/><p>They arrived at the Cave of Bones in the Desolated Ghostly Flatlands three days later.</p><br/><p>“Hey, Idiot Zhan Yu, share the profits with me!” Little Snow put both her hands on her waist, revealing more of her bosoms. Drizzler calmed her down immediately.</p><br/><p>“Little Snow, please be a gentlewoman! Be a gentlewoman!”</p><br/><p>While making the medicine, Zhang Yang looked up and had a glance of her “assets”. In his mind, he had a thought that time is like a woman’s cleavage; it will appear once squeezed! We against the time, so we have to hurry. We’re going to need to squeeze out more like Little Snow’s cleavage to have enough!</p><br/><p>Little Snow caught Zhang Yang looking, and she chuckled while saying, “Is it that nice to look at?”</p><br/><p>“Yeah… perfectly rounded, crystal clear and very attractive!” Zhang Yang replied with compliments.</p><br/><p>“Pervert!” Drizzler despised Zhang Yang for saying such things, but she enviously gazed at Little Snow’s bosoms too.</p><br/><p>Zhang Yang laughed and said, “I was talking about her eyes!”</p><br/><p>“Hey, idiot! Don’t try to change the topic! Hurry up and share the profits with me! I looted that Alchemy recipe; the ‘Great Lucky Hands’!”</p><br/><p>Little Snow and Drizzler knew that the [Beginner Anti-Shadow Potion] was massively sold in the market these few days were the ones made by Zhang Yang. Being a money grubber and having recalled that she gave the recipe to him, Little Snow felt a deep sense of grief.</p><br/><p>“Alright, here’s a reward from me, then!” Zhang Yang traded 54 silver coins to her.</p><br/><p>“Damn you, Zhan Yu! Are you trying to challenge me?!” Little Snow hummed. She scammed him of 54 gold coins before; what a stingy guy!</p><br/><p>“To be honest, Zhan Yu really picked up a goldmine this time!” Hundred Shots smiled broadly. From his expression, he showed how happy he was for Zhang Yang without any sense of jealousy in mind.</p><br/><p>Drizzler could not help but to ask, “Noob tank, how much gold coins have you actually earned?”</p><br/><p>Zhang Yang did not want to hide from them and gave his honest answer. “It wasn’t selling well for the past few days, but it started selling out two days ago and after deducting the profit sharing and commissions, I could earn 300,000 gold coins in a day!” With the majority of normal players rushing to Level 20, Zhang Yang’s asset greatly rose to 6 million in just these three days.</p><br/><p>“According to my calculations, before most players could even achieve Level 30, this idiot here could earn nearly 40 million!” Little Snow was quite shocked as it was not a small amount for her; even more so having earned it within a month!</p><br/><p>At this point, even Fatty Han could not help to speak out despite being quite the quiet one in front of a crowd, “Lovely Little Snow, why don’t you follow our Little Yang and be the wife of a multimillionaire?”</p><br/><p>But Fatty Han earned some from it as well. With Zhang Yang having seven “distributor” friends and Fatty being his best friend, how could Zhang Yang not share the profit with him? Half of the overall amount of medicine were sold in White Jade Castle and the other half in the other seven main cities, and they shared 10 percent of the profit. Fatty earned the most as he had a net profit of nearly 50,000 gold coins within these three days, equaling to 300,000 to 400,000 dollars!</p><br/><p>“Tch!” Drizzler immediately pursed her lips with utter disdain. “40 million is just a small amount. My cousin’s assets are-”</p><br/><p>“Drizzler!” Little Snow chided loudly before Drilzler continued talking loudly.</p><br/><p>Though they did not get to know how much her assets were worth, they could guess from Drizzler’s tone that it would definitely be more than 40 million; far more than 40 million!</p><br/><p>Zhang Yang’s curiosity increased and wondered, didn’t I meet another person like Lin Yu with hundreds of millions worth of assets, being a daughter of a rich family as well?</p><br/><p>“Idiot Zhan Yu, the profit sharing is not necessary now but you have to treat me a meal!” Little Snow was still unwilling to forgive him.</p><br/><p>“Good! Treat us a meal!” Drizzler’s eyes shone.</p><br/><p>Zhang Yang was left helpless. These cousins could be filthy rich, but they’re still trying to swindle money out of me? Aren’t these money-grubbers being a little too stingy?</p><br/><p>“Fine, where shall we eat?” Zhang Yang just simply promised them. Even though the money was important, he realized that adequate relaxation was necessary, not to overwork himself. There would definitely be more business opportunities in ‘God’s Miracle’ in the future.</p><br/><p>“Blue Sky Pub!”</p><br/><p>Zhang Yang frowned. “Pub?”</p><br/><p>“Why? What’s the problem with that place?” Little Snow’s beautiful eyes widened.</p><br/><p>“Nothing. I just never thought you ladies would like going to pubs!”</p><br/><p>“Hehe!” Drizzler smiled and interrupted. “Actually, I’m the one who wants to witness a pub! But we heard that a pub is not safe at times, so we want you, the strong young man, to bring us there!”</p><br/><p>“Aren’t you afraid that I could be a bad guy?”</p><br/><p>“After a few days of observation, Little Snow and I decided that you’re reliable, and not despicable and rotten to the core like some Fatty!” Drizzler blurted out, completely disregarding if Fatty was even there or not.</p><br/><p>Fatty Han suddenly cried out, throwing himself to Zhang Yang’s leg and said, “Little Yang, you’re the one who led me astray! When we were four years old, you brought me into those female bathing rooms and my boner was as hard as a rock looking at those aunties! My God!”</p><br/><p>Hundred Shots shot his arrow aside, laughed maniacally and said, “Fatty, I never thought that you’d have such a tragic life experience!”</p><br/><p>“Fatty Shit, I warn you! You’re not allowed to talk dirty in front of Drizzler anymore!” Little Snow was very serious about this.</p><br/><p>Zhang Yang shook his head. “Children nowadays have been corrupted by bad examples on the internet even before we do. What things are there that they do not understand?”</p><br/><p>“Hmph, he’s still not allowed to talk dirty!” Little Snow said arrogantly.</p><br/><p>Drizzler stood behind Little Snow and responded, “Yes, that’s right and you guys should not pollute a clean and pure soul!”</p><br/><p>“Hey, I’ve been feeling that something’s not right here!” Zhang Yang suddenly said.</p><br/><p>“Is there something not right?”</p><br/><p>“How many of us are here actually?”</p><br/><p>“Five!”</p><br/><p>“Wrong, it’s six!”</p><br/><p>Zhang Yang and the four of them looked at the sixth person simultaneously; Frost Night. This cool woman kept her mouth shut, being stern and not bothered about their talking or joking around. However, she was not distrusted by them and cruelly killed the monsters which then scattered to pieces.</p><br/><p>“Noob tank. She’s really not an NPC?” Drizzler gazed in awe at Frost Night’s back, because she herself could die if she did not speak for a long time!</p><br/><p>“No, she’s not, and she’s just a little cool, okay?”</p><br/><p>“Tch, she still looks like an NPC, regardless. Other than that, she could be a robot! Beep boop. I am robot No. 6870. Requesting orders.” Drizzler imitated the tone of a robot and spoke word for word.</p><br/><p>Zhang Yang laughed, turned around and said, “Robot No. 68\\0, come massage your master’s back!”</p><br/><p>“Go to hell!”</p><br/><p>“By the way, what time are we going to the pub?”</p><br/><p>“We’ll go after killing Marzerway!”</p><br/><p>“Too bad I can’t join since I can’t come over from Yanjing!” Hundred Shots regrettably said.</p><br/><p>Fatty Han tapped on Hundred Shots’ shoulder, “Haha! Hundred Shots, you already have a wife and son and you still want to court a lonely young woman in a pub? Harmony is important!”</p><br/><p>In the midst of talking and laughing, they carried forward the fight. Zhang Yang continued to make the medicine while the rest were left to kill the monsters. He would only stop making medicine if he had to perform his role as a tank when facing a boss. They were fortunate enough after successfully after defeating all four stages of bosses to get a [Transform Hat] and a scroll!</p><br/><p>[Magic Scroll: Weakness (Level 1)]</p><br/><p>Use: Use [Weakness (Level 1)] on target, causing the target’s damage and healing effects to be reduced by 10% and lasts for 60 seconds. This effect cannot be stacked together with any other similar type of effects. The bigger the gap between your level and target’s level, the higher the failure rate of this magic effect.</p><br/><p>Level Requirement: 20</p><br/><p>This is a good item! Zhang Yang praised the item in his heart and kept it into his inventory.</p><br/><p>After killing Shurian, the team looted a [Chaos Gem] and Zhang Yang successfully obtained it with 99 points from the dice roll. After using the gem, his inventory space was extended by 50 slots, slightly relieving his worry for inventory spaces.</p><br/><p>‘Server announcement: Sword and Fire Mercenary successfully broke the new ranking of Fastest Marzerway’s Lair, Front Wing (Hardcore mode) Clearance. This glorious achievement will be recorded in the Fastest Hardcore Clearance Ranking Board (China Server) and please congratulate them!’</p><br/><p>‘Server announcement: Player Dominating Blade (Party Leader) broke the new ranking of Fastest Marzerway’s Lair, Front Wing (Hardcore mode) Clearance. Obtained 10 gold coins, 1 piece of [Level 2 Gemstone] and 250 Reputation Points across all races in the league are awarded from the system reward!’</p><br/><p>‘Server announcement: Player 44 Bandit (Party Member) broke the new ranking…’</p><br/><p>At that moment, the world channel was once again filled nonstop with the server announcement’s red texts!</p><br/><p>Drizzler stuck her tongue out and said, “Sword and Fire Mercenary, they’re so powerful!”</p><br/><p>Hundred Shots looked to Zhang Yang, “Their result was 17 minutes and 34 seconds! What do you think about their speed?”</p><br/><p>Zhang Yang gently frowned. The duration set by the system for the Fastest Hardcore Mode Clearance was 220 minutes. Even if the “Trash” mercenaries shortened the duration record by 2 minutes, under the limited situations, it was still commendable if anyone could take it down even a second further!</p><br/><p>They were indeed the famous team in the previous life! They almost took up all the 5-man and 10-man dungeons’ First Clear Achievement. If it were not for having insufficient manpower, they would have taken up the 20-man and 50-man dungeons’ First Clear Achievement as well! In this life, Zhang Yang foresaw this predicament and grabbed all the current First Clear Achievement for the dungeons, which led the elite team to begin raiding the dungeons for the Fastest Clear Achievement!</p><br/><p>“It’s still okay!” Zhang Yang nodded his head and said, “If we’ve prepared sufficiently and adjusted our class’ positions wisely, I bet we can make it under 15 minutes!”</p><br/><p>‘Server announcement: Sword and Fire Mercenary successfully broke the new ranking of Fastest Marzerway’s Lair, Middle Wing (Hardcore mode) Clearance. This glorious achievement will be recorded in the Fastest Hardcore Clearance Ranking Board (China Server) and please congratulate them!’</p><br/><p>‘Server announcement: Player Floating Up (Party Leader) broke the new ranking of Fastest Marzerway’s Lair, Middle Wing (Hardcore mode) Clearance. Obtained 10 Gold Coins, 1 piece of [Level 2 Gemstone] and 250 Reputation points across all races in the league are awarded from the system reward!’</p><br/><p>‘…’</p><br/><p>In another few minutes, the world channel began to fill up once again with the server announcement’s red texts!</p><br/><p>“Now they’re the opponents!” Hundred Shots gasped in shock.</p><br/><p>Zhang Yang frowned once more. Lone Desert Smoke was definitely stronger than Sword and Fire Mercenary in terms of capability for the 5-man team, but they had ten members who were able to fight, and Lone Desert Smoke could not be stronger than them in terms of teamwork strength! Aside from that, Zhang Yang only had six members including Frost Night and still lacked four more members that were able to fight!</p><br/><p>Another two Level 30 dungeons were 10-man dungeons and the current situations was against their odds! Besides, the bosses in those dungeons were different from Marzerway, not being able to be killed by any particular items or medicines only and the players would need to kill the boss “fairly”!</p><br/><p>The competitive pressure suddenly grew!</p><br/>\n</div>"}