{"title": "Chapter 91: Hot Sales", "id": 91, "volume": 1, "url": "http://boxnovel.org/mmorpg-rebirth-of-the-legendary-guardian-chapter-91-hot-sales", "volume_title": "Volume 1", "body": "<h1>Chapter 91: Hot Sales</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 91: Hot Sales</p><br/><p>Translator: Editor:</p><br/><p>“Zhang Yang! I’ve sold all the potions you gave me! Out of the 100 stacks you gave me, I tried selling them at different prices. 6 stacks were sold at 1 gold coins. 3 stacks were sold at 2 gold each, 4 stacks were sold at 3 gold coins each, and most of the potions were sold for 4 gold coins each! I manage to sell only a few bottles for 5 gold each but the number was negligible. Looks like the current market would only be willing to buy the potions for 4 gold coins each! Either way, the total profit was 6714 gold! Motherf*cker, the auction house 10% service charge is just shitty as hell! Anyway, I followed your instructions and used 100 gold coins to buy [Brassica Weed] and [Ginkgo Flowers]. I’ve taken my part of the profit and have already mailed the rest of the money and ingredients to you!”</p><br/><p>“Haha! Zhang Yang! Guess how many potions I managed to sell today? All! All of them I’m telling you! God! I’d never thought that this potion can be so popular! I’d even received a guild invitation from Iron Blood guild officer! They said they would provide me a slot for their exploration party only if I could provide a steady supply of the potion!”</p><br/><p>“F*ck! Zhang Yang, everything is on you the next time we meet! That potion is selling like hotcakes! There were so many guild masters messaging me privately, asking for potions in bulk!”</p><br/><p>“Zhang Yang…”</p><br/><p>Zhang Yang had received the money and ingredient from every distributor he had assigned. For that one night alone, the sales of the potion was as he predicted. Still, the main purchasing customers were all mainly from big and medium sized guilds. Majority of the players did not buy much since most of them were still oblivious about the nature dungeon they were bound to face!</p><br/><p>After deducting 100 gold from each city distributor for ingredient’s purchasing, Zhang Yang had calculated that he would have amassed a total of 48000 gold coins. Add that number with the 50000 gold he had obtained that morning, he would have came close to 100000 gold coins!</p><br/><p>The current exchange rate was 1 gold coins to 7 dollars, which means his current savings had reached almost 700000 dollars! Even though the 50000 gold coins he earn was an extra bonus, he could earn even more when the majority of the casual players begins raiding Marzerway’s Lair.</p><br/><p>The first step was a complete success!</p><br/><p>However, it was far from his end-term goal of becoming a billionaire! Luckily, he still had a lot more time to work on it as the market was filled with more chances in the future! It all depended on him making the effort to grab the opportunity!</p><br/><p>Zhang Yang had a total of 1400 stacks of potions and today, he had sold more than 800 bottles and sent 500 stacks to his distributors, leaving him with very little stock. He had to start making more!</p><br/><p>It takes only 1 second to make one bottle of potion. He could make 60 bottles in 1 minute, which meant only 3600 bottles in an hour. That’s only 180 stacks! When he levels up his crafting level from Beginner to Amateur, the time to make a potion would be reduced by half! Zhang Yang started making potions at 10pm and made 200 stacks of potions for the remaining distributors to sell. After making potions for another hour, Zhang Yang could no longer endure his fatigue any longer and decided to log out and get some sleep.</p><br/><p>On his bed, Zhang Yang thought that if he does not sleep and continued to make more potions for the entire night, he could have crafted more than 4000 stacks of potion in a day. This would raise his profit to the roof! Even though 4000 stacks seems a lot, it was only a total of 80000 bottles of potion, this number would only satisfy White Jade City alone in a time of such a sales boom!</p><br/><p>Besides, he could not possibly spend the entire day solely on making potion! He needed to make sure he still had time to grind his level as well!</p><br/><p>There was a method to help him solve his problem, and that was to raise his Alchemy to Advanced. When a player’s Alchemy skill reaches the Advanced level, he could synthesize higher-leveled items and also able to make two items simultaneously!</p><br/><p>When the player’s crafting skill reaches Professional tier, he could make 4 items at the same time. Specialists could make 6, a Master could make 8, and the Grandmasters could make 10 items in the same time!</p><br/><p>So far, it was impossible to reach Professional-tier since there were no high-leveled item recipes in the market. However, there were Amateur-tiered recipes being sold in the auction house at the moment! Still, there was another problem. The ingredients required to craft any Amateur level recipe item are much more expensive and rare than a Beginner level recipe item. It’s extremely arduous to raise 1000 mastery point in order to increase his skill level!</p><br/><p>Tomorrow, he would buy himself an Amateur-tiered recipe and focus fully on raising his skill level to Advanced! The clock is ticking, and every single second meant money!</p><br/><p>After sleeping through the night, Zhang Yang finally caved in and skipped his morning exercise to saving precious time. He wolfed down his breakfast and logged into the game. At his current level, every second was one bottle of potion and that was worth at least 4 dollars and 28 cents, he could not afford to let that fly!</p><br/><p>The moment his character spawned in the city, he quickly ran to the auction house and bought 3 types of Amateur-tiered recipe, retrieved the items at the mailbox, and searched for their ingredients. The 3 recipes were as such - Level 2 Healing Potion, Level 2 Magic Potion, and Level 2 Strength Potion. The ingredients he required were Lily Grass, White Apricot, Vanilla Grass, Love Vine, and Rainbow Orchid.</p><br/><p>Zhang Yang search for them one at a time and found out that they were being sold on the auction house but the amount was only a handful, and at a high price too. Zhang Yang wavered for an instance, before steeling himself and emptying the auction house. He went over to the Alchemy Shop and bought a bunch of empty bottles and started to make potions. At a bottle per second, he used up all of the ingredients to make about 200 bottles of potions! He was still lacking about 800 mastery points to reach Advance-tier!</p><br/><p>Zhang Yang opened his friend list and only 3 out of 6 of his distributors were online. (Yu Li was not in the list)</p><br/><p>He quickly sent each of them a private message asking them to buy the 5 ingredients that he needed and to mail them back to him as soon as possible.</p><br/><p>While they were busy searching for ingredients, he did not waste any time and started to make [Beginner Anti-Shadow Potion]. After 40 minutes, a mail notification ranged and Zhang Yang quickly retrieved the mail, collecting all ingredients and making more potions to increase his mastery. Half an hour later, he had again used all the ingredient and made about 700 bottles of potion! He was only a few steps away from becoming an Advance-tier in Alchemy!</p><br/><p>Another distributor logged in in the nick of time and Zhang Yang quickly repeated his request. After an hour so or, he managed to raise his mastery and became an Advanced-level Alchemist!</p><br/><p>Soon after, Drizzler and the “gang” logged in. Zhang Yang immediately called out to them and asked them to raid dungeons with Ironhills as the tanker. He was too busy making potions to join them!</p><br/><p>There was a problem. Everyone was quite used to having Zhang Yang as their main tank, and so, they encountered some problems with Ironhills tanking. He’d sometimes loses aggro and the worst case scenarios included total party wipeouts. Little Snow made the mistake assuming that Ironhills was as good as Zhang Yang, not healing Ironhills as often as needed. It appears that Ironhills wasn’t made of iron and crumbled to the ground repeatedly.</p><br/><p>Everyone did not have the guts to criticize Ironhills, but vented their frustrations on Zhang Yang instead. After fighting as hard as they can, they had only managed to successfully raid two dungeons by 1pm. Everyone was already worn out from the strenuous overexertion.</p><br/><p>After everyone took a breather and Fatty Han had his lunch, Zhang Yang quickly tugged the latter aside.. First, he gave him 100 stacks of [Beginner Anti-Shadow Potion] to sell them off. Next, he asked him to help him earn combat experience. Zhang Yang would only need to be in the same field making potions, while Fatty Han would kill monsters, sharing the experience points with him.</p><br/><p>Fatty Han did no mind to help him at all! It was not because he was earning money from Zhang Yang. Even if there was no benefit in helping Zhang Yang, Fatty Han would still help him out as a brother-in-arms!</p><br/><p>As the day ended, Zhang Yang had reached level 25 with 22% experience point, approximately 30% less than he would normally gain by himself.</p><br/><p>Although he was losing out in terms of leveling, the same could not be said fortune-wise. Despite his diminished speed of leveling, Zhang Yang managed to make 4500 stacks of [Beginner Anti-Shadow Potion] when the time was already 11pm. He distributed them to his distributor evenly soon after.</p><br/><p>Ever since the sales of yesterday’s potion, the market demand had increased significantly. All 8 main cities had bought a total of 250 stacks today. Zhang Yang predicted that within the next 3 days, mainstream players would have surpassed the level 20 bracket and the demand for [Beginner Anti-Shadow Potion] would be bound to increase even moreso!</p><br/><p>The Main Wing dungeon boss would respawn soon. However, on that particular day, Frost Night would be busy with her day job, as are most of the casual guild members. Zhang Yang would have to postpone the dungeon raid and have it later on that night.</p><br/><p>When the “gang” finally knew that Zhang Yang had been busy making potions for the past few day, they voluntarily offered their help to raise his level while he made more potions. They first went to Cave of Bones and then massacred the Desolated Ghostly Flatlands. Zhang Yang would only need to help out when they were fighting the boss. At other times, he could fully concentrate on making potions while the party ran around killing monsters for him.</p><br/><p>This time, they were lucky enough to obtain a Shape Shifting hat. The little brat claimed the item for herself as she insisted on playing with it. The moment she got hold of it, she changed into a tiger, and then a scorpion, scurrying around happily.</p><br/><p>At the end of the day, Zhang Yang’s experience bar rose from 22% to 65%. It was still slower than his own speed, but adequate enough. When night time fell, Zhang Yang gathered 20 players and raided Marzerway’s Lair in Hardcore Mode. After suffering defeat twice in a row, Zhang Yang finally used a magic scroll to boost the party’s attack power! Only then, did the party successfully take down Marzerway! However, Zhang Yang strongly believed that after the third attempt at farming equipment, the ranged attackers would have an attack upgrade, rendering the scroll unnecessary!</p><br/><p>This time, Marzerway was kind enough to warriors! He dropped two warrior equipment - boots and helmet. Since Drizzler had the boots, she only took the helmet. Only one more piece was needed to trigger the first set effect!</p><br/><p>[Brave Boots] (Gray-Silver, Heavy Armor)</p><br/><p>Defense: +12</p><br/><p>Vitality: +24</p><br/><p>Strength: +12</p><br/><p>Dexterity: +4</p><br/><p>Level requirement: 20</p><br/><p>Bravery effect (1/5):</p><br/><p>3 set effect: Every time you received an attack, there will be a 50% chance to heal 100 HP.</p><br/><p>5 set effect: All damage output increases by 10%</p><br/><p>After Zhang Yang equipped the boots, he quickly used the “Indian God Oil” on the boots and increased its movement speed by 5%.</p><br/><p>At the end of the day, most of the casual player had reached level 20 and were starting to make their way to the Front Wing and Middle Wing of Marzerway’s Lair. The scramble for the first set equipment was just beginning! The demand for [Beginner Anti-Shadow Potion] was rising up like Jack’s beanstalk, beyond the clouds, beyond Zhang Yang’s own production capacity! Zhang Yang hated himself for not being able to learn the “Shadow Clone Ninjitsu”. There was no way for him alone to create a supply for this overwhelming demand!</p><br/><p>On the other hand, the ingredients for the [Beginner Anti-Shadow Potion] was revealed to the public, causing the respective ingredients to rise in value. Before the uprising, the price of each stack was only 20 silver. Now it had risen to 10 gold coins per stack! However, these two herbs were considered to be extremely common. There were too many of them all around the market. Zhang Yang could lower the price by lowering the demand. His manipulation eventually dropped the prices down to 3 gold coins a stack.</p><br/><p>The players who earned their gold coins through herbs made quite a substantial amount of profit. But their earnings would not even come close to Zhang Yang’s. If they were make comparisons, Zhang Yang earning would be like the economy of the entirety of China while those herb sellers would be akin to roadside peddlers.</p><br/><p>The herbs Fatty Han had stockpiled long ago was finally making use of itself! He had spent a small fortune buying those herbs. However, with the movement of prices in consideration, it was well worth the investment.</p><br/><p>Zhang Yang worked on overdrive and managed squeeze out 5000 stacks of [Beginner Anti-Shadow Potion]. With the rising cost of production, Zhang Yang was still capable of making around 300000 gold coins a day, which was equivalent of 2 million dollars!</p><br/><p>This period of gold falling from the skies would probably last for another 20 days. 20 days would be enough for Zhang Yang to become a multibillionaire!</p><br/>\n</div>"}