{"title": "Chapter 122: Ron Weasley", "id": 122, "volume": 2, "url": "http://boxnovel.org/mmorpg-rebirth-of-the-legendary-guardian-chapter-122-ron-weasley", "volume_title": "Volume 2", "body": "<h1>Chapter 122: Ron Weasley</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 122: Ron Weasley</p><br/><p>Translator: EndlessFantasy Translation Editor:</p><br/><p>“Damn it, I was still wondering, after 5 floors of battle, there’s still no sign of any boss. So it was Zhan Yu, that little brat who is one step ahead of us!” Humbly Gentleman spoke out with anger, tightening his teeth. His hatred towards Zhang Yang had not been just for one or two days; and now he got fooled by Zhang Yang without knowing again. He was about to burst into flame, out of his own anger!</p><br/><p>“No wonder the Lone Desert Smoke members went offline already. It seems like they have already sent a part of them ahead of us!” Humbly Gentleman tried to provoke the other two guilds to channel their hatred towards Zhang Yang, with the thoughts to crush Lone Desert Smoke to the ground by having the 3 guilds to work together.</p><br/><p>But, Snow Seeker smiled gently and said, “Getting the field bosses has been a first-come-first-serve basis for all of us! It all depends on our own capabilities on whether we get to them first or not, so what’s with all the angry ranting, Humbly Gentleman?”</p><br/><p>Sky Shaman laughed with contempt, “This hypocrite is just greedy and stingy, only having thoughts about having all the good things to himself. Pui! And he does not even reflect on his own bad virtue!”</p><br/><p>With two of them criticizing him to the point that his face turned greenish, he spoke with his gloomy face, “So we just sit by and let the Lone Desert Smoke claim the [Land Lease], and then we congratulate them with smiles on our faces?”</p><br/><p>Snow Seeker smiled again and said, “I already said it, field bosses are claimed by those who acted faster the others. So we will never know the results until the very last moment of it. Things might still change! So now, we shouldn’t take arms against each other, because what we should be doing is to work together to speed up our progress down this tower without any restrain!”</p><br/><p>“Haha, guild master Snow is really fast in basically everything!” Humbly Gentleman spoke and took a peek at Snow Seeker’s pretty face and her mountain-shaped boobs, secretly drooling. Previously in other games, there were offline competitions held, and that was how he had the honor to see her true person, which was both beautiful and sexy. He already accumulated his bad intentions towards her for quite some time, but it was a pity. No matter how he tried to serve or impress her, she just did not react to him!</p><br/><p>With wrinkled eye brows, Sky Shaman said, “We should be well aware of the situation when it involves the Lone Desert Smoke! Other than Zhan Yu, the capable ones are Little Snow and the gang; only 5 of them altogether! We know that all 5 of them are offline at this very moment, and the number of remaining scattered members of the Lone Desert Smoke does not exceed 300! But, we do know that these 300 members are held up in the 3rd and the 4th floor!”</p><br/><p>With a slight idea on her mind, she asked, “Sky Shaman, are you saying that Zhan Yu is now alone?”</p><br/><p>“If the Lone Desert Smoke did not keep any secret units from our knowledge, I am afraid so!” Sky Shaman nodded his head.</p><br/><p>*gasp!*</p><br/><p>The people who were listening to the 3 guild masters talking could not help themselves but to take in a breath of surprise! They have certainly experienced it, the might of the monsters in the Underground Tower, every one of them are strong as f**k that the players had difficulties in holding their souls together in one piece!</p><br/><p>If Zhan Yu could clear through the path all by himself… Let alone clearing the regular monsters has already proven him to be unimaginably strong, what about the bosses?</p><br/><p>Is the gap between the two sides in terms of their strength really that wide?</p><br/><p>…</p><br/><p>On the other side of the tower, the Sword and Fire Mercenary had fully dispatched their forces into their crusade in regards of the [Land Lease]. They assembled a party of 10 for their storm fortification strategies. Although they were small in numbers, but every single member was an ace of their own expertise. They were like a sharp spear; unstoppable, clearing all their way through to the 7th floor of the Underground Tower, being more efficient than the 3 main guilds combined.</p><br/><p>The moment they knew about the announcement, Dominating Blade paused and said, “This Zhan Yu is far more powerful than we can imagine!”</p><br/><p>“44 Bandit and I are the first group to reach, so we can guarantee that none of the monsters in the tower had been slain! That meant that Zhan Yu has forcefully charged through the herd by taking advantage of the special particularity of the entrance, without taking out any monsters. He turned the table around by using these monsters to block players who are coming in!” Floating Up analyzed seriously.</p><br/><p>“But this also explains that -”</p><br/><p>“He is definitely alone!”</p><br/><p>Dominating Blade and Floating Up spoke in unison.</p><br/><p>“44 Bandits, Not Telling My Name, you two get past through quietly and do a sneak up on Zhan Yu, take him out! The [Land Lease] can only be claimed by us, the Sword and Fire Mercenary!” Dominating Blade spoke with extreme domineering!</p><br/><p>44 Bandits and Not Telling My Name were both Thief class players. With , they could easily get through the monsters without laying a finger on them. Monsters with “True Eyes” were only located in the 1st and 2nd floors!</p><br/><p>“Yes!”</p><br/><p>The two thieves then instantly immersed themselves into stealth mode at the same moment, and slowly fumbled forward.</p><br/><p>…</p><br/><p>“Ah, ha! Another living material to be used as a test subject! Master Terpot Ryhar will definitely be pleased!” Weasley had a vast aggro radius. He instantly spotted Zhang Yang charging towards him from afar. Swoosh! He pulled his huge sword and started waving towards Zhang Yang with the attempt to hack Zhang Yang in half!</p><br/><p>!</p><br/><p>‘-195!’ ‘The block has neutralized some of the damages.’</p><br/><p>With the shield raised up high and coming in contact, clashing with the huge sword that the boss swung towards him, a burst of fiery stars flashed on sight.</p><br/><p>“Oh sh*t, son of a boss, just give up on the futile struggle! Just lay out your neck and be ready to die!” Zhang Yang laughed happily. Instead of being bored by himself, why not tease the boss and have fun? With his brain waves surging, he even summoned out his servant Clear Lotus, launching his attacks towards Weasley.</p><br/><p>Unlike players, a boss had a specific time of discharging skills, beginning with the simplest normal attacks.</p><br/><p>97%, 94%, 91%, the HP bar of Weasley was decreasing slowly.</p><br/><p>“Ouh…!” the boss suddenly let out a burst of roar. After a swing that missed his target, Weasley held his sword with his other hand and plunged it straight into the ground.</p><br/><p>Boom!</p><br/><p>A black light suddenly started to spread in all directions. At least a 3 meter radius of the area where the boss was standing was instantly turned into an atmosphere glowing with only darkness!</p><br/><p>‘Ding! You have received the Plaque of the Undead effect, movement speed has been decreased by 50%, receive 500 damage from dark-shadow effect every 2 seconds, last until you leave the effective range of the Plaque of Undead!’</p><br/><p>Zhang Yang already started to retract the moment he saw the boss acting weird, but the skill discharge was way faster than the player’s movement speed. A new negative effect symbol instantly appeared on top of Zhang Yang’s head, followed by an instant decrease in his movement speed.</p><br/><p>He was lucky to have ran earlier. Even with his decreased movement speed, he could still manage to run out of the effective radius of the , with just a damage of ‘-400’ popped out on top of his head. After leaving the effective radius, the negative effect on him was automatically lifted away.</p><br/><p>After Weasley was done with that powerful skill, he immediately pulled his sword out from the ground and continued to pursue his attacks on Zhang Yang.</p><br/><p>!</p><br/><p>!</p><br/><p>!</p><br/><p>It was too bad that the frequency of the boss’ attack were not exactly high, with a swing of his sword only in every 2 to 3 seconds. But judging from every vigorous and heavy strike of the sword, Zhang Yang believed that the damage output for each of slashes would definitely be higher than 3,000!</p><br/><p>Shoof! With a shadow-step, Clear Lotus managed to escape the radius of the Plaque of the Undead. She then continued to poke and stab the boss from the back, dealing a series of damage on the boss. But it was unavoidable that she had to sustain two attacks from the boss, decreasing a total of 1,000 HP!</p><br/><p>Zhang Yang did not lose much of his HP after a few successful , and he could just rely on his armor set effects to heal his HP back to the max.</p><br/><p>Another 10 seconds or so has passed, and Weasley plunged his sword into the ground once again, discharging another round of .</p><br/><p>Zhang Yang was certain, the boss would use the skill once his HP dropped every 10%.</p><br/><p>78%, 77%, 76%, 75%!</p><br/><p>Weasley’s pupils instantly flashed. His ordinary eyes which did not differ much from an ordinary person’s eyes ignited with greenish ghostly flames. With an explosive “Boom!”, the large sword was surrounded by black aura, emitting a palpitating horrific atmosphere.</p><br/><p>‘Ding! Ron Weasley has used , all physical attacks have been increased with additional 100% dark-shadow damage, last for 5 seconds!’</p><br/><p>!</p><br/><p>‘-3200!’</p><br/><p>Oh lord!</p><br/><p>Zhang Yang immediately activated !</p><br/><p>‘Immune’ ‘Immune’!</p><br/><p>Within the 5 seconds, the boss did a series of 3 consecutive attacks with his sword. Other than the first attack, the damage from the remaining attacks were neutralized by the additional effects of which came after !</p><br/><p>Even with the 20% damage avoidance passive, Zhang Yang still took some dark-shadow damage of 3,200, which meant that the boss dished out 4,000 damage in his regular attacks!</p><br/><p>The boss triggered when his HP hit 75%. That would mean that the skill would be triggered every time 25% of his HP was deducted! The servant could only sustain one attack from the , leaving Zhang Yang to forcefully take on the last two remaining attacks that was yet to come!</p><br/><p>3 minutes later, the boss’ HP was brought down to 60%. The 4th was triggered, with two consecutive numerical value of ‘-500’ popped out right on top of Clear Lotus, emptying out her HP. With a miserable scream, she turned into a white light and disappeared into thin air.</p><br/><p>“Hahaha, you weak soul, just accept your fate!” Weasley waved his sword to dance. Usually, when a boss kills a player or a player’s pet, he or she would speak a few dialogues.</p><br/><p>“You’ve spoken too much nonsense!” Zhang Yang stared closely at the boss’ HP, because the moment it dropped below 50%, and would be discharged at the same instant, definitely making that instant the most dangerous moment in the whole battle!</p><br/><p>Unfortunately, if he knew the skills of the boss a little earlier, he would have summoned his servant a little slower, reserving until then!</p><br/><p>59%, 55%, 50%!</p><br/><p>“Go to hell, you insignificant soul!” Weasley plunged his sword heavily into the ground and triggered once again.</p><br/><p>Zhang Yang withdrew himself at the very first moment!</p><br/><p>‘Ding! Ron Weasley has used , all physical attacks have been increased with additional 100% dark-shadow damage, last for 5 seconds!’</p><br/><p>Followed closely with triggering , the boss quickly pursued Zhang Yang with his sword pulled out of the ground.</p><br/><p>‘-400!’</p><br/><p>!</p><br/><p>‘-3200!’</p><br/><p>Zhang Yang could only use in that instant.</p><br/><p>Shoosh! Instantly healing his HP back to full health!</p><br/><p>!</p><br/><p>‘+100!’</p><br/><p>‘-3200!’</p><br/><p>The second swing of the sword was negated with , but the dark-shadow damage was unaffected and banged up on Zhang Yang!</p><br/><p>The effect of the [Lover’s Sword] activated!</p><br/><p>‘-1573!’ .</p><br/><p>‘+1573!’</p><br/><p>‘-1499!’ .</p><br/><p>‘+1499!’</p><br/><p>‘-777!’ Regular attack.</p><br/><p>‘+777!’</p><br/><p>In just an instant, Zhang Yang’s HP was restored back to full once more!</p><br/><p>!</p><br/><p>‘-3200!’</p><br/><p>The effect of the ended with the 3rd strike of the boss!</p><br/><p>“Hahaha, you should be the one that should accept your fate… to die!” Zhang Yang burst into laughter. With every slash he did onto the boss, relying on the armor set’s recovery effect, along with the additional use of red potion, he could slowly replace back the HP that he lost.</p><br/><p>40%! 30%!</p><br/><p>Another 2 minutes has passed, the boss’ HP was nearing 25% left, which meant that the 3rd was about to begin.</p><br/>\n</div>"}