{"title": "Chapter 127: The 13th Floor", "id": 127, "volume": 2, "url": "http://boxnovel.org/mmorpg-rebirth-of-the-legendary-guardian-chapter-127-the-13th-floor", "volume_title": "Volume 2", "body": "<h1>Chapter 127: The 13th Floor</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 127: The 13th Floor</p><br/><p>Translator: EndlessFantasy Translation Editor:</p><br/><p>[Light in the Shadows] (Gray-Silver, Necklace)</p><br/><p>Vitality: +10</p><br/><p>Intelligence: +20</p><br/><p>Equip Effect: 1% increase in Magic Attack or Healing Power</p><br/><p>Level Requirement: 30</p><br/><p>This necklace was by far the best equipment for magic attack classes. It could be sold for at least 1,000 or 2,000 gold coins! If the lease he would get could be used for him to open a store, he could use this necklace as one of the main attractions!</p><br/><p>Other than the 2 Gray-Silver equipment, there were also other 8 Green-Copper equipment. He also obtained one [Chaos Gem]. Zhang Yang was delighted! He helped himself to the gem and used it to expand his inventory for an additional 10 slots. His inventory now had a total of 60 slots. That was at least 50% more than any majority players around!</p><br/><p>This was one of the benefits of going for solo raids. When good items appeared, he would not need to compete with anyone for it.</p><br/><p>Sigh… If only this tower had 30 floors. Zhang Yang hopelessly prayed for it in his mind.</p><br/><p>Merlinda cried out after she had been left standing there for some time. “Warrior! Let’s make a move on! The time is nigh! Every second we waste here will only give more strength to Terpot Ryhar!”</p><br/><p>Zhang Yang nodded and replied. “Alright! Let’s go and kill the son of a b*tch!”</p><br/><p>There was no door nor a visible entrance anywhere around, so Zhang Yang circled around the entire area before finally discovering a hidden lever. He pulled the ancient metal bar, and the floor at the center of the area split apart with loud cracks, revealing a spiral staircase leading down.</p><br/><p>Moving down, Zhang Yang had to watch his step as the entire area was completely dark. After 30 seconds or so, a bright light flashed when he reached the bottom. The last floor was a laboratory about the size of a basketball court. Racks of cabinets were attached to every single surface of the walls around this room. Test tubes were arranged nicely in racks here and there. At the center of the room were the carcasses of dead animals. Not far from the mess was a man in black cloak, walking about in circles.</p><br/><p>The man was completely shrouded in a black color magician robe. Underneath it was a face that was so shrivelled up that it looked like a skeleton! His eyes were gaunt and hollow, sunken deep in his eye sockets! His hands were all wrinkled up as if he had been left in the desert to dry up for years!</p><br/><p>‘Server announcement: Player Zhan Yu is the first player to set foot in the Underground Tower 13th Floor! Player Zhan Yu is now getting closer to the Land Lease!’</p><br/><p>The system announced his arrival just as Zhang Yang placed his foot into the lab. Oh well, since he had arrive to his ultimate goal. Might as well just go along with it.</p><br/><p>Zhang Yang walked closer and observed him and his description.</p><br/><p>[Evil Sorcerer Terpot Ryhar] (Gray-Silver)</p><br/><p>Level: 40</p><br/><p>HP: 10,000,000</p><br/><p>Bloody hell. How was he supposed to fight that? He just used the [Rainbow Potion]. Merlinda’s half-ass healing was just as useless. Unless and the sword’s had long cooldown, how was he supposed to fight this monster alone?!</p><br/><p>“Evil Sorcerer Terpot Ryhar! In the name of the Moon God, I’m here to exterminate you!”</p><br/><p>While Zhang Yang was busy frowning, thinking of a possible battle plan, Merlinda had boldly went up and pointed her staff furiously at him.</p><br/><p>“Kuh kuh kuh…You managed to escape.” Terpot Ryhar raised his head and stared at Merlinda. He then turned over and gazed at Zhang Yang with those eerie eyes. “Did this little pest free you?”</p><br/><p>Crap! I wasn’t doing anything!</p><br/><p>The innocent Zhang Yang had triggered the boss as he automatically entered battle mode; his Rage gauge had started to generate 2 points a second.</p><br/><p>Now that it had come to this, might as well just try and fight him. At least he could understand the boss’s skill.</p><br/><p>Zhang Yang unsheathed his sword and dashed towards the boss.</p><br/><p>“Hnng! Take this! Evil Sorcerer!” Merlinda cried out as she started to chant a and fired it at the boss.</p><br/><p>‘-200,000!’</p><br/><p>I’ll be damned!</p><br/><p>Was that real? Did she just blast 20% of the boss HP away? Zhang Yang nearly slipped as he ran.</p><br/><p>Could this boss have done something indecent to her in the past? Why else would she suddenly become so enraged and powerful?</p><br/><p>Well? Go ahead! Shoot more of those super beams!</p><br/><p>Just four more times and Zhang Yang could just walk over to pick up the loots!</p><br/><p>Zhang Yang was enthusiastic. He then used and started to attack as soon as he was in melee range.</p><br/><p>“Gargh! Damn you, woman! Stay still!” Ryhar muffled. He pointed his staff at Merlinda and waved.</p><br/><p>Zoom! Zoom! Zoom!</p><br/><p>6 orbs of grayish light appeared and flew across the field. It latched onto Merlina’s hands, feets, waist, and head.</p><br/><p>“ARGH!” Merlinda cried as she was bind by the light orbs. The staff in her hand clattered onto the floor.</p><br/><p>Huh? What was that? Not 10 seconds ago she was the best attacker Zhang Yang had ever witnessed, yet now she was completely useless!</p><br/><p>After taking care of Merlinda, the boss turned to face Zhang Yang. He pointed his staff at Zhang Yang and began casting a spell.</p><br/><p>3 seconds later, black flames started to form in the sky and fused into countless spears. They rained downwards, piercing all over the 13th floor!</p><br/><p>‘Ding! Evil Sorcerer Terpot Ryhar has used . All targets within the effective range will receive 2,000 Chaos damage!’</p><br/><p>‘-1,600!’</p><br/><p>Chaos damage is a special magic attack element. It would not be effected by any kind of Elemental Magic Resistance. It was the same as an attack that ignored defenses.</p><br/><p>3 seconds later, the boss used the same skill again. Following closely was the same skill.</p><br/><p>‘-1,600!’</p><br/><p>‘-1,600!’</p><br/><p>Could this boss only cast nothing but AoE magic attacks, just like Unduin? But this boss’ attacks were from the sky! There were no rocks in the world to hide behind from that!</p><br/><p>What now? What now!?</p><br/><p>Zhang Yang quickly activated to save himself and started to rack his brain for a solution!</p><br/><p>“Could I kite the boss to the entrance? Perhaps I could use the dodge and attack strategy there. Damn! The entrance is 200 meters away! It would at least take me 20 seconds to reach there! The boss would had already cast more than 7 times then! I will die before I even reach there!”</p><br/><p>Might as well die trying! He used his summoned [Servant] to lure the boss over to the entrance and fight the boss there!</p><br/><p>“Rise! My slaves! Fight for your master!” Terpot Ryhar raised his staff and unleased a different spell.</p><br/><p>‘Ding! Evil Sorcerer Terpot Ryhar has used !</p><br/><p>Crack! Crack! Crack!</p><br/><p>Several pairs of boney hands burst out from the ground underneath Zhang Yang. 20 skeletal monsters crawled out from the ground and lumbered towards Zhang Yang.</p><br/><p>[Terpot Ryhar’s Servant] (Normal)</p><br/><p>Level: 35</p><br/><p>HP: 3,500</p><br/><p>‘-65!’</p><br/><p>‘-262!’</p><br/><p>‘+100!’</p><br/><p>‘-69!’</p><br/><p>‘+100!’</p><br/><p>…</p><br/><p>A chain of damage and healing texts popped up simultaneously, cluttering up his display. Those that were under 100 damage were monsters that attacked him from the front, those that had exceeded 200 were attacks that struck his back. The healing he received was from the set-equipment effect.</p><br/><p>Zhang Yang had wanted to give up. He had planned to just die and come back here as fast as he could. But when these skeletal monsters suddenly popped out, things have changed. He now had hope!</p><br/><p>The monster’s attacks were around 400! Zhang Yang had an idea. He quickly swapped his shield with the [The Bones of the Chimera] to increase his Defense by up to 360 points. He then adjusted his position to only allow the monsters to attack him from the front.</p><br/><p>‘-1!’</p><br/><p>‘-1!’</p><br/><p>‘-1!’</p><br/><p>After the monsters’ attacks have been reduced by 20%, the base attack of 400 was unable to break through Zhang Yang Defense. They could only inflict 1 damage to him, and because he was under attack by 20 monsters, the set-equipment effect was triggered continuously!</p><br/><p>The boss continued casting , one after another, creating several more flaming spears in the ceilings.</p><br/><p>‘-1,600!’</p><br/><p>‘+100!’ ‘+100!’ ‘+100!’ ‘+100!’…</p><br/><p>Zhang Yang HP dropped tremendously every time he received the attack, but at the same time, he was healing rapidly from the set-equipment. On average, Zhang Yang predicted that the monster’s attack interval was around 2 seconds. Since there were 20 monsters around, he would heal an estimated amount of 1,000 HP every 2 seconds. This was based on his set equipment’s 50% chance of healing. He would heal 3,000 HP at most over the course of 6 seconds! The boss would need 3 seconds to cast the that would deal 1,600 damage. In 6 seconds he would lose 3,200 HP while he would still cover that amount concurrently. Ultimately, he would only lose 200 HP every 6 seconds, which would total up to 4,000 damage over 2 minutes. He could solve this healing problem with !</p><br/><p>Just when he thought that this boss could not be defeated alone, he was now able to do it because of the boss’s own attempts to quicken his death! Talk about eating his own medicine!</p><br/><p>Zhang Yang kept circling around the boss endlessly while facing the monsters to ensure that they would only attack him from the front. All AoE skills that Zhang Yang had could not be used since it would only damage those skeletal monsters! Why would Zhang Yang kill off his ‘healers’?!</p><br/><p>79%, 78%, 77%... Zhang Yang was making extremely slow progress but at least he was shaving off the boss’ HP.</p><br/><p>Since he could not use most of his skills, the damage rate was slow. The skill’s cooldown was longer than 10 seconds, and he could not use his major skills as they would hit multiple targets!</p><br/><p>1 minute… 2 minutes… 3 minutes… 5 minutes…</p><br/><p>75%... 70%... 65%... 55%...</p><br/><p>Slowly and surely, Zhang Yang was definitely obtaining victory!</p><br/><p>“Ayy boss, there’s someone there fighting!”</p><br/><p>“I bet it’s Zhan Yu!”</p><br/><p>“Haha! What perfect timing!”</p><br/><p>“Kill that bastard! We can fight the boss after he is dead!”</p><br/><p>The field suddenly turned rowdy as a group of players from the Sword and Fire Mercenary and entered the 13th floor. All of them had their eyes on Zhan Yu, preparing to unleash their fury upon him!</p><br/><p>Let’s see how you take on 8 of us together! We’ll flatten you up nicely like a pancake!</p><br/><p>Just then, the boss spell was completed. A ceiling full of flaming spear rained down on everyone.</p><br/><p>‘-2,000!’ ‘-2,000!’ ‘-2,000!’ ‘-2,000!’ ‘-1,600!’ ‘-1,500’…</p><br/><p>Among them all, Floating Up was the only player who had suffered the lowest damage! He was a Defender with a passive 15% physical damage reduction and another 10% magic attack reduction passive skill.</p><br/><p>“Shit! What was that! We just walked in when the boss was using his ulti!”</p><br/><p>“Healers! Do your job!”</p><br/><p>Everyone remained calm and orderly even though they had just taken a massive group attack! Everyone was doing their role perfectly; the healers methodically healing everyone, while the rest of the party headed straight for Zhang Yang.</p><br/><p>Boom! Shush! Shush! Shush!</p><br/><p>3 seconds later, another wave of flaming spears rained down.</p><br/><p>“WTF! Another ulti?!”</p><br/><p>“How could the boss repeatedly use his ulti!?”</p><br/><p>“We’re in deep trouble now guys! 7 Feet! Don’t just heal the tank alone! Save the rest of us as well!”</p><br/><p>Eventually, they broke down in panic.</p><br/><p>Shush! The third wave of flaming spear rained down while the mercenaries were just 60 to 70 meters away from Zhang Yang!</p><br/><p>‘Ding! Player Bottoms Up had died!’</p><br/><p>‘Ding! Player Broken Uranus had died!’</p><br/><p>‘Ding! Player All Wounded had died!’</p><br/><p>The healers could not keep up with all the damage that their party had just taken. They had lost 3 players in just a few seconds! While the rest…the rest were standing on a thin ice!</p><br/><p>Sword and Fire Mercenary has failed!</p><br/>\n</div>"}