{"title": "Chapter 124: Beyond Perfect Score", "id": 124, "volume": 2, "url": "http://boxnovel.org/mmorpg-rebirth-of-the-legendary-guardian-chapter-124-beyond-perfect-score", "volume_title": "Volume 2", "body": "<h1>Chapter 124: Beyond Perfect Score</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 124: Beyond Perfect Score</p><br/><p>Translator: EndlessFantasy Translation Editor:</p><br/><p>Zhang Yang returned to the Lab Room. He took out the Elemental Stone and showed it to Merlinda, who saw the rock and was happy beyond measure.</p><br/><p>“You’ve done it, brave warrior!” said Merlinda gratefully.</p><br/><p>[Elemental Stone] (Quest Item)</p><br/><p>Item Description: Dispels the bind on Merlinda – Song of the Forest.</p><br/><p>Zhang Yang walked closer and held out the stone in his hands. “How do I use this?”</p><br/><p>“Place it on my chest!” said Merlinda. “I will absorb the power of the stone to break free of these shackles!”</p><br/><p>Zhang Yang nodded and walked over to the NPC. He then placed the crystal-like rock on her chest. What a beautiful elven woman. Her body was so alluring that when Zhang Yang placed the Elemental Stone on her chest, it slipped down and rested in between her voluptuous breasts!</p><br/><p>If only the thing between her boobies could be replaced with his…</p><br/><p>What the hell am I thinking!?</p><br/><p>Zhang Yang shook his head violently! Could this be?! It has been a while since he had felt the warmth of a woman since he was reborn. Was he really that “dry”? Still! No matter how depraved Zhang Yang became, she was still an NPC! A program!</p><br/><p>Sigh… He blamed the developers and designers for doing their job so excellently. If she could lose those pointy ears, her pale eyes, and the emerald colored hair, how would anyone differentiate this NPC from a real woman!? It was no wonder that movie producers would collaborate with ‘God’s Miracle’ in the future to make their movies. The audiences could not even tell the difference between the actors and NPCs!</p><br/><p>“Aun Vu Zin Du Ving Ga…” Merlinda started to chant a spell. As she chanted, white light started to radiate from the inside of the Elemental Stone. As she chanted on, a total of 8 rays of light burst out from within the Stone and formed a magic circle in the air. The circle expanded slowly and wrapped itself around Merlinda.</p><br/><p>Ping! Ping! Ping!</p><br/><p>The light rings that bound Merlinda shattered into pieces. There was a sudden tremor when the NPC started to glow brighter. Her hair started to float supernaturally, without any moving air in the room.</p><br/><p>FOOM!</p><br/><p>The light glowed brighter to the point that Zhang Yang had to shield his eyes with his armored hand as even his eyelids couldn’t block out the light.</p><br/><p>When the light dispersed, Zhang Yang lowered his arms and opened his eyes. Merlinda was freed and now standing right in front of him! Zhang Yang could only assume that the energy the stone released had been a little too powerful, it was the only explanation he could come up with, seeing that the dress she wore was now in pieces. Even her undergarments were all torn apart! Her body was only covered with less than a few torn pieces of cloth still sticking to her fair skin, conveniently at the places that really mattered! As she moved, the perfectly full breasts jiggled so seductively that any weak-willed man would fall to his feet! A sudden surge rose from within Zhang Yang that he started to sweat like a horny pig. Damn! How could Zhang Yang drool over an NPC!? He was starting to behave like the notorious Fatty Han!</p><br/><p>Fortunately for him, Merlinda quickly produced another dress from the ring she wore and changed into it. The pale, purple Amherst colored dress complimented her green Emerald colored hair. As she flung her hair to adjust the dress, her hair gracefully came to rest on her back. The dress was soft and tight enough that it plastered itself on her skin, showing her slender form to the world. Everything about her was unearthly.</p><br/><p>Hold up. Did she just pull out a dress from a ring? What’s this? A Fantasy Novel? Or was she the Flash1?</p><br/><p>‘Ding! You have completed the quest: Rescue Merlinda – Song of the Forest. Obtained 100,000 Experience Points!</p><br/><p>Total Time Taken: 97 minutes, Score: Good.</p><br/><p>Player Count: 1. Increased Score.</p><br/><p>Average Players Level: 31. Increased Score.</p><br/><p>Final Score: Beyond Perfect!’</p><br/><p>‘Ding! You have obtained the reward: Merlinda’s Appreciation Ring.’</p><br/><p>Beyond Perfect? What was that score? He had never heard of it before!</p><br/><p>Zhang Yang had never encountered a score that was beyond Perfect and no matter how hard he tried to recall; he could not remember anyone in his previous life scoring Beyond Perfect!</p><br/><p>‘Total Time Taken: 97 minutes, Score: Good.</p><br/><p>Player Count: 1. Increased Score.</p><br/><p>Average Players Level: 31. Increased Score.</p><br/><p>Final Score: Beyond Perfect!’</p><br/><p>Zhang Yang recalled the system notification and thought to himself.</p><br/><p>“Perhaps I got this score since I completed the quest alone? Did the system award me with a ‘Beyond Perfect’ score since no one else has ever done it alone? After Excellent, comes Perfect. Perfect was the highest level there is – or that’s what I thought previously. Could it be that there was actually a score higher than that?”</p><br/><p>Zhang Yang grinned. “That has to be the case. I could be the only one player who maximized . Since I was lucky enough to obtain the [Servant] Clear Lotus and also , it was possible for me to kill Ron Weasley with them both!</p><br/><p>A “Perfect” score reward was already considered to be the ultimate prize. What would the system’s reward be when Zhang Yang scored a “Beyond Perfect”?</p><br/><p>Zhang Yang took out the ring in his inventory.</p><br/><p>[Merlinda’s Appreciation Ring] (Yellow-Gold, Ring)</p><br/><p>Vitality: +50</p><br/><p>Strength: +50</p><br/><p>Use: Summons Merlinda’s Shadow to join the battle. Last for 10 seconds. During the summoned duration, she will act as your healer and has perfect Invincibility.</p><br/><p>Cooldown time: 3 minutes.</p><br/><p>Special: Item’s level requirement has been dropped down to Level 30. Limited only to Player: Zhan Yu.</p><br/><p>Bound.</p><br/><p>WHAT IN THE NAME OF NEPTUNE?!</p><br/><p>Level 50 Yellow-Gold equipment! And he could equip it now!</p><br/><p>Now the system was just being lazy. A “Perfect” score must have awarded a Gray-Silver tier equipment. By its logic, the reward for attaining “Beyond Perfect” would be a Yellow-Gold equipment. However, a Yellow-Gold equipment had a requirement of level 50. They probably felt that the player was bound to let it collect dust in the inventory. So, taking the circumstances into consideration, they lowered the level requirement. This could be the only such equipment in the entire game! If other player got hold of this news, they would just cry their eyes out in jealousy.</p><br/><p>Zhang Yang had struck the jackpot!</p><br/><p>Now, he had a problem. Which of the rings should he remove?</p><br/><p>[Absolute Defense Ring] granted a bonus 100 Defense points, while [Dead Soldier’s Pride] had the effect. Argh! Which one of these had to go!? Damn it! If only the system had given Zhang Yang a necklace, then he would not have to crack his brain thinking about it.</p><br/><p>In the end, Zhang Yang had decided to swap off [Absolute Defense Ring] and adapt based on the situation. If he were to grind his level, he would put on the [Absolute Defense Ring]. If he was fighting an elite, or a boss, he would swap back to the [Dead Soldier’s Pride].</p><br/><p>Zhang Yang swapped off the rings and his attribute was rose dramatically.</p><br/><p>HP: 5,380.</p><br/><p>Strength: 276</p><br/><p>Melee damage: (716-768) x 110%</p><br/><p>“Brave warrior! Let us make haste! We must now defeat the Evil Sorcerer Terpot Ryhar and rid this land of evil!” said Merlinda with vigor. An ancient magical staff appeared in her hands. She twirled it around as she walked, casting a healing spell to recover her own health.</p><br/><p>[Higher Regeneration]: Restores 5% of the target’s HP every second for 30 seconds.</p><br/><p>“Alright, let’s go kill him!” Zhang Yang was delighted since an NPC was willing to lend a hand.</p><br/><p>“Please lead the way, I will stay behind and heal you!” Merlinda pushed Zhang Yang upfront.</p><br/><p>Hah! What a smart NPC! She even knew how to cower behind a player!</p><br/><p>There was no time to waste. There were players chasing after him from the upper floor! There was literally no time for him to waste! Zhang Yang quickly stepped onward and led his “party” down to the tenth floor.</p><br/><p>By then, the monsters that were the closest to the entrance were still dead while the monsters further down the floor had already respawned. Zhang Yang had to kill them all again to make it to the next floor.</p><br/><p>As annoying as it may seem, this time, there was an NPC healing him, and Zhang Yang was able to kill his way through at leisure, without depending on his long cooldown skills to survive.</p><br/><p>Underground Tower 11th Floor!</p><br/><p>‘Server announcement: Player Zhan Yu is the first player to set foot in the Underground Tower 11th Floor! Player Zhan Yu is now getting closer to the Land Lease!’</p><br/><p>Just as he stepped in, the server acted up again.</p><br/><p>Zhang Yang had already gotten used to it. It looks like the system would make an announcement every single time a player entered a new floor after the 10th floor of the Underground Tower.</p><br/><p>The 11th floor was almost the same as the 10th floor. It was filled with the same magical attack-type monsters. His killing speed was tremendously slower since could not be used against magic attacks, which directly affected the usage of !</p><br/><p>Their slow attacking speed was to be expected.</p><br/><p>After 40 minutes, Zhang Yang arrived at the end of the floor and entered a small library.</p><br/><p>A petite human girl was sitting high up a ladder, searching around for books as she muttered by herself. The girl had a long, straight, and blonde hair, and her figure was well built like a true Western beauty.</p><br/><p>[Hermione, The Witch] (Gray-Silver)</p><br/><p>Level: 36</p><br/><p>HP: 600,000</p><br/><p>Note: She was Terpot Ryhar’s assistant.</p><br/><p>“Hermione! You must have thought that I could never escape, did you!”</p><br/><p>Before Zhang Yang did anything at all, Merlinda started to taunt.</p><br/><p>“You beast! How could you do this to me!? We were friends! How could you betray my trust!?”</p><br/><p>Hermione closed the book she was reading gracefully and looked up.</p><br/><p>“Well well well…Look what we have here. You actually escaped now did you? What was Ron doing? Sigh…What a useless imbecile.” She raised her staff and muttered, “Shrink”, and the stairs then moved down on its own and placed her gently on the ground.</p><br/><p>Merlinda quickly turned to Zhang Yang and said, “Brave warrior! You must kill this witch! Without her, Terpot Ryhar would lose half of his power!”</p><br/><p>Merlinda quickly chanted a spell and cast a on Zhang Yang. Somehow, her expression looked like it was saying “Go ahead! I’ll cover you from behind”.</p><br/><p>Sigh. Not like Zhang Yang had any say in the matter, did he?</p><br/><p>Zhang Yang quickly dashed toward Hermione.</p><br/><p>Hermione raised the staff in her hands and pointed it at Zhang Yang, beginning to chant a spell. “O Lord of Flames, beseech your almighty power and exterminate this heretic, cleanse his blasphemy!”</p><br/><p>Shush!</p><br/><p>Zhang Yang casted .</p><br/><p>‘-728!’</p><br/><p>!</p><br/><p>!</p><br/><p>Just as Zhang Yang had managed to inflict two counts of , Hermione had finished her spell. A ball of fire blast out and hits Zhang Yang.</p><br/><p>‘-1,612!’</p><br/><p>‘+269!’</p><br/><p>Zhang Yang received a huge damage and received the first heal from the .</p><br/><p>2 seconds later, another fire ball landed on Zhang Yang.</p><br/><p>‘-1624!’</p><br/><p>‘+269!’</p><br/><p>‘+30!’</p><br/><p>‘+269!’</p><br/><p>‘+30!’</p><br/><p>Zhang Yang received 2 ticks of healing while the ring effect was triggered twice. Although Zhang Yang was recovering, but it was not enough to dampen the boss’ damage.</p><br/><p>After casting , Merlinda did not bother Zhang Yang anymore. She turned her target to Hermione and cast a on the boss, dealing around 500 damage a spell.</p><br/><p>Merlinda’s healing spell could not be depended upon; since both of them started traveling from the 10th floor all the way to the 11th floor, she had never cast anything else other ! Based on this reason, Merlinda could have only and nothing else besides that.</p><br/><p>While this was happening, Zhang Yang was faced with a dilemma. It was concerning the [Rainbow Potion]!</p><br/><p>If he took it now, he could increase all elemental resistance and fight the boss evenly. However, if he did use the potion now, how would he face the final boss later on?</p><br/><p>Gah!</p><br/><p>Zhang Yang finally decided to take the potion. He had to do whatever he could to survive here! Otherwise, he would not even reach the last floor!</p><br/><p>1Flash – The Flash from DC Comics stored his costume in a ring.</p><br/>\n</div>"}