{"title": "Chapter 147: Harmonious and Loving Party", "id": 147, "volume": 2, "url": "http://boxnovel.org/mmorpg-rebirth-of-the-legendary-guardian-chapter-147-harmonious-and-loving-party", "volume_title": "Volume 2", "body": "<h1>Chapter 147: Harmonious and Loving Party</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 147: Harmonious and Loving Party</p><br/><p>Translator: Editor:</p><br/><p>“We did it!”</p><br/><p>The party channel was suddenly filled with cheers and laughter, but Endless Starlight and Daffodil Daydream were even more excited than the others could be. After all, they had never seen a Gray-Silver boss, much more participate in a party to kill one! This first achievement meant more to them than to Zhang Yang’s gang.</p><br/><p>Hmph. This future-to-be superstar is now considered to be in my hands! Zhang Yang took notice that Daffodil was always wearing a smile on her face, which made Wei Yan Er look a little more annoyed. It somehow reminded her about a cartoon she watched when she was a kid, about a weird older gentleman and a young girl.</p><br/><p>“Little brat! Get our prize!” Zhang Yang quickly gave her something to do when he noticed that Wei Yan Er was itching around after the battle ended.</p><br/><p>“Aye aye, captain!” Wei Yan Er jumped with joy and hopped to the boss.</p><br/><p>[Lunar Sol Magic Staff] (Gray-Silver, Staff)</p><br/><p>Magic Attack: 690 – 750</p><br/><p>Level Requirement: 40</p><br/><p>“Little Snow! Daffodil! Both of you roll for it!” said Zhang Yang grinning widely.</p><br/><p>Daffodil’s expression changed instantly when Zhang Yang addressed her. She crossed her hands and said, “No, no, no, no! It’s okay! I’m already very happy with defeating a Gray-Silver boss! I even leveled up! I can’t ask for more!”</p><br/><p>Han Ying Xue smiled warmly and replied her. “Girl, you’ve worked your way here! You deserve to get the equipment as well! Come, don’t be shy!”</p><br/><p>Fatty Han and Wei Yan Er persuaded her as well. Daffodil only rolled for the equipment while being so abashed that her face was turning into a round peach fruit, and felt like if she did not accept the role, she would betray the nation and everything she stood for. In the end, Han Ying Xue rolled 74 points while Daffodil had only rolled 16 points.</p><br/><p>Now that she lost her chance, she breathed a sigh of relief and smiled sincerely.</p><br/><p>Han Yin Xue crossed her arms trying to think of a better way. She equipped the [Lunar Sol Magic Staff] and gave her Level 30 Silver-Gray staff to Daffodil. Even though the new staff was still , the magic attack alone was 180 points higher than her previous staff. It was an obvious upgrade.</p><br/><p>Daffodil wanted to reject the gift but in the end, she could not reject the sincerity of Han Ying Xue and accepted the second-hand equipment with red cheeks. Her original weapon was a Level 30 Green-Copper staff, when she switched to the new equipment, she gained 270 magic attack! That was an obvious upgrade!</p><br/><p>It was a Gray-Silver tier Level 30 equipment after all! You could not buy it even if you had the money! Daffodil could not express her immense gratitude to Han Ying Xue, but only to hold on to her hands, shaking them endlessly. Han Ying Xue then moved closer and the two of them were whispering. Zhang Yang was wondering what they were talking about…</p><br/><p>Han Ying Xue suddenly turned around and Zhang Yang saw a warm and charming eye. She then sent a private message to Zhang Yang saying, “Hmph! Dummy! You should think of a way to thank me!”</p><br/><p>“Huh? What should I thank you for?”</p><br/><p>“Haha! Dummy! I saw your wavering heart! The heart that reeks of romance! I’ve helped you to set things up now! Now, how do you plan to repay my generosity?”</p><br/><p>Huh?! Romance? Me?!</p><br/><p>Zhang Yang was bewildered. He then pieced the puzzle together and finally understood. Han Ying Xue misunderstood the entire situation! She thought that Zhang Yang had a thing for Daffodil Daydream!</p><br/><p>“You misleading sow! Don’t stir things up when everything was fine! Yes! I was interested in her! But not sexually! I had an eye for her skills and capabilities! That was why I wanted to recruit her into the guild! What the hell have you done now? Don’t point things out that are not even there! You might make things awkward for me!” Zhang Yang quickly warned her.</p><br/><p>“Hehehe! She’s quite cute though.”</p><br/><p>What are you still doing?! Sigh!</p><br/><p>Zhang Yang sighed heavily. “Please, you’re pretty cute yourself!”</p><br/><p>Zhang Yang had to resort to attack instead of playing safe. Fight fire with fire!</p><br/><p>“Haha! Dummy! You’re 1,000 years too early if you want to try your luck on me!”</p><br/><p>Phew! Even though he was not sure of the result, at least the topic was no longer about Daffodil.</p><br/><p>While they were talking privately, Wei Yan Er opened another loot.</p><br/><p>[Devotion of the Soul] (Silver-Gray, Heavy Armor)</p><br/><p>Defense: +20</p><br/><p>Vitality: +96</p><br/><p>Strength: +48</p><br/><p>Intelligence: +16</p><br/><p>Level Requirement: 40</p><br/><p>Zhang Yang cried out, “Hah! Look at that! Starlight, you’re quite lucky to have a Knight class equipment!”</p><br/><p>Even though it was a Heavy Armor, but the additional 16 Intelligence attribute automatically made it an armor that was suitable for Knights.</p><br/><p>Knights were a special class. To make things clear, Guardians and Berserkers fell under the Warrior main class. Defenders, Sacred Knights, and Templars were under the Knight’s main class. Even though both Defenders and Templars use melee weapons to attack, most of their attacks were Holy damage which was affected by the Intelligence attribute.</p><br/><p>Endless Starlight was an outgoing man, with a slightly higher ego than the rest. Even though he only joined Lone Desert Smoke for just a day, he made it as his own home and helped himself to the armor, laughing all the way cheerfully!</p><br/><p>[Skill Book: Breaking Shot]</p><br/><p>Use: Teaches you .</p><br/><p>Class Requirement: Hunter.</p><br/><p>Level Requirement: 30</p><br/><p>“Good stuff!” Praised Zhang Yang. Even though the skill did not provide much damage after leveling it up, it was extremely useful in PK. A Hunter has the pet tanking for them in the front line, and along with their own aggro clearing skill, a Hunter would not need to worry about having a monster coming to close to him. But in PK, a player would not behave as stupid as a monster! A player would automatically ignore the pet and aim directly at the player himself. Once a monster got close to a Hunter, 90% of his skill and damage would be rendered useless. To forcefully create a gap between the Hunter and the target, he or she could use either or use .</p><br/><p>Fatty Han denied the item immediately. “This thing is useless for me! I don’t even PK to begin with! Give this to Hundred Shots!”</p><br/><p>Zhang Yang had a conversation with Fatty Han a few days back. Knowing that Zhang Yang wanted to build a PK party, Fatty Han would naturally support his brother without even knowing what it meant. To put it bluntly, Fatty Han could fight monsters all day long without flinching but PK was his kryptonite. He would be a sitting duck in the battle arena! Furthermore, Fatty Han’s main purpose in playing this game was to earn a fortune. He achieved that goal with Zhang Yang’s personal help now, earning at least 2,000,000 dollars a month! What more could he ask for?</p><br/><p> was considered to be a PK type skill, and naturally Hundred Shots got the priority over it. Before he could negotiate with Fatty Han, Zhang Yang gestured him to just accept the book. Hundred Shots obeyed Zhang Yang and learned the skill when he got it.</p><br/><p>After witnessing the event that happened in front of his eyes, Endless Starlight was truly moved. “Looks like I’ve made the right choice to join you guys! What harmonious and loving team mates I have! Honestly, I have never seen such a team in my entire gaming life! To express my feeling, I want to dedicate a song to all of you called ‘D*ck in a box’ by Lonely Island. Ready? ARGH!”</p><br/><p>Before he could start singing, he was brutally smacked in the head with a shoe and behaved himself.</p><br/><p>The boss had several more items but the rest were only Green-Copper tier. None of them were interested in the equipment. They kept it and decided to sell it off at Zhang Yang’s Little Merchandize Shop.</p><br/><p>The team moved on to the next floor. After walking up a long flight of stairs, they encountered a mixture of monsters along the way. Aside from the Royal Guards, there was a new monster.</p><br/><p>[Centaur Maid] (Elite, Spectre)</p><br/><p>Level: 42</p><br/><p>HP: 60,000</p><br/><p>MP: 40,000</p><br/><p>When there was MP, there was bound to be a magic spell. If you only paid attention to the top half of these Centaur Maids, those that had not decayed were quite pleasing in the eye. Most of them were rather beautiful; having magnificent chests and all. Looking at the lower half, however, shaking their huge horse bodies as they walked around, you might just be turned off.</p><br/><p>Fatty Han sighed and shook his head disappointingly. However, Endless Starlight started to stroke his chin and observed the female Centaurs like a wise old philosopher. “Honestly, a horse ass is quite plump and well formed!” Fatty Han immediately bowed down in respect to him.</p><br/><p>Killing Royal Guards was fine, but killing Centaur Maids were a little troublesome. Their main attack was which could deal 2,400 damage an instant. If they gathered a bunch of it in a go, even Zhang Yang would be killed instantly.</p><br/><p>As the team proceed further up, the magic type monsters began to dominate the numbers. When the party was in the second floor, the huge space was completely filled with Centaur Maids. Luckily, they were not all that crowded as the first floor. They could lure in a maximum of two to three monsters at a time.</p><br/><p>Endless Starlight was finally given a chance to shine. After provoking the monster, Starlight would mainly hold on to one monster while Zhang Yang would take care of the other two. Since Centaur Maids were the magic attack type, they would not need to chase around to attack Zhang Yang. The problem was that when there was more than one monster, having them standing apart would be efficient since they would not need to move around to attack. Luckily, the team had many “Interrupters”. Once the Centaur Maid started to cast a spell, the player would interrupt the spell. The Centaur Maid would have no choice but to rely on its physical attack to damage Zhang Yang. Zhang Yang took the chance to move around and kite the monsters. That way, he could gather the monsters into one spot to utilize , , and other AoE skills to properly attack.</p><br/><p>Sun Xin Yu entered and began to search around the floor for the 3rd floor entrance. Once she was sure of the direction, the team moved on towards it. As they could not properly multi-kill the monsters around, the pushing speed was very much reduced down to a snail’s pace. They could only cover 10% of the entire place by midnight.</p><br/><p>Zhang Yang then ordered the party to disband and have a good night rest before they continued the floor tomorrow morning at 9:00. Those who needed to make up were reminded to wake up half an hour earlier!</p><br/><p>The extra reminder had Han Ying Xue, Wei Yan Er and Daffodil laughing their butts off.</p><br/><p>The next day, every one gathered around 9:00 in the morning. The ladies were slightly earlier than yesterday but were still late by around five minutes or so. Daffodil Daydream was rather shy for her lateness and immediately apologized when she logged in. “I’m so sorry for my tardiness! I was so absorbed in doing my makeup and totally forgot about the time!”</p><br/><p>Once everyone arrived, the party then moved forward.</p><br/><p>Fatty Han suddenly got angry and cried out.</p><br/><p>“Little Yang! There are so many guilds that have already taken down the first two bosses in the Castle Interior! I’ve picked up another disturbing news in the forums this morning! There were many players around that had been saying that we, the Lone Desert Smoke had been sucking on luck! Now that we have not made any progress, they said that they finally exposed our real trick! We were scared to fight the other guilds now! Damn! I’m so freaking pissed off!”</p><br/><p>Seeing Fatty Han puffing with angry steam, Zhang Yang could only smile. “I think that those people who mocked us were all under super guilds. They are purposely trying to slander us! However, keep your cool, Fatty. Let’s deal with this quest quickly and raid the Castle dungeon!”</p><br/><p>“Ok. The early bird gets the worm. We will take the “First Clear” Achievement! That will teach them a lesson!”</p><br/><p>Wei Yan Er giggled playfully and said, “Pervy Fatty! I’d never knew that you could use idiom!”</p><br/><p>Fatty Han stared back at her wide-eye and said, “I’ve been reading so many philosopher books that I can even read it back to you! Erhm… for example, “Sun Tzu Art or War” or “100 ways to Improve Your Sex Life”, or “What a Woman Wants”!”</p><br/><p>“Fatty…you’ve revealed all your secrets again…”</p><br/>\n</div>"}