{"title": "Chapter 169: Rather Spirited Momentum", "id": 169, "volume": 2, "url": "http://boxnovel.org/mmorpg-rebirth-of-the-legendary-guardian-chapter-169-rather-spirited-momentum", "volume_title": "Volume 2", "body": "<h1>Chapter 169: Rather Spirited Momentum</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 169: Rather Spirited Momentum</p><br/><p>Translator: Editor:</p><br/><p>‘Ding! Player Zhan Yu has received the effect !’</p><br/><p>‘Ding! Player Frost Night has received the effect !’</p><br/><p>The 3rd wave of the Explosive Bugs landed on the two strongest DPS in the party!</p><br/><p>Sun Xin Yu turned around immediately and brandishing her blades around, dealing explosive damage to the bug on Zhang Yang. However, her strongest damaging skill was . As the name of the skill implied, the skill would only activate when the user was attacking the target’s back! Since these Explosive Bugs did not have a “rear” to begin with, Sun Xin Yu was left with no choice but to rely on .</p><br/><p> is a skill that would only cause instantaneous damage based on the primary weapon, with 100% melee attack. Its damage could not be compared to that of . What more, a single attack from a dagger weapon is severely low! Even if Sun Xin Yu’s current primary weapon is a level 40 Gray-Silver tier, her damage was a little over 600!</p><br/><p>Luckily the Explosive Bug did not have any Defense value, which allowed even her secondary weapon to inflict substantial damage and to cover the loss of her original destructive power. Because of those reasons however, Sun Xin Yu’s damage power had lost to Zhang Yang. When she finally destroyed the bug, Zhang Yang had already been attacking the boss for at least 4 seconds!</p><br/><p>The prideful Sun Xin Yu could not help but feel helpless. Zhang Yang turned around and made a provoking face that read “I win! You lose!” which only angered her further. She continued her attack on the boss’ back and attacked him, unleashing the rage that had been bottled up inside her.</p><br/><p>Demison would cast at every 10% HP bracket. This was truthfully, the toughest part of the boss fight. Fortunately, the team’s weakest pair of DPS could destroy the bugs within the duration span. This would mean that the boss was a piece of cake for the entire party!</p><br/><p>70%...40%...10%...</p><br/><p>It was just a matter of time now!</p><br/><p>“No! I cannot die just yet! I have not yet become the master of the Shadowmoon Castle. I cannot die! I c-can-not d-die…”</p><br/><p>The boss fell defeated only after 6 minutes into the battle with the party.</p><br/><p>Phew!</p><br/><p>Everyone sighed a breath of relief. This was by far the boss that had gave the party a sense of challenge, a fight full of excitement!</p><br/><p>Zhang Yang sighed loudly and called out to Wei Yan Er. “Little brat! Go and loot the droppings! I’m logging off to fix my biological problem!”</p><br/><p>“Big boss Zhan Yu…you have a biological problem?” asked Endless Starlight quietly.</p><br/><p>“HAHAHAHA!” Fatty Han laughed abruptly whist patting Endless Starlight shoulder furiously with his flabby hands. “That’s right! Litte Yang has a severe case of biological problem! What a tragedy! How sad!”</p><br/><p>In a non-city non-safe zone area, an additional 20 seconds was required before anyone could log off. Zhang Yang could still hear what those two were talking about and replied furiously. “Hey! I had no problem with that part of my body! F*ck you Fatty! You’d better not say anything---”</p><br/><p>Before he could finish his sentence, the 20 second time had completed and Zhang Yang was logged out of the game. He quickly went to the toilet and hastily made his way back into the game. When he entered the game, his character reappeared close to the boss’ dead body.</p><br/><p>By then, everyone else was looking at him as if they were looking at a strange experimental product, with a hint of amusement in their face.</p><br/><p>“Damn you Fatty! What did you say while I was gone!?” Zhang Yang screamed at Fatty Han.</p><br/><p>Fatty Han shrugged his shoulder off like nothing had happened and said, “Nothing much, if you had nothing to hide, what were you afraid of?”</p><br/><p>Motherf*cker. When you say something like that, even the sun would rise from the sea and set in the sky!</p><br/><p>Zhang Yang shook his head and said, “F*ck it. I’m too lazy to deal with you. Little brat? Time for the loots!”</p><br/><p>Wei Yan Er walked over to the body while shaking in fear. She turned her head towards Zhang Yang slowly and said, “H-hey…Noob t-tank. Y-you wouldn’t be a-asking me to…to follow you in your v-van for c-candies right?”</p><br/><p>WTF!? What did that f*cked up fatty pig say to this girl?!</p><br/><p>Zhang Yang stared angrily at Fatty Han and turned away. “Relax little girl. This handsome man does not have love for flat-chested-petite-lolis!”</p><br/><p>“Damn! You actually called yourself handsome! Need I remind you that you have only a slightly above average look!” Wei Yan Er talked back while rolling her eyes at him. “I’m telling you. You better go Korea and have your face fixed a little! If not, you might randomly scare other flora and fauna alike!”</p><br/><p>Zhang Yang laughed and said, “Since when could this little girl talk like that?”</p><br/><p>Wei Yan Er snickered. “My cousin sister taught me that!”</p><br/><p>Han Ying Xue expressed a rather contented expression while crossing her arms below her magnificent breasts, causing them to slightly bounce about.</p><br/><p>Wei Yan Er continued joking and went over to the loots.</p><br/><p>[Hellheim Boots] (Gray-Silver, Leather Armor)</p><br/><p>Defense; +12</p><br/><p>Vitality: +48</p><br/><p>Strength: +8</p><br/><p>Agility: +24</p><br/><p>Level Requirement: 40</p><br/><p>Everyone rolled for it and Sun Xin Yu won the item.</p><br/><p>The next few items were all just Green-Copper grade equipment. The party chose to let Zhang Yang keep them all.</p><br/><p>“Damn! We’re strong! We could just defeat the boss in one try! Haha!” said Fatty Han with a rather jubilant expression, self-praising shamelessly. “I really want to just log onto the forum and post our achievement! Let the world know that we, the Lone Desert Smoke could achieve anything, even the First Clear Achievement if we wanted to! Hmph! Let them come, be it One Sword Stroke, they are nothing to our Zhang Yang here!”</p><br/><p>Zhang Yang quickly cut in, “That player, One Sword Stroke is really strong though!”</p><br/><p>If Zhang Yang had not been reborn anew into this world, One Sword Stroke would undoubtedly be the best tank in the entire of China! His strength and that of his team had earned him the greatest honor and pride in china. Soon, all that stood against him would fall defeated under his achievement!</p><br/><p>“I was slow last time…I didn’t had a chance to compete with you back then…but now…heh” Zhang Yang smiled and muttered by himself. “I will be at the peak of it all and wait for you to come challenge me this time!”</p><br/><p>The party went up to the fourth floor and last floor of the castle. The structure of the castle remained the same as ever, the only different was the monsters. This time, the monsters were soldiers, carrying long swords and shield.</p><br/><p>[Wolfman Soldier] (Elite, Humanoid)</p><br/><p>Level: 45</p><br/><p>HP: 90,000</p><br/><p>“A Warrior type monster would basically have and </p><br/><p>. Try not to stand in front of the monster and fight, if you have low HP, please move to their backs or sides!”</p><br/><p>Zhang Yang took out his sword and used and stunned one of the monsters ahead.</p><br/><p>The monsters on this floor were also in pairs. When one of them was stunned, the other growled furiously and slashed Zhang Yang.</p><br/><p>“-492!”</p><br/><p>Zhang Yang slashed the monster but only dealt small, petty damage on it. “Damn. This monster is just the same as I am! A Guardian! His defense is so strong! Perhaps even stronger than mine! It must be more than 400 points. With that passive 20% damage reduction and 90,000 HP, it would be a good bait if I could control this monster to tank a boss!”</p><br/><p>When stun effect wore off, Zhang Yang cast and stunned both the monsters with only “-97!” damage.</p><br/><p>Sun Xin Yu and the rest of the party tried their best, using status ailment skills to stun the monster and prevent them from casting . As such, the party was stuck there for half an hour, advancing slowly. Only then did the party make their way to a large hall. At the far end of the hall, there was a man, fully clad in armor that covered his entire body. Even his face was completely covered in the silver-metal helmet, masking his appearance from the world. Wielding a large two-handed axe in his hands, the man was guarding a large entrance behind him. The only thing that revealed were his blood shot eyes. The red glint that expressed fierce killing intent was cold and frightening.</p><br/><p>[Blood Guardian Angelo] (Gray-Silver, Humanoid)</p><br/><p>Level: 47</p><br/><p>HP: 1,500,000</p><br/><p>Note: Master Waller’s loyal follower.</p><br/><p>“What pride is there for a Boss to guard an entrance!” Wei Yan Er was frowning.</p><br/><p>Zhang Yang laughed. “Once we kill him, the last boss beyond that door would be Master Waller!”</p><br/><p>“How do we fight?” Everyone stared at Zhang Yang.</p><br/><p>Every time they party would relied on him for the battle plan, Zhang Yang would always pretend to be humble. He faked a cough to get everyone’s attention and began to explain.</p><br/><p>“This boss…is easy but not easy. It’s hard, but it’s not hard!”</p><br/><p>“What the hell?” Almost everyone rolled their eyes.</p><br/><p>Zhang Yang laughed and said, “It’s true! I’m not lying! Remember the time I told you to collect some equipment with Vitality bonus? Now it’s the time to use them! The boss has one ulti,..well, technically it’s several skills put together..,”</p><br/><p>“First, the boss will randomly pick a player and cast a skill called “Something something Demon”. I can’t remember the skill’s name but the effect of the skill is to create a mirror image of the selected player. The generated mirror image of the player will have around the same attack as the player himself! However, it’s HP was just 10,000 HP. Just like the Explosive Bug from earlier, only the selected player could see and attack the mirror image.”</p><br/><p>“If you do not kill the summoned image, it will remain forever there. If the player was picked again the second time, it will generate another image and so on, so forth.”</p><br/><p>“The image, or shadow must be killed off as soon as possible since it will disrupt the party attack. The defeated shadow will drop something like a blood fragment that would be used in the finale.”</p><br/><p>“After the boss uses the shadow summon skill, it will cast a shield on himself, causing him to be immune to all attacks. He will also recover 3% HP every second for 33 seconds! That means that, unless we break the shield, the boss would recover full HP and we would have to start all over again!”</p><br/><p>“The only way to defeat the boss is to kill the summoned image, get the fragment and break the shield on the boss!”</p><br/><p>“However! We should not simply use the fragment as soon as we obtain any of them! Once the shield on the boss is broken, it will unleash a skill that would damage everyone in the room by 5000 Fire damage! That was why I had asked you to collect high Vitality equipment!”</p><br/><p>Zhang Yang continued, “Now that you’ve listen to what I’ve said, I’ll summarize it all. Kill the shadow, heal everyone to full health, and finally break the shield!”</p><br/><p>“Aiyaya…If Endless Starlight was picked, I’m afraid that we would only manage to break the boss’ shield when he has healed by more than 200%!” Fatty Han teased Endless Starlight.</p><br/><p>Endless Starlight was rather down during the Explosive Bug fight. But now that was over and all, Endless Starlight was confident that he could surpass this level as well. “Haha! Just you wait and see!”</p><br/><p>“Woah! We got a badass cherry boy over here!” cried Fatty Han.</p><br/><p>Everyone changed into their own high Vitality equipment and beefed up themselves. When everyone else was doing just fine, Daffodil Daydream was falling behind the “absolute safe line” Since she had joined the party rather late, the equipment that she had was rather inferior to the rest of the party member. Unlike Endless Starlight that could immediately gained extra 1600 HP just by equipping a new shield, Daffodil Daydream as nowhere near to the safe HP limit. She was so anxious about it that she could start crying.</p><br/><p>Han Ying Xue laughed at her reaction and consoled her. “Relax Daffy! When we will break the boss’ shield, I will put a on you. The shield could absorb at least 2000 damage! It’s the same as having an extra 2000 HP in hand!”</p><br/><p>After listening to Han Ying Xue’s explanation, Daffodil Daydream finally relaxed and wiped her tears away.</p><br/><p>“Alright, alright. Prepare to fight! Once we defeat this boss, we would finally face Master Waller!” Zhang Yang unsheathe his sword and cried. “Same old style. Only use the power potion when you need it!”</p><br/>\n</div>"}