{"title": "Chapter 163: Strong Support", "id": 163, "volume": 2, "url": "http://boxnovel.org/mmorpg-rebirth-of-the-legendary-guardian-chapter-163-strong-support", "volume_title": "Volume 2", "body": "<h1>Chapter 163: Strong Support</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 163: Strong Support</p><br/><p>Translator: Editor:</p><br/><p>Zhang He Yuan wished he could just faint right there and then. That way he would not have to face Ma Wu Shi’s scary eyes that were about to fire lasers! Zhang He Yuan was an old veteran officer, his body and health have always been at tip-top condition; it was difficult for him to even get dizzy!</p><br/><p>He put on a thick-face and first explained the matters with Sun Xin Yu and Ma Hang. He was smart enough to omit words that Ma Hang had used such as “b*tch” and “f*ck her brains out”. He then told everything out about how Ma Hang wanted to make a move towards Sun Xin Yu but was in the end, rejected by her and led to the injury on his head.</p><br/><p>Among the chattering, another high-ranking officer came by. It was Gu Jun. When Zhang He Yuan had contacted the Chief, he had also contacted Gu Jun to come over. Ma Wu Shi, the Chief of the Public Security Bureau of the Ping Jiang District, was not afraid of Gu Jun, but this little Captain could not handle the wrath of an executive deputy chief.</p><br/><p>Gu Jun is a gentle, salt to the earth kind of middle aged man. At the age of 37, the man was already a deputy chief! His had a bright future ahead of him, with many more stairs to climb!</p><br/><p>After both of them listened to Zhang He Yuan’s explanation about the little incident, both of them remained as stoic as statues.</p><br/><p>They had to have powerful mastery over their own emotions before being able to stand at their current rank. If someone was hot tempered and emotionally unstable, he would have been discarded from the force as soon as he showed his bad side. Ma Wu Shi was the real Chief in charge of the entire Bureau, he would know everything that happens inside the department. Even if he had forgot about something, he had his secretary to help him handle minor things. That was why Ma Wu Shi was very clear about one fact, Sun Xin Yu was one of Gu Jun’s!</p><br/><p>If the situation was different, he would have gladly let things slide off. In a way, he would get Gu Jun to owe him a favor or to gain his trust. That way, he could also suppress the other two nosy executive deputies. However, today was different, the one who got hit was his son! His only son! If he had let this off, he could not have lived with the decision! He would also let the entire bureau start having assumptions that Ma Wu Shi was lower than Gu Jun! His authority would be compromised!</p><br/><p>Ma Wu Shi immediately turn to Gu Jun and give him a death stare. What he meant was, “Don’t you dare to interfere! Or else I will have your neck for this!”</p><br/><p>Gu Jun sighed heavily.</p><br/><p>Truthfully, Gu Jun was not at all familiar with Sun Xin Yu. He had only recommended Sun Xin Yu to enter the force as favor for an old friend. That old friend was also similarly rank as he was, an executive deputy in the Trade and Commerce Department. Since he shared a relationship with him,he had no qualms making an arrangement for her. Normally, Gu Jun and Sun Xin Yu would not have made any contact, he had never even seen her face before! The last thing he was expecting was to receive a call from Zhang He Yuan, telling him that Sun Xin Yu had beat up Chief Ma’s son! That gave him an unpleasant surprise.</p><br/><p>Gu Jun understood Ma Wu Shi. He was ill-tempered and easily harbored grudges. For someone to strike his son, things would never end well! He did not want to offend Ma Wu Shi, but who asked Gu Jun to have a relationship with Sun Xin Yu?! In the end, he had to make an appearance at the scene to help settle things down. When he was at the receiving end of Ma Wu Shi’s death stare, Gu Jun had come to an understanding. Unless he had to fight head to head with Ma Wu Shi, he could not protect Sun Xin Yu! Is it worthwhile for him to commit an offense just because of a distant relationship?</p><br/><p>The answer was obviously no!</p><br/><p>Eventually, Gu Jun had to nod his head bitterly. What he meant was, “Do what you want. I won’t interfere!”</p><br/><p>Once Ma Shi Wu had Gu Jun stand down, the next one was Sun Xin Yu herself. He reached his hand to his back and stood tall, posture like an outstanding leader and said. “Sun Xin Yu. As an officer of the law, your duty is to protect the public security! Not trampling around like a rampaging beast! Look at yourself! What have you become! You would even raise your fist against your fellow officer! With this kind of behavior, how could a leader let you go on protecting the citizen? People like you are the ones who would cause the bureau to lose it’s purpose! We would be looked down upon!”</p><br/><p>As his speech went on, his hands went from his back and made frantic gestures at Sun Xin Yu, pointing at her agitatedly.</p><br/><p>A few more people around had heard the commotion, but since the deputy chief and the chief himself was there, neither of them dared to move closer. They could only stand at a distance to listen and peek at the scene. Most of them did not know what was going on, but when they heard Chief Ma scolding Sun Xin Yu, one by one, they stared with pity and empathy.</p><br/><p>*Stomach grumbles*</p><br/><p>Zhang Yang’s poor tummy had been grumbling all morning! He had not eaten anything since last night!</p><br/><p>With a sudden turn of event, Zhang Yang had miraculously turn from a main character to only a side character. By the looks of it he was about to get his 3 strike out! Zhang Yang then quietly jerk Sun Xin Yu’s sleeves and whispered. “I say, can you really survive this?” As cold as the polar ice caps, this woman was not stupid, she would not have struck the son of the Chief without some kind of trump card hiding somewhere.</p><br/><p>Sun Xin Yu only looked at Zhang Yang coldly for a second before turning back to the Chief. The edge or her lips twitched a little. Zhang Yang knew by then, that she was not even taking this seriously.</p><br/><p>As expected of the Chief of the Public Security Bureau. This man had used the law and the code of conduct to pressure Sun Xin Yu. But the way he spoke, so angrily and antagonizing that if he had not drag Sun Xin Yu out to the street and have her shot dead, he would not have pacified the rage of the public.</p><br/><p>“…Such a liability to the force, how could we still protect the public with her in the bureau! I strongly suggest that we remove her Sun Xin Yu from her duties! Remove this poison from the force! Mr. Gu, what say you?!” Ma Wu Shi turned to Gu Jun.</p><br/><p>Gu Jun silently cursed. He had already expressed his intention to stay out of this mess, why would that dumb Chief Ma drag him back into the mess? Did he not know that Sun Xin Yu was his recommendation to the force? If Gu Jun had agreed to fire Sun Xin Yu, that it would be slapping himself in the face, admitting that he had failed to judge a person’s potential!</p><br/><p>Gu Jun was not someone as soft as a peach; easily manipulate. But for this matter, Sun Xin Yu was indeed at the wrong side of the law. She was the one who had struck first. Gu Jan had nothing to say in this matter. He sighed and turned around.</p><br/><p>Ma Wu Shi smiled sinisterly and turned his gaze onto Sun Xin Yu. “I hereby announce that Sun Xin Yu is to be relieved from all her duties and is to be stripped of her position as an officer of the Public Security Bureau!”</p><br/><p>“Father…” After catching his breath for some time, Ma Hang jumped into the scene and said, “Don’t fire her just yet! Let her work under me! I will personally make her suffer!”</p><br/><p>Ma Wu Shi was to angry that he nearly face palmed there and there! How could he have such a dumb son! You could not say something like that in the open! Did he think that the Public Security Bureau was his to play with? What a dumb block! He could just wait until he fired Sun Xin Yu, and then have her arrested for assault! By then you can have your own way with her.</p><br/><p>“Keep quiet!” Ma Wu Shi stared at his son with a warning.</p><br/><p>Ma Han quietly sat down and remain silent.</p><br/><p>On one side, Gu Jun was snickering silently.</p><br/><p>A silent jeer echoed louder than words.</p><br/><p>Sun Xin Yu stared at Ma Wu Shi coldly and said, “Are you sure you want to fire me?”</p><br/><p>Ma Wu Shi laughed. “You think that I can’t fire you now?”</p><br/><p>“Are you certain that you want to fire me?” she asked again.</p><br/><p>Ma Wu Shi was completely infuriated. He cried out, “Zhang He Yuan! Cuff her up! Hmph! I will charge you for intentional assault on a police officer! That’s a heavy crime!”</p><br/><p>Sun Xin Yu laughed coldly. “You don’t have the authority to fire me!”</p><br/><p>What is she saying?! Had she lost her mind?! Ma Wu Shi was already angered beyond words. Gu Jun was shaking his head on the other side of the room. He knew about Sun Xin Yu’s trump card. But when someone was as prominent as Ma Wu Shi, he would not even have to worry about a Trade and Commerce deputy chief!</p><br/><p>Sun Xin Yu took out her mobile phone and quickly search for a number, calling it.</p><br/><p>Ma Wu Shi stared at Zhang He Yuan angrily and bellowed. “Why are you still standing there for?! Are you expecting me to personally arrest her?”</p><br/><p>When titans clash, the mortals could only cower in fear. Zhang He Yuan turned around and turned his eyes onto Gu Jun. He could not disobey Ma Wu Shi’s order but he did not want to offend Gu Jun as well. Being the middle man is not an easy task!</p><br/><p>“Uncle Kuan! It’s me! How are you?” While everyone eyeballs were directed towards her, Sun Xin Yu was on the phone, talking to a family member.</p><br/><p>When Zhang He Yuan had finally notice Gu Jun would not look directly at him, he finally understood that Gu Jun had not want any of this to do with him! Zhang He Yuan gathered his courage and walked to Sun Xin Yu. “Little Sun. Please cooperate with me here. Hang up the phone and put your hands behind your back!”</p><br/><p>Instead of complying, Sun Xin Yu took a few steps forward and handed over the phone in her hand to Ma Wu Shi. She quietly stared at him, indicating that there was someone on the other side of the phone wanting to speak with him.</p><br/><p>Ma Wu Shi had never seen anyone as crazy and bold as Sun Xin Yu. He laughed a bit and said, “Who do you think I am? I am the Chief of the Public Security Bureau. Someone of a high rank. Not anyone can just simply talk to me!”</p><br/><p>“MA WU SHI. PICK UP THE GOD DAMNED PHONE. YOU SON OF A B*TCH!” Even though it was only from the phone speaker, it was rather clear but not loud. Before Ma Wu Shi could continue bragging, he completely froze in place when he heard the voice.</p><br/><p>That voice…he knows that voice! That was the Kuan Peng Fei! The Zhou Shu City Municipal Secretary! Other times, he would have smiled like a child obtaining a candy when he had pick a call from this man! But now! This is the Municipal Secretary, a man of an even higher-ranking position, who has been driven to the point to curse over the phone. It was then made clear to him, this woman, Sun Xin Yu was a woman of a certain caliber!</p><br/><p>Ma Wu Shi strongly believed that even if the situation had changed from Sun Xin Yu to Kuan Peng Fei’s own son, Kuan Peng Fei would not get so agitated! At most, he would only silently apologize to the respective department.</p><br/><p>But now, even the dignified Kuan Peng Fei had lost his composure! That could only mean that Sun Xin Yu was someone of even higher importance! Just how far did this woman’s influence go? It must be as high as state level authority!</p><br/><p>In an instant, Ma Wu Shi was completely stunned. His hands trembled as he reached for the phone in Sun Xin Yu’s hands. He almost dropped the phone when he tried to place it at his left ear.</p><br/><p>“H-Hello? This is Secretary Kuan? Ah ha ha…Yes. This is Ma Wu Shi…What!? No. No. No! I never meant it that way! Yes…yes…yes…We at the Ping Jiang District Bureau will cooperate with the Secretary…”</p><br/><p>Anyone with an average level on intelligence could understand that the person on the other side of the phone was someone of a higher rank than Ma Wu Shi. It must be a leader of a city level rank! Secretary Kuan? There are only very few leaders by the name of Kuan in Su Tong City. However, there would only one person in the city level rank, that is Kuan Peng Fei Municipal Secretary.</p><br/><p>Holy crap! Anyone who understood the situation sucked in a sharp breath. To think that she could just simply pick up the phone and call the Municipal Secretary to aid her…just how powerful is this woman was? Everyone changed the way they looked at Sun Xin Yu. Before, it was a in rather patronizing and pitiful manner, but now…they were completely awed by her.</p><br/><p>Gu Jun was rather devastated with regret! If only he had stood up and defended Sun Xin Yu, he would have gotten on the good side of the Municipal Secretary! Oh lord! He was just a small seated little officer…if only he could just latch onto the Municipal Secretary and get along with him…</p><br/><p>Deputy Chief Gu was so jealous that word could not describe how he had felt! He turned his sight over at Sun Xin Yu and observed her. This ever-cold woman was still calm and cool. Even after such a commotion with the chief, she had not lost her composure and remained completely stoic and emotionless. It was as if she had just deflected bullets off her massive chest like the dust on her shirt.</p><br/><p>Based on more than 10 years of his experience in the force, Gu Jun had concluded that this woman…was not to be trifled with. But when he swept around and spotted Zhang Yang, he smiled. This young lad looked like he was rather close to Sun Xin Yu. Perhaps he could make use of the young man!</p><br/>\n</div>"}