{"title": "Chapter 176: Humbly Gentleman The Buffoon", "id": 176, "volume": 2, "url": "http://boxnovel.org/mmorpg-rebirth-of-the-legendary-guardian-chapter-176-humbly-gentleman-the-buffoon", "volume_title": "Volume 2", "body": "<h1>Chapter 176: Humbly Gentleman The Buffoon</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 176: Humbly Gentleman The Buffoon</p><br/><p>Translator: Editor:</p><br/><p>The next morning, logging in to the game, Han Ying Xue and the rest were all present, waiting for him to regroup with them to depart for the Centaur Palace 1st floor, to grind their levels of course.</p><br/><p>Needless to say, they were current having an extra 100% additional experience points, but even if they did not have such beneficial effect, the dense number of the melee monsters were also suitable for group sweeping, it was a sacred paradise for leveling up! Because the entrance of the valley was also very well hidden, unless you receive a quest navigation that is related to the place, normal players would not be able to locate the place.</p><br/><p>Of course, if players fell down the cliff like how Daffodil Daydream and Endless Starlight did, then it would be a whole different story!</p><br/><p>After a full day of grinding, everyone got a flash of golden light through their body, twice to be precise, they had progressed up by 2 levels, consecutively! And now, every single one of them are on the White Jade City’s top level list! Among them, Han Ying Xue and Fatty Han had conquered the first and the second places respectively on the top level list of the whole China region, with both of them at level 47!</p><br/><p>With such incredible speed in leveling up, it was natural for the players in China region to feel extremely surprised. But very soon, everyone understood, they had an additional of 100% additional experience points upon the experience points they earned!</p><br/><p>But for those clever ones, they would know something was not right, even with the addition of 100% additional experience, a player would still require one day to level up by 1 level. On the other hand, grinding through slaying monsters like there is no tomorrow, they themselves would still require 5 days just to level up!</p><br/><p>It was certain, that the strong players on the list must have found some sacred paradise for them to grind!</p><br/><p>All Guildmasters from all the guilds were not idiots themselves, and of course, instantly, they related Zhang Yang to the previous achievement of acquiring the First Clear title for the first Yellow-Gold Boss. So immediately, they planted spies into the Lone Desert Smoke with the goals to locate Zhang Yang and the others’ wherebout!</p><br/><p>However, even though they could see clearly that Zhang Yang and his gang were located within the Land of the Red Cloud, their specific coordinates were yet to be known, they had to go and find out by themselves!</p><br/><p>The map of the Land of the Red Cloud was incredibly vast, and the valley where the centaurs were located is extremely far-off. If they were to find them by then, Zhang Yang and the others would have reached level 50 or above, ready to remove themselves from that part of the map!</p><br/><p>After dinner, Zhang Yang logged into the game around 6:30pm, saddled up and headed towards his Little Merchandize Shop to get ready for the auction.</p><br/><p>The moment when he was arriving from afar to his shop, he saw a bunch of people gathering around his shop, wandering around the entrance trying to stick their necks in to peek around. Their movements and expressions revealed their anxiousness. Zhang Yang kept his battle horse and walked towards the door to take a look. Holy moly! His shop was also occupied from the inside, crowded with people!</p><br/><p>The merrier the better! That would only means the competition would become even more intense, and the auction price of the item would become even higher! It was supposed to be good news, but when Zhang Yang saw that most of the people in the shop were actually members of The Dominators, the guild symbols above their heads showed it all! Rage filled his heart, it was outrageous!</p><br/><p>At least 90% of the people within the shop are the members of The Dominators!</p><br/><p>To purchase a [Guild Upgrade Order], it was sufficient for each guild to send only one member over to make the transaction. Sending tons of men over, they were obviously here not for the [Guild Upgrade Order], but they were actually here to stir things up!</p><br/><p>As the game’s setting prohibited players from walking through solid objects, as long as The Dominators fully occupied the space of the shop with their bodies, no other players can enter the shop! Furthermore, main cities prohibited PK battle, everyone was invincible in their own existence, it would be impossible to kill other players and step over their dead bodies to get by!</p><br/><p>With a face full of rage, Zhang Yang forcefully calmed himself down. Then he walked up to the people at the roadside and asked, “Brother, are you here for the auction of the [Guild Upgrade Order]?”</p><br/><p>“Yea!” the person who replied was a human magic caster named Falling Maple, “But there is no way we are able to go in, how to participate in the auction! F*ck this sh*t! The Dominators are really domineering in their way! If I am the one who gets the upgrade order, I will level up my guild, summon 20,000 players and kill them everyday over and over again!”</p><br/><p>There were more people at the side revealing their dissatisfaction, it seemed that the selfish act of The Dominators had gone so far that it triggered the rage of righteous of the public!</p><br/><p>Zhang Yang grinned deep down his heart, thinking over about how despicable this Humbly Gentleman could be, to use this kind of lowly means to get to him? So he spoke with clear voice, “Everyone, everyone! I assure you, today, everyone gets to go in to the shop! As long as you provide the correct amount of money, you will have a chance to bid for the purchase of the guild upgrade order!”</p><br/><p>The few dozens of people standing by the turned their attentions towards Zhang Yang, with their face full of questions.</p><br/><p>Zhang Yang laughed and brought up his personal character information with a swipe of hand.</p><br/><p>‘Zhan Yu, Crypt Slaughterer, Physician’s Friend, Hero of White Jade Castle, Warrior of the Centaur, Level 46, Human, Male, Guardian Warrior, .’</p><br/><p>It’s such a long title! It’s awesome!</p><br/><p>“Zhan Yu, it is really Zhan Yu!”</p><br/><p>“That’s incredible! I’m shaking just reading that!”</p><br/><p>“Anyone interested to join my guild? I shall grant you a the position of vice president, 100,000 cash as monthly reward!”</p><br/><p>The people outdoor were agitated with excitement.</p><br/><p>“Hahaha,” Humbly Gentleman put up a good man face and walked towards the crowd, and then he said, “So here comes the crowd, the auction for the [Guild Upgrade Order] shall be concluded with a high price, aiya, Guildmaster Zhan Yu is going to make big money this time! Congratulations!”</p><br/><p>Falling Maple and the others saw him and revealed their anger on their faces, and shouted, “Humbly Gentleman, what is the meaning of this, bringing all your men to clog up the shop! How are we going to enter the shop to participate in the auction?”</p><br/><p>Humbly Gentleman smiled pridefully, saying, \"Guys, you are blaming the wrong person! A shop is meant for selling things, and there are no rules about who can enter or who cannot enter the shop. And the saying goes, the shop welcomes the world! Are you saying that everyone needs your approval to enter the shop? I said, one cannot be too arrogant!”</p><br/><p>Sun of the beach! Everyone who was present could only think of one sentence to express their feeling. This son of a b*tch was not only capable of blatant self-flattery, but went on to accuse others of being stepping over unseen boundaries! At such a level of hypocrisy, it was more apt to call him a b*tch, rather than the son of one!</p><br/><p>Zhang Yang smiled, and he said, “Some people just like to be smarty-pants, but in truth, these people are just boneheads!”</p><br/><p>Even though Zhang Yang did not point out the name of the person he was talking about, but Humbly Gentleman had already condemned himself to the topic, so he grinned and said, “ Zhan Yu, let me put this straight to your ears today! That piece of [Level 2 Guild Upgrade Order] of your can only be sold to me, and also, hmph hmph! If you refuse my toast, then you shall be forced to drink a forfeit!”</p><br/><p>He put up his left hand and opened up to show his five fingers, and then he said, “500 pieces of gold! If you dare to give a price higher than this, from now onwards, hmph hmph, the customers that are in the shop right now shall come again everyday, and your business shall be zero!”</p><br/><p>Falling Maple and the others were furious beyond words even before Zhang Yang could speak. They stepped forward to curse Humbly Gentleman for being a shameless Guildmaster, such a waste!</p><br/><p>The more they cursed him, the happier he became. He is born a masochistic b*tch, feeling an itch when nobody cursed him.</p><br/><p>Zhang Yang laughed out loud and said, “Gentleman, there is no need to bother yourself arguing with the likes of him, putting yourself to the same level as him!”</p><br/><p>“Zhan Yu, let see how long more can you keep that smile of yours on your face! It’s about 7pm now, you better hurry up and get ready for the auction! You are not going back on your words and give up on the auction for today, are you? Tsk tsk tsk, then we shall have this as the front page news for tomorrow!” Humbly Gentleman laughed as he felt prouder and prouder as the moment passed.</p><br/><p>Previously, he was tricked of tens thousands of gold pieces by Zhang Yang, and it had bothered him since then, making his life miserable until now. If he could return the ‘favor’ as ruthlessly as possible, how could he rest peacefully in his sleeps for the rest of his days?</p><br/><p>Zhang Yang shook his head and said, “Hypocrite, what a shame, how much can a frog know while staying in the bottom of the well all the time? One cannot talk to summer insects about the ice!”</p><br/><p>Humbly Gentleman was provoked, so he spoke, “Bastard! What’s with all the freaking idioms!” As he was low in his cultural level, he hated people who loved to use idioms and poems the most.</p><br/><p>Zhang Yang gave another smile and said, “When you have your own land properties in the future, you shall understand how idiotic you were today! Just like a buffoon putting up a great and entertaining performance for me to enjoy!”</p><br/><p>“Hmph hmph, then laugh all you want now while you still can! Because later, you can only cry as much as you want!” Humbly Gentleman spoke out of his rage.</p><br/><p>Zhang Yang shook his head, immediately he pulled up his land property setting and went into the configuration screen of his Little Merchandize shop. He can operate his shop at any point as long as he wanted to, only accessing the storage, checking the store’s warehouse and monitoring the shop’s marketing situation required him to be in the shop himself!</p><br/><p>Entering the Little Merchandize’s blacklist setting, Zhang Yang selected to blacklist a guild. After he entered the name ‘The Dominators’ into the entry box, he smiled and spoke to Humbly Gentleman, “Witness the great magic that I am about to show you!”</p><br/><p>“What ------” Humbly Gentleman had just begun to speak, but in a sudden, he realized that the men he arranged to stand guard within the shop had been respawned to a location 10 meters away from the entrance of the shop!</p><br/><p>The members of The Dominators were at loss from the looks of their faces, having no idea on how did they miraculously been teleported out from the shop! Some of them attempted to rush back into the shop, but the moment they put their first steps into the shop, they were instantly repulsed, as if there was an invisible wall in front of them.</p><br/><p>“Boss ------” The members of The Dominators immediately sent Humbly Gentleman secret messages, saying that “I cannot get into the shop anymore! The system said that I am being refused to be accepted as the guest of the Little Merchandize shop!”</p><br/><p>“Boss!”</p><br/><p>“Boss ------”</p><br/><p>“Boss ......”</p><br/><p>Similar secret messages were received and shown in front of Humbly Gentleman.</p><br/><p>In just an instant, Humbly Gentleman’s face turned ghastly pale, it was not a wonder that Zhang Yang was fearless towards all his actions and words. So, the owner of the land property had the power to expel the guests! Humbly Gentleman had not possessed any land properties before, and he thought that what he was doing can become a major hindrance to Zhang Yang. But now, his actions were completely wasted and he became a buffoon that had put up a great and entertaining performance! He had lost his face all the way down to the ground!</p><br/><p>Zhang Yang did a gesture of welcome at Falling Maple and the others, “Gentlemen, the space is vast, welcome in!”</p><br/><p>Falling Maple and the others were laughing out loud, one by one they passed by Humbly Gentleman before entering the Little Merchandize shop. They did not forget to show him their contented faces, provoking Humbly Gentleman to the point that he was having metal meltdown, it was marvelous!</p><br/><p>“Zhan Yu, you ------” Humbly Gentleman had finally exploded with anger.</p><br/><p>But Zhang Yang replied with a “Aiya” and said, “It is almost showtime, I have to get ready for the auction, sorry that I cannot accompany you, Mr.Hypocrite!”</p><br/><p>“Stay there!” Humbly Gentleman went into rage, and just when he was trying to move his legs to pursue Zhang Yang, he crashed into an invisible wall and instantly, he was bounced back!</p><br/><p>‘Ding! You have been listed as the rejected customer of the Little Merchandize shop, you cannot enter!”</p><br/><p>The system announcement gently informed Humbly Gentleman by his ear, making him even more angry to the point that he almost puked blood!</p><br/><p>After the humiliation he had sentenced upon Humbly Gentleman, Zhang Yang’s mood had improved a lot, so he whistled along while waiting for the clock to strike 7. Awhile later, other than Sun Xing Yu, Han Ying Xue and the gang had arrived at the scene to witness the fiery scene of the auction that yet to happen.</p><br/><p>The number of people were increasing, although the Little Merchandize shop currently was a 4-story shop, but the crowds were very tight, making the situation so much merrier.</p><br/><p>Zhang Yang immediately issued a notice under the name of Little Merchandize, saying, \"Ladies and gentlemen, as it is too crowded at the moment, so we shall only entertain the customers who are here for the auction for the Guild Upgrade Order from 7 pm to 7:30 only! So, for those who does not wish to participate in the auction activity, please leave the premises for the time being, we appreciate your understanding. In addition, each guild just needs to send a representative on the line. If more than 2 members from a guild is present, I will have to use my right as the owner of the shop to kick players out! Your understanding will be greatly appreciated!”</p><br/><p>After 3 consecutive times of publishing the notice, the crowd finally dispersed, the people left the shop premises one after another. But there were still some players without guild names wandering around in the shop.</p><br/><p>Zhang Yang could not help himself but smile, secretly he told himself, so that Mr.Hypocrite has not given up on him yet? Making his members to quit the guild and come forth to stir things up again?</p><br/><p>Once again, he pulled up his blacklist option in his land property setting, and by the name of the owner of the shop, he specifically put certain players’ names into the blacklist list. He did not even have to identify the message of the players, as long as he confirmed, the system will record automatically.</p><br/><p>Shoof shoof shoof, a lot more players had been kicked out of the shop.</p><br/><p>Finally, it was 7pm, Zhang Yang officially began the auction for the [Level 2 Guild Upgrade Order].</p><br/><p>“This is the moment that we have been waiting for, now, let’s begin the auction for the [Level 2 Guild Upgrade Order]! You can bring up the item search page and enter ‘Level 2 Guild Upgrade Order’ or ‘Guild Upgrade Order’ or ‘Upgrade’ as the keywords to search and locate the item. Then you can view the current price of that item through the refresh button!\"</p><br/><p>“The base price for the [Level 2 Guild Upgrade Order] is 50000 pieces of gold, each increment of the price must not be less than 1000 pieces of gold, and you can increase it as much as you want, to infinity! Everyone can freely increase the price, and when the price does not increase for 20 seconds, I will announce the price of the item and count 3 times. If no one is there to increase the price after the count of 3, the item will be sold!”</p><br/><p>Zhang Yang smiled for a bit and said, “Then, let’s begin!”</p><br/><p>50000!</p><br/><p>100000!</p><br/><p>150000!</p><br/><p>In front of Zhang Yang, there was a display, the above shows the changing price of the [Level 2 Guild Upgrade Order] at all times, at the side of the price is the bidder’s ID. The price will not be scrambled, because once a player has placed a bid, the player’s money will immediately be deducted by the system, when the amount of his or her bid is overtaken by other’s bid, the deducted money will be returned back to them to prevent anyone from bidding with malicious intent.</p><br/><p>Han Ying Xue and the others surrounded around Zhang Yang, they were all pleased to see the drastic rise of the price. Wei Yan Er and Han Ying Xue were not short in money, so they just loved to enjoy the process of making money, but it was different for Fatty Han and the others. For them, tens of thousands of dollars is considered as an incredibly huge income!</p><br/><p>“It’s still rising, it’s still rising!” Daffodil Daydream was screaming with excitement.</p><br/><p>200000! 400000! 500000!</p><br/><p>The price had increased to where the public can manage within such a short time frame. The second piece of [Guild Upgrade Order] is not as precious as the first piece, but still was one of a kind by it’s own. It did not matter it is a large guild or a small guild, everyone has the urge to own it, and take the opportunity to strongly promote their own guild!</p><br/><p>Therefore, the price has not reached the bottom line of acceptance of these particular players. The price was still increasing, just not as swiftly as before.</p><br/><p>600000! 700000!</p><br/><p>The price seemed to have frozen at 700000, and it stayed the same for quite awhile. Zhang Yang waited for a full 20 seconds before he started to speak, “The current price is at 700000 pieces of gold! 700000 going once...... 700000 going twice...... 70 going thrice....”</p><br/><p>1000000!</p><br/><p>The price on the display screen suddenly changed, increasing by almost 50% margin!</p><br/><p>Zhang Yang was stunned, not because of the unexpected change in price, but because of the person’s ID who placed the bid ------ Snow Seeker!</p><br/><p>What a rich woman!</p><br/>\n</div>"}