{"title": "Chapter 180: Expedition, Start!", "id": 180, "volume": 2, "url": "http://boxnovel.org/mmorpg-rebirth-of-the-legendary-guardian-chapter-180-expedition-start", "volume_title": "Volume 2", "body": "<h1>Chapter 180: Expedition, Start!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 180: Expedition, Start!</p><br/><p>Translator: Editor:</p><br/><p>Time flows like the river; in a flash, it was already the end of September and also the completion of the item submission quest!</p><br/><p>‘Ding! Players of White Jade Castle! The item submission quest has ended! By the order of the King of the Empire, the Army Expedition will officially start tomorrow at 10am! Please make your preparations for war!’</p><br/><p>Everyone is the city received the system notification when the expedition item submission quest was completed.</p><br/><p>“Please rest early tonight! Tomorrow is the day we fight in the war! The battle will be extremely draggy! My advice, do not stay up tonight! Rest well and be ready to fight a lengthy war!” Zhang Yang posted in the guild notice.</p><br/><p>After the efforts of both Hundred Shots and Daffodil Daydream, Lone Desert Smoke had begun to display a professional guild’s behavior. At least, for now, Zhang Yang could still control the members’ actions to a certain level.</p><br/><p>With the call from Sky High guild master, Sky Shaman, he called for a meeting for all big and small guilds to gather and discuss about the incoming war. All 63 guild masters sat together and had come to an agreement. Clearly, everyone treated this Expedition quest as their first priority. After all, it’s for the glory of White Jade Castle, their own city!</p><br/><p>Now that the official statement had been released in the official website, almost everyone had understood the details of the incoming war. In summary, survive and defeat all 10 waves of monsters and dominate the enemy base Territory! The battle will be hard, but the rewards will be worthwhile. According to the explanation, each minion will have a 10% chance to drop a Black-Steel equipment. Elite monsters will have a 5% chance to drop a Green-Copper equipment. And after each wave, there will be a boss that will drop a Gray-Silver equipment! There will be a chance for a Yellow-Gold boss to appear in the field as well!</p><br/><p>However, each wave of minion will only have one boss, after all and all, there will be only 10 bosses in total. With such a low supply for so many players, the meeting between the guild masters went on and one as everyone discussed on how to properly distribute the chances to fight the boss. Without a proper arrangement, everyone will race with each other to kill the boss; a first come first served tactic leading to the demise of all!</p><br/><p>After a thorough discussion, for the benefit of all, everyone had finally came to a decision that each guild will arrange their own positions in the battle ground and protect their own. When the boss appears in the field, whichever side that the boss appears to will automatically claim the right.</p><br/><p>Without the guild’s consent of invitation, other guilds shall not interfere with the boss fight! If any guilds broke the rule, they will make themselves public enemy number one!</p><br/><p>Zhang Yang contacted Snow Seeker and Crimson Fire. Since they were his allies to begin with, they should watch each other’s backs in the war! In the war, unless there is a player with a Celestial-tier equipment in the battle, everyone’s strength in the war would amount to nothing without team work.</p><br/><p>The 3 guild masters discuss and agree that in tomorrow’s war, that all 3 guilds would form a single defensive formation and protect each other!</p><br/><p>The next day was October the 1st, which was also 3 month after the launching of the game. Today is the day the Expedition Army sortie out!</p><br/><p>‘Ding! Players of White Jade Castle! The Expedition Army will sortie in one hour! Please pick up your swords and shields, the time to fight for the Alliance has come!’</p><br/><p>Zhang Yang combined all 9000 and more players in the guild and formed 9 massive parties. Each thousand-man party will have one leader and 20 sub leaders. Each sub party will answer to the main leader and those main leaders will answer to Zhang Yang, forming an organized chain of command.</p><br/><p>By then, players would not have to deal with the measly trouble of boarding a Griffin to travel all the way to the battle ground. One hour later, when the Expedition Army sorties, the Teleportation Circle will appear. An extra-large Teleportation Portal will immediately send the players to the battle ground.</p><br/><p>One hour later…</p><br/><p>‘Ding! Players of White Jade Castle, please head to the Teleportation Circle to join the front lines! This historical battle awaits your arrival!’</p><br/><p>Zhang Yang commanded his “troops” to stand by and let the crazy, bloodthirsty fanatics go through the portal first. Until 10 minutes later, when the number of players has substantially decreased, Zhang Yang pulled out his battle axe and cried out loud. “For victory!”</p><br/><p>“FOR VICTORY, HURRAH!”</p><br/><p>Now that Lone Desert Smoke had reached level 2, as long as players in the guild were at level 35 or more, they could go to the guild shop and buy themselves a [Storm and Gale Direwolf]! The majority of Lone Desert Smoke member were already riding on the back of their own magnificent and grand Direwolf, threading lightly through the portal and into a strange new land.</p><br/><p>They appeared at the slope of a small hillside. Not far ahead was the army, with the flag flapping against the squall. The army was huddled together in a long stretching defense line and measured almost 10km far. Further ahead, about 500 meters north of where they were, stood a massive fortress that was built along the hills. The fortress was the only thing between White Jade Castle and the outside world!</p><br/><p>The fortress of the enemy was affixed with many magic canons! Those contraptions were so strong that it could easily flatten, obliterate, smash, crush everyone at their current level!</p><br/><p>Zhang Yang swiftly contacted Snow Seeker and Crimson Fire. The three massive guilds quickly group together and form a massive, 30,000 player alliance.</p><br/><p>‘Ding! The war will start in 30 minutes! Once the battle starts, the Teleportation Portal will close! Players who falls defeat can only revived in White Jade Castle and would no longer be able to participate in the war! Players must assist the Expedition Army to defend against 10 waves of enemy attacks. The Expedition will fail once all players are killed. After enduring all 10 waves of monsters, the Empire’s Dragon Riders will sortie and join the war to destroy the enemy magic cannons. Defeating the enemy fortress’ Demon General Nexxar will result in victory!’</p><br/><p>‘Ding! The system will record every single player’s contribution in the war and will select top 10 players with the highest contribution and award them with luxurious rewards! Rewards will only be distributed if players wins the war!’</p><br/><p>‘Ding! Nexxar will drop [City Order] on death. Players who obtained the [City Order] will become the fortress owner and gained the rights to it. The player will also gain the title ‘Hero of White Jade Castle’!’</p><br/><p>‘Ding! The Expedition will start over again in two days if players lose the war!’</p><br/><p>Some of the player were getting impatient as the read through the system notification. One by one they shouted and screamed.</p><br/><p>“Kill dem son of b*itches now! What are we waiting for? If we take down the fortress now! We will win the war! Why do we have to wait for waves of monster?!”</p><br/><p>Small party of players rushed towards the fortress.</p><br/><p>BOOM! BOOM! BOOM!</p><br/><p>The cannon blasted from the fortress and killed all players that had stepped too far away from the defense line.</p><br/><p>Being killed by monsters would not have any experience point deduction penalty. However, it will cost you’re your equipment endurance! The repair fees were expensive!</p><br/><p>Seeing is believing; and when other players and seen what if to become of them if they rushed into the warzone, so each of them quietly waited for the waves of monster.</p><br/><p>Zhang Yang switched to the party channel and said, “Note that when you die in the war, that will be the end of it. You cannot get anything anymore, not experience, not loots, nothing. That is why you must fight to stay alive! The amount of equipment dropped from monsters is not as important as the experience they could give out! This is a good chance to raise your level quickly! Furthermore, there is a Yellow-Gold boss! I don’t care about a Gray-Silver boss! But we must grab that Yellow-Gold boss!”</p><br/><p>‘Ding! The war will start in 20 minutes! Once the battle starts…’</p><br/><p>The system notification pops out again to remind the players the time they had left to prepare.</p><br/><p>‘Ding! Server Announcement: Longainer City army had started the war!’</p><br/><p>The world channel announced a message.</p><br/><p>Han Ying Xue and the rest of the party was rather baffled by the announcement and asked. “Zhan Yu, where is this Longainer city? How could they have started the war that quick?”</p><br/><p>Zhang Yang thought about it a while and explained. “I think its somewhere in the European country. Ah. Players from Longiner City are mostly from North Europe!”</p><br/><p>“Ahh. North European…I see. That place is doing quite well. Most players are otakus anyway! That is why even with lesser players, they could still proceed with the quest rather quickly.”</p><br/><p>North Europe’s society welfare was rather well during then. Many of those unemployed citizens could easily live comfortably as those who were employed, by using their government welfare funds. That was why the number of NEETs1 were rather high.</p><br/><p>With someone already on their tails, players from White Jade Castle were rather agitated. Afterall, this was would determine the standing of each city! Anyone would want to fight for their own city’s honor and glory!</p><br/><p>‘Ding! The war will start in 10 minutes…”</p><br/><p>‘Ding! The war will start in 5 minutes…’</p><br/><p>Zhang Yang walked to the front of “his army” and cried out. “The first few waves of monsters are rather easy to fight! We should stand in the front line and fight. We have many healers here so it should be fine! NPCs cannot receive any heals from players! So, we should let them handle the later waves! All Guardians, Defenders follow me! We shall stand in the front line!”</p><br/><p>With both Snow Seeker’s and Crimson Fire’s agreements, Zhang Yang had been selected to lead all 3 guilds.</p><br/><p>Thousands of players followed Zhang Yang to the front and went even further ahead of the NPC army. The front most position was filled with Guardians and Defenders forming a solid defense line. Behind them were the attacking classes and behind them were the healers and supporters. Zhang Yang had even commanded all melee attackers to stay behind the defense line to protect all ranged attackers and healers. They were tasked to kill off any monster and had made it through the defense line.</p><br/><p>When other guilds saw how Zhang Yang had form his defense line, they began to mimic his strategy. While some of them had followed Zhang Yang’s arrangement, other cowered behind the NPC, some even went as far as the slope’s peak! Obviously, they wanted to take advantage of the NPC to take on all monster’s firepower and play it safe.</p><br/><p>This method, was clearly represented by The Dominators! Not only had they hidden behind the NPC army, they too had gone back to the slope’s peak! It’s not that they wanted to remain at the slope. They could not withdraw any further since there was an invisible wall that prevented them to do so.</p><br/><p>Standing at the top of the slope, Humbly Gentleman looked down onto Zhang Yang and grinned. “Hmph. Dumb prick. Do you really want to play hero that badly? Heh! I shall see who squirms in pain when he dies!”</p><br/><p>A player standing next to him spoke out. “Boss. Isn’t is better for them to burn into dust? Who else can compete for the contribution rank with us? Hmph, I say, all bosses will belong to us, The Dominators!”</p><br/><p>Humbly Gentleman laughed. “You’re god damn right! This is what I would call, making a wedding dress2 for someone else!”</p><br/><p>“As expected of our brilliant boss! Besides, I’ve even seen people wearing wedding dresses but not for their wedding! They say we learn as we live and we can use that knowledge as we grow! Truly magnificent!” That underlings knew that Humbly Gentleman was just saying things that he did not know, or rather, Humbly Gentleman was a man with little knowledge of the world, yet his underlings would still kiss his ass for it.</p><br/><p>Humbly Gentleman looked at his underling with much appreciation and satisfaction.</p><br/><p>‘Ding! The war will start in 1 minute!’</p><br/><p>‘Ding! The war will start in 30 seconds!’</p><br/><p>10, 9, 8…</p><br/><p>3!</p><br/><p>2!</p><br/><p>1!</p><br/><p>A war horn was heard.</p><br/><p>‘Ding! Battle start!’</p><br/><p>‘Ding! The first wave of monster has started to come out from Tukulo Fortress!’</p><br/><p>With system notification, the door to the fortress opened and countless of blue apparitions rushed out of it like water from a dam! Most of the monsters were at least 2 meters in size yet a few of them were as tall as 10 meters tall, fairly visible among the crowd of monsters. The smaller ones were normal monsters while the big ones were obviously elites.</p><br/><p>[Apparition Guard] (Normal, Demon)</p><br/><p>Level: 51</p><br/><p>HP: 5,100</p><br/><p>Defense: 50</p><br/><p>[Apparition Killer] (Elite, Demon)</p><br/><p>Level: 51</p><br/><p>HP: 100,00</p><br/><p>Defense: 300</p><br/><p>After the implementation of the patch , players can now check the monsters Defense value.</p><br/><p>Zhang Yang raised his shield and sword and cried out. “Protect the front line! Stand your ground!”</p><br/><p>“PROTECT THE FRONT LINE!”</p><br/><p>“HURRAH!”</p><br/><p>“Kill!”</p><br/><p>As thousands of voices screaming out their battle cry, a strong aura was permeating from everyone, influencing the nearby player to be as passionate and eventually, the entire field was radiating with strong zeal!</p><br/><p>“GO GO GO!”</p><br/><p>“KILL!”</p><br/><p>Zhang Yang cried. “Let’s kick some ass!”</p><br/><p>“WOOOOAHHHH!”</p><br/><p>Thousands replied his cry.</p><br/><p>THUD! THUD! THUD!</p><br/><p>Marching sound was heard as the monster was approaching the players.</p><br/><p>BOOM!</p><br/><p>The first strike was unleashed, marking the first attack of the war!</p><br/><p>1NEET – Not under Employment, Education, nor Training. Refers to young people who were jobless and were not looking for a job.</p><br/><p>2Wedding Dress – This phrase is a common idiom in china. It describes someone else putting in effort for someone else’s sake. Here, Humbly Gentleman used the phrase to describe Zhang Yang doing all the work whilst Humbly Gentleman stands there waiting for the opportunity to grab all the glory.</p><br/>\n</div>"}