{"title": "Chapter 184: The Third Wave", "id": 184, "volume": 2, "url": "http://boxnovel.org/mmorpg-rebirth-of-the-legendary-guardian-chapter-184-the-third-wave", "volume_title": "Volume 2", "body": "<h1>Chapter 184: The Third Wave</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 184: The Third Wave</p><br/><p>Translator: Editor:</p><br/><p>Snow Seeker was not as easily satisfied as Crimson Fire. After receiving 3 Gray-Silver equipment from Zhang Yang, her palm remained open to Zhang Yang. “What about the skill books?”</p><br/><p>For someone of her caliber, of course she would know that skill books were much more valuable than equipment!</p><br/><p>Zhang Yang played dumb, trying his best as possible to look oblivious. “What skill book? I didn’t see any!”</p><br/><p>Snow Seeker had an expression that could be called a smile, yet she could also not be smiling. “I see…I should let you hang out with Perfume Water more often, then!”</p><br/><p>Zhang Yang immediately raised his hands in surrender.</p><br/><p>What a b*tch!</p><br/><p>He took one book out and gave it to her. Without saying another word, Zhang Yang turned around and ran back to his position. He had taken 3 skill books in total. He was very much afraid that this woman could be greedier than he is.</p><br/><p>Back at his position, Zhang Yang took out a skill book and a Gray-Silver robe, giving it to Han Ying Xue.</p><br/><p>“Snowy Devil! Give me 100 thousand gold pieces as tribute!”</p><br/><p>Han Ying Xue shamelessly took the equipment and skill book. She quickly changed into the equipment and learned the skill.</p><br/><p>She turned to Zhang Yang and winked seductively. “Money? I don’t have any but I could let you use my body in turn!”</p><br/><p>Before he had the chance to retort, he felt a sudden chill running down his spine. He turned around frantically and saw Sun Xin Yu staring at him with a pair of eyes that spoke of death. All his muscle tensed up as he had completely forgot about her bring his girlfriend!</p><br/><p>The two of them had barely talked after they had left the police station. Dating aside, they had not even met once after that!</p><br/><p>It was also the same in the virtual world, nothing has changed, which had lead Zhang Yang to almost forgot about being tied down with Sun Xin Yu!</p><br/><p>He would have never known that even a woman with a heart as cold as ice would get jealous! Even if Sun Xin Yu was not in love with Zhang Yang, Han Ying Xue’s words had raised her insecurities! Like a child watching another child take hold a toy that she had put aside, she had watched closely. Even if she was not particularly fond of that toy, she would be angry since that toy belonged to her! How could she just let anyone else take it away from her!?</p><br/><p>Zhang Yang took out another Gray-Silver equipment and gave it to Sun Xin Yu. “Ice cube. I have one for you as well!”</p><br/><p>Hmph! At least he could calm things down a little.</p><br/><p>Zhang Yang pondered a little. These two beauties were at about the same level as Lin Yu. In fact, they could at least be three times prettier than her. However, they say that the grass is always greener on the other side, but one will always believe that the homeland was always the best. It was the same in his case, no matter how beautiful the two girls were, he would always have Lin Yu in his heart.</p><br/><p>At least for now, he had one more good item in his hands. Zhang Yang took out a skill book and learn it.</p><br/><p>[Rearm]: Immediately ends all skill with cool down by 30 minutes.</p><br/><p>Cool down: 30 minutes.</p><br/><p>This skill can be learn by all classes.</p><br/><p>If one had no strong skills to dispense, would be completely pointless to learn. On the other hand, if one possessed several strong skills, would serve as a godly skill!</p><br/><p>Zhang Yang was so happy that his grin stretched all the way to his ears.</p><br/><p>“Noob tank! What skill did you just learn?” Wei Yan Er noticed his suspicious action and asked.</p><br/><p>Zhang Yang laughed and posted skill description for her to see.</p><br/><p>“Do…Does this mean that you can use twice in a row?” said Wei Yan Er surprised.</p><br/><p>Zhang Yang’s own little band of players were left speechless as well.</p><br/><p>“Ayy sis! What skill did you learn?” asked Wei Yan Er.</p><br/><p>Han Ying Xue posted her skill as well.</p><br/><p>[Healing Rain]: Heals a maximum of 10 players within 10 meters. Every healing target will receive be healed by 200% of the caster’s magic power.</p><br/><p>Casting time: 1.5 seconds.</p><br/><p>Cool down time: 30 seconds.</p><br/><p>“Strong!” cried Daffodil Daydream.</p><br/><p>‘Ding! The third wave of monsters have begun to come out of Tukulo Fortress!’</p><br/><p>As they talked, the fortress opened its door for the third time and countless of monster started to rush out!</p><br/><p>This time, the monster were riders on horses with burning hooves. They were wearing full black armor with long, two handed spears. The monsters were in an organized formation. The riders rode as one, in an orderly manner. Stomping could be heard as loud as thunder, blasting through the battle field like thousands of drums striking simultaneously.</p><br/><p>Similarly to the two previous waves, the riders were separated into two categories; normal and elite. The only difference between the two was that the elites were larger in size - both horse and rider. Anyone could easily tell the difference just by looking at the field.</p><br/><p>[Metal-Armor Riders] (Normal, Demon)</p><br/><p>Level: 53</p><br/><p>HP: 5,300</p><br/><p>Defense: 50</p><br/><p>[Metal-Armor Rider Captain] (Elite, Demon)</p><br/><p>Level: 53</p><br/><p>HP: 100,000</p><br/><p>Defense: 300</p><br/><p>Thud! Thud! Thud! Like a sea of black ants, the darkness spread across the green field like plague.</p><br/><p>BAM! BAM! BAM!</p><br/><p>Each rider possessed a such strength that when they swing their spears, almost all tanks that were position on the front of the defense line were pushed back! The defense line was broken instantly! This knockback effect is directly affected by the player’s own Strength value. Players like Zhang Yang and Endless Starlight who were equipped well possessed high Strength, and so the knockback distance was negligible, while the other tanks were immediately sent flying to the sky.</p><br/><p>The defense line was broken instantly, sending panic to everyone around the fractured formation.</p><br/><p>Zhang Yang roared. “All tanks, regroup and reform the defense line! Other classes, retreat! I’ll say it again! Other classes, retreat!”</p><br/><p>When humans are in a disarray, he or she would unconsciously look for something as a guide, and when straightforward instructions such as these were given out, they would comply before they even process the meaning of those words! Amidst the rumbling chaos, Zhang Yang had roared like a beacon of light. Most of the players who heard his call quickly calmed down and formed a secondary defense line behind what remained of the first!</p><br/><p>This time, the NPC army had been triggered by the close proximity of the monsters and had started their own skirmish with the incoming riders.</p><br/><p>Zhang Yang tried his best to catch the attention of as many monsters as he could to reduce the burden on the other tanks.</p><br/><p>BAM! SWOOSH!</p><br/><p>Zhang Yang used and , with another after that. His rampage was akin to a heavy-duty machine knocking down small trees in a forest. Due to that, his contribution points shot up like a rocket, peaking at the top with points that doubled the second rank holder, Han Ying Xue!</p><br/><p>Han Ying Xue was ranked at second place in the contribution list because of her super-healing capabilities. With a 75% MP cost reduction, the amount of healing she could dispense in the war was at least 50% to 100% of other healers in the troops since she could last much longer! A Priest is specialized in mass healing! With skills like , , , and many other multi-target healing skill, a Priest is truly a class that could easily prevent death from claiming his victims.</p><br/><p>“-1632!”</p><br/><p>Zhang Yang suddenly received a significantly higher amount of damage. He looked down at his chest and found the shaft of long spear that had impaled him, along with two other players behind him! They had been skewered together like a human kebab!</p><br/><p>“-2931!”</p><br/><p>“-2948!”</p><br/><p>The two other received damage as well.</p><br/><p>CLANG!</p><br/><p>A loud metallic sound was heard as the rider pulled the spear back out. The Metal-Armor Rider Captain was completed covered in the metal armor, only a slit exposing nothing but darkness within. Zhang Yang could not even make out the eyes! It was nothing but empty void!</p><br/><p>Damn! It even had a strong piercing skill!</p><br/><p>In ‘God’s Miracle’, a majority of skill and attack would not pass through objects! Just like the flame thrower skill of the third boss in Bangar Crypt, as long as someone was in its way, the person behind will not take any damage! This was why Zhang yang could use the bugged system to kill the boss in the first place!</p><br/><p>However, there were a few skills that could penetrate object or players. Take this Rider Captain for example, his spear attack would easily penetrate many more players if they were all lined up nicely for him!</p><br/><p>“QING DUO LA ER LO!” the elite monster shriek random gibberish and thrust its spear again.</p><br/><p>!</p><br/><p>Zhang Yang met the incoming spear with his shield.</p><br/><p>Violent sparks of light flew about Zhang Yang as he was sent back a step. The elite Rider Captain was knocked on his back on his horse, almost falling off the saddle. In terms of Strength, Zhang Yang was equal to the monster. It had only managed to push Zhang Yang back one step after gaining sizable momentum from the horse’s charge!</p><br/><p>The area around Lone Desert Smoke had quickly settled down. After fending the sudden Rider Captain’s attack, the chaotic period was over quickly and the players around quickly retaliated swiftly.</p><br/><p>On the other side of the battle field, things were not going as smoothly as Zhang Yang. Lacking strong players, the other player’s defense line was quickly destroyed, sending players there in complete chaos. When the formation was broken, it became harder for them to reform and regroup. They had to retreat back and depend on the NPC army to push back the invading force. However, since the NPC army could not heal themselves, most of the NPC did not last long and perished.</p><br/><p>Only super guilds like Sky High could withstand the immense pressure and reform the defense line after much struggle.</p><br/><p>The cries of war filled the air. Heads flew, swords clashed, the entire battle field was completely dyed in blood red. The game had utilized it’s hyper realistic physics engine to depict this historical and climatic war! Everything about this war was too real to be passed off, even though they knew that this was just a virtual reality game, players still felt the terror and fear from it!</p><br/><p>Like it was in ancient wars, the brave would endure and gain more fervor as the weak could only cower behind dead bodies, trembling in fear. This was the main selling point of ‘God’s Miracle’, its hyper realism! Only the truly brave would stand out as the weak and fearful show their true colors.</p><br/><p>The third wave of terror had lasted for another 50 minutes.</p><br/><p>‘Ding! The third wave boss Narxus has appear!’</p><br/><p>“NEIGH!” a monstrous sound that could only come from an equally monstrous horse could be heard as a huge rider rode into the field.</p><br/><p>With flaming hooves, the beast stood as tall as 10 meters, and was approximately 13 to 14 meters long. As the horse took each step, the ground burst up in blackened ashes, with flames crackling at where the horse had laid its hooves. The rider on the horse back was as large as Zhang Yang had ever seen. The rider was completely covered in the similar, black metal armor while wielding a matching spear that measured at least 10 meters long.</p><br/><p>[Demon Knight, Narxus] (Gray-Silver, Demon)</p><br/><p>Level: 53</p><br/><p>HP: 13,000,000</p><br/><p>Defense: 500</p><br/><p>Unlike the two other boss that Zhang Yang had fought, this boss rode like the wind towards the players, leaving behind a trail of burnt ground in its wake.</p><br/><p>“WOAH! LOOK! It’s the Hell’s Stead! Damn! It’s so cool!” cried Wei Yan Er when she saw the beast. “AIYA! Don’t turn! Don’t turn! Come here! Let me kill your ass!”</p><br/><p>But Narxus turned away and headed towards the other player defense line. It’s positioned at least 4 to 5 km away from Zhang Yang!</p><br/><p>“Ack…my horsie! My horsie!” Wei Yan Er sadly and looked at Zhang Yang with puppy eyes begging, “Noob tank…Let’s go over there and kill that boss!”</p><br/><p>Zhang Yang shook his head. “We had already discussed about this yesterday! Whichever guild that the boss heads to, gets to have all rights to it! Unless they personally invite us to join the fight, we won’t raise a hand! With limited forces left, we cannot spare any men to start a civil war! Do you want to be just like that hypocrite of a loser!? If we lose this war, we will have to start over again 2 days later! By then, other city would have already won the war!”</p><br/><p>“Tch…stingy noob!” said Wei Yan Er unwillingly. She was rather interested in that horse. In fact, she had always been envious of Zhang Yang’s Skeletal War Horse for quite some time now. When she saw the glorious stead carrying the boss on its back, how could she not want to own it as well? Wei Yan Er pouted her lips angrily like a 3 year old child being denied candy.</p><br/>\n</div>"}