{"title": "Chapter 197: Fire Resistance Potion Recipe", "id": 197, "volume": 2, "url": "http://boxnovel.org/mmorpg-rebirth-of-the-legendary-guardian-chapter-197-fire-resistance-potion-recipe", "volume_title": "Volume 2", "body": "<h1>Chapter 197: Fire Resistance Potion Recipe</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 197: Fire Resistance Potion Recipe</p><br/><p>Translator: Editor:</p><br/><p>Zhang Yang set off like a rocket towards Han Ying Xue.</p><br/><p>Since Han Ying Xue was just following the boss and had nothing else to do, she was rather bored and was chirping in Zhang Yang’s ear during the whole time. While he was making his way towards her, Han Ying Xue had been asking him all sorts of personal question such as his first love … the popping of his cherry …</p><br/><p>Frozen Sky Wasteland was truly large indeed. The boss was located away by almost as far as half of the map’s size itself. He had to spend at least half an hour riding on his mount just to arrive to the point where he could finally see the blinking dot of Han Ying Xue in his mini-map. The blinking dot of an ally meant that the distance between them was within 100 meters.</p><br/><p>FUU RA RA…</p><br/><p>The Skeletal War Horse roared as it kicked off a heap of snow into the air when Zhang Yang pulled the reins. Zhang Yang pulled over when he reached by Han Ying Xue’s side. The woman was sneezing uncontrollably when he had arrived.</p><br/><p>“Hey dummy...I have been waiting for you all day!” Han Ying Xue complained.</p><br/><p>Zhang Yang sighed heavily and answered. “That’s a big no for taking any more Gray-Silver equipment from my shop!”</p><br/><p>Knowing her for 3 months, he had already seen past all her little tricks.</p><br/><p>Han Ying Xue rolled her eyes and said, “Hey! I learnt Rune Craft was for you guys!”</p><br/><p>“Oh please…You have to know that equipment higher than level 40 Gray-Silver tier are extremely valuable! Not many others would be willing to sell them off! The ones in my shop was farmed with everyone’s effort! How could I just simply take them out for you!” Zhang Yang rolled his eyes as well.</p><br/><p>You think you’re the only who can roll their eyes? Please, I can use the same trick as well!</p><br/><p>Han Ying Xue realized that rolling her eyes was not effective enough. She then resorted to raising her eye brows suggestively, “But, +2 Rune Stones require Level 2 Gray-Silver Essences! Don’t you want to upgrade your weapon?”</p><br/><p>“What the f*ck woman! I haven’t even received a +1 Rune Stone from you! What +2 Rune Stone are you talking about!?”</p><br/><p>Zhang Yang turned around and spotted the flying boss in the air. That flying beast was a large chimera, hovering at least 20 to 30 meters above the ground, soaring passively and slowly.</p><br/><p>[King of the Frost Chimera, Basilisk] (Green-Copper, Beast)</p><br/><p>Level: 55</p><br/><p>HP: 55,000</p><br/><p>Defense: 300</p><br/><p>That was it! That was the one!</p><br/><p>Zhang Yang sent away his horse and ran towards to the boss. He bent over and collect a bunch of snow and formed a snow ball in his hand. He aimed and tossed the snow ball at the boss.</p><br/><p>Pak!</p><br/><p>The throw did no damage but it was enough to trigger the boss’ aggro and to engage in a battle.</p><br/><p>The beast growled and flapped its gigantic wings, gliding down from the high heavens and down towards Zhang Yang, firing out a cold stream of air from its mouth.</p><br/><p>‘Ding! Basilisk has used !’</p><br/><p>‘-1,023!’</p><br/><p>Zhang Yang took the damage and gained 42 Rage points.</p><br/><p>‘-1,482!’ Normal attack.</p><br/><p>!</p><br/><p>‘-692!’ .</p><br/><p>‘-3,389!’ .</p><br/><p>‘-3,512!’ .</p><br/><p>Zhang Yang had instantly expended all his Rage and had dealt close to 9,000 damage to the boss. In terms of percentage, Zhang Yang had knocked off 20% of the boss’ HP! Incredibly scary!</p><br/><p>Basilisk’s cried out as it swings its claw to attack Zhang Yang.</p><br/><p>! +30 Rage</p><br/><p>‘-359!’ reflect damage.</p><br/><p>! +30 Rage/</p><br/><p>!</p><br/><p>‘-752!’ /</p><br/><p>‘-868!’ .</p><br/><p>‘-1,648!’ .</p><br/><p>Zhang Yang stacked another 3 layers of , making it to 5 stacks in total. The boss was now completely naked to Zhang Yang attacks.</p><br/><p>“Woah, looks like soloing a boss is no problem for you now, huh…” said Han Ying Xue admirably. Zhang Yang’s current attack had far exceeded that of the boss. His HP was now at 12,000. He did not even need to use to kill the boss!</p><br/><p>“I’m wearing Yellow-Gold and Gray-Silver equipment, woman. How can I not solo kill a Green-Copper tier boss? If I can’t even do that, how do I show my face in public?” said Zhang Yang as he smirked.</p><br/><p>“What a thick face!”</p><br/><p>Zhang Yang laughed. He raised his axe up high and continued to attack the boss with a DPS of nearly 2000! To kill a boss with 55,000 HP would only take around half a minute! By the time he had killed off the boss, he did not even break a sweat and had only lost 5,000 HP.</p><br/><p>“Dummy, what exactly is up with this boss to make you go so far out of your way?” Women were as curious as cats. As more so for Han Ying Xue, as she posed the question while raising her eye brows seductively.</p><br/><p>Zhang Yang bent down and poked around the boss’ drops and smiled contentedly when he picked up a sheet of recipe. He then quickly patted it on his chest and learned the crafting recipe.</p><br/><p>Han Ying Xue cried out immediately when she saw him doing that. “What the…You sly meanie, you actually used All-Pick distribution mode!” She actually wanted to pick up the item and teased Zhang Yang for a bit before letting him taking the item. She had never though that Zhang Yang was one step ahead of her and had set the distribution mode beforehand.</p><br/><p>Zhang Yang laughed manically. “Hmph! Without proper skills, how can I fight off demons and monsters like you!”</p><br/><p>“BLEH!” Han Ying Xue blew raspberries at him. She was now even more curious about the item that Zhang Yang had picked up. “Dummy, at least let me see the item description!”</p><br/><p>Zhang Yang laughed under his breath and posted the description of a type of potion.</p><br/><p>[Level 3 Fire Resistance Potion] (Consumable)</p><br/><p>Use: Adds 600 fire resistant. Last for 2 minutes.</p><br/><p>Cool down time: 2 minutes.</p><br/><p>Level Requirement: 50</p><br/><p>“Is this the junk that you spent 5 days searching for?” snorted Han Ying Xue.</p><br/><p>“This junk could only reduces 600 fire damage. I can easily heal that amount with one tick of .”</p><br/><p>“Your hair must be too long now, it’s dulling your senses!” said Zhang Yang while giving a crooked smile.</p><br/><p>“What did you say? Care to repeat that again?!” said Han Ying Xue with the temper of a lioness behind her voice.</p><br/><p>“Ah…ah…” Zhang Yang quickly twist his brain, trying to think of a way to switch the topic. “There are many bosses that have damaging aura effects. Just like the one that gave us a lot of trouble in the Expedition war, the ? If we had used the potion to nullify the aura effect, we won’t not have to worry about it anymore!”</p><br/><p>Han Ying Xue only nodded and hummed “Okay” under her breath. For now, she bought what Zhang Yang said.</p><br/><p>The last boss in the Poison Fireland, Roshan – Copper Hammer was the kill requirement for the level 50 class quest. The boss had a strong Aoe, - like ability. It was not like the [Beginner Anti-Shadow Potion] that was needed to resist the Marzerway’s shadow attack, where it was completely impossible to complete the raid without it. This level 50 boss could still be killed without the potion, but having it would make things much easier! The item was bound to be extremely popular in the future! However, Zhang Yang remained quiet about this fact. If he had said it, Han Ying Xue would definitely be asking for a share of the profit! It’s best to remain quiet for now.</p><br/><p>As for the other drops of Basilisk, Zhang Yang did not even care to have a glimpse at them. He just looted them all and tossed them into the corner of his inventory (if the inventory had a corner to begin with). It was all just random Green-Copper and Black-Steel tier equipment. Nothing important enough for him to pay attention to.</p><br/><p>Now that he had what he wanted, Zhang Yang mission was completed. He tore a [Teleportation Scroll] and went back to White Jade Castle. To craft the [Level 3 Fire Resistance Potion], he would require [White-Spotted Flower]s and [Fire Crystal Shard]s. [White-Spotted Flower]s are harvest ingredients obtainable by Herbalism profession. They can be harvested in level 40+ hunting grounds and are extreme abundant in nature. The price in the auction house was quite low as well. [Fire Crystal Shard]s were the miscellaneous -- items that would be in the ‘ETC’ tab of inventories -- dropped by any Fire Elemental monsters, levels 20 and higher. They usually ended up being sold to NPC directly.</p><br/><p>Miscellaneous items, in ‘God’ Miracle’ usually seemed worthless, but when a recipe pops up and requires them as ingredients, the item would undergo a sudden change, gaining popularity and having its prices hike up by over hundred-fold within a day!</p><br/><p>Since the recipe of [Level 3 Fire Resistance Potion] was extremely rare to begin with, Zhang Yang had never go to figure out the ingredients needed to craft the item! Only after he had obtained the recipe did he gain the knowledge of the items.</p><br/><p>Back in his shop, he had adjusted Natalia’s setting to begin purchasing these said ingredients.</p><br/><p>[White-Spotted Flower]s were sold in the auction house at 10 gold coins a stack. [Fire Crystal Shard]s, they were being sold directly to the NPCs. No one would want to waste their money by selling it at the auction house due to the service fees incurred, that would deduct 20% of the price they put up. Selling the [Fire Crystal Shard] to the NPC would earn them 2 gold coins a stack, without any extra charges. Zhang Yang set the buying price for the [White-Spotted Flower] at 8.5 gold coins a stack and [Fire Crystal Shard] at 2.5 gold coins a stack.</p><br/><p>This time, all 8 major cities had their teleportation circles opened for all. Any player could freely travel to all cities for their liking. With that, Zhang Yang did not have to search for “distributors” to help him sell his “junks” anymore. As long as he could spread his Little Merchandize Shop name to all cities, customer will flock to his shop with no time at all!</p><br/><p>By the afternoon, Natalia had bought a number of ingredients. Seeing that, Zhang Yang could not help but sigh heavily. All his available storage was used to store the [Solid Iron Bar], he had no more space to make way for the potion!</p><br/><p>With no more space left in his own inventory, Zhang Yang had to use Fatty Han’s personal inventory as storage for his potions. Zhang Yang was now a Professional-tier Alchemist, he could make 4 bottles of potion in one instance. In just half an hour, he had used up all the ingredient Natalia had stockpiled to craft the [Level 3 Fire Resistance Potion]. There were a total of 34 stacks, all of them which he mailed to Fatty Han.</p><br/><p>In two days, Zhang Yang had not only filled up Fatty Han’s own personal storage, he had also filled up Wei Yan Er’s, Endless Starlight’s and other friends’ as well. He had even persuaded them to open up a few more storage space in their personal warehouses, all to help Zhang Yang to store the potion. Since both Wei Yan Er and Han Ying Xue was misers to begin with, to ask them to spend their own “hard earned” gold to open up a few more slots of storage crossed a line. Left with no choice, Zhang Yang had to pay them money to do his favor. Luckily, the expansion cost of 4 of their personal storage tabs were not expensive at all. At most, it costed him 1,000 gold coins.</p><br/><p>October the 9th, 6pm in the evening.</p><br/><p>“BANG BANG BANG!” It was like someone was trying to break down the door.</p><br/><p>“Who is it?!” cried Zhang Yang as he peeked through the peephole in the door. He saw Fatty Han standing outside his door while stroking his big tummy. He quickly unlocked the door and greeted his friend. “Damn! I just had my dinner! I have nothing left for you to leech!”</p><br/><p>After the Fatso had bought himself a sport car, he had been rather busy for the past few days. He had been coming over to Zhang Yang’s to leech drinks and food off him every night.</p><br/><p>“Little Yang! You must have forgotten!” Today, Fatty Han was dressed up all fancily.He was wearing a Burberry top and the same brand of long pants. It was a shame though; he was ALMOST a sharp dressed man -- if not for the sight of his bouncing belly which ruined the whole image. Fatty Han shook his head and went up to Zhang Yang ears, shouting, “It’s the student’s gathering today, yo!”</p><br/><p>“ARGH! Crap!” Zhang Yang had completely forgotten about the matter. He had screamed in response to Fatty Han’s abrupt reminder.</p><br/><p>“Don’t “argh” me! You promised to joined me! Let’s go! Let’s go! We have one hour! Damn! If we get stuck in traffic now, who knows when we might get there! We might not even be there by the Year of the Monkey!1” Fatty Han’s standard operating procedures: if he obtained wealth this year; complete with a car and some money in his bank, he wanted to gloat in the face of those people who had looked down upon him.</p><br/><p>If Zhang Yang had not died, he would have the same thoughts. However, now that he had experience death and rebirth, this kind of childish act was completely out of his thoughts.</p><br/><p>Being dragged and yelled at by by Fatty Han, Zhang Yang quickly changed into a new shirt. That outfit was for his job interview. Back then, it had cost him 700 dollars!</p><br/><p>“Little Yang! You’re a millionaire now! Why would you still wear something that cheap!” said Fatty Han when he saw Zhang Yang’s outfit. “Oh…I understand what you trying to do Little Yang! You’re trying to be a wolf under a sheep skin! Though I must say that it is a little lame for you to do so!”</p><br/><p>Zhang Yang frowned heavily. Wrinkles as long as the highway formed on his forehead!</p><br/><p>Am I not the one being dragged along by you! Why would I follow your style?</p><br/><p>Fatty Han’s sport car was indeed cool and extravagant. When he parked his car in front of the apartment, many youngsters were ogling and pointing at the car, all with the admiration and impressed look on their faces.</p><br/><p>Fatty Han was rather happy about being admired at. As he walked to his car, he winked at some female on the side seductively. First, he lead Zhang Yang to the car and forced him in. He then moved to the driver’s seat and got in. Since he was rather large, he did not exactly take his seat immediately. In fact, he had to squeeze inside, finally managing to get into the driver’s seat with much effort.</p><br/><p>THUMP!</p><br/><p>With a loud thump, his butt landed on the seat, shaking the entire car and stressing the suspension to its maximum potential. It was no wonder how Fatty Han could be as heavy as a tonne.</p><br/><p>Zhang Yang could not help but laugh. “Hey fatty, did you buy a car insurance for your baby?”</p><br/><p>“Of course I did!”</p><br/><p>“Thank god! If you crushed this car, which I think is completely possible. At least you won’t be losing everything if you loss the car!”</p><br/><p>“F*ck you. I’ve been “crushing” Yun Yun every night and she’s hasn’t broken anything! This car is made of metal2, goddamit! If I could crush this car, I would go back to the bastard’s shop and send a wrecking ball through it for selling me cheap goods!”</p><br/><p>“Oh right! Why didn’t you bring Yun Yun along?”</p><br/><p>“Little Yang, are you being serious right now? If I brought Yun Yun along with me, how am I going to pick up other girls!” sulked Fatty Han as he started the car and drove out of the area.</p><br/><p>Zhang Yang raised his eyebrow and asked. “So, you’re not planning to settle down with her?”</p><br/><p>Fatty Han scratched his head. “Little Yang, what kind of era do you think you’re living in? I’m out for chicks, it’s not like I’m breakin’ up with Yun Yun! Besides, I’m still single and ready to mingle!”</p><br/><p>Zhang Yang broke a cold sweat.</p><br/><p>Damn son! You have a girlfriend and you’re out there playing with other women! Am I the one who’s outdated? Or are you the one with issues?!</p><br/><p>Zhang Yang could not help but shake his head in denial. “Oh well. Anyhow, it’s your personal life. I’m not going to butt in this. Do what you like!”</p><br/><p>As they drove all the way to Sheraton Hotel, they were, as Fatty Han has predicted earlier, got stuck in traffic.</p><br/><p>The traffic jam was rather bad. By the time they had arrived to the door steps, the time was already 7:11pm.</p><br/><p>Just as the two friends got down the car, they saw a young man crying out from two parking spots away from them.</p><br/><p>“Zhang Yang! Han Guang!” the man had just gotten down his normal, everyday car.</p><br/><p>Zhang Yang stared at the man for a good second and was surprised when he recognized the man. “Liu Qi Ming!”</p><br/><p>“Haha! That’s right! That’s me!”</p><br/><p>Thomp!</p><br/><p>The man closes the door of his car and walked jubilantly towards them. Laughing, he said, “I never thought that you would be doing so well! Look at you! Driving a Maserati! How much does this one cost? I assume it cost at least 1,000,000 dollars!”</p><br/><p>Zhang Yang smiled as he shook his head. “Oh no! The car is Fatty’s. I was just hitching a ride!”</p><br/><p>Liu Qi Ming nodded his head. The wonder in his face faded quickly but rekindle when he saw Fatty Han.</p><br/><p>“Han Guang! I see that you’ve struck gold now, huh!”</p><br/><p>Fatty Han and Zhang Yang were soul brothers. To look down on Zhang Yang was to look down to him! Seeing that Liu Qi Ming had expressed a cold shoulder to Zhang Yang; Fatty Han reciprocate the same expression and only exchange a few word with Liu Qi Ming and called out to Zhang Yang, “Let’s go, Little Yang!”</p><br/><p>Even though Liu Qi Ming had received the cold shoulder from Fatty Han, the slight anger was immediately gone when he saw the luxury car that Fatty Han owned.</p><br/><p>Author’s Note: this story arc is about Zhang Yang interaction in reality, his thoughts and relationship. That is why it’s long…</p><br/><p>1Lunar Calendar- Year of the Monkey is one of the years in the Lunar Calendar. It was not specified on what year they were in at that time.</p><br/><p>2Editor’s note - Fatty Han had used a word that literally meant ‘iron’. This word is used to refer to ‘metals’ in general. Also, since this is Fatty Han we’re talking about, I seriously doubt that he knows what Maseratis are made of. Let’s hope that he doesn’t think it’s really iron.</p><br/>\n</div>"}