{"title": "Chapter 194: The End of the Expedition!", "id": 194, "volume": 2, "url": "http://boxnovel.org/mmorpg-rebirth-of-the-legendary-guardian-chapter-194-the-end-of-the-expedition", "volume_title": "Volume 2", "body": "<h1>Chapter 194: The End of the Expedition!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 194: The End of the Expedition!</p><br/><p>Translator: Editor:</p><br/><p>Bang!</p><br/><p>With a swing of his war hammer, Frodoc blew open the huge iron door of the mansion. He walked in, followed closely by hundreds of elite guards, with Zhang Yang and the others in the midst of them.</p><br/><p>Along the way, regular elite monsters were spawning, but they were instantly blown away by the powerful war hammer of Frodoc. His hammer smashing an enemy apart at a time, he held nothing back, the monsters dying in a single hit!</p><br/><p>“This NPC is so ferocious!” Crimson Fire was left breathless.</p><br/><p>Zhang Yang laughed, “This is the story mode, he must be ferocious to be a general! NPCs will not be too powerful when they engage with players. If that;s not the case, you can try to engage with the boss!”</p><br/><p>Crimson Fire quickly shook his head frantically, it was just a joke! If he died in the hands of an NPC when victory was almost at hand, that would make him look very stupid, truly!</p><br/><p>Han Ying Xue then said, “If there was such an NPC helping us with the 10th wave monsters, it would have been great!”</p><br/><p>Zhang Yang instantly rolled his eyes back, thinking to himself that, if that would be the case, what was the point or even having 10th wave in the first place? However, Witchy Snow’s moral attainments had reached another height. Once provoked, she would use her seduction tactics to tease him all day long... That was least of his worries, he more afraid of Sun Xin Yu losing control and gunning the two of them down!</p><br/><p>Under Frodoc’s lead, the players were proceeding like they were having a stroll in a bamboo forest, monsters to the left and right were instantly being killed. In just a short period of time, they had reached the front of a huge chamber.</p><br/><p>The chamber was rectangular in shape, with a length of about 100 meters, width of 80 meters, and 30 meters high. The whole chamber was supported by twelve large pillars, the atmosphere was ominous yet grand.</p><br/><p>At the bottom of the chamber, there was a huge throne. Lounging upon it was a winged, red devil with and two horns on its head. The devil was more than ten meters tall!</p><br/><p>[Demon General Shanks] (Yellow-Gold, Demon)</p><br/><p>Level: 65</p><br/><p>Hp: 40,000,000</p><br/><p>Defense: 1200</p><br/><p>“Filthy demon, the world does not belong to you!” Frodoc raised up the hammer in his hand and walked into the chamber with confident, big steps.</p><br/><p>“Hahaha, a bunch of fools here to die!” Shanks stood up boldly, unfurling his wings with a shake of his back, instantly stirring up a howling gale. As he stretched out his right hand, ‘bam!’, the black flame rose from his palm. \"The world, is our hunting ground! In the near future, our family of nine lords will all be revived, be it human beings, elves, orcs, dwarves, dragons, or elemental bodies, all shall be completely erased from this world by our own hands!”</p><br/><p>“Arrogant demon! Allow me, Frodoc, to bury your head into mud!” Frodoc bellowed sonorously. Dom dom dom, his heavy footsteps boomed through the chamber and he charged towards the boss.</p><br/><p>“Guards, kill all these intruders.” Shanks drawled nonchalantly.</p><br/><p>Jik Jik Jik!</p><br/><p>Suddenly, a dozen demonic monsters, wielding battle axes, leaped from behind the pillars, all of them being Level 60 elites with health points up to 300,000!</p><br/><p>“You useless maggots!” Frodoc swung up his war hammer once again, gong gong gong, with just one hit from his hammer, he took out all of the monsters in an instant! The pace of his charge did not slow down at all, he was like a gale rushing towards Shanks.</p><br/><p>“Finally, a worthy warrior among the insignificant humans!” Shanks murmured, with a sudden move of his right hand, a shiny, giant axe flew over to him from the weapon rack at the side of the room, falling firmly into his palm. Shanks belted out a war cry, with his hands holding the axe in a firm grip, he gave an overhanded, downward swing. That was the start of the battle.</p><br/><p>Ding! Ding! Ding! Ding!</p><br/><p>The two Yellow-Gold bosses were engaged in battle, every clash of the hammer and the axe discharging showers of sparks all over the place. The rate of health points lost on both sides amounted up to ten thousands at a time!</p><br/><p>“Little sis, the boss is about to die, who knows, there might be a two-handed axe among the loots!” Zhang Yang turn to Wei Yan Er and made a guess.</p><br/><p>Wei Yan Er immediately widened her eyes, dashing forward, she took her axe from her back and grabbed it firmly, snapping urgently, “Then what are we waiting for? Let’s role, take out the boss!”</p><br/><p>Zhang Yang laughed, “Forward!”</p><br/><p>Shoof! shoof!</p><br/><p>Both of them used and smashed right onto the boss, and unleashed their attacks onto Shanks.</p><br/><p>Sky Shaman and the others were not willing to be left behind, so naturally, they went forward as well.</p><br/><p>At this point, the game company clearly no longer had any intentions of making things difficult for the players, Shanks’s aggro was firmly held by Frodoc, no one else would need to tank. Furthermore, the only all-out attack this boss had was </p><br/><p>, causing the same amount of damage on the players nearest to the target. So, as long as players stood behind the boss while unleashing their attacks, they would not be damaged by the skill.</p><br/><p>However, the level of the boss and his defense were really high, the damage output of everyone was largely diminished, even Zhang Yang could only unleash 30% of his full attack!</p><br/><p>It was all they can do for now, the vast difference in levels cannot be covered up with powerful equipment and weapons.</p><br/><p>In just 2 minutes, Shanks had been rid of 12,000,000 health points. But correspondingly, the damage output of the boss was even more ferocious, Frodoc had taken up to 20,000,000 damage!</p><br/><p>“Silly Yu, the NPC won’t last for long!” Han Ying Xue was worried. The attacks of the boss was just too overwhelming, with a damage output up to 170,000 in each attack, if any of it were to land on the players, it would be like smashing the golden cudgel used by the monkey king on the players. The moment the attack reaches the players, they are all as good as dead!</p><br/><p>Zhang Yang gave it thought, before saying, \"There’s nothing to worry about, even if the NPC dies, the boss will not deal such high damage on players, we only see such outrageous values in Story Mode!”</p><br/><p>While Frodoc took away another amount of 5,000,000 HP of the boss, he was left with only 1,000,000 HP. Just as he was about to be killed by the boss ---</p><br/><p>‘+30,000,000!’</p><br/><p>A horrifying amount of healing value appeared right on top of Frodoc’s head, instantly healing the NPC back to it’s original full state!</p><br/><p>!</p><br/><p>Holy cow! Everyone could not help themselves but mutter, this NPC was too shameless!</p><br/><p>Healing so much HP in a single time, giving no alternatives to the boss to survive!</p><br/><p>But Zhang Yang felt uneasy, would the boss in turn, use a to heal himself while engaging in this battle? It was very obvious that the boss is a Berserker warrior, it wouldn’t be unusual for the boss to be able to use ! With such thoughts held in his mind, Zhang Yang did not dare to disrupt his chain of , the moment the cool down time was over, he would quickly use it again on the boss.</p><br/><p>40%, 30%, 20%, 10% …</p><br/><p>The health points of the boss was dropping like an avalanche, he was not far from his own demise!</p><br/><p>6%, 3%, 1%!</p><br/><p>“NO ---” Shanks uttered a roar full of rage, “My master will return! When that happens, the whole world will be engulfed by fire, I shall be revived from the darkest flames of all! Humans, enjoy your last days while you are still able!”</p><br/><p>Boom!</p><br/><p>The huge body of the boss let out a stream of gold piling up on the ground, before he crashed down onto the ground, rattling the whole chamber with a large tremble!</p><br/><p>‘Ding! The Demon General Shanks has been killed!’</p><br/><p>‘Ding! The army of the White Jade City has completely conquered Tukula Fortress! Victory over the expedition!’</p><br/><p>‘Server Announcement: The players of the White Jade City has completed the siege on the fortress, acquiring the first victory in the expedition! To honor these heroes, all players of the White Jade City will acquire an additional effect of 100% experience point as their additional reward for the next 3 days, and acquire the ‘Hero’ Effect!’</p><br/><p>‘Server Announcement: The first phase of the expedition has been completed, all teleportation sites in the main cities are now opened, players are free to travel to all main cities via teleportation!’</p><br/><p>‘Server Announcement: The 20-limit cap for the dungeon Poison Fireland has been officially opened!’</p><br/><p>‘Server Announcement: Battle Mounting System has been officially opened!’</p><br/><p>The system messages came up one after another, while Zhang Yang and the others had begun their own chaotic battle, grabbing the loots that were dropped from the boss. They had used every single possible way, the Knights used , the Spellcasters used , the Priests used . In short, everyone wanted to drive others away and gain control of the situation, so that they could pick the most precious item, the [City Order]!</p><br/><p>Summoning servant Clear Lotus, activating the skill! 5-second invincibility, immune to all control and damage!</p><br/><p>!</p><br/><p>Zhang Yang aimed from the perfect angle and emitted out a conical shock wave, instantly stunning the 8 remaining players who were not members of the Lone Desert Smoke!</p><br/><p>Wei Yan Er could not stop giggling, while her arms worked quickly along with Han Ying Xue and the rest in grabbing the equipment that radiated gold light, stuffing them into their own backpacks. 4 seconds was enough for them to grab all 7 pieces of Yellow-Gold equipment clean up from the ground!</p><br/><p>When the others had regained their statuses from the stun, there were no more Yellow-Gold equipment left on the ground. Even the Gray-Silver equipment had not gone untouched, 6 of them remained --- there were originally a dozen of them on the ground before that.</p><br/><p>“Zhan Yu, f*ck your mother!” Humbly Gentleman was in absolute rage. It was not easy having to hold on for so long, but having all the best rewards taken away from him, someone greedy and selfish like him would definitely snap and go crazy!</p><br/><p>Zhang Yang laughed and said, “Hypocrite, how can I just stand there and do nothing when you initiated your attack? Fine, I guess it’s better that I send you back to the graveyard!”</p><br/><p>Shoof, shoof, shoof. Zhang Yang wielded his battle axe, launching his attack on Humbly Gentleman.</p><br/><p>With Zhang Yang in action, Wei Yan Er and the gang naturally followed their leader. Everyone was in a frenzy, and without much effort, they had sent Humbly Gentleman and Traveling Piglet back to White Jade City. With the little time left, Snow Seeker and the rest quickly relieved the ground of the remaining equipment and divided the loot among themselves.</p><br/><p>Of course, those equipment had been left on purpose for them by Zhang Yang. Although it is said that the number of loots you can grab depended on your capabilities, leaving nothing for others would only provoke their rage! Now that Crimson Rage, Sky Shaman and the others had acquired a few Gray-Silver equipment, they would hopefully, not react as poorly as Humbly Gentleman did.</p><br/><p>“Guildmaster Zhan Yu, you guys have earned a fortune this time!” Snow Seeker smiled gently while talking to him, as the saying goes, if it’s laid, it’s played. In the previous attempts in grabbing equipment, she had also used up all her juice, it was unfortunate that she could not compete with Zhang Yang. A took care of everyone else. If she goes around with a sad face, scolding and cursing, that would only make her look like Humbly Gentleman, who frankly did not deserve to play!</p><br/><p>Zhang Yang smiled meekly, “Nothing special, just so-so.”</p><br/><p>“Noob tank, this is for you!” Wei yan Er suddenly handed him a golden plate the size of a palm.</p><br/><p>[City Order: Tukula Fortress] (Consumable)</p><br/><p>Use: You have acquired the recognition of Your-Highness, to become the owner of the Tukula Fortress!</p><br/><p>Level required: 50</p><br/><p>Zhang Yang received the order over, but he did not use it immediately, he asked among the party members first, “None of you guys want this?”</p><br/><p>“Cheh, don’t be so hypocritical! You are the guildmaster, the symbol of our guild, if this is not given to you, who else should we give it to?” Han Ying Xue scoffed with her nose up.</p><br/><p>Daffodil Daydream nodded earnestly, expressing her agreement, “It should be given to Zhan Yu! It should be!”</p><br/><p>Meanwhile, Sun Xin Yu was sharpening her daggers, with a face that didn’t seem to care for anything at all.</p><br/><p>So, Zhang Yang accepted it bluntly, and used the city order on himself. A sudden burst of blinding gold light instantly covered him whole, and a large seal of the Royal of White Jade Kingdom appeared right above his head, gleaming as it floated in the air, displaying the title with cheerful, colorful ribbons.</p><br/><p>Snow Seeker and the others saw the royal seals, and immediately they understood --- Zhang Yang had used the [City Order]! Unfortunately there was only one [City Order], so they could only be envious of him, staring from aside.</p><br/><p>This moment of glamour lasted for half a minute, before the royal seal floating in the air finally dimmed down. The symbol then began to shrink and went hidden into the position of Zhang Yang’s chest, engraving itself onto his armor.</p><br/><p>‘Ding! You have become the master of the Tukula Fortress!’</p><br/><p>‘Ding! You have acquired the privilege of the city order:</p><br/><p>1, You can manage all players who enter the Tukula Fortress.’</p><br/><p>You can use teleportation to the main hall of the city in any places.”</p><br/><p>‘Ding! You have acquired the title: Hero of White Jade City, permanently gets a 50% discount in equipment repair, socket equipment and other costs!’</p><br/><p>‘Server Announcement: White Jade City has completed the siege on the fortress, the reward will be distributed according to the contribution of players on the battlefield!’</p><br/><p>\"Server Announcement: Player Zhan Yu ranked first in the contribution list, acquired Yellow-Gold [Furious Chest Plate], 1 skill point, lucky attribute +3!\"</p><br/><p>\"Server Announcement: Player Little Snow ranked second in the contribution list, acquired Yellow-Gold [Excellent Robe], 1 skill point, lucky attribute +2!\"</p><br/><p>\"Server Announcement: Player Snow Seeker ranked third in the contribution list, acquired Yellow-Gold [Spiritual Robe], 1 skill point, lucky attribute +1!\"</p><br/><p>\"Server Announcement: Player Drizzler ranked forth in the contribution list, acquired Yellow-Gold [Furious Chest Plate], lucky attribute +1!\"</p><br/><p>\"Server Announcement: Player Frost Night ranked fifth in the contribution list, acquired Yellow-Gold [Bloody Teeth Chest Plate]!\"</p><br/><p>\"Server Announcement: Player Daffodil Daydream ranked sixth in the contribution list, acquired Gray-Silver [Spiritual Robe]!\"</p><br/><p>...…</p><br/><p>The rewards for the top five achievers were all the second pieces of Yellow-Gold armor sets, respective to their professions! As for the remaining 5 top achievers on the contribution list, they were rewarded with a second piece of the Gray-Silver armor sets. There was a vast difference between the value between these two grades of the rewards, as Gray-Silver equipment can be acquired through the Death Mode of the Poison Fireland Dungeon, but Yellow-Gold equipment...can only be acquired by slaying Yellow-Gold Open World bosses.</p><br/><p>The problem is that the difficulty is too hard, unlike a dungeon, it was open for everyone!</p><br/><p>Zhang Yang was extremely pleased, other than getting a piece of Yellow-Gold equipment, he actually got another skill point and 3 luck attribute points! Currently, his lucky attribute had already reached 9 points, while rate of his lucky strikes had almost reached 1%. It might not seem to affect much when engaging a boss as it only increased the his output damage by a little, but it can instant-kill a player in PK, if the effect is suddenly triggered out of the blue!</p><br/><p>Although Zhang Yang and Wei Yan Er both acquired a [Furious Chest Plate], one aimed to increase defense while the other aimed to increase damage output., the system had already considered this on behalf of the players. However, the second piece of Yellow-Gold equipment required players to be level 60 to wear it, and players can wear equipment that are Gray-Silver or lower grade when they reach level 50. Currently, Zhang Yang could only wait for a little longer, staring at the Yellow-Gold equipment after acquiring a few pieces of them.</p><br/><p>Afterwards, they divided the Yellow-Gold equipment that they acquired from the boss, Shanks. Zhang Yang was extremely lucky, he actually got another piece of his armor set --- [Furious Helmet]. So now, he just needed to level up to level 60, and then he will be able to equip all 3 pieces of the armor set he now possessed, acquiring the first effect of the armor set!</p><br/><p>Shanks had dropped 7 pieces of Yellow-Gold equipment in total, and among the 7, 4 of them were armor set pieces, all being helmets for priest, assassin thieves, guardians and pyromancers. However, there was no helmet for Wei Yan Er, she was so upset with the fact and blamed the boss for being biased.</p><br/><p>It was fortunate that the axe weapon that always made her drool had finally appeared, although it required her to be level 60 to equip it, the little girl was already filling her face with only joy, her joy was beyond any description possible.</p><br/>\n</div>"}