{"title": "Chapter 205: Till He Suffers", "id": 205, "volume": 3, "url": "http://boxnovel.org/mmorpg-rebirth-of-the-legendary-guardian-chapter-205-till-he-suffers", "volume_title": "Volume 3", "body": "<h1>Chapter 205: Till He Suffers</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 205: Till He Suffers</p><br/><p>Translator: Editor:</p><br/><p>Gu Jun steeled his will, putting up a stoic stature and stated clearly. “Public Security Bureau is a place where justice is enacted! We will only accept facts and evidence and not favors!”</p><br/><p>After Gu Jun’s short speech, everyone felt conflicted!</p><br/><p>Gu Jan intended to protect Zhang Yang. That had been clearly established. But why?</p><br/><p>Who is Zhang Yang and what was driving Gu Jun to offend a Province Leader’s daughter to take over the case boldly!? He should have known that her father was the provincial leader, a position much higher and more powerful than Gu Jun by several levels!</p><br/><p>Yang Zhi Xian was shocked at his “answer”. She had never thought that Gu Ju would still be headstrong and resist to stop helping Zhang Yang. What’s done is done. Even though she was rather arrogant and headstrong herself, her sense towards political behavior was strong. She knew something was wrong but could not put a finger on it. Could it be, that Zhang Yang had a hidden background that no one else but Gu Jun knew about? Was that the reason why Gu Jun would not even fear a provincial leader?</p><br/><p>She waved her hands and gestured to Secretary Lee to come to her.</p><br/><p>Secretary Lee saw her call and ran over rather lavishly. “Miss Yang? What’s wrong?”</p><br/><p>Yang Zhi Xian pointed at Zhang Yang and whispered. “What relationship does that man have with your deputy chief?”</p><br/><p>Secretary Lee scratched his chin and shook his head, “I’m not sure about that miss. But wait, let me go ask around!”</p><br/><p>He left the group and went into the station and started to gather information about Zhang Yang. She was but the daughter of the province leader, one of the people that everyone would want to have a good relationship with.</p><br/><p>No sooner, Secretary Lee came back with a rather shocked expression and sneaked towards Yang Zhi Xian and whispered back. “I’m afraid this is rather complicated Miss Yang. That man is not just any simple man. Not long ago, do you remember about an armed robbery case that happened around this area?”</p><br/><p>He then explicitly explained the event that had transpired to Yang Zhi Xian, down to the detail where Ma Wu Shi was belittled by Sun Xin Yu in front of everyone.</p><br/><p>Before Yang Zhi Xian could finish listening, she covered her mouth. No wonder this man dared to be such a ruffian! He had such a strong back supporting him! His relations were so strong and vast that he could reach the City Secretary himself! That’s just the tip of the iceberg!</p><br/><p>She was selfish and egoistic, that she realized herself. But she wanted to climb the ladder of ranks as well! In an instant, she knew what she had to do. She realized the immense value that Zhang Yang had with him. No wonder even the deputy chief Gu Ju would want to join hands with Zhang Yang!</p><br/><p>Yang Zhi Xian changed her attitude a 180 degrees. “Gu Jun, my father once said to me, as a government servant, he or she must serve the people as their highest priority! As for the black sheep in the office, I’ll say, wouldn’t it be for the best if we get rid of the root?”</p><br/><p>His head completely drained of blood, Qian Hong Wen went so pale that people might mistaken his face for a piece of poorly drawn sketch on a piece of paper.</p><br/><p>What the hell is this blood b*tch was thinking!? Is she trying to make him suffer till the end?! Black sheep? Root of the mess? If he was really going to wear that insult, securing his current position would be a problem, much less hoping for any promotions in the future!</p><br/><p>Gu Jun scoffed and nodded his head. He now understands that the girl must have known something about Zhang Yang. He had only wanted to protect Zhang Yang, but now he had gained support from the daughter of the province leader! With lesser obstacles in his path, he could now give a better impression to Zhang Yang and gain his favor!</p><br/><p>He raised his hand and waved. “The office will now take over and handle the case. We will now interrogate everyone and reveal the truth!”</p><br/><p>Raging with anger, Qian Hong Wen bellowed. “Y-You! Y-You can’t interrogate me! I’m a government official!”</p><br/><p>Gu Jun swiftly glanced at him and replied while looking in to the distance. “This is but a normal case of street fights and attempted rape. You’re here as a criminal suspect. We’re not going to charge you with any political offense! That would require further investigation by the Bureau!”</p><br/><p>Qian Hong Wen wanted to open his mouth to scream, but he was quickly dragged into the station by a larger police officer.</p><br/><p>Zhou Kang Ming and the rest of them dropped their jaws. What the hell happened? How could the bold, arrogant Chief Qian be dragged away in an instant! And then there’s Zhang Yang. What is he? Who is he? What made him so special that even the Deputy Chief of the Public Security Bureau would risk protecting him?</p><br/><p>Circling about the same questions over and over again, the rest of them felt like they had not known Zhang Yang at all! He was shrouded in mystery! After the whole ordeal was almost over, they had finally realized that the real man, the real boss was Zhang Yang! Being quiet and all after being detained, he was the wolf hiding in a sheep’s skin! Everyone had been blinded by their greed! How could they not know sooner?! Now, they are doomed for sure! They had been vigorously trying their best to draw a clear line between them and Zhang Yang, to make sure the police do not group them up with him. But lo and behold, Zhang Yang had emerged triumphant! Now that it has come to this, how could they beg him for help! He would not even glance at them! But, worse, if he wanted revenge…Zhou Kang Ming and the rest could not bear to think of the consequences of their actions…everyone was a pale as ghost.</p><br/><p>On one note, Zhao Hui Shan felt devastated. She did not know what to think now! Did she, perhaps, make the wrong choice after all? That question was now planted in her brain, echoing endlessly as she could not stop thinking about it!</p><br/><p>Secretary Lee was smarter. For a while now, he knew that things had gotten out of hands. He retreated secretly and called Ma Wu Shi, telling him everything and had just happened in the station without leaving a single detail untold. Ma Wu Shi had clocked out long ago, but when he heard his secretary report, he had only given him one order. “Let the office handle it!”</p><br/><p>The office…handle…it…</p><br/><p>…</p><br/><p>Zhang Yang was the first one to have his testimony recorded. He then explained everything that had happened in the scene down to each detail. Yu Li had drank a cup of hot tea earlier and regained a some of her senses. She was the first person that was directly related to the incident. Monkey Butt was rather weak-willed. After being threatened by the police, he gave in and exposed his plans about how he and Qian Hong Wei wanted to do Yu Li in the Karaoke center. Moreover, he even exposed his past crimes of luring female students in for sex!</p><br/><p>This time, it was most certain that Monkey Butt would not escape his fate being jailed. However, Qian Hong Wen was rather hard to deal with. The police alone could not interrogate a Deputy Chief. They would need the appropriate authoritative figure to do so!</p><br/><p>Yang Zhi Xian made a quick phone call and after a very short period of time, Leader Yang, the provincial leader of the Cang Lang province had personally called Gu Jun to make a statement. “This nation will not allow a rotten criminal to sit among the government position!”</p><br/><p>That statement was a hint for Gu Jun to collect enough evidence. The Cang Lang Provincial office would always conduct their own investigation and find all the criminal acts that Qian Hong Wei had committed in the past!</p><br/><p>Suffice to say, Qian Hong Wei is doomed!</p><br/><p>Qian Hong Wei could have never foreseen this event. There was a saying, if you do not secure your footing, you’ll fall into the frozen lake! Yang Zhi Xian was the one that had caused the domino effect that led all the way to how Qian Hong Wei fell. At first, she had stated her intention to help Zhang Yang, which led to Gu Jan arresting him. Yang Zhi Xiang had also advised her father, Yang Bao Kun to discard the rotten apples in the basket. Since this man would only develop more problem for Yang Bao Kun, he had to be removed; if he could not be a useful ally, he is a useless trash!</p><br/><p>Now that Gu Jun had things cleared out with Qian Hong Wei, he could still leave a good impression on Zhang Yang. That’s two birds with one stone! How could he not be happy?</p><br/><p>After the messy ordeal, everyone , be it Yang Zhi Xian or his ex-classmates, had a different opinion on Zhang Yang. Right now, Zhang Yang was the best among them and they should have treated him better. Zhou Kang Ming was practically slapping himself in the face, crying as he said a dozen ‘sorries’ for looking down on Zhang Yang. He pleaded to have a little mercy and forget about him. All that, while wiping away his snort and tears. The last thing he could do was to kneel down and kiss his boots. Fatty Han was so delighted at the sight of Zhao Kang Ming that he was laughing all the way out of the station.</p><br/><p>Zhao Hui Shan saw how his boyfriend was behaving and felt utterly disgusted. Then, she remembered back at the fight in the Karaoke center, where he had pushed her in front of himself to be his shield. She felt an even greater disgust at his cowardice.</p><br/><p>Being a policeman for several years, Gu Jun had good insight with people, and he noticed how Zhang Yang and Zhou Kang Ming were not seeing eye to eye, quietly noting a reminder for himself. He should find leverage on Zhou Kang Ming, and take ‘good care’ of him, and kept this matter secret from Zhang Yang. He would leave a subtle hint to Zhou Kang Ming, never to mess with Zhang Yang or he will pay it dearly. That way, he could still do something for Zhang Yang and remain unaffected.</p><br/><p>After the recording of their testimony, Gu Jun pulled Zhang Yang alone to have a friendly chat. He expressed his utmost sincere intention to deepen their relationship and to be friends. He then let them all go home and even gave them advice to rest early.</p><br/><p>On his way out of the Bureau, he noticed Yu Li wobbling unsteadily and said to Fatty Han. “Fatty! You go on. I’ll send Teacher Yu back home.”</p><br/><p>Fatty Han cracked a perverted smirk and walked away from Zhang Yang. “Sure!” he gave a thumbs up gesture and leaved them alone. At least, Fatty Han could have some alone time with Wu Hai Li.</p><br/><p>“Teacher Yu, I’m here to send you back!” said Zhang Yang. He then proceeded to support her out of the station. On the road side, Zhang Yang hailed a cab and the two of them disappeared into the night.</p><br/><p>“I have never though that Zhang Yang could have such deep connections!” said Liu Qi Ming in awe. Since the group of ex-classmates were sent here with the police car, they had to take a cab to get back to the Karaoke center and drive their own cars back home.</p><br/><p>Liu Qi Ming thought of Fatty Han and viewed him with respect. He came to a conclusion by himself that Fatty Han must have had help from Zhang Yang by pulling some strings here and there. It was the only explanation on how a guy with poor education, who only knew how to fight for living, could earn such a massive fortune in such a short time!</p><br/><p>In truth, he was right, though it all happened in the game.</p><br/><p>“Fatty, what sort of person Zhang Yang is?” said Wu Hai Li curiously while she was in Fatty Han’s embrace.</p><br/><p>“What do you mean by that?” replied Fatty Han.</p><br/><p>“You know what I mean!”</p><br/><p>Fatty Han knew what she meant. But, to describe Zhang Yang properly would be a challenge. Was he normal? He was normal. He was as normal as the random person you see in the streets. But he was not dumb. He will not reveal how a brother helped him to earn that surreal amount of gold. He purposely scoffed and said, “My boy Yang is rather strong! He has more than 10,000 underlings!” He then proceeded to use in-game context to tell her about Zhang Yang.</p><br/><p>But, if you do not explain properly, how would the girl know about Zhang Yang playing a game! When other heard about having 10,000 underlings, they would certainly give you the same shocked looks on their faces. How could a person manage 10,000 subordinates? If it was a company, how large would the company be then? If he was a government official, which department could fit in 10,000 officers? Could it be special forces?</p><br/><p>There could be a possibility, since the man could fight like a MMA fighter! He must have been scouted by a leader and was chosen to join! Damn! If he had more than 10,000 subordinates under his command, what rank would he be then? Instructor? If he was an instructor, then he would be at the rank of a City Leader!</p><br/><p>As confusing as it may, the guesses they made only grew wilder. Everyone thought that they had Zhang Yang figured out and were shocked at their own conclusions. How could Zhang Yang be a government official at such young age?</p><br/><p>…</p><br/><p>After drinking some hot tea back at the station, she did sober up a little. However, the alcohol was still affecting her. Bobbing her head left and right in the car, she could not endure it any longer and rested her head on Zhang Yang arm.</p><br/><p>Zhang Yang had a strong muscle and thick skin, he did not mind about it one bit. On the contrary, he was afraid that his roughness might hurt her delicate skin. He opened his arm and let the woman rest on his chest.</p><br/><p>“What a lovely couple!” said the 40-year-old cab driver as he peeked through the rear mirror.</p><br/><p>Zhang Yang only smiled at the driver without saying a word. Since both Yu Li and Zhang Yang did not meet that very often, let misunderstandings be misunderstandings.</p><br/><p>The cab driver was rather chirpy; he had been having idle conversation with Zhang Yang every once in a while. Yu Li, disturbed by their talks, woke up groggily and finally managed to state her home address. After 20 minutes, the cab arrived at an old housing area and stopped in front of an old apartment which looked like it was around 20 to 30 years old.</p><br/><p>Zhang Yang paid the driver and helped Yu Li out of the car. He lifted his head up to see the apartment had 5 floors.</p><br/><p>“Teacher Yu, which floor are you living in?”</p><br/><p>Being out in the night, the cold wind blew her face, bringing her back to her senses. “Four…no…three…wait..fourth floor!”</p><br/><p>Zhang Yang frowned. He pushed himself and supported Yu Li to climb up all the way to the fourth floor. Luckily, after struggling to find her keys, she managed to unlock the right door after all. He was afraid that they might have been trying to open the wrong house door. She opened the old wooden door and brought Zhang Yang into an old 60 to 70 meter square apartment.</p><br/><p>“S-Sit…” said Yu Li bashfully. Whether it was the alcohol in her, or the fact that she was seen by one of her ex-student being in such a mess, who knew? She brewed some tea and served it to Zhang Yang, while she went back to the kitchen to drink some vinegar, fully sobering herself up.</p><br/><p>Zhang Yang looked left and right, observing her living area and asked. “Teacher Yu, didn’t you once say that you’re living with your mother?”</p><br/><p>The little small apartment had only one room, one living room, and a toilet. The bedroom door was wide open. The bed looked rather neat and tidy, as if no one had been sleeping on it for a while.</p><br/><p>Yu Li came out of the kitchen. Solemn and dread filled her face as she said, “My mother is in the hospital!”</p><br/>\n</div>"}