{"title": "Chapter 216: A Call from the Princess", "id": 216, "volume": 3, "url": "http://boxnovel.org/mmorpg-rebirth-of-the-legendary-guardian-chapter-216-a-call-from-the-princess", "volume_title": "Volume 3", "body": "<h1>Chapter 216: A Call from the Princess</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 216: A Call from the Princess</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Zhang Yang rode through the Frozen Sky Wasteland, the Necrotic Wastelands, and finally reached the eerie Flatlands of the Passings. Here, all year long, in fact, for as long as it had existed, thick mist covered the entire field. It was like a layer of dense clouds had descended from the high heavens and blanketed the entire flatlands. The problem was that sunlight was extremely scarce. Dark and gloomy, the entire area was littered with the deceased of many races.</p><br/><p>There were corpses of Human, Elf, Dwarf, Beastman, and even monsters of various sizes. Apparently, many years back, a war between the Union and the Demons had taken place on this very field. The remains of those who fell in battle were buried deep underground. With the cumulative anger and vengeance left around, the place was corrupted, spawning endless number of spectres to forever roam in this wasteland.</p><br/><p>Zhang Yang was here to complete a hidden quest. In his previous life, one of his old friends had spoke to him about the quest briefly. Zhang Yang only knew that the quest can only be triggered somewhere in the Twilight Hills. But he was still clueless about how and where exactly in the map can he trigger it.</p><br/><p>The Level 50+ maps are not within the city’s jurisdiction, and thus, they do not have a specific Teleportation Point that players can use to travel around. As such, players would have to depend on their mounts to travel from map to map. Zhang Yang had traveled from Frozen Sky Wasteland all the way to the Necrotic Wastelands. His trip had taken a total of three hours!</p><br/><p>For that reason, once a new Territory spawns, and Teleportation Points become accessible to the players, the owner of the Territory can set a toll fee and gain a massive fortune from this little business!</p><br/><p>…</p><br/><p>Zhang Yang spent another 30 minutes and found Twilight Hills. This little hill was only a few hundred meters tall. However, the long stretch of the mountains went on for quite a distance. On top of the hill were tombstones that were covered in snow. Most of the tombstones were eroded, Zhang Yang could not make out the engravings on their surfaces. As he continued looking, he noticed that most of the tombstones were not in their respective places. Some of them were lopsided, while others had completely fallen down. There were holes everywhere, clearly indicating that many graves were no longer occupied. In fact, the area was densely populated with spectres, making \"oooo, arghhh, and urghhh\" moans as they wandered aimlessly.</p><br/><p>Spectres can be categorized into two tiers. The lower tiers are the weaker ones and had been revived by the vengeful sentiments of their past life. The only reason as to why they have been revived is to kill. A good example of lesser spectres are Skeletal Soldier and Zombies. High Leveled spectres had a distinctive feature that separated them from the others. They had the same level of intelligence as they had before they died. Some even retained their original memories!</p><br/><p>All of the spectres in Twilight Hills are all lower leveled spectres, Skeletal Soldiers. However, even though they are considered as lesser spectres, it does not mean that they are low in level!</p><br/><p>[Twilight Skeletal Warrior] (Normal, Spectre)</p><br/><p>Level: 54</p><br/><p>HP: 5.400</p><br/><p>Defense: 50</p><br/><p>Can these sluggish monsters possibly deal any damage to me?</p><br/><p>Zhang Yang thought to himself and smirked.</p><br/><p>\"Ride like the wind, Boney M!\" Zhang Yang pulled the reins and the skeletal horse neighed as loudly as a passing train. Both of them charged into the group of monsters.</p><br/><p>\"Groowl!\" The Skeletal Warriors responded as they saw Zhang Yang approaching them at high speed. They opened their jaws in a voiceless warcry and swung their swords at Zhang Yang. Riding the horse, Zhang Yang dodged the attacks easily and the monster started to chase after him.</p><br/><p>He began to attract the attention of more and more monsters, only stopping to turn around when he estimated that he had kited at least 30 monsters. Zhang Yang unsummoned his mount and got ready.</p><br/><p>{Blood Rage}! +30 Rage</p><br/><p>{Charge}!</p><br/><p>Zhang Yang slid across the field and charged into one of the incoming monsters.</p><br/><p>{Horizontal Sweep}!</p><br/><p>Zhang Yang’s attack struck them all at once, dealing an average amount of 3,300 damage to the horde of monsters around him. There were even some hits that registered as Critical Strikes killing some monsters instantly.</p><br/><p>The monsters retaliated. However…</p><br/><p>‘-0!’ ‘-0!’ ‘-0!’ ‘-0!’ ‘-0!’ ‘-0!’</p><br/><p>None of the attacks could deal any damage to Zhang Yang. The Level 54 Normal monster had little more than 1,000 physical attack, which meant that, even if their attack could break through his defense without being nullified, the value that did get through was so low that it would be completely absorbed by the equipment’s damage absorption passive skill!</p><br/><p>They are…too weak!</p><br/><p>{Thunder Strike}!</p><br/><p>Wham!</p><br/><p>A chain of ‘-480!’ damage texts flew across everywhere. As the monsters staggered from the blow, Zhang Yang quickly turned around and continued running around, forming a long line of monsters that followed him doggedly. Zhang Yang kited as many monster as he could and used {Horizontal Sweep} every 10 seconds and {Thunder Strike} every eight seconds. {Blast Wave} was used every 30 seconds to wipe the monsters out whenever their numbers grew sufficient.</p><br/><p>‘Ding! You have killed Twilight Skeletal Warrior. Obtained 5,400 Experience Points!’</p><br/><p>‘Ding! You have killed Twilight Skeletal Warrior. Obtained 5,400 Experience Points!’</p><br/><p>‘Ding! You have killed Twilight Skeletal Warrior. Obtained 5,400 Experience Points!’</p><br/><p>…</p><br/><p>The system notification rang in his ears continuously as he killed the monsters. The amount of experience points he gained was rather abundant and he smiled in satisfaction. If he could train like this alone for a few days, his level would quickly exceed even Han Ying Xue’s and he would be the highest leveled player in the China server!</p><br/><p>In one clean sweep, Zhang Yang had cleared all the monsters within a few hundred meters around him. Zhang Yang went around and slowly picked up the loots on the ground. In ‘God’s Miracle’, the gold coin drops that was produced in the game was very limited, and when they did, the amount would be negligible. Even when a monster is at Level 54, it would drop only 50 copper coins. If he had to pick them up one at a time, he had to spend an eternity, only earning some pocket money. Zhang Yang was doing this only because he suspected that the hidden quest might have something to do with the monsters’ drops. It was a tedious waste of time!</p><br/><p>Going through a few hundred monster copses for their loots would take a lot of time as well! Zhang Yang had spent close to 10 minutes inspecting the corpses for loots. Other than [Cloths], there were other ETC items such as [Weathered Thick Bone] and [Broken Helmet]; none of them worth anything!</p><br/><p>Zhang Yang rode on his horse again and begun to kite the monsters all over again. The second wave of monsters yielded loots that were just as poor. By the third wave however, a beautiful stone that shone gold, similar to Yellow-Gold equipment, was on the ground.</p><br/><p>[Weird Stone] (Special)</p><br/><p>Description: You can feel a faint magical power from within this weird stone. It’s extremely weak! Perhaps you can feel a stronger power if you gather more of these stones!</p><br/><p>Use: Combines 12 [Weird Stone] into one [Magical Communication Stone].</p><br/><p>\"Hmm. Is this what I’m looking for?\" Zhang Yang murmured. He kept the glowing stone in his inventory and continue farming.</p><br/><p>After killing waves and waves of monsters, Zhang Yang slowly accumulated the [Weird Stone]s. From just one, to three pieces, eventually he gathered 11 pieces in total.</p><br/><p>‘Ding! You have obtained [Weird Stone]!’</p><br/><p>Zhang Yang had long since lost count on how many waves he had to go through before the 12th stone finally appeared.</p><br/><p>He took the stones out and placed them together.</p><br/><p>FUUSH!</p><br/><p>Together, the 12 stones began to glow intensely; Zhang Yang had to look away for a second. The stones fumble around for a little wild, slowly piecing themselves together to form a larger…stone.</p><br/><p>\"What was I thinking? What else could have happened? A king kong appearing from within the stone?\"</p><br/><p>Zhang Yang picked up the stone and checked its properties.</p><br/><p>[Magical Communication Stone] (Quest Item)</p><br/><p>Use: Use the stone to reveal a hidden message! Hurry! Someone might need your help!</p><br/><p>Zhang Yang placed his palm onto the stone and a gold light beam out from it. Close to where Zhang Yang standing, the beam of light projected a life-sized image of a beautiful girl. She had a blond hair and ruby-red eyes. She was dressed in a flamboyant royal gown which stood out in the desolate background. Somehow, the dress looked like it was perfect for her instead of the other way around.</p><br/><p>[Projection of Princess Serena] (Normal, Summon)</p><br/><p>Level: 1</p><br/><p>HP: 0/50</p><br/><p>Defense: 0</p><br/><p>\"Princess Serena?\" Zhang Yang took a step back in shock. Isn’t she the only remaining legitimate heiress of White Jade’s royal family? The future queen of White Jade?</p><br/><p>\"Warrior! I need your help! The King of White Jade needs your help!\" said Serena. Her voice shook as she pleaded desperately, her face lined with worry.</p><br/><p>Zhang Yang saluted and said, \"Princess, I’m yours to command!\"</p><br/><p>\"Warrior, I’m trapped in the deepest part of the Tomb of the Gray Shadow. Please! Make your way there! Be careful, there is an incredibly powerful Necromancer guarding the place! You must make preparations for this raid!\" said Serena. The edges of the projection started to crack. The cracks grew and spread quickly. It looked like the projection would shatter into pieces anytime soon.</p><br/><p>\"Princess!\"</p><br/><p>\"Argh! I-I can’t maintain this form any longer! The power of the soul is getting weaker by the minute! Warrior! Please help me! I…I-I …h-hold…m-muc...lon…ger.\" Her cracking voice dimmed and the projection blew up, pieces of it flying everywhere, like an explosive mirror.</p><br/><p>‘Ding! You have accepted the quest: A Call from the Princess!’</p><br/><p>[A Call from the Princess] (Difficulty Level: A)</p><br/><p>Quest Description: Warrior! Head to the Tomb of the Gray Shadow to search for Princess Serena! She needs your help!</p><br/><p>Progress: Find Princess Serena 0/1</p><br/><p>\"Isn’t the princess living in White Jade Castle? How did she end up all the way there? For worse, she’s now trapped there! How could White Jade Castle remain quiet about this? They should have dispatched the entire army to search for her! She is the only heiress to the throne!\" Zhang Yang cursed. But now that he had accepted the quest, might as well get on with it.</p><br/><p>He circled the area for a while and found an entrance to a cave. After clearing a few waves of monsters outside the cave, he entered it alone.</p><br/><p>‘Ding! You have entered the Tomb of the Gray Shadow!’</p><br/><p>Zhang Yang opened the world map and examined the map he was in. The entire structure of the tomb was like a spider’s web. There were many tunnels that broke off into other tunnels! This cave was simply too complicated!</p><br/><p>\"Die!\" a voice was heard and Zhang Yang saw a glint of an axe approaching. Zhang Yang dodged it. The attacker was a skeleton with a few broken pieces of metal armor hanging onto its body. Emerald flame burned within its eye sockets.</p><br/><p>[Tomb Guardian] (Elite, Spectre)</p><br/><p>Level: 55</p><br/><p>HP: 55,000</p><br/><p>Defense: 300</p><br/><p>‘-763!’</p><br/><p>Another attack came and Zhang Yang deliberately let it land. He wanted to assess this monster’s strength. The result was rather pleasing! The Tomb Guardian did around 3,000 of basic attacking damage. Zhang Yang had 920 Defense, 900 passive damage absorption, and a 20% passive damage reduction, which reduced the attack down to less than 800 damage.</p><br/><p>‘-1,643!’</p><br/><p>Now that Zhang Yang had a good gauge of its strength, he began striking back.</p><br/><p>{Block}! +30 Rage</p><br/><p>‘-355!’ {Block} reflect damage.</p><br/><p>Zhang Yang used {Warrior’s Will}! The next {Destructive Smash} will be a critical hit!</p><br/><p>‘-7,012!’</p><br/><p>The hard blow immediately removed 13% of the monster’s HP!</p><br/><p>This is truly OP! A controlled critical strike such as this, dealing 7,000 damage, would easily kill 90% of the current players!</p><br/><p>Even though the Tomb Guardian was a Level 55, Elite tier monster, his 55,000 HP was no challenge to Zhang Yang. In just half a minute, Zhang Yang had turned the monster into a pile of brittle bones, losing only around 6,000 HP in the process.</p><br/><p>Among the loots, there was a Green-Copper tier Shield. Zhang Yang quickly picked the item up and examined it.</p><br/><p>[Malevolent Shield] (Green-Copper, Shield)</p><br/><p>Defense: +250</p><br/><p>Vitality: +150</p><br/><p>Level Requirement: 50</p><br/><p>Malevolent Set (1/4):</p><br/><p>{Malevolent Necklace}</p><br/><p>{Malevolent Cape}</p><br/><p>{ Malevolent Sword}</p><br/><p>Malevolent Shield</p><br/><p>Two Equipped: Have a 50% chance to {Curse} the target every time you receive an attack. Reduces 1% of target’s attacking power. Maximum 5 stacks can be applied.</p><br/><p>Four Equipped: 50% chance to reduce the target’s Defense on every successful hit. Target takes 1% more damage from everything. Maximum 5 stacks can be applied.</p><br/>\n</div>"}