{"title": "Chapter 224: Aura Stone", "id": 224, "volume": 3, "url": "http://boxnovel.org/mmorpg-rebirth-of-the-legendary-guardian-chapter-224-aura-stone", "volume_title": "Volume 3", "body": "<h1>Chapter 224: Aura Stone</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 224: Aura Stone</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Demonic the Treant King used the {Swing} attack every 45 seconds, while {Wild Charge} only had a cool down time of 30 seconds which could totally negate the knockback effect of Demonic the Treant King’s swing attack!</p><br/><p>Bang! Bang! Bang!</p><br/><p>Demonic the Treant King trampled on the lake, causing miniature tsunamis, and a lot of chaos as fishes and prawns were washed out, hitting the land around it.</p><br/><p>90%, 80%, 70%... Everybody slowly reduced Demonic the Treant King’s long HP.</p><br/><p>Snow Seeker acclaimed, \"Guild master Zhan Yu is so smart. If we did not use the lake’s environment to weaken the Treant King’s damage, we would not even stand a chance! the Treant King’s damage is much higher than Mountain Giant, even if we had more people, this boss would just kill all of us instantly! If real world elements were not even considered, we would have to gather thousands of players above Level 50, or wait until we are at Level 70 with better equipment!\"</p><br/><p>Fatty Han immediately seized the credit and responded, \"Guild master Snow Seeker, I am the one who brought little Yang into this game! All the tactics and skills you witness have been taught by yours truly!\"</p><br/><p>\"… Fatty, you can exaggerate it even more?\"</p><br/><p>Fatty Han shamelessly said, \"Guild master Snow Seeker, does Crimson Rage not invite male players?\"</p><br/><p>Perfumed Water could not hold back on retorting, \"You must master the ‘Sunflower Manual’, and then undergo plastic surgery. Perhaps then, you can be invited into our guild!\"</p><br/><p>Fatty Han suddenly felt a chill creeping down his crotch. He bent his head down, looked and touched his crotch contentedly.</p><br/><p>\"Oy!\" the girls protested when they saw Fatty Han doing so.</p><br/><p>Fatty Han laughed out loud with pride, and sent a private message to Zhang Yang, \"Little Yang, I just love teasing these little pretties! Unfortunately, all these girls are yours, I’d feel embarrassed to hit on them! By the way, let’s go for a drink tonight!\"</p><br/><p>Zhang Yang felt cold sweat dripping down his head and replied, \"If you want to take advantage of them, then just say it, don’t come up with excuses!\"</p><br/><p>In this battle, the most taxed were the two healers as they need to constantly heal everyone HP. If they were a second too slow, someone could have been trampled to death by the Treant King. The rest of the people were quite relaxed, even drinking some lake water as they were graciously trampled till they hit the bottom of the lake.</p><br/><p>At one point, Fatty Han mentioned that something leaked out of him. Although he never specified on the details, everyone had a good guess and a few girls almost desperately ran to the lakeshore.</p><br/><p>40%, 30%, 20%, 10%!</p><br/><p>\"Kong! Kong!\" the Treant King roared madly, a blood-red halo flashing over its mottled bark. The huge the Treant King instantly turned into a crimson color!</p><br/><p>‘Ding! the Treant King has initiated {Sucker Punch}. All attack increased by 50%!’</p><br/><p>\"the Treant King’s getting violent. Go ahead and use your long cooldown skills, we’re going to need every bit of juice!\" Zhang Yang shouted loudly.</p><br/><p>Zhang Yang had kept his guard up, in case this open world boss went berserk, a typical trait of its kind. Prior to the battle, he had already told the gang to keep their long cooldown duration skills in reserve, only unleashing these skills when the boss became violent! Thus, everyone activated their respective skills and drank Power Potions, before starting to attack the Treant King with equal fervor.</p><br/><p>The hardest hitter was Wei Yan Er, as her Level 50 class quest’s reward was a Yellow-Gold two-handed axe. Her melee attack had already reached 2,800, and after activating {Indiscriminate} and ingesting a Power Potion, her attacks went way overboard, even surpassing Zhang Yang’s attacks!</p><br/><p>{Indiscriminate}: All attacks have 90% chance to cause critical strike within 10 seconds. Can only affect targets with HP less than 20%. Cool down time: 10 minutes.</p><br/><p>‘-6,012! Normal attack. Critical strike.’</p><br/><p>‘-10,002! { Tornado Cleave}. Critical strike.’</p><br/><p>Her critical strike exceeded ten thousand damage!</p><br/><p>The little brat was giddy with excitement every time she slashed the Treant King. For this 10 minutes she was like a heavenly God as her critical strikes caused double damage. the Treant King’s 750 Defense Value barely suppressed her base attacks, only allowing her critical attacks to be -- critically effective!</p><br/><p>She left everyone speechless with her terrifying damage!</p><br/><p>the Treant King’s attack increasing by 50% nearly overwhelmed the healing rate of the two healers. Thus, Zhang Yang quickly used the {Vanguard's Aggression} protective barrier and {Shield Wall} at the same time.</p><br/><p>Because everyone was using their long cooldown duration skills, they successfully reduced the Treant King;s HP by 200,000 points within 10 seconds, leaving the Treant King with 300,000 HP! But the duration for their long cooldown duration skills was finished, so the team’s attacks reverted back to how they were before.</p><br/><p>The moment {Vanguard's Aggression} expired, everyone’s HP bars went up and down like a roller coaster. The healers were playing a game of pong with the boss, and the balls were the HP bars of the team!</p><br/><p>Zhang Yang made up his mind and decided, \"Evil Snow, Perfumed Water, ignore Hundred Shots and Fatty, let them die! Focus your healing on the rest of the team, especially Daffodil Daydream, her flame element is key to the battle! Keep her alive at all costs!\"</p><br/><p>It was impossible to keep everyone alive, so it was best that they ensure the safety of the hardest hitters!</p><br/><p>The moment Fatty Han heard Zhang Yang’s command, he used {Fake Death} and lay down beneath the surface of the water!</p><br/><p>Bang!</p><br/><p>the Treant King stomped on the lake once again, and with a big splash, a ‘-4,434’ damage text appeared above Fatty Han’s head. The pitiful Fatty Han had been left with only one-third of his HP before activating {Fake Death}. There was no hope for survival. Instantly, Fatty Han’s {Fake Death} became the real death!</p><br/><p>\"Damn, I already used {Fake Death}, the boss still trampled on me!\" Fatty Han scolded angrily.</p><br/><p>\"Fatty sh*t, the Treant King has ranged attacks, it is useless to {Fake Death} within the Treant King’s range attack!\" Zhang Yang could not help but laughed.</p><br/><p>On the other hand, Hundred Shots had tried to swim away from the Treant King’s range attack but the speed of the player in the water was only 10 m/s. Hundred Shots was only able to swim about seven to eight meters away from the Treant King before he joined the perverted Fatty in death!</p><br/><p>With the departure of the two hunters, Han Ying Xue and Perfumed Water instantly had lightened loads, albeit it was still very stressful for them!</p><br/><p>Zhang Yang threw {Sacrifice} on Daffodil Daydream without hesitation. At the same time, he also summoned [Servant: Clear Lotus] and activated {Substitute} to relieve the pressure.</p><br/><p>250,000! 200,000! 150,000! 100,000!</p><br/><p>the Treant King retained last traces of his HP. However, everyone’s HP bars in the team were not faring any better. the Treant King gave the lake a huge stomp again, striking those close by, with Zhang Yang the only one left standing!</p><br/><p>80,000! 60,000! 40,000!</p><br/><p>‘Ding! Player Snow Seeker has died!’</p><br/><p>30,000! 20,000!</p><br/><p>‘Ding! Player Drizzler has died!’</p><br/><p>\"Wu wu, cousin, why didn’t you heal me?!\"</p><br/><p>10,000! 5,000! 1,000!</p><br/><p>\"Kong!\" the Treant King suddenly flared-up with an earth-shattering scream and its huge body crashed down, flattening countless of trees across the land -- the Treant King’s body was at least a few hundred meters long!</p><br/><p>\"Hu!\" the survivors let out a sigh of relief as they had been getting increasingly concerned. If the Treant King had an extra 300,000 to 500,000 HP, Zhang Yang and the gang would be the ones defeated!</p><br/><p>\"Save them first!\" Zhang Yang told the two healers.</p><br/><p>Han Ying Xue and Perfumed Water immediately started to reviving the fallen. One minute later, all of them were sitting by the lakeside, eating health recovery food to recover their conditions.</p><br/><p>Zhang Yang cancelled his mount summon, and ran to the side of the Treant King’s corpse to pick up the loot. Luckily, the loot dropped from the Treant King were clustered together in one corner. Imagine having to run a few hundred meters just to pick up the loot alongside that massive body.</p><br/><p>The first item Zhang Yang picked up was the quest item, [Root of the Demonic the Treant King]. Zhang Yang placed it next to the [Heart of the Winter Bear King] in his inventory and looked for other items.</p><br/><p>[Furious Metallic Gloves] (Yellow-Gold, Heavy Armor)</p><br/><p>Defense: +40</p><br/><p>Vitality: +101</p><br/><p>Strength: +40</p><br/><p>Dexterity: +40</p><br/><p>Equipment: Absorbs 70 damage points each time you receive an attack.</p><br/><p>{Unidentified}</p><br/><p>Class Requirement: Guardian</p><br/><p>Level Requirement: 60</p><br/><p>Zhang Yang laughed happily and said, \"Very good, the first equipment is mine, I’m such a ‘Lucky Hand’!\" he immediately threw the gloves into his inventory.</p><br/><p>\"F*ck, Little Yang, find me a few Hunter’s set equipment with that ‘Lucky Hand’!\" Fatty Han said immediately.</p><br/><p>\"Ya, my gloves and boots as well!\" Wei Yan Er also joined the conversation.</p><br/><p>Zhang Yang coughed and said, \"Write down your wishes on a paper and put it under your pillow on the 24th of December, I will be the Santa Claus who fulfills your wishes!\"</p><br/><p>Suddenly, everyone went silent but Fatty Han laughed mockingly and said, \"Little Yang, if you are representing Santa Claus, does that leave you with nothing but ‘balls’?\"</p><br/><p>\"Get lost!\" Zhang Yang shooed him away while the girls blushed, rolling their eyes pointedly at Fatty Han.</p><br/><p>\"Sigh, my only wish from Santa Claus is to have two girls at once when ‘having some action’!\" Fatty Han said it, surprisingly solemn. They had never seen the cheerful Fatty Han wearing such a sincere facial expression. It could only mean that this wish truly came from the depths of his heart, a wish that he would fight for, as his lifetime goal!</p><br/><p>Everyone started perspiring like waterfalls. They all had seen their fair share of perverts, but have never seen a pervert setting something so perverted as his goal in life!</p><br/><p>Zhang Yang immediately continued picking up the loot, except his gloves which was the set equipment part, Treat King dropped another three Yellow-Gold equipment, none of them belonging to any set, which were the Priest’s helmet, Priest’s boots and Beastmaster’s chestplate.</p><br/><p>Because Han Ying Xue already had a Yellow-Gold helmet so this helmet went to Perfumed Water by default, while the boots went to Han Ying Xue. Everyone was happy with the distribution. Hundred Shots had taken a pair of boots yesterday, so the chestplate went to Fatty Han. It kept the entire party happy.</p><br/><p>Zhang Yang touched the Treant King’s corpse once again, his eyes suddenly shone, as he took out two stones, proclaiming, \"Aura stones!\"</p><br/><p>Both of these stones were crystal clear and shone like two sapphires. They were magnificent.</p><br/><p>None of the girls would turn away from shiny gemstones. Han Ying Xue and the rest of the girls surrounded the aura stone. Even the cool Snow Seeker was not an exception, and they started their girl chatter.</p><br/><p>The girls were overcome with excitement, chattering and laughing. Zhang Yang shook his head again and again as he said, \"Come on girls, these are not gemstones, don’t get so excited!\"</p><br/><p>[Beginner Aura Stone] (Consumable)</p><br/><p>Use: Increases a level of aura skill that is less than Level 3.</p><br/><p>Requirement: Possess an aura skill.</p><br/><p>Everyone reached out for the stones, including those who did not possess any aura to speak of.</p><br/><p>Zhang Yang was frowning and as he looked at Snow Seeker and Perfumed Water, before saying, \"Both of you don’t have auras, what are you going to do with this?\"</p><br/><p>Fatty Han immediately sided with Zhang Yang and added on, \"That’s right, these stones are not ‘thick and long’, and they are useless for the both of you!\"</p><br/><p>Bang bang! Pa pa! The girls got fed up, and they caught hold of Fatty Han, giving him some punches and kicks.</p><br/><p>\"Those who have aura skills, please roll the dice! Whoever gets the highest and second highest points, gets one stone each!\" Zhang Yang made the decision as the party leader.</p><br/><p>Those people who had aura skill started to roll the dice immediately. As a result, Han Ying Xue, who was publicly known for having an affair with the system, rolled the highest point at 96 points while Zhang Yang rolled the second point at 92 points, so both of them got a stone each.</p><br/><p>\"What a lewd dog and lecherous vixen!\" Fatty Han who was beaten, crossed both his hands behind his back and sighed like a noble person.</p><br/><p>Zhang Yang opened his skill list and a few rows of skill immediately appeared as three-dimensional projections in front of him. Each skill description was engraved on a metal flatbed, and his fingers toggled and selected his {Vitality Aura} before using the [Aura Stone].</p><br/><p>[Aura Stone] broke into small particles of light, as his {Vitality Aura}’s flatbed glowed blue.</p><br/><p>[Vitality Aura] (Level 2): Increases the vitality of team mates within the effective range by 8%. Aura range: 30 meters radius round from the caster. The effect lasts until the death of the caster or until it automatically vanishes.</p><br/><p>Han Ying Xue did not use [Aura Stone] immediately, but admired hers lovingly. She even teased Wei Yan Er about it, riling up the little brat.</p><br/><p>After looting the two aura stones, the Treant King had no more Yellow-Golds to offer, but seven pieces of Gray-Silver equipment. Zhang Yang handed two pieces over to Snow Seeker as reward for her help in defeating the Treant King.</p><br/><p>\"Guild master Zhan Yu, are we going to fight the third boss?\" Snow Seeker was extremely satisfied as she and Perfumed Water had collected one piece of Level 60 Yellow-Gold set equipment over the past two days. They were really pleased.</p><br/><p>Zhang Yang looked at the time and replied, \"It is going to be 5.00 PM. Everybody should logout from the game take a break! Let’s gather at 7.00 PM at Tukula Fortress, the last boss somewhere in that direction!\"</p><br/><p>All of them nodded their heads and tore their [Teleportation Scroll]s, returning to White Jade Castle. They also identified the equipment, and restocked their health replenishing supplies.</p><br/><p>Zhang Yang also went to Item Identifier to identify his [Furious Metallic Gloves]!</p><br/><p>[Furious Metallic Gloves] (Yellow-Gold, Heavy Armor)</p><br/><p>Defense: +40</p><br/><p>Vitality: +144</p><br/><p>Strength: +58</p><br/><p>Dexterity: +58</p><br/><p>{Level 2 Socket}</p><br/><p>Equipment: Absorbs 100 damage points each time you deal an attack.</p><br/><p>Class Requirement: Guardian</p><br/><p>Level Requirement: 60</p><br/><p>Currently, Zhang Yang had four pieces of the Level 60 Yellow-Gold set. If he could get the last piece of set equipment, the boots, from Lord of Flames, and then he would have successfully gathered a full set! Being the top Yellow-Gold set of equipment at Level 60, he would have gain the power to conquer the upcoming dungeon, \"Thunderbolt Prison\"!</p><br/>\n</div>"}