{"title": "Chapter 226: Utterly Flattened", "id": 226, "volume": 3, "url": "http://boxnovel.org/mmorpg-rebirth-of-the-legendary-guardian-chapter-226-utterly-flattened", "volume_title": "Volume 3", "body": "<h1>Chapter 226: Utterly Flattened</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 226: Utterly Flattened</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Usually, the losing side would simply have the experience bar of their current level emptied out. Experience points could be regained by killing more monsters! But since this challenge carried the cost of losing a Yellow-Gold boss AND a main quest, Zhang Yang could not afford to let Sun Xin Yu go wild.</p><br/><p>Knowing her, if Zhang Yang directly told Sun Xin Yu something like, \"You are not his opponent, off you go.\", this block of ice that took human form would definitely lose her temper!</p><br/><p>Zhang Yang got around it by saying, \"How about we decide the winner by the best of three between three representatives from each side?\"</p><br/><p>One Sword Stroke thought for a while and replied, \"Okay! As long as I get to fight you, Zhan Yu, regardless of the other two battles!\"</p><br/><p>\"Alright!\"</p><br/><p>On another side, Mountain Cleaver immediately said, \"Boss, Zhan Yu doesn’t seem so sure of you. He is probably using the other two battles as a safety net!\"</p><br/><p>\"He he!\"</p><br/><p>Imperial Sky’s people laughed mockingly. Besides their professional bootlicking skills, they made a point to show that One Sword Stroke constantly had their support! He was their pride and joy!</p><br/><p>\"Brother Zhan Yu, in order to ensure the fairness and to avoid the situation of sending ill-matching classes against each other, how about we send our fighters on the spot?\" One Sword Stroke asked smiling slightly.</p><br/><p>Zhang Yang nodded in agreement and then spoke in the party channel, \"Ice cube, go for the first battle!\"</p><br/><p>Sun Xin Yu was slightly disgruntled as she actually wanted to fight One Sword Stroke. Zhang Yang wanted to prevent exactly that from happening! But she already said, \"Let me do this\". She was not the type to fall back from her words, according to her personality. However, she still glared at Zhang Yang angrily.</p><br/><p>\"Brother Zhan Yu, let’s start this!\"</p><br/><p>Both parties sent a player out.</p><br/><p>Eventually Lone Desert Smoke sent out Sun Xin Yu, while Imperial Sky sent out a Thief named Blooming Ichor.</p><br/><p>Zhang Yang thought for a while, trying to recall Blooming Ichor’s identity. In his previous life, he was the main Thief in \"Sky and Ocean Electronics\" a Professional League battle team that was led by One Sword Stroke. Although he was never mentioned in the list of the strongest Thieves in China server, he was still the main Thief in \"Sky and Ocean Electronics\", the strongest battle team in the S-Class Professional League. He must not be underestimated!</p><br/><p>Without wasting much time, both Thieves immediately used {Stealth}. The battlefield became deathly silent, the suspense almost suffocating! Battles between two Thieves usually played out in the form of a deadly hide-and-seek that could go on for half and hour, yet ending quickly within 10 seconds of action!</p><br/><p>One minute, two minutes, five minutes, ten minutes, both of these Thieves had yet to show themselves yet, knowing the first one to slip up would mean instant death!</p><br/><p>Zhang Yang laughed and said, \"Brother One Sword Stroke, let’s get started with the second battle! I hope we learn much from each other!\"</p><br/><p>\"Okay!\"</p><br/><p>\"Noob tank, let me do this! Let me do this!\"</p><br/><p>\"Little Yang, let me shoot them to death!\"</p><br/><p>\"Guild master, let me do this!\"</p><br/><p>\"Guild master Zhan Yu, let me do this!\"</p><br/><p>All of them wanted to join the battle!</p><br/><p>Zhang Yang thought for a while and said, \"Evil Snow, you fight the second battle!\"</p><br/><p>Han Ying Xue was caught by surprise as she was definitely a lazy person. She had slowly edged away from the crowd, planning to spectate silently. The last thing she expected was Zhang Yang asking her to fight a battle! She quickly shook her head and said, \"I’m just a healer, getting into a duel is none of my business!\"</p><br/><p>Zhang Yang laughed happily and said, \"It’s ok, ddin’t you buy a {Putrefying Poison} skill book last few days ago? Just keep that DoT on your opponent, and keep refreshing it. All you have to do is to heal yourself in the meantime!\"</p><br/><p>It was really difficult to defeat Han Ying Xue with her current equipment unless the opponent struck really, really hard. Otherwise, with her immense healing capabilities, she would easily undo any damage she sustains! Of course, if she encountered {Destructive Smash}, she would be helpless! Obviously, the only Warrior in Imperial Sky’s team -- One Sword Stroke could possibly possess such a skill. However, he would be fighting with Zhang Yang in the third battle so there was no way One Sword Stroke would be Han Ying Xue’s opponent!</p><br/><p>She may be a healer, but she was a super healer, and a super healer with super equipment would bulldoze over anyone else!</p><br/><p>After discussing among themselves, both parties sent out a player from each party for the second battle.</p><br/><p>Han Ying Xue versus Fire Fountain!</p><br/><p>Fire Fountain was a Pyromancer. His equipment gleamed. Although he did not have a full set of set equipment, he had a Level 50 Gray-Silver staff on his hand. His magic attack had surpassed 1,300. He definitely had the best equipment there was!</p><br/><p>However, they had not taken Han Ying Xue’s equipment into consideration. It racked up her magic attack to 1,800, probably being the highest magic attack among all Spellcasters, globally!</p><br/><p>The moment their fight commenced, Fire Fountain immediately activated {Heart of Flame} and rapidly started casting {Explosive Flame}!</p><br/><p>{Heart of Flame}: Increases Fire spells’ damage by 10%. Lasts for 10 seconds. Cool down time: 3 minutes.</p><br/><p>{Explosive Flame}: Throws a huge fireball towards target and causes Fire damage equivalent to 300% of magic damage. Cast time: 2 seconds. Cool down time: 10 seconds. Distance: 30 meters.</p><br/><p>While Han Ying Xue immediately activated her accessory, [Magician's Brooch] to boost her magic attack to 2,500 and casted {Putrefying Poison} on Fire Fountain.</p><br/><p>{Putrefying Poison}: Putrefies enemy with the power of darkness and causes Dark Abyss damage equivalent to 200% of magic damage within 15 seconds. This skill’s effect cannot be stacked. Cool down time: 1 second. Distance: 30 meters.</p><br/><p>After that, Han Ying Xue cast many healing skills on herself such as {Regeneration}, {Mending Prayers}, {Holy Shield} and {Brilliant Light}, where she completely ignored the existence of Fire Fountain. She did not even bother looking up at the fireballs that came flying at her face, she just kept on healing herself.</p><br/><p>Fire Fountain nearly vomited blood to death as he watched Han Ying Xue! Fire Fountain was a professional player, Han Ying Xue should at least be fighting him with more finesse, such as constant movement, tactical distancing or interruption of his casting bar! She should at least use {Punishment Ray} on Fire Fountain! Yet, here she was casting healing spells on herself and buffing herself up before even paying attention to Fire Fountain, \"fighting\" as she would be a monster!</p><br/><p>That’s right, Han Ying Xue did not have any clue on PKing, but her healing was very potent. She did not have to do much except to heal herself as her opponent slowly nibbled away at her HP!</p><br/><p>Two seconds later, a huge fireball flew from the tip of Fire Fountain’s staff and struck Han Ying Xue!</p><br/><p>‘Damage absorb!’</p><br/><p>That’s right, {Holy Shield} simmered around Han Ying Xue. When she applied {Holy Shield} on herself, her 2,500 magic attack meant that she could absorb up to 5,000 damage points.</p><br/><p>Thus, Fire Fountain needed another {Explosive Flame} to break through Han Ying Xue’s {Holy Shield}!</p><br/><p>Only now did Han Ying Xue realize that she could absorb damage with {Holy Shield}! She quickly changed her mind mid-heal and fired {Punishment Ray} at Fire Fountain.</p><br/><p>Fire Fountain was even madder and thought to himself, \"They sent such an idiot to fight me, are they looking down on me!?\" He was embarrassed and furious.</p><br/><p>‘-1,005!’</p><br/><p>‘-3,723!’</p><br/><p>The Han Ying Xue cast {Punishment Ray} on Fire Fountain, the first tick of {Putrefying Poison} occurred at the same time, taking at least 4,700 HP in total. He almost jumped out of his skin just then! His total HP was about 8,000. More than half of his HP had suddenly been hacked off, how could anyone remain composed after that?!</p><br/><p>Oh my god, how much magic attack does this woman have, she’s powerful!</p><br/><p>‘-2,012!’</p><br/><p>At the same time, his {Fireball} struck Han Ying Xue and finally broke her {Holy Shield}, causing damage.</p><br/><p>{Fireball}: Casts a fireball and causes Fire damage equivalent to 200% of magic damage to target. Cast time: 2 seconds. Distance: 30 meters.</p><br/><p>‘+5,034!’</p><br/><p>{Mending Prayers} immediately activated and fully recovered Han Ying Xue’s HP.</p><br/><p>Damn!</p><br/><p>The top Priest in Imperial Sky was also capable of casting {Mending Prayers}. Based on that, Fire Fountain knew that it healed by an equivalent of 200% of the caster’s magic damage. This only meant that his opponent’s magic attack was over 2,500, it was almost double his!</p><br/><p>Fire Fountain immediately used {Ice Barrier} to dispel {Putrefying Poison}’s effect and tried to create distance between himself and the crazy healer. He teleported in a blink of eye and reappeared 100 meters further. He hastily tried applying {Bandage} on himself.</p><br/><p>When Han Ying Xue saw Fire Fountain running away, she chased after him, in a rare show of effort. You would have a higher chance of being hit by a meteorite than witness her go crazy like that.</p><br/><p>However, by the time she got within range, Fire Fountain was already almost done using his Bandage. On top of that, he had the time to glug down one health recovery potion and regenerate an additional 3,000 HP.</p><br/><p>Han Ying Xue did not realize that Fire Fountain had already dispelled her {Putrefying Poison}. So, she stood at one spot and started casting {Punishment Ray} like a stationary turret.</p><br/><p>Fire Fountain was much more experienced in player versus player combat than Han Ying Xue was, with a wave of his hand, a blast of fire instantly struck Han Ying Xue, causing 1,450 damage to her. After that, he immediately stepped backwards and tried to keep his distance from Han Ying Xue.</p><br/><p>{Fire Blast}: Uses fire to launch a blast to the target and causes Fire damage equivalent to 100% of magic damage. Cast time: Instant. Cool down time: 8 seconds. Distance: 30 meters.</p><br/><p>Han Ying Xue’s casting bar for {Punishment Ray} was interrupted as he stepped out of her range</p><br/><p>Han Ying Xue did not bother chasing after him and immediately starting casting healing spells to heal her own HP.</p><br/><p>Fire Fountain quickly ran into the 30 meter attack range and started casting {Explosive Flame}!</p><br/><p>If Han Ying Xue was more aware of the mechanics of the game, she would just need to take a step backwards to interrupt his casting, as they were both exactly 30 meters apart! Instead, she went on healing herself. When she saw Fire Fountain entering her {Punishment Ray}’s attack range, she started casting just that.</p><br/><p>Fire Fountain was already done casting {Explosive Flame} and fired a huge fireball. He immediately stepped backwards after that.</p><br/><p>‘-3,963!’</p><br/><p>A huge bubble of damage text popped up over Han Ying Xue’s head while her {Punishment Ray} casting bar was interrupted again. She quickly started casting her healing spells, {Mending Prayers}, {Holy Shield} and {Brilliant Light}.</p><br/><p>Fire Fountain took a step forwards, used {Counter Magic} followed by {Fireball}!</p><br/><p>{Counter Magic}: Immediately interrupts target’s casting bar and renders target unable to cast related skills for the next 3 seconds. Cast time: Instant. Cool down time: 30 seconds. Distance: 30 meters.</p><br/><p>Han Ying Xue’s casting bar for {Brilliant Light} was interrupted. At the same time, all her spells in the Holy tree started cooling down for 3 seconds. Thus, the only spell she had left was {Putrefying Poison} as it was under Dark Abyss tree.</p><br/><p>Now only did Han Ying Xue realize that Fire Fountain had already dispelled her {Putrefying Poison} long ago. Since she could not cast any other spells other than {Putrefying Poison}, she went ahead and used it, out of a lack of choices rather than a calculated maneuver.</p><br/><p>Two seconds later, Fire Fountain cast {Fireball} and hit Han Ying Xue.</p><br/><p>‘Damage absorb!’</p><br/><p>‘+3,602!’</p><br/><p>{Holy Shield} absorbed {Fireball}’s damage while {Mending Prayers} regenerated Han Ying Xue’s HP to full!</p><br/><p>Fire Fountain was astounded, his powerful and long cool down skill {Heart of Flame} was used, {Counter Magic} and {Ice Barrier} which were vital skills have also been used were currently cooling down, yet Han Ying Xue’s HP was full! On his end, he had 7,000HP left, and the DoT was already taking effect!</p><br/><p>A dignified professional player was actually being forced against the ropes by a healer who had no clue about player combat!</p><br/>\n</div>"}