{"title": "Chapter 237: Spectre War Zone", "id": 237, "volume": 3, "url": "http://boxnovel.org/mmorpg-rebirth-of-the-legendary-guardian-chapter-237-spectre-war-zone", "volume_title": "Volume 3", "body": "<h1>Chapter 237: Spectre War Zone</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 237: Spectre War Zone</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Since the entry period was only for as long as the first three days of every month, players who had read the introduction of the war zone have been waiting patiently for the opening of the war zone. Even though the area was large and divided into different levels of areas, it was still a situation where 10 men would need to share a toilet! There are more than 50,000,000 players alone in China! To make matters worse, the introduction had clearly stated that the Spectre War Zone’s monster would only respawn once a month, meaning that latecomers would be left with an empty plain of dust and grass!</p><br/><p>That was the reason why dozens of players stayed up waiting for the clock to strike midnight! The early bird gets the worms!</p><br/><p>By the time Zhang Yang logged into the game, Han Ying Xue and the other had already entered the war zone. When Wei Yan Er noticed, she quickly contacted him and yelled, \"Hey sleepy head! Lazy bum! Why did you wake up so late, noob tank!\"</p><br/><p>F*ck! This lazy-*ss is the one who’s always late! D*mn! She was up a little early just to catch the opening time of the Spectre War Zone! Zhang Yang laughed sarcastically and replied her. \"So, what did you guys get?\"</p><br/><p>\"My god! There are so many people here!\" Wei Yan Er sighed. \"I thought I knew the meaning of a crowd when I visited a mall during the Black Friday sales. But d*amn! There are so many people here KSing mosnters here, there, and everywhere! Now I know what it really means when people say that there’s no room for even an apple to fall!\"</p><br/><p>\"Woah! We got ourselves a smart *ss!\" Zhang Yang immediately replied.</p><br/><p>\"Stupid! Dummy! Noob tank! Call me stupid, one more time, and I’ll take my cousin sister away from you!\"</p><br/><p>\"Sure! It doesn’t matter since our little Yan Er is a rare flower! A genius philosopher! A rare gem! The flower among flowers!\"</p><br/><p>\"Hehe!\" Wei Yan Er rubbed her nose. \"Since when did I become yours? Please…However, I’ll overlook that statement since you have pretty good eyes, being able to notice all my points! HEY! Han Ying Xue! Why are you always sneaking around when I’m not paying attention!\"</p><br/><p>*Beep*</p><br/><p>The little brat let out a scream that was quickly cut short as she hung up the voice messenger.</p><br/><p>Zhang Yang laughed at the amazing little girl. She would never get boring. Zhang Yang rode Whitey all the way to the Teleportation point and paid the 30 gold coins entry fee, and entered the Spectre War Zone.</p><br/><p>Of all the players in all eight servers, China included, Zhang Yang was the only person in the entire map of Level 60. When he entered the map, all he saw was a gray sky filled with dark clouds. The sun was fully blotted out behind the grayish dark puffs of clouds. Ahead of him, there were massive flatlands, filled with spectral monsters lurking around aimlessly. Each of them were separated by at least 30 meters apart.</p><br/><p>[Fallen Warrior] (Elite, Spectre)</p><br/><p>Level: 62</p><br/><p>HP: 20,000</p><br/><p>Defense: 60</p><br/><p>The background story of this Spectre War Zone was that the Union had recognized the Spectres as an alarming threat. Thus, they had dispatched adventurers and assigned them to their designated war zones to eliminate the vengeful spirits that had turned into spectres.</p><br/><p>Even though the monsters here had the elite title upon their heads, their HP was only a little bit higher than usual normal tiered monsters. They were not hard to defeat; even a normal player (players with weaker equipment than Zhang Yang) could slay a monster by themselves with ease. The only difference between them and Zhang Yang was that Zhang Yang could go on and on while the normal players would might have to sit down to recover their HP after killing only one elite monster.</p><br/><p>Zhang Yang summoned [Gold-Eared Bear King] and sat on it. He bent down a little and pats the side of its head. \"Buddy, it’s us against time itself here. Let’s see how much we can haul in three hours!\"</p><br/><p>\"Growl!\"</p><br/><p>Zhang Yang commanded the bear and both of them rushed down the flatlands, and into the roaming monsters. Since the monster here were rather scattered, Zhang Yang could not rely on his kiting technique. Instead, he had to resort to killing them one at a time. However, with his current damage, coupled with the damage from his pet mount, they could easily kill the 20,000 HP monster in just seven to eight seconds, while only losing a fraction of their own HP.</p><br/><p>As Zhang Yang killed his way deeper into the war zone, he came up to a small hill side and saw a fully-clad armored warrior riding a skeletal horse down the other side of the hill. Behind the horseman were a few skeleton soldiers in groups of 10 and more. They were kneeling on one leg with flags stabbed into the ground by their sides. Although the flags seem ragged and old, these few spectres were looking up at the flag with great respect. They were completely still, as if they were statues made from cement!</p><br/><p>Even after turning into spectres, these soldiers could perhaps retain a sense of pride and duty from their days of living…</p><br/><p>[Resurrected Knight] (Boss, Spectre)</p><br/><p>Level: 65</p><br/><p>HP: 300,000</p><br/><p>Defense: 350</p><br/><p>The bosses in the Spectre War Zone did not have any tiers. They would only drop the respective level of essence based on their own levels. Zhang Yang sighed. He had been feeling down since he didn’t stand to gain much, only materials for that Snow Bitch’s runecrafting. He gently patted the white bear and commanded it to charge into the monsters.</p><br/><p>\"Aack ack…..\" The spectres noticed Zhang Yang arrival and got up to their feet. With the flag pole behind them, the soldiers grabbed the hilts of their swords with their skeletal hands and tugged out the rusted swords that were once shiny.</p><br/><p>‘-0!’</p><br/><p>‘-0!’</p><br/><p>The attacks were so weak that all of them could not even penetrate Zhang Yang’s defense. Ignoring them, Zhang Yang went straight to the boss.</p><br/><p>‘-612!’</p><br/><p>The boss pulled out a long spear and thrusted it towards Zhang Yang. The damage done to Zhang Yang was only below 1,000, which means its basic attacking power was at around 3,000! It was set that way to favor the majority of normal players. The boss had been set in such a way that even a small group of Green-Copper equipment base player could defeat it.</p><br/><p>After all, the purpose of the Spectre War Zone was to grant a lucrative way for essences to enter the market, not to test player’s equipment.</p><br/><p>No one can stop him now!</p><br/><p>In this zone, Zhang Yang was more of a boss than a player. After sharing his HP with the pet mount via , their combined HP had reached 41,000! Their attacking power had reached 4000+ DPS! With their current strength, they defeated the boss in only 70 seconds! That, by everyone else’s standards, was insanely powerful!</p><br/><p>After three hours in the zone, Zhang Yang exited the instance with a broad smile on his face.</p><br/><p>\"Noob tank! Cousin sister said this and I quote, pass all the loots to her obediently or she will get over there to search your body thoroughly.\"</p><br/><p>Just as Zhang Yang left the zone, Wei Yan Er merry voice rang.</p><br/><p>D*mn! I have yet to even touch these stuffs myself and here they are, about to be snatched away…</p><br/><p>\"Noob tank! Don’t feel bad about yourself. Pervy Fatty, Starlight brat, and uncle Hundred Shots have already been robbed cleaned by my cousin sister!\" said Wei Yan Er.</p><br/><p>Zhang Yang facepalmed. \"Where is that woman?\"</p><br/><p>\"At the Rune Crafting instructor!\"</p><br/><p>Without wasting anymore time, Zhang Yang rode the bear towards the Rune Craft Shop, only to see Han Ying Xue crafting Rune Stones endlessly. Naturally, everyone had gathered up a large haul. Because of that, Han Ying Xue was able to take everyone’s loot from the Spectre War Zone to craft Rune Stones.</p><br/><p>\"Ahah! Great timing dummy! All the materials were just about to finish!\" said Han Ying Xue as she looked up at Zhang Yang.</p><br/><p>\"I’d say, have you made any progress with Rune Crafting at all?\"</p><br/><p>\"Before, I had only made +1 Rune Stones. With all these materials now, I can make +2 Rune Stones! Come on hurry up! Give me all the loots that you have gathered! I’m almost reaching Level 3!\" said Han Ying Xue as she gestured with her hand impatiently.</p><br/><p>Before the introduction to Spectre War Zone, Han Ying Xue had only the support from Zhang Yang’s Little Merchandize Shop. Technically, Han Ying Xue was the first player in China to push her mastery level to Level 2! But, to achieve Level 3 mastery, one would require many [Level 2 Gray-Silver Essence]. No matter how grandiose Zhang Yang was, he could not provide that much equipment for her to dissemble. After all, the most popular equipment in demand was the Gray-Silver tier. Who would want to sell those equipment for disassembling?</p><br/><p>However, the tables has turned. With the Spectre War Zone, and the collaboration of an entire guild, Han Ying Xue had somehow managed to push herself to reach Level 3 in Rune Crafting! That was why normal players could never be proper Rune Crafters, it would drive them bankrupt before anything else!</p><br/><p>Without giving a second thought, Zhang Yang transferred all his essence to Han Ying Xue.</p><br/><p>\"Dummy…did you rob a hundred people to get these? How did you get so much?!\" cried Han Ying Xue in shock and surprise. Like her, Wei Yan Er, Fatty Han, and the rest of the group had only managed to farm on average, 10 [Level 2 Gray-Silver Essence], and one [Level 2 Yellow-Gold Essence].</p><br/><p>Zhang Yang had just transferred a total of 92 [Level 2 Gray-Silver Essence], and 43 [Level 2 Yellow-Gold Essence]! Having that many [Gray-Silver Essence] was still conceivable, but the amount of [Yellow-Gold Essence] he carried was just unbelievable! It was an impossible feat!</p><br/><p>Zhang Yang scoffed. \"Answer me, woman! Where are the Rune Stones that you promised? How much longer are you going to delay!?\"</p><br/><p>Perhaps others did not fully understand, but Zhang Yang knew that every 10 points of Luck would increase his chances in several aspects of the game by 1%! Since he had 9 Luck points, he had, technically, increased the drop rate of [Gray-Silver Essence] to 2% and [Yellow-Gold Essence] to 1%!</p><br/><p>0.1% to 1% was an increment of a multiple of ten! Plus, Zhang Yang was completely alone in the Level 60 Spectre War Zone. Since he had only focused on killing bosses, how could he not gather that many [Yellow-Gold Essence]?</p><br/><p>Han Ying Xue smiled happily, her grin spread from ear to ear. She nonchalantly transferred a few Rune Stones to Zhang Yang and said, \"With this, I will easily become a Level 3 Rune Crafter! It’s a shame though. Rune Craft recipes above Level 3 are not sold by the instructors! Looks like I will have to farm them myself!\"</p><br/><p>Zhang Yang took out the Rune Stones that Han Ying Xue had just handed over and observed their properties. There were only two Rune Stone, one was for a weapon, and the other was for a shield.</p><br/><p>[Rune Stone: Vampiric] (Useable, Tier 2)</p><br/><p>Use: Inscribes a rune on a weapon. Grants the weapon a +2 Vampiric effect. Grants a chance to restore 100 HP on every successful attack. Effect will only proc once every 10 seconds. Inscribing a rune has a 50% success rate. Failure will result in a drop on the effect Tier by 1 level.</p><br/><p>[Rune Stone: Shield Spike] (Useable, Tier 2)</p><br/><p>Use: Inscribes a rune on a shield. Grants the shield with a +2 Shield Spike effect. Grants the ability to inflict 100 Shadow damage on a target after receiving an attack from the same target. Inscribing a rune has a 50% success rate. Failure will result in a drop on the effect Tier by 1 level.</p><br/><p>The inscription a Rune starts from +1 to +2 and so on. However, since high Tier Rune Stone could replace the usage of lower Tier Rune Stones, super rich players could buy +10 Rune Stone to jump all the way from +1 to +10. Normal players would start inscribing from Tier 1 Rune Stone +1, to Tier 2 Rune Stone +2. This was the best and most economical way. However, Han Ying Xue’s Rune Stones were all in Tier 2! It completely went against her miserly nature!</p><br/><p>\"Do I look like a miser?\" said Han Ying Xue as she winked at Zhang Yang. \"Using higher tier Rune Stone could easily increase the success rates!\"</p><br/><p>Wei Yan Er walked behind Zhang Yang and whispered. \"Actually, she had already thrown away many Tier 1 Rune Stones because they had taken up too much space in her inventory.</p><br/><p>\"You little minx!\" bellowed Han Ying Xue angrily.</p><br/>\n</div>"}