{"title": "Chapter 230: The Princess and the Impostor", "id": 230, "volume": 3, "url": "http://boxnovel.org/mmorpg-rebirth-of-the-legendary-guardian-chapter-230-the-princess-and-the-impostor", "volume_title": "Volume 3", "body": "<h1>Chapter 230: The Princess and the Impostor</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 230: The Princess and the Impostor</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>\"Little Yang, you really know how to act it out!\" Fatty Han laughed out loudly.</p><br/><p>Zhang Yang was beside himself in nervous excitement, smiling himself silly. With a wave of his hand, he led the gang into the sacred chamber, facing the undead imposter of Princess Serena.</p><br/><p>[Serena, Princess of the White Jade Kingdom] (Holy, Humanoid creature)</p><br/><p>Level: ???</p><br/><p>HP: ???</p><br/><p>Defense: ???</p><br/><p>Phew! The gang took a deep breath in, a Holy grade boss, what is this madness? The highest grade of bosses in {{God’s Miracle}} is the Celestial grade, the grade right below the Celestial grade is the Ascended grade, and the grade right below the Ascended grade is the Holy grade!</p><br/><p>Following the Holy Grade in descending order were the Ethereal grade, Mythical grade, and Violet-Platinum grade before reaching the Yellow-Gold grade! This was not just a difference of one or two levels, it was actually a tens-of-thousands-kilometers-long kind of difference!</p><br/><p>The boss could probably wipe out their entire party without lifting a finger!</p><br/><p>So how do they kill it?</p><br/><p>\"Who goes there? Who dares to trespass into my sacred chamber?\" Serena was sitting high on her throne, one hand holding on her sweet cheek, staring at them scornfully with her Phoenix eyes, \"Guards! Guards ---\"</p><br/><p>Zhang Yang stepped out, laughing boldly, as his gang lined up behind him. He said, \"Undead scum, your play is over! Just show yourself already!\"</p><br/><p>With a slight change in her facial expression, Serena stood up abruptly from her throne, emitting such an oppressive aura that the gang had to take a few steps back. This was a special attribute; a 'pressurizing oppression' that only high graded bosses would possess.</p><br/><p>\"Puny creatures, you can actually see my true form?\"</p><br/><p>\"An Tu Lama Ke Ni Da...\" Zhang Yang began chanting the incantation that had been taught to him by Serena.</p><br/><p>Boom!</p><br/><p>An invisible shock wave gushed emanated from \"Serena’s\" chest. Gong gong gong! Like pieces of tiles on that were giving way as they tried to contain an explosion from within, several pieces of….stuff, shot out of her body, clouding the air with dust!</p><br/><p>\"What, no --- what is this!\" Serena’s composure had broken for once, \"I already sealed you, how can you be awake! No, go back in! Go back!\"</p><br/><p>The gang stared, bedazzled, as seven colors of lights protruded out of her body, forming a shape of a human, which slowly detached itself from the main body. A head, a neck, two hands, a waist, two legs! Instantly, a shadowy figure that looked exactly like Serena floated between Serena and party in mid-air.</p><br/><p>At that moment, the name that had labeled Princess Serena’s head begun to change.</p><br/><p>[Witch Spectre Angelina] (Yellow-Gold leader, Undead)</p><br/><p>Level: 68</p><br/><p>HP: 20,000,000</p><br/><p>Defense: 1200</p><br/><p>The shadow figure that looked exactly the same as Serena had a name right above her head, ‘Shadow of Serena’s Soul’. She pointed at Angelina furiously, and spoke with royal authority, \"How dare you, to actually imprison my soul! The prestige of royalty will not be desecrated by you!\"</p><br/><p>[Shadow of Serena’s Soul] (Holy leader, Summon)</p><br/><p>Level: ???</p><br/><p>HP: ???</p><br/><p>Defense: ???</p><br/><p>Obviously, the impostor had been classified as Holy, because she had Serena’s Soul in her. The moment the soul was separated form her, Witch Spectre Angelina had been forced back into her original form!</p><br/><p>\"Hmph!\" Witch Spectre Angelina remained confident. A greenish flame began to flash within both of her eyes, as she softly spoke, \"My dear princess, please do not forget that your body is still sealed, even if you managed to resist my control at the moment, how long can you last? One minute…? 10 minutes?!\"</p><br/><p>\"Long enough to slay you!\" Shadow of Serena’s Soul turned to Zhang Yang and said, \"My brave warriors, aid me in slaying this evil undead!\"</p><br/><p>Zhang Yang immediately wielded his Dragon Tooth Battle Axe and raised it up, bellowing, \"Comrades, let’s go!\"</p><br/><p>As Shadow of Serena’s Soul lifted her right hand up, a huge long sword made of light congealed out of the void. She held the handle of the sword and swung towards the Witch Spectre Angelina. The sword of light tore through the air, making a series of sonic booms.</p><br/><p>‘-200,000!’</p><br/><p>The attack of the Shadow of Serena’s Soul was brutal as f*ck! One hit had already reached a damage of 200,000, it was simply horrifying!</p><br/><p>The Witch Spectre Angelina roared with rage and said, \"B*tch, I may not be able to kill you because I need your soul, but when I imprison you all over again, I shall torment your soul beyond your wildest imaginations!\"</p><br/><p>Shoof!</p><br/><p>Zhang Yang had already {Charged} into the battle and had began hacking at Witch Spectre Angelina.</p><br/><p>The boss had been set not to kill the Shadow of Serena’s Soul, therefore, her aggro meter did take Shadow of Serena’s Soul into account. With a single chop from his axe, her aggro had already switched to Zhang Yang. Producing a magical staff out of nowhere, the boss pointed the blackened end point of the staff at Zhang Yang. The skull that was on top of the staff was flashed a ghostly green, and an arrow of dark light shot out at him!</p><br/><p>‘-7021!’</p><br/><p>Zhang Yang was immediately struck with a large amount of damage which appeared on top of his head!</p><br/><p>It was fortunate for him that there were many healers on the party, one by one they started using all sorts of healing skills on Zhang Yang, swiftly healing him back to his full health. The offensive players took action, swarming the boss wildly.</p><br/><p>For a level 68 Yellow-Gold boss, without talking about the boss’s already insanely high defense and magic resistance, her level that was at least 10 levels higher than everyone around there had already penalized their damage. Initially they could have delivered an approximate damage of 6000, but now, it would be extremely good if they could achieve 2000!</p><br/><p>It was fortunate that they had a super power damager. Without much effort, Serena’s soul had already sliced off a sum of approximately 5,000,000 health points!</p><br/><p>\"Serena, you useless b*tch, I will definitely torment your soul until you no longer wish to exist!\"</p><br/><p>Witch Spectre Angelina could only receive the massive damage, unable to retaliate. She frequently screamed for the guards right outside the chamber so that they would come in to protect her and remove these so called ‘traitors’!</p><br/><p>\"Speed kill! If the guards return, we are doomed!\" Zhang Yang shouted loudly. Although they all knew the Witch Spectre Angelina was an imposter, the guards had no clue about that.</p><br/><p>They would only see their princess being assaulted, and would chop her assailants to pieces before any words could be exchanged!</p><br/><p>\"{Holy Light}, {Cross Soul Slash}!\" Shadow of Serena’s Soul suddenly let out a noble cry. Using the light sword on her hands, she drew a cross-shaped light wave and sent it towards Angelina to slice her up.</p><br/><p>‘-2,050,000!’</p><br/><p>‘-1,890,000!’</p><br/><p>\"Son of the --! This damage value, it’s just so freaking awesome!\" Fatty Han clenched his butt cheeks.</p><br/><p>Zhang Yang smiled and said, \"Only NPC in battles can inflict such ridiculously high damage. Rest assured, players will never have to face such bosses!\"</p><br/><p>Even though the Cross Soul Slash had heavily damaged the boss, the burden had proven too much for Serena’s Soul. Her shadowy form was flickering continuously, it looked like she would shatter into pieces any time soon.</p><br/><p>\"{Shroud of the Undead}!\" Angelina’s health points had almost dropped lower than 50%. She opened her mouth wider than a human’s biology would permit, and spat out a thick black mist towards her front, covering a conical area in front of her. As the black mist spread through the place, everyone was inflicted with varying amounts of damage. It did not make sense at first, but by observing the health points of the players, it was possible to know that the black mist caused all players to lose 1% of their respective health points.</p><br/><p>At the same time, the health of the boss was also increasing gradually, 1% at a time!</p><br/><p>10 seconds later, the black mist had finally vanished, and the health of the Witch Spectre Angelina had recovered from 51% back to 61%! Fortunately, the boss was still affected {Destructive Smash}. If it wasn’t for that, she would have almost recovered her health back to full!</p><br/><p>\"{Holy Light}, {Cross Soul Slash}!\" Shadow of Serena’s Soul was attacking zealously, repeatedly using her powerful skills!</p><br/><p>‘-2,040,000!’</p><br/><p>‘-2,160,000!’</p><br/><p>With every activation of the Cross Soul Slash, the Shadow of Serena’s Soul would grow more faded -- it was unclear exactly how long more she could hold on!</p><br/><p>\"Speed kill! Speed kill!\" Zhang Yang had kept an eye on the situation beyond the wall of the chamber all along, realizing that there was already a large number of guards hurrying over. They were responding to the blasted Spectre’s distress calls!</p><br/><p>\"Muahaha!\", the Witch Spectre Angelina gave out a bone-chilling laughter, \"Such poor souls, I am an undead, protected by the army of the kingdom, while you --- you valiant fools will be executed one by one for trying to save your kingdom! Oh, the irony! No worries, after all of you are dead, I shall resurrect all of your corpses and make you all my most loyal subordinates, to serve the great Undead God!\"</p><br/><p>\"Undead, if going all out would take off 20 years of my lifespan, I will still do it to eliminate you!\" Shadow of Serena’s Soul spoke in her noble, ethereal voice. With both hands, she raised her sword up above her head.</p><br/><p>\"This is...\" Angelina revealed an expression full of fear, as she spoke in disbelief, \"Sword of Life and Death! Impossible! Only the Ascended grade could wield such powerful techniques! You actually --- No! No!\"</p><br/><p>As she cringed back in fear, Shadow of Serena’s Soul directed her sword at the spectre, creating at least thousands of her sword’s shadows!</p><br/><p>‘-500,000!’</p><br/><p>‘-470,000!’</p><br/><p>‘-520,000!’</p><br/><p>Each shadow of the sword would take away approximately 500,000 of Angelina’s health points, leaving the boss’s health point value to decrease steeply!</p><br/><p>\"Shroud of the Undead!\" Witch Spectre Angelina shrieked frantically, spewing out another black mist. However, a mere recovery of 1% health points every second could not make up with the damages inflicted by the divine [Sword of Life and Death]!</p><br/><p>30%, 20%, 10%, 0%!</p><br/><p>It looked as if the Witch Spectre Angelina was almost instantly slayed by the Shadow of Serena’s Soul. Even before {Shroud of the Undead} could fully take effect, she had already let out a cry and collapsed, lying in her own pool of blood.</p><br/><p>\"Little Yang, I felt that we were like side characters, they didn’t even need us afterall!\" Fatty Han shrugged.</p><br/><p>\"Who said that? At least we get some awesome equipment!\" Zhang Yang smiled and pointed at the loots dropped by the boss.</p><br/><p>Boom!</p><br/><p>The Shadow of Serena’s Soul suddenly shattered into pieces and gushed into the corpse of the Witch Spectre Angelina.</p><br/><p>Zhang Yang quickly took out the Soul Vessel and followed the instructions that were taught by Serena, he began the incantation while facing towards the dead body of Angelina. A stream of seven-colour light went straight into the Soul Vessel!</p><br/><p>‘Ding! You have successfully retrieved Princess Serena’s other half of her soul, the mission will commence into the next process!’</p><br/><p>‘Ding! As the king and the soldiers have not known about the impostor, you are now a traitor of White Jade Kingdom!’</p><br/><p>‘Ding! Your position as the owner of Tukulo Fortress has been forfeited by the king himself, all related rights and skills are revoked!’</p><br/><p>‘Ding! Your reputation in the White Jade Kingdom has descended to ‘Hatred’, all NPCs will see you as an enemy! You will not be able to buy any merchandize, repair any equipment, rent any flying Griffins from any NPC!’</p><br/><p>‘Ding! Your land property in the White Jade City has been temporary confiscated!’</p><br/><p>‘Ding! You cannot log off the game before your quest is completed, or else the quest will be judged as an automatic failure!’</p><br/><p>‘Ding! You must return with the Soul Vessel to Princess Serena in the Tomb of the Shadow Ash, or else, the quest will fail! If you are killed by a player, the Soul Vessel will be dropped, any players who acquire the Soul Vessel can take it to rescue Princess Serena and win a large number of rewards! Once the other player has completed the quest, you shall be labeled as a castaway and remain banished permanently from White Jade Kingdom!\"</p><br/><p>The continuous system alerts were presented in the form of text and voice. Zhang Yang blinked in a daze, his face slowly turning white!</p><br/><p>Sun of the beach! The penalty for failing the quest can be so serious? This was indeed a god damned main quest, providing a large number of rewards, but the penalty could practically frighten players to death! Losing his City Order was fine, it’s just a minor inconvenience concerning the City Teleportation system. But Little Merchandize Shop was the root of his income!</p><br/><p>\"You treacherous thief! Prepare to die!\" The army of NPCs flocked into the chamber like a hive of bees, and the first person in front of them was the Captain of the Guards, Rhodus Ryan of the Royal Chamber of Star and Luna.</p><br/><p>The NPCs had referred to him in the singular term. As he was the one who triggered the quest, they ignored his party members. After all, this was not reality, or else every single one of the involved players will be seen together as accomplices in a plot!</p><br/><p>Being relieved of his title as the owner of the Tukulo Fortress, Zhang Yang had also lost the ability to teleport. His whole plan had been ruined! It was fortunate that he had already predicted those NPCs arriving, Zhang Yang had already passed the title of leader to Han Ying Xue, allowing her to distribute the loots.</p><br/><p>\"Witchy Snow, divide the loots as quickly as possible, and ignore the NPCs, they only want me! Time for me to go!\" Zhang Yang literally spat his words at the party and began to make his exit.</p><br/><p>\"You traitor! I’ll kill you!\" Rhodus Ryan shouted with a loud voice, waving the blade in his hands at Zhang Yang.</p><br/><p>Even if Zhang Yang was the best-equipped tank in the entire game at the moment, he wouldn’t stand a chance against a level 80 Yellow-Gold boss. Using {Charge} to create distance from the boss, he immediately activated {Shadow of the Void} and began running like crazy.</p><br/><p>His movement speed increased by 100%. 20 seconds was enough for Zhang Yang to remove himself from the sacred chamber, finding a safe corner to rest. He quickly took out the [Lease of the Gold-Eared Bear King] and summoned Whitey.</p><br/><p>Two seconds after, Whitey materialized. Zhang Yang quickly mounted it, shouting out a command, \"Whitey, let’s cross five passes, slay six generals, and ride alone for thousands of miles1!</p><br/><p>He rode on Whitey heading towards the exterior of the palace.</p><br/><p>At that instant, word of the princess’ assassination had to reached those NPCs, even though he saw their names in red. After they heard the shouting of the other guards pursuing from behind, only did they start giving chase.</p><br/><p>Of course, the game had scripted the events in such manner. If that wasn’t the case, if the main gate of the palace shuts, he will make himself an easy target. This mission would become impossible to be completed!</p><br/><p>Running about wildly all along the way, Zhang Yang did not even dare look back, he went straight out of White Jade City.</p><br/><p>For him to turn over the quest, Zhang Yang had to go through a number of maps, before he could leave Tukula Fortress and enter the Frozen Sky wasteland, then passing through the Necrotic Wastelands, and finally into the Flatlands of the Passing, find Princess Serena, turn in the quest and prove his innocence!</p><br/><p>‘Server Announcement: The princess of White Jade Caste was assassinated! The perpetrator is Player Zhan Yu! Under the command of the King, the player that kills Zhan Yu must present the killer’s head to obtain these rewards: 3 Level ups, one Yellow-Gold Weapon, and the position of the Great General of the National Army! Position: XXXXXX, YYYYYY. An announcement will be made every 10 minutes!’</p><br/><p>Pak!</p><br/><p>A piece of wanted poster appeared in the backpack of every player, with a picture of Zhang Yang’s face on it!</p><br/><p>1. Cross five passes slaying six generals, riding alone for thousands of miles : To overcome all sorts of difficulties along the way, referenced from the novel {{Romance of Three Kingdoms}}, the story of Guan Yu.</p><br/>\n</div>"}