{"title": "Chapter 245: Seizing the Territory", "id": 245, "volume": 3, "url": "http://boxnovel.org/mmorpg-rebirth-of-the-legendary-guardian-chapter-245-seizing-the-territory", "volume_title": "Volume 3", "body": "<h1>Chapter 245: Seizing the Territory</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 245: Seizing the Territory</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Zhang Yang laughed out loud and said, \"Well done, One Sword Stroke, but don’t forget that you are also carrying the same negative effect as well! Focus your firepower on One Sword Stroke and take him out!\"</p><br/><p>Both of their {Destructive Smash} had the same effect, the threat was just too deadly!</p><br/><p>Instantly, both sides focused fire on Zhang Yang and One Sword Stroke, healers from both sides beginning a race of their own as they expended their mana in healing their leading tanks!</p><br/><p>Face to face, axe against axe, shield against shield, titan against titan!</p><br/><p>Arrows flew across the sky, spells tore through the air, the scene was marvelous!</p><br/><p>Although both Zhang Yang and One Sword Stroke were super tanks, further embolstered by Battle Mounts to boost their maximum health points, they were losing health quickly! {Destructive Smash} simply removed the potency of the healers, making it extremely difficult to retain their HP. But in terms of equipment, Zhang Yang had a full set of Yellow-Gold equipment. His shield was slightly out of place, being a level 50 equipment, but it was also another Yellow-Gold equipment! His mount was also a Yellow-Gold! What does One Sword Stroke have to answer to that?!</p><br/><p>When Zhang Yang’s health bar was down to 47%, while One Sword Stroke’s health bar had already gone down to 20%!</p><br/><p>The consecutive lose of health points would only mean both guardians would have infinite rage points at their disposal! The moment the health bar of One Sword Stroke fell below 20%, Zhang Yang’s icon of {Killing Cleave} lit up!</p><br/><p>Full rage, {Killing Cleave}!</p><br/><p>‘-34,600!’</p><br/><p>A horrifying numerical value appeared right on top of One Sword Stroke’s head, instantly taking all his remaining health points away from him!</p><br/><p>One Sword Stroke instantly turned into a stream of white light, the shock and disbelief clear in his eyes, as he was directly sent back to his main city!</p><br/><p>Everyone was shocked!</p><br/><p>30,000+ in one hit, was he still a freaking human?</p><br/><p>Zhang Yang could not believe it himself as well, so he quickly stole a glance at the battle record: ‘Your {Killing Cleave} is a critical hit, overlaid with {One Lucky Hit} onto One Sword Stroke, a damage of 34600 points (Reduction of 8800 points, absorption of 600 points)!’</p><br/><p>So it was the combined effect of {Killing Cleave} and {One Lucky Hit}, creating a damage that was six times higher than the initial value!</p><br/><p>Such a unlucky person, Zhang Yang sighed quietly for One Sword Stroke. He was recording the whole battle. If that clip of his recording ever made it on the official website, surely there would be an uproar among the players!</p><br/><p>\"Noob tank, what the heck did you just do?!\"</p><br/><p>\"Critical attack of {Killing Cleave} and {One Lucky Hit}!\" Zhang Yang posted the description of the skill {Killing Cleave} on the party channel.</p><br/><p>Wei Yan Er immediately widened her eyes and said, \"If a two-handed weapon did that under the same circumstances, with a critical {One Lucky Hit}, my damage would exceed 50,000, or even 60,000!\"</p><br/><p>Zhang Yang laughed loudly and said, \"For a character like yourself, who can’t even get a critical attack after a millennium, what are the odds of {One Lucky Hit} and critical attack happening at the same time for you?\"</p><br/><p>\"Wa! Noob tank, you are so mean! You too, cousin sister, you are just so mean!\"</p><br/><p>Retreat! Retreat! Retreat!</p><br/><p>Although that 30,000+ damage hit from his battle axe had bolstered the morale of his guild, but still, one guild was not enough to hold against the assaults of millions of players. He could only order his forces to continue retreating to the peak of the castle!</p><br/><p>The numbers on his side were rapidly dropping!</p><br/><p>It was still 1 hour 22 minutes 12 seconds away till the end of the great battle!</p><br/><p>Under the amazing coordination of Hundred Shots, defenders from all seven routes were able to fall back unhindered, all of them halfway through the distance. However, out of the 63,000 defenders, they were left with 25,000, and this number was still dropping as rapidly as water from a ruptured vessel!</p><br/><p>Outside the fortress walls, Humbly Gentleman grinned sinisterly and said, \"Brothers in arms, previously we were oppressed by Lone Desert Smoke until we could not even lift up our heads! We were once kings and queens among the guilds in countless online games, and no one was above us, all worshiped us, so what say you, do you accept such humiliation?\"</p><br/><p>\"No!\" thousands of the members of The Dominators were roaring!</p><br/><p>\"Do we silently accept humiliations and insults, and allow others to thread on us?\"</p><br/><p>\"No!\"</p><br/><p>\"Now, this is our best chance to get our vengeance! Kill, kill all of those b*tches in Lone Desert Smoke, and reclaim the glory that was once ours!\"</p><br/><p>\"Kill! Kill! Kill!\"</p><br/><p>\"Kill all the members of Lone Desert Smoke, and claim the [Territory Command Order]! Reclaim our Dominator’s Honor!\"</p><br/><p>\"Rawgh!\"</p><br/><p>Thousands of people were roaring in chorus, stomping their feet against the ground as they charged forwards to the Thunderstorm Castle. Despite being such a hypocrite, Humbly Gentleman knew his way around the hearts of others, being a veteran guild master with several years of experience beneath his belt!</p><br/><p>There were many other guilds with similar plans as The Dominators, and they had carried out their late assaults at different times! The Dominators knew it was time to move. If they were any later, there wouldn’t be anything left for them!</p><br/><p>One big wave after another, Lone Desert Smoke had lost many of their players! The enemy still outnumbered them greatly, a large crowd still waiting outside the castle walls</p><br/><p>Retreat! Retreat again!</p><br/><p>40 minutes remained, and the defenders had fallen back so far along the seven routes that one fifth of them were already in the hall where Fatty Han was located!</p><br/><p>\"Zhan Yu, we’re totally out of reserve players!\" Hundred Shots frantically cried out.</p><br/><p>Zhang Yang nodded his head and said, \"All defenders, fall back to the hall! We’ll use the doorway as our last bottleneck!\"</p><br/><p>\"Alright!\"</p><br/><p>Hundred Shots began to coordinate the troops, and the defenders totally turned around and marched to the hall. All this while they had been engaged in combat as they slowly backpedaled at the same time, intending to reserve their strength as much as possible!</p><br/><p>The Dominators had waited for some time after the latecomers had made their way in. But they were surprised to find that the castle was still full of people, each street were crowded with players squeezing against each other. It had become a fool’s dream to rush in unhindered, and claim the territory as their own! Unless of course, if they were willing to put aside everything and start killing all the players who were in their way!</p><br/><p>But if they really did that, they would be provoking millions of players, signing their death warrants!</p><br/><p>The initially determined face of Humbly Gentleman instantly fell! What is this madness! How could there be so many people here? How are they going to snatch the Territory Command Order now? There was only 30 minutes left until the battle ends, and even if they were all given three hours more, they might not even get a bloody path in front of them to even reach the location of the Territory Command Order, let alone fight for it!</p><br/><p>Technically, those who had charged ahead first at least had a higher chance of obtaining the Territory Command Order than these cunning ones who have grossly underestimated the scale of the crowd. What did people like Humbly Gentleman stand to gain in the end? They were not getting any free meals any time soon!</p><br/><p>\"Boss, now... What should we do?\" the members of The Dominators slowly turned to their leader.</p><br/><p>\"What else is there to do? Let’s charge forward with our might!\" Humbly Gentleman was slouching in disappointment!</p><br/><p>If they had actually met their enemies in combat, losing would not be very demoralizing, knowing that they tried their best! But now, to lose before the battle had even begun for them, nobody would be pleased about it. They stared at Humbly Gentleman, unable to hide their discontent!</p><br/><p>At this point, his members were beginning to question his leadership!</p><br/><p>Retreat! Retreat! Retreat!</p><br/><p>When Zhang Yang and the others had retreated up to the highest location of the castle, the cathedral, only 1,634 members remained!</p><br/><p>\"Into the church! Everyone, into the church!\" Zhang Yang commanded in a loud voice.</p><br/><p>Fortunately the church was pretty large, capable of taking in more than 2,000 people!</p><br/><p>\"Kill!\" the players from all other guilds were surrounding the church while shouting in loud voices.</p><br/><p>Zhang Yang laughed loudly, as he and Endless Starlight blocked the narrow doorway, forming an extremely sturdy meatshield!</p><br/><p>The entrance of the church was a doorway that led to a hallway of the same size that was about 15 meters long, with a width of not more than 4 meters. In the middle of the path, there is a horizontal wall. That part of the path was slightly more spacious than the other parts, and players were required to to go around from both sides, like air going around a moving windscreen. Beyond that would be the vast openness of the church. Zhang Yang and the other tanks held their ground at the end of the entrance, leaving only the narrow path for the enemies, forming a perfect defensive formation. Anyone who rushes over will have to withstand the attack from the spellcasters and the strafing shots of the hunters behind the tanks, leading to even more casualties!</p><br/><p>Because it was an indoor environment, Zhang Yang was unable to ride on his mount, his maximum health points had been steeply reduced to only 26060. However, the limited space also hindered the enemy, and they were only able to come in small numbers at a time!</p><br/><p>Relying on the special terrain of the path, although the numbers of players on the side of the Lone Desert Smoke were outnumbered beyond a thousand to one, they were able to hold their ground. With hundreds of them using spell attacks with splash effects, it was a total death sentence for those who charged in, and there was no room at all to bargain with the results!</p><br/><p>\"Stop! Stop! Stop!\" many leaders of their own guilds immediately tried to prevent further casualties, as charging in blindly would only mean using their numbers to fill up a bottomless pit. Even if they continued charging in for the next 3 hours, they would never make further progress!</p><br/><p>A change of tactics was required!</p><br/><p>\"All thieves sneak in, use your {Stealth}!\"</p><br/><p>But... Zhang Yang had already predicted that it would come to this, so as instructed, the Hunters kept bombarding the entrance with {Barrage}! It consumed a fair bit of arrows, but they had already been promised a fine sum of allowance at the end of the battle.</p><br/><p>The {Stealth} of the thieves were completely wasted as they were immediately exposed and killed in turn!</p><br/><p>\"All knights, charge in and use your {Sacred Protection}, we must open up a path!\"</p><br/><p>The opposition immediately switched to a new tactic.</p><br/><p>It was only 21 minutes left until the battle ends!</p><br/><p>After some redeployment, hundreds of knights walked right out of the crowd, Guardians, Templar and Sacred Knight, all sorts of classes were present.</p><br/><p>\"Charge!\"</p><br/><p>The knights went around the ‘wind shield’ and immediately, they activated their {Sacred Protection}, charging right into the human shield that was formed by ZHang Yang and his gang.</p><br/><p>Immune!</p><br/><p>Immune!</p><br/><p>Immune!</p><br/><p>Carrying {Sacred Protection} on them, the knights were glittering in gold complexion, like the statues of immortal gods, ignoring all damage, all negative effects, directly colliding with the human shield created by Zhang Yang and the others!</p><br/><p>It was a huge impact, an unstoppable force meeting an immovable object!</p><br/><p>When players clashed into each other, the tendency of being knocked back would be determined by the strength attributes of both sides.</p><br/><p>Gong! Gong! Gong!</p><br/><p>That moment both sides collided into each other, men and horses were immediately thrown off their feet, the perfect defense circle was suddenly left with a few gaps!</p><br/><p>The players of the opposition were like ants that tasted blood, and they poured through the gaps! The defensive formation was slowly torn apart!</p><br/><p>It was only 14 minutes until the battle ended!</p><br/><p>\"Kill that fat f*ck! He’s got the Command order!\" the players were shouting endlessly.</p><br/><p>The remaining time was running out, and everyone turned their sights onto Fatty Han.</p><br/><p>\"Tighten up the defense, block the entrance, don’t let anyone else enter!\" Zhang Yang shouted loudly, \"Fatty, pass me the Territory Command Order!\"</p><br/><p>Fatty Han uttered a reply, as he squeezed his way over to Zhang Yang, passing the order.</p><br/><p>‘Server Announcement: Player Zhan Yu has acquired the Territory Command Order!’</p><br/><p>\"Kill Zhan Yu!\"</p><br/><p>The players were like a hive of bees, switching their targets to Zhang Yang.</p><br/><p>The chaotic battle had begun!</p><br/><p>The players who managed to squeeze in were from a variety of guilds from the eight main cities, some of them possibly allies, but most of the players were definitely fighting for themselves. The Lone Desert Smoke elites kept their calm, casting AoE skills at calculated areas. In return, those players furiously fired back with their own AoEs, inflicting most Lone Desert Smoke casualties, but inadvertently hitting even more of their own!</p><br/><p>\"Sun of the beach! Why did you hit me?\"</p><br/><p>\"For f*ck’s sake, you were hitting me as well, weren’t you?\"</p><br/><p>In the massive field of AoE bombardments, the attackers were suffering greater losses than the defenders!</p><br/><p>But there was a large number of players on the outside that would constantly replenish the attackers within the hall. On the other hand the numbers on Zhang Yang’s side were slowly but surely dwindling down!</p><br/><p>Seven minutes!</p><br/><p>Following the reduction in the numbers of the players in the church, Zhang Yang found himself quickly surrounded by the enemy. He was still afflicted with {Destruction Smash}, making it difficult for him to recover! His health bar was beginning to flash red at the danger line!</p><br/><p>{Blessing Protection}!</p><br/><p>Endless Starlight waved his hand, throwing a spell onto Zhang Yang, instantly slowing the process down. But now Endless Starlight was taking heavy damage!</p><br/><p>This was the Defender’s version of ‘Sacrifice’, it was not a 100% damage transference, only taking on 50% of their target’s inflicted damage, but it had a longer duration of 10 seconds!</p><br/><p>The other guardians and defenders were inspired by his action, taking their own respective turns to activate their {Sacrifice} and {Blessing Protection} on Zhang Yang, It gave Zhang Yang the strength to stand firm, towering like a mountain peak!</p><br/><p>However, their sacrifice was paid heavily for, as more and more tanks on Zhang Yang’s side fell!</p><br/><p>Three minutes to go, Lone Desert Smoke was left with only 329 members!</p><br/><p>Two minutes left!</p><br/><p>The Lone Desert Smoke was left with only 29 members remaining!</p><br/><p>\"Haha, the time is just right. The territory is mine now!\"</p><br/><p>\"You should just f*ck off for f*ck’s sake!\"</p><br/><p>\"You should be the one f*cking off!\"</p><br/><p>One minute left!</p><br/><p>{Shadow of the Void} activated!</p><br/><p>With a shoof, Zhang Yang ran right out of the big church, using his 20 seconds of boosted movement speed to get away from his attackers!</p><br/><p>40 seconds left!</p><br/><p>{Rearm}, {Shadow of the Void} activated again!</p><br/><p>Another 20 seconds passed, Zhang Yang had managed to find himself a quiet and peaceful corner, and he began to summon his [Gold-Eared Bear King]!</p><br/><p>\"There! Over there!\" the moment Zhang Yang revealed himself, that large green pendant immediately hovered over his head!</p><br/><p>Leaping atop his mount, Zhang Yang’s health bar was instantly boosted up to 40,000 points!</p><br/><p>All players were gushing towards him like a fierce tidal wave of tsunami!</p><br/><p>{Shield Wall}!</p><br/><p>{Shadow of Merlinda}!</p><br/><p>{Block}!</p><br/><p>{Berserker’s Heal}!</p><br/><p>Zhang Yang practically threw every emergency skill he had at disposal!</p><br/><p>18, 17, 16... 10!</p><br/><p>The health bar of Zhang Yang was nearly depleted!</p><br/><p>Shoof! Just as he was about to drop dead, he miraculously disappeared once again!</p><br/><p>The players frantically looked about, and saw the green pendent beaming into the sky far in the distance, pointing out the new location of Zhang Yang!</p><br/><p>That was --- the teleportation of the [Lover's Charm: Yang]!</p><br/><p>Zhang Yang had given the [Lover’s Charm: Ying] to Sun Xin Yu earlier on, asking her to enter stealth mode and hide somewhere safe, only activating it at the last moment!</p><br/><p>\"Quickly! That side!\"</p><br/><p>The tidal wave changed directions and headed for the new location of Zhang Yang!</p><br/><p>9, 8, 7... 3, 2, 1!</p><br/><p>It was too late!</p><br/><p>‘Server Announcement: The Battle for the Territory Command Order has ended, the final possessor of the Territory Command Order is --- Player Zhan Yu! The Thunderstorm Castle now classifies as the territory of this player, everyone will be sent back to your own main cities!’</p><br/><p>\"No---\"</p><br/><p>All the players were voicing out in protest, but as the white lights flashed, everyone was forcefully sent back to their respective main cities by the system.</p><br/><p>Looking at his residual health points of 48 points only, Zhang Yang let out a long breath, laying down on the furry body of Whitey.</p><br/>\n</div>"}