{"title": "Chapter 263: Childhood Idols", "id": 263, "volume": 3, "url": "http://boxnovel.org/mmorpg-rebirth-of-the-legendary-guardian-chapter-263-childhood-idols", "volume_title": "Volume 3", "body": "<h1>Chapter 263: Childhood Idols</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 263: Childhood Idols</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Right after ‘Musician’ Beeshoven was slaughtered, the white, opaque barrier right behind him also collapsed, and a vast square was presented right before their eyes.</p><br/><p>There was a total of four entrances, but the other three entrances were still blocked by barriers. So, Zhang Yang and the gang could not enter the territories of the other parties to snatch-kill their bosses.</p><br/><p>Right in the middle of the square stood a beautiful woman with an extremely graceful, slim body, a waist that begged for men to grab hold of, and a shapely butt, with a pair of breasts that had extremely pronounced tips, with a full head of blonde hair that came together with sex appeal that gushed out all around her. She was literally a standard ‘femme fatale1‘, judging from her weapons. She held a a saw in her right hand, and her left arm stopped resembling human altogether at the wrist, instead ending in a long, spiraling tentacle that dangled straight down to her heel!</p><br/><p>[Warden Mariya] (Gray-Silver Leader, Undead)</p><br/><p>Level: 69</p><br/><p>HP: 8,000,000</p><br/><p>Defense: 700</p><br/><p>Cautious: Mariya was the most brutal warden in the history of Thunderbolt Prison, known for hacking the inmates into pieces with her saw, as she bathed in their blood, enjoying the pleasure of their screams.</p><br/><p>\"What the f*ck, female sadist!\" Even a prurience person like Fatty Han would only dare to show his admiration towards her from a far distance, fearing that saw that dangled dangerously from her hand, knowing that she would very well hack him to pieces with it, especially the organs that mattered the most!</p><br/><p>\"Haha, Fatty Han, I can’t believe you would turn away from such a lady!\" Zhang Yang could not hold himself from laughing.</p><br/><p>\"Hey hey, it’s true I’ll never turn anything down, hot or cold, but this, this is obviously an outer space organism!\" Fatty Han shook his head continuously.</p><br/><p>\"So how do we fight this battle?\"</p><br/><p>\"It’s going to be easier than boss number three!\" Zhang Yang nodded and said, \"The boss will summon a jailer out every once in a while. So Endless Starlight will kite the jailers who pop out, and everyone should just swarm up and kill it. As long as not more than two jailers appear at the same time, there shouldn’t be any problem!\"</p><br/><p>\"Alright! Let’s go in together, when the battle begins, the barrier behind us will reactivate, locking out anyone who’s outside till the battle is over!\"</p><br/><p>The gang walked straight in to the interior square, with Zhang Yang leading the gang, charging swiftly towards the boss.</p><br/><p>\"Ara, ara, another batch of new toys!\" Warden Meriya moaned out loud with excitement, waving the saw in her right hand while lashing out with her long tentacle, her attention on Zhang Yang.</p><br/><p>‘Ding! The Blue Team has entered the Central Square!’</p><br/><p>The moment they triggered the boss, the voice message alert tone rang in the ears of all 40 players in the four parties.</p><br/><p>The other three parties all lost focus at the same instance. Those who were still playing on the ‘Dancing Machine’ messed up their rhythms, immediately triggering the explosion of the boss which wiped out the entire party!</p><br/><p>\"They’ve beaten us to it again!\"</p><br/><p>\"Sigh, the First Clear of the dungeon is going away again!\"</p><br/><p>Everyone was groaning and sighing.</p><br/><p>The guildmasters of the other three guilds all said, \"Boss number three is already so difficult to kill, the final boss must be even harder! Even Lone Desert Smoke had been annihilated a couple of times at the third boss, so there is no way they can clear the last boss in just one attempt! Also, there is only one attempt for the final boss, once the party fails to kill the boss, the boss will disappear! So, even if we cannot see the final boss, Zhan Yu and his gang may not be able to get the First Clear title as well!\"</p><br/><p>\"Do it nice and easy now, let’s familiarize ourselves with boss number three. When the dungeon is refreshed, we’ll be the first to reach the final boss!\"</p><br/><p>...</p><br/><p>Zhang Yang had a solid grip of the boss’ aggro, while the gang unleashed their full power, swiftly reducing the health points of the boss with their assault.</p><br/><p>30 seconds later.</p><br/><p>\"Guards! Guards! Quickly, help me destroy these disobedient toys!\" Warden Meriya started shouting for help!</p><br/><p>‘Ding! Warden Meriya has summoned Jailer!’</p><br/><p>Pak! Pak!</p><br/><p>Two large skeletal hands broke out from the ground, followed by a large Skeleton soldier breaking out from the ground, holding a large mace in its hands.</p><br/><p>[Jailer of Thunderbolt Prison] (Elite, Summon)</p><br/><p>Level: 65</p><br/><p>HP: 500,000</p><br/><p>Defense: 350</p><br/><p>The moment this Skeleton Solider appeared, a stream of dark light radiated from beneath its legs, and the gang was instantly inflicted with the damage of ‘-1,000’, the numerical values flashing right above their heads.</p><br/><p>‘Ding! You have been affected by the effect of the {Death Corruption Aura}’, experiencing 1000 dark shadow damage once every 2 seconds!’</p><br/><p>Endless Starlight immediately stepped forward and engaged, activating {Provoke} to grab the monster’s attention, swiftly kiting the monster away.</p><br/><p>The gang ran after him and swarmed around the Jailer, dealing a massive, humiliating beatdown.</p><br/><p>\"Guys, why do you think that the weapon of the Jailer is a mace?\" Fatty Han suddenly smiled with his wretched face.</p><br/><p>Endless Starlight was indeed his best buddy, instantly his face turned pale and answered, \"Is it because ‘the petals of the chrysanthemum tore through everything as he tugged it out2’?\"</p><br/><p>\"What the f*ck, you two wretched beings, stop talking about assh*les and enemas and whatever random sh*t whenever you open your mouths, in front of so many pretty ladies! You guys are just too much!\" Lost Dream spoke up furiously.</p><br/><p>\"It’s not just two, it’s three wretched men!\" other than Sun Xin Yu, the ladies were denouncing the men in unison!</p><br/><p>\"Oh yea, sister, what ‘chrysanthemum’ are they talking about, to have petals that can tear through stuff?\" Wei Yan Er turned her head around, with her face filled with the desire to seek for knowledge.</p><br/><p>Under the extreme fire power form the gang, the Jailer was left in a heap of useless bones after merely 30 seconds, returning back to the ground where it came from.</p><br/><p>Every minute, the boss would summon a Jailer once. If the combined fire power of the party is not powerful enough, the players would definitely be spending most of their time dealing with those Jailers, draining their energy and potions, eventually wearing themselves out! That was the intended design of the boss, and it would have definitely been a lot of trouble for the regular player! However, with the equipment of this party, all the players had to do were to attack the boss, then the monster, and then the boss again, and then the monster again. It was a matter of time before the boss fell.</p><br/><p>About ten minutes later, Warden Mariya agonizingly screamed and collapsed onto the ground, dropping a large pile of loot!</p><br/><p>The gang was at ease. None of them were out of breath. This boss was much easier than the previous one. Since victory was already a certainty, there was nothing to be excited about.</p><br/><p>\"Witchy Snow, are you sure you don’t want to consider changing the advertising phrase of your company?\" As he was staring at the key-in window after the First Clear achievement, the face of Zhang Yang began to twitch again.</p><br/><p>\"No!\" Han Ying Xue shook her head with determination.</p><br/><p>\"Little girl?\" Zhang Yang turned his sight toward Wei Yan Er.</p><br/><p>\"No! Not one bit!\" Wei Yan Er was also shaking her head without any pause.</p><br/><p>Zhang Yang sighed with resignation, who told him to sign a contract with Silky Soft Holdings in the first place?!</p><br/><p>‘Server Announcement: Silky Soft Bra, giving you the most personal care! Lone Desert Smoke has succeeded in acquiring the Thunderbolt Prison (Hardcore Mode)First Clear Title, their great deeds will be published on the list of the Hardcore Mode First Clear title (China Region). Please cheer for them!’</p><br/><p>\"Hahaha!\" the heartless laddies were beginning to laugh out loudly.</p><br/><p>After the distribution of the equipment, they tore off their respective teleportation scrolls and returned to Thunderstorm Castle, and then went through the portal to White Jade Castle. It might have cost them a bit of gold, but... time is gold!</p><br/><p>After securing the First Clear title of the dungeon on hand, Zhang Yang had lost his interest in the Thunderbolt Prison. After the dungeon got refreshed, he would only let Endless Starlight lead the party, giving the opportunity for his fellow members of the guild to upgrade their equipment and prepare themselves Soaring Swords.</p><br/><p>Time truly flew, and it was already the first day of December, the Soaring Swords competition! The atmosphere was thick in excitement, with the players rearing for action!</p><br/><p>Since 12 o'clock last night, the convention had stopped accepting applicants, and after a night of statistical analysis, each party was given a number of their own. White Jade Castle had a total of more than 240,000 parties enrolled in the competition. Each party needed to beat 16 other parties consecutively in order to secure themselves one of the four qualifying places in the event.</p><br/><p>For convenience sake, the competition was held during night time. In the first round, some lucky parties proceeded straight into the next round without any engagement as their opponents did not show up. The first six rounds will be adopting the single knockout system that base on single outcome, while the seventh round would adopt the ‘Two out of three wins Elimination system’.</p><br/><p>Everyone was leveling up on their own in the day, and when the clock struck seven at night, everyone hurried back to the main city, waiting for the competition to begin!</p><br/><p>As the competition had rules, only players who were in the main city could teleport straight to the Simulated Arena to take part in the competition.</p><br/><p>Players get to enter any simulated arena to spectate the competition. However, there were way too many matches in the first round, it would be impossible to follow all of them!</p><br/><p>Zhang Yang’s small party of five men had waited until seven forty before they could hear the system notification that came to them, ‘Ding! Lone Desert Smoke First Party, your match will begin in 5 minutes time, now you and your party members shall be teleported into the arena!’</p><br/><p>Shoof! A blur passed over their visions for a moment, in the next second, they already found themselves in the vast arena where the competition was held. However, there was an invisible air wall right in front of them, and they could only see that, about a hundred meters from the opposite side from them, their opposing party of five members had spawned at that spot at the same time. There was a blue flag that stood out of the back of every single member in Zhang Yang’s party, while the members of the opposition party were equipped with red flags. As these flags were actually just projections of light, they would not affect the movement of the players, nor would they block attacks.</p><br/><p>‘Ding! Lone Desert Smoke First Party VS Childhood Idols party is about to begin in 5 minutes, please make ready!’</p><br/><p>Although they could not go through the invisible air wall, that did not interrupt them from observing their opponents. It would be useless even if players try to hide their personal information, as the basic information of each member of the party of five were visible in the opponent’s information page.</p><br/><p>Madoka Ozawa, Male Beastman, Berserker, Level 52, HP 5,220.</p><br/><p>Rei Saijo, Male Elf, Sniper, Level 54, HP 5,310.</p><br/><p>Anri Okita, Male Elf, Bandit, Level 53, HP 5,610.</p><br/><p>Sora Aoi, Male Dwarf, Holy Knight, Level 52, HP 5,280.</p><br/><p>Kaede Matsushima, Male Human, Cryomancer, Level 53, HP 5,150.</p><br/><p>\"Why do they name themselves after names of women when they are all in fact males? And those Japanese names too?\" Wei Yan Er blinked her large eyes, turned to Zhang Yang with a confused look.</p><br/><p>Zhang Yang replied in a hush, \"Take a good look at those names…and the name of their party? Childhood Idols, it’s obvious that these names represent the women that enriched their lives with meaning!\"</p><br/><p>\"Oh!\" Wei Yan Er had caught only a hazy, misguided notion.</p><br/><p>\"These players are only equipped with Copper-Green equipment. Little girl, you go on ahead alone and handle them!\" Zhang Yang told Wei Yan Er.</p><br/><p>\"Yes! Yes!\" the little girl immediately felt excited, pulling out her axe with a murderous glint in her eyes. \"Unfortunately, this location does not allow us to summon or use [Pet Mounts], otherwise, if me and my Little Petal worked as one, we can kill them all within 10 seconds!\" she twitched her mouth.</p><br/><p>4 minutes... 2 minutes... 50 seconds...</p><br/><p>10, 9, 8... 3, 2, 1!</p><br/><p>‘Ding! Let the match begin!’</p><br/><p>Wei Yan Er let out a shrill warcry, and she charged out into the arena carrying her axe without hesitation, like a little dangerous fuzzball of a Berserker.</p><br/><p>When the opposition saw that the party of Zhang Yang had only sent out one player to engage in battle, they were furious!</p><br/><p>\"Sh*t! To look down on people to this point, this is just too much!\"</p><br/><p>\"So Lone Desert Smoke acts so arrogantly?\"</p><br/><p>\"Haha! Arrogance is good, we can take the opportunity to take them down one by one! Brothers, we can become famous after one match by taking down the core party of the Lone Desert Smoke!\"</p><br/><p>\"That’s right, kill them and show no mercy!\"</p><br/><p>Wei Yan Er snorted and said, \"Cut the crap, just come at me already!\"</p><br/><p>{Concussion Shot}!</p><br/><p>Rei Saijo immediately shot a Status Effect Skill, reducing the movement speed of Wei Yan Er. Afterwards, he began his assault together with Kaede Matsushima, while Madoka Ozawa and Anri Okita charged in.</p><br/><p>{Charge}!</p><br/><p>{Charge}!</p><br/><p>Both Madoka Ozawa and Wei Yan Er used {Charge}, clashing into each other.</p><br/><p>‘-803!’</p><br/><p>‘-1,402!’</p><br/><p>‘-2,103!’</p><br/><p>Rei Saijo and Kaede Matsushima had collided into her! The attack of the hunter was still manageable as the 200 defense of Wei Yan Er was not there for nothing. However, she had no way to protect herself from the assault of the Cryomancer, therefore, she could only forcefully take in all the inflicted damage!</p><br/><p>But there is still a silver lining over the cloud when a warrior class character like Drizzler takes damage. The rage gauge of Wei Yan Er had been filled up to 100 points in just an instant!</p><br/><p>In one second, Wei Yan Er and Madoka Ozawa recovered from their stuns and turned around at the same time, while Anri Okita had weaved through, ready to stab her in the back!</p><br/><p>{Tornado Cleave}!</p><br/><p>‘-7,684!’</p><br/><p>‘-7,329!’</p><br/><p>Wei Yan Er swung her axe like swinging a board, Madoka Ozawa was instantly killed, while Anri Okita was smacked out of his stealth state before he could even do anything!</p><br/><p>\"Holy... what is this damage, this can’t be real!\"</p><br/><p>\"Quickly, scatter, this little girl hits like a piledriver!\"</p><br/><p>Wei Yan Er pursued Kaede Matsushima. As spellcasters basically had to act as stationary turrets to cast their spells, all she had to do was to force her opponent to flee while swinging her axe away. Kaede Matsushima only offered his back to her freely!</p><br/><p>If they were more competent players, all Kaede Matsushima had to do was to kite Wei Yan Er that little girl around while Rei Saijo could in turn, attack Wei Yan Er’s back to his heart’s content. Unfortunately, they were all but competent. They were just a bunch of casual players who probably drew inspiration from their childhood idols every single day. These ‘Childhood Idols’ were obviously casual players!</p><br/><p>Kaede Matsushima suddenly stood still and began to cast his spells while facing Wei Yan Er. He had decided to go out with a bang, dealing as much damage as he can on Wei Yan Er!</p><br/><p>‘-812!’</p><br/><p>‘-1397!’</p><br/><p>‘-1402!’</p><br/><p>Wei Yan Er took another volley of spells, but unfortunately, this little girl was currently equipped with a full set of Level 60 Yellow-Gold equipment. Her current health points had reached 16,800, and she had not yet even lost half of her hitpoints!</p><br/><p>{Ice Ring}!</p><br/><p>Kaede Matsushima was not an idiot either, immediately he froze Wei yan Er to the ground, and started to gain further distance.</p><br/><p>[Ice Ring]: Freeze all targets within the radius of 10 meters from the caster, targets in frozen state cannot move, the effect lasts for 8 seconds. However, the durability of the frost will be reduced if the target is attacked, shortening the duration of the Freeze. Cool down: 30 seconds.</p><br/><p>{Warrior's Will}!</p><br/><p>With her front leg frozen, she kicked at it with her other leg instinctively, breaking the ice. This ingrained reaction was probably developed after multiple engagements against Sun Xin Yu and Daffodil Daydream!</p><br/><p>‘-14,400!’ {Destructive Smash}, critical attack!</p><br/><p>Kaede Matsushima was also instantly killed!</p><br/><p>Rei Saijo and Sora Aoi were both left with their mouths opened wide, that was just too much to bear! 14,000+ damage was an overkill of an overkill!</p><br/><p>Wei Yan Er turned around and continued to pursue Rei Sajio.</p><br/><p>Rei Sajio was so terrified that he turned around and started to run!</p><br/><p>Although the attacks of Hunter did not require any casting progress, the player was required to stand still like a turret, similar to spellcasters. After attacking, they would be locked briefly in an animation before they could run again, thus, he would only be able to attack two or three times before Wei Yan Er catches up to him! Therefore, he did not even dare to attack before his speed-reduction skill was cooled down!</p><br/><p>Under the current circumstances, they had given up defeating Zhang Yang’s party, their current goal was to at least take out Wei Yan Er and make things look slightly better for themselves.</p><br/><p>However, even though the arena is vast, it did not mean that there was no end to it. After running for awhile, Rei Saijo turned in front to realize that he was running into a wall!</p><br/><p>He quickly turned around, but the pursuant could easily intercept his new path. The little girl was gaining ground every passing moment!</p><br/><p>And finally, his {Concussion Shot} had finally cooled down completely! Immediately, he stopped and turned around, giving Wei Yan Er a {Concussion Shot}!</p><br/><p>4 seconds of movement reduction.</p><br/><p>Rei Saijo backpedaled while shooting at Wei Yan Er, and the health point of this little girl began drop from 11,000 to 7,000 over time!</p><br/><p>{Charge}!</p><br/><p>The cool down for Wei Yan Er’s {Charge} was also completed. Instantly, she clashed head on onto her opponent, and with a swing of her axe, she activated {Tornado Cleave} and inflicted a damage of ‘-7646’ on her opponent, another instant-kill!</p><br/><p>Sora Aoi saw that the little girl grinning sadistically with her axe in her hands as she came for him. He quickly raised up both of his hands and said, \"I, I quit! I admit defeat!\"</p><br/><p>With a flash of his shadow, he was teleported out of the arena.</p><br/><p>1. Femme fatale: a seductive woman who lures men into dangerous or compromising situations</p><br/><p>2. Chrysanthemum remnant, injuries everywhere: A lyrics in Jay Chow song ‘Ju Hua Tai’. Author implied chrysanthemum as the anus, so it literally meant the scattered petals of an anus after being brutally injured by a chrysanthemum.</p><br/>\n</div>"}