{"title": "Chapter 267: Progressing into Shanghai", "id": 267, "volume": 3, "url": "http://boxnovel.org/mmorpg-rebirth-of-the-legendary-guardian-chapter-267-progressing-into-shanghai", "volume_title": "Volume 3", "body": "<h1>Chapter 267: Progressing into Shanghai</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 267: Progressing into Shanghai</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Upon activating {Vanguard's Aggression}, the tankers started to receive double damage. Thus, under the concentrated fire of the enemy, both Zhang Yang and Traveling Piglet activated their own {Shield Walls} concurrently, and they began slashing at each other like crazy.</p><br/><p>At this moment, the difference between the strength of the tankers were their equipment. Even the with their {Shield Walls} activated, the health points of Traveling Piglet were falling much quicker than Zhang Yang’s.</p><br/><p>Afterall, Lone Desert Smoke had the upper hand in both defense and offense. Even the [Gold-Eared Bear King] alone could have made things difficult for The Dominators!</p><br/><p>After 3 seconds, Zhang Yang’s {Destructive Smash} had finally cooled down. Immediately, he threw another {Destructive Smash} onto Traveling Piglet, reducing 75% of the healing effects on him. He had basically taken the healer out of the battle!</p><br/><p>Traveling Piglet was only equipped with Gray-Sliver equipment, and had total health points of not more than 14,000. How would he be able to sustain the powerful damage output of the trio, Zhang Yang, Wei Yan Er and Daffodil Daydream? He had held his own well enough before {Destructive Smash} took away his healing support. Before the duration of his {Shield Wall} even ended, he was already dead!</p><br/><p>{Vanguard's Aggression} vanished along with his death.</p><br/><p>Not giving any chance to those opponents within the barrier to respond, Zhang Yang unleashed his {Blast Wave}, knocking the three opponents closest to him into stunned states.</p><br/><p>Focus fire on Millenial Wanderer!</p><br/><p>Pak!</p><br/><p>Millenial Wanderer was fast, immediately he had created an {Ice Barrier} and entered an invincible state, stationary state.</p><br/><p>Switching fire power onto Humbly Gentleman!</p><br/><p>Pak!</p><br/><p>Humbly Gentleman panicked and immediately entered his {Ice Barrier}.</p><br/><p>Switching fire towards I’m Not Healer!</p><br/><p>I Am No Healer quickly activated his {Sacred Protection}, entering an invincible state of 5 seconds. At the same time, he was healing up the health points of all three members of his own party, including his own.</p><br/><p>Within just a few seconds, the three members of The Dominators were forced into activating their life-saving skills.</p><br/><p>It was only a stop-gap measure, things were not looking good for them, Millenial Wanderer quickly snapped into the party chat. \"Bad Guy, stop playing hide and seek with that thief and start attacking Daffodil Daydream. We will remove our Ice Frame immediately. My {Ice Ring} is still under cool down, so the Guildmaster will freeze them first, then we can finish her off. When their spellcaster dies, the remaining battles will all be melee, we can slowly kite them until they die!\"</p><br/><p>\"F*ck you, *sshole! Call me ‘Top Class’, not ‘Bad Guy’!\" Top Class Bad Guy retorted.</p><br/><p>\"Okay, okay, okay! ‘Top Class’, go ahead and use your {Ambush} on Daffodil Daydream, now!\" Millenial Wanderer was getting impatient.</p><br/><p>1 second, 2 seconds, 3 seconds...</p><br/><p>Pak!</p><br/><p>Top Class Bad Guy burst into the visible spectrum, but it was not because he was about to use {Ambush} on Daffodil Daydream, but it was because he had been busted out by Sun Xin Yu! His body swayed with stars over his head, and the ice queen got to work with her daggers!</p><br/><p>However, I Am No Healer only cared for hmself and took no action, as his {Sacred Protection} could only last for 5 seconds. The moment it passed however, he was once again attacked by Zhan Yang and the party. He started healing himself, but was quickly interrupted as Zhang Yang used {Crash Magic} on him! He could not use his skills for another three seconds!</p><br/><p>\"Let’s go!\", Millenial Wandered grit his teeth, they would not stand a chance against them in a drawn-out battle of attrition!</p><br/><p>Millenial Wanderer and Humbly Gentleman removed their {Ice Barriers} at the same time. Humbly Gentleman immediately used his {Ice Ring} to freeze Zhang Yang, Wei Yan Er and Whitey so that I’m Not Healer would have an opportunity to escape for the moment!</p><br/><p>{Thunder Strike}!</p><br/><p>Zhang Yang stomped on the ground once, immediately reducing the movement speed of I am No Healer for 5 seconds, slowing down the slinky shadow who was trying to escape. It delayed him for an extra second, which was enough.</p><br/><p>‘-2,102!’</p><br/><p>Zhang Yang stuck his back, bringing his hitpoints below 20%. Wei Yan Er whistled and unleashed her assault. Although she had only accumulated 32 points of rage, it was enough to do it!</p><br/><p>‘-5280!’</p><br/><p>I Am No Healer immediately collapsed!</p><br/><p>{Dispel}!</p><br/><p>Han Ying Xue freed Wei Yan Er from the {Ice Ring} first. A second after, the skill had cooled down, so she freed Zhang Yang from the {Ice Ring} as well.</p><br/><p>\"Argh!\" Top Class Bad Guy let out a miserable cry as he fell to the knifework of Sun Xin Yu!</p><br/><p>Three out of five of the Dominators had been eliminated, leaving only two of them behind, struggling for their lives.</p><br/><p>Zhang Yang pursued Humbly Gentleman. As the hypocrite knew that he could not beat Zhang Yang, he snarled and began to cast his spell in anger, hoping to cause some damage before he went down. Zhang Yang laughed out loud as he hacked away. Humbly Gentleman went down like a rotten tree under the repeated hews of a woodcutter’s axe!</p><br/><p>Zhang Yang placed a foot on Humbly Gentleman’s chest and grinned. \"Hypocrites, you shouldn’t have provoked me!\"</p><br/><p>Humbly Gentleman was filled with hatred. Such humiliation! Although he was thick-faced and all that, but this, this was just too much to bear, for anyone! Who knew how many spectators were watching this match? A prideful man like him getting humiliated in such manner was just too much! This would mentally scar him for life!</p><br/><p>It was so frustrating! They had overlooked Lone Desert Smoke’s potential when they were much smaller! Now, the roles had been completely switched, Lone Desert Smoke is indisputably the strongest guild in the whole of China while The Dominators have fallen far below grace!</p><br/><p>\"Humph! You have only won one match, do not think that...\"</p><br/><p>Shoof, before Humbly Gentleman could even finish his last word, he was axed by Zhang Yang right in the face, forcibly sent out of the arena.</p><br/><p>On the other side, despite Millenial Wanderer’s skills, Sun Xin Yu, Wei Yan Er and Daffodil Daydream made quick work of him! Bear in mind that Sun Xin Yu is the future number one thief queen while Daffodil Daydream will be the top 10 spellcaster, ranks that were equal to his! Even though Wei Yan Er did not attain any fame in Zhang Yang’s previous life, she was obviously on equal caliber, with her reflexes and abilities!</p><br/><p>First round, Lone Desert Smoke First Party obtained victory!</p><br/><p>Second round competition would start immediately after 5 minutes.</p><br/><p>\"Ice queen, forget about the thief. Other than wasting your time, he’s basically useless!\" Zhang Yang decided to change the tactics for the second round, so he said, \"We shall steamroll them this time round!\"</p><br/><p>\"Good, good, good! I like it!\" Wei Yan Er raised her hands up with joy..</p><br/><p>‘Ding!, Lone Desert Smoke Vs The Dominators, the second round of the match will start in 10 seconds!\"</p><br/><p>10, 9, 8... 3, 2, 1!</p><br/><p>The invisible air walls faded. Zhang Yang and his other four party members immediately charged towards their opponents.</p><br/><p>Coincidentally, their opponents were using the same tactic as well. Top Class Bad Guy remained visible, charging alongside his partymates. Only when he was 30 meters away from Daffodil, did he enter stealth. Zhang Yang instructed Whitey to engage Traveling Piglet while he ran at Millenial Wanderer himself.</p><br/><p>Pak!</p><br/><p>Zhang Yang was ambushed by their thief, and a circle of spinning stars appeared on his head.</p><br/><p>The Best Bad Guy appeared behind Zhang Yang and started working with his blades, but even without the defense value of his shield, the damage was absolutely pathetic!</p><br/><p>Has he lost his mind? Because assassins use the fastest weapons, daggers, their low damage was the least effective thing against tanks. 90% of his efforts would be wasted on Zhang Yang’s clothing!</p><br/><p>After 1 second, Traveling Piglet recovered from his stun. He immediately activated {Vanguard's Aggression} on his own party members..</p><br/><p>--- Every time upon entering the arena, all skills will be cooled down. The same goes to the skills when players leave the arena.</p><br/><p>The Dominators instantly focused their fire power on Wei Yan Er who responded with {Charge}.</p><br/><p>Zhang Yang suddenly understood the tactic that The Dominators were using: The main focus was to control Zhang Yang and stop him from activating his {Vanguard's Aggression}. After that, using the 10 seconds of their own {Vanguard's Aggression}, The Dominators will try to take out one or two of the hardest hitting Lone Desert Smokes!</p><br/><p>It was a good idea, if Zhang Yang uses {Warrior's Will} to remove the stun inflicted by {Ambush}, then Top Class Bad Guy shall continue to stun him with {Kidney Shot}. It would keep him stunned for another 3 to 4 seconds.</p><br/><p>That time was enough to kill Wei Yan Er already!</p><br/><p>Zhang Yang smiled in his heart. These idiots had paid too much attention to him!</p><br/><p>Pak!</p><br/><p>Sun Xin Yu had slunk over and activated her {Ambush}, immediate stunning Millenial Wanderer. At the same time, her left hand flicked out, throwing a small cloud of dust that sent Humbly Gentleman into 8 seconds of confusion --- {Blind}.</p><br/><p>{Vanguard's Aggression} only reduces 90% of the damages received, it did not grant full immunity. Status Effect Skills would still take full effect. The strategy of the opponent was instantly being pushed off the cliff by Sun Xin Yu with ease.</p><br/><p>\"Sun of the beach!\"</p><br/><p>Both Humbly Gentleman and Millenial Wanderer contorted in anger. God damn it, do they waste their {Ice Barriers} to rid off the control skill or not? They would lose the best opportunity to unleash their focus fire onto their target. But if they did... Sh*t, it would be a joke to activate their life-saving skills even under the the protection of {Vanguard's Aggression}!</p><br/><p>Dilemma!</p><br/><p>Extreme dilemma!</p><br/><p>Where did this assassin come from? Such great combat instinct, striking where it hurt the most, it totally disrupted their plan! Sh*t! to think that such a skillful thief existed. Comparatively, Top Class Bad Guy was totally trash!</p><br/><p>1 second, 2 seconds, 3 seconds, 4 seconds!</p><br/><p>The duration of stun effect caused by {Ambush} had finally passed, there was no other alternative for Top Class Bad Guy, but to continue on with his plan of activating {Kidney Shot}, suppressing Zhang Yang for just a little longer!</p><br/><p>Zhang Yang had not used his {Warrior’s Will} yet, as out of three attackers in the opposition, two were manipulated by Sun Xin Yu while the remaining one was giving Zhang Yang a gentle back scratch. Furthermore, they were all under the protection of {Vanguard's Aggression}, there was no rush!</p><br/><p>Humbly Gentleman could have used {Flash Out} to remove himself of the stun state, but he will be moved out from the protection of {Vanguard's Aggression}, and he would be killed almost immediately. Millenial Wanderer was still in the confused state. If he forced his way out now and helped Top Class Bad Guy, they would still be outnumbered, three-to-two against the attackers of Lone Desert Smoke!</p><br/><p>Like her counterpart, Sun Xin Yu activated her {Ambush}, followed by a {Kidney Shot}, the classic supressive combo employed by all thieves. She intended to burn away the remaining time of the opposition’s {Vanguard's Aggression}.</p><br/><p>5 seconds, 6 seconds, ... 10 seconds!</p><br/><p>The {Vanguard's Aggression} finally vanished. Every player stunned and confused, recovered, just in time to face the music.</p><br/><p>{Blast Wave}!</p><br/><p>That instant when the {Vanguard's Aggression} vanished, Zhang Yang unleashed an attack to his front, stunning all his opponents except for Top Class Bad Guy!</p><br/><p>As the {Vanguard’s Aggression} was vanishing, the four members of The Dominators had already started spreading out, but Zhang Yang had cut them off!</p><br/><p>In that instant, Zhang Yang and Wei Yan Er began to unleash hell!</p><br/><p>{Horizontal Sweep}!</p><br/><p>{Tornado Cleave}!</p><br/><p>All four of them were inflicted with two damage values of ‘-4200’ and ‘-6400’ each!</p><br/><p>Humbly Gentleman was instant-killed! Millenial Wanderer was instant-killed! Top Class Bad Guy was instant-killed! I’m Not Healer was instant-killed!</p><br/><p>The only survivor in the arena was Traveling Piglet. The joint attack by Zhang Yang and Wei Yan Er was so sudden that the opponents were unable to activate any life-saving skills to defend themselves!</p><br/><p>Traveling Piglet let his arms fall to his sides, accepting his fate. He too, fell soon after.</p><br/><p>Lone Desert Smoke First Party had defeated The Dominators with the score of 2:0, progressing into Shang Hai’s top 32 Finals, with their heads raised high!</p><br/>\n</div>"}