{"title": "Chapter 265: ‘Fire Phoenix’ Party", "id": 265, "volume": 3, "url": "http://boxnovel.org/mmorpg-rebirth-of-the-legendary-guardian-chapter-265-%E2%80%98fire-phoenix%E2%80%99-party", "volume_title": "Volume 3", "body": "<h1>Chapter 265: ‘Fire Phoenix’ Party</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 265: ‘Fire Phoenix’ Party</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>There was no chance of breaking Zhang Yang’s record, not anymore!</p><br/><p>Wei Yan Er glared at him dejectedly, and she said, \"Noob tank, you got real lucky, engaging four melee profession players at a time, if only I --- Hmph!\"</p><br/><p>Zhang Yang shrugged and said, \"It could not be helped, luck is also a part of strength!\"</p><br/><p>\"How ostentatious!\" Han Ying Xue rolled her eyes at him. Sun Xin Yu was on fire, constantly rubbing her daggers against each other everytime they stepped into battle. However, after the sixth round, only 4,096 parties managed to proceed to the seventh round of the competition.</p><br/><p>Maybe they could still managed to send one player each for the coming rounds, but naturally, these parties were the cream of the crop, possessing greater strength than their previous encounters!</p><br/><p>As a safety precaution, Zhang Yang would have his party charge out as one starting from the next day. They cannot risk any 1 VS 5 battles anymore!</p><br/><p>Lone Desert Smoke had a total of 227 parties who entered the next round, taking up a total of 5% of the remaining parties of White Jade Castle in the competition, it was definitely astonishing! It was far better compared to the Crimson Rage who had only 132 parties remaining and the Imperial Sky who had only 96 parties remaining in the competition!</p><br/><p>\"Let’s go, we shall level up to achieve Level 70 at a faster speed!\" Zhang Yang was already currently Level 64, but to race against other players and also spend time on the competition was an uphill battle. However, Zhang Yang naturally had the uttermost confidence to secure the championship of this competition!</p><br/><p>Let’s set aside other circumstances, by just booking the dungeon where the Demonic Treant King is, Zhang Yang and the gang had already acquired a total of 12 pieces of [Aura Stones]. The Aura skills of Zhang Yang and Han Ying Xue had already reached Level 4 while the Aura skills Wei Yan Er, Hundred Shots and Fatty Han had also reached Level 3. The whole gang had grown far stronger than before!</p><br/><p>As five of them were about to tear their own [teleportation scroll] to return back to Thunderstorm Castle, when they saw Humbly Gentleman and his big gang walking by with thier annoying swagger. The hypocrite glanced at Zhang Yang, and he said, \"Zhan Yu, I heard that you guys managed to make it into round 7! Hehe, you guys better burn more incense and pray that you never engage with us tomorrow, or else, that would be the end of your streak!\"</p><br/><p>Zhang Yang laughed out loud and said, \"Hypocrite, have you taken the wrong medicine today as well?\"</p><br/><p>Humbly Gentleman snorted and put his hand over one of his men’s shoulder. \"Zhan Yu, allow me to introduce you to a person! Millenial Wanderer, profession, Cryomancer, and he is a new recruit of The Dominators and also our Ace!\"</p><br/><p>The Millenial Wanderer was a male elf spellcaster, who did not hide his personal information. He was Level 58, health points 8,320, mana points 4,120. With his hands folded across his chest, he gazed and them lazily and said, \"I heard that you guys are strong? Unfortunately, that was before you guys met me!\"</p><br/><p>Han Ying Xue and the ladies exchanged a look, trying to hold back their laughter. Wei Yan Er rubbed her forefinger against her cheek and said, \"Goodness, the mental hospital is so irresponsible this year round, how could they let a patient run wild without giving him proper medication!\"</p><br/><p>Zhang Yang smiled nonchalantly, but his heart skipped a beat. Millenial Wanderer -- he was bad news. His past life told him of that!</p><br/><p>--- Millenial Wanderer, he was indeed the core player and ace of The Dominators in the S Rank Competition! Being the seventh in the top 10 best spellcaster list, his strength must not be underestimated!</p><br/><p>In this life, Millenial Wanderer had also sided himself over to The Dominators, despite their downfall.</p><br/><p>\"You b*tch, just wait until you meet me in the arena, I shall show you just how much of a toad under the well you are!\" Millenial Wanderer slammed his fists together, a most belligerent look on his face.</p><br/><p>Wei Yan Er burst out, \"He’s driving me mad! I really wish that our first opponents will be them, I am going to cut his head off and kick it like a football!\"</p><br/><p>\"Yan Er, how can you be so violent? But, I do support you this time round!\" Han Ying Xue pinched the cheek of Wei Yan Er again.</p><br/><p>\"Humph, while you’re still at it, be pleased and enjoy the moment!\" After Humbly Gentlemant finished with his demonstration of power, he waved his hand and led his men away from the scene.</p><br/><p>\"That was a really annoying person!\" Wei Yan Er stuck out her tongue, \"Noob tank, raise their teleportation fare up 10 times more!\"</p><br/><p>Zhang Yang laughed loudly and said, \"Alright!\"</p><br/><p>One day had passed, the Soaring Swords competition had entered its third day.</p><br/><p>‘Ding! Lone Desert Smoke First Party VS ‘Fire Phoenix’ party is about to begin in 5 minutes, please make ready!’</p><br/><p>It was already 7 pm, Zhang Yang and his party members were teleported to the arena at the same instance again, and there marked the beginning of their round 7 battle!</p><br/><p>Fire Phoenix was an unconventional party formed out of five female Pyromancers! The average level of the five was Level 56, which was considerably quite high. Plus, they were pretty well-equipped, most of them glittering in gray-silver light. All of their health points were over 7,000!</p><br/><p>A vicious party of glass-cannons! Focus fire, instant-kill, simple, violent, effective!</p><br/><p>\"How do we do this?\" Wei Yan Er asked.</p><br/><p>\"We split them up into individual battles. Each of us take one. Their health points are not that much, if we can get near them, we can kill them! We must really close the gap before they start bombarding us! Five ‘Fire Balls’ flying at us all at once is no joke!\" Zhang Yang said.</p><br/><p>\"Then I shall take on Phoenix Subzero!\" Wei Yan Er said.</p><br/><p>\"I’ll take on Phoenix Foam!\" Daffodil Daydream said.</p><br/><p>\"Iced Tea!\" Sun Xin Yu was brief and straight to the point as usual.</p><br/><p>\"Then I shall take Phoenix Jasmine, while Whitey shall take Phoenix Babe!\" Zhang Yang shall cover the remaining two opponents.</p><br/><p>On the other side of the arena, the Fire Phoenix were also having a discussion.</p><br/><p>\"They will definitely start with Zhan Yu in front! You have all seen it, that lunatic has like 28,000 HP, and our first volley could theoretically do 30,000. But he’ll definitely have some passive damage-reduction skills, he won’t go down from that! Furthermore, once they close in, their melee attackers will deal serious damage!\" Phoenix Foam said.</p><br/><p>\"The damage of a tanker is limited, he won’t be a priority! The thief will definitely go into stealth mode immediately. So, we should really focus fire on Drizzler or Daffodil Daydream!\"</p><br/><p>\"Subzero, Iced Tea, Jasmine, you three focus fire on taking out the Drizzler, while Babe and I shall take on Daffodil Daydream! Try to kill them off in a one volley, and then if the thief is still in stealth mode, we shall hit the priest first. If the thief reveals herself, we shall take out the thief first! The Guardian shall be our the last target!\" Phoenix Foam assigned their objectives.</p><br/><p>\"Alright!\"</p><br/><p>Five minutes passed in the blink of an eye!</p><br/><p>The battle had begun!</p><br/><p>All five members of Zhang Yang’s party charged at the same time. As Zhang Yang was the tanker, naturally, he was at the forefront, while Wei Yan Er and Daffodil Daydream followed closely behind him. Sun Xin Yu had long vanished out of sight.</p><br/><p>The three members of the Fire Phoenix party took aim at Wei Yan Er, while two of them aimed at Daffodil Daydream. At the same instant, they activated the skill that temporary increased their damage, the {Heart of Flame}, and they began to cast their {Explosive Flame} that had the highest damage output among all their skills!</p><br/><p>{Counter Magic}!</p><br/><p>Daffodil Daydream put up her hand and waved, immediately sealing up the {Explosive Flame} that was about to be activated by Phoenix Foam. At the same instant, she activated her own {Heart of Flame}. Afterwards, she gulped down a bottle of [Beginner Power Potion] and activated her accessory, the Magician's Brooch, and began casting her own {Explosive Flame}!</p><br/><p>Just two seconds later ---</p><br/><p>‘-2,926!’</p><br/><p>‘-1,646!’</p><br/><p>‘-2911!’</p><br/><p>‘-1534!’</p><br/><p>‘-3012!’</p><br/><p>‘-1621!’</p><br/><p>Six damage values appeared right on top of Zhang Yang as the attacks struck him, taking away approximately 14,000 of his health points!</p><br/><p>The Fire Phoenix party reeled in shock! As these attacks were supposedly thrown at Wei Yan Er, how did Zhang Yang become the one who sustained all the damage?</p><br/><p>[Sacrifice]: Protects an ally, taking all damage done to the ally instead. Cool down time: 1 minute. Distance: 30 meters</p><br/><p>‘-4,592!’</p><br/><p>‘-1,541!’</p><br/><p>Phoenix Babe managed to inflict some damages on Daffodil Daydream, taking away 6,000+ of her health points. However, Daffodil Daydream bombarded Phoenix Foam with only one {Explosive Flame} that inflicted a damage value of ‘-9360!’, instantly killing her opponent on spot!</p><br/><p>‘-3120!’</p><br/><p>Daffodil Daydream answered with a {Fire Blast}, taking away a third of her other opponent’s health points!</p><br/><p>Zhang Yang was grinning as he entered the range of {Charge}. Immediately, he charged head on at Phoenix Jasmine. At the same time, Whitey activated {Wild Charge} and clashed onto Phoenix Babe! Shoof! Sun Xin Yu used her {Shadow Step} to draw herself to the back of Phoenix Iced Tea -- {Ambush} activated! Wei Yan Er had also used {Charge} to clash into Phoenix Subzero!</p><br/><p>{Flash Out}!</p><br/><p>The four remaining members of the Fire Phoenix party activated their {Flash Out} at the same instant: Instantly move 10 meters forward, cancels all movement restriction skills!</p><br/><p>Zhang Yang, and the other two party members immediately pursued their opponents, while Han Ying Xue was frantically healing Zhang Yang.</p><br/><p>Their distance gone, and positioning greatly disrupted the weaknesses of the spellcaster profession were revealed thoroughly. The remaining four members of the Fire Phoenix party were instantly nailed by Zhang Yang who smacked their asses with his huge axe. After just a few attempts, they were forced into despair. After lashing out for awhile, they were sent to their demises one after another.</p><br/><p>Round one, Lone Desert Smoke First Party acquired victory!</p><br/><p>The second level started immediately right after, it was the same 5-minute preparation time. Fire Phoenix party made the best use of the time to revise their tactics.</p><br/><p>\"Their guardian has {Sacrifice}, it totally messes up our plan!\" Phoenix Babe frowned.</p><br/><p>\"This time, we shall focus our assault on Drizzler, let Zhan Yu use his {Sacrifice} on Drizzler first. Then we shall immediately use our second volley on Daffodil Daydream, it should immediately kill her!\"</p><br/><p>\"But once we let them get near us, their damage outputs are just as terrifying!\"</p><br/><p>\"That’s right, they are all individual freaks of their own! The parties that we encountered in the first few rounds could only focus fire on one of us at a time. We only needed to activate a {Ice Frame} to protect ourselves, while the other four of us will just wipe them out! However, they’re spreading out to deal with us all at once!\"</p><br/><p>\"Argh, why did it have to be Zhan Yu! It could have been any other!\"</p><br/><p>\"Hehe, or Iced Tea, you go on ahead and seduce Zhan Yu, let him turn his coat around and betray his party!\"</p><br/><p>\"You b*tch, you are the one who should go and seduce him! With your two papaya sized titties, men are bound to drool!\"</p><br/><p>\"Stop messing around, think of something now!\"</p><br/><p>\"... Nothing on mind now!\"</p><br/><p>\"...Let’s just do it then!\"</p><br/><p>The match began with the end of their unproductive discussion!</p><br/><p>The five cyromancers did as they had roughly improvised, focusing fire on Wei Yan Er, trying to trick Zhang Yang into activating his {Sacrifice}, and then they turning to Daffodil Daydream immediately. Daffodil Daydream immediately went down!</p><br/><p>However, Phoenix Foam was also killed by the {Explosive Flame} coming from Daffodil Daydream, turning the battle into 4 VS 4!</p><br/><p>The prime advantage of a 5-spellcaster party was that all five of them could focus fire and take out their opponents, one at a time! As their numbers dwindled, their firepower would drastically drop, and the moment they fail to kill any of their opponents in a single hit, the healer’s role which was meant for long-term combat would start to shine!</p><br/><p>Fire Phoenix lost to Lone Desert Smoke First Party with the result of 0:2 by the end of the match.</p><br/>\n</div>"}