{"title": "Chapter 264: Unobstructed Flow", "id": 264, "volume": 3, "url": "http://boxnovel.org/mmorpg-rebirth-of-the-legendary-guardian-chapter-264-unobstructed-flow", "volume_title": "Volume 3", "body": "<h1>Chapter 264: Unobstructed Flow</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 264: Unobstructed Flow</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>‘Ding! Your party has defeated ‘Childhood Idols’, the Lone Desert Smoke First Party has proceeded to the next round! Please remain in the main city, the next match is beginning in 40 minutes!’</p><br/><p>Following the sound of the system notification, Zhang Yang and the gang were teleported out of the arena.</p><br/><p>Zhang Yang smiled lightly and said, \"The little girl spent a total of 47 seconds to secure the victory of our first round, let us compete to see who can take down the opposition party in the shortest time, shall we?\"</p><br/><p>\"Hmph!\" Wei Yan Er put her hands on her hip joints and said, \"You are so wicked, if I had known we were racing, I could have did it faster! 30 seconds, no, 20 seconds would have been enough to take them all out!\"</p><br/><p>Han Ying Xue pinched the little girl’s face and said, \"Keep puffing hot air, little prick!\"</p><br/><p>Wei Yan Er flung her head in a huff and said, \"Cousin sister, even you’re being mean! I am finally seeing through your entire being, your heart, spleen, lungs and kidneys!\"</p><br/><p>\"But we must not be too negligent, it is possible that we might encounter a strong party in the future!\" Daffodil Daydream reminded all of them.</p><br/><p>\"Yes!\"</p><br/><p>The other four of them, including Zhang Yang nodded to express their agreement. As the saying went, an army puffed up with pride is bound to lose, but with enough confidence in themselves, they may conquer the world!</p><br/><p>\"Little Yang, we are in for the next round!\" In just a short period of time, Fatty Han shouted into the guild channel.</p><br/><p>\"Guildmaster, we have also proceeded into the next round!\"</p><br/><p>\"Boss! Boss! We’re in the next round!\"</p><br/><p>The guild channel was constantly filled with the triumphantly news of many parties in the guild. Of course, some people were happy, and naturally some people were crying as there were also many parties brutally, or forcefully eliminated from the competition in the first round. However, many of them were reporting victories. At the end of the first round at 8.pm, out of a total of 2,176 parties from the Lone Desert Smoke that participated in the competition, 1,847 parties had managed to secure their spots into the next round, leaving the elimination rate down to only 15%. With such great results, it reflected the elite superiority of the guild, thanks to Zhang Yang’s strict selection of members.</p><br/><p>At 8.pm, the second round of the Soaring Swords competition closely followed right after the first round, there was a total of 131,072 parties, and the competition was divided into three different sessions.</p><br/><p>This time round, Zhang Yang and the others had to wait a little longer, only being teleported at 8:40.pm.</p><br/><p>Their opponents seemed to be pushovers again, with an average level of 53. It seemed that they had engaged with a similarly weak party in the first round, in order to proceed to this round smoothly. There was one Berserker, two Beastmasters, one Pyromancer and one Priest.</p><br/><p>So, Sun Xin Yu pulled out her daggers and jabbed a thumb in her bountiful chest, claiming this round as hers and hers alone.</p><br/><p>The five-minute preparation time passed very quickly, and Sun Xin Yu dashed forwards, disappearing into thin air as she went straight into her stealth mode.</p><br/><p>\"Wait, wait!\" The five members of the opposition party had charged forward a few steps forward as the Berserker who seemed to be their party leader immediate raised up his hand and said, \"They must have some trick up their sleeves! None of them are moving!\"</p><br/><p>\"That’s right, they are the core party of the Lone Desert Smoke!\"</p><br/><p>\"Such rotten luck, to meet these lunatics in the second round!\"</p><br/><p>\"Boss, you said they might have something up their sleeves, right?\"</p><br/><p>\"I don’t know, but the battle has already begun, and their assassin is in while the remaining four members are just standing there. They must be conspiring something!\"</p><br/><p>\"We must not act lightly. Let’s stay in position, spread out a little, and flank them. Whoever charges over first, we’ll just instant-kill that player!\"</p><br/><p>\"Right! Let them have a taste of our strength, the Five Immortals of the Peach Valley!\"</p><br/><p>\"It’s a long shot, but we might even slaughter them and get our asses elevated!\"</p><br/><p>\"Hahaha!\"</p><br/><p>The five of them started to laugh as their heads were filled with fantasies.</p><br/><p>Pak!</p><br/><p>The Pyromancer who stood at the rear of the party suddenly swayed on the spot, a circle of flying stars that indicated a stun effect appeared right on his head, followed by the shadow of Sun Xin Yu slowly revealing herself out of thin air, getting to work with her two daggers that glittered like frost and snow right behind him without a pause.</p><br/><p>‘-2,040!’</p><br/><p>‘-710!’</p><br/><p>‘-4020!’</p><br/><p>The regular attacks of the main weapon and the secondary weapon, with the addition of consecutive chain of a back attack, along with an additional 10% damage while appearing out from stealth mode -- instantly, she inflicted a total damage of up to 7,000! The Pyromancer did not stand a chance, it was a total insta-kill, with no chance of activating any emergency life-saving skills!</p><br/><p>A true assassination, to suddenly emerge out of the shadow and instantly hammer out a series of terrifying attacks!</p><br/><p>Sun Xin Yu immediately turned her focus towards the Priest and started running at him.</p><br/><p>\"What the hell! That was deadly shit!\"</p><br/><p>\"Focus fire on her, take her out!\"</p><br/><p>The two hunters had sent their pets to attack Sun Xin Yu while shooting out their to reduce her movement speed. Clearly, they lacked tacit understanding among each other, they were casting redundant skills at the same time!</p><br/><p>Her body trembled, and Sun Xin Yu became translucent --- !</p><br/><p>Missed!</p><br/><p>Missed!</p><br/><p>The two missed at the same time. As an assassin, Sun Xin Yu moved far faster than a priest. The movement speed boost could go up to 20% at most, and it was considerably fast! In a flash, she had reached her opponent who was 10 meters away!</p><br/><p>!</p><br/><p>\"Old Ox, look out! She is right behind you!\"</p><br/><p>\"Quickly! Use !\"</p><br/><p>\"Turn around, don’t give her the chance to stab you in the back!\"</p><br/><p>The other three players were busy spouting various advice! However, it was already too late!</p><br/><p>‘-1,832!’</p><br/><p>‘-692!’</p><br/><p>‘-3632!’</p><br/><p>Although there was no additional 10% damage, Sun Xin Yu was the ice queen. Her opponent only had a full body of Green-Copper equipment, with 5,000+ health points, how was it possible for that fellow to survive so many violent attacks of hers! He died instantly!</p><br/><p>? Sorry, that rare skill book was not available to any hillbilly!</p><br/><p>\"F*ck! They did not play any tricks on us, they really thought one assassin was enough to take us all out!\"</p><br/><p>\"This level of looking down on people is too much!\"</p><br/><p>\"... It seems like we are no match to them though!\"</p><br/><p>After Sun Xin Yu had torn up the priest’s *ss into ribbons, she immediately waved her hand -- .</p><br/><p>The battle had just commenced for 16 seconds!</p><br/><p>17 seconds, 19 seconds, 21 seconds!</p><br/><p>Shoof! The shadow of Sun Xin Yu reappeared once again, and a hunter dropped dead!</p><br/><p>\"Sun of the beach! Kill one of them at least!\"</p><br/><p>\"At least take some of her HP out!\"</p><br/><p>The two remaining players of the opposition party lamented .</p><br/><p>Everytime Sun Xin Yu activated , she was so lucky that every single attack ‘Missed’! After killing three players consecutively, she was actually still at full health, it simply made her opponents feel horrible!</p><br/><p>Shoof! Small cyclones formed beneath her feet, and her movement speed was instantly boosted like crazy!</p><br/><p>!</p><br/><p>Sun Xin Yu flew at the other hunter at twice her usual speed!</p><br/><p>‘-982!’</p><br/><p>‘-1632!’</p><br/><p>The two damages were inflicted on Sun Xin Yu at the same time, a combination of a regular shot and !</p><br/><p>Finally... a Reduction of health points!</p><br/><p>The hunter revealed a triumphant smile on his face! He managed to draw some Lone Desert Smoke blood!</p><br/><p>26 seconds!</p><br/><p>Sun Xin Yu continued to charge forwards, and with amazing footwork, she positioned herself behind the hunter. Immediately after that she charged at the Berserker.</p><br/><p>The hunter, dead but yet to even fall, had already been abandoned by its killer!</p><br/><p>\"Argh!\" the Berserker charged straight at Sun Xin Yu, swinging his axe wildly but unfortunately, it only struck air. Witnessing his party members getting slaughtered one after another, it had left him infuriated! The outcome of the match did not matter anymore, he only wanted to strike Sun Xin Yu in order to at least regain some dignity!</p><br/><p>Sun Xin Yu lifted a leg up casually, and the axe swung harmlessly beneath her!</p><br/><p>Normal attacks were easily telegraphed, therefore, any skilled player could easily anticipate and evade attacks as they would in real life.</p><br/><p>Sliding between the legs of her opponent, Sun Xin Yu flitted to the back of her opponent with amazing flexibility, and finished him off!</p><br/><p>32 seconds!</p><br/><p>The battle has ended!</p><br/><p>Shoof, Zhang Yang and the party were teleported out of the arena at the same time.</p><br/><p>\"Little girl, you lost your position so easily!\" Zhang Yang ridiculed her.</p><br/><p>Wei Yan Er was instantly provoked, gnashing her teeth at Zhang Yang with an audible snap.</p><br/><p>\"Born in the year of dog?\"</p><br/><p>\"No! Tiger! Rawgh!\"</p><br/><p>After the second round of the competition ended, 1,293 parties of the Lone Desert Smoke remained in the running. The chat was once again filled with a mixture of joy and sadness.</p><br/><p>9 pm, and the third round began.</p><br/><p>This time around, Zhang Yang and his party members were one of the first to be teleported into the arena. At the opposite side, the party was still vastly inferior, but their average Level had reached up to Level 54, and they glittered with a few gray-silver equipment!</p><br/><p>\"This time, let Daffodil handle this, don’t get killed!\" Zhang Yang smiled while teasing.</p><br/><p>If players are killed in the arena, they will not lose any experience points or equipment, but their equipment durability will still be reduced.</p><br/><p>At first, Wei Yan Er wanted to give it another try in order to get herself back to number one in place, but when she saw the excitement on the face of Daffodil Daydream, she felt that it was not good to steal her spotlight, so she could only give up bitterly.</p><br/><p>Five minutes later, the battle began!</p><br/><p>The moment when Daffodil Daydream activated her , pak pak pak, she had already instantly-killed one of her opponents the moment she laid her eyes on them. After a series of weaving and rolling, she killed the final opponent at the expense of having 872 health points remaining. It was understandable as she was a Spellcaster with lower defense and HP. The whole battle took one minute and 12 seconds!</p><br/><p>She had no other way, as she could only cast again and again, other spells would have required an interruptible casting time. To fight against five opponents by herself was not easy, let alone winning the match!</p><br/><p>A pyromancer truly shone in team battles, where behind their allies, they will be able to cast their hard-hitting skills at leisure and inflict series of extremely terrifying damage!</p><br/><p>In the third round of the competition, there was no doubt that the second party of the Lone Desert Smoke with Fatty Han and the others in it would proceed to the forth round.</p><br/><p>Meanwhile, a total of 902 parties from Lone Desert Smoke still made it into the next round. Compared to the 487 parties of the Crimson Rage and the 309 parties of the Imperial Sky, it was three times more than them in number! As everyone could see, Lone Desert Smoke was truly elite!</p><br/><p>Only three rounds of the competition were held today, with another three rounds the next day, and then another three rounds on the following day, with only two rounds on the forth day, while the remaining six days will only hold one round each.</p><br/><p>Although there were many inferior parties eliminated thorough the first three rounds, but 16,384 parties still remained in the competition, and the quality of the parties still varied greatly. On the second day of the competition, Zhang Yang and the gang were still able to send one representative to claim victory for them. Progress was smooth.</p><br/><p>When it was Zhang Yang’s turn to step up, he had his pet join the battle to aid him, engaging in a fortunate match-up against a kitchen-knife-kind of party that consisted of two berserkers, two thieves and one sacred knight. In the end, he had purposely allowed the thief to activate successfully, while waiting for the four damage channel players to round up on him. When the time was right, he activated his to get rid of the , and did a perfect instant-kill on all four opponents with a combo of and and !</p><br/><p>He then activated a at the last sacred knight left on the arena and killed him with a series of explosive blows. The whole battle only took 19 seconds!</p><br/>\n</div>"}