{"title": "Chapter 278: Quarterfinals", "id": 278, "volume": 3, "url": "http://boxnovel.org/mmorpg-rebirth-of-the-legendary-guardian-chapter-278-quarterfinals", "volume_title": "Volume 3", "body": "<h1>Chapter 278: Quarterfinals</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 278: Quarterfinals</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Eight o’clock sharp, the second contest started, Lone Desert Smoke versus The Glory.</p><br/><p>Lone Desert Smoke’s team won the loudest cheers. The official battle bets offered odds of 1.05 to 4.7 for Lone Desert Smoke to The Glory, respectively! However, many more fans placed bets for Lone Desert Smoke.</p><br/><p>Easy as a pie!</p><br/><p>Zhang Yang’s team did not give The Glory any chances of winning. Regardless of levels, equipment, controls and teamwork, Zhang Yang’s team reigned superior in all. Zhang Yang’s team won an overwhelming victory in two matches and successfully broke into quarterfinals, showing their well-earned, prevailing dominance!</p><br/><p>All eight qualifying teams were announced after 9.30 pm.</p><br/><p>The first few matches were: Crimson Rage versus Sunset Amber; and Radiance versus Imperial Sky.</p><br/><p>The second batch of matches were: Angel Wings versus Breaking Dawn; and Lone Desert Smoke versus Brilliant Star.</p><br/><p>On 27th December, at 7.30 pm, Crimson Rage started the event, raging against Sunset Amber. The ability and strength of both teams were almost similar. Currently, both teams had won one round each at 1-1, and were now putting extra effort in the third and most crucial match.</p><br/><p>The final round ended with both teams only left with an attacker and a healer each, an excruciatingly long, final phase of the match. The final phase lasted for more than seven minutes. Crimson Rage’s healer, Perfumed Water was a Priest who was not as efficient in single-target healing as her counterpart, Sunset Amber’s Sacred Knight. Perfumed Water ran out of MP first, and sadly, that was the end of Crimson Rage’s stint!</p><br/><p>It was a regrettable 1-2 loss.</p><br/><p>The elimination of this beautiful all-girl team had left a lot of male players heartbroken and furious at Sunset Amber!</p><br/><p>Due to the lengthy match, the following match between Radiance and Imperial Sky was affected, starting late at 8.20 pm.</p><br/><p>That match too, was a close battle, with the third match beginning at a score of 1-1. However, Radiance made unexpected mistakes, and their Spellcaster was immediately killed under the combined attacks of the enemy. The Spellcaster had mistimed his {Ice Barrier} and left himself open to the enemy!</p><br/><p>The balance broken, Imperial Sky’s team members grabbed the chance and in one stroke, defeated their opponents soundly and proceeded to the semifinals!</p><br/><p>Due to the long battles of the first two matches, the match between Angel Wings and Breaking Dawn did not happen until 9.00 pm.</p><br/><p>\"Noob tank, the Spellcaster threw the match!\" Wei Yan Er looked at the Radiance members who had walked off-stage, bickering among each other, most of them clearly berating the Spellcaster.</p><br/><p>Zhang Yang frowned and said, \"Maybe it was just a one sided contest!\"</p><br/><p>Such careless mistakes were not supposed to happen in any team who had made it to the quarterfinals, thus, the circumstances definitely looked dubious.</p><br/><p>\"Guild master Zhan Yu!\" Snow Seeker led her four team members elegantly towards them, \"It’s almost your turn! You guys are the only team left from our White Jade Castle, be sure to fight hard!\"</p><br/><p>\"Sister Snow Seeker, please do not worry. I will lead the team and our team will surely steamroll over all obstacles, we are brave and skillful in battle, we shall conquer everything… we are undefeatable like The Legend of the Swordsman!\" Wei Yan Er initiated some sort of poorly worded, ancient oath from the battles of the olden days.</p><br/><p>\"Little brat, drop those drama series and start reading some books!\" Zhang Yang reached out and waved a hand in front of Wei Yan Er’s face like he was shooing off an annoying fly. Zhang Yang replied, \"Guild master Snow Seeker, if your healer was a Sacred Knight, the outcome would have been really different!\"</p><br/><p>\"Oh, I’m sooo sorry for being a Priest!\" Perfumed Water growled, rolling her eyes.</p><br/><p>Snow Seeker smiled graciously and said, \"Being able to enter the top eight ranking is more than enough for us! We’ll leave the rest to you guys! Guild master Zhan Yu, although you guys have the most support out of all the fans, please does not underestimate Sunset Amber! They are definitely not weak. I even believe that they were holding back against us, trying to mislead the other teams!\"</p><br/><p>\"Oh?\" Zhang Yang muttered, genuinely surprised. If it was like what Snow Seeker said, then Sunset Amber’s leader definitely took a great risk, but with convincing results! All these were semifinal teams, if Zhang Yang got careless, he might even get his team eliminated!</p><br/><p>\"Hmph, it doesn’t matter, we’ll just defeat them all!\" Wei Yan Er clenched her fist as she said.</p><br/><p>Zhang Yang laughed out loud and said, \"Little brat, that’s a bold statement, I like it!\"</p><br/><p>\"Silly Yu, I’m warning you, don’t you dare have any thoughts towards Yan Er!\" Han Ying Xue moved in between the two of them.</p><br/><p>Zhang Yang let out of a sigh, simply waved his hand and said, \"Take it easy, I have no interests in flat-chested lolis!\"</p><br/><p>Han Ying Xue immediately turned flirtatious and said, \"Oh! So you do have the hots for me! Sigh, it’s not like I chose to be born gorgeous!\"</p><br/><p>\"Earth to Han Ying Xue!\" Wei Yan Er furiously shook her out of her reverie.</p><br/><p>As they spoke, the first match between Angel Wings and Breaking Dawn had started and Breaking Dawn’s team completely mopped the floor with their opponents. The next match was no different. So much for Angel Wings writing a story for underdogs.</p><br/><p>It was getting late, so the matches between Lone Desert Smoke and Brilliant Star started right away.</p><br/><p>Both teams went up to the stage one after another and entered the battle arena. As the team leader, Zhang Yang went to the middle of the stage to shake hands with Brilliant Star’s leader, Hawk Striker.</p><br/><p>\"Zhan Yu, from today onwards, we Brilliant Star will replace Lone Desert Smoke as China’s Top Guild!\" Hawk Striker hissed through his smiling teeth. Other than those words, onlookers would only see two men shaking hands in mutual respect, with no tension between the two.</p><br/><p>Zhang Yang returned the smile evenly, knowing that it was to be expected. Currently, Lone Desert Smoke was indisputably the strongest guild in China. Naturally, they would be targeted by everyone. If Zhang Yang really took every jab like this to heart, he would wear himself out in no time!</p><br/><p>\"Then you guys should try harder than this!\" Having said that, Zhang Yang headed back to his team without sparing a second glance.</p><br/><p>\"Noob tank, what did you say to him? That guy looks mad!!\" Wei Yan Er laughed.</p><br/><p>Zhang Yang put the gaming helmet on, shrugged his shoulders and said, \"Who knows?!\"</p><br/><p>The Five of them logged in the game one by one, and after a while, all of them teleported to the virtual arena and entered the final stages of preparation.</p><br/><p>Brilliant Star’s 5-man team members included:</p><br/><p>Hawk Striker, Level 62, Male Orc, Bandit, 15,780 HP.</p><br/><p>Slip and Fall, Level 61, Male Dwarf, Guardian, 19,260 HP.</p><br/><p>Chaos Thought, Level 62, Male Dwarf, Sacred Knight, 14,820 HP.</p><br/><p>Purple Carrot, Level 62, Female Elf, Phantom Assassin, 14,970 HP.</p><br/><p>The Second Red Lotus, Level 61, Male Human, Cryomancer. 14,550 HP.</p><br/><p>\"We are going to have to blitz this! Focus fire on the Guardian first, force their Thieves to emerge from stealth. Then, I will use {Vanguard's Aggression} on all of us. I’ll keep them busy with {Thunder Strike} and {Blast Wave} and use {Rearm} to start off the cycle again! We’ll defeat them within 20 seconds, okay?\" Zhang Yang looked at the four girls.</p><br/><p>\"Yeah! Violent and brutal, just the way I like it!\"</p><br/><p>‘Ding! Lone Desert Smoke versus Brilliant Star will officially begin after 10 seconds!’</p><br/><p>Bang!</p><br/><p>When the invisible wall disappeared, Zhang Yang and his team rushed towards their opponent.</p><br/><p>Both teams’ melee attackers came into contact.</p><br/><p>Zhang Yang and his four teammates, along with Whitey, started hammering the enemy Guardian down!</p><br/><p>Are they mad? Focusing their fire on a Guardian, of all things, right off the bat?!</p><br/><p>Nobody in the entire hall could figure out what Lone Desert Smoke was up to!</p><br/><p>While there was no denying the durability and toughness of Guardians, even they could not withstand an all-out onslaught from six enemies like this! Within three seconds, the Guardian’s HP was at a critical state.</p><br/><p>Even though Chaos Thought healed Slip and Fall with his greatest effort, Slip and Fall was already under a debuff that reduced 75% of his healing effect! Slip and Fall had no choice but to use {Warrior's Will} to cancel Sun Xin Yu’s {Kidney Shot} while activating {Shield Wall} and {Blast Wave}at the same time.</p><br/><p>As Wei Yan Er and Han Ying Xue were standing at both sides of Slip and Fall while Zhang Yang was directly in front of him, his {Blast Wave} could only strike a person! Out of the three, Slip and Fall decided to target Zhang Yang!</p><br/><p>Hawk Striker and Purple Carrot both emerged from stealth mode, one of them stunning Wei Yan Er with {Ambush} while the other used {Blind} on Daffodil Daydream, incapacitating her momentarily. They then focused fire on Wei Yan Er!</p><br/><p>\"Hah! Bout time you guys showed up!\" Zhang Yang laughed loudly, activating {Warrior's Will} and casting {Sacrifice} on Wei Yan Er. Almost immediately after, he took a few steps back and unleashed {Blast Wave}, stunning all three of them.</p><br/><p>Wei Yan Er also quickly shook the stun off herself using {Warrior's Will} and the team started raining blows on Hawk Striker!</p><br/><p>\"Slip and Fall, quickly activate {Vanguard's Aggression} protection barrier!\" Chaos Thought hurriedly shouted, knowing that Hawk Striker would fall in no time!</p><br/><p>\"I can’t, my {Warrior's Will}’s cool down is not completed yet, and I’m still stunned for another 3 seconds!\" Slip and Fall shouted loudly in the team.</p><br/><p>\"Let me use {Blur}!\" Hawk Striker was the leader of Brilliant Star’s team. Befitting of the role, he was calm and analytic. His shadow blurred as he entered {Blur}’s state, where Zhang Yang’s team had only a 25% chance of hitting him with physical attacks!</p><br/><p>This was a survival skill for Thieves. They could activate it while stunned, similar to the Warriors’ {Shield Wall}.</p><br/><p>Only Daffodil Daydream’s Magic attacks continued landing on him with continued damage.</p><br/><p>\"Change target to Purple Carrot!\"</p><br/><p>Purple Carrot also activated {Blur}.</p><br/><p>\"Keep attacking her!\"</p><br/><p>Currently, Slip and Fall had {Shield Wall} activated, while the other two Thieves were in {Blur} states. Their Knight and Hunter were standing too far away to assist. A 75% evasion rate would not grant them full invincibility. As long as they reduced Purple Carrot’s HP to 20% she would be as good as dead, as {Killing Cleave} was unblockable, and had a guaranteed chance of hitting!</p><br/><p>Four seconds later, {Blast Wave}’s stun effect ended, but Purple Carrot still had 10,000 hitpoints. This was thanks to the effects of {Blur} and Chaos Thought’s continuous healing.</p><br/><p>Brilliant Star quickly launched a counterattack against Zhang Yang’s team!</p><br/><p>Zhang Yang activated {Vanguard's Aggression}, protecting his entire party.</p><br/><p>The battle had seemed to be at an impasse!</p><br/><p>However, Slip and Fall’s {Shield Wall} duration ended. Zhang Yang and the gang quickly switched their target to Slip and Fall once again!</p><br/><p>Hawk Striker and Purple Carrot used {Vanish} without hesitation, and then used {Ambush} to stun some of Zhang Yang’s team, so that they could buy him some time, and immediately started lashing out like the sneaky thieves they were!</p><br/><p>\"Fall back!\"</p><br/><p>Both opposing Thieves were still under {Blur}’s state and his {Thunder Strike} would not necessarily land, forcing them out of stealth! However, the disadvantage of {Stealth} was a reduced movement speed, and as long as Zhang Yang delayed them for a few more seconds, {Blur}’s effect will be gone, and then it would time for them to attack!</p><br/><p>Back off, back off, back off!</p><br/><p>Zhang Yang mentally counted down the seconds. Suddenly, he advanced, stamping on the ground and launching a {Thunder Strike}!</p><br/><p>Pa! Pa!</p><br/><p>Two shadows were instantly struck out of the thin air--Hawk Striker and Purple Carrot!</p><br/><p>\"How..?\" Hawk Striker was shocked. Zhang Yang had accurately predicted the locations of both thieves, forcing them out of stealth with a single move!</p><br/><p>Zhang Yang flashed his teeth. He was already competent at \"catching\" Thieves in his past life, all of them professional players with four to five years of experience, these substantially less experienced thieves were child’s play to him! Besides, even after taking all of that into consideration, Sun Xin Yu was still, definitely more skilled at \"catching\" thieves than he was!</p><br/><p>Wei Yan Er stepped in, unleashing {Blast Wave} stunning the two thieves!</p><br/><p>Slip and Fall hurriedly used {Vanguard's Aggression}. As both Thieves were stunned, unable to move nor dodge blows, all their survival skills spent, they were in deep trouble!</p><br/><p>\"Attack their Guardian!\" Zhang Yang issued a new command.</p><br/><p>All of them dashed towards Slip and Fall.</p><br/><p>The {Vanguard's Aggression} barrier could not be moved after activation! Thus, Slip and Fall did not back off but dashed towards Hawk Striker and Purple Carrot. He needed to run into the protection barrier and wait for Hawk Striker and Purple Carrot’s stunning effects to end before he could launch attacks!</p><br/><p>‘{Thunder Strike}!’</p><br/><p>Zhang Yang stomped the ground, and Slip and Fall’s speed was slowed down immediately!</p><br/><p>Lone Desert Smoke proceeded to unleash all of its firepower on Slip and Fall!</p><br/><p>Slip and Fall was a tank. But tank or not, when faced with the Yellow-Gold attacks of an entire team, there was no point deluding yourself! Slip and Fall had already used his {Shield Wall} and he was also under the effects of {Destructive Smash}, so he was all on his own now.</p><br/><p>Within six to seven seconds, Slip and Fall became the first player to be eliminated!</p><br/><p>Hawk Striker and Purple Carrot quickly dashed towards Zhang Yang! As Zhang Yang also already used {Vanguard's Aggression}, they still had a chance to win!</p><br/><p>Zhang Yang only laughed and resetted all skills’ cool down by using {Rearm}, and then he launched another {Blast Wave} to stun the oncoming Hawk Striker and Purple Carrot!</p><br/><p>Hawk Striker and Purple Carrot could just cry there and then. They had been stunned three times within 30 seconds! It was oppressive! They were the dancers in the shadows, flitting through the dark, striking when least expected. But now, they had been turned into clumsy ducklings out of water, constantly being stunned again and again!</p><br/><p>Such a tragedy!</p><br/><p>With no more survival skills, and no protection, it was all over for them!</p><br/><p>1–0, Lone Desert Smoke won the first match!</p><br/>\n</div>"}