{"title": "Chapter 271: Hit a Corner", "id": 271, "volume": 3, "url": "http://boxnovel.org/mmorpg-rebirth-of-the-legendary-guardian-chapter-271-hit-a-corner", "volume_title": "Volume 3", "body": "<h1>Chapter 271: Hit a Corner</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 271: Hit a Corner</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Liu Wei was smiling with such radiance that he was literally glowing with the main character’s aura of a movie’s super handsome man! Standing not far behind him, Zhang Yang noticed immediately that there two extremely well-built middle-aged man were staring at all of them with extreme prejudice. Their silent stoic stance was practically bursting with the strength of tigers. They were Liu Wei’s bodyguards. If any of them made any sudden movements, these two punks would definitely drop them by the second!</p><br/><p>Zhang Yang smiled slightly. Fatty Han, who had known Zhang Yang his whole life picked up Zhang Yang’s sudden glint in his eyes. Zhang Yang pointed at the chair and said, \"Please sit!\"</p><br/><p>Liu Wei bowed a little and sat down elegantly. However, with a loud \"thud\" he fell onto the floor hard, with his legs practically pointed up to the sky! The gentlemanly, classy, masculine image that was created was completely destroyed!</p><br/><p>\"Hahaha!\" Fatty Han and Wei Yan Er burst in laughter.</p><br/><p>\"Master Liu!\" the two bodyguards came dashing to his rescue. One of them lifted him up to his feet, while the other stared at Zhang Yang with rage in his eyes. Both of them saw Zhang Yang legs moving the moment when Liu Wei was about to sit. Zhang Yang had deliberately nudged the chair by half and inch to purposely make Liu Wei fall down.</p><br/><p>\"I’m okay! I’m okay! I’d just slipped! That’s all!\" In his eyes, there was a split-second of rage. However, his face maintained a kind and forgiving appearance, enough to fool anyone who was not observant enough. He sat back on to the chair properly this time, with less grace.</p><br/><p>Before withdrawing, the guards threw an intense glare at Zhang Yang and stood behind Liu Wei. The two guards’ mountain-like posture was truly not something you’d want to provoke.</p><br/><p>\"So, you’re Zhan Yu!\" said Liu Wei as he fixed his sight on Zhang Yang. \"The guild master of Lone Desert Smoke! China’s number one tank! The man behind the feat of leading Lone Desert Smoke to claim all of the First Clear Achievements of all Hardcore Mode dungeons! The champion who had claimed the first Territory in the game! The hottest and most popular players in Soaring Swords competition!\"</p><br/><p>Zhang Yang laughed. \"You flatter me too much. I didn’t even know that I’m that popular!\"</p><br/><p>\"Master Liu!\" The busty chick from before, Liu Shi Shi came by and looked at Liu Wei with a concerned face. \"Are you alright?\"</p><br/><p>The nudge from Zhang Yang earlier was so subtle that only those with sharp eyes would know that it was his doing. Oblivious to that, Liu Shi Shi had sincerely thought that Liu Wei had slipped and fell all by himself.</p><br/><p>\"I’m fine. Thanks!\" Liu Wei smiled gently and pulled out another chair beside him. \"Please have a seat.\"</p><br/><p>He then turned back to Zhang Yang and asked, \"Could you tell me your true name?\"</p><br/><p>Liu Wei must have some connections to the hotel staff or the Soaring Sword Committee to be able to recognize that the four of them were from Lone Desert Smoke. Even if Zhang Yang would not reveal his name, Liu Wei could easily pull a few strings to get his personal details.</p><br/><p>Zhang Yang smiled courteously. \"My name is Zhang. Zhang Yang.\"</p><br/><p>\"Mr. Zhang!\" said Liu Wei with a tone suggesting that he was addressing an old friend. \"Would I interest you a business plan with me?\"</p><br/><p>\"Hmm?\"</p><br/><p>\"Ah! How silly of me. I had forgot to introduce my background! I am the vice-president of Ming Sheng Technology! We want to purchase and acquire a famous guild in the game ‘God’s Miracle’! You should know, currently there are more than 200,000,000 players in the game! This game is a large and extremely lucrative industry! The company wishes to infiltrate the market in ‘God’s Miracle’, and what better way than having a mutual cooperation with Lone Desert Smoke!\" said Liu Wei as he revealed his plan.</p><br/><p>Zhang Yang laughed lightly. \"So, you’re saying that Ming Sheng Tech would like to purchase us? The entire guild of Lone Desert Smoke?\"</p><br/><p>\"That’s correct!\" Liu Wei nodded. \"We currently have two options. One, the company will completely own the guild. Two, we could buy the guild as shares. However, the company must own 51% of the shares.\"</p><br/><p>\"Sorry. Not interested!\" Zhang Yang downright rejected his proposal without a second thought.</p><br/><p>\"Mr. Zhang, would you please listen to my explanation before you made any rash decision?\" Liu Wei kept his composure and only smiled.</p><br/><p>On the other hand, Liu Shi Shi was frowning and angry. \"Master Liu was approaching you with his grace and sincerity! How could you not behave in the same manner? Do you even know what kind of company is Ming Sheng Technology? Street thug.\" The last insult was said so softly that only the people around her side of the table could hear it. If they were paying any attention to her.</p><br/><p>Fatty Han was definitely paying attention. Even though he was as huge, raging pervert, he was still a man who valued a brother and willing a take a bullet for Zhang Yang. He scoffed coldly. \"Street thug? Please…what are you? Street car? Street bus? Name your price! How much does it cost me for a night with you? I’ve never been in bed with a celebrity.\"</p><br/><p>\"Y-You!\" Like a cat that had just gotten its tail stepped on, Liu Shi Shi jumped to her feet and pointed her tiny finger at Fatty Han.</p><br/><p>\"Shi Shi calm down! Can’t you see that he was making a bad joke? How could you not have a sense of humor?\" said Liu Wei calmly. However, when Liu Wei glared at Liu Shi Shi, she froze on the spot. Immediately, Liu Wei smiled and turned over to Zhang Yang. \"I understand that your current Territory is a gold mine, however, did it ever occur to you that it would only last as long as the majority of players are at Level 60. Once players start to reach Level 70, or even Level 80, the overall profit from that particular Territory will drop!\"</p><br/><p>To talk about the game development and future market, there was no one else but Zhang Yang, the man who reincarnated and possessed an inhuman level of knowledge of the game. Not even a professional gaming economist could accurately predict the outcome of the game. After a patch, they could only rely on prediction and nothing else.</p><br/><p>Zhang Yang remained stoic, unexpressive yet he was laughing mentally. \"In that case, Mr Liu, please teach me!\"</p><br/><p>Han Ying Xue chuckled when she heard Zhang Yang tried to act all humbly. She quickly rolled her eyes at Zhang Yang. That thousand-expression b*tch with a superior level seduction had even manage to one-up Liu Shi Shi, leaving her pale and frozen.</p><br/><p>During this time, Wei Yan Er took the chance to scoop up the last piece of lobster and smiled happily as if she had hit the jackpot.</p><br/><p>Liu Wei had been paying full attention to Zhang Yang and had not noticed the other two fair princesses. Once he turned his gaze to them, he felt a sudden cold shiver that flowed down his spine. Both Han Ying Xue and Wei Yan Er were world class women; the kind that was not just beautiful but had special features that made them stand out among the rest of the world class beauties.</p><br/><p>Han Ying Xue was like the Queen of Charm herself; her erotic eyes were her special feature that could easily stray a loyal man from his wife. On the other hand, Wei Yan Er had a petite little body that gave of an innocent look and could also easily charm an innocent man! Both Han Ying Xue and Wei Yan Er, a mature and and blossoming top-class rarity!</p><br/><p>It took him while before Liu Wei realized that he was staring at them. He quickly recollected his composure and reverted back to his \"Humbly Gentleman\" like stature. However, deep down, his lust and greed were burning violently, he knew that he must use all his methods to get his hands on Lone Desert Smoke and these two women!</p><br/><p>He cleared his throat and said, \"So, currently, you own one piece of land. That gives you a huge advantage in the game’s economy. However, when the second, third or subsequent lands appear, your profits will drop exponentially. So you can earn say, 100,000,000 or 200,000,000 a month, that’s great, but after two months’ time, I’d say your profit will drop to almost 10,000,000. By the time players have reached Level 100 and had moved on to the new Chaos Realm, you won’t be able to earn a single cent!’</p><br/><p>Hundred million!? Liu Shi Shi had began to breath vigorously. Her rising and falling humongous chest trembled in excitement. To think that a man could easily have a hundred million dollars worth of fortune; he could easily be a piece of cow dung, but many flowery girls would be fighting for a place in that piece of excrement. Now that she knows what Zhang Yang was capable of, her view had now changed.</p><br/><p>The latter patch of ‘God’s Miracle’ had yet to be announced. However, there are official introduction in the main official site. When players have reach Level 100, they can enter the new area called the Chaos Realm where players from all 8 servers will join together to form a real world war.</p><br/><p>Liu Wei spoke with much confidence and influence. \"Mr Zhang, you have to place your sight further into the future! Don’t let minor profits blind your eyes from the future! Right now, we can offer 1,000,000,000 dollars to purchase Lone Desert Smoke, or invest 300,000,000 dollars as investment. Of course, we will be taking the Thunderstorm Castle and the land in White Jade Castle. However, I suggest Mr Zhang Yang to take the latter offer. Lone Desert Smoke has such a fantastic and bright future ahead! Under the leadership of the Ming Sheng Group, we can definitely raise the guild to produce 3,000,000,000 or 5,000,000,000, perhaps even 10,000,000,000!\"</p><br/><p>Liu Wei looked at Zhang Yang with eyes full of anticipation, however, deep down, he was laughing maniacally. If Zhang Yang had selected the first option, Liu Wei would have to fork out 1,000,000,000. However, if Zhang Yang had chosen to go for the second option, Liu Wei would only need to pay up 300,000,000 and could eventually own Zhang Yang through the dilution of his shares! Eventually, Liu Wei could even make Zhang Yang work for him!</p><br/><p>While they were having that conversation, Liu Shi Shi has already lost it when she heard the number 300,000,000 and 1,000,000,000. Her hands and legs were trembling violently. She could have sworn that the region between her thighs was getting slightly damp.</p><br/><p>On the other hand, Fatty Han was furious at Liu Wei’s ridiculous offer. He knew that Little Yang’s Little Merchandize Shop could easily earn 500,000 gold coins a day, which was equivalent to RMB12,000,000, and in a year, Zhang Yang could easily earn 140,000,000! Just that small land alone could be worth more than 1,000,000,000! This little bugger was being too shameless!</p><br/><p>Zhang Yang maintained his stoic look. \"I may be the guild master of Lone Desert Smoke. However, I cannot make that decision alone! Furthermore, our guild is currently in contract with Silky Soft Holdings. If we do wish to cooperate with you, wouldn’t that be violating the terms of the contract?\"</p><br/><p>\"That’s just a small problem. There’s nothing that says money can’t solve a little contract penalty.\" Said Liu Wei as he gestured with his hand nonchalantly. \"I’ll personally help you take over the responsibility!\"</p><br/><p>While Liu Wei was not looking, Zhang Yang hurriedly look towards Han Ying Xue and Wei Yan Er and raised his eye brows, indicating that the man was trying to coax Zhang Yang away right under their nose!</p><br/><p>Han Ying Xue responded immediately. \"Mr Liu, don’t you think trust is the most important thing in business?\"</p><br/><p>\"Wrong! The market is like a battle field. You have to use any method you can to obtain the best results!\" said Liu Wei while raising a finger and wagging it.</p><br/><p>\"That’s great! The lawyers in my company could really use this.\" Said Han Ying Xue as she raised her phone up and showed a running recorder to Liu Wei.</p><br/><p>Liu Wei staggered. \"W-What lawyers?\"</p><br/><p>\"Oh! My apologies. I’ve forgot to introduce them to Mr Liu.\" Zhang Yang pretended to be surprised and facepalmed himself. \"This person’s IGN is Little Snow, who so happens to be Miss Han, the largest shareholder of Silky Soft Holdings!\"</p><br/><p>\"Me too! Me too!\" said the little Wei Yan Er as she struggled to stand up on her toes.</p><br/><p>\"Hm. That little girl, Drizzler, is Miss Wei, the only daughter of the current president of Silky Soft Holdings!\"</p><br/><p>Liu Wei’s face turned into the color of the sea. His expression was like he had actually tasted a spoonful of houseflies.</p><br/><p>To think that he had attempted to coax someone out of their company contract right in front of their face!</p><br/><p>To think that these two females were hiding their true selves in such manner! Liu Wei had to change his strategy. Now that he had insulted Silky Soft Holdings, he would need to get his hands on Silky Soft Holdings as well! That way Lone Desert Smoke could be in his hands!</p><br/><p>Furthermore, Silky Soft Holdings was worth around 10 billion dollars. If they could get their hand on that company, Ming Sheng Technology would expand as a multi-platform company, becoming closer to being a multinational super company!</p><br/><p>Besides, those two girls were extremely alluring!</p><br/><p>Liu Wei thoughts quickly shifted and he turned his attention to the girls. How to get them hook up to Liu Wei…</p><br/><p>Liu Wei had much confidence in his handsome face and those excellent humbly gentleman-like manners!</p><br/>\n</div>"}