{"title": "Chapter 273: Catarina the Queen of Spider", "id": 273, "volume": 3, "url": "http://boxnovel.org/mmorpg-rebirth-of-the-legendary-guardian-chapter-273-catarina-the-queen-of-spider", "volume_title": "Volume 3", "body": "<h1>Chapter 273: Catarina the Queen of Spider</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 273: Catarina the Queen of Spider</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Hundred Shots looked like a middle-aged man despite being only 30 years old or so. He was well-built, not like the refined build of a bodybuilder, but a build that had to come from genuine, tough labor, and a full-faced beard and moustache. When he spoke, they knew he most definitely originated from somewhere far north of china. As for Daffodil Daydream, she was a cheerful woman who appeared to be in her mid-twenties. She looked like the kind of woman you would meet randomly on the street. Still there is a high chance than men, and women (if they swung that way) would turn around just to have another glance at her.</p><br/><p>When everyone gathered and met with each other, they were extremely delighted. Fatty Han even took the chance to jump at Daffodil Daydream and give her a huge bear-like hug. Daffodil Daydream reacted unexpectedly. She allowed him to hug her and even pecked him on the cheek with a kiss. This, on the other hand, had embarrassed Fatty Han as it was never the reaction that he would get from a woman. The group had a little chat and went to their respective rooms after a while.</p><br/><p>Sun Xin Yu had yet to log in. Apparently, she said that she would have to work for a few more days. After that, she would take a leave for a total of 10 days. Truthfully, she could just bypass all that procedure and protocol and not turn up at work as much as she wanted, and no one would dare to object, due to her stature. Still, the woman took pride in her job, and rarely ever called for favors unless the other party broke protocol first.</p><br/><p>After a while, Zhang Yang and the two girls cleared more monsters off, finally arriving at the final boss. Compared to the final boss, the previous bosses had human faces on the full bodies of spiders. Catarina the final boss was very different. Instead of just a face, she had the upper body of a booblicious woman. It was a pity that her magnificent curves were not accompanied by a fitting human’s lower-half. Below her curvy waist was the body of a huge spider with eight long sharp legs of a spider.</p><br/><p>Right at where she was standing, there were many human remains, many of them were just bones, but some of them were fresh, with blood still oozing out of their spilled inner organs. The sight alone was very appalling, let alone the smell. The gruesome scene was enough to send brave men shivering with fear.</p><br/><p>[Catarina the Queen of Spiders] (Yellow-Gold, Beast)</p><br/><p>Level: 68</p><br/><p>HP: 5,000,000</p><br/><p>Defense: 1,200</p><br/><p>Note: The youngest daughter of the God of Spiders. Due to her insatiable hungry for flesh, she was excommunicated from the kingdom of spiders.</p><br/><p>\"Hey, silly Yu, are you sure the three of us can do this?\" asked Han Ying Xue worriedly. A Yellow-Gold boss was far superior to mere Gray-Silver bosses. It was by far, the strongest tiered boss they had ever encountered.</p><br/><p>\"If she doesn’t have a berserker mode, we could try and kill her off slowly.\" Said Zhang Yang. \"Let’s just give it a shot. I will call for more if we fail.\"</p><br/><p>\"If we do fail, you will have to compensate us with the repairing fee!\" said Wei Yan Er just when Zhang Yang took a step closer to the boss.</p><br/><p>Zhang Yang rolled his eyes and continued towards the boss. \"One of these days, I swear that I will get back at you.\"</p><br/><p>\"Tee hee~\" both the girls giggled at his joke.</p><br/><p>\"Human!? A male human!?\" Catarina turned around and faced Zhang Yang. She raised her nose and took a sniff. \"Ah ha!\" she squeaked in excitement and grinned evilly. \"What a tough man! I see that you have a strong body too! You will prove worthy enough to mate!\"</p><br/><p>After her opening speech, the boss thrust one of her long legs out at Zhang Yang’s face. He thought he heard it wrong but after thinking it through, it was a female spider’s habit to consume her partner after a successful mating. That was why, so many men from the village had gone missing! That was why there were so many human skeletons lying around! He finally understood why this boss was exiled from the Kingdom of Spiders by the God of Spiders. If she went on like this, the entire kingdom would run out of male warriors!</p><br/><p>{Block}!</p><br/><p>Zhang Yang raised his shield to block the kick. He retaliated by swinging his axe from the right side and gave her a good blow. While Zhang Yang was fighting the boss head on, Wei Yan Er was attacking furiously from behind. While attacking, Wei Yan Er noticed Catarina’s back carapace and laughed. \"Hehe, the boss’ buggy butt is almost the same as Liu Shi Shi butt! Both of them are round and big, not to mention they jiggle like soft pudding every time I hit it!\"</p><br/><p>What the actual f*ck! What is inside her brain? How could she think of something like that in this kind of situation!</p><br/><p>\"PSSS!\"</p><br/><p>Just as the little girl opened her mouth to further comment on the jiggling butt, the butt quivered. Catarina spun around swiftly and spewed out spider webs at Zhang Yang, the two sisters, and even the [Gold-Eared Bear King].</p><br/><p>‘Ding! You have been {Web Bound}! You cannot execute any action for 5 seconds!’</p><br/><p>It seemed that the boss’ control skill would indiscriminately target every single player around, including the pet, regardless of the party size!</p><br/><p>‘-5,406!’</p><br/><p>‘-5,591!’</p><br/><p>‘Ding! You have received the effect {Spider’s Venom} (1 stack). Receive 5,000 Natural damage every 3 seconds for 30 seconds!’</p><br/><p>In the time Zhang Yang was immobile, Catarina had attacked twice and managed to spit a green, vicious liquid out of her mouth, onto everyone, including the bear and inflict them with a DoT effect.</p><br/><p>If another tank with slightly weaker equipment had been in the fight, they would sure be dead by now, since {Block} could not be used in the five second \"stun\". The biggest difference between a dungeon boss and an open-world boss was the design of their skills. Dungeon bosses ranged from extremely easy, to ridiculously difficult. Since the player count did not matter in the beginning, you can try taking on open world bosses with five players. If five players were not enough, you can even bring your entire village of 10,000 players to kill the boss with numbers. A dungeon boss was designed to fight a fixed number of players. If a dungeon required 10 players, the dungeon has to be raided with a party of 10. Since the attack power, skill, and other factor were calculated precisely, there would not be a scenario where a dungeon boss is undefeatable.</p><br/><p>Five seconds passed and everyone was free to move again.</p><br/><p>\"Dispel the DoT on the little brat and yourself first! The bear and myself take second priority!\" Zhang Yang cried. He had a 20% damage reduction passive skill and 994 damage absorption, making him slightly more resistant to the DoT effect.</p><br/><p>\"Ok.\" Han Ying Xue acknowledged, doing as he told. Luckily, the DoT effect skill was not as frequent, or else the boss would have been slightly annoying to deal with.</p><br/><p>The {Web Bound} skill was used roughly every 30 seconds or so, which was enough to grate on his nerves. If a tank’s HP was any lower than 11,000, it would definitely be an auto-death. The {Spider Venom} was rather frequent, being cast at roughly every 15 seconds. Even though this skill could be easily dispelled by Han Ying Xue, it proved to be tremendously MP costly.</p><br/><p>Zhang Yang and the bear attacked as swiftly as they could. Repeatedly using [Power Potion], making sure the effect remains active, Zhang Yang had to finish the boss off as soon as possible. If the battle is dragged on for too long, Han Ying Xue would not last. It would all be over once she runs out of MP.</p><br/><p>90%, 80%, 70%...</p><br/><p>The boss HP dropped down rather rapidly. Even though her Defense value was high, she was practically naked when Zhang Yang hit her. With {Cripple Defense} Wei Yan Er was able to deal extreme damage with her slow attack interval Yellow-Gold weapon. Luckily, Han Ying Xue had {Divine Soul} with a 75% mana reduction for healing spells. Though the passive skill did not apply to {Dispel}, it was enough to help out with her healing. To make it better, the equipment she had was by far, the best in all of China!</p><br/><p>\"Obey me! Or face death!\" Catarina shrieked. Four blood-red webs flew across the field and latched onto everyone including the bear.</p><br/><p>‘-20.111!’</p><br/><p>‘-11,080!’</p><br/><p>‘-12,110!’</p><br/><p>Four strong damage values was inflicted on everyone.</p><br/><p>‘Ding! You have received the skill {Blood-Web Poison}. Losing 70% of your maximum health. Damage rating is fixed and cannot be modified with any damage reduction skill!’</p><br/><p>Zhang Yang originally had a maximum HP of 24,890, and after losing 70% of it, he was only left with 4,447 HP!</p><br/><p>Shush!</p><br/><p>The boss did not give room for any respite and immediately came for Zhang Yang.</p><br/><p>Zhang Yang immediately activate {Berserker’s Heal} and restored all his health. The boss’ overwhelming skill was percentage-based, regardless of defense and passive skills.</p><br/><p>Swiftly, Han Ying Xue responded by using {Healing Bond} to heal Wei Yan Er and herself at the same time. If the boss used the same skill again, it would surely bring the battle to a close.</p><br/><p>Luckily, the skill was only used once every time her HP dropped by 30%. This time, it showed the huge benefit of having a small party. If the party was huge, the time to dispel all of the {Spider’s Venom} would surely be insufficient. With just one {Blood-Web Poison}, 80% or even 90% of players in a large group would surely perish.</p><br/><p>Who knows, the boss might have some flesh-eating health recovery skill. If she did have it, she would be impossible to kill!</p><br/><p>60%, 50%, 40%...Eventually, the boss used {Blood-Web Poison} again. This time, Zhang Yang managed to counter it with {Berserker’s Heal}. Since the team attacking speed was not too fast, two minutes had passed and Zhang Yang’s {Berserker’s Heal} had finished its cooldown, ready to be used again.</p><br/><p>Once the boss’ HP dropped below 20%, Wei Yan Er activated {Indiscriminate} and hacked the boss for close to 60,000 damage in one devastating cleave.</p><br/><p>When the boss’ HP reached 10%, she used {Blood-Web Poison} again. Still, she failed to kill anyone and keeled over, dead.</p><br/><p>Shoom!</p><br/><p>A dark light beamed out of her corpse and reveal a twin-horned, devil like figure with bat-like wings protruding out from its back. The shadowy figure screeched, \"Curse you humans! You have ruined my plans! I will return! I will be back!\"</p><br/><p>The black light then dispersed into nothingness. Following closely after, a translucent image of Catarina stood up. She looked just the same as she did in live. However, this time, she was slightly different. The greatest and most obvious difference was that, her body was completely human. Unlike the, bloodthirsty, battle-crazed version of her, her ghost form was kind and demure. There was a calm and serene atmosphere around her now.</p><br/><p>[Catarina’s Soul] (Normal, Summoned)</p><br/><p>Level: 1</p><br/><p>HP: 0/50</p><br/><p>\"Humans. Please do not be afraid. I am the real Catarina. The one that had just fought you was possessed by a demon.\" Catarina waved her hands, trying to assuage their fears. \"Many years back, I ventured out of the Kingdom of Spiders and was unfortunately taken over by a demon. It controlled me and invoked some sort of demonic frenzy, turning me into a blood thirsty beast. Because of my sudden change of behavior, father had thrown me out of the kingdom. Eventually, a human sage who came to seal me away. However, the seal was broken recently and the demon in me was revived and wreaked havoc upon this land.\"</p><br/><p>\"Woohoo…poor soul!\" Wei Yan Er started to tear up.</p><br/><p>\"That demon had planned to use me to build an army of spiders to serve the demons! However, thanks to your bravery, you have stopped their plans. Nevertheless, he will be back again! Human, listen my plead. Head over to the Kingdom of Spiders and inform my father, the god of spiders, about everything that had happened to me. You must tell him to stop the invasion of the demons!\"</p><br/><p>‘Ding! Catarina’s Soul has a quest for you: An Urgent News. Do you accept it?’</p><br/><p>Zhang Yang, Han Ying Xue and Wei Yan Er exchanged a look and accepted the quest without a second thought.</p><br/><p>\"You have my greatest appreciation adventurers!\" Catarina voice was filled with gratitude. Her sincerity was reflected on her warm smile. After nodding in acknowledgment, her projection faded away and eventually became one with the wind.</p><br/>\n</div>"}