{"title": "Chapter 279: Rigged?", "id": 279, "volume": 3, "url": "http://boxnovel.org/mmorpg-rebirth-of-the-legendary-guardian-chapter-279-rigged", "volume_title": "Volume 3", "body": "<h1>Chapter 279: Rigged?</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 279: Rigged?</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>The second match started five minutes later!</p><br/><p>Brilliant Star’s team was still discouraged from last game’s loss. After some half-hearted, disorganized swings, they were quickly defeated.</p><br/><p>2–0, Lone Desert Smoke wins!</p><br/><p>\"Noob tank, you are Level 67 and I’m Level 64! When we get the championship, I’ll gain three levels, along with the MVP award which grants me another level, so I’ll be level 68, one level above you!!\" Wei Yan Er grinned. She loved stepping on Zhang Yang’s head.</p><br/><p>\"Silly girl, if your elementary school’s math teacher heard that, he would run headfirst into a wall!\" Zhang Yang sighed.</p><br/><p>The others at the dining table only smiled gently.</p><br/><p>Wei Yan Er bit her fingers for a while and said, \"Humph, can’t people act cute for a little?\"</p><br/><p>\"Eh, you see…\" Fatty Han pointed at a corner of restaurant, Liu Wei was sitting closely with a tall, young man, their faces so close to each other that it was inevitable for Fatty Han to suspect that they were lovers.</p><br/><p>That tall and young man was not just anyone else, but the Top tank from Zhang Yang’s previous life, One Sword Stroke!</p><br/><p>What in the world were these two guys doing together? In Zhang Yang’s previous life, they were never even mentioned in the same breath!</p><br/><p>\"What’s wrong, Brother Fatty? Something interesting about those two?\" being the blabbermouth that he was, Lost Dream immediately perked up and asked.</p><br/><p>Fatty Han was a pretty good bullshitter himself. He immediately made up a romantic man’s love story that broke secular prejudice between Liu Wei and One Sword Stroke, which caused Lost Dream’s eyebrows to wiggle like earthworms. The others started commenting about the eyebrows instead of Fatty Han’s story.</p><br/><p>Could it be that since Liu Wei failed to bribe Lone Desert Smoke, he decided switched his target to Imperial Sky?</p><br/><p>Zhang Yang was deep in thought. But, the guild Liu Wei bribed was Blue Sea. Could the timeline be altered at this point once again? But, why would One Sword Stroke even consider Liu Wei’s deal?</p><br/><p>As One Sword Stroke would be the China’s S-Class League iconic character in the future, along with all sorts of endorsements in advertisements, his annual income would exceed more than 400,000,000 dollars! Besides, he was the successor of Sky and Ocean Electronics, why would he collaborate with Liu Wei?</p><br/><p>Zhang Yang suddenly had an epiphany, and whipped out his phone to surf the net, looking up Sky and Ocean Electronics’ information. He nodded in understanding.</p><br/><p>Five years from now! Currently, Sky and Ocean Electronics was still a small medium sized company, worth less than 50,000,000 dollars. Also, because of Zhang Yang’s intervention in this life, him winning all the First Clears had really sent the other teams down a notch!</p><br/><p>In Zhang Yang’s previous life, First Clear competitions were much intense,and Imperial Sky had rose dominant out of them all! Furthermore, Imperial Sky also successfully obtained the first territory in China under One Sword Stroke’s leadership!</p><br/><p>In Zhang Yang’s previous life, One Sword Stroke was much more of a legend than he was now! Just like Zhang Yang now had, he had his equivalent of Thunderstorm Castle and Little Merchandize Shop! Even now, would he have collaborated with Liu Wei?</p><br/><p>Obviously, the answer would be no!</p><br/><p>If Zhang Yang did not exist in this timeline, Liu Wei’s first target would definitely have been Imperial Sky. However, in his previous life, One Sword Stroke had obviously said \"no\" to Liu Wei, but this time…</p><br/><p>Zhang Yang realized just then, he was the matchmaker of these two men!</p><br/><p>Liu Wei was wealthy and One Sword Stroke was strong in leadership, Zhang Yang could not imagine what kind of power these two men would produce together!</p><br/><p>Zhang Yang clenched his fist forcefully, a friend of Liu Wei’s was an enemy of his! The friend of my enemy is my enemy! He would have to make moves against Imperial Sky should they threaten his position.</p><br/><p>Liu Wei met Zhang Yang’s gaze and the handsome, charming man lifted a hand up, firing an imaginary pistol at him. *Poof* his mouth went, a sinister gleam in his eyes, like a serpent which could swallow a person in a single mouth! Zhang Yang felt a chill rising up his spine.</p><br/><p>This was the Liu Wei in Zhang Yang’s impression, the arrogant and evil person that he knew!</p><br/><p>\"F*ck, that pretty boy is so arrogant!\" Fatty Han roared, having seen the gesture as well. He had unbuttoned his top collar, ready to punch Liu Wei.</p><br/><p>\"Fatty, sit down!\" Zhang Yang said calmly, keeping his eyes locked on Liu Wei, Zhang Yang slowly raised his right hand, and then kept his another four fingers and only his middle finger remained upright!</p><br/><p>\"He he!\" it looked fun for Wei Yan Er, so she also followed Zhang Yang, and vulgarly showed her middle finger as well.</p><br/><p>\"Ha ha ha!\" the rest of the gang also followed Zhang Yang, and showed their middle fingers at Liu Wei one after another, even Sun Xin Yu.</p><br/><p>With their dining table being so full of pretty girls, several guests were actually sneaking occasional glances at Han Ying Xue and other pretty girls. The guests were stunned when they saw the pretty girls pulling off such indecent gestures! However, a few people also found it interesting, and like obedient sheep, they started throwing middle fingers in the same direction as the girls.</p><br/><p>Humans tend to have herd mentality, and more fingers raised up, as it seemed to be the cool thing to do at that moment.</p><br/><p>All of a sudden, hundreds of people in the restaurant stopped eating and drinking to show their middle fingers at Liu Wei.</p><br/><p>Liu Wei felt his gut sinking into nothingness! His handsome facial expression turned red and pale, he was so embarrassed that he wished there was a hole in the ground for him to bury himself in!</p><br/><p>Zhang Yang did not think that his random gesture would cause such an effect with the help of those pretty girls. Zhang Yang was astonished, and could not help but laugh.</p><br/><p>\"Ha ha ha\" Han Ying Xue and the rest broke out in laughter, not expecting that effect themselves.</p><br/><p>The laughter influenced the crowd and the restaurant was suddenly filled with clueless. pure laughter.</p><br/><p>Liu Wei’s face turned extremely red, and he snorted in disgust, glaring at Zhang Yang one last time before walking out from the restaurant like a wounded animal making its escape. It only fueled the crowd’s laughter even more.</p><br/><p>On the evening of the 28th of December, the first semifinal match started with Sunset Amber versus Imperial Sky!</p><br/><p>Both of these teams were definitely close in power. Sometimes, one of the team members would do a minor mistake and get caught by the opponent, and this situation was juggled between the two sides until the match ended!</p><br/><p>1–1, both teams had drawn in two matches and started the crucial third match!</p><br/><p>It was supposed to be a wonderful match, but one of Sunset Amber’s Thieves made a fatal mistake! He was supposed to use {Blind} to daze the opponent’s healer and defeat the opponent, but his {Blind} inexplicably missed the target!</p><br/><p>Everyone knew that when {Blind} was being activated, all a player had to do was to keep their eyes on their target, and it would never miss!</p><br/><p>The audiences dropped in dead silence, as voices started to boo. Accusations of match fixing flew through the air. Regardless of it being a deliberate move or a mistake, Sunset Amber regrettably lost to Imperial Sky with the score of 1–2!</p><br/><p>At 9.00 pm, another semifinal started, Lone Desert Smoke versus Breaking Dawn.</p><br/><p>Breaking Dawn was the only team who had two healers when they broke into final top 16 positions. Their healers had strong healing endurance and healing capability! Because they had two healers who could provide healings to all the team members, thus, even focus fire on a single member would prove difficult!</p><br/><p>As long as they dragged on the duration of match, their long-term heals would shine and wear the opponent down!</p><br/><p>However, nobody blitzed better than Zhang Yang and his team. Breaking Dawn had no options of defending themselves against the overwhelming offense!</p><br/><p>Zhang Yang’s {Destructive Smash} removed 75% of healing effects, turning both of them into half a healer! Even without that, the combined attacks of Sun Xin Yu, Wei Yan Er, Daffodil Daydream, and Whitey would already overwhelm the healing rate of even 2 healers. Breaking Dawn simply stood no chance.</p><br/><p>2–0!</p><br/><p>Zhang Yang’s team defeated Breaking Dawn effortlessly. A lot of teams were actually frustrated with Breaking Dawn’s dual healer strategy, but Zhang Yang’s team had steamrolled over them with sheer brute force!</p><br/><p>Absolute dominance!</p><br/><p>Lone Desert Smoke’s team proudly broke into the finals. They would compete with One Sword Stroke for the finals tomorrow night.</p><br/><p>…</p><br/><p>\"Ding Ding!\"</p><br/><p>The doorbell rang. Zhang Yang walked to open the door, and saw Radiance’s guild master, Sword of Light together with Sunset Amber’s guild master, Greensleeves Prince standing at the corridor. Zhang Yang was a little surprised and greeted them, \"Oh, guild master Sword of Light and guild master Greensleeves Prince, please, please come in!\"</p><br/><p>Zhang Yang stepped aside graciously.</p><br/><p>Currently, left Zhang Yang was alone in the guest room as Fatty Han had picked up a sexy girl on the way back, and had gone on a date.</p><br/><p>\"I never would have thought that two of you were close!\" Zhang Yang made two cups of coffee for both of them and being surprised. They were from different cities, different servers after all.</p><br/><p>Sword of Light shook his head and said, \"Although I knew of Greensleeves Prince long ago, I have never met him before, not till today!\"</p><br/><p>Greensleeves Prince nodded silently in affirmation.</p><br/><p>Zhang Yang was puzzled and asked, \"So…what’s this visit about then?\"</p><br/><p>For a brief moment, Sword of Light’s face flashed with fury, and he said, \"Guild master Zhan Yu, you may call me a sore loser for this, but our loss to Imperial Sky raised up too many questions! The circumstances of it were simply too suspicious! Venshi simply cannot explain how he made such mistake!\"</p><br/><p>Venshi was the Spellcaster who made a careless mistake when they were battling with Imperial Sky’s team for the third match yesterday. Because of his careless mistake, the hope of Radiance breaking into the semifinals was ruined.</p><br/><p>Greensleeves Prince also said, \"Lonely Tree’s mistake was also inexplicable! When I saw Radiance’s match, I could not help but think, why do such newbish, amateur mistakes only occur when Imperial Sky is involved?\"</p><br/><p>Sword of Light continued, \"I did some asking around on my team, and they said that Venshi had been sneaking around a few days ago, constantly whispering into his phone. They had thought that it was a family member, or his lover, but nobody asked!\"</p><br/><p>\"Lonely Tree also met a stranger for two hours this morning, and I too have no idea on what they are talking about. However, I have good reason to believe that both Venshi and Lonely Tree have been paid off to throw the matches!\"</p><br/><p>\"I agree!\" Sword of Light nodded in acknowledgement, \"But it’s too late for that now. We have lost our battles, people would only think of us as sore losers if we voiced this out! However, we cannot let such underhanded tactics pass! Guild master Zhan Yu, Lone Desert Smoke is definitely stronger than Imperial Sky, anyone could see that. You must be careful, there’s all the more reason for them to resort to dirty tricks!\"</p><br/>\n</div>"}