{"title": "Chapter 270: Liu Wei", "id": 270, "volume": 3, "url": "http://boxnovel.org/mmorpg-rebirth-of-the-legendary-guardian-chapter-270-liu-wei", "volume_title": "Volume 3", "body": "<h1>Chapter 270: Liu Wei</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 270: Liu Wei</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Zhang Yang gave the boss a single attempt. Since he could not ride the battle mount in an indoor environment, the maximum healing amount of Berserker’s Heal was only at 30,000 HP at most. Moreover, Marzarrock’s Spider’s Venom was too strong for Zhang Yang, or practically anyone else! One stack could deal close to 2,000 damage every 3 seconds, no one, not even Zhang Yang could handle it when the stack count got higher than three or four!</p><br/><p>The boss’s physical attacks were nothing to be afraid of, however, Zhang Yang had no way of continuing the fight without a Priest or a Sacred Knight supporting him with Dispel.</p><br/><p>Just as he was about to contact Han Ying Xue to join his party, he felt a sudden nudge on his physical body’s shoulder and Fatty Han’s voice muffled in his ear. \"Ooi! Hello! Time for dinner yo!\"</p><br/><p>Zhang Yang found himself a safe spot and logged out. He tossed the gaming helmet aside and got ready for dinner. Just as he was combing his hair, he realized something and asked Fatty Han. \"Why didn’t you bring Yun Yun along with you?\"</p><br/><p>\"Sigh!\" Fatty Han sighed heavily. \"We broke up!\"</p><br/><p>Zhang Yang was stunned. \"When did that happen?\"</p><br/><p>\"Just a few days ago!\"</p><br/><p>\"Did she found out about your other girlfriend?\"</p><br/><p>\"No!\" Fatty Han raised an eye brow. \"In order to have a threesome with Hai Li, I have been trying to \"educate\" her to have an open mind about it, to look at the world in a new perspective! In fact, just a few days back, she agreed to try to ride the tricycle! She had even insisted on calling someone on her own.\"</p><br/><p>\"Isn’t that what you always wanted? So, how did you guys break up?\"</p><br/><p>\"Know this, I had never mentioned to Yun Yun anything about Hai Li!\" Fatty Han frowned again. \"At first, I didn’t give a damn who the third person would be, I’ve never experienced riding the tricycle with a stranger anyway! In the end, as I was already puffing with steam, I arrived home with Yun Yun, ready to go. She had even mention the surprise guest was already waiting in bed. I was raging hard, rearing to go! I carried Yun Yun into the room and saw the most disgusting thing I had ever seen in my life. A fully naked man in my bed!\"</p><br/><p>Zhang Yang stopped styling his hair and burst into laughter. He laughed for a good long time, wincing in pain as he grabbed his sides. \"Fatty, you dug your own grave this time! Threesome? No one had ever set the rules that it had to be one man and two women!\"</p><br/><p>\"F*ck you! Why are you still laughing! F*ck you man!\" Fatty Han grimaced. \"D*mn! My *ss almost got stabbed! Now that I think about it, I almost fell ill the next day! Sigh…why did I have to face such a tragic event!\"</p><br/><p>\"Relax bro…you’ll heal in no time! Plus, your face is as thick as a city wall! You’ll be back on your feet in no time!\" said Zhang Yang as he patted Fatty Han’s shoulder.</p><br/><p>Just as Zhang Yang pulled the door open, Wei Yan Er was standing there with her fist raised, ready to knock on the door. The little girl jumped in delight. \"Just in time! This lady was about to pester you two lazy bums!\" she said, pointing to her cousin who stood behind her.</p><br/><p>Zhang Yang said nothing and rubbed the little girl’s head furiously.</p><br/><p>The four of them came into the restaurant. As expected of Han Ying Xue the beauty queen, her sensual eyes were capable of sending any men to their feet with just a simple wink. Almost everyone in the hall had their eyes locked on her as she came to her seat. Luckily, the woman was naturally a weak against cold. Even though the hotel was slightly warm, she had covered her voluptuous, bombastic body of a devil with thick clothing. If she had not done so, the entire restaurant would probably be flooded with saliva!</p><br/><p>Since they knew that their meals will be paid by the event committee, they had purposely picked and ordered the expensive dishes. If the committee had not limited the food expense to 2,000 dollars a meal, and participant would have to pay for any excess, Han Ying Xue and Wei Yan Er would have already ordered more than that.</p><br/><p>Zhang Yang laughed at their extreme comical behavior and said, \"You know what they say, you are what you eat. I don’t want you two to end up as sows!\"</p><br/><p>\"Hehe! This girl was born skinny as a stick! I won’t get fat no matter how much I eat! How’s that? Jealous?\" Wei Yan Er stuck her tongue out at Zhang Yang.</p><br/><p>Tak Tak Tak!</p><br/><p>A crisp sound of high heel struck the hard marble floor echoed throughout the room. Those legs that wore the high heels were long and sexy, easily being mistaken for a mannequin’s. Higher above those slender legs was a body that could incur sins from a thousand men! As she walked through the restaurant, the slight bumps with each step sent her tiny buttocks shaking from the left to right at a steady rhythm. A tight one-piece dress, colored violet and red adorned her stimulating body. As the dress beneath her waist was rather short, each step she took will reveal a large portion of her fair thighs, almost to the point where her undergarments could be seen! That area where it was almost exposed, just barely, was more than enough to have men locking their focus on that forbidden region.</p><br/><p>As for her assets, they were only partially protected by the deep V-cut dress. Almost one third of her massive honkas were exposed. If she would just jump a little more, the peaks of her tatas would definitely pop out! Let’s not mention the deep dark abyssal cleavage that could immediately enslave any men to her bidding!</p><br/><p>She was wearing a set of modern sunglasses, no one could accurately guess who she was. Though her sharp chin, and jade white complexion would suggest that she belonged to the upper-class of society.</p><br/><p>This sinful of a lady had become the center of attention the moment she had set foot into the restaurant. Countless pairs of eyes were focusing like a DSLR Camera with supreme auto-tracking technology. Their heads turned to follow the woman’s movement, all the way till she sat down in front of a table. She then sat in such a sultry manner that when her dress was lifted up, whether it was intentionally or not, she revealed a large portion of her fair *ss. Those guys that had their sight locked on to her lost their minds to the point of one of them actually falling off his chair.</p><br/><p>Unlike the other men, Fatty Han was looking, or rather observing the woman with a different type of lens, in a different spectrum and said, \"Little Yang, dare to have a bet with me? I’m betting that woman is a total slut!\"</p><br/><p>\"Not interested.\"</p><br/><p>Sitting right opposite of Zhang Yang was another woman with a sinful body that could sent men killing each other just to have a handshake with her. Thus, he had only glanced at the previous woman for a second, before focusing on the dishes laying right in front of him. In fact, he was rather excited snatching food with Han Ying Xue and Wei Yan Er.</p><br/><p>\"Ack. Hey! That’s mine! So sneaky noob tank! How dare you snatch away my shrimp!\" Wei Yan Er was about to pick out a large shrimp when Zhang Yang swiftly snatched it with his chopsticks.</p><br/><p>\"First come, first serve! The early bird gets the worm! The dinner table is a battle zone where everyone sitting here is the enemy. Do you understand? Or do you want me to demonstrate it again?\" Zhang Yang grinned evilly.</p><br/><p>\"Dude! Little Yang! I’m talking to you! Pay attention!\" Fatty Han smack Zhang Yang at his shoulder. \"No matter how many times I look at her, she just looks familiar! I can’t remember who she is!\"</p><br/><p>Zhang Yang had food in his mouth and spoke carefully with his mouth full. \"Which lady in this world isn’t familiar to you?\"</p><br/><p>\"F*ck!\"</p><br/><p>Coincidentally, the exposed-tits lady removed her glasses, Wei Yan Er finally glanced at her and said \"Oh\".</p><br/><p>\"That’s just Liu Shi Shi!\"</p><br/><p>\"Oh yeah! You’re right! She’s Liu Shi Shi!\" Fatty Han smack his thigh forcefully. \"She’s the upcoming new star! She relied on her sexy appearance to be popular! I remember once that I saw her in a TV show, she was just practically swinging them boobs all over! Every time I see her in that TV show, I could not help but to bite on something to resist the lust!\"</p><br/><p>\"Huh. Not bad little brat. I’d never known that you would keep up with famous celebrities!\" said Zhang Yang. He turned his head over and had a good look at the woman. Indeed she was beautiful, but not to the point where men will kill each other for one night with her. Still, she was above average. She was just extremely sexy because of the way she dressed and how she dared to expose her tits out in public.</p><br/><p>Wei Yan Er pouted and said, \"No I don’t! Liu Shi Shi had shot for an advertisement with Silky Soft Holdings before. That’s why I recognized her. But, she’s no good person! When she met my father, those eyes of hers would literally glint with greed! And there’s my own good-for-nothing father! He would actually fall for that witch’s trap! I was so pissed off back then!’</p><br/><p>Han Ying Xue frowned and gently nudge her cousin sister in her cheeks. \"Don’t be bad mouthing your own parents!\"</p><br/><p>\"Oh.\" Wei Yan Er calmed down and nodded. From Wei Yan Er’s perspective, she treated Han Ying Xue with far more respect than her own father.</p><br/><p>\"Oh right! How and why did is the little brat staying over at your place?\" Zhang Yang asked Han Ying Xue.</p><br/><p>\"Obviously! It’s all my father’s fault!\" Wei Yan Er interjected. \"That pig is always bringing random girls over and let them stay overnight! I could not stand it any longer and ran away to stay with sister!\"</p><br/><p>Fatty Han reacted weirdly. Instead of anything else, he displayed an admiration expression and whispered to Zhang Yang. \"No wonder they say an official would have to sacrifice a wife’s happiness in order to gain ranks. If only I was a billionaire, I would have thousands of girls coming home with me every single day! That’s what I would call, living the life!\"</p><br/><p>\"Ack!\" Zhang Yang continued to play snatch-the-food with Han Ying Xue and Wei Yan Er.</p><br/><p>\"Hey look! There’s a guy sitting next to Liu Shi Shi! D*mn! They’re kissing! Deep! French! Tongue! Tongue! Out in the open! Isn’t that chick a superstar? Wouldn’t she be bothered by the paparazzi?\" Fatty Han could not find the mood to have his meal, all his attention was placed on the woman and reporting every single movement.</p><br/><p>Zhang Yang continued \"hunting\" for food and did not even lift his head up. \"Celebrities are different from each other. Only those really popular ones would be afraid of letting the media know of their private life. Those half-boiled celebrities would, on the other hand, expect some rumors flying around. That way, they could get their names out in the open! In the entertainment industry, without getting their name out in the open, whether on television or any form of media, would slowly drown themselves and will be, simply put, unpopular.</p><br/><p>\"D*mn that not good piece of shameless bastard!\"</p><br/><p>Wei Yan Er picked up a piece of char siew and stuff them into her tiny mouth. She frowned while chewing. \"I can’t let this pass. I would have the company call her up! If she wants to have rumors about her flying around, it’s her deal. But she’s current the ambassador for our company! If would be a problem if our product goes down with her!\"</p><br/><p>Han Ying Xue nodded in satisfaction. \"My Yan Er is getting more and more mature nowadays!\"</p><br/><p>In the end, Zhang Yang had had enough of the commotion and turned around to look at the busty chick. At her side was a young man with a rather handsome look on his face. An extreme well-fitted western suit adorned his well-built body. He was wearing a pair gold-frame glasses that brought out his elegance and class. He was nothing like what Fatty Han had just described him to be.</p><br/><p>However, the moment Zhang Yang sight was fixed at the man, he froze. The chopsticks in his hand fell off. A sudden involuntary shiver went through his body, and he clenched his fist.</p><br/><p>That man, was none other than his all-time arch nemesis. Liu Wei!</p><br/><p>\"Hey dummy! What’s wrong with you?\" said Han Ying Xue when she noticed Zhang Yang acting abnormally.</p><br/><p>Zhang Yang immediately took in a deep breath and turned over to face her. \"It’s nothing!\"</p><br/><p>\"It must be something! I can smell it from a mile away!\" It was never easy to trick Han Ying Xue the sly b*tch. Her busy-body face turned to him and said, \"Do you actually know that bastard? Ah! Perhaps, you guys had an argument before!\"</p><br/><p>\"Argument or not, it’s none of your business!\" Zhang Yang bellowed angrily.</p><br/><p>\"Hey! What’s wrong with you, noob tank! When did my cousin sister ever wrong you! Why are you yelling like that?\"</p><br/><p>\"Hey hey hey hey, that bastard has just got up! And he’s coming this way!\"</p><br/><p>Zhang Yang was stunned. According for his past life, Zhang Yang would only encounter Lin Yu one year later, and only because of her, Zhang Yang would encounter Liu Wei! However, as the event was transpiring right now, fate has taken a different path! Perhaps…the only person being reincarnated…was not Zhang Yang alone?</p><br/><p>Just as thousands of thoughts was rambling in his brain, Liu Wei had reached their table. He gestured with absolute mannerism and said, \"Are you perhaps, Lone Desert Smoke members? Zhan Yu, Slim and Handsome, Little Snow and Drizzler? My name is Liu Wei. I, too am a player of ‘God’ Miracle’. Pleased to meet your acquaintance. It’s an honor to meet the four legends!\"</p><br/><p>If Zhang Yang had not known about this man’s true nature behind that façade, he would have already been tricked by his warm welcome.</p><br/><p>In his mind, Zhang Yang thought, \"If he had been reincarnated again, I wouldn’t be sitting here alive! Ah…I see. The Liu family must have tried to take this chance, to take advantage of the Soaring Swords competition to set his base in ‘God’ Miracle’ and build their own industry within the game! They are the first mega company and pioneers in their field, that’s how they were able to gain such lucrative business! Liu Wei must be searching for the first guild to set his foot in the game. Hmph. Now that Lone Desert Smoke has become China’s number one guild, he must be thinking of getting his f*cking hands on me!\"</p><br/><p>Liu Wei came up to Zhang Yang with all his well-trained mannerisms but he was fated to be disappointed. How on earth would Zhang Yang be willing to cooperate with him?</p><br/>\n</div>"}