{"title": "Chapter 284: Snow White", "id": 284, "volume": 3, "url": "http://boxnovel.org/mmorpg-rebirth-of-the-legendary-guardian-chapter-284-snow-white", "volume_title": "Volume 3", "body": "<h1>Chapter 284: Snow White</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 284: Snow White</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Another day passed, and the players who participated in the memorable Soaring Sword competition had arrived at the doorsteps of their cozy home, and the profile icons that had been left dimmed for a day in the friend list started lighting up one after another, as players got back to their daily lives.</p><br/><p>Zhang Yang logged into the game early in the morning, and the first thing he saw was the portrait icon of Wei Yan Er glowing brightly in his friend list! Shocked, he sent her a private message asking, \"Little girl, did you just skip your classes again?\"</p><br/><p>\"Who said that I am? It’s New Years Eve for Christ’s sake! We have three days off!\"</p><br/><p>\"Even so, don’t you have anything else to do? Are you planning to get a degree in {{God’s Miracle}} or something?\"</p><br/><p>\"Stupid stupid stupid! I specialize in art, I am going to be a great designer! What’s the use of sh*t like maths and science? The company will be managed by professional managers, all I’ll have to do is to capture the fashion sense according to time and make the best designs ever!\"</p><br/><p>\"... You sure come up with wonderful excuses for your slackiness, you know that?\"</p><br/><p>\"Hmph! Bully! Just leave me be! Pui!\"</p><br/><p>After partying up with Han Ying Xue, Wei Yan Er and Daffodil Daydream, Zhang Yang led the party towards the Level 70 dungeon, the Kingdom of Oz.</p><br/><p>Because Fatty Han and Hundred Shots were only in their mid sixty levels at the moment, therefore, only the members who joined the Soaring Sword competition together with Zhang Yang met the requirements to enter a Level 70 dungeon. Each of them had been elevated by 3 levels as one of their rewards. Other than Zhang Yang, Sun Xin Yu was currently at Level 68, while Han Ying Xue, Wei Yan Er and Daffodil Daydream were currently at Level 67, and they could merely sweep the monsters in a Level 70 dungeon for now.</p><br/><p>One large region may have up to six Level 70 maps, or three Level 80 maps, or only one Level 90 map! However, the map sizes would grow proportionally larger as they grew lesser! The area of the Kingdom of Oz was basically six times larger than the total mass area of the Forest of Tanila!</p><br/><p>The Kingdom of Oz was built by men, but these men were unaffiliated to any of the other human kingdoms. It is a neutral kingdom, having great relationships with the centaur, the dryad, the half-elf and many other races, together, resisting the corruption of the undead and demons across their land!</p><br/><p>As the four of them traveled across the rainforest, they finally arrived at a small ancient town. Close to the entrance of the town there were a few pieces of wanted posters pasted on the notice board, and surprisingly, one of the wanted posters was blinking with a yellow exclamation mark. It was a player quest.</p><br/><p>[Wanted: Snow White] (Quest Difficulty: B rank)</p><br/><p>Quest description: Snow White is the princess to the Kingdom of Oz, but because she murdered her own father, the great Ontario The Third, she is now being wanted for treason and murder by the queen herself! Take note, Snow White is an extremely dangerous individual and is good in manipulating people! Therefore, one must be extremely cautious of her words, and once her whereabouts are discovered, please inform the authorities of the kingdom immediately, or kill her on sight! The queen will provide handsome rewards! Latest news: It was rumored that a person that looks like Snow White was last spotted in the Butterfly Valley!</p><br/><p>The four of them exchanged looks, and Han Ying Xue began to speak, \"Snow White and the Seven Dwarfs?\"</p><br/><p>\"Dream Technology and move rip-offs!\" Zhang Yang nodded.</p><br/><p>\"Are we accepting this?\"</p><br/><p>Zhang Yang smiled and said, \"Of course we are accepting it! Didn’t you see ‘handsome rewards’?\"</p><br/><p>\"Oh, noob tank, you really are heartless, Snow White is already so pitiful, framed by her stepmother for murdering her own beloved father, on top of persecution from her stepmother, and now you are accepting this quest to kill her! I was wrong about you! Boo!\" Wei Yan Er was drawing a clear demarcation between whom to hate and whom to love, stating that she was furious with Zhang Yang’s decision.</p><br/><p>\"Silly little girl, if we don’t look for Snow White, who would help her fight against her evil witch stepmother?\"</p><br/><p>\"Oh! We shall depart for Butterfly Valley then?\"</p><br/><p>\"Of course!\"</p><br/><p>The location of the Butterfly Valley was not indicated on the wanted notice, and the new map was still covered in the fog of war, showing only the areas that were explored before. But, right beneath the nose of a person were a pair of lips, so all they needed to do was flap them and ask!</p><br/><p>Although the NPCs of the town never spoke in detail, they did point them to the direction the needed to head for!</p><br/><p>After leaving town, the four of them headed east. After an approximate time of 20 minutes, they arrived at a small valley where flowers bloom in every corner of the place, and grass grew green all over the ground. There was a deer chewing on some grass, and countless colourful butterflies danced in the air around them, and they seemed to form a letter ‘S’ which later turned into a ‘B’.</p><br/><p>\"What a great place, so this is the place where the seven dwarfs and Snow White live?\" The three ladies were filled with joy and they were couldn’t wait to venture further, for it was every girl’s dream to meet their prince charming.</p><br/><p>Fortunately, Fatty Han wasn’t there, or he would have said something crazy like having an orgy of eight to immediately destroy the fantasies of the three ladies!</p><br/><p>Walking all the way into the deep valley side, the place grew smaller and tighter, just like a ‘V’ shape. When they arrived at the bottom of the valley, the distance between the two walls beside them were merely 20 meters apart from each other. Located at the deepest part of the valley, there was a row of very low houses. One, two, three, four, five, six, seven, a total of seven low houses!</p><br/><p>There was a vast garden in front of the houses, surrounded by a fence made of bamboo. In the middle of the garden stood a beautiful woman who looked like she was in her mid-twenties, sitting quietly on a deck chair made of wood, basking in the sun light. She was wearing a dress made of silk, and had long hair that went straight down to her waist. Her skin is as fair as the colour of milk, smooth and white!</p><br/><p>[Snow White] (Elite, Humanoid creature)</p><br/><p>Level: 76</p><br/><p>HP: 152,000</p><br/><p>Defense: 400</p><br/><p>Note: \"Evil\" princess, by the queen’s decree, to kill on sight!</p><br/><p>As Zhang Yang and the gang walked straight into the range of Snow White’s aggro, she was immediately shocked, and then she shouted, \"Have you been sent here by that wicked witch to rid the world of me as well? I will not let her do as she pleases!\"</p><br/><p>Shoof! Snow White instantly charged forward and initiated her attack on Zhang Yang and the gang.</p><br/><p>Zhang Yang immediately reacted and activated his {Charge} to meet her charge, knocking Snow White into a state of stun. He begun kiting the hostile enemy.</p><br/><p>Even if she slightly outleveled them, she was just an elite NPC, and under the strong fire power of the small party, Snow White was taken down to the ground in no time, leaving her with only a small amount of health points left. However, she became invincible almost immediately after, which could only mean that they had triggered a script.</p><br/><p>\"Please don’t kill me! Please! I beg of you!\" Snow White begged pitifully, her eyes welling up with tears. \"I did not murder my own beloved king. He was my father, it was the deed of that wicked witch! She framed me, and attempted to shut my mouth once and for all! She plans to turn every single one of the citizens of the Kingdom of Oz into her slaves!\"</p><br/><p>‘Ding! You have two options:</p><br/><p>1. Kill Snow White, present her heart to the Queen of Oz and claim your rewards!</p><br/><p>2. Spare Snow White, and maybe she will ask for your aid in doing something!’</p><br/><p>Zhang Yang and the gang received a system indication at the same instance.</p><br/><p>\"Of course we are picking option number two! How can we help the wicked and kill the innocent!\" Wei Yan Er spoke another corny line that she had picked up from the garbage she was watching these days.</p><br/><p>\"... Silly Yu, if we kill the queen, do you think we’ll get her magic mirror? Once I look into the mirror, it shall say, ‘Han Ying Xue, Han Ying Xue, you are the fairest among them all!\"</p><br/><p>Zhang Yang frowned a little and said, \"Let me teach you something easier, all you have to do is to record this phrase and play it to yourself everyday! Isn’t that nice?\"</p><br/><p>\"You really aren’t romantic at all! Hmph!\"</p><br/><p>\"So, all in favor of option one then?\"</p><br/><p>\"Yes!\"</p><br/><p>Zhang Yang nodded and took a step back, then he began speaking to Snow White, \"Princess Snow White, we believe you!\"</p><br/><p>‘Ding! You have made the decision for your party, the quest: ‘Wanted: Snow White’ has been automatically dropped from your quest list!’</p><br/><p>Snow White was clearly relieved and grateful, and she tearfully told her story, \"My father was a great king, but three years ago after my mother died, my father married this wicked witch! She did not only murder my father, the King, and take over his throne, but also tried to get rid of me, his legitimate flesh and blood. She will not rest till then!\"</p><br/><p>\"Travelers, are you willing to aid me in getting rid of this wicked witch, and return the glorious days of old back to the Kingdom of Oz?\"</p><br/><p>Wei Yan Er quickly took the initiative to speak to Snow White, and she said, \"Princess, we will definitely help you! Rest assured, we are going back the way we came from and rid the world of this wicked witch, once and for all!\"</p><br/><p>\"No! It is not possible! That wicked witch has a mirror with unlimited immense power, which can kill anyone with ease! Even the great gods tremble in fear before the power of that mirror!\" Snow White quickly shook her head, \"To be able to handle that wicked witch, one must destroy that of mirror first!\"</p><br/><p>\"Alright! Let us move on to destroying the mirror!\" Wei Yan Er thumped her chest and immediately turned to leave!</p><br/><p>Snow White immediately stopped her from doing so, she said, \"Brave and just warrior, you must not be hasty about this, that mirror is incredibly strong, normal weapons are definitely not going to damage it!\"</p><br/><p>\"So what do we do?\"</p><br/><p>\"You have to defeat the Stone Giant Herlow and get his heart. It is made out of the strongest stone in existence, even the thunder strikes from the Gods cannot destroy it! Use the heart of Herlow to shatter that mirror, and then you will be able to destroy the mirror once and for all!\"</p><br/><p>‘Ding! Snow White has provided you a quest: The World’s Strongest Stone, accept or decline?’</p><br/><p>The four immediately accepted the quest.</p><br/><p>[The World’s Strongest Stone] (Quest difficulty: A Rank)</p><br/><p>Quest description: Slay the Stone Giant Herlow, get his heart to destroy the wicked queen’s mirror! Take note, the Stone Giant Herlow is extremely powerful, it is recommended that you invite more friends to aid you in this quest! You may find Stone Giant Herlow at the south side of the Mount Heaven’s Fall.</p><br/><p>Limit of players for the quest: 5 players (can be shared)</p><br/><p>Completion: Obtain the heart of the Stone Giant Herlow 0/1</p><br/><p>\"The quest can be done with five players? Then let’s go find the boss first, when icy comes online, let her use the [Lover’s Charm], and then we shall complete the quest together!\" Zhang Yang looked at the quest description while saying it.</p><br/><p>Han Ying Xue humphed lightly and said, \"Silly Yu, you really care for her don’t you, always remembering to count her in, every single time!\"</p><br/><p>\"If you are talking about that now, don’t I treat you even better? When have I ever not called you along for any boss fights?\" Zhang Yang fought back against her claim.</p><br/><p>\"It’s obvious that you are using me like a mule! Bringing me along just to be your walking potion!\"</p><br/><p>While joking around with smiles and laughter, the four of them headed towards the exit of the valley.</p><br/><p>Suddenly, Wei Yan Er was reminded of something, \"Argh! We actually forgot to drop by the houses and take a look at the dwarfs!\"</p><br/><p>Daffodil Daydream smiled and said, \"Yan Er, the seven dwarfs must be the dwarfs that we all know of, so there shouldn’t be anything special to look at!\"</p><br/><p>\"Oh --- \"</p><br/><p>Arriving back at the small town, Zhang Yang tried to pry for information about the location of the Mount Heaven’s Fall from the NPCs. Only after asking seven or eight NPCs, they finally knew that the general direction to Mount Heaven’s Fall was to the west. They were unable to get any other details!</p><br/><p>The party of four rode out towards the west, and after one and a half hour, they finally arrived at the next small town. Once again, they asked the NPCs around and continued heading towards Mount Heaven’s Fall.</p><br/><p>\"Noob tank, why is it taking so long just to find a monster?\" Wei Yan Er began to feel impatient. They had been running around all day long, and she was getting frustrated.</p><br/><p>\"Calm your badonkers, starting from tomorrow, the time in the game and the time in our reality shall be adjusted to the ratio of 3:1!\"</p><br/><p>\"Wouldn’t everyone be moving in fast forwarded pace then?\"</p><br/><p>Zhang Yang laughed out a while and said, \"Our human thinking ability is measured in light speed, even with the adjustment of 3:1 ratio, you will not feel any difference!\"</p><br/><p>\"... Does that mean that traveling on a journey to some place else will still consume a large amount of time?\"</p><br/><p>\"Indeed, from your perspective, everything will still remain the same!\" Zhang Yang nodded.</p><br/><p>After another hour of traveling, finally, they arrived at the Mount Heaven’s Fall. This was a tall mountain that pierced through the layer of clouds, but the tip of it was remarkably flat, as if it had been sliced off by a sharp sword, leaving the whole mountain with an entirely flat head! Legend had it that this Mount Heaven’s Fall was connected straight up to the palace of the Gods. However, as the gods grew tired of being disturbed by mortals, they cast their power to cut Mount Heaven’s Fall into half, which led to the appearance it had now.</p><br/><p>Zhang Yang and his party arrived at the south of the foothills of Mount Heaven’s Fall. They found a way into the stone valley and entered this deep and quiet valley.</p><br/><p>\"Humans! Please leave, now! This is the abode of the great Herlow, no trespassers shall interrupt him!\" a humanoid shape, its body being made entirely out of blackened mud suddenly crawled out from a pile of mud not far from them, speaking to the four of them in a deep voice.</p><br/><p>[Stone Valley Mud Man] (Elite, Elemental Creature)</p><br/><p>Level: 72</p><br/><p>HP: 144,000</p><br/><p>Defense: 800</p><br/><p>The monster’s name was yellow in color, meaning that the monster was currently non-hostile. However, if Zhang Yang and the party ventured any further, it would probably turn red and attack them.</p><br/><p>Wei Yan Er took out her big axe and shouted, \"Hey mud monster, let’s see how I turn you into mud pile of sh*t!\"</p><br/><p>She charged forward with a shoof, starting the fight.</p><br/><p>Zhang Yang chuckled a little and took over in kiting the monster. With his current defense, one heal from Han Ying Xue will would completely counteract any damage the mud man could deal, allowing him to unleash his damage with joy.</p><br/><p>In less than 10 seconds, the Mud Man was really beaten into a pile of mud sh*t.</p><br/><p>The gang continued to push forward, and more Mud Men crawled out of the mud piles by the side of the corridor they were passing through. As they had already entered the territory of the monsters, the Mud Men were immediately hostile and attacked them relentlessly.</p><br/><p>Killing these Mud Men was nothing more than genocide, for they did not even drop any loot! That drove Han Ying Xue and Wei Yan Er so mad to the point, that they were releasing their anger by shouting out to the heavens, complaining about how stingy the system was!</p><br/><p>After killing about 20 or more of these mud monsters, finally, one equipment was dropped!</p><br/><p>[Stone Helmet] (Green-Copper, Heavy Armor)</p><br/><p>Defense: +10</p><br/><p>Vitality: +84</p><br/><p>Strength: +42</p><br/><p>Agility: +21</p><br/><p>Level requirement: 70</p><br/><p>Stone Armor Set (1/5)\"</p><br/><p>Stone Helmet, {Stone Chest Plate}, {Stone Gaunlets}, {Stone Greaves}, {Stone Boots}.</p><br/><p>3 pieces: Increase defense by 200 points.</p><br/><p>5 pieces: Increase HP by 2000 points.</p><br/><p>\"An [Armor Set], not bad at all!\" Zhang Yang nodded continuously.</p><br/><p>Daffodil Daydream was confused, so she asked, \"Green-Copper [Armor Set], isn’t the quality a little too low?\"</p><br/><p>Zhang Yang laughed and said, \"After the appearance of the second set of armor, there will be no more [Armor Set] pieces appearing again, and only open world bosses might drop this kind of armor pieces! Therefore, don’t overlook its Green-Copper tier, it is one of the mainstream equipment in the eyes of most players. Well, at least it will remain this way until players reach Level 80!\"</p><br/><p>Daffodil Daydream understood and said, \"So after level 80, when a Violet-Platinum boss appear, they will be the new Gold-Yellow! And the Gray-Silver bosses in the future shall be the same as Green-Coppers to us. So, the Gray-Silver grade equipment shall become worthless goods that would be easily found by the roadside at leisure!\"</p><br/>\n</div>"}