{"title": "Chapter 299: Mythical King of Tyrannosauruses - Morchason", "id": 299, "volume": 3, "url": "http://boxnovel.org/mmorpg-rebirth-of-the-legendary-guardian-chapter-299-mythical-king-of-tyrannosauruses-morchason", "volume_title": "Volume 3", "body": "<h1>Chapter 299: Mythical King of Tyrannosauruses - Morchason</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 299: Mythical King of Tyrannosauruses - Morchason</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>[Scavenging Mythical Tyrannosaurus] (Normal, Beast)</p><br/><p>Level: 65</p><br/><p>HP: 6,500</p><br/><p>Defense: 60</p><br/><p>These mythical tyrannosauruses looked basically just like the dinosaur itself. Every single one of them was about 10 meters tall, with lower bodies that looked incredibly strong and powerful while having a pair of short tiny hands with claws. They looked just like the feet of chickens popping out of their chests! Each of them had long and thick tails that looked like steel whips. Their entire bodies were dark-gray in colour, and they had gnashing big maws full of blade-like teeth!</p><br/><p>However, Zhang Yang would not waste his time looking at regular monsters! He patted Whitey’s head gently and said, \"We shall charge forward and just ignore everything else along our way. If anything follows, we’ll just wipe them out!\"</p><br/><p>After finishing his words, he rode on Whitey and began to charge into the valley, and naturally, Sun Xin Yu followed behind closely.</p><br/><p>As they passed through, a large number of mythical tyrannosauruses detected their presence, and power coursed through their muscular legs as they began to give chase!</p><br/><p>Zhang Yang did not give a damn about these regular monsters as he was riding on Whitey. Whenever the monsters got close enough to snap at Sun Xin Yu, he would activate his {Horizontal Sweep} and {Blast Wave}, or just jump down from his bear to activate {Charge} and {Thunder Strike} to take out the ‘trash’. After that, he would jump onto the back of Whitey with a flip and continue his journey.</p><br/><p>Since they were here to hunt for a boss, nothing else mattered!</p><br/><p>After a seven to eight minutes of charging forward, the two of them were already closing in on the bottom of the valley. As they turned around, they saw hundreds of monsters charging towards them in a furious stampede! If not for the aggro system where monsters would stop their pursuit after a certain distance, that ‘army’ of monsters that followed them over would have been two times more!</p><br/><p>Zhang Yang turned around, and as his rage gauge was full, he activated his {Horizontal Sweep}!</p><br/><p>Instantly, the monsters were inflicted with damages of 4000+, which repeated itself over and over again! One second later, the common cool down had ended, Zhang Yang activated another {Blast Wave}, blasting the and dazzling the monsters around!</p><br/><p>Sun Xin Yu wouldn’t leave all the action to him. She peppered the monsters with {Fan of Daggers} from one side, throwing out her knives that spread out in eight directions, inflicting a series of outstanding damage! However, she lacked the special effect on her weapon, so they never came close to Zhang Yang’s output!</p><br/><p>If other players had been surrounded by so many monsters, the players would have been quickly overwhelmed even with hundreds of healers supporting them! But Zhang Yang’s equipment were simply out of this world, leaving no chance for the monsters!</p><br/><p>After some time, all of the Scavenging Mythical Tyrannosaurus had been slain, leaving the ground with glittering loots. Zhang Yang glanced through all the loots and picked up a few pieces of equipment. The other items did not even have good selling values, so there was no point picking them up.</p><br/><p>Zhang Yang took a look at Sun Xin Yu and began to smile, \"Now, you should just look at me in admiration. That should stroke my ego!\"</p><br/><p>\"... boring!\"</p><br/><p>She began to summon her [mount] while trying to ignore him.</p><br/><p>\"Wait just a second!\" Zhang Yang suddenly pointed towards a direction, \"There is a Mythical Tyrannosaurus over there, the size of it looks odd, could it be ---\" He had already began rushing over there.</p><br/><p>Sun Xin Yu followed closely from behind on her mount, and as they were approaching it, they saw a mini-sized little Mythical Tyrannosaurus. It’s whole body was crimson red, it was definitely different from the others in the wild! That was not the main point, the main point was that this little Mythical Tyrannosaurus was labeled as Level 0!</p><br/><p>[Crimson Red Mythical Tyrannosaurus] (Yellow-Gold Battle Mount)</p><br/><p>Level: 0</p><br/><p>HP: 50</p><br/><p>Caution: Can be captured.</p><br/><p>A Yellow-Gold [Battle Mount]! It was a jackpot out of the blue! They actually encountered another such mount!</p><br/><p>Zhang Yang smiled at Sun Xin Yu and asked, \"Did you bring your [Sealing Leash]?\"</p><br/><p>\"Of course!\" Sun Xin Yu nodded and pulled out a [Sealing Leash] from her backpack. Without waiting for Zhang Yang, she instantly threw her {Sealing Leash] straight at the little Mythical Tyrannosaurus.</p><br/><p>As she began to cast the spell to activate the [Sealing Leash], 1%, 13%, 45%... Pak, failed!</p><br/><p>The first [Sealing Leash] had been broken into two, however, Sun Xin Yu was not rattled or anything. She took out another [Sealing Leash] from her backpack and threw it at the little Mythical Tyrannosaurus once again.</p><br/><p>Activating the [Sealing Leash]... Failed!</p><br/><p>For the third attempt! Forth attempt... the eighth attempt!</p><br/><p>‘Ding! You have successfully sealed the Battle Mount - Crimson Red Mythical Tyrannosaurus!\"</p><br/><p>At last, Sun Xin Yu received the sweet and satisfying voice of the system notification in her ears.</p><br/><p>\"You are now a mother with a child!\" Zhang Yang told her solemnly with a straight face. She rolled her eyes at him.</p><br/><p>The two continued to push on forward, and they slayed another wave of monsters. Eventually, they arrived at the deepest bottom of the valley.</p><br/><p>A gigantic Mythical Tyrannosaurus with the height of up to 30 meters was lay in a deep slumber by it’s nest, it’s nostrils ejecting jets of hot air, threatening to blow off the leaves on the nearby trees.</p><br/><p>[Mythical King of Tyrannosauruses - Morchason] (Yellow-Gold, Beast)</p><br/><p>Level: 70</p><br/><p>HP: 7,000,000</p><br/><p>Defense: 1,400</p><br/><p>Sun Xin Yu turned to Zhang Yang with a questioning stare, then she asked, \"So much health points, how are the two of us going to pull this off?\"</p><br/><p>According to the official database, the basic attack of Morchason is approximately 10,000, therefore, Zhang Yang would probably take 6,200 damage per hit. The boss would attack every 2 seconds, and considering the fact that Zhang Yang could use {Block} once in every 6 seconds, the damage sustained should be around 2,000 --- all these calculations had not yet taken the boss’ other skills into account yet!</p><br/><p>Zhang Yang would have a total amount of 60,000 health points when mounted on Whitey, and with him able to activate two {Berserker’s Heals}, two {Shield Walls}, he would probably last for 2 minutes! However, to deplete the 7,000,000 health points of the boss within that two minutes, the DPS of Sun Xin Yu and Zhang Yang must reach up to 50,000! Well, that was out of the question!</p><br/><p>One option was to have Sun Xin Yu use the [teleportation scroll] to travel back, and then pass her [Lover's Charm: Yin] over to Han Ying Xue, allowing their ‘Super Healer’ to teleport over to him! Possibly being the most well-equipped player in China, she will be able to leisurely give Zhang Yang all the time in the world to chew the boss off, bit by bit. It would definitely be a piece of cake!</p><br/><p>However, when Zhang Yang pulled up his friend list, he saw that the avatar portrait of Han Ying Xue was dimmed, and the same went for Wei Yan Er.</p><br/><p>Han Ying Xue was a priest, leveling up all on her own would be extremely difficult and inefficient. She would always be paired with Yan Er. Miraculously, Wei Yan Er did actually attend her classes today, giving Han Ying Xue reason to be offline as well, as she was probably out shopping at that very moment!</p><br/><p>At this time, he could not depend on Han Ying Xue! Furthermore, if he really did shoo Sun Xin Yu back to Thunderstorm Castle for this particular reason, this Icy queen would definitely explode --- who does he think she is? To summon her when she is required, and to send her away when she is no longer needed?!</p><br/><p>Still, it was not a wise move to go up against the boss in their current situation!</p><br/><p>If he was already Level 80, equipped with several pieces of Violet-Platinum equipment, then it could have been possible for him and Sun Xin Yu to work together in bringing down this Mythical King of Tyrannosauruses! But now... Zhang Yang raised up his head and looked around. He really would not want to waste the final summon of the Friendship Jade!</p><br/><p>\"Are we going to engage or what?\" Sun Xin Yu demanded in her crystal clear voice.</p><br/><p>Zhang Yang revealed a smile on his face as he said, \"Engage!\"</p><br/><p>\"Huh? If we are engaging, why are you moving back then?\"</p><br/><p>\"Silly girl, with just the two of us to go head on against the boss, won’t we get raped by the boss?\" Zhang Yang patted Whitey as he arrived at the flat side of a mountain.</p><br/><p>\"... who are you calling silly?\" Sun Xin Yu sounded dangerous.</p><br/><p>Zhang Yang couldn’t help but tease her further, \"What a silly girl, making me repeat myself twice! Oh dear, there’s no cure for this one!\"</p><br/><p>‘Qiang!’ Sun Xin Yu pulled out her dagger.</p><br/><p>\"Don’t get mad, it was just a joke! I say that you, icy, should smile more often. If you keep your face that tense all the time, your face might not last through your 30s!\" Zhang Yang began to laugh.</p><br/><p>Sun Xin Yu was silent for a moment before she asked.</p><br/><p>\"The boss is at the other side of this area, how are you going to engage with the boss from here?\"</p><br/><p>\"Mountain men will play by the mountain! Got it?\" Zhang Yang nudged his head in the direction at the mountain wall, trying his best to crack a mountain joke.</p><br/><p>\"Stop being so lame!\"</p><br/><p>\"Can you see the cave by the top side?\" Zhang Yang pointed at the mountain wall.</p><br/><p>As Sun Xin Yu raised her sight of view upwards, and she saw it, 40 meters above the ground she was standing now, the mountain wall had seemed to have been skewered by gigantic spears countless of times, leaving a series of crack marks on it. Some of the crack marks were shallow, but some of them were deep enough to hide people in it. Some of them were actually as deep as seven to eight meters!</p><br/><p>\"So, what’s with them?\"</p><br/><p>\"The entrance of these caves are extremely narrow, at least for the boss. That big-mouthed idiotic Tyrannosaurus will never fit into it, we fight from the cover of it and wear the boss down!\"</p><br/><p>\"Well, but he would be out of your range as well, what good would the cover do?\"</p><br/><p>\"Indeed! But, we will control the rhythm of the battle! When we feel like engaging, we can just engage! When we are out of health points, we can retreat into the narrow cave and get patched up, take our time for our skills to cool down. We can kill him at leisure!\"</p><br/><p>Sun Xin Yu gave it some thought, and then she asked, \"That being said, the problem is still unsolved. How are you going to reach the cave on the mountain wall?\"</p><br/><p>Those crack marks are basically 40 meters from the ground, making it impossible for any player to jump up to any of them! It sounded like Zhang Yang was making a pointless suggestion!</p><br/><p>At that instant, Zhang Yang could not help himself but smile, as he took a piece of item out that he left it long in his backpack --- [Frog King's Powerful Flippers], upon activating, player can jump extremely high for the next 10 seconds, cool down: 1 minute only!</p><br/><p>And it is a Level 20 equipment! Sun Xin Yu was shocked by what she just saw, \"I can’t believe you actually held on to that!\"</p><br/><p>Zhang Yang smiled, always believing that such equipment with unique abilities would always have their use, someday! He would not even abandon a level 1 equipment with such attributes!</p><br/><p>After putting on the [Frog King’s Powerful Flippers], Zhang Yang activated the equipment’s special effect. With a powerful leap, he instantly leaped over a height of approximately 50 meters, and started climbing up the cliff face.</p><br/><p>However, the duration of the \"powerful leap\" had ended by the time he was climbing. So Zhang Yang had to wait for another minute doing nothing but stand on the shelf of rock before he could continue to leap for a higher ‘milestone’! It took him about six or seven minutes before he could squeeze himself into one of the crack holes on the wall. When he saw that it wasn’t deep enough, he had to spend more time jumping further up to try the other holes.</p><br/><p>Another five or six minutes had passed, and Zhang Yang had finally found himself an ideal crack hole which was about 10 meters deep, 2 meters tall and 2 meters wide, enough for a player to move around freely.</p><br/><p>\"Icy, I am counting on you to get the boss here! After I’ve taken its aggro, you can freely interpret the situation to attack or use {Vanish} to clear yourself from the aggro of the boss.\"</p><br/><p>Without a word, Sun Xin Yu rode on her wolf mount straight towards Morchason.</p><br/><p>The range of the boss’s aggro was approximately 30 meters wide. The moment Sun Xin Yu entered that range, Morchason instantly let out a thunderous roar and lumbered to its feet. With the powerful and muscular legs powering it forwards, Morchason opened up it’s bloody big mouth and crunched its teeth at Sun Xin Yu!</p><br/><p>Sun Xin Yu immediately started running!</p><br/><p>Morchason was right behind her with it’s two powerful, long and muscular legs! Every step it took shook the ground with incredible vibrations, emitting out a series of thunderous rumbles!</p><br/><p>Zhang Yang pulled out his [Dark Enigmatic Sword], waiting for Morchason to enter the range of his attack. The moment Morchason stepped into the range distance of 30 meters from him, Zhang Yang immediately fired a {Spear of Obliteration} straight at the boss!</p><br/><p>‘-2,298!’</p><br/><p>The first damage value inflicted on Morchason appeared right on top of the boss’s head!</p><br/><p>Sun Xin Yu had merely gotten close to the boss. Compared to a direct attack; after that obliterating strike from Zhang Yang, most of Morchason’s aggro value was pulled over towards Zhang Yang, so the boss began to advance ferociously towards Zhang Yang who was standing at the entrance of the crack hole.</p><br/><p>{Block}!</p><br/><p>Raising up his shield upon the activation of his skill, his shield was caught between the mouth of the boss! With the shield pressing against the sharp teeth of the boss, sparks flew, with a horrifying screech! While holding out until the boss withdrew it’s mouth, a number of scratches were seen on the [Titan Wall]!</p><br/><p>That was why equipment were designed to have a of durability in this game!</p><br/><p>After a long period of time using an equipment, it will naturally be damaged or even break! Engaging in a seriously intense battle would greatly decrease the durability. And when the durability of that equipment hits zero, it would lose all of it’s additional attributes, which meant that players would need to find a blacksmith to repair it, in order to use it again for future battles!</p><br/><p>Furthermore, the durability of an equipment would increase correspondingly to the quality of the equipment. The better the quality meant greater durability, meaning a longer time of use. For players, having their equipment ‘damaged’ was not too big of a deal, as the equipment would still function with all of it’s additional attributes, as long as there is still one durability point remaining, as long as it is not ‘broken’!</p><br/><p>For tankers, their shields take the most impact of all other equipment. So the game developers have made the shield far more durable, compared to other equipment. [Titan Wall] had a durability of 800, which was far more durable than the other equipment on his body, like [Furious Chest Plate] which had only 100 durability points!</p><br/><p>Unfortunately, monsters did not have the attributes of equipment durability!</p><br/><p>If not for that, players could have depleted the durability of all the boss’s teeth, leaving it as a toothless hag!</p><br/><p>Zhang Yang was waving his sword around to fend off against the ferocious attacks from the boss while shouting out to Sun Xin Yu, \"Icy! You may start attacking!\"</p><br/><p>Both of them started attacking from both sides.</p><br/><p>After a few seconds of battle, Morchason suddenly let out a thunderous roar, lashing out its tail which was as thick as a tree tunk at Zhang Yang! But before the tail could reach Zhang Yang, it struck the mountain wall first! The powerful strike of the tail actually shook the while mountain for awhile and the rocks and dust were dropping from the ceiling within the crack hole!</p><br/><p>Although the sound made by the attack was extremely loud and intimidating, the attack stopped there!</p><br/><p>Zhang Yang could not help himself proudly ask, \"How is it, Icy? Are you impressed?\"</p><br/><p>Sun Xin Yu instantly rolled her eyes at Zhang Yang.</p><br/><p>However, Zhang Yang could not mount his [Battle Mount] within holes and caves. After merely a minute, his health points were starting to get low. He quickly activated his {Shield Wall} and continued to rely on the activation of the health recovery effect of his [Armor Set], and when things got tensed up, he activated his {Berserker’s Heal}.</p><br/><p>Even with all his powerful skills activated, he could only last against the assault of the boss for 50 seconds long before his health became critical!</p><br/><p>\"Icy! Use {Vanish} now! I am about to draw back!\" Zhang Yang shouted out, and began to run inwards into the crack hole. Of course, Whitey was twerking it’s big fat butt, following closely.</p><br/><p>As they were retreating, Morchason tried to snap at them, but it failed to touch Zhang Yang. The boss went berserk, flinging it’s large head around while ramming at the entrance of the crack hole, shaking up the mountain stones, causing the stones and dust on the ceiling within the crack holes to rain down.</p><br/><p>At that moment, the boss was like a continuous wave of explosives! Anyone who got too close would only become it’s victim!</p><br/><p>Zhang Yang threw another strike of {Spear of Obliteration} at the boss. After that, he calmly took his sweet time to patch himself up with the [Silk Bandage] that he brought along.</p><br/><p>[Silk Bandage] (Consumable)</p><br/><p>Use: Recovers 8,000 health points within 10 seconds. While patching up, you cannot have any other movement, or else the effect will immediately be interrupted. The cool down time will be shared across all other types of bandages.</p><br/><p>Cool down time: 1 minute.</p><br/><p>Required: Professional tier First Aid</p><br/><p>As Zhang Yang had previously acquired the title of ‘Specialist tier First Aid’, and with only one [Silk Bandage], he immediately healed himself by 16,000 health points!</p><br/>\n</div>"}