{"title": "Chapter 305: Summoned Soldiers", "id": 305, "volume": 4, "url": "http://boxnovel.org/mmorpg-rebirth-of-the-legendary-guardian-chapter-305-summoned-soldiers", "volume_title": "Volume 4", "body": "<h1>Chapter 305: Summoned Soldiers</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 305: Summoned Soldiers</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Zhang Yang rushed to the front and entered the boss’ attack range. The moment the boss reacted in a hostile manner, the battle started promptly.</p><br/><p>With nothing with his bare fist, Knightmare thrust’s his massive knuckles towards Zhang Yang. The massive fist cast a huge shadow that enveloped Zhang Yang. He quickly used {Block}.</p><br/><p>As per the usual battle strategy, Wei Yan Er and Sun Xin Yu went behind the boss and attacked from there. Daffodil Daydream and Han Ying Xue stood behind Zhang Yang, attacking with fire spells and healing.</p><br/><p>Knightmare shared the standard attack interval of around 2 seconds. After the first strike, the second attack came 2 seconds later. This time, Zhang Yang could not use {Block}, and he could not evade the lightning speed fist coming at him. Zhang Yang had to take the fist, fully undefended.</p><br/><p>‘-7,812!’</p><br/><p>A massive, painful attack landed, taking away a significant amount of HP and leaving a debuff on him at the same time;</p><br/><p>[Shadow Radiation]: Cause 1,000 Shadow damage to all targets 10 meters around. Last for 10 seconds.</p><br/><p>Zhang Yang screamed. \"Get away from me! At least 10 meters!\"</p><br/><p>Wei Yan Er and Sun Xin Yu immediately kept their distance from him. During their escape, Wei Yan Er had slipped in an insult, calling Zhang Yang something that meant swine king, leaving Zhang Yang madly infuriated.</p><br/><p>Although Zhang Yang had responded fairly quick, and Wei Yan Er and Sun Yin Xue had escape swiftly, they had still sustained two damage ticks from the {Shadow Radiation}. Daffodil Daydream and Han Ying Xue only needed to step back a little and were still able to attack and heal. As for Sun Xin Yu and Wei Yan Er, unless they were willing to take on the damage of {Shadow Radiation}, they would have to wait until the debuff on Zhang Yang expires. Nevertheless, the damage from {Shadow Radiation} was quite painful.</p><br/><p>Zhang Yang felt something was odd, and checked the battle log.</p><br/><p>Knightmare’s physical damage had dealt 7,812 Shadow damage to you. (2,201 damage reduced, 994 damage absorbed</p><br/><p>The moment a physical attack deals Shadow damage instead of the usual physical damage, Zhang Yang’s ultra-high Defense would lose its meaning! The boss’ attack was similar to Knight class players. Knight class players would always deal holy damage!</p><br/><p>That was why Zhang Yang felt that the boss’ attack was odd. It would be wrong to say that it was a magic attack since it could be \"blocked\". However, it could not be considered a physical attack either since it had Shadow damage! That aside, Zhang Yang could not spent too long dwelling on this ridiculous mental argument. 2 seconds later, Knightmare punched Zhang Yang again, the {Shadow Radiation} on Zhang Yang had been refreshed to 10 seconds again!</p><br/><p>With him constantly radiating shadow damage, there was literally nothing that Sun Xin Yu and Wei Yan Er could do!</p><br/><p>\"Hey! Noobie tank! We can’t fight like this!\" Wei Yan Er complained bitterly.</p><br/><p>\"Then sit down and grow a tree or whatsoever! Didn’t you learn {Spear of Obliteration}? Start using that to attack then!\" Zhang Yang scolded.</p><br/><p>Sulking, Wei Yan Er quietly complied, and started hurling spears, 10 seconds at a time.</p><br/><p>7 to 8 seconds into the battle, the magic circle on the floor glowed brightly and a magic portal appeared. A group of demons walked out of the portal. The strongest monster from the group of demons was the Level 76, elite tier Flame Hell’s Devil. The other weaker ones were just 10 normal demons such as imps, Floating Apparition, and even Succubi. Right this time, Knightmare should be casting a bubble to transport the demons outside of the hall. However, since the boss was engaging Zhang Yang and his party, the demons were immediately sent into battle with Zhang Yang. The problem was, Han Ying Xue was currently generating the second largest aggro value as she was healing vigorously, prompting the demons to target her first.</p><br/><p>{Horizontal Sweep}!</p><br/><p>Since the beginning, Zhang Yang had reserved {Horizontal Sweep} for the sole purpose to dealing with the group of demons. With a good swing of the Dark Enigmatic Sword, the blade shone brightly and dealt more than 4,000 damage to all. SHIING! The sword’s effect was triggered and another blast of {Horizontal Sweep} was cast, killing all the normal tiered demons, leaving the elite Flame Hell’s Devil alone standing.</p><br/><p>With the huge aggro value generated by Zhang Yang, the Hell’s Devil shifted its target from Han Ying Xue to Zhang Yang. Stomping violently, the Flame Hell’s Devil thrust its stone fist at Zhang Yang. With burning flame enveloping the fist, the heat of it was felt even before it touched Zhang Yang.</p><br/><p>\"Ice! Brat! Get the Devil! Daffy! Deal with the boss!\" Zhang Yang cried out.</p><br/><p>Sun Xin Yu and Wei Yan Er nodded their heads and did what Zhang Yang has asked. Ignoring the damage from Zhang Yang’s {Shadow Radiation}, they took the damage and attacked the Hell’s Devil. Instantly, the stress on Han Ying Xue sky rocketed to a point where she was swiveling from side to side so quickly that her boobs were slapping against themselves! She was moaning as if she was both in pain and ecstasy. Zhang Yang sighed to himself. This woman was a treasure. One of a kind. There’s no one else like her.</p><br/><p>Her moans were so loud, and indecent. She sounded like she was climaxing all the way, in both pain and pleasure. Zhang Yang was trying his utmost best to keep his shaft from standing at attention, while Daffodil Daydream and Sun Xin Yu were blushing so furiously that both their heads looked like oversized peaches. The only person not reacting to Han Ying Xue’s moans was the innocent Wei Yan Er. At most, she had stopped to look at her sister, cocking her head like a curious dog. After a micro second, she went back to cleaving the Devil, having lost interest in her cousin sister.</p><br/><p>The fact that Han Ying Xue continued moaning without pause, finally blew off what remained of Zhang Yang’s patience. He roared, \"Hey! B*tchy Snow! Shut your mouth for just a second!\"</p><br/><p>Han Ying Xue grinned. \"OooooOOoooOohhhh~ AAaaaAAaaaAHHhhh~~\"</p><br/><p>Zhang Yang facepalmed himself and finally sent fire against fire. \"One more moan, and I’ll personally put my pokey in your hokey!\"</p><br/><p>Zhang Yang’s funny euphemism worked like charm, which instantly silenced Han Ying Xue as she rolled her eyes at him .</p><br/><p>With only around 150,000 HP, the Flame Hell’s Devil was unable to endure the focus fire from Zhang Yang, Sun Xin Yu, and Wei Yan Er. After 20 seconds, it was defeated. Promptly after killing the Devil, Sun Xin Yu and Wei Yan Er leaped away from Zhang Yang to reduce the pressure on Han Ying Xue.</p><br/><p>The calm did not last for long. Since the portal will summon another wave of demons in just 30 seconds, the peace only lasted for just 7 to 8 seconds before another wave spawned. Zhang Yang resorted to the same tactic as before. Zhang Yang used {Horizontal Sweep} and {Blast Wave} to clear the weaker monsters, while Sun Xin Yu and Wei Yan Er dealt with the Devil. Though it may seem effective, Han Ying Xue was the only one who seemed to be having the short end of the stick. Without a break, she had jiggled her mounds here and there in order to cast all sorts of healing spells just to keep the team alive. In the end, her efforts had caused her to moan again. The team was forced to deal with her constant moaning.</p><br/><p>Overall, the battle was extremely tough. Luckily, Han Ying Xue had good equipment, along with unparalleled management of her skills. Even though she had been constantly healing several members at once, her MP was far from dropping!</p><br/><p>On the side, Daffodil Daydream was having a tough time dealing with the boss. Alone, she was slowly pricking the boss with her spells.</p><br/><p>By the time the boss’ HP reached 80%, the summoned group of demons had been upgraded. From just one, the summoned group of demon had two elite tiered monsters now!</p><br/><p>The party could handle one elite monster in 30 seconds. But with two of them at the same time, thing might be turn sour for the party.</p><br/><p>Every time they killed one elite, the portal would send out another wave, leaving them with an extra elite to deal with! They would eventually be overwhelmed!</p><br/><p>Without second thoughts, Zhang Yang spoke up.</p><br/><p>\"I’ll kite all the monsters. All of you, take this chance to use the [Teleportation Scroll]! That portal is ridiculous. We’re not here to kill the boss. The boss is here to kill us!\"</p><br/><p>\"But what about you!?\" everyone asked.</p><br/><p>Well, it was good to know that they cared about him. Zhang Yang smiled and explained. \"I have the {Shadow of the Void}. After you guys teleport away to safety, I’ll activate the skill and escape as well!\"</p><br/><p>\"Okay!\" Everyone nodded and prepared their [Teleportation Scroll].</p><br/><p>Zhang Yang swiftly used {Shield Wall} to buy some time for the girls to teleport away. After everyone had vanished from the battle field, Zhang Yang activated {Shadow of the Void} and escaped as well. 20 seconds of invisibility gave him time to run to absolute safety. There, he used his own [Teleportation Scroll] and went back to Thunderstorm Castle.</p><br/><p>\"How are we gonna kill the boss with the portal there!?\" cried Wei Yan Er bitterly.</p><br/><p>\"Hm…Looks like the only we for us to kill the boss is to rely on the quest. Perhaps, there is a way…\" said Zhang Yang. The poor white bear had sacrificed itself in the battle field. He could only summon his old skeletal horse and rode with the girls through Oz and into the Ravine of Coyotes. Within the hour, the party stood in front of Captain Kang Na.</p><br/><p>‘Ding! You have completed the quest: Investigate the Demon’s Territory Obtained 200,000 Experience points!’</p><br/><p>\"Haha! Greenhorns! You did well! The demon territory is a dreadful place! Not a single one from my troops was able to handle the quest at such speed! Well done indeed! You’re strength is worth acknowledging! Adventurer! You now have the qualifications to be one of us!\" said Captain Kang Na with a warm smile on his face.</p><br/><p>Zhang Yang gave an adventurer salute and said, \"Respected Captain! We will put our bodies and souls to protect the future of humanity!\"</p><br/><p>Han Ying Xue cringed. \"Dummy. That was too corny!\"</p><br/><p>\"Yeah! That lame-*ss speech is so cringey!\" said Wei Yan Er as she dramatically flailed around, as if her whole body was itching.</p><br/><p>Though that sort of speech was indeed a little too inappropriate in the real world, Captain Kang Na was greatly moved by Zhang Yang. \"That’s the kind of response I wanted to hear great warrior! You have the heart of a true fighter, brave and full of justice! Alright, based on the information you have collected, that magic circle has to be the transportation mechanism that the demons had constructed! No wonder the number of monsters will never go down! They would keep replenishing their numbers!\"</p><br/><p>The captain wavered a little. \"This would be too dangerous. The situation has escalated to a whole other level. If the demons had set their base here, they could easily transport a large army and plunge Oz into a never-ending chaos! We have to move out now! We have to destroy the portal!\"</p><br/><p>‘Ding! Captain Kang Na has a quest for you: Sortie. Will you accept it?’</p><br/><p>Without a second thought, Zhang Yang and his fellow members accepted the quest. They were all left dissatisfied, however, not being able to kill the boss.</p><br/><p>[Sortie] (Difficulty Level: A)</p><br/><p>Quest Description: Assist Captain Kang Na in destroying the demon’s portal! Time waits for no man. The longer you wait, the stronger the demons will be! You have to make haste!</p><br/><p>Progress: Destroy the Demon’s Teleportation Circle 0/1</p><br/><p>Quest Reward: Summoned Soldier</p><br/><p>[Summoned Soldier] (Usable)</p><br/><p>Use: Summons 1 Elite Soldier of the Ravine of Cayote to assist you in battle! Last for 10 minutes. Cost 1,000 gold piece for every summon.</p><br/><p>Charges left: 3/3</p><br/><p>Level Requirement: 70</p><br/><p>Bound upon acquire.</p><br/><p>No wonder they could not defeat the boss earlier! Knightmare was the guardian of the magic circle! It was a quest-based boss! If the boss could be killed without accepting the quest, there would have been no point making a quest all around it!</p><br/><p>Captain Kang Na lead four foot soldiers out of the camp and call out to Zhang Yang and his party. \"Adventurer! It’s now or never!\"</p><br/><p>He then summoned a grey horse for himself. The other foots soldier followed and summoned their own horses. When his followers were ready, Captain Kang Na gave a ‘hiyah!’ and rode off. Zhang Yang and his party did the same and followed Captain Kang Na with their own specific mounts. The party rode for 20 minutes and arrived at the demon’s territory. Unlike Zhang Yang, Captain Kang Na did not choose to hide himself and had barged into the large encampment. With his huge battle axe in hand, the captain went on a killing spree like a true war general.</p><br/><p>D*mn! This Gray-Silver NPC is so violent!</p><br/><p>The party did not stop for even a second. With haste, the party had arrived at the center point of the camp and proceeded into the pillar-like castle. Since it had not been 5 hours, all the elite monster inside the castle had not yet respawned, providing the party a free flow to the center of the castle and to the stone hall with the magic circle.</p><br/><p>Captain Kang Na stopped the party from proceeding, and spoke to Zhang Yang. \"Adventurer, I need your help in dealing with the demons. My soldiers and I will need some time to destroy the magic circle!\"</p><br/><p>\"Roger. Leave the demons to us!\" Zhang Yang thumped his chest.</p><br/><p>\"Let’s go!\" Zhang Yang led the four ladies to face Knightmare for the second time.</p><br/><p>Without wasting a second, Captain Kang Na and his soldier went around the magic circle to do something that Zhang Yang had no clue about. His only wish was that they could, at the very least, stop the monsters from appearing from the portal.</p><br/><p>Zhang Yang turned to Sun Xin Yu and Wei Yan Er. \"I need the both of you to fight together. Don’t waste time, leave that snow b*tch to the healing!\"</p><br/><p>Han Ying Xue immediately rolled her eyes and sighed heavily. \"Dummy! Do you really want to work me to death?\"</p><br/><p>In truth, it was not too difficult for Han Ying Xue to heal two more players in the same time. Priests always excelled at mass healing. Still, it was a troublesome situation.</p><br/><p>On the other side of the battle, Captain Kang Na and his soldier had seemed to stop the portal from summoning monsters. It helped them wonders!</p><br/><p>90%...80%... with everyone chipping in their strength, the boss HP was dropping down at a tremendous speed.</p><br/><p>In the heat of battle, Zhang Yang had received a sudden call from Hundred Shots. \"Zhan Yu! There’s a problem with the Mining Cave!\"</p><br/><p>\"What’s wrong?\" Zhang Yang asked. The Mining Cave was one of the guild’s \"gold mine\". With a large number of excavation going on in these few days, the amount of mineral mined from the Mining Cave was able to accommodate the guild members request, and had increased the Territory Defense Level to Level 2! There was so much surplus that it was all placed in the Little Merchandize Shop to be sold! The profits were never as lucrative as the Territory itself, as it required players to constantly mine the minerals in the cave. However, it couldn’t be dismissed, since they could at least farm close to 1,000,000 gold coins worth of mining every day! That was the reason why Zhang Yang had paid close attention to Mining Caves.</p><br/><p>\"There’s this guy who claims to be Yan Er’s cousin brother! He said that he deserves to mine in the cave and wants to send some players in!\" said Hundred Shots, with great uncertainty.</p><br/><p>Zhang Yang was stunned. \"Is that guy’s IGN iLuvHanYingXue?\"</p><br/><p>\"That’s right!\"</p><br/><p>What a loser! That f*cking *sshole actually dared to show his face at the Mining Cave! If his face could get any thicker, he would be asking for a share in the Thunderstorm Castle!</p><br/><p>\"Ignore that wanker! If he dares to do anything, kill his sorry *ss!\"</p><br/><p>\"Understood!\" said Hundred Shots without any objection. He sounded eager. Perhaps, Luo Yang Ming had went overboard with his arrogance and had pissed off Hundred Shots. Since he had claimed to be someone from Wei Yan Er family tree, Hundred Shots had been holding back. However, now that he had gained the approval from Zhang Yang himself, Hundred Shots could unleash his arrows!</p><br/>\n</div>"}