{"title": "Chapter 313: The Darkness", "id": 313, "volume": 4, "url": "http://boxnovel.org/mmorpg-rebirth-of-the-legendary-guardian-chapter-313-the-darkness", "volume_title": "Volume 4", "body": "<h1>Chapter 313: The Darkness</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 313: The Darkness</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>According to the battle record, it was Florick’s {Chain Lightning} skill. After striking the current target, it would jump to the next target for a total of three times. Each strike caused 10,000 Nature Damage.</p><br/><p>\"Damn it, is this boss a physical-type or a Spellcaster? Why does it know all kinds of skill?!\" Lost Dream complained.</p><br/><p>Florick’s {Chain Lightning} undoubtedly increased the workload for Han Ying Xue. This time, the bewitching queen did not have time to joke around and tease them with any of her obscene moans, but instead shouted in desperation, \"Hurry up, kill the boss, I’m exhausted!\"</p><br/><p>\"HAHA! Your money is mine! Is mine!\" Florick laughed cynically.</p><br/><p>Zhang Yang could not help it, but laughed and said, \"B*tchy Snow, I think this boss, Florick and you make a good match! If both of your greediness were combined, nothing can possibly match up to it!\"</p><br/><p>\"En, exactly, cousin is very greedy!\" Wei Yan Er nodded her head again and again.</p><br/><p>\"Yan Er, do you want to experience what it’s like being homeless tonight?\" Han Ying Xue threatened Wei Yan Er.</p><br/><p>Wei Yan Er immediately changed her tone and spoke seriously to Zhang Yang, \"Noob tank, how could you insult my lovely cousin?! My cousin is so smart, generous, beautiful, honest, kind and cute… Wu wu wu, I can’t take this anymore! I’m done! I’m telling the world's biggest lie, I will be going to hell in the future!\"</p><br/><p>\"Sh*tty brat!\" Han Ying Xue snapped.</p><br/><p>In spite of Florick’s wide array of skills, Zhang Yang was still able to get a good grip on the boss’ aggro. Han Ying Xue may be complaining, but it was mostly because she was lazy. Sun Xin Yu and the rest of the team had strong attacking power, thus, Florick was quickly overwhelmed. He fell within seven to eight minutes.</p><br/><p>\"I’m going to whack you to death!\" Wei Yan Er attacks got faster and wilder in the heat of the moment.</p><br/><p>\"No! I still have so many treasures and I haven’t used up all of them yet! I need to raise my 37 wives and children!\" Florick uttered a despairing cry. Little brat used {Killing Cleave} to wipe out Florick’s last drop of HP. Florick fell defeated and a copper coin rolled out of his hand. Desperately, he reached out and tried to catch the copper coin, however, his body lost strength as his arm stretched out halfway.</p><br/><p>\"My money…\" Florick breathed his last.</p><br/><p>Florick dropped two pieces of Yellow-Gold equipment, eight pieces of Gray-Silver equipment, a few pieces of cloth, some coins and ETC.</p><br/><p>Wei Yan Er was disappointed and asked, \"Where did Florick hide the money he stole from us?\"</p><br/><p>Zhang Yang picked up a bag under the ETC category and threw it to Wei Yan Er and then grinned, \"Will you be greedy next time?!\"</p><br/><p>[Florick’s Money Bag]: All of Frolick’s fraudulent claims are hidden in this bag, you are going to be rich!</p><br/><p>Wei Yan Er suddenly burst out with laughter and quickly opened up the money bag. There was actually around 100,000 gold coins in the money bag and it was divided up nicely for the players. However, Zhang Yang did not buy any fake equipment from Florick, so he actually earned an extra 10,000 gold coins or so!</p><br/><p>Zhang Yang laughed and said, \"I like this boss!\"</p><br/><p>\"Not us!\" the rest of the people disagreed in unison.</p><br/><p>\"Quickly, distribute the equipment, this is a time limited quest!\"</p><br/><p>Hundred Shots was always the cautious one.</p><br/><p>[Forsaken Sting] (Yellow-Gold, Dagger)</p><br/><p>Weapon Attack: 464-664</p><br/><p>Attack Interval: 1.8 seconds</p><br/><p>DPS: 314</p><br/><p>Equipment: When the target is struck, there is 1% chance of interrupting target’s spell casting.</p><br/><p>Level Requirement: 70</p><br/><p>\"Although it is even faster than the 1.9 second interval you usually see, it’s too small to make a difference. While, the main point is this is Level 70 Yellow-Gold weapon,\" Zhang Yang turned to the two Thieves in the party, \"It is definitely better than you current main attack weapon!\"</p><br/><p>Sun Xin Yu and Lost Dream rolled. Fortuna1 had blessed Lost Dream and he won the [Forsaken Sting]. Before the dagger is identified, its attributes would worse than a Level 60 weapon. So, Lost Dream just kept the dagger in his inventory first.</p><br/><p>[Boots of Sorrow] (Yellow-Gold, Leather Armor)</p><br/><p>Defense: +24</p><br/><p>Vitality: +235</p><br/><p>Strength: +94</p><br/><p>Dexterity: +217</p><br/><p>Level Requirement: 70</p><br/><p>Because of the existence of set equipment, they wouldn’t spare any such equipment a second glance unless they were Level 80 Yellow-Gold equipment. Therefore, the boots were directly thrown into Zhang Yang’s inventory, fated to be sold in Zhang Yang’s Little Merchandize Shop.</p><br/><p>A Gray-Silver Servant!</p><br/><p>[Servant: Codger Florick] (Gray-Silver)</p><br/><p>Use: Summons Codger Florick as your servant in battle. Lasts for 5 minutes. You can only summon one Servant at a time. Summoning any Servant will cause all other Servants to be in cooldown. Cool down time: 30 minutes.</p><br/><p>Level Requirement: 70</p><br/><p>Binds on obtain.</p><br/><p>\"This one isn’t bad, let’s request together. Whoever rolls the highest points will get this!\" Zhang Yang said.</p><br/><p>After rolling the dice, Han Ying Xue won the Servant. Conveniently, this would help offset her low attack power.</p><br/><p>Han Ying Xue immediately summoned the Servant. It was a red-skinned Beastman, which looked like Florick, only smaller in size. It held a big broadaxe in both of its hands. However, one wouldn’t feel threatened by him, but rather feel that he’s just a sneaky little urchin whose up to no good.</p><br/><p>Han Ying Xue laughed and posted her Servant’s skill description in party channel.</p><br/><p>{Stealing}: Steals from the target. There is 1% chance of stealing 1% of the target’s total number of gold coins. Skill range: 3 meters. Cool down time: 5 minutes.</p><br/><p>Everyone was speechless. Florick had turned from a con man to thief!</p><br/><p>After passing through this hall, there was still a corridor, and then a staircase that was connected directly to the third floor.</p><br/><p>\"No monsters?\" everyone came to the castle’s third floor but did not see any appearance of monster. All of them were surprised.</p><br/><p>\"That’s not possible. I’m sure there are Bandit-types in stealth mode!\" Zhang Yang said, \"Starlight, you walk in front!\"</p><br/><p>\"Sigh, am I fated to be the bait each time?\" Endless Starlight groaned, but otherwise obediently did as he was told.</p><br/><p>After they walked forwards for a few steps, a red-skinned Beastman suddenly emerged from the dark and smacked the back of Endless Starlight’s head with the hilt of its sword. Endless Starlight was stunned. The red-skinned Beastman wielded its two swords and madly slashed at Endless Starlight.</p><br/><p>Zhang Yang quickly used {Charge} and dashed towards the red-skinned Beastman without using {Provoke}. Zhang Yang was able to take over the red-skinned Beastman’s aggro by just slashing once.</p><br/><p>[Red-Skinned Lurker] (Elite, Humanoid)</p><br/><p>Level: 77</p><br/><p>HP: 77,000</p><br/><p>Defense: 400</p><br/><p>Bandit-type monsters were at their most dangerous during the first 10 seconds when emerging from stealth mode. Even so, they were poorly matched against tank! Zhang Yang pulled the monster, and all of them piled up and wiped the monster out.</p><br/><p>The massacre proceeded. Because they needed to deal with stealth-type monsters, their progress was slowed down. After about 40 minutes, they reached the hall on the third floor.</p><br/><p>There were two Red-Skinned Crushers at the doorway. After some thrilling but safe battles, both of the monsters crumpled to the ground.</p><br/><p>They opened up the two heavy doors, and everyone went into the hall.</p><br/><p>It was all dark in the hall!</p><br/><p>It was pitch dark in the hall!</p><br/><p>It was a room that measured to at least thousands of square meters. Other than the light coming out from the doorway, the hall was completely dark! It was completely silent, other than the footsteps!</p><br/><p>And when they stopped moving, their breathes and heartbeats took over the dead silence!</p><br/><p>Endless Starlight said, \"It’s really dark…\"</p><br/><p>\"Oh my god!\"</p><br/><p>\"You scared me!\"</p><br/><p>\"Shut your mouth! You scared us!\"</p><br/><p>The moment Endless Starlight started to talk, everyone had jumped, like dropping a stone into a calm lake.</p><br/><p>Zhang Yang laughed as he said, \"Starlight, you’re trying to say that it’s so dark that the boss could easily get the jump on us and we won’t be able to see a single thing, right?\"</p><br/><p>\"Yes! Exactly!\" Endless Starlight nodded his head again and again. But no one saw it, as it was too dark in the hall.</p><br/><p>\"Even if the boss standing in front of us, we wouldn’t know any better!\" Hundred Shots agreed.</p><br/><p>Shush!</p><br/><p>At this moment, a mass of phosphorescent light suddenly floated across their head. The emerald flame gave them highly limited visibility. The flame was not bright, but it was a like light bulb in this absolutely dark environment.</p><br/><p>The flame went off once every 10 seconds, flashing on and off, and everyone moved forward by using this weak glowing flame.</p><br/><p>\"Wait a minute!\" Zhang Yang suddenly stood still and turned around. Han Ying Xue, who was walking behind him, was not prepared and suddenly bumped into Zhang Yang’s arms.</p><br/><p>\"Stupid Yu, you are such a jerk!\" Han Ying Xue scolded in embarrassment.</p><br/><p>\"My bad! My bad!\" Zhang Yang immediately said, \"It should be nine of us, right?\"</p><br/><p>\"Noob tank, have you just graduated from primary school? You don’t even know how to count?!\"</p><br/><p>\"…You guys, quick, headcount, now?!\"</p><br/><p>\"1, 2, 3… 7, 8, 9!\"</p><br/><p>By using the light of floating emerald flame, everyone started to count up.</p><br/><p>\"Yes, yes, there are nine of us, stop being a soccer mom, silly Yu!\"</p><br/><p>\"…Little brat, did you include yourself?\"</p><br/><p>\"Of course… not!\"</p><br/><p>Everyone shivered in fear, ten of us?</p><br/><p>\"The boss is among us!\" Zhang Yang said.</p><br/><p>Shush!</p><br/><p>The will-o'-the-wisp flashed right then, revealing the ferocious and horrible face of a complete stranger!</p><br/><p>Zhang Yang shouted in surprised, and slashed at the boss.</p><br/><p>‘-1,433!’</p><br/><p>\"Urgh!\" a strange sound was uttered and they heard a low and hoarse voice saying, \"Damn it, that hurts! I’m not going to play around anymore! I will kill all of you!\"</p><br/><p>‘-3,774!’</p><br/><p>‘-3,824!’</p><br/><p>Damage texts floated across Zhang Yang’s head. Although the single damage was low, boss’ attacks were quite frequent and it attacked at almost each second, what a relentless rate of attack!</p><br/>\n</div>"}