{"title": "Chapter 314: Sightless Slayer Hazel", "id": 314, "volume": 4, "url": "http://boxnovel.org/mmorpg-rebirth-of-the-legendary-guardian-chapter-314-sightless-slayer-hazel", "volume_title": "Volume 4", "body": "<h1>Chapter 314: Sightless Slayer Hazel</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 314: Sightless Slayer Hazel</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Shush!</p><br/><p>Another flash of light floated across them, and this time, they finally read the monster's information.</p><br/><p>[Sightless Slayer Hazel] (Yellow-Gold, Humanoid)</p><br/><p>Level: 78</p><br/><p>HP: 7,800,000</p><br/><p>Defense: 1,400</p><br/><p>Everybody started to attack the boss.</p><br/><p>However, the hall was too dark. Besides, the doors had automatically closed when they started the battle, so they could see anything in the limitless and eternal darkness, let alone know which way they were facing!</p><br/><p>The emerald flame flashed again for a brief moment, before the hall became completely dark again. The melee attackers could still slash blindly, as long as the boss was not moving around. However, blind rangers were as good as no rangers!</p><br/><p>Hunters could still fire randomly in the dark and hope they hit something. However most of the Spellcasters’ attack spells required casting time, and in such a dark hall, if the boss disappears from Daffodil Daydream’s sight, the spell casting bar would be interrupted!</p><br/><p>\"How do we fight against this boss? We don’t even know where the boss’ position is!\" the three ranged attackers complained.</p><br/><p>Zhang Yang was groping in the dark, and when he felt the boss’ weapon collide with his body, he immediately retaliated. Luckily, the boss did not move around constantly like players would. After Zhang Yang got hold of the boss’ aggro, the boss wielded its two sharp swords and slashed at Zhang Yang nonstop. If the boss had been controlled by a player, the party would have been wiped out hundreds of times!</p><br/><p>Shush!</p><br/><p>The light flashed once again, and Hundred Shots and the other two ranged attackers quickly launched attacks without wasting the opportunity. Fire arrows and fire balls were randomly launched.</p><br/><p>Annoyingly, the light would flash for about three to four seconds only, so everybody had was blindly attacking most of the time! Luckily, they were in Party Attack mode so they did not have to worry about accidentally hurting their own team members.</p><br/><p>Although the dark environment had weakened the team’s attack power, as long as they had a strong tank and a healer, they still could slowly defeat the boss! It so happened that both Zhang Yang and Han Ying Xue were the strongest tank and healer in the server, respectively!</p><br/><p>After about a minute, Zhang Yang found himself slashing air! He was shocked and yelled, \"He disappeared!\"</p><br/><p>The party stopped attacking. Everyone was stumped. In total darkness, none dared move, fearing that they would step into a trap, or fall down the abyss if there was a sudden chasm.</p><br/><p>Zhang Yang immediately said, \"Everyone, come closer to me, hurry up!\"</p><br/><p>With their full faith in their longtime leader, everyone rallied to the sound of his voice.</p><br/><p>\"The boss is Bandit-type monster, it must have used {Vanish} just now! Do you guys still remember the Bandit-type bosses we’ve all fought against? Every time they emerge from {Vanish}, they will reset their aggro list! Later on, if any of you receive a sudden attack, do not fight back, let me pull the boss first!\" Zhang Yang commanded.</p><br/><p>About five to six seconds later, Han Ying Xue suddenly shouted, \"Ah!\" and they could see the Party column, Han Ying Xue’s HP was reducing dramatically!</p><br/><p>‘{Thunder Strike}!’</p><br/><p>Zhang Yang was never trained to fight in the dark, it was too difficult for him to rely on his hearing to identify the boss’ position! But {Thunder Strike} was an AoE skill, as long as the enemy was within the skill range, it would receive damage. This was the reason why Zhang Yang had told everybody to come closer to him!</p><br/><p>‘-756!’</p><br/><p>Although they could not see the boss’ shadow, a damage text appeared in the dark!</p><br/><p>\"Urgh! Damn! Damn you all! I just wanted to play hide and seek with you guys, why you guys are hurting me?! Why?!\" Hazel roared angrily, dashed towards Zhang Yang and slashed at Zhang Yang wildly.</p><br/><p>\"Hunters step 3 meters back for your minimum range. Daffodil Daydream, please sticks with the melee attackers so that we can change positions together. Everybody, try to surround him!\" Zhang Yang assigned tasks as he tanked the boss.</p><br/><p>Shush! Shush! Shush!</p><br/><p>The light flashed across them on occasion, but otherwise, their efficiency was greatly reduced when fighting in such a dark environment. Besides that, the boss used {Vanish} at random intervals, and attack indiscriminately whenever it revealed itself. Fortunately, Zhang Yang always caught hold of it before it could deal serious damage. Besides, everyone had good equipment, so they wouldn’t be killed off easily.</p><br/><p>It wasn’t a particularly powerful boss, but it was surely a difficult battle.</p><br/><p>‘Ding! Hazel has launched {Fan of Blades}!’</p><br/><p>A system notification echoed out, Hazel’s body suddenly burst out with countless flying sword of lights, which flew towards everyone’s directions.</p><br/><p>Many ‘-7,000’ damage texts floated across everyone’s head. Some of them even got hit twice, but with 17,000HP being the lowest maximum HP value of the party, none of them were killed.</p><br/><p>Hazel disappeared once again!</p><br/><p>Han Ying Xue quickly cast all sorts of healing spells such as {Healing Shower}, {Healing Bond} and {Holy Shield}.</p><br/><p>After fighting for so long, Zhang Yang had actually figured out Hazel’s battle pattern. Hazel would emerge from {Vanish} each time, within three to eight seconds!</p><br/><p>1, 2!</p><br/><p>Zhang Yang was counting in his mind, and activated {Vanguard's Aggression} protection barrier without hesitation!</p><br/><p>After the skill adjustment, the current {Vanguard's Aggression} protection barrier acted like an Aura which sets Zhang yang as the center and radiates by a 3 meters radius. Everyone’s HP was very low, even with Han Ying Xue’s strong healing, it was not possible for her to heal everyone’s HP up within such a short time. The boss could most likely kill its next target!</p><br/><p>Slash!</p><br/><p>Another three seconds later, Hazel emerged from the shadow, and used {Ambush} on Hundred Shots.</p><br/><p>‘-703!’</p><br/><p>‘-718!’</p><br/><p>Zhang Yang stomped on the ground and activated {Thunder Strike}, which caused damage to Hazel and immediately pulled back its aggro.</p><br/><p>Hundred Shots let out a sigh of relief and said, \"Good thinking Zhan Yu! I wouldn’t have survived that!\"</p><br/><p>Endless Starlight quickly said, \"Uncle Hundred Shots, don’t forget about me! I’m a strong tank as well!\"</p><br/><p>\"Starlight, you are only slightly less perfect than Zhan Yu!\" Hundred Shots quickly said.</p><br/><p>\"How am I not Zhan Yu’s equal?\"</p><br/><p>\"…\"</p><br/><p>Endless Starlight was definitely a competent tank, whenever the boss disappeared, Endless Starlight would cast {Devotion} among the crowd as the boss would receive damage whenever it appears nearby. At the same time, Endless Starlight could also pull the boss’ aggro immediately. Although {Devotion}’s total damage was high and it could last for 10 seconds, it was no match for {Thunder Strike}, so Zhang Yang always successfully pulled over the boss’ aggro.</p><br/><p>Zhang Yang said, \"My gut feeling is that Endless Starlight would be on the list if there is any China’s Top 10 Tanks or a Top 10 List of Godly Magicians in the future!\"</p><br/><p>Endless Starlight immediately laughed happily.</p><br/><p>\"Then I must be the king of Top 10 Berserkers!\" Wei Yan Er was being boastful.</p><br/><p>Zhang Yang laughed out loud and said, \"Little brat, I’m not sure whether will you listed in Top 10 Berserkers but someone among us must be the queen of Top 10 healers!\"</p><br/><p>\"Stupid Yu!\" Han Ying Xue was flustered.</p><br/><p>Luckily, Endless Starlight had also learnt {Vanguard's Aggression} protection barrier, and Zhang Yang’s {Rearm} would reset all his skills’ cool down times, so they would be able to use three count of {Vanguard's Aggression} protection barrier within a short period time. On the other hand, Hazel launched {Fan of Blades} at each 20% of HP loss. When Hazel was left with 20% of HP, it finally killed a player with the combo of {Fan of Blades}, {Vanish} and {Ambush}.</p><br/><p>However, Hazel was fated to indecently assault afterwards!</p><br/><p>14 Minutes later, Hazel uttered a horrible scream and fell defeated.</p><br/><p>\"You guys are too fierce, I just wanted to play hide and seek with you guys!\" Hazel breathed its last.</p><br/><p>The dark hall suddenly brightened after Hazel died. It seemed that he was the source of the darkness.</p><br/><p>\"We finally defeated the boss!\"</p><br/><p>Everybody let out a sigh of relief, while Han Ying Xue used {Redemption} spell on the unlucky Fatty Han to save him.</p><br/><p>\"How many floors are there?\"</p><br/><p>Zhang Yang thought for a while and answered, \"I think there are four levels, we should be on the second last floor already!\"</p><br/><p>\"Let’s distribute the equipment!\"</p><br/><p>Looting from the boss’ corpse was still the most exciting part of a boss fight.</p><br/><p>Wei Yan Er immediately ran to the corpse to pick up the loot.</p><br/><p>[Immortal Necklace] (Yellow-Gold, Necklace)</p><br/><p>Vitality: +59</p><br/><p>Strength: +30</p><br/><p>Dexterity: +30</p><br/><p>Equipment: Increases chance of Critical by 1%.</p><br/><p>Level Requirement: 70</p><br/><p>\"This is good!\" Zhang Yang nodded and immediately gave up his roll, as this necklace was more suitable for physical-type attackers.</p><br/><p>The team threw their dices. Fatty Han won the necklace with highest points.</p><br/><p>[Stinger Gloves] (Yellow-Gold, Leather Armor)</p><br/><p>Defense: +24</p><br/><p>Vitality: +118</p><br/><p>Strength: +47</p><br/><p>Dexterity: +109</p><br/><p>Level Requirement: 70</p><br/><p>Although this was a Level 70 Yellow-Gold equipment, it was definitely the best leather armor for Level 70 players. However, the Thieves and Hunters in the team were unwilling to part with their set equipment effects. Thus, this glove was fated to be sold in Zhang Yang’s Little Merchandize Shop.</p><br/><p>Zhang Yang nodded, and thought to himself, \"No wonder set equipment in the future would get so scarce! The effects were too strong.\" for example, this Level 60 Yellow-Gold set equipment is actually able to support players up to Level 80. Even then, Level 80 set effects aren’t that much better!</p><br/><p>As a result, level 70 equipment would be most likely skipped over.</p><br/><p>\"By the way, let’s go out tomorrow!\" Fatty Han suddenly sent a private message to Zhang Yang.</p><br/><p>\"Why?\"</p><br/><p>\"Speed dating!\"</p><br/><p>Zhang Yang almost fell over and asked, \"Are you really seeking for a spouse?\"</p><br/><p>\"He he, I just registered on the website, and coincidentally, there is a big speed dating event. Let’s have a look tomorrow!\"</p><br/><p>\"Why ask me then?\"</p><br/><p>\"I feel embarrassed, going alone!\"</p><br/><p>Zhang Yang scratched his head and said, \"You are so thick-skinned, but you are actually scared of going on a speed dating event? I’m really speechless!\"</p><br/><p>\"Damn, we are brothers for life. Are you helping me or not?!\"</p><br/><p>\"Alright, alright. Pick me up tomorrow!\"</p><br/><p>\"Tomorrow, 7.00 pm, wait for your Highness to drop by!\"</p><br/><p>\"Get lost!\"</p><br/><p>Hazel did not drop any great equipment, despite being a Yellow-Gold boss. However, Hazel was merely a mini-boss in Blood Moon Castle. The great equipment should be dropped by the final boss, Red-Skinned Beastman Lord Pilo!</p><br/><p>Everybody continued moving forward and reached the fourth floor in castle.</p><br/><p>The type of minions had changed to guards which carried shield. Under the team’s strong attack power, the shields hardly made any difference and they were torn apart in no time.</p><br/><p>There was an iron cage in the middle of the hall in which a female elf with white dress was held prisoner. The female elf had a graceful, slender body shape but had a massive rack, and her soft and silky long hair went straight down to her buttocks.</p><br/><p>Zhang Yang took a look at the profile on top of the head of female elf, and he nearly burst out laughing!</p><br/><p>This female elf was Merlinda - Song of the Forest!</p><br/><p>She was a captive in Underground Tower and Sacred Palace of Frozen Fractal. Here she is now, captive in Blood Moon Castle!</p><br/><p>This NPC had a knack of getting caught, somehow! She’s a specialist!</p><br/><p>\"You guys… Zhan Yu! Praise the Moon God, she sent a warrior to save me!\" Merlinda saw everyone, especially after she saw Zhang Yang, and she instantly revealed an extremely relieved expression.</p><br/><p>The crowd was surprised. Although all of them communicated with NPCs every day, low grade NPCs did not have \"memories\", and they could only communicate with the players by the preprogrammed script. However, advanced NPCs had such advanced AI that it was difficult to distinguish them from players.</p><br/><p>Zhang Yang moved forwards and asked, \"Merlinda, why are you here?\"</p><br/><p>\"I have found the Elves’ Staff of Treasury Prophecy and assigned my people to deliver it back to Holy Land of the Elf Athuran in Chaos Realm. Who knew that our Elder unexpectedly believed that I’m the next Priestess of the Moon appointed by Moon God and told me to go back to Holy Land of the Elf to inherit the position itself! But when I was passing here, I was captured by this bunch of Red-Skinned Beastmen!\" Merlinda looked at Zhang Yang and said, \"My warrior, you must save me!\"</p><br/><p>\"Tsk, stupid Yu, this pretty girl NPC seems to be interested in you!\" Han Ying Xue seemed to be slightly unhappy.</p><br/><p>\"…You’re jealous of an NPC?\"</p><br/><p>\"Whose jealous?! Hmph!\"</p><br/><p>This pitiful Merlinda, anyhow she should already be upgraded to a Yellow-Gold boss, why is she still getting captured by others?</p><br/><p>Zhang Yang nodded as he said, \"Do not worry, we will get you out of here!\"</p><br/><p>Merlinda trusted Zhang Yang and nodded confidently as she said, \"The key to unlocking this cage is with Beastman Lord Pilo. You guys must defeat him to get the key!\"</p><br/><p>‘Ding! Your relationship with Merlinda is now improved!’</p><br/><p>Inexplicably, Zhang Yang received a system notification.</p><br/>\n</div>"}