{"title": "Chapter 317: Alchemist's Intuition", "id": 317, "volume": 4, "url": "http://boxnovel.org/mmorpg-rebirth-of-the-legendary-guardian-chapter-317-alchemists-intuition", "volume_title": "Volume 4", "body": "<h1>Chapter 317: Alchemist's Intuition</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 317: Alchemist's Intuition</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>The instant when Pilo died, the 36 elite guards vanished in a puff of smoke at the same instant, and the assaults were put to an end, leaving everyone with great relief.</p><br/><p>\"Quickly, let’s see what the boss dropped for us!\"</p><br/><p>Anyone would be crazy about the loots of a Violet-Platinum boss, so everyone was a little excited about it. They circled around the dead body of the boss. Poor boss, not only he was shot in the knee, but he also had to bear the humiliation of being studied like a exhibition showpiece after his death!</p><br/><p>The first thing they managed to recover from the loots was a dark key, known to be used to open up shackles that were specially designed to special characters such as Merlinda.</p><br/><p>The second trophy they recovered from their victory was a piece of [recipe] for a specific profession.</p><br/><p>[Recipe: Alchemist's Intuition]</p><br/><p>Usage: Teaches you Alchemist;s Intuition.</p><br/><p>Require: Professional Alchemy.</p><br/><p>Bound upon picking up.</p><br/><p>\"Why is it bound upon picking up!\" Zhang Yang could not help but to grind his teeth, because if not, he could have given this recipe to Yu Li for her to learn the skill. But now, only one of his party members could claim it now!</p><br/><p>And among the entire party, he was the only one that is a Professional Alchemist!</p><br/><p>Only he would gain something out of it.</p><br/><p>\"Silly Yu, is that good?\" Han Ying Xue was asking him while blinking her large eyes.</p><br/><p>Zhang Yang patted the recipe on his chest and acquired the skill, and then he posted the description of the recipe onto the party channel.</p><br/><p>[Alchemist's Intuition]: Every time when you craft a potion, there is a certain rate that the crafted potion will transmute, adding a new effect upon it’s initial effect. There are 10 levels of transmutation in total, the higher the level of the transmutation, the better the additional effect will be, ranging from 10% to 100%.</p><br/><p>\"Wow! This skill is awesome!\" Everyone was caught by surprise!</p><br/><p>But Zhang Yang was smiling bitterlyy, because he initially intended to delete Alchemy profession and pick another profession that would be more suitable for PvP. This sudden acquisition got him good, forcing him to abandon his initial thoughts! He shook his head again and again and complained, \"Looks like I’m forced to craft some potions now and then now, huh?\"</p><br/><p>\"Haha, generosity will always be rewarded!\"</p><br/><p>\"Holy god, you guys are just going to sit there, waiting to get free potions from me, right?!\" Zhang Yang gave out a breath of sigh. After he masters [Alchemist’s Intuition], he would instantly become a god-like being in his profession, not only could he no longer delete his current profession, he would also need [Herbalism] to enhance his profession further!</p><br/><p>Players who were focused on [Herbalism] tended to be lower leveled, but high-level potions required high-level herbs, so he could only rely on himself!</p><br/><p>He should just give up on [Smithing] then, since he picked that profession only for the [Shield Blueprint] in the Level 10 dungeon in order to be able to earn an initial amount of gold in the beginning of the game! Now that his earnings from his territory and the Little Merchandize Shop are on track, he no longer needed it.</p><br/><p>[Boots of Brutality] (Violet-Platinum, Heavy Armor)</p><br/><p>Defense: +80</p><br/><p>Vitality: +282</p><br/><p>Strength: +189</p><br/><p>Agility: +81</p><br/><p>{Unidentified}</p><br/><p>Required Level: 80</p><br/><p>\"Little girl, you just struck jackpot!\" Zhang Yang threw the pair of boots to Wei Yan Er.</p><br/><p>But Wei Yan Er was shaking her head about and said, \"I want [Armor Set]!\"</p><br/><p>\"Armor Set, your head!\" Zhang Yang flicked his finger against the shiny forehead of Wei Yan Er and said, \"Do you think [Armor Sets] come raining from the skies? Don’t be so d*mn greedy. Plus, these boots are not bound upon equipping, just take it for now and use it first. When you get your new [Armor Set] later, you can sell these boots for money!\"</p><br/><p>Wei Yan Er gave some thoughts about it for a while, and did as he said, with a joyous smile.</p><br/><p>\"I know all of you are waiting for [Armor Sets], but don’t get your hopes up too high, after level 80, [Armor Sets] come as rare as they go! Violet-Platinum grade is one level higher than Yellow-Gold grade. One piece alone would already surpass the [Armor Set] of your Yellow-Gold stuff!\" Zhang Yang spoke straight to the point, \"When we start exploring level 80 maps, you’ll find that your level 60 Yellow-Gold sets would be good up till Yellow-Gold bosses, but once we meet a Violet-Platinum boss, it would be doom, for us all! The battle with Polo just now was just an appetizer! The defense of the boss was as high as 2,400, so what can those baby Yellow-Gold equipment do to it?\"</p><br/><p>The gang nodded in realization. Things had been going too well for them these days, and they had been steamrolling through bosses without a hitch, giving them a sense of misguided invincibility, thinking that they could reach the sky with a single bound and switch all their Level 60 Yellow-Gold [Armor Set] to all Level 80 Violet-Platinum [Armor Set] equipment!</p><br/><p>[Spiky Helmet] (Violet-Platinum, Leather Armor)</p><br/><p>Defense: +48</p><br/><p>Vitality: +564</p><br/><p>Strength: +161</p><br/><p>Agility: +378</p><br/><p>{Unidentified}</p><br/><p>Required Level: 80</p><br/><p>This time, the two thieves and the two hunters were tossing for points to compete for the equipment, and by the end of it, Hundred Shots won, with 91 points.</p><br/><p>[Ring of Beastman's Ancestor] (Violet-Platinum, Ring)</p><br/><p>Vitality: +141</p><br/><p>Use: Releases the soul of the Beastman’s ancestors, inflicting massive damage to the enemies, lasts for 10 seconds. Cool down: 24 hours. When equipped with this ring, the player will be cursed by the soul of Beastman’s ancestor, and cannot remove the ring for 24 hours.</p><br/><p>{Unidentified}</p><br/><p>Required Level: 80</p><br/><p>After coming across the ring, everyone was looking into each others faces. Although the description stated that it could inflict massive damage to enemies, that value was not specified. Other than having the attribute of vitality, there were no other attributes on the ring. Also, the cool down of the item effect is as long as 24 hours! What’s even more unacceptable was that the cooldown and the binding shared the same duration - 24 hours! After the 24-hour cool down, are you going to take it off or use it again?</p><br/><p>Dilemma!</p><br/><p>Lost Dream said, \"It better be powerful, or else it’s a shitty deal to have it stuck on you for 24 hours!\"</p><br/><p>\"Let’s toss for points to decide who has it!\"</p><br/><p>Zhang Yang outrolled them all with a total of 89, successfully keeping the ring. As it is, rings that only add vitality points were far more useful for tankers to have.</p><br/><p>[Gaunlets of Peaceful Soul] (Violet-Platinum, Cloth Armor)</p><br/><p>Defense: +16</p><br/><p>Vitality: +282</p><br/><p>Intelligence: +189</p><br/><p>Spirit: +81</p><br/><p>{Unidentified}</p><br/><p>Required Level: 80</p><br/><p>Daffodil Daydream and Han Ying Xue tossed the dice. However, Han Ying Xue was out of luck this time and the item was taken by Daffodil Daydream.</p><br/><p>The boss dropping a total of 4 pieces of Violet-Platinum equipment in one shot. It was considered to be a highly generous act already! Other than that, there were also other nine peices of Yellow-Gold equipment, and all of the equipment were distributed among them all one by one. The remaining equipment pieces that were not wanted by anyone of them were tossed at the Little Merchandize for sales. Out of it all, Zhang Yang obtained a pair of boots.</p><br/><p>[Blazing Defensive Boots] (Yellow-Gold, Heavy Armor)</p><br/><p>Defense: +40</p><br/><p>Vitality: +134</p><br/><p>Strength: +54</p><br/><p>Agility: +27</p><br/><p>{Unidentified}</p><br/><p>Required Level: 80</p><br/><p>\"Let’s go, off to rescue the lady priestess!\"</p><br/><p>The gang went back to the forth floor of the castle, when Merlinda was pleased to see the return of Zhang Yang, her face lighting up. \"Zhan Yu, are you holding up fine?\"</p><br/><p>\"What a bias NPC, we had also fought so hard, but she only concern for Zhang Yang alone!\" Fatty Han was pouring out his grievance.</p><br/><p>It was all because Zhang Yang was the one who triggered Merlinda’s dialogue in the first place, so she would only have eyes for him!</p><br/><p>Zhang Yang smiled lightly and said, \"I’m alright, and we can actually get you out of here, right now!\"</p><br/><p>He took out the key and unlocked the prison door, and Merlinda immediately walked right out from the prison chamber with her white dress that looks bright and clear, and she looked just like a goddess of the moon, her beauty unmatched in the entire world.</p><br/><p>‘Ding! You have completed a quest: Rescue the Priestess of Moon, acquired 1,000,000 experience points! Quest duration: 4 hours 36 minutes 58 seconds, quest appraisal: Perfect! The result has been added into the appraisal of the Main Story Linking Quest!\" Everyone received the voice notification from the system, but they did not receive any rewards immediately after, obviously they had not completed the final part of the quest yet.</p><br/><p>\"Now, let us take leave of this forsaken place!\" Merlinda told the gang.</p><br/><p>{Hair Dryer} could only be used once, furthermore, it can only teleport players into castle, not out of the castle. So the gang could only fight their way towards the exit of the place. It was actually a good thing since they could actually harvest more experience points on their way out. After another three or four hours, they arrived at the outside of the castle.</p><br/><p>But it did not mean that they had escaped yet!</p><br/><p>The Blood Moon Castle is surrounded by a tall castle wall all around, and there were many Magic Cannons placed right on the wall. Therefore, one cannot simply climb to the top of the wall and jump over, the fall would kill them!</p><br/><p>--- they had to locate the main gate before getting themselves out of there!</p><br/><p>\"Zhan Yu, we must destroy every single one of the Magic Cannon if we plan to get out of here in one piece! Or else, these Magic Cannons will blow us to smithereens!\" Merlinda turned over to Zhang Yang.</p><br/><p>‘Ding! Merlinda has given you a quest: Destroy the Magic Cannons, accept or decline? This quest is linked to the Main Story Linking Quest, complete the Main Story Linking Quest to acquire luxurious rewards!\"</p><br/><p>What else to think about it? Of course they’re accepting it!</p><br/><p>[Destroy the Magic Cannons] (Quest difficulty: A-rank)</p><br/><p>Description: Destroy 32 Magic Cannons on the wall of Blood Moon Castle, create conditions for a safe escape from Blood Moon Castle!</p><br/><p>Completion: Destroyed Magic Cannon 0/32</p><br/><p>Going up along the stairs to the top of the castle wall, the gang began to sweep through the monsters in the clockwise direction. They also hacked the Magical Cannons to pieces that they encountered along the way.</p><br/><p>The number of the monsters on castle wall was far more higher than the number of monsters within the castle, and all of them were elite-grade, brutal and deadly! But at the same time, they also had the super healer Merlinda at their side, who healed 5% of their health every second! That was totally unbelievable!</p><br/><p>Furthermore, the {Higher Regeneration} of the NPC affected multiple targets at the same time like an AOE effect. With just a gentle lift of her hands up, everyone was buffed with a {Higher Regeneration}, healing once in every 30 seconds, and players with higher health points were having the time of their lives, being healed by percentages!</p><br/><p>\"Witchy Snow, seems like you need to get a boob job! She’s outhealing you, outboobing you too!\" Zhang Yang teased her.</p><br/><p>Wei Yan Er immediately took the opportunity to tease Han Ying Xue as well, \"That’s right! It’s not like yours are really that much bigger than everyone else, so stop feeling happy about yourself all day and night!\"</p><br/><p>Han Ying Xue obviously took great pride in her perfect pair, so she glared at both Zhang Yang and Wei Yan Er and said, \"You two are just saying that the grapes are sour because you can’t have it, just envy on! I’m not going to fall for it!\"</p><br/><p>With the healing support of {Higher Regeneration} from Merlinda, Zhang Yang had no fear at all! With a few gentle pats on the Whitey’s head, he charged right into the horde and began to slash like crazy! {Horizontal Sweep}, {Blast Wave} were activated one after another, activating the special effect of his [Dark Enigmatic Sword]!</p><br/><p>Now that he mounted onto his [Mount], boosting his health points to exceed 60,000, and the {Higher Regeneration} healed him by 3,000 health points every time, and with the addition of Han Ying Xue’s healing, he had become truly undefeatable! As he basically steamrolled over the monsters, the gang arrived at the position of the first Magic Cannon without much effort. From there, they began to destroy the Cannon!</p><br/><p>Endless Starlight looked upon Zhang Yang with envious eyes and he said, \"I must get a [Mount] for myself as well!\"</p><br/><p>For a tanker, the damage boost from having a [Mount] was not that important, the real uttermost importance was the massive boost in health points, giving tankers a massive boost on their survival ability!</p><br/><p>[First Level Magic Cannon] (Item)</p><br/><p>Level: 1</p><br/><p>HP: 1,000,000</p><br/><p>Defense: 1000</p><br/><p>Zhang Yang and Wei Yan Er joined hands and stacked their {Cripple Defense} onto the cannon to bring down the defense of the Magic Cannon down to 500 points. Then, the gang laid waste to it! The 1,000,000 health points of the cannon was no match at all with the assaults of the gang. In just a few moments, the Magic Cannon was turned into a pile of scrap metal!</p><br/><p>Zhang Yang could not help but to think, \"If only these Magic Cannons could be brought back to the Thunderstorm Castle, they would have been a great addition to the territory’s defense!\" There are only three Magic Cannons on the walls of Thunderstorm Castle, they’ll quickly be overrun by a force large enough. If it weren’t for Zhang Yang’s [Friendship Jade] back then, Thunderstorm Castle would have been completely leveled down to the ground!</p><br/><p>\"Hehe, never thought that you would be so sensitive towards money and gold!\" Wei Yan Er patted Zhang Yang’s shoulder.</p><br/><p>It was actually called putting material resources to good use, and the little hypocrite was actually calling him out for something she was known for herself! Zhang Yang shook his head again and again, and finally said, \"Let’s keep moving forward!\"</p><br/><p>Although there were numerous elite monsters appearing along their way, however, under the terrifying advance of the gang, every single one of the monsters quickly fell! One Magic Cannon, two Magic Cannons, three Magic Cannons... 30 Magic Cannons, 31 Magic Cannons!</p><br/><p>At last, they had arrived in front of the final Magic Cannon on the wall. They got to work.</p><br/><p>\"Intruders, stop it right there! Now!\" a thunderous roar was heard, and they saw was a large dragon flying over them, a shadow suddenly jumped from the back of the two-legged dragon, ascending down from the sky. The blazing light behind the shadow was so blinding as if the light was coming out from a raging sun. The party was forced to shield their eyes.</p><br/><p>Boom!</p><br/><p>The shadow descended with a loud bang, and a red-skinned, imposing, giant of a beastman appeared right by the upside of the Magic Cannon. The beastman had a shield in its left hand and a long spear in its right, with a set of metallic heavy armor on the entire body, which rattled, due to the aftershock of its violent landing.</p><br/><p>[Soldier Captain Slane] (Yellow-Gold, Humanoid Creature)</p><br/><p>Level: 80</p><br/><p>HP: 8,000,000</p><br/><p>Defense: 1,500</p><br/><p>\"Who are you people? How bold of you to trespass into the territory of the Blood Moon Castle and have your way there?\" Slane was shouting in rage. And when his sight was set upon Merlinda, he frowned and asked, \"How did you get out of there? Pilo that imbecile, he just wouldn’t listen, insisting on having some sort of wedding! What a joke! If it were up to me, I would have simply ended you on the spot and be done with it! All the cubs are born the same!\"</p><br/><p>The boss spoke in a very barbaric manner, and the pretty ladies were all blushing in embarrassment. Meanwhile, Fatty Han was left with his jaw slack, and he muttered, \"Well, damn! That’s what I call an idol to be looked up upon! Straight to the point, I like it!\"</p><br/><p>\"You barbaric beastman, today you shall pay for all your insolent acts!\" Merlinda pointed at Slane while talking in a huffed manner.</p><br/><p>Although she had not yet officially become the Priestess of the Moon, but she definitely had the stature of being one soon, standing tall and regal!</p><br/><p>\"Hahaha, since you have escaped, that would only mean that imbecile Pilo is already dead!\" Slane held up his spear with a firm grip and let out a big laugh, \"Very well, from now on, I am the new King of the Red-Skinned Beastmen! I declare, that you intruders must all die! As for you, my noble priestess, you shall become my woman and give birth to a child of god, for me!\"</p><br/>\n</div>"}