{"title": "Chapter 337: Buying Time", "id": 337, "volume": 4, "url": "http://boxnovel.org/mmorpg-rebirth-of-the-legendary-guardian-chapter-337-buying-time", "volume_title": "Volume 4", "body": "<h1>Chapter 337: Buying Time</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 337: Buying Time</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Krishan immediately turned from being a green-named NPC to a red-named boss monster! Meanwhile, he gained two extra effects on him.</p><br/><p>[Twisted Heart]: Attack increased by 1000%, immune to all damage, last for 30 minutes.</p><br/><p>[Arrogance]: Movement speed reduced by 50%, however, recover 10% movement speed for every guard dying in battle, last for 30 minutes.</p><br/><p>30 minutes of invincibility, game-breaking attack, reduced movement speed. The main idea of the quest was clear: Buying Time! Let’s not talk about Zhang Yang for the moment, the system is fair and will not allow any players to have the chance to slack while doing a quest, not even in a quest that requires hundreds or thousands of players to complete, no player shall be able to take advantage of any quests!</p><br/><p>Meanwhile, the five elite guards were granted an additional effect {Pursue} on each of them, having their movement speed increased by 100%, lasting for 30 minutes!</p><br/><p>Zhang Yang turned around and began to run! He ran around the fountain and began to play ‘hide and seek’ with the five elite guards. The five monsters were the ‘keys’ in keeping the restriction on Krishan’s movement speed, so he should not even kill any single one of them! Or else, Krishan would regain his regular speed, destroy Zhang Yang!</p><br/><p>The five guards were pursuing Zhang Yang closely, while Khrishan headed towards Meryl.</p><br/><p>Zhang Yang was shocked to see Krishan walking towards Meryl. Immediately he jumped into the fountain pool and began to swim towards Meryl as well.</p><br/><p>\"Found it!\" just when things were getting tense, Meryl suddenly found the switch and she shouted with excitement, ‘Ka! Ka! Ka!’, the bottom of one statue suddenly cracked right open, and right in front of Meryl was a secret passage. The entrance of the passage was extremely small and tight, it seemed that only one person could go in.</p><br/><p>\"Go in!\" Zhang Yang cried frantically. This was one instance where his combat prowess would not be of any use at all.</p><br/><p>\"There’s no water in the passage, I can’t get in!\" Meryl looked at Zhang Yang hopelessly.</p><br/><p>--- a mermaid’s tail will only transform into a pair of legs when there is no water at all, and the passage was completely dry!</p><br/><p>Zhang Yang had already swam to the side of Meryl, so he picked her up on his back and began to squeeze into the passage with her.</p><br/><p>\"You imbeciles, go get them back to me at once!\" Khrishan roared at his guards.</p><br/><p>\"Yes Sir. Khrishan!\" All five of the guards quickly squeezed themselves into the passage one after another, pursuing Zhang Yang and Meryl.</p><br/><p>Zhang Yang was carrying Meryl on his back while Whitey was following them from behind. The passage was not as dark as he expected as there were numerous blue gemstones adorning the passage walls. Even in the dark, the slight glow from the gemstones gave Zhang Yang limited visibility.</p><br/><p>After walking forward for tens of meters, the passage began to widen. It was about 4 meters broad and 2 meters high at the moment, and it was enough for a person to sprint forward without hesitation or worries on crashing into the sides while running!</p><br/><p>The footsteps behind Zhang Yang’s back could be heard very clearly, the boots of their heavy armor stepping on the solid ground of the passage, the grinding between the soles of their boots and the sands on the ground causing continuous sharp and clear crisps, echoing throughout the passage. As the echos were getting more and more mixed up, it eventually got difficult to differentiate whether the sounds were coming from the front or the back!</p><br/><p>Zhang Yang turned his head around for a peek, and he saw the five guards holding torches, hundreds of meters behind them!</p><br/><p>As he was carrying Meryl, his movement speed was down to only 80%. He may not feel the weight, but his movement speed had definitely gone down. It was just a matter of time before those guards caught up on them!</p><br/><p>Zhang Yang was not too worried about the five guards, but he could not kill any of the guards or else the restriction on Krishan’s movement speed will be lifted and he really steamroll over him by then!</p><br/><p>Didn’t the description of the quest mention that there were traps in the passage? About time they showed up now!</p><br/><p>Zhang Yang continued running forward while looking around for any possible clues. He ran for another tens of meters and finally, he saw a handle by the wall in front of him.</p><br/><p>[Trap Handle] (Item)</p><br/><p>Level: 1</p><br/><p>HP: 1</p><br/><p>Defense: 1</p><br/><p>Zhang Yang had no time to hesitate, so he went up to the handle, reached his hands on the handle and pulled it down with his strength!</p><br/><p>Ka ka ka!</p><br/><p>A stone door smashed down onto the ground from the top of the passage with a loud ‘bang’, blocking the five guards just when they were about to catch up with them. Their fingers were almost reaching Meryl’s hair, before the door shut down for good!</p><br/><p>[Defensive Stone Door] (Item)</p><br/><p>Level: 1</p><br/><p>HP: 1,000,000</p><br/><p>Defense: 1,000</p><br/><p>This door should be able to hold the five guards for awhile here, but if Krishan arrives, the stone door would go down when the big man starts punching it!</p><br/><p>As Zhang Yang was moving forward, he saw numerous suspicious glowing pupils approaching. As they got closer, Zhang Yang quickly realized that these actually belonged to huge gray rats, each of them the size of a cat! They were lurking in the dark with their shining, bloodthirsty pair of eyes, giving Zhang Yang a chill down his spine!</p><br/><p>[Sewer Rat] (Normal, Beast)</p><br/><p>Level: 75</p><br/><p>HP: 7,500</p><br/><p>Defense: 70</p><br/><p>Although they were just normal monsters, their numbers were huge! Zhang Yang saw the seemingly countless rats with his bare eyes and knew that he would not be able to take them all at once!</p><br/><p>\"Ah --- rats!\" Meryl was instantly shocked and let out a scream, and she slapped on Zhang Yang’s shoulder continuously as she tried to lift herself higher up on Zhang Yang.</p><br/><p>\"Of course I see them!\" Zhang Yang shouted in annoyance and he put Meryl down. Then he pulled out his sword and activated his {Blast Wave} --- he could not enter combat as he was carrying a person on his back.</p><br/><p>Shoof!</p><br/><p>A wave blasted out, and in the narrow passage, the {Blast Wave} washed up all the available areas within the passage, going out as far as a distance of 3 meters!</p><br/><p>The rats were huge in size, which are about 20+ cm in length and they were tightly packed together in the passage. Up to a thousand rats could be within the space of the 3-meter area!</p><br/><p>{Blast Wave} was only limited by distance, and nothing else. Not the amount of targets, or if they were being blocked by others!</p><br/><p>Instantly, approximately thousands of ‘-723’ appeared at the same instant and the special effect of the [Dark Enigmatic Sword] was triggered. Furthermore, the special effect of the sword was triggered as rapidly as the firing of a maching gun!</p><br/><p>‘-723!’</p><br/><p>‘-723!’</p><br/><p>‘-723!’</p><br/><p>...</p><br/><p>Zhang Yang was blinded by the damage values that were appearing in front of him, he could only see countless ‘-723’ bombarding his view sight on the screen. If this scenario happened in an older online game, the game could have crashed or players could have been disconnected due to technical errors!</p><br/><p>After at least one minute, the numbers finally stopped flashing up. Zhang Yang could only see a sea of dead rats in front of him, with a relatively small number of rats still alive.</p><br/><p>Ji ji ji!</p><br/><p>The remaining rats were letting out their raging screech and ganged up on Zhang Yang.</p><br/><p>As the cool down of the {Blast Wave} had ended, Zhang Yang threw another {Blast Wave} at the remaining rats, and it was another spectacular scene where damage values danced in the screen!</p><br/><p>After the second wave attack, only dozens of rats survived!</p><br/><p>Zhang Yang laughed out loud and activated his {Horizontal Sweep} and {Thunder Strike} onto the remaining rats, clearing out every single one of them!</p><br/><p>These rats did not drop anything, however, Zhang Yang looked at his experience bar, it actually increased by more than a grid!</p><br/><p>Holy god! One should know that after reaching Level 70, a player would have to grind for at least 10 days to be able to gain 1 level, and one grid of the experience bar required one solid day in reality to fill up, which meant 3 days and 3 nights of game-time of non-stop grinding. And now, Zhang Yang had just achieved all that in slightly over a minute!</p><br/><p>Are there any other methods that were better and faster than this?</p><br/><p>The special effect of the [Dark Enigmatic Sword] was like a bug when it came to blasting enemies out in AOE style while grinding!</p><br/><p>The large number of rats were initially spawned at the spot to block players when the NPCs that were pursuing them were blocked by the stone door. If players could take out all the rats, then they can continue to move forward; but if the five guards broke the stone door before the players could defeat all of the rats, the quest would have likely ended up in failure!</p><br/><p>But no one had thought that the [Dark Enigmatic Sword] would be so powerful, and the rats were also being very ‘cooperative’, squeezing themselves in a tight area of space. Further more, the {Blast Wave} was an AOE that inflicted damage across all targets within the area of it’s effect range. With all these 3 conditions together, a miracle where Zhang Yang acquired 10% experience points within one minute became real!</p><br/><p>It was so satisfying for Zhang Yang!</p><br/><p>So now, Zhang Yang could only hope for more similar traps ahead of them, the more, the better now!</p><br/><p>After turning his head back for a peek, he saw that the remaining health points of the [Defensive Stone Door] was still at 920,000! Zhang Yang quickly widened his steps while running forward.</p><br/><p>After running for about 3 to 4 minutes, suddenly, Zhang Yang heard a loud and thunderous ‘bang’ coming from behind, and the crowded sounds of footsteps began to continue again! Zhang Yang knew that it must be Khrishan, he must have arrived at the stone door. Any obstacles would become a piece of thin paper apparently, when Krishan arrives!</p><br/><p>But Zhang Yang had already got himself at least a 3 minute gap!</p><br/><p>The second handle had appeared right in front of Zhang Yang.</p><br/><p>Pulling it down!</p><br/><p>Boom! The stone door dropped down and the path was blocked. It also had a similar 1,000,000 health points and 1,000 defense points!</p><br/><p>Ji ji ji! Countless sewer rats were approaching from the front gushing towards Zhang Yang.</p><br/><p>But in his eyes, these countless rats were oddly cute, maybe it was because of the countless experience points!</p><br/><p>{Blast Wave}!</p><br/><p>Another spectacular scenario presented itself, with the countless damage values jumping up and down on Zhang Yang’s sight view on his screen. It was visible that Zhang Yang was gaining experience point in a very swift manner, and he gained another 12% of experience points on his experience point bar!</p><br/><p>Zhang Yang turned to Meryl, and he could not help but to think about losing her after delaying for 29 minutes and giving up on the quest, and then he could restart the quest all over again to take advantage of the experience points by repeating the same process all over again! But it did not seem possible and it was not right to do so. Although Meryl was just a normal-grade NPC at the moment, the quest description had stated that her father is the king of the Merfolks, and her mother was a princess of the Merfolks! She would most definitely be equipped with a sophisticated AI, which meant that she will definitely remember if you ever did something to provoke her!</p><br/><p>Meryl felt embarrassed after being looked upon by Zhang Yang with that weird look, so she spoke shyly, \"Warrior, please don’t look at me with that kind of eyes!\"</p><br/><p>Zhang Yang laughed while moving forward with her on his back, and at the same time, he began to speak nonsense, \"You’re so pretty that the sun stayed quiet with your presence!\"</p><br/><p>Meryl actually bought it, and her face turned red immediately as she blushed. His words was super effective on her, she then rubbed and pinched her face with her hands and shook around without a pause, as if she was very happy but shy at the same time.</p><br/><p>After the second trap, it was the third trap, then the forth trap, then the fifth trap... The seventh trap!</p><br/><p>A stream of golden light shined upon the entire body of Zhang Yang, and he was elevated up to Level 76 in a magnificent scene!</p><br/><p>He felt so satisfied!</p><br/><p>However, it was time for him to say goodbye to this fortune he was earning while running away with Meryl. Both of them saw a light source in front of them, and as they were approaching it, the light source was enlarged, and by the end of it, was the exit of the passage, apparently.</p><br/><p>Splash!</p><br/><p>Enormous waves were stirring up, Zhang Yang and Merul came out onto a half-round platform with Whitey following them closely. On the platform, the three directions were the sides of the cliff around the platform while a lake loomed below them!</p><br/><p>Splash! Splash! Splash! Countless Snake Eel monsters emerged from the surface of the lake and began to roam around in the lake, the number was shockingly enormous!</p><br/><p>Zhang Yang then turned to Meryl, \"Meryl, I’m putting you into the lake, you can just wait in the lake until your father arrives. Then you will truly be safe!\"</p><br/><p>\"No---\" Meryl quickly responded and used her two long and white arms to hug Zhang Yang tightly by his neck, \"Those Snake Eels are the worst enemies of the Merfolks, they will definitely tear me into pieces if I go down into the lake now!\"</p><br/>\n</div>"}