{"title": "Chapter 331", "id": 331, "volume": 4, "url": "http://boxnovel.org/mmorpg-rebirth-of-the-legendary-guardian-chapter-331", "volume_title": "Volume 4", "body": "<h1>Chapter 331</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 331: Going up Ghastly Mountain</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>The second match, Sun Xin Yu versus Blooming Ichor!</p><br/><p>Both of them had fought against each other before and now they were meeting each other in the battle arena once again. Their gazes locked, furious and grudgingly! However, the resulting, endless match made people extremely angry and bored as when there is match between Thieves, they will only play hide and seek with each other!</p><br/><p>Still, Sun Xin Yu was more skillful and she successfully caught Blooming Ichor after some time. After two to three attacks, Blooming Ichor’s HP bar had become empty instantly!</p><br/><p>Zhang Yang’s gang won another match!</p><br/><p>The third match, Wei Yan Er versus Lonely Tree.</p><br/><p>Lonely Tree was the Thief who defected from Sunset Amber to Imperial Sky. Previously, he was the main Thief in Sunset Amber and now he was apparently doing well, developing and growing rapidly in Imperial Sky.</p><br/><p>Wei Yan Er hated traitors the most, especially due to her personal experiences. Her full might was brought out upon her opponent!</p><br/><p>Based on both of their strength, both of them were equally matched. But Wei Yan Er drank a Mobility Potion and blew up Lonely Tree’s combo. The little brat hacked at him madly with her big broadaxe and the pitiful Lonely Tree was terribly traumatized.</p><br/><p>Zhang Yang’s gang won three matches in a row!</p><br/><p>The fourth match, Daffodil Daydream versus Venshi!</p><br/><p>Venshi also had a traitor label on top of his head, he was the main Spellcaster in Radiance. During their match back then, he apparently goofed around and caused their team to lose deliberately to Imperial Sky in the Soaring Swords competition!</p><br/><p>Both of these Spellcasters chose to be Pyromancers, so the both of them fired blazing fireballs at each other, flames danced in the wind and warped the air as they entered the battle arena and fought with a most extravagant display, unlike that of fireworks. In terms of the performances of their matches, the audiences enjoyed watching this match the most!</p><br/><p>Both of them were skillful, constantly running out of the maximum skill range to interrupt each other’s spell casting bars.</p><br/><p>As more high-ended players broke through the Level 60 bracket, one after another, Yellow-Gold equipment had become very common. Although Lone Desert Smoke block-booked a few Yellow-Gold bosses, there were a lot of area maps which were above Level 60. A lot more bosses for everyone else. Both spellcasters were equipped with Yellow-Gold equipment from head to toe!</p><br/><p>The slightest bit of advantage would tip the balance!</p><br/><p>Daffodil Daydream had the additional advantages from Zhang Yang’s transmuted potions, medicines and even the [Fountain of Life]!</p><br/><p>After some intense fighting, Daffodil Daydream successfully defeated Venshi and scored another point for Silky Soft team!</p><br/><p>4–0!</p><br/><p>Sky and Ocean Electronics team was on the brink of elimination!</p><br/><p>There were seven duels and one point for each duel; two points for party matches. Whichever team that got five points first would not need to fight for the rest of the match!</p><br/><p>One Sword Stroke finally appeared in the battle arena for the important fifth match!</p><br/><p>Lost Dream versus One Sword Stroke.</p><br/><p>“Silly Yu, do you think Lost Dream can win this?” Han Ying Xue was not asking out of concern for the loudmouthed chatterbox, but for herself. She was hoping that she would not have to fight afterall, being the lazy woman that she is.</p><br/><p>Zhang Yang thought about it and replied, “In terms of skill, Lost Dream is on par with One Sword Stroke, but Assassins have always been an ill-fit against Guardians.</p><br/><p>“I think Lost Dream could win this!” Wei Yan Er said, for the sake of arguing, and nothing else.</p><br/><p>“If you say that Lost Dream can win, then he shall win this!”</p><br/><p>“…”</p><br/><p>At last, Lost Dream lost the match!</p><br/><p>Lost Dream performed as expected of a first class Assassin, executing his skills and combos with precision and perfect timing. Still, he fell short of finishing off the hunk of corroded iron, and was beaten down. There was nothing for him to be ashamed of.</p><br/><p>4–1, Sky and Ocean Electronics team finally scored a point!</p><br/><p>The sixth match, Hundred Shots versus Tobacco Breath.</p><br/><p>Tobacco Breath was a Templar who had rarely appeared in battle arenas! Hundred Shots, being wary about this unknown opponent, failed to grab any present opportunities and was taken out!</p><br/><p>4–2!</p><br/><p>Han Ying Xue was forced to fight for the seventh match.</p><br/><p>Her opponent was her old enemy, Fire Fountain!</p><br/><p>Fire Fountain was shocked when he saw Han Ying Xue, what an unfortunate match-up, why does he have to face this super healer once again?!</p><br/><p>Although Han Ying Xue had no sense of direction, she did not forget faces easily. She looked intently at Fire Fountain. Suddenly recognizing him, she waved her hand and said, “Oh, it’s you!”</p><br/><p>Fire Fountain was shaken to the core, as this super healer had already caused psychological trauma to him in their previous clash! Fire Fountain’s lips twitched and he shouted loudly, “Let’s start the fight, cut the bullsh*t!”</p><br/><p>The battle had started!</p><br/><p>History could only repeat itself!</p><br/><p>Although Fire Fountain attack power was strong, Han Ying Xue healing power was even stronger. She threw {Putrefying Poison} on Fire Fountain and kept on spamming healing spells on herself as if she was fighting an NPC.</p><br/><p>The pitiful Fire Fountain wanted to cry as Han Ying Xue stood rooted to the ground, casually throwing DoT skills on him, while healing herself. She did not even glance up at his incoming attacks, only intently gazing at her own MP bar! It was ridiculous! The worst part of it all, was that he could not damage her one bit! Her healing completely counteracted every move he threw at her! Fire Fountain was eventually overwhelmed by DoT effects, which was a humiliating way to go!</p><br/><p>The current PvP was different compared to the previous PvP in the open world, they were currently being spectated by thousands of people. Fire Fountain was going to be the biggest joke of the year!</p><br/><p>Why does it have to be me?!</p><br/><p>Fire Fountain could only rage within himself, as his HP slowly, inevitably went down!</p><br/><p>5–2!</p><br/><p>Silky Soft team successfully defeated Sky and Ocean Electronics team and also obtained the first victory of the competition!</p><br/><p>There was another ongoing match for the S-Class Professional League, which was the match between Crimson Rage’s Crimson team and Breaking Dawn’s Shun Feng team.</p><br/><p>This match was more intense as they scored 4–3 for the first seven duels and entered the final party match. Lastly, the female army defeated Shun Feng team by exerting outstanding performance and great teamwork. The final score was 5–4!</p><br/><p>However, Silky Soft team won with the score of 5–2 and their net win points were two points ahead of Crimson team, therefore, Silky Soft team took the first position.</p><br/><p>Everyone was jubilant after Imperial Sky’s defeat as the relationship between both of these guilds, had never improved one bit ever since the attacks on each others castles.</p><br/><p>After Zhang Yang left battle arena, he was immediately teleported back to Rolling Rock Canyon and continued chiseling away at the rock monsters.</p><br/><p>After smashing the monsters for a while, a golden light flashed on Zhang Yang’s body and he rose to Level 75!</p><br/><p>That really took a long time!</p><br/><p>After so many days, Zhang Yang had collected 786 [Rock Cores]. Victory was almost there.</p><br/><p>Two days later, on the 3rd of February, Zhang Yang had finally gathered all the [Rock Cores]. He went back to the bottom of Ghastly Mountain, to the magic circle in Fountain of Life.</p><br/><p>Zhang Yang threw five stacks of [Rock Cores] into the magic circle and he immediately received a notification from the system.</p><br/><p>‘Ding! You have completed the quest: The search for a new source of energy!’</p><br/><p>‘Ding! Magic circle have activated!’</p><br/><p>F*ck, this mission was so hard and no rewards were given at all, the system was really stingy!</p><br/><p>Zhang Yang grumbled to himself as he activated the teleportation portal.</p><br/><p>A dazzling white light suddenly appeared. The teleportation portal seemed to be waking up from slumber. Lights and color danced before his eyes, the captivating scene lightening his mood up by a slight bit.</p><br/><p>Once Zhang Yang entered the portal, the scenery in front of him changed and he appeared in another cave! The cave was not too deep and there was a way out about ten meters away from him. The weather was sunny and fresh, a contrast difference from the gloomy weather at the bottom of the mountain.</p><br/><p>Is this where he’s supposed to be?</p><br/><p>Zhang Yang walked out from the cave and saw that he was halfway up the floating part of Ghastly Mountain. The sun struck the land here, unhindered by the clouds below it.</p><br/><p>Zhang Yang got on Whitey and quickly rode out of the cave.</p><br/><p>“Human?” a rasp voiced out. A batman which hung from a tree suddenly flew down and glided towards Zhang Yang. The batman stretched out its 10 razor sharp fingers and reached out!</p><br/><p>[Ghastly Mountain Elite Batman] (Elite, Humanoid)</p><br/><p>Level: 76</p><br/><p>HP: 76,000</p><br/><p>Defense: 400</p><br/><p>Zhang Yang calmly lifted his sword and met the batman’s clash.</p><br/><p>“Aack…” as they fought halfway, the batman suddenly screeched loudly, threatening to deafen Zhang Yang! His ears really hurt this time! The scenery in front of Zhang Yang instantly turned black, and Zhang Yang could not help it but put both of his hands on his head.</p><br/><p>‘Ding! You have been affected by the Ghastly Mountain Elite Batman’s ear-piercing screech effect, you will not be able to control your own movements for three seconds!’</p><br/><p>This was no different from the stunning effect, only that they were named differently!</p><br/><p>‘-1,342!’</p><br/><p>‘-1,408!’</p><br/><p>The elite Batman used this chance to slash at Zhang Yang madly with its sharp claws.</p><br/><p>Three seconds later, Zhang Yang immediately counterattacked and the Batman was hacked to death.</p><br/><p>Zhang Yang looked across, and saw a lot of Batmen hanging from big trees, similar to how actual bats did! If the Batman did not have the {Ear-Piercing Screech} skill, Zhang Yang could have kited a few of them and finish them all at once with the special effect of the [Dark Enigmatic Sword].</p><br/><p>With {Ear-Piercing Screech}, these monsters could stun Zhang Yang perpetually, until his death!</p><br/><p>To play safe, Zhang Yang had to clear the monsters one by one!</p><br/><p>Zhang Yang patted Whitney and continued moving forward. He killed each monster that flew down from the tree. Despite the roundabout method, he only used about three hours to reach a huge altar.</p><br/><p>A stone statue stood in the middle of the altar, standing at about 10 meters tall, it had the shape of a Batman and a pair of huge wings extended from its back. Both its legs were slightly bent, like it was about to spring up from the ground. The Batman statue held a dark spear. Zhang Yang looked carefully and found out that the spear was a real spear, and red lines flowed through it.</p><br/><p>There was a basin at the bottom of the statue, where dried blood caked the surface. It had not been used for a long time!</p><br/><p>Zhang Yang was not sure if the bloodstains came from animals or humans! Either way, Batmen ingested red blood, wherever it came from!</p><br/><p>Suddenly, two Batmen flew down and glided to a nearby altar. As Zhang Yang was in the blindspot, they did not notice him immediately.</p><br/><p>“What a waste, the female human we captured last few days ago has escaped! Otherwise, the ancestor could have been resurrected!” one of them croaked.</p><br/><p>“That’s right, we still need the blood of a virgin with extreme ‘Yin’ physique. Our ancestor would then break free from the seal and lead us a new age, instead of hiding in this little mountain! Damn it, how could such a weak human escape from here?” the other batman hissed.</p><br/><p>“The human weakling does not have wings, she can will not be able to evade us for long. Unless she falls to death, there’s no way she can leave this floating mountain alive!”</p><br/><p>“En, let’s continue looking for her!”</p><br/><p>The two Batmen flew away.</p><br/>\n</div>"}