{"title": "Chapter 343: The Ghost Captain", "id": 343, "volume": 4, "url": "http://boxnovel.org/mmorpg-rebirth-of-the-legendary-guardian-chapter-343-the-ghost-captain", "volume_title": "Volume 4", "body": "<h1>Chapter 343: The Ghost Captain</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 343: The Ghost Captain</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>The Crimson-Gold Crab’s main attraction point was that its color was extremely pleasing to the eyes. Perhaps it was because Zhang Yang was reminded of the color of blood. Han Ying Xue was clearly delighted at the sight of it. She quickly took a [Sealing Leash] out and used it on the crab.</p><br/><p>The little crab was shocked. Like a real-life crab, it actually tried to run away when Han Ying Xue approached the little critter.</p><br/><p>23%...36%...45%...Pak! Fail.</p><br/><p>\"That’s 100 gold coins wasted away!\" cried Han Ying Xue bitterly as she took out another [Sealing Lease] and used it on the crab.</p><br/><p>17%...57%...89%...100% Success!</p><br/><p>This bloody woman’s luck is off the charts. She had managed to capture the little crab after two tries! Zhang Yang was feeling a little envious of her when it all changed into pitiful laughter when Zhang Yang tried to imagine how Han Ying Xue would sit on the crab, walking sideways. That being said, now that Han Ying Xue has arrived, she might as well joined Zhang Yang for a little killing spree. It would be nice to have someone healing him.</p><br/><p>The two of them proceeded deeper into the ship. Even though Han Ying Xue was slightly slower, Zhang Yang could go on further and take on monsters without Han Ying Xue needing to be present right on the spot during the battle. Zhang Yang had more than 80,000 HP! He could at least hold his own before help arrives. Before he ever got in danger, Han Ying Xue would already reach him and cast a simple {Heal} and a {Regeneration} and be on her way. Other than that, she could do nothing much and gain the share of experience points. The small party of two killed their way in and gained a decent amount of experience points, causing the little crab to almost reach Level 30! It was almost ready to be mounted!</p><br/><p>[The Reins of the Crimson-Gold Crab] (Yellow-Gold Battle Mount)</p><br/><p>Use: Summons or unsummons a mountable and battle-ready Crimson-Gold Crab. The Crimson-Gold Crab can travel both on land and in water, and grant you a 100% increase in movement speed. During underwater travel, the mount will grant the user the ability to breathe underwater. If you were to perish during a mounted status, the pet can be summoned again after 10 minutes. You can only have one active mount at a time. Casting time: 2 seconds.</p><br/><p>Level Requirement: 30</p><br/><p>Bound.</p><br/><p>The Crimson-Gold Crab was somewhat a jack of all trades. Its movement speed on land was not too fast, and it was not too slow in water. A jack of all trades, yet master of none. Still, Han Ying Xue was extremely pleased with her catch. After all, she had just obtained her first mount! A Yellow-Gold at that too! She was so happy that her smile was from ear to ear!</p><br/><p>The Crimson-Gold Crab had two skills. The first being the common {Shared Life} and the second one was {Sharp Claw}, which cause 100% melee damage to one target.</p><br/><p>When the crab had finally reached Level 30, Han Ying Xue had made herself comfortable on the crab and had started to ride it. Zhang Yang turned to witness the sight and laughed uncontrollably. Han Ying Xue raised an eyebrow and said, \"Dummy, do you really think that you’re cool when you’re riding a turtle?\"</p><br/><p>\"Well, at least I have style. While you…well…\" Zhang Yang burst into a huge laughter as Han Ying Xue kept quiet, finally realizing that her crab was walking funny.</p><br/><p>\"Hmph!\" She scoffed disgruntledly. \"This maiden simply likes to walk horizontally!\" Zhang Yang laughed even harder.</p><br/><p>With the mount taking her wherever she wanted to, Han Ying Xue movement speed was increased. Still, her speed could not match up with that of the turtle’s, but she never got left behind. With the growing level of the crab, Han Ying Xue was able to contribute a little bit of damage in battle. However, the damage was insignificant due to the level gap suppression.</p><br/><p>Without much time, the second floor of the ship was almost cleared. Until they reached the third floor, they came to a small room and saw a man dressed unlike that of a crew member. He was neatly dressed and was seen focused on scribbling something on a piece of paper. There were many compasses and measuring tools laid messily on the table.</p><br/><p>[Navigator Zuro] (Gray-Silver, Spectre)</p><br/><p>Level: 79</p><br/><p>HP: 790,000</p><br/><p>Defense: 400</p><br/><p>Without the help from Han Ying Xue, Zhang Yang could easily defeat this Gray-Silver tier boss with a few ulti skills. Now that he had Han Ying Xue with him, he could go wild. Within 3 minutes, Zhang Yang had reduced the boss to a pile of rotting bones, without breaking a sweat.</p><br/><p>The boss did not drop anything of value. If only the boss would drop a fragment of the Assembled Equipment, Zhang Yang would have gained some good Yellow-Gold equipment. However, the items that Zhang Yang picked up were all Gray-Silver and Green-Copper. All of those items were fated to end up in the Little Merchandize Shop.</p><br/><p>The party continued on and as the Crimson-Gold Crab grew, the faster the party proceeded. That being said, it would never match up to the Mythical Turtle! With haste, the party took on the third and fourth floor quickly and swiftly. The two of them had finally arrived to a rusty door, where the last boss awaited them behind it!</p><br/><p>The last boss was a short, middle-aged man. Although he was small in size, he was well built. Wearing the standard pirate outfit and hat, the most iconic symbol of a pirate captain was the iron hook on the left wrist of the man. The man was lounging at his desk with both of his feet on top of the desk. On the side of his old, rotting wooden chair was an opened treasure chest. He was jubilantly counting the gold coins pieces by pieces as he stacked them on the desk. As he counted, he tossed the coins back into the chest by his side. There was a extremely similar smile on his face that Zhang Yang could immediately identify.</p><br/><p>[Ship Captain Edward – Dunkirk] (Yellow-Gold, Spectre)</p><br/><p>Level: 80</p><br/><p>HP: 8,000,000</p><br/><p>Defense: 1,500</p><br/><p>Zhang Yang grinned and turned to Han Ying Xue. \"Woman, see that smile on his face. It’s exactly the same as yours!\"</p><br/><p>Instead of being mad of the insult, Han Ying Xue smirked and scoffed. \"Oh please. He’s not as beautiful as I am!\"</p><br/><p>\"…Narcissistic Queen!\"</p><br/><p>\"Excuse me, this maiden prefers the word confident!\"</p><br/><p>\"You know, I just realized this. Why did you start calling yourself \"maiden\"?\"</p><br/><p>\"Hmm. Listen here you swine. I am but a young maiden. Besides, I’d haven’t…you know!\"</p><br/><p>Oh my god. This woman is going to cause a whole lot more trouble…</p><br/><p>Fearing for what comes next, Zhang Yang quickly ignored Han Ying Xue and rushed towards the boss. \"Edward – Dunkirk! Give me all of your treasure!\"</p><br/><p>The boss’ area of aggro effect was huge. Zhang Yang had only stepped two or three steps forwards, and he had already noticed his presence and had lowered his fet from the table. Only when Zhang Yang had provoked Edward with his words, he slammed the desk and closed the treasure chest. He stood up frantically and swept all the gold coins on the desk into his pockets. He walked off the desk and pulled out a chipped saber from his waist and got into his combat stance.</p><br/><p>\"Ye’ be regrettin’ ye words, boy! Ay be chippin’ flesh before yer popped out from ye mommy’s womb!\"</p><br/><p>DING! CHIIING!</p><br/><p>Sparks flew when Edward’s sword clashed with Zhang Yang’s shield, even when they were underwater. Han Ying Xue was far from where Zhang Yang and the boss was. Instead of joining the fray herself, she stayed back to heal Zhang Yang from a good distance. Han Ying Xue was rather smart. Since the boss could possibly have one or many kind of AoE skills, it was best for her to observe the battle from a safe distance and enact her role as a healer properly.</p><br/><p>On the side note, her crab was only Level 58, it would not contribute to the battle much. The risk of her standing close to the boss to allow the crab to attack was not worth the damage!</p><br/><p>-7774!</p><br/><p>Edward – Dunkirk’s attack was strong. With a single, undefended attack, he could easily deal more than 8,000 damage on Zhang Yang, after all the damage reduction and absorption passives! Zhang Yang was a professional Guardian. He would not allow his {Block} to be wasted for even a second. Each {Block} was used right on time to ensure the maximum effective usage would be applied. Thus, within 6 seconds of battle, he had only taken 2 attacks!</p><br/><p>In 6 seconds, Zhang Yang would nullify roughly 15,000 damage. The boss DPS would be roughly at 2,500. This kind of attack would be nothing for Han Ying Xue to handle. Zhang Yang would not need to activate any defensive skills or use healing potions! Even though the boss HP was hellishly long, Zhang Yang could take his slow sweat time to grind him down to zero since Han Ying Xue, the super healer was by his side.</p><br/><p>\"Ye’ scoundrels! Damnation seize ye souls! Ar’ smash ye heads in!\" bellowed the boss in a fit of anger. With his left hook (hand) raised up high, a ceiling full of gold coins started to rain down!</p><br/><p>‘Ding! Edward – Dunkirk has used {Mountain of Treasure}!’</p><br/><p>Ding! Ding! Shuaaaush!</p><br/><p>Countless gold coins rained down upon them and quickly, the flood was practically flooded with gold coins. Quickly, the coins rose from the floor and had already reached to Zhang Yang’s and Han Ying Xue’s knee levels! Even though they were on mounts, the heavy metal that dropped from the sky had buried them deep in the sea of coins! The massive pressure of the coins had encased the both of them with only their heads popping out of the sea of coins! Neither of them could move!</p><br/><p>Wham!</p><br/><p>Taking the chance, the boss rushed towards Zhang Yang and attacked him furiously. Worried, Zhang Yang forcefully turn around, ignoring the boss just to check on Han Ying Xue.</p><br/><p>\"Hey! Dummy! Stop fighting! Quick, take the coins! Let’s fill up our inventory will all of these coins!\" Han Ying Xue was \"swimming\" among the coins, dipping her hands in the sea of coins.</p><br/><p>What a miser!</p><br/><p>Since their characters were trapped, Zhang Yang could not use {Block} and Han Ying Xue could not heal, and from over 80,000 HP, Zhang Yang took a great deal of damage and his HP was reduced down to half in just 10 seconds! Luckily, the skill {Mountain of Treasure} was not permanent. Once the effect duration ended, the coins in the room disappeared into thin water.</p><br/><p>\"No! Not my money! No!\" cried Han Ying Xue in despair. Angrily, Han Ying Xue turned to the boss and glared at him murderously. She went up front to the front lines and fired a {Punishment Ray} at him. \"You rotting piece of stinking pirate! Give me back my gold coins!\"</p><br/><p>\"…Woman please, at least heal me first!\" Zhang Yang screamed at her.</p><br/><p>Han Ying Xue was still puffing with rage. She glared at Zhang Yang and tossed a {Regeneration} and turned back to the boss. Gritting her teeth, she said, \"Dummy! Kill this boss and get this maiden’s money back!\"</p><br/><p>\"Erm…The money did belong to the boss…not you…\" said Zhang Yang awkwardly.</p><br/><p>\"Listen to me when I’m talking! This maiden’s money is this maiden’s money!\"</p><br/><p>\"Please stop using maiden this maiden that. No one talks like that anymore…\"</p><br/><p>\"Hmph!\"</p><br/><p>Edward’s skill, the {Mountain of Treasure} was considered to be an ulti skill that was capable of immobilizing every player for 10 seconds! If any other tank were to face the boss in place of Zhang Yang, they would surely have perished if they could not cast {Shield Wall} or {Sacred Protection} in time. On a side note, {Shield Wall} and {Sacred Protection} were two long cool down skills. If the boss’s {Mountain of Treasure} was cast every 30 seconds, how could any tank survive?</p><br/><p>Here’s where battle mounts came into play. They basically extended the HP of players, turning everyone into tanks, and tanks into - super tanks!</p><br/><p>If Mythical Turtle rarity was Green-Copper instead of a Violet-Platinum, the bonus HP granted would be at most 10,000! Even with his current equipment, Zhang Yang would face great difficulty in surviving the 10 seconds immobilization! That is why higher rarity battle mounts were extremely valuable!</p><br/><p>\"Non shall be taking me treasure, laddy!\" bellowed Edward again as he swung his sword menacingly at Zhang Yang, creating ripple of wave with each strike!</p><br/><p>Han Ying Xue had stopped attacking and was focusing on only healing Zhang Yang. Even though having a high maximum HP was beneficial in a battle, having 10,000 HP and 100,000 HP gave healers a lot of work! Han Ying Xue had been healing non-stop for sometime and had only managed to restore Zhang Yang HP to over 60,000!\"</p><br/><p>Slightly annoyed, Han Ying Xue complained begrudgingly. \"Dummy! Could you not have such beefy HP?! This maiden is tired of healing you!\"</p><br/><p>…</p><br/><p>\"If I did not have that much HP, we would both have been dead a long time ago, \"maiden\".\"</p><br/>\n</div>"}