{"title": "Chapter 347: The Search for Kent", "id": 347, "volume": 4, "url": "http://boxnovel.org/mmorpg-rebirth-of-the-legendary-guardian-chapter-347-the-search-for-kent", "volume_title": "Volume 4", "body": "<h1>Chapter 347: The Search for Kent</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 347: The Search for Kent</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>What kind of question was that? Clearly, Zhang Yang is not going kill him!</p><br/><p>Zhang Yang withdrew the blade that he had placed right at Schroeder’s neck. \"Sir. I bring you no ill intent. I am Kent Joseph’s distant relative. I have come back to Kalin on behalf of his father. I have to meet Kent. I will never believe it until I see his body!\"</p><br/><p>Schroeder got back to his feet and dusted off the dirt on his shirt. He got closer to Zhang Yang and asked curiously. \"You know Kent?\"</p><br/><p>\"Of course! I’m one of his nephews!\" Zhang Yang shamelessly established a close relationship with an unknown person. He did not even know how he looked like. Luckily, Wei Yan Er was not around, or else that little brat would be teasing him for the next few days.</p><br/><p>Schroeder faced darkened, \"Must you disturb the spirit of Kent?\"</p><br/><p>Zhang Yang gripped his sword. \"I do not believe that Kent would just die like that. Like I said, unless I see his body in this grave, only then I will believe that Kent’s soul has been taken by the gods!\"</p><br/><p>Schroeder sighed. There was a long moment of hesitation going on in his mind, which was reflected in his expression. \"You…Sigh…You’re right. Kent is not dead. Kent is still alive and breathing. That coffin beneath the earth is empty. There’s no need to dig it up.\"</p><br/><p>\"Was that why you didn’t want me to unearth it?\"</p><br/><p>\"Saved your time by explaining it, did I?\"</p><br/><p>Zhang Yang scoffed. He lowered his guard and asked. \"Why the secrecy?\"</p><br/><p>Schroeder sighed again. His expression was twisted between agony and extreme fatigue. It felt like he had grown much older in an instant. \"Young man, would you like to hear a story?\"</p><br/><p>Here it comes!</p><br/><p>Zhang Yang nodded his head. \"It is a young man’s honor to listen to the tales of the elder and experienced.\"</p><br/><p>\"Well said.\" Schroeder’s expression was slightly elevated. With a light smile, the man started his story. \"22 years ago, I joined the army. You must know, this place was a huge mess. The army I speak out would just be a masquerade for something else. A word used in bad taste. Mercenary, would be a better description for what we were doing since tens of towns paid for our cause. Those of us who joined the army were from poor families. We had to risk our lives for the sake of money! After I joined the army, I befriended Kent. He was a brave and mighty soldier. Unlike me, a man who fought for money, Kent was a man who truly wished to serve the nation and its people.\"</p><br/><p>\"We were brothers-in-arms. Together we had killed Spectres, exterminated monsters, defeated bandits, and had many more adventures! We had become even closer since. Roughly 20 years ago, Kent and I were investigating in a hidden village. There we found out that the village was being raided by a bunch of bandits. Both of us then proceeded to fight. Yet…I…\"</p><br/><p>There was a sudden Schroeder glint of rage in his eyes. His voice suddenly got louder. \"The bandits had masks covering their faces. At first, we didn’t care about it. After killing a few of them, Kent unmasked one of the bandits as they fought. It was then when we found the truth. The bandits that we had fought were our own comrades. The same comrades that we fought alongside, under the same banner!\"</p><br/><p>Schroeder smashed his fist on one of the tombstones. His forceful strike shattered the withered piece of cement. Schroeder did not waver. He even spat on the grave and continued. \"Once we discovered the truth, we went back to report about the situation. Yet, to our horror, we were attacked by those who we had called friends. We had just found out that the entire army was in it! They were all bandits in disguise! The bandits were the army! The army was the bandits!\"</p><br/><p>Zhang Yang had been quiet for the entire time listening to Schroeder rant. In his mind, he thought that having a family and friends who were both your allies and enemies. How could one’s life be so ironic?</p><br/><p>\"However, they had severely underestimated Kent’s strength. He single-handedly took down the entire army in Black Coal’s Sentry! Everyone at this post was killed! After the ordeal, we calmed down and had a serious discussion about reporting this matter. The problem was that the mercenaries were too wide-spread. They had already formed a strong stance in the hearts of the people. If Kent and I reported this matter to everyone, there will be war. A war so large that it would involve many casualties! Innocents will die! In the end, Kent decided to go anonymous. He hid his real identity and formed a small elite force to take down the Mercenary Leader Cazaro.\"</p><br/><p>Schroeder smirked. \"To help his cause, I made a fake grave and spread the rumor about his death. I had spread the fake news that we were ambushed by Spectres and I was the only survivor. No one but me knows about his well-being. This way, Cazaro cannot use Kent’s close relatives to threaten him.\"</p><br/><p>Zhang Yang had a little dilemma going on in his head. It was better for him to have Kent dead. Zhang Yang could simply be a grave robber and take the key fragment from this corpse and be done with it. Now that the story had turned out to be this way, a certain manhunt quest awaited Zhang Yang.</p><br/><p>Zhang Yang thanked the man and asked. \"Sir. Do you know where Kent is now?\"</p><br/><p>Schroeder gazed up to Zhang Yang and said, \"Can I trust you?\"</p><br/><p>Zhang Yang raised his right hand. \"I swear by the God of War, I am not on the side of Cazaro! For I am a seeker of justice and truth!\"</p><br/><p>Schroeder thought about it for a little while more and revealed the truth. \"In that case, I will take your word for it. My instincts tell me that you’re a trustworthy warrior! Kent is located at White Stone Hills. He has established a stronghold in the name of a small bandit. However, he has never robbed from the poor. In fact, he had specifically engaged in small battles with the mercenaries to weaken their forces. One more thing, Kent goes by the name of John Smith!\"</p><br/><p>\"You have my greatest appreciation, Mr. Schroeder.\" Zhang Yang bowed to Schroeder and left the place. He called to his bear and rode towards the west.</p><br/><p>After another long journey, Zhang Yang arrived at the steep edge of a large hill. At the hillside, there was a huge creek, measuring approximately 300 to 400 meters tall. There were a few large trees that had grown at the side of the entrance. Zhang Yang walked closer and could feel a cool breeze blowing out from the creek. Zhang Yang followed the trail and move up the hill. In just a few steps, there were two armed huge men ambushed him from a large rock. Without saying anything, the two men jumped at him and began to attack.</p><br/><p>[White Stone Looters] (Normal, Humanoid)</p><br/><p>Level: 81</p><br/><p>HP: 8,100</p><br/><p>Defense: 80</p><br/><p>They were only normal monsters in which Zhang Yang had no interest of wasting his time on. With no intention of fighting, Zhang Yang ignored the attackers and head straight on. The two attackers did not stop and followed Zhang Yang all the way up the hill.</p><br/><p>\"Intruders!\" cried three more attackers. They too, attacked Zhang Yang.</p><br/><p>If they were not any higher or equal to elite tiered monsters, Zhang Yang would not even draw his sword! He continued on.</p><br/><p>After a long journey up, Zhang Yang stumbled upon a large wooden gate. He destroyed it and entered the bandits' lair. Along the side of the pathway were clay houses. All the bandits that were \"residing\" in the houses came out to attack Zhang Yang. Naturally, Zhang Yang did not attack. Instead, he continued to play chase with them and had formed a long, 100-men or more \"train\" behind him.</p><br/><p>After a short while, Zhang Yang had to stop. There was a boss in his path!</p><br/><p>[Team Captain Afael] (Gray-Silver, Humanoid)</p><br/><p>Level: 81</p><br/><p>HP: 810,000</p><br/><p>Defense: 900</p><br/><p>Before attacking the boss, Zhang Yang turned around and attacked the oncoming wave of bandits.</p><br/><p>‘-0!’</p><br/><p>‘-0!’</p><br/><p>‘-0!’</p><br/><p>…</p><br/><p>Zhang Yang’s Defense was that of a bunker, naturally, the bandits were not able to deal any damage to him! Not even a single bit of damage was able to penetrate his defenses!</p><br/><p>{Horizontal Sweep}!</p><br/><p>A sea of over 5,000+ damage text popped out but did not reoccur. The attack did not trigger the Dark Enigmatic Sword effect.</p><br/><p>Zhang Yang shrugged. It happens sometimes. After the 1 second global cool down, Zhang Yang activated {Blast Wave}. Compared to {Horizontal Sweep}, {Blast Wave} attacks were not strong, however, its AoE range was much better and wider since it was considered to be penetrative! The more monsters, the rowdier it got, and the stronger the skill effect would be.</p><br/><p>Wham!</p><br/><p>More than 20 \"-1,093!\" damage text popped out with a few being Critical strikes. This time, the Dark Enigmatic Sword effect was triggered and blasted another wave of attack. However, it only triggered once.</p><br/><p>10 seconds later, Zhang Yang used {Horizontal Sweep} again, but it did not trigger the sword’s effect, until the fifth use of {Horizontal Sweep}, which dealt devastating damage to all.</p><br/><p>Zhang Yang had spent close to 5 minutes to deal with all the attackers. All in all, the Dark Enigmatic Sword effect trigger rate had definitely dropped!</p><br/><p>Zhang Yang frowned in frustration. Equipment with percentage trigger rate, such as the Dark Enigmatic 2% trigger rate, had a hidden setting behind it! The written trigger rate would only be in effect when the item level and the player’s level correspond to each other. However, when the player’s level starts to overshoot the item level, the item’s trigger rate will be forcefully dropped. The Dark Enigmatic Sword item level requirement was Level 60. From Level 60 and Level 70, the item trigger rate will remain the same. However, when Zhang Yang had surpassed the item level by a long shot, the trigger rate will drop! Right now, Zhang Yang guessed that the sword effect trigger rate would only be at 1% or less. After Level 90, it would be lesser than 0.5%!</p><br/><p>This had been set by the developers, to make sure that players would change their equipment at a faster pace. If they had not set it that way, a low-level item that had superior item effect could be used until late game!</p><br/><p>It was a real shame that the Dark Enigmatic Sword could not carry Zhang Yang a little further. This sword was a mass killing machine. Looks like, by all means, the sword could only last until Zhang Yang reaches Level 90 before it will be replaced.</p><br/><p>Zhang Yang sighed and summoned the Mythical Turtle out. After Level 80, the Violet-Platinum pet had grown vastly stronger. Zhang Yang had managed to buy the {Wild Recovery} skill book from the auction house when the prices had finally plummeted. So far, the Mythical Turtle attributes were as follows: HP: 50,480 (With Vitality Aura), Defense: 2,400, Weapon Attack: 7,038 – 8,038. It was strong!</p><br/><p>Zhang Yang walked a few steps forwards and tossed a {Spear of Obliteration} at Afael. After that, he swiftly returned to the Mythical Turtle and waited for the boss to come to him instead.</p><br/><p>\"Intruder! You dare to stroll around White Stone Hills?! I’ll tear you apart for your imprudence!\" cried the boss as he chased after Zhang Yang, with a large battle hammer in his hands.</p><br/><p>BANG!</p><br/><p>Like hammering a nail to a plank, Zhang Yang took a strong blow and received 2,982 damage.</p><br/><p>A Level 80 Gray-Silver boss was a little stronger than a Level 70 Gray-Silver boss. However, Zhang Yang’s defenses had been doubled after reaching Level 80! Compared to when he was only Level 79, the damage received from the boss was almost halved!</p><br/><p>Zhang Yang grinned and counterattacked.</p><br/><p>Zhang Yang’s movement speed while riding the Mythical Turtle was so slow that he could have shoved his middle finger up the turtle *sshole just to make it walk faster. Still, the boss was not player-controlled. It would never use any kiting technique, and would always head into the battle, and fight with the player head-on without having any strategies.</p><br/><p>After laying down five {Cripple Defenses}, Zhang Yang’s attack was maximized! Especially the Mythical Turtle. On average, its attack was around 7,500. The boss’s puny 450 Defense barely reduced the value! The turtle had over 4,100 DPS which was stronger than Zhang Yang’s 3,300 DPS!</p><br/><p>As expected from a Violet-Platinum tier battle pet! Such a strong ally!</p><br/><p>In contrast, the boss DPS was only at most 1,000! To kill Zhang Yang’s current combined HP at 120,000 would need at least 2 minutes! On the contrary, Zhang Yang’s and the turtle’s combined DPS at 7,400 could easily dry out the boss’ 810,000 HP in less than 2 minutes! Zhang Yang could easily defeat the boss without relying on any survival skill!</p><br/><p>In truth, with half of his equipment being Violet-Platinum tier, and the Violet-Platinum battle pet, Zhang Yang was the equivalent of a Gray-Silver boss at the same level!</p><br/><p>As they continue grinding Alfael’s HP down, Alfael stopped attacking at 10% HP. A progress bar appeared on top of his head. It was {Heal}!</p><br/><p>While a player {Heal} skill could be cast instantly, Alfael’s {Heal} had a 1 second casting time!</p><br/><p>Zhang Yang immediately cast a {Crash Magic} but failed!</p><br/><p>Immune!</p><br/><p>In a split second, Zhang Yang activated the Ring of Imprisonment’s effect to force a 2-second stun on a target!</p><br/><p>Immune!</p><br/><p>What the world!? If he could not even stop the casting, why would it have a 1-second casting time? Might as well make it an instant cast!</p><br/><p>‘+202,500!’</p><br/><p>A large, green colored number text floated up the boss’s head and Alfael had recovered close to 25% of his HP. Luckily, the boss had Zhang Yang’s {Destructive Smash} effect which greatly decreased the healing received! Now Zhang Yang understood why the boss had a 1-second casting delay, it was to allow players to cast a {Destructive Smash}!</p><br/><p>Having healed over 200,000 HP, it was still a futile effort to stop his inevitable death! Zhang Yang ground his HP down to 10% again. With no more {Heals} to cast, the boss could only smash at Zhang Yang and fell dead.</p><br/><p>‘Ding! You have killed Alfael. Obtained 810,000 Experience Point!’</p><br/><p>The boss only dropped a few Gray-Silver and Green-Copper equipment, which Zhang Yang did not even spare a look and swept them all into his inventory. He then called out the bear and rode his way up the hill.</p><br/><p>SHUSH!</p><br/><p>A bright flash of light gleamed in the air, and Zhang Yang caught the sight of a long spear flying through the air. Wielding the spear was a large green orc that was snarling at him with his mouth wide open, revealing a pair of sharp fangs and teeth.</p><br/><p>[White Stone Elite Robber] (Elite, Humanoid)</p><br/><p>Level: 82</p><br/><p>HP: 82,000</p><br/><p>Defense: 450</p><br/><p>Now that an elite tier monster had appeared, Zhang Yang would not dare to be too relaxed. After all, an elite monster had a strong attacking power that could easily deal significant damage to Zhang Yang. Zhang Yang pulled the reins on the bear and used {Wild Charge}, dashing to the orc to attack it with its paws.</p><br/><p>Based on the Gold-Eared Bear King’s current attributes, he could roughly stand toe to toe with an elite monster without Zhang Yang assistance! If Zhang Yang were to attack it, it would end the fight so fast before Zhang Yang even started counting down the seconds. As such, the green skinned orc was already lying in a pool of its own blood within seconds.</p><br/><p>However, even though he was that strong, Zhang Yang was not able to engage in mass-killing. Zhang Yang’s current pushing rate was massively reduced, due to the sharp decline of the Dark Enigmatic Sword’s ability! The bear’s attack was at 5,000 while Zhang Yang current attack power was only at around 2,500! Zhang Yang was unexpectedly weaker than his own pet!</p><br/><p>He could not even compete with the bear, let alone the Mythical Turtle! Pets that were stronger than their owner! Looks like Zhang Yang would have to get his hands on a Violet-Platinum weapon to make things right for him!</p><br/>\n</div>"}