{"title": "Chapter 346: Level 80, Finally!", "id": 346, "volume": 4, "url": "http://boxnovel.org/mmorpg-rebirth-of-the-legendary-guardian-chapter-346-level-80-finally", "volume_title": "Volume 4", "body": "<h1>Chapter 346: Level 80, Finally!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 346: Level 80, Finally!</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>[Consult Margery] (Difficulty Level: A)</p><br/><p>Quest Description: According to Banderas, you should look for a magician scholar named Margery. Request her help to solve the problem with the seals on the sword’s hilt. Margery lives in a place called the Pandemonium. You will face great difficulties in meeting her. Note: Margery will only appear in the Hardcore Mode of the Pandemonium dungeon.</p><br/><p>Progress: Obtain the method to unseal the power of the sword 0/1</p><br/><p>Pandemonium would be an upcoming 25-man, Level 80 dungeon. There would be a total of seven bosses from the beginning till the end, which was quite a number compared to the other dungeons he had ever conquered. On a side note, the monsters in the Pandemonium belonged to a specific race and power. Level 10 dungeon had the underground crypt dwellers. Level 30 dungeon had werewolves, and so forth and so on. In this dungeon, however, out of the seven bosses, there were four different forces that were vying for superiority, hence the name Pandemonium.</p><br/><p>Now that the quest needed Zhang Yang to raid a Level 80 dungeon, he had to put it aside first. He would need 25 level 80 members, a matter that was out of his hands. Zhang Yang thought of a way, but eventually placed getting to Level 80 as the main priority. He should reach Level 80 as soon as possible and collect all three Dimensional Key Fragments in the Level 80 map. Now that he had taken such a long time collecting all the keys, he guessed that by the time he has collected all the keys in the Level 80 map, he would have gathered enough eligible players to raid Pandemonium.</p><br/><p>Zhang Yang left the blacksmith and went to the bank to take out all the previously collected [Warden’s Weed], and went to the Alchemy shop to buy a few empty potion bottles. To concoct a [Level 4 Strength Potion], he would need 2 counts of [Warden’s Weed] and 1 portion of [Devil’s Algae], which he had already gathered.</p><br/><p>…</p><br/><p>‘Ding! You have made [Level 4 Strength Potion] x6!’</p><br/><p>…</p><br/><p>‘Ding! You have made [Level 4 Strength Potion] x6! Due to Alchemist's Intuition, [Level 4 Strength Potion has been transmuted!’</p><br/><p>[Level 4 Strength Potion (Grade 3 Transmutation)] (Usable)</p><br/><p>Use: Increases Strength by 100 points, and 3% Critical rate. Last for 1 hour.</p><br/><p>Level Requirement: 60</p><br/><p>Zhang Yang had made more than 400 bottles of [Level 4 Strength Potion] in one go. Among the 400 bottles, 32 bottles had the Transmutation effect, and he was extremely lucky to have 2 bottles of Grade 10 Transmutation! The effect was a 10% bonus Critical rate!</p><br/><p>It was a pity that players were restricted to only one potion bottle effect at a time. Zhang Yang would love to have both Strength and Troll Recovery potions in effect. Zhang Yang shrugged at the limitations and gulped down a bottle of [Level 4 Strength Potion] before he went on to grind.</p><br/><p>In the same time, the Battle Team Professional League was still in progress, with Zhang Yang’s Silky Soft Battle Team standing strong at the top of the point accumulation board. They had not lost a single round! Fatty Han’s Pride and Honor Battle Team was not performing as well, in fact, they were the second lowest team.</p><br/><p>…</p><br/><p>On the 9th of March, Zhang Yang reached Level 80! He had obtained 1 SP and learned a new skill. What was more important was the fact that he could finally put on the equipment that he had stashed in his storage bank!</p><br/><p>The first, was obviously the Titan set, Titan’s Helmet, Titan Greaves, Titan Wall, and Titan’s Cape! After that were the two Violet-Platinum Rings, Ring of Imprisonment, and the Heart of the Death Knight. The last two was the Yellow-Gold tier, Blazing Defensive Boots, and Earth Spirit Gauntlet. The Helmet, Greeves, and Cape had a total of 5 Level 3 Gem Sockets. Level 3 Vitality Gems could provide an additional 50 Vitality, compared to the Level 2 Vitality Gems that could only provide less than half of that, which was 20 Vitality!</p><br/><p>Zhang Yang swapped all nine of his equipment and achieved a whole new level of power!</p><br/><p>[Player: Zhan Yu]</p><br/><p>Level: 80</p><br/><p>HP: 69,880 (Inclusive of Vitality Aura and Titan’s set equipment set effect, 10,000 HP bonus)</p><br/><p>Defense: 2,200</p><br/><p>Damage Absorption: 1,658</p><br/><p>Weapon Attack: 2,421 – 2,621</p><br/><p>With his god-like stats, the only lacking point was his attack power. Even though the Dark Enigmatic Sword was extremely useful in AoE attack, it was only a Level 60 Yellow-Gold. Its single target attack power was not on the same level as the rest of his equipment!</p><br/><p>Now that he had reached Level 80, it was time for him to search for the remaining Dimensional Key Fragments! The first stop was a place called the Grand Canyon of Eternal Night - for an NPC named, Kent Joseph.</p><br/><p>There were only three Level 80 maps that he needed to visit. The only reason Zhang Yang had chosen the Grand Canyon, was because it was the closest to him! Still, close was a relative term. From Thunderstorm Castle, Zhang Yang had run close to 7 hours before he arrived at the Grand Canyon of Eternal Night.</p><br/><p>As the name described, the place was a huge canyon, with endless folds of earth. This place was dubbed as Eternal Night, due to the dark clouds covering the sky, blocking the sunlight from ever reaching the surface of the canyon. With the absence of sunlight, the place was plunged into an eternal night, causing the lack of plantation, making it a place where Spectres could prosper!</p><br/><p>As far as the maps go, Zhang Yang adapted quickly. It was not because he was getting stronger, but because he had fresher memories of the higher level maps. Lower leveled maps like Level 50 maps were not fully explored. There were many of them and Zhang Yang had only ventured through three or four of them before entering the Level 60 border. However, there were only three Level 80 maps. Before reaching Level 90, the majority of players would likely have ventured through all of them a couple of times. However, in his previous lifetime, Zhang Yang had been in the Eternal Night Grand Canyon for the duration it took for him to gain three levels. In his past experience, Zhang Yang had never encountered any NPC named Kent Joseph. On a side note, his memories about Kalin Town were also quite jumbled. He had to rely on the quest manual to search at the \"north\" of the canyon. The description was extremely vague and Zhang Yang had to spend more than 7 hours to find the town of Kalin. Kalin was a small, ancient town. It was not abandoned not deserted, it was just old. The buildings were as old as the earth formed over the years. However, the town was brimming with life. There were many people walking around, and it was rather crowded.</p><br/><p>Zhang Yang had questioned over a dozen visitors, and none of them knew who or where did Kent Joseph live. Zhang Yang frowned, but since the quest has already led him here, there should be clues as to where he could find the NPC. A sudden idea came to his mind, and that was to ask elder occupants, instead!</p><br/><p>Zhang Yang searched throughout the streets and found an older man seated on the sidewalk. He came up to him and asked, \"Excuse me, do you know a man named Kent Joseph?\"</p><br/><p>\"Kent?\" The man expressed a nostalgic face. \"Old John’s kid? Little Kent? Of course, I knew him! I remember carrying him in my arms when he was only a little kid! Why’d you ask? Is he back? If he is, he’s too late. Old John passed away a few years back, due to illness!\"</p><br/><p>Zhang Yang raised an eyebrow. \"Back? Did he go somewhere?\"</p><br/><p>The old man hummed a little and said, \"Roughly 20 years ago, Kent joined the army. We never heard any news from him since! Sigh…That kid…He was a kind human that was full of justice in his head. He was a nice lad. May the gods bless him!\"</p><br/><p>Zhang Yang quickly asked more questions. \"Where did he joined the army?\"</p><br/><p>\"Hm…if I remembered correctly, he joined the army troops at Black Coal’s Sentry. But, I don’t think that he will still be there!\" said the old man. He then got up and walked away slowly.</p><br/><p>Zhang Yang sighed with another piece of vague information that he had just received. With just the name of a place called Black Coal’s Sentry as the only hint, Zhang Yang had no choice but to go there.</p><br/><p>After a short journey, Zhang Yang arrived at Black Coal’s Sentry in an hour. Zhang Yang recalled that he had been there during his previous life. However, he had no recollection of any army troops stationed there. The land was completely dyed in black, hence the name Black Coal. The place was completely devoid of life. There was no trees nor grass growing at all. On top of a small hill were a few old, and torn flag posts. It was clear that this place had long been deserted by the army.</p><br/><p>Zhang Yang made his way up to the post and examined the surroundings. Beside the abandoned station, there were many tombstones resting in peace there. Zhang Yang did a head count and counted at least 50 to 60 tombstones there. Each on every tombstone had names of the deceased engraved on them. Zhang Yang examined every tombstone and was stunned when he saw the name Kent Joseph present on one of the tombstones.</p><br/><p>Did the descendant of the seven great generals die in the battle?</p><br/><p>The quest manual explained the key fragment was in possession of Kent Joseph, and not Old John. Now that Kent was dead and buried, did the quest intend for Zhang Yang to exhume the grave?</p><br/><p>Zhang Yang contemplated for a while and finally reached a decision to become a grave robber. Since the only clue left was this grave, he had to do it. What else could he do?</p><br/><p>…DIG!</p><br/><p>Zhang Yang walked the talk. He jumped down from the white bear and used his Dark Enigmatic Sword as a shovel to dig up the dirt near Kent Joseph’s tombstone. The white bear was not left out, it plunged its massive claw into the dirt and helped Zhang Yang dig away.</p><br/><p>\"STOP! WHAT ARE YOU DOING?!\" a voice cried out from behind.</p><br/><p>Zhang Yang spun and saw a man at the age of around 40 years old. He was holding a bouquet of flowers that had been completely mushed up in his grip.</p><br/><p>[Veteren Soldier Schroeder] (Elite, Humanoid)</p><br/><p>Level: 80</p><br/><p>HP: 80,000</p><br/><p>Defense: 450</p><br/><p>Note: A veteran soldier that was stationed here as a Black Coal Sentry.</p><br/><p>What timing! He did not arrive early, nor late. He arrived just when he was needed to. It reminded Zhang Yang of an old wizard from a certain western novel. Schroeder had arrived just in time to catch Zhang Yang digging up the grave. It was definitely part of the quest line!</p><br/><p>Zhang Yang kept his sword back into its sheath. The white bear followed and moved away from the spot, trying to hide the fact that they had tried to dig the grave. Zhang Yang walked towards Schroeder and asked, \"Elder brother, why would you stop me?\"</p><br/><p>Schroeder was so angry that his face turned from a furious red to the bright rays of the sun! Schroeder was so angry that he was about to engage in an unavoidable fight! Schroeder then tossed the bouquet of flower to the side and clenched his fists. \"How dare you disturb those who were resting in peace! Young man! I’ll teach you a lesson myself!\"</p><br/><p>Without any delay, the older man threw a supersonic fist at Zhang Yang! His name was immediately changed from green to red! Zhang Yang had no choice but to fight this NPC!</p><br/><p>Zhang Yang drew his sword hopped on the bear to attack the NPC. Having leveled up to Level 80, the bear’s HP was raised to 32,700, with a Weapon Attack of 4,769 - 5,179. Zhang Yang himself had close to 70,000 HP! With both of them combined, their HP had reached beyond 110,000 HP! They had even exceeded the HP limit of normal and elite tiered monsters!</p><br/><p>The NPC was completely outclassed! Even his attacks were puny, in comparison to Zhang Yang’s. From the perspective of Zhang Yang, his Defense was so thick that the NPC only dealt over 1,300 damage per hit! It was nothing but an itch!</p><br/><p>Zhang Yang did not need to rely on any ulti skills that he had. By simple hacks and slashes, Zhang Yang defeated Schroeder! However, his HP was stuck at 1 point left and had gained an immunity status. At the same time, Zhang Yang received a system notification.</p><br/><p>‘Ding! You have defeated Schroeder. Please make a choice: 1, Kill him. 2, Ask clues about the death of Kent Joseph!’</p><br/>\n</div>"}