{"title": "Chapter 341: Floating Clouds Guild", "id": 341, "volume": 4, "url": "http://boxnovel.org/mmorpg-rebirth-of-the-legendary-guardian-chapter-341-floating-clouds-guild", "volume_title": "Volume 4", "body": "<h1>Chapter 341: Floating Clouds Guild</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 341: Floating Clouds Guild</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Zhang Yang did not rush into the battle with the boss first. Instead, he spent some time to clear out the other monsters, using {Spear of Obliteration} and killing them one at a time. Zhang Yang was not stupid enough to rush into the herd and fight them all once like he usually does. These monsters were all elite tiered. If he rushes in crazily, he would probably be in trouble.</p><br/><p>With Mordor standing there, minding his own business, Zhang Yang successfully killed all the monsters without triggering the boss fight. It took him a brief 10 minutes before the boss was the only target left for Zhang Yang to kill. He was still, in fact, shouting commands, as if there were still crew members around to listen to him. Now that everything was ready, it was time for the boss.</p><br/><p>Zhang Yang patted the turtle and charged towards Mordor at an amazing speed.</p><br/><p>\"HM!? Land breather!?\" cried Mordor as Zhang Yang entered his range. The boss shifted his hat to one side, drew his curved saber and bellowed. \"Lo an’ behold, mateys! 'tis time t' shed some blood!\"</p><br/><p>With no monsters around, Mordor’s command was for naught. After a few seconds of unresponsiveness, Mordor turn around and frowned when he noticed there were no one around to assist him. Mordor leaped forward to slice at Zhang Yang. Zhang Yang intercepted the attack with a {Block} and counterattacked immediately. Compared to Zhang Yang’s sword attacks, the Mythical Turtle attacks were much higher than Zhang Yang, and were actually causing significant damage to Mordor!</p><br/><p>\"Curse ye! I’ll slice off yer hands 'n feet fer me fishes!\" bellowed Mordor with rage as he swung his sword, cutting through the water and striking Zhang Yang’s armor with such force that sparks started flying underwater!</p><br/><p>Zhang Yang laughed and provoked him more. \"You can try!\"</p><br/><p>\"Yer be a small fighter! Ye dare to be spouting nonsense in presence of the great Mordor! I 'ave scuttled more scallywags than ye have eat’n hardtack!\" It seemed that Mordor had the mouth to keep up with witty chatterboxes like Zhang Yang!</p><br/><p>Out of the blue, the boss thrust his hands out. Right then, the muscles and skin on his hands immediately rotted away, leaving a clean, \"meat-less\" boney hand, and touched Zhang Yang!</p><br/><p>‘Ding! You have received the effect of {Decaying Touch}! Defense has been decreased by 100 points! Lasts for 30 seconds!’</p><br/><p>Soon after, a second strike came again, causing {Decaying Touch} to gain another stack, decreasing Zhang Yang’s Defense by 200! The problem with this skill was that unlike {Cripple Defense}, {Decaying Touch} could be stacked by more than 5 times! In just half a minute, Zhang Yang had completely lost all his Defense!</p><br/><p>‘-4,572!’</p><br/><p>The boss’ damage gradually increased as Zhang Yang’s defense decreased. Each strike dealt at least 4,500 damage! His DPS was decreased to at least 1,500!</p><br/><p>\"Ar! Ar! Ar! Ye be impressed! Now ye know how strong Mordor be!\" Mordor scoffed through his panting breath as he continued slicing at Zhang Yang with all his might. \"Witness the power of Mordor! Water Dragon Rush!\"</p><br/><p>Shoom! Shoom!</p><br/><p>Two tornado-like whirlpools were formed by the swing of the boss and headed towards Zhang Yang. Each whirlpool was the size of a regular human and was at least 3 meters long.</p><br/><p>Although Zhang Yang did not know what was the skill about, he knew it was not something that he should touch. Zhang Yang quickly maneuvered the turtle away to safety and attacked the boss from another angle. Since the whirlpools’ movement speed were slow, Zhang Yang was not worried about it since they were fairly easy to avoid.</p><br/><p>Mordor continued trading blows with Zhang Yang and conjured two more whirlpools. Slowly, the numbers rose. All of the summoned whirlpool moved slowly, and were heading towards the boss’s direction. Zhang Yang quickly moved away. Right now, he wanted to kite the boss away from the whirlpools. Although he succeeded in kiting the boss away to a safe location, the whirlpools followed. As if they were conscious, they followed the boss and headed towards Zhang Yang.</p><br/><p>Zhang Yang frowned, but it was not a huge problem for him. Zhang Yang then kited the boss all the way from the front of the ship to the rear! Luckily, the boss had only 780,000 HP. Since Zhang Yang and the turtle were combined, their DPS had reached to 6,000! He only needed 2 minutes or so to kill the boss off! Zhang Yang used one count of of {Shield Wall}, {Turtle Shell Defense}, {Berserker’s Heal}, a bottle of {Level 4 Healing Potion}, a bottle of {Fountain of Life}, and the set effect of the set equipment, to kill the boss without any hitch.</p><br/><p>Once Mordor was killed, Zhang Yang had lowered his guard and had recklessly got caught in the whirlpool. He was then sent spinning out of control for 10 seconds before he was able to escape the whirlpools. If he had been caught in them during the battle with the boss, it would have definitely spelled a certain doom for him. Zhang Yang realized his mistake and patted the turtle to speed towards the battle loots.</p><br/><p>Mordor’s drops were fairly average. Zhang Yang picked up three counts of Gray-Silver equipment and seven Green-Copper equipment. However, he was slightly lucky. One of the Gray-Silver drop was the equipment fragment of the [Fireglass Necklace]. These few days, Zhang Yang had amassed a total of three [Fireglass Necklace] fragments. He had also obtained one fragment from the auction house. Right now, he had gained the final piece and was ready to forge the complete necklace!</p><br/><p>Now that he thought of it, he was almost Level 80 before finally managing to forge a Level 70 Assembled Equipment. No one could predict that a Level 80 boss would directly drop a Level 80 Violet-Platinum or Yellow-Gold necklace for him. If that was the case, this [Fireglass Necklace] would be for naught.</p><br/><p>It could not be helped. Assembled Weapons were mainly created to sort of compensate the extreme rarity of high tiered weapons and equipment. If Assembled Equipment were easily obtained, it would completely throw the game off balance, and cause the mass majority of player to seek out Assembled Equipment instead of actual equipment. At this current rate, even players would have the same chance to obtain strong equipment without burning a hole in their pocket, or wait too long before they could obtain one! This balance was to allow a proper scale of power between lower-level players and higher-level players! Everything was set to be balanced!</p><br/><p>Zhang Yang kept all the battle loots and was heading to the internal cabin when he noticed something from afar. A group of nine players were heading towards his direction. Zhang Yang was baffled. The map was extremely huge to begin with, allowing players to choose a variety of areas to grind their level. Since that was the case, the players heading towards Zhang Yang were not here to train. Furthermore, Zhang Yang was currently located deep within the lake. Like HP and MP, when a player dives into water, they will have a \"Breathing Gauge\". Slowly and surely, the gauge will run out and if the player did not resurface to catch a breath, they will be drowned alive! Only those who possess Water Mounts like Zhang Yang could dive deep into the lake to grind.</p><br/><p>Now that everything was established, the players did not possess any mounts and were swimming by themselves! Obviously, their main target was the ship! The Flying Dutchman!</p><br/><p>The ship was moving slower than a snail could crawl, but it was always constantly moving. Plus, it will always remain underwater! Without guidance from a certain quest, Zhang Yang truly believed that the players would never spend their free time swimming underwater just to search for this ship! Although the movement speed of the players underwater was slow, the ship was even slower. Without much effort, the nine players had arrived the ship’s rear. Now that they had arrived, Zhang Yang checked their profiles.</p><br/><p>Everyone had the same guild tag \"Floating Clouds\". Based on their equipment set, he could distinguish that one of them was Guardian, two Hunters, two Thieves, and the four remaining players were Cloth Armor wearers. All of them had the buff \"Underwater Breathing\", most probably gained by consuming a potion.</p><br/><p>Among the nine players, the highest-leveled player there was the person named Wind Up 30 Feet. The lowest level player was Branda Nights at Level 70. Everyone of them noticed Zhang Yang and started raised their guards.</p><br/><p>One of them, the Guardian named Snow.Wolf.Lake (with the dots)1 approached Zhang Yang and said politely, \"Excuse my sir. Could you please shift your business here to some place else? This ship belongs to the Floating Clouds guild!\"</p><br/><p>It was a polite, civil request. However, beneath it, there was an intangible sense of unmeasurable pride and arrogance. Zhang Yang could deal with that. Even if the player was genuinely courteous, Zhang Yang had no intention of surrendering the place to them! In his previous life, he had picked up news that the Flying Dutchman’s boss, Van der Waals – Dunkirk, would drop treasure maps! These maps will lead players to a treasure that rewards them with extremely rare and powerful equipment, or even skill books!</p><br/><p>However, there were limits. The fourth kill of Dunkirk would not drop any [Treasure Maps]. As per usual, the first kill would have the big drop, the [Treasure Maps] dropped would surely lead to the best of the best items! After all, they were pirates, and they did steal from the best. Still, they had limited lifespans and they could only steal so much in their lifetimes. It was not like the treasure they had amassed could provide for all players in this game.</p><br/><p>Zhang Yang could swear that the current boss right now has not yet been killed even once! That would mean the kill that he was about execute would drop the jumbo loot! With a bonus, the [Treasure Map] that the boss will drop later will be the best of the best! That was why Zhang Yang would not surrender the ship to them, for a single, polite sentence. Especially when they were wearing the same expression that practically saying \"You should consider yourself lucky that we did not kill you on sight!\"</p><br/><p>Zhang Yang smiled lightly and revealed his own profile information. He was never a man who favored a fair fight. If his title would scare the nine players away, it would be for the best since he would not want to be accused of being a bully or something.</p><br/><p>\"Zhan Yu, Crypt Slaughterer, Physician’s Friend, Hero of Snow Sprite City, Warrior of Centaur, Hero of White Jade Castle, Level 78, Male Human, Guardian, .\"</p><br/><p>The sudden, long title that appeared on his head had clearly scared and blinded the nine players from Floating Clouds.</p><br/><p>\"H-H-He is Zhan Yu!\"</p><br/><p>\"The leader of the champions of the Soaring Swords Competition! The MVP!\"</p><br/><p>\"The guild master of Lone Desert Smoke!\"</p><br/><p>\"The only guild in China that has two battle teams participating in S – class Professional League!\"</p><br/><p>Everyone chanted their discovery, and some of them were clearly showing fear. There was a saying, people lived and left the world with their name. Zhang Yang was now, the man greatly feared by almost everyone in the entirety of China!</p><br/><p>Snow.Wolf.Lake, assumed to be the party leader of the group of nine, had looked at Zhang Yang and said, \"So what if he was Zhan Yu?! He is just one man! And there are nine of us! What are we afraid of?! If we tuck our tails and run away, the name Floating Clouds will forever be tarnished!\"</p><br/><p>\"Right now, we are underwater. We are all slow. He is slow! We have so many ranged attackers! Surely we can kite him to death!\" said one Hunter named Heartless Aqua Luna.</p><br/><p>Wind Up 30 Feet nodded in agreement. \"If we kill him, it will be a massive boost to our guild’s name! Also, when he won the Soaring Sword Competition, he won two Violet-Platinum equipment! Perhaps, we could get that off him…\"</p><br/><p>\"That would be a huge bonus!\" said everyone with a sudden glint of greed in their eyes.</p><br/><p>At the current stage of the game, Gray-Silver tier equipment were the bread and butter for all of the players around. Every piece of equipment could be sold for as cheaply as a few hundred gold coins to a thousand gold coins based on their bonus attributes and effect. Weapons were usually expensive. Even though Yellow-Gold were fairly common now days, those who were wearing Yellow-Gold equipment were part of large guilds. Even then, only the higher officers of the guild had the privilege to put on Yellow-Gold equipment!</p><br/><p>Obviously, Zhang Yang’s Little Merchandize Shop was a major provider of those equipment, and they were categorized to that of the prices of cars and houses!</p><br/><p>Yellow-Gold equipment that turned up in the open market were mostly forged by farming Assembled Equipment fragments which were hunted from Gray-Silver boss! Those were sold up to 10,000 to even 100,000 gold coins! Weapons, rings, and necklaces could go as far to even more than 100,000 gold coins!</p><br/><p>Violet-Platinum equipment were literally priceless. You can never find them in the market. Across the entire China region, One Sword Stroke has one, while the rest of the Violet-Platinum equipment were in possession of Lone Desert Smoke!</p><br/><p>If Yellow-Gold equipment were worth so much in the first place, what would a Violet-Platinum equipment go for?</p><br/><p>1,000,000?! OR MORE!</p><br/><p>Just like when Yellow-Gold equipment has made its first debut to the market, the first Violet-Platinum could fetch up to 1,000,000!</p><br/><p>There was a reason why greed was among the seven deadly sins. Because of greed, these nine members of Floating Clouds would willingly fight Zhang Yang, not knowing that he would basically massacre them all without a flinch.</p><br/><p>The intention to kill had already steeled in their will. Even if they lost, they will only lose a bit of experience points. They stood to gain a lot more from killing Zhang Yang.</p><br/><p>All of them started to breath raggedly. Zhang Yang only needed to read their expression to know what they were thinking of. Zhang Yang sighed heavily. If they want a blood bath, so be it. He shall grant them a blood bath.</p><br/><p>Shush!</p><br/><p>Wind Up 30 Feet shot the first arrow and started the attack.</p><br/><p>‘Ding! You’ve been attacked by the Snow.Wolf.Lake party. You have 10 minutes to return fire!’</p><br/><p>With the system giving Zhang Yang the green light, all members of Floating Clouds (present at the field) had their name tags turned red.</p><br/><p>Zhang Yang lightly hummed and the Mythical Turtle swam like a speeding bullet towards the Cloth Armor class players. Even though he was not sure which was the Priest or the Spellcaster, when the battle starts, the persons having a progress bar above their heads will display the spell names and he could easily differentiate which class was which.</p><br/><p>Everyone knew that Zhang Yang had the multi target AoE skill {Horizontal Sweep}. That was why when Wind Up 30 Feet shot the first arrow, all of them had fanned out, not allowing Zhang Yang to catch them all at once.</p><br/><p>As expected of the Mythical Turtle, at such an amazing speed, Zhang Yang had arrived at the nearest Spellcaster in just 2 to 3 seconds!</p><br/><p>\"How is he so fast!?\"</p><br/><p>Everyone was baffled. Was he using some sort of hacking program? How could he possess such insane speed underwater!?</p><br/><p>‘-6,724!’</p><br/><p>‘-8,242!’</p><br/><p>The Mythical Turtle attacked once and used {Tear} and had dealt close to 15,000 damage in an instant. That Spellcaster had only over than 13,000 HP. He was killed in such a speed that he was not able to use any evasive skill such as {Ice Frame} or {Apparate}!</p><br/><p>Everything that had just happened, happened in a flash!</p><br/><p>Whack! Wham! Bam!</p><br/><p>All sort of attacks, spells, debuffs had landed on Zhang Yang. But at his current level of equipment, physical attack class equipped with Gray-Silver equipment would be lucky to deal over 1,000 damage on Zhang Yang. On the other hand, Spellcasters’ attacks were strong. Their attacks could easily reach over 2,000!</p><br/><p>After the barrage of attack, Zhang Yang only lost close to 10,000 HP. However, he was mounted on the Mythical Turtle, and with both of them sharing their HP bar, Zhang Yang had pushed his maximum HP to 85, 900. With that amount of HP, he was technically far stronger than any elite tier monster around! That 10,000 damage that he had just received was nothing but a mosquito bite!</p><br/><p>Immediately, Zhang Yang consumed a bottle of [Mobility Potion] and eliminated the debuff from {Blast Wave}. Zhang Yang controlled the Mythical Turtle and flew towards the other surviving Spellcaster!</p><br/><p>Zhang Yang’s current target was not as stupid. He knew that the attack from the Mythical Turtle was ridiculously strong. In defense, that Spellcaster activated {Ice Frame} without a second thought.</p><br/><p>1. Snow.Wolf.Lake: Snow.Wolf.Lake (Chinese: ) is Hong Kong's first modern musical. The title combines the Chinese name of the two main characters; \"Wolf\"  in the title refers to the main male protagonist, and \"Snow\"  refers to the main female protagonist. The \"lake\" refers to a plot related element.</p><br/>\n</div>"}