{"title": "Chapter 361: Eins Brook", "id": 361, "volume": 4, "url": "http://boxnovel.org/mmorpg-rebirth-of-the-legendary-guardian-chapter-361-eins-brook", "volume_title": "Volume 4", "body": "<h1>Chapter 361: Eins Brook</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 361: Eins Brook</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Like withered leaves during autumn, the monsters dropped gracefully into the pile of snow. The enemies behind the first group that had fallen came taking over the empty space in the front. One by one, they continued to fall over and over.</p><br/><p>‘Ding! You and the party members around have killed Fanatic Follower. Obtained 9,494 Experience Points (50 points Party bonus)!’</p><br/><p>‘Ding! You and the party members around have killed Fanatic Follower. Obtained 9,494 Experience Points (50 points Party bonus)!’</p><br/><p>…</p><br/><p>Like popcorn, the popping sound of the system notification continued to ring in everyone ears. As for their experience points, it was going up so swiftly that they could practically see the experience bar slowly filling up!</p><br/><p>An elite monster will grant 10 times the experience points of a regular normal tier monster. Since they were killing so many elite monsters like they were flies, Zhang Yang and everyone else’s experience bar was filling up like a cup full of beer in a free-for-all buffet.</p><br/><p>30 seconds later, after the skills ended, the entire hall was covered in dead corpses and a few Fanatic Followers that had entered the hall a little later. As they say, the early bird gets the worm, but the second mouse gets the cheese. However, the problem was, this cheese, bites back. Zhang Yang and the party cleared the entire hall and made sure there were nothing left. They had only taken less than a minute to kill every last monster. On the other hand, like all MMORPG gamers would feel, killing was easy, but the looting, would take up most of the time.</p><br/><p>As expected from the OP, super imbalanced skill!</p><br/><p>The crowd worked together to collect all the loots. They had collected so many [Silk], and more than 10 Gray-Silver equipment. Upon entering Level 80 maps and higher, almost all Gray-Silver boss was only treated as Green-Copper tiers. Basically, they were worthless. That being said, there were still a few equipment that could be sold for a few gold coins, especially those that had a set equipment set effect.</p><br/><p>[Rhino's Hide Boots] (Gray-Silver, Leather Armor)</p><br/><p>Defense: +12</p><br/><p>Vitality: +67</p><br/><p>Strength: +34</p><br/><p>Dexterity: +76</p><br/><p>Level Requirement: 80</p><br/><p>Rhino Guard set equipment set effect: , , Rhino’s Hide Boots.</p><br/><p>3 Set Effect: 100 Dexterity bonus.</p><br/><p>The thousands of elite monsters had produced a total of 11 Rhino’s Hide Boots, 9 Coats, and 8 Gloves. In precise, they had farmed a total of 8 complete set equipment. Now that they had several completed sets, selling them at a few thousand gold coins per set would not be a problem.</p><br/><p>Wei Yan Er rubbed the coat with her tiny little fingers and said, \"Why is the set effect is called Rhino’s Guard, when the equipment were made from Rhino’s hide. It should be called Rhino’s Butcher!</p><br/><p>The question was asked by Wei Yan Er, however, everyone turned their head towards Zhang Yang in unison.</p><br/><p>F*ck!</p><br/><p>Zhang Yang ignored the crowd. It was a stupid question, and answering it would only be wasting his saliva.</p><br/><p>Brook did not participate in the fight, instead, he remained standing at his throne even after every single Fanatic Follower had been killed. The boss had already \"exited\" the story mode, and now fell into the open-world category. It would only attack when players enter his aggro range.</p><br/><p>Everyone waited in suspense. Zhang Yang stared at the boss, and everyone asked the same question.</p><br/><p>\"What’s the plan?\"</p><br/><p>In the presence of a Violet-Platinum boss, there was a certain pressure. Everyone did dare to try anything at all. After all, it was the strongest boss they had faced so far. In truth, Zhang Yang himself did not fight this boss in his life. He thought for a while. \"I think we should all withdraw outside. We’ll kite him out there and fight there. At least we can fight while riding the mounts.\"</p><br/><p>Fighting while on a battle mount would increase a player’s lifespan, as in HP. It could also provide a certain degree of attack power. Unlike Zhang Yang and other Hunter class players, if the rest could unmount their mounts and have their pets battle together with them, it would be efficient. At least range class would not need to be in melee range to have the battle pets participating.</p><br/><p>Everyone agreed with Zhang Yang’s plan and withdrew towards the entrance of the altar.</p><br/><p>Zhang Yang patted Fatty Han’s shoulder and said, \"Yo Fat*ss, control your pet, and kite the boss out!\"</p><br/><p>Fatty Han turned his head swiftly. With crocodile tears, Fatty Han cried, \"Bro…why me?\"</p><br/><p>\"Because you’re my bro.\"</p><br/><p>\"Bro, that’s cheating.\"</p><br/><p>Knowing that he did not have much choice, Fatty Han controlled his white bear cub towards the inside of the altar. In truth, he wanted to mimic Zhang Yang’s style and had purposely went on the hunt for a white cub. However, unlike a Rare Battle Mount, the white bear cub that he had tamed was only limited as a pet. It could not be used as a mount nor a battle mount.</p><br/><p>A Hunter could summon both a pet mount and a pet in the same instance. They had one benefit, if one or the other died in battle, it would not affect the cool down time of the other. While other players would have to wait for a 10 minutes cool down time to re-summon the battle mount.</p><br/><p>\"Your sacrifice will be remembered, little cub,\" cried Fatty Han when the little white bear cub had entered the boss’s aggro range. The girls were all \"owwww~\" when they saw the little, clumsy, cute, and adorable mammal trying to make its way to the boss. The boss noticed the bear and immediately got up from his throne to give chase to the little bear.</p><br/><p>Immediately, Fatty Han controlled the bear to turn around and frantically run back to him. Although the boss’ movement speed was much faster than the cub, it was slightly delayed since the pet had quickly gotten out from the attacking range of the boss. However, after 2 to 3 seconds, the boss had reduced the distance between him and the cub to 20 meters! The boss immediately stopped and started to cast its spell.</p><br/><p>Casting {Fire Missle}!</p><br/><p>0.5 seconds…1 second…1.5 seconds…Pak!</p><br/><p>The spell which needed more than 2 seconds of casting time failed the moment the cub managed to run out of the boss’ attacking range. Brook had to stop casting and start chasing again. The biggest problem with A.I controls was the fact that they did not think about the future or act in response to player’s tactics. It will only move, attack, and cast skills based on its original programming. This boss was programmed to chase and attack the target when it was in its range. It did not run up closer to the cub, but instead, it ran until the cub was at the 20 meters casting range, which was the maximum range of the boss. This has led the little white bear to have sufficient time to run away from the boss and prevent it from receiving any attacks from the boss!</p><br/><p>The little pet had escaped safely and returned to Fatty Han’s side unscathed. Everyone was surprised and a little jumpy when they saw that the bear was completely unharmed.</p><br/><p>Fatty Han patted the little bear and laughed. \"Hahaha! As expected from my own pet! It’s stronger and better than the others!\"</p><br/><p>While the rest was standing by, Zhang Yang was already on his Mythical Turtle, waiting at the front for the boss to arrive. Once he got the boss in sight, Zhang Yang threw a {Spear of Obliteration} to draw the boss’ attention.</p><br/><p>‘-3,385!’</p><br/><p>Brook received the damage and immediately stopped chasing the bear. He stopped where he was and started chanting a {Fire Missle} at Zhang Yang.</p><br/><p>What was the worst enemy a Guardian could face? Magic type. Zhang Yang immediately jumped down from the turtle and dashed towards the boss.</p><br/><p>{Charge}!</p><br/><p>Sliding on the white floor, Zhang Yang knocked into the boss and hacked the boss with his one-handed axe.</p><br/><p>‘-2,177!’</p><br/><p>This time, the boss had finished its chant and blasted a fiery projectile towards Zhang Yang.</p><br/><p>‘-13,426!’</p><br/><p>Countering Zhang Yang’s 4 digit damage with a 5 digit attack, Zhang Yang had taken a huge damage. A Guardian would lose all meaning of its immense physical Defense since a magic type attack would be affected by Magic Defense. Not even {Block} was useful in this situation!</p><br/><p>If the boss could deal over 13,000 damage every 2 seconds, not even the super healer like Han Ying Xue could handle the support! Still, while facing a Violet-Platinum, boss, her superb equipment and mana control was profound enough to handle the battle, though it would take a lot of effort.</p><br/><p>Luckily, Zhang Yang was well prepared, with many survival skills!</p><br/><p>\"Endless Starlight! Try and gain more aggro! If I can’t handle the pressure, I’ll clear my aggro with {Shadow of the Void}. Try your best to catch hold of the aggro!\"</p><br/><p>\"Aite boss!\" said Endless Starlight. In this party, his role was to be the secondary tank. If he could not take up the role, there was no further reason to keep a useless, non-attacker, and non-healer player in the party!</p><br/><p>The Mythical Turtle was slow but it had managed to get close to Zhang Yang to allow him to jump on his back. Once Zhang Yang got on, his HP limit was shot up to 128,190! To put into comparison, the Gray-Silver mount that Endless Starlight had was only to provide a measly 32,480 HP max-limit to Endless Starlight! The difference was truly heaven and earth!</p><br/><p>It could not be helped; Endless Starlight was only Level 77. The equipment he was wearing were a mix of Level 60, and Level 70 Yellow-Gold equipment. There were no Violet-Platinum equipment pieces on him! However, even though his HP was considered to be low, others might not able to compete with him; not unless they could procure themselves a Violet-Platinum battle mount like Zhang Yang.</p><br/><p>Zhang Yang immediately took control of the fight and everyone could relax and concentrate on attacking. It was lucky that the boss level was at Level 86. Han Ying Xue and the rest of the party were mostly between Level 77 and Level 78, the damage they could deal was not fully reduced due to the Level penalty. The attack output was even stronger when Zhang Yang had stacked up to 5 layers of {Cripple Defense}. Those that had battle mounts enjoyed it the most! The damage their (battle mounts) could provide were rather significant!</p><br/><p>\"Fools! Death be upon you! You cannot hope to win the son of the Fire God!\" cried Brook. With a loud burst of explosion, there were a total of 9 {Fire Balls} that burst out from Brook’s wand and shot towards everyone.</p><br/><p>‘Ding! Eins Brook has used {Mass Missile}!’</p><br/><p>Usually, skill attacks could only be blocked by defensive skills. Since the party did not know about the nature of the skill, they did not use any defensive skill and took the attack head on.</p><br/><p>‘-15,000!’</p><br/><p>‘-15,000!’</p><br/><p>…</p><br/><p>Instantly, other than the two tanks, the rest of the party had taken 15,000 damage.</p><br/><p>\"OH COME ON!\" cried Han Ying Xue in a fit of anger. Puffing with steam, Han Ying Xue cursed all sort of vulgarities under her breath and swiveled around to cast all sorts of mass-healing skills to heal the party.</p><br/><p>\"Little Yang, next time, try and recruit Fantasy Sweetheart into this party. Since there’s one slot empty, might as well fill it in. It’s better and safer to have two healers, innit?\" said Fatty Han.</p><br/><p>Zhang Yang laughed. \"Tell the truth. You want her in, to heal you, or to be with you?\"</p><br/><p>\"Nyehehehe.\"</p><br/><p>\"So how are you with Xiao Wei lately?\"</p><br/><p>\"Hehe! Just wait for the invitation to the wedding dinner!\"</p><br/><p>\"Eh?! Fatty! You’re getting married?!\" cried Wei Yan Er in pure shock. \"Which sister in this world had knocked herself to the wall and have her brains all messed up?\"</p><br/><p>That was a little too much, even for Wei Yan Er.</p><br/><p>Zhang Yang defended his brother-in-arms and said, \"Come on. Don’t say that. Our Fat*ss here has a few good points to him, you know?\"</p><br/><p>\"Like what?\" asked Han Ying Xue out of the blue.</p><br/><p>\"Yeah! Like what?\" said Fatty Han as he turned his face to Zhang Yang.</p><br/><p>\"Well…I erhm…\" Zhang Yang stumped. To find good points about Fatty Han would be the same as finding the chances of survival while fighting a Violet-Platinum boss, while wearing nothing but Gray-Silver tier equipment.</p><br/><p>Everyone laughed at Zhang Yang’s silence. Only Fatty Han was smiling bitterly, shrugging resignedly. \"Oh well.\"</p><br/><p>Brook’s {Mass Missle} attack could be cast without a warning. The skill was a nuisance since it could target everyone within the vicinity! When players did not have the time to defend against the skill, the party’s healer, which was Han Ying Xue was having a bad time! Luckily, almost everyone had battle mounts, and coupled with Zhang Yang {Vitality Aura} that provide a 16% bonus Vitality, they could endure two shots of the skill without being killed. This had provided Han Ying Xue sufficient time to heal them!</p><br/><p>Still, Brook’s attack was strong. Even with Han Ying Xue the super healer in the party, Zhang Yang was forced to use one surviving skill, one [Healing Potion (Grade 9 Transmutation)] and still suffered from great HP loss!</p><br/>\n</div>"}