{"title": "Chapter 366: Easy as Pie", "id": 366, "volume": 4, "url": "http://boxnovel.org/mmorpg-rebirth-of-the-legendary-guardian-chapter-366-easy-as-pie", "volume_title": "Volume 4", "body": "<h1>Chapter 366: Easy as Pie</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 366: Easy as Pie</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Once Zhang Yang got the boss’ aggro, all the other melee fighters rushed straight for it. The other ranged fighters remained further back, while maintaining the furthest attacking range. Before the final boss, everyone had taken their time, slowly hacking and slashing the bosses without a sense of urgency. Since the previous bosses were just Gray-Silver difficulty, none of them felt pressured, and had easily defeated the previous obstacles. However, when it came to the last boss, everyone kept their guard up, knowing clearly that the boss was a Yellow-Gold boss.</p><br/><p>With their broad range of \"seriousness\", the damage dealt on this different occasion differed greatly.</p><br/><p>Players who were part of Zhang Yang’s permanent party had superior equipment, skills, intuitions, and coordination. Their overall attack damage was much better and \"sharper\" compared to the rest of the party members. Especially Sun Xin Yu! Her main weapon, the Snake's Spur, could ignore up to 700 Defense value, and coupled with Zhang Yang {Cripple Defense}, Sun Xin Yu’s attack was only affected by 300 Defense of the boss!</p><br/><p>The main point was her main and secondary weapon, which granted her a whopping 6,000 DPS. Her attack damage was practically double that of anyone else in the party!</p><br/><p>\"Your greed shall be your doom!\" Sulga bellowed. Cracks started to form over of its main body. As large rocks and stones fell down, the part that split apart from the main body were its hands. Now having a proper humanoid form, Sulga slammed its hands onto the ground. A progress bar appeared on the top of its head, with the name {Rocky Spear}.</p><br/><p>Boom! Boom! Boom!</p><br/><p>‘-5,000!’</p><br/><p>It’s 5,000 damage a second to anyone who were attacked by the skill. The progress bar on the boss’ head was still going on, despite the skill already being cast. It seemed that this skill was a channeling type, which would last for 10 seconds! Anyone else, besides a tank would surely die if they take all 10 strikes.</p><br/><p>That is, if the player was a complete novice. The {Rocky Spear} had a rhythm and pattern to its attack. The skill could be easily evaded right at the moment when the rocky spear bursts out of the ground. Those who were recruited by Zhang Yang had a certain degree of prowess, naturally, none of them were dumb. Although some of them might be a little sluggish, their response rate was fast, after taking two to three of the attacks.</p><br/><p>Out of the 20, 4 of the party member were healers. As the skill {Rocky Spear} continued to attack, Han Ying Xue, Fantasy Sweetheart, and the two other healers were busy healing for a living. Two Priests and two Sacred Knights were sufficient enough for the party to easily handle any kind of threat.</p><br/><p>Best of all, Zhang Yang had not needed any sort of healing!</p><br/><p>Even though Sulga was the last boss, it was just a Yellow-Gold boss, despite having such a long HP. The attack from a Yellow-Gold boss had a certain border and could not exceed that line. On average, the normal basic attack would be at most 12,000. Smashing on Zhang Yang, the final damage would only be at, most 6,000!</p><br/><p>Even though Zhang Yang was unable to ride on the Bear King, Zhang Yang’s own tanky HP was good enough to tank the boss close to 20 seconds before Zhang Yang would need emergency healing. In a situation like this, the healers only needed to heal him once in a blue moon. Priests would only need to maintain the {Regeneration} on him while the other two Sacred Knights would only need to directly heal him once in a while.</p><br/><p>It was as expected. Zhang Yang had half of his body clad in Violet-Platinum equipment! He could even tank an actual Violet-Platinum boss! Why would he even be nervous of a Yellow-Gold boss?</p><br/><p>That was just Zhang Yang. After all, a Hardcore Mode is still a Hardcore Mode. The danger was not just targeted to the tank alone. Having loads of skills and attack pattern, it could kill off the attackers and the healers, which would eventually lead to the entire party’s downfall.</p><br/><p>After a series of chaotic events, everyone managed to survive the {Rocky Spear} ordeal.</p><br/><p>Wei Yan Er giggled playfully. \"This is fun! Let’s do this again!\"</p><br/><p>Throughout the entire attack, Wei Yan Er had unleashed her athletic skills, she made it seem as if dodging bullets would be easy for her.</p><br/><p>On the far side of the scale, Fatty Han performed the poorest. Still, he had only taken 3 counts of attacks from the {Rocky Spear}. Panting with anger and fatigue, his fat flaps bobbed around as he moved away to a safe place. \"Fun!? Please! I’m practically sodomized!\"</p><br/><p>\"Ah ha? You mean…your butthole got poked?!\" said Endless Starlight with a surprised expression.</p><br/><p>Lost Dream laughed uncontrollably. \"Starlight! What would be the first thing you’d do if one random morning, you woke up and found out that you have turned into a woman?!\"</p><br/><p>Endless Straight straighten up and put on a serious face and said, \"The first thing I would do. Is to let Fatty Bro do me!\"</p><br/><p>Fatty Han made a weird face where different parts of his face would cringe and twist. \"Please don’t. I appreciate the kind gesture of it, but just the thought of it.\"</p><br/><p>After 20 seconds, Sulga slammed his hand into the ground again, triggering {Rocky Spear} for the second time. Everyone was sent into a crazy dance, but since they had the experience before, everyone was getting the hang of it. Even Fatty Han was only struck once!</p><br/><p>90%...</p><br/><p>After the ordeal, everyone concentrated their firepower and dealt a series of attack.</p><br/><p>\"The sins of Greed shall bring none but death!\" bellowed Sulga. \"Rolling Rocks! Smash them to bits!\"</p><br/><p>‘Ding! Stone Golem Sulga has used {Rolling Rocks}!’</p><br/><p>Thump! Thump!</p><br/><p>Materialized almost instant, there were a total of 36, one story house sized-giant rocks rolling from out of nowhere, in a well-organized, 6 x 6 pattern. Like a wave, the rocks rolled in unison at a slow pace. The mass of rocks was so heavy that the earth trembled vigorously. If one would be rolled over by it, what would the damage be? It could even cause instant death.</p><br/><p>However, all boss’ skill in the dungeon would never create a situation where none could survive it. There is and always will be a way of dodging it. If it was un-dodgeable, then it would depend on the player’s equipment. Zhang Yang glanced around and he found a way to evade the skill. There was a tiny gap, roughly the size of one human’s width, in between the rocks!</p><br/><p>The problem was that, the rocks were too big, making all 36 rocks cover most of the battle field. It was not possible for one to run out of the skill’s effective zone. The only way of surviving was to slide through the tiny gaps between two rocks! The gap was so small that it would require pin point accuracy to make sure that the rock does not smudge you across the floor.</p><br/><p>\"Get ready guys! Jump in between the gaps among the rocks!\" said Zhang Yang.</p><br/><p>Zhang Yang raised his concentration to another level to multitask his way through the fight by tanking the boss and positioning himself through the gaps at the same time. Just when he was at his limit, he heard Sulga’s bellow. \"Greed shall be the death of you!\"</p><br/><p>Boom! Boom! Boom!</p><br/><p>{Rocky Spear} was unleashed and spears made of rocks pierced through the earth.</p><br/><p>Great! Two skills at one time! That’s what you call as being attack by a tiger from the front, and a wolf from the rear, leaving one a hard choice on whether to attack or withdraw.</p><br/><p>Only during the worse of scenarios, one’s ability could be truly displayed. Players like Sun Xin Yu, those that were part of Zhang Yang permanent party, displayed an outstanding performance albeit the chaos. They could easily dodge one skill, while preparing for the other with less difficulty. While Sun Xin Yu and the others were doing just fine, the newly added party members were unable to perform as the same. Their reflexes were slightly sluggish and could not multitask as well as the others. While paying attention to the {Rocky Spear}, they had missed out the {Rolling Rocks} and vice-versa.</p><br/><p>As seen from before, the {Rocky Spears} were painful but not fatal. Whereas the rolling rocks dealt 100,000 damage a hit. If Zhang Yang was not prepared for it, he would have died. Smudged all over the floor!</p><br/><p>As the rocks continued to roll, two of them had actually phased through the boss and were only destroyed after rolling to the edge of the mountain. In this wave, a total of four players were crushed to death. Two players had used their skills to gain an invincible effect to escape death.</p><br/><p>\"What the hell!? Hiding behind the boss was not even safe!\" cried Fatty Han in a fit of anger. He had thought that he could be safe from the boss’ attack by using the boss as a shield. No one had known that the rocks could actually phase through the boss. As a result, he now lay flat on the ground.</p><br/><p>The boss had killed four players, including Fatty Han, one of the main party members! Zhang Yang was disgruntled at the fact that Fatty Han had died before using the skill {Dance of the Heaven and Earth! What a huge waste!</p><br/><p>80%...</p><br/><p>Sulga unleashed another wave of {Rolling Rocks} and {Rocky Spear} at the same time. It seemed that both skills were set to be used at the same time to purposely give players a harder time. As expected, in this wave, three players had died. Two of them were the same players who had used their skills to grant them momentary invincibility. Since the skills were still on cool down, they could not rely on them and had died due to carelessness. The remaining player that died as he was too focused on avoiding the rocks, and was pierced to death by the rocky spears.</p><br/><p>70%...</p><br/><p>Another wave of {Rocky Spear} and {Rolling Rocks}, casualty: 1.</p><br/><p>60%...50%...40%....</p><br/><p>As Sulga’s HP dropped, it had only used these two skills over and over. Though it may seem boring, it was still able to kill many more players. At the last 30% HP, the surviving players remaining on the battle field were Zhang Yang’s permanent party member of eight, Galileo, and Fantasy Sweetheart.</p><br/><p>Even the strategist, Mountain Mover had also died. His ability in coordinating the party during the war was better than good, however, his skills in the dungeon were only average. At best, he was at the same level as Fatty Han!</p><br/><p>Knowing that, Zhang Yang had still recruited him for this dungeon raid with the intention of gearing him up. In the future, when he leads a team during battle, he would not need to stand in the front lines. However, he would definitely be targeted by opposing Assassins. Having lousy equipment would only be assisting in the kill!</p><br/><p>After 30%, there were no longer casualties in the party. All the survivors were soon to be China’s top tier fighters, naturally, they had already gotten used to the boss’s strategy.</p><br/><p>20%...10%...</p><br/><p>‘Ding! Stone Golem Sulga has gained a 50% increase attack buff due to extreme anger!</p><br/><p>A familiar, bloody-red glow appeared on Sulga’s stone body.</p><br/><p>This time, the {Rolling Rocks} unleashed by the boss were even larger in size. The gap between the rocks had become so small that evading had become impossible.</p><br/><p>Zhang Yang immediately screamed. \"To me! Don’t bother dodging the rocks! I’ll use {Vanguard’s Aggression}. When the boss enters the Berserk state, it will continue to cast {Rolling Rocks}. There’s no way to survive this unless we use surviving skills to rush for the kill. Consume a power potion and use all your skill, at no expense! If you have {Dance of the Heaven and Earth}, use that as well!\"</p><br/><p>Right after that, Zhang Yang activated {Vanguard’s Aggression} and consumed a bottle of [Power Potion]. Since all skills had a global cool down of 1 second, Zhang Yang chose to use the [Ring of Beastman's Ancestor] ring. Hang Ying Xue and the others gathered closely to Zhang Yang, each took a bottle of [Power Potion] and casted [Dance of Heaven and Earth].</p><br/><p>‘-12,000!’</p><br/><p>‘-12,000!’</p><br/><p>‘-12,000!’</p><br/><p>‘-12,000!’</p><br/><p>…</p><br/><p>Shadows emerged from everyone who used {Dance of Heaven and Earth} and formed into swordsmen. The figure leaped towards the boss and started its attack.</p><br/><p>9%...8%...7%...The boss’s HP dropped down like an open fire hydrant, dropping at such fast pace that the speed of the HP bar was one of the fastest Zhang Yang had ever seen! That was the combination of 8 instances of {Shadow of Heaven and Earth}! It was a total of 1,080,000 damage!</p><br/><p>Boom *rolls* *rolls*</p><br/><p>The rolling rocks landed on the players at the same time. Having Zhang Yang’s protection over them, even though the boss had gained a 50% damage boost, it could only deal roughly 15,000 damage to everyone.</p><br/><p>3%...2%...1%...0%!</p><br/><p>Sulga growled in a deep husky voice and crumbled.</p><br/>\n</div>"}