{"title": "Chapter 378: Destroying the Portal", "id": 378, "volume": 4, "url": "http://boxnovel.org/mmorpg-rebirth-of-the-legendary-guardian-chapter-378-destroying-the-portal", "volume_title": "Volume 4", "body": "<h1>Chapter 378: Destroying the Portal</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 378: Destroying the Portal</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Time is of the essence. Right now, time is a luxury none of them had! For each passing second was vital and could not be wasted on anything else!</p><br/><p>Zhang Yang’s party had used their utmost best to damage the demon portal, and within 10 minutes, they had already dealt enough damage to hack down the portal to 56% HP! In the first 10 minutes, they had relied on their {Dance of Heaven and Earth} and Zhang Yang’s {Chaotic Dance of Electric Current} to deal damage. Luckily, they were not greatly affected by the monsters that were coming out of the portal!</p><br/><p>For every passing minute, the boss would turn around and send a dark beam to the portal, and cast a {Haste}-like buff on it to add 100% of its transport speed. At the beginning of the battle, everyone was able to pace themselves, with nothing but the portal to focus on. However, after 10 minutes, the party was beginning to struggle. Before they could kill the first demon, the second demon had already come out of the portal. If this piles up, there was no longer any meaning in defeating the monsters that come out of the portal! The monster would only keep piling up before they could even kill them, and eventually overwhelm everyone.</p><br/><p>Zhang Yang come to a final decision and said, \"Ignore the monsters, let the NPC take care of the monsters. You guys handle the portal! Endless Starlight, attack the portal, unless the monsters start attacking our own party member! If the number of monster exceeds your power, activate {Vanguard’s Aggression} and {Sacred Protection} to protect everyone. Both Han Ying Xue and I will pair up to use {Blizzard Sky} and {Lunar’s Dew} to clear everything.\"</p><br/><p>\"Ok boss!\"</p><br/><p>Everyone else nodded as well. Even though the situation had indeed turned south, as long as Zhang Yang did not falter, everyone would follow and steel their mentality, as if Zhang Yang was their beacon of hope!</p><br/><p>1, 2, 3…18…46 monsters!</p><br/><p>As the battle dragged longer and longer, the number of monster piling up in the field increased. Since the party did not spare any time to attack the monsters, causing the monsters to attack the NPC and forming a battle of their own. Occasionally, there will be a few escapees breaking off from the crowd and attacking the party members. Endless Starlight will then kite the monster away from the party and into the crowd of NPC soldiers.</p><br/><p>Whenever possible, he would lead them directly to Winchester and Brunoss, since the two Yellow-Gold NPC had AoE attacking skills. As long as Endless Starlight could drag the monster into their attacking range, the NPC’s attack will \"splash\" on them and the monster’s aggro will be diverted to them instead.</p><br/><p>The number of NPC soldiers was extremely limited. Although they were also the same tier as the monster’s, they could not endure the never-ending attack of the monsters that would only increase in numbers! When the battle entered the 20 minutes threshold, the NPC soldiers were nearly wiped out. The only survivors were just the two Yellow-Gold boss and seven soldiers that were at their limit.</p><br/><p>\"Boss! I can’t handle this no more!\" cried Endless Starlight.</p><br/><p>Zhang Yang nodded and ran towards Han Ying Xue. \"Hey b*tch! Time for our show!\"</p><br/><p>\"Wuuuu! If only I can combine together with noob tank to make some skill. That would be so much fun!\" said Wei Yan Er enviously.</p><br/><p>\"…Yan Er, what are you always tailing Little Yang? Come and combine with me!\" said Fatty Han with a tease.</p><br/><p>\"No!\" Wei Yan Er rejected him instantly.</p><br/><p>Fatty Han sulk sadly and said, \"But…why?\"</p><br/><p>\"You’re too ugly!\"</p><br/><p>Fatty Han kept quiet.</p><br/><p>{Blizzard Sky}! {Lunar’s Dew}!</p><br/><p>‘-5,000!’</p><br/><p>‘-5,000!’</p><br/><p>‘-5,000!’</p><br/><p>…</p><br/><p>A storm of snow and gale engulfed the entire battle field, damaging all monsters within the region, effectively killing them all! One by one, the elite tier demons dropped like flies, after a good aerosol spray! 30 seconds later, other than the two new demons that had just emerged out of the portal, the rest of the demons were completely wiped out.</p><br/><p>\"No! This cannot be!\" Wakala bellowed angrily. \"Despicable humans! I will crush you! I will obliterate you!\"</p><br/><p>The situation was so frantic that the party member had no time to be impressed at Zhang Yang’s and Han Ying Xue’s paired skill. While the skill was killing all the monster, everyone had dug deep into their very souls and started attacking as fast as they could.</p><br/><p>8%... Which was 4,000,000 HP!</p><br/><p>While there were still demons lurking out of the from the portal, the NPC soldier were all battered up! There was no hope in depending on them to suppress the incoming demons! The battle was at a crucial stage, nearing it end! Even though 8% was a small number, it would still require almost 2 minutes for the party to destroy it! In 2 minutes time, how many demons would have already emerged out of the portal?</p><br/><p>If they could ignore the demons and solely focus on the portal, things might be a little different!</p><br/><p>Zhang Yang decided to act. \"Everyone! Focus on the portal. Let me handle the monsters from the portal!\"</p><br/><p>He then threw a {Spear of Obliteration} towards the monster that came out from the portal and shared the load of Endless Starlight and the NPC soldiers. As such, the amount of stress Zhang Yang had to handle now was immense!</p><br/><p>2…4…10! More and more monsters were being dragged away by Zhang Yang!</p><br/><p>Just when the number is right, Zhang Yang activated all sort of skills!</p><br/><p>{Blast Wave}!</p><br/><p>{Thunder Strike}!</p><br/><p>{Heroic Leap}!</p><br/><p>All status effect skills were unleashed, and none were kept on standby. When he was almost killed, he would restore himself with {Berserker’s Heal} and {Shield Wall} auto recovery effect!</p><br/><p>He will stand strong!</p><br/><p>He will not fall! Until the end!</p><br/><p>5%...3%...1%...</p><br/><p>\"Fight on guys! We can do it! The portal is almost destroyed!\" everyone cheered.</p><br/><p>300,000! 200,000! 100,000!</p><br/><p>BOOM!</p><br/><p>As Wei Yan Er delivered the last strike, the portal crumbled into pieces of light which dissipated into nothingness!</p><br/><p>\"Oh yeah!\"</p><br/><p>\"Don’t be too happy just yet! There’s still monsters and the boss!\" Zhang Yang scolded the party as they started to cheer and forget about the battle they were in. They stopped cheering and started cleaning up the monsters on the field.</p><br/><p>\"Despicable! You have foiled what I have been planning for 3 years!\" bellowed Wakala after the portal was reduced to nothing. As the flames grew larger and violent in his eyes, Wakala let out a deafening roar. \"DEATH TO ALL HUMANS!\"</p><br/><p>Zhang Yang laughed. \"You, who have been addressing us as nothing but imbeciles. I shall give you one in return. Your grand scheme, that you have planned for 3 years had been foiled easily by a bunch of lowly humans. Clearly, your level of intelligence is much lower than mine!\"</p><br/><p>Lost Dream laughed. \"Hey yo Zhan Yu! What’s with you taunting the boss?\"</p><br/><p>\"Hehe, to make it even!\"</p><br/><p>Winchester walked up to the boss after defeating the last monster in the field and said, \"Wakala, you have nothing to support you now! I would like to see how do you plan to walk out of this castle!\"</p><br/><p>Wakala cracked an evil smile and said, \"You think a few pests could stand up against a mighty demon general?!\"</p><br/><p>\"What an egotistical demon!\" Wei Yan Er stuck out her tongue and swung her giant axe towards the boss, landing the first strike, after hitting him with {Charge} first.</p><br/><p>\"Be gone to whence you came from,!\" Brunoss drew his bow and fired arrows at the boss. He was a Wind Ranger, a class that was capable of both ranged and melee attacks. It was said to be a combination of both Thief and Hunter.</p><br/><p>Now that all the monsters were cleared, it’s players and NPC against one boss!</p><br/><p>This time, the recovery buff on the boss had disappeared. He was nothing but a regular Violet-Platinum boss, with a slightly higher attack and HP! However, facing Zhang Yang and his party, what was the use having a higher attack or HP? Wakala was nothing but a piece of meat waiting to be chopped down to bits!</p><br/><p>Right then, Zhang Yang was certain that the quest difficulty lay with the destruction of the portal. Now that they had accomplished that, the boss was nothing but a bonus that would grant them a few Violet-Platinum equipment!</p><br/><p>Jackpot…?</p><br/><p>90%...80%...like an open hydrant, the boss’ HP dropped quickly. The attacking team consisted not only of Sun Xin Yu, but also Wei Yan Er and the others. There were also the two Yellow-Gold bosses, Winchester and Brunoss! With such a powerful force attacking, Wakala could only delay his inevitable death! Within 3 minutes, Wakala flapped his bat-like wings crazily, flying up a few meters in the sky before slamming down with a loud crash!</p><br/><p>\"No! This…cannot…be…!\" At the moment Wakala died, Leonardo stood up instantly. He then screamed like a girl being surrounded by 10 hungry wolves!</p><br/><p>\"Leonardo…what am I to do with my brother…\" said Winchester, as he paced slowly towards Leonardo.</p><br/><p>\"No! Winchester! You are my brother! Your only brother! You cannot kill your own blood and flesh!\" screamed Leonardo with panic and terror reflected in his eyes.</p><br/><p>\"That’s where you’re wrong, kiddo. My brother, Leonardo has died, a long time ago!\" said Winchester with a solemn tone in his voice. He took out his sword and laid the killing blow.</p><br/><p>With that, all conditions of the quest were met!</p><br/><p>Winchester walked back to the crowd. He then flicked off the blood that was staining his sword before return it to its scabbard. He bowed to everyone and said, \"Fellow adventurer, I give you my thanks for saving Killua Castle. You have saved the citizens of this castle from being engulfed in the shadows and rule by the demons! I, Winchester represent all people in this castle, and give you the utmost respect and gratitude!\"</p><br/><p>‘Ding! You have completed the quest: Hunt of the Evil. Obtained 5,000,000 Experience Points!’</p><br/><p>‘Ding! You have obtained a reward: Titan’s Necklace!’</p><br/><p>Besides Zhang Yang, everyone else was wearing a long smile on their faces. The quest was extremely good, the equipment rewarded from the quest could be worn without having it Identified!</p><br/><p>As such, the only equipment that Zhang Yang was lacking to complete the Titan set were the Titan Gauntlets and Titan Battle Boots.</p><br/><p>\"Winchester, please give the order to release Honduras!\" Zhang Yang had not forgotten to complete the other quest! That was his main purpose in coming here, in the first place!</p><br/><p>Winchester nodded and spoke to Brunoss. \"Brunoss, please visit the dungeon and release Honduras from prison. That man is not only innocent, he had also contributed to this victory!\"</p><br/><p>\"Yes, my lord!\"</p><br/><p>Zhang Yang hopped onto his bear and followed Brunoss to the castle dungeon.</p><br/><p>With haste, the two of them arrived at the prison, where they met up with Honduras the trader.</p><br/><p>\"Warrior, you’ve succeeded?\" said Honduras when he saw that Zhang Yang was with Brunoss. Zhang Yang did not look like he was being escorted back to prison, which gave Honduras hope of being released.</p><br/><p>\"Luck was on my side!\" said Zhang Yang with a smile.</p><br/><p>Brunoss then announced. \"Honduras, Lord Winchester decreed that you are to be released from prison! You have risked your life to save Killua Castle! Your deeds shan’t go unrewarded. My lord will see to your reward!\"</p><br/><p>\"Bless the gods!\" Honduras smiled till his eyes were closed tight. He then took out the keys to the prison and unlocked the door. That alone had angered Brunoss to the extent that he could pull out his bow and unleashed hell on the man.</p><br/><p>\"Oh! My baby daughter Adele! I’m coming back to you!\" said Honduras, as he slid out of the prison door. Zhang Yang hurriedly chased after the man, he still owed him a Millennial Heroic Soul!</p><br/>\n</div>"}