{"title": "Chapter 389: Sailor Moon", "id": 389, "volume": 4, "url": "http://boxnovel.org/mmorpg-rebirth-of-the-legendary-guardian-chapter-389-sailor-moon", "volume_title": "Volume 4", "body": "<h1>Chapter 389: Sailor Moon</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 389: Sailor Moon</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Even though everyone had guessed the outcome of the competition, the entire process of the battle was really out of expectation.</p><br/><p>It was totally a one-sided slaughter!</p><br/><p>Under the tactical command of Mountain Mover, the Lone Desert Smoke exhibited their explosive battle power to the public by taking out Imperial Sky off their feet with just a snap of their finger tips! It was really lamentable to see how a large army of absolute power was broken down by one super tactician on their enemy side. The difference of just one person could really make a difference!</p><br/><p>During the competition, Zhang Yang had also let Fatty Han and the Sub-Guild join into the main guild on purpose. The intention was to let every single one of them get their very own Gray-Silver grade [Battle Mount]!</p><br/><p>And it really did happen, because this system of the competition was full of loop holes to exploit. The moment Lone Desert Smoke secured their position as the Champion of the competition, even the newly joined members such as Fatty Han and the remaining members of the Sub-guild obtained the rewards --- to be elevated by 3 levels and one Gray-Silver grade [Battle Mount: Crimson Flaming Horse]!</p><br/><p>Later, Zhang Yang arranged for Fatty Han, Mountain Mover the members of Sub-Guild to go back to the Sub-Guild with the intention for them to join the competition for the third and the fourth place that was about to start in awhile.</p><br/><p>When Mountain Mover was leading the members of the Sub-Guild which was deemed to be much weaker in battle, it was obvious that the performance and show of strength from the Sub-Guild obviously improved by a lot! They actually won the match against Radiance by using the guerrilla tactics1, and secured the third place in the competition! What was said to be a waste was that Zhang Yang did not join in, and he missed the opportunity to get the reward of the winning, together with the sub-guild!</p><br/><p>It was just nonsensical!</p><br/><p>If he knew that he would also get the reward by just being on the Sub-Guild, he would have put himself into the Sub-Guild and elevated himself to yet another level!</p><br/><p>No wonder this was a one in a lifetime kind of competition, as there were simply too many loopholes to exploit! There was nothing fair to begin with even in the first place!</p><br/><p>Now that the members of Lone Desert Smoke in both the Main Guild and the Sub-Guild had their own [Battle Mounts] of Gray-Silver grade and Black-Steel grade from the winnings, the entire force of the Lone Desert Smoke had definitely crowned themselves above every other guilds in the China server! Other than the Large-Scale guild Imperial Sky, no other guilds can stand against Lone Desert Smoke, at least not in the China server!</p><br/><p>The other guilds that can pose a threat to the Lone Desert Smoke are the top-tier guilds from the other 7 main regions! After all, no matter the Soaring Sword Competition, or the Guild War Competition, these competitions were held separately in different regions. So there were a total of 14 champions in all 7 main regions!</p><br/><p>After acquiring the Level +3 reward, Zhang Yang had reached Level 85, but still, he is surrounded by the best players in the server!</p><br/><p>Another 3 days have passed, the Thunderstorm Castle had been successfully upgraded up into a Level 3 territory defensive castle. Meanwhile, Zhang Yang has been busy making more than 200 elite grade Mechanical Servants. With the 100 plus Mechanical Servants left from his previous battles, the army of these Mechanical Servants had reached up to a total of 400! Zhang Yang had plans for these Mechanical Servants, to use them as an element of surprise when in desperate times. To hide the army from plain sight in order to keep them as an element of surprise, Zhang Yang purposely used his privilege as the Baron of the Thunderstorm Castle to create a secret warehouse, to store the army.</p><br/><p>In each passing day, there would be an increment of 72 servants in the warehouse. It only took about 7 days for their number to grow up to the maximum capacity for the Level 3 Castle Defense.</p><br/><p>Zhang Yang felt more relaxed in the coming days, because he did not have to run around completing quests, as long as he grinds his levels and crafts some potions to keep on track, he would be up to speed. Ever since he acquired the skill {Alchemist’s Intuition}, he became obsessed with making potions. Always looking forward to the surprises of his random transmutations, he would never grow tired of it.</p><br/><p>But, it’s not like he can really slack off on his progress as he pleases, or just play the game casually. In other words, the game is always full of competitions and disputes.</p><br/><p>It began a few days ago, a number of assassinations, ambushes happened on the players of Lone Desert Smoke who were sent on to the mines to gather some materials. That had caused the production of the guild to decrease steeply! Not all players signed up for the game to be top warriors and fighters. There were also players who logged in every day to live a peaceful life, mining and collecting materials at leisure, to be sold in the marketplace for gold. They did not have top tier equipment, or levels to match up to the pace of the game. Since they were such peaceful players, they were easy targets!</p><br/><p>This situation escalated to the point where Hundred Shots was forced to arrange escorts to protect these peaceful players. But the culprits were cunning and sly, because they will just avoid doing anything and stay hidden when they come across those large group of players, while they will slaughter the players if the group is small. This kind of issue has caused major inconveniences to Lone Desert Smoke!</p><br/><p>After all, players had to stand their own ground, with each man for himself, so even their defenders would be overwhelmed at times.</p><br/><p>These culprits are very good in hiding, because up until now, they have not exposed themselves yet. That has presented a helpless situation for Hundred Shots to solve, he could only increase the number of players in escort.</p><br/><p>And on this day, Zhang Yang had just made a Mechanical Servant with some [Fragment Source of Cinder] and was ready to use his [Lover’s Charm] to teleport himself to Sun Xin Yu. He wanted to prevent any means of travel before going straight into grinding his level. Suddenly, he received a group invitation.</p><br/><p>This invitation came from a player named, Sailor Moon2. Zhang Yang took a look at the player’s character information and realized that she was actually one of the members of Lone Desert Smoke. He accepted it immediately and joined the party of three, making it into a party of four.</p><br/><p>Team Leader - Sailor Moon, human spellcaster, Level 62.</p><br/><p>Team Member - Sailor Chibimoon3, human spellcaster, Level 62.</p><br/><p>Team Member - Sailor Mars4, human spellcaster, Level 62</p><br/><p>Zhang Yang could not help himself but to sweat in silence, did he just join the ‘Sailor Moon’ party?</p><br/><p>\"Guildmaster! Please help us!\" Sailor Moon was shouting out in the party channel, her voice filled with anger and helplessness at the same time.</p><br/><p>Zhang Yang frowned, \"What’s the matter?\"</p><br/><p>\"There’s a bunch of people clinging onto us, saying that they just want to be friends with us. At first, we did not mind them at all, but they have been following us and harassing us, and then they began to block our path, physically! And when we were about to use our [Teleportation Scrolls], they would interrupt us. They had no intention to kill us as well, they’re just blocking us fro leaving. Now they are trying to force us to be girlfriends of their boss!\" Sailor Chibimoon spoke up.</p><br/><p>\"These bastards are just being as*holes!\" Sailor Mars boiled with anger and said, \"Guildmaster, we have just joined the guild not too long ago, and we don’t know who to call for help! The first person we thought of is you! Please help us!\"</p><br/><p>Although these three girls weren’t talking in order, Zhang Yang could piece up the information. Also, their voices were so similar! With just a second of distraction, one would have lost track of who is speaking at the time!</p><br/><p>\"How many are there? These people.\" Zhang Yang asked them.</p><br/><p>\"10!\" Sailor Moon replied in an instant.</p><br/><p>If the number is huge, then Zhang Yang will have to summon a large number of people as well, but since it’s just 10... He can definitely take them on himself without a problem!</p><br/><p>While riding on Whitey, Zhang Yang let out a short shout and charged towards the direction of the ‘Sailor Moons’ in high speed. He informed through the party channel, \"Just hold on for a little longer, I’ll be there before you know it!\"</p><br/><p>\"Guildmaster, you must bring more men!\"</p><br/><p>\"That’s right! Kick their asses!\"</p><br/><p>\"It’s driving us mad!\"</p><br/><p>The three girls were talking at the same time, and Zhang Yang couldn’t decipher a piece of information. All he could hear was some noise.</p><br/><p>The Sailor Moon were not too far from Thunderstorm Castle, so it only took approximately 20 minutes for Zhang Yang to arrive. There were more than 10 male players present at the scene. They were of different professions, different races. These men were surrounding three girls in white robes. They had them trapped beside a lake, surrounded by half of a circle of men, with their backs against the lake.</p><br/><p>These men did not attack, and they were all smiling like perverts. They would heal each other whenever the girls attacked them. And whenever the girls attempted to use their [Teleportation Scroll], they would wait for the right timing and launch an attack on the girls to interrupt the teleportation.</p><br/><p>Zhang Yang could not help but feel shame as a man. For the first time in {{God’s Miracle}}, he is actually seeing such immoral players! So, what’s difference between these players and those hoodlums who take liberties on girls on the streets?</p><br/><p>The only difference is that there are cops in the real world, but in {{God’s Miracle}}, these sorts of people can do whatever filthy deeds they want without having to worry about cops!</p><br/><p>With a closer look, these people are from that hoodlum guild, called the Rogue Family! And that filthy rich boy, Overlord Prince of Dragon City was among those hoodlums --- god damn it! Do know, that this fellow actually made Zhang Yang looked stupid in their previous engagement!</p><br/><p>He should have guessed it right, other than those hoodlums in the Rogue Family, no other players would do such a shameful thing.</p><br/><p>Zhang Yang patted Whitey and charged in on them, with a long leap and a \"shoof\"! He collided into the two healers standing at the back of the other hoodlums --- there were a total of 11 hoodlums, two of them were healers, two of them were spellcasters, three of them were thieves, two of them were hunters and two of them were warriors.</p><br/><p>\"Who’s there ---\" As these hoodlums were focusing their attention on the three girls, they had never thought or expect a man to charge in all of a sudden. It was until Zhang Yang’s sword reached the neck of a healer, when they realized what was happening.</p><br/><p>If it was up to an experienced and skillful player, the player would just activate {Terror Shriek} to terrify Zhang Yang with a moment of restriction effect! But, good skillful players were hard to come by these days, and these are mere hoodlums from the Rogue Family! How would it be possible to find good and skillful players in a guild like this?</p><br/><p>‘-4,193!’</p><br/><p>Zhang Yang swung his sword pass and the healer was inflicted with a damage. That value was one-third of his entire health bar! Meanwhile, Zhang Yang had gained a total of 37 rage points. Because when he was charging over to the hoodlums, he had already activated {Blood Rage}, and now he has a total of 67 rage points on his rage bar!</p><br/><p>Regular attacks will not trigger the common cool down of the skill sets. So Zhang Yang swung his [Sword of Purging Devourer] with a {Horizontal Sweep}!</p><br/><p>The sparks from the sword flew across the air, and the seven players from the Rogue Family were inflicted with damages ranging from 7,700 to 8,500 in the same moment. There was a critical attack on one of the spellcasters, which instantly killed the fellow!</p><br/><p>That was considered as a good strike! Then, the special effect of the [Sword of Purging Devourer] kicked in, and another wave of damages ranging around 7,000+ were inflicted upon every single hoodlum within the effective area!</p><br/><p>\"Argh ---\"</p><br/><p>The miserable crying continued and another three hoodlums were killed and turned into white lights, one after another.</p><br/><p>Whitey continued to attack with its claws, causing approximately 5,000 damage in every attack. For the hoodlums who were left with only a little health points left, these attacks with such an amount of damage would prove to be fatal. One touch is already a touch of death!</p><br/><p>\"Zhan, Zhan Yu!\" one of the hoodlums had finally set his eyes right on Zhang Yang’s face and recognized him. As he finally identified who the attacker was, he was shocked and angry at the same time! All the mixed expression was revealed on his face! \"We did not even touch a hair on your head, why would you ambush us? Don’t think that you can do whatever you like just because you’re the guild master of Lone Desert Smoke!\"</p><br/><p>\"Hahaha!\" Zhang Yang was amused, and he laughed hard. A hoodlum would actually try to appeal to his civility! It was really something to remember by!</p><br/><p>\"Stinky hoodlums!\" Sailor Mars threw out a ball of fire onto Overlord Prince of Dragon City and began to cast the spell for {Explosive Flame}.</p><br/><p>\"Eat this! Serves you right!\"</p><br/><p>\"Don’t ever think that we girls are meant to be bullied!\"</p><br/><p>The girls all squealed out in agitation at the same time, making it hard to hear their words. Sailor Chibimoon and Sailor Moon were also throwing balls of fire attack over to the hoodlums and began to cast their own {Explosive Flames} as well.</p><br/><p>Overlord Prince of Dragon City was shocked, \"Rogue Bunny, didn’t you said you’ll torture him to death? Now that he’s here already, why aren’t you doing it?\"</p><br/><p>Rogue Bunny was frowning with cold sweat, he was only trying to butter the spoiled rich boy! Now that Zhang Yang and his Lone Desert Smoke were in their prime, who would dare to challenge them now? Anyone who does that would be committing suicide! It could have gone way much better if that filthy rich boy could just forget everything he had ever said to butter him and not bring it up again!</p><br/><p>Zhang Yang shook his head, \"You are cornering and harassing my guild members, and you dare to question why I, as their guild master would charge in and interrupt you hoodlums? Ha! I can see that your heads have been knocked dead by a donkey!\"</p><br/><p>\"Knocked by donkeys so many times that they can’t even think straight!\"</p><br/><p>\"They have scrambled eggs for brains!\"</p><br/><p>\"I would say these hoodlums did not have brains, to begin with!\"</p><br/><p>The three ‘Sailor Moon’ were speaking and giggling all at the same time.</p><br/><p>Although Zhang Yang was still talking, his hands were still swinging his weapon around without any pause! He was currently equipped with almost a full set of Violet-Platinum equipment already, and the weapon within his hands was a Level 90 Violet-Platinum weapon. So, be it his attack or his defense, he was so powerful that these hoodlums should fear him to the point that they should flee on sight!</p><br/><p>On the other hand, these hoodlums from Rogue Family had just reached Level 70, and they had just purchased some Level 70 Gray-Silver equipment. So, their attacks could not even inflict any physical damage on Zhang Yang, not even a little! Although their spell-type attacks could still pose a threat to him, but those 1,000 to 2,000 flashes damage would mean nothing on the 100,000+ health points of Zhang Yang! Even if Zhang Yang stood still and allowed them to hit him, it would take hours, or even longer to empty out his health bar!</p><br/><p>Not to mention that Zhang Yang has assistance from the three ‘Sailor Moon’ girls. Although their levels weren’t that high and their equipment wasn't that good, the focus fire of three spellcasters was obviously very powerful. It served greatly as a support from the side. In just a brief moment, they had already sent every single one of the hoodlums, including Overlord Prince of Dragon City to the Graveyard.</p><br/><p>\"Humph!We just proved to them that girls are not to be bullied! Pile up their dead bodies! Make sure they get the message!\" Sailor Chibimoon seemed to be making threatening gestures while saying it.</p><br/><p>Zhang Yang took a glance at the faces of the three girls, and he understood why that Overlord Prince of Dragon City would be so interested in them.</p><br/><p>The three girls had almost the exact same faces! And all three of them were pretty and young, and full of youthful energy!</p><br/><p>Although players can customize their faces in the game, it would be extremely hard to customize their faces until they all looked the same! Only the natural born faces would look the same, and by scanning their facial features and making some adjustments, only can they make their faces so similar within the game!</p><br/><p>So thinking about the obvious, these three girls must be sisters in the real world.</p><br/><p>The sort of people like Overlord Prince of Dragon City would never be able to resist such delicate flowers, that was the main reason why he stuck around, putting in his best effort to keep them from leaving.</p><br/><p>\"Guildmaster, you are amazing! You shooed away these hoodlums single-handedly!\" Sailor Mars was looking at Zhang Yang with admiration in her eyes.</p><br/><p>Zhang Yang laughed and said, \"That’s because you girls helped me out!\"</p><br/><p>The three girls looked at each other and began to giggle with their hands up to their mouth, accentuating their round boobies.</p><br/><p>\"You three are sisters, aren’t you?\" Zhang Yang asked the girls while he picked up all the items and equipment that fell from the hoodlums after they died. Although he was not interested in the equipment, it would be better for him to pick them up than to leave them there, waiting for the hoodlums to come all the way back. This should teach them some manners!</p><br/><p>\"Yes, in fact, we are triplets!\" Sailor Moon pointed at herself and said, \"I’m the eldest, the first to be born. This is the second, only 3 minutes after me. Last but not least, she is the youngest, born 5 minutes after that!\" She pointed at Sailor Chibimoon and Sailor Mars while explaining.</p><br/><p>Zhang Yang nodded, as he took out two of the equipment, leather armor pieces, and passed them over to the girls, \"Here you go, it’s your share for our victory!\"</p><br/><p>\"Hehe!\" the girls took it without any hesitation and kept them into their backpack.</p><br/><p>\"So where are you from, sir?\" Sailor Moon asked him out of her own curiosity.</p><br/><p>\"Zhou Su City.\" Zhang Yang told them.</p><br/><p>\"Oh, what a coincidence! We’re attending classes in a university in Zhou Su City!\" Sailor Chibimoon clapped her hands in excitement.</p><br/><p>\"You did us a great favor, so please, let us repay you with dinner! Please?\"</p><br/><p>\"That’s right, you must come, little Bin is good at making dishes!\"</p><br/><p>\"So that concludes it, tomorrow night it is!\"</p><br/><p>The three girls were talking all at once again, and then giggled together.</p><br/><p>Zhang Yang frowned at the way they invited him to dinner. The girls said it all, he had not even opened his mouth yet!</p><br/><p>\"Then, you girls wouldn’t mind if I bring along two more people, right?\" Zhang Yang smiled. Since they looked so sincere, he could not just reject them already.</p><br/><p>\"Boy or girl?\"</p><br/><p>\"Girls!\"</p><br/><p>\"Your girlfriends?\" the three girls were filled with curiosity to find out.</p><br/><p>\"... you three are really talkative!\"</p><br/><p>1. Guerrilla tactics - a form of irregular warfare in which a small group of combatants uses military tactics such as ambushes, sabotage, raids, petty warfare, hit-and-run tactics, and mobility to fight a larger military force.</p><br/><p>2. Sailor Moon - Main character in Sailor Moon anime series.</p><br/><p>3. Sailor Chibimoon - one of the sailor character in Sailor Moon anime series.</p><br/><p>4. Sailor Mars - one of the sailor character in Sailor Moon anime series, representing Mars.</p><br/>\n</div>"}