{"title": "Chapter 387: Spirit of the Flame", "id": 387, "volume": 4, "url": "http://boxnovel.org/mmorpg-rebirth-of-the-legendary-guardian-chapter-387-spirit-of-the-flame", "volume_title": "Volume 4", "body": "<h1>Chapter 387: Spirit of the Flame</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 387: Spirit of the Flame</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>As the mining cave had been providing many different kinds of mining ore, Thunderstorm Castle had already been built up to the Level 2 city defense and they were almost reaching Level 3 city defense!</p><br/><p>In other words, the total amount of mechanical Servants that Thunderstorm Castle could accommodate would be up to 1,000!</p><br/><p>These were 1,000 Level 85 elites! With the help of the players, if there is another monster attack, Zhang Yang was confident that he could easily defend Thunderstorm Castle against a monster attack.</p><br/><p>\"Noob tank, did you get any good items? Your smiling so tightly that your eyes have disappeared!\" Wei Yan Er said sweetly.</p><br/><p>\"Is it that bad?\" Zhang Yang smiled as he asked.</p><br/><p>\"Yes! Yes!\" Wei Yan Er nodded again and again.</p><br/><p>Zhang Yang then posted the [Fragment of the Allspark]’s description in party channel, and everybody ‘ooed’ at it.</p><br/><p>\"Oh my gosh, our Thunderstorm Castle is going to reach Level 3 city defense, would it be possible to accommodate 1,000 robots?</p><br/><p>\"He he, if other guilds want to attack our territory, I can’t imagine their expressions when they see our elite robots!\"</p><br/><p>\"Ha ha ha, it must be quite interesting!\"</p><br/><p>Everyone was laughing joyfully, while Wei Yan Er was more interested in the boss’ loot. Therefore, she quickly ran over and picked up the loot.</p><br/><p>[Titan Handguards] (Violet-Platinum, Heavy Armor)</p><br/><p>Defense: +80</p><br/><p>Vitality: +564</p><br/><p>Strength: +378</p><br/><p>Dexterity: +161</p><br/><p>Class Requirement: Berserker</p><br/><p>Level Requirement: 80</p><br/><p>Titan Armor Set (1/8):</p><br/><p>3 pieces: Increases your Strength attribute by 500 points.</p><br/><p>5 pieces: Reduces {Tornado Cleave}’s cooldown time by 1 second.</p><br/><p>8 pieces: Every time you successfully hit a target, there is 1% chance to acquire ‘Blessing of Titan’, inflicting serious damage to the target.</p><br/><p>Zhang Yang was very excited when he saw [Titan Handguards] but when he read the equipment’s details further, he almost collapsed! As it was the Titan Armor Set for Berserkers. These game developers were pretty lazy, they did not even bother to change the name of armor set!</p><br/><p>Without a doubt, this equipment would go to Wei Yan Er. The little brat was extremely happy, and her beautiful eyes became crescent moons as she smiled.</p><br/><p>[Fearless Hammer] (Violet-Platinum, One Handed Hammer)</p><br/><p>Weapon Attack: 1,305 – 1,705</p><br/><p>Attack Interval: 2.8 seconds</p><br/><p>DPS: 538</p><br/><p>Equipment: After successfully hitting the target, there is 1% chance of recovering 500 HP.</p><br/><p>Level Requirement: 80</p><br/><p>This hammer could be used by Guardians, Defenders and Bandits but Defenders had {Mace Mastery}. On the other hand, there were no Bandits in the party, and Zhang Yang already had the [Sword of Purging Devourer]. Therefore, this hammer suited Endless Starlight the best.</p><br/><p>[Flag of Brave Fight] (Violet-Platinum, Accessory)</p><br/><p>Use: Increases your Strength attribute by 1,000 points. Lasts for 15 seconds. Cooldown time: 3 minutes.</p><br/><p>Level Requirement: 80</p><br/><p>\"Wow! It is mine! It is mine!\" Wei Yan Er smiled even happier, today must be her harvest day!</p><br/><p>Certainly, the accessory that increases Strength attribute should be prioritized for Berserkers. Therefore, Wei Yan Er happily received the [Flag of Brave Fight]. The boss’ loot was left with only six pieces of Yellow-Gold equipment, and after distributing two pieces of Yellow-Gold equipment, the rest of the Yellow-Gold equipment was given to Zhang Yang to sell in Little Merchandise Shop.</p><br/><p>\"Let’s return to the city! Let’s return to the city!\" Wei Yan Er could not wait for her equipment and weapons to be identified, and of course, she would want Zhang Yang to pay up for her!</p><br/><p>Everyone was unable to walk out from this cave, therefore, they tore off [Teleportation Scrolls] and returned to White Jade Castle.</p><br/><p>Little brat dragged Zhang Yang to the Item Identifier to identify her [Titan Handguards]. After that, Zhang Yang went to his Little Merchandise Shop to put on the equipment they had just looted for sale. Next, Zhang Yang went to the auction house to seek for some good items as this was also one of his interests.</p><br/><p>\"Come on, have a look at these!\" a lot of street vendors were nearby the entrance of an auction house and obviously these people were unwilling to be defrauded of the 20% transaction fee by the auction house, therefore, they chose to peddle outside auction house. Besides, there was no better place than to peddle outside the auction house.</p><br/><p>There were a few good items for sale there, and some Yellow-Gold equipment too! Unfortunately, Zhang Yang already had a lot of equipment and he was only interested in skill books and recipes!</p><br/><p>\"Hey brother, don’t look at that Yellow-Gold equipment, you cannot afford them! Come here, look at the Level 70 Gray-Silver equipment, they are good and cheap. Let me tell you frankly, you do not have many chances to battle against bosses, thus, it is pointless for you to equip all the Yellow-Gold equipment. Gray-Silver equipment would be better as it is affordable and fulfills your requirement of gaining levels!\"</p><br/><p>When Zhang Yang was browsing around, that street vendor took the initiative to chat with Zhang Yang.</p><br/><p>Initially, Zhang Yang did not notice who the street vendor was. When he looked up at the street vendor, he was an Orc Bandit, and equipped with nondescript equipment. He was wearing a cloth armor hat, heavy armor boots and holding a scarlet staff!</p><br/><p>Indeed, bandits could wear cloth armor but cloth armor did not increase any Strength and Dexterity attributes, therefore, it would be pointless to wear cloth armor! Similarly, Bandits could wear heavy armor but heavy armor would not add any attributes to bandits. Same went to the staff, Bandits could equip stave,s but the staff would not add damage attributes to a Bandit.</p><br/><p>In short, this bandit was either an idiot, or is simply trolling about!</p><br/><p>However, the cloth armor hat, heavy armor boots, and scarlet staff the Orc Bandit were wearing and holding were all Yellow-Gold grade! Besides, these were all the top equipment at the current phase, with Violet-Platinum equipment being a luxury equipment.</p><br/><p>‘Big Cannon, Level 76, Male, Orc Bandit, .’</p><br/><p>This Orc Bandit deserved the name Big Cannon, as he was good at exaggerating the equipment and criticized Zhang Yang when he first saw Zhang Yang! However, he was correct as ordinary players truly needed only Gray-Silver equipment to fulfill their requirement of gaining levels, and ordinary players hardly battled against bosses! But this Orc Bandit liked to bad-mouth and easily offended people.</p><br/><p>Zhang Yang did not bother him much. Zhang Yang also hid his profile as he did not want people to recognize him to avoid causing any trouble. Because of this, some arrogant fellows would often swagger around him.</p><br/><p>Big Cannon continued as he saw Zhang Yang smiled at him, \"Brother, what is your level now? Don’t worry, here I have equipment from Level 20 to 70 and these will definitely fulfill your requirement! Look at me, I’m wearing all the Yellow-Gold equipment, I look cool right?\"</p><br/><p>It’s more than just cool, it was actually convulsion!</p><br/><p>Zhang Yang laughed and said, \"I’m not interested in equipment, show me some skill books and recipes!\"</p><br/><p>Zhang Yang had been waiting impatiently for [Zombie Potion]’s recipe as he was not able to find it, and so far he never saw anyone selling it in auction house yet.</p><br/><p>\"He he, you are seeking for the right person! Our guild just defeated a Yellow-Gold boss yesterday and it dropped a pet skill book, but our guild’s main force doesn’t have a Hunter, and the rest of the Hunter members in our guild do not value this good skill book, so I’m taking it out for sale. Have a look at this, this is the best pet skill book {Spirit of the Flame} and I’m only selling it for 10,000 gold coins!\" Big Cannon was acting like a pimp, he took a skill book with red cover from his inventory and showed it to Zhang Yang.</p><br/><p>{Spirit of the Flame}?</p><br/><p>En!</p><br/><p>Zhang Yang’s eyes suddenly shone, could it be that skill? If so, I must have found good stuff!</p><br/><p>\"Fine, I want this!\" Zhang Yang nodded with great satisfaction.</p><br/><p>\"Honey, my petal hasn’t learned any skills yet, buy me a pet skill book!\" at that moment, a Human couple appeared in front of Zhang Yang, the male’s name was Overlord Prince of Dragon City, while the female’s name was Rose Fairy.</p><br/><p>The female was embraced within the male’s arms as she cooed. The female was a Hunter, and there was a floral-spotted tiger following behind her.</p><br/><p>Overlord Prince of Dragon City patted the female’s hand and talked to Big Cannon with an arrogant expression, \"What pet skill books do you have? Show me the most expensive one, I have a lot of money!\"</p><br/><p>\"Honey, you are so domineering!\" Rose Fairy said with an admirable expression.</p><br/><p>Overlord Prince of Dragon City lightly touched the female’s chest and smiled with a complacent face.</p><br/><p>F*ck, that was the typical wealthy fool!</p><br/><p>Big Cannon quickly waved the {Spirit of the Flame}’s skill book towards Overlord Prince of Dragon City and said, \"Overlord Prince, right? Have a look at this {Spirit of the Flame}’s skill book, yesterday our guild defeated a Yellow-Gold boss and it dropped this skill book. This absolutely a godly skill book! How is it? I know that Overlord Prince, you are rich, if the price I offer is too low, it would mean that I am looking down on you, Overlord Prince. So, 50,000 gold coins it is!\"</p><br/><p>Although Big Cannon was bad-mouthed, he was good at hoodwinking people, and he successfully hoodwinked that Overlord Prince of Dragon City into confusion!</p><br/><p>\"Honey, I want this!\" Rose Fairy shook Overlord Prince’s arm as she said.</p><br/><p>Zhang Yang was frowning, he did not bother how Big Cannon hoodwinked Overlord Prince, but Zhang Yang must get that {Spirit of the Flame}’s skill book! Zhang Yang said, \"Big Cannon, I had eyes on that {Spirit of the Flame}’s skill book first!\"</p><br/><p>\"Hey, who the hell are you?!\" Rose Fairy stared at Zhang Yang.</p><br/><p>Big Cannon said, \"Brother, I haven’t sold this skill book to you yet! I’m sorry, we are just trading for money, right? Overlord Prince, he is willing to buy this with 50,000 gold coins. Dude, please don’t call this injustice if you don’t have money. Nowadays, everyone looks at the money!\"</p><br/><p>This was going to be trouble!</p><br/><p>Zhang Yang sighed as he said, \"Alright, I will buy this with 50,000 gold coins, first come first serve!\"</p><br/><p>Overlord Prince of Dragon City was frustrated then shouted, \"60,000 gold coins!\"</p><br/><p>\"Honey, you are so imperious!\" Rose Fairy supported Zhang Yang, and some females really loved to see their man flaunting his wealth for their sake.</p><br/><p>However, Zhang Yang would not do such a thing like these wealthy fools, even though he was very rich himself, as it was not worth it at all! But this was related to {Spirit of the Flame}’s skill book, he had to get the skill book!</p><br/><p>\"70,000!\" he said calmly.</p><br/><p>\"80,000!\"</p><br/><p>\"100,000!\"</p><br/><p>\"110,000!\"</p><br/><p>\"200,000.\" Zhang Yang lost his patience and started adding the bid by 100,000.</p><br/><p>Overlord Prince of Dragon City suddenly laughed and said, \"Damn it, is this guy a confederate?! You really thought that I’m a wealthy fool and don’t understand what you two doing?\"</p><br/><p>F*ck, if you are not a wealthy fool, then who else is the jackass?!</p><br/>\n</div>"}