{"title": "Chapter 388: The Competition", "id": 388, "volume": 4, "url": "http://boxnovel.org/mmorpg-rebirth-of-the-legendary-guardian-chapter-388-the-competition", "volume_title": "Volume 4", "body": "<h1>Chapter 388: The Competition</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 388: The Competition</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Overlord Prince of Dragon City could not believe Zhang Yang, and even Big Cannon also shocked, he looked at Zhang Yang as he said, \"Dude, you don’t make trouble just because I’m not selling the skill book to you! You are poor, because you were born in a poor family’s background and you are disappointed, I get it, just don’t blame society for it!\"</p><br/><p>F*ck, Zhang Yang could not bear with them anymore!</p><br/><p>Zhang Yang opened up Trade window with Big Cannon and keyed in 200,000 gold coins, but he never selected \"Confirm transaction\".</p><br/><p>In ‘God's Miracle’, the amount of money keyed into the Trade window is restricted by the players’ money. If the players had 100,000 gold coins, they would not be allowed to key in 100,001 gold coins in the Trade window, even an extra copper coin was not allowed!</p><br/><p>The reason Zhang Yang did so just to prove to Big Cannon that he could pay the price of 200,000 gold coins.</p><br/><p>Big Cannon stopped talking, regardless of who the winner of this auction is, he would be the biggest winner of all!</p><br/><p>From Big Cannon’s reaction, both Overlord Prince of Dragon City and Rose Fairy realized that Zhang Yang actually able to pay 200,000 gold coins.</p><br/><p>\"Honey!\" Rose Fairy saw that Overlord Prince of Dragon City did not continue bidding, she shook Overlord Prince of Dragon City’s arm again and again as she acted like a spoiled child.</p><br/><p>\"… 210,000!\" Overlord Prince of Dragon City endured the pain in his heart! He must be an idiot for wasting so much money to buy a pet skill book that he was not even sure about! Although he was pretty rich, he did not reach the level that he could simply spend the money like water.</p><br/><p>Rose Fairy was immediately contented with Overlord Prince of Dragon City’s reaction and gave a snort of disgust towards Zhang Yang. For her, this is not about {Spirit of the Flame}’s skill book anymore but pride!</p><br/><p>\"300,000.\" Zhang Yang was not going to give up {Spirit of the Flame}’s skill book, therefore, he continued bidding with Overlord Prince of Dragon City and Rose Fairy. Zhang Yang sighed internally as he realized that he had acted almost similarly to the both of them.</p><br/><p>Overlord Prince of Dragon City’s facial expression had changed, and his veins on his face almost burst as 300,000 was been far beyond the limits he can tolerate.</p><br/><p>Overlord Prince of Dragon City sent a private message to Zhang Yang, \"Bastard, get out of my way immediately. Otherwise, I will order my followers to kill until your level drops to zero!\"</p><br/><p>This scumbag, did he not know that the game had already revised such a function?</p><br/><p>Zhang Yang ignored Overlord Prince of Dragon City and talked to Big Cannon, \"300,000 gold coins, and hurry up, wrap it up already!\"</p><br/><p>Big Cannon looked at Overlord Prince of Dragon City, but Overlord Prince of Dragon City avoided Big Cannon’s gaze. Therefore, Big Cannon knew what to do, and he said, \"Alright, deal!\" the skill book that he intended to sell at 10,000 had been jacked up to 300,000, therefore, he had nothing more to complain!</p><br/><p>Rose Fairy anxious and yelled, \"Honey! Quickly, increase the bid! Bid him to death!\"</p><br/><p>\"Increase my *ss!\" Overlord Prince of Dragon City got angry, turned around and slapped Rose Fairy in her face. Because PvP was not allowed in the main city, Overlord Prince of Dragon City was not able to slap Rose Fairy, but waved his hand in front Rose Fairy’s face and slapped the air.</p><br/><p>Rose Fairy turned furious and yelled loudly, \"You this weakling scumbag, you cannot fight against others so you decide to release your anger on me! You son of the b*tch, I’d rather get f*cked by a dog, I don’t want you to touch me!\"</p><br/><p>She flung Overlord Prince of Dragon City’s arm away and ran away without looking back.</p><br/><p>Zhang Yang already completed the transaction with Big Cannon and got the {Spirit of the Flame}’s skill book.</p><br/><p>He summoned Mythical Turtle and patted {Spirit of the Flame}’s skill book on the Violet-Platinum Mythical Turtle, and let it learn the skill.</p><br/><p>{Spirit of the Flame}: After activating this skill, all of the pet’s physical damage will cause Fire damage. Lasts for 10 minutes. Cooldown time: 1 hour.</p><br/><p>This was an extremely powerful skill!</p><br/><p>Most of the bosses in ‘God's Miracle’ had high physical defense and low Magical resistance. Therefore, when the pet activates {Spirit of the Flame}, the pet will completely ignore the boss’ defense and cause terrifying damage!</p><br/><p>This was also similar to Zhang Yang’s {Eagle Eye}!</p><br/><p>Although {Spirit of the Flame} only lasted for 10 minutes, it is sufficient to fight against the bosses at the current phase! When fighting against minions, there would be no need of activating such a powerful skill at all.</p><br/><p>Ta ta ta!</p><br/><p>As Zhang Yang planned to enter the auction house to continue looking around, he saw that there were about 10 players riding war horses towards him from the corner of the street. One of them looked high-handed, like he was some sort of famous figure.</p><br/><p>Eh?</p><br/><p>Zhang Yang was lightly stunned internally as the person who was leading the group was somebody he knew long ago, Rogue Bunny from Rogue Family! Those following behind him were the Bunny brothers.</p><br/><p>\"Overlord Prince, which vulgar fellow triggered your anger? We, Rogue Family, will help you destroy him!\" Rogue Bunny patted his chest as he said, and his face was full of righteousness.</p><br/><p>Overlord Prince of Dragon City laughed out loud and looked at Zhang Yang as he said, \"Bastard, I already warned you! Whoever fights against me, will pay a price! How is it? I have so many people with me, now you should be afraid of me!\"</p><br/><p>Rogue Bunny walked forward and he suddenly frowned as he recognized Zhang Yang, \"Why does this fellow look so familiar?!\"</p><br/><p>Bunny Bro Three also walked forwards and looked at Zhang Yang carefully. Suddenly he cried out involuntarily, \"He was the bastard fellow who tricked us into saying \"we are all stupid\" in the beginner villages, after that he annihilated all of us!\"</p><br/><p>\"He is…\"</p><br/><p>\"… Zhan Yu!\"</p><br/><p>\"Zhan Yu!\" be it the members of Rogue Family, Overlord Prince of Dragon City or Big Cannon, all of them showed a shocking expression. Ever since Soaring Swords competition, Zhang Yang had become the China’s top player and commanding the strongest guild in China, who would not be aware of this?!</p><br/><p>Overlord Prince of Dragon City was taken aback and said, \"Zhan Yu, since you are a famous figure, I will show you some respect! As long as you apologize, we are even!\"</p><br/><p>Zhang Yang laughed as he said, \"Why should I apologize? I wanted this skill book first and you wanted to snatch it away from me, and now you call your people over to gang up on me? Although I don’t like to make trouble, that doesn’t mean that I’m a coward!\"</p><br/><p>Zhang Yang did not intend to argue with Overlord Prince of Dragon City, and since PvP was not allowed in the main city, Zhang Yang directly moved forwards into the auction house.</p><br/><p>\"Bastard!\" Overlord Prince of Dragon City was extremely angry, and he pulled his sleeves and made to chase after Zhang Yang.</p><br/><p>\"Overlord Prince!\" Rogue Bunny quickly stopped him and said, \"Zhang Yang has Lone Desert Smoke behind his back, we can’t afford to offend him!\"</p><br/><p>Overlord Prince of Dragon City calmed down a little, but he was still angry and said, \"I cannot take it! If we let him go just like this, how am I going to face people in the future?\"</p><br/><p>\"Overlord Prince, calm down, there is still a chance in the future! The true man must endure a moment of anger and wait for the right timing and chance to fight against the enemy!\" Rogue Bunny thought as he said, \"Besides, we are not allowed to PvP in the main city. Let’s look for a chance to ambush him in the open world! Although that fellow is the China’s top tank, how can he fight against 40 of our people? Even the invincible King Kong will also be defeated by us!\"</p><br/><p>\"Ha ha, deal! You keep your eyes on him, as long as this deal is done, I’ll reward you!\"</p><br/><p>\"Thank you, Overlord Prince!\"</p><br/><p>…</p><br/><p>Zhang Yang did not find good stuff in the auction house. After searching around, he used a [Teleportation Scroll] and returned to Thunderstorm Castle. Most of the main quests at the moment could not be completed, and the last [Key fragment] could only be found at Level 90 map, Ten Barren Sea; while the second seal of [Sword of Purging Devourer] could only be unsealed when he is able to enter Chaos Realm, and the other two main quests also could only be continued after he entered Chaos Realm. Thus, he had nothing to do now other than to train for his levels.</p><br/><p>The use of [Fragment Allspark] was very restricted, as it could only be used in Thunderstorm Castle. Otherwise, the mechanical Servants Zhang Yang summon would disappear automatically after five minutes. Zhang Yang urged the guild members to quickly gathered the ingredients to upgrade the Thunderstorm Castle to a Level 3 city defense.</p><br/><p>[Fragment Allspark] created a mechanical Servant every hour. Theoretically, 72 mechanical Servants would be created within a day of real time and seven days were required to reach the number of mechanical Servants to accommodate a Level 2 city defense.</p><br/><p>The guild members of Lone Desert Smoke were pretty supportive, as all of them aggressively looked for the ingredients to upgrade the Level 3 city defense as Zhang Yang urged them. Of course, Zhang Yang would not allow his guild members to work for nothing, and he bought all of their ingredients at market price.</p><br/><p>After a day, Zhang Yang and his guild members were to meet their semi-final’s opponent in battle, which was Lone Desert Smoke’s sub-guild!</p><br/><p>Indeed, it was a battle between Lone Desert Smoke and Lone Desert Smoke!</p><br/><p>Due to Mountain Mover’s outstanding commands, the sub-guild performed with excellent competitiveness instead of performing like a low ranked guild! They continuously beat opponents and overcame difficulties, and finally, they met their main guild in the semifinals, which made a lot of people astounded with the capability of Lone Desert Smoke’s sub-guild!</p><br/><p>Of course, Sage of God Killer, the guild master of Sage of God's Path was extremely regretful!</p><br/><p>Both sides underwent a friendly battle, and lastly, sub-guild automatically threw in the towel and quitted the battle. As a result, the sub-guild was going to battle against Imperial Sky and Radiance for the third place.</p><br/><p>After a while, the battle between Imperial Sky and Radiance had ended and Imperial Sky finally won the battle, which caused Radiance’s battle of revenge to fail. This also meant that, the finale of the guild war was similar to the Soaring Swords competition’s final, which was a battle between Lone Desert Smoke and Imperial Sky.</p><br/><p>This finale also caused a lot of discussions in the forum, had Imperial Sky also dispatched a cyber army to criticize Lone Desert Smoke, as a Level 3 guild was being oppressive towards a Level 2 guild. Even if they win the battle, they would have won disgracefully, which would shame China’s strongest guild!</p><br/><p>Zhang Yang did not even bother about it and he would not talk about fairness with Imperial Sky. Besides, he upgraded his guild level by killing the boss and the boss dropped a [Level 3 Guild Upgrade Order], he paid hard work for it, why should Zhang Yang give up this superiority?</p><br/><p>After a day, the battle between Lone Desert Smoke and Imperial Sky finally commenced!</p><br/><p>Previously, both of these guilds were fighting each other on a smaller scale, and they did not have a war with each other. Therefore, this guild war attracted a lot of attention, countless of players came to the audience seats and were ready to enjoy the war between two strong guilds!</p><br/><p>Certainly, almost 90% of the people believed that Lone Desert Smoke would win the final victory. After all, everyone had seen the capability of Lone Desert Smoke, besides, the number of Lone Desert Smoke’s people were more than half of the opponent. If Lone Desert Smoke could not win this, it would be doubtful whether it is a one sided contest!</p><br/>\n</div>"}