{"title": "Chapter 394: Imperial Sky Assault (4)", "id": 394, "volume": 4, "url": "http://boxnovel.org/mmorpg-rebirth-of-the-legendary-guardian-chapter-394-imperial-sky-assault-4", "volume_title": "Volume 4", "body": "<h1>Chapter 394: Imperial Sky Assault (4)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 394: Imperial Sky Assault (4)</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>If the 500 men that Imperial Sky had just produced could turn the tide of war, then the 1,000 heads of Mechanical Servant that Zhang Yang had just summoned could easily send Imperial Sky packing home, with their tails tucked between their legs.</p><br/><p>Just when they thought that victory was at hand, Zhang Yang had pulled something out from his pocket, using some sort of cheat code!</p><br/><p>\"Haha! Just look at their faces! It’s funny as hell!\"</p><br/><p>\"Haha! I’ll tell ya, if this was a comedy movie, they could really be holding that little gold man in the Oscars!\"</p><br/><p>\"Yo! Quit playing, guys! Might as well try acting for a change of profession!\"</p><br/><p>One by one, when the tables had turned against Lone Desert Smoke, players from Zhang Yang’s side started to taunt the enemy.</p><br/><p>Before the order of attack, the mechanical army had stood still, behind the castle wall, and after Zhang Yang had called for the attack, each mechanical soldier had mobilized and jumped across the frontlines - towards the back of Imperial Sky’s defense line.</p><br/><p>With the rain of hell being laid down to Imperial Sky, players of Lone Desert Smoke regained their vigor and joined the fray.</p><br/><p>Statistically speaking, Lone Desert Smoke had caused quite a lot of trouble with just 1,000 elite tiered monsters at Imperial Sky’s doorstep. However, no matter how strong they may be, the mechanical soldiers were not as strong, or rather, as smart as a player! They could be easily tricked. As long as the enemy tanks could draw their aggro towards them, other players could easily handle them. However, a player would not be too direct. Naturally, they would have to deal with those \"tofu\" class and have the mechanical servant knock on hard wood.</p><br/><p>Now that Lone Desert Smoke had the mechanical servants at their command, the output strength was not as simple as 1+1=2. It was rather like a chemical reaction that would produce a massive change. It would be like introducing sodium, or even potassium metal, to water! The reaction it gives would be literally explosive!</p><br/><p>\"Zhan Yu! Don’t you think that you have won this yet!\" said One Sword Stroke, as he saw how Imperial Sky’s forces were being pushed back, like a Snow Plower on the street after a cold December snow storm.</p><br/><p>Zhang Yang smirked. Unless One Sword Stroke could summon an army like he did, there was absolutely no reason to be scared of him! He then replied confidently. \"Accept your loss. This is the end, One Sword Stroke!\"</p><br/><p>One Sword Stroke suddenly smiled knowingly, as if he had another trick up his sleeve. \"Did you really think that I would be stupid enough to fight you, head on in the front lines? Knowing clearly that I would die?\"</p><br/><p>\"OOhhhh! I see what going on!\" said Zhang Yang also with a smile. \"You must be hiding some kind of \"super-secret\" strategy that you have already started? Like, did you have several Thieves sneaking pass the front line and trying a \"backstab\" strategy?\"</p><br/><p>One Sword Stroke dropped his smirk. He knew that something was odd from the way Zhang Yang had said it.</p><br/><p>The method or means to win a Territory Conquest battle was not the kill count. If they could achieve a complete wipe, that would be great as well. The defender side would have the upper hand for they had the grounds to defend. On the contrary, the attacking side would not have to blindly attack with brute force. The method or means to win a Territory Conquest lay at the guild’s final flag that stood in the main hall!</p><br/><p>One Sword Stroke’s main plan was to breach the main defense line. He did not care about wasting any resources. He was willing to sacrifice as many men as he wanted to get the main defense line broken. After that, he would order his team of Thieves to stealthily sneak through and destroy the flags in the main hall! Once the flag is taken, it would be Imperial Sky’s victory.</p><br/><p>\"I applaud your brilliant effort of deploying such powerful forces. But, now that you had expended such forces in the front line, how is the defense in the Territorial Hall?\" said One Sword Stroke.</p><br/><p>Zhang Yang’s smirk turned into a deafening laughter. \"You said it yourself, that it would be stupid to fight in the front lines. However, let’s be clear at one thing. Even if we died right here and now, as long as the flag stills stand in the main hall, we will not lose! I feel that calling yourself stupid would be an understatement! Do you really think that I left the hall unprotected? Please do not associate your stupidity with anyone! It’s truly degrading!\"</p><br/><p>One Sword Stroke nearly choked himself at such an insult. Not only did Zhang Yang have the upper hand in combat, he also had the most poisonous tongue that anyone would probably lose their nerve whilst be talking to him! That, and the mother**** army of mechanical servants!</p><br/><p>Those Level 85 elite tier soldiers could deal devastating damage to those non-tank class players! How could Imperial Sky still stand toe to toe with such enmity?</p><br/><p>At the same time, Zhang Yang had just received a notification from Sun Xin Yu, saying, \"There were around 20 stealth Thieves entering the main hall, I have killed them all. There’re no further threats here.\"</p><br/><p>In the next moment after Zhang Yang had given his acknowledgment to Sun Xin Yu, One Sword Stroke was seen shouting madly at something. He had even thrown his sword down in a fit of anger. Zhang Yang could have easily guessed that when he had just received the good news, One Sword Stroke had received the news of his \"backstab\" attempt having failed remarkably.</p><br/><p>Based on the recent feat, Zhang Yang could still confidently say that Lone Desert Smoke has won the Territorial Conquest.</p><br/><p>Zhang Yang relayed the good news and boosted the morale of his own guildmates. It was the ripe time to engage the final counter attack! A full-scale counterattack!</p><br/><p>Having the mechanical servants to be the meat shields and the main attackers at the same time, members of Lone Desert Smoke could not have it any better. With great vigor, everyone laid down the last attack.</p><br/><p>At this time, before the attack reached them, there were many players instantly dropping out of the guild. Due to the system only allowing players from the two guilds involved in the Territorial Conquest battle to remain in the battlefield, players who left the guild were instantly removed from the map.</p><br/><p>\"Crap! They had actually resorted to that method to escape?\"</p><br/><p>Zhang Yang thought to himself. The players who had just left the guild should be the elite players from Rolling Rocks, and Storm Riders that were assigned to Imperial Sky. Now that the fate of them losing the battle had been sealed, there was no reason for them to remain in the fight, only to throw their life away, losing experience points and equipment durability!</p><br/><p>In reality, all that Zhang Yang had thought was the truth to that was what One Sword Stroke was facing. If he could cry a river, he would have!</p><br/><p>His greed was too large. He wanted to assimilate both Rolling Rocks and Storm Riders. Little did he think that doing so would require him to win the Territorial Conquest. In this case, not only was he was on the verge of losing his dream to create a mega-guild, he was being literally pressed down by none other than Zhang Yang!</p><br/><p>One Sword Stroke had wanted to permanently keep the members that had entered his guild. Just like how the ancient philosopher, Liu Bei had \"borrowed\" the province of Jing! Borrowed but not returned! It was rather unfortunate for him that the players had already left on their own even before One Sword Stroke could persuade them to stay.</p><br/><p>It was a legendary failure!</p><br/><p>10 minutes after members of Imperial Sky had left, Lone Desert Smoke had gained an immense advantage, and had slaughtered the enemy clean, with no survivors!</p><br/><p>‘Ding! Congratulations to guild Lone Desert Smoke for defeating all members of Imperial Sky! The Territorial Conquest has been won before the duration had ended!’</p><br/><p>Zhang Yang laughed and announced in the guild channel. \"Everyone, teleport to Thunderstorm Castle now and head towards the Mining Cave! There’s still The Dominators for us to kill!\"</p><br/><p>\"HURRAH!\"</p><br/><p>After the Territorial Conquest ended, the teleportation circle was reactivated. One by one, everyone used the [Teleportation Scroll] to \"fly\" to the main hall and proceed towards the mining cave with their mounts.</p><br/><p>\"Tell me something! What’s going on there?\" Zhang Yang contacted Fatty Han as he rode towards the battlefield.</p><br/><p>\"It’s alright. Even though we were short in hand, we were still able to hold it up with Mountain Mover’s leadership! How long will you take to reach here?\"</p><br/><p>\"Roughly 30 more minutes!\"</p><br/><p>\"Yes! That’s perfect! Once you arrive, we can finally start our counter-attack and kick that bastard so hard, his sh*t will burst out from his mouth!\"</p><br/><p>\"Please…Could you not be that disgusting?\"</p><br/><p>Since everyone in the guild had a mount of their own, the trip had only taken them 25 minutes to reach the Mining Cave.</p><br/><p>Once they arrived at the site, Zhang Yang only saw a sea of players, far larger than the one that he had just fought in the Territorial Conquest. The battle was between the Lone Desert Smoke sub-guild vs the greedy The Dominators and other guilds that had set their sights on the Mining Cave for a long time. They had gathered more than 50,000 to 60,000 players to fight this war.</p><br/><p>The location of the Mining Cave was rather a mountainous landscape, making it rather extremely wise to apply a well-thought strategy. Under the command of Mountain Mover, the sub-guild of Lone Desert Smoke was able to literally kite the entire guild left and right. They had never needed to have a frontal attack since it would only increase the loss of players in a fair fight. They had wanted to avoid that, thus the kiting. All for one sole purpose, to drag the battle longer, and to buy time until the main guild arrives.</p><br/><p>\"Guild master Zhan Yu, Crimson Rage has arrived to assist you!\" Zhang Yang had received a notification from Snow Seeker just as he was about to charge into the fight.</p><br/><p>\"That’s brilliant. Let’s get started then, shall we?\"</p><br/><p>Zhang Yang unsheathed his sword and rode to the frontmost of his army. \"Let’s kill some bastards!\"</p><br/><p>Dust started to form, as thousands of Crimson Flaming Horse galloped towards The Dominators and three other guilds. At the other side, Crimson Rage and their female fighters had emerged from the other side of a hill, forming a pincer attack against the enemy.</p><br/><p>\"Hold on! Why is the main guild here?\"</p><br/><p>\"Weren’t they fighting in the Territorial Conquest war with Imperial Sky?\"</p><br/><p>\"Crap! What is happening now!?\"</p><br/><p>The Dominators were unlike Imperial Sky, who had the guts and bravery to stand in battle, that much Zhang Yang would admit. The moment they saw the main guild came charging in, everyone started to lose their courage and started to panic.</p><br/><p>Humbly Gentleman gritted his teeth. \"D*mn that Imperial Sky?! How dare they call themselves the second strongest guild in China!? Even after allying with Rolling Rocks and Storm Riders, they still couldn’t hold off for f*cking 3 hours! Tch! Useless! F*cking useless!\"</p><br/><p>The moment Humbly Gentleman knew about the Territorial Conquest that was launched by Imperial Sky, he seized the chance to plan an attack to the Mining Cave. If everything had followed according to plan, Imperial Sky would have defeated Lone Desert Smoke and conquered Thunderstorm Castle, and he would have conquered the Mining Cave. After losing the war, Lone Desert Smoke would lose their soldier’s morale and firepower. There was no way that they could seize back the Mining Cave after tasting defeat.</p><br/><p>However, things have gone out of hand! Imperial Sky could not be hoped upon!</p><br/><p>Mountain Mover laid down the command, mobilizing all the remaining players of the Lone Desert Smoke sub-guild to join the incoming reinforcements to form a perfect surrounding attack.</p><br/><p>Truthfully speaking, the combined number of players of The Dominators and the other three guilds had outnumbered all of them. However, numbers do not win wars. On the contrary, they were lacking firepower. They could not be compared with Lone Desert Smoke main guild, and Crimson Rage! They could not even be on the same ground with the Lone Desert Smoke sub-guild! To make things worse, all of the players from the main guild had Gray-Silver mounts! Even all of the players from the sub-guild had Black-Steel mounts! It was a massive upgrade which the Dominators never had! It was not a battle anymore. It was just a slaughter fest!</p><br/><p>Compared to the enmity they had for Imperial Sky, players of the Lone Desert Smoke guilds hated the Dominators more. Now that they had the chance to kill them, everyone pulled their strength from the very depths of their souls to release their frustration towards them.</p><br/><p>Zhang Yang flew across the battlefield like an eagle searching for his prey. In this case, Zhang Yang was searching for Humbly Gentleman to maul. Among the crowd of players, Zhang Yang had to attack. He pulled his sword out and activated {Blast Wave} and {Horizontal Sweep} as many times as he can. With the special effect triggering repeatedly, the skills weeded down players like a scythe through a bush.</p><br/><p>\"Hypocrite…!\" Zhang Yang cried his name when all the other players by his side were finally killed. \"Why is it that every time I see your face, it would look like a poor, abused dog that would never stop barking!\"</p><br/><p>\"Don’t think too highly of yourself, Zhan Yu!\" said Humbly Gentleman through his teeth. \"Don’t think that your luck will always be at your side!\"</p><br/><p>\"Is that how you threaten me? Really? That’s the best you could think of?\" Zhang Yang laughed. With Sun Xin Yu and the rest of his personal elite party, they had surgically killed so many players to make their way towards Humbly Gentleman. With Zhang Yang’s sword’s special skill triggering endlessly, they had wiped the enemy from behind the enemy lines!</p><br/><p>Once they had realized that they stood no chance, the expression they wore quickly changed from madness to blind fear. Zhan Yu the killing machine was just too overpowered. How could one stand a chance to fight him when his sword could repeat the same skill as many times as possible!</p><br/><p>After half an hour into the battle, The Dominators and the rest of the guild were completely crushed beyond recognition. The remaining survivors had lost all hope and had left the battlefield, leaving a mountain full of dead bodies and dropped equipment. It’s like being struck by lightning and tornado at the same time; a complete, thorough catastrophe.</p><br/><p>Lone Desert Smoke’s consecutive battles were recorded by the members and were posted on the official forum, creating a hot sensation for a brief period of time. Everyone was naturally surprised and amazed at Lone Desert Smoke’s capability. But the most popular talk about the two wars was the appearance of the mechanical army!</p><br/><p>Weren’t they character from Transformers?!</p><br/><p>Especially during the scene where Zhang Yang would shout: \"Heaven Storm Tigers\". Everyone laughed at how comical Zhang Yang’s call was.</p><br/>\n</div>"}