{"title": "Chapter 397: Fallback", "id": 397, "volume": 4, "url": "http://boxnovel.org/mmorpg-rebirth-of-the-legendary-guardian-chapter-397-fallback", "volume_title": "Volume 4", "body": "<h1>Chapter 397: Fallback</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 397: Fallback</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>‘-952!’</p><br/><p>‘-953!’</p><br/><p>…</p><br/><p>With just one {Blast Wave}, the vampires gathering outside the house were stunned. More than 30 vampires had received the direct hit from that skill which had caused a high proccing chance for Zhang Yang’s [Sword of Purging Devourer] sword effect. The skilled chained for 4 procs and stopped at the fifth.</p><br/><p>Even though the skill had echoed four times, the monsters were all elite tier, with HP bars as high as 85,000! Four {Blast Wave} had only dealt close to 5% of their own HP. However, the accumulated damage had exceeded 120,000 damage! It was more than {Dance of Heaven and Earth} and {Chaotic Dance of Electric Current}. But {Blast Wave} had only a 20 second cooldown rate!</p><br/><p>That entrance of the brick house was a gate that shaped like a valve, forming a natural one-person blockade. The entrance had forced the vampire to bottleneck themselves, allowing only one monster to enter at a time. Zhang Yang was troubled since he could not use {Horizontal Sweep} efficiently. In fact, the skill had no penetrative effect, which only allowed him to attack just one vampire per skill usage.</p><br/><p>Obviously, the skill {Horizontal Sweep} that was obtained via a hidden quest and was ranked as the highest skill, had the greatest damage output. However, the AoE splash effect of the skill was completely rendered useless in this situation. Without the ability to hit multiple targets, the sword would lose its ability to proc properly. Zhang Yang’s DPS had been lowered drastically.</p><br/><p>Even so, Zhang Yang blocked the entrance. The vampires that had taken damage from the back had no means of pushing forward. Angered by frustration, the vampires shrieked again, causing the walls to vibrate in resonating with the sound waves. Dust and smaller pebbles started to fall off the walls. There were many other vampires that had started to claw their way through the brick walls. However, despite their effects, Sherry’s house was made from thick and solid bricks, and not fragile wood. The wall surrounding the house and the gates, stood still, while the vampires’ claws were already torn apart.</p><br/><p>Smiling at Zhang Yang, she said with pride. \"During the construction of the house, father had factored in the possibility of a vampire attack. He chose the sturdiest materials to build the bricks which formed the wall of the houses and the gates. These vampires stand no chance at breaking it down. Not even Desionia could break it!\"</p><br/><p>Zhang Yang laughed at her proud statement and asked, \"How about the upstairs windows?\"</p><br/><p>\"Fear not, the window frames had been coated and blessed with holy water. If the vampires were to enter through the windows, they would immediately turn into ash!\" said Sherryl.</p><br/><p>As to prove her point, Zhang Yang heard a scream of agony and the sound of fine sand falling onto the floor, coming from upstairs.</p><br/><p>Zhang Yang nodded with confidence that Sherryl would be safe, and only then did he turn back to the entrance and focused all his attention on killing the vampires. All skills were soon unleashed upon them.</p><br/><p>\"Warrior! Let me help you!\" Zhang Yang heard her voice from behind and felt a pair of warm hands rest on his back. The warmth of her hands spread out and enveloped his entire character. He then gained a new buff.</p><br/><p>[Sherry’s Blessing]: Restore 3,000 HP every 3 seconds for 30 seconds.</p><br/><p>It was obviously a priest {Regenration} skill - on steroids. Not even the super healer, Han Ying Xue could reach that amount. At most, at her current level, her {Regeneration} could only heal less than 2,000 at every tick!</p><br/><p>With the healing buff on him, Zhang Yang could relax a little. Even though healing 3,000 HP every 3 seconds could not heal him much, he had only been receiving damage from one monster at a time! Healing 1,000 HP every second could easily break even with the damage received, and still have much more left over!</p><br/><p>Both Zhang Yang and the white bear stood guard at the entrance, turning each vampire that tried to enter into a pile of ash. Although there were a hundred or more enemies, Zhang Yang had no problem reducing that number down with the help of his amazing sword.</p><br/><p>\"I’ve seriously underestimated you!\" cried Sherryl after seeing what Zhang Yang was capable of.</p><br/><p>Zhang Yang laughed and took out the [Laser Cannon] from his inventory. He aimed at one of the hottest spot among the vampire and fired the bazooka-like weapon. A bright light blasted away, the vampires around the area were damaged with 10,000 HP.</p><br/><p>It was a pity that the bazooka had 1 hour long cool down time! Even though he still had the mechanical servant in his inventory, he was genuinely afraid that the giant Devastator might tear down the house as it appears in the battlefield. It’s not like he was in need of its help for the moment, might as well be safe than sorry.</p><br/><p>From 300 to 100, Zhang Yang had speedily killed the vampires outside the entrance. Sherryl was just standing at one corner, gaping at Zhang Yang’s prowess. All she did was to heal Zhang Yang by a 30 seconds interval.</p><br/><p>\"Hold!\" Desionia bellowed from behind. Her voice carried some kind of sort of authoritative aura, and even Zhang Yang could feel the dominating power from it.</p><br/><p>\"Capture all the townsmen!\"</p><br/><p>Shush!</p><br/><p>One by one, the remaining vampires who were fighting Zhang Yang flapped their wings and shot into the sky. There was only a temporary silence before the screams and cries came echoing from the plaza. Zhang Yang asked Sherryl to get into the house.</p><br/><p>\"HAHAHAHAHA!\" the eerie laughter of Desionia could be heard. \"My sweet sweet Sherryl, you better come out or I’ll kill the people in the town~\"</p><br/><p>Zhang Yang clicked his tongue and turned towards Sherryl. \"Don’t fall for her lies. She just wants us to surrender! If she wanted to kill the townsmen, she would have already done so!\"</p><br/><p>Sherryl kept quiet and nodded her head.</p><br/><p>\"O Sherryl~~\" Desionia playful voice was heard as she descended down and landed in front of the house. Zhang Yang remained on guard. In her hands, she was holding an older man by the throat and said, \"Tell Sherryl your name~\"</p><br/><p>\"I-I-I. I’m Mogue—ACK!\"</p><br/><p>Just when the poor NPC had reported his name, Desionia had planted her fangs into the old man’s neck.</p><br/><p>\"NO! UNCLE MOGUE!\" cried Sherryl as she screamed. She opened the door to the house and started angrily at Desionia.</p><br/><p>After consuming the NPC blood, a blood red hue glowed on Desionia’s face, restoring the lost HP to its full status.</p><br/><p>[Blood Sucking]: Consumes the blood of your target and heal 10% of your HP every second. Lasts for 10 seconds. Cool down time: 5 minutes.</p><br/><p>Zhang Yang knows that the skill was only for Vampires to use. However, if he obtains the Vampire Inheritance, he would also inherit the skill!</p><br/><p>Thud…</p><br/><p>Desionia threw the now deceased Mogue to one side. There was still some blood stains on her hand. She then lifted her hand to her face and playfully lick the blood off her hands. There was an orgasmic expression on her face as she swallowed the blood.</p><br/><p>\"Now you see my dear~ I am done playing with you,\" said Desionia with a smile. With a quick movement, she grabbed one more townsmen that the vampire had already captured and said, \"Come out now~ Or~ I will kill another one! And another, until everyone is dead!\"</p><br/><p>What kind of sick f*ck would do that!</p><br/><p>Zhang Yang sighed heavily. Based on the norm, Sherryl would surely surrender herself in order to save her friends. After that, she would be kidnapped by the vampires and he would have to be the knight in shiny armor and kill the evil king in order to rescue the damsel in distress.</p><br/><p>Sherryl followed her guts and succumbed to Desionia’s threat. Just when she was about to walk out of the gates. Zhang Yang had a sudden idea. He then quickly grabbed Sherryl’s arm and place his sword on her neck. The sudden gesture had suddenly shocked Sherryl, and even Desionia herself.</p><br/><p>\"Trust me.\" Zhang Yang whispered to Sherryl. He then turned to Desionia and said, \"Leave now, or I will kill this woman!\"</p><br/><p>After Desionia obvious reaction, she laughed out loud and hold on her stomach as if she had just seen the most hilarious comedy ever. After a long laugh, Desionia finally calmed down and said, \"You intend to threaten us with just a mere human? Are you daft? Kill her if you want. I shall find another human to replace her!\"</p><br/><p>\"Any human you say, that means she means nothing to you then? Perhaps I should just rape her and feed her to my bear then.\" Zhang Yang gripped his sword tightly and made a small cut on her neck. As the blood started to ooze out from the wound, panic filled Desionia’s face.</p><br/><p>\"Wait!\" she cried out.</p><br/><p>Zhang Yang knew it clearly that something was not right. If Sherryl was just \"any human\" as Desionia had just described, the vampires would not have chased after her so furiously. As an NPC that would trigger such a drastic event, how could not she be an important character!</p><br/><p>\"Shall you take your leave now?\" said Zhang Yang provokingly.</p><br/><p>With great contempt, Desionia glared at Zhang Yang. After what seemed to be a long stare down between the two of them, Desionia screamed to the high heavens and bellowed angrily. \"Return to the castle!\"</p><br/><p>One of the vampires come to her and kneeled down. \"Mistress Desionia, Lord Madros had commanded us to bring Sherryl back to the castle. If we return empty-handed. I fear that the lord would be extremely displeased.\"</p><br/><p>Desionia scoffed and said, \"Leave. I will explain this matter to the lord myself!\"</p><br/><p>\"Yes! We listen and obey!\"</p><br/><p>Every vampire present replied in unison. They spread out their wings and shot to the sky, disappearing towards the north.</p><br/><p>Desionia was the last one present. Zhang Yang noticed and he had not removed the sword from Sherryl’s neck because of it.</p><br/><p>\"Enjoy your temporary peace. I will return.\" Desionia spoke with such vile that Zhang Yang knew she meant her words. She spread her wings and flew towards the same direction as the other vampires.</p><br/><p>Zhang Yang then removed the sword and cheered. \"Looks like we won!\"</p><br/><p>\"Yes, indeed. However, you nearly killed me there, warrior!\"</p><br/><p>‘Ding! You have completed the quest: Chase the Vampire. Obtained 3,000,000 Experience Points!’</p><br/><p>Just when Zhang Yang was expecting a follow-up quest, the system notification ended there with no other notification popping out.</p><br/><p>\"Sherryl! My dad died because of you!\" cried someone. The captured townsmen from before had gathered at Sherryl’s doorsteps with expressions that spoke of murder and vengeance.</p><br/><p>Zhang Yang pulled Sherryl and stood in front of her. \"Sherryl was willing to sacrifice herself just to protect you guys! What gives you the right to slander her!’</p><br/><p>\"It’s her. It’s all because of her! Those creatures wouldn’t have attacked us if it wasn’t for her! Why would the vampires spare our lives in place of hers? I’d say, she’s one of them!\" cried one of the townsmen.</p><br/><p>\"Yeah!\"</p><br/><p>\"Burn the girl!\"</p><br/><p>Voices of angry townsmen filled the place, and Sherryl remained quiet. Zhang Yang turned back and saw Sherryl was in shock. Zhang Yang understood her feelings. She was about to give her life in order to save the very same people who were throwing insults and death threats to her. It was a massive physiological attack which Zhang Yang could never measure. The trust and love towards the town was shattered instantly.</p><br/><p>Zhang Yang sighed and summoned his bear. \"Let’s go!\" Zhang Yang pulled Sherryl up and sat behind her on the bear. With a loud roar, the bear then galloped away from the angry townsmen. There was no reason to argue further.</p><br/><p>After a short moment, the townsmen began to chase after Zhang Yang with fire and pitchforks.</p><br/>\n</div>"}