{"title": "Chapter 405: Zombie Dental Extraction", "id": 405, "volume": 5, "url": "http://boxnovel.org/mmorpg-rebirth-of-the-legendary-guardian-chapter-405-zombie-dental-extraction", "volume_title": "Volume 5", "body": "<h1>Chapter 405: Zombie Dental Extraction</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 405: Zombie Dental Extraction</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>[Brainless Zombie] (Elite, Undead)</p><br/><p>Level: 86</p><br/><p>HP: 86,000</p><br/><p>Defense: 450</p><br/><p>Although these Brainless Zombies were named ‘Brainless’, their brains were still very much intact. Only their flesh and bones were rotten to the core, with visible maggots creeping all around their flesh. It was disgusting as hell!</p><br/><p>Han Ying Xue and Wei Yan Er had twitches on their faces, looking as if they had been hit in the balls the moment they saw the zombies.</p><br/><p>\"Why do I have a feeling that we’re watching some zombie flicks?\" Wei Yan Er complained.</p><br/><p>Zhang Yang took up his shield and sword, and then he flung a {Spear of Obliteration} at one of the Brainless Zombies, as per his regular routine, to throw a {Spear of Obliteration} to attract monsters from afar to get everything under control so that monsters wouldn’t swarm up on him.</p><br/><p>\"Owh!\" The Brainless Zombie let out an outburst of angry moans and began to lumber towards the direction of Zhang Yang. While it was at it, pieces of rotten fleshes were falling from its body. Right behind that zombie, two other Brainless Zombies were attracted, as their aggro was affected as well. The two zombies joined the first zombie and charged towards the three of them.</p><br/><p>The Brainless Zombies may have looked slow when they were wandering around, but once there’s a target to pursue, an enemy presence within their aggro sighting, they would become vicious, and their movement speed would suddenly increase! They could move faster than a champion in a 100-meter run! Well, it made sense. If their movement speed wasn’t fast, then they would definitely be kited around and tortured to death easily by spellcasters, hunters and other ranged professions. Then, it will become unfair to the melee professions in such regard.</p><br/><p>Zhang Yang engaged the zombies with the first swing of his [Sword of Purging Devourer]. There and then, Zhang Yang had their aggros all set on him. Well, it’s time to kite them!</p><br/><p>\"Stinky monsters, really! Why were you born so ugly! I don’t mind ugly, but they scare people by rushing like creeps! And their numbers! Argh! Their numbers are really big!\" Wei Yan Er used a {Charge} and rammed into the zombies, while she lost it and started complaining.</p><br/><p>Zhang Yang laughed as he kited the monsters closely, swinging his [Sword of Purging Devourer]. Unfortunately, the number of the monsters were too little, so the special effect of the sword did not trigger, leading him to use his own skills to inflict heavy damage onto the monsters.</p><br/><p>\"Noob tank, will you pick my cousin over sister Sun?\" Wei Yan Er suddenly turned her head around and asked Zhang Yang in a low voice while she was slicing up the monsters.</p><br/><p>Zhang Yang frowned at the question and said, \"Little girl, just focus on your studies and stop poking around in adult business!\"</p><br/><p>\"Pui! You’re just 5 years older than me, and you’re already nagging like an old man!\" Wei Yan Er let out a heavy sigh from her nose.</p><br/><p>\"Hey, what are you two babbling about!\" Han Ying Xue grew curious, as she was a distance away from them, and could not hear what they were saying.</p><br/><p>\"Cousin is such a jealous girl! You don’t even let your cousin talk to her future sister’s husband-in-law! Sigh!\" Wei Yan Er was shrugging on purpose, acting like she was helpless.</p><br/><p>As Zhang Yang was fighting the monsters, he could not help but wonder, deep into his thoughts, like peeling his own layers of onions in.</p><br/><p>Ever since Han Ying Xue revealed her love to him, he had not given her his true answer yet. He would only get through by joking or changing subjects. Because he wasn’t sure yet, if he’s just into her sexy hot body, or if he is really falling for this witchy snow. Not to mention that he still had Sun Xin Yu and Yu Li, clearly, he still had some attachment to them. No matter how hard he tried, he could not just forget about those two beautiful women.</p><br/><p>It was fortunate enough that up until now, Han Ying Xue had not been forcing him to give her a clear answer yet. She was only teasing him out of habit. Recently, the weather was changing and the temperature began to rise back according to the season. This witchy snow had begun to show her super sexy hot body, only wearing a thin layer shirt in front of Zhang Yang. She was not worried at all, that Zhang Yang might just lose it and push her onto a surface, and finish her!</p><br/><p>Zhang Yang had confronted her about it before in frustration, but this woman was really something! She actually said that things would eventually happen when one man stays with two pretty ladies, and so to prevent Zhang Yang from doing some ‘animalistic’ stuff on the little girl, she better sacrifice herself by luring him with her sexy body, to save that little girl from being ‘eaten’ by him! By then, she can also help Zhang Yang ‘unleash’ his evil thoughts.</p><br/><p>For that, Zhang Yang would be left speechless and frowning.</p><br/><p>Witchy Snow was being so ambiguous. So, does she like it or does she not?</p><br/><p>Zhang Yang had this thought to himself as doing his job with slaying the monsters while maintaining his rhythm in battle. By only swinging his sword around and activating some of his skills, he slew the zombies one after another.</p><br/><p>\"Strange, these monsters are already rotten to the core, but they can drop items such as clothing? It’s actually better for them to wrap themselves with the clothing, you know? So that they won’t terrify other people to death!\" Wei Yan Er spoke as she was picking up the loot dropped from the zombies.</p><br/><p>\"Why are you so talkative today, little girl? Haha! Well, this is just a game, if they made it too realistic, and you don’t get a thing after you kill the monsters, and you would still be complaining as well, wouldn’t you?\" Zhang Yang teased her.</p><br/><p>Wei Yan Er wrinkled her small little nose, \"Sigh, I was just saying it for fun, why would you take it so seriously? What a stiff *ss!\"</p><br/><p>Speaking to this little girl required a certain level of a psychological constitution, or else, one might burst a vein in the brain by just speaking to her!</p><br/><p>Zhang Yang laughed and ignored her for the moment, and then he turned his attention to luring the next wave of the zombies with his {Spear of Obliteration}.</p><br/><p>The drop rate of [Tooth of a Zombie] was extremely low as well, maybe even lower than the drop rate of those [Skeleton Bones]! The three of them had already cleared through half of the area and they had only managed to collect approximately 30 of the quest items. It looks like they will need to clear the entire area to collect all 50 [Tooth of a Zombie]!</p><br/><p>Boom!</p><br/><p>Suddenly, the ground got broke through from beneath, and a gigantic rotten hand emerged from the ground, and slowly, the hand clenched into a gigantic fist. Another gigantic hand followed, emerging from the beneath the ground just like the first one, then the third, and the forth... until there were a total of 8 gigantic hands emerging from beneath the ground! Then, one ugly *ss motherf*cking monster emerged from the ground and stood right before Zhang Yang and the two ladies.</p><br/><p>It was a super-sized zombie monster that was at least 10 meters tall. Well, this was something new! The wounds all around the giant monster were leaking out some sort of putrid pus, it was really disgusting! It had two wide and thick legs, thicker and larger than a leg of an elephant!</p><br/><p>If the lower body was deemed to be just like an ordinary individual human, only a little \"bigger\", then the upper body was completely out of the conventions of a normal human! Eight arms! Anyone would get the idea!</p><br/><p>Other than the two arms that were attached to its shoulders like a normal human, there was a second pair of arms attached to the ribs, and a third pair of arms attached to the abdomen, and last but not least, the fourth and final pair of arms attached right on the back of the gigantic zombie, like a pair of wings!</p><br/><p>[Black-Rock Zombie Lord] (Yellow-Gold, Undead)</p><br/><p>Level: 87</p><br/><p>HP: 1,740,000</p><br/><p>Defense: 1,500</p><br/><p>The face of the boss was almost completely rotten already, only one-half of its face were the remnants of something that remotely resembled a human. There were also maggots wiggling around the holes on the face, the eye sockets, and the nostrils! It was too disgusting to even look at! Wei Yan Er and Han Ying Xue did not even dare to look straight at it!</p><br/><p>\"No matter how ugly the boss is, it still is a Yellow-Gold boss! So the items and equipment the boss would drop can be sold for gold!\" Zhang Yang smiled.</p><br/><p>The moment the zombie lord was ‘activated’, it looked around with its empty, hollow eye sockets to scan for targets. As soon as it detected the three of them, it locked it’s target onto the three of them immediately, and began to charge towards them with large steps!</p><br/><p>Zhang Yang shot out a {Spear of Obliteration} to get the boss’s attention and drew it’s aggro over to him.</p><br/><p>\"Rawgh!\" the boss gave an outburst of raging roars, and it reached Zhang Yang with only two to three steps. The boss slammed Zhang Yang with its gigantic palm.</p><br/><p>Zhang Yang raised up his shield and activated {Block}.</p><br/><p>Boom!</p><br/><p>The gigantic hand of the boss was reflected back, while Zhang Yang did not even move an inch from where he stood! He was currently equipped with almost a full set of Violet-Platinum [Armor Set], so his strength was already as powerful as a Yellow-Gold boss!</p><br/><p>\"Hehe!\" Wei Yan Er recovered from the horror of that hideous visage and raised her axe. With her giant axe, she began to slash and hack, \"This boss is even more ‘capable’ than Prince Nezha1! Even Shotalo only has six arms, while this boss has eight arms!\"</p><br/><p>Zhang Yang laughed out loud and said, \"Then why didn’t you mention that Nezha also has three brains!\"</p><br/><p>\"It’s pointless to have so many brains. One on the left and one on the right, and one in the middle, it would only mean war for the three brains!\" Wei Yan Er curled up her lips.</p><br/><p>Well, this girl’s thoughts were really intriguing, so ‘different’ from regular people.</p><br/><p>Zhang Yang purposely teased her, \"Then, the centipede must be the greatest being in the entire world! You can’t count how many hands it has, right?\"</p><br/><p>\"Haha! Stop making a fool of me!\" Wei Yan Er rolled her eyeballs at Zhang Yang and said, \"Those are legs, not hands! You’re dumb!\"</p><br/><p>Zhang Yang, \"...\"</p><br/><p>\"Rawgh! Rawgh! Rawgh!\" The boss began to roar continuously. Although it had eight arms, all eight arms could not attack at the same time. There was a cool down period for each attack. After one slam, the boss had to wait for 2 full seconds before it could slam again. So basically, this boss is basically just like the Cyclop boss that they encountered before.</p><br/><p>Shoof! A stream of red light suddenly surged throughout the body of the zombie lord.</p><br/><p>\"Argh! Why can’t I move!\" Wei Yan Er suddenly panicked and cried.</p><br/><p>As Zhang Yang was smashing his sword onto the boss, he felt numbness across his entire body, and he too became frozen in motion! They were paralyzed!</p><br/><p>[Paralytic Poison]: Paralyze for 5 seconds. Players will not be able to move at all during this period of time.</p><br/><p>Zhang Yang quickly activated his {Warrior’s Will} and deactivated the {Paralytic Poison}. Then, he looked at the boss and realized that there was an additional beneficial effect on the boss: 30% chance of causing paralysis to the attacker when being hit, lasts for 2 minutes.</p><br/><p>God damn it!</p><br/><p>Although this did not pose much of a threat to Zhang Yang and the two ladies, it would greatly reduce the efficiency of their damage output, slowing down the process of the entire battle. They could have taken the boss down in one or two minutes, but now, it would require about three to four minutes to do so!</p><br/><p>As Zhang Yang and Wei Yan Er were mounted on their [Mount], so the moment they were ‘poisoned’, they could feel that their asses were numb even when they were trying to unmount! They were just like wooden sculptures, frozen the moment they were ‘poisoned’, and they remained in the same pose for the next 5 seconds.</p><br/><p>Wei Yan Er had a low threshold when it comes to humor. The slightest feather would set her off. So, when she saw Zhang Yang trying to slash the boss, but got ‘poisoned’ because Whitey went on to bite the boss and triggered the effect, their movements stopped and Zhang Yang was stuck with a silly pose in mid-slash, with a facial expression that looked like he had been hit in the balls, the little girl laughed very hard.</p><br/><p>Right after he was freed from the poison effect, Zhang Yang quickly dismounted from Whitey. He knew, because when he was mounted on Whitey, he was at the disadvantage, as the two of them hitting the boss would mean more attacks, which was likely to increase the chance of triggering the boss’s skill. The rate of this passive skill triggering was just too high!</p><br/><p>Wei Yan Er followed Zhang Yang’s lead and dismounted from her Chocobo pet as well.</p><br/><p>Because she was wielding a two-handed giant axe, she struck more sporadically than Zhang Yang, but her damage was sky high, so the rate of her triggering the poison skill would be much lower, compared to Zhang Yang.</p><br/><p>Of course, one Yellow-Gold boss was like a free gift to Zhang Yang and the two ladies. They were now strong enough to take on higher grade bosses already! Although the Black-Rock Zombie Lord was giving them a hard time, it was more of an annoyance than anything else. About 3 minutes later, the zombie lord let out a loud roar and collapsed onto the ground, causing a tremor across the surroundings. Then, everything became quiet.</p><br/><p>\"Oh! Time to split the loots!\" Wei Yan Er cheered and ran up to the loots.</p><br/><p>The Black-Rock Zombie Lord dropped 3 Yellow-Gold equipment, and 7 other Gray-Silver equipment. And also, this was a boss after all, so it actually dropped a total of 3 [Tooth of a Zombie], giving a joyous surprise to Zhang Yang and the two ladies. It would have required them to slay at least twenty to thirty elite zombies just to acquire this number of [Tooth of a Zombie]!</p><br/><p>After slaying the boss, they continued on to slay more zombie monsters. And about 3 hours later, they had cleared out most of the area, and finally, they had collected all 50 [Tooth of a Zombie]!</p><br/><p>The three of them quickly rushed back to the old man by the cottage to turn in the quest for the rewards.</p><br/><p>After going through some mountains and forests, they were finally back at the cottage. The old man, Kyle Dylan was there as always, waiting for their return with his eyes full of hope.</p><br/><p>TL Notes:</p><br/><p>1. Nezha - A deity in Journey to the west, a general that fought the Monkey King, Sun Wukong, when the latter rebelled against the Jade Emperor.</p><br/><p>2. Shotalo - Believed to be one of the random anime character that Wei Yan Er watched and quoted.</p><br/>\n</div>"}