{"title": "Chapter 403: Reborn Anew", "id": 403, "volume": 5, "url": "http://boxnovel.org/mmorpg-rebirth-of-the-legendary-guardian-chapter-403-reborn-anew", "volume_title": "Volume 5", "body": "<h1>Chapter 403: Reborn Anew</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 403: Reborn Anew</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Sherryl had jumped and shielded Zhang Yang for a second time. Having to pull back at the last minute again, Madros had finally given up trying to maintain his composure. Madros had been screaming in an incomprehensible language ever since Sherryl and stepped into the field and had blocked Madros’ attack for the second time.</p><br/><p>Because of Sherryl, Zhang Yang was able to endure longer and had successfully hack away freely. It was only a matter of time before the boss was truly defeated.</p><br/><p>\"Traitor! Since you wish to die that badly, I shall grant your wish then!\" Madros bellowed. He thrust his saber towards Zhang Yang and did not show any signs of stopping even when Sherryl was protecting Zhang Yang. The blade pierced through the air, giving out a whistle like sound as it plunged into Sherryl’s abdomen. Madros had finally resort to this mean for if he had not, not only he would be losing Sherryl’s ability to walk under the sun, he would be defeated by Zhang Yang!</p><br/><p>‘-33,300!’</p><br/><p>Sherryl took a massive damage and had lost more than half of her original HP.</p><br/><p>\"That’s enough!\" Zhang Yang screamed and pushed Sherryl away. \"I can’t ask you do shield me anymore. You have done your part, it’s time for me to do mine.\"</p><br/><p>With 6% left, the boss had still over 549,000 HP.</p><br/><p>\"Snowy! Take a bottle of Power Potion. Time for us the use {Dance of Heaven and Earth}.\" Zhang Yang screamed.</p><br/><p>\"Got it!\"</p><br/><p>Both of them immediately consumed a bottle of [Grade 10 Transmutation Beginner Power Potion] and gained 40% increase in attack power.</p><br/><p>\"Here goes nothing!\"</p><br/><p>{Dance of Heaven and Earth}!</p><br/><p>{Dance of Heaven and Earth}!</p><br/><p>{Chaotic Dance of Electric Current}!</p><br/><p>Two skills and one [Ring of Beastman's Ancestor] was unleashed. A great display of power was unleashed and depleted the boss HP down like an open hydrant. After merely 10 seconds, the boss was left with over 30,000 HP. His face and appearance had drastically changed to become extremely battered. His bat wings were broken had half and could no longer flap. All it could do was hanged limply behind the back of the boss.</p><br/><p>Madros falls down at such speed and crashed into the ground. Madros got up to his feet, holding himself up with just a little bit of strength left. Before he knew it, Zhang Yang witness the boss turned tails and ran away!\"</p><br/><p>\"You can’t escape!\" Sherryl jumped to her feet and threw the dagger towards the boss.</p><br/><p>‘-10,000!’</p><br/><p>Although the strike had done the same damage from before, it was proven to be lethal only now. With only 20,000 HP or less, Madros ran faster. Pride and honor had nothing to do for him then.</p><br/><p>He was running away like a beaten dog!</p><br/><p>Without wasting any second, Zhang Yang gave chase and threw a {Spear of Obliteration}, dealing around 4,000 damage to the boss. The boss responded with a loud growl of pain but kept his distance away from Zhang Yang. No matter how, the distance between them will always maintain at 20 meters.</p><br/><p>\"Curses!\" Madros growled again. Knowing that he was being beaten down like a wild dog, and was chased by none other than his lowly attacker, Madros’ pride of being the king of vampire was at stakes. Luckily, being a vampire grants him a superhuman regeneration ability. With limited time, his wound would have already closed and the wings behind his back had already reattached properly.</p><br/><p>\"Warrior! You must not let him escape!\" Sherrly was chasing with all her might cried loudly behind Zhang Yang.</p><br/><p>\"Trust me!\"</p><br/><p>‘-3,982!’</p><br/><p>Zhang Yang tossed another {Spear of Obliteration}, dealing another clean attack on the wounds that had just closed up. The wings on his back were clearly ready to fly when Zhang Yang’s attack had crippled him again.</p><br/><p>\"ARGH! If I die, I’d be dragging you down with me!\" Madros turned around when he knows that escape was not an option for him any longer. He unsheathed his sword and begun to charge at Zhang Yang on foot.</p><br/><p>\"Hmph! I’m too early for hell!\" Zhang Yang scoffed and activated {Killing Cleave}.</p><br/><p>Wham! -16,724! A critical strike!</p><br/><p>\"Ack! ARGH! Ahhh!\" Madros falls to the floor with his chest up. A scorched mark appeared on his chest, which slowly expands and turned into burning amber. The glowing amber spread all over his character and killed the vampire, turning him into a pile of ash with a few bones remaining.</p><br/><p>Sherryl sighed in relief and pants. \"The wretched vampire king finally dies!\"</p><br/><p>Zhang Yang nodded. \"Looks like eternal peace is finally at hand!\"</p><br/><p>‘Ding! You have completed the quest: Rescue Sherryl. Obtained 5,000,000 Experience Points. Time Taken: 2 hours 11 minutes. Quest Score: Perfect!’</p><br/><p>Sherryl walked over to the boss’ ash remains and picked up a small, black shard. It was a sharp object which was probably one of the bones that had not disintegrated. She removed part of her wedding dress and revealed her entire left shoulders. She took a deep breath and stabbed the shard into her heart.</p><br/><p>\"Owph!\" She groaned as the fresh river of blood started to flow out of her chest.</p><br/><p>\"What are you doing!?\" Zhang Yang screamed.</p><br/><p>With a pale face, Sherryl called for Zhang Yang to come closer. \"I have the blood of the vampire in my veins. This piece of bone that belonged to the vampire king should remove them from me. I can finally be human! A pure human!\"</p><br/><p>The blood flows out of her chest which part of them had dyed her white wedding dress with the red color of blood. The black shard had absorbed the blood and started to glow in a red hue. There was a silver thread that had swirled magically in the bones.</p><br/><p>After some time, Sherryl had pulled the shard out of her chest and gave it to Zhang Yang. \"Warrior, I shall entrust you with this Vampire’s King Bone Shard.\"</p><br/><p>‘Ding! You have obtained the first piece of Inheritance Fragment!’</p><br/><p>At the moment Zhang Yang had picked the bone out of Sherryl’s bloodied hands, he received the system notification instantly.</p><br/><p>\"Warrior. I must return to town now and inform every one of the good news! I trust that after you had finished with your business here, you’ll come to town and pay me a visit! I’m sure that everyone in town would like to thank you for everything that you had done!\" Sherryl helped herself up to her feet. She bowed weakly and walked away.</p><br/><p>[Vampire Inheritance Fragment (1)] (Inheritance Tier: B)</p><br/><p>Description: Gather all six pieces of Vampire Inheritance Fragment and complete the Vampire Inheritance Keepsake. Activate the Keepsake to initiate the final Inheritance quest. Complete the quest to obtain the Vampire Inheritance. Apart from the class skill, you will also obtain the special Vampire original skills. Be advised, all Vampire Inheritance Fragment will resonate with each other. If you were killed by other players that possess the Vampire Inheritance Fragment, the Fragment in your inventory will drop. All Fragments can only be carried in a player’s inventory and cannot be stored.</p><br/><p>Finally!</p><br/><p>Han Ying Xue took her time to pick up all the money on the ground before heading over to Zhang Yang to see the fragment. After reading it, Han Ying Xue asked, \"So, what are you going to do with it?\"</p><br/><p>\"Hm…I think I’m going to give it to Yan Er. The Vampire Inheritance is a good way to heal oneself. It’s really useful for the little brat which could solve her survivability.\"</p><br/><p>\"But it’s just a B tier!\"</p><br/><p>\"So? B is good enough!\" said Zhang Yang with a stern expression. \"The best S tier Inheritance for every class is limited to only one. That’s 6 classes. Which means there are only 6 players in the entire region of China could have the S tier players. Beneath that would be the A tier Inheritance. Now, A tier Inheritance is not a Unique type, it is a General type which means everyone could get their hands on it. However, keep in mind that an A tier Inheritance is extremely tough. Just like the S tier Inheritance, A tier is so difficult to farm that it is considered to be a super-ultra hidden quest! It’s close to impossible to even trigger the starting point!\"</p><br/><p>Zhang Yang was speaking the truth, the total players that had S tier and A tier Inheritance were only 17 players! The scarce number of players that had inherited the S and A tier Inheritance had proven that it was extremely difficult to complete. Luckily for Zhang Yang, the person who had obtained the Inheritance \"God of War\" was too show-body about it, that he had posted the steps to the last details in the forums. As for the rest of the 16 players, there were completely silent about it.</p><br/><p>That being said, if someone had already triggered the quest to obtain the Inheritance Fragment, no one could repeat the same quest again. That means that no one could trigger the Sherryl route anymore!</p><br/><p>\"You know what? I’m too lazy to argue with you. That’s stuff for when we reached Level 100.\" Said Han Ying Xue lazily as she returned the Fragment back to Zhang Yang. In turn, however, she quickly paced towards the pile of battle loots and started to pick them up.</p><br/><p>\"Haha!\" She laughed abruptly. She turned to Zhang Yang and showed him a pair of Violet-Platinum boots. \"Dummy, I guess you owe me another red packet! Guess what have I found?\"</p><br/><p>\"Is it the Titan Boots?\" Zhang Yang was excited.</p><br/><p>\"That’s right! Am I lucky or what?’</p><br/><p>\"Lucky! The queen of luck!\"</p><br/><p>Han Ying Xue grinned happily and pass the boots to Zhang Yang.</p><br/><p>[Titan Battle Boots] (Violet-Platinum, Heavy Armor)</p><br/><p>Defense: +80</p><br/><p>Vitality: +282</p><br/><p>Strength: +81</p><br/><p>Dexterity: +40</p><br/><p>Equip Effect: Absorb 162 damage on attack.</p><br/><p>Class Requirement: Guardian</p><br/><p>Level Requirement: 80</p><br/><p>With the boots in hand, Zhang Yang would need one last piece of Titan’s equipment to unlock the full set equipment set effect!</p><br/><p>Han Ying Xue continued to reveal more battle loots. She started to sulk disgruntledly when there was no more equipment left. Madros had only dropped three Violet-Platinum equipment. Besides the boots, there were two other Cloth Armor class equipment which was a glove and a magic staff.</p><br/><p>Han Ying Xue had already a Violet-Platinum magic staff in hand and she took the glove with a grin. The magic staff will be given to either Daffodil Daydream or Fantasy Sweetheart.</p><br/><p>After a while, she pulled out another item. It was a skill book called {Reborn Anew}.</p><br/><p>[Skill Book: Reborn Anew]</p><br/><p>Use: Teaches the skill {Reborn Anew}</p><br/><p>Class Requirement: Priest, Sacred Knight</p><br/><p>Level Requirement: 80</p><br/><p>\"Hey, dummy? What is this skill called {Reborn Anew}? Is it the same as {Redemption}?\" Han Ying Xue asked. {Redemption} was the skill that Han Ying Xue used to revive players after the boss fight. The new skill {Reborn Anew} sounds about the same as {Redemption}. She had guessed it since the skill class requirement was a Priest or a Sacred Knight.</p><br/><p>Zhang Yang was stunned. With wide opened eyes, he cried out, \"You say {Reborn Anew}?\"</p><br/><p>\"Yeah. What about it?\" She asked.</p><br/><p>\"Well, we had just hit the jackpot again!\" Zhang Yang smiled from ear to ear. \"Well? What are you waiting for? Learn it!\"</p><br/><p>Han Ying Xue pouted and learned the skill. However, her cocky expression immediately faded away when she read the skill description.</p><br/><p>[Reborn Anew] (Level 1): Cast the skill on a player. For 1 hour, the player will be revived on the same spot with full HP on death. Players that revive with this skill shall not receive any experience death penalty.</p><br/><p>Cool Down Time: 1 Hour.</p><br/><p>\"D-D-Dummy…This is…too OP!\" cried Han Ying Xue with hoy. She was so happy that she leaped towards Zhang Yang and planted her lips on his.</p><br/><p>\"Bleh!\" Zhang Yang pushed her away. \"You sow! Watch it! You got your saliva all over my face!\"</p><br/>\n</div>"}