{"title": "Chapter 423: The Three Saints", "id": 423, "volume": 5, "url": "http://boxnovel.org/mmorpg-rebirth-of-the-legendary-guardian-chapter-423-the-three-saints", "volume_title": "Volume 5", "body": "<h1>Chapter 423: The Three Saints</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 423: The Three Saints</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>\"I’d say, the price for the ring could go as high as 100,000 gold coins! I’m sure there will be people fighting for it!\" said Fatty Han as he examined the [Ring of Grandiose].</p><br/><p>Fatty Han’s logic was right on one aspect. Rings and accessories were rare drops. Players would definitely put on a high price for it, even though it was not a Violet-Platinum tier.</p><br/><p>\"Fatty bro, I think you’re missing one digit.\" Said Daffodil Daydream.</p><br/><p>\"Huh? What? You’re saying the ring is actually worth more?\" Fatty Han asked curiously.</p><br/><p>Zhang Yang nodded. \"Don’t be surprised, but a ring like that would fetch prices as high as a million. However, I urge that we do not sell the ring just yet. Since neither if you have a Violet-Platinum ring, might as well use this for the moment. Until the day we can get a better one, we shall keep this.\"</p><br/><p>\"But…Little Yang, by the time we farm for new rings, this one would not be worth selling anymore,\" said Fatty Han with a bitter sad face.</p><br/><p>Zhang Yang cocked his head and frowned. \"Don’t tell me that you already used up all your money!\"</p><br/><p>Fatty Han smiled. \"No. But what’s wrong in earning more? There’s no limit to how much you can make, right?\"</p><br/><p>Wei Yan Er had picked up two more Yellow-Gold equipment, but neither of them was good. One silk armor had too much Spirit, and the other heavy armor added magic defense. Both of these two equipment were considered dissonant stats, and everyone agreed to put them up for sale in the Little Merchandise Shop.</p><br/><p>\"Let’s go. There’s no time to waste. We have eight more bosses to kill!\"</p><br/><p>The party proceeded on and had repeated the entire rescuing process, and came to the sixth blood pool. After they had made their way to the boss room, everyone was stunned, and filled with dread and horror. The boss room was empty.</p><br/><p>\"Oh god…\"</p><br/><p>\"Don’t tell me…\"</p><br/><p>\"F*ck my life…\"</p><br/><p>\"Sigh…\"</p><br/><p>Fatty Han cried angrily and said, \"Little Yang! Don’t tell me that the future boss fights will be in groups?!\"</p><br/><p>\"What do you think?! Of course, it will be! Duh!\"</p><br/><p>The party proceeded on to the next pool, and the next one after that and had still not encountered any bosses, even after the eighth boss.</p><br/><p>\"…Crap…Are we going to fight 5 bosses at one go?\"</p><br/><p>Everyone stared at Fatty Han with a sudden burst of anger but simmered down quickly. They knew that it was not Fatty Han’s fault. Truthfully speaking, they were thinking the same but had remained quiet about it.</p><br/><p>After the ninth pool, Zhang Yang and the party came into the boss room. Everyone let out a sigh of relief when they saw the bosses. There were only three in total.</p><br/><p>[Rayleigh, Shield of the Three Saints] (Yellow-Gold, Humanoid)</p><br/><p>Level: 95</p><br/><p>HP: 3,000,000</p><br/><p>Defense: 3,000</p><br/><p>Note: One of the 12 Disciples.</p><br/><p>[Dolor, Spear of the Three Saints]</p><br/><p>Level: 95</p><br/><p>HP: 3,000,000</p><br/><p>Defense: 1,500</p><br/><p>Note: One of the 12 Disciples.</p><br/><p>[Cherry, Wings of the Three Saints] (Yellow-Gold, Humanoid)</p><br/><p>Level 95</p><br/><p>HP: 3,000,000</p><br/><p>Defense: 1,000</p><br/><p>Note: One of the 12 Disciples.</p><br/><p>As the title suggested, Rayleigh was a Guardian-class boss. He wielded an axe in his right hand and a shield in his left. His shining armor, encasing his entire character was all grand and scratch-free. Zhang Yang had one principle. That is, a knight in shining armor was not something to be respected, for he had never truly had his metal tested in battle. The next boss was Dolor. The man had two gladiuses hanging behind his back. Zhang Yang had deduced the boss was a Thief class, since warriors carried their weapons at the waist instead of on the back. That and the occasional fading presence of the boss. The last boss was a woman named Cherry. Despite her cute name, the woman was a full-grown adult. She carried long magician staff in her right hand and was wearing a long white robe which covered her body entirely, besides her chest…</p><br/><p>The hole in the middle of the chest was large enough to reveal half of her breasts to the world. The lower half of her robe had a gap at each side of her waist. The dressing style had reminded Zhang Yang of a Qi Pao, the traditional clothing for women. However, unlike the Qi Pao, her robe was just too revealing. The gap was extended up to close to her lower breast which revealed quite a lot of flesh, emphasizing her voluptuous body and her long fair legs.</p><br/><p>Fatty Han snorted and smiled from ear to ear. \"Well. Guys, count me out in this. It’s my policy to never strike a woman. Especially when she is that hot! I mean, look at that---\"</p><br/><p>Zhang Yang smacked Fatty Han’s head to shut the man up.</p><br/><p>Zhang Yang examined the bosses and found out that the bosses were sharing the same HP gauge. It was as the same as the previous gang of four. However, the biggest difference was that, there were no annoying auras!</p><br/><p>\"I don’t believe that the later bosses would be easy. They must be hiding something. Let’s just hope it’s not some ridiculous super killing skill.\"</p><br/><p>Zhang Yang nodded. \"That’s true. Now listen to me. That boss is a tank class. Everyone could see the shield there. The one with the swords is a Thief class. The woman should be a magic user but I’m not sure if she is a healing type or an attacking type. But, based on my judgment, I’m guessing that she should be a healer. A tank, an attack, and a healer should be a perfect formation.\"</p><br/><p>He continued, \"Endless Starlight, I want you to kite Rayleigh. That boss is a tank class, so I’m hoping that its attack will be lower, to trade for its high defense. I will handle both Dolor and Cherry. Everyone else should focus all their fire solely on Cherry for she has least Defense among the boss.\"</p><br/><p>\"Understood.\" Everyone understood. Truthfully, there was no need for Zhang Yang to even explain, since that was the most common battle strategy. Hit the healer first, and then the attacker. Leave the tank for last, since he should pose no threat to the party.</p><br/><p>\"Alright, if everyone is ready, let’s begin.\"</p><br/><p>\"Foolish mortals! How dare you defile the temple!\"</p><br/><p>\"I hereby represent the Sacred One in laying judgment upon you!\"</p><br/><p>\"In the name of the Lord, the Light shall purify your malicious presence! Be gone! Maverick!\"</p><br/><p>The battle started with the bosses’ individual speeches and they rushed towards Zhang Yang and Endless Starlight. The entire battle scene had changed. Not in terms of system UI or battle strategy. It was just the atmosphere of it. Endless Starlight was silent and stoic. Wei Yan Er was not making any noise or doing any annoying gesture. She was calm. After the party had been through several battles, this one was of the times that they knew a trivial mistake would lead to a catastrophe end. Everyone had the same glint in their eyes. The same when soldiers go to war. Determination.</p><br/><p>In just a few steps, Cherry had stopped running and had pointed her staff at Zhang Yang from a good distance. From the progress bar appearing on her head, Zhang Yang had determined that Cherry was a Priest since the spell that she was casting was called {Punishment Ray}. That and her righteousness speech. Dolor, on the other hand, had vanished without a trace and entered stealth mode.</p><br/><p>Zhang Yang gripped his sword tighter and activated {Charge}. Instead of Zhang Yang, the rest of the party had a tenseness in their heart. At such a close range, Zhang Yang would not dodge the attack. Zhang Yang swung his sword hard and laid down the first attack. With a quick spin in the air, Zhang Yang slashed his sword downward and attacked with the first {Cripple Defense}.</p><br/><p>\"Weep for your sins! Surrender yourself to the power of the Lord!\" Cheery had just finished her spell and a bright light blasted off her staff. In the split second, everyone, including Zhang Yang was prepared for the worse. Han Ying Xue had already prepared to cast a healing spell on Zhang Yang if her power was too strong.</p><br/><p>‘-9,411!’</p><br/><p>As the damage text floated away from Zhang Yang’s character, everyone sighed with great relief, as the damage was not at all devastating. During that time, Dolor had appeared with a puff of smoke and had knocked Zhang Yang’s head with the sword’s hilt, successfully stunning him. Zhang Yang was not prepared for that since he was too focused on the Cherry’s {Punishment Ray}!</p><br/><p>Dolor danced around swiftly as how a Thief would do after they have managed to {Ambush} their enemy. Each of the sword slashes had dealt close to 10,000 damage. Dolor had gained a buff. 30% increase in attack power which lasts for 10 seconds. It was the same as a player Assassin. Every time they appeared from stealth, they would gain a similar buff.</p><br/><p>Without delay, Zhang Yang used {Warrior’s Will} to free himself from the stun. There was a good reason for him to do, so even though the stun duration was only 2 seconds. (Stunning duration was shortened by 50% due to the equipment effect of Heart of the Death Knight.) Zhang Yang had not attacked Dolor. If he had not freed himself to attack him, Dolor would immediately attack Han Ying Xue, since she would heal Zhang Yang and gain aggro from Dolor. Zhang Yang had to build aggro on him to prevent Han Ying Xue from being attacked.</p><br/><p>Zhang Yang slashed and activated {Horizontal Sweep}, and damaged both Cherry and Dolor for 8,412 and 8,134 respectively. With that, Zhang Yang could have an ease of mind to let Han Ying Xue heal him without any interruptions.</p><br/><p>Right then, Sun Xin Yu and the rest of the party had arrived and started their attack. Melee attackers went into position and laid down a flurry of attacks.</p><br/><p>\"Hmph! No matter how many of you there are, in the presence of the servant of the Lord, you are nothing but ants!\" Cherry scoffed arrogantly and struck her staff into the ground.</p><br/><p>Right at the moment when Sun Xin Yu’s blade was about to reached her back, a bubble grew from under the staff and pushed everyone away at an intense speed, damaging them for 20,000 Holy damage. Everyone was thrown 10 meters away from Cherry.</p><br/><p>\"Woah! A Priest isn’t supposed to do that! This isn’t fair at all!\" cried Fatty Han.</p><br/><p>Luckily, both Han Ying Xue and Fantasy Sweetheart were long-ranged supporters. Even though they had taken 20,000 damage, it was no trouble for the two healers to bring their HP back to full capacity.</p><br/><p>After being healed, Sun Xin Yu and other melee fighters rushed back to the fight. Luckily, Cherry’s barrier-like skill was not used frequently. All the melee fighters were able to attack her without being blown away again.</p><br/><p>Dolor had all the Thief skills a player would. After having his stun removed, Dolor stunned Zhang Yang once more with {Kidney Shot}, stunning Zhang Yang again for 6 seconds. However, having {Heart of the Death Knight}, Zhang Yang was only susceptible to 3 seconds of stun. 3 seconds later, Zhang Yang countered Dolor’s furious attacks to prevent him from losing too much HP and Dolor from gaining too many combo points.</p><br/><p>After 10 seconds, Dolor vanished into the shadows once more. Unlike players, the boss’ movement speed was too quick for Zhang Yang to react. Dolor had appeared almost instantly as soon as he had vanished and had bashed Zhang Yang, stunning him for 4 seconds. Even though Zhang Yang had half the stunning duration, being stunned while he was attacking was extremely annoying. Imagine an actor who was acting passionately and asked to stop suddenly just because the director said so.</p><br/><p>Still, as annoying as it may be, Zhang Yang was unable to do anything. Although {Warrior’s Will} had been leveled up to max, it still had 60 seconds of cool down time. It could not dispel the stun as frequently as to how the boss could stun! It was already a miracle that he could possess the passive skill that reduced half of all status effect skill!</p><br/><p>At the other side of the battle, Endless Starlight was facing with a little bit of trouble. Rayleigh had been repeatedly using {Brutal Smash} on Endless Starlight, stunning him for 4 seconds per skill use. The skill had a 2 minutes cooldown time, yet the boss was using it every 20 seconds! Endless Starlight had finally felt the immense annoyance after being stunned for 4 times. Once Endless Starlight was stunned, even for a 4 seconds period, Rayleigh would completely ignore him and proceed to target the next target in the aggro list. There was once when Endless Starlight was stunned, the boss had almost killed Fantasy Sweetheart. Luckily, Zhang Yang was quick enough to cast {Sacrifice} to divert the damage to him instead.</p><br/><p>After getting used to all of the bosses’ skills, Zhang Yang moved closer to Endless Starlight and allow him to take on all three of the boss simultaneously. The benefit for him in doing so was to allow Zhang Yang to hold on the aggro of Rayleigh. Once either one of the tanks gets stunned, Rayleigh will proceed to target the second target in the aggro rank. Zhang Yang was hoping that Rayleigh would target either him or Endless Starlight instead of the other low-HP players. He had already spent {Sacrifice}, and cannot save anyone within the 1 minute cooldown period.</p><br/><p>Secondly, the AoE skills {Horizontal Sweep} and {Tornado Cleave} could deal better damage when all of the bosses are gathered together in one place. Those two skills were, after all, the ultimate AoE skills among the group.</p><br/><p>\"Rayleigh, protect me!\"</p><br/><p>60 seconds into the battle, the bosses HP bar had dropped down to 73%, and Cherry suddenly cried for help.</p><br/><p>\"I listen and serve!\" Rayleigh responded and cast {Sacrifice} on Cherry, as he was still fighting Endless Starlight.</p><br/><p>Having a protective barrier, Cherry immediately stopped attacking and cast a skill called {Holy Starburst}, with only 5 seconds of casting time.</p><br/><p>\"The boss is protected by {Sacrifice}! We cannot disrupt her!\" cried Lost Dream. He had already used {Low Kick} on the boss but was only rewarded with the word \"Transferred\". The skill was diverted to Rayleigh instead.</p><br/><p>\"Embrace the power of the Lord!\" Cherry’s {Holy Starburst} was completed after everyone had tried to cast their disruption skills. A ball of bright light erupted out of her body and split into three smaller balls of light. All of them flew to each boss.</p><br/><p>‘+100,000!’</p><br/><p>‘+400,000!’</p><br/><p>‘+400,000!’</p><br/><p>Three high valued healing texts popped up on all three bosses, healing them for a total of 900,000 HP. On average, their shared HP bar was raised back to 83%.</p><br/><p>\"Crap!\"</p><br/><p>The healing skill had proved to be so strong, that everyone was spouting insults and curses. Luckily, Cherry had the effect of {Destructive Smash} on her, causing her to receive 75% reduced the healing effect. If Zhang Yang had not struck her with the skill, the bosses would have healed 1,200,000 HP.</p><br/><p>Even though the bosses did not possess any auras, they were strong. They also fought in an uncannily similar manner to that of a player’s party.</p><br/>\n</div>"}