{"title": "Chapter 426: A Tight Battle Spot", "id": 426, "volume": 5, "url": "http://boxnovel.org/mmorpg-rebirth-of-the-legendary-guardian-chapter-426-a-tight-battle-spot", "volume_title": "Volume 5", "body": "<h1>Chapter 426: A Tight Battle Spot</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 426: A Tight Battle Spot</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Logan stomped down onto the ground thunderously, looking simply heroic. As he presented himself out like a prince battling evil dragons in a fairy tale, it had made him looked more like the good guy and Zhang Yang and his gang looked more like a bunch of evil goons who were trying to cause havoc!</p><br/><p>\"Intruders, this is as far as you can go!\" Logan spoke with a powerful voice. He then swung the long sword in his hand with brute force towards Zhang Yang! It was like a flash of lightning, flashing through!</p><br/><p>But Zhang Yang was even quicker! His shield was raised up high right before the sword could even touch him.</p><br/><p>{Block}!</p><br/><p>‘-59!’</p><br/><p>\"Hell yea!\" Seeing the number of damage reflected back on the boss, the gang could not help themselves but cheered for Zhang Yang. The attack of the boss was extremely fast! And to be able to react so fast, and to activate {Block} at the very last moment, like one millisecond, or maybe one centisecond right before the attack hits, required extremely great reflexes and perfect timing for one to do that!</p><br/><p>Unfortunately, the defense of the boss was 2,600 points! Even though Zhang Yang had {Eagle Eye} that ignored 50% defense, but without 5 layers of {Cripple Defense}, the boss would still have a total of 1,300 defense points. That was why the reflective damage from his shield was only 59 points.</p><br/><p>{Cripple Defense}!</p><br/><p>‘-319!’</p><br/><p>{Shield Bash}!</p><br/><p>‘-4,396!’</p><br/><p>Zhang Yang smashed the first layer of {Cripple Defense} onto the boss before he gave a ‘free’ blow of {Shield Bash} on the boss. That instant bash attack gave a satisfying damage!</p><br/><p>With his initial move to secure the aggro of the boss all onto him, Sun Xin Yu and the rest of his gang immediately unleashed everything that they had, rounding up on Logan and attacking the boss madly with their weapons.</p><br/><p>Endless Starlight was left in tears, \"Why didn’t you guys come and attack the boss that I’m kiting?\"</p><br/><p>\"Hehe, you’re too noob! It won’t be safe for us!\" Wei Yan Er giggled.</p><br/><p>It actually wasn’t because Endless Starlight was a noob or that he was not good enough for them, the main reason was that his equipment grade was a little weak compared to the equipment of the attackers on the party, like Sun Xin Yu and Wei Yan Er. Tankers do not only rely on their skills to pull the aggro of their targets, they also need good equipment to support them in doing so. Without good enough equipment to boost their damage output to a satisfactory value, the attackers will be bringing more damage to the targets, and when that happens, the targets will switch their aggro onto the players that unleash higher damage values! In this situation, Endless Starlight will only lose the aggro of the boss over to any of the hard-hitting attackers!</p><br/><p>Zhang Yang tried to comfort him, \"The main reason being, Defenders do not have skills like {Cripple Defense}, so the physical damages that can be done to the boss will be reduced steeply!\"</p><br/><p>Endless Starlight immediately recovered to his complaining, self-righteous attitude, \"That’s right! The system is biased! All the good and useful skills have been given to the Warriors!\"</p><br/><p>Zhang Yang laughed out loud and said, \"You can’t say that either because Knights can also learn a skill similar to {Cripple Defense} later. However, the skill is aimed at the magic resistance of bosses, so Knights will have to work closely with Warriors!\"</p><br/><p>\"However, the bosses in {{God’s Miracle}} have high defense, and very few of them have high magic resistance!\" Hundred Shots added in a hurry.</p><br/><p>Endless Starlight was excited to know that he could still learn a new skill regarding defense reduction, but his excitement was soon ‘extinguished’ by Hundred Shots' words. Everyone was laughing at him.</p><br/><p>\"Bunch of weak and pathetic humans, I can crush you all with only one of my fingers!\" Logan let out an outburst of raging roars and began to swing his long sword even more violently. The sharpness of the blade cut open the air as swirls of air were formed into masses of air balls, emitting out some intense sonic booms!</p><br/><p>\"Come at me! Come ‘crush’ me with your fingers!\" Fatty Han tried to provoke the boss, as he took the time he had left after shooting the boss, turning around and shaking his big fat ass at the boss! He even slapped his booty a few times without any sense of rhythm!</p><br/><p>Logan was instantly enraged. Although there weren't any changes on the aggro list of the boss, the boss switched his target to Fatty Han all of a sudden and pointed one of his fingers towards Fatty Han. The fingertip of that finger of the boss seemed to have a bloody vague light glowing on it.</p><br/><p>Fatty Han laughed as he saw how the boss reacted, and then he showed the boss his middle finger, \"Who doesn’t know how to pose? Haha!\"</p><br/><p>\"You imbecile! You must die!\" Logan shouted, and a stream of light radiating in the color of blood was shot out from his fingertip, straight at Fatty Han at a very unusually high speed!</p><br/><p>Switch!</p><br/><p>The attack landed on Fatty Han, but a damage value of 14,694 points appeared right on top of Zhang Yang instead!</p><br/><p>Fatty Han was very shocked. If it wasn’t for Zhang Yang activating {Vanguard’s Aggression} on him in time, he would have to suffer the damage. Although he wouldn’t die just yet, he still carried 6 layers of {Touch of Frost}, that had placed him in a very dangerous situation! And Fantasy Sweetheart was focused on healing Zhang Yang as her priority target, she would only throw a {Regeneration} onto the other players around and activate {Mending Prayers} to heal a player nearest to her at random. So, it would not be possible for her to cast the tanker aside and focus on healing any other attackers!</p><br/><p>After Logan struck out that attack, he no longer put his attention on Fatty Han and turned his attention back on Zhang Yang.</p><br/><p>\"Brother fatty! Please don’t provoke the boss without any reason!\" Fantasy Sweetheart was not Han Ying Xue. Although she had been tagging along with Zhang Yang and his gang for a while and had obtained quite a number of good equipment, she was still no Han Ying Xue. The main reason being due to the number of skills she had been far lesser than the skills that Han Ying Xue had. So, whether it is her capability of emergency healing, or to sustain the endurance of the entire party, she would still not be as good as Han Ying Xue.</p><br/><p>The little lady was so busy that she did not even have time to scratch her head! She was currently required to heal Zhang Yang with everything she got, while having to heal the others with her {Regeneration} whenever she is able, to prevent the effect of {Touch of Frost} from further reducing the health points of her remaining party members - other than Zhang Yang.</p><br/><p>Zhang Yang laughed, \"That should be a random skill from the boss. It should be a coincidence that Fatty Han was struck. Maybe the boss was already trying to use the skill on us randomly, and Fatty Han went on to provoke him! Haha!\"</p><br/><p>\"Haha! Wretched fatty! Literally ‘an open mouth having the tendency to catch flies in the mouth!\" Wei Yan Er was making fun of Fatty Han.</p><br/><p>‘Ding! You have been affected by Touch of Frost (10 Layers), receive 4,500 frost damage every 3 seconds, lasts for 10 minutes. When Touch of Frost has been stacked up to 10 layers, it can be deactivated with Touch of Flame!’</p><br/><p>The battle went on for 60 seconds, and both effects of ‘Touch of Frost’ and ‘Touch of Flame’ had been stacked up to 10 layers! Each of them will be receiving 5,000 damage every 3 seconds, but for a healer to heal all 10 of them - it’s a heavy task!</p><br/><p>Zhang Yang pulled Logan over towards Endless Starlight, \"Starlight, time to undo the effects of the skills by stacking them together!\"</p><br/><p>\"Roger!\"</p><br/><p>The two tankers who were kiting a boss of their own began to move towards a point where the two of them would intercept. The other members of the party were naturally following them closely. In just a short moment, they met with each other at the intercept point, and so did the two bosses!</p><br/><p>Boom!</p><br/><p>A frosty white stream of light emanated right out of Ezali, while a scorching crimson stream of light emanated right out of Logan. Then the lights slid across the head of everyone around.</p><br/><p>‘Ding! You have been affected by Touch of Frost (1 Layer), receive 500 frost damage every 3 seconds, lasts for 10 minutes. When Touch of Frost has stacked up to 10 layers, it can be deactivated with Touch of Flame!’</p><br/><p>‘Ding! You have been affected by Touch of Flame (1 Layers), receive 500 frost damage every 3 seconds, lasts for 10 minutes. When Touch of Flame has stacked up to 10 layers, it can be deactivated with Touch of Frost!’</p><br/><p>Everything went according to plan, and Zhang Yang and his party members were able to loop the effects on them from ‘10 layers’ all the way back to ‘1 layer’ for the first time, and now they just had to wait for the effects to stack up to 10 layers before they do it again. As long as they can repeatedly loop the effect cycle by splitting up and regrouping at the right timing, it didn’t matter if the health bars of the bosses are very long. It was just a matter of time before the bosses have to give in and die!</p><br/><p>\"Phew! Finally, we have come across two bosses that are easier to fight!\" Fatty Han let out a breath of relief.</p><br/><p>However ---</p><br/><p>\"Logan, hurry up and get rid of these useless pests!\" Ezali was getting impatient.</p><br/><p>\"Yes love, I shall follow everything you planned for!\" Logan replied her immediately.</p><br/><p>The two bosses raised up their long swords in their hands and clashed the two swords into each other. Two streams of lights, the white one gushed into the body of Ezali while the red one gushed into the body of Logan.</p><br/><p>‘Ding! Ezali has acquired Defiant (1 Layer), physical attack increased by 10%!’</p><br/><p>‘Ding! Logan has acquired Defiant (1 Layer), physical attack increased by 10%!’</p><br/><p>The two bosses instantly acquired an additional beneficial effect on them as they were raising up their swords up in the air, and let out some raging roars!</p><br/><p>\"What the f*ck! Your mouth! You f*cking wretched fatty!\"</p><br/><p>The two bosses split up again and the battle returned to the previous rhythm. The only difference was that the physical attack of the bosses had increased by 10%. Fortunately, the damage of the debuffs {Touch of Frost} and {Touch of Flame} were not increased as they were considered as magic type attacks!</p><br/><p>The shared health bar of the two bosses was currently at 87%.</p><br/><p>Zhang Yang made a rough calculation in his own mind. At their current situation, it would require them to repeat the cycle for 8 times in order for them to empty out the shared health bar of the bosses! After 8 times of this repetitive cycle, the physical attack of the bosses will increase by 180%, boosting their basic attack up to about 38,000! Let alone potions, the healing capability of Han Ying Xue and Fantasy Sweetheart would not be able to catch up with the damage done to their party members!</p><br/><p>And if they don’t kite the two bosses to intercept and meet each other, then the effects of {Touch of Frost} and {Touch of Flame} will be stacking up indefinitely until the healers no longer can keep with their healing!</p><br/><p>What the f*ck! This situation is like pushing people to choose whether to jump off a building or jump into a river and drown! Neither of the choices were beneficial!</p><br/><p>\"Zhang Yang! We will not make it if this goes on!\" Zhang Yang wasn’t the only person to see the problem. Hundred Shots quickly spoke to Zhang Yang about it.</p><br/><p>Zhang Yang nodded, \"Maybe it’s time! Everyone! Take your [Power Potion] and get ready, it’s time we hold nothing back and activate our {Dance of the Heaven and Earth} together!\"</p><br/><p>They could still crunch their teeth together and get through the previous bosses without much of a problem, but these two bosses had an extremely long shared health bar, or maybe it’s just too long!</p><br/><p>Everyone followed Zhang Yang’s instruction and took their [Power Potions], and then they unleashed their {Dance of the Heaven and Earth} and other whatsoever hell onto the bosses.</p><br/><p>In the brief 10-second of time, the two bosses were inflicted with a massive number of damages, however, those were just a number of hits. Even though everyone had already taken [Power potion (Grade 10 Transmutation)]. they could only inflict a damage of 140,000 to the bosses. Yes, it is indeed a disastrous damage for the players, but for a boss with an extremely long health bar, especially having a shared health bar with another boss that made it even longer? No so much. They only managed to reduce the shared health bar of the bosses by 7%.</p><br/><p>Zhang Yang was trying to take out all of the scrolls available in his inventory as he was holding on against the boss. He would just throw any scrolls that can reduce attributes or stats onto the boss, as he kept on using the scrolls that can increase damages onto all of his party members! In short, he was clearing out everything in his possession in an attempt to take down the bosses!</p><br/><p>The reason he was willing to go so far was that he will not be able to meet Madran - The Son of God. And to not be able to meet Madran, he would never get his hands on the seventh piece of the [Dimensional Key Fragment]. Be reminded that all seven pieces of the [Dimensional Key Fragments] must be in one place to form a complete piece of [Dimensional Key] which was required to access the treasure vault in the void!</p><br/><p>Zhang Yang had been busting his ass trying to complete this main quest. And now that he is just one fragment short from completing the quest, he was never going to let everything go to waste, just because he was just trying to be stingy about the items in his inventory! So he’s throwing everything he had out like a Santa Claus!</p><br/><p>With Zhang Yang’s contribution regardless of the price to be paid, the firepower of the entire party got boosted up by a notch immediately! They were able to bring down the health bar of the bosses even faster.</p><br/><p>70%, 50%, 30%... as the shared health bar of the two bosses were reducing rapidly, the beneficial effect on the bosses’ {Defiant} was stacking up layer by layer, and their damage output were increasing as the effects were stacking up!</p><br/><p>\"Here you go!\" Zhang Yang tore the last piece of [Fatigue (Scroll)] on hand and threw it straight onto Ezali --- as he had more life-saving skills and better equipment compared to Endless Starlight, he made the choice to throw the final piece of [Fatigue (Scroll)] that reduced the attack of the boss onto the boss - Ezali, that Endless Starlight was engaging.</p><br/>\n</div>"}