{"title": "Chapter 432: The Beginning of a Bitter Battle!", "id": 432, "volume": 5, "url": "http://boxnovel.org/mmorpg-rebirth-of-the-legendary-guardian-chapter-432-the-beginning-of-a-bitter-battle", "volume_title": "Volume 5", "body": "<h1>Chapter 432: The Beginning of a Bitter Battle!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 432: The Beginning of a Bitter Battle!</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>\"Argh ---\" Fatty Han suddenly screamed like a little b*tch - as if his parents had just died in front of him. His scream was miserable.</p><br/><p>\"You f*cking fatty! Why did you suddenly scream like an animal shouting out a mating call! The boss has not even started poking your ass yet!\" Zhang Yang asked and laughed. The two of them had already gotten used to joking around with each other.</p><br/><p>\"... the boss died, but there was no loot!\" Fatty Han let out an enraged roar.</p><br/><p>\"The boss hasn’t died yet --- Oh, you mean Cazacrol?\"</p><br/><p>\"Yes! We just managed to take out a Mythical grade boss, and nothing dropped from it! What the f*ck, man! Is this some sort of prank, or what!\" Fatty Han was very angry with the fact he did all the hard work for nothing.</p><br/><p>Zhang Yang shook his head and said, \"The boss only had about 1,000,000 health points, the system put it in just to raise the difficulty of the battle by a little. So what can you expect? Do you think you just took out a fully-powered Mythical boss? Haha.\"</p><br/><p>\"Pui! Even if the boss only has 1 point of health when it spawns, it also counts as our kill! Of course, the system must award us with something! Some fine equipment will do too! Fatty Han was really pissed and he tried to argue.</p><br/><p>\"Haha! Then unleash your anger onto this boss!\" Zhang Yang charged in on Madran, and with a slash of his [Sword of Purging Devourer], he swung out a regular attack onto the boss and hooked over the aggro of the boss to himself.</p><br/><p>Madran had already given up so much for the past 20 years to build up his pet project, and all his efforts have gone to waste in just one brief moment - because of Zhang Yang and his gang. He was already on the verge of exploding as his rage was at the limit. His face was very savage, and scary and the same time. As a Spellcaster, he actually used his staff as a stick to hit his enemies. He had obviously lost it! He rapped the head of Zhang Yang as hard as he could, as if he wanted to mince Zhang Yang into a ball of minced meat with his own bare hands! Otherwise, he would not be able to release his anger!</p><br/><p>{Block}!</p><br/><p>Zhang Yang did not have to be polite as well, and with his shield raised, he blocked the attack from Madran’s staff, followed by a {Shield Bash} that scored a critical hit, inflicting a damage of 3,732 points onto the boss.</p><br/><p>\"Argh!\" Madran felt the pain and he let out a roar. His eyes were flashing with murderous intent as he raised his staff, pointing the tip of his staff right at Zhang Yang.</p><br/><p>\"Let the lightning swallow your souls!\" the boss waved his staff around and activated a skill!</p><br/><p>‘Ding! Madran has unleashed {Lightning Storm}!’</p><br/><p>Shoof!</p><br/><p>A stream of blindingly white light shot out from the tip of the staff, and the light traveled at Zhang Yang just like a bolt of lightning. It was really fast! That light inflicted a damage of ‘-14,694’ onto Zhang Yang. After that, the lightning jumped from Zhang Yang and struck Endless Starlight, who appeared to be the nearest to Zhang Yang at the moment. That attack inflicted Endless Starlight with a damage of 45,750, which instantly-killed him and sent him straight to his demise!</p><br/><p>And it was not over yet! That same stream of lightning then jumped from the dead body of Endless Starlight over to Lost Dream who happened to be the closest to Endless Starlight! An even more terrifying damage value was inflicted onto Lost Dream! A total of 126,000 damage points was inflicted on him, sending him straight back to the graveyard!</p><br/><p>The killing streak continued, as the lightning jumped on from the dead body of Lost Dream over to Sun Xin Yu, then onto Wei Yan Er! First, Sun Xin Yu was inflicted by a damage of 378,000 points, followed by Wei Yan Er who was inflicted with a damage of 1,134,000 points, sending both of them straight to the graveyard as well! Those amount of damage could have killed the two ladies over a couple of times already!</p><br/><p>With just a round of attack, the only ones left were Zhang Yang, Fatty Han, Hundred Shots, Han Ying Xue, Daffodil Daydream and Fantasy Sweetheart! Other than Zhang Yang, all of the DPS profession players had been wiped out clean!</p><br/><p>\"Holy mother of god, this boss skill is too sick to be true!\" Fatty Han put his hands on his head and screamed like a squealing piggy!</p><br/><p>Han Ying Xue calmly speculated, \"Every time the lightning jumps, the damage it can inflict will be multiplied threefold! So, after the second jump, it can already instant-kill any one of us!\"</p><br/><p>Calculating based on Zhang Yang’s amount of damage immunity, this {Lightning Storm} of Madran had a basic damage of 21,000 points. However, with every single jump, the damage of the skill will increase by 3 times! Furthermore, it seemed that this skill would chain on until everyone is dead, there was no limit to how many times the lightning can jump!So after jumping a few times, the damage that it would inflict would reach the millions!</p><br/><p>\"The leaping should have a limited range!\" Zhang Yang was having deep thoughts on it while he was engaged with the boss, slashing and cutting the boss as much as he can, \"Or else, after killing the little girl, the lightning should have leaped on to another one of us, even though we were very far away from her.\"</p><br/><p>\"I wonder, how far can the lightning jump?!\" Fatty Han was just being random.</p><br/><p>\"Oh, if you want to find out, of course, it won’t be easy! Come over here!\" Zhang Yang laughed and called Fatty Han over.</p><br/><p>\"Argh!\" the face of Fatty Han immediately became bitter, \"Little Yang, I’m not planning to die so young!\"</p><br/><p>\"Don’t worry! I will take good care of your pretty wives, you can go peacefully!\" Zhang Yang told a joke, trying to ease him up, and then he went back to the topic, \"Get to a spot at my back, 10 meters from me to be exact. Let’s see if the lightning will charge over to you after hitting me! Since there is an 80% chance that we are going to be wiped out this round, let’s just try to understand the skill of the boss as much as possible!\"</p><br/><p>\"Argh! Why do I have to suffer so much? Is it because I befriended a bad person?\" Fatty Han walked carefully up towards Zhang Yang, and he stopped on a spot about 10 meters away from Zhang Yang. Then, he continued to shoot his arrows at the boss.</p><br/><p>\"Aiyak!\" Han Ying Xue suddenly filled her face with shock and fear at the same time, then she said, \"Silly Yu, something invisible is attacking me!\"</p><br/><p>\"Me too! I felt it too!\" Daffodil Daydream and Fantasy Sweetheart were also saying the same thing.</p><br/><p>\"Hundred Shots, Fatty, do you guys feel anything wrong?\" Zhang Yang quickly asked.</p><br/><p>\"Yes, there’s something invisible attacking us. The damage isn’t high, it’s just about 1,000 damage points per hit!\" Hundred Shots nodded and told Zhang Yang.</p><br/><p>At that moment, Zhang Yang also noticed it too. He was inflicted with ‘-0’ damage. If it was an attack from the boss, then the damage wouldn’t be so low!</p><br/><p>\"The damage isn’t high, but there is a slow effect!\" Han Ying Xue was annoyed.</p><br/><p>Madran let out a cry and raised his staff at Zhang Yang. A stream of dark light emerged from the staff and turned into a black skull. The black skull flew over and struck Zhang Yang’s chest, inflicting him with a damage of approximately 15,000 points.</p><br/><p>However, this boss was really annoying. Right after using a magic attack, he would immediately use his staff to swing at Zhang Yang’s head!</p><br/><p>\"Let the lightning swallow your souls!\" the boss waved his staff around and activated the {Lightning Storm} for a second time. Zhang Yang and the remaining members of his party had been anticipating this.</p><br/><p>‘-14,694!’</p><br/><p>Zhang Yang was inflicted with an expected damage value, but the attack stopped there! The lightning did not leap over to anyone!</p><br/><p>\"Fatty, come closer to me! Move 3 meters closer!\" Zhang Yang said.</p><br/><p>\"My life is just like a dining table that is occupied with many breakable utensils!\" Fatty Han was trying to express his feelings with his lame joke as he moved a few steps forward.</p><br/><p>\"Hey, wretched fatty! You should be happy that you can still battle!\" Wei Yan Er was very bored and judging from her impatient characteristic, it was torturous for her to just lie down and watch others battling the boss.</p><br/><p>\"Eye of the Illusive Soul, swallow their souls, and leave nothing behind!\" Madran finally activated his second skill.</p><br/><p>‘Ding! Madran has unleashed {Eye of the Illusive Soul}!’</p><br/><p>Instantly, a large black eyeball homed in on Han Ying Xue, Daffodil Daydream and Hundred Shots! The eyeballs on their body would twitch and turn a little randomly, and it was really disgusting and terrifying to look at!</p><br/><p>[Eye of the Illusive Soul]: Allows you to see and attack the Illusive Souls. If you can kill one Illusive Soul within 30 seconds, the [Eye of the Illusive Soul] will be lifted. Or else, you will be transformed into an Illusive Soul by the [Eye of the Illusive Soul]!</p><br/><p>Hundred Shots quickly informed everyone, \"So it was the Illusive Souls that was attacking us earlier on, we cannot see them without the [Eye of the Illusive Soul]!\"</p><br/><p>\"Quickly, we only have 30 seconds to kill them, or else we will become one of them!\" Daffodil Daydream quickly said.</p><br/><p>\"How many are there? Are their attributes powerful?\" Zhang Yang could not see the Illusive Souls, so he asked Han Ying Xue and the other two who had the [Eye of the Illusive Soul] on them.</p><br/><p>\"Three!\" Han Ying Xue then posted the attributes of the Illusive Souls onto the party channel for everyone to see.</p><br/><p>[Illusive Soul] (Normal, Summon)</p><br/><p>Level: 95</p><br/><p>HP: 100,000</p><br/><p>Defense: 0</p><br/><p>Zhang Yang gave some deep thoughts about it, then he said, \"Hundred Shots, Daffodil Daydream, Witch Snow, you three combine your attacks and focus on only one Illusive Soul, but stop your attacks when the Illusive Soul is only left with about 10,000 health points. Then, Witch Snow will take it out first and release herself from the [Eye of the Illusive Soul]! As for Hundred Shots and Daffodil Daydream, you two have enough firepower to take out your own Illusive Souls. So after you guys help Han Ying Xue, you guys just have to focus on killing your own Illusive Souls. It shouldn’t be hard for you two!\"</p><br/><p>\"Alright!\"</p><br/><p>Han Ying Xue was a healer, a profession that was weak on attacking power. Although her equipment was really powerful, she lacked skills that could inflict higher damage. So, if she ever went into battle on her own, she would be at a disadvantage! Furthermore, the longer Han Ying Xue is ‘tied down’, the more stress Daffodil Daydream was going to have. Because Daffodil Daydream would have to cover Han Ying Xue’s part to heal up Zhang Yang and also the other remaining members of the party. Her stress would become tremendous!</p><br/><p>Han Ying Xue, Hundred Shots and Daffodil Daydream worked together and focused on one of the Illusive Souls, and then they attack the monster that was only left with about 10,000 health points. After Han Ying Xue slaughtered the monster with ease, Daffodil Daydream and Hundred Shots turned to their own Illusive Souls and began to focus their assaults onto the monsters. With their strong attacks, it would still take about 15 seconds to kill a monster with 0 defense and 100,000 health points. There was still about 5 to 6 seconds left when they managed to kill the Illusive Souls and unbind themselves from the effect of the [Eye of the Illusive Soul]!</p><br/><p>Other than that, the Illusive Souls would only attack players without the [Eye of the Illusive Soul]. So, Han Ying Xue, Hundred Shots and Daffodil Daydream could focus on slaying the monsters.</p><br/><p>\"Let the lightning swallow your souls!\" Madran waved his staff around and activated the {Lightning Storm} for the third time.</p><br/><p>‘-14,694!’</p><br/><p>Zhang Yang was struck by a lightning until he was crispy on the outside, tender on the inside, just like the previous encounter with the lightning strike. However, Fatty Han was still alive and well, shooting arrows towards the boss.</p><br/><p>\"Fatty, come two more steps closer to me!\" Zhang Yang laughed as he spoke to Fatty Han.</p><br/><p>\"Go away! I don’t want to do this anymore! I’m not listening to you! La la la!\" Fatty Han roared.</p><br/><p>\"Haha! Brother fatty, just take two more steps and everything would still be fine.\" Endless Starlight could not help himself, as he was basically a talkative person with no tendency to shut his mouth. He immediately laughed after saying it.</p><br/><p>\"Endless brat, are you looking to be beaten up?\"</p><br/><p>\"You have destroyed all the efforts of my life, my entire life! You pests! Imbeciles! It would still be hard for me to calm down even after I crush you all into dust!\" Madran let out a thunderous roar and continued to swing his staff at Zhang Yang repeatedly. This annoying boss actually turned out to be pretty lethal in melee combat. His physical attack actually reached up to about 20,000 points! Because physical damage tended to be reduced or lowered due to the defense and armor of players, the damage inflicted onto the players would be slightly lowered. But, the annoying part about this boss’ melee assaults was that the staff had a certain rate to stun the players, and the rate was not that low either!</p><br/><p>However, Zhang Yang could also use his {Shield Bash}. Because currently, his {Shield Bash} could deal double damage, making it one of the strong damage skills that can contribute to bringing down the boss as quickly as possible!</p><br/><p>\"Embrace my wrath and die!\" Madran suddenly pointed his staff towards Daffodil Daydream! Right after that. The body of the little beauty with a pretty face and a pair of huge boobies suddenly surged with sparkling lightning, making her look like ‘The Flash’. It looked very fantastic. But what was even more ‘fantastic’ is the additional negative effect that was suddenly added onto her.</p><br/><p>[Strength of Madran]: explodes after 10 seconds, inflicts you with 1 point of Nature Damage, but inflicts all targets within a 10-meter radius with 50,000 Nature Damage, with you as the center point.</p><br/><p>\"Holy sheet, get away from everyone now, Daffodil Daydream!\" Everyone was screaming at her, telling her to get away from them after reading the negative effect that she is carrying.</p><br/><p>\"Alright! I’m going, I’m going!\" Daydream quickly nodded and turned around in a rush. As she was turning very fast, her pair of papaya-sized heavy boobs jiggled through the air and bounced up and down. The ‘scenery’ was really stunning!</p><br/><p>Among the members of the party, one would be able to recall the drooling sound coming from Fatty Han and Endless Starlight after witnessing that ‘scenery’.</p><br/>\n</div>"}