{"title": "Chapter 441: A Sabotage", "id": 441, "volume": 5, "url": "http://boxnovel.org/mmorpg-rebirth-of-the-legendary-guardian-chapter-441-a-sabotage", "volume_title": "Volume 5", "body": "<h1>Chapter 441: A Sabotage</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 441: A Sabotage</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>One Sword Stroke did not hesitate and immediately rushed towards Dusk Phoenix. A Guardian ate1 Thieves for breakfast, by default. Even though One Sword Stroke was a proud man, he would not jeopardize victory for the sake of pride. He purposefully left the harder target for Zhang Yang to handle as he took on the easier one.</p><br/><p>Zhang Yang crossed his arms and nodded with a smile. He left One Sword Stroke alone and decided to accept the challenge.</p><br/><p>\"Curses!\" Dusk Phoenix cried. She did not wait for One Sword Stroke to come to her, but instead she leaped forward and swung her sword hard to parry One Sword Stroke’s attacks.</p><br/><p>On the other side, Lord Mandala muttered something under his breath and instantly cast a fireball at Zhang Yang, dealing close to 2,000 damage. That attack was a Pyromancer’s {Fire Blast}, an instant-cast skill which did not require any chanting. The skill allowed Lord Mandala to ride away on his mount, while attacking at the same time.</p><br/><p>Although a Spellcaster did not have a blind spot, however, like a Hunter, it would be over once an opponent manages to get close to him. Similar to all ranged attackers, once a melee fighter gets into their range, ranged attackers would face a dangerous situation where the melee attacker could finish them.</p><br/><p>An instant-cast skill had a long cool down rate, Lord Mandala could not rely on the skill to kite Zhang Yang. The main reason being that Zhang Yang, or rather, all Warriors had the skill {Berserker’s Heal} which only had 2 minutes of cool down time. If Lord Mandala relied solely on {Fire Blast}, he could only take out 1/3 of his HP before Zhang Yang could use {Berserker’s Heal}.</p><br/><p>After a good distance, Lord Mandala jumped down from his mount and started chanting a spell.</p><br/><p>‘-5,094!’</p><br/><p>A blast of fire came down from the sky in a form of a huge meteorite. It smashed into Zhang Yang, dealing close to 5,000 damage and even stunning him for 3 seconds. The skill was called {Fallen Meteor} which caused 150% Fire damage and stunned a target for 3 seconds. The casting time was 1.5 seconds.</p><br/><p>After stunning Zhang Yang, Lord Mandala activated {Heart of Flame} and proceeded to chant the Pyromancer’s strongest spell, the {Explosive Flame}.</p><br/><p>Zhang Yang smiled.</p><br/><p>{Warrior’s Will}!</p><br/><p>Zhang Yang immediately regained his movement and rushed over to Lord Mandala. Since the bear was close to him, Zhang Yang had mentally commanded the bear to use {Wild Charge} on him. The bear rushed towards Lord Mandala at an insane speed and stunned the man and his mount for 1 second, canceling Lord Mandala’s chanting animation and spell.</p><br/><p>Zhang Yang laid down his first attack on Lord Mandala, dealing 4,223 damage. After 1 second, Lord Mandala regained his senses but just as he was about to cast another spell, Zhang Yang stunned him again with {Brutal Smash}.</p><br/><p>\"What the f*ck!\" Lord Mandala cried. He immediately used {Apparate} to remove the stun on him and teleported 10 meters away from his current position. Since his character had teleported, Lord Mandala’s mount had regained its senses as well, but had to run towards its owner.</p><br/><p>Zhang Yang laughed at his futile attempt to run away. Zhang Yang swiftly jumped down from his bear and used {Charge} to \"fly\" to Lord Mandala.</p><br/><p>Like an arrow head, Zhang Yang glided through the dirt and stunned the poor man again. Closely after the brief second stunning duration, Lord Mandala was about to use {Fire Blast} when Zhang Yang had stunned him again with {Blast Wave}!</p><br/><p>If he could cry, Lord Mandala would have done so. Since the start, Lord Mandala was only attacked once, but stunned repeatedly! What was the use of {Apparate} if the opponent could stun him continuously for all eternity!</p><br/><p>\"Hehe. I’m not done yet.\" Zhang Yang muttered.</p><br/><p>{Thunder Strike}!</p><br/><p>Just when Lord Mandala had regained his movement, Zhang Yang had stomped on the ground, sending a wave of electricity that slowed Lord Mandala down, leaving him speechless.</p><br/><p>Spellcasters were supposed to counter tanks! But how could Lord Mandala kill Zhang Yang when he possesses so many stunning skills?! Even though Lord Mandala had {Fallen Meteor} to stun Zhang Yang, the stunning duration was halved by Zhang Yang’s [Heart of the Death Knight]! There was no way for Lord Mandala to keep a safe distance from Zhang Yang.</p><br/><p>Lord Mandala had battled other players before, and none of them were as annoying as Zhang Yang! At the very least, Lord Mandala could still deal some damage to the opponent! Zhang Yang had too much HP to begin with! By the time he had blasted half of Zhang Yang HP off, Lord Mandala would have only 10% HP, or even lesser than that!</p><br/><p>Sighing with great despair, Lord Mandala could not help to have the urge to put up the white flag. The guy was a tank, a walking turtle! They were supposed to be tough, that Lord Mandala would agree. But how could anyone explain a tank that could ditch out nuclear like attacks!? His opponent had the HP of a super tank, the attack of a raging Berserker, and the stunning skills of a sneaky Thief! What do you call such a player? A hacker? A mother f*cker?</p><br/><p>Even though Lord Mandala tried his best to retaliate, he was unable to escape the fate of being killed by Zhang Yang. Zhang Yang had not even needed to fully bring out his true potential and had killed the poor Pyromancer in less than a minute.</p><br/><p>Zhang Yang turned over to One Sword Stroke and observed the man. There was no one else besides One Sword Stroke who was looking all too nervous on the battle field. Zhang Yang felt something was off only for half of a second before he realized what was going on there. Dusk Phoenix had entered stealth mode and had been playing hide and seek with One Sword Stroke!</p><br/><p>Zhang Yang had to laugh. \"Looks like I win this round.\"</p><br/><p>\"Hmph.\" One Sword Stroke scoffed. He was a little disgruntled. Even though he had picked Dusk Phoenix as his opponent, he had not expected Dusk Phoenix to run away in mid battle. Disappointed, One Sword Stroke accepted his loss and accepted his defeat.</p><br/><p>Zhang Yang proceeded to dig out the chest and opened it as quickly as he could, while being on alert at all time. He was eyeing left and right to make sure One Sword Stroke did not play dirty, or that Dusk Phoenix does not do anything funny. Fortunately, Zhang Yang had managed to open the chest, and loot everything out without any trouble from either of them. This time, Zhang Yang had obtained enough Glory points to push him up to 2,966, making him the first on the ranking list.</p><br/><p>After the chest was emptied, all the players who had been killed were finally given the option window to revive. One by one, all the bodies around disappeared and the field. One Sword Stroke glared at Zhang Yang disgruntledly and went on his way.</p><br/><p>After the ordeal, all 10 players had their chances of opening a chest each, causing their rankings to go up and down each time they opened a chest. No one had their ranking holding onto one position. Sadly, after the previous ordeal, Zhang Yang had become public enemy number one. Whenever there was a situation where three players were present around the chest, they would automatically come to a silent agreement and attack Zhang Yang altogether.</p><br/><p>Zhang Yang was torn. If all of them were melee class, he had the utmost confidence to defeat them with all of his skills. However, if any of them were Hunters or Spellcasters, Zhang Yang would not dare to take the heat. There was a high chance for him to actually be killed by them! After all, all surviving members in this realm were the top players, the best of the best, even in all eight regions.</p><br/><p>Lucky for him, Zhang Yang had {Shadow of the Void}. If he couldn’t win the battle, or have a chance of being killed, he could use the skill to escape the field at any moment he wanted. Zhang Yang was smart enough to keep {Burrow} at hand. The 10 minute active duration skill was too good to reveal now. If he still had the [Cloak of the Dark Wings], which was already taken by Han Ying Xue, he could have gained one more means of escaping!</p><br/><p>Right now, the tension in the field got higher and wilder. Players tended to attack whenever they saw each other. As time passed on, the tension grew as well. 3 hours…6 hours…eventually, the entire battle had reached the 11th hour and 45 minutes point.</p><br/><p>At that moment, all 10 players had one thought circulating in their mind. The next chest would be the last, and that chest would determine the winner.</p><br/><p>So far, Zhang Yang was ranked at the highest, but that position was not at all secure. Captain America, ranked at second was only 24 Glory Points away from Zhang Yang, and even Musashi Ou-sama was only 82 points away from Zhang Yang, and he was ranked at the last. Technically, if he opened the chest before anyone else, Musashi could be the winner. That is, if he were to obtain 82 points or more for the last chest.</p><br/><p>When Zhang Yang obtained the treasure map, he remained stationary and smiled. Instead of rushing to the chest, Zhang Yang took his time and observed the area, before barging in. He waited and loitered around until the timer had ticked in the last 10 minutes, before activating {Burrow}.</p><br/><p>Like a Thief, {Burrow} forbade any interaction with objects, or it will forcefully dispel the skill and reveal him. Zhang Yang had no intention of opening the chest. Instead, he wanted to prevent other players from opening the chest! Since he was leading, to win the event, he only needed to make sure that no one else could open the chest!</p><br/><p>Zhang Yang knew that he was the main target, thanks to all his grand performances. A nail that stuck out would get hammered. In this case, he would be hammered really hard, if he were to appear right there and then. No matter how strong he was, he was just one man. How could he tank 9 more players that were slightly lower, if not at the same level as him?</p><br/><p>Zhang Yang submerged into the earth and \"walked\" beneath the other players. This magical {Burrow} was able to detect players and hear their conversation.</p><br/><p>\"Now that’s that. I suggest that everyone stays put for now and wait for Zhan Yu. We will pool together and kill him.\"</p><br/><p>\"I agree. Even though I do not like this idea, that guy is far beyond our league. 1v1 or 2v1 is no longer an option.\"</p><br/><p>\"I see. For now, it’s a truce. Until he dies, we will not fight each other, for it would only benefit him.\"</p><br/><p>Amidst the conversation, two more players had arrived and joined the armistice. The internal fight that Zhang Yang was waiting for did not occur after all.</p><br/><p>Another minute went by and the last three participants joined the group, leaving them all staring at each other blankly.</p><br/><p>\"Where the hell is Zhan Yu?\"</p><br/><p>\"Maybe he spotted us and had decided to pull put?\"</p><br/><p>\"What now? If we wait, he will be the winner!\"</p><br/><p>Even after much argument, none of them came to a final decision, much less do anything. As the timer ticked on, their patience ran low. So far, everyone had accumulated Glory points to a point where their scores were merely one or two points away from each other. If any of them could get their hands on the chest, it would be a victory for them. Finally, the temptation of wanting to obtain the Level reward and title had surfaced.</p><br/><p>\"Let’s dig it up first.\"</p><br/><p>Zhang Yang did not know who was the person who suggested it, but the idea was approved by everyone almost immediately. Once the chest was unearthed from the ground, October Miracle was the first to show his hands. With a quick cast, he activated a spell that materialized a large water elemental being.</p><br/><p>The water elemental was about 10 meters tall, with a blue, bulky, semi-transparent body. Right at the moment of his appearance, the blue monsters spread its blue slime and blasted a white light at everyone in the vicinity. All eight players around the chest were encased in ice.</p><br/><p>[Ice Prison]: Frozen in place. Unable to move. Effect can be dispel by receiving an attack. Lasts for 20 seconds.</p><br/><p>What a strong immobilizing skill!</p><br/><p>Zhang Yang gritted his teeth. It was good that he had never looked down on anyone who he did not know. Even though he had the experience from his past life, which encompassed many aspects of the game, other players from other parts of the world had experienced things that Zhang Yang was never able to learn.</p><br/><p>Naturally, October Miracle did not attack anyone and took the chance to open the chest.</p><br/><p>10%...50%...70%...80%...</p><br/><p>The entire process would have taken him 10 seconds to complete. But by the 8th second, Saabo emerged out of the ice and blasted October Miracle with a shadow whip. Cursing in a foreign language, October Miracle was disgruntled when his attempt to open the chest was interrupted. He then cast a [Frost Dragon] towards Saabo and commanded the water elemental monster to attack him as well.</p><br/><p>Zhang Yang sighed at the sight of two element Spellcaster blasting each other with arcane power. More importantly, there were many other players who could still hold in the urge to strike!</p><br/><p>How would one not own a dispel skill at this current stage? Everyone would have it! Except for Saabo, everyone else were patiently waiting for the right time to strike! However, Zhang Yang did not care about attacking. He had already have a plan to strike out at the last 0.1 second.</p><br/><p>Boop! Boop!</p><br/><p>One by one, the icy blocks that encased all players were broken down, forcing them to participate in a chaotic war that could not be avoided.</p><br/><p>Translator Note:</p><br/><p>1. Food. A jargon in the gaming industry. Food means an easy target or a specific target that was meant for a person/individual/entity to kill. For example, Rabbits are Food for Eagles since eagles could easily snatch the poor rabbit from the sky.</p><br/>\n</div>"}