{"title": "Chapter 457: Bloody-Shadow Strike", "id": 457, "volume": 5, "url": "http://boxnovel.org/mmorpg-rebirth-of-the-legendary-guardian-chapter-457-bloody-shadow-strike", "volume_title": "Volume 5", "body": "<h1>Chapter 457: Bloody-Shadow Strike</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 457: Bloody-Shadow Strike</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>\"... What kind of queen is this! What a shameless b*tch!\" Daffodil Daydream had finally lost it.</p><br/><p>Han Ying Xue sent a private message over to Zhang Yang saying, \"Silly Yu, the boss is questioning your capability!\"</p><br/><p>Zhang Yang laughed, and replied, \"Should I be offended? Well, you’ve seen how capable I am!\"</p><br/><p>\"You hoodlum!\" Han Ying Xue blushed, with a slight frown on her face as she rolled her eyes at Zhang Yang.</p><br/><p>Madisha sniffed the air a little and revealed a shocked face, and suddenly laughed knowingly, \"Huh? These 4 girls are still virgins? Little man, seriously?\"</p><br/><p>\"Cough!\" Zhang Yang almost choked in his own saliva, and he could not help but sigh, \"This boss could actually sniff out your virginities! This game is that intrusive huh? Awesome! Though, who knows if it’s real or not!\" He turned his head to look at Sun Xin Yu, Han Ying Xue and Daffodil Daydream.</p><br/><p>\"You hoodlum! What are you looking at!\" Han Ying Xue snapped at him.</p><br/><p>\"What a shameless boss!\" Daffodil Daydream was also blushing.</p><br/><p>Sun Xin Yu did not even say a word, but she began to lunge out rapidly, with the two daggers in her hands, like a ferocious t-rex. Obviously, she wasn’t calm at the moment!</p><br/><p>\"Haha! Very good! The blood of the virgins can be used for my facial care, and little man can stay to rid me of my loneliness!\" Madisha wetted her glistening crimson lips with her tongue, making them look even more ‘sexy’.</p><br/><p>\"No wonder Imperial Heaven's Empire perished in the past. With a whore of a queen like this, all the people of that empire were like grass by the roadside!\" Zhang Yang was shouting in rage.</p><br/><p>\"No wonder the 4 princes looked totally different! I wonder, how many ‘dads’ were involved in ‘producing’ them!\"</p><br/><p>\"Well, the number of ‘dad’ involved is still a small issue. Judging from their weird-*ss looks, I’m afraid that their ‘dads’ might not even be human! This boss has really ‘heavy’ tastes! Haha!\"</p><br/><p>\"You bastards!\" Madisha suddenly let out a cry of rage as the words from Zhang Yang and the ladies provoked her. As she threw out her hair spear at Zhang Yang, a powerful impact instantly blew Zhang Yang off his feet. Giving no opportunity for Zhang Yang to regain his strength and get back on his feet, the boss immediately lashed out again, and impaled him to the ground!</p><br/><p>\"Zhang Yang ---\" the four ladies were screaming his name at the same time, \"Are you alright?\"</p><br/><p>\"If you got stabbed in the middle of your chest, would you still be alright? There’s a freaking hole in my chest! Argh!\" Although Zhang Yang had already set the pain-receptor function to the lowest, he was still struck by an excruciating pain, and he had to grit his teeth to prevent himself from shouting out anymore. Without hesitation, he swung his axe at the hair spear that had just pierced his chest!</p><br/><p>Although the hair spear of the boss was really sharp, it was still made of hair after all. How could mere hair be compared to a Mythical tier weapon! The axe sliced cleanly through the hair!</p><br/><p>Zhang Yang leaped to his feet immediately after that, but his chest still had a huge hole in it, and fresh blood was oozing out right of the chest wound! He realized that he now had an additional negative effect!</p><br/><p>[Bleed]: Loses 5,000 health points in every 3 seconds. This effect cannot be canceled by any defense skills or damage reduction skills. Lasts for 15 seconds.</p><br/><p>\"Blood, fresh blood, look at that, just spectacularly beautiful!\" Madisha was drunk in ecstasy as she sang those words. She raised her right hand up, and her hair started to form together again, and it eventually formed into another hair spear! She sent it towards Zhang Yang again!</p><br/><p>Zhang Yang raised up his axe, and slashed at the hair, \"You ugly old b*tch! I’m going to slice your hair clean off your head for what you did to me!\"</p><br/><p>\"Would she actually get bald from that? Hahaha!\" Wei Yan Er burst into laughter.</p><br/><p>Madisha had always highly regarded her own beauty. Now that she had been called ‘ugly old b*tch’ by Zhang Yang and ‘bald’ by Wei Yan Er, of course she would be enraged until she screamed and cried.</p><br/><p>\"Demonic Hair Barrage\"!</p><br/><p>As the boss let out tears of rage, she also cried out a skill name. Madisha’s black hair began to curl around, like snakes intertwining around together, forming black arrows made of hair, all around her head, before all of them were shot out into the surroundings, in all possible directions!</p><br/><p>These hair arrows were unavoidable. Zhang Yang and the ladies were caught in the attack. They were skewered by the arrows as they desperately tried to evade. This was how oppressive a Mythical boss could be!</p><br/><p>Everyone was inflicted with a damage of about 40,000 points and they were also inflicted with {Bleed} effects. Zhang Yang’s first {Bleed} effect was still kicking and ticking, so he was inflicted with a second layer of {Bleed}, and the negative effects started stacking up. Now, Zhang Yang was losing a total of 10,000 health points by every passing second!</p><br/><p>\"Mythical bosses are no laughing matter! This is one heck of a strong and powerful boss!\" Everyone was shaken up. Each of them had to activate their skills to slow down the effect of {Bleed} as they needed to reduce the stress that Han Ying Xue was experiencing right now.</p><br/><p>But that was the first ‘dish’ of the boss battle! Just a brief moment after she activated her {Demonic Hair Barrage}, she slammed her palm against the ground, which was made of green jade. As she twisted her hand, it broke through the jade and sunk into the ground. With a powerful grip, the ground trembled a little and she actually pulled up a large part of the ground, like lifting up a blanket from a bed, without removing it completely!</p><br/><p>Madisha let out a deafening scream as she began to shake the ground with her left hand that currently buried beneath the surface of the ground. The entire ground shook, sending waves of the shattered rocks that shot up into the sky. The scene was extremely magnificent!</p><br/><p>It was like a 7.0 magnitude earthquake! Zhang Yang and the ladies were shaken up to the point that they could not remain standing. At the same time, the shattered rocks from the ground were launched at them, and each small pebble of these shattered rocks inflicted a damage of about 10,000 or 20,000 points!</p><br/><p>The apocalyptic scene lasted for about 10 seconds before Madisha retracted her left hand. Then, she went back to using her right hand, forming up more hair spears which she directed at Zhang Yang.</p><br/><p>Zhang Yang was so terrified that he quickly activated his {Shield Wall}! Although he had removed his Titan Set Armor to wear some Mythical tiered equipment, he had still kept his [Titan Chest Plate] equipped. This particular piece of equipment was really awesome in it’s own way! With the two special effects, this piece of equipment was almost as good as a Mythical Tier equipment!</p><br/><p>With his {Shield Wall} activated, Zhang Yang’s health bar was regenerating by 10% for every second that passed. Currently, he had about 220,000 Maximum Health Points, that meant he would heal about 22,000 health points per second! This amount of healing was already higher than the healing capabilities of Han Ying Xue!</p><br/><p>Although the attack of the boss was really powerful in a sense, once Zhang Yang activates his {Shield Wall}, every single attack from the boss becomes a gentle touch. As the boss delivered what that was possibly her most fearsome combo yet, Zhang Yang’s HP was actually increasing, instead of decreasing.</p><br/><p>\"Little man, you’re really tenacious! You’re ‘lasting’ longer than I expected! I like it!\" Madisha was grinning coldly as she sent more of her hair spears at Zhang Yang, one after another. Her attacks were really fast and deadly!</p><br/><p>Zhang Yang laughed out loud and said, \"I’m not a ‘quick’ gunner, lasting for 30 minutes is a piece of cake for me!\"</p><br/><p>Han Ying Xue heard him, and she immediately blushed, because she had experienced it firsthand herself, witnessing his immense stamina! She was embarrassed, yet joyful at the same time, a sense of pride filling her heart. But, she did not dare let down her guard even for a second in healing up the party. Other than Zhang Yang who had his {Shield Wall}, which kept him practically immune from all attacks at the moment, the other party members were losing their health, like crazy! They were not far from death! If the boss were to activate another wave of {Demonic Hair Barrage}, they would definitely be instantly-killed!</p><br/><p>The battle continued on for a brief moment before Madisha let out another deafening cry. She activated her {Demonic Hair Barrage}, and shot her hair arrows into the surroundings. Her hair literally filed up every corner of the area!</p><br/><p>As the hair sliced through everyone, the five of them really hit by ‘jackpots’! The air was red with the mist of blood, and every one of them simply looked gory! Daffodil Daydream was worst off. One of her eyes was skewered by one of the hair arrows! She did not just lose a lot of blood, but she was half blind! She could not even aim at the boss properly, and her attacks were missing!</p><br/><p>Next up was Wei Yan Er. A hair arrow had went straight through her chest! Fortunately for her, although the wound looked really nasty, it did not affect the attack power of the player. Everything was just a visual effect.</p><br/><p>Zhang Yang shook his head and said, \"This boss is really nasty! The little girl is already having trouble developing. Yet, the boss still wants to damage that area! Sigh, this is so inhumane!\"</p><br/><p>Wei Yan Er immediately screamed and whined!</p><br/><p>Madisha became more ferocious by the passing seconds. She began to act even more vigorously upon Zhang Yang! As she continuously struck Zhang Yang’s armor, the sound of her hair spear clashing on his armor could almost make a drum kit!</p><br/><p>Suddenly, the boss sent her hair spear right through Zhang Yang’s chest. Although Zhang Yang was inflicted with damage, the part of the royal robe that covered her butt suddenly got corroded! A large hole quickly expanded, and part of her fair *ss was revealed through that hole!</p><br/><p>Zhang Yang was shocked when he saw what happened! \"Huh?\" Then, he realized that the boss had been afflicted with a new negative effect: Defense Decay (1 Layer), reduces 100 points of defense.</p><br/><p>This was actually the special effect of the [Shield of the Faceless Corrupter], having a 10% rate to trigger a reduction of 100 defense points. But, no one would have thought the visual effects of this debuff would look like this! The developer of the game had to gall to actually ‘expose’ the boss so blatantly!</p><br/><p>Zhang Yang was pleased to see that, so he laughed and said, \"Well, this is the real deal when it comes to ‘Cripple Defense’! If the {Cripple Defense} of the warriors did this, then, when people use 5 layers of {Cripple Defense}, tsk tsk tsk! It would surely be interesting to have that! Hahaha!\"</p><br/><p>\"Shameless!\"</p><br/><p>\"Pervert!\"</p><br/><p>The ladies scolded him.</p><br/><p>Madisha was not bothered at all, having her butt exposed like that. She continued to wield her hair spear like an experienced general in a battle field. Every single blow from her spear was striking not far from Zhang Yang’s vital points.</p><br/><p>But, the special effect of {Defense Decay} was triggered repeatedly! Zhang Yang must be extremely lucky, today! The magnificent looking, royal robe of Madisha began to be filled with more holes. After just a brief moment, the royal robe had become a fish net, instead of a royal robe! Holes littered all over the entire robe!</p><br/><p>Madisha let out a soft roar, and then she moved her left hand, and grabbed hold a fistful of fabric. With a strong tug, she tore off the entire royal robe! It was already ruined, completely, and it infuriated her so. By taking the robe away, the boss exposed her fair, naked body! The heavenly, blessed body of the boss was definitely a marvelous creation that exceeded nature. The parts that were supposed to be big could not be grasped entirely in one palm, while the parts that were supposed to be small could comfortably fit in a hand!</p><br/><p>Annoyingly, mosaic boxes covered up the upper part and the lower part of the boss’ ‘ very important’ parts!</p><br/><p>\"Mosaic-boxed movies and games are the reason why the human race is still underdeveloped!\" Zhang Yang let out a miserable cry into the sky!</p><br/><p>Although Madisha was battling the five of them with her naked body exposed, there was no sense of shame on her face at all. Instead, she was gazing at Zhang Yang sleazily. She would even slap her own curvy ass, winking at Zhang Yang while saying, \"Young man, don’t you want to release it in me? Once, maybe?\"</p><br/><p>Although this is a virtual game, the players were well immersed into the game, thanks to the current wonder of Virtual Reality. These overly realistic effects of the game might just make people forget, that this is just game sometimes! Instead, it would fool people into thinking that it was the second reality!</p><br/><p>Zhang Yang felt a rush, and his heart rate shot up. Fortunately, he had more control over his brains, than his ‘gun’. If he really was a man with an insatiable lust, then he would already have slept with all his sexy secretaries, and his beautiful models over and over again! As for Zhang Yang, he was happy to let his eyes roam more than his ‘gun’. He would only sleep with the women he liked, like Han Ying Xue and Sun Xin Yu.</p><br/><p>\"Hahaha! My will is strong! Are you trying to seduce me? You’re way out of your league!\" Zhang Yang laughed, as he continued to swing his axe at the boss!</p><br/><p>\"You must be an ‘incompetent’ man! No real men in the world can possibly resist my charm! And there never will be!\" Madisha let out an angry roar as her eyes began to glowed red. Likewise, the hair spear in her hands instantly turned bloody red! \"{Bloody-Shadow Strike}!\"</p><br/><p>The spear struck!</p><br/><p>Zhang Yang raised his shield high up as his instincts kicked in. He activated his {Block} reflexively. But, the spear of the boss was unstoppable! It actually went straight through the Mythical Tier shield and right into Zhang Yang’s chest, and once again, nailing Zhang Yang to the ground!</p><br/><p>‘-235,160!’</p><br/><p>‘Ding! You died!’</p><br/><p>‘Ding! You are resurrected because of {Rise Anew}!’</p><br/><p>In just an instant, Zhang Yang experienced the sensation of being alive, to being dead, then from being dead, to being alive again! Holy sheet! Even with his {Block} activated, he could not block against the {Bloody-Shadow Strike} from the boss. If it weren’t for Han Ying Xue’s {Rise Anew}, Zhang Yang would have been dead, and the rest of the party members would have followed him to the graveyard!</p><br/><p>That must be the ultimate skill of the boss! That was why the skill {Block}, which can be used every 6 seconds, could not block against this attack!</p><br/><p>\"Silly Yu, you still had about 160,000 health points before the boss struck you with her ultimate skill right? So, what really happened? How did you die right after one hit?\" when facing an insta-kill, it did not matter how capable a healer is, there would be no room to even start healing in the first place! Han Ying Xue could only stare in shock at Zhang Yang when he was being instant-killed, she hated this kind of situation the most as she could not do anything.</p><br/><p>\"The basic attack of that ultimate attack was about 300,000 points. That attack still struck me with about 240,000 damage, even with my defense!\" Zhang Yang grit his teeth, thinking about it. His current Maximum Health Point was about 220,000 points, he would not survive the attack of the boss, even if he had full health!</p><br/><p>It seems that the hardest challenge of this boss battle was finding a way to survive the {Bloody-Shadow Strike}.</p><br/><p>Up till now, Zhang Yang and his party had taken out a total of 5,000,000 health points of the boss. It did seem to be a lot, by the looks of it, but Madisha was a Mythical boss with a Maximum Health of 30,000,000 points! So 5,000,000 is just one portion out of six, which was actually lesser than 20%!</p><br/><p>Two minutes later, Madisha’s eyes started glowing red again, it was time for the boss to lash out with her second {Bloody-Shadow Strike}!</p><br/><p>Zhang Yang took a look at his own health bar, and his saw that he still had about 180,000 health points left. After making a calculated decision, he activated his {Last Vigor}, boosting his health points up to 243,314/ 286,120!</p><br/><p>‘-238,342!’</p><br/><p>The spear of Madisha once again went right through Zhang Yang’s shield and stabbed straight into Zhang Yang’s chest! The strike was so mighty, that no words could describe it’s power!</p><br/><p>{Berserker’s Heal}!</p><br/><p>‘+286,120!’</p><br/><p>Zhang Yang healed himself back to his full health state in just an instant, and he started retaliating with ferocity!</p><br/><p>\"This was the reason why the system gave us so many Mythical equipment before the boss battle! Without these Mythical equipment to support and boost our health bars, even though guildmaster’s equipment was on par, it would still have not been enough to go up against a Mythical boss!\" Daffodil Daydream let out a sigh.</p><br/><p>The Maximum Health of Zhang Yang, before he switched his equipment with the Mythical Tier equipment was about 90,000 points. Even if he activated his {Last Vigor}, he would still be instantly-killed by the boss’ {Bloody-Shadow Strike}. Furthermore, a mere 90,000 health points could only last against 3 hits of the boss, as each of the boss’s attack inflicted about 40,000 damage! If Han Ying Xue healed him just a little slower during the battle, Zhang Yang would have died as well! So, be it the ultimate skill of the boss, or the regular attacks of the boss, Zhang Yang would hardly survive, with 90,000 health points only!</p><br/><p>Zhang Yang had already activated his {Shield Wall} and {Last Vigor}, he had activated the special effect of his equipment [Heart of the Death Knight], in order to stay alive against the assaults of the boss! Fortunately for him, Zhang Yang had a long HP bar and rage point bar. His {Shield Wall} cooled down in 3 minutes, which allowed him to repeatedly use it in relatively short bursts. Therefore, he could spam his {Shield Wall} twice within one cycle, before he repeats the entire process again!</p><br/><p>Normally, the tanker would put their Skill Points into their {Block}, because of the skill {Block} was the most practical skill that a tanker could wish for! This dungeon had a restriction whereby only players below Level 100 were eligible to enter. So, regular players would only have 9 Skill Points in hand, which allowed players to elevate one of the skills to the max level. After adding all their Skill Points onto their {Block}, naturally they would not be able to add one single Skill Point on their {Shield Wall}. So, if players ever step foot into this dungeon without increasing the level of their {Shield Wall}, they would cry miserably when they find out about this.</p><br/><p>However, Zhang Yang had earned at least 26 Skill Points throughout the game up till now. Not only could he upgrade his {Block} and {Warrior’s Will} to their max level, he could also upgrade his {Shield Wall} to Level 9, which was only one level short of full mastery!</p><br/><p>Therefore, only the best among the best party, in all eight servers would be able to clear this special dungeon!</p><br/>\n</div>"}