{"title": "Chapter 463: Felice, Too Cute, Too Powerful", "id": 463, "volume": 5, "url": "http://boxnovel.org/mmorpg-rebirth-of-the-legendary-guardian-chapter-463-felice-too-cute-too-powerful", "volume_title": "Volume 5", "body": "<h1>Chapter 463: Felice, Too Cute, Too Powerful</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 463: Felice, Too Cute, Too Powerful</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Zhang Yang jumped when he heard Felice finally uttering her first word. He would have never expected \"Big Brother1\" to be her first word!</p><br/><p>On cloud nine, Zhang Yang smiled happily and said, \"Felice, do you know who you are?\"</p><br/><p>Felice was surprised at the sudden question and went quiet, as she dwelled in her sea of thoughts. After a slight wincing, Felice shook her head and replied, \"I think I do, but whenever I try to remember it, I would have a headache!\"</p><br/><p>Zhang Yang walked closer to her and patted her head gently. She was at his shoulder height, and it was easy for Zhang Yang to rub the top of her head.</p><br/><p>\"There’s no need to hurt yourself thinking about it. You’ll have my word that I will protect you!\"</p><br/><p>\"Yes, big brother!\" Felice nodded her head enthusiastically.</p><br/><p>Zhang Yang opened Felice’s profile window and analyzed her properties.</p><br/><p>[Felice] (Humanoid)</p><br/><p>Level: 30</p><br/><p>HP: 43,530</p><br/><p>Defense: 1,960</p><br/><p>Melee Attack: 5,888 – 6,488 (Attack Interval: 3.8 seconds)</p><br/><p>Skills:</p><br/><p>[Blazing Dragon's Spear]: Deals 100% physical attack, imbued with Fire elemental damage. Requires: Melee Weapon. Cooldown: 1 seconds. Cost: 50 Power.</p><br/><p>[Dragon Barrage]: Deals 150% physical attack on a target. 10% chance to stun the target. Effective against boss monsters with lower stun rates. Requires: Melee Weapon. Cooldown: 1 minute. Cost: 50 Power.</p><br/><p>[Dragonhawk Transformation]: Morphs into a Dragonhawk. Possesses a series of skills that are not available in human form. Unable to use skills of her human form while in Dragonhawk form.</p><br/><p>Special: {Seal 1} {Seal 2} {Seal 3} {Seal 4}</p><br/><p>Note: Zhan Yu’s Battle Companion</p><br/><p>Zhang Yang was greatly blown away when he saw Felice’s long HP, thick Defense, and her absurd attack power. She was only Level 30 and yet, she already had 40,000 HP! Han Ying Xue herself had only close to 50,000 HP despite being higher than Level 90, and that was already under the effects of Zhang Yang’s Vitality Aura buff. Felice currently possesses much more HP than what Zhang Yang had at her level! And she was far from her full potential!</p><br/><p>As for her attacking power, even though {Blazing Dragon’s Spear} was not too impressive since it would merely be an extra attack above the regular attack. However, the skill was inherently strong, since it had Fire elemental damage, which could ignore Physical Defense. {Dragon’s Spear Barrage} was strong. It had a fixed chance to stun, and could even be used on a boss!</p><br/><p>Lastly, transformation?</p><br/><p>Zhang Yang asked curiously. \"Felice, you can transform?\"</p><br/><p>\"Yes, big brother!\" With a quick concentration, Felice glowed brightly and morphed into a beautiful Dragonhawk. She grew a long tail and a pair of beautiful wings that had an eight-meter-wide wingspan. From the size of a regular human, she had morphed into a 5-meter long flying majestic beast. Her feathers were gleaming with various vibrant colors.</p><br/><p>[Felice] (Dragonhawk)</p><br/><p>Level: 30</p><br/><p>HP: 32,950</p><br/><p>Defense: 880</p><br/><p>Magic Attack: 3,192 – 3,792</p><br/><p>Skills:</p><br/><p>[Pulverizing Flame]: Breathes fires from above, deals 3,000 Fire damage every second to an area, 10x10 meters wide. Lasts for 10 seconds. Requires channeling. Cooldown: 30 seconds. Cost: 100 Focus.</p><br/><p>[Fire Missile]: Fire a Fire Missile at a target. Deals 200% Magic, Fire elemental damage. Casting time: 2 seconds. Cost: 20 Focus.</p><br/><p>Additional Effect: Can Fly.</p><br/><p>Hmph. Strong.</p><br/><p>Right then, Felice was already really strong. Something about the four seals on her properties had to mean something. Unsealing them would probably unseal even more power. Right then, Zhang Yang had come to an understanding, that perhaps the main story quest reward was indeed worth it, after all!</p><br/><p>Sadly, even though Felice’s Dragonhawk mode was strong, she could not carry Zhang Yang, even though she could fly. At most, she could lift Zhang Yang via her claws for a short distance, before having to put Zhang Yang down.</p><br/><p>Zhang Yang proceeded to kill his way deeper into the new world. As he arrived at his intended destination, Felice had reached Level 64 and had gained a massive boost to all of her stats.</p><br/><p>The destination where Zhang Yang had arrived at was a small town. Right then, Zhang Yang was standing on top of a large hill facing directly towards the town. From the top of the hill, Zhang Yang could clearly see the overall landscape of the entire town. The town was occupied by humans. Their buildings and structures were mostly westernized, with a large empty plaza in the center of the town. The stereotypical giant clock was situated at the entrance instead.</p><br/><p>Zhang Yang was sure that this town was the first territory that China players had first conquered in his previous life. Even though there were better territories in later maps, this map was important, since it determined the ease of teleportation between the outside world and the Chaos Realm.</p><br/><p>This little town was the first station that any player would come through from China region, and also the only obstacle that any player that wanted to invade China’s region. They could either fight their way through, sneak through, or better, fly above the town if they had Flying Mounts.</p><br/><p>However so, if any Tom Dick or Harry could get their hands on a Flying Mount, and fly over territories, this little town would not have such significant value in the first place.</p><br/><p>This town would play an important role in the defense of China’s region territory. If someone from other regions had taken over this place, they would have gained unrestricted access to China’s Chaos Realm portal, and would be able to march in to take over any China’s territory at will.</p><br/><p>Zhang Yang had the highest bit of determination to conquer this territory, however, there was one major problem. He did not know how to obtain the town’s [Territory Command Order]! Might as well take a stroll around town before jumping to any random conclusions.</p><br/><p>There were many tall cliffs after the hill. The land was extremely hard to venture if one were to travel on foot. Unless he had a Flying Mount now, Zhang Yang would have to walk down the hill from the south and travel around the entire mountainous region, only to circle back again to reach the town.</p><br/><p>Very soon, after descending the hill, Zhang Yang arrived at a small graveyard. This place had already become a playground for the Spectres. There were many rotting corpses walking around the place that made eerie, skin-crawl inducing shrieks.</p><br/><p>[Wandering Skeletal Soldier] (Normal, Specter)</p><br/><p>Level: 105</p><br/><p>HP: 16,200</p><br/><p>Defense: 100</p><br/><p>Ranged Attack: 4,808 – 5,408</p><br/><p>Melee Attack: 3,128 – 3,728</p><br/><p>Skills:</p><br/><p>[Armor Break]: Deals 150 Ranged attack to a target, and reduces 50% of the target’s defense value. Lasts for 10 seconds.</p><br/><p>Note: Fallen soldier of the war that had taken place 7 years ago. Countless brave warriors had sacrificed their lives to protect the land from invading demons</p><br/><p>\"Hold! Don’t go any further!\"</p><br/><p>Just as Zhang Yang was about to enter the battlefield, and an older gentleman walked towards him. The man had a walking staff, and had trouble walking towards Zhang Yang.</p><br/><p>[Grave Keeper Douglas] (Normal, Humanoid)</p><br/><p>Level: 1</p><br/><p>Note: Not combatant NPC.</p><br/><p>Zhang Yang turned to the old man and said, \"Do not worry for me, old man. I am very strong. The monsters here can’t touch me!\"</p><br/><p>When Zhang Yang stopped his tracks, Felice flew down from the sky and reverted to her human form to stand beside him.</p><br/><p>\"What I’m worried of, isn’t you, son.\" Said Douglas nonchalantly, which made Zhang Yang slightly ticked off. \"I don’t want ‘you’ to harm ‘them’!\"</p><br/><p>Zhang Yang raised an eyebrow. \"What are you talking about? Have you gone senile? Aren’t they Spectres?\" said Zhang Yang.</p><br/><p>\"You are right. They ‘are’ Spectres. Listen to me dear boy. Many years ago, there was a war that befell this land. These Spectres that roamed around here were the human heroes who had sacrificed themselves to fight and preserve peace for the town of Morning.\" Douglas explained the situation, while walking around the graveyard, dusting off the dried leaves on one of the tombstones.</p><br/><p>Zhang Yang had a sudden thought. The name of the town, Morning, was the name of the territory that he wanted to conquer. Since he had no clue on how to obtain the town’s [Territory Command Order], it was best to follow the quest here rather than just roam around aimlessly without a clear lead.</p><br/><p>Zhang Yang stopped to think for quite some time before saying, \"I cannot allow these Spectres here to roam around freely. What if someone were to get hurt or killed by them? Heroes or not, they are now Spectres. If someone were to be gravely injured, who is to be held responsible?\" said Zhang Yang.</p><br/><p>Douglas cringed. \"They are brave warriors! They fought in the war and died! If someone were to approach them, the dead warrior would attack out of their unrelenting fighting spirits. Perhaps, there is a way to save them. Only with the Calming Ethereal Holy Water, these Spectres would rest in peace.\"</p><br/><p>Zhang Yang interjected immediately and said, \"Old man, where can I find this holy water? As an adventurer, I pledged my sword to fight for peace! Please allow me to search this holy water to bring peace to these fallen heroes.\"</p><br/><p>\"If you are as strong as you said, you can make your way to the Poison Blood Valley. In the deepest part of the Valley, there is a small spring. That spring contains the Calming Ethereal Holy Water.\" The old man shook his head in disappointment before walking away. \"I must say, you are not the first warrior to venture to the Poison Blood Valley. There were many warriors like you, who claimed to be strong, but never returned. I am certain that you would be the last to go, and I hope that you would be the first to make it back alive.\" The old man had not sincerity in his words.</p><br/><p>‘Ding! Douglas had a quest for you: Calming Ethereal Holy Water. Will you accept it?’</p><br/><p>Accept.</p><br/><p>‘Ding! You have obtained an item: Empty Flask!’</p><br/><p>[Calming Ethereal Holy Water] (Difficulty Level: B)</p><br/><p>Quest Description: Head to the depths of the Poison Blood Valley and returned the water from the spring. Be adviced, the Poison Blood Valley is a place of great danger. Be alert at all times. Bring a comrade if necessary. Poison Blood Valley is located in the West.</p><br/><p>Progress: Calming Ethereal Holy Water 0/1</p><br/><p>Zhang Yang smiled and nodded politely before leaving. \"Felice, let’s go.\"</p><br/><p>\"Yes, big brother,\" said Felice obediently, like a little sister. She morphed into the Dragonhawk form without Zhang Yang asking. Zhang Yang stared at the mythical beast, hoping that he too, would quickly stumble upon a Flying Mount as soon as possible. Unlike regular pet mounts, a Flying Mount was extremely rare, and would take a lot of luck to stumble upon.</p><br/><p>Zhang Yang, Felice, and the white bear slaughtered random beasts along the way and quickly arrived the Poison Blood Valley. The valley got its name from a long flowing river that flowed down the center of the valley. Instead of normal blue waters, the river had greenish, thick, lumpy liquid that flows from the edge of the valley. From afar, Zhang Yang could already smell the putrid smell of the water. On both sides of the river were stone paths that were dyed in deep red colors. Zhang Yang did not know if the pathway was dyed with blood or if it was just a natural occurrence. There were herbs growing along the crimson pathway.</p><br/><p>Just then Zhang Yang realized that, he had not yet released the Herb Foraging Familiar! Zhang Yang quickly summoned out the familiar, paid the 1,000 gold coins fee and allowed the familiar to roam. Right when the familiar appeared at his feet, it quickly flew behind Zhang Yang and circled around carefully. The little critter stared at Felice with hostility and decided to flap its tiny little wings and disappear into the nearby forest. Perhaps, the little critter was already annoyed at Wei Yan Er’s random \"assaults\" and was preparing to escape when it was summoned out.</p><br/><p>Thump...Thump…Thump…</p><br/><p>There were loud, heavy footsteps echoing through the land. Before Zhang Yang could do anything else, a large, 10 meters tall giant walked pass Zhang Yang not far from where he stood. The orc wore nothing but a crude loincloth and a long spikey club that rested on his left shoulder. His right arm was dragging the carcass of a dead leopard that had been flattened to the point where its limbs were not in their regular positions.</p><br/><p>[Savage Man-Eating Orc] (Elite, Humanoid)</p><br/><p>Level: 110</p><br/><p>HP: 1,100,000</p><br/><p>Defense: 1,200</p><br/><p>Melee Attack: 9,194 – 9,994</p><br/><p>Skills:</p><br/><p>[Head Bash]: Forcefully bashes the target’s head, dealing 150% melee damage and stunning the target for 2 seconds.</p><br/><p>Note: One faction of the gigantic orc race. Prefers to behave savagely. Loves human meat.</p><br/><p>\"Big brother! This giant orc eats human!\" cried Felice angrily. She wielded her spear in her hand and made to run towards the orc.</p><br/><p>Zhang Yang immediately held his hand out to stop the little girl. \"Felice, listen to me. Don’t rush into things. He’s too strong for you now. Allow me to take this.\"</p><br/><p>At the current stage of the game, the system had already tweaked the Level Suppression Gap to 30 Levels, Felice had only needed to gain 10 levels more to be able to deal unsuppressed damage. By then, she would be a strong attacker in her own right?! Until then, she would have to listen to Zhang Yang and watch from the sidelines. If she dies, she would lose one level, which would put a strain on Zhang Yang. Even though pets and Battle Companions required less experience points compared to players, it would still take ages to level them up!</p><br/><p>Zhang Yang hopped onto the bear, and charged towards the giant orc.</p><br/><p>\"Ohhoo…food. Food coming. Me kill.\"</p><br/><p>The giant orc released the carcass his hand, and he grabbed the club from his shoulders. The orc wielded the spiked club with both of his gigantic hands, and slammed it down at Zhang Yang with the force of a thousand men!</p><br/><p>WHAM!</p><br/><p>Unfortunately, Zhang Yang was already using the skill - {Wild Charge} and could not move away in the midst of a skill animation. However, Zhang Yang was already prepared for an attack. He held his shield up high, and activated {Block} at the last minute.</p><br/><p>‘-730!’ {Block} reflect damage.</p><br/><p>The white bear threw its massive body with the power {Wild Charge}, and swiped its massive claw at the orc’s foot.</p><br/><p>‘-4,412!’</p><br/><p>‘-4,291!’</p><br/><p>As expected from the Yellow-Gold battle mount, its attack was as strong as Zhang Yang. It was a pity that the bear was only Level 98. If Zhang Yang could grind a little more to push it to the threshold of Level 100, the bear attack power would have been a lot higher.</p><br/><p>It could not be helped. Zhang Yang had gained so many bonus level rewards from events and quests, causing him to reach higher levels much faster than this battle mount. Bonus levels are rewards granted to the player. As a battle mount would only gain experience points from hands-on battles, the bear would be unable to gain any experience points, despite the system granting the owner bonus levels.</p><br/><p>Felice did not just sit quietly. After seeing her \"big brother\" attacked by the giant orc bully, she jumped into the battle, and morphed into the Dragonhawk, and attacked from afar. From mid-air, she spewed out Fire Missiles, and bombarded the orc with damage values surpassing 6,000!</p><br/><p>Zhang Yang was stunned. He had wanted to call out for Felice to withdraw, but when he saw the damage that she had dealt to the orc, despite still having the suppressed damage via the level gap, he gave up on the idea and continued to attack the orc. Her attack power was already beyond the Level 98 bear. If she were to gain more levels and participate in battle with Zhang Yang, she would be the main attacker! By then, Sun Xin Yu and the other super-powered attackers in Zhang Yang’s team would not be able to exceed the damage that Felice could deal!</p><br/><p>Even though the orc had a little over 1 million HP, Zhang Yang had the bear and Felice, and was able to defeat the boss without a hitch.</p><br/><p>Just as Zhang Yang was about to deliver the last killing blow, the orc growled loudly and his spiked club started glowing red. Zhang Yang could not react in time to dodge the slam.</p><br/><p>\"Club feels good! I smash!\"</p><br/><p>Wham!</p><br/><p>‘-7,336!’</p><br/><p>Zhang Yang could not counter the attack since {Block} was still in a cooldown state. Blood started to flow down and submerged Zhang Yang’s helm. The orc’s {Head Bash} was strong enough to even stun Zhang Yang for 2 seconds.</p><br/><p>\"Big Brother!\" Felice cried out in rage. She flew down from the sky and returned to her human form. With a powerful kick on the ground, Felice launched herself at the orc and cast {Dragon’s Spear Barrage}.</p><br/><p>‘-7,867!’</p><br/><p>Felice was fortunate to have procced a stun effect on the orc!</p><br/><p>TL Note:</p><br/><p>1. Big Brother: If you watch Japanese anime, you would know how a person feels when a little girl calls the main character Onii-chan. That sort of feeling was what Zhang Yang felt, Onii-chan…Onii-chan…lol.</p><br/>\n</div>"}