{"title": "Chapter 469: An Upgrade on the Pet Mount", "id": 469, "volume": 5, "url": "http://boxnovel.org/mmorpg-rebirth-of-the-legendary-guardian-chapter-469-an-upgrade-on-the-pet-mount", "volume_title": "Volume 5", "body": "<h1>Chapter 469: An Upgrade on the Pet Mount</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 469: An Upgrade on the Pet Mount</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Zhang Yan did not dare to risk giving these monsters the chance to strike first!</p><br/><p>These are all ranged-attacking monsters, and they had already surrounded Zhang Yang from all directions! Just imagine this, if 50+ of these monsters launched their assaults on Zhang Yang at the same time, he would be instantly-killed, even if he were to activate his {Shield Wall}! So Zhang Yang made a quick decision to throw Luilina over to Felice and say, \"Felice, take Luilina and get the hell out of here!\"</p><br/><p>\"Roger!\" Felice was well aware that Zhang Yang had more than one method of escaping, so she did not raise any objections this time around, and started taking off, with Luilina in her arms.</p><br/><p>\"After them! Do not let them escape!\" Branden growled ruthlessly.</p><br/><p>Zhang Yang did not even summon any of his [Mounts] this time to prevent any unnecessary deaths of his beloved pets. He turned around and plunged his [Sword of Purging Devourer] into the ground and started saying a ‘prayer’, \"Mr. Stone, when more players are strong enough to enter this realm, you are going to have a miserable life ahead, where you will be killed over again, and again. So, why don’t you kill some of these scums and unleash your wrath while you can? Get some payback in advance, and think later!\"</p><br/><p>‘-862!’</p><br/><p>A damage value appeared on the spot where Zhang Yang had plunged his sword in. The entire pile of rocks began to tremble again. The gigantic body mass of Stone Giant Yanita emerged from the ground, right before the eyes of everyone. With an intimidating, thunderous roar, it slammed its hand onto Zhang Yang!</p><br/><p>Zhang Yang quickly activated his {Shadow of the Void} and disengaged from the battle with Stone Giant Yanita immediately! It was not the time to toy around anymore!</p><br/><p>Shoof! Zhang Yang broke out of the ‘horse-hive’ defense of the cavalry army, and left the entire army to endure the wrath of Stone Giant Yanita.</p><br/><p>\"Rawgh!\" The Stone Giant let out an outburst of rage as this was already the second time it had been poked, right in the *ss, just as it was having a good nap! Such interruptions can never be forgiven! The Stone Giant instantly went berserk, as it began to slam its hands all around, like a crazed monkey! A few of the griffins were smashed into mush, and fell from the sky in pieces. Their riders either shared their fate, or dropped straight to their deaths! Some lucky ones survived the fall. But could it really be called luck? They survived, just to face the wrath of the Stone Giant on the ground!</p><br/><p>Meanwhile far from the battlefield, Zhang Yang reappeared as his {Shadow of the Void} began to fade. Felice approached Zhang Yang, still carrying Luilina. She barely hovered above the ground, as she was exhausted from carrying the NPC! But she did not drop her of course. However, there were still 7 Griffin-riders pursuing them, firing arrows at Felice! Zhang Yang let out a battle cry and summoned Whitey. He leaped on Whitey’s back and charged towards the enemies.</p><br/><p>\"Brother!\" Felice flopped to the ground, unable to fight back as she was still carrying the NPC! So, she could only endure all the attacks from the enemies. Fortunately for her, Felice had an extremely long health bar. Or else, she would have been taken out already!</p><br/><p>\"Kill! No mercy!\" The 7 Morning Town Cavalries landed onto the ground as well, as they continued to shoot arrows from their bows. Shoof! Shoof! Shoof! The arrows flew right at Zhang Yang and Felice with precise accuracy!</p><br/><p>Zhang Yang quickly jumped down from Whitey, and placed Luilina on the back of Whitey. Zhang Yang gave a command in his mind, and Whitey immediately carried Luilina and ran in the opposite direction. Without the NPC in the way, Zhang Yang could finally unleash his power, without having to hold back! He pulled his sword out and raised his shield, and then he began to charge at the Morning Town Cavalries! As he was charging through the arrows that were flying towards him, the arrows were deflected off his armor and fell to the ground, one after another. The sound of arrowheads clashing into the armor was really loud and clear.</p><br/><p>Because Felice was also facing the same type of attacks, she transformed back into her humanoid form, drawing her lance. She seemed to enjoy the heat of battle, with Zhang Yang by her side.</p><br/><p>These monsters were in the air, and Zhang Yang had no idea on how to gather the monsters in one spot. The monsters would automatically fly away from each other the moment when they got too close to each other. There was no point in Zhang Yang and Felice trying to force them into one same spot. Therefore, Zhang Yang had to battle without kiting the monsters into one spot.</p><br/><p>Without caring much about it, Zhang Yang targeted one of the monsters and began to slash like hell. Now he only had to wait for the cooldown period of his {Spear of Obliteration} to be over. Then, all he needed to do in order to hook the aggro of the other 6 monsters over to him is to throw the {Spear of Obliteration} at them! Even though Felice had a very long health bar, and very thick armor and defense, she did not have the ability to recover her health. If the monsters ever focused fire on her, she would still go down easily!</p><br/><p>The regular arrows of the monster could only inflict him with about 3,000 damage, but the {Armor Penetrating Arrows} had extremely sharp edges. One arrow could deal more than 9,000 damage on Zhang Yang! Fortunately for him, the cooldown period for this skill is very long. If they could fire them rapidly, Zhang Yang would be finished off in no time!</p><br/><p>Zhang Yang was constantly spamming all his Status Restriction Effect Skills, timing them appropriately. He tried to stun the monsters to reduce the damage he would receive as the battle went on.</p><br/><p>Although the humanoid form of Felice had weaker attack power compared to her Dragonhawk form, Felice was still so much more aggressive and stronger than Zhang Yang! She had already slain one of the monsters within 2 minutes, and had went on to take on her second monster. As she tangled with one of the monsters currently attacking, Zhang Yang could feel his pressure being lifted substantially!</p><br/><p>As Zhang Yang took down another monster on his end, he finally let out a breath of relief. The difference of battling 4 monsters at once, compared to 6, was a lot. It was like a 50% drop in difficulty!</p><br/><p>After another round of mindless slashing, Zhang Yang had already used up all his skills. He had even activated his {Rearm}! After slaying another 3 monsters, Zhang Yang activated his {Shadow of the Void} to disengage from the battle and went to the side to patch himself up with some [Bandages]. He was only left with about 2,000 health points! He had to leave Felice with the remaining monsters.</p><br/><p>After he patched up and took some [Snacks], Zhang Yang rejoined back the battle and activated {Provoke} to hook the boss back to him. At that moment, Felice was left with only 8,000 health points!</p><br/><p>Using everything they had, the two of them finally took down the last monster, and Zhang Yang quickly took out his [Snacks] and continued to heal himself. What actually surprised him was that Felice could also heal up by consuming [Snacks]! Seeing how she has been ‘functioning’ so far, other than the fact that she is an AI, Felice is basically similar to a normal player already!</p><br/><p>After just a while, the two of them had regained their full health states. Whitey had also returned with Luilina upon the mind command that Zhang Yang had transmitted.</p><br/><p>Zhang Yang turned his head around, and looked at the direction of the other battlefield. The Morning Town Cavalries were basically flying around in the air while they were battling the Stone Giant Yanita. Therefore, the strongest skill that the Stone Giant had - {Earthly Smash} had totally no effect on the Morning Town Cavalries. The Stone Giant could only use {Toss} as it’s main attack. The damage that the boss could do to the cavalry army was largely restricted. That was why it had only taken out about 20 Morning Calvaries after all this while.</p><br/><p>Of course, compared to Zhang Yang’s performance, it was doing far better. Zhang Yang should be burying himself alive in shame!</p><br/><p>After some time, all of the Morning Town Cavalries were completely wiped out by the Stone Giant, and the boss still had about 20,000,000 health points. Zhang Yang took a good look at it, and decided to give up on the idea. The army had not weakened it at all! If his party of 10 were all here, it could probably be done. But now that he had seen how powerful this boss is, it would be better for him to just give up on his previous plan and walk away!</p><br/><p>After Yanita had wiped out the cavalry, it went back to its peaceful sleep. Unfortunately, Branden was so prideful that he had not retreated when he had the chance. He charged in at the boss and was crushed to his demise, leaving no chance for Zhang Yang to cut in and slay him!</p><br/><p>Of course, Branden had a Flying Mount, so Zhang Yang would not have any chance to slay him at all, in the first place!</p><br/><p>‘Ding! The second wave of pursuers have been wiped out, you have completed the quest: Survive the desperate circumstances - much earlier than expected. Acquired 10,000,000 experience points, Lucky Attribute +1 as your reward!’</p><br/><p>‘Ding! You have acquired a selective quest: In for a penny, in for a pound, accept or decline?’</p><br/><p>Zhang Yang frowned and accepted the continuation of the quest.</p><br/><p>[In for a penny, In for a pound] (Difficulty: A-rank)</p><br/><p>Description: You have wiped out the defensive force of the Morning Town. Now, Rockya is a general without his army! You have slain his son, warrior. He is not going to let you off this easily! So, you have decided that since you’re already in for a penny, why not in for a pound and finish what’s been started! Travel back to Morning Town and slay Rockya!</p><br/><p>Completion: Kill Rockya 0/1</p><br/><p>Zhang Yang widened his eyes, as he began to see a Territory waving at him! He was another step closer to owning a new Territory!</p><br/><p>Zhang Yang did not rush back to the Morning Town. Instead, he brought Felice and Snow-Scale Wind Serpent along to level up first. After all, he was all alone at the moment, so he would not be able to seek help from his party members and guild members. He could only rely on himself, his Flying Mount, and Felice!</p><br/><p>Though the description said that the Morning Town had lost most of it’s Defense force, it still was the lair of this foul Rockya! It would be best to keep an eye out and be ready for anything! After all, Zhang Yang had a lot of time to spare on hand. It would take at least 1 month for other players to be able to enter the Chaos Realm. Furthermore, the quest did not state any time limit, so he could take his own sweet time at completing the quest.</p><br/><p>After looking around for a bit, Zhang Yang found himself on a deserted mountain. He could see a large amount of Normal-tiered Spectres wandering around the area, without any sense of purpose.</p><br/><p>He decided to choose that spot to grind.</p><br/><p>Zhang Yang got Felice to transform into her Dragonhawk Form to lure the monsters, while he looked out for a cave. After he kept Luilina safe in the cave, he summoned the [Snow-scale Wind Serpent], and both of them guarded the entrance of the cave. In just a brief period of time, Felice came back with a large number of monsters. Judging from the looks of it, there should be at least a hundred of them!</p><br/><p>As Felice flew past Zhang Yang from above, she transformed back to her Humanoid Form, and stood ready with her lance!</p><br/><p>These Spectres began to gush towards Zhang Yang. He activated his {Blood Rage} a few seconds before the monsters reached him. He had already acquired 30 points of Rage Points. The moment the monsters got close to him, he activated his {Blast Wave}!</p><br/><p>Instantly, a damage of ‘-1,418’ was inflicted onto each of the monsters within the effective range, and the scene was glorious! The special effect of the [Sword of Purging Devourer] got triggered, and another wave of damage was inflicted upon every single monster within the effective range, over and over again!</p><br/><p>When Zhang Yang took over the aggro of the monsters, Felice transformed into her Dragonhawk Form and flew out of the cave, hovering above them all. Then, she spat out her {Pulverizing Flame} between her open beak, and covered the ground in a sea of flames! The ground started burning up as the monsters that were within the effective range of the attack were inflicted with a damage of 3,000 fire damage for every second! The attack was really powerful and intimidating!</p><br/><p>However, although these skeletal creatures from the foul depths of darkness could not fly, they did not just stand there, waiting for their health points to deplete. Many of these Spectre monsters had ranged attacks, so they started firing their arrows, inflicting damage on Felice! Although these are just normal monsters, but tens or hundreds of them shooting at the same time would also inflict extremely great damage to a person over time. After the {Pulverizing Flame} was over, Felice was only left with about 10% health! So, she quickly flew into the cave, to the back of Zhang Yang, to take shelter from the arrows.</p><br/><p>Zhang Yang handed her a [Bandage] and Felice quickly transformed herself back to Humanoid Form before applying the [Bandage]. She patched herself up, and her health was brought back up by 20,000 points. Unfortunate for her, this amount of healing was far from enough. She had lost so much more than that! So, she could only wait out the cooldown for the [Bandage] to complete its cycle.</p><br/><p>Still, with her ‘flamethrower’ attack, Felice had managed to inflict a total of 1,500,000 points of damage, while burning about 80 monsters to a crisp in the process! A stream of rich experience points came in and the little Serpent was leveled up twice! Unfortunately, Felice needed even more experience points to level up again. She still needed about 10% more before she could reach Level 86.</p><br/><p>Zhang Yang wielded his [Sword of Purging Devourer], slashing and slicing up the monsters before him. After a while, more monsters were slain, and Felice had finally acquired enough experience points to level up! A stream of golden light coursed through her entire body, and she reached Level 86! Her health bar was full again!</p><br/><p>At the same time, the cooldown period for her {Pulverizing Flame} was over. So Felice transformed herself into her Dragonhawk Form, flew out on the monsters and activated her {Pulverizing Flame of Rage} once more! That attack inflicted a great number of damage to the monsters as the fire blazed on.</p><br/><p>After 3 rounds of {Pulverizing Flame of Rage}, hundreds of Spectres lay dead. Looking at the chart of damage output, the damage output of Felice was not far behind Zhang Yang’s! Zhang Yang could not help but to praise her in his heart. Although Zhang Yang’s damage output was not as good as the DPS players on his party like Sun Xin Yu and Wei Yan Er, he was still unsurpassed in AoE attacks, especially since he had the [Dark Enigmatic Sword]. The special effect of the sword enabled him to trigger repeated AoE attacks onto the monsters within effective range! That made him very powerful in terms of AoE killing, to the point that no one could rival him!</p><br/><p>With Felice’s aid, be it one on one or an AoE kill, Zhang Yang had the right to look down upon the entire world!</p><br/><p>He could not help but to ‘pet’ Felice on her head and said, \"Felice, you really are a great and incredible helper for me!\"</p><br/><p>Felice turned to him and smiled, her face is so cute that Zhang Yang wanted to melt on the spot!</p><br/><p>After finishing up the first wave of the monsters, Felice flew out to lure the second wave. After they had settled the second wave, it was time for a third wave! This little cave behind Zhang Yang had unwittingly been turned into the graveyard of the Spectre. After just three hours, the dead bodies of these skeletal Spectres had piled up like mountains around the entrance of the cave! Zhang Yang would take the time to pick up the loots available on the ground whenever Felice flew out to lure new wave of monsters back to him. Every time, he would only manage to pick up about one-third of the loot from the ground, before Felice comes back with a new wave.</p><br/><p>Zhang Yang was also trying to pick up the more valuable loot, but many would still disappear and be flushed away by the system. If Han Ying Xue and Wei Yan Er could only see this, they would definitely be heartbroken to see all the ‘valuables’ disappearing!</p><br/><p>Level 90, Level 100, Level 101!</p><br/><p>Five hours later, Felice had reached the ‘limit capacity’ on her level, as pets and Battle-Companions could not exceed the level of the player, their owner. So, now that Felice has reached the same Level as Zhang Yang, she would no longer be able to share experience points with Zhang Yang. The experience points would only be shared among Zhang Yang and the [Snow-Scale Wind Serpent].</p><br/><p>After Felice had reached Level 100, all of her attributes got a major upgrade!</p><br/><p>[Felice] (Humanoid Form)</p><br/><p>Level: 101</p><br/><p>HP: 174,190 (With Vitality Aura)</p><br/><p>Defense: 4,480</p><br/><p>Melee Attack: 17,535 - 18, 535 (Attack Interval: 3.8 seconds, DPS: 4,746)</p><br/><p>Skills:</p><br/><p>[Blazing Dragon's Spear]: Inflicts 100% melee attack, with fire damage on a target. Required: Melee Weapon. Cool Down: 1 second. Consume: 50 Mana points</p><br/><p>[Dragon's Spear Barrage]: Inflicts 150% melee attack of physical damage onto a target, with a 10% rate of stunning the target for 2 seconds. Effective on Bosses as well, but with a greatly diminished rate. Required: Melee Weapon. Cool Down: 1 minute. Consumes: 50 Mana points.</p><br/><p>[Absolute Defense]: When being hit, takes 1% damage from all attacks, lasts for 2 minutes. Cooldown: 12 hours. This effect can only take place when Felice is in her Human Form, and will wear off the moment she changes her form.</p><br/><p>It seems that Felice has acquired a new skill in her Human Form, and that skill was a ridiculously powerful ‘Shield Wall’!</p><br/><p>[Felice] (Dragonhawk Form)</p><br/><p>Level: 101</p><br/><p>HP: 131,660 (With Vitality Aura)</p><br/><p>Defense: 880</p><br/><p>Magic Resistance: 4,480</p><br/><p>Magic Attack: 10,517 - 11,117</p><br/><p>It did not matter whatever form Felice was in, be in Human Form or Dragonhawk Form, her attributes were enough to put every single Tanker and DPS player to shame! She had become so much more powerful than them all!</p><br/><p>They had almost cleared out all the monsters in this area, and the remaining monsters were just too scattered, so Zhang Yang was not in the mood to waste time in slaying them. He rode on the [Snow-Scale Wind Serpent] and flew to another end of the mountain. He located a small cave and began to ‘harvest’ more experience points. Soon after, [Snow-Scale Wind Serpent] had already reached Level 84!</p><br/><p>Because Felice could no longer earn experience points, the [Snow-Scale Wind Serpent] was receiving the bulk of it! After merely two hours, [Snow-Scale Wind Serpent] had finally reached Level 100!</p><br/><p>A stream of golden light beamed across the body of the [Snow-Scale Wind Serpent] as the body of the Serpent expanded out, growing up to a total length of 10 meters! It had a wingspan of about 15 to 16 meters! It looked mighty, and magnificent!</p><br/><p>[Snow-Scale Wind Serpent] (Yellow-Gold Flying Battle Mount)</p><br/><p>Level: 100</p><br/><p>HP: 33,600 (With Vitality Aura)</p><br/><p>Defense: 1,800</p><br/><p>Magic Attack: 4,256 - 5,056</p><br/><p>Skills:</p><br/><p>[Shared Life] (Passive): Unites the health points of the pet and the owner together.</p><br/><p>[Venom Spout]: Spouts venom towards a target, inflict 100% Magic Attack of Nature Damage, there is a 10% rate of poisoning the target. The target will receive 20% additional damage when being struck with Nature Attribute Attacks during effective period. Lasts for 10 seconds. The effects cannot be stacked. Instant cast. Cooldown: 2 seconds.</p><br/><p>This is actually a Spell type [Mount]! This is wonderful! Magic Attacks will not be affected by the Defense of monsters, including Bosses!</p><br/><p>With everyone prepared now, it’s time to collect the bounty for Rockya!</p><br/>\n</div>"}