{"title": "Chapter 474: Messick", "id": 474, "volume": 5, "url": "http://boxnovel.org/mmorpg-rebirth-of-the-legendary-guardian-chapter-474-messick", "volume_title": "Volume 5", "body": "<h1>Chapter 474: Messick</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 474: Messick</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>[Messick] (Elite, Humanoid)</p><br/><p>Level: 110</p><br/><p>HP: 1,100,000</p><br/><p>MP: 10,000</p><br/><p>Defense: 1,200</p><br/><p>Melee Attack: 8,094 - 9,094</p><br/><p>Skills:</p><br/><p>[Light of Life]: Recovers 10% health points. Consumes: 500 MP</p><br/><p>[Foul Chatters]: Begins to curse at a target, inflicting a large amount of aggro. Instant activation. Cool down: 5 seconds.</p><br/><p>Note: Calls himself the best tailor in the world.</p><br/><p>Zhang Yang could not help but laugh. So this was the person who had tricked the Duchess into walking naked in the public! So he said, \"You really have balls of steel! You even dare make fun of a Duchess!\"</p><br/><p>Messick laughed and said, \"I say you, my friend, can’t we get out of this dangerous place first, before we speak any further?\"</p><br/><p>‘Ding! Messick has given you a quest: Escape from Winst Castle. Will you accept it?’</p><br/><p>Obviously, to conquer the castle and make it his own Territory, Zhang Yang would have to overthrow Duchess Winst and take her place. This daring tailor must be her ‘worst enemy’ in this story. So, aiding him against the Duchess should lead him to a final battle with Duchess Winst!</p><br/><p>Zhang Yang gave it some thought and accepted the quest.</p><br/><p>[Escape from the Winst Castle] (Difficulty: C)</p><br/><p>Description: You chose to aid Messick. Messick is currently being pursued by Duchess Winst and her men. You have made yourself a public enemy of Duchess Winst and her men! Help Messick escape from Winst Castle, and do not let him die!</p><br/><p>Completion: Aid Messick in escape from the Winst Castle 0/1</p><br/><p>Fortunately for him, this quest did not have any penalties that could potentially reduce his levels. On the other side of things, there weren’t any rewards that would give Zhang Yang any luck attributes!</p><br/><p>Zhang Yang let our a breath of sigh and summoned out his Serpent. Meanwhile, Felice had transformed herself into her Dragon-hawk Form, ready to make an expeditious retreat. But before Zhang Yang could call out her name, Messick had already tried to climb up on her back! Felice was so furious that she had swiveled her head around and launched a {Fire Missile}.</p><br/><p>Messick was struck in the face, turning black like a big piece of charcoal. Zhang Yang could not help but to shake his head again and again. This ‘brother’ would still think of taking advantage of a lady at a time like this! Zhang Yang was at a loss for words, unable to find anything to say about this NPC.</p><br/><p>Without wasting any more time, Zhang Yang lashed out, aiming at Messick’s despicable buttocks, and with a powerful kick, he launched Messick onto the back of Serpent, jumped aboard and gave a command to take off. The Serpent immediately fluttered its wings and flew right into the sky. They flew right out of Winst Castle.</p><br/><p>However, their movement attracted 5 knights who were patrolling in the surrounding areas of Winst Castle! They immediately reacted and flew right towards Zhang Yang on their Snow Condors.</p><br/><p>The flying speed of the Serpent was indeed impressive! With just a few flaps of it’s wings, it had already brought Zhang Yang and Messick to the exterior of Winst Castle. There were only 5 knights on their tails. Zhang Yang quickly patted on the Serpent’s neck, controlling it to turn around. They headed straight to face the 5 knights.</p><br/><p>\"Hey, are you actually thinking of battling in the sky?\" Messick rubbed his forehead with his hand, looking very anxious, \"Please, put me down first before you do that! I have acrophobia! You know what that means? I’m terrified of heights! Argh!\"</p><br/><p>Zhang Yang had no time to ‘entertain’ Messick, as they were already on the verge of crashing into one of the knights! Right before they reached the knight, Zhang Yang gave a good swing at one of the Snow Condors with his [Sword of Purging Devourer].</p><br/><p>Felice had also joined the battle, as she could fly on her own. Immediately, she began to chant the spell for her {Fire Missile}!</p><br/><p>The battle has begun!</p><br/><p>\"Haha! How could you start the ‘party’ without me!\" Messick grumbled as he produced a piece of clothing from out of nowhere! In a flash he had jumped into the jumpsuit-like apparel, except that it was webbed between the arms and ribs. The fabric there was as thin as a cicada’s wings. When he opened up his hands, he looked like a bat!</p><br/><p>\"So, my friend! Just let the girl give me a sweet kiss later, and then I’ll take care of these 5 fools for you! Very well! That’s the deal!\" Messick was muttering more to himself than to anyone else. Before Zhang Yang could say a word, Messick had already jumped off the back of Serpent. Was he trying to get himself killed by falling? And didn’t he just say that he had a fear of heights?</p><br/><p>As he opened up his arms, he actually started gliding like a flying squirrel! More impressively, Messick could evidently steer himself into his desired direction! He glided through the air and flew towards a Snow Condor.</p><br/><p>Tsk! That is pretty impressive!</p><br/><p>Bang!</p><br/><p>Messick kept his ‘wings’ as he landed onto the Snow Condor. He raised up his fist and gave the knight on the Snow Condor a powerful punch that the knight would never forget!</p><br/><p>Although he did not seem to be very likable or reliable, for that matter, he was still an elite tiered NPC after all! His punch inflicted about 7,000 damage on the knight!</p><br/><p>After Zhang Yang turned around to take a look at him and saw how he was doing, he instantly felt relieved. Although the attacks of Messick were not particularly powerful, he did have the ability to regenerate his own health points. Against an equally powerful monster, he would naturally outlast them! Zhang Yang tried to hook the aggro of the other 4 monsters over to himself. Although the DPS of Felice was extremely high, but Zhang Yang had {Provoke}, so he still managed to reel in the aggro of the monsters.</p><br/><p>The Serpent helped whenever it could. Spits of greenish venom were splattered on the monsters, dealing a DPS of up to 4,500 points! After just a while, the first knight had fallen! The second knight followed, and the third, and moving on to the forth! After slaying all 4 knights, Zhang Yang and Felice quickly turned their attention towards the fifth knight that Messick was dealing with. It did not take them long before they too, slew that knight and brought the battle to an end.</p><br/><p>‘Ding! You have completed a quest: Escape from the Winst Castle! Acquired 500,000 experience points!’</p><br/><p>Zhang Yang commanded the Serpent to bring them down to the ground, and then he looked at Messick and said, \"Now, we should be able to have a proper conversation, right?\" It would be illogical if the quest ended here, there had to be more to it! There should be a chain of quests coming up!</p><br/><p>Messick suddenly turned serious, he stopped fidgeting as he looked at the direction of Winst Castle, \"I’m a person who loves traveling around the world. So, when I was 15, I left Winst Castle to pursue my dream, traveling all over the land and gathering more knowledge. Everything was great, until 3 years ago. I received news about my parents’ death! They were great tailors. But, just because they could not make a dress that would satisfy that f*cking b*tch, Winst, she sentenced them to their death and chopped their heads off in public!\"</p><br/><p>No wonder Messick had gone through all the trouble just to embarrass that Duchess Winst! There was such deep hatred involved!</p><br/><p>Messick laughed at himself and said, \"After I found out about my parents’ death, I actually came back and attempted to murder that b*tch to avenge my parents’ death! How ridiculous of me to actually think that I can do it! When I arrived back at the town, I realized that the b*tch has a massive army under her command, and she’s really powerful herself. I would have no chance at all!\"</p><br/><p>\"So, I came up with another plan. I got close to her and tried to persuade her that I’m the best tailor there is in the entire world! Slowly, I convinced her by making some nice dresses for her, until I began to gain her trust. That was when I knew it was about time. So, I decided to humiliate her instead of trying to murder her. I made up a lie about how I have made a fantastic dress that could differentiate between the wise and the stupid. I believe you heard and seen enough to understand whose stupidity it actually determined in the end! That stupid b*tch actually bought it, and she really ‘wore’ it in the streets! Haha! She really did embarrass herself to the core!\"</p><br/><p>He smiled even more ‘maliciously’ than Fatty Han and Endless Starlight.</p><br/><p>Zhang Yang shook his head again and again as he knew, this fellow must also be an ‘impressive’ pervert, himself!</p><br/><p>Messick paused his smile and said, \"So don’t laugh at me for not daring enough to fight that b*tch! I don't want to die for anything! Now that I’m still alive, my existence is the only ‘stain’ on her life! My friend, I’ll be traveling to other places once more, you should get moving, and get the hell out of here!\"</p><br/><p>Having finished retelling his backstory, Messick actually turned around and ran into the distance. In just a few seconds, he had already vanished from his sight! That fellow truly ran like a cockroach!</p><br/><p>Zhang Yang frowned, speechless at what that had just happened. So, this quest really ends here, after aiding that Messick in running away? That’s it?</p><br/><p>Just as Zhang Yang started to ponder on his next move, he saw Messick jumping right out of the bush! Zhang Yang could not help but laugh, \"What happened? Don’t tell me, you already started to miss me the moment we parted?!\"</p><br/><p>\"No, d*amnit! There’s a bunch of knights behind me!\" Messick screamed miserably as he fell to the ground right in front of Zhang Yang, with his bottom facing the sky. Zhang Yang saw that there was at least 7 to 8 arrows buried in his *ss! He could not help but to wonder if any of the arrows had actually ‘penetrated’ his anus!</p><br/><p>Right after witnessing Messick’s fall, a platoon of 12 flying knights appeared right before Zhang Yang. Each of them carried longbows, and they were all riding majestic looking Snow Condors.</p><br/><p>\"Brother! Please, help me!\" Messick reached out for Zhang Yang in desperation.</p><br/><p>\"Huh? Isn’t this the other guy that aided Messick in humiliating Duchess Winst? Kill him as well!\" one of the knights shouted, and the 12 of them began to load their arrows into their longbows. Then, they began to fire the arrows at Zhang Yang and Messick!</p><br/><p>What the f*ck!</p><br/><p>This bastard! So, he ran off after he said he would, and now he brought so many knights back to Zhang Yang! What a troublesome guy!</p><br/><p>Zhang Yang let out a battle cry and quickly jumped back onto the Serpent. Together, they charged at the enemies! Now that his life was at stake, Messick no longer performed any more unnecessary flourishes! He charged at one of the knights and began to launch his assaults.</p><br/><p>Messick had about 1,100,000 health points, and he also had the skill - {Light of Life} to regenerate his own health points! He also had the skill - {Foul Chatters} that was so piercing to the ears, that even Zhang Yang was close to being provoked, himself! He was basically a self-healing meat shield! On the other hand, there were only 12 elite tier monsters. Even if Zhang Yang did not dare lure all of them in at once, he could let Messick tank all of them as he focuses on one monster at a time. It would actually be more effective that way!</p><br/><p>\"Hey there! You bunch of stupid assh*les! I haven’t even impregnated your wives yet! Why are you going so far!\" Messick would try to provoke the monsters with his tongue as he fought. Every time he opened his mouth, a series of foul, provocative words flew right out from his mouth and enraged the knights. The knights were so enraged that they could not stop hitting him with everything they got! So, this skill - {Foul Chatters} was ridiculously effective! Zhang Yang had finally seen it with his own eyes!</p><br/><p>So Zhang Yang and Felice only focused on one monster at a time. With support from the Serpent, the three of them managed to bring down the health bar of their target down to 50%.</p><br/><p>\"Brother, my friend! I need help! Argh!\" Messick was being turned into a pincushion, as more arrows struck him, his eyes rolling upwards from the pain.</p><br/><p>Well, he did have {Light of Life} to regenerate his own health points, and the cooldown period of this skill was extremely short! Although he looked like he was in bad shape, but his health bar was still at around 50%! He was still far from death!</p><br/><p>Zhang Yang did not ‘entertain’ him, he simply continued to focus his assaults on his opponent until they were dead, before he activated his {Provoke} and brought the second monster over to him. After slaying the second, Zhang Yang moved on to the third knight, and then the forth... even though Messick looked all battered and bloody, but his health bar was ridiculously long, and he had the ability to regenerate his own health points. Messick was definitely an unkillable cockroach!</p><br/><p>However, Messick only had 10,000 MP. He could only activate his {Light of Life} 20 times, which was about twice the amount of his full health points! In other words, he is like having two HP bars which he can use as a back up when he is low on health! When Zhang Yang took down the seventh knight, Messick had finally ran out of MP, and was truly getting into trouble.</p><br/><p>For the remainder of the battle, Zhang Yang hooked in the rest of the monsters and tanked them himself. Felice and the Serpent threw in a deadly combination of flame and venom. After some slashing and bashing, burning and bombarding, Zhang Yang had finally taken out all 12 knights!</p><br/><p>\"Pui! That b*tch really is malicious! She actually sent a heavy platoon to guard the only passage out of Winst Castle! My friend, what say you, escort me out of this hell! I need you, my friend!\" Messick was plucking the arrows from his body as he pleaded for Zhang Yang to get him out of the area safely.</p><br/><p>Zhang Yang folded his arms across his chest and said, \"What’s in it for me? Nothing, right? Not interested!\"</p><br/><p>Messick was beginning to feel anxious, as he began to show his pitiful face at Zhang Yang. But Zhang Yang did not fall for it. Then, he finally broke and said, \"Alright! Fine! If you can escort me out of this place safely, I will tell you a secret! It would definitely make you rich! You’ll earn a fortune, that will last you for the rest of your life!\"</p><br/><p>Zhang Yang only looked at Messick without saying a word.</p><br/><p>\"... very well then, it is the treasure house of the Winst family! I know where it is, and I also happen to know how to activate it!\"</p><br/>\n</div>"}