{"title": "Chapter 477: The Return of the Whiner", "id": 477, "volume": 5, "url": "http://boxnovel.org/mmorpg-rebirth-of-the-legendary-guardian-chapter-477-the-return-of-the-whiner", "volume_title": "Volume 5", "body": "<h1>Chapter 477: The Return of the Whiner</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 477: The Return of the Whiner</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Zhang Yang went all out, trying his very best to capture the aggro of the boss.</p><br/><p>However, his DPS never even surpassed 4,000 damage. To get the boss’ attention from Felice, one would have to reach a DPS of 10,000 damage, at least! That wouldn’t be achieved so easily! After pushing himself, having gulped down a bottle of [Power Potion] and even activating his {Dance of the Heaven and Earth}, Zhang Yang finally succeeded at becoming the primary target of the boss.</p><br/><p>30 seconds after the battle raged on, Zhang Yang found himself close to death, having been tossed around relentlessly by the boss, without any moment of pause. He had no choice but to activate his {Berserker’s Heal}, and healed himself back up to full health again.</p><br/><p>Right after that, Shenro raised his staff and chanted a few spells in quick succession. Instantly, the air surrounding of Zhang Yang began to freeze, and a layer of frost began to form on the ground, followed by a second piece of frost rising up vertically to the left of Zhang Yang, and the third wall of frost forming on the right side! The frost walls slowly merged together as they tried to ‘imprison’ Zhang Yang.</p><br/><p>Well, obviously, that was the {Frost Coffin}! The boss was up to no good!</p><br/><p>Zhang Yang quickly turned around and ran like hell. Whitey turned tail and lumbered after him. Felice conveniently started flying away. Wings are always convenient. However, the effective area of the {Frost Coffin} was vast. It covered a 20 meters radius area across the ground! Even though there is a 3-second gap for the {Frost Coffin} to completely form, if a player did not react at the very moment when the boss begins to chant the spell for the skill, then the player will definitely be unable to get out of the effective area of the skill!</p><br/><p>3 seconds later, the {Frost Coffin} had completely formed. Instantly, the entire effective area was covered in frost! Zhang Yang could see and feel the chill through every single cell of his body! It was extremely cold!</p><br/><p>Without prolonging the battle, Zhang Yang charged back into the battle with his {Charge}. He raised his sword once more and began to inflict the boss with as much damage as possible.</p><br/><p>Shenro let out a thunderous roar and he struck Zhang Yang with another shot of his {Frost Arrow}.</p><br/><p>Zhang Yang was going all out. After he activated his {Shield Wall}, {Last Vigor}, and {Blood of Life}, he immediately activated his {Rearm} to reset the cooldown of all his skills! Right after that, he continued to bombard the boss with all his Skills again. Once they were in cool down again, he retreated to the narrow parts of the chamber. He went up to the path right outside the entrance, and used the corner of the entrance to remain out of the boss’ line of sight. By moving just that little bit at the right timing as the boss tried to angle his way about, he managed to prevent the boss from hitting him.</p><br/><p>Consuming [Bandages]!</p><br/><p>‘+4,000!’</p><br/><p>‘+4,000!’</p><br/><p>...</p><br/><p>Zhang Yang began to heal up repeatedly, as the green numerical values started appearing right on top of his head one after another.</p><br/><p>Shenro was halfway chanting his {Frost Arrow} when he was forced to stop his chanting, and had to shuffle his feet in order to get to Zhang Yang who was now healing himself uninterruptedly.</p><br/><p>Zhang Yang could only use his ‘First Aid Kit’ four times before the boss stood right before him! As Zhang Yang was using his fifth [Bandage], the boss was already right in front of him! Actually, Shenro could have interrupted Zhang Yang from using [Bandage] to heal for the fifth time, by throwing a normal punch at Zhang Yang. However, the first choice of attack for all Magic type bosses in this game would always be to chant a Magic type skill. So, when the boss was done chanting his skill for another {Frost Arrow}, Zhang Yang had already healed himself up by another 8,000 HP!</p><br/><p>Before the boss could let his arrow fly, Zhang Yang quickly stepped back into the secret chamber. The boss had to follow him, of course. That marked the beginning of the wild goose chase.</p><br/><p>\"You coward! Face me, and fight like a man!\" Shenro roared and hobbled after Zhang Yang, as they ran in and out of the entrance.</p><br/><p>In, and out, and in, and out...</p><br/><p>Like an idiot, the boss followed Zhang Yang about, unable to strike him.</p><br/><p>Although Zhang Yang was moving around a lot more now, his DPS never got any lower! He kept using his two powerful skills - {Horizontal Sweep} and {Destructive Smash} the moment the cooldown periods were over. He was so efficient, that not a single second was wasted! His constant movement was more to wait for their cooldown periods than to evade the boss!</p><br/><p>Whenever the {Berserker’s Heal} and {Shield Wall} were ready, Zhang Yang would stop running and step right up to fight the boss head-on. Whenever his health started getting too low, he would start running in and out of the entrance again. The boss was in a total mess as he as being herded around a like a cow!</p><br/><p>80%, 60%, 40%... the 5,750,000 HP of the boss was dropping rapidly!</p><br/><p>If Zhang Yang had an Inheritance above the Class of C at the moment, he would only have to activate his ‘Transformation,’ and then he would be good to tank up against a Violet-Platinum boss alone, without any problems at all! Without even talking about the power of a Class S Inheritance, even the Class B King Kong Inheritance that Zhang Yang once possessed in his previous life, could turn him into a King Kong, and gain an instant boost, giving him 300% Defense, 70% Magic Immunity, 20 times his Maximum Health Points, and 3 times his attack power! These transformation power ups were enough for Zhang Yang to completely overpower a Violet-Platinum boss!</p><br/><p>Inheritances were over-the-top!</p><br/><p>Unfortunately, searching for an Inheritance with a ‘Transformation Effect’ was difficult enough. It would only be more difficult getting a Class S Inheritance. As previously mentioned, in the near future, the power of guilds would directly correlate to the number of members who can transform. Even a low leveled guild, completely made up of 50 players who are capable of transforming would flood the earth with the blood of their enemies! Inheritances with ‘Transformation Effects’ would determine the strength of guilds in the future!</p><br/><p>So Zhang Yang is very determined to acquire the God of War Inheritance! All he can hope is that the Inheritance will ‘wait’ for him before anyone else claims it!</p><br/><p>Zhang Yang had been silently reminding himself to search for the [God of War Inheritance Fragments] right after he secures Winst Castle as his second Territory.</p><br/><p>Now that Zhang Yang has opened up the Chaos Realm, every server would enter the Chaos Realm from their own respective entrances. Judging from the current situation, these ‘special’ Territory points would be as easy to acquire as Morning Town. As for other Territories that were spread across the Chaos Realm, they would require tougher quests. Well, the game developers had been considerate when they were designing this part of the game. They did not intend to have players waste half a day every time they had to travel around the Chaos Realm. With eight Territories acting as starting points for the players from all eight different servers across the world, the players had to travel a great distance to meet up at the center point!</p><br/><p>So, one month would be enough for Zhang Yang to conquer all eight Territories from all eight servers! However, if he really did that, he would be declaring war on the other seven servers. All other seven servers would definitely join forces to take down the China server!</p><br/><p>Never, ever unite your enemies to a single cause! So, Zhang Yang would only be taking the Gateway Territory belonging to the Japan-Korea server.</p><br/><p>Five minutes later, Shenron finally admitted his defeat as he let out a miserable scream and fell beneath the [Sword of Purging Devourer]. As a parting ‘gift’, it had left Zhang Yang with a substantial amount of experience points.</p><br/><p>The loot dropped by Shenron were considered average. There was only 1 Yellow-Gold equipment and 3 Gray-Silver equipment, which could still be sold for gold coins. So, Zhang Yang swept them into his inventory. Unfortunately, the boss did not drop any [Inheritance Fragments], slightly disappointing Zhang Yang.</p><br/><p>The guardian no longer being in the way, Zhang Yang moved on to claim his treasure!</p><br/><p>After looking around in the secret chamber, Zhang Yang realized that none of them were actually valuable! Even though the secret chamber was littered with treasure chests, it was all junk?! How ridiculous! All he found were some [Pearls] and [Jewelries]! Each of these [Pearls] and [Jewelries] could only get him some silver coins if he sold them in the market! The only thing that mattered in this game would be gold coins, and these [Pearl] and [Jewelry] would have to be sold to NPC businessmen in order to turn them into something worthwhile. Zhang Yang resignedly accepted what he could get, for these [Pearls] and [Jewelries] could at least earn him some money.</p><br/><p>After searching around for 5 to 6 minutes, Zhang Yang only found more [Pearls] and [Jewelries] in all of the chests. But one particular chest was locked.</p><br/><p>It would seem that the ‘real’ treasure was here, buried within this dark-red chest!</p><br/><p>Zhang Yang drew his [Sword of Purging Devourer] and swung it at the chest. All he heard was a ‘Chiang!’, and sparks were seen as the sword edge clashed into the lock of the chest. There was not even a scratch on the lock of the chest!</p><br/><p>Chiang! Chiang! Chiang!</p><br/><p>Zhang Yang could not believe it with his own eyes. Even after dozens of strikes with his powerful sword, the chest remained intact.</p><br/><p>So this is it? Dead end?</p><br/><p>Zhang Yang frowned. Just as he was to retrace his steps, hoping to find something that he might have missed out, he heard the sound of footsteps approaching him. Thud, thud, thud! The footsteps indicated that someone was approaching him in a hurry. He quickly turned his head around and saw Duchess Winst in a gorgeous aristocratic dress standing right at the entrance of the Treasure Chamber.</p><br/><p>Zhang Yang almost failed to recognize her, after she had put on a dress! The difference was really astounding!</p><br/><p>Standing right before Zhang Yang, this blonde woman did look very noble and refined, calm and poised, even though she wasn’t exactly resting. She looked totally different from the Duchess that Zhang Yang had seen naked in the street. The neckline plunged down and her two boobies were half-exposed in the air. Pressed against each other, a very deep, defined cleavage was formed in between the two large boobies, and she looked marvelously seductive.</p><br/><p>\"You daredevil! How dare you trespass my Treasure Chamber! Death is your only way out!\" the Duchess raised her staff up and pointed it at Zhang Yang with an intimidating aura. Her boobies jiggled with that sudden movement.</p><br/><p>Zhang Yang frowned again, for a different reason this time. Is the boss here to battle him, or is she here to seduce him? She was not making any sense at all!</p><br/><p>He laughed out loud and said, \"My dear Duchess, why aren’t you wearing that ‘Fantastic’ dress today?\"</p><br/><p>Winst was instantly enraged! The staff in her hand suddenly glowed with a golden light, followed by a stream of lightning bolts striking down on Zhang Yang! All at once, Zhang Yang was inflicted with a damage of 10,000 points.</p><br/><p>Zhang Yang frowned, sensing trouble in the coming fight. The {Radiant Punishment} of the boss had not required any chanting time! He would not be able to fight her like he did against Shenro! So, no more playing with angles and obstacles! It would be suicidal, moving around, trying to kite her as he waits for the cooldown of his skills!</p><br/><p>This Duchess has extremely powerful attacks, and she could also activate her {Magic Barrier}. Fortunately for Zhang Yang, the amount of damage that the {Magic Barrier} could absorb would depend on the number of players around the boss! However, it would still be a serious problem if she is able to activate this skill frequently enough.</p><br/><p>Well, Guardians are naturally at a disadvantage when they ever encounter a Magic type boss. So Zhang Yang could not even think of any possible way that he can win this battle!</p><br/><p>Should he activate his {Shadow of the Void}, and make his escape, first? He could wait for Han Ying Xue and his gang to reach Level 100 first before they come back together and slay this b*tch. However, it had its risks too! A large number of players from all eight different servers across the world would have already entered the Chaos-Realm by that time! What if the Japan-Korea server ever forms an ‘international alliance’ with other servers? Things would escalate, and get messier if he ever waits that long!</p><br/><p>No matter the cost, Zhang Yang decided to take down this b*tch and take over the Gateway Territory for the Japan-Korea region before that happens! He planned to make the players from the Japan-Korea region look bad again.</p><br/><p>\"Hey, my man! I’ve thought it through, and I have decided to come back and make another scene!\" Just as Zhang Yang was about to make a tactical retreat, the voice of a macho man was heard from the same direction of the Duchess. A man with a handsome, yet wretched face appeared right behind the boss.</p><br/><p>It was Messick! The whiner!</p><br/><p>Zhang Yang laughed out loud, Messick has {Foul Chatters}, which can hook over the aggro of the boss! It could not be helped, he was born with those perfect, Aryan looks that were asking for a punch to dislodge the perfect symmetry. He also has {Life of Light} to recover his own HP. So, he would definitely be the most suitable tank against this boss!</p><br/><p>Messick had an MP bar that was long enough for him to activate {Life of Light} for 20 times, which would recover a total amount of 2,200,000 HP. Furthermore, he has a total of 1,100,000 HP. So, he basically has a total of 3,300,000 HP before he dies! If the boss wanted to kill him first, it would require about six to seven minutes!</p><br/><p>Zhang Yang himself would be able to tank against her for two to three minutes long. If the boss really cannot be killed within that time, then Zhang Yang would have to admit defeat.</p><br/><p>Shoof!</p><br/><p>With a {Charge} Zhang Yang triggered the boss battle. Currently, the cooldown for all his ‘healing’ skills was over. So, he should be able to tank against the boss for a good while. When he no longer can tank, he would activate his {Shadow of the Void} to disengage from battle, leaving Messick to be the main tanker of this battle. By the time Messick falls, the cooldown periods for his {Berserker’s Heal} and {Shield Wall} should all be over by then.</p><br/><p>Pak! Pak! Pak!</p><br/><p>Streams of lightning fell upon Zhang Yang, one after another, inflicting him with a damage of 10,000 points, repeatedly. Meanwhile, Felice and Whitey were also attacking the boss with all their might, showing that they were not just a bunch of Looney Toons1 cheering for him with some useless fireworks. On the other hand, Messick’s mouth was really full of foul words! He pratted on at the Duchess, saying that her boobies were mismatched and oddly shaped, and that her butt was shapeless. Zhang Yang also heard something along the lines of her thighs being as large as elephant’s legs, and something that had to do with her farting like a skunk! The Duchess was so greatly provoked that she started smoking up in anger!</p><br/><p>In the list of the boss’s aggro, the aggro for Messick was increasing, extremely rapidly. In just a few seconds, it had already exceeded Felice’s! So it would only be a matter of time before Messick would capture the aggro of the boss over from Zhang Yang, and become the main tanker in the battle!</p><br/><p>Well, it was impossible to understate, or downplay the power of {Foul Chatters}. Zhang Yang could not help but think that only Messick has the power to sway bosses over to him by the word of mouth! The one and only!</p><br/><p>TL Notes:</p><br/><p>1. Looney Toons: a bunch of people that only jokes around and do nothing contributing.</p><br/>\n</div>"}