{"title": "Chapter 489: Starting the Inheritance Quest", "id": 489, "volume": 5, "url": "http://boxnovel.org/mmorpg-rebirth-of-the-legendary-guardian-chapter-489-starting-the-inheritance-quest", "volume_title": "Volume 5", "body": "<h1>Chapter 489: Starting the Inheritance Quest</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 489: Starting the Inheritance Quest</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>How did that dwarf get in?</p><br/><p>Zhang Yang moved like a shadow and quietly hid behind a coffin closest to the dwarf. He peered out and saw that he was unpacking many large bottles, mixing them up together. There was cloud of colored gas floating up and around him. After mixing a couple more liquids, he raised a bottle of what seemed to be a completed potion and spoke to himself happily. \"I did it! I will be the first to find the ancient treasure! I will be the one to write this historical event down in the books! I will be the greatest explorer there is! I will be the richest there is!\"</p><br/><p>Gululu then poured the liquid onto a solid block on the floor, melting it away. The rock was pitch-black and looked extremely tough, but when Gululu poured the liquid over it, it turned into a sand and was blown away. Gululu then brushed the now softened rock away and unearthed a black colored box.</p><br/><p>The box was not big. It measured only 20cm wide, 10cm long, and 10cm tall. It looked plain, and was not even locked.</p><br/><p>\"Ah! My precious!\" cried Gululu happily. He then opened the box’s lid and tossed it aside. There was a large, 17 to 18 cm long metal pole. The metal pole was extremely tattered, and both ends appeared to have been broken off something larger. It seemed to be the broken-off handle of an axe, or a hammer. </p><br/><p>It had to be the Fragment of the God of War Inheritance!</p><br/><p>Just when the dwarf NPC reached out to touch it, Zhang Yang reached out as well and tapped Gululu’s shoulder.</p><br/><p>\"WOAH!\"</p><br/><p>The dwarf jumped in surprise and leaped up 2 meters high in the air. Zhang Yang was greatly impressed at his sudden burst of strength and grinned. Gululu, on the other hand, turned to Zhang Yang in shock and asked, \"Why are you here?\"</p><br/><p>Zhang Yang smiled silently, his hand shot out to grab the metal pole in the box.</p><br/><p>\"Argh! It’s mine! My precious!\" cried Gululu in a fit of anger. He then took out a large battle hammer and swung it at Zhang Yang’s head.</p><br/><p>Zhang Yang raised his shield effortlessly and deflected the hammer, knocking it completely off-course. Zhang Yang snickered and said, \"Dwarf, that thing belongs to no one! Finder’s keepers, loser’s weepers!\"</p><br/><p>\"Bastard! I found it! It belongs to me! I have been searching for more than 10 years! I shall have your head!\" cried Gululu angrily.</p><br/><p>Zhang Yang finally understood how things were. The NPC was the \"guide\" for the God of War Inheritance quest. As long as player waited in the cave long enough, the NPC would appear! As long as the player takes note of such small, slinky actions, they would find the Fragment of the God of War Inheritance. That, or they would not be able to find such a small, unassuming object in such a large field.</p><br/><p>It was kind of sad for the dwarf. If the Fragment is taken away from the NPC, it would be forever gone, since the quest is Unique, and could never be repeated again.</p><br/><p>Felice morphed into her human form and thrust her spear at Gululu. \"Little Dwarf! How disrespectful you are to big brother!\"</p><br/><p>Gululu was terrified of Felice. Back then, the fair maiden had launched a {Fire Missile} and burned half of this brown beard away. Dwarves treated their beards as prized possessions, and would never shave them off. Gululu remembered her fire attack very well and cowed away.</p><br/><p>Zhang Yang took the chance and took hold of the metal pole as Gululu scrambled from Felice.</p><br/><p>[God of War Inheritance Fragment (1)] (Inheritance Class: S)</p><br/><p>Description: Gather all God of War Inheritance Fragments to form a complete God of War Keepsake. You can start the Inheritance quest after obtaining the Keepsake. You will acquire the Inheritance God of War after completing a series of quests. You will gain a boost to your class skills and also the God of War Inheritance skill. All Fragments of the God of War Inheritance will resonate with each other. If you are killed by a player who possesses a piece of the same Fragment, the Fragment in your inventory will be dropped upon your death. All Inheritance Fragments can only be stored in your inventory.</p><br/><p>Special Restriction: God of War Inheritance can only be acquired by Warrior classes.</p><br/><p>Got it!</p><br/><p>Now that he thought about it, the first piece of the Inheritance Fragment had been rather easy to obtain, since all he did was running and searching. That was only due to Zhang Yang’s past experience. If he had not been reborn with his memories intact, it would have been impossible for him to obtain the piece! In fact, that knowledge was not enough, even if players, other than Zhang Yang had managed to get into the cave, they would need to have the luck of spotting Gululu!</p><br/><p>Luck! Luck is required to obtain most of the Inheritances! Naturally, some players were lacking in the financial aspect. Some of them would be willing to sell the piece of Inheritance that they had, and sell it off to the highest bidder. Even it is an extremely rare piece, money comes first for these folk. As the game progressed, higher leveled Inheritances played an important role in taking the top. The inheritance that could induce a transformation, even more so! If players had chosen to sell an Inheritance Fragment that was capable of transforming a player, it would be a mistake that would haunt them for the rest of their lives!</p><br/><p>Once a player activates the Inheritance transformation, they could easily raid a Hard mode dungeon alone, or perhaps even a Hardcore mode as well! During PvP battles, unless players had transformation skills of their own, they should simply throw in the towel when facing one such player.</p><br/><p>Now that Zhang Yang had easily swiped away the hard-earned treasure that Gululu had found, the poor dwarf stomped on the ground angrily like a child. The dwarf was so enraged that he even ignored Felice and charged towards Zhang Yang to fight him head on. The little dwarf swung his hammer rapidly at Zhang Yang.</p><br/><p>Zhang Yang only laughed and held his arm out, holding the short dwarf back by his head. No matter how fast or strong the dwarf was, it meant nothing if he could not even touch Zhang Yang! Still, Gululu was a green name tag entity, killing him would not do any good to Zhang Yang.</p><br/><p>\"Bastard! I’ll bash yer head in!\" cried Gululu as he withdrew a few steps away. Gululu then took aim and came at Zhang Yang with a jump attack. However, Zhang Yang was much quicker, and he easily avoided the jump attack simply by taking a few steps back. Gululu’s attack landed on a coffin instead and knocked the entire thing down.</p><br/><p>Wham!</p><br/><p>The lid of the coffin cracked open and the body inside rolled out.</p><br/><p>\"Who dares disturb the dead!\" a low voice echoed through the entire cave. What followed next were massive skeleton hands bursting out from inside the other coffins, each of them spawning an Orc Spectres!</p><br/><p>F*ck me, that’s more than a thousand elite Spectre monsters! What a cunning NPC! </p><br/><p>\"Felice!\" Zhang Yang called out to her and Felice nodded her head. Zhang Yang then unsummoned her and immediately activated {Burrow} to escape via the underground pathway. Poor Gululu had his plan backfire on him, as he had become the one and only target for the spectres to attack. It would not be a good end for him…</p><br/><p>Zhang Yang then used a [Teleportation Scroll] to return to Morning town. Now that he had the first and vital piece of the Inheritance Fragment, the next steps would be to hunt for the remaining 9 Fragments. Zhang Yang wanted to complete the Inheritance before more players from the Japan-Korea region enters the Chaos Realm. By then, he could transform and kill all the players himself! How awesome would that be! Haha!</p><br/><p>Zhang Yang smirked. Now that he had the first piece, the nine others should be easier to hunt. Zhang Yang mounted on Whitey Jr. and flew, map after map. As long as there is a piece of the God of War Inheritance Fragment available in the map Zhang Yang arrives in, the system would automatically notify Zhang Yang about it. Most of the Inheritance Fragments should be included in a quest. They could be hidden in plain sight, or stashed in the most obscure of places. When Zhang Yang holds the first piece of the God of War Inheritance Fragment near another Fragment, both Fragments would glow and produce a bright light, which would show the position of the Fragment.</p><br/><p>The Fragment pieces are not dropped by monsters in the first place. They were merely hidden away in random places that had many monsters guarding them. Before actually hunting them, Zhang Yang would have to kill his way around to make sure that the place was safe. The God of War Inheritance Fragments were all over the place, they were deep in a valley, sometimes buried deep in a snow pile, buried on the side of a steep cliff, buried deep in the desert, and the last piece was in a pot, deep in the ocean! There was even a Level 135 Mythical tier shark boss guarding it!</p><br/><p>Zhang Yang got Felice to lure the boss away, and he rode the Mythical Turtle to swim towards the pot to get the Inheritance Fragment. The pot was buried in the seabed, and it took quite some time to retrieve the last piece of the Inheritance Fragment!</p><br/><p>Zhang Yang unsummoned both the Mythical Turtle and Felice, before leaving the battlefield with {Shadow of the Void}. Zhang Yang arrived at a safe location and quickly teleported to Morning town.</p><br/><p>His hands trembling with excitement, Zhang Yang assembled all the Fragment pieces together with extreme care. As the last piece fell in place, a bright radiant glow burst out, and all of the fragment pieces fused together, as if they were being welded together. The fragment pieces formed a long battle axe, shining with an intense radiance.</p><br/><p>Zhang Yang picked up the hammer and found that it was unexpectedly easy to lift. Zhang Yang took the axe up and carefully examined the axe. All of the fragments had magically welded together. The surface of the axe was so smooth, and there were no traces of any cracks!</p><br/><p>[God of War Inheritance Keepsake] (Quest Item)</p><br/><p>Use: Initiates the God of War Inheritance quest.</p><br/><p>Class Requirement: Warrior</p><br/><p>Level Requirement: 100</p><br/><p>Without hesitating, Zhang Yang initiated the quest. The axe glowed brightly, and the light entered his body as it surrounded him like an ethereal spirit.</p><br/><p>‘Ding! You have initiated the God of War Inheritance. This is a series of quests. When you have completed all the quests, you will obtain the God of War Inheritance!’</p><br/><p>‘Ding! You have accepted a quest: The Search for Meka!’</p><br/><p>[The Search for Meka] (Difficulty Level: D)</p><br/><p>Description: After gruesome hours of searching, you have collected all 10 pieces of the Inheritance Fragments and formed an ancient axe. Based on your inexperienced knowledge of history, you have failed to determine the origin of the axe. However, you have heard of an old warrior named Meka. With the man’s vast experience with weapons, he might be able to tell you something. Meka is currently residing at the Shuhada Lake of the Dayu Rainforest. What are you waiting for! Get to it, quickly!</p><br/><p>Completion: Find Meka and ask him of the axe’s origin 0/1</p><br/><p>More running around again…</p><br/><p>Zhang Yang sighed heavily. However, it was a good thing, as he was the first player in the entire world to start an Inheritance quest. Perhaps, if word gets out that he is to first to obtain an Inheritance, people will start going crazy! Nobody but Zhang Yang was in the Chaos Realm, and nobody else had ever laid eyes upon an Inheritance Fragment. For him to acquire a complete set of an S-tiered Inheritance would be too much for them. Zhang Yang should be looking out for flying slippers coming his way.</p><br/><p>Zhang Yang summoned Whitey Jr. and shot to the sky towards the Dayu Rainforest. The poor flying serpent was pushed to the limits as Zhang Yang flew nonstop for several hours. When Zhang Yang reached the Dayu Rainforest, he stopped for a while, allowing the serpent to have its rest as he determined the direction to Shuhada Lake. The Dayu Rainforest was like the Amazon rainforest, where trees grew to the scrape the skies. Zhang Yang flew over the forest and saw nothing but vast greenery. Luckily, the lake was huge and easy to spot from the sky. Since Zhang Yang had some recollections of the place from his past life, he had only taken another 10 minutes prior to the previous rest and arrived at his destination, the Shuhada Lake.</p><br/><p>Zhang Yang had determined the exact location via the minimap and landed next the blue lake. The flying serpent was so exhausted that it lay flat on the ground and refused to move. Even when Felice tried to growl at it, the flying serpent did not budge.</p><br/><p>Since Flying Mounts were more suitable for long distance travel, Zhang Yang unsummoned the flying serpent and summoned the bear for a change. He rode the bear around the lake and begun his search for the NPC called Meka.</p><br/>\n</div>"}