{"title": "Chapter 490: Meka", "id": 490, "volume": 5, "url": "http://boxnovel.org/mmorpg-rebirth-of-the-legendary-guardian-chapter-490-meka", "volume_title": "Volume 5", "body": "<h1>Chapter 490: Meka</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 490: Meka</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Meka was not difficult to spot. In no time at all, Zhang Yang had already found a small hut by the lake. There was a vegetation farm next to the hut. A middle-aged man was in the midst of it, watering the plants. The man was sloppily dressed in tattered cloth linen clothes. Everything from his movements, to his appearance, had no indication of his colorful past. Still, there was one thing about his appearance. Zhang Yang could see that, beneath the ragged clothes, the man had a muscular body. He had a pretty good looking face too. Zhang Yang believed that if he were to change into something a little more luxurious, he would easily be one of those noble elitists. Even right then, there was a sense of maturity, especially the light in his eyes. He had some mysterious charm that would entice even the loveliest of maidens! </p><br/><p>He was definitely a man of tales.</p><br/><p>[Meka] (Elite, Humanoid)</p><br/><p>Level: 120</p><br/><p>HP: 1,200,000</p><br/><p>Defense: 1,300</p><br/><p>Melee Attack: ???</p><br/><p>Skills: ???</p><br/><p>Note: Once a world-renowned warrior, until he took an arrow to the knee. Literally.</p><br/><p>The NPC was out of the norm. He was only Level 120, and Zhang Yang was able to see his HP and Defense value, but not his Attack nor Skills! Zhang Yang had never done the God of War Inheritance before, thus he had never seen this NPC before in his life. Zhang Yang got down the bear and walked towards the garden’s edge and spoke politely. \"Excuse me, sir. Are you Meka the Warrior?\"</p><br/><p>\"Mm. Warrior?\" Meka muttered, his eyes glinted with a burning passion which died down almost immediately. He then shook his head and said, \"I am indeed the person you seek for. But, I’m no warrior. I’m just a hermit now. Farming is all I do. I’m no longer fit to be a warrior! Young man, how may I help you?\"</p><br/><p>\"Sir, there’s this—\" Just as Zhang Yang started to speak, there was a loud commotion from inside the forest behind the hut. A group of 12 female soldiers marched out and surrounded Meka around the garden.</p><br/><p>The female soldiers were all equipped with metal cuirasses that were designed to be 18-SX! The armor was more for censorship purposes than actual protection! Even so, the low-cut design of the metal made them look more like metal corsets. The upper portions of their bodies were completely exposed, leaving more than half of their breasts exhibited to the world to see. Their lower halves were protected only by thin sheets of metal skirts. Perhaps, they were trying to mimic Wonder Woman’s costume, except that this was far more erotic and outrageous. One kick, and they would show the world their huuhaa!</p><br/><p>Metal may not come cheap, but isn’t there a better way of saving costs!?</p><br/><p>[Snowflake Castle Guards] (Normal, Humanoid)</p><br/><p>Level: 17,800</p><br/><p>Defense: 100</p><br/><p>Skills:</p><br/><p>[Entice]: Entices a target, rendering it unable to engage in any actions or movement for the next 3 seconds. Instant. Range: 10 meters</p><br/><p>Note: Snowflake Castle’s loyal soldiers. Answers only to the Lady Countess Kate Jingle.</p><br/><p>\"Meka--!\" cried the leader of the group, as she stood up front and approached the middle-aged man. \"Lady Countess Kate Jingle has requested you for an audience in the castle. We are here to escort you back!\"</p><br/><p>Ayy! Ever heard of queuing up?</p><br/><p>Zhang Yang bit his lip angrily. He was there first and was already engaged in a conversation with him! Don’t think that a public service officer could barge in anywhere they want! It’s an abuse of power!</p><br/><p>Meka shook his head. He continued gardening and averted his gaze away from the female soldiers. \"I do not wish to see her. Please leave. You’re disturbing me.\"</p><br/><p>\"Insolent! Lady Kate has already thrice invited you! It would be going against the high court for rejecting such an invitation. Today, the invitation has been turned into an order. If you refuse to have the audience of Lady Kate, her orders demand us to bring you to her by force, dead or alive!\"</p><br/><p>The female soldier pulled out her spear and let out a spirited ‘hah!’. The other 11 soldiers who were surrounding the garden followed her actions and quickly got into their battle stance. With a unified movement, the female soldiers approached Meka and trampled over his neatly planted garden.</p><br/><p>Zhang Yang sighed heavily, followed by a disgruntled grumble. They could have chosen a better timing to talk to Meka, but no! They had to barged in just when Zhang Yang was about ask Meka about the Inheritance Keepsake! Obviously, this was part of the quest’s script. The system had made it so that a player will never have a smooth-sailing quest. Now that the situation has developed to this extent, Zhang Yang completely forewent reasoning. He slid across the ground with {Charge} and crashed into the leader of the group. He intended to get them out of the way and proceed with the quest.</p><br/><p>Felice morphed into her Dragonhawk form and blasted the group with {Pulverizing Flame}, dealing 3,000 fire damage every second! Zhang Yang adjusted his position during the commotion and activated {Blast Wave}. His attack had struck all 12 soldiers and had stunned them for 4 seconds, providing enough time for Felice’s {Pulverizing Flame} to tick by at least 4 times to deal a total of 12,000 damage!</p><br/><p>When the stun effect ended, Zhang Yang had regained enough Rage, Rage that he used to cast {Horizontal Sweep}. The powerful slash had dealt more than 8,000 damage to everyone. With less than 6,000 HP left, all 12 female soldiers were defeated at the same time. However, they were not instantly killed. They fled with only 1 HP remaining. Perhaps, the system had turned them unkillable?</p><br/><p>\"Wretched fool! You dare to attack the guards of Lady Kate? You shall be obliterated! Thousands shall hunt you down till the end of time!\" cried the leader of the soldier group as they fled.</p><br/><p>Felice was not satisfied. She soared into the sky and shot down towards their direction. However, after 10 seconds or so, she flew back with a solemn face. \"They had something magical; some sort of barrier was protecting them! I cannot deal any damage…\" Felice looked so cute, trying her best to serve Zhang Yang. He then patted her head gently.</p><br/><p>With the god-mode granted by the system, there was no way for them to be killed. Obviously, they would be an enemy that Zhang Yang would have to deal with later in the quest progresses.</p><br/><p>\"Young man, I see that the spirit of youth is brimming in your soul!\" said Meka, though it did not sound like a compliment, especially when the short skirmish had not affected his mood. He readjusted the crops that had been destroyed and continued to water the plants on the far side of the garden.</p><br/><p>Zhang Yang sighed and followed him closely and took out the ancient axe. \"Mr. Meka. I have spent days and nights searching for this Keepsake and had ventured around the world to ask of its origin. No one could tell me anything about it! However, I heard about a man. A man who had experienced countless wars and battles, who could possibly explain the origin of this Keepsake. Perhaps, it could be you?\"</p><br/><p>Make did not raised his head. Instead, he continued to water the crops around him. He only shifted his glare from the corner of his eyes and was shocked immediately. He dropped the watering can in his hand and exclaimed out loud. \"The Fallen Axe of the God of War!\"</p><br/><p>Zhang Yang put up a faked surprise reaction and gasped. \"Mr! You do know about this axe!\"</p><br/><p>Meka realized that he had given his interest away, and was too late to not get involved about it. Reluctantly, he nodded. There were still traces of surprise in his eyes.</p><br/><p>\"Mr. Please tell me about the axe!\" said Zhang Yang eagerly.</p><br/><p>Meka frowned and contemplated for a while. \"The axe’s origin is something that everyone has agreed not to speak of, for it has unimaginable power! I cannot simply indulge you in its secret for naught! Perhaps, you can do something for me and I’ll tell you about the axe’s great secret after you have fulfilled my requests. </p><br/><p>There is no free lunch in the world; everything comes with a price! Even something as trivial as information!</p><br/><p>Zhang Yang nodded his head and asked. \"I’m honored. If you have any last wishes, I’ll be more than happy to grant them for you.\"</p><br/><p>Meka turned solemn with a slight trace of anger. \"Young man. I do not have any last wishes. I’m not going to die just yet.\"</p><br/><p>Zhang Yang laughed awkwardly and said, \"Wrong choice of words…Sorry!\"</p><br/><p>Meka turned his gaze to somewhere far away and with a thousand-yard stare, he spoke. \"I was once a brave warrior. There was nothing that I could not kill. I have slain dragons, monsters, castle lords, demons, and many other entities that posed a threat to the human world. Every single day, there would be countless noblewomen who come asking to be my lover. Sigh…what a drag…I almost lost count of every single woman that I had shared a bed with, but it had to be more than 20,000!\"</p><br/><p>Zhang Yang felt a cold shiver down his spine. Even if he was born as a studhorse stallion, doing it just once a day would already be 365 times a year. 20,000 \"shots\" would take roughly 54 years to fire. Just how much \"ammo\" does he have!? Or rather, how big was his balls!</p><br/><p>Meka expressed a nostalgic emotion. \"I had an arch enemy. He hated me, but he could never win a fair fight against me. Hence, he sent a woman to approach me. She made a fool out of me! Back then, I was rather famous for doing it a lot. Whenever someone comes to me asking for it, I would never reject it. However, the sly b*tch made me impotent!\"</p><br/><p>The middle aged man slammed both his fists against each other and said, \"She planted a poison in my body, making me losing my manhood! I’ll be d*mned for my own actions. My strength, my prowess, all originates from my manhood! Ever since I lost my ability to pleasing a woman, I was no longer the same man.\"</p><br/><p>Zhang Yang stared in disbelieve. This famous man, a man who had won countless wars, remained undefeated, was that all because he had an insatiable lust?! Did he have a massive raging boner as he killed and slew his enemies?! What sort of raging pervert would do such a thing!</p><br/><p>Zhang Yang tightened his face as hard as he could, to resist the urge to laugh like the little brat usually did.</p><br/><p>\"After I had lost my powers, I had to move out of my hometown. To avoid becoming the laughing stock, I’ve chosen to live the hermit’s life.\" Meka continued, after sighing.</p><br/><p>\"However,…the shadow always exists wherever the suns shines. No matter where I go, trouble will always find its way to me. Just as I had settled here, the Lady Countess Kate Jingle had already taken a liking to me and had decided to invite me to her castle! Naturally, I had to reject her. If I was still as capable as before, I would never reject such an invitation! I would have already **** and **** her brains out!\"</p><br/><p>Zhang Yang felt a cold shiver down his spine. Awkwardly, Zhang Yang diverted the topic back. \"Sir. What is it that you would have me do?\"</p><br/><p>Meka looked at Zhang Yang with excitement in his eyes and said, \"I have been a recluse for a while, but I have done some research. I’ve found the means and methods of removing the poison from my body! Young man, I’ve now lost all my battle power, and I am not able to engage in any battles. That is why I am asking you to collect a few materials for me! When the deed is done, and my manhood is restored, I shall tell you the tale of the Fallen Axe of the God of War.\"</p><br/><p>‘Ding! Meka has a quest for you: Materials to Treat an old Wound. Will you accept it?’</p><br/><p>Accept.</p><br/><p>[Materials to Treat an old Wound] (Difficulty Level: A)</p><br/><p>Description: Meka had requested you to search for ingredients to heal his old wound that had robbed him of his manhood. The materials are as follows: Rhino’s Horn (The thicker, the better. You may find a large number of Rhinos in the Iron Bull Valley in the west). Wolfberry Flower Stem (The longer, the better. You may find Wolfberry Flowers in the Poison Shroud Swarm to the North). The Tiger Penis of Tiger King Anusuba (The Biggest d*ck should belong to the Tiger King Anusuba. You may find Anusuba at the Blood Mist Camp located in the East).</p><br/><p>Completion: Rhino’s Horn 0/200 Wolfberry Flower Stem 0/50 The Tiger Penis of Tiger King Anusuba 0/1</p><br/><p>Thicker…Longer….D*mn, this old man, the desire to restore his manhood is strong!</p><br/><p>Zhang Yang nodded his head at the man and said, \"Sir. Wait for my good news. I shall return, soon enough! Felice, off we go!\"</p><br/><p>Zhang Yang hopped on the flying serpent and soared to the west. After a short flight, Zhang Yang came down to the Iron Bull Valley. There were many types of species of the bull, such as the bulls, cows, wildebeest, and also the largest among them, the rhinos. Many of them were merely normal tier. Unfortunately, Zhang Yang’s hunting targets were the elite tiered White Back Rhinos!</p><br/><p>[White Back Rhino] (Elite, Beast)</p><br/><p>Level: 130</p><br/><p>HP: 1,300,000</p><br/><p>Defense: 1,400</p><br/><p>Melee Attack: 9,110 – 11,110</p><br/><p>Skills:</p><br/><p>[Stomps of War]: Shakes the earth, deals 5,000 Natural damage to all targets within 3 meters. Causes knockback - 10 meters away from the caster and slows down the target’s movement speed by 50%. Lasts for 10 seconds.</p><br/><p>[Charge]: Charges to the target. Stuns the target for 5 seconds. Range: 3 – 10 meters.</p><br/><p>[Horn Attack]: Attacks the target with a sharp horn. Deals 100% melee physical attack. Has a small chance of dealing 3 times the normal attack.</p><br/><p>Note: The strongest entity in the Iron Bull Valley. Occasionally consumes meat to sharpen its teeth.</p><br/><p>\"Let’s whack’em Felice!\" cried Zhang Yang, as he dove down from the sky. When he was 10 meters away from the rhino, he jumped down from Whitey Jr. and charged at the rhino that was 3 meters tall and 8 meters long.</p><br/><p>Needless to say, having a battle mount grants two major advantages. The first being the life sharing passive skill that increases the maximum HP. The second, having an increase in movement speed. For Zhang Yang, since he had the skill {Beast Taming}, he could dismount anytime he wanted to and get on the mount again whenever his HP is getting low. Since Zhang Yang was a melee attack class, he had no need to move around, especially since the opponent is a monster. They would not move around like a player would, but instead, they would blindly attack the players head on. Hence, movement speed was not all too important for Zhang Yang. However, during mounting, many skills would be rendered unusable. After all, being mounted did restrict a great deal of the rider’s movements.</p><br/><p>Zhang Yang swung his sword and dealt 3,420 damage. Zhang Yang first landed {Cripple Defense} since he had not yet fully mastered {Eagle Eye}. Landing a full charge of {Cripple Defense} would be the highest priority, especially to those with high Defense.</p><br/><p>Compared to Zhang Yang, Felice was much stronger. Her {Fire Missile} had easily dealt more than 20,000 damage to the rhino, turning it into a towering, black figure of soot!</p><br/><p>\"Gauun!\" The best awoke from being stunned and growled to the high heavens. Its stomped the ground angrily and charged towards Zhang Yang with its horn faced down.</p><br/><p>{Block}!</p><br/><p>‘-981!’ {Block} reflected damage.</p><br/><p>‘-4,974!’ {Shield Bash}!</p><br/><p>After two attacks, the rhino’s aggro was locked onto Zhang Yang. Ignoring the airborne Felice, the rhino was determined to gore Zhang Yang.</p><br/><p>Wham!</p><br/><p>The rhino stomped the ground with such force that it had sent out a white, electrical current that spread all around. Zhang Yang felt a slight tingle, with a damage text popping up on his character. He was immediately pushed back to 10 meters away and felt that his feet were quadruple their normal weight. As the ground was flashing with electrical current, Zhang Yang’s movement speed had greatly suffered.</p><br/><p>{Stomp of War}!</p><br/><p>Fortunately, the skill would only affect targets that are on the ground. Both Felice and the flying serpent were completely unaffected by the attack and was attacking without stopping. Fire missiles and poisons spits were constantly splashing on the rhino’s massive body.</p><br/><p>Shush!</p><br/><p>The rhino kicked its hind legs out and took off like a jet, ramming against Zhang Yang with its sharp horn, stunning him for 5 seconds.</p><br/><p>{Warrior’s Will}!</p><br/><p>Zhang Yang retaliated immediately by smashing a guaranteed critical hit of {Destructive Smash}!</p><br/><p>‘-17,802!’</p><br/><p>The rhino took a sudden burst of damage and was enraged. Its entire character glowed with a red hue and it charged towards Zhang Yang again. This time, the attack that was dealt to him was massive.</p><br/><p>‘-20,537!’</p><br/><p>{Horn Attack} 300% damage!</p><br/><p>What a strong burst of damage! The attack could even instantly kill a Gray-Silver tiered tanker!</p><br/>\n</div>"}