{"title": "Chapter 499: Glare of the Death God", "id": 499, "volume": 5, "url": "http://boxnovel.org/mmorpg-rebirth-of-the-legendary-guardian-chapter-499-glare-of-the-death-god", "volume_title": "Volume 5", "body": "<h1>Chapter 499: Glare of the Death God</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 499: Glare of the Death God</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Is this mighty and powerful Ethereal Tier boss about to be slain Battle Companion who was 50 Levels underneath it?</p><br/><p>Zhang Yang could not help but to feel giddy and lightheaded! But after seeing the HP bar of the boss dropping lower than 20%, he was very certain that it was not his eyes playing tricks on him, everything that was happening was the real deal!</p><br/><p>Zhang Yang did not act like a clueless animal, nor did he become hot-headed and charged right towards the boss --- although he actually thought of doing it initially, that was just his emotions taking over for a second, because he could not watch Felice charging up to a powerful boss, getting herself killed!</p><br/><p>In the game, it would not matter how powerful the mounts or the Battle Companions are, once the player who owns them dies, the mount and the Battle Companion would disappear as well. So, the best way for Zhang Yang to help Felice is to find a suitable spot and make sure that he survives!</p><br/><p>Although the Black Dragon Anubask appeared helpless against the assaults of Felice as it could only damage Felice by up to 600 to 700 damage every time it struck her, that was only because Felice had already activated her {Absolute Defense}. The basic attacks of the boss is actually reaching up to 60,000 or 70,000 damage!</p><br/><p>Furthermore, open world bosses also have powerful AoE attacks! Hence, if Zhang Yang had charged up to the boss, that would get himself killed for nothing, instead of helping her!</p><br/><p>Felice struck harder and harder as the battle went one. It was like she had really held a grudge against the black dragon for thousands of years! Every single attack from her lance took away millions of HP. She looked cold, as if she had turned into another person. She was silent and calm, steely and focused, as she bombarded the boss with her assaults. That was no longer the naive and cute little lady that Zhang Yang knew.</p><br/><p>The roars of the Black Dragon Anubask were so loud that it shook the sky, and the clouds dispersed into the surroundings of the sky! However, it could not do anything against Felice! Its HP bar was still decreasing rapidly from 80,000,000 to 50,000,000! Then, it dropped further down to 20,000,000 within seconds!</p><br/><p>Little Felice was truly soloing the boss, as if she was an equal boss!</p><br/><p>\"I give up! I’m willing to serve you! Please, don’t kill me!\" well, those who can live long normally would definitely be afraid of death. Anubask no longer had the pride of a dragon, as it began to lower down its head and tried to express his allegiance to Felice.</p><br/><p>If little Felice actually accepts the black dragon’s allegiance and allows it to serve her, then would the boss become her mount by the end of it? Zhang Yang could not keep his imagination from running wild. Furthermore, this mount would be a legendary dragon that had actually served Hell’s Lord back in time! If there were seals on the dragon to be unsealed, then, wouldn’t this boss become a Celestial Tier mount by then?</p><br/><p>However, Felice was not moved by its offers by one bit as she continued to wreak havoc upon the boss with her lance, as hard as she could. Her assaults became even more aggressive than before! The tip of her lance was ignited with blazing flames as she swung her lance towards the boss. The scenery was like doomsday pouring down from the sky, as flames flowed down from the heavens and scorched everything on the ground! If there are any life forms in the vicinity, they would definitely have been killed by the merciless bombardments from Felice as well!</p><br/><p>Sigh. So much for getting a Celestial Tier mount. Zhang Yang could not help but to sigh resignedly.</p><br/><p>10,000,000 HP left!</p><br/><p>4,000,000 HP left!</p><br/><p>\"Rawgh!\" Anubask continued to roar in misery as it began to unfurl its wings, getting ready to flee into the skies. But it was interrupted by a throw of Felice’s lance, that went straight through its body! That hit took out the last chunk of HP bar of the boss! There it goes! The great Black Dragon Anubask had fallen! Its massive body crashed heavily into the small peak of a mountain close by. Its body was so huge and heavy that it had crushed the small mountain in half! A substantial amount of blood was gushing out from the wounds and cuts on the body of the black dragon, flooding the entire mountain with red!</p><br/><p>Felice let out a roar that shook the surroundings. Green veins started flowing across Felice's head, spilling down her face like a waterfall, as she was pushed back in the direction she had been facing, like the recoil of a gun. Her voice broke through the air and crushed the part of the mountain that was within the range of 10 kilometers in front of her!</p><br/><p>It was terrifying!</p><br/><p>After she was done with the long roar, Felice suddenly closed her eyes and fell straight from the sky, crashing into the ground.</p><br/><p>Zhang Yang quickly unsummoned Felice back into the Battle Companion slot in his inventory with his mind. Then, he stared into the Battle Companion slot in his inventory and saw Felice lying quietly as she hibernated. Her face was extremely pale as if she had strained herself too much. She was comatose.</p><br/><p>Zhang Yang tried to summon her, but he received a system notification immediately. Felice was currently hibernating, so he would have to wait for another 72 hours before he can summon her out again.</p><br/><p>Well, Zhang Yang had two questions that needed immediate answering when he gets back to that old, deceased God of War, Ares. Firstly, he wanted to know if Felice is really the daughter of the Goddess of War, and secondly, did the black dragon ever slay the Goddess of War. Well, if that’s true, then that hatred Felice had for the black dragon really did push her to the point that she had a Cosmic Explosion and totally tortured an Ethereal Tier boss!</p><br/><p>Just as he was having these thoughts to himself, Zhang Yang suddenly realized that he had not received any experience points or rewards after the black dragon had been slain! Furthermore, the system also did not notify him with any sort of message about him acquiring the First Clear for an open world Ethereal Tier boss!</p><br/><p>Are you kidding me? So, after all the terrible things that Felice went through killing the boss, everything was for nothing? Nothing at all?</p><br/><p>Zhang Yang quickly patted Whitey Jr. and went around the dead body of the boss. If he really can’t get anything from this, he is really going to cry out loud, for god’s sake!</p><br/><p>The dead body of the dragon was massive. One lap around the dead body of the dragon was about 1 kilometer far already! Furthermore, Zhang Yang could not walk too fast as he needed to carefully scan the area for any sign of loot. Fortunately for him, Zhang Yang managed to find a few items right below the belly of the dragon.</p><br/><p>Looking closer at them, there was a [Skill Book] with a green hard cover, a heart that was the size of a fist, and last but not least, a ‘blood ball’ that is also the size of a fist, Zhang Yang could clearly see the blood within the ‘ball’ flowing about. </p><br/><p>Without thinking much about it, Zhang Yang immediately took the ‘blood ball’ into his hands.</p><br/><p>[Black Dragon’s Blood] (Quest Item)</p><br/><p>Description: The fine blood that is collected directly from the [Black Dragon’s Heart]. Although the amount is not that great, it contains the full power of the black dragon when it was still alive. It’s concentrated! It is the true essence of the dragon’s blood!</p><br/><p>Phew! After all that, the quest had finally been completed! Compared to getting the [God of War Inheritance], Zhang Yang did not even care about the absence of equipment in the drops. At his current strength, he could just go ahead and farm for good equipment when he has time to spare.</p><br/><p>The next item was the heart.</p><br/><p>[Black Dragon’s Heart] (Quest Item)</p><br/><p>Description: The heart of the Black Dragon Anubask. It has incredible power. However, only the highest Tiered Spellcaster is eligible to use it.</p><br/><p>Zhang Yang could not help but burst into joy. Well, it was like hitting a double jackpot in one go! Now that he already got the [Black Dragon’s Blood] and the [Black Dragon’s Heart], he only needed to look for the [Book of the Damned] in order to complete that Main Story Quest that he had accepted when he was still Level 10!</p><br/><p>Zhang Yang then reached over for the last item, the [Skill Book]. Although this Ethereal Tier boss will just be another cheap plucking when it is thrown to a higher level map, it was still the indisputable overlord of this map. Therefore, the loot it drops would definitely be great!</p><br/><p>In the game, bosses would only drop extremely rare items during the first few kills by the players. The loot did not include equipment but only [Skill Books], [Aura Books], and [Forbidden Scrolls]. Equipment would become obsolete as time passes, but skills wouldn’t! Skills would only get stronger as players do.</p><br/><p>When normal bosses are slain for the first few times, the level and equipment Tier of the players should be around the same level as the bosses. Some of them might even be a little lower than the level of the bosses. Therefore, the system would reward the players with great items and equipment whenever they manage to slay the bosses. However, if the players come back and slay lower leveled boss after reaching a much higher level and getting more powerful equipment, then the system would recognize it as an act of oppressing the bosses instead of challenging the bosses. So, naturally, the loots dropped from the dead bosses would be much ‘worse’.</p><br/><p>Therefore, the bosses slain would only drop super rare equipment and items in the ‘First Clear’ and ‘Second Clear’ rounds. The purpose of setting the game to work like this is to reward players who would actually stand up among the crowd and challenge the difficulty of the dungeons. When players already have the power to oppressively take down the bosses, those bosses would be raped over a thousand times. So it is natural that they would no longer drop good equipment and items.</p><br/><p>This is also considered as a ‘First Clear,’ as Felice was the first one who actually took down this boss. So, this [Skill Book] definitely has a powerful skill written in it, in order to be worthy of Felice’s effort! Because other than the two quest items, only this [Skill Book] dropped from the boss.</p><br/><p>[Skill Book: Glare of the Death God]</p><br/><p>Use: Teaches you the {Glare of the Death God}</p><br/><p>Required Class: No restriction</p><br/><p>Required Level: 100</p><br/><p>Note: A skill that the Hell’s Lord passed down to the Black Dragon Anubask himself! This Skill is tremendously powerful.</p><br/><p>A Hell’s Lord’s Skill!</p><br/><p>Zhang Yang could feel a shiver down his spine. He quickly tapped the book against his chest and learned the Skill without saying another word.</p><br/><p>[Glare of the Death God]: Stares at a target with the Glare of the Death God, inflicting damage to the target for 10 seconds. There is a 10% rate of triggering Instant-Death on the target. This skill will have certain rate of failing when it is applied on Boss monsters. The Instant-Death effect will be replaced by another effect, whereby there is a 10% rate that the target will lose 1% HP, which can only happens 10 times in a row, at most. The lasting effect will be reduced to 5 seconds when this happens. The effect can be canceled out, but the level of the player that breaks the effect must be higher than the level of the caster. Cooldown: 60 minutes.</p><br/><p>This Skill is indeed worthy to be a Hell’s Lord’s Skill! It is awesome!</p><br/><p>Although 10% rate is not high, it was still a negative effect. So once it is placed onto a monster, every other hit would have 10% chance of triggering the effect! It would definitely be very practical to put the negative effect of this Skill onto a player! With this negative effect randomly triggered, the targeted player will be left with only 1 point of HP left!</p><br/><p>Unless the player has godly reflexes or can immediately activate skills that can make him invincible over a short period of time, or a healing skill that can instantly heal him up, the player would be killed in a single hit!</p><br/><p>Although the effects of the {Glare of the Death God} could be canceled out, the level of the player who breaks the effect must be higher than the level of the caster! That’s hilarious, who can actually catch up with Zhang Yang’s level now?</p><br/><p>Zhang Yang could only laugh. With this Skill, he will not falter when going up against powerful bosses!</p><br/><p>After picking up everything, the dead body of the black dragon disappeared. Zhang Yang could not help but feel a little greedy this time. It would have been so much better if only the boss drops a few more [Skill Books] or a few pieces of equipment...</p><br/><p>Zhang Yang rode on Whitey Jr. and traveled back all the way to Camarro Islands. When they had finally arrived back at the entrance of the cave, this poor Serpent was so tired that it spat out white foam of bubbles by the end of its mouth. Zhang Yang walked right into the cave where the giant skeleton of Ares lay.</p><br/><p>The moment when he took out the ‘blood ball’, the Inheritance Keepsake for the [God of War Inheritance], the axe that Zhang Yang brought to Ares, immediately floated up into the air. Suddenly, it flew straight towards the ‘blood ball’ and cleaved into it! The [Black Dragon’s Blood] started pouring out, however, not a single drop was wasted. Every single drop of the blood was absorbed by that axe.</p><br/><p>\"Ah ---\" a groan of relief was heard across Zhang Yang’s ears, Ares stretched his skeletal arms as he got back his feet, \"Mortal, you took way too long with that, I am very disappointed with you! However, seeing that the amount of [Black Dragon’s Blood] that you brought back can at least prolong my life for another 3 years, and that you actually managed to slay that huge, disgusting lizard, I shall grant you another chance!\"</p><br/><p>What the hell? Zhang Yang had never stopped or taken any detours after he accepted the quest! He went straight to the objective of the quest, and Felice went all out and basically instant killed the boss! After that, he had wasted no time at all and had headed back here straight away! So what the f*ck was that all about when Ares said he was still too slow?</p><br/><p>It seems that this f*cking God of War would still say the same words even if Zhang Yang could instantly teleport there, instantly kill the boss, and instantly teleport back here!</p><br/><p>‘Ding! You have completed a quest: The True Ordeal, acquired 20,000,000 Experience Points! Duration: 12 Hours 34 Minutes 29 Seconds. Rating: Perfect. Reward: Shortening on the Linking Quest.’</p><br/><p>What a substantial amount of Experience Points! That’s actually awesome! What that sweetened the value of the reward even more was the shortening on the Linking Quest! During Zhang Yang’s previous encounter with the King Kong boss in his previous life, he had lost count on the number of times he had been running around, literary, just to complete some simple quests for the Linking, and had wasted so much time before he could actually confront the boss for real! And the main task to end the Linking Quest was actually slaying the King Kong boss!</p><br/><p>If he could really cut short the chain of quests, that would definitely be a great help to him!</p><br/><p>Ares paced on it’s skeletal feet, back and forth in the cave for a couple of times before he started talking, \"Very well. Go on and slay another 3 monsters that disgust me, and then you shall be able to inherit my godly power! Sigh. I had never realized that the heavens and the earth are so wonderful when I still possessed immortality. Now that my end is nearing every single day, living is truly a happiness that everyone should cherish!\"</p><br/><p>‘Ding! Ares has given you a quest: The Last Hurdle. Will you accept it?\"</p><br/><p>Well, this is already the last ‘hurdle,’ as stated in the name of the quest, only an idiot would decline the quest offer!</p><br/><p>Zhang Yang quickly selected ‘Accept’ and brought up the quest list to take a closer look.</p><br/><p>[The Last Hurdle] (Difficulty: A-rank)</p><br/><p>Description: Ares wants you to slay 3 fellows that he hates, deeply. Then, you shall acquire the Final [God of War Inheritance]! However, warrior, you must be aware. These 3 fellows must be slain by you and your hands alone only. So no matter whether it’s your alliance friends or your enemies, as long as they enter the aggro list of the monsters listed, then they will not be your kill anymore.</p><br/><p>The first boss is the Aegolous the Gargoyle King. This boss is the claw for the God of Darkness! Slay him! Aegolous is currently located at the Ancient Stone Peak in the land of Grandu Ice Ridge.</p><br/><p>The second boss is the Nine Head Hydra Geopolo. This boss is the follower of the Death God! Slay him too! Geopolo is currently located at the Valley of Serpents in the land of Siccory Mountains.</p><br/><p>The third boss is the Fire Element King Laguana. This boss is the servant of the God of Fire! Slay him as well! Geopolo is currently located at the Valley of Myriad Snakes in the land of Siccory Mountains.</p><br/><p>Completion: Slay Aegolous the Gargoyle King 0/1, Slay Nine Head Hydra Geopolo 0/1, Slay Fire Element King Laguana 0/1.</p><br/><p>Slaying bosses all by himself? Zhang Yang let out a long breath. Fortunately, he now has the {Glare of the Death God}. He also had support from Felice and his mount. The chance to slay a powerful boss, all by his own, is definitely looking much better than before. Furthermore, the difficulty of this quest is just A-rank. Those bosses should all be Yellow-Gold Tier.</p><br/><p>Now that Felice has crossed his mind, Zhang Yang quickly asked, \"My respected God of War, do you know the Goddess of War personally?\"</p><br/><p>\"Of course, the Goddess of War is the prettiest woman in the God Realm. Everyone knows her! Sigh. Unfortunately, she also fell during the great war among the gods. She was caught in the crossfire between the Hell’s Lord, the God of Vengeance, and the Devastator!\" Ares was feeling angry and sorry for the Goddess of War at the same time.</p><br/><p>\"Then, did the Goddess of War ever had a daughter?\"</p><br/><p>\"Haha! The Goddess of War had never fallen in love with any of the gods in our realm, so it is impossible that she would have any daughters!\"</p><br/><p>\"Huh?\"</p><br/><p>\"However, she did have a sister, the Goddess of Hope, Fraybe!\" Ares was staring at Zhang Yang through the two holes of his eye sockets on his skull and said, \"Warrior, enough with the talk, and get on with the quest!\"</p><br/><p>Right after that, the skeleton walked up to the corner of the cave again and went back to sleep!</p><br/><p>Although Zhang Yang wanted to inquire further details about Fraybe and Lachesis, since Ares was no longer responsive to him anymore, then, it should mean that Ares would not wake up until he completes the quest.</p><br/><p>So Zhang Yang took out a [Teleportation Scroll] and tore it off. In just an instant, he was teleported over to Morning Town.</p><br/><p>Zhang Yang had chosen the Grandu Ice Ridge as his first destination because he had already built the Teleportation Circles in Morning Town and Winst Castle. Since he could travel over within 10 seconds, obviously, he would choose that destination as his first choice.</p><br/>\n</div>"}