{"title": "Chapter 503: Nine Head Hydra Geopolo", "id": 503, "volume": 6, "url": "http://boxnovel.org/mmorpg-rebirth-of-the-legendary-guardian-chapter-503-nine-head-hydra-geopolo", "volume_title": "Volume 6", "body": "<h1>Chapter 503: Nine Head Hydra Geopolo</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 503: Nine Head Hydra Geopolo</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Zhang Yang caught up to Han Ying Xue and forced her to summon the huge pervert, Messick.</p><br/><p>The moment the despicable Battle Companion appeared, the perverted young man cried his eyes out and said to Han Ying Xue, \"Oh! My mistress! Please punish me! Punish me with your loving whip~!\"</p><br/><p>\"…\"</p><br/><p>Zhang Yang had the man unequip his weapon. The man was using a Violet-Platinum tier spear. Even though the level of the weapon was lower than the [Crimson Blazing Sword], it also had the power to level up along with Messick. When the big pervert turned Level 120, the spear will also be upgraded to a Level 120 Violet-Platinum spear.</p><br/><p>However, only the level would change, not the weapon tier. The tier would always, and forever will be a Violet-Platinum tier. To have something even better, they would have to earn a better weapon, just like players do.</p><br/><p>After all, Felice was not only Battle Companion around!</p><br/><p>Han Ying Xue unsummoned the pervert. Messick was behaving just like Fatty Han and Endless Starlight. Everything that comes out of his mouth would either be perverted, sickening, or depraved. Zhang Yang could never had handle such a person.</p><br/><p>Zhang Yang first went to White Jade Castle to repair all his equipment, restock the Little Merchandise Shop with a bunch of equipment, herbs, and other etc item that he had accumulated so far. Later on, he came back to Morning Town and flew on Whitey Jr. to the Siccory Mountains to search the second boss, Nine Head Hydra Geopolo.</p><br/><p>The poor flying serpent was pushed to its limit again when Zhang Yang arrived at the Siccory Mountains. Later on, he went west and arrived in the Valley of Serpents. The place was naturally filled with many reptiles, mainly snakes. Be it on the tree, in the cracks of the mountain, buried in the earth, or even the river, there were many types of snakes coming in the form of all lengths and colors. Most of all, they were elite tiered, ranging from level 110 to Level 119.</p><br/><p>If they had been normal tiered monsters, Zhang Yang could have kited them all and kill them with the One Straight Flush technique. Both he and Felice were killing machines. Dealing with a bunch of normal tier monsters would be a walk in the park. However, the elite tiered monsters had skills such as the spitting of venomous saliva that would deal natural damage. One or two would not matter, but if that number reaches a certain number, not even Zhang Yang would be able to tank it all. Still, doing it alone would take too long. Hence, Zhang Yang summoned Han Ying Xue and Wei Yan Er to help him. At least, having the both of them around would lighten the atmosphere.</p><br/><p>The little brat’s Winged Tiger had already reached Level 100. No longer the small and innocent little cub, it had grown into a large, 7 to 8 meters long Giant Tiger. The tiger looked rather cool and flashy whenever it spread out its dragon-like wings. Aesthetics aside, the priority would always be the properties. The Winged Tiger was the same tier as Zhang Yang’s Mythical Turtle. Be it attack or HP, both battle mounts were extremely strong.</p><br/><p>Han Ying Xue had not yet gotten herself a flying mount, even though she had the Yellow-Gold Crimson Crab that could be used on land and in water. The three of them rode their mounts into the field, along with Felice and Messick as their Battle Companions, forming a decent-sized party.</p><br/><p>Most of the snakes and serpents in the valley were capable of flight. They would occasionally fly into the air. Hence, the party did not venture into the airspace to prevent themselves from drawing too much attention. The elite monsters were many, and if they were to draw attention from both land and air, they would be attacked from all directions and things would be rather troublesome or worse, fatal.</p><br/><p>The party progressed steadily on. The perverted Messick could not even take few steps without harassing the girls around. He would either hit on Han Ying Xue, or Wei Yan Er, and even Felice! He had the most depraved pickup lines and compliments, ever! Though Felice would not hesitate to stab him with her spear, the perverted Messick would never quit. Still, as a Battle Companion, he was rather strong, even for a Violet-Platinum tier.</p><br/><p>Nevertheless, compared to Felice, he was nothing but a small fry. When the little girl turned into a Dragonhawk, her {Fire Missile} 20,000 damage would match or even surpass Wei Yan Er’s damage output.</p><br/><p>\"Woah! Little Felice! You’re so strong!\" cried Wei Yan Er, her eyes lighting up in admiration.</p><br/><p>Zhang Yang laughed and patted the little girl’s head, \"Little brat, Felice is much older than you are now. You must call her ‘big sis’!\"</p><br/><p>The little girl cocked her head, confused. However, she soon stared down at her own chest and sulked at a corner when she noticed Felice’s matured breast was much bigger than hers.</p><br/><p>Even though the monsters around here had more than 1,000,000 HP, the party easily managed it with no problem. Each monster around would take the party only half a minute or so to kill, which would provide a luxurious amount of experience points.</p><br/><p>\"Huhu! What a nice place for grinding levels!\" cried Wei Yan Er excitedly.</p><br/><p>\"But of course! The monsters here are all elite tiers! One elite monster would already be worth 50 to 60 normal tier monsters!\" said Han Ying Xue as a matter-of-factly.</p><br/><p>In the party, Zhang Yang and Messick acted as tanks. The dirty talking aside, his skill - {Foul Chatters} was rather efficient at provoking monsters. It might even take effect on regular players!</p><br/><p>As the name implied, the Valley of Serpents lived up to its name by housing an endless number of serpents. The party dived into the mindless slaughter for more than 7 or 8 days (of in-game time) and finally reached the deepest portion of the valley. There, minding its own business, was the boss.</p><br/><p>[Nine Head Hydra Geopolo] (Violet-Platinum, Beast)</p><br/><p>Level: 125</p><br/><p>HP: 12,500,000</p><br/><p>Defense: 3,300</p><br/><p>Melee Attack: 17,310 – 19,310</p><br/><p>Magic Attack: 9,869 – 11,869</p><br/><p>Skills:</p><br/><p>[Poison Spit]: Releases a venomous liquid that deals 150% magic Natural damage. Corrupts the target’s armor and decreases Defense value by 50%. Lasts for 20 seconds. Effects cannot be stacked. If the main aggro target is located out of Geopolo’s melee range, the person within the melee range on the second aggro rank will receive the attack.</p><br/><p>[Death Ray]: Geopolo fires a laser beam from its eyes. Deals half of the target’s HP as damage. Petrifies the target for 5 seconds. A Petrified player cannot engage in any action or movement.</p><br/><p>[Tackle]: Hurls its head around and deals 100% melee physical attack to all targets within melee range.</p><br/><p>Note: Servant of the Death God. Possesses part of the Death God’s power. After the demise of the God of Death, the Nine Head Hydra refused to return to the Nether Realm and chose to remain in the human world. Believing that the God of Death would return, the Nine Head Hydra had made countless offspring in hopes of creating an army for the God of Death!</p><br/><p>The name of the boss was rather straightforward. The boss had nine heads, each one about the size of Grinding Plate1. Each head had large horns and fangs, which was terrifying to look at. The beast had a huge body where the heads stuck out from. Somehow, the bodily proportions were that of a peacock. The main body had four limbs, and the heads that stuck out were like the tail feathers of a peacock! In stark contrast to the majestic bird, this hydra was hideous to look at.</p><br/><p>Zhang Yang and the party first cleared all the monsters around the boss, before approaching it. Han Ying Xue and Wei Yan Er then moved away from the battle, since the quest had requested that Zhang Yang be the only player to engage the boss. If anyone else enters the battle, the quest would fail automatically! Han Ying Xue and Wei Yan Er were not even able to help, and to remove all unnecessary risks, they could not even get close to it!</p><br/><p>Hence, Zhang Yang only got Han Ying Xue to buff him with the skill {Rise Anew} and asked the two of them to get as far away as possible to prevent them from accidentally getting caught in the battle. Even though the quest had not mentioned anything about permanent failures, a Violet-Platinum boss would take as long as a month to respawn. In real time, that would be close to 10 days! He could not afford to waste that much time!</p><br/><p>After analyzing the skills of the boss, the biggest threat would be the {Death Ray}. Zhang Yang could take the other skills on, but he would have to dodge this skill at all costs. Aside from that, the boss should not be a huge problem. As for the {Poison Spit}, it was sure to have a low rate of occurrence during a melee fight. Even though it carried was capable of {Cripple Defense}, Zhang Yang had three separate damage reduction systems, that would be his raw Defense, the Damage Reduction passive in terms of percentages, and lastly, the Damage Absorption from his armor. All in all, reducing his Defense value alone would not cause too much trouble for Zhang Yang.</p><br/><p>Zhang Yang steeled his mind and rode on Whitey Jr., charging towards the boss. </p><br/><p>As expected of the Flying Mount, the boss was only two flaps away from the Flying Serpent’s wing. Zhang Yang first struck the boss with a {Spear of Obliteration,} and the flying serpent spat a volley of poisonous saliva. Neither attacks required any slowing down or deviation of flight.</p><br/><p>\"Hss!\" the Nine Head Hydra hissed angrily as Zhang Yang. All nine heads, 18 eyes shot up to the sky and glared at Zhang Yang. One of its heads lashed out at Zhang Yang, while one more suddenly opened its mouth and spoke in a grainy voice. \"Mortal! Leave me be, or die with regret!\"</p><br/><p>Zhang Yang laughed and bellowed back, \"Back at you, wretched snake! I’ll regret leaving you be if you’re not yet dead!\"</p><br/><p>\"Insolent fool!\" Another head rose up and struck Zhang Yang bodily. Zhang Yang blocked the first attack, but did not manage to evade the second head. The other head wrapped itself tightly around him, immobilizing him. \"Such a waste! You shall be my meal then! It has been a long time since I last tasted human meat! Such nostalgia!\"</p><br/><p>Even though the boss had nine heads, all the heads shared the same attack interval. This meant that it could only attack with one head at a time. With {Rise Anew} on him, Zhang Yang had nothing to fear and could bravely attack the boss.</p><br/><p>\"Mortal! You’re nothing but a speck of dust in the eyes of the gods! Stop your futile resistance and surrender to the loving embrace of death!\" cried out the nine headed Hydra, its voice shaking the air.</p><br/><p>Zhang Yang flew to the head that spoke the most and bashed it with his shield. \"Enough with your arrogant talk! You’re no god. You’re but a poor underling left behind by its master!\"</p><br/><p>\"Silence fool! You know nothing! Your impudence shall not go unpunished!\" cried the Hydra. Right then, all nine heads, 18 eyes fixed its gaze on Zhang Yang and released black beams of darkness.</p><br/><p>{Death Glare}!</p><br/><p>Zhang Yang immediately jumped down from Whitey Jr. Even though Zhang Yang had given the name Junior to the flying serpent, it was not small! On the contrary, the size of the flying serpent was so huge that it would never evade the beam in time.</p><br/><p>The beam shot through the air, distorting the space and time around it. The poor Whitey Jr. took the beams directly and was turned into a large stone snake, its HP decreasing down to 50%. Luckily, the deducted HP was only 50% and not 100%. Hence, after taking so many beam attacks, the flying serpent’s HP finally stopped at 1% and could not be lowered any longer. No matter how many more beams were fired from the Hydra, the snake would not go down!</p><br/><p>The game does not take into account decimal values, 1% could never be divided into 0.5%!</p><br/><p>Translator Note:</p><br/><p>Grinding Plate was something that was used to grind tea into fine powders. It could also be used to make soy milk from soybeans.</p><br/>\n</div>"}