{"title": "Chapter 509: Class Balancing", "id": 509, "volume": 6, "url": "http://boxnovel.org/mmorpg-rebirth-of-the-legendary-guardian-chapter-509-class-balancing", "volume_title": "Volume 6", "body": "<h1>Chapter 509: Class Balancing</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 509: Class Balancing</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Now that they have already reached this bridge, why not cross it? Perhaps, two little Zhang Yangs were already forming in each of their wombs.</p><br/><p>Before allowing the women to leave the room, Zhang Yang held the door shut and got into a heated argument with the both of them. His authoritative aura was finally of some use. Eventually, both of them agreed to take a step back and acknowledge that each other would be with Zhang Yang from now on. However, there was one problem that he simply couldn’t address, both of them wanted his hand in marriages, and the other woman to be the side-chick.</p><br/><p>In truth, no normal woman would be willing to accept such an arrangement. However, both Han Ying Xue and Sun Xin Yu were not exactly normal women. Both of them have had rather unorthodox upbringings. Hence, they had broader mindsets. Han Ying Xue had been brought up in a family of riches, and in her circle of society, having a lover or two was not out of the norm, especially for those with a mountain of fortune. On the other hand, despite being an officer of the law, Sun Xin Yu was born into a family of politicians, such a situation was normal for her as well.</p><br/><p>Hence, with their own backgrounds, they would not need to worry much about seeking safe havens with Zhang Yang. Yet, they were still at each other's throats. They had known each other for more than a year now. Be it hostility or enmity, they have grown to know each other pretty well. As much as they hated it, they grudgingly agreed to share their lover.</p><br/><p>Zhang Yang could only nod in silence. He patted his crotch and sigh heavily. In the near future, he would have to rely on the magnum to pacify the women. After a few sessions of pacification, he might be able to soften their feelings for each other and perhaps attain peace.</p><br/><p>Sun Xin Yu was a tough girl. She had been through numerous years of vigorous training in order to become an officer. When she said that she could take it, she meant every word of it. Biting down the pain of losing her first night, she quickly got up and drove to work. On the other end, Han Ying Xue was a princess, a little twitch or two would have made her scream with pain and agony. Even going to the loo was enough to make her scream for Zhang Yang.</p><br/><p>Now that Sun Xin Yu had left, Zhang Yang’s car was just right for four. After they had their breakfast at the fancy hotel, Zhang Yang drove them all back to their villa.</p><br/><p>For once in her lifetime, Han Ying Xue was finally thanking Zhang Yang. Her original sweet and glamorous complexion was made even prominent after the night. Both Wei Yan Er and Daffodil Daydream were so envious that they had to ask what kind of cosmetic products she was using to make herself so beautiful. They’ve no experience in any of the big bam boom, hence they would have never known that it was Zhang Yang who had spent a whole night grinding and drilling her up! (1)</p><br/><p>Back at home, everyone got comfortable and logged into the game.</p><br/><p>When Zhang Yang went online, he was in the cave of Ares. He quickly opened up the patch notes and found out that the update was not exactly what he remembered it to be. Unexpectedly, it was a major nerf fest for all class.</p><br/><p>{Berserker’s Heal}, and {Sacred Heal} had been removed. In fact, the only job capable of healing HP was Priest and Sacred Knight. That or a class Inheritance, Warrior of Light. Luckily, the Lifestealing effects of Rune Stones had not been removed. Passive abilities like Zhang Yang’s Titan Chest Plate that added a healing effect to his {Shield Wall} remained.</p><br/><p>In other news, the healing capabilities of all healers had been nerfed greatly. Before the update, it would have taken only one healer to fully support on tank player. After the update, under the similar circumstances, it was no longer possible to do so.</p><br/><p>The officials’ explanation was:</p><br/><p>1. As Tank type players obtain Inheritances, the strength of the tanks has increased dramatically. To maintain a status quo between player and the boss, the healer class has been nerfed accordingly.</p><br/><p>2. Healer type players are too strong in the PvP Battle Arena. It is impossible for a battle to end if both sides have Healers in the party. Unless the healer has used up their MP, the battle can never end. Records showed that majority of battles has been dragged for over 2 hours.</p><br/><p>The first explanation was completely unacceptable. The ability to fight a boss did not depend on the quality of the healer. However, Zhang Yang could understand the reasoning behind the second note. Since group battles would always include a healer, both sides would only need to have 1 DPS and 1 Healer, or 1 Tank and 1 Healer to win. The battle could be dragged for as long as needed. The winners would usually be determined by the amount of MP the healer has.</p><br/><p>Zhang Yang opened the skill window and found that the skill {Berserker’s Heal} was indeed removed. Furthermore, he had also noticed that the skill that came with Herbalism, {Blood of Life} had also been nerfed greatly. The cooldown had been extended from 2 minutes to 10 minutes!</p><br/><p>After sighing for god knows how many times, Zhang Yang gave up trying to find a proper reason to justify the nerf fest. Even though many would protest the great change, other classes such as Hunter, Thief, and Spellcasters would cheer. That was due to the high winning rates of Tanks and Healers in PvP fights.</p><br/><p>What cunning gaming developers! Whenever they nerfed any particular class, the other unaffected classes would rejoice. Even if they start taking fire in the forums, there would be \"reinforcements,\" called keyboard warriors, to help in shifting the blame. The next trend would be to nerf the \"unaffected\" class to make it a proper class balancing arrangement.</p><br/><p>Zhang Yang took out his Sword of Purging Devourer, aware that he should get himself a Two-Handed Weapon as soon as possible. It would be a disgrace to his Inheritance if he does not do so! However, he had been hunting and farming for good Two-Handed Violet-Platinum weapons, but was never able to find any with a Level Requirement lower than 120. Until he reaches Level 120, they would remain in his inventory. Talk about a carrot hanging by the end of the stick! </p><br/><p>While hunting for Two-Handed weapons, he had also hoped that the Sword of Purging Devourer would turn into a Two-Handed Sword after absorbing a Two-Handed weapon ability! If that happens to be the case, it would solve his problem, since the sword was a one of a kind weapon!</p><br/><p>After getting over the sad thought of possibly having to part with it, Zhang Yang summoned Whitey Jr. and flew to Gunma Volcanic Island to obtain one of the materials in order to break the seal on the Sword of Purging Devourer. The \"Magical Fruit of Ying and Yang\".</p><br/><p>\"OH F*********!\" Just then, the furious, heartbroken cries of Han Ying Xue blasted through the party channel. \"My god! My healing powers have been reduced! At least 1/3 or my original power has been taken away! Awwww~\"</p><br/><p>Seems like the woman had finally read the change log.</p><br/><p>Zhang Yang switched to the party chat and consoled her. \"It’s ok. You’re F-cup, aren’t you? Even if we take 1/3 of it away, you’d still have D cups! Fret not! It’s still standing out!\"</p><br/><p>Han Ying Xue did not reply to him. Perhaps she was so angry or preoccupied that she had not noticed his chat.</p><br/><p>That did not matter since her healing power would be greatly boosted when she obtains the Milkmaid Deity Inheritance! Zhang Yang could not help but to wonder how things would turn out for her when she activates the Transformation skill of the Milkmaid Deity…Would she actually gain cup size or…Fu fu fu…</p><br/><p>Wei Yan Er stepped up to be the heroine of the day and helped Han Ying Xue searched for the remaining pieces of the Inheritance. Zhang Yang was delighted to have her take over his supposed role. After a short while, Whitey Jr. reached Gunma Volcanic Island.</p><br/><p>There was a live volcano located at the center of the island. Blackened smoke rose up into the sky, expelling all the smoke and ash into the clouds, darkening the skyline. That unstable, volatile scene made the island seem extremely unsafe to live in, especially when the volcano looked like it would spew out hot molten lava at any time. At the bottom of the mountain was a small town. Since volcanic soil is extremely fertile for crops, the town was rather densely populated. There were many races living there like humans, Orcs, Elves, Dwarfs, Gnomes, and other races that Zhang Yang had never seen before. Other than the hostile Spectre and Demons, it would be safe to say that this town was filled with all races throughout the world.</p><br/><p>Since the quest had revealed the location of the [Magical Fruit of Ying and Yang] in his map, it would not take much time for Zhang Yang to search for it in the small town. There was a high chance of finding the [Magical Fruit of Ying and Yang] through a quest given by one of the NPCs in the town.</p><br/><p>Zhang Yang flew downwards to the entrance of the town and unsummoned Whitey Jr. Only Zhang Yang and Felice walked into the town.</p><br/><p>In the game, only quest-giving NPCs have special names unlike common guards, NPCs, or random pedestrians. Most of the occupants of the town had the generic-looking name \"Citizen of Loyas Town\". If you were to talk to any of those NPCs with the name tag, their lines would be blunt, repetitive, and non-beneficial to Zhang Yang’s quest.</p><br/><p>He then pulled one of the NPCs over and started a conversation to try his luck. However, all he got from them was the history of Loyas. As for news about [Magical Fruit of Ying and Yang] there was nothing but shrugs and \"I don’t know\".</p><br/><p>Zhang Yang circled through the town and found one sad looking dwarf sitting by the end of the town with a face bleeding from a fresh wound.</p><br/><p>[Dodothi Wildhammer] (Normal, Humanoid)</p><br/><p>Level: 115</p><br/><p>HP: 17,800</p><br/><p>Defense: 100</p><br/><p>Melee Attack: 5,103 – 6,103</p><br/><p>Note: World’s most \"honest and trustworthy\" merchant. </p><br/><p>Zhang Yang narrowed his eyebrows when he saw the double quotation mark.</p><br/><p>Zhang Yang walked to the NPC and asked, \"Dwarf, what happened to you?\"</p><br/><p>\"Sigh…\" Dodothi sighed heavily and raised his head to Zhang Yang. After glancing for a second, Dodothi lowered his head.</p><br/><p>Zhang Yang voice out again, \"Perhaps, I could be of service?\"</p><br/><p>\"You?\" Dodothi finally looked into Zhang Yang eyes and shook his head as if he was greatly disappointed. \"Please keep your arrogance to yourself, human. There’s no way for you to solve my problems.\"</p><br/><p>\"Hah. But what if I can?\" Zhang Yang smirked.</p><br/><p>Dodothi raised his right eyebrow, intrigued by Zhang Yang’s bold question. \"Alright then, you may try. If won’t matter to me if you die anyway!\"</p><br/><p>Zhang Yang frowned. If it was not for a quest, Zhang Yang would have already beheaded the NPC.</p><br/><p>\"Just when I had restocked some fine goods for sale, I was ambushed by a group of Jackalmen! They killed all my hired guards and took away all of my wares! Those damned Jackalmen! I had lost a great deal of my investment! It cost me a lot of gold! Argh!\" Dodothi punched the wall beside him and cried out in pain.</p><br/><p>…</p><br/><p>How did this useless dwarf survive when all his guards were killed?</p><br/><p>Dodothi turned to Zhang Yang while rubbing his wounded fist. \"Human, if you can retrieve my goods, I shall reward you with 400—300—wait, 100 gold coins! Mm. Yes. 100 gold coins should be enough for you to hire 10 strong slaves!\"</p><br/><p>The red beard dwarf had glanced at Felice with disdain. He had assumed that Felice was extremely weak due to her slender and beautiful looks.</p><br/><p>‘Ding! Dodothi Wildhammer has a quest for you: Retrieve the Goods. Will you accept it?’</p><br/><p>It was not mentioned, but perhaps there was a chance that the [Magical Fruits of Ying and Yang] would be among the goods! Since there were no other leads for the item, Zhang Yang felt that it was better to take the quest and complete it.</p><br/><p>[Retrieving the Goods] (Difficulty Level: C)</p><br/><p>Description: Dodothi’s goods have been robbed by a bunch of daredevil Jackalmen! Warrior! Go and slay the devious Jackalmen and get back their stolen booty!</p><br/><p>Completion: Retrieve Dodothi Wildhammer’s Goods 0/1</p><br/><p>Translator Note:</p><br/><p>(1): Apparently, there’s a Chinese culture saying that after the first night in bed, a woman would become more beautiful, and after getting pregnant, she would be seen even prettier. In this case, it was not mentioned whether or not Han Ying Xue is pregnant.</p><br/>\n</div>"}