{"title": "Chapter 508: Han Ying Xue and Sun Xin Yu", "id": 508, "volume": 6, "url": "http://boxnovel.org/mmorpg-rebirth-of-the-legendary-guardian-chapter-508-han-ying-xue-and-sun-xin-yu", "volume_title": "Volume 6", "body": "<h1>Chapter 508: Han Ying Xue and Sun Xin Yu</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 508: Han Ying Xue and Sun Xin Yu</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Having obtained the God of War Inheritance, Zhang Yang was in high spirits and decided that it was good cause for a big celebration. He had invited Fatty Han to join him for dinner together with them at a high-class hotel restaurant. The entire \"family\" soon gathered up and sat down happily.</p><br/><p>Zhang Yang took the opportunity to talk about the Inheritance, starting all the way from the passive stat boosts, to the amazing transformation skill. At that point, everyone had gasped in surprise and shock. Names like pervert, wretch, hypocrite flew in his face.</p><br/><p>Zhang Yang blinked in surprise.</p><br/><p>\"Come on. It’s a transformation skill! It’s not like I would go faking my identity.\"</p><br/><p>\"It’s not that. Transforming as in changing your gender. Changing your gender just for the sake of power is so perverted! Tut~tut~tut~ You’re such an air-head!\" Wei Yan Er patted Zhang Yang’s shoulder like she was an elder sibling.</p><br/><p>Zhang Yang gave up trying to reason with her and ignore the incessant giggles of the tiresome ladies.</p><br/><p>\"Hey! Little Yang! When are you going get me an S class Hunter Inheritance?!\" cried the Fatty, glaring at Zhang Yang with excitement.</p><br/><p>\"Huh? Fatty bro, are trying to be a pervert as well? I don’t think you’d need one, since everyone knows that you’re one!\" Wei Yan Er laughed.</p><br/><p>Zhang Yang shook his head and said, \"Fatty, I think you should just get yourself a B class Inheritance. Even a C class would be acceptable. You’re all about the transformation, right?\" said Zhang Yang. In his previous life, Zhang Yang had obtained a King Kong Inheritance which was a B class. Having cleared the quest line for the S class God of War Inheritance, he truly believed, judging from Fatty Han’s capabilities as a player, that even getting a B class Inheritance would be barely possible.</p><br/><p>Fatty Han snorted and blinked, \"Little Yang. Are you looking down on your Fatty bro? I’m not saying that I’m a pro, but that sort of difficulty would be a cake’s walk! Hell, I can even finish it with my cock!\"</p><br/><p>Saying that, every waitress who had been around the table glared at him in disgust and incredulity. His girlfriend, Xiao Wei had smacked his bulging belly with all her might, causing the poor Fatty Han to cringe in pain.</p><br/><p>\"Hmph! I’d say, noobie tank is selfish! Selfish, I’m telling you! How could you leave us alone in the dark as you go around getting yourself the best S class Inheritance!\" said Wei Yan Er, disgruntled. Both her hands were placed on her hips as she pouted.</p><br/><p>Zhang Yang chuckled awkwardly and pretended to ignore the question. Such a statement was extremely difficult to refute. Might as well just eat up and get drunk.</p><br/><p>Everyone had never been happier for Zhang Yang, and had even ordered many alcoholic beverages to toast for his future, many times over. As they drank, other than Zhang Yang and Fatty Han who were heavy drinkers, most of the females around could not hold their drinks after a few glasses. Xiao Wei was around to send Fatty Han home, but Zhang Yang was ferrying five passengers, himself included. The sports car that he had brought along only had room for four. Even though their small bodies would not make that a problem, it would be against the law, and they could be fined heavily. In the end, Zhang Yang got them 5 rooms to spend the night.</p><br/><p>The four beauty queens were so intoxicated and they would not even walk straight. Zhang Yang did not want the male hotel crew to take advantage of them, so he carefully supported them, each and every one of them to their own rooms.</p><br/><p>The last to be escorted to her room was Han Ying Xue. Just when Zhang Yang had tucked her into bed, the sly witch had slithered her arms around Zhang Yang’s neck, pulling him close and planted a hot, passionate kiss on Zhang Yang’s lips. Zhang Yang was shocked but was not all too surprised, for it was totally within her characteristics to pull off such a stunt. He pulled himself away and asked, \"Are you drunk? Or were you just faking it…?\"</p><br/><p>\"Of course I’m faking it! Haha! I wanted to let that cold-hearted b*tch lose it really hard!\" Han Ying Xue laughed like a seductive succubus. During dinner, she had purposely poured more alcohol in Sun Xin Yu’s cup and forced everyone else to drink until their heads started spinning. Zhang Yang would have never known that Han Ying Xue could put up such a convincing act of being drunk! Poor Sun Xin Yu should probably be cursing to the high heavens in the washroom at that moment, puking her guts out!</p><br/><p>Zhang Yang frowned, biting his lower lip. \"I’m warning you, I did drink a lot back there. I might just lose it here! Don’t play with fire, or you’ll get yourself burnt! If you push me, I might actually do it!\" said Zhang Yang. Even as the last of those words left his mouth, Zhang Yang swallowed a mouthful of saliva.</p><br/><p>\"Hmph. We’re past that. Now, who is going to do who~~\" Han Ying Xue murmured. She pulled him down even further and pressed her jugs against Zhang Yang’s chest. She started applying pressure, only to relax, kneading her breasts against his hard body in a slow, hypnotic rhythm. It was summer. Zhang Yang only had a thin, muscle T-shirt on, and Han Ying Xue was wearing a low-cut dress. It was made clear that she had no bra on!</p><br/><p>\"F*ck. F*ck. F*ck. F*ck. F*ck. F*ck. F*ck. F*ck.\" The same words were racing in Zhang Yang’s mind as he tried his best to control himself. Even as he tried to take his mind elsewhere, Zhang Yang could clearly feel a pair of hardening nipples piercing through the garment and scratching against his chest. He could feel the ragged, hot breath coming from her open lips. Her warm lips met his neck and slowly traced down. Worse of all, the ultimate kryptonite to Zhang Yang’s resistance were her dazed, dreamy eyes. Her open mouth, and her soft, pink tongue that peeked out from their midst. She craved for a man. She craved for love. Hot, burning, passionate love.</p><br/><p>\"B*tch! You asked for it!\" Zhang Yang could not hold it in any longer. With one explosive motion, Zhang Yang pinned Han Ying Xue on the bed, his hands around her wrists, holding them above her body. He allowed his weight to rest on her softness, his knee resting just below her crotch, between her amazing, thick thighs. The mounds of wonder were squashed out so forcefully that they started spilling out over her sides. They became a hot, twisted, mess of intertwined limbs. Suddenly, Han Ying Xue grabbed him by the shoulders and pushed him up. She gazed into his face with half-opened eyes, a glimpse of her white teeth between her parted lips.</p><br/><p>\"I want it—\" The woman moaned, her hands drifting down to unbuckle that which kept Zhang Yang’s lower half chambered and contained.</p><br/><p>\"Calm down, you god d*mn swine! I can’t believe you!\" Zhang Yang would admit on any day that he is a horny, dirty bastard, but he had never expected a woman like Han Ying Xue to surpass even him in that aspect.</p><br/><p>\"Oh please. Why would I need to constraint myself in the presence of the man I love? I don’t need to hide anything. This is my true self!\" Han Ying Xue winked. Her hands rummaged around, groping and feeling about, but Zhang Yang pants remained intact. It was her first time, and she was having trouble unbuckling his leather belt, and it was beginning to frustrate her. The combination of her pent up anticipation, along with that frustration had made her so moist that fabric beneath her, and the mattress were getting drenched in her lovely lady’s juice.</p><br/><p>\"Mm. Hm. Let me,\" grunted Zhang Yang. He had mistakenly believed that Han Ying Xue was still teasing him and got slightly annoyed. Her hands had brushed against his bulging, rock-hard asset, and it was getting close to torture. He gently pushed away her hands and unbuckled his own pants.</p><br/><p>After all manner of fabric and garment had been removed, the two of them locked each other up in a tight embrace. Zhang Yang allowed her to get up top. He was being far gentler, compared to his first time with Yu Li. It was Han Ying Xue’s first experience, and based on his experience, he ought to be extremely gentle to maximize the comfort and pleasure, while minimizing the pain. After all, Han Ying Xue was one fine, fine creature. Her first experience should be of pleasure, not pain!</p><br/><p>\"Why are you being so gentle! That’s so not you! Rough me up! Dominate me! Harder!\" said Han Ying Xue. She pushed herself up and bit down on his shoulder. \"You know…the time when I first fell for you, was when I met you for the first time at my apartment, when you dominated the ice queen so nicely, against the wall, just like that! Yes, I may be a b*tch. But I like my men hard and strong! I need a brute to keep me around! You think you have what it takes to keep this hot piece of *ss around?\"</p><br/><p>\"Have what it takes?\" Zhang Yang grinned. \"B*tch, you asked for this. Don’t start crying later, for once I go hard, there’s no turning back!\"</p><br/><p>\"Boy. Stop talking. Do you make love with your mouth!?\"</p><br/><p>Since the bloody woman was being so provocative, there was no reason to hold back any longer. With the alcohol in his bloodstream, and the amount of frustration build up, and the sense of accomplishment having obtained the God of War Inheritance, Zhang Yang had so much pent up in that one month of hardship. He then grabbed hold of Han Ying Xue by her hair, dragging her further onto the bed as he pinned her down. His ‘weapon’ had been teased, tormented, and enraged so extensively that it twitched in anticipation, rearing to plunge itself deep in Han Ying Xue.</p><br/><p>\"Mmmhhh~~\" Even though she was practically begging to be thoroughly ravaged, Han Ying Xue is still a virgin. She may be taking in something far too large, too powerful for her ripe, unplucked fruit. She knit her graceful, lovely eyebrows together, and her eyelids slid over her dazed eyes. The expression on her face intensified his burning lust, sending Zhang Yang’s soul into purgatory. Zhang Yang leaned back, allowed the power to accumulate in his body, before thrusting his hips with great force, ramming into her with the brutal might of a warrior. God of War!</p><br/><p>\"AHH--!\" Both their voices were raised at the same time. The woman was a brute herself. She had wanted him to taste the pain of blood with her. Pulling herself closer to Zhang Yang, her nails digging into his back, she opened her mouth and chomped down into Zhang Yang’s shoulder muscle. The pain was so sudden and unexpected that Zhang Yang almost roared like a hungry lion. Zhang Yang winced a little and retaliated. He started to brutally smash the attractive, gentle elf like a savage orc. Blood quickly mixed up with other clearer, warmer liquids as they churned about. The pistoning had started off with great vigor, but it quickly became clear that there was a lot more room before the redline.</p><br/><p>Han Ying Xue had gotten used to it in a surprisingly short period of time. Her vulgar grunts were slowly turning into melodic, beautiful utterances. The painful moment for her ended quickly, and was replaced with pleasure. She loosened up a little, allowing Zhang Yang to delve even deeper. Her long, white legs wrapped around him with great desire, urging him to increase his speed for her own pleasure.</p><br/><p>If Zhang Yang had not been reborn, he would not have gained a cheat code full of experience in this activity. Without it, he might end up as a scrawny little man after Han Ying Xue is finally satisfied.</p><br/><p>Han Ying Xue’s lovely, melodic voice permeated all over the room. It bounced off the walls, echoing out of the balcony. They were at it for more than half an hour before Han Ying Xue finally called it a night. When Zhang Yang had been with Yu Li, they could go at it for hours. However, foreplay alone usually took up more than two-thirds of the overall duration. As for Han Ying Xue, since she had asked for the brutal side of him, Zhang Yang had gone all out, continuously, for more than half an hour. The poor man was so tired and he had to lie next to her, panting in exhaustion. If she had asked for more, even Zhang Yang would end up with an IV Drip in his body when the whole ordeal is over.</p><br/><p>THUD! THUD! THUD! THUD!</p><br/><p>Just when Zhang Yang finally recovered enough to sit up, the hard rapping of the door burst out in the silence. Zhang Yang frowned. Who could it be? If it was a service crew member, they would have used the doorbell, instead of physically knocking. Plus, the knock was strong…and rude, it came off way too strong and impatient. Nothing like that of a service crew! In that case…it could only be…</p><br/><p>Zhang Yang had never been so terrified in his life. He wrapped the blanket around his lower half and made his way to the eye hole of the door. He almost let out a yelp when the person on the opposite side was none other than the harbinger. Sun Xin Yu!</p><br/><p>Zhang Yang felt immense guilt rising up in his chest. The sort of feeling that you get when caught cheating on another woman. Zhang Yang returned to Han Ying Xue’s side with a solemn face.</p><br/><p>Han Ying Xue raised an eyebrow and smirked when she studied Zhang Yang’s reaction. \"Is it the ice queen?\"</p><br/><p>\"Yes….\"</p><br/><p>THUD! THUD! THUD! THUD! THUD!</p><br/><p>The knocking had turned into the solid bangs of a battering ram. The door might not hold up any longer.</p><br/><p>Zhang Yang frantically looked to the left and right for a place to hide. \"Go, go and tame that beast, I gotta hide!\"</p><br/><p>Han Ying Xue sighed. She then picked up a blanket and held it against her chest. \"Men…\"</p><br/><p>Han Ying Xue waltzed lazily to the door and unlocked it casually. She was smart. When she unlocked the door, she had quickly taken a step back. Lo and behold, the door practically flew open. Sun Xin Yu’s moist, intoxicated face glowed with a crimson hue. Perhaps there was more rage than anything there. She staggered into the room and started looking around, her head whipping her partially undone hair about. At one point, she had almost fell to her feet.</p><br/><p>\"*ahem* This is MY room. You mind explaining yourself?\" said, Han Ying Xue, as she slowly pushed the door close with her jade-white legs.</p><br/><p>\"Where *hick*. Where is he?\" rasped Sun Xin Yu. Her voice was cracking and there was an intense anger burning in her eyes. Her cheeks were dyed in red.</p><br/><p>\"Who?\" Han Ying Xue played dumb.</p><br/><p>\"You sow! Don’t play coy with me! Don’t you dare say that you did not lay with him!\" Sun Xin Yu burst with anger.</p><br/><p>\"Yeah. I did. So what are you going to do? Bite me?\" Han Ying Xue crossed her arms. \"I’m more than capable of making it worth his while! Unlike you, flatty!\"</p><br/><p>In truth, Sun Xin Yu’s chest was nowhere close to being flat. In fact, no one in their right mind would even associate her to that word. Still, when compared to Han Ying Xue, a lady who was so well-endowed, even Sun Xin Yu would appear average.</p><br/><p>\"Sow! Brag all you want! Your fat lumps will sag down like a potato sack!\" Sun Xin Yu shot back.</p><br/><p>\"Hmph! At least it’s better than having a flat chest! Sigh! Look at them! Those sad little things. Is it just me, or is one of them caved in deeper than the other?\" Han Ying Xue shrugged bemusedly.</p><br/><p>Woah! #burn</p><br/><p>When it comes to a battle of words, no one would really be on par with the demoness. Sun Xin Yu may not be able to hold her own in a battle of words, but in a fist fight, perhaps only Zhang Yang would be able to keep up.</p><br/><p>Sensing impending disaster, Zhang Yang quickly popped out of toilet. Awkwardly, Zhang Yang scratched the back of his head and said, \"What a beautiful night, isn’t it ladies?\"</p><br/><p>\"It’s raining!\" Sun Xin Yu bashfully replied.</p><br/><p>Han Ying Xue pouted her lips and said, \"Hey, flat chest. There’s your man. Now, are you satisfied? You can leave now. We’re about to start round two soon.\"</p><br/><p>Sun Xin Yu snorted and proceeded to undress herself.</p><br/><p>Zhang Yang jumped in horror. He was genuinely shocked at her sudden, abrupt behavior and cried out, \"What are you doing!?\"</p><br/><p>\"If she can do it, I can do it better!\" Sun Xin Yu glared at Han Ying Xue. \"I’ll never lose to her! I’ll rather die than admit defeat!\"</p><br/><p>As expected of alcohol, they revealed the true minds of women.</p><br/><p>\"Please…Like yours can compete with mine!\" Han Ying Xue boldly dropped the blanket she was holding up and pridefully squashed her naked body against Sun Xin Yu’s bare flesh. The two of them continued to press their assets against each other until it became clear that there would be no winner. Puffing and huffing, one with arrogance, the other with persistence, neither side wanted to lose! After an intense glaring contest, both of them turned to Zhang Yang, making him jump in horror. He knew that he was going to be the victim but was hoping to get away from this…</p><br/><p>Oh crap…</p><br/><p>…</p><br/><p>The night went by in a torrent of rage and violence, that when the sun’s ray pierced through the curtain gaps, it was dissipated by the thick, heavy atmosphere of the steamy hot room.</p><br/><p>Zhang Yang had both his hands wide open like a crucified man. They were both used as head pillows for the two vixens in his bed. He had just woken up and was lost in troubled thoughts, wondering if it was morally right to accept two world class super models in his arms like this.</p><br/><p>Both Sun and Han had always been at each other’s throats and the presence of alcohol had blown all restraints off their hinges. The night before was extremely brutal, for Zhang Yang at least. Whenever he was done climbing the steep mountain of pacifying one creature, the other would jump in and demand for it.</p><br/><p>In truth, it was every man’s dream to hear a woman crying for it, but even the greatest men have limits! In Zhang Yang’s case, both of them had taken turns, crying for more! At one point, no amount of Red Bull was enough to get him back to his feet.</p><br/><p>Sun Xin Yu’s long fair legs twitched a little. When she opened her eyes, her entire body sprung up so swiftly that Zhang Yang could have mistaken her for a spring board. Her eyes were wide open and she was beginning to realize her position. She hugged herself and trembled at the fact of what that had happened last night. Her face turned red, and she was at the verge of crying.</p><br/><p>At first, his erect missile had been rearing to go once again, but when Zhang Yang saw Sun Xin Yu’s broken expression, he felt remorse and tried to console her. \"Erhm…Are you only trying to reserve yourself now? I mean, you were a little *ahem,* last night.\"</p><br/><p>Sun Xin Yu shot a death glare at Zhang Yang and turned away to grabbed her clothing, but her legs gave out due to the pain between her thighs. She let out a painful groan and almost fell over. She quickly supported herself with her hands and made her way back to the bed.</p><br/><p>Right then, Zhang Yang had a sudden urge to solve the conflict. Compared to the risks of being \"swallowed whole\" by the two vixens again, he was more concerned about the future of the two ladies. He wanted to take this chance to fix the conflict between the two of them and hoped that they would make peace with each other. Zhang Yang sat up, his eyes unintentionally raking over Sun Xin Yu’s extremely slender and toned waist line. The woman had such a sleek waist and toned abs that had no traces of any excess fat! But even so, she could be as soft as a feather when she chose to, or tense up when she needed a burst of power to kick someone’s butt. Last night, Zhang Yang had experienced the best of both worlds when Sun Xin Yu was riding on him like a female knight, carrying herself with such noble dignity, even as ecstasy dictated for her to gallop harder to the peak!</p><br/><p>Zhang Yang smile lightly and said, \"If you’re hurt, it’s best for you to stay put and rest.\"</p><br/><p>\"I’m an officer of the law. Such a wound is nothing!\" said Sun Xin Yu coldly. Looks like she had returned to her usual behavior.</p><br/><p>Zhang Yang chuckled at her stubbornness.</p><br/><p>\"*Groans* It’s morning…why are you making so much noise…\" Han Ying Xue stretched her body and sat up straight while leaning her back against the wooden plank at the head of the bed. The silky blanket slid off, revealing a great deal of her body. No matter how soft the blanket was, it could not properly plaster itself between Han Ying Xue’s deep cleavage. Her chest was so extravagant that they could even hold up the blanket like a hanger!</p><br/><p>Even though Sun Xin Yu’s stubbornness was world class, she could not help but to admit that Han Ying Xue was truly a beauty. Her perfection could even entice the likes of women! Sun Xin Yu scoffed and said, \"Sly fox, what do you want?\"</p><br/><p>Han Ying Xue slid her legs off the bed. But when she wanted to get off the bed, she lazily lay back down and tugged one of Zhang Yang’s arms over, using it as a pillow. Still a little sleepy, she rubbed her face against Zhang Yang’s warm bicep, which only made Sun Xin Yu angrier.</p><br/><p>In a blurry voice, Han Ying Xue said, \"Little Sun, you best treat your elder sister with respect!\"</p><br/><p>\"What…? Elder sister?\" Sun Xin Yu coldly snapped.</p><br/><p>\"Yes. Elder sister. I was Zhang Yang’s before you. So, technically, I am the elder!\" said Han Ying Xue as she buried herself into Zhang Yang’s embrace like a lazy cat.</p><br/><p>\"Hmph. That’s was just in bed. You’re not really Zhang Yang’s wife yet!\" said Sun Xin Yu.</p><br/><p>Wife…? Oh no…</p><br/><p>\"Haha! What a shame. Still, I’ll always be one step ahead of you!\"</p><br/><p>Zhang Yang had mixed feelings about it. Firstly, he was quite satisfied with how things had turned out. At first, he was extremely worried that he would never make them accept each other. But, it seemed that they had already skipped the major confrontation and it was now the first wife argument. How efficient could they be…</p><br/><p>Zhang Yang accidentally forgot his place and comforted both women by gently caressing them at their slender fair backs, slightly above their curvy buttocks. \"There, there. No need to argue about this and that. We are all one happy family. Let’s keep it that way!\"</p><br/><p>Perhaps Zhang Yang was honest to a fault. Failing to hide his greed only earned the ire of both women.</p><br/>\n</div>"}