{"title": "Chapter 526: Slaughtering the Indians", "id": 526, "volume": 6, "url": "http://boxnovel.org/mmorpg-rebirth-of-the-legendary-guardian-chapter-526-slaughtering-the-indians", "volume_title": "Volume 6", "body": "<h1>Chapter 526: Slaughtering the Indians</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 526: Slaughtering the Indians</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Savage Lord was enraged. Or he was trying to be. In truth, he was more confused than anything. There were five of them and one of Zhang Yang, yet he was already picking them off in the opening seconds of the battle! They did not even get the opportunity to use any life-saving skills!</p><br/><p>\"GRAH!\" he bellowed, almost puking his guts out. All skills, including the ones that he had reserved for the boss, was unleashed. The man swung his axe and shot out a ray of silvery light. The light then morphed and formed itself into a white fiery bird that flew directly into Zhang Yang’s chest.</p><br/><p>Eh?</p><br/><p>Zhang Yang narrowed his eyes and decided to only use {Last Vigor}. The skill would push his maximum HP to over 140,000. With the 20% passive damage reduction skill, it would take a damage value of over 180,000 to kill Zhang Yang instantly.</p><br/><p>Zhang Yang maintained his pace and charged towards King Kong’s Wrath.</p><br/><p>‘-5,394!’</p><br/><p>As the bird seeped into Zhang Yang’s body, he had taken that one tick of damage. Zhang Yang then hypothesized that the skill that Savage Lord had just used was similar to that of {Dance of Heaven and Earth}, a skill that could deal 10,000 fixed damage (depending on damage attribute) every second, for 10 seconds.</p><br/><p>King Kong’s Wrath rushed over to Savage Lord. As a good healer, one must rush over to the tank to heal instead of running amok all over the place.</p><br/><p>{Heroic Leap}!</p><br/><p>Zhang Yang leaped into the air like a god towards King Kong’s Wrath.</p><br/><p>{Heroic Leap}!</p><br/><p>This time, Savage Lord took the opportunity to feed Zhang Yang his own medicine. Savage Lord had been stunned in the middle of his {Charge} animation. Even though it was the bear who had did it, it was still under the control of Zhang Yang. He wanted to stun Zhang Yang in the middle of his own skill as revenge.</p><br/><p>Zhang Yang grinned evilly. Just then Savage Lord was about to crash into him, He timed the location and position perfectly and activated {Brutal Smash} to stun the poor fellow for 4 seconds.</p><br/><p>Like a paper plane that had struck a wall, Savage Lord fell from the sky.</p><br/><p>King Kong’s Wrath panicked and quickly activated {Terror Shriek} the moment Zhang Yang landed at him.</p><br/><p>\"Good reaction!\" Zhang Yang had to compliment the man’s skills. Zhang Yang then countered the {Terror Shriek} effect with {Warrior’s Will}. Sadly, his attack interval was as long as 3.8 seconds. He would need to wait for another 2 seconds or so to launch another strike. Hence, even though {Brutal Smash} was about to deal damage, it shared a 1 second global cooldown which required him to wait for 0.5 seconds before any skills could be activated.</p><br/><p>Since there was nothing he could do at the moment, Zhang Yang just stood there and waited. However, instead of attacking as he normally would, Zhang Yang swung his shield into King Kong’s Wrath’s face, knocking him off his feet and sent him crashing into the ground, his face digging up a new drain in the ground. It only grew in length as he slid further along, his legs angled to the sky.</p><br/><p>\"ZHAN YU--!\" Savage Lord screamed in agony. He then used {Warrior’s Will} to dispel the stun effect on him and charged towards Zhang Yang. At the same time, he flicked his fingers and cast {Sacrifice} to protect King Kong’s Wrath.</p><br/><p>Wham!</p><br/><p>Zhang Yang had whacked the poor fellow who had just gotten back up to his feet. Once he was on the ground again, Zhang Yang stepped on the player’s back and laughed at Savage Lord, \"No need to get so aggravated. Though I feel the need to tell you that I don’t swing that way. I prefer good, old-fashioned pussies and boobies instead of d*cks and buttholes.\"</p><br/><p>\"Bastard!\" Savage Lord lost it. With quick movements, the Guardian swung his hands and threw a beam of light at Zhang Yang. The {Spear of Obliteration} was weak. He was no Zhang Yang. His damage on Zhang Yang was only over 3,000 damage, since he was wielding a One-Handed Weapon.</p><br/><p>‘-5,394!’</p><br/><p>The fiery bird skill was still damaging Zhang Yang which had drained him by only 5,394 HP per second. 10 of them would be over 54,000, and that could drain half of Zhang Yang’s HP bar.</p><br/><p>\"Just die!\" King Kong Arcane had revealed himself in front of Zhang Yang. He had activated {Shadow Cloak} which granted him immunity to Felice’s attack and had dispelled the slow effect of {Thunder Strike}. The blades struck the air, followed by a burst of light from the middle of his palm, which King Kong Arcane directed it towards the center of Zhang Yang’s chest.</p><br/><p>Mm. Mm. Zhang Yang chuckled. He had forced the opponent to expend all of their ulti skills. With a wide malicious grin, Zhang Yang activated {Shield Wall}. After the 1 second global cooldown ended, Zhang Yang struck Savage Lord with {Frost Strike}.</p><br/><p>‘-36,450!’</p><br/><p>Savage Lord was struck with a heavy damage and icy bricks started forming around him, which then grew upwards to encase his entire character in ice. Since the ice was slightly transparent, Zhang Yang could see the disgruntled expression on Savage Lord’s face. He had already used {Warrior’s Will} to dispel the {Heroic Leap} stun effect and could only sit there and wait until the frozen effect wears off over time.</p><br/><p>Thud!</p><br/><p>Zhang Yang lifted a leg and sent King Kong’s Wrath flying away.</p><br/><p>\"GRAH!\" The diminutive King Kong’s Wrath was almost at the brink of madness. He had never known that PvP would involve such maneuvers where he could be treated like a sandbag by Zhang Yang. Even though the attack had not dealt a single damage, it had made him lose his temper, focus, and most importantly, his dignity.</p><br/><p>{Sacred Protection}!</p><br/><p>King Kong Wrath could not take it anymore and immediately entered an invincible state. No matter how much rage had clouded his senses, the responsibility of being a healer had never left his judgment. He did not blindly charge at Zhang Yang, but went towards Savage Lord to heal him.</p><br/><p>Zhang Yang chuckled. Heal? Really? Right when healers had been so greatly depowered that their powers were as good as smacking a band-aid down the bleeding stump of a severed limb. Could his heal really keep up with the attack combination of Zhang Yang and Felice?!</p><br/><p>That aside, be it buffed or nerf, Zhang Yang still had his {Destructive Smash} that reduced healing effectiveness by 75%. Even if he had not used the skill to debuff Savage Lord, it would take four more King Kong’s Wrath to fully negate the HP loss dealt by Zhang Yang and Felice.</p><br/><p>Wham! Bam!</p><br/><p>As one, Zhang Yang and Felice moved on to Savage Lord who was still encased in ice. Even though he was a class that was meant to take damage head on, his long HP and Defense were completely useless, they were emptied out like a broken aquarium! However, Savage Lord responded accordingly. Even though he was restricted from moving, he could still activate {Shield Wall}. The skill’s greatest advantage was that it could be used anytime, anywhere, and in any situation, except {Silence} and {Disarmed}.</p><br/><p>All three Indian players were safe, but only temporarily. Their invincible protection would only last for 10 seconds. During that time, there was nothing that they could do but to cower and hope for some miracle to save them from being humiliated! The shame of calling themselves professional players, and yet, they could not even defeat a single player and his Battle Companion.</p><br/><p>10 seconds passed on quickly and the protection skills had expired. Felice shot down from the sky in her human form and crashed down majestically to the earth, leaving a small crater. With lightning speed, she swung her lance downward and did a quick thrust. After activating Dragon’s Spear Barrage, she sent out a normal attack that followed almost instantly!</p><br/><p>‘-17,822!’</p><br/><p>‘-27,168!’</p><br/><p>King Kong’s Wrath was horrified. His maximum HP was only as much as 50,000. The 40,000 over damage by Felice was so strong that it had left King Kong’s Wrath with only more than 10,000 HP left. Since he could not use a mount to flee from the cave, there was no place for him to escape. One more pebble falling from the ceiling of the cave would kill him off. {Berserker’s Heal} and {Sacred Heal} had already been removed from the game, and since he had already used {Sacred Protection}, there were no other skills left to protect himself. All he could do was to leave his fate in the hands of his teammates.</p><br/><p>{Blind}!</p><br/><p>King Kong Arcane grabbed a handful of sand and tossed them towards Zhang Yang’s eyes, causing a momentary blindness and inflicted the {Confusion} debuff.</p><br/><p>Zhang Yang immediately counter the debuff with [Heart of the Death Knight] accessory skill and aimed his hammer at King Kong’s Wrath. With all the muscles tensing up in his forearm, Zhang Yang forcefully heaved down the hammer with the might of a God of War!</p><br/><p>‘-98,774!’ {Destructive Smash}, Critical .</p><br/><p>Pak!</p><br/><p>King Kong’s Wrath’s head blew up, as if there was a bomb planted in his skull, splattering all his brain juice and other gory stuff around the cave and even on Zhang Yang’s metallic armor.</p><br/><p>Zhang Yang felt like throwing up. The scene was too brutal for any normal human to handle. No wonder Tang the monk had always expressed his disdain towards Sun Wukong. The old monkey would always use his magical pole to smash open the enemy to pieces. How would one feel safe with such a brutal creature that is capable of doing such an act, and actually guide him to the west?</p><br/><p>\"No!\" cried Savage Lord and King Kong’s Wrath in horror. They were India region S class Professional League Battle Team! If word got out that an entire battle team was \"raped\" by a single man in the wilderness, they would have no places to hide their faces.</p><br/><p>Zhang Yang scoffed. With {Shield Wall} active, Zhang Yang’s HP was constantly recovering. The best thing was that {Rearm} was ready to be used at anytime! He also had {Dance of Heaven and Earth} and {Chaotic Dance of Electric Current}! {Glare of the Death God} too! There were still many trump cards that he had not used! Yet the opponent already seemed to have their wills broken. What else could they use against him?</p><br/><p>Heaven’s Shaker was swung around, bashing his opponents like a sledgehammer smashing into bricks. At the same time, Zhang Yang had been using kicks, hooks, trips, shoves, sweeps, and many other \"Supporting Attack\" to torture both Savage Lord and King Kong’s Arcane to the point that they could not even get into their stances!</p><br/><p>Wham!</p><br/><p>In less than 10 seconds after the second death, King Kong’s Arcane had fallen. 15 seconds after that, Savage Lord had entered the spectral realm.</p><br/><p>From the moment Zhang Yang had started the fight and until the last opponent was killed, the entire process had only taken a minute or more, even though so much had taken place in between those times. That was the ferocious power of Zhang Yang and Felice. Besides the split second {Wild Charge} to catch Savage Lord, the white bear had done nothing at all, it had been running up and down the field, trying to catch players as if they were floating butterflies, to no avail!</p><br/><p>*Claps*</p><br/><p>From a corner of the cave, Hourglass Figure was leaning against the cave wall and clapped her hands slowly and gracefully. Her expression was unexpectedly calm and somewhat delighted. Perhaps, its fortunate that the four fallen Indians had already released their souls to be revived again, or else, they would be completely annoyed at her actions.</p><br/><p>During the entire battle with the four men, Zhang Yang had always kept an eye out for the woman. Not once he had let her out of his sight. She was, after all, one of the top players in the world that had obtained the S class Inheritance, and was hailed as the best hunter in the world. Even though when Hundred Shots obtained the Dragon pet, she was still able to step above him in every way possible.</p><br/><p>Even though she had not yet obtained the Shadow Striker Inheritance, Zhang Yang dared not to lower his guard around her. He had not activated the God of War Transformation and had his HP and Defense were at their natural values. It would be rather unfortunate if he were to receive a sneaky attack when his HP is low.</p><br/><p>Still, all her actions were incomprehensible. She was just standing there, watching Zhang Yang slay all her teammates and had done nothing to stop it. What was she thinking then? Still, if she had joined in at the moment when Zhang Yang had made any careless mistakes, Zhang Yang could still turn the table around with {Dance of Heaven and Earth}, {Chaotic Dance of Electric Current}, and also {Glare of the Death God}. With so much power in hand, if he was still at disadvantage, he could activate the God of War Transformation at any time to butcher them all.</p><br/><p>Before other 5 S class Inheritance makes their appearances, Zhang Yang would remain undefeatable.</p><br/><p>\"Hmm. Mm. Not bad. I expected no less from the man I’ve heard so much about. Well done, Zhan Yu.\" Hourglass Figure placed her one hand on her hip and cat walked towards him. She smiled seductively and said, \"I’ll give you a chance to join my guild. Think about it carefully.\"</p><br/><p>Zhang Yang smiled and pointed at the dead bodies and said, \"Let’s say I accept, would you not be afraid of offending these guys?\"</p><br/><p>Hourglass Figure laughed with her rich voice and bent over. Her peaks bounced about wildly. Zhang Yang stared at the peaks rather boldly and compared them to Sun Xin Yu. Hourglass Figure does have a wonderful pair of boobs, perhaps she was on the same level as Sun Xin Yu. However, even Sun Xin Yu’s toned abs could not match up to her waistline. They were indeed slender and made her boobs stand out even more prominently.</p><br/><p>Hourglass Figure gestured at them casually and said, \"They are just a bunch of nobodies with a major superiority complex. Zhan Yu, join the India region. Together, we can conquer the world! Or perhaps, conquer me~\"</p><br/><p>Zhang Yang could not hold in his laughter and said, \"In that case, how about I invite you to join China? I don’t mind having more partners in bed!\"</p><br/><p>Hourglass Figure widened her gaze and laughed loudly. \"Zhan Yu, my dear. You, do know who I am, don’t you? I’m about to own Steely Dangs Holdings! Right now, I own 7% of the total share of Steely Dangs, worth more than 7,800,000,000 USD. Are you sure that you want me to be your lover?\"</p><br/><p>Crap…he could never allow himself to lose his honor! What’s more, he was technically representing China against India! How could he allow himself to lose! Even if it was in terms of financial fortune!</p><br/><p>He quickly thought of a way to switch the topic and said, \"Hmm. What do you want? Money or man?\"</p><br/><p>Hourglass Figure cocked her head and crossed her arm to lift her breasts higher up to Zhang Yang. \"I know that you are wealthy. It’s expected. However, I can offer you a good deal.\"</p><br/><p>She then lifted her index finger.</p><br/><p>\"1 million?\" said Zhang Yang disgruntledly.</p><br/><p>\"Tsk tsk tsk.\" She shook her head. \"You’re either being too humble or looking down on me,\" said the smexy indian chick. \"100 million, in USD.\"</p><br/><p>\"!\" Zhang Yang was thrown away. The women had balls bigger than he did! Even though ‘God’s Miracle’ was already famous throughout the globe, but it was still one year away from reaching its peak! Yet, this woman would take 100 million right then to coax him over. Zhang Yang could not decide whether is she had such foresight or was just too lonely…</p><br/><p>Still, Zhang Yang had already amassed more than 100 million worth of fortune himself. Zhang Yang felt that after that amount, anything more or less would be nothing but numbers. He would not be tempted by Hourglass Figure’s offer.</p><br/><p>Zhang Yang smirked and said, \"I stand by what I said. I don’t mind have Miss Hourglass Figure in my bed. Come to China and I’ll welcome you with open arms.\"</p><br/><p>Hourglass Figure widened her eyes. She was genuinely shocked by his response and shook her head. \"What a shame.\" She turned around without saying anything else and disappeared from Zhang Yang’s sight.</p><br/><p>\"Won’t you want to have revenge for your fallen teammates?\"</p><br/><p>Hourglass Figure stopped midstride, angling her hips and turned her head around, \"Right now, I’m not your opponent! That said, you are the first player to obtain an Inheritance, aren’t you? You defeated those four idiots without the need to use the transformation skill. For now, I should at least find myself a stronger Inheritance, and come back for you when I do. I shall see you in the world championship Professional League!\"</p><br/><p>Hourglass Figure turned around after she was finished with her speech. In no time at all, she turned around a corner and disappeared.</p><br/>\n</div>"}