{"title": "Chapter 546: The Blood Spider Queen", "id": 546, "volume": 6, "url": "http://boxnovel.org/mmorpg-rebirth-of-the-legendary-guardian-chapter-546-the-blood-spider-queen", "volume_title": "Volume 6", "body": "<h1>Chapter 546: The Blood Spider Queen</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 546: The Blood Spider Queen</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Dusk Phoenix was frustrated beyond words. The moment her {Blood Angel Transformation} faded, she screamed into the sky at a deafening pitch, and then she took out a [Teleportation Scroll] and tore it apart without any hesitation. In just a while, her body radiated in a bright white light as she teleported away from the scene.</p><br/><p>Honestly speaking, this black Phoenix walked on the path of an Assassin. She could have stayed and waited for the right moment to ambush Zhang Yang. Even though Zhang Yang was capable of doing so, it would be an extremely difficult task to detect a Thief in ‘Stealth Mode’. If she times it right, she could take him out. She could have gotten the job done by using her {Ambush} on him when the right time comes!</p><br/><p>However, her previous encounter with Zhang Yang had left her with an irrational, paranoid fear. Without the support of her {Blood Angel Transformation}, she was no longer willing to take on Zhang Yang.</p><br/><p>The moment after she left, Zhang Yang popped himself out of a corner. It was such a pity that he did not come out a little earlier. Zhang Yang could not help but to shake his head at his own hesitation.</p><br/><p>Just a few minutes ago, Zhang Yang was still the mouse that was trying to outrun a furious, flying cat. The moment when her {Blood Angel Transformation} expired, the tables had been turned almost immediately! Unfortunately for Zhang Yang, the black Phoenix was quick to remove herself from the mining cave, leaving no chance for Zhang Yang to retaliate!</p><br/><p>All things considered, Zhang Yang had managed to survive the onslaughts of a Class A {Inheritance Transformation} for 2 hours. What's more, the moment the Inheritance wore off, the player had immediately retreated, having depended on its power, wholly. Well, he was lucky enough for the place to be a cave, with many places for him to hide. If they had been battling in an open ground, or a desert, it would have been wiser for Zhang Yang to use {Burrow} to gain distance from Dusk Phoenix and just escape by using a [Teleportation Scroll]!</p><br/><p>Actually, Zhang Yang was not all too bothered about killing her in return. What he wanted to know was, how does she keep finding him!</p><br/><p>Without the knowledge of how the black Phoenix had managed to track him again and again, made Zhang Yang slightly paranoid. It was like, someone watching him all the time like a creepy stalker. He had this feeling that if he ever lets his guard down for a split second, he would be taken out in a flash, just like that!</p><br/><p>There was indeed a very real threat going on here!</p><br/><p>With Dusk Phoenix's Class A {Blood Angel Transformation} possibly looming around at every corner of his journey, Zhang Yang would need to keep his own {God Of War Transformation} in reserve as a countermeasure, should she come at him full-on. If he does not do so, he would be forced to flee for his life every single time! However, saving the {God of War Transformation} solely for her would severely limit his performance in other activities.</p><br/><p>If Dusk Phoenix ever chooses not to appear for an entire month, would he have to withhold his own 'Transformation' for the same duration? Was it worth it?</p><br/><p>Not knowing when your enemy may strike, while realizing that every step you take is a perilous one, was not a pleasant sensation at all.</p><br/><p>Since the situation was not amendable at the moment, Zhang Yang decided to focus on his current quest.</p><br/><p>After calming himself down, Zhang Yang continued to move deeper into the mining cave. He slaughtered up hundreds of Blood Spiders along his way before he finally arrived at the deepest area of the mining cave. Finally, he lay his eyes upon the legendary boss!</p><br/><p>This Blood Spider was the size of two bungalows. It was gigantic! Its eight, spearlike legs flashed and gleamed in the light. Countless bristles that stood out from its body like sharp blades sent chills down the spines of everyone who gazed upon it.</p><br/><p>[Blood Spider Queen]</p><br/><p>Level: 125</p><br/><p>HP: 37,500,000</p><br/><p>Defense: 5,200</p><br/><p>Melee Attack: 30,157 - 34,157</p><br/><p>Skills:</p><br/><p>[Virulent Venom Blood]: Projects venom to all targets within range, causes 30,000 Nature damage to every target and reduces the Movement Speed of the target by 50%. Lasts for 15 seconds. Instant Activation. Range: 40 meters</p><br/><p>[Armor Piercing Skewer]: Gives target a fatal strike with it’s sharp legs, causing 100% Melee Attack, Piercing Damage. The target will be afflicted with [Bleed] and receive a total of 40% Attack in the form of Bleeding Damage for 15 seconds. This effect can stack by up to 5 layers. Range: Melee range.</p><br/><p>[Spawn]: Lays a row of Spider Eggs on the ground. A bunch of little spiders will spawn every 30 seconds. The number of the spiders spawned is equal to the number of players engaged in battle X 2.</p><br/><p>[Berserk (Passive)]: Attack will increase by 10% for every 10 minutes in battle.</p><br/><p>Note: This is the Blood Spider Queen. It has an unimaginably strong capability to breed. A wise warrior would rather face 100 hungry wolves than being an enemy to a Blood Spider that is undergoing its nesting season.</p><br/><p>Upon seeing that this was a Mythical Tier boss, ZHang Yang no longer had the slightest intention of battling the boss solo. This boss seemed to be proficient in both melee and range. It was so massive that kiting seemed completely implausible!</p><br/><p>Zhang Yang equipped his [Party Summon Order] and activated it. He summoned Sun Xi Yu, Han Ying Xue and the rest of his party of 10 over to his current location.</p><br/><p>\"Little Yang! You’re my savior! You really are!\" Fatty Han was crying in tears when he arrived, \"Xiao Wei did not seem like a clumsy girl at all! But after guiding her for 3 days in the game, I’m going mad! I’m very grateful that you pulled me here! Or my *ss would be ‘flowerishly’ ravaged by arrows!\"</p><br/><p>Lost Dream was shocked to hear it as he spoke in a weird pitch, \"Did you find yourself a girl, or a dominatrix...for you know...some recreational..hmm?\"</p><br/><p>\"Haiyah!\" Fatty Han let out an exasperated sigh again before he continued to speak, \"Well, Xiao Wei became a Hunter just like I did. But the tragic thing about it, is that she doesn’t even know how to choose a target! She had already penetrated my *ss multiple times, more like a hundred times in just three days! If her level was not that low, I might have been killed many times over already!\"</p><br/><p>\"Noob tank, looks like you have found yourself a big boss!\" Wei Yan Er looked at the boss with gleaming eyes. Tightening her grip on the handle of her battle axe, she asked, \"You must drop a Mythical Tier Axe for me, or I’m gonna bite you and shred you into pieces!\"</p><br/><p>There were as many as eight entry-level maps in the Chaos Realm. Although maps like Tibanya Wasteland were the more basic of maps with a level gap ranging from 100 to 130, it was already far larger than anything the players had ever encountered, pre-Chaos Realms! Many high leveled Mythical Tiered bosses roamed all over the maps, but without any lead from any quests whatsoever, it would still be like searching for a needle in a haystack.</p><br/><p>Therefore, everyone was excited to see a Mythical Tier boss standing right in front of their eyes!</p><br/><p>According to the rules of the Chaos Realms, every epic equipment dropped from a boss would have a Special Effect that reduces the Required levels of equipping by 20 levels. If a boss happens to be level 125 and drops a level 120 equipment, players would already be able to equip them when they reach level 100. That would grant players an early headstart!</p><br/><p>That was also one of the many reasons Zhang Yang had gathered all of his core members of Lone Desert Smoke and set them on the task of clearing the Hardcore Mode of the Dragon Throat Fortress, as he focused on finding and slaying Open-World bosses at the same time! After equipping a set of Level 120 Mythical Tier equipment, players could really make up for most of the difficulties, oppressing a Level 110 Violet-Platinum boss with high level equipment.</p><br/><p>\"Everyone! Stay in position! We’re about to cut open this boss!\" Zhang Yang shouted out loud to his party members.</p><br/><p>\"There must be an Axe! Give me an Axe!\" Wei Yan Er was repeatedly wishing for an axe.</p><br/><p>Zhang Yang could not help but to laugh at her. Then, he began to charge towards the boss.</p><br/><p>{Spear of Obliteration}!</p><br/><p>‘-28992!’</p><br/><p>With the little brat’s {Strength Aura} that added 12% Strength to everyone within its effective range, Zhang Yang had gained quite a boost. His normal attacks could almost cause up to 30,000 damage! His {Spear of Obliteration} went straight through the Defense of the boss and caused a substantial amount of damage to it!</p><br/><p>Zhang Yang no longer need to keep count on how much aggro each of his Skills could score for him. His damage output topped over every single one of his party members at the moment. His current damage output was even higher than the sum of both Wei Yan Er and Sun Xin Yu’s damage output! He definitely had the aggro that a tank would need!</p><br/><p>\"I hate you! Noob tank! How could you snatch the Class S [Inheritance] from me! It was supposed to be mine!\" Wei Yan Er could not help herself anymore as she began to wail. Every single Class S [Inheritance] was unique, and only one person could have it. So, the little brat no longer stood a chance to acquire the [God of War Inheritance]!</p><br/><p>\"Haha! Now, now. Calm down. The Class A [Inheritances] are actually more powerful than you think. The power they can give can actually be almost as powerful as the Class S [Inheritance]. You know, almost!\" Zhang Yang quickly tried to calm the little brat. Well, you would never know what kind of frightening things Wei Yan Er would actually do when she goes crazy!</p><br/><p>\"Chi! Ji ji ji!\" The Blood Spider Queen stuck up its butt all of a sudden. Then it began to shoot 23 poison projectiles of venom towards the gang. This was a boss after all. The venom spatted out was very different from those of the elite Tier Blood Spiders. It wasn’t green in color, instead, it was the color of blood! The goo-ish venom was sprayed onto the gang as it caused 30,000 basic damage to each of them. The venom had also reduced the movement speed of the gang, Felice and that annoying whiner of a Battle Companion.</p><br/><p>This was the boss’s {Virulent Venom Blood}!</p><br/><p>The boss was already going all out from the beginning!</p><br/><p>Han Ying Xue and Fantasy Sweetheart quickly took up their staffs and began getting to work. However, their healing targets were not just the 10 of them, there was also everyone’s Battle Companions and the Pets of Zhang Yang, Fatty Han and Hundred Shots! So, they had to focus on healing a total of 23 targets! The stress was tremendous!</p><br/><p>Fortunately, the Battle Companions of Endless Starlight and Lost Dream belonged to the Healer category. They could heal themselves up and give some healing support to everyone as well. Their support had also lifted some weight off the shoulders of the two Healers. Furthermore, the Healers had decisively given up on some of the not-so-effective Battle Companions in the battle. The Hunters could also heal up their own pets. Therefore, after some adjustment over the chaotic situation, the Healers finally healed up the HP of the entire party.</p><br/><p>Just when the two ladies thought they could take a step back and catch their breaths, the boss stuck up its butt again! It’s the 23 projectiles of dark-red goo-ish venom, once again! Everyone suffered a high value of damage, and their HP bars were reduced sharply, again!</p><br/><p>Zhang Yang quickly said, \"Everyone with ranged attacks, get 40 meters away from the boss! We shall take turns to attack! Into formation!\"</p><br/><p>It was impossible for the two ladies to be focused on healing Zhang Yang and the rest of the party, Zhang Yang knew that he had to lighten the load for the Healers. Zhang Yang had arranged the party to be split into smaller groups in order for the Healing to be manageable.</p><br/><p>The attacks of the Blood Spider Queen were terrifying and violent. Its normal attacks could cause up to 32,000 damage! Fortunately for Zhang Yang, he was no longer the Zhang Yang of old. With his {God of War Shield} adding 20% Passive Damage Immunity, the attack of the boss could only cause about 15,000 damage on Zhang Yang. Practically speaking, the normal attacks of the boss could only cause about 5,000 damage to Zhang Yang per second, thanks to the regular usage of his [Block]!</p><br/><p>However, this gigantic spider had a wide array of skills! Its {Virulent Venom Blood} was basically activated once every 10 seconds. Although the boss did not really use its {Armor Piercing Skewer} that often, but the gang could not risk underestimating the amount of damage that particular Skill was capable of! After all, that one Skill could deal about 8,000 damage in every passing second!</p><br/><p>If Zhang Yang was the only one that Han Ying Xue and Fantasy Sweetheart needed to heal, the two ladies would definitely prevail in their role, even after the healing efficiency of Healers had been nerfed by the developers. Their equipment was powerful enough, and their special Skills allowed them to heal more efficiently and effectively. However, the boss did not just focus it’s attacks on Zhang Yang. The {Virulent Venom Blood} of the boss was an AoE Skill. Every time the boss activates that Skill, everyone within the Skill’s effective range would suffer. The two ladies had their heads scourged as they were busy maintaining the HP bars of the party members. They were the most exhausted of all players in the party!</p><br/><p>\"Wah! I’m going to remove my Class and retrain another one! I don’t want to be a Healer anymore!\" Han Ying Xue was flustered.</p><br/><p>Zhang Yang laughed out loud at her and said, \"It would be such a shame for you to quit as a Healer! Look the ‘capacity’ of your udders!\"</p><br/><p>\"Bus Tart!\" Han Ying Xue rolled her eyes at Zhang Yang. She mouthed something in silence, glaring at Zhang Yang. Only Zhang Yang saw what she ‘said’, \"You’re not getting any sleep tonight!\"</p><br/><p>Pak pak pak!</p><br/><p>The moment the HP bar of the boss was reduced down to 20%, the Blood Spider Queen turned its back on Zhang Yang and went on to produce a long row of white, egg-like objects across the ground. Each of those objects were about half the size of a regular human! The eggs twitched about, as if they were alive.</p><br/>\n</div>"}