{"title": "Chapter 563: Blackbeard Ditch", "id": 563, "volume": 6, "url": "http://boxnovel.org/mmorpg-rebirth-of-the-legendary-guardian-chapter-563-blackbeard-ditch", "volume_title": "Volume 6", "body": "<h1>Chapter 563: Blackbeard Ditch</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 563: Blackbeard Ditch</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Since Zhang Yang had activated his {God of War Transformation} Skill, he basically did not require Han Ying Xue to heal him at all. The ‘Transformation’ Skill boosted him with an additional 75% HP. He also got to use his {Shield Wall} once, every two and a half minutes. Those circumstances should be enough to keep him alive well enough until they slay the boss!</p><br/><p>Unfortunately, the [Titan Chest Plate] was only a Level 80 Violet-Platinum Tier equipment. The special effect of the piece had begun to deteriorate after he reached Level 100. When he is able to reach Level 110, the special effect should get deteriorated even more because of its attributes that are based on percentage ratio. After all, this [Titan Chest Plate] was merely a knockoff instead of a Godly equipment.</p><br/><p>Still, the boss was not easy to deal with. The {Light and Shadow Transformation} provided the boss the special attributes to reduce any Physical Damage that he receives by 50%. Since Zhang Yang and Wei Yan Er mostly relied on Physical attacks, they were having a difficult time in bringing down the HP bar of the boss. The {Motion of Lightning} was even more irritating. This Skill was basically similar to the Skill {Block}. It could allow the boss to dodge against any form of attacks --- other than Skills that state otherwise, for instance, the Skill {Killing Cleave}.</p><br/><p>Furthermore, the cooldown period for the {Motion of Lightning} was extremely short. The boss could actually use it once every 10 seconds!</p><br/><p>Sometimes, when the boss was lucky enough, he could dodge 3 to 4 attacks at the same time with the {Motion of Lightning}, giving the party a hard time!</p><br/><p>Fortunately, Zhang Yang was also insanely powerful in his {God of War Form}. The boss was no threat to him. So it is only a matter of time before they bring down the boss.</p><br/><p>\"You imbeciles never stand a chance against me!\"</p><br/><p>\"I am invincible!\"</p><br/><p>\"Allow me to crush your skulls with my might!\"</p><br/><p>The HP bar of the boss reduced rapidly as he constantly roared. In less than 20 minutes, he was close to dying.</p><br/><p>\"Haha! A super boss should drop something nice!\" Wei Yan Er could no longer hold her greed back. She actually went up to the boss and tried to dig around his pockets!</p><br/><p>Zhang Yang could not help but to wonder, would this little brat still probe her husband’s ever single pocket for money, every single day after she gets married?</p><br/><p>Zhang Yang’s imagination started going wild. He suddenly had an urge to use a time-travelling device to take a peek on how the little brat would do in the future, 10 years from now.</p><br/><p>\"No! No! This is impossible!\" Light was struggling for his life. His rate of activating the {Motion of Lightning} increased by a notch. He could use it once every 5 seconds now! Most of the super Skills that Zhang Yang and his ladies cast missed their target.</p><br/><p>Zhang Yang let out an angered cry and activated his {Indiscriminate}. With a full Rage bar ready for use, he activated his {Killing Cleave} in an attempt to end the boss once and for all!</p><br/><p>‘-422,986!’</p><br/><p>{Killing Cleave} was unblockable and undodgeable! The {Indiscriminate} ensured that every single hit that landed on a target with HP bar lower than 20% would surely be a Critical Strike for 10 seconds!</p><br/><p>Unfortunately, the boss had that one special attribute to reduce any Physical Damage received by 50%. Although it was a Critical hit, the {Killing Cleave} only caused half of its potential damage. The Critical Hit was completely nullified!</p><br/><p>Still, that damage was no small amount. A damage of 420,000 would be more than 1% of his HP bar! He only had about 2% HP left, and this strike had almost ended him! Now, Light only had about 1% HP left!</p><br/><p>{Dance of the Heaven and Earth}!</p><br/><p>The little brat could not stand letting Zhang Yang triumph over the boss all by himself. So she activated her super Skill to end the battle.</p><br/><p>Upon entering the Chaos Realm, there was a tremendous increase in the amount of HP for both players and bosses. An amount of 100,000 damage was once a great deal, but it no longer had such power in the Chaos Realm. The Basic Damage of Zhang Yang’s {Indiscriminate} alone could already reach up to 400,000 damage, without it being a Critical Hit!</p><br/><p>With a swift {Killing Cleave} from the little brat, the last drop of HP was taken out. He let out a miserable cry and collapsed onto the floor of the cabin. The loot burst out of his body like a ruptured water balloon.</p><br/><p>Zhang Yang did not waste any single second. He quickly said, \"Little brat will stay behind and pick the stuff up. The rest of us will head on! We can take a look at the loot while on the move!\"</p><br/><p>He had already set the Item Distribution mode to All-Pick.</p><br/><p>Of course, Wei Yan Er had no beef with that, and she made her way to the items and picked them up with joy.</p><br/><p>The party then charged on to the fourth floor of the cabin. Since Zhang Yang had already activated his {God of War Transformation}, the party did not have to hold anything back. Instead, they charged forward with everything that they had in attempt to blitz through the floor. Zhang Yang lured a large number of pirates into one spot and activated his Skills repeatedly. Upon activating {God of War’s Crushing Strike}, {Horizontal Strike}, {Thunder Strike}, and the triggering of the special effect of his {Sword of the Purging Devourer], Zhang Yang was hitting the monsters as hard as a tsunami! In just a brief moment, the pirates were all wiped out, and the party gained a substantial amount of experience points.</p><br/><p>Wei Yan Er had also begun to post the attributes of the loots one by one. She said, \"The boss had dropped a total of 2 Mythical Tier equipment, 3 Violet-Platinum Tier equipment, two [Skill Books], and a piece of a fragment for an [Inheritance]. So which one do you guys want to start with?\"</p><br/><p>Zhang Yang was swinging his sword about as he spoke, \"Forget about the Violet-Platinum Tier equipment. We cannot afford to wait until we’re all Level 130 just to equip them. Let’s look at the Mythical Tier equipment first. We will move on to the [Skill Books] after that. Since that the [Inheritance] is just a Class B, I’ll assume that none of you would want it. So let’s just forget about it too!\"</p><br/><p>\"You really are hard to please!\" Wei Yan Er shrugged and said, \"Well, I’m an easy going person after all. Fine, fine I’ll please you.\"</p><br/><p>She looked into her inventory and moved her hand around. Then, she took out a piece of equipment and posted its attributes. It was a cute pair of pink panties. However, this panties would not be visible if the player equipping it is also equipped with a Chest Plate or a Robe.</p><br/><p>[The Flowery Panties of Light’s First Love] (Mythical, Cloth Armor)</p><br/><p>Defense: +32</p><br/><p>Vitality: +1,926</p><br/><p>Intelligence: +905</p><br/><p>Spirit: +393</p><br/><p>Equip: Increases Maximum HP by 3,800 points.</p><br/><p>Equip: Increases Maximum MP by 1,800 points</p><br/><p>Equip: Increases both Damage and Healing Efficiency by 3.5%.</p><br/><p>{Unidentified}</p><br/><p>Required Level: 130</p><br/><p>Special: Reduces 20 levels of the Required Level.</p><br/><p>Note: There’s nothing that Light can’t steal.</p><br/><p>The attributes of this equipment were top Tier. It even had additional Maximum HP, additional Maximum MP, and also large increase in Damage! This equipment also reduced 20 levels from its Required Level. Based on its attributes alone, this panties was almost perfect in all aspects!</p><br/><p>However, the name of this equipment was also one strong reason that Han Ying Xue and Daffodil Daydream were frowning hard upon seeing it!</p><br/><p>\"Cousin sis, Daffodil! Which one of you will take this?\" Wei Yan Er asked.</p><br/><p>The two ladies hesitated for a moment. It was powerful, and based on that alone, there was no reason to decline it. However, the name alone was repulsive enough! Well, this was a second-hand good after all. Furthermore, it had been stolen and stowed away by a wretched middle-aged man for god-knows how long. Only god knows what he would have done with it, or if he had worn it himself!</p><br/><p>Zhang Yang laughed at the two ladies and he said, \"You two just toss for it. Whoever loses, take the equipment!\"</p><br/><p>The two ladies nodded. After tossing for it, Daffodil got a smaller roll. She was forced to keep the panties.</p><br/><p>If other players were to see how the two ladies were pushing away such a great pair of panties, they would definitely be frowning hard! The name was the only issue there! They could have just ignored that aspect! It was a Level 130 Mythical Tier equipment after all. The best part about it was that players could already equip it when they reach Level 110! It should be one of the most powerful equipment for players around Level 110!</p><br/><p>Wei Yan Er moved on to the second equipment and post its attributes up. Then, she suddenly said, \"This is mine, noob tank! Don’t you dare snatch it from me!\"</p><br/><p>[Light Beam Protector’s Greaves] (Mythical, Heavy Armor)</p><br/><p>Defense: +160</p><br/><p>Vitality: +2,012</p><br/><p>Strength: +931</p><br/><p>Agility: +340</p><br/><p>Equip: Increases Maximum HP by 4,000 points.</p><br/><p>Equip: Increases both Damage and Healing Efficiency by 3.5%</p><br/><p>Equip: Absorbs 384 Damage when struck.</p><br/><p>{Unidentified}</p><br/><p>Required Level: 130</p><br/><p>Special: Reduce 20 levels from the Required Level.</p><br/><p>A high Tier equipment that boosts Attack and Defense at the same time! Even though one could not see whether this equipment was more to Offense or Defense, it would still be a powerful piece!</p><br/><p>The trousers Zhang Yang had was also a Mythical Tier equipment, along with a Level 120 Mythical Tier Greaves. Although the Greaves was 10 levels lower than the [Light Beam Protector’s Greaves], the difference between the attributes of these two equipment were not really that much. Therefore, he did not intend to fight the little brat. He only nodded and agreed to let the little brat have it.</p><br/><p>Wei Yan Er gave a sweet smile at Zhang Yang and said, \"That’s more like it! I shall put more good words about you to Cousin sis, so that she will be more gentle with you!\"</p><br/><p>\"Of course, it’s necessary!\" Zhang Yang laughed out loud.</p><br/><p>Han Ying Xue stared at the little brat incredulously, and she said, \"Am I not gentle?\"</p><br/><p>\"We haven’t even taken a look at the [Skill Books] yet!\" Wei Yan Er switched the topic by waving a book with a red hard cover about. She threw it over to Zhang Yang, \"Now this is yours, noob tank!\"</p><br/><p>[Skill Book: Superior Thunder Strike]</p><br/><p>Use: Teaches you the {Strengthened Thunder Strike}.</p><br/><p>Required: {Thunder Strike}</p><br/><p>Required Level: 100</p><br/><p>Thunder Strike was basically an exclusive Skill that only Guardians had. Since Wei Yan Er couldn’t learn the Skill for her own usage, she generously gave it to Zhang Yang without hesitation.</p><br/><p>Zhang Yang immediately took the [Skill Book] and held it against his body. He had not heard of this Skill before. So, he learned it to find out what the Skill could do.</p><br/><p>[Superior Thunder Strike (Passive)]: Strengthens your {Thunder Strike}, increasing your Movement Speed Reduction rate up to 90%. Duration is extended for another 10 seconds. However, the target will regain 10% movement speed every second. Within the period of time, the target has a 1% chance to experience a \"Torn Hamstring\" effect. When the target does so, the target will not be able to move at all for 5 seconds.</p><br/><p>Awesome! This Skill should be useful!</p><br/><p>This Skill only acted as a strengthening factor to his {Thunder Strike}. Zhang Yang did not have to spend additional rage points and wait for Global Cooldown among Skills. Upon learning this passive Skill, he would still be using his {Thunder Strike} as per usual, however, it would have more powerful effects on his targets. That would make him even more powerful!</p><br/><p>\"So what’s the other [Skill Book], then?\" Han Ying Xue was looking at the little brat, her eyes glittering.</p><br/><p>\"Hmm... unfortunately, this one is not yours as well... cousin sis.\" Wei Yan Er shook her head and took the other [Skill Book] out from her inventory. Then she said, \"This one is for sister Daffodil!\"</p><br/><p>After receiving the [Skill Book] from the little brat, Daffodil Daydream tapped it on her and learned the Skill. That was also an ‘Enhancement-type’ [Skill Book]. After she had learned the Skill, she posted it onto the party channel.</p><br/><p>[Superior Explosive Flame]: When your {Explosive Flame} causes damage, you will gain an additional effect. Increases your next chanting speed by 50%. Lasts for 3 seconds.</p><br/><p>{Explosive Flame} has a 10-second cooldown period. So, the user could increase their next chanting speed for their next spell by 50%, every 10 seconds. Although it wasn’t really some sort of super powerful Skill, Pyromancers and Spellcasters used this Skill quite often. Furthermore, it was like a free enhancement to a user of {Explosive Flame}. Why would players with the Skill wouldn’t want it then?</p><br/><p>Although Light was a Mythical Tier boss, the [Inheritance] he dropped upon his death was merely a Class B [Inheritance]. However, Zhang Yang and the two ladies were amazed by it. Only Wei Yan Er was feeling discontented as she continued to complain. She really wanted a Class A [Inheritance], after all.</p><br/><p>The moment they were done distributing the loots, the party was almost done clearing up the monsters on the fourth floor. Soon after, the four of them finally arrived right in front of the final boss, Blackbeard Ditch.</p><br/><p>This heavily-bearded man was scratching his ears and cheeks in anxiety. At the same time, he was tossing and turning the Treasure Map around, gazing at it intently. He would put it on the table for a while, and then toss it into the air just to see what would happen. It seemed that he had not discovered the secrets that were hidden in the map, as he looked annoyed and anxious at the same time.</p><br/><p>[Ditch, Leader of the Blackbeard Pirates] (Mythical, Humanoid)</p><br/><p>Level: 130</p><br/><p>HP: 130,000,000</p><br/><p>Defense: 5,560</p><br/><p>Attack: 40,204 - 52,204 (Determined as Physical Attack, but cause Shadow Damage)</p><br/><p>Skills:</p><br/><p>[Blastoff]: Quakes the ground, causes 50,000 Physical Damage to all targets within the range of 40 meters radius.</p><br/><p>[Darkness Transformation]: Transforms into the form of Darkness. Increases 50% Shadow Damage. Immune to all Shadow Damage and Shadow Skills. Reduces 50% Physical Damage received.</p><br/><p>[Devouring Darkness]: Devours all targets within the range of 40 meters radius and digests them. Players must kill the Blackbeard Ditch’s Illusion that spawns before then, in 30 seconds. If they succeed, they can escape the Darkness, causing 100,000 Damage to Ditch. If the players fail, they will die immediately, healing Ditch by 1% of his maximum HP.</p><br/><p>[Dark Arrow]: Randomly attacks a target in range, causing 40,000 Shadow Damage to the target. Range: 3 - 40 meters.</p><br/><p>Note: This is the Captain of the Blackbeard Pirates, the man that sails fearlessly across the boundless seas, unanimously agreed upon the sole holder of the adjective - ‘Brutal’! Ditch is the user of the Dark-dark Fruit, he has the special power to control Darkness.</p><br/><p>\"100 million HP!\" The four of them glared intensely.</p><br/><p>Because the boss had the Skill {Devouring Darkness}, he had a chance to recover 1% of his HP every time one player falls to his {Devouring Darkness}. It was a total amount of 1,300,000 HP that the boss could heal! So, how difficult would Blackbeard Ditch’s Illusions be, then? If the game has made it too powerful, then the boss would be invincible!</p><br/><p>At that moment, the {God of War Transformation} of Zhang Yang would expire in 36 minutes.</p><br/><p>Thanks to the {God of War Transformation}, the total amount of DPS Zhang Yang could reach was about 100,000 damage. However, because the boss had the ability to reduce 50% on the Physical Damage that he receives when he is in his {Darkness Transformation} form, Zhang Yang could only deal about 50,000 damage in every second. It would still require about 43 minutes to empty out the total amount of 130,000,000 HP that the boss had on him.</p><br/><p>But, they still had a shot at killing the boss within 36 minutes. That being said, Zhang Yang's [Glare of the Death God] would have to be successfully activated. Furthermore, upon entering the critical stage of the battle, Zhang Yang's Attack would dramatically increase when the HP of the boss drops below 20%. The rest of it would depend on the other party members. None of them knew exactly how dangerous and powerful the {Devouring Darkness} was!</p><br/><p>Furthermore, if the rate of activating {Blastoff} was too high, then Han Ying Xue would have trouble healing up everyone. Only Zhang Yang would not require her attention. He had his {Shield Wall} to heal himself.</p><br/><p>Zhang Yang gave some thoughts about it, then he said, \"When you are hit by the boss’s {Blastoff}, just retreat immediately. Don’t go back to hit the boss before your HP is healed back to full. If the cooldown of this {Blastoff} is brief, just stay away until we figure it out.\"</p><br/><p>{Blastoff} could cause 50,000 Damage. Even though Zhang Yang had an abundance of HP, he could not sustain more than a few strikes from that Skill, if he was not in his {God of War Transformation}.</p><br/><p>To kill a super boss, one must summon a large number of players to do it!</p><br/>\n</div>"}