{"title": "Chapter 562: ‘Light-Speed' Light", "id": 562, "volume": 6, "url": "http://boxnovel.org/mmorpg-rebirth-of-the-legendary-guardian-chapter-562-%E2%80%98light-speed-light", "volume_title": "Volume 6", "body": "<h1>Chapter 562: ‘Light-Speed' Light</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 562: ‘Light-Speed' Light</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Only one person would reject such great gifts.</p><br/><p>Zhang Yang shoved the [Inheritance] fragment into his inventory with joy. The only disadvantage was that this fragment must be carried along with him. He could not put it in his bank or the warehouse of his guild. That would take up one precious slot in his inventory for a period of time.</p><br/><p>If One Sword Stroke and his other fellow ‘friends’ ever knew about this ‘ordeal’, they would definitely give Zhang Yang a good beating! Who would be unhappy about having part of their inventory taken up by treasures?</p><br/><p>\"Sigh... what a stingy boss... just like noob tank over there. He didn’t drop anything good for me. No good equipment, and not even a single [Skill Book]. Stingy!\" Wei Yan Er was scolding the dead boss and ostensibly criticizing Zhang Yang, with her hands planted on her waist. Zhang Yang was annoyed to hear that coming from the little brat and ground his teeth together.</p><br/><p>The four of them then proceeded through stairs as they made their way to the third floor of the cabin. They just had to defeat one more general before facing the final boss - Blackbeard Ditch. Since his generals were all Violet-Platinum Tier, Blackbeard Ditch had to at least be a Mythical Tier boss!</p><br/><p>The third floor of the cabin was basically identical to the previous floor. Other than a bunch of filthy pirate monsters, there was still a bunch of Parrots. The four of them slashed their way through the floor. The little brat was getting addicted to slashing up the monsters. She even leaped into the air, her eyes cold and glowing evil red.</p><br/><p>Zhang Yang nervously sent a private message to Han Ying Xue. He said, \"Little brat is turning into a total maniac. I'm worried for her future husband.\"</p><br/><p>\"Hey hey hey! Don’t you dare have any ideas!\" Han Ying Xue hissed. She was acting like a hen trying to protect its chick. \"If you dare to do anything on Yan Er, I shall ‘snip’‘snip’ you!\"</p><br/><p>Zhang Yang could feel a chill running up his spine. He liked the little brat, but as a younger sister figure, not the romantic kind of love! Furthermore, the little brat was a little slow and immature. Only god knows when she would grow up. So, why the rush then?</p><br/><p>\"Rest assured, even if I become a 100 year-old hoodlum, and even if little brat is the last female on earth, I will never have any ideas on her!\" Zhang Yang swore as earnestly as he could, \"Happy now?\"</p><br/><p>\"Humph! Only an idiot would really feel more relieved after hearing those cliché lines! I better stop the little brat from coming home so frequently!\"</p><br/><p>\"...why do I have a feeling that you're not telling me everything. It's like you have something else in mind...or someone else? Oh, haha! You must be jealous of the Zhao Sisters! Wait, you don't want the little brat bringing them to our home, right? What the hell! Why take such a roundabout fashion there? You could have just told me straight! You really took me for a ride there!\"</p><br/><p>As they were having their 'sweet' talk, the party rushed forwards like a hot knife cutting through butter. They had no fears or worries of crossing swords with Elite Tier monsters. Their power turned tons of monsters into tons of experience points. Each of their experience bars were rising up at an unrealistic rate.</p><br/><p>More than two hours later, they stood before the third boss.</p><br/><p>Unlike the previous two bosses, this boss was called ‘Light’. He had a tall and slender body, so slender that he could pass off as a skeleton in the dark. He wore pale-yellowish clothes. More importantly, he stood on the ground like a bamboo pole. He looked like he was in his mid 30s, with two small whiskers above his mouth. Wearing a pair of brown-tint glasses, he looked wretched.</p><br/><p>[‘Light-Speed' Light] (Mythical, Humanoid)</p><br/><p>Level: 130</p><br/><p>HP: 39,000,000</p><br/><p>Defense: 5,560</p><br/><p>Attack: 31,653 - 37,653 (Determined as Physical Attack, but causes Fire Damage)</p><br/><p>Skills:</p><br/><p>[Motion of Lightning]: Moves to another place in an extremely short period of time. That is enough for him to avoid most attacks!</p><br/><p>[Light and Shadow Transformation]: Transforms into ‘Light and Shadow’. Increases 50% Nature Damage dealt. Immune to all Nature Damage and Nature-based Skills received. Reduces 50% Physical Damage received.</p><br/><p>[Ray of Fatality]: Fires a deadly beam and causes 40,000 Nature Damage to the target. With the target as the central point, fires countless beams into the surrounding, causing 40,000 Nature Damage to all targets within the range of 20-meter radius.</p><br/><p>Note: One of the three generals under Blackbeard Ditch. The user of ‘Shadow and Light’ Devil Fruit. Has the power to control light.</p><br/><p>A Mythical Tier boss!</p><br/><p>A Mythical Tier boss before the final boss? Furthermore, this boss would also probably drop a fragment for the [Light and Shadow Inheritance]. However, Zhang Yang could not remember from his previous life on whether this [Inheritance] was Class A or Class B.</p><br/><p>But there was one thing he was very sure of. When the core players of the guild get their hands on these high Class [Inheritance], Lone Desert Smoke could really lay the first brick to becoming the real and powerful Number One guild in the China Region, or even Number One in the entire world!</p><br/><p>When it really goes down to that, Zhang Yang could launch a direct assault on any large Region that irks him! With a large number of players activating their {Inheritance Transformation} Skills at the same time, they could really level down an entire empire within days! They could just lay waste to that particular Region and interrupt them in their leveling progress!</p><br/><p>\"Silly Yu, that’s a Mythical boss!\" Han Ying Xue prodded Zhang Yang’s back with her fingers as she spoke softly.</p><br/><p>\"Stop acting cute! It doesn’t suit your style!\" Zhang Yang smiled, \"Should we summon Fantasy Sweetheart and the others over, or should I just activate my {God of War Transformation} Skill for this guy?\"</p><br/><p>\"Just activate your {God of War Transformation}. This boss can release AoE attacks like how electricity spreads. If we clump the area up with more people it’ll be harder dodging them.\" Han Ying Xue said.</p><br/><p>Zhang Yang gave it some thought. His {God of War Transformation} could last for 2 hours. After killing the boss, they would still have to clear the monsters on the fourth floor. If the number of the monsters are as many as it was on the third floor, then they should be able to push on much quicker under the support of his {God of War Transformation}. The ‘Transformation’ should still last for another 30 minutes when they reached the final boss - Blackbeard Ditch.</p><br/><p>That should suffice!</p><br/><p>Zhang Yang summoned Whitey out from his inventory. Although this Yellow-Gold Tier [Mount] could only provide very limited support in contrast to the powerful party, the boss had immunity against all Nature-based damage. Thunderhawk would be helpless against the boss. Zhang Yang would have to use Whitey in that battle. So he nodded and said, \"I’m starting the battle.\"</p><br/><p>Upon activating his {God of War Transformation}, streams of light, in 7 different colors began to radiate from the back of Zhang Yang, as a pair of magnificent wings sprouted out of his back. He levitated into the air grandly. Han Ying Xue and Daffodil Daydream were completely mesmerized by the Zhang Yang’s appearance.</p><br/><p>Only Wei Yan Er was criticizing Zhang Yang that his wings were not real, as she continued to blame Zhang Yang for betraying her and snatching away her [Inheritance].</p><br/><p>Shoof!</p><br/><p>Thanks to his {God of War Transformation}, Zhang Yang’s movement speed had exceeded the speed of many [Flying Mounts]. In just a blink of an eye, he had arrived behind the boss. Swinging his [Sword of Purging Devourer], he drew first blood.</p><br/><p>\"What a daring devil you are. You actually dare to defy me and use your weapon against me!\" Light was speaking at such a slow pace that people would feel anxious listening to him. However, his movement speed was actually faster than the movement speed of Zhang Yang. In a flash, he had moved at a spot, 10 meters away from Zhang Yang.</p><br/><p>That should be the {Motion of Lightning} of the boss. It did not bring shame to the word - ‘Lightning’.</p><br/><p>Light raised up his index finger as light started to gather around the tip of his index finger. The light formed into a chicken-egg-sized light ball. With a phew, the ball of light went straight at Zhang Yang!</p><br/><p>{Spear of Obliteration}!</p><br/><p>Zhang Yang immediately raised his right arm. He then threw out the sword from his hand, which later formed into the shape of a spear and went right through the middle of Light’s chest. He did not flinch in the face of the oncoming laser.</p><br/><p>Obviously, the {Motion of Lightning} of the boss also had a cooldown period. If that was not the case, no one would stand a chance against this boss. When that strike from the {Spear of Obliteration} landed on the chest of Light, blood oozed out from the stab wound and it caused 108,922 damage to Light. Although Light attempted to dodge the attack, he failed to do so, as he could not use his {Motion of Lightning} at that particular moment.</p><br/><p>Meanwhile, Zhang Yang had already raised his shield and held it up in front of him. With his {Block} activated, ‘Clang!’, the beam of light was deflected away and pierced a hole the size of a fist in a wall. There, the beam vanished.</p><br/><p>\"You imbecile!\" Light had taken a hit which he had not expected it. He finally started to turn serious. A beam of light flashed across the eyes behind the pair of brown glasses. A golden light flashed across the body of the boss, and turned the body translucent!</p><br/><p>The boss had activated his {Light and Shadow Transformation}!</p><br/><p>Every boss in this place was ferocious and deadly! Unlike the bosses they had encountered before in other maps, they would already activate their ultimate Skills the moment the battle begins. The other bosses would only activate their ultimate Skills, such as {Berserk} when their remaining HP drops to 20% or 10%. With these bosses using their powerful Skills the moment the battle begins, players would surely struggle against them!</p><br/><p>But, who should be afraid now?</p><br/><p>Zhang Yang had a Class S {God of War Transformation} Skill!</p><br/><p>With a wave of his hand, he threw the {Glare of the Death God} straight at the boss. This time, the god had eyes for Zhang Yang. The {Glare of the Death God} was finally not resisted by the boss!</p><br/><p>\"What is this!\" Light let out an angry roar as he realized that there was a wretched-looking dark skull forming at the top of his head.</p><br/><p>Zhang Yang and the ladies began to unleash hellfire upon the boss. Because the boss was affected by the {Glare of the Death God}, they were only focused on hitting the boss as many times as possible, regardless of the damage. </p><br/><p>‘- 390,000!’</p><br/><p>‘- 390,000!’</p><br/><p>...</p><br/><p>The three DPS players, two Battle Companion, and one [Mount] surrounded the boss as they launched their assaults at the boss as aggressively as possible. Although the rate of triggering the special effect of the {Glare of the Death God} was as low as 10%, they still managed to trigger it several times in a row! Light was receiving a series of damage that reached up to 390,000 damage! Furthermore, these damage were directly inflicted upon the boss. It would still be futile even if the boss activates his {Light and Shadow Transformation}.</p><br/><p>That felt way too good!</p><br/><p>\"Now this is what we called a ‘Boss-Killer’ Skill!\" Daffodil Daydream praised.</p><br/><p>Zhang Yang, sighed, saying, \"It would have been great if the rate of resisting the Skill would be more kind.\"</p><br/><p>\"When things are already so good, you should stop asking for more! Theoretically speaking, if you can last for 10 hours against the assaults of a boss, even if the boss is a Celestial Tier, they would still be taken out by this {Glare of the Death God}. If their rate of resisting is not high, then what is the point of bosses and tiers, then?\" Han Ying Xue was surprisingly rational.</p><br/><p>\"You bastards!\" Light let out a thunderous shout that shook the sky in rage. The battle had just begun not long ago, and the boss had already been dealt heavy damage. He was very mad and pointed at them with his index finger. A blinding beam of light shot from the tip of his finger. It went right through the body of Wen Yan Er.</p><br/><p>--- {Ray of Fatality}!</p><br/><p>Instantly, the little brat received 40,000 damage from that strike. Then, countless beams of lights shot out from her body.</p><br/><p>Even though Zhang Yang could fly, he could not outrun the Skill. He was struck by one of the beams and received 40,000 damage, just like Wei Yan Er. But, with his {God of War Shield} activated, his Passive Damage Immunity had reached 40%. Together with the other of Damage Absorption abilities of his equipment, Zhang Yang only received a total of 21,114 damage.</p><br/><p>That 20,000 damage was a mere fraction of his 5,380,000 HP.</p><br/><p>Han Ying Xue, Daffodil Daydream and Felice were attacking from the rear, using most of their ranged attacks. They were not caught up in the spread attack of the {Ray of Fatality}. However, Whitey, Wei Yan Er and the other battle companions could not avoid their fate. Without the {Iron Build} to boost its Maximum HP, Whitey only had over 36,200 HP, even when with the blessing of {Vitality Aura}. It was instantly killed!</p><br/><p>The Battle Companion of Wei Yan Er was only a Yellow-Gold Tier. Without having any Violet-Platinum equipment on, Reina’s HP was even lesser than the total HP of Whitey. She was also instantly killed.</p><br/><p>However, they could not contribute much in providing more damage output to the firepower of the party in the first place. That was not their main purpose anyway. They were there to trigger the special effect of the {Glare of the Death God}. It did not matter if they were sacrificed while trying to accomplish the main goal!</p><br/>\n</div>"}