{"title": "Chapter 576: Queen of Blades", "id": 576, "volume": 6, "url": "http://boxnovel.org/mmorpg-rebirth-of-the-legendary-guardian-chapter-576-queen-of-blades", "volume_title": "Volume 6", "body": "<h1>Chapter 576: Queen of Blades</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 576: Queen of Blades</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>\"No! Leave! Wretched beings! You don’t belong in this world!\" cried Quesara as spotted Zhang Yang approaching her. She brandished her blade arms and slithered towards Zhang Yang.</p><br/><p>Even though the boss was classified as a melee attacker, her blades were several meters long. Zhang Yang was not sure of it, but he was certain that her attack range would be far greater than any ranged attacker!</p><br/><p>BUMG!</p><br/><p>Zhang Yang first raised his shield to block the incoming blade. With a long bang, the Thunderhawk and him were sent flying several meters away. If the Thunderhawk had not been a Violet-Platinum tier mount, Zhang Yang would most likely have been sent flying even further away.</p><br/><p>The Thunderhawk flapped his wings vigorously and shot towards the Queen of Blades. Zhang Yang brandished his sword and dealt a strong blow that caused the creature to wail in pain. With a quick thought, Zhang Yang activated {Glare of the Death God}.</p><br/><p>\"Come on…please work!\" Zhang Yang muttered as a shroud taking the form of a black skull appeared on the boss’ head. The skull grinned and seeped into the boss’ character.</p><br/><p>F*ck yea! No resistance! </p><br/><p>Everyone cheered and started to attack vigorously.</p><br/><p>‘-5,000,000!’</p><br/><p>‘-5,000,000!’</p><br/><p>…</p><br/><p>The skill – {Glare of the Death God} was a skill that would only work on a percentage basis. 10% of the boss’ 500,000,000 HP would be 50,000,000! The best part of it was that the skill is triggered by every hit!</p><br/><p>\"Such a powerful boss-killer skill!\"</p><br/><p>It was a skill that had come with the S class Inheritance!</p><br/><p>Zhang Yang felt extremely grateful since he had obtained the skill while completing the Inheritance. If he had killed the Black Dragon without undergoing the Inheritance quest, the skill book might not have dropped! It was a miracle for such a powerful anti-boss skill to exist. Such a miracle would not happen twice! The skill had to be a Unique skill. Like an S-class Inheritance, it would never appear again, ever!</p><br/><p>Then again, since there were five more S class Inheritances, that probably meant 5 more ridiculous Skills!</p><br/><p>\"Puny bugs! I will squash you!\" cried the boss.</p><br/><p>The Queen of Blades was surrounded from all angles. It had taken only 3 seconds to proc all 10 hits of the {Glare of the Death God}! For a normal Mythical boss, 5 million was more than their usual maximum HP. With 500 million HP, the boss would most certainly be enraged if 10% of her HP is hacked away within 10 seconds!</p><br/><p>\"WIIIIIIIII—\" The boss closed her mouth and sucked in a deep breath. She then let out a loud screech that shook the air around her. The resulting sound wave that spread out was so powerful that the waves were visible to the naked eye.</p><br/><p>Thud! Thud! Thud!</p><br/><p>Everyone was immediately stunned by the attack and stars circled above their characters. Each of them had taken different amounts of damage, but it was equivalent to 10% of their own HP.</p><br/><p>{Queen’s Roar}! A stunning skill that deals 10% HP as damage every second, for 5 seconds!</p><br/><p>The damage was calculated by percentages, and cannot be deducted by Defense nor damage absorption! It was almost equal to an AoE version of {Glare of the Death God}! It even had a stunning effect!</p><br/><p>What a pity, a player’s skill will never be as strong as a boss.</p><br/><p>Zhang Yang activated {Warrior’s Will} and managed to dispel the debuff on him by the second tick. Luckily, the skill had a maximum limit of 20,000 damage per tick. The amount of damage was not too high, both of which Han Ying Xue and Fantasy Sweetheart could heal without a problem.</p><br/><p>Everyone else moved on just as quickly and dispelled the debuff. Now, another problem awaited them. If the skill {Queen’s Roar} had a short cooldown, their ability to dispel debuffs would be all for moot.</p><br/><p>\"Weaklings. I own the world! Sooner or later, I shall rise again and will bury all living beings beneath the very land you walk on!\" The Queen of Blades hurled herself towards Zhang Yang and activated a skill.</p><br/><p>{Omnislash}!</p><br/><p>‘-22,504!’</p><br/><p>‘-22,504!’</p><br/><p>…</p><br/><p>The boss moved around, swinging her blades around as if there was a high-speed V12 engine in her body. In less than half a second, she had already landed two hits on Zhang Yang. There was a progress bar on the boss’ character, and it had only made a 20% progress. It was obvious that she still had 8 more strikes to go!</p><br/><p>Zhang Yang immediately retaliated with {Crash Magic}. He dug his sword into the boss’ side and planted it deep. The damage inflicted on him was less than 30,000. It was due to the 20% damage reduction of the God of War Inheritance.</p><br/><p>The sword attack landed and the skill {Crash Magic} was cast, but the boss merely grunted a little and continued to slash Zhang Yang.</p><br/><p>\"F*ck!\" Zhang Yang instinctively activated {Shield Wall} to protect himself. Even though {Crash Magic} had a 10 seconds cooldown, it could not keep up with the boss’ ridiculous speed!</p><br/><p>\"BREAK!\" Sun Xin Yu ran towards the boss and gave a {Low Kick}. The boss’ {Omnislash} was interrupted but after 3 to 4 seconds later, the boss blades glowed up and another {Omnislash} was cast. Lost Dream swooped in and broke the skill channeling.</p><br/><p>The skill was repeated for the fourth time when Zhang Yang himself could interrupt the boss.</p><br/><p>He quickly formulated a plan and said, \"Both the little girl and I will interrupt the first boss skill. Ice cube, Daffy, both of you will handle the third. Lost Dream, Galileo, both of you stop the third. Make sure to time your hits!\" </p><br/><p>\"Got it.\"</p><br/><p>Everyone nodded their heads without any objection.</p><br/><p>\"Little Yang! Why didn’t you assign any tasks for me?!\" said Fatty Han as he felt a little offended.</p><br/><p>\"You’re in charge of attacking since your attack is strong. Whether or not we manage to kill the boss in time, depends on you!\" said Zhang Yang as he came up with the best thing that Fatty Han loved hearing, compliments.</p><br/><p>In truth, Zhang Yang had not assigned Fatty Han any other task due to the speed of the {Omnislash}. It was so fast that Zhang Yang had counted 4 slashes in one second. Judging by Fatty Han’s standards, sending out a {Silencing Shot} within 1.5 seconds would be a miracle. Zhang Yang would sacrifice a goat to the gods as thanks. The problem was that in 1.5 seconds, the boss could have and would have dealt 6 slashes, dealing more than 100,000 damage to Zhang Yang.</p><br/><p>Zhang Yang could not possibly explain it to him since Fatty Han was a prideful man at times, and has his priorities in the wrong places. Like a woman during her monthly \"visit\", but Fatty Han annoying behavior was eternal.</p><br/><p>Zhang Yang has known Fatty Han his whole life. He knew how to pacify the fatty easily. Fatty Han bought Zhang Yang’s sweet talk and smiled all the way as he drew his bow and attacked the boss with everything he had to impress the people around and not let down his brother.</p><br/><p>Fatty Han had a B class Inheritance. Even if he did not rely on the Vampire Transformation skill, he still has a 40% damage increase passive skill which was only 10% weaker than Zhang Yang’s. As such, B class Inheritances were rather impressive too.</p><br/><p>Not long after, the boss roared again, releasing a powerful sound wave that stunned everyone. As such, Zhang Yang took 20,000 damage head on because {Warrior’s Will} was still on cooldown. The boss then landed blade after blade as she attacked Zhang Yang.</p><br/><p>During the effect of {Queen’s Roar} when everyone was stunned for 5 seconds, the boss would not use {Omnislash}. If she had, the boss would have been incredibly difficult to kill. Players might have to rely on [Forbidden Scrolls] or to use sheer numbers and defeat her. Naturally, with the Transformation skill, the boss would be a cakewalk.</p><br/><p>The problem was that neither Zhang Yang nor Fatty Han were ready to use their Transformation skills. They had used it to defend their cities back then. If they had not, China might have already lost one or even two major cities!</p><br/><p>After the 5 second stun, Zhang Yang HP had speedily dropped below 200,000 HP. Both Han Ying Xue and Fantasy Sweetheart were startled by it and had immediately prioritized on healing him instead of others.</p><br/><p>Han Ying Xue had a Level 6 {Life Aura} which increased everyone’s recovery rate by 18%. Daffodil Daydream had her {Recovery Aura} to heal both the HP and MP of everyone in the party. With countless of HP recovery bottles and [Bandages], the team’s healing power was strong and could keep the party alive for some time.</p><br/><p>The battle continued on sluggishly for another 10 minutes when Zhang Yang’s skill, {God of War’s Shield} that provides 20% damage reduction ended. The amount of damage he took increased from over 20,000 to as high as 29,000. The increase of damage taken had Han Ying Xue and Fantasy Sweetheart crying for help. Luckily, the two of them were the guild’s top healers. They had equipment that had been fully catered to increasing their healing powers, and a skill tree-full of powerful healing skills. Zhang Yang had to activate {Shield Wall} at every possible moment to allow the healers to catch their breaths.</p><br/><p>After a brutal one hour, the boss’ HP had finally dropped below the 50% threshold.</p><br/><p>Zhang Yang prayed hard as he cast {Glare of the Death God}.</p><br/><p>FUUSH!</p><br/><p>A black light zoomed towards the boss character but it bounced off the boss’ character. The light turned into a cloud of black smoke and dispersed.</p><br/><p>Resist!</p><br/><p>\"CRAP!\"</p><br/><p>This boss had been designed to take on the efforts of entire regions. Even though she only had two skills, they were strong enough to keep herself alive while killing everyone in sight! The problematic {Queen’s Roar} can only be countered by players’ own status removing skills, but if those skills were left on cooldown, there was nothing else that they could do but to take it head-on.</p><br/><p>On the other hand, while {Omnislash} was a skill powerful enough to instant-kill a tank, it could be interrupted with sharp reflexes. If Zhang Yang misses his timing, the skill might end up killing him before Zhang Yang could even cry for help. The situation had never been so intense before that it was mentally taxing. If either one of them accidentally messes up the interruption cycle, the whole team will inevitably be killed.</p><br/><p>In one hour, even though the team had managed to hack away 52% of the boss HP, 10% HP had been removed by the OP skill {Glare of the Death God}. This meant that, if they continued on with their pace, they would only be dealing damage that is equivalent to 42% of the boss’ HP!</p><br/><p>Naturally, when the boss enters the 20% HP threshold, the damage caused by players around will increase greatly. {Killing Cleave} can only be used during that period, which would grant a massive boost in DPS. However, it would only last for 10 seconds, with a 30-second cooldown duration. Players will still have to put their backs into it.</p><br/><p>They would have to wait for another hour to use the {Glare of the Death God} again! Naturally, by then, even if the skill fails, the boss would not have much HP left.</p><br/><p>The atmosphere of the entire party was intense. Paint a mental picture where you can see everyone walking on a thin wire across a valley. The chances of them failing their own duties were so high that it would most definitely cause the entire team’s death! To last for another hour would put such a heavy mental burden that they would need counseling after finishing the battle!</p><br/><p>\"Come on guys! Fight hard! Focus! Think about the reward! The reward!\" cried Zhang Yang as he tried to lighten the atmosphere.</p><br/>\n</div>"}