{"title": "Chapter 577: To Whom It Belongs", "id": 577, "volume": 6, "url": "http://boxnovel.org/mmorpg-rebirth-of-the-legendary-guardian-chapter-577-to-whom-it-belongs", "volume_title": "Volume 6", "body": "<h1>Chapter 577: To Whom It Belongs</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 577: To Whom It Belongs</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>\"We will win!\"</p><br/><p>\"Yes, we will. We have killed an Ethereal boss before. Why are we shaking our butts for a Level 130 Mythical boss?\"</p><br/><p>\"Hehe! Good one!\"</p><br/><p>Everyone encouraged each other and occasionally joked around. Being exposed to a long duration of mental stress could put a toll on a person’s psyche. Jokes and occasional teasing would help a lot in lightening the atmosphere.</p><br/><p>Zhang Yang was fully focused all the time. {Block} was never on cooldown as it was one of the skills that he would use the moment it became available. At least, {Block} has a 100% success rate. It was a pity that his current level of Strength was pretty much useless. The boss was far stronger than he is. Supporting Attacks could not be applied to a stronger enemy. {Block} was the only other defensive move he had to nullify an incoming attack.</p><br/><p>\"Die! Die! Die!\" The Queen of Blade screamed. Her bladed hands gleamed with intense killing aura and grazed Zhang Yang shield. The intense crumpled up emotion of frustration of not being able to kill a single player had left the Queen of Blade flustered with anger.</p><br/><p>\"We were gods in ancient times! You are nothing but food to us! You are nothing but weaklings that will be our slaves!\"</p><br/><p>\"I shall burn your pathetic souls with my fiery rage!\"</p><br/><p>\"The strongest of mortals poses no threat to me! I am a god! The world’s strongest human poses no more threat to me than its strongest bug!\"</p><br/><p>The boss screamed and threw insults at the party as she kept her blade busy.</p><br/><p>\"Dummy! I’m running out of Transmuted MP pots!\" cried Han Ying Xue.</p><br/><p>\"What!?\" Zhang Yang frowned. The party had only been able to last this long, all thanks to Han Ying Xue’s mighty healing power. Han Ying Xue had a 75% reduced mana consumption to all skills and a HP to MP conversion skill to support her MP usage. Be it MP potions, or {Recovery Aura}, she would run through them all like water, or else she would lose track of her healing tempo. MP potions were not the best method of recovering MP, but she had been left with no choice. As the Transmuted MP potions were running out, she might fail to heal during critical moments, leading to a catastrophic failure of the entire party.</p><br/><p>The boss still had 12% HP remaining. With victory so close that you could almost taste it, Han Ying Xue’s bad news was truly devastating to the entire party.</p><br/><p>\"Huh?\"</p><br/><p>Zhang Yang heard a sound coming from the sky. He gazed up and saw a group of players flying in on their mounts.</p><br/><p>He zoned in one of the players and discovered the identity of the entire group of players.</p><br/><p>Hell’s Knight, Level 105, Male Human, Sacred Knight, Paragon, Europe Region.</p><br/><p>The Hell’s family.</p><br/><p>Technically, even though all Level 100 players can roam around the Chaos Realm to search for Baroque’s Island to destroy the portal and end the war, the system had not provided the location of the island, and they would have to scour for it the old-fashioned way. It had only been two hours since the end of the battle of the Ancient Creatures, yet the European players have managed to find such an obscure place! Zhang Yang had taken the same amount of time to reach the island because he already had the location in mind! How did they track down the location of Baroque Island that quickly!? The answer was Dusk Phoenix.</p><br/><p>Dusk Phoenix had a tool to track down specific players. She had a hunch that it was Zhang Yang who had initiated the Legendary quest and by tracking him down, she would be able to catch up to him!</p><br/><p>Zhang Yang scanned over all the players in the area and did not find Dusk Phoenix among them. Was she truly that traumatized when it comes to him, or was she sneaking about?</p><br/><p>The situation had taken a turn for the worst the group of European players arrived at the scene.</p><br/><p>\"Haha! I remember a certain phrase, ask for Cao Cao and he shall arrive on time! What a coincidence!\" cried Hell’s Spellcaster, sitting atop on a giant snow condor. There was a trace of hatred embedded in his voice.</p><br/><p>The group had lost the S class Inheritance Milkmaid Deity to Zhang Yang, and now truly hated Lone Desert Smoke. Now that they were in a huge pinch, it would be the best time to strike them!</p><br/><p>There were over 30 of them there. It should be all available members of Paragon who possessed flying mounts. Lone Desert Smoke had a similar amount of flight-capable players in his guild, but since the [Party Summon Order] could only bring in 9 players at a time, it was all he had with him at the moment.</p><br/><p>Radiance, Crimson Rage, Imperial Sky, and other strong guilds had their eyes on Lone Desert Smoke. Hence, if Zhang Yang had led all the players of Lone Desert Smoke to Baroque Island altogether, he would be leading them to the treasure trove! Zhang Yang had purposefully brought in the team, silently, and discreetly to make sure that the strong guilds could not track them.</p><br/><p>However, he had carelessly forgotten about the European woman – Dusk Phoenix. She could track him down!</p><br/><p>10 from Lone Desert Smoke, against 30 from Paragon. There was a boss then as well! How does Zhang Yang plan to solve the mess?</p><br/><p>Zhang Yang was thinking furiously in his mind and came up with a plan. The opponent must be thinking that Zhang Yang’s party was having a tough time, which was true enough, and had plans to seize the opportunity to kill them and snatch the fame, fortune, glory from them! </p><br/><p>Zhang Yang grinned to himself and calculated the timing of the boss’ attack. In one fluid motion, he leaped on to the Thunderhawk and zoomed towards Paragon’s party. The boss’ aggro was locked to Zhang Yang. Hence, when he flew up into the sky, the boss had followed with a speed that rivaled that of the Thunderhawk!</p><br/><p>At the speed of light, Zhang Yang zoomed through the sky, leaving a trail of blue light. The Violet Thunderhawk was, by far, the only Mythical tier mount. Within seconds, Zhang Yang arrived at the group of players and activated {Blast Wave}. He had only managed to stun 5 of the enemy.</p><br/><p>The sword had unfortunately remained \"silent\" and did not trigger its echo effect. However, it did not matter. Zhang Yang was not here to take them on!</p><br/><p>Hell’s Priest eyes narrowed and widened immediately when he understood what was going on. \"STOP! DO NOT DISPELL THE STUN!\"</p><br/><p>He was too late. Three out of them had already instinctively dispelled the skill and had swung their weapons, chanted their spells, moving around Zhang Yang. Only two of them had obeyed Hell’s Priest and had remained motionless in their original positions.</p><br/><p>By that time, the Queen of Blade had already arrived at their position. After a swift attack, the creature shrieked.</p><br/><p>{Queen’s Roar!}</p><br/><p>A blast of intense sound wave spread all around, stunning everyone including Zhang Yang, for 5 seconds, while reducing their HP by 10% a second.</p><br/><p>Those of them who still had available status removal skills had quickly removed the debuff right after the first tick. However, those who have used their skill to dispel Zhang Yang’s stun would have to \"eat\" the skill head-on, losing 50% of their HP as a result.</p><br/><p>The three Paragon member who had acted on instinct quickly regretted their decisions as they finally understood why Hell’s Priest had asked them not to dispel the stun.</p><br/><p>Zhang Yang grunted as he swung his sword with the might of his ire!</p><br/><p>{Horizontal Sweep}!</p><br/><p>‘-59,332!’</p><br/><p>‘-54,228!’</p><br/><p>’53,900!’</p><br/><p>‘-56,772!’</p><br/><p>…</p><br/><p>Even though all players around there had boosted their HP through {Shared Life} with their flying mounts, all non-tank players had a maximum HP of only 80,000 to 90,000, at most. Zhang Yang’s powerful {Horizontal Sweep} had dealt enough damage to cleave half of that amount!</p><br/><p>The three who had freed themselves from the {Blast Wave} were stunned once again, immobilized for good this time. After taking in Zhang Yang’s {Horizontal Sweep}, all three of them were left with only less than 30,000 HP. They died before the Queen of Blade’s {Queen’s Roar} could finish its skill effect.</p><br/><p>While stunned, players cannot engage in any actions such as taking in a bottle of potion. The players could only watch as Zhang Yang approached them at a high speed, the blade of his large sword coming for their throats.</p><br/><p>The Violet Thunderhawk speed through the airspace and targeted the enemy’s healers. He swung his shield left and right, bashing their heads to interrupt their chanting. The only skills they could cast were the instant cast skills like {Regeneration} and {Holy Shield}.</p><br/><p>Unfortunately for them, the Queen of Blades’s {Queen’s Roar} were damage incarnate. The damage could not be reduced by any defensive means. {Regeneration} could buy some time. Unfortunately, {Queen’s Roar} procced once a second, while {Regeneration} heals once every 4 seconds.</p><br/><p>They were not heading for hell’s door. The door was heading for them like a truck.</p><br/><p>Zhang Yang had planned everything from the moment he cast {Blast Wave}. As long as they use their status removal skills, they would fall for his trap and die.</p><br/><p>\"Bastard! Kill him!\" One man in Paragon cried and led the other players behind him to charge towards Zhang Yang. Zhang Yang was not frightened, instead, he played along and shot through their ranks, ending up behind them. Gutsy moves like these only came from people who felt no fear, only the confidence of killing each and every enemy player. Only Zhang Yang could perform in such a manner, inflicting great pain and humiliation on his victims.</p><br/><p>Even though the original plan had deviated, the boss had only less than 12% left. Zhang Yang could leave his party to handle the remaining battle on their own.</p><br/><p>‘-1,203!’</p><br/><p>‘-803!’</p><br/><p>‘-0!’</p><br/><p>Arrows ‘thonked’ off Zhang Yang’s chest, doing little to no damage. The highest damage that was dealt by the ranged attackers was only 1,000 and above. Zhang Yang’s all-round Defense prowess had prevented any damage below 10,000 to cause any damage to him!</p><br/><p>\"F*ck. His’s too tough!\" There were a few Thief class players who had approached Zhang Yang from behind. However, the boss already took up that space. It would be suicidal to stand between Zhang Yang and the boss.</p><br/><p>Dual wielding Thieves would not be able to scratch Zhang Yang by normal attacks alone. Unless they activate their skills, their normal attacks would only be toothpicks trying to penetrate a Kevlar vest. Zhang Yang grinned and whacked the f*ckers away. One by one the Thieves were sent flying away, leaving one or two broken teeth behind at where they stood.</p><br/><p>Shush!</p><br/><p>Zhang Yang instinct tingled violently and Zhang Yang quickly took his shield and held it over his back, even though he could not see what was coming at him. The boss had attempted to stab him but Zhang Yang managed to block the attack. Zhang Yang was sent flying forwards. Somehow, by knocking him forwards, he was taken out of the path of several magic missiles from the enemy.</p><br/><p>Technically, attack skills cannot be dodged, or at least, it was humanly impossible. It’s like trying to dodge an arrow in real life. However, Zhang Yang had been propelled by the boss. It was lightning fast. It allowed him to ‘dodge’ the attacks!</p><br/><p>Everyone was shocked and thought that Zhang Yang had done it himself, until someone cried out.</p><br/><p>\"It was only luck! Kill him! Do not stop!\" cried Hell’s Warrior.</p><br/>\n</div>"}