{"title": "Chapter 583: Two in a Row!", "id": 583, "volume": 6, "url": "http://boxnovel.org/mmorpg-rebirth-of-the-legendary-guardian-chapter-583-two-in-a-row", "volume_title": "Volume 6", "body": "<h1>Chapter 583: Two in a Row!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 583: Two in a Row!</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p> Before players manage to acquire equipment that would meet the minimum requirement for these bosses, any boss battle would become even harder than flying into the sky with bare hands! No matter how hard you try, you would not be able to kill the boss at all. However, of course, when the level and Tier of the equipment are way \"overspecced\", the battle would be child’s play. The bosses would be crushed within minutes! The players had the ‘software’ of skills and willpower but lacked the ‘hardware’. Hardware can never be completely solved by good gaming skills or the strong will to win.</p><br/><p>Crimson Rage managed to announce their might to the world all because of Mellow Venom. Her {Petrification Transformation} Skill indeed came handy whenever they engage a boss. Her transformation Skill was basically like a Mythical Tier equipment that would support her with a high value of Defense. Furthermore, there were also some hidden Inheritance Skills which still remained unknown to the others. She could use her Skills to boost the attributes of her equipment to a whole new level of power.</p><br/><p>There were a total of 7 Mythical Tier equipment that Zhang Yang had on him. [Sword of Purging Devourer] and [Warrior’s Honor] were not Defense-type equipment. They did not contribute anything to Zhang Yang's Defense, whatsoever. However, a shield would be an essential equipment that all Tankers should have. Zhang Yang had a Level 130 Mythical Tier Shield. That one shield alone had boosted most of his Defensive attributes! His other equipment had also contributed in bringing up his Defense.</p><br/><p>Compared to the power-up that Mellow Venom gets from her {Inheritance], Zhang Yang would surpass even that!</p><br/><p>Mountain Move could not help but smile bitterly. If Zhang Yang had joined them earlier, he would not have had to suffer and wrack his brain trying to get the party to work together.</p><br/><p>However, he thought of it from another perspective. If Zhang Yang had joined them earlier on instead of running around in the open world, completing Main Story Quests, he would not be this powerful. If not for that, what chance did they have against this boss?</p><br/><p>\"Alright, everyone. Time to get in position! We shall take out a boss today!\" Mountain Mover said.</p><br/><p>Everyone scattered out like a spider web. Zhang Yang raised up his shield and sword, and then he said, \"I shall count from three to one, and then we shall charge!\"</p><br/><p>Three, two, one!</p><br/><p>Zhang Yang took the first step and charged towards the boss with large steps, followed by Felice and Thunderhawk. Unfortunately, he could not mount Thunderhawk, even if he wanted to. Players could not be [Mounted] in a dungeon. Or else, his Maximum HP would have reached up to 350,000 HP! The boss would be toyed around by him!</p><br/><p>Business as usual, Zhang Yang threw a {Spear of Obliteration} at the boss and caused 29,802 damage to the boss. He now had a solid hold of the boss’ aggro.</p><br/><p>\"You rats! Can’t get enough and back for more?\" The boss let out an intimidating roar as he charged at Zhang Yang. With the axe in hand, the boss aimed at Zhang Yang’s neck and attempted to hew it off.</p><br/><p>‘-14,113!’</p><br/><p>Zhang Yang did not use {Block} in order to see how much damage he takes. It would give him a good estimation.</p><br/><p>\"Just about 14,000 damage?\"</p><br/><p>\"Are you kidding me? The boss caused about 20,000 damage to Starlight!\"</p><br/><p>\"This is our guild master we are talking about! He’s all-powerful and mighty!\"</p><br/><p>Everyone went on about it while Endless Starlight slumped over. Then he said weakly, \"I’m also quite powerful, alright?\"</p><br/><p>The battle has begun. Everyone went to their own position as they started carving up the boss.</p><br/><p>Zhang Yang did not have to care so much about holding back anymore, as he needed to lock the aggro of the boss to himself. All he needed to do was to steadily attack the boss and maintain the boss’s aggro. After looking at the Top DPS list, Fatty Han would need to double the damage he was dealing with the boss in order to catch up with the damage Zhang Yang did!</p><br/><p>\"What the hell! How can guild master deal so much damage to the boss? That’s terrifying!\"</p><br/><p>\"That’s right! Brother Han used to say that if anyone exceeds the damage he deals on monsters or bosses, he would pay 10,000 gold coin to the person. Now, guild master left him in the dust!\"</p><br/><p>\"Yea! His face is pale, alright!\"</p><br/><p>Fatty Han could no longer take it all in silence. He attempted to defend his dignity, as he said, \"Little Yang is my brother! I’m just letting him! If I activate my {Vampire Transformation}, no one will ever match me! I shall be able to kill anything that stands in my way! Repressing little Yang would be a walk in the park!\"</p><br/><p>Everyone laughed.</p><br/><p>After a brief moment, Hachir began to activate his Skills. He threw out his {Poisonous Blood Infection} and {Warlord’s Wrath} at the party. Fortunately, although it caused them to panic momentarily, they all had experience in handling such situations. They moved around, as briefed by Mountain Mover.</p><br/><p>The worst threat came from the {Infectious Wound} of the boss. The Skill would increase his attacks by 50% additional damage on the Tankers. As players that were afflicted by the side effect of the {Infectious Wound} would keep bleeding, they would require a Healer to take care of them.</p><br/><p>They also had taken out the boss within 10 minutes. Or else, if the boss ever gets the chance to activate {Hysterical Drive}, even Zhang Yang would be instantly killed by the boss! It made perfect sense that not everyone could deal high damage like Zhang Yang, Sun Xin Yu, and Wei Yan Er! Therefore, taking out the boss within 10 minutes proved to be a little more challenging than expected.</p><br/><p>Under those circumstances, the party had to focus more on dealing damage to the boss rather than healing themselves. It heavily depended on the part of the tanker, if the tanker is tough enough, they would be able to lash out without much worry.</p><br/><p>If they were more focused on healing, the Tanker would have no pressure at all. However, if the DPS of the party was not strong enough, it would be impossible for the party to take out the boss within 10 minutes. By then, the party would be wiped out by the boss upon activating its {Hysterical Drive}! Meanwhile, if they did not focus on healing, the Tanker would be having a hard time kiting the boss. Either way, would lead them to perish by the end of the battle!</p><br/><p>Now that they had a super Tanker Zhang Yang, the problem has been solved! With his Defense, even if Zhang Yang was affected by {Infectious Wound}, the boss could only deal about 25,000 damage to him. Zhang Yang would only receive a total of 130,000 damage without using {Block}. After all, he had over 190,000 HP...</p><br/><p>Upon solving the worst problem in battling this boss, everyone only needed to focus on dealing as much damage as possible to the boss, according to plan.</p><br/><p>The DPS of the party was not weak at all. With Zhang Yang joining in, the boss lasted about 8 minutes before it let out a miserable roar, collapsed onto the ground and stay dead. Of course, upon the death of the boss, tons of loot dropped from the dead body of the boss. Lone Desert Smoke had progressed to 9/15!</p><br/><p>\"Just that simple, huh?\" after clearing the 9th boss, everyone was having a hard time believing it. They had been busting their butts, trying to bring down that boss. Past attempts had ended up with wipeouts after 10 minutes, or before the boss even activates {Hysterical Drive} or {Madness}. Why were things so different now? The boss went down like there was no difficulty at all!</p><br/><p>Some of them even suspected that they had selected the wrong mode of the dungeon! Was it Hard Mode?</p><br/><p>The boss dropped a total of 3 Violet-Platinum Tier equipment. One of them was an exclusive equipment only for the Battle Companions. Zhang Yang did not try to fight his party members over the equipment. The equipment he had was already more than enough to clear out all of Dragon Throat Fortress. It would be wiser to let others upgrade themselves so that they would become more powerful in order to support the guild.</p><br/><p>After all, one could not just rely on himself to make a guild powerful. He should look at the bigger picture and take the path that leads to the guild getting powerful as a whole, rather than himself. That being said, the guild members were the key to making the entire guild strong and powerful!</p><br/><p>Therefore, increasing the standard of the overall guild members would be the best method!</p><br/><p>After distributing the loots among themselves, the party continued to push on. They killed every single monster that got in their way as they made their way to challenge the 10th boss.</p><br/><p>Zhang Yang was not interested in tanking against weak monsters. He left them to Endless Starlight. After all, this second-in-command Tanker would want to shine once in a while. He would not be willing to sit on the bench like a backup!</p><br/><p>The monsters were not as numerous as there were in the open world. However, each of the monsters was extremely powerful. They must be the elites of the elite Tier! They were basically as powerful as mini-bosses. It took about one to two minutes for the entire party to take down one of them.</p><br/><p>Zhang Yang was slicing and dicing the monsters in front of him when he struck out with his {Destructive Smash}, he suddenly felt his right arm getting a little hot. A strange feeling shot straight up his chest right after that!</p><br/><p>\"Ang ---\" a large figure of an eastern-styled dragon burst right out from Zhang Yang’s sword and attacked two of the elite Tier monsters right before him!</p><br/><p>‘-289,930!’</p><br/><p>‘-317,820!’</p><br/><p>Two extremely high damage values popped right on top of the two monsters. Everyone stared wordlessly at them!</p><br/><p>That was... the {Rising Dragon Strike}!</p><br/><p>Although the damage of the Skill was quite terrifying and it could deal 10 times of the player’s normal damage within a long range, the rate of it activating was extremely small! It only got triggered once after Zhang Yang entered the dungeon and went through many battles!</p><br/><p>The most tragic part of it was that Zhang Yang had no control over when to trigger it!</p><br/><p>Sigh, it was such a waste for the Skill to trigger on weaker monsters.</p><br/><p>After a small, intriguing incident, the party continued to push on. They took about another two hours to cross over some twists and turns before they finally arrived at the boss stage for the 10th boss.</p><br/><p>Although they had defeated the boss in Normal Mode and Hard Mode before, the boss in Hardcore Mode could not possibly be as simple. Not only would the boss have enhanced Skills, the boss would also have one or two additional New Skills. It would not be wise at all to bring forth the tactics that were used to defeat the boss before in Hard Mode, even though it was the same boss with similar behaviors.</p><br/><p>Zhang Yang did not say a word as he followed every instruction and command from Mountain Mover. He allowed the commander of this party to work at his full potential. The party was going through a process of trial and error.</p><br/><p>Dungeon exploration could be an extremely boring thing, as players would have to face the same boss over and over again. If they ever encounter some bosses that were too powerful for them to handle, they would be forced to repeat battling the same boss over and over again until they manage to clear it. Well, it would be frustrating for most of the people to repeat the same thing over again and again.</p><br/><p>The party was wiped up by the boss several times. As everyone began to feel exhausted, they sat down and took a break by a safe spot. They cracked some jokes and laughed to ease some tension. A few of the girls on the party came up with songs and dances to cheer the boys up a little bit. After just a while, everyone was refreshed.</p><br/><p>After a few more attempts, the party had a clearer picture of the boss.</p><br/><p>With Zhang Yang as the main Tanker in suppressing the assaults from the boss, the party had nothing much to worry about except getting the right tactics for bringing down the boss. As long as they applied the appropriate tactics and methods, bringing down the boss would not be an issue at all. It would just be a matter of time.</p><br/><p>One night had passed. The party managed to slay the 10th boss right before it was time for most of the party members to log out of the game and get to work. By killing the boss, Lone Desert Smoke had caught up to Crimson Rage’s progress. That had put a huge question of doubt on whether Crimson Rage would still triumph in the contest of securing the ‘First Clear’ title of the dungeon.</p><br/><p>Zhang Yang did not stay in the dungeon for the following days. Instead, he went on to help the little brat in completing the quests for her [Darkness Inheritance]. They spent hours taking down some mini-bosses. Even though the little brat and Han Ying Xue could have completed the quests all by their own, but Zhang Yang wanted her to get her [Darkness Inheritance] as soon as possible to boost the Strength of his guild. With his aid, the progress of completing the quests became much quicker than expected!</p><br/><p>With how Crimson Rage and Lone Desert Smoke were rampaging across the dungeon stages, other guilds were not willing to be left behind. They started to send their own members with [Inheritances] to the front lines. It did not matter if it was Nihilum (Mess Up Your Mama) and Paragon from Europe Region, or Blood Legion and Exodus from the North America Region, these top Tier guilds had caught up with the China Region’s progress.</p><br/><p>As the contest in clearing the dungeon drags on, more players would acquire [Inheritance]. Even though anything lower than Class C [Inheritances] did not provide players with {Inheritance Transformation} Skills, but they still gained a certain amount of power-up. Furthermore, they would also acquire some New Skills from their newly acquired [Inheritances,] as well. Surely, they would become significantly more powerful.</p><br/><p>With the addition of players with [Inheritances], every guild that took part in the contest in clearing the Hardcore mode of the dungeon had managed to progress up to 10/15 in no time at all.</p><br/><p>However, the difficulty of the boss battles in Dragon Throat Fortress would become entirely different after 5 bosses. That being said, the difficulty of killing the last 5 bosses would increase drastically, compared to the previous boss battles! After breaking through an extremely difficult situation, they were forced to face another even more difficult situation where they had no way of breaking through just yet. The 11th boss had become their new obstacle in clearing the Hardcore Mode of the Dragon Throat Fortress.</p><br/><p>Since many players had used their {Inheritance Transformations} during the battle with the Ancient Creatures, when the cooldown for their {Inheritance Transformation} Skills are over, the contest would take place on a whole new level.</p><br/>\n</div>"}