{"title": "Chapter 584: Frost Lord Maron Curse", "id": 584, "volume": 6, "url": "http://boxnovel.org/mmorpg-rebirth-of-the-legendary-guardian-chapter-584-frost-lord-maron-curse", "volume_title": "Volume 6", "body": "<h1>Chapter 584: Frost Lord Maron Curse</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 584: Frost Lord Maron Curse</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>After accompanying the little brat in slaying a few mini-bosses, the three of them had to stop at the quest where they were required to slay the Lord of Darkness ‘Mordock’ --- The final boss for the Class A [Inheritance] quest was much more powerful than Vampire Count Ferra. They could not take on the boss just yet!</p><br/><p>Over the next few days, Hundred Shots, Galileo and Sun Xin Yu had already completed the preliminary quests before the final quest for their [Inheritances]. Now, each of them only had to kill the final boss of their own [Inheritance] questlines before they could acquire their [Inheritances].</p><br/><p>Zhang Yang could only choose to leave Sun Xin Yu in the basket as the boss she needed to kill was a Class S [Inheritance] boss. Unless Felice goes wild again like she did before, the boss would not be going down anytime soon. That dragonhawk lady was really a nightmare when she went berserk!</p><br/><p>Since they were still incapable of slaying the final bosses for Class S and Class A [Inheritance] quests just yet, but they would still have a glimpse of hope in taking down the final boss for Class B [Inheritance] quests. As long as Zhang Yang has his {God of War Transformation} ready at hand, and some luck in triggering the special effect of {Glare of the Death God}, everything should work accordingly like how it did during their battle with Vampire Count Ferra. They would really stand a high chance of taking down the boss and completing the quest.</p><br/><p>Though Vampire Count Ferra was a little subpar as final boss for Class B [Inheritance] quest, Zhang Yang now had quite a number of upgrades on his equipment. With his {God of War Transformation} activated, the total amount of his HP would reach up to 7,650,000 HP! That would be almost double the amount of HP he had back when they were taking on Vampire Count Ferra!</p><br/><p>After some considerations here and there, Zhang Yang decided to help Lost Dream and the other 2 members get their Class B {Inheritances] first. When they have 4 Class B {Inheritance Transformations} and 1 Class S {Inheritance Transformation} ready, the Lone Desert Smoke should be able to take down the last 5 bosses of Dragon Throat Fortress in a row!</p><br/><p>Zhang Yang brought Sun Xin Yu, Lost Dream and the other party members along as they departed for the quest. They endured much pain and suffering while battling against the high leveled monsters. After struggling for half a day, the party finally arrived at their destination. The Frost Lord Maron Curse was standing in the middle of the marshland of Haccerlant's Basin.</p><br/><p>It was a large creature formed from frost and ice. It had a humanoid appearance that was hundreds of meters tall. The angular, clear, glass-like frost on the surface of the body threw off star-shaped reflections of iridescent light as the beast moved about, stoically shaking the loose snow off itself. It was such a sight to behold!</p><br/><p>Frost Lord Maron Curse (Ethereal, Elemental)</p><br/><p>Level: 150</p><br/><p>HP: 150,000,000</p><br/><p>Defense: 9,950</p><br/><p>Attack: 75,409 - 95,409 (Determined as a Physical Attack, but deals Frost Damage)</p><br/><p>Skills:</p><br/><p>[Frost Aura]: Reduces 50% Movement Speed of all targets within effective range. There is a 1% chance of freezing the target. Freeze effect lasts for 5 seconds. When frozen Targets are struck by Maron Curse, the Critical Rate on the targets is increased by 50%.</p><br/><p>[Frosty Edge]: Summons frosty pikes from above, raining down upon all targets within the area of 10 X 10 meters. Causes 50,000 Frost Damage to all targets once every second. Lasts for 10 seconds.</p><br/><p>[Ice Ring]: Unleashes a ring of frost, causing 30,000 Frost Damage to all targets within the range of 20 meters. Targets will be afflicted with a freezing effect which will last for 5 seconds. When frozen Targets are struck by Maron Curse, the Critical Rate on the targets is increased by 50%.</p><br/><p>[Frost Spawn]: The boss vanishes and summons the same number of Frost Spawns as the number of players on his aggro list. These Frost Spawns are meant to annihilate all enemies within the site. After 3 minutes, Maron Curse will reappear. Each Frost Spawn that is left alive will heal Maron Curse by 1% of his HP bar.</p><br/><p>[Frost Build]: Immune to all Frost-type attacks and Frost-type Status Restriction Skills. However, Fire Damage will increase the damage received by the boss by an additional 50%.</p><br/><p>Note: According to legend, Maron Curse was born from a broken toe of the God of Frost. Therefore, do not underestimate him!</p><br/><p>\"Count Ferra was rubbish compared to this boss!\" After reading the attributes of Maron Curse, everyone sighed.</p><br/><p>Wei Yan Er suddenly looked at Fatty Han and compared their current situation with the situation when they were battling Count Ferra. That little brat said, \"As expected from the fatty, wretched ones will only get a half-baked [Vampire Inheritance]!\"</p><br/><p>Fatty Han filled his eyes with tears and said, \"Come on... my [Inheritance] is also Class B, alright...\"</p><br/><p>\"Brother fatty, don’t you know that there are B+ and B- in the Classes as well?\" Endless Starlight patted Fatty Han on his shoulder and said, \"It’s not that I want to look down on you, but the boss that we slew back in the final quest for your [Inheritance] was just weak! Of course, this boss would not be nearly as powerful as my ‘King Kong’!\"</p><br/><p>\"Little Yang... are there such different classes like B+ and B- for the [Inheritance,] even though they are both Class B?\" As Fatty Han saw that Endless Starlight was being so serious, he could not help but feel a little depressed. So he quickly asked Zhang Yang to find out.</p><br/><p>Zhang Yang shook his head as he smiled, then he said, \"I have never heard of it before!\"</p><br/><p>\"You pr*ck! How dare you make fun of me!\" Fatty Han got angry immediately as he saw Starlight laughing.</p><br/><p>Zhang Yang equipped his [Party Summon Order] and summoned other 9 healers from Morning Town over to their location. Then, he rearranged the structure of the party.</p><br/><p>Previously, they had managed to hold off the assaults of the Vampire Count Ferra, because Zhang Yang had support from the special effect of [Titan Chest Plate]. That equipment provided a recovery of 75% HP to him. However, the amount of HP recovery had been reduced to 20%. On the other hand, this boss had a much higher damage output compared to the previous one. Judging by numbers alone, Han Ying Xue and Fantasy Sweetheart would never be able to heal him up quickly enough.</p><br/><p>Therefore, Zhang Yang brought along some members who already had [Flying Mounts]. Then, he also summoned some Healers with very good equipment, however, without [Flying Mounts] to support them in battle.</p><br/><p>Currently, the party had a total of 42 players. 2 of them were Tankers, 13 of them were Healers, and 27 of them were DPS players.</p><br/><p>\"This should do the trick. We should be able to heal Zhang Yang up with so many Healers.\" Fatty Han did not have much confidence.</p><br/><p>\"We won’t know till we try!\"</p><br/><p>Zhang Yang gave it some thought and then said, \"The challenging part of this boss battle will be the boss’s {Frosty Edge}. We will be staying within the effective range of the {Frost Aura} all the while, during the battle. Our Movement Speed will surely be reduced. Most of us will surely be frozen as well. We wouldn’t be able to dodge that, and we will be exposed to a high chance of receiving Critical Damage! Therefore, everyone, get your own Anti Status Restriction Skills ready. Only use them to unfreeze yourself when you’re struck by the {Frosty Edge}!\"</p><br/><p>\"Ranged players, maintain a distance of about 10 meters, between each of you. That can prevent the {Frosty Edge} from hitting multiple targets in one shot. As for the Melee players, we have no choice but to go head on. You know what to do!\"</p><br/><p>Zhang Yang took a deep breath and said, \"Now, move out!\"</p><br/><p>He activated his {God of War Transformation}. His wings spread out, as usual, looking like a god with all the seven-colors of the rainbow emanating from him.</p><br/><p>However, Fatty Han did not activate his {Vampire Transformation}.</p><br/><p>It was an insurance for them. Just in case the party fails to kill the boss in 2 hours, Fatty Han could still transform and take over as a tank in Zhang Yang’s place. Although he was a Hunter, with his {Vampire Transformation}, Fatty Han should be able to take more hits than anyone else. As long as he could buy enough time for the special effect of {Glare of the Death God} to kick in, it would become possible for the party to kill the boss!</p><br/><p>\"This is not a place for mortals like you to be! Get lost!\" Maron Curse let out a thunderous voice that rocked the entire place. Every breath he released turned into ice and frost. Grains of ice particles formed above the players and rained down upon them like a rain of hail.</p><br/><p>The boss swung his hand and palmed at Zhang Yang like a martial artist.</p><br/><p>Although Zhang Yang could move swiftly in {God of War Form}, his Movement Speed had been reduced by 50% the moment he enters the effective range of the {Frost Aura}. So, he had to take the hit. It would not have been possible for him to dodge the attack, even if he was not affected by the Movement Speed Reduction effect.</p><br/><p>Zhang Yang did not hesitate at all as he took that opportunity to throw the {Glare of the Death God} at the boss. Even though the Level Gap Suppression was punishing them now, {Glare of the Death God} would still ignore Defense and Damage Immunity effects! This Skill could really be deemed as the best ‘boss-killer’ in the entire game!</p><br/><p>A dark skull formed on the head of the boss... the Skill was a success!</p><br/><p>Everyone was crying in tears of joy as they were worried about it being resisted. It was a nerve-wracking moment for them to wait and see if the Skill would be resisted or not! The party quickly got into the positions that they were meant to be as they unleashed their assaults on the boss. Waves of fierce assaults rained upon the boss without any moment of pause.</p><br/><p>The only thing that mattered in order to trigger the special effect of the {Glare of the Death God} was the rate of attacks. The damage did not apply anymore when it all comes down to that! With more players attacking the boss, the {Glare of the Death God} would be triggered more frequently. The HP of the boss was reduced by 10% in just 5 seconds! It was a good start for Zhang Yang and his party.</p><br/><p>\"You have angered me, mortals!\" Maron Curse let out a raging roar and pointed one of his fingers at Wei Yan Er. A cloud of ice suddenly appeared, on top of the little brat. The next thing that happened was ice arrows raining down upon the little brat!</p><br/><p>The little brat was shocked, but she managed to react just in time as she urged on her [Winged Tiger] to run. Although her Movement Speed had been reduced by 50%, the Movement Speed of her [Flying Mount] was much faster than the Movement Speed of a player. Furthermore, the ice arrows only covered 10 square meters of space. Wei Yan Er was only struck once before she got out from the effective range of the ice arrows.</p><br/><p>As the Melee-type players were more concentrated in one spot, Wei Yan Er was not the only one who got struck by the ice arrows. Sun Xin Yu was standing within the range of the assault as well. Fortunately, the central point of the attack was the little brat, so Sun Xin Yu managed to get out of the range right before the ice arrows hit her.</p><br/><p>The battle had just begun. Although the equipment on everyone had improved significantly ever since they took on Vampire Count Ferra, the total amount of damage they could deal to the boss after each passing second was still far from enough. It could be described as pitifully low! This was all thanks to the Level Gap Suppression function of the game! On the other hand, the boss could deal about 110,000 damage to Zhang Yang with just a normal slam! If the Level Gap Suppression function would trigger 5 times of damage, the damage that the boss could deal on Zhang Yang would reach up to 300,000 damage!</p><br/><p>That was not a Critical Hit! It would become even worse than that if the boss strikes Zhang Yang with a Critical Hit!</p><br/><p>The boss also had {Frost Ring} which could freeze all targets within the effective range of the Skill. If Zhang Yang could not unfreeze himself in time, the worst case scenario was that he would be receiving a total of 600,000 damage in a single hit from the boss! Without the support of an {Inheritance Transformation}, any Tanker would be instantly killed!</p><br/><p>Of course, that was possible, because of the Level Gap Suppression function of the game. Furthermore, that amount of damage would only be possible if the Level Gap Suppression function of the game had triggered 5 times the regular damage. It would not be possible for the boss to deal such high damage under normal circumstances!</p><br/><p>The 13 Healers were healing Zhang Yang with their might. After all, Zhang Yang had over 7,000,000 HP. They did not have to worry about over healing Zhang Yang at all. All they were required to do was to heal until they ran out of MP. When that happens, they would just rest while waiting for their MP to recover, as they would fully utilize the rule of the 5-second gap to recover their MP bars.</p><br/><p>That was possible because Zhang Yang had a long HP bar. He would be able to last for 30 seconds against the boss, even if there was no one there to heal him. In other words, the healers could take half a minute break whenever they had healed Zhang Yang back to his full health state. That gave the healers a greater margin of error as they heal Zhang Yang.</p><br/><p>Even though Zhang Yang was supported with so many Healers from the rear, this boss was a real tough son of the b*tch to kill! The boss was constantly activating {Frosty Edge}, giving the party a hard time. Everyone was forced to move around dodging deadly ice spikes that were showering down on them while they were within the effective range of the Skill.</p><br/><p>Healers were required to stay still when they were casting their spells --- if they were mounted on a [Mount], their [Mounts] would have to stay still as well. Therefore, when everyone was forced to move around a lot, none of the Healers could heal Zhang Yang efficiently! It was already hard enough to heal Zhang Yang without any interruptions!</p><br/><p>The special effect of [Titan Chest plate] had also been nerfed a lot. However, it could still recover 20% of Zhang Yang’s HP. That would be about 1,500,000 HP out of his total 7,000,000 HP. Although he could only heal himself once every two-and-a-half minutes, he could heal himself by 10,000HP per second. That amount of healing was equally powerful as Fantasy Sweetheart’s healing! However, it would still be a little weaker compared to the healing capabilities of Han Ying Xue.</p><br/><p>In a nutshell, the situation was under control at the moment.</p><br/><p>\"My people, reveal yourselves, and fight for me!\" 3 minutes into the battle, Maron Curse roared into the sky. In an instant, the boss shattered into countless pieces of ice and scattered across the ground. Then, mini versions of Maron Curse spawned right from the shattered ice, one after another.</p><br/><p>--- that must be the {Frost Spawn}!</p><br/><p>[Frost Spawn] (Elite, Elemental)</p><br/><p>Level: 145</p><br/><p>HP: 1,000,000</p><br/><p>Defense: 0</p><br/><p>Attack: 20,415 - 28,415 (Determined as Physical Attack, but deal Frost Damage)</p><br/><p>Skills: None</p><br/><p>\"Regroup! Regroup!\" Zhang Yang quickly shouted out to all of his party members. The boss had vanished from the battlefield for the moment. The party did not have to worry about the threat posed by the {Frost Edge} anymore for now. They could gather in one spot and focus on their assaults on the Frost Spawns.</p><br/><p>Upon activation of {Vanguard’s Aggression}, Zhang Yang sent out a blue barrier out into his surroundings and shielded everyone within the barrier.</p><br/><p>Currently, he had 18 EP ready to be dispatched. If he wanted to use {God of War Devastation}, he could cause 300% Melee Attack of Physical Damage upon the 19 monsters at the same instant. That would be about 300,000 damage on each of the monsters if none of his hits was a Critical Hit.</p><br/><p>However, Zhang Yang was considering the limitation caused by the Level Gap Suppression function as well. With a Strength Attribute of 4,030, he could cause about 40,000 Chaos Damage to the targets as well. There would not be any limitation on that at all. On the other hand, he could dish out 6 blows of {God of War’s Crushing Strike} with 18 EP. He would be causing a total of 240,000 damage to the targets!</p><br/><p>After weighing the effectiveness of the two Skills, Zhang Yang decided to use {God of War’s Crushing Strike} as it could deal much more damage than the other option. The basic attack of the {God of War Devastation} was around 300,000 damage. After being nerfed by the Level Gap Suppression function of the game, the Skill would only deal around 150,000 damage.</p><br/><p>Furthermore, the {God of War Devastation} could only hit 19 targets at the same time. There was a total of 42 monsters in the area. It was still far from enough.</p><br/><p>In the end, Zhang Yang chose to use his {God of War’s Crushing Strike}.</p><br/><p>He raised the shield in his left hand up and smashed it hard on the ground. A beam of golden light poured into the ground and began to spread swiftly across the surrounding ground for a hundred meters. Boom! As the golden beam emerged through the surface of the ground, all targets within the hundred-meter range received 403,000 Chaos Damage!</p><br/><p>Right after that, the aggro of the monsters went over to Zhang Yang in an instance. All 43 Frost Spawns were moving towards Zhang Yang.</p><br/><p>{Blast Wave}!</p><br/><p>Zhang Yang struck out a conical-shaped blastwave towards the monsters and stunned every one of them. The replicated special effect of his [Sword of Purging Devourer] was triggered without surprise. However, the effect only popped once. Sigh... if only the replicated special effect of this sword had not been nerfed by the official, this {Blast Wave} would have triggered the special effect multiple times. He would have been able to take out at least half of the HP of these monsters!</p><br/><p>After giving some thought about it, it was true that the replicated special effect of his sword was too powerful, and was a legitimate bug!</p><br/><p>Everyone did not wait for Zhang Yang’s signal. They were launching their assaults as aggressively as they could at the monsters. Although everyone was also affected by the Level Gap Suppression function of the game, the monsters had 0 Defense. So, the damage everyone dealt with the monsters was a little higher compared to the amount of damage they were dealing with the boss. Furthermore, the Chaos Damage of the {God of War’s Crushing Strike} could ignore the effect of Level Gap Suppression. With Zhang Yang as the main attacker, these elite Tier monsters were taken out with ease.</p><br/>\n</div>"}