{"title": "Chapter 607: Saving the Villagers", "id": 607, "volume": 7, "url": "http://boxnovel.org/mmorpg-rebirth-of-the-legendary-guardian-chapter-607-saving-the-villagers", "volume_title": "Volume 7", "body": "<h1>Chapter 607: Saving the Villagers</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 607: Saving the Villagers</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Zhang Yang and the girls turned their heads around. Wei Yan Er beat the others to it and said, \"Grandpa, you want us to help you beat up those goblins right? No problem! You can count on us!\" She hated those Black Heart Goblins very much. Even if Charlie Moto did not ask for their help, she would still want to unleash hell upon those monsters.</p><br/><p>Charlie Moto was surprised by her enthusiasm. He froze for a second before he said, \"Err…that’s right. I really wanted to ask for your help in taking out the goblins! Not long ago, those goblins charged into our village and took away all the grown-up villagers. They took them over to their campsite and forced them to mine for every single day! I see that you guys got the Enhanced Antidote within such a short period of time. So I could tell, that you must be very capable and powerful. You should have what it takes to help us!\"</p><br/><p>‘Ding! Charlie Moto has given you a new quest: Saving the Villagers who were taken away, will you accept?’</p><br/><p>Accept.</p><br/><p>Zhang Yang and his two ladies accepted the quest at the same time. That was a Rank-A Hidden Quest. Zhang Yang suspected that the quest was not supposed to be as easy as slaying a few elite monsters. If that is the case, the final reward of this quest would not be worth the while.</p><br/><p>It would only make sense if Charlie Moto gives them another new quest! It was as expected by Zhang Yang.</p><br/><p>\"Grandpa, rest assured that we shall bring the villagers back, safe and sound!\"</p><br/><p>\"Thank you! I can’t thank you enough!\" Charlie Moto was tearing up as he thanked the gang.</p><br/><p>After placing the little girl with the old man, Zhang Yang and the ladies departed for the goblin campsite once again. Wei Yan Er was extremely agitated, as she could finally start slaughtering those goblins that had insulted her earlier on.</p><br/><p>[Saving the Villagers who were taken away] (Difficulty: Rank-A)</p><br/><p>Description: The grown-ups in the village have all been taken away by the Black Heart Goblins. Charlie Moto requested of you to save the villagers and bring them back as soon as possible! Warrior, do not underestimate these short and weak-looking creatures. Although these goblins do not have earth-shaking power, their technology is really something to be terrified of. That alone makes up for their physical deficiencies! Their leader Sosh, has a knack for inventing new stuff. He will invent some powerful weapons from time to time!</p><br/><p>Completion: Save the villagers 0/1</p><br/><p>Limit: 3 Players only.</p><br/><p>Upon reading the description of the quest, the three of them understood that the final boss of this quest would mostly be the goblin that goes by the name of Sosh.</p><br/><p>\"Can three of us take care of the boss?\" Han Ying Xue was a little worried.</p><br/><p>Zhang Yang gave it some thought and said, \"The quest is only a Rank-A difficulty. Furthermore, the quest limited the participants to only 3 players. No matter how powerful the boss is going to be, it has to be within a reasonable degree of difficulty. Furthermore, if the three of us cannot handle this, then other parties would never stand a chance!\"</p><br/><p>Han Ying Xue and Wei Yan Er were nodding their heads to express their agreements.</p><br/><p>That was a boast. By public opinion, Zhang Yang was undeniably the best Tanker in the entire world. Han Ying Xue was also one of the top Healers in the entire world. Wei Yan Er could do more damage than most of the top DPS players could in the entire world! With three of these powerful freaks joining up in a party, they could become one of the most powerful parties in the world! If they could not handle the boss, then no other party could!</p><br/><p>The only thing missing for the three of them was that Han Ying Xue and Wei Yan Er had not acquired their Inheritance. However, this quest was in the map that ranged from levels 100 - 130. Furthermore, dungeons and quests were not designed, based on the power level of players with Inheritance. It did not mean that players would not be able to complete the quests without having an Inheritance!</p><br/><p>The three of them arrived at the goblin campsite after a short journey. This time, what they saw before their eyes was a bunch of red-named goblins at the entrance.</p><br/><p>Wei Yan Er screamed in excitement as she hopped onto her Winged Tiger and charged over to the goblins. With her axe swung towards the monsters, one of the goblins was launched into the air.</p><br/><p>‘-27,084!’</p><br/><p>The Attack of the little brat was extremely high. Her axe had instantly caused a great deal of damage to that goblin. There were 4 goblins guarding by the entrance of the building at the moment. They were sharing the same aggro sight view. So when one of them was struck, the other three of them immediately went running towards Wei Yan Er while shouting \"Time is gold!\"</p><br/><p>Han Ying Xue quickly threw a Healing Spell onto Wei Yan Er and took over the aggro of the other three monsters. The monsters had to turn around to look for her.</p><br/><p>{Tornado Cleave}!</p><br/><p>The little brat went out with a quick whirl as she struck out with her {Tornado Cleave}. In just an instant, she caused 50,000 damage to each of the four monsters and succeeded in getting all four of their aggro back onto her.</p><br/><p>However, although the little brat could deal a lot of damage with each of her attacks, the four goblins were not willing to give in. They could deal about 10,000 damage with their normal attacks. If any of their attacks could trigger the Poison Effect of {Melamine}, their attack would cause an additional 10,000 damage. Wei Yan Er was in danger of falling before they do.</p><br/><p>With her current equipment, she would have no problem at all if she only takes on one elite Tier monster. With a Healer supporting her from the rear, she could handle two with ease. However, she would feel a little pressure if she was to battle against three. It would be impossible for her to battle four elite Tier monsters at once!</p><br/><p>\"Oy, if you can't stand the heat, get out of the kitchen! Tanking against monsters requires specific skill!\" Zhang Yang sighed pointedly he hopped off the back of his [Violet Thunderhawk]. Then, he activated his {Charge} and stunned one of the monsters. He even threw his {Provoke} onto a second monster, luring the monster over to him. With his {Horizontal Sweep}, Zhang Yang got into the thick of it!</p><br/><p>Upon causing 60,000 damage over the monsters within his attack range, Zhang Yang failed to get the aggro of the other two monsters over to him. The little brat was chopping and slicing the monsters like a b*tch in heat!</p><br/><p>However, because the two monsters had turned their attention towards Zhang Yang, the little brat was on much safer ground.</p><br/><p>\"Noob tank! You’re good, because your skin is thick enough! If I can also wield a shield, then I wouldn’t be scared of these little green shorties!\" Wei Yan Er was not willing to submit.</p><br/><p>Zhang Yang laughed out loud and said, \"Then, open your eyes and feast upon my greatness!\"</p><br/><p>He slung his shield over his back and struck one of the goblins that was attacking Wei Yan Er with his left hand. The powerful impact of his attack knocked the goblin off balance. With the monster being hit off balance, the goblin could no longer attack the little brat.</p><br/><p>‘Supporting Attacks’ had no attack intervals. It all depended on the fast-twitch muscles of a person. The faster you react, the faster you can swing your fist at your enemy. After a series of random knocking and pushing, the four goblins could not regain their ground as they spent more time staggering and stumbling about instead of actually fighting. If they could land a punch out of 10 attempts, it would be considered lucky.</p><br/><p>\"Do you get it now?\" Zhang Yang asked the little brat after demonstrating it.</p><br/><p>It has already been over half a year since he showed the little brat ‘Supporting Attacks’ for the first time. However, the little brat would still cling back to her own style where she would use her weapon to attack her targets. It was more exciting and interesting for her to do so. It would not affect her much when she is in a dungeon, slaying monsters or bosses. However, she would not be able to fully unleash her potential in a Player-vs-Player match!</p><br/><p>Wei Yan Er was the type who would act based on her emotions. If she was interested in something, she would be more keen to learn or know more about it. The more you try to stop her, the more she would want to find out. On the other hand, if she was not interested, even if you whip her, she would just ignore it. Now that she seemed to be very interested in learning how to use ‘Supporting Attacks’, Wei Yan Er began to imitate Zhang Yang. She also threw some punches at the monsters as she smacked the monsters with her left hand like how Zhang Yang did.</p><br/><p>However, although it seemed really easy to do it, it required the precise timing of the movement tracking of the monsters. Furthermore, it would also require outstanding brainpower. The monsters would not stand there like dummies waiting for players to hit them in the face. They would be dodging attacks coming from the players as well. So, players would need to react accordingly to the situation. Although it seemed easy watching Zhang Yang throwing his punches at the monsters, it had taken him about half a year to master it.</p><br/><p>Wei Yan Er was not willing to admit it when Zhang Yang was looking down at her with a disdainful look on his face. The little brat felt challenged, so she picked it up and took it as practice on the spot. She was naturally born to be active. She had a talent in athletics. After a few tries, she managed to pick up a thing or two about it. She could already land a third of her punches with success!</p><br/><p>The little brat was very happy and satisfied with what she just learned to do. She was not having enough of it yet, even after the four monsters were killed, one after another. She kept complaining that Zhang Yang should not have punched the monsters so hard. She blamed Zhang Yang for not letting her have enough fun. If these four monsters could come back to life, they would definitely be cursing the little brat for punching them harder than anyone else!</p><br/><p>They were never short on monsters. The moment when the three of them entered the ‘house of cogs’, they engaged in battle with a group of three. The three goblins charged straight at them. It was a good thing, because the little brat got to practice a little more of her ‘Supporting Attacks’.</p><br/><p>After some more slaughtering along the way, the three of them made their way to the second floor of the building.</p><br/><p>Wei Yan Er was really talented in such regards. She had already mastered the technical knack of it. The way she was performing her ‘Supporting Attacks’ was very similar to the way Zhang Yang would do it! Zhang Yang could not help but feel very surprised. If he and the little brat had started playing the game at the same time, he would definitely not have been able to catch up the progress of the little brat!</p><br/><p>However, Zhang Yang did not have anyone to guide him in his previous life. He could only rely on himself by observing the footage of top Tier players battling against each other. Currently, Wei Yan Er had him to guide her wholeheartedly. So it would still make some sense even if she was progressing much faster than anyone could.</p><br/><p>The monsters on the second floor were a little more powerful than the monsters on the first floor.</p><br/><p>[Black Heart Goblin (Highly Configured)] (Elite, Humanoid)</p><br/><p>Level 115</p><br/><p>HP: 1,150,000</p><br/><p>Defense: 1,200</p><br/><p>Range Attack: 9,779 - 11,779</p><br/><p>Skill:</p><br/><p>[Shadow Glue Bomb]: Throw a bomb towards the target and detonate in an area of 3 X 3-meter square. All targets within the effective area will be afflicted with the Shadow Glue Venom, causing 15,000 Nature Damage to all targets. All targets will be disgusted and vomit for a period of time. Lasts for 3 seconds</p><br/><p>Note: Black Heart Goblins are the greediest race in the entire Secret Wonderland. They are delusional enough to want to get their hands on the possessions of gods. They have always wanted to become the richest in the entire world.</p><br/><p>The moment Zhang Yang and the ladies revealed themselves in the sight of the monsters, they were greeted by 4 goblins with their mechanical guns. The metallic bullets were fired at them rapidly. The sounds of bullets clashing onto the armor of Zhang Yang and Wei Yan Er were like raindrops falling on metallic rooftop. Meanwhile, Han Ying Xue was rained upon with the bullets as well. However, her white dress was tainted in red by her own blood that was spilled by the bullet hits.</p><br/><p>Zhang Yang quickly dashed forward as he was approaching the monsters in just an instant. With a swing of his [Sword of Purging Devourer], Zhang Yang caused a damage onto all four monsters and took their aggro over to himself.</p><br/><p>Although these monsters were much more powerful than the previous monsters they had encountered, they would not be able to match the threat that Zhang Yang and the ladies could pose to them. The one Skill that they had was rather disgusting. Every time the three of them could not stay clear of the effective area of the detonation, they would receive some damage and also vomit overtime. Wei Yan Er and Han Ying Xue were crying bitterly every time they were afflicted by the effect of that Skill.</p><br/><p>\"Wu wu wu --- What a bunch of disgusting monsters! I hate them!\" Wei Yan Er could not help but to stick out her tongue as she vomited.</p><br/><p>Because the {Shadow Glue Bomb} was considered as a Skill, the Accuracy of the monsters could not be affected or interrupted by neither Skills nor ‘Supporting Attacks’. Therefore, they had to take the damage of the {Shadow Glue Bomb}, head on every single time. That helpless kind of feeling was not good at all.</p><br/><p>The monsters on this floor were disgusting and abundant in numbers. It took about an hour for the three of them to clear the entire floor. The two ladies were disturbed and annoyed at the same time as they mechanically went on their way with stiff faces. They vowed that they were never going to repeat doing this ever again.</p><br/><p>The last stage was a vast hall. There were many cages right beneath the hall. Humans were caged in those cages. There were messages right on top of each human in the cages. Those were the targets that Zhang Yang and the ladies were required to rescue. However, there was another goblin lying in a pile of cogs and metallic wires --- the leader of the Black Heart Goblins, Sosh!</p><br/><p>[The Inventor Sosh] (Mythical, Humanoid)</p><br/><p>Level: 120</p><br/><p>HP: 36,000,000</p><br/><p>Defense: 5,200</p><br/><p>Melee Attack: 31,397 - 41,397</p><br/><p>Skills:</p><br/><p>[Melamine]: Upon hitting the target, there is a 50% chance to infect the target with Melamine, causing 50,000 Nature Damage to the target.</p><br/><p>[Shadow Glue Bomb]: Throws a bomb towards the target that detonates in an area of 3 X 3-meter square. All targets within the effective area will be afflicted with the Shadow Glue Venom, causing 15,000 Nature Damage to all targets. All targets will be disgusted and vomit overtime. Last for 3 seconds</p><br/><p>[Gutter Oil]: Pave the area of a 30-meter radius in the surrounding, causing 10,000 Nature Damage to all targets within the effective area once in every 3 seconds. All targets will also be afflicted with 50% chance to slip and fall.</p><br/><p>[Berserk]: When Sosh’s HP is below 10%, he will enter a state of Berserk! Attack will be increased by 50%. Movement Speed will be increased by 50%.</p><br/><p>Note: This is the leader of the Black Heart Goblins! He’s a genius in inventing stuff. The Melamine, Shadow Glue, Gutter Oils and other poisons are part of his inventions!</p><br/>\n</div>"}