{"title": "Chapter 613: Hunt for the Mello Ram", "id": 613, "volume": 7, "url": "http://boxnovel.org/mmorpg-rebirth-of-the-legendary-guardian-chapter-613-hunt-for-the-mello-ram", "volume_title": "Volume 7", "body": "<h1>Chapter 613: Hunt for the Mello Ram</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 613: Hunt for the Mello Ram</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p> \"Wow! This quest is giving me a Violet-Platinum bow! Wow! Woohoo!\" Fatty Han immediately shouted out with sarcasm like an ungrateful son of a b*tch. He tried to act as if he had never seen a good equipment before.</p><br/><p>Zhang Yang shook his head and said, \"Fatty... we are now capable of taking on Ethereal Tier bosses like a normal routine. Why can’t you just be better than this? You should wet your pants over Holy Tier equipment, not this!\"</p><br/><p>\"Haha!\" Fatty Han did not feel any shame as he laughed it off, \"This equipment is not bound upon pickup. I shall sell it when I get it!\"</p><br/><p>Zhang Yang frowned, When did this wretched fatty learn how to act like Han Ying Xue and Wei Yan Er? All he could think about was money? Why would he need so much money then?</p><br/><p>Zhang Yang did not pry further as he knew that the fatty would say that he would use the money to get married and to get the financial support for the baby powder to be used by his future son. He would crap tons of endless sh*t from his mouth, all day long. Zhang Yang wanted to avoid that. So he urged the fatty to move his *ss.</p><br/><p>After leaving the village, both of them summoned their Pets and headed towards the deep part of the jungle. At first, they encountered quite a number of normal Tier monsters such as wolves and leopards. It only took one hit from Felice to kill them all. Fatty Han could not help but feel envious of her. After all, his big boobie Battle Companion Napolita had initially started off as Yellow-Gold Tier. Although he had given a number of Violet-Platinum equipment to Napolita, it would still be much weaker than Felice who already has an entire set of Mythical Tier equipment on her!</p><br/><p>However, the main reason why Fatty Han chose Napolita as his Battle Companion was not based on her capability in dealing a large amount of damage. It was simply because of one ‘boring’ reason. The wretched fatty said, \"Little Yang, take a good look at that ---\"</p><br/><p>Every time Napolita swung her weapon, that pair of juicy boobies would shake and jiggle violently!</p><br/><p>\"Isn’t it marvelous?\" the wretched fatty began to reveal a perverted smile on his face.</p><br/><p>Zhang Yang cupped his hands upon his own forehead, then he said, \"If I did not know better that you already have a girlfriend, I would have thought that you would even drool upon seeing a female pig! You look like you just came out of jail after decades without seeing a woman!\"</p><br/><p>\"Haha! This is called ‘Discover the sexy stuff’! How was it? Are you contented to see that?\" The fatty was beyond redemption!</p><br/><p>Zhang Yang did not want to waste his breath at Fatty Han, so he patted Thunderhawk and charged forward. The jungle was thick. They would not be able to see what was on the ground clearly if they were to fly too high up. Therefore, Zhang Yang and Fatty Han commanded their Flying Mounts to go on foot.</p><br/><p>It seemed that it was part of the system’s purpose.</p><br/><p>Players could simply fly across the jungle if they were only passing through in a hurry. On the contrary, if the players are here to complete a quest, they would have to be obedient and stay on the ground. Players should follow the intended design of the system and clear out monsters that were designed to become the obstacles while completing the quests. Unless the players already know the exact location of the Mello Ram, players would need to clear out the monsters in their path in order to locate the boss. It would be silly to think that they could escape battles with the monsters if they had Flying Mounts.</p><br/><p>With both of their strength combined, Fatty Han and Zhang Yang were unstoppable, in this jungle at least. They basically killed the monsters that came in their way in almost an instant. They did not slow down their pace at all while searching for the Mello Ram. In just half an hour, they were in the thick of the mountains. The monsters that came out of hiding to attack them were all Elite Tier monsters.</p><br/><p>Unfortunately, they could not even locate a single goat or ram after slaying a few dozens of monsters.</p><br/><p>Both of them proceeded deeper into the jungle. Tens of minutes passed, and they finally located their target. It was a gigantic ram with a pair of large and sharp horns on top of its head. The size of this ram was as large as the size of an elephant! Violet fur grew all over its body. The ram looked intimidating, even though it was just standing there, tugging at the grass on the ground.</p><br/><p>[Mello Ram] (Violet-Platinum, Beast)</p><br/><p>Level: 135</p><br/><p>HP: 6,000,000</p><br/><p>Defense: 3,540</p><br/><p>Melee Attack: 19,298 - 23,298</p><br/><p>Skills:</p><br/><p>[Angular Thrust]: Uses its sharp horns to attack a target, causing 150% Melee Attack in the form of Physical Damage to the target.</p><br/><p>[Trample of War]: Stomps on the ground and causes 5,000 Physical Damage to all targets within the area of 10 X 10 meters. Reduces the movement speed of the targets. Lasts for 5 seconds.</p><br/><p>[Speed of a Ram]: Immune to all damage, lasts for 5 seconds. Movement speed will increase by 100%. Lasts for 5 minutes.</p><br/><p>Note: Mello Ram is one of the best materials to make the finest meals in the entire world! Unfortunately, the number of this species has is extremely low. Secondly, the species is extremely powerful! Therefore, only so few have had the pleasure of tasting the meat of a Mello Ram!</p><br/><p>\"Haha! So let me bring back enough meat to serve everyone with the meat of Mello Ram!\" Fatty Han immediately smacked the rump of his Spitfire Piglet and went up to a spot where he was approximately 30 meters from the Mello Ram. Then he began to let his arrows fly. His Spitfire Piglet was also spitting arrows of fire at the target.</p><br/><p>This Spitfire Piglet was one of the Violet-Platinum Tier Pets that was acquired while they were on the 12 zodiac mountains right before Baroque Island. As Fatty Han only had a Yellow-Gold Flying Mount, so of course he would choose a Violet-Platinum Tier Pet to engage in battle rather than a Yellow-Gold Tier Pet.</p><br/><p>At the same time, Fatty Han’s turtle pet also charged at the boss. The speed of his turtle was so much swifter than the movement speed of Zhang Yang’s Mythical Turtle!</p><br/><p>--- that was the advantage that a Hunter had over the other Classes. They could have a Pet Mount and a Pet at the same time.</p><br/><p>Zhang Yang patted his Thunderhawk and joined the battle as well. He swung his {Sword of Purging Devourer] as he began to accumulate Rage Points for later use. Upon accumulating enough Rage points, Zhang Yang struck out with his {God of War Devastation} and caused massive damage to the boss. With that hit, he managed to get the aggro of the boss over to him. The boss stopped charging towards Fatty Han as it turned around and charged towards Zhang Yang with its sharp and deadly horns.</p><br/><p>Although there were no Healers in the vicinity to aid them, the boss could only deal so much damage to Zhang Yang. As Zhang Yang had activated his {God of War Shield}, its normal attacks would only deal about 5,000 damage. Furthermore, Zhang Yang could also activate his {Block] to reduce one-third of the total damage taken. The total DPS of the boss had been reduced down to merely 1,600 damage!</p><br/><p>On the contrary, both Zhang Yang and Fatty Han had Inheritances to boost their stats up. Other than that, Felice was a Mythical Tier Battle Companion at the moment. Thunderhawk was a Mythical Tier Flying Mount as well. Only the Pet Mount of Fatty Han was a little below grade.</p><br/><p>The only ‘shortage’ here was that both Fatty Han’s Battle Companion and Pet Mount were not up to standard. However, that did not affect their performance at all. Besides, they were here to fix that.</p><br/><p>After just half a minute, the HP bar of the boss had dropped below 10%. The gigantic ram suddenly stomped the ground heavily and caused the ground to tremble. Zhang Yang and Napolita’s movement speed were reduced. With their movement speed reduced, the Mellow Ram took the opportunity to escape! Upon activating its {Speed of a Ram}, the boss disappeared into the jungle without a trace!</p><br/><p>Although the flying speed of Thunderhawk was extremely swift, no thanks to the movement speed reduction and the dense environment of the jungle, it could not glide freely through the air. Meanwhile, if they went too high above the ground, they would have lost the trail that the boss left for them to follow. Zhang Yang could only command Thunderhawk to crawl forward on foot as they witnessed the Mello Ram running into the wild and disappearing without a trace.</p><br/><p>Felice attempted to follow the boss as well. However, she kept running into trees and bushes. So she had also lost track of the boss.</p><br/><p>As for Fatty Han, he did not even react to the situation. After the boss had disappeared for quite some time, he opened his big mouth and asked, \"Huh? Did the boss run away?\"</p><br/><p>Zhang Yang finally understood why the quest was ranked as a Rank-B quest. Normally, a quest with only a Violet-Platinum Tier boss would only be ranked as a Rank-C quest. This boss could attempt to escape whenever its life is in jeopardy. Furthermore, the boss was f*cking fast! It made sense that the quest was deemed as a Rank-B quest.</p><br/><p>The two of them had to search for the boss. About two hours later, they finally found a Mello Ram. Was it the same one as the one they attacked? They had no freaking idea at all! However, although Violet-Platinum Tier bosses were no longer valuable, it would be illogical for the entire zone of a Level 120 - 150 map to be filled with numerous Violet-Platinum Tier bosses. It had to be the same boss.</p><br/><p>As the boss could recover its HP swiftly after it has disengaged from battle, of course, the Mello Ram would have a full HP bar. It was more than 2 hours ago since they had last engaged with the ram!</p><br/><p>Zhang Yang immediately charged up to the boss with Thunderhawk. Fatty Han began to launch his assaults on the boss as aggressively as possible. After just a brief moment, they managed to reduce the HP of the boss down to 10%! History repeated itself, as the boss did the same thing again. It activated {Trample of War} to reduce the movement speed of all enemies around it before it began to run on its {Speed of a Ram}!</p><br/><p>Zhang Yang quickly activated his {Warrior’s Will} in an attempt to remove the movement speed reduction on him. However, he had never thought this to be possible! The movement speed reduction effect on him could not be lifted!</p><br/><p>Although Fatty Han was prepared for the situation this time, he did not have enough firepower to take out the boss before it could escape. The boss still had over 10% of HP. Furthermore, the boss was in a 5-second ‘invincibility’ mode as it was running away! The two of them could only stare at the boss’s *ss while letting it slip through their fingers again!</p><br/><p>\"I finally understand why the fastest runners on earth are rams! Haih! Pity those leopards. They would have to run so fast just to get some food!\" Fatty Han sighed.</p><br/><p>Zhang Yang could only smile bitterly. This ram was so precise in its calculation! Once its HP bar got below 10%, the boss would begin to run. Furthermore, it would have 5 seconds of ‘invincibility’ while it was running! That had just made it very hard to kill!</p><br/><p>To kill the boss, there were only two options. One was to kill the boss in one hit when the HP bar of the boss was at 11%. By doing so, the boss should not have the chance to activate its {Speed of a Ram} and get away again. Another option was to mobilize a troop of players to surround the boss. After all, the boss could only be invincible for 5 seconds. If they had enough players in the vicinity, they could surround the boss and empty out the remaining 600,000 HP of the boss!</p><br/><p>However, the reward for this quest was only one Violet-Platinum Tier Bow. Furthermore, only Hunters could use bows. Which party would be so free to aid them in such a meaningless quest?</p><br/><p>Therefore, no one had ever managed to complete this Hidden Quest up to this point. In Zhang Yang’s previous life, two Korean players who seemed to be too bored at that moment came back to complete this quest when they reached Level 150. They came all the way back to kill this running champion with higher Tier equipment. Then they also completed a dozen of quests that were given by Karnoss. Fortunately for them, one of them was a Hunter. They managed to trigger the Hidden Quest for Hunter. That was how the two players managed to acquire a Phoenix pet.</p><br/><p>So, luck was also a part of one’s strength!</p><br/><p>It was a headache for Zhang Yang. If he forcefully summoned Sun Xin Yu and the others over, they would definitely be willing to help. However, the problem would be, how much ground could the 10 of them cover? Once the boss activates its {Speed of a Ram}, it would run faster than a Thief. How could 10 players possibly keep the boss around when that happens!</p><br/><p>If he were to summon the forces of Line Desert Smoke over ... this was a Level 120 - 150 map after all. They would be very far from ‘home’. Other than that, the level of the guild members would be too low to handle themselves on this map. Many would perish upon reaching this map. By the end of it, it would only be an act of exhausting his own guild members while he hoarded the benefits of the outcome! Zhang Yang had gotten used to solving problems all by his own. He would not risk others just to get what he wants, unless the situation forces his hands.</p><br/><p>Now that both of them could not use their Inheritance Transformation Skills, they could not possibly wait until the cooldowns to be over. Furthermore, they should prioritize on clearing out the final bosses for Han Ying Xue and Sun Xin Yu’s Class S Inheritance quests. So they should not waste it on such a weak boss! Without the support of their Inheritance Transformation Skills, it seemed to be impossible for them to kill the boss instantly when the HP of the boss is below 10%!</p><br/><p>The two of them made some adjustments to their strategy of taking down the boss. On their third attempt when the boss’s HP was below 10%, the two of them took a bottle of [Power Potion (Grade 10 Transmutation)]. Then, they activated their {Dance of the Heaven and Earth} at the same time!</p><br/><p>Unfortunately, although one {Dance of the Heaven and Earth} could cause a total of 100,000 damage, it would have to channel for 10 seconds to reach that amount. Upon encountering a target with the ability to become immune to attacks, they could not do any damage to the Mello Ram for 5 seconds. Although they could still cause damage to the boss with their {Dance of the Heaven and Earth} after the 5 seconds of ‘invincibility’ of the Mello Ram has passed, they only managed to cause about 140,000 damage to the boss. That was far from enough if they want to kill the boss!</p><br/><p>\"Why don’t we just let this go, little Yang? It’s just a crappy bow!\"</p><br/>\n</div>"}