{"title": "Chapter 619: The Secret", "id": 619, "volume": 7, "url": "http://boxnovel.org/mmorpg-rebirth-of-the-legendary-guardian-chapter-619-the-secret", "volume_title": "Volume 7", "body": "<h1>Chapter 619: The Secret</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 619: The Secret</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Fatty Han was still camping under a pile of snow even after Sun Xin Yu obtained her Inheritance. Since no one really knows when the Fox Snow Spirt will appear, Fatty Han could end up camping for weeks! Luckily, Fatty Han was commanded by Zhang Yang himself, if someone else were to instruct Fatty Han to camp that long, Fatty Han would have stuffed that person into an oven and had him camp inside there for as long as Fatty Han liked.</p><br/><p>Someone in the cold, lonely and dark forest, Fatty Han screamed into the snow, muffling his voice as he was yelled, \"F****CK THIS SH****T!\"</p><br/><p>Back to Sun Xin Yu, her Shadow Dancer Inheritance was particularly famous in her past life and had earned its fame by one skill, the {Dance and Slash}.</p><br/><p>[Dance and Slash]: Master the arts of the true stealth. Attacks will not forcefully displace the caster’s invisibility, enabling the caster to use all skills that could only be used during stealth. The skills require 10 Shadow Dancer Energy Points to activate. Lasts for 10 seconds. Every additional 1 Energy Point will increase the duration of the skill by 1 second. Cooldown: 30 seconds.</p><br/><p>The skill does provide an almost permanent invisibility. Even players like Zhang Yang who could track and trace invisible players, would not properly land a hit against players who have such a skill! The best part of it all was that the player could use skills like {Ambush} which are restricted to {Stealth}-only states.</p><br/><p>[Ambush]: Attacks the target with the primary weapon, deals 300% physical damage. Ignores all Defense and has a 60% chance of landing a Critical hit. Skill can only be activated in stealth mode. Required: Dagger. Cost: 60 Stamina.</p><br/><p>{Ambush} is a Thief’s strongest skill in terms of damage. Sadly, it could only be used during invisibility. Under normal circumstances, that is. For Sun Xin Yu’s case, {Dance and Slash} allows Sun Xin Yu to use {Ambush} unconditionally. Now, the only constraint Sun Xin Yu would face is the cost of the skill. Since the skill had no cooldown period, Thief class players were limited to their Stamina count. Since each skill will consume 60 Stamina, it was equivalent to 6 seconds of cooldown.</p><br/><p>By then, most of the players who found their initial Inheritance fragments had already completed their quests and acquired their Inheritance. Among Zhang Yang’s core party members, only Daffodil Daydream and Fantasy Sweetheart had not yet acquired Inheritances.</p><br/><p>Essentially, it was not that hard to acquire an Inheritance. It’s just that higher class Inheritance will indefinitely be difficult to acquire. The lowest Class Inheritance in Zhang Yang core party was a B class. Hence, Daffodil Daydream and Fantasy Sweetheart had set their goals higher. C class was never good but A class was too hard for them to undergo the entire quest ordeal. By the very least, they wanted to obtain a B class. Of course, A class would be their first choice.</p><br/><p>After waiting for a painful 11 days, Fatty Han finally called Zhang Yang. With tears rolling down his cheeks, the man cried out loud as if he has found his long-lost wife. \"I’VE FINALLY CAPTURED THE BLOODY FOX!\"</p><br/><p>However, right after he had captured the fox and informed Zhang Yang of the good news, the man logged out immediately and went to the toilet to settle, in real-time, 4 days’ worth of bath-debt. Within the four days, even when going to answer nature’s call, Fatty Han had refused to take off his gaming helmet and would have Xiao Wei led him to the toilet. Xiao Wei had even complained that since the man had not taken a proper bath for 4-f*cking-days, the man stank like a rotten fish!</p><br/><p>The in-game time was tweaked to be 300% faster than real time. Even though Zhang Yang had spent a great deal of time in the game, grinding was still extremely time-consuming. 4 days’ worth of real time had only earned Zhang Yang 2% experience points.</p><br/><p>Fatty Han took a great, relaxing bath and came back to the game.</p><br/><p>When Zhang Yang appeared beside Fatty Han after using the [Party Summon Order], Zhang Yang grinned and teased, \"Huhu. I see that you’re still alive and well. I expected you to lose some weight!\"</p><br/><p>\"Hahaha! Right you are my friend. Right you are. Just so you know, it’s been 4 days since I ate that meat! Just now, when Xiao Wei and I was taking a bath together, I gave her my fishing rod for her and she took like a champ! After one session of tug and pull, I gave her another sea cucumber—\"</p><br/><p>\"AHH YES! Enough. I don’t need to hear about your adventures in the bathroom. Let’s move on with the quest,\" said Zhang Yang quickly as he interjected Fatty Han.</p><br/><p>Along the way, Fatty Han showed the little Fox Snow Spirit to Zhang Yang and complained.</p><br/><p>\"What a troublesome quest!\"</p><br/><p>Fatty Han had never been a man of patience. In fact, he was the opposite of that, just like the little girl. 11 days of camping in the snow was just too long. \"Little Yang, I swear to god, if the quest reward is not as promising as you said it is, I’m going to take Xiao Wei to your house and bang her with my room door open! I’ll see how patient you’ll be! I’ll make sure Xiao Wei gets the best orgasm there! Her moans will pierce all your walls! Even at night, when you’re asleep, I’ll be f*cking her till kingdom come! I’ll---\"</p><br/><p>\"Please..\" Zhang Yang chuckled. \"Relax my friend. The quest reward will definitely be awesome. You’ll kneel down to thank me later!\"</p><br/><p>\"Poppycock! Are you only saying that to scare me off?!\"</p><br/><p>\"What?! Hmph. Suit yourself. Just don’t come over to my house.\"</p><br/><p>The two of them tracked through the snow and flew across lands, arriving at Kronoss’ house fairly quickly. Fatty Han hand over a small cage with the snow white fox.</p><br/><p>\"I would never have thought that a person as barbaric as you could actually capture a Fox Snow Spirt.\" Kronoss could barely contain his surprise. \"Hunter, I must say, you may not have the proper appearance of a hunter, but you have the ability and capability of one. Now, I have truly seen the world.\"</p><br/><p>Fatty Han rolled his eyes as he could not believe the man had just commented on his body size. It was, after all, a taboo.</p><br/><p>‘Ding! You have completed a quest: Hunt the Fox Snow Spirit. Obtained 500,000,000 Experience Points!’</p><br/><p>SHRING! </p><br/><p>With the 500 million experience points, Zhang Yang had immediately shot up by a level. Zhang Yang had accumulated to 78%, and so, with the system award, Zhang Yang gained a level instantly. On the other hand, Fatty Han had only just reached Level 120. His experience point gauge was practically at 0%. The amount of experience points reward had only pushed it up to 34%. That amount of experience points was worth 10 days of continuous grinding! As such, the number of days, he had spent camping had awarded him rather fairly.</p><br/><p>\"F*ck! Little Yang! You f*cking leecher! You’ve done nothing at all and you got the same quest reward! I’m so jealous…\" Fatty Han could have cried then.</p><br/><p>Zhang Yang laughed and patted his back. \"Don’t you know that guidance requires some fees?\"</p><br/><p>\"Oh really now…?\"</p><br/><p>Kronoss was not too smart of an A.I. Hence, even when Zhang Yang and Fatty Han was talking, he had started his own conversation with Fatty Han.</p><br/><p>\"Hunter, I had promised you that I will reveal a secret in exchange for the capture of the Fox Snow Spirit.\" Kronoss sat down and poured himself a cup of wine. \"Back then, when I was much younger. I was hunting for a white grizzly bear in the mountains. Incidentally, when I got lost, I stumbled upon a cave which led me to the discovery of a huge secret.\"</p><br/><p>\"What secret?\" Fatty Han asked. His curiosity was the same as a 5-year-old girl.</p><br/><p>Kronoss laughed at his reaction. He did not directly answer Fatty Han but started a new question instead. \"Do you know about the 10 Legendary Beasts?\"</p><br/><p>Fatty Han widened his eyes but ended up squinting them as he had no clue about the man was talking. He was another meat-headed fighter. He had little to no care about the game’s lore. To him, all of the lore and setting were just works of fiction. However, the bloody bugger did not even know when and where the first and second World War had taken place. How would someone as ignorant and oblivious as him dive into the details of the game?</p><br/><p>Zhang Yang himself was not too sure, however, he tried his luck. \"Are you talking about dragons and phoenixes?\"</p><br/><p>Kronoss nodded his head. \"Correct. Dragon and Phoenix are considered to be among the 10 Legendary Beast. There are others such as the Sky Devourer, The Golden Beast, Ten-Tailed Fox, The Hundred Headed Being, and many more. Those Legendary Beast possess powers that rival the god! Since there were only ten of them in the world, only a few fortunate people have seen their appearance. It has been a few thousands of years since their last appearance hence, their presence in the world had turned into myth and folklore.\"</p><br/><p>As such, Zhang Yang understood that Kronoss had indeed laid eyes on one. It should be the last quest reward. The Phoenix!</p><br/><p>Fatty Han was proactive in a way and quickly asked the old man the real question. \"Old fart. You’re saying, when you were younger, the secret that you had stumbled upon was related to the 10 Legendary Beasts?\"</p><br/><p>\"That’s right! You’re sharp there, young Hunter!\" Kronoss snapped his fingers.</p><br/><p>\"You’d bet I am! I am the kind of person who does not show off his knowledge! I’m a genius who acts like an idiot!\" said Fatty Han with a proud face.</p><br/><p>Zhang Yang dropped cold sweat. He could have just punched the fatso in his face. Kronoss would not have praised Fatty Han if he was not a Hunter. No matter how well did Fatty Han perform, Kronoss would not overly praise him. It was only done so because of the quest dictated it. Like the Battle Companion’s damage, everything will be counted as the owner’s DPS!</p><br/><p>Kronoss returned to the main topic and said, \"Back then, what I saw was a burning phoenix. Based on the ancient legend, when a Phoenix burns itself, it will be reborn again! Although the Phoenix could emerge back to life, the poor beast will lose all its memories, like a newborn baby! If the Phoenix has taken a fatal blow, it will still undergo the rebirth process since dying and killing oneself makes no difference to it. However, after being reborn, the Phoenix will be exposed to great danger. Since the newborn baby Phoenix must learn from its environment, it could be picked up by a human to train as a pet! How shameful would that be for the other Legendary Beast!\"</p><br/><p>Fatty Han smiled from ear to ear and asked, \"Old fart, did you or did you not capture the Phoenix?\"</p><br/><p>\"Ahh. I wanted to. But the Phoenix had made preparations. The Phoenix had set the entire place on fire. It was too hot then, I could not enter the cave!\" Kronoss shook his head. \"After 30 years, I have been thinking of a way capture the Legendary beast. However, no matter how many devices I have crafted, there was no way for me to enter the fiery pit!\"</p><br/><p>Kronoss took a sip and sighed heavily. \"I’m old. My bones are cracking and I can no longer draw a bow like before. Rather than throwing away my life to hunt the Phoenix and soar to the sky on its back, I’d rather enjoy my life here, sipping wine and smoking cigars.\"</p><br/><p>Fatty Han was holding in his frustration. \"It has been 30 years? In that case, the Phoenix should have finished its rebirthing process!\"</p><br/><p>\"Nah…\" the old man shook his hands. \"Based on the lore, when a Phoenix rebirths, it will take a very long time. In fact, when the rebirthing was complete, the baby phoenix will consume the fire around it as nourishment. I had only just been there a few days ago, the fire was still burning strong. The Phoenix had not yet completed its rebirthing phase.\"</p><br/><p>\"Old man. Where is it?\" Zhang Yang could not take it any longer. Fatty Han had been asking irrelevant questions.</p><br/><p>\"Hmm.\" Kronoss grinned. He took out a long cigar and lit it up. After he took a deep puff, the old man raised an eyebrow. \"What’s the matter? Intrigued?\"</p><br/><p>\"Of course! As a Hunter, there no way I would let such a beast to roam free!\" Fatty Han was excited yet he knew the exact words to say to Kronoss.</p><br/><p>\"Well said! Well said!\" Kronoss placed his cigar down. He held out his old wrinkled hands and took hold of Fatty Han’s flabby shoulders. \"I’ve given you the secret. However, there’s nothing more I can do to help. It depends on your luck now!\"</p><br/><p>\"Old fart! Leave it to me.\"</p><br/><p>\"It’s in a cave, located at the western side of the Londulr Hill. The cave is extremely small and the entrance is nothing but a tiny creek. You would have to keep both eyes open at all time!\"</p><br/><p>Kronoss gave Fatty Han a good slap on his shoulders and said, \"Young man, may Artemis, the Goddess of the Hunt be with you!\"</p><br/><p>\"I will give it my best!\"</p><br/><p>Zhang Yang was excited. Now that he had the location of the Phoenix, he hoped that the system would not design any more f*cking troublesome quests for them.</p><br/>\n</div>"}