{"title": "Chapter 611: The Dark Knight", "id": 611, "volume": 7, "url": "http://boxnovel.org/mmorpg-rebirth-of-the-legendary-guardian-chapter-611-the-dark-knight", "volume_title": "Volume 7", "body": "<h1>Chapter 611: The Dark Knight</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 611: The Dark Knight</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>This is the old lair of The Dark Knight Zhamido, the Silent Death Valley!</p><br/><p>Large powerful bosses would have a marked advantage. They would usually have a large number of monsters around them. There would also be bosses that were located in vast, however, having no other monsters at all around them. Players could just engage in battle with the boss without the trouble of fighting other monsters --- Of course, there were also some exemptions such as the Wraith King and the Demon Lord. There would be millions of monsters surrounding them!</p><br/><p>However, The Dark Knight Zhamido was alone in the boss stage. He was the only one ‘alive’ in the entire valley... oh, his War Horse too!</p><br/><p>[The Dark Night Zhamido, The Mouth of Death] (Ethereal, Spectre)</p><br/><p>Level: 150</p><br/><p>HP: 450,000,000</p><br/><p>Melee Attack: 75,409 - 95,409</p><br/><p>Defense: 9.950</p><br/><p>Skills:</p><br/><p>[War Horse’s Trample]: Zhamido commands his War Horse to shock the ground, causing 80,000 Physical Damage to all targets within the area of a 40-meter radius.</p><br/><p>[Fatal Strike]: Strikes the hammer on a target, causing 100% Melee Attack</p><br/><p>[Darkness Aura]: Darkness will shroud up everyone within the effective area of the Aura. Targets will be afflicted with 10% rate to become blind once in every 3 seconds. Last for 5 seconds. Aura Range: With Dark Knight Zhamido as the center point, by an area of 40-meter radius.</p><br/><p>[Death Entanglement]: Causes 100,000 Shadow Damage to the target. At the same time, recovers Zhamido’s HP by 200,000 points.</p><br/><p>[Immortality Build]: Recover 2% HP once in every 30 seconds. The amount of HP recovery will not be affected by any other Effects.</p><br/><p>Note: The Dark Knight Zhamido was once a Sacred Knight that believed in the Light. However, he was unable to resist the temptation of the Darkness as he fell to the Dark side. No one in the world would deny the talent and strength that he had! He once single-handedly destroyed the notorious Bayari Bandits!</p><br/><p>The Dark Knight wore a set of armor that was completely pitch black. Even the metallic armors that his War Horse wore were all black in color. The only part that was not entirely black was the two ignited flames of Spectre. They were green in color.</p><br/><p>Zhamido could be deemed to be much more powerful than Hachilles, even without his {Immortality Build} which allowed him to recover 2% of his HP once every 30 seconds. That Hachilles could only recover 1% HP once every 30 seconds while Zhamido could recover 2% HP! That made him worthy to be the final boss for the quest of a Class A Inheritance!</p><br/><p>Zhamido had over 450,000,000 HP and he could recover 2% of that amount of HP once every 30 seconds. In other words, he could recover up to 9,000,000 HP once, every 30 seconds! That would mean that he could recover over 300,000 HP in one second!</p><br/><p>Hence, the party should deal more than 300,000 damage within 30 seconds in order to deal effective damage to Zhamido! Furthermore, Zhamido could also activate his {Death Entanglement} to deal damage to his enemies while healing himself! If the boss can frequently activate his {Death Entanglement}, it would become extremely difficult for the party to bring down the boss’s HP!</p><br/><p>Zhang Yang took a deep breath in and said, \"We shall activate our Inheritance Transformation Skills together and settle this within 2 hours! If we can’t, the boss will settle us instead!\"</p><br/><p>\"Alright!\"</p><br/><p>Casting aside the issue about the total damage that they could deal to the boss, Zhang Yang and his party would still be facing a great chance of failing again if they did not have Inheritance Transformation Skills with them. Even if the Level Gap Suppression function could no longer affect them, the healing capability of Han Ying Xue and Fantasy Sweetheart still had not caught up to the damage that the boss could deal on the party. Therefore, they must kill the boss within 2 hours in order to solve that problem.</p><br/><p>\"Take your potions and move out!\" Zhang Yang took a bottle of Level 4 Power Potion. At the same time, he activated his {God of War Transformation} and his radiating wings sprouted out of his back, illuminating the surroundings. Zhang Yang fluttered his wings and flew straight into the sky. In a flash, he appeared right in front of the boss! He swung his [Sword of Purging Devourer] straight at the neck of the boss and triggered the boss battle!</p><br/><p>‘-125,922!’</p><br/><p>It felt great, without the limitation that the Level Gap Suppression function! Zhang Yang could finally strike with the power that is rightfully his! The damage that he could deal to this boss no longer sucked!</p><br/><p>Hundred Shots, Lost Dreams and the rest activated their Inheritance Transformations as well. Then, the party began to launch their assaults on the boss as aggressively as they could.</p><br/><p>\"Who dares interrupt me while I was in deep thought!\" Zhamido let out a screeching voice. His voice was like a supersonic, literally! The rocks and stones in the surroundings were trembling as the voice of the boss echoed through the entire area. Some of the rocks even cracked, as fragments of rocks crumbled down!</p><br/><p>The spectral flames that were burning dimly in within the two eye-sockets of the boss suddenly burst to life as they locked on Zhang Yang. He reached out and grabbed hold of a large hammer with runes all over it. The next thing the boss did was to swing the hammer straight towards Zhang Yang!</p><br/><p>Just before the hammer could land on Zhang Yang, Zhang Yang raised his shield up and protected himself from the powerful strike of the boss. A loud sound when the hammer and the surface of the shield clashed against each other echoed across the surroundings. The hammer clashed solidly into the shield and Zhang Yang was sent flying back by the powerful impact of the strike! In terms of strength, players would never be able to match with the high Tier bosses.</p><br/><p>\"Hahaha! I shall make drinking cups out of your skulls!\" Zhamido let out a sharp voice once again. It was extremely unpleasant to the ears of others.</p><br/><p>\"The description forgot to mention the boss has another Skill called ‘Brain-Piercing Demonic Voice’! It’s so annoying!\" Lost Dream could not help but ridicule the boss.</p><br/><p>\"That’s right! It’s like using a sharp stone to scratch the surface of glass! That screeching sound is deafening!\" Fantasy Sweetheart nodded to express her agreement.</p><br/><p>\"Open up your settings menu and lower down the fx!\" Zhang Yang said. At the same time, he threw his {Glare of the Death God} onto the boss.</p><br/><p>Resisted!</p><br/><p>Well, everyone was getting used to it already. The rate of being resisted was much higher than the rate of success, after all.</p><br/><p>However, it would not matter much anymore, as the Level Gap Suppression function of the game had finally been ‘nullified’. Everyone could finally perform at their regular standard. The players who had activated their Inheritance Transformation Skills were performing even better than expected as their firepower combined into something amazing!</p><br/><p>‘-262,289!’ {Horizontal Strike}!</p><br/><p>‘-369,332!’ {God of War Devastation}!</p><br/><p>‘-62,932!’ {Cripple Defense Add-on}!</p><br/><p>The Attack power of Zhang Yang could shame 99% of the players in the game! Furthermore, the special effect of the {Cripple Defense} which could provide an additional 50% damage to the weapon was triggered! It caused approximately 60,000 damage to the boss! Well, the {Cripple Defense} of 90% Tankers in the game could only reduce the Defense of bosses. Without any reduction in the boss’s Defense, the attacks from other players would only be able to forcefully cause 1 point of damage. They would not be able to penetrate through the high Defense of the boss!</p><br/><p>In Zhang Yang’s case, he was able to equip a two-handed weapon. Furthermore, he could increase his Attack by 5 times upon activating his {God of War Transformation}. Therefore, Zhang Yang could manage to amplify the damage dealt on the boss by up to 60,000 damage!</p><br/><p>\"Darkness shall devour you all!\" Zhamido let out a thunderous roar as the War Horse reared on its hind legs all of a sudden. Then, the horse began to stomp the ground repeatedly. A rumbling sound began to echo across the surroundings and the surface of the ground began to crack. Fragments of broken rocks began to shoot out randomly and caused approximately 80,000 basic damage to everyone in the surroundings.</p><br/><p>Players who activated their Inheritance Transformation Skills, like Hundred Shots and Lost Dream now had 20 times their HP. Therefore, that amount of damage was still bearable for them. On the other hand, although the ladies had not acquired their Inheritances yet, they had powerful Mythical Tier equipment. The total amount of HP on each of them had exceeded 100,000 HP! Furthermore, their mounts provided them with even more HP! That total amount exceeded 150,000 HP! After receiving a hit from the boss, they would still have almost half of their HP left. So the attack did not pose any lethal threat to any of them!</p><br/><p>This is the advantage of having an elite party!</p><br/><p>If it was the Crimson Rage division that had been sent to fight Hachilles going up against this boss, that wave of damage from the boss’s {War Horse’s Trample} would have killed a few dozen players back there!</p><br/><p>However, the large-scale AoE Skills of big bosses would usually have a much shorter cooldown period. In just approximate 10 seconds, the boss had activated his {War Horse’s Trample} once again as he commanded his war horse to stomp on the ground as heavily as possible.</p><br/><p>With the Skill being activated once again so soon, Han Ying Xue and the other ladies were forced to retreat.</p><br/><p>Although Han Ying Xue and Fantasy Sweetheart were healing the others at their very best, it would not be possible for them to heal everyone up within approximately 10 seconds. Upon receiving another wave of damage from {War Horse’s Trample}, they quickly withdrew from the front line and got out of the effective range of the {War Horse’s Trample}. They could not afford to get another hit from the same attack again. It was wiser to retreat first.</p><br/><p>Players who already had their own Inheritances had no reason to fear. Normally, Inheritances that are Class C and above would provide a life-saving Skill. Even without any support from the Healers, they could still activate their life-saving Skills and survive for another few minutes --- provided that they are not the main targets of the boss!</p><br/><p>Upon reaching beyond Level 120, the special effect of [Titan Chest Plate] that could allow players to recover HP had dropped even further. Zhang Yang could only recover 1% of his HP every second when the special effect is triggered. Therefore, he could only recover 10% HP with each activation of his {Shield Wall}. However, Zhang Yang had over 211,580 HP at the moment. His HP could reach up to 8,500,000 HP when he activates his {God of War Transformation}. That being said, he could still recover 850,000 HP by activating his {Shield Wall}. Furthermore, he would be able to activate his {Shield Wall} once every 150 seconds. He would be recovering more than 5,000 HP each second! It was a significant amount!</p><br/><p>Other than that, Zhang Yang had over 26,600 Defense and 4,612 Damage Absorption effect. Each normal attack of the boss could averagely cause about 40,000 damage to him. He could also activate his {Block} once every 6 seconds, reducing the amount of damage that he would receive each second down to 14,000 damage!</p><br/><p>The Skills of the boss that annoyed him the most were the {Death Entanglement}, the {War Horse’s Trample} and the {Fatal Strike}.</p><br/><p>{War Horse’s Trample} would be activated once every 12 seconds. {Death Entanglement} would be activated once every 30 seconds. {Fatal Strike} would be activated once every 20 seconds. With these attacks accounted for, the boss should be able to increase his DPS up to 30,000 damage.</p><br/><p>The boss would cause AoE attacks to all targets with his {War Horse’s Trample} while he could recover some HP with his {Death Entanglement}. Meanwhile, the boss could also slightly reduce the healing efficiency of Zhang Yang with his {Fatal Strike}. Every single Skill that the boss made the fight all the more challenging.</p><br/><p>Well, only Lone Desert Smoke has the capability of sending in one player with Class S Inheritance and four players with Class B Inheritance. That was how they managed to create a possibility for themselves to take down a Level 150 Ethereal Tier boss with a small party!</p><br/><p>The Battle Companions seemed to be much weaker in such battles. Only Healing-type Battle Companions could contribute to the battle by supporting the players with their healing abilities. The Assault-type Battle Companions were not able to reach their full potential in dealing damage to the boss, as they could not find much of a chance to touch the boss, to begin with. Since the party members were in desperate need of healing, the Healers did not heal the Battle Companions at all!</p><br/><p>Fortunate for them, the rate of activation for {War Horse’s Trample} was constant and thus, predictable. The Battle Companions could run up to the boss and launch their attacks for 3 seconds before they would have to withdraw. By doing so, they could at least support the party by dealing some damage to the boss without adding pressure to the Healers.</p><br/><p>In contrast to the Battle Companions, the Pet Mounts greatly aided the players. When the players were mounted on their Pet Mounts, the Pet Mounts would not receive any damage at all. As long as the players are still alive, the Pet Mounts would be able to dish out all their damage to the enemy. However, Zhang Yang could no longer mount his Pet Mount upon activating his {God of War Transformation}. So Thunderhawk could only join the Battle Companions as they supported the players from the rear.</p><br/><p>\"Let the darkness devour you!\" Zhamido continued to screech in a sharp voice that pierced through everyone’s ears. His voice could also be considered as an ‘effect’ that affected the battle a little. It was extremely annoying even though it could not cause any damage to everyone!</p><br/><p>As the party was struggling through the battle under the influence of the boss’s voice, the boss activated his {Darkness Aura}. This Skill was the only Skill that would not cause any damage to the players. However, the Skill was as annoying as the other Skills that the boss would use. It caused the players to lose sight of the battle every once in a while. They would not be able to attack or to do anything at all, whenever that happens. It could almost halt the DPS of the party completely!</p><br/><p>90%, 80%, 70% ... The Inheritance Transformation Skills were really packing a punch on the boss. Without the effect of Level Gap Suppression function, the HP bar of the boss was decreasing rapidly!</p><br/><p>In just 40 minutes, the HP bar of Zhamido had entered below 20%. That was the time when the party had finally entered the ‘killing cleave’ stage.</p><br/><p>Zhang Yang activated his {Shadow Clones} to increase the rate of his attacks. Upon reaching beyond Level 120, he had acquired an additional Skill Point. So he added the Skill Point to his {Shadow Clone} skill, upgrading it up to Level 3. Now, he could summon 3 Shadow Clones at the same time. Although each of his Shadow Clones could only deal 10% of the damage that he could deal to the enemy, 3 Shadow Clones would mean that he has acquired 30% additional damage.</p><br/><p>Upon activating {Indiscriminate} and gulping down a bottle of [Power Potion (Grade 10 Transmutation)], Zhang Yang struck the boss with his {Killing Cleave}!</p><br/><p>‘- 2,937,948!’</p><br/><p>‘- 293,794!’</p><br/><p>‘- 293,795!’</p><br/><p>‘- 293,794!’</p><br/><p>Thanks to {Indiscriminate}, everything was a guaranteed critical hit! Furthermore, the {Lucky Strike} was triggered at the same time, causing an extremely high damage value that reached up to 3,000,000 damage! Furthermore, the 3 Shadow Clones provided additional toppings to the cream. So Zhang Yang and the Shadow Clones had managed to cause approximately 4,000,000 damage to the boss in that instant. They had struck away almost 1% of the boss’s HP in one go!</p><br/><p>\"What the f*ck! That strike was insane! Zhan Yu!\" Lost Dream was breathless after seeing Zhang Yang taking out about 1% HP of the boss with only one strike. Even though the boss had a long HP bar, that 1% reduction was significant. Everyone was shocked by that.</p><br/><p>Wei Yan Er felt envious, then she said, \"Haha! Just wait till I get my hands on my Darkness Inheritance! Then, I shall be able to do that as well!\"</p><br/><p>\"You bastards! You’re merely puny mortals! It’s impossible for your power to match mine! I’m the god of Darkness! I’m invincible! I’m undefeated!\" Zhamido let out a roar. Well, it was more of a screech than a roar! The War Horse was stomping the ground more frequently than ever, and the effect of {War Horse’s Trample} spread across the ground endlessly!</p><br/><p>Under such a heavy onslaught, any player without an Inheritance would not be able to withstand the waves of damage at all. Han Ying Xue and the other ladies had to flee altogether. Hundred Shots and the other DPS players had to withdraw as well, after hitting the boss for a little while. They had to withdraw from the front line to the rear to get healed up by Han Ying Xue and the other Healers. The Healer-type Battle Companions also aided in healing up the rest of the party members.</p><br/><p>15%, 12%, 9%!</p><br/><p>Zhang Yang’s courage was mounting as the battle continued to progress. On the other side of things, the boss was backed against the ropes. He was on the brink of his death!</p><br/><p>However, Zhang Yang was forced to use all his life-saving Skills as well, while holding out against the waves of bombardments from the boss. In just a brief moment, Zhang Yang had already burned up all of his life-saving Skills and attack Skills. If they still could not kill the boss as soon as possible, Zhang Yang would have to give in and die as well.</p><br/><p>Hundred Shots and the others were aware of the situation. After getting healed up a little, they charged back into the battle to ease Zhang Yang’s stress. The Skills of Hunters and Thieves had cooldown periods as well. They also required Focus Points and Energy Points to activate their Skills. By withdrawing and getting back to the front line, they managed to wait out for the cooldown period and their FP and EP had enough time to recover, just enough for them to activate their Skills again! Although they might have lost a little DPS efficiency by doing so, the effects were not fatal.</p><br/><p>8%, 5%, 2%!</p><br/><p>\"You damned pests! There’s no way that you can defeat me! No way!\" Zhamido became hysterical as he began to make his final attempt to struggle against the inevitable!</p><br/><p>\"We’re almost there! I smell victory!\" Wei Yan Er was overwhelmed by joy as she began to jump around in excitement. Previously, they had failed to kill the boss so many times. Now that the boss was on the brink of his own demise, the little brat was super happy. She finally let go of her grudge that she had left brewing for a very long time.</p><br/><p>\"No! No! No!\" Zhamido screamed in misery as his last drop by HP was emptied out. The Dark Knight fell from the back of his War Horse and collapsed heavily on the ground. The War Horse neighed violently as it stomped its hoofs on the ground repeatedly. Then, the horse ran off into the wild and disappeared from everyone’s view.</p><br/><p>\"Haih! Husband and wife are birds of the same forest. But when disaster strikes, they fly off in different directions for safety! So now that the husband is no longer ‘reliable’, the horse ran away! Haha!\"</p><br/>\n</div>"}