{"title": "Chapter 615: Darkness Inheritance", "id": 615, "volume": 7, "url": "http://boxnovel.org/mmorpg-rebirth-of-the-legendary-guardian-chapter-615-darkness-inheritance", "volume_title": "Volume 7", "body": "<h1>Chapter 615: Darkness Inheritance</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 615: Darkness Inheritance</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Violet-Platinum boss drops were nothing but scraps to sell. However, drops of a Mythical tier boss were very different! The Golden Vermillion Burning Python was Level 135, hence, the equipment dropped by the boss should be Level 130! Even though the equipment drops do not have the special lowered level requirement, it was worth keeping since Level 130 was just above the horizon. If they could not get their hands on an Ethereal tier equipment, a Mythical tier would be the second choice.</p><br/><p>The boss had only dropped a sad number of loots. There were only two Mythical tier equipment and three Violet-Platinum equipment. There were no skill books… Only an open-world boss of a map would drop luxurious items such as skill books or skill points. Mythical tier bosses were nothing but side bosses that would never drop anything precious.</p><br/><p>The obtained loot was a Heavy Armor Helmet and a Leather armor Chest Plate. Since Zhang Yang was only wearing a Violet-Platinum tier helmet, he took the Mythical tier helmet. If he is unable to get his hands on an Ethereal tier equipment, the helmet would be his backup.</p><br/><p>[Python Helmet] (Mythical, Heavy Armor)</p><br/><p>Defense: +160</p><br/><p>Vitality: +1,926</p><br/><p>Strength: +905</p><br/><p>Dexterity: +393</p><br/><p>Equip: Increases 3,850 maximum HP.</p><br/><p>Equip: Increases 3.5% damage and healing rate.</p><br/><p>Equip: Absorbs 384 damage on attack.</p><br/><p>{Unidentified}</p><br/><p>Level Requirement: 130</p><br/><p>Starting from Mythical tier onwards, equipment tended to prioritized on attack and defense value. Hence, the helmet was extremely ambiguous in a way that it could be of offensive and defensive at the same time. Normally, defensive type equipment will be prioritized for tanks. Only with a strong tank present in a party, the party could move forward without any problem.</p><br/><p>Since the little girl was not around, Zhang Yang took the item, since he was the only person there could equip Heavy Armor.</p><br/><p>The Leather Armor was given to Fatty Han, Sun Xin Yu had given it up for him. Perhaps, it was a favor for Zhang Yang. Fatty Han was so touched that he had grovelled at her feet whilst crying about brotherhood or sisterhood. Sun Xin Yu was agitated that she had even threatened to have the item back if he does not stop his nonsense.</p><br/><p>After the boss was killed, the three women went back to town. Fatty Han took the quest item [Gold Vermillion Burning Python’s Gall].</p><br/><p>\"You’re something I have never see before!\" Kronoss took the gall that was almost the size of a human brain. He turned to the kitchen and yelled, \"Dearest, get me the mead flask, we can make some snake gall mead!\"</p><br/><p>‘Ding! You have completed a quest: The Hunt for the Golden Vermillion Burning Python. Obtained 20,000,000 Experience Points!’</p><br/><p>Compared with Fatty Han, Zhang Yang had obtained much more experience points as compensation for Fatty Han obtaining a skill. The quest had awarded Zhang Yang with 50,000,000 experience points!</p><br/><p>\"Hunter, you have proven your bravery and Intelligence. Now, to further prove yourself as a true hunter…\" Kronoss hold his hand up and sank his teeth into a large piece of meat. After taking his slow sweet time enjoying the piece of the shank, Kronoss spoke with his mouth still chewing. \"A Hunter *munch* you must have *munch* *munch* *swallow*. You must have patience! Patience comes first above all else! For a true hunter would wait for days to hunt their prey!\"</p><br/><p>Kronoss looked into the distance and said, \"I was wild back then. I remembered a few days ago, I was hunting for a Fox Snow Spirit. I had covered myself in the snow for seven days and seven night, surviving only on dried food and melted snow water to keep myself going. It was painful. The frostbites…However, my effort paid off when the Fox had lowered his guard and came out of its nest to hunt for good. Right then, I waited until the last moment and capture the critter with my bare hands! Look at this! The coat I’m wearing right now is made from the fur of the Fox Snow Spit! This is something not even the king could buy!\"</p><br/><p>Seven days and seven nights? Fatty Han cocked his head and raised a suspicious eyebrow at the man. Frostbite? The man should have been frozen solid!</p><br/><p>\"Hunter. You will do as I do and hunt a Fox Snow Spirit! You must capture it alive and well! Not a single wound on the critter! Do that and I’ll tell you a big secret!\" said Kronoss as he whispered.</p><br/><p>‘Ding! Kronoss has a quest for you: Hunt the Fox Snow Spirit. Will you accept it?’</p><br/><p>Zhang Yang and Fatty Han took the quest without hesitation.</p><br/><p>[Hunt the Fox Snow Spirit] (Difficulty Level: NIL)</p><br/><p>Description: Kronoss had entrusted the task of hunting a Fox Snow Spirit to you. Complete the challenge to prove that you have the quality of patience of a true hunter. Be advised, the Fox Snow Spirit you are asked to hunt for must be at full health. A single bit of damage on it will cause the quest to fail. You can try your luck at the Snow Spirit Canyon. Remember hunter, the key to success is patience. Hint: Fox Snow Spirits loves to eat Pale Stripe Weed.</p><br/><p>Completion: Capture a Fox Snow Spirit: 0/1</p><br/><p>The reason for the quest not being graded with a difficulty level was due to the fact a it was not going to be a contest of power. A battle was not necessary, however, the process of capturing an unharmed Fox Snow Spirit could be difficult. For players such as Sun Xin Yu, who would go as far as starving for days to kill a certain target, the quest would be a piece of cake. However, for players as rash as Wei Yan Er, the quest would be close to SSS difficulty, if such a level exists in the first place.</p><br/><p>The two of them went on with their journey and arrived towards the Snow Spirit Canyon. The trip was extremely fast and quick since the quest had given them a specific location. The place was extremely cold. Aside from the monotone color of the place, there was nothing else but snow and the sky.</p><br/><p>Based on the quest guide, Zhang Yang and Fatty Han split up and found three places that spawned the Pale Stripe Weeds. Based on Zhang Yang’s understanding of the quest, a Hunter could plant a trap around the weeds and capture the Fox Snow Spirit, alive and unharmed. All Fatty Han needed to do then was to set a trap, let the fox spring the trap and the quest will be completed.</p><br/><p>There was a huge problem with his plan. A Hunter’s trap skill could only last for 1 minute while the spawn points of the Pale Stripe Weeds were at least 5 minutes apart from each other. Hence, they would have to choose one out of the three and plant their trap there. If they are unlucky, and the fox chooses to pick a different spot to feed, Fatty Han would be waiting for a very long time.</p><br/><p>As such, like the quest had indicated, patience is the key to victory!</p><br/><p>Both of them draw lots and headed to their own designated weeds spawning location to set up a trap. After that, there was nothing much to do but wait. Patiently.</p><br/><p>1 hour had passed painfully and comes the 2 hours. By then, the two had waited for more than 3 hours continuously placing traps here and there. Since Zhang Yang was only assigned to watch as he did not own any trap skills, he decided to not waste his time there and left. Before he did, he gave Fatty Han the [Party Summon Order]. When Fatty Han finally captures a Fox Snow Spirit, he can call him over. Zhang Yang went back to White Jade Castle and did his usual business, from grinding levels to crafting potions and etc.</p><br/><p>The poor Fatty Han was left alone in the Snow Spirit Canyon for god knows how long. Zhang Yang did not care about the number of hours he had spent over there and laid down the ultimatum order, never to leave the place until he captures a Fox Snow Spirit. Kronoss had mentioned something about camping for seven days and seven nights, perhaps the challenge would be far longer for Fatty Han!</p><br/><p>…</p><br/><p>After working hard for two whole days, Wei Yan Er had finally managed to obtain the Darkness Inheritance. The little girl then shared with everyone the skills she had obtained and had caused several players like Hundred Shots who had only managed to obtain a B class Inheritance to feel extremely envious.</p><br/><p>[Shadow Wound (Passive)]: Permanently increases your damage by 45% and decreases incoming physical attack by 10%.</p><br/><p>[Darkness Transformation]: Be one with the Darkness, increases 400% damage dealt, 3000% HP increment, and gains a 30% chance to nullify incoming magic attacks. During the Transformation skill, you will gain 1 Darkness Energy Point. There will be skills that require the use of Darkness Energy Point to activate. Darkness Transformation will last for 2 hours. Cooldown: 72 hours.</p><br/><p>[Shadow Orb]: Creates a shadow orb to follow you or a target ally player. Under the protection of the Shadow Orb, the target will receive 50% less physical attack damage and will gain immunity to all Shadow Damage. Lasts for 10 seconds. Cost: 10 Darkness Energy Points. Every additional 1 Energy Point consumed to cast this skill will increase the duration of the Shadow Orb by 1 second. Cooldown: 30 minutes.</p><br/><p>[Dark Vengeance]: Strikes a target with the power of Darkness. Deals 250% melee Shadow Damage and corrupts the target with the power of shadow. Decreases all damage and healing rate by 10%. Cost: 50 Rage. Cooldown: 1 minute.</p><br/><p>[Darkness Corruption]: Temporarily controls a target as your pawn. Lasts for 10 seconds. Cost: 3 Darkness Energy Points. Each additional Energy Points consumed will increase the duration of the control by 2 seconds. Cooldown: 30 minutes.</p><br/><p>[Shadow Curtain]: Creates a 50 meters x 50 meters field of shadow, dealing Shadow Damage, 8x the value of your Strength value. Cost: 3 Darkness Energy Points.</p><br/><p>[Enemy of the Light (Passive)]: During the Darkness Transformation skill, deals 50% extra damage to a Holy attribute target. Receive 50% extra damage from Holy attribute damage.</p><br/><p>The little girl had acquired her Inheritance when she was Level 120, hence she had lots of skills to claim from her benefactor. Indirectly, Zhang Yang had just remembered to visit Ares the God of War to claim his Level 120 skill.</p><br/><p>\"NYAHAHAHAH!\" The little girl was so proud of herself and praised the A class Darkness Inheritance as the best Inheritance there was. Even though the damage boost was 5% lower than the God of War Inheritance, the skills it had were truly devastating!</p><br/><p>For example, the skill {Shadow Orb} could be used to reduce all physical attacks by 50%. Not only that it could be used on oneself, it could also be used to save others! Sadly, the skill was flawed in two ways. It had too long a cooldown time and also a maximum of 100 seconds of active duration. It was nothing more than a last measure to defend someone in need.</p><br/><p>\"Haha! Good job little brat! You’re actually growing now! Stronger but not any higher! HAHAHA!\"</p><br/><p>Everyone praised whilst teasing her at the same time and enjoyed her comical reaction of defending her height. Truly, an A class Inheritance was much stronger than a B class Inheritance.</p><br/><p>As Wei Yan Er was celebrating with everyone else happily, the poor Fatty Han was left alone in a pile of snow. Perhaps, he might come back to the guild in a year or two.</p><br/><p>Zhang Yang took his leave and visited Ares for his Level 120 skills. It was crucial, since he was about to fight Han Ying Xue’s Inheritance quest boss.</p><br/><p>[God of War Heavy Axe]: Instantly cleaves a target. Deals 100% melee physical damage if the target has higher HP % than you. Deals 300% melee physical damage if the target has lower HP % than you. Required: Melee Weapon. Cost: 50 Rage. Cooldown: 30 seconds.</p><br/>\n</div>"}