{"title": "Chapter 640: The Curtains Fall Perfectly", "id": 640, "volume": 7, "url": "http://boxnovel.org/mmorpg-rebirth-of-the-legendary-guardian-chapter-640-the-curtains-fall-perfectly", "volume_title": "Volume 7", "body": "<h1>Chapter 640: The Curtains Fall Perfectly</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 640: The Curtains Fall Perfectly</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>The moment the boss fell, all China players received a system notification. The King of Hansung Kingdom has been killed and everyone has gained a Level for free. On the other hand, the players of Japan-Korea region too had received a notification, for their King has been slain, everyone would have one Level deducted!</p><br/><p>Zhang Yang snickered. \"WTF!?\" was probably the phrase that every player in Japan-Korea region had blasted out in unison.</p><br/><p>They had been planning this for a few days and had even sortied all the strongest players of guilds, big and small from all over Japan and Korea. Only then were they capable of sending more than 40,000,000 players to conquer all major cities in China!</p><br/><p>How could they have known that the Chinese players would send only 3,000 players to take down a kingdom before they could! Right then, the only thing they could do to makes things even would be to take down a Kingdom.</p><br/><p>Things have taken a turn for the worse, yet the army of Japan-Korea players was still unable to see the silhouette of Emerald Kingdom! It was the worst situation they had been in since the Ancient Creature invasion.</p><br/><p>When the sudden negativity struck everyone, their morale started to waver. It was not clear to what extent would the players work together.</p><br/><p>…</p><br/><p>When McLaren fell, Zhang Yang, Greensleeve Prince, One Sword Stroke, Snow Seeker, and many other pairs of hands had swooped in to grab whatever there is to grab. McLaren would have an array of luxurious drops such as skill books, Mythical or even Ethereal tier equipment! Even though the number of drops would definitely be plenty for a party, it was not enough to share amongst a party of 20 players! Within a microsecond, all of the loot was gone.</p><br/><p>Zhang Yang checked his inventory and found out that he had only picked up a skill book. The man giggled awkwardly as he was impressed by the speed of the other guild masters. Little did he know that the other guild masters were thinking the same thing. After all, the item he obtained was a skill book! Even the best equipment then would eventually be discarded soon after, but a skill will be carried until the end of the game!</p><br/><p>Now that the boss was killed and the loot was distributed. Everyone turned to Zhang Yang.</p><br/><p>\"Well, time to skip town, then!\" said Zhang Yang with a grin.</p><br/><p>If they had continued to stay there, the angry NPC and players of Japan and Korea would swarm them by the 100 of millions!</p><br/><p>Everyone laughed at his nonchalant joke and flew towards the exit of the palace. All of the player’s Transformation skills were still active, hence, after they exited the royal chamber, they killed a good number of players along the way. With Zhang Yang spearheading the exodus route, 19 players followed him behind, leaving a stretch of dead bodies in their wake. Although everyone had flying mounts, it was not as mobile as flying with their own two wings.</p><br/><p>After 10 minutes of running, Zhang Yang and his assault party managed to escape the place with NPCs turning around to return to their original posts. The remaining players could not do anything without the NPC’s help and turned tail and run as well. A large portion of the high leveled players had been sortied to attack Emerald Kingdom, hence, the number of strong players remaining in their own region were too scarce to fight Zhang Yang assault party. They could at least put up a resistance against the incoming China players with the help of the Dragon Knights. However, when the NPCs returned to their original posts, the players themselves would not stand a chance.</p><br/><p>Even though Zhang Yang and the main attack force had left the region, there were still more than a thousand players remaining in the region. They were stuck there since they had not means of reviving themselves. The graveyard was guarded closely and their bodies in the main cities were guarded by players. They had no choice but to wait until the heat dies down when people start to lose their interest in guarding and the coast is clear.</p><br/><p>Still, Zhang Yang needed to fix Morning Town up.</p><br/><p>Because none of them had bound their [Teleportation Scrolls] to any town or city, they had traveled on their own. As they flew through the airspace, players had taken the chance to review the items they had looted. Previously, all they cared about was to get their hands on any item there is and escape as soon as possible.</p><br/><p>Zhang Yang himself included, 5 Lone Desert Smoke members had participated in the boss fight. However, only Zhang Yang and Sun Xin Yu had managed to haul an item each. Still, right then, gaining a Level was more important than anything else. To be able to gain a Level as a reward is worth all the hassle. However, the Level rewards was still pending. If they fail to guard Emerald Kingdom from being taken over, it would be for naught.</p><br/><p>Sun Xin Yu had obtained a shield that was as black as charcoal. Its shape was triangular with pointy edges. Zhang Yang was overjoyed. It was made clear that the current hottest item on sale in the market were tank items! As long as a party’s tank is strong, the party would not have much trouble in hunting strong bosses! A shield was, after all, a tank’s most powerful and core equipment!</p><br/><p>[Dragon Scale Refined Iron Shield] (Ethereal, Shield)</p><br/><p>Defense: +7560</p><br/><p>Vitality: +7260</p><br/><p>Equip: Increases maximum HP by 14,520.</p><br/><p>Equip: Absorbs 1,923 damage on attack.</p><br/><p>Equip: With every successful {Block}, deals Holy damage to the target equivalent to 70% of the user’s Defense value.</p><br/><p>{Unidentified}</p><br/><p>Level Requirement: 140</p><br/><p>Special: Level Requirement reduced by 20 Levels.</p><br/><p>Note: A mighty shield that was made with the Black Dragon’s Scale. Its integrity is nothing like you have ever seen! The most sought-after Shield for Guardian and Defender!</p><br/><p>The shield had not yet been Identified, yet the stats were already stronger than the one that Zhang Yang was wearing! As expected of an Ethereal Level 140 Shield!</p><br/><p>Without saying anything, Sun Xin Yu tossed the shield to Zhang Yang to get some \"lovey-dovey\" points. Zhang Yang did not even care to Identify the shield and quickly equipped it. Naturally, the little brat was there to witness that \"unfairness\". Hence, after being teased by the little girl, Zhang Yang took out the skill book that he had looted and showed it to her.</p><br/><p>[Skill Book: Summon Phantasm]</p><br/><p>Use: Teaches you the skill {Summon Phantasm}</p><br/><p>Class Requirement: Priest, Knight, Spellcaster.</p><br/><p>Level Requirement: 100</p><br/><p>No one, not even Zhang Yang had heard of the skill before. To play it fair as the little girl demanded, Zhang Yang decided to give the skill book out via the Roll the Dice method.</p><br/><p>In the end, the skill book was won over by a Spellcaster from the secondary raiding party called \"Ghost Knows\". Right after he obtained the skill book, the player immediately learned it and posted the skill with a grin on his face.</p><br/><p>[Summon Phantasm]: Forms a binding covenant with the devils and summons a Phantasm to aid you in battle. The summoned Phantasm is immune to all attacks and will survive for only 30 seconds per instance. After returning to the underworld, the Phantasm will convert his power and restore your MP based on the total damage it had dealt. Cooldown: 30 minutes.</p><br/><p>With roughly a full set of Level 120 Ethereal tier equipment, a Spellcaster should have more than 70,000 MP. In 30 seconds, 70,000 damage is something that a novice could do. The skill was practically a full MP restoration skill! It was an OP skill!</p><br/><p>If the Phantasm could not deal higher damage in return, it could at least help increase the caster’s DPS for a short time! Since the cooldown was only 30 minutes, the skill could be used in all boss fight! If the fight is dragged on any longer, it would be an extremely powerful support skill! It could be used in the Battle Team Professional League fights as well!</p><br/><p>When they came, they came with the sound of the shadow. But when they left, they left with the vigor of a riot! Over 2,000 players, including Zhang Yang had flown gallantly towards the Winst Castle and destroyed the castle’s Teleportation Point to disrupt the travel of the Japan-Korea region players.</p><br/><p>Since they had already reduced Morning Town into ashes, Zhang Yang did not reserve his anger and unleashed might and fury upon Winst Castle. After destroying the Castle, the assault party only returned to Morning Town, or what it once was. The battle was still going on at its peak. Even though the defending army, the China players had the advantage of numbers, they had been dragging the battle for quite some time due to the strategic location of Morning Town. Right then, the China players were attacking to reclaim their territory while the Japan-Korea region players were defending the place. In such situation, the defending party would have the territorial advantage. Hence, the drag.</p><br/><p>Zhang Yang and his merry assault party had already timed out of their Transformation skill. Even though they were top tiered players from China, having 3,000 players against millions of players was not something that Zhang Yang would go for. If their Transformation skills were still active, they could easily take down millions of players with no problem. Right then, they could only form a pincer attack and target the little guys and slowly work their way up to the stronger ones. Although it was safe, it was not very effective.</p><br/><p>On the enemy’s side, they had received words of Zhang Yang attacking strategy. As a result, they had split themselves apart from the war and gathered many players who possessed flying mounts. They had tried to mimic Zhang Yang strategy and directly assault Emerald Kingdom’s ruler.</p><br/><p>Since all eight kingdoms were unified under the rule of Queen Serena, all castle in all major cities were occupied by a Steward.</p><br/><p>The task at hand was to take back Morning Town from the defenders before they can reach Emerald Kingdom. If they succeed, they could transport a large number of players instantly via the Teleportation Point and defend against the enemy in Emerald Kingdom.</p><br/><p>Although Zhang Yang had already considered the party of 3,000 players that he was leading not all too overwhelming, they still managed to push forward the progress of taking back Morning Town. At most, in 20 minutes time, Zhang Yang would have fully retaken Morning Town.</p><br/><p>By then, the assault party of Japan-Korea region player had just arrived at the castle of Emerald Kingdom and had started their assault on the Steward in the castle.</p><br/><p>The assault party thought that they were one step ahead of China players, but in truth, China players were seven steps ahead of them. Before the Japan-Korea players had even reached the outskirt of the castle walls, a large number of players had already positioned themselves in a defensive formation around the castle entrance. Even though there were large portions of players who could not care less about the war, some of them had returned to the castle to provide reinforcements.</p><br/><p>Right then, it’s all about a contest of speed.</p><br/><p>The Japanese and Korean players who were still defending Morning Town had gone mental. With every bit of HP left, they stood resilient to the attacks of Zhang Yang and his party. Zhang Yang knew that they were buying time for their comrades in Emerald Kingdom and will do anything to extend their stay there. Zhang Yang had no choice but to switch his attack pattern to a full on suicide squad style to forcefully take back the territory in order to reset the Teleportation point and provide reinforcements to Emerald Kingdom!</p><br/><p>\"Guild master, the Steward has 89% HP left!\"</p><br/><p>…</p><br/><p>\"Guild master, the Steward has 72% HP!\"</p><br/><p>…</p><br/><p>As the players in Emerald Kingdom kept him updated, Zhang Yang and the assault party were getting agitated. They knew they have to pick up the speed if they wanted to defend Emerald Kingdom! At last, after several more minutes, all the players inside Morning Town were killed. The first thing Zhang Yang did was restore the fallen Teleportation Points without wasting any second. Right, the portal is set. Zhang Yang was the first to enter the magical transport and appear in Emerald Kingdom. With haste, all players around Morning Town started to teleport to Emerald Kingdom when the boss still had over 11% HP left.</p><br/><p>After a brief fight, all Japan-Korea region players in Emerald Kingdom were killed, thus ending the Nation War with them successfully defending against the assault.</p><br/>\n</div>"}