{"title": "Chapter 646: The Zombie Lord", "id": 646, "volume": 7, "url": "http://boxnovel.org/mmorpg-rebirth-of-the-legendary-guardian-chapter-646-the-zombie-lord", "volume_title": "Volume 7", "body": "<h1>Chapter 646: The Zombie Lord</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 646: The Zombie Lord</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Every time an Inheritance is activated, the progress of each party would receive a boost. 5 hours later, all 13 parties arrived at the second boss. Although they arrived at different times, none of them were falling behind.</p><br/><p>However, it remained unknown whether all parties could still maintain the speed of their progress. No one had any idea how many players from the other parties had already activated their Inheritance Transformation Skills. It could only be assumed that weaker parties would already be urging their party members to activate their Inheritance Transformation Skills.</p><br/><p>The second boss was a gigantic Blood Mist Zombie. It was a male that was approximately 15 meters tall. His flesh all around his body was rotten and stinky! More surprisingly, that rotten man was wearing a nose hoop on his nose. He also wore many other golden rings on his utterly decomposed body. The golden rings were clanking into each other as he moved.</p><br/><p>[Blood Mist Zombie Lord] (Ethereal, Zombie)</p><br/><p>Level: 143</p><br/><p>HP: 600,000,000</p><br/><p>Defense: 9,410</p><br/><p>Melee Attack: 70,102 - 90,102</p><br/><p>Skills:</p><br/><p>[Poisonous Blood]: Infects the target with poisonous blood. The target will suffer additional 10% damage when being hit. The effect cannot stack.</p><br/><p>[Decay Aura]: Causes 80,000 Shadow Damage to all targets within the effective range once in every 5 seconds.</p><br/><p>[Paralytic Pierce]: Causes 150% Melee Attack of Physical Damage to the target, causes the target to become paralyzed for 10 seconds.</p><br/><p>[Zombie Build]: Recovers 1% HP once in every 30 seconds. The recovery rate will not be affected by any other effects.</p><br/><p>Note: The Zombie Lord. According to legend, he was a famous pretty boy. However, he had never thought that it was possible for him to turn into such ugly being!</p><br/><p>\"Boss, all yours!\" Endless Starlight backed off, knowing that without his Inheritance Transformation, he was out of his league.</p><br/><p>Zhang Yang nodded and said, \"I believe that everyone can see the description of the boss’s Skills. There shouldn’t be any difficulties in this boss battle. Just deal as much damage as you can and heal as much HP as you can! No time to lose! Chop chop! Let’s move out!\"</p><br/><p>He patted his Phoenix pet as gave a command for it to charge towards the boss without any delay. Now that he was the main Tanker of this battle, he would need to get as much aggro as possible so that the attention of the boss would be firm and focused on him. Although it was almost impossible for his other party members to snatch the aggro of the boss away, even without the help of Phoenix pet, the boss’s {Paralytic Pierce} would stun Zhang Yang for 10 seconds. If that Skill would be activated frequently by the boss, Zhang Yang’s DPS efficiency would definitely be affected. That would come back to bite him when it comes to maintaining the boss’s aggro. Therefore, he decided to play safe. He mounted onto his pet to try bringing more of the boss’s aggro on him.</p><br/><p>\"Living being?\" Zombie Lord let out a thunderous laugh as he lifted his leg up. Then he said, \"So tell me, human! Am I the most handsome man in the entire world?\"</p><br/><p>Zhang Yang and the gang frowned so hard that their eyebrows were going to fall off from their faces.</p><br/><p>Zhang Yang threw his {Spear of Obliteration} at the boss and said, \"As a zombie, you are considered as one of the top models that everyone would remember for eternity! Yuck! Haha!\"</p><br/><p>\"Bastard! I’m the number 1’s most handsome human being!\" The Zombie Lord let out a raging roar, as he was already swinging his gigantic hand towards Zhang Yang and slammed it on him. While he was swinging his hand, rotten juice flew off his hands and body parts! The stench was so strong that Han Ying Xue and the ladies were frowning even harder than ever!</p><br/><p>\"Hey, zombie! You’re so rotten that even your penis is rotten to the core! Can you still be considered as a man? You will be better off if you just choose a pretty zombie and marry her!\" Fatty Han had not forgotten about teasing the boss with that foul mouth of his. Well, having a foul mouth was part of his trait after all.</p><br/><p>\"...\" The Zombie Lord gave another slam. The powerful impact of his slam pushed Zhang Yang a few steps back. At the same time, he actually put his other hand into his pants to have a quick check on his ‘brother’ underneath!</p><br/><p>Everyone frowned again.</p><br/><p>\"Wu ---\" Suddenly, the Zombie Lord let out a screeching and miserable scream. Everyone could actually see the sad and yet angry face of the boss crystal clear. Apparently, his hand could not ‘find’ what he was looking for!</p><br/><p>--- high Tier and high-leveled bosses tend to have more intelligent AIs which would react to the movements and words of the players. Because of that wretched fatty’s foul mouth, the boss lost himself to his anger and went berserk.</p><br/><p>\"Just get over it and everything will be fine!\" Zhang Yang gave a pat on Phoenix pet and charged back up to the boss. He began his assaults by putting his {Cripple Defense} onto the boss. Then, he whirled his [Sword of Purging Devourer] across the air as aggressively as he could in an attempt to reduce the HP bar of the boss.</p><br/><p>\"I am the most handsome man! I am the most handsome man! Number one handsome man!\" The Zombie Lord continued to roar in anger as he was swinging his hands across the area so hard, that the air was swept up by the force of the swings, \"You all know my secret now! You all must die! Die!\"</p><br/><p>\"Pui! Everyone in the world knows that you have no d*ck! So why still call it a secret?\" Fatty Han got hooked on teasing the boss, as he found it fun to do so.</p><br/><p>\"Bastards! I will kill you all! I will kill every one of you who knows about my secret!\" Zombie Lord went completely berserk. He was screeching like a real devil as he continued to swing his hands towards Zhang Yang.</p><br/><p>\"What the f*ck, fatty! Your mouth is foul indeed! Even bosses get angry at you!\" Zhang Yang said.</p><br/><p>The amount of damage that the boss deals would not change, regardless of whether he is agitated or not. Even though that was the case, the scene of the boss going berserk, smashing up the ground and the walls was really a spectacular scene to gaze upon.</p><br/><p>\"Haha! Of course!\" Fatty Han tapped on his chest as he showed pride in his ‘skills’.</p><br/><p>The Inheritance Transformation of Lost Dream was still not over yet. He became one of the main DPS in the entire party. There was a risk of him snatching the aggro of the boss from Zhang Yang, but Zhang Yang could still manage to maintain their positions. He did it by using all sorts of Skills that would generate a large amount of aggro and the additional 20% aggro that he would get by holding a shield.</p><br/><p>Although Zombie Lord was the second boss, he was slightly easier than the first boss. The only key point was that his amount of HP was 100,000,000 points higher. That was all.</p><br/><p>However, it was not as simple as dealing additional 100,000,000 damage to the boss. Because the boss could recover his HP with his {Zombie Build}, the boss could heal over 1,000,000 HP once in every 30 seconds. That would require the entire party to deal as much damage as 33,000! After all, there were only 10 players in one party. With two of them being Healers and two of them being Tankers, there were only 6 DPS players in the party. That being said, each of the DPS players would need to deal an additional 5,000 DPS in order to deal effective damage to the boss. It was quite a demanding amount of damage required.</p><br/><p>The Zombie Lord had over 600,000,000 HP, and he could recover 1% of that amount of HP once every 30 seconds. That 1% amount of HP would be 6,000,000 HP. In other words, the boss could heal over 200,000 HP in every passing second. To deal effective damage on the boss, Zhang Yang’s party should deal a minimum of 200,000 damage to the boss every passing second before they can begin reducing the boss’s HP bar. That was not a small number. The number of parties that could pull that off without having to activate any of their Inheritance Transformation Skills would not exceed 100 at the current stage of the game.</p><br/><p>Averagely speaking, only ten guilds in each region would be capable of pulling such a party together.</p><br/><p>However, there were also some differences between the strengths of all top Tier parties. The DPS of Zhang Yang’s party had reached up to 400,000 damage! They managed to deal an additional 100% damage to the boss, compared to the minimal amount of damage they were required to deal to the boss. Of course, one of the main reasons was that Lost Dream had activated his Inheritance Transformation Skill. Even if he did not activate it, the party would still be able to deal approximately 350,000 damage in each passing second. After all, the party was receiving support from two Celestial Tier Phoenix pets and a Felice! The damage output of these pets and Battle Companion could match the amount of damage that Hundred Shots and the others could deal to the boss!</p><br/><p>Theoretically, Zhang Yang and his party could take out this boss in 50 minutes. The boss did not have any special Skills that could potentially reduce the number of players in the surroundings in an instant. He only had his {Decay Aura} that was a DoT style AoE. As long as Han Ying Xue and Fantasy Sweetheart could maintain the HP bars of everyone on the party, they would not have much of a problem in taking down the boss.</p><br/><p>Furthermore, Zhang Yang also had his ultimate boss-killer Skill {Glare of the Death God}. If this Skill is not resisted by the boss, the boss would basically have 90% HP since the start of the battle.</p><br/><p>When the HP bar of the boss was reduced down to 23%, the Inheritance Transformation of Lost Dream finally came to an end. The damage output of the party was slightly reduced. However, it did not matter much anymore. They were just 3% away from entering the ‘killing cleave mode’!</p><br/><p>Zhang Yang gave it some thought and said, \"Fatty, activate your Inheritance Transformation now. But don’t use your inheritance Skills just yet, unless your EP is full!\"</p><br/><p>\"Roger!\" Fatty Han had absolute trust in Zhang Yang. Although he did not understand why Zhang Yang wanted him to do that, he just did it without any hesitation. Instantly, he transformed himself into a vampire with fangs and bat wings on his back. His Attack power was insanely boosted in an instant.</p><br/><p>Upon activating his Inheritance Transformation, Fatty Han managed to gain 1 EP every 10 seconds. He would be required to wait 1,000 seconds in order to accumulate 100 EP. That was equivalent to 16 minutes. Zhang Yang asked Fatty Han to activate his Inheritance Transformation early to start accumulating his EP while battling the boss. After they defeat the boss, they could rely on Fatty Han to unleash all his Inheritance Skills on the monsters along their way. He would not be required to wait for 30 seconds before activating his Inheritance Skill.</p><br/><p>After a brief moment, the HP bar of the boss dropped below 20%! Everyone began to activate their own ‘Killing Cleave’ Skills. After a series of aggressive assaults on the boss, the HP bar of the boss had been reduced down to 12%! Zhang Yang did not hesitate anymore as he threw his {Glare of the Death God} onto the boss --- Resist!</p><br/><p>Well, they were getting used to the disappointment already.</p><br/><p>After all, the special effect of {Glare of the Death God} could only speed things up when the party is encountering bosses that they could otherwise triumph over without help. It was not some major, emergency measure. If the boss resists it, let it be! The party would only have to battle for 5 to 6 minutes longer.</p><br/><p>After some messy beating, the narcissistic Zombie Lord finally let out a miserable scream as his miserable life was ended once again. He dropped quite a number of loot upon his demise.</p><br/><p>\"Huh? There are three parties that are ahead of us!\" Han Ying Xue shouted out in shock.</p><br/><p>Everyone brought up their map to take a look. It was true! The parties that were progressing towards the middle from 3 o’clock, 5 o’clock and 12 o’clock had already made it past the boss! The party from 3 o’clock had 20 players on their side. It was understandable that they could progress a little faster than expected. However, it was really a shock to see that the two parties from 5 o’clock and 12 o’clock could beat Zhang Yang and his party!</p><br/><p>They had either used a [Forbidden Scroll] or more of their members had activated their Inheritance Transformation!</p><br/><p>The possibility of them using a [Forbidden Scroll] was not high. After all, the bosses in this area were not those World Tier super bosses. It would really be unwise to waste a [Forbidden Scroll] on any of these bosses!</p><br/><p>So that would only leave one other possibility on the other end. They must have activated more of their Inheritance Transformation Skills in order to progress faster. However, if they have used up all most of their Inheritance Transformation Skills at such an earlier stage of the map, how would they be able to progress on when they were nearing the end of the progress? Surely the difficulty of progressing forward would increase as they progress further towards their destination!</p><br/><p>Zhang Yang could not afford to waste time on thinking for the other parties that were competing with them to get to the ‘finishing line’ on the map. All he intended to do was to make sure that his party was progressing at the most efficient rate.</p><br/><p>The rules remained the same. Wei Yan Er was the one who picked everything up while the remaining party members continued on cleaning up the monsters that were blocking their way forward. Fatty Han struck out with his immense AoE attacks with his full EP. So he became one of the best DPS sources of the party at the moment. The party managed to push forward swiftly all thanks to him.</p><br/><p>\"Little brat, what did that stinky Zombie Lord left us? Show it to us, quickly!\" Zhang Yang looked at Wei Yan Er as he cleared out the monsters in front of them.</p><br/><p>\"Hehe!\" Wei Yan Er revealed the two rolls of her white teeth at Zhang Yang as she began to dig into her inventory, \"Just like what the first boss left for us. We have two Ethereal Tier equipment, 3 Mythical Tier equipment and one [Skill Book]! However, there’s no sign of any [Skill Point Crystals] this time around!\"</p><br/><p>\"I see. Take out the [Skill Book] and let’s have a look at it!\"</p><br/><p>\"Haih... why are you so picky... It’s always so hard to fulfill your request!\" Wei Yan Er shrugged as she pretended to be annoyed.</p><br/><p>\"Fine... stop acting like it’s a fuss... just take out the Skill Book and show it to us now, will you? Or else you’re going to become enemy number one of the public!\"</p><br/><p>\"If you insist!\" Wei Yan Er finally took out the blue-covered Skill Book out of her inventory and said, \"Look, it’s called ‘Armor-Piercing Arrow’!\"</p><br/>\n</div>"}