{"title": "Chapter 642: Contest on the Bridge", "id": 642, "volume": 7, "url": "http://boxnovel.org/mmorpg-rebirth-of-the-legendary-guardian-chapter-642-contest-on-the-bridge", "volume_title": "Volume 7", "body": "<h1>Chapter 642: Contest on the Bridge</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 642: Contest on the Bridge</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>\"Well d*mn! The monsters here are strong!\" cried Lost Dream as he laid down a powerful barrage of damage on the Abomination monster.</p><br/><p>Lost Dream was referring to its attack instead of its overall constitution. Despite having powerful skills and attack, the normal tier monster had only over 100,000 HP. It did not take long for the party to kill one and the other.</p><br/><p>Zhang Yang nodded. \"You have to be careful. The monsters are powerful inside here. I suspect that the attack power of the monsters inside will be several times more than the regular monsters you fight in the normal map. Let me tank the monsters, you guys should be able to finish their low HP in no time.\"</p><br/><p>The two monsters had fallen and provided a total of 300,000 experience. It was 50% more than the monsters outside the Gagaro’s Mist.</p><br/><p>\"There’s nothing to fear. I’ll stand at the frontier and you guys form a line behind me. Together we can push these normal tier monsters at a higher efficiency!\" Zhang Yang steered the party into formation and allowed them to strike simultaneously, reaching more than 100,000 damage in one volley of attack. It would be a waste if they were all to target one monster at a time.</p><br/><p>Zhang Yang wanted the party to increase their killing speed for there was a time limit in the place. Besides that, there were three other parties that were technically competing with them! Even if the last prize in the clock tower was unknown to him, there was no way he would give it up to other players!</p><br/><p>Besides Han Ying Xue and Fantasy Sweetheart, the rest of the player were lined up in a straight line. Even though the monster’s attacks were indeed stronger than the normal monsters, the party members were all mounted. With the increased HP limit, the two healers and three healer type Battle Companions, there was no need for them to withdraw or fall back! The only direction was forward, without stopping!</p><br/><p>Zhang Yang took the lead and fully displayed the prowess of his thick \"skin\". When a monster laid down their attack, all they could deal was less than 10,000 damage to his 700,000 HP! The party did not need to worry about being attacked at all!</p><br/><p>The party moved 300 meters forward and had already accumulated enough experience points for them to smile like they were winning a jackpot. At that moment, at the 7 o’clock bridge, a blimp appeared, indicating that a new party had entered the field.</p><br/><p>Hundred Shots was an Engineer and had crafted binoculars for himself. The device worked just like the real thing in reality which allows players to extend their sight. Hundred Shots started surverying the new party. \"It’s the Land of Savages guild. I can see Hourglass Figure and a few other familiar faces.\"</p><br/><p>\"Hmph.\" Zhang Yang scoffed. \"They are a little too late! Let’s pick up the pace, guys. We must be the first to reach the end!\"</p><br/><p>\"Hehe! That’s right! That’s because we are?\" asked Endless Starlight hoping for a roar. However…</p><br/><p>\"Huh? What?\"</p><br/><p>\"Awesome?\"</p><br/><p>\"The weirdest?\"</p><br/><p>\"The fattest?\"</p><br/><p>There were many replies but neither one was the answer that Endless Starlight was looking for.</p><br/><p>The 10 men team of Land of Savages did not idle for long before they too started their raid to push forward. It seems that they too had found out the nature of the place.</p><br/><p>In general, since there were 12 bridges in this map, a total of 12 parties could enter at a time to compete with the others. With the help of the world map, it was possible to view the progress of the other parties. Since the instance was not created as a dungeon, there were no limits as to how many parties could join. As such, there were no rules to restrict only 12 parties in the map. By which, when the 13th party joins the map, there will be a bridge carrying two parties. As such, the parties that share that share the same bridge would have to come to an agreement. They could share the loot, or they would have to fight for it. It would be likely that the parties would have to kill one another for the right to obtain the loot. Since the bridge was small, there is not enough space to form a proper lineup formation. If two parties were to fight together, it would be extremely crowded, which will definitely slow down the pushing speed. Although it would still be faster than a party, it would never achieve the full potential of two parties.</p><br/><p>As a conclusion, if the two parties cooperated with each other, the pushing speed would be slightly faster than the others. However, due to their cooperation with each other, the party will have lesser experience points!</p><br/><p>There’s always a trade-off!</p><br/><p>Since the monsters in the map were all normal tier, coupled with the map’s special conditions, monsters that were killed will respawn after only one hour! If the entire party is killed in the middle of pushing through, they would have to restart from the beginning!</p><br/><p>Although the route was only 10km, the number of monsters on the bridge were uncountable. Since mounts were unable to fly in this map, the progression speed was extremely slow! Using 24 hours to make their way towards the clock tower would not be an easy task!</p><br/><p>\"Little Yang, I think we should use our Transformation skill to push forward.\" Fatty Han suggested. Even though their progress speed was not as slow as a turtle, it was not fast enough to look promising.</p><br/><p>Zhang Yang shook his head. \"Not yet. I know it might be awesome to kill our way in with our Transformation skill, but can you guarantee that we can push all the way to the end within the Transformation duration? What happens if the last boss at the end requires all of us to use our Transformation skills to defeat?\"</p><br/><p>\"That’s right. I can see that the other party did not use their Transformation skill to push, either. They should share similar thoughts,\" Said Hundred Shots.</p><br/><p>\"But, what if there are just endless monsters on this bridge and no bosses?\" said Wei Yan Er playfully.</p><br/><p>\"Well. In that case, reserve the Transformation skill until the last 22 hours. No matter where we are on the bridge, we will use our Transformation skills. It would still be worth using our Transformation skill to spam skill normal monsters.\" Zhang Yang rubbed his knuckles on the girl’s head. In retaliation, the little girl jumped around and snarled at Zhang Yang like an enraged kitten.</p><br/><p>After a short period of time, a new party had appeared on the bridge at the 3 o’clock direction. Since the distance was too far for Hundred Shots to scout, they had no idea who they were. Furthermore, the communication means in the map was limited to the party only. Even if Zhang Yang posts something in the guild channel, only his party could see it.</p><br/><p>No sooner after, more and more parties had joined in the map in the 2 o’clock and the 12 o’clock bridge. After they had pushed to the 1km mark, a new team had joined in the map and appeared right at the opposite bridge. It was a team of North America region players. The Blood Alliance guild.</p><br/><p>Zhang Yang was not familiar with the guild but he saw one particularly familiar name. It was Captain America.</p><br/><p>The man had possessed the God of War Inheritance in Zhang Yang’s previous life. Luckily, unlike Zhang Yang, Captain America did not know anything about that. If he does, he might summon some Norse mythology demigod to kill Zhang Yang for the thievery he had committed!</p><br/><p>In less than one hour, all stone bridge was occupied by parties. From there on out, any more parties joining the map would occupy a bridge that already has a party. Be it cooperation or competition, the parties would have to come up with a solution fast or they will lose the race.</p><br/><p>After Zhang Yang’s party had reached the second-kilometer mark, the monsters were upgraded from normal tier to elite tier.</p><br/><p>Instead of large, oversized Abominations, the monsters were white skeletal soldiers that were roaming around. Due to the limited space and flooding of monsters, the skeletal soldiers would bump into each other which gives out a loud, hollow sound of \"Tuk\".</p><br/><p>If it was just one \"tuk\" sound, the party would be fine. However, the \"tuk tuk\" sounds were extremely frequent and rattling. It was not something that the lighthearted could take in.</p><br/><p>[Mist Blood Thirsty Skeleton] (Elite, Spectre)</p><br/><p>Level: 130</p><br/><p>HP: 2,600,000</p><br/><p>Defense: 2,280</p><br/><p>Melee Attack: 50,274 – 54,274</p><br/><p>Skills:</p><br/><p>[Death Control]: Targets that have fallen to the monster will suffer from being controlled by the skeleton. Last for 5 minutes.</p><br/><p>[Brutal Smash]: 30% chance to strike an additional attack after a successful attack.</p><br/><p>Note: From here on out, you’re facing actual threat. Although skeletal soldiers are the weakest soldier in the Spectre ranks, their attacks will take your breath away. Literally.</p><br/><p>\"ARUGH!\"</p><br/><p>A total of seven monsters rushed over to Zhang Yang and raised their swords to attack. Zhang Yang immediately ordered the team to fall back a little. Each of these skeletal soldiers possessed attack power that could rival a Mythical boss. Even with the boosted HP via the mount, players could still be killed when they are surrounded by the monsters!</p><br/><p>Zhang Yang took charge and took all the damage dealt by the monsters. Endless Starlight followed closely behind and rode his Black Rhino mount. Zhang Yang and Endless Starlight tanked all seven monsters to prevent any of them from attacking the DPSers.</p><br/><p>Despite being a tank class, Endless Starlight’s HP dropped ever so rapidly that Han Ying Xue and Fantasy Sweetheart had to immediately heal him. Zhang Yang was tanking 4 of the skeletal soldier and had a better situation than him. Worried for the poor fellow, Zhang Yang used {Provoke} and took one monster away from him and tanked a total of 5 skeletal soldiers. Zhang Yang leaped off the Phoenix and struck the ground with {Thunder Strike}. After slowing the monsters down a notch, Zhang Yang leaped on the Phoenix and kited them away. With his kiting ability, he was able to deal damage, move around, and last longer.</p><br/><p>\"Nyehehe! Pervert Starlight could not be hoped after all!\" cried Wei Yan Er as she laughed.</p><br/><p>\"Wuuu! Cut me some slack. I’m a Defender. I’m stronger against magic attacks! This not my show!\" said Endless Starlight as he tried to justify himself.</p><br/><p>Everyone laughed at his retort and continued to attack. In truth, to be able to tank even two of the monsters was quite a feat in itself! The monster did have the attack power of a Mythical tier boss! Even Zhang Yang would not dare to directly take the monster’s attack!</p><br/><p>The proper strategy would be, Zhang Yang and Endless Starlight tanked two monsters each while the rest of the monster should be handled by the players. Skills like {Frost Trap}, {Ambush}, pets skills or other immobilizing skills would come in handy at times like this.</p><br/><p>Similar to the previous Abomination monsters, the skeletal soldiers may have strong attack, but they had little HP. After several volleys of concentrated attack, the soldier would die in no time at all. As the number of monsters decreases, the time taken to kill each monster will be greatly shortened. In the end, the party had only took 1 minute to kill all seven skeletal soldiers.</p><br/><p>Endless Starlight breath a long sigh of relief and said, \"Oh man…these few monsters were strong! I don’t think 24 hours is enough to kill our way till the end!\"</p><br/><p>\"Relax. If our party does not have enough firepower, no other party could do the same!\" Zhang Yang laughed. He was not bragging, but merely stating the truth. There were three S class Inheritance player in their party! If they could not do it, no one could. Besides, they had half of the world’s S class players!</p><br/><p>Technically, if you take the strongest players in the game and form a 10-man party, they would share roughly the same firepower as Zhang Yang’s party!</p><br/><p>\"That…may be true…But what if other teams have their own secondary parties joining in?\" said Daffodil Daydream worriedly. </p><br/><p>\"You’re right. Their combined forces would definitely have better results. However, there is still a possibility that the new party would be an enemy! If that happened, it would be a chaotic session!\"</p><br/><p>It was but the obvious fact. If a party of Japan-Korea players joined their bridge, it would be chaos! There will no chance for them to talk it out!</p><br/>\n</div>"}