{"title": "Chapter 653: A Decisive Battle with the Ghost Dragon", "id": 653, "volume": 7, "url": "http://boxnovel.org/mmorpg-rebirth-of-the-legendary-guardian-chapter-653-a-decisive-battle-with-the-ghost-dragon", "volume_title": "Volume 7", "body": "<h1>Chapter 653: A Decisive Battle with the Ghost Dragon</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 653: A Decisive Battle with the Ghost Dragon</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>\"You insolent insignificant beings! Get lost!\" The Frosty Ghost Dragon let out a series of roars that trembled across the entire surroundings. Gigantic dragons could take the shape of a human. So it would only be natural if they could speak the tongue of men. Although the Ghost Dragon had lost its ability to shift into a humanoid form, it was not hard for it to speak human’s language.</p><br/><p>The boney dragon stood up abruptly on its hind legs and reached out with one of its claws. Each of its claws was approximately 10 meters long. The claws reached out for Zhang Yang. The air was swept up by the force of the swing. It made contact. Luckily for him, he raised his shield just in time to shield himself from that blow. At the same instant, the boss released its frosty dragon breath across the surroundings. Zhang Yang’s body was covered in fragments of frost.</p><br/><p>Zhang Yang was instantly blasted back by that strike. However, he fluttered his wings and reengaged the boss. Without any hesitation, he swung his [Sword of Purging Devourer] straight at the soft spots of the boss! His normal attacks could deal up to 200,000 damage. That amount of damage was actually much higher than the damage that the boss could deal to him! Zhang Yang was showing the boss who was the real boss there!</p><br/><p>At that moment, the two Phoenix pets could still maintain their Transformed Forms for another 10 minutes. Therefore, everyone on the scene got the chance to see the two Phoenixes battling a dragon! The scene was most spectacular! Everyone was very content with being able to view such a rare scene!</p><br/><p>The Strength of these legendary beasts was usually determined from their sizes.</p><br/><p>Initially, dragons and Phoenixes were of the same Tier. However, the Frosty Ghost Dragon was an Ethereal Tier boss. Therefore, it was so much larger in size compared to a Phoenix pet! Unless the two Phoenix pets are able to elevate up to Ethereal Tier, they would not be able to best a Frosty Ghost Dragon.</p><br/><p>However, it would not be long before that happens. Phoenix pets could evolve into Ethereal Tiers when they reach Level 140. When they do, they would become almost as large as the boney dragons after they activate their Transformation Skills.</p><br/><p>There were 4 players who had Inheritance Transformation Skills in the party. However, even though Han Ying Xue’s Inheritance Transformation was Class S, she could only provide Healing support for the party. Because of her, Fantasy Sweetheart was delegated as a side character. She only needed to activate her {Regeneration} and {Holy Shield} from time to time. Other than that, she could contribute to the DPS. Although the amount of damage she could deal was not high, a mosquito could also cause an itch to a human even if it does not hurt.</p><br/><p>Having 4 Inheritance Transformation activated at the same time was quite a scene to marvel at. The 4 of them were bombarding the boss with everything they had. The HP bar of the boss was dropping at a constant rate, though it was extremely slow. The boss had over 1,000,000,000 HP on it!</p><br/><p>The other two parties were doing quite well. They were not really much far behind, compared to Zhang Yang’s party. They were truly persistent!</p><br/><p>However, what does it mean by having ‘an arrow at the end of its flight,’ then?</p><br/><p>10 minutes later, the HP bar of the boss had dropped down to 92%. At the same time, the two Phoenix pets started shrinking. They shrunk from mountains down to the size of cabs --- the Phoenix Transformations had expired!</p><br/><p>Well, Zhang Yang and his party were not the only ones who were facing that sort of trouble. The Hell Family and Land of Savages were also facing the same situation, or maybe worse. They have run out of Inheritance Transformation Skills to use!</p><br/><p>Anyone could have made that calculation. Without Inheritance Transformation Skills at their disposal, they would need at least tens of hours in order to take down the boss! If the firepower of the party is just a little bit higher than the boss’ regeneration, it could even take days to take down the boss --- if they could even last that long, and if the map had no such limits.</p><br/><p>Without any Inheritance Transformations, the firepower of the other two parties were like ticks nibbling away at an elephant. The HP bar of the boss did not even seem to move! Even snails could move faster than that! What that was even worse was whenever the boss activates its {Dragon Wing Strike}, bodies would go flying. The party would helplessly watch the boss recovery what little damage they have done. Of course, the players would cry in misery. After spending so much effort in dealing damage to the boss, they were blasted away, crawling back just to find out that all their efforts have gone to waste.</p><br/><p>However, that pretty ancient-looking chest was just right in front of their eyes. Who would be willing to give up when the trophy is nicely placed in front of them?</p><br/><p>Between the Stone Bridges, there was no land at all. If players were to fall in between the space of the bridges, only death would greet them. Fortunately, there were two air walls blocking the two sides of the Stone Bridges. Therefore, players would not be blasted off the bridges into the abyss when the boss uses {Dragon Wing Strike}. Because the entire area forbade anyone from flying, it would mean that players would still fall to death even if they are mounted on their flying mounts. That would be very unfair for all players when the monsters and bosses were so powerful in the first place. Therefore, designing two air walls to prevent something like that from happening was one clever move for the game developers.</p><br/><p>While the other two parties had suddenly lost their ‘main’ source of firepower, the Lone Desert Smoke still had Zhang Yang and his {God of War Inheritance} to support on dealing damage to the boss! Although they also lost a powerful source of firepower when the two Phoenix ran out of juice, they were still able to maintain approximately 140,000 DPS. As long as they hold out long enough, they would be able to kill the boss, eventually.</p><br/><p>\"Everyone, get over and stand beside Zhang Yang now!\" Han Ying Xue suddenly shouted, \"I can heal you all up!\"</p><br/><p>Zhang Yang was the only one who was standing right in front of the boss while the others were rounding up the boss from the sides and its rear. Why would the others still stand by the two sides of the boss and its rear even after knowing that the boss could use {Dragon Wing Strike}? The reason was simple. The rate of the boss activating its {Dragon Wing Strike} was much lower than the rate of the boss activating its {Frost Breath}. The boss would only activate its {Dragon Wing Strike} once every 45 seconds while it would activate {Frost Breath} once every 10 seconds! There was a large difference between the rates.</p><br/><p>However, Han Ying Xue informed everyone that she could handle the heat in healing everyone up. After being on the same party as she was for so long, everyone would naturally entrust their lives to her. They ran straight over to the front of the boss without hesitation.</p><br/><p>\"Huh? Are those people trying to get themselves killed?!\" When the players of Land of Savages and Hell Family saw what the players of Lone Desert Smoke were doing, they were shocked. Standing before the mouth of that powerful dragon could really avoid the impactful strike from the {Dragon Wing Strike}. Theoretically speaking, players would be able to be more focus on dealing damage to the boss without much interruption like they had while attacking the boss from the sides and its rear. However, the boss’s {Frost Breath} would deal a great deal of damage to the players if they stand right in front of the boss! It was a suicidal act!</p><br/><p>\"Haha! They are the fastest team and yet they are still trying to speed things up! If they are so eager to die, good for us!\"</p><br/><p>\"They are trying to kill themselves so that we can have our chance to win? How noble of them!\"</p><br/><p>\"Brothers, let’s hustle up and get going! We still stand a chance to win! There’s still hope!\"</p><br/><p>Phew! The Frosty Ghost Dragon opened its large mouth and spat out a frosty breath towards the front. Everyone including all Battle Companions, the two Phoenix pets and every single player in the party received a basic damage of 80,000 damage. The AoE attack of the boss was extremely terrifying!</p><br/><p>Han Ying Xue humphed lightly and raised up her hand. In just 5 seconds, she miraculously healed up everyone’s HP bars back to full!</p><br/><p>That was just amazing!</p><br/><p>That is what the Class S Inheritances are all about! That is why Class S Inheritances are so rare in the entire game! It was just marvelous!</p><br/><p>The players from the Land of Savages almost popped their eyes out staring at Zhang Yang and his party. What just happened? Was that Healer really a Healer? Even the powerful Healers would not have so much juice in them to heal so much in such a brief period of time! So this is the true power of a ‘Milkmaid Deity’!</p><br/><p>Meanwhile, the Hell Family almost ground their teeth to ashes! That Inheritance would have been theirs to claim if it weren’t for Zhang Yang and his guild. They still could not get over the fact that Zhang Yang ‘cheated’ and got the Inheritance for his own guild member! They were disgusted by the thought of it! Of all members of the Hell Family, Hell Priest was the one person that resented at it the most. He would have jumped over to the other bridge in an attempt to choke Han Ying Xue and Zhang Yang to death, if there were no air walls blocking the sides of the Stone Bridges --- of course, without the air walls by the sides of the bridges, he would have fallen to his own death first.</p><br/><p>The ‘Milkmaid Deity’ had made her move! No one would be able to top her healing ability!</p><br/><p>Now that the {Dragon Wing Strike} was out of the picture, the gang was able to focus on dealing damage to the boss efficiently. The DPS of the entire party had been restored to the highest theoretical damage output --- 160,000 damage per second! Their morale was boosted up and everyone was performing beyond their regular standards! They managed to raise the maximum amount of DPS from 160,000 damage to 180,000 damage!</p><br/><p>\"It doesn’t matter if you’re human, orc, elf, dwarf, goblin or whatever you are. You are just insignificant pests right in front of the great Giant Dragon!\" the devilish spectral flames lighted up within the eye sockets of the Frosty Ghost Dragon. The two blue-green flames were moving around in the eye sockets like two huge lanterns while the boss spat out its {Frosty Breath}. It attempted to wipe out any existence of living beings right in front of it. However, these insignificant beings were like cockroaches! They were really difficult to kill!</p><br/><p>No! They were even harder to kill than cockroaches! If they were like cockroaches, they would all have been killed by the powerful blast of the {Frost Breath}.</p><br/><p>\"Haha! Stinky boss! Just give yourself in and drop all the money you have on you! Come on!\" Wei Yan Er sounded like a robber as she swung her huge axe at the boss like a mad lady. Only God would know where she learned to talk like that.</p><br/><p>Zhang Yang could not help but smile, and then he said, \"Little brat, if you can OT now, I shall sponsor you a trip over to France! You can also have all the perfume and handbags that you want!\"</p><br/><p>\"Stinky boss! You’ve activated your Inheritance Transformation! It’s obvious that you’re bullying me!\" Wei Yan Er snapped. She was not an idiot, after all. Then she said, \"Let’s compare our damage output then! If I can deal 1/10 of your damage, then I win!\"</p><br/><p>\"... why did you set such a low target?\"</p><br/><p>\"1/10 is a lot, you know! After all, you’ve activated your Inheritance Transformation!\"</p><br/><p>\"You damn pests! Just die!\" Frosty Ghost Dragon let out a raging roar and said, \"We’re the first beings ever created by the gods! We are the Giant Dragons! We have the greatest power in the entire world! We are the representatives of the gods! We are immortals! With the falling of the gods, we are the new gods!\"</p><br/><p>\"Disrespecting me means disrespecting the gods! You shall all be executed and your souls shall be imprisoned in hell, for eternity!\"</p><br/><p>\"Stinky dragon! You’re dead! You’re just a stinky ghost! What’s there to be proud about? Pui!\" Wei Yan Er was most impolite, \"You should look into a mirror and look at yourself! Just have a good look at the kind of sh*t you’ve become! You’re just a bunch of bones cobbled up together! Who would actually respect a bunch of bones that talks sh*t! How dare you call us pests! You’re the pest! You, a giant boney four-legged reptile who only knows how to crawl on your hollow belly like a piece of sh*t!\"</p><br/><p>\"Rawgh!\" The Frosty Ghost Giant almost lost itself and went berserk after being taunted by the little brat. It kept roaring in anger. If there was no such thing as an aggro system, the boss would have taken out the little brat first. After all, this boss seemed to be an intelligent AI.</p><br/><p>\"Hahaha!\" everyone was laughing. The little brat could always create such amusement for the people around her.</p><br/><p>Another half an hour had passed, the three parties were now worlds apart.</p><br/><p>The boss in front of Zhang Yang and his party only had over 60% HP left while the bosses on the side of Hell Family and the Land of Savages still had over 89% and 88% HP left. Such a difference shouldn't be dismissed as menial, or negligible. In fact, it had the potential of covering the distance between heaven and earth!</p><br/><p>Judging from the progression speed of the Hell Family and the Land of Savages, even if Zhang Yang and his party were being wiped out all of a sudden, even if there wasn’t anyone to compete with them, they would still be having trouble taking down the boss. With their current firepower, they would need at least 12 hours to completely empty out the HP bar of the boss!</p><br/><p>However, would they be willing to give up now?</p><br/><p>Before true despair, they would still believe that miracles could happen anytime! The two parties were really starting to believe in miracles --- they still had a glimpse of hope that when Zhang Yang and his party takes out the boss, the air walls would vanish! Maybe they could take that opportunity to rush in and snatch the chest!</p><br/><p>In terms of HP amount, Zhang Yang would definitely not be able to top the boss. However, Zhang Yang could have over 17,920,000 HP the moment he activated his {God of War Inheritance}. With the boss’s ‘insignificant’ Attack power, it would not be possible for the boss to deal much damage to Zhang Yang at all. From that point of view, Zhang Yang was the boss, and this dragon was the player!</p><br/><p>Therefore, the {God of War Heavy Axe} could work its best under that sort of circumstances! After all, this Skill could deal over 300% melee physical damage if the target has lower HP % than him. On the contrary, this Skill would only deal 100% melee physical damage if the target has higher HP % than him. That amount of damage would be like the amount of damage that a normal attack could deal.</p><br/><p>While he was in his {God of War Transformation} mode, each normal attack that Zhang Yang struck out could deal damage ranging from 193,607 to 210,284. The {God of War Heavy Axe} could deal up to 600,000 damage in one single hit! On top of those damage values, those were not Critical Hits and the {Lucky Strike} had not been triggered just yet. Truth to be told, Zhang Yang now had over a 15% Critical Rate and an 8% rate to trigger {Lucky Strike}. Those were not exactly low chances!</p><br/><p>Unfortunately, the rate of triggering his most powerful Skill {Rising Dragon Strike} was far too insignificant. Zhang Yang could have dealt 2,000,000 damage with one hit! The boss could be pushed into deep sh*t if that effect is triggered by a couple of times more!</p><br/><p>‘-1,812,321!’</p><br/><p>Although the {Rising Dragon Strike} did not trigger, Zhang Yang managed to trigger the effect of {Lucky Strike} with his {God of War Heavy Axe}! The 1,800,000 damage had the boss roaring in excruciating pain and suffering. Its entire body trembled violently. The two devilish spectral pair of flames in the middle of the boss’s eye sockets dimmed for one brief moment!</p><br/><p>One hour later.</p><br/><p>It was time to throw another {Glare of the Death God} at the boss.</p><br/><p>Phew! A dark skull began to form on top of the boss’s head. The skull began to smile wretchedly without making any sound.</p><br/><p>Yes! Zhang Yang had finally succeeded!</p><br/><p>\"Kill! Kill! Kill! No time to lose!\" Everyone was so joyful! With that effect in play, the boss was as good as dead!</p><br/><p>‘-10,000,000!’</p><br/><p>‘-10,000,000!’</p><br/><p>Though the amount of HP the boss had was too much, it had turned around to bite it. The special effect of the {Glare of the Death God} was now amazingly effective because it worked based on the HP percentage of the boss! Every single trigger took out 10,000,000 HP of the boss! None of the players in the entire game could deal that amount of damage at the current stage of the game --- unless Zhang Yang could trigger {Rising Dragon Strike} while in his God of War Transformation mode. Furthermore, that strike would also be a Critical Strike, stacked with the effects of {Lucky Strike}. By then, Zhang Yang should be able to deal over 12,000,000 damage!</p><br/><p>However, it would be almost impossible for so many coincidences to happen at the same time!</p><br/><p>Under the bombardment from Zhang Yang and his gang, the special effect of the {Glare of the Death God} had been triggered 10 times. By the time when they were done, the Frosty Ghost Giant only had 35% HP left. Meanwhile, the other two parties were still struggling with the bosses as the bosses on their sides still had approximately 85% HP left. Zhang Yang and his party were way ahead of the other two parties! From the looks of it, they had secured the winning position in this contest.</p><br/><p>After all, the two other parties did a grave mistake of using up all available Inheritance Transformations. They should have reserved some as they cleared up the previous monsters and bosses. Now they could only stare at Zhang Yang and his party from afar.</p><br/><p>\"The great Giant Dragons will not be defeated by you pathetic worms! Begone!\" </p><br/><p>The boss on the same Stone Bridge as Zhang Yang and his party had a really bleak future. It was only capable of screaming some slogans and dialogues without posing any solid threat to the gang at all. On the contrary, the two bosses on the other two Stone Bridges with the other two parties were exhibiting their might as how Ethereal Tier bosses should be!</p><br/><p>30%, 25%, 20%!</p><br/><p>Another tens of minutes had gone by, the HP bar of the boss had dropped down to 20%. The battle had entered the ‘Killing Cleave’ stage!</p><br/><p>Everyone timed it right, this time. They had been reserving all potions that could provide explosive effects on them, and also their Skills that could deal a tremendous amount of damage. The moment the battle entered the ‘Killing Cleave’ stage, everyone unleashed everything that they had been reserving throughout the entire battle!</p><br/><p>Zhang Yang activated {Indiscriminate} and gulped down a bottle of [Beginner Power Potion (Grade 10 Transmutation)], followed closely by a strike of {Killing Cleave}!</p><br/><p>Let the {Lucky Strike} trigger once this time!</p><br/><p>‘-4,336,796’</p><br/><p>{Indiscriminate} ensured that {Killing Cleave} would become a Critical Hit right after Zhang Yang activated {Indiscriminate}. Furthermore, Zhang Yang took down a [Beginner Power Potion (Grade 10 Transmutation)] which boosted his Attack power by 40%! His Rage Bar was full at the moment as well. So when he struck out with his {Killing Cleave}, the damage that he dealt broke through the damage cap of 4,000,000 damage!</p><br/><p>\"What the f*ck! That amount of damage is a little bit too much! I can’t believe my own eyes, man! I would be instantly killed even if I activate my Inheritance Transformation Skill!\" Fatty Han squeaked.</p><br/><p>\"You’re thinking way too much! {Killing Cleave} can only be used when the HP bar of the boss is below 20%. Furthermore, it would require a Critical Hit in order to pull off that amount of damage! It’s not like I can just do it anytime I want!\"</p><br/><p>\"But that amount of damage was really awesome!\"</p><br/><p>\"Haha! So, you can die in peace now, my Boss!\"</p><br/>\n</div>"}