{"title": "Chapter 658: Hartens", "id": 658, "volume": 7, "url": "http://boxnovel.org/mmorpg-rebirth-of-the-legendary-guardian-chapter-658-hartens", "volume_title": "Volume 7", "body": "<h1>Chapter 658: Hartens</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 658: Hartens</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Zhang Yang returned to Rainbow Village and submitted the quest, obtaining 5,000,000 experience points as a reward. Even though 5 million experience points was not a small amount, Zhang Yang EXP bar had merely budged by a tiny tick. Zhang Yang could not really do anything about it when it comes to leveling. It was really getting tougher and harder to gain levels.</p><br/><p>\"HAHAHAHA. *snort* You have to be a pig! A pig, I’d say!\" Shabu was extremely delighted as he held Zhang Yang’s tiny hands in his massive hooves – hand hybrid limbs.</p><br/><p>Being called a pig by a pig...how does someone react to such a…comment? Should Zhang Yang be happy? Or angry…? With all the right mind, Zhang Yang would not want to be a pig…he quickly addressed another issue to change the topic. \"Chief, I heard about something concerning a Sacred Keepsake?\"</p><br/><p>\"Hahaha. That, my little piglet, is the secret of Rainbow Village! No one can know about! However, I’ll willing to tell you, for you have the blood of the boar in your veins. As far as I can tell, you’re one of us!\" Shabu snorted happily.</p><br/><p>\"It was thanks to the Sacred Keepsake that the village was named Rainbow Village. It was a Violet-Platinum Pillar, inherited since the ancient beings roamed the earth. Placed in the Seven Color Pool, the Sacred Keepsake will radiate the colors of the rainbow!\" </p><br/><p>\"After refining, the Rainbow Light can be made into Rainbow Crystals. We sell the crystals to merchants to provide daily necessities for the village. To put it mildly, it’s our only source of income!\"</p><br/><p>\"Something must have happened then. Was the keepsake stolen?\" Zhang Yang asked blatantly.</p><br/><p>\"That’s right.\" Shabu sighed. \"A few months ago. A Mountain Giant raided our village and took the Violet-Platinum Pillar! Without the pillar or the pool, there are no other means of producing the Rainbow Crystal! As of now, we have only enough crystals left for 3 days! After that, we will be out of resources!\"</p><br/><p>\"We may be the proud sons of the god, but the Mountain Giant is just too strong for us to handle. We have carried out many raiding attempts, but we were never been able to defeat the d*mn stone golem! HOWEVER!\" Shabu suddenly exclaimed.</p><br/><p>\"We have found a way to turn the tables around! Instead of defeating the stone golem, we only need to lure him out of the cave where he had stashed the keepsake!\"</p><br/><p>\"However…sigh…That lazy *ss stone golem is as lazy as us boars! He loves to laze around in his cave and he would never leave the place! Moreover, every time he leaves the cave, the golem would close the cave with a giant stone! We have no power or means of moving the door away!\"</p><br/><p>\"After sometime, I have crafted a strategy. Since the stone golem loves weird, flashy things, we can make that sort of thing easily, to lure him out of the cave. We can put the bait somewhere close to the cave, and he would not cover the cave, then!\"</p><br/><p>\"We have never had warriors would could defeat the harpies nor the snake. Thus, we have never been able to craft the bait for the strategy! Until you came! Zhan Yu! The true warrior of the boars! In the name of Canaans and the savior who he had sent us! My plans to retrieve the keepsake shall be a success!\"</p><br/><p>While Shabu was happily indulging in his pseudo-victory, Zhang Yang was frowning madly. Since they had been battling for many rounds, could they not create a sneaky squad to steal the keepsake while the battle team keeps the golem occupied?</p><br/><p>\"Zhan Yu, Warrior of the Wild Boarmen, would you steal the Keepsake for us?\" Shabu asked Zhang Yang with hopes in his eyes. Could he not? Sigh…</p><br/><p>‘Ding! Shabu Canaans has a quest for you: Steal the Sacred Keepsake. Would you accept it?’</p><br/><p>\"I will do my best.\"</p><br/><p>Shabu smiled with his tusks sticking out from his upper lips. \"I like your response. Take this. Use it timely and lure the stone golem out of his cave! Zhan Yu, this mission requires speed like never before. I wish for your safe return.\"</p><br/><p>‘Ding! You have obtained: Sparkling Bait!’</p><br/><p>[Sparkling Bait] (Quest Item, Usable)</p><br/><p>Use: Place it on the ground to lure the Mountain Giant our of its cave. The bait will create a loud noise to attract the golem out. You will then infiltrate the cave while it is occupied by the bait. Speed is the essence of victory. Slow, and you all be caught and killed by the golem.</p><br/><p>All and all, Zhang Yang had no need to fight, but to steal and run!</p><br/><p>Zhang Yang left the village and flew towards the mountain region with his Phoenix pet. Zhang Yang flew west and after two large and long mountain regions, he descended downward until he could already see the mountain giant’s character.</p><br/><p>Weirdly, the giant was not hiding in its cave hiding nor sleeping as what Shabu had told him. The golem was in the middle of a fierce battle.</p><br/><p>[Hartens] (Ethereal, Elemental Being)</p><br/><p>Level: 140</p><br/><p>HP: 240,000,000 / 300,000,000</p><br/><p>Defense: 9,410</p><br/><p>Melee Attack: 70,044 – 90,004</p><br/><p>Skills:</p><br/><p>[War Stomp]: Sends a violet quake, deals 80,000 physical attack to all targets within 50 meters.</p><br/><p>[Maiming Maul]: Deals 150% melee physical attack, causes the target to receive 20% additional damage for the next 10 seconds. Effects cannot stack.</p><br/><p>[Elemental Constitution[: Restores 1% HP every 30 seconds, recovery rate cannot be affected by any skill.</p><br/><p>Note: Hartens is an extremely lazy Mountain Giant. The only thing that could entice it to move are shiny objects.</p><br/><p>How was there a war in the middle of nowhere…Could it be a guild attacking the boss?</p><br/><p>Zhang Yang unsummoned the Phoenix pet and peeked carefully without exposing his position. The boss was fighting on flatlands and there were three squads fighting around the boss and three squads fighting elsewhere. The weird part was the fact that the players surrounding the boss were not just fighting the boss, they were also fighting amongst themselves!</p><br/><p>Zhang Yang took a closer look and understood the reason. There were two guilds, The Myth, and Sengoku Daimyo.</p><br/><p>The Myth was formed by Zhang Yang all-time enemy, while Sengoku Daimyo was a guild that had 99% Japanese players. Each player that belonged to Sengoku Daimyo had the tag \"Japan-Korea Region\", highlighted with a deep reddish outline.</p><br/><p>If Zhang Yang were to guess correctly, the two guilds should be there for an Inheritance quest kill. Supposedly, the stone golem, Hartens was the Inheritance final boss, and they were there, coincidentally for the quest item. Zhang Yang understood the need for war. A quest boss cannot be allowed to be killed by another guild! Especially when the boss was one of the few bosses in a high leveled map! That sort of boss will only respawn after a month (real time). Who could wait that long! Furthermore, the Ethereal tier drops were so valuable right now! Since both guilds would not allow the other to have the boss, they had decided to have a fight till one emerges victorious.</p><br/><p>The fight was between the boss, The Myth, and Sengoku Daimyo, with none of them, including the boss choosing either side. Every sides were attacking each other while they were constantly changing their formation to make sure they would have minimal casualties.</p><br/><p>Zhang Yang stayed to watch and noticed that The Myth were not attacking as aggressively as their opponents. Even though he was unable to directly observe the damage dealt to each other, he could conclude that the boss was somewhat \"sided\" with the Myth. The boss was mostly attacking Sengoku Daimyo.</p><br/><p>That sort of \"cooperation\" was intentional. Rather, the boss was affected by the aggro system and had been attacking those with the higher aggro values. Despite that, Hartens had powerful AoE skills which caused damage to The Myth as well. In the beginning, or rather, when Zhang Yang had started to observe, the two guilds were roughly on the same level. With a little time, and the boss’ help, The Myth started to gain advantage over the war.</p><br/><p>It did not take long for Sengoku Daimyo to notice the oddity in the battle and immediately stopped their attacks towards the boss. Instead, they switch their attack target towards The Myth. The reason they had stopped attacking was to allow all the players that the boss was attacking to die, and after that, the boss would resort to attacking randomly!</p><br/><p>The boss’ {War Stomp} was an AoE skill that could deal a powerful 80,000 damage to all enemies. Right then, even a Level 120 with a full set of Violet-Platinum armor would have at most, 80,000 HP. At the very least, they would have 120,000 HP when mounting on a Yellow-Gold battle mount. That was the strength of an average guild. If the player wanted a full set of Mythical tier equipment…or rather…a team of 50 men with full set of Mythical tier equipment…that would be an impossible dream. Perhaps, not for someone like Liu Wei.</p><br/><p>If the boss were to go on a rampage, both guilds would inevitably suffer! Zhang Yang did not agree with the actions of the guild. As he continued to observe from the top of the mountain, he noticed something amiss. A group of tanks and healers had peeled off the battle and moved towards toward the boss. They then kited the boss away, far from the war. It seemed that someone had noticed the downside of allowing the boss to rampage and decided to act. However, there was still one aspect that they had missed out on. If the total DPS does not exceed the boss’ regeneration, it would be a complete waste.</p><br/><p>The correct method of solving the problem was to eliminate one problem at a time. However, the problem that was present at that time was the enemy of both guilds were a guild and a boss!</p><br/><p>Zhang Yang shook his head disapprovingly at their decision. However, it was by far, the best situation for Zhang Yang! He could nonchalantly enter the cave and take the quest item with no trouble at all! Instead of the Phoenix, Zhang Yang chose to use the Violet Thunderhawk to travel. The Phoenix was just too grand and conspicuous. The Violet-Thunderhawk was different. Zhang Yang shot through the air like a missile across the sky and zoomed into the cave. With the great, intense battle going on, no one would notice Zhang Yang’s sudden intrusion. If he were to ride on the Phoenix, the long trail of flame would be a beacon of light in the vast void, anyone would notice him immediately!</p><br/><p>The cave was large, but not too deep. Zhang Yang only flew for a few hundred meters and had reached its end. There, he found the item he was seeking for. It was a long, shiny pole with a little sharp end.</p><br/><p>[Violet-Platinum Pillar] (Quest Item)</p><br/><p>Description: The best toothpick ever!</p><br/><p>WHAT?</p><br/><p>Zhang Yang did not bother to examine the item, for when he thought of how the giant was using it as a toothpick ultimately disgusted him. Now that the item was in hand, it was time to leave. However, Zhang Yang grinned like a madman when he observes the still ongoing battle.</p><br/><p>When wars are fought, the vultures shall be fed.</p><br/><p>It was impossible for Zhang Yang to kill Harthens alone, even if he uses the God of War Inheritance. He could, if the skill {Berserker’s Heal} had not been erased from the game. But then again, one does not need to work hard, if he works smart! If he sneaks into the battlefield and reaches out to the boss at the very last minute, he could practically loot all the drops without them noticing! It wouldn’t even be a difficult task, to begin with!</p><br/><p> Zhang Yang had no reason to let them have the better end, for neither Liu Wei nor the Japanese were on his good side.</p><br/>\n</div>"}