{"title": "Chapter 657: Gathering the Feathers", "id": 657, "volume": 7, "url": "http://boxnovel.org/mmorpg-rebirth-of-the-legendary-guardian-chapter-657-gathering-the-feathers", "volume_title": "Volume 7", "body": "<h1>Chapter 657: Gathering the Feathers</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 657: Gathering the Feathers</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>The Scorching Amber Canyon was located by the north side of the Rainbow Village. While Zhang Yang was flying towards the canyon from afar, he could see Harpies gliding around the sky above the canyon. Their numbers was so shockingly high that they blotted out the sun! It looked like they were building an army or something.</p><br/><p>These Harpies had bodies and faces of normal humans. However, their feet were the claws of the birds. The tips of their claws were so sharp that they could easily crush rocks! Their arms were actually their large wings which kept them in the air.</p><br/><p>These Harpies were all female. They were basically naked. Some feathers covered up the vital parts of their chest and the part in between their legs. Well, it was an enchanting scene to gaze upon, for men! Well, their waistlines were perfect. Their boobies were simply glorious! Their hips were so desirable! The perfect curves were definitely present on every single one of them. If you omit the fact that they had those claws and wings, every single one of them could potentially be hot and beautiful women!</p><br/><p>These Harpies were called after the name of ‘Crimson Fire Harpy’ for one simple reason. Their wings were so red that they looked like they were on fire, fire that was blazing hot that anything close to them might get scorched immediately. It was really a marvelous vision to gaze upon. However, they did not seem to be marvelous anymore when they are compared to Zhang Yang’s Phoenix pet.</p><br/><p>[Crimson Fire Harpy] (Elite, Humanoid)</p><br/><p>Level: 135</p><br/><p>HP: 2,700,000</p><br/><p>Defense: 3,540</p><br/><p>Melee Attack: 19,298 - 23,298</p><br/><p>Skills:</p><br/><p>[Wail]: Causes the target to run blindly in terror. Lasts for 10 seconds.</p><br/><p>[Scorching Burns]: Scorches the target and afflicts the target with Burn Effect. Causes 30,000 Fire Damage to the target.</p><br/><p>Upon reading the description of the Skills, Zhang Yang could only frown intensely. Those Skills had effects that could potentially give him a hard time if he lures too many monsters over to him. If the monsters could chain up a consecutive Status Restriction Effect on him, he would be as good as dead, even if he has over 1,000,000,000 HP!</p><br/><p>From that perspective, the most difficult part about battling a boss was the fact that the boss would mostly not be affected by Status Restriction Skills.</p><br/><p>{Spear of Obliteration}!</p><br/><p>Zhang Yang struck one of the Harpies that was wandering by the bottom of the mountain. The Harpy was annoyed for being struck straight in the face. It immediately let out a screech and charged towards Zhang Yang, reaching out with its sharp claws.</p><br/><p>Felice had already transformed into her Dragonhawk Form before Zhang Yang had launched his assaults on the monster. She launched her {Fire Missle} at the Harpy. The Phoenix pet did not stay idly by the corner. It also spat out flames straight on the Harpy and caused a tremendous amount of damage to it. With these two crazily powerful attackers, the Harpy lost approximately 90,000 HP in an instant1</p><br/><p>\"Argh!\" The strike from the Harpy’s claws was blocked by Zhang Yang with his shield. Well, he did activate {Block}. In the meantime, Zhang Yang swung his axe and caused nearly 84,000 damage to the Harpy the moment its claws made contact with Zhang Yang’s shield. The Harpy was in so much pain that it screamed and trembled. Feathers were falling off its wings as the thunderous blow rolled past it.</p><br/><p>{God of War Devastation}!</p><br/><p>‘-258,902!’</p><br/><p>The Rage Bar had hit its ceiling cap at the moment. Zhang Yang had no reason to hold back at all. He struck the Harpy with his {God of War Devastation} and caused a damage that was nearly 3 times of his Melee Attack. That was quite some damage he did there!</p><br/><p>Even though the Harpy had over 2,700,000 HP, it could not sustain so much damage like how it did back there! It let out a deafening screech and a visible supersonic wave forced its way into Zhang Yang’s brain. Zhang Yang felt a sting in his head. Immediately, he lost control over his own body and ran around while he was riding on the back of his Phoenix pet.</p><br/><p>{Warrior’s Will}!</p><br/><p>Without a doubt, he activated his Skill to break himself free from the Terror Effect. Then, he carried on dealing damage to the Harpy that had gone berserk.</p><br/><p>\"Phew!\" The Harpy did not cease its assaults on Zhang Yang. It immediately spat out endless flames. Unfortunately, it could cause merely 16,204 damage on Zhang Yang even though it had over 30,000 basic damage. Zhang Yang had over 800,000 HP after mounting onto the Phoenix pet. So, 16,204 damage was just a piece of cake for him.</p><br/><p>Zhang Yang was launching his assaults on the Harpy like he was chopping vegetables. He was also supported by Felice and his Phoenix pet as well. With the three of them dealing a substantial amount of damage to the Harpy, the Harpy was losing its HP faster than it could breathe!</p><br/><p>The cooldown of {Wail} was 1 minute. Meanwhile, Zhang Yang ony required lesser time than that in order for him to remove a total amount of 2,700,000 HP. Furthermore, he had help from Felice and the Phoenix pet. The Harpy was taken down to the ground by the three of them in less than half a minute. Zhang Yang earned quite a substantial amount of Experience Points after slaying the Harpy.</p><br/><p>As the game progresses on, the difference between the performance of a normal player and the performance of a high Tier player would differ more and more. Usually, it would take about a party of 5 normal players to take on this kind of monster. It would be essential for the party to have a Tanker, A Healer and two DPS players in order to slowly deplete the HP of this monster. However, higher Tiered players do no need to worry about their own HP bars at all. They only needed to make sure they could deal as much damage as possible to the monster before their own HP bars goes empty.</p><br/><p>Under the current circumstance, Zhang Yang only lost approximately 110,000 HP. He only lost 14% HP as he was mounted on his pet. With that much HP, Zhang Yang could take on 7 of these Harpies before being forced to take some [Snacks] or [Bandages] to recover his HP.</p><br/><p>‘Ding! You have acquired an item: Crimson Fire Harpy’s Feather X 3!’</p><br/><p>The first few monsters he slew had dropped the very quest item he was searching for. However, the quest required Zhang Yang to collect 1,000 feathers. It seemed that this quest would get Zhang Yang going about in the jungle for quite a while.</p><br/><p>Zhang Yang had also wondered if there was a possibility of a boss existing among these massive flock of Harpies. Zhang Yang went on to lure a second Harpy over to him as he had such thoughts on his mind. However, he soon realized that it was unlikely that a boss would exist among a massive horde of monsters.</p><br/><p>If he takes on one monster at a time, it would not even be a challenge for Zhang Yang to take down that one monster. However, if Zhang Yang lures too many monsters over to him at the same time, he would be in deep trouble if the monsters chain up their Status Restriction Skills on him perpetually. {Wail} could last for 10 seconds, and it had a cooldown period of 1 minute. Hence, having 6 of these Harpies chaining up their Status Restriction Skills consecutively on him would be enough to lock Zhang Yang in until he is tortured to death!</p><br/><p>No one could afford to challenge a bunch of monsters with Status Restriction Skills!</p><br/><p>Zhang Yang shook his head and continued on gathering the feathers.</p><br/><p>The quest did not request that Zhang Yang slays any specific monsters in order to get the feathers. Therefore, he did not go deeper into the canyon. He only wandered around by the outer skirt of the canyon. Well, as long as he slays a Harpy, there will be a possibility of the quest item dropping. He had no reason to risk his own life venturing deeper into the canyon all by himself.</p><br/><p>More than three hours later, Zhang Yang finally gathered 1,000 Harpy’s feathers. He headed straight to Rainbow Village to hand in the feathers.</p><br/><p>\"You indeed have the blood of the great Wild Boarman flowing in your veins!\" Shabu tapped on Zhang Yang’s shoulder and praised, \"May the great Canaans bless you always!\"</p><br/><p>‘Ding! You have completed a quest: Gather the Feathers. You have received a reward: 5,000,000 Experience Points!’</p><br/><p>Although it was not much of a reward to receive, Experience Points were hard to come by these days. It would be better than getting nothing at all.</p><br/><p>\"Zhan Yu, we can’t just stop here. Not yet! We must hustle up and do our best! I need you to collect 20 Complete Snake Bones of the Onibi Coastal Taipan. Well, they’re snakes. By having their bones, I think we can finally get that Sacred Keepsake!\" Shabu was filled with a sense of joy.</p><br/><p>‘Ding! Shabu Canaans has a quest for you: Collect the Snake Bones. Will you accept?’</p><br/><p>Zhang Yang nodded and said, \"My respected Chief, just sit tight and wait for my return with good news!\"</p><br/><p>\"You’re the warrior of the Wild Boarmen, the pride of our Rainbow Village! I believe that you will prevail!\" Shabu Canaans raised his piglet nose while talking with pride. It seemed that he actually believed deeply in everything he just said!</p><br/><p>Zhang Yang left in begrudgingly as there was no way for him to get through to that wild boarman. He made haste out of the village and went straight for the Blue Water Pond located by the east side of the village.</p><br/><p>It was a vast water pond. The water of the pond was aquamarine in color and there was no telling down deep the pond would be, because the water was not crystal clear. The surface of the pond looked frosty, though. Cold vapor was rising from the surface of the water, freezing the air above the pool. The process formed a mist above the surface of the pool. The scene was spectacular to gaze upon. However, that spectacular scene was ruined a little by the ‘infestation’ of countless python-like creatures. The smallest of them all were at least tens of meters long. Their bodies were as thick as the mouth of a large bowl. Meanwhile, the large ones were about 40 to 50 meters long. Their bodies were as thick as the waist of a grownup man! They looked like small mountains when they curled themselves and rested by the water pond!</p><br/><p>[Onibi Coastal Taipan] (Elite, Beast)</p><br/><p>Level: 140</p><br/><p>HP: 2,800,000</p><br/><p>Defense: 3,780</p><br/><p>Melee Attack: 20,834 - 24,834</p><br/><p>Skills:</p><br/><p>[Tail Whip]: Whips the target with its powerful tail of steel, causing 100% Melee Attack of Physical Damage to the target.</p><br/><p>[Bind]: Binds the target with its snaky body. If the target cannot deal 300,000 damage to the Onibi Coastal Taipan, the target will die of suffocation. On the contrary, if the target could deal 300,000 damage to the Onibi Coastal Taipan in time, the monster will unbind from the target.</p><br/><p>These monsters actually had an Ultimate Skill?! What the hell!</p><br/><p>If a player gets themself tangled up by one of the snakes, they would have to deal 300,000 damage to the Onibi Coastal Taipan or they’d be dead! That would require a DPS of 30,000 damage! It would not be a problem if there is a party around. However, if there are only one or two players in that situation, it would be extremely difficult to deal so much damage over the span of 10 seconds.</p><br/><p>However, Zhang Yang was deemed to be one of the top Tier players in the world. A DPS of 30,000 damage was just a walk in the park for him! Phoenix and Felice could already deal 20,000 damage in one second. Even if he stays idle and does nothing at all, the two of them could get Zhang Yang out in no time!</p><br/><p>Against such monsters, Zhang Yang was not stupid enough to lure too many monsters over to him. It was not a big deal if one Coastal Taipan came and binds him up. He could easily break himself free from the Coastal Taipan and slay it. However, if a few Coastal Taipans comes over and bind him up, the situation would be very different.</p><br/><p>As usual, Zhang Yang started up by throwing his {Spear of Obliteration} at one of the Coastal Taipans and engaged in battle.</p><br/><p>The Coastal Taipan was moving very agilely towards Zhang Yang. Its two aquamarine-color eyes were filled with murderous intent.</p><br/><p>That Coastal Taipan was at least 30 meters long. Long before it could reach Zhang Yang, Zhang Yang could smell the foul breath of the snake. When the snake opened its mouth wide, two huge fangs emerged, and it was terrifying to look at!</p><br/><p>For normal players, battling an Elite Tier monster is almost as hard as battling a boss. Just look at this Onibi Coastal Taipan. It had its very own Ultimate Skill that could potentially kill a player in an instant. The player would be required to deal 300,000 damage to the snake within 10 seconds in order to prevent the snake from killing anymore with that Skill. Well, 5 players were required at the very least to be able to deal such an amount of damage.</p><br/><p>The moment when Onibi Coastal Taipan arrived in front of Zhang Yang, it activated its {Bind} straight away. The thick body of the snake curled around Zhang Yang and wrapped him up tightly.</p><br/><p>Slash! Slice! Slash!</p><br/><p>Zhang Yang swung the battle axe repeatedly at the body of the snake as hard as he could. The damage values popped out one after another, as Zhang Yang slashed the snake up. Meanwhile, Felice and Phoenix pet did not just remain idle. They also fired away.</p><br/><p>In just 5 seconds, Zhang Yang, Felice and Phoenix pet managed to deal 300,000 damage to the snake. The Coastal Taipan loosened up its body and activated its {Tail Whip} straight away on Zhang Yang.</p><br/><p>Zhang Yang raised his shield and blocked the whip attack from the snake’s tail. His Strength attribute was way beyond the Strength of the Coastal Taipan. Even though the Coastal Taipan came at Zhang Yang with an imposing figure, Zhang Yang did not flinch at all. He stood his ground firmly while battling against the monster.</p><br/><p>\"Stinky snake! Just die!\" Felice imitated Wei Yan Er and scolded the snake as she was launching her assaults at the snake. She did not forget to add in some phrases and words in-between her attacks.</p><br/><p>\"Hiss!\" The Coastal Taipan hissed out its tongue and launched its assaults on Zhang Yang once again.</p><br/><p>As long as Zhang Yang is able to break free of the {Bind}, a Coastal Taipan appeared to be easier to kill than a Harpy. One main reason was that when the Coastal Taipan activated its {Bind}, it would not be able to launch any other assaults. It would be standing still for others to hit it for free. Therefore, the Coastal Taipan could deal much lesser damage to Zhang Yang than a Harpy could!</p><br/><p>Back then when he was battling against the Harpies, he would need to take his [Snacks] to recover his HP after taking down 7 of them. However, he could take down more than 10 Coastal Taipans before he is required to take his [Snacks]. His efficiency had increased by 50%!</p><br/><p>However, even though every Coastal Taipan would drop a Snake Bone upon their deaths, not every snake would drop a Complete Snake Bone. Some were either broken or damaged. Although the quest only required Zhang Yang to collect 20 Complete Snake Bones, it still kept him going for more than 3 hours in order to collect enough number of the quest items. The quest was not much simpler compared to the previous one.</p><br/>\n</div>"}