{"title": "Chapter 651: Blood Driven Madness", "id": 651, "volume": 7, "url": "http://boxnovel.org/mmorpg-rebirth-of-the-legendary-guardian-chapter-651-blood-driven-madness", "volume_title": "Volume 7", "body": "<h1>Chapter 651: Blood Driven Madness</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 651: Blood Driven Madness</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>It was the most troubling boss battle for them so far. Of course, the battle was only so troublesome and risky because everyone had to reserve some of their life-saving Skills and power for the battles that yet to come. If they ever come across any super bosses in the Open World Map, they could have easily bested the boss when every one of them activates their Inheritance Transformation Skills. They could just beat the boss into submission even if the boss goes berserk.</p><br/><p>However, there were quite a number of bosses on this special map. This special map was designed to be like a dungeon. Therefore, the party must ration and distribute the Inheritance Transformation Skills wisely. As everyone could not simply activate their Inheritance Transformation Skills at the same time, it made things much harder in this map. The battles here were tougher as well.</p><br/><p>Wei Yan Er went up and picked up the loots while Han Ying Xue was busy saving and resurrecting the other party members. Because {Redemption} had 5 minutes of cooldown period, Han Ying Xue decided to get Fantasy Sweetheart back on her feet first. By doing so, she increased the efficiency of saving the other party members.</p><br/><p>Since everyone was waiting for everyone to be resurrected, it would be best to take a look at the loot first.</p><br/><p>Wei Yan Er looked at the loot for quite a while before she said something. \"Cutey Drizzler reporting here, the stinky boss has dropped two Ethereal Tier equipment, two Mythical Tier equipment, one [Skill Book] and one Inheritance Fragment.\"</p><br/><p>\"Inheritance Fragment?! Of what class?\"</p><br/><p>The mention of Inheritance Fragment had perked everyone’s ears up. Although 9 of them already acquired their very own Inheritances, they were very interested to see if the Inheritance would be compatible with Fantasy Sweetheart. Even if it was not compatible, they could also give it to someone in their own guild. Who would complain if they could have more players with Inheritances in their guild?</p><br/><p>However, when Wei Yan Er posted out the description of the Inheritance, everyone was disappointed by it.</p><br/><p>[Toxicant Zombie Inheritance Fragment] (Inheritance Class: D)</p><br/><p>Description: - Irrelevant to the plot</p><br/><p>It was just a Class D Inheritance which did not even have a Transformation Skill. Everyone was not happy with what they saw at all.</p><br/><p>However, Zhang Yang revealed a smile on his face, then he said, \"You guys should just stop thinking about Transformation Skills. If a guild can get 100 players with Class C Inheritances, that guild could be deemed as the number one guild without a doubt. Classes won’t matter that much anymore when numbers overtake everything else! Players with Class D and Class E Inheritances are the backbone of a guild!\"</p><br/><p>He shoved the fragment into his inventory with the intention to auction it in his guild. Any member of the Lone Desert Smoke would be able to obtain the fragment by exchanging it with some guild points. Although his party members did not show any sign of interest in this Inheritance Fragment, many members of his guild would be pretty interested in getting it! After all, there was not more than 12 players with Class C Inheritance in Lone Desert Smoke. Such Inheritance fragments could potentially be a unique existence for everyone in Lone Desert Smoke.</p><br/><p>Fantasy Sweetheart was the most disappointed person among all. She was the only one who had not yet acquired an Inheritance up to this point. She felt left behind by the other party members as much as she felt that she was just holding the party back.</p><br/><p>Wei Yan Er took out another crimson red necklace. Then she said, \"Coming up next! A necklace!\"</p><br/><p>[Heart of Fire] (Ethereal, Necklace)</p><br/><p>Vitality: +1,089</p><br/><p>Intelligence: +373</p><br/><p>Spirit: +373</p><br/><p>Equip: Increases Maximum MP by 740 points.</p><br/><p>Equip: Increases both damage and healing efficiency by 5.6%.</p><br/><p>Equip: Absorbs 321 damage when being hit.</p><br/><p>Equip: Upon successful spell casting, there is a certain rate that you can shorten the casting time for your next spell by 50%.</p><br/><p>{Unidentified}</p><br/><p>Required Level: 140</p><br/><p>Special: Reduces Required Level by 20 levels.</p><br/><p>\"Wow...is today a special day for Spellcaster? Why are all the equipment today Spell-types!?\" Lost Dream laughed cynically.</p><br/><p>\"That’s right! No fair! There are so many of us in need of Physical-type equipment here! The system keeps on giving us Spell-type equipment! How fair is that!?\" Wei Yan Er nodded repeatedly.</p><br/><p>\"Alright, that’s enough... it doesn’t matter what type of equipment. Our party has grown much stronger now! That’s what that matters most!\"</p><br/><p>Han Ying Xue did not back off from rolling for the equipment. By the end of it, this lucky woman is indeed very lucky. She won by scoring 99 points and ‘eliminated’ the two ladies. Hence, she claimed the powerful necklace as her own.</p><br/><p>Another Ethereal Tier equipment was a misty gray pair of gauntlets. The surface of the gauntlets had the crafting of a dragon with its wings spread wide open ready to fly. The crafting was so real that the dragon seemed like it could just fly out of the gauntlets.</p><br/><p>[Flying Dragon Gaunlets] (Ethereal, Heavy Armor)</p><br/><p>Defense: +320</p><br/><p>Vitality: +2,178</p><br/><p>Strength: +7,45</p><br/><p>Agility: +318</p><br/><p>Equip: Increases Maximum HP by 2,350 points.</p><br/><p>Equip: Increases both damage and healing efficiency by 5.6%.</p><br/><p>Equip: Absorbs 641 damage when struck.</p><br/><p>{Unidentified}</p><br/><p>Required Level: 140</p><br/><p>Special: Reduces Required Level by 20 levels.</p><br/><p>\"My precious! My precious!\" Endless Starlight was staring at the gauntlets with his glittering eyes. He could not move his eyes away from the gauntlets at all. At the same time, he was licking his lips as well! He did not care to maintain his image anymore. Everyone was laughing at him at the bottom of their hearts.</p><br/><p>Zhang Yang could not bear to burst his bubble. So, he nodded at Wei Yan Er and Wei Yan Er spouted at him. Then the little brat raised up her hand and showed Zhang Yang one finger. Worry not, it was not her middle finger. She wanted to imply that Zhang Yang owed her one for this. The two of them gave up on rolling for the equipment. Hence, this powerful equipment had dropped into the possession of Endless Starlight. He became so joyful that he kept bowing at Zhang Yang and Wei Yan Er for letting him have it.</p><br/><p>\"So what’s the Skill of the Skill Book?\" Everyone turned their attention over to the final Skill Book.</p><br/><p>[Skill Book: Blood of Madness]</p><br/><p>Use: Teaches you the Skill {Blood of Madness}.</p><br/><p>Required Class: none.</p><br/><p>Required Level: 100</p><br/><p>Although the specific description about the Skill was not revealed just yet, everyone could guess what could the Skill do by observing the boss. Well, this Skill should be similar to the Skill that the boss had. After all, the two Skills were of the same name.</p><br/><p>Zhang Yang already had a Skill called {God of War Heavy Axe}. He would be required to maintain his HP at maximum in order for him to deal a damage that was 3 times higher than his initial damage. On the other hand, {Blood of Madness} would only work better when the HP amount of the user was getting lower. Theoretically speaking, {Blood of Madness} could boost all attacks. It would be much more powerful than Zhang Yang’s {God of War Heavy Axe}. However, having a low HP bar was a risk that any Tanker should not take. So Zhang Yang decided to give this Skill to others.</p><br/><p>However, it could be concluded that {Blood of Madness} was most suited for Tankers. Because Tankers were always on the role of being beaten up. Even though the HP bars of Tankers rarely went down to 20% or 30% low, but it was normal for them to keep their HP bars up at the level of 50% or 60%. Therefore, this Skill could at least provide approximately 40% boost on the Tankers’ damage that was equipped with this Skill. It would be a great power-up --- of course, only if the effect of this Skill would be the same as it was on the boss.</p><br/><p>After rolling to decide who gets the Skill Book, Wei Yan Er won by scoring the highest roll among all. She claimed the Skill Book and learned the Skill on the spot with joy flowing over her face. However, the moment after she learned the Skill, that joyful smile on her face froze.</p><br/><p>[Blood of Madness (Passive)]: Whenever your total amount of HP is reduced by 10%, your total amount of damage dealt will be increased by 1%.</p><br/><p>What the hell! The boss got a 10% increase in damage dealt and players only get 1% increase in damage dealt?! Even if the HP bar of the player drops down to below 10%, the player could only get 9% boost on damage dealt. No wonder the little brat was frowning so intensely just now.</p><br/><p>\"Don’t be sad. These damage-boosts are like free bonuses. Don’t tell me that you plan to solely rely on this Skill to boost your damage by reducing your HP. It’s risky as hell! Furthermore, this is not an Inheritance Skill. So, stop dreaming and accept it! It’ll be useful in the future!\" Zhang Yang patted the little brat’s head as he tried to comfort her.</p><br/><p>\"God damn it! God damn this!\" Wei Yan Er was very, very unhappy about it.</p><br/><p>The two Healers were busting their *sses saving everyone back on their feet. 10 minutes later, they had finally saved all 5 members who got themselves killed during the boss battle. After distributing the items and equipment among themselves, the gang continued to push on forward. Well, the last part of an endeavor is the hardest to accomplish, a thing is not over until it is completed. Now that their progress was only at 80%, they could not afford to let their guard down at all.</p><br/><p>Zhang Yang and Fatty Han activated the Transformation Skills of their Phoenix Pet. The two royal blood Phoenixes emerged out of the blazing flames. The two Phoenixes looked stunning and intimidating! Unfortunately, that wretched fatty was only at Level 127. He had prevented his Phoenix pet from being able to reach Level 130. Therefore, the attributes of his Phoenix was much weaker than then attributes of Zhang Yang’s Phoenix pet.</p><br/><p>However, Fatty Han was a Beastman Hunter. So he could provide some boost on the attributes of his pet. Therefore the attributes of the two Phoenix pets were on the same level.</p><br/><p>The moment the Transformation Skills of the two Phoenixes were activated, their AoE Attacks were now incredibly powerful.</p><br/><p>Fatty Han did not mount himself onto his Phoenix. As he was a Hunter, he could use a Phoenix pet as his pet to battle alongside with him. At the same time, he could also summon his Pet Mount. He had multiple advantageous over the other Classes in such regards. Meanwhile, the pet that the player mounts on would not retain their own Defense attributes. The Defense attribute would be based on the Defense of the player who is mounted on the pet mount. The Phoenix pet had over 16,680 Defense. If Fatty Han had mounted on it, then the Phoenix’s high Defense would have gone to waste.</p><br/><p>Zhang Yang was a Tanker. So his Defense was actually much higher than the Defense of his Phoenix pet. Therefore, it would be wiser for him to mount himself onto his Phoenix in order to boost up its Defense. At the same time, mounting onto a pet could provide an abundant boost to the amount of their shared Maximum HP as well --- well, Zhang Yang initially had over 450,000 HP prior to the Transformation.</p><br/><p>The two Phoenix pets flapped their majestic wings as they continued to spread hellfire across the hordes of their enemies. Upon their transformation, the ranged attack of the Phoenix pets could reach up to 20 meters far. The two of them were spreading their fire forward in a conical shape, torching up the entire section of the Stone Bridge. It was a spectacular scenery to gaze upon!</p><br/><p>Although the attack range of the Phoenix pets was much shorter than the attack range of a player after they activate their Transformation Skills, the Phoenix pets could attack once every 2 seconds while using AoE attacks as their normal attacks. Only Phoenix and Dragon-type pets of Celestial Tier and above were capable of doing this!</p><br/><p>Comparing one’s capability in dealing AoE attack with a Phoenix’s was only an act of depressing oneself.</p><br/><p>Who would be able to compete with them?</p><br/><p>The speed of the party's progression suddenly accelerated.</p><br/><p>In a normal situation, a party’s progression would only get slower and slower as they progress because they might be running short on playable cards, or simply running out of steam. However, Zhang Yang and his party were performing otherwise. They are incredibly powerful. Their courage would only mount as the battle progresses! Furthermore, Zhang Yang and Han Ying Xue had not yet activated their Class S Inheritance Transformation Skills!</p><br/><p>\"Hahaha! That party of 20 had been wiped out!\" Lost Dream suddenly burst into laughter. Now that only 4 parties remained in getting to the finishing line, everyone was very concerned about the progress of the other parties.</p><br/><p>The gang was confident enough to believe that they would triumph over the other parties if they were competing against each other under regular circumstances. Therefore, they were not fond of the ‘Cheating Party’ which had over 20 players. Unfortunately for them, the 4th boss was overwhelmingly powerful when his HP bar was low. When Ishildur only had 10% HP left, he went on a rampage with his highly boosted Attack power. A few measly Healers would not be able to catch up with the tremendous damage that the boss could deal. </p><br/><p>Meanwhile, the total HP of Ishildur was extremely abundant. Even though there were 20 of them trying to bring down the 10% HP of the boss, it was not possible for it to be done within 1 or 2 minutes. Unless they had more players who could activate their Transformation Skills, they would only have one option left --- to wait and die!</p><br/><p>However, how many more ‘backup’ players would still be able to activate their Transformation Skills, if any?</p><br/><p>Numbers would mean nothing when they are standing before Inshildur. The party of 20 was so badly pummeled. However, they also acquired some [Resurrection Monoliths] earlier in their progress. Many blinking dots suddenly appeared on the map. It was obvious that they had resurrected their Healers. That was how they managed to resurrect 4 players in such a brief period of time.</p><br/><p>However, the fact that they could not take down the boss in their first attempt had led them down to a path where they no longer had a chance of defeating the boss --- the number of Transformation Skills would only decrease instead of otherwise as the progress goes on.</p><br/><p>Zhang Yang and his party continued forward without thinking much about them. The number of Death Knights got lower and lower as they progressed onwards. A new type of monster is going to appear soon.</p><br/><p>[Mist Death Raptor] (Elite, Spectre)</p><br/><p>Level: 148</p><br/><p>HP: 2,960,000</p><br/><p>Defense: 3,780</p><br/><p>Melee Attack: 61,781 - 71,781</p><br/><p>Skills:</p><br/><p>[Trample of War]: Causes 100% Melee Attack of Physical Damage to all targets within the range of 10 meters from the caster. Targets will be stunned. Lasts for 3 seconds.</p><br/><p>[Pounce]: Causes 150% Melee Attack of Physical Damage to the target.</p><br/><p>Note: Raptors were ferocious beasts before they were dead. They became even more powerful after they had been turned into Spectre.</p><br/>\n</div>"}