{"title": "Chapter 668: Another Serious Blood Loss", "id": 668, "volume": 7, "url": "http://boxnovel.org/mmorpg-rebirth-of-the-legendary-guardian-chapter-668-another-serious-blood-loss", "volume_title": "Volume 7", "body": "<h1>Chapter 668: Another Serious Blood Loss</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 668: Another Serious Blood Loss</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>There were a total of 6 sub-dungeons in the Death Abyss Dungeon. Two of the sub-dungeons were 10-player scaled dungeons while the other four sub-dungeons were 5-player dungeons. Each dungeon was similar to the previous dungeons that they had cleared before. There would be Normal Modes, Hard Modes and Hardcore Modes. Players would be required to unlock the next Mode by clearing the previous Mode.</p><br/><p>However, one thing different in this dungeon compared to the others. This Death Abyss is located in the War Canyon. Meanwhile, players would have to go through so many battles in order to be deemed worthy to enter the War Canyon.</p><br/><p>The details were as follow:</p><br/><p>When the number of Level 140 players reaches up to 1,000 in the game server, the Region War in the War Canyon will be unlocked for players to take part in it. A great battle will be held once every 7 in-game days. 5 minutes before the war begins, all players that have reached Level 140 or beyond can sign up for the war. The system will then choose 100 players with the best equipment to enter the Region War zone.</p><br/><p>The rules of the battle - there are no rules! There will only be 100 players from each Region joining the Region War, no more, no less. It is a measure taken to give everyone a fair chance in the war. Players will be allowed to use any items, including their Inheritance Transformation Skills during the great Region War! The main aim of the battle is to kill as many opponents as you can! The duration of the battle is 2 hours.</p><br/><p>What that breaks the rules, even more, was this. When players are dead, their Skills will all be resetted! Players will be able to return back to the battlefield at full power! They can return to the battlefield at their best state!</p><br/><p>2 hours later, the party that manages to kill the most number of enemies shall claim victory over the battle as the Number One winner. When that happens, all players from the winner’s Region will be able to enter the War Canyon to grind their levels. Furthermore, the players from the winner’s Region will also receive an additional of 15% Experience Points. Players who have reached beyond Level 140 will be able to challenge the 6 sub-dungeons of the Death Abyss. They can choose whichever Mode they like --- under the circumstances that the Modes are all unlocked.</p><br/><p>Meanwhile, parties in the second place and third place also have almost similar perks. All players from Regions where the two parties belong to will be able to enter the War Canyon to grind their levels as well. However, these players would only be able to get additional 10% and 5% Experience Points, respectively. Meanwhile, players from the Region of the second place winner will only be able to challenge the Normal Mode and the Hard Mode of the new dungeons. Players from the Region that the party who wins the third place have it a little worse. They could only challenge the Normal Mode of the new dungeons.</p><br/><p>So, how about the rest of the players? Sorry, they will not even be able to even enter the War Canyon at all. They will have to do better next time!</p><br/><p>The new dungeons would all be reset once every 7 days. Therefore, players from every Region would only get one chance at clearing the dungeons before the next Region War!</p><br/><p>Although they were sub-dungeons, every sub dungeon was independent on its own. There were no requirements whatsoever for which sub dungeon to be cleared first before the next. Players could just dive into any one of the sub-dungeons based on their liking. As for the equipment drops, Normal Mode would definitely drop only Yellow-Gold Tier equipment. The Hard Mode would only drop Violet-Platinum Tier equipment while the Hardcore Mode would only drop Mythical Tier equipment!</p><br/><p>For normal players, Yellow-Gold Tier equipment was enough to support them in grinding their levels. Meanwhile, the Violet-Platinum Tier equipment was considered as the standard issue of the equipment the in the current stage of the game. As for the Mythical Tier equipment... well, Zhang Yang and his a gang are now wearing part Ethereal Tier part Mythical Tier equipment, aren’t they?</p><br/><p>Therefore, the dungeon of Death Abyss was something significant to any players from all Regions. Hence, every party in every Region would have to give their best shot in the Region War. Parties that can only get fourth place and so forth would only be watching the others farming good equipment, unable to enter the War Canyon.</p><br/><p>After all, a dungeon could be repeatedly cleared as long as there were players who were willing to do it. One reset would provide players plenty of opportunities for obtaining high Tier equipment in high-leveled dungeons. Whoever who can grab the opportunity would certainly become much more powerful upon obtaining new powerful equipment.</p><br/><p>At the beginning stage of the current situation, only a few players managed to attain Level 140. So there was not much of an effect on the Regions yet. The main contest was in getting the First Clear title for the dungeon’s Death Mode after all. Those sub-dungeons were just 5-player and 10-player scale dungeons. So, the difficulty of the sub-dungeons should not be too difficult for the players. Bringing along players with Inheritance Transformations would really be a game-changing move! They would definitely bring about an absolute effect on their dungeon progression!</p><br/><p>After all, it was true that this dungeon was indeed designed, based on the power level of players with Inheritances. However, players with Inheritances were not the same as players with Inheritance Transformation Skills.</p><br/><p>Truth to be told, the difficulties in each of these sub-dungeons were designed based on the power level of a Class D Inheritance. Meanwhile, a Class D Inheritance could only boost 30% on the Attack of a player. Hence, the difficulty of clearing these sub-dungeons would only be increased by 30%. Although 30% is not a low number, the monsters and bosses in those dungeons would still be bested by players who activate their Inheritance Transformations.</p><br/><p>Therefore, whichever Region that could secure the position of being Champions in the first Region War would definitely be getting the First Clear title for the new dungeon’s Hardcore Mode. So naturally, everyone in the China Region hoped that they would be the one who wins the first Region War! They could not afford to have any margin of error at all!</p><br/><p>Zhang Yang passed the relevant information about the Region War to Han Ying Xue and the rest of his gang. Everyone was very eager to take part in the war, apparently. It had been quite a while since they last battled with players from other Regions.</p><br/><p>However, the War Canyon would only be opened to all servers when there are more than 1,000 Level 140 players in the game. Averagely speaking, every Region should have at least 125 players at Level 140. Although the requirement did not sound high at all, that number would require a certain amount of time to be assembled. As the Number One in the entire China Region, Zhang Yang was only at Level 133, currently. It would require at least two months to attain Level 140, even if he busts his *ss, trying to grind his level up over the period of two months.</p><br/><p>Zhang Yang was not anxious about it at all. Well, things would still be pointless if he is the only one who reaches Level 140 first. Furthermore, the higher his levels go, the farther he'll drift apart from reality. It was a rational fear that tugged at his heart, one that he could not put in words. Well, deep down inside, he was extremely worried that when he reaches Level 179, he would suddenly wake up and realize that he is lying on a bed in a hospital all the while. Would he really end up realizing that his ‘current life’ is all nothing but a fantastical dream?</p><br/><p>Without Felice tagging along by his side while grinding his level, Zhang Yang felt much more bored than usual. However, Zhang Yang has not heard anything from that little lady. Zhang Yang have already visited Gilstein twice. However, the statue was still radiating in a soothing light. There was still no sign of Felice’s voice at all.</p><br/><p>Holding his urge to strike the statue down by force, Zhang Yang decided to wait in patience. Meanwhile, he also decided to camp by the site to grind his level, while waiting for something to happen. Grinding his level anywhere else would still be the same for him anyway.</p><br/><p>About 7 or 8 days later, Zhang Yang suddenly received a call from his secretary. He was lying on his office couch while playing the game. His secretary told him that someone on the line would like to speak to him. After picking up the call, he heard a young voice filled with hatred and resentment, \"Zhang Yang... you’re ruthless! You’re really a ruthless son of the b*tch! I’m not going to let this slide, just like that!\"</p><br/><p>The moment the voice stopped, the person hung up.</p><br/><p>Zhang Yang was unable to make head or tail of the situation. He shrugged and continued on with his game. However, he suddenly recognized the voice over the phone earlier on --- Ma Zhi Hua.</p><br/><p>Zhang Yang did not even want to care about what that was all about. This guy was simply idiotic. Since Sun Xin Yu told Zhang Yang to let her handle it, Zhang Yang would, of course, entrust her with it to the fullest. It seemed that Sun Xin Yu got the issue handled. However, he had no idea what Sun Xin Yu did to rattle the guy so hard that Ma Zhi Hua got so unhinged.</p><br/><p>Truth be told, men were also very curious creatures. At night when they were busy in bed, Zhang Yang could no longer hold his curiosity. So he asked her about it, \"What did you do to your cousin Ma? He seems like he just stepped on a landmine or something. He actually called over to tell me that he will not let this slide. Fill me in a little, will you?\"</p><br/><p>Sun Xin Yu humphed lightly and said, \"I just gathered some intel about his former crimes and passed it to my superior. He got into the jail cell in the police station for a few days because of that! If it wasn’t because of my uncle, I would have cut my ties with him and left him to be destroyed!\"</p><br/><p>Unfortunately, even though Sun Xin Yu was ‘icy cold’, she still felt for her relative. After all, they were kin. If they weren’t from the same family tree, she might have done something far worse than that, based on her temper.</p><br/><p>Han Ying Xue snorted and said, \"You really are ruthless, ice queen. You didn’t even let your own family go! You’re just a witch as much as the wicked ones!\"</p><br/><p>Piak! Piak!</p><br/><p>Suddenly, two smooth hands roughly reached out and clapped over the two busty boobies of Han Ying Xue. Sun Xin Yu smile coldly and said, \"Milk cow, do you believe that I’ll crush them to bits?\"</p><br/><p>Speaking of ‘battles’, even if there were 10 Han Ying Xues, there was no way that they would be able to defeat Sun Xin Yu. She turned her head around and looked at Zhang Yang pitifully.</p><br/><p>\"Ice queen, these two are my private properties! You shall not bully them!\" Zhang Yang pushed Sun Xin Yu down and put himself on top of Sun Xin Yu, \"Not to mention that these two precious babes of yours are mine as well!\"</p><br/><p>The wonderful night was still young. The erotic utterances played together like a symphony throughout the night.</p><br/><p>Zhang Yang waited for another 7 to 8 days. He managed to reach Level 135. However, he had not heard nor seen Felice yet! He began to feel anxious. So, he decided not to wait any longer.</p><br/><p>Wait, a second! Just hold that thought!</p><br/><p>Well, it certainly took a lot of his blood away when Felice was born from the egg.</p><br/><p>Zhang Yang widened his eyes and finished off the monster that was bothering him. Then, he went back to the side of the statue with his Phoenix pet.</p><br/><p>\"It seems that I have to do it once again! This is going to be another serious blood loss!\" Zhang Yang sighed heavily. Then, he took out some [Snack] and placed them on the ground. At the same time, he pulled out his [Sword of Purging Devourer] and slit his left wrist. Blood oozed out from the cut. Zhang Yang quickly put his left hand over by the side of the statue and let his blood flow upon the statue.</p><br/><p>A miracle happened. The statue began to absorb Zhang Yang’s blood like a sponge!</p><br/><p>It was working! It was definitely working!</p><br/><p>Zhang Yang quickly took up a [Snack] and ate it. After all, he was losing his HP as fast as he was losing his blood!</p><br/><p>In tens of seconds, his wound stopped bleeding and the cut recovered. However, the only change on the statue was that it was glowing a little brighter than before.</p><br/><p>This statue surely had a large appetite!</p><br/><p>Recalling back at the older days, it almost sucked him dry, trying to feed his blood to the egg when Felice was still Level 0. Now that she had reached Level 130... well...</p><br/><p>Zhang Yang slit his wrist again with his sword and continued to ‘feed’ his blood to the statue. He could not help but think, if someone sees him doing this, would that someone freak out, seeing the Number One player in the China Region cutting himself in apparent pleasure?</p><br/><p>First bar of HP, second bar of HP, third bar of HP ... Zhang Yang was thankful that he only needed to do this in the game. He could just recover his HP bar by taking some [Snacks] repeatedly. Or else, Zhang Yang would have died countless time by now.</p><br/><p>\"Difficult labor! Definitely a difficult labor! Should have used the cesarean section!\" Zhang Yang sighed heavily. Even though his HP bar could be regained by eating a lot of [Snacks], he also took quite a toll for losing so much blood continuously for so long. His face was so pale that it had turned completely white! He was so dazed that he could even see stars and flowers flying around him.</p><br/><p>The statue glowed brighter and brighter as he fed his blood to it. The light became so strong that Zhang Yang could no longer shield his eyes from the light even after he closed his eyelids. As it grew brighter and brighter, even the trees were not able to block the light from scattering out far into the surroundings. Others could see the bright radiating light from tens of kilometers away!</p><br/><p>Currently, most players have reached Level 120. So they were eligible to be on the same map as Zhang Yang, many players nearby were attracted by the light source. So they came over, on their pets and mounts to take a look at what was going on. One, two, three ... more and more players were gathering around. Even though Zhang Yang had hidden his character information, the Pheonix pet by his side had betrayed his identity to everyone in the surroundings --- there were only two Phoenix pets in the entire server. One was owned by some half-baked fat Hunter that was constantly asking to be beaten up. The other one was owned by the Number One player recognized by the entire world, Zhan Yu!</p><br/><p>So that was Zhan Yu?</p><br/><p>What the f*ck was he up to, cutting himself and splashing his blood on a statue? What did it even mean? Why would he make such a big fuss out of it? Did he overdose on an aphrodisiac and was now trying to make out with a statue? Did he find masturbating no longer fun and he wanted to try releasing the other kind of liquid from his body?</p><br/><p>Even though more and more players were gathering around him, none of them launched any sort of assaults on Zhang Yang. Other than the players from Japan-Korea Region, Zhang Yang had no beef with normal players. Furthermore, the Number One player in the entire world was standing there, doing some weird stuff now! So no one was daring enough to try something on him.</p><br/><p>Just when the situation could not get any weirder, Zhang Yang suddenly felt the statue vibrating with a gentle hum.</p><br/>\n</div>"}