{"title": "Chapter 669: Felice’s Advancement", "id": 669, "volume": 7, "url": "http://boxnovel.org/mmorpg-rebirth-of-the-legendary-guardian-chapter-669-felice%E2%80%99s-advancement", "volume_title": "Volume 7", "body": "<h1>Chapter 669: Felice’s Advancement</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 669: Felice’s Advancement</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Zhang Yang felt a rush of joy up his chest. He continued to let his blood flow on the statue while eating [Snacks] like a joyful madman. He also took a glance at his surroundings once in a while. He did not seem to care about how people looked at him at all.</p><br/><p>If such a facial expression was seen on a normal player, that player would have been surrounded and beaten up for good!</p><br/><p>However, the circumstances were different for Zhang Yang. He was the Number One player in the entire game. He had all right to do that! Those who crossed eyes with Zhang Yang could not even look him straight in his eyes. They either looked at another direction or looked down to their own feet. Well, Zhang Yang looked intimidating just by standing there. So there was nothing to be said about it.</p><br/><p>\"Little Yang, rumors say that you’re masturbating to a statue! You masturbated so much that blood came out instead?\" the voice of Fatty Han squeaked in his ear.</p><br/><p>Zhang Yang frowned intensely after hearing Fatty Han’s stupid words, as usual. Then he asked, \"Who said that?\"</p><br/><p>\"The rumors are all over the place! Some people even opened up a post and discussed it on the forum page! They are discussing about what you’re really up to!\"</p><br/><p>... what are rumors? Any information or news that are added in with some ‘spices’ of their own would definitely be twisted into something it was not meant to be, especially when the rumors had gone through tens of people’s mouths! The ‘taste’ of it would change significantly!</p><br/><p>Oh, my poor reputation!</p><br/><p>Zhang Yang could only mourn for his reputation by shaking his head over and over again. As he continued on with what he was doing, the statue continued to get brighter and brighter. He could vaguely feel that he was almost at the most vital moment. There was no way that he would back down from what he was trying to achieve now! Well, he would not want all his blood to go to waste after all. If he is ever going to be forced to ‘masturbate’ again, surely he would be suffocated to death by the people surrounding him.</p><br/><p>\"Haha! It really is Zhang Yang!\"</p><br/><p>An arrogant voice came by his ear. It was the voice of Liu Wei! Liu Wei came with Death Arbiter and his 12 ‘Suicide Squad’ members. Of course, he wouldn’t have forgotten to bring along his army of Healers as well. He at least brought along 40 to 50 players with him this time.</p><br/><p>They had been occupied with grinding their levels nearby when they heard about Zhang Yang’s ‘masturbation’. So they came over to take a look at what was really going on here. Although there were some discrepancies between the rumors and the real situation, Liu Wei was overwhelmed with joy --- first of all, Zhang Yang was alone here all by himself; secondly, Zhang Yang was obviously doing something he could not afford to stop at that moment!</p><br/><p>Wrecking Zhang Yang’s business was everything that Liu Wei ever wished to do! Now, he was presented with the greatest opportunity of all time. How would he let the chance slip away, then? Without any hesitation, he commanded his men to launch their assaults on Zhang Yang. He wanted to take this super rare opportunity to take out Zhang Yang.</p><br/><p>On the other hand, Zhang Yang was on the verge of success!</p><br/><p>He did not intend give up on it. He continued to release his blood onto the statue. He commanded his Phoenix pet to activate its Transformation Skill just in case. The big bird instantly turned into a 30-meter tall creature with a long tail that turned it into a hundred-meter long blazing bird. The Phoenix pet dove at Death Arbiter and spat a blast of blazing flame straight upon him.</p><br/><p>Although the Phoenix pet was the only one who was engaged in battle, some of the ‘stray bullets’ from the battle still found their way to Zhang Yang. Zhang Yang was forced to engage in battle after he received the damage. The moment when he was engaged in battle, he no longer had the chance to take his [Snacks]. Without getting the support to recover back his HP, Zhang Yang’s HP bar began to drop steeply.</p><br/><p>Liu Wei instantly laughed with joy when he saw that. Then he said, \"Zhang Yang! Does it feel good knowing that you’re going to die and there’s nothing you can do about it?\"</p><br/><p>He led his 12 ‘Suicide Squad’ members and charged at Zhang Yang.</p><br/><p>Just when things got a little messier than expected, the statue suddenly started to tremble more violently with each passing second. A flash of blinding light surged through the entire statue. Right in the middle of the statue’s chest, a white radiating barrier appeared. There was the vague shadow of a girl curled up in the middle of that white radiating barrier.</p><br/><p>Boom!</p><br/><p>The radiating barrier suddenly trembled and exploded violently, sending shards of light to the surroundings. Everyone could not help but shield their eyes from the light.</p><br/><p>When everyone opened their eyes again, they only saw a humanoid lady levitating in midair with her valiant appearance. She was holding a long lance while her black silky hair was floating about naturally even though the air was still --- It was Felice!</p><br/><p>\"Big brother!\" The little lady turned her angry eyes over to Liu Wei. Then she transformed into her Dragonhawk Form and descended down from the air. Not long after she transformed into her Dragonhawk Form, she transformed again into a new form --- the Spectral Tiger Form!</p><br/><p>Upon her transformation, the little lady used some other unknown Skill. Its size changed tremendously! Initially, the Spectral Tiger was only about seven to eight meters long. After breathing in some air, the Spectral Tiger spread out into 30 meters tall and hundreds of meters long! It was almost as large as the transformed Phoenix pet!</p><br/><p>‘-181,478!’</p><br/><p>Felice struck with her claws out and instantly caused over a terrifying damage of 180,000 damage to Liu Wei. She took out about 70% HP of that guy with just one hit! The attack did not end there. Felice struck out again at high speed.</p><br/><p>Switch!</p><br/><p>‘-214,322!’</p><br/><p>In the nick of time, one of the bodyguards that came along with Liu Wei finally did his job. He threw a {Sacrifice} onto Liu Wei and saved Liu Wei at the last moment!</p><br/><p>Although he did a great job on that, the Attack power of Felice was just too terrifying!</p><br/><p>Everyone in the surrounding dropped their jaws when they saw the damage values that popped out on top of Liu Wei and his bodyguard. Even though they were not clear about how powerful was Felice’s Attack power, they could still see how much damage Felice could deal to her foes by looking at the damage values that popped out on top of Liu Wei and his man. Well, the Attack power of Felice was definitely on the same standard as the Attack power of a boss!</p><br/><p>They had no idea that Felice was initially Zhang Yang’s Battle Companion. They only thought that Felice was just a powerful being that just got ‘hatched’ from the statue! Well, it was normal to have that kind of thoughts. Logically speaking, why would a top Tier player like Zhang Yang be bleeding himself out miserably to ‘feed’ a statue then? There must be something worthwhile in doing it!</p><br/><p>Apparently, one could also obtain a powerful Battle Companion by doing such an absurd thing!</p><br/><p>Everyone in the surroundings was beginning to feel an itch in their hearts. After witnessing the might that Felice exhibited, would anyone still be content with their current Battle Companion?</p><br/><p>Zhang Yang laughed out loud. He commanded his Phoenix pet to flap its wings and get going into the sky. Then he leaped onto the back of the Phoenix pet. The moment he mounted himself onto the Phoenix pet, his Maximum HP shot past 6,000,000 HP. Right before he mounted onto his pet, Zhang Yang had only approximately 70,000 HP left because of what he did for the statue back there. However, he got a huge boost in his Maximum HP after mounting himself onto his pet. So all the HP he lost back there became an insignificant factor.</p><br/><p>\"Felice! Let’s work together and take out these bastards!\"</p><br/><p>\"Yes, big brother!\"</p><br/><p>Zhang Yang had a Phoenix pet at his side. Who would dare to stand up against him? The royal-blooded Phoenix fluttered its wings and lunged into the sky. It went straight towards Liu Wei! Upon reaching Liu Wei, the Phoenix pet began to spit fire upon him without any signs of mercy! The flames danced about and caused tens of thousands of damage upon Liu Wei and at least 7 others of his men!</p><br/><p>After all, they were engaged in battle with a fully transformed Phoenix!</p><br/><p>Coincidentally, Liu Wei and his goons had activated their Transformation Skill as they were grinding their levels and taking down bosses not long before they came here. Hence, their Transformation Skills were still under cooldown period. They were all in grave danger right now!</p><br/><p>Felice assessed the situation and transformed into her Humanoid Form. By doing so, her Attack was similarly powerful as the Attack of the Transformed Phoenix. No... her Attack was actually much more powerful than the Attack of the Phoenix! The two of them joined forces and caused a tremendous mess to Liu Wei and his men. With their AoE attacks bombarding Liu Wei and his men, the tactic that Liu Wei loved to implement had lost its effect. His goons could not even save themselves from the blazing attacks thrown at them. How would they still be able to throw {Sacrifice} on Liu Wei to keep him alive, then? In the beginning, they were barely holding on. After a brief moment, his men began to die one after another.</p><br/><p>Players with an Inheritance Transformation had an absolute advantage over players without an Inheritance Transformation. Now, the Phoenix pet and Felice were both transformed. Zhang Yang was a skillful and powerful player all by himself! The three of them brought hell upon Liu Wei and his men.</p><br/><p>As expected, the Number One player in the entire world is not to be trifled with!</p><br/><p>Everyone was amazed to see how Zhang Yang was preying on Liu Wei and his men like how an eagle was picking up little chicks one after another. It did not take long before Zhang Yang took out the entire 50-player scale party of The Myth. Well, now they had really faded into ‘myth’! A large scale party was taken out single-handedly by one player!</p><br/><p>A number of other players went up to the statue and bled themselves as well. They were fantasizing that they could also get a powerful Battle Companion as well by doing what Zhang Yang did awhile before that.</p><br/><p>\"Zhang Yang! You better not be so cocky about this! You’re not going to be so lucky every time!\" Liu Wei left his final soaring words before he was slammed to his death by Felice. He only got to survive so long because he had been so well protected.</p><br/><p>Unfortunately, Zhang Yang could not get a grip on any evidence about Liu Wei’s crime in real life just yet. Even though Liu Wei had done quite a number of terrible things back then, it was almost impossible to get a hold over any solid evidence about all his crimes. Back in the day, he actually attempted to get a beautiful girl in his secondary school. After he was rejected by the girl, he raped the girl. However, he was from a very rich family. Everything was ‘settled’ with money. The girl and her family left the city and disappeared into the wind. It would require time to locate their whereabouts. Furthermore, it would also be another big question if the victim would be willing to step up and testify against Liu Wei.</p><br/><p>Back in his University days, Liu Wei was not behaving well at all. Rumors had that he killed a few people back then and got everything ‘settled’ with money as well. The family members of the victims were compensated with a substantial amount of money. They also left their initial places and vanished into the wind. So, it would be extremely difficult to look them up one by one.</p><br/><p>Therefore, it would still be impossible for Zhang Yang to checkmate Liu Wei with one solid move. However, Zhang Yang had hired several extra private investigators to dig deeper into the matter. He would not be worrying about money anymore because he got rich good time! Furthermore, getting rid of Liu Wei with hard solid evidence would be the best thing he needed to make his life complete.</p><br/><p>Felice had returned to him. There was no reason left for Zhang Yang to stay at the site. So, he hopped onto the back of his Phoenix pet and left the place, leaving behind tons of players who just witnessed his battle with The Myth. Those players were idiotically trying to do what he did, cutting their wrist and trying to ‘feed’ the statue with their blood. Thousands of players cutting themselves in the public ... was a spectacular scene to gaze upon...</p><br/><p>Zhang Yang turned his attention towards Felice. He was extremely surprised to see that Felice went through a Level Advancement!</p><br/><p>[Felice] (Humanoid)</p><br/><p>Level: 133</p><br/><p>HP: 599,920 (With Vitality Aura)</p><br/><p>Defense: 8,870</p><br/><p>Melee Attack: 64,714 - 84,714 (Attack Interval: 3.8 seconds)</p><br/><p>Skills:</p><br/><p>[Blazing Dragon's Spear], [Dragon's Spear Barrage], [Dragonhawk Form]</p><br/><p>[Spectral Tiger Form]: Transforms into a Spectral Tiger. While in the form of the Spectral Tiger, Felice can use a new set of Skills of the Spectral Tiger. However, she will not be able to use the Skills that she can use in her Humanoid form.</p><br/><p>Special: {Seal 2}{Seal 3}{Seal 4}</p><br/><p>Note: Player Zhan Yu’s Battle Companion.</p><br/><p>[Felice] (Spectral Tiger Form)</p><br/><p>Level: 133</p><br/><p>HP: 451,980 (With Vitality Aura)</p><br/><p>Defense: 1,850</p><br/><p>Magic Resistance: 8,870</p><br/><p>Melee Attack: 64,714 - 84,714 (Based on Physical Attack, however, deal Nature Damage) (Attack Interval: 3.8 seconds)</p><br/><p>Skills:</p><br/><p>[Claw Attack]: Attacks the target with a beastly claw. Deals 150% Melee Attack of Nature Damage. Consume: 50 Focus Points.</p><br/><p>[Spectral Tiger Berserk]: Enters into a berserk state. The body will expand in size. Maximum HP will increase by 20 times. Attack will increase by 300%. Defense will increase by 300%. Magic Resistance will increase by 300%. While in the berserk state, Felice will gain 1 Berserk Energy Point in every 10 seconds. Duration: 2 hours. Cooldown: 72 hours. Note: Upon activating the {Spectral Tiger Berserk}, the {Dragonhawk Berserk} will also enter the same cooldown state.</p><br/><p>[Frenzy Talon Strike]: Reach out her claws and attack the target with a series of flurry attacks, causing 100% Melee Attack of Nature Damage to all targets within the range of 50 meters. Consume: 3 Berserk Energy Point.</p><br/><p>[Berserk Recovery]: Immediately recovers HP. Requires 10 Berserk Energy Points to activate. Basic amount of HP recovery is set as 50% HP. Each additional Berserk Energy Point can increase additional 5% HP. Cooldown: 30 minutes.</p><br/><p>So that was the reason why that little ladies could perform with such ferocity. Zhang Yang had suspected it to be something similar to a Transformation Skill. He was right after all!</p><br/><p>However, what was {Dragonhawk Berserk}?</p><br/><p>Zhang Yang looked further down on Felice’s attributes.</p><br/><p>[Felice] (Dragonhawk Form)</p><br/><p>Level: 133</p><br/><p>HP: 376,650 (With Vitality Aura)</p><br/><p>Defense: 1,850</p><br/><p>Magic Resistance: 8,870</p><br/><p>Magic Attack: 38,884 - 48,884</p><br/><p>Skills:</p><br/><p>[Pulverizing Flame]: Spit blazing flames from the sky upon an area of 30 X 30 circular area, causing 50% Magic Attack of Fire Damage to all targets within the effective area of the Skill in every second. Last for 10 seconds. Require aiming. Cooldown: 30 seconds. Consume: 100 Focus Points.</p><br/><p>[Fire Missile]: launch a Fire Missile at a target, causing 200% Magic Attack of Fire Damage to the target. Chanting time: 2 seconds. ConsumeL 20 Focus Points.</p><br/><p>[Dragonhawk Berserk]: Enters into a berserk state. The body will expand in size. Maximum HP will increase by 20 times. Attack will increase by 300%. Defense will increase by 300%. Magic Resistance will increase by 300%. While in the berserk state, Felice will gain 1 Berserk Energy Point in every 10 seconds. Duration: 2 hours. Cooldown: 72 hours. Note: Upon activating the {Spectral Tiger Berserk}, the {Dragonhawk Berserk} will also enter the same cooldown state.</p><br/><p>[Berserk Recovery]: Immediately recovers HP. Requires 10 Berserk Energy Points to activate. Basic amount of HP recovery is set as 50% HP. Each additional Berserk Energy Point can increase an additional 5% HP. Cooldown: 30 minutes.</p><br/><p>Addition: Have the ability to fly.</p><br/>\n</div>"}