{"title": "Chapter 663: Death Moon Pirates", "id": 663, "volume": 7, "url": "http://boxnovel.org/mmorpg-rebirth-of-the-legendary-guardian-chapter-663-death-moon-pirates", "volume_title": "Volume 7", "body": "<h1>Chapter 663: Death Moon Pirates</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 663: Death Moon Pirates</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Zhang Yang dragged the hostess out of the room and gave her a name card. He had even pulled out his own name card and wrote a short message on it. \"Take this, and if you want to find another job that pays well, try it. Someone will find and take care of you.\"</p><br/><p>She had been unfortunately caught in the crossfire when Zhang Yang and Liu Wei was going on. Liu Wei had slapped her in the face just because he could not hold his anger in.</p><br/><p>Zhang Yang patted the hostess’ bare shoulders and bade her good luck before storming out of the establishment with rage. The girl teared up a little and followed him closely.</p><br/><p>Although the tea shop was not established on the premise of prostitution, it was extremely hard for the hostesses to reject despicable customers when they are up to no good. Once, a hostess retaliated by running out of the room, only to be eventually caught by a few men and gang-raped for the entire night. The next day, the girl was found floating on the rivers, killed and thrown away after they were done having their fun.</p><br/><p>It was customers like Ma Zhi Hua and Liu Wei who were the hooligans of the establishment. They were the kind that would act on a whim. Killing and raping were things they were not afraid of committing, since someone will always clean it up for them. The girl followed Zhang Yang out of the establishment and did not even bother to collect her belongings. She met Zhang Yang back in the streets and bade him farewell before running away towards the sidewalks. Perhaps she had thrown in her resignation letter on the spot and planned to pay a visit to Zhang Yang’s company for a change. She was familiar with Silky Soft Holdings’ product because she was using them herself. She believed that if someone like Zhang Yang, who stood up to protect her when she was in need of help, would not betray her expectations.</p><br/><p>…</p><br/><p>Zhang Yang nodded at the hostess and after she ran off somewhere, he called Sun Xin Yu. Although he did not plan to put much attention on that incident, it was still best to have Sun Xin Yu know about Ma Zhi Yu. The woman was smart. When Zhang Yang had merely asked about who Ma Zhi Yu was, Sun Xin Yu quickly instigated a Q&amp;A session with Zhang Yang.</p><br/><p>After everything had been told about the incident, Sun Xin Yu fumed with rage and asked Zhang Yang not to get involved with the bastard. She would handle everything easily. Zhang Yang blew a kiss to her, only to have her hang up on him.</p><br/><p>Zhang Yang was picked up by Mr. Lin’s car, so he had to hail a cab when he returns. During the trip back home, Zhang Yang received a stranger’s phone call. When he picked it up, it was Mr. Lin. He begs for forgiveness from Zhang Yang for he had not known of the context of the meeting, nor how would the man would behave. Although he did not directly ask for it, Mr. Lin subtly wanted to be on Zhang Yang’s good side. Naturally, Zhang Yang did not blame the man for his invitation to the f*cked up tea party. He told Mr. Lin that he was fine and he bore no enmity towards him.</p><br/><p>From Mr. Lin perspectives, Ma Zhi Hua was just a branch family of the Sun family. Zhang Yang, on the other hand, was the future of the Sun family. Such an important role was crucial to determine in order to recognize the real potential. Perhaps, Ma Zhi Hua was the only imbecile who did not know the polarity in his position.</p><br/><p>Zhang Yang would not want to stir up problems from thin air. After conversing with Mr. Lin for a brief moment, he hung up the call after Mr. Lin was satisfied with Zhang Yang’s reaction.</p><br/><p>Zhang Yang returned to the office. Although he was a little restless, Zhang Yang decided to log into the game and do a little quests.</p><br/><p>When Zhang Yang appeared in the game, he was flying in midair above the waters. The place he needed to go was underwater and since the Phoenix was a fire elemental bird, it could not dive underwater. Zhang Yang switched to the Mythical Turtle and dove. Zhang Yang had no choice. The Mythical Turtle was the only underwater mount he had at the moment. It was weaker, now since Zhang Yang had removed most of the skills on it and applied it to the Thunderhawk. However, at that level, a Mythical tier mount could not do much damage, even if he had more or less skills on hand.</p><br/><p>Zhang Yang dove deeper and deeper until the light above the surface slowly faded away. Deep under the sea, there was absolutely no light around, the only light source that could illuminate nearby environment was coming from Zhang Yang’s own armor. It was cold and terrifying, for no one knows when will something pop out in the dark.</p><br/><p>Half an hour later, Zhang Yang saw a bright area, in an area far ahead. As Zhang Yang swam further, the light grew wider and large. The illuminated area were the ruins of an enormous palace. Each of the fallen pillars was glowing with a soft warm light. From afar, the light emitted from the pillars around the palace made it look like a beacon in the dark night.</p><br/><p>There were only a few of the pillars that were still in good shape. The rest were in pieces, albeit still glowing with the white light. Almost the rest of the palace was in ruins. Not a single construction was left in good shape. Cracks and holes were everywhere.</p><br/><p>According to the quest’s lore, the palace was originally from above land. Back then, the King of the palace had wronged a powerful magician. As retribution, the magician uprooted the entire palace and tossed it into the oceans. While the humans that once lived in the palace were all dead, the palace was now occupied by merfolk and they treated it as their paradise. There were countless numbers of merfolk that were roaming around the palace as they kept on making weird \"gua gua gua\" noises.</p><br/><p>Zhang Yang frowned. Where was Dolmian? Zhang Yang looked everywhere and could not find an NPC that looked like a boss. He swam closer towards the palace and arrived at a large hall. In a normal situation, the boss should be in the biggest, brightest structure. It was expected. For the boss was the leader.</p><br/><p>Zhang Yang approached the hall and angered two merfolk who were clad in armor and clutching pitchforks.</p><br/><p>[Death Moon Merfolk] (Elite, Humanoid)</p><br/><p>Level: 135</p><br/><p>HP: 2,700,000</p><br/><p>Melee Attack: 19,298 – 23,298</p><br/><p>Skills:</p><br/><p>[Heavy Pierce]: Pierces the target, ignores all Defense and deals 100% melee physical attack.</p><br/><p>[Call]: When in danger, the merfolk will call for nearby allies to aid it in battle.</p><br/><p>Note: Death Moon Pirates are the most brutal and cunning pirates in the Xixiluca Sea. Each of their members are fierce and strong for the blood of greed and grandiose flows within their veins.</p><br/><p>\"Hehehehe! We have fresh meat to feast on, today!\" cried one of the merfolk there and he hurled his pitchfork towards Zhang Yang.</p><br/><p>Zhang Yang lifted his shield and parried the attack. Two elite tier monsters were nothing to Zhang Yang. However, the skill {Heavy Pierce} was a little troublesome, for it is able to even ignore the godly defenses of his armor. Perhaps, there is a possibility of the attack being a Piercing type, which means that players standing behind the target would still receive the same amount of damage.</p><br/><p>Still, they were nothing more than just elite tier. Zhang Yang had only lost a little over than 200,000 HP after killing them both. Since the environment does not allow for consumption of snacks, Zhang Yang only means of healing was potions and items. However, potions have cooldowns. Zhang Yang could only consume one bottle every minute. Luckily, the potions were handcrafted by Zhang Yang. Hence, all of the potions that Zhang Yang carries with him all the time were top tier Transmuted grades. If the potions are not enough, Zhang Yang could easily use the [Bandages] to heal himself quickly and easily.</p><br/><p>After several more kills, one of the merfolk had even miraculously dropped an equipment for him.</p><br/><p>[Merfolk’s Armor] (Violet-Platinum, Leather Armor)</p><br/><p>Defense: +48</p><br/><p>Vitality: +917</p><br/><p>Strength: +262</p><br/><p>Dexterity: +591</p><br/><p>Equip: Increases maximum HP by 1,830.</p><br/><p>Equip: Increases damage dealt and healing rate by 2.1%</p><br/><p>Equip: Increases movement speed underwater by 7%</p><br/><p>{Unidentified}</p><br/><p>Level Requirement: 130</p><br/><p>Merfolk Wonderer Set Effect: Merfolk Helm, Merfolk Armor, Merfolk Pants</p><br/><p>Three Set Equipped: Increases movement speed underwater by 30%.</p><br/><p>Increased underwater movement speed? Funny. However useful it may be, it was only temporary. Players usually avoid underwater battle hence the set equipment was not worth much. Zhang Yang tossed it aside in the corner of his inventory. If its value is too low, he would then give it to Han Ying Xue to break down into Rune Stones.</p><br/><p>Zhang Yang proceeded towards the palace entrance and spotted four merfolk standing guard at the gates. To enter the palace, he must first defeat the four of them.</p><br/><p>\"Hey! Stinky piece of rotten fish! Come and get some!\" Zhang Yang tossed a {Spear of Obliteration} and hit one of them, successfully provoking all four of them.</p><br/><p>With Felice and the Phoenix out of the battle, Zhang Yang’s killing speed was greatly delayed. Although the Mythical Turtle was the best mount when it first debuted, but right now, it was nothing but a little speck of dust that could provide little to no help at all. Especially, when the enemies where high level monsters in high quantities. Killing and tanking are different cases. In his case, Zhang Yang was tanking and killing at the same time. It was extremely hard to move around, since his movement speed was restricted underwater. Supporting Attacks were also pretty useless, due to the dense water around them. Hence, at Zhang Yang was losing more HP than the monsters were.</p><br/><p>Fortunately, Zhang Yang was able to defeat all four of them after losing close to 70% of his HP. As he progressed on, the number of monsters in one pack had increased. Since Zhang Yang could not rely on snacks to recover his HP, Zhang Yang would have to stop after each battle to restore his health. It was an extremely inefficient process. When he finally lost patience, Zhang Yang decided to summon Han Ying Xue over and have her help with his quest.</p><br/><p>\"Hm? Where is your little lover?\"</p><br/><p>\"Huh?!\" Zhang Yang was extremely surprised at her random jab.</p><br/><p>\"Felice. The little Felice!\"</p><br/><p>Zhang Yang sighed. The woman was even jealous of a fictional character. \"Well… I can’t really explain what happened to her, but I can’t call her out for a few days.\"</p><br/><p>\"Haha! Finally, we can have some alone time without that little duck following you around!\"</p><br/><p>With Han Ying Xue supporting Zhang Yang, he was able to take on 20 to 30 monsters at the same time, without breaking a sweat. Not only had she increased his durability on the battle field – or battle waters in this case, she had also helped save a lot of time for Zhang Yang.</p><br/><p>4 to 5 hours later, the two of them made it to the center of the palace. Sitting on the huge throne, was the boss that Zhang Yang had to kill.</p><br/><p>[Dolmian, Death Moon Pirate Captain] (Mythical, Humanoid)</p><br/><p>Level: 140</p><br/><p>HP: 42,000,000</p><br/><p>Defense: 5,920</p><br/><p>Melee Attack: 37,150 – 47,150</p><br/><p>Skills:</p><br/><p>[Heavy Pierce]: Thrusts the spear with penetrative power. Ignores all defense and deals 150% melee physical attack.</p><br/><p>[Spearing Barrage]: Hurls countless of spears to all directions within 20 meters of the caster. Deals 100% melee physical attack to all targets within the skill range.</p><br/><p>Note: The Captain of the Death Moon Pirates. The source of evil in all of Xixiluca Sea.</p><br/><p>\"Hah. It’s just a Mythical tier boss. Both of us can take it easily!\" Zhang Yang gently tapped the head of the Mythical tier Turtle and swam towards the boss. Right then, a Mythical tier boss’ attack will be diminished to a safe point by his powerful defense. Though they may need to hold on for a long time, they could easily kill the boss, as long as it did not have any healing skills.</p><br/><p>\"Intruders…\" Dolmian rose from his seat and thrust his right arm out. A long, Golden Platinum Trident materialized in his hands. With a powerful growl, Dolmian create a forceful wave that slightly pushed Zhang Yang away. He brandished his trident and created a whirlpool that charged towards Zhang Yang.</p><br/><p>With a wide grin, Zhang Yang bellowed, \"Time for a pirate to have a taste of their own medicine, eh?! I’ve come to rob you!\"</p><br/>\n</div>"}