{"title": "Chapter 694: Andros’s Wrath", "id": 694, "volume": 7, "url": "http://boxnovel.org/mmorpg-rebirth-of-the-legendary-guardian-chapter-694-andros%E2%80%99s-wrath", "volume_title": "Volume 7", "body": "<h1>Chapter 694: Andros’s Wrath</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 694: Andros’s Wrath</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>\"Wah! You stinky eight-legged freak! Let go of me, now!\" Wei Yan Er began to scream like a little b*tch. She repeatedly tried to break the spider strings with her battle axe. However, Conross was a green named monster. Zhang Yang and the ladies had obviously triggered some sort of drama mode. No matter how hard Wei Yan Er tried, she could not do anything about the webs wrapping around her.</p><br/><p>\"You're the believers of the temple?\" Canross found a piece of green marking on Zhang Yang. He took it down to have a closer look. Those were the markings that were given to Zhang Yang and the ladies by the Priest of their Temple when Zhang Yang and the ladies had worked their Reputation up to 'Revered'. Canross threw the marking back to Zhang Yang and wiggled his butt a little. The webs wrapping around them loosened up and they were able to move freely again. Wei Yan Er immediately stopped cursing like a little b*tch. Now, she stared forward with her eyes wide open as if she had just seen some treasure.</p><br/><p>Zhang Yang nodded and said, \"We have an urgent matter that needs Andros's attention!\"</p><br/><p>\"Human, not anyone can meet our fatherly god, not even our own kind. So what makes you think you have what it takes to meet out father of god?\" Canross backed away to a large spider web and sat on it. However, his eyes were fixed on Zhang Yang and the ladies. It was obvious that he was not willing to let them enter the palace.</p><br/><p>Zhang Yang revealed a serious look and said, \"We received a command from Catarina to pass on her last words to Andros!\"</p><br/><p>\"Catarina? The banished Princess?\" Canross widened his eyes. He seemed shocked. \"She… she died?\"</p><br/><p>Zhang Yang nodded and said, \"Unfortunately, yes. She has some important words that needs to be passed to Andros. And she insisted that we must be the one who speak to him. So we must personally meet Andros to do so!\"</p><br/><p>Canross began to go into deep thoughts. After quite some time, he finally returned from his drifting thoughts and said, \"Catarina... Although she was fatherly god's daughter, she was born late. I was the one who watched her grow! She used to be a naive and good-hearted little girl. But I have no idea when or why. She suddenly changed! She changed so much that she seemed to turn into another person! And now… I can't believe that she passed away!\"</p><br/><p>Canross walked around the spider web for a while before he said, \"Alright, follow me!\"</p><br/><p>This gigantic human-faced spider began to lead Zhang Yang and the ladies into the palace. Though the palace in the sky was large and vast, there were very few 'residents' in the palace. There were also no signs of any maids in the surroundings. Only a few human-faced spiders were scattered around in the corners of the palace with the titles 'Sons of Andros' right on top of their heads.</p><br/><p>This father of god had been really good at producing his offspring. He had a large number of sons and daughters.</p><br/><p>Obviously, Canross had quite a reputable status in the palace. As he was passing by the hall of the palace, the sons and daughters of Andros were nodding at him, expressing their respects towards him. They were also looking at Zhang Yang and the ladies with curiosity filling up their eyes.</p><br/><p>After walking through the halls for quite some time, they finally arrived before a large palace. However, even though the building was magically hanging in the middle of the sky, but the designs on the walls and the ceilings were simple and there was nothing fancy about them at all. Instead of looking like a palace, the entire place looked more like a larger than average temple.</p><br/><p>Upon stepping foot into the palace, Zhang Yang and the ladies saw a gigantic human-faced spider resting right in the middle of the hall. If Canross is described as the size of a small mountain, then this spider could be described as a gigantic spider of the size of a middle-sized mountain! He was extremely huge!</p><br/><p>[Andros, Spider God] (Celestial, Humanoid)</p><br/><p>Level: ???</p><br/><p>HP: ???</p><br/><p>Note: The ancestor of the Spider Men! He served the God of Light before time. He has the divine power of a god!</p><br/><p>\"What a huge spider!\" Wei Yan Er began to mutter on her own. Then she whispered, \"It'll definitely be awesome if I can make this spider my pet.\"</p><br/><p>This little brat would usually come up with some weird notions, as usual.</p><br/><p>\"My great father of god, these humans claimed that they have Catarina's last words for you!\" Canross lowered down his frontmost four legs to bow at Andros. Then he spoke politely to Andros about the situation.</p><br/><p>\"Catarina… had passed away!?\" A fierce sense of fury flashed across Andros's indecipherable eyes like a lightning flashing across the sky. It gave Zhang Yang and the ladies a chill up their spines. This Celestial Tier boss fixed his eyes upon Zhang Yang and the ladies. Then he asked, \"Outsiders, my daughter… did she… pass away?\"</p><br/><p>\"Unfortunately, yes. My great Spider God.\" Zhang Yang stayed silenced a while. Then he made a polite gesture of an Adventurer and passed the dying words of Catarina over to Andros.</p><br/><p>\"What!?\" Andris was infuriated that he stood up straight away, \"That god damn demon! How dare he manipulate my Catarina! My poor daughter… May the God of Light shine on us all… What have I done… When Catarina needed me the most, I thought … I banished her with my own bare hands! I thought she changed! She was possessed!?\"</p><br/><p>Unfortunately, this Celestial Tier boss only had the capability of a Celestial Tier boss should have. He was not a real God who would be all-knowing.</p><br/><p>\"Thank you, young Adventurers, hailing from a distant land!\" After all, Andros had lived so long that maybe he himself had lost track of it. He calmed himself down right after he took his own brief moment to grief. Then he said, \"Thank you for traveling across the distant land to pass me the news. You have enlightened me. I now realize my own fault as a father. I have doomed my own daughter!\"</p><br/><p>'Ding! You have completed a quest: Super Urgent News! You have received a reward: 5,000,000 Experience Points!'</p><br/><p>Though the amount of Experience Points rewarded was not bad, it was not enough to cover the time and effort that they had spent to raise their Reputation!</p><br/><p>Andros reached out with one of his long legs and touched the air right in front of him. Then he muttered vaguely in his mouth as if he was casting some spell. Countless white lights were projected out from the tip of his leg and formed a light screen in front of him The light screen revealed a dark red demon with two horns on his head and a pair of bat-wings right behind its back, sitting on an altar, roaring into the sky.</p><br/><p>\"Pauillac The Manipulator!\" Andros suddenly roared out into the sky in rage. The light screen trembled and shattered into pieces.</p><br/><p>\"My father of god, please stay calm!\" Canross immediately bowed down and said.</p><br/><p>Phew! Phew!</p><br/><p>Andros began to gasp for air as if he was out of breath. It seemed that he was too old to even get angry! Then he looked at Zhang Yang and the ladies, \"Adventurers, I've expended some of my divine power and I have identified the murderer that took my Catarina's life! However, I must stay here to keep my kingdom safe. So I cannot leave. I beg of you. Please, slay this demon for me!\"</p><br/><p>'Ding! Andros has given you a quest: Andros's Wrath. Do you accept?'</p><br/><p>The 5 of them looked at each other and quickly accepted the quest.</p><br/><p>\"Take this with you ---\" Andros gave Zhang Yang a jade order, \"This Jade pendant has a part of my power sealed inside. Use it when you are confronting Pauillac The Manipulator! Even though I can't go, I will never let this demon go!\"</p><br/><p>'Ding! You have received an item: Andros's Jade Pendant.'</p><br/><p>[Andros's Jade Pendant] (Consumable)</p><br/><p>Use: Summon a shadow clone of Andros. It will help you attack Pauillac The Manipulator! You can only use it when you're within the distance of 50 meters away from Pauillac The Manipulator.</p><br/><p>Afterwards, Andros rested his face behind two sorrowful talons and asked Zhang Yang and the ladies to leave the palace at once. The word 'asked' was to show his courtesy, he basically 'chased' Zhang Yang and the ladies away from his palace. However, it was understandable. The man had just lost his precious daughter. How would he be happy after everything that he had been through?</p><br/><p>Zhang Yang brought up the quest list and took a good look at the quest description.</p><br/><p>[Andros's Wrath] (Difficulty: Rank-A)</p><br/><p>Description: Andros wants you to eliminate Pauillac The Manipulator to avenge his daughter. You can find Pauillac The Manipulator at the Dark Mist Canyon, within the map - Forest of Clouds. Take note, the demon will not go down easily. You better bring more friends before you go!</p><br/><p>Completion: Slay Pauillac The Manipulator 0/1</p><br/><p>\"Silly Yu, this quest is only ranked as Rank-A. Could the boss only be an Ethereal Tier?\" Han Ying Xue asked. If that is the case, then they would have no reason to travel so far just to get the quest done!</p><br/><p>Zhang Yang shook his head and said, \"Well, this quest is ranked as Rank-A instead of Rank-S, because we got this quest item!\" He took out [Andros's Jade Pendant] and showed it to the ladies, This piece of jade could summon the shadow clone of that Celestial Tier boss! The boss would not be that weak. With the power of a Celestial Tier boss on their side, the difficulty of the quest would definitely plummet.</p><br/><p>The five of them teleported back to Souron's Castle with their scrolls. Then, they traveled from Souron's Castle over to the Forest of Clouds. The main reason that they did not fly to their destination was because the map of Spider Kingdom was just plain f*cking annoying. The sky was filled with spider webs that would slow them down so much that they would be able to walk faster than to fly in the sky! Furthermore, getting entangled in the spider webs was not a pleasant experience at all!</p><br/><p>Level 150 maps were just large. It took Zhang Yang and the ladies approximately 3 hours to fly out of the Mar Gaia Forest. After that, they needed to pass through The Plagued Land as well. That took them another 7 hours before they finally entered the Forest of Clouds.</p><br/><p>The Forest of Clouds was as its name suggested. Every part of the forest was green and lush. Meanwhile, right above the forest, mist clouded the sky. The mists looked like countless clouds shielding the forest from above. Travelling in the forest would cause poor visibility. Basically, players could not see anything that is further than 10 meters from them.</p><br/><p>Meanwhile, the movement speed of the Flying Mounts was extremely fast. When you realize that you are about to crash into something, it would have been too late. No brakes are that good.</p><br/><p>Fortunately, Zhang Yang and the ladies had guidance from their small maps. So they were not worried about going towards the wrong direction. However, they would have to encounter some monsters along their journey. Sometimes, they would even run into a flock of bird monsters and start a huge battle. However, most of the monsters in each large map were only Normal Tier monsters. The monsters were destined to be slain the moment they ran into Zhang Yang and the ladies. It did not take long before Zhang Yang and the ladies wiped out the entire flock of bird monsters.</p><br/><p>Because they had a specific destination, Zhang Yang and the ladies did not stop until they arrived at the Dark Mist Canyon.</p><br/><p>However, the canyon seemed even more f*cked up. The dark mist was so thick that the entire canyon looked like it was flooded with black ink! The moment when they stepped into the black mist, they could not even see their own fingers! Even the small maps were blacked out. There was no way that they could proceed forward like that. The only visible area of the canyon was the area 3 meters from the ground. Flying higher than 3 meters would mean zero visibility for them. To avoid crashing into walls, Zhang Yang and the ladies descended to the ground and went on foot.</p><br/><p>From that point of view, the reason why the system gave players Flying Mounts was because players could travel faster that way. They did not provide players with Flying Mounts so that they could avoid battling monsters, just because they are lazy.</p><br/><p>\"I can smell the delicious blood flowing in your body!\" A huge shadow emerged from the dark mist. Because the body parts above the shoulders were covered in the dark mists, Zhang Yang and the ladies had no idea how tall the monster was. They could not see what the monster looked like as well. However, they could clearly see that there were large fish-scales covering the monster's entire body. The muscles on the monster's body were bulgy as f*ck. They looked like freaking metal rocks! There were also 7 sharp barbs right on its back. The demon also had a long tail that looked like the tail of a scorpion. It was moving around as if it was a snake.</p><br/><p>[Dark Mist Divine Punisher] (Elite, Demon)</p><br/><p>Level: 164</p><br/><p>HP: 4,920,000</p><br/><p>Defence: 6,640</p><br/><p>Melee Attack: 42,966 – 52,966</p><br/><p>Skills:</p><br/><p>[Tail Sting]: Uses a tail filled with poison to sting a target, causing 100% Melee Attack of Shadow Damage to the target. The target's Attack will be reduced by 10%. Last for 15 seconds.</p><br/><p>[Flying Bone Puncture]: Uses the bones in the back to shoot the target, causing 100% Melee Attack of Shadow Damage to the target. If the target is hit while poisoned, the target will receive another additional 50% damage.</p><br/><p>[Dragon's Flame]: Spits a blast of flames forward, causing 20,000 Fire Damage to all targets within the effective range of the Skill once in every 3 seconds.</p><br/><p>The monster reached out at Wei Yan Er and began attacking her with its claws, right after it appeared. With one aggressive slash straight across the body of the little brat, she received a total damage of 40,000 in an instant. The little brat was shocked, and she began to jump around in panic. Then she screamed at Zhang Yang, \"Noob tank! Lure the monster to you! Now!\"</p><br/><p>Currently, Elite Tier monsters were getting outrageously powerful. Their basic attacks had reached up to 40,000 damage! Normal players could be instantly killed with one or two hits from them!</p><br/>\n</div>"}