{"title": "Chapter 691: Spider Kingdom", "id": 691, "volume": 7, "url": "http://boxnovel.org/mmorpg-rebirth-of-the-legendary-guardian-chapter-691-spider-kingdom", "volume_title": "Volume 7", "body": "<h1>Chapter 691: Spider Kingdom</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 691: Spider Kingdom</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>However, it would be pointless to be in fear all the time. Zhang Yang had never underestimated his opponents. He would not fear them either just because they were powerful as well. On the contrary, Zhang Yang had enough confidence that he would be able to triumph over his opponents, as long as his opponents were of equal level and equipment.</p><br/><p>Furthermore, his current level and equipment Tier were the best in the entire world now. He also had an extremely powerful Battle Companion, Felice, and a Legendary Tier pet mount! Who could best his current attributes now?</p><br/><p>Upon reaching Level 150, Zhang Yang had another new Skill Point to add to his {Shadow Clone}. With the new upgrade, he could now summon up to 6 Shadow Clones at the same time. Once he activates his {Shadow Clone}, 7 Zhang Yang would become a threatening existence that would send anyone trembling in fear!</p><br/><p>After switching to his Demon Slayer's Ring and Dark Star Shield, Zhang Yang's Attack power did not increase much. However, his HP and Defence had increased immensely!</p><br/><p>[Player: Zhan Yu]</p><br/><p>Level: 150</p><br/><p>HP: 779,420 (With Vitality Aura)</p><br/><p>Defense: 14,890</p><br/><p>Attack: 81,479 – 101,719 ((32205-40205) *253%)</p><br/><p>Damage Absorption: 10,606</p><br/><p>Critical Rate: 21%</p><br/><p>Lucky Strike Rate: 2.9%</p><br/><p>Currently, the Physical Attack on a player or a monster must reach over 28,147 in order to penetrate that thick Defence of Zhang Yang. On the other hand, the Magic Attack of a player or a monster must reach at least 13,257 in order to cause effective damage. These attributes did not even include his {God of War Transformation} yet. If he had another 20% damage immunity, his attributes would be even more terrifying.</p><br/><p>Felice and Phoenix pet had also hit Level 150 and had their 'equipment' upgraded automatically. However, because it was just like upgrading a Level 140 Ethereal equipment to a Level 150 Ethereal equipment, his improvement did not even exceed 10%. Hence, it was much more normal in that sense.</p><br/><p>After farming monsters for another couple of days, Sun Xin Yu, Han Ying Xue, and Wei Yan Er finally hit the level cap of Level 150. The party no longer had any reason to stay in the Mar Gaia Forest. Instead, they made way to Spider kingdom to finally complete the quest that had been sitting in their quest list for over a year.</p><br/><p>The Spider Kingdom was just as its name sounded like. Not long after they set foot on the map, they could see spider webs blanketing every corner of the mountains. There were black, grey, flowery, big, small, gigantic spiders all over the place. Wei Yan Er and the ladies were very disgusted by the scenery.</p><br/><p>Though the map's main theme centered around 'Spider', there were also other sorts of beings in the surroundings. There was also a substantial amount of wild boars and gigantic bats roaming in the forest. These monsters were acting as the predators hunting on the little spiders. However, if they ever meet giant spiders that were much larger than them, they would become the prey instead, being hunted by the gigantic spiders.</p><br/><p>These spiders did not just weave their webs across the ground, in between the forest and in between the valleys. They were also all over the sky! Furthermore, the webs in the sky were actually more than the webs in the surroundings on the ground. The moment when a pet mount touches these webs, they would be paralyzed for over half a minute.</p><br/><p>Therefore, the party decided to take the route on the ground. Though they had encountered a large number of spiders, it only took them approximately 1 second to kill each of the spiders. Hence, the spiders did not slow them down at all.</p><br/><p>After progressing onwards for about half an hour, the party had entered a thick forest. There, they finally managed to see humanoid beings in the area.</p><br/><p>The place could still be considered as a village, albeit an unconvincing one. However, the design of the buildings did not belong to humans, elves or orcs, or even dwarfs. The buildings were actually formed from layers of spider webs. Many Spider Men were crawling on the spider webs on their eight legs. Their butts were attached to strings of spider web thread. Some of the spider web threads were ended with a beast tied up, while some ended up with just items and belongings. The scenery looked amazing.</p><br/><p>Spider Man!</p><br/><p>[Burrow Forest Spider Man] (Normal, Humanoid)</p><br/><p>Level 155</p><br/><p>HP: 98,160</p><br/><p>The unique thing about this was that these spiders with human faces were all green-named monsters. They did not automatically attack players who approached them. Instead, they would provide the players quests and some of them would even sell something special.</p><br/><p>Zhang Yang and his gang kept their mount into their inventory and they walked on foot towards the 'village'. Instantly, their arrival attracted the attention of many Spider Men. A crowd of onlookers formed around Zhang Yang and his gang. as if they had never seen men before. Their facial expressions on their face were surprisingly humane. They were most probably wondering why the appearance of Zhang Yang and his gang looked so bizarre to them.</p><br/><p>\"Hahaha! So ugly!\"</p><br/><p>\"My lord, what kind of mutation is this? I wonder what is the origin of their species!\"</p><br/><p>\"They look like freaks! They actually only have 4 limbs!\"</p><br/><p>\"How unfortunate that some of the females actually have cute and pretty faces. But their butts are so small! They do not look like they are good at producing offspring!\"</p><br/><p>The Spider Men were discussing about the appearance of Zhang Yang and his gang. They were criticizing Zhang Yang and his gang from head to feet, literally.</p><br/><p>Han Ying Xue and the other ladies frowned intensely. These Spider Men were actually comparing their fine hot bodies to the body figures of a female spider with the face of a human! If they really had such body figures that would include a butt of the size of a bathtub, these ladies would rather die!</p><br/><p>\"Outsiders!\" A male Spider man crawled out from the crowd with his eight legs. He had white hair and he had a thick beard too. Zhang Yang and his gang could not help but wonder how many years have this Spider Man lived. It appeared that this Spider Man had quite the reputation among the community of Spider Man. The others were clearing up a path so that he could walk up to Zhang Yang and his gang.</p><br/><p>This human-faced spider was called Sandria The Wise. Although he was just a Normal Tier monster, he had a specific name on top of his head. It seemed that he was most likely the one who would give quests to the players.</p><br/><p>Zhang Yang bowed and made a polite salute of an Adventurer, then he said, \"My respected elder, we are Adventurers who hail from a faraway land called the White Jade Castle. We are in urgent of meeting the Spider God!\"</p><br/><p>Everyone in the surroundings looked at each other and burst into laughter. Sandria raised one of his legs up to calm the crowd. Then he said, \"Humans, do you have any idea who are you meeting with? He is our god, the greatest among our gods! Even the true believers are not necessarily able to see him!\"</p><br/><p>Zhang Yang smiled vaguely and said, \"My respected elder, you can just tell us where to find the Spider God! As for whether he would like to see us or not, we'll let Spider God himself decide!\"</p><br/><p>\"I'm afraid that you are going to be disappointed in such regard.\" Sandria shook his head and said, \"We can't allow you to interrupt our fatherly god even if you're here to worship him!\"</p><br/><p>Bastard! Wei Yan Er began to grind her teeth. She moved her battle axe around, facing Sandria's eight legs as if she was deciding which leg should she chop first.</p><br/><p>\"Argh ---\"</p><br/><p>Just when things were getting nowhere, a miserable scream was heard coming from afar followed by a loud rumble that shook the ground. The rumble was so loud that it could be described as deafening.</p><br/><p>\"It's Daday!\" The facial expression of a face of a human-faced spider suddenly changed. Then he quickly raced towards the direction where the scream came from. However, after a brief moment, that same Spider Man turned back and screamed, \"It's the Iron Back Rhinoceruses! Quickly go --- argh!\"</p><br/><p>Before he could finish his words, he also let out a miserable scream and that was it. He never got any chance to scream ever again.</p><br/><p>\"Iron Back Rhinoceros!\" Everyone began to panic. They were like ants on a hot pot, beginning to scatter into the surroundings. Sandria was the only one who remained calm. Then he said, \"Get onto the trees! Weave your webs as high as you can!\"</p><br/><p>\"But The Wise One, how about our eggs?\" one of the spiders was pointing his leg towards rows of white eggs beneath a tree.</p><br/><p>Sandria's face became gloomy, instantly. Then he said, \"There's nothing we can do about it...\"</p><br/><p>\"Maybe we can do something about it!\" Zhang Yang quickly cut in and said, \"We shall drive away the Iron Back Rhinoceroses for you!\"</p><br/><p>The spiders revealed a sense of disdain on their faces. However, none of them were in the mood to ridicule Zhang Yang, as the situation was very critical at the moment. They quickly shot their web strings to the top of the trees and pulled themselves up from the ground. After just awhile, they had climbed up to the trees staying at a safe distance from the ground. At the same time, the rumbling of the ground was getting louder and louder. Everyone knew that the Iron Back Rhinoceroses were approaching closer by the second.</p><br/><p>Suddenly, a row of gigantic Iron Back Rhinoceroses charged out from the forest. They were charging forward like a row of bulldozers running down everything in front of them. The trees were ran down like nothing! Those Spider Men who were on the trees that got ran over quickly escaped to other trees that were closest to them.</p><br/><p>[Iron Back Rhinoceros] (Normal, Beast)</p><br/><p>Level: 160</p><br/><p>HP: 104,448</p><br/><p>Defence: 4,260</p><br/><p>Melee-Attack: 20,992 – 30,992</p><br/><p>Skills:</p><br/><p>[Battering Horn]: Uses a sharp horn to flip the target in the air, causing 100% Melee Attack of Physical Damage to the target. If the target is stunned, this Skill will cause 150% Melee Attack of Physical Damage.</p><br/><p>[Brutal Trampling]: Tramples the ground and blasts all enemy targets that are within the range of 3-meter radius. Stuns all targets within the effective area for 5 seconds.</p><br/><p>Note: The Iron Back Rhinoceroses are famous for having high Defence. However, that did not stop the Spider Man from making them into their favorite food. Hence, these Iron Back Rhinoceroses would sometimes gather together to get their revenge on the Spider Men.</p><br/><p>\"It's time to work!\" Zhang Yang laughed. He did not summon out his Phoenix pet, this time. Instead, he just charged towards the monsters. With the first swing of his [Sword of Purging Devourer]. Zhang Yang activated his {Blast Wave} and caused immense damage to the Iron Back Rhinoceroses. With that strike, he also stunned the monsters for 4 seconds.</p><br/><p>The others began to round up on the Iron Back Rhinoceroses and unleashed their attacks on the monsters. The attacks of fire, magic, and swords were raining down upon the Iron Back Rhinoceroses. Those Normal Tier monsters did not even last any longer than 3 seconds before they collapsed onto the ground and died!</p><br/><p>The spiders hiding on the trees dropped their jaws, as they stared straight at what was happening down there. They unintentionally lower down their web strings down while they were so focused on staring at Zhang Yang and his gang slaughtering the Rhinos up. They looked just like normal humans drooling. Strings of spider threads were dangling down from the trees, looking like white hairs hanging down from the trees. The scene was oddly spectacular.</p><br/><p>Under the heavy assaults of the party, hundreds of Iron Back Rhinoceroses did not last any longer than a few minutes. It did not take long before Zhang Yang and his gang wiped out most of the monsters. The remaining monsters realized that they were out of their league. So they quickly turned their butts around and escaped. After the Rhinos rumbled their way out of the forest, the forest returned calm and peaceful once again.</p><br/><p>However, the peace was broken by cheers of joy after a short while. The Spider Men were sliding down to the ground from the top of the tress. Then they began to dance with their 'traditional' dance moves. Their eight legs were moving oddly smooth and their dancing was oddly satisfying to look at. Well, Zhang Yang and his gang got a chance to feast their eyes upon something today.</p><br/><p>\"Human warriors that hail from afar, I must show our gratitude for fending off those foul beasts from our village and saving our next generation!\" Sandria walked up to Zhang Yang and the rest of the gang with his eight legs. Then he made a gesture that suggested he was grateful for their help.</p><br/><p>Well, if you spiders weren't so into the meat of those Iron Back Rhinoceroses, would you all be attacked, then?</p><br/><p>Zhang Yang smiled vaguely and said, \"No problem at all!\"</p><br/><p>\"About the… erm…\" Sandria revealed an embarrassed expression on his face and said, \"I know that you wanted to meet our father of god. However, telling outsiders about the whereabouts of our Spider God would be blasphemous in our religion. I still cannot tell you about the whereabouts of our Spider God. However, you can head over to the Temple of Andros to seek out some quests. Upon completing some quests, you will be accepted as one of the believers of our religion. By then, you will be able to know the whereabouts of our great Spider God!\"</p><br/><p>Phew… at least they did not pointlessly kill the monsters this time!</p><br/><p>Zhang Yang and his gang nodded and left the odd 'village'. Then, they followed the instructions given by Sandrio and made their way over to the Temple of Andros, located by the west.</p><br/>\n</div>"}