{"title": "Chapter 690: Background of the Eternal Flame", "id": 690, "volume": 7, "url": "http://boxnovel.org/mmorpg-rebirth-of-the-legendary-guardian-chapter-690-background-of-the-eternal-flame", "volume_title": "Volume 7", "body": "<h1>Chapter 690: Background of the Eternal Flame</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 690: Background of the Eternal Flame</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>In a Territory Conquest, everyone was logically eligible to snatch the Territory Order for themselves. The system did not say that the other China Region players could not snatch the Territory Order from Zhang Yang. Truth to be told, Zhang Yang had paid quite a substantial amount of 'price' before he got Snow Seeker and her guild to 'work' for Lone Desert Smoke.</p><br/><p>From that point of view, Zhang Yang did not mind having Eternal Flame snatch the Territory Order from him.</p><br/><p>However, the fact that irked Zhang Yang so much that he was infuriated was that Eternal Flame was reserving their strength while they were using other guilds as their 'shield' to protect themselves. They had waited for the Lone Desert Smoke to face the worst situation before they charged in and gave Lone Desert Smoke a stab in the back. It was infuriating, even for the others! It was not acceptable at all!</p><br/><p>Therefore, the moment when the Territory Conquest was over, Zhang Yang gave the order to his guild to declare war over the Eternal Flame. Including the Alliances of Lone Desert Smoke, over 80,000 high Tier players were involved in hunting down the Eternal Flame.</p><br/><p>The guildmaster of the Eternal Flame was very generous at throwing his money into the guild. The strength of the guild had grown incredibly fast because of that. However, they were not able to outgrow the strength of Lone Desert Smoke in just a few days. Under the heavy assaults, infused with the wrath of Lone Desert Smoke, the Eternal Flame was suffering heavy casualties.</p><br/><p>The slaughtering went on for 7 days straight!</p><br/><p>Some would say that Lone Desert Smoke was showing everyone who was the boss. They had not attained enough evidence yet before they launched their attacks on the Eternal Flame. They suspected that Lone Desert Smoke was taking advantage over a guild that was growing stronger. Some would support the Lone Desert Smoke. They would say that the Eternal Flame was using money to buy high Tier players. The first impression that they gave was that the guild was like a marketplace. Their actions would only shame the China Region! Hence, they deemed that it was necessary for Lone Desert Smoke to hit them hard in the face.</p><br/><p>However, there were also others that were 'passionate; watching the drama from aside. The outcome of this madness would not concern them at all after all. They were also bored at having nothing to do at the moment. So they could just enjoy a good show of a war between two powerful guilds. They could also make topics out of the battle on the forums so that they could have something interesting to discuss there.</p><br/><p>However, the war only lasted for 7 days. Zhang Yang had ceased the assaults on the Eternal Flame after that. Everything went calm once again. However, the war ended, not because Zhang Yang wanted to. Zhang Yang put an end to the war because many guildmasters had advised him to.</p><br/><p>Even Snow Seeker had to be frank with Zhang Yang. She told Zhang Yang that she received a certain amount of stress from someone powerful, on the higher levels of management of the city. That someone wanted her to persuade Zhang Yang to stop the war. That someone even threatened Snow Seeker that if Zhang Yang would not stop right away, Crimson Rage would be forced to declare war on Lone Desert Smoke. Well, she was threatened with the leverage of Crimson Cosmetic Holdings's market. That someone would pull a couple of strings to cripple the market of Crimson Cosmetic Holdings.</p><br/><p>Although Crimson Cosmetic Holdings was indeed a large-scale company that was very influential in the market, they would not have the capability to go against the power of Politics. If the officials denounce Crimson Cosmetic Holdings by reporting negative news and information about them in public, the related departments would have the tendency to launch a full investigation on Crimson Cosmetic Holdings. If that happens, any company would have huge issues later on!</p><br/><p>Therefore, Snow Seeker had to be totally honest with Zhang Yang, that she had to follow the order for the sake of all her employees under her company.</p><br/><p>Other than Snow Seeker, other guildmasters, such as Greensleeves Prince and Sword of Light were also expressing their stand, where they were pressurized to persuade Zhang Yang to stop oppressing the Eternal Flame. Or else, every guild would be standing against Lone Desert Smoke!</p><br/><p>It would still be acceptable if only a few guildmasters were saying the same thing at the same time. However, Zhang Yang had over hundreds of guildmasters saying the same thing! He could not help but feel shocked!</p><br/><p>How powerful exactly is the person behind the Eternal Flame? Who could the mysterious Dragon Marquis really be?</p><br/><p>Although Lone Desert Smoke was still the Number One guild in the entire China Region, Zhang Yang was not so arrogant that he would believe he could take on all guilds in the entire China Region! Therefore, he had to cease his assaults on the Eternal Flame and end the war at once. Afterwards, he sent the guild back to grinding their levels.</p><br/><p>At least the storm had calmed down for the moment. Those who did not know about the truth would think that Lone Desert Smoke had enough of slaughtering. However, Zhang Yang had a glimpse of worry towards the Eternal Flame. Well, this guild had never appeared in his previous life before. So, which butterfly in the butterfly effect had fluttered its wings so much that the situation had changed so much?</p><br/><p>Zhang Yang passed the responsibility of investigating the background of 'Dragon Marquis' to Sun Xin Yu. After all, she is a good detective. She also has one hell of a background. So, what kind of information couldn't she find out, then? If Sun Xin Yu is unable find out anything about this 'Dragon Marquis', then no one else should be able to do it as well!</p><br/><p>For the next few days, Zhang Yang led his party at grinding their levels with a heavy heart. They were trying to attain Level 150 as soon as possible, so that they would not have to suffer the effects of the Level Gap Suppression function of the game on the Level 150 – 180 maps. Previously, their top priority was to take down the Territory. They were not in a favorable position to afford any delays for that. However, it was a little different this time around. They were going over to the Spider Kingdom just to complete their quest. That quest had been left on their quest list for over a year, now. So, it would not affect them much if they waited for another few more days first before departing for the location.</p><br/><p>Zhang Yang made some [Invincible Potions] whenever he had the time. He only placed a small number of this potion to sell at his Little Merchandize Shop. Each bottle was tagged at 200 gold pieces. That amount of value would be 50 times higher than its initial cost! It was sold as a luxurious good in the game! Apparently, this sort of potion was designed for buyers who are filthy rich and love to show off during PvP matches.</p><br/><p>However, Zhang Yang needed the fame that the [Invincible Potion] could bring to his shop. He needed that fame to boost the sales of all the Mythical Tier equipment in his shop. As expected, the gross sales for this Little Merchandize Shop increased tremendously because of the [Invincible Potion]. Fatty Han, Hundred Shots and the rest of his gang were constantly cheering, because they would be taking a share out of the profit, after all.</p><br/><p>The [Book of Revelation] was the one thing that Zhang Yang could not fathom.</p><br/><p>He checked the official website and he still could not find anything about it. Furthermore, it was nothing similar to an [Inheritance Fragment] at all. If you bring the item into a new map, this part of the [Book of Revelation] would not have an automated function where the quest notification would inform you whenever you are near to another part of the item. Of course, there was also a possibility that the maps that Zhang Yang had visited did not have any of the parts of the item. Hence, there was no notification, whatsoever.</p><br/><p>According to Zhang Yang's understanding, if one collects all Chapters of this [Book of Revelation] and put them together according to their chapter sequence, the additional damage effect would definitely be increased. The resurrection time or the amount of HP would also receive improvements as well. However, it remained to be known if there would be any other additional effects.</p><br/><p>The party headed over to the Mar Gaia Forest to grind their levels. There was no one else there to snatch their monsters. They could just find a spot most saturated with monsters. Then, they could just lure as many monsters as they could handle and slaughter the monsters. That could really boost their grinding efficiency to the point that others would drop their jaws if they could see what they were doing.</p><br/><p>Practically speaking, the most important thing in grinding levels would be to pick a spot where players could farm as long as they like. Or else, it would be pointless, even if you have a one-hit-kill kind of Skill!</p><br/><p>When 'God's Miracle' was having its two-year anniversary, Zhang Yang was the first player to hit Level 150. He remained the number one, top leading player on the leaderboard of the server. Currently, the first 15 players according to their levels were as below:</p><br/><p>1. Zhan Yu, Class S God of War Inheritance, Lone Desert Smoke, China Region, Level 150</p><br/><p>2. Frost Night, Class S Shadow Dancer Inheritance, Lone Desert Smoke, China Region, Level 148</p><br/><p>3. Heart of Destruction, Class S God or Arcane Magic Inheritance, Dark Palace, North America Region, Level 147</p><br/><p>4. Hourglass Figure, Class S Shadow Striker Inheritance, Land of Savages, India Region, Level 147</p><br/><p>5. God's Left Hand, Class S Apocalyptic Knight Inheritance, Paragon, Europe Region, level 147</p><br/><p>6. Drizzler, Class A Darkness Inheritance, Lone Desert Smoke, China Region, Level 147</p><br/><p>7. Little Snow, Class S Milkmaid Deity Inheritance, Lone Desert Smoke, China Region, Level 147</p><br/><p>8. Daffodil Daydream, Class A Soul Breaker Inheritance, Lone desert Smoke, China Region, Level 146</p><br/><p>9. Lost Dream, Class B Snowman Inheritance, Lone Desert Smoke, China Region, Level 146</p><br/><p>10. Dusk Phoenix, Class A Blood Angel Inheritance, Paragon, Europe Region, Level 146</p><br/><p>11. Captain America, Class A Titan Inheritance, Justice League, North America Region, Level 145</p><br/><p>12. Snow Seeker, Class A Frost Phoenix Inheritance, Crimson Rage, China Region, Level 145</p><br/><p>13. Seductive Wild Pussy, Class A Arachnid Inheritance, Judgement, Europe Region, Level 145</p><br/><p>14. Scholar Musou, Class A Lord of Flame Inheritance, Eternal Flame, China Region, Level 145</p><br/><p>15. Longrich, Class A Death Swamp Inheritance, Eternal Flame, China Region, Level 145</p><br/><p>The entire list of the Leaderboard had been occupied with the names of players with high-Class Inheritances. The first 5 names on the top of the list were the names of 5 players with Class S Inheritance. If Han Ying Xue was not a Healer, she could have taken over the 6th place. When that happens, the top 6 players on the list would all be players with Class S Inheritances.</p><br/><p>Lost Dream was the only player with Class B Inheritance to force himself into the Top 15 positions on the Leaderboard. Part of the main reason, being he always tagged along Zhang Yang and the gang while grinding his level up. Secondly, he had also spent quite a large sum of money on purchasing [Experience Books] to feed his own Experience Point Bar. Furthermore, he was also a skillful, high Tiered player himself! That is why he had been able to become the only player with a Class B Inheritance on the Leaderboard list.</p><br/><p>However, Zhang Yang was irked by the Leaderboard this time around. First of all, he could no longer choose to stay unranked. He could no longer keep an element of surprise to show himself off, even if he wanted to. Of course, with his current fame, he couldn't stay low, even if he wants to.</p><br/><p>Most importantly, the Leaderboards had blatantly revealed everyone's Inheritance to the public! Although the names of the Inheritance would not reveal much information about the Inheritances, it was just annoying to see your Inheritance being listed out into the public. It felt like one's privacy and hidden triumph card is being invaded.</p><br/><p>Zhang Yang could clearly remember that the Leaderboard in his previous life was very different from this one. Meanwhile, everyone could choose not to appear on the Leaderboards, if they choose not to be. Furthermore, the Leaderboard did not reveal everyone's secrets, such as Inheritance Names and Levels.</p><br/><p>In other words, the details in this life compared to his previous life had changed much.</p><br/><p>However, the fact that China Region dominated the Leaderboard was a fact that the China Region should be proud of. 9 of them had made it onto the Leaderboard. That being said, they had dominated over 60% of the list. Their claim was much larger than the sum of other Regions combined! Meanwhile, among the 9 players, most of them were from Lone Desert Smoke! 6 of them had made it to the Leaderboard!</p><br/><p>Nevertheless, Zhang Yang felt a little pressurized at seeing the two names that belonged to the Eternal Flame.</p><br/><p>Scholar Musou was quite a renowned player in Zhang Yang's previous life. However, he was the ace for a guild by the name Breaking Dawn. So Zhang Yang had not expected to see that this player in Eternal Flame instead. Zhang Yang had never encountered that fellow, because he was not that powerful in his previous life. He had no chance at all of encountering that person. All he knew was that Scholar Musou was a Berserker and he became famous because of his detailed and precise controls.</p><br/><p>On the other hand, Longrich was a name completely unfamiliar to Zhang Yang!</p><br/><p>Well, the game was not short of skillful and powerful players, after all. Because of some unforeseen circumstances, they had remained in the shadows for the moment without having the chance to show their faces to the public. For instance, in his previous life, if Zhang Yang could have gotten some support and care from any large-scale guild in boosting his level and providing him some high Tier equipment, he could have become one of the most fearsome players in the history of the game!</p><br/><p>Therefore, Zhang Yang was being extra careful, even though he had not heard such a name in his previous life. Who knows, how well a player could perform with a great deal of money supporting him from behind.</p><br/>\n</div>"}