{"title": "Chapter 714: Information For Sale", "id": 714, "volume": 8, "url": "http://boxnovel.org/mmorpg-rebirth-of-the-legendary-guardian-chapter-714-information-for-sale", "volume_title": "Volume 8", "body": "<h1>Chapter 714: Information For Sale</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 714: Information For Sale</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>The 13 players were all from a guild called 'Contra'. It should be a small guild. Zhang Yang had never heard of it in both of his lives. He had practically committed every noteworthy guild to memory. If this guild was not in his memory banks, it had to be rather insignificant.</p><br/><p>Although it would be best to come to this map after players have attained Level 150, the other Level 120 – 150 maps were crowded with players from all around the world. It would be almost impossible to find a peaceful spot to farm. Therefore, many players have begun running over to this map the moment they hit Level 140. As long as they do not encounter any Level 170 monsters, none of them would have to suffer at the hands of the Level Gap Suppression function of the game.</p><br/><p>However, players must be of certain standard before they can survive in the new map. Monsters in the Level 150 – 180 maps were basically one Tier higher than the monsters in lower level maps such as Kandiya Grasslands and Aomori Moss Land. A Level 150 - 180 map was not the place for all Level 140 players to come and crash.</p><br/><p>\"Let's leave!\" The two of them lost interest after they observed the battle for a short while. Zhang Yang waved a little and the two of them turned around and was ready to leave.</p><br/><p>However, Ten Dusk and Female Raid Covent suddenly raced towards Zhang Yang and Han Ying Xue, without any warning! Meanwhile, the 13 players from Contra had arrived at their spot and rounded them up. That included Zhang Yang and Han Ying Xue, of course!</p><br/><p>Female Raid Covent reacted extremely quickly and said \"Haha! Now that my brother and sister are here, let's see, who's going to take care of who now!\"</p><br/><p>\"There's just the four of you! We're still going to beat you up like pigs!\" one of them who seemed to be the leader of the party said, \"You bastards! How dare you humiliate my girl! There's no way that you're getting out of here alive!\"</p><br/><p>\"Pui! You wife's the one who grew an ugly face! Look at her! Her face looks just like the face of a monkey's butts! And look lower a bit! There's no chest! Look even lower now! She doesn't even have curvy butts! She looks like a prepubescent! You're telling me that you're still going to treasure her!? You pedobear!\" With his foul mouth, Female Raid Covent had really made them angry enough to shoot themselves in the heads.</p><br/><p>\"Boss! Boss! Don't do anything rash just yet! He, he, he's Zhan Yu!\" Well, the Phoenix pet had given it away. One of them could recognize Zhang Yang by looking at his appearance as well. He could not even finish his words properly.</p><br/><p>\"Zhan, Zhan Yu!\" The leader's name was 'Boasting Swordsman'. After looking at Zhang Yang atop his Phoenix pet, he took in a deep cold breath and fell silent.</p><br/><p>\"Haha! Be afraid! This is our boss!\" Female Raid Covent did not seem to know when to stop talking, \"Just listen to me. Your girl over there loves to wink her sexy eyes at anyone she sees. Just look at her again! I can tell that she's not the type who would settle down quietly! You better find a new one!\"</p><br/><p>\"Darling! I'm not that type of girl! He's humiliating me! You must get him to apologize to me! Or else you're never going to 'hmm hmm' with me!\" Among the 13 players from Contra, there was one female elf that looked like a Spellcaster. She was acting all spoiled up on Boasting Swordsman.</p><br/><p>\"You shut up!\" Boasting Swordsman immediate shouted angrily at the girl and said, \"It's all because of you acting lewd all the time! Look at the mess you got us into! They were just passing by peacefully at first. Then you insisted on wanting them party up with them! Did you just have an eye for the both of them? You planned to have a 3P session behind my back, didn't you?!\"</p><br/><p>\"What are you talking about!? I'm very loyal to you, okay?!\"</p><br/><p>At first, Zhang Yang did not intend to be a human shield for Ten Dusk and his friend. However, after hearing what Boasting Swordsman had to say, he was infuriated. His face turned dark and he said, \"Just leave… before I change my mind.\"</p><br/><p>Boasting Swordsman felt awkward after that. Even if he had over 100 guts in his stomach, he would never dare provoke Zhang Yang. However, he did not feel so good after being chased away by the other people like a pest. So he forced a smile and led his party to retreat at once.</p><br/><p>\"Haha! Thank you so much, my brother!\" Female Raid Covent was acting as if he had been friends with Zhang Yang for many years, though the fact was that he just met Zhang Yang a few minutes ago. Then, he scanned his eyes across the body of Han Ying Xue and said, \"Yo, brother! Your girl is too damn fine! The front and the back are all there! The only imperfection is her face! But no one can see when the lights are out! The sensation of the touching and grabbing are the things that matter the most! Cover the face, bang the base!\"</p><br/><p>What the f*ck! What kind of thick-faced prick is this?</p><br/><p>Zhang Yang shook his head and said, \"Did anyone ever tell you that your mouth stinks?\"</p><br/><p>\"A lot of them! But sometimes I just don't care! Hehehehehe!\" Female Raid Covent spoke like a man of marked individuality. Then he rested his arm over Zhang Yang's shoulders as if nothing had happened back there. His 'wretchedness' was even higher than Fatty Han's!</p><br/><p>\"Zhan Yu?\" On the other hand, Ten Dusk was acting much more matured and poised. His face seemed serious all the time. It was truly a wonder that he would end up with a wretched friend like Female Raid Covent.</p><br/><p>Since his Phoenix pet had given his identity up to the others, Zhang Yang nodded and said, \"Yes.\"</p><br/><p>\"This is weird! You're not as handsome as I am! How are you so famous then?\" Female Raid Covent fixed his eyes on Zhang Yang's face. Then his eyes scanned Zhang Yang from head to toe. Then he continued to say, \"But nevermind, I'm going to surpass you and become Number One in the entire game!\"</p><br/><p>What a thick-faced son of the b*tch!</p><br/><p>Zhang Yang did not even have the intention to ask what happened between these two with those players from Contra. Well, he was 90% sure that it must have been because of that loud mouth of Female Raid Covent. He did provide them a great 'sample' right here, right now. So Zhang Yang smiled and said, \"So let's part ways now!\"</p><br/><p>\"Aiyoyo… don't be so hasty!\" Female Raid Covent quickly stopped Zhang Yang and said, \"We're here because of fate. Can't you feel my passion? I want to know more about you!\"</p><br/><p>\"NO!\"</p><br/><p>\"Come one! Don't be so cold to me!\" Female Raid Covent was acting like a piece of chewing gum and glued himself on Zhang Yang. It was really hard to get rid of him now. \"You even brought a girl with you to grind! You have my style! Unfortunately, that boring man over there is not interested in ladies. He even chased away all of my girl fans. Or else with my charm leaking about, girls would scream and shout in excitement while following me around!\"</p><br/><p>Zhang Yang frowned intensely at what Female Raid Covent had to say. This fellow is really too good at acting friendly with strangers! He looked at Ten Dusk realized that he was frowning too. It seemed that this Female Raid Covent was really a wretched package of 'trouble' to begin with.</p><br/><p>\"Oh, right! Are you interested in taking on a boss with us?\" Female Raid Covent suddenly changed a new topic, \"It's a Holy Tier super boss! So, what do you say we try it out together? We'll split the loots fifty-fifty!\"</p><br/><p>This man did not sound trustworthy, though. Zhang Yang looked over towards Ten Dusk. Ten Dusk looked back at Zhang Yang and he said, \"It's a Level 175 Holy Tier boss. He's called Ghostface Monkey King. Unfortunately, we can't beat that boss.\"</p><br/><p>It made perfect sense. A super boss on an Open World Map would have a HP Recovery Skill. Furthermore, these two only had powerful Defences. They did not have much of an Offence to begin with. Even if Zhang Yang goes up against the boss with his {God of War Transformation} activated, he might not even be able to beat the boss.</p><br/><p>Zhang Yang could not help but laugh, \"However, we only have two Healers and two Tankers. How much DPS do you expect us to muster? We won't even get past his HP regeneration!\"</p><br/><p>\"Well, you can call your other friends along. But we're still splitting the loots fifty-fifty!\" Female Raid Covent spoke like he was fooling around, \"Only we know where the boss is. So, what do you say about this? If you go, at least you're going to get something. But if you don't, you'll get nothing at all!\"</p><br/><p>Zhang Yang gave it some thought and said, \"A Level 175 boss would drop Level 170 equipment. Even if those equipment have the Special attribute that reduces Required Level by 20 levels, you still need to be Level 150 to equip them. Let's make another deal. After we split the loot fifty-fifty, I will use two of my Level 140 Ethereal Tier equipment to exchange one of your Level 150 Holy Tier equipment. Think about it! You get 2 in return while I only got one. It's a fair trade!\"</p><br/><p>Female Raid Covent and Ten Dusk looked at each other and nodded at the same time. \"Deal!\"</p><br/><p>Yes, Holy Tier equipment are extremely valuable and rare at the current stage of the game. However, players could only wear them when they reach the Required Level to be eligible to wear them. It was not like everyone need to show themselves off in a Fashion Exhibition or what. Currently, Ten Dusk was Level 144. It would still take about two and a half months for him to get up to Level 150. Meanwhile, exchanging 1 Holy Tier with 2 Ethereal Tier equipment sounds much better than holding onto the equipment that they could not wear yet for so long. Other than that, having two Ethereal Tier equipment on them would definitely not be weaker than having one Holy Tier equipment on them. More importantly, they could equip the Ethereal Tier the moment they get it. After weighing the pros and cons, they decided to take the deal.</p><br/><p>After they had struck the deal, Female Raid Covent and Ten Dusk began to lead Zhang Yang and Han Ying Xue to the location of the boss.</p><br/><p>\"So I see that you guys have not joined any guild yet. I'm just wondering, how did you guys manage to get good equipment like these Mythical Tier equipment?\" Han Ying Xue was asking out of her curiosity. Of course, she was asking Ten Dusk. Well, Mythical Tier equipment can only be found in the Hardcore Mode of a dungeon. Meanwhile, the game developer decided to spice up the game for players to be more active in clearing dungeons. They made every equipment that players find in the Death Swamp to be 'bound upon pick up'. Players would not be able to sell the equipment they farm from that dungeon anymore.</p><br/><p>If players would like to get their hands on Mythical Tier equipment which was deemed to be the most popular and powerful equipment in the current stage of the game, they would have to work their *sses off to get them on their own.</p><br/><p>\"Well, there are many Gold Parties out there. As long as they're willing to pay up, we will join in and help them clear dungeons like Death Swamp. Well, sometimes they even pay hundreds of thousands to us by the end of it. So after earning a few rounds, we have enough money to keep ourselves up to date!\" Female Raid Covent cut in before Ten Dusk could say anything.</p><br/><p>Well, a Gold Party is a party where some players with good equipment bring some players with weak equipment into clearing some dungeons. The price of having these powerful players running errands for the weaker players would be based on the number of equipment they could get. This is one of the tactics that the players came up with to defy the 'bound upon pick up' feature for the new dungeon Death Swamp. However, the equipment of players who hired others would not have equipment that were up to the standard. Well, in a 5-player scale dungeon, lacking one powerful DPS could make the whole situation very difficult to deal with, Therefore, there were only a few powerful guilds that were capable of forming Gold Parties.</p><br/><p>Lone Desert Smoke also had Gold Parties. However, Zhang Yang and his gang would never waste their time on running errands like that. Well, they could handle everything by themselves anyway. So, Han Ying Xue had no knowledge at all about what a Gold Party is.</p><br/><p>The four of them went through a series of twist and turns across the mountains. After traveling for over 3 to 4 hours, they finally arrived at the entrance of a small valley. Flowers and other green plants were flourishing across the entire valley. The place seemed magically peaceful and green. By the west side of the valley, there was a lake of the size of almost one-third the entire valley.</p><br/><p>The entrance of the valley was very hard to spot. Well, it was hidden in plain sight. Of course players would miss it if they were just flying by the place.</p><br/><p>Therefore, the most difficult part about such bosses would be finding them in the first place. Otherwise, there was no boss in the game that players could not take down, not yet.</p><br/><p>As they proceeded forward, they went along the side of the lake. After a moment of walking, the four of them arrived at a sandy white beach. There was a large ape, covered in coal-black fur, sleeping by the beach. It was spouting out flames from its nose. The blazing air current was so strong that the sands were swept up from the sandy ground as if there was a fan blowing the sand away, one wave after another.</p><br/><p>This ape was at least 10 meters high. If it stands up straight, this ape should be as tall as a 3 story house. Its eyes were sunken deep into its face. Its fangs protuded from its mouth, making it look extremely ferocious. Well, that was most probably why it was called a Ghostface Monkey King, then.</p><br/><p>[Ghostface Ape King]</p><br/><p>Level: 175</p><br/><p>HP: 17,000,000,000</p><br/><p>Defence: 17,660</p><br/><p>Melee Attack: 140,154 - 200,154</p><br/><p>Skills:</p><br/><p>[Ground Hammer]: Shakes the ground with pure power and causes the ground within the area of 50 meters to crack and break. All targets within the effective range will receive 200,000 Physical Damage. All targets will be stunned for 3 seconds.</p><br/><p>[Slam]: Slam onto a target causing 100% Melee Attack of Physical Damage to the target. The Healing Efficiency of the target will be reduced by 50%.</p><br/><p>[Beast Constitution]: Recovers 1% HP in every 30 seconds. The amount of HP recovered will not be affected by any other effects.</p><br/><p>[Summon]: Summons the same number of Elite Tier Ghostface Monkeys, based on the number of players on the boss's Aggro list.</p><br/><p>Note: Ghostface Monkeys were born to be ferocious, and they love to kill. They can get even more ferocious than you can possibly imagine to those who trespass their territory.</p><br/>\n</div>"}