{"title": "Chapter 724: The Spectres Invade", "id": 724, "volume": 8, "url": "http://boxnovel.org/mmorpg-rebirth-of-the-legendary-guardian-chapter-724-the-spectres-invade", "volume_title": "Volume 8", "body": "<h1>Chapter 724: The Spectres Invade</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 724: The Spectres Invade</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>As for what had happened in his past life, Zhang Yang recalled that when the Specter Invasion started, he was only Level 50 or so. He could only be a side-character, killing random small minions at the side of the map, while the other \"heroes\" charged into the real fight with Angus, Lord of the Seven Spectre King. While others had face trouble fighting him when they were already higher levels than he was, Zhang Yang could not even set foot in the fight! It might be a surreal fantasy, but the truth was factual, a Celestial tier boss, Angus had descended down to the human realm and brought the doomsday with him!</p><br/><p>Even though each major city should have their own Celestial tier boss, due to several story plot devices, they were untouchable. Even the bosses in neutral grounds could not be touched as they were all friendlies. Players would not even give it a try since firstly, it would be extremely difficult, and secondly, there was no reason to.</p><br/><p>As for the Ten Evil Demon Lords, and the Seven Spectre Kings, they were all considered to be open-world bosses. Under normal conditions, they were considered to be undefeatable targets. Their powers were so strong that they could snuff out all players with just a simple blow of their noses. Hence, theoretically, even if all players from all corners of the world were to join forces, they would be completely wiped out as well. 100% clean.</p><br/><p>To defeat a Celestial tier boss, one must have a Celestial tier equipment set. However, Celestial tier equipment would only drop from a Celestial tier boss! It's a complete loop. Hence, without special conditions, a Celestial tier boss could never be killed.</p><br/><p>At that moment, the game version was still held during their Spectre Invasion patch. It was made to be a small introduction to the real threat that will come eventually. As such, if players can find, trigger, and complete a few crucial quests, they can fulfill a certain condition where players could bring in the King or the Baron of the Kingdom to participate in the war against the Celestial tier boss!</p><br/><p>However, mind that the NPCs were only mostly Ascended tiers. Unless they have an army of Ascended tier bosses lining up, tanking the Celestial tier boss with only a few Ascended tier NPC would go poorly. Technically, the odds were still in favor of the Celestial tier boss, however, with help from players, they might still have a chance of defeating him. At that point, the Celestial tier boss will drop the Celestial tier equipment.</p><br/><p>Zhang Yang may have more than several tens of millions of HP, but in the face of a Celestial tier boss, it would simply take a normal attack to kill him. Even if he uses his Inheritance Transformation, the boss would still be several Levels ahead of him. With the Level Suppression system still in effect, no one, including Zhang Yang could deal more than 1 pitiful damage!</p><br/><p>All who were in the face of the overwhelming Celestial boss were nothing but tiny ants!</p><br/><p>Zhang Yang could recall the memories of his past life when the Spectre Invasion event was still ongoing. It was the first time in history that all players in the battlefield were wiped clean, and all major cities were overrun by Spectre except one that stood strong, because all of the lower level players were hiding behind the walls. That was how powerful Angus was.</p><br/><p>Naturally, the system had not made it impossible for players. After every short period of time, the Spectre army will withdraw on their own and the NPC army will form a counterattack force to try and defeat Angus. Every time the raid fails, the NPC army's strength will be slowly increased until Angus is defeated.</p><br/><p>However, there will be a drawback. Every time the NPC army and players are defeated by Angus, the number of drops from Angus will be reduced. According to the data released by the officials, if Angus is killed in only the first try, he will drop one of the 6 major classes' - 13 pieces set equipment! All the Celestial tier equipment were Unique. Even if any one person is able to get their hands on one of the 13 set equipment, they would be greeted with immeasurable fame and glory!</p><br/><p>If the first attempt fails, the second attempt will drop only 10 set equipment. The third will only drop 7, and 4 for the fourth time. After the fifth time, the boss will only drop one of the set equipment. If players are still unable to defeat the boss, there will be no more set equipment, only regular equipment without set effects. After more failures, the number of possible Celestial tier equipment drop will be reduced even further.</p><br/><p>Eventually, if players are still unable to defeat Angus, the NPCs will be stronger than Angus, and the boss will only drop one regular Celestial tier equipment. Although it may sound weak, it was still a Celestial tier.</p><br/><p>Naturally, having a full set of regular Celestial tier equipment will be far weaker than having a full set of Celestial tier set equipment!</p><br/><p>In his previous life, Angus was defeated only after the seventh trial, and all set-equipment was removed from the drop list. The boss was killed and only dropped four regular Celestial tier equipment. Even so, due to the extremely limited drops, a massive war had erupted among all players.</p><br/><p>However, even if they won the war and claimed the Celestial equipment, they would have to train for more than a year in order to reach the Level Requirement which was Level 230, Level 200 if they had a special Level reduction effect.</p><br/><p>The main point was not the Celestial equipment, but the Celestial boss! That was how strong it was.</p><br/><p>Zhang Yang clearly recalled that all four equipment were claimed by four different individuals, which was One Sword Stroke, Hourglass Figure, Captain America, and God's Left Hand. That time, Captain America had, of course, possessed the God of War Inheritance.</p><br/><p>Zhang Yang felt a shiver down his spine thinking about. Who knows how many time would they need to try this time…</p><br/><p>It was a Celestial tier set equipment hanging right there just for him. Even Zhang Yang could not resist the temptation, and started to fantasize.</p><br/><p>As long as a town is occupied by Humans, Orcs, Elves, and Dwarves, they will be attacked by Spectres. As such, they were named as the Attacked Villages. Different level of maps will be invaded with the appropriate level of monsters. Even the beginner's village will be swarmed with Level 10 monsters.</p><br/><p>The Spectres will attack the cities every one hour, and will have one boss leading the charge. The boss' level will be adjusted according to the map's Level as well. If the Spectre were to attack Souron's Castle, the boss' Level will be Level 170, similar to the monsters of which the boss was leading.</p><br/><p>However, since the boss was not the final boss of the corresponding map, the equipment dropped from it would not have the special Level reduction effect. Hence, it was not as valuable to others. However, it was still in demand, since Mythical tier equipment that are farmed from dungeons were bound on loot. It cannot be traded nor sold. Hence, there was still a certain value to the equipment obtained from open-world bosses. Especially, when the most wanted equipment were Level 140. Better than nothing, right?</p><br/><p>The only new dungeons available then were the Level 170 dungeons. Right then, there was a Level 160 dungeon that could be raided. However, Zhang Yang did not want to raid, rather, he did not know how to do it. Going in alone would be suicidal and stupid. Also, if he does manage to obtain the First Clear Reward, it would be a waste, since the other members would not be able to obtain the perks.</p><br/><p>It was still better to set his priorities somewhere else. Zhang Yang went to White Jade Castle and headed to the Explorer's Guild, an establishment that would post the main quests for the Spectre Invasion event.</p><br/><p>The NPC that gives out the quest was a greenish little gnome. No one knows, but the little NPC had randomly just appeared out of nowhere and stood there as if he had been waiting for Zhang Yang for a long time. Zhang Yang came to him and the little gnome gestured Zhang Yang to bend over lower. \"Hmph! Rude! Bend over a little, my neck is hurting, just looking at your stupid face!\"</p><br/><p>Zhang Yang popped a vein in his forehead and he did just that. Zhang Yang found himself a chair and sat down.</p><br/><p>\"I've come to accept a request, Guraj, not to listen to your complaints!\"</p><br/><p>Gnomes are the kind of species that are afraid of fights. Hence, the system had implemented a kind of system where if the player offends the NPC, the quest that the player receives will be of no use to them. Zhang Yang had learned that the hard way in his previous life.</p><br/><p>\"Fine.\" said the Gnome as Zhang Yang would not allow the Gnome to leave his sight. \"What kind of quest would you like to accept here? I have a few lying around, errands of running here and there. I also have some that require stealth and strength to infiltrate the enemy's base to retrieve top-secret military intelligence.\"</p><br/><p>Fortunately for Zhang Yang, he was not too rude with the Gnome. The quests he offered to Zhang Yang were plenty in variety! In his previous life, Zhang Yang was only offered random running errands!</p><br/><p>\"Give me the hardest you've got!\"</p><br/><p>\"Ho ho ho, if you think that you're that invincible, I have one that might snap you back to reality! Head over to Spectre Outpost located in the Forest of Clouds. Find out the reason behind the rising activity of the Spectres,\" said Gulaj.</p><br/><p>'Ding! Gulaj has a quest for you: The Spectre's Secret. Will you accept it?'</p><br/><p>[Spectre's Secret] (Difficulty Level: B)</p><br/><p>Description: Gulaj wants you to head over to the Spectre Outpost located in the Forest of Clouds. Find out the reason why the Spectre have begun to move about. After your investigation, report back to Gulaj.</p><br/><p>Progress: Understand the Spectre's Secret 0/1</p><br/><p>Quest Reward: Experience Points: +5,000,000 Military Points: +100</p><br/><p>Military Points!</p><br/><p>Zhang Yang smiled with such satisfaction. The reason why he was happy to able to retrieve better quests was because of the Military Points. Military Points are useful only during the Spectre Invasion event. The more you have, the more soldiers you could hire. Correspondingly, the larger your army, the higher the chance of you defeating Argus.</p><br/><p>100 Military Points might be an insignificant amount, but it was far better than the 1 or 2 Military Points reward for completing random errands.</p><br/><p>Zhang Yang had not shared the news about the quest with anyone else, since Han Ying Xue and the rest of the gang were lower than Level 160. Most of the quests that were related to the Spectre Invasion event were Level 160 and above. Plus, Han Ying Xue and the rest of the gang were extremely busy leveling in order to reach Level 160 as soon as possible to join Zhang Yang.</p><br/><p>Zhang Yang teleported to Souron's Castle and rode the Phoenix towards the Forest of Clouds. After three to four hours of bored flying, he came to a place that looked like a mass grave, situated nearby a number of towers. Countless of towers were built there with numerous Spectre monsters going in and out of it. Just the numbers alone would be like fighting the entire of China!</p><br/><p>Zhang Yang flew downward and landed. Since there were no clues as to where he should start searching for clues, Zhang Yang decided to check out the towers one by one in order to fulfill the quest requirement. Zhang Yang scouted the area and soared to the skies soon after. He made his way swiftly and made the Phoenix a smaller size before summoning Felice out and wreaked havoc to the entire place.</p><br/><p>Zhang Yang made his way into the tower entrance and killed his way through. The interior of the tower was like the famous Catacombs underneath Paris. There were bones embedded in the walls of the tower! The worst part of it all was that, it seemed like the tower was only built in a few days' time, for there was still fresh blood oozing out of some of the bones. Maggots coupled with rotten flesh kept falling down from above, as Zhang Yang made his way upwards the tower.</p><br/><p>There was a group small skeletal soldiers, grouped in 12, that were patrolling around. They were only normal tiers and as they spotted Zhang Yang, their first instinct was to charge in blindly. However, no matter how many monsters there were then, they were nothing but normal tiers. With several quick swings, Zhang Yang killed them all. As a reward, the skeletal soldiers dropped many [Frosty Inscribed Cloth].</p><br/><p>Those [Frosty Inscribed Cloth] could be used to craft [Level 7 Frosty Inscribed Bandages] which could heal over 100,000 HP in 10 seconds. Since Zhang Yang had the title to increase the [Bandage] effect, he could heal over 200,000 HP. However, his HP limit was so high that 200,000 HP was just about 20% of his entire HP bar. It was neither too little nor too much. Yet, it was somewhat still insignificant.</p><br/><p>After collecting all the loot, Zhang Yang followed the flight of stairs upwards. Occasionally, Zhang Yang's heavy character made stepping on the boney staircase a difficult process, since he appeared to be cracking them. Though it was just a sound effect and not a real physical event, it was made purely as a scary ambience.</p><br/><p>Zhang Yang moved up to the second floor and found a change in the monster type. On the ground floor, the monsters were nothing but normal tier skeletal soldiers that posed no threat to him. On the second floor however, there were many scrawny, meatless, muscles-less elite tier Spectre Wizards.</p><br/><p>[Warfront Spectre Wizard] (Elite, Spectre)</p><br/><p>Level: 165</p><br/><p>HP: 4,950,000</p><br/><p>Defense: 6,640</p><br/><p>Magic Attack: 24,446 – 32,446</p><br/><p>Skills:</p><br/><p>[Shadow Arrow]: Deals 200% Magic Shadow attack to a target. Range: 30 meters. Casting time: 2 seconds.</p><br/><p>[Death Waves]: Blasts a deadly wave that is meant to corrupt the living and mend the dead. Deals 40,000 Shadow damage to all non-Spectre based target and heals all Spectres type targets by 20,000 HP.</p><br/>\n</div>"}