{"title": "Chapter 725: Tower Clearing", "id": 725, "volume": 8, "url": "http://boxnovel.org/mmorpg-rebirth-of-the-legendary-guardian-chapter-725-tower-clearing", "volume_title": "Volume 8", "body": "<h1>Chapter 725: Tower Clearing</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 725: Tower Clearing</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Although the skill {Death Wave} would not heal the caster himself, it could be used to heal others. Hence, if two Spectre Wizard were to stand side by side, they could technically heal each other endlessly, making the battle much harder. If he kites too many of them at the same time, it would be really difficult. Stack them up to a certain amount, all the monsters could basically heal themselves back to full health if Zhang Yang is unable to kill them all in a blast!</p><br/><p>What a sad case indeed. Zhang Yang had initially thought that he could at least perform a fast mass-kill since the tower floor was crowded and small. Sadly, due to the AoE healing {Death Wave}, Zhang Yang had to change his killing style to one at a time! The slowest, boring-est, lamest style ever! </p><br/><p>If {Destructive Smash} was an AoE attack, he could have just kited of the monsters in together and wiped them all without having to worry about their healings! At most, if he is unable to handle the damage, he could just rely on {Shadow of the Void} to escape!</p><br/><p>Zhang Yang carefully aimed {Spear of Obliteration} at the monsters at the edge of the crowd and kited him towards himself. The monster was drawn away from the bunch of monsters, allowing Zhang Yang to fight the monster alone.</p><br/><p>After a certain distance, Zhang Yang moved towards it and attacked. After a normal attack, Zhang Yang's Rage gauge was filled. He used {Charge Up Strike} and landed one {God of War Devastation} dealing more than a million damage to the monster.</p><br/><p>'-29,373!'</p><br/><p>A powerful attack landed on Zhang Yang which made Zhang Yang winched a little. 30,000 damage was not a small amount. As such, facing a magic type monster, a Guardian loses his tankiness. All his thick armor is ineffective. With his HP, he could at least take 35 hits of the {Shadow Arrow}. Technically, if the monster wants to kill Zhang Yang, he would need to last for 70 seconds.</p><br/><p>\"Shi shi shi shi!\" The Wizard laughed in a weird manner and blasted out a dark wave. The wave dealt close to 18,000 damage to Zhang Yang. That was the skill {Death Wave}. Fortunately, Zhang Yang had only drawn in one monster, hence, the skill was only an AoE attack instead of a healing skill.</p><br/><p>\"Laughing? Really?\" Zhang Yang sliced the monster on and on before striking the monster with a {God of War Heavy Axe}, dealing more than 300,000 damage with a single blow.</p><br/><p>Another {Shadow Arrow} was being casted by the Spectre Wizard. However, before the spell could finish, Zhang Yang landed a {Crash Magic} on the monster and disrupted the spell cast. For the next 3 seconds, the monster was silent and could only deal physical attacks on Zhang Yang by knocking on him with his wooden staff.</p><br/><p>Since magic type monsters would have low physical attack, the attack was not only unable to deal any single damage to him, but also triggered Zhang Yang's {Block}. As such, Zhang Yang was able to use {Shield Bash} to forcefully bash the wizard's boney face in.</p><br/><p>\"Aurgh!\" The wizard cried with rage. Elite or not, Zhang Yang was unrivaled in strength. In just half a minute, Zhang Yang with the combine attack of the Phoenix and Felice, was able to defeat it. The monster had rewarded Zhang Yang with a large sum of 5,000,000 experience points. Still, it was not a surprise. An elite was an elite monster, even though the monster had only attacked Zhang Yang roughly around 10 times, with both {Shadow Arrow} and {Death Wave}, the monster was able to deal a total of 400,000 HP, which was 40% of Zhang Yang's HP!</p><br/><p>To be safe, Zhang Yang did not proceed to kite the second monster. Instead, he sat down and bit down a [Chicken Burger] to restore his HP back to 100% before engaging again.</p><br/><p>One by one, Zhang Yang killed all of the monsters on the second floor. Sadly, he had taken more than half an hour to do so. After finishing up the boring floor, Zhang Yang made his way up the staircase. Before he could reach the third floor, he came across a large monster that was standing guard at the entrance.</p><br/><p>[Warfront Spectre Wizard Captain] (Mythical, Spectre)</p><br/><p>Level: 170</p><br/><p>HP: 8,500,000</p><br/><p>Defense: 10,490</p><br/><p>Magic Attack: 43,569 – 63,569</p><br/><p>Skills:</p><br/><p>[Shadow Arrow]: Deals 200% Magic Shadow damage to a target. Range: 30 meters. Casting time: 2 seconds.</p><br/><p>[Death Wave]: Blasts a deadly wave that is meant to corrupt the living and mend the dead. Deals 80,000 Shadow damage to all non-Spectre based target and heals all Spectres type targets for 40,000 HP.</p><br/><p>[Spectre Constitution]: Restores 1% HP every 30 seconds. Recovery rate would not be affected by skills.</p><br/><p>A mini-boss?</p><br/><p>Even though it was merely a Mythical tier boss, it would be a worthwhile fight. Why reject something when it's given to you for free?</p><br/><p>After restoring all his HP, Zhang Yang took charge, followed by the Phoenix and Felice behind. Even though the boss may have the annoying HP recovery skill, it was still limited by the maximum HP. So, the boss might have a maximum HP of 8,500,000 HP, which means, that every 30 seconds, it could heal 85,000 HP. That's only 3,000 HP per second. Zhang Yang's DPS was far stronger than that puny number.</p><br/><p>\"Hmph. Humans. Your days on this land are numbered!\" said the boss as Zhang Yang approached him. With a bold expression, he lifted his staff and blasted Zhang Yang with {Shadow Arrow}.</p><br/><p>{Charge}!</p><br/><p>Zhang Yang glided through the floor and attacked the boss. Once Zhang Yang had landed his attack, both the Phoenix and Felice started their attack. Both of the Battle Companion and the Battle Mount had reached Level 160. Their combined DPS had reached as high as 50,000, which was almost as high as Zhang Yang's DPS. The Phoenix will continue to upgrade its tier, turning into a Holy tier battle mount after Level 170. Sadly, if Felice's seal is not broken by then, perhaps both her Level and tier would not increase any further.</p><br/><p>Technically, Zhang Yang would only need 40 seconds to kill the boss. On the other hand, the boss would only need half of that time to kill Zhang Yang. With brute force alone, Zhang Yang will die. Hence, Zhang Yang had to use a variety of skills to survive the battle and kill the boss. With {Shield Wall} lasting for 10 seconds, and the use of {Shadow of the Void} to allow Felice to take charge of the aggro control, he could easily outplay the boss' DPS. It was easy enough for Felice to tank the boss in her {Spectral Tiger Form} since she would have 610,000 HP.</p><br/><p>The boss' recovery skill was nothing much to be concerned about, for it only heals 85,000 HP once. At most, each healing instance could blot out one instance of attack. Hence, in just 40 seconds, the boss died and rewarded Zhang Yang with a pile of random items.</p><br/><p>Zhang Yang picked up all the items and found some rather valuable loot. There was one Mythical tier equipment, three Violet-Platinum tier equipment, and the rest was considered to be junk.</p><br/><p>[Blouse of the Shadow Death] (Mythical, Cloth Armor)</p><br/><p>Defense: +32</p><br/><p>Vitality: +2371</p><br/><p>Intelligence: +1096</p><br/><p>Spirit: +484</p><br/><p>Equip: Increases Maximum MP by 2,190.</p><br/><p>Equip: Increases your damage and healing rate by 3.5%</p><br/><p>{Unidentified}</p><br/><p>Level Requirement: 160</p><br/><p>Shadow Death Set Equipment (1/5): {Hat of the Shadow Death}, Blouse of the Shadow Death, {Glove of the Shadow Death}, {Boots of the Shadow Death}, {Tights of the Shadow Death}.</p><br/><p>Three Equipment Set Effect: Increases magic damage and healing rate by 20%</p><br/><p>Five Equipment Set Effect: Upon receiving an attack, there will be a 1% chance to send yourself into the Nether Realm for 3 seconds. You cannot be targeted by both enemies and allies alike.</p><br/><p>Set equipment! Not bad!</p><br/><p>What a rare encounter, considering that fact that it had been a while since Zhang Yang last saw a set equipment. Though the Three Equipment Set Effect could add 20% damage, it was not enough to compensate for the difference of tiers between higher tiers. Still, it was valuable to other players who could never get their hands on Ethereal tier!</p><br/><p>Perhaps, there was a chance that each of the towers in the vicinity would have a mini boss inside. If Zhang Yang is to clear all the towers, he could farm all the required set equipment and sell them as a complete set in town for several hundreds of thousands gold coins.</p><br/><p>Zhang Yang took out two [Chicken Burger]. As his HP was too long, eating just one [Chicken Burger] could only heal him by 500,000 HP. It was not enough.</p><br/><p>As mentioned before, Battle Companions were like players. They could use [Bandages] and consume items to restore their HP. For Felice, one [Chicken Burger] was more than enough to restore all her HP. As for battle mounts, their HP would automatically regenerate once they leave the combat mode. Their HP regeneration rate was so strong that they could completely heal themselves back to full health in only 30 seconds.</p><br/><p>Zhang Yang proceeded on to the third floor and the monsters had changed again. From skeletal soldiers, to Spectre Wizards, the third floor monsters were all rotten, zombie-like monkeys. A single jump of them could send them coming from as far as several meters away. It was completely unlike those Spectre monsters!</p><br/><p>[Warfront Death Leaper] (Elite, Spectre)</p><br/><p>Level: 165</p><br/><p>Defense: 6,640</p><br/><p>Melee Attack: 37,947 – 57,947</p><br/><p>Skills:</p><br/><p>[Leap]: Leaps towards the target. Can leap over obstacles.</p><br/><p>[Death Blade]: Deals 150% melee physical attack. Cannot be evaded. Cannot be blocked. Reduces the target's healing rate by 50%. Last for 10 seconds.</p><br/><p>Compared to the magic type monsters back, Zhang Yang was completely unfazed by the strength of the monkeys. With his super-powered defense, he would normally take only 13,000 damage from a monster with 50,000 attack power. However, the skill [Leap] might prove to be a little troublesome. Hence, Zhang Yang played it safe and only drew in two at a time. Luckily, he had a lot of [Chicken Burger] courtesy of Han Ying Xue, allowing him to survive many battles!</p><br/><p>A typical Level 120 recovery snacks cost 2 gold coins each, whereas the Level 150 [Chicken Burger] were even more expensive. On the other hand, the [Chicken Burgers] can never be found elsewhere. It can only be crafted. The only method of obtaining it is to buy it from players or make it themselves by hunting chickens, pluck peppers, and buy flour from shops. It will be expensive.</p><br/><p>Suffice to say, 5 gold coins each was a good deal. At most, it could cost the exact same price as a real-life chicken burger! However, in reality, how many burgers could you eat? Only Zhang Yang could spend a fortune and eat all those burgers in the game. Typical players would rather pair up with a Priest or a Sacred Knight to save up unnecessary spending. </p><br/><p>That was one of the main reason why healers were weak in attack, yet were extremely welcome in an outdoor party.</p><br/><p>There was a total of 30 Leapers on the third floor. As Zhang Yang kills two monsters at a time, he took close to 39 minutes to clear the entire floor. Similarly, there was a mini boss standing guard at the entrance of the fourth floor.</p><br/><p>[Warfront Death Leaper Captain] (Mythical, Spectre)</p><br/><p>Level: 170</p><br/><p>HP: 8,500,000</p><br/><p>Defense: 7,000</p><br/><p>Melee Attack: 40,774 – 60,774</p><br/><p>Skills:</p><br/><p>[Leap]: Leaps towards the target. Can leap over obstacles and stuns the target on impact for 2 seconds.</p><br/><p>[Death Blade]: Deals 200% melee physical attack. Cannot be evaded. Cannot be blocked. Reduces the target's healing rate by 50%. Lasts for 10 seconds</p><br/><p>Despite having the same skills as the elite version of the Leapers. The boss' skill had an extra stunning effect and an extra 50% added damage. The difficulty had only been increased by a tiny notch.</p><br/>\n</div>"}