{"title": "Chapter 733: Ancient Spiritual Beast King", "id": 733, "volume": 8, "url": "http://boxnovel.org/mmorpg-rebirth-of-the-legendary-guardian-chapter-733-ancient-spiritual-beast-king", "volume_title": "Volume 8", "body": "<h1>Chapter 733: Ancient Spiritual Beast King</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 733: Ancient Spiritual Beast King</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Zhang Yang planted the boss and quickly signaled the retreat. However, only after 2 seconds, the bomb exploded prematurely. The explosion was so strong that everyone, including the heavily armored Zhang Yang was blasted away like paper planes in a storm. Worst of all, the explosion almost took off all their HP. </p><br/><p>What a useless Goblin tech…</p><br/><p>Everyone stopped their tracks to rest and recover their HP. Fatty Han had panicked at the last second and quickly morphed into his bat form to suck on Endless Starlight's HP.</p><br/><p>The quest had ended, yet their Transformations had over 1 hour of active duration remaining. Since it would be waste to let it expire, the party decided to go their own way to grind. After the Transformations ended, they regrouped back at Souron's Castle and teleported back to White Jade Castle to submit the quest.</p><br/><p>'Ding! You have completed the quest: Destroy the Mithril Refinery. Obtained 10,000,000 Experience Points, 500 Military Points!'</p><br/><p>Everyone got their reward successfully and was not impressed by the experience points. It was rather bad since 10 million experience points was only the same as two elite tier monsters. Still, they were all satisfied with the 500 Military points given.</p><br/><p>\"Haha! Not bad for some scrawny humans,\" said Gulaj. He then stood on a chair and said, \"I have some bad news. Even though the Spectre have lost their main production of Mithril, they were still able to buy from…*ahem*. They were still able to obtain their Mithril from my brethren. The production of Darkness Fall is still going on!\"</p><br/><p>\"Heroes. Do not fret. There is still hope for the land. Right now, you can still put a stop to Darkness Fall by destroying their Energy Crystal Processing Base Factory! Without enough Energy Crystals, they will be unable to continue their research for Darkness Falls!\"</p><br/><p>'Ding! Gulaj has a quest for you: Destroy the Energy Crystal Processing Base Factory. Will you accept it?'</p><br/><p>What treachery! How could the goblins be selling their Mithril to the enemy!? What a money-minded bastard! Their greed for gold was far worse than the Dwarves!</p><br/><p>Everyone nodded their heads to accept the quest.</p><br/><p>[Destroying the Energy Crystal Processing Base Factory] (Difficulty Level: S)</p><br/><p>Description: Gulaj wants you to destroy the Energy Crystal Processing Base Factory of the Spectre. By destroying their base, they were unable to continue their research to finish Darkness Falls. According to Gulaj, the Energy Crystal Processing Base Factory is located in the Antijar Basin of the Volcanic Dragon Mountain. Be warned, the Spectres have reinforced their defenses. You must bring a team of strong adventures to survive.</p><br/><p>Participant Limit: 10</p><br/><p>Progress: Destroy the Energy Crystal Processing Base Factory</p><br/><p>Quest Reward: +20,000,000 Experience Points, +500 Military Points</p><br/><p>\"Here. Take his. I have made some modifications to it myself. I can assure you that it will not be like the last time,\" said Gulaj as he dropped a stack of rolled explosive that looks exactly like the one you can see in Looney Tunes. Acme, to be exact.</p><br/><p>Everyone rolled their eyes. So what if Gulaj has personally modified it? It would just be the same! The only difference it had was the name!</p><br/><p>Just when the party was about to leave for the quest, a group of women players came to the NPC. They were the elites of Crimson Rage, including Snow Seeker. It would seem that she, Mellow Venom, and Thorny Rose were the main attacking force for Crimson Rage. At that moment, they had just reached Level 160 and probably was rushing over to start the Spectre Invasion quest line.</p><br/><p>\"Hello, guild master Zhan Yu. What kind of quest did you receive? Would it coincide with ours?\" said Snow Seeker with such elegance that she was Zhang Yang elder sister. It was extremely polite and sweet yet Zhang Yang knew better. She was merely acting that way. If anyone falls for her sweet talks, they would be completely swallowed by her!</p><br/><p>Wei Yan Er was the fastest then and had already shared the quest description to her. After a long, hard look, Snow Seeker laughed bitterly and said, \"Ah. It seems that there will be a problem. It's the same as ours.\"</p><br/><p>Everyone was puzzled. They knew that they had only just killed the boss for the previous quest. It was impossible that the system would refresh the quest when some else receives the same quest. Hence, Zhang Yang reached a conclusion. The previous quest will only unlock the subsequent quests which could then be taken by anyone. There will never be a case where one side will be the best. That will eliminate all contenders. It would be fair since if a party is unable to complete the quest, they could never proceed any further. To be fair, if the party fails to destroy the Mithril Refinery, the Spectre would have won, then, wouldn't they?</p><br/><p>Hence, the last battle with Angus required players to complete all the quests until Angus himself is forced to show up on the battlefield. That, or the minions of Spectre will keep spawning in towns to disrupt peace. Nothing too damaging, but just enough of a bother for players to get off their *sses and solve.</p><br/><p>Using the quest unlocking system, every player will have a chance to try out the quest even if they could never succeed in beating it. Hence, they will gain familiarity with either the monsters or the final boss fights until they could actually complete it. That is, if they were strong enough to endure the repetition.</p><br/><p>Yet, the main story quest for the Spectre Invasion was available for all, but could only be completed by one party, and that party will be the only party receiving the reward. Technically, there was no limit as to how many parties could try to defeat the boss.</p><br/><p>Two parties stood still, 20 pairs of eyeballs glared at each other awkwardly. When Wei Yan Er made a sudden jerk, the Crimson Rage party responded by quickly taking out their [Teleportation Scrolls] to leave the place immediately. Lone Desert Smoke followed later, a split second slower. Only one party could receive the reward. That would only mean that the quest completion will be a race! A race of countless parties around the world that had reached Level 160! The competition is hot and running.</p><br/><p>Zhang Yang was the only one amongst them who chose to stay at White Jade Castle to socket his new equipment. After enhancing them, he would then teleport to Han Ying Xue using the [Lover's Charm]. A Level 6 Strength Gemstone could provide 200 Strength. Same goes for Dexterity. By enhancing the Gemstone, Zhang Yang could increase the value by 50%. Since the equipment could socket two Gemstone at a time, that would be 600 attribute points. Be it Strength or Dexterity, both were fairly important for Zhang Yang and Sun Xin Yu!</p><br/><p>After equipping his new weapon, Zhang Yang's attack power was at 154,194 – 182,194 after calculations. Since {Vitality Aura} had reached its max level, the bonus it provided was now up to 40% Vitality. Even though weapons will not provide Vitality points, his HP was already boosted to 1,140,490. And that was only in his normal state!</p><br/><p>Zhang Yang was quick with his hands during socketing and quickly teleported back to the party and found Crimson Rage's party was slower. They were frantically chasing them.</p><br/><p>Snow Seeker was determined to stick to Zhang Yang's party - no matter what. Since the quest had a participant limit of only 10 players, if the quest i similar to the previous quest, Snow Seeker would still have a chance to plant the bomb first after Zhang Yang defeats the boss.</p><br/><p>Main story quests had a Unique attribute to them. Once they have been completed by a party, the quest will automatically be deleted from all players who have accepted the quest.</p><br/><p>The problem lay with both Zhang Yang and Snow Seeker, or rather Lone Desert Smoke and Crimson Rage. During the fierce battle in Souron's Castle, Crimson Rage was the one guild that stood by Lone Desert Smoke till the end. They were a great help to Lone Desert Smoke. That goes without saying. Hence, Lone Desert Smoke would never turn their backs to them or play them out!</p><br/><p>Snow Seeker had anticipated that, and pressed on the chance that they could still obtain the quest reward. Even though technically both guilds had a 50% chance to complete the mission, in reality, Crimson Rage only had a small 10% chance to overthrow Lone Desert Smoke.</p><br/><p>Naturally, Snow Seeker was no god. She could not have known the difficulty of the boss and that Zhang Yang's party had already used their Transformation skill. Toe to toe, Snow Seeker's party would have the upper hand since all of their party members had their Transformation skill ready for the final boss. However, based on the conditions of the battlefield, they might need a few days to clear all the monsters, just like the Refinery. That time alone was enough for Zhang Yang and his party to finish their Transformation cooldown. Hence, Snow Seeker's plan will still go on.</p><br/><p>After flying for 10+ hours, the party had finally left Mar Gaia Forest, through the Forest of Clouds and entered the Antijar Basin. The party took 3 to 4 hours more to reach their final destination, the Volcanic Dragon Mountain.</p><br/><p>\"Pfft. How does the mountain look like a dragon?\" said Endless Starlight, unimpressed when he saw the scenery. The mountains were covered with red maple trees that dyed the entire landscape with a deep crimson red. However, only the color matched its name, not the shape or size. There was nothing of the mountains that depicted a dragon.</p><br/><p>\"Don't mind that. Find the factory!\"</p><br/><p>At that moment, Lone Desert Smoke was still leading, with the girls of Crimson Rage far behind. Zhang Yang reached the peak of the mountain and spotted many elemental beings. There were stone, fire, water, and air elemental beings all busy roaming around on a mushroom-like structure.</p><br/><p>Zhang Yang selected the structure and was shocked to see that the structure was a living being!</p><br/><p>[Spiritual Beast] (Elite, Elemental Being)</p><br/><p>Level: 175</p><br/><p>HP: 50,000,000</p><br/><p>Defense: 10,000</p><br/><p>Magic Attack: 60,175 – 90,175</p><br/><p>Skills:</p><br/><p>[Light Energy Ray]: Blasts out a destructive ray and deals 200% magic Natural damage to a target. Range: 50 meters. Instant. Cooldown: 2 seconds.</p><br/><p>[Exploding Energy Crystal]: Hurls Energy Crystals from its body to all targets within 50 meters. Deals 100% magic Natural damage. Stuns the targets for 3 seconds.</p><br/><p>Note: The Spiritual Beast can naturally produce Energy Crystals via combining the light of the sun and Carbon Dioxide. Only Elemental Beings and the Spiritual Beast are close. Any other beings that attempts to get close will lead to his self-induce explosion. Permanently stationary.</p><br/><p>\"Oh! So the Energy Crystal that we have been using to power the Teleportation points comes from this big *ss dickhead!\" Fatty Han exclaimed.</p><br/><p>The man was never one to sugarcoat his words. Hence, the women around him were greatly offended. Of which, he did not give a single f*ck.</p><br/><p>Zhang Yang scouted the area and could not find a boss or a point of indication of where to plant the bomb. Zhang Yang sighed heavily as he realized that this mission will be the same as the previous one. Only by killing monsters, will the quest proceed.</p><br/><p>\"So, where do we start?\" asked Hundred Shots.</p><br/><p>There were four large areas, separated by elemental beings.</p><br/><p>\"Let's start with the Air elementals first.\" Said Zhang Yang. Fire and Water Elemental being will surely be magic attack type. Earth elementals will have superior defense, hence, the most logical and easiest target to start with would be the Air elementals.</p><br/><p>Now, Crimson Rage was separated from Zhang Yang. The girls chose to attack the water elementals first, but will immediately change their position if the boss does appear.</p><br/><p>Sadly, unknown to Zhang Yang, Fatty Han had betrayed Lone Desert Smoke by succumbing to the draws of the lustful woman of Crimson Rage. He had offered up the information of the quest of the Mithril Refinery to them, allowing the girls to understand everything they needed to know about the mission.</p><br/>\n</div>"}