{"title": "Chapter 736: Apocalyptic Bondage", "id": 736, "volume": 8, "url": "http://boxnovel.org/mmorpg-rebirth-of-the-legendary-guardian-chapter-736-apocalyptic-bondage", "volume_title": "Volume 8", "body": "<h1>Chapter 736: Apocalyptic Bondage</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 736: Apocalyptic Bondage</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>God’s Left Hand was occupied. Heart of Destruction was engaged in a fierce battle. So who was left to stop the greatest threat of all time, Zhang Yang?</p><br/><p>No one!</p><br/><p>Hourglass Figure and the members of the Land of Savages were engaged in a fierce battle with two parties that held quite some grudges against them. So there was no way that they would cut in to stop Zhang Yang.</p><br/><p>Zhang Yang, Wei Yan Er. Felice and the Phoenix pet formed together to become a force so powerful that no one could reckon with them anymore! Furthermore, Zhang Yang’s {Destructive Smash} could cause all his enemies to suffer a 75% reduction in their Healing Efficiency. Whoever who gets targeted by them, would be as good as dead, even if that player activates a Class B Inheritance Transformation!</p><br/><p>Unfortunately, no one on the battlefield had a milky-light shining down on their heads. Obviously, none of them had come across any broken chapters of the [Book of Revelation] recently. Zhang Yang could only sigh and rant. Captain America and God’s Left Hand must have slacked off too much because they had yet to locate the other chapters yet even after they had so much time after their last encounter.</p><br/><p>So, how would Captain America and God’s Left Hand feel if they ever find out about Zhang Yang’s rant concerning them?</p><br/><p>Even though everyone had basically moved their focus onto the PvP matches, they could still deal quite a remarkable amount of damage to the boss whenever they used their AoE Skills --- the body mass of the boss was just too large! Everyone was basically battling on top of the mushroom head of the boss! Well, there was no doubt that the splash attacks of their AoE attacks would burn the boss as well!</p><br/><p>However, the HP bar of the boss was reducing at a much slower pace, because the boss was only suffering damage from players’ AoE Skills. Everyone had the same mentality this time. Clear out every single enemy in the vicinity before focusing back to the boss. Well, it was true that the players could take their own sweet time to kill the boss when there are no enemies left around them. Upon killing the boss, they could also claim the loot all to themselves!</p><br/><p>Quite a number of weaker parties began to form alliances among themselves. They intended to work together to take down the parties that were stronger than them. After they could finally take out the stronger parties, they would dissolve their Alliance and battle against each other. Well, survival of the fittest! Therefore, there was no guarantee that the strongest party would be able to last till the end, because of that. After all, everyone here should at least have a certain level of skill to make it into this map. Other than players who held a Class S Inheritance or a Class A Inheritance such as Zhang Yang, Sun Xin Yu and Hourglass Figure, the other players would almost be at the same standard in terms of their skills and experiences.</p><br/><p>For instance, Lone Desert Smoke was deemed to have the strongest party of 10 in the entire server. However even they could not take it all if 4 parties formed an Alliance to take them on! If it wasn’t for Crimson Rage and Hell Family, the entire party might get wiped out eventually. Or maybe, Zhang Yang, Sun Xin Yu and Han Ying Xue who had a Class S Inheritance might survive the onslaught.</p><br/><p>\"Take out Zhan Yu first!\" Everyone from any of the four parties were screaming and shouting the same thing. That ‘godly’ existence must be eliminated first if they ever want to win the battle. Everyone already knew about Zhang Yang’s {God of War Devastation} and {Charge Up Strike}. If he ever managed to accumulate 39 EP over a battle, Zhang Yang would pump up his Attack by using {Charge Up Strike} before giving a full powered blow on his opponent with his {God of War Devastation}. That one single strike after the {Charge Up Strike} could cause devastating damage to 40 players at the same time!</p><br/><p>With Zhang Yang’s current Attack power, that single attack from his {God of War Devastation after activating his {Charge Up Strike} could reach up to 4,500,000 damage! That strike could deal that high damage to every one of them within the effective range of the Skill! That was the terrifying part of it! However, even though Zhang Yang’s party had formed an Alliance with the Hell Family, the system would not recognize that. Zhang Yang’s attack would still spread and hit the members of the Hell Family like they were also the enemies --- well, who would still have the time to think about all that? Even if Zhang Yang really collaterally hit the members of the Hell Family, only the 10 members of Hell Family would become the collateral damage of the battle. As long as Zhang Yang could accumulate another 10 EP, he would be able to get things done!</p><br/><p>Accumulating 50 EP would require 500 seconds. If Zhang Yang goes out explosively like that once in every 500 seconds, combined with the attacks from the others around him, God’s Left Hand and his goons would definitely be wiped out eventually! Maybe God’s Left Hand and Heart of Destruction could use their fast movement speed they obtained by having a Class S Inheritance, but the other members of their party would definitely be splatterd! So what would be the point of only the two of them surviving by the end of that?</p><br/><p>Therefore, their first target must be Zhang Yang, the biggest threat of all time!</p><br/><p>\"Hahaha!\" Zhang Yang laughed out loud. He noticed that everyone was aiming their guns at him. However, he did not show any signs of retreating. Instead, he went all out on them. The Reaper charged up to Zhang Yang and began to whirl his weapon like a hurricane.</p><br/><p>\"Are you in a hurry to die?\"</p><br/><p>\"You arrogant f*ck!\"</p><br/><p>\"Just f*ck him up!\"</p><br/><p>The players from the Alliance of the four parties were infuriated by the arrogant attitude on Zhang Yang’s face. They began to launch their most powerful attacks on him. They were venting their rage onto Zhang Yang.</p><br/><p>{Tribulation} activated! {Shield Wall} activated! {God of War Shield} activated!</p><br/><p>Bring it on! The harder they hit the better!</p><br/><p>Countless attacks landed on Zhang Yang. However, at the same time, countless attacks were reflected back at those who were attacking Zhang Yang! High values of damage were dealt right back at the attackers!</p><br/><p>Zhang Yang looked literally like a hedgehog. The attackers could still deal damage to him. Well, at least their attacks were reflected back at them. Meanwhile, with Zhang Yang’s current Defence, the attackers could only deal about 100,000 damage to him, with each of their attacks. However, Zhang Yang could reflect about 200,000 damage back at the attackers. What’s the point of even fighting?</p><br/><p>Especially after Zhang Yang had activated his {Shield Wall}, Zhang Yang would have over 80,000 Defence upon activating his Inheritance Transformation. There would not be any Physical attack that could penetrate that amount of Defence within these 10 seconds. Even of any Spell attacks could land on Zhang Yang, they would not be able to deal much of a damage to him. However, some of the attacks from his enemies were even resisted!</p><br/><p>So no matter what, every single attack that landed on Zhang Yang would be reflected back to the players who attacked him! No one in the current stage of the game could have such an ability to reflect attacks! Hitting on Zhang Yang was like hitting yourself with all you got!</p><br/><p>Furthermore, Daffodil Daydream, Snow Seeker and the others would not just stay idle. They were also dealing damage from aside. Receiving attacks from both sides, these players who were surrounding Zhang Yang instantly suffered a tremendous reduction in their HP!</p><br/><p>Dumbfounded!</p><br/><p>They just stood there dumbfounded!</p><br/><p>They were really dumbfounded!</p><br/><p>What the hell! How could there be such an insane Skill in the game? How could anyone have survived that!</p><br/><p>\"Stop attacking Zhan Yu now!\"</p><br/><p>\"F*ck your mother! I almost got killed because my attacks were reflected back at me!\"</p><br/><p>The best way to handle the {Tribulation} would be to let one person kite Zhang Yang around for over 10 minutes. After all, the {Tribulation} can basically reflect everything back at any attackers that attempt to attack Zhang Yang. As long as no one tries to deal any damage or a very low amount of damage on Zhang Yang, {Tribulation} would basically become useless.</p><br/><p>However, the most important thing was that even if Zhang Yang did not have his {Tribulation}, he would still be as powerful as a god-slayer! They ganged up on him because they were afraid of his terrifying attacks. The situation became awkward for Zhang Yang’s enemies because whoever tried to attack him, they would be receiving back a damage value that was higher than the damage they dealt on him. Well, hitting him was like hitting themselves even harder! So they stopped their assaults on Zhang Yang for the moment.</p><br/><p>There was only one word to describe their situation right now. Pathetic!</p><br/><p>How about trying to use Status Restriction Skills on Zhang Yang? Well, Zhang Yang could just use his [Mobility Potion], {Warrior’s Will}, or his other Accessories to break free from the Status Restriction Effects! Furthermore, it was not like all 40 of them were battling against one Zhang Yang. Some of them were preoccupied with their own opponents at the moment. They did not get much chance to really focus their firepower on Zhang Yang. If only they could focus all of their attacks on Zhang Yang all the time, they might have a slight chance of taking out Zhang Yang.</p><br/><p>Zhang Yang laughed out loud and whirled his ‘death scythe’ at his enemies. His God of War EP was slowly accumulating!</p><br/><p>{Charge Up Strike}!</p><br/><p>{God of War Devastation}!</p><br/><p>Shoof! A shadow of an axe flashed across the battlefield. 36 players received a damage of 4,500,000. Because Zhang Yang had activated an AoE Skill that spread out wide into the surrounding, not only God’s Left Hand and Alliance members were inflicted with damage, even the boss and a few unfortunate members of the Hell Family were caught in the blast!</p><br/><p>His attack was totally dope! Players who activate their Class B Inheritance Transformation lost over half of their total HP! Meanwhile, judging from the intensified situation of the battle, Healers were not able to do a thing to support them. Most of them lost more than 50% of their total amount of HP! It would already be a fortunate thing if their HP did not go down below 20%!</p><br/><p>Right after that strike, about 20 players were instantly killed! They turned into streams of white light and reported themselves at the Graveyard!</p><br/><p>\"Wah! Noon tank, that Skill is too awesome!\" Wei Yan Er’s eyes were widened and glittering. Even though she also had her own powerful AoE Skill, that was only 8 times stronger than her Strength attribute. She could only deal approximately 140,000 damage to each of her enemies within her attack range. The damage that Zhang Yang’s {God of War Devastation} could deal would be far more than that!</p><br/><p>However, both {God of War Devastation} and {Charge Up Strike} had over 1 minute of cooldown period. Furthermore, Zhang Yang needed to accumulate a certain amount of EP before he could deal that much of a damage to all his foes. It was not like he could just use it anytime and anywhere he wanted.</p><br/><p>Facing such an insane attack from Zhang Yang, the Alliance of the four parties were began to falter. Having a god slayer as their opponent, they had no idea how to win the battle.</p><br/><p>\"Zhan Yu! I’m your opponent!\" God’s Left Hand managed to tear himself off Endless Starlight. He fluttered his wings and flew up to Zhang Yang. Well, he was probably the only one who had enough Defence and Healing power to make up with the reflective ability of Zhang Yang’s {Tribulation}. He is probably the only one who could hold Zhang Yang off from unleashing hell upon his newly formed Alliance!</p><br/><p>\"I’m not going to waste my time on you! Pui!\" Well, there was nothing beneficial getting himself engaged with a player that has a high Defence and a high Healing ability after all. Zhang Yang did not even look at God’s Left Hand. He continued to whirl about his weapon at the other members of the Alliance an in attempt to kill as many of them as possible.</p><br/><p>\"Argh ---\" God’s Left Hand felt so humiliated that he let out a raging roar. He swung his left hand and threw a beam of white light onto Zhang Yang. The white light sank into Zhang Yang’s body immediately.</p><br/><p>[Apocalyptic Bondage]: Makes the target focus only on you. Lasts for 10 minutes.</p><br/><p>This was a new Skill that God’s Left Hand had learned when he reached Level 160. It was a Skill on the same level as the {Tribulation}. However, this Skill could forcefully acquire aggro from the target!</p><br/><p>Instantly, Zhang Yang was like entered a state of ‘void’. Other than God’s Left Hand, everyone had vanished without a trace! In other words, other than God’s Left hand, he could not battle anyone else!</p><br/><p>What an impervious Skill! What the f*ck!? That had really ‘disabled’ Zhang Yang from the battlefield for good!</p><br/><p>{Warrior’s Will}? Ineffective!</p><br/><p>Invincibility Effect from his other Accessories? Ineffective as well!</p><br/><p>The feeling was akin to how Captain America and the others felt with his {Tribulation}. Zhang Yang was annoyed and irritated by this {Apocalyptic Bondage} as much as that!</p><br/><p>\"God’s Masturbating Left Hand! If you really wanted me to kill you so badly, I’ll satisfy you! I’m a simple man!\" Zhang Yang slit over to God’s Left Hand in lightning speed and swung his ‘death scythe’ straight at his neck. However, Zhang Yang was reserving all of his AoE Skills for the moment.</p><br/><p>Although he could not see the others in his surroundings, that did not necessarily mean that he had vanished from the battlefield and ended up somewhere else. Well, a single unit attack could not land on anyone when the player is unable not lock on onto the target. However, an AoE attack did not require the player to lock on their targets in order to hit their foes. As long as their targets are standing within the effective range of the AoE attack, they would surely be hit by the impact of the Skill!</p><br/><p>As expected, Hundred Shots and the others immediately reported back to Zhang Yang after Zhang Yang struck out with his {God of War Crushing Strike} --- effective! Their enemies had been hit by the impact of Zhang Yang’s devastating Skill!</p><br/><p>However, Zhang Yang was still better at focusing his attack on one single target. Although the impact of his {God of War Crushing Strike} could spread out quite a distance, each strike could only deal an AoE attack of 180,000 Damage. Furthermore, Zhang Yang would need 30 seconds just to accumulate 3 EP. Actually, that was quite similar to the boss’s {Timed Energy Charge}. It would not cause much harm to players who had activated their Inheritance Transformation. Well, at least the threat he posed was not fatal.</p><br/><p>Zhang Yang’s Inheritance had really showed the others how a high Attack power looked like! The name of the God of War prevails. Meanwhile, God’s Left Hand was more focused on protecting his party members. The {Apocalyptic Bondage} that was cast on Zhang Yang had crippled his Attack power. Zhang Yang had been restrained so badly that he could only move around like a blind man. If it weren’t for the {Tribulation} that he activated on himself, Zhang Yang would have been struck down by the attacks from all of his enemies in his surroundings!</p><br/><p>Never underestimate a Class S Inheritance Transformation! Not even a little! Every single one of the Inheritance Transformation in the game had their own unique traits. After all, Class S Inheritances were unique in their own way, in which only one person would have one Class S Inheritance!</p><br/><p>Zhang Yang began to unleash his attacks on God’s Left Hand like a crazy person. Meanwhile, God’s Left Hand was attempting to delay the inevitable. He was defending himself against Zhang Yang’s assaults while trying to heal his party members. He did a remarkable job in both defending and healing.</p><br/>\n</div>"}