{"title": "Chapter 747: A Losing War", "id": 747, "volume": 8, "url": "http://boxnovel.org/mmorpg-rebirth-of-the-legendary-guardian-chapter-747-a-losing-war", "volume_title": "Volume 8", "body": "<h1>Chapter 747: A Losing War</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 747: A Losing War</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>The key to defeating Angus is to not die by his hands. A single death will only restore 1% of his health. That number would be as high as 230,000,000!</p><br/><p>No wonder none had managed to kill Angus at the first try! Using massive numbers to defeat the boss was not only inefficient, but would also give free health to the boss! However, the current player’s Levels were so low, no one would be on par with the boss! The only way of surviving the war and defeating the boss was to rely on the NPC!</p><br/><p>The problem was that the system had not made things that simple. In his previous life, the NPCs had gone through seven attempts and was only able to defeat the boss on the eighth attempt, only when the NPCs had been greatly strengthened. Sadly, due to their failure, Angus’ death had only dropped four random Celestial non-set equipment.</p><br/><p>As the battle started, some lazy players skipped over the examining the boss’ skills and charged into the frontline and died blindly. Hence, if no one takes the helm in leading the mass players, the boss will be completely immortal. No one can defeat the boss, even if players have Celestial bosses at their aid!</p><br/><p>\"Impudent Spectres! You dare invade the White Jade Empire?! I shall have your head on a stake! Let that be a lesson to all Spectres! No! Perhaps I shall wipe all Spectres off the face of the world!\" Serena leapt off the watch tower and flew, without wings, towards the center of the battlefield. With quick reflex, her royal gown was immediately transformed into a grand combat gear. She pulled out her sword and was ready to charge.</p><br/><p>\"Such a bold human female…Now your place. It is I who shall wipe all humans! Heed my words and surrender to darkness!\" Angus laughed and threw out a long, thin blade out of the air and used it to charge towards Serena.</p><br/><p>\"Sword of Life and Death!\" Serena cried out and unleashed her ultimate skill to face the strong Angus. Sadly, even though she could inflict as much as 600,000 damage, it was merely a tiny itch for the Celestial tier boss!</p><br/><p>\"HMPH!\"</p><br/><p>With a quick swing of his sword, Angus struck Serena. Although Serena had managed to parry the sword swing, she was blown away as if she was weightless.</p><br/><p>\"Weak…\"</p><br/><p>The Queen emerged out of the crater that she was blast into and forcefully tore off her right shoulder plating. \"Curse you Spectres!\" She concentrated her powers into the Meteor Sword. The blade glowed with an intense white radiance.</p><br/><p>\"Holy Light, Cross Soul Slash!\" </p><br/><p>\"OOFH!\" Angus grunted with pain. Serena’s attack was of Holy attribute, which was extremely powerful against the Spectres. With the godly power of the Meteor Sword, she was able to deal more than millions of damage.</p><br/><p>\"Seems like you’re all but talk. Come at me, evil being. I shall purify you!\"</p><br/><p>\"Watch your words, little girl. I am the Lord of the Seven Kings.\"</p><br/><p>\"Lord or not. You’re nothing but a monster that I will destroy.\"</p><br/><p>Serena stomped her feet into the ground and kicked herself off at supersonic speed to clash against Angus. As such, the two bosses started exchanging blows. Even though Serena had the advantage of her Holy attribute and was using it to overwhelm the boss, Zhang Yang had no confidence in her. The boss had that OP healing ability. A single use of {Blade of Obliteration} could kill many players around 500 meters from where he stood. At the rate of things, Angus will never have his HP lowered!</p><br/><p>Ever since the start of the battle, Angus had been an indestructible boss! However, Serena was no ordinary Ascended tier boss. She wields the Meteor Sword, hence, even though she will have trouble killing Angus, she, herself had proved to be extremely tough to kill as well!</p><br/><p>\"Feel despair!\" Angus bellowed and swung his sword hard, downwards to cleave Serena. With great power, she held her stance even as her feet slid back and block the downward slash with all her might. The resulting impact was so powerful that the impact had blasted off a wave that sent the earth around her cracking and scattering into sand. Serena borrowed the momentum of the boss’ swing and spun around the air to slice at the boss from the sky. The sword landed cleanly on the boss and had ever more destructive power that a power compressed air blasted the sky, sending the dark clouds to scatter away. For a glimpse, the sun’s rays were able to shine upon the land of darkness.</p><br/><p>Players had not surrounded Angus for they realized their own strength was lacking. The only choice they had was to fight the smaller ones to earn a few experience points.</p><br/><p>Now that Queen Serena was in the battle herself, Zhang Yang had no reason not to attack. He called forth his Phoenix and rode the bright burning bird downward. Unfortunately for Zhang Yang, when Angus had made his appearance, the Spectre forces were already on the verge of being wiped out. Hence, after only 30 minutes or so, Zhang Yang had cleaned the entire battlefield up. Angus was the only Spectre left standing.</p><br/><p>Without players coming forth to attack him, Angus had long since cut down a player. Hence, uninterrupted, Queen Serena had hacked his HP down to the last bit.</p><br/><p>As expected of the Queen of the White Jade Empire, a character who never even came to being in his previous life and joined the battle of Angus. In fact, she might even be stronger than Angus himself!</p><br/><p>If only there were more strong NPCs like Serena aiding the fight, the boss fight would probably have ended long ago. That is, if stupid players would stop rushing in to die for Angus.</p><br/><p>Zhang Yang hesitated for a moment. There was one question that was circulating in his mind for some time. Should he use his Transformation skill then?</p><br/><p>Besides Zhang Yang, no one else could fight toe to toe with the boss even if they have used their Transformation skill. Angus was a world boss, and his skill {Blade of Obliteration} rage and cooldown were not something to be taken lightly. He could wipe out many players by simply swinging his sword and the occasional use of {Death Cleave}.</p><br/><p>On the other hand, the boss had an average basic attack of 730,000. Under the power of the Level Suppression system, the boss will deal close to double the damage. That means, the destructive power of {Blade of Obliteration} could reach as high as 1,460,000. By average, the boss will use his {Blade of Obliteration} once every 2 seconds. Hence, his DPS would be as high as 730,000. It would take only 14 seconds for the boss to kill someone will 10,000,000 HP.</p><br/><p>Zhang Yang defenses and HP were not strong enough to withstand that amount of damage and survive. Plus, the boss attack attribute was Chaos type; they would never be affected or reduced by Defense or Magic resistances. Even if Zhang Yang was to Transform, he would not last longer than 100 seconds with his 52,000,000 HP!</p><br/><p>That would only mean that S class players like Sun Xin Yu, Han Ying Xue, and himself could only survive damaging the boss for a hit or two before running to safety and to restore their HP. The situation could never be so dire. Just when the boss was overleveled, now, the players would be forced to run out of the attacking rage of 500 meters!? What sort of battle is that?</p><br/><p>It could not be helped then. The current players then, could not even defeat a regular Ascended tier boss, what more a Celestial tier!?</p><br/><p>Right then, a group of players, riding on their flying mounts were flying through the sky to attack the boss. There were not many of them, but merely in groups of a thousand or more. Zhang Yang did not even need to squint his eyes, for their speed was extremely fast. They were all players from the European server.</p><br/><p>\"Take the boss! Get the loot!\" Someone from the group had yelled out and the entire group roared with fervor. They charged into the boss range as if the boss was about to be taken away by someone else.</p><br/><p>\"Stupid fools!\" Players who were standing on top of the watch tower behind the castle wall cursed. A tragic event was about to unfold.</p><br/><p>\"Blade of Obliteration!\" Angus grunted and unleashed his sword swing. Almost half of the players that charged towards the boss died. The other half that survived the swing managed to survive, only because they had already activated their Transformation skill. On the other hand, due to the death of many, many players, the boss had restored his HP back to 100%!</p><br/><p>\"Ignorant fools!\" cried Serena and she pointed her sword up high. Again, she concentrated her powers into the sword and cried, \"Sword of Life and Death!\"</p><br/><p>Shush shush shush!</p><br/><p>Not only was Serena attacking the boss, her targets included the players from other regions, other than China! Since they were not of the same allegiance, the players from Europe were all Serena’s enemies, and her attacks had landed on them as well.</p><br/><p>With two bosses attacking together, players were still being killed, even though they had used their Transformation skills. In less than a few swings, all the C class Inheritance players fell, followed closely by the B class players, and A class players.</p><br/><p>Fortunately, the only S class Inheritance holder, God’s Left Hand was not so stupid to charge at the boss like idiots. Or else, he would be the first S class Inheritance player that would be killed by the boss!</p><br/><p>\"Hahahaha! All who live shall be food for my soul! Come to me and die by my blade! I shall reap your lifeforce!\" said Angus as he restored his HP back to 100% and smiled with such satisfaction.</p><br/><p>\"Insolent fool. Life is not something that belongs to you! Heed my words, O evil lord, I shall cut you down!\" Queen Serena stood strong, even though the situation was extremely dire. It was that stoic stance of a Queen, the utmost confidence in her own power.</p><br/><p>\"Know your place! Fool!\" Angus grunted with anger. The two bosses then continued their swordplay.</p><br/><p>When there’s one idiot, there will be the next, and the next as well. The next group of greedy players that soared towards the boss were the players of India. When they saw how the boss had cut down the players from Europe. They decided to take note of the boss’ skill and carefully examined his attack pattern. As such, there were no second group of idiots that charged into the boss to die.</p><br/><p>No sooner after, players from North America, Australia, and South America had gathered. Obviously, they had obtained the news about Angus and had come over to get the loots. However, the boss was so strong that none of them was able to formulate a battle plan to fight the boss.</p><br/><p>Still, they were players with diehard stubbornness, trying to fight and only managed to deal that 1 pathetic damage. It was a bet, to see if they could deal enough damage to be able to grab the loot later when the boss is defeated. The main problem was that their greed was Angus’s nourishment. Every player that was stupid enough to get close to the boss was killed and was converted to be his HP. As such, Angus HP had never dropped below 95%.</p><br/><p>Even though Serena had devastating powers, her DPS was not as strong as Angus’s HP restoration. As the battle dragged on longer, Serena started to grow weary. The winner of the fight was most definitely getting obvious.</p><br/><p>\"Protect the Queen!\"</p><br/><p>\"Defend her highness!\"</p><br/><p>Soldiers of the Empire rushed over to surround Serena and group peeled off to attack Angus. Sadly, like players, they were not able to even deal any significant damage. Like players, they were only \"nourishment\" for the boss. As time goes, the boss had only become stronger while Serena had only become weaker.</p><br/><p>At one point, Serena’s HP had dropped so low that all the army had rushed into the battle to fight.</p><br/><p>5%...3%...1%...</p><br/><p>When Angus was about to strike the killing blow, Serena’s Meteor Sword glowed with an intense radiance and engulfed Serena, rendering her invulnerable. With a saddened voice, Serena cried, \"Withdraw! All troops, withdraw!\"</p><br/><p>\"Don’t think you can escape the reaper’s grasp!\" Angus moved forward closer to Serena.</p><br/><p>With a quick roar, Serena cleaved the space in front of her and created a break in the spatial dimension. The crack opened wider and became a portal for her to escape. In an instance, the portal closes, leaving the anguished and enraged Angus roaring to the sky.</p><br/><p>As per shown by Queen Serena, all 64 bosses from all regions of the world cannot die. They can only be defeated. How else could they become stronger, then! If they die, they would only become Spectres that would be added to the enemy’s forces!</p><br/>\n</div>"}