{"title": "Chapter 742: The Fall of Mathuven", "id": 742, "volume": 8, "url": "http://boxnovel.org/mmorpg-rebirth-of-the-legendary-guardian-chapter-742-the-fall-of-mathuven", "volume_title": "Volume 8", "body": "<h1>Chapter 742: The Fall of Mathuven</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 742: The Fall of Mathuven</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>The HP bar of the boss had been reduced to 36%. In between that, 10% of the boss’s HP bar was reduced by the special effect of the {Glare of the Death God}. Judging by that alone, the total firepower of the players was looking weak! Meanwhile, the players could only survive for so long because they had the Green Dragon to keep the boss occupied. If the boss could run around as he liked, this battle could have ended far earlier, with all the players being wiped out.</p><br/><p>Zhang Yang’s luck was not really that great that day. Or should we say, that the boss had a high resistance against the {Glare of the Death God}? Look at Zhang Yang. After so many attempts, only one was not resisted. However, because of that one trigger, the boss battle had been shortened by 3 hours! That was quite a marvelous outcome!</p><br/><p>If each of the tens of thousands of players’ 3 hours are added up together, how many hours would that be?</p><br/><p>It was obvious that the boss could not be taken out in a short amount of time. Although player ‘God’s Miracle’ was equal to sleep and rest, it would be extremely exhausting for the brain cells and neurons to get the game working. As night fell, the players began to feel hungry and tired. Therefore, Zhang Yang told everyone to take an hour rest and get their empty stomachs filled.</p><br/><p>--- it would definitely take more than just 3 hours of in-game time to empty out the remaining 36% HP bar of the boss. There was no need to worry about the other players taking out the boss all of a sudden!</p><br/><p>However, they were not able to take their break in peace. They were still worried that the impossible might suddenly become possible. So those who took their meal had logged back into the game after 7 or 8 minutes. On the other hand, Han Ying Xue and Daffodil Daydream were putting on their make up. Zhang Yang rolled his eyes to the back of his skull at the two ladies after he saw them putting on makeup. Well, they’re not going out to meet any guests. So, why the hell are they grooming themselves up nicely? It’s not like anyone other than Zhang Yang would see their faces!</p><br/><p>However, after Han Ying Xue threw a smile at him as she glanced out of the corner of her mirror, he could not help but to feel swayed a little. Instantly, he was thinking of how to let Han Ying Xue ‘welcome’ him as a big guest. Today was Saturday. Zhang Yang did not have to go to the office. Meanwhile, Sun Xin Yu had taken a shift to rest. The little brat had moved back to Zhang Yang’s house for quite a while now. So she did what the other ladies were doing and put the blusher on her face. Well, of course, she turned her own pretty little face into a monkey *ss by the end of it.</p><br/><p>After toying with the cosmetics for some time, she felt bored. So, she went to the side to toy with the little doggie. The doggie was initially hers. However, she left the doggie to starve when it was still a little puppy. It had learned a hard lesson and knew better than to trust the brat. The doggie would not let the little brat hug it at all. It just ran and hid on the lap of Sun Xin Yu. As expected, that little b*tch felt offended without even knowing that she had tortured that poor little soul before. She kept yelling at the doggie with anger. She even pointed fingers at the doggie saying that the doggie was devoid of gratitude after all the time she spent ‘taking care’ of it. Well, everyone knew that this little b*tch was a real b*tch after all.</p><br/><p>After fooling around for a bit, everyone began to log back into the game. No one could really take it easy just yet. After all, the World Boss was not yet being taken care of!</p><br/><p>When they logged back into the game, the HP bar of the boss had dropped to 29%. Well, it seemed that the players would be taking a lot more time in order to kill the boss.</p><br/><p>\"When the HP bar of the boss drops to 20%, the boss is going to spam his {Storm Blades} without stopping at all. By that time, everything will have to depend on players who have Inheritance Transformations, us!\" Zhang Yang assembled the guildmasters of the top Tier guilds. Then he tried to propose a deal with them.</p><br/><p>Indeed, normal players could still be the ‘food for powder’ at this moment. They could still take advantage of the cooldown period of the boss’s {Storm Blades} and contribute a little on dealing damage to the boss. However, when the boss began to activate his {Storm Blades} more frequently than before, normal players would not even be able to get near the boss! Well, even Zhang Yang would fall if he got too close to the boss when the boss was using his {Storm Blades} at a more frequent rate!</p><br/><p>Logically speaking, anyone would take some time to charge over 200 meters just to get to the boss. Even the Phoenix pet needed approximately 4 seconds to fly across that distance. If anyone charges into the effective range of the boss’s {Storm Blades}, that person would have to sustain approximately 700,000 basic damage. Even if Zhang Yang activates his {Vitality Aura}, he would only have over 1,140,000 HP on him. So how many hits could he take with that amount of HP, then? Anyone could do the math.</p><br/><p>Only the players who had activated their Inheritance Transformation were worthy of staying around the boss when the boss enters his ‘Killing Cleave’ stage. Meanwhile, they would have to apply the ‘hit and run’ tactic as well in order to stay alive long enough to kill the boss! Inheritances like Class C Inheritance could boost the player’s HP by 10 times higher. A non-Tanker player with an entire set of Level 150 Ethereal Tier armor set would only have a basic 400,000 HP. The amount of HP the player has could be boosted up to 4,000,000 HP upon activating the Inheritance Transformation. Therefore, the players would have to retreat back to a safe distance in order to replenish their HP bar after hitting the boss for a while. If they do not do that, they would die very quickly.</p><br/><p>However, the players also had the advantage in number. There were a lot of Healers parking themselves just right outside the area of a 200-meter radius around the boss. As long as a friendly unit comes up to them, they would just throw their Healing Skills on the player regardless of which guild the player was from. By doing so, the players would be able to re-engage into battle a little quicker.</p><br/><p>Up until this point, all Regions had formed an unspoken rule. For example, the China Region had taken over the direction of eight and nine o’clock around the boss. The Europe Region had taken over the direction of four and five o’clock around the boss. The Regions had split the boss’s surrounding area into different ‘territories’. Players would not run into the ‘territories’ of their enemy Region at the least.</p><br/><p>24%, 23%, 22%, 21%, 20%!</p><br/><p>When the HP bar of the boss dropped to 20%, Mathuven began to go insane. He could chain his {Storm Blades} with a {Destructive Smash}. After that, he would immediately use his {Storm Blades} again. The flashing of Mathuven’s blade was so frequent that normal players no longer had the chance to get near to the boss. They were no longer capable of contributing in bringing down the boss.</p><br/><p>The sole firepower of the Green Dragon lady was not enough to even make up with the boss’s {Spectre Build}’s HP recovery. 30 seconds later, the HP of the boss was recovered back to 21%. The pace of the boss battle was restored to the initial pace. Once again, the boss would only use his {Storm Blades} once every 60 seconds.</p><br/><p>If there were no players with Inheritance Transformation in the vicinity, the HP bar of the boss would be forever stuck at 20%. Then the boss would become ‘immortal’ in a way!</p><br/><p>\"Let’s go!\"</p><br/><p>Zhang Yang took the initiative to activate his Inheritance Transformation. There was no reason for him to be selfish anymore. If he acts selfishly and reserved his Inheritance Transformation at this point, they will not be able to take down the boss. When that happens, everyone in the server will receive a penalty of -3 levels! No one could afford to receive such penalty!</p><br/><p>Meanwhile, players from all other Regions were beginning to activate their Inheritance Transformations as well. Every top Tier player in every Region no longer held themselves back. Obviously, they were thinking of a bigger picture. There was no reason for anyone to hold back now!</p><br/><p>Zhang Yang was the first one to charge at the boss. Upon activating his Inheritance Transformation, he had over a maximum of 45,000,000 HP on him. With his super thick Defence, Zhang Yang should be able to last quite a long time under the bombardment of the boss!</p><br/><p>Han Ying Xue and Sun Xin Yu immediately followed Zhang Yang closely behind. As discussed earlier on, Han Ying Xue would only heal the three of them. By doing so, Zhang Yang and Sun Xin Yu would be able to stay within the attack range of the boss’s {Storm Blades} without retreating at all. At the same time, they could unleash their attacks on the boss without worrying that they might die. The three of them were unleashing the full potential of a player with a Class S Inheritance!</p><br/><p>On the other side, God’s Left Hand, Heart of Destruction, Hourglass Figure and the others were beginning to charge at the boss as well. God’s Left hand and Heart of Destruction glared at Zhang Yang with rage for a moment. However, they did not stir up any unnecessary battles. Instead, they vented their anger towards the boss.</p><br/><p>Zhang Yang smiled vaguely after realized that the two did not come for him. Well, these two were still considerate enough to look at the bigger picture. They had really proved to be very reliable because they were acting maturely. That’s most probably why they could become Top Tier players.</p><br/><p>A few seconds later, players with Class A Inheritances had arrived. Well, they had a slightly slower flying speed compared to the players with Class S Inheritances. The next batch that arrived were the players with Class B and Class C Inheritances. They arrived on their flying pets. At that moment, the players did not use any other ground pets that were high Tier than their flying pets, even though they had more powerful ground pets.</p><br/><p>Why? Because ground pets were moving very slow compared to the flying pets. Players would need to retreat when their HP bars are halfway down. They would need to move fast in order to move away from the effective range of the boss’s {Storm Blades} in one piece. Without the support of the flying pets’ fast movement speed. The players would only be able to hit the boss for 5 seconds before retreating. With a flying mount, the players would be able to hit the boss for 10 seconds before having the need to retreat!</p><br/><p>Although the difference was only 5 seconds, the efficiency of the players’ damage output would be improved twofold!</p><br/><p>After all, these players were all transformed. First of all, their Attack power had been increased multiple times over. Furthermore, those who had Inheritances of Class C above were basically Level 150 by now. So only a few of them were affected by the Level gap Suppression function of the game. They could all deal full damage to the boss.</p><br/><p>Under those circumstances, although the number of players with Inheritance Transformation was smaller, however, they were able to deal much more efficient damage to the boss than the players without Inheritance Transformations did. Ideally speaking, if they do not need to retreat after hitting the boss for awhile, they could deal even more damage to the boss within the same timeframe!</p><br/><p>After all, the normal players were able to deal only 1 damage to the boss with a single hit. On the other hand, these players could deal tens of thousands of damage to the boss with a single hit! In other words, one player with Inheritance Transformation could replace tens of thousands of normal players in the boss battle!</p><br/><p>{Glare of the Death God}!</p><br/><p>Resisted!</p><br/><p>Zhang Yang sighed heavily. However, he should be satisfied with the current situation as it was now. The {Glare of the Death God} was successfully casted on the boss once throughout the entire boss battle. However, it could be said that he had single-handedly reduced over 10% of the boss’s HP bar! So what else would he want, then?</p><br/><p>\"Pest! Insolence countless pest!\" Mathuven was infuriated by the attacks. He began to roar in anger, \"I’m going to kill you all! Kill you all!\"</p><br/><p>The boss roared in rage. However, he could not change the fact that his HP bar was reducing slowly. 19%, 18%, 17%... if the pace of the battle could just continue on, the players would be able to empty out the boss’s HP by within one and a half hour!</p><br/><p>Without even a single doubt, the next {Glare of the Death God} was stubbornly resisted by the boss as well. However, the HP bar of the boss had dropped to 11%!</p><br/><p>Victory was just within everyone’s grasp!</p><br/><p>However, the players were also quite exhausted and suffered quite a number of casualties as well. A small number of them attempted to stay and hit a few more times before retreating. Because of their ‘greed’, they were forced to activate their life-saving Skills to survive the boss’s {Storm Blades}. Still, some of them did not make it and they were slaughtered for good! Meanwhile, once the players were killed, they would not be able to rejoin the battle anymore. The reason was not because they could not resurrect themselves to join back into the battle. It was because their Inheritance Transformations would no longer be available after they die. There was no way that those players would be able to get close to the boss without the support of their Inheritance Transformation which boosted their Maximum HP several times higher. They would only be sending themselves to their own demises once again if they even try to get near to the boss.</p><br/><p>9%... 7%... 4%... 2%!</p><br/><p>As the HP bar of the boss was reducing, the players that were dealing damage to the boss began to have devious thoughts. Well, this was a World Boss after all. So the loots that the boss would drop upon his death must be extremely valuable. Before that, the boss still had quite a substantial amount of HP left. So no one had thoughts about snatching the loots. However, now the boss was about to die, the initially formed ‘Alliance’ was beginning to crumble. Everyone was thinking for themselves now. The moment when the boss dies, how should they proceed on snatching the loots? That was everything on the minds of every single player who was around the boss. Well, who wouldn’t want to get more good stuff for themselves?</p><br/><p>Without any discussion, everyone descended to the ground from the sky. They wanted to get in range when the snatching starts. Meanwhile, those who were low on HP were not willing to retreat at a crucial moment like this. They could not risk that one moment when the boss dies, they might be far away from the boss. So they stayed to lower down the risk of the other players snatching the loots first.</p><br/><p>However, that 1% or 2% HP of the boss would require the players to hit on for another tens of minutes. So it would take a while more before the boss would finally die. Well of course, those greedy bastards were naturally slain by the powerful impact of the boss’s {Storm Blades}. Without their Inheritance Transformation, they had lost their capability to snatch the loots.</p><br/><p>1%! 30,000,000! 20,000,000! 10,000,000!</p><br/><p>Everyone began to raise their spirit because the boss was about to die!</p><br/><p>5,000,000! 2,000,000! 1,000,000!</p><br/><p>\"NO---\" Mathuven let out a miserable scream and collapsed heavily onto the ground. His gigantic sword was shattered into pieces. Among the shattered pieces of the sword, the hilt of the sword was flashing frequently. So that must be the quest item!</p><br/><p>Almost everyone was charging towards that flashing hilt at the same instant!</p><br/><p>\"What an imbecile! Can’t even get the thing done! I’ll do it myself!\"</p><br/><p>Suddenly, a cold and deep voice echoed through the entire area. Every single player in the vicinity was suddenly ‘imprisoned’ somehow. A dark shadow sudden broke out of a void space in the middle of the air. The entire area was overwhelmed with the terrifying aura in an instant. Dark clouds began to cloud the entire sky. The atmosphere was astoundingly terrifying!</p><br/><p>The moment that dark shadow appeared, the dark shadow lashed out at at the Green Dragon! The jab was so unexpected and fast that no one could react until it happened!</p><br/><p>\"ARGH ---\" Elphenise cried miserably after the prodding. This powerful Holy Tier boss was being killed instantly by one single jab?! That was insane! Upon her death, her gigantic heart glowing in green radiance was grabbed by the hand of the dark shadow!</p><br/><p>\"Enjoy your remaining lives while you still can! Not long after, the entire land will be devoured by darkness! Everyone on this land will become one of my slaves!\" The dark shadow tore the void space open and went away.</p><br/>\n</div>"}