{"title": "Chapter 748: The Search for Reinforcement", "id": 748, "volume": 8, "url": "http://boxnovel.org/mmorpg-rebirth-of-the-legendary-guardian-chapter-748-the-search-for-reinforcement", "volume_title": "Volume 8", "body": "<h1>Chapter 748: The Search for Reinforcement</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 748: The Search for Reinforcement</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>When the main pillar of hope was broken, players had no other place to rely on and was turned into mincemeat by the boss. Right then, no player was capable of standing toe to toe with the Celestial tier boss. Hence, the only sensible route left for them was to run away.</p><br/><p>The boss did not allow anyone on the battlefield to escape. He truly intended to kill every single player there were then. He then pulled out his sword and sliced a dimensional doorway. At then, the dimensional doorway expanded fully and out came a swarm of monsters. With Angus leading the command, the swarm of newly spawned monsters attacked the players like locust swarms.</p><br/><p>Now that Angus was the only superpower left on the battlefield, players were completely outmatched and overwhelmed. A single swing of his {Blade of Obliteration} was able to wipe out the weak players within 500 meters! With such powerful killing skill, Souron’s Castle was overrun easily.</p><br/><p>Fortunately, before Souron’s Castle was overrun, Zhang Yang and his party were able to charge towards the Teleportation Circle and left to Morning Town. There, he stood by and commanded what’s left of the players around to make their defensive stance. Serena had temporarily returned to White Jade Castle to recuperate from the battle. Hence, half of the Empire’s soldiers were sent back to protect the defenseless queen. As such, the chance of Morning Town being overrun by Spectres was 99.99%</p><br/><p>It was what the plot had laid out for players to realize the truth of Spectre Invasion. If they could not even invade past the borders of Chaos Realms, what would Spectre Invasion really mean, then?</p><br/><p>After Souron’s Castle was overrun, the next territory to be conquered by the Spectres were Forrest Gump’s Fortress, Cynthia's Town, and White Horse Bay. They were all turned from player’s resting spots to Spectre base camps. As such, after all territories deep in the Chaos Realm were taken over, they had proceeded to march forth to enter the eight major regions. There was no one who could put stop to their march. Angus was too powerful, then. His army had easily trampled over towns like they were weeds in the field.</p><br/><p>With the players falling back to their own major cities, Angus’ forces continued to press their attack and infiltrated the pre-Chaos Realm regions. As such, the invasion continued on further. Without anyone able to put a stop to the Spectre invasion, Angus’ forces had managed to take control 56 out of the 64 majors cities of the entire world. He had only allowed one major city to survive for every region. As such, the Spectre Invasion event had reached its climatic point. It was up to players to decide on how to fight the boss. By then, Angus himself had not settled down anywhere permanently. He kept on switching in between the four territories in Chaos Realms. Unless players kill their way back, Chaos Realm will be done for.</p><br/><p>When all territories and access to the Chaos Realm are taken away, the entire game seemed to have fallen back to the beginner’s stage. It was still possible for players to make their way to the Chaos Realm. They would need to be strong enough to attack their way through the Ten Barren Seas and through the portal to Chaos Realm. It would be easier for Level 100 players since they would not have to travel far beyond the gates of Chaos Realm to reach their respective training grounds. Level 150 players were faced with a tough scenario. They needed to travel extremely far into the Chaos Realm to reach their respective training grounds.</p><br/><p>Naturally, the system would not make something like grinding levels an impossible task. They had allocated monsters to spawn between Level 100 to Level 180 around each city and territory to allow higher level players to gain some levels. Imagine all players from 8 major cities gathered in one major city, the monsters spawning in the area alone was not enough to satisfy all players at once. Hence, chaotic battles erupted between guilds just to occupy the training grounds for their own use.</p><br/><p>As such, the game had plunged into the dark ages. Players all around the world wanted to open up the path to Chaos Realm and to reclaim their land back from Angus. With both lands and the Celestial equipment hanging right there for them to take, the only method for them to grab the prize was to grind their way up higher and higher.</p><br/><p>The system had given players 1 months’ time of preparation whereby the NPC of major cities will \"respawn\" and assume their counterattack. The timing for all regions to start their own counterattack was not the same date. It was designed based on which region is the first to get attacked. Each region will have 3 days to attack and defeat Angus. If Angus is not defeated within the given period of time, all players will be removed from the battlefield, and so is Angus. The battle will then be declared as a loss for the players. By the looks of it, the first region to start their counterattack was South America. Australia will be the next in line, followed by Europe, North America, Africa, Japan-Korea, India, and finally China. Based on the recent battle of the other region, they would not be able to defeat Angus even when their NPC boss receives a 10% strength buff. Amongst all, Queen Serena will have the highest chance to defeat Angus for she was far stronger than any other Ascended tier boss. She was the only one capable of defeating Angus. That was the reason was Angus was only defeated after seventh attempts. That is how strong was a Celestial tier boss. There was no way the system would allow players to get their hands on the Celestial tier equipment. Furthermore, after defeating the boss, players who have had participated in the war shall receive Level +2 reward and obtained the title, \"Savior of the Land\". All of the given rewards are only limited to only players of a single region that had defeated Angus.</p><br/><p>Since Zhang Yang was sure that the first attempt will end with a failure, he had not wasted a single Military Point. As such, within the one-month preparation of time given, Zhang Yang had continued to amass more Military Points by completing quests offered by the NPC. After the first war attempt, everyone had then realized the importance of Military Points.</p><br/><p>NPCs that were hired through spending Military points were not just to put up more fight with Angus. If that is the case, Military Points would be worthless, since Angus’s sword strike would kill them all and heal himself.</p><br/><p>Those soldiers that were hired could be used as a means to share the damage received. It was by a percentage, and 1% at most. However, players can use that to their advantage. When NPC soldier hired by a player exceed 99, the player himself would only receive 1% of the incoming damage. The rest of the 99% damage will be distributed evenly to the rest of the 99 soldiers. The problem was that, normal soldiers will not have such skill. Only elite soldiers could be so useful in battle.</p><br/><p>Elite tier soldiers will cost 100 Military Points each. Technically, to have the maximum damage distribution, one must have 9,900 Military Points! Zhang Yang had only amassed 3,890 Military Points then, and could only hire 38 elite tier NPC soldiers. At most, the soldiers will be able to tank the 38% of damage received, whereas the remaining 62% will kill Zhang Yang in no time at all!</p><br/><p>The elite NPC soldier were like mobile HP potions. When fighting Angus himself, the NPC soldiers can be placed far behind the frontlines, since the \"Shared Life\" skill works within a 1-kilometer distance. The soldier could be placed far behind the attack range of the boss and remain alive. If one could find 99 Level 100 healers, they could help to heal the NPC soldiers behind, while the attacker (the player) can tank Angus and continue the fight longer than usual.</p><br/><p>The qualification of looting the boss drop does not work the same way as it would be when fighting normal boss. In summary, players must be able to deal more damage than the NPC to be able to gain the authority to loot the drops.</p><br/><p>Hence, to make things easy, players would have to make sure they could survive long enough in the battle to deal enough damage. Not to mention, they would have to remain alive till the end to prevent their effort from being wasted. That was the importance of the Military Points.</p><br/><p>Zhang Yang had adviced all his party members to not waste any of their Military Points earlier on. Hence, together with Zhang Yang, they too had run around the castle, completing missions given by the NPC in town for Military Points. Even though most of the quest were only worth 1 or 2 Military Points. They had to be satisfied with it.</p><br/><p>‘Ding! You have completed a quest: Search and Sanction. Obtained 1,000,000 Experience Points, 5 Military Points!’</p><br/><p>Zhang Yang sighed heavily as he acquired the quest reward. He then hunkered down and raised his voice to Gulaj. \"Goblin, do you have any harder quests for me? All the quest that I have done so far were so easy. Are you taking me for some spineless bastard?\"</p><br/><p>\"Hmph! Don’t get too cocky, Human!\" The Goblin crossed his arms. \"Fine. If you want something challenging. I have an urgent mission that might be difficult, even for you. It’s not about strength this time. Finish it, and I’ll give you a handsome reward.\"</p><br/><p>‘Ding! Gulaj has a Hidden Quest for you: Search for Reinforcements. Will you accept it?’</p><br/><p>Haha! You could trigger a hidden quest that way too!</p><br/><p>Zhang Yang accepted the quest immediately and checked its description.</p><br/><p>[Search for Reinforcement] (Difficulty Level: Unspecified)</p><br/><p>Description: Listen close the wind blows. Can’t you hear the sorrows and despair in the air? The Spectres have proven themselves to be a formidable foe. All those that live and breathe in the Union will face an unstoppable, destructive force. At times like this, we must combine our forces to combat the evil. Go out to the wild and search for helping hands!</p><br/><p>Progress: Undesignated</p><br/><p>Participant Limit: 1</p><br/><p>Reward: Military Points based on the number of reinforcements recruited.</p><br/><p>The reason why the quest difficulty was not set was due to the freedom of the player. They could simply find random NPCs, or recruit a Holy tier boss. It all depends on the level of the NPC and, the reward will correspond to that.</p><br/><p>To search for a helping hand…Zhang Yang immediately thought of thousands of names. One of which stood out better than the other. Merlinda – Song of the Forest! The kidnapped princess, the new Priestess of the Moon for the Elven race. She had reached the highest position amongst the elven race, she should be far stronger than before! She was at the very least leader of Elves, being an Ascended tier was the very least tier that she should be.</p><br/><p>She has the skill - {Higher Regeneration} which could restore 5% HP every second. Logically, Zhang Yang could heal himself back to 100% HP in only 20 seconds. With Merlinda helping Zhang Yang, he could activate his Transformation skill and survive the boss fight without even relying on the NPC soldiers! It may sound nice, but it was not realistic. A transformation state will only last for 2 hours. Defeating the Angus within 2 hours was not logical nor sensible! Hence, Military Points would still come in handy.</p><br/><p>Zhang Yang had rescued Merlinda three times. Hence, there will be higher chance that he could recruit her to join the fight against the Spectre. Some might even wonder why could Zhang Yang need to personally recruit the Elves when they were part of the four major races in the Union aside from Humans, Orcs, and Dwarves. The reason was simple, like Humans in the Chaos Realm, the Elves were not an ally to the Union. They were part of the races that lived in the Union but had not pledge their allegiance to the Union. Only some of the Elves were part of the Union and not all.</p><br/><p>On the other hand, there was one more name that could be of help. Smaug The King of the Forgotten One. He belonged to a separate Spectre group that had alienated themselves from the rest of the world. The best part was, he was a Celestial tier boss! In the past, Zhang Yang and Smaug had gone on an adventure together to save his wife. As a sign of friendship, Smaug had given him the [Friendship Jade]. He could try his luck to recruit the Forgotten King. If he manages to, he could perhaps defeat Angus at the first counterattack!</p><br/><p>If all goes well, Angus will be the only Spectre boss to be feared of. On the other hand, the human side would have eight Holy tier boss and one Celestial boss to fight. The chances of victory was extremely high! Perhaps, there would be a chance for him to get all 10 Celestial tier set equipment!</p><br/><p>How exciting!</p><br/><p>Zhang Yang stopped for a moment and thought it through. Smaug could be harder to recruit, since he was a Spectre as well. Even though he bears the name \"Forgotten King\" and alienated himself from the other hostile Spectres, they were still Spectres, to begin with. In fact, there was no reason for him to fight for the humans either!</p><br/><p>Tch!</p><br/><p>Zhang Yang clicked his tongue. It will be hard, but even so, Zhang Yang will try his best.</p><br/><p>Zhang Yang planned his route and soared to the sky with the Phoenix. He had no choice but to fly, since Tukula Fortress had been overrun by the Spectres as well. In fact, only White Jade Castle stood strong from the invasion, as well as the other major cities around the world. Perhaps, it was because Queen Serena was resting there.</p><br/><p>Zhang Yang flew quickly and swiftly through the land and entered the Chaos Realm through the portal in the Ten Barren Sea. His first stop was the Elf’s Sacred Ground.</p><br/>\n</div>"}