{"title": "Chapter 756: The Additional Effect of the Book of Revelation", "id": 756, "volume": 8, "url": "http://boxnovel.org/mmorpg-rebirth-of-the-legendary-guardian-chapter-756-the-additional-effect-of-the-book-of-revelation", "volume_title": "Volume 8", "body": "<h1>Chapter 756: The Additional Effect of the Book of Revelation</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 756: The Additional Effect of the Book of Revelation</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Truth be told, other than the Celestial Tier Armor set, the [Book of Revelation: Chapter 2] was the one item that made Zhang Yang the happiest man on earth.</p><br/><p>Zhang Yang had the [Book of Revelation: Chapter 1] and [Book of Revelation: Chapter 3 - 4] in his possession. By acquiring the [Book of Revelation: Chapter 2], he could finally combine all four broken chapters of the book into one!</p><br/><p>With all four broken chapters combining together into one, a stream of blinding light flashed across the items. Then, the four items became one.</p><br/><p>[Book of Revelation: Chapter 1 – 4] (Legendary, Unique)</p><br/><p>Description: Increases 20% Damage dealt to all party members of the holder within the range of 100-meter radius from the holder. The same effects cannot stack. If the holder is killed, the holder can choose to resurrect at the same spot where he or she died. The holder will have 40% HP and 40% MP upon resurrection. This effect can only be triggered once in every 7 hours. Similar type of effects cannot stack as well. If the holder is killed by other players when the effect is under cooldown, the item will be dropped. This item can only be brought along, and cannot be destroyed.</p><br/><p>Effect: Binds to a Skill and enhances that Skill (Skills that have been enhanced before cannot be enhanced again). Unbinding the enhance effect causes a 24-hour cooldown to the binding feature.</p><br/><p>Use: Combines this item with [Book of Revelation: Chapter 5].</p><br/><p>Huh? Other than the additional damage and the additional Resurrection effect, there was another additional special effect that would allow the holder to enhance Skills?</p><br/><p>Zhang Yang quickly brought up his Skill List and selected his {Block}. Then he proceeded on to select the [Book of Revelation]. Instantly, a stream of dazzling golden light flashed across his entire body. The next thing Zhang Yang noticed was the description of his {Block} had changed.</p><br/><p>[Block (Enhanced)] (Level 10): Raises your shield up high, blocks an attack from the enemy head-on. Lasts for 1 second. Upon a successful block, causes 200% Strength points of damage to the target and creates a large amount of aggro. You will acquire 30 Rage Points as well. Cooldown: 5 seconds. Require: Shield.</p><br/><p>The cooldown had been reduced from 6 seconds to 5 seconds! Furthermore, the strike back damage had been increased from 100% Strength points of damage to 200%!</p><br/><p>Even though the cooldown period had only be shortened by 1 second, it was a 17% improvement in efficiency of the Skill! Initially, Zhang Yang could only activate his {Block} 5 times within a timeframe of 30 seconds. Now, he could activate his {Block} up to six times within the same timeframe. This could really invoke a game-changing effect when taking on certain bosses!</p><br/><p>Other than that, this effect could also be unbounded! This effect could enhance any Skills! Of course, Zhang Yang’s Skills which are already enhanced, such as {Force Strike}, {Cripple Defence} and {Thunder Strike} could no longer be enhanced any further. Otherwise, those Skills would become too powerful for the game.</p><br/><p>This book would basically be as powerful as a Skill Book that contains all the powerful Skills, such as {Superior Force Strike} and {Superior Thunder Strike} for other players if they had this. They could switch between Skills of their choice to bind the book with, once every 24 hours! It would really be a very practical and versatile asset.</p><br/><p>Furthermore, these were just additional effects, provided by the combination of 4 broken chapters of the [Book of Revelation]. If the remaining chapters of the book were to be collected and combined together to form the complete [Book of Revelation], there should be more additional effects that the book could offer, right? It would be ideal if the holder gets one additional effect for every chapter combined!</p><br/><p>Zhang Yang was grinning in joy. At the same time, he was slightly agitated, because the chapters of the book had to be in sequence in order to be combined into one. So, he could not just take the Chapter 10 from Sun Xin Yu and combine it with the Chapter 8 that he had. Why couldn’t these two chapters just function as Chapter 5 and Chapter 6?!</p><br/><p>To have such a thought in his mind, Zhang Yang’s greed and desired must have overtaken him a little while there.</p><br/><p>Other than that, Zhang Yang was not granted with the ‘First Clear’ of a Celestial boss upon Angus’s defeat, after all. It was quite obvious that the battle was already won, because the NPCs did most of the heavy work. That was most probably why the system did not recognize Zhang Yang as the slayer of the boss.</p><br/><p>Firstly, Zhang Yang went up to thank Merlinda. He managed to get her to stay in the White Jade Castle for the next few days. Queen Serena had sent forth her men to escort Merlinda to the palace. However, the queen’s ‘summon’ was declined by Merlinda with regret. Two days later, Thea and Aweena pulled Merlinda out of the city quietly, as if they were afraid that Merlinda would be ‘corrupted’ after staying too long with Zhang Yang.</p><br/><p>The moment the quest of slaying ‘Angus’ was handed in, Zhang Yang and everyone in his party of ten received two Skill Points. Unfortunately, they did not acquire any addition to their levels as rewards. However, from another point of view, the +2 levels that they acquired the moment when the boss was slain was considered as that reward already, wasn’t it? The only thing that left Zhang Yang dissatisfied was that everyone who joined the boss battle had acquired the same +2 levels as well.</p><br/><p>Zhang Yang added one of the Skill Points on his {Shadow Clone}. After fully upgrading that Skill, he added the other Skill Point to his {Force Strike}. Well, he chose to add the Skill Point to his {Force Strike} because that Skill could have an additional damage of 300%, just like his {God of War Devastation} and his {God of War Battle Axe}, when that Skill hits level 10.</p><br/><p>Upon Angus’s death, the players naturally had to recover the Territories they lost. Meanwhile, after the death of a super boss, the remaining monsters had nothing left to stand against the players. In just two days, the 7 main cities had been declared to be returned under the ruling of the White Jade Empire. Meanwhile, all Territories had been rebuilt.</p><br/><p>Unfortunately, the invasion was not triggered by activating a [Monster Attack Order]. Therefore, it did not matter whether it was Thunderstorm Castle, Morning Town or Souron’s Castle, they all belonged to Zhang Yang. As long as he could secure the main halls of the Territories and clear out all monsters that were still in Battle Mode, Zhang Yang could regain control of the Territories once again. By then, Zhang Yang should be able to rebuild the Territories after he regains his status as the Baron of the Territories.</p><br/><p>Of course, he had to spend a fortune to rebuild all that. However, he actually lost way more than that, just because he could not get a dime from the Teleportation Circles for over 1 month. That amount that he could not earn was far more than the millions of dollars he spent to repair his Territories.</p><br/><p>After they’ve destroyed all four ‘Darkness Falls’ devices in the hearts of the four high Tier Territories, the players claimed total victory over the Spectre Invasion battle! However, it was obvious that the event was far from over. The system notified the players that the Spectres would not admit their defeat just because they failed in their invasion plan. They were hiding somewhere secretive, rebuilding their ‘Darkness Falls’ so that they could return once again to lay waste to the land one day!</p><br/><p>That would the theme for the Level 170 Dungeon’s ‘Spectre’s Secret Lair’. Players could form a 50-player scale party to enter and destroy the Spectre’s ambition and scheme, once and for all.</p><br/><p>When the Teleportation Circles of the Territories resumed their functionality, many players cheered and ran around like joyful children, racing towards a new playground. Some things are not appreciated until they are gone. Therefore, the players were forced to travel around on their Flying Mounts for over a month when the Territories were ‘out of order’ momentarily. Because of that, they realized the importance of Territories and their Teleportation Circles. Most of the players were depending on the Teleportation Circles to travel back to their main cities from the Territories. Some were traveling across the main cities and the territories just for fun. Zhang Yang felt extremely happy, because of that.</p><br/><p>Normal players could continue enjoying the joy and entertainment that the game could offer at the moment. However, the top Tier players had no luxury at all to relax. The next phase of the story was about to begin! They had to get ready for the upcoming competition in acquiring the ‘First Clear’ for the Hardcore Mode of ‘Spectre’s Secret Lair’! It’s going to be way more intense than they could ever anticipate!</p><br/><p>The ‘Spectre’s Secret Lair’ was a 50-player scale dungeon, and only players who had attained Level 170 could enter the dungeon. Currently, even Zhang Yang, Sun Xin Yu and Wei Yan Er were still dangling around Level 167, Level 168!</p><br/><p>The fact that the China Region was the one who took the credit for slaying Angus had led them to earn a lot of benefits! Players in the entire China Region had acquired a reward of +2 levels. It was particularly effective for the high Tier players.</p><br/><p>Not having enough members at the required levels, Zhang Yang could not begin ‘snatching’ the ‘First Clear’ of the dungeon’s Hardcore Mode. So, he could only hustle his party members to grind their levels a little faster. All he needed was to have 30 Level 170 players challenge the Normal Mode and the Hard Mode of the dungeon. By then, he should be able to get familiarized with the dungeon boss’s behavior.</p><br/><p>For the next few days, Zhang Yang took it easy as he grinded his levels. While he was at it, he was experimenting the additional enhancement effect of the [Book of Revelation] that he had acquired a while ago. He switched the effect onto his Skills, one after another to see which Skill had the most to gain.</p><br/><p>Some Skills actually became so oppressive after the enhance effect was applied on them. For instance, the cooldown of the {God of War Transformation} had been shortened by 2 hours! The effect sounded too great to be true! Two hours is as long as the duration of the Transformation Skills can last!</p><br/><p>However, if the 72-hour cooldown is taken into consideration, the shortening of 2-hour of the cooldown period would not make much of a difference. Furthermore, no one would actually activate their Inheritance Transformation immediately after the cooldown. Everyone would only use their Inheritance Transformation in crucial moments. Normally, players would only use their Inheritance Transformations once in every 4 to 5 days. Therefore, the enhance effect would become pointless for that Skill.</p><br/><p>Well, instead of having a 2-hour shortening on the cooldown of his {God of War Transformation}, Zhang Yang would prefer more to have a 2-hour increment on the duration of his Transformation!</p><br/><p>Of course, there were also other Skills that become much more powerful after applying the Enhance Effect. For instance, the duration of Zhang Yang’s {Shield Wall} had increased by 2 times longer! Other than that, Skills such as {God of War Devastation} and {God of War Battle Axe} had their cooldown periods shortened a little. For example, if the Skill’s cooldown was 1 minute, then the cooldown period would be shortened down to 50 seconds, 30 seconds or even 25 seconds. However, boosting Zhang Yang’s Offensive Skills was not as ideal as boosting Zhang Yang’s Defensive Skills.</p><br/><p>Well, Zhang Yang also had another oppressive Skill called the {Rising Dragon Strike}. Upon applying the Enhance Effect on it, the Skill only received a ‘slightly higher chance’ of being triggered. However, after Zhang Yang gave it a try, he noticed that there were still less than 0.001% chance for the Skill to trigger! Well, judging from the Skill’s damage output and that it was also an AoE Skill, it would be outrageous for the other players and monsters if the rate of triggering this Skill was high.</p><br/><p>Finally, Zhang Yang decided to apply the enhancement effect of the [Book of Revelation] to his {Block}. That was Zhang Yang’s most frequently used Skill after all. So there was a high value for him to apply the enhancement effect on that Skill.</p><br/><p>Zhang Yang arrived at the Rock Flatlands. It was a Level 150 – 180 map that was the standard for players to grind for their levels. He had chosen to come because there were much fewer players here. Furthermore, he might even get a chance of encountering a Holy Tier boss!</p><br/><p>Having Felice tagging along with him, Felice would also transform into her Dragonhawk form while she battles the monsters. After clearing out the monsters, Felice would transform into her Tree of Life form and heal Zhang Yang. Therefore, Zhang Yang did not have to take Snacks like crazy after encountering a few Elite Tier monsters.</p><br/><p>Zhang Yang did not have a clear direction at the moment. So, after letting his Herb Foraging Familiar out into the wild, he just casually walked around and slew monsters in his surroundings. Well, as long as he earns Experience Points, his destination would be of no consequence at all.</p><br/><p>After grinding for an entire day, he arrived at a settlement of men. It was a village built along the side of a large lake. There should be about thousands of families settling down, over the village. Well, the village was rather large, and could be considered a rural town, if such a thing even existed.</p><br/><p>Right in the middle of the village, there was a noticeboard. There were two wanted posters pinned right on the board. One of the wanted posters was flashing vaguely. It was the telltale sign of a quest.</p><br/><p>Zhang Yang touched the wanted poster with his hand. He immediately received a new quest.</p><br/><p>[Loch Ness Monster in Guura Lake] (Difficulty: Rank-C)</p><br/><p>Description: The legendary Loch Ness Monster has been resurrected! A few villagers claimed to have sighted the shadow of the Loch Ness Monster by the northwest of the lake during midnight! Quickly, can someone go and find out what is really going on? After obtaining the truth, please report the news to Sandrake the Chief of the village.</p><br/><p>Completion: The secret of Loch Ness Monster of the Guura Lake 0/1</p><br/><p>After reading the description of the quest, Zhang Yang confirmed that the Loch Ness Monster would only reveal itself by nightfall. It was still broad daylight, now. Therefore, Zhang Yang had no need to rush. So, he went to have a stroll around the village, taking out some monsters nearby the village and earning some Experience Points. He would only get back to the Northwest of the lake by nightfall.</p><br/><p>\"Shakaka!\" The moment he landed on the ground nearby the lake, a fishmen rushed out at him from the water.</p><br/><p>[Guura Lake Fish-Man] (Elite, Humanoid)</p><br/><p>Level: 170</p><br/><p>HP: 5,100,000</p><br/><p>Defence: 7,000</p><br/><p>Melee Attack: 40,774 – 60,774</p><br/><p>Skills:</p><br/><p>[Fishbone Piercing Shot]: Causes 100% Melee Attack of Physical Damage to the target and the other targets behind the first target. Will cause the targets to bleed continuously. When the targets are bleeding, they will receive an additional 20% damage. Lasts for 10 seconds. Effects cannot stack.</p><br/><p>[Flee]: When a Guura Lake Fish-Man’s HP bar reaches 20% left, it will begin seeking help from its friends.</p><br/>\n</div>"}