{"title": "Chapter 755: Magnificent Treasure", "id": 755, "volume": 8, "url": "http://boxnovel.org/mmorpg-rebirth-of-the-legendary-guardian-chapter-755-magnificent-treasure", "volume_title": "Volume 8", "body": "<h1>Chapter 755: Magnificent Treasure</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 755: Magnificent Treasure</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Zhang Yang found the whole situation extremely funny. Still, it was still dangerous for him to linger there any longer. Serena was about to return to White Jade Castle as well. It would be best for Zhang Yang to go back to town, where PvP wass forbidden. Even though he was able to tank Angus, a Celestial tier boss, he will never be able to tank all of China’s raging players.</p><br/><p>Queen Serena was still in an attack stance when she escorted Zhang Yang to the far end of the now quiet battlefield. No one dared to approach him when superwoman was right beside him. The Empire’s Spellcasters opened up a portal from White Jade Castle and allowed the entire army to return home. Players in the battlefield could use the portal as well.</p><br/><p>Zhang Yang thanked Serena for her efforts in the war and quickly bade her farewell. He rushed back and brought Merlinda, and his party members back safely to White Jade Castle.</p><br/><p>There was only one way for anyone to kill Zhang Yang to get his Celestial tier drops, and that was to have all other players from other regions to issue a region vs region war and conquer White Jade Castle. As for players from China, they had absolutely nothing else to do but stare blindly at Zhang Yang.</p><br/><p>\"Little Yang! Come on! SHOW IT! SHOW ME THE TREASURE!\" cried Fatty Han frantically, like a hungry monkey.</p><br/><p>Zhang Yang snickered, but when he turned to meet the party, everyone was practically behaving like a hungry wolf, silent and ready to pounce on him.</p><br/><p>\"You guys…calm down, yeah? Why are all of you looking at me like hungry wolves?! I’m not a piece a meat. I’m not tasty!\" cried Zhang Yang as he laughed and teased the party further. After a good laugh and teasing, Zhang Yang finally opened up his inventory and showed everyone the haul.</p><br/><p>As they weren’t able to defeat Angus in the first attack, the drop was reduced from 13 to 10 Celestial tier set equipment and 3 Celestial tier normal equipment. There were even more random items as well, including 7 skill books, 3 [Skill Point Crystals], 9 [Advance Aura Stones], 2 [Forbidden Scrolls], and the Second Chapter of the [Book of Revelation]!</p><br/><p>All the Celestial tier set equipment obtained were boots. Besides Templar, Witch Doctor, and Sniper, there were set equipment for the other subclasses. After gaining the God of War Inheritance, Zhang Yang was able to equip both Berserker and Guardian type armors. However, since Wei Yan Er was there, he would have to resort to taking only the Guardian type armor.</p><br/><p>Even though the set effect of the two equipment were different, the basic properties boost was the same.</p><br/><p>[God Killer War Greaves] (Celestial, Heavy Armor)</p><br/><p>Defense: +2560</p><br/><p>Vitality: +47343</p><br/><p>Strength: +6163</p><br/><p>Dexterity: +2515</p><br/><p>{Level 8 Socket}</p><br/><p>Equip: Increases maximum HP by 94,680.</p><br/><p>Equip: Increases damage dealt and healing rate by 15%.</p><br/><p>Equip: Absorbs 5,472 damage on attack.</p><br/><p>Use: Drops a powerful kick on the target and stuns the target for 10 seconds. Effect can be inflicted on targets below Level 230. Cooldown: 1 hour.</p><br/><p>Level Requirement: 230</p><br/><p>Class Requirement: Guardian</p><br/><p>Special: Level Requirement lowered by 30 Levels.</p><br/><p>God Killer Set Effect: {God Killer Helmet}, {God Killer Necklace}, {God Killer Cape}, {God Killer Chest Plate}, {God Killer Gauntlet}, {God Killer Sheen Guard}, God Killer War Greaves, {God Killer Ring}.</p><br/><p>Two Equipped Set Effect: Increases damage reduction rate by 20%</p><br/><p>Four Equipped Set Effect: Reduces 10% damage on all allies within 40 meters around the wearer.</p><br/><p>Six Equipped Set Effect: Grants a fixed chance to activate {Shield Wall} upon attack. Triggered {Shield Wall} will not affect the player’s {Shield Wall} cooldown.</p><br/><p>Eight Equipped Set Effect: Automatically triggers {Shield Bash} after a successful {Block}. {Shield Bash} trigger would not cost any Rage points and will not affect the player’s {Shield Bash} cooldown. 100% Critical rate. After striking a target with the triggered {Shield Bash}, grant a chance to stun the target for 3 seconds. Stun effect will affect all targets regardless or Level.</p><br/><p>Note: There was a legend. A Legend about the God Killer Ash Crux. Ash had slain 8 Gods and used their blood to forge each of the equipment. All the equipment forged with the god’s ichor will beseech the wearer with such strength that even the God of Death will shiver with fear.</p><br/><p>Since the set equipment was specially \"forged\" for Guardians, the set effect will be mostly defensive. After collecting all 8 equipment, the set effect granted then will provide a certain degree of damage boost. It was a 100% Critical hit, a zero cost {Shield Bash} that could not only deal massive damage due to Zhang Yang absurd Strength value, it would also stun the target for 3 seconds.</p><br/><p>Zhang Yang widened his eyes when he read the description of the equipment: \"Stun effect will affect all targets, regardless of Level.\" That would mean that all bosses, even the Celestial tier bosses could be stunned! WOAH! As expected of a God Killer armor!</p><br/><p>The excitement and happiness, knowing that soon, he would be this strong! However, Zhang Yang immediately realized that he was thinking too far into the future and had forgotten to take account the process. Collecting all eight parts of the set equipment would require Zhang Yang killing eight Celestial tier bosses. Once he collects all the parts…he would definitely be able to defeat the ninth, the tenth, and so on without a problem! In that case, the free {Shield Bash} and stun skill will only be adding salt to the ocean!</p><br/><p>Still, by having the eighth set effect would undoubtedly strengthen his overall battle prowess. {Block} has a 6 seconds cooldown period, hence, even though the chance to trigger the {Shield Bash} stunning effect, it would greatly increase its proc rate. During PvP battles, if Zhang Yang is lucky enough to proc the stun effect, the player can kiss goodbye to winning the battle.</p><br/><p>Those who are able to get their hands on the Celestial tier equipment would be happy. Since there wasss more than one player of the same class, there will be tears and sadness in the party. For example, Fatty Han and Fantasy Sweetheart lost to Hundred Shots and Han Ying Xue during the rolling for their items. Be it anger or sadness, they could do nothing but to congratulate their partner.</p><br/><p>The luckiest one there, besides Zhang Yang, would be Lost Dream. Sun Xin Yu had the S class Inheritance, like Zhang Yang, she would be able to equip both subclasses of equipment. She then chose the Bandit type boots, leaving the Assassin type boots to Lost Dream. There was no need for a roll!</p><br/><p>Although some of them were unable to get themselves equipment, it was still, fine since Level 200 was still pretty much at the horizon. They had more than enough time to hunt for another Celestial tier boss, sometime later in the future.</p><br/><p>When all the set equipment were distributed, the remaining three Celestial tier equipment were put on display. All three of them were not subclass specific.</p><br/><p>[Muckra's Mjolnir] (Celestial, One-Handed Hammer)</p><br/><p>Weapon Attack: 36,948 – 56,948</p><br/><p>Attack Interval: 2.8 seconds</p><br/><p>DPS: 16,767</p><br/><p>{Level 8 Socket 1}</p><br/><p>{Level 8 Socket 2}</p><br/><p>Equip: Increases damage dealt by 70%.</p><br/><p>Equip: Increases Critical chance rate by 20%.</p><br/><p>Equip: Grants a chance to inflict 10 times normal damage on the next attack to a target after attacking.</p><br/><p>Equip: Grants a chance increase attack speed by 20% after attacking.</p><br/><p>Level Requirement: 230</p><br/><p>Special: Level Requirement reduced by 30 Levels.</p><br/><p>Note: Muckra was a warrior who used magic as his main offense. Although his magic could not defeat a Spellcaster, and his strength could not defeat a Warrior, he was able to defeat them both with a little adjustments tohis hammer.</p><br/><p>Everyone examined the weapon and were shocked beyond words. Be it the high damage weapon attack, or special weapon effect, both were extremely strong! Perhaps, it was even stronger than a set-equipment!</p><br/><p>Both Sun Xin Yu and Endless Starlight were suited to using the one-handed weapon, however, Endless Starlight had the priority since he was a Defender with the skill {Hammer Mastery}. The man cried his eyes out and thanked his mother for being born, and thanked Sun Xin Yu for allowing his lowly self to accept the weapon and even thanked Zhang Yang for finding him after being kicked down from the cliff with Daffodil Daydream!</p><br/><p>The next item was a Cloth Armor type. Since Fantasy Sweetheart had lost the roll to get the set equipment boots, the Celestial tier dress was given to her.</p><br/><p>The last item was neither an equipment nor a weapon, but an accessory. A beautiful metallic ring, designed to curl around the finger of the wearer.</p><br/><p>[Unfaltering Faith] (Celestial, Ring)</p><br/><p>Vitality: +23671</p><br/><p>Strength: +3081</p><br/><p>Dexterity: +3081</p><br/><p>Equip: Increases maximum HP by 47,340.</p><br/><p>Equip: Increases damage dealt and healing rate by 15%.</p><br/><p>Equip: Absorbs 2,735 damage upon attack.</p><br/><p>Use: Resets all cooldown to 0 for all skills with less than 30 minutes of cooldown time. Cooldown: 30 minutes.</p><br/><p>Level Requirement: Level 230</p><br/><p>Special: Reduces Level Requirement by 30 Levels.</p><br/><p>\"Dear ladies and gentleman, since all of you have obtained a Celestial item. May I humbly ask for this ring since this Fatty bro had not able to receive anything?\" said Fatty Han, wearing the expression Zhang Yang had seen many a times on greedy Goblins and Dwarves.</p><br/><p>Everyone laughed and agreed to let Fatty Han have the ring.</p><br/><p>All three [Skill Point Crystals] were distributed accordingly to turns. As for the [Advance Aura Stones], two were given to Sun Xin Yu to increase her {Critical Aura} to Level 10, three were given to Wei Yan Er, three were given to Hundred Shots, and the last one was given to Daffodil Daydream.</p><br/><p>As a result, the cumulative aura had increase the entire party stats as such: Vitality +40%, Healing Rate: +30%, Critical chance rate: +10%, Strength: +20%, Pet Damage Increase: +30%.</p><br/><p>The two [Forbidden Scrolls] were named [Reaper’s Descend], and [Stuttering Focus].</p><br/><p>[Reaper’s Descent] was an AoE attack skill that had the same effect as other AoE attack [Forbidden Scrolls]. (Deals 10% HP as damage for 30 seconds). The only difference that [Reaper’s Descent] had was the upper and lower limit cap at 250,000 and 100,000 damage.</p><br/><p>[Stuttering Focus] was a single target debuff that will cause the effect called {Stuttering}. Every 3 seconds, the inflicted target will have a 10% chance to stop moving, attacking, or do any other action. It was similar to [Absolute Binding,] but the effect was effective against targets until Level 230.</p><br/><p>If a boss similar to Angus ever appears again, Zhang Yang could use the [Forbidden Scroll: Stuttering Focus] to control him!</p><br/><p>Sadly, all Celestial boss were considered Unique. Angus’ death is permanent and there would never be a boss named Angus anymore. However, the Spectre system will elect a being that will take over as Lord of the Seven Spectre Kings. Hence, the number of Celestial tier bosses will remain the same, even if they are being killed like ants.</p><br/><p>Naturally, all the skill books were distributed according to their class requirement. If there are skill books that could be learned by multiple classes, the distribution method will then be changed to Roll The Dice.</p><br/><p>Zhang Yang had obtained skill called [Surrogacy]</p><br/><p>[Surrogacy]: Connects with an ally at the spiritual level. When you or the chosen ally receives an attack, the attack damage will be reduced, based on the value of the higher Defense, amongst the two. [Surrogacy] can only be cast on one target at a time. The Level Gap between the caster and the chosen target must be lower or equal to 30.</p><br/><p>Although the skill was pretty confusing and sounded rather useless, it was in fact extremely useful. It could be used on either the DPSer or the healer. In simple words, Zhang Yang can instantly have someone like Han Ying Xue gain the same Defense as Zhang Yang! Furthermore, the skill can also be used on a tank! Zhang Yang could turn a \"tofu\" tank into a super-powered tank!</p><br/><p>On the other hand, if Endless Starlight activates his King Kong Transformation skill, Zhang Yang could use the skill on him, and Zhang Yang could gain Endless Starlight’s boosted Defense value! It would be the same for Zhang Yang if he uses his Transformation skill. That would be the best way to use the skill. A free tank! Naturally, the HP value of both the caster and the receiver would remain the same.</p><br/><p>The happiest person was Wei Yan Er, not Zhang Yang. The little girl had called shotgun for the skill. As long as she is in the party with Zhang Yang, he would have to use the skill on her so that she could attack till her heart’s content.</p><br/>\n</div>"}