{"title": "Chapter 785: Planning", "id": 785, "volume": 8, "url": "http://boxnovel.org/mmorpg-rebirth-of-the-legendary-guardian-chapter-785-planning", "volume_title": "Volume 8", "body": "<h1>Chapter 785: Planning</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 785: Planning</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Slam!</p><br/><p>Zhong Xiu Hua smashed his fist heavily against the surface of the table. The table top trembled. He was infuriated to the point that veins were visibly popping out on his head. Then he said, \"Lone Desert Smoke! It’s Lone Desert Smoke again! You’re all calling yourselves the top Tier players in the game! You claimed that nothing can beat you! So how come no one here can actually beat that f*cking Zhang Yang?! Huh?! F*CK!\"</p><br/><p>Scholar Musou and the rest remained in silence for the moment. Before they encountered Zhang Yang, they were really cocky and arrogant. They really believed that they could take down the entire game with their bare hands. However, only the ones who battled Zhang Yang before now would know how terrifying Zhang Yang could be when he gets serious ion a battle.</p><br/><p>Zhong Xiu Hua looked at his own shop. There were barely any customers. Then, he looked at Zhang Yang’s Little Merchandize Shop. When he realized that Zhang Yang’s shop was always filled with customers, he got even angrier. He had spent more than a few fortunes just to purchase the Land Lease of the shop. He believed that the investment experts from his mother’s company could make the shop even more popular than Zhang Yang’s Little Merchandize Shop.</p><br/><p>However, the truth was apparent. His shop only got tons of customers during the 3-day Special Sale period. However, after the Special Sale had ended, his shop immediately became cold and quiet. Even though the equipment and items in his shop were a few gold pieces cheaper than the price of equipment and items in Zhang Yang’s Little Merchandize Shop, people would still prefer to walk a few steps more to the Little Merchandize Shop.</p><br/><p>The reason was actually known to Zhong Xiu Hua. That was because the Little Merchandize Shop had all sorts of potions on sales. Many players had gotten used to making purchases at the Little Merchandize Shop. So, when they saw something particular that captures their eyes, they would just buy the equipment or the items by convenience.</p><br/><p>So, it was Zhang Yang once again! Everything he did was ruining Zhong Xiu Hua’s plans!</p><br/><p>Zhong Xiu Hua was born with silver spoon, after all. He had never gone through any hardships before in his entire life. However, he was starting to taste humiliations and losses ever since he met Zhang Yang. Even if he doesn’t care much about failing or getting humiliated, when all his losses are added up together and got shoved in his face, he could no longer hold down the rage that was blazing hot, deep in his heart.</p><br/><p>\"Master Zhong, the Lone Desert Smoke is a powerful force in the entire game. It would be unwise to go head-on with them!\" Scholar Musou said.</p><br/><p>\"Huh?\" Zhong Xiu Hua had been trained to keep his emotions in check since he was young. So, it only took a brief moment for him to calm himself down.</p><br/><p>\"However, there’s a saying. The most fortified castle can be corroded from within!\" Scholar Musou turned his eyes towards Zhong Xiu Hua and said, \"The Lone Desert Smoke could stand proudly among the China Region community because they have quite a number of top Tier players to back them up. They also have quite a large number of middle Tier players which are quite skilful and powerful. Therefore, we can divide this plan into three steps and use an adequate remedy for the disease!\"</p><br/><p>\"Keep going.\"</p><br/><p>\"Firstly, the Lone Desert Smoke is so united because of Zhang Yang’s prestige and his alone! However, there’s a saying. Good news does not travel far but bad news travels the furthest! So, we can create rumors saying that Zhang Yang is abusing his power as the guildmaster to force female players into having sex with him overnight. When the rumors are ripe, we only have to make a few so-called ‘victim’ guilds come out and seek justice! Well, such sort of news can always attract tons of attention from the busybody people. They will not care if the rumors are true or not. They will just look at the others who get to toy with women with hate! There’s also another saying in Chinese. When three people pretend to be a tiger and the rumor have enough evidence, the rumors will become truths!\"</p><br/><p>\"Haha!\" Zhong Xiu Hua finally felt a little joy. Then he laughed out loud and said, \"Musou you old dog! That tactic is pure evil! However, one must use evil tactics on intoxicating people like Zhang Yang! Indeed, we should use dirty tricks on him! Well, rumours aren’t enough to take him down, though. We will need some ‘powerful’ evidence … hmmm…. What’s that called… oh! Right! ‘Nothing better shows the truth than a picture’! We need to take a few photos of him on bed with a woman! Then, we can just put the photos up together with the rumours! Furthermore, the woman better be someone significant, someone famous!\"</p><br/><p>\"Oh, right! I heard that Luo Yu Rou is going to promote her new movie at Zhou Shu. Master Zhong, if we can put them onto the same bed, then Zhang Yang will be framed and many men will be pointing their blame fingers on him!\"</p><br/><p>\"Luo Yu Rou? That bombshell superstar? What the f*ck! That woman is just too seductive to even look at. Every time when I watch her movies, my cock would definitely get so hard that I raise a tent in between my own thighs! F*ck her! She always loves to show that little bit of her private parts without showing the important parts that we all want to see! Pui!\" Death Arbiter would always talk vulgarly. Well, he had always been a hoodlum in the first place. He got lucky. That was how he got into the game and became renowned as a skilful player. Although he was well-trained, he failed to remove the vulgarity buried deep in his personality.</p><br/><p>Speaking of the woman, these perverted men were beginning to show their interest. All of them were saying that Luo Yu Rou was a seductive b*tch. Well, even though Luo Yu Rou excelled in the art of sexiness, she had never actually stood naked in front of anyone before. Every time they stared at the screen, countless men could not help fantasizing getting into the screen and tearing her clothes off her so that they could feast their dirty eyes on her fair and sexy naked body!</p><br/><p>The feeling was similar to the situation where men were watching porn with mosaic boxes covering up the vital parts of the porn stars! Although they could have imagined the covered parts with their own imaginations, they would not get the satisfaction that they want.</p><br/><p>Zhong Xiu Hua gave a cough and stopped the menacing talk about sex and porn, then he said, \"Since that this Luo Yu Rou is so famous, then she shall be our ‘main course’ for our plan! I will install some hidden cameras in the hotel she’s staying. Then I will kidnap Zhang Yang and send him over. Let them both have some aphrodisiac and let the fire spread on its own! I believe they will start scorching each other up after the aphrodisiacs kicks in! Hehehe!\"</p><br/><p>\"Haha! Only you, Master Zhong! Only you’re capable of spending so much money to get this done!\" Everyone began to butter the rich brat.</p><br/><p>\"I can’t believe Zhang Yang is going to get a taste on that bombshell’s body because of this! Pui!\" Death Arbiter licked his lips for a bit and said, \"God damn it! A fine cabbage is going to get twiddled by a f*cking pig!\"</p><br/><p>Others were revealing a sense of jealousy on their own faces. After all, that Luo Yu Rou was the most famous goddess among the otakus. That pair of boobies had caused countless men to fap to their deaths!</p><br/><p>Zhong Xiu Hua felt nothing for that woman. Well, with his current status, he could just toy any kind of woman according to his liking. So, he did not even care about what would happen to the pair. Furthermore, he had never believed the appearance of women on the big screens. 7 beautiful women out of 10 would look even worse than the appearance of a female pig after they remove their makeup.</p><br/><p>When he was younger, he underwent an experience that would scar him for life. He had spent a fortune to have a one-night-stand with a female superstar before. However, when that superstar took off her makeup, Zhong Xiu Hua was shocked to the point that he tried to flee. From that moment on, he deeply understood the term ‘disguise’. What the f*ck!? That superstar looked totally different after she took off her makeup layer on her face!</p><br/><p>Ever since then, he had never believed in the appearance of any of the superstars on screen. Even if he wanted to toy with women, he would pick those fresh and real girls from universities. Straight out of the oven, they say.</p><br/><p>\"After sleeping with the most popular goddess of otakus, Zhang Yang would definitely be hated by countless men all around the world! When the rumours come crashing down on him as well, everyone will only believe that Zhang Yang is a sick horny son of the f*cking b*tch! By then, his reputation will be ruined!\" Scholar Musou tried to summarize the plan.</p><br/><p>\"If that succeeds, the name ‘Zhan Yu’ will be tainted and his prestige will be dragged into the mud forever! When his name is no longer prestigious among Lone Desert Smoke, Lone Desert Smoke will no longer be united! We shall take the opportunity to dig their good players over to our side, especially their core players! I believe that the seduction of money and their disappointment towards Zhan Yu would definitely push 60% of them to leaving Lone Desert Smoke!\"</p><br/><p>\"And finally, we can send the Anti-Lone-Desert-Smoke force over to launch a full scale attack on the Lone Desert Smoke! We shall attack every single member of that guild. Under that kind of pressure, the people in his guild would definitely feel unsafe. Meanwhile, Zhan Yu would be occupied with the rumours about him f*cking women all around. He would not have the time to calm his guild members while he’s at it. By then, the Lone Desert Smoke will no longer be able to stay united!\"</p><br/><p>Zhong Xiu Hua revealed a cold smile on his face. Then he said, \"When the Lone Desert Smoke is breaking apart, we shall immediately launch Territory Conquests over the three Territories that Zhang Yang currently possesses. After acquiring all three territories, we shall buy 100 Model 4.0 Tanks. By then, let’s see who is daring enough to launch a Territory Conquest over our new territories! Hahaha!\"</p><br/><p>\"Master Zhong, the Territories are great gold mines, you know?\"</p><br/><p>\"That’s right! If we take 1 gold piece as the fee for every use of the Teleportation Circle service, just imagine how much we can earn even if each player only use the Teleportation of our Territories once a day! Currently, the population of the players in China Region is approximately 200,000,000! So that’s a total of 200,000,000 pieces of gold a day! How cool is that?!\"</p><br/><p>\"200,000,000?!\" Longrich widened his eyes so wide that his eyes were about to pop out. Even though they knew that Territories could really generate quite a sum of money for the ones who own the Territories, they had never actually done a close up calculation on the sum of money that Territories could earn for their owners. Instantly, everyone was shocked to hear that amount of daily salary! One day 20,000,000 gold pieces. Then does that mean the owner of one Territory could earn up to a total of 70,000,000,000 gold pieces a year! Calculating on, 10 years would generate over 700,000,000,000 gold pieces! And how about 100 years… they continued to calculate…</p><br/><p>Even if one could only earn that 20,000,000 gold pieces, that amount should be enough to keep that bombshell Luo Yu Rou as mistress and spend like hell on her! Didn’t that b*tch want to keep her clothes on? Then, after keeping her as a mistress, she shall not be allowed to wear anything on her! Look at her and toy with her until she lose her five senses! That were the ideas that went through the dirty mind of Death Arbiter. He licked his lips again while he could obviously felt a tent being set up right between his two thighs.</p><br/><p>\"Rest assured, everyone. As long as we can take down the Territories, everyone gets a share. All of you here are seniors in the guild. So, every one of you will get a share of the profit!\" Before they even start their plan, Zhong Xiu Hua had begun dividing the profits among themselves.</p><br/><p>Of course, throwing out the sum of 20,000,000 gold pieces was an act of encouraging his guild members to work for him. Because of that, everyone was pumped to give their 100% to get the plan done.</p><br/><p>Zhong Xiu Hua narrowed his eyes a little as he was visualizing the possible outcome of the plan. The moment when Lone Desert gets dismantled, Zhang Yang would lose his Territories. Then, he would lose all his precious things one after another. By then, he would only be an insignificant player that could only play the game well. Zhong Xiu Hua still believed that Zhang Yang would be lower than a piece of sh*t if ‘God’s Miracle’ did not exist in the first place. He still believed that Zhang Yang was not worthy of becoming his opponent!</p><br/><p>Based on Sun Xin Yu’s pride and prejudice, she would never stay by the side of a loser. Meanwhile, the Sun Family would never agree to allow their precious daughter in the house to be married to a hoodlum that suddenly got rich overnight. Well, political families such as Sun Family would not look at how rich the person is. They would look at how influential the man could be in the field of politics and economies.</p><br/><p>It seemed possible! The plan seemed simple but possible!</p><br/><p>Zhong Xiu Hua nodded and said, \"From now onwards, get closer to the core members of the Lone Desert Smoke. Get their trust and befriend them if you can. Once the plan starts, we shall start convincing them to leave Lone Desert Smoke and come join our guild!\"</p><br/><p>\"Yes, master Zhong!\"</p><br/><p>Scholar Musou and the others nodded.</p><br/><p>...</p><br/><p>\"Noob tank! Noob tank! Look! I’m really awesome right? Look at this! I’ve managed to draw the tickets to the gala premier of Luo Yu Rou’s latest movie ‘Suspect in the Castle’! Not only can we watch the movie for free, we can also get the signature of Luo Yu Rou from her personally! Of course, she will sign on her posters for us!\" Before she even walked up to Zhang Yang, Wei Yan Er had been waving her hands shouting in excitement.</p><br/><p>Zhang Yang sighed. Well, now he could not go home straight away after work. He would have to fetch this little brat first before that.</p><br/><p>\"Fine, fine… you can drop that show off attitude and get in the car now!\" Although the little brat was a little unbelievably strange sometimes, her popularity was really something that one could admire. Zhang Yang did not want to be called ‘brother-in-law’ all over the place by her admirers.</p><br/><p>Oh great… there they come… the army of Wei Yan Er’s admirers had followed her. They were smiling and acting politely towards Zhang Yang. Well, they really wished that Zhang Yang would let them board the car so that they could continue to pursue the little brat.</p><br/><p>That’s strange… don’t people still love big boobies? How could this little brat suddenly become so popular among men, then!? It seemed that there are a lot more people with weird tastes hiding in plain sight!</p><br/>\n</div>"}