{"title": "Chapter 783: A Wind-Up Work!", "id": 783, "volume": 8, "url": "http://boxnovel.org/mmorpg-rebirth-of-the-legendary-guardian-chapter-783-a-wind-up-work", "volume_title": "Volume 8", "body": "<h1>Chapter 783: A Wind-Up Work!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 783: A Wind-Up Work!</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>So who could they be then? Which party was currently battling the boss then?</p><br/><p>Well, it would not matter much. Since Zhang Yang and his gang had arrived, they would definitely be sticking their feet into the battle. The existence of World Class bosses was to encourage players to compete against each other in order to snatch the boss kill for themselves. There was no such thing as a ‘first come first serve’ basis. Everything will be based on one’s capability of snatching!</p><br/><p>Zhang Yang and his gang were staying low by the bushes as they were observing the boss battle. There were a total of 16 Model 4.0 Tanks lining up by the legs of the boss. They were launching their most ferocious attacks on the boss. Other than the 16 Tanks, there were also more than 10 players who had activated their Inheritance Transformation acting on their own free will.</p><br/><p>\"Huh?\" Zhang Yang squinted and took a closer look at the players. Those players really seemed very familiar --- Dragon Marquis, Scholar Musou, Longrich, Death Arbiter and the other core players of Eternal Flames!</p><br/><p>However, the tactic they were using was a little stupid.</p><br/><p>Zhang Yang shook his head and sighed heavily after seeing how Eternal Flame operated in a battle. At the same time, he sent out messages to inform the rest of his troops to come over here.</p><br/><p>Truth be told, the Tanks could only be used to overcome the disadvantage of players without Inheritance Transformation who had low amounts of HP. They were merely a new tool introduced for the normal players to use against players with Inheritance Transformations. Because the Tanks had a maximum durability, once the Tanks degrade to a certain level, the Tanks would be destroyed automatically. When that happens, they would have to be sent back to the Blacksmiths in the main cities for repairs in order to be used again.</p><br/><p>Even if the Tanks were all 50-player scale Model 4.0 Tanks and each of the players had over 700,000 HP, each Tank would only have a Maximum HP of 35,000,000 HP. Meanwhile, Sandra was obviously a World Boss. Its {Trample of War} could be activated once every 5 seconds. The Stone Giant could deal a DPS of 70,000 damage. So it would only require 500 seconds in order for the boss to take out a total of 35,000,000 HP!</p><br/><p>The players on the Tank could still be healed constantly. However, the HP bar of the Tank would not change based on that. Well, it was pretty obvious that they would need more than just 8 minutes to empty out the HP bar of the boss. So when the Tanks are destroyed, the players would be back to square.</p><br/><p>The right way of using the Tanks would be to send the Tanks into battle, batch by batch. When the HP bar of the Tanks on the frontlines are about to deplete, the players should just keep the Tank into the inventory and retreat. They should let the players who possess a Tank to retreat far from the frontlines to get healed up or to get killed instantly. Either way, the Tanks could get out of their Battle Mode so that they could recover their HP bars.</p><br/><p>The 16 Tanks could just be arranged into a formation where they could take turns going to the frontline of the battlefield. By doing so, they would only have to maintain their firepower on the boss to keep the boss from exiting its Battle Mode. Or else, if the boss gets to recover its HP bar back to full, the party would be wiped out completely by the boss. That was one efficient way of winning a drawn-out war against a World boss. Or else, they would need to travel all the way back to their main cities to get their destroyed Tanks repaired. Who could afford to wait for so long without dying?</p><br/><p>Were they not relying too much on the Tanks then?</p><br/><p>No, that should not be the case. Well, because the Tank System had just been introduced into the game. Many players had not get used to the Tanks that had the potential of breaking the balance of the game. They thought that the Tanks functioned similarly to their pet mounts. As long as the players on top of them did not die, the Tanks or the pet mounts beneath the players would not be destroyed or die as well!</p><br/><p>The Graveyard was located extremely far from where they were right now. Therefore, they could only opt for the weak resurrection every time they die in order to stay in the boss battle. Upon resurrection, they could just hop onto their mounts and get back to the boss as soon as they are able to. Or else, they would require at least 2 to 3 hours to come all the way back if they wanted to run back to their dead bodies on foot.</p><br/><p>Zhang Yang grinned with a sense of evilness on his face. Then he said, \"Get ready, guys. When they’re about to be wiped out, we’ll charge in and take them out!\"</p><br/><p>\"Alright! Alright!\" Wei Yan Er took up her scythe and revealed a sinister smile on her pretty little face. She seemed to be pumped up, alright. Her craving for battle was written crystal clear on her face.</p><br/><p>Things escalated just like how Zhang Yang predicted. About 8 minutes later, the 16 Tanks were beginning to fall apart, piece by piece. The players onboard were beginning to fall off the diminishing structure and roll over the ground like idiots. Well, without the Tanks, the damage that the players were about to sustain would be on a whole new level!</p><br/><p>When the player received damage while onboard of the Tanks, it wouldn’t matter how many players there were onboard the Tanks. They would all be considered as a single unit. Therefore, all 50 players on the Model 4.0 Tank would only receive a total of 350,000 damage as a single unit, each time they take the AoE attack of the boss. Therefore, the Healers would not suffer too much stress while healing the players on the Tanks.</p><br/><p>However, whenever a Tank breaks into pieces, each of the 50 players would receive 350,000 damage. Not all Healers would have powerful enough equipment to heal enough amount of HP to catch up with the DPS of 70,000 damage of the boss! Furthermore, Eternal Flame only assigned 3 Healers on each Tank. The Healers would still be capable of healing a total of 350,000 HP over 5 seconds. However, it would not be possible for any of their Healers to heal 50 players with 350,000 HP within 5 seconds.</p><br/><p>Well, Zhong Xiu Hua was not dead yet. He could actually levitate in the middle of the sky by his own ability. It seemed that he managed to acquire a Class A Inheritance for himself.</p><br/><p>\"Noob tank, shouldn’t we go in now?\" Wei Yan Er was more than ready to slaughter her preys.</p><br/><p>\"A little while more. Let them deplete a little more of the boss’s HP. We also need to wait for the others to arrive before we can launch a full-scale attack on them.\"</p><br/><p>\"Hehe, I never thought that you can be so cunning sometimes!\"</p><br/><p>\"It’s called resourcefulness! How can you say that I’m cunning?! Say something else, please!\"</p><br/><p>\"Nope! Not going to change my opinion on you!\"</p><br/><p>\"Well, about your next next year’s salary from the Little Merchandize Shop...\"</p><br/><p>\"Wow, noob tank! I suddenly realized that you’re heroic and brilliant! You’re like an unbeatable general from the east!\" By hitting the right spot, Wei Yan Er straight away tried to compromise with Zhang Yang.</p><br/><p>Zhang Yang nodded in contentment. Then he continued to observe the battle between the Eternal Flame and the boss.</p><br/><p>The Eternal Flame could only deal a DPS of approximately 1,500,000 damage to the boss. Under the influence of the boss’s {Elemental Constitution}, their firepower was no match for the boss’s HP Recovery Rate. They could only stare at the boss’s HP bar that went back up after trying so hard to bring the HP bar down a tiny bit. Slaying the boss in two hours had become impossible, even if a miracle happens to them now!</p><br/><p>How about the players who were running back to their dead bodies?</p><br/><p>It was unfortunate that their Tanks had been destroyed. Without proper repairs, they would not be able to use their Tanks at the moment. Even if they come back to the boss, they would only become food for powder in the boss battle. They would get themselves killed again after receiving two or three hits from the boss. How about taking a trip back to the main cities to get their Tanks repaired? That would be a joke!</p><br/><p>The number of players remaining in the boss battle was 15. However, only two of them were Healers. It became impossible for the two Healers to heal 70,000* 15 which equals to a total of 1,050,000 HP in every second. Because of shortage in their Healing Capability, the remaining players of the Eternal Flame could only activate their Inheritance Transformation to boost their HP bars in order for them to stay in the fight!</p><br/><p>However, the amount of damage they were sustaining was far greater than the amount of HP their Healers could heal them over the time. So, they would definitely be dead, eventually if that goes on! Furthermore, the difference between the damage they received and the amount of HP they could heal was large. Not every one of them had over 10,000,000 HP as well. So, they only seemed to be able to last for about 10 minutes before they are wiped out completely!</p><br/><p>10 minutes, huh?</p><br/><p>Zhang Yang was setting his mind on the location of the Graveyard. He was f*cking sure that 10 minutes was not enough for anyone to run all the way back here. So, it would not be possible for them to run back to their dead bodies in time to rejoin the boss battle.</p><br/><p>Therefore, the players would need to be assigned into different batches when they are going up against a World boss. In such a way, they could form into a ladder-shaped formation and take turns battling the boss. If they still had the Tanks with them, they could assign 10 Healers on each Tank. By doing so, they could definitely heal back the HP bars of Scholar Musou and the others.</p><br/><p>Of course, Zhang Yang would not waste his brain cells to think about all that. Why show compassion to the enemies who wanted to destroy him? Instead, he said, \"Everyone, look closely now. When their HP bars drop to about 20%, we shall charge out and lay waste on them! We might get lucky and pick up some good stuff after we finish them off!\"</p><br/><p>\"Hehehe!\" Everyone laughed out loud. Wei Yan Er muttered to herself, \"And you said you’re not cunning… evil…\"</p><br/><p>\"Okay! Activate your Inheritance Transformations and charge!\"</p><br/><p>Under the insane bombardment of the boss’s attacks, Eternal Flame was about to get wiped out, even though they had tried their best. Meanwhile, Zhang Yang and his gang’s appearance had rung the ‘bell of doom’ for Zhong Xiu Hua and his fellow members of his Eternal Flame.</p><br/><p>\"Zhang Yang?!\" Zhong Xiu Hua’s face went pale. He stared at Zhang Yang with rage.</p><br/><p>\"How are you doing? Does your chin still hurt?\" Zhang Yang asked out of convenience. However, his axe was being swung straight at Death Arbiter without mercy. The normal attack was followed closely by a {Killing Cleave}! At that moment, Death Arbiter only had 17% HP remaining, before the axe struck straight into his skull and killed him instantly!</p><br/><p>\"Looting a burning house!? Is this what Lone Desert Smoke do best?\" Longrich spoke coldly as he was attempting to get away from Wei Yan Er’s scary-*ss scythe.</p><br/><p>\"You’re wrong! This is merely a relentlessly beating on the dogs in the water! We have no reason to show mercy to bad people even if they're down! Hahaha!\" Fatty Han replied him. Right after that, Fatty Han began shooting his arrows one after another towards his enemy. That fatty was actually dealing quite a number of damage to his foes. Although his PvP skills were not really top Tier, to begin with, his personal DPS was quite stunning. Even though he could not be classified as a Top Tier DPS player, the amount of damage he could deal was not embarrassing.</p><br/><p>After all, there was only one way to deal damage. Whoever hits harder will triumph over those who hit softer! Practice makes perfect! Nothing more! Unlike PvP matches, players do not have to make precise decisions, according to the situation of the battlefield. Well, in PvP matches, the decisions and reactions of the player would define whether he or she was a good player or not.</p><br/><p>\"Don’t go too far, you mother f*ckers!\" Zhong Xiu Hua calmed himself down immediately after he shouted. Then he said, \"Let’s make a deal, okay? We can join forces to deal with the boss first. Then we shall split the loots in half. Or else, we’ll just announce the coordinate of the boss! You’re not going to be taking the boss all to yourselves!\"</p><br/><p>\"You who carry the surname Zhong, are you giving us an impression that you’re weak? You’re Master Zhong and you’re begging us? Ha.\" Zhang Yang laughed vaguely and looked at Zhong Xiu Hua with disdain. If Zhong Xiu Hua is the prince in real life, then Zhang Yang would be the King, the emperor of the game! No one would be able to match his strength and power!</p><br/><p>\"YOU --- You shameless f*ck! Argh! Die!\" Zhong Xiu Hua was overwhelmed by his own rage. Well, he had been humiliated once before. Furthermore, Zhang Yang had knocked a few teeth out of him, previously. His father had yet to rise to power. So he could not afford to do anything too reckless that might affect his father’s career. If it wasn’t for that, he might have gone all out on destroying Zhang Yang.</p><br/><p>\"Stop quacking like a duck and start fighting, you miserable f*ck!\" Zhang Yang humphed coldly and went on slaughtering the members of the Eternal Flame with the boss’s ‘help’. It did not take long before they wiped out the remaining members of the Eternal Flame.</p><br/><p>\"Please take note, everybody! The location where the boss is spawned is XXXXX, YYYYY! I’m Dragon Marquis, the guildmaster of the Eternal Flame. I can assure you, my words hold true!\" Zhong Xiu Hua immediately chose weak resurrection the moment he died. Then he quickly shouted the coordinates of the boss into the public channel. Every single player in the China Region who was searching near the Bama Volcano could see what he said.</p><br/><p>\"Pui! If he knows where the boss is, he would have gone there to slay the boss! So, why would he share the wealth with others? This must be a hoax!\"</p><br/><p>\"He’s the guildmaster of Eternal Flames! Maybe he’s telling the truth?\"</p><br/><p>\"He could be spreading false information to lead us far away from the actual boss, so that he secures all of the Ascended Tier equipment all to himself?!\"</p><br/><p>\"That’s right! Even if he really knows where the boss is, he would have told everyone the fake coordinates! He could prevent other guilds from competing with his guild in taking down the boss!\"</p><br/><p>\"Screw that f*cking c*nt then! What sort of f*cktard is that? Shameless piece of sh*t!\"</p><br/><p>\"That’s right! Despicable f*ck!\"</p><br/><p>The public channel began to get bombarded with debates and comments. Every single one of them was skeptical about what Zhong Xiu Hua just said. Zhong Xiu Hua was so pissed that he almost popped all his veins! However, there were also a small number of players who chose to believe his words. So they began to move towards the coordinates that Zhong Xiu Hua had shouted out in the public channel.</p><br/>\n</div>"}