{"title": "Chapter 787: Ill-Fate", "id": 787, "volume": 8, "url": "http://boxnovel.org/mmorpg-rebirth-of-the-legendary-guardian-chapter-787-ill-fate", "volume_title": "Volume 8", "body": "<h1>Chapter 787: Ill-Fate</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 787: Ill-Fate</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Zhang Yang had a strange dream.</p><br/><p>In the dream, he was having a fierce ‘battle’ with Sun Xin Yu and Han Ying Xue. He did it to them in all sorts of positions! That included many positions that they had never tried before! Well, he was very content with the session. His eyes were blurry. He saw that the woman beside her was not Sun Xin Yu nor Han Ying Xue. As his vision cleared, he saw that the woman was Yu Li! The next moment, he saw the woman as the witch who always seduced him, Chen Xue Yao! By the end of it, he saw the woman as a woman that he did not know at all!</p><br/><p>Well, that woman wasn’t a total stranger to him as well. Zhang Yang had just watched her movies a few days back. Well, it was probably because her stunning body curves were mesmerizing to the point that it was stuck deep somewhere in his brain. Well, he actually dreamed of having sex with her!</p><br/><p>The situation was like a dream and not a dream at the same time. Zhang Yang let the animal within him out as he made love to the woman on the bed. He went on with the woman until he had no juice left in him to give out anymore! After he was exhausted, he slept like nobody’s business.</p><br/><p>A night passed, rays of sunlight slipped through the space between the curtains and shone upon Zhang Yang and his bare naked *ss. Zhang Yang struggled to open up his eyes. The unfamiliar surroundings gave his heart a shock. Everything that happened to him earlier on had slipped back into his mind --- he was attacked with tranquilizing darts while he was jogging. After that, he passed out and woke up here.</p><br/><p>Meanwhile, he immediately noticed that he was not alone on the bed. There was a naked woman lying right below him! What’s even better was that he could feel his little JJ stuck solidly inside something! The moment he tried to move, the sudden movement of his thick ‘rod’ woke the woman up immediately.</p><br/><p>The woman’s hair covered her entire face in a messy condition. As she moved her hair a bit to the side, her pretty little face was revealed right before Zhang Yang’s eyes. Her eyes were watery, and she had a perfectly shaped nose. Her face was so fair that it looked a white jade and her lips were pink like cherry blossoms. Her appearance was just mesmerizing that his soul was almost blown away.</p><br/><p>It was… Luo Yu Rou!</p><br/><p>Zhang Yang immediately remembered whose pretty face this was!</p><br/><p>At the same time, Luo Yu Rou was waking up from her dreamy and yet blurry sleep. After seeing her naked body pressed on by another naked man, her watery eyes changed from the state of shock to the state of anger. She opened up her lips, and she was about to scream the hell out of her voice.</p><br/><p>Zhang Yang could not afford to let her scream, of course. If this thing is left to escalate, even if he could jump into the Huanghe River, he could never wash himself clean!</p><br/><p>‘Shameless fan sneaked into the room of superstar goddess Luo Yu Rou and committed a crime where even gods will tremble in anger!’</p><br/><p>If that title ever gets out into public, even if Zhang Yang would get arrested and brought back to the police station to be treated like a sexual predator, and the massive number of her fans would be lining up to cut off his ‘rod’ over and over again!</p><br/><p>He quickly pushed his waist forward, opened wide and put his mouth over hers just to shut her up. He even licked the little, soft tongue of the woman! Although it was not the right time, Zhang Yang was a little over-energetic at the moment. His ‘rod’ could not help to expand further and got hardened even further. The ‘little Zhang Yang’ that had not left the ‘secret tunnel’ immediately expanded and stretched it out!</p><br/><p>Luo Yu Rou was so shocked to feel her ‘tunnel’ being filled up by a solid rod. Terror began to spread across her face as she attempted to escape. Well, might as well be hanged as a wolf instead of a lamb. Zhang Yang could not let her escape of course. Immediately, Zhang Yang turned around and pressed her down onto the bed. He covered Luo Yu Rou’s mouth with his hand. On the other hand, the girl was scratching Zhang Yang’s back like an angry cat.</p><br/><p>Zhang Yang pressed his voice as low as he could and said, \"Stop moving around like that and listen to me!\"</p><br/><p>Luo Yu Rou was so infuriated that she was about to lose her mind. This stinky man! How dare he conquer her body and ask her to follow his instructions? She found an opening and opened up her mouth. Then she bit Zhang Yang’s finger hard and a coppery liquid began to drip into her mouth.</p><br/><p>\"Tsk!\" Zhang Yang grinned. Then he immediately put his hand by the chin of the girl and pressed hard to shut her up. Two of his fingers were covered in blood.</p><br/><p>This girl was really ferocious. Currently, her eyes looked like the eyes of a killer. If Zhang Yang had let her grab hold of a knife, she would have undoubtedly stabbed him to death!</p><br/><p>\"I’ve been set up too!\" Zhang Yang had roughly made sense of the entire incident by now, \"I was having a morning jog yesterday morning when I was abducted. When I woke up, I found myself here with you! So please, calm yourself first! Think about what happened last night! Did something odd happened to you last night?\"</p><br/><p>Luo Yu Rou suddenly stopped struggling for a moment. She recalled about the unexplainable strong sexual urge that got hold of her entirely after she took a shower. Well, it was her first time experiencing that sort of blazing urge over sexual need. And everything started... after she took that cup of water from that bottle on the table!</p><br/><p>Did someone drug her through the water?</p><br/><p>If she was not bright enough, she would still not believed Zhang Yang’s words. However, she was not the type of woman who only has large boobies without brains. So, she found some valid points in Zhang Yang’s words. She was willing to accept that Zhang Yang was not so naïve that he would lie to her over such a thing. Furthermore, she was not totally out when everything happened throughout the night. She could still recall fragments of memories that she made the first move to have sex with Zhang Yang. She was riding on Zhang Yang like a lady knight, ‘sweeping’ over the length and breadth of Zhang Yang’s ‘rod’. Zhang Yang had not even moved an inch of his body while she was at it.</p><br/><p>If Zhang Yang was not tranquilized by the dart, he would definitely… well, any men would definitely move the tiniest bit, under those circumstances!</p><br/><p>No matter what the situation turned out to be, she was indeed a victim of the incident. Furthermore, the thick ‘rod’ of this man was still firmly inside her ‘tunnel’. Although Zhang Yang did not pull or push, the hot thick ‘rod’ was filling the space of her ‘tunnel’ so tightly that she was about to lose her mind a bit. Well, because of that, she could not help but recall last night’s events. Her entire body lost its strength at the thought of it.</p><br/><p>Subjectively speaking, she hates all men on earth. She even hated women! However, objectively speaking, she is a very sensitive woman. So she would have her own needs in such regards as well. Because she hated all the men in the world, she had never thought about marriage, at all. Meanwhile, she had been using her very own synthetic ‘rod’ to settle her own desires.</p><br/><p>However, the massaging ‘rod’ could only satisfy her in the aspect of size. However, it would not match the full function of the real ‘rod’!</p><br/><p>So, she stopped her struggle. Instead of screaming like a little b*tch, she calmly looked at Zhang Yang to express that she had already calmed her tits.</p><br/><p>Zhang Yang slowly moved his hands away. However, he was prepared to subdue her if she ever wanted to try anything funny.</p><br/><p>\"Take that filthy thing of yours out of my body first!\" Luo Yu Rou said in a miserable tone. She was currently overwhelmed by shame and disgust.</p><br/><p>\"Erk!\" Zhang Yang blushed and quickly sat up with his knees down. Meanwhile, the ‘secret tunnel’ of the girl didn’t seem to want to let go of the hard-rock rod. When the rod was pulled out in an instant, a ‘pop’ sound was heard! The two of them were so embarrassed that they lowered their heads for a while.</p><br/><p>Luo Yu Rou quickly pulled the blanket around her. Zhang Yang wanted to do the same. However, both blankets had been pulled away by the girl. She did not leave one for Zhang Yang either. Well, Zhang Yang had no shame at all in exposing himself. Firstly, he is a man. Secondly, the both of them had done something that they weren’t even aware of. Therefore, he just sat there like nobody’s business.</p><br/><p>\"Can’t you just cover your filthy part for a little?\" Luo Yu Rou tightened her teeth. She had now suffered a great deal. Although she really wanted to kill Zhang Yang at first, she also knew that this must not be escalated after she had calmed herself down. Or else, that would be the end of her movie industry career.</p><br/><p>However, everything was so suspicious. Who would throw Zhang Yang over to her room and drug her with aphrodisiac? So what’s the agenda of the man who’s behind all this?</p><br/><p>Zhang Yang smiled vaguely as if he did not care about it at all. However, he suddenly had a thought. Countless men over the entire country had been dreaming of seeing Luo Yu Rou sacrificing her body for the purpose of ‘Art’. They were waiting for the woman to reveal her perfectly curved, naked body in front of public. If her fans knew that their goddess is now sitting naked in front of Zhang Yang after spending a night with him, countless fans would definitely get jealous to the point that they would want to die!</p><br/><p>The atmosphere was awkward. The two of them sat apart while facing each other without saying a single word.</p><br/><p>However, it did not take long before Zhang Yang figured something out. So he said, \"It would not matter much even if we know who put me here. But that person must want us both to be here so that we could… eherm… I think that whatever happened yesterday night has already been recorded by someone!\"</p><br/><p>Luo Yu Rou instantly went rigid. Her face turned pale in an instant. Yes, she loved to show her sexiness in front of the public. However, that doesn’t mean that she’s a simple woman who would have sex with any man! Truth be told, Zhang Yang was in fact the first man who shoved his rod into her secret tunnel! The moment she imagined what the photos and news would say about that, she felt the urge of killing herself already!</p><br/><p>So, could this be Zhong Xiu Hua then?</p><br/><p>That f*cking cunning man had tried to get another girl to seduce him before. However, the first plan was ruined, all thanks to Chen Xue Yao. However, it seemed that Zhong Xiu Hua did not give up at all. Instead, he tranquilized Zhang Yang straight away and took him right over to the hotel. Then, he drugged Luo Yu Rou with aphrodisiac and created an ill fate between Zhang Yang and Luo Yu Rou.</p><br/><p>Zhang Yang’s face was quite pale, himself. However, when he looked at the pale face of Luo Yu Rou, he knew that he could not change the fact that the two of them had a one night stand. So he could not help but sigh heavily. Then he said, \"If this thing escalates to the point that there’s no turning back, I’ll arrange a trip for you to get out of this country. Let the incident be washed away by time. As for money, you don’t have to worry!\"</p><br/><p>Tears began to roll down from Luo Yu Rou’s watery eyes. What did this man think she was? Did he just categorize her as one of those female superstars who sleeps with men? The more she thought about it, the more she grieved in remorse. She instantly pushed forward and attacked Zhang Yang. She pinched and bit Zhang Yang as hard as she could. She spoke with anger, \"I’m not a prostitute! What made you think that you can see me as one!\"</p><br/><p>Zhang Yang did not see her as an important person in his life. Well, there was not much of a difference between a prostitute and a female superstar. The name was just a label that defines their ‘price,’ after all. One might look very pricey while the other might look so very cheap. One might collect high fees for the service while the other might just collect a small amount of money to get men satisfied.</p><br/><p>Zhang Yang’s eyes betrayed his thoughts to Luo Yu Rou. Luo Yu Rou was so angry and hopeless at the same time. Her body was trembling so violently that Zhang Yang could feel her emotions right now. \"Get out! You! Get out now!\"</p><br/><p>Seeing her rage blazing across her eyes and her voice, Zhang Yang could not help to put himself down a little. Then he apologized, \"I’m sorry… I should not have said that… I sincerely apologize to you, Ms. Luo…\"</p><br/><p>After that, Luo Yu Rou only pulled herself back and sat down. Then she asked, \"So what should we do?\" That was her first time she had ever shown her weak side to someone.</p><br/><p>Zhang Yang smiled bitterly. If there are really some hidden cameras installed in the room --- which is more than likely, then the person behind all this must have gotten what they wanted. So everything would be pointless no matter what they do next. Sh*t’s about to hit the fan. So, they could only react to the situation whenever something arises.</p><br/><p>\"Maybe they just want to blackmail us for money!\" Luo Yu Rou comforted herself a little.</p><br/><p>If this was done by someone else, it would be possible that they were just doing it for money. However, Zhang Yang was 80% sure that this incident was planned out by Zhong Xiu Hua. So, the schemer did not do it for money. They just wanted to make sure that Zhang Yang loses his name and prestige! Speaking of which, Luo Yu Rou was just an innocent victim that got caught in the crossfire between him and Zhong Xiu Hua!</p><br/><p>When his thoughts stopped there, he could not help to feel sorry for what just happened to Luo Yu Rou. Then he said, \"I’m afraid that you’re going to be disappointed now…\" Zhong Xiu Hua was obviously not recording all this to blackmail Zhang Yang. He would just release the pictures and photos out into public without having second thoughts. After all, his true agenda was to make Sun Xin Yu leave Zhang Yang!</p><br/><p>Thinking of which, he quickly took up the phone by his side and called back home. He had disappeared for a full day. Those ladies in the house must be panicking right now!</p><br/><p>When the phone was picked up, Zhang Yang roughly explained the entire situation to Sun Xin Yu. He held nothing back. Well, paper cannot smother fire after all. Meanwhile, he was indeed the victim of this incident!</p><br/><p>He did not even need to say who might be behind all that. Sun Xin Yu was 99% sure that she knew it was all Zhong Xiu Hua’s doing. She immediately had the urge to put a bullet through that Zhong Xiu Hua’s head.</p><br/>\n</div>"}