{"title": "Chapter 797: Greling Crypt", "id": 797, "volume": 8, "url": "http://boxnovel.org/mmorpg-rebirth-of-the-legendary-guardian-chapter-797-greling-crypt", "volume_title": "Volume 8", "body": "<h1>Chapter 797: Greling Crypt</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 797: Greling Crypt</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Even when {Thunder Strike} had been strengthened, the number of monsters that had gradually gained numbers by the minute made the skill’ 3 meters effective range rather weak. There will always be monsters that \"escape\" the effective range and manage to attack Zhang Yang.</p><br/><p>If {Thunder Strike} wasn’t enough…</p><br/><p>{Blast Wave}! {Brutal Smash}! {Heroic Leap}!</p><br/><p>Zhang Yang unleashed more and more skills to compensate for the insufficiency of {Thunder Strike}. Han Ying Xue and Fantasy Sweetheart even managed to lend a hand by using {Lunar’s Imprisonment} and other controlling skills to slow down the monsters’ pursuit.</p><br/><p>At one point, the entire party was attacking at the same time!</p><br/><p>Once the monsters that were chasing after Zhang Yang were killed, the threat on Zhang Yang was reduced greatly.</p><br/><p>7 minutes…8 minutes…9 minutes…</p><br/><p>Despite having eliminated a large number of monsters, there were still 54 more monsters chasing after Zhang Yang. The number of monsters that had exceeded the coverage of {Thunder Strike} had grown to be such a problem that Zhang Yang no choice but to take a few direct hits. If wasn’t for his Transformed state, Zhang Yang would have already been gobbled up. Even so, his HP was still dropping like an open faucet! Eventually, he had less than 20,000,000 HP left.</p><br/><p>When things got out of control, Zhang Yang had resorted to using {God of War Radiance} to fully restore all his HP. However, in less than 30 seconds, the number of monsters, coupled with the attack boost of the boss had his entire 100 million HP drained down to 0.</p><br/><p>Zhang Yang felt the need to go all out and used his accessory Invulnerability, giving time for Han Ying Xue to cast her {Milkmaid Deity’s Ripple}. After that, Zhang Yang had slowly regained 10% HP at a time and could now last slightly longer.</p><br/><p>\"Hold on for a little longer! The boss has 4% HP left!\"</p><br/><p>\"F*cking hell! It’s easier said than done! Fight the boss! Don’t stop to talk!\" cried Zhang Yang. In the past, or rather, before this boss fight, the number of monsters that he could tank was 20! That was his limit! Yet, he had managed to pull that number up to 50 at once! It was more than double!</p><br/><p>At then, he felt extremely lucky to have so many of his skills strengthened. If {Thunder Strike} was not upgraded and still had a 5-second cooldown instead of 8, the monsters would have killed him already! Even so, it had taken all of Zhang Yang’s neurons firing in overdrive to dodge and kite!</p><br/><p>\"Just a little more!\" cried Fatty Han.</p><br/><p>\"I’m about to die you bastard!\" cried Zhang Yang. The Invulnerability that the accessory granted him lasted only for 10 seconds. Even though Zhang Yang’s HP was slowly being restored by {Milkmaid Deity’s Ripple}, once the Invulnerability wears off, all the \"Celestial\" tier monsters will rip him to shreds!</p><br/><p>\"Just a tiny bit more!\"</p><br/><p>\"How long!?\"</p><br/><p>\"NOW! AND…..WE…ARE…DONE!\"</p><br/><p>THUD!</p><br/><p>A loud crashing sound was heard and the enormous body of the boss fell to the earth. Upon the death of the boss, all the \"summoned\" monsters disappeared into thin air, leaving Zhang Yang panting for breath with his shield still held up high and his sword prepared to stab, like a warrior’s statue in ancient Rome.</p><br/><p>\"Woah…That’s a cool pose there, noobie tank!\" cried Wei Yan Er as she clapped slowly.</p><br/><p>\"Cool!? COOL!? YOUR SISTER’S *SS THAT’S COOL!\" Zhang Yang yelled at the top of his lungs. It was the first time that he had tanked so many monsters at a time. If he were to continue on for just a few more seconds, his shield’s durability would have dropped down to zero, rendering him unable to equip the shield until it is fixed. (1)</p><br/><p>\"Hey! When did I wrong you?!\" cried Han Ying Xue as she pinched Zhang Yang cheek.</p><br/><p>Wei Yan Er proceeded to go through her usual routine. Since the boss was so difficult to kill and had even forced them to use their Transformation skills, the loot would better be good. Sadly, the Ancient Hybrid Beast King was the same as the Silvery Scale Eel King. There was only 1 Holy tier equipment and two Ethereal tier equipment. All of them had the same 30 Levels reduction special. However! Seeing that the battle had been an incredible fight, the items dropped did not match the boss’ difficulty! Not by a long shot!</p><br/><p>In the end, Zhang Yang had to shrug it off. The harder the quest, the better chance he would have at getting the Land Lease from the old gambler. It’s a way for the developers to weed out the weak ones. By putting in effort, striving through hardships, only may you have a chance to obtain good items. Zhang Yang laughed all of the sudden and asked everyone to pack up to return to the NPC.</p><br/><p>\"Gods have mercy! That’s the real Claw of the Ancient Hybrid Beast King!\" Harcus cried. \"That’s…That’s…IMPOSSIBLE! How could a weak little girl like you defeat such a legendary beast!\"</p><br/><p>The little girl smiled instead of getting mad at the goblin for calling her a little girl. \"Hehe! Well? Gimme dem boots!\"</p><br/><p>Harcus cringed painfully at the thought of losing the bet, but a bet was a bet and he removed the boots and tossed them towards Wei Yan Er. The boots dropped to the floor near Zhang Yang and Wei Yan Er and emitted a smell so pungent that both of them had to pinch their noses.</p><br/><p>Zhang Yang had not received any system notifications about completing the quest. It looked like the old gambler’s quest can only be accepted by one player only. Since the quest item was in the little girl’s hands, she was the only player who could complete the quest.</p><br/><p>Harcus stood restlessly since he was standing on the hard rocky grounds barefooted. The goblin even had a gap in his teeth! With rage steaming, the goblin jumped with anger and cried, \"One more! One more bet!\"</p><br/><p>Zhang Yang crossed his arms and said, \"Old goblin, you have nothing else to offer, besides your pants. If you still want to continue this gamble, you better offer us something that we want!\"</p><br/><p>\"Hehe! Hold your horses there, human!\" The old goblins ruffled the back of his trousers and pulled out a long piece of scroll and said, \"Here is my offer! The Land Lease of my property in the Holy City of Anthylor!\"</p><br/><p>\"I accept!\" said Zhang Yang instantly. He had been waiting for the lease since the beginning of the quest. \"What shall we bet on?\"</p><br/><p>\"Hehe! My bet for you is the broken sword of the of the Hell Ghost King! Bring it back here and I’ll give you the Land Lease! If you can’t, I’ll have my tooth and boots back, please.\"</p><br/><p>‘Ding! Harcus the Old Gambler has a quest for you: Hell Ghost King. Will you accept it?’</p><br/><p>\"A gentleman’s agreement!\" said Zhang Yang as he reached out his hand to shake the goblin’s.</p><br/><p>[Hell Ghost King] (Difficulty Level: S)</p><br/><p>Description: The old goblin bets that you will fail to defeat the Hell Ghost King! Prove him wrong and win the bet by going to the North of the Gerling Crypt in the North!</p><br/><p>Progress: Broken Sword of the Hell Ghost King 0/1</p><br/><p>S Difficulty!</p><br/><p>When A Level Difficulty had provided such a difficult Holy tier boss, an S class would have Zhang Yang kill an Ascended tier boss! Fortunately, the system had not been a busybody and publicly announced the availability of the Land Lease. Zhang Yang would have the time of his life to hunt the boss! The boss would not spawn out without proper activation. The developers had released the announcement about that. Any Ascended boss would only spawn by completing a series of quest or by fulfilling certain conditions. If Zhang Yang and Wei Yan Er had not gotten this far in this particular questline, the Hell Ghost King would not have spawned.</p><br/><p>Zhang Yang gathered the rest of the party together and left the Dark Ghastly Canyon, heading towards the North of the Gerling Crypt.</p><br/><p>\"We are but without the Transformation skill. How are we supposed to defeat the boss?\"</p><br/><p>\"Plus, the Crypt will be an indoor environment. There’s no way for us to rely on the War Chariot!\"</p><br/><p>Zhang Yang clicked his tongue smugly and said, \"All is well, my friends. A crypt would be like a dungeon. In a sense, there will be several floors for us to clear before we could reach the end of it. I figured that we might take more than 3 days to clear all the floors. Then again, this boss is only known to us. Even if we wait for a few days, there won’t be anyone coming to disturb us. Not unless someone here decides to tell the females from a certain guild…\" said Zhang Yang as he glared at Fatty Han.</p><br/><p>Everyone left the canyon and after two hours of nonchalant flying, they had arrived at a misty and eerie garden. The garden was devoid of light, yet the place was not too dark. At the center of the lifeless garden was an entrance to an underground pathway. It was rather visible from afar, since the entire structure of the entrance was shaped like a round tent, a Yurt to be exact. Once Zhang Yang entered the entrance, the minimap rolled over and revealed a complicated network of underground pathways.</p><br/><p>\"This must be it.\"</p><br/><p>The two Phoenix spread out its wings and illuminated the area 10 meters from where they stood with its blinding firelight.</p><br/><p>Just when they had walked further into the crypt, a metallic scratching sound could be heard echoing from the depths of the pathway. The sound got louder and Zhang Yang could see the monster. It was a regular skeletal monster that once was a human warrior. All the flesh had rotted away, leaving nothing but dust on its skeletal structure. It was still wearing some old armor from a time before it was alive and a long rusty sword that it dragged along the floor.</p><br/><p>When the skeletal monster got closer to the party, its eye sockets flared up with bright emerald green flames. It growled and charged towards the party, dragging its long sword with it.</p><br/><p>[Revived Warrior] (Elite, Spectre)</p><br/><p>Level: 220</p><br/><p>HP: 110,000,000</p><br/><p>Defense: 13,730</p><br/><p>Melee Attack: 92,970 – 152,970</p><br/><p>Skills:</p><br/><p>[Force Strike]: Deals 100% melee physical attack to a target. Has a 20% chance to trigger an additional attack.</p><br/><p>[Poison Mist]: Deals 30,00 Natural damage every 3 seconds to all targets that steps into the Poison Mist.</p><br/><p>Note: The Crypt was created as a place were brave warriors choose to rest in peace. However, the Hell Ghost King had chosen to revive them, giving them a new purpose to their bodies. Due to their glorious past, the only thing that kept the Revived Warriors moving was pure fighting instinct.</p><br/><p>Zhang Yang took charge and attacked the skeletal soldier. The rest of the party followed and blasted the Revived Warrior, turning it into a pile of dust.</p><br/><p>Everyone proceeded further. Out of habit, Wei Yan Er had moved to the body and discovered there was loot to be picked.</p><br/><p>[Glove of the Flame Master] (Ethereal, Cloth Armor)</p><br/><p>Defense: +320</p><br/><p>Vitality: +3423</p><br/><p>Intelligence: +1128</p><br/><p>Spirit: +499</p><br/><p>Equip: Increases Maximum MP by 2,250.</p><br/><p>Equip: Increases damage dealt and healing rate by 5.6%</p><br/><p>{Unidentified}</p><br/><p>Level Requirement: 220</p><br/><p>Special: Level Requirement reduced by 30 Levels.</p><br/><p>Flame Master Set Effect (1/3): {Gloves of the Flame Master}, {Pants of the Flame Master}, {Flame Master’s Tall Boots}</p><br/><p>Three Set Effect: Increases all Fire Attribute Spell damage by 50%</p><br/><p>Everyone exchanged a weird look as they were all stumped. How could a lower level monster have such a drop that had a 30 Level reduction effect? If a monster could have such a nice drop, what would that be for the boss?</p><br/><p>\"Hmph…It’s actually a powerful item if we can find all three equipment,\" said Zhang Yang as he kept the glove in his inventory.</p><br/><p>Daffodil Daydream pondered for a while and said, \"The set effect is good, but the equipment stats itself are low. Even though it could provide 50% extra fire damage, the overall DPS will be lower than wearing three Holy tier equipment. And then there’s the low Vitality and Intelligence stat. It’s not too good actually.\"</p><br/><p>Zhang Yang smiled. \"That’s a good girl. I’m impressed that you could figure it out. Yes. It’s not too good, but I’m sure that many Level 190 players would die to have these equipment if they could not get their hands on any Holy tier.\" </p><br/><p>Translator Note:</p><br/><p>(1) Sister: Apparently, it is a Chinese dialogue manner. When they scold someone, they tend to add close relative of the targeted person. Unlike the usual English insults like, \"Your mama is an idiot\", China’s Chinese scolding goes the same way. It’s a way to divert back the things you had said back to yourself. Example: A calls B a donkey and B retorts back.</p><br/><p>A: \"You’re a donkey!\"</p><br/><p>B: \"Please…You’re mom’s a donkey.\"</p><br/>\n</div>"}