{"title": "Chapter 809: The Search for the Wind Essence Pearl", "id": 809, "volume": 9, "url": "http://boxnovel.org/mmorpg-rebirth-of-the-legendary-guardian-chapter-809-the-search-for-the-wind-essence-pearl", "volume_title": "Volume 9", "body": "<h1>Chapter 809: The Search for the Wind Essence Pearl</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 809: The Search for the Wind Essence Pearl</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Upon enhancing the equipment, the percentage of the additional damage and the amount of Damage Absorption would not change even by a bit. However, the Vitality, Strength and the other attributes would increase by 10% every time the equipment is enhanced. That would make the equipment quite powerful.</p><br/><p>Theoretically speaking, the attributes and other additional effects that a +8 Holy Tier equipment had could have exceeded the attributes of an Ascended Tier equipment! Of course, the success rate of enhancing the equipment up to +8 would be extremely low. One failure in the fusion of two equipment would result in the destruction of both equipment. There will not be a second attempt. That being said, the rate of success would theoretically be 0.9* 0.8*0.7 …*0.2 = 0.3%. It would not be that easy, of course.</p><br/><p>However, the [Tesseract] would still be a useful item, no matter what.</p><br/><p>Well, would he be the only one in the entire server to have possessed such a great item then? The game had Socket Gemstones, Weapon Runes and many other enhancement systems. Those were some great ‘money generators’ for the game company. So, how would they able to pass on this piece of cubic [Tesseract] and not make it into another of their new ‘money generators’ then?</p><br/><p>After all, the [Tesseract] had a 1-hour cooldown. Furthermore, the item could not fuse and improve the Tier of equipment that were higher Tier than Holy Tier. The [Tesseract] could only enhance those high Tier equipment. However, because of that, when the Holy Tier equipment begins to depreciate in the hands of high Tier players, they could take those Holy Tier equipment as ingredients to fuse or combine. As long as they get a large quantity of Holy Tier equipment, they would stand a chance to achieve a +5 enhancement on their equipment!</p><br/><p>Meanwhile, a +5 Upgrade Holy Tier equipment would be almost as powerful as a basic Ascended Tier equipment without any enhancement!</p><br/><p>Zhang Yang could choose to shout out to the public, telling everyone about the existence of the [Tesseract] and its functions. By then, there should be tons of players coming up to him asking for his services in enhancing their equipment. Super rich Top Tier players like Hourglass Figure and Dusk Phoenix would definitely be willing to pay over a million dollars for each enhancement. They would not even care about money anymore, since they were so rich!</p><br/><p>However, would the system really allow that kind of opportunity to make more money just slip by? Zhang Yang would not believe they would, even a thousand years after his death.</p><br/><p>Well, the system would definitely introduce a large-scale equipment fusion system in the game. The question would be, when? However, that would not concern Zhang Yang much because all he needed to do now was to focus on getting as many Ascended Tier and Celestial Tier equipment as he could possibly find in the entire server. That would matter most, because he could enhance his future equipment to obtain even more powerful equipment! When others manage to get +8 Upgrade Holy Tier equipment, Zhang Yang could have easily beat the other players by having a +1 Upgrade Ascended Tier equipment!</p><br/><p>Upon going back to see Baa'ljilr once again, Zhang Yang received another quest that required him to gather more materials for the NPC’s plan.</p><br/><p>[The Search for the Wind Essence Pearl] (Difficulty: Subject to change)</p><br/><p>Description: Baa'ljilr wants you to find the Wind Essence Pearl so that he can carry on with setting up his Sacred Enchantment. According to legend, the Wind Essence Pearl belonged to the god of wind, Anes. When Anes fell, the Wind Essence Pearl was dropped into a cave. Because the Wind Essence Pearl can take the form of a tornado, that cave was named the ‘Gale Cavern’ for that reason. You can find the Gale Cavern in the Mount Polo 400 kilometers from where you stand right now. However, it will not be easy to pass through the Gale Cavern and acquire the Wind Essence Pearl! Warrior, you need luck in this quest. That’s right! Luck!</p><br/><p>Completion: Acquire the Wind Essence Pearl 0/1</p><br/><p>A quest without a specific difficulty, huh? This must be a quest that would put the players’ reaction to test. Even though everyone had the same Class, same equipment Tier, same Skills, some could pass a test with flying colours while some would fail in misery without even know how to react to the situation.</p><br/><p>Zhang Yang immediately departed. He rode the Phoenix pet and flew over 400 kilometers into the Mount Polo. It did not take long before Zhang Yang located the entrance to the Gale Cavern.</p><br/><p>It seemed that Zhang Yang was not the only one who was completing this quest at the moment. When he arrived at the entrance to the cavern, there were already more than 10 players standing right in front of the entrance. Well, just like the Chinese say, the name of a person is like the shadow of a tree. The more famous you are, the more influential you are. Even though Zhang Yang did not reveal his character information to the public, the gigantic blazing bird underneath his butt had betrayed his name out to the people who saw it. Those players were so worried the moment they recognized that he was Zhang Yang. They did not really know him well after all. Who knows if he suddenly loses himself and kills everyone he sees! He might even want to kill everyone so that he could take the quest all to himself! Instantly, the players began to charge into the cavern with the intention of hiding from Zhang Yang.</p><br/><p>Zhang Yang could not help to smile bitterly. Well, is he really that scary to others in the game?</p><br/><p>However, these people could really become his ‘pathfinders’. They could explore and let Zhang Yang know what lay beyond the entrance of that cavern.</p><br/><p>\"Argh ---\" not long after did the player charged into the cavern, Zhang Yang suddenly heard a bunch of miserable screams coming out from the entrance of the cavern. Instantly, the players were being shredded into pieces across the ground! They were running into a blender and getting themselves blended into pieces by white visible air current! Countless pieces of blood and bones were scattered into the surroundings of the cavern, like it was raining blood and bones! Eww!</p><br/><p>Well, it was not like people had not seen such scenes that involved bloody killing and gore. However, seeing people getting shredded into pieces like that was an extremely rare sight in the game. Some of the shredded blood and bones of the dead players splattered on the other players who were still alive. Instantly, those players started feeling uncomfortable. Some of them were even beginning to feel like vomiting.</p><br/><p>\"Argh!\"\"Argh!\"</p><br/><p>The miserable screaming were heard one after another. Many more were shredded as they attempted to go forward. Any players would actually see that there were countless holes across the ground of the cavern. The holes were packed so closely together as if they looked like the design of a honeycomb! Countless white air currents were seen shooting out from the holes killing whoever who touched them.</p><br/><p>The remaining players who were still alive quickly took a few steps back, one after another. However, the passage they came from was not necessarily safe even though they managed to get through alive. Countless miserable screams continued on. Another 4 players were shredded into pieces!</p><br/><p>Initially, there were more than 10 players who went straight into the cavern. However, only two of them made it back out! Furthermore, everything happened very swiftly. The entire incident was only about 10 seconds! Well, if they went deeper into the cavern earlier on, no one would have made it out alive!</p><br/><p>It did not take long before Zhang Yang acquired a conclusion after observing them for a bit. So these air currents that come out of the hole on the ground would definitely ignore everyone’s HP bar --- they would just kill the players instantly upon touch and shred the players into pieces! So whoever who touches it will definitely not survive. Even if the players could survive the shredding process, how would the players proceed when they are already shredded into pieces? Crawl forward in the form of meat chunks? Eww as f*ck!</p><br/><p>Zhang Yang had already activated the recording function of the game and recorded everything that happened a moment ago. Then he immediately took out the footage and began to study it.</p><br/><p>Meanwhile, the difficulty of passing through the cavern was too much for the players to handle for the moment. Some even came up with the assumption that there must be some special hidden reward buried deep in the other end of the cavern. So those who were not afraid to die took off their equipment and charge straight into the cavern. Well, since they would be dead the moment they touch the air current, it would not make any difference as to whether they were wearing any equipment or not. Well, they took their equipment off because they would not have to bear the cost of having to repair their equipment after they die.</p><br/><p>Currently, everyone was waiting for someone to come up with a solution. There must be some pattern in order for the players to get through safely. Therefore, none of them intended to battle other players --- these players were coming from different Regions. If they were currently standing at a different location or different map, they would have pulled out their weapons and slaughtered each other up!</p><br/><p>Zhang Yang did not rush. He took his own sweet time to analyze the pattern of the deadly air currents and how to get through them without touching any one of them.</p><br/><p>The air current seemed to be the powerful effects of the Wind Essence Pearl. As for why the air currents were all in white in color… well, if they were invisible, players would have nothing to look at, wouldn’t they?</p><br/><p>When there was no player entering the cavern, everything would stay peaceful. However, the moment when a player steps foot into the cavern, every single hole on the ground would constantly shoot out white air current like the blades of a blender! Anyone who got touched by the air currents would be shredded into pieces. It would not matter even if you have a million points of HP on you. It would just be an instant kill.</p><br/><p>Therefore, the difficulty of the quest would subject to change. Upon mastering the pattern of the air currents, players would be able to pass through safely even if they do not have any equipment on them. However, if the players decide to charge in without any plan like idiots, they would be shredded into pieces and die, even if they are wearing a full set of Celestial Tier equipment.</p><br/><p>The number of players by the entrance of the cavern was getting more and more by the minutes. The players had tried out all sorts of methods in an attempt to get through the cavern’s traps. Some of them sent their Battle Companions in while the others tried to send their pets in as well. Some even attempted to bodily hurl their Servants into the cavern to see if they could go through without triggering the air currents. However, everything would trigger the traps and be shredded to bits the moment they went into the cavern.</p><br/><p>{Stealth} Ineffective! Use of Potions to get invisible, attempt failed! Activating Invincibility effect, shredded to pieces like nobody’s business!</p><br/><p>Countless methods had been used in an attempt to get through the cavern. Everyone was playing by the rules, knowing that getting into the cavern was the only way to complete the quest.</p><br/><p>However, these countless air current seemed to show no patterns of attack at all. Some of the holes did not react at all until they ‘sense’ the presence of players around them. When that happens, they would just shoot the air current out and shred everyone that is in the cavern.</p><br/><p>Zhang Yang recorded every method ever attempted by the other players so that he could take a closer look at determining the patterns of the air current. Well, he must also memorize over 100 possible changes of the pattern before he charges out and gets through in a single attempt. Any hesitation would end up with him taking the wrong step and putting him right on top of the traps. By then, he would be shredded like how the other players had been.</p><br/><p>Zhang Yang continued to focus on familiarizing himself with the possible patterns of the air current even though they looked irregular and complicated as f*ck. He was meditating like an old monk without moving a single muscle of his body. However, his eyes were moving around intensely as if he was able to see every single detail that was happening in the cavern when the players were challenging to get into the cavern.</p><br/><p>Quite a period of time had passed, some players had totally given up on getting themselves killed pointlessly. They decided to leave the cavern so that they could grind someplace else. Meanwhile, some of them were still willing to believe that there must be some very handsome rewards waiting for them by the end of the cavern. They were not willing to give up just yet.</p><br/><p>Well, up till this point, no one could figure out the patterns of the trap in the cavern just yet. Or maybe some of them had it figured out. However, it would take quite a while before they could get familiarized with the pattern of the trap in order to get through the trap safely.</p><br/><p>Another hour had gone by without notice. Zhang Yang stood up to his feet and decided to make his move. However, he summoned Han Ying Xue over to his spot with his [Lover’s Charm] first. Then he traded the [Book of Revelation] to her for safe-keeping. Well, just in case if he ever fails and dies in the attempt to get through the trap, he might risk being killed by others after he gets resurrected on the spot where he dies. By then, he would definitely drop the [Book of Revelation] and risk losing it forever!</p><br/><p>So, safety comes first. It would be much better to let Han Ying Xue take care of the book for the moment. Well, she could just escape into the sky if anyone tries to attack her. After all, she was riding on her Flying Mount at the moment. If she really gets herself into deep trouble, she could just activate her Inheritance Transformation. However, normal players would never dare to attack any high Tier players first --- unless the temptation is too great to be ignored!</p><br/><p>Zhang Yang took in a very deep breath. Then he suddenly stomped the ground and charged towards the entrance of the cavern a top speed.</p><br/><p>\"Is that Zhan Yu?\"</p><br/><p>\"That’s right! He came here on a Phoenix pet. Well, there’s another player, a fat wretched Hunter, who also has a Phoenix pet. Other than these two, I don’t think there’s anyone else who has a Phoenix pet in the entire server!\"</p><br/><p>\"Pui! The traps installed in this cavern are too much! Their attacks even ignored our HP. Anyone who gets touched by those deadly air current will be instantly killed! Let’s not talk about Zhan Yu, even a powerful boss would have to kneel and die if the boss ever steps into the cavern!\"</p><br/><p>\"Well, that’s really unfortunate! If I’ve known about it earlier, I would have hit him once before he ran into the cavern. Who knows! He might drop some Celestial Tier equipment after he gets himself killed by the traps in the cavern!\"</p><br/><p>...</p><br/><p>Even though Zhang Yang overheard the discussion among the players right outside the cavern, he did not waste his time on reacting to their words. He was currently focused on calculating the holes on the ground that would shoot out deadly air currents. Left! Left! Left! Left! Right! Right! Left! Left! Left! Zhang Yang was running in a zig-zag route. However, he suddenly ran in a straight line after a while of running across the cavern in zig-zag route. It seemed as if he was running in an irregular pattern.</p><br/><p>However, if there were clever players in the vicinity to see how Zhang Yang ran, they would have noticed that Zhang Yang had mastered the pattern of the route. That was why he was able to charge forward without getting himself killed! Or else, the air current coming out from the holes would have killed him instantly.</p><br/><p>The cavern was extremely long, it did not take long before the people by the entrance could no longer see Zhang Yang’s shadow in the cavern.</p><br/><p>\"Huh? How could he pass the traps by simply running forward like a crazy person!?\"</p><br/><p>\"I don’t think he just simply ran forward. If he did, he would have been killed!\"</p><br/><p>\"Look at him! There’s no pattern at all! It’s just random steps! It must be luck! He must be lucky! Didn’t you see the description of the quest? You need luck!\"</p><br/><p>\"That’s right! It’s definitely luck!\"</p><br/><p>\"However, the cave is so deep and long. His luck will run out sooner or later. I’m afraid that he’s dead by now as we speak!\"</p><br/><p>\"Yeap! He must be dead now!\"</p><br/>\n</div>"}