{"title": "Chapter 815: Shadow Lord Margalor", "id": 815, "volume": 9, "url": "http://boxnovel.org/mmorpg-rebirth-of-the-legendary-guardian-chapter-815-shadow-lord-margalor", "volume_title": "Volume 9", "body": "<h1>Chapter 815: Shadow Lord Margalor</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 815: Shadow Lord Margalor</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>The downside of the {Frostbite Aura} was its damage being weaker than {Burning Aura}. However, the major advantage of {Frostbite Aura} was the additional movement speed reduction! As a Spellcaster, the skill was more than helpful for Cheng Xue Yao, since the effect will be applied to all targets within the effective range. It was as similar to Zhang Yang’s {Thunder Strike}, only that it was permanently active and can never be dispelled.</p><br/><p>Naturally, Cheng Xue Yao was so delighted with the skill that she gave Zhang Yang a blow kiss. Zhang Yang tried his best to be oblivious to it but Fatty Han and Endless Starlight were extremely sensitive to that sort of thing. Sun Xin Yu and Han Ying Xue immediately rolled their eyes at him.</p><br/><p>But then again, perhaps it was called for, since Zhang Yang had slightly \"played\" with her by pinching her cheeks when she had served him coffee at work. The woman must be trying to get the game straight with him.</p><br/><p>Zhang Yang continued his pretense and moved on with the quest after he picked up the [Ice Essence Pearl]. The party left the snowy mountain and went to the Shadow Mountain.</p><br/><p>Similar to the last two mountains, the Shadow Mountain had a similar aura effect.</p><br/><p>‘Ding! You have received the effect: Shadow Aura!’</p><br/><p>[Shadow Aura]: Attack reduced by 10%. </p><br/><p>Naturally, having their damage reduced, even if it is only 10%, did not please them at all, when they had to already reduce their attack in exchange for survivability. It was the sort of salt in the wound which everyone truly disliked. Just when they could finally change back to their own original gear to regain their lost damage power, the next map had them reduce their attack again!</p><br/><p>While everyone was having a rather unpleasant time, Han Ying Xue was extremely delighted. She was a sloth! Since the aura skill was not the DoT type, she would not need to move around constantly to heal everyone! It was about time for her to slack a little.</p><br/><p>Still, even though they had to bear with the damage reduction, the team proceeded on and encountered the monsters that dwelled on that blackened earth.</p><br/><p>[Shadow Stalker] (Elite, Elemental Being)</p><br/><p>Level: 230</p><br/><p>HP: 115,000,000</p><br/><p>Defense: 14,270</p><br/><p>Melee Attack: 98,335 – 158,335 (Shadow Based Physical Attack)</p><br/><p>Skills:</p><br/><p>[Shadow Bomb]: Hurls a bomb to a target that explodes after 3 seconds. Deals 120,000 Shadow Damage to all targets within 10 meters of the initial targets.</p><br/><p>Note: Loyal goons of the Shadow Lord Magarlor. They have been personally trained by Lord Magarlor himself and would trade their lives for his.</p><br/><p>As expected of their name and the environment that the party was in, the monster was completely black, yet somewhat translucent, with several floating black bits the size of tiny ping-pong balls. Their appearance was that of ghouls, a black entity that was covered with a black sheet. Similar to the other mountains, the monsters were in groups of eight.</p><br/><p>The entire party of 20 went on ahead and attacked with the three tanks paving the way, and the rest of the team following closely.</p><br/><p>Overall, the one thing that made the battle rather annoying was the {Shadow Bomb}. The skill would be cast on random targets. There were no rules that said the skill cannot be inflicted on the same target. In that case, an unlucky player could end up \"eating\" all eight bombs and take over 1,000,000 damage! Despite the fact that the party members have managed to haul a few Ascended tier and Holy tier equipment from the two previous boss, they were not able to put them on since they had not yet fulfilled the Level Requirement. Hence, those weaker players were not able to survive, for their HP was at around 1,500,000 HP, at best.</p><br/><p>Like Magic Nullification of Inheritance Transformation, taking eight bombs in one instance would be extremely rare. On the other hand, there were the AoE explosions. If anyone receives the bomb and does not react fast enough, they would end up hurting everyone around themselves. Thankfully, everyone in the party had a certain level of prowess. If they were to stand still and allow the bomb to explode in the midst of the party, he or she will be kicked out of the party, permanently!</p><br/><p>With haste, all eight of the monsters were dealt with. The monsters had dropped a few ETC items that were of no use to the party and will be sold to NPCs later. However, there was a rather mysterious item and piqued their interest.</p><br/><p>[Shadow Orb] (Usable)</p><br/><p>Use: The Bane of Light. Use it to unleash the power of Shadow to resist the [Rage of the Light]. Range: 30 meters Cooldown: 200 seconds.</p><br/><p>Level Requirement: 200</p><br/><p>It was a random item that could be used to counter a certain skill. However, who, when, or what situation calls for it, no one had the slightest clue. Zhang Yang took the item first, since he had the most Inventory Space amongst all of them. Somehow, he had a good feeling that the item will be useful for the upcoming boss fight.</p><br/><p>Initially, Zhang Yang did not want to store it. Even though he had plenty of space in his inventory, he had most of them occupied with random potions! He had argued with Wei Yan Er for a long time and eventually lost to the entire team’s persuasion.</p><br/><p>The team continued the hike but felt slightly annoyed, it was not just the Shadow Stalkers, but mainly the {Shadow Aura} that reduced the team’s overall DPS. A drop of 10% DPS would directly affect their pushing speed by 10%, so to speak. Since the monsters around had the skill {Shadow Bomb}, Zhang Yang himself did not dare to kite too many monsters at a time, fearing that the team members might not able to cope with the instantaneous reaction required to bring the bombs away from the party.</p><br/><p>Along the way, the party found more {Shadow Orbs,} although the drop rate was not too good. 20 days later, they had all reached the peak of the mountain. By then, the party had collected more than enough of the orbs that Zhang Yang had stuffed his inventory full with the {Shadow Orbs}. In the end, Zhang Yang finally dumped piles of {Shadow Orbs} on the ground and made everyone take a few.</p><br/><p>200 counts made a stack. Hence, everyone in the party carried roughly four stacks of {Shadow Orbs} on them. There were more than 16,000 counts of {Shadow Orbs}. For such a large haul, the team was still dubious about the use of the item. Zhang Yang made a nonchalant comment about how the previous boss fights had required the help from monsters’ drops and persuaded the team to keep the orbs until they fight the final boss.</p><br/><p>At the peak of the mountain, there was a huge circular altar with ceramic tiles. The boss was sitting in the middle of the altar, meditating. Its 30-meter height appearance screamed of his status as a boss. Aside from his size, his dark, void, abyssal, black appearance was haunting. His existence was that of a black hole, though he did not possess such suction power.</p><br/><p>[Shadow Lard Margalor] (Ascended, Elemental Being)</p><br/><p>Level: 240</p><br/><p>HP: 12,000,000,000</p><br/><p>Defense: 37,330</p><br/><p>Melee Attack: 360,873 – 460,873</p><br/><p>Skills:</p><br/><p>[Lullaby of Death]: Sings a song of the end times, dealing 400,000 Shadow damage to all targets within 100 meters.</p><br/><p>[Shadow Claw]: Deals 150% melee physical attack to a target.</p><br/><p>[Void Tornado]: Unleashes a large tornado to destroy everything in its path. Within 5 seconds, 5 players would have to get inside the eye to stop the tornado from exploding. Failure to do so will cause the Tornado to explode and deduct 99% HP of all players within 100 meters. Players that get into the eye of the tornado will be immobilized. Requires 20 seconds to stop the power of the tornado.</p><br/><p>[Shadow Blessing]: Increases 100% attack power. Stackable. Casting time: 2 seconds.</p><br/><p>Note: The rule of the Dark. The King of Shadow. Born from the collection of all the shadows gathered in the Shadow Essence Pearl.</p><br/><p>Everyone immediately frowned like madmen when they saw the list of complicated skills. Without a doubt, [Lullaby of Death] would be the boss’ strongest AoE skill. In fact, it was not a huge deal for the party to see something like that. All bosses would have a similarly powerful AoE skill for that matter. The problem would be the rate of it being used. Too many in a short time would rank him at a world boss tier!</p><br/><p>Zhang Yang did not care about the skill since the party would have to take the damage head-on. {Shadow Claw} will mostly be used on the tank which would not be a problem for Zhang Yang. Transformations would further reduce the damage.</p><br/><p>The main problem of the boss would be the {Void Tornado} and {Shadow Blessing}.</p><br/><p>{Void Tornado} would require players to stop attacking the boss and get into the tornado to \"dispel\" the skill. That, or everyone would have their HP reduced by 99%. Paired with {Lullaby of Death}, everyone would die almost instantly. Although they would have to temporarily sacrifice 5 DPS to get inside the Tornado, it would be much of a problem since there were weaker level players there whose DPS would not make much difference.</p><br/><p>In the end, it was all about the {Shadow Blessing}. Stackable skills are always a problem…</p><br/><p>\"I think it can be interrupted since there’s the 2-second casting time. If it can’t be interrupted, might as well make it an instant cast,\" said Hundred Shots.</p><br/><p>\"If the skill is going to be used repeatedly, we’re better off discussing the turns we take to interrupt.\"</p><br/><p>Zhang Yang pondered for a while and said, \"We’ll have a test run first. Fight the boss without using Transformation skills. If all goes well, I’ll give the signal on when to use Transformations. Everyone cool with that?\"</p><br/><p>\"Understood.\"</p><br/><p>Zhang Yang led the party and confronted the boss.</p><br/><p>\"What art thee doing h're! Thou art not alloweth! Thy shalt slayeth thee all!\" cried the boss as he opened his eyes. Without any further warning speech, the boss got up to his feet and smashed Zhang Yang with his fist.</p><br/><p>WHAM!</p><br/><p>Zhang Yang lifted his shield and blocked the oncoming fist. He then rode the momentum of the boss’ attack and twisted in the air for a riposte, dealing a powerful strike that made the boss retract his hand immediately.</p><br/><p>The party fanned out and surrounded the boss to attack.</p><br/><p>\"Thou art not worth of thine strength! Begone!\" said Margalor as it raised his hands, ready to squash Zhang Yang.</p><br/><p>{Shadow Claw}!</p><br/><p>{Rock Solid}!</p><br/><p>‘-306,575!’</p><br/><p>What that was supposed to be 550,000 damage turned out to only be 300,000 on Zhang Yang. That is how strong Zhang Yang is, as a Guardian! The true defender of all physical attack!</p><br/><p>\"Interesting!\" the boss chuckled smugly. He then clapped his hands together and chanted a long stream of words in just a matter of 3 seconds.</p><br/><p>{Lullaby of Death}!</p><br/><p>It was a skill that was similar to Wei Yan Er’s {Melodies of War}. However, unlike the little girl, the boss raps it so swiftly that he had only taken 3 seconds to chant it all out. A black wave burst out of the boss and blasted everyone. A shadowy, gas-like entity seeped into everyone’s body and dealt 300,000 Shadow damage instantly.</p><br/><p>Right as everyone was just getting back up to their feet from the blast, another blast came and struck again. At that moment, the boss had displayed its true potential as an Ascended tier boss. Right after one skill is unleashed, another skill was cast again. There was practically no pause in between the attacks, besides the chanting!</p><br/><p>Again, similar to {Melodies of War}, {Lullaby of Death} can be cast while other skills are being cast at the same time! It was chaotic beyond words! It was an incredibly difficult for everyone in the team, including Zhang Yang! If he is unable to set his mind straight then, how could the others do the same!? Without the HP boost of Transformation, the healers were having a tough time trying their best to keep up with the healing!</p><br/><p>\"Urgh! Cheating boss! Report! Report! How is it possible for a boss to sing so fast!? Not even Jay Chow could rap that fast!\" cried Wei Yan Er as she felt jealous. By then, Wei Yan Er’s chanting speed had been reduced down to 18 seconds. However, how could she compare herself to the boss’ inhuman speed of 3 seconds!</p><br/><p>\"Little Yan Er, you might as well try and learn singing for a change! Perhaps one day, you could even rap as fast as Jay Chow!\"</p><br/><p>\"Big Fatty bro! Why would I want to rap like Jay Chow! That’s so un-lady like!\"</p><br/><p>Zhang Yang figured something out and said, \"Little brat. Talking in the game does not use your own mouth, your tongue, your lips, nor voice box. It’s all in your head. As long as you can think it, you can do it. It’s all in your head!\"</p><br/>\n</div>"}