{"title": "Chapter 818: Ending the Fight", "id": 818, "volume": 9, "url": "http://boxnovel.org/mmorpg-rebirth-of-the-legendary-guardian-chapter-818-ending-the-fight", "volume_title": "Volume 9", "body": "<h1>Chapter 818: Ending the Fight</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 818: Ending the Fight</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Since the Transformations needed time to cool down, Zhang Yang announced a day off the game.</p><br/><p>Luo Yu Rou was pregnant for the seventh month by then and her belly was bulging out rather spectacularly. Her original slim waist had expanded so massively that Luo Yu Rou, the famous superstar who was famous for being extremely sexy, while also having a serious case of celebrity syndrome, grunted every time she laid eyes on Zhang Yang.</p><br/><p>Back before the existence of ‘God’s Miracle’, being pregnant would automatically take an actress out of the acting line. However, in ‘God’s Miracle’ all that mattered was her appearance. On the plus side of recording in the game, she had no need to move around! She was literally laying down on the bed while her in-game character would run, jump, and perform many other actions that she could not perform in the real world!</p><br/><p>Zhang Yang was unwittingly roped in and soon realized that he was going to star as the villain of her movie! He was now an actor!</p><br/><p>Even though shooting the game requires users to log into the game. However, the user would require a special helmet that connects to a separate client and server. The developers had made a separated server. They were still using the same engine, but unlike ‘God’s Miracle’, no one besides the ones developers have authorized could enter.</p><br/><p>Those with clearance may come in during worktime and \"go\" to work. Appearance adjustments have never been any easier, since all the staff could manually control everything simply by adjusting the sliders on the menu! The users can also change their entire character! That meant that, they could even become a monster, if required by the director. Most of the settings, backdrops, environments were adjustable as well. Since the gaming company was only meant to provide a means for shooting, they were not involved in the shooting itself. Hence, through proper arrangements, all controls, including the means of changing the environment, physics of the world, and other unexplainable and meticulous matters were handed over to Lou Yu Rou to control. All they asked was to limit the knowledge of the system to themselves and not leak everything out for the world to know. It was rather natural for them to do so, since other digital companies might get their hands on their engine and clone it. If Luo Yu Rou had no full authority over the engine, she would keep coming back to the company to adjust the settings of the \"world\". That would happen, since her movie consisted of many kinds of scenes that required constant changes. Still, there were still parts of the movie that the developers had to be in charge of, that is, the character design. While that was handed over to the game developers, the movement of the characters were left to the director. Luo Yu Rou wanted to film an action film. Hence, when it comes to fighting moves, no one else besides Zhang Yang was perfect for it. As such, Zhang Yang became her co-director to assist her in directing fighting scenes.</p><br/><p>World class players would definitely perform much more extravagantly, when compared to greenhorns. Hence, after getting \"free\" help from Zhang Yang, Luo Yu Rou became a little greedier and had Wei Yan Er and Daffodil Daydream to help as well. They were both chosen to be part of the movie!</p><br/><p>The little girl could not be more excited. She had always idolized Luo Yu Rou and hoped to be like her one day. Her overwhelming excitement caused her to play around on the virtual set, forcing Zhang Yang to allow her to tweak her character appearance and make her boobs bigger. Naturally, Zhang Yang immediately changed her appearance back to her usual flatboard figure. At one point, he even turned her into a man!</p><br/><p>Seeing that the little Wei Yan Er was being energetic, Luo Yu Rou had created an extra character just to fit Wei Yan Er’s personality. According to her, Wei Yan Er’s lively character might be one of the main selling points of the movie! Hearing that, Zhang Yang became slightly excited. He could not wait to see how would Wei Yan Er perform in the movie, and how would the masses react to such a character.</p><br/><p>During the movie filming, Zhang Yang felt that Luo Yu Rou was an odd woman. While she had her way to get around Zhang Yang and have him tear fat checks for her, she would only spend that money for the movie. It was never for herself to spend. She did pay herself by setting a salary, a rather lavish one at that too, to restore her former lifestyle. Still, she did not need to do it that way. The movie studio company was given to her by Zhang Yang, yet Luo Yu Rou had rejected it like a bad organ. She had even made Zhang Yang the real owner of the company and had herself assigned as the director. That would only allow Zhang Yang to be the real profiteer of the movie! She would earn from it, but not as much as he would be! He was technically sitting down, and being spoonfed by the woman!</p><br/><p>What an eccentric woman!</p><br/><p>After one day in real life passed, three days had passed in the game as well. Wei Yan Er was being a little insistent on staying by Luo Yu Rou’s side to continue her role as the character. However, Zhang Yang told Luo Yu Rou to cut her out from the rest of the movie and dragged the little girl out of the movie set by pinching her nose in real life. The two of them logged out of the movie server and logged back into the gaming server.</p><br/><p>Everyone gathered together, threw jokes about Zhang Yang, Wei Yan Er, and Daffodil Daydream being in the movie. After getting ready, everyone charged toward the last boss, Margalor.</p><br/><p>\"In the Holy boss fight, {Radiant Chain} is a skill where the boss will automatically pick 3 random souls from us all. In this fight, when the boss uses {Void Tornado}, we would have to fill in the blanks to stop the tornado from wiping us all out.\" Zhang Yang made everyone gather near the boss and started to lecture.</p><br/><p>\"There’s six of you here who are all under Level 210. I don’t need to remind you that you are all here as backups. I cannot have you die that easily. So, if any of you have more than a 30-second cooldown for your {Light Orbs}, do not, I repeat, do not go to the tornado. It’s not that I don’t trust you. It’s just that, I do not want to create any chances for anyone to fail, especially since standing in the tornado will force you to stand there for 20 seconds. There would be an instance where one of you would have more than a 10-second gap in your {Light Orb} cooldown duration. We can’t have that.\"</p><br/><p>Zhang Yang continued. \"Now, the Wind Essence Pearl is next, and we only have less than 2 days (real time) to do it. Right now, if we use our Transformation skills, we could only use it after 72 hours. Hence, do the math yourself and you’ll understand that we cannot afford to lose, not even by a longshot. If we fail now, we could fail the entire quest. Do you understand?\"</p><br/><p>\"Understood!\"</p><br/><p>\"Alright. Buckle up. Let’s win this.\"</p><br/><p>Everyone nodded and got to their feet. Everyone knew that if they drag the fight too long, they would start to lose concentration and focus. Without Transformations, the entire battle might be dragged even longer, thus increasing the chances of mistakes happening. If anyone misses their chance to use the {Light Orb} to cancel out the {Shadow Blessing}, they will fail the entire boss fight.</p><br/><p>Technically, the Shadow Lord fight was roughly similar to the Lord of Light. One asked you to dodge the {Radiant Chain}, while the other asked you to get into the {Void Tornado}. Comlpete opposites, yet one and the same.</p><br/><p>Zhang Yang activated his Transformation and zoomed towards the boss, leading the attack with a loud battlecry.</p><br/><p>\"Insolent fools! How wasteful of you to throw away your second lives for naught!\" Margalor got up from his throne and got into his fighting stance. \"Since you have no regard for the importance of life, hell welcomes the likes of you!\"</p><br/><p>\"What a lame-*ss speech. Could the game designers be more creative?\"</p><br/><p>\"Fatty bro. If you’re complaining that much, how about you send a mail to them and ask them to hire you instead?\"</p><br/><p>\"Please. I’d rather spend my time in bed and have my girlfriend, *ahem* blowing the bagpipes, if you know what I mean…\"</p><br/><p>\"Erhm, I don’t mean to be rude but, bagpipes are big. I think yours might just be a small, kid-sized harmonica?\"</p><br/><p>Everyone laughed at the joke while Fatty Han grew mad with rage. Just as he was about to strip his pants to prove that his bagpipe was not a harmonica, Zhang Yang swooped back in his Transformed state and slapped Fatty Han’s back.</p><br/><p>\"I was only 5 inches away from starting the boss fight and you’re about to strip your pants? Are you f*cking with me?\"</p><br/><p>The atmosphere immediately became serious and tense. Zhang Yang had no need to explain the rules again and moved forward. Before the boss used {Shadow Blessing,} everyone could spare some time for some light jokes. It was only a matter of time before the atmosphere turned tense.</p><br/><p>\"Darkness. Shadow. Heed thine power. I, Margalor, shall dominate the land in thy name!\" the boss clapped his hands and started to chant a spell.</p><br/><p>Zhang Yang was the first to jump forward and used the [Light Orb] on the boss to stop the chanting of {Shadow Blessing}.</p><br/><p>\"I’m done. Next one!\"</p><br/><p>10 seconds later, Sun Xin Yu used her [Light Orb].</p><br/><p>\"I’m done. Next.\"</p><br/><p>20 seconds…30 seconds…40 seconds…</p><br/><p>Eventually, after 200 seconds later, the first cycle of interruption was completed without a hitch. By then, the boss had finally used its ultimate skill, the {Void Tornado}.</p><br/><p>Appearing without a gust of wind, a large, 3-meter wide black tornado appeared. The dark gust formed quickly, darkening everything within the area, yet there were still some sparkles inside it, making it look like the stars in the universe were being sucked into a black hole.</p><br/><p>At that moment, Cheng Xue Yao and the rest of the new members of the party had jumped into the party without waiting for Zhang Yang’s command. When they stood next to the tornado, their entire characters were immediately sucked inside like a vacuum cleaner, disappearing without a trace.</p><br/><p>20 seconds later, the tornado slowed down hastily and \"spat\" out all 5 players. The black colored gust died down instantly, leaving no trace of it ever being there.</p><br/><p>\"Very nice! Good job!\"</p><br/><p>Even though it was actually a simple job, Zhang Yang had praised them for their feat. He learned that adults, were the same as kids, would like being praised by their bosses! As the leader of the party, and the guild master of the guild, it would be wise to \"take care\" of the emotions of his underlings. Like a certain someone had said before, \"Take care of your employees and they will take care of your business.\"</p><br/><p>Zhang Yang was not a leader of a nation. He was merely a guild master. However, being the one man who was recognized by the entire world as the number 1 player, he was idolized by all. His words of praise could mean the world to his followers. Hence, besides Cheng Xue Yao alone, the rest of the 4 that had joined her in jumping into the tornado got all hyped up and happy.</p><br/><p>\"I’ll see you really soon. My precious!\" said Zhang Yang to himself as he accidentally got distracted by Cheng Xue Yao’s belly.</p><br/><p>\"Enough! You have sullied the ground of the gods! Death shall be the end of you!\" cried the boss.</p><br/><p>\"…is this all that the developers could come up with? Even I could come up with better speeches than that! Man! This is so annoying!\" Fatty Han grunted impatiently.</p><br/><p>\"Those who defy the word of the gods shall die!\"</p><br/><p>\"Die?! I’ll pull your tongue out and boil it over my pumpkin soup for dinner!\"</p><br/><p>Unlike many bosses, the party was rather vigorous and extra pumped up when facing this \"talkative\" boss. They were, as if, no longer able to endure its repetitive speech patterns and wanted to end the fight as soon as possible. </p><br/><p>Since the boss did not have any recovery skills, everyone’s super-powered attack had the boss’ HP dropping down to 20% in less than 40 minutes. By then, the casting speed of {Lullaby of Death} had decreased from 3 seconds to only 2 seconds. The party’s healing rate was not doing well enough to cope with the sudden burst of damage.</p><br/><p>However, it was only momentarily. When Han Ying Xue and the other healers were startled by the sudden increase in damage, they too had burst out and had pushed themselves to spam as fast as they could, making sure that everyone always had {Regeneration} on them and were actively casting healing spells one after another. Each time the boss loses 10% HP after the vulnerable state, the casting and usage rate of the powerful AoE skills were strengthened, forcing the party to take hits like never before.</p><br/><p>45 minutes into the battle…the boss was left with 10% HP.</p><br/><p>At then, {Lullaby of Death} casting time was reduced even further to only 1.5 seconds. Compared to his vulnerable state, it was an increase of 100% damage!</p><br/><p>The healers of the team were finally faced with a deficit of healing. One by one, the healers had used their ultimate skills to cope with the loss of HP to keep the team alive. One second, you’ll have 80% HP, the next second, you’ll have 30%, one second later, you’ll have 75%. The rise and drop of the party’s HP in total was going up and down faster than a roller coaster.</p><br/><p>\"Don’t spare any of your skills now! Unleash your full potential!\" cried Zhang Yang.</p><br/><p>Players with HP recovery skill had used them non-stop when available, allowing them to cope with the healers. Everyone but Zhang Yang was facing trouble. The man had a HP bar longer than anyone there. Even though he was the boss’ punching bag, taking more damage than the others, he was the only one who had not used his own recovery skill, the {God of War Radiance}.</p><br/><p>8%...5%...2%....</p><br/><p>The entire party was about to fall. Han Ying Xue then used {Milkmaid Deity’s Ripple} to save everyone at the very last minute.</p><br/><p>1%...0%!</p><br/><p>\"Grah…Darkness beckons me…\"</p><br/>\n</div>"}