{"title": "Chapter 824: Demonic Pearl", "id": 824, "volume": 9, "url": "http://boxnovel.org/mmorpg-rebirth-of-the-legendary-guardian-chapter-824-demonic-pearl", "volume_title": "Volume 9", "body": "<h1>Chapter 824: Demonic Pearl</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 824: Demonic Pearl</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>After Endless Starlight managed to get the boss to follow him, a large number of players from other guild began to lurk in the shadows. They kept sending their men to poke the boss from the side. However, all of them ended up in a tragic death of course. Truth to be told, the boss was using her {Tornado Cleave} so frequently that anyone who got near enough would get themselves killed on the spot. Well, kiting the boss could only do good in preventing the boss from running around, taking the innocent lives of the players.</p><br/><p>Meanwhile, Zhang Yang did not put any expectations on killing the boss either. He let Endless Starlight be in charge of pulling the boss from the more populated area of the battlefield. After the monsters were cleared out from the battlefield, then only Zhang Yang and the others would focus their attention on the boss.</p><br/><p>Countless bloodshed had finally taught the players from the other guilds to be obedient. They had no choice but to give up on dying pointlessly and let Endless Starlight focus on kiting the boss. Well, because even if Endless Starlight manages to kite the boss far away from the battlefield, Zhura’s{Demonic Fusion} would still suck a monster from afar to recover her own HP bar. Well, the boss was basically invincible for the moment.</p><br/><p>Upon sacrificing over three to four million players, the monsters outside the castle were finally wiped out cleanly. The boss was the only enemy left in the vicinity.</p><br/><p>Everyone turned their attention towards the boss now. They immediately charged towards the boss and started their ferocious attacks on the boos.</p><br/><p>Although the boss had quite a high amount of HP on her and all players in the vicinity could not attack the boss at the same time due to the limitation of space and rage, only approximately thousands of players managed to land their attacks on the boss at the same instant. However, even if each of the players could only deal 10,000 damage, one round of attacks from so many players at the same instant would deal about 10,000,000 damage! Therefore, 21 rounds of attacks should be enough for the players to take out the boss once and for all!</p><br/><p>However, even though the boss did not have her HP Recovery Skill to use anymore, it did not mean that her Attack power was weakened. With one whirl of her {Tornado Cleave}, countless gleaming of the blades swung across the battlefield, and countless players found themselves dead under the brutality of the boss’s attacks. Their dead bodies collapsed to the ground the moment the boss was done whirling her blades in her arms. However, the players at the rear were still making their way to the boss. Well, the main reason was because they could acquire the ‘qualification’ to pick up the loots that the boss would drop upon her death. Therefore, everyone was excited over it. They no longer got held back by their fear of death.</p><br/><p>\"Haih… Why would they put so much effort over a few pieces of Holy Tier equipment? Is it really worth it?\" Fatty Han said sarcastically.</p><br/><p>Zhang yang laughed out loud and said, \"Well, we’re just a few steps from getting a full set of Ascended Tier equipment now. Of course, we won’t even have the interest to look at them Holy Tier equipment. However, for most people in the game, Holy Tier equipment are like Celestial Tier equipment at the current stage of the game! Are you saying you don’t want to get a Celestial Tier equipment for real?\"</p><br/><p>\"What? Celestial Tier equipment? Of course, I want to get them! Unfortunately, we have not met another Celestial Tier boss anymore ever since then!\" Fatty Han sighed heavily.</p><br/><p>\"Actually, we’re about to meet one, Demon Lord Kenzack! That’s a Celestial Tier boss for sure! However, we’ll have no idea what level the boss will be.\"</p><br/><p>\"Humph! No matter how strong the boss turns out to be, I’ll just slice and dice and slash the boss! The boss will die before me!\" Wei yan Er shamelessly told everyone.</p><br/><p>\"Haha!\"</p><br/><p>Everyone was laughing at the little brat. Meanwhile, under the bombardment of the players’ attacks, the boss finally collapsed with an empty HP bar. The moment when the loots were rolling across the ground, the players around the boss began to snatch about like their lives were depending on what they could get! Nearly 20 pieces of equipment were swept clean off the ground within one split second! Well, it seemed that everyone was extremely quick to pick things up from the ground.</p><br/><p>\"Boss! Boss! Something nice came out!\" Endless Starlight hopped onto his Flying Mount and made his way back to the castle wall. While there was still little time, everyone was taking the opportunity to heal themselves up. The Healer-type players began to run across the battlefield to resurrect as many players as they could.</p><br/><p>\"Oh, so what’s so nice about that thing you said?\" Zhang Yang did not show much enthusiasm about Starlight’s discovery. Up to the current point, even the Celestial Tier boss were spawned just to get everyone hyped without leaving anything behind. So what good stuff could a Holy Tier boss offer then?</p><br/><p>\"See!?\" Endless Starlight showed the items to everyone. There were three pearl-like beads of the size of a small pill. Well, they were basically translucent. They were radiating with a layer of vague light around them.</p><br/><p>\"So what are these?\" Everyone asked.</p><br/><p>\"Hehe! You’re going to be shocked to see what they are!\" Endless Starlight quickly posted the description of the items on the party channel.</p><br/><p>[Lesser Demonic Pearl] (Consumable)</p><br/><p>Use: Increase the success rate of the fusion of two equipment by 20%. The effect cannot stack even if you have more than one of this item.</p><br/><p>Required Level: 200</p><br/><p>Everyone looked at each other as they revealed joyous expressions on their faces.</p><br/><p>Well, the most popular and demanded thing in the game currently would be the fusion of two equipment! Unlike rune-weapons, the enhancement effect on an equipment would be much better in the sense of power level. It was already very common for players to have a +2 or +3 equipment.</p><br/><p>However, there were only a few number of players who managed to get +4 and +5 equipment. Well, it was mostly because the success rate for enhancing the equipment to +4 was only 17% (The Fusion and Enhancement service that the NPCs provide over enhancing an equipment to +1 is only 80%. Meanwhile, the Tesseract offers 90% success rate for the same service.). The success rate for enhancing the equipment to +5 would drop to 7% only. Only the rich could afford so many equipment to try out their luck. Normally, normal players would stop when they succeeded in enhancing their equipment up to +3 equipment. Well, it was mostly because they could no longer afford to spend more money to risk losing their equipment in case the enhancement fails.</p><br/><p>However, by using the [Lesser Demonic Pearl], players could increase the success rate for enhancing an equipment to +4 up to 50%. Compared to the initial success rate of 17%, the players would most likely 300% more to succeed in enhancing their equipment.</p><br/><p>Furthermore, the existence of [Lesser Demonic Pearl] had confirmed the existence of higher grade pearls like [Normal Demonic Pearl] and [Greater Demonic Pearl]. Even if each enhancement could only have additional 10% success rate, as long as the players had enough amount of [Greater Demonic Pearls] in their possessions, well, at least when their equipment is enhanced to +3, they would have 100% success rate for the enhancement process. That would be risk-free!</p><br/><p>Currently, the dungeons would drop Holy Tier equipment. So the Top Tier guilds would not mind passing on the opportunity to get the equipment dropped by the boss. However, only World bosses in the Open World Map would drop Ascended Tier and Celestial Tier equipment. The number of equipment of those Tiers was just pathetically rare! Therefore, no one would even dare to try enhancing their equipment up to +1 even of the fail rate was only 20%, so let alone the +4 enhancement which only had 17% success rate. In case the enhancement turns out to be a failure, two pieces of Ascended Tier equipment would be destroyed. The players who attempt that would definitely cry in misery for years!</p><br/><p>Well, there’s the Celestial Tier equipment as well. Who would be willing to risk the 20% fail rate to fuse or enhance their Celestial Tier equipment then?</p><br/><p>\"Well, this is indeed some good stuff!\" Zhang Yang nodded. After all, his Tesseract would have an additional 10% success rate for both the fusion and enhancement process of equipment. Hence, the existence of these [Demonic Pearls] seemed to be much more valuable than he could imagine!</p><br/><p>\"Unfortunately, there’s only three here!\" Wei Yan Er immediately became greedy and started complaining like a little b*tch.</p><br/><p>Endless Starlight smiled bitterly and said, \"The boss only dropped three, that’s it! I’ve managed to snatch all of them!\"</p><br/><p>Everyone laughed. Well, they had slain countless bosses ever since then. Their eyes and reflexes had been ‘sharpened’. Normal players would aim for the equipment, middle Tier players would aim for the Skill Books while top Tier players such as themselves would aim for those strange looking things.</p><br/><p>\"If my assumption is correct, the Holy Tier bosses would only drop [Lesser Demonic Pearls]. The Ascended Tier bosses would only drop [Middle Demonic Pearls] while the Celestial Tier bosses would drop [Greater Demonic Pearls].\" Zhang Yang smiled and took the three pearls from Endless Starlight’s hands.</p><br/><p>Well, it was obvious that Zhang Yang should be the one to keep the pearls. Since his Tesseract could provide an additional 10% success rate to all fusion and enhancement processes, the others could just ask Zhang Yang to fuse or enhance their equipment for them. Furthermore, asking the NPCs to fuse and enhance their equipment would require them paying a large sum of gold coins. How would Wei Yan Er and Han Ying Xue be able to accept that, huh?!</p><br/><p>\"We’ve killed so many Holy Tier and Ascended Tier bosses… how come we’ve never seen these sort of items before?\" Wei Yan Er immediately began to ask pointless questions again.</p><br/><p>\"Silly little brat… that’s because these pearls only existed after the Equipment Fusion System was introduced into the game.\" Han Ying Xue smiled at the little brat and rubbed her flat chest. Then Han Ying Xue sighed heavily and said, \"Brainless brat without a pair of proper boobies, huh…\"</p><br/><p>Kaboom!</p><br/><p>Wei Yan Er immediately got infuriated to the point that she looked like a barrel of TNT being set off. She instantly jumped around in rage, cursing and screaming! She even made a promise to rub someone’s boobies into a pile of meat pie after signing out of the game.</p><br/><p>‘Ding! The fourth wave of the demonic invasion is about to begin!’</p><br/><p>Thoom! Thoom! Thoom!</p><br/><p>Heavy footsteps that trembled across the ground each time they stomped the ground, as loud as the thunder. Instantly, players could see that there were countless small mountains moving towards the castle at a slow pace.</p><br/><p>Those who have sharp eyes would have been able to spot that those mountain-looking things was actually an army of giant turtles! However, these turtles were all as tall as a 5-storey building! Countless demons with a bow in their hands were sitting on top of the turtles. These demons were approximately 3 meters tall. Their bodies were entirely crimson read in color.</p><br/><p>Other than that, there were other demons that looked similar to those that were sitting on the turtles. They were following behind the army of gigantic turtles while pushing forward towards the castle.</p><br/><p>[Abyss Demonic Turtle] (Elite, Demon)</p><br/><p>Level: 215</p><br/><p>HP: 1,000,000,000</p><br/><p>Defence: 30,000</p><br/><p>Melee Attack: 97,665 – 137,665</p><br/><p>Skills:</p><br/><p>[Trample]: Stomps the ground with its gigantic turtle foot and causes 100,000 Physical damage to all targets within the range of 10X10 meters.</p><br/><p>[Hammerhead]: Strikes the castle walls with its rock-hard turtle head. No matter how strong the defenses are, nothing can stop the turtle head from penetrating through the defense!</p><br/><p>Upon seeing the description for the Skill, the men revealed a perverted smile on their faces. Fatty Han could not help to think that the designer of this Skill must be in the same ‘league’ as he is. He felt like as if he had met someone that would understand him well! Unfortunately, that was just him. He would never get the chance to meet the designer of that Skill in person.</p><br/><p>However, the demon on the demonic turtle turned out to be very weak though.</p><br/><p>[Turtle Surfing Demonic Servant] (Normal, Demon)</p><br/><p>Level: 215</p><br/><p>HP: 277,030</p><br/><p>Ranged Attack: 52,324 – 72,324</p><br/><p>Skills:</p><br/><p>[Precise Shot]: Shoot upon aiming the target. The attack cannot be dodged nor avoided. Causes 120% Ranged Attack of Physical Damage to the target.</p><br/><p>\"Wow, this turtle is really rock-hard, man!\" Zhang Yang was shocked. 30,000 Defence! Well, that amount of Defence that was nearly as powerful as the Defence of an Ascended Tier boss! Meanwhile, a total of 1,000,000,000 HP was far more than the HP amount of an Elite Tier monster!</p><br/><p>\"Hehe… didn’t you read the description of that Skill? If it’s not rock-hard enough, how would it be able to break ‘that’, huh?\" Fatty Han patted Zhang Yang’s shoulder and scanned his eyes across the bodies of Sun Xin Yu and Han Ying Xue. Well, he was trying to imply something to Zhang Yang.</p><br/><p>Krunchak! Krunchak!</p><br/><p>Sun Xin Yu and Han Ying Xue swung out their fist in their full strength at Fatty Han and landed their fists on Fatty Han’s sides. That fatty fell onto the ground with his face facing down.</p><br/><p>\"Fortunately, there weren’t much of them here!\"</p><br/><p>\"However, even though the Attack power of these Demonic Turtle is not really powerful, but their HP amounts were a little high and their Defence is a little too thick, don’t you think? They’ll be able to break the castle walls if they charge in at this rate!\"</p><br/><p>\"We must stop them from getting nearer to the castle walls then!\"</p><br/><p>\"Let’s charge out and kill them all!\"</p><br/><p>The players in the castle let out their battle cries once more. Then they opened up the castle gate and walked towards the turtle army.</p><br/><p>Thoom! Thoom! Thoom!</p><br/><p>Although the movement of the Demonic Turtles seemed extremely slow, their movement speed in walking forward wasn’t slow at all. Well, it was mostly because they were too huge! Their one step was equal to a normal player’s a hundred steps! Following the loud and trembling footsteps of the turtle army, thousands of Demonic Turtle were approaching the frontline of the players. With ease, they stepped and broke the defense line that the players formed and arrived at the bottom of the castle wall. Well, the Demonic Turtles were basically stepping on the players while they began to use their heads which were full of sharp thorns to bang the castle wall.</p><br/><p>Boom!</p><br/><p>Even though the Demonic Turtles seemed to move very slow, however, the speed of their heads stretching in and out was impressively fast! Instantly, the impacts of their head-butts were so powerful that they left holes in the castle walls! That had really shown how powerful their head-butts were!</p><br/><p>Meanwhile, the demons riding on top of the Demonic Turtles began to shoot their arrows upon their enemies. Instantly, the sky was clouded by the presence of the arrows that were shot by the demons.</p><br/>\n</div>"}