{"title": "Chapter 826: Aimore Mage Captian Heaphy", "id": 826, "volume": 9, "url": "http://boxnovel.org/mmorpg-rebirth-of-the-legendary-guardian-chapter-826-aimore-mage-captian-heaphy", "volume_title": "Volume 9", "body": "<h1>Chapter 826: Aimore Mage Captian Heaphy</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 826: Aimore Mage Captian Heaphy</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>‘Ding! The fourth wave of the demonic invasion is about to begin!’</p><br/><p>This time, countless Aimore Mages were seen, appearing on the horizon.</p><br/><p>Aimore Mages were all deemed to be demons of higher Tier. Not only did they have two horns on their heads, they also had the tails of lizards trailing behind them! They even had a pair of wings right on their backs! That should be enough to symbolize them to be one of the higher Tier demons in the realm of hell.</p><br/><p>Well, players would pay no mind to the statues of those demons. The one thing they cared about was that these monsters could fly! With so many of them flying around, they could easily form a deadly formation in the air and cause massive destruction to the players on the ground. The Tanks were massive. So, they would be attacked by approximately 100 monsters at the same time. Well, the other monsters would not be able to get themselves close enough to hit the Tanks anymore after each Tank is surrounded by 100 monsters.</p><br/><p>However, if the monsters could get into the air, the number of monsters that could hit a Tank at the same time would increase up to 1,000! Meanwhile, once the players lose their Tanks, the number of casualties would become tremendous!</p><br/><p>Although the monsters would die faster than any regular player on the battlefield, however, players would need to take on another 4 waves of Demonic Forces that had yet to come. After all, the interval of each wave coming in was decreasing. There was no time for the Healers to heal or resurrect the fallen at all.</p><br/><p>[Aimore Mage] (Normal, Demon)</p><br/><p>Level: 225</p><br/><p>HP: 290,120</p><br/><p>Defence: 8,800</p><br/><p>Magic Attack: 33,823 – 43,823</p><br/><p>Skills:</p><br/><p>[Fire Missile]: Causes 200% Magic Attack of Fire Damage to the target. Also causes 10,000 Fire Damage to all friendlies of the targets in the target’s surroundings.</p><br/><p>The one thing that everyone was happy about this wave, was that there were no signs of any Elite Tier monsters! All the monsters in the vicinity were just Normal Tier monsters! Well, a monster composed of a combination of flying type and magic type is deadly enough, I guess. If there are a bunch of Elite Tier monsters in the vicinity, the players would really need to cry and die.</p><br/><p>However, there was a boss in this wave. Judging by the fact that there was a boss in the third wave, players could deduce that a boss would be spawned once every 3 waves.</p><br/><p>[Aimore Mage Captian Heaphy]</p><br/><p>Level: 225</p><br/><p>HP: 2,250,000,000</p><br/><p>Defence: 21,710</p><br/><p>Magic Attack: 107,608 – 147,608</p><br/><p>Skills:</p><br/><p>[Fiery Volcano]: Summons a Fiery Volcano within the range of 40 meters. The volcano will erupt randomly. Each eruption will cause 240,000 Fire damage to all targets that are caught in the eruption. Lava will splash out from the targets and causes 50,000 Fire Damage to the players around the targets.</p><br/><p>[Flare Star]: Summons meteors from the sky and causes 200,000 damage to all targets within the area of 30 X 30 meters.</p><br/><p>[Demonic Fusion]: Fuses with an Aimore Mage’s soul and recovers 10% HP. The monsters that are fused will die immediately.</p><br/><p>Note: Even though Heaphy is the subordinate of the Demon Commander Isles, Heaphy appears to be very proud. He has committed insubordination multiple times over.</p><br/><p>\"Boss!\" Everyone was extremely excited upon the sighting of a boss. Even though they were no longer interested in Holy Tier equipment dropped by Holy Tier bosses, they were still very keen to acquire the [Demonic Pearls]. Those were some really good stuff, after all!</p><br/><p>\"Calm down, man. This boss also has {Demonic Fusion}. We must start with the little ones first!\" Hundred Shots said.</p><br/><p>\"Let’s go! They’re just Normal Tier monsters! It should be easy! However, you have to take care of yourselves. After all, these monsters can use Magic attacks and they can fly as well. If too many of them are onto you, you’ll still be as good as dead!\"</p><br/><p>\"Roger!\"</p><br/><p>\"Starlight, we’re using the same old trick. You’re going to kite the boss as well. Mini Piglet, you’ll be healing Endless Starlight. The boss is all yours for the moment. Stop the boss from slaughtering innocent players!\"</p><br/><p>\"Roger!\"</p><br/><p>Zhang Yang was only able to command his party which was relatively small. He would become confused if he has to command a large number of players in the battlefield. Fortunately, he had Mountain Mover to aid him in large-scale commandeering. Zhang Yang did not have to kill his brain to do that.</p><br/><p>Undoubtedly, these flying mother*ckers were really annoying as f*ck. Although they were all Normal Tier monsters, their Attack power was quite powerful. Normally, Level 200 players with a complete set of Ethereal equipment would only have approximately 500,000 HP. If 10 of these flying mother*ckers shoot their attacks on such a player at the same time, they could instantly kill the player!</p><br/><p>Meanwhile, Ethereal Tier equipment was currently the most common equipment that everyone wore right now. After all, Holy Tier equipment in the dungeons were too f*cking difficult to acquire. Meanwhile, the Fusion System provided by the NPCs could only enhance the equipment, not increase their Tier. Therefore, Holy Tier equipment was deemed to be one of those luxury items that only top Tier players from top Tier guilds could enjoy.</p><br/><p>Even though there were not many of those Normal Tier mother*ckers and there are easily taken out, however, they are able to take out the players in a brief period of time as well. Fortunately, the worst enemy on the field was currently taken on by Endless Starlight. Although there were also some idiotic players who went and got themselves killed by the boss, however, all in all, the boss did not kill more than a few players. The flying mother*ckers were the ones who were slaughtering the players up.</p><br/><p>That’s why there wasn’t any sign of any Elite Tier monsters. Monsters that could fly are really annoying and deadly!</p><br/><p>Another 3 hours passed. The players managed to clear out most of those flying mother*ckers. Everyone began to turn their attention towards the boss.</p><br/><p>As Holy Tier equipment was still very appealing to most of the players in the game, many of them could not help but charge towards the boss. However, they were tormented by the boss’ {Fiery Volcano} and {Flare Star}.</p><br/><p>When the flying mother*ckers were almost wiped out, Zhang Yang and the gang had also joined the boss fight. Well, they had no intention of getting any of the Holy Tier equipment. However, they were very eager to get the Demonic Pearls that might be dropped from the boss. Who knows if the boss would drop them upon death. Zhang Yang and the gang were in standby mode for the moment.</p><br/><p>The boss was quite ferocious. It was spamming its {Flare Star} as if the Skill did not have any cooldown! The players were bombarded by the deadly meteors that were showering from the sky. Meanwhile, the {Fiery Volcano} was also causing more chaos by throwing out blazing attacks at the players. Not only could the Skill spit fire upon the players, the players would also get splashed by lava. The lava had even formed into a river near the boss! Whoever who touches it would be struck by 50,000 Fire Damage!</p><br/><p>Fortunately, the Fiery Volcano was not as big as a real one. It was just as small as a giant boulder. If the volcano turns out to be as large as the real one, then the players should just quit the game and forget about it. Well, the entire Crimson Sky City would have been devoured by the lava coming out from the volcano!</p><br/><p>Skills which such an attack range would definitely be fatal to the players. However, top Tier players like Zhang Yang himself could definitely handle the impact without having anything to worry about. Well, with Zhang Yang’s current Defence, even if he walks straight into the lava and dips himself in, he would only receive about 4,000 damage. That amount of damage would not even give him an itch!</p><br/><p>Meanwhile, the Normal Tier monsters were completely being wiped out. The boss had lost its ability to recover HP. After being f*cked up hard by the players, the boss had finally collapsed onto the ground with a miserable scream and died. Upon its death, the boss dropped quite a number of loots across the ground.</p><br/><p>Zhang Yang was quick! Before anyone could react, he already picked up the four pearls from the ground. Having a closer look at them, the four pearls were indeed the [Lesser Demonic Pearls]!</p><br/><p>\"Zhan Yu, what are those? Judging from your reaction, those must have been extremely valuable!\" Coincidentally, Greensleeves Prince was right beside Zhang Yang when he snatched the pearls from the ground. He had reflexively attempted to follow, but was much slower than Zhang Yang. Therefore, he did not manage to pick up anything. He was very curious about it. He knew that Zhang Yang was no longer interested in Holy Tier equipment, but he did notice that Zhang Yang was very keen to get those pearls. So he asked Zhang Yang.</p><br/><p>Zhang Yang gave it some thought. Then, he decided to tell Greensleeves Prince about the pearls. Well, he won’t be able to keep the ‘secret’ for long, anyway. Sooner or later, someone is going to find out about these pearls through other way. Meanwhile, the Sunset Amber was also one of Lone Desert Smoke’s Allies. It would make Zhang Yang look bad if he ever tries to keep secrets from his friends.</p><br/><p>\"I see! I had no idea that such a thing existed in the game!\" Greensleeves Prince laughed out loud and said, \"Well, the next time another boss appears, we will not be courteous about it! We’ll be snatching those from you!\"</p><br/><p>Zhang Yang smiled. Well, he was no worried at all though. Snatching loots fro the ground would require knowledge. Meanwhile, he had Wei Yan Er and Han Ying Xue in his party. Those two moneygrubbers would definitely have become experts in such a field by now. Didn’t you see the little brat smiling with 4 pieces of Holy Tier equipment in her hands now?</p><br/><p>Well, the situation would only be similar to a discounted sale in a hypermarket. Women will gain explosive power when it comes to snatching goods. They would be much more ‘powerful’ than men could ever be in such regards!</p><br/><p>Giving no quarter to the players to even heal themselves and resurrect their fallen comrades, the bells of the seventh wave started tolling!</p><br/><p>This time, the monsters were known as ‘Evil Eye’.</p><br/><p>These monsters appeared like an octopus. They had a gigantic eye right in the middle of their bodies and eight tentacles all around their bodies. That’s it. There were no other features on them. Their gigantic eyes were radiating some eerie light. They were spooky, creepy creatures.</p><br/><p>[Evil Eye] (Normal, Demon)</p><br/><p>Level: 230</p><br/><p>HP: 252,630</p><br/><p>Defence: 9,160</p><br/><p>Magic Attack: 35,526 – 45,526</p><br/><p>Skills:</p><br/><p>[Eye of Death]: Fires a beam of deadly laser and causes 200% Magic Attack of Shadow Damage to the target.</p><br/><p>Unlike the previous wave, although there were no signs of any bosses in this wave, there were tens of thousands of Elite Tier Evil Eyes in the vicinity. The Attack power of Evil Eyes in such numbers would definitely be much higher than the Attack power of a boss! However, because these monsters had no flying ability, they did not pose as much of a threat as the Aimore Mages did.</p><br/><p>Well, that made perfect sense as well. The most powerful thing about range-type monsters was that they could focus fire on one target at a time and instantly kill the target. Although they may seem very weak on their own, well, when they come in numbers, the situation would change a little. Players would definitely not be able to afford fighting them in bulk!</p><br/><p>The use of the castle walls had finally been revealed. Mountain Mover was currently commanding the players to retreat into the city. There, the players began to use the wall to block the eye sight of the monsters. By doing so, they were able to divide the monster army! As long as players are not instantly killed, they would be able to recover their HP through healing Skills. Instantly, the death toll of the players became under control.</p><br/><p>Zhang Yang and his gang flew out of the castle on their Flying Mounts and began their assaults on the monsters. They threw their attacks on the monsters as intensely as they could. Well, because the monsters could not fly, whenever Zhang Yang and the gang got a little low on HP, all they needed to do was to fly higher a little and get themselves healed up before charging back into the battlefield.</p><br/><p>However, the castle walls had received some damage during the fourth wave of the demonic invasion. There were many holes left by the attacks from the Demonic Turtles. Even though players may not be able to go through those holes, the Evil Eyes could slip through any small hole. Well, they were basically octopuses. They began to enter the castle through any holes they could find on the wall. The fiercest battle throughout the entire war was about to begin.</p><br/><p>The casualties of the players were high as f*ck!</p><br/><p>However, this wave ended pretty quickly. It only took up 2 hours before the monsters were wiped out. The players had really taken a hit. The number of players remaining on the battlefield had been reduced to only 12,000,000. Well, even though the number was now lower, the power level of the players remaining were all top notch! From that moment onwards, none of the players remaining were below Level 190.</p><br/><p>Meanwhile, everyone could see that the monsters in the eighth wave would be Level 235. Therefore, players below Level 205 would be affected by the Level Gap Suppression effect of the game. The situation became worse than everyone could ever anticipate!</p><br/><p>\"We’re doing fine at this gate, however, the players by the South Gate have suffered the most losses. Currently, they barely have 6,000,000 players on the battlefield. Even if they could limp through this wave, they would never stand a chance in the ninth wave of the demonic invasion!\" Hundred Shot sighed heavily. \"Although the situation at the East Gate and the West Gate are a little better, well, they are not really much better actually… According to their statistics, each gate only has approximately 9,000,000 players remaining.\"</p><br/><p>Zhang Yang gave it some thoughts and said, \"Tell them this. After the eight wave of the demonic invasion, we shall abandon all four gates of the city. We shall gather in our Main City!\"</p><br/>\n</div>"}