{"title": "Chapter 835: Harder, Better, Faster, Stronger", "id": 835, "volume": 9, "url": "http://boxnovel.org/mmorpg-rebirth-of-the-legendary-guardian-chapter-835-harder-better-faster-stronger", "volume_title": "Volume 9", "body": "<h1>Chapter 835: Harder, Better, Faster, Stronger</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 835: Harder, Better, Faster, Stronger</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>The fight with Kenzack was far harder than the first Celestial tier boss, Angus. The main reason was due to the fact that Angus was alone, while Kenzack was accompanied by an Ascended tier supporter.</p><br/><p>However, after factoring in all the players strength and the boss’ skill, the fight with Kenzack was apparently, much easier!</p><br/><p>Angus was tougher to defeat, due to several reasons. The main reason was the level gap between players and the boss. None of them were even Level 190 when they were fighting Angus. That, and the fact that Angus had a recovery skill that was a bloody hack! Weak players could not even get close to Angus without being killed and heal him in return.</p><br/><p>Secondly, during that period, Ascended tier boss was still a rarity. Hence, Zhang Yang could not farm much-Ascended tier equipment to increase his prowess. Zhang Yang was underpowered, let alone the rest of the world. At then, the true fighters were the 8 major cities Ascended tier bosses. Players were only there to be random side characters. Fighting Kenzack, on the other hand, was all players and no NPCs. The quest, or rather, the developers had recognized that players all around the globe had reached a certain level of prowess, that they could handle a Celestial tier boss without the aid of NPCs.</p><br/><p>The fight began when Zhang Yang took a hit and landed a blow on Kenzack. Baa'ljilr the Imposter laughed and spread his arms out. A puff of red hue cloud appeared around Baa'ljilr and floated upwards. The cloud expanded into a large cloud which enveloped Kenzack.</p><br/><p>{Demon Amplification}!</p><br/><p>Kenzack, who was \"chilling\" at his own pace suddenly turned berserk. As if something had shot him with Adrenaline, the boss jumped to his feet and punched the ground beneath him, sending out countless of dark rays bursting out of the ground within 300 meters around him.</p><br/><p>{Void Blast}!</p><br/><p>With the boost provided by {Demon Amplification}, the skill had gained a boost and dealt more than 1,600,000 damage to all players. Luckily, many of the players had already activated their Transformation skills, granting them a certain chance to nullify magic attacks. Those without Transformation skill were all cramped inside War Chariots, allowing the 1.6 million damage to be evenly distributed among 50 players. </p><br/><p>As for those players that could not find a place in a War Chariot, nor possess a Transformation skill, they were forced to sit the boss fight out. They could not even be a side character, dealing negligible damage, for they would die before they could even poke the boss. Literally.</p><br/><p>Now that the formation was perfect and the plan was already in motion, Zhang Yang took the lead and allowed Mountain Mover to command the rest of the guild.</p><br/><p>\"KILL!\"</p><br/><p>Zhang Yang soared to the sky with his radiant wings spread out like a lighthouse in the dark ocean, guiding players to attack Baa'ljilr. Before he attacked Baa'ljilr, he had first landed a barrage of attacks on Kenzack. After filling up his Rage gauge, he turned to Baa'ljilr and launched an array of skills.</p><br/><p>{Charge Up Strike}! {Sky Slicer}!</p><br/><p>‘-4,397,691’!</p><br/><p>‘-8,795,382’!</p><br/><p>…</p><br/><p>‘-43,976,910’!</p><br/><p>With the aid of everyone’s powerful aura effects stacking on each other, Zhang Yang’s attack skills had soared to more than 4 million. By the time it reached the 10th strike, the damage had reached a staggering 40 million damage. That, and the additional 10% Holy damage, totaling the damage to as high as 260,000,000!</p><br/><p>\"ARGH!\" Baa'ljilr grunted painfully. He had already used 5% of his HP as a sacrifice to cast {Demon Amplification} on Kenzack. Coupled with the godlike damage inflicted by Zhang Yang, Baa'ljilr had lost around 7% HP in the first few seconds of the fight.</p><br/><p>\"WOAH! That’s hax!\" cried one of the guild members.</p><br/><p>\"It’s not hax! Guild master would never use any stupid hacking program! He is just that strong!\"</p><br/><p>\"I’d be d*mned! He could kill any player in the game now. He is unbeatable in PvP!\"</p><br/><p>200 million damage was indeed strong. It was even enough to kill himself if the opponent possessed any sort of skill that could reflect 100% damage back. Sadly, the skill {Sky Slicer} could only work on monsters. Against players, however, it would not be as efficient. Players could easily find a chance to stop the chain attack, preventing the damage from reaching the 10th strike. That, and an easy use of an Invulnerability skill.</p><br/><p>Monsters would always be the lowest benchmark to test one’s prowess as they were governed by software and their programming. A boss could have higher HP, higher attacks, more skills, or even faster cooldown rate, but they will always be bound to the aggro system. All in all, the boss was fated to die at the hands of Zhang Yang.</p><br/><p>{Warrior’s Will}! {Destructive Smash}!</p><br/><p>‘-2,985,678’!</p><br/><p>Since Baa'ljilr’s healing skill could be affected by skills, Zhang Yang had prioritized {Destructive Smash} on him to reduce his recovery rate to only 2.5% per use of {Demonic Bond}. As long as everyone focuses and responds swiftly when the 1,000 demons were summoned, they would kill all 1,000 of them in less than 5 seconds, limiting Baa'ljilr to only one use of healing. To put in all in the equation, every one minute, Baa'ljilr will \"sacrifice\" 7.5% HP per minute, hence, 13 minutes was all it would take for the party to kill Baa'ljilr.</p><br/><p>However, if the battle is dragged on for 13 minutes, the entire party would be wiped out by Kenzack instead. A 100% attack boost is not something that could be ignored, coming from a Celestial tier boss.</p><br/><p>With Mountain Mover commanding from afar, 20 counts of Type IV War Chariots headed towards Baa'ljilr. All crosshairs were targeted on Baa'ljilr alone. With a simple command, countless of skills blasted off the Chariots and landed on Baa'ljilr. Everyone, including Zhang Yang and his party, threw out all their skills with the sole aim of killing off Baa'ljilr as fast as they could.</p><br/><p>Since all skills had a long cooldown; and stronger ones would have a longer cooldown, hence, the burst DPS could last for only a brief moment before it died down to normal attack rate. At most, they could keep up the firing for 70 seconds. That was the time limit. By then, all War Chariots would have been destroyed by the boss. Without the War Chariot HP sharing system, players without Transformation skills would not last for long. In fact, in less than 2 hits of {Void Blast}, they would die off easily.</p><br/><p>\"Foolish men. The great Demon race is not weak like the likes of you!\" Kenzack spoke with a deep husky voice. He flicked his finger and summoned out 1,000 normal tier demons. Both Kenzack and Baa'ljilr then opened their mouths and two demons from the flock turned into a pile of bloody goo that got sucked into their mouths.</p><br/><p>Zhang Yang smirked and immediately activated {Gates of Hell}.</p><br/><p>A pair of large twin doors appeared from the ground with chains dangling from the side. Zhang Yang summoned the gates not too far from Kenzack and left it there as he rushed over to the summoned demons to give them a good {Horizontal Sweep} to their face. All that faced him were immediately turned into ashes. Their souls seeped out of their burned corpses and flew towards the {Gates of Hell}. With that single strike of {Horizontal Sweep}, Zhang Yang had killed 16 demons and summoned out 16 Elite tier Armageddon Harbinger to aid him in battle.</p><br/><p>\"What is this?\" cried Kenzack when he saw the demons that Zhang Yang had summoned were attacking him. With rage, he bellowed with disbelief. \"Human, how dare you enslave the demon race! I shall have your head and fashion your skull as my candle stand!\" </p><br/><p>Kenzack swung his gigantic blade so fast that the area behind the blade became a vacuum. After a split second, the air was pulled towards him so violently that the earth was ripped out of the ground like papers in a storm.</p><br/><p>\"Heed my call, Demons! I am your lord! Obey me!\" cried Kenzack as he tried to assume control over the demons that Zhang Yang had summoned through the {Gates of Hell}. However, unlike the Spectres, each demon would have their own conscience and showed no signs of rebelling Zhang Yang.</p><br/><p>Not only were the demons were not listening to Kenzack, they were also attacking him since Kenzack was spamming {Void Blast}. Hence, as the number 1 target in their aggro system, the Harbingers were all targeting Kenzack alone.</p><br/><p>\"Imbeciles! This is blasphemy! How dare you attack your lord! Die! Treacherous demons!\" Now that the Harbingers were attacking Kenzack, the aggro on Zhang Yang started to diminish greatly to point where Kenzack was no longer targeting Zhang Yang.</p><br/><p>Even though the boss was strong, he was still a monster that is governed by the aggro system. Unless there is a special setting, the boss will always attack those who have the higher aggro. Zhang Yang had only needed to grab the aggro from time to time to help increase the survivability of the summoned Harbingers. That, and to prevent Kenzack from healing himself. Even though each Harbinger could last only for a little while, Zhang Yang was not bothered by the expendables.</p><br/><p>That was only the first summoned wave. Everyone was proactive enough to let Zhang Yang be the only player to attack the boss’ summoned units. Even though Zhang Yang alone could clear all 1,000 monsters, he would have to wait until he has over 3 EP to use {God of War Crushing Strike}, by then, Baa'ljilr had already swallowed the second demon and gained another 2.5% HP.</p><br/><p>Still, even he had lost 3 demons out of the 1,000 summoned ones, and it was a worthy trade. Zhang Yang killed all the remaining 996 demons around and turned them all into his own soldiers. All the demons first targeted Kenzack. However, even though he was huge, there was a limit as to how many Harbingers could attack him at the same time. Hence, those that could not get into range changed their targets to Baa'ljilr instead.</p><br/><p>It was the system’s setting. If a character is unable to attack the first aggro target due to geological or terrain influence, the character will the moved towards the second aggro target instead. However, if there is a moment where an attack is possible on the first aggro target, the character will then automatically abandon the second target.</p><br/><p>After restoring a total of 5% HP from eating two demons, Baa'ljilr had not managed to retain his HP. Although, technically he had only lost the HP that he used to cast {Demon Amplification}, but the party’s DPS was strong enough to hack away Baa'ljilr’s HP down to 90% in a blink of an eye.</p><br/><p>After 70 seconds, Kenzack summoned the second batch of thousand demons.</p><br/><p>{God of War Crushing Strike}!</p><br/><p>Zhang Yang Strength points was boosted up to 54,232 points with the help from Wei Yan Er {Strength Aura}. Hence, the damage dealt by {God of War Crushing Strike} was as high as 540,000, enough to kill every single normal tier demon around the vicinity. Since both the bosses had opened their mouths at the very instance the demons were summoned, only a total of 998 demons were killed and 998 Harbingers were summoned.</p><br/><p>Just when Kenzack had cleared one-third of the \"rebellious\" demons, Zhang Yang had sent a whole new batch to him. How could one compare? Kenzack had only the ability to summon 1,000 normal tier demons, yet a human could summon about the same number of Elite tier demons out of thin air! Which one is the real demon lord, then? Zhang Yang? Or Kenzack!?</p><br/><p>The previous batch of Harbingers had split into two factions where those that were unable to attack Kenzack had moved to attack Baa'ljilr. Hence, when the newly summoned Harbingers came in, all of them went on to attack Baa'ljilr instead, further increasing the overall DPS on Baa'ljilr.</p><br/><p>Crash!</p><br/><p>All 20 Type IV War Chariots were destroyed by Kenzack. Losing the protection from the War Chariots, all 1,000 players that were mounted on the Chariots were left unprotected. Sadly, the boss had killed all of them with two hits of {Void Blast}. That is the true prowess of a Celestial boss. Without a certain level of strength and HP, players are not meant to fight a Celestial tier boss.</p><br/><p>However, even though losing 1,000 player’s worth of DPS, Baa'ljilr was clearly fated to die. Even though Baa'ljilr had his own unique A.I to control his speech, his skills were not controlled like a player. Once the cooldown was completed, Baa'ljilr will use his skill without fail. Hence, he was inevitably killing himself. Each time he uses {Demon Amplification} he will hack away his own HP. Hence, like the players and the demons that are summoned by Kenzack, Baa'ljilr was dying, rather quickly too at that.</p><br/><p>Sadly, the player’s side was also facing a similar threat by Kenzack. 100% attack boost was not something that healers could keep up with. They could, if there were 100 players like Han Ying Xue, possessing a powerful healer type S class Inheritance. But, there is only one Han Ying Xue, and she could never heal the damage dealt by Kenzack.</p><br/><p>Everyone was merely surviving due to their powerful HP boost granted by their Inheritance Transformations. The fate of the boss fight now lay on how fast could Zhang Yang and his merry little guild kill off Baa'ljilr. The sooner, the better.</p><br/><p>{Thousand Summon}! {Demonic Bond}!</p><br/><p>{God of War Crushing Strike}!</p><br/><p>As soon as Kenzack summons his demons, Zhang Yang would eliminate all of them with {God of War Crushing Strike}. The third wave of 998 Elite tier Harbinger was sent to the bosses again, and they were just in time to fill in the gaps in the first wave. The continuous DPS cycle was astonishingly fast.</p><br/><p>5 minutes later, with the second combo of {Charge Up Strike} and {Sky Slicer}, Baa'ljilr was killed.</p><br/>\n</div>"}