{"title": "Chapter 833: Staying In The Lead", "id": 833, "volume": 9, "url": "http://boxnovel.org/mmorpg-rebirth-of-the-legendary-guardian-chapter-833-staying-in-the-lead", "volume_title": "Volume 9", "body": "<h1>Chapter 833: Staying In The Lead</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 833: Staying In The Lead</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Among the eight main Regions in the entire server, China Region was the only one who survived the onslaught of the Demonic forces during the Demonic Invasion event. So, it was natural that the players from China Region were proud and happy at the same time. They managed to convince themselves that their efforts did not go to waste because of that.</p><br/><p>However, they managed to survive the last two waves, merely because Zhang Yang had summoned his legion of demons with his ‘Gate of Hell’. That would be the irreplaceable factor that led China Region to their victory over the demonic forces! Even though it was true that the Lone Desert Smoke would not have made it to the last wave all by themselves, the other players could not deny Zhang Yang’s efforts and contributions on that matter.</p><br/><p>That had also sent many of the players sighing in shame. If any other of them could get a hold of the ‘Gate of Hell’, they could have contributed a lot at fending the Demonic Invasion as well. They could have helped to keep many more players alive until the final boss revealed himself!</p><br/><p>Now that the China Region did not receive the penalty of Experience Point Reduction, the players from China Region had basically gained a significant upper hand in term of strength. Well, while the others were set back by the penalty, the players from China Region did not lose anything. They could also focus on grinding to get stronger without any hindrance. The negative effect would stay until the players manage to complete all 7 Demonic Invasion Events before the NPC armies strike back at the demonic forces. Only then, would the players be able to take back their lands and cities, one after another, with the help of the NPC army. Well, each successful retaking of a city would recover 10% of the players’ rate of Experience Points.</p><br/><p>Like the Monster Attack Event, the NPC army would act once every month. If the seven Main Cities fall tragically by the end of the event, players would need to wait for 7 months before the speed of them earning Experience Points recover its initial speed.</p><br/><p>Of course, it did not mean that players cannot launch Strike Back conquests to take back their main cities during that period of time.</p><br/><p>However, players could still heal their HP and MP and resurrect players when they were defending their main cities in between every wave. The players even got some help from the NPCs. If they still couldn’t fend off against the Demonic Invasions, it would be insane to even think about striking back at the demonic forces!</p><br/><p>Obviously, the only way to reclaim the lost cities and lands would be to borrow aid from the NPCs. Well, the system had stated clearly that the players would only be eligible to challenge the Celestial Tier boss after all Main Cities of all Main Regions are reclaimed. Even though the Celestial Tier boss Kenzack was obviously placed there, the players would have to follow the system’s ruling.</p><br/><p>However, players were still too weak to get into Level 240 – 270 maps at the current stage of the game. Obviously, the system had designed it to prevent players from attempting to bring down the boss.</p><br/><p>Well, maybe when all of the Main Cities are reclaimed, the NPCs will open up a portal and let the players through into the lair of Kenzack. By then, the players should be able to challenge the Celestial Tier boss. Or, the system could just drag Kenzack out of his hiding lair into the public and kick everyone’s *ss. Well, how the events would unfold totally depended on the game company. Their idea could just change at the next moment.</p><br/><p>Although 30 days was not a short period, it was merely 10 days in reality. That amount of time would be sufficient for the players to grind 1 level, at least. Well, do not estimate the difference of 1 level. That could mean most of the Level 214 players have leveled up to Level 215 by now. So, they shouldn’t be concerned about the Level Gap Suppression effect of the game when they survive until the last wave of the invasion, where the bosses reveal themselves on the battlefield!</p><br/><p>Because the players in China Region had acquired the advantage of earning 10% additional Experience Point, the number of China players reaching Level 215 was obviously higher than the number of players reaching Level 215 in other Regions. At the same time, the number of Level 210 players and Level 205 players had increased substantially...</p><br/><p>Because of that, there would be much lesser players getting restricted by the Level Gap Suppression effect of the game.</p><br/><p>Little by little, the advantages that the players could gain over each wave will be brought over to the last wave, to create an impressive effect in order for the players to defeat the last wave of the demons!</p><br/><p>Each wave of the Demonic Invasion would send out an Ascended Tier boss. Therefore, there was no sign of any other Ascended Tier boss across the maps. Therefore, the only way for the players to acquire better equipment to improve themselves was to head down to the Elemental Nest.</p><br/><p>30 days had passed without much notice. This time, all eight Regions were ready for the second Demonic Invasion Event.</p><br/><p>The invasion was similar to the first Demonic Invasion Event. There were a total of 10 waves of monsters. The number of monsters and the type of the monsters in each wave was exactly the same as the first event. Even the sequence of monsters revealing themselves to the players was the same! The only difference was that the names of the monsters in the third wave and the name of the final boss in the final wave had some changes. Well, their levels, Skills and HP were exactly the same compared to the first invasion event as well.</p><br/><p>Although the China Region was the only Region that had managed to last until the end, however, if they hadn’t used 10 Forbidden Scrolls while they were fending off the tenth wave of the invasion, they would have been wiped out and their efforts would have been for nothing. Meanwhile, it wouldn’t be easy at all to acquire one Forbidden Scroll. Even Lone Desert Smoke only managed to earn back two Forbidden Scrolls from Isles. The other guilds had failed to ‘restock’ their Forbidden Scrolls.</p><br/><p>Therefore, even though they were very familiar with the battles ahead of them, they still struggled through hell in the tenth wave! Zhang Yang did not hold back anything in that battle. He threw out both of the Forbidden Scrolls ‘Absolute Zero’ and ‘Doomsday’s Natural Disaster’ without any hesitation. Furthermore, there were at least 10,000 players who managed to reach Level 215 and over, this time. They were able to destroy the monsters in the tenth wave with the aid of Zhang Yang’s two Forbidden Scrolls.</p><br/><p>However, they were sent even closer to death this time. When the final boss Marank arrived, only Zhang Yang, Han Ying Xue and Sun Xin Yu remained on the battlefield!</p><br/><p>\"Can we still take the boss down?\" Han Ying Xue was not confident at all.</p><br/><p>Well, there were still 67 remaining when they began engaging the final boss previously. Although the boss was basically tortured to death by Zhang Yang alone, Zhang Yang did use a Forbidden Scroll ‘Stuttering Focus’ to weaken the boss’s Attack by one third. So, how would they be able to take down the boss this time?</p><br/><p>\"No worry! Snow Seeker has given me a Forbidden Scroll that focuses on weakening one target!\" Zhang Yang activated his God of War Transformation and charged towards the boss. At the same time, he tore off the Forbidden Scroll and threw it onto the boss.</p><br/><p>[Forbidden Scroll: Doomed Entanglement] (Consumable)</p><br/><p>Use: Curses the target with a doomed fate. The target will have a 50% chance to deal half of the initial damage. The target will have 50% to receive double damage when hit. Lasts for 10 hours.</p><br/><p>Required Level: 200 </p><br/><p>Even though this scroll could not weaken the boss as much as the previous one, the scroll could still add a 50% rate to increase the players’ Attack power by an additional 100%! That could make Zhang Yang and the two ladies much stronger! Because the battle was ended in a brief moment, everyone knew that the boss had been weakened by the system.</p><br/><p>\"Tsk... she’s really... good to you!\" Han Ying Xue began to get jealous about it. Then she narrowed her eyes while staring at Zhang Yang with blazing jealousy.</p><br/><p>Zhang Yang laughed bitterly. Well, as long as he just leaves her alone for now, nothing would happen. Or else, if that witch starts to quarrel with him, he would be having a hell of a ride for the day. She would talk about Snow Seeker, then change the subject over to Luo Yu Rou, then change the subject over to Chen Xue Yao. The sh*t will go on until Zhang Yang admits he’s wrong, even though he did nothing wrong.</p><br/><p>Felice transformed into her ‘Tree of Life’ form immediately.</p><br/><p>This time, Zhang Yang had come prepared. He would not let Felice repeat the same mistakes again.</p><br/><p>Well, Han Ying Xue was ‘disabled,’ as expected. She was ‘imprisoned’ for most of the time, during the entire boss battle. However, Felice was able to perform at her best this time. Combined with the {Restoration} that Han Ying Xue would throw at him once in a while, Felice managed to maintain the HP bars of Zhang Yang and Sun Xin Yu.</p><br/><p>Fortunately, Han Ying Xue was safe and sound in the ‘imprisonment’. So, she did not even lose one bit of HP. Zhang Yang could just throw his {Surrogacy} onto Sun Xin Yu so that she could also have a taste of having the world strongest Defence power!</p><br/><p>{Charge Up Strike}! {Sky Slicer}!</p><br/><p>‘-4,037,091!’‘-8,074,182!’‘-24,222,546!’...‘-40,370,910!’</p><br/><p>Well, it seemed that the designers of the game had never thought it possible that a player would acquire the two Skills that Zhang Yang had just activated at the same time! The {Charge Up Strike} could ensure the attacks of the next Skill to be 100% Critical Hits! Although {Sky Slicer} could only slice out 10 attacks thoroughly, the 10 attacks were considered as ‘one Skill’. So naturally, each of the 10 hits would become Critical Hits! Furthermore, each upcoming hit would gain 50% additional attack!</p><br/><p>The {Charge Up Strike} had really boosted Zhang Yang’s damage tremendously! Zhang Yang had just dealt approximately 330,000,000 damage in merely 10 seconds! That’s a total of 33,000,000 DPS! That had exceeded his initial DPS of 1,300,000 damage by many notches! Of course, such an explosive series of attacks would only happen once in every 5 minutes. Other than that, it was also because Zhang Yang had used the ‘Doomed Entanglement’ which allowed him to have 50% rate to trigger double damage. So normally speaking, he should initially deal approximately 220,000,000 damage only.</p><br/><p>Well, a 330,000,000 damage was not a damage amount that a boss could take on. That amount of damage had taken out 3% of the boss’s HP! It was savage!</p><br/><p>Not only was the boss heavily wounded, Sun Xin Yu and Han Ying Xue were stunned to see that! Well, the Skill could only be so powerful when Zhang Yang is the one using it!</p><br/><p>The boss was very unfortunate, though. Even though the boss also had the same Skill, he was interrupted by Zhang Yang after he managed to strike once with the Skill. The difference was just huge! If the target of Zhang Yang was a player, the player would just cry in misery and die!</p><br/><p>Even though there were only two players left on the battlefield to deal damage to the boss, but both players were players with Class S Inheritance. Their damage outputs were terrifyingly high! Each of their DPS had exceeded 1,000,000 damage now! Theoretically, they would only need approximately 80 minutes to take out the boss! Furthermore, Zhang Yang could deal a series of explosive attacks once every 5 minutes! That had really reduced the time needed to slay the boss!</p><br/><p>About one hour later, the boss let out a pathetic roar and died! Well, the boss was f*cked up hard by Zhang Yang and Sun Xin Yu with ease!</p><br/><p>Unfortunately, the boss did not drop the Skill Book {Sky Slicer} this time around. Wei Yan Er was extremely disappointed because of that. She pouted and sulked at the sidelines.</p><br/><p>Well, the China Region managed to keep their Main City this time as well. The players had received 20% additional Experience Points whenever they were earning EXP. Because of that, they gained an absolute advantage over the other Regions when it comes to grinding.</p><br/><p>Another 30 days had passed. The third Demonic Invasion had arrived.</p><br/><p>After experiencing the invasion for over two times, the players have become very familiar with the layout and design of the demonic forces’ waves. Furthermore, the number of high-level players throughout the entire server had increased substantially as well. This time, finally, China was not the only Region that succeeded in keeping their Main City. The Europe Region, India Region, and North-America Region had also succeeded in fending off the demonic forces from taking over their Main Cities!</p><br/><p>However, even though that was the case, the China Region still had the advantage of earning 20% additional Experience Points. That would not change for now. Because of that, the players from China Region continued to triumph in regard to leveling and staying ahead of the game.</p><br/><p>As the number of players retained by the end of the tenth wave increased, Zhang Yang and his gang no longer needed to take on the boss all by themselves. Well, they could no longer take all the loots to themselves because of that. However, when it comes to snatching items and equipment, Han Ying Xue and Wei Yan Er were experts among experts in such regard! They were basically ‘trained’ to be fast in snatching because of their ‘money-grubbing’ attitude. By the end of it, Lone Desert Smoke still got the largest portion of the loots.</p><br/><p>Well, there was already a total of 19 [Normal Demonic Pearl] among the loots! Those pearls were enough to ensure a 100% success rate in enhancing an equipment of a top Tier player to +4 enhancement!</p><br/><p>The fourth Demonic Invasion, the fifth Demonic Invasion... the seventh Demonic Invasion!</p><br/><p>All Regions had managed to completely fend off the Demonic Forces in the fifth time Demonic Invasion. Therefore, the Japan-Korea Region had only lost over 4 main cities, even though they were hit the hardest. However, they would need at least 120 days of in-game time to completely reclaim their main cities, get back their initial efficiency of grinding and reach the required level to challenge The Demon Lord Kenzack!</p><br/><p>--- Provided that the NPCs successfully reclaim the main cities every time they strike back!</p><br/><p>Because the China Region had not lost a single main city throughout the 7 times of Demonic Invasion, they managed to acquire the opportunity of being the first in the entire server to ever challenge the Demon Lord Kenzack. However, Zhang Yang did not sign into the game for a few days straight. That was because Luo Yu Rou was about to give birth to his first child!</p><br/>\n</div>"}