{"title": "Chapter 837: Goddess of War Scion Form", "id": 837, "volume": 9, "url": "http://boxnovel.org/mmorpg-rebirth-of-the-legendary-guardian-chapter-837-goddess-of-war-scion-form", "volume_title": "Volume 9", "body": "<h1>Chapter 837: Goddess of War Scion Form</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 837: Goddess of War Scion Form</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>\"Hurry! Give it! Give it!\" </p><br/><p>When everyone had returned to the Holy City, all eyes were locked on Wei Yan Er, as she was the only person then that was holding all of Kenzack's drops.</p><br/><p>The little girl fidgeted around shyly and blushed. \"Erhm…Please don't stare at me like that. I'm bashful, you know?\"</p><br/><p>At that moment, everyone that was close to Wei Yan Er was on the urge of actually vomiting in their mouth. Bashful? Really? If Wei Yan Er knew shame, the sun would rise from the north and sets in the south!</p><br/><p>Zhang Yang laughed till his tummy ached a little. He wiped his tears away and laughed as he said, \"Please stop making us laugh. It's time for our prizes!\"</p><br/><p>\"Okay…Just…don't stare at me. I aware of my own beauty.\"</p><br/><p>Wei Yan Er opened her inventory U.I and pulled out a cape that shone with the colors of the rainbow. She then passes it to Han Ying Xue.</p><br/><p>\"Cousin sister, this is yours!\"</p><br/><p>It was a Celestial tier set equipment part, [God of Life's Glory Cape].</p><br/><p>As per discussed, those who already possessed one piece of the set equipment will have the priority, in order to complete the set equipment to further increase the party's strength by completing the set equipment as soon as they can. Hence, Han Ying Xue, who already possessed [God of Life's Glory Heels], had received the cape and was able to activate the first set equipment set effect. That is, \"Grants a 20% chance to repeat a conjured spell after casting.\"</p><br/><p>\"Sister Sun! This is yours!\" Wei Yan Er took out another cape and gave it to Sun Xin Yu.</p><br/><p>\"Uncle! This is yours,\" she handed one to Hundred Shots.</p><br/><p>\"Pervy Dream!\"</p><br/><p>…</p><br/><p>All of the Celestial tier set equipment loot from Kenzack were all Capes. Those who had obtained their first set equipment had also obtained their second part which allowed all of them to activate their first set effects.</p><br/><p>\"This is mine!\" cried Wei Yan Er as she wrapped a cape around her neck whilst jumping around happily. \"I look so cool!\"</p><br/><p>\"Well? Don't stop there.\"</p><br/><p>After taking the 6th cape, Wei Yan Er pulled out the 7th and gave it to Endless Starlight. \"Pervy Star boy. Take it. It's specially made for Sacred Knights. Hmph. Consider yourself lucky!\"</p><br/><p>\"Woohoo!\" cried Endless Starlight with joy as he was the only Sacred Knight in the main and secondary party.</p><br/><p>While everyone else was waiting patiently, Fatty Han could not take it anymore and sulked. \"Where's mine…\"</p><br/><p>Hundred Shots and Fatty Han were the same class, hence, it was inevitable that when it comes to equipment distribution, there will be a conflict between the two of them. During the first round of equipment distribution, Hundred Shots had won the roll for the Celestial tier set equipment. Hence, he had the priority for the second Celestial tier set equipment as well. Sadly, there was nothing he could do then but to bully Endless Starlight to release his pent up stress.</p><br/><p>The 8th Celestial tier set equipment was a Cryomancer type, which was passed to Cheng Xue Yao. She was still unable to equip it, as her level was still low.</p><br/><p>Zhang Yang was still empty handed then. \"Hey…is there any for Guardians?\"</p><br/><p>\"Hmph…? Let me check…Tch…tch…tch…\" said Wei Yan Er as she pretended to fake a disappointed expression. Zhang Yang knew that she was lying, since her eyes were moving left and right. If she is playing poker, she would have lost the game in the first round. Zhang Yang decided to humor the little girl and walked away from her with his head down. As such, the little girl felt happy that she had succeeded at \"tricking\" Zhang Yang by fooling him. She laughed, tapped his shoulders and gave him a cape. \"Haha! You stupid brother-in-law! This little lady has just bamboozled you!\"</p><br/><p>Zhang Yang took the cape and faked a grateful face before having the cap identified, immediately on the spot. It would make no difference for him to have the cape identified by an NPC or the scroll, since the price would be the same.</p><br/><p>[God Killer Cape] (Celestial, Cape)</p><br/><p>Vitality: +25730</p><br/><p>Strength: +3312</p><br/><p>Dexterity: +3312</p><br/><p>{Level 8 Socket}</p><br/><p>Equip: Increases maximum HP by 51,460.</p><br/><p>Equip: Increases damage dealt and healing rate by 15%</p><br/><p>Equip: Absorbs 2,918 damage from attack.</p><br/><p>Use: Receives the Divine Ichor and gains immunity and invulnerability for 10 seconds. Cooldown: 30 minutes.</p><br/><p>Class Requirement: Guardian</p><br/><p>Level Requirement: 250</p><br/><p>Special: Level Requirement reduced by 30 Levels.</p><br/><p>God Killer Set Equipment (2/8) Completion.</p><br/><p>Two Equip Effect: Increases your Damage reduction passive effect by 20%.</p><br/><p>A 20% damage reduction passive boost!</p><br/><p>In a shielded status, Zhang Yang damage reduction passive was at 40%. With the use of {God of War Shield} he would gain up to 60%! After reaching Level 220, the skill {Rock Solid} was maxed out to Level 10. After being enhanced by the [Book of Revelation,] the skill increased Defense value was boosted to 150%, and 30% damage reduction boost. In conclusion, without {Shield Wall}, Zhang Yang would gain something as high as a 90% damage reduction!</p><br/><p>By then, activating {Shield Wall} would be meaningless, since the damage reduction effect provided by the skill would not add to the previous number, but multiply it to the previous number. I.e. 1-0.1 x 25% = 97.5% of damage reduction.</p><br/><p>Zhang Yang had successfully increased his Defense with just an addition of a Celestial tier equipment! That's how powerful a Celestial tier set equipment is! Broken? Heck yeah it is!</p><br/><p>With Zhang Yang being the last to claim, all of the Celestial tier set equipment parts had been distributed. There was a total of seven players who had activated their second set equipment set effects. They were Zhang Yang, Han Ying Xue, Sun Xin Yu, Wei Yan Er, Daffodil Daydream, Lost Dream, and Hundred Shots.</p><br/><p>Cheng Xue Yao and Endless Starlight had received a piece of the Celestial tier set equipment. One more Celestial boss like Kenzack, and they might receive a second part to activate their set effects.</p><br/><p>Besides the nine pieces of set equipment, Kenzack had also dropped four regular Celestial tier equipment. Naturally, they were all given to those without Celestial tier set equipment, like Fatty Han and Galileo.</p><br/><p>As for the random items, 17 [Skill Point Crystals] were distributed accordingly. 12 [Advance Aura Stone] and two [Forbidden Scrolls] were stored in the guild storage. Seven skills books were up for rolls. There were also 12 [Advance Demonic Pearls] found, and were all stored in the guild storage.</p><br/><p>Sitting quietly in the corner of Wei Yan Er was one black colored crystal rock that had an irregular shape. It was not smooth, and had several perfectly cut edges all over the rock. Wei Yan Er took out the crystal and showed it to Zhang Yang.</p><br/><p>\"This thing is weird. This piece of rock does not have an item name nor a description. Could it be a random bug?\"</p><br/><p>Felice jumped out of Zhang Yang's Battle Companion U.I and cried out. \"Big brother!\" She instinctively reached out her right hand to grab the crystal but immediately retracted her hands.</p><br/><p>\"Oh ho? Little Felice wants this? I'll give it to you then. Just greet me nicely!\" said Wei Yan Er with her chest held up high.</p><br/><p>\"Big Sister. Can I have that crystal?\" said Felice with her most earnest tone ever, which made Wei Yan Er so happy, even though Felice was clearly taller and older than her.</p><br/><p>Zhang Yang felt his heart was about to jump out of his chest. Could the crystal rock be a catalyst to unlocking Felice's third seal?</p><br/><p>\"Here you go! What a nice girl!\" Wei Yan Er patted Felice's head.</p><br/><p>Felice took the crystal in her hands and placed it close to her chest. The black, soot-like crystal then gave out a blinding light that immediately encased Felice into a large, egg-like structure that was as tall as Zhang Yang.</p><br/><p>\"F*ck yeah! Finally!\" said Zhang Yang to himself. The crystal was to unlock Felice's third seal! Zhang Yang was breathing raggedly as he was excited to see how strong would Felice be. Could she have another form to transform into? Could she gain growth rate? All that would have to wait until she hatches out of the egg.</p><br/><p>With the weird, egg-like structure sitting idly in the center of a busy city, many players could not help but examine the thing. It was sticking out like a sore thumb! Luckily, PvP or any attack was restricted in the city. Hence, besides Zhang Yang, others had could not select the egg to view its description.</p><br/><p>Everyone lingered a little while to see what the egg would do, but left after waiting for several hours. Zhang Yang decided to loiter around Anthylor until something happens. Lo and behold, after three days of random activities around the city, a bright light shone brightly from where the egg was, and Zhang Yang could spot it from the other end of the city. Zhang Yang was around the auction house when he noticed the bright light. He then immediately closed the U.I and sped towards the egg. Halfway through the city, Zhang Yang could see Felice soaring in the sky in her Dragonhawk form.</p><br/><p>\"Big brother!\" she cried happily and she shot down towards Zhang Yang at breakneck speed. Right before she landed, she morphed back into her human form and made a crack on the tiles in front of Zhang Yang.</p><br/><p>\"I missed you, Felice!\" Zhang Yang caressed Felice's forehead and quickly examines her properties.</p><br/><p>The most obvious change that she had was that her Star Growth rate had increased to 13 Stars!</p><br/><p>[Felice] (Humanoid)</p><br/><p>Level: 222</p><br/><p>HP: 6,298,830 (With Vitality Aura)</p><br/><p>Defense: 34,900</p><br/><p>Melee Attack: 442,688 – 542,688</p><br/><p>Skills:</p><br/><p>[Blazing Dragon's Spear]: Deals 200% melee Fire damage to a target. Requirement: Melee Weapon. Cooldown: 1 second. Cost: 50 Energy.</p><br/><p>[Dragon's Spear Barrage]: Deals 300% melee physical damage to a target and had a 30% chance to stun for 5 seconds. Effective on Boss monsters with lower success rate. Requirement: Melee Weapon. Cooldown: 1 minute. Cost: 50 Energy.</p><br/><p>[Absolute Defense]: Gains 99% damage reduction passive for 2 minutes. Cooldown: 4 hours. Skill can only be used in human form. Will be ineffective in other forms.</p><br/><p>[Dragonhawk Form], [Spectral Tiger Form], [Tree of Life Form]</p><br/><p>[Goddess of War Scion Form]: Transcends humanity and gains the primordial form of the Goddess of War. Gains 300% attack damage and all attacks will have Chaos attribute. Increases 300% Defense and 2000% HP boost. All skills available in human form will also be available during the Goddess of War Scion Form. Lasts for 2 hours. Cooldown: 72 hours. Activating the Goddess of War Scion Form will trigger all Dragonhawk Berserk, Spectral Tiger Berserk, and Tree of Life Transformation cooldowns.</p><br/><p>(Fourth Seal)</p><br/><p>Note: Player Zhan Yu's Battle Companion.</p><br/><p>What a deadly upgrade…</p><br/><p>Without Transformation, Zhang Yang had only roughly 5,340,000 HP. That was with two Celestial tier set equipment in hand, yet he was still weaker than an Ascended tier Felice! It was all mainly due to her Growth stat being at 13 Stars! One Vitality point would grant her 13 points of HP instead of a player's usual 10 HP! The {Vitality Aura} provided by Zhang Yang will stack on that hence, giving Felice the ability to gain 18 HP per Vitality stat.</p><br/><p>It was then obvious that after the fourth and final seals are broken, Felice would gain the Celestial tier and gain a 14 Star growth or even 15, to reach the peak of what a Battle Companion could be.</p><br/><p>Huhuhu. Celestial tier. A god like entity!</p><br/><p>Sadly, there were not more forms after the third seal. Instead, Felice had gained a Transformation for her human form. Her skills {Blazing Dragon Spear} and {Dragon Spear Barrage} had also gained a massive boost!</p><br/><p>In the past, Zhang Yang had always had Felice to attack in her Dragonhawk form, since she could fly and her Fire-based attacks will ignore all Defense values. After the upgrade, Felice's human form had the highest DPS power, as well as the strongest Defense and highest HP limit.</p><br/><p>To summarize it, Felice's human form will have 310,000 DPS, while her Dragonhawk form will have only 290,000. Based on the Defense value, both forms were about equal.</p><br/>\n</div>"}