{"title": "Chapter 832: Sky Slicer", "id": 832, "volume": 9, "url": "http://boxnovel.org/mmorpg-rebirth-of-the-legendary-guardian-chapter-832-sky-slicer", "volume_title": "Volume 9", "body": "<h1>Chapter 832: Sky Slicer</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 832: Sky Slicer</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>With 200,000,000 HP left on him, Zhang Yang began to engage Isles, who still had 200,000,000 HP remaining. However, the Attack power of both sides was not on the same notch after all. It did not take much before Zhang Yang destroyed the boss, entirely!</p><br/><p>\"Rawgh ---\" Isles let out a miserable scream and collapsed to the ground. Numerous loots were dropped across the ground.</p><br/><p>‘Ding! The Demonic Commander Isles has been eliminated!’</p><br/><p>‘Ding! You’ve acquired 3 additional Skill Points!’</p><br/><p>‘Server Announcement: Congratulations to China Region for successfully fending off the Demonic Invasion!’</p><br/><p>\"Yeah! We’re rich!\" Naturally, Han Ying Xue was freed from the ‘prison’ the moment the boss died. In the face of the glittering pile of loots across the ground, Han Ying Xue’s eyes began to glitter as well! Well, here she goes again… she had just entered her money-grubbing mode again.</p><br/><p>\"Stop dreaming and pick up the loot now!\" Zhang Yang laughed out loud and quickly started picking up the loots from group.</p><br/><p>The battle was over. All of the Teleportation Circles had resumed their regular functionality. Meanwhile, the dead body of the boss was right in the middle of the main city. It would only take approximately 3 to 5 minutes for the players to reach all the way back to the boss’s dead body. Zhang Yang and Han Ying Xue had no time at all to take a closer look at the loot! So, it would be wise for them to pick all the loot up as quickly as they can.</p><br/><p>Of course, when the two of them picked up the loots from the ground, the others had arrived at the scene, one after another. However, they arrived only after Zhang Yang and Han Ying Xue had already swept the entire ground clean! So, those players could only sigh at the boss’s dead body.</p><br/><p>--- Main City forbids any form of PvP match!</p><br/><p>\"Zhang Yang! You’re not the only one who contributed in taking down the boss! Share the loots! We’re entitled to them as well!\" Zhong Xiu Hua suddenly cried like a little b*tch.</p><br/><p>\"That’s right, we’re entitled to the loots as well!\"</p><br/><p>\"Without us, you wouldn’t have had any chance against the boss at all!\"</p><br/><p>The people of Eternal Flame began to whine like a whole bunch of little b*tches. Well, no one could blame them for behaving that way. The Ascended Tier equipment was currently extremely precious. It was not like anyone could just obtain the Ascended Tier equipment by purchasing it with money. Anyone who has fought Angus before would know better. The power level of the Celestial Tier boss can be freakishly powerful at times! Without a full set of Ascended Tier equipment, none of the players would be able to challenge a Celestial Tier boss!</p><br/><p>Furthermore, Isles would not only drop Ascended Tier equipment. He should have dropped other powerful items such as Skill Books and Normal Demonic Pearls as well!</p><br/><p>Zhang Yang laughed out loud and said, \"Don’t you think that you’re acting like a bunch of clowns now? Your acting sucks! So, stop embarrassing yourselves at once! If you think it’s not embarrassing enough, I don’t mind teaching you some lessons on the ‘Hovering Amphitheatre’!\"</p><br/><p>\"Zhang Yang! You better keep your head down! Lone Desert Smoke can’t possibly take on all the players in the entire China Region! This world belongs to everyone! Not just your sh*tty Lone Desert Smoke!\" Zhong Xiu Hua was trying to provoke the rage of the other players towards Zhang Yang. \"Without the efforts of the other players, your Lone Desert Smoke would not have even survived the first wave of the invasion! Pui!\"</p><br/><p>\"Boo hoo, cry me a river! Nobody’s efforts have gone to waste! Firstly, everyone was fighting for the name and dignity of entire China. Secondly, everyone was fighting to prevent the 10% Experience Points reduction on everyone in China Region! So don’t consider yourself a saint or whatever! You’re not! You don’t even speak for everyone in China Region! Pui!\" Zhang Yang began to feel impatient, as he looked at Zhong Xiu Hua with disdain.</p><br/><p>\"Zhang Yang ---\"</p><br/><p>\"Stop whining here! Shut the f*ck up! If you want to prove something, let’s settle it on the ‘Hovering Amphitheatre’. Or else, just get lost! Pui!\" Zhang Yang revealed a very impatient expression on his face.</p><br/><p>Zhong Xiu Hua was so angry that his face turned pale. However, he didn’t have the guts to face Zhang Yang on the ‘Hovering Amphitheatre’ as well. If he ever gets killed in that arena, he would lose his levels! Now that it has become ridiculously difficult to grind for even one level, Zhong Xiu Hua would not be daring enough to accept that challenge.</p><br/><p>\"Hahaha!\" Every other player in the vicinity was laughing and cheering for Zhang Yang. Well, Zhong Xiu Hua was currently infamous for being ‘the prince with sexual-transmitted-disease’. No one in the server did not know that case by now.</p><br/><p>After arriving at Holy City together with his gang, Zhang Yang began to distribute the loots among themselves.</p><br/><p>Isles was considered the final boss of the entire Demonic Invasion. So, he had dropped quite a number of powerful items and equipment upon his death. Other than the 15 pieces of Ascended Tier equipment, there were also 28 pieces of Holy Tier equipment among the loots! There were also many other Skill Books, Skill Point Crystals, Aura Stones, Level 8 Gemstones and Normal Demonix Pearls!</p><br/><p>Other than the Accessory piece on him, Zhang Yang had already collected a full set of Ascended Tier equipment now. Initially, he no longer had much need in acquiring any equipment that the boss drops. However, after distributing the loot for one round, he realized that there was a two-handed sword left without an owner.</p><br/><p>Wei Yan Er and Galileo had already gotten weapons of Ascended Tier from defeating Angus. Meanwhile, the others were not capable of equipping a two-handed weapon. So, Zhang Yang had no choice but to take the two-handed weapon and shove it into his inventory.</p><br/><p>Well, it was not a bad thing either. Zhang Yang could use that weapon to enhance his current one. The axe that he was currently wielding was a Level 200 masterpiece!</p><br/><p>After distributing the loot, it was time to distribute the remaining items, the Skill Point Crystals. Because Zhang Yang just recently learned {Rock Solid}, he would need more Skill Points in order to upgrade that Skill. So, he took one. Including the +3 Skill Points that he has acquired from killing Isles and this Skill Point that he just acquired, he could level his Skill up to level 8 now. After activating the Skill, he now gained 120% additional Defence and 24% Passive Damage Immunity.</p><br/><p>Furthermore, Isles had also dropped two Forbidden Scrolls!</p><br/><p>Both of the Forbidden Scrolls were basically AoE types. One was named ‘Absolute Zero,’ while the other was named ‘Doomsday’s Natural Disaster’. Both had the same effects that reduced 10% HP from all targets in every second for over 30 seconds. The effect would cover an area of a 5-kilometer radius. The minimum damage the effect could cause to each target would be 150,000 damage per second, while the maximum damage would be 300,000 damage. Players would only be able to use the scrolls upon reaching Level 200.</p><br/><p>Well, that two scrolls should be considered as compensations for using the ‘Eclipse’ and the ‘Reaper's Descent’ then. However, Zhang Yang still lost a ‘Stuttering Focus’. Well, it was still worth using the ‘Stuttering Focus’ to exchange for the loots though. Look at Snow Seeker. She had used out one Forbidden Scroll as well. However, she did not get anything in return by the end of the battle.</p><br/><p>Speaking of which, the other players actually did get something in return. Because they had won the battle against the demonic forces, they were spared the penalty of 10% Experience Points Reduction. The players from the entire China Region had actually gained something from claiming victory over the Demonic Invasion as well.</p><br/><p>As for the Skill Books, Zhang Yang managed to win one powerful Skill for himself from rolling, the ‘Sky Slicer’!</p><br/><p>[Sky Slicer]: Consecutively slashes the target, dealing 100% Basic Melee Attack. You will gain 100% additional damage for every second onwards. Lasts for 10 seconds. During this period of time, you cannot use other Skills, or else the {Sky Slicer} will be automatically interrupted.</p><br/><p>Require: Melee Weapon.</p><br/><p>Consume: 100 Rage Points.</p><br/><p>Cooldown: 5 minutes.</p><br/><p>The Skill was basically the same as the boss’ own {Sky Slicer}. The Skill will be easily interrupted if used on a player. It could only serve as a normal attack, in that case. However, if this Skill is used without having any interruptions in-between, the target would be fatally wounded!</p><br/><p>The best targets for players who could use this Skill would be the monsters. Well, 90% of the monsters would not have any Status Restriction Skills. Even if some of them did, the user could just waste away the monsters’ Status Restriction Skills before using {Sky Slicer}!</p><br/><p>Even though 5-minute cooldown was a bit long, the impact and damage that the Skill could bring would make it worthwhile.</p><br/><p>Last but not least, the boss had also dropped 7 [Normal Demonic Pearls]. Each of the pearls could increase the success rate of fusing equipment by 40%!</p><br/><p>After distributing everything among themselves, Zhang Yang dissolved the party and everyone went off to mind their own business for the moment. Well, the second Demonic Invasion would hit the players again, one month from now. So everyone must make good use of the remaining one month to grind and power themselves up. Reaching Level 215 would be the top priority for everyone in the server now! Truth be told, if most of the players have reached Level 215 during the Demonic Invasion event, there would still be approximately 10,000 to 20,000 players remaining when the final boss Isles reveals himself by the end of the tenth wave. The battle would not be as fierce and intense!</p><br/><p>Zhang Yang selected the newly acquired weapon [Frost Destroyer's Blade] in the inventory. He was getting ready to fuse the weapon with his axe, now.</p><br/><p>[Frost Destroyer's Blade] (Ascended, Two-Handed)</p><br/><p>Attack: 47,620 – 67,620</p><br/><p>Attack Interval: 3.8 seconds</p><br/><p>DPS: 15,163</p><br/><p>{Level 8 Socket 1}</p><br/><p>{Level 8 Socket 2}</p><br/><p>Equip: Increases Damage by 50%.</p><br/><p>Equip: Increases Critical Rate by 15%.</p><br/><p>Equip: Upon landing a hit on your target, there is a rate that you can deal 50% Melee Attack of Frost Damage to your target as well.</p><br/><p>Required Level: 240</p><br/><p>Special: Reduces Required Level by 30 levels.</p><br/><p>After putting the [Frost Destroyer's Blade] and the axe that he was currently using into the Tesseract, Zhang Yang immediately received a system notification.</p><br/><p>‘Ding! You’re about to fuse [Frost Destroyer's Blade] and [Agos, The Destroyer’s Blade]. The rate of success for fusing a Sword Type and an Axe Type weapon is lower. There’s an 80% success rate to acquire a Sword Type weapon upon completion. There’s a 60% success rate to acquire an Axe Type weapon upon completion. You can select whether to fuse for a Sword Type weapon or an Axe Type weapon. Do you wish to proceed?’</p><br/><p>Hmm… the success rate for fusing two weapons of different Types would be much lower. However, players could choose the Weapon Type desired. That’s actually very convenient!</p><br/><p>Zhang Yang inserted one [Normal Demonic Pearl,] and he received another system notification in an instance.</p><br/><p>‘You’ve inserted [Normal Demonic Pearl] X 1. The success rate for both fusion types will be 100% and 100%. Do you wish to proceed?’</p><br/><p>‘You’ve chosen to fuse for the Axe-Type weapon, proceed!’</p><br/><p>‘Fusion in progress!’</p><br/><p>...</p><br/><p>‘Ding! You’ve succeeded in acquiring a new equipment: Frost Destroyer's Blade (Upgrade +1)!’</p><br/><p>[Frost Destroyer's Blade (Upgrade +1)] (Ascended, Two-Handed)</p><br/><p>Attack: 53,382 – 73,382</p><br/><p>Attack Interval: 3.8 seconds</p><br/><p>DPS: 16,679</p><br/><p>{Level 8 Socket 1}</p><br/><p>{Level 8 Socket 2}</p><br/><p>Equip: Increases Damage by 50%.</p><br/><p>Equip: Increases Critical Rate by 15%.</p><br/><p>Equip: Upon landing a hit on your target, there is a rate that you can deal 50% Melee Attack of Frost Damage to your target as well.</p><br/><p>Equip: Upon hitting the target with normal attacks, there is a rate that you can deal a damage 8 times stronger than your initial attack.</p><br/><p>Required Level: 240</p><br/><p>Special: Reduces Required Level by 30 levels.</p><br/><p>Unfortunately, if there were any other Ascended Tier axes to spare, Zhang Yang could have used some [Demonic Pearls] to ensure a 100% successful rate in enhancing his axe up to a +4 upgrade. However, the rate of acquiring another 3 two-handed Ascended Tier axes would be much lower than the rate of acquiring one Celestial Tier axe!</p><br/><p>Instead of working on that, it would be wiser for Zhang Yang to focus on getting Celestial Tier equipment! Well, there would be another 6 Demonic Invasions in the upcoming days. Players who manage to recover the main cities would become eligible to challenge the Demon Lord Kenzack, a Celestial Tier boss! If he is lucky, he might even get a chance to acquire a Celestial Tier weapon upon killing Kenzack!</p><br/><p>...</p><br/><p>After the first Demonic Invasion, other than China Region, the main cities of the other 6 Main Regions were conquered by the Demonic Forces! </p><br/><p>Well, it wasn’t really a surprise, though. After all, the players had no prior information about the demonic forces and how powerful they were. If Zhang Yang did not use his ‘Gate of Hell’, the China Region could not have survived the ninth wave of the Demonic Invasion. Even if they could survive the ninth wave, they would be wiped out entirely by the tenth wave of the invasion forces.</p><br/><p>Of course, the players would be able to improve themselves to another level during the coming month. If the levels of the monsters do not change, the number of players affected by the Level Gap Suppression effect of the game would be reduced a lot. So, if they could hold on until the tenth wave, they would have high hopes of winning by the end of the Demonic Invasion!</p><br/>\n</div>"}