{"title": "Chapter 847: Takedown", "id": 847, "volume": 9, "url": "http://boxnovel.org/mmorpg-rebirth-of-the-legendary-guardian-chapter-847-takedown", "volume_title": "Volume 9", "body": "<h1>Chapter 847: Takedown</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 847: Takedown</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>The abundant number of players had clogged up the surroundings of the boss. Players without Flying Mounts were not even able to move freely. They could not even dodge the attacks of the boss. They could only witness themselves getting sucked into the vortexes, and their HP bars getting reduced at an insanely fast pace. Right after they get out of the vortexes, they would have lost over 99% HP!</p><br/><p>The players were from different Regions after all. So when some of them are using Skills such as {Tornado Cleave}, they would accidentally wound the players from different Regions with their attacks as well. As many of them had lost quite a number of HP during the boss battle, they would just die on the spot right after they receive the attacks from the {Dark Vortex}.</p><br/><p>Fortunately, the top Tier players were all equipped with a Flying Mount, at the very least. So, when the vortexes began to swirl across the area, countless players began to fly up into the sky, one after another. At the same time, many of them had also activated their Inheritance Transformations. Obviously, it would take at least 9 days before they could get the boss down to its knees. They could at least use their Inheritance Transformations twice before using the third to snatch loots when the boss battle is finally over.</p><br/><p>Well, it was easy to understand why the players did that in the first place. However, top Tier players like Zhang Yang still did not use their Inheritance Transformations. Why? The reason was simple. Because once players are 300 meters away from the boss, there would be a transparent dome covering the entire area. Whoever who tries to get more than 300 meters from the boss would be instantly killed.</p><br/><p>If the players ever use their Inheritance Transformation now, they would lose more than they could imagine if they ever get rounded up by other players.</p><br/><p>For instance, Hourglass Figure had quite a number of Celestial Tier equipment. If she ever dies and drop her equipment… well… for the other players, a top Tier player from a top Tier guild would be similar to the existence of a Celestial Tier boss. Killing one of them would mean that they would stand a chance to drop Celestial Tier equipment! If the opportunity ever presents itself, why would anyone pass it up, then?</p><br/><p>Therefore, Inheritance Transformations should be reserved for life-saving and warning purposes. Even if the top Tier players are surrounded by those greedy bastards, they could still fight back and slaughter them up by using their Inheritance Transformations as one of the last resorts.</p><br/><p>Well, normal Tier players could only deal 1 forced damage to the boss. Therefore, 95% of the total firepower came from most of the players who had reached Level 230 and beyond. In other words, most of the attacks came from the players from top Tier guilds. So when some of them entered their Transformed forms, their attacks became even more powerful.</p><br/><p>Unfortunately, Inheritance Transformations would only last for 2 hours.</p><br/><p>When the duration for their Inheritance Transformations came to an end, the HP of the boss had only dropped to 97.2%. They were still very, very far from taking out the boss!</p><br/><p>Zhang Yang’s movements have become a fixed pattern. He only needed to repeat the movements like a robot to activate his high-damage Skills at the boss. Whichever Skills come available, he only needed to spam them on the boss. There was nothing else for him to think! Well, it was because there were no Status Restriction Skills at all. As long as Zhang Yang remains first on the boss’s aggro list, it wouldn’t hurt much at all for him to waste some potential damage output by spamming Skills like there is no tomorrow.</p><br/><p>The players had started with battle cries and roars. However, they had simmered down now. By the end of it, they had totally stopped with all the shouting and screaming. Even Fatty Han and Endless Starlight were too tired to even tease the ladies. Everyone was just dealing damage to the boss in silence.</p><br/><p>Truth be told, the boss was not difficult to handle at all. However, the long duration required for the players to take down Maya had made this the worst and most difficult boss battle in history.</p><br/><p>Currently, the players had Zhang Yang keeping the boss occupied, kiting the boss around. However, the boss’s {Dark Vortex} and {Lost Control} could still pose quite a threat to the players in the surroundings. Many players had fallen because of that. For the next three days, those who already reported themselves at the graveyard would not be able to join back into the battle. However, the number of players were just too abundant! For every 10 deaths, 100 fresh players would rush in! The only concern was that they could not deal much damage to the boss. Well, each player with a full set of Holy Tier equipment could only deal thousands of damage to the boss.</p><br/><p>4 hours, 5 hours... 10 hours... 20 hours!</p><br/><p>Zhang Yang could no longer keep up with the pace. He quickly sent Sun Xin Yu a message and used his {Shadow of the Void} right after. Then, he immediately went offline and took off his game helmet.</p><br/><p>Right after he took off his game helmet, he ran straight to the kitchen. It was currently 7p.m. It was about time to have dinner now.</p><br/><p>Ever since Luo Yu Rou was pregnant, Zhang Yang had hired a chef to make meals rich with Chinese herbs and medicine for her. Well, because Wei Yan Er stole some of the meals and it became her habit of doing so, everyone had changed their diet and were used to taking herbal meals by now. At first, the chef did not agree to cook for them. She had only promised to do it for short term. To keep working for them, Zhang Yang had no choice but to offer her a greater deal of money. He even bought a villa for the chef and her family. After settling the worries of her family, the chef decided to continue cooking for them.</p><br/><p>Well, this chef is a really good cook! If the dishes she made were to be compared to the dishes in a five-star restaurant, anyone would believe that the money Zhang Yang spent was well spent! Furthermore, the purpose of Zhang Yang earning more money was to live a luxurious life. What’s the use of keeping all the money to himself, then? Why would he want to take the money with him into his own coffin?</p><br/><p>Although Luo Yu Rou did not really ‘play’‘God’s Miracle’, she had been spending quite a lot of time in the game as well. Well, one of the main reasons was because she wanted to focus on completing her second ‘product’. Well, the game did provide her a time that was three times longer in the game that she could get in the real life. Furthermore, she has the experience of making a movie before. Therefore, she was currently very near to completing her second movie.</p><br/><p>Zhang Yang, Wei Yan Er and the others were also a small part of the movie. Well, they had cameo’d in the movie for a bit. The little brat actually had more screen time than the other members of the gang, though. Furthermore, Luo Yu Rou somehow gave the little brat quite an important role as well. So now, everything would depend on whether the audiences would buy it or not. If the audience could accept it, Luo Yu Rou would be able to create a second miracle in the box office!</p><br/><p>After filling up their stomachs and after a moment of rest, everyone logged back into the game.</p><br/><p>Actually, it is quite dangerous for any player in the server to go offline while in the middle of a boss battle, or any other battle for that matter! Well, that was because if they log back into the game 300 meters from the boss, they would just die on the spot!</p><br/><p>Fortunately, the Tankers from the Hell Family, Land of Savages and other top Tier guilds had taken over the role of tanking the boss for the moment. Everyone was facing the similar situation now. They needed to get offline to eat and handle their personal ‘issues’. If anyone was stupid enough to try something funny on the other players, they would have to face the wrath of many others.</p><br/><p>Therefore, even though the boss would run around whenever its {Lost Control} is triggered, it would not take long before the boss is pulled back to its initial position by the Tankers.</p><br/><p>The moment when Zhang Yang logged back into the game, he immediately summoned his Phoenix pet and Felice. Then, the three of them charged right at the boss and gave everything they got on the boss. Well, he could not afford to hold back, now. After all, if he gets too little aggro, he might receive the boss’ {Devour} and die immediately.</p><br/><p>Zhang Yang would fail a little at getting the aggro of the boss once in a while. So, he unequipped his shield to maximize his damage output.</p><br/><p>Other than the boss’s {Dark Votex} and {Explosive Blow}, {Devour} was also considered one of the boss’ ultimate Skill. Whoever who gets targeted will die. There was no other way out of it. Many players who did not know how the Skill actually worked would die horrific deaths and opt to resurrect at the graveyard.</p><br/><p>Although it had been quite some time, the boss still had over 92% HP. It seemed it would still take ages before they can take down the boss…</p><br/><p>One day, two days, three days... eight days, nine days!</p><br/><p>The players were taking turns to rest during the boss battle. However, when the ninth day ended, the boss’ HP bar finally dropped to 5%!</p><br/><p>Well, that was a record that would make everyone who participated in the boss battle cry. It took a full 9 days for all of them to remove 95% of the boss’s HP! What kind of sick joke is that?! The worst part about it was that all of Zhang Yang’s attempts of casting the {Glare of the Death God} on the boss had been resisted! Or else, each successful attempt of the Skill could have saved over half a day for them! That could have made a lot more difference!</p><br/><p>Finally, the boss battle seemed to be coming to an end now!</p><br/><p>At first, everyone was numbed by the 9 day repetition. However, when they noticed that the boss battle was about to come to an end, their morale increased, instantly. Even though they knew that it would still take about 10 hours to deplete the last 5% HP of the boss, at least they were very near the end, now!</p><br/><p>4%, 3%, 2%, 1%!</p><br/><p>The remaining HP of Maya had dropped to 1,000,000,000 HP! </p><br/><p>That was the moment they’ve been waiting for. Every single one of the top Tier players activated their Inheritance Transformations at the same time!</p><br/><p>{Charge Up Strike}! {Sky Slicer}!</p><br/><p>‘-5,006,922!’‘-10,013,844!’...‘-50,069,220!’</p><br/><p>Zhang Yang began to use his combo-10 axe attacks. The damage each strike increased from approximately 5,000,000 to 50,000,000 damage!</p><br/><p>Zhang Yang’s assaults were so powerful that it made the boss’s Defence seemed useless! He managed to deal a total of 275,000,000 Physical Damage to the boss within merely 10 seconds! With the 10% additional damage that the {Holy Aura} bestowed on him for the moment, his total damage dealt on the boss had reached over 300,000,000 damage!</p><br/><p>Sun Xin Yu, Hourglass Figure, and the others had also given their best shot. They threw out their most powerful attacks on the boss in an attempt to kill the boss before the boss could use its {Devour} again!</p><br/><p>600,000,000! 500,000,000! 400,000,000! 300,000,000!</p><br/><p>After the top Tier players activated their Inheritance Transformations, their Attack power had increased tremendously. They were also spamming their Skills with very long cooldowns, increasing their DPS to another whole new level!</p><br/><p>200,000,000! 100,000,000! 50,000,000! 10,000,000!</p><br/><p>17 seconds later, it was obvious that the boss would not be able to use its {Devour} again in time to heal!</p><br/><p>5,000,000!</p><br/><p>2,000,000!</p><br/><p>1,000,000!</p><br/><p>\"No! No! NO!\" The boss kept roaring in rage until its last drop of HP was gone. After that, the boss collapsed to the ground heavily, and dropped a substantial amount of loot!</p><br/><p>Everyone immediately turned hostile against each other and began to snatch as much loot as they could!</p><br/><p>It was time for everyone to outshine each other, in order to get as many stuff as they could!</p><br/><p>Zhang Yang took an [Advanced Mobility Potion (Transmutation Grade 6)] and which immunized him from any form of Status Restriction Effects for 20 seconds.</p><br/><p>{Blast Wave}!</p><br/><p>Zhang Yang smashed the ground with his axe and created a conical area of shockwave, out front. The shockwave stunned all of the players within the effective area immediately. After that, he took the opportunity to snatch as many loot as he could.</p><br/><p>At the same instant, Sun Xin Yu, Hourglass Figure, God’s Left Hand and the others began to use the same tactic like Zhang Yang. They were restricting the others around them while attempting to avoid being affected by any other Status Restriction Effects. Then, they quickly picked up as many stuff as they could. From that moment onward, the entire place was very merry. All sorts of Skills could be seen flashing across the battlefield at every moment!</p><br/><p>How many players were left on the battlefield after the boss died? Well, there were over tens of millions of players remaining in the vicinity at the moment, for sure. Although it wouldn’t be possible for them to gush into the same spot at the same instance, there were also quite a number of players who had Flying Mounts. If each of them used only one Status Restriction Skill at the same time, the entire situation would become chaotic!</p><br/><p>Snatch! Snatch! Snatch!</p><br/><p>Zhang Yang reached out with both hands like an old gambler in a casino! Shoof! Shoof! Shoof! Instantly, 3 new equipment had appeared in his inventory!</p><br/><p>Although the boss’ loot were numerous, they were cleared out of the ground in one brief instance. There were just too many players around to pick them up! In just 3 seconds, the entire ground became empty!</p><br/><p>\"Kill!\"</p><br/><p>It was still good for those who managed to pick up something. However, for those who got nothing after ten days of restless battling, of course, they were not willing leave the place empty handed! They raised up their weapons and started attacking the others indiscriminately.</p><br/><p>A chaotic battle had erupted!</p><br/><p>Zhang Yang and the gang would not waste their time participating in such a messy battle, of course. So they flew into the air to get themselves out of the messy battlefield. After flying far away from the battlefield, they took out their Teleportation Scrolls and traveled back to Holy City.</p><br/><p>It was time to distribute the loots!</p><br/><p>\"Wahaha! Noob Tank, I’ve managed to get two equipment!\"</p><br/><p>\"I have three, yo!\" Han Ying Xue smacked the little brat’s head.</p><br/><p>After making a number count on the equipment everyone got, there was a total of 14 equipment. Among the 7 Celestial Tier equipment, 5 of them were actually Armor Set pieces while the other 2 were just spare parts. The other 7 among the 14 were just Ascended Tier equipment. Other than that, there were also a few pieces of [Greater Demonic Pearls], some Skill Books and other negligible items.</p><br/>\n</div>"}