{"title": "Chapter 854: Battle!", "id": 854, "volume": 9, "url": "http://boxnovel.org/mmorpg-rebirth-of-the-legendary-guardian-chapter-854-battle", "volume_title": "Volume 9", "body": "<h1>Chapter 854: Battle!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 854: Battle!</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>\"That’s unbelievable! A Guardian has 20% Passive Damage Immunity. Zhang Yang’s full Celestial Tier Armor set has a 20% Passive Damage Immunity. His shield has a 20% Passive Damage Immunity. Furthermore, his {Rock Solid} also bestows him with a 30% Passive Damage Immunity. So Zhan Yu’s Passive Damage Immunity has reached over 100%! Any attack will be nullified by the Passive Damage Immunity on him! That’s really unbelievable! Oh my god! No wonder Zhan Yu decided to take all 5 of his opponents at once! I can’t believe that his Defence has become so insanely horrifying!\"</p><br/><p>\"No no no, Jack… You’ve overestimated Zhan Yu. This 100% Passive Damage Immunity is just temporary. His {God of War Shield} only lasts for 10 minutes. Meanwhile, his {Rock Solid} only lasts for 10 seconds. Therefore, Zhan Yu has to end the battle within 10 minutes, or his Defence will go back to normal!\"</p><br/><p>\"But, he will still have 70% Passive Damage Immunity for those 10 minutes, right? That’s still a terrifying value for a Defence, don’t you think? Also, not only does Zhan Yu have a terrifyingly high Defence, his Attack power is also incredibly high!\"</p><br/><p>\"That’s right. According to the data shown, Zhan Yu’s basic attacks can range from 1,730,000 to 1,910,000 damage upon activating his {God of War Transformation}. His Critical Rate will reach up to 27%. His {Lucky Strike} will reach up to 3.5%! Meanwhile, his HP will reach over 343,160,000 HP! Also, his Defence shoots up to 280,000! Holy mama god! How can a player have such stats in the game?!\"</p><br/><p>The 3 commentators were speaking until their saliva drooled all over the place. Well, they were the officials. Of course, they would be capable of checking on the attributes and Skills of any player. Also, their voices were only heard by the audiences. The 6 contestants inside the arena would not be hearing those noisy commentators babbling about with their own theories, anyway.</p><br/><p>\"So let us make some comparison then. On the Steely Dang Battle Team, the player with highest HP is God’s Left hand. However, he only has approximately 180,000,000 HP. Well, he’s also a Tanker. However, because his equipment and his Aura Skill are weaker, the differences between the amount of HP amounts on both sides are huge.\"</p><br/><p>\"Meanwhile, the other two players who have activated their Class S Inheritance are considered less durable than both of them. Look at Hourglass Figure. Her Basic Attack range only from 1,220,000 to 1,400,000 damage. In other words, her Attack power is 30% weaker than Zhang Yang’s. Holy mama god! How can there be such a huge difference!?\"</p><br/><p>\"Well, we can’t just compare the attributes of a Spell Type player to the attributes of a Melee Type player. Let’s take another more specific example then. Heart of Destruction’s Magic Attack is approximately 100,000 points. That being said, his 200% Magic Attack could deal approximately 1,640,000 damage!\"</p><br/><p>\"However, everyone, don’t forget that Zhan Yu still has one powerful pet and one powerful Battle Companion. Those two can also activate Transformation Skills! Let us provide you with some information about those two, then!\"</p><br/><p>\"So let’s look at the Phoenix pet first. Upon activating its Transformation Skill, the Phoenix pet will have over 210,000,000 HP! Holy mama god, Bruce! Are my eyes still working? That’s even higher than the HP of God’s Left Hand!\"</p><br/><p>\"My brother, your eyes are definitely looking at the correct figures! Because Zhan Yu’s Phoenix pet is indeed a Legendary Tier pet. Meanwhile, Zhan Yu also has the Skill {Beast Taming}. He can ride on his pet mount in an indoor environment. Meanwhile, the Attack power of the Legendary Tier pet… holy god… it’s ranging from 1,360,000 damage and 1,660,000 damage! That’s even more powerful than the Attack power of Hourglass Figure!\"</p><br/><p>\"Well, let us look at Zhan Yu’s Battle Companion, Felice! That Battle Companion has over 15 stars of attribute growth! She’s a walking Celestial Tier Boss! Oh my god! She now has over 630,000,000 HP and her basic Attack power ranges from 2,640,000 to 3,000,000 damage!\"</p><br/><p>\"That’s totally insane! These two are basically having the same amount of HP and Attack power of two players with Class S Inheritance! No, the HP and Attack power of Felice has exceeded any player in the current game!\"</p><br/><p>\"Everyone, we first thought that this would be an unfair battle. But now, we have to change our view towards this battle!\"</p><br/><p>\"That’s right! This should be a battle that’s full of suspense!\"</p><br/><p>\"Even though Steely Dang Battle Team has the upper hand in the battle, but they have a glaring weakness. They have not actually cooperated before after all this time. Zhan Yu might use that to his advantage and give them all a good surprise!\"</p><br/><p>\"So everyone, open up your eyes and witness this great battle! This is going to be a battle that will be remembered for centuries!\"</p><br/><p>Well, the Chinese used to say, injuring all of a man's fingers is not as effective as chopping off one. So Zhang Yang decided to focus all his attacks on Captain America. Captain America was afflicted with the effect of {Destructive Smash}. His healing efficiency had been greatly reduced because of that. So it would be wise to target him and take him out first!</p><br/><p>Upon taking a [Mobility Potion], Zhang Yang could ignore any form of Status Restriction Effects for the next 20 seconds. So, he could deal as much damage as he could during that period of time.</p><br/><p>Phoenix pet spat out a stream of blazing flames. As the flames scorched across the ground, the five of them were forced to stay away from each other so that they would not get burned to death at the same spot! The Legendary Tier pet’s DPS had reached over 2,100,000 damage. If one is burned too many times by staying on the same spot, that player would have to receive a devastating amount of damage.</p><br/><p>After Felice unsealed her fourth seal, the star growth for all of her attributes had reached 15 stars. There, she finally acquired her strongest Humanoid Form Transformation Skill!</p><br/><p>[Goddess of War Scion Form]: Upon entering the ‘Goddess of War Scion Form’, Felice’s damage dealt will increase by 500%. Furthermore, her damage dealt will be Chaos Damage. Felice’s Defence will increase by 500%. Felice’s HP will be multiplied by 40 times. She’ll have immunity to all Status Restriction Effects. In her ‘Goddess of War Scion Form’, she can use all her Skills of her Humanoid Form. Last for 2 hours. Cooldown: 72 hours. Upon entering her ‘Goddess of War Scion Form’, her Dragonhawk Form, Spectral Tiger Form and Tree of Life form will all enter the state of cooldown at the same time.</p><br/><p>Well, Felice was really a pain in the *sses for all of them, especially her ability to be immune to all Status Restriction Effects! Well, that dragon lady had a HP bar that was far beyond Zhang Yang’s. Furthermore, she was totally immune to any form of Status Restriction Effects! In other words, the others could only leave her be and let her attack them! However, each of Felice’s attacks could deal approximately 2,800,000 damage! If she just unleashes a few Skills as she attacks, her DPS could become as strong as Zhang Yang’s DPS!</p><br/><p>Well, Zhang Yang would never give a sh*t about those detailsss. With Phoenix pet tagging along with him, the two of them unleashed everything they’ve got on Captain America. Their main intention was to deal as much damage as they could to Captain America. Because Captain America was afflicted with the effect of {Destructive Smash}, God’s Left Hand was not capable of healing Captain America back up. God’s Left Hand can only witness the rapid reduction on Captain America’s HP bar.</p><br/><p>Meanwhile, Hourglass Figure and the others were targeting Zhang Yang from the sidelines.</p><br/><p>Unlike the real 5VS5 matches, it would not matter much, even though Phoenix pet and Felice were extremely powerful. They were merely ‘followers’ of Zhang Yang. As long as Zhang Yang is killed, the both of them would vanish! Well, Zhang Yang’s {Rock Solid} was about to expire. However, Zhang Yang would still have over 70% Passive Damage Immunity and 280,000 Defence power. The amount of effective damage they could deal on Zhang Yang was approximately 400,000 damage only. They would still need approximately 3 minutes to deplete Zhang Yang’s entire HP bar. Well, Captain America would have died a couple of times during that period of time!</p><br/><p>Captain America quickly activated an Accessory and went into a state of invincibility.</p><br/><p>Zhang Yang immediately switched over to attack another player. His next target was God’s Left Hand! Well, he did not intend to deal much damage on God’s Left Hand. His real intention was to disrupt God’s Left Hand from healing Captain America up as much as he could!</p><br/><p>Everyone was dealing as much damage as they could to their respective targets. Unfortunately, Zhang Yang’s Defence was overwhelmingly high. It was considered a good outcome for Hourglass Figure and the others to deal 20% of their damage on Zhang Yang!</p><br/><p>{Brute Smash}! {Blast Wave}! {Heroic Leap}!</p><br/><p>Zhang consecutively used three of his Status Restriction Skills on God’s Left Hand and had him restrained for over 109 seconds. God’s Left Hand was not able to heal Captain America at all during that period of time. Because the effect of {Destructive Smash} on Captain America had vanished, Zhang Yang could now deal 100% damage to him.</p><br/><p>The moment the 10-second invincibility effect had ended, Zhang Yang immediately activated his {Charge} and clashed into Captain America. Right after that, he began to poke Captain America as hard as he could.</p><br/><p> However, that moment was also the moment Zhang Yang’s [Mobility Potion] wore off. So, Hourglass Figure and the others quickly took the opportunity to throw their Status Restriction Skills onto Zhang Yang. As long as they could restrain Zhang Yang’s movements, not only could they deal a tremendous amount of damage to Zhang Yang, they could also have spare time to heal themselves. Well, they did have the advantage in numbers.</p><br/><p>Unfortunately for them, they had never actually practiced together in a battle. So it could not be helped that they would accidentally stack their Status Restriction Skills altogether on Zhang Yang at times. Because of that, some of their Status Restriction Skills went to waste, because their effects would not stack.</p><br/><p>{Warrior’s Will}!</p><br/><p>{Destructive Smash}!</p><br/><p>After using {Warrior’s Will}, the {Destructive Smash} would be a guaranteed Critical Hit. Not only did it deal quite a number on Captain America, the attack had also afflicted Captain America with 75% reduction to his Healing Efficiency.</p><br/><p>Felice’s DPS had reached over 2,000,000 damage, while Phoenix pet could also deal over 1,000,000 damage in each passing second. So, these two could easily take out Captain America within 40 seconds. Also, Zhang Yang had an even higher Attack power than the two of them! When Zhang Yang still had approximately 83% HP remaining on him, Captain America’s HP bar had dropped to 20% only!</p><br/><p>Without having any choice left, Captain America was forced to use his {Warrior’s Will} to disable to effects he got from {Destructive Smash}. Right after that, he activated his ultimate life-saving Skill to instantly recover 50% of his HP bar. Then, he recovered another 50% of his HP in the next 5 seconds.</p><br/><p>Captain America is quite a skilled player indeed. He waited for Zhang Yang to smack him with {Destructive Smash} first, before using his {Warrior’s Will}. Because of that, Zhang Yang had to wait for another 8 seconds before he could use another {Destructive Smash} to maintain the Healing Efficiency Reduction Effect on Captain America. There, Captain America managed to gain a little time to make sure that his 50% Healing amount is not affected at all.</p><br/><p>\"Nicely done!\"</p><br/><p>The three hosts were beginning to speak in high voices again.</p><br/><p>However, Captain America was a little disappointed with himself at the moment. Well, he was forced to use his ultimate life-saving Skills in less than 30 seconds! He had never felt so humiliated in all his life. However, he was currently facing Zhang Yang, the best of the best among all Regions in the game!</p><br/><p>Zhang Yang laughed out loud and said, \"Let’s see how you keep this up!\"</p><br/><p>\"Zhan Yu, you better don’t get too cocky!\" Hourglass Figure and the others scolded and cursed at Zhang Yang.</p><br/><p>God’s Left Hand activated his {Vanguard’s Aggression} and covered his teammates in a bluish barrier in the shape of a dome. By doing so, the damage that his teammates received were all reduced by 90%. Of course, the damage that he would be receiving would increase by 100%! Instantly, the five of them had become one party for the moment.</p><br/><p>Zhang Yang had no choice but to switch his targets again. By using his {Blast Wave}, he stunned all five of his opponents, closely followed by activating his {Charge Up Strike} and {Sky Slicer}! That was the most deadly Skill-combination he had at the moment!</p><br/><p>The five of them were so shocked to see that. With God’s Left Hand’s current Defence, 10 hits from {Sky Slicer} might not be able to kill him just yet. However, now that God’s Left Hand had activated his {Vanguard’s Aggression}, he would be receiving more damage than before whenever he was attacked. In other words, he had lost all of his Defence power for the moment. So how would he survive Zhang Yang’s onslaught then?</p><br/><p>Without further ado, they began to activate all of their Anti-Status Restriction Skills one after another to disable the Stun Effect Zhang Yang ‘bestowed’ upon them with his {Blast Wave}. The moment they recovered from stun effect, they began to activate their Status Restriction Skills on Zhang Yang.</p><br/><p>Meanwhile, God’s Left Hand was shocked into activating his {Ancient Defender’s Shield}. It was a Skill similar to {Shield Wall}.</p><br/><p>Zhang Yang was instantly stunned!</p><br/><p>However, the usage of that many Skills had managed to force Zhang Yang into using his most powerful Skill of all. It was a good trade!</p><br/><p>\"Haha! Your Status Restriction Skills are all used up! It’s our turn to strike!\" Captain America and God’s Left Hand cried out loud in joy almost at the same instant.</p><br/><p>Meanwhile, Hourglass Figure and the others also took the opportunity to activate their strongest Skills in an attempt to aid Captain America and God’s Left Hand at killing Zhang Yang instantly!</p><br/>\n</div>"}