{"title": "Chapter 8: The Cat is Out of the Bag?", "id": 8, "volume": 1, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-8-the-cat-is-out-of-the-bag", "volume_title": "Volume 1", "body": "<h1>Chapter 8: The Cat is Out of the Bag?</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 8: The Cat is Out of the Bag?</p><br/><p>Translator: J_Squared Editor: J_Squared</p><br/><p>Half an hour after Annie was turned into dust.</p><br/><p>On the other side of the night sky, Kubei’s situation was not any better than Annie’s.</p><br/><p>\"You were willing to harm your partners just to lie to me?\"</p><br/><p>It wasn’t that Kubei’s sense of justice flared up all in a sudden and that felt sorry for Annie. It was just the fact that aside from criticising Michelle from a moral high ground, he really had no idea what he could say.</p><br/><p>However, he must continue talking. To shut up now will have no difference from sitting around and waiting for death to arrive. After all, he was still in a ‘negotiation’ with Michelle, although the direction of the negotiation was opposite of what was originally planned by Kubei.</p><br/><p>Still, this was his last shot for survival.</p><br/><p>\"Why is that a problem?\" Michelle’s attitude also began to become aggressive. \"Sir Lithur, I seemed to have treated you too well for our continued partnership. However, you seemed to have taken it as an invitation to converse with me at your whim.\"</p><br/><p>Well my ass.</p><br/><p>Kubei felt immense pressure. It was obvious that Michelle was ready to stop the goody-two-shoes act and end the negotiations soon. This was not good news for Kubei.</p><br/><p>Whether it was for his survival or just to delay his death, Michelle must continue talking.</p><br/><p>Thus, he tried to be stern: \"Lady Michelle, you depend wholly on me to open the treasury. I can also change my mind at any minute. Do not forget, I wield the power to stop you from getting whatever you want forever.\"</p><br/><p>However, Michelle’s answer came faster than he expected, \"Oh, do not rush, my good sir. I will treat you well with my leather whip, and I believe in no time you will know what decision you will make by the door.\"</p><br/><p>\"….\"</p><br/><p>Kubei must admit that these softly-spoken threats sounded much scarier than the ones that were made in a frightening manner.</p><br/><p>The message behind the tone was: ‘I can see through whatever you’re planning, and no matter how hard you try, you will never escape my grasp.’</p><br/><p>Belittlement! This was a complete belittlement!</p><br/><p>Michelle took a black whip out of her sleeve when Kubei gave no response. She dangled the whip in front of Kubei, and it shone like oil under the gaze of the moonlight.</p><br/><p>\"Like what you see?\" She asked.</p><br/><p>'[email protected][email protected] you', Kubei cursed in his head.</p><br/><p>Michelle tugged the whip, and Kubei put a smile on his face immediately.</p><br/><p>\"I hope we work well together!\"</p><br/><p>\"I hope we work well together,\" Michelle nodded as she slowly tucked the whip away.</p><br/><p>Kubei felt very frustrated.</p><br/><p>In hindsight, he would fall for Michelle’s lies because he had just teleported into this world, and had no prior knowledge about anything. He was like a farmer who just arrived in a city, and even a 3-year-old child would be able to trick him.</p><br/><p>Fuck this teleportation. The main characters from other novels all have the memories of their predecessors, so why did he not get anything?</p><br/><p>If he knew there were no troops in the beginning, if he knew more things...</p><br/><p>Everything would be different.</p><br/><p>\"Cleaners, a special troop of holy knights from the church to take care of the heathens,\" the System popped up and explained, \"the selection for Cleaners are very strict. Only 2 out of 2000 holy knights who participate would be selected to be a Cleaner. Apparently, every cleaner will be baptised by the Pope and they possess unusual strength. Once they gather, they would become even more terrifying.\"</p><br/><p>\"What the hell? Can you not appear out of the blue at this crucial moment and frighten me?\" Kubei said angrily in his mind.</p><br/><p>\"This is the description for the Cleaners.\" The System did not detect Kubei’s anger and it still spoke with an annoying tone.</p><br/><p>\"You…\" Kubei wanted to say something, but was cut off by a thought, \"Wait, where did the information come from?\"</p><br/><p>\"I don’t know, it suddenly appeared in the database,\" the System replied.</p><br/><p>\"Is there anything else? Give me something useful, something about mages! How do the mages in this world learn magic?\"</p><br/><p>Kubei’s heart was once again set aflame with hope. Description! Information! Although he had no idea if the System had an upgrade or if there was a bug that caused it to obtain these information, but that was exactly what he lacked the most. Due to this damned teleportation, he knew close to nothing about the world he was currently in.</p><br/><p>He needed information about mages.</p><br/><p>He needed to master the Binding Spell, as it was the only way that he could get out of this alive.</p><br/><p>\"There was nothing else, aside from the really terrible speech you wrote, the only thing in the database was this.\"</p><br/><p>Kubei was very irritated, \"I have no time and heart to joke around with you now. Give me something useful! We are on the same boat here, you could only exist if I didn’t die. If I can’t master the Binding Spell, we will all be fucked.\"</p><br/><p>\"Nothing is nothing, the System never jokes around.\"</p><br/><p>\"….\" Kubei was unsure whether he should continue asking about the first part of the sentence, or spite the second half of the sentence.</p><br/><p>Still, he refused to give up, \"For real, you have nothing else?\"</p><br/><p>\"I really have nothing else.\"</p><br/><p>\"Really? You really have nothing else?\"</p><br/><p>A burst of static came from the System, and a half transparent numerical platform appeared in front of Kubei, \"If you need human assistance, please press 0.\"</p><br/><p>\"…\"</p><br/><p>Kubei finally dropped the idea. He should rely on himself now.</p><br/><p>That’s right, Kubei was nowhere near giving up on hope. The situation was stagnant, and if he was in another novel, there would already be a miracle or a saviour from the heavens who would save him. However, life is never a novel, and most of the time, being backed to a corner does not lead to a huge leap in the future, but a queue to the heavens and a farewell to your life.</p><br/><p>Furthermore, if he was really in a novel, the author must have hated his guts to give him these experiences.</p><br/><p>But….</p><br/><p>From the moment Michelle’s attitude got a turn to the worse, Kubei felt that something was off. He had no idea where this feeling came from, but his instincts screamed at him that something was wrong, and Michelle was hiding things from him.</p><br/><p>\"What would it be?\"</p><br/><p>Under the immense pressure of death, Kubei felt the hope of survival again, just like the feeling of a breeze in a sealed cave.</p><br/><p>He will follow the breeze and grab it.</p><br/><p>He focused his attention on reality. They were still on the tree, and Michelle showed no sign of moving. It seemed like she was afraid of getting caught by the Cleaners, and was waiting for them to move further away from their vicinity.</p><br/><p>The Cleaners….</p><br/><p>Michelle seemed to dread their presence, and since the system gave him quite a lot of information about them, he might as well just try to use that as a breakthrough. Even though he could not get updates from the system, the least he could do was to test it out on Michelle.</p><br/><p>He considered and then said, \"They didn’t come for Annie. They came for you.\"</p><br/><p>Michelle remained cold towards him, \"Nobles who talk too much usually do not live long.\"</p><br/><p>He didn’t know if he could survive after talking too much, but he knew if he talked too little, he definitely could not live.</p><br/><p>Kubei never wanted to be a chatty person, but God left him no choice.</p><br/><p>\"Cleaners, they are the holy knights whom the church utilizes to deal with people like you. Presently, there are only a few Cleaners of the church, and all of them are holy knights with loads of battle experiences. You’ve had more than 10 cleaners come after you, which means you must have gotten the church’s attention.\"</p><br/><p>Kubei deliberately spoke slowly, hoping to elicit some response from Michelle using the information he got from the System.</p><br/><p>Michelle did not react.</p><br/><p>Kubei was not discouraged by the lack of response as he continued, \"Do you really think you could open the treasury with the church watching? The treasury of every family will be guarded by many, even if you could eliminate them without causing any commotion, it will still be near impossible to not alert the Cleaners. They are still around the area, and they will find out about this.\"</p><br/><p>His tone was calm, but in his heart, he was as anxious as if he was on fire.</p><br/><p>Please…. Please…. Give me some reaction!</p><br/><p>He felt like he was taking a Politics examination, when he blabbered things that he did not even understand, but he hoped that maybe one of his sentences would hit the nail on its head, and break open this corner that he was backed to. He was making things up until his brain juices were almost dry.</p><br/><p>Luckily, Michelle finally moved.</p><br/><p>She turned around and looked at Kubei. That was the first time Kubei saw Michelle’s face. Under the faint moonlight, the cape had a wide coverage, and her face was still enveloped in shadows. However, her pale golden eyes were as bright as an owl’s, and it was piercing beyond belief.</p><br/><p>It was an animal’s gaze, sharp without warmth, and Kubei had goosebumps from just looking at it.</p><br/><p>\"Who are you?\"</p><br/><p>\"What?\" Kubei could not react in time.</p><br/><p>\"You are not Grant Lithur. Who are you? When did you switch him away? Where is he?\" In a flash, Michelle took out the dagger and placed it on Kubei’s throat, her tone of voice demanding.</p><br/><p>\"I don’t understand what you’re saying,\" Kubei’s heart skipped a beat, and he had a bad premonition.</p><br/><p>Michelle’s eyes were merciless and cold like a leopard’s. \"Stop acting dumb. The Cleaners move in groups of 14, and you act like you don’t know it. That was fine, but when you said there will be guards by the treasury, that was too much. The Lithur family pride themselves on the secrecy of the location of the treasury and the complicated method of opening it, so they will never set guards outside the treasury. If you are from the Lithur family, it is impossible for you to not know that.\"</p><br/><p>She paused, then said with emphasis, \"Who are you?\"</p><br/><p>Kubei’s palm was full of cold sweat.</p><br/><p>He went too far now, he went way off track. Politics examinations were way better than this, at least there was no penalty for saying the wrong things.</p><br/><p>He never was Grant Lithur, he was Kubei, a teleporter with a terrible luck. He had no idea what the heck was the Lithur family, much less the way to open the treasury. He knew nothing.</p><br/><p>Once Michelle found out about this, he would be of no use to her. She would kill him.</p><br/><p>\"The ultimate-unrivalled artificial intelligence System, save me!\" Kubei shouted internally.</p><br/><p>\"Shutting down, dun-dun-dun-dun.\"</p><br/><p>\"Fuck you!\"</p><br/><p>In the real world, Kubei’s thoughts were not exposed because he had no expressions or actions since he was stunned by Michelle’s sudden movement. Kubei went along with his poker face, feigning calmness as he said, \"I am Grant Lithur.\"</p><br/><p>Michelle’s eyes were like scalpels, waiting to dissect Kubei and take out his organs to inspect them down to his cells.</p><br/><p>His life was on the line now. He forced himself to remain composed as he held eye contact with Michelle.</p><br/><p>It was like he was back to grade school when his grade teacher would question him, \"Did you finish your homework?\" He would answer, \"Yes, I did, but I forgot to bring it to school,\" and she would ask him again, \"Are you lying?\" in which he would reply, \"No, I’m not lying!\"</p><br/><p>Luckily, he did not do his homework very often. That training allowed him to hold up under such an intimidating gaze.</p><br/><p>It was as if a lifetime has passed, even Kubei felt slightly hungry.</p><br/><p>Suddenly, Michelle retracted her dagger, and stopped her intimidation tactics. Once again, she perched on the branch and became as still as a statue.</p><br/><p>What the hell is going on? Kubei was still immersed in his perfect \"I forgot to bring my homework\" face, and he could not react.</p><br/><p>He felt dull.</p><br/><p>\"Give up already, I will not fall for your tricks,\" Michelle told him.</p><br/><p>What the hell…. For a moment, Kubei felt like he skipped a chapter when he was reading a novel and could not catch up with the plot. Give up? Fall for my tricks? What did he do that he did not even realize he did?</p><br/><p>He had no idea what reaction he should give.</p><br/><p>Of course, he would never show his confusion. After a good pondering, he thought of a way that he could try things out without showing his hand, which was to repeat the last thing he said, and wait for Michelle’s reaction.</p><br/><p>\"I am Grant Lithur.\"</p><br/><p>Michelle seemed to be annoyed, \"Shut up with your nonsense!\"</p><br/><p>Kubei stared at the unmoving shadow of Michelle, and replayed the previous encounter. Michelle’s weird demeanor, his unreasonable sense of hope amidst the despair…. That peculiar feeling of something being off was as prominent as a strand of white hair among black hairs, taunting him to pluck it out.</p><br/><p>Abruptly, an idea appeared in his mind.</p><br/><p>\"I am not Grant Lithur.\"</p><br/>\n</div>"}