{"title": "Chapter 7: Annie’s Death", "id": 7, "volume": 1, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-7-annie%E2%80%99s-death", "volume_title": "Volume 1", "body": "<h1>Chapter 7: Annie’s Death</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 7: Annie’s Death</p><br/><p>Translator: J_Squared Editor: J_Squared</p><br/><p>Annie used to think about how she would die on a regular basis.</p><br/><p>It was quite strange to say that she would not prefer to die in a clean way. She dreamt of being torn into pieces, her death extremely disturbing, but she would not feel even a slight sense of terror or unease. Once, she dreamt of herself, dead peacefully on a sickbed. People hosted her a beautiful funeral, and Michelle stood quietly in front of her tombstone. Michelle gave her a lily.</p><br/><p>She jumped awake from her dream, damp from cold sweat. She tossed and turned in bed, but could not sleep anymore.</p><br/><p>Since she met Michelle, almost all of Annie’s dream have been related to Michelle. Chopped to pieces by Michelle, burnt to death by the church with Michelle, strangled Michelle to death with a rope…. There was even once where she and Michelle were at a dirty little motel, getting frisky with each other. But once she was awake, she never had any similar thoughts.</p><br/><p>Until she decided to betray Michelle.</p><br/><p>The thought to betray Michelle emerged once Michelle stopped trusting her. However, that was not the initial conflict. Before Sally appeared, Michelle was Annie’s belief, her mental support – Michelle was her God.</p><br/><p>Michelle could kill anyone, Michelle could get anything she wanted.</p><br/><p>It was like the first time she met Michelle. It was in a motel late at night, and Michelle arrived like a messenger from God. She descended from the sky, and beheaded Annie’s client with a swing of her sword.</p><br/><p>The scene from that moment was fresh as if it happened only yesterday: The client’s headless body was still lying on top of her, and it shuddered and twitched like a cock plucked clean of its feathers. The head had a slightly amusing expression as it rolled on the floor. Blood was everywhere, painting the yellowish mattress and blankets. Even the stubborn, moldy smell on the blanket was washed away.</p><br/><p>God knows how much she hated that moldy stench.</p><br/><p>Every time she took in a client, she could only focus on the ceiling of the motel to distract herself from the awful smell. No matter how terrible the client was, she could always zone herself out to ignore the quavering flesh and oily noses. The only thing she could never put up with was the distasteful smell of the mold.</p><br/><p>That smell was alike the childhood bedsheet that she had. It was humid and sticky, and it reminded her constantly how lowly she became.</p><br/><p>In order to avoid the smell, she would open her mouth to breathe. Sometimes, some clients would take that as a compliment and perform more vigorously, but she never paid much attention.</p><br/><p>Looking back, the only thing she remembered clearly throughout the five years of her work was the ceiling that she spaced out on, and the gruesome odor of the blanket.</p><br/><p>Thus, when Michelle killed the client, Annie was not afraid. Instead, she felt a slight sense of ease and elation as the scent of blood flushed away the moldy stench.</p><br/><p>After that, Michelle kept her sword and looked at an expressionless Annie.</p><br/><p>\"Follow me, and you will be a mage,\" she said.</p><br/><p>At that time, Annie had no idea what was a mage. But she nodded, and she etched that sentence into her heart. Until now, she could still utter the sentence without missing any words. The moment was as if it was paused into an oil painting, the details on Michelle’s clothes, the angle of the opened door, the position where the head rolled away, the shape of the stains on the wall…. It was like it happened just moments before, and the scene was as fresh as fishes that just got caught from the sea.</p><br/><p>That was how unbelievable Michelle’s existence was.</p><br/><p>Maybe that was why Annie was enraged when she found out Michelle no longer believed in her.</p><br/><p>The pivoting point happened three months after she learnt magic under Michelle.</p><br/><p>That day, Michelle led a woman who looked like a bamboo back to her. It was dinner time, and the stranger followed Michelle through the door, and sat smiling without waiting for people to speak. She acted like she was the owner of the place, and she took the only sausage on the plate.</p><br/><p>That was the dinner Annie left for Michelle.</p><br/><p>Annie dumbly looked at the woman, staring at her high cheekbones and her cruel brows. Annie was appalled, she did not know who this woman was, and she did not know whether she should be angry.</p><br/><p>She shared a look with the woman, and the woman smiled, \"Hello, I’m Sally.\"</p><br/><p>Sally, what a stupid name. Only the dimmest of the peasants, who drank three buckets of beer and fell into a cesspit, could come up with this name for her daughter. She must have also been barely conscious at that time.</p><br/><p>However, Annie did not throw a temper and give the shameless woman a slap on the face. She did, however, look at Michelle carefully. Michelle did nothing but said, or command, her.</p><br/><p>\"From today onwards, she will be our partner.\"</p><br/><p>Annie felt like she fell into the Pearl Lake in the winter. Cold, agonized, numb in her bones.</p><br/><p>This feeling was overly familiar.</p><br/><p>It was as if she was sent back to her childhood, and was once again that clueless young girl.</p><br/><p>When she was five, her mother did the same thing. She carried a wrinkly baby boy in her arms and came before her to say, \"From today onwards, he will be your baby brother.\"</p><br/><p>How similar.</p><br/><p>Her mother was the infamous deserted wife of the village, her father left the day she was born. In order to find her husband, her mother sold her fields and milk cows. As she started her journey in search for her husband, sometimes she would leave for three days, sometimes it took five days. Annie could only rely on the help from neighbors, and sat at her old home to wait for her mother, who came back disappointed, every single time.</p><br/><p>When she was five, her mother left for ten days, and she came back with a baby boy, her brother. Rumors had it that he was the child of her father with another woman. Annie never knew where her father was, and her mother refused to say anything about her father after her mother’s return.</p><br/><p>After that, it seemed like her mother gave up, and she stopped going out to find her father. Instead, she got addicted to beer. Annie was afraid of her drunk mother. Sometimes she would jump awake at night, and realize that her mother was staring at her, but instead of a loving gaze of a mother towards her child, it was a hateful gaze towards an enemy.</p><br/><p>The gaze her mother had for her brother was different.</p><br/><p>Even when she was drunk, her mother would caress her brother with the softest touch, sing lullabies to him, tuck him under the blanket, or steal milk from the neighboring village for him. Sometimes, even Annie felt that her mother’s gaze towards her brother was not a mother to son, but from a woman to a lover.</p><br/><p>Not to mention, he was not even her own son.</p><br/><p>Annie hated her brother, but she had no choice. She went to the mountains to dig up wild vegetables, did all the household chores, helped the neighbors to farm. The money she got, aside from the ones her mother took for the alcohol, she gave it all to her brother. The best clothes, the best food…. Everything for the satisfaction of her mother. Every time she sewed and patched up the clothes for her brother, she could feel her mother’s gaze on her soften, just a little bit.</p><br/><p>Mother still loved me, she felt.</p><br/><p>As time went by, mother became increasingly decadent, and treated her worse than before. Annie treated her mother and brother as best as she could, and finally, all of it reached the peak.</p><br/><p>The turning point happened, just like a corpse that decomposed until finally, maggots broke out of it.</p><br/><p>When she was twelve, she wanted to earn money, and was brought to a motel by a bald, middle-aged man. That was her first time. The first time, and she fell in love with the molded ceiling of the motel. She looked at the motel as she counted the money she could get, and the food she could buy for her brother, and how delighted her mother would be. This made her happy too.</p><br/><p>However, once she took the money back home, her neighbor told her that her brother drowned in the Pearl Lake.</p><br/><p>She could never forget how her mother looked at her when she arrived home that day.</p><br/><p>Mother never did say anything about her brother’s death. She just sat on the bed how she usually did, half-covered under the old, worn blanket, a half-empty beer bottle in hand. She stared at Annie, coldly.</p><br/><p>Annie understood what she meant under her gaze, \"I hope it was you who died.\"</p><br/><p>Hence, Annie did not say anything. She walked towards the bed in silence, took out the money she earned just now, and placed it beside her mother’s hand.</p><br/><p>Mother glanced at her again, and finally she said:</p><br/><p>\"Slut.\"</p><br/><p>The next day, Annie found her mother’s corpse in Pearl Lake. Just like her brother, mother’s features changed, and her face was swollen like a fermenting bread. ‘Mother would be happy,’ Annie thought when she saw the body, ‘Brother and mother look alike now. No one will ever say that they are not blood-related anymore.’</p><br/><p>At her mother and brother’s funeral, Annie cried a lot. That was the first time she cried, and she felt relieved.</p><br/><p>After the funeral, she left the village.</p><br/><p>Before she met Sally, she did not understand her feelings towards her mother and brother. She thought she loved them, as she sacrificed so much for them. Their death devastated her, which caused her to leave her home and wander around.</p><br/><p>But once she saw Sally, she realized. She hated her brother, just like how she hated Sally, who was right in front of her.</p><br/><p>She hoped to slap Sally, just like she hoped to strangle her baby brother right from the start.</p><br/><p>Despite that, she did not. She maintained indifference as she watched Sally finish the sausage, and spoke cowardly, \"Hello, I’m Annie.\"</p><br/><p>She walked into a new cycle.</p><br/><p>Sally was smarter than she was, Sally was more talented in magic than she was, Sally was more eloquent than she was…. Everything happened just like what Annie expected. Michelle’s scale slanted slowly but steadily towards Sally. No matter how hard she tried, how obedient she was, Michelle always gave more attention to Sally than her.</p><br/><p>Every single night, she craved to get out of bed discreetly, and slit that woman’s throat using a dagger. She would let the blood cover the fake smile she hated so much. However, she did not dare to do so.</p><br/><p>Just like how she could not muster up the courage to kill her brother, she could not touch even a single strand of hair of Sally’s.</p><br/><p>This made her hate herself, more and more.</p><br/><p>She also found out that she was that kind of person that treated people better when they treated her worse. This somehow became a motivation for her to run away from her lowliness. She wanted to change herself from the inside out.</p><br/><p>Thus, she became even more extreme. She tortured all of Michelle’s hostages, and used the cruelest methods to slaughter enemies. This delighted her. She felt like she changed, she became greater, and no longer was the weak, stupid little girl. People would be afraid of her now.</p><br/><p>However, she still would not reveal her true colors to Michelle and Sally.</p><br/><p>She did not kill Sally.</p><br/><p>Annie was stunned when Michelle did not believe her. How could she kill Sally? How would she dare to kill Sally? Her dead mother and brother from long ago became thick, heavy chains that locked her down. She could never take that step.</p><br/><p>After Sally’s complaint, Annie did not even argue with her. She knew that Sally was a person with no restraints, and it was not even the first-time Sally spoke badly about her. It happened right in front of her several times, she could not even imagine the times Sally talked about her behind her back. Though, she never protested, she did not even grumble.</p><br/><p>It was Sally who approached her.</p><br/><p>\"Annie, don’t be angry at me, I didn’t want to frame you like that intentionally just now,\" Sally explained.</p><br/><p>\"Annie, don’t you think Michelle is acting strangely? She knew so much but she doesn’t tell us anything. We don’t even know what is in the treasury! Say, why does she have to have more power over us. I really don’t think she as much stronger than us anyway….\" Sally fretted.</p><br/><p>\"Annie, I heard Michelle has a treasure on her that could double the magical powers of the holder. Let’s go and snatch it from her! Don’t be afraid, Michelle isn’t as strong as she looks. As long as we take the opportunity when she is resting....\"</p><br/><p>Sally instigated.</p><br/><p>\"Annie, please, don’t do this! Please don’t tell Michelle, please, no! Michelle would kill me! Please, I beg of you, don’t tell Michelle I wanted to betray her, please?\"</p><br/><p>Sally begged.</p><br/><p>When Annie defeated Sally and bound her with magic, she realised how much stronger she was as compared to Sally. Sally’s usual arrogant demeanour, however, was one that she faked.</p><br/><p>Still, she did not intend to kill Sally. She wanted to inform Michelle, and let Michelle decide on what was supposed to be done. Michelle hated betrayers the most, and once she saw who Sally really was, she would kill her. That would be amazing, watching the thing that she dreamt to do but never had the courage to do be fulfilled.</p><br/><p>As long as Sally died, Michelle would focus on her again, she thought.</p><br/><p>However, she underestimated Sally’s conviction.</p><br/><p>Sally, backed into a corner, made a tragic decision. Although she was bound by Annie and could never escape, but she could still have control over her own life. Hence, before Annie could react, she imploded her magical power from within and committed suicide.</p><br/><p>\"Annie, she would never trust you anymore.\" That was Sally’s last words.</p><br/><p>Annie was pushed into a canyon of despair.</p><br/><p>Sally used her suicide to frame Annie. Annie had no idea how to explain this to Michelle. Annie killing Sally was more believable than Sally committing suicide over some extremely complicated circumstances. Besides, from Michelle’s standpoint, she and Sally already had old hate brewing between them.</p><br/><p>Not to mention the traces of a fight on the ground.</p><br/><p>\"Sally, Annie, let’s go!\" Michelle called for them even before Sally’s corpse became cold. Annie realised that she did another idiotic act whilst being in a hurry – she hid the body in a rush and made a lie to try and convince Michelle that Sally went missing.</p><br/><p>However….</p><br/><p>\"Annie, did you kill Sally?\"</p><br/><p>This was the words of the noble. It was like a thunderbolt out of the blue, and it exploded in her mind.</p><br/><p>Sally predicted everything. Michelle was willing to believe the useless noble, than to trust her.</p><br/><p>She found out that she was this weak, useless little girl once again, unable to do anything but to repeat meaningless defenses. Michelle’s attitude pushed her into the ice. Although Michelle said she trusted Annie, but Michelle’s eyes, they were the same as Annie’s mother’s when her brother died.</p><br/><p>So many years passed, and once again Annie understood that gaze.</p><br/><p>Michelle wanted to kill her.</p><br/><p>After being repeatedly showered with hopelessness, a powerful desire rose from her heart.</p><br/><p>She intended to change. She refused to become her old self. She refused to make the same mistakes.</p><br/><p>She decided to betray Michelle.</p><br/><p>She intended to go to the troops of the Lithur family, surrender, and tell them Michelle’s plan. Although the church had strict rules against mages, but nobles still secretly maintained ties with the mages, hungry for their magic. She was willing to work for the Lithur, and the Lithur would let her live, and kill Michelle.</p><br/><p>Kill Michelle…</p><br/><p>Annie shuddered with the thought. She convinced herself it was excitement, nothing else.</p><br/><p>She ran for a while in the forest, and she finally saw the knight. They must be the troops from Lithur! She thought as she sprinted towards them while she waved.</p><br/><p>\"I bear no ill will, your family….\" She shouted.</p><br/><p>What welcomed her was holy light.</p><br/><p>Within the church, there were several types of holy lights. There were those that were used to bless and baptize the knights, and they were warm and holy; there were those that were used to torture the heathens, and they burnt but would not kill; there were those that were used to annihilate enemies, and they were so powerful that they could cleanse a person in a blink of an eye, without leaving a trace.</p><br/><p>The holy light that Annie got was the third type.</p><br/><p>The terrifying temperature evaporated her cloak and her skin with a blink of an eye, and the strong burn prohibited her from releasing even a basic protection magic. She could not see anything, holy light was everywhere, and it was so bright it was impossible to look at.</p><br/><p>She was cleansed by the Cleaners before she could betray Michelle.</p><br/><p>Tiny specks of dust floated around the midnight forest like butterflies, and like butterflies, they were stepped on by the Cleaners’ hooves and turned into mud.</p><br/><p>Annie died.</p><br/><p>Before she died, she suddenly thought….</p><br/><p>No, she had no time to think. She had no time to review this method of dying, it was unknown if she thought evaporation by holy light to be tragic enough for her. She also had no time to regret betraying Michelle, or anything else. Her life did not flash before her eyes, there was no childhood happiness nor sadness.</p><br/><p>She was just dead.</p><br/>\n</div>"}