{"title": "Chapter 27: Put Down Your Weapon!", "id": 27, "volume": 1, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-27-put-down-your-weapon", "volume_title": "Volume 1", "body": "<h1>Chapter 27: Put Down Your Weapon!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 27: Put Down Your Weapon!</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>They came to the door.</p><br/><p>Grant pushed the door open, and remained focused and cautious, like an FBI agent with a mission to accomplish. As he pushed open the door, he purportedly rolled over to the right to avoid an anticipated attack.</p><br/><p>Out of consideration of various factors, Benjamin also backed off a little.</p><br/><p>However, the door was pushed open and nothing happened.</p><br/><p>Benjamin was puzzled, carefully walked forward a few steps to the door and peeked inside. He saw that in the room, Dick Fulner and a huge man stood together. The moment Benjamin looked at them, they had their eyes locked on Benjamin.</p><br/><p>It appeared that they had been waiting for a long time.</p><br/><p>... There was a murderous aura.</p><br/><p>Benjamin felt trouble coming, so he turned away impulsively.</p><br/><p>He was very clear, after the last Fulner family fiasco, Dick's hatred of him would not have reduced by half. To Benjamin's understanding of Dick Fulner, he would try at all costs to seek revenge.</p><br/><p>Look at the situation now, was there anything that needed further explanation?</p><br/><p>Dick was not here to participate in some war game, he was here for Benjamin!</p><br/><p>Tricky.</p><br/><p>The moment that Benjamin and Dick’s eyes met, the atmosphere became tensed, like a raging storm was about to hit. Suddenly, a very loud cry, that could shatter glass windows, broke the stormy atmosphere.</p><br/><p>\"Holy Bolt!\"</p><br/><p>Grant suddenly dashed into the room, and it was the same old trick, two balls were thrown from his hands, accurately hitting Dick and the huge man's chest.</p><br/><p>\"...\"</p><br/><p>The big man looked at the ball on the ground, and turned to Dick who was next to him. He hesitated, but did not make the exaggerated look as if he was about to die. Dick, needless to say, was not moved at all, his eyes continued to stare down Benjamin.</p><br/><p>Grant was stunned.</p><br/><p>\"Hey, you cheaters!\" He angrily shouted at Dick and his companion.</p><br/><p>\"Oh.\"</p><br/><p>Dick used \"meh\".</p><br/><p>Grant suddenly looked as if he was hit hard, he could not speak, and fell, defeated.</p><br/><p>Upon seeing this, Benjamin sighed in his heart.</p><br/><p>Looks like he had to rely on himself</p><br/><p>So he turned to Grant, pretending to be relaxed and said, \"No way, looks like only I can deal with these two enemies.\" Then, he looked again at Dick, and took a few steps forward.</p><br/><p>These two steps he took, made him feel like it was \"Out of the way! It’s my turn to act stupid!\" kind of feeling.</p><br/><p>\"What do you want?\" He asked Dick.</p><br/><p>At the same time, when he was pretending, he asked the system: \"Who’s that gigantic person next to Dick?</p><br/><p>Master yourself, master the enemy. Ever since he successfully escaped from the hands of Michelle, with these quotes from his ancestors which he viewed as a motto for life, he could not help but feel that he wanted to tattoo them on his arm.</p><br/><p>System answered, \"That is his brother, called Conte Fulner, he was a talented child, gifted with divine power but unfortunately at the age of three he had a serious illness, and his brain was burnt out. He is a bit stupid, but he is obedient to his family members. Because of his strength, no one dares to cross him.\"</p><br/><p>Benjamin who was listening was stunned for awhile, and had a feeling something bad was about to happen.</p><br/><p>He was not afraid of Dick, this was not the Lithur family home, and had no elders to support him. What could he do with his thin arms and legs in a commotion like this?</p><br/><p>But he had a strong opponent now, this would prove troublesome to handle.</p><br/><p>Let us see what he would do.</p><br/><p>\"What do I want to do, you should know really well don’t you?\" In this strange atmosphere, Dick spoke like the evil villain in a movie, \"I want to repay you with the humiliation you made me go through! \"</p><br/><p>Saying this, he took out a chamber pot from nowhere.</p><br/><p>\"...\"</p><br/><p>So, ever since the \"chamber pot door\" incident, had he been carrying this thing with him?</p><br/><p>This was about the chamber pot.</p><br/><p>Benjamin could not help but feel admiration for Dick’s perseverance to avenge himself.</p><br/><p>\"This person is incredible,\" The System could not help but wondered. \"You have to be careful. This person is not simple. According to my analysis, he seems to have a portable space. He might have teleported here as well.\"</p><br/><p>\"...Why?\"</p><br/><p>The system shouted like an idiot: \"Must you ask, if not from a portable space, where would he keep the night pot in, his anus?\"</p><br/><p>\"... Maybe it is so.\"</p><br/><p>The tense atmosphere disappeared the moment Dick took out the chamber pot, but Dick tried his hardest to make himself look like a villain. Benjamin could only feel that it was funny, he could not help but pity Dick.</p><br/><p>\"Well, since he doesn’t want to play properly, that's the end of today's battle, Grant, let's go home,\" he said, turning to Grant.</p><br/><p>Grant was stunned.</p><br/><p>Benjamin had to continue on and say, \"Why are we still staying here? They do not want to play with us, let’s go home.\"</p><br/><p>Grant responded, although a bit reluctantly, but still nodded his head and said: \"Well, let’s go back.\" He ended his speech and also glared at Dick, seemingly hating Dick who destroyed his perfect gaming experience.</p><br/><p>Benjamin did not want to deal with all this, and turned away.</p><br/><p>He just wanted to leave this place before the smell of the chamber pot started dispersing.</p><br/><p>\"Stop! Don’t go!\" Dick was so angry that he was missing such a good opportunity for revenge, so he shouted at once, and said, \"Conte, hurry, don’t let them leave!\"</p><br/><p>He continued standing next to Dick and staring at Dick, but did not move. Dick furiously shouted a few words, pointing at Benjamin. Conte’s reacted immediately, and sped towards Benjamin.</p><br/><p>Benjamin was shocked by Conte’s speed.</p><br/><p>Woah, how could this big guy be so fast?</p><br/><p>When he hesitated to escape, Grant suddenly jumped out. Only to hear him shouting: \"Leave this guy to me!\" Then he turned and rushed towards Conte. Conte used his hands to try to catch him. Grant leaped thoughtlessly and managed to use his legs as scissors, firmly locking Conte’s neck in place.</p><br/><p>Conte lost balance and the two fell together to the ground, ending in a stalemate. Conte made efforts to break free, but Grant held him tight, and the both of them could not move at all.</p><br/><p>Benjamin was dumbfounded for a while. He did not know whether to admire Grant’s skill, or make fun of him for his reckless behavior.</p><br/><p>Dick was also stunned, he did not expect Grant to be strong enough to subdue Conte. But the power of hatred was obviously very strong as he quickly recovered from the surprise, and stared at Benjamin.</p><br/><p>Benjamin also looked at Dick, and he felt that this was not going to turn out well.</p><br/><p>Grant was entangled with Conte, which forced him to stay here - he could not just abandon Grant right?</p><br/><p>Trouble.</p><br/><p>He saw Dick staring at him, the chamber pot in his hand was slowly lifted up, a Dong Cunrui raising explosives bag posture was coming in shape.</p><br/><p>\"Oh no!\"</p><br/><p>Benjamin felt some goosebumps.</p><br/><p>He squatted down, wanting to dodge.</p><br/><p>\"Don’t try to dodge!\" Dick said. Upon seeing this, he became anxious, and shouted, \"If you dare to dodge, I ... I will use this to smash them!\"</p><br/><p>Saying this, he took the chamber pot and took aim at Grant and Conte who were tangled together..</p><br/><p>Grant was also shocked to hear this, and forgot to continue applying force. Conte used this opportunity to break free. However, Conte did not seem to understand Dick’s words just now, or maybe he understood but did not care. After breaking free, he went straight to Benjamin and continued to carry out his unfinished task.</p><br/><p>Dick was pleased at Conte charging toward Benjamin. \"Hurry, Conte, seize the bastard!\"</p><br/><p>Benjamin looked at the big man from above, and had no time to dodge.</p><br/><p>\"Oh no oh no oh no!\"</p><br/><p>The situation worsened. He did not have time to think. Conte instantly rushed towards Benjamin. A pair of big hands were less than ten centimeters away from Benjamin, seemingly about to seize him.</p><br/><p>Benjamin could only lift his legs impulsively and gave him a kick!</p><br/><p>Time seemed to have been paused, just in a few seconds, the whole corridor became quiet.</p><br/><p>\"Turns out he walks so quickly because he was used to opening his legs wide.\" Suddenly the System came out of his mind and thoughtfully informed.</p><br/><p>Open....open wide?</p><br/><p>Benjamin was still immersed in a state where he had yet to react.</p><br/><p>Slowly, he also began to feel something was out of place. Conte's hand was obviously in sight, soon to meet his face, but it no longer moved forward anymore, why was it so?</p><br/><p>So Benjamin looked down curiously.</p><br/><p>He saw his left leg slightly raised, and it was between the legs of Conte, like a swing with a beautiful curvature. His feet pad felt slightly numb, as if just kicked something hard.</p><br/><p>\"Mom ... mother ...\"</p><br/><p>Conte who seemed to have been stunned, started sobbing, bean sized tear drops rolled down his cheeks.</p><br/><p>Benjamin was stunned. He pulled back his legs, then took back a few steps, watching the big man in front of him weep. He felt a sense of guilt he had never felt before.</p><br/><p>\"I'm sorry. It was not intentional.\" He was very sincere. He felt it was the most fervent apology he had ever made.</p><br/><p>Fortunately, perhaps Benjamin's apology was sincere enough, Conte did not cry as much as he did before. He was still sobbing a little, using his pair of slightly trembling hands slowly covering the injury.</p><br/><p>Conte cried his way out of the castle. His pace was very slow, but not knowing why, no one reacted or tried to stop him.</p><br/><p>Before he left the castle, no one spoke, and no one moved. The whole corridor was filled with his sobbing, followed by a repetitive low pitched, coarse calling out for \"Mama\".</p><br/><p>He's gone.</p><br/><p>After Conte left, Dick suddenly reacted, and began to shout at the end of the corridor: \"Conte, come back!\" However, no one responded to him - it seemed that no one would respond to him again.</p><br/><p>Benjamin turned to look at Dick again. Grant recovered from the shock and looked at Dick too.</p><br/><p>Dick instantly realized that it was not good.</p><br/><p>\"You ... what are you doing, Benjamin, don’t take joy in this, I won’t forgive you!\"</p><br/><p>He ended his speech and raised the chamber pot again.</p><br/><p>Benjamin exchanged looks with Grant. The two ducked down, and approached Dick from two separate directions.</p><br/><p>\"Don’t act rashly, put down the weapon you’re holding, you have been surrounded. I repeat, put down the weapon, you have been surrounded. You have the right to remain silent, but what you say will be ...\"</p><br/><p>Benjamin's words were not finished, and he was suddenly interrupted.</p><br/><p>\"Don’t move! You come any closer ... you come any closer, I'll kill you!\"</p><br/><p>Under all this emotional stress, Dick suddenly pulled out a gun from his pocket. He held a chamber pot in one hand, and a gun in another, the gun muzzle pointing at Benjamin’s forehead.</p><br/>\n</div>"}