{"title": "Chapter 38: When a Mage has to Perform Surgery", "id": 38, "volume": 1, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-38-when-a-mage-has-to-perform-surgery", "volume_title": "Volume 1", "body": "<h1>Chapter 38: When a Mage has to Perform Surgery</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 38: When a Mage has to Perform Surgery</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>The elderly mage was hidden in a sack in the corner in the storage area.</p><br/><p>When Benjamin saw the short one walk over, and how he violently dragged the mage in the sack over. It made Benjamin think that if the elderly mage would realize what his students were doing, he would probably be angered till he came back to life right?</p><br/><p>But he was not yet dead, and should not know what was going on.</p><br/><p>-----At least he was not dead yet.</p><br/><p>\"What bad luck did your teacher accumulate in his past generations that he’d end up having you two as students?\" Benjamin could not resist from exclaiming.</p><br/><p>\"Our teacher has said this before!\" The short one sounded very happy, but he didn’t seem to know what he was happy for, \"Our teacher would always say, if it wasn’t for our connection to the elements, being able to misread incantations but still somehow cast spells, he would never have accepted us two as students!\"</p><br/><p>\"...\"</p><br/><p>After hearing this, Benjamin felt conflicted, and could not give any further comments.</p><br/><p>He should probably focus on saving people, right, focus on saving the mage.</p><br/><p>He took a deep breath, and regained his focus, then looked at the wound on the elder mage’s chest.</p><br/><p>Yeah....he can still be saved.</p><br/><p>The spot where the bullet hit was below the heart, blood was still flowing from it. Whether it was on purpose or not, Benjamin missed. The wound was not lethal, and it did not harm any organs. But if he continued to leave him in the sack, he would probably die from blood loss in another ten minutes.</p><br/><p>Seeing his pale complexion, he probably already lost a lot of blood.</p><br/><p>\"We don’t know any healing magic, are you able to save our teacher?\" The tall one asked.</p><br/><p>Benjamin shrugged, and replied, \"I’ll try.\"</p><br/><p>He was confused, and did not know whether he should really be doing this. He already felt the light on top his head giving off a Saint Mary feel, but, since he had already made it to this point, he should just Saint Mary it to the end.</p><br/><p>He was not a doctor or a nurse, and had no idea how to treat gunshot wounds. But he had a healing water ball, and he has watched countless amount of TV dramas, so he had some arbitrary knowledge on how to extract the bullet.</p><br/><p>There were no special tools around, thus he had to use his hands.</p><br/><p>Facing the bloodied wound, he was surprisingly calm. He tore open the clothing covering the wound and exposed the chest. He studied the wound carefully, then inserted his right thumb and index finger inside.</p><br/><p>He thought to himself while doing this: This man should be grateful that Benjamin was still young, and his fingers were not rough. If not, this man would probably die halfway before the bullet could be taken out.</p><br/><p>\"What magic is this, it’s terrifying!\" The short one observed at the side, then started crying.</p><br/><p>\"Don’t cry, our teacher will not die.\" The tall one comforted him.</p><br/><p>Benjamin made an expression which spelled \"damned retards\".</p><br/><p>The bullet was not lodged deep within, it was probably blocked by the rib cage, Benjamin could quickly feel the cold steel between the flesh. But because of Benjamin’s finger, the wound was widened, dyeing his whole hand red.</p><br/><p>Seeing this, Benjamin did not dawdle any further. After making sure his fingers held onto the bullet, he applied some strength and extracted the bullet.</p><br/><p>Success!</p><br/><p>The whole process was rather successful, even though there was more blood loss, it was not life threatening.</p><br/><p>Benjamin could not help but feel as if he had the talent to become a doctor. If he knew of this earlier in life, he would have went in the medical field, that way he would still have skills he could use after teleporting, and not just some dumb speech drafts.</p><br/><p>Ah, the regrets!</p><br/><p>As he was occupied in deep thought of his untapped potential, he slowly placed the bullet aside. The two fools surrounded him, looking at the bullet curiously, as if they wanted to touch it but did not dare to touch it, only making shocked noises.</p><br/><p>\"This bullet was shot from a handgun, it’s a type of weapon, it has nothing to do with magic.\" Benjamin saw this and could not help but explain while shaking his head, \"What I am about to use though, is magic.\"</p><br/><p>Finishing his words, he started chanting, and conjured a water ball. He modified the elemental composition within the water ball, and made it so it had healing qualities, then he gently pressed the water ball against the mage’s wound.</p><br/><p>The water ball slowly dissolved into the wound, the same wound that had been widened while extracting the bullet. As it dissolved further, the bleeding began to slow down.</p><br/><p>Benjamin expected this to happen: He was aware that one water ball was not enough to cover the wound. He guessed that even though it was the water of life, its healing qualities was not that great, if not all mages who knew this would be practically invincible.</p><br/><p>He followed suit by making more of them, the healing water balls smashed against the wound one by one.</p><br/><p>Because of this, after smashing around ten water balls, the wound ceased bleeding, and started to heal, the pale complexion of the mage started to regain color.</p><br/><p>Upon seeing this, Benjamin stopped doing what he did.</p><br/><p>The patient was already in a stable condition, and would not die anymore, he did not want to waste anymore effort.</p><br/><p>\"His wounds are of no great deal anymore, all you have to do is leave him there, he should wake up in a moment.\" Benjamin stood up, and stretched. After telling the patient’s family that the surgery was a success, it was the end of his short medical career.</p><br/><p>The two looked at him, but stood idly, and did not say a thing.</p><br/><p>\"What’s wrong?\" Even though feeling that he would regret it, Benjamin still spoke.</p><br/><p>The short one looked at him shocking, as if he found new land, then exclaimed: \"You know magic, you’re actually a mage? My God, you’re a mage! You’re on our side!\"</p><br/><p>Sorry, but I do not really want to be on the same side as you.</p><br/><p>Benjamin was surprised at their reaction. Why hadn’t they reacted earlier? Didn’t they just say that they thought his handgun was an act of magic? In that respect wouldn’t that have made him a mage already?</p><br/><p>But, let’s just leave it at that…..</p><br/><p>Facing these two, he did not have the strength to make fun of them.</p><br/><p>\"Right, I am a mage.\" He replied helplessly.</p><br/><p>\"No wonder you could harm our teacher.\" The tall one nodded his head and said, \"Our teacher said, only a mage can hurt a mage, the Church is just a bunch of useless people!\"</p><br/><p>\"...\"</p><br/><p>If they were to come across a group of \"Cleaners\", they would probably think otherwise.</p><br/><p>But, Benjamin did not intend to continue his conversation with these two.</p><br/><p>He wanted to return to the alley and see what had happened to the two paladins.</p><br/><p>And also that thieving child. But, Benjamin suspected that the kid has already died from the magic, it was him who was shot first anyways.</p><br/><p>This made Benjamin feel helpless.</p><br/><p>A child ended up dying this way, even though he was a thief, and it was not Benjamin who was responsible...</p><br/><p>For what reason was he here feeling conflicted?</p><br/><p>If this world had a heaven, he wished that the kid would suffer a bit more in hell. When he goes to hell as well, he would still grab the kid by the collar and teach him a lesson for stealing from him.</p><br/><p>After thinking of this, Benjamin felt much better.</p><br/><p>This is it, he’s already been affected by how these two young mages thought, he had to hurry up and leave.</p><br/><p>\"I’m leaving, don’t tell anyone about me, especially that I’m a mage.\" He told the two, then turned around and got ready to leave.</p><br/><p>\"Why are you leaving?\" This time, the tall one stood forward and blocked him,\" You’re a mage, you should follow us home. Our teacher has mentioned before, it is dangerous for a mage to be alone. If not for our teacher leading the way, we would not have dared to leave home.\"</p><br/><p>Go home?</p><br/><p>Benjamin seemed to have thought of something, then turned around and asked: \"Where do you guys live? No, you should answer this question instead, what is the name of your mage organization?\"</p><br/><p>He suddenly thought of what he felt from these three previously, a hunch that they belonged to some sort of organization.</p><br/><p>He had to ask a bit more.</p><br/><p>\"What was it called? Home is home, we have spent most of our lives there. \"The tall one seemed to be confused, and frowned, then said.\" But, I think I remember, I heard other people call our home as....as that…..\"</p><br/><p>The tall one seemed to fail to remember, but the short one ran over and loudly reminded him:</p><br/><p>\"It’s called ‘The Academy of Silence’!\"</p><br/>\n</div>"}