{"title": "Chapter 40: Silver Handgun", "id": 40, "volume": 1, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-40-silver-handgun", "volume_title": "Volume 1", "body": "<h1>Chapter 40: Silver Handgun</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 40: Silver Handgun</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Hearing this, Benjamin hesitated for a moment, and said: \"But, I have yet to buy a gun.\"</p><br/><p>He did not plan on going home just yet.</p><br/><p>The other knight immediately advised: \"The chaos of the outer parts of the city, you, Sir Lithur, have seen with your own eyes, what if the fallen one who kidnapped you appeared again? Please go back first, then we’ll talk.\"</p><br/><p>Benjamin thought for a while, then came up with a plan.</p><br/><p>Buying the gun was not the main point, he could probably try to get something out of the paladins.</p><br/><p>He used a determined voice, as if he was dead set, and said: \"No! These fallen ones are so powerful, if I did not have the power to retaliate, what difference would being in the inner part of the city make? The both of you have seen, if it was not for me who opened fire, the fallen ones today would probably not have retreated. Soon, my father would take back this gun, if the fallen ones were to evade the both of you, then appear in front of me, what would I do?\"</p><br/><p>\"This...\"</p><br/><p>The paladins were not as good at talking as the bishop, they did not know how to reply.</p><br/><p>\"My marksmanship is not bad either, if I were to have a gun, I can put up a fight with the fallen ones.\" Benjamin saw this, and continued adding oil onto the fire, \"Sir paladins, I know the trading of firearms is forbidden in the kingdom, but as the both of you have seen, the fallen ones have become so rampant, a normal citizen could only hope to contribute their part in vanquishing them, should such a simple request be rejected?\"</p><br/><p>He words were full of righteousness, as if he had turned into one of the fanatical believers.</p><br/><p>The paladins became even more conflicted. After some thought, the male paladin said: \"After discovering fallen ones, we have to report them first, plus, in our current situation are unable to continue to protect you. If we were to let you go buy a gun alone and something were to happen, we cannot take responsibility.\"</p><br/><p>How stubborn.</p><br/><p>Benjamin did not give up. He knew this was the paladins’ last retort.</p><br/><p>\"That witch was able to put a letter under my pillow, do you think the both of you are able to stop her? If I had a gun in my hands, I could at least fire in retaliation, and the both of you can hear the gunfire. If not, I would probably be kidnapped without a sound, and your part in this would be even bigger!\" Benjamin’s words became threatening to hear, as if he was trying to scare the paladins into submission.</p><br/><p>\"Sir Lithur, if were not able to get a gun, you really do not wish to return home?\" After some thought, the paladin asked helplessly.</p><br/><p>\"Yes.\" Benjamin replied with determination.</p><br/><p>\"Alright, guess we have no choice.\" The female paladin was persuaded. After a few glances between her and her companion, she sighed, and pulled out a silver handgun and a silver box from a compartment underneath her skirt.</p><br/><p>\"This is a specially crafted gun, inside it, there are four blessed bullets. This box also contains twelve blessed bullets.\" The female paladin said this solemnly, \"This is part of the equipment of a paladin, right now, and I’m putting them in your charge. As for the Church, I will explain to them, do not worry.\"</p><br/><p>It’s here it’s here!</p><br/><p>Today’s trip to the outer city was not in vain.</p><br/><p>Even though he was moved to the point where it was hard for him to hold it in, Benjamin still managed to resist and showed a hesitating face, declining while saying: \"This…...how could I have the nerve, this is your gun, how can I even call it as my own?\"</p><br/><p>\"Your marksmanship is better than mine, you have more right to own it than I.\" The female paladin said this helplessly, \"Plus, if you didn’t get a gun, you wouldn’t go home, right?\"</p><br/><p>Hearing this, Benjamin was overjoyed, and did not continue his act, accepting the gun and the bullets.</p><br/><p>\"Thank you for both of your understanding.\" He smiled like a flower.</p><br/><p>\"Shameless.\" The System looked down on him and said.</p><br/><p>\"What do you know, this is called using your brains, I did not ask them to give her gun to me, it was she who offered, what choice do I have?\" Benjamin said this triumphantly.</p><br/><p>\"It’s called being shameless!\" The System sounded even more scornful.</p><br/><p>Benjamin did not care about the System. But seeing the paladin in front of him whose face was full of mud and ruined makeup – while still looking righteous -- he could not help but feel some shame. After some thought, he took out all of his money.</p><br/><p>\"I don’t have anything to thank the both of you with, this is the only thing I can provide. I hope the both of you will accept it.\"</p><br/><p>From the conversations he had with the System previously, in this world, there was no such thing as \"bribery\", everything was considered as an act to \"give thanks to God\". Because of this, this would not get these two paladins in trouble.</p><br/><p>The paladins showed a conflicted expression. They seemed to not be amiable towards money even if they needed it. But if they were to accept it, they would feel ashamed.</p><br/><p>Seeing this, Benjamin said: \"Please don’t feel ashamed, this is only a token of gratitude towards God from a believer. Being a servant of God, you are always in the first line of defense against evil, you have the right to receive such things.</p><br/><p>\"But....\"</p><br/><p>\"You do not have to be like this, I am a noble in the city, why would I lack money? These things are meaningless to me, but if the both of you were to accept it, they would be much more meaningful.\"</p><br/><p>\"...\"</p><br/><p>Under his relentless persuasion, the paladins hesitated for a moment, but still accepted it in the end.</p><br/><p>The System’s scornful remarks stopped as well.</p><br/><p>\"Thank you very much, I have two younger brothers at home. I will use my free time to train them in the ways of the knight, but to become a knight of the Church, you have to graduate from Sunday school first. Your gift to us is meaningful beyond comparison. \"The female paladin took over the money bag, and said this earnestly.</p><br/><p>Hearing this, Benjamin smiled. He felt that he had done something good and was happy.</p><br/><p>Thus, the paladins split the money and kept their part properly. Benjamin too kept the gun and bullets properly. It was close to ten o’clock, the night grew darker, and the streets on the outer parts of the city became less lively. The three started heading towards the inner city.</p><br/><p>Under the escort of the paladins, in half an hour, Benjamin successfully reached the Lithur family house.</p><br/><p>After a great amount of consideration and bidding farewell to the paladins, he returned the gun that he stole and sneakily went back to his room, not alerting any other people in the house ----- if Claude were to find out what he did at night, he would probably be livid.</p><br/><p>As for the two bullets he fired, he could only hope that Claude did not notice.</p><br/><p>He shut his room door, and laid on his bed, pretending as if nothing happened at the outer city, pretending that he was all the while in his room.</p><br/><p>Only he knew of the harvests he made tonight.</p><br/><p>A newly compiled Getting Started with Magic by the Academy of Silence, a piece of rock that was called \"Water Element Crystal\", and his own gun, together with sixteen blessed bullets. He swore, all he wanted was just a gun before he left!</p><br/><p>It was not purely luck, these items were hard-earned.</p><br/><p>He could live with these for the time being, these blessed bullets have already given Benjamin a solution to a big problem ---- if Michelle dared to appear in front of him, he could shoot her dead with just one shot, see if she still dared to order him around.</p><br/><p>All he had to do was drag Michelle’s lifeless body to the bishop, and he would naturally help remove the curse without hesitation.</p><br/><p>Thinking of this, Benjamin’s mood immediately became good.</p><br/><p>After teleporting here, Michelle has been a huge rock in his way, even though he managed to escape from her, she still managed to use a curse to threaten him. Previously, he lived under a great amount of stress every day. A few days ago he dreamed of Michelle, and in the dream, Michelle had a giant sword and chopped him into mincemeat.</p><br/><p>He had already made the preparations for this tug-of-war he was about to play with Michelle.</p><br/><p>He could never have expected that just with one trip, he could bring him so many things, making it possible from him to directly get rid of Michelle.</p><br/><p>Other than saying that it was divine intervention, what else could he say?</p><br/><p>He was looking forward to Michelle appearing. With this, he could get rid of her with just a shot.</p><br/><p>However, just when he was joyfully playing with the silver handgun, suddenly, an acute pain came from his stomach, and spread across his whole body. He laid on the bed, and the pain made him lose the strength to even hold the gun, which fell off the bed.</p><br/><p>Benjamin’s good mood was immediately ruined.</p><br/><p>The curse is triggered again!</p><br/><p>Why is this happening more and more frequently?</p><br/><p>Right when he was clutching his stomach and rolling around on the bed, that familiar and nightmarish voice once again came to his ears:</p><br/><p>\"Sir Lithur, long time no see, you’ve given me another surprise. If I was not for me observing you in the dark, it would probably be me in your current position now.\"</p><br/><p>The cloaked silhouette once again emerged from the corner of the shadows.</p><br/>\n</div>"}