{"title": "Chapter 50: Bonnie‘s Pub", "id": 50, "volume": 1, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-50-bonnie%E2%80%98s-pub", "volume_title": "Volume 1", "body": "<h1>Chapter 50: Bonnie‘s Pub</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 50: Bonnie‘s Pub</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>\"Master? Why are you here?</p><br/><p>In the outer part of Havenwright, there was a pub named \"Bonnie’s\", and it was crowded and lively. Even though pubs were usually not that popular in the afternoon, but this particular pub was an exception. The laughter emanating from within were enough to tear the ceiling apart. Those sitting on the row of wooden stools were all middle-aged men who were drinking.</p><br/><p>There were also a tipsy Jeremy in the pub, and Benjamin who just walked in.</p><br/><p>After hearing from the butler, Benjamin was worried that something could have happened to Jeremy. So he took his pistol and bullets and left the Lithur manor, coming here in search of Jeremy.</p><br/><p>After arriving at the abandoned site, he questioned the passersby on whether they had seen a male servant that looked like a rat. One said: \"I’ve seen him, he’s at Bonnie’s right now.\" When Benjamin heard this, he heart dropped and thought that the situation could be much more worse than expected.</p><br/><p>But unexpectedly...</p><br/><p>Jeremy was fine. He was in this pub, drinking away with a bunch of unknown men, therefore unable to return to the Lithur manor.</p><br/><p>Even from a distance of ten meters, he could smell the odor of alcohol from Jeremy.</p><br/><p>Damn...</p><br/><p>Why was everyone around him so unreliable?</p><br/><p>Seeing Jeremy was so drunk, Benjamin had the urge to smack him with a water ball on his head.</p><br/><p>But Benjamin managed to resist. He walked over to Jeremy without saying a word. Benjamin was prepared to drag Jeremy away with force and once Jeremy was sober, he would reprimand Jeremy on what he was doing and how much salary cut he would get.</p><br/><p>\"Jeremy, is this your master?\"</p><br/><p>Right when Benjamin was about to drag Jeremy, a man at the corner asked.</p><br/><p>\"Right, this is my master. Come come, master, meet my new friends, this is ... uh, what’s your name again, I can’t seem to remember. Hey, master, don’t pull me.\" Jeremy’s tolerance to alcohol was so bad, he was rambling nonchalantly, which appeared totally different from his usual, cowardly self.</p><br/><p>\"It’s time to go home, you haven’t shown yourself the whole night, the butler is angry.\" It was in public, therefore he managed to keep calm and did not throw a fit.</p><br/><p>\"Butler? Right, oh God, I am going to get a pay cut. Master Benjamin, what’s going to happen? Am I getting a pay cut again?\" Jeremy paused for a while upon hearing Benjamin speaking, and suddenly screamed.</p><br/><p>Is getting penalized with a salary cut for not performing an employee’s duties not a normal practice? He should feel lucky that he was not fired on the spot!</p><br/><p>Benjamin’s patience was reaching its limits. The mention of the butler seemed to have some effect on Jeremy. Even though it was not enough to sober him up, but at least, he was willing to leave the pub with Benjamin.</p><br/><p>But, things would never go as planned.</p><br/><p>When Benjamin turned around and was ready to leave, a man who was around two meters tall stood up and blocked the entrance. He turned around with a fierce stare, seeming to not bear any good intent towards Benjamin.</p><br/><p>Benjamin was stunned.</p><br/><p>He turned back, seeing those few men who a moment ago, were laughing with Jeremy, all sprang to their feet. Their smiles vanished, and they stared at Benjamin with the eyes of a predator as if he was a prey.</p><br/><p>The atmosphere in the pub changed. The female boss quickly put away all the fragile items, then hurried into the kitchen for safety.</p><br/><p>Benjamin had a bad feeling about this, and was confused at the same time.</p><br/><p>What in the world?</p><br/><p>It could not be that all these people were targeting him?</p><br/><p>But what relation did he have with these people? Did he offend them?</p><br/><p>\"Ma,Master, why aren’t we leaving? If we don’t go now my salary will be cut!\" Jeremy was obviously still not sober, and had no clue of what was going on.</p><br/><p>Benjamin was still unable to respond to Jeremy. A man with a scarred face drew out a knife. He slashed a nearby chair, and had it cut into half.</p><br/><p>Jeremy was shocked into soberness, his mumbling turned into trembling: \"What, what are you doing? Weren’t we just having a nice chat? Didn’t….. didn’t you say you knew my master?\"</p><br/><p>The man with scarred face chuckled, and said: \"Yeah, I just want to get to know your master better, and I have to thank you for introducing me to him.\"</p><br/><p>Jeremy was stunned and could not utter a word.</p><br/><p>Benjamin stood there, seeming to understand what had really happened.</p><br/><p>These bunch of people used Jeremy as bait! It must be that they made something up to lure Jeremy here, got Jeremy drunk and waited for Benjamin to come here on his own.</p><br/><p>Even though Benjamin got a better understanding of the situation, he still did not know why these people wanted anything to do with him.</p><br/><p>Were they here under the instructions of someone else?</p><br/><p>Was it Dick? Someone else?</p><br/><p>He thought about how he escaped from Michelle, and the night after returning to the Lithur family, there was this strange assassin. He really wanted to know who sent that assassin, but he did not manage to find a lead. After that, he was caught up in more situations, causing him to completely forget about this.</p><br/><p>But at this moment, he somehow suddenly had a recollection of the assassin.</p><br/><p>Were the assassin and these men the work of the same culprit?</p><br/><p>\"Hey, kid. Let ask you something. Where is that lady?\" The scarred face man who seemed to be the leader asked.</p><br/><p>\"That lady?\" Benjamin frowned, \"I have no idea who you’re talking about.\"</p><br/><p>\"Stop acting stupid. Believe me, I’ll cut you in half. You think I’m not afraid of killing a nobleman?\" The man raised his volume and said this harshly, \"If you really didn’t know, why would you make your own servant search around all the places she has been by before?\"</p><br/><p>Benjamin finally understood who \"that lady\" they were referring to was.</p><br/><p>Were they looking for Michelle?</p><br/><p>Benjamin quickly rearranged his chain of thoughts.</p><br/><p>Seeing these bunch of men’s angry demeanors, it was very likely they were here for revenge. It was probably because Michelle had crossed them, and they wanted revenge, but could not locate Michelle. They somehow noticed Jeremy investigating Michelle’s abandoned sites for Benjamin.</p><br/><p>So they probably thought Benjamin had something to do with Michelle, and used Jeremy as a trap to lure him over.</p><br/><p>Thus, it all led to this.</p><br/><p>Benjamin was speechless after concluding what culminated this whole situation.</p><br/><p>Why the hell did the people Michelle offend have anything to do with him?</p><br/><p>How unlucky...</p><br/><p>\"Are you talking about Michelle? What a shame, if I knew where she was, I wouldn’t send my servant to snoop around all the places that she’s been by before.\" Thinking of this, he replied the man with a scar.</p><br/><p>If he could resolve this misunderstanding, it would be good, the enemy of an enemy could be a friend. Even though he was keen on using these bunch of people as practice dummies, but the Church’s men should be nearby, and so he would not dare to use magic.</p><br/><p>He did not want to have any conflict with these men, it would bring more trouble, and would not benefit himself either. It would only be doing Michelle a favor ----- he did not intend to do any favors for her.</p><br/><p>\"His words seem to make sense...\" Amongst the bunch of people, one of them heard Benjamin’s reply and said so.</p><br/><p>\"So she’s called Michelle, after searching for so long, we finally know what her name is.\" One of them exclaimed.</p><br/><p>\"Silence!\" The man with a scarred face shouted, stunning all his followers who were whispering. \"These bunch of noblemen are cunning, you can’t just trust what they say. We’ve been looking for that woman for so long, and finally, we have a clue, we can’t just let him go!\"</p><br/><p>\"Boss is right, looks like boss is still the smartest!\" One of them flatteringly said.</p><br/><p>\"Right, we can’t believe his words!\"</p><br/><p>These bunch of people returned their gaze to Benjamin, ready to make a move anytime.</p><br/><p>Benjamin was speechless.</p><br/><p>It looked like he was unable to get himself out of this mess.</p><br/><p>This good-for-nothing Michelle, even though she was not here, she had still managed to bring him so much trouble!</p><br/><p>These bunch of people did not heed his explanation. They were already surrounding him with their knives. Benjamin had no choice but to use his ultimate tactic.</p><br/><p>\"Help! Murder! Where are the Church’s paladins! I, Benjamin, have yet to help you capture Michelle, and is about to die here! If I were to die here your bishop would never forgive you! Help! Hurry and rush to save my life!\"</p><br/><p>He was heard screaming on the top of his lungs.</p><br/>\n</div>"}