{"title": "Chapter 62: Mysterious Map", "id": 62, "volume": 1, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-62-mysterious-map", "volume_title": "Volume 1", "body": "<h1>Chapter 62: Mysterious Map</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 62: Mysterious Map</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>It was night time. The outer city district of Havenwright started becoming more lively. The main road was bustled with people. The lights lit like stars in the sky, rendering the dark road less deadly.</p><br/><p>But, in some secluded corners, silence was still prominent.</p><br/><p>Benjamin was in that kind of secluded corner.</p><br/><p>It looked an abandoned storage area for malt wine. The sealed off area showed a sense of solitude. At the corners of the storage area, there were empty wines barrel, some fallen over and piled against each other messily. No scent of alcohol could be traced as it must be because the storage had been abandoned too long.</p><br/><p>Benjamin used one of the wine barrels as a chair. He sat on top of it and waited for Michelle.</p><br/><p>After leaving the house in the sewers, Michelle hid Benjamin in the abandoned storage. She wanted Benjamin to wait here, while she went back to the Church to observe the situation.</p><br/><p>Benjamin wanted to ask Michelle, how she managed to turn into a mage after becoming a holy knight. But Michelle only gave a look that appeared to say \"Let’s not talk about the past\", and reverted to the topic about the Church, and was adamant that she had to go back.</p><br/><p>According to Michelle, the Church would create a cross that represented each knight. The cross would be filled with divine energy, if a knight died, the cross would automatically shatter, informing the Church of the knight’s deceased status.</p><br/><p>After hearing of this, Benjamin thought that he had teleported into some sort of immortality cultivating novel.</p><br/><p>But after giving some thoughts, magic tools like these were really useful and required in managing the tens of thousands of knights. It was understandable for the Church to do so and Benjamin found no meaning to make fun of it.</p><br/><p>It was because that knight that was killed by the knife scarred man and had his cross shattered which alerted the Church. That was why they sent the squad of Cleaners.</p><br/><p>If the knights had such a system like this, then the Cleaners should be no different. The Church already knew something had happened since the death of the first Cleaner.</p><br/><p>Right now fourteen crosses had been shattered. Benjamin would not dare to imagine what the bishop’s face would look like.</p><br/><p>The Church would take extreme measures for sure.</p><br/><p>Thus, after taking Benjamin to the storage, Michelle had to return to the Church to observe the situation in the inner ranks of the Church. Benjamin had to know what the Church was up to right now, only then he could forge a story that would be convincing to the Church.</p><br/><p>Master yourself, master the enemy!</p><br/><p>Michelle made her way to the Church. Before she left, she said she should be back in two hours, thus, Benjamin waited patiently.</p><br/><p>He wanted to make use of this time to meditate, but two hours would be too short, and meditating for this short would not make much progress. Most importantly, after entering his own realm of consciousness, Benjamin’s sensitivity to the outer world would be reduced. He was afraid that if something happened he would not be able to react in time.</p><br/><p>Thus, during these two hours, he had to find something else to do.</p><br/><p>After thinking twice, he took out a map.</p><br/><p>After killing the knife scarred man, Benjamin searched his body, and found a bunch of messy items on him. There were firearm, bullets, and coins, which were kept away safely by Benjamin. He also found this map and kept it.</p><br/><p>He thought at that time that this map would be of use somehow, to let him recognize the roads. He could let the System memorize the map, and it would not waste his effort. Thus, he did not really pay attention to this map.</p><br/><p>Of course, when Benjamin took out this map to investigate out of boredom and to pass time, he noticed that this was not a normal map.</p><br/><p>Who would draw a cross on a normal map?</p><br/><p>Benjamin could not help but recollect what the knife scarred man said before he was killed. He begged and said along the line of \"I know where the elemental crystals are\". Benjamin treated that as nonsense, but now it looked like, somehow…..</p><br/><p>This was a treasure map?</p><br/><p>\"Hey, take a look at this map.\" He became serious, and spoke to the System, \"Do you know any of these places on the map?\"</p><br/><p>But, the System only replied: \"I don’t. In Benjamin’s original memories, there are no records of any place looking like the ones on the map.\"</p><br/><p>Benjamin was surprised to hear this.</p><br/><p>As a nobleman, Benjamin was well educated and would have learnt geographical related studies. He must have seen a lot of the maps of the kingdom and places outside the kingdom. Even if Benjamin could not remember these, the System could.</p><br/><p>If even the System said that it had never seen these places before, then this map must be describing a place where no one had discovered yet.</p><br/><p>Benjamin became much more interested in the map.</p><br/><p>Thus, instead of just passing his time, he now used all his concentration to study this map.</p><br/><p>On the map, most of the geographical landscapes were mountain ranges which appeared different from the western part of the kingdom. The cross was marked on a long valley in the middle of the map.</p><br/><p>Valley...</p><br/><p>\"Does the kingdom have any famous valleys?\" He asked the System.</p><br/><p>\"Yes, there are plenty.\" The System replied cheerfully, and started showing off his database, \"On the western side of the mountains, there are a few famous valleys, like the Windbreak Valley, Amber Valley, Wicked Dragon Valley…..on the northern side of the kingdom, there is a small valley called the Pearl Valley, because it is located nearby Pearl Lake, which noblemen normally go for vacation. On the east side, on the border which separates us from Icor, is the most famous Valley of the Broken Armies, the Crusader Great Arch was erected there, being the kingdom’s strongest line of defense...\"</p><br/><p>After introducing numerous valleys, the System finally concluded.</p><br/><p>\"All these valleys do not possess the landscape of that valley in the map.\"</p><br/><p>\"....\"</p><br/><p>Could it really be true?</p><br/><p>Benjamin was suddenly in a hopeless tangle.</p><br/><p>It was not because he gave up easily, it was that he believed in the database of the System very much ------ especially on things like these, the System had yet to make any errors. Thus, if it said there was not any, there for sure was not any.</p><br/><p>Unless this map was a map of somewhere outside the Kingdom of Helius?</p><br/><p>Benjamin shook his head helplessly.</p><br/><p>Oh well...</p><br/><p>No matter where it was, he guessed, it would be hard for him to find it. He could only wait till his return to the Lithur family, where he could flip through books for maps to see if he could find any clues.</p><br/><p>Right now, the map he had was not much of use.</p><br/><p>Benjamin suddenly regretted. He should not have killed that knife scarred man so quickly because he could have asked him about where this place was.</p><br/><p>But, he quickly dismissed this thought as it was just a random thought.</p><br/><p>It was no use regretting now, he could not even find this place on the map, might as well treat it as a random drawing. Treasures and whatnot only existed in fictional novels as most of them were fake.</p><br/><p>He expressed sour grapes, then kept the map away.</p><br/><p>He might as well just sit here and rest. That would not be a waste of time anyway because this afternoon had been too eventful and tiring.</p><br/><p>Thus, Benjamin sat in this abandoned storage area, after he was done looking through the map. He chatted with the System, patiently waiting for Michelle’s return.</p><br/><p>Two hours had gone past.</p><br/><p>Michelle had yet to return.</p><br/><p>In the beginning, Benjamin thought that it was just miscalculation of time on Michelle’s part. Michelle probably got the time mistaken, or that she walked slower than she normally would. However at the third hour, he felt that something was not right.</p><br/><p>Even if her estimations were not that accurate, it would not go as far apart as an hour.</p><br/><p>Michelle did not seem like the kind that would be late.</p><br/><p>Unless, something was delaying her?</p><br/><p>Time passed bit by bit, and in a while, three and a half hours had passed. Finally, Benjamin could no longer just sit here, all relaxed and patiently waiting.</p><br/><p>He knew, something must have happened to Michelle.</p><br/>\n</div>"}