{"title": "Chapter 64: The Rules of Being A Beggar", "id": 64, "volume": 1, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-64-the-rules-of-being-a-beggar", "volume_title": "Volume 1", "body": "<h1>Chapter 64: The Rules of Being A Beggar</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 64: The Rules of Being A Beggar</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>The church summoned most of the nobles?</p><br/><p>To Benjamin, this was important news at the time.</p><br/><p>In this moment, he suddenly realized: going elsewhere to gather information was useless. To find out what was going on inside the city, he had to find out from the lips of nobles like Dick.</p><br/><p>If only he could go back into the city now, things would be so much easier; but with how he looked now, how could he even step foot into the city?! Should someone recognize him, he wouldn’t be able to explain himself at all!</p><br/><p>Hence, he stopped his departing steps and turned around instead, towards to theatre once more. He slouched, trying his best to look as much like a beggar as possible so he could eavesdrop in Dick’s conversation with his workers.</p><br/><p>After what seemed like a bunch of bullsh*t and gossip about the theatre and performances, Benjamin heard this,</p><br/><p>\"Master, has something happened inside the city?\"</p><br/><p>It seemed the situation in the inner city was a matter of interest to everyone. It didn’t even take long for someone to ask a question like this.</p><br/><p>Dick answered very casually, he had no reservations as he spoke frankly,\"I’m not sure, I don’t even know what the hell the church is up to. I’m guessing that those followers of The Fallen One must have something to do with it. I even heard from someone that the entire kingdom’s holy knights have been summoned to somewhere on standby. Everywhere in the kingdom people are being moved for some big operation.\"</p><br/><p>Hearing this, Benjamin couldn’t help but shiver a bit in fear.</p><br/><p>The church is consolidating their power.</p><br/><p>What do they plan to do?</p><br/><p>While he was afraid that this sudden consolidation of power might be because of him and Michelle, upon giving it more thought, Benjamin realized that just the two of them couldn’t possibly rock the church like this.</p><br/><p>Compiling what Michelle said earlier about how she gave the Academy of Silence’s address to the church, Benjamin quickly affirmed his latter thought.</p><br/><p>Unless...the church plans to declare war on the academy of silence?</p><br/><p>Although this was an unbiased guess, Benjamin felt that it made a lot of sense. The church is already mobilizing its armies, if not for war, what else?</p><br/><p>Not just that, Michelle’s late appearance could also be explained now—she must’ve been summoned by the holy knights. She must probably be stuck in the battalions now, unable to excuse herself.</p><br/><p>Upon coming to this conclusion, Benjamin sighed a breathe of relief.</p><br/><p>If everything was truly the way as he thought it to be, then him and Michelle’s plan could be considered to have succeeded. The church probably believes that the Academy of Silence killed the Cleaners, this would clear Benjamin of any suspicion and nobody would suspect him of being a mage then.</p><br/><p>While he had no idea how Michelle did it, but the fact that she did, Benjamin was pretty happy.</p><br/><p>However...</p><br/><p>Another problem struck almost instantly.</p><br/><p>If the church really believes that the Academy of Silence killed the Cleaners, then they must also believe that the Academy kidnapped Benjamin. Now, how will Benjamin return to the Lither family then?</p><br/><p>He can’t possibly just waltz back in and say that he had been kidnapped by the Academy of Silence, who were a bunch of idiots that accidentally let him run away, and so he ran all the way back to the kingdom!</p><br/><p>A story like that, even if backed with falsified memories, would still attract the attention of the church.</p><br/><p>He needed a better, and more sensible way to get home.</p><br/><p>As Benjamin continued to think, he started walking away from the theatre. Since he had already heard what he needed to hear, he ought to stay away from Dick just in case of getting made. Plus, Dick probably didn’t know much, so there was little to no reason to stick around.</p><br/><p>As he walked away, he quickly stepped into an alley by the side of the street.</p><br/><p>\"How’re the false memories coming along?\" he asked the System.</p><br/><p>\"False memory construction complete, saving memories now...\"</p><br/><p>Benjamin cut the System before it could finish the sentence,\"alright, you can stop for now. Just now when I needed you be silent you were so keen to speak, and now when I want to let you rest, you’re suddenly hardworking again?\"</p><br/><p>\"...\"</p><br/><p>Begrudgingly, the System stopped the cycle of computing sounds.</p><br/><p>Benjamin continued,\"Look, listen to me, those false memories, I need you to make it like this: everything that happened in the beginning doesn’t change, only after I shot the gun to kill the scar-face , suddenly someone punched me in the back of my head. Since then I passed out, and no longer remember what happened after.\"</p><br/><p>The reason why he said that, was to prevent giving away too much by talking too much.</p><br/><p>As long as the false memories made it seem like he was knocked out, and that he had no idea what happened after, it was less likely the bishop would find flaws in his cover-up story.</p><br/><p>The System was silent for a while, but it couldn’t resist, and said,\"Now you’re just emulating those TV show writers who are too lazy to shoot or explain certain plot lines so they play the fainting card, leaving the audience to figure it out for themselves!\"</p><br/><p>\"You talk too much,\" Benjamin sulked.</p><br/><p>\"...my bad.\"</p><br/><p>The System finally shut up.</p><br/><p>Back to reality, Benjamin was still walking on the small alley, there were much less people around him now. Suddenly, a teenager in ragged clothes walked up to him with his hands on his waist, sternly blocking the way.</p><br/><p>Benjamin was stunned at sight of this.</p><br/><p>At the same time, another beggar-like teen walked up to him from the back, blocking his path of retreat.</p><br/><p>\"These two look like they’re on the same team,\" the System popped out of nowhere again, trying to sound wise like it had just made a profound statement.</p><br/><p>\"Are you even done with the false memories yet?! Else, get back to it,\" Benjamin commanded the System mercilessly.</p><br/><p>\"...\"</p><br/><p>The System let out what seemed like weeping sounds, and went back to work.</p><br/><p>Benjamin then focused his gaze back on the little beggar right of him.</p><br/><p>\"Is there a problem?\"</p><br/><p>The little beggar looked at him with hostility, an almost childish hostility.</p><br/><p>Then the little beggar said,\"Where are you from? Do you not know the rules? This is our area, why’re you here? Who allowed you to come here and steal our business?\"</p><br/><p>Benjamin was stunned again.</p><br/><p>He looked at his own clothes, then he finally understood.</p><br/><p>These two took him as a competitor in the begging business!</p><br/><p>When Benjamin finally got it, he wasn’t sure if he should laugh or cry. He wasn’t a real beggar, so this was definitely uncalled for. At the same time, since when did beggars start having competitors?!</p><br/><p>Under a different light, did this also mean that Benjamin’s beggar disguise was fairly convincing?</p><br/><p>He felt weirdly accomplished...</p><br/><p>\"How dare you try to steal our business with clothing like that,\" however, the beggar standing behind him had something else to say,\"do you even know how to do this? You must’ve JUST ripped your clothes didn’t you? And the dust on your face, it doesn’t even have different layers! You’re such an unprofessional and you dare insult us by trying to steal our business? What a fool!\"</p><br/><p>\"...\"</p><br/><p>Benjamin was speechless.</p><br/><p>Jeez, sorry for the sore sight, but I’m not even professional to begin with.</p><br/><p>\"You’re not going to talk huh,\" at sight of this, small beggar number one folded his sleeves, looked at small beggar number two, and said,\"by the looks of it, we need to teach you a lesson so you’ll learn not to meddle in other people’s territories.\"</p><br/><p>Small beggar number two folded up his sleeves as well, as if he was ready to rumble.</p><br/><p>At sight of this, Benjamin’s face couldn’t get anymore sour.</p><br/><p>\"You really want to fight...?\"</p><br/><p>Small beggar number one didn’t give a damn about Benjamin. He spat on the floor, and with his mid-pubescent voice, he bellowed,\"Let’s go!\"</p><br/><p>Five minutes later...</p><br/><p>\"Please stop hitting us big brother! Please... Oh it hurts... Ah it hurts so much... Please, please stop hitting us! We were wrong big brother!\"</p><br/><p>Benjamin used the tricks and skills he had learn from military training, and taught these two small beggars a good lesson with his fists.</p><br/><p>\"Friend, don’t forget about the juvenile abuse laws,\"</p><br/><p>The System seemed to want to offer sagely advice once more.</p><br/><p>\"I’m a bloody juvenile,\" Benjamin answered in a calm tone.</p><br/><p>After being beaten up in military training for the last half month, Benjamin felt like a different person. In face of these two malnourished little beggars, he felt like a demigod, as they couldn’t even find the strength to fight back.</p><br/><p>Perhaps after being continuously bashed in the military for so long, Benjamin realized that now that he could beat someone else up, it felt extra amazing.</p><br/><p>Who gives a damn if it’s small beggar number 1,2,3,4,5,6 or even ABCD, whoever dared to mess with him will have their feet broken!</p><br/><p>\"I’ll let you two go this time, but if you find trouble with me again, I will really show you!\"</p><br/><p>\"Yes...yes, yes, yes. Thank you good sir, big brother, thank you!\"</p><br/><p>Just like that, the two little beggars half ran and half stumbled away on all fours.</p><br/><p>Looking at them running away, Benjamin didn’t feel quite accomplished, instead he suddenly realized how ridiculous all this was.</p><br/><p>What was he doing here?</p><br/><p>He shook his head, and prepared to leave.</p><br/><p>\"Hey, you right there! What are you doing here? The performance is about to start, get ready. Today’s performance is incredibly important. If you botch it, you won’t just not get paid, your career will end right here!\" suddenly, a voice had come from behind him.</p><br/><p>He turned around, only to see a nicely dressed middle aged man in a fine suit yelling at him.</p><br/><p>What was going on?</p><br/><p>Benjamin could only stand there, stunned.</p><br/>\n</div>"}