{"title": "Chapter 79: How to Perfectly Explain The State of 'Forever Alone'", "id": 79, "volume": 1, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-79-how-to-perfectly-explain-the-state-of-forever-alone", "volume_title": "Volume 1", "body": "<h1>Chapter 79: How to Perfectly Explain The State of 'Forever Alone'</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 79: How to Perfectly Explain The State of 'Forever Alone'</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Benjamin was almost scared to the point where he was perspiring cold sweat.</p><br/><p>It had been a while since the day he travelled to this world. All this while, no one else, not even his own family, noticed that he was not the real Benjamin. Thus, the fear of being seen through had not been on his mind for a long time.</p><br/><p>He had long taken over the character of Benjamin. If one were to ask him who he was, he would instinctively reply that his name was Benjamin.</p><br/><p>But, today, at this moment, he was seen through by this girl.</p><br/><p>What in the world?</p><br/><p>He felt like a cat on hot bricks and as if his jaw almost dropped on the floor.</p><br/><p>Of course, he did not display all this in his expressions.</p><br/><p>\"What are you saying? I am Benjamin.\" Benjamin was so used to challenging situations like this to the extent where no matter what he was thinking, at least no one could read his thoughts from his expression.</p><br/><p>\"Is that so?\" Elizabeth wrinkled her brows, as if she was confused, but she became relaxed shortly, \"If you say you are, I guess you must be.\"</p><br/><p>\"....\"</p><br/><p>He was still unable to calm down with such a response from her.</p><br/><p>What did this attitude mean?</p><br/><p>What did she find out?</p><br/><p>He could not help but turn around to look at the people within his vicinity. Fortunately, no one seemed to notice their conversation as they were minding their own conversations and not paying any attention.</p><br/><p>Rumors like ‘Benjamin had been replaced by another’ would probably not spread.</p><br/><p>Thus, the only problem he had to deal with was Elizabeth.</p><br/><p>\"Why would you say that I’m not Benjamin?\"</p><br/><p>\"Because my guts tell me, you are not Benjamin.\" Elizabeth still blankly stared at him, not blinking, \"But you don’t have to worry, I won’t tell anyone. Even if were to tell them, they would not believe me.\"</p><br/><p>Benjamin did not know how to reply her.</p><br/><p>Could he really not worry at all?</p><br/><p>It was obvious from her reply that this girl had already seen through his identity. He did not know how she did it, but he could not just leave it be.</p><br/><p>But...</p><br/><p>What could he do? Exterminate this girl?</p><br/><p>Right when he was hesitating, Elizabeth cast her eyes on him several times. Suddenly, she spoke.</p><br/><p>\"Didn’t you ask me to dance? Let’s go dance at the second floor.\" She raised her eyebrows with anticipation, \"After tonight, I’ll be leaving Havenwright. This is the first time I wish to dance at a royal ball, of course, it would be my last.\"</p><br/><p>Benjamin was flustered to hear this.</p><br/><p>She was leaving the capital tonight? What did she mean by that?</p><br/><p>He could not tell what her intentions were at all.</p><br/><p>\"I don’t know how to dance, I’ll probably step on your feet by accident.\" He said this while still in his thoughts.</p><br/><p>\"I don’t mind.\" Elizabeth replied. She pulled Benjamin by his wrist as she spoke and dragged him upstairs.</p><br/><p>Benjamin could not react in time.</p><br/><p>What was going on? Did he really want to dance with this girl?</p><br/><p>He was hesitating and did not try to resist. Elizabeth’s dragging motion was rather firm, unexpectedly.</p><br/><p>He was taken to the second floor of Ross’ restaurant before he could say Jack Robinson.</p><br/><p>On the second floor, it was a rather spacious ballroom, and there were already plenty of people dancing in the centre of the ballroom. They were all dancing in pairs. A band was playing at the side with a few of them playing the violin and creating joyful melodies.</p><br/><p>Benjamin could not decline in time, and was dragged into the crowd by Elizabeth.</p><br/><p>In the middle of the dance floor, dancing pairs twirled past them, the women and their hair swung past like water. Benjamin felt like a crow in a pack of geese, not knowing what to do.</p><br/><p>\"I….really don’t know how to dance.\"</p><br/><p>Elizabeth looked at him, nodded, her eyes glowing.</p><br/><p>\"Doesn’t matter, I don’t know either.\"</p><br/><p>She dragged Benjamin by the hand as she spoke, guiding Benjamin into a ballroom dancing position. Benjamin did not know what to do, but under undue pressure from the crowd, he imitated the people around him, clumsily displaying a pose.</p><br/><p>He raised both of his hands, one holding Elizabeth’s hand, one interlocking her wrist.</p><br/><p>Right at this moment.</p><br/><p>The music ended after a pitchy sound emerged from the violin.</p><br/><p>The dancing pairs at the dance floor abruptly displayed their last pose of the ballroom dance. The dancing stopped, and the crowd dispersed, as if it was half-time and everyone was preparing to rest.</p><br/><p>Benjamin was stunned.</p><br/><p>The song ended?</p><br/><p>Elizabeth turned around, and looked at the band at the corner of the dance floor who were putting down all their instruments to rest. She gave a disappointed look.</p><br/><p>\"Looks like no matter where I go, I’ll never earn anyone’s favor.\"</p><br/><p>She shook her head, her voice filled with regret, and suddenly said, \"Oh well, you didn’t want to dance with me anyway, I have to go, but you don’t have to worry about me telling anyone about what happened tonight, this is my final night in the capital.\"</p><br/><p>She let go of Benjamin’s shoulders as she spoke, turned around, and walked away as if she really meant to leave.</p><br/><p>\"You…..\" Benjamin suddenly called out, not knowing how to continue.</p><br/><p>Upon hearing that, Elizabeth stopped, turned around, and smiled.</p><br/><p>\"There are a few rooms connecting the second floor to the rooftop, please don’t go to the sixth room.\"</p><br/><p>After leaving with her farewell message, she continued her walk to the stairwell, went down, and left.</p><br/><p>Wha…... what?</p><br/><p>Benjamin was extremely confused.</p><br/><p>\"Sigh.\" Suddenly, the System’s voice came from within his heart, with a disappointed tone, it said, \"You idiot, you’re doomed to be forever alone.\"</p><br/><p>\"...\"</p><br/><p>When Benjamin came back to his senses, he realized it was only him standing there in the middle, alone, stupidly reaching out his hands. He could feel the gazes of the other people, and he hurriedly left the center.</p><br/><p>After some thought, he walked to the stairwell, and went down to the hall on the first floor.</p><br/><p>The royal ball was still the same, the smell of food wafted all over the place, and people were everywhere, the noise of chatter did not cease. Benjamin stood at the end of the staircase, looked around the crowd, but could not see Elizabeth anywhere.</p><br/><p>She really left.</p><br/><p>Not knowing why, Benjamin felt a weird sensation.</p><br/><p>How…..bizarre.</p><br/><p>He walked to the center of the hall without realizing it when he was lost in his thoughts.</p><br/><p>The surrounding people had alcohol flushes on their faces, their conversations turned from small talk into gossip about other families.</p><br/><p>What was strange was that Benjamin was not in the mood to eavesdrop.</p><br/><p>Why?</p><br/><p>Suddenly, he diverted his attention to the dining table.</p><br/><p>Benjamin realized.</p><br/><p>He was hungry.</p><br/><p>He had yet to eat dinner, no wonder he felt strange ---- it was because he was starving and could not think properly.</p><br/><p>He did not care about his nobleman etiquette any longer; he took a plate of steak and started chewing on it. While eating, he snatched a glass of champagne from a waiter that passed by and downed it.</p><br/><p>Exhilarating!</p><br/><p>Feeling the air bubbles with spiciness spread through his mouth, Benjamin could not help but exclaim his pleasure.</p><br/><p>\"Big idiot, forever alone.\" The System exclaimed this in his head with a tone of helplessness.</p><br/>\n</div>"}