{"title": "Chapter 88: Dueling with the Rich Priest", "id": 88, "volume": 1, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-88-dueling-with-the-rich-priest", "volume_title": "Volume 1", "body": "<h1>Chapter 88: Dueling with the Rich Priest</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 88: Dueling with the Rich Priest</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>The fourth bullet was aimed at the priest.</p><br/><p>But it wasn’t that the priest had amazing reflexes to block the bullet with the divine arts. It was that when the bullet was about to hit him, a Holy Barrier suddenly appeared. The Blessed bullet hit and broke the glinting barrier, but the bullet itself was nudged off course.</p><br/><p>That was why the priest survived the deliberate surprise attack.</p><br/><p>Frankly, Benjamin did not expect that the priest would have defensive magical instruments.</p><br/><p>Fortunately, he did not expect to kill off all four of them by merely using bullets. He was still mentally prepared for this. As this was an ambush, he was still a step ahead.</p><br/><p>\"What’s going on? You-\"</p><br/><p>The priest just realised what happened after he looked at the Holy Knights lying on the floor around him. He turned around in shock and looked at Benjamin, who stood firmly by the door.</p><br/><p>Instead, what he saw was 6 water bombs.</p><br/><p>Wham!</p><br/><p>Water splashed everywhere as it drowned the priest.</p><br/><p>But Benjamin did not relax.</p><br/><p>He could clearly see via the Water Particle Detection that another cross that hung on the chest of the priest broke into pieces when another Holy Barrier appeared to block the attack. The stunned priest was safe under its protection.</p><br/><p>\"Fuck...\"</p><br/><p>Benjamin could not help but curse.</p><br/><p>How many magical instruments does this priest have on him?</p><br/><p>It blocked the bullet and the 6 water bombs; this tiny thing single-handedly ruined his perfect plan of attack and his brilliant usage of timing!</p><br/><p>Benjamin felt like he was going to spit blood.</p><br/><p>\"Fourteen,\" the System appeared out of nowhere and commented, \"I scanned him and counted when he arrived. There are a total of fourteen similar crosses on him. I’m not sure if all of them have similar functions, but based on what we’ve seen, it’s very likely so.\"</p><br/><p>\"...\"</p><br/><p>…Fourteen?</p><br/><p>Holy-mother-of-God-fourteen?</p><br/><p>How rich was the Church for them to allow a random priest to carry fourteen life-saving magical instruments when he was out for a check?</p><br/><p>Is this even considered a fight? They might as well just throw money at both parties, and the side with the most money will win the fight.</p><br/><p>Benjamin looked dismayed.</p><br/><p>In a blink of an eye, the splashes of water disappeared with the barrier, and the silhouette of the priest was visible again. Now, the priest had wiped away his amiable face and was currently scowling at Benjamin. Holy lights gathered in his raised arms.</p><br/><p>Benjamin’s heart froze at the sight.</p><br/><p>The enemy will start retaliating soon.</p><br/><p>Judging from the astonishing amount of tools he had, it was evident that he will put up a hard fight against Benjamin.</p><br/><p>Perhaps he was still surprised that the beggar he saw at the lobby turned out to be a mage and killed off all his companions. He nearly died in the attack, too.</p><br/><p>But now, he will no longer hesitate.</p><br/><p>The holy light in his hands symbolised his fury towards Benjamin.</p><br/><p>In a flash, a Grenade Holy Light was formed with a simple incantation. He aimed both of his palms at Benjamin, his face as dark as the ice under the deep sea. The Grenade of Holy Light flew towards Benjamin like a shooting star slicing across the sky.</p><br/><p>Benjamin did not panic.</p><br/><p>This was just a Grenade of Holy Light; he could hold his ground when he was faced with the Sword of Holy Light that combined all the powers of the Cleaners! What could a Grenade of Holy Light do to him?</p><br/><p>But he did not rest when the priest was using the Grenade of Holy Light. Before him, a clean, thick wall of ice materialized out of thin air and shielded him from the priest.</p><br/><p>The Grenade of Holy Light hit the Ice Wall.</p><br/><p>In that instant, the holy lights, which looked like solid spears, splashed around the room like water.</p><br/><p>The Ice Wall that was as clear and smooth like a mirror now has an impact crater on it. Cracks covered the Ice Wall, but it did manage to block the Grenade of Holy Light. Benjamin was not harmed by that attack.</p><br/><p>Not only that, some of the holy lights lost control after the impact and was reflected back to the priest.</p><br/><p>Benjamin could not help but laugh coldly at this.</p><br/><p>Who told you to be arrogant? Who told you to be rich? Hmph!</p><br/><p>After his previous encounter with the Sword of Holy Light, he was more meticulous when he condensed this Ice Wall. Not only could this Ice Wall block the Grenade of Holy Light, it could even reflect it!</p><br/><p>Stunned, right? Good, it is time for you to have a taste of what it feels like to be fighting against yourself!</p><br/><p>It was evident that the priest never imagined this result. When he faced the reflected holy lights, he could not react with his Divine Arts in time. Instead, he clumsily leapt to the side and rolled on the ground, barely avoiding the attack.</p><br/><p>A hole appeared when the holy light hit the ground where the priest was standing.</p><br/><p>\"Oh?\"</p><br/><p>Benjamin stopped ridiculing him when he saw this.</p><br/><p>The priest has impressive reflexes, huh.</p><br/><p>He assumed that these ministers were fighters with 0 agility points who only knew how to stand like a pole and shoot like ‘piu piu piu’. Surprisingly, this priest could dodge this attack entirely by just jumping aside. He must have had quite some battle experience.</p><br/><p>He wanted to rely on the holy lights to burn out another one of the priest’s magical instruments.</p><br/><p>Now, he might have to take it into his own hands to do this slowly and steadily.</p><br/><p>But the reflected holy light still had its uses. Benjamin wanted to use this opportunity to once again be in the lead. He took the opportunity to chant the Icebreaking Spell when the priest was still rolling on the ground, too busy to retaliate.</p><br/><p>As the water particles gathered, a glinting Sword of Ice materialised in his hands. Under the influence of Benjamin’s mind, the sword few around him like an energetic falcon.</p><br/><p>Yup. This was a skill he invented by mirroring the Sword of Holy Light.</p><br/><p>The fight he had with the Cleaners did provide him much inspiration for his future battles.</p><br/><p>Before the priest could steady himself, the Sword of Ice paused momentarily before it slashed mercilessly at the priest under Benjamin’s control.</p><br/><p>However, the priest did not look afraid when he raised his eyes to look at the Sword of Ice. When he faced the sudden assault, another cross exploded in front of his chest and transformed into another Holy Barrier. It blocked the attack effortlessly.</p><br/><p>Benjamin smirked slyly.</p><br/><p>This was exactly what he wanted.</p><br/><p>Why else would he choose to attack with the Sword of Ice instead of other spells?</p><br/><p>The advantage in using the sword was that it could be used for continuous attacks, strike after strike. That was why Benjamin did not focus on its critical strike abilities when he made the sword. Instead, he focused on its strength and durability.</p><br/><p>This was the most direct and effective way to waste the enemy’s defence instruments. He never imagined that he could experience the feeling of manipulating a flying sword in this world as if he were in a fantasy martial arts novel.</p><br/><p>The Sword of Ice made some minute adjustments in the air and was quick to slash a second time to break the Holy Barrier.</p><br/><p>But the priest also used this opportunity to adjust himself and chant a spell. As the holy light gathered in front of him, a golden shield appeared out of thin air, levitating before him. It looked like a fish swimming in the water, moving animatedly in a vertical fashion.</p><br/><p>Benjamin narrowed his eyes and his expression turned serious at the sight.</p><br/><p>He recognised this specific charm.</p><br/><p>\"The Shield of the Holy Spirit.\"</p><br/>\n</div>"}