{"title": "Chapter 92: Mercenaries", "id": 92, "volume": 1, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-92-mercenaries", "volume_title": "Volume 1", "body": "<h1>Chapter 92: Mercenaries</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 92: Mercenaries</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>\"Me? I am nobody but a normal old man.\"</p><br/><p>The old man answered without looking back.</p><br/><p>Benjamin was obviously unsatisfied with this answer.</p><br/><p>\"Just a normal old man?\" Benjamin snickered and immediately asked: \"Would the leader of Mount North Bandits find a normal old man for help when they were invaded by the church? Would a normal old man be brave enough to go against the church? Stop the bullsh*t.\"</p><br/><p>The old man smiled and answered: \"You must not simply state things, young man. I did not go against the church. You are the one who killed those four people.\"</p><br/><p>Benjamin shook his head.</p><br/><p>He was starting to get impatient with the old man’s act. The old man and him were considered comrades the moment those four people were killed. Letting him in on these details should be expected. Is it even meaningful to play this kind of word game?</p><br/><p>He stopped walking and nonchalantly said: \"You are currently sheltering an assassin from an opposing country who had attempted to kill the Pope. If this is not going against the church, what is?\"</p><br/><p>With these words out of his mouth, the old man stiffened and finally stopped walking.</p><br/><p>With his back against Benjamin, he stood there quietly for a while and sighed out of nowhere. He then turned around with a very stern look on his face. \"You’re no simple man. You know about the Pope’s attempted assassination even though this news was not announced to the public.\"</p><br/><p>Benjamin shrugged and said confidently: \"Thank you. I know I’m remarkable.\"</p><br/><p>\"...\"</p><br/><p>Perhaps the old man had not seen someone who was so shameless that he was shocked. It took him a while to absorb Benjamin’s statement. He looked at Benjamin and the assassin he was carrying and sighed a couple of times.</p><br/><p>He finally spoke.</p><br/><p>\"Who am I... It is a long story.\" he stared at the lantern on his hand as if he was thinking of something, something that no one knew.</p><br/><p>However, Benjamin said: \"It’s alright. You can talk while we’re walking and I will listen. It’s boring in this secret passageway anyway.\"</p><br/><p>The old man chuckled upon hearing the answer. He then turned around and continued walking down the passageway. Benjamin quickly followed.</p><br/><p>The voice of the old man echoed leisurely through the passageway.</p><br/><p>\"There is nothing to talk about actually. It is all in the past and even I have forgotten many of them. I honestly don’t even know what my name is anymore. People have been calling me Chief Silverfox, so I became Chief Silverfox.\" He then continued with a self-deprecating tone and said, \"Truthfully, I did not want to help the bandit of Mount North but his father saved my life back then when I was a mercenary. Hence, I have the duty to take care of him even if he had become a bandit.\"</p><br/><p>Benjamin furrowed his eyebrows at this point of the story.</p><br/><p>Mercenary?</p><br/><p>He knew what a mercenary was, but to his knowledge it was an occupation that had not existed in the kingdom of Helius for a long period of time.</p><br/><p>This was all due to the Church’s hard work.</p><br/><p>The Church believed that the ministers and the holy knights were more than enough to protect the citizens of the kingdom from being invaded by magical creatures. They also felt that the mercenaries were hard to manage and prone to teaming up with mages as they were usually not bound by any organizations. They used these as excuses to exterminate all the mercenary’s bases back in the days. The commoners of this would not even know what a mercenary was if one were to question them.</p><br/><p>And this old man was a mercenary back in his prime days?</p><br/><p>The mercenaries were people who risked their lives on the daily basis.</p><br/><p>It was now clear why he was very calm when he went against the church’s henchman and did not hesitate when he cooperated with Benjamin.</p><br/><p>\"You don’t see any mercenaries anymore in the kingdom these days. The church had not started cleaning up the mercenaries yet when I was at my prime. One out of five people, especially near the west of the mountains, was a mercenary.\" Traces of nostalgia could be heard in the old man’s voice. \"Now… there’s nothing left. Everybody said I would live a long life, but no one expected that I would live for so long. Those battle buddies back in the days are either dead or have left this kingdom. I am the only one left alive with no purpose in this realm.\"</p><br/><p>Benjamin could hear loneliness in his voice.</p><br/><p>Truthfully, he could not believe that the old man had once led an extremely dangerous lifestyle. Judging from the special position the old man was currently in, he must have been an excellent mercenary back in his days.</p><br/><p>That was why he was called the Chief Silverfox, someone who was more superior than a typical gang leader.</p><br/><p>The old man stopped his story for a while at this stage and laughed softly, and then continued: \"You know, you will befriend all kinds of people after being a mercenary for more than a decade. You will be in a special position where there will be strange and mysterious people asking you for help once you have a lot of friends. I’m not lying when I say that I’m just a normal old man. I would have died in the Church’s hand if not for these people’s assistance. You may feel that I am a very special person, but I am actually just repaying the debts I have owed.\"</p><br/><p>Benjamin nodded his head as if he was deep in thought after hearing him out. However, his thoughts have drifted away to other concerns.</p><br/><p>Benjamin could only guess how the Church repressed the mercenaries based on the rumors he heard occasionally back then. Now, he could not help but to think that it involved bloodshed when he heard the old man’s story.</p><br/><p>He could not help but to think of what the Church was doing to the aristocrats now.</p><br/><p>These two actions seemed to be similar.</p><br/><p>So… It started from the mages and then the mercenaries. The aristocrats were their next target.</p><br/><p>For so many years, the Church has been making small moves, only changing their target over time. All the unstable elements in the kingdom were suppressed one after another.</p><br/><p>Benjamin could not help but think that the word \"aristocrats\" would be foreign to everyone in a few decades if the church did not stop their actions.</p><br/><p>However, if the church really were to completely eradicate the aristocrats’ power and build a purely religious kingdom, it might require the church to exert some extraordinary power and skills in order to achieve that.</p><br/><p>Someone would definitely stop the church.</p><br/><p>At the very least, the aristocrats with power would definitely not let it happened very easily. Although the aristocrats looked like they have surrendered, they would definitely plot their countermeasures in the dark. This is the true strengths of the aristocrats.</p><br/><p>Perhaps, at this moment, the powerful aristocrats are having a meeting now.</p><br/><p>Benjamin was thinking of these.</p><br/><p>At the same time, somewhere in the kingdom.</p><br/><p>There was actually a secret meeting by the kingdom’s aristocrats to curb the Church’s intention to remove their power.</p><br/><p>There was a remote house in a small village in Pearl Valley, located at the northern region of the kingdom. Although it looked like an abandoned house, there was quite a crowd gathering inside it.</p><br/><p>If Benjamin was there, he would recognize a few familiar faces such as Accius Fulner.</p><br/><p>There were about ten to twenty people in the room. With the exception of the Lithur household, all of the aristocrat’s representatives of the highest status in the kingdom were present.</p><br/><p>They gathered at the round table and they seemed to be in discussion.</p><br/><p>\"Duke Accius, are you sure the church does not know that we have gathered here? The church will definitely come for our heads if today’s gathering were to be leaked to the public, even in the slightest.\" One of the aristocrat voiced out his concern.</p><br/><p>Accius Fulner smiled and replied, \"Don’t worry. The purpose of sending the thirty plus aristocrats to cause trouble this morning was to divert the church’s attention from us. As long as all of you do not spill the beans to the kids who are ‘wearing’ the cross, the church will know nothing about it.\"</p><br/><p>After hearing this, everyone stopped feeling anxious.</p><br/><p>\"There’s no other choice. The royal family and the church have crossed the line. If this continues, there won’t be a place for us left in this kingdom.\" A middle-age aristocrat with a face full of beard said angrily.</p><br/><p>\"That’s right, Duke Evan.\" Accius agreed full heartedly as he nodded. \"The church believes that we have no more army left, and after they planted the traitor in the Lithur household, they think they can do anything to us. We have to show them that even though they have their swords and holy lights, we have our way of getting things done.\"</p><br/><p>Everyone in the crowd nodded in agreement.</p><br/><p>It looked like the aristocrats were extremely unsatisfied with the church’s actions.</p><br/><p>\"Speaking of the Lithur household.\" An aristocrat with a head full of white hair suddenly said, \"Duke Fulner, do you remember what happened at the theater half a month ago?\"</p><br/><p>Accius shook his head and scornfully said: \"How can I forget? I spent so many years, countless money and labour to produce those mages. I could only hand them to the church when they gathered at the theater because someone leaked it to the church. I have nightmares related to this every night when I go to bed. How can I forget this?\"</p><br/><p>The white-haired aristocrat nodded and said, \"I received a news this afternoon. I know who betrayed you to the church.\"</p><br/><p>\"Who?\" Accius immediately asked anxiously.</p><br/><p>The white-haired aristocrat paused a while and slowly said: \"It’s the old madame from the Lithur household.\"</p><br/>\n</div>"}