{"title": "Chapter 93: The Awakened Assassin", "id": 93, "volume": 1, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-93-the-awakened-assassin", "volume_title": "Volume 1", "body": "<h1>Chapter 93: The Awakened Assassin</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 93: The Awakened Assassin</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Benjamin and the old man were still moving about in the secret passageway at the outskirts of Havenwright.</p><br/><p>Throughout the journey, Benjamin listened to many stories about the old man’s youth: His adventurous days as the mercenary, the whole process of the church raiding the mercenaries and how he escaped away from the church…</p><br/><p>The old man’s story was scattered here and there, but within these short stories, Benjamin could tell how prosperous the mercenaries were in the kingdom. They were adventurers with unique skills, and heroic tales of them fighting against magical creatures became legends cited by poets....</p><br/><p>Benjamin was absorbed by the stories.</p><br/><p>However, the old man was not just boasting about the glorious days of his youth.</p><br/><p>He even explained how he became the man he currently was.</p><br/><p>According to him, after he retired from being a mercenary, he used his savings to open a hotel, hoping that he could live a normal life. However, just like the knife-scarred man, his life will never be peaceful due to the connections he made from his past life.</p><br/><p>When his old friends come to him for help, he did not have the courage to reject them. But to help these friends, he had to seek for favors from others, so he ended up owing more \"debt.\"</p><br/><p>He became trapped within the cycle of oweing and repaying debts. In the meantime, he created a reputation for himself in the outskirts. Everyone said that Chief Silverfox has a very wide network and one could find him for help if one faced any trouble. The old man had also been trying to reject requests from those who had no relationship with him, but somehow, there would always be people coming up to him with some form of connection, and he had no choice but to assist them.</p><br/><p>As Benjamin listened on, he could not help but to think that the trade between the old man and him was no different from that.</p><br/><p>It was a helpless lifestyle where he could not do as he wished.</p><br/><p>Some time had passed as the old man continued his story. They had been walking in the dark secret passageway for almost half an hour. They even changed the wick of the lantern once. Luckily, the old man said that the exit of the passageway was just around the corner.</p><br/><p>Benjamin still doubted him.</p><br/><p>\"What is your purpose for doing all of these today?\" Benjamin asked as he wiped off the sweat on his head. \"Your reputation is already well known in the outskirts. The church will definitely hunt you down since four of their people died in your hotel. Is it worth it to abandon your hotel that you have been managing for so many years for a foreign assassin?\"</p><br/><p>No one could blame him for all the perspiration since it was tiring to walk for such a long distance while carrying a person.</p><br/><p>Although the assassin had been unconscious all these while, his presence was still very strong. This was the reason why Benjamin asked the old man such a question.</p><br/><p>\"Is this how you view him? An assassin from another country?\" The old man laughed as he replied.</p><br/><p>\"Don’t get me wrong. I am very impressed with him. Whoever dares to attempt at assassinating the Pope is considered a brave warrior, no matter where he is from.\" Benjamin quickly clarified himself. \"And I am curious because of it.\"</p><br/><p>\"... A brave warrior? The old man sighed as he responded softly. It was not clear whether he was talking to himself or responding to Benjamin’s question.</p><br/><p>Just as Benjamin was looking forward to the old man talking about the assassin, he felt sudden movements from the man on his back.</p><br/><p>Did the injured and unconscious assassin finally come to his senses?</p><br/><p>\"Are you awake?\"</p><br/><p>He stopped, turned his head and softly asked the assassin. Similarly, the old man stopped and turned around as well.</p><br/><p>The strangely-injured assassin did not answer him, as if he had yet to fully awaken.</p><br/><p>Benjamin carefully put him down and let him lay flat on the ground in the secret passageway.</p><br/><p>He rubbed his shoulder after placing the assassin down, for his shoulders were aching after carrying him for a long period of time.</p><br/><p>At the same time, he used this opportunity to take a quick rest.</p><br/><p>The old man did the same. With the lantern in his hand, he walked in closer with a tense look on his face.</p><br/><p>The assassin’s breathing rhythm became very unstable under the light of the lantern. Then, unintelligible words came out from his mouth when he slowly opened his eyes.</p><br/><p>His eyes remained half open. His ill complexion made him look exhausted. He looked like he was not fully awake, or if he was awake, he was too weak to fully open his eyes.</p><br/><p>\"Are you okay?\" Benjamin asked</p><br/><p>The old man in front of him sighed again.</p><br/><p>What was the situation here?</p><br/><p>As Benjamin was thinking why the old man kept sighing, the unintelligible words coming out from the assassin’s mouth grew louder.</p><br/><p>\"It’s… all conspiracy. Her Highness the Queen… Don’t believe them… It’s all... The Church’s conspiracy…\"</p><br/><p>Benjamin was confused.</p><br/><p>What did these sentences mean?</p><br/><p>Did the assassin see what the church had been plotting? Also… What kind of plot had to do with the \"Her Highness the Queen\"?</p><br/><p>... Yes my king, no problem, my king?</p><br/><p>Judging from this incoherent speech, Benjamin could tell that the assassin was not fully awake.</p><br/><p>It was indeed a mysterious injury.</p><br/><p>\"By Her Highness the Queen, I think he meant the Queen from Icor.\" The System suddenly voiced out in his mind and explained, \"Icor is the closest country to the Kingdom of Helius and the relationship between these two countries is not the best. On this continent, only Icor has a queen.\"</p><br/><p>Icor…</p><br/><p>Benjamin finally managed to connect all the pieces together.</p><br/><p>Was this assassin sent by the Queen of Icor?</p><br/><p>However, Benjamin was very curious about the \"church’s conspiracy\" as mentioned by the assassin. The church had been busy dealing with the mages and aristocrats. Did they still have the energy to plot a conspiracy?</p><br/><p>Benjamin was still pondering on this thought when the assassin’s condition changed.</p><br/><p>The pale-faced assassin opened his eyes wide suddenly and stared straight ahead, as if he saw something horrifying.</p><br/><p>The assassin’s body then started to tremble. However, his mental state did not change as he was still spewing unintelligible sentences out of his mouth. It was as if he was possessed by a ghost under the lantern’s light.</p><br/><p>Random sentences started coming out of his mouth.</p><br/><p>\"Lord Ethan… Immortal Body… Her Highness the Queen… Church… Conspiracy… Abel… Hidden… Fake… Pope…\"</p><br/><p>Benjamin was shocked by the situation.</p><br/><p>Was this the so called soul injury?</p><br/><p>He tried to be the Sherlock Holmes as he attempted to deduce the words that came out from the assassin’s mouth. However, he came up with nothing useful even though he thought of many bizarre theories.</p><br/><p>Who was Lord Ethan? What did he mean by Immortal Body? Was he referring to the Queen or did he mean that the Pope had mastered the Immortal Body? What did he mean by fake? Did that mean the Pope was a fake? How were all of these related to Abel and being hidden?</p><br/><p>This plot was too confusing…</p><br/><p>He could not deduce anything as he was not a detective.</p><br/><p>\"He has been like this for the past ten days.\" The old man said as he looked at the possessed assassin. \"He came to my hotel ten days ago and the only word he told me was ‘save me’.\" He then fainted on the ground even though he had no physical injury on his body. I did not dare to bring him to the doctors so I searched for information by reading up some books. After a few days, I found out that it was because his soul was injured.\"</p><br/><p>With the assassin’s crazy talk and the old man’s words, the entire atmosphere felt heavy for some reason.</p><br/><p>After a moment of silence, Benjamin jokingly said: \"You are so enthusiastic in lending a hand that you would even risk your life to save a stranger who fainted in front of you. Next time if I were to be seriously injured, I would faint in front of you no matter what.\"</p><br/><p>He tried to joke around to release the tension brought upon them by the assassin.</p><br/><p>Very soon, he started to regret saying such a joke.</p><br/><p>This was because the old man laughed after listening to Benjamin’s joke and he replied Benjamin with a half serious tone: \"Yes. Why do I always butt into other people’s affair? If only he was not my son that I have not seen for the past thirteen years.\"</p><br/>\n</div>"}