{"title": "Chapter 108: A New Camouflage", "id": 108, "volume": 2, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-108-a-new-camouflage", "volume_title": "Volume 2", "body": "<h1>Chapter 108: A New Camouflage</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 108: A New Camouflage</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>But this was not the answer Benjamin was hoping to hear.</p><br/><p>They caught someone? What the hell?</p><br/><p>He was still standing here, so who did the Church actually capture?</p><br/><p>In his expectations, the Church would not give up on this matter just because they could not capture any one. He never thought that the Church would come up with an answer like this.</p><br/><p>Unless...they caught the wrong person?</p><br/><p>After thinking about this, Benjamin had another question: \"That…..that really important piece of letter, did they find it as well?\"</p><br/><p>Jeremy nodded and said: \"Yes, according to the bulletin given by the Church, the letter has been retrieved, this assassin from the neighboring country will not cause much trouble, so people should not panic.\"</p><br/><p>\"...\"</p><br/><p>Bullshit!</p><br/><p>That letter was clearly taken away by Benjamin, he even destroyed it with his own hands. The Church was saying that they retrieved the letter, where on earth did they find it?</p><br/><p>At the moment, Benjamin knew the Church was bluffing.</p><br/><p>They did not find anyone, but because they had too many pressing matters and did not have the ability to continue their search, the Church gave out a bulletin saying they had found that person after thorough searching just to save their own faces.</p><br/><p>Right...this was most likely the case.</p><br/><p>Benjamin also thought about the fact that they captured the wrong person. But if they caught the wrong person, why did they have to say that they retrieved the letter?</p><br/><p>Of course, it could be that this kind of manhunt has been blown out of proportions, and they could not find the person. They purposefully created this piece of fake news to make the person who took the letter to let their guard down, but still continue the search behind the scenes.</p><br/><p>But, the possibility of this was not huge.</p><br/><p>In this period of time, the Church has expended all their manpower. The nobles were causing trouble for them by secretly recruiting people to stir up issues in the territories outside the city, making faithful believers begin questioning the Church. Thus, Benjamin thought that the Church did not have the time to chase after the letter at all.</p><br/><p>He thought the Church overstepped their boundaries, and it looks like they were in trouble now.</p><br/><p>The nobles in the kingdom were like a piece of sugared beef jerky. What could they do? They could not really do much. If you were to ignore them, they would annoy you to death.</p><br/><p>The Church should be busy in managing their holy knights right now to settle the chaos brought by cleansing the nobles – perhaps they will take this opportunity to cleanse a few more noble families.</p><br/><p>It took a lot of effort to do all these.</p><br/><p>Even if they were looking for the letter, the people they could assign to do it was probably not many.</p><br/><p>To be honest, the Church should not have interfered in the three counties. The inner ranks of the kingdom still had many unsolved problems, yet they still went ahead to Carretas to create more problems for themselves. Their whole operation would fall apart if there were any mistakes.</p><br/><p>Benjamin became that small mistake that stopped their gears from turning.</p><br/><p>At this moment, he suddenly realized that when he took the letter away, he changed the structure of a few countries by accident as well.</p><br/><p>The Church could not retrieve the letter, and naturally they would believe it was leaked to Icor or Ferelden. Carretas and their underground societies would be revealed in no time. Thus, the Church had to give up their alliance with Carretas to attack the other two countries.</p><br/><p>It looks like he had helped the other two countries by accident.</p><br/><p>Right...it was not bad being an unsung hero anyway.</p><br/><p>After some thought, Benjamin quickly got rid of this idea.</p><br/><p>No matter what action the Church planned to take after this, he felt that he could not just sit around. Ten days can be counted as a guarantee period. If he dragged on, even if the message left by the \"silver fox\" was not seen by another person, its effectiveness would be lost.</p><br/><p>He had to go to the Prison Ruins.</p><br/><p>It was not that he was being overconfident and not taking the Church seriously. He knew very clearly that the situation the Church was currently in did not permit them to care about the \"beggar\" who stole the letter. This was why Benjamin made the decision.</p><br/><p>Of course, he was not a clumsy person, he would not just do something without preparation.</p><br/><p>After Jeremy was done cleaning the room, Benjamin called him over, and made him prepare a carriage to the outer city. After Jeremy left with his orders, he went to the mirror to change the way he looked.</p><br/><p>----- He wanted to make himself look more like Grant.</p><br/><p>That’s right, the beggar outfit no longer came in handy, so he had to use another costume.</p><br/><p>He opened a bottle of hair wax, and spread it all over his hair. His covered forehead was exposed. He put on a black suit, wore a tie, and put on shiny leather shoes, then proceeded to look at the mirror.</p><br/><p>...He really looked like a young homosexual man.</p><br/><p>Why did he not notice this previously?</p><br/><p>It was probably because the chuunibyou vibes Grant gave out covered his gayness, so he was unable to tell.</p><br/><p>Benjamin took a deep breath, and got rid of the chills he felt, turned around, and left the room. He walked towards the main door.</p><br/><p>Very quickly, he got on the carriage that Jeremy prepared and arrived at the outer city.</p><br/><p>He made the carriage stop on a street that was close to the abandoned site, then he got down, made the carriage leave, and left for the Prison Ruins</p><br/><p>Pretending to be Grant actually brought about many benefits. No matter if it was in the noblemen’s circle or the inner ranks of the Church, Grant had a special position. If he were to run into someone from the Church, Benjamin could totally exert his power over those priests and holy knights.</p><br/><p>Plus, he could say he was here to help with the investigations. With this, even if the site had people from the Church, he could just strut in and look around. He would be able to decipher that the message that \"silver fox\" gave him.</p><br/><p>It was ...perfect.</p><br/><p>After thinking about this, he arrived at the Prison Ruins.</p><br/><p>The area around the site looked deserted, but Benjamin did not let his guard down. He thought he could use the Water Particle Detection and the reverberations from the water elements to first scout the area before heading deeper towards into the site.</p><br/><p>As expected, when he was about to arrive at the secret entrance, he ran into people from the Church.</p><br/><p>The two holy knights blocked his way.</p><br/><p>\"Who are you, you are not allowed...\" One of the knights said this, but after he saw Benjamin's face, his face changed and the remaining words were stuck in his mouth.</p><br/><p>The other knight walked closer. With some suspicion, he looked at Benjamin and unbelievingly said: \"Are you...Sir Grant?\"</p><br/><p>Benjamin imitated Grant and nodded.</p><br/><p>\"It is I, what’s wrong, are you both still here on behalf of that case?\"</p><br/><p>Grant did not have a strong personality, thus, it was not hard for Benjamin to imitate ----all he had to do was use a youthful tone to speak.</p><br/><p>Hearing this, the two knights looked at each other, then one of them turn around and said: \"Sir Grant, at this moment…..you should be with the bishop, or your mother. Why….why are you here?\"</p><br/><p>...Really?</p><br/><p>After hearing this, Benjamin was flustered.</p><br/><p>When he left, Grant was not at home, and the whole Lithur family household was quiet. If he did not remember wrongly, Grant should be resting today, and not be at the Church practicing the divine arts.</p><br/><p>What did these two holy knights mean? Grant was not supposed to be here?</p><br/><p>Was he exposed?</p><br/><p>Even though he felt guilty, his facial expressions did not give him away.</p><br/><p>\"The Bishop made me come here.\" He said with a kind smile, \"The Bishop made me come over to investigate the matter.\"</p><br/><p>Hearing this, the two holy knights looked at each other again.</p><br/><p>\"I see...\" One of the holy knights nodded and smiled back at Benjamin, saying: \"Alright, Sir Grant, come over here. Over there is the secret passage leading to the hotel.\"</p><br/><p>Saying this, he pointed at the direction for Benjamin.</p><br/><p>Of course, Benjamin knew where to go, but at this moment, he was pretending to be Grant. Thus, he politely nodded, and smiled at the two holy knights as a token of appreciation.</p><br/><p>Then, he walked towards the direction of the secret passage.</p><br/><p>While he walked, he used the Water Particle Detection spell to feel his surroundings.</p><br/><p>And then, he drew a deep breath.</p><br/><p>Though his water elemental power, he could clearly see that the two holy knights who were full of respect suddenly had an expression of anger. They wielded their swords and crept behind.</p><br/>\n</div>"}