{"title": "Chapter 102", "id": 102, "volume": 2, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-102", "volume_title": "Volume 2", "body": "<h1>Chapter 102</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 102: (╯'□')╯︵ ┻━┻</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>He did not even know how many times he had chanted the incantation in his heart.</p><br/><p>Maybe it has been chanted a few hundred thousand times, or maybe it has reached the millions. Benjamin stared hard at the triangular emblem, not blinking his eyes even once. His eyes were so dry it was as if blood was on the verge of bursting out.</p><br/><p>The time in the space of consciousness was slower than the time in reality but under Benjamin’s steeled heart of perseverance, the relatively slower speed seemed almost insignificant. But the Benjamin at this moment could not be bothered with something as trivial as time.</p><br/><p>He had already committed his body and heart entirely into this and had forgotten the passing of time.</p><br/><p>Caught in this situation, he had even forgotten why he was doing this. He forgot about the non-verbal spell casting, about the existence of the water particles and in those eyes nearing insanity, all that was left was the glowing blue triangular rune.</p><br/><p>Who knows how long later…</p><br/><p>Finally.</p><br/><p>After silently chanting for approximately the hundred something millionth time, a shock suddenly went through Benjamin’s entire body, like he was woken up by a punch while in deep sleep. His mind was startled -- in that moment, he was unexpectedly flung out of the immersed state he was in.</p><br/><p>What ... What was the situation…</p><br/><p>After the long period of persistence, his mind was blank. He could only instinctively blink his sore eyes and rub his temples, subconsciously wanting to alleviate his throbbing headache.</p><br/><p>Holding his head in his arms to gradually recover his energy, he reopened his eyes, and looked ahead.</p><br/><p>All he saw in the dark space of consciousness was a water ball he had just summoned, floating in front of him, gently hovering.</p><br/><p>Water ball…</p><br/><p>Benjamin was stunned. Then, he was ecstatic.</p><br/><p>\"I…I did it!\" He couldn’t help cheering out loud in the space of consciousness.</p><br/><p>Although he was not sure how this all happened, but looking at the water ball in front of his eyes, he still felt an immense sense of accomplishment. As the proverb goes, as long as one has the skills, even an iron pestle can be grinded into a needle. Endlessly repeating the incantation might sound like a downright stupid idea but hey, stupid ideas work!</p><br/><p>He also relied on this type of stupid method to break through his space of consciousness and stepped into the list of magicians, didn’t he?</p><br/><p>Don’t look down on stupid ideas.</p><br/><p>Just when Benjamin was feeling relaxed from his head to his toes, all caught up in complacence, the System once again barged in with zero regards for his achievement. In its aloof, robotic voice, it asked, \"What are you happy about?\"</p><br/><p>Benjamin felt great and so he did not mind the System’s nagging. He replied, \"I’ve finally learnt non-verbal spell casting, can’t I be happy for a bit?\"</p><br/><p>\"You call this learning? I think you’ve just recited the incantation till you got bewitched yourself,\" the System replied coldly. \"You were in such a daze that you accidentally chanted the spell out loud, summoning this water ball. Do you really think you summoned this water ball by using your mind? What are you thinking?\"</p><br/><p>Hearing this, Benjamin froze.</p><br/><p>He spoke the incantation out loud without meaning to?</p><br/><p>\"R-Really…\"</p><br/><p>\"Of course,\" the System replied with some sort of earnestness, \"Kid, it’s always hard to face the truth. But the truth is the truth and no matter how hard it is to face it, you will have to acknowledge it. Don’t lie to yourself or others.\"</p><br/><p>\"…\"</p><br/><p>His heart was so tired.</p><br/><p>He thought he could use an idea as stupid as constantly repeating an incantation, he thought he had learnt non-verbal spell casting, but it turned out that…</p><br/><p>Having cold water poured on your achievement is unquestionably the biggest blow.</p><br/><p>If he had a table in front of him at that moment, even if there was a 400 pound fatty lying on it, he believed that with the current emotion he had, he could flip the table.</p><br/><p>(╯'□')╯︵ ┻━┻</p><br/><p>What the hell, how the hell can he learn non-verbal spell casting?</p><br/><p>Influenced by the feeling that he was cheated, he even considered that the whole space of consciousness was making fun of him. The triangular rune’s glowing, brilliant blue light now seemed to him as if it was mocking his helplessness.</p><br/><p>Fuck you…</p><br/><p>He suddenly felt a sense of rage for everything here. The space of consciousness, the runes, the water particles…these were supposed to be a part of him. But these things that belonged to him were picking on him, making life difficult for him.</p><br/><p>So much effort was spent in reciting the incantation but he ended up being happy for nothing, it was such a spoiler.</p><br/><p>Under this frame of mind, he could not help but have self-destructive thoughts.</p><br/><p>He suddenly had an urge to bring in the Light Particle Crystal he obtained from the pastor, and let the repulsion between it and the water particle to cause an explosion, blowing the entire space of consciousness to bits.</p><br/><p>\"I’m so pissed…\"</p><br/><p>He was so done he started crazily running around the whole space of consciousness. He ran about 20 rounds circling all the magic emblems, then only did his feelings gradually calm down. He slowly readjusted his state of mind.</p><br/><p>Sigh…..</p><br/><p>Well he cannot actually bomb the space of consciousness. Would that not be probably considered suicidal terrorism? Besides, he probably cannot bring in the Light Particle.</p><br/><p>The System was right, the truth is the truth, escaping does not solve any problems. Only by calmly facing all obstacles can he become even stronger.</p><br/><p>After a few deep breaths, he shook away the last of the hissy fits. He regained his cool, collected his thoughts, and began reexamining his procedure in studying non-verbal spell casting.</p><br/><p>He suddenly felt that maybe his train of thought was wrong.</p><br/><p>Maybe, he shouldn’t be so persistent on chanting the incantation silently in his heart to achieve non-verbal spell casting. That was the regular definition of non-verbal spell casting but what even is a regular definition, is it food? He, Benjamin, never took the regular path anyway!</p><br/><p>Maybe he should turn his entire train of thought upside down.</p><br/><p>Maybe…..maybe….</p><br/><p>He misunderstood the meaning of \"non-verbal\".</p><br/><p>In that moment, it was as if a strike of lightning flashed in his mind.</p><br/><p>He was suddenly aware that he had already performed non-verbal spell casting.</p><br/><p>The term \"non-verbal\" meant the space of consciousness. Spell casting in the space of consciousness was already spell casting in his mind.</p><br/><p>He spoke the incantation in his space of consciousness, summoned a water ball, while in reality, it did not matter how close someone was, they would not be able to detect any abnormalities, right?</p><br/><p>In that moment, it was like a sink that was clogged up for ages was instantly opened up, and inspiration gushed out seamlessly like water.</p><br/><p>He knew right away what he had to do.</p><br/><p>Just like the method he used to ambush the Holy Knights – he first ran far away, formed the ice needles, and then brought them to kill. The nature of a non-verbal spell was also the same: He could cast spells in the space of consciousness first, summon the water ball, and then bring the water ball into reality.</p><br/><p>As long as he brought out the prepared magic from the space of consciousness, doesn’t that count as non-verbal spell casting?</p><br/><p>He completely did not have a need to adhere to the textbook sort of \"non-verbal spell casting\".</p><br/><p>Before this, he had also verified that water particles can enter and leave the space of consciousness -- he could absorb the water particles into the space, and it flowed back out when the storage was full. And magic is actually just congregations of water particles under certain conditions, so hypothetically, it could be brought out of the space of consciousness by Benjamin.</p><br/><p>Now things were getting interesting.</p><br/><p>On that thought, Benjamin immediately began trying anew.</p><br/><p>He first chanted the spell in the space of consciousness and summoned a water ball. Then, while keeping the water ball intact, he attempted to enter a state where half of him was in the space of consciousness while another half was in reality.</p><br/><p>It was as if there was a clear stream which flowed from his heart, instantly spreading to his whole body.</p><br/><p>He felt like he lost himself for a second, but it also felt like it didn’t happen.</p><br/><p>When he was aware again, he had left the space of consciousness. He was back in reality and in his bedroom, there was a big water ball, hovering in front of his eyes.</p><br/><p>This was indeed the water ball he brought out of his space of consciousness.</p><br/><p>The water particles in the surrounding were untouched as per usual, with no signs of vibrations caused by magic usage.</p><br/><p>Benjamin stared at the water ball and took a deep breath. This time, he didn’t feel much excitement; just a small sense of accomplishment and joy that filled his heart.</p><br/><p>He finally succeeded.</p><br/>\n</div>"}