{"title": "Chapter 103: A Sudden Change", "id": 103, "volume": 2, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-103-a-sudden-change", "volume_title": "Volume 2", "body": "<h1>Chapter 103: A Sudden Change</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 103: A Sudden Change</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Quickly, he invested his energy into mastering non-verbal spell casting.</p><br/><p>To go into the space of consciousness, use magic, and then bring magic into reality, was quite a cumbersome process. It took him 5 seconds the first time Benjamin attempted to finish it quickly, which was much slower than chanting the spell straightaway.</p><br/><p>In ambushing, apart from stealth, speed is key.</p><br/><p>Benjamin had to continuously practice this process and keep it under 2 seconds at least. Or else, even if non-verbal spell casting was highly covert, there would be a great cut to the rate of practicality.</p><br/><p>So for this goal, he could only put in hard work to achieve it.</p><br/><p>Thus, even if it was past 2 a.m. late in the night, Benjamin had no intention of sleeping. He was also worried about the training the next morning, and thought that he should sleep, but there was nothing to be done; practicing magic was too interesting!</p><br/><p>Thinking about it, from the day he began learning magic until now, whenever he practiced, he had always been afraid that the waves from magic usage would be detected by others, and so he only dared to practice in the space of consciousness. But now, with non-verbal spell casting, as long as it was not done in front of the Church, he could cast spells without worrying in real life.</p><br/><p>He was a little addicted to this feeling of freedom.</p><br/><p>Like this, endless repetitions of entering and exiting the space of consciousness, summoning Ice Needles, bringing the Ice Needles into reality, and then disintegrating the Ice Needles made Benjamin feel that this caused even the bedroom’s temperature to drop by almost 10 degrees.</p><br/><p>He even had to pause, open his closet to wear another shirt, and then only could he proceed with practice.</p><br/><p>And this whole non-verbal spell casting exercise continued until 5am.</p><br/><p>He had to say, staying up to practice was extraordinarily effective. When the practice was done, the whole process was already shortened by Benjamin to nearly one second. This meant that he could, in this short amount of time, whizz into the space of consciousness, use the time difference between the space and reality to complete his magic, and then whiz back out to reality with the magic.</p><br/><p>This literally... felt like flying.</p><br/><p>He felt immensely proud at this and at the same time, dizzy.</p><br/><p>Relentlessly practicing non-verbal spell casting meant that he had to go in and out the space of consciousness for 40 times in one minute. Although Benjamin boasted riding roller coasters and drop towers without a change in expression, but to go up and down a drop tower at high speed within a minute, this soured sense of coolness, he really could not fucking stand it.</p><br/><p>And especially since it was under the condition that he was staying up late.</p><br/><p>When that excitement faded, Benjamin quickly became dizzy and exhausted.</p><br/><p>Furthermore, he suddenly remembered that in less than two hours, the maid would wake him up and he would have to go for military training: run laps, stand at attention, fistfights, gun training…</p><br/><p>...Fuck.</p><br/><p>In that moment, he wanted to die.</p><br/><p>As expected, staying up late always feels great but the feeling after staying up late will always be one of regret and hatred.</p><br/><p>He will never stay up late to practice magic again.</p><br/><p>On this note, he hastily clambered onto bed, not even changing into his pajamas, pulled up his blanket, buried his head and slept – time was little anyways; only more time would be wasted if he continued regretting.</p><br/><p>Under these circumstances, sleeping for an extra one minute would be good too.</p><br/><p>And because he was already drowsy, there were no signs of insomnia the moment he got on the bed. Swiftly, he sank into deep sleep.</p><br/><p>Who knows how long later...</p><br/><p>Groggily, Benjamin woke up.</p><br/><p>Sunshine streamed through the window, and shone on the floor of the bedroom, reflecting the shape of the window and baking the whole room, making it warm and toasty.</p><br/><p>\"Ow… my head’s dizzy.\"</p><br/><p>Benjamin rubbed his eyes and sat up from the bed. The aftereffects of sleeping late were still in the works; his entire being felt woozy and there was spinning from directions he couldn’t determine.</p><br/><p>He leaned on the headboard, sitting up in bed for a while, and slowly regained consciousness.</p><br/><p>\"What time is it now?\" He asked the System in his mind.</p><br/><p>\"It is already 2 something,\" the System answered initially, and then added, \"2 in the afternoon.\"</p><br/><p>Benjamin was shocked and couldn’t react immediately.</p><br/><p>\"2 in the afternoon?\" he rubbed his temples, trying to reactivate his rusty brain. After trying for a while, he opened his mouth and asked, \"What about…the training? That maid didn’t come to wake me up?\"</p><br/><p>Whenever he thought of that face akin to that of Abbess Miejue, Benjamin could feel chills running through his body.</p><br/><p>One morning, he was feeling more lethargic than usual and so attempted to sleep in. The maid then dragged the blankets along with Benjamin down the bed, almost down the stairs. Benjamin got such a scare that he did not dare to sleep in anymore.</p><br/><p>Because of that, he did not think that the maid decided to spare him out of generosity after seeing how deep in sleep he was.</p><br/><p>\"She did not appear,\" the System replied, \"From the time you fell asleep at five in the morning till now, except for Jeremy, no one else had come in.\"</p><br/><p>Upon hearing that, Benjamin felt something was weird for a moment.</p><br/><p>Never came by?</p><br/><p>In fact, ever since Claude left the order of military training, that maid would come in to Benjamin’s room punctually, every day at dawn, to wake him up. This was a routine unbreakable even by lightning strikes; there was never a mistake. Why is it that she just decided not to show up today?</p><br/><p>Did something happen again?</p><br/><p>Confusion arose in Benjamin’s mind, but when he asked the System, it only replied in I-don’t-knows. After all, it stays with Benjamin and had no way to know occurrences outside of his bedroom.</p><br/><p>Whatever, if she just did not feel like coming in, that’s just right with me.</p><br/><p>I guess I’ll get up first.</p><br/><p>He stretched, got down the bed, slowly and leisurely walked to face the mirror, cupped some water from the washing bowl and patted it on his face, trying to make himself feel more awake.</p><br/><p>\"Young master, you’re finally awake?\" Suddenly, a voice came from the door.</p><br/><p>Benjamin turned his head and saw that outside his bedroom door, Jeremy was walking towards him with a tray of food.</p><br/><p>\"Yup, I’m awake,\" he nodded his head and asked, \"Oh right, what happened? Why didn’t that whoever it is wake me up today?\"</p><br/><p>Jeremy walked over, placed the food on the table, and replied, \"Young master, you must be referring to Jessica. Before Master left the house, he told her that she need not wake you up daily anymore, nor do you have to suffer every morning now.\"</p><br/><p>Hearing that, Benjamin was even more surprised.</p><br/><p>Claude actually revoked his orders to him.</p><br/><p>Did the heavens send down a stroke of lightning which hit Claude so hard he could finally think straight? Or did he himself realize that military training could not help with disciplining Benjamin so he gave up on this idea?</p><br/><p>How extraordinary….</p><br/><p>Honestly, after staying with the troops for so long, this suddenness of never going back made him a little reluctant to leave.</p><br/><p>Those days with the troops were not without benefits.</p><br/><p>Was he really never going back there?</p><br/><p>Benjamin picked up a slice of cake brought in by Jeremy. As he ate, he pondered these thoughts.</p><br/><p>Wait a second…</p><br/><p>Benjamin suddenly noticed a message in Jeremy’s words.</p><br/><p>Jeremy just said – \"Before Master left the house\"?</p><br/><p>\"Father left the house? What happened?\" he asked with cake in his mouth, so the words were a little unclear.</p><br/><p>Fortunately, Jeremy had spent quite some time with him so even if it was hard to hear his words, he could understand Benjamin’s meaning.</p><br/><p>\"Yes, Master needed to observe the territories again, he even said that he might be gone for longer this time.\" Jeremy nodded and continued, \"Oh and before he left, he also ordered us to leave the house less these days since something happened with the Church. It was because of this that he allowed Jessica to not take you to the troops anymore, in case of misunderstandings.\"</p><br/><p>…..Oh?</p><br/><p>Benjamin couldn’t help but raise his eyebrow.</p><br/><p>Something happened with the Church?</p><br/><p>\"The Church? What happened this time?\" He swallowed his cake, pretending to inadvertently ask about it.</p><br/><p>However, Jeremy replied, \"The Church released a wanted sign saying that an enemy nation’s assassin has infiltrated the capital, killed many people and stole a very important document. Now, the security at the capital is tightened; the city gates are full of Holy Knights, making everyone’s lives difficult and the prices of goods are increasing.\"</p><br/>\n</div>"}