{"title": "Chapter 114: The Execution Site and Parker", "id": 114, "volume": 2, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-114-the-execution-site-and-parker", "volume_title": "Volume 2", "body": "<h1>Chapter 114: The Execution Site and Parker</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 114: The Execution Site and Parker</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>\"What bloody weather is this? It was going to rain yesterday, why is the sun up and shining already?\"</p><br/><p>It was almost noon. Parker stood by the city square of the kingdom. He grumbled as he squinted his eyes and looked into the sky.</p><br/><p>Parker recently joined the Royal Knights forces.</p><br/><p>At the young age of thirty, Parker had participated in more battles than many other knights had in their lives. He clashed with the knights from other hostile countries, beheaded numerous mystical beasts, had direct conflicts with the mages…... Although he had not been promoted to the rank of a captain due to his short service, his had already built quite some reputation among the knights. The other knights would usually respect his opinion.</p><br/><p>However, after he was made a Royal Knight, his life did not turn around well as he had expected.</p><br/><p>Despite being equipped with combat skills, his daily routine had been terribly mundane and insignificant: escorting the royals, conducting security checks on people entering and and exiting the castle, standing guard throughout the night…. Sometimes, he would even be required to be the playmate of the young princess, where he would have to do everything and anything to entertain the child.</p><br/><p>Parker felt like his talents were undermined.</p><br/><p>The same mundane thing happened today. Their job was to maintain the order in the city square, and to forbid the curious citizens from wandering off to prohibited places.</p><br/><p>What bloody task was that? Did he just become the guard dog for the Church?</p><br/><p>Parker was very unhappy but could not vent his frustration.</p><br/><p>The only thing that made him feel slightly better was the fact that something big was going to happen in the city square today. After all, this gig was relatively better than pretending to be a horse for the young princess.</p><br/><p>Parker tried very hard to comfort himself.</p><br/><p>However ...</p><br/><p>This incident today was shockingly huge.</p><br/><p>\"Brother Parker,\" the knight beside Parker suddenly exclaimed, \"It’s so crowded today.\"</p><br/><p>Parker nodded in agreement.</p><br/><p>Of course it would be crowded. The person to be executed today was the famous Grant Lithur.</p><br/><p>Grant Lithur’s legacy was known the minute he was born. Holy lights were cast from the sky, the bell of the Church that rang in the middle of the night woke the whole kingdom from its dreams. Although Parker was just a ten year old boy back then, that night was seared in his memories; a scene that could not be forgotten for years to come.</p><br/><p>Not only Parker. Everyone in the kingdom could still remember the amazing sight.</p><br/><p>The genius in Divine Arts, the apostle for the Holy Lights, the future Pope…... The name of this youth was already branded in the hearts of the people in the Kingdom, and that was why they were shocked to the core when they read the announcement from the Church.</p><br/><p>This youth would have to be executed this afternoon?</p><br/><p>The news spread like wildfire in the kingdom. According to the announcement, this genius was to be executed because his illicit relationship with another male was a disgrace to the holy light. The Church would set a magnificent blaze to exterminate him with another boy to cleanse the filth they inflicted on the holy light.</p><br/><p>When Parker first heard this news, he felt sorry for him. Why would a fine young lad like him get himself involved with another man?</p><br/><p>He did catch wind of some unusual preferences of the nobles, but they lived just as well as anyone else, provided that no one caught them in their act. Grant Lithur, however, was not an average noble. He was a person who was joining the Church! What blinded him to lead his unwise actions?</p><br/><p>Parker’s wandering thoughts could only end there.</p><br/><p>After all, he never did meet this genius, and he was a knight with a mission. Since he was tasked to maintain the order at the execution site, he should do it properly, no questions asked.</p><br/><p>Questions should be left to those highly nobles, and he had absolutely no business meddling in them.</p><br/><p>In fact he heard some appalling rumors.</p><br/><p>When this thought came to him, Parker could not help but turn to look at the viewing deck at the left corner of the city square.</p><br/><p>It was prepared for the nobles and was already filled with people. These nobles would later watch the boy turn into ashes at the viewing deck while they enjoy some delicacies and fruits.</p><br/><p>Parker could not help but frown.</p><br/><p>He was never fond of the nobles, not only due to their arrogance, but also due to the fact that the rumours had it that this genius of the Divine Arts was led into a trap laid masterfully by one of the nobles.</p><br/><p>Knights like him had to stand guard for them, working hard to keep everything under control while these pompous pricks sat comfortably on their front-row seats to bear witness of the fruits of their malicious plans. Hell, they would probably plan for the next one!</p><br/><p>\"How great it would be if I could be a noble!\" Parker mumbled to himself.</p><br/><p>The knight beside him asked, \"What did you say, brother Parker?\"</p><br/><p>He snapped towards the knight and barked, \"Pay attention and stand guard! Don’t look around!\"</p><br/><p>The knight nodded immediately and stopped glancing around. He lost the courage to query further.</p><br/><p>More people filled the city square as time went by, and soon, the city square was filled to the brim. Everyone wanted to witness first-hand who was this youth who dug his own grave.</p><br/><p>The square became increasingly crowded and more chaotic which was why Parker could do nothing but form a human wall with the other knights in attempt to stop the people from crossing the lines.</p><br/><p>In his sight, the square was dark, filled with the heads of people. It was quite a sight.</p><br/><p>\"F*ck, how free could these people be? Everyone in the kingdom is probably here,\" complained Parker, who stumbled when he was pushed by the crowd.</p><br/><p>He did not have to worry that the people would hear his grumbles though, as the crowd was not only massive, but noisy. Everyone was chattering, and Parker could not get himself heard without shouting his lungs out.</p><br/><p>Ugh, this was annoying…...</p><br/><p>The crowd should really commit to more useful work if they had so much time on their hands.</p><br/><p>His empathy for these common folks disappeared after he was pushed around by them.</p><br/><p>As Parker was busy complaining, the shuffling crowd suddenly stopped. Not only that, the deafening noises disappeared like a muting spell was cast on them.</p><br/><p>Parker was stunned. What happened?</p><br/><p>He turned around to look at the square. In the center of it beside the huge crosses, a few human figures appeared suddenly.</p><br/><p>After getting distracted for a few seconds, Parker regained his attention: That appeared to be Grant Lithur! His gaze was fixed at the square. There were four people at the city square, and two of them were bound by ropes. The other two were probably Holy Knights, judging by their appearances.</p><br/><p>Was the execution about to start?</p><br/><p>For some reason, Parker was excited. He tried to identify the legendary Grant Lithur as he looked again at the ones who were tied up. Apparently, Grant had auburn hair…... Auburn ..…. Ah, the one on the right!</p><br/><p>After he caught a clear sight on ‘Grant’ who was standing by the cross, Parker was slightly disappointed. This youth that was said to be a genius now looked dusty and unsophisticated. He looked just like an average joe.</p><br/><p>This youth, so undeveloped that his pubes were not fully grown yet, was the one that was famous throughout the kingdom?</p><br/><p>He took a closer look. Grant looked like he lost his soul, like a puppet in a circus; he stood unmoving, eyes half-opened, getting pushed around without resistance. Under the scrutiny of the crowd, he gave no response to the Holy Knight who were pushing him around.</p><br/><p>Parker was very disappointed now.</p><br/><p>Judging from Grant’s appearance, no wonder he would do ‘that’ with another man. This boy was probably regretting his decision that caused his bright future to go into flames. That thought probably crushed his hopes, which was why he looked so miserable now, Parker guessed.</p><br/><p>Suddenly, the crowd gasped.</p><br/><p>What now? Parker’s thoughts were interrupted. He looked towards the direction where everyone was currently fixated to - the right side of the city square. An old man slowly made his way into the square.</p><br/><p>He wore a papal tiara in the shade of ferrous black, the tiara surrounded with a ring of gold. Clad in a cloak of gold and red that was embroidered with intricate patterns, the old man looked dashing. At the opening of the cloak, a clean white inner was evident.</p><br/><p>He wore blood red gloves, held a truncheon that was covered with pearls and diamonds. His eyes were leveled at the emptiness beyond as he stepped slowly up the highest level of the stands.</p><br/><p>Silent tension spread from the peak of the stands like a hot breeze across the hearts of many. The voices of the crowd were suppressed like countless bees fluttering their wings carefully, afraid to make a sound.</p><br/><p>Someone whispered, \"It’s…. It’s His Highness the Pope.\"</p><br/>\n</div>"}