{"title": "Chapter 135: The Potato Field and Late News", "id": 135, "volume": 2, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-135-the-potato-field-and-late-news", "volume_title": "Volume 2", "body": "<h1>Chapter 135: The Potato Field and Late News</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 135: The Potato Field and Late News</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>\"Hmm, do you want to know about the cordoned city, and the pandemic? Or the super huge Water Ball before this?\" Nina asked.</p><br/><p>That was not what Benjamin expected to hear, but his eyes still lit up excitedly when he heard that.</p><br/><p>Fortunately these three were not entirely isolated from the world even though they lived in a remote place; they knew what they should know. In that case, Benjamin could probably get quite a lot of information from them. He was worried that he would meet those who lived in seclusion and had no idea what happened outside of their lives. Benjamin would never get anything useful then.</p><br/><p>\"I know about all that. What I want to know is, what happened after the kingdom opened their gates?\" Benjamin asked immediately.</p><br/><p>Nina shook her head, \"That happened too recently, there’s no way we could know. Howl would go to the nearest village to buy thread and needles this afternoon, though. Maybe he’ll hear something there!\"</p><br/><p>…..Well then.</p><br/><p>Benjamin paused and soon realised that he got ahead of himself.</p><br/><p>It was true that the Church opened the kingdom gates just yesterday; the people outside of the kingdom, especially those who lived in isolation, would not be able to learn of it within this short period of time, no matter how well-connected they were.</p><br/><p>He wonder what happened after he fell off the carriage…...</p><br/><p>When he recalled what Michelle told him just before she pushed him off the carriage, he could finally see how the death flag was waving obnoxiously over it. ‘If you lived, go to xxx country and find xxxx\", that was the standard speech before passing on!</p><br/><p>Did Michelle really sacrifice herself as bait to lead the pursuers from the Church away from him?</p><br/><p>But…... Why would she do so?</p><br/><p>Benjamin had a weird feeling about this.</p><br/><p>He could not get a definitive answer after thinking it through a while. He could not do anything but to cast this aside and wait for the three to ‘get news from the nearest village’ before going through his thought process again.</p><br/><p>According to the description provided by the System, this hut was so remote that the Church would need some time before they could find it. There should not be problems for him to stay here for a few days, and he would not cause problems to the three either.</p><br/><p>Even though Benjamin could not fathom their reasons for saving him, he was still grateful for their help.</p><br/><p>Benjamin faced the three people and said, \"Um…. Thank you so much for saving me. If there’s anything I could help, just tell me and I’ll do it.\"</p><br/><p>However, Nana replied, \"Nah, we took you back because we just wanted someone to play with Harry.\"</p><br/><p>\"... Harry?\"</p><br/><p>Wait, was there a fourth person living here? Benjamin was confused, but he was soon introduced to his new friend ‘Harry’ by the two ladies. They urged Benjamin to get out of bed and follow them out of the hut. Outside was a small valley, and when they walked further down the valley, Benjamin saw a small field full of potatoes. It was surrounded with a simple wooden fence, and in the middle stood a horrendously weaved scarecrow. The fence surrounding the field seemed damaged, as if it was caused by wild animals.</p><br/><p>The scarecrow was Harry.</p><br/><p>After he heard Nina’s introduction, it did not take Benjamin long to catch on the reason why these people rescued him.</p><br/><p>They just needed a coolie.</p><br/><p>\"Harry is here alone everyday, can you keep him company? He seemed lonely.\" Nina pouted sadly and pleaded Benjamin, \"Of course, it would be great if you could chase off the troublesome bad guys when you’re at it.\"</p><br/><p>\"...\"</p><br/><p>Benjamin could not take this anymore.</p><br/><p>Children of these recent times. Why were they all so cunning?</p><br/><p>\"...All right, I’ll keep watch here.\" Benjamin thought about this ‘sincere’ request for a while before he finally agreed.</p><br/><p>To be fair, they did save Benjamin, so he should do his part and look over the field patiently. He did contemplate leaving right now, but he remembered that he did not have any abilities for self-defence nor information about the situation outside; it would be safer for him to hide here.</p><br/><p>Who knew if he rushed to Perseus Lake now, he might be captured by the Church!</p><br/><p>He should at least stay here until Howl went to the nearest village to gather some news. He would confirm his further actions after that.</p><br/><p>Before that, he should just help them guard their land.</p><br/><p>Nina led the other two away from the field after she finished passing her message. With his legs crossed, Benjamin sat by the side of the field and studied his surrounding. Soon, he went into the Space of Consciousness.</p><br/><p>He was not planning to be on a cautious lookout. He could utilize this long period of time to continue his work in fixing the rift in his Space.</p><br/><p>If a beast came to cause trouble …..</p><br/><p>It would not matter because the System would be around to alert him.</p><br/><p>\"Do you know an artificial intelligence like me is hard to come by?\" The System felt insulted and had nowhere to express his anger, \"And what did you do? You let me help you watch the surroundings and alert you when there are beasts. Is this the only function you can think of? What do you think I am?\"</p><br/><p>\".... A domesticated dog?\" Benjamin answered so after giving some thought.</p><br/><p>A noise depicting mechanical failure was heard. If the System had a physical body, it would already be fuming.</p><br/><p>Benjamin ‘comforted’ the System and told it to be on alert and then devoted himself to the long process of filling up the huge right in his Space by guiding the water particles. The rift already became smaller by a quarter after a few days of mending. Benjamin roughly estimated that the Space will be totally repaired after another month or so.</p><br/><p>A month….. That would be quite long.</p><br/><p>He refused to stay here in this small valley for a month.</p><br/><p>Frankly, if the Church was still trying very hard to find him, Benjamin guessed that they would find this place in half a month - hell, probably even shorter.</p><br/><p>He needed to regain his combat powers as soon as possible.</p><br/><p>He could not help but sigh in his mind.</p><br/><p>He was born to be toil for his whole life. He could never afford to relax himself.</p><br/><p>He continued fixing while the System guarded the fields for him. Although there were squirrels and badgers that came over to steal some potatoes, they were small animals that were easy to chase away. That was why Benjamin’s progress was not impeded by much.</p><br/><p>In the noon, Sandy even came over with some food for Benjamin. She was bashful though, as she just passed two pieces of rusk to Benjamin before running away with her face covered by her palms.</p><br/><p>The rusks were hard, and they nearly dislocated his nose when they slammed into his face.</p><br/><p>\"....\"</p><br/><p>How did this inhumane strength come from this six year old girl?</p><br/><p>Benjamin caught the rusk and held it in his hand while he rubbed his face. His eyes trailed Sandy who was moving away. He was speechless. Finally, he chewed on the food without uttering a word.</p><br/><p>After the short episode during lunchtime, Benjamin continued hustling, and nothing much happened. The whole afternoon was spent mending the rift, and time past quickly as night arrived within a blink of the eye. Ex-bandit Howl who went to the nearby village to shop was finally back home. He came back with two pieces of information for Benjamin.</p><br/><p>The first one said that something big happened yesterday regarding the plague in the kingdom. Apparently, the thirty thousand people who caught the plague died at the same time yesterday. The whole kingdom was dumbfounded, but the Church’s response was swift. They gave posthumous benefits to the families of the deceased, and said that these thirty thousand died gloriously in the battle with the mages, and declared that they terminated the mage who spread the ‘plague’. None of this would happen in the future, and everyone in the kingdom need not worry.</p><br/><p>Thus, even though there was still unrest within the kingdom and people still fled the kingdom, there was no major uproar as most of them were already compensated.</p><br/><p>Benjamin could not be bothered on whether there was a riot against the Church - he was shocked enough when he was told that thirty thousand people perished. He remembered clearly that Michelle told him that this curse was not fatal when she first planted it. It was not like he totally believed Michelle’s words, he just did not think that Michelle could really do something like this.</p><br/><p>Hell, this was considered sociopathic behavior!</p><br/><p>Benjamin felt slightly traumatized by that information and could not stop gasping. He thought this message was shocking enough, but he still was stunned when he heard ‘the mage who spread the plague was terminated’.</p><br/>\n</div>"}