{"title": "Chapter 131: The Pope Who Was Away for A Few Chapters", "id": 131, "volume": 2, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-131-the-pope-who-was-away-for-a-few-chapters", "volume_title": "Volume 2", "body": "<h1>Chapter 131: The Pope Who Was Away for A Few Chapters</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 131: The Pope Who Was Away for A Few Chapters</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>At the northwest mountain range of the kingdom, the two platoons of Cleaners stood helpless with the Bishop as they witnessed Michelle turning into a pool of filthy blood. All of them were stunned speechless as they looked at each other.</p><br/><p>\"S-Sir Bishop…...\" Someone finally whispered after a while.</p><br/><p>\"A Fallen One who was seduced by the devil. We should not feel sorry for her death.\" The Bishop interrupted, his tone as firm as an ingot falling to a surface, \"Don’t bother, let’s continue pursuing the carriage.\"</p><br/><p>The Cleaners looked at each other again.</p><br/><p>They knew that their mission was to capture Benjamin Lithur, and they wanted to do so desperately. However, after they saw Michelle’s ‘disintegration’, they felt a sense of discomfort and could not respond immediately to the Bishop’s commands.</p><br/><p>Another Cleaner broke the silence after some hesitation, \"Sir Bishop, we…...\"</p><br/><p>\"Enough!\" The bishop’s voice seemed agitated as he barked, \"This person is not Christine, she is only an evil mage. Nothing could be said anymore, she is dead. Benjamin Lithur is our target, and we must capture him even if we turn the kingdom upside down. We must cleanse the boy and his sins with the holy light!\"</p><br/><p>The intent to kill was evident in his words.</p><br/><p>None of the Cleaners spoke even if they still had their worries. It was the norm for them to obey the orders of the Bishop, and they had never seen the bishop this angry before. They collectively nodded and kept their mouths shut. Just as they were about to ride the horse and race towards the direction where the carriage disappeared, another Holy Knight on a horse appeared behind them from the turn of the mountain range.</p><br/><p>\"Sir! I, I have a very important message to convey to you!\"</p><br/><p>A terrified voice halted the platoons that were about to make a move.</p><br/><p>Yet another change in the situation.</p><br/><p>The Bishop pulled the rein and turned to look coldly at the Holy Knight who rushed in with his horse.</p><br/><p>\"What’s going on?\"</p><br/><p>The Holy Knight stopped his horse before he glanced at the Bishop and the remaining Cleaners. He seemed to be nervous under the scrutiny of so many people; he stuttered as he tried to speak.</p><br/><p>\"It’s….. It’s…..\" He took a deep breath and cleared his throat before he finally continued, \"It’s His Highness the Pope.\"</p><br/><p>The color drained from the Bishop’s face.</p><br/><p>However, he quickly schooled his expression and remained neutral, his eyes twinkling discreetly underneath his lashes.</p><br/><p>\"His Highness…. His Highness went to the other direction. We decided to capture Benjamin Lithur from two directions,\" the Holy Knight uttered as his voice was calming down but his undulating emotions were cut away mercilessly like weeds in a garden by the Bishop, \"But if His Highness did find something, why would you be the one who came to pass the message?\"</p><br/><p>The Bishop’s words shifted the atmosphere. The Cleaners’ gazes gradually turned hostile as they were examining the messenger Holy Knight. Some even had their hands rest on the hilt of their swords.</p><br/><p>The messenger Holy Knight paused before explaining hastily, \"No sir, for some reason, all of the God’s Eyes are malfunctioned. There was no choice but to send me to pass the news.\"</p><br/><p>Most of the Cleaners’ seemed rather perplexed upon hearing this; as if they were doubting the credibility of this holy knight.</p><br/><p>The Bishop, on the other hand, did not speak. He took out a silver bead that was emanating divine waves from his pocket to verify the Holy Knight’s statement.</p><br/><p>He held the bead in his hands and focused his gaze on it, as if he was investigating if the God’s Eye was still functioning as a medium of contact. Soon, the bishop furrowed his brows and looked slightly confused. He kept the silver sphere quietly.</p><br/><p>\"You are right. The God’s Eye is no longer working. Something is blocking the exchange of messages,\" the Bishop replied gravely to the Holy Knight, \"What did His Highness find? Tell me.\"</p><br/><p>Unexpectedly, the Holy Knight appeared anxious.</p><br/><p>\"It’s not about finding anything, it’s… it’s….\" The Holy Knight tried to construct his sentences but he found it hard to do so for a while. Somehow it was as if the message he was supposed to convey was so unusual he could not find a proper way to express it.</p><br/><p>The Bishop looked at the stuttering Holy Knight patiently as he waited for him to finish. In an instant, his facial expression abruptly changed, as if he suddenly discovered something. The Bishop then inhaled sharply, his gaze revealed his somewhat mixed feelings.</p><br/><p>The afternoon sun sprinkled onto the magnificent armours of the Cleaners, but the burn was chilling.</p><br/><p>At the same time.</p><br/><p>There was no one at the open fields near Perseus Lake, just north to the kingdom.</p><br/><p>The situation was not like this just half an hour ago. At that time, the Pope stopped here, clad in a cloak and holding the scepter. His lidded eyes were slightly raised as he looked in shock at the person before him who blocked his way.</p><br/><p>The person opposite him was also an elderly. She wore a formal dress, her white hair combed upwards in a neatly manner, one side of her brow tilted in a teasing manner in tandem with the smirk at the end of her lips.</p><br/><p>The Pope recognised her.</p><br/><p>\"Madame Lithur, it’s been so long since we met. I’m glad to see that you’re just as energetic and healthy as before,\" The Pope said with his eyes narrowed, \"Now, I would very much like you to explain your presence here. I have already banned anyone from the Lithur household from leaving the kingdom.\"</p><br/><p>The old madame looked at the sky, seemingly clueless. She then said with a smile, \"Oh, really? I’m sorry, my memory doesn’t work like it used to be anymore. I’m old and weary now, and I hope you wouldn’t mind, Your Highness.\" She did not do anything after her apologies, though. Instead, she stood with her back straight and stared at the Pope with an innocent twinkle in her eyes.</p><br/><p>The Pope frowned. It was evident from his tightening grip on the scepter that he felt that something was off. The madame just stood primly in the middle of this empty field, and the Pope felt an immense pressure on his chest.</p><br/><p>It was ages ago when he last felt this much of pressure.</p><br/><p>After some thoughts, he nodded without expression and said, \"Ah, if that’s the matter, I will understand your actions, Madame Lithur. God is merciful, and you can now return to the kingdom.\"</p><br/><p>However, the madame did not reply nor have any intention to leave. Instead, she stood with her arms crossed elegantly in front of her torso, and smiled kindly at the Pope. The wrinkles at the edges of her eyes curled slightly like the veins underneath a leaf, and there seemed to be a meaning behind her amiable composure.</p><br/><p>The Pope instinctively became flustered under her gaze, and it showed on his face. He managed to control his feelings and repressed the unknown worry that rose in him before he spoke, \"Is everything okay, Madame Lithur? Do you have something else on your mind?\"</p><br/><p>The madame shrugged innocently, \"What else can be wrong? We’ve known each other for so many years. Isn’t it good for old friends to catch up with each other?\"</p><br/><p>\"Madame Lithur, I’m afraid that your memory is really faulty now,\" the pope said, his voice gradually turning low as his patience ran out, \"Although you’ve married into the Lithur household for many years now, we did not have much opportunities to meet each other. Where does this supposed ‘friendship’ come from?\"</p><br/><p>\"How could this be? Have you forgotten, Your Highness?\" The madame half-covered her mouth, her face was one of surprise, \"We met by the edges of the Skyfall Mountains around fifty years ago. I even gave you a gift, remember?\"</p><br/><p>As she spoke, she raised her hand and snapped her fingers. \"If you’ve really forgotten about our encounter, let me help you recall.\"</p><br/><p>A fireball the size of a human head appeared before her as she spoke nonchalantly and clear noise that emerged. After a brief pause, it flew straight towards the Pope.</p><br/>\n</div>"}