{"title": "Chapter 155: The Mercenaries’ Mission", "id": 155, "volume": 2, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-155-the-mercenaries%E2%80%99-mission", "volume_title": "Volume 2", "body": "<h1>Chapter 155: The Mercenaries’ Mission</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 155: The Mercenaries’ Mission</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>The atmosphere in the tavern became unusual once again. The crowd surrounding the scene looked interested again, but this time the identity of the two mysterious men was long forgotten; the main characters now are Benjamin and the table of hunters.</p><br/><p>The hunter who was shot at finally realised the state he was in as he hurriedly pulled up his trousers.</p><br/><p>\"F*cking brat, you….\" Infuriated, he looked as if he was going to pounce at Benjamin and fight to his death at the next moment. However, his trousers will fall if he loosened his grip as he no longer has a belt. As a result, his movements became incredibly awkward and restrained, and he could only grit his teeth and hiss at Benjamin while he stood rooted at his place. Even his companions smiled at his embarrassing predicament.</p><br/><p>\"Oh, please, what are you still doing here?\" Benjamin sighed in annoyance, \"I have a gun, you don’t. You can’t fight me, so you can’t take your revenge. Since you can’t avenge your honour, stop wasting everybody’s time! Go back and fix your belt, alright?\"</p><br/><p>Benjamin felt that his words were very diplomatic and reasonable, but unfortunately the other party refused to see reason. \"I…. I will kill you!\" The hunter held his trousers and stomped, refusing to give in yet unable to rush over and attack Benjamin.</p><br/><p>The situation became tense once again. The other hunters advised their companion, \"Ah, forget it. He has a gun.\"</p><br/><p>The scene was at a bind for a moment before the hunters finally convinced their friend. He glared at both Benjamin and the mysterious men before he shuffled out of the tavern with his friends.</p><br/><p>At last, the tavern was peaceful once again. The audience shook their heads in disappointment before they moved on with their lives. Benjamin also holstered his pistol and prepared to return to his quarters and continue meditating.</p><br/><p>\"Fellow brother,\" Benjamin halted his steps when he was called by a voice as he turned to take his leave, \"Thank you for your assistance.\"</p><br/><p>Benjamin turned to see the two mysterious man standing behind him in their cloaks. \"No problem, this is just an minor thing.\" Benjamin waved nonchalantly, \"I didn’t do this to help you. A friend of mine owned this tavern, I just wanted to prevent you from damaging his property in a fight.\"</p><br/><p>Strangely, the younger of the two men looked offended. \"That’s an unnecessary concern. If a fight did break out between us, the only thing that would be damaged is his arm,\" he said arrogantly as he touched the hilt of his sword that was pinned to his waist. At that, the elder one turned to scowl at him, as if he was criticising his immaturity. He did not deny that, though.</p><br/><p>….Oh?</p><br/><p>Benjamin’s interest was piqued as he remembered something. The two men gave off a specific vibe to Benjamin; they seemed less driven than war-hardened soldiers, but more prideful than the average bandits and thieves. This particular sense of casual sharpness triggered something in Benjamin’s memory. It was very similar with Chief Silverfox. They were travellers from foreign lands, too. It did not take Benjamin long to come to a conclusion when he noticed that their swords seemed to be enchanted.</p><br/><p>\"You’re mercenaries.\"</p><br/><p>Two men shared a peculiar look the moment they heard Benjamin’s words. The elder turned to look at Benjamin as he spoke, \"My, my. This is certainly out of our expectations. There was still someone within the Kingdom of Helius who understood what this word meant! Please, do not spread the word, for we only came to locate a person. We have no malicious intent whatsoever.\"</p><br/><p>Benjamin shrugged in mild disbelief. He could not help but relate this two mercenaries from Icor with the foreign assassin that was sent in to assassinate the pope. Do they really have no other hidden agendas?</p><br/><p>Although Benjamin was very curious about their mission, but mercenaries were usually an honourable bunch that treated the rules of their profession with utmost respect. It was highly unlikely for Benjamin to get information from them. Thus, he did not take the risk of trouble and dropped the line of questioning altogether.</p><br/><p>In contrast, he whispered quietly to them after he sent the bartender off to some work, \"I have a mission for you. Will you be interested to take it on?\"</p><br/><p>The mercenaries looked quite surprised at his preposition. They shared a look again before te elder one replied, his voice subdued and quiet, \"Normally, we would need to go through some standard procedures from the Mercenary Association before we could take up a mission. However, sometimes we do run a few missions in private.\"</p><br/><p>He did not further elaborate, and it was evident that he was waiting for Benjamin to detail the specifics and rewards to his mission. The fact that he did not flat out refuse Benjamin’s offer was a good news in itself.</p><br/><p>\"Don’t worry, it’s an easy job.\" Benjamin held a large bag of gold coins and slightly shook it before them, \"I just need you to go to an isolated location in the Imperial Capital and dig out something that I want. Your mission will be completed once you passed the goods to me.\"</p><br/><p>For safety reasons, Benjamin dealt with a number of his belongings before he left the kingdom. The crosses he salvaged from the priest, the Light Elemental Crystal, Annie’s Mirror of Mirage, a box full of blessed bullets…. Although Benjamin mentally prepared himself to the pain of giving up these things, but it would be great if there was a chance for him to regain them.</p><br/><p>The crosses that could boost spiritual energy and its regeneration would be especially helpful to him now. Since he met these two mercenaries by coincidence, he might as well ask them to help him retrieve the goods. There was no need for him to be afraid that the mercenaries might leak the news that Benjamin is a mage - they had no idea that he is one! Besides, even if they found out that Benjamin was a mage, they would not expose it to the church either; after all, the church were suppressing mercenaries while they were hunting mages down. Enemies of the enemy are friends; it will be impossible for them to work with the church.</p><br/><p>Those were the reasons why Benjamin felt he could give this mission to these two men.</p><br/><p>\"The Imperial Capital… was indeed on the route of our journey,\" The elder mercenary said with reluctance, \"But we’re unsure of the duration of our stay in the Kingdom of Helius. We’re afraid to say that you might’ve already left when we return to the Town of Crewe.\"</p><br/><p>\"That’s not a problem. If I’ve left this town, I must be out of country already,\" Benjamin waved it off and answered, \"Tell me your names, and I will look for you in the Mercenary Association.\"</p><br/><p>The mercenaries were hesitant at first, but they nodded after some contemplation. \"When you’re at the Mercenary Association, ask for Ciel and Louis. You’ll find us there.\"</p><br/><p>After some muted discussions, Benjamin paid them a deposit of 2 gold coins, and made an agreement to pay them the rest of the 18 gold coins once they delivered the goods to him. Then, he told them the location where he buried the things. The mission was finalised after that. Benjamin bid his farewell to the two mercenaries before returning into his room at the back of the tavern to continue his meditation. The two mercenaries seemed satisfied as they left the tavern and walked towards the exit of town to continue on their journey.</p><br/><p>On the road.</p><br/><p>\"Fair luck! I originally thought that we’re wasting our effort coming to the Kingdom of Helius. Thankfully we got this extra mission, so at least we would have some sort of income.\" The younger of the two sighed.</p><br/><p>The elder one snorted, \"How would you know that we’re wasting our time? If we could find that person, we wouldn’t be able to spend all of the reward money in our lifetimes!\"</p><br/><p>\"The most recent news said that he last appeared in the village near Perseus Lake, north of the Imperial Capital,\" The younger mercenary said as he shook his head, \"The news was from one month ago, though. Apparently quite a number of Holy Knights were sent out to find him but to no avail. The mister hired us to come here, but what could we find?\"</p><br/><p>The elder mercenary looked gloomy as he said, \"It’s such a big mission that we must at least give it a go. We’re already quite informed as we’re ahead of the others. Half of the mercenaries in Icor would probably storm the Kingdom of Helius after another month or so to snatch this mission away from us.\" He paused, \"At least we’re a few steps ahead of them in comparison.\"</p><br/>\n</div>"}