{"title": "Chapter 152: Spying", "id": 152, "volume": 2, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-152-spying", "volume_title": "Volume 2", "body": "<h1>Chapter 152: Spying</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 152: Spying</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>It was not too late, and the hand-knitting shop was still open.</p><br/><p>After Benjamin briefly explained the situation, the lady boss had no objections and allowed Benjamin to stand in a corner of the shop to discreetly sense the situation within the gates.</p><br/><p>Since the rift in the Space of Consciousness was successfully mended, the Water Particle Detection was not affected despite the slight drop in Benjamin’s magical ability. In fact, the range of the detection became wider than before. Based on the response of the water particles, Benjamin could see ten people checking the pedestrians by the gates, and two hundred people standing guard on the top of the gates; which corroborated with the information he got from the eavesdropping.</p><br/><p>The structure of the Crusader Gateway slowly formed in his mind.</p><br/><p>The gate looked more like a fortress, as it did not have much space to allow human movement. The middle of the gates consisted of two gigantic steel doors with strong aura of Divine Arts. It appeared that there was no way to go pass this gates other than opening the door from within the fortress.</p><br/><p>In between the two doors was a one hundred-metre pathway, which was the mandatory route to get in and out of the Gateway. At the sides of the pathway, side doors were open, and they led to long hallways and rooms. The rooms each had different functions, such as lodgings for the guards that resembled dorms, prayer rooms specially built for the church, a command room, a canteen, a storehouse…...</p><br/><p>The Crusader Gateways was thousands of meters wide and hundreds of meters thick. That was the reason there were so many rooms.</p><br/><p>Benjamin’s attention travelled back and forth the rooms in attempt to search the crosses that could identify mages.</p><br/><p>At ten o’clock, the guards by the gates switched shifts. The ten patrol guards passed the crosses directly to the guards of the next shift. With their lights on, the next shift of guards held the crosses and continued checking the pedestrians who rushed their travels throughout the night.</p><br/><p>Benjamin felt a headache when he was observing this scene.</p><br/><p>Was it necessary for the same ten crosses to be used for twenty-four hours, three hundred and sixty-five days? How stingy was the Church to not prepare some for reserve? How could Benjamin steal this then?</p><br/><p>No…... There should be spares. Magical instruments have their respective durabilities, and they would be damaged if used too often. Where would the reserve be kept? Maybe Benjamin’s detection range was not wide enough; he could only sense the rooms that were near to him. The ones on the far side, or the ones deeper into the gates were unfortunately beyond his sensing capability.</p><br/><p>Ah, what a huge headache.</p><br/><p>Benjamin gradually retrieved his detection and puzzled over the situation with his back leaning against the wall of the hand-knitting shop.</p><br/><p>\"How was it? Done with it?\" The voice of the lady boss snapped him back into the real world, \"It’s getting late, I’m going to close my doors soon. It’s time for you to take a rest too.\"</p><br/><p>Benjamin shrugged helplessly, \"This is going to be quite difficult. The defences around the gates are quite strict.\"</p><br/><p>Although the hand-knitting shop was not closed yet, there were no other patrons inside. Everyone in the shop was a mage, which was why Benjamin had no need to pretend to be a customer, nor avoid talking about sensitive topics.</p><br/><p>\"Of course it is. That was why we said we had no idea how to go about this in the first place.\" The lady boss did not look particularly disappointed as she said, \"The harvest these years were borderline acceptable. The people within the gates would occasionally stock up their food supplies by ordering from the town. Varys have a business here, and he did manage to sneak into the place a few times. He didn’t find anything though.\"</p><br/><p>….. Sneak into the place? An idea flashed by Benjamin’s head.</p><br/><p>\"Do we have a chance to go into the gates?\" He quickly asked.</p><br/><p>\"Of course! Even I went in a few times,\" The lady boss replied as she nodded, \"It was abnormally cold last winter, and the people in the gates ordered a huge batch of cotton-padded clothes from town. Quite a few knitting shop owners went in. We only managed to walk to the doors, though; we were not allowed to go deeper into the gate.\"</p><br/><p>Benjamin thought about it for a moment. He shook his head. The idea he came up with was to disguise as a patrol guard to enter into the Crusader Gateways. However, the lady boss actually meant ‘stopping at the door at the pathway, placed the goods there and left’ when she said ‘sneak into the place’. There was no actual sneaking.</p><br/><p>The more Benjamin thought about this, the more impossible this mission of stealing a cross seemed.</p><br/><p>Did this imply that he should just give up?</p><br/><p>He further considered the situation. Suddenly, he switched the subject as he abruptly raised his head, \"When they ordered the cotton-padded clothes from town, do you know how much they actually ordered?\"</p><br/><p>The lady boss looked surprised, as if she could not understand why Benjamin would want to know this.</p><br/><p>After frowning and thought about it for a moment, she finally answered, \"At that time…. It was approximately a thousand if you add all the other shops. They did buy another thousand from Varys, though.\"</p><br/><p>Benjamin nodded, deep in thoughts.</p><br/><p>According to the relatively excellent shift and holiday arrangements, the patrol guards were treated decently. If they wanted to order special clothes, they would only buy more of them instead of under-purchasing. Furthermore, when Benjamin observed the dormitory using the Water Particle Detection before this, he made a rough estimation that there would approximately be two thousand guards living in the gate.</p><br/><p>Two thousand guards….</p><br/><p>Benjamin also noticed that their armour were not blessed, and were ordinary pieces of steel. Their training must be incompatible with the ones experienced by the Holy Knights or the Royal Knights, which meant that they would probably only have average combat prowess. The undefeatable aura around this place was solely due to the unbreakable door.</p><br/><p>\"What’s up? Why did you ask that?\" The lady boss was on a cliffhanger when Benjamin stopped talking for a moment.</p><br/><p>\"According to their order, we could conclude that there are almost two thousand people standing guard in the gates.\" Benjamin crossed his arms and stood leaning on the walls, \"I’m thinking about how strong these two thousand people would be in a battle.\"</p><br/><p>Surprise coloured the lady boss’ face as she quickly shook her head, \"You’re planning to barge your way through? No, that won’t work. There’s a bishop and 6 other priests in there; we couldn’t even handle that one bishop, there’s no point to even think about the other priests.\"</p><br/><p>Benjamin was quite shocked by that statement too. There were so many spellcasters guarding the Crusader Gateways?</p><br/><p>He was already thinking about the specifics of a battle in his mind. After all, there were more than twenty mages in town, and soldiers without blessed equipments were unusually vulnerable when placed before a mage. If they could all sneak into the pathway of the gates and launch a surprise attack, they might break the defence line and escape directly out of the country.</p><br/><p>That no longer seemed to be feasible now.</p><br/><p>The bunch from the Church was a force that they could never defeat.</p><br/><p>\"Do you know the magical abilities of the others? How many spells do they know?\" Benjamin refused to give up as he asked.</p><br/><p>\"I could make a rough guess,\" The lady boss said. She soon shook her head, \"I need to remind you to not have too high of an expectation, though….\"</p><br/><p>\"It’s fine. Everyone was still new to magic learning, no?\" Benjamin looked as if he was eager to test out this theory as he enthusiastically replied, \"People always improve with practice.\"</p><br/>\n</div>"}