{"title": "Chapter 178: Stranger", "id": 178, "volume": 2, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-178-stranger", "volume_title": "Volume 2", "body": "<h1>Chapter 178: Stranger</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 178: Stranger</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Benjamin and his group walked towards the wasteland at the borders of Icor and the Kingdom of Helius.</p><br/><p>Maybe walking is not the appropriate word to use here. If they were really depending on their feet to walk, then it would be too slow for their group — Who knows if there was someone chasing them from behind? Moreover, they were mages and did not need to walk like mortals.</p><br/><p>As distance grew from leaving Icor’s base camp, they decided to scurry on using the Flight Spell. However, those who mastered the Flight Spell were not many, perhaps seven or eight of them. What about the remaining group members?</p><br/><p>— They would have to depend on Benjamin, then.</p><br/><p>Benjamin could manage to have them blown into the air with his current magic capabilities using steam as a propulsion. That being said, they were only scraping through with this sort of ‘flight’ mode. The few mages who cast the Flight Spell watched as over ten of their comrades were spinning around in the air with their hair all over the place. There were even a few of them who were foaming at the mouth and rendered unconscious.</p><br/><p>\"... Thank goodness we mastered the Flight Spell,\" Whispered those who could fly in horror.</p><br/><p>They flew for about half an hour until Benjamin had to stop to rest as he had drained his Spiritual Energy. Those who had landed all showed symptoms of nausea and vomiting. They then insisted on traveling on foot.</p><br/><p>It was not as though Benjamin could do anything about it.</p><br/><p>It was challenging to drag over ten people in the air to fly. Add balancing them in the mix was really out of his capabilities.</p><br/><p>The wasteland was not that large and they had left the gates far behind, it should not be a problem to walk the last leg.</p><br/><p>It was also getting pretty late. And so Benjamin and the rest set up their camp to call it a night and continue their journey the next day.</p><br/><p>They had already planned their route before leaving the Crusader Gateway.</p><br/><p>Varys was a merchant and has traded with many nations. They had obtained Icor’s map earlier so they would not be running around like headless chickens once they left the kingdom.</p><br/><p>They quickly reached a place called Town of Hank to bunk for a few days once they crossed the wasteland. There, they learnt more about the survival of mages in Icor as well as the situation in the other two nations before deciding upon their next destination.</p><br/><p>As for Benjamin, he was in favour of heading to Fereldan.</p><br/><p>It was not that he trusted Michelle’s judgment but rather he knew that Michelle’s hatred towards the Church was evident. Surely, there was a reason why she wanted Benjamin to pay her teacher a visit prior to her \"death\".</p><br/><p>From the information he has heard of, out of the three nations, Fereldan carried a more liberal stance.</p><br/><p>Of these three nations, Carretas was already secretly in communication with the Church and it was only a matter of time when the mages there would be vanquished; the queen of Icor was a control freak and so living in peace in her nation would be difficult. Therefore, Fereldan seemed to far better at this point.</p><br/><p>There were many reasons why Benjamin wanted to head to Fereldan but he must also consider the rest of the group. They may have fallen in love with Icor on their journey here or decide to settle here for whatever reason but Benjamin still had to hear them out beforehand.</p><br/><p>He could not help but sigh at the thought of this.</p><br/><p>He had to be cautious because it was the equivalent of having twenty something lives in his hands.</p><br/><p>\"Sir Benjamin.\"</p><br/><p>Benjamin returned to his senses and stood up. He stepped out of the temporary tent they made. The person who called him was Augustine who stood outside the tent. There was an unfamiliar face behind him.</p><br/><p>\"What's the matter? Who is this?\" Benjamin asked.</p><br/><p>Augustine shrugged his shoulders and said, \"I’m not too sure myself. He said he was separated from his companion and lost his way in the wasteland. He asked if he could tag along with us.\"</p><br/><p>Benjamin was surprised and looked at the stranger from top to bottom.</p><br/><p>It was a young man in his twenties. The clothes he wore was slight worn but belonged to the servant of a merchant. He looked physically tired and he did looked like a person who has lost his way.</p><br/><p>Benjamin nodded after thinking it through, \"Then you could stay. Isn’t there an extra tent over there? Let me bring you there. You may take your rest there.\"</p><br/><p>Augustine’s jaw dropped but did not say a word. The stranger immediately gave a huge smile and bowed a few times at Benjamin</p><br/><p>\"Thank you, thank you very much.\"</p><br/><p>Benjamin then brought the young man to a tent in a slightly isolated area.</p><br/><p>The tent was really cramped. Benjamin went in first, followed by the young man. Once the young man entered the tent, his arms went numb that he almost fell to the ground.</p><br/><p>\"S-Sir?\"</p><br/><p>Benjamin’s facial expression changed and he gripped the young man’s arms tightly. A chant was not heard but two sturdy ice appeared and froze the man’s arms. With cold seeping through the depths of his spine, he could not lift a finger.</p><br/><p>After struggling for a bit, the young man collapsed to the ground and could not get up.</p><br/><p>Benjamin let go of him and looked at him from above, \"Speak. What’s the motive the queen have you sent here?\"</p><br/><p>The young man’s expression froze the moment the words were blurted out.</p><br/><p>\"Sir, I don’t know what you’re talking about.\"</p><br/><p>Still pretending.</p><br/><p>Benjamin snorted coldly and proceeded again with the non-verbal spell casting as an Ice Needle formed on the palm of his hand. He pointed the Ice Needle at the young man’s throat and mercilessly said, \"What about now? Now do you get me?\"</p><br/><p>The young man’s face went through another change.</p><br/><p>He became really calm, and stared at Benjamin with his expressionless eyes. The intensity in the tent rose as both were at loggerheads.</p><br/><p>There was silence.</p><br/><p>\"I got it, I got it. First you got to move this thing away, it’s... freezing.\"</p><br/><p>As he said this, it was like a layer of personality was torn open, and his entire demeanour changed. He was brusque, a complete 180 change from the lost young man before.</p><br/><p>Benjamin was not the least bit surprised.</p><br/><p>The moment he laid eyes on the strange young man, he did not see through him. But quickly, the System reminded that the fella had appeared outside of the gates at Icor’s camp site. It even showed the recording of this incident to Benjamin.</p><br/><p>It was a blurry recording but this young man was seen hiding in the crowd and hard to detect. That was why Benjamin did not pay attention to this person nor did he leave a lasting impression.</p><br/><p>It was not a matter that can be overlooked.</p><br/><p>People from Icor’s base camp has stalked them and... was their motive only limited to stalking? Judging by his well thought out disguise, what was the purpose the queen has sent him over?</p><br/><p>Hence the reason why Benjamin decided to interrogate him. But he did not want to alert the majority of the mages who were already resting. He also used the Water Particle Detection to confirm that the young man was just a mortal. He then pretended to be oblivious before leading the young man to the tent and proceed to restrain him.</p><br/><p>\"Tell me what is the queen’s motives first or I will not remove this.\" He said this while pushing the Ice Needle forward. Just an inch more before it could penetrate his throat and turn this young man with an ulterior motive into an ice sculpture.</p><br/>\n</div>"}