{"title": "Chapter 191: Questioning His Life", "id": 191, "volume": 2, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-191-questioning-his-life", "volume_title": "Volume 2", "body": "<h1>Chapter 191: Questioning His Life</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 191: Questioning His Life</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Looking at the Bursts of Fireball that he summoned, Richard could not help but feel proud of himself.</p><br/><p>As the most widely used Low-level Magic with high attack power, Bursts of Fireball was the magic that almost any mage has to be equipped with. But even so, it was not like anyone could use it well. The gathering and transferring of Fire Particles, the minute control of Spiritual Energy during the process of casting the spell...As a whole, even though it was simply a Low-level Magic, it required a lot of learning to cast it well.</p><br/><p>It was not easy to be able to cast this spell – and even summon ten powerful Fireballs at once – in a short amount of time. He strongly believed that not many people in the whole of Icor could achieve this.</p><br/><p>Maybe some who learned Intermediate and even High-level Magic could release powerful attacks. But simply by performing a powerful low-level magic, Richard successfully made himself famous in the Mage Guild and caught the attention of some people of high status.</p><br/><p>In the Mage Guild, this was a rather impressive thing to do.</p><br/><p>Therefore, when the Guild Master of the Mage Guild looked for him and wanted him and another mage to invite this guy named Benjamin to the Capital City, he was in doubt. Was a magician who ran away from a village somewhere so important?</p><br/><p>Although he never had much chance to fight with those from the Church before, Richard still thought that he could run away using his own strength too if he was ever thrown into the Kingdom of Helius.</p><br/><p>So from the beginning, he already thought about giving it a go with this guy.</p><br/><p>He felt that if he could easily defeat this Benjamin, wouldn’t the Guild Master pay more attention to him once the Guild Master got a hold of this news? Wouldn’t the Guild give him more resources as well?</p><br/><p>With these thoughts, he arrived in the town of Hank. He deliberately guided the other mages to this topic when he chatted with them. As expected, those mages have never seen much in life, so it was easy for him to trigger their desire to fight. Those mages also wanted to \"fight him in order to learn\".</p><br/><p>In order to wait for this Benjamin to be back, he used many different kinds of excuses to delay the time. Luckily, everything was going smoothly just as he had planned. At last, the leader of those exiled mages, the mage who was given extra attention by the Guild Master, stood before him. To be honest, when he first saw Benjamin, his heart was filled with disdain although he did not show it on his face.</p><br/><p>How old was this guy?</p><br/><p>Even though Richard was not a good judge of people, who knows what kind of luck did this kid – who looked not past twenty years old – have that he became a mage, brought a bunch of half-baked mages to run away from Kingdom of Helius by luck, and as a result, earned the respect of the Guild Master.</p><br/><p>Richard could not agree to this. It was just a Gateway, was breaking in that difficult? Why would everybody else see this event as if it was something so impressive?</p><br/><p>What that brat could do, he could do it as well.</p><br/><p>He had to prove this fact to everyone else.</p><br/><p>Actually, the condition that he brought up before they began the fight was a small strategy he thought of long ago. Even though he was really confident with his own skills, he was not one to do things rashly. He despised this mage who ran from the Kingdom. That was true. But being able to catch the attention of the Guild Master, surely he would have something that he excelled in.</p><br/><p>Thus he wanted to make sure he had a 100% chance of winning this duel.</p><br/><p>From the abundance of combat experiences that he has, he knew that to defeat an opponent, he had to create favorable conditions. This was so that he could maximize his strength to the limit and force the opponent to fight with their weakest points. He came up with a plan. The powerful application of the Low-level Magic was his forte, as for the opponent... The magic in Kingdom of Helius was less systematic. Maybe his opponent was really talented and knew some unofficial yet powerful magic, but surely he would not be that good with the basics.</p><br/><p>Using the excuses that the opponent has just returned from the Forest of Dark Magic, he created a duelling condition whereby both of them were only allowed to use Beginner-level or Low-level Magic. He could show that he was a generous and understanding person and at the same time, increase his chances of winning. What an intelligent move to make!</p><br/><p>This was why when Benjamin mentioned this wager, he would agree to it without thinking much.</p><br/><p>Just wager all you want! If it was only performing low-level Magic, how could this kid win against him? Do not tell him that this guy would be able to kick his ass by only performing the Water Ball Spell? That was ridiculous.</p><br/><p>If he was not absolutely sure that he could win, he would not have taken his utmost precious Magic Potion to wager on this.</p><br/><p>Of course, he needed to have confidence in himself, but he would also need to take note not to take his opponent lightly. He knew what ends a mage who took his opponent lightly would meet. Thus, as the duel began, he gave it his best shot.</p><br/><p>Ten Bursts of Fireball! He would like to see how this kid could block his attacks!</p><br/><p>\"Sir, be careful! If you cannot block it, I can stop right away.\" As he was thinking in that way, at</p><br/><p>the same time, Richard told Benjamin in a caring voice.</p><br/><p>However, he was really perplexed at Benjamin’s reaction. Benjamin did not react at all to his words. Moreover, whilst facing the Fireball falling just like a cluster of shooting stars, Benjamin simply opened his mouth and chanted an extremely short spell.</p><br/><p>Richard recognized this spell.</p><br/><p>It was Pillar of Steam.</p><br/><p>... What?</p><br/><p>At that moment, he felt like things were going in an unexpected direction.</p><br/><p>He did not hear it wrongly, right?</p><br/><p>What was this guy playing at? Was he shocked? He intended to use a Beginner-level Magic to block the Bursts of Fireball? In addition, it was a Beginner-level Magic that was usually labelled as useless.</p><br/><p>In fact, even though the spell Pillar of Steam, was listed as an Attack-type Magic, its attacking power was simply too small. Steam that was scorching hot sounded impressive, but it was impossible for it to break through even the thinnest Magic Shield. Even for normal people, it could not even burn them to death even if it was performed for a whole day once they wore accessories that had magic effect added to it. It was even more impossible for the mage.</p><br/><p>This was why even Richard was hesitating. What if he killed Benjamin by chance?</p><br/><p>However, just as this magic was fully released, the scenes that came afterwards completely overwhelmed him.</p><br/><p>In fact, he only felt a slight magic oscillation. He did not even feel the gathering of the Water Particles. However, as Benjamin stretched out his hands, the ten Fireballs that were falling at great speed slowed down as if it was held by something. Its speed decreased and decreased... Until finally, they simply stopped in midair. No matter how much Richard controlled them, they could not advance forward any further.</p><br/><p>He felt breezes of hot air passing through the Fireballs. He knew very clearly that it was the steam that leaked out of the Pillar of Steam when the magic was countering the Bursts of Fireball. But... But...</p><br/><p>Why would the Pillar of Steam be able to block the Bursts of Fireball?</p><br/><p>What did he just see?</p><br/><p>In that moment, Richard felt as if the world he had known for twenty or more years was completely destroyed at this instant.</p><br/><p>What the heck? It was not like he could not perform Pillar of Steam. There was also a time when he practiced extremely hard for it! This magic had little power, was hard to control and had little practicality. Its potential was limited as well. Its only advantages would be that the amount of Spiritual Energy used was small and that it could utilise the Water Magic to imitate the effect of Wind Magic... See, he really knew this magic well!</p><br/><p>But whose Pillar of Steam could be used in such a way?</p><br/><p>He was completely stunned by this.</p><br/><p>...Brother, are you sure this was Pillar of Steam instead of some freaking spells like Windstorm Spell? Didn’t we agree to use only Low-level Magic? You used an Intermediate Spell right after our duel began. What is the meaning of this? As a person, we should not be too shameless, right?</p><br/><p>Again Richard transferred his Spiritual Energy and tried to control them, but the ten Fireballs were still suspended in midair, vibrating. Richard even began to doubt whether he had a fake life for so many years.</p><br/><p>The Bursts of Fireball that he had practiced so hard for years was easily broken through by this guy’s Beginner-level ‘useless’ Magic. How could he continue this way?</p><br/><p>No, he must be hallucinating... If this event where his Bursts of Fireball was blocked by Pillar of Steam was told to the others, how could he still go on and about in the Mage Guild? Moreover... Moreover, no one would believe such things. What kind of joke was this? Useless magic was useless magic. It could not have such power. No one would believe in this.</p><br/><p>At that moment, he even began to believe that he was hallucinating.</p><br/><p>However, right at this moment, he suddenly heard Benjamin’s voice.</p><br/><p>\"Such powerful Bursts of Fireball. Being able to stay lit without disappearing in the Pillar of Steam for so long. Sir Richard, you really did well with your basics. It is truly impressive.\"</p><br/><p>Other than wanting to die, Richard had no other thoughts.</p><br/><p>What did this guy just say?</p><br/><p>Why? Why would this guy speak of such an abnormal thing in such a straight face? The Bursts of Fireball withstanding the Pillar of Steam for so long was impressive? Was this guy complimenting him? But why would Richard feel like he wanted to cough blood after hearing those words?</p><br/><p>Wait, was he speaking the lingua franca of this land? Why did Richard know every word in this sentence, yet understand none of them when linked together?</p><br/><p>At that instant, Richard felt as if he was falling apart. The reason he was still standing was truly thanks to the strength of his mind and his undefeated determination. Such heart-wrenching reasons.</p><br/><p>However, little did he know that the thing that would make him fall apart even more had yet to come.</p><br/><p>In the wild flow of the water vapor, the ten Fireballs that were suspended suddenly moved. Immediately, Richard thought that the effect of his opponent’s magic had passed. His Bursts of Fireball were no longer blocked. He almost jumped in delight. But soon, he realized that the Fireballs were not moving according to his will.</p><br/><p>He only saw that the Fireballs were sometimes moving upwards or downwards. They would exchange their positions to form an orderly formation. They were just like the dance team that gave a performance in the theatre, dedicating a special performance to the citizens of Town of Hank.</p><br/><p>\"Wow! These Fireballs are so lively. They fly even neater than the birds in the sky.\"</p><br/><p>\"What kind of magic is this? It looks amazing!\"</p><br/><p>\"Wasn’t this a fight? Why did they start to dance? Hey, that mage over there, can you use Fireball Spell? Last time, I saw the masters from other Mage Guild performing this. It wasn’t like this though. \"</p><br/><p>Many complicated voices rushed into his ears. Richard’s face was deadly grey.</p><br/><p>Even at this moment, he had not given up the control of the Bursts of Fireball, but his movements was completely in vain. The Fireballs were surrounded by the wild steam flows and were completely out of his control. Being able to keep them in flames was already an impressive thing to do.</p><br/><p>But... He did not want the Fireballs to extinguish. It was as if the ten Fireballs that were played like a toy by his opponent in midair were his pride as a mage.</p><br/><p>If the flames died out, it would mean that his confidence was utterly crushed.</p><br/><p>Unfortunately, he still underestimated the blow against his confidence from this duel. After the Fireballs danced a while in midair, Benjamin, who stood right in front of him, spoke to him a few words again. His sincere manner also made Richard desperate for a hole to climb in.</p><br/><p>\"After so long, the flames of the Fireballs do not seem to have any indication of dying out. Sir Richard, you are truly impressive!\"</p><br/>\n</div>"}