{"title": "Chapter 197: Refining Potions", "id": 197, "volume": 2, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-197-refining-potions", "volume_title": "Volume 2", "body": "<h1>Chapter 197: Refining Potions</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 197: Refining Potions</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Andy held the thick Introduction to Magic Potions book, he felt nervous as he stood outside Benjamin’s tent.</p><br/><p>He was different from the other mages, unlike everyone else he didn’t travel to the town of Crewe after he became a mage. The town of Crewe was already his home, half a year ago he was identified by the other mages, and was pulled into a meeting. When everyone noticed that he wasn’t a mage, they decided to spare his life out of pity, and instead decided to teach him magic. Once he learnt enough, he became a member of the group, despite the fact the whole thing had been an accident.</p><br/><p>However, even with this weird way of becoming a mage, Andy didn’t feel any discontent towards any of the other members of the Mage Group, he could never feel discontent towards the only reality that had any meaning to him.</p><br/><p>Joanna always said that his views were very pessimistic, with no intent to improve himself. He had to agree.</p><br/><p>After Benjamin appeared, the other mages behaved like they found their life’s goal - meditation, combat, new spells... he also learnt the reclusive flying spell, and joined the movement to attack the gateway. He felt as though he should be rejoicing like the others, eyes gleaming in expectation of the future. However, he felt at an inexplicable loss.</p><br/><p>Throughout the entire gateway attack, he had only released a single fireball with Joanna at the right at the start of it. Then he waited outside, and the gateway was later claimed by others. Even though he was frightened in the beginning, it was like he did nothing, Andy still felt an emptiness inside his heart.</p><br/><p>It was like it didn’t make a difference to the others whether or not he existed.</p><br/><p>This feeling of loss became stronger with the passage of time. Added on to the fact that after fight after fight with magical creatures, the others had rejoiced in their victory, but he felt only chaos. He felt as though he was missing something, unable to keep up with the others. So much so that he actually thought about leaving the group, thinking he didn’t deserve to continue being in the team.</p><br/><p>After all, if everyone was rushing towards the same goal, the person marching in place would only get left behind.</p><br/><p>Until he flipped open the Introduction to Magic Potions book, he always had a sense of incompatibility. The others finished flipping through the book and threw it aside, saying \"How boring\", \"Too complicated\", \"Seems useless.\" But when he picked the book up, note that it was only because Benjamin wanted them to read it, he was absolutely excited to try it and contribute to the others in his own unique way – he wanted to be part of that group.</p><br/><p>\"Magic potions rank higher than magic.\"</p><br/><p>What was interesting was that upon reading that sentence, he didn’t feel any sense of surprise or confusion. He only felt that the person who wrote it must have been very discontented; he could even think about it - a resentful mage, under the dimness of an oil lamp, taking a fountain pen and writing the first sentence of the book on the yellowing draft paper.</p><br/><p>Andy had an odd feeling, this was certainly an \"interesting\" book.</p><br/><p>The contents of the rest of the book, slowly pulled him in. Plundering the strength found in the flesh of the magical creatures, granting strength to an originally weak human, this thought made Andy, who had only been a mage for half a year, felt captivated. If studying magic potions meant looking at this sort of theory, then agreed that its significance was definitely deeper than magic.</p><br/><p>He didn’t understand, why the others would feel that this notion was boring, but he felt that it was something to be proud of.</p><br/><p>More importantly...Teacher Benjamin seemed convinced of the importance of this book.</p><br/><p>Andy didn’t want to leave the group. The fact that he left his home made him uneasy, but if he drifts away even from his friends, that would just break his heart. He is not someone to make ultimatums, but to become like everyone else, he was willing to put in the effort.</p><br/><p>Benjamin brought so much hope to the others, maybe, it was enough to give him direction in his own life?</p><br/><p>Thinking this, Andy had never read a book with so much focus. The theory of the potions, the brewing process, the ingredients, the formula, the elements... he didn’t sleep the whole night, flipping through the book, reading so thoroughly that he could have memorized it.</p><br/><p>In actuality, Introduction to Magic Potions made him feel empathy, it was weird, but he could feel it, as though the person who wrote this book shared some unnamed similarity with him.</p><br/><p>And so, just as daylight broke, he climbed out of his tent with dark circles under his eyes, but full of energy. He wanted to quickly try experimenting, but was worried about bothering Benjamin, so with complicated feelings, he waited outside the tent.</p><br/><p>\"Andy? Do you want to try brewing potions?\"</p><br/><p>The thing was, Andy hadn’t even said anything. Benjamin noticed his arrival through the tent, opened the tent door and looked at him expectantly.</p><br/><p>At that moment, Andy felt very nervous, he couldn’t even say a word. So, he simply held the book tightly in his hands, nodded his head - indicating a yes.</p><br/><p>And so, Benjamin invited him into the tent, took a bunch of ingredients from magical creatures out of his bag, along with the instruments required to brew potions – a small mouth wok that could replace a medicine furnace, and a big oil lamp to replace the fire source.</p><br/><p>\"It’s a little shabby.\" Benjamin laughed apologetically and said, \"you can use these, don’t be afraid of failing, a lot of people have difficulty succeeding during their first try.\"</p><br/><p>Andy took a deep breath, knelt down and arranged the things in front of him.</p><br/><p>He wanted to say something, to reassure his nervousness, but when he saw all the ingredients, he couldn’t stop himself from starting. Following the instructions in the book, he started to handle the ingredients. Once he started, the everything else was promptly forgotten.</p><br/><p>Benjamin looked as though he wanted to say something, but didn’t say anything.</p><br/><p>For his first potion, he decided to choose the basic healing potion. The fluff of an undying sheep, the leave of a watery rose apple tree, and the blood of a wind wolf. The healing potion only required three ingredients and Andy quickly picked them out.</p><br/><p>He poured the wind wolf blood into the small wok, and started the oil lamp. The whole scene was the same as a housewife making soup, there was none of the mysteriousness that a mage should have</p><br/><p>Not that Andy cared anyway, he just faced the wok, chanting a weird and brief spell.</p><br/><p>Following the guidance of his mental strength, a small amount of water materialized and gathered, and entered pot alongside the blood. At that moment, the color of the blood changed from dark red to a much lighter shade of red; under the ministrations of the fire, it was about to boil. Seeing this, Andy quickly took the fluff of the undying sheep and threw it in.</p><br/><p>The blood in the wok, suddenly changed to black.</p><br/><p>What? Andy was stunned. Then, his shock changed to disappointment.</p><br/><p>\"I, I failed…. It was written in the book, when it came to this point, the wolf’s blood should gradually be turning white. If it turned black, it would be because my timing was off. I failed…\"</p><br/><p>Benjamin acted as though nothing happened, took the pot, threw out the black liquid, and put the pot back in front of Andy, smiling gently at him.</p><br/><p>\"Failure is very common, don’t give up just because of a setback. How do you think all successful people work? Think about why you failed, then try again.\" he said.</p><br/><p>Upon hearing this, Andy took a deep breath, and became calm.</p><br/><p>\"I...I was too nervous. I forgot to use my mental strength to feel for the change in the ingredients.\" He opened his mouth, like he was speaking to Benjamin, but looked like he was speaking to himself, \"every element in the ingredients is different, so, every time a potion is brewed, I need to be specific to the current set of ingredients, choosing different moments, adding different amounts – the same ingredients don’t have the same brewing process.\"</p><br/><p>Benjamin looked at Andy with excitement in his eyes but Andy didn’t even notice. He continued talking to himself, head bowed, pouring the wolf’s blood into the wok again, lighting the fire and repeating the process.</p><br/><p>Directing the water, adding in the fluff of the undying sheep, gathering the wind, adding in the leaf of the watery rose apple tree...</p><br/><p>Benjamin was bursting with admiration. He stood up, trying not to bother the other person, and tip toed out of the tent.</p><br/><p>Half an hour later there was suddenly a loud cheer from the tent. Even Benjamin, who was having breakfast with the other mages, got a fright. Everyone turned to see Andy with dark circles, dirty clothes, holding a black wok come running out.</p><br/><p>\"I, I did it!\"</p><br/><p>The black wok held something very small, but gleamed a bright blue under the sun. With all eyes on him, Andy lifted the wok like he was revealing a prized, precious blue gem.</p><br/>\n</div>"}