{"title": "Chapter 199: Disappearance", "id": 199, "volume": 2, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-199-disappearance", "volume_title": "Volume 2", "body": "<h1>Chapter 199: Disappearance</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 199: Disappearance</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Even though Benjamin did not count them all, but through a rough estimate, he could tell that this group of people were about thirty men strong.</p><br/><p>He had a bad feeling about this.</p><br/><p>It didn’t matter that he was unsure of their identity or purpose, but they may be just a random group of travelers that were passing through, but to Benjamin they were already a nuisance. They even chose this remote small pass, the only reason is to hide away from prying eyes. To encounter this group of people, isn’t it just the same as revealing their tracks?</p><br/><p>So, he had to think of something, to deal with the situation in front of him.</p><br/><p>\"Didn’t you say that we would not meet anyone if we took this road? What is this then?\" he couldn’t help but question in his mind.</p><br/><p>\"What can I do? These people don’t like taking the major roads, it can’t be helped.\" The System explained, \"If you want to blame anyone, blame your own bad luck, no matter how far out the road, you still met someone.\"</p><br/><p>\"...\"</p><br/><p>Benjamin noticed the System had recently reverted back to its disagreeable self. Even if he was in the space of consciousness reprimanding the System, the System will just put a \"come hit me\" face, stubborn and reckless, Benjamin didn’t know how to handle it.</p><br/><p>Sadly, he shouldn’t think that violence can surely treat this problem. The System would only be subdued for a little while, before recurring worse than before.</p><br/><p>Benjamin sighed in frustration.</p><br/><p>He returned to reality and observed for a while, while his emotions slowly relaxed. From the thirty or so unknown individuals, Benjamin did not sense any spellcasters’ spiritual energy or the movements of the elements. They were normal people, unrelated with the mages or the church.</p><br/><p>But only, looking at their clothes...</p><br/><p>They wore something that looked like it was made of leather, with long swords at their waists, they were all bearded, strong, buff men, their movements were slow but it exuded a faint but dangerous vibe. Benjamin suddenly realized, these were a group of mountain bandits.</p><br/><p>\"Are there any mountain bandits in this region?\" he asked the System.</p><br/><p>The System answered: \"There shouldn’t be, but they could be a new group that just arrived, or maybe we’re new to Icor, and don’t have enough information. Maybe there are mountain bandits here, but we did not know about it.\"</p><br/><p>Is that so...</p><br/><p>Hearing this, Benjamin shrugged.</p><br/><p>Whatever it is, if they really are mountain bandits, then things were easier for them. Not wanting their travel route exposed, Benjamin just needed to get rid of this group of mountain bandits, then nothing will happen, and it would be doing the locals a service, killing two birds with one stone.</p><br/><p>At the end of the day, everything is done to prevent anyone from discovering their location.</p><br/><p>After observing for a while, and confirming that this group of mountain bandits were just here to set up camp and rest, without alerting them, Benjamin turned around, returning to the mage’s campsite. He quietly woke the mages up, and informed them about the mountain bandits, and they were only a few mountain roads away, and that they should take care of it.</p><br/><p>Hearing this news, the mages became more alert, and did not need Benjamin to motivate them, they were full of excitement and wanted to act. Benjamin a little trouble calming them down before setting up an attack strategy – eight people were to surround them from the outside, preventing any of them from escaping, the others were to rush in and kill all the mountain bandits on sight.</p><br/><p>\"I hate mountain bandits the most! Before in the Kingdom, my desert scorpion was trampled by a mountain bandit!\" a cute, kindly girl named Lara said, but at that moment let out a devilish laugh.</p><br/><p>\"...\"</p><br/><p>Benjamin couldn’t help but think: it was really unfortunate for the mountain bandits to be here.</p><br/><p>And so, under the dark moonlight, aside from the two potion masters that stayed behind to stand guard, and another mage for protection, the rest of the group’s mages moved out, and quietly left the campsite. Under Benjamin’s guidance, they surrounded the mountain bandits camp, then, using the leading mage’s first fireball as a signal, they prepared to attack.</p><br/><p>The poor mountain bandits, they didn’t know what was going on, they gathered together in twos and threes, as though they were saying something, some even laughed.</p><br/><p>Following the low chanting of spells and the subtle wave of magical energy.</p><br/><p>Boom!</p><br/><p>A fireball shot across the air, hitting the outermost mountain bandit. He didn’t even make a sound before he became a pile of ashes. The other mountain bandits seemed shocked at what happened, unsheathing their swords and standing up, and were ambushed by the fireballs from all directions.</p><br/><p>\"Oh my God...\"</p><br/><p>\"Its mages! It’s a mage attack!\"</p><br/><p>\"Master Mage, please have mercy! Don’t kill us, we surrender! We’ll give you everything!\"</p><br/><p>The entire battle was easier than the mages expected. No, this wasn’t even a battle. After the first magical attack, most of them were either dead or injured. The ones remaining lost the will to fight. In that moment, screams for mercy like pigs squealing and could be heard throughout the mountainside.</p><br/><p>The mages took this all in, looked at each other and stopped the attack.</p><br/><p>\"They all surrendered, and no one tried to escape, do we still fight?\" Frank asked.</p><br/><p>\"We should just kill them, a group of mountain bandits, what is the point of leaving them alive?\" Varys shook his head and said, \"don’t believe a word they say, when you’re not paying attention, they will just find a way to escape.\"</p><br/><p>\"Yeah, that makes sense too...\"</p><br/><p>And just as the mages were prepared to attack at the same time, and destroy the mountain bandits once and for all, Benjamin suddenly stood, opened his mouth and stopped the mages.</p><br/><p>\"Wait a minute, I have questions for them.\"</p><br/><p>If he was right, this group of mountain bandits were chased from the place where the mages were supposed to go. If that was so, they might as well ask them if there were any new situations on the road. If they weren’t any, why would a group of mountain bandits come to this godforsaken place?</p><br/><p>To be honest, they only just arrived in Icor not too long ago, and needed more information about it. This group of mountain bandits were natives, to kill them off would be a waste, he should get all the information he can before killing them.</p><br/><p>So, with a sentence, the mages lowered their magic, and the mountain bandits had a look of relief on their faces.</p><br/><p>After thinking for a moment, Benjamin walked out of the darkness, towards the mountain bandits.</p><br/><p>\"Ma, Master Mage, what questions do you have? We will definitely answer.\" One of the mountain bandits spoke to Benjamin, with a look of fear.</p><br/><p>Benjamin asked coolly: \"Where are you from? Why are you here? If I remember correctly, there shouldn’t be any mountain bandits here.\"</p><br/><p>Hearing this, the mountain bandit looked at a loss and shook his head, Master Mage, we are not mountain bandits, you are mistaken, we, we are from the River Fett’s... pirates.\"</p><br/><p>...River Fett?</p><br/><p>When he heard about this, Benjamin frowned.</p><br/><p>That was weird...</p><br/><p>He has seen the map of Icor, he knew of the existence of the River Fett. That was a river in the south of Icor, it was near the border of Icor and Ferelden, not too far from here. If these people were really that group of pirates, then they must have taken half a month to cross the mountains and the valleys to get to this place.</p><br/><p>Earlier this year, to perform a hit, will the pirates drag the weekend so long?</p><br/><p>In that moment, Benjamin felt as though the whole situation was a little suspicious.</p><br/><p>\"Ah... it was the Dame who brought us here.\" This pirate must be really scared, there was no need to scare him further, \"she said she got some news, maybe we could rob a big group of merchants. That we would never be able to finish spending the money we would earn, so we came here.\"</p><br/><p>Hearing this, Benjamin felt even more suspicious.</p><br/><p>A group of merchants?</p><br/><p>What kind of joke is this, where would you find a group of merchants who would take this road? This road that Benjamin and the System specifically chose, to ensure that they would not encounter any villages or cities. This kind of nonsense, why would a group of merchants travel through here?</p><br/><p>Not knowing why, in that moment, Benjamin suddenly felt, this appearance of this group of pirates, definitely had something to do with them.</p><br/><p>He thought about it before asking: \"Where is this Dame? I want to ask her something.\"</p><br/><p>In his initial observation, he felt as though he noticed the only woman in the group, but...</p><br/><p>Where was she?</p><br/><p>The other pirates were just as confused as he was. They looked around them, some even moved the dead bodies of their fallen friends, hurriedly searching. Then, after searching for a while, they couldn’t find the only woman in a pile of men.</p><br/><p>\"Master Mage... the Dame, she is missing, I don’t know where she went.\" In the end, the lead pirate shuffled forward in fear and trembling, in a disbelieving tone of voice, he told Benjamin.</p><br/><p>As for Benjamin, he was just as surprised as them.</p><br/><p>While the pirates were looking, he also used his water particles sensor, scanning through the surrounding areas. But the initial silhouette of the woman was nowhere to be found.</p><br/><p>What is this?</p><br/><p>Where was she?</p><br/><p>The entire campsite of the mountain bandits was surrounded earlier, how can someone slip away?</p><br/><p>If he knew this, when they were attacking, he should have activated his water particles sensor. Then the whole pirate camp will be under his watch. If this \"Dame\" really escaped, unless she escaped when Benjamin went back to camp, it would be impossible for him to miss her.</p><br/><p>But how did she know that she could escape when Benjamin went back to camp, is there such a coincidence?</p><br/><p>Could it be... this \"Dame\" already knew of their existence?</p><br/><p>Benjamin felt stranger and stranger.</p><br/><p>When he was deep in thought, not even realizing where his train of thought was going, suddenly, following a few shouts, in the darkness, two familiar silhouettes came rushing towards them. Benjamin gathered his wits and looked carefully, it was the two potion masters he left to guard the camp.</p><br/><p>Why are they here?</p><br/><p>At that moment, Benjamin felt something was wrong.</p><br/><p>It was just to surround and attack a group of vulnerable mountain bandits, why were so many strange things happening?</p><br/><p>\"What is going on? Why did you come here?\" he frowned, and asked sternly, \"What about Augustine? Wasn’t he supposed to be at the camp protecting you?\"</p><br/><p>Then, Andy and Joanna ran up to him, slowed down, they were panting and stopped for breath before saying hurriedly: \"We, we don’t know, Augustine he... he suddenly went missing!\"</p><br/>\n</div>"}