{"title": "Chapter 204: The Fish That's Hooked", "id": 204, "volume": 3, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-204-the-fish-thats-hooked", "volume_title": "Volume 3", "body": "<h1>Chapter 204: The Fish That's Hooked</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 204: The Fish That's Hooked</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>After completing the process and officially posting the mission, Benjamin left the Mercenary Association.</p><br/><p>The idea of putting up a \"search for himself\" was simple: when the unfamiliar youth appeared, he claimed to be a mercenary, and the \"dame\" seemed to be quite close to him as well. Perhaps this would be a good way to lure them out.</p><br/><p>The Mercenary Association had a uniquely efficient way of dissipating information, a mission posted in one place was instantly receivable in another. Hence, even if the unfamiliar youth and the \"dame\" was in Regina, they too would be able to receive and accept this mission.</p><br/><p>Benjamin didn’t expect them to jump right into his trap, but 200 gold coins isn’t any small sum either. Even if they’re not interested in the job, they’d at least \"pop their heads out\" for a peep by going to the Mercenary Association’s branch to enquire.</p><br/><p>That act of \"popping their heads out\" is all Benjamin needs to catch them.</p><br/><p>He wasn’t afraid of giving himself away either, since the Mercenary Association keeps the its patrons’ identities classified, therefore nobody would know that the one who posted the \"search for Benjamin\" was actually Benjamin himself.</p><br/><p>Despite spending a huge chunk of cash just like that, Benjamin didn’t feel a sense of loss at all. After leaving the Mercenary Association, he went down the main road for a lone stroll towards the exit of Garter.</p><br/><p>It was time he headed to Regina.</p><br/><p>At this time, the Mages too started to execute their roles according to the plan. After disguising themselves, they started leaving in small groups of twos and threes, with Benjamin being the last to leave as he had to make sure everything here was wrapped up properly.</p><br/><p>As he left, he could see the disguised mages in their various identities as they hid in the crowd and pretended not to know each other. Some rode carriages, while the others walked in small groups.</p><br/><p>Benjamin was also quite surprised to find the streets filled with people. With a crowd this size, it was incredibly easy for the mages to pass by unnoticed.</p><br/><p>\"So many people leaving the city... and all headed in the same direction,\" in sight of this, the System suddenly appeared.</p><br/><p>\"While I don’t know much, the Mage Guild seems to be holding an event in the capital, and not just a lame excuse to invite me over,\" Benjamin grimaced,\"plus, look at all of this! The event seems to be much bigger than we thought.\"</p><br/><p>While it wasn’t as crowded as the time the citizens were escaping from Havenwright’s \"Plague\", this was still a stunning crowd, so large that Benjamin couldn’t help but activate the Water Elemental Sensing Technique so that he could tell where the mages are in the crowd.</p><br/><p>Despite the massive amount of people, everything was strangely orderly. It was as if this was something that happened every other day.</p><br/><p>Because of that, the journey was uneventful, even Benjamin didn’t get into accidents of any sort. After a day and a half of travelling, they finally arrived at the capital of Icor, Regina.</p><br/><p>The city walls were as dark as night, extending endlessly towards the mountains on both sides, wrapping the kingdom’s heart within its embrace. Regina wasn’t always ‘Regina’, it used to be just another middle sized city of Western Helius until a princess from Helius decided to name herself queen and form Icor as an independent nation, thus choosing this city as its capital. The princess became a queen, and the term \"Regina\" which refers to the reigning monarch, became the name of the city.</p><br/><p>Perhaps it was due to its lack of a long history, Regina looked a little shabby compared to the capital of Helius.</p><br/><p>However one thing was for sure: the city was very much alive even as Benjamin arrived late at night.</p><br/><p>Trade convoys moved in and out of the city, along flat paths made specifically for their carriages carrying valuable goods. If one regards Havenwright as two faced with its inner and outer segregation, Regina would be like an aggressive young entrepreneur who just earned his first million and is trying to reinvest it for even greater wealth.</p><br/><p>While walking on the streets of Regina, aside from its citizens rushing about their day, Benjamin also noticed that many of the shops and houses had coloured flags hung on them. Even the trees on the streets were decorated with colourful flags. The entire city reverberated an aura of festivity.</p><br/><p>\"Do you have data on the culture of Regina? What festival are they celebrating?\" Benjamin asked The System in his heart.</p><br/><p>\"Even you’ve never seen something like this, where do you expect me to get the data from?\" The System replied instantaneously.</p><br/><p>That was true…..</p><br/><p>Benjamin could only shake his head.</p><br/><p>Just like this, all three groups of Mages and Benjamin made it into Regina. They booked rooms in three different inns close to each other. After which, they all gathered in one of those rooms for a brief discussion on what was next in their manhunt, before leaving back to their respective rooms before anyone could make out their disguise.</p><br/><p>As it wasn’t exactly an early hour anymore, they decided to just observe for tonight and only begin seeking information tomorrow.</p><br/><p>As for Benjamin, he assumed the same look he had on when he visited the Mercenary Association and went to its branch in Regina to see if his bait lured the rats out of their holes.</p><br/><p>What he heard when he arrived was beyond belief.</p><br/><p>\"Sir, the mission you posted has been completed,\" the old man by the counter replied him,\"you can set a time and place to meet the mercenary. After meeting, he will report to you about the mission and if you’re satisfied you can give us the payment and we will pay the mercenary.\"</p><br/><p>Upon hearing this, Benjamin was stunned.</p><br/><p>Completed?</p><br/><p>He had intended to just lure the guy out, but he didn’t expect that unfamiliar youth to walk right into it!</p><br/><p>In this moment, he didn’t know whether he should be happy, or suspicious.</p><br/><p>The Mercenary Association’s confidentiality when it comes to client privilege was without doubt, else they wouldn’t have a reputation like they do today. Hence, the youth probably doesn’t know that this is a trap.</p><br/><p>After all that deliberation, Benjamin could only conclude: This unfamiliar youth must really, really like money.</p><br/><p>Perhaps it was the attraction of 200 gold coins, plus some narcissism that drove the unfamiliar youth to take on the job like it was a quick way to make money.</p><br/><p>While it seems ridiculous, it wasn’t unbelievable either.</p><br/><p>\"Alright, let’s not wait anymore, let’s meet tonight,\" Benjamin suddenly said,\"tonight 11pm, Epson Inn at the south of the city, 3rd floor 5th room. Tell him that I will be waiting for him there.\"</p><br/><p>If possible, he wanted to find Augustine as soon as possible and then leave Regina before anything else happens. Benjamin was afraid that dragging it out might lead to unnecessary complications.</p><br/><p>Might as well just end it all toninght.</p><br/><p>\"Oh… let me see. Yeah ok,\" the old man took out a weird book and flipped it,\"you’re lucky, that mercenary happens to be in the city, We should be able to contact him. He will be there on time.\"</p><br/><p>Benjamin smiled in approval and nodded.</p><br/><p>After confirming some details, Benjamin turned around and left the Mercenary Association. He looked at the time, it was slightly past 9pm, he still had at least 2 hours to prepare.</p><br/><p>The first time he met the unfamiliar youth, he did not think about using Magic Potions to enhance his ability so he was at a disadvantage. This time however, it would be the unfamiliar youth who will be caught unprepared.</p><br/><p>Upon thinking about this, Benjamin couldn’t help but smile stupidly.</p><br/><p>That fool had invited him to Icor with a loose piece of fabric. Now, out of respect, he should return the favour.</p><br/>\n</div>"}