{"title": "Chapter 201: Not One Less", "id": 201, "volume": 3, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-201-not-one-less", "volume_title": "Volume 3", "body": "<h1>Chapter 201: Not One Less</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 201: Not One Less</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>A myriad of thoughts flashed through Benjamin’s mind when he read the sentence. The fact that she first became the wife of the bandit leader and then proceeded to become the lead bandit was mindboggling enough to cause Benjamin to suspect that there was some hidden agenda beneath the surface – Benjamin was unwilling to believe that she did not plan the timely meeting between the bandits and the mages. No, the timing was too accurate to be a coincidence.</p><br/><p>But then, what was her motive?</p><br/><p>Benjamin tried hard but could not understand her actions. Could it be that there was a personal conflict between her and Augustine? Could that be the reason why she kidnapped him?</p><br/><p>Anyway, there was no use for him to brood over these thoughts. Benjamin bowed his head to look at the letter in his hand as he sank into his thoughts. This crumpled draft of a letter that was repeatedly corrected became the only clue to Benjamin in this dimly lit space.</p><br/><p>There was no doubt that he must find Augustine and get him back. These people believed in him, believed that Benjamin could lead them to a bright future. Benjamin would hate himself if he disappointed them and betrayed their trust. He led these mages to leave the Kingdom of Helius, but he would still be stuck in the Town of Crewe if it was not for the help of these mages.</p><br/><p>He would not allow any of them to be in danger under his watch. No, not even one could be hurt.</p><br/><p>Benjamin chuckled as he laughed at himself. For some reason, he suddenly remembered a movie that he watched when he was young – . He felt like the teacher in the old movie who met this bunch of people by chance. They knew each other for less than a month, and somewhere along the way Benjamin became their leader. A thought stubbornly latched onto him.</p><br/><p>He will bring these amateur mages out of Icor, and he will find a place for them to live freely.</p><br/><p>Benjamin was by no means a noble or great person. He just felt that he had the responsibility to do so.</p><br/><p>\"It was always said that humans are an overly-sentimental bunch. I finally witnessed this quality in action today.\" The System interrupted sarcastically, insensitive as ever.</p><br/><p>\"If sentimentality was not allowed, where then can I generate my courage? Might as well retire early and rest.\" Benjamin shrugged.</p><br/><p>\"…. Whatever that makes you sleep better at night, I guess.\" The System nonchalantly replied.</p><br/><p>Benjamin ignored the System. He held the paper tightly between his fingers, eyes shut as he considered the situation. Soon, he arrived at a decision.</p><br/><p>\"All of you should continue with the journey after you’ve dealt with these bandits. Follow the route we had before, and go towards the place where we’ve agreed previously.\" Benjamin turned towards the mages. \"Don’t worry about me. I’ll be right behind you.\"</p><br/><p>\"Sir Benjamin…. Are you going to find Augustine by yourself?\" Varys asked. He sounded hesitant.</p><br/><p>Benjamin nodded.</p><br/><p>\"I want to go too! You can’t leave us here. I’ve mastered the Flight Spell, I will not hinder you!\" Joanna jumped out and exclaimed.</p><br/><p>Quite a number of mages became agitated after that. Augustine was their companion to begin with; they knew him much longer than Benjamin did. It was impossible for them to sit by and do nothing. Everyone of them made a racket, wanting to follow Benjamin in his quest to get Augustine back.</p><br/><p>Although Benjamin was touched by their actions, he was torn on what to do.</p><br/><p>Judging from what was written in the letter, this dame most likely brought Augustine to the capital – Regina. Even if she did not go there, Benjamin still needed to find the person named ‘Sidney’ to obtain some clues. Thus, Benjamin had no choice but to go to Regina.</p><br/><p>Trouble was brewing around the capital judging from the actions of the Church and the Mage Guild. That was why Benjamin still felt that it was more convenient for him to go alone. There was a probability that an accident would happen if he led the group there; how could he manage to protect them all then?</p><br/><p>\"No, you would really be an inconvenience to me,\" he answered.</p><br/><p>Benjamin intended to say something tragic and sentimental to contrast himself as a lone hero, but he realised posthaste that he was unfortunately unskilled in that department; the words seemed to carry a different meaning than what he imagined in his mind.</p><br/><p>They seemed quite….insulting?</p><br/><p>The mages who heard his answer became quiet as they looked at Benjamin.</p><br/><p>Just as Benjamin was puzzled whether he should make up some bullshit to comfort the crowd, Laila suddenly declared righteously, \"That’s true, we’re really too weak. Teacher Benjamin, would you bear to see us go on alone? What if another one of us was abducted after you left? What do we do? If you don’t bring us along to get Augustine, we will die in the next attack by magical creatures! When that happens, we will never let you off even when we become spirits!\"</p><br/><p>\"....\" Benjamin was stunned silent by the utter shamelessness presented to him. What else can he say?</p><br/><p>His concern was misplaced. Which neuron in his brain decided to fire wrongly? He has interacted with these people for such a long period of time, he should have known that his previous words will not even leave a scratch on their ego. In Benjamin’s logic, these people can never be defeated.</p><br/><p>Well, shit then. The sappy atmosphere that he poured much effort to brew was gone just like that.</p><br/><p>At last, Benjamin sighed, \"Are you sure that you want to follow me?\"</p><br/><p>The faint moonlight illustrated the impish grins of these mages, and more than 20 heads nodded fervently at Benjamin. His lips twitched at the sight.</p><br/><p>\"Okay then.\" Benjamin shook his head, smiling. \"Let’s go and save Augustine from the hands of that dame!\"</p><br/><p>The mages broke into cheers. Benjamin politely pushed away a hug-seeking Frank who jumped towards him. Benjamin flashed a closed-mouthed smile. Although Mage Laila exaggerated the situation, there was a valid reasoning behind it; no one could expect the dangers that would happen in the next part of the journey. If Benjamin left just like that, he would never be able to help if an accident really did happen. He would be in Regina!</p><br/><p>Might as well stick together and bulldoze their way through any problems. No matter how chaotic the capital is, at least they will die together, no?</p><br/><p>Hm… Yup, this outlook was really optimistic!</p><br/><p>Benjamin and the squad did not hesitate after they confirmed their course of action. Augustine and the ‘dame’ disappeared not long ago. They left right after they dealt with the remaining bandits. Those who can fly flew, and those who did not ran; they started to search the areas nearby for their traces.</p><br/><p>Unfortunately, they did not manage to find anything even after a long period of search. Not even a trace of magic release was detected, what more people. It was as if Augustine was taken away without a fight, and the ‘dame’ left so fast that they could not even catch up with her even if Flight Spells were used.</p><br/><p>After they searched halfway through the night, they were too exhausted to continue. They had no choice but to put up their tents again and rest for the night. At the next day, they continued their search while they were on their way to the capital.</p><br/><p>After they changed their route and searched throughout the way, it was unavoidable for them to go back onto the main road and meet other pedestrians. Thus, they started to consciously hide their identity by changing their appearance to look like merchants. Varys, who was originally a merchant, led the team; the things they got from the magical creatures were disguised to be cargo. They continued northeast.</p><br/><p>Sadly, whether from questioning the pedestrians or traces of magic oscillation, they did not uncover any clues about the whereabouts of Augustine and the dame.</p><br/><p>They went past several small villages like dragonflies skimming on the surface of the water. They arrived at a city named Garter. In this city next to Regina, they finally caught wind of the traces of the ‘dame’.</p><br/>\n</div>"}