{"title": "Chapter 207: The Healthcare Anecdotes", "id": 207, "volume": 3, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-207-the-healthcare-anecdotes", "volume_title": "Volume 3", "body": "<h1>Chapter 207: The Healthcare Anecdotes</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 207: The Healthcare Anecdotes</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Benjamin was surprised to hear that from the woman. But, he did not immediately take any action, nor did he answer Sidney; he just retained the wide-eyed facial expression, and used the water particle sensing technique to scan through the entire shop.</p><br/><p>The room opposite the hallway, the second floor accessible by the stairway, the kitchen... the shop was not big, except for some things that were unsightly, Benjamin thoroughly scanned through the place.</p><br/><p>But he did not find a soul.</p><br/><p>He did not find the \"Dame\" hidden among the bandits, and he also did not notice the teenage stranger who revealed his identity. Needless to mention about the kidnapped Augustine as his shadow was nowhere to be found.</p><br/><p>This made him a little disappointed.</p><br/><p>It seemed apparent that those two people did not stay at Sidney’s place.</p><br/><p>\"Hey, what are you daydreaming about? If you have something to say just spill it. Why were you looking for me?\" Perhaps it was because Benjamin took some time to scan the entire shop, and so Sidney wore an impatient look in her face as she urged him to speak.</p><br/><p>\"I’m sorry.\" Benjamin gathered his wits, he thought about it before giving her an excuse, \"Not too long ago the River Fett had a merchant shop that was attacked by bandits. There was a blonde woman who was kidnapped by the pirates. I was asked by someone to look into this matter. I heard that you were a friend of the woman. Have you heard from her?\"</p><br/><p>An odd expression surfaced in Sidney’s face as she heard Benjamin speaking. She did not answer immediately.</p><br/><p>Benjamin was happy to see Sidney’s response.</p><br/><p>Did he need to ask more? If she did not know anything, how could she react this way? He found the right person. The Sidney that was mentioned in the crumpled letter was definitely this Sidney.</p><br/><p>He was definitely at the right place.</p><br/><p>Of course, even with his excitement, Benjamin did not put down his guard. Honestly, he was already saving his magic in the Space of Consciousness. He could attack any time in case such a need would arise.</p><br/><p>Even with his face looking as normal as possible, but his mind was as taut as a bowstring. The quiet Sidney finally decided to speak.</p><br/><p>\"Where are you from? Carretas or Ferelden?\" The indifference in her voice disappeared like smoke in the air; suddenly glaring at him with an icy glare, making Benjamin surprised for a moment.</p><br/><p>Where was he from?</p><br/><p>What did it mean?</p><br/><p>Benjamin hesitated for a while, crossing his arms across his chest and calmly replied, \"I don’t understand what this sentence means. The two countries that you mentioned, I have never even been there once.\"</p><br/><p>Upon hearing this, Sidney was stunned, and suspiciously asked, \"So you are saying that you are not here to assassinate us?\"</p><br/><p>\"Why would I want to assassinate you?\" With plenty of experience in disguising, Benjamin’s expression looked especially sincere, \"I just want to find the lady, to find out what really happened. That’s all.\"</p><br/><p>\"Is that so?\"</p><br/><p>\"Of course it is. If I am here to assassinate you, then I should have brought a few more guys. Why would I appear here alone?\"</p><br/><p>\"That’s true...\"</p><br/><p>Benjamin maintained his innocent and sincere expression for a while, until finally, the doubt lingering in Sidney’s eyes slowly faded away. Even though her expression still showed a little confusion, but it seemed like she had already dropped her guard around Benjamin.</p><br/><p>After pausing a while, finally Sidney broke her silence.</p><br/><p>\"A few days ago, when she first came to Regina, she came by to see me. But, I don’t know anything about what happened on the merchant ship.\"</p><br/><p>Benjamin immediately asked, \"Then do you know where she is now? Don’t worry, I really don’t have any ill intentions toward you. I just have a few questions I wanted to ask her.\"</p><br/><p>After hesitating for a while, Sidney nodded and said, \"She is still in Regina, I’m not too sure where she is staying. But she comes by to see me every two days, when the time comes, I can help you ask her what happened, but...\"</p><br/><p>Just as Sidney was talking, and she was about to continue her sentence, suddenly, she placed her left hand went beneath the counter and drew out a gun. She aim the gun at Benjamin and her facial expression had a dramatic change, followed by a cold laugh. She did not hesitate as she pulled the trigger.</p><br/><p>Bang!</p><br/><p>\"Did you really think you could lie to me?\" She said as she pulled the trigger.</p><br/><p>The taunting words followed by the loud bang of the gun going off, echoed in the dark and dank \"massage\" parlor. Sidney and Benjamin were not very far away from each other. The gun came out of nowhere and there went the bullet immediately out of the chamber, and was suddenly at Benjamin’s nose.</p><br/><p>But Benjamin did not look at all panicked.</p><br/><p>Just as she fired a shot at him, a thin film of water appeared before him. The bullet hit the film of water; causing a faint sound before harmlessly bouncing off, and fell to the ground. It did not even break the skin of his nose, much less kill him.</p><br/><p>A bullet that had never been cast with magic spell would not be able to break a simple magical barrier.</p><br/><p>Just then, Sidney’s taunting laugh seemed frozen.</p><br/><p>Very obviously, Benjamin was very prepared for what was going to happen. The gun that Sidney kept hidden behind the counter, was already discovered by Benjamin when he was scanning through using the water elemental sensing technique. He only acted as though he did not have a clue.</p><br/><p>\"I didn’t mean to lie to you.\" He innocently opened his arms and said, \"I was just lazy to attack, so I wanted to try my luck, just in case you really were silly, then I would benefit from it. Unfortunately, I still had to do something.\"</p><br/><p>He squinted as he spoke, smiling at Sidney.</p><br/><p>Sidney’s hand that was holding the gun trembled a little.</p><br/><p>\"You, you are a mage.\" From just her voice you could hear, even though she tried really hard to suppress it, but she was panicking, \"Ferelden’s mage, I knew there would come a day when they come after me, but I never thought...\"</p><br/><p>\"I am in fact a mage, but I have got nothing to do with Ferelden.\" Benjamin could only shake his head and say, \"Even though I told you a lot of lies, but believe me, this one is true.\"</p><br/><p>Unfortunately, she did not believe a word he said.</p><br/><p>After the failed attempted murder, the \"massage\" parlor boss, could only see the gun in her hand, suddenly, she turned the muzzle of the gun and pointed it at her temple.</p><br/><p>She was ready to kill herself.</p><br/><p>\"You should just give up; I will never say anything...\"</p><br/><p>Luckily, after experiencing the incident where the priest committed suicide, Benjamin had some experience in this matter. And so, before Sidney could pull the trigger, he conjured a water ball without even using a half a second and he hit her with it.</p><br/><p>The poor fellow, she could not even complete her suicide speech, but was hit by a water ball that was bigger than a person. At that moment she lost her balance and fell to the ground. The gun flew out of her hand, and Benjamin seized it without hesitation by controlling a water mass that got dispersed from the water ball.</p><br/><p>Then, Benjamin used the icebreaking spell to conjure some ice cubes, and immobilized the dizzy Sidney.</p><br/><p>\"Oh... oh my God, it’s so cold.\" Her teeth chattered as her limbs were locked in ice.</p><br/><p>Obviously, once you remove her swaggering title, she was just a normal person, without the physique of a knight, and with no magic potions to enhance her physique. She was frozen in ice. If she stayed frozen for a longer period of time, she could be paralyzed for the rest of her life.</p><br/><p>But Benjamin did not feel the need to stop just because she was a woman.</p><br/><p>\"I admire the loyalty you have towards your friend.\" His tone was so calm it had a hint of anger, \"Unfortunately, your friend had taken away my friend, and I am not someone without loyalty, so I will not let you go.\"</p><br/><p>Following this short statement, he hardened his tone, just like the assassin on television shows, he asked, \"Where is she?\"</p><br/>\n</div>"}