{"title": "Chapter 214: How to Become a God Stick", "id": 214, "volume": 3, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-214-how-to-become-a-god-stick", "volume_title": "Volume 3", "body": "<h1>Chapter 214: How to Become a God Stick</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 214: How to Become a God Stick</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Maybe the church had more important things to do and this was just not important enough. The number of guards and knights guarding the square did not even come up to a hundred.</p><br/><p>In the beginning, with the assistance of the government’s power and sophisticated weaponry, they could rely on seventy to eighty people and hold the thousands of people in the Square. But now that the unarmed masses were in despair, this kind of trap that relied on psychological pressure will burst faster than bubbles.</p><br/><p>Like blowing the horn to signal the charge, after the first person who ran out, the crowd’s suppressed anger was lit up. They were like man-eating ants leaving the nest, flocking towards that one patrol guard – the stresses of daily life were bad enough, now they were provoked in such a bloody way.</p><br/><p>At that moment, all the guards had their swords out. Some were looking at the surging crowds in panic, some were still confused.</p><br/><p>Sadly, the soldiers will never understand the crowds’ feelings.</p><br/><p>Who asked them to stamp out something that did not even had the chance to live for a few minutes?</p><br/><p>True, their bodies were well-built, their training was effective, their weapons were sophisticated, but under the attack of thousands of people, even the anti-magic armor could not protect their lives.</p><br/><p>The first guy who went onto the steps was shot down by them. The second guy used the first guy as a shield and gave them a punch, but he was shot down as well. The third person hid behind the other two bodies and managed to knock down the guard closest to him to the ground, but he was killed as well...</p><br/><p>When the hundredth person rushed to the steps, he grabbed the sword from the guard’s hands and viciously stabbed it into his enemy.</p><br/><p>The buildings around the Square had never had such a powerful smell of blood. The blood of countless people mixed together, drowning the white steps and flowing down like someone put a dark red carpet down on the dirty floor.</p><br/><p>From his guess, since Regina was built as the capital city, there has never been so many deaths all at the same time.</p><br/><p>Hidden among the endless crowd, Benjamin was starting to have some doubts. He bent his head to look at the blood-stained shoes, not knowing what he was doing now, was it right or wrong.</p><br/><p>The church was motivating a change in government in Regina. The people were still undecided, and their future direction was still not clear. Whatever he did now was like grabbing the gravel from a judge and dropping a heavy sentence on the city.</p><br/><p>From that moment on, countless fates were changed. The car was already speeding up, he could not brake in time.</p><br/><p>As he thought about all this, Benjamin sighed.</p><br/><p>Since he could not break, then at least he should hold onto the steering wheel and direct the car no matter to destruction or to a new beginning. Regardless, he must make the situation go in the direction he wanted.</p><br/><p>Good or bad, right or wrong, it was as though that was not important anymore.</p><br/><p>With the rapidly passing time, morality and logic became two huge mirrors. The reflection was clear but utterly useless. Things were happening one after another, and in the rush, he could only make decisions that he thought were right and walk in an unknown direction.</p><br/><p>And so, in the agitated crowd, the mages also went forward and hit a few guards. But Benjamin specifically told them not to use magic, so their identities were not compromised.</p><br/><p>Truthfully, they did not need to show their magic. Even those who were wearing anti-magic armor could not fight back an attack from a thousand people. On the beautiful armors were dents that were hit by bloody fists.</p><br/><p>That particular knight who killed the first person was almost beaten and hit to a pulp.</p><br/><p>The chaos in the Square lasted for about fifteen minutes. The masses who lost control paced the perimeter, killing all the guards and knights whom they saw. In this kind of fever pitched atmosphere, even the calmest and gentlest child was affected, shoving a knife into the guard’s stomach with no hesitation whatsoever.</p><br/><p>After fifteen minutes, the crowd’s anger was dissipating, and all the guards and knights in this area were killed. Many looked at the messy scene in front of them and fear came over their faces. There were already people who wanted to sneak away.</p><br/><p>As though sensing the crowd’s panic, Benjamin nodded his head, and he felt as though he should stand up.</p><br/><p>As he said the spell to conjure up a pillar of steam, the wind produced by the steam swept through the entire place, and the masses could not even open their eyes. And because of this, no one knew what to do but to look to the source of the wind.</p><br/><p>As the people watched, Benjamin spread his arms open, his back against the sun. In his bloodstained beggar’s outfit, he slowly floated to midair.</p><br/><p>Everyone could not tear their eyes away.</p><br/><p>\"What, what is that?\"</p><br/><p>\"I don’t know; is it someone is here to save us?\"</p><br/><p>Amidst all their discussion, Benjamin did not pay any attention to them. With a calm expression on his face, he gradually flew to the highest point of the Square, and silently watched the bloody Square filled with corpses.</p><br/><p>The noon sun lit him up, just like the spotlight on the dancefloor.</p><br/><p>As though they were being pulled by invisible strings, the clueless people, like sheep following instructions, suddenly followed Benjamin, gathering at the basin-like Square.</p><br/><p>They tried to get as close as they could to Benjamin, in fact, they stood closer than before.</p><br/><p>Everyone looked up, with shocked or stunned looks on their faces. They stared without blinking at Benjamin floating in the sky. The entire Square looked like some sort of religious ceremony.</p><br/><p>Then all the discussion died down. The violence that just happened in the Square did not matter and now, they were as silent as a praying church.</p><br/><p>Only the steam scared the birds that took to the skies and flew around, squawking intermittently.</p><br/><p>In the moment of silence.</p><br/><p>Benjamin finally opened his mouth.</p><br/><p>\"This is a tragedy for Icor.\" He kept his expression composed, trying to make his voice louder, letting everyone hear him clearly. \"The queen is out at war, and the enemy has come into our country, controlling our armies, framing our mages, putting them in prison and gathering the innocent people in the Square. They want to make Regina their own.\"</p><br/><p>With that, countless gasps could be heard echoing throughout the crowd.</p><br/><p>Everyone looked at Benjamin with stunned expressions on their faces. Maybe it was because they had experienced anger, murder, and panic through the whole process, so their minds were confused and they were upset. They didn’t have the energy to doubt Benjamin’s words.</p><br/><p>They just lifted their heads, like birds waiting for their next meal, waiting for Benjamin to wash their panic away with a clean reason.</p><br/><p>\"So, don’t feel guilty for killing those guards, they were bought by the other country, and they only want to destroy all that is good in this country.\" And as the people listened, Benjamin’s voice continued on, \"Icor’s future is in your hands now, you must stick together, then only you can rescue all the imprisoned mages. The enemy’s spies will be chased out, and most importantly, no one will blame you for killing the guards, because you are the heroes who saved the country.\"</p><br/><p>As Benjamin was speaking, he silently controlled water balls that he conjured high up above him, reflecting the light of the sun, and the end result was the light glowing on his body.</p><br/><p>There was no other choice. To try to convince the confused crowd, he had to use the \"package\" deal.</p><br/><p>His thoughts were pure. This group of people could kill all the surrounding guards; it was a crime of passion. After all, they are a group of normal people, and they definitely needed counseling. Now that they have killed the guards, they will think that they are sure to die now. At this moment, they are directionless.</p><br/><p>If nobody came forward to take the lead, then this group of people will definitely be scattered. Some will definitely faint onsite. This was why Benjamin had to stand out and tell them that their actions were not a crime but instead, a heroic act.</p><br/><p>In reality, hope is what this group of people really needed right now.</p><br/><p>In other words, Benjamin turned reality into something that they were willing to believe in – they could only believe in everything Benjamin said. If they did not, then they would become criminals who ruined their lives, they might as well die. So why would they not believe?</p><br/><p>Thus, Benjamin, who was lit by a circle of light, became the best medicine for their souls.</p><br/>\n</div>"}