{"title": "Chapter 228: Leaving Regina", "id": 228, "volume": 3, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-228-leaving-regina", "volume_title": "Volume 3", "body": "<h1>Chapter 228: Leaving Regina</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 228: Leaving Regina</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>After listening to this story, Benjamin felt a shiver down in his spine.</p><br/><p>If what was told by the Guild Master was true, and the Queen had really used this strange method to control the Mage Guild, then Regina was a rather dangerous place for them to be at.</p><br/><p>If the Queen knew Benjamin and the group were here, they might be forced to be ‘recruited’.</p><br/><p>Just that...</p><br/><p>\"By telling me all these things, do you wish for me to help you guys?\" Benjamin suddenly spoke and asked this.</p><br/><p>Upon hearing this, the old man showed a bitter smile and shook his head. He said, \"You can’t help us. Her Majesty the Queen has a strong army and thirty elite mercenaries to protect her at all times. She never meets the mages alone. She doesn’t reveal any loopholes to us. Except for the three mages in front of you, I can’t even tell which mages are informers who betray our information to the queen, and which ones are independent ones.\"</p><br/><p>... Was she so hard to deal with?</p><br/><p>Benjamin could not help but be afraid.</p><br/><p>Obviously, from getting the mages’ trust to using the potion to control the mages, the Queen was well-prepared since the beginning. Until the mages realized that something was wrong, they had already missed the timing to fight against her. They could not even find a companion whom they could trust, so it was even more impossible for them to stay together and fight against the Queen.</p><br/><p>In other words, what the Queen used to control the mages was not the potion; it was the system in which the mages doubted and controlled one another.</p><br/><p>\"But you should know that the last person who used your method to practice was the Pope of 4th generation.\" At the same time, the old man continued to talk. \"I do not know what will become of you in the future, but I hope that you won’t be stuck in this situation. You must leave Regina before tomorrow. Leave Icor as soon as possible and go to another place.\"</p><br/><p>Benjamin thought for a while and said, \"Should I trust you?\"</p><br/><p>The old man smiled bitterly as he said, \"You can only trust us. You don’t have a choice. If I wanted to do anything to you, I would have done it by now. Do I need to tell you all of these?\"</p><br/><p>Upon hearing this, Benjamin could only nod. He could not refute that.</p><br/><p>If the old man had other motives, he would have no way of defying him anyway, right?</p><br/><p>Moreover, their original plan was to leave this troublesome place as soon as possible.</p><br/><p>Regardless of whether the story told by the Guild Master was true or fake, being able to find Augustine and leave the city peacefully were enough for him.</p><br/><p>\"Okay. I will bring everyone tonight and go to the place as you mentioned.\" he said. \"Thank you, Sir, for your help. We will leave Icor as soon as possible.\"</p><br/><p>Upon hearing this, the old man finally nodded in satisfaction.</p><br/><p>\"I do not mean to help you. I only want to leave a little hope for magic.\"</p><br/><p>As if he heard the tone of guilt in his words, Benjamin fell silent for a moment then spoke suddenly. \"Maybe... One day, we will be back.\"</p><br/><p>Any mage has the right to live in freedom.</p><br/><p>The old man appeared as if he did not take his words seriously. He smiled and simply waved. Then, he brought the three mages who were dressed as soldiers and left the hotel room quietly.</p><br/><p>Benjamin stared at their backs when they left, deep in thought. He tried to reorganize his thoughts about what happened today. After confirming that his choice should not have any problems, he gathered all the other mages and told them this news.</p><br/><p>To save time, the whole story of the Queen manipulating the entire Mage Guild was not described clearly to the others. He only told everyone that the time to leave has come. He urged them to pack their stuff quickly and get ready to move out.</p><br/><p>For all the mages, they were rather happy about this news. After all, the days of hiding in the hotel were really bad. They even had to be careful when they wanted to meditate for a while.</p><br/><p>After packing his stuff, Benjamin also went to the Mercenary Association to leave a message for Chief Silverfox. This was done to prevent him from doing extra work. For the curse that was left at the massage shop, Benjamin was too lazy to care about it. He just kept it there. Maybe some time in the future, the curse might be of unexpected use to them.</p><br/><p>It was already night time after he finished all the remaining work. Benjamin and the group quietly left the hotel, avoiding the patrolling soldiers on the street. They eventually came to Regina’s West Gate.</p><br/><p>As expected, at a hidden corner of the street, they found four carriages.</p><br/><p>Through Water Particle Detection, they confirmed that there was nothing strange about the carriages – no ambush or anything of that sort, then they walked towards the carriages.</p><br/><p>\"You are finally here.\" Hawk walked down from one of the carriages and spoke in a soft voice. \"Okay, let’s get everyone in. We have the documents signed by the Guild here. No one will stop us from leaving.\"</p><br/><p>All of the mages exchanged some glances, then nodded and entered the carriages.</p><br/><p>In the carriage, they saw Augustine whom they had not seen for so long. This unfortunate middle-aged uncle was knocked out unconscious in Town of Hank. Now that he saw Benjamin and the bunch, he was so excited as if he was reuniting with his family.</p><br/><p>Benjamin repeated what happened in these few days to him. Unexpectedly, he showed an expression of regret and complained. \"It’s such a pity. Such exciting things happened, yet you guys didn’t call me up to join.\"</p><br/><p>\"...\"</p><br/><p>Nothing could help this bunch of people anymore.</p><br/><p>Soon, the carriages moved out from the corner on the street and came to the Gate. Hawk took a letter-like thing to the front and communicated briefly with the soldiers on guard. Without much delay, the soldiers opened the gate and let them leave Regina.</p><br/><p>Upon seeing this, Benjamin became more at ease.</p><br/><p>After they left the city, the four carriages first sprinted forward, then they changed the direction until they slowly deviated from the main road. They bypassed Regina and began moving towards the east.</p><br/><p>\"There are the least roadblocks in this route.\" Hawk explained. \"I can only send you guys out of the defense line of the east of the city. After this, you’ll have to walk the remaining journey.\"</p><br/><p>Benjamin gave him a smile as he nodded. \"I know what to do.\"</p><br/><p>From Regina to the border of Icor, the journey would take more than ten days. If nothing happened, they would only need to find the right timing and fly over the border. The Queen could not do anything to them there.</p><br/><p>On their journey, they would have to be extra cautious as well. They have to make sure that they would not bump into bandits and have their people missing all of a sudden.</p><br/><p>Just like this, carrying on their journey in the night, they bumped into the guards that the Queen used to check for spies. But with the documents from the Mage Guild in their hands, those guards not only did not stop them, they also released them in a respectful manner.</p><br/><p>Soon, after around half an hour, they were far from Regina, almost out of the defense that was specifically set up around this area.</p><br/><p>\"It is almost time. I can only send you guys a little further.\" As Hawk was speaking, he took something out of the bag and passed them to Benjamin. \"These are the maps of Ferelden and Carretas. I am not sure where you guys are heading, so I’ll give both to you. And this, this is a book about the culture of the local communities. You can look through it in your free time, so that you will learn more of the news of these two countries.\"</p><br/><p>Benjamin received the things from him in surprise.</p><br/><p>\"Thank you.\" He said with gratitude.</p><br/><p>\"This is nothing much. They are not valuables anyway.\" Hawk shook his head and replied nonchalantly.</p><br/><p>However, just as Benjamin was keeping the maps and book in the bags, a loud noise was heard from outside of the carriages.</p><br/><p>\"Who are you? Come out of the carriage. We are under the orders of the Queen to inspect those</p><br/><p>who leave the city.\"</p><br/><p>Upon hearing this, Hawk showed a slightly strange expression. But he still took the document from the Guild that used to work before and went out of the carriage, prepared to deal with possibly the last point of defense to go through.</p><br/><p>However...</p><br/><p>\"Hawk, why are you here? Who are these people in the car? Is there a new mission to carry out? Why didn’t I hear of this?\" Among the soldiers on guard, the one leading them appeared to be a mage as well. He recognized Hawk and so he asked in a rather doubtful tone.</p><br/>\n</div>"}