{"title": "Chapter 224: A State of Nothingness", "id": 224, "volume": 3, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-224-a-state-of-nothingness", "volume_title": "Volume 3", "body": "<h1>Chapter 224: A State of Nothingness</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 224: A State of Nothingness</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Benjamin could only slowly begin to accept the fact that the System had now become a 5-cent-special-effect \"funny\" emoji after 10 minutes straight of laughing.</p><br/><p>It doesn’t matter now... He never had high expectations for the System in the first place.</p><br/><p>\"How did you save me from the dagger?\" He faced the taunting face, trying to maintain a serious expression, \"What’s your new ability? Show me.\"</p><br/><p>\"Ah, about that...\" the System’s tone suddenly turned a little awkward. \"Honestly, I’m not so sure what happened either. But if you return to reality, I can show you again.\"</p><br/><p>Return to reality? It can’t do it in the Space of Consciousness?</p><br/><p>Thinking along these lines, Benjamin left the Space of Consciousness and returned to his room in the hotel feeling confused. He was daydreaming on the bed; his surroundings were very quiet, with not much noise around.</p><br/><p>\"Can we begin now?\" He asked silently.</p><br/><p>\"Hold on, it won’t be much longer...I’m counting down now, 3, 2, 1, start!\"</p><br/><p>Following the System’s countdown, Benjamin’s sight suddenly blurred. He found himself in a posture as if he fell straight from the surface of the bed to the ground - his back slammed into the floor.</p><br/><p>What the hell? Benjamin was bewildered.</p><br/><p>Feeling around the inky-black darkness beneath the bed along with his face full of dust, he rubbed his eyes and crawled out from under the bed. The hotel room was still the same: the oil lamp shining, with everything strangely quiet. But looking at them now, he felt a wave of confusion.</p><br/><p>\"What happened?\" He couldn’t help asking in his mind.</p><br/><p>\"I activated that power and you went through the bed and fell on the floor,\" replied the System. He went from being on the bed to below the bed? Immediately, Benjamin became curious.</p><br/><p>\"Do it again. This time, try maintaining it for a longer time and stop only when I tell you to.\" His heart once again thumped restlessly, ready to explore this new discovery.</p><br/><p>\"I can’t. Activating this skill is very tiring.\" the System quickly rained on his parade. \"To maintain the state for a longer time is nigh impossible; my RAM was about to explode, I could crash.\"</p><br/><p>\"...Fine then,\" Benjamin was frustrated but had to reluctantly accept this answer. In his heart, the questions were still unceasing.</p><br/><p>Benjamin didn’t feel anything particularly different when the System unleashed his special power. And yet, judging from the result of him being able to phase through the bed, he had, at one point, seemed to have entered some sort of state of \"nothingness\".</p><br/><p>It was as if he actually became some sort of phantom-like entity, losing the ability to interact with objects and as such, couldn’t lie down on the bed.</p><br/><p>Thinking back now, when Blondie wanted to slit open his throat with her dagger, he also seemed to become this \"nothingness\" This caused the weapon to slice thin air, instead of hacking open Benjamin’s throat.</p><br/><p>Interesting. How is it done?</p><br/><p>The body of the System came from the Pure Blue Space, so if the body gave it a set of abilities, then these abilities should also be connected to the area. But judging from the current results of his observation, this state of \"nothingness\" was quite different from how he felt the last time he entered the Pure Blue Space.</p><br/><p>Benjamin couldn’t help but begin to ponder the principle behind this concept.</p><br/><p>Was he broken down into particles? During the short process, he really didn’t feel anything, not even anything similar to the aura of water particles; it was so strange, it really felt like nothing had happened.</p><br/><p>Once again, Benjamin returned to the Space of Consciousness, held the small yellow ball of \"funny\" emoji in his arms and attempted to obtain more information by interrogate it. The result was just as expected - the System didn’t know how it happened, and stammered for a long while without saying anything useful.</p><br/><p>This method proved to be a dead end.</p><br/><p>The ability seemed to have a long time to cool down. And as such, Benjamin planned to wait until the next time he had time to slowly research it.</p><br/><p>Furthermore, although he couldn’t understand how it worked, but the ability in of itself was very which – it could potentially save his life in all sorts of crucial moments. He decided that as long as it was useful, there was no need to be fuss over the other aspects.</p><br/><p>Thinking along these lines, Benjamin also casually asked if any other new abilities were acquired. The System replied with a negative.</p><br/><p>However, Benjamin wasn’t disappointed. The System was fucking useless in the first place and the fact that it now grown to become a tad bit more useful was already a huge piece of good news. He wasn’t going to ask for much more. One mustn’t be too greedy.</p><br/><p>By the time Benjamin finished examining the System’s changes, it was already close to night time. Since Benjamin didn’t have other errands to run, he entered the Space of Consciousness and began meditating after his dinner.</p><br/><p>After a few hours of meditation, seeing that it was close to 10 o’clock, Benjamin left the Space of Consciousness, exited his room, and got ready to meet Chief \"Silverfox\".</p><br/><p>The purpose of his previous visit to the Mercenary Association was to set up the meeting tonight. Under present circumstances, with various problems waiting to be resolved, he would need more information. Since old man \"Silverfox\" who had many connections, he was clearly the best choice for obtaining said information.</p><br/><p>Benjamin waited patiently for his arrival in the designated room. Chief \"Silverfox\" was clearly someone who is punctual. The moment it was 10 o’clock, he arrived, shut the door and nodded at Benjamin.</p><br/><p>\"What’s wrong? You didn’t get caught up in the commotion these few days, did you?\" asked the old man.</p><br/><p>Benjamin thought of the incident at the square, but didn’t say a word, unsure of whether that counted as him getting involved.</p><br/><p>\"This...Well, it doesn’t matter anymore.\" He shook his head, diverting the conversation, \"Ah right, I wanted to see you today to ask you about some things. I’m not sure if you have news, but do you happen to know what the situation in Regina is right now? If a group of people wanted to leave, would they be stopped?\"</p><br/><p>They couldn’t remain long in Regina. Staying in the hotel and remaining in disguises, never being able to reveal their faces or identities, how could they live like that?</p><br/><p>\"Yeah, leaving is fine,\" replied the old man, \"But, to capture spies from the Church, many outposts were set up around the city which only allow those whose identities have been thoroughly checked to pass. If you want to sneak out, it’s basically impossible.\"</p><br/><p>Hearing this, Benjamin felt that the situation was quite tricky. He hurriedly asked, \"How long would this go on for?\"</p><br/><p>The old man shook his head, and answered, \"I’m not sure about that. It’s up to the top dogs I guess.\"</p><br/><p>...Okay then. Benjamin felt helpless.</p><br/><p>But this state of martial law would probably not last for very long. Groups of merchants still needed to go in and out of the city, and citizens still needed to continue their daily lives. So as much as the Queen desired to weed out all the Church’s pawns, it was impossible to maintain such strict regime.</p><br/><p>Benjamin decided to wait for a while more. Things would definitely become better.</p><br/><p>Thinking along these line, Benjamin pushed this matter to the side, and after hesitating for a while, asked the second question.</p><br/><p>\"By the way, since you’ve been in the Mercenary Association for so long, have you heard of a guy named Miles before?\"</p><br/><p>Previously at the massage parlour, Blondie had used this name to address the young man. The information Benjamin obtained wasn’t much so the old man’s side was his best bet to see if he could get some insider information on him. After all, he needed to understand the story of the young man so that he could decide what the young man’s motives truly were.</p><br/><p>\"Miles?\" upon hearing the name, the old man’s expression changed to shock. \"You’re asking about...that Miles?\"</p><br/><p>Benjamin shrugged and replied, \"Tell me all about every Miles, I’ll decide for myself.\"</p><br/><p>The old man was puzzled. He shook his head and said, \"There is only one Miles, but...I don’t know a lot about him, just bits of information here and there.\"</p><br/><p>...Oh? Hearing this from the old man, Benjamin suddenly got excited.</p><br/><p>\"Do tell.\"</p><br/><p>As if carefully contemplating his word, the old man paused, and then gradually opened his mouth to begin, \"The man can be described as a legend within the mercenary world. Everyone has heard of him but from the mouths of different people, he seems to be two completely different persons. It’s like there is two of him.\"</p><br/>\n</div>"}