{"title": "Chapter 232: Flying Tiger", "id": 232, "volume": 3, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-232-flying-tiger", "volume_title": "Volume 3", "body": "<h1>Chapter 232: Flying Tiger</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 232: Flying Tiger</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>There was a sharp sound coming from a bugle, followed by an appearance of an odd shaped ship, sailing up at maximum speed from Fett River. It was like a shark from the depths of the sea.</p><br/><p>Benjamin and his group were still standing in the hall of the empty inn, discussing their next move. When they heard the commotion, they went to the entrance to take a look.</p><br/><p>The ship entered the docking area with utmost inelegance, crashing the wrecked jetty and making it tremble. It was followed by countless vicious ruffians rushing into town from the ship, making all sorts of screaming and shouting noises.</p><br/><p>Benjamin supported his forehead with his hand and shook his head.</p><br/><p>What a freaking coincidence.</p><br/><p>He had just found out about the pirates and now they were bumping into them. He must be jinxed.</p><br/><p>\"Teacher Benjamin, let’s head over there and take care of them,\" Joanna suggested.</p><br/><p>\"... There is no rush, let’s check it out first,\" Benjamin still shook his head after he considered about it.</p><br/><p>They were still, after all, wanted criminals. Although they had already disguised themselves but there was a risk that they would be recognised. Anyway, they should keep a low profile and stay away from trouble.</p><br/><p>If they had to intervene, they should observe their opponents before mediating.</p><br/><p>And so Benjamin and the rest hid within the inn and secretly observed the situation through a window.</p><br/><p>The town outside that very window, the group of pirates scrambled around, cursing and screaming while kicking down every door of every home. In a matter of minutes, the citizens of the town were all gathered up near the dock.</p><br/><p>\"Hey hey hey! Stop hiding there, get the hell out!\"</p><br/><p>The pirates also discovered the mages in the inn and pointed their knives at them to gather at the dock. The mages looked at one another and held their chuckles in. They did not speak a word and followed the rest as if they were ordinary civilians.</p><br/><p>The pirates gathered them like a shepherd chasing after their flock in the farm. Now they looked like they were preparing to shear the sheep.</p><br/><p>\"Twenty sacks of food, five cows and ten buckets of fishes. Have you prepared this as discussed?\" Out came one of the pirates ferociously interrogating and holding an old man who looked like the mayor of the town.</p><br/><p>\"S-sirs...\" The old man shook in horror, \"You came three days ago, and we weren’t able to accumulate all in three days’ time.\"</p><br/><p>\"So you’re saying that you have not prepared?\" The pirate asked.</p><br/><p>\"W-we really do not have that much.\"</p><br/><p>\"You don’t?\" A cold savage smile appeared on the pirate’s face, \"Right, and I believe you have a few grandchildren, yeah? It’s their time to be slaughtered.\"</p><br/><p>The old man’s face changed and held onto the pirate’s feet to beg. The pirate brushed him off and kicked him away. He carried his knife and walked towards the crowd.</p><br/><p>The already trembling crowd felt weak in the knees. The rest of the pirates surrounded them covetously that they did not dare to escape. They could only kneel down and hugged their heads, praying that it wasn’t their heads next on the chopping block.</p><br/><p>The remaining people in the crowd were so scared to death that they knelt down. Such scene was an apparent eye sore.</p><br/><p>\"Who are you?\" The pirate turned his gaze on Benjamin and his group.</p><br/><p>Benjamin let out a sigh.</p><br/><p>He did not respond to the pirate’s vicious questioning, instead he turned and looked at the mages behind him and said, \"Fine, this is getting too much, let’s take action.\"</p><br/><p>Everyone around did not understand what it meant, but the mages nodded, began chanting together. What followed was a magical oscillation and before magic formed, the pirates’ facial expression changed.</p><br/><p>\"Shit! It’s a bunch of mages. Quick, inform the boss!\"</p><br/><p>The pirates moved to get out of the way but the chants were too fast as countless icicle and fire balls were summoned midair. After experiencing numerous battles with magical beasts had led the mages to be well coordinated in controlling their magic as they spread their attacks in different directions.</p><br/><p>This spread out attack was obvious that they were planning on a hole-in-one without wasting anymore time.</p><br/><p>However, the pirates’ reflexes were not shabby either. They did not scatter off confronting magic, instead they cooperated and utilised their head count as an advantage to counter the attacks. Those facing the wind cuts would raise their knives, those facing the Fire Balls used buildings as a blockade, those facing icicles would dodge...</p><br/><p>Overall, the repeated attacks had left many pirates injured but death toll was less than ten. This result shocked Benjamin.</p><br/><p>It was no wonder they were able to dictate the area. They were quite something.</p><br/><p>Of course, pirates would just be pirates, no matter how great. It was not that Benjamin was trying to brag but he was clear that as long as the enemy was no more than five hundred, no threat stood against twenty over mages.</p><br/><p>And that was why he did not participate in the first round of attacks, but rather observed from the sidelines.</p><br/><p>Another few more rounds of the same attack, the pirates should not be able to last.</p><br/><p>However, just when the mages started to chant to launch the next attack, a sharp sound that seemed to come from a bugle was played again. Many covered their ears. The cabin door latched open and out emerged a dark shadowy figure.</p><br/><p>... What the?</p><br/><p>Benjamin frowned and started to chant a water screen in order to shield the mages.</p><br/><p>Once the water screen was formed, the dark shadow struck like lightning and crashed into the water screen, causing it to disperse. The dark shadow also rebounded from the action and stopped mid air, not far away.</p><br/><p>\"Boss, you’re here!\" Someone amidst the pirates exclaimed.</p><br/><p>Benjamin finally had a good eye on the dark shadowy figure.</p><br/><p>It was an ugly magic beast. It kinda looked like a tiger but only with one eye. It was black with messy stripes that was like moss and patchy; which made it look extremely hideous. At the back of the magic beast was a pair of wings that was white and pure. The pair of wings was like an angel from a painting. It shimmered under the afternoon sunlight, creating a sharp contrast with the rest of its body.</p><br/><p>The build of the magic beast was not that huge, and one could say that it was slightly smaller than an average tiger. It looked a little like a griffin but also different from a griffin. It was fairly unusual.</p><br/><p>Benjamin had never heard of such a magic beast.</p><br/><p>It was jaw dropping enough. He had been in Icor for long and had seen some illustrated magic beasts books so he had a certain understanding when it came to this species.</p><br/><p>It was a rather peculiar situation that neither he nor the System was able to identify such a beast.</p><br/><p>However, it was even more shocking to see there was a middle-aged man sitting at the back of that magic beast.</p><br/><p>— Someone was riding the magic beast.</p><br/><p>The middle-aged woman did not exaggerate one bit. The pirate, did indeed ride a flying tiger.</p><br/><p>He was wearing the same dirty leather armoury like the other pirates. He was holding a large axe that was two metres in length. The axe was emitting a light magic aura. Although it looked heavy but it looked effortless in that man’s hands. In fact, it felt as though the axe was part of his body.</p><br/><p>The pirate head sat on the back of the magic beast and narrowed his sight onto Benjamin and the group beneath him. He was overbearing, as if he just butchered an unnamed town and came to a new place, thinking \"It’s getting late, let this town disappear too\".</p><br/><p>Even Benjamin sensed danger.</p><br/><p>\"Twenty three mages...\" The pirate head spoke, \"Interesting. Don’t tell me... You’re the lot that are recently wanted?\"</p><br/>\n</div>"}