{"title": "Chapter 231: Town of Ciera’s Pirates", "id": 231, "volume": 3, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-231-town-of-ciera%E2%80%99s-pirates", "volume_title": "Volume 3", "body": "<h1>Chapter 231: Town of Ciera’s Pirates</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 231: Town of Ciera’s Pirates</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>After five days, the group picked up pace and avoided all major cities and main roads. They did not meet with any incidents after and they finally reached a little town next to River Fett.</p><br/><p>This was a town that was built due to the river. The population was scarce and overtaken by the fishing industry. The majority of people living here were fishermen. Benjamin felt the town’s peace and serenity the moment he stepped in.</p><br/><p>This was definitely different from the hustle and bustle of the other towns they passed by. There were few people that roamed the streets. Passersby would cautiously eye each other when crossing paths and quickly leave with their heads hidden by their collars. It was as though there was a plague in town.</p><br/><p>However, Benjamin could not be bothered with this.</p><br/><p>He simply has too much to take care of.</p><br/><p>This little town was less than a day’s journey away from Icor’s borders. The horse carriage would not be able to cross the river. Hence, Benjamin went with his original plan to dismiss the four horse carriages and drivers.</p><br/><p>Miles was surprisingly cooperative throughout the journey and did not cause any havoc. It was as though he was a real driver. Once they reached the Town of Ciera, he left as promised. The fellow did leave as confirmed with the Water Particle Detection instead of hiding somewhere to spy on them.</p><br/><p>Benjamin could now let out a deep breath.</p><br/><p>\"If you’re looking to grow somewhere, I would suggest you to go to Carretas.\" Miles suddenly suggested Benjamin prior to leaving, \"But if you’re really going to Fereldan, then pretend I did not say anything, it’s up to you.\"</p><br/><p>He drove away the carriage without looking back after he said those words.</p><br/><p>Benjamin fell into deep thought as he looked at the direction Miles left. Uh huh, it was to the north, where Carretas was. Does that mean….. he was working for Carretas?</p><br/><p>That’s odd.</p><br/><p>Benjamin abandoned the thought after thinking about it. It wasn’t as though he has not seen the letter the Church wrote to Carretas. To him, Carretas was crossed out from the list a long time ago.</p><br/><p>If that was the case, then it was pointless to think about it.</p><br/><p>They freshened themselves up after the worn out journey to the Town of Ciera. It was the afternoon and they were prepared to wait until it was dark so they could use their magic to fly across the river without alerting anyone.</p><br/><p>One thing to note was that after days of meditation, a few more mages learnt the Flight spell and the mages who could fly were now more than half the group.</p><br/><p>Benjamin was thankful that he would only need to drag a small lot of people with his Pillar of Steam and this time, it would not require such a huge effort.</p><br/><p>Just as they were prepared to relax in an inn.</p><br/><p>\"Teacher Benjamin... Will you look at this?\"</p><br/><p>Suddenly, Frank pointed at what looked like a notice board next to the inn. He lowered his voice and told Benjamin.</p><br/><p>Benjamin looked up and saw that there were portraits of many on the bulletin. On closer inspection, the portraits were the twenty mages in the group. Not one was left out.</p><br/><p>What’s going on?</p><br/><p>Benjamin hesitated for a moment but continued to read on. He realised it was an arrest warrant.</p><br/><p>An arrest warrant from officials of Icor.</p><br/><p>\"... The total of twenty three persons are spy mages from an enemy nation. Recently they caused a havoc in the city with high destructive levels. This memo is circulated over the entire nation to raise awareness. Anyone with information will be awarded with two hundred gold coins.\"</p><br/><p>Benjamin raised his eyebrow while he read this.</p><br/><p>The entire arrest warrant was under the queen’s order. From the incidents of the past few days, the Queen must have noticed that something was not right. She must have suspected that Benjamin and his group may have passed through the city but escaped under her watch.</p><br/><p>She probably was enraged so she made up the charges to arrest them.</p><br/><p>Benjamin felt fortunate that they had put on disguises prior to coming into town or else they would probably be recognised and surrounded. They would be in trouble then.</p><br/><p>\"Do not take to heart these things.\" He whispered, \"Same time tomorrow, we will be leaving Icor. Let them say what they want to and it has nothing to do with us.\"</p><br/><p>Frank nodded.</p><br/><p>After warning the rest of the mages in the group to be extra cautious not to reveal their identity, Benjamin threw the arrest warrant issue to the back of his head, without a worry.</p><br/><p>The moment they stepped into the inn, they realised that it was empty, without a trace of a shadow.</p><br/><p>Did something happen?</p><br/><p>Benjamin scanned the entire inn with his Water Particle Detection and confirmed that there was no one, neither the boss, customers nor cleaner. It was like a haunted house.</p><br/><p>Combine this with the dreary atmosphere in town, Benjamin started to feel something was amiss.</p><br/><p>\"Wait here, let me look for someone to ask.\" He told the rest of the mages. He proceeded to turn and leave the empty inn.</p><br/><p>He managed to stop a middle-aged woman that was scurrying by on the streets, \"Sorry to bother you, do you know why there isn’t anyone in the inn?\"</p><br/><p>The woman stopped at her tracks and was filled with sorrow, \"That inn….. Why would there be any customers in this inn? The boss of that inn had already left with his wife and kids after things went sour.\"</p><br/><p>Benjamin felt even weirder and continued with his questions, \"Did something happen to the town? Why did it come to this?\"</p><br/><p>The woman sighed and started to explain to Benjamin. It was then that Benjamin found out that the Town of Ciera has not always been like this. A group of pirates suddenly appeared above Fett River a while ago. Thus the town became what it was now.</p><br/><p>The middle-aged woman may have exaggerated the group of pirates as she described them as though as they were the legendary demons. Each one of them had unlimited strength and were heartless killers. They ate the flesh of men and drank their blood. They rode on flying tigers. The town was a living hell each time they appeared.</p><br/><p>If the residents did not provide them with enough food supply, they would kill them and the corpses became their food supply.</p><br/><p>Benjamin sweated at the thought of flying tigers... magic beast tamers?</p><br/><p>What a wild imagination this woman had.</p><br/><p>Benjamin waved his arm to bid the sorrowful woman farewell after learning of the town’s fate.</p><br/><p>The pirates’ invasion has caused the downturn of the town but it could not be helped. Although Benjamin was not a cold blooded man but they were all wanted, and their hands were tied. They had to turn a blind eye and leave the place that very night.</p><br/><p>Truth be told, it was the queen’s responsibility to ensure her people lived in peace and harmony, and get rid of the pirates. He should not meddle into their business.</p><br/><p>\"About that...\" The System suddenly appeared and teased, \"If you keep looking for excuses and telling yourself not to meddle, in a way, it kind of means that you want to stick your hands into the matter.\"</p><br/><p>\"...\"</p><br/><p>Benjamin could not find any words to rebuke the System.</p><br/><p>Of course, he would not change his mind just because of what the System has said. It’s just that... in the end, he managed to put himself in a spot where he had to intervene.</p><br/><p>Because just as he was about to discuss with the other mages of the current predicament and cross the river earlier, the pirates, as mentioned by the woman, decided to appear at this very forsaken moment.</p><br/>\n</div>"}