{"title": "Chapter 234: Moonglaive of Ice", "id": 234, "volume": 3, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-234-moonglaive-of-ice", "volume_title": "Volume 3", "body": "<h1>Chapter 234: Moonglaive of Ice</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 234: Moonglaive of Ice</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Ascending hundred metres from the air and using gravity to reinforce his attack was equivalent to a suicide mission.</p><br/><p>Benjamin would not doubt the destructive force such height could bring. Similarly, even if the pirate head’ bones were made of metal, they would have been crushed to smithereens for what it’s worth.</p><br/><p>That was why when he saw what he saw, surprised was an understatement.</p><br/><p>The pirate head was looking for death.</p><br/><p>Well, regardless, Benjamin still wanted to live. If that axe came hacking down, even with the misty frost protection, both parties would be in a lose-lose situation. This was a result that Benjamin would not want to see.</p><br/><p>It was not an attack that could be dodged easily. Even if he were to dodge, those who would get affected would highly possibly be the mages around him. In other words, he could not dodge it and had to face the music.</p><br/><p>How could he survive the hit though?</p><br/><p>He thought, as he observed him rose to great heights. Benjamin made a split second decision and flew towards them.</p><br/><p>The pirate head was shocked to see Benjamin flying towards him. But, he believed that Benjamin was just falling into a trap. And that was why he was in glee. He patted the back of the magic beast and turned around to charge at Benjamin instead.</p><br/><p>Benjamin then stopped mid air and summoned the mist first to defend the top of his head.</p><br/><p>Thud!</p><br/><p>The pirate head used a similar tactic as before with gravity at his advantage, heading towards Benjamin with his axe.</p><br/><p>As Benjamin flew to the sky and closed the distance between them, therefore, even though the pirate head rose to a hundred metres in the sky, the descending distance was lesser than before when hacking the misty frost.</p><br/><p>Evidently, the degree of the impact of the Axe Technique from Above blow depended on the distance of from where he ascended. The distance was not that much different as the last attack, so the result that was produced was pretty much the same — A dent in the misty frost, and the pirate boss who ricocheted away.</p><br/><p>Benjamin let go a sigh of relief.</p><br/><p>Honestly speaking, he had found a way to defeat the pirate boss. His attack was similar to a cavalry which required time to charge before launching the attack. As long as Benjamin closed the gap between his opponent, he would not be able to launch the attack.</p><br/><p>He looked at the ricocheted pirate head, and pursued him while activating the water steam.</p><br/><p>The impact of the last attack was pretty huge, that the pirate head was blown quite far away before he could keep his balance with the help of the tiger looking magic beast. Once he adjusted and steadied himself on the back of the magic beast, he turned around and saw Benjamin charging at him.</p><br/><p>A Mage was suddenly ensuing closely, while at battle with an axe bearing pirate.</p><br/><p>The pirate head was caught by surprise at the moment.</p><br/><p>Benjamin was not at full speed but because the pirate head took a while to adjust himself. He quickly caught up with the pirate head. Benjamin could even smell the horrible odour emanating between the teeth of the magic beast, the calluses on the pirate’s hands. The clear blue skies passed through their heads, and the town beneath them seemed as tiny as miniature models.</p><br/><p>In the process of approaching the pirate head, there was a deep low chanting voice that followed as rounds and rounds of Icebreaking spell was cast. the amount of ice blocks drastically compressed by Benjamin suddenly formed a ice blade in the shape of a crescent.</p><br/><p>The blade was about three metres long and its body, sickled, although lightweight but abnormally sharp. The icy blue edge was glazing under the sunlight. It encircled Benjamin, embodying the perfect offence and defence while being agile like a fish in the sea.</p><br/><p>This was his secret weapon for close range combat.</p><br/><p>Before the pirate head could react, Benjamin instructed the Moonglaive of Ice, which rotated and aimed at cutting through the magic beast’s face.</p><br/><p>The pirate boss immediately wielded his axe and the two weapons clashed.</p><br/><p>Clang!</p><br/><p>The moonglaive was unscathed but the pirate boss riding the magic beast was pulled back by the sheer force.</p><br/><p>Benjamin felt a sense of joy.</p><br/><p>After confirming close combat as the better option, he immediately closed the gap between himself and his opponent again.</p><br/><p>The moonglaive rotated and surrounded Benjamin like a satellite. The pirate head wanted to counter attack by hacking at him but ended up clashing with the rotating moonglaive, and ricocheted the giant axe.</p><br/><p>The moonglaive was moving fast as it coiled around Benjamin. The pirate head would start chopping at Benjamin but after countless metal collisions between the axe and moonglaive, Benjamin appeared relaxed and unharmed while the pirate head gradually became disconcerted.</p><br/><p>Obviously the pirate head found it hard to counter the frequent charging of the moonglaive attacks. He attacked and retreated whereas Benjamin would keep chasing on and kept close distance between them. Their battle almost took them away from Fett River.</p><br/><p>\"What... What kind of Mage are you? What sorcery is this?\"</p><br/><p>Benjamin smiled but did not respond. Instead, he instructed the moonglaive to heighten its speed. The pirate head could only defend himself by placing the axe in front of them to block the attacks. It did not leave him room to counter attack.</p><br/><p>\"To be attacked by a Mage at such close ranges and can’t fight back despite his abilities; this person is really pitiful.\" The System popped out and felt empathetic.</p><br/><p>Knowing that defeat was inevitable at this pace, the pirate head had to grasp on the opportunity to wield his axe during the rotation of moonglaive to ricochet away. He instructed the magic beast to pull away in order to create some distance.</p><br/><p>However, why would Benjamin allow his opponent to take a step back? He summoned the Pillar of Steam to create strong winds to drag on the magic beast’s feet. He then quickly charged towards the duo with his rotating Moonglaive of Ice.</p><br/><p>Poor pirate head. He was back in to being mowed by the moonglaive in no time.</p><br/><p>The battle in the sky had gone past more than ten minutes and Benjamin has drained most of his Spiritual Energy. However, judging by the look of the pirate head, which was red in rage while his hands were trembling holding his axe, he was losing momentum.</p><br/><p>If this went on, the pirate head could possibly faint from fatigue.</p><br/><p>Benjamin did not want to be entangled in battle any longer — the winner was apparent, why would he waste further time?</p><br/><p>As the moonglaive was rotating, he suddenly changed its rotating angle. The pirate head’ focus was all over the place, after preserving for long. He was unable to reposition his axe and was hit by the re-angled moonglaive.</p><br/><p>Whizz!</p><br/><p>The moonglaive cut through like lightning and left a beautiful pitch arc trace in the air.</p><br/><p>A horrible scream ensued after the pirate head’s right arm was chopped off. The remaining left arm was not capable of holding onto the heavy axe. The axe fell from his grasps and was knocked away by the moonglaive. The moonglaive then ripped the tiger looking magic beast into pieces in mere seconds.</p><br/><p>Blood splattered everywhere. Benjamin frowned and used a bubble to shield himself.</p><br/><p>The one armed pirate head that was now controlled by Benjamin’s steam, had completely lost the ability to fight back.</p><br/>\n</div>"}