{"title": "Chapter 244:", "id": 244, "volume": 3, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-244", "volume_title": "Volume 3", "body": "<h1>Chapter 244:</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 244: \"Toppling\" the Church</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Standing in the middle of the room, Benjamin looked at everyone and smiled, trying to make the atmosphere lighter. At his side, the mages were gathered in a circle. The familiar faces regarded him, quietly watching.</p><br/><p>\"In the following days, does anyone have anything planned?\"</p><br/><p>The mages looked at each other, not knowing why Benjamin said this.</p><br/><p>\"Teacher Benjamin, are you saying this because you’re planning on leaving?\"</p><br/><p>Hearing this, Benjamin immediately shook his head and said, \"Of course I’m not leaving. It’s only now that we are here in Ferelden, it is somewhere a mage can live a better life. In the beginning, in the town of Crewe, everyone gathered together for the sake of survival. Once we went into Icor, there were all sorts of reasons, and we were running for our lives. During those days, no one complained, but we all knew it was not what we wanted. And from today onwards, we don’t have to live in hiding anymore, we can have a different life.\"</p><br/><p>Hearing this, the mages had all sorts of reactions. Some had smiles free of all burdens, some had looks of regret.</p><br/><p>\"We are not moving on anymore? I thought it was very exciting the way we moved here and there!\" Lara exclaimed.</p><br/><p>Benjamin wiped the cold sweat off his forehead.</p><br/><p>\"We can’t keep running away for the rest of our lives,\" He said a little impatiently, \"it wasn’t easy for us to reach this place, and have a safe and stable place to live. We need to think carefully about what we want to do next.\"</p><br/><p>Hearing this, the mages who were older nodded their heads in agreement.</p><br/><p>\"I think this place is not bad, the things are not expensive, let’s not go around anymore.\" The boss lady sighed as she said, \"It’s not that I’m lazy, but we’ve been travelling so far, I really want a bed for a good night’s rest. Always keeping my luggage right next to me, grabbing it and running and if anything happens is really is quite upsetting.\"</p><br/><p>Benjamin nodded his head.</p><br/><p>This kind of daily worry really made people feel tired and weary.</p><br/><p>\"I was thinking the same thing,\" And so, he followed the boss lady’s words and said to everyone, \"Even though we just reached the city of Rayleigh, and we’re not used to our surroundings. But on the road before this, I’m sure everyone learned a thing or two from the mercenaries. This may not be the wealthiest of places, but there is freedom here, so it’s somewhere we can stay.\"</p><br/><p>At that moment, Hannah opened her eyes wide and said, \"Teacher Benjamin, are you saying that we are staying here permanently?\"</p><br/><p>Benjamin nodded his head.</p><br/><p>\"Then where should we stay?\" Hannah continued asking.</p><br/><p>\"We can buy a house here; it’s not like we don’t have the money.\" Benjamin shrugged and said, \"I see plenty of empty houses here, I’m sure it won’t be too expensive.\"</p><br/><p>At that moment, the mages opened their eyes wide and looked at each other. After a moment of silence, they let out a cheer.</p><br/><p>It was obvious: It didn’t matter if it was the wilderness or a hotel, everyone was sick of it. Hearing that Benjamin decided to buy a house here, they were ecstatic.</p><br/><p>Of course, the thing they were most excited about was that Benjamin would definitely give the money.</p><br/><p>Thinking about this, Benjamin could only chuckle.</p><br/><p>This is the cons of being a leader, right?</p><br/><p>But after experiencing so much running these past few days, everyone was slowly getting used to living with each other, it didn’t matter if it was to discuss about magic or mind and body meditation, everything will be so much more convenient. And so, so one brought up the request to live separately.</p><br/><p>There was a kind of hostel feel to it.</p><br/><p>Yup... the house, they should get a bigger one.</p><br/><p>Benjamin could not help but think about this.</p><br/><p>\"Since everyone agreed to live permanently here, then that’s it then.\" Thinking about it, he felt like a primary school teacher, clapping his hands to get everyone’s attention back on him, then continued on strictly and said, \"Everyone can live happily ever after, but there are some things we should decide earlier on.\"</p><br/><p>Hearing this, everyone came back from their high on getting their own place, quietly looking at Benjamin.</p><br/><p>\"Everyone has gone through quite a lot of things, but in this world, there is no such thing as true stability,\" Benjamin lifted his hands up and continued, \"We are not people without ambition, but if you don’t try to fight for anything, then people will demand it of you, this is inevitable. And so, we should always try to get stronger.\"</p><br/><p>\"Teacher Benjamin, we are already really good,\" Frank said in a tone of surprise.</p><br/><p>\"Not enough,\" Benjamin shook his head and said, \"There were so many talented mages in Icor, and the Mages Guild was really powerful. Despite of that, I don’t wish that in the end we will become like them, and even more so when one day the church decides to call for war, we are weak and are unable to fight.\"</p><br/><p>Hearing what Benjamin was saying, everyone went quiet. The atmosphere in the room was tense.</p><br/><p>In reality, everyone experienced a lot because of their identity as mages, there was no need for Benjamin to remind them. The only thing he should remind them was to not be too comfortable.</p><br/><p>He called them all and told them all these things because he was afraid that once everyone came to this safe place, they will let down their guard, like in the town of Crewe, open a hotel, and the days would be muddled together. They cannot live like this.</p><br/><p>From the time that they became mages, they have said goodbye to the life of a normal person.</p><br/><p>\"Will the church really initiate a war?\" Frank frowned and asked. Benjamin sighed and said, \"I don’t know either, but even if they don’t initiate a fight, they will definitely do something like the coup in Regina. Whatever it is, they will try their best to make our days miserable.\"</p><br/><p>Hearing this, the mages had a lingering fear in their hearts as they nodded their heads.</p><br/><p>\"Since it is like that, should we just get rid of the church, then there will be nothing to worry about?\" Suddenly, Joanna stood up and said in an excited voice.</p><br/><p>\"...\"</p><br/><p>It was full of pride...</p><br/><p>After a short silence, suddenly, Benjamin smiled, nodded his head and said, \"It sounds good, I think it’s a good idea, anyone against it?\"</p><br/><p>A few mages patted Joanna’s shoulder and could not help but smile.</p><br/><p>\"No one will object,\" Andy smiled as he shook his head and said, \"With the master mage Joanna around, it won’t be difficult to get rid of the church, why would we oppose?’</p><br/><p>\"You guys are making fun of me again,\" Joanna said helplessly.</p><br/><p>\"No, we think that it is a good idea,\" Andy tried to suppress his laughter and said it with a stern face.</p><br/><p>\"It’s good,\" Benjamin also returned to normal, looked at the surrounding mages, and suddenly opened his mouth and said, \"Since no one objected, then this plan will be approved. Getting rid of the church with the slogan that Miss Joanna created, this will officially be the vision. Everyone should remember it.\"</p><br/><p>Aside from the shame on Joanna’s face, everyone was laughing and nodding their heads.</p><br/><p>And so they continued discussing what they were going to do tomorrow. It was a meeting that could decide their future.After experiencing long days in hiding, the mages returned to their own rooms, laid on their own bed and had a good rest.</p><br/><p>And Benjamin, he stepped out of the hotel main door, looked to the blue sky and took a deep breath.</p><br/><p>\"Bringing down the church...\"</p><br/><p>He said in a voice that only he could hear -- a whisper in a low voice -- like he was joking, but in the corner of his eyes was a flicker of caution.</p><br/>\n</div>"}