{"title": "Chapter 254: A Conversing Potion Mage", "id": 254, "volume": 3, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-254-a-conversing-potion-mage", "volume_title": "Volume 3", "body": "<h1>Chapter 254: A Conversing Potion Mage</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 254: A Conversing Potion Mage</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>As a gangster, usually there was no such thing as planning.</p><br/><p>The next day after Benjamin and the team of mages moved into their new home, Benjamin woke up from his bed, rubbed his eyes and heard a few mages that woke up early, talking about what happened in the City of Rayleigh in the corridor.</p><br/><p>\"... It seems to be quite serious.\"</p><br/><p>\"Fortunately, that place is far from us, so we won’t get involved.\"</p><br/><p>\"I think it’s going to be fun, let’s go have a look later... ...\"</p><br/><p>Benjamin yawned, sat on his bed, and forced himself to be awake and to clear away the feeling of drowsiness. After thinking twice, he stroked his messy hair, opened the door and walked out.</p><br/><p>\"What happened?\" He stood at the door, and asked the few mages in the corridor.</p><br/><p>\"Mr. Benjamin, you just woke up?\" Joanna waved to him and said, \"Something big happened last night. A small cult in the North City was attacked, several houses were burned. Rumor say that it was caused by the gang's grievances.\"</p><br/><p>... … A small cult? Gangs’ grudges?</p><br/><p>Benjamin remembered something and at that moment, Benjamin was suddenly awake and lost all his drowsiness.</p><br/><p>\"That cult that got attacked, can’t be the one in Mohan Street right?\" He tentatively asked.</p><br/><p>Hearing that, a few mages nodded their head in surprise.</p><br/><p>\"Mr. Benjamin, how do you know about that?\" Andy asked curiously.</p><br/><p>\"I ... ... heard rumors about it.\" Then, Benjamin hesitated for a while, and quickly added, \"This thing, it’s better if we don’t get involved with it. Also remember to everyone to be careful and do not get close to that area. \"</p><br/><p>The mages looked confused, but they still nodded and promised him.</p><br/><p>Then, the few mages in the corridor went to eat breakfast while chatting. Benjamin took a deep breath, and his expression became slightly dignified, he turned and went back to his room.</p><br/><p>Grudges between gangs... …</p><br/><p>No question needed, about the matter the mages talked about, it is definitely related to the \"Crow\" and the \"Eagle\". But the thing that he did not understand is that after he killed Johnny, why would the cult be the one to be attacked.</p><br/><p>What happened?</p><br/><p>Moreover, the most critical question is, which gang was it that did the attacking? The \"Crow\" or the \"Eagle\"?</p><br/><p>Different answers represent different situation and meaning.</p><br/><p>Benjamin wanted to dress up immediately then go over to investigate about the attack. However, he held back. It has already happened; the attack must have gotten attention from all of the City of Rayleigh. In order to prevent any suspicion, it is better if he became a transparent mage that just moved in, do not get close to that area, in case he accidentally exposes himself.</p><br/><p>At least, he had to wait for the situation to cool down first before going to Jessica.</p><br/><p>This way, he looked as though nothing happened again, Benjamin put this matter aside, wash up, ate breakfast, continued their unfinished construction work for their new home.</p><br/><p>The food from before was made by the mages in team who were good at cooking. But in fact, being in charge of the meal for more than 20 people will occupy a lot of their meditation time. Moreover, the daily cleaning of the new house will be very time consuming too. So, Benjamin planned to hire several servants.</p><br/><p>Unfortunately, this world is neither being too far behind the times where there was the existence of slave markets, or being so advanced to have developed housekeeping companies. The industry of servants was usually carried out by acquaintances.</p><br/><p>He does not have any acquaintances in this industry.</p><br/><p>Ah ... ... it would be nice if he brought Jeremy along.</p><br/><p>After thinking twice, Benjamin tried to learn from the recruitment methods of the general shop, he wrote a few job vacancies, pasted it in the most eye catching places around the neighborhood, hopefully someone will see it.</p><br/><p>Then, he left the street and went to the nearest magic potion store, he wanted to buy some refining equipment.</p><br/><p>Unfortunately...</p><br/><p>\"I'm sorry, mage, we only sell completed potions here.\" The Clerk said with a smile.</p><br/><p>\"Do you know where do they sell this thing?\" Benjamin asked again.</p><br/><p>\"If you need it, you can go to the nearby blacksmith shop to make an order of your own.\" Clerk held his hands out and said, \"But if you want the better kind, you can only try to negotiate with other mages.\"</p><br/><p>Benjamin was speechless.</p><br/><p>Going to the blacksmith shop to refine drugs ... ... What’s the difference of it from him using a part of an iron pan to refine drugs?</p><br/><p>It seems like in this world, the mages industries are not fully developed, and it made the whole community of the mages to be very mysterious, without a mature and complete system, the life of a mage is very convenient.</p><br/><p>He did not know the reason why... …</p><br/><p>Benjamin shook his head in disappointment, ready to leave, suddenly, an unfamiliar voice coming from behind called out to him.</p><br/><p>\"Excuse me… ... Mister, you wanted to buy a set of refining tools?\"</p><br/><p>Benjamin turned around and saw a man who looked shy, standing at the door of the shop, who looked puzzled, staring at him with caution.</p><br/><p>Instantly, Benjamin was filled with energy.</p><br/><p>\"Do you have it with you now?\"</p><br/><p>\"Yes, I ... I am a potion mage, of course I have the tools.\" The man said hesitantly, he seemed reluctant to speak to Benjamin, but due to some difficulty, he was forced to talk to him.</p><br/><p>Benjamin heard it, he could not help but feel surprised.</p><br/><p>He can not only can buy the stuff, but more importantly, under this circumstance, he met the first mage in the City of Rayleigh.</p><br/><p>\"Hello, my name is Benjamin, a mage who just came to the City of Rayleigh not too long ago, I am glad to meet you.\" He smiled, walked towards him and held out his hand.</p><br/><p>\"Ah ... ... I, wait, don’t you want to buy drug refining tools?\" Unfortunately, this person does not seem to be interested in chatting.</p><br/><p>Seeing that, Benjamin took back his hand, nodded his head and said, \"Yes, what kind of tools do you have? Can I have a look at it first?\"</p><br/><p>The man scratched his head and said, \"I don’t have it with me, but ... … rest assured, those tools are specially designed to improve the success rate of drug refining, I will not lie to you.\"</p><br/><p>Benjamin said: \"I have to look at it first, then decide whether to buy it or not.\"</p><br/><p>Hearing that, the man was silent for a while, finally, he hesitantly open his mouth and said: \"Well, you ... ... you come with me, I'll bring you over to have a look.\"</p><br/><p>Benjamin thought and nodded.</p><br/><p>Through the spiritual power of perception, the strength of this mage was just average, he was not a threat to him. Therefore, he can just boldly follow him.</p><br/><p>This way, about half an hour later, he followed the strange mage and went to a house in the relatively remote part of the city.</p><br/><p>\"This… …. This is the one.\" He walked into a messy room, he took out a box, opened the box, pointed to the inside of the box and said looking puzzled.</p><br/><p>Benjamin looked at it curiously.</p><br/><p>He saw a strange instrument in the box. A spherical hollow glassware, like a globe, was fixed in place by an iron shelf and it can be scrolled left and right. There is a groove beneath the iron shelf, which seemed to be a place for the ignition of kerosene, on top of the ball is also a free switch which can be an entrance, probably ... ... a place where the material can be placed in.</p><br/><p>Benjamin thought it looked very unusual, but also was a little confused.</p><br/><p>This thing that looked like a globe, can really help improve the success rate of drug refining?</p><br/>\n</div>"}