{"title": "Chapter 251: Alright then, go to hell", "id": 251, "volume": 3, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-251-alright-then-go-to-hell", "volume_title": "Volume 3", "body": "<h1>Chapter 251: Alright then, go to hell</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 251: Alright then, go to hell</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Although it was called an alley, it actually did not seem like an appropriate description as it was just a narrow space between two rows of building. It could only allow someone lean to pass through. Who knew how this fellow found this way?</p><br/><p>However, because of this, Benjamin had to make a move as soon as possible.</p><br/><p>In such a narrow alley, if Johnny suspected that something was wrong and turned his head around, he would definitely discover Benjamin’s existence. At that moment, Benjamin already made use of water vapor to support himself and floated forward, that was why not a sound was made.</p><br/><p>But....as a tricky gang leader, he will turn around to look for sure.</p><br/><p>At that moment, inside that dark and narrow alley, perhaps he was just being alert, but Johnny inadvertently turn his head and found Benjamin. At that time, the distance between the two of them was not a good distance to attack, therefore, Benjamin had to hastily disable his magic before he turned his head and waved at Johnny.</p><br/><p>\"Rabkauhalla!\"</p><br/><p>He heard how the believers greeted each other, so he imitated their behavior and greeted Johnny with a devout look.</p><br/><p>Johnny was shocked.</p><br/><p>Benjamin did not know if his looks were terrifying, but after seeing Johnny’s reaction, he immediately pretended to be in a hurry and ran over to hold Johnny’s hand.</p><br/><p>Johnny frowned and looked very confused. However, Benjamin’s greeting was very convincing, therefore, he did not reject Benjamin.</p><br/><p>\"Rabkauhalla, Krabab.\" He opened his mouth, started muttering a bunch of words that could not be understood. By listening to the tone, it seemed as if he was asking Benjamin about something.</p><br/><p>At that moment, Benjamin was lost.</p><br/><p>However, he still grinned, held Johnny’s hands and nodded his head aggressively.</p><br/><p>With the use of non-verbal spell casting of the Water Ball Spell, a huge water ball suddenly appeared and wrapped around Johnny. Subsequently, Benjamin casted an Icebreaking spell, used the compressed ice needles and turned the water ball into an ice ball, trapping Johnny.</p><br/><p>Benjamin completed this series of actions very quickly. Therefore, Johnny could not even react and was firmly locked in the ice ball.</p><br/><p>Benjamin was relieved.</p><br/><p>Success.</p><br/><p>Fortunately, Johnny was just an ordinary person so he was easy to deal with.</p><br/><p>On second thought, while controlling the ice ball with Johnny inside, he cut a hole out to ensure that Johnny could breathe and speak, so he would not die in the ice prison.</p><br/><p>Initially, he intended to kill Johnny directly, but after observing the exchange between Johnny and the elderly man, he felt something strange. Therefore, he decided to interrogate this fellow first.</p><br/><p>\"Johnny,\" He regained the expression of indifference and spoke coldly, \"Obviously you’re just a faction leader, how did you and the cult preachers collude together?\"</p><br/><p>Johnny was obviously aware that something had happened since he was frozen in ice and only had his mouth and nose exposed. However, he was still very strong willed and did not answer Benjamin, but instead asked: \"Who are you? I have never provoked mages, what do you want to do?\"</p><br/><p>Benjamin sneered and shook his head.</p><br/><p>\"You’re still spouting nonsense, it seems like I have to give you a lesson.\"</p><br/><p>This narrow alley was still relatively hidden so no one would pass through. There would not be any magical disturbance if he did nonverbal spell casting. Therefore, Benjamin could hold a simple trial in this place.</p><br/><p>He used the Water Ball Spell to pour water into Johnny’s mouth and fill his stomach with water, and then made the water flow back out. It could be said that the frozen Johnny was given a \"stomach cleansing\" style of torture for a few times.</p><br/><p>Suddenly, Johnny made a ferocious shape with his mouth. He seemed like he wanted to curse, but was stopped by the water in his esophagus.</p><br/><p>After doing this a dozen times, Benjamin disabled the freezing spell and freed Johnny. Johnny, who had his stomach washed more than ten times, appeared to be in the verge of collapsing. He fell to the ground, twitching and dark red blood started to flow out of his mouth slowly.</p><br/><p>——Clearly, even without the ice prison, he did not have the slightest chance of resistance.</p><br/><p>\"What is your relationship with that cult after all?\" Benjamin squatted and asked again.</p><br/><p>\"I ... ... I ... ...\" Johnny seemed to be tortured too badly that he could not even complete his sentence.</p><br/><p>After seeing that, Benjamin frowned. He used the water particles sensing method to observe the condition of Johnny. He only saw that under the impact of water, in this fellow’s stomach, numerous small blood vessels were ruptured, and his body was bleeding heavily internally. In fact, with the state that he was in, he did not have long to live.</p><br/><p>Benjamin was shocked by Johnny’s condition.</p><br/><p>Knowing that he overdid his torture, he quickly used a few healing water balls and gave Johnny an emergency treatment.</p><br/><p>\"Hey, you almost died, if you still do not say anything, believe it or not, the next torture will be even more scary.\"</p><br/><p>After the treatment with the healing water ball, Johnny recovered a little. He caught his breath and looked at Benjamin, but his expression did not change: \"Whatever you do, my faith is not going to waver.\"</p><br/><p>Hearing that, Benjamin raised his eyebrow.</p><br/><p>\"Are not you afraid of death?\"</p><br/><p>\"I am not afraid.\" Johnny used a kind of pious tone that resembled an old man preaching and quietly replied.</p><br/><p>\"Well then, you're going to die,\" Benjamin smiled and replied.</p><br/><p>In a situation where Johnny cannot resist, he condensed an ice dagger, held it and gently pierced Johnny’s throat. Blood flooded out like fountain.</p><br/><p>He killed Johnny.</p><br/><p>Then he stood up and shook his head with a blank face.</p><br/><p>It could not be helped, no matter how hidden this alley is, it was still a public place, he did not intend to carry out a long trial here. But seeing how Johnny behaved, there was no way that Johnny will say anything without spending a lot of time. If that is the case, why would he waste his time with Johnny?</p><br/><p>Moreover, it was not like Benjamin have no clue about the relationship between Johnny and the cult. This fellow thought that he was tight-lipped, did he think that Benjamin really had no clue about it? He was too naive.</p><br/><p>In short, the ultimate purpose was to destroy the \"eagle\".</p><br/><p>As Johnny died gradually, Benjamin endured it in disgust, and according to Jessica's request, he used an ice axe to cut his head. He put the head into the bag, erased all traces of magic in the scene, turned and hurriedly left the alley.</p><br/><p>Soon, he returned to the garden, and in the house where the garden is located, he found</p><br/><p>Jessica.</p><br/><p>\"I have killed the leader of 'Eagle', you should know how to deal with the rest.\"</p><br/><p>He took the bag with Johnny’s head in it and placed it on a table.</p><br/><p>Jessica heard and immediately came forward, opened the bag, exposing Johnny’s head which still has his eyes open. Benjamin felt a little nauseous, but Jessica looked as though she just saw a priceless treasure, and stared at the head without blinking.</p><br/><p>Seeing how Jessica reacted, Benjamin shook his head and casually said: \"You ... ... this can be considered as revenge for your father.\"</p><br/><p>Jessica reluctantly smiled and said, \"I asked you to kill him only for the expansion of the 'Crow'. I have never hated him, at least, I hated my father a little more.\"</p><br/><p>Hearing that, Benjamin raised the eyebrows.</p><br/><p>\"Let’s not talk about this. Lord Benjamin, thank you very much for your help,\" She shook her head, showed a calm smile and said, \"I'll wait for the right and critical moment to show this head and completely defeat 'Eagle', please do not worry.\"</p><br/><p>Benjamin nodded. Then he added, \"Yes, and one thing, you better be careful, this guy is in contact with a strange cult.\"</p><br/><p>Jessica was doubtful: \"What do you mean?\"</p><br/><p>Benjamin shrugged his shoulders and said, \"It's a cult of the name ‘Rabkauhalla’, and I suspect that he may be like you, choosing to join forces with influences from outside for the development of his faction. However, the difference between the both of you is that he’s devoted in seeking refuge from that cult without any reservation.\"</p><br/>\n</div>"}