{"title": "Chapter 250: Can, Seriously", "id": 250, "volume": 3, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-250-can-seriously", "volume_title": "Volume 3", "body": "<h1>Chapter 250: Can, Seriously</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 250: Can, Seriously</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>\"Do you know the boss of the mafia gang the Eagles?\"</p><br/><p>In the room, Will was very focused on doing something. Benjamin saw this, walked over, and pulled him out of the junk, and asked.</p><br/><p>Will looked frightened. But when he saw that it was Benjamin, he immediately gave a flattering smile.</p><br/><p>\"Master Mage, of course I do, why?\"</p><br/><p>Benjamin answered him expressionlessly, \"That guy just pissed me off, I want to kill him.\"</p><br/><p>\"...\"</p><br/><p>Will wiped the sweat off his forehead, and said with some difficulty, \"Master Mage, I am just a common thief, this kind of thing...I don’t think I can be of much help.\"</p><br/><p>\"How?\" When he heard this, Benjamin gave a smile that showed his evil intentions, \"You could steal the invitations, I’m sure you know plenty about the different gangs on this street. I don’t want you to do anything, I just need you to get me close to him, then you don’t need to worry about the rest.\"</p><br/><p>\"This...\" Will was still uncomfortable, as though talking about murder made him so frightened. He had no courage, no wonder he was just a common thief.</p><br/><p>\"This is how it is going to be, do you want some potions?\" Benjamin pulled out a bottle of the most basic agility potion and showed it to the other guy, \"If you help me get close to him without being noticed by anyone, this is yours.\"</p><br/><p>To someone like Will, potions are considered a luxury. He may have the money to buy them but he was still a thief. And that meant he did not possess any proof of identification like the mercenaries do; which denied him the privilege of buying potions. Before he can even enter the shop, he will be chased out of it.</p><br/><p>In reality, these countries have pretty strict laws regarding the buying and selling of potions. In a legal store, they will not sell their products to someone who doesn’t have a clue how to use them.</p><br/><p>\"Master Mage, what kind of potion is that?\" Will perked up at the sight of it.</p><br/><p>\"It is an agility potion; I reckon someone like you would definitely have use for it.\" Benjamin grinned as he spoke.</p><br/><p>When he heard this, Will’s face changed and became even more scrunched up. But very quickly, he sighed and stretched out his hand to take the potion from Benjamin.</p><br/><p>\"You cannot tell anyone about this, I have got nothing to do with this.\"</p><br/><p>Benjamin nodded his head and said, \"Of course.\"</p><br/><p>After about ten minutes and with sufficient preparation, Benjamin and Will silently snuck out the door and left.</p><br/><p>Based on the information that Jessica gave him, the Eagle’s main base of activity was a little to the south of their current location. But Will shook his head and instead headed west.</p><br/><p>Even though this surprised Benjamin, he didn’t say anything.</p><br/><p>After walking for half an hour, they arrived at a quiet neighborhood.</p><br/><p>The road was framed by neat whitewashed buildings which gave the place a special atmosphere. People walked about with solemn faces, not making a sound. It reminded him of the Holy District in Havenwright.</p><br/><p>And according to the map that Will drew, there was no difference between these streets and those in the Holy District.</p><br/><p>Aside from places like the Kingdom of Helius, religion does not play a huge role, neither does it affect the government. But there was still quite a number of religious people. The three country’s may not allow the church to send out missionaries, but there were other small factions that were ignored but not banned.</p><br/><p>Just like this district, the gathering place of the \"Rabkauhalla\" cult.</p><br/><p>\"Their boss is religious?\" Benjamin whispered, his voice dripping with suspicion.</p><br/><p>\"I’m not sure.\" Will shook his head as he answered softly, \"But I followed him for a short while a while back and noticed that he frequented this place, and he would sneak in. If you want to kill him anonymously, this is definitely the place to do it.\"</p><br/><p>Benjamin nodded his head and didn’t say anything else.</p><br/><p>When choosing their disguise, Will purposefully chose clothes that resembled religious clothing. With that ensemble, they looked no different from the other followers, and so they drew no attention to themselves.</p><br/><p>As quickly as possible, they walked into a temple with a white round dome on it.</p><br/><p>There were a lot of people inside, it was as though there was some sort of event going on. An old man stood on the stage, saying something that they couldn’t understand. Benjamin and Will crept through the listening crowd.</p><br/><p>What he didn’t expect was to find his target so soon after coming in.</p><br/><p>The leader of the Eagles, Johnny, was wearing an odd little round cap, dressed in the followers’ garb, easily recognizable by his face. At that moment, as he sat in the front row and watched the old man on stage with a devout look on his face, he looked nothing like a mafia boss. It was as though he would have no qualms strapping a bomb to his chest and die.</p><br/><p>There was nothing about this side of him in Jessica’s notes.</p><br/><p>This was very interesting.</p><br/><p>Benjamin and Will exchanged glances as they sat not too far away from Johnny. They looked as though they were paying attention to the speaker, but secretly they were observing Johnny’s every move, waiting for their chance.</p><br/><p>The old man on stage spoke for almost an hour before he stopped and ended the odd religious activity.</p><br/><p>The followers stood up to leave. Johnny stood up too, but instead of leaving, he followed the old man through a set of doors, right out of the prying eyes of Benjamin and Will.</p><br/><p>Benjamin raised his eyebrows.</p><br/><p>Using the water elemental sensing technique, he could see that Johnny and the old man enter a small room and exchanging something in it. But everyone else was leaving and as the crowd thinned, it would raise suspicion if they stayed here.</p><br/><p>So they followed the crowd out and left.</p><br/><p>As they left the building, the ate two bowls of beef noodles in the restaurant next door. They may act like they were just hanging out, but actually Benjamin was using the water elemental sensing technique to observe Johnny’s every move.</p><br/><p>\"Can you really observe them from here?\" Will asked in a low voice.</p><br/><p>Benjamin just nodded his head.</p><br/><p>From his observation, Johnny and the old man wasn’t just talking. But, the old man pulled out a weird book and handing it over to Johnny. And Johnny pulled out bags upon bags of money in exchange.</p><br/><p>Benjamin felt a jolt in his chest as though he thought of something</p><br/><p>Johnny didn’t stay long, and when the two of them finished their beef noodles, he sneakily left through the back door of the building. Benjamin and Will quickly paid their bill and followed Johnny from quite a distance away.</p><br/><p>They slowly left the district behind.</p><br/><p>Will was surprised at Johnny’s choice of direction and so he suddenly said, \"This is it, it’s your chance. He is headed to a secret spot, and soon he will turn into an isolated alley. You should make your move there then no one will know.\"</p><br/><p>Benjamin nodded his head and made his own preparations.</p><br/><p>\"No problem, no problem at all, I should go.\" Will said anxiously.</p><br/><p>\"You go, if anything comes up I’ll look for you.\" Benjamin said in a low voice, \"Don’t tell anyone about today, or else it won’t bode well for you when I see you again.\"</p><br/><p>Will nodded his head as he turned and left.</p><br/><p>And Benjamin, he followed Johnny, and soon, he turned into the alley that Will spoke of.</p><br/>\n</div>"}