{"title": "Chapter 264: The Weird Parchment", "id": 264, "volume": 3, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-264-the-weird-parchment", "volume_title": "Volume 3", "body": "<h1>Chapter 264: The Weird Parchment</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 264: The Weird Parchment</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Only when Benjamin casted Water Particle Detection by chance and sense the black feather by the street, did he realize that this was the signal by the ‘Crow’.</p><br/><p>After the attack of street gangs on the ‘Rabkauhalla’ Cult, Benjamin made sure others could not track of the news on this matter to avoid arousing suspicion of himself. But, it has already been a week since the incident. The hype had died down and he had no need to keep so distant from the matter anymore.</p><br/><p>He should check the situation on the ‘Crow’.</p><br/><p>Thus, Benjamin acted as if he wanted to go for a walk after lunch and left the house. He passed through the back streets and arrived at the secret hideout of the ‘Crow’.</p><br/><p>In the small dark room, he met Jessica once again.</p><br/><p>Maybe because she had to deal with many things lately, but she seemed a little exhausted. However, when she saw Benjamin, she still flashed a smile.</p><br/><p>\"Sir Benjamin, thank you for your help. Now, the ‘Eagle’ gang is no more.\"</p><br/><p>Benjamin nodded.</p><br/><p>Their efficiency was remarkable. Once the boss was dead, they only took one week to eliminate the remaining gang members. Of course, there was a possibility that this was how it worked in their community.</p><br/><p>\"Were you guys the one who attacked the Cult recently?\" He asked.</p><br/><p>\"It was the doing of the late ‘Eagle’ gang.\" Jessica shook her head, \"I used a little trick and blamed the death of their boss on the other gang. So, they sought out the Cult and fought with them. They even set the street on fire.\"</p><br/><p>Benjamin was really surprised to hear this. After so many days, he had pretty much guessed the entire confrontation.</p><br/><p>This was a rather clever way of doing things, but....</p><br/><p>\"Doing this must have infuriated the Cult right? They will do all they can to find out the true murderer of Johnny. What happens if they discover that we are the culprits?\" Benjamin asked.</p><br/><p>\"Relax. If the matter gains traction, the Cult will be the ones who will be in deep water.\" Jessica flashed a smile, \"The government has sent people to investigate this issue – and you know they are most sensitive when it comes to religious problems. That Cult is well known for doing fishy things. If it really comes to this, they will be too busy avoiding the authorities and have no time to investigate the matter.</p><br/><p>Upon hearing this, Benjamin became content.</p><br/><p>\"So, have you now claimed the street that the ‘Eagle’ had previously occupied?\"</p><br/><p>Jessica smiled and nodded. She took a small bag and handed it to Benjamin. \"The ‘Crow’ has already expanded. Now, we can provide you thirty coins every month. This is this month’s cut.\"</p><br/><p>Benjamin was lazy to even check the contents so he took the bag without hesitation.</p><br/><p>He now had another source of stable income.</p><br/><p>\"You ordered people to leave feathers by my front door. It wasn’t just for you to report your victory to me, was it?\" He asked again. \"What trouble did you run into? Or is there another gang leader that you want me to assassinate?\"</p><br/><p>Jessica however, shook her head and said, \"You must be joking; the gang just expanded, so it will need some time to stabilize. In order to keep a low profile, I won’t be borrowing Sir’s strength very often.\"</p><br/><p>As she said this, she turned around and placed a small box from the corner of the room on the table.</p><br/><p>\"This is what we accidentally found when we were ransacking the old ‘Eagle’ hideout.\"</p><br/><p>Benjamin became interested in the antique box.</p><br/><p>He opened the box, only to see that in it lay a single piece of parchment. He took the parchment out and spread it open – and saw that it was blank.</p><br/><p>Benjamin was a little perplexed. Just as he was about to put it back, he sensed a small hint of magic aura radiating from the parchment.</p><br/><p>What was this?</p><br/><p>\"I have no idea what it is. The ex-underlings of the ‘Eagle’ do not know as well. But, they all mentioned that their ex-boss cared a lot about it.\" Jessica explained. \"I thought it may be related to magic, so ordered for someone to notify you.\"</p><br/><p>After listening to this, Benjamin replied, \"It is definitely related to magic. There is a very slight elemental disturbance on it.\"</p><br/><p>Jessica pressed on. \"What is it though? A letter? A formula?\"</p><br/><p>Benjamin shrugged and answered rather helplessly, \"I have no idea. Right now, I haven’t got a clue.\"</p><br/><p>Surprisingly, Jessica was not that disappointed. She simply piped, \"If that is the case, then you hold on to it. We have no mage, so there is no point of keeping it here. To us it’s just like a piece of scrap paper.\"</p><br/><p>Benjamin was lazy to refuse, so he nodded and kept the parchment.</p><br/><p>As a shareholder of the ‘Crow’, it was only reasonable that he received additional rewards other than his dividends every month. After all, he was the one who assassinated Johnny.</p><br/><p>With nothing more to ask, he bid Jessica farewell. He secretly left the area and returned home with his spoils.</p><br/><p>Sitting in his room, Benjamin took the parchment out again and slowly opened it.</p><br/><p>Previously, Jessica was watching him, so he could not properly study it. But now, with a more comfortable environment, he could clear his mind and inspect what this parchment truly was.</p><br/><p>A slight elemental disturbance... Where did it come from?</p><br/><p>Benjamin casually picked it up but immediately felt a familiar sensation.</p><br/><p>This was not a scroll of parchment, but.... a magic tool.</p><br/><p>Benjamin’s stomach tightened. The parchment did not feel the same as the Cross or Button of Divine Arts that were created by the Church. He tried the most common method of activating magic tools which was priming the tool with Spiritual Energy, but the parchment did not react.</p><br/><p>What was the damn gear to activate this thing?</p><br/><p>After thinking for a bit, Benjamin casted Pillar of Steam and let the steam slowly baked the parchment. He wanted to see whether there would be any hidden words on it. Wasn’t there a special material that was transparent under normal conditions but showed up after heating? He was hoping it might be the case here.</p><br/><p>However, after heating it up for half a day, the parchment remained blank - no change at all.</p><br/><p>Benjamin did not give up. Instead, he became more absorbed. He casted Waterball and Icebreaking. He soaked it in water, froze it with ice, cut it with a knife, and tore it with his hands... Unfortunately, no matter how hard he tried, the parchment remained a parchment, strangely resilient but otherwise ordinary.</p><br/><p>\"Why don’t you try to drip your blood on it?\" The System suggested so</p><br/><p>\"Dripping blood sounds so old-school. Surely this novel cliché won’t happen in real life, will it?\" Benjamin hesitated slightly.</p><br/><p>\"You’re not a novelist. Life is old-schooled anyway.\" The System retorted sharply. \"It is because it is common in real life that it is written in novels over and over again. That is how it becomes tacky.</p><br/><p>\"...You have a point.\" It was rare for Benjamin to admit that the System made sense.</p><br/><p>He used Ice blade to cut his finger and dropped a few drops of his blood on the parchment.</p><br/><p>Unexpectedly, the System was right!</p><br/><p>Once the blood spread through it, the parchment that did not have reaction with anything else suddenly released a wave of elemental magic. The elements in the surrounding air suddenly experienced a series of changes. As if they were being controlled by an unknown power, they were sucked directly into the parchment.</p><br/><p>After that, to Benjamin’s utter shock, the parchment started to shine an intense green color.</p><br/>\n</div>"}