{"title": "Chapter 263: The Fear of Giving Name", "id": 263, "volume": 3, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-263-the-fear-of-giving-name", "volume_title": "Volume 3", "body": "<h1>Chapter 263: The Fear of Giving Name</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 263: The Fear of Giving Name</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>\"Okay... There shouldn’t be any problem now.\" In the Mercenary Association, the man at the reception had not changed his shift yet. He slowly checked the forms that Benjamin handed to him. \"Oh right. What is the name of your Mercenary Group?\"</p><br/><p>Upon hearing this, Benjamin and the mages that came along with him exchanged a few glances. No one spoke a word; they totally forgot to discuss this matter.</p><br/><p>\"Why not just call it Blaze the Mercenary Group?\" Frank suggested.</p><br/><p>\"...\"</p><br/><p>Benjamin wiped his brow and was about to reject this suggestion but the man at the reception shook his head and beat him to it. \"I’m so sorry, Sir Mage. This name has already been registered.\"</p><br/><p>Frank was disappointed but Benjamin secretly breathed a sigh of relief.</p><br/><p>He could not even cast a Fireball Spell. Calling their mercenary group the ‘Blaze’ would be rather embarrassing.</p><br/><p>\"Then, let call it ‘Strongest’ the Mercenary Group.\" Joanna suggested.</p><br/><p>\"I’m sorry, Miss Mage. This name had already been registered as well.\" The man at the reception replied again, rather apologetically.</p><br/><p>Benjamin couldn’t believe there were people who would use such arrogant names. Whoever this person was, he must like reading online novels.</p><br/><p>\"Spectre the Mercenary Group?\" Lara spoke.</p><br/><p>Benjamin thought about it. Even though this name was still sick, but at least it sounded cooler - although slightly tacky, he found it acceptable.</p><br/><p>However...</p><br/><p>\"I’m sorry, Sir Mage. This name has also been taken.\" The man at the reception took a deep breath and replied.</p><br/><p>\"...\"</p><br/><p>Benjamin suddenly had a bad premonition.</p><br/><p>\"Magic Mercenary Group?\"</p><br/><p>\"I’m sorry, Sir Mage. This name had been registered before.\"</p><br/><p>\"Dematia the Mercenary Group?\"</p><br/><p>\"I’m sorry, Sir Mage. This name had been...\"</p><br/><p>\"Eel the Mercenary Group?\"</p><br/><p>\"I’m sorry, Sir Mage...\"</p><br/><p>\"You’re kidding… someone else has taken this name?\"</p><br/><p>\"I’m sorry.\"</p><br/><p>Benjamin and the others almost went insane.</p><br/><p>\"Can you tell me what name has not yet been taken?\" In despair, Benjamin pressed the palms of both of his hands on the table and asked.</p><br/><p>\"There are some.\" The uncle flipped open the thick book and said in hesitation. \"Shit-eating Mercenary Group, Worst Mercenary Group, Idiotic Mercenary Group... Names like these had not been claimed yet.\"</p><br/><p>\"...\"</p><br/><p>Benjamin did not know if he had enough strength to stop the group from rushing over and beating up the clerk. Truthfully, he wanted to do the very same thing.</p><br/><p>In the tense atmosphere, everyone remained silent. It was Benjamin who finally spoke. With a voice incredibly calm he said, \"One Mercenary Group? No one should have taken that name yet, right?\"</p><br/><p>\"One, huh...\" That uncle seemed a little terrified as he hurriedly flipped through the book.</p><br/><p>After a while, he looked up at the group and nodded.</p><br/><p>\"Then One Mercenary Group it is!\" Benjamin could not stand the torture anymore. He slammed the table and immediately decided on the name of their Mercenary Group without consulting the others.</p><br/><p>The uncle nodded in relief as well. He wrote something down in the book, then turned around and left. He came back with a few documents along with around twenty badges.</p><br/><p>He gave Benjamin the items.</p><br/><p>\"From this point, your mercenary group has officially been established.\" He said in a serious tone. \"In the old days, there was a ceremony to go through. But for your convenience, the ceremony has been cancelled. Just take these things: the badges for your members, the certificate proof of your mercenary group... Strictly speaking, you can accept mission now. But for the due rewards, you will have to wait until the verification from our side has been completed before you can claim it.\"</p><br/><p>Benjamin took the things nodded as he listened to the man’s words.</p><br/><p>The mages behind him all surrounded him. They took the badges and toyed with them in their hands curiously.</p><br/><p>It was rather simple looking. The pattern of the flames overlapped with some sort of sword. To be honest, it looked kind of cheap.</p><br/><p>But, it was still an item that bore the history of the mercenaries and because of this the mages still excitedly clipped it to their chest.</p><br/><p>Upon seeing this, Benjamin smiled a bit and kept the remaining badges and documents properly.</p><br/><p>\"Is there any fun mission available? We would like to accept it now!\" After clipping the badge, Joanna inquired excitedly.</p><br/><p>\"I’m sorry. Giving out missions to the mercenaries is not our responsibility. You should go to the other counter.\" The man at the reception pointed across the room.</p><br/><p>\"...\"</p><br/><p>They quickly went to the second counter. Under the guidance of Benjamin, the gang who now represented ‘One’ the Mercenary Group, accepted their first mission - a rather simple mission of hunting Magic Beast.</p><br/><p>The target magical beast was a cat that could spit water. The location of the mission was not far from the City of Rayleigh. Even for a beginner, this was just too simple.</p><br/><p>After accepting the mission, the mages returned home cheerfully. After packing some equipment, they set off. They were eager to complete their mission and no one could stop them from doing so.</p><br/><p>Benjamin was in a good mood. This was fine; if they enjoyed doing this, then he would not ruin their fun.</p><br/><p>Most of the missions were relatively easy, thus not all members were required to go. These few mages happened to be the ones who were the best at combat in their group, so Benjamin was not so worried about them. He knew that nothing would happen to them against such simple foe.</p><br/><p>He was thinking of using the bounty that they earned to buy Magic Beast materials for their potion mages so that he could create more potions – that he would later sell off for a profit of course.</p><br/><p>Actually, for matters regarding the Magic Potion, Benjamin had let Varys handle almost everything. The purchase of raw materials, the sale of the Magic Potions...Varys used to be a merchant, so doing this came naturally to him. The group now had a revenue of dozens of coins a day just from selling the Magic Potions that they had created.</p><br/><p>Benjamin decided to let the potion mages interact with those who were more combat focused in the future - when ‘One’ the Mercenary Group had matured a bit more. This was so that the potion mages could directly request the combat mages to bring back certain raw materials from their missions. They could save more money this way.</p><br/><p>Upon thinking this, he could not help but feel proud. His group was finally starting to operate properly!</p><br/><p>As for himself, he no longer had to organize everything by himself. He would have more time and energy to focus on improving his own strength.</p><br/><p>Of course, there were still certain matters that he had to attend to personally.</p><br/><p>For example, the next day a suspicious man passed by their house. He left about a dozen black feathers at the staircase by their front door.</p><br/>\n</div>"}