{"title": "Chapter 260: Ten Consecutive Wins", "id": 260, "volume": 3, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-260-ten-consecutive-wins", "volume_title": "Volume 3", "body": "<h1>Chapter 260: Ten Consecutive Wins</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 260: Ten Consecutive Wins</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Upon hearing those words, the remaining few looked interested. However, the mage that battled with Benjamin earlier pulled them over to whisper a few words with a face as pale as a white sheet. What proceeded was a change in their facial expression and all shook their heads and smilingly declining.</p><br/><p>\"Nah... Mage Benjamin, I think it’s better you challenge someone else. There is no points in fighting with the same lot, no?\"</p><br/><p>It was unclear what the mage told them, but judging from their look, they did not seem the least bit interested in having a match with Benjamin.</p><br/><p>Seeing this, Benjamin was not going to egg them on.</p><br/><p>As a matter of a fact, these guys had already known about Benjamin’s capabilities and so they will not underestimate their opponent. Dealing with them would require a lot of time and effort. And so, in terms of efficiency, it would be best to challenge others.</p><br/><p>He nodded farewell to the \"Viper\" mercenary group who was still in a cloud and continued his journey to challenge others.</p><br/><p>There were quite a lot of other mages on the scene. Although not all were interested in battle but the silver coin for an incantation rule was attractive. Not long after, Benjamin found a new opponent.</p><br/><p>He had a sense that the person wasn’t too strong, and so he hastily brought the person to battle.</p><br/><p>This time, the score keeper of a servant looked funnily at Benjamin when they entered the battle arena.</p><br/><p>\"Why... is it milord again?\"</p><br/><p>\"Why is it me?\" asked Benjamin with a face of innocence.</p><br/><p>The servant hesitated and then shook his head, \"No... Nothing, please enter, ilord.\"</p><br/><p>The person that Benjamin was challenging was filled with confusion when he heard the odd conversation. However, he had already accepted the challenge and didn’t think too deeply about it. He followed Benjamin into the ring.</p><br/><p>This time, Benjamin did not bother to waste any more time. Once both of them were in position, he threw a few Water Bombs to form an Anti Magic Waterball. The trapped opponent was in a daze.</p><br/><p>\"Wh-what is this...\"</p><br/><p>Half a minute later, a smiling Benjamin and a still confused opponent again left the metal nettings one after the other.</p><br/><p>— The entire round from start to finish took no more than half a minute. The moment the opponent summoned a protective shield, was the moment it announced the victory of Benjamin.</p><br/><p>Once this unworthy-of-description mage returned to his senses, he immediately wanted to ask Benjamin about magic he used, but Benjamin had already disappeared into the crowed, looking for his next victim.</p><br/><p>The mage stood blankly at the same spot. It was a sad sight.</p><br/><p>The score keeper looked at him sympathetically.</p><br/><p>\"I wanted to alert milord, but... Ah well, Sir Mage, please do not lose faith, this is only an interchange activity. Do not lose faith in magic,\" The servant comforted.</p><br/><p>The mage turned his head to look at the servant. His eyes filled with sorrow.</p><br/><p>Benjamin challenged one mage after another. He made a conclusion that the mages here were mostly here for the freebies. Their capabilities were not that high and could be taken care of using the Anti Magic Waterball. Therefore, he started to go on a rampage with the challenges, and was unstoppable.</p><br/><p>Benjamin wasn’t sure himself if he overdid it, but... so what?</p><br/><p>It was time he stopped being low key.</p><br/><p>When most were completing six matches, Benjamin had already completed ten. The Anti Magic Waterball was not of the norm, and so others could not have seen it coming. It was possible that there were a few of them who hadn’t shown their hand or had trump cards, but they never had the opportunity to reveal it.</p><br/><p>— Unless their affinity for the elements surpassed that of Benjamin, once they were trapped within the Waterball, they were done for.</p><br/><p>After ten matches, Benjamin felt that he was being eyed by the score keeper. By the fifth or sixth match, the servant was still only looking at him funny and saying, \"You again?\"</p><br/><p>But by the seventh or eighth time, the servant was already numb.</p><br/><p>\"Oh, it’s you again.\" His eyes were out of focus and mentioned expressionlessly. He was simply too lazy to look.</p><br/><p>Well, Benjamin could do nothing about it.</p><br/><p>After all, he needed the incantations.</p><br/><p>Ten matches, with ten consecutive wins. He had exchanged a total of nine intermediate level magic incantations. There was one mage that was simply too poor and could only exchange for a beginner level magic incantation. However, Benjamin was not greedy, he was quite satisfied.</p><br/><p>\"This is not called greedy? Another ten matches and you can publish a book already.\" The System teased him.</p><br/><p>\"I can’t handle over ten matches.\" Benjamin shook his head and answered in his heart, \"Do you really think that instant kill kinda match is easy? Anti Magic Waterball takes a hit on Spiritual Energy, I don’t have that much energy left.\"</p><br/><p>At the moment, he was starting to fill a drain in his Spiritual Energy after ten matches. He decided to take a rest and observe other matches to consider whether he would continue to challenge any more.</p><br/><p>What he didn’t think was that, once he was within the crowd, people started heading towards him before he could take a break.</p><br/><p>\"Sorry to bother you, Sir. I just watched your match and wanted to ask what magic was that big water ball?\"</p><br/><p>\"This was the match I started counting half an hour ago, he won like, seven matches.\"</p><br/><p>\"I think it’s more than that... I remember that he started challenging people from the beginning?\"</p><br/><p>\"Who is this guy? He’s unfamiliar...\"</p><br/><p>If one win was a pebble thrown into the waters, then ten consecutive wins, quick ten consecutive wins, was a meteor that crashed into the waters.</p><br/><p>There were always mages that stood at the side lines to observe matches. Plus, after the matches, the losing mages would inform their companions and news spread. In a blink of an eye, an unknown Benjamin was suddenly the center of attention. It was as though he hired a million water army that made him an instant headline.</p><br/><p>After seeing Benjamin...</p><br/><p>\"I think I know his name. He... He came to talk to us just now, what did he say?\"</p><br/><p>\"I think he’s a mage from another place, he just arrived at Rayleigh City.\"</p><br/><p>\"When did outsider mages become so powerful? I thought our capabilities were better here? Where did he come from...\" There were all kinds of whispering around. Words were spreading all around. Benjamin did not have the energy to pay attention to these.</p><br/><p>He was surrounded by a bunch of mages. Some asked the type of magic he used to summon the water ball, others were trying to recruit him into their mercenary group, to ask Benjamin the type of magic he used as a companion.</p><br/><p>It couldn’t be helped. Mages were always on the pursuit for new magic, especially special ones.</p><br/><p>Benjamin was in a helpless position.</p><br/><p>He sort of had that feeling like he was in a press conference.</p><br/><p>He couldn’t really reply what seemed like restrained but continuous questions. If he were to be straight and said it was the Water Ball spell, he might invoke public anger. That was why he tried to be reserved and avoided the questions with a smile. Apart from his name, he revealed nothing further.</p><br/><p>In the end, the only thing these mages remembered, was the name \"Benjamin\".</p><br/><p>To be honest, one of the reason Benjamin started to challenge was to build a name for himself. So far it was working and he naturally would use this opportunity to increase his influence.</p><br/><p>He wanted to let the local mages know that there was a new mage in town, and his name was Benjamin. He was definitely not one to mess with.</p><br/>\n</div>"}