{"title": "Chapter 266: Prehistoric Civilization", "id": 266, "volume": 3, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-266-prehistoric-civilization", "volume_title": "Volume 3", "body": "<h1>Chapter 266: Prehistoric Civilization</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 266: Prehistoric Civilization</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>At that moment, Benjamin’s goosebumps almost raised.</p><br/><p>He focused his eyes, and the image became clearer. He could see the stone statue with a broken arm come to life, its marble legs moved and started slowly walking forward.</p><br/><p>Damn…..</p><br/><p>Benjamin took a deep breath but did not make any sound.</p><br/><p>What’s going on?</p><br/><p>Without question, the things in front of him was beyond his knowledge. A spirit of vengeance? A magical beast? Or just a moving statue? Is it alive or dead? Am I hallucinating? Is it being controlled by someone else?</p><br/><p>Why would a plain old statue start moving for no reason?</p><br/><p>If there was a discus-throwing statue here as well, would it throw discs at people too?</p><br/><p>Benjamin felt as if he entered another world by accident.</p><br/><p>He did not know why but his instincts told him that these strange happenings had nothing to do with magic. From the body of the moving statue, he could not feel any reaction of elements, but he could feel slight mental energy, but the state it was in was different from when it appeared normally.</p><br/><p>From his own perspective, mental energy was a change in energy, and it would expand normally like in waves. But, the mental energy the statue gave off was dull and like particles.</p><br/><p>Benjamin started to suspect, was it another kind of life form?</p><br/><p>While he was thinking, the statue continued moving forward and reached the same street where Benjamin was. Then, it turned rigidly and walked towards Benjamin, it could be that it has noticed Benjamin.</p><br/><p>Seeing its emotionless face, it was rather terrifying.</p><br/><p>Thus, with some hesitation, Benjamin chanted the Icebreaking Spell and condensed about ten icicles, and launched them towards the statue.</p><br/><p>-----Such an eerie thing, better not let it get close.</p><br/><p>Rumble!</p><br/><p>The statue did not dodge, but continued forward. Thus, tons of icicles hit him, turning him into a beehive. Following that, it fell over and lost the ability to move.</p><br/><p>\"Is it dead?\"</p><br/><p>Benjamin was confused. He crept closer carefully, he could see that the statue has shattered into many pieces from the attack just now. From the way it shattered, the white outer layer was not limestone, but a kind of soft material.</p><br/><p>As for its body, there were cogwheels, steel plates, and poles…..all made from strange spare parts, it appeared to Benjamin as a \"copy\" of a statue.</p><br/><p>....A robot?</p><br/><p>But, this statue’s interior was not intricate, it was rather roughly made. Benjamin investigated, but he still could not understand its structure, but based on his judgment, this thing could only walk rigidly and nothing else.</p><br/><p>But…..what kind of energy was supporting its movement?</p><br/><p>He searched for a while. Finally, in the statue’s cranium, he found a glowing green crystal of some sort.</p><br/><p>The crystal looked similar to the stone he picked up before, with some proper sensing, the energy inside was the same, but this crystal was much more concentrated. Before this, the mental energy that Benjamin felt was dispersed from this crystal as well.</p><br/><p>The crystal was put in a weird setting, it was probably used to extract energy from the crystal, allowing the statue to move.</p><br/><p>But, even so, Benjamin was extremely surprised.</p><br/><p>What sort of city was this?</p><br/><p>With this strange stone and mysterious power, then, even with technology enough to utilize them to creating human-like robots.</p><br/><p>Benjamin felt as if he discovered an unrecorded civilization.</p><br/><p>A civilization that was totally different from magical civilization.</p><br/><p>After some thought, he continued walking forward, slowly getting closer to the center of the city. On the way, he met tons of walking statues, but he ignored them, and the statues ignored him too, they just walked past each other.</p><br/><p>After some investigation, Benjamin could see that these statues were the only \"citizens\" of this city. Who knew what happened, but there are no living things. As for bones and fossils, Benjamin only found them at the center of the city.</p><br/><p>At the center, there was a forum like those in ancient Greek times. The opulent and imperial structures have endured who knows how long, and what was left was just derelict buildings.</p><br/><p>On the stairwell of these buildings, bones of all sorts were scattered all over.</p><br/><p>\"How terrifying…..\" Even the System could not resist making an appearance to comment.</p><br/><p>It could not be blamed that it would say such a thing, even Benjamin who was seeing everything started to feel a chill in the air.</p><br/><p>The pile of bones were littered along the way from the bottom to the top of the ten meter tall stairwell. Tons of skulls had yellow marks in the eye sockets, as if it was a clue to a massacre that had happened a long time ago.</p><br/><p>How is this still a forum? It was a mountain of bones.</p><br/><p>He activated his water particle sensing technique, but Benjamin could not find anything at all. Thus, he regained his nerves, and flew up, over the bones, into the interior of the forum.</p><br/><p>In there, he saw a mural.</p><br/><p>Even though many years have passed, the mural was not completely deteriorated, thus, he could still see the art clearly.</p><br/><p>Benjamin could tell that the art showed two sides that were opposing each other.</p><br/><p>One side were people glowing green, they were well-built, and wielded all sorts of weapons, looking really fierce. The other side all wore capes, and had their faces covered, looking mysterious, and even had flames floating on top of their heads.</p><br/><p>His instincts told him that the ones wearing capes were mages.</p><br/><p>What about…...the green people?</p><br/><p>He did not know.</p><br/><p>After relating the mural and everything in this city, Benjamin suddenly felt those green people probably used the power in the stones to make themselves stronger to fight against the mages.</p><br/><p>He used his imagination to view this art, then he suddenly got an answer.</p><br/><p>Maybe…..a long time ago, this world did not only have special powers like magic. Not knowing why, later on, these green people and their civilization vanished, and did not leave any trace in history. Thus, finally, the only knowledge people had about the ancients were just Abel, Cain, magic, and the divine arts.</p><br/><p>At least, from the look of this mural, these green people could go toe-to-toe with mages.</p><br/><p>Thinking of this, Benjamin took a deep breath and continued walking deeper inwards.</p><br/><p>No matter how one saw it, today’s trip to search for treasure end up with him discovering even greater things. Stones with strange energy, a prehistoric civilization…..who knows, maybe he could find writings and records on them.</p><br/><p>In the end, he actually ended up finding them.</p><br/><p>In the giant hall, he found a stone block. The stone block looked really old, but it was not weathered at all, on the surface was etched with letters and runes in rows that Benjamin had never seen before.</p><br/><p>Benjamin picked up the stone block, and closely examined it. Suddenly, he noticed something familiar.</p><br/><p>An equilateral triangle, yet with a small missing part that looked like a triangle musical instrument.</p><br/><p>Benjamin could not help but take a deep breath.</p><br/><p>…..Was it a coincidence?</p><br/><p>His logic told him, this triangular rune did not look complicated, in prehistoric civilization, it was probably common for people to use them as words. But, his instinct told him, this triangle and the triangle in his dimension of consciousness were the same.</p><br/><p>What did this mean?</p><br/><p>Suddenly, there was a voice coming from the depths of his soul.</p><br/><p>\"Water.\"</p><br/><p>Benjamin was shocked to his core.</p><br/><p>At that moment, he thought of the pure blue space that continued replicating itself, the sound that represented \"water\". Not knowing why, he was suddenly very sure that this sound was the way to pronounce that triangle that was missing a part.</p><br/><p>As for this rune, its meaning was \"water\".</p><br/><p>Plain and pure water.</p><br/><p>Thinking of this, Benjamin could not help but extend his hand to touch the triangular rune.</p><br/><p>At that moment, the him who was in a world covered in green light suddenly could see a blue light that covered the earth and the sky that flashed before his eyes. Then, when he regained consciousness, he found that he was once again in the pure blue space that he had visited not long ago.</p><br/>\n</div>"}