{"title": "Chapter 261: ‘Greetings’", "id": 261, "volume": 3, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-261-%E2%80%98greetings%E2%80%99", "volume_title": "Volume 3", "body": "<h1>Chapter 261: ‘Greetings’</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 261: ‘Greetings’</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Now that he mentioned it, the whole gathering of the mages took a rather long time.</p><br/><p>Until now, it was already past ten in the night, but these people were still very excited. Moreover, in the middle of the venue, there were still a lot of people battling. They probably wanted to gain more spells or were going for the highest prize which was half price in half a year.</p><br/><p>Even though there were people leaving in the middle of the fight, the people outside of the venue had not left just yet at this moment.</p><br/><p>Benjamin stood there, still avoiding the questions of the other mages beside the venue. But, his answers were more or less the same, so most of the mages knew they could not get much information from him. So they had to give up and left respectively.</p><br/><p>Of course, it was much calmer on the outside. But in private, the topic about Benjamin continued to be discussed by the others. It might go on for a very long time.</p><br/><p>Benjamin also knew this from the other mages that these ten consecutive wins were such a rare occurrence in the history of their many gatherings.</p><br/><p>Even though in the end, every person who won the prize would have a number of wins in the double digits. But, that was the result of many battles: they admitted defeat when they encountered a troublesome battle and immediately began the next one. Even though Sir Vinci’s side had not released any data, but normally five or six consecutive wins should be their highest record.</p><br/><p>Therefore, a ten consecutive wins from out of nowhere – such quick ten consecutive wins at that – made their jaws drop that they almost dislocated.</p><br/><p>There were some who questioned whether it was cheating. But among the losers, there were some rather famous mages. Why would they help an outsider to cheat?</p><br/><p>Thus, these people took an uncharacteristically interest in Benjamin.</p><br/><p>\"You are really an amazing mage. Your words have benefited me a lot.\"</p><br/><p>Finally, after handling the last mage who came to talk to him, Benjamin waved him goodbye. In his heart, he sighed a breath of relief.</p><br/><p>Being a nobody did not feel nice. But becoming infamous in one night was truly not an easy job either!</p><br/><p>The mages who came to talk to him were always hard to handle. He could not tell the truth, so he could only avoid answering those questions. In order to expand his influence, he had no choice but to give these people a good impression of him. He could not just ignore them even when he was impatient. In these ten minutes plus that he had gone through, Benjamin felt like he was much wearier than the time he won ten times consecutively.</p><br/><p>After that, he went and requested something from the servant who was responsible for the statistics. That servant told him emotionlessly that he was currently the mage with the most wins, but there were others that were catching up to him.</p><br/><p>Immediately, Benjamin was hesitant to fight for First place.</p><br/><p>To be honest, he had already achieved his main objective for today. He had exchanged many spells and had made a name for himself. Most important of all, there was not much left of his Spiritual Energy. If he kept on fighting, he might end up in a rather embarrassing situation. This would ruin the name that he built with his ten consecutive wins.</p><br/><p>Magic Potions for half price for half a year seemed nice, but from what he understood from the other mages, this offer had a limit on what you can buy in order to prevent reselling with ill intent. Thus, there was no way for Benjamin to earn money through this offer.</p><br/><p>If that was the case, why should he be so desperate to win?</p><br/><p>He would rather leave safely when he still had reserves of Spiritual Energy, so that the others would not know of his true strength.</p><br/><p>Just like this, the more he considered, the more he felt that he should stop. There was no need for him to fight for the First place.</p><br/><p>Just when he was getting ready to leave quietly...</p><br/><p>\"Sir Benjamin, you’re truly incredible. City of Rayleigh had not have such a remarkable mage for a long time.\" A voice was heard right behind of him.</p><br/><p>Benjamin turned around to see Sir Vinci standing behind him. Sir Vinci was smiling at him.</p><br/><p>\"This is nothing much, Sir Vinci. This is all thanks to the opportunity that you have created for everyone to communicate through magic.\" He was not surprised. Instead, he flashed a smile and answered accordingly.</p><br/><p>Since he broke a record, it was simply normal for the master of the villa to be aware of this.</p><br/><p>However, Vinci shook his head and said, \"It’s different. Your magic is totally different from those of the others. Compared to you, others’ magic is like the wheel, while your magic is like the living horses.\"</p><br/><p>Benjamin was somehow being complimented again. Even though he felt like his face was getting tired, he still maintained his smile and continued his social rhetoric. He said, \"Thank you for your compliment.\"</p><br/><p>Vinci gave him a smile and continued to ask. \"You seemed to mention it before. You came to the City of Rayleigh just recently. Then what about before? I am very curious. From which place in this world that such a remarkable mage came from?\"</p><br/><p>Benjamin kept to his story. \"My companions and I came from Icor. We did not want to join the Mage Guild, so we weren’t that happy living there. At last, we ended up coming here.\"</p><br/><p>Vinci nodded and suddenly lowered his voice. \"In that case... you guys secretly crossed over the border without informing the people from the Mage Guild?\"</p><br/><p>At that instant, Benjamin’s heart let out a thump.</p><br/><p>What should come would eventually come. The news in Ferelden were not that close up to the extent that they would not know what criminal there was within the borders of Icor.</p><br/><p>But, with his expression unchanged, Benjamin maintained his friendly smile.</p><br/><p>\"To be absolutely honest, we did have some disagreements with the Mage Guild.\" He also lowered his voice and said, \"In Icor, the influence of the Mage Guild was so large that it could cover up so many things. To the mages who dare to defy them, they would use any means to suppress them. Slandering the mages is only the simplest way of all.\"</p><br/><p>Even if Vinci knew they were listed as wanted in Icor, this was not that much of a big deal.</p><br/><p>In Ferelden, the impression of Mage Guild was not that good to begin with.</p><br/><p>Upon hearing this, Vinci sighed. He said, \"Be at ease. I know what it is like in Icor, so I won’t spread this news. Moreover, they are them and we are us. Even if you killed people and set things on fire, that had nothing to do with us. As long as you do not endanger my people, then our country will still welcome you with both hands.\"</p><br/><p>After listening to this subtle words, Benjamin did not show any strange behavior. Instead, he nodded in gratitude.</p><br/><p>\"Thank you for being so understanding.\"</p><br/><p>Vinci took two more glances at him. All of a sudden, the smile on his face dissolved. He said calmly, \"You are a mage with a bright future ahead of you. I hope that you cherish the gifts that you had. And in the future, you can make contributions for the sake of magic. Do not waste all that you have now.\"</p><br/><p>Benjamin smiled. \"Of course.\"</p><br/><p>Vinci nodded. Just like a game of changing expressions, his calming face showed a smile again. He used a tone that seemed like he was close to Benjamin and said, \"What is this? Are you leaving already? Not going to fight for First place? Do not underestimate my Magic Potion Store. With the half price discount, so many mercenaries cannot get it even if they wanted to so badly.\"</p><br/><p>Benjamin shook his head. \"I have consumed too much of my Spiritual Energy. I feel exhausted now, so I guess I won’t be able to get it.\"</p><br/><p>Upon hearing this, Vinci showed an expression of regret. He patted Benjamin on his shoulder and said, \"Young man, do your best. The future of magic is on your shoulders. Consider carefully of your choice. Do not make any mistakes. There will come a day when you stand at a position way above us all.\"</p><br/><p>Benjamin smiled naturally and waved Sir Vinci goodbye.</p><br/><p>\"Thank you for your advice. I should go now.\"</p><br/><p>After saying this, he turned around and left the backyard under the guidance of the servant. He received fifty coins, went through the corridor and finally left the villa that was located at the outskirts of City of Rayleigh alone.</p><br/><p>In the tranquil night, Benjamin flew in the air. The glorious gathering at his back. The smile on his face, too, dissolved in the whistling wind.</p><br/>\n</div>"}