{"title": "Chapter 285: True and False Testimonies", "id": 285, "volume": 3, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-285-true-and-false-testimonies", "volume_title": "Volume 3", "body": "<h1>Chapter 285: True and False Testimonies</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 285: True and False Testimonies</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>\"What is it?\"</p><br/><p>Hearing these words, despite the ongoing argument and their mutual hatred, both of them couldn't help but turn to look at Benjamin at the same time.</p><br/><p>At least that stopped them from arguing....</p><br/><p>Benjamin sighed and said, \"You should also know that a gang attacked the street. But judging by the way you've been going about with this investigation, I bet you haven't had any luck with finding the gang responsible, nor do you even know what actually happened do you?\"</p><br/><p>The two stared at each other. Lance was silent, and nodded.</p><br/><p>Benjamin went on to say, \"The truth is, the gang that carried out the attack is called 'Eagle', you won't be able to find any of their people. Not because they are all hiding, but because the gang has actually disbanded.\"</p><br/><p>Lance heard this, thought for a while, and said, \"But ... what does this have to do with the cult's plan for a rebellion?\"</p><br/><p>\"Oh, they're tighter than you think,\" Benjamin immediately replied, \"the thugs in the gangs and the members of the cult go way back. While their work may look entirely unrelated, they've actually been allied for a long time now. In fact, this is just one part of a big scheme.\"</p><br/><p>Lance 's face changed slightly, shook his head and said, \"Impossible. We've been keeping an eye on all of these 'cults' this whole time. There is no way they can do anything without us noticing.\"</p><br/><p>Benjamin relentlessly said, \"Just because you have eyeballs on them, it doesn't mean that they can't be plotting anything. Plus, would you dare say your surveillance goes as far as monitoring every move of the gangs?\"</p><br/><p>Suddenly, Lance was silent, he could not think of anything to refute.</p><br/><p>Thugs are like this: you say they are insignificant, but sometimes they band together and become a formidable force, but if you were to pay attention and try regulating them; they are like grease, no matter hard you scrub, you can't clean them completely.</p><br/><p>In fact, the reason their investigation has not progressed at all is because they haven't been able to find any reliable leads from the local thugs.</p><br/><p>\"The Eagle was disbanded on the day of the attack on the streets,\" Mikel suddenly spoke, \"The streets they used to occupy are now occupied by a gang called 'Sparrow'. I have inquired about the gang, the new one has no connection at all with this matter.\"</p><br/><p>Suddenly, Lance showed a surprised expression.</p><br/><p>\"How did you find out about this? Why did you not tell me?\"</p><br/><p>\"Ah, I presumed that since the Knights are so intelligent, something like this should be common knowledge. Hence I didn't see the need to tell you.\"</p><br/><p>\"...\"</p><br/><p>\"Well, we have more important things to look into,\" sensing that the atmosphere was starting to sour, Benjamin quickly said,\"a small cult, secretly allying itself with the thugs, there must be a reason behind it.\"</p><br/><p>He was not surprised to learn of the existence of the \"Sparrow\" gang from Mikel.</p><br/><p>Jessica is a careful person. Ever since \"Eagle\" was disbanded, she didn't push for \"Crow\" to take over the streets. Instead she somehow formed a puppet gang called \"Sparrow\" to maintain indirect control, with plans to merge them back into her control later in time.</p><br/><p>In fact, her tact worked! Mikel didn't even bother looking into the \"Sparrow\" gang.</p><br/><p>\"But if they were really secretly linked, why would the 'Eagle' attack them? Are they not allies?\" Mikel asked again.</p><br/><p>\"Because there's been some discord in between the two groups,\" Benjamin answered.</p><br/><p>A tinge of tension started rising in his heart.</p><br/><p>He was about to put his lying skills to the test.</p><br/><p>\"I am not too sure about the details of it, but I have a rough idea. Apparently after some unpleasant exchange, members of the cult decapitated the leader of the 'Eagle', and then sent his head back to the Eagle's hideout loaded with explosives. The low level thugs had no idea that their leader and the chiefs of the cult were secretly connected, but through some digging, they still guessed who was the culprit. Then voila, you have your fire at the monastery.\"</p><br/><p>The most important thing about lying is to not lie outright. Instead, it is to mix bits of the truth with bits of fantasy to confuse the listener while giving on enough to make it seem believable.</p><br/><p>In reality, he just threw the blame for everything he did with the \"Crow\" to the cult.</p><br/><p>\"There were indeed reports of explosion sounds on the street where the 'Eagle' operates,\" Mikel corroborated Benjamin's words with what little he knew from his own investigation.</p><br/><p>Lance heard this, nodded and said, \"Mr. Mage ... may I take the liberty to ask, how come you seem to know so much?\"</p><br/><p>\"Because when I first arrived at Rayleigh, I crossed some members of the cult,\" Benjamin continued to lie through his teeth, \"If you go to the Mage Freemasonry and ask, you will know that I opened some very dangerous Underground Remains a few days ago. Those particular remains were very important to the cult, and I managed to gain entrance to it by stealing the key from the leader of the 'Eagle'.\"</p><br/><p>\"Underground Remains?\"</p><br/><p>Suddenly, Lance fell into deep thought.</p><br/><p>Benjamin could tell from their expressions that the Mages Freemasonry did not make a report to the officials in Ferelden, despite promising to do so previously.</p><br/><p>So what or who is messing everything up in between this?</p><br/><p>The answer was already obvious at this point.</p><br/><p>Benjamin put all of these thoughts at the back of his head and continued, \"In order to explore the remains properly, I made a lot of preparations beforehand. One of these preparations was a thorough investigation of this particular cult. During my investigation, I accidentally discovered the relationship between the 'Eagle' and the cult. I wanted to let the Mages Freemasonry warn you, but it's been too long, so I finally decided to tell you these things in person in hopes that this information could be of some help to your investigation.\"</p><br/><p>Lance sighed and seemed to be upset, but still smiled and said, \"Thank you very much, this does really help.\"</p><br/><p>Benjamin nodded, and said earnestly, \"After all, as a Mage, I do not want Ferelden to eventually suffer the same fate as the holy kingdom. This is the only thing I can do.\"</p><br/><p>Mikel also smiled and said, \"Your Excellency is so thoughtful, we thank you for your sincerity on behalf of His Majesty.\"</p><br/><p>After some thought, Benjamin added, \"The reason why I believe they're planning a rebellion is because I saw some horrible things inside the Underground Remains. If you don't believe me you can ask the folks at the Mages Freemasonry, they'll tell you how terrifying those Underground Remains are.\"</p><br/><p>Upon hearing this, Lance patted Benjamin 's shoulders, stood up from the chair and said, \"Thank you very much for your help, I think I got the information I needed.\"</p><br/><p>Benjamin also stood up, \"Well, I have no more news to tell you.\"</p><br/><p>Well, that was all about it, he's probably going to leave.</p><br/><p>As for whether these two men would believe him...it goes without saying that they would definitely to see some proof before taking Benjamin's word for it. Heck, they couldn't just go out there and destroy a cult just because of what they heard from Benjamin right?</p><br/><p>They needed substantive evidence.</p><br/><p>Therefore, Benjamin's work was not over yet.</p><br/><p>He had the rest figured out — he would let these two men \"investigate the truth\" along Benjamin's narrative. No matter how much he said, they would only completely fall for it if they believed they \"investigated the truth\" by themselves.</p><br/><p>As for the evidence, the cult has always looked fishy, they'll give themselves away somehow. If the two men could not find anything, Benjamin did not mind motivating them with some fabricated \"evidence\".</p><br/><p>In short, he wanted this cult dead, no matter what.</p><br/><p>\"If you need any help, you can come to me. I believe you know how to find me.\" He then said, \"I would love to stay longer, but I still have meditation exercises to do, so I must make a move.\"</p><br/><p>\"I'll walk you out,\" said Mikel, smiling.</p><br/><p>Benjamin simply nodded his head.</p><br/><p>Lance smiled at Benjamin as a farewell gesture, his hands were planted on the table, as if he was dwelling into a deep thought.</p><br/><p>Just like that, Benjamin and Mikel left the basement. On his way out, Benjamin treated one of the soldier's twisted waist with the Waterball of healing, inevitably attracting a burst of exclamations.</p><br/><p>Finally, Mikel sent him to the door, the two warmly bid farewell as Benjamin turned and left the place.</p><br/>\n</div>"}