{"title": "Chapter 282: Quick, Arrest Me!", "id": 282, "volume": 3, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-282-quick-arrest-me", "volume_title": "Volume 3", "body": "<h1>Chapter 282: Quick, Arrest Me!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 282: Quick, Arrest Me!</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>3 days later, the boss lady held the finished Hurricane Cape in her hands as she delivered it to Benjamin for his judgment.</p><br/><p>The soft silver-white fur flowed with a subtle beauty, while the feathers of the ravens, dark as night, decorated the upper part of the cape as they formed shapes akin to clouds. Inside, a weird, slightly flawed half-circle was sewn in with brown thread.</p><br/><p>Benjamin’s face was colored with a pleasant surprise when he felt a tiny breeze surrounding him even if he only held it in his hand. It was all thanks to the boss lady’s expert hands that their first attempt at producing a magical instrument went without any mishaps. They managed to prevent themselves from wasting an unknown amount of materials and even managed to end up with an end product of such high quality.</p><br/><p>Identical magical instruments will possess different capabilities depending on the production quality and handiwork. As stated on the fabrication drawings, a Cape that could cause a natural breeze around it is one that is of great quality. If it was worn by a mage, the power and impact of any Wind Magic will increase exponentially.</p><br/><p>The boss lady indeed has a bright future in this field for her to reach this high of a standard with her first try!</p><br/><p>Benjamin considered for a moment before he handed the Hurricane Cape back to the boss lady.</p><br/><p>\"Here, take it. This is our first finished product, you could wear it for yourself or keep it as a token. If you want to sell it, it’s best if you wait for some time to pass. Basically, this thing is yours now.\"</p><br/><p>\"What about you?\" The boss lady enquired in surprise, still holding the cape.</p><br/><p>Benjamin shrugged, \"It’s not like I don’t want it, but I’m not a Wind Magic user. Besides, it was your hard work for the past few days. Hold on to it!\"</p><br/><p>Although they were like a family already, he could never hog the benefits all to himself; after all, producing the magical instruments took up her own cultivation time. Capitalists would pay minimum wage to the people they were exploiting, and Benjamin refused to stoop lower than them.</p><br/><p>The boss lady nodded happily, \"Alright, I’ll keep it then!\"</p><br/><p>Benjamin smiled as he continued, \"Also, I gave some thought on the matter of getting you some helpers. These fabrications drawings are confidential documents that should never be leaked. Thus, I made a deal with a textile workshop nearby, and they were willing to help in making intermediate goods. Subsequently, you could pass them odd jobs that a non-mage can do, and their pay could be directly deducted from my account. They would only help you with the intermediate goods. The whole production process would still be in our hands.\"</p><br/><p>The boss lady considered for a moment, \"That should work. Which textile workshop do you mean?\"</p><br/><p>Benjamin told her the address and contact, and she nodded before she left excitedly with the cape in hand.</p><br/><p>\"Huh…. The production of magical instruments are finally up on track,\" Benjamin sighed and stretched as he shut the door behind the boss lady, who retreated to her room. Although nothing major happened in the past three days, menial chores such as purchasing raw materials, negotiating with the owner of the textile workshop, ordering Varys to prepare an account for this, and scouting out the magical instrument market here in Ferelden, still took up most of his time. He nearly had no time at all to deal with the cult and investigate Mage Vinci.</p><br/><p>Speaking of it, the seed he planted in the Mage Association should have already sprouted, right?</p><br/><p>Thus, Benjamin sneaked out the next morning after a whole day of rest and headed towards the streets where the ‘Rabkauhalla’ Cult was located.</p><br/><p>These streets were indeed much more deserted than they were when he last visited. The strange temple where he previously pretended to listen to the talk now looked black and barren, the signs of flames yet to be recovered. Even the shop where Benjamin had a bowl of beef.noodle was affected; it was no longer open for business.</p><br/><p>It looks pretty pathetic, but Benjamin had no choice - his aim was not sympathizing them, but to rid them forever. He walked the streets while he sensed the surrounding, indoors and outdoors, using the Water Elements. However, when he walked past one door and another, he realized that these people with a small round hat were living quite heartily. They were only living behind closed doors and keeping it down low, but aside from that, the beef and mutton that they sacrificed at the praying mantle of their homes did not even decrease in amount.</p><br/><p>Benjamin frowned at this. He has warned the Mage Freemasonry but 4 days have passed since then, did the mages or the military not do anything to solve this problem?</p><br/><p>Now, this is beyond strange…..</p><br/><p>Just as he was deliberating whether anything happened in between these events, some soldiers suddenly walked over and stopped Benjamin in his tracks.</p><br/><p>\"Who are you? What are you doing here?\" Benjamin was stunned stupid by the interrogating tone of the soldier.</p><br/><p>Wait…..</p><br/><p>As if he was struck by a thought, he did not answer the question, but instead asked them, \"Uh, I’m sorry, but are you the soldiers that were tasked to investigate the area due to the previous attack that happened here?\"</p><br/><p>The soldiers exchanged glances, their expressions odd.</p><br/><p>\"Hey! I’m asking you a question here, why are you asking us another question instead of answering?\" A soldier barked as he scowled fiercely, \"Who exactly are you? What purpose do you have in coming here? Answer quickly, or we’ll arrest you like a criminal!\"</p><br/><p>Sadly, Benjamin looked delighted than he was afraid after he heard the soldier’s threats.</p><br/><p>\"You’re really the people who were sent to investigate this matter!\" He tugged at the arm of the soldier as he continued excitedly, \"Who’s your officer in command? I want to see him. I have a very important message to tell him.\"</p><br/><p>The soldiers stood dumbly in place.</p><br/><p>\"You….. you…..\"</p><br/><p>\"Who’s your officer in command? Who’s in charge of this?\" Benjamin demanded.</p><br/><p>\"It’s…. It’s Sir Lance, the Head of Knights.\"</p><br/><p>\"Bring me to him.\"</p><br/><p>\"You…. No, what are you planning to do?\" The soldiers finally snapped back into reality as they stared at Benjamin in disbelief, \"Why do we need to listen to your commands? Who the heck are you to demand a meeting with the Head of Knights at your whims?\"</p><br/><p>Benjamin was troubled after he heard that. How could he ensure that the official authorities in Ferelden would not let the cult off the hook without meeting those in the upper part of the organization?</p><br/><p>After some thoughts, he declared, \"How about this. You feel that I’m very suspicious, right? Here, arrest me for an interrogation; I have so many inside information about this, and as long as your officer is here, I will be willing to tell him everything. Quick, arrest me!\"</p><br/><p>\"...\" The few soldiers felt like they were dreaming.</p><br/><p>\"Have you gone insane?\"</p><br/><p>\"No, I haven’t. See, I’m so suspicious, why are you not arresting me yet?\"</p><br/><p>\"He’s crazy….\" The soldiers shook their heads and turned to leave, their faces as long as horses.</p><br/><p>\"Hey, don’t leave!</p><br/><p>\"Don’t come near us! We’ll arrest you if you do!\"</p><br/><p>\"Arrest me then!\"</p><br/><p>\"A madman! Quick, let’s go, don’t bother him any longer.\"</p><br/><p>Benjamin had no choice. He chased them and shot his leg out to kick a soldier hard on his bottom. He exerted a huge force on his assault that the soldier shouted and lost his balance, falling face first onto the floor.</p><br/><p>\"...\" The other soldiers turned to face Benjamin. They looked as if they became insane.</p><br/><p>\"What sins have they committed in their past lives for them to meet such a crazy man like you in this lifetime?\" The System suddenly sighed, its voice filled with sympathy.</p><br/><p>Benjamin ignored it. In the real world, he shrugged and said helplessly to the soldiers, \"I’m terribly sorry, and I hope I did not hurt you bad. But….. At least you now have a legitimate reason to arrest me, right?\"</p><br/>\n</div>"}