{"title": "Chapter 299: Elemental Black Hole", "id": 299, "volume": 3, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-299-elemental-black-hole", "volume_title": "Volume 3", "body": "<h1>Chapter 299: Elemental Black Hole</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 299: Elemental Black Hole</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>The old man turned around. He stared at Benjamin. \"You...Who are you?\"</p><br/><p>Benjamin shrugged, \"I am God.\"</p><br/><p>The old man snorted and seemed to be slightly infuriated. He reached out and launched an invisible attack on him the same way he did to Lance.</p><br/><p>The feedback from the Water Particles was extremely blurry. Therefore, out of caution, Benjamin did not take it head-on. Instead, he agilely moved away and dodged the attack.</p><br/><p>Immediately, the old man’s expression became more uncertain.</p><br/><p>He waved at the ground. His previously amputated left arm flew back up to him. Then, it slowly re-attached itself to the stub.</p><br/><p>After a bit of wiggling and some grumbling, the old man’s arm was once again re-attached. He clenched his fist and stretched his arm for a bit. It seemed that, to him, everything was fine.</p><br/><p>Upon seeing this, Benjamin was no longer as relaxed as before.</p><br/><p>He couldn’t believe it. It seemed that the immortality of the Zombie Bull had also been inherited by this guy. Benjamin still could not think of a solution to deal with the situation right now.</p><br/><p>The Zombie Bull was immortal because there was a never-ending supply of green light in its surroundings. Once it was isolated from the green light, it was easily dealt with. But for the guy in front of him, where in the world did he get his green light energy from?</p><br/><p>Was it the circle of light above his head?</p><br/><p>Benjamin tried using the Water Particles to detect the circle of light as well as the words floating by the side of the old man. However, his detection could not even get close to his opponent. He had no idea what was going on.</p><br/><p>Fine. His detection could not get close to that person, but... getting close to other things was still possible.</p><br/><p>Let’s give it a try.</p><br/><p>Upon thinking this, Benjamin removed all the weird adornments on him. Only the Moonglaive of Ice was left. He controlled the Moonglaive to head straight for the circle of green light above the old man’s head just like a meteor.</p><br/><p>The old man did nothing. He simply gazed coldly at the Moonglaive that came for him.</p><br/><p>Swish!</p><br/><p>The Moonglaive slashed above his head, almost cutting his small round hat. However, even though the circle of green light should have been cut clean in half, nothing happened to it. It still hovered above the old man’s head, safe and sound.</p><br/><p>Benjamin frowned.</p><br/><p>It seemed that the circle of green light was not his weakness.</p><br/><p>However, as he was prepared to retrieve his Moonglaive, the old man reached out his hands and pointed at the Moonglaive that was spinning in midair.</p><br/><p>Suddenly, that invisible energy surged once again. Like those intertwined vines, it trapped the Moonglaive in midair, not allowing Benjamin to retrieve it.</p><br/><p>\"You kid… You are weird.\" The old man looked at Benjamin with a rather serious expression.</p><br/><p>Benjamin could not understand what the old man meant by ‘weird’.</p><br/><p>However, the Moonglaive was trapped by that mysterious energy now. Try as he might, the Moonglaive could break free of the energy. This made him take the invisible energy more seriously now.</p><br/><p>He could not let himself get caught by this energy.</p><br/><p>\"Enough. I have trapped your weapon. Quickly tell me...\" The old man suddenly spoke, slightly irritated. But his words were interrupted by Benjamin’s next move.</p><br/><p>Benjamin totally gave up control of the Moonglaive of Ice.</p><br/><p>The Moonglaive lost control and turned back into steam, evaporating into nothingness. Benjamin then chanted another incantation. Along with a wave of disturbances, he once again summoned a Moonglaive of Ice in front of him.</p><br/><p>\"Excuse me, you are mistaken. That was not my weapon.\" Benjamin shrugged smugly.</p><br/><p>Mikel and the soldiers who were staying in the corner almost laughed.</p><br/><p>The old man’s expression turned very dark.</p><br/><p>As he was about to speak, Lance appeared behind him, holding a long sword in his hand. He had been slowly sneaking up on the old man since don’t-know-when.</p><br/><p>Suddenly, he slashed downward and cut the old man down the middle straight in half.</p><br/><p>\"If you have anything else to say, say it when you reach hell.\" He brushed his nose in a cheeky manner.</p><br/><p>\"...\"</p><br/><p>Benjamin facepalmed.</p><br/><p>Did Lance really have to try to act cool?</p><br/><p>But, he was not that naïve.</p><br/><p>The old man that was slashed into halves still floated in mid-air and did not land. Instead, his two halves flashed an exceptionally gruesome smile. Upon seeing this, Benjamin quickly shouted a warning at Lance, \"Be careful. He’s not dead yet!\"</p><br/><p>Upon hearing this, Lance did not even try to turn around. He rolled away on the ground in a panic, dodging another invisible attack right at the last second.</p><br/><p>After that, he ran a few feet away. He stared at the old man that was still hovering in the air with a disturbed expression. \"What in the world is this guy?\"</p><br/><p>Benjamin shook his head. \"I don’t know.\"</p><br/><p>If he knew what this old man was, he would have already dealt with him. Did he need to ask stupid questions now?</p><br/><p>When the old man was cut into two, a lot of his internal organs had come out of his body. His whole being bobbed up and down as if in a state of weightlessness. The old man’s terrifying face started to weirdly chuckle.</p><br/><p>Right now, the old man did not have any traits that even remotely resembled that of God. Instead, he seemed like the Devil himself that had crept up from the depths of hell. Under the dark sky and whining wind, he looked like he was straight out of a horror movie..</p><br/><p>\"Such an interesting mage.\" His separated lips moved in unison, \"I don’t know why your magic did not dissipate. But, I will drag the answer from your cold, dead body.\"</p><br/><p>A sense of danger surged through Benjamin’s heart.</p><br/><p>From the blurry feedback of the Water Particle, he could feel that the old man’s body suddenly release a huge amount of invisible energy. This energy was compacted into many small balls which were then aimed in Benjamin’s direction.</p><br/><p>Even though he did not know what those small balls were, he did not dare to get hit.</p><br/><p>Benjamin quickly backed away and summoned all kinds of shield in front of him. The Moonglaive that encircled him was also directed to try to stop the attacks of the small balls.</p><br/><p>He could only say that he was fortunate to be able to detect the attacks of his opponent. Or else, fighting with something that he could not even see would put him at a considerable disadvantage.</p><br/><p>Under his control, the Moonglaive soon collided with the first wave of small energy balls. Benjamin suddenly felt that there was a wave of strange disturbances in the area. Whilst experiencing these disturbances, Benjamin’s expression changed. He immediately detonated the Moonglaive and let it turn into ice bits, scattering all over the place.</p><br/><p>In the instant the Moonglaive exploded, the small energy ball exploded as well.</p><br/><p>Boom!</p><br/><p>Even though in reality, there was no sound, but a solid thump was heard in everyone’s hearts. Those who hid in the house were caught off guard. They were convulsed so badly that they fell all over the place. Some coughed up blood and others even lost consciousness.</p><br/><p>As for Benjamin, his Spiritual Energy was more exceptional than normal people, so he did not take that much damage. But this situation was more strange and unpredictable than anything he had ever experienced before.</p><br/><p>Ignoring the thumping at the Spiritual level, he still did not know how the explosion had occurred. But what he could feel was that the small energy ball had created an elemental black hole. He could not detect even a little bit of elemental energy in the area at which the Moonglaive had collided with it. It was as if the area had been completely cleared of everything.</p><br/><p>The shock and ice bits that were produced during the detonation of the Moonglaive just now had all disappeared without a trace.</p><br/><p>This was a result that he had not foreseen.</p><br/><p>What just happened?</p><br/><p>This was truly some Heaven-subduing Magic!</p><br/><p>The elements were truly a magnificent thing. The mages could control them freely and use them to form magical spells. But they also kept to their own rules at all times. When magic dissipated, it went back to its elemental form. It neither increases nor decreases. He had never heard of anyone who could destroy elements.</p><br/><p>And yet, Benjamin had just witnessed it happen with his own two eyes.</p><br/><p>Benjamin bit his tongue.</p><br/><p>Was this the reason why magic would lose in Another World?</p><br/><p>But, he had no time to think about it in detail.</p><br/><p>The Moonglaive cancelled out one of the small balls, but there were still more than ten balls in the air. With their slow floating speed, they were still flying towards him.</p><br/><p>After what had just happened, the Ice Walls and Water Shields in front of him now seemed like paper.</p><br/><p>Immediately, Benjamin’s hair began to stand on end.</p><br/><p>This thing… no way in hell he could take this attack!</p><br/>\n</div>"}