{"title": "Chapter 291: Treatment or Exorcism?", "id": 291, "volume": 3, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-291-treatment-or-exorcism", "volume_title": "Volume 3", "body": "<h1>Chapter 291: Treatment or Exorcism?</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 291: Treatment or Exorcism?</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Normally the Waterball of Healing or Water of Life type of magic would be absorbed into the body through bodily contact for healing to take place.</p><br/><p>However, this was not the case for Jessica. That was why Benjamin intended to administer it orally.</p><br/><p>The problem was that she was in an odd state. Water that was poured into her mouth would resurface itself and couldn’t be swallowed. It seemed as though after the invasion of the green energy, it also applied a barrier on her.</p><br/><p>It looked like he needed to get rough then.</p><br/><p>Benjamin signaled Bernard.</p><br/><p>Bernard was stunned.</p><br/><p>\"Sir Mage... Is there really a need to?\"</p><br/><p>Benjamin, like a numb veteran surgeon, nodded expressionlessly.</p><br/><p>Bernard then stepped forward and bowed at the unconscious Jessica while mumbling words such as \"Please do not blame me\", \"It’s all to save you,\" before using his arm to lift Jessica’s head and gripped her cheeks to pry open her mouth.</p><br/><p>Benjamin was standing besides him, pouring some healing water into her mouth.</p><br/><p>After the water was poured in, she started to throw the water up, either instinctively or due to the green energy.</p><br/><p>He then lifted Jessica up, and shook her up and down like shaking gas out of a can of coke.</p><br/><p>— Although Bernard was lean, he has been on the streets for a long time and so, he is quite strong. Jessica was shaken like a sieve.</p><br/><p>\"Gaggle gaggle...\"</p><br/><p>A series of odd noises, almost as if someone was drowning was heard. Benjamin couldn’t bear to watch any further and turned his head away and covered his eyes, holding back his laughter.</p><br/><p>After shaking for more than ten seconds.</p><br/><p>Bernard put Jessica down, released her chin and watched her anxiously.</p><br/><p>Alright, she finally swallowed the water.</p><br/><p>Benjamin activated his Water Elemental sensing technique to observe her current state. The water elements started to become unstable around her, scattering and gathering, as if battling within her body.</p><br/><p>Benjamin nodded with satisfaction.</p><br/><p>\"That didn’t look half bad, it worked.\" He patted Bernard on his shoulder, \"Now continue on.\"</p><br/><p>Bernard took a deep breath and extended his now trembling arms once again to pry open Jessica’s mouth to cooperate with Benjamin who continued to dunk more water into her mouth...</p><br/><p>The way they were treating her was causing a huge commotion.</p><br/><p>There were a few Crow members on night duty that were startled. With disbelief they looked at one another as they stood outside the room, hearing the noises.</p><br/><p>\"What’s... going on... inside...?\"</p><br/><p>Half an hour later.</p><br/><p>\"That should do it, she’s okay now. She’ll wake up in a bit.\"</p><br/><p>After repeating the water dunking and shaking seven to eight times, Jessica opened her mouth and green gas escaped out like a sparrow flying about and almost crashed into Bernard.</p><br/><p>Benjamin quickly took out a goat skin scroll.</p><br/><p>Once the scroll appeared, it was as though the green gas received an order to turn back and headed for Benjamin. In the end, the energy was absorbed into the scroll.</p><br/><p>Both of them were relieved at this sight. Benjamin went over to check on Jessica’s status and announced the treatment a success like a doctor at the end of a surgery.</p><br/><p>\"Fu...\" Bernard let out a relieved smile and bowed at Benjamin, \"Thank you Sir Mage! Thank you very much!\"</p><br/><p>Benjamin waved off with his arms, \"No need.\"</p><br/><p>Bernard continued to express his gratitude but stopped short and his facial changed, \"Right, about that... Sir Mage, you’re not going to tell the boss how we saved her right?\"</p><br/><p>\"Of course not.\"</p><br/><p>Bernard let out a sigh of relief, \"That’s great, I still would like to live a few more years.\"</p><br/><p>Benjamin shrugged.</p><br/><p>It was better to leave such talk when the deed was completely done.</p><br/><p>It still wasn’t time to relax yet,</p><br/><p>Didn’t Bernard say so himself? There were a few others that fainted. They couldn’t just treat just one, they had to treat them all one by one.</p><br/><p>Seeing that barging green gas raised more red flags of the cult in Benjamin. Nobody would know what would happen next if the rest was not saved from this odd green gas.</p><br/><p>Would they die, continue to stay unconscious or turn to become controlled zombies?</p><br/><p>In order to maintain world peace and prevent the endangerment of living beings, they would be busy tonight.</p><br/><p>The two left the room and went forth to other patients’ rooms. The night duty gang looked at them funny as they passed the corridor but Benjamin couldn’t be bothered by this little detail.</p><br/><p>The night at the City of Rayleigh, deepened in the somber mist.</p><br/><p>There were still three that remained unconscious. The two familiarized themselves with the tasks and finally completed the treatment after around one hour.</p><br/><p>The helter-skelter green gas obediently returned to the scroll. Strangely, the scroll remained unchanged, old and unappealing.</p><br/><p>Benjamin had to cover it with ice to contain it.</p><br/><p>This thing was too peculiar, like a ticking time bomb. Nobody could predict its ability. One day, he would get rid of this thing completely.</p><br/><p>\"I think there shouldn’t be anyone else that touched the scroll anymore.\" He patted Bernard on the shoulder, \"It’s getting late. I better make a move.\"</p><br/><p>Bernard stopped Benjamin, \"Sir Mage, it’s better to stay the night and return tomorrow. It’s unsafe for the past two days as many soldiers appeared late at three or four o'clock.\"</p><br/><p>Soldiers?</p><br/><p>Benjamin turned to look out the window.</p><br/><p>The streets were empty in the night, without a creak.</p><br/><p>He summoned his water element sensing technique to scour the area and he had gotten more feedback than he’d imagine.</p><br/><p>In the houses, the gap between buildings, rooftops... there were around ten guys in army gear in all these hidden places. They were cautiously searching here and there like polices on a stakeout.</p><br/><p>Benjamin was shocked.</p><br/><p>Were these... Lance’s men?</p><br/><p>Why were they stationed here?</p><br/><p>After a momentary silence, he spoke with great solemn, \"When did this soldiers appear and what’s the range of their stakeout?\"</p><br/><p>Bernard answered, \"From yesterday night. The coverage’s pretty huge. It’s not just our gang, it has affected the streets of other gangs around. They took many of our men last night and have yet to release them.\"</p><br/><p>Hearing these words, Benjamin instead let out a sigh of relief.</p><br/><p>Well, it didn’t look like they were after him.</p><br/><p>When he gotten news that Lance was eyeing a few of the Crows’ streets, he thought that his relationship with them was exposed. He initially thought that Lance was suspicious of him was the reason there was a stakeout here.</p><br/><p>If they were covering such range of the grounds, it would meant that Lance did not manage to find anything and was looking for clues.</p><br/><p>It was great that nothing was found...</p><br/><p>Benjamin quickly regained a clear head.</p><br/><p>It was obviously that Lance did not completely believe Benjamin’s statement. Therefore, he did not target any specific cults but rather searching for clues with the gangs.</p><br/><p>He initially thought that this lord knight was easy to be tricked. It seemed now that his framing plan was prescient.</p><br/><p>\"Right. It is unwise to leave in such circumstances.\" He nodded, \"Do you have any vacant rooms? Just for a night.\"</p><br/><p>Bernard quickly nodded, \"Yes we do, please come with me, Sir Mage.\"</p><br/><p>In order to keep his relationship with the Crows under wraps, Benjamin had to stay at their hideout for a night.</p><br/>\n</div>"}