{"title": "Chapter 304: Training New People", "id": 304, "volume": 4, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-304-training-new-people", "volume_title": "Volume 4", "body": "<h1>Chapter 304: Training New People</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 304: Training New People</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>His…...influence?</p><br/><p>Benjamin could not help but frown, feeling as if it was strange.</p><br/><p>From when did he have \"influence\" still under his command?</p><br/><p>\"I…...I don’t get you.\" After some thought, he carefully said.\" If the lot of you want to join a mercenary band, I have to test your capabilities to make a decision.\"</p><br/><p>Tony shook his head, saying:\" No, you don’t have a mercenary band do you? We heard that you can create your own potions, and have made a long term contract with some of the shops in town, at the same time, you have your own farm for materials. Maybe you haven’t realized it, but this is the starting phase of a mage having influence.\"</p><br/><p>Benjamin heard this and smiled: \"You flatter me.\"</p><br/><p>That is right, it did have a feel of influence to it, but in truth, he did not want the outside world to think that he had the ambition to expand his influence. If not, he would definitely be pressured by other sources.</p><br/><p>A group of mages settling down at Rayleigh, relying on each other to make a living-----at least this was how Benjamin saw themselves as.</p><br/><p>Plus, if he wanted to add new people to the group, he had to be careful in the process. If not, if there were people with ulterior motives joining, the young saplings they were would probably be destroyed in this complicated city.</p><br/><p>\"Why do you all want to join us?\" Thus, he asked.</p><br/><p>\"Sir Benjamin, maybe you don’t understand why we want to do this, but, the Mages Freemasonry really isn’t a place for one to improve.\" Tony looked at him earnestly and said,\" But you all are different, you are not locals from Ferelden, you have the willpower different than those other people. Maybe some of them just want a monotonous life, but we have yet to be as old as that, we still hope we can achieve something.\"</p><br/><p>Benjamin heard this and nodded.</p><br/><p>He had to agree that this speech about \"ambition\" was admirable.</p><br/><p>But, just having dreams was not enough.</p><br/><p>\"Introduce yourselves.\" He suddenly felt that he was like a customs officer, with a smile, he slowly said,\" What can you all provide for us?\"</p><br/><p>This was reasonable, the three did not object.</p><br/><p>Tony spoke first, and said: \"Even though I only worked on stuff like managing books and research, but, I am a battlemage, my specialty is water magic, under extreme circumstances I can use high leveled magic. Thus, I have been observing your battle in the ruins, and I really admire your level of power.\"</p><br/><p>…...High level magic.</p><br/><p>Benjamin raised his eyebrow.</p><br/><p>Even though these three ran for their lives when the zombie cow appeared, he may have underestimated them a little. But, being able to use high level magic had earned him brownie points.</p><br/><p>Thinking of this, the turned his gaze towards the other two.</p><br/><p>\"I am Leto, I…..am not really good at battle, and don’t have much talent on making potions. But, I have been researching on potion theory a lot, I even have my own recipe, I should be able to help you out.\"</p><br/><p>A theoretical type? Benjamin nodded without expression.</p><br/><p>\"How about you?\" He looked at the girl.</p><br/><p>\"Hello, I am Linda, I am a battlemage as well. I specialize in fire and wind magic, I may not be able to compare to Tony in power levels, but I am still rather strong, you can have faith in me.\"</p><br/><p>A confident type?</p><br/><p>Benjamin shrugged.</p><br/><p>Actually, no matter what their capabilities were, he could slowly train them, what was most important was if they could integrate themselves and find their own place in the group. If not, no matter how strong they were, they would not stay for long.</p><br/><p>As for the three in front of him...</p><br/><p>After some thought, he spoke: \"How about this, I will give you positions first. You two that think you can fight, you can join the mercenary side for a while to see how you feel about it. As for you, you can join the potion mages and work with them for some time. We will maintain this for a month to see if you lot will get used to it. We’ll make an official decision after a month, alright?\"</p><br/><p>Those that worked needed three months of probation, working for him only needed one, efficient is it not?</p><br/><p>Of course, maybe they have yet to work in these sort of environments, the three seemed to be flustered and looked at each other, not saying anything.</p><br/><p>Benjamin saw this and added:\" Of course, the missions and potions you make during this month will be paid in equal with money, I will not let you all work for free. As for how much, that depends on your abilities.\"</p><br/><p>In the mage group, everyone had pretty good relations, they are even being supported by Benjamin, with curse books that were given free access to, they did not really need money. If new people were to join, they would definitely not agree to such terms, using money as a replacement was something he had to try.</p><br/><p>Benjamin was not experienced with this, he could only learn from the stuff he seen and slowly experiment with it.</p><br/><p>As for the other side, the three did not really understand the whole thing, but they nodded still as soon as they heard about the salary.</p><br/><p>With this, the interview ended, Benjamin brought them to see both the person in charge of mercenary group and the potion makers respectively, and gave instructions to the both of them...</p><br/><p>When they heard about the new companions, they did not think as much as Benjamin did, the both them were really happy. If there were more mages that joined on mercenary missions, their type of missions would also increase. The potion mages were even happier------they had to rely on beginner books all this while and only knew a few recipes, they have yet to learn anything on the theory of potion making!</p><br/><p>Of course, for the accommodations of these three, Benjamin has yet to allow them to join in. Thus, they still stayed in their own respective homes.</p><br/><p>They were not unsatisfied, but they seemed to prefer it that way instead. In reality, most mages did not need to rely on things like that. Mages have always been free-spirited people, them ending up together with Benjamin like this was rare.</p><br/><p>Thus, after making all of the arrangements, Benjamin smiled and showed them out.</p><br/><p>He stood at the door and let out a sigh of relief.</p><br/><p>Not knowing why, it felt like he just registered himself as a company under \"Benjamin’s Magic Pvt. Ltd.\".</p><br/><p>\"Teacher, will more and more people join us in the future?\" Varys walked over and looked at the backs of the three walking away, and asked.</p><br/><p>\"Perhaps.\" Benjamin smiled,\" Why? Do you think this is a good thing or a bad thing? If there were indeed more people, would everyone think that this warm place of refuge change for the worse?\"</p><br/><p>\"You think too much, we can adapt well.\" Varys shook his head and patted Benjamin on his shoulder, saying,\" Don’t forget how we all came here. No matter what sort of decision you make, we will have your back.\"</p><br/><p>\"Thanks.\" Benjamin smiled.</p><br/><p>He has never been a leader before, and he did not know whether he had the talent to be one, but he ended up here today, maybe it was his talent finally showing, but he would still feel worried once in a while. He would worry about the decisions he made, whether they were right or wrong, thinking that if he made a mistake, he would plunge to the depths.</p><br/><p>But…...with those words, with these people, he gained extra courage, he could still make decisions without hesitating.</p><br/><p>Whether they were right or wrong.</p><br/>\n</div>"}