{"title": "Chapter 328: Finishing Off in One Go", "id": 328, "volume": 4, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-328-finishing-off-in-one-go", "volume_title": "Volume 4", "body": "<h1>Chapter 328: Finishing Off in One Go</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 328: Finishing Off in One Go</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Benjamin quickly signaled at his mercenaries who were still digging.</p><br/><p>\"Stop digging. There’s a situation.\" He was stern, \"Another group of people will probably arrive soon, we need to take care of the first.\"</p><br/><p>Benjamin had murdered the drunk guard that had wandered over to relieve himself thinking that it would be a quick and easy dispatch. He didn’t think his death would complicate things.</p><br/><p>But if the rich merchants were crying out to get their things back. Pretty soon, it wouldn't just be a few bodyguards bumping into their gas barrier - it would be the whole damn party.</p><br/><p>Therefore, Benjamin had to strike first to gain the upper hand.</p><br/><p>They should attack first to catch them off guard. They would have to leave the cleaning up for later.</p><br/><p>The mercenaries received their new orders and put down their shovels. They were cheering with excitement. It seemed they preferred slaughter over manual labor.</p><br/><p>They quickly assassinated the guards that were conducting the search. Then, they huddled together near the team’s location.</p><br/><p>As they moved closer, Benjamin’s face started to change.</p><br/><p>Through his water element sensing technique, he could clearly see that the social gathering was not of one team but four.</p><br/><p>He wasn’t sure of the purpose but all of the merchants and guards that had entered the woods earlier were now gathered together.</p><br/><p>The remaining four mages were seated together, having barbecue whilst talking.</p><br/><p>Benjamin’s heart thumped heavily.</p><br/><p>This was troublesome.</p><br/><p>With the four teams gathered together, the numbers of opponents were now in the hundreds. They gathered like the nomadic clan, with tents fixed in a big group. This made it hard for Benjamin to make a move.</p><br/><p>It was possible for a few people to go against tens but unheard of for a victory against hundreds.</p><br/><p>Not to mention they had a few mages.</p><br/><p>\"Hey! Where’s that rat? If I don't get my chalice back, it will be the end of you all.\" A reprimanding voice could be heard from afar.</p><br/><p>Benjamin took a deep breath.</p><br/><p>Yeah, big trouble.</p><br/><p>Time was of the essence. He suddenly closed his eyes and entered the space of consciousness. The Icebreaking spell was summoned continuously, followed by more chanting. The water elements swirled around, and countless ice cubes started to appear in the pitch dark space.</p><br/><p>Eventually, the cubes started to pile up... Benjamin’s capabilities had improved significantly considering the sheer number of ice cubes he could summon.</p><br/><p>However, even after seeing the little ice mountain pile up, he still shook his head.</p><br/><p>It was still not enough. If he wanted to trap a few hundred people here, he needed much more</p><br/><p>He started focusing his energy intently. He summoned more ice cubes while compressing and strengthening the ones that were already summoned.</p><br/><p>Meanwhile in reality, the mercenaries stared at a motionless Benjamin.</p><br/><p>\"This... Sir, do we still go ahead?\" One of the mercenaries couldn’t help but whisper.</p><br/><p>Benjamin did not respond.</p><br/><p>The mercenaries looked at one another.</p><br/><p>Not far from them, the \"missing chalice\" incident was escalating. The merchant continued to reprimand, getting another batch of people to search for the guard who took the chalice.</p><br/><p>If they were to continue in that direction, they would soon discover the truth.</p><br/><p>\"What should we do?\" Mercenary Edmund took another glance at Benjamin then at his companions, \"Why not... we sneak over and kill off the newly dispatched group?\"</p><br/><p>The way he saw it, if this group of people was taken care of, it would buy them more time.</p><br/><p>Benjamin still had his eyes shut, without any reaction. The other mercenaries saw this and nodded in agreement to the plan.</p><br/><p>\"Would six of us be enough?\" Edmund continued, \"Two of us should remain here to guard over sir and wait for his instructions.\"</p><br/><p>The other mercenaries nodded.</p><br/><p>They had just finalized the plan and were about to act when they were cut short by a voice.</p><br/><p>\"You need not bother about them.\"</p><br/><p>Benjamin opened his eyes and looked at the mercenaries. Although he had entered the space of consciousness, the System still reported what was happening in the real world to him.</p><br/><p>Benjamin was quite satisfied with the mercenaries’ response to the situation.</p><br/><p>However, it was unnecessary right now.</p><br/><p>\"You will be bait once again. Take this chalice and lure those in the base camp.\" Benjamin took out a lavishly ornamented crystal chalice and handed it over to Edmund.</p><br/><p>This was the glass he had looted from the drunk guard…</p><br/><p>Edmund was dumbfounded. He was unable to read Benjamin’s intention, but still nodded without hesitation.</p><br/><p>He took the chalice and slowly moved towards the base camp.</p><br/><p>Benjamin looked at the camp as he felt his spiritual energy rapidly drain. He took a deep breath. He had done his preparations and now, it would all depend on how the situation developed.</p><br/><p>Within the camp.</p><br/><p>\"Why does it feel like there are fewer people?\" One of the merchants grumbled, \"There were over twenty preys and a day has already passed, how could we not have seen even one?\"</p><br/><p>\"Oh really?\" One of the merchants laughed out loud and held two bags of coin, dangling in front of the other, \"Our team has already hunted two. You guys suck.\"</p><br/><p>The merchant shook his head and looked at the bags that were clinking. It was obvious he was not in the best of moods.</p><br/><p>However, there was nothing he could do about it. He stood up and vented his anger, \"What the hell are you guys up to? My chalice is nowhere to be found. That is some expensive shit. If it’s really gone, I’ll skin you alive!\"</p><br/><p>\"Chalice? Do you mean this little thing?\"</p><br/><p>Just then, a sarcastic voice emerged from the side of the camp, grabbing everybody’s attention.</p><br/><p>The few merchants were stunned.</p><br/><p>Under the dim light, Edmund’s figure slowly emerged. He stared at the merchants who were right in the middle of the campsite and held his hand up. The beautiful crystal glass was in the palm of his hand.</p><br/><p>The entire camp was as if frozen in time - still and quiet.</p><br/><p>Perhaps they would have never thought that their \"prey\" would suddenly appear in front of them?</p><br/><p>\"That... That is my chalice! How dare you touch it with your lowly hands?\" The merchant rubbed his eyes and stared again. He was immediately filled with rage.</p><br/><p>Edward, in turn, laughed out loud and spat into the glass. He then tossed it away.</p><br/><p>Clank!</p><br/><p>The glass crashed to the ground and instantly shattered.</p><br/><p>Everyone was gobsmacked.</p><br/><p>\"You... You...\" The merchant pointed to Edward. His finger trembled as he stammered in disbelief.</p><br/><p>Edward was fearless. He gave a provoking hand gesture to the crowd then turned and ran.</p><br/><p>Everyone else was stunned by his quick series of actions.</p><br/><p>\"Quick! After him!\" The merchant came back to his senses and shouted, \"That cocky shit, I will show him!\" Under his orders, the guard gathered together to chase him. The few mages felt something was not quite right and piped up, \"Don’t go just yet... This is odd, how could his hand recover so quickly? Something’s wrong.\"</p><br/><p>They stopped short. The few merchants too, realized this.</p><br/><p>This time, it was Benjamin’s voice that interrupted them.</p><br/><p>\"Only realizing that now? It’s too late.\"</p><br/><p>The few hundred in the camp lifted their heads in unison as they felt a huge drop in temperature. The dark sky was no longer above their heads. What replaced it, was a seemingly endless bluish white ice block.</p><br/><p>They stared back at their own horrified expressions.</p><br/>\n</div>"}