{"title": "Chapter 344: Developing Rules", "id": 344, "volume": 4, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-344-developing-rules", "volume_title": "Volume 4", "body": "<h1>Chapter 344: Developing Rules</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 344: Developing Rules</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Benjamin had his own way of dividing them into groups.</p><br/><p>Splitting them into groups was just the start. He hoped to train them to quickly adapt the ability to work as a team. To ensure equality, he definitely cannot allow them to choose their own teammates, or else it would have defeated the purpose. Like he said, the magic strength of these people did not matter.</p><br/><p>Therefore, this trial period would be crucial.</p><br/><p>He would not recruit all one hundred and fifty of them as that will be too extreme. Besides, that would be too difficult to manage and their expenses would increase dramatically. So in the end, Benjamin only intended to keep half of all these ambition mages standing in front of him.</p><br/><p>And he had already thought of a way to assess them.</p><br/><p>\"From today onwards, all of you will be divided into ten groups and all the groups will be registered separately in the mercenary association, all of you are free to take on any mission.\" His scanned through the crowd and said, \"All the groups can choose to do any type of mission and the group will get to keep all the rewards. A month later, any mercenary group that successfully gets promoted by two ranks will be considered as they have passed the trial period and will officially become one of us.\"</p><br/><p>After hearing that, most of them were stunned.</p><br/><p>There were such assessment methods?</p><br/><p>Just the fact that they can keep all their income was enough to surprise them – won’t Benjamin lose money by doing that? To be honest, a mercenary group with fifteen people wanting to get promoted by two ranks in a month will not be easy. The number of tasks that needed for them to complete was a little overwhelming.</p><br/><p>At least, the mercenary group did not do that.</p><br/><p>These people were combat mages, so they naturally understood the difficulty of it. By temporarily forming a group of fifteen, if they all do not have cooperation skills, there was no need to mention fights. Just by exploring in the wild for a few days, they might even quarrel among themselves, which would be really troublesome.</p><br/><p>However, the only thing that they have in common was that all of them wanted to pass the test.</p><br/><p>Whether they were attracted by the robes in the exhibition or how shocked they were when they were introduced to the modern day concept during the interview, one thing that all the mages had in common was that they wanted to grow stronger. Only the desire to strive higher will drive them out of their comfort zone, take the first step and accept all the strange ideas that Benjamin have in mind.</p><br/><p>Therefore, at that moment, what most of the mages had in mind was not how crazy the test was, but the chances of them getting any reliable teammates.</p><br/><p>If they wanted to get promoted by two ranks in a month, they do not need powerful teammates. Instead, they absolutely cannot be a burden. If not, those who were very confident in their own ability would certainly be a burden too.</p><br/><p>Therefore, under their worried gaze, Benjamin distributed the grouping list. After that, one commotion after another started among the crowd.</p><br/><p>\"Oh no, who is this? There’s no one in the team that I’m familiar with, this is bad.\"</p><br/><p>\"As expected, we are not on the same team. To increase the difficulty, they certainly will not let acquaintances work together.\"</p><br/><p>\"Jack, Tom, Mary... Where are all of you? Hurry up! We need to get to know each other, I will be in your hands for the following month.\"</p><br/><p>Looking at all the mages who were being messily mixed around in groups, Benjamin nodded his head with a smile.</p><br/><p>When he was picking them out, he valued their positive attitudes. And now, this attitude allowed these mages to face the problem without raising any objections and none of them had given up yet. Instead, they took the initiative to think of a solution - this was the part that Benjamin admired the most.</p><br/><p>However, he could not have given these people a challenge and not do anything more.</p><br/><p>\"This is the law of meditation that we are using. It is different from what you have seen before. This will allow you to train your spiritual energy and your elemental affinity at the same time, which is extremely efficient.\" He took out the law of meditation that he modified from the church and continued, \"As long as you have passed the test, I will give it to all of you.\"</p><br/><p>After hearing what he said, the mages could not hide the desire in their eyes.</p><br/><p>Those who came to the interview were not successful people. Most of them had just started off as a mage. Their laws of meditation were basically entry-leveled laws and so, they naturally understood how greatly they can improve with a good law of meditation.</p><br/><p>However, Benjamin had prepared more than that.</p><br/><p>\"Other than that, I have this too.\" He took a pendant with a cross on it from his pocket and said, \"This came from the church, by wearing it, it will enhance your spiritual energy, and this is my reward for you too. For the first group that passes the test, I will choose one of you with the best performance and reward you with this pendant.\"</p><br/><p>Instantly, all the mages had their eyes wide open.</p><br/><p>Another magical tool!</p><br/><p>Benjamin's generosity had completely shocked them. With all the stuff that he mentioned, why would anyone give it away without any hesitation?</p><br/><p>By doing so, their motivation was completely fired up. In the context of a Japanese comic book, their eyes were fired up too.</p><br/><p>\"But, all of you do not have to pay too much attention to it. Getting through the test is your main goal.\" Benjamin added, \"This is not something rare; in the future, all of you will have the opportunity to get better tools.\"</p><br/><p>\"Re... really?\" Someone could not help but ask.</p><br/><p>Benjamin smiled and nodded, \"Of course it’s true.\"</p><br/><p>All the mages clenched their fists eagerly, as though for a moment, the difficulty of the test was thrown to the back of their heads.</p><br/><p>Was he joking? With such benefits, they would risk their lives for it!</p><br/><p>But...</p><br/><p>When the crowd started to quiet down, Benjamin looked at them and his expression slowly turned serious.</p><br/><p>\"Having such benefits, all of you should also understand that it will be different here.\"</p><br/><p>He had to make things clear.</p><br/><p>As he caught everyone’s attention, he went silent for a moment, then he suddenly said with a cold voice and a murderous intention, \"There will be chaos soon.\"</p><br/><p>Everyone looked at each other and for a moment, no one spoke - it was dead silent.</p><br/><p>\"You must have heard about the changes made by the church in Icor.\" Benjamin said, \"Some of you might think that the Kingdom of Helius is far from us and if they were to start a war, it will definitely be in Icor. But, I can tell all of you that there are spies from the church that have infiltrated Ferelden a long time ago. Changes that happened in Icor might happen here at any time.\"</p><br/><p>Everyone started an uproar.</p><br/><p>Benjamin did not care about their reaction, instead, he spoke faster.</p><br/><p>\"By telling all of you about this, it does not mean that I want all of you to fight against the church and save Icor. We are just ordinary people, we would rather live our lives peacefully and it is difficult to bear such an important task. What I hope is that when changes have been made, we will have the ability to control our own destiny.\"</p><br/><p>\"Therefore, we cannot be lost soldiers who scatter or flee when something happens, hide in the caves like the olden days or comfort yourself that you are some hermit living in solitude. We have to stand together at the top so that people will know that we matter in this world.\"</p><br/><p>\"I know that it might be hard for some of you to accept that. Those who want to give up, you can leave now.\" Up until here, Benjamin closed his eyes, \"And for those who want to become stronger and those who want control your own destiny, lift up your right hand. You do not need to show it to me, but prove to yourself that you have the courage to do something.\"</p><br/><p>After saying that, Benjamin had his eyes closed and the only thing he heard was silence.</p><br/><p>That was probably the loudest silence in the world.</p><br/><p>So, he opened his eyes and smiled.</p><br/><p>\"I'm glad that all of you made the right choice.\"</p><br/><p>All he saw was one hundred and fifty firm hands up in the air, looking like rows of gravestones, they quietly held their hands up in Ferelden — Rayleigh City — the house that Benjamin just bought, a simple house that was being made into a stronghold.</p><br/>\n</div>"}