{"title": "Chapter 348: Caught Off Guard", "id": 348, "volume": 4, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-348-caught-off-guard", "volume_title": "Volume 4", "body": "<h1>Chapter 348: Caught Off Guard</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 348: Caught Off Guard</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Benjamin felt something was wrong.</p><br/><p>Through his sensing technique, he was sure that the woman wearing a veil in front of him was a mage. But... he just entered the desert city for a few minutes, how did something happen so quickly? Was it just his luck or the four of them were really famous, so they were being recognized easily?</p><br/><p>Looking at her expression, he felt that it might be a misunderstanding.</p><br/><p>Therefore, he quickly explained, \"Do not misunderstand, I did not do anything to them. They are not feeling well, but they will be fine after they rest.\"</p><br/><p>The masked woman was slightly surprised.</p><br/><p>\"…Are you their friends?\"</p><br/><p>Benjamin frowned.</p><br/><p>Friends... could they be considered as friends?</p><br/><p>Although he was hesitant, in order to quickly resolve this awkward situation, he nodded his head and said, \"I guess so, we came here together.\"</p><br/><p>However, he did not expect her to react this way.</p><br/><p>\"Well... since you’re with them, then you will die with them!\"</p><br/><p>Accompanied by a sudden violent elemental disturbance, the masked woman started casting a spell with a murderous intention. Then, a piece of icicle suddenly emerged in the air and turned the air cold, then she aimed it at Benjamin and the four thieves.</p><br/><p>\"...\"</p><br/><p>Benjamin was speechless.</p><br/><p>Damn it, he thought that she was trying to save her teammates but they were actually enemies?</p><br/><p>Despite things getting out of hand, wasn’t directly slaughtering someone in the town a little too arrogant? Was she not afraid of the patrolling guards? Did they have any law in this place?</p><br/><p>He couldn't help but look at the reaction of the people around him. As a result, the passers-by were calmer than he thought——they turned around and ran as though they were used to it already, then they hid in their houses, close their doors and windows, crammed at the window and waited for a good show.</p><br/><p>Benjamin was stunned.</p><br/><p>So, the desert city was this chaotic?</p><br/><p>He was very confused at that moment and he wanted to wake the four thieves up to ask them what was happening. However, he did not have the time to do so.</p><br/><p>——The woman had already made an attack, he had to do something.</p><br/><p>He saw the masked woman move her left hand and the 20 icicles in the air looked as though they found their target and flew straight toward Benjamin.</p><br/><p>Benjamin quickly cast a spell and formed an ice wall, blocking all of the opponent's attacks.</p><br/><p>\"Who are you?\" His opponent wasn’t being too aggressive, so, Benjamin could block her attack calmly. When he found an opening, he asked while frowning.</p><br/><p>\"None of your business.\" Probably after seeing how Benjamin could easily block her attacks, the masked woman became a little more cautious, she stopped her attack and said, \"If you are sensible, please step aside. I only need the four of them. \"</p><br/><p>Hearing that, Benjamin helplessly held his hands out and said, \"I'm sorry, I need the four of them now. If you really want to kill them, can you wait a few days later?</p><br/><p>\"You’re crazy.\"</p><br/><p>Hearing that, the masked woman cursed and suddenly pulled out a gun.</p><br/><p>Benjamin did not expect her to aim the gun at the sky and pull the trigger.</p><br/><p>Bang!</p><br/><p>The sound of the loud gunshot echoed through the silent street. At first, Benjamin was still a little confused, but immediately, he understood what she was trying to do.</p><br/><p>Was she asking for help?</p><br/><p>Benjamin panicked.</p><br/><p>Although he still did not understand what was happening, looking at how fearless she was, her reinforcements should be quite powerful and they would not be easy to deal with.</p><br/><p>If it was before, Benjamin would most probably back out and run with four of them, then ask them what was happening. But now that he had grown stronger, he was allowed to act less cautiously.</p><br/><p>Therefore, he did not escape, instead, he rushed directly towards the masked woman!</p><br/><p>Either way, he was considered as a big shot now. How can he not retaliate when she suddenly attacked him?</p><br/><p>Bang!</p><br/><p>Another gunshot was fired, but this time, she fired it at Benjamin. The masked woman’s reaction was considered fast, he quickly activated a shield to block the blessed bullet. However, the shield that he had just summoned was being shattered by the bullet and was re-dispersed as shrapnel.</p><br/><p>Taking advantage of this opportunity, Benjamin went behind the masked woman.</p><br/><p>In a split second, he condensed a highly compressed water bomb in his hand. He held the water bomb in the air and threw it at the masked woman’s head.</p><br/><p>Accompanied by the water splashing to the sky, the water bomb instantly exploded and the explosion created a large impact. The masked woman was caught off guard, as though she had been hit by a car, boom, she was thrown ten meters away like a bottle hit by a bowling ball.</p><br/><p>Finally, she motionlessly fell on the ground.</p><br/><p>Seeing that, Benjamin sneered coldly.</p><br/><p>A mage hit in the head by a water bomb in such a close distance, Benjamin deliberately controlled the direction of the impact of the explosion which caused a extremely powerful blow at the end.</p><br/><p>If Benjamin did not use the water vapor to support her hands, she might have been killed from the fall.</p><br/><p>Even so, after being exposed to such impact, she must have been badly hurt. Benjamin estimated that there should be at least internal bleeding in her head and she won’t be able to move anytime soon. She could be considered as being kept under control.</p><br/><p>After that, he used the icebreaking spell to create an ice coffin and used the water vapors to throw her in it.</p><br/><p>Her reinforcements should be coming soon, Benjamin wanted to understand the situation, so, he did not escape. Therefore, he decided to use the masked woman as a hostage so that the enemy will be a little more cautious and he will see how it goes.</p><br/><p>Thinking about that, he turned around and looked at the four of them who had not woken up yet.</p><br/><p>...So troublesome.</p><br/><p>Before the enemy's reinforcements arrived, he made a few healing water balls and splashed it on them to wake them up.</p><br/><p>\"What, what...\" The few of them rubbed their heads and faintly stood up. When they saw the masked woman in the ice coffin, they looked like they had just seen a ghost and they had their eyes wide open unbelievably.</p><br/><p>Benjamin crossed his arms and looked at them coldly, \"What? I should be the one asking, what is happening. Are you not planning to explain?</p><br/><p>\"Hmm...\"</p><br/><p>The four of them scratched their heads and went silent.</p><br/><p>However, Benjamin did not have time to continue asking. Soon, he looked up at the sky with a serious look. Suddenly, he saw dozens of mages quickly flying towards his position. It seemed like they were a group of mages who were able to use the flying spell.</p><br/><p>They must be the masked woman’s reinforcements.</p><br/><p>\"Oh... there’s so many of them? This is bad.\"</p><br/><p>Benjamin thought about it and he suddenly waved his hands. Countless water vapors emerged like a windstorm, blowing toward the mages flying in the sky. The few dozens of mages got caught off guard and was stopped by the water vapors, preventing them from flying over.</p><br/><p>As for Benjamin and the rest of them, while their opponent was blocked by the water vapors, they ran away and brought the masked woman with them.</p><br/><p>\"What ... you, stop running!\"</p><br/><p>These voices came behind them.</p><br/><p>Benjamin did not care about it, instead, he used the water vapors to carry the four thieves and the masked woman and flew into the corner of the street. And in a blink of an eye, they disappeared.</p><br/><p>What a joke, he did improve a lot, but fighting dozens of people alone was not just a matter of strength.</p><br/><p>He better run.</p><br/><p>Whereas the ones in the houses who were crowding behind the window, they saw that and they looked at each other.</p><br/><p>Benjamin fled quickly and in a while, he was nowhere to be seen. After they disappeared, the group of mages flew down furiously. When the passers-by saw this, they quickly pulled the curtains and pretended to not know anything.</p><br/><p>Of course, they left a small gap between the curtains, if they were to look into the curtains carefully, they would've found a pair of curious eyes, silently watching the whole process.</p><br/><p>\"This is bad... that thing is still on her and they took it together with them.\" After they landed, one of the mages said while panicking.</p><br/><p>The people behind the curtains excitedly opened their eyes widely.</p><br/><p>The other mages on the street looked at each other and their faces turned black.</p><br/><p>\"Quickly look for them!\" One of the mages who looked older seemed to be their leader, he took a deep breath, waved his fist and said with a scary and pressuring tone.</p><br/>\n</div>"}