{"title": "Chapter 355: Not So Secret Meeting", "id": 355, "volume": 4, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-355-not-so-secret-meeting", "volume_title": "Volume 4", "body": "<h1>Chapter 355: Not So Secret Meeting</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 355: Not So Secret Meeting</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>It was getting late and the lampposts around the palace in the City of Snow were lit up.</p><br/><p>\"…they’re still not here?\"</p><br/><p>There was a small garden at the back of the palace and at the moment, Benjamin was standing in the garden, resting his back on a tree and waiting for the King’s servant to pick him up.</p><br/><p>Wanting to meet the king was not easy. Due to this situation, if he were to just walk into the door, say that he was the mage Benjamin and he wanted to meet the King, Aldrich would most probably kill him!</p><br/><p>He had to avoid getting the attention of his enemy and secretly convey the message to the king.</p><br/><p>Fortunately, in order to deal with this kind of situation, the King had left Benjamin a secret way to contact him - if Benjamin wanted to meet privately, in the afternoon before four o'clock, leave a special mark on the street in front of the palace. There will be guards patrolling the street and if they saw the mark, they would think of a way to bring Benjamin in.</p><br/><p>And what Benjamin needed to do was sneak into the garden behind the palace and wait patiently.</p><br/><p>Although he was not talented in sneaking, doing this was way easier than sneaking into the palace. At the moment, he had left a mark, sneaked into the garden without anyone noticing and hid behind the tree that they had agreed on.</p><br/><p>However, he had waited for quite a long time already.</p><br/><p>As time passed gradually, the sun started to set. The originally dim and hazy woods slowly became completely dark.</p><br/><p>Benjamin was getting a bit nervous.</p><br/><p>He did not know when the king's henchman were coming, in fact, he gradually had a bad feeling in his heart.</p><br/><p>Without a doubt, the night of the attack was part of the Mages Freemasonry’s plot against the King. At that time, if it was not because of Benjamin, Aldrich would have gotten the opportunity to \"protect\" the king. However, it had been so long, Benjamin knew nothing about what had happened in the palace since then.</p><br/><p>After failing once, did the Mages Freemasonry let it go at that?</p><br/><p>Benjamin did not know, but if there were changes in the circumstances of the palace, then him staying in this place would be equivalent to giving himself in, it was extremely dangerous.</p><br/><p>However, he did not retreat because of that.</p><br/><p>No matter how dangerous it was, he had to try, or he would die even badly.</p><br/><p>Half a month later, he did not want to be chased after by the assassins that the Mages Freemasonry sent and die accidentally; he also did not want to be like the man in the wheelchair, hiding in a desolated corner and living in fear forever. The church’s influence was too great and his was very petty, he did not like seeing a group of false prophets getting what they want.</p><br/><p>Somehow, he came this far and got to know about the church's conspiracy, as though the wheel of history was in his hands once again. He could do something, although he might not truly change everything, either way, he did not want to give up on the ability to choose simply because he was being afraid.</p><br/><p>Someone had to do something.</p><br/><p>Benjamin felt that he was the one.</p><br/><p>\"Is this Mr. Benjamin?\"</p><br/><p>Finally, just as he was getting impatient, in the death of the night in the garden, an extremely deep voice came from behind and ended his long wait.</p><br/><p>Through the water element sensing technique, Benjamin had already sensed him.</p><br/><p>He was the servant that served him previously.</p><br/><p>\"It’s me.\" Benjamin turned and replied in the darkness.</p><br/><p>Hearing that, the servant walked towards Benjamin, touched his arm and said, \"Mr. Benjamin, please come with me. I will take you into the palace.\"</p><br/><p>Hearing that, Benjamin did not question anything and nodded his head, \"Okay.\"</p><br/><p>Under the guidance of the servant, he did not come to the main entrance of the palace, instead, he was brought to a storeroom near the garden. They entered the room, closed the door and the servant gave him a set of servant outfits.</p><br/><p>\"Mr. Master, I’m sorry for making you do this. The only way to enter the palace without anyone noticing is to dress like a servant.\" The servant said.</p><br/><p>\"Sure.\" Benjamin nodded his head in agreement.</p><br/><p>He was used to disguising himself, so he was not against it.</p><br/><p>However, the fact that he needed to disguise as a servant to meet the king, it proved that the people from the Mages Freemasonry were watching and the king did not know who he could trust in the palace. So is that why he decided to do this?</p><br/><p>Thinking of this, Benjamin secretly sighed in his heart.</p><br/><p>This was not an optimistic situation...</p><br/><p>A few minutes later, he changed his clothes, fixed himself and looked in the mirror, perfect. Even if Aldrich was standing in front of him, he would not recognize him.</p><br/><p>When the servant saw Benjamin, he was amazed and nodded his head.</p><br/><p>\"No one will recognize you for sure.\" The servant opened the door, turned over his head and whispered, \"Master, please came with me.\"</p><br/><p>Benjamin nodded and followed him.</p><br/><p>Therefore, under the guidance of the servant, Benjamin came to the front of the palace, passed by all the guards and finally entered the front door. Along the way, they bowed their heads without saying a word, the guards at the door did not question and readily let them in.</p><br/><p>Finally, he entered this solemn palace once again.</p><br/><p>\"Princess, please do not run that fast...\"</p><br/><p>As they passed by a corridor, he heard a familiar voice coming from the other end of the corridor.</p><br/><p>Benjamin turned his head in surprise.</p><br/><p>However, just when he looked over there, the source of the sound seemed to have turned into another corridor and was getting further away. Therefore, Benjamin did not see anything.</p><br/><p>He frowned</p><br/><p>That sound ...</p><br/><p>Was it the maid who was taking care of the princess?</p><br/><p>\"Her Majesty has been getting naughtier recently.\" The servant walking in front saw that, he could not help but to whisper a sigh, then immediately urged, \"Quickly come with me, His Highness is still waiting in front!\"</p><br/><p>Benjamin heard this and nodded his head.</p><br/><p>He continued to walk forward with the servant.</p><br/><p>Through a corridor after corridors, Benjamin followed the servant and eventually came to the front of a room. The servant stopped here and gave Benjamin a hint with his eyes. Instantly, Benjamin understood, they had arrived.</p><br/><p>The king was waiting for him in this room.</p><br/><p>Therefore, he walked to the door, held the doorknob and gently turned it.</p><br/><p>The door was open.</p><br/><p>\"Come on in and be quiet, he will be guarding outside the door.\" The king's voice came from the room and it made Benjamin sigh in relief.</p><br/><p>... Luckily, he was not dead.</p><br/><p>Thinking so, he pushed the door and entered the room. It seemed to be a guest room, it was similar to the one that he stayed in previously, the bed, the window, the wardrobe... ... it had all the basic types of furniture, it was spacious and the decoration was beautiful.</p><br/><p>The king was standing beside the window at the moment and was looking at him with a dignified look.</p><br/><p>\"Your Majesty.\" Benjamin quickly walked towards him and bowed.</p><br/><p>\"Yes, just say what you wanted to say.\" The king nodded and Benjamin could tell from his expression that he was very troubled, \"Why did you suddenly visit me at this hour, Benjamin, what happened?\"</p><br/><p>After hearing this, Benjamin looked behind him. He needed to make sure that the door was closed before he walked forward and spoke with an extremely serious tone and a voice that only the king can hear:</p><br/><p>\"Your Majesty, I just got some news, the one supporting and controlling the Mages Freemasonry is the church in the Kingdom of Helius.\"</p><br/><p>He did not intend to sugarcoat it, he immediately said it clearly.</p><br/><p>When the king heard this, he was extremely shocked. He took a few steps back, leaned against the wall, took a deep breath and clenched his fist.</p><br/><p>He responded fairly well, and soon, he looked at Benjamin and asked, \"What evidence do you have?\"</p><br/><p>Benjamin did not hesitate. He nodded head firmly and immediately told the king everything he found today from peeping into the Mages Freemasonry.</p><br/><p>Every time he said something, the king's facial expression became worst.</p><br/><p>Eventually, Benjamin was done talking.</p><br/><p>Because of the details, his words were very convincing. Although there was no actual evidence, but as long as the king was willing to, they could immediately make a sudden inspection on the Mages Freemasonry and it would definitely verify what he said.</p><br/><p>And looking at the king's face, he seemed to have fully believed in him.</p><br/><p>\"... the church again.\"</p><br/><p>He shook his head. There was anger and hatred in his voice along with a little helplessness.</p><br/><p>Seeing that, Benjamin asked, \"Then... Your Majesty, what should we do now?</p><br/><p>The king sighed and went silent for a moment, then he said, \"Just go back first, be careful not to let the others find out about you. These are very important news, I have to think about it.\"</p><br/><p>Benjamin was stunned after hearing that.</p><br/><p>\"You... you want me to leave just like that?\"</p><br/><p>The king patted his shoulder and said, \"Yes, even if you stay, you will not be able to help.\"</p><br/><p>However, Benjamin took a few steps back with a difficult look.</p><br/><p>\"Your Majesty, do you really want me to leave?\" He raised his head, his tone suddenly became strange and frivolous with a slight irony. \"I don’t think so, Aldrich is still hiding outside of the window, do I need to greet him?\"</p><br/>\n</div>"}