{"title": "Chapter 360: 《Declaration of The Freedom of Magic》", "id": 360, "volume": 4, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-360-%E3%80%8Adeclaration-of-the-freedom-of-magic%E3%80%8B", "volume_title": "Volume 4", "body": "<h1>Chapter 360: 《Declaration of The Freedom of Magic》</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 360: 《Declaration of The Freedom of Magic》</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Benjamin flew all night without sleeping or resting before arriving in Rayleigh City by noon of the next day.</p><br/><p>He expected his name and portrait to be plastered all over the gates, where all the people passing by would see it. He even thought that Aldrich would call for a ban, sealing the City of Rayleigh and not allowing anyone to enter or exit.</p><br/><p>However, he found out that he was wrong.</p><br/><p>The City of Rayleigh was still as lively as ever, without the slightest hint of abnormality.</p><br/><p>Benjamin was still doubtful, so, he disguised himself again before entering the city to ask around. The death of the king was such huge news, how could the city not have heard rumors about it?</p><br/><p>Ferelden was one of the most prosperous cities in the country, how could the news not have spread here yet.</p><br/><p>Unless… did Aldrich hide the news?</p><br/><p>Upon further thought, it would not be impossible. At the time, the palace was in chaos and since Aldrich was the strongest among those who remained inside, he could have easily taken control and suppressed the news of the death of the king.</p><br/><p>After all, the king's identity was the most critical factor in the church’s plan.</p><br/><p>It was possible that Aldrich wanted to take over the throne. He would cover up the news of the king’s death, claim that the king was ill, then become the acting ruler. This way, he would gain control of the situation and prevent Ferelden from splitting apart again.</p><br/><p>Benjamin nodded his head.</p><br/><p>Although he did not have any evidence, if in a few days the news of the death of the king wasn’t sweeping the nation, his suspicions would be verified.</p><br/><p>Benjamin was worried.</p><br/><p>The reason he killed the king was to disrupt the peace in Ferelden so that Aldrich could not control the country. But now, although the king was no longer in the picture, Ferelden still fell into the hands of the church. The plan would be delayed for a maximum of a few years, but it would eventually be completed.</p><br/><p>He had to stop that from happening. His heart raced as he made his way to the secret rendezvous point.</p><br/><p>By the designated time, twenty-three senior mages were gathered in an abandoned house in a remote corner of the city.</p><br/><p>\"What is the situation now?\" Benjamin asked.</p><br/><p>\"Nothing special.\" said Varys, \"Everyone has gone into hiding whilst making sure not to leave any trails. As for the one hundred and fifty men, we have told them that tonight, we all are to gather in an abandoned warehouse in the north part of the city. \"</p><br/><p>Benjamin heard and nodded, \"Good job.\"</p><br/><p>Dealing with a hundred and fifty people was one difficult problem. They had only just been recruited, and thus lacked cohesive ability. He was afraid they might slow him down if he had to fight against the authorities.</p><br/><p>On the other hand, it would be a pity to dismiss all of them.</p><br/><p>What to do…</p><br/><p>Benjamin was deep in thought. The other mages saw this and looked at each other. Eventually, Varys spoke up, interrupting Benjamin's thoughts.</p><br/><p>\"What happened?\" He asked with a puzzled look.</p><br/><p>Benjamin composed himself and looked at the crowd; he could not help but sigh.</p><br/><p>After a moment of silence, he finally spoke and told everyone everything that had happened in the past few days – how the church was controlling the Mages Freemasonry, their plan to turn Ferelden into another Kingdom of Helius, the King’s death...</p><br/><p>Even though the group was used to surprises, the news left them stunned and speechless.</p><br/><p>\"Tea… teacher, did you really kill the king?\"</p><br/><p>Benjamin nodded his head, \"He had joined the church’s side. If I were to spare his life, we would not be allowed to continue living in peace.\"</p><br/><p>Lara stared at him longingly, \"You’re so amazing… killing the king seems to be very interesting.\"</p><br/><p>\"...\"</p><br/><p>Andy took a deep breath and looked uneasy, \"They will certainly come for revenge. What should we do? Do we need to start running again?\"</p><br/><p>The other mages heard this and turned to look at Benjamin. Their eyes were filled with doubt - apparently, they were also very concerned about this issue.</p><br/><p>Benjamin shook his head.</p><br/><p>\"We are no longer a group of half-assed mages.\" He smiled and patted Andy's shoulders, \"Moreover, the king had just died – the authorities will be completely occupied. As long as we are careful, they won’t do anything to us.\"</p><br/><p>Ever since their training from the escape, everyone’s skills were pretty much the same level. They had all found shelter in the city of Rayleigh, whilst some had even forged new identities for themselves. They were unlikely to get caught.</p><br/><p>After hearing that they did not have to run again, everyone happily nodded their head.</p><br/><p>\"How strong is the mage Aldrich?\" Joanna smirked confidently, \"Can’t we just get a group of people to kill him?\"</p><br/><p>Benjamin shook his head, \"If only it was that easy. Even if we were to assemble a task force, his gang would still outnumber us. Moreover, getting rid of him will do nothing for our current situation. Conversely, it might cause us to become enemies with an entire country.\"</p><br/><p>\"Then what should we do?\"</p><br/><p>Benjamin thought for a while before saying, \"We have to defeat him.\"</p><br/><p>\"Defeat him?\" After hearing this, everyone was confused.</p><br/><p>\"Aldrich has influence over the whole Mages Freemasonry and is also the church's main player in Ferelden.\" Benjamin nodded and went on saying, \"We have to defeat him completely and destroy all traces of the church in Ferelden. If not, they will surely rise again.\"</p><br/><p>In other words, they had to win control of Ferelden from the hands of the Mages Freemasonry.</p><br/><p>Everyone looked at each other.</p><br/><p>\"That sounds a lot harder than killing Aldrich.\"</p><br/><p>Benjamin nodded his head.</p><br/><p>It was indeed very difficult, but everyone looked pumped after calming down from their initial shock.</p><br/><p>\"Tell us what to do.\" Augustine said, and everyone nodded in agreement, a fiery look in their eyes.</p><br/><p>Benjamin smiled, clapped his fist and said, \"First of all, we need to show the people of Ferelden the true colors of the Mages Freemasonry - especially the mages, we need to have them on our side… \"</p><br/><p>Everyone listened intently.</p><br/><p>After Benjamin’s summarization, the secret meeting came to an end and everyone left and returned back to the four corners of the city of Rayleigh. Following Benjamin’s explanation, they began to prepare for the next step.</p><br/><p>They started writing a book.</p><br/><p>When Benjamin was still in the Kingdom of Helius, he was very touched by the mage’s version of the\"Bible\"- the one that Michelle had thrown at him. It was not just a regular spell book, it talked about another version of the origin story. More importantly, the book was the reason why magic was still allowed in the Kingdom of Helius; it explained how magic was not evil, but a talent worthy of respect.</p><br/><p>The mages of Ferelden had been slacking for too long, they needed a new book.</p><br/><p>Benjamin decided to name it \"The Declaration of the Freedom of Magic\".</p><br/>\n</div>"}