{"title": "Chapter 362: Fereldan in Chaos", "id": 362, "volume": 4, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-362-fereldan-in-chaos", "volume_title": "Volume 4", "body": "<h1>Chapter 362: Fereldan in Chaos</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 362: Fereldan in Chaos</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Over the next few days, Fereldan appeared tranquil on the surface but trouble was secretly brewing.</p><br/><p>Benjamin and the rest did not stay in Rayleigh City, they had gone separate ways and were in many Fereldan’s cities and towns in preparation for the release of the \"Declaration of the Freedom of Magic\".</p><br/><p>For the plan to work, they couldn’t just restrict themselves to a few cities. The death of a king should be nationwide news. Since Aldrich was not willing to announce anything, Benjamin figured he’d give him a helping hand.</p><br/><p>Of course, they did so while remaining low profile. They disguised themselves and snuck into many bars and taverns, secretly spreading the rumor.</p><br/><p>\"Hey, have you heard? His Majesty... His Majesty seems to have passed.\"</p><br/><p>\"What? Wasn’t he alright a few days ago? How could this be? Where did you hear this from?\"</p><br/><p>\"I heard from a friend in the palace. He said the murderer was a man called Aldrich, the president of the Mages Freemasonry. He also said Aldrich is now in control of the palace.\"</p><br/><p>The same conversation was repeated countless times in taverns nationwide. The mages under Benjamin divided into groups of two and made them discuss the topic in public, making sure not to lower their voices so that curious ears would overhear them.</p><br/><p>Although it wasn’t a very tasteful approach, he knew people couldn’t resist finding out more about such scandalous news.</p><br/><p>\"Have you heard the latest news about His Majesty?\"</p><br/><p>\"You heard the news too?\"</p><br/><p>\"Yeah! News’ been going all around town. Even my sister who lives in the neighboring town asked me about it. I wonder if it is true?\"</p><br/><p>The more the rumor spread, the more worried the public became. They noticed that it had been some time since the king last appeared and the whole palace seemed to be on lockdown. Over time, the people of Fereldan slowly started to believe the rumor.</p><br/><p>The people panicked, and some even started to secretly pack their bags and prepare to leave. People stopped walking around the streets and there was major inflation nationwide. Some merchants started to stockpile while others closed their doors to the public.</p><br/><p>The branches of the mages freemasonry in all the cities had also closed its doors. Angry mercenaries and civilians constantly prowled outside their gates demanding answers. The branch in Rayleigh City was covered with egg yolk and egg shells were piled up on the ground outside. It reeked an absolutely pungent odor.</p><br/><p>The events that were taking place simply could not be ignored within the mages’ circle.</p><br/><p>Many of the mages sought out their friends in the Freemasonry to inquire about what was going on. However, they soon discovered that all of them had disappeared without a trace.</p><br/><p>Hence, the mages’ circle was in chaos and did not how to proceed.</p><br/><p>\"Mage Benjamin, is everything you’ve said true?\"</p><br/><p>Late at night in an abandoned house on the outskirts of Rayleigh City, Mage Vinci stared at Benjamin who was standing in front of him with a heavy heart.</p><br/><p>After sowing the seeds of the rumor, Benjamin returned to hide in Rayleigh City so that he could observe the progress of events safely.</p><br/><p>As public panic grew, Mage Vinci decided that he could not sit quietly any longer. When he received no response from the Mages Freemasonry, he made efforts to contact Benjamin so that they could meet.</p><br/><p>\"It’s true. I was at the palace at the time.\" Benjamin nodded and firmly replied, \"About a month ago, there was an attempt on His Majesty’s life. The assassin was from the Mages Freemasonry, but Aldrich pretended to know nothing of it. His Majesty was suspicious and had instructed me to investigate him privately. When I went to report back to him a few days ago, I walked in on Aldrich dealing him the finishing blow.\"</p><br/><p>Vinci let out a deep sigh.</p><br/><p>\"You are in grave danger.\" After a moment of silence, he advised, \"Once Aldrich is no longer preoccupied, he will come after you. You better pack your bags and leave quickly.\"</p><br/><p>Benjamin shook his head, \"I will not leave.\"</p><br/><p>Vinci frowned, \"You wish to stay?\"</p><br/><p>\"If I were to leave, what would happen to the rest of the mages? Moreover, if the Church gains total control over Fereldan, there would be nowhere to hide.\"</p><br/><p>Mage Vinci nodded helplessly and said no more.</p><br/><p>Benjamin saw that he had been convinced, took out a booklet from his pocket and gave it to mage Vinci.</p><br/><p>\"What’s this? Mage Vinci said confused.</p><br/><p>\"This is something I am doing for everyone.\" Benjamin replied, \"Take a look, we just had it made. It could be a potential game-changer.\"</p><br/><p>Mage Vinci took the booklet and quickly skimmed through.</p><br/><p>After a few minutes, he closed the book and stared at the ground. He did not look at Benjamin as he spoke, \"Is this really necessary? There are many things in it that should not be shared openly.\"</p><br/><p>Benjamin shook his head, \"I believe you are referring to the recipes for magical potions. I know that on one hand, it could hurt your business, but on the other hand, the development of new magical potions has stagnated for so many years because the public lacks knowledge on the subject.\"</p><br/><p>\"I do not think that magic potions are developing slowly.\" Vinci rebutted.</p><br/><p>\"That is because you have not been to the Kingdom of Helius.\" Benjamin continued, \"Their technology that allows them to create Divine Arts’ tools is well beyond your imagination.\"</p><br/><p>\"…\"</p><br/><p>Mage Vinci fell silent.</p><br/><p>Benjamin went on, \"If I did not include recipes and incantations, why would the mages start circulating it? The Church already has control over the Fereldan authorities. If this goes on, there will be nothing left for you and me.\"</p><br/><p>Still, Vinci did not say a word.</p><br/><p>\"Do you understand the severity of our situation?\" Benjamin was getting nervous, \"Many years ago, the Kingdom of Helius was a fine place for mages to live, but it all quickly went to hell. Do you know how the Church managed to extinguish all the mages in the area so efficiently? It was because the mages there only fought for themselves and failed to cooperate before it was too late.\"</p><br/><p>\"Mage Vinci, please do not let Fereldan follow in the Kingdom of Helius’ footsteps.\"</p><br/><p>Benjamin felt his throat dry up from all the talking but it was to no avail - Mage Vinci still shook his head.</p><br/><p>\"Mage Benjamin, I think you are being too pessimistic.\" He returned the booklet to Benjamin, \"The Church may be evil but at the end of the day this is not the Kingdom of Helius. There are many mages in Fereldan and the Church will not take make any sudden moves.\"</p><br/><p>\"Mage Vinci…\"</p><br/><p>Benjamin wanted to try convincing him again but Vinci had already gotten up and left the room.</p><br/>\n</div>"}