{"title": "Chapter 365: Execution by Fire in the City", "id": 365, "volume": 4, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-365-execution-by-fire-in-the-city", "volume_title": "Volume 4", "body": "<h1>Chapter 365: Execution by Fire in the City</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 365: Execution by Fire in the City</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Half a day ago.</p><br/><p>Time was close to the evening.</p><br/><p>\"Aldrich, are you ready?\"</p><br/><p>The sun was setting like a gauze that was dyed in bloody red, caped over the silent palace. The palace was like an ice mountain, filled with the smell of death, a dark contrast to the hustle and bustle of the streets opposite the palace.</p><br/><p>The rumors had worsened and the local officials and people gathered outside the palace, demanding to see His Majesty. Even the military all over Fereldan couldn’t resist holding back and many high ranked officers secretly returned to the City of Snow, and presented confidential letters to see the King.</p><br/><p>At this moment, Aldrich and a bishop in purple robe were standing in the palace. They saw the chaos happening outside the window but they bore a cool demeanor like a frozen pond.</p><br/><p>\"Bishop Victor.\" Aldrich turned, \"I have been preparing for this moment all my life.\"</p><br/><p>The bishop silently nodded.</p><br/><p>They did not stare at the window any further. They turned and walked out the room.</p><br/><p>Outside the room, there were the queen and a few ladies in waiting standing there. As the both walked out, they lowered their heads in fear.</p><br/><p>\"Your Highness.\"</p><br/><p>Aldrich benignly smiled and walked over to hold her hands, \"It will begin immediately. The future of Fereldan will rest in Bishop Victor and Your Highness’ hands.</p><br/><p>The queen kept silent and suddenly pulled her hands away from Aldrich’s.</p><br/><p>She held her tummy and did not say a word. Instead, she quietly nodded.</p><br/><p>Aldrich was not upset with the queen’s gesture of refusal. He conversely portrayed tenderness. He took a few more glances at the queen with his old droopy eyes.</p><br/><p>\"May God bless you.\"</p><br/><p>He then turned and made way to the corridor.</p><br/><p>The purple robed Bishop, the queen who was seemingly teary eyed, the ladies in waiting whose heads were lowered... Each and everyone of them followed behind Aldrich, silently moving forward, as if they were on their way to mourn at the funeral.</p><br/><p>Aldrich led at the front. The sun shone at his wrinkled face, as though it was outlining ranges of mountain.</p><br/><p>Ten minutes later, they reached the entrance of the palace.</p><br/><p>The entire crowd has now grown in numbers. A number of guards, a few prestigious officials, a general... Although the number has increased, but they were in line with uniformity. The one that stood in front, was now the queen instead of Aldrich.</p><br/><p>The queen wore a black simple dress with a black veil. At times she took out a handkerchief to wipe her tears.</p><br/><p>Aldrich was now stripped off his neat judicial robe and his white hair and clothes were a mess. Both his hands were chained to the back and his body was wrapped around with an anti-demon chain that caused much difficulty for his old body to take each step.</p><br/><p>A few of the soldiers apprehended him and followed the pack from the back. There was a loud clanking sound each time the chain dragged through the ground.</p><br/><p>\"Your Highness, are you ready?\"</p><br/><p>Just before they stepped out of the main gate, the Bishop lowered his voice to ask the queen from behind.</p><br/><p>The queen turned and took a glance at the lavish coffin carried in the formation. She took a deep breath.</p><br/><p>\"... I am ready.\"</p><br/><p>With the sound of a buzz, the front gates opened.</p><br/><p>The rays of the sunset and the bustling crowd entered the queen’s sight. She couldn’t help but shiver. She remained quiet for a few seconds before touching her tummy and took steps to continue forward.</p><br/><p>The crowd outside the palace grew silent at the sight of the queen.</p><br/><p>\"... You-your Highness?\"</p><br/><p>Some of the officials and people recognized her.</p><br/><p>The queen paid no attention. The moment they laid sight on her, she held her head and crossed her arms. With a calm demeanor and a graceful bearing that a queen should possess, she quietly moved forward.</p><br/><p>The quiet crowd parted before her.</p><br/><p>The queen continued forward until she reached the center of the street where she stopped.</p><br/><p>A long formation that followed, was now apparent to the people.</p><br/><p>Within the formation, the most eye catching thing was that coffin.</p><br/><p>The people looked at the transparent coffin and saw the fresh flowers and \"sleeping beauty\" King within. Then, countless gasps were heard.</p><br/><p>\"Hi-his Majesty...\"</p><br/><p>The crowd that surrounded them, were suddenly like dominos, kneeling down from inner to outer circle, row by row. They heavily lowered their head and held their right fist over their chest. They were overcame with grief.</p><br/><p>The long street outside of the palace had never seen such tense atmosphere.</p><br/><p>Even if they received enough warning from the rumors but the truth of the death was set out in front of them, they were still struck with tremendous shock.</p><br/><p>It was then, the queen’s voice echoed through.</p><br/><p>\"Former Hesse Empire, the second prince of the old king, Francois Hesse. Our beloved His Majesty the King of Fereldan, has passed six days ago, on the lunar calendar year 9 at the beginning of September.\" She was suppressing great pain but her tone was clear, \"My husband... He protected our land and freedom, protected me and our daughter and in the end, died at 34 years old.\"</p><br/><p>Leaves rustled down. Immense sadness brewed within the crowd.</p><br/><p>There were some that started to cry.</p><br/><p>\"However, my husband did not die of sickness or the battle of our enemies, he died of treachery.\" The queen’s voice continued to echo, \"It is as you have heard, Aldrich, the president of the Mages Freemasonry, my husband’s most trusted servant, is in fact a spy from Icor. He killed the king, he killed the hero that built Fereldan, and wanted to destroy the peace that we fought for with our blood, sweat and tears.\"</p><br/><p>The two soldiers that held Aldrich moved him from the back of the pack and pushed him next to the coffin.</p><br/><p>Aldrich was bounded by the chains and dropped to the ground. He trembled helplessly under the gaze of the people.</p><br/><p>The people wiped their tears and looked at Aldrich. All kind of voices came from the crowd.</p><br/><p>\"The rumors... The rumors were true.\"</p><br/><p>\"How could this be? This is simply too awful... How could he do such a thing?\"</p><br/><p>\"Kill him! Kill this treacherous man!\"</p><br/><p>The queen turned and stared coldly at Aldrich. A glimpse of emotion flashed through her, it was more complicated than any vengeance.</p><br/><p>After a brief moment of silence, she gestured the crowd to quiet down.</p><br/><p>Once the surrounding people had simmered down, she spoke once again.</p><br/><p>\"Six days ago, he killed His Majesty and tried to take control of the palace. He intended to gift the entire land of Fereldan to Icor. Luckily, at such a critical juncture, perhaps the gods have not abandoned us, a friend found out and stopped his act before it became a bigger tragedy.\"</p><br/><p>She then extended her arm to the bishop in purple robe.</p><br/><p>\"Bishop Victor. He defeated Aldrich and stopped the traitor’s scheme and returned our country to us. If it weren’t for him, my daughter and I, as well as my unborn child, would be three cold corpses.\"</p><br/><p>The people looked at each other in disbelief.</p><br/><p>It was unclear then, if their disbelief was due to the fact that the Church has ‘rescued; their country or the fact that the queen was pregnant.</p><br/><p>The Bishop stood where he was and lowered his head without moving an inch.</p><br/><p>\"In the past, we have them misconstrued. But now, he has saved me and my babies’ life.\" The queen wiped her tears and choked, \"As a mother and wife, I cannot ignore this. Therefore, thank you, Bishop Victor. You have the freedom to preach in Fereldan. I can feel my husband’s wishes to make this decision. There will be no one who can question this.\"</p><br/><p>The Bishop took a step forward and placed his palms together devoutly.</p><br/><p>\"May the Lord protect your land.\"</p><br/><p>The crowed busted into an uproar.</p><br/><p>The ban on the Church was the historical oldest policy and they were used to it. But now the queen was in front of them, wiping away her tears. Aldrich the criminal and the Bishop who lent a hand were also standing right in front of them. Everything was so real that they couldn’t even begin to question.</p><br/><p>Therefore, no one objected.</p><br/><p>Even those officials who hated the Church were holding their tongue, not knowing what to say. Even if they did, they’d probably wouldn’t be able to.</p><br/><p>\"And now... The charges of murdering the king.\"</p><br/><p>The queen stood in front of Aldrich with a cold demeanor, \"The traitor, Aldrich who devised this entire scheme, as well as all his subordinate mages who betrayed the country, I, hereby as the Queen, sentence them to death.\"</p><br/><p>There was another uproar within the crowd.</p><br/><p>All his subordinate mages who betrayed the country….. That would mean...</p><br/><p>Just as the crowd stood gazing at one another, a large troop of soldiers marched out from the end of the street.</p><br/><p>The people turned to look.</p><br/><p>The soldiers slowly marched out. The troop’s numbers was colossal, with over a thousand of them. Within them were a few hundred criminals apprehended. The criminals were disheveled and disarrayed. Just as Aldrich, they were bounded by layers and layers of chains to disrupt the surrounding elements to prevent them from summoning magic.</p><br/><p>At closer look, there were people who could recognize that these criminals were members of the Mages Freemasonry that disappeared recently.</p><br/><p>The people were surprised by this.</p><br/><p>In the few days that the rumors were at its peak, the Mages Freemasonry branches in the nation had closed their doors. Based on the number of captives, it was around five or six hundred of them. It seemed that... the members of the freemasonry in the entire nation were here.</p><br/><p>They did not disappear. Instead, they were all captured.</p><br/><p>\"General Barrett, escort them to the north of the city for execution.\"</p><br/><p>The queen spoke with a clear and cold voice like an emasculated opera singer.</p><br/><p>General Barrett carried heavy footsteps and walked out. He expressionlessly bowed at her.</p><br/><p>\"Yes, Your Highness.\"</p><br/><p>The people couldn’t even react. However, the intensity of the atmosphere led them to clear a pathway. General Barrett led Aldrich and the thousand soldiers led the few hundred mages to the north of the city.</p><br/><p>They were traveling slowly. It took them more than an hour to reach their destination.</p><br/><p>The people of Snow City came one after another by word of mouth.</p><br/><p>Their destination was a piece of wasteland in the north of the city. The piece of wasteland was quite different from what they remembered.</p><br/><p>The ground that was supposed to be flat had a huge pothole.</p><br/><p>General Barrett stood in front of the pothole. He turned and nodded. Soon after, he pushed Aldrich into the hole.</p><br/><p>Someone within the crowd let out a scream. Perhaps... they were shocked at the thought of what was to come.</p><br/><p>The thousand soldiers behind the general received the orders and moved the mages to the front. One by one, the mages were pushed into the hole in front of everyone’s eyes.</p><br/><p>Next, a scene that burned itself into everyone’s eyes happened.</p><br/><p>The mages that were bounded by chain were almost at the verge of collapse from the walk. Once they dropped into the deep hole and saw Aldrich, they became crazy hungry bulls that saw red. They struggled up and charged at Aldrich.</p><br/><p>\"Why are you doing this to us? Why?\"</p><br/><p>Heart wrenching screams echoed through the pothole.</p><br/><p>The more mages that were shoved down the hole, the more chaotic it became in there. It wasn’t long until Aldrich was drowned in a pool of angry mages. It was like a caterpillar disappearing into a hill of ants.</p><br/><p>The people frowned and many couldn’t look.</p><br/><p>Despite being smushed, Aldrich was carrying an unexpected expression.</p><br/><p>He could feel the teeth biting into his flesh. He could feel the hatred of the mages. He could feel the pain of his bristled bones. But at that moment, his old wrinkly face shown a calm and sincere smile.</p><br/><p>He narrowed his eyes and looked up.</p><br/><p>The smell of burning fats filled his nostrils and sparks appeared within sight. The screams of the mages reverberated.</p><br/><p>\"Finally...\"</p><br/><p>He closed his eyes and was peaceful as if he obtained salvation.</p><br/>\n</div>"}