{"title": "Chapter 369: Coming To An Agreement With the Generals", "id": 369, "volume": 4, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-369-coming-to-an-agreement-with-the-generals", "volume_title": "Volume 4", "body": "<h1>Chapter 369: Coming To An Agreement With the Generals</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 369: Coming To An Agreement With the Generals</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>\"You’re saying…..the death of the King, is actually part of the Church’s conspiracy. The Mages’ Freemasonry were on the same side of the Church, and they controlled the royal family?\"</p><br/><p>Inside the wide tent, an extremely tall and well-built old man had his palms on the table, and was really worried, with a tone like a long siren, he asked.</p><br/><p>Benjamin stood in front of him and nodded.</p><br/><p>\"General Stewart, things are exactly as I said.\" He said confidently, \"Before this, the King had already suspected the Mages’ Freemasonry, and asked me to investigate them secretly. When I wanted to report to the King, he somehow fell into harm’s way, thus, I can say this with confidence.\"</p><br/><p>Hearing this, Stewart ‘humphed’ and said: \"You don’t have to explain so much, I’m not suspicious of your words.\"</p><br/><p>Benjamin’s eyes brightened: \"General, do you trust me?\"</p><br/><p>\"Who are you? Do I know you?\" Stewart shook his head and said, \"I’m not suspicious of your words, and that’s only because I know the Church, I know what kind of people are inside the Church.\"</p><br/><p>\"....\"</p><br/><p>This old man was really straightforward.</p><br/><p>\"General, the situation in the kingdom now is not that pleasant.\" Benjamin did not heed much, and continued advising, \"General Barrett has already become one of the Church’s men, and the other two generals are missing. Right now, half of Ferelden’s army is already in the Church’s hands, you must do something.\"</p><br/><p>Hearing this, Steward nodded but did not say anything.</p><br/><p>Benjamin saw this, and knew the opposition was still thinking, so he remained calm and did not say much.</p><br/><p>In this silence, suddenly, Stewart raised his head, like a grey bear that was hunting, he stared at Benjamin, suddenly saying: \"Are you from Helius?\"</p><br/><p>Benjamin was stunned.</p><br/><p>Stewart continued: \"Blonde hair, blue eyes, and shoulders thin like paper, a standard look of a citizen of Helius, and even possibly a noble. When I fought Helius at the Crusader Gateway, I have seen too many of this kind of people. Tell me, did you come from Helius?\"</p><br/><p>Benjamin was speechless.</p><br/><p>This…...he could tell?</p><br/><p>He should have disguised himself first.</p><br/><p>\"Right, you are absolutely correct, general, I come from Helius. \"But, under these circumstances, there is no point for me to pretend,\" Benjamin thought for a while and acknowledged.</p><br/><p>\"A fellow suddenly coming from Helius, advising me to go against the Church, maybe I should capture you for spying?\" Stewart scoffed coldly and said so.</p><br/><p>Saying that, he straightened his back, and his unusual tall height made him look like a mountain, plus his cold battle-hardened stare, it gave off a lot of pressure.</p><br/><p>He was pressuring Benjamin.</p><br/><p>The atmosphere became frozen.</p><br/><p>\"You can do that.\" Facing this kind of pressure, Benjamin laughed, and crossed his hands, \"I am a mage, I escaped from Helius, I am clearer than anyone about how frightening the Church’s existence is. General, you’ve fought against Helius so many times, you should understand.\"</p><br/><p>Stewart scoffed again but did not retort this time.</p><br/><p>Benjamin saw this and smirked.</p><br/><p>This is good….</p><br/><p>\"Ever since the kingdom split, with Icor in front, the people of Ferelden have forgotten how to be cautious of the Church. \"He continued, \"But the Church? The Church never rests, every second, every minute, they are thinking of how to make every country theirs.\"</p><br/><p>Stewart was silent for a while, and said: \"That bunch of madmen will always be like this, never knowing how to be grateful for what they have.\"</p><br/><p>Benjamin added: \"That’s right, but right now, their hands have already grabbed Ferelden. The King has passed on, and the Queen has lost her ability to retaliate, in the whole of Ferelden, who else can stand up? General, if you don’t do anything, this kingdom will be ruined!\"</p><br/><p>He thought of everything to force the other person to take heed, as if without him, the kingdom would die out soon. Finally, on Stewart’s scowling face, there was a slight hint of a smile.</p><br/><p>\"You’re right.\" He nodded, and said, \"The people in the country have become too complacent, only people like you that escaped from Helius knows how scary those madmen are.\"</p><br/><p>Benjamin was elated, and asked investigatively: \"So, this means you are willing to stand up against the Church?\"</p><br/><p>Stewart shook his head.</p><br/><p>\"It won’t be that simple.\" He crossed his arms, and said,\" If I openly speak out against the Church, they would put all sorts of hats on me, then with the troops ordered by the Queen, they would use them to fight me. Don’t look at how much men I have, once something happens, the capital would stop their supplies, and the lot of us would starve to death here.\"</p><br/><p>Benjamin raised his eyebrows: \"You mean…..\"</p><br/><p>Stewart laughed, and said: \"You came from so far away, you should have your own plan right? I don’t need much, if you could do something to distract the Church and their troops, I can send my men to take over the city of Louis at the west. With this, I can have the capability to openly speak out against the Church.\"</p><br/><p>Benjamin heard this, nodded, and said: \"I see, rest assured general, two months later, Rayleigh will attract their attention.\"</p><br/><p>If it was a distraction, he could do it without any problems.</p><br/><p>Plus, in his original plan, with the ‘Freedom of Promoting Magic’ in circulation, and the conflicts rising between the Church and the mages, he could muster more mages under him....with accumulation, after two months, he planned to start something in Rayleigh.</p><br/><p>He could not keep hiding.</p><br/><p>A crying child would be fed milk. If he wanted the freedom of speech for governance, he could not just remain silent. The mages in Helius did not speak out, thus, they all ended up being associated with things like \"Fallen Ones\" and \"Demonic Energy\", ending up in their current state.</p><br/><p>Of course, at the same time when he started something, he could still help Stewart, giving this general a chance to stand out, raising the flag of \"Fighting the Church\", forming an military force of some sort, it was like killing two birds with one stone.</p><br/><p>In simple words, the Church wanted to completely control Ferelden, so Benjamin had to cut in to change the forces involved.</p><br/><p>\"If you can do all of these, I will send my army to chase all of these madmen back to where they came from.\"</p><br/><p>With this, after visiting the three generals, Benjamin finally found a suitable candidate. He made a deal with Stewart, turned around, and left the tent.</p><br/><p>\"What’s the verdict?\"</p><br/><p>Lance was waiting outside, when he saw Benjamin finally come out, he asked.</p><br/><p>\"Not bad.\" Benjamin smiled, raised his head, and looked at the cloudy sky of Ferelden, saying to himself, \"At least…...in Ferelden, the Church will not have any peaceful days.\"</p><br/>\n</div>"}