{"title": "Chapter 378: The Secluded Mages", "id": 378, "volume": 4, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-378-the-secluded-mages", "volume_title": "Volume 4", "body": "<h1>Chapter 378: The Secluded Mages</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 378: The Secluded Mages</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Benjamin held on to the familiar booklet. The pages looked brand new, and there were not much traces of it being flipped open or read. This booklet was one of the copies of \"The Declaration of the Freedom of Magic\" that he personally inspected in the printing factory he supervised one month ago.</p><br/><p>He could not help himself but ask, \"Why would you have this?\"</p><br/><p>\"As a favor, I asked a friend to investigate the matter of the outside world when the priests started to trickle into the Desert City,\" the wheelchair-bound man said as he shook his head, \"He brought this back as a result.\"</p><br/><p>Benjamin nodded, quite surprised by the news. This book must have been well-received among the mages for it to make its way to the hands of the secluded mages in the Eastern Desert!</p><br/><p>\"This proves that there is an audience for my thoughts,\" replied Benjamin as he threw the booklet back to the man, \"Not all mages are like you, willing to stay put in this abandoned desert and only cower in fear when the church is right outside our door.\"</p><br/><p>\"You could hurl as much verbal abuse at me as you want, but how dare you to include the fabrication drawings for two magical instruments within the book,\" snarled the man, his fists curling and uncurling, \"Do you know what will happen if the church finds this book?\"</p><br/><p>\"What else?\" Benjamin shrugged. \"Hunt every mage that they ever laid eyes on? Isn’t that what they’ve been doing all along?\"</p><br/><p>He could not comprehend the man’s fear. The aim of the church was eternal. Even if the mages stopped rebelling, they would never stop their massacre towards them. Since magic is a natural born talent for mages, there would always be people who would have their powers awakened in the next generation, no matter how hard the church tries to annihilate the mages of this generation. Even if no spells were left on the surface of this world, there would still be people who could instinctively summon sparks of fire and water droplets in the future. Till then, they would also stand up and fight for their rights against this oppressive system.</p><br/><p>All Benjamin was doing was just executing the things that all mages’ instincts would drive them to do.</p><br/><p>\"At least, there would be those who would survive,\" the man murmured slowly with his eyes closed, \"You may think that it is unhonorable to live this way, but at least it would be better to be alive than dead.\"</p><br/><p>\"Why are you being such a pessimist?\" Benjamin was genuinely curious. \"Why do you seem so confident that our movement will fail? Is there really no way for us to join forces, and get the church out of Ferelden’s doors completely?\"</p><br/><p>\"Impossible.\" He shook his head.</p><br/><p>\"On what basis do you make your judgment upon?\" Benjamin spread his hands in question.</p><br/><p>\"That’s because I’ve attempted it before!\" The wheelchair-bound man finally had an outburst after he took a deep breath. He tried to suppress his quaking emotions as he forced out his words. \"Initially, when I learned the art of making magical instruments without the permission of the church and decided to betray them, I did just as much as you did. I contacted every single trustworthy mage, spread anti-church propaganda among the people, sabotaged the church from the inside…. Do you really think I have not fought before? I tried everything, but look where I ended up today.\"</p><br/><p>As he spoke, he took another book from the racks. It was quite thin, and he threw it towards Benjamin.</p><br/><p>Benjamin caught it with a frown, then read it. On the book was etched - The Holy Bible.</p><br/><p>He was stunned. With a questioning heart, he flipped open this ‘Holy Bible’, and was surprised to find that it was identical to the first magical book he obtained back in the Kingdom of Helius.</p><br/><p>\"When this book has lost its value to you, please gift it to those who need it. There is a need for the truth to be preserved.\" He instinctively recited the first sentence written on the flyleaf.</p><br/><p>The wheelchair-bound man laughed at himself, \"Don’t read it. I don’t even know what emotions overtook me at that time for me to write something like that.\"</p><br/><p>\"You wrote this book?\" Benjamin lifted his chin, unconvinced.</p><br/><p>\"Who else would it be?\" The man turned his face to the side, his voice filled with self-contempt. \"Those folks in the Silence Academy have long lost the fight within them as time passed. I was the only one who did such idiotic things like this, with no fear of the dangers before me.\"</p><br/><p>\"This is not idiotic,\" Benjamin argued as he closed the book, \"There was nothing more meaningful than this. At places like the Kingdom of Helius, it’s this book of yours that allowed magic and the truth to be passed on to the next generation.\"</p><br/><p>\"How many then died horrifically under the chase of the church?\" The man’s question was laced with ice.</p><br/><p>\"Then, at least they died with their eyes open.\"</p><br/><p>The man shook his head. \"You’re unbelievable.\"</p><br/><p>Just as Benjamin wanted to retaliate, a voice suddenly spoke from behind him.</p><br/><p>\"Stop being so hardheaded. Maybe…. Maybe this young man is right.\"</p><br/><p>Benjamin spun around in shock. The door behind him was opened wide, but he had no idea when that happened. Men, women, old, and young; all of the mages he had never met before walked in and crowded by the door. Within just moments, it reached a scale that looked as if they were preparing to take a group photo.</p><br/><p>Benjamin’s heart was inches away from leaping out of his throat. Are these…. Are these the mages who have lived in seclusion in the barren desert?</p><br/><p>A brief count revealed that there were approximately 30 mages standing before him. All of a sudden, they raised their hands, and on their palms were black booklets that looked incredibly familiar. A blue, triangular symbol was etched on the cover of the book, and below it was a precise and strong title - The Declaration of the Freedom of Magic.</p><br/><p>At that moment, all of the mages held The Declaration of the Freedom of Magic tightly in their hands, while they gazed at the wheelchair-bound man in silence. The scene looked like a black-and-white picture immortalized within the history books, emanating an air of solemn and respect.</p><br/><p>Benjamin froze, and so did the man.</p><br/><p>\"All of you…. All of you read the book?\"</p><br/><p>The leading mage nodded, \"Yeah. Although you said not spread this to the others, Ian stumbled upon the book when he was out. Soon, this book managed to spread around in the desert. There was no way you could’ve stopped this.\"</p><br/><p>The man could only heave a long-suffering sigh on his wheelchair.</p><br/><p>\"Ian, that man. He was always the one who brought problems back home despite his claims that he never left here,\" he shook his head.</p><br/><p>Instead, the leading mage glanced at the book in his hand. \"I don’t think he brought a problem home this time though. Besides, this book is much finer than the one you made all those years ago. The layout is reasonable too. Look, they even included in-page illustrations!\"</p><br/><p>The man held his forehead in his palm, speechless.</p><br/><p>Meanwhile, Benjamin stared at these mages who seemed to have appeared out of thin air. His eyes were wide as saucers, lit with surprise and delight.</p><br/><p>\"You….\"</p><br/><p>The mages looked at Benjamin and nodded collectively.</p><br/><p>\"All of us here have read the book you wrote. It was beautifully written,\" said the leading mage, \"although I initially picked up the book specifically for the Law of Meditation, I stayed for your words. The descriptions of your experiences in the Kingdom of Helius shook us to the core.\"</p><br/><p>Benjamin took a deep breath. He was lost for words, lost in the overwhelming flattery.</p><br/><p>When he was writing this book, he was very worried that it would never be spread, or that the mages would only be interested with the information the book provided but proceeded to ignore the anti-church ideology within. That was why he included the massacre in the Fulner’s Coliseum - in hopes of raising their alertness towards the predicament they were in now.</p><br/><p>Looking back, his efforts did not go to waste. He was suddenly moved.</p><br/><p>Spells, the Law of Meditation, prescriptions…. These things attracted the mages to read the book, but because the mages could relate to the stories that were written, that led them to understand the meaning behind this seemingly boastful title.</p><br/><p>\"Also, there’s this sentence. I loved this sentence, I even carved it into the wall of my house.\" Another mage hugged the book like a child with his beloved comics. He recited solemnly as he flipped and stopped at a page. \"F*ck the missionaries, let’s let the church and their bullsh*t God go to h*ll!\"</p><br/><p>Benjamin burst out into laughter. That sentence was added under the sincere demand of the old blacksmith. At first, Benjamin felt that it was too rude and voted against it. But in hindsight, that sentence was quite…. Effective, huh?</p><br/>\n</div>"}