{"title": "Chapter 388: Technology Tree of Magic Tools", "id": 388, "volume": 4, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-388-technology-tree-of-magic-tools", "volume_title": "Volume 4", "body": "<h1>Chapter 388: Technology Tree of Magic Tools</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 388: Technology Tree of Magic Tools</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Benjamin went all over Fereldan.</p><br/><p>It wasn’t just Landt City, everywhere with mage activity would see the emergence of miniature retaliation groups. Like Aiden and Norman, they looked up to Benjamin as a coach and hoped to one day join the major leagues.</p><br/><p>In just half a month, the network of underground retaliation groups started to cover Fereldan like a spider web.</p><br/><p>The elder mages under Benjamin acted as contacts in every city; they gathered a list of members which they would then hand over to Benjamin. To avoid the list from being leaked, only higher ranked members had access to it. Once the name list was saved in the System’s database, the physical copy would be destroyed.</p><br/><p>The System helped clean up the list. It recited every member’s name, information and magic proficiency and even came up with a new organizing format for easier management.</p><br/><p>\"Congratulations, you are now the leader of Fereldan’s biggest mage community. You have a total of four hundred and thirty-seven mages spread out over thirty-two cities.\" The System reported.</p><br/><p>\"It’s not that simple.\" Benjamin shook his head in disagreement, \"Out of all these people, I don’t how many will remain loyal. I can instruct them now, sure. However, once there really is a conflict, I don’t know how many of them will stay and fight.\"</p><br/><p>They gathered together because of their shared hate for the Church, not because of their trust in Benjamin’s abilities. If there was a shift in circumstance, everything could collapse.</p><br/><p>Even if they had over four hundred members, there was still a long way to go before they could defeat the Church.</p><br/><p>These days, the Church was slowly sending priests out again to continue their evangelism. Except for this time, they were doing so cautiously. Their homes were guarded 24/7 to prevent any further assassinations and they no longer preached to just anyone, but chose their targets cautiously, making sure not to interact with any mages.</p><br/><p>It seemed that they were scared, but Benjamin was having a tough time due to their precautions. His contacts have already relayed his orders to disrupt the priests’ preaching, but the Church was being too careful. They couldn’t outright expose themselves, so their choice of actions was extremely limited.</p><br/><p>Hence, he did not place his focus on the Church but instead worked hard on improving himself.</p><br/><p>\"About the magic tool that can communicate over long distances, can you do it?\"</p><br/><p>Back in the Desert City, he asked Morris at the residence of the castellan.</p><br/><p>Morris had already gathered the hermit and desert mages to join Benjamin’s team. Although not all the hermit mages were convinced, eighty of them was already a high enough number and would greatly improve the team’s firepower.</p><br/><p>And so, Benjamin left all matters relating to the desert city to Morris. He would be in charge of spotting those with talent amongst the commoners and help nurture them into mages; at the same time, he could help Benjamin with the creation of magic tools.</p><br/><p>The organization was just starting to take form and right now they communicated via snail mail -which was by no means an ideal method in terms of efficiency or security. Even other underground group used the telegram. Benjamin recalled the marble that the Church used for communication and enquired about the possibility of using it with Morris.</p><br/><p>\"You’re referring to the Eye of God.\" Morris replied, \"It can send video and voice messages but is a single use item and its range is only a couple of kilometers. It would be impossible to use it to connect the whole of Fereldan.</p><br/><p>Benjamin felt slightly disappointed.</p><br/><p>So, the Church’s technology wasn’t as advanced as he thought.</p><br/><p>\"So… are there any alternatives?\" He inquired again, \"It need not have any graphics, just sound with a large coverage and the ability to transmit within half a day.\"</p><br/><p>He didn't need Weibo’s real-time video call, a simplified telegram would do.</p><br/><p>\"It’s doable.\" Morris finally nodded his head, \"It’s a magic tool referred to as the \"Echo of God\" by the Church. Actually, the Church is currently using it to communicate across long distances.\"</p><br/><p>Benjamin slammed his hands on the table.</p><br/><p>\"That’s it! Just make as much as you can. Don’t worry about and the materials, I’ll make sure you get them.\"</p><br/><p>You have got to be kidding me. If the Church was using it, how could they not take advantage of the technology too?</p><br/><p>Morris nodded in agreement.</p><br/><p>\"Oh, right… from your understanding of the Church’s technology in magic tools, what other of their magic tools could we possibly utilize as well?\" Benjamin asked.</p><br/><p>Benjamin was going to fully exploit the fact that they finally had a techie on their side.</p><br/><p>Benjamin had originally gotten people to produce tons of paper and books, hoping to draw the attention of some highly skilled mages. Consequently, it has gathered plenty of logistic mages in the Desert City. This little city was going to be his logistics base.</p><br/><p>However, to depend on such a small place to provide such a large amount of talent would be a wishful thinking.</p><br/><p>He had to rely on Morris’ spare time if he hoped to get any more magic tools.</p><br/><p>\"A lot. But right now, I have too much on my plate.\" Morris raised his arms as a sign of surrender, \"If we have enough people and materials, I could equip all of you with the automatic survival tool, the quicken flight tool, magic oscillation coverage sensing tool, multiplying Spiritual Energy tool, and many, many more. But under current circumstance, we better be selective with our resources.\"</p><br/><p>\"Then let’s focus on the communication for now.\" Benjamin said disappointedly, \"However, get me one of those quicken flight magic tools as well. I need it urgently.\"</p><br/><p>It wasn’t that he was dissatisfied with his speed, but he was now this organization’s leader and was constantly rushing around Fereldan to meet people, obtain information, analyze different situations and settle disputes.</p><br/><p>Therefore, decreasing his travel time was of the utmost importance.</p><br/><p>\"I already have one ready. Here, take it.\" Morris took out a pitch-black piece of wood and handed it over to Benjamin.</p><br/><p>Benjamin took it and immediately felt the wind circulating around him; he felt as if he was twenty kilos lighter.</p><br/><p>\"Thanks.\" He made a mock salute and smiled.</p><br/><p>\"Don’t thank me, it’s my job.\" Morris shook his head. He looked at Benjamin for a while and suddenly sighed, \"Do you know, in the beginning, I originally thought that you just persevered and hoped for the best to get to where you are now. But ever since I joined you, I realized that you’re actually extremely bright.\"</p><br/><p>\"Oh really?\" Benjamin almost blushed.</p><br/><p>\"Yeah.\" Morris nodded, \"Most people would be lost at the beginning, and slowly find their way. But you… You have already laid out a complete plan and even paid attention to minor details as if you have done it all before.\"</p><br/><p>Benjamin smiled without saying anything.</p><br/><p>But in him.</p><br/><p>…No, he learned it all from history class.</p><br/><p>At that moment, he realized that as a time traveler, his strongest asset wasn't that playful and cynical System, but the outlook he perceived through modern education.</p><br/><p>As well as the thick skin that he developed over time.</p><br/>\n</div>"}