{"title": "Chapter 395: A Dream or Reality?", "id": 395, "volume": 4, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-395-a-dream-or-reality", "volume_title": "Volume 4", "body": "<h1>Chapter 395: A Dream or Reality?</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 395: A Dream or Reality?</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Benjamin was confused.</p><br/><p>\"Hmm...\"</p><br/><p>He shook his head to make sure he was completely awake. It seems he had already left both the pure blue space and the dimension of consciousness.</p><br/><p>What the hell?</p><br/><p>\"Hey System, where you at? What happened?\" He quickly asked in his heart.</p><br/><p>\"...What?\" The System answered with an ignorant tone, \"Nothing happened. You just sat there idly in the dimension of consciousness for a while before returning to reality. Why all the fuss?\"</p><br/><p>Benjamin was stunned.</p><br/><p>Then he remembered: The System did say it that could not access its memory bank. Thus, whatever happened in the pure blue space had not been saved and did not technically exist in the System’s memories.</p><br/><p>How disappointing.</p><br/><p>Benjamin then explained everything to the System from head-to-toe. After hearing everything, the System answered sheepishly, \"It’s not my fault I can’t connect to my database, right?\"</p><br/><p>Benjamin felt restless but there was nothing he could do.</p><br/><p>\"Well... can you bring me to the pure blue space again?\" He asked.</p><br/><p>\"How would I do that?\" The System replied curiously.</p><br/><p>\"You’re kidding.\"</p><br/><p>\"...\"</p><br/><p>Benjamin’s heart sank like a rock. All his expectations of using the omnipresent view were destroyed the second he heard the System say this.</p><br/><p>What a great killjoy.</p><br/><p>\"Don’t be too disappointed. From what I can tell, it definitely has something to do with my cytokinesis.\" The System advised, \"Let me try doing it again, maybe the incident will repeat itself.\"</p><br/><p>\"...You can split at will?\"</p><br/><p>\"I think so. I’m still absorbing water elemental energy, so I think I may be able to split again.\"</p><br/><p>Hearing this, Benjamin took a deep breath.</p><br/><p>Even though he wasn’t convinced, but the idea of the System being able to split at will upset him.</p><br/><p>If it continued splitting, what will the dimension of consciousness eventually turn into? Benjamin dreaded the thought.</p><br/><p>The omnipresent view was powerful, but he should be able to defeat the bishop even without it.</p><br/><p>Thinking of this, he suddenly remembered that he was casting the Icebreaking Spell right before he returned to reality. Could the icebreaking spell have been… successfully cast?</p><br/><p>What happened to the bishop?</p><br/><p>Benjamin was desperate to check on the bishop; Only then could he be sure that everything that had happened in the pure blue space was real and not just some made-up memory.</p><br/><p>But going near the palace would be dangerous. After a while, Benjamin thought of another way to confirm its effects.</p><br/><p>He recalled that the System had told him earlier that there were a few priests disguised as civilians staying in an inn to the north of the city. To check the System’s reliability, he could simply check if these people were indeed there.</p><br/><p>With this, he disguised himself and left the inn, heading north. It was already nighttime, but there were still a lot of people on the streets; he blended into the crowd so as to not draw any attention.</p><br/><p>Half an hour later, he reached his destination.</p><br/><p>\"Looks like it’s real.\"</p><br/><p>Under the veil of darkness, Benjamin stuck to the wall and used the water elemental sensing technique to sweep the inn. He quickly noticed a few so-called \"merchants\" that had crosses hidden in their pockets.</p><br/><p>So, everything the System said was true…</p><br/><p>In the pure blue space, the System could see everything and was not limited by the laws of physics. That was pretty damn amazing.</p><br/><p>But now was not the time to marvel - the Church’s spies were in front of him, he had to deal with them first.</p><br/><p>Benjamin walked directly into the inn and climbed the stairs to arrive at the room the priests were in. He stopped in front of the door and knocked on it.</p><br/><p>After a while, a voice called out from inside, \"Who’s there?\"</p><br/><p>Benjamin answered, \"Sir, your blankets are old, we are here to change them for you.\"</p><br/><p>With the water particle sensing technique, he could see the look of suspicion on the priest’s faces. But, after the priest walked over to the bed and touched the blankets, he was clearly disgusted and proceeded to open the door to let Benjamin in.</p><br/><p>However, as soon as he unlocked it, Benjamin barged inward, closing the door behind him.</p><br/><p>\"Who… who are you? You’re not one of the innkeepers!\"</p><br/><p>The priests were stunned. But, they quickly returned to their senses and stared at Benjamin cautiously.</p><br/><p>Benjamin smirked.</p><br/><p>\"Me? I’m the person you are all looking for.\"</p><br/><p>One of the priests yelped in shock. In response, the others turned around and noticed that the walls of the room were already frozen over. The room was now an airtight refrigerator, which no one could escape from. A cold chill swept over them as they felt the temperature drop; before long, they were all shivering.</p><br/><p>But the cold was the least of their worries.</p><br/><p>\"You… you’re their leader! You’re Benjamin!\"</p><br/><p>They stared at him in a panic, as if staring at Satan himself. Their eyes were frenzied as their eyes dilated in fear.</p><br/><p>\"What are you all afraid of? Did you not come looking me? Look, I’m here now, so you should all be happy.\"</p><br/><p>Benjamin saw this and smiled cruelly.</p><br/><p>He realized that his killing spree had spread fear within the church. Although these people had come searching for him, the sight of him had scared them shitless.</p><br/><p>\"Don’t get cocky!\" One of the priests stared at him and grit his teeth, \"God has seen all your crimes. One day you will receive judgment!\"</p><br/><p>\"Hmm… if you really believe in your God that much, why are you shuddering?\"</p><br/><p>\"What… what nonsense! God will not forsake us! Even if we die by your hands today, we will receive our rewards in the afterlife. You... you have already been abandoned by God and will receive no such treatment come to end times!\"</p><br/><p>The priests shuddered uncontrollably as he said. They were obviously putting on a false bravado and Benjamin felt sorry for them. He shook his head helplessly.</p><br/><p>When will the Church stop it with their arrogance?</p><br/><p>Oh well, there was no point entertaining them – he might as well get rid of them quickly. He was getting quite sick of these repetitive conversations.</p><br/><p>He was much more concerned as to what had happened to the bishop.</p><br/><p>Thus, with a clap of his hands, the four hopeless priests were frozen solid.</p><br/>\n</div>"}