{"title": "Chapter 392: The Horror of Being Dominated by Advertisements", "id": 392, "volume": 4, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-392-the-horror-of-being-dominated-by-advertisements", "volume_title": "Volume 4", "body": "<h1>Chapter 392: The Horror of Being Dominated by Advertisements</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 392: The Horror of Being Dominated by Advertisements</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>The newspaper incident had become popular.</p><br/><p>The people thought they had heard the last of it after the first large-scale search. But no one expected The Free Mage to have seemingly grown wings and flown into thousands of homes that same night.</p><br/><p>\"This... this is...\"</p><br/><p>Victor stood on the balcony of the palace and looked out.</p><br/><p>He could only see that nightmarish newspaper everywhere on the streets. From the market to the parks, from the main road to the alleyways, The Free Mages was like moss that had tunneled its way out of tiles and in just one night, covered every corner of the city of Snow.</p><br/><p>It was only about six in the morning, but tons of people had already gathered and were now discussing the newspaper. The light of dawn just starter to shine over their heads, signaling the start of a new day.</p><br/><p>The bishop stood on the balcony, his fists clenched tightly. His face was twisted up in disgust.</p><br/><p>\"Quick, get rid of all of them. Quick!\"</p><br/><p>He did not expect that the wretched kid could escalate things to this point.</p><br/><p>The city of Snow had night patrols, but because of the large-scale search-and-destroy, many of them have yet to return. But still… the whole city was filled with this printed filth.</p><br/><p>How did he do it overnight?</p><br/><p>The bishop took in a deep breath and calmed himself down.</p><br/><p>He could see the holy knights and soldiers start mobilizing; they started circling the streets and cleaning up the newspapers. Other soldiers went to scatter the people gathered together to stop their discussion.</p><br/><p>Yes... he did not have the need to be angry.</p><br/><p>Soon, Snow would be as pure and clean as before. As for those who had already seen the news... all of them were just normal citizens, even if they were in a frenzy now, over time, other things will start to divert their attention.</p><br/><p>He did not need to worry.</p><br/><p>Ferelden’s army belonged to God, no one could stop them.</p><br/><p>As long as the final result was acceptable, the Pope of Havenwright and the bishop of Saint Peter’s Cathedral would not criticize him for small mistakes.</p><br/><p>He would be known as the person that conquered Ferelden for the Church.</p><br/><p>He was happily gloating to himself when suddenly.</p><br/><p>\"Lord Bishop, the newspapers... the newspapers can’t be gotten rid of!\" A holy knight pushed the door open, bowed, and said this with a troubled face.</p><br/><p>\"Can’t be gotten rid of? Why not?\" The bishop turned around and frowned.</p><br/><p>\"Those news has been plastered on with special glue. It is stuck on extremely tight - even after using great force for more than ten minutes straight, we only successfully tore a few strips off. It’s impossible to remove the whole thing.\"</p><br/><p>The bishop heard this and closed his eyes, taking in a deep breath.</p><br/><p>\"Lord… lord bishop?\" The holy knight saw this and asked timidly.</p><br/><p>\"If ten minutes is not enough, then do it for ten hours.\" The bishop opened his eyes and spat at him angrily \"If your hands can’t do it, then use your swords to grind it off.\"</p><br/><p>\"Lord Bishop, we...\"</p><br/><p>\"Do I really need to teach you everything? Have you forgotten God’s glory? \"The bishop seemed to be burning in anger, he slammed the table and shouted, \"GO NOW! If Snow is not cleaned by the end of the day, you can bet you will not survive to see tomorrow!\"</p><br/><p>The holy knight bowed and quickly ran off.</p><br/><p>The bishop leaned on the wall, put his hands together, and took in a few deep breaths.</p><br/><p>Relax. All of them are just worthless fools, they will not affect the Church. If the lad thinks this will stop the Church from seizing Fereldan, then he is too naive.</p><br/><p>God will defeat him and end this matter soon enough.</p><br/><p>Thinking of this, he turned around and looked out the window. It was seven in the morning, and the sun was just rising. Groups of soldiers swarmed the streets and started using their longswords to scrape away at the newspapers. The people were chased back into their houses and hid inside, afraid to observe.</p><br/><p>This dawn belonged to them. He was confident in his abilities.</p><br/><p>But suddenly.</p><br/><p>\"Lord Bishop, something has happened!\"</p><br/><p>\"...\"</p><br/><p>Even more stuff?</p><br/><p>At that moment, the bishop exploded like a barrel of gunpowder. He was so enraged that he almost throws a bolt of light after turning around.</p><br/><p>\"What are you shouting for? If something has happened, then solve it yourselves! Did I not say not to come see me unless Snow was clean?\"</p><br/><p>\"No, no... Lord Bishop, there... something important really has happened.\" The messenger was shocked and stuttered non-stop as he spoke.</p><br/><p>The bishop wanted to give him a slap across the cheek.</p><br/><p>But, after looking closely, he noticed that it was a priest talking to him now, and not the holy knight from before.</p><br/><p>The bishop was stunned, he was incredibly embarrassed. At that moment, he realized he was venting at the wrong person, he could only close his eyes and take in a few deep breathes to calm himself down yet again.</p><br/><p>Never mind, do not get angry. Everything... everything was God testing his will.</p><br/><p>\"If I can pass this trial, everything will become better.\" He said as he comforted himself.</p><br/><p>But, because of chain events of shock, he probably became mentally unstable temporarily. He closed his eyes for a moment, and slowly regained his logic, opened his eyes, and looked at the other person calmly.</p><br/><p>\"Alright, what happened?\"</p><br/><p>The priest saw this and hesitated, before weakly saying, \"Every officer in the country seems to have been delivered the newspaper - almost every single one of their houses received one. A few officers still loyal to us reported this news to us just a moment ago, I doubt it is false.\"</p><br/><p>\"...\"</p><br/><p>The priest did not seem to have noticed the bishop’s change of expression, and continued, \"This issue can actually be solved by repeating yesterday’s methods. I actually just came to ask you that since most of our people are busy cleaning the streets, if we wanted to send people to confiscate the newspapers, how many should we send?\"</p><br/><p>\"...\"</p><br/><p>\"Lord Bishop? What should we do?\"</p><br/><p>\"...\"</p><br/><p>\"Lord Bishop, you should decide how to distribute our men, it’s too large a matter for me to decide on my own.\"</p><br/><p>\"...\"</p><br/><p>\"Lord Bishop? What’s wrong? Lord Bishop! Say something!\"</p><br/><p>Due to the long silence, the priest could sense something was not right.</p><br/><p>He panicked and called out worriedly while slowly approaching the bishop. But Bishop Victor was like a statue, he did not move and remained motionless beside the window, his eyes were empty, not knowing what he was looking at, the priest was rather afraid.</p><br/><p>What happened?</p><br/><p>\"Lord Bishop?\" After getting nearer, he called out again, this time quietly.</p><br/><p>Then he saw the bishop’s lips move, and he heard his voice incredibly softly.</p><br/><p>\"...Leave.\"</p><br/><p>\"Huh?\" The priest was stunned.</p><br/><p>\"Leave.\" Finally, the bishop moved again and breathed out deeply, his voice trembling with rage, \"Let me calm down. I will settle these matters momentarily.\"</p><br/><p>The priest heard this and still stared at the bishop, who still seemed weird, but nodded.</p><br/><p>\"Alright, I shall take my leave.\"</p><br/><p>After saying this, he turned around and left.</p><br/><p>As he left the room, he made sure to silently close the door.</p><br/><p>According to the maids in the palace, the sound of explosions was heard inside the bishop's room, followed by the howling of unknown beasts. They were all terrified beyond belief.</p><br/>\n</div>"}