{"title": "Chapter 405: Fire Drenched Phoenix", "id": 405, "volume": 5, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-405-fire-drenched-phoenix", "volume_title": "Volume 5", "body": "<h1>Chapter 405: Fire Drenched Phoenix</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 405: Fire Drenched Phoenix</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>At the sight of this, Benjamin’s heart sank.</p><br/><p>... In for a big move?</p><br/><p>However, those soldiers who were blessed were almost on them and they had to first take care of them.</p><br/><p>Luckily, they were just regular soldiers.</p><br/><p>With a wave of Benjamin’s arm, a raging water steam swept over and formed a large scale storm. The charging soldier’s footsteps were blown until they became considerably slower.</p><br/><p>Taking this opportunity, the other mages quickly turned the tables. Quagmire spell, freeze spell, binding spell... Long term battle experiences has made them coincidentally summon control type spells — methods that were the best for close range battle.</p><br/><p>One spell could not be used on a thousand soldiers but... what about one hundred spells?</p><br/><p>In the blink of an eye, the soldiers completely lost their will to advance. The distance from the bishop to Benjamin’s corner was a mere tens of meters but with the effect of countless mire spells, there was a muddy pathway stretching over almost a thousand meters. The soldiers stomped through it, braving the strong winds and bodies covered with ice and snow. Even with the blessing of the bishop, they could not move an inch.</p><br/><p>A large group of the soldiers were trapped there, struggling for their lives. The earlier military grandeur they possessed could no longer be found.</p><br/><p>Benjamin didn’t think that they could easily take care of these soldiers.</p><br/><p>\"Quick! Stop the bishop!\"</p><br/><p>An army of soldiers was disarmed. He immediately pointed at the bishop who was holding the chalice and ordered in a resounding voice.</p><br/><p>The mages understood Benjamin and started to cast thousands of fireballs for the third time. The fire balls passed through the soldiers who were trapped in the mud and went straight for the bishop.</p><br/><p>Only this time, if the bishop would like to use the holy wall to stop the fireballs, he had to put their trump card on hold.</p><br/><p>The bishop now has his eyes opened and stared at the soldiers furiously, as if he was uttering that they were a bunch of useless beings. His lips were still moving as he continue chanting but suddenly turned his head to eye signal the paladin that was stationed beside him.</p><br/><p>The paladin shook up for a bit.</p><br/><p>\"Your excellency... I-I understand now!\"</p><br/><p>At that moment, the paladin as if recalled something and reached his hand out to the heavy looking pouch on the waist of the bishop. He ripped the bag out without hesitation and took out a bunch of crosses.</p><br/><p>Facing an uncountable number of fireballs, he grabbed the bag and tossed the crosses out as if he was sprinkling rice.</p><br/><p>The mages behind Benjamin was flabbergasted beyond words.</p><br/><p>The crosses collided with the fireballs and started to break in to pieces, molding layers and layers of holy light screen, Under the attack of multiple fireballs, the screen would not survive one second. However, the paladin kept tossing crosses after crosses like it didn't cost a thing. Once a bag was empty, he reached into the bishop’s pockets and grabbed another bunch of crosses to toss out.</p><br/><p>The bishop, under the protection of unlimited crosses, closed his eyes once again and raised the chalice. He continued with his chants as if the sky ridden fireballs did not exist.</p><br/><p>In the end, over a thousand fire balls was just blocked by unlimited crosses the paladin had scattered.</p><br/><p>Benjamin could not even count just how many crosses was hurled.</p><br/><p>... Just how ridiculous was the bishop’s entitlement to survival tools?</p><br/><p>\"Don’t stop, continue with the fireball. He can’t keep this up!\"</p><br/><p>Though it was jaw dropping, he still gave out orders and managed to recover the attention of the mages who were taken aback. The mages summoned once again and ensured a steady flow of fireballs aimed at the bishop.</p><br/><p>It was quite simple. The survival tool in the pocket would be no more than a few hundred. If they kept launching the fire balls, no matter how rich the Church was, they will make them poor!</p><br/><p>However...</p><br/><p>\"That’s enough.\"</p><br/><p>The bishop suddenly opened his eyes and coldly made a statement. His voice that was amplified by the divine arts sounded like the music of heaven as it transmitted to their ears, \"Your time is up.\"</p><br/><p>Benjamin’s heart sank.</p><br/><p>... It is completed?</p><br/><p>It could be seen that the cup in the bishop’s hands was flickering and the faces of the priests went pale. A beam of light suddenly shoot to the heavens and towered into the clouds.</p><br/><p>The gloomy cloudy night sky was penetrated a hole by the beam. The sound of thunders roared the skies.</p><br/><p>A powerful force of magic oscillation proliferated.</p><br/><p>\"You guys are lucky to die by the Holy Sword.\"</p><br/><p>The bishop let out an expressionless smile and lifted the cup. The beam of light vanished and on top of the chalice was a long sword caught between spirit and substantial form, faintly floating in the air.</p><br/><p>It was a fairly large sword. Its body was green and white. It had carvings of an unknown language. The ancient magic oscillation circulate around this sword, as if... this sword has its own Spiritual Energy. It only took one glance and the mages felt that they were in a trance.</p><br/><p>Benjamin felt his throat dried up.</p><br/><p>So... this was the Church’s trump card?</p><br/><p>The bishop used his finger to knock the chalice and the long sword enlarged up to twenty meters in height. It was a grand sight and was emitting a holy sacred aura.</p><br/><p>The bishop then knocked on the side of the cup and the giant sword edged forward and its blade directly aimed at Benjamin.</p><br/><p>Benjamin felt suffocated as if something was eyeing him.</p><br/><p>His face went pale white.</p><br/><p>Fuck...</p><br/><p>This thing... there’s something fishy about this!</p><br/><p>However, he was not given any chance to think it through when the bishop revealed a cold smile and knocked the chalice for the third time.</p><br/><p>\"Prepare for judgement.\"</p><br/><p>As he said those words, the giant sword paused and then flew towards Benjamin.</p><br/><p>Benjamin felt his heart stop and his blood freeze. The giant sword was traveling at a slow speed yet he had an unstoppable and unavoidable feeling as if this sword was aimed at not his body but rather his soul.</p><br/><p>What... the hell was this thing?</p><br/><p>\"Teacher Benjamin!\"</p><br/><p>Just as Benjamin stood there unable to move, a voice was suddenly heard behind him and followed by a different but equally powerful magic oscillation.</p><br/><p>A sweep of the magic oscillation and Benjamin suddenly realized that he could move again.</p><br/><p>He then turned his head over to look.</p><br/><p>It was Joanna and the rest.</p><br/><p>Just then, they had finally completed their advanced level magic and three magic oscillation combined together to form a powerful disturbance. The giant sword’s intimidation against Benjamin was somehow broken free by this source of disturbance.</p><br/><p>Benjamin quickly leaped backwards.</p><br/><p>\"You’ve finally completed it!\"</p><br/><p>He went to the three with cries of excitement, bearing that daunting sense of near-death.</p><br/><p>\"Yes, Sir Benjamin.\" Tony threw him a smile, \"Just look at what we can do next.\"</p><br/><p>The three stretched their hands out and aimed at the giant sword which was descending slowly from the sky. In a moment, the temperature of the entire woods raised to almost ten over degrees like it was being roasted by the sun.</p><br/><p>The fire elements were surging back and forth, that there were even flames that uncontrollably ignited beside them.</p><br/><p>Benjamin took a deep breath as he watched.</p><br/><p>He was very well aware that the three knew the same fire magic — Fire drenched Phoenix. Therefore, Benjamin placed them to work together, knowing that if they summoned it together, its force would be terrifying under such complementing circumstances.</p><br/><p>This kind of advanced level magic, Benjamin had only seen it once in the desert city.</p><br/><p>The three unleashing it together... he couldn’t imagine what kind of sight it would be.</p><br/><p>In a flash, three white flames took form midair. It was beating rhythmically like three beating hearts. They saw no fear as they took on the descending giant sword. At the fourth beat of the \"heart\" flame, there was a large \"thump\" that came from it as if something knocked heard in the hearts of all.</p><br/><p>There were crackling sounds that came from the flame and the outer shell started to brittle and three pure phoenixes hatched through the white flame came flying out and like real living things, they took flight high land low. The temperature of the woods rose up once again.</p><br/>\n</div>"}