{"title": "Chapter 418: Meeting the First Batch of Locals", "id": 418, "volume": 5, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-418-meeting-the-first-batch-of-locals", "volume_title": "Volume 5", "body": "<h1>Chapter 418: Meeting the First Batch of Locals</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 418: Meeting the First Batch of Locals</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>The next day, Benjamin and his men left the town with the warm goodbyes from the resistance.</p><br/><p>It only took Benjamin fifteen minutes to change the resistance’s attitude from hostile to respectful. After that, they followed Benjamin’s advice to lock up the captives, locked down the town, forced the mayor to send fake messages to the City of Snow, prepare for the ambush…. The leader of the resistance even begged Benjamin to give him a crash course on toppling the government. Benjamin ended up speaking to him for close to an hour.</p><br/><p>To be honest, Benjamin struggled slightly with the request. He was not a master in revolutions of any sort, and this was not a matter that could be learned via theory alone. He could only satisfy the leader by utilizing the information he got from history and political books.</p><br/><p>Even so, the whole process went smoothly. The resistance was excited as if they had just discovered a whole new world. Even the mayor who was previously locked up was thankful to Benjamin; after all, he would have been long dead if not for Benjamin’s timely appearance.</p><br/><p>And to the ordinary civilians, Benjamin seemed like a hero who had stopped an uprising without spilling a single drop of blood. What a good guy!</p><br/><p>But Benjamin couldn’t care less about his image. They left the town at the break of dawn the next day and rushed towards Carretas.</p><br/><p>The borders were not far away and they managed to fly right past them in under a day.</p><br/><p>The soldiers from border control had been sent to different posts due to the chaotic political situation in Ferelden. Thus, when over a hundred mages flew over their heads, the guards below did not dare to speak, much less stop them.</p><br/><p>They entered Carretas just like that. The process was much smoother than they had expected. They flew for the better part of the day, and finally landed in a field just as the sun was setting. They set up camp to rest there for the night.</p><br/><p>\"Where’s the nearest city?\" Benjamin asked the System right as he finished setting up camp.</p><br/><p>\"If you’re talking about an actual city, you would need to fly straight for another day.\" answered the System, \"However, it seems quite a number of people live on these plains as nomads. There is a chance for you to bump into them.\"</p><br/><p>Benjamin looked slightly dejected. Before they went to Carretas, Benjamin bought some maps and books to familiarize himself with the place. They did not provide him with much information, though. Right now, he still did not know much about Carretas.</p><br/><p>After some thought, Benjamin ran out of his tent to find Tony.</p><br/><p>\"There’s a branch of the Mage Freemasonry here, right? Do you know what happened to it after Aldrich’s death?\"</p><br/><p>Tony shook his head. \"I left the Mage Freemasonry long ago, and have no idea about what happened to it after I left. However, I did hear that the Freemasonry’s influence here was quite weak and that the royals and mages did not actually acknowledge their presence here.\"</p><br/><p>Benjamin nodded as he listened.</p><br/><p>Benjamin believed that quite a ripple must have spread within the Carretas branch after Aldrich was exposed. However, he was not sure about whether the branches here were even under the church’s control. Maybe something else had happened to them?</p><br/><p>Also, how is the church doing here? To what extent did they expand their influence? Are they still spreading their influence, or have they already started secretly killing mages? Benjamin had no clue about these matters.</p><br/><p>He needed to get answers as soon as possible.</p><br/><p>\"Do you know any mages around here? Best if they have good connections,\" Benjamin asked Tony.</p><br/><p>Sadly, Tony shook his head again. \"After the separation of the Kingdom, the mages of Carretas rarely maintained contact with us. There are no rare materials in the region as well, so we don’t usually come here.\"</p><br/><p>Benjamin heaved an exasperated sigh. Although he didn’t want to, it looked like he had no choice but to get in touch with that legendary mercenary Miles. Although they were not friends, Miles had recommended Benjamin to come to Carretas before. At that time, Benjamin had refused his offer but since he was now in Carretas, Miles should take up his responsibility as a local, no?</p><br/><p>Still… Benjamin was unsure of whether Miles was friend or foe. But it wasn’t like he had other options anyway.</p><br/><p>After that, Benjamin returned to his camp and planned to sleep after a short meditation session. They still needed to continue their journey tomorrow.</p><br/><p>\"Sir Benjamin, there’s…. there’s a situation outside.\" Frank opened the flap of his tent just as Benjamin had started his meditation.</p><br/><p>Benjamin opened his eyes. He looked very annoyed.</p><br/><p>Another situation?</p><br/><p>He was speechless. Where was this all coming from? Couldn’t fate let them reach the city and join the mage's circle without any fuss?</p><br/><p>\".... Speak. What’s happening this time?\" He rubbed his forehead and spoke lethargically.</p><br/><p>\"A bunch of people suddenly showed up outside and look as though they want to tell us something.\" Frank said, \"I have no idea what’s going on either, but they look like locals.\"</p><br/><p>Locals? Benjamin frowned. Are they the nomads from the fields? But… Why would they request a meeting if they were just passing by?</p><br/><p>\"I’ll go and check it out.\" Benjamin nodded, still very puzzled by the whole thing. He followed Frank out of the camp and saw a small group of people on horseback a short distance away. There were approximately thirty of them, not much, and were mostly elders and children. They brought along tattered luggage and they looked disheveled. Actually, they looked less like nomads and more like refugees.</p><br/><p>The group of people stared at Benjamin as he walked toward them, their eyes bright with anticipation as if they really wanted to come near but were forced to maintain a distance. Benjamin approached them slowly.</p><br/><p>\"Who are you?\"</p><br/><p>They looked quite nervous. After some hesitation, they got down from their horses and a tall man in the front answered, \"Who…. We’re not bad people. We’re not… we’ve stayed around here for a very long time.\"</p><br/><p>... Local indigenous people, then.</p><br/><p>\"You have something to tell us?\" Benjamin asked, in a slightly impatient tone.</p><br/><p>He nodded before taking another peek at Benjamin’s camp. He looked quite shaken as he said, \"Oh, did you not bring a convoy? This will be problematic.\"</p><br/><p>\"Problematic? Why?\" Benjamin was even more bewildered. Why did he feel like there was going to be trouble?</p><br/><p>The man’s expressions looked exaggerated as he spoke, \"Are you not from around here? The Tide of Beasts is just around the corner, and those who are unable to defend themselves will be eaten alive!\"</p><br/>\n</div>"}