{"title": "Chapter 410: The Prime Minister's Reinvitation", "id": 410, "volume": 5, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-410-the-prime-ministers-reinvitation", "volume_title": "Volume 5", "body": "<h1>Chapter 410: The Prime Minister's Reinvitation</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 410: The Prime Minister's Reinvitation</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>\"Is the coronation ceremony ready?\"</p><br/><p>At this moment, in the throne room of the palace, General Stewart sat on the throne, his eyes swept over a few of the army officers, slowly saying with an arrogant tone.</p><br/><p>\"General, why the rush?\" The Prime Minister laughed and said, \"Ferelden is already yours. The government officials of most towns have joined under us because of my influence. The other few generals who are in foreign lands are rushing back to Snow. They have quite a number of soldiers with them, we have to put in some effort.\"</p><br/><p>Hearing this, Stewart raised his eyebrows and said: \"Generals…..huh?\"</p><br/><p>The Prime Minister quickly answered: \"Those other generals are not the same as one. Once the coronation is complete, no one will address you by the title of ‘general’ anymore.</p><br/><p>Stewart was silent for a while, and nodded, not requesting for anything special.</p><br/><p>\"....What about the mage Benjamin? Were you able to contact him?\" He thought, and asked.</p><br/><p>\"I’ve already sent out the letter. But, if he does not wish to be involved with us, there is nothing I can do. \"The Prime Minister slowly said, \"but, I’ve already sent people to check out Black Rock Valley, a great battle indeed took place there, there are fragments of priest clothing and soldiers. Whether Bishop Victor is dead or not, he must have been set back by a lot.\"</p><br/><p>Stewart nodded but did not seem happy.</p><br/><p>\"I do not want just to set him back. Find that mage, I want to make sure that the bishop is really dead, then I can claim this throne.\"</p><br/><p>The Prime Minister nodded heavily: \"I will try my best.\"</p><br/><p>Hearing this, Stewart waved his hand and did not say anything more. The Prime Minister turned around with a few other officers and departed.</p><br/><p>Thus, in the imperial and opulent throne room, only Stewart was left.</p><br/><p>He put out his arm and caressed the handle of the throne, showing a calm and gentle expression.</p><br/><p>At the same moment.</p><br/><p>In another city of Ferelden, Benjamin carried the letter from the Prime Minister and returned to the inn.</p><br/><p>After seeing the notice, he wanted to rest for a while to slowly digest all the information he took in. But, at this current address, the Prime Minister sent him another letter. He made sure no one else was around, then took the letter and began to read it.</p><br/><p>Those whole chain of events made Benjamin feel as if he has been tricked, making him feel some anger inside. Right now, he did not want any trouble from the opposition, but they somehow sent him a letter?</p><br/><p>He wanted to read it to see what the Prime Minister had to say.</p><br/><p>But, after reading for a while, Benjamin frowned.</p><br/><p>It was an invitation.</p><br/><p>In the letter, the Prime Minister invited Benjamin to gather at Snow three days from now, he even expressed that if Benjamin had any questions, he would answer them all later on.</p><br/><p>The letter was not long, but at least it was apologetic, the back part was also about the invitation. The whole letter did not have any useful information, Benjamin could not make sure what their purpose was.</p><br/><p>…...A banquet?</p><br/><p>Benjamin’s danger sense was tingling.</p><br/><p>He had the right to suspect their motives. Right now, the general and Prime Minister held most of the power, and their relations with Benjamin have become better. After seeing the bulletin, Benjamin felt that they really were not the Church’s people, but…...this did not mean they were not working together.</p><br/><p>They praised Benjamin in the bulletin, but from the looks of it, the opponent might be using him, and were even intent on harming him.</p><br/><p>-----All of this was probably them using Benjamin to defeat the Church, then reaping the benefits from the battle, claiming the rights to rule.</p><br/><p>Thinking of it now…..no wonder. No wonder the Prime Minister did not find him personally, and even told him the general was one of the Church’s people.</p><br/><p>All of it was for today.</p><br/><p>They reaped the most benefits, right now, they even posted a bulletin to say that all of this was part of their plan, making Benjamin seem as if he was part of them as well. With this, was the whole rebel group not working for them? How would Benjamin’s followers view him now?</p><br/><p>This was like dragging Benjamin to be part of them without even asking.</p><br/><p>How…...mocking.</p><br/><p>Benjamin was really angered.</p><br/><p>No matter who stood behind the Prime Minister and the general, at this moment, he really wanted to fly over to the palace to cause a blizzard.</p><br/><p>But, he shook his head and managed to calm down.</p><br/><p>He could not be impulsive, at least, he had to make sure of their real motives.</p><br/><p>The opponent putting in so much effort just for all this, is it for the Church, for Icor, or even Carretas, or is it…...power?</p><br/><p>After some thought, he put away the letter and took out a feather pen to write a letter to Mikel. He wanted to hear Mikel’s opinion on this, then only deciding whether he will attend the banquet or not.</p><br/><p>After he was done writing the letter, Benjamin thought of his followers, he felt a headache instantly.</p><br/><p>How was he going to explain all of this to them?</p><br/><p>This so called organization…...could it still exist?</p><br/><p>It was obvious, going against the Church is their main goal. Right now, the Church has been kicked out of Ferelden-----at least that was what it looked like from the surface. All of these mages were citizens of Ferelden, the matters of other countries, Benjamin considers they really did not care about them one bit.</p><br/><p>Wanting to totally exterminate the Church, with them following Benjamin to Havenwright to the Church’s main nest…..was it possible?</p><br/><p>Thinking of this, Benjamin sighed deeply.</p><br/><p>So what…...he took out a bishop?</p><br/><p>This road is long and winding.</p><br/><p>Lying on the bed in the inn, he felt exhaustion. Right now, even if the skies flipped and the earth was torn apart, he just felt that he did not care, he closed his eyes and fell into a deep slumber.</p><br/><p>Maybe it was due to over exhaustion, he slept from evening till the next morning, after waking up, he still felt down and under. But, he opened up the windows and took in a breath of fresh air, perked up, and was ready to start the new day.</p><br/><p>After sending the letter for Mikel off, he rounded up the first batch of his followers, and held a meeting in one of the rooms of the inn.</p><br/><p>\"I think…...all of you have read the bulletin right?\"</p><br/><p>What surprised him was, out of all of twenty plus people, all of them were seemingly overjoyed.</p><br/><p>\"Of course we saw it, we finally managed to chase the Church out. Teacher Benjamin, they even said you were the main contributor! \"Joanna nodded and said excitingly.</p><br/><p>Benjamin was stunned.</p><br/><p>Looks like....his understanding of the bulletin was different from the others.</p><br/><p>After thinking a while, he realized that the other mages did not know much. They did not know how the Prime Minister was, and did not know how erratic General Stewart was. The only thing they knew was that they destroyed the Church, and right now Ferelden has its ban on the Church restored. Thus, they have succeeded.</p><br/><p>They succeeded, why wouldn’t they be happy? They did not think they were being used by another, if they chased the Church out, then all is well.</p><br/><p>Thinking of this, Benjamin laughed helplessly.</p><br/><p>He who increases knowledge, increases sorrow.</p><br/><p>What a blessing it was to know less.</p><br/><p>Sadly…...in his current position, he did not have the privilege to be one of those naive fools anymore.</p><br/>\n</div>"}