{"title": "Chapter 412: An Unexpected Position", "id": 412, "volume": 5, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-412-an-unexpected-position", "volume_title": "Volume 5", "body": "<h1>Chapter 412: An Unexpected Position</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 412: An Unexpected Position</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Hearing that, Benjamin’s heart moved; with composure he contemplated the smile on the Prime Minister’s face.</p><br/><p>\"Are you saying that you have used everything I’ve done so that you could gain power for yourself, and there are no other influences behind you?\" He calmly asked.</p><br/><p>\"If you wish to understand it this way, sir, then so be it.\" The Prime Minister answered matter-of-factly. \"The General is an ambitious person. When the crown is within his grasp, even a person who is used to taking orders would change their mind under this sort of temptation. You can be rest assured on this.\"</p><br/><p>\"Should I believe you? Or, is this another lie you’re concocting to use me.\"</p><br/><p>The Prime Minister continued smiling: \"Believe it or not, you have your eyes, sir, how about you follow me to the Palace? The General has always wished to meet you, you could then use your own eyes to judge.\"</p><br/><p>Benjamin was silent.</p><br/><p>Another fictitious invitation.</p><br/><p>\"...you mean to say, our meeting right now is unbeknownst to the General.\" Suddenly, he thought of something, and spoke.</p><br/><p>\"That’s spot on.\" The Prime Minister nodded his head, saying, \"Take it as my apology to you, sir. I will keep this meeting a secret. If you are not willing to see the General, sir, I will not reveal this in the least bit.\"</p><br/><p>Benjamin could not help but sigh in his heart.</p><br/><p>…...this old fox.</p><br/><p>After some thought, he asked back: \"So what do you, Prime Minister sir, think? Do you wish for me to see the General, or for me to leave now?\"</p><br/><p>\"Of course, to see the General.\" The Prime Minister, however, did not hesitate in answering, \"Right now, the situation in Ferelden is very chaotic. In only a few days, there were upheavals happening in more than ten locations, only that they were all forcefully squashed. Even the City of Snow had a few incidents of bloodshed. The General needs the mages’ support to have control in his hands.\"</p><br/><p>Hearing that, Benjamin was somewhat surprised.</p><br/><p>Was he roping him in?</p><br/><p>\"Then… If I am not willing to support the General?\" He asked probingly.</p><br/><p>\"If that’s the case, I suggest that you leave Ferelden as soon as possible, sir.\" The Prime Minister answered, \"The General has his doubts, he will not allow an organization with considerable fighting power to stay within Ferelden. And surely, you will not be satisfied with hiding in the shadows, sir. One day, you will stand before the General in opposition. By then, the Church will definitely take the chance to make a comeback.\"</p><br/><p>Hearing thus far, Benjamin finally felt that something was not right.</p><br/><p>\"Prime Minister sir, you are already one of the General’s men. Why are you telling me all these?\"</p><br/><p>The Prime Minister smiled, saying: \"Because I look highly upon you, sir.\"</p><br/><p>Benjamin was not swayed: \"But the last time we met, you chose to use me and help the General.\"</p><br/><p>\"That is because... No offence, but I look more highly upon the General.\"</p><br/><p>\"...\"</p><br/><p>Benjamin was speechless.</p><br/><p>This Prime Minister was neutral to the extreme, leaving a way out for himself everywhere and offending no one.</p><br/><p>\"What do you mean, sir?\" Seeing that Benjamin had not replied, the Prime Minister asked again.</p><br/><p>Benjamin laughed half-heartedly, answering: \"Alright… I will meet the general.\"</p><br/><p>He was not planning to join them. Only, there were many issues troubling the General now, and he had not obtained the mages’ support. In the City of Snow now, if Benjamin wished to leave, the General did not have the power to detain him.</p><br/><p>If that was the case, then why not meet with him?</p><br/><p>The Prime Minister had probably thought that Benjamin was willing to support them; his face lighted up in cheer, saying: \"A wise decision, the General will definitely not mistreat you, sir.\"</p><br/><p>Benjamin nodded, neither agreeing nor disagreeing.</p><br/><p>And so, he and the Prime Minister left the room at the same time and got on the carriage that the other party had prepared from early on, before riding towards the Palace. Ten minutes later, he smoothly entered the Palace.</p><br/><p>The current Palace looked heavily guarded. Troop after troop of soldiers went to and fro, on patrol. It seemed that they had been through many attacks; the soldiers looked exceptionally alert. It was only after seeing the Prime Minister in the carriage that they allowed them to pass.</p><br/><p>Benjamin, on the other hand, had switched on his water elemental sensing magic, checking freely— no priests, everything seemed safe, the servants were hurrying here and there. Stuart was standing in the Royal Study, browsing through a book entitled ‘Origins of the Royalty’...</p><br/><p>No one could detect his action, therefore, he let the System scan up all the documents that could be sensed and save them into the database to be slowly analyzed.</p><br/><p>After the Prime Minister had brought him into the Palace, they waited in the palace’s throne room. Not long after, General Stuart emerged from the main doors. He calmly glanced at Benjamin and slowly sat down on the throne; his disposition was as different as the sky was from the earth, from when they had met last time.</p><br/><p>However, Benjamin did not feel that it was an act, but… A person’s complete change from the inside out.</p><br/><p>\"Mage Benjamin.\" No longer the crabby old man from last time, Stuart revealed the smile of a superior, saying, \"We meet again. Indeed, you have not disappointed us.\"</p><br/><p>Benjamin nodded, saying: \"General, you have really surprised me.\"</p><br/><p>His attitude was neither humble nor impertinent, but somehow it displeased Stuart.</p><br/><p>\"Mage Benjamin, everything is part of the plan. To chase the Church out, we were forced to play a few tricks.\" Stuart said slowly, \"Moreover, it was not all of your achievements. It was me successfully deceiving Bishop Victor that gave you the opportunity to attack.\"</p><br/><p>\"Is that so?\" Benjamin smiled, \"General Stuart, you are really impressive.\"</p><br/><p>Although he was speaking in the Great Hall, but at the moment, his focus was placed on sensing the entire Palace.</p><br/><p>To judge the other party’s intentions, it was not enough to observe his speech and expressions; he also needed to look at the things that the other party was hiding. The System had slowly organized the documents— everything to do with the Church was clean, matters concerning other nations were also very clean. From the looks of all the documents, Stuart was really all for himself only.</p><br/><p>However, at the same time, the System had discovered some information concerning the mages.</p><br/><p>Mages that possessed a certain level of power in the realm of Ferelden had their information all listed out. Their fighting ability, their personalities, possibility of being solicited... And Benjamin’s information himself was first in the list.</p><br/><p>\"Proficient in Water Elemental Magic, excellent at disguises, fighting ability unknown, poses a great danger, might be involved in the Great Water Ball in Havenwright, has widespread fame and influence in Ferelden. If he cannot be of use to myself, a way must be come up with to destroy him!\"</p><br/><p>Seeing this, Benjamin laughed in his heart.</p><br/><p>The Prime Minister had really not lied to him. Indeed, Stuart wanted to use his influence to pull the mages over as a solid backup force. Because of that, the investigation they did was more detailed now.</p><br/><p>But, too bad, that the General did not know that while the Prime Minister was helping him, he had also sold him out behind his back.</p><br/><p>\"...Mage Benjamin, is Bishop Victor alive or dead now?\"</p><br/><p>While Benjamin was in the process of thinking, Stuart raised this question in a very concerned tone. Benjamin could only snap back to reality and reply smoothly: \"The Bishop is dead by my hands.\"</p><br/><p>\"Really?\"</p><br/><p>Benjamin crossed his arms and said: \"I have destroyed the body. If you do not believe me, I can do nothing.\"</p><br/><p>Finally, Stuart looked to be in great glee, and stood up from the throne, nodding his head excitedly. His mouth kept repeating: \"Good... Good... Finally dead...\"</p><br/><p>It looked like there had been some conflict between him and the Bishop.</p><br/><p>However, at that moment, Stuart suddenly turned his head and looked to Benjamin, revealing a smile.</p><br/><p>\"Since the kingdom split up, the realm of Ferelden had been without a Mage Guild for a long time. Mage Benjamin, right now you have the greatest prestige in the circle of mages. I don’t suppose you would be interested in building a Mage Guild in Ferelden, and be the Master?\"</p><br/>\n</div>"}