{"title": "Chapter 415: Desert City’s School", "id": 415, "volume": 5, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-415-desert-city%E2%80%99s-school", "volume_title": "Volume 5", "body": "<h1>Chapter 415: Desert City’s School</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 415: Desert City’s School</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Just like that, the temporary rebel organization was officially disbanded. Benjamin brought over one hundred followers and promptly set off. However, he did not hurry towards Carretas, but hurried first to the Desert City.</p><br/><p>In any case, it was the one and only place where he was in complete control. Benjamin did not intend to let it go so easily.</p><br/><p>Although various regions in the nation sort of seemed like they were about to be plunged into chaos, but because of its distant location and bad environment, nothing had happened in the Desert City, as before. The official documents sent here were all carefully replied to by Benjamin, so that everything was shown to be normal. This little place went unnoticed by the top people.</p><br/><p>Benjamin was still quite confident. Desert City was a stable, abandoned environment, it would last for at least a few years.</p><br/><p>Because of that, this was their paradise!</p><br/><p>\"Sir Benjamin, you have finally come back.\" In the Castellan’s Castle, the mage in charge of the place met with Benjamin, \"Recently there seem to have happened many things outside, but for now, there are no problems here.\"</p><br/><p>Benjamin nodded his head, and asked: \"Amongst the inhabitants of Desert City, how many people with magical ability have been chosen?\"</p><br/><p>\"It was quite successful, now we’ve found over thirty people.\" The other party answered, \"They have just started learning, now they are at the level of apprentice. We have classes for them every day, but... You also know that our level is only as such, there are not many things we can teach.\"</p><br/><p>Hearing that, Benjamin patted his shoulder, saying: \"It’s alright, just continue teaching first.\"</p><br/><p>The other party nodded in agreement.</p><br/><p>The mages in charge of administration were originally the locals of Desert City, and had always been bullied by the \"Desert Shadow\". Benjamin had released them, and had even provided them with an abundance of spells and Law of Meditation. Because of that, they considered doing all this as a repayment and service to Benjamin.</p><br/><p>They were different from the mages in the rebel organization. They had followed Benjamin from earlier on, so there was no need to talk about dissolution, as long as there was assurance, it was alright.</p><br/><p>As for the universal magic school that they were involved in...</p><br/><p>The permanent population in Desert City was not big, the base population was small, so people who had talent were also few. However, Benjamin still would not look upon this lightly. After questioning about the situation, he went into the school and conducted a class for those thirty over students himself.</p><br/><p>\"Teacher, are you the legendary Mage Benjamin?\"</p><br/><p>These students were all very young, some of them did not even seem to be older than ten years. Benjamin, seeing this, also felt extremely emotional, and felt like they were the blossoms of the future.</p><br/><p>\"What’s all this about legendary or not legendary.\" He stood on the roughly built podium, speaking to a group of people, \"That is nothing impressive. Your existence is already enough to be part of a legend.\"</p><br/><p>Making selection widespread amongst the civilians, with small class education... In this day and age, this group of students themselves were already part of history, symbolizing the first step of the</p><br/><p>advancement of magic.</p><br/><p>Only that they had not yet realized it.</p><br/><p>This group of children, listening to Benjamin’s words, put on an expression as though they understood him. However, they seemed to still be very excited that Benjamin could come to class.</p><br/><p>After all, he was ‘protector of the nation’ mage who was written about in the nationwide public announcements.</p><br/><p>Thus, with a short class, Benjamin was unable to teach these people anything. Because of that, he spoke only about the conflict between the mages and the Church. Crisis awareness and fighting awareness when facing the Church became, instead, the more important things at that time.</p><br/><p>How the Church persecuted mages, what treatment the mages in the Kingdom of Helius received, their experiences fighting the Church recently... At that moment, Benjamin felt himself to be like a political teacher. He told many stories, so the apprentices listened in engrossment, occasionally sighing and saying things like \"the Church is horrible\".</p><br/><p>Hearing this, Benjamin knew that his objective was achieved.</p><br/><p>Ideology and political work still had to be done!</p><br/><p>Just like that, after conducting the short and simple class and leaving the ugly school, he found Morris and started to discuss things concerning Desert City with him.</p><br/><p>—It was not enough to rely only on these native mages, he needed more people to take care of this Desert City.</p><br/><p>\"You also know that after we leave Ferelden, it will not be easy to return. Although we have magical instruments to pass messages, but over here in Desert City, we still need people to oversee things.\"</p><br/><p>Morris nodded his head, saying: \"Are you saying... You wish for me to stay here?\"</p><br/><p>Benjamin laughed in embarrassment, saying: \"Yes. I also do not want to abandon you here, but you have so many skills for creating magical instruments. Now that this school has been started, I feel that you could use this opportunity to pass on this expertise.\"</p><br/><p>Now, they were unable to create even a magical robe each for everyone, but afterwards, he hoped that these mages would be better equipped, not to mention that they would definitely have more recruits joining in the future.</p><br/><p>The need for magical instruments was too great. He needed to nurture a group of professional talents and fill this gap up as much as possible.</p><br/><p>Even so, to rely on the thirty over children in the academy, it was impossible to complete this feat.</p><br/><p>However, if Morris were to stay here, Benjamin was sure that slowly, there would be progress.</p><br/><p>\"It’s no problem, it’s also good that I stay here.\" Morris smiled, not objecting. \"I’ve always been familiar with the desert here, it’s convenient to stay here.\"</p><br/><p>Benjamin put his hands together, saying gratefully: \"Then it’s all up to you.\"</p><br/><p>Thus, after confirming the administrative model of the Desert City, he chose ten out of the mages that were following him to stay here and help Morris out.</p><br/><p>It was not an easy thing to be following Benjamin here and there; some people disliked fighting, so staying here as for logistic purposes was a good thing for them.</p><br/><p>Hence, the people who stayed did so willingly.</p><br/><p>Just like this, they rested a whole day in Desert City before officially setting out, towards Carretas.</p><br/><p>In the south of the Desert City was, as always, the borderless desert. However, in the place near the borders of the two nations, they would slowly leave the regions of the desert and enter into a small area of hills, finally reaching the border of Ferelden.</p><br/><p>This was not an easy road to take, but they could fly, and there would not be many obstacles along the way. In the span of about three days, they dealt with many bird-type magical creatures, and finally, without encountering anybody, drew near to the border of Ferelden.</p><br/><p>Only... Moving forward, they needed to be more careful.</p><br/><p>The region between Ferelden and Carretas was not deserted; in fact, there were mountainous areas with soldiers on patrol and bustling little towns. A lot of trade went on between the two nations, and mercenaries often went to and fro for their jobs. Because of that, the towns on the borders formed a line, and people were coming and going. It was impossible to avoid the crowds.</p><br/><p>Fortunately, Benjamin had prepared for this earlier on.</p><br/><p>Their disguises were put on easily, and the magical creature materials they had brought with them were loaded on a few horse carriages, with Varys leading... In the blink of an eye, they transformed from a team of a hundred mages into a trading group crossing the national border. The money bags on their waists made clinking sounds; they did not look impressive at all.</p><br/><p>—it was unknown if Stuart had secretly followed from behind, so they could only think of a way to disguise themselves.</p><br/><p>Therefore, bringing a total of ten horse carriages, Benjamin and his men moved forward in a single file. On the way, they even encountered some robbers who had no idea what they were getting into, and dealt with all of them without a question. Other than that, it was uneventful.</p><br/><p>Not long after, he entered into a small town situated by the border.</p><br/><p>They got ready to rest here for a while, and would officially enter Carretas on the second day.</p><br/><p>\"Your journey so far has been pretty smooth.\" While staying in the hotel, the System, for unknown reasons, suddenly made a sound. Hearing it, Benjamin felt a little anxious, strangely.</p><br/><p>\"We have made better preparations, isn’t it supposed to be smooth?\" Benjamin retorted.</p><br/><p>\"Yes yes yes, as long as you’re happy.\"</p><br/><p>The System’s tone of voice sounded as though it had too many things to say that it was unable to express easily. However, Benjamin did not care to debate with it, and ignored it.</p><br/><p>However, perhaps some sort of metaphysical things were causing trouble, unexpectedly... Before they could leave the small town, something really happened.</p><br/><p>The evening of the same day they entered the small town, for some unknown reasons, the people in the small town had surged out into the streets and suddenly surrounded the mayor’s house, yelling in rebellion.</p><br/>\n</div>"}