{"title": "Chapter 424: An Empty Trap", "id": 424, "volume": 5, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-424-an-empty-trap", "volume_title": "Volume 5", "body": "<h1>Chapter 424: An Empty Trap</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 424: An Empty Trap</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>While travelling through the skies, Benjamin did not notice anyone tailing them. But he still decided to change their direction and headed for a town called Ampere City, which was located nearby to the Gloria instead of directly going to the capital.</p><br/><p>It was one of the larger cities in Carretas and there was even a Mages Freemasonry division in the city.</p><br/><p>They entered the city and stayed at one of the hotels. Benjamin did not hesitate and went straight to the Mages Freemasonry to see how they were doing here.</p><br/><p>But all he saw see was an empty building.</p><br/><p>\"Hello? Anybody here?\"</p><br/><p>This particular branch of the Mages Freemasonry was built like a library. As front door opened, the first thing Benjamin saw was the white marble floors and the dark blue carpeting forming a neat and luxurious walkway. But despite all the aesthetics, there was no one behind the reception desk.</p><br/><p>Benjamin frowned.</p><br/><p>If there was no one around, why was the door not locked?</p><br/><p>After giving it some thought, he decided to explore the place. He ventured through the hallways, the reading rooms, the conference rooms and even through the worker's lounge and saw that all the doors were thrown wide open, revealing the empty rooms within. But the items in the rooms were all still inside, arranged neatly as though no one had touched them.</p><br/><p>Benjamin felt a cold chill run up his spine.</p><br/><p>After the fall of Audrey, the Mages Freemasonry here was thoroughly searched by the guards. Benjamin could get that the members had dispersed, but what he did not understand was why nothing looked out of place.</p><br/><p>Except for the fact that there was no one here, everything looked so normal.</p><br/><p>Only the sound of Benjamin’s footsteps echoed throughout the quiet building. At that moment, he felt as though he was in a ghost movie; even the elegant decoration had a ghostly aura about them.</p><br/><p>Where was everybody?</p><br/><p>Even after scanning through the entire building with the water element sensing technique, he confirmed that there was not a single living thing in there.</p><br/><p>Benjamin took a deep breath.</p><br/><p>That’s it, he should just leave.</p><br/><p>It didn’t matter what had happened here, it was not like he could get any information here anyway, so he should just leave. Besides, the empty division building and the nonexistent members were making the hair on the back of his neck stand on end.</p><br/><p>Usually, if he was unable to get any details, he would keep digging until he eventually found something. But this place was making him uncomfortable… he turned around and prepared to leave.</p><br/><p>But just as he reached the front door, he suddenly stopped.</p><br/><p>\"That him! I saw him walking in!\"</p><br/><p>At first glance, it looked like a normal townsman pointing and yelling at Benjamin.</p><br/><p>But after taking a step back, Benjamin saw that the previously peaceful entrance was now surrounded by rows upon rows of patrol guards. They were about a hundred men strong as they stood in formation and readied their weapons, watching Benjamin intensely.</p><br/><p>What was going on?</p><br/><p>Benjamin was a little confused.</p><br/><p>\"Hey, don’t arrest me, I was just passing by and walked in to have a look around.\" Benjamin said after a moment of hesitation, \"I am not a thief. Look, I didn’t take anything.\"</p><br/><p>Even though he didn’t understand what was going on, but acting was already second nature to him. He instinctively turned on his innocent civilian persona because he did not want them to know that he was a mage.</p><br/><p>He deduced that he had been seen walking into the division building and someone thought that he was a thief and reported it.</p><br/><p>One of the leaders of the patrol guards snorted and said, \"So what if you did not steal anything? This is a forbidden area, no one is allowed inside. Even if you didn’t take anything, you still broke the law.\"</p><br/><p>Benjamin immediately tried to look innocent and raised his hands, \"But I really don’t know anything. I’m not from these parts and have never heard of the ban.\"</p><br/><p>The head patrol guard maintained the cold look on his face and said, \"This is not up for discussion, follow us.\"</p><br/><p>\"I… I won’t.\" Panic spread on Benjamin’s face as he took a few steps back and said, \"I’m not from around here, how was I supposed to know this was a forbidden area? You did not lock the door, and secondly, you didn’t put up any notice. I may have accidentally walked in, but it is your fault for not putting up any precautions. Why are you blaming me?\"</p><br/><p>\"You...\"</p><br/><p>The head patrol guard obviously did not expect the \"troublemaker\" to be so eloquent and was unable to retort immediately.</p><br/><p>Benjamin took the opportunity to put on a confident face and continued, \"How can your people be so careless? It might a forbidden area but you did not lock the door or post notices anywhere. Are you guys even earning your keep here?\"</p><br/><p>As he was scolding them, the wheels in his head slowly started turning.</p><br/><p>The Mages Freemasonry building was considered a forbidden area…</p><br/><p>A lot of thoughts raced through his head. Maybe his initial suspicion was correct and that because of what happened with Audrey, the Mages Freemasonry division had been sealed and searched. But, if the place really had been sealed and searched then it would not be in such good condition.</p><br/><p>The guards might not have emphasized sealing the doors to individual rooms, but they should have at least sealed the main entrance instead of leaving the doors wide open.</p><br/><p>It was as though they were luring someone into a trap.</p><br/><p>Benjamin had to take another deep breath.</p><br/><p>He knew he had stumbled upon something.</p><br/><p>\"Enough! A crime is a crime, I don’t care about anything else.\" The head patrol guard could not take being scolded anymore and shouted impatiently, \"Whatever you have to say can wait!\"</p><br/><p>As he said this, he stepped forward as though ready to forcefully take Benjamin away.</p><br/><p>Benjamin took a few steps back in response.</p><br/><p>Should he attack?</p><br/><p>Honestly, he felt as though this was the church’s trap - to leave the doors of the Mages Freemasonry wide open to lure in any unsuspecting mage. Then they would have an excuse to get rid of the mage. The target was not specifically Benjamin, or they would have prepared a lot more than a hundred patrol guards.</p><br/><p>But on the other hand, if he defended himself, he would reveal his identity.</p><br/><p>The mages in his group were staying in different hotels, but the first thing he was going to do after getting away was to warn everyone. This place was not safe for them.</p><br/><p>But first things first, right now the street were quiet but there was still a lot of people around. How was he going to get away?</p><br/><p>\"Wait a minute, you… you dare touch me? Do you really think that you have enough backup? If you lay a finger on me I will make sure it will be the end of you!\" Benjamin threatened as he took another step back.</p><br/><p>The guards, for the most part, seemed doubtful of these claims, but they were suddenly a lot of cautious.</p><br/><p>What if it were true?</p><br/><p>\"If you really did make a mistake, then just explain it to the leader of the town. If you really are innocent, then he will definitely let you go. But right now, you will have to follow us.\" The voice of the head patrol guard was still stern, but considerably more compassionate.</p><br/><p>Benjamin hesitated for a moment before sighing.</p><br/><p>\"Alright then, I’ll follow you.\" He raised his head and brushed lint off his shoulder as he spoke coldly, \"I want to find out exactly who is in charge of all of these irresponsible guards.\"</p><br/><p>Before the patrol guards could react, Benjamin suddenly walked straight up to the head patrol guard and looked him dead in the eye.</p><br/><p>\"What are you waiting for? Lead the way.\" He said in an annoyed tone.</p><br/>\n</div>"}