{"title": "Chapter 433: Killing His Beliefs", "id": 433, "volume": 5, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-433-killing-his-beliefs", "volume_title": "Volume 5", "body": "<h1>Chapter 433: Killing His Beliefs</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 433: Killing His Beliefs</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>In the secret Church, the head priest was just wrapping up a morning class.</p><br/><p>\"...Thank God for our food, I pray you fill this world with joy, deliver us from our worldly pain, and forgive us of our sins. God, thank you for your holy light, you are the sun that shines over everything, let us give praise to you….\"</p><br/><p>The priest held out his bible, eyes looking in front, his voice crisp and clear. The novices had their hands together and their eyes closed, repeating every sentence after the priest.</p><br/><p>Even though it was underground, the church was not dark at all. Candles were placed in rows all around them, creating a holy atmosphere.</p><br/><p>In this hall, they prayed devoutly, taking pride in the fact that they were doing something \"good\". In reality, they were all locals of Carretas who had never even heard the word \"Church\" before.</p><br/><p>Chris was one of them.</p><br/><p>He was born in Halleyden and was the son of a fisherman. He thought he would one day grow up to be a fisherman like his father and thus, never thought of the outside world. But, a few years ago, his father died in a thunderstorm at sea. His mother fell sick with depression and passed not long after. A thirteen-year-old Chris was left alone in the world.</p><br/><p>He was traumatized and sold his family’s fishing boat and home, before mixing with the gangsters of the city. He drank, robbed, destroyed property, committed assault, traded narcotics, all without a care in the world.</p><br/><p>But, when he was eventually captured, a priest appeared in front of him.</p><br/><p>\"With your list of crimes, you should be in jail suffering. But God’s forgiveness has opened a window for you. You have the gift of the Holy Light - with training, you can become a priest. Are you willing to do so?\"</p><br/><p>Chris could only wear a blank stare.</p><br/><p>\"P… priest?\"</p><br/><p>The man nodded, \"This is the talent God has given you, it is your calling for you to carry out God’s will and rid the world of evil. To repent and atone for your own sins.\"</p><br/><p>Chris felt disturbed, \"But if God is watching over everything, why did my father die at sea, with no trace of his body for even a funeral? Why did God not lend a hand when my mother was sick and overcome with anguish?\"</p><br/><p>The priest smiled and told him, \"Because your parents have already been saved.\"</p><br/><p>Saying this, he waved his hands and a holy light flooded around Chris. In the holy light, Chris saw an image - his parents stood in an ocean of flowers, their faces the same but looking disappointedly at him, as if they were ashamed of him.</p><br/><p>He knelt down and started trembling.</p><br/><p>The priest waved his hands again and the holy light was gone. His calm eyes stared sympathetically down at Chris.</p><br/><p>\"All of this is God’s wish.\" The bishop was emotionless, \"Your parents are in heaven waiting for you, but you have yet to pass this test.\"</p><br/><p>Hearing this, Chris' eyes were filled with despair.\"</p><br/><p>\"Priest, what should I do?\"</p><br/><p>\"You still have a chance to save yourself.\" The priest pulled him up from the floor, \"Destroy your bad habits, practice the Holy Light, and carry out God’s will. God will give his devout followers a second chance.\"</p><br/><p>Chris held on to the priest’s hands. At that moment, he felt himself shed of the burdens of his old life and saw himself reborn.</p><br/><p>He nodded.</p><br/><p>And that was how he arrived here.</p><br/><p>When he first began, he thought they would undergo strict training, but the first class of the divine arts surprised him. They all sat together, taking turns to reveal their sins, some even cried while speaking. After they were done, they would turn to each other and say, \"God will forgive you.\"</p><br/><p>When Chris said this, his face turned red and he started trembling as if all of his sins were forgiven and he now had a new life.</p><br/><p>He never thought that he could one day wake up and be completely sinless – he was now full of hope and passion for the future. He was a completely different person.</p><br/><p>This was all brought on by religion. Thus, he now had a dream - he wanted Carretas to lift the ban on the Church. They were still so many left unsaved; they could not lose their opportunity for salvation because of the royalty’s biases.</p><br/><p>Thus, he concentrated fully on his studies every day and hoped that God’s grace would shine upon him even more. His cohort was filled with others like him.</p><br/><p>\"Alright, today’s morning class is over.\"</p><br/><p>After prayer, the priest closed the book and the students opened their eyes.</p><br/><p>But, just as the priest was about to give a preview of the next lesson, the door of the church was flung open. A powerful breeze came in and immediately blew out all of the candles, completely changing the atmosphere in a split second.</p><br/><p>The followers all turned around.</p><br/><p>They saw two unfamiliar priests walk in.</p><br/><p>\"Wait… who are you people? Why have I not seen you two before?\" The priest on the podium frowned as he looked at the two priests walk in.</p><br/><p>The two priests answered, \"Something has happened in Galloway. The bishop has given orders that he wants you to go over. We will take over the classes.\"</p><br/><p>\"Galloway? How...\"</p><br/><p>The priest was shocked and started to mutter to himself.</p><br/><p>\"Time is of the essence, you should leave immediately.\" The stranger priest said.</p><br/><p>But, the priest merely rubbed his chin and stared at them suspiciously. Suddenly, he flung a cross at them.</p><br/><p>In the blink of an eye, the cross split apart and became a huge ball of holy light, looking as though it was ready to disintegrate the opposition.</p><br/><p>At the same time, the priest ran away. He rushed to the side door with the intention to escape, without looking at the students at all.</p><br/><p>The students could not react in time to the chaotic situation.</p><br/><p>But, just as the priest reached for the handle, he stopped.</p><br/><p>\"Why are you running, priest? Where is your God now?\"</p><br/><p>Following the mocking words, an icy mist appeared and started to wrap around the priest.</p><br/><p>The icy mist seemed to have been there for a long time and was hidden near the side door. The priest tried to break free but was eventually dragged under and suffocated. At that moment, the crosses on his body all cracked to shield him but proved useless against such immense pressure.</p><br/><p>The priest movements became rigid and in a few moments, was frozen into an ice sculpture. His body dropped to the ground with a horrified expression frozen on his face.</p><br/><p>\"Priest….\"</p><br/><p>The students were all shocked and could do nothing but stare.</p><br/><p>\"He’s dead.\" The two strangers said.</p><br/><p>The students turned to look at them and saw that the light was gone, but the two priests were standing there completely unharmed.</p><br/><p>The students watched as the men tore away their white robes, revealing a set of black ones underneath.</p><br/><p>\"They’re mages!\" One exclaimed.</p><br/><p>Benjamin heard this and tossed the white robe aside. He walked to the podium and smiled at the students.</p><br/><p>\"That’s right, I’m a mage.\" He placed his hands on the table and slowly said, \"I want to rescue all of you before you are brainwashed by the Church’s.\"</p><br/><p>\"You’re lying!\" A person stood up and pointed at Benjamin,\" You...you killed our teacher, you evildoer, God will punish you!\"</p><br/><p>\"Silence.\" Benjamin clapped his hands,\" You’re too convinced of their lies, it’s no use trying to save you.\"</p><br/><p>That student that stood up could not make another sound. He turned into an ice sculpture just like the priest.</p><br/><p>The crowd was shocked.</p><br/><p>\"You have all seen it yourselves. They are so devout, yet God did not save them.\" Benjamin continued, \"There is no God in this world, God’s will is just a lie the Church came up with.\"</p><br/><p>\"Nonsense!\" Chris stood up and said angrily,\" This… this is all God’s test. We will not believe you.\"</p><br/><p>Saying this, they started chanting and got ready to retaliate.</p><br/><p>Benjamin saw this and shook his head helplessly then, he clapped his hands again.</p><br/><p>A warm humid wind blew over and the students started screaming in agony, their chanting brought to an abrupt stop.</p><br/><p>Their heads ached after their casting was interrupted.</p><br/><p>\"The holy light will not listen to you just because you are devout, they have their own laws and will not be swayed by any amount of willpower.\" Benjamin continued, \"It is not even God’s holy light. Divine art is just a branch of Light magic.\"</p><br/><p>\"God’s will is incomparable, stop your blasphemy.\" A student shouted as he slowly recovered, \"Give up you damn demon. We will not be influenced by you!’</p><br/><p>Benjamin heard this and smiled cruelly.</p><br/><p>\"Frank, your turn.\"</p><br/><p>Frank coolly stepped forward.</p><br/><p>The crowd watched as he chanted a fireball spell. In the blink of an eye, a basketball-sized fireball appeared in his left hand.</p><br/><p>The students calmed down and looked at his hands, as waiting for the judge to give the final verdict.</p><br/><p>What they did not expect was for Frank to put out his right hand as well.</p><br/><p>He started reciting a familiar chant and a familiar light energy surged forward and gathered at his right hand.</p><br/><p>In the blink of an eye, a ball of holy light had appeared in his right hand.</p><br/><p>Frank held the fireball in his left and the holy light in his right. Standing at the podium, he looked like a perfectly balanced scale.</p><br/><p>\"Humans are weak, they need lies to support themselves.\" Benjamin opened his mouth and said slowly,\" But, when you are strong enough, these lies become nothing but hindrances.\"</p><br/><p>The hundred students were dead silent.</p><br/>\n</div>"}