{"title": "Chapter 431: A Spy’s Purpose", "id": 431, "volume": 5, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-431-a-spy%E2%80%99s-purpose", "volume_title": "Volume 5", "body": "<h1>Chapter 431: A Spy’s Purpose</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 431: A Spy’s Purpose</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Benjamin came up with a plan overnight.</p><br/><p>\"Be careful, the King has given us news that the Church has started taking action. They have very likely found out that you were working in the bar, they might have even seen that book of yours.\"</p><br/><p>That night, Mikel found Benjamin and personally told him the news.</p><br/><p>Benjamin nodded but did not seem to be surprised.</p><br/><p>The Church had many sets eyes around, it would be more of a surprise if they had not noticed. He expected the Church to act on the second or third day, but for them to find out so fast was unexpected.</p><br/><p>Thus, he took out a piece of wood covered in weird runes.</p><br/><p>He stuck the piece of wood into his mouth, concentrated his energy, and spoke into it, \"The Church has started taking action, be careful as you follow the plan.\"</p><br/><p>After saying this, the wood shone dimly and a wave of energy dispersed outward from it.</p><br/><p>Benjamin nodded and proceeded to keep the wood.</p><br/><p>\"That item is really useful.\" Mikel smiled while saying.</p><br/><p>\"Not as useful as you think, it still takes an hour for them to receive the news.\" Benjamin shrugged, \"But, before going off I had already reminded them to be careful anyway.\"</p><br/><p>Luckily, they were prepared.</p><br/><p>After the Church starts taking action, bars all over the kingdom will be filled with their eyes. At that point, it wouldn’t matter what disguises they used, the Church would still find out about them.</p><br/><p>Thus, they could only regretfully give up this method of distribution for now.</p><br/><p>Right now, the Church in Carretas has noticed their existence. The games have begun, and a secret game of cat and mouse will be played until one of the two sides is eventually defeated.</p><br/><p>The good news was that in this case, Benjamin had taken the incentive.</p><br/><p>Their next step was going to take place in the gambling dens.</p><br/><p>If the Church had determined the location of their distribution, then they would immediately change to another location. With this, they would be able to run circles around the Church; it would be impossible for the Church to try to predict their movements. And so, they could continuously have the upper hand.</p><br/><p>If Benjamin was slow, they would end up being caught. If the Church was slow, they would be dragged around in circles until every single copy of the booklet has been distributed.</p><br/><p>With the King as a spy, Benjamin was confident he could keep up his dance with the Church.</p><br/><p>As first night drew to a close, the mages hurried home from all over to give their reports. They have successfully distributed over a thousand copies of Freedom of Promoting Magic – the effects of which have yet to be seen. But judging from people’s reaction, things were going well.</p><br/><p>Statistically, only one in ten of the people who received the books had magical talent, but meditating was a technique that everybody could do, and which claimed to make their mental state sharper. Once the books proved themselves, it was likely they would allow their children to start reading it as well.</p><br/><p>And so, the circle of influence would grow. From friends to relatives, to siblings and colleagues… And so, Benjamin did not have to print any more issues - the locals would most likely copy it by hand and pass it around themselves.</p><br/><p>In the mage’s reports, there was also no sign of the Church’s shadow, despite Benjamin being sure that the Church had begun moving. Thus, Benjamin deduced that the Church was more secretive than they thought, and they had to careful not take them lightly.</p><br/><p>After a short afternoon break, the mages grabbed a new batch of issues and marched themselves into gambling dens around the country; Benjamin himself participated. But he could not help but feel like a drug dealer with his huge cape, darting eyes and random questioning of strangers, \"Bro, want a book?\"</p><br/><p>Luckily, the Church seemed to be still focused at the bars, and the mages were free to do as they pleased in the dens.</p><br/><p>In reality, Benjamin’s actions were not illegal in Carretas. The Church showing themselves was illegal, and they had no legal reason to make the King ban the booklet.</p><br/><p>So, the Church had to be sneaky with their actions.</p><br/><p>\"Your Majesty, a gang of criminals have been going around Carretas and spreading rumours to influence our people. We have to put a stop to them!\"</p><br/><p>In the palace, the bishop spoke aloud, waking up the King who had fallen asleep on his throne.</p><br/><p>\"Bishop Cameron? What happened? Why are you so angry? \"The king rubbed his eyes and drowsily asked.</p><br/><p>\"Your Majesty, see for yourself.\" The bishop shook his head and handed over a book that was almost torn to pieces.</p><br/><p>A guard beside him took the book and handed it to the king. The king opened the book to start reading and showed a confused look.</p><br/><p>\"What’s this?\"</p><br/><p>\"Those people spreading fear in Ferelden… they’re now in Carretas! These are their evil lies.\" The bishop slowly said, \"Your Majesty, think of the situation in Ferelden now, if you don’t start acting, your throne might be threatened.\"</p><br/><p>Hearing this, the king gave an Oscar-worthy reaction. His eyes widened, and he started spitting out a mess of words in a panic, \"This… this isn’t good! Lord Bishop, what should we do?\"</p><br/><p>The bishop replied smugly, \"Issue a ban, call these people liars and state that everything written in the book is evil. If the civilians follow the teachings in the books, tell them they will only end up harming themselves.\"</p><br/><p>The king thought for a while and nodded, \"Good idea, I will make those people face the full force of the law!\"</p><br/><p>The rage in the bishop’s eyes subsided and he nodded graciously, \"Your Majesty is wise.\"</p><br/><p>Saying this, he bowed and turned around and left, not really seeming to want to say anything further to the king. After watching the bishop leave, the king’s face did not change. Instead, he signalled secretly at Mikel who was disguised as the guard. Then, he called for his officers and got ready to issue the ban.</p><br/><p>Meanwhile, Mikel had taken his leave without anybody noticing.</p><br/>\n</div>"}