{"title": "Chapter 442: The Stubborn Shadow", "id": 442, "volume": 5, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-442-the-stubborn-shadow", "volume_title": "Volume 5", "body": "<h1>Chapter 442: The Stubborn Shadow</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 442: The Stubborn Shadow</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>The f*ck….</p><br/><p>Benjamin inhaled sharply after he heard that, trying really hard to digest the piece of information that was just presented to him.</p><br/><p>He thought he discovered a utopia, but instead it was actually a honey-addled trap?</p><br/><p>After Benjamin recovered from his shock, he remembered the pale and sunken faces of the villagers, and the bone fragments they saw at the start; everything started to fall into place now. The Candela Mountains always had rumors of cannibals, but he never thought that the cannibals would be a group of mages!</p><br/><p>The approximately 10 mages who were locked in the dungeon was probably not criminals, instead, they are most probably the food source that the mages stocked up.</p><br/><p>Godd*mn unbelievable, this is.</p><br/><p>A bunch of mages from ten thousand years ago hid within these mountains and passed down their most terrifying tradition in magic - cannibalism. No one knew how the tradition come to be, but they still were faithful to it, almost to a fault.</p><br/><p>This village… Could this village even be considered as one inhabited by humans? Benjamin’s question was finally answered, but he found no joy in the discovery.</p><br/><p>These people wanted to eat him.</p><br/><p>The intent of the few elders was as clear as day. By giving him conflicting statements and delaying Benjamin’s departure, it would be more convenient for them to make a move. Since they have an absolute advantage in terms of the number of people, they did not even try to make the lie sound better; it was flimsy at best - after all, no one would care how the food thinks, no?</p><br/><p>Benjamin predicted that these people would make a move tonight. He needed to do something.</p><br/><p>His first thought was to leave immediately. However, in hindsight, leaving a bunch of cannibalistic mages around here that would occasionally go out to ‘hunt’ was not the best course of action; it was one of the worse ones, really. If a mage ran into them alone, it was an immediate death sentence; if the mages were found by the church, they would become the church’s best propaganda against magic, and the reputation of mages would go to the ruins. This village was basically a ticking time bomb.</p><br/><p>How about… How about finding a way to get rid of them, once and for all?</p><br/><p>Benjamin started contemplating. It would not be an easy job getting rid of all the mages in the village; there were at least a few hundred of them around. Those 3 elders were probably the strongest in the lot, and although their abilities were not exceptional, the eerie ceremony of eating people for sacrifice set off multiple blips on Benjamin’s radar - There was no guarantee that they did not have weirder things saved up in their sleeves.</p><br/><p>\"The book should have their tricks and weaknesses listed, right?\" Thus, Benjamin asked the System.</p><br/><p>The System sound very surprised. \"Why? Are you planning to go up against them?\"</p><br/><p>\"Of course,\" replied Benjamin, \"They’re keeping their eyes on us now, we’ll be detected right away if we attempted to escape. They know the geographical surroundings around here better than we do, and we’ll never have an advantage if a chase was to happen. Might as well take the initiative; at least we’ll get an edge on things.\"</p><br/><p>He would have chosen to run if escape was easy. Unfortunately, it was anything but. It was nothing but an unwise choice to run and fight in these mountains where magical creatures crawled everywhere.</p><br/><p>\"Alright then. Actually, their magical system is quite similar to yours. It’s just that their dark magic is exceptionally advanced, and you should definitely watch out for their unorthodox methods, though….\"</p><br/><p>The System briefly covered some of the characteristics of the magic here. Benjamin had an overview in his heart, and a plan slowly surfaced in his mind. Soon, he exited his camp and traveled around the base to sneakily inform the other mages.</p><br/><p>The night has fallen, and he had no idea when the cannibalistic mages would make their move. He could only start his preparations as soon as possible. After he finished his rounds, Benjamin went to seek for Luke, and requested for the boy’s company with the excuse that he wanted to ‘go for a walk in the mountains’. Of course, Luke was extremely enthusiastic and led Benjamin to walk randomly around the place.</p><br/><p>\"Sir, what gave you the sudden good mood to go for a walk?\"</p><br/><p>\"I ate too much during dinner, I need to walk it off.\"</p><br/><p>\"....\"</p><br/><p>As Benjamin was walking back and forth around the area, he turned on his Water Elemental Sensing Technique to scan the surrounding terrain. The only entry and exit to this valley was the cave they came in from, and the huge opening positioned right above their heads. If Benjamin was planning to kill them all once and for all, it was natural for him to seal the entries and exits.</p><br/><p>It would be troublesome if one or two of them managed to escape. Meanwhile, during the walk, Benjamin realized that Luke was trying very hard to bring him to the edges of the area as if he did not want Benjamin to go near the center of the village.</p><br/><p>Does that mean that…. They have already started their preparations?</p><br/><p>Benjamin sensed some of the houses located at the outside of the village. Even though the lights were lit, there was no one in the house.</p><br/><p>Well, that was quick.</p><br/><p>As he was deep in his thought and came to a faraway location, Benjamin suddenly halted his steps, and asked Luke, \"Oh, right…. I’ve always been curious about something. How did you manage to find such a precious hiding place?\"</p><br/><p>Luke answered offhandedly, \"Nothing much, it’s just pure luck. Our ancestors left us a map that recorded the existence of this place, which was why we came here.\"</p><br/><p>\"Oh, is that so… Why did your ancestors not tell you to avoid eating human flesh? Those do not taste good.\"</p><br/><p>Luke was stunned. Benjamin took a few steps backward, and around him a light ice mist appeared, slowly spreading outwards. </p><br/><p>\"You did manage to find out, huh.\" After a brief pause, Luke instead grinned widely, his lips stretched in a bizarre way. He did not chant any spells, but the Dark Elements in the surrounding started pulsing abnormally, and the already dark night became even darker.</p><br/><p>Benjamin’s heart tightened.</p><br/><p>\"Didn’t you say that they have no special tricks? Why would he start nonverbal spellcasting out of nowhere?\" He asked the System, slightly fed up.</p><br/><p>\"How would I know? They didn’t even mention it in the book….\"</p><br/><p>Just when Benjamin and the System were having their conversation, peculiar magical disturbances started forming before them. Then, before Luke, a weird black shadow materialized out of thin air.</p><br/><p>Benjamin immediately snapped out of it and stopped hesitating after he saw the phenomenon. Forget it; what could some weird tricks do? He could still defeat an ordinary mage with mediocre abilities.</p><br/><p>Under his guidance, the ice mist rushed forwards to surround Luke.</p><br/><p>Benjamin’s abilities were always improving, and the ice mist that he summoned now was not something an ordinary mage could withstand. Luke was defenseless after he was trapped in it, and he was frozen into an ice statue even before he could finish the dark magic that he triggered before. The life drained out of him, and he became a corpse.</p><br/><p>Benjamin finished Luke without much effort. However, a chill shot down Benjamin’s spine, and goosebumps appeared on his skin. </p><br/><p>For some reason, the black shadow did not disperse after Luke’s death. It floated quietly there, thus framing Luke’s grin to be an increasingly creepy one.</p><br/><p>How could this happen?</p><br/><p>Terrified, Benjamin immediately summoned another water bubble to envelop himself within, just in case any attack were to happen. Then, he continued to observe his surroundings while he was sheltered safely in the bubble. </p><br/><p>All magic would automatically disperse once it was no longer controlled, and they will turn back into elements and return to the sky and the earth. That was the law of magic, and there should not be any room for error.</p><br/><p>Benjamin could recognize this black shadow. It was a beginner-level magic named The Black Hand. It has a certain level of control and attack power, and the mages under him tried using this spell before; it was not something that was particularly troublesome to deal with.</p><br/><p>That was why Benjamin felt spooked under these circumstances.</p><br/><p>The Shadow should have dispersed long ago.</p><br/><p>Unless Luke was still alive.</p><br/>\n</div>"}