{"title": "Chapter 463: Starting to Run", "id": 463, "volume": 5, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-463-starting-to-run", "volume_title": "Volume 5", "body": "<h1>Chapter 463: Starting to Run</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 463: Starting to Run</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Hailstones raining from the sky was considered a sensitive phenomenon for this part of the world.</p><br/><p>The last hailstorm had happened in the capital of Ferelden, the City of Snow, and had evoked panic amongst the people; after that, there was a series of political changes, which many had considered the hailstorm to have foreshadowed. Benjamin realized from this that using a hailstorm was also a way to spread rumours.</p><br/><p>It was because of this that he chose to rain the hail and not to use a method as violent as blowing up the city gates.</p><br/><p>\"Hmm… doesn’t seem enough.\" Benjamin muttered to himself and suddenly soared higher into the sky and towards the centre of Gealorre Capital.</p><br/><p>Everywhere he went, the sky started to rain hail, as though he was some deity spreading rain and clouds all about.</p><br/><p>No matter how careful and patient the Church was, they would not be able to tolerate such reckless actions. Sure enough, the System soon informed him that a huge number of priests had started mobilizing in the streets below.</p><br/><p>The priests moved very stealthily and surged towards Benjamin’s location, with the intention to secretly surround Benjamin. But there was still no sign of the bishop.</p><br/><p>Seeing this, Benjamin hesitated for a moment before suddenly turning back and speedily flying towards the outskirts of the city.</p><br/><p>The speed of his flight was extremely fast and the priests hidden below him struggled to catch up. They were caught off guard by Benjamin’s sudden movement and were soon left far behind.</p><br/><p>This was when Benjamin finally sensed a figure that seemed like the bishop – he had probably made his appearance because he was afraid of losing his target.</p><br/><p>He was a middle-aged man wearing ordinary clothing, sitting on a galloping horse carriage far behind Benjamin. It was only from the surge of spiritual energy and a bag of crosses under his clothes that Benjamin could identify him as one of the bishops who had been hiding in Gealorre Capital.</p><br/><p>So… what about the other two?</p><br/><p>Benjamin wanted to lure out all three bishops before retreating from Gealorre Capital. However, the situation at hand was less than ideal; he had walked right into the tiger’s den, so he decided not to be too arrogant and fall back.</p><br/><p>Just as he expected, he sensed a powerful magical disturbance rippling from behind him as he continued to fly away.</p><br/><p>He turned his head to look, only to see three beams of golden flowing light flying right at him.</p><br/><p>… Had all three actually caught up with him?</p><br/><p>Although he did not know what they were thinking, nevertheless, Benjamin was really happy. The three bishops had come, leaving the castle empty; Mile’s rescue operation should now go without a hitch.</p><br/><p>The plan to draw their attention had been executed rather successfully!</p><br/><p>However, after flying for some time, Benjamin suddenly realized that some shadows had appeared in front of him.</p><br/><p>After taking a closer look, he saw that it was a group of about fifty or sixty priests. He did not know how, but they now flew in mid-air in front of him, already muttering incantations.</p><br/><p>A strong disturbance of magic washed over him and for a moment, Benjamin’s heart froze.</p><br/><p>… How did he get surrounded?</p><br/><p>But he had no time to ponder this as a beam of holy light suddenly pierced the night sky, lighting up everything around him. Subsequently, a huge sword, the hilt of which was crystallized holy light, appeared above the priests and slashed viciously at Benjamin!</p><br/><p>Benjamin stopped in his tracks.</p><br/><p>Before him was a Sword of Holy Light, menacingly trying to cut him in half and behind him were the three bishops who had by now caught up with him, with eyes revealing that they were ready to kill.</p><br/><p>This was troublesome…</p><br/><p>In a short span of time, Benjamin had been flanked; he could only immediately cancel his magic, causing the water vapour that propelled his flight to disappear. Like a Foxconn employee jumping to his death from the twentieth storey after losing his job, he fell towards the ground with a loud whoosh.</p><br/><p>The holy sword slashed aggressively at him as he fell but caught nothing but air.</p><br/><p>As Benjamin approached the ground, he reactivated his magic and summoned a huge cloud of water vapour to support him and reduce his speed. This allowed him to slow down enough not to break both his legs, his spine, and well, every single bone in his body.</p><br/><p>He stumbled few steps forward before stopping and dusting himself off. Then, he quickly turned his attention back towards the sky.</p><br/><p>He saw the Sword of Holy Light in the sky immediately start chasing after him to attack again. The priests and the bishops also did not stop closing in and immediately changed directions to fly at the ground.</p><br/><p>\"You have nowhere to run!\"</p><br/><p>A voice rumbled from the sky.</p><br/><p>Benjamin ignored it and started to chant a spell. One by one, massive waterballs started to emerge beside him. The waterballs locked on to the Sword of Holy Light that was falling from the sky and immediately started flying upward straight at it.</p><br/><p>In the blink of an eye, the two clashed; however, the waterballs were incredibly elastic and started merging together before suddenly enveloping the Sword of Holy Light. Immediately after this, Benjamin activated the anti-magic power, thus, severing the link between the Sword of Holy Light and the priests. The priests watched as the huge sword then melted away within the waterballs.</p><br/><p>However, they did not panic, instead, they became even more careful.</p><br/><p>\"Indeed… He has strange disengagement methods.\"</p><br/><p>\"Surround him carefully, don’t get close to him. Let the three bishops deal with him slowly…\"</p><br/><p>Benjamin managed to pick up on what they were saying and shook his head. Apparently, they had seemed to have done a lot of research in order to cope with him.</p><br/><p>As expected, this was not going to be a walk in the park.</p><br/><p>This sort of situation could not be dragged on; the longer it was dragged on, the more priests would come to help. If it was a battle of attrition, there was no way he could win.</p><br/><p>Because of this, he quickly drank a bottle of alacrity potion and physical tonic before the priests could surround him. Then he turned and, with enhanced speed from the potions of water vapour, broke into a sprint.</p><br/><p>Luring them out was enough, there was no way he was going to f*ck around with these guys!</p><br/><p>The Church might have done a lot of research on him, but his new and improved physical capabilities from the magic potions only developed only and as such, had not been added to their research materials. Because of this, Benjamin’s explosive speed caught them all off guard.</p><br/><p>\"So… So fast!\"</p><br/><p>This was a speed that was completely beyond human ability; it was even faster than Benjamin’s flight speed. His legs were generating so much force that if not for the bottle of physical tonic he had downed, his muscles would probably have been torn apart by the explosive contractions alone.</p><br/><p>But running at this speed… really felt like flying.</p><br/><p>\"You can try to chase me slowly, but I will be taking my leave first.\"</p><br/><p>He turned his head and looked back at the increasing distance between him and the priests before waving his hand and called out mockingly.</p><br/><p>\"Curses… We cannot let him get away!\"</p><br/><p>\"Bishop sir! Where is the Bishop…\"</p><br/><p>Just as the priests were getting so upset that they were about to give up, the three figures, clothed in golden light, dashed over their heads. At that moment, the three bishops were equally stunned at Benjamin’s new lightning-fast pace.</p><br/><p>However, they did not falter; while chasing, the three of them got closer together and recited a new incantation in unison.</p><br/><p>The holy light started radiating even brighter and a pair of wings, shining as bright as the sun, suddenly materialized on their backs. Their speed also increased tremendously, and they were now able to keep up with Benjamin.</p><br/><p>\"Degenerate, receive your final judgment!\"</p><br/>\n</div>"}