{"title": "Chapter 468: The King's Choice", "id": 468, "volume": 5, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-468-the-kings-choice", "volume_title": "Volume 5", "body": "<h1>Chapter 468: The King's Choice</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 468: The King's Choice</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Around noon the same day, Benjamin returned to the area nearby Candela Mountains and arrived at the agreed cave location.</p><br/><p>\"Ben… Master Benjamin?\"</p><br/><p>A familiar yet weak voice was heard. When Benjamin heard that, it was as if he had released a huge piece of rock from his heart and was free of exhaustion.</p><br/><p>In the bleak and deep cave, he finally saw the five mages who were led by Tony. They were weakly leaning against the stone wall and their faces were pale white but he could imagine how it was like being met with such difficulties within half a day.</p><br/><p>Yet instead, they were smiling at Benjamin.</p><br/><p>\"The Church’s tricks wasn’t much. I did not give them what they wanted to hear,\" Tony raised his hand, gave a foolish laugh and answered in a tired voice.</p><br/><p>As Benjamin heard, he couldn’t help but revealed a smile.</p><br/><p>\"...You must have had a hectic day.\"</p><br/><p>He wanted to appease these five people with a few words - talk about some sensational or encouraging phrases, but in the end, when he started talking, all that came out from his mouth was only one simple and comforting sentence</p><br/><p>Looking at the expressions of the five of them, he suddenly realized that he did not need to say anything at all.</p><br/><p>These people knew.</p><br/><p>\"But, the situation might have worsened a little.\" Instead, Tony made Benjamin worried, \"When the Church was interrogating me, they revealed in our conversations that they have grasped all of our information. I don’t know whether they were trying to scare me but... Is everyone else okay?\"</p><br/><p>Benjamin nodded his head and said, \"They are fine; they are all hidden in the Candela Mountains. Temporarily, it is still safe.\"</p><br/><p>\"That’s good.\" Tony let out a breath of relief, and revealed a self-mocking smile, \"With that being said, it feels a little embarrassing that only five of us got caught.\"</p><br/><p>Benjamin smiled while shaking his head.</p><br/><p>After confirming that these five mages were all alright, he should focus his attention on the other two people who were in the cave.</p><br/><p>\"I owe you one, Miles.\"</p><br/><p>First, he nodded his head at Miles and after, he shifted his gaze towards the second person. He frowned and said, \"But... Why is His Majesty the King here?\"</p><br/><p>All he saw was a middle-aged man with weak features, dressed in ordinary army uniform, standing next to Miles. If it wasn’t for the System’s reminder, Benjamin could not even recognise that this was Carretas’s King.</p><br/><p>What happened?</p><br/><p>It was fine that he did not just obediently wait at the Palace, but why would he end up in a place like this?</p><br/><p>At this moment, the King himself also revealed an awkward expression. Hence, he waved towards Benjamin.</p><br/><p>\"Master Benjamin, we meet again.\" Maybe it was because he didn’t have his royal clothes and crown, he looked a bit tense, rubbed his hand and said, \"I know you must feel weird, but... this is the last resort!\"</p><br/><p>Benjamin couldn’t help but revealed an annoyed expression.</p><br/><p>\"... What is going on?\"</p><br/><p>\"Please let me explain.\" Miles shrugged his shoulder and slowly said, \"Originally….. I brought along with me these five mages of yours and were preparing to rush here at dawn. But just as I was saving them from the city, His Majesty gave me some news. Something about the return of the two Bishops and that the situation did not seem quite right.\"</p><br/><p>Benjamin frowned, \"... The situation did not seem right?\"</p><br/><p>However, during the timeline of the entire process, it might have been the red-haired Bishop whom he killed. Then after that happened, the two remaining Bishop went back to the Palace.</p><br/><p>At this moment, the King opened his mouth and explained, \"As they came back, the atmosphere around the Holy Knights were not the same - they were very tensed and they were all walking around the Palace. I could sense that they have realized that there was a traitor behind their back.\"</p><br/><p>When Benjamin heard that, he raised his brows as he was a little shocked.</p><br/><p>\"You are sure about that?\"</p><br/><p>The King nodded his head and said, \"You have to believe me. Basically, I only had one thing to do in the Palace, which was to observe Bishop Cameron’s demeanor. I have been observing him for almost half a year now, he has never looked like that - as if something was not right. With the news that these five mages were saved, it has definitely raised their suspicion. However, most importantly, a few strong guards who belonged to me could not be contacted anymore.\"</p><br/><p>Listening up to this point, Benjamin thought and said, \"What you are saying is... They have settled the issue regarding your guards and were prepared to make a move on you. Hence, you contacted Miles, then he secretly snuck you out of the Palace?\"</p><br/><p>The King wore a slightly shocked expression and forcefully nodded his head.</p><br/><p>Benjamin subconsciously raised his forehead.</p><br/><p>Truth be told….. It was still a little hard for him to believe.</p><br/><p>Just like that, a good King escaped from the Palace. Would this country, Carretes still be able to hold itself?</p><br/><p>\"Your Majesty, are you sure that they will make a move?\" Benjamin confirmed once again, \"Just in case you were thinking too much but a King disappeared from his Palace just to hide in this far and isolated wilderness? This cannot be fooled around with.\"</p><br/><p>If the Church did not intend to attack, this would simply be a huge mess up.</p><br/><p>\"I am very sure.\" The King nodded his head hard, said, \"They have always thought of putting some weird cross on me and I have always been very careful - I have never met with them alone. But this time... Master Benjamin, please believe someone in the royal family who is very sensitive towards danger. If I did not have this flair, I would not have survived until today.\"</p><br/><p>\".... Well, okay.\"</p><br/><p>Benjamin nodded his head, and couldn’t help but let out a sigh of relief.</p><br/><p>Now, they would not know the exact intention of the Church. With the current condition that the King had escaped from the Palace, there was nothing they could do. It has been quite awhile now, the Church must have taken action.</p><br/><p>But... Why did Benjamin felt such a headache?</p><br/><p>\"Your Majesty, since you’ve escaped from the Palace, what is your next move?\"</p><br/><p>The King blanked out and said, \"What more can I do? Of course gather the country’s loyal patriots, revive Carretas and chase those few Bishops out of my Palace!\"</p><br/><p>\"Then... What is there in the country that could gather these loyal patriots?\"</p><br/><p>\"That….. There should be one.\" The King was forced into a corner as he hesitated and said, \"Master Benjamin, are you one of the patriots?\"</p><br/><p>\"...\"</p><br/><p>Benjamin had nothing to say.</p><br/><p>His bravery was huge. Without asking a single word, he immediately threw it on his shoulders. To be able to make a prompt decision to leave the Palace was already quite brave move but before he did that, it would have been good if His Majesty the King could think about his next plan.</p><br/><p>This really gave him a headache.</p><br/><p>\"Then, shouldn’t the Generals in the country who hold military power also belong to Your Majesty?\" Giving it some thought, Benjamin replied, \"If we could get their support to seize back the throne, that should be quite an easy thing.\"</p><br/><p>The King went silence for a while and said, \"That... Even I cannot confirm. In the early days of building the country, they were all good leaders who were loyal to the country. But... I have not seen them for a very long time now.\"</p><br/><p>After Benjamin heard that, he had no choice but to shake his head.</p><br/><p>What more could he say?</p><br/><p>This King was honestly too lazy.</p><br/><p>Forget it... He shouldn’t put in too much hope. However, the King’s escape would take a huge turn towards Carretas. Though in Benjamin’s opinion, this outcome that was right in front of his eyes was much better than having the Church controlling the King.</p><br/><p>At least it was the King who chose to abandon him. Because of that, he has gained a large amount of strength.</p><br/><p>A part of it was named the strength of the \"royal power\"</p><br/>\n</div>"}