{"title": "Chapter 462: The Rescue Plan", "id": 462, "volume": 5, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-462-the-rescue-plan", "volume_title": "Volume 5", "body": "<h1>Chapter 462: The Rescue Plan</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 462: The Rescue Plan</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>\"So… You’ve finally arrived.\"</p><br/><p>After looking carefully and seeing that it was Miles he was speaking to, Benjamin gave a sigh of relief. It was good that Howl did not break his promise and had finally passed the letter to the restaurant run secretly by the royalty.</p><br/><p>If Howl had betrayed him and passed the letter to the Church, the Church might have brought a legion of men and horses over and surrounded him. He was grateful that the merchant was smart enough not to make the wrong decision.</p><br/><p>\"Things don’t look good.\" Miles said while walking over, \"I’m guessing that the thousands of corpses just north of Gealorre Capital should be your work? You should have cleared them up. Because of the corpses, Bishop Cameron finally has an excuse to force the royalty to issue a warrant for your arrest and seal up cities like this.\"</p><br/><p>Benjamin shrugged as he heard this.</p><br/><p>The Church was already going to take action against them, regardless of the corpses. Besides, it was impossible for him to stay there long enough to clear up all the corpses.</p><br/><p>In any case, getting clues about the five people was the most pressing issue.</p><br/><p>\"I had five mages under my command, they disappeared while passing by Amber City. I suspect that the Church had something to do with it. Do you have any news about it?\"</p><br/><p>Miles was somewhat surprised, \"Five mages?\"</p><br/><p>Seeing this, Benjamin’s heart surged with a feeling of bad premonition, \"... Has the Church killed them?\"</p><br/><p>\"No no no, most probably not.\" Miles quickly said, \"However, this evening, a group of Holy Paladins came into the palace carrying five huge gunny sacks. No one knows what was inside them.\"</p><br/><p>Five gunny sacks?</p><br/><p>Benjamin was startled.</p><br/><p>Were they really captured?</p><br/><p>\"Right… And the bishop? After the gunny sacks were brought in, what did the bishop do?\" He continued with his inquiries.</p><br/><p>\"Bishop Cameron disappeared, saying he had some things to sort out.\" Miles thought for a moment before answering, \"But… thinking about it now, I did not see him again after the gunny sacks were brought in.\"</p><br/><p>Benjamin took a deep breath.</p><br/><p>If he was not mistaken, the gunny sacks should contain his five men. As for the disappearance of the bishop… It was very likely that he had gone to interrogate the five mages.</p><br/><p>But, he did not know whether he should be happy or upset with the news.</p><br/><p>The five were still alive and were not killed immediately by the Church, but now they were in the hands of the Church and probably being interrogated by the bishop. Benjamin imagined the scenes that were probably taking place and his heart sank.</p><br/><p>Would they still be alive now?</p><br/><p>Benjamin desperately asked once more, \"Do you know which room the gunny sacks were brought into?\"</p><br/><p>\"I don’t know exactly where, but they are definitely somewhere in the palace.\" Miles squinted as he struggled to recall the details, \"Are you going to try to save them?\"</p><br/><p>Benjamin nodded his head.</p><br/><p>\"If you are really bent on doing so, I will not try to stop you.\" Miles did not seem to approve of his decision as he spoke doubtfully. \"But concerning the security inside the palace, you had best understand that there are now three people who sit as bishops in Gealorre Capital. The defence is as strict as a prison’s and if you’re counting on the king secretly letting you in, just forget about it. That won’t work either.\"</p><br/><p>However, Benjamin’s mindset had always been as tough as steel; he would not be scared off by these petty barriers.</p><br/><p>\"In that case, it might be very difficult for me to slip in.\" He contemplated the rescue method, \"But… Aren’t you very powerful? And you are also familiar with the structure of the palace, and have even got close to assassinating the bishop. Can’t you help me rescue them?\"</p><br/><p>\"...\"</p><br/><p>Miles seemed to be conflicted.</p><br/><p>\"You want me to help you rescue them from the Church?\"</p><br/><p>\"Yes.\"</p><br/><p>Miles rubbed his forehead and helplessly said, \"I am willing to help you. But… I’m sorry, I’m not ready to die yet.\"</p><br/><p>\"Surely, it can’t be that bad?\" Benjamin was slightly confused.</p><br/><p>\"Of course it is!\" Miles suddenly raised his voice. \"Do you know how difficult it would be to find the five of them, rescue them, and secretly bring them out of Gealorre Capital? The bishop may very well still be interrogating them, and because I do not know magic, I have no way to transfigure them out from under the bishop’s nose.\"</p><br/><p>Hearing this, Benjamin acknowledged the difficulty of the task, and nodded in agreement.</p><br/><p>Indeed… If the bishop was personally watching over them, it would be very tough to get his guys out.</p><br/><p>What could he do?</p><br/><p>All sorts of incantations flashed through Benjamin’s mind – he ran through every single one, not willing to give up. These were people who had followed him through the harshest of battles, he was not going to simply give up on them.</p><br/><p>\"Then… If the bishop leaves, could you rescue them?\" After thinking for a moment, Benjamin asked.</p><br/><p>Miles curled his lips in doubt, \"The bishop is fine where he is, why would he ever want to leave?\"</p><br/><p>Benjamin revealed an evil smile as he spoke, \"Because, tonight, the city gates of Gealorre Capital might get blown open. He will have to bring his men to come investigate the situation.\"</p><br/><p>\"…\"</p><br/><p>Miles was once again stunned.</p><br/><p>Benjamin continued to smile as a small waterball suddenly appeared in his hand.</p><br/><p>\"You… You are relentless!\" Miles snapped back to his senses and looked at Benjamin with eyes wide open, \"You really are a lunatic!\"</p><br/><p>After a moment of silence, Miles finally sighed helplessly, \"Alright… If you can really lure even a quarter of the Church’s people out of the palace, I will be able to rescue them.\"</p><br/><p>\"Then it’s a deal!\"</p><br/><p>\"... Yes.\"</p><br/><p>Thus, the plan was set. To save the people from the palace was indeed a difficult task, but where there is a will, there is a way; he was not ready to roll over and surrender just yet.</p><br/><p>Soon after, Miles returned once again to Gealorre Capital to prepare for the rescue operation. Benjamin, on the other hand, started preparing to blast the hell out of the city gates.</p><br/><p>Alright… Blasting the city gates was just an expression, he did not really intend to blow up the city gates. What Benjamin needed to do was just create some big havoc to lure the Church out.</p><br/><p>He suddenly thought of a better plan.</p><br/><p>He started to accumulate ice blocks inside the space of consciousness.</p><br/><p>The best way to lure them out was to expose himself. If Benjamin appeared near Gealorre Capital, the Church would not bother interrogating the mages under his command any longer and would simply rush over to confront him directly.</p><br/><p>Benjamin now needed a plan for what he would have to soon face.</p><br/><p>After about ten minutes, Miles would probably have returned to the palace, so, Benjamin started to act. He walked to the main road right outside the city gates, looked up into the sky and started reciting the icebreaking spell.</p><br/><p>At that moment, many dark clouds started to gather above the city gates of Gealorre Capital</p><br/><p>Following this, passersby and the soldiers alike stared confusedly at the sky as little ice blocks suddenly started to fall. At first, they were still sparse, but slowly the intensity started building up until eventually a torrential downpour of ice was raining on to them, forcing them to hide underneath the city gates.</p><br/><p>\"Wait… it this… hail?\"</p><br/>\n</div>"}