{"title": "Chapter 470: Moving Camp", "id": 470, "volume": 5, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-470-moving-camp", "volume_title": "Volume 5", "body": "<h1>Chapter 470: Moving Camp</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 470: Moving Camp</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Miles's efficiency was not bad. On the same afternoon, he had returned back to the temporary location in the Candela Mountains and reported to Benjamin the news that he had inquired when he was out.</p><br/><p>\"On a scale of one to ten, the implementation of the substitute is most likely eighty to ninety percent.\" He shook his head as he walked into the tent, revealing a helpless expression and said, \"Gealorre is very quiet. I could not go too far into the Palace but with the looks of it, everything seems as peaceful as before, as if nothing has happened.\"</p><br/><p>Benjamin could only nod his head when he heard about this but he did not show an overly disappointed face.</p><br/><p>After all, he was prepared.</p><br/><p>\"Except this, what else have you heard? It doesn't matter how it looks like, whether it's useful or not but just try to explain it. I need some inspiration,\" Benjamin asked.</p><br/><p>Miles nodded his head too and said, \"There is another news which I wanted to tell you originally - the Church's manpower in Gealorre has lessened and their manpower nearby has increased.\"</p><br/><p>... Manpower?</p><br/><p>Benjamin's heart sank.</p><br/><p>\"The Church wants to surround us?\" He immediately asked.</p><br/><p>\"That is not excluding other possibilities. But, the Church clearly knows about your hiding in the Candela Mountains.\" Miles spread his hands and said, \"They might not be familiar with the Mountain's surroundings, hence why they haven't made a move yet. But... One day, they would definitely attack.\"</p><br/><p>Benjamin heard and let out a long sigh as he nodded his head.</p><br/><p>Of course, Candela Mountains was never a place to stay for a long period of time.</p><br/><p>And it goes without saying that there were a lot of beasts around this area; they would have to split people up according to the area, to keep watch twenty-four hours a day. If not, they most probably would get attacked. But now, the Church would be surrounding them anytime soon.</p><br/><p>-- That group of people wanted to come over to \"siege bandits\".</p><br/><p>Benjamin too, was clear that they could no longer stay in this mountain. Otherwise, there would not be a difference between them and the mountain bandits.</p><br/><p>\"Assist me with gathering everyone for a moment; we need to change our base,\" For this reason, he quickly opened his mouth to say.</p><br/><p>Miles frowned, \"Where do you want to go?\"</p><br/><p>Benjamin took a deep breath in and slowly said, \"To the fields on the North side.\"</p><br/><p>Miles went blank but he did not say anything other than nodding his head as he turned around and walked out of the tent.</p><br/><p>Just like that, with the situation outside confirmed, Benjamin had come up with a new decision. Barren mountains and unruly rivers might not be a good place after all - while the Church has not surrounded them yet, they should hurriedly switch their location to the field.</p><br/><p>Going back onto the field was not a rash decision that Benjamin came up within just a few minutes; he had contemplated it for a very long time now.</p><br/><p>Moving back to the field, they had to abandon a lot of things but he had his own reasons.</p><br/><p>Firstly, the lifestyle on the field and the city was completely different. The Church's infiltration there was zero and hence, they would not need to worry about having any eyes from the enemy finding out about anything. If they hid in the fields, within half a year, there was no way the Church could do anything.</p><br/><p>Secondly... It was those people on the field.</p><br/><p>When he passed by the field again, Benjamin and his crew smoothly solved the pestilence issue in the field, as well as imparting the knowledge of magic to the graziers. In other words, they were very welcomed on the field and they could get the support of the local crowd.</p><br/><p>Now that the Church was on a rampant, they could only run towards the field if they wanted to strive for development.</p><br/><p>Yet those mages under Benjamin, they too walked from the field and understood the situation. Regarding this decision, they did not disagree; they immediately packed their belongings and prepared to move.</p><br/><p>Maybe the only one who would object... would most probably be the King.</p><br/><p>\"...Going to the fields; does this mean you are ready to give me up?\"</p><br/><p>Benjamin packed his things while shooting him a glance. The King's expression was extremely worried as if he was the suspect waiting for the court's adjudicate and felt uneasy.</p><br/><p>Seeing that, Benjamin shook his head.</p><br/><p>\"We do not have the power to defeat the Church but we can only avoid their spearhead.\" He explained, \"The substitute has already been put on the throne. If we have yet gone into hiding, the Church will catch you before you could prove your identity. Then, we can convince nobody.\"</p><br/><p>When the King heard, he was stunned and said, \"Then... What about me?\"</p><br/><p>\"If you do have influential cronies, you can try to seek shelter with them.\" Benjamin said calmly, \"But if not... Then you can come with us to the field. Until the time is right, there is still hopeless in getting back your country.\"</p><br/><p>At this point, the King stood still and remained silent for a long time. His head was low, with both hands in a fist, as if he was resolving a fight that was going on in his mind.</p><br/><p>Benjamin did not care about him. Instead, he continued packing his things. Until he was done packing his suitcase, only did the King take a deep breath and said, \"I will go with all of you to the field.\"</p><br/><p>Benjamin raised his brows, turned around and said, \"You have thought about it?\"</p><br/><p>The King nodded and said, \"I will definitely get captured by the Church if I stay in the city. As for those people who have the power to protect me in the country... Even if I walked in front of them, they might not recognize me.\"</p><br/><p>Benjamin laughed when he heard it. Using magic to lift his suitcase, he walked out while saying, \"Then let's go.\"</p><br/><p>The King took a long breath and nodded his head as he followed.</p><br/><p>Just like that, Benjamin and his crew took approximately an hour and more to pack their things. After that, they speedily took down the campsite and flew in the air, towards the Northwest side.</p><br/><p>The people of the Church might have already filled the sides of Candela Mountain. Hence, they could not go through the normal path. Instead, they could only go around the mountain to avoid the enemies' sight and slowly entered the field on the North.</p><br/><p>Along the journey, it would be certain that they would come across a lot of beasts, but no matter how brutal the beasts were, it would not compare to the Church's people!</p><br/><p>Luckily, on this path, they still had not come across any accidents.</p><br/><p>The Church's men were still on the lookout around, carefully investigating Benjamin's and his crew's location. Meeting those beasts along the way... maybe that would be a better luck but they did not meet those rare giant beasts like they did the last time. With over a thousand mages, normal beasts would not be a problem for them.</p><br/><p>In about a week's time, they carefully went around the enemy's territory and entered Carretas's huge field on the north side.</p><br/><p>\"I didn't think that I would be back!\"</p><br/><p>Taking advantage of the night, they flew into the fields. Suddenly, the System yelled in Benjamin's mind and nearly gave him a fright.</p><br/><p>\"...Can you please be a little more normal.\"</p><br/><p>As if the System did not hear what he said, it immediately turned around and said to Benjamin, \"Since we rushed here, have you thought of your next plan?\"</p><br/><p>Benjamin nodded his head.</p><br/><p>Entering the field, the first thing they needed to do was visit those whom they were familiar with before.</p><br/><p>Back then, teaching magic has gained him quite a few apprentices. And now, after quite a while, their buried seeds should have sprouted?</p><br/><p>Hence, even though it was late, they did not stop as they headed towards the inner area of the field. While the mages flew, they looked around at their surrounding, looking for the graziers' shadows.</p><br/><p>\"Hold up... What is that?\"</p><br/><p>However, they did not expect that after flying for about an hour, they indeed felt a sudden wave of magic oscillation. Moreover, it felt quite intense.</p><br/><p>At the front... There were mages battling?</p><br/>\n</div>"}