{"title": "Chapter 513: How to Anger A Queen", "id": 513, "volume": 6, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-513-how-to-anger-a-queen", "volume_title": "Volume 6", "body": "<h1>Chapter 513: How to Anger A Queen</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 513: How to Anger A Queen</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Faced with the Queen’s slowly darkening tone, the messenger’s expression did not show any changes, however.</p><br/><p>\"Of course I know I am in great danger.\" He said unflinchingly, \"But if I can use this single life of mine as an exchange for Your Majesty The Queen to carry a reputation for being brutal, so that the people would all think that mages are sinners who kill even messengers, then it would be worth this life of mine.\"</p><br/><p>Hearing this, the Queen raised her chin: \"Are you threatening me?\"</p><br/><p>\"I do not dare to threaten Your Majesty The Queen, but may Your Majesty pay heed, God is watching your every move.\"</p><br/><p>The Queen became quiet.</p><br/><p>The entire hall fell into a dead silence. She fixed her eyes on the messenger, her expression so dark that all the mages around thought the Queen was going to order them to strike. However, after over ten seconds of silence, the Queen suddenly let out a soft laugh.</p><br/><p>\"Interesting...\" She gave an insincere smile, and suddenly turned her head, speaking to the servants standing on the sides, \"Prepare a room for this messenger. He is, after all, a guest, and we seem to really get along, so of course, he must stay a few days more.\"</p><br/><p>The servants were startled. Regaining their senses, their expressions returned to normal as they nodded and turned around, leaving hurriedly.</p><br/><p>The messenger raised an eyebrow.</p><br/><p>\"Your Majesty... Are you planning to put me under house arrest?\"</p><br/><p>The Queen gave out a cold \"humph\", saying: \"So you get it. Good. Indeed, it would not be wise for me to kill you, but to make your life a living hell, that is still a perfectly easy thing to do.\"</p><br/><p>The messenger shook his head: \"How is this necessary? The request to decline is Bishop Cameron’s decision. I am only a messenger delivering the message. Even if you lock me up here for the rest of my life, the Bishop still wouldn’t change his mind.\"</p><br/><p>\"Yes, a collaboration is an impossible thing now.\" The Queen also nodded her head, saying, \"But at least, letting you suffer a little, my mages and I would be a little happier.\"</p><br/><p>\"...</p><br/><p>The messenger had no words to say.</p><br/><p>Under the gaze of the Queen, a few guards came up and surrounded the messenger tightly. The messenger’s expression looked rather defiant, but with such a huge crowd around him, he had no way to resist. He could only be obediently led away by these guards.</p><br/><p>However, the Queen did not do as she had said and prepare a \"room\".</p><br/><p>Several minutes later.</p><br/><p>\"You rascal, get in and stay there!\"</p><br/><p>In Hill City’s prisons, the messenger had been pushed into the deepest cell. With the dark and damp environment, as well as the straw all over the ground that stank of urine, a pig sty would have been better than this.</p><br/><p>After the guards shoved the messenger in, they locked the door, and glanced at him indifferently.</p><br/><p>Their eyes seemed to say, \"Just wait. This is only the beginning.\"</p><br/><p>The messenger also put on a frightened face in a timely manner.</p><br/><p>The guards shook their heads, turned around and left.</p><br/><p>Watching their backs leave, the messenger made sure that there was no one else around to look at him before he finally put away the fear on his face, revealing a nonchalant expression.</p><br/><p>\"Tut tut tut... Now you’re locked up. The legendary caging play. Don’t you feel aroused?\"</p><br/><p>At this time, the System’s voice suddenly rang out in his mind.</p><br/><p>\"Aroused my ass.\" The messenger— who was the disguised Benjamin— shook his head, as he took a look at the cell he was in and revealed a disgusted face, saying thus.</p><br/><p>\"Serves you right. Who told you to provoke them?\" The System said happily, taking pleasure in his predicament.</p><br/><p>Benjamin could not care less about it.</p><br/><p>Rubbish, of course he had to provoke them! If he had not provoked the Queen, how could he have created ill feelings and decrease the likelihood of a union between the Queen and the Church?</p><br/><p>Basically, this entire plan to disguise as a messenger and fan the flames of enmity between them was rather successful. After producing the identification documents, the people here had believed him immediately; there wasn’t the least bit of suspicion. Also, after a bit of disguise, the Queen, whom he had not met in a long time, did not recognize Benjamin, a mage she had once met at the Crusader Gateway.</p><br/><p>More importantly was that the Queen was still rather smart and did not plan to kill him. If Benjamin had overdone the provocation, and the Queen had really wanted to kill him, he would have had to use magic and escape, revealing himself.</p><br/><p>And now, he had been locked up. Although he was not sure why the Queen had done this, this was definitely the best way this plan could have unfolded!</p><br/><p>Thinking thus, Benjamin immediately started his work.</p><br/><p>—He chanted a spell in his heart to summon an ice blade, and began to carve words on the wall.</p><br/><p>After spending quite a few minutes carving out the words he wanted to leave behind, he activated intangibility and passed through the prison walls directly. Outside of the prison was a deserted street in Hill City; Benjamin changed his disguise as he observed the movement of the guards around him, and slowly left the area of the prison.</p><br/><p>Not long after, he became a black haired young man, looking like the people in Hill City; walking about on the streets as though nothing had happened, no one recognized him.</p><br/><p>However, the situation in the city was rather alarming to him.</p><br/><p>It was a city that had just been taken over, but the looks of the people were unexpectedly calm. Although the streets could not be said to be full of people, but they definitely did not feel empty or desolate. The people were quite careful, going about their ways in an orderly manner.</p><br/><p>Benjamin knew that this city had basically never resisted, and had immediately surrendered. But after being conquered, for the public security of the city to be maintain to such a standard, with no plundering, no chaos… Icor must have done a lot on their part.</p><br/><p>—The Queen was sincere in wanting to conquer Carretas, turning this into her territory and governing it.</p><br/><p>Benjamin could not help but feel slightly worried about the issue of reclaiming the land.</p><br/><p>With the King’s ability, was this really doable?</p><br/><p>At last, he still shook his head and threw the matter to the back of his mind. The Church was the huge mountain before them; they should first solve the problem with the Church, before thinking about how they could reclaim the kingdom...</p><br/><p>And so, the plan was successfully completed. Benjamin found an opportunity and drifted out of Hill City; he flew quickly out of Icor’s area of influence.</p><br/><p>Meanwhile.</p><br/><p>In the town hall of Hill City, the Queen furrowed her eyebrows at an escort mage.</p><br/><p>\"Why did you keep on giving me winks just now and not let me strike him?\" Her voice sounded rather unsatisfied. \"Just a messenger, if I kill him, the let him be killed. So what if the Church uses him in their articles? It’s just a little trick that isn’t even worth mentioning.\"</p><br/><p>The mage shook his head, and opened his mouth to speak: \"No... This man, I can faintly feel that his spiritual energy is extremely powerful. At the very least, he is on par with a Bishop. Keeping him here would definitely be more valuable to us than killing him.</p><br/><p>Hearing this, the Queen’s expression changed.</p><br/><p>\"On par with a Bishop... How can it be? Sending such a person here, what purpose can this serve the Church?\"</p><br/><p>\"I am also unclear, but it is still better for Your Majesty to err on the safe side. If Your Majesty had really insisted on killing him, I’m afraid he might had put up a fight, and possible even have hurt Your Majesty!\"</p><br/><p>The Queen took a deep breath, and nodded her head solemnly.</p><br/><p>\"...I understand.\"</p><br/><p>She was just unable to comprehend, if the Church had really decided to reject her conditions, then why not just send a messenger? Why had they sent a person who was as powerful as a bishop?</p><br/><p>Furthermore... That man, for a person who had the spiritual energy of a Bishop, had seemed a little too young, had he not?</p><br/><p>After a moment’s silence, she was suddenly startled, realizing something extremely important— for a man who was as powerful as a Bishop, the \"room\" she had prepared was not a place that could hold him.</p><br/><p>For a moment, she tapped her armrest, and called the guards over in a bit of a haste, asking about the \"messenger\".</p><br/><p>The guard did not understand the situation, but he still spoke: \"Your Majesty, nothing has happened. We have been standing guard at the door all the time, he is locked up in the deepest cell, and is submissive now.\"</p><br/><p>…...submissive now?</p><br/><p>At that moment, the Queen had the sudden urge to hit someone.</p><br/><p>\"Alright, you can take me there and show me how submissive he is.\" She took a deep breath, restrained her fury and said in a calm voice.</p><br/><p>The guard looked rather perplexed, but he also nodded in fear.</p><br/><p>After ten minutes or so.</p><br/><p>\"This is the submission you were talking about?\"</p><br/><p>They could only see that the cell, with the door still locked and intact, was empty; the person inside had vanished without a trace. Furthermore, what was even more startling, was the line of words carved into the wall of the cell.</p><br/><p>—Stupid old hag, wait for the punishment of the Holy Light, you will die a horrible death.</p><br/><p>The moment they saw the words, the few guards turned ashen white. They did not understand how the man had escaped, but at that moment, they could only anxiously bow their heads. They did not even dare look at the Queen’s reaction.</p><br/><p>As for the Queen herself...</p><br/><p>Her expression looked to be rather calm still, and the corners of her lips were even turning up, as though she was about to smile. However, if you would take a closer look, you would find that next to her remaining eye, there seemed to be a throbbing vein...</p><br/>\n</div>"}