{"title": "Chapter 525: The General Who Sang a Different Tune", "id": 525, "volume": 6, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-525-the-general-who-sang-a-different-tune", "volume_title": "Volume 6", "body": "<h1>Chapter 525: The General Who Sang a Different Tune</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 525: The General Who Sang a Different Tune</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Benjamin’s words caused obvious hesitation among the soldiers below. However, this was their battleground, and they were ready to start their massacre with their weapons raised high, their veins popping with adrenaline. As a battle instinct, they had temporarily shut out all of the distractions, and continued to rush forward.</p><br/><p>\"Sh*t….\"</p><br/><p>Benjamin frowned when he saw the priests started chanting within the enemy lines.</p><br/><p>\"Forget it. We should calm these soldiers down first,\" Benjamin turned to face the mages beside him and said. Then, all at once, he released the ice fog stored in the Space of his Consciousness and directed them straight below.</p><br/><p>Below them, the two forces would clash very soon. The King’s soldiers held their shields high and formed a defensive circle. The archers and the gunmen within the circle had started to aim, preparing to shoot at any notice.</p><br/><p>The enemy was pretty similar in their preparations, too.</p><br/><p>However, just as they were about to come into contact, a circle of ice mist descended from the sky and blocked the space between the soldiers of the two sides. Some mages also cooperated to summon gusts of strong wind to billow over the enemies, causing them to slow down their charge.</p><br/><p>Now, the soldiers who led the assault finally stopped in their steps.</p><br/><p>\"Generals and soldiers, please listen to me. Please do not be deceived by these priests from the church. Once you take this step, you will become the king-killing sinners of Carretas. Why should we fight amongst ourselves when the true external enemy was just standing before us?\"</p><br/><p>As he spoke, Benjamin supported the King to rise to the sky from the ground. The king held the sigil up high as he surveyed the circles of soldiers who surrounded them.</p><br/><p>\"Enough! All of them are liars!\"</p><br/><p>The priests would never sit by and watch the King’s actions. However, they did not directly face Benjamin in the sky as they were probably cautious about his abilities. Instead, all of them within their group shouted at the soldiers, urging them to charge further.</p><br/><p>Not only that, Holy Light was seen pouring out from their palms, and they immediately flew towards the ice fog that separated the two soldiers. Within seconds, Benjamin’s ice fog had visibly thinned as it was cleansed by them.</p><br/><p>Benjamin’s face darkened at that.</p><br/><p>The combined power of thousands of priests was not something that he could handle alone.</p><br/><p>However, he must hold down the fort.</p><br/><p>He created an endless amount of ice fog that rushed around the soldiers, and the other 20 mages were also working hard to block the flying Holy Lights. If these things did not form a barrier between them, the Grenade of Holy Lights launched by the priests would land directly among their soldiers. The damage would be terrifying.</p><br/><p>At the same time, Benjamin quickly searched through the enemy’s ranks for the generals.</p><br/><p>The church’s control over the army was established through their control on the generals. If he managed to convince these generals to sacrifice their lives instead of living under the church’s control, he would be able to immediately change the entire situation!</p><br/><p>However, at this moment….</p><br/><p>\"What are you doing, General Hawk?\"</p><br/><p>A shadow breezed past the ice fog and barged into the lines of the enemies, totally ignoring the Grenades of Holy Light that flew towards him. As quick as lightning, he breached the circle of soldiers of the enemy, and it took him no time to reach the outermost layer of the circle. Then, he placed his hands lightly on the shoulders of a man.</p><br/><p>The shadow was Miles. He was immune to the blasts of magic flying through the air. Thus, he ran straight into the enemies.</p><br/><p>The man whom Miles patted on the shoulder was coincidentally a familiar figure, too.</p><br/><p>It was General Hawk.</p><br/><p>The man who ‘sought refuge’ with the King - the man who said that he had committed suicide out of honor, the man who announced that his soldiers would meet the King and his men here in the campsite. The man was General Hawk, and he was currently standing in the enemy lines.</p><br/><p>The King was shocked, to say the least.</p><br/><p>\"G-General Hawk, why did you betray me?\" The King bellowed after a prolonged silence, and his furious cry was deliberately amplified by the mages, to spread it around the battlegrounds.</p><br/><p>General Hawk tensed at the contact, and he turned to look at Miles, who stood behind him, with unbelieving eyes.</p><br/><p>\"You…. How did you get here? Quick! Anyone! Kill this assassin now!\"</p><br/><p>That demeanor was totally different than how he behaved when he came to see the King. The King did not catch that due to the sheer distance between them, but Benjamin’s senses caught everything down to the seconds.</p><br/><p>Benjamin’s heart was cold.</p><br/><p>So, everything was a trap, huh? The empty campsite was a trap laid by the church. No wonder there were no bodies there. The blood was fake, and the real soldiers were now within the assaulting circle, preparing to take them down.</p><br/><p>Such irony…..</p><br/><p>The soldiers around General Hawk started to gather in an attempt to subdue Miles. However, it was obvious that they were not even on the same level as the man; his shadow moved and crashed among the lines like a ghost, wrecking chaos within the men. He managed to attract a significant amount of energy from the priests, which greatly alleviated the pressure on Benjamin.</p><br/><p>He nodded and gave the King a look.</p><br/><p>The King, who was right beside him, understood.</p><br/><p>\"Soldiers, Icor is right outside our door now, and your families and friends back at home are probably suffering the assault of the war. However, do you know what the church is doing? They sent ambassadors to negotiate with Icor’s army. They wanted to sell Carretas to Icor!\"</p><br/><p>These words finally caused the soldiers to halt their actions. They raised their heads up to the sky and looked at the King.</p><br/><p>With his arms outstretched, the King threw a number of verification documents to the ambassadors. These documents flew towards the soldiers.</p><br/><p>This was premeditated by the King and Benjamin to be used when they were attacking Gealorre. However, since it did not seem like the Church wanted to have their final battle at Gealorre, there was no use in keeping this up their sleeves anymore.</p><br/><p>Everything would be worth it once the soldiers turn against the church!</p><br/><p>The priests looked extremely agitated at the statement. In a blink of an eye, the few verification documents were obliterated by flashes of Holy Light.</p><br/><p>\"What are you waiting for? Charge!\" General Hawk barked as he urged his soldiers on. \"It was just a layer of fog! Charge! Don’t behave like cowards!\"</p><br/><p>However, the soldiers’ eyes upon the general were no longer the same.</p><br/><p>\"The documents….. Could it be real?\"</p><br/><p>Benjamin smirked as he continued to float in the sky.</p><br/><p>What were they even thinking? Destroying the documents entirely would only destroy the trust of the soldiers. Now, the accuracy of the documents was confirmed.</p><br/><p>That was an extremely foolish move. Though they had no proper command, their reaction to unplanned events was indeed rash.</p><br/><p>The King continued, \"Generals, I know that you have crosses planted in you. I know that you do not have a choice, that you were forced to become slaves of the Church. However, do you still remember the vow in which you swore when you were elected? What are you doing when our country is now facing immense threats?\"</p><br/><p>There were a total of 4 generals who led the soldiers in the circle. Aside from General Hawk, the other three dipped their chin, visibly hesitating.</p><br/><p>Apparently, they felt quite displeased by how they were tricked and became forcibly controlled by the church.</p><br/><p>Well, General Hawk was the only exception.</p><br/><p>\"Enough, you’re a liar! Soldiers, do not believe him! The real King resides in Gealorre, and His Majesty is waiting for our glorious return! Charge!\"</p><br/><p>Miles’ voice rose from behind him.</p><br/><p>\"The true King would not start a fight with his own people. He would not ignore the external threats to the kingdom.\"</p><br/><p>Hawk was stunned. Before he could react, a cold glint flashed by his eyes, and blood was splattered everywhere. His arm, that had a crossed carved on it, flew diagonally into the air.</p><br/><p>Miles caught the dismembered arm and tore off the sleeves to show the cross to the surrounding soldiers.</p><br/><p>\"Look. The general that you looked up to was the church’s puppet all along.\"</p><br/><p>Hawk collapsed to the ground, blood gushing out of his cut like a fountain. His eyes were wide, and tremors wrecked his body while he formed cut-off noises and syllables. Miles’ attack was probably too surprising, and he behaved just like a chicken that had its throat slit and its blood splatter. He was so in shock that he could not even scream in pain.</p><br/><p>The soldiers around him no longer looked at him.</p><br/><p>Instead, they turned to look at the arm that was raised by Miles. Shocked realization colored their cheeks.</p><br/>\n</div>"}