{"title": "Chapter 528: The Return to the Palace", "id": 528, "volume": 6, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-528-the-return-to-the-palace", "volume_title": "Volume 6", "body": "<h1>Chapter 528: The Return to the Palace</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 528: The Return to the Palace</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Just as Benjamin predicted, the dispatch of the Church’s battalion had Gealorre Capital’s defense at its weakest. A few hundred Holy Knights stood by the city gates were at wit’s end, not knowing what to do. Decades of Priests surfaced out and caught a glimpse of Benjamin from afar, and ran the other way.</p><br/><p>When the ice blades poured in heavily, the Holy Knights guarding the city gates nearby could not withhold one bit.</p><br/><p>After a few rounds, these Holy Knights were pretty much dead. The Priests had no intention to meet head-on as they started to retreat while holding onto their shields.</p><br/><p>They were escaping as if at a snail’s pace that Benjamin was simply too lazy to chase after them. After taking care of a few without extra effort, he descended onto the city gates and cranked open the wheel mechanism to open the gates of Gealorre.</p><br/><p>\"What happened? Are the gates finally opened?\"</p><br/><p>From the loud clank of the gates opening, the people of Gealorre walked to the end of the street and looked out with shocked faces.</p><br/><p>At the outer end of the door, the only thing they saw was the King adorned with the royal crown and dressed in a long robe, walking in at a slow pace.</p><br/><p>Benjamin flew down from the front and landed at the street entrance of Gealorre, only to bow at the King, \"Welcome back Your Majesty.\"</p><br/><p>Looking at this scene, the people of Gealorre would be silly if they still did not understand what was going on. They gathered towards the direction of the King and all bowed with excitement.</p><br/><p>\"Yo-your Majesty, you’re finally back!\"</p><br/><p>The people here, who had been shut off inside Gealorre had slowly seeped into a state of panic.</p><br/><p>News from the outside could not be shared in here and they did not know where the battle of Icor has gotten to. More importantly, the rumors about the impersonator King had got out of hand, and yet the \"King\" in the palace still had not made an appearance. Moreover, a group of Holy Knights and Priests that came out of nowhere had gone over these people’s head under the name of the ‘state religion’.</p><br/><p>They hid, rebelled, protested... The people of Gealorre took different actions but in the end, all efforts were suppressed by the Church and it was even wishful thinking for them to step out of the city.</p><br/><p>Hence, when they saw that these out-of-nowhere Holy Knights were killed, the city gates opening, and the King reappearing before them, they were flushed with emotions.</p><br/><p>Those days of the past... would they finally end?</p><br/><p>\"Please stand. I have disappointed you on the days I was not with Gealorre.\" The King nodded and gestured the crowd to get up, \"From here on out, I will return to the palace and the gates of Gealorre will no longer be sealed.\"</p><br/><p>The people stood up. Many of them stared at the King with an expression as though they were dreaming. It seemed like they were still in disbelief.</p><br/><p>The King, who was accompanied by Benjamin, did not say more and started to pick up his pace towards the Palace.</p><br/><p>The crowd parted a path and sent off the King with their gaze. A lot more people walked towards the street. The majority of them still were not aware of what was going on but they slowly came to a realization after seeing the King making his way to the Palace.</p><br/><p>\"His Majesty... His Majesty has returned?\"</p><br/><p>\"Yes, I must let you know that that mage is awesome. One blow from him and all the Priests ran away. His Majesty too mentioned that now that he’s back, the city gates will be opened again!\"</p><br/><p>In Gealorre, there wasn’t that many who knew about the happenings but through word of mouth, the return of the King quickly spread throughout the entire city.</p><br/><p>The King's walk towards the palace became such a ritual.</p><br/><p>Normally, he would be sitting in a heavily ornamented horse carriage or riding a horse with a large group of followers behind, gallivanting the city of Gealorre. However, now, he could only walk with Benjamin with a smile on his face, nodding and acknowledging the people on both sides of the streets from time to time.</p><br/><p>The people of Gealorre were surprised.</p><br/><p>For a familiar face, they had found that His Majesty seemed to have changed.</p><br/><p>Of course, there were people who jumped in to create havoc, saying that this King was also a fake, and there were also assassins hidden within the crowd who suddenly charged over to assassinate the King. But all these were not a problem with Benjamin’s sensing technique.</p><br/><p>Before any assassins could get close, they were already frozen into ice sculptures by a wave of ice fog and smashed into pieces. Those causing a stir had been searched for an identification of the Church by Benjamin and tossed into the crowd for people to decide their fate.</p><br/><p>Those who sang a different tune under this circumstances would be the pawns of the Church.</p><br/><p>He had to give it to them, these pawns were more daring than the Priests. Perhaps it was because they carried no burden and were willing to sacrifice themselves to see if they could stop the return of the King.</p><br/><p>But... at this very moment, there was no one who could stop them any longer.</p><br/><p>The distance from the city gates to the palace was not a long one but the King walked for almost an hour. Benjamin knew that he would be aching everywhere but his face bore no signs of backing down.</p><br/><p>Reaching the palace, the once magnificent stately building looked deserted and bleak.</p><br/><p>\"You-your Majesty... You have returned.\"</p><br/><p>An old housekeeper stood at the entrance of the palace, leading servants of no more than ten. He bowed before the King and wiped the tears from his eyes as he spoke with a trembling voice.</p><br/><p>\"Yes, I have returned.\" The King nodded with a sigh of emotion, \"Where are the others? Why is it only you here?\"</p><br/><p>\"They... They could not take the Church anymore so when there was a riot in the city, they took the opportunity to escape out of the palace. Another batch of them left when the fake King was assassinated. Only a few of us are left in the palace.\"</p><br/><p>The King couldn't help but sigh.</p><br/><p>\"Thank you for the trouble you have been through.\" He helped the housekeeper up, \"I will not forget the loyalty you have for the royal family.\"</p><br/><p>The palace had deteriorated quite a bit. To restore it to its original state, it would definitely require a lot of work. But the group of servants stared at the King with such hopeful eyes.</p><br/><p>Before this, His Majesty was a docile person and hardly ever reprimanded them who were mere servants. Now... His Majesty still seemed amiable but looked as if there was something more to him.</p><br/><p>The servants were overjoyed to welcome the King back into the palace.</p><br/><p>Everything would be better with the return of His Majesty, right?</p><br/><p>They thought.</p><br/><p>\"Mage Benjamin, please enter too. I will let them arrange a place for you to rest.\" The King turned to speak to Benjamin, \"See, the chef is still here and has not left. I’ll have them prepare a feast for you.\"</p><br/><p>Benjamin shook his head with a smile.</p><br/><p>\"Please rest, Your Majesty. I still have things to attend to.\"</p><br/><p>The King was hung up for a moment but did not ask further. Instead, he nodded, \"Alright. Once the larger troops arrive, I will divide out an area for mages in the city. We will talk more when we celebrate the victory.\"</p><br/><p>Benjamin nodded and turned to leave.</p><br/><p>It wasn’t that he didn't want to rest. It was just that the current Gealorre did not truly belong to the King. The Church was in control for far too long and there were still many pawns lurking in the city. Benjamin could sense more than a hundred on his journey.</p><br/><p>They were the ticking time bombs buried in Gealorre. They have yet to appear but once they explode, trouble would stir. They would not live in peace as long as these people were not wiped out.</p><br/><p>Benjamin did not wish that a place that he laid to rest would be prowling with a nest of Priests.</p><br/><p>Hence, once he had confirmed that there was no danger within the palace, Benjamin flew to the skies again and activated his water element sensing technique, working hand in hand with the System’s scan of the city. One by one, he harvested the pawns the Church buried here.</p><br/>\n</div>"}