{"title": "Chapter 534: Confusion", "id": 534, "volume": 6, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-534-confusion", "volume_title": "Volume 6", "body": "<h1>Chapter 534: Confusion</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 534: Confusion</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>After returning to Gealorre, the King continued sending people to Icor to gather information.</p><br/><p>This discussion was not really a secretive thing, many of those in Carretas were discussing about it. But the ending of the Queen fainting would obviously spread very quickly amongst the citizens. All of sorts news gave the King a huge headache.</p><br/><p>Under these circumstances, it was hard for the King to find reliable information. Thus, he could only send messengers to hear from Icor.</p><br/><p>But...at last, not one came back.</p><br/><p>At the North of Carretas was Icor’s encampment, right now it was probably under lockdown with various military methods, so no one would be able to leave. The troops just remained in there, not attacking or retreating, so no signs of any action showed.</p><br/><p>This made the King suspicious.</p><br/><p>In the grand hall fo the palace, tons of people remained there asking all sorts of annoying questions.</p><br/><p>\"I think, there is probably a lot of chaos amongst them right now.\" The general spoke and said,\" The Queen does not seemed to have been cured yet, if not Icor would not be like that. Your Majesty, this is a chance, we should seize the opportunity to claim back our land from the enemy!\"</p><br/><p>The king hesitated:\" But...if we really attacked, would it not be claiming that we were the one that shamelessly tricked our opponents?\"</p><br/><p>\"If we win, we will be the ones writing history.\" The general was the main strategist, and thought they could not miss this opportunity, so he advised,\" Icor was the one that waited until there was chaos in your kingdom to strike. Right now, they killed our messengers. We have enough reason to attack, people can’t say that we are wrong.</p><br/><p>When these words were uttered, tons of officers in the hall all nodded.</p><br/><p>\"The general is right, I think we should start war as well.\"</p><br/><p>\"Rash decisions should not be made...if there was a trap, it would be us walking into it.\"</p><br/><p>\"With the chaos right now, we can try to send troops, to see what is the actual situation at Icor. If it was a trap, we can retreat in time.\"</p><br/><p>\"This is rather sensible…\"</p><br/><p>In short, most of the officers agreed. Just like if your enemy was suddenly struck by a meteor from the sky, would you step on him, or you would help pull him back up? Most of them would do the latter.</p><br/><p>Of course, there were people opposing as well, but most of their voices were drowned out.</p><br/><p>The King saw the arguing crowd, then lowered his head, not saying aynthing.</p><br/><p>\"Your Majesty, what are your views…\"</p><br/><p>Finally, the King waved his hand and said:\" The rest of you can leave, this is an important thing, we should think of it for longer. Mage Benjamin, stay back, I have things to discuss with you.\"</p><br/><p>The officers heard this and all nodded and left, only leaving the King and Benjamin in the hall.</p><br/><p>The King looked at Benjamin.</p><br/><p>\"What do you think?\"</p><br/><p>Benjamin sighed:\" I think it’s a trap. The Queen fell rather coincidentally, all of it is too beneficial to us, maybe it was someone doing this on purpose.’</p><br/><p>The King nodded. They were the ones that saw the Queen spit blood and faint themselves, so they would not think that everything was so simple.</p><br/><p>\"What do you think we should do?\" He asked.</p><br/><p>\"We have to try.\" Benjamin said,\" If it was related to the Church, us not doing anything would give the Church the opportunity to move first. If the Queen really died from this, then Icor would be a huge cake, whoever moved first would get more of it.\"</p><br/><p>\"So...you think we should send our troops?\"</p><br/><p>Benjamin hesitated and said:\" No. If it was a trap, the soldiers would be caught in it. I think, we should send people to investigate.\"</p><br/><p>The King showed a helpless look, crossed his hands:\" Have we not been sending people? But all the information we get are too mixed up, there is no way we can get our hands on useful information.\"</p><br/><p>Benjamin nodded.</p><br/><p>Yes...with the current situation, it feels like someone pulled his on purpose. All sorts rumors are being spread amongst the citizens, making them feel confused and not being able to find the source of it.</p><br/><p>\"If it’s like this, I can be the one to go scout.\" Miles suddenly walked in and shrugged, saying,\" Well...if it’s not the Church, then it’s the mages, and both sides would not be able to do anything to me.\"</p><br/><p>The King was stunned: \"Are you able to?\"</p><br/><p>\"Your Majesty can appoint me as a messenger, did the previous messengers all not make it through?\" Miles replied,\" I am not the same as time, I will definitely not be made to stay.\"</p><br/><p>\"...Really?\"</p><br/><p>To this, Benjamin was suspicious.</p><br/><p>If it was like before, even after half a month, there was no news, making them wait at Gealorre without anything.</p><br/><p>\"What else can we do?\" Miles crossed his arms and asked helplessly.</p><br/><p>Benjamin thought and said:\" How about this, I go with you. You be the messenger, I’ll fly or dig a hole, one of us doing it overtly and the other covertly. If you disappear without a trace, we won’t know a thing if you went alone.\"</p><br/><p>\"...alright.\"</p><br/><p>Miles was silent for a while and nodded. The King was this and did not object to it. With the confusion right now, based on instinct, he was sure that it was not good to act rush and send his troops.</p><br/><p>Wait till the both of them made clear of the situation, then he would have an idea.</p><br/><p>.With this, Benjamin and Miles left the palace and departed from Gealorre immediately, hurrying towards the encampment of Icor. Miles has been appointed as the messenger, and sped on the plains with a horse. Benjamin flew in the sky to observe the distance.</p><br/><p>There was no incident on the way. Maybe because of the current situation, there was not much people on the roads, there were occasionally one or two horse carriages passing by.</p><br/><p>After a day, the two finally reached the encampment of Icor.</p><br/><p>\"Halt! A step further and we will attack!\"</p><br/><p>Miles raised his eyebrows and held out a seal of proof, showing it to the guards. The few of them looked at each other, mumbling something like ‘why did they send more’ kind of stuff, took over the certificate, and said angrily: \"Wait here, we will report this to the higher-ups.\"</p><br/><p>Miles nodded and waited patiently after dismounting.</p><br/><p>Benjamin waited behind a boulder nearby, he used the boulder and started digging.</p><br/><p>Icor has blockades around here already, him sensing with his water elemental sensing technique could not really make sure what was going on inside. It was too risky to fly, so it is better walk underneath, most people did not have any preparation to this.</p><br/><p>But, right when Benjamin conjured a few ice pickaxes and started digging, at the blockade, a bunch of soldiers rushed out, weapons in their hands, and surrounded Miles.</p><br/>\n</div>"}