{"title": "Chapter 549: Back in Ferelden", "id": 549, "volume": 6, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-549-back-in-ferelden", "volume_title": "Volume 6", "body": "<h1>Chapter 549: Back in Ferelden</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 549: Back in Ferelden</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>\"This is indeed an interesting preposition. Once you’ve finished your construction, I will bring my men for a visit. If you could really raise excellent mages, you would face no problem in terms of resources.\"</p><br/><p>A month later, Benjamin met with Mage Vinci at a restaurant in the City of Snow. After listening to Benjamin’s introduction about the Academy of Magic, Mage Vinci looked very interested as he talked to Benjamin.</p><br/><p>The construction of the Academy carried on in an organized manner, but it was unwise for Benjamin to remain at the construction site to just move bricks around. What the Academy needs is the support from different forces across the kingdoms, and Ferelden undoubtedly has the largest amount of free mages among the nations.</p><br/><p>Thus, he returned to the capital of Ferelden alone.</p><br/><p>After experiencing the turmoil, Ferelden’s situation was worsening by the day. However, the only person that did not get affected much by the circumstances is Mage Vinci. As the richest man in the kingdom, his influence was the most important thing Benjamin needs now.</p><br/><p>\"After the Academy is completed, I will definitely invite you to join the opening ceremony,\" Benjamin laughed, \"However, I do hope that you would help us in spreading the news in Ferelden, thus helping us obtain more students.\"</p><br/><p>Mage Vinci looked surprised by that. \"...Oh? I thought the Academy only accepted the citizens of Carretas.\"</p><br/><p>\"Of course not. Our Academy is open to the people of all nations that are interested in magic. Don’t worry about the politics, I’ve already signed an agreement with the King of Carretas. The people that enroll into the Academy are not required to serve a specific country.\" Benjamin immediately replied.</p><br/><p>Vinci still looked amazed even after Benjamin’s explanation. \"How did you manage to do that?\" He asked, curious, \"Honestly, someone that is as powerful as the King would never let such a big slice of cake escape right before his eyes.\"</p><br/><p>\"That’s simple.\" Benjamin was smiling. \"I was the one that made him king again.\"</p><br/><p>Actually, if Benjamin wanted more power, he could totally replicate the methods of the Church to plant some sort of curse onto the King. He would then gain control over Carretas.</p><br/><p>The King obviously understood this. That was why he was so decisive when he was doing his part in the exchange.</p><br/><p>\"Ahh, so that’s what happened. It seems that the rumors were true.\" Mage Vinci nodded. \"They said that you’re the Kryptonite of the Church. You went to Ferelden and chased the Church just after they gained their power, and when you arrived in Carretas, you chased them away just as they rose to power. You’re quite famous now, you know?\"</p><br/><p>Benjamin just smiled.</p><br/><p>\"Don’t worry. I will spread the news among the mages within Ferelden. With your fame, I wouldn’t even need to spend much effort.\" Mage Vinci said.</p><br/><p>\"Thank you for your favor.\"</p><br/><p>\"This was not even a favor. All of Ferelden owed you a debt when you left in a hurry after chasing the Church away. Even the people of the Mage Guild wouldn’t be against this.\"</p><br/><p>Benjamin nodded in satisfaction.</p><br/><p>Talking about the Mage Guild, he knows that General Stuart has started a new Mage Guild among the mages in Ferelden. It is a mage organization that worked purely for its government, and thus it can be considered as a competitor of the Academy of Magic in some aspects.</p><br/><p>Thankfully, according to the news he obtained after he returned to Ferelden, this Mage Guild did not have much influence within the kingdom, and it was incomparable to the one in Icor. Most mages within Ferelden were still free spirits.</p><br/><p>In Benjamin’s schedule, he would soon meet the chairman of the Mage Guild after the meeting with Mage Vinci. After that, he would meet with General Stuart.</p><br/><p>This meeting was inevitable. Although the relationship between Benjamin and General Stuart was not exactly hostile, it was indeed peculiar. The General used him as a pawn to snatch the crown, and even had the intention to eliminate Benjamin after he failed to convince the youth to stand by his side. However, they did not exactly get into a conflict, and after time has passed, they could still sit across each other for a good chat.</p><br/><p>Everything Benjamin did was for the Academy of Magic. Benjamin might also need to invite them to the opening ceremony.</p><br/><p>\"It’s getting late now, I’ll need to go to the castle to meet the General and his people. Mage Vinci, we always welcome your visit to Carretas.\"</p><br/><p>\"I will.\"</p><br/><p>Both men bid their goodbyes, and Benjamin finally left the restaurant. Without much rest, he walked to the castle in the City of Snow.</p><br/><p>He contacted the Prime Minister of Ferelden before he came. In the letter, Prime Minister Pace were extremely enthusiastic, and was very welcoming about Benjamin’s visit to the castle. Benjamin was not used to the sight; was this the same Prime Minister that was as cunning as a fox?</p><br/><p>\"Are you Mage Benjamin? Quick, Her Highness the Princess is waiting for you in the hall!\"</p><br/><p>Just when Benjamin arrived at the door, numerous guards and servants who were standing by the door greeted Benjamin happily. Benjamin did not say much, and he nodded before he followed their lead into the castle.</p><br/><p>It was long since he came here.</p><br/><p>After he walked past the familiar walkways, Benjamin soon found himself in the hall of the castle. There were more people than he imagined in the hall, as General Stuart, Prime Minister Pace, an unfamiliar mage, and even the long-lost Mikel were standing in the hall. When Benjamin entered the hall, he hid somewhere behind and greeted Benjamin.</p><br/><p>On the other hand, the princess sat on the throne, entirely distracted.</p><br/><p>This was basically the situation in Ferelden. The princess became a tool due to the cruel handiwork of others, and the General governs the kingdom behind her, acting basically like the King. Apparently, he even prepared to let his grandson to marry the princess. After that, the heir of Ferelden would be of his blood.</p><br/><p>This was considered to be one of the gentler ways to take over the crown.</p><br/><p>Benjamin sympathized with the princess, and also the grandson of the General. However, that is how politics work, and he was in no place to interfere. Besides, if the General is good in his tactics, it was probably a good news for the mages in Ferelden.</p><br/><p>At least, it would be difficult for the Church to infiltrate the government.</p><br/><p>\"Greetings to Her Highness.\" Benjamin bowed as a sign of respect as he thought. After that, he turned to look at General Stuart, the man who once used him as a chess piece.</p><br/><p>He would temporarily set their issues aside for the Academy of Magic.</p><br/><p>\"We meet again, General.\"</p><br/><p>General Stuart smiled widely as he looked at Benjamin. \"Indeed. Initially, I intended to convince you to stay and be the Guild Master for the Mage Guild, but who knew that you would manage to achieve such great heights! The youths nowadays are indeed impressive. Quick, bring a chair for Sir Benjamin the Mage, and prepare some wine. How could you allow such a gracious guest to stand like this!\"</p><br/><p>Benjamin arched his eyebrows.</p><br/><p>What are they planning now?</p><br/><p>Only the princess was sitting in the hall. Although she was dozing off on the throne, the General remained standing, in honor of the royal etiquette.</p><br/><p>This enthusiasm seemed too forced to be genuine.</p><br/><p>No one could blame Benjamin for his suspicions. He did come to resolve their previous odds, but this attitude of the General was too different from what he imagined. He was slightly taken aback by the turn of events.</p><br/><p>\"There’s no need for that. How could I sit when everyone was standing?\"</p><br/><p>\"Well…. Since Mage Benjamin insisted, we’ll follow your wishes then.\" The General waved his hand as he said offhandedly. The servants by the side got the short end of the stick, as they had been moving the chair in and out of the halls. They had no idea what to do.</p><br/><p>Benjamin nodded before he looked at the mage beside the General.</p><br/><p>\"This mage is probably the new Guild Master of the Mage Guild, right?\"</p><br/><p>The mage looked mature. After he heard Benjamin’s comment, he held his bearded chin as he nodded. He did not seem overly cold or happy, thus he seemed much more genuine than the General.</p><br/><p>\"Nice to meet you. I’m Benjamin.\"</p><br/><p>\"The famous Mage Benjamin. My name is Steve, and I’ve heard much about you.\"</p><br/><p>Both of them exchanged brief greetings. The mage did not seem to like Benjamin very much, as he looked cold even though his words were diplomatic. This was very different with what he experienced with Mage Vinci.</p><br/><p>However, Benjamin cannot be bothered by this. Instead, he immediately got into the main topic.</p><br/><p>\"Mage Steve, General Stuart, I’ve recently started building a new Academy of Magic. The construction would probably be complete after one or two months, have you heard any news about this?\"</p><br/>\n</div>"}