{"title": "Chapter 556: Return to Icor", "id": 556, "volume": 6, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-556-return-to-icor", "volume_title": "Volume 6", "body": "<h1>Chapter 556: Return to Icor</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 556: Return to Icor</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>After handing over some work to the first minister at the City of Snow, Benjamin left Ferelden.</p><br/><p>With the treaty signed and the deal made, there was no need for him to personally attend to the rest of the matters. For advertising, recruiting and so on, he had already hired professional workers to take responsibility of the daily work at the magic academy in Ferelden so that he did not need to worry about anything as the head of the academy.</p><br/><p>For someone like Benjamin, it would be best for him to just open up a path and let the others follow it.</p><br/><p>As he had already created the path in Ferelden, the next would be Icor.</p><br/><p>The mage academy was located near the border in order to achieve a communication in the magic circle connecting three countries. To form an organization with international influences, Icor must be included since it has the most mages.</p><br/><p>However... Benjamin knew that opening this path would be as difficult as cultivating a fertile land in the desert, almost impossible.</p><br/><p>As the enmity between the Queen and them was huge, it would be impossible for them to reach a consensus so easily like how it was with Ferelden. Should Benjamin show up publicly in Icor, an attack from few thousands of mages would already be a sign of mercy from the Queen.</p><br/><p>However, he also knew that there were still a number of roaming mages who did not join the Mage Guild, being excluded by most of the mages and holding up hard at some remote corners. Benjamin had met some of them as he just entered Icor.</p><br/><p>These people would be the best to rope in.</p><br/><p>Therefore, he decided to take the risk and make a trip to Icor. The border at both the countries had a loose security. It would be easy for him to sneak in. He could achieve his goal without alerting the Queen.</p><br/><p>Not to mention... He also had acquaintances over there.</p><br/><p>\"Hello, please help me to deliver this letter to Regina and pass it to a guy by the name of Chief Silverfox. He is a registered mercenary, you will definitely find him.\"</p><br/><p>After entrusting that letter to the Mercenary Association, Benjamin then flew to Icor.</p><br/><p>In the borders of Carretas, the Mercenary Association was not active at all. Other than high-end mercenaries like Miles, there were not many other stronger mercenary groups. That was also why they had a huge fight with the Church previously, and why the Mercenary Association had no sense of belonging.</p><br/><p>- It was not just because they were interfering with the internal affairs of each country, but also because the greater mercenaries preferred heading toward Ferelden and Icor as there was no prospect of wealth in Carretas.</p><br/><p>Of course, the Mercenary Association would be an important organization in the development of the magic academy. When Benjamin contacted them before this, they expressed that there had been no clues of how the first batch of apprentices would be since the academy was not built yet. They would need to observe and evaluate for a period of time before they were willing to build a long-term, friendly partnership with Benjamin.</p><br/><p>Thus, Benjamin could only set them aside and personally scout for more mages.</p><br/><p>Using about two days and holding up a blister underneath the water, he smuggled through the border using the river stream. After a long time, he finally returned to Icor, but there was not much change to what he could see.</p><br/><p>The people in the Mage Guild were still very active everywhere, with the portraits of Benjamin and his men placed in arrest warrants hung in various regions.</p><br/><p>After disguising himself, he quickly flew to the capital, Regina.</p><br/><p>From the news that he had gotten along the way, he heard that the Queen had been very law-abiding recently. After the withdrawal of the troops, she had been serving in the Palace and managed governmental affairs as usual, yet her attitude had been more negative as compared to before. There was news that the Queen acted as though she was on menstruation every day and she was very grumpy, the officers would not even dare to speak too much.</p><br/><p>Benjamin guessed that it must be something to do with the ceremony that he had interrupted before.</p><br/><p>Regardless, the Queen and himself had already become mortal enemies. His trip to Regina this time was not meant to meet the Queen, so he wouldn’t care about that for now.</p><br/><p>Since the checking at the city gate was not very strict, Benjamin looked for an opportunity and sneaked into the city. With the help of the Mercenary Association, he finally managed to contact Chief Silverfox who was still active.</p><br/><p>\"When I saw the arrest warrant, I thought you would never return to Icor anymore in your whole life.\"</p><br/><p>Inside the room in the inn, the old man pushed the door open. He looked at Benjamin, and couldn’t help but shake his head and said that with a sigh.</p><br/><p>\"There is nobody who would never return.\" Benjamin laughed and said, \"What if I told you, one day I will even return to the Kingdom of Helius. You will not believe that, will you?\"</p><br/><p>\"... You’re good.\"</p><br/><p>With no facial expressions, the chief gave him a thumbs up.</p><br/><p>Quickly after that, they reminisced about the good old times. Benjamin then went straight to the point and said: \"Let us not talk about this. I believe you have already looked into the things that I told you in the letter?\"</p><br/><p>\"You arrived so quickly, how could I have the time to look into it?\" The chief said, \"But regarding information about the mages nearby, I can tell you very responsibly, there are no roaming mages nearby Regina. Here is the rightful territory of the Mage guild, if you’re looking for roaming mages, you’re better off looking at other remote towns.\"</p><br/><p>\"Not even one?\" Benjamin asked in return.</p><br/><p>It was said that there were real deals within the city, in the city of Regina, there should be some great roaming mages, right?</p><br/><p>\"I can help you look into it again, but I advise you not to get your hopes too high.\" The chief said firmly, \"There is really no more place here for you to continue your development among roaming mages. The extent of oppression of the Mage Guild is far higher than what you would expect.\"</p><br/><p>\"... In that case, please try your best to find them.\"</p><br/><p>Feeling rather helpless, Benjamin could only reply so.</p><br/><p>It would be best to find out the proprietary circle of the roaming mages, otherwise, it would be very hard for him to make contact if everything was scattered like fragments all over the various regions.</p><br/><p>This was so troublesome...</p><br/><p>\"Anyway, have you contacted the president of the Mage Guild for me?\"</p><br/><p>After some thoughts, he asked again.</p><br/><p>- Returning to Icor this time, he did not just intend to scout for local roaming mages, he also intended to meet the President.</p><br/><p>If it was not for the timely message of this President, they would not even know that the Queen was faking her death, nor would they know about the treasure underneath Gealorre. Don’t forget, the President specifically sent his own student rushing through four hundred kilometers to Gealorre to deliver the message - Did that not show how sincere the President was?</p><br/><p>Whether it was to thank him or to discuss their future partnership, Benjamin felt the need to meet the President.</p><br/><p>\"This kind of matter is actually not easy, however, I found a way to make it work for you.\" The chief proudly raised his jaw and said, \"Tomorrow night, he will come to the inn to meet you. The delivery of this message is definitely kept secret, no one will know about your meeting.\"</p><br/><p>Upon hearing this, Benjamin felt more relaxed and nodded his head.</p><br/><p>If an acquaintance like Chief Silverfox could give him such assistance, then the President of the Mage Guild could provide him even more help. The President was still a President even if the position was not so comfortable!</p><br/><p>Regarding the world of the mages, he would definitely be the person with the best understanding.</p><br/><p>\"Besides that, this is the dispatch table of the mage battalion that I have arranged.\" The chief handed out a small booklet and passed it to Benjamin. He then explained, \"In this period of time, the dispatch location for most of the people in the Mage Guild has been noted on this. You just need to avoid those places, even if you’re being lofty, no one in the Mage Guild should find out.\"</p><br/><p>Benjamin received the booklet and expressed a surprised look.</p><br/><p>\"I thought, you couldn’t do this so detailed.\"</p><br/><p>\"What rubbish is this.\" The chief said with a straight face, \"Other than combat, I’m the most outstanding mercenary in the whole of Regina, more than half of the high difficulty informative duties were all done by me. Without the suppression of the Church, my popularity here is much greater than it is at Havenwright.\"</p><br/><p>\"... Great, great.\"</p><br/><p>Benjamin admired him to an extent. With such an old age, the chief was still able to drift along in a country’s city. It was no wonder that he had been a mercenary for the longest time.</p><br/><p>\"Don’t you feel tired?\" He couldn’t help but ask, \"After losing your only son, I thought that you would find a place and live in seclusion, away from the earthly hustle and bustle.\"</p><br/><p>\"Live in seclusion? What’s the point of that? It has already been so long, I can’t be weeping and sobbing every day, right?\" The chief looked at Benjamin with a retarded expression, \"I like to work. After settling the funeral for that brat, now I’m living more merrily.\"</p><br/><p>\"... Alright.\"</p><br/><p>Benjamin could only say that as he was at a loss for words.</p><br/>\n</div>"}