{"title": "Chapter 567: Cultivation From the Teacher", "id": 567, "volume": 6, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-567-cultivation-from-the-teacher", "volume_title": "Volume 6", "body": "<h1>Chapter 567: Cultivation From the Teacher</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 567: Cultivation From the Teacher</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>\"...Today’s seminar ends here, I hope everyone will put in the effort to help this academy grow.\"</p><br/><p>In the newly-built classroom, Benjamin just ended the training for his followers. He closed the book and looked around at the tired faces, smiling as he spoke.</p><br/><p>Building a magical academy was not easy.</p><br/><p>Buildings and environments only required hard labour and the money to pay for it. But recruiting faculty was not that easy – after all, not all mages are willing to become teachers. In this short amount of time, he had come up with a roster and handed them teaching materials, as well as train them as best as he could.</p><br/><p>Benjamin had around a hundred mages under him, but only around seventy of them were willing to be teachers. The students set to enrol were almost two thousand. This was no doubt going to be a huge challenge.</p><br/><p>They had at considered hiring mages from outside his group as teachers. But, Benjamin did not really trust mages them. Other than trust, people who have not worked with Benjamin before would not be used to the weird system they used, and would no doubt end up like the mages Vinci brought, utterly confused.</p><br/><p>So, for the time being, he would use his own followers.</p><br/><p>Luckily, all of the mages were productive. They had followed Benjamin for so long, and because of this had likewise inculcated the ‘never give up’ attitude.</p><br/><p>They were full of anticipation for this magical academy and were so willing to do their part to help that it was scary.</p><br/><p>\"Mage Benjamin, elemental studies is an important course, there is a lot to learn. I feel like we should assign more classes to it, if not we will not able to teach anything of value.\"</p><br/><p>\"If we assign more classes to elemental studies, then what about magical theory research? The total class time is limited, you already have the first and second classes of the day, you can’t possibly ask for afternoon classes as well, right?\"</p><br/><p>\"I don’t intend to steal class time from other subjects, I’m just suggesting that some of the less important classes timetables be modified a little…\"</p><br/><p>Benjamin heard the argument and could not help but massage his temple.</p><br/><p>These teachers were too passionate about their classes.</p><br/><p>In reality, the teachers did not get much salary due to Benjamin’s lack of funds. However, this did nothing to diminish their passion. A great learning environment not only benefited the students but from another perspective, the teachers could use the environment and tools to improve their magical training as well.</p><br/><p>A heated discussion like this would be a natural by-product.</p><br/><p>Most mages had all sorts bottlenecks as they tried to improve their abilities. Many times, they would end up meditating for half a year because of something small and would still not get any results. So, discussing problems regarding magic became Benjamin’s follower’s go-to method to improve.</p><br/><p>\"Every time I feel as if my meditation isn’t paying off, I will go start an argument with Frank, most of the time I will get to hear some legitimate points and the situation would improve. \" Laila said.</p><br/><p>Benjamin was helpless.</p><br/><p>His way of meditating was different from ordinary people, so it did not pose such a problem. However, for the others, they only had so many ways to get past a hurdle.</p><br/><p>Of course, this method of resolution created another problem: people that loved to argue.</p><br/><p>\"Even if it’s not a core course, I think you should show more respect to secondary subjects. If not, what’s stopping this mentality from spreading to the students as well? Will you take the responsibility if they start skipping my class altogether?\"</p><br/><p>\"I don’t mean it that way, I only said…\"</p><br/><p>Benjamin had a headache.</p><br/><p>As the argument raged on, he tiptoed out of the classroom.</p><br/><p>Standing in an empty corridor, the sounds from the argument were muffled by the door. Benjamin took a deep breath and felt the whole world fall silent.</p><br/><p>\"What a headache. I wish the classes would begin quickly so they can focus their energy on the students…\"</p><br/><p>He massaged his neck as he spoke to himself. Suddenly, a voice came from behind him, interrupting his monologue.</p><br/><p>\"Yo! Trying to slack off?\"</p><br/><p>Benjamin turned around and saw Mikel leaning at a corner, his mouth turned upward in a wide grin.</p><br/><p>\"How do you have the time to visit. Isn’t the King’s mission overworking you?\" Benjamin was surprised and asked.</p><br/><p>He had not seen Mikel once since Icor retreated. According to the King, he was busy helping clean away the remnants of the Church in Carretas and had no time to show himself.</p><br/><p>If there were to draw lines, Mikel was counted as one of the King’s men. After the Academy of Magic was built, Benjamin has not been in contact with the King as often as before, so naturally, Mikel did not really come into contact with Benjamin either.</p><br/><p>Thus, him appearing here today was totally unexpected.</p><br/><p>\"It’s over.\" Mikel shrugged, saying,\" I’ve gotten rid of every single remnant of the Church I that could find.\"</p><br/><p>\"So today…\"</p><br/><p>\"I’m here to visit.\" Mikel smiled and said, \"Plus, after finishing that task, I’ve cut ties with the King. I’m just a mercenary now.\"</p><br/><p>Benjamin was shocked but nodded as if he understood, \"I thought you’ve already sold yourself to the King.\"</p><br/><p>\"Who would do such a foolish thing…\"</p><br/><p>\"True.\" Benjamin seemed to have thought of something and suddenly asked, \"Are you not some legendary mercenary? You should be very familiar with the higher-uppers of the Mercenary Organization, right? I’m trying to think of a way to contact them.\"</p><br/><p>Before this, he had tried creating ties with the Mercenary Organization, but they had rejected him politely. But with Mikel, things should go smoother, right?</p><br/><p>\"Why do you want to contact them?\" Mikel shrugged.</p><br/><p>\"To invite them to make investments.\" Benjamin replied, \"If they put in money into the academy, then, we should be able to introduce more mages to them as mercenaries after our students graduate. Not to mention, with the two of us being the largest neutral organizations across the lands, the Academy of Magic and Mercenary Organization should seek to work together.\"</p><br/><p>\"...Classes have not even started and you are thinking of working with the Mercenary Organization. Do you think such huge organizations need to promote themselves?\"</p><br/><p>Benjamin heard this and laughed awkwardly, saying, \"Just a thought for the future... don’t laugh too soon.\"</p><br/><p>\"Don’t be too optimistic.\" Mikel stopped smiling as he replied, \"Everyone is looking forward to your Academy of Magic, but… I came across a bad omen as I was carrying out my mission.\"</p><br/>\n</div>"}