{"title": "Chapter 574: Something That Should Not Be There", "id": 574, "volume": 6, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-574-something-that-should-not-be-there", "volume_title": "Volume 6", "body": "<h1>Chapter 574: Something That Should Not Be There</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 574: Something That Should Not Be There</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Usually, Benjamin predicts the church’s plan and guess what they will do next. But at this moment, he did not have has time to think about that!</p><br/><p>One after another healing water balls were being summoned and was launched towards the crowd. Benjamin tried to use this method to help those who were suffering, but he realized that it was useless to do so.</p><br/><p>The healing water balls can slightly lessen their pain, but it cannot stop the fact that their brains were being cooked.</p><br/><p>But Benjamin was very certain that these people must not die.</p><br/><p>Therefore, he kept releasing healing water balls to buy time, while he turned his head and looked again at the guy who was bathing in the golden halo.</p><br/><p>\"Why, are you, alright?\" The guy repeated like a video-reading machine, repeating the same sentence, as though the strange ritual had taken over his consciousness.</p><br/><p>Benjamin took a deep breath and walked towards him.</p><br/><p>It seemed like this guy temporarily did not have any other attack other than this golden halo. Although he did not know why was he unaffected, but... as long as he gets rid of this flasher, he should be able to save the others, right?</p><br/><p>Therefore, despite the oppressing spiritual energy, Benjamin gradually approached the priest bathing in Holy Light.</p><br/><p>\"You, sinner, terminate.\"</p><br/><p>The priest's glowing eyes stared at him, then, the water waves-like golden halos gathered and shone on Benjamin. At that moment, Benjamin felt a surge of pressure and his head began to hurt.</p><br/><p>But... ... listening to the painful wails coming from behind him, he cannot back down.</p><br/><p>When he was only a few steps away from the priest, the pressure was so intense that it was unbearable. He tried to move forward, but his joints were making a cringing sound, and his whole body was aching.</p><br/><p>So he took a deep breath and said in his heart: \"Intangible form, activate.\"</p><br/><p>The System lazily answered.</p><br/><p>At that moment, Benjamin took out a dagger and got ready to attack. However, just as he entered the intangible form, he felt the pressure around him became a substantial existence, which caused him to not be able to move at all.</p><br/><p>Benjamin gasped in his heart.</p><br/><p>How could this be?</p><br/><p>It was as though he was being sealed in cement, unable to breathe or blink his eyes. Fortunately, the System realized that something was wrong and quickly deactivated the intangible state, or Benjamin might have suffocated to death.</p><br/><p>\"Shit...\"</p><br/><p>After breaking free from the absolute imprisonment, Benjamin took a couple deep breath and took a few steps back before he gradually came back to senses.</p><br/><p>... What happened just now?</p><br/><p>Benjamin did not understand, when he entered the intangible state, why did it felt like he was being sealed into a cement wall, not being able to move at all? Wasn’t being in intangible state equivalent to entering the Inner World? Why would he still be disturbed?</p><br/><p>He looked at the priest again. The way the priest looked at him, it seemed like there were... doubts?</p><br/><p>It seemed like he also did not understand what just happened.</p><br/><p>\"What are you doing? Did you really activate the intangible state?\" Benjamin asked in his heart.</p><br/><p>\"It is not my fault, I am just following your orders.\" The System responded confidently, \"The golden halos were originally from the intangible world, where they are intangible here, but will become an entity there, so it was normal for you to be trapped.\"</p><br/><p>After hearing that, Benjamin was even more furious.</p><br/><p>\"Why did you not mention it just now?\"</p><br/><p>\"I only found out when you entered the intangible state, I did not know about it just now, so how could I remind you about it?\"</p><br/><p>\"...\"</p><br/><p>Benjamin shook his head, even in reality, he can only slowly retreat. The pressure around the priest was so strong that it formed a wall around him, and now that the intangible world was restricted, it was impossible for him to get close to that guy.</p><br/><p>... There was no other way?</p><br/><p>\"Mage… … Ben-Benjamin... ... help me ... ...\"</p><br/><p>All the people were still wailing painfully, but their voices had gotten weaker. Benjamin had lost his patience after seeing that, but he can only constantly summon healing water balls so that they can hold on to it longer.</p><br/><p>But what was the point in him buying time?</p><br/><p>Benjamin looking at the figure under the golden halo and could not help but clench his fist.</p><br/><p>Where did the church get this technique?</p><br/><p>Up until now, he still cannot figure out how to solve the problem. He cannot hurt the priest nor save those who had fallen. An opening ceremony with celebrities from all over the world and more than two thousand students dying together, leaving him to survive alone... ... How will the rest of the world see him?</p><br/><p>As long as the church starts making up stories, he will become a person hated by everyone and fall directly into the abyss from up above the clouds.</p><br/><p>\"Teacher Benjamin... help me...\"</p><br/><p>\"I, I do not want to die...\"</p><br/><p>Those familiar faces were painfully distorted on the ground in the auditorium. The King, Mage Varys, and those who entered the school with their dreams... Benjamin felt a kind of unprecedented despair.</p><br/><p>No! He cannot let them die in front of him!</p><br/><p>Benjamin firmly closed his eyes and tried to calm himself down, pondering on how to solve this issue.</p><br/><p>What was hurting them was the golden halo, based on what the System said, the golden halo’s entity exists in the nothingness of the \"inner world\", therefore, can he block these light out?</p><br/><p>With the thought of that, Benjamin immediately summoned a water curtain and wrapped everyone in it, as though he activated the anti-magic water ball to cut off the inside and the outside world.</p><br/><p>Unfortunately, nothing happened.</p><br/><p>\"What are you thinking about, the anti-magic water ball can only cut off elements, but these things are not elements.\" The System said in Benjamin mind.</p><br/><p>\"What are they then? You tell me!\" Benjamin was very impatient and shouted directly in reality.</p><br/><p>\"Calm down. I think... These things are spiritual energy, it’s just that they have condensed into an entity, so it is difficult to be identified.\" The System continued, \"To use high-pressured spiritual energy to burst someone’s brain, this is probably its attack. I think you should think about why are you the only who is unaffected.\"</p><br/><p>Benjamin was stunned, but he quickly came back to his senses.</p><br/><p>Yes, he was not affected by these golden halos, even the priest was somewhat surprised, which suggested that the priest expected him to have fallen too.</p><br/><p>Why was he unaffected?</p><br/><p>At that moment, Benjamin's mind was a mess, all kinds of thoughts were going through his mind, like an earphone cable being tangled together, which made him feel even more irritable, not to mention that he still need to maintain the mass release of the healing water ball.</p><br/><p>Damn it...</p><br/><p>\"Do you still know anything? Tell me everything!\" He yelled in my heart.</p><br/><p>The System replied: \"I can only use my intuition to search for clues based on this body that I borrowed from the otherworld. I also do not know how to deal with these things.\"</p><br/><p>Damn it... ... a bunch of useless nonsense.</p><br/><p>Benjamin was going crazy.</p><br/><p>Why, why was he the only one who survived?</p><br/><p>\"You, your body, there is something that should not be there.\" Suddenly, the priest under bathing under the Holy Light opened his mouth again and his mechanical words travelled to Benjamin's ear.</p><br/><p>Benjamin raised his head confusingly.</p><br/><p>He... ... something that should not be there?</p><br/><p>Was it the System? The System protected him from the golden halo?</p><br/><p>But… What can he do? He cannot bring the System into reality and stuff it into the minds of the thousands of people. In case it was because of the System, then it was of no help in this situation.</p><br/><p>He can only look for another solution.</p><br/><p>...wait.</p><br/><p>Suddenly, a thought flashed through his mind.</p><br/><p>In addition to the System, there seemed to be something else that should not have been there.</p><br/>\n</div>"}