{"title": "Chapter 587: Magic Potion Department", "id": 587, "volume": 6, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-587-magic-potion-department", "volume_title": "Volume 6", "body": "<h1>Chapter 587: Magic Potion Department</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 587: Magic Potion Department</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Benjamin kept familiarizing himself with the usage of these four runes in the next few days. There were not any issues concerning the academy. Hence, he specifically went to an off-the-beaten-path wasteland to practice with some weak magic beasts.</p><br/><p>The runes outlines in real life did not have a similar feel to when it was drawn in the Space of Consciousness.</p><br/><p>Some water elements were transferred as Benjamin extended his arm lightly to trace the rune of the element of destruction in the empty space before him. A stretch of ripples appeared as the water elements of the surrounding went berserk, targeting the few wind wolves in front of Benjamin.</p><br/><p>Those wind wolves were going to attack Benjamin. However, once the rune was outlined, they seemed to have sensed an incoming natural disaster and instinctively retreated in fear.</p><br/><p>However, these water elements did not give them the leisure of time to escape.</p><br/><p>There were deranged surges of water currents, keen-edged ice pricks, killer cyclone and so on conjuring, overcoming these wind wolves. All that was heard were a few desperate howls, and all it was just merely a few seconds before these wind wolves were ripped to mush. Not a single piece of wolf skin was left.</p><br/><p>The force of \"Elemental Order: Destroy\" could be said to be fairly terrifying.</p><br/><p>Regardless, Benjamin had also noticed that in the midst of this process, the forces of the rune and the summoning environment went hand-in-hand. If the water elements around was abundant, the currents would surge up a large-scaled windstorm in a short amount of time. In this wasteland, there were already a few potholes dug up by the water magic windstorm.</p><br/><p>And, vice versa, if the environment was dry and less humid, the forces of the rune would be scraped off. Benjamin had to move the water elements that he stored in his Space of Consciousness to stock up the magic currents, increasing the consumption of Spiritual Energy.</p><br/><p>However… all in all, he felt that this thing was pretty useful. The next time someone tried to oppose him, he would just toss a rune out and that person would be murdered by the water elements in many forms.</p><br/><p>Even the pope would not last long in this type of force of destruction.</p><br/><p>As for the other three runes, he had practiced quite a bit and was starting to get the hang of it. The System had been dilly-dallying with the new incantations, so Benjamin had to depend on these four runes.</p><br/><p>With that, he returned to the magic academy once his practice was complete.</p><br/><p>He had been out of town for a week now. In the time span of a week, there was not any mishap in the academy and everything was headed on the right track. Listening to Varys’ report, there were many who showed massive talents out of the two thousand students. A tenth of them had already mastered the entry-level magic and had already been equipped with the basic fighting skills.</p><br/><p>Benjamin was gratified, yet he wasn’t too impetuous. They had set the graduation goal in two years. Within these two years, if these people could become an independent mage from scratch, then they would consider themselves reaching their expectation.</p><br/><p>Taking things slowly without causing any havoc was his main ideology on the management of the academy.</p><br/><p>After he had returned to his residence, it wasn’t long until Benjamin realized that Varys had replied to him.</p><br/><p>\"So that person is your younger brother? It was he who discovered me sneaking into the church but he couldn’t have me stay, and I couldn’t have a direct conflict with him. so I escaped. Now it seems like the entire Kingdom of Havenwright is searching for me.\"</p><br/><p>Hearing the voice coming from the wood piece, for some reason, Benjamin felt that Varys sounded a little smug.</p><br/><p>Benjamin helplessly shook his head.</p><br/><p>So what if he was wanted? He himself couldn’t determine just the amount of nations that had him wanted.</p><br/><p>However, from Varys’ reply, the screen intertwined by those light beams in the Pure Blue World was real. It was just that Varys never mentioned when he sneaked into the church. Benjamin was still unclear if the meeting between Varys and Grant was a prophecy or a flashback.</p><br/><p>He hoped that it was just a flashback.</p><br/><p>While he was considering a few things, Benjamin was walking down the streets in the academy. He nodded and smiles as he bumped into some of the students.</p><br/><p>\"It’s the director….\"</p><br/><p>\"Hello, director!\"</p><br/><p>\"Director, what was that thing you drew on the chest of the priest and the rune that crushed him in the end?\"</p><br/><p>\"Director…\"</p><br/><p>Benjamin was pelted by the incoming, overbearing enthusiasm. He hastened his footsteps. It was after class, and if he were to move slower, he might be stopped by the students for autographs.</p><br/><p>Currently, he could only summon through runes and could not take flight, so it had become quite a nuisance for him.</p><br/><p>Five minutes later, he hurriedly rushed into another building within the academy.</p><br/><p>This was a magic potion department that was specifically prepared for potion mages to do research. Currently, the students were still learning the basics of magic as well as the introductions to incantations, so it seemed a little scary here.</p><br/><p>However, Benjamin knew that there was still someone working inside.</p><br/><p>He pushed the doors open and entered.</p><br/><p>\"What are you refining? Could it be used? You can’t even take care the simplest of material handling, yet you say you smelt magic potions? Who are you kidding! Go back to refining!\"</p><br/><p>Just as he entered, Benjamin hears such a scream.</p><br/><p>He couldn’t help but break a sweat for his potion mages and subordinates.</p><br/><p>Currently, the magic potion department was occupied by that old mage from Icor and the over ten potion mages who were assigned to be his assistants. Currently, they were not teaching any students and placed their entire focus on deciphering the Queen’s potion.</p><br/><p>That was the reason why Benjamin was here.</p><br/><p>\"Senior, who could be better than you when it comes to magic potions? They are still young. Don’t be too harsh on them.\"</p><br/><p>He pushed open the door to enter the potion refinery room where everybody was at.</p><br/><p>The old man was holding a bottle of black, unknown liquid to experiment. Hearing his voice, he lifted his head to glance at Benjamin. He impatiently responded, \"Why are you here?\"</p><br/><p>\"I’m here to check on the progress. How’s the deciphering going on?\"</p><br/><p>The old man immediately snapped, \"Not good. With the assistants that you’ve given me, pigs would be flying if I were to say that everything had gone swimmingly.\"</p><br/><p>Benjamin broke into a sweat.</p><br/><p>He moved his gaze towards the few potion mages. All of them were like rats under a cat’s paw, busying with the assignments given by the old man, yet quivering to the point they could not hold on to their tools.</p><br/><p>This… working under the old man must be a lot of pressure.</p><br/><p>\"You all should head back for a rest. I have something to discuss with senior.\" Hence, Benjamin told them so. The few of them looked like they saw the light at the end of the tunnel as they nodded and turned to leave.</p><br/><p>The old man did not stop them but narrowed his eyes at Benjamin.</p><br/><p>\"What? More requests?\"</p><br/><p>Benjamin smiled, \"Not really. I see them under such a pressure. If they continued on, it would have detrimental effects. Senior, you should pay attention to the state of your assistants.\"</p><br/><p>The old man coldly snorted, \"Useless things. Why should I pay attention to any of them?\"</p><br/><p>Benjamin did not give any more advice; instead, he changed the subject, \"Then… What do you think of the academy I built? How’s living here?\"</p><br/><p>The old man coldly glanced at Benjamin, \"You know that once I’m done with the Queen’s magic potion, I’m leaving here immediately. I ain’t teaching those muggles how to refine potions.\"</p><br/><p>… He was as stubborn as a mule.</p><br/><p>Benjamin was also helpless. After staying here for long, the old man’s attitude didn’t seem to change for the better. It seemed like reeling this potion master into his side would be a difficult task.</p><br/><p>\"Then… How long do you need to find a way to decipher?\" For now, he could only ask this question.</p><br/>\n</div>"}