{"title": "Chapter 589: The Mages Organization’s Visit", "id": 589, "volume": 6, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-589-the-mages-organization%E2%80%99s-visit", "volume_title": "Volume 6", "body": "<h1>Chapter 589: The Mages Organization’s Visit</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 589: The Mages Organization’s Visit</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>In order to verify his suspicion, Benjamin interrogated more than a dozen of Icor prisoners whom they had captured.</p><br/><p>Among them, they were those who had an unwilling attitude when asked about their loyalty to the Queen. However, when Benjamin asked why they rebelled, they said that no matter what, the Queen was nevertheless still their Queen, how could they defy their Queen in that case?</p><br/><p>The looks on their faces... it did seem to have some hints pointing to the possibility of there being thoughts implanted into their minds.</p><br/><p>After getting the result, Benjamin returned to the potion department building and told the elder about it.</p><br/><p>\"Is it mind control? Or is it some kind of special implication...\"</p><br/><p>After hearing that, the old man picked up the scratch paper with a recipe and began to smile forcefully. Benjamin saw and knew that he needed more time to think, it would be useless even if he was here. Therefore, he quietly left and closed the door of the drug-refining room.</p><br/><p>After returning to his residence, he thought about it for a moment, and wrote a long letter to the guild master of the Mage Guild and told him the news. He was afraid that the guild master was also deceived by the powerful magic potion, and that was why something did not add up. Benjamin had to tell him the truth about the potions.</p><br/><p>After finishing all these, he could peacefully focus on meditating in his house.</p><br/><p>\"Has the spell been selected?\"</p><br/><p>The System sounded tired, \"Well... five billion curses have been selected. Now, there might be more than two million valid spells left.\"</p><br/><p>\"How are there still that many?\"</p><br/><p>\"I'm already very tired from filtering! It’s just 2 million curses! If you were to try it out one by one, wouldn’t you be done with them in just a few days?\" The System’s voice suddenly became very angry, \"This is already my limit, okay? Either way, I’m done. Take it or leave it. \"</p><br/><p>\"...\"</p><br/><p>Benjamin had no choice but to accept it.</p><br/><p>Since the System said so, what else could he do? Moreover, if you compare five billion to two million, it did seem like it was not that unacceptable...</p><br/><p>He just needed to isolate himself to try the curses for a while.</p><br/><p>Therefore, he told Varys about it, then he locked himself in the room, beginning to experiment with the curses that belonged to the new rune. Even though now he had a rune, it was always good to have more skills, the generation where three spells could rule world had been long gone. And now, he needed to fulfill his unfinished aspirations to become someone skillful.</p><br/><p>The academy was operating smoothly at the moment. On that basis, he could hand the responsibility over to the mages under him.</p><br/><p>This way, Benjamin began experimenting with the curses that the System gave him one by one.</p><br/><p>Time passed slowly in the space of consciousness. However, the sun and moon had already rotated several rounds in the magic academy in reality. Since Benjamin was living in seclusion, the students began having doubts in their minds. They used to bump into the Dean all the time, why couldn’t they see him now?</p><br/><p>However, given their lessons were not easy, such topics were only discussed occasionally during lunch break, and would quickly be forgotten as they busied themselves with practicing magic.</p><br/><p>\"Teacher Jo-Joanna, look! I can cast a bursting fireball, my first low-level magic! Now, can I finally pass the apprenticeship?\"</p><br/><p>\"Let me see... you’re still not there yet, out of three times, you only succeeded once. Apparently, you need more practice. Come over, let’s have a duel.\"</p><br/><p>\"What…\"</p><br/><p>About half a month later, among the students, the few of the most talented students had learned a low-level magic, so they could technically be considered as a so-called mage.</p><br/><p>Since the few of them were still very poor in combating, the teacher in the academy dared not let them have an actual combat with the magical beasts. Regardless, this was still a gratifying result, as this proved that their teaching methods were very effective.</p><br/><p>Learning magic in a semi-closed atmosphere, a systematic mathematical theory, cultivation of competitive awareness and so on... All kinds of factors were added together, making the students grow faster than many people could imagine. Some mages who came from an old-style academy could not help but sigh, if they were able to learn this way, they would have surely gotten to a higher level at that moment.</p><br/><p>However, it was not too late for them.</p><br/><p>As for the teachers of the magic academy, some of them followed Benjamin from the Kingdom of Helius, and some of them from Ferelden and Carretas chose to follow Benjamin as well. In order to teach their students, they were also desperately learning new magical knowledge and improving themselves. Therefore, their strengths were also gradually rising.</p><br/><p>It was probably true to say that even Benjamin did not expect that, in an academy designed to educate students, it seemed like even teachers were being trained together.</p><br/><p>Varys saw everything and he believed that in a few months, the first time that the academy brought the students out, the entire continent would be amazed by their rapid growth. He was looking forward to seeing how the other mages would react when they see the improvements of the mages in the academy.</p><br/><p>However, what he did not expect was that not only people in the academy was anticipating it, but also those who were not in the academy as well.</p><br/><p>After less than a month after the school started, some unexpected visitors came to the magic academy.</p><br/><p>\"Hello, we would like to see the legendary Dean Benjamin, can I know if he is in the academy?\"</p><br/><p>This afternoon, dozens of mages suddenly appeared outside the gates of the academy, and they did not look weak. They passed through the doorman and found Varys. The middle-aged man, who was the leader, asked.</p><br/><p>\"He's in the academy, but he might still be meditating at this time,\" Varys shook his hand politely and said, \"Can I know what's wrong?\"</p><br/><p>The middle-aged mage smiled and said, \"The thing is, we are a mages organization called 'Phoenix' from Ferelden, and I am the leader of this organization. After I heard about the magic academy, I would like to discuss collaboration with Dean Benjamin. Can I know if he would like to see us?\"</p><br/><p>Varys smiled after hearing this. However, he sensed that something was wrong.</p><br/><p>There was a long list of people who wanted to work with the academy. However... no one had ever brought so many apprentices. Moreover, previously it was mostly politicians from various countries or wealthy organizations who requested for a partnership. This was the first mages organization to do so.</p><br/><p>In fact, there was a subtle competition between the academy and the general mages organizations. The mages organizations relied on the magic knowledge that they owned to attract mages, whereas the academy attracted students by teaching magic.</p><br/><p>Varys heard that after the magic academy started, the mages organizations from all over the world were in turmoil. The commissions paid by these organizations to their member mages increased by at least 20%.</p><br/><p>Under such circumstances, would there ever be a mages organization that would want to work alongside them?</p><br/><p>\"This... As you know, when the level of magic reaches a very high realm, the time for meditation tends to be longer, so I do not know when he will come out. How about this, you can let me know how to contact you, and when the dean is free, I will contact you. \"</p><br/><p>Varys gently patted his shoulder and said with a smiling face.</p><br/><p>However, after the middle-aged mage heart this, the smile on his face began to wear off.</p><br/><p>\"You... are you trying to threaten us?\"</p><br/><p>Seemed like they were really here to cause trouble.</p><br/><p>Varys knew about their intentions. However, after many years of being in the business industry, he did not like to offend others, so he continued on smiling and said, \"Your Highness, you worry too much. Rest assured, you do not have to waste that much effort, when the Dean is free, I will certainly ask him to personally visit you!\"</p><br/><p>The man took a step back and pushed aside Varys’s hand that was placed on his shoulder.</p><br/><p>\"No, we must meet the legendary mage Benjamin today.\"</p><br/>\n</div>"}