{"title": "Chapter 593: The Preparation for The Midterm Examinations", "id": 593, "volume": 6, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-593-the-preparation-for-the-midterm-examinations", "volume_title": "Volume 6", "body": "<h1>Chapter 593: The Preparation for The Midterm Examinations</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 593: The Preparation for The Midterm Examinations</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>\"... How many group mages have come to cause trouble?\"</p><br/><p>\"This is the fourth group. It’s not like that they came to cause trouble. All of them have different intentions, among which some who supports our academy.\"</p><br/><p>After helplessly chasing off the few mages who wanted to forcibly enter the academy, Benjamin shook his head and said facing Varys.</p><br/><p>He gradually began realizing that being a director was not an easy thing to do.</p><br/><p>As time went on, he found that the provocation of the first mages organization was not a coincidence. The following few months, from time to time, there would be mages from another country coming to visit. Some of them were here to protest about the increased commission, and some were mages who did not meet the requirements attempting to forcibly enter the academy... In short, there really were all kinds of people in this world.</p><br/><p>As the director, dealing with these weird tasks had become his primary responsibility. For example, those who wanted to enter the academy but was not allowed to would start protesting at the entrance of the academy. Since Benjamin could not attack them, he could only take advantage of the Water Element Domain’s spiritual energy to oppress them until they could no longer withstand it.</p><br/><p>As for those mages organization whose benefits were being sabotaged, they had endless methods of obstructing the magic academy.</p><br/><p>Hiring people to cause trouble in the town, it was the most basic means of doing so. Unlike the middle-aged mages, apparently, these people would not show themselves; all they did was hiding in the corners and causing mischief. Although the impact was not serious, yet Benjamin was somewhat annoyed.</p><br/><p>However, he could not retaliate.</p><br/><p>There were too many mages organizations who had ill intentions against the academy. There was no way that Benjamin could take revenge against all of them. Most importantly, this was level of antagonism, if Benjamin were to fight back, it would probably evolve into a great conflict between mages, and there would, as a result, be conflicts between the upper-class mages and lower-class mages.</p><br/><p>Benjamin wanted to take another path, he wanted to slowly change the old methods of the mage society that blindly solved every conflict by fighting. This was because, in the end, only the church would benefit.</p><br/><p>Therefore, to deal with all of this. Benjamin began to continuously write letters.</p><br/><p>\"Mage Vinci, long time no see, how have you been? The magic academy started for some time already, and there has been a controversy among the mages. Just in time, we are about to begin our midterm examinations. I would like to take this opportunity...\"</p><br/><p>\"General Stuart, how is the mage guild? The academy’s midterm examinations are about to begin, I am planning to prepare some open-class activities. Can you please help us to invite all the leaders of the mages organization from all around the world...\" </p><br/><p>\"Mage Clair...\"</p><br/><p>Now, Benjamin had a wide range of connections, be it political businesses or big shots in the mages' circle, he had quite the connection with these people. To solve the immediate problem, he could make use of these connections.</p><br/><p>The midterm examinations were fast approaching. As for the place for the training of the mages, the academy had naturally included a large amount actual combat content. Benjamin planned on using this opportunity to invite the leaders of the mages organization to come over, so they he could put their strength on exhibition and show them.</p><br/><p>It might be hard to stop them from causing trouble. However, the least he could do was show them his strength, so that they would think twice before causing any mischiefs.</p><br/><p>Benjamin had written over a dozen of letters. He sent them and returned to the space of consciousness to focus on meditating.</p><br/><p>Since the midterm examinations were their time to show themselves off, Benjamin was trying his best to increase his strength and improve his condition to face anything that might possibly happen.</p><br/><p>In the academy, the tension had slowly started spreading.</p><br/><p>The midterm examinations were something that the students knew since the beginning of the school year. This examination would determine how many people could stay in the top classes, how many of them could be rewarded, and how many people will face the difficulty of graduating... This was their first assessment, and it would greatly determine how their life in the academy would be like in the upcoming two years.</p><br/><p>Therefore, everyone was very nervous while they prepared for their examinations.</p><br/><p>\"Hey, what will be tested in during the exam, did you get any hints from the teacher?\"</p><br/><p>\"I do not know, they said that it will something from the test materials. It’s so annoying, I have always been weak in the elemental theory, what if I fail?\"</p><br/><p>\"What are you afraid of, you have already learned several low-level magic, and your actual combat score will certainly be high. You should only be worried if you’re like me...\"</p><br/><p>The students were restless. Many people were in a position full of debts just to have the chance to attend school, the burden on the shoulders was extremely heavy, and so they naturally put a hundred and twenty percent effort into the preparation of their midterm examinations.</p><br/><p>Needless to say, for the magic theory examination, some students who were weaker even memorized all the theory for all the study material in order to get full marks, so that their results would not look that bad.</p><br/><p>More people were desperately practicing magic. After all, the thirty percent of the score went to the theoretical test while the remaining seventy went to actual combat.</p><br/><p>The teachers in the academy also desperately supervised the students. After all, they understood what Benjamin had in mind, so their pressure was even greater than the students. During the examinations, there would be a lot of other mages who would come to spectate, including the recent troublemakers. They must establish their authority during the examination so that they can shut the mouth of those who had an opinion about them.</p><br/><p>Needless to say, the open classes after the exam...</p><br/><p>\"Open classes? What exactly are those? How do we do it?\"</p><br/><p>In the academy’s classroom, Joanna was lying on the table, and she was utterly exhausted from overwork. A large amount of her ginger red hair was almost being plucked off by her.</p><br/><p>\"Did the Director not send a notice? There is a requirement for the open classes.\"</p><br/><p>\"I've seen it.\" Joanna desperately picks up the notice on the table and read, \"However, the requirements of the lecture was clear, we need to be polite, follow the instructions of the educational standard, teach according to the syllabus, inhibit the use of vulgar words, reduce any random and aimless divergence, and show the guests that our academy has a well-behaved manner... Can anyone really do it?\"</p><br/><p>\"...Isn’t that just giving a proper lecture? I can do it.\" A mage at the side was stunned and then said.</p><br/><p>\"I can do that as well, during the teachers’ training they have already mentioned about those. Who asked you to fall asleep then? Anyway, when we are in class, we need to keep these few points in mind.\"</p><br/><p>Joanna was speechless for a moment, then she hit the table with her head and there was a lifeless look on her face.</p><br/><p>Anyway, be it for Benjamin, the students or the teachers of the academy, these midterm examinations were very crucial. Everyone was in an intensely nervous state for the preparation, even the academy town had banners of \"Preparation for the midterm examinations, and cheering for the students\" hung everywhere, and they had festive lights all around, which made it look like it was a holiday.</p><br/><p>Meanwhile in the outside world, through the twenty letters that Benjamin wrote, the news of the midterm examination was gradually spreading.</p><br/><p>\"Midterm examinations? What is that? Was it something like the graduation examinations of the Knights School? Can they graduate this soon?\"</p><br/><p>In the Royal Palace of the City of Snow, General Stuart read the letter and could not help but frown.</p><br/><p>\"It should not be, the letter said that this was an intermediate examination. They should have some good results, so they want to welcome the majority of the mages from all over the world to visit them.\" The Prime Minister said slowly.</p><br/><p>\"This Mage Benjamin... Why does he always come up with something we’ve never heard before?\"</p><br/><p>The Prime Minister said with a smile, \"Perhaps this is the reason why this young man could come this far. Anyway, we need to bring a lot of people to the examinations.\"</p><br/><p>The general shook his head helplessly.</p><br/><p>\"Let’s do it then, as long as this will not end up like the opening ceremony when they were attacked, it would be fine.\"</p><br/>\n</div>"}