{"title": "Chapter 592: The Water Element Domain", "id": 592, "volume": 6, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-592-the-water-element-domain", "volume_title": "Volume 6", "body": "<h1>Chapter 592: The Water Element Domain</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 592: The Water Element Domain</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>He returned to his residence.</p><br/><p>About this newly learned magic, he still had a lot to learn about. It wasn’t exactly true to call those magic. Regardless, since the previous three spells had failed, and after eliminating the two million spells that the System had filtered through, there was only one spell left.</p><br/><p>There were signs of water ball magic, ice-breaking magic, and pillars of steam in the rhythm of the spell. However, after chanting the spell, the effect produced was drastically different from the previous three magic.</p><br/><p>After chanting the spell, along with the vibration of the rune, something magical happened roughly 10 meters surrounding Benjamin. Water elements imprinted with spiritual energy were like covered the area like cobwebs, even greatly repelling any other elements.</p><br/><p>Just like when he was facing the attack of the mages organization previously. In fact, when casting spells within that area, their magic power was greatly weakened. All Benjamin had to do was just fill the whole area with water elements, and he could instantly reduce the effect of the enemy’s attack.</p><br/><p>It could be said that within that area, Benjamin possessed a weaker and longer version of the \"Befalling of the Water.\"</p><br/><p>He could easily rearrange the water elements within the range. Regardless of it being ice crystals or water vapors, he could condense it very quickly. If anyone dared to enter the area within 10 meters around him without a shield, their life and death would be within Benjamin’s control.</p><br/><p>During the process, Benjamin's spiritual energy consumption was constant. To put it plainly, as long as he was activating this skill, it would slowly consume spiritual energy. Whether he chose to attack or not will have no bearing on the consumption.</p><br/><p>Regarding this new skill, Benjamin probably knew much about it. He had just learned it, and then the mages from the mages organization were here to provoke them. He did not even have time to practice. After an actual combat, however, he felt that the skill was still quite powerful, albeit slightly weaker.</p><br/><p>He had no idea whether the radius could be expanded...</p><br/><p>These past few days, Benjamin had gathered water elements and poured them into the new rune. His spiritual energy was still steadily increasing, yet the radius of the area did not seem to change.</p><br/><p>The radius seemed only limited to 10 meters.</p><br/><p>Anything beyond that, he could only use the rune and \"Befalling of the Water\" to deal with it.</p><br/><p>\"You should be grateful. If it was not for me, you'd never be able to learn the new spell of the rune for the rest of your life, neither will you be able to have such a good domain skill.\" The System said proudly.</p><br/><p>\"Oh.\"</p><br/><p>\"...\"</p><br/><p>The system furiously jumped up and down, but Benjamin did not care about it.</p><br/><p>After thinking about it, he gave this brand new magic a very simple name, which is the Water Element Domain. The few cocky names that he had thought about previously were being used by the System to tease him, and he had had enough of it.</p><br/><p>He lay on his bed. He was not in a hurry to interrogate those in the mages organization.</p><br/><p>He was a celebrity, he needed to establish a positive image, so he could not kill casually. However, these guys had the audacity to start a fight in the magic academy, of course, he would have to make them suffer.</p><br/><p>Benjamin was ready to imprison them for a few days without giving them any food. Only then would he interrogate them.</p><br/><p>Even a mages organization could make a scene, who was the one who gave them the order? Benjamin could not believe it. Even if they offended most of the mages organizations, all they could do was just make mischiefs secretly behind their back; those who were smart would not show themselves.</p><br/><p>And the middle-aged mages... He did not seem that smart, and he was probably being used.</p><br/><p>This way, Benjamin started pondering about the academy with his eyes closed. These few days of constantly chanting spells had exhausted him as he had had very little sleep. Now that things were over, he could finally have a good rest.</p><br/><p>And so, he rested for a whole week.</p><br/><p>After the provocative incident, the academy continued functioning as usual, other than the fact that the students’ center of attention was back to Benjamin, there were no other special changes. Benjamin was also afraid to walk out casually now. After all, he would be pelted with relentless questions if he bumped into the students.</p><br/><p>A week later, he went to see that mages organization’s leader.</p><br/><p>\"After such a long time, did Your Highness live comfortably here?\"</p><br/><p>In the academy’s basement, the middle-aged mage lay on the ground and looked like he was in a difficult position. He was so hungry that his voice was trembling, \"I... I was wrong, pl-please forgive me.\" </p><br/><p>Benjamin sighed.</p><br/><p>He thought that he was stubborn, who knew that he would give in that easily...</p><br/><p>Benjamin was bored.</p><br/><p>\"Who’s the one who ordered you to provoke us?\" He asked.</p><br/><p>\"It’s... It’s Mage Steve, he gave me the potion and told me that you're just holding an empty name. There are a lot of people who are dissatisfied with you, so they sent me to test you...\"</p><br/><p>Benjamin frowned.</p><br/><p>Mage Steve... Who is this?</p><br/><p>That sound a little familiar.</p><br/><p>\"He’s the new guild master of Ferelden’s Mage Guild, he was the mage in charge chosen by General Stuart. When you went to Ferelden previously, the both of you met once.\" The System reminded.</p><br/><p>Benjamin heard this and gradually recalled.</p><br/><p>That guild master... He seemed to have quite a difference of opinion with him at that time.</p><br/><p>However, was it necessary to send someone specifically to cause trouble?</p><br/><p>Benjamin did not understand, maybe what he did might have unintentionally offended a lot of people. However, after knowing that this had nothing to do with the church, he felt relieved.</p><br/><p>Previously, he thought of the possibility that the church, which was controlling the mages organization all around the world, wanting to start a new conspiracy. Now, it seemed like it was just some internal conflicts between mages that could be easily settled.</p><br/><p>Benjamin simply asked the middle-aged mage some other questions, and after getting the answer, he turned around and left the basement. He first told Varys to get some food for these mages, keep them locked for a little longer, and then let them go. Having a cruel reputation was definitely unfavorable for the academy. However, they were just someone unnecessary, it would not matter much if they were released.</p><br/><p>Then, he wrote a letter to Ferelden.</p><br/><p>Now that General Stuart and Benjamin had a cooperative relationship, this issue naturally did not require him to solve personally. They would want to please Benjamin! He just needed to list down the number of crimes committed by Mage Steve in the letter. Soon, this guild master who had just gotten his position would most probably become very miserable.</p><br/><p>Then, when the time comes, he would ask Miles to secretly settle with him, and the whole thing would be over.</p><br/><p>He also wondered whether the church was secretly provoking the contradictions among mages and causing the mages to fight internally. However, regardless of whether they were provoked or not, there would be competitors everywhere among the mages, and certainly within the church. He just needed to calmly deal with it, there was no need to be in a constant state of nervousness.</p><br/><p>After all, in a month or two, all the students would probably possess a basic combat skill. Then, the magic academy would get a good reputation from then on.</p><br/><p>He’d make sure the entire community of mages was aware of how effective the education of the academy was, and how the inheritance of the traditional magic was lagging behind.</p><br/>\n</div>"}