{"title": "Chapter 595: Sparring Exam", "id": 595, "volume": 6, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-595-sparring-exam", "volume_title": "Volume 6", "body": "<h1>Chapter 595: Sparring Exam</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 595: Sparring Exam</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Currently, the Mage School’s open field could be said to be the liveliest part of the academy.</p><br/><p>Half of the visitors who came gathered here as some sat on the decorated rows of audience seats while the others could only stand or stay afloat midair. Everyone made their way towards the open field while chattering about, the rowdiness of it all could rival even that of a market.</p><br/><p>In the middle of the open field encircled a large space in red, inside which stood many of the school’s teachers.</p><br/><p>\"Without a foundation in magic prior to enrollment, now managing to wield eleven entry-level spells, a novice spell as well as a good cognitive energy level... a total score of seventy-eight! Not bad, you may head to preparations for your sparring exam.\"</p><br/><p>\"Th...Thanks, master.\"</p><br/><p>The young man nervously yet excitedly nodded, turned around and headed towards another corner of the field.</p><br/><p>The teacher’s voice was amplified by magic, allowing the announcement to be heard throughout the open field. Upon hearing it, the surrounding audience gazed at the back of the young man, discussing amongst themselves.</p><br/><p>\"Is this possible? To reach this level of mastery and wield so many spells within just a few months’ time?\"</p><br/><p>\"We’ll know when he begins his sparring exam. I got a good feeling about this child, I’ll find a chance to chat with him later. Our militia had been diminishing greatly…\"</p><br/><p>Through measuring the capabilities of students to teachers, the audience got a clear grasp of their strengths. As such, with each passing students receiving their teacher’s evaluation, followed by announcing their growth within the past few months, many from the audience were bewildered.</p><br/><p>To say it’s astonishing would be an understatement as the rapid rate of their progress was unheard of. However, it seemed that every student’s progress exceeded their predictions. With their capabilities rounded off, the results were truly appalling to behold.</p><br/><p>It was also due to this that many held some residual doubts in their mind.</p><br/><p>Was everything that they had been announcing thus far true? Were the students’ magic foundations truly as weak as their teachers said they were before enrolling here?</p><br/><p>As a matter of fact, the school had already responded to this matter.</p><br/><p>\"Information regarding the students’ pre-enrollment can be found there. Each and every student’s cognitive level, elemental affinity and number of spells wielded when they first enrolled are recorded in detail. There shouldn’t be any forgery.\"</p><br/><p>\"Is that so? I’m gonna go take a look.\"</p><br/><p>A lot of people made their way there, receiving a thick stack of papers from a staff to gloss through. The papers weren’t brand new, the notes on them showed signs of being written over a few months. To the visitors’ perspectives, there was still a firm credibility to all of this.</p><br/><p>The details aside, considering the fact that the school had two thousand students. It would certainly take unimaginable amounts of effort to compile if they were to forge information about all of them.</p><br/><p>Hence, little by little their suspicions toward the announcements diminished.</p><br/><p>They were simply surprised. What kind secret tricks did this school play to achieve such impressive average of results?</p><br/><p>After scanning through some student profiles, Fafnir lifted his head, remained in disbelief as he spoke to his companion.</p><br/><p>\"It’s all true.\"</p><br/><p>\"It’s actually nothing to be surprised about. They invested so much to build this big school, it’s no wonder the students taught here are slightly more impressive than most.\"</p><br/><p>\"You do have a point…\"</p><br/><p>Fafnir nodded. Their grudge toward the Mage School left them unable to accept this place. The wage increase for mages led to the downfall of countless mage guilds… The school paid such a humongous price for the sake of slightly accelerating the students’ growth. So what of it?</p><br/><p>Fafnir remained unconvinced.</p><br/><p>\"Yeah, that Benjamin was just lucky to receive the support of several nations. He’s merely rich.\"</p><br/><p>His companion followed, \"With that much wealth in our hands, we can push the students’ growth to this extent too.\"</p><br/><p>Fafnir nodded, \"I wonder what level of magic-mastery does this boy possess. The rumors stated that he’s unspeakably strong. However, how could he have grown this strong at such a young age?\"</p><br/><p>\"People do enjoy blowing rumors out of proportions, it’s normal…\"</p><br/><p>The two chattered while walking in the sparring field’s direction. They had learned the entire examination procedure. The students who had been evaluated will engage in combat on the field with their teachers to grade their performance.</p><br/><p>The school field had ten of these examinations conducted simultaneously, a steady wave of magical energy flowed out from the center of it all.</p><br/><p>\"Your reaction was too slow. In a real battle, do you believe you’ll have this much time to decide which spell to fight back with? When a fireball’s already thrown at you, your hesitation would mean you get burnt to smithereens.\"</p><br/><p>\"Master, I…\"</p><br/><p>\"Sparring exam grade, C, next .\"</p><br/><p>The student left with his spirit defeated, those who were waiting their turn gave looks of sympathy. The next exam candidate held in a deep breath, nervously yet eagerly went in.</p><br/><p>The strict standard of the examination left the audience speechless. To them, for a student who only learned magic for less than a few months, that child performed well. With only a few seconds of hesitation, couldn’t the teacher have overlooked this?</p><br/><p>\"With this level of strictness, just… what kind of mages do they wish to nurture them into?\" Someone pointed out.</p><br/><p>Fafnir’s eyebrows crooked as he observed all this.</p><br/><p>Fafnir’s companion flew up and scanned the entire circle, doubts seeping into him horrid spreading across his face, \"These bastards… seemed to be promising after all. Let’s not challenge this school anymore.\"</p><br/><p>\"Don’t be intimidated,\" Fafnir replied.</p><br/><p>\"For us to be invited here, it must be to show us all of this. If they were to attend classes as per usual behind closed doors, how would anyone know they’re this capable?\"</p><br/><p>\"But… the few mages I saw acting as examiners, their strengths rival our own. They held their own without faltering in energy whilst testing over ten students continuously. This is truly frightening.\"</p><br/><p>Fafnir lowered his voice, \"It’s just ten people, what’s there to be scared of? Their capabilities must be the cream of the crop to be chosen as examiners. Don’t be intimidated now.\"</p><br/><p>As his companion finished listening, his companion circled around once more, sighed and shook his head.</p><br/><p>\"No, this school is most definitely fearsome.\" His irises dotted around like that of a mouse. He whispered, \"If you lot still plan to go against him, leave me out of it. And so… I bid you farewell.\"</p><br/><p>Fafnir stood appalled. Before he could call out his companion, that man already gave an awkward wave, turned around and disappeared into the crowds.</p><br/><p>After a brief moment, Fafnir slowly regained his senses.</p><br/><p>\"Useless fool, such cowardice!\" He said to himself, shaking his head in a fit of rage.</p><br/><p>Then again… Whatever! There was no point in holding down someone who required persuasion.</p><br/><p>As Fafnir turned around, ready to leave the school field, a voice suddenly called out to him from his back. He jumped in response.</p><br/><p>\"You’re… Master Fafnir, right? Nice to meet you, I heard you lead quite a sizable mage guild! What do you think of our school since your arrival here?\"</p><br/><p>Fafnir rigidly turned around.</p><br/><p>The man looked young, yet unfamiliar. He wore a headmaster’s robe with the most hospitable smile. However, without a concrete reason, Fafnir felt that this man’s expression was rather… mischievous?</p><br/><p>\"Who are you?\" He asked coldly.</p><br/><p>The man read their situation, yet continued wearing his smile.</p><br/><p>At the same time, he spoke nonchalantly, yet simultaneously nightmarishly,</p><br/><p>\"I’m Benjamin, the owner of this school. Welcome, good sir, to my school.\"</p><br/>\n</div>"}