{"title": "Chapter 607: Prisoners", "id": 607, "volume": 7, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-607-prisoners", "volume_title": "Volume 7", "body": "<h1>Chapter 607: Prisoners</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 607: Prisoners</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>After the elemental turbulence disappeared, these mages evidently tried to run. However, Benjamin was quick to contain all of them into the water elemental domain. Then, he built a circle of tall ice walls around them, warning them off thoughts of disobedience.</p><br/><p>Thus, they could do nothing but answer the questions.</p><br/><p>\"The incident at the theatre was an accident. Someone leaked the information to the church, and Sir Accius had no choice but to sacrifice some of them to allow the survival of the many.\"</p><br/><p>Benjamin arched his eyebrows at that.</p><br/><p>Honestly, even though he was there personally, it was quite long ago. The Fulners might have been raising another batch of mages secretly after that, but that does not explain why they would come to Ferelden and attack the students of the Academy.</p><br/><p>It was not possible for Accius to come to Benjamin for revenge, no? He would have held the grudge for too long then….</p><br/><p>\"Since you’re not from the church, why are you intercepting my students?\" His eyes were filled with the intent to kill as he stared coldly at the man, as if he was any more displeased, he would once again throw them into the middle of an elemental turbulence.</p><br/><p>\"....It was the will of Sir Accius,\" answered the middle-aged mage with some reluctance, \"The church once again started to crack down on the nobles within the Kingdom of Helius. Quite a number of families have been captured and thrown into the Cleansing Centers due to inexplicable reasons. Sir Accius is very uneasy about this, which is why he wanted to establish contact with mages outside of the Kingdom. He wanted to build an escape route.\"</p><br/><p>Benjamin snorted coldly at that, entirely dismissive about the prospect.</p><br/><p>\"Why didn’t he seek for me in my Academy if he wanted to establish a contact with us? Why did he chose to kidnap my students?\" Benjamin’s words were slow. \"Do you think that you could lie to me with a feeble excuse like this? What exactly is the sly fox planning?\"</p><br/><p>Although Benjamin was not entirely informed about the situations within the Kingdom of Helius, he was never a gullible man. This lie that was weaved by the middle-aged mage out of sheer panic could not even hold its ground against questions.</p><br/><p>\"You…..\"</p><br/><p>The middle-aged mage were speechless for a moment.</p><br/><p>Benjamin shook his head in response. \"Since you’re unwilling to cooperate, I’ll have no choice but to invite you to our Academy as guests. However, I don’t know what Accius would think when he found out about the disappearance of dozens of mages he raised.\"</p><br/><p>The middle-aged mage exchanged a look with his companions and finally answered. \"Truthfully, we don’t really know what Sir plans to do. We were just given the order to bring these students back to him.\"</p><br/><p>Benjamin frowned.</p><br/><p>There was no way for him to discern whether this was the truth or not. Even if it was the truth, he had no plans to let these mages off the hook. Are you kidding? If Benjamin wasn’t here, he would have lost his first batch of excelling students!</p><br/><p>Thus, Benjamin maintained his chilly smile.</p><br/><p>\"If that’s the case, we would still require you to follow us. Don’t worry, if Accius really cares about you, I’m sure that he would show up somehow. He would probably not leave you to die like how he did with the mages in the theater.\"</p><br/><p>\"You….\"</p><br/><p>Benjamin interrupted his words. \"So how do you want this to go? Do you want me to injure you severely, or you will follow me in peace?\"</p><br/><p>Honestly, he was behaving quite arrogantly.</p><br/><p>However, the mages looked at each other in exasperation, as they clearly know their circumstances. They had no other way out except to follow Benjamin.</p><br/><p>Thus, they decided to remain silent and spoke no more.</p><br/><p>Benjamin nodded at that.</p><br/><p>\"Don’t worry, the problem has been resolved.\" He turned to speak to his students. \"Stay here for a moment as I ask for assistance from the Academy. The mages from the Academy will probably arrive half a day after that, and they’ll assist me in escorting these people back to the Academy. Then, you can carry on with your practical.\"</p><br/><p>The students just nodded, confused whether if they’re happy or sad about the turn of events.</p><br/><p>Benjamin turned to face the mages once again. \"I hope you’re smart enough to know that you should stop having thoughts that you shouldn’t have. I’m always watching you.\"</p><br/><p>Benjamin and his friends made a temporary camp around the area. The dozens of mages who were apparently from the Kingdom of Helius was gathered in a place where the System would constantly supervise them. The rest of the ordinary folks, however…. Well, all of them were almost dead at this point.</p><br/><p>The remaining ones who survived the battle did not seem to know anything after Benjamin had interrogated them. However, all of them did come from the Kingdom of Helius, and has some degrees of relationship with the Fulners. That, at least, was confirmed.</p><br/><p>Benjamin still could not believe it.</p><br/><p>Based on what happened within the Kingdom of Helius, Benjamin was having quite a headache just thinking about it. Before he left, the nobles and the church had already filled the entire kingdom with their power politics, and even though he always felt that the nobles always got the shorter end of the stick, their abilities in being annoyingly stubborn was astounding.</p><br/><p>Getting so many mages past the Crusaders Gateways…. What tactic did they actually use?</p><br/><p>Could it be that Accius was so rich that he managed to get some priests to go against their fate and ignore their hatred towards the mages? Could it be that Accius actually got these priests by his side and helped him in this action?</p><br/><p>This was really weird.</p><br/><p>Benjamin used the transmission woodpiece to pass the message, and after half a day, a few dozens of mages from the Academy arrived from the sky. After they have landed and discussed the situation with Benjamin, they cuffed the mages from the Fulners with Anti-Mage chains, and left with them in tow.</p><br/><p>Meanwhile, Benjamin cannot stay with the students anymore. His identity was revealed, and the practical will no longer be effective if he continued to follow the students. Thus, he decided to return to the Academy, and allow Lara to bring these students to the Mercenary Association.</p><br/><p>After all, they are soon going to leave the deserted areas. When they managed to reach a more populated place, there should be no other hostile forces coming up to surround them.</p><br/><p>Just like that, a bunch of people with their prisoners finally arrived at the Academy of Magic after a few days.</p><br/><p>Benjamin had them locked up in some of the empty cellars in the basement.</p><br/><p>\"Should I write a letter to Accius? Or else, he might not know that I’ve already invited you to my Academy.\" Benjamin asked as he looked at the middle-aged mage in the basement.</p><br/><p>\".... Maybe.\"</p><br/><p>\"Then, I’ll need a way to contact him,\" said Benjamin slowly, \"There should be a secret way of contact between both of you. Tell me, as I’ll need to bypass the supervision of the church to get the news to him.\"</p><br/>\n</div>"}