{"title": "Chapter 602: Going Out for Practical Training", "id": 602, "volume": 7, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-602-going-out-for-practical-training", "volume_title": "Volume 7", "body": "<h1>Chapter 602: Going Out for Practical Training</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 602: Going Out for Practical Training</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>When those words were spoken, everyone in the underground room stared at the captive mage, as if they couldn’t believe what they had just heard.</p><br/><p>\"...could it be an act?\"</p><br/><p>Benjamin could not help but stretch out his arms and shake the captive by the shoulders, making sure he was completely awake.</p><br/><p>But, no matter how hard he shook, the captive still looked vacant and could not even recognize Benjamin and the old man.</p><br/><p>\"Who are you? Where is this? Wait... Who am I?\"</p><br/><p>Benjamin covered his mouth with his palm, he was speechless.</p><br/><p>Alright, so the potion did not kill him, but his entire memory had been wiped clean. If this mage had lost his memories and could not even remember the spells from before, then how was he different from a commoner?</p><br/><p>What a headache...</p><br/><p>The old man’s eyebrows were also tightly knitted together. He pulled open the captive’s eyelids and examined for a while more, after which he said, \"The potency of the magic potion should have been neutralized by my potion, the Queen can no longer control him.\"</p><br/><p>Benjamin shook his head in response to the statement, \"So what? He’s only a dummy now - even if the Queen could control him, he’s useless.\"</p><br/><p>\"I feel that this problem is a result of the two types of potions clashing. My potion on its own should not have caused this.\" The old man thought for a moment before replying, \"I still need to do more research about the situation.\"</p><br/><p>\"Can you improve the potion?\" Benjamin asked immediately.</p><br/><p>Principles did not matter anymore; a potion that would cause memory loss after it had been drunk was basically useless. Even if he had done his best to think up a way of getting the mages of Icor to drink it, he would just be left with a bunch of commoners with no ability to take care of themselves.</p><br/><p>If the Church heard of this, they would laugh roll on the ground in laughter.</p><br/><p>They needed to research and come up with a new antidote.</p><br/><p>\"No, there is no way to change the potion. Its composition is very complex. Weakening its potency will stop it from having the intended result.\" The old man frowned as he rested his hands on his hips.</p><br/><p>Benjamin’s headache worsened.</p><br/><p>This meant that Benjamin’s hope of relying on the breakthrough magic potion so that the Mages’ Organization of Icor would collapse by themselves and desert the Queen was basically impossible.</p><br/><p>Fortunately, the old man added a few more words onto his earlier statement, \"However… I think this loss of memory should not be long term. He will probably recover.\"</p><br/><p>Benjamin furrowed his eyebrows, \"How long before he will recover?\"</p><br/><p>If the mages of Icor all lost their memories for a whole month, it would still be a big problem.</p><br/><p>The old man, however, held up his hands in surrender, \"I don’t know.\"</p><br/><p>Benjamin felt dejected and could only sigh, \"Whatever... All of you, get to work. I’m going back. When you have news, call me.\"</p><br/><p>Having finished speaking, he shook his head and turned around to leave.</p><br/><p>There was no point in staying here any longer, it would only worsen his mood. He might as well go take a walk and inspect the academy. At least the academy was flourishing, unlike the blundering research project here.</p><br/><p>Around this time, students were starting to enter the magic potion courses. Because of this, Benjamin met a few students holding on to bottles and cans while he was walking out. They greeted Benjamin somewhat fearfully, perhaps because they had been shocked by Benjamin’s \"Descending of Water\", and had not recovered fully yet.</p><br/><p>Benjamin shook his head helplessly and walked out towards the academic building.</p><br/><p>After being tested through the examinations, a group of candidates with impressive talents had clearly separated themselves from the rest of the student body, a fact that the people from the Mercenary Association had noticed. They had even sent people over to urge Benjamin to quickly let the students start their \"practical training\", so that they could carry out mission.</p><br/><p>It seemed a little early, but which powerful mage had not grown from a genuine battle? Benjamin did not want to end up nurturing a bunch of flowers in a nursery. Because of that, he agreed that real-life assessments should begin soon.</p><br/><p>He was going to look for Varys to arrange them now.</p><br/><p>\"Right now, there is a total of fifty one students in the academy who are at a level where they can begin to undertake tasks.\" Benjamin put the namelist that the System had organized onto the table as he spoke. \"You can ask them how they feel about the course - then they can be grouped into teams or something like that, it doesn’t really matter. Oh, right... also make sure a teacher is leading the time during their first fight against a magical creature.\"</p><br/><p>Varys took a look at the namelist and was somewhat startled, but still nodded.</p><br/><p>\"What about the courses they will be missing?\"</p><br/><p>Benjamin shrugged, \"Up to you. These are primarily people from the top class, so you can make arrangements all at once. Furthermore, missed classes can be replaced when they return. Actual combat experience is still extremely important.\"</p><br/><p>Varys nodded and did not ask any further.</p><br/><p>Benjamin also rubbed his chin.</p><br/><p>Although he did not say it out loud, but he was ready to secretly follow this first batch of students on their mission. People who had ulterior motives were still aplenty, especially for this initial batch; he had to make sure to keep an eye on them. If any accidents were to happen, it would be very troublesome.</p><br/><p>He returned to his residence and meditated quietly for a few days. After a few days, the selected team of students set off towards a branch of the Mercenary Association that was the nearest to the academy. Benjamin followed suit, watching everything from afar.</p><br/><p>He had been stuck in the academy all this time and could finally catch a breath of air. He felt invigorated.</p><br/><p>\"The Director is too worried. He even sent a teacher to come and protect us. It’s not like we’ve never traveled before. When I entered school, I had come all by myself.\"</p><br/><p>\"Yes... We have learnt a lot of low-level magic. It’s only be a mercenary task; how hard can it be?\"</p><br/><p>Disguised as a hunter who was traveling along the same route, Benjamin heard the discussions between the students, and could not help but smile bitterly.</p><br/><p>He could feel the desire of these students to prove themselves. However, if they had known that the dean himself had followed them, how would they feel?</p><br/><p>There was no other way. These were the most gifted students. They were rather precious to him.</p><br/><p>After some time, they entered Ferelden. The closest city was still two days away. The mountain path was rough; so far, they had encountered attacks from two packs of magical creatures. Luckily, these creatures had been rather weak. Under the instructions of the teacher, the students successfully defeated them.</p><br/><p>Because he was pretending to be a regular hunter, Benjamin had to act shocked when the monsters attacked. At that time, a few students had even run over to him, making sure to protect him so that he would not be mauled by the magical creatures.</p><br/><p>\"It’ll be alright, these magical creatures are very weak. Just hide behind us, it’ll be fine.\"</p><br/><p>At that time, that student had beat his own chest and spoke those words, acting as though he was very powerful. Hearing that made Benjamin want to laugh out loud.</p><br/><p>Nevertheless, this indirectly showed that the students’ hearts were pure.</p><br/><p>Benjamin could not help but think about if he should add an extra course to teach these students how to deceive people and how to prevent themselves from being deceived? It was not good for them to become too kind in the academy.</p><br/><p>He smiled at the thought… All those years in the past he had learnt so much about ethics and morals, but even after all that, he still became a villain when he needed to be. But things like this were not teachable in a classroom, so in the end he could only drop the idea.</p><br/><p>After leaving the mountainous area and entering some plains, Benjamin, still disguised as a hunter, left the group. Then, he pretended to be a middle-aged merchant, and went along with them. The students still did not notice anything, and expressed, in a friendly manner, how powerful they were as mages, and how they could protect him along the way</p><br/><p>Benjamin could only force himself to put on a face of gratitude, nodding his head vigorously.</p><br/><p>\"You are mages? This is wonderful! IWe seem to be walking in the same direction, can you bring me along?\"</p><br/><p>At this time, a few travellers by the roadside seemed to have heard their conversation, and with eager faces, walked over to them.</p><br/>\n</div>"}