{"title": "Chapter 615: A New Batch of Mages", "id": 615, "volume": 7, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-615-a-new-batch-of-mages", "volume_title": "Volume 7", "body": "<h1>Chapter 615: A New Batch of Mages</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 615: A New Batch of Mages</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>This kind of situation had left Benjamin feeling unusually confused. Hence, after deliberating about it for a while, he entered the inn alone and approached the mages that were disguised as commoners.</p><br/><p>\"… The two from yesterday decided not to come anymore?\"</p><br/><p>\"Yeah, they said that there’s no hope in staying here. They'd rather have a change of scenery and find a way out.\"</p><br/><p>Benjamin indistinctly heard their conversation. If anyone didn’t know better, they probably would think nothing of it. However, Benjamin immediately realized that these mages were also vexed over passing through the gates.</p><br/><p>Just as the mages he has met earlier, these people seemed to have formed some secret meeting, meeting every day to discuss the methods of passing through the gates.</p><br/><p>The question was whether or not this meeting was a trap set up by the Church…</p><br/><p>After all, they were all mages, and among a few of them were old acquaintances to Benjamin; he just couldn’t sit by and watch it go by. However, he couldn’t reveal his identity. Therefore, after giving much thought, he walked over and patted the short mage on the shoulder.</p><br/><p>Instantly, the few mages turned over together, and stare at Benjamin with alertness.</p><br/><p>\"What’s your story?\"</p><br/><p>The short mage was vicious-looking as he asked. Elizabeth also stated back, perplexed. Given that it had been a long while, and given Benjamin’s expertise in disguise, no one had managed to recognize him.</p><br/><p>Benjamin did not speak, but instead laid out his palm, handing over a small note.</p><br/><p>The short mage received the note and took a few more glances at Benjamin. He then passed the note over to Elizabeth. She opened the note to look and her eyes immediately intensified. She quickly lowered her voice toward Benjamin, \"Please follow us.\"</p><br/><p>Benjamin nodded.</p><br/><p>The note was fairly small. He did not write down his identity nor origins. Written on it was just a word: \"Mage\". However, he didn’t think that a little note would have Elizabeth trust him that quickly.</p><br/><p>There were many eyes and ears in the inn, these mages did not say anything more. Elizabeth was the unspoken leader of the pack. All of them followed her, leaving the place quietly.</p><br/><p>Benjamin followed from behind. Taking detours before reaching a remote, isolated corner in this little town.</p><br/><p>\"… Are you also a mage?\"</p><br/><p>After reaching here, the few mages stopped their footsteps and turned around. The short mage narrowed his eyes and raised his eyebrows as he stared at him, his eyes were filled with doubts.</p><br/><p>For some reason, Benjamin felt like bursting into laughter.</p><br/><p>\"I am…\"</p><br/><p>Just as he was about to speak, he was unexpectedly cut off, \"Hey, you there! What are you suspicious guys doing here? Are you planning to steal something?\"</p><br/><p>The lot turned around and saw that, at the end of the corner, a few of people dressed as soldiers were looking their way with raised eyebrows.</p><br/><p>However, even before these soldiers, the tall and the short mage did not show any fear. Instead, they walked over casually and smiled while greeting the soldiers as if they were sworn brothers.</p><br/><p>\"It’s us! Bro, don’t you remember us?\"</p><br/><p>The few soldiers seemed to have recognized them.</p><br/><p>\"Oh, it’s you. What business do you have here?\" One of the soldiers laughed, \"Do you still have alcohol from the other time? Our leader really loved it!\"</p><br/><p>\"No more. How can we obtain that much red wine of the aristocrats? Bro, you’re killing me…\"</p><br/><p>The two mages and the soldiers exchanged greetings for a moment at the corner of the street. The soldiers were entertained by the silliness of the mages. It wasn’t long until the soldiers patted their shoulders and left without questioning why they were hiding in the corner anymore.</p><br/><p>Observing all this, Benjamin couldn't help but raise his eyebrows. It seemed he was impressed.</p><br/><p>Was… this a trap set up by the Church? Or were these two brothers just that capable?</p><br/><p>\"Thompson and Jared both have tight relationship with the gate guards, otherwise we wouldn’t be able to hide that long in town,\" Elizabeth suddenly spoke, as if explaining to Benjamin the earlier event, \"I guess there are people with this sort of talent, naturally able to have people let down their guard.\"</p><br/><p>Benjamin turned to looked oddly at Elizabeth.</p><br/><p>\"You aren’t suspicious of me?\"</p><br/><p>Elizabeth was silent for a moment before answering, \"I can feel that you’re not from the Church. I… don’t have any other talent, but I’m not far off from judging people by instinct.\"</p><br/><p>The two mages returned at this moment and were kidding around, \"Yeah, she has killer instincts! There was a mage that was sent by the Church who wanted to join in. She managed to see through it. I tell ya, she’s got some natural instincts.\"</p><br/><p>Benjamin’s brows were tied up in a knot.</p><br/><p>For some reason, he suddenly recalled during that meeting, it was Elizabeth who told him the room number where Grant was having a homosexual intercourse.</p><br/><p>Natural instincts huh…?</p><br/><p>Yet, she didn’t seem to recognize him.</p><br/><p>\"You guys are gathered here to see how you could cross the gates?\" As he was thinking, Benjamin did not feel the urge to reveal his identity. Instead, he popped a question.</p><br/><p>Elizabeth nodded, \"Yes, the guards at the gates are really strict. Any mages would find it hard to pass through their detection. Truth be told, we are held up here for months.\"</p><br/><p>\"Then how many mages are gathered here in this town?\"</p><br/><p>\"Not many. A lot of them saw no hope of leaving. They stayed for a couple of days before leaving Town of Crewe. In the end, there are only around ten mages left.\" Elizabeth replied, \"After all, this is a dangerous place. The Church has tightened the security. Previously, there were many mages that the Church specifically nurtured who wanted to mix within us. We have taken care of them.\"</p><br/><p>Benjamin stole a few glances at the mages that he has never seen before and nodded as he fell deep in thought.</p><br/><p>This batch of mages seemed to have some brains, unlike the previous group who had traitors amidst them. This would mean that the Church was unaware of the location of these mages.</p><br/><p>Now, he did not need to worry about traps or having any information leaked out.</p><br/><p>\"If that’s the case, then call the others here,\" Benjamin spoke casually, \"I can bring you out of the Kingdom of Helius.\"</p><br/><p>\"…\"</p><br/><p>For a long moment, those on scene stared at Benjamin dumbfoundedly. The entire corner was silent as gold.</p><br/><p>\"Wha… What you’re saying is true?\" One of the mages returned to his senses after a jaw-dropping moment and asked with a peculiar expression.</p><br/><p>Benjamin felt a wave of helplessness surge through him.</p><br/><p>\"Of course it’s true,\" He shrugged, \"I just came in from abroad. Naturally, I could easily take you all out.\"</p><br/><p>\"A-Abroad…\"</p><br/><p>Once again, the mages’ jaw dropped.</p><br/><p>Benjamin couldn’t help but remember how he was before. Just before leaving the gates, he was just like these mages, excited yet, yearning towards the unknown outside world.</p><br/><p>Mages, under such enclosed environment and coming to this steps, it must have been hard…</p><br/><p>\"How did you come over?\" Elizabeth asked.</p><br/><p>\"I flew from over the mountain,\" Benjamin thought as he took out some griffin feathers from his bag, \"Although there are many griffins in the mountains, you need not be afraid of these beasts without intelligence if you are strong enough. They are easier to defeat compared to the Church.\"</p><br/><p>The mages stared intently at the shimmering feathers, unable to close their traps.</p><br/><p>They have remained in the Town of Crewe for far too long. Of course, they knew about the nearby mountain range. They were well aware of how terrifying the Griffins in the mountains could be, and managing to barge through would require such an amazing capability.</p><br/><p>Therefore, their expressions were nothing less than utter shock.</p><br/><p>\"Se-senior! Barging over from the mountains, you’re amazing… Could you take me as your apprentice?\" One of the mages shiveringly asked.</p><br/><p>Benjamin smiled, \"Nope.\"</p><br/><p>\"...\"</p><br/><p>Showered by the admiring gazes, Elizabeth suddenly remembered something and glared at Benjamin peculiarly. She was quiet for a moment before asking, \"Then… If you’re a mage from abroad. Why would you come to this hellish Kingdom of Helius, when you could have it good overseas?\"</p><br/>\n</div>"}