{"title": "Chapter 623: The Guards of the Prison Ruins", "id": 623, "volume": 7, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-623-the-guards-of-the-prison-ruins", "volume_title": "Volume 7", "body": "<h1>Chapter 623: The Guards of the Prison Ruins</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 623: The Guards of the Prison Ruins</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Miles didn't answer the question, instead, he replied, \"If you want to know, why not come see for yourself?\"</p><br/><p>Benjamin rolled his eyes, he could only follow him toward the prison ruins on the outskirts. The surroundings of that area were arid, not many patrolling soldiers either, so there was no need for any detours. They reached the entrance in just a span of ten minutes.</p><br/><p>Apparently, upon closer inspection, Benjamin realized that there were quite a number of people guarding the prison ruins.</p><br/><p>What's happening here?</p><br/><p>The duo quickly concealed themselves in a nearby corner, using an abandoned house as cover, they cautiously observed the prison ruins.</p><br/><p>\"Those are… purifiers, holy knights and pastors… there should be at least a few hundred people guarding this place,\" After heightening his senses for a brief moment, Benjamin whispered, \"They're all from the church, what could they be guarding?\"</p><br/><p>Miles wasn't the least bit surprised.</p><br/><p>\"To look for the entrance to Abandoned Valley of Gods, of course.\" He replied.</p><br/><p>Benjamin turned his head to face Miles, eyeing him curiously and asked, \"You expected this early on?\"</p><br/><p>Miles smiled awkwardly and said, \"Of course I did, all those talks about gathering information from before were lies. After infiltrating the grand Saint Peter's church, I happened to stumble upon the church's records, and unmistakably written in those records was the Church's recent discovery of the prison ruins being the location of Abandoned Valley of Gods.\"</p><br/><p>Benjamin was at a loss for words.</p><br/><p>\"...Why didn't you just say so?\" Benjamin asked after a brief moment of silence.</p><br/><p>Miles replied, \"Didn't you want to hide from the Church? I was afraid you wouldn't come if you knew that people from the Church are here. The silver key is with you, after all, there's no point in coming otherwise.\"</p><br/><p>Benjamin listened and shook his head in annoyance.</p><br/><p>This bastard…</p><br/><p>The reason why he wanted to hide from the Church was simply to avoid any further complications rather than out of fear. Furthermore, if the news about the Abandoned Valley of Gods were true, a bit risk wouldn't have discouraged him from checking it out.</p><br/><p>Moreover, since the source of the information came from the Church itself, the likelihood of it being correct was fairly high.</p><br/><p>Benjamin, however, found all this to be rather inconceivable. He had come here countless times, after all. Plus, the secret tunnel from \"Silver Fox\" also led to this location. Was it truly possible that the Abandoned Valley of Gods was within these ruins?</p><br/><p>All of this seemed rather preposterous.</p><br/><p>Nonetheless, they were already here. Even though Miles deceived him into coming here, he wasn't about to leave now. Of course, given the current circumstances, a new question came to their minds. How were they going to infiltrate the prison ruins?</p><br/><p>Benjamin once more heightened his senses to take a grasp of the surroundings inside.</p><br/><p>Due to the presence of pastors, he dared not to look too intricately. After a wide scan, the map of the entire area should be recorded within System's databanks.</p><br/><p>Soon enough, System transcribed the map for Benjamin.</p><br/><p>At the moment, there were more people than he imagined within the prison ruins' interior. Aside from the groups guarding the outer area, a number of pastors in unusual getups could be found in the central area. Their hands held crosses, and they pointed them at every corner as if they were searching for something.</p><br/><p>Benjamin held his chin, analyzing the scene before him.</p><br/><p>In the operation of such a setup, even if the entrance to Abandoned Valley of Gods was not to be found here, there would surely be some other secrets lying about. It was probably worth the risk for them to come here.</p><br/><p>Except… how were they going to head in?</p><br/><p>\"The silver key is with me now, but… we should first get around these people, only then can we enter this place,\" With that, he looked towards Miles and asked, \"You got any ideas?\"</p><br/><p>Miles scratched his head, and said, \"If I was on my own, sneaking in wouldn't be an issue. You, on the other hand... I couldn't sneak you in even if I tried.\"</p><br/><p>\"What now, then?\"</p><br/><p>\"You could give me the silver key, I can scout ahead while you keep a lookout for me.\"</p><br/><p>Benjamin listened and retorted without hesitation, \"Beat it.\"</p><br/><p>\"...\"</p><br/><p>With his sights set on the innocent-looking Miles, Benjamin crossed his arms, his expression became sterner than he'd ever been, and said, \"The silver key is mine, do not think you can take everything for yourself.\"</p><br/><p>Miles looked dejected.</p><br/><p>\"Why are you so stubborn about? Inside the Abandoned Valley of Gods, there could be something extremely important to me, I have to obtain it.\" He locked all of his fingers together, putting up his most miserable look, \"I've already helped you so much, is it too much to ask for you to return a favor?\"</p><br/><p>Benjamin's face remained unfazed, and said, \"We will go in together. Whatever happens, I'll pass it to you if you need it.\"</p><br/><p>\"Why you…\"</p><br/><p>Miles facepalmed himself, defeated.</p><br/><p>Benjamin's resolve was beyond unmoved. No matter how much Miles begged, his decision stood still. At last, he could only accept his terms and said, \"Very well then… But, if both of us are sneaking in, it has to be during the nighttime.\"</p><br/><p>As he listened, Benjamin nodded in agreement.</p><br/><p>With that decided, the two stayed in a nearby abandoned house, patiently waited for nightfall. Benjamin activated his water element senses, cautiously observing the surroundings to avoid unsuspecting complications.</p><br/><p>As time passed, the night sky came into view. Benjamin then noticed people within the prison ruins slowly exited.</p><br/><p>He quickly readied himself.</p><br/><p>The pastors within the ruins' interior must have been utilizing enchanted tools to look for the entrance. From the looks of it, this process didn't seem to carry on for twenty-four hours non-stop. Once it's night time, the pastors will rest, while the ruins were left with encircling purifiers and holy knights.</p><br/><p>Simply, by avoiding their lines of sight, made it so much easier to sneak in.</p><br/><p>Benjamin thought to himself, turned to Miles and asked, \"Did you know they would leave at night?\"</p><br/><p>\"I did.\"</p><br/><p>\"Then what was with the clueless act you put early on? How is it that only you go in?\"</p><br/><p>Miles shrugged, blankly said, \"To persuade you to hand me the silver key, of course. What was I supposed to do when you didn't fall for it? So, it boiled down to both of us attempting to go in instead.\"</p><br/><p>\"...\"</p><br/><p>Benjamin shook his head, revealing a face that can only describe \"I knew it\".</p><br/><p>Soon, when the time hit nine o'clock, most of the pastors had left the inner ruins. Outside the ruins, however, holy knights and purifiers positioned themselves in a tight defensive formation, overseeing every nook and cranny of the area.</p><br/><p>The sight of this gave Benjamin a headache.</p><br/><p>This… wasn't any easier to sneak in...</p><br/><p>\"Your plan?\" huffed Benjamin.</p><br/><p>Miles grinned and said, \"Eyes on me now.\"</p><br/><p>As he said this, he opened the door of the abandoned house, fumbled about to leave.</p><br/><p>Through Benjamin's senses, Miles stuck to the walls and slowly made his way to a place near the ruins. Hiding under the night's shroud, he looked toward the guards. He then pulled out a potion and drank it.</p><br/>\n</div>"}