{"title": "Chapter 631: A Dead Land", "id": 631, "volume": 7, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-631-a-dead-land", "volume_title": "Volume 7", "body": "<h1>Chapter 631: A Dead Land</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 631: A Dead Land</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>After returning to reality, the first thing that Benjamin saw was the sky was almost covered with elemental light clusters.</p><br/><p>At that moment, he was somehow in the center of the crack, while Miles had fallen on the ground beside him, and he seemed to not have awakened yet. Around them, there was a thin layer of strange bubble-like film, wrapped around the both of them, so that the elementary light group will not drown them instantly.</p><br/><p>However, the moment Benjamin woke up, the film snapped and broke.</p><br/><p>Shit...</p><br/><p>Benjamin was dumbfounded.</p><br/><p>In the meantime, the elementary light group around them seemed to have frozen immediately.</p><br/><p>They gathered their attraction to the rune, but the moment the illusion was destroyed, the power of the rune disappeared. As a result, these elemental light clusters lost their target in just a few seconds, so they were confused.</p><br/><p>But... they will certainly not remain lost for any longer.</p><br/><p>In Benjamin's point of view, these elemental light clusters, were not harmless and not lovely green rune monsters, rather, they were red rune monsters that will attack all creatures in the area. Therefore, when they awaken, what else will they do next?</p><br/><p>\"Stop sleeping! Come on, wake the fuck up!\"</p><br/><p>Benjamin came back to his senses and immediately carried Miles who was passed out at the side, he continuously shouted while he carried him like a shield and swayed him around.</p><br/><p>This was not a joke, he cannot deal with these damn runes!</p><br/><p>He was just using the elemental light clusters to destroy that weird illusion, he did that because he had no other choice. That \"Cain\" was too weird, if he stayed in the illusion any longer, he would probably be in danger, and other than making use of external forces, there was absolutely no other way to get rid of the illusion. It was not easy for him to come up with this method.</p><br/><p>But now, they have to face the downside of this method.</p><br/><p>After the elemental light group was briefly stunned, they immediately started swarming towards them, and they almost looked like a group of vultures going after their prey. All the exits around was sealed tightly, so Benjamin could only rely on Miles's special constitution to defend against their enemies.</p><br/><p>Fortunately, these elemental light clusters seemed to strongly dislike Miles.</p><br/><p>Not knowing why, but they did not want get half a meter closer to Miles. Benjamin saw this, so he quickly carried Miles, swayed him in the air as though he was trying to chase beasts away with fire and kept the elemental light clusters as far away as possible.</p><br/><p>At that instant, the elemental light clusters did not get any closer. Instead, most of them were being driven away.</p><br/><p>\"Hmm... I... hey y-you, what are you doing? Put me down!\"</p><br/><p>However, Miles was soon awake from being shaken. He must have been very upset about being treated like a burning branch that was being waved around, so he immediately began to struggle and protest.</p><br/><p>Benjamin quickly put him down.</p><br/><p>\"Be careful, a large number of elemental light clusters has gathered here, we need to drive them off first.\" He said.</p><br/><p>Right after waking up from a coma, Miles seemed to be a little confused about the current state. However, after being a mercenary for a long time, he instinctively took out a short knife and rushed towards the elemental light clusters, and soon, he created a passage.</p><br/><p>Benjamin took the opportunity to fly out of the crack, breaking out of the circle of elemental light clusters and regained freedom.</p><br/><p>As Miles was trying to drive the elemental light clusters away, he was trying to flee in midair while he asked the System about what happened just now.</p><br/><p>\"What happened? What is what the illusion?\"</p><br/><p>The System popped up and said blankly: \"What illusion? I do not know... did you just get caught in some weird hallucination again?\"</p><br/><p>\"Nonsense...\" Benjamin was speechless, \"We all fainted suddenly, moved to the middle of the crack, and then we were wrapped up in a weird film. What is with this whole process, don’t you find it strange?\"</p><br/><p>The System kept quiet for a while and said: \"A few minutes ago, you stood at the edge, and suddenly turned around. Then, I suddenly lost contact with you, as though there was a force blocking me off, like a virus. What happened in the middle of the crack, I really do not know. \"</p><br/><p>Benjamin heard this and frowned.</p><br/><p>The system can be blocked out, what is with the creator of the illusion?</p><br/><p>\"Can you analyze what was the force that was blocking you off?\" He asked again.</p><br/><p>The System replied: \"It felt like a tremendous spiritual energy.\"</p><br/><p>Benjamin nodded thoughtfully.</p><br/><p>He recalled Cain’s words when he said before the illusion collapsed, he was inexplicably horrified. Could it be... what they met was really resentful souls left by Cain, and after thousands of years had gone by, they became even more insane and they wanted to trap every living being that entered God’s abandoned valley in their illusion?</p><br/><p>He felt like this could be used to write a horror story...</p><br/><p>Moreover, the hero from thousands of years ago, if he really did turn out like this, that would be really sad.</p><br/><p>After he came back to reality, the valley below him still looked the same. Although he felt like he was in the illusion for a long time, it was just a few minutes in God’s abandoned valley, the destroyed ground did not change.</p><br/><p>However, Benjamin was sure that this was where Cain and Abel had their final battle.</p><br/><p>\"Okay, all the elemental light clusters left.\" Suddenly, Miles's voice was heard and interrupted his thoughts. \"Come on over, what happened just now?\"</p><br/><p>Benjamin heard this, landed on the ground and asked: \"What did you see just now?\"</p><br/><p>\"I... it felt like I had a dream, but it was very messy, I can hardly recall them.\"</p><br/><p>\"Okay then.\"</p><br/><p>They were both being knocked off by that strange guy, I was caught in an illusion while Miles was dreaming. That \"Cain\" was most probably coming after him.</p><br/><p>Benjamin was a little uneasy. However, the strange sound that he had been hearing had disappeared, so he guessed that \"Cain\" should be gone for now.</p><br/><p>Just that... ... he felt like he should not stay in this place any longer.</p><br/><p>With this thought in mind, he briefly explained to Miles, and then suggested they leave. However, Miles did not have the slightest thought of leaving after hearing that he was in an illusion.</p><br/><p>\"No, I am going to find that thing.\" He said while he put away his dagger and glanced back and forth at the presumable battlefield of Cain and Abel. \"Here must be the place where they fought... it must be… it must be there.\"</p><br/><p>The treasure of God's abandoned valley, was it really that enticing?</p><br/><p>At that moment, he wanted to split up with Miles and find a way to leave this place by himself. However, since this was such a dangerous place, it wasn't wise to act alone.</p><br/><p>\"Forget it, I'll help you find it.\" In the end, Benjamin said, \"I can use my spiritual energy to scan this place, including deep underground, but after finding it, despite what it may be, we have to leave.\"</p><br/><p>Miles raised his head and looked at Benjamin. He kept quiet for a moment and eventually nodded.</p><br/><p>Therefore, Benjamin activated the water elemental sensing technique and started scanning inch by inch, every corner of the valley. He could feel that this land was radiating with the smell of death, and it was putting on his spiritual energy an inexplicable burden.</p><br/><p>He had a feeling that some kind of monster would suddenly pop out....</p><br/><p>Fortunately, the System was also helping him, and they soon found something underground.</p><br/>\n</div>"}