{"title": "Chapter 635: The Difficulty of Stigmatization", "id": 635, "volume": 7, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-635-the-difficulty-of-stigmatization", "volume_title": "Volume 7", "body": "<h1>Chapter 635: The Difficulty of Stigmatization</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 635: The Difficulty of Stigmatization</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>At last, Benjamin and Miles arrived at the edge of the Abandoned Valley of Gods. After sticking the gingko leaves on the towering mountain, they suddenly returned to the original world.</p><br/><p>It was still night time in the original world. Although many hours had passed in the Abandoned Valley of Gods, it seemed like only ten minutes had passed in reality. They also realized that they were no longer in the Prison Ruins, but somewhere near a desolate mountain peak on the northern side of the Imperial Capital.</p><br/><p>Benjamin sighed a sigh of relief after confirming the time and location.</p><br/><p>Fortunately, it was not like a month had passed in the real world with every hour passed in the Abandoned Valley of Gods, or else their plan for Icor would have gone down the drain.</p><br/><p>It was getting late, so they set up camp at the foot of the mountain to rest, prepared to spend the rest of their time to continue causing havoc in the Kingdom of Helius. While Miles agreed to this, he left without saying goodbye on the morning of the second day.</p><br/><p>\"He must not have slept at all and left during the night.\" The System said.</p><br/><p>Upon hearing this, Benjamin shook his head helplessly.</p><br/><p>Forget it... Let Miles cool down for a while, he still had other important matters to attend to.</p><br/><p>Besides completing the deal with the Fulner family, Benjamin realized that there was a great opportunity for the mages. While the people from the Church were busy with the infighting team stations, he could try and start spreading the ideology of how magic is not a sin in the Kingdom of Helius.</p><br/><p>After all, the situation was different from other countries as most of the people here had been brainwashed by the Church into thinking that mages are the representatives of the devil. Benjamin knew that if he wanted to eradicate the Church so that mages could walk in the streets with their heads held high, he had to first change the mentality of the people.</p><br/><p>This would definitely be a long process, and although his conditions were not ideal, he had the time to do so.</p><br/><p>With this, Benjamin unfolded the map of the Kingdom of Helius; his eyes panned over all the remote towns and very quickly, he customized the fastest route.</p><br/><p>Following this, Benjamin started on his journey.</p><br/><p>That afternoon.</p><br/><p>\"Mister Priest, save our children! The spread of the plague is becoming worse if this goes on, who knows how many more people we will lose!\"</p><br/><p>In a remote village on a mountain, many people were gathered outside the cathedral, kneeling on the ground and begging in front of a priest at the door.</p><br/><p>On the ground behind them, tens of straw mats were rolled out. Each straw mat was occupied by a dying person; there were people of all ages and both sexes, their painful moans constantly droning on in the background. It was quite a disturbing scene.</p><br/><p>However, despite all this, the priest still had his palms held together and remained expressionless.</p><br/><p>\"You don’t have to worry, for God has plans for them.\"</p><br/><p>The line that had been repeated countless times naturally would not satisfy the villagers who were at this point begging for their lives. A middle-aged woman went to the front and pulled at trousers of the priest, tears streaming down her face.</p><br/><p>\"Mister Priest, don’t you know divine arts? Isn’t that... Isn’t that the power that God has given to you? Just... You just use the divine arts and save them, alright?\"</p><br/><p>The priest watched the middle-aged woman pitifully, then glanced at the patients who filled the grounds outside, at last, he shook his head.</p><br/><p>\"I will try my best to report all of this to the Imperial Capital, they will send doctors here.\" He said in a gentle tone. \"As for divine arts, that is a weapon used to defend evil, we can’t abuse it for day-to-day matters.\"</p><br/><p>The people who were kneeling heard what he said but did not look comforted at all.</p><br/><p>\"Doctors... Are the doctors from the Imperial Capital really coming? Our small village has nothing at all... During the famine in the past, the food to relieve the disaster was never delivered to us as either...\"</p><br/><p>The priest turned cold and said in a strict manner, \"What are you thinking? This is all the will of God. If any of you show even the slightest bit of insincerity, then it will only bring greater harm to the village!\"</p><br/><p>Upon hearing this, the villagers shuddered and lowered their heads, not daring to say anything else.</p><br/><p>Suddenly, a sound came from above to break the silence.</p><br/><p>\"Just admit that your skills in the divine arts are not good enough to save these people. There’s no need to make up all these nonsense about providence and scourge, aren’t you tired of it all?\"</p><br/><p>Everyone was stunned.</p><br/><p>They raised their heads and looked towards the source of the sound.</p><br/><p>They saw a man wearing a black cloak and dressed up in typical mage attire descend from the sky with a smile on his face. Before anyone could react, he landed gently behind the priest.</p><br/><p>At that moment, almost all the villagers were stunned.</p><br/><p>\"God..... Oh God, it’s a mage!\"</p><br/><p>The priest was the quickest to react. Without even looking at Benjamin, he crushed the Cross in his pocket, turned around, and ran away under the protection of the shield. However, after just a few steps, a gigantic water bubble precipitated in the air and trapped him inside of it.</p><br/><p>The priest attacked the water bubble in a frenzy but could not escape no matter how much he struggled. His roars of anger echoed throughout the entire village.</p><br/><p>\"Now you can see that, it’s not that he does not want to save them, but he doesn’t even have that ability to do so.\" Benjamin turned around and spoke to the villagers who were kneeling outside of the cathedral.</p><br/><p>The villagers were speechless as they looked on.</p><br/><p>\"You... You...\"</p><br/><p>It could either be because of the sudden appearance of a mage, or because the priest high above had such a tremendous change, but they could not say anything. They could only stare at Benjamin who was standing at the entrance of the cathedral and the priest who was stuck in the water bubble with their mouths hanging wide open.</p><br/><p>Benjamin saw some astonishment in some of their eyes, but even more of them showed fear.</p><br/><p>These villagers are afraid of magic.</p><br/><p>It couldn’t be helped, with the propaganda done by the Church over the years, it was inevitable. If Benjamin had not shown up in such a powerful form, he suspected that the villagers would throw rotten eggs at him.</p><br/><p>\"Everyone run quickly! Quickly inform the priest in the village next to us! This is the evil mage that has been doing evil things, everyone run!\"</p><br/><p>The priest was probably the fastest person to calm down. As he realized that there was no way for him to escape the water bubble, he immediately shouted these words at the villagers to try to stop Benjamin.</p><br/><p>But in reality, the villagers could not hear what he was shouting about.</p><br/><p>When he said his first words, Benjamin had used the water bubble and completely blocked out any sound coming from inside. Therefore, the villagers could only see the priest’s mouth rapidly moving and his ferocious expressions getting more and more frustrated, but they could not hear a sound.</p><br/><p>For most of the people, this damaged their image of the Church.</p><br/><p>Nevertheless, Benjamin did not just want to make a fool out of the priest.</p><br/><p>\"These people are seriously ill, forget about this priest, even if the Imperial Capital sends you a bishop, they might not be saved.\" He looked at the grounds outside full of patients and said slowly, \"Nonetheless, I can use magic and heal them in the blink of an eye.\"</p><br/><p>Still, nobody said a word.</p><br/><p>Upon seeing this, Benjamin frowned.</p><br/><p>\"What’s the matter? You don’t want to save them? Or is your sadness actually nothing but an act, and in reality, you don’t actually care for your loved ones?\"</p><br/><p>Finally, the middle-aged woman who was crying earlier could not bear it anymore and cried mournfully as she said, \"No! I... I want to save my child!\"</p><br/><p>When Benjamin heard this, he smiled again.</p><br/><p>\"No... Don’t believe what he is saying, this is the devil you’re dealing with! Did you forget what the priest has taught us? The devil always says sweets words and leave out the bad ones, but as soon as you come to an agreement, your soul will not belong to you anymore!\" An elder pulled the middle-aged woman away in a panic as she attempted to advise her.</p><br/>\n</div>"}