{"title": "Chapter 636: Stopping the Plague", "id": 636, "volume": 7, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-636-stopping-the-plague", "volume_title": "Volume 7", "body": "<h1>Chapter 636: Stopping the Plague</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 636: Stopping the Plague</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Benjamin shook his head.</p><br/><p>The brainwashing done by the Church was so intense that even when he was offering these people a helping hand, they were still thinking that it was a trick. That made the situation a little difficult.</p><br/><p>Luckily, their desperation to save their families seemed to overpower their mentality towards mages.</p><br/><p>\"But... I can’t care about all of this anymore. If I really have to surrender my soul, then let me go to hell! I… I want to save my child...\"</p><br/><p>Not just the middle-aged woman, other people looked towards Benjamin with hope in their eyes.</p><br/><p>\"You... Can you really heal everyone here?\"</p><br/><p>Benjamin nodded.</p><br/><p>Of course, the village was bound to have some stubborn people. Most of them were elderly men who stared at Benjamin with their eyes full of fear. They turned to their fellow villagers in anger.</p><br/><p>\"You shouldn’t believe him! He... He’s a mage! What you’re doing now is betraying God, no wonder God is releasing all these disasters upon us, it’s all because of unfaithful people like you... You will bring greater disasters on us all!\"</p><br/><p>\"You hateful mage, get out of our village!\"</p><br/><p>Upon seeing this, Benjamin suddenly waved, and a fierce wind blew the mad protesters to the ground, immediately silencing them.</p><br/><p>The villagers all fell to the ground and shivered as they were shocked by Benjamin’s actions.</p><br/><p>After taking a glance indifferently, Benjamin spoke slowly,</p><br/><p>\"God has abandoned this land a long time ago, anything that happens at this point has nothing to do with God. The Church now is just a bunch of phony Christians who offers you peaceful and steady lives, but has done nothing to stop even a single plague.\"</p><br/><p>As he said this, he suddenly turned his head and pointed at the priest whom he had kept inside the water bubble, his resonant voice echoed throughout the grounds in front of the cathedral, \"With a Church like this, priests like this, and a God like this, why do you still choose to believe in them?\"</p><br/><p>Many of them raised their heads and peeked at the priest as they trembled in fear.</p><br/><p>The priest looked very disappointed. As he could not break through the bounds of the water bubble and his voice could not pierce through the barrier even after shouting for a long time, he looked embarrassed and meek. His previous image of looking noble was completely gone.</p><br/><p>At that moment, the villagers looked at each other and fell into absolute silence.</p><br/><p>Benjamin continued, \"I’m just an ordinary mage, and I’ve never had any contact with this devil that you’re talking about. Magic is nothing but a tool - there’s no good or bad to it, humans can either use it to defend against magical beasts or use it to heal patients. As long as you use it with the right intent, magic will never bring you any disaster.\"</p><br/><p>Once he finished, he held his hand out and drew a bunch of runes in the direction of the patients outside.</p><br/><p>\"Elemental Order - Heal.\"</p><br/><p>A light shone and the water elemental energy spontaneously clustered and gathered on the foreheads of the people. It was quickly followed by the sudden patter of raindrops from the sky. As the raindrops hit the faces of the patients, their faces suddenly shone with a wonderful glow.</p><br/><p>An abundant vitality was emitted through the rain, so much so that even the grasses and trees along the road that were had been wilting became vibrant and fresh again after being covered with the raindrops.</p><br/><p>Looking at the amazing site, the villagers held their breath, their eyes overflowing with tears.</p><br/><p>The raindrops fell onto the bodies of the patients, quickly being absorbed into their bodies. The complexion of the patients changed right in front of their eyes at a remarkable speed. The color return to their skin and they started to look healthy again.</p><br/><p>Instantly, the villagers showed signs of excitement.</p><br/><p>\"Really, it’s really possible... Magic could really cure them...\"</p><br/><p>As for the old men who were the most opposed to Benjamin, they too watched the miraculous rain in silence, forced to eat their words</p><br/><p>The rain continued for about two minutes or so. When the rain stopped, the land was not wet at all, all the raindrops had been absorbed completely by the people, plants, or other surfaces. Sunlight shone on the faces of the patients once again, and the patients who were previously in a coma once again started to open their eyes.</p><br/><p>\"Ugh... What happened? It’s so bright...\"</p><br/><p>\"Where’s mum... Where is this? I’m, I’m really hungry...\"</p><br/><p>The patients regained their consciousness one after another. They sat up and looked around with confusion, clueless about what had just happened. Meanwhile, the villagers around them trembled in excitement and became speechless.</p><br/><p>After a temporary shock, they ran hurriedly and embraced their families tightly.</p><br/><p>\"My God... I thought you would never wake up ever again.\"</p><br/><p>\"I’m here! Child, you’re alright now, don’t worry, your illness is gone, you’ll be okay now...\"</p><br/><p>If the space outside of the cathedral just now was described as the mortuary with only low weeping sounds echoing faintly, then now, it was like the train platform for returning soldiers of war; the villages held the faces of their families with tears running down from their smiling mouths, weeping in joy at the miracle they had just witnessed.</p><br/><p>Upon seeing all of this, Benjamin could not help but smile as well.</p><br/><p>Even if he disregarded the deal he made with the Fulner family, he would still feel that this trip was worth it. Even if all he had saved was just a small and remote village…</p><br/><p>He had completely changed the lives of these people, right?</p><br/><p>Since the patients had been cured, the stereotype towards magic also changed. Benjamin turned around and waved his hand lightly; instantly, an ice blade appeared out of thin air to quietly slit the priest's throat inside the bubble.</p><br/><p>The attention of the villagers was still on the patients who had just been cured and they did not notice what he had just done.</p><br/><p>Thus, Benjamin turned around and left, bringing along the corpse of the priest with him before disappearing into the sky.</p><br/><p>It was time to move on to the next village.</p><br/><p>He would settle the corpse on behalf of the others to leave a good impression on the villagers. As for everything that had just happened, the villagers could report it as a regular attack from a mage and the Church would not realize that the belief of the village had already collapsed.</p><br/><p>Furthermore... Even if they knew, the Church would not do anything.</p><br/><p>A war relating to the people’s feelings had begun quietly, and in the span of one short month, Benjamin would slowly turn around and change the stereotype that the Kingdom of Helius had towards mages. Meanwhile, the Church could only try their best to influence the people and strengthen their beliefs.</p><br/><p>This would be an endless tug of war.</p><br/><p>Benjamin could only pick remote villages as his target now, it would be hard for him to come across another perfect timing of a plague outbreak, however, as long as he kept doing good deeds, his influence would slowly spread.</p><br/><p>A month would certainly be insufficient to complete this colossal mission - he decided that they would return after settling the problem regarding the mages in Icor.</p><br/><p>But next time, Benjamin would not be the only one coming.</p><br/>\n</div>"}