{"title": "Chapter 648: The Messengers from the Two Countries", "id": 648, "volume": 7, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-648-the-messengers-from-the-two-countries", "volume_title": "Volume 7", "body": "<h1>Chapter 648: The Messengers from the Two Countries</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 648: The Messengers from the Two Countries</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>As Benjamin rushed to the palace doors, he saw the messengers from the two counties standing there having a war of words. The palace guards stood meekly on the sides looked confused.</p><br/><p>\"Your country is sending people over at such a time? What are they thinking?\"</p><br/><p>\"What are you even saying? His Majesty is the Queen’s own brother. Now that Icor’s in trouble, isn’t it normal to be sending people over out of concern?\"</p><br/><p>\"Sir, you really know how to tell a joke…\"</p><br/><p>Speechless, Benjamin hurriedly walked over to get in between them. When the two messenger saw Benjamin, they could only shut up and turn their heads toward him, both greeting Benjamin with a fawning smile.</p><br/><p>\"Enough.\" Benjamin could not be bothered to exchange bureaucratic platitude with these people, and cut them off with a wave of his hand, \"Let us talk about any issues that you two messengers have after you’ve come in.\"</p><br/><p>Hearing this, they naturally did not object and followed Benjamin into the main hall of the palace.</p><br/><p>The Guild Master was already waiting inside. After a small discussion with Benjamin earlier, he had decided to meet with these messengers from the two countries.</p><br/><p>It was very apparent that the purpose of both countries was the same— They had come for Icor. Right now, there were many rumors circulating, especially those about the death of the Queen. And if the Queen had really died, according to the law, the two people most qualified to ascend to the throne in Icor were the King of Carretas and the Princess of Ferelden.</p><br/><p>As for the matter of the Queen launching a sneak attack on the academy, the whole world knew about it. Without a doubt, the mess that Icor was in now and the Academy of Magic were inextricably tied together, and these two countries had worked together with the academy in the past. Because of this, they had sent messengers out at the same time.</p><br/><p>Perhaps it was to fight for the throne, or maybe it was to find out more about the situation... But in any case, the intervention of the two countries had caused Icor’s situation to become even more complicated than before.</p><br/><p>Since its inception, the Academy of Magic had focused on nurturing magical talent and had intended not to take part in any international disputes. But now, having been attacked, they were not wrong to be involved. But having said that, it would be very bad for the reputation of the academy if Benjamin were to show any sort of bias here.</p><br/><p>Because of that, they decided to see both messengers together at the same time.</p><br/><p>\"I am the Guild Master of the Mage Guild. You have both come from faraway places, may I know what is the matter?\" After shaking the messengers’ hands, the Guild Master stood in the middle of the great hall and thundered.</p><br/><p>Hearing this, the messengers from the two countries gave each other a strange look, seemingly unwilling to speak.</p><br/><p>\"You do not have to worry so much, just say it. The two countries have both sent people here at such a convenient time, I’m afraid that you’ve not come here just to catch up.\"</p><br/><p>After some hesitation, the messenger from Ferelden finally spoke up, \"Of course there is a reason. Only, allow me to first inquire about something. What has really happened in Icor recently? Is Her Majesty the Queen... Still alive?\"</p><br/><p>Upon hearing this, the Guild Master and Benjamin exchanged a quick glance.</p><br/><p>\"Her Majesty... has been bewitched by the Church and ended up attacking the academy. She had fallen sick after the defeat of her army and can’t get up right now. Right now, the governance of Icor is temporarily in my hands.\"</p><br/><p>\"Is that so? How serious is Her Majesty’s illness?\"</p><br/><p>\"It’s difficult to say. Her Majesty might not be able to hold on any longer, but if she can get through the most critical juncture, she will possibly survive.\"</p><br/><p>The Guild Master did not give the whole truth and kept everything ambiguous so that it would be easier to navigate through what might happen next. After all... The future of Icor was still something they had not yet properly discussed.</p><br/><p>At the same time, they could use such these statements to gauge the stances of both visiting countries.</p><br/><p>\"I see.\" The messenger of Ferelden nodded his head thoughtfully, \"If this is the case, then do you have anything in mind for Icor’s future if Her Majesty the Queen were to, unfortunately, pass on?\"</p><br/><p>…...Finally, the main point.</p><br/><p>\"What do you mean?\"</p><br/><p>After thinking for a bit, the messenger did not beat about the bush anymore, and went straight to the point, \"Before his death, the old king of the empire had wanted to pass the throne to the second prince. But, things had happened too suddenly after this, which was why the division happened. If Her Majesty the Queen passes away, Her Highness the Princess of Ferelden should technically enjoy the first claim to the throne. Because of this, we feel that Your Majesty should give this matter a lot of thought.\"</p><br/><p>Even after hearing this, the Guild Master and Benjamin remained silent. The messenger from Carretas, however, was not so patient.</p><br/><p>\"What are you saying? It has been ten years, and there has been no progress in the discussion of who the old king wanted to pass the throne to. And suddenly today you come to a conclusion?\" He spat his words at the messenger from Fereldan as if disgusted with him, \"The progeny of the second prince is of a tender age and is unable to bear such heavy responsibilities. Furthermore, His Majesty the King and Her Majesty the Queen are siblings by blood. In times of danger, he would naturally want to share in the burdens of his own sister.\"</p><br/><p>\"The eldest prince is mediocre in his political achievements. When he was still living, the old king had not looked upon him favorably; besides, Carretas is not being governed too well now anyway. Her Highness the Princess is more worthy of fulfilling expectations.\"</p><br/><p>\"What of Her Highness the Princess? Is her current situation not just a bunch of old fellows controlling the affairs of the state, who intend to use the Royal Bloodline to usurp the throne?\"</p><br/><p>\"Enough! Don’t make such malicious accusations...\"</p><br/><p>Seeing that the two messengers were about to start a fight, Benjamin shook his head helplessly. The water elemental domain spread out, and a wind whipped up by water vapor pulled the two men far apart.</p><br/><p>\"Please hold your horses.\" He spoke slowly saying, \"As the director of the Academy of Magic, perhaps I should not have a say in such matters, but Her Majesty the Queen had sent her army to attack our academy, so I have the right to speak on behalf of the academy.\"</p><br/><p>The two messengers took a deep breath and calmed down, nodding at Benjamin.</p><br/><p>\"That is natural. No one would have any criticism regarding this matter.\"</p><br/><p>Upon getting their approval, Benjamin continued, \"Since that is the case, I feel that there needs to be a long-term plan concerning the issue. Her Majesty the Queen is only seriously ill and has not yet passed away. But since she might also be on the verge of death, we should also respect her personal opinions, should we not?\"</p><br/><p>\"...\"</p><br/><p>\"Messengers, I understand your feelings. But, a matter so serious and great cannot be rushed into resolution today. We would like to ask you to return home first and ask Her Highness the Princess and His Majesty the King to not act hastily. Is that alright?\"</p><br/><p>The meaning behind Benjamin’s words was very obvious; it was impossible that the two messengers could not see it. However, they were unable to object. After all, even the Queen’s battalion was completely overwhelmed at the Academy of Magic. The reputation of the young mage before their eyes had risen to a frightening level.</p><br/><p>Before their respective higher-ups had sent them out, they would probably have reminded them, \"Not to offend Mage Benjamin\" or something along the lines of that. Because of this, they were unable to oppose Benjamin’s decision.</p><br/><p>\"...Since Mage Benjamin has said so, then so it shall be. But, I think we will still pay attention to the wellbeing of Her Majesty the Queen.\"</p><br/><p>Finally, they nodded, somewhat unsatisfied but helpless, and left. Benjamin watched their backs as they walked off, letting out a silent sigh of relief.</p><br/><p>He had at least bought them a bit more time. But now, they should think properly about how to handle Icor.</p><br/><p>\"I will diligently search through the aristocrats in the country and see if there is anyone who has the right to ascend the throne.\" The Guild Master said slowly, \"But, I suggest that you don’t get your hopes up. Even if we do find such a person, if Ferelden and Carretas are adamant, it would still be very difficult for us to get that person on the throne.\"</p><br/><p>Benjamin nodded, \"I understand.\"</p><br/><p>\"So... What do you think?\"</p><br/><p>\"Stabilize the situation in Icor first.\" Benjamin looked grave as he said slowly, \"Whatever it is, neither Ferelden nor Carretas can be considered the enemies of mages. My only worry now is the Church.\"</p><br/>\n</div>"}