{"title": "Chapter 659: An Abrupt Exit", "id": 659, "volume": 7, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-659-an-abrupt-exit", "volume_title": "Volume 7", "body": "<h1>Chapter 659: An Abrupt Exit</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 659: An Abrupt Exit</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>\"Well… I can’t say anything for sure, myself.\"</p><br/><p>Benjamin heard the disappointing response and retorted, \"Then what’s with the high and mighty attitude? You always act like a know-it-all only to shut up when a few more difficult questions come your way.\"</p><br/><p>\"No, you don’t understand.\" The System seemed to be hurt as he replied, \"This state of being means that the amount of data constantly pouring into me is overwhelming, with a huge portion of it, quite frankly, unable to be put into words. The elements and magic are only at the surface of what humans are able to perceive in this world.\"</p><br/><p>\"...\"</p><br/><p>Benjamin was confused but he could clearly tell that The System had put up with him for so long that it had lost interest in providing proper answers.</p><br/><p>Figures.</p><br/><p>As for its interpretation of the elemental plane, Benjamin still had many doubts on the matter. If this world was the source of all magic, then what of the unknown being residing here? Moreover, based on the logic of higher and lower planes of existence, should the unknown being that resided in this world be considered a god?</p><br/><p>As he thought about this, a chill ran down his spine.</p><br/><p>If this was the case, then those \"higher life forms\" could have had been observing him for the longest time. Perhaps he might have angered them in the past as well?</p><br/><p>He recalled back when the fourth-generation pope had first entered the elemental plane, and the will of this place had greeted him with a \"hello\" through the use of the elements. And one time when he had interacted with the runes of the pure blue world, and the runes ended up transmitting a \"leave\" message to him.</p><br/><p>He shuddered and immediately turned to the System to ask, \"But… this world does not seem to welcome me. If I become a nuisance to them, what kind of unfortunate things would they do to me?\"</p><br/><p>\"You’re overthinking it.\" The System replied in a straightforward manner, \"Love, hatred, anger, hostility… these are the array of thoughts that only you humans possess. Your distorted perception that they don’t welcome you is only a shadow of a much bigger message. Do not try to read into their actions with your petty thought process.\"</p><br/><p>\"... So, does that mean that I won’t get obliterated?\"</p><br/><p>The System was briefly at a loss for words before snapping at Benjamin, \"It’s like I’m talking to a wall here.\"</p><br/><p>Benjamin’s lips curled into a smile.</p><br/><p>The abysmal, mysterious elemental plane was truly intriguing, but he was still very much concerned about the reality of the situation. But, since The System had pointed out that the human thought process could not comprehend the workings of this world, he gave up on pressing for further explanations.</p><br/><p>He decided to ask more practical questions instead.</p><br/><p>\"I like to know, what is the proper way to utilize runes?\" He asked after a while, \"Do not give me any more of that stupid gibberish, it’s not like I can comprehend the true state of the runes in this world anyway. I just want to know if there is any way to make use of them through a human beings’ warped interpretation.\"</p><br/><p>\"...There is.\"</p><br/><p>Benjamin suddenly got excited, \"What is it?\"</p><br/><p>\"The significance of the runes to the elemental plane is highly unique. Normally, it can be materialized into having a will of its own, or used as a form of communication while adhering to the rules of the plane…\" The System boasted, \"However when viewing it through human’s narrow thought process, it can still be used as a key.\"</p><br/><p>\"A key?\"</p><br/><p>\"Yes, just like the rune in your space of consciousness, it can assist humans in communicating with the elemental plane, thus temporarily eliminating the restraints of its form. In other words, it would help amplify magic.\"</p><br/><p>\"Is there a more layman way of putting it?\" Benjamin quickly stated, \"Does this mean that any mage out there can simply enter a consciousness space for the purpose of developing runes? Impossible.\"</p><br/><p>\"It all comes down to spiritual energy.\" The System continued, \"In truth, the reason why humans in this world could exhibit spiritual energy at all could be due to the exposure to elemental plane radiation. As such, from a certain standpoint, spiritual energy did not initially come from human potential; in the past, there was no such thing as this spiritual energy mumbo jumbo.\"</p><br/><p>Spiritual energy…</p><br/><p>After hearing so much, Benjamin was still feeling rather troubled.</p><br/><p>So much research on spiritual energy had already been done, yet not a single theory came anywhere close to the System’s explanation. Moreover, to put it in a more practical sense, how could they possibly conjure runes simply by using spiritual energy?</p><br/><p>Spiritual energy was incorporeal, as it could only resonate with the elements or the spiritual energy of others. In some ways, it was the bedrock for the evolution of magic. As such, elemental synergy should be a more important factor than spiritual energy.</p><br/><p>\"A conductor is needed to conjure a rune.\" He first thought to himself, then commented, \"The small research team also cast runes on various materials to trigger their effects. There was no way for spiritual energy alone to act as a conductor.\"</p><br/><p>The System replied nonchalantly, \"Oh, is that so? Well, that’s your problem.\"</p><br/><p>\"...\"</p><br/><p>It’s a shame they’re currently in the elemental plane, otherwise, Benjamin would have sent The System flying in the air with one comically swift kick.</p><br/><p>Damn it…</p><br/><p>He then stopped paying attention to the System. No matter how reliable he seemed to be, Benjamin always ended up disappointed with his answers. He should just cut out the drone of his voice altogether.</p><br/><p>With his attention now back on the surrounding mists of light, Benjamin once more attempted to move around. Previously, he had tried to play it safe by conjuring an Affinity Rune. Now, however, after several rounds of the System’s cynical mockery, he was a bit pent up. He decided to directly cast a Damaging Rune to see what would happen.</p><br/><p>But, just as he was about to do so.</p><br/><p>\"Ah… time’s up.\"</p><br/><p>Soon after hearing The System’s irritating voice, Benjamin heard a low humming sound, as if it was emitted from within his soul. A flash of white enveloped the world, and the view before him changed drastically.</p><br/><p>The vibrant glowing clouds disappeared, and with it went the sensation of freely drifting around well. Everything began to solidify into view. The dazzling sunlight caressed his cheeks, briefly blinding him as he returned to his senses.</p><br/><p>Where had he been sent off to now?</p><br/><p>\"Director Benjamin? Director Benjamin? What… happened to you?\"</p><br/><p>A shrill voice called out to him. He yawned as he recovered his sight. This was a reality in which he was in one of the labs within the Academy of Magic, surrounded by several people. At the time, everyone was staring at him blankly with their mouths gaping wide open.</p><br/><p>Benjamin was still slightly dazed.</p><br/><p>As he gradually returned to normal, he realized that this was the research lab of the rune researchers. The few elder mages he had spoken to earlier were now surrounding him, their faces filled with shock.</p><br/><p>Alright… how did he end up here?</p><br/><p>Before entering the space of consciousness, he was positive that he was lying on his bed. It’s not like he sleepwalked his way here, right?</p><br/><p>\"What’s the matter? Why am I here?\" he waved at the elderly mages and asked, \"Why are you all staring at me? What...what did I do?\"</p><br/><p>After that, he looked at his legs.</p><br/><p>Hold on…</p><br/><p>He saw that his body was different from before. His legs were covered in various runes arranged in all sorts of patterns. The blood of a magical beast trickled from the table down into a groove below, possibly signs of a new rune casting technique.</p><br/><p>At the same, Benjamin overheard the softest of whispers.</p><br/><p>\"...Why have you summoned Director Benjamin?\"</p><br/>\n</div>"}