{"title": "Chapter 655: A Belated Letter Home", "id": 655, "volume": 7, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-655-a-belated-letter-home", "volume_title": "Volume 7", "body": "<h1>Chapter 655: A Belated Letter Home</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 655: A Belated Letter Home</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Benjamin was a little surprised.</p><br/><p>\"You... did you remove the curse?\"</p><br/><p>He looked at Miles who was in high spirit. He was not as depressed as when he was in the Kingdom of Helius. Hence, Benjamin asked subconsciously.</p><br/><p>Miles heard it, humphed, and shook his head, \"Don’t mention it.\"</p><br/><p>…Okay then.</p><br/><p>Benjamin had no choice but to swallow his doubts and change the course of the conversation, \"What did you come here suddenly for? Did you get a mission to assassinate the member of the parliament?\"</p><br/><p>\"No... I got a message from the Kingdom of Helius, you should be interested in it.\" Miles rolled over, jumped onto the balcony and said, \"The Church has just ended a civil war, some of the nobles family’s properties are being confiscated, and many priests died during the process. Now, the people in the Kingdom of Helius are at great risk.\"</p><br/><p>Hearing that, Benjamin raised his eyebrow in surprise.</p><br/><p>He did not expect Miles to get the information that he wanted when his information personnel had just entered the Kingdom of Helius. Should he ask Miles to train the dark operation of the academy?</p><br/><p>\"How much do you know? Tell me.\"</p><br/><p>Miles replied, \"For the time being, the Church was divided into two groups. The group with Grant as their leader is spreading news saying that the Pope is dead, whereas the group with the bishop of St. Peter's Cathedral as their leader is trying to hide this news for his own sake, and this has enraged God. Therefore, they killed that bishop and elected Grant as the new pope.\"</p><br/><p>Crap... so soon?</p><br/><p>Benjamin could not help but take a cold breath.</p><br/><p>He knew there was a power struggle within the church, and he knew that Grant might be elected. However, he never expected that Grant's would move that quickly.</p><br/><p>After all, that bastard was a year younger than Benjamin!</p><br/><p>If it was in a few years’ time, with Grant’s status, he would have the automatic rights to the Pope's position. Therefore, from Benjamin’s point of view, the civil strife was certainly not just for the position of the pope. However... there were definitely some contradictions that others did not know about.</p><br/><p>Benjamin could not help but to shake his head at this thought.</p><br/><p>He still remembered how Grant used to look like. It was hard to imagine, the naïve boy who was passionate about simulated war games would kill his teacher without any hesitation, and cause a reign of terror in the church.</p><br/><p>\"...Has he succeeded?\" Benjamin came back to his senses and asked.</p><br/><p>Miles nodded.</p><br/><p>\"After about half a month of civil strife, most of the forces of the Church are already under his control. He was originally the sole candidate for the next Pope, and now that the news about the death of the pope is being leaked. No matter how reluctant the other bishops are, they will have no choice but to support his coronation ceremony.\"</p><br/><p>\"So... Is he now the Pope?\"</p><br/><p>\"No. I do not know the details, but they probably need some time to prepare. According to some news that I overheard, the coronation ceremony will be held next month.\"</p><br/><p>The coronation ceremony would be held next month...</p><br/><p>Benjamin could not help but take a deep breath, a weird feeling welled up in his heart.</p><br/><p>Could this be... fate?</p><br/><p>He actually did not believe in it. The legend that happened thousands and millions of years ago would be repeated... It was as if God had arranged everything. Moreover, becoming \"God’s chosen one\" sounded a little narcissistic, as if it was a plot that appeared in the twentieth-century television dramas.</p><br/><p>However, as it progressed and developed into this stage, the wheels had fallen into a fixed position. Benjamin had to admit that all of this was way too similar.</p><br/><p>Grant would soon become the new Pope, and he was standing at the peak of the mages. Everything played out just like the legend, both of them would be opposing each other in terms of divine arts and magic. Only this time, Benjamin was determined to put an end to this opposition.</p><br/><p>Would history repeat itself?</p><br/><p>Benjamin felt something heavy weighing on him, it was as if it everything had somehow been premeditated, and they were just chess pieces on the board.</p><br/><p>However... no matter what, the situation they were in was different from the legends of Cain and Abel. The legends had it that the brothers were related both in terms of their blood and soul. But now, from a spiritual point of view, Grant was not Benjamin's younger brother.</p><br/><p>His stay in the Lithur family and with Grant was brief, so he did not get to develop a close relationship with him. Therefore, even if it came to the point where they need to harm each other, it would not be that hard for him.</p><br/><p>\"...Can you deliver a letter for me?\" Benjamin said suddenly.</p><br/><p>\"What letter?\"</p><br/><p>\"It can be considered a…. letter home?\" Benjamin shrugged and said, \"Now that Grant is going to be the Pope, perhaps, it might be a good thing.\"</p><br/><p>Although the Church and mages were enemies for generations, there was still a relationship between Grant and him. If he were to write a letter and try to get in touch, maybe this could be a turn for the better.</p><br/><p>It was definitely hard to reconcile, but... it was at least worth a try.</p><br/><p>\"You want me to deliver this letter to the cathedral?\" Miles had an unexpected look.</p><br/><p>Benjamin nodded and asked, \"It is just delivering a letter, is that really that hard? You can get in and out easily, even Grant cannot keep you there.\"</p><br/><p>\"That is because they are not prepared,\" Miles immediately shook his head and refused, \"Although I am unsure about it, they should have some anti-spy magic tool. You want this letter to be sent to the hands of Grant, right? However, as long as I sneak in, surely most of the priests will be alerted, and the letter will be completely exposed.\"</p><br/><p>Benjamin thought for a moment and said, \"Then deliver it to the Lithur family, they will probably pass the letter to Grant.\"</p><br/><p>\"This…\"</p><br/><p>\"I will not let you work for nothing, I will pay you.\"</p><br/><p>\"Okay then.\"</p><br/><p>With that, their brief conversation ended. Benjamin was about to get back and continue his meeting. Miles had already jumped out of the balcony and quickly disappeared into the darkness.</p><br/><p>As the meeting of the Judgement Parliament continued, the Guild Master was speaking relentlessly, whereas Benjamin lowered his head, took out a piece of paper and pen and started thinking about what he should write. This letter might completely change the situation of several countries, he naturally must consider it carefully before writing.</p><br/><p>In fact, when he started writing, he found out that he basically knew nothing about Grant.</p><br/><p>Why did Grant cause a civil strife at this moment? How did he think of mages? Was his faith strong? To what extent did his strength growth?</p><br/><p>Benjamin felt like he was writing to a stranger.</p><br/><p>The feeling of not knowing how to start made him hesitate. However, for the future of the mages, he had to do it. He wrote some good words in the letter, then he wrote his views on divine arts and magic.</p><br/><p>Magic and Divine Arts, it was originally the same thing.</p><br/><p>In the end, he asked about the Lithur family, sent some friendly hints and ended the letter. He did not expect such a short letter to ignite Grant's brotherhood. However, at the very least, it would make him understand that they did not necessarily have to be enemies.</p><br/><p>After the meeting, the mages had left the villa located in Carretas which was exclusive to the parliament. Benjamin had also handed the letter to Miles, and then returned to the academy with his mages. The new semester’s opening ceremony was about to begin, so he had to get back and prepare for it.</p><br/><p>However, during his preparation, he went to the potion department to help Miles ask about a way to cure him. Miles might not accept his help, but... no one cared.</p><br/><p>\"Elder, have you heard of the abyss trial?\"</p><br/>\n</div>"}