{"title": "Chapter 652: The Queen's Ending", "id": 652, "volume": 7, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-652-the-queens-ending", "volume_title": "Volume 7", "body": "<h1>Chapter 652: The Queen's Ending</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 652: The Queen's Ending</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Benjamin waited until the people from both countries to completely leave the palace before stepping out from the back door of the hall.</p><br/><p>\"Do you think they will accept it?\" The Guild Master turned around and asked Benjamin.</p><br/><p>\"They will,\" Benjamin shrugged and said, \"In case one of them do not accept it, we will put the other party in charge of it. Under such circumstances, they will have no choice but to accept.\"</p><br/><p>Being able to work out such a proposal, they must have already planned it a long time ago. Icor's sovereignty was still in their hands, therefore, they had the power to allow others to accept their proposal unconditionally.</p><br/><p>This proposal seemed to be the only solution to the current dilemma.</p><br/><p>The key to getting more power and benefit from the change of throne in Icor was the need to achieve a balance. Based on the situation they were in, it can be considered that they were being sandwiched between Ferelden and Carretas. Hence, the more evenly the forces were distributed among both parties, the more important they were.</p><br/><p>Therefore, Benjamin suggested this proposal.</p><br/><p>Although it looked as though they had passed the sovereignty of Icor to someone else, the mages, in fact, got the opportunity to enter Icor. Since the forces between Ferelden and Carretas were equal, therefore, the Judgement Parliament would become the most valued organization of the country.</p><br/><p>Whenever the votes of both parties were equal, their votes would become very crucial.</p><br/><p>\"Taking turns to rule, Mages supervising... I really do not know how you come up with these ideas,\" The Guild Master suddenly sighed and said, \"Usually, even the peasants in the country would think this is unbelievable. But now…. they look forward to the rebuilding of the Empire. However, you took advantage of this hope and gave this system a foundation with the support of the people’s will. \"</p><br/><p>Benjamin heard this, smiled and remained quiet.</p><br/><p>He only took reference from the idea of the modern political system of separation of powers.</p><br/><p>For the people of this generation, overly trendy political systems were generally hard to be accepted. If he went to the streets and grabbed a passerby, telling that person that the person should be the ruler of the country, that person would just think he was a madman, and would not have the slightest interest in being the rulers of the country.</p><br/><p>Fortunately, the special circumstances of Icor gave Benjamin a great help. The split only happened not too long ago, the people still missed their old empire. This yearning counteracted the impact brought into the world by implementing a \"non-sovereign\" system which had never been used before.</p><br/><p>This could be considered as a localization experiment.</p><br/><p>\"The treaty of the alliance has been drafted, but... the detailed rules and regulation of the council, it is something unheard of. Probably only you can do it,\" The Guild Master said again.</p><br/><p>Benjamin recovered from his thoughts and nodded.</p><br/><p>\"Rest assured, I will consider it carefully, draft it and then negotiate with you.\"</p><br/><p>Having the law written in black and white was the most crucial point in this kind of supervisory mechanism. They could not leave behind that many loopholes, otherwise, the balance will be broken if the two countries were to take advantage of it, and then the proposal about taking turns to rule will become a joke.</p><br/><p>Of course, Benjamin would not show himself during the process of achieving this. The relationship between the academy and the two countries was starting to worsen. On that basis, the Guild Master would need to be the bad guy.</p><br/><p>The Guild Master had no complaints about taking on this responsibility.</p><br/><p>After all, Benjamin had made his own concessions.</p><br/><p>\"The Queen… Do you really want to keep her alive?\" He thought and suddenly asked.</p><br/><p>\"What's the matter? You have already ruined her face and voice. Even if she had the chance to meet someone, no one would believe that she was the Queen from before,\" The Guild Master sighed and said.</p><br/><p>Benjamin shook his head, \"I just do not understand what is the point in her staying alive.\"</p><br/><p>The Guild Master heard this, took a deep breath, but did not speak.</p><br/><p>After seeing that, Benjamin stopped asking questions, turned around and left the hall. The Guild Master looked as he left, stayed in the hall for a while, shook his head and left through the back door.</p><br/><p>Through the long corridors, the Guild Master activated a few secret traps and entered the dark basement of the palace. He stood in front of the basement with a complicated expression while looking at the figure being trapped behind layers of iron railings.</p><br/><p>\"…You came.\"</p><br/><p>The figure said with a scarily hoarse voice that people could barely even be able to tell the gender of the speaker.</p><br/><p>She was the Queen of Icor.</p><br/><p>She leaned against the wall desperately, her face was filled with scars and scabies, and she looked extremely different from how she used to look like. Her dirty hair was hanging on both sides of her cheeks, looking no different from the hay found on the ground.</p><br/><p>Based on her tattered clothes and the nervousness in her eyes, he could tell that she was being imprisoned here for quite some time.</p><br/><p>\"Your Highness, I will come see you from time to time,\" The Guild Master remained silent for a moment before saying. \"In a few days, we will send you to another prison, and the conditions there should be slightly better.\"</p><br/><p>After hearing that, the Queen's shoulders moved slightly and she suddenly laughed horrifyingly.</p><br/><p>\"Why not just kill me? You want to leave me here and continue humiliating me?\"</p><br/><p>The Guild Master closed his eyes as he could not bear it.</p><br/><p>The Queen saw this and the humiliated look on her face changed into an ironic look.</p><br/><p>She said with a monstrous voice, \"Merciful... You have always been so merciful. Come over and take a closer look at my face, listen to my voice, and feel just how merciful you are.\"</p><br/><p>\"Princess,\" The Guild Master opened his eyes and said, \"You have sinned greatly, being able to stay alive was already very fortunate.\"</p><br/><p>The Queen seemed to be triggered by something and roared hysterically, \"Do not call me princess! I... I am the Queen of Icor!\"</p><br/><p>The Guild Master remained silent.</p><br/><p>After roaring for a moment, she did not get any response, so the Queen eventually collapsed on the side of the wall again. She breathed heavily and look at the Guild Master outside of the iron railing with an indifferent look.</p><br/><p>\"... Do you still live in the old empire?\" There was a sarcastic look in her eyes again, \"The old empire, when my father was still alive, he invited you to the private royal dinner. I would smile like how my mother taught me and constantly exclaimed \"wow\" at your magic tricks... is that what you want?\"</p><br/><p>The Guild Master heard this, sighed and said, \"I just do not understand why you became like this.\"</p><br/><p>The Queen made laughed dryly and said, \"No, you are wrong. I have not changed, you just never really understood me. Of course... maybe you are not interested in understanding, who cares about what a princess is thinking? You, and father, all of you just want to see the gentle, harmless facade that I put on.\"</p><br/><p>The Guild Master remained silent for a long time and shook his head.</p><br/><p>The dark basement had a depressing atmosphere. The Queen stared at the Guild Master with her terrifying face, after staring for a long time, she suddenly said, \"Let me go.\"</p><br/><p>\"Impossible.\"</p><br/><p>The Queen suddenly rushed towards the railing and asked, \"Why is it impossible? I am posing no threat to you.\"</p><br/><p>The Guild Master took a deep breath before looking at the Queen suddenly and said: \"Your Majesty, the one who is living in the past is you, is it not? You need to pay the price for making the wrong choice, and you... are no longer the spoiled princess that can do whatever she wants. \"</p><br/><p>Upon hearing that, the Queen started shaking and held her gripped onto the iron railings forcefully. Then, she remained silent.</p><br/><p>The president saw this, shook his head in disappointment, turned around and left.</p><br/>\n</div>"}