{"title": "Chapter 650: A Poor Choice", "id": 650, "volume": 7, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-650-a-poor-choice", "volume_title": "Volume 7", "body": "<h1>Chapter 650: A Poor Choice</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 650: A Poor Choice</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>\"Who wishes to see me?\" Benjamin asked immediately.</p><br/><p>\"This… I am also not clear, but he seems to be someone very important, and he has a lot of people protecting him. He asked for you by name,\" The servant hesitated for a moment before answering, \"They are now in the dining hall. If you are willing to, please go and meet them.\"</p><br/><p>Benjamin was quite helpless, but he still nodded.</p><br/><p>\"Alright. I will go see them.\"</p><br/><p>Although he wasn’t clear who they were, after listening to the servant’s description of them, he had some idea in his heart.</p><br/><p>It could not really be him…</p><br/><p>With mixed feelings in his heart, Benjamin passed through the corridors of the palace and came to the dining hall. The dining hall, usually quiet, was however now packed with people. The one standing by the window turned around and laughed at Benjamin.</p><br/><p>It was the king of Carretas.</p><br/><p>\"Mage Benjamin, it’s been a long while since we’ve met,\" He walked over and patted Benjamin’s shoulder, saying this.</p><br/><p>\"It’s been a long time.\"</p><br/><p>Benjamin nodded with a smile.</p><br/><p>Who else could it have been? The news of him being in Regina had not been publicized; there were not many people who knew that he was here, and only the two messengers he had sent back a few days ago understood the situation.</p><br/><p>In addition to that, Icor was in such a mess right now. The king suddenly paying a visit was something he had expected very much.</p><br/><p>Without question, he was here for the inheritance of the throne.</p><br/><p>\"In a few months’ time, you have, yet again, changed the situation of a country. It’s really… Unsurprising,\" The kind gave Benjamin a few looks, and kept quiet for a moment, before saying, \"We’ve all heard about Scarlett attacking the academy. I want to know how she is now. Is she alive or dead? For the sake of our past relations, don’t use what you’ve told the messenger on me.\"</p><br/><p>Hearing that, Benjamin let out a sigh.</p><br/><p>He had been afraid something like this might happen…</p><br/><p>In Carretas, although he could be said to have done deals with the King and helped him chase out the Church, they had still formed a sort of bond. And now, the King had come over to beg him concerning the matter with Icor. This placed him in a rather awkward situation.</p><br/><p>However, in the end, he still chose to stand on the same lines as the Guild Master.</p><br/><p>\"...The Queen is seriously ill. No one knows if she will be able to make it.\"</p><br/><p>The King had a momentary look of disappointment on his face.</p><br/><p>\"You do not trust me.\"</p><br/><p>Benjamin put up his hands helplessly, \"It’s not that I don’t trust you. It’s that... regarding this issue, I’m not any sort of a leader. The Guild Master of the Mages Guild is the one governing Icor now. I am only an outsider who is temporarily staying here.\"</p><br/><p>\"So… What do you think about my chances of receiving Icor and merging the two countries?\" The King asked.</p><br/><p>Benjamin shrugged, expressing that he did not know anything.</p><br/><p>In reality, however, the true answer in his heart was really zero.</p><br/><p>Helping Carretas to take over and govern Icor might be able to help him take a step further in solidifying the friendly relations between him and Carretas, but… Their relations were good enough. As an independent, international Mages Organization, it was not a good thing to be too close to any country.</p><br/><p>Furthermore, judging by the King’s ability, Benjamin would definitely be unable to be so relaxed handing over this land, which shared the same border as the Kingdom of Helius, for governance.</p><br/><p>Seeing that, the King shook his head and suddenly waved his hands at the bodyguards around him, signaling them to leave. The bodyguards hesitated for a moment, as though they were somewhat worried, but they nevertheless walked out of the doors of the dining hall after the King’s repeated urging.</p><br/><p>Finally, there were only him and Benjamin in the dining hall.</p><br/><p>\"You should understand the importance of this matter to me, yes?\" The King sighed, saying, \"People say that Ferelden is under the personal ruling of the Princess, but, in reality? That old fellow Stuart has long dominated the entire country. I cannot allow Icor to fall into his hands as well.\"</p><br/><p>Benjamin answered back, \"The jurisdiction of Icor will definitely not fall into his hands.\"</p><br/><p>General Stuart’s wild ambitions were not little; if he were to take over and rule Icor, his influence and power would increase, and his next step would definitely be to swallow up Carretas. For an organization such as the Academy of Magic, having checks and balances on the power and influences of all parties was better to ensure their continued existence.</p><br/><p>Because of that, he did not have a reason to give Ferelden the advantage.</p><br/><p>\"So… Is Scarlett imprisoned by you guys now?\" After some hesitation, the King asked.</p><br/><p>Benjamin was helpless, and in the end, nodded to respond to the question.</p><br/><p>\"What do you intend to do?\" The King looked extremely nervous, \"The people want Royal blood. It is impossible for you to find a person randomly to be King. And Scarlett is not a person who will be content as a puppet.\"</p><br/><p>Benjamin did not say anything, and finally, shook his head in silence.</p><br/><p>This was probably the problem for Icor.</p><br/><p>It was impossible for their group of mages to rule Icor; even if it was an indirect governance, it would still be an extremely difficult task. It required a lot of time and effort to rule a country, and mages needed a lot of time to do research on magic and meditate. At the same time, it would be difficult for a governance by mages to receive the support of the people.\"</p><br/><p>The best idea to put into practice was the modus the Church ruled the Kingdom of Helius with, but the problem was that they did not have a suitable candidate for a puppet. Even if they could find one… He was afraid that their relations with Ferelden and Carretas would worsen.</p><br/><p>The King traveling thousands of miles to come here had proven his desire for Icor, and it was definitely the same on Ferelden’s side.</p><br/><p>There was no such thing as being friends forever. Forget about them being able to speak man-to-man now in such a trustworthy position; once the situation changed, the steps they would take remained an unknown.</p><br/><p>In the end, after this secret visit, the King brought his bodyguards and left the palace quietly. The expression he had on as he left was one of disappointment. Perhaps he had only just realized that, from the moment the Church had been chased out from Carretas, Benjamin and the King were destined not to be able to fight without bad blood, shoulder-to-shoulder anymore.</p><br/><p>Their stances determined everything.</p><br/><p>Benjamin also arrived at the great hall of the palace, and met with the Guild Master, who shared the same stand as he did.</p><br/><p>\"...Even with the eldest prince’s indolent personality, he was willing to personally rush to the palace. He must really trust you.\" The Guild Master said, lifting his head up from the documents.</p><br/><p>Benjamin smiled, not replying to this, but turned and said, \"What is the situation like now?\"</p><br/><p>\"Icor has stabilized for now, and I have tightened the security around the borders of the country. Once the Church has any sort of movement, we will find out immediately.\" The Guild Master answered, \"It’s just that… The rumors in the country have become more and more serious.\"</p><br/><p>\"What rumors?\"</p><br/><p>The Guild Master shook his head, saying, \"What else can it be? It is about the mages usurping the throne, conspiracies of the academy, some saying that the Queen is dead and so on… If the Queen doesn’t show herself soon, I’m afraid there will be riots in various places soon.\"</p><br/><p>Benjamin furrowed his eyebrows, \"We cannot let the Queen return to the position of a ruler, even as a puppet. She will surely think of a way to have her revenge on us.\"</p><br/><p>\"Yes…\" The Guild Master sighed, and said, \"However, since the eldest prince trusts you so much, under your influence, he might be able to give the mages a much freer environment.\"</p><br/><p>\"Do you mean, to let Icor merge with Carretas?\"</p><br/><p>The Guild Master nodded.</p><br/><p>\"When the empire was divided, I was inextricably part of it. If I had not chosen to support the Queen, everything to date might not have happened. The empire would still be the empire, and Ferelden, Icor, Carretas… These countries would never have existed in the first place.\"</p><br/><p>Hearing that, Benjamin shook his head helplessly.</p><br/><p>The Guild Master’s bias was too strong. Before this, his act of emancipating the Mage Guild was to right his first wrong. And now, he seemed to have the same feelings.</p><br/><p>\"This has nothing to do with you, you do not need to atone for it,\" Benjamin immediately advised, \"The wood has become a boat. No matter what you do, the empire no longer exists. What is more important would be the enemies that we will have to face in the future.\"</p><br/><p>The Guild Master was quiet for a moment, and said, \"But other than this, we have no other choice. The Queen has no heir and no other living relatives. Icor is either handed over to Ferelden, or given to Carretas. That, or, we pass it back to Her Majesty the Queen. What else can we do?\"</p><br/><p>Hearing that, Benjamin lowered his head, deep in thought. After a moment, he suddenly raised his head, \"...We can do it this way.\"</p><br/>\n</div>"}