{"title": "Chapter 668: Flee", "id": 668, "volume": 7, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-668-flee", "volume_title": "Volume 7", "body": "<h1>Chapter 668: Flee</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 668: Flee</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>A wave of magic oscillation silently spread outward.</p><br/><p>Originally the people beneath were scattering about, trying to dodge the splattered holy light from the barrier. The entire Havenwright had become chaotic and violent.</p><br/><p>But... Once Grant made his move, something miraculous happened.</p><br/><p>It was as if time flowed backward; the downpouring holy light froze in the air for a few seconds before it retracted back along its original trail, eventually merging back with the holy light the barrier once again.</p><br/><p>The priests that stood beside him all let out sighs of relief.</p><br/><p>\"... As expected from His Highness.\"</p><br/><p>In the blink of an eye, all the holy light that had been spilled rejoined the barrier. As for the spot where the fist and the barrier had soon collided, its gleaming light has soon dimmed before completely subsiding.</p><br/><p>The hanging waterfall had also disappeared, revealing a partially demolished city wall as well as the layer of golden barrier that Grant had just repaired.</p><br/><p>\"What happened?\"</p><br/><p>No longer dazzled by the bright lights, the people all turned to look.</p><br/><p>However, although the barrier was still intact, it now stood completely still and seemingly isolated. The mage that had brought six bubbles with him had disappeared without a trace.</p><br/><p>Seeing this, the priests became outraged.</p><br/><p>\"That devil... That mage escaped.\"</p><br/><p>They were clear about the origins of the golden barrier — It had already existed long before the Kingdom of Helius was established and had a mysterious past. Legend has it that it was a treasure left behind by the gods. Each launch would require an unknown number of light elemental crystals to power it up. Every pope that was elected would also strengthen the barrier with their own individual powers.</p><br/><p>It was like a guardian to Havenwright. Normally, no one could sense its existence, but in reality, it was the biggest trump card that Havenwright had.</p><br/><p>And today, although the barrier was not shattered, it also did not manage to halt the enemy’s progress. The enemy did not even take his time in chanting or have an overly complicated summoning process. It was merely a punch that had torn a hole in this supposedly indestructible barrier.</p><br/><p>\"... Why did he come here?\"</p><br/><p>Grant turned and looked at the priests behind him.</p><br/><p>\"Your Highness, he invaded the prison over ten minutes ago and kidnapped a few of the Lithur household servants that were locked up there.\" One of the priests hesitated for a moment before responding, \"I’m guessing that he may not content with the punishment on Claude Lithur.\"</p><br/><p>Grant’s face changed slightly.</p><br/><p>\"How many servants were hijacked?\"</p><br/><p>The priest shook his head, \"I am not too sure. Probably around six or seven. Your Highness, do we need to go after him? We can alert the guards along our border to keep an eye on the Crusader Gateway.\"</p><br/><p>Grant took a deep breath and held his tongue for a long time before finally responding, \"... There is no point. We can’t stop him.\"</p><br/><p>The priests couldn’t help but lower their heads. The atmosphere was tense and no one dared to speak up.</p><br/><p>At the same time.</p><br/><p>About thirty kilometers away from Havenwright, Benjamin was still darting away, pulling along the six bubbles containing people. He looked back cautiously from time to time.</p><br/><p>\"Are they on our tails?\"</p><br/><p>\"Nope.\" The System replied listlessly, \"You might have given them a real scare with that punch. It’s not like they know that you are powerless once the ten minutes is up.\"</p><br/><p>Benjamin let out a sigh of relief.</p><br/><p>It was good that he could make his getaway.</p><br/><p>Honestly speaking, he wasn’t that confident about causing a scene at the Church’s base. The Church was deeply-rooted and no one knew just how many trump cards they held. The sudden emergence of the golden barrier had given him a fright. If it wasn’t for his quick wits, things may have taken a turn for the worst.</p><br/><p>However... this incident was quite the adrenaline rush.</p><br/><p>Benjamin realized that having this thought was looking for trouble, so he quickly shook his head in an attempt to disperse it. He then slowly decreased his speed and flew at a lower altitude.</p><br/><p>Observing the surroundings around him, he finally descended on a hilly area along with the six servants. The area seemed to be uninhabited.</p><br/><p>Benjamin was a little worried about transporting through the air over such a long distance. After all, time was tight at the prison and he didn't manage to complete the cast of the Elemental Order - Heal. The six of them were not completely conscious yet. Now that he finally had some space, he had them all lie flat on the ground.</p><br/><p>Thankfully... Although they were unconscious, they were still breathing.</p><br/><p>Benjamin drew a rune and summoned the water elements to condense into healing water drops.</p><br/><p>\"Oh right, when we escaped from the city, did you notice the magic oscillation?\" While he was treating the rescued servants, he suddenly recalled something and turned to ask the System.</p><br/><p>\"Of course I did.\" The System responded, \"Truth be told, it wasn’t a few seconds after you penetrated the barrier that the magic oscillation patched it back up. You almost did not make it.\"</p><br/><p>Hearing this, Benjamin grew solemn.</p><br/><p>The origin of the oscillation... should be Grant, right?</p><br/><p>Without a question, this was a powerful show of strength. More importantly, he was completely unfamiliar with the energy source. The way Grant had cast was not the same as the priests. The way he controlled the light elements did not require any preparation beforehand. As long as he was willing, he could amass a disgusting amount of holy lights.</p><br/><p>Just what kind of casting method was that?</p><br/><p>Benjamin had uncovered rune magic not too long ago and felt like he opened up a whole new world. However, Grant’s show of strength challenged his knowledge of the magical attributes.</p><br/><p>That oscillation and of runes were similar yet... different.</p><br/><p>\"Analyze the magic oscillation from back then. I want to know how he controlled those elements.\" Hence, Benjamin spoke in his heart.</p><br/><p>\"... Oh.\"</p><br/><p>The System unwillingly responded and continued running his errands. Benjamin returned his attention back to reality.</p><br/><p>Blood returned to the six servants faces under the treatment of the runes. Of these people, three of them were from the kitchen. Benjamin didn’t have much contact with them back at the Lithur Manor. The other two were Claude’s attendants, hence he also wasn’t close to him. But then, he caught sight of Jeremy.</p><br/><p>— The only servant that belonged to him in the Lithur Manor.</p><br/><p>Benjamin took a deep breath.</p><br/><p>He didn't think that Jeremy had remained with the Lithur household after Benjamin had fled from the Kingdom; he was exceptionally lucky that he wasn’t implicated due to Benjamin.</p><br/><p>Perhaps there were really people that were simply luckier than others.</p><br/><p>The remaining others had all died; if Benjamin hadn't rushed to the prison at that specific time, Jeremy would have died in the dark prison cell as well, along with the secret. Therefore, although he hadn't seen this servant for a long time, Benjamin felt relieved.</p><br/><p>\"Have you awakened?\"</p><br/><p>About a few minutes later, Benjamin spoke as he watched a few of them slowly opening their eyes.</p><br/>\n</div>"}