{"title": "Chapter 678: Carretas’s Opposition", "id": 678, "volume": 7, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-678-carretas%E2%80%99s-opposition", "volume_title": "Volume 7", "body": "<h1>Chapter 678: Carretas’s Opposition</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 678: Carretas’s Opposition</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>\"Another branch? Did you think about this thoroughly?\"</p><br/><p>In Icor city, the guild master had a shocked expression after listening to what Benjamin had to say.</p><br/><p>Benjamin nodded.</p><br/><p>This was the day the judicial parliament had a meeting about the monitoring. However, he had taken this opportunity to tell the guild master about the news of the new campus branch.</p><br/><p>If he wanted to establish a branch in every country, he would definitely need a considerable amount of support from the government, or there was no way it would happen. Currently, Icor’s government was practicing a political system where two countries would take turns to rule the country. However, in this case, since the guild master was an elder in the judicial parliament, he would naturally be given the right to speak.</p><br/><p>\"It is a good thing to build another campus, but... I’m afraid that the two countries will feel that you are being too ambitious and that you are merely taking this opportunity to increase your influence in the various countries.\" The guild mater thought for a moment and said.</p><br/><p>\"I understand your concern since you are the first country I am discussing this with.\"</p><br/><p>Benjamin understood that this matter could be sensitive. The magic academy did not belong to any party, and to a certain extent, could even be considered an independent country. For them to want to set up a new campus in another area did indeed seem odd to the people in the government.</p><br/><p>However, with the relationship between him and the current leaders of both countries, it should not be too difficult.</p><br/><p>\"How about this, I will contact the two of them for you, things will be simpler if I were to say it.\" The guild master said, \"You better be prepared, you will need to deal with the mages trained by the branch campus - they will certainly go overboard with their requests.\"</p><br/><p>Benjamin smiled when he heard this, \"Of course.\"</p><br/><p>By then, they were already starting to recruit teachers for the new campus, whom they had hired through recommendations from their acquaintances. Meanwhile, the public had not yet heard the news that they wanted to set up a new branch. He would wait until both countries understood what they were doing before he would start to advertise openly.</p><br/><p>Therefore, about a week later, Benjamin met with the leaders of Ferelden and Carretas to have a meeting about the issue.</p><br/><p>\"Of course, we do not have any objections about you wanting to set up a new campus in our country, but... what country will the mages trained in the academy belong to?\" General Stuart said after listening to the initial proposal.</p><br/><p>\"Naturally, they will belong to their native countries.\" Benjamin immediately replied, \"In fact, we will not be assigning these mages anywhere. The management of the branches will not be as strict as it is on the main campus. After graduation, they can continue to serve in their own country. \"</p><br/><p>\"But in my opinion, your way of education will dilute the mages’ idea of their nationality.\" The general said, \"May we ask you to include some patriotic courses in your program and make it a compulsory subject that they need to pass?\"</p><br/><p>\"...\"</p><br/><p>Benjamin was at a loss for words.</p><br/><p>Well… He did not expect the ideology of education to become a matter of dispute in this meeting.</p><br/><p>In the end, he had no choice but to nod. There was no other way, the main campus was Benjamin’s own territory and he could teach what he wanted. But elsewhere, they were merely borrowing the land, and as such, they still had to follow their rules.</p><br/><p>\"Since you agree, then we naturally do not have any problems!\" The general laughed loudly and said, \"I will be expecting your campus to nurture more talented mages for us.\"</p><br/><p>Benjamin nodded helplessly.</p><br/><p>Then he diverted his attention to the King.</p><br/><p>He did not know why, but throughout his negotiations with the general, the King had remained silent. This caused Benjamin to feel a little uneasy.</p><br/><p>\"Your Majesty, what do you think...\"</p><br/><p>The King took a deep breath and finally spoke.</p><br/><p>\"Of course, Mage Benjamin, I will not oppose your plans. But... If I were to agree to your plans again, then I will face immense pressure from the other officials. It might be hard for Carretas to approve to this.\"</p><br/><p>Benjamin was a little surprised.</p><br/><p>He did not expect the king to be the one to oppose it.</p><br/><p>\"Your Majesty, setting up a new campus will definitely be beneficial to Carretas.\" He immediately crooned, \"After experiencing the church’s baptism, the mages in Carretas are living in confusion. The new campus will nurture more mages of substance and it certainly brings far more good than harm.\"</p><br/><p>\"I understand, but...\" The king hesitated for a moment and said, \"You should know, in order to fulfill the deal that we originally had, I had given the entire piece of land, which is now used for the academy, to you. In order to do that, I had ignored all the officials’ cries of protest. Therefore, most of the ministers now do not really like you, so whatever you do will only seem like a conspiracy to them.</p><br/><p>Benjamin heard this and could not help but frown.</p><br/><p>So troublesome...</p><br/><p>He thought that building branches for the academy would make everyone happy, and he did not expect anyone to oppose it. Who would have thought that the officers of Carretas had such bad impression of him?</p><br/><p>He vaguely remembered how friendly and grateful they were when he had helped the King reclaim Carretas.</p><br/><p>After thinking about it for a moment, Benjamin said, \"How about this, I will go to Gealorre personally. Treat me as a messenger from the Magic Academy and introduce me to the officers. No matter how fervently they oppose to it, I will be sure convince them.\"</p><br/><p>The King was a little surprised.</p><br/><p>Benjamin then brought the meeting to an end, \"That's it. Your majesty can go back first, and in a few days, the academy will send a messenger to Gealorre to start discussions about the academy branch.\"</p><br/><p>\"Okay then...\" The King rubbed his forehead helplessly.</p><br/><p>Although he was somewhat caught off guard, the meeting still went likehow Benjamin had expected, ultimately ending in less than an hour. He sent Varys to Ferelden to settle the issue about the \"ideological education\" of the new campus and then prepared himself before setting off for Gloria.</p><br/><p>\"That... maybe I was being suspicious, but the King seems to be a little different from before.\" Suddenly, the System said in his mind.</p><br/><p>Benjamin who was rushing alone suddenly froze in place.</p><br/><p>\"What do you mean?\"</p><br/><p>\"I do not know, it is just my instincts.\" The tone of the System sounded very annoyed. \"The King’s attitude was different from previously, right? But it is just my nerves; do not worry, you should pretend like you never heard it.\"</p><br/><p>Benjamin was left speechless.</p><br/><p>How could a system have instincts? Moreover, because of the ownership of Icor, it was understandable that his relationship with the King become strained.</p><br/><p>He did not think that there was something wrong with the King.</p><br/><p>Could it be that the Church had returned? Forget it, the King and the generals have betrayed the church once. Because of this, Benjamin could rest assured that they would not side with the Church again.</p><br/><p>Therefore, he took a deep breath and continued flying towards Gealorre.</p><br/>\n</div>"}