{"title": "Chapter 687: The Figures Which Entered the Palace", "id": 687, "volume": 7, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-687-the-figures-which-entered-the-palace", "volume_title": "Volume 7", "body": "<h1>Chapter 687: The Figures Which Entered the Palace</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 687: The Figures Which Entered the Palace</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Late night.</p><br/><p>The streets of Gealorre was relatively quiet at this hour. Yet another cult had been deemed evil due to their illicit schemes; they were now wanted all over the country – their very names struck fear into the hearts of young and old. Whenever night fell, not many willing to step out of their homes.</p><br/><p>As such, in the silent streets of the northern palace, two figures managed to dart through the courtyard whilst avoiding detection.</p><br/><p>Two short figures were that of both a boy and a girl, both were seemingly at a rather young age. They wore pitch black clothing all over, along with a black cloth balaclava over their faces. They were a spitting image of nimble assassins or oriental ninjas.</p><br/><p>The two stopped at a corner, and the young girl peeked her head around the corner to scout the road ahead. The young boy had his back to the wall, he took a deep breath and whispered, \"Sis… should we really enter the palace?\"</p><br/><p>\"Of course!\" The young girl turned to him and replied with nerves of steel, \"You saw what happened yesterday after praying to the Goddess, right? Today is the chosen day. The palace’s defense will be severely weakened, we just need to get within ten meters of that useless king to fix everything.\"</p><br/><p>\"But… after our high priest’s failed attempt, they would be sure to have put up even more defenses. Shouldn’t we wait a little longer before acting?\"</p><br/><p>The young girl heard this and snorted, \"Hmph. What’s wrong, scared?\"</p><br/><p>\"What? No… I…\"</p><br/><p>\"If you’re scared, then you should turn back now.\" The young girl interrupted him then turned her back toward him, \"Get on a ship back to the island and live out the rest of your life in peace. I alone can complete the Goddess’ mission.\"</p><br/><p>The young boy took a deep breath before clenching his fits and vigorously shaking his head.</p><br/><p>\"... Alright! I’m coming with you.\"</p><br/><p>The young girl listened, turned around and grinned, \"That’s more like it.\" But then her face changed and she added on, \"But, if you even think of turning back, I’ll cut off your legs. There’s no way I will let you go back to the island and disgrace our tribe now.\"</p><br/><p>\".....\"</p><br/><p>\"Alright, enough daydreaming, the patrolling guards are gone. We should hurry on to the king.\"</p><br/><p>The young girl tugged at the young boy’s sleeve, then they continued sneaking forward, one following closely behind the other. But for some reason, not a soul could be seen in the streets ahead, despite the fact that the palace’s location was just a few hundred meters away from them.</p><br/><p>After about five minutes, they reached the rear walls of the palace. By now, there were guards everywhere. Although it was late at night, the vigilant soldiers stood at crucial areas, keeping a watchful eye out for any suspicious figures lurking in the shadows.</p><br/><p>The young boy glanced at their darting eyes and his confidence shrunk a little more.</p><br/><p>\"Will we… able to get past them?\"</p><br/><p>\"In terms of raw power, it’s a definite no.\" The young girl replied as she pulled out a small bottle from her waist pockets, \"However, I have this baby right here – the high priest left it for us.\"</p><br/><p>\"This is...\"</p><br/><p>\"That’s right, our great elder took decades to brew this soul potion.\" The young girl’s face tightened as she gently pulled the cork out, \"When we drink it, we’ll temporarily be imbued with powers similar to that of our high priest.\"</p><br/><p>The young boy listened and couldn’t help but feel giddy. But when he glanced at the palace, the giddiness he was feeling disappeared again and he took a few steps back into the shadows.</p><br/><p>\"But… I still think doing it this way is absurd.\" He spoke slowly, \"Think about it, even our high priest died in there, that Ben-whatever mage must be mighty impressive. Even if both of us drank this, how could we possibly beat him?\"</p><br/><p>The young girl furrowed her eyebrows, \"Are you scared, again?\"</p><br/><p>\"No, I just feel that something’s off about this…\"</p><br/><p>\"Enough! You’re questioning the mission our Goddess has entrusted us with!\" The young girl shook her head and gave him a look of disappointment, \"Perhaps that mage truly is powerful, but what of it? Don’t forget that our Goddess lights our paths beyond.\"</p><br/><p>\"But… what if we die in there?\"</p><br/><p>\"It would be death for the glory of our mission, our parents’ spirits which are resting in the ocean depths would be proud of us.\"</p><br/><p>The young boy listened and could not help but heave a sigh. Then, in a sudden burst of motivation, he snatched the small bottle from the young girl’s hand and gulped down half of its contents. Then, he handed it over to the young girl who finished it until the last drop.</p><br/><p>Following this, the young girl tossed the empty bottle aside, took a deep breath, and whispered, \"Let us begin.\"</p><br/><p>The young boy nodded solemnly. The two young pairs of eyes gleamed brightly under the pitch-black blanket of darkness.</p><br/><p>Some movement was detected by the guards, while the sound of the bottle hitting the ground after getting tossed by the young girl was impossible to ignore. As such, after a brief discussion, the five guards left their positions and headed toward the street corner.</p><br/><p>\"Who goes there? Come out, I saw you!\"</p><br/><p>The soldier at the front of the formation had feigned that he caught sight of the intruders. What he did not expect, however, was for the two figures to take the bait.</p><br/><p>\"Get them, they spotted us!\"</p><br/><p>Suddenly, the guards found themselves experiencing intense pressure on their chest; they dropped to their knees as they gasped for air.</p><br/><p>Ho….how…..</p><br/><p>At that moment, they felt some sort of throbbing in their brains, it agonizingly painful, yet oddly relaxing. It was as if they had entered a floating, cloudy paradise, calmness and tranquility gradually washed over them.</p><br/><p>What happened after however, they would not be able to remember.</p><br/><p>\"Sis, we… I think we did it!\"</p><br/><p>As he stared blankly at the fazed, delusional guards, the young boy suddenly became overjoyed. It was most likely his first time achieving results of this magnitude, and the look on his face was a little over-the-top. If it wasn’t due to the fear of being heard from afar, he could even shout aloud out of happiness.</p><br/><p>\"Yeah… this is the power that our Goddess has bestowed upon us.\" The young girl looked bewildered as she looked at the few guards.</p><br/><p>A brief moment later, she composed herself and returned her attention back to the matter at hand.</p><br/><p>\"We should hurry, this state won’t last for too long.\"</p><br/><p>As she said this, she and the young boy mind-controlled the guards and got them to approach their dark corner. Under their instruction, two of the shortest guards began to take off their armor. Then, the two kids grabbed the armor and started to hastily put them on.</p><br/><p>\"Will disguising ourselves as guards really work? This seems… a little dumb.\" As he changed, the young boy couldn’t help but whisper.</p><br/><p>\"Shut it, just change already!\" The young girl retorted in a hushed voice.</p><br/><p>Around half a minute later, the two were fully clad in the guards’ uniform. Under the pitch-black night sky, they did not look very different from the other guards. And so, after killing the two naked guards with a dagger, the two headed toward the palace along with the remaining guards that were still under the spell.</p><br/><p>\"What happened? Was there a commotion of sorts over there?\"</p><br/><p>Outside the palace, the head guard looked toward the approaching party and asked.</p><br/><p>\"Nothing, a drunkard had just slipped over at the corner and his wine bottle had shattered.\" Under their concentrated guidance, one of the guards muttered angrily, \"That bastard, nearly ran at us with the wine bottle in hand.\"</p><br/><p>\"Tch… getting drunk near the palace grounds, he must be out of his mind.\"</p><br/><p>The leader shook his head, as if he couldn’t care about how they had dealt with the drunkard, then he turned around and went to continue his patrol. Both sister and brother waited for him to leave, then heaved a sigh of relief.</p><br/><p>As they continued walking with the other guards, they exchanged glances with one another.</p><br/><p>Then, they stealthily broke off from the guards’ formation.</p><br/>\n</div>"}