{"title": "Chapter 699: The Fulners’ Encore Envoy", "id": 699, "volume": 7, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-699-the-fulners%E2%80%99-encore-envoy", "volume_title": "Volume 7", "body": "<h1>Chapter 699: The Fulners’ Encore Envoy</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 699: The Fulners’ Encore Envoy</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>It was time to nurture a batch of talent specializing in psychic powers.</p><br/><p>The reason Benjamin had this thought was that there came quite a lot of talent with \"inclination on certain courses\" in the recent academic intakes. They did not have much to show for the affinity to any of the six elements, yet they possessed exceptional Spiritual Energy that managed to surpass the standard of a regular mage. To think such a constitution existed.</p><br/><p>If it was before, they would harden their hearts and reject these students. After all, to a mage, the affinity to elements was a defining target. This was an inevitable reality for the surfacing of the runes’ law of meditation. But now… Benjamin had discovered an entirely new route.</p><br/><p>Hence, he handpicked over ten talents who were extraordinarily gifted in Spiritual Energy and had them stay behind.</p><br/><p>The psychic power was an ability that the Church would never take control of. He planned to secretly train a few psychic power summoners. There was no need for many, just over ten would do to lurk in the dark and materialized during crucial moments for a possible miracle.</p><br/><p>\"U-Us as teachers?\"</p><br/><p>The siblings were surprised. It was true, with their current age, the term ‘teacher’ was quite overwhelming to them.</p><br/><p>Yet, Benjamin was never concerned with this.</p><br/><p>\"Yes,\" He nodded and responded matter-of-factly, \"You are the only ones here who truly know how to use psychic powers. If you can’t be teachers, who can?\"</p><br/><p>\"But… We have never taught anyone.\"</p><br/><p>\"There’s always a first in everything,\" Benjamin waved off, deciding for them, \"Alright, you need not worry about nitty gritty. Just do it, I believe you will be great teachers.\"</p><br/><p>\"… Alright then.\"</p><br/><p>And so, Benjamin brought in the duo siblings into the academy. There were still a few empty, remote buildings in the academy that could be provided for the teaching of psychic powers and no one would bother them. The students who were to learn psychic were already waiting within the school.</p><br/><p>The art of psychic powers was independent of the magic academy’s courses. Therefore, Benjamin didn't need to adhere to the academy’s schedule and could start immediately.</p><br/><p>\"These twenty will now be your students.\"</p><br/><p>Walking into the classroom, Benjamin spoke to the duo in a low voice.</p><br/><p>The siblings took a deep breath and swept through the students sitting scattered in the classroom. Their nerves finally soothed a little.</p><br/><p>This was because Benjamin has selected students who were at the ages of seven to eight.</p><br/><p>The magic academy would not solicit young children, but that didn’t mean that they could not apply. Truth be told, the applicants really invited everyone, ranging from roadside beggars, restaurant chefs, to an eighty-year-old pub lady boss... One test only required a few bronze coins that any poor person could afford. Hence, almost anyone would come and try their luck to see if they had the neck for it.</p><br/><p>The kids that Benjamin sought, apart from having remarkable Spiritual Energy, were also homeless orphans. After the test at the application spot, Benjamin found them and indicated his wish to take them in. At a final round of personality judgment, he finally chose fifteen of them.</p><br/><p>Currently, they were seated in the classroom and raised their head in reverence while looking at Benjamin and the sibling duo.</p><br/><p>\"Director...\"</p><br/><p>\"Alright now, these two are your teachers. You will learn the art of psychic powers from them,\" Benjamin smiled as he walked over, \"The lack of affinity to elements does not end your fate with magic. You must never give up hope.\"</p><br/><p>The children nodded as if having blank moments. The siblings walked over and one by one started to familiarise with them.</p><br/><p>And so the matters concerning the learning of psychic power were now resolved. He could regularly come to check on the progress but he didn't need to scratch his head on the overall matter.</p><br/><p>This was the benefit that came with owning an academy.</p><br/><p>\"Director, your guests are waiting in the waiting room.\" At the doorway of the teaching building, Varys saw Benjamin passing by and quickly reminded.</p><br/><p>Benjamin nodded in response.</p><br/><p>As the owner of the academy, his responsibility still weighed heavily on external affairs. Having established nearing a year, he had already met countless merchants, mercenary leaders, officials in the waiting room… He had put in an effort to build relations with every society so this possibly advanced academy could be closely tied to this world.</p><br/><p>However, entering the waiting room, he realized that the guest visiting today was not just a force’s leader here to seek an alliance.</p><br/><p>\"About that... Hello, Director Benjamin.\"</p><br/><p>He looked at this young man who slightly bowed with this intention. At first, he seemed to be a familiar face. After a brief stun, he remembered this individual to be Dick Fulner?</p><br/><p>Come to think of it, after that event and the turn of event in the Kingdom of Helius, the communication between the Fulners and academy was forced to cut off — Let’s not forget that they still owed Benjamin quite a large sum of money and elemental crystals! Benjamin had never forgotten about this.</p><br/><p>For all he knew, the Fulner family did not experience a change of hands due to the Church's unrest. It was only their informer within the Church that unexpectedly passed. Hence, they lost their technique of overseas communication. Benjamin didn’t think that it was only until today that they sent someone over.</p><br/><p>And that someone happened to be the young master of the Fulners.</p><br/><p>\"Long time no see,\" Benjamin maintained composure when he greeted him.</p><br/><p>There was animosity between them. The chamber pot incident and the village by Perseus Lake burning down his villa incident... One could say Dick hated him to the core of his bones. Now, the circumstances had changed and Benjamin was a party that the Fulners had to be loyal to, and Dick has no choice but to swallow his pride and come find him.</p><br/><p>This feeling… was not all that bad.</p><br/><p>\"Yes, about that…\" The current situation was quite embarrassing for Dick. It was puzzling that Aiden sent him over to negotiate, \"Father mentioned that the deal that you had with him earlier, you only managed to somewhat complete half of it so we will only be paying the half.\"</p><br/><p>Benjamin sneered inside.</p><br/><p>So he was here to bargain.</p><br/><p>The deal he had with the Fulner family was to help them divert the attention of the Church so that them aristocrats could take a breather. And honestly, the Church’s attention was indeed diverted by Benjamin, so he didn't consider this as \"somewhat completing half\".</p><br/><p>\"How dare you. Do you know who you are talking to?\" Benjamin grabbed his chin and pondered, \"You do know that I have ways to stop you from leaving this academy, right?\"</p><br/><p>Instantly, he had Dick fooled. His face changed violently, \"What? Why….. Why would you do that?\"</p><br/><p>\"Why wouldn’t I do that?\" Benjamin waved off, \"I am the world’s most powerful mage. This is my territory and you, are merely a little noble from the Kingdom of Helius.\"</p><br/><p>Dick was astonished on the spot. After a momentary halt, he hesitantly responded, \"W-We will pay you in full.\"</p><br/><p>\"…\"</p><br/><p>Benjamin didn't think that he would give in that fast.</p><br/><p>Of course, he didn’t plan do anything to Dick. It was just a bluff to see the reaction of this arrogant familiar face of former time. In the end… This reaction was unexpected.</p><br/><p>Well, he wasn’t Benjamin from those days any longer.</p><br/><p>Oh, how the tides have turned.</p><br/><p>\"Alright. Seeing how you’re so complacent, then I’ll take it,\" Benjamin smiled sneakily, \"And… I believe... this is not the sole reason your father sent you here, right?\"</p><br/>\n</div>"}