{"title": "Chapter 704: The Failed Operation", "id": 704, "volume": 8, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-704-the-failed-operation", "volume_title": "Volume 8", "body": "<h1>Chapter 704: The Failed Operation</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 704: The Failed Operation</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Under the pitch black sky, Benjamin flew towards the Kingdom of Helius.</p><br/><p>Ever since he had known about the Fulner family’s trump card, he had had a bad feeling in his heart. To be honest, he did not understand if this sort of technique would succeed against Grant, but... If there were any loopholes, he was afraid that an extremely terrible situation would be caused.</p><br/><p>Furthermore, a trick involving the replacement of an old lover was really a bit dirty.</p><br/><p>However, no matter what he thought, he did not really have the right to stop the Fulner family. Because of that, he could only stand aside and watch with his hands tied, waiting for the final results of this plan.</p><br/><p>A few days later, however, the Fulner family sent him another secret letter.</p><br/><p>\"The entire plan has gone smoothly, but there was a small hiccup. The priest that was in charge of adding the poison into Grant’s food and beverage had been exposed, so he had to kill himself in order to protect the others. Because of that, we have made some changes to the plan. For now, the playing of the trump card is extremely effective. In five days, Grant will be lured to the mountains in the north of the capital city. We will be ready to kill the sinful one there immediately.\"</p><br/><p>\"To ensure that the plan is foolproof, we need your help, sir. If it is possible, please hurry to the rendezvous point labeled in the letter, we need your powerful abilities as a guarantee, sir.\"</p><br/><p>When he had finished reading the letter, at that time, Benjamin had felt extremely confused.</p><br/><p>The undercover priest had already been exposed, and yet the Fulner family still intended to proceed with the plan, and had finally decided to use such a forceful, rash method to press and kill Grant immediately—was this too a bit too rash?</p><br/><p>Benjamin was not at all optimistic in his heart. He felt that, if they continued to go about this stubbornly, he was afraid something was going to go wrong.</p><br/><p>But it was very apparent that it was basically very difficult to turn back, now that the Fulner family had gone this far. The merchants that they had gathered with them, the priests... If the plan did not continue, he would not be able to give them an explanation. His position would be a very dangerous one.</p><br/><p>Once a lot of time had passed, the loopholes and cracks of the plan would be exposed; if they waited until Grant suspected the Fulner family, their fate would be much worse than that of the Lithur family.</p><br/><p>Thus, they could only start the fight.</p><br/><p>Benjamin could understand what they were doing, but the risk was too great, he actually did not really want to partake in it. However, to get him to decide, the Fulner family had added a condition at the end of the secret letter which was almost impossible to resist.</p><br/><p>\"After the Academy of Silence was uprooted, there were only a few scattered small groups of mages left in the kingdom. Their communications between them became very covert; even the Church could not detect them. If you are willing to come and help us, we will tell you all the communication methods the mages used. Added together, there are close to a thousand of them.\"</p><br/><p>Having finished reading this part, Benjamin had narrowed his eyes. After considering it for a long time, he finally decided to make a trip to the Kingdom of Helius.</p><br/><p>The existence of the local Mages Organization in the kingdom was definitely a group that needed to be won over. Reminiscing about the past, he had relied a lot on the abilities of the local mages to be able to fan the flames of rebellion against the Church in Ferelden. It would be very important to them if he could contact these thousand men.</p><br/><p>As for his allies, the Fulner family... To be honest, before the Church was completely uprooted, their existence was still necessary.</p><br/><p>Benjamin’s trip there this time was also because he felt that, if they somehow failed, he might be able to strike and save them. He should not let his allies die too violently; it had been difficult to get them on his side.</p><br/><p>Whatever the case was, he was very curious about the power that Grant had attained. This meetup might be able to answer the doubts in his heart.</p><br/><p>After various considerations, he finally decided to set off.</p><br/><p>The distance between the academy to the rendezvous point was long; even if Benjamin flew there, it would take him three to four days of travel. He could only rush, and get there before things began to happen.</p><br/><p>After three days.</p><br/><p>\"This place... Should be free from anything weird, right?\" Descending in a remote mountain village, Benjamin put on a disguise, and walked into the mountain village, arriving at the hotel they had agreed to meet in.</p><br/><p>\"So far, nothing is amiss.\" the System said impatiently, \"Why are you so suspicious? It’s not like you can’t see it for yourself, can’t you just take a sweep with the sensing technique?\"</p><br/><p>\"But occasionally, some things are able to trick the elements. No harm in being extra careful.\"</p><br/><p>Benjamin shook his head, speaking in his heart while walking into the room agreed upon in the letter. Before he pushed the door open, he could already sense Dick pacing about inside the room, rubbing his hands with a nervous expression.</p><br/><p>And so, he first gave a greeting.</p><br/><p>\"We meet again, how is it? Is the plan still happening smoothly?\"</p><br/><p>Dick’s entire body gave a shiver, as though he was shocked by a sudden thunder on a rainy day. However, raising his head to see Benjamin, he looked as though a huge burden had been lifted off him.</p><br/><p>\"You... You finally came.\"</p><br/><p>Benjamin nodded.</p><br/><p>He felt that Dick seemed a bit too nervous. However, the man’s constitution had always been weak. Under such circumstances, it was not strange that he would be nervous, so Benjamin did not think much of it.</p><br/><p>\"How is the progress of things?\" He asked.</p><br/><p>Dick took a deep breath, and did not answer the question, but said: \"...Come with me, I’ll bring you there immediately.\"</p><br/><p>Benjamin did not say anything, and nodded.</p><br/><p>Time was rather of the essence; following Dick, he speedily left the hotel and rushed out of the village. The mountain village was quite a few hundred miles away from Havenwright; to fly there from here would take at least a few hours, so naturally they could not dawdle.</p><br/><p>However, after they had walked out of the village, the direction that Dick chose to take seemed to be somewhat odd.</p><br/><p>\"Hey... Where are you going? That’s not Havenwright.\" Benjamin furrowed his eyebrows, \"Come over, I can use magic to fly you there, it can save us a lot of time.\"</p><br/><p>Hearing that, Dick turned around but did not say anything. He gave a weird and guilty look.</p><br/><p>At that moment, Benjamin began to feel that something was not right.</p><br/><p>\"You...\"</p><br/><p>Just as he opened his mouth to ask some questions, suddenly, his expression changed. A few hundred meters away, in the skies, the feedback from the water elemental energy gave him some bad news— a group of people were flying here.</p><br/><p>The image appeared in his mind... There was no mistake about it. They were priests.</p><br/><p>Not only that, but in the same direction, on the ground, many Cleaners on horses were appearing on the horizon. Under the dusky moonlight, those figures looked like tides of ocean waves, surging towards them at high speed.</p><br/><p>For a moment, Benjamin stared at Dick with shock and suspicion in his eyes.</p><br/><p>\"Tell me what’s going on.\"</p><br/><p>The water elemental domain was activated, and he floated into the air; pieces of sharp ice blades appeared, circling his body. A chill that would have made anyone shiver slowly emanated from his eyes.</p><br/><p>Dick lifted his head, watching him as his entire body trembled.</p><br/><p>\"I... I...\"</p><br/><p>\"Have you betrayed us?\" Benjamin asked coolly.</p><br/><p>Dick was so nervous that he could not speak, but he still shook his head vigorously, occasionally casting a glance towards the huge group of Cleaners coming out from the west, looking hopeless and terrified.</p><br/><p>\"Then say something! What happened?\" The bad feeling in Benjamin’s heart was becoming stronger. Instantly, he raised his voice, asking harshly.</p><br/><p>Dick was shocked, and shivers ran down his body, but his mind seemed to have cleared up a lot. With a trembling voice, he said: \"I... The plan was exposed. Father is dead, they are all dead... The Fulner family... Has been destroyed.\"</p><br/>\n</div>"}