{"title": "Chapter 715: The World on the Other Side", "id": 715, "volume": 8, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-715-the-world-on-the-other-side", "volume_title": "Volume 8", "body": "<h1>Chapter 715: The World on the Other Side</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 715: The World on the Other Side</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>With that, Benjamin, along with Dick at the bird parasitized by the spirit, flew out from the top of the abyss.</p><br/><p>Through magical healing, he could keep the bird alive, there was no longer a need for him to keep the rest of the birds captured. Benjamin freed them and compensated them with another Elemental Order - Heal as if it was a medical subsidy for their participation in the experiment.</p><br/><p>Initially, according to his plan, he was going to use the hundreds of birds to keep the spirit alive throughout the journey back to the academy. Now that such an accident happened, he, of course, was happy and relieved.</p><br/><p>\"That... Why must the bird that was possessed by the spirit be put in my bag?\"</p><br/><p>On the way, Dick, who was carrying the backpack, turned around cautiously and asked.</p><br/><p>\"Your bag is bigger,\" Benjamin smiled, \"Don’t worry, it won't suddenly drill out and eat you up, at most, you will only experience metamorphosis, you don’t have to worry about it at all.\"</p><br/><p>Upon hearing that, Dick shivered. As he was being forced by Benjamin’s tyrannical abuse, he could only give in.</p><br/><p>Benjamin shook his head.</p><br/><p>That being said, the System would always keep an eye on that spirit. Should the body of the bird garner too many dark elements and the spirit grow stronger, Benjamin would somehow find another living thing as a host for the spirit and eliminate the bird to prevent any problems.</p><br/><p>The spirit was still very weak and could not even make the sound that would cause hallucination. However, it was hard to predict what would happen next.</p><br/><p>At that moment, they had already arrived in a new country, there was no need to put all their attention on the spirit.</p><br/><p>As they flew past the abyss and arrived at the wilderness on the opposite side, it turned out that every inch of the land had never been touched by people from the past. Benjamin did not know what would be there, a great wilderness occupied by magical beasts? Or, would it be a completely different and new civilization?</p><br/><p>In order to scan the entire domain, he flew extremely high and looked downwards, he could see the narrow and long abyss, a natural moat divided the mainland into two.</p><br/><p>\"Quick, look! That... What’s that?\" Dick suddenly pointed ahead and said loudly.</p><br/><p>\"An eyeless bird, a common magical beast,\" Benjamin shook his head and said slowly, \"Don’t be so nervous all the time, relax.\"</p><br/><p>\"Oh...\"</p><br/><p>Benjamin felt a bit helpless, yet he still waved his hands, causing ice arrows to shoot out like rain and cleared away the birds and beasts that were blocking their path.</p><br/><p>He was not surprised at all. That was a magical beast that did not possess sense of hearing or sight. It could only perceive everything through smell. It was very normal for them to be able to fly freely from the ends of the abyss.</p><br/><p>When would the unique existence of the new land show up?</p><br/><p>However, it did not cross his mind that, not long after he killed the bunch of eyeless birds, a surprising image appeared in just a blink of an eye.</p><br/><p>The corpses of the birds fell from the sky onto the empty wilderness. Subsequently, the land nearby shook with a deafening noise; Benjamin shifted his attention immediately. Quickly after, few openings cracked open from the ground, where some weird \"creatures\" started crawling out from within.</p><br/><p>They look extremely skinny, their dark complexions resembled a bunch of malnourished monkeys, with their lower body below the waist nowhere to be seen. Since they had no legs, their gigantic front paws looked exceptionally strong. They crawled on the ground so quickly that it was not long before they surrounded the dead eyeless birds and started digging up excitedly.</p><br/><p>Benjamin frowned.</p><br/><p>\"Do you have any records of this magical beast in your data bank?\"</p><br/><p>\"I don’t,\" The System answered leisurely, \"In fact, I’m afraid that these creatures are not even magical beasts. Magic beasts store a large number of elements in their bodies that can be used at any time... Yet these creatures have no elements in their bodies at all.\"</p><br/><p>After hearing that, Benjamin took a deep breath, he could not imagine that he had found a brand new creature in such a short time.</p><br/><p>\"Then... What are they?\"</p><br/><p>The System answered, \"I don’t know, no one has found them before anyway, perhaps you can name them.\"</p><br/><p>Benjamin thought for a while, lowered his flying altitude and arrived near those half-bodied monkeys. However, it was not until he got closer that he realized that those creatures look so much more like a human than a monkey. Just that the skinny and hideous face looked like a mummy that was broken into half.</p><br/><p>Mummy...</p><br/><p>As he thought about that, Benjamin took a deep breath subconsciously.</p><br/><p>\"Those things... They can’t be undead creatures, right?</p><br/><p>\"It's possible,\" The System fell silent for a while before continuing, \"I’ve just done a detailed test, their bodies contain a kind of messy and uncontrolled spiritual power, which feels similar to the ones in the spirits. Moreover, there’s no heartbeat, their blood flows really slowly... They do not have any feature that defines them as a ‘living thing’.\"</p><br/><p>\"...\"</p><br/><p>Benjamin shook his head.</p><br/><p>He did not think that the land over at the abyss would be a place where undead creatures would pop out anywhere at any time. Why? He could not figure out. The dark elements around were not any much thicker than before?</p><br/><p>The environment at the bottom of the abyss was much more different from where they were. As for the spirit, it was still feeling very painful and did not feel like a fish in the pond.</p><br/><p>While he was still deep in thought, the mummies from below seemed to have noticed the two of them in the sky. With that, unpleasant roarings were heard as strange undead creatures looked up and stared at Benjamin, their looks were indescribably friendly.</p><br/><p>Some of them even pushed against the ground with both their hands and tried to jump to attack the both of them in the air.</p><br/><p>\"... Another bunch of dumb fellows.\"</p><br/><p>Benjamin sighed as he summoned hundreds of ice arrows again, and did a concentrated targeted raid towards the mummies. Those things seemed to have not faced magic like that before, they were all shocked and did not dare to escape, soon enough all of them were hit and cut into pieces.</p><br/><p>\"Congratulations, you successfully killed a group of undead creatures.\" The System sounded a ‘ding’, and said like a normal system, \"Although they were already ‘dead’ anyway.\"</p><br/><p>Benjamin shook his head helplessly.</p><br/><p>He landed on the ground and studied the \"corpse\" of those mummies carefully. Muscles, skeletons... Although he was not familiar with this specialized knowledge, he could feel that the structure of those mummies was very similar to that of a human structure.</p><br/><p>Were they really transformed from human corpses?</p><br/><p>Instantly, Benjamin’s odd feeling became even stronger. The other side of the abyss was a completely different world, that he could confirm. But... why? Across a gap with the width of just more than ten meters, the environment had such a huge change, he could not understand why it was so.</p><br/><p>He started to somewhat have a premonition of what he would see next.</p><br/><p>Sure enough, after gathering the debris of the mummies, Benjamin continued his journey again. However, in just a short while he met those similar creatures again. Carrion that had a stench were roaming about freely, resembling a bunch of ferocious and bloody creatures... The common determining features related to a \"living thing\" were nowhere to be found on those things, the land was glutted with walking dead.</p><br/><p>It was the paradise for the undead.</p><br/>\n</div>"}