{"title": "Chapter 729: Collision beyond Humanity", "id": 729, "volume": 8, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-729-collision-beyond-humanity", "volume_title": "Volume 8", "body": "<h1>Chapter 729: Collision beyond Humanity</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 729: Collision beyond Humanity</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>\"... Bull’s eye?\"</p><br/><p>From above the river, Grant glanced at the surface of the water. However, it was not as he imagined. The light threads quickly disappeared into the water, and yet, no trace of blood was seen.</p><br/><p>This meant that that blow was not fatal.</p><br/><p>Immediately, the flowing river experienced a sudden change. Layers and layers of icicle spread outward like waves, freezing the entire river. The sudden drop in temperature caused the mountainous walls on both sides to be covered with white frost in a blink of an eye. The Norman River Valley seemed to have fallen into an ice age.</p><br/><p>Grant couldn't help but narrow his eyes seriously.</p><br/><p>It was the force that destroyed the barrier at the imperial capital...</p><br/><p>He suddenly flew high up into the sky. The sunlight that was shining down was collected and concentrated at the tip of his finger. Wave after wave of magical oscillation made sounds like that of a chiming clock.</p><br/><p>As the light threads garnered, Grant’s fingertip bore a glistening golden rune character.</p><br/><p>He aimed at the frozen river below him.</p><br/><p>\"Come out!\" His voice echoed within the river valley, \"Let me witness why Claude can claim that you’re more powerful than I am.\"</p><br/><p>He was replied with a thunderous thud.</p><br/><p>After the water currents were frozen, there was a sudden tremor, as though there was an earthquake in the river valley. Soon after, both heaven and earth trembled violently. The horrifying noise surpassed the limit of an ordinary mage. It sounded as if Mother Earth herself was roaring in rage.</p><br/><p>In such a quake, the entire frozen river was suddenly uprooted from the land.</p><br/><p>\"Oh-oh my god, what is this...\"</p><br/><p>A few thousand meters away, the commanding officer stood in awe with widened eyes together with the soldiers. As they were figuring out what to do, the strange phenomenon of the river had them stunned. The earth moved violently, and the previously down-pouring currents suddenly changed direction and were now pouring upwards... which was also the direction where their Highness the Pope had disappeared to.</p><br/><p>It was the raining season, and yet, the river seemed to have dried out.</p><br/><p>These people were unaware of what was happening, but it wasn’t long before they noticed the sky.</p><br/><p>\"The entire river.... Frozen….. is flying?\"</p><br/><p>At that moment, the commanding officer felt weak in his knees and his mind was a blur.</p><br/><p>As he was still processing this, he saw a slithered ice block floating in the sky from afar. Its shape was familiar; when the officer eventually realized what it was, he almost fainted. It was a mountain range that was simply tossed high into the sky.</p><br/><p>That’s right, tossed.</p><br/><p>From the course of the ice block movement, ‘tossed’ would seem like an appropriate word. It traveled at a high speed. Its trajectory was like when the commanding officer was once displeased with his subordinated and tossed a half-eaten apple at him. The subordinated was smashed hit so hard that he saw stars.</p><br/><p>And now, that devil may be fighting His Highness the Pope. The devil then grabbed hold of this river and tossed it at the pope.</p><br/><p>Is... Is this what a human being is capable of doing?</p><br/><p>The commanding officer could not process what he was seeing. He could only support his trembling legs and subconsciously take a few steps back, wishing to get as far away as possible. Such a scary level duel, it was very easy that they would be hit by collateral damaged and killed, no?</p><br/><p>However, he hadn’t managed to retreat far enough before he heard a loud clash in the faraway sky.</p><br/><p>The soldiers were still scrambling to find their feet from the earthquake. After the clash, they stumbled to the ground again. It sounded like something had exploded, causing a loud ringing in their ears. They lifted their heads and peered at the sky, only to see a scene that they would never forget.</p><br/><p>\"... It-It’s snowing?\"</p><br/><p>The large ice block was gone. Something as white as snowflakes was wafting through the sky. At first glance, it seemed to be regular ice shavings drifting about, but upon closer inspection, they saw that these ice shavings... were burning.</p><br/><p>Every piece of ice shavings was engulfed with a golden flame and was dancing in the sky as they rustled down. They didn’t know why, but the blazing sun looked hollowly dim.</p><br/><p>The commanding officer and the soldiers felt chills run down their spines.</p><br/><p>\"Quick! Disperse! Make sure not to touch those things!\"</p><br/><p>Survival mode was instantly engaged as the commanding officer shouted at the top of his lungs. He did not know where he found the energy. But immediately after, he turned and ran for his life. He needed to get out range of those falling ‘snowflakes’.</p><br/><p>At the same time as these people were fleeing...</p><br/><p>\"He could fucking block that?\"</p><br/><p>At a corner upstream the river valley, Benjamin stood at the already dried up river. He couldn't help but take a deep breath.</p><br/><p>Earlier on, he had frozen the entire river and tossed it at Grant. However, when that rune character at the tip of Grant’s finger was formed, Benjamin felt a huge pressure.</p><br/><p>That rune... represented the \"light element\".</p><br/><p>Just before the ice block smashed into Grant, the golden rune suddenly disappeared. What followed next was an explosion of fireworks in the sky as a tremendous number of light elements formed a giant palm to smack down the river.</p><br/><p>Hence, the ice river and palm exploded into a flurry of burning snowflakes. Grant’s gaze pierced through the wreck and stared coldly at Benjamin.</p><br/><p>— He was unharmed.</p><br/><p>Benjamin started to realize how bad the position he was in was.</p><br/><p>Grant couldn’t simply summon such a powerful rune. But raising an entire river and tossing it, had probably taken Benjamin even more effort.</p><br/><p>Even in the state of the \"Descending of Water\", the move had consumed nearly one-quarter of his Spiritual Energy.</p><br/><p>His battle with Grant was no more than a few minutes but he had already used up one-third of his Spiritual Energy, one second of his intangible form and suffered a minor injury. This sort of outcome was making him very nervous.</p><br/><p>This battle... was unsettling.</p><br/><p>\"Come! What are you hesitating for? Continue!\" Grant’s voice rang out from the high skies. It didn’t sound calm at all, instead, it sounded like it was filled with adrenaline.</p><br/><p>Benjamin shook his head.</p><br/><p>This bastard... seemed to be enjoying it.</p><br/><p>However, he did not hesitate further. How could he waste time hesitating with the \"Descending of Water\" on a time limit? As a water tornado surged from his feet, Benjamin flew to the sky to the same height as Grant and engaged him in an icy stare down.</p><br/><p>Ice blade, ice spear, ice arrow... So many summoned in a flash as if there was a sudden appearance of an army of ten thousand in the sky. They were lined up in a row. Its density shimmered like a galaxy.</p><br/><p>Benjamin did not waste his breath. With the wave of his arm, the frosty army charged at Grant.</p><br/>\n</div>"}