{"title": "Chapter 728: Ultimate Light Threads", "id": 728, "volume": 8, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-728-ultimate-light-threads", "volume_title": "Volume 8", "body": "<h1>Chapter 728: Ultimate Light Threads</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 728: Ultimate Light Threads</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Further up in the river, in a tight corner where both sides of the riverbank were piled high with large rocks.</p><br/><p>\"Come out. I have already sensed the existence of the key. You can’t hide.\"</p><br/><p>Above the river, Grant hovered around with six pairs of radiant light wings on his back. His gaze panned the surface of the river. His tone bore a slight rage, which echoed loudly in the narrow river valley.</p><br/><p>However, the quiet river valley gave no response.</p><br/><p>\"Still hiding, huh...\"</p><br/><p>Grant let out a cold snort and suddenly, pointed behind him. Instantly, a light spear shot out from within the rivers. At the same time, a figure was dragged out of the river with the light spear penetrating clean through its body.</p><br/><p>However, once Grant caught a sight of the figure, he couldn’t control his rage.</p><br/><p>— It was a scarecrow with a weird face drawn onto it. The smile on its face was brimming to the point of sarcasm. The pair of eyes narrowed into a boorish angle, squinting to the left.</p><br/><p>The scarecrow’s stupid face pissed Grant even more.</p><br/><p>However, his expression quickly changed.</p><br/><p>\"Shit….. Sneak attack!\"</p><br/><p>A cluster of tiny ice needles launched out of the waters behind him out of nowhere, heading straight for him. Grant took notice and abruptly turned before extending his arm toward it.</p><br/><p>At that moment, the holy light formed a mirror and shielded him. The ice needles collided with it and ricocheted into multiple directions before falling back into the river.</p><br/><p>Soon after, the strong currents of the river became calmer and even had blocks of ice emerging from within it — the tiny ice needles that melted into the river had frozen almost the entire river.</p><br/><p>But, although he had escaped the sneak attack unscathed, Grant didn’t seem the least bit pleased.</p><br/><p>It was the fact that he hadn’t yet caught a glimpse of a certain someone.</p><br/><p>Suddenly, he seemed to be struck by a thought as he swiftly turned and stared at the direction of the scarecrow. At this very moment, there was an appearance of another figure beside the scarecrow — He flew midair, encircled by snowflakes from the suddenly chilled river. He raised the taunting face of the scarecrow with one hand, then pulled its face apart, as if trying to retrieve something out of it.</p><br/><p>Grant took a deep breath in and his demeanor became calm again.</p><br/><p>\"... Benjamin.\"</p><br/><p>He spoke with a deep voice.</p><br/><p>In front of him, not far away, Benjamin let out a chuckle. He pulled out the key from the scarecrow’s ‘comical’ head and stashed it in his pocket.</p><br/><p>\"It’s a shame that you missed out on your only opportunity to retrieve the key.\" After he put away the light green ginkgo leaf, he turned and spoke to Grant.</p><br/><p>Grant suddenly clenched his fist.</p><br/><p>\"You used the key to set a trap... In an attempt to kill me.\"</p><br/><p>Benjamin simply tossed away the scarecrow and shrugged, \"I’ll say the same to you too. The ice prick from the waters didn’t seem to care much about taking me alive.\"</p><br/><p>\"That is because you have gone astray.\" Grant blandly replied, \"You are a mage, even so, an evil mage that has slaughtered a countless number of priests. If I am ever given the opportunity, I will see you to your death.\"</p><br/><p>\"Interesting.\" Benjamin smiled sarcastically, \"You should understand then that based on your pedantic teachings, that no matter if it is you or I, but we both will be banished to hell, right?\"</p><br/><p>Instantly, Grant’s face darkened.</p><br/><p>All of a sudden, a holy light surged like a tide, shining brighter than even the sunlight from the sky. Benjamin’s gaze intensified, and his body dodged to the side, as if evading something.</p><br/><p>In that short period of time, Benjamin reacted quickly and flew to quite a bit of distance away before slowly stopping. He wiped away the beads of sweat on his forehead.</p><br/><p>\"That was pretty... ruthless.\"</p><br/><p>In that fleeting moment, countless holy lights were compressed into extremely tiny light threads, aimed at his heart. He didn’t even have the confidence to block off that horrifying power of destruction. It was only due to the System’s pre-warning that he could somewhat dodge this deadly blow.</p><br/><p>He grabbed onto his left arm.</p><br/><p>At first, it was numbing. An unbearable pain traveled from within his arm. The light threads had punctured through his flesh and bones, digging a hole in his right arm. The flesh around the hole was burnt to a crisp.</p><br/><p>Horrifying...</p><br/><p>So, this was Grant’s true capabilities?</p><br/><p>It was some sort of ultimate elemental control. There was no need for incantations, no need for magic structure. The holy light followed his will, compressing into threads invisible to the human eye, moving at the speed of light.</p><br/><p>That indistinct Spiritual Energy oscillation was somewhat familiar to Benjamin.</p><br/><p>— It was a little similar to the Spiritual Energy that existed within the elemental plane.</p><br/><p>He really wanted to examine Grant’s summoning process to understand the difference between him and a regular priest. It was a shame that the other party would not let him have this chance. After the blow fell through, the holy light amassed in Grant’s direction, as if brewing the next light thread.</p><br/><p>Benjamin didn’t even have time to heal himself. He ignored the pain as he used his other arm to draw a string of rune characters.</p><br/><p>\"Elemental Order — Defend.\"</p><br/><p>It wasn’t as if he himself didn’t have tactics to directly control the elements; if this was Grant’s approach, then they shall both play it the hard way.</p><br/><p>The water elements from the entire river valley amassed towards him, swiftly forming a shapeless barrier. But at the same time, a shade of light threads spurted out the tip of Grant’s finger, darting straight toward Benjamin.</p><br/><p>\"No can do, dodge now!\"</p><br/><p>The System’s warning sent off alarms as Benjamin instinctively took a dive to the side.</p><br/><p>At the same time, the light threads collided onto the barrier summoned by the runes. At that moment, splashes, broken ice... Everything water magical appeared in a blink of an eye, then destroyed the next. It looked like there was a mini big-bang.</p><br/><p>The light threads drilled through the barrier and skimmed pass Benjamin’s garments.</p><br/><p>Benjamin couldn’t help but curse silently.</p><br/><p>That was close...</p><br/><p>\"You’re only up to this level? What about the punch at the imperial capital the other day? What are you hesitating for?\" Grant’s voice rang. The tone was tranquil but had a hint of disdain.</p><br/><p>Benjamin frowned.</p><br/><p>Should he initiate the \"Descending of Water\"?</p><br/><p>Without a doubt, Grant was going all out. As he spoke, another wave of holy light was amassing before him. If Benjamin did not counter soon, a third wave of ultimate light threads would be heading his way!</p><br/><p>That bastard... Why only this fucking move?</p><br/><p>Before the other party could launch his attack, Benjamin suddenly flew downwards, plunging headfirst into the gushing river. The wound on his left arm was getting more and more unbearable, spikes of burning sensation were shooting through his bones. If he didn’t take care of it, he wouldn’t be able to keep up in this fight.</p><br/><p>He summoned the healing water currents to enter the wound. The burning sensation from the wound was finally declining and the healing began.</p><br/><p>But, the speed of the healing... was much slower than before.</p><br/><p>\"Be careful!\"</p><br/><p>Unfortunately, at this moment, the warning from the System vibrated through him. Benjamin was startled but it was not easy to dodge under water. He could only watch as a shade of holy threads parted the waters and propelled through his forehead!</p><br/>\n</div>"}