{"title": "Chapter 734: Unexpected Reinforcements", "id": 734, "volume": 8, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-734-unexpected-reinforcements", "volume_title": "Volume 8", "body": "<h1>Chapter 734: Unexpected Reinforcements</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 734: Unexpected Reinforcements</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>After hiding behind the rock, Benjamin knocked on it gently and said softly, \"Come out of there, I’m Benjamin, why are you here?\"</p><br/><p>Instantly, the two people who were hiding in the rock looked extremely shocked.</p><br/><p>They tilted the rock together and wormed out from the gap underneath the rock. Then, both of them stood next to each other and looked at Benjamin up and down with an odd look, they looked at each other again then nodded in the end.</p><br/><p>\"Yes, it’s really him, not a disguise from the Church.\"</p><br/><p>Benjamin said helplessly, \"If I’m a disguise from the Church, you’d both be dead by now, you know?\"</p><br/><p>\"Be careful, it’s not so convenient to hold a conversation here, let's hide further away first,\" The taller mage turned around and took a glance at the encirclement then said softly.</p><br/><p>Although Benjamin was very curious about them being there, they were truly quite close to the encirclement, it would be too dangerous to stay put. It would be better if they talked somewhere further away.</p><br/><p>He led both the mages to hide in a bush nearby. After making sure that there were no patrolling knights around, they could finally take a breather and talk with normal volume.</p><br/><p>\"Why did you two come here?\"</p><br/><p>The mages looked at each other, beat themselves on their chests and said proudly, \"We’re here to save you of course!\"</p><br/><p>Upon hearing that, Benjamin was suddenly speechless for a while before he could say, \"How are you going to do that? Moreover... How do you know that I’m here? This is supposed to be private and confidential in all the countries, how did you find out about this?\"</p><br/><p>\"You have so many questions, which one should be answered first?\"</p><br/><p>\"...First, tell me how you’ll be able to save me.\"</p><br/><p>As the shorter mage heard him, he nodded and said, \"About this, it’s really simple. Right now, everyone from the Church has been distracted elsewhere, you can just bring us and break out from anywhere.\"</p><br/><p>\"...\"</p><br/><p>Benjamin held his forehead helplessly.</p><br/><p>\"As soon as I show myself, everyone will get a word of it. The pope will rush over as fast as he can, how can we escape then?\"</p><br/><p>The taller mage shook his head and said, \"The pope won’t come. He’s being tied up by brother Miles now, we can escape without worries.\"</p><br/><p>Benjamin was in a daze.</p><br/><p>Miles?</p><br/><p>It was really sudden, after not communicating for quite some time, why would he suddenly be here? Furthermore, did Miles know these two mages? When did they get acquainted?</p><br/><p>Benjamin was glutted with a bizarre sense of absurdity. Only that... Truly, all the knights were distracted away, Grant was nowhere to be found too, the encirclement became desolate. Other than Miles, who in the world would actually be able to pull that off?</p><br/><p>Besides, if the two of them were telling the truth, it was certainly a rare opportunity to break out.</p><br/><p>\"... Let's go! The chance is hard to come by, we have to charge out immediately!\" After realizing that, Benjamin stood up from the bush quickly and said without hesitation.</p><br/><p>Although he still had many doubts, who knew how much more time Miles could buy for him? It was a rare chance, any more questions could wait until after they get out.</p><br/><p>The two mages looked exceptionally elated as if they were sick of staying put for so long.</p><br/><p>In a flash, they hurried near to the encirclement. Benjamin could not help but turned around to reconfirm, \"You’re not lying to me, are you? Miles really managed to tie the pope down? If I show up now, no one will come for backup? If there’s any mistake at all, we’ll most likely die here.\"</p><br/><p>\"No worries, there won’t be any mistake!\"</p><br/><p>As he listened to their assuring words, Benjamin sighed instead, it seemed like he did not feel any better.</p><br/><p>Forget it... Since it had turned out to be like that, what else could he do? If he did not take advantage of the situation to breakout, it would be troublesome after that.</p><br/><p>Thus, he slowly read out the syllable that represented \"water\", and activated the water elemental domain. At the same time, he drew out a series of runes with his right hand, which lit up faintly mid-air.</p><br/><p>\"Who’s that?!\"</p><br/><p>An alerted voice was heard not far from where they were, all the priests at the encirclement were notified too. However at that moment, what they were about to face was a sudden elemental turbulence that stirred up.</p><br/><p>Then, it was followed by overwhelming ice arrows that blotted out, Benjamin led the two mages and flew out from the back of the woods.</p><br/><p>\"Are you surprised? You’ve waited for so long, aren’t you waiting for me?\"</p><br/><p>Everyone looked stunned. The priests took out the cross one after another and crumbled it hard, they wanted to notify the others about what was happening. Nonetheless, there was no response from the pope.</p><br/><p>Instantly, they looked as Benjamin started to attack crazily, their eyes were filled with despair...</p><br/><p>At the same time when Benjamin forcefully broke out from the encirclement.</p><br/><p>On the other side of the Norman Valley, there was a packed crowd, pieces of mountain rocks were scattered everywhere, streaks of light were seen shooting across the sky mid-air as if capturing something that was so quick that it could not be seen.</p><br/><p>Grant was flying mid-air, he was shooting extreme lights while moving around speedily. Unknowingly, the robe on him had turned into thick armor, on it were signs of deep yet shallow knife cuts.</p><br/><p>As for the target that he was attacking, there was no clear image of that person at all. The distinctly fast shadow kept shuttling among the crowd, at last, he left as a ghost-like image in the retinal of the people.</p><br/><p>\"This fellow... He has the audacity to up in the Imperial Capital!\"</p><br/><p>One after another, Grant’s attacks failed, he subconsciously frowned.</p><br/><p>Initially, he was flying back and forth above the encirclement, looking for traces of Benjamin. As there was an alarm from a location, it seemed like someone had found Benjamin. Therefore, Grant rushed over there but in the end, he was tied up by the mysterious man before him.</p><br/><p>Not only did he kill many knights, but he also started attacking Grant. He was so quick that he was elusive, giving Grant a tremendous pressure. Grant even had to use up many of his precious magical tools in order for him to put on the Holy Light Armor so that he would not die under that man’s knife.</p><br/><p>Moreover... he recognized that fellow.</p><br/><p>At that time, the fellow had broken into the St. Peter’s Cathedral, stolen a great number of books, and almost stolen the pieces of the Heavenly Sword. Grant tried to battle him but was anyhow thrown away. From that on there were no signs of him, no matter how hard they tried to arrest him in the country, there was no news of him at all.</p><br/><p>He thought that the mysterious man had left the palace, but who knew, just when they finally managed to surround Benjamin, that man resurfaced again and caused them such a huge trouble.</p><br/><p>Ding!</p><br/><p>There was another slash, Grant tried his best to avoid it but was still slashed on his chest by some sort of weapon. As the Holy Light flashed again, a slight mark of knife cut was left on his armor. He felt extremely aggrieved as he could not fight back at all even though he was constantly attacked at.</p><br/><p>However, at that moment, the cross hung on his chest lit up.</p><br/><p>\"Southeast direction... someone is breaking out!\"</p><br/><p>Without a doubt, It must be Benjamin who was taking advantage of the opportunity to escape!</p><br/><p>As he realized that, Grant elevated immediately, he did not want to deal with the mysterious man anymore and planned to get rid of him through height. Nonetheless, that shadow flashed among the crowd, pushed off from the head of a knight and reached an even higher position at a faster speed.</p><br/><p>Grant was so stunned.</p><br/><p>That height... how was it possible? Even if he drank the most precious magic potion and was a mercenary with the strongest physical fitness, there was no way that he could catch up to Grant in the air.</p><br/><p>Instantly, Grant realized that the man had some tricks up his sleeves that even he did not know of.</p><br/>\n</div>"}