{"title": "Chapter 738: Prototype Military", "id": 738, "volume": 8, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-738-prototype-military", "volume_title": "Volume 8", "body": "<h1>Chapter 738: Prototype Military</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 738: Prototype Military</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>As they passed through the abyss, Benjamin and the rest decided not to stay too long in the netherworld. After collecting some materials for research, the party returned to the Academy of Magic.</p><br/><p>After bidding their goodbyes, Elizabeth and the two mages left for Ferelden. Miles, on the other hand, was persuaded by Benjamin to stay at the Academy to allow the elders of the Magic Department to do some research on his physique.</p><br/><p>However… despite going through so many trials to return to the Academy, Benjamin hadn’t forgotten the most important thing at hand.</p><br/><p>\"How is the organization of our secret forces coming along?\"</p><br/><p>\"Follow me, director,\" answered Varys.</p><br/><p>After passing a huge plain on the outskirts of the town, Benjamin and Varys finally arrived at a secret base hidden in an uninhabited forest.</p><br/><p>The base was bustling with strong young men in uniform jogging in circles. Somebody familiar, who was in a general’s uniform, was ordering the young men to run around. Their formation seemed to be crooked, one could even say it was messy, but with the number of people doing the running, the atmosphere was quite overbearing.</p><br/><p>The entire base was not huge, and the System’s brief scan revealed that it contained only a few hundred soldiers.</p><br/><p>A few hundred soldiers… well, it was still better than no soldiers at all.</p><br/><p>Benjamin didn’t feel disappointed at the lack of numbers. The entire Magic Instruments Department was focused on creating the Cannon of Holy Light, so production of rune armor had been low anyway, which would make outfitting a thousand people in it difficult.</p><br/><p>\"These soldiers are all from Academy. They’ve all passed our strict selection process, so I can guarantee that there are no spies from the Church or other countries among them.\" Varys started on the explanation, \"However…most of them are wanderers with nowhere else to go. They are not depended on and do not depend on anyone, so there is no possibility of accidental slip-ups. Of course, they will require a lot more training.\"</p><br/><p>Benjamin nodded his head in reply.</p><br/><p>It was important for this special force to be kept secret. In order to prevent the divulging of information, they could only recruit wanderers with no family. It was their only way to maintain their secrecy.</p><br/><p>However, as long as they underwent strict training under harsh circumstances, even wanderers can eventually be turned into soldiers.</p><br/><p>As for the person-in-charge of training…</p><br/><p>\"Captain Lance, I never expected you to be dragged over here by Varys.\"</p><br/><p>An ex-captain of the knights from Ferelden, Captain Lance had been in a slump after the current general was elected. Therefore, Benjamin had invited him to the Academy of Magic. When the formation of this special force was ready to be carried out, Varys had dragged him in without hesitation.</p><br/><p>Seeing the both of them, Lance immediately went over to greet them with a bow, which was uncharacteristic of him, and said, \"Sir Benjamin, I wouldn’t exactly call it being dragged over. It is an honor. It has been a while since I’ve led soldiers into battle. So, I am extremely thankful to be trusted by you for this task.\"</p><br/><p>Being on a military base seemed to have changed him in some way. Now, he didn’t seem like someone that would joke around with Benjamin, but rather someone who was tightly wound up - even his attitude was as if he were facing a strict monarchy.</p><br/><p>Benjamin was slightly thrown off by the change in behavior but understood that this was necessary for the process of establishing authority in the military.</p><br/><p>And so, Benjamin nodded his head and asked, \"Then… how is training coming along? How long until they’re ready?\"</p><br/><p>\"If you really want them to go to war, then they will need at least another six months.\" Lance replied, \"They have very unfit physiques, so wearing those rune armors to fight against those priests right now is entirely out of the question!\"</p><br/><p>Benjamin messaged his temples, seemingly at his wit’s end.</p><br/><p>Six months…</p><br/><p>His trip this time round had successfully allowed him to painstakingly gain time for this secret force. But to delay it for another six months is just impossible. Unless the Church themselves gave up on their plans of attack, a six-month delay is impossible, regardless of how much trouble Benjamin stirs up for them.</p><br/><p>From the looks of it, this military force would not be ready by the time the Church sends out their troops.</p><br/><p>\"That’s alright. Practice properly, half a year is still half a year.\" Benjamin, however, didn’t let his worries show, instead he patted Lance on the shoulders with a reassuring smile and said, \"After half a year, I believe the entire world will be shocked by you lot.\"</p><br/><p>Lance’s somber face finally showed a hint of a smile.</p><br/><p>\"Of course, they will.\"</p><br/><p>Benjamin nodded his head once again and turned to walk to the soldiers in their formations. These people were all from the town of Academy, so of course, they recognized Benjamin and showed 120% of their prowess by continuing their running with even more energy than before.</p><br/><p>It was obvious to Benjamin that the majority of the people here were indeed quite thin and frail. A bunch of them already seemed to be shaky after the few rounds of running.</p><br/><p>Benjamin cast an Elemental Order – Heal, a light drizzle then fell over the entire base.</p><br/><p>Dedication to honing oneself may be an important part in training, but honestly speaking, with such weak physical strength and with some of them having hidden illnesses, it would be better if Benjamin first guaranteed that their health was up to par.</p><br/><p>Magic could not only replenish their physical strength, it could also improve the health of those who were generally weaker. Overall, it would greatly improve the abilities of this military troop.</p><br/><p>And for the troops bathed in the drizzle, their faces morphed into ones of shock.</p><br/><p>\"What magic is this? It’s going into my body!\"</p><br/><p>\"This is amazing! Sir Benjamin’s magic…I can feel energy coursing from my head to my toes, it feels as if I have an infinite amount of strength!\"</p><br/><p>Lance furrowed his eyebrows and roared an order, \"What are you lot going on about! Continue running! Since Sir Benjamin has already cast a healing spell, then run an extra 50 rounds today! Otherwise, can you lot face Sir Benjamin?\"</p><br/><p>Their protests echoed throughout the base, but they only continued running with more vigor. Benjamin couldn’t help but think of when he first went through military training in Havenwright.</p><br/><p>That was so long ago…</p><br/><p>However, Benjamin could see the respect and gratitude in the eyes of the soldiers when they looked at him.</p><br/><p>As a bunch of wanderers, this secretly organized military force had utterly changed their lives. They now had meals and a roof over their heads, more importantly, their aimless lives were suddenly given meaning.</p><br/><p>They would change the world.</p><br/><p>Despite the fact that they were a bunch of newbies, Benjamin found hope in them.</p><br/><p>While thinking about this, Benjamin stopped his spell with a smile. This was the end of his patrol. The force was slowly shaping up, but they still needed a lot of preparation before they could hope to face the Church’s nearing threat.</p><br/><p>Benjamin then turned and left the forest base with Varys.</p><br/>\n</div>"}