{"title": "Chapter 748: The Start of the Retaliation", "id": 748, "volume": 8, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-748-the-start-of-the-retaliation", "volume_title": "Volume 8", "body": "<h1>Chapter 748: The Start of the Retaliation</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 748: The Start of the Retaliation</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>\"Just a little bit more….\"</p><br/><p>Hidden on top of a tree, Benjamin mumbled to himself, visibly tense as he clenched his fist and listened to the horrifying echoes of slaughter coming from within the woods.</p><br/><p>According to their plan, at least be 75% of the pursuers should be in the designated area before they were too show themselves and retaliate. Thus, the baiting team would face an enormous challenge to try to lure a huge number of pursuers into the woods.</p><br/><p>From what he could sense, the pursuers had already caught up with the soldiers at the back of the troop. Some of them could not even react before they were surrounded and killed; some of them stopped to fight the enemies, dying in the process… This was a scene of pure cruelty, especially when the injured fell off the backs of other soldiers and rolled to the ground in pain. They howled in agony, but none of them survived under the punishing hooves of the cavalry. Their bodies were left unidentifiable on the forest ground.</p><br/><p>Benjamin bit his lips; he wanted nothing more than to jump out and end this, but he needed to hold himself back.</p><br/><p>If the ambush was premature, then it would lose its effectiveness. If they did not manage to greatly weaken the enemy in one strike, then they would suffer immensely in the upcoming battle and face certain defeat.</p><br/><p>Besides, Benjamin had also realized a flaw in the ambush plan.</p><br/><p>The pursuers who followed them into the woods were only the knights. Most of the priests were still flying in the air, looking down at them. They seemed to feel that there was no need for them to involve themselves, and only a minimal amount of them would step into the woods.</p><br/><p>\"Is there any way for us to get the priests into the woods?\" Benjamin asked internally.</p><br/><p>\"Nope,\" answered the System lazily, \"They’re not a bunch of idiots. Why would they waste their spiritual energy if the knights could deal with the trouble themselves?\"</p><br/><p>Benjamin massaged his forehead in an attempt to stop his headache.</p><br/><p>If the priests were unwilling to fly into the woods, then Benjamin would have no choice but to attack them.</p><br/><p>There were almost a thousand priests in the sky, and they levitated like a dense cloud before a thunderstorm. The sheer number of them blocked out the rays of light from the sun, and amongst them were two to three bishops that had to be dealt with as soon as possible.</p><br/><p>Benjamin mapped out their locations in his mind, and gradually prepared himself for the fight.</p><br/><p>Just as the pursuers in the woods took the bait and arrived at the designated areas…..</p><br/><p>Wham!</p><br/><p>An explosion shook everyone in the area as Benjamin blew up the ice layer buried under the ground. It was as if there was an earthquake in the woods; the cavalry was flung from their horses. The other soldiers were shell-shocked as well as they stared at their surroundings, the fear evident on their faces.</p><br/><p>At that very moment, the soldiers of Icor were finally released from their binds as they charged forwards to begin the counter-attack!</p><br/><p>\"Charge!\"</p><br/><p>Cries of war enveloped the earth and the sky, and the prideful pursuers suddenly found themselves surrounded from all angles. The Icor soldiers who were running just seconds ago changed their attitude in a blink of an eye; they turned and barged into the ranks of the pursuers, swords in hand, heart cold as steel!</p><br/><p>\"Kill these sons of b*tches!\"</p><br/><p>\"Avenge General Kent! Avenge our dead brothers!\"</p><br/><p>\"You’re chasing me around, huh? Come then! F*cking chase me again then!\"</p><br/><p>The suppressed anger and frustration finally erupted like a volcano, and it took mere seconds to flood over the dumbfounded knights. Moments before their death, they were probably still confused about what happened. What happened to these soldiers who were helpless just moments ago? Why did they still possess such terrifying morale?</p><br/><p>Not only that, the mages who were in hiding for long finally leaped out and summoned a blanket of magic that covered the area. Numerous spells were fired at the still dumbfounded soldiers, the myriad of lights from the spells chasing the darkness away from between the trees.</p><br/><p>The pursuers could do nothing but break under pressure.</p><br/><p>No matter where they looked, they could only see Icor’s soldiers. Overwhelmed, the sense of order within the pursuers were no more, and they were so overwhelmed that they no longer knew what to do. Instead, they panicked on the spot.</p><br/><p>\"Enemy! Enemy!\"</p><br/><p>\"It’s an ambush! Quick, retreat! Retreat!\"</p><br/><p>\"No! We can never retreat! The will of God is leading us; they are no more than dogs of a fallen house, we should kill them all instead!\"</p><br/><p>It was absolute chaos. Everyone seemed to be shouting something, and even the calvary lead was unable to effectively shout his orders to gather his men. Once the calvary changed from fighting as a troop to fighting for themselves, they were no longer considered an army.</p><br/><p>Furthermore, they were in the woods, a place that brings no advantages to a mounted knight. What’s left to be scared of when a calvary has lost their momentum?</p><br/><p>There wasn’t even a need for Benjamin to take action.</p><br/><p>\"Sh*t! They led us into an ambush in the woods!\"</p><br/><p>The priests looked down from the sky in disbelief. They could not understand where the soldiers of Icor got their courage for a retaliation from after they had been utterly defeated just moments before. What gave them the bravery to set up this trap?</p><br/><p>However, they did not look too shaken.</p><br/><p>\"Bishop Hunt, lead some of your people down there to help them,\" said an elder bishop, his voice calm, \"Ants will always be ants. If we leave them alone for awhile, somehow they will convince themselves that they’re capable of hurting an elephant.\"</p><br/><p>Beside him, a bishop nodded and led a team of priests with a wave of his hand as they flew down to the woods below.</p><br/><p>Immediately, only a couple of dozens of priests and two bishops were left in the air. They looked at the scene beneath them nonchalantly, lazily watching as Bishop Hunt fought teeth and nail with Icor’s soldiers, barely interested in the proceedings.</p><br/><p>\"Our casualties this time will be much higher than usual. We better start thinking about how we will explain that to His Highness the Pope,\" commented a slightly plump bishop.</p><br/><p>\"What’s there to explain? It’s not like they’re the blessed Holy Knights.\" The elder bishop shook his head. \"His Highness the Pope will not blame us either. There’s nothing for us to fear; the most we will face are those rumors that Bishop Harry spreads behind our backs.\"</p><br/><p>\"Bishop Harry…\" The fat bishop snorted. \"As a bishop, the only thing he knows how to do is makeup lies to share around the house. I really don’t know how he even managed to become a bishop in the first place.\"</p><br/><p>The elder bishop did not answer, but judging from his dismissive hum, he seemed to agree with the sentiment.</p><br/><p>However, just as the bishops were busy gossiping about their co-workers, a silhouette suddenly leaped out from the woods below, rushing towards them in a blur.</p><br/><p>\"Wait… That’s-\" The priests and bishops were taken aback.</p><br/><p>Before they could even see who the person was, they instinctively used their magical instruments to summon barriers for protection.</p><br/><p>However, they never expected what would happen next.</p><br/><p>The silhouette did not slow down. Instead, it flew straight towards the elder bishop and went past his Holy Barrier!</p><br/><p>The figure was carrying a dagger which glinted coldly under the moonlight.</p><br/><p>\"What do you think of this surprise?\"</p><br/><p>Benjamin stopped in front of the bishop, no longer in his Intangible Form. Then, he raised the dagger and swung.</p><br/>\n</div>"}