{"title": "Chapter 768: First Day's Curtain Fall", "id": 768, "volume": 8, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-768-first-days-curtain-fall", "volume_title": "Volume 8", "body": "<h1>Chapter 768: First Day's Curtain Fall</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 768: First Day's Curtain Fall</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>However, it was at this time that the runes that were heavily covering the walls of Rock City started to light up.</p><br/><p>\"Fu... Finally fixed.\"</p><br/><p>With the voice of relief coming from the mages, the elements around the city started to gather once again. They seemed to be summoned by something and blended into the gleaming runes. In the end, the runic defense formation was successfully reconstructed.</p><br/><p>Many in the Rock City were filled with joy but only a handful of those were sighs of relief.</p><br/><p>\"Great job.\"</p><br/><p>Benjamin pulled through his headache and nodded at the mages in charge of the formation. His Spiritual Energy was deeply depleted. It was going to be a hard-fought battle and the enemy was prepared for another round of attack. If it weren’t for the runic defense formation, he really didn’t know how to defend the Rock City.</p><br/><p>The people of Icor returned to their senses and stared at the shapeless barrier that was once again shielding them. Naturally, it calmed their nerves.</p><br/><p>Meanwhile, on the other side...</p><br/><p>Those soldiers from the Kingdom of Helius were thrown into disarray.</p><br/><p>\"What….. What should we do now?\"</p><br/><p>Just as they were prepared for the next round of attack, the chasm like runic defense formation appeared again. At that moment, their frustration could be described as when you have the urge to sneeze, yet you fail to do so.</p><br/><p>\"That thing could be repaired?\" General Press’ attack command was stuck at the tip of his tongue. He could only awkwardly stand there and mumble out this sentence.</p><br/><p>It was an embarrassing sight.</p><br/><p>Grant was stunned for a moment and clenched his fists.</p><br/><p>\"How can a simple barrier compete against the will of God?\" He turned to the cannon tent and spat out sharply, \"Fill up the next round of ammunition, we will crash this barrier.\"</p><br/><p>The priest in charge of the cannon of holy light, of course, didn’t argue. He nodded and quickly started the preparations.</p><br/><p>The other soldiers in the Kingdom of Helius were still in a daze, and at the same time tired. However, they did not have any other choice other than to obey the pope’s command. They could only wait patiently for the runic defense formation to be penetrated.</p><br/><p>\"Not giving up?\"</p><br/><p>The executive prime minister that stood on the city wall couldn’t help but frown.</p><br/><p>He thought that the Kingdom of Helius would give up on taking down Rock City at least for today.</p><br/><p>To lay siege until present time, both parties were beginning to become weary, especially the ones that were attacking. It was not uncommon for a war to last more than a night, but that kind of siege should not have been attempted today.</p><br/><p>\"Even though he is the pope, that fella is still too young too hasty.\" The president flew onto the city wall, \"Do not worry, forcefully going on will only waste their energy. They wouldn’t be able to penetrate the runic defense formation.\"</p><br/><p>Everything was just as the president described.</p><br/><p>The cannons of holy light were a powerful weapon, but they couldn’t continuously fire over short intervals. Not only would the commanding priests be drained, but the burden on the cannon would be too overbearing which would eventually decrease its firepower and shorten its lifespan. In other words, the third round of fire couldn’t compare to the firepower of the first round of fire.</p><br/><p>The mages in Rock City gathered together as they dunked elements into the runic defense formation to strengthen its defense. Benjamin, on the other hand, left the battlefield to return to his residence to heal.</p><br/><p>\"They will not be able to move past the gates.\" He explained to the unsettled people, \"Don’t be alarmed by the pope that didn’t die from that stab. That move of transforming to light and disappearing must have drained him. He won’t be able to pull use secret weapons for now.\"</p><br/><p>\"Then we will be at ease.\" The citizens around looked at Benjamin respectfully, \"Director, thank you for everything that you did earlier... You’re awesome.\"</p><br/><p>Benjamin smiled and said nothing more.</p><br/><p>About ten minutes later, the Kingdom of Helius was ready with their attack to attempt to break through the formation. But, when the sixty cannons of holy light and sword of holy light summoned by Grant attacked in unison, the runic defense formation did not budge. The few thousand mages flew to the edge of the city, feeding the formation elements while simultaneously flashing the troops of Helius the finger.</p><br/><p>General Press was fuming but could only go with a couple of bishops to try to persuade Grant. Under the pleading of over twenty high-ranking officials, Grant grudgingly ordered for the retreat of his men.</p><br/><p>After this, the soldiers of Icor carefully swept the battleground.</p><br/><p>\"I think... the odds are still with us.\"</p><br/><p>It was now nighttime and in the municipal halls of Rock City, the executive prime minister nodded at the people that were present at the meeting. He was filled with vigor as he spoke.</p><br/><p>\"During today’s battle, we lost around seven hundred soldiers and about a hundred mages. I lament their sacrifice, but the enemy surely has taken a bigger hit.\"</p><br/><p>The executive prime minister became excited as he waved his arms around like a conductor, \"Although we are unable to count the exact number of corpse outside the city, we estimate that they have lost around two thousand soldiers, six thousand knights as well as two hundred priests! Their loss is more than eight times that of ours!\"</p><br/><p>The audience in the hall couldn’t hold back their excitement either. Some of them even started to applaud.</p><br/><p>Ever since the start of the war, they had plunged into a deep dark abyss of which they thought they would never escape. But at this sudden turn of events, they realized that they stood a chance. This type of feeling was hard to describe.</p><br/><p>\"This retreat... must have that pope in such an interesting mood.\"</p><br/><p>\"And you guys here wanted to call for truce a few days ago. What truce? Do we need to have any truce? We will tear them apart if they step into our territory!\"</p><br/><p>\"If it wasn’t for the help of the magic academy, we wouldn’t be able to survive...\"</p><br/><p>All of them were deep in discussion as they rejoiced carefreely. The atmosphere in the municipal hall has never been this joyful. Even the most conservative officials were fired up with fighting spirit.</p><br/><p>At the same time.</p><br/><p>A few hundred meters away from the municipal hall.</p><br/><p>Under the night sky, the main road near the city gates was piled high with corpses. The midnight wind howled down the empty streets. The air was filled with a putrid smell.</p><br/><p>Two figures walked to the pile of flesh that covered the ground.</p><br/><p>\"... Still unable to locate his corpse?\" After looking here and there, Frank sighed as he stared at Joanna who was still digging around.</p><br/><p>\"It’s alright. You should head back to rest now. I’ll continue to look by myself.\" Joanna did not turn around and simply waved dismissively as she continued looking.</p><br/><p>Frank shook his head.</p><br/><p>\"You really don’t have to do this.\" He spoke with restraint, \"It was his choice to join the fight with the priests. Before the war, he must have prepared himself to be sacred. You need not blame yourself for that.\"</p><br/><p>Joanna turned back and snarled ferociously, \"Shut up. Are you going to help me or not?\"</p><br/><p>\"...I’ll help.\"</p><br/><p>\"Then just look for him. Stop with that nonsense.\"</p><br/><p>\"...\"</p><br/><p>Frank shook his head helplessly. In the end, he shut his mouth and obediently looked through the corpses. Night had fallen so it was inconvenient for them to search; but still, they did not use any magic to light their search, as any rays of light would no doubt reveal any expression that they were trying to mask.</p><br/><p>A few minutes later.</p><br/><p>\"I found it! Is it him?\"</p><br/><p>Frank flipped over a corpse and shouted out.</p><br/><p>Joanna quickly turned and ran towards him. She knelt before the corpse. Her gaze stopped momentarily at the gaping hole in his chest before moving towards the young blood-stained face.</p><br/><p>Dead silence.</p><br/><p>\"... It’s him, right?\" After some time, Frank faked a dry cough and asked.</p><br/><p>Joanna blinked hard as though she had just woken up from a dream. She nodded solemnly.</p><br/><p>\"It’s him.\"</p><br/><p>\"He is...\"</p><br/><p>\"One of my students.\"</p><br/>\n</div>"}