{"title": "Chapter 763: The Bloody Phoenix", "id": 763, "volume": 8, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-763-the-bloody-phoenix", "volume_title": "Volume 8", "body": "<h1>Chapter 763: The Bloody Phoenix</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 763: The Bloody Phoenix</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>\"Flames… More flames.\"</p><br/><p>Joanna’s entire body was wrapped up in the midst of fire and light. Without hesitation, she sent out a fiery dragon, enveloping a priest who had just flown past her. He was wrapped up in layers flames and was burnt into ashes.</p><br/><p>She could not remember how many people she had killed now.</p><br/><p>An unscrupulous battle had always been something that made her the happiest. Controlling fire was a talent she had been born with; every time she saw the flames rise from the palms of her hands, the blood in her entire body would seem to boil at that moment.</p><br/><p>At this moment, her blood was boiling, except that… For an unknown reason, there was no joy in her heart.</p><br/><p>All around her were numerous priests; Holy Light was flying everywhere like a wild animal that had lost control. At first, Joanna had rushed in with her favorite student, but very soon, she had lost sight of the other person. She did not know whether that somewhat handsome young man, who liked to laugh, had died in the battle. She did not have the time to think about those things.</p><br/><p>All that was left before her eyes, in her mind, were enemies, battle…</p><br/><p>This was an extremely blank state of mind. She did not know what on earth she was doing, and was only borrowing her instincts to kill and destroy all the priests she saw. The satisfaction of her blood boiling was gone; the boiling blood had burned her eyes red but had caused her to be devoid of any other feeling.</p><br/><p>Unconsciously, Joanna felt that she did not like having this feeling, but she still allowed herself to be completely engrossed in it. The string named reason in her brain had been burnt up. The more she killed, the more agitated she became.</p><br/><p>\"You wretched witch, go to hell!</p><br/><p>Another figure appeared before her eyes. It was an old man who seemed to be sort of a Bishop, with Bands of Holy Light encircled his head, forming a strange halo like the ones on angels in oil paintings.</p><br/><p>Joanna said nothing. She hated the frightening murals in churches.</p><br/><p>At that moment, a red rune shone and moved in her eyes— ever since she had learned the Runic Law of Medication, her control over fire had increased very quickly. With only a flash of desire in her heart, white flames would appear from the palms of her hands, crystallized into the form of a phoenix.</p><br/><p>Because of the beautiful imagery of being bathed in fire and resurrecting, a fiery phoenix was her favorite high-level magic. After repeated practice, she could now activate the skill without needing much preparation time.</p><br/><p>Along with the violent, strong phoenix, the expression of the Bishop changed immediately from disdain to stunned.</p><br/><p>\"How could this be… Such a young age, only how many years spent learning magic, where does she get such strong spiritual energy…\"</p><br/><p>\"I hate it the most when people say I am a witch,\" Joanna stepped on the fiery phoenix and stared at the other person coldly, \"When I was three months old, my cradle was burnt and destroyed. When I was two years old, I almost lit my own house on fire. They have always said I was someone who brought misfortune… However, my apologies. I might have started learning magic in my mother’s womb, I guess.\"</p><br/><p>While speaking, she rode the fiery phoenix and rushed towards the Bishop.</p><br/><p>Flames encircled her, and grew bigger and stronger during the sprint… Finally, Joanna’s entire body was engulfed in the light of the fire, as though she had completely become one with the flames.</p><br/><p>Such a life-threatening method of attack caused the Bishop to be even more shocked.</p><br/><p>\"This… Lunatic!\"</p><br/><p>At that moment, he was unable to dodge her, so he could only chant his spells in a mad flurry, gathering even more Holy Light on his head. The angel-like halo suddenly started to spin, and slowly descended, blocking him from Joanna.</p><br/><p>However, in the next second, Joanna, entirely engulfed in fire, had crashed in.</p><br/><p>The Bishop could feel the frighteningly high temperature as well as the protective crosses in his pocket beginning to explode one after another. Right after that… In an instant, there was a burst of fatal heat, and then he felt nothing anymore.</p><br/><p>Different from most of the priests and mages who had died in battle, there were no corpses that fell from the skies. There was only a handful of ashes, dispersed in the skies, which were filled with the pungent smell of blood.</p><br/><p>\"Hoo… Hoo…\"</p><br/><p>Joanna slowly stopped, and the white flames emitted from the fiery phoenix also gradually disappeared. Following that, suddenly, a bout of fatigue struck her. She could feel that her boiling blood was displaying symptoms of dissipating.</p><br/><p>Although the attack just now was great, it had also used up a quarter of her spiritual energy.</p><br/><p>As reason began returning to her, she lifted up her head but realized that priests were everywhere. In front of her, behind her, next to her, a few hundred, a few thousands… In the heat of the battle, she had not realized where she had rushed to, and how long she had gone about killing. She did not know why, right now, she could not see a single mage near her.</p><br/><p>Had she gone too deep? Or… Had everyone else perished?</p><br/><p>Just as the last thought occurred to her, she violently sent out flames, burning the priest on her left to a crisp.</p><br/><p>She did not need to think so much. At this moment, she was deep in the area of the priests. No matter how brave she was, the dissipation of her boiling blood had brought about hesitation and doubt, as well as fatigue.</p><br/><p>A fatal fatigue.</p><br/><p>At first, she had thought that her weariness was slight, and there was nothing to worry about, but very soon, she realized how scary this fatigue that seeped out from the depths of her soul was. Even if it was just a little, it still felt as though her entire body was getting swallowed completely inside it.</p><br/><p>She still had spiritual energy, she could still fight, but slowly, she was unable to gather her strength.</p><br/><p>A chill spread from her heart. It was only now that she realized, although she had been red-eyed on her killing spree, so much so that her entire body had heated up, her heart had always been cold, feeling nothing.</p><br/><p>Battle… Suddenly caused her to feel empty.</p><br/><p>\"Kill her! This wretched witch, she has killed Bishop Cullen!\"</p><br/><p>\"She is soon depleted of spiritual energy, go quickly! I know that God watches over all of this, God will not let these evil men with their bloodstained hands go!\"</p><br/><p>\"Kill her! Kill her…\"</p><br/><p>The shouts and yells everywhere reached her ears, making her think of mosquitoes in a summer night. She felt irritated.</p><br/><p>Another white flame erupted and stretched towards the skies; she forced up her spirits and once again, cast out the fiery phoenix. The indestructible fiery light gave Joanna some warmth again, it was so good, she would not die, just like how she hoped that the student who had rushed in with her had not died.</p><br/><p>That rascal… He was not very talented, and every time Joanna had pulled him in for contests, he would not be able to withstand more than a few rounds. It should be impossible that he had gone as deep as Joanna herself.</p><br/><p>He would not die. Joanna thought as such, and although she did not know why yet thinking about how he could still be alive caused a bit of energy to surge out from her heart.</p><br/><p>This bit of energy had helped her to blow up the fiery phoenix violently!</p><br/><p>There were many priests nearby her who wanted to find an opportunity to kill her, but in that moment, they were all destroyed, turned into ashes and smoke. At least a few tens of people perished; no amount of protective crosses could save them.</p><br/><p>The area around her became empty once more. In that second, Joanna lifted her head. She saw even more priests rushing towards her from above. The corners of her lips curled up slightly, as though… She was satisfied.</p><br/>\n</div>"}