{"title": "Chapter 761: A Rancor that Broke Out", "id": 761, "volume": 8, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-761-a-rancor-that-broke-out", "volume_title": "Volume 8", "body": "<h1>Chapter 761: A Rancor that Broke Out</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 761: A Rancor that Broke Out</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Since the Kingdom of Helius chose to attack the city on that day, they could not be unprepared at all. The great scale of Earth Magic did cause their attack a lot of trouble, but in no time, the quagmire ground was covered by the bamboo clappers and corpses, the soldiers carried the stakes for the siege and continued charging forward with no fear.</p><br/><p>Dong!</p><br/><p>An army of people who were charging at the very front had already lifted the stakes and rammed against the gates of city with great force.</p><br/><p>\"Hold them right there! Don’t let them breach the gate!\"</p><br/><p>The screams of the defending leader was heard amidst the chaos. In Rock City, innumerable soldiers gushed towards the gates and supported the main gate with their own bodies and sacks of stones.</p><br/><p>As for the Earth Mages who were guarding the gates, they backed off quietly after casting their magic for a long time, then waited aside to recover their spiritual energy. At the same time, a new group of mages went up to the front line and held the gates.</p><br/><p>\"Wind Mages, Water Mages, attack now!\"</p><br/><p>Following the loud orders given by Benjamin, the green and blue signal flags were waved, both teams of mages who had been patiently waiting all flew up to the sky. Fierce winds, blizzards... Tiers of killing intent were hidden among the elements of both faculties, which were racing towards the enemy!</p><br/><p>Instantly, the attack force from the Kingdom of Helius gave out blood-curdling screams.</p><br/><p>In order to attack the city gate, the entire space was almost packed and filled with soldiers from the Kingdom of Helius. Facing such a dense crowd of enemies, the Extensive Destruction Magic that was gathered from thousands of mages showed exceedingly significant effects at that very moment!</p><br/><p>The huge group of soldiers of the Kingdom of Helius were like wheat in autumn, crop by crop they were reaped by the wind blades and ice arrows.</p><br/><p>General Press became anxious at that time.</p><br/><p>\"What are you doing, flying up to the sky to zone out? Go and fight those mages now!\" He glared at the priests in the sky, but his roars went unnoticed in the chaotic war zone.</p><br/><p>Nonetheless, even if the priests could not clearly hear the instructions, they could roughly guess what they had to do. After both Wind and Water Mages finished their turn, the priests rearranged their troop formation, and charged towards the mages above Rock City without hesitation.</p><br/><p>Suddenly, they flew past the city walls and entered the city.</p><br/><p>The head of the bishop put his hands together devoutly, the Holy Light intersected between their troops and was weaved into a huge airtight net.</p><br/><p>\"Fallen sinners, accept your judgement.\"</p><br/><p>Benjamin was standing on the walls of the city as he watched that happen, he could not help but clench his fist.</p><br/><p>He wanted to attack so badly, to teach those priests who thumbed their noses on Benjamin a lesson. However...even then, he still did not find a sign of Grant among the campsite of the enemy, Grant obviously had more equanimity.</p><br/><p>Being at the edge of the war zone, Benjamin could feel a pair of eyes silently staring right at him - As soon as he made a move, Grant would definitely secretly send him the scariest surprise.</p><br/><p>He must be more patient.</p><br/><p>\"Wind and Water Mages, retreat immediately! Fire Mages, Earth Mages, attack now!\" While controlling those signal flags, Benjamin sent out his orders again.</p><br/><p>Regarding the collaborative war of the mages, they did not train for a very long time. Nonetheless when the real war was here, an intention to kill was shrouded over their mentality, which Benjamin noticed that they performed even better than during training.</p><br/><p>He could feel that, a string was stretched taut in everyone’s heart.</p><br/><p>The hostility that had been going on for months and years, dirty water that were splashed onto their bodies...as if each of the mages had been holding on to those discontentment and indignation, they wanted to vent their anger upon the Church!</p><br/><p>When the Water and Wind mages backed off quickly, the Earth Mages rose up again from the streets below, summoned cob walls, and went head-to-head will the big army of priests who were incomparably bright. A few elderly mages who were among them stretched theirs arms open and even cast some high-level magic one after another, all the defense were ramparted together, as if they were about to welcome the attack of the priests army with heads on.</p><br/><p>Nevertheless, if they were just looking at the numbers, the priests were several times more than them!</p><br/><p>\"Foolish mages, they didn’t even realized how far the distance is between us.\" A bishop sneered at the mages indifferently.</p><br/><p>Before the big army of priests, the gigantic Holy Light Cross was being clustered again - The Union Divine Arts had just destroyed the Runic Defense Technique, thus, their confidence was much greater than it was before.</p><br/><p>The outnumbered mages would not be able to hold against it.</p><br/><p>However, at that very moment, a huge shadow suddenly appeared behind them.</p><br/><p>\"Idiotic Church, how dare you charge in so fast into the home of others, did you really think that we have no more mages left?\" Joanna and the Fire Mages suddenly came out from the group of soldiers, rose into the sky and happened to arrive right behind the priest army.</p><br/><p>The entire team was wearing normal soldier uniforms, some even had helmets that covered half their faces. Just a moment ago they were squeezing together with the other normal soldiers below, carrying sacks of stones to hold the city gates, now, they showed up with violent fire elements stirred up in them, which caught those priests by surprise.</p><br/><p>It was impossible for a group of singing mages to hide right under the eyes of the Church, but at that time, they were in between a chaotic war zone, everywhere was filled with messy surge of magic and deviant elements, no one could tell if the surge came from their side or the opponent’s. Because of that, it was possible to lay an ambush in that situation.</p><br/><p>As for the Fire Mages...they became so frustrated as they were holding back!</p><br/><p>Since the attributes of their magic clashed with Benjamin’s, in the very beginning during the strategy planning, they were arranged to be at the edge, and their chances of attack would be far less than the other three teams. Moreover, they had to disguise themselves as normal soldiers and carefully sing under such chaotic situations, they were about to go nuts from waiting!</p><br/><p>Therefore, when they saw that the pole of red signal flag was waved, their hearts were burning even hotter than the magic in their hands.</p><br/><p>\"Taste our anger!\"</p><br/><p>Instantly, around eight hundred of Fire Mages raided like hot waves, their presence itself had already caused some changes to the surroundings.</p><br/><p>In that way...let alone the high-level magic that they had been brewing in their hands.</p><br/><p>With over thirty high-level magic mixed together with hundreds of intermediate magic, even the sky had turned its color the moment the magic broke out. Flames were pouring out like a tsunami, which gushed towards the priest army with an evaporating heat.</p><br/><p>At that moment, before the priest army were innumerable high walls ramparted by the Earth Mages, behind them was a sea of fire that burned into incandescence. They had nowhere else to go.</p><br/><p>However, they looked like they did not intend to flee.</p><br/><p>\"Holy Light, cleanse everything.\"</p><br/><p>The priest army stopped moving forward and stopped mid-air, each of them put their hands together devoutly and closed their eyes. As the Holy Light hover over them, their movements were so organized that it looked extremely odd, it was like a same person had been copied and pasted countless times, even with the different faces, it gave an illusion that everyone looked the same.</p><br/><p>A steady stream of Holy Light gathered towards the gigantic cross.</p><br/><p>The entire process looked exceedingly slow, but in reality, everything happened within just ten over seconds. When the Holy Light Cross shone as bright as the sun, the sea of fire gathered by legion of magic were also attacking the priests mercilessly!</p><br/>\n</div>"}