{"title": "Chapter 762: A Great, Chaotic Battle", "id": 762, "volume": 8, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-762-a-great-chaotic-battle", "volume_title": "Volume 8", "body": "<h1>Chapter 762: A Great, Chaotic Battle</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 762: A Great, Chaotic Battle</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Very quickly, the magic and divine charms in the skies had completely collided, exploding into a bright, fiery light. The spells casted collectively by a few thousand priests were extremely scary, but with so many mages striking at the same time, it was not necessarily a simple, one-time attack.</p><br/><p>Benjamin stood by the side of the city wall, observing the changes above him, and had a sudden change of heart.</p><br/><p>\"Quick! Grab this chance now, all mages rush over and mess up their formation!\"</p><br/><p>Because there had been no prior rehearsal concerning this sort of instruction, he could only use the amplification method to broadcast these words, with the help of the other mages.</p><br/><p>At this time, the residual powers that were still in collision had not yet dissipated; the mages who heard his instructions were stunned. However, because of Benjamin’s high status, they looked to the intertwining fiery lights and holy light before them, and finally steeled their hearts. Holding their shields up, all of them rushed in.</p><br/><p>The fire mastery, the earth mastery... Even the small team of shadow mastery mages, who had always been hidden and unmoving, rushed towards the priest battalion. There was no planning of attacks; the mages fought as they were. The troops, which had gone through difficult training to achieve the least bit of organization, had become unruly again at this moment, no different from a plate of dry sand.</p><br/><p>Nevertheless... What Benjamin wanted was just that. A plate of dry sand.</p><br/><p>Following the dissipation of the fiery light and holy light, the priests, who had been beaten down somewhat badly by that round of attack, was now unable to put up their defenses in time; they were already being smashed and divided by mages that came from every direction!</p><br/><p>The airspace above Rock City was plunged completely into a chaotic battle.</p><br/><p>\"Union Magic, huh? Let’s see how you plan to do that now!\" Benjamin, seeing this scene, could not help but reveal a slight smirk.</p><br/><p>The uniformity of the priest battalion was, apart from the number of their men, their greatest strength. Although the mages had gathered together, despite some difficulty, and had even come up with a few smaller troops, but it was still their habit to fight individually.</p><br/><p>In reality, when it came to individual capabilities, Benjamin felt that they had more aces amongst the mages than amidst the priests. There were already many incompetents amongst the priests, only there to make up the numbers by joining the formation of the Union Magic. Like a watertight steel plate, this had not much of an effect.</p><br/><p>And now, this ‘steel plate’ had already been smashed up by the mages’ forceful attacks.</p><br/><p>\"Quite troublesome... They are rushing in as though they care not for their lives. It is impossible for them to cast Union Divine Charms now.\" Hidden in the back ranks of the Kingdom of Helius battalion, Grant could not help but furrow his brow when he observed the situation.</p><br/><p>When the priest battalion had successfully charged into Rock City, he had felt that victory was in his hands. But he had not imagined that within these short seconds, such a change so big could happen.</p><br/><p>As for the fight between the priests and the mages... There was an important meaning to the entire battle!</p><br/><p>Because of that, Grant took a few steps forwards, feeling somewhat unable to constrain himself.</p><br/><p>\"Your Highness the Pope, please be calm, the devil has not yet struck!\" A priest beside him hurriedly advised, \"Once you fly there, you will immediately fall under that rascal’s surprise attack. Please, do not act rashly.\"</p><br/><p>Hearing this, Grant took a deep breath and suppressed the aggressiveness in his heart. He did not fly out directly.</p><br/><p>\"...Things are not as optimistic as General Press had planned.\" His sight swept over the entire battle scene; after a few moments of silence, he spoke thus.</p><br/><p>The formation of the priests had been completely undone, and they were in the midst of chaotic conflict with the mages. Because of that, although they had the advantage of numbers, they still might not have the last laugh.</p><br/><p>In addition... Even if they won, their losses would definitely be great.</p><br/><p>At the same time, the soldiers were still charging at the city gates of Rock City. At this time there were no mages to stop them; the battalion of the Kingdom of Helius had finally reached the area outside the city walls, and was using a wooden ram to continuously smash into the sturdy gates. The other soldiers, under the instructions of General Press, hastily built ladders, doing their best to climb up the walls.</p><br/><p>Only, the steep slope of Rock City’s terrain had greatly hindered their attacks. Every time the wooden ram hit, the soldiers carrying it moved as though they were climbing a mountain, which diminished their collision force by a huge amount. Arrows fell from above the walls like rain, and boiling hot water was poured on the heads of soldiers. So far, none of the soldiers had successfully reached the top.</p><br/><p>Faced with such a worrying battle scene, Grant felt somewhat anxious now. He did not know how long it would take for them to take over this damned Rock City!</p><br/><p>\"Your Highness the Pope, do not rush, we have used the Holy Light Shields to block the enemy troops’ catapults.\" A priest on the side hurriedly advised and consoled, \"After ten minutes... Just ten more minutes, the new Cannon of Holy Light will be completely charged, and we will be able to raze Rock City and the mages inside to the ground!\"</p><br/><p>Hearing this, Grant nodded, and turned around to look at the sixty Cannons of Holy Light behind him. The expression on his face finally softened.</p><br/><p>However, he still did not look too good.</p><br/><p>After all, they seemed to have to pay a price bigger than they had calculated, in their plans to conquer Rock City.</p><br/><p>\"A, a lot of blood, a lot of dead people, good heavens...\"</p><br/><p>The two siblings from the worshippers across the sea stood by Benjamin’s side. At this moment, they were watching the corpses piling up outside the city, as well as the priests and mages in the skies who were beginning to fall. Their faces were ashen white.</p><br/><p>Suddenly, the young girl’s gaze fell on the spirit sparrow on her shoulder. She gritted, and spoke: \"Honorable mage... We want to fight too!\"</p><br/><p>Hearing this, Benjamin turned his head.</p><br/><p>\"You want to fight too? Are you serious?\"</p><br/><p>These two psychic spellcasters were the only teachers of their kind in the academy; before they could raise a new batch of psychic spellcasters, Benjamin was even hoping that they would not join any fights. They were brought to the battle because they were, in any case, safer next to Benjamin.</p><br/><p>Furthermore, judging by their faces now, their past experiences with small skirmishes and fights here and there were obviously not enough to support them through such a huge battle.</p><br/><p>\"En... Yes! We want to fight too!\" Even the cowardly young lad seemed to have made his decision, and suddenly spoke, \"That... Even though we are only two people, but our psychic powers should be able to be used quite effectively.\"</p><br/><p>\"So what? How many soldiers can your spiritual energy help you to control? The priests in the skies, I’m afraid you might not be able to hypnotize even a single one, yes?\" Under such an atmosphere, Benjamin did not hold back with his words, \"I understand your feelings, but in a battle, there is no meaning to the addition of one or two people.\"</p><br/><p>\"But honorable mage, look at everyone around us, they... They are doing their best in the battle!\" The young girl clenched her fists tightly, \"I cannot just stand by the side and do nothing.\"</p><br/><p>\"You can guarantee your own safety?\"</p><br/><p>\"We... Can!\"</p><br/><p>Finally, Benjamin sighed and shook his head helplessly.</p><br/><p>As the commander, he did his best to be devoid of any human emotions as he watched the entire battle scene, and naturally viewed the two battalions as chess pieces that both parties were moving. However... He suddenly realized that, from the point of view of a normal person, these were friends that they had been close with, risking their lives to fight for something they felt was important.</p><br/><p>Every second, someone died, and the intimate memories between them were also smeared into black and white pictures.</p><br/><p>How could they just stand by and do nothing?</p><br/><p>\"Go. Protect yourselves well. You represent something far more important than your lives.\" Benjamin finally said.</p><br/><p>Although the two siblings did not fully understand the last sentence, but having gotten permission, they nodded their heads vigorously, turned around and rushed up the city walls through the stairs without hesitation.</p><br/><p>The Spirit Sparrow began to dance, a horrible screech bursting out from its beak.</p><br/>\n</div>"}