{"title": "Chapter 777: Ambush", "id": 777, "volume": 8, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-777-ambush", "volume_title": "Volume 8", "body": "<h1>Chapter 777: Ambush</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 777: Ambush</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>The real battle began the moment the hidden troops charged out onto the streets.</p><br/><p>The priests were the first to start attacking - almost a thousand of them had laid in ambush in the streets of Regina. At that moment, a huge amount Holy Light gathered and clustered into a flood, which flushed towards the mages in the sky.</p><br/><p>Among them, the bishops leading them were even more prepared, they took out custom-made divine art tools from their sleeves to further strengthen the power of their attacks.</p><br/><p>\"Cleanse every single one of those mages!\"</p><br/><p>A middle-aged bishop shouted at the top of his lungs with a look of fury in his eyes.</p><br/><p>The night attack that took place outside of Rock City had caused them a great loss, although the exact numbers were not known, they had lost many bishops from the attack. As of now, only ten of the eighty bishops that had attacked Rock City with the army remained.</p><br/><p>He could still clearly remember when His Highness the Pope found them on the South hill in Rock City and told them the terrible news, he was so outraged that he could hardly contain his anger.</p><br/><p>Those damned mages!</p><br/><p>It was also because of this, that after quickly seizing Regina together with His Highness the Pope, they used their divine arts and managed to relocate the remaining armies in the Kingdom of Helius to their current location in just a few days’ time. They knew very well that after the people from Icor won the war, they would be so arrogant and conceited that they would attempt to go to Regina. However, this would also grant them an extremely valuable chance for them to strike back.</p><br/><p>Therefore, the entire big army set an ambush in the city. At the same time, they had some people disguise themselves as people of Regina to communicate with Icor’s army and promise them that they would open the city gates on the day of the attack.</p><br/><p>They wanted to purposely lead the army of Icor into an ambush.</p><br/><p>As the bishop watched the sky that was almost completely flooded with Holy Light, he finally felt the sweet taste of revenge. After all the hiding in the streets and suffering in silence, wasn’t this all that they had been waiting for?</p><br/><p>However, when the Holy Light slowly faded away, his face once again turned unpleasant.</p><br/><p>In the sky above the streets, colorful and closely packed magical shields could be seen as the Holy Light dissipated. Clearly, even though the mage army encountered such a huge attack from the Holy Light, they were still relatively unharmed.</p><br/><p>... It was the odd induction powers again!</p><br/><p>The bishop cussed in his heart.</p><br/><p>From what he saw, the setup of their ambush was basically flawless. But according to the information they had, they knew that devil, Benjamin, had a magical induction power which allowed him to sense all sorts of objects that were normally hidden from his vision.</p><br/><p>They wanted to gamble on his powers not detecting them, however, it was a wager which they had lost. Had he not seen through their ambush, those mages would certainly not have been able to summon their shields in time!</p><br/><p>Damn it...</p><br/><p>The bishop felt that it was such a great pity. Nonetheless, he recovered his composure a moment later and stared at the mages in the sky coldly.</p><br/><p>So what if they discovered the ambush? Those mages were destined to die here today regardless.</p><br/><p>Because His Highness the Pope was there.</p><br/><p>Just as he expected, the colorful magic shields in the sky only managed to block off the attack from the Holy Light but did not block off the five light threads that suddenly shot out from the streets below!</p><br/><p>With a whoosh, the light threads plunged through the densely packed mages. Following this, tens of dead bodies fell from the sky - all killed before they could even make a sound.</p><br/><p>This time, Grant did not hold back, he flew up into the sky as he concentrated the Holy Light; it seemed like he alone was about to suppress thousands of mages in the sky.</p><br/><p>The bishop could not help but start to feel excited, he had the urge to pray loudly.</p><br/><p>This was the power of God.</p><br/><p>Because God had gifted them with a holy and flawless radiance, even the most powerful evil mage in the world would not be able to resist such an almighty will.</p><br/><p>But, as Grant was in mid-air, a shadow suddenly leaped out from the right side of the street. With just a few continuous jumps, the shadow sprang from rooftop to rooftop before eventually pouncing on Grant who was covered with Holy Light!</p><br/><p>Instantly, all the mages were shocked.</p><br/><p>\"... You again.\"</p><br/><p>Grant turned around and looked annoyed. A second later, Mile’s dagger was brought so close to his face that it barely grazed Grant’s throat.</p><br/><p>Swish!</p><br/><p>As Grant controlled the six Light Wings behind him, he had managed to instinctively back off and dodge the attack.</p><br/><p>However, it was at that very moment that a small group of people flew out quickly from the formation of the mages. A wild gust of wind rushed toward Grant as the shadow chains were formed out of nowhere; its movement was silent as it started coiling around Grant sneakily.</p><br/><p>At the same time, a gigantic water ball fell from the sky, as if it was ready to completely envelop the pope inside it.</p><br/><p>The bishop who was witnessing all this started to change his expression.</p><br/><p>How dare these filthy mages scheme against His Highness the Pope!</p><br/><p>\"Very interesting. What else did you prepare? Show it all to me.\"</p><br/><p>Yet, when Grant was faced with all the sudden sneak attacks, he did not show even a glimpse of panic. Instead, he laughed coldly and threw his arms wide open as he held up a bright rune.</p><br/><p>The Holy Light was suddenly clustered into an uncountable amount of light threads which promptly surrounded him. As soon as the shadow chains moved closer, they were cut into pieces by the light threads, leaving Grant unscathed.</p><br/><p>On the other hand, the gigantic water ball that fell from the sky was also slashed up by the light threads, leaving it to splash back to the earth.</p><br/><p>It was then that Grant turned his attention towards the few people who flew out from the mage army.</p><br/><p>\"What a coward, did you really have to find more helpers to go up against me?\" Grant ignored everyone else and kept his gaze locked on Benjamin.</p><br/><p>\"Complain all you want, but now, you’ll have to play with us.\" Benjamin shrugged and took out the key from his pocket, \"Isn’t this what you want? It’s with me; if you want it, come get it.\"</p><br/><p>As he said this, he led the army and suddenly flew off in another direction.</p><br/><p>Upon seeing this, Grant grit his teeth in anger.</p><br/><p>\"This must be a trap...\"</p><br/><p>Below them, the bishop mumbled that he felt that something was not quite right. He knew that His Highness the Pope would be able to see that too, but he also saw that His Highness the Pope had his chin tilted upward arrogantly, as if...he did not care about all of that.</p><br/><p>Moments later, he started chasing after Benjamin.</p><br/><p>The bishop was a little anxious but there was nothing that he could do. In a flash, the mage army that was before them started their counterattack. Because of this, he could only lead the priests as they continued casting magic; before long, the area quickly turned into a white-hot stage...</p><br/><p>In the meantime.</p><br/><p>Not far from the streets where the ambush had taken place, Grant stopped chasing mid-air. He looked at Benjamin who had stopped somewhere ahead of him, then said in a cold manner, \"Finally not running away?\"</p><br/><p>Benjamin smiled.</p><br/><p>\"I think, you’re the one who will need to run away.\"</p><br/><p>Following this, Miles’ roar was heard from below them. He crouched on the roof of an inn before pouncing towards Grant who was in mid-air!</p><br/>\n</div>"}