{"title": "Chapter 782: The Infiltrators Are Infiltrated", "id": 782, "volume": 8, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-782-the-infiltrators-are-infiltrated", "volume_title": "Volume 8", "body": "<h1>Chapter 782: The Infiltrators Are Infiltrated</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 782: The Infiltrators Are Infiltrated</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>\"In the fight this time, we have gotten rid of close to twenty thousand enemies, captured more than a thousand prisoners, and the attacking troops of the Kingdom of Helius are now down to only a fifth of their original size. I think, this is the time to retaliate!\"</p><br/><p>In the great hall of the Palace in Regina, the general at the bottom had one knee on the floor, reporting in an excited tone of voice.</p><br/><p>Within the great hall, the people who heard him also could not help but nod in agreement.</p><br/><p>After reclaiming Regina, they had cleared up the battlegrounds, pacified the people and rescued the officers and soldiers who had been locked up in the prisons... It took them two entire days, diligently repairing this wounded capital city, before the situation slowly stabilized.</p><br/><p>And so, after two days, they once again gathered in the great hall, discussing their next move.</p><br/><p>\"We still have a lot of territory in the west that has been conquered by the Kingdom of Helius. They have only attacked not long ago, so they definitely do not have the time to build their fortifications. We cannot miss this opportunity, we must seize all of the territory that belongs to us.\"</p><br/><p>Once the general’s report was out, many officers nodded and agreed with him, and someone suggested as such.</p><br/><p>The executive prime minister stood in the middle of the great hall, stroking his beard, and suddenly asked \"What is the situation of the remnant army of the Kingdom of Helius? Where have they withdrawn to?\"</p><br/><p>\"The west plains of Rock City. The spies have sent back news that the leftover enemy soldiers and priests are heading there to gather. It is not clear what they intend to do after they come together.\"</p><br/><p>\"Still gathering....\" Hearing that, the prime minister nodded thoughtfully, saying, \"Since they have not yet withdrawn, that means they still do not wish to give up, and plan to be reinforced with support troops from the Kingdom of Helius, put their forces back together, and continue to attack.\"</p><br/><p>However, by this time, the attitudes of many officers had already become more and more confident.</p><br/><p>\"Our troops are now splendidly magnificent, the support troops from Carretas have also entered Regina this morning. The Kingdom of Helius would be bringing about their own destruction by still continuing to attack!\"</p><br/><p>\"The strength of the Kingdom of Helius army is not that great, if they continue fighting, they will just drag themselves down.\"</p><br/><p>\"Even if that were true, however much more reinforcements they bring, however many we will kill!\"</p><br/><p>Under such high-spirited morale, even the most conservative advocates of peace were in unity, wanting to completely destroy the enemies on the territories of Icor. After hearing all this, the prime minister exchanged glances with the Guild Master, who was on the side, and finally looked to Benjamin, who was leaning against the wall on one side of the great hall.</p><br/><p>\"Director Benjamin, what are your thoughts on how we should launch the counterattack?\"</p><br/><p>The moment these words came out, the officers in the great hall, numbering close to a hundred, also turned their heads, looking to Benjamin in unison with respect on their faces. Everyone fell silent; no one dared say another word.</p><br/><p>—After a series of actions and decisions in battle, Benjamin had won the reverence of everyone there. If it were the past, the Benjamin in their perceptions was a talented mage, the big boss of the Academy of Magic; now, they were almost ready to have Benjamin become their big boss.</p><br/><p>Also because of that, Benjamin’s opinions had become one of the most important things in the entire land of Icor.</p><br/><p>\"En... Then send the troops, I guess.\"</p><br/><p>Being stared at by everyone silently, Benjamin, however, only shrugged and replied casually.</p><br/><p>\"Honorable Director, do you have any special suggestions? After all, the Kingdom of Helius may very well have reinforcements coming, and what we have to face next might, yet again, be another tough battle, I’m afraid.\" The prime minister looked quite astonished, and asked.</p><br/><p>Hearing this, Benjamin lowered his head and thought for a moment, before saying: \"Don’t worry, they won’t be sending reinforcements anymore.\"</p><br/><p>Everyone was stunned.</p><br/><p>\"Honorable Director... Are you so certain?\"</p><br/><p>Benjamin’s countenance was a relaxed one, and he smiled, answering: \"I can’t say how certain I am, but time is almost up. There should be official news coming over within these few days.\"</p><br/><p>Hearing this, everyone looked at each other, some scratching their heads in confusion.</p><br/><p>To say such a thing so confidently, they felt that Benjamin must have some sort of basis. However, right then, they could not figure the ins and outs, and only felt that Benjamin had become mysterious again, for a long time.</p><br/><p>And, that very evening, news came from the frontlines.</p><br/><p>\"Reporting to you, sir. The Kingdom of Helius has begun withdrawing their entire army. From the attacking troops, to the soldiers guarding the cities that have fallen into their hands, all of them are retreating towards the Crusader Gateway. We have sent some units to undergo a probationary chase. There is no ambush at all, and the soldiers who have been captured did not show any signs of rebellion.\"</p><br/><p>Obtaining such information, the officers in the great hall of the palace had on disbelieving faces.</p><br/><p>\"Are those in the Kingdom of Helius not planning to send reinforcements?\" The prime minister continued to inquire the reporting general.</p><br/><p>\"We don’t know why, but the enemy’s reinforcements seem to have….. Been canceled?\" The general answered hesitantly, \"The actual situation is still under investigation, but what we are sure about is that it is impossible for the Kingdom of Helius to continue their attacks now.\"</p><br/><p>Hearing this, the officers stared and gaped; they could not help but turn around, wanting to find Benjamin in the crowd. However, it was only then that they noticed, Benjamin had quietly left the great hall, and was no longer involved in the discussions with the internal office of Icor.</p><br/><p>For a moment, they were dumbfounded, and looked at each other; everyone was speechless.</p><br/><p>As for Benjamin himself...</p><br/><p>\"Everything’s been packed up, let’s return to the academy soon.\" In the mages’ camp outside of Regina city, Benjamin nodded at the crowd, saying, \"We actually had a nice little two month break, but one month had been all messed up, so I will not assign any holiday homework for you guys.\"</p><br/><p>—After the end of the battles, it was no longer necessary for them to stay on, so they could return to the academy for a good rest.</p><br/><p>He was clear, in his heart, that the Kingdom of Helius did not have any way to continue on with the war. And all of this could be attributed to the letter that Benjamin and the two siblings had forged at the start of the battle.</p><br/><p>At that time, he had found a flamen that came from the worshippers across the sea in Regina, and after killing him, obtained the stamp that the flamen had kept on him. Because of that, he had used the stamp to forge a letter, and in it, greatly exaggerated the massacre the Church had committed towards the worshippers from across the sea, and pointed out that the Kingdom of Helius would soon be empty internally, and it would then be the best time to exact revenge on the Church. After completing his disguise, Benjamin had hired a boat and, going towards the location the siblings had shown him, sent the letter to the worshippers across the sea.</p><br/><p>Having done all this, he had thrown himself entirely into the war between the two countries, counting on the letter only as a backup plan and not hoping for too much. However, following the series of defeats that the Kingdom of Helius suffered, there had been mobilization of reinforcement troops from the home country. And thus, Benjamin realized, that letter could be playing a huge part.</p><br/><p>—The more the Kingdom of Helius sent their people towards Icor, the emptier the internal defenses would be. If the worshippers from across the sea were successfully provoked, even this homeland of the Church would not be safe.</p><br/><p>Because of that, he got the members of the Black Ops of the Academy who were hiding in the Kingdom of Helius to especially take note of the developments in this aspect, and a few days ago, they had sent news to Benjamin— there seemed to have been some commotion in a few of the cities by the sea, and at the same time, there had been cases of priests going missing for no reason.</p><br/><p>At that moment, Benjamin finally put down the huge rock on his heart, and gave a long, deep sigh of relief.</p><br/><p>The worshippers from across the sea had taken the bait!</p><br/><p>The enmity between the two were not justifiable; the feuds between the Church and the worshippers from across the sea were already aplenty, and those people specialized in psychic tricks. Even the Church would not fare well when caught off guard. In reality, Benjamin even sort of wished to see the worshippers from across the sea successfully control the royalty of Helius, and turn the Church into a cult.</p><br/><p>That would be really fun.</p><br/><p>Thinking about the looks on the priests faces when they returned to the Kingdom of Helius, Benjamin almost laughed aloud.</p><br/><p>However, he was also very clear that the retreat of the army by the Kingdom of Helius meant that the Church had already discovered the infiltration of the worshippers from across the sea. This round of vengeance would unlikely be able to shake the foundation of the Church.</p><br/><p>But... This was nothing to be unsatisfied about.</p><br/><p>Whatever it was, they had kept Icor secure.</p><br/><p>Under the light of the setting sun, Benjamin looked to the distance, seeing the sparse figures walking on the main road. Those were the fleeing common folk who, after wandering about for countless days, could finally turn around and head back to their own hometowns.</p><br/><p>Watching them in the distance, they looked like rows of matches. There were not many of them, grouped up in threes and fives. Some were tall, some were short. They slowly walked along the horizon, their shadows stretched out long on the dark brown earth.</p><br/>\n</div>"}