{"title": "Chapter 796: Ancestral Sleeping Ground", "id": 796, "volume": 8, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-796-ancestral-sleeping-ground", "volume_title": "Volume 8", "body": "<h1>Chapter 796: Ancestral Sleeping Ground</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 796: Ancestral Sleeping Ground</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Two shamans were crushed by the ice blades and fell to the ground before they could even answer.</p><br/><p>\"... Let's go.\"</p><br/><p>Benjamin glanced at the bodies on the ground coldly and waved his hand so that the soundproof ice hockey ball also encapsulated the two siblings. After this, he even thickened it by a few layers to ensure that it was foolproof before he started moving forward.</p><br/><p>The two siblings nodded nervously.</p><br/><p>All they could see was a dark and deep tunnel in front of them. No one knew exactly what would be inside the cave. Ghost, magical beasts... or perhaps, scarier, unknown beings. Just in case, the two siblings released their spiritual energy and attached it to the ice wall for an extra layer of protection.</p><br/><p>After they entered the tunnel, Benjamin lit a torch. The light pierced the ice hockey ball and barely illuminated the tunnel.</p><br/><p>The tunnel was made out entirely of rocks the walls were smooth and narrow, which looked extremely unnatural. The tunnel was probably not formed naturally - it was as though something had carved its way through the ground in order to create this extremely flat and smooth cave.</p><br/><p>The two siblings knew nothing about the history of the forbidden land, all they knew was that this place had a long history that dated back as long as the tribe itself. This place also acted as a burial ground, when a noble person passes away, their bodies would be thrown into this cave.</p><br/><p>Therefore, Benjamin was prepared to face spiritual beings.</p><br/><p>\"There is freely moving spiritual energy in the air.\" The System suddenly said, \"Interesting, I've never seen spiritual energy in this form. The particles that have lost control should have dissipated, but for some reason, they are still joined together and have now formed a stable structure.\"</p><br/><p>Benjamin’s interest piqued as he asked, \"What structure?\"</p><br/><p>\"There are triangles and circles... it’s funny, their stable structure is very similar to that of the runes that represent major elements.\"</p><br/><p>Benjamin could not help but raise his eyebrow when he heard this.</p><br/><p>It was definitely not a coincidence.</p><br/><p>He became a little more alert -- the ancestral sleeping ground was a lot more complicated than he initially thought.</p><br/><p>They flew for about five minutes before they started to approach the end of the tunnel. The soundproof ice hockey continued to float cautiously through the cavern when suddenly, Benjamin saw some light from outside seeping into the cave.</p><br/><p>However, at the same time, he felt a rise in temperature, even from within the ice hockey ball.</p><br/><p>\"That... what is this?\"</p><br/><p>The girl got close to the ice wall, looked downwards and gasped.</p><br/><p>When they gazed downwards through the ice hockey ball, they saw a very spacious and huge cave, the bottom of which was covered in dark red sticky magma. The magma was flowing rhythmically, causing Benjamin to feel that it resembled the flow of blood. It pulsed weirdly, almost as it was some sort of… life force?</p><br/><p>However, Benjamin’s intuition told him that \"life force\" was not the appropriate term.</p><br/><p>The rich spiritual energy was heavy with the smell of rotting corpses. Benjamin could feel his chest tightening, but he could still withstand the stench. The two siblings, however, suddenly fell to the ground with a deep sense of fear and panic on their face, it was as though something was choking them.</p><br/><p>\"What's wrong with u guys?\" Benjamin quickly asked.</p><br/><p>\"I don’t know... I’m feeling a little uncomfortable and it’s getting hard to breathe...\" The young boy choked out.</p><br/><p>Benjamin saw this and quickly maneuvered the ice hockey ball to the top of the cave, eventually stopping somewhere near the roof of the cave. The concentration of spiritual energy here was much thinner, and the two siblings were relieved as they slowly returned to normal.</p><br/><p>They could barely stand up and would not stop taking deep breaths; it looked as though their lives were no longer in danger.</p><br/><p>\"This... this place is terrifying!\" The two siblings came back to their senses and exclaimed almost perfectly in-sync.</p><br/><p>Benjamin was troubled.</p><br/><p>He did not think that the inside of a cave could look like this.</p><br/><p>The so-called ancestors, were they not just another type of spirit? Logically, as long they destroy the spirits, the illusion will also be destroyed. However, he did not notice any signs of spirits here – there was just a large pool of magma and an extremely oppressive spiritual energy.</p><br/><p>Where were the ancestral spirits? What was the relationship between this place and the illusion?</p><br/><p>Benjamin looked downwards. He felt that there might be some clues in the magma, but it would be difficult for him to withstand such high temperature and pressure.</p><br/><p>He hesitated for a moment, then summoned a large number of ice arrows before shooting it towards the magma.</p><br/><p>Whoosh! The ice arrows flew downwards, but quickly melted under the high temperature, eventually dissipating before they even touched the magma. It did not really make any impact.</p><br/><p>\"...\"</p><br/><p>Benjamin coughed dryly to try to hide the embarrassment, then cast an elemental command • destruction.</p><br/><p>A magic wind storm was formed, accompanied by the continuously accumulating water elements in the air. The high temperature inside the cave did not suppress it. Benjamin even drew out water elements from his space of consciousness and constantly poured it into the storm to prevent the water elements from running out in this volcano-like cave.</p><br/><p>He prepared the elemental wind storm for about ten minutes.</p><br/><p>In the end, a tornado made up of a countless amount of destructive magic was slowly formed on top of the magma. The original huge tunnel did not look very spacious anymore.</p><br/><p>\"Sir Benjamin... is actually that powerful.\" The two siblings gawked at the huge elemental wind storm below them and were stunned.</p><br/><p>The System could not help but pop up and remind him, \"Hey hey hey, be careful! Although they said that is a dormant volcano, but it would cause immeasurable damage if you accidentally cause it to erupt!\"</p><br/><p>Benjamin heard this and was a little hesitant but remained firm on his decision.</p><br/><p>\"Water magic is being used to lower the temperature, it should not cause the volcano to erupt.\" Then, he asked in his heart, \"Moreover, do you have any other suggestions on what to do?\"</p><br/><p>\"This...\"</p><br/><p>\"Moreover, even if the volcano were to really erupt, it is not necessarily a bad thing.\" Benjamin continued, \"I am confident I will be able to protect myself. As for what will happen outside, although I can’t say for certain, I think it will certainly be very interesting.\"</p><br/><p>\"...\"</p><br/><p>The System was left speechless.</p><br/><p>Benjamin was very determined about his plan. He carefully controlled the elemental wind storm and slowly move it towards the magma. For some reason, he had a feeling that there was more to this so-called \"Ancestral Sleeping Ground\".</p><br/><p>However, as the elemental wind storm gradually approached the magma, the magma that was flowing at its own pace started to move about on its own too.</p><br/>\n</div>"}