{"title": "Chapter 794: Rescue", "id": 794, "volume": 8, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-794-rescue", "volume_title": "Volume 8", "body": "<h1>Chapter 794: Rescue</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 794: Rescue</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>After they left the village, the guard’s captain began to realize that something was probably not right two minutes later.</p><br/><p>\"Wait, you... I have not seen you before, are you from our village? Or you came from the neighboring island?\" He asked telepathically while running behind the messenger.</p><br/><p>However, they did not realize that the temperature around them have begun to drop...</p><br/><p>At the same time, the young boy who can no longer move and the girl who was in despair suddenly realized something, and they were both surprised.</p><br/><p>This-this…...</p><br/><p>The messenger stopped abruptly, and the messenger who was wearing a guard’s outfit looked extremely unfamiliar in the eyes of the guards. A weird feeling emerged in their heart, but when they noticed that something was wrong, it was already too late.</p><br/><p>Hooo... In a trance, it was as if they were hit by a cold wind.</p><br/><p>Subsequently, no one clearly saw what happened, and a few life-like ice sculptures were formed in the forest. Other than the two siblings, everyone was frozen.</p><br/><p>The girl immediately cried out.</p><br/><p>\"Mage Ben-Benjamin…... You're finally here!\"</p><br/><p>Benjamin who disguised himself as a guard turned around, took off the cape, smiled comfortingly and said softly: \"I'm sorry, I'm late.\"</p><br/><p>Ever since he found out that the siblings were captured, he was tailing the guards for quite some time and thought of a rescue plan.</p><br/><p>—— Along the way, he did not see any flamens or elders’ level figures, so Benjamin felt that it will be difficult for others to see through his facade. And similarly, he still did not know what was happening on the island, therefore, he did not want to expose himself, which was why he did not make a move in the village.</p><br/><p>He hid himself, took another route and found two isolated guards near the village. After he took down the guards, he stole their uniforms and lured the guards with fake military information.</p><br/><p>To be honest, the whole process was easier than he thought. The social hierarchy of the island was oddly distinct, and there was a strong sense of obedience among the guards. Moreover, since they were rarely exposed to the outside world, all Benjamin had to do was make use of the \"elders’ orders\", and they were caught off guard.</p><br/><p>Therefore, Benjamin successfully rescued the two of them.</p><br/><p>He had a lot of questions in his heart, but when he saw the bruises and cuts on their body, he could not bear to question them, so he quickly draw a series of runes. The water elements were condensed into dense raindrops, and fell onto the two siblings, which healed their wounded bodies.</p><br/><p>Two delicate ice blades flew out of his hands and slashed open the rope around the two siblings’ hands.</p><br/><p>\"Th-thank you...\" The girl broke free and ripped off the wooden ring on her head. Her tears were mixed with the rain while she said with a trembling voice.</p><br/><p>The young boy gradually recovered after being treated, then he got up from the ground and bowed in front of Benjamin.</p><br/><p>\"You are from the magic academy, so of course I have to protect you.\" Benjamin smiled and casually said, \"Don’t worry about it... and tell me what's going on.\"</p><br/><p>The two of them heard it, nodded, and started describing in detail the process how they were captured and everything about the illusion while they were being treated. After hearing what they said, Benjamin held his chin and he was lost into his thoughts.</p><br/><p>In fact, based on the current situation, all the other problems can be put aside, most importantly, where did the people from the Church, the flamens and elders from the overseas Church go?</p><br/><p>Based on the description of the two siblings, halfway through the elders’ interrogation, they were interrupted because they needed to deal with the Church’s invasion.</p><br/><p>The people from the Church were going against the overseas Church?</p><br/><p>However, Benjamin still had doubts. The priests and paladins did not have psychic powers, so how can they be unaffected by the illusion? Moreover, were they not going to attack the altar? But there was no one at the altar.</p><br/><p>In this case, he can actually go back and conquer the village while the overseas Church’s defense was down. However... he had another plan.</p><br/><p>He needed to find out where the battle between the Church and the overseas Church will be.</p><br/><p>\"How are you feeling? Can you move?\" Benjamin turned around, looked at the two siblings and asked, \"We have to find out where are they’re at.\"</p><br/><p>After hearing that, the two siblings took a deep breath and nodded vigorously.</p><br/><p>\"Oh yeah... Sir Benjamin, can I call out to my ancestral spirits?\" The girl thought for a moment and asked.</p><br/><p>----- The so-called ancestral spirits that she said was the sparrow spirit.</p><br/><p>Because sparrow spirits were too eye-catching, before the two of them were captured by the Church, the girl gave it an order to not get too close, and to follow them at a distance. But when the two siblings were captured, the girl knew that it was useless to summon the sparrow spirit, so she made it fly further.</p><br/><p>\"Of course, go ahead and summon it.\" Benjamin naturally had no reason to refuse it.</p><br/><p>He opened up the soundproof ice hockey ball and protected himself, and led the two siblings towards the affected range of the illusion. According to the two siblings, usually, the illusion does not exist, and after the villagers have gotten an approval, they will be allowed to move in and out freely, without being affected.</p><br/><p>As for the reason why there was an illusion which was very similar to the principle of spirits, could it be that... It was one of the overseas Church’s way to defend against their enemies.</p><br/><p>\"I could sense ancestral spirits in this illusion, and I dare not fight it.\" The boy said suddenly, \"I heard that whenever our tribe is in danger, the ancestral spirits will protect everyone with their own way.\"</p><br/><p>Benjamin heard it and nodded: \"I know that there is such a thing, but... I think the way the spirits protect them are through merging with magic beasts, like your sparrow spirt, in order to increase their combat abilities, and not making such a strange illusion.\"</p><br/><p>\"That... probably both methods are used.\"</p><br/><p>\"Ok then.\"</p><br/><p>Benjamin shook his head helplessly.</p><br/><p>The overseas Church’s ways were extremely weird. He found that these kind of tribes which survived many years, no matter how small their scale was, they will surely retain something very special.</p><br/><p>Which was why he was a little worried about the Church.</p><br/><p>At that moment, they have just stepped into the forest. They cannot search aimlessly, and the siblings were familiar with the island's terrain. Therefore, they started to lead Benjamin towards the crack at the north side.</p><br/><p>According to them, there was an extinct volcano at the north side of the village which have never erupted, and it was close to the place where their ancestors were put into deep sleep. The two siblings said that if the entire overseas Church was out to deal with their enemy, they will most likely choose that place to battle.</p><br/><p>As for the Church... Benjamin was not too aware of it. If the people from the church were caught in the illusion, will they be able to defend against their enemy? Those elders and flamens could just easily kill them, right?</p><br/><p>Therefore, they needed to go and have a look.</p><br/><p>\"Be careful, I’m starting to feel some magic fluctuation from in front.\" Suddenly, the System popped out of Benjamin's mind and whispered.</p><br/><p>Benjamin’s eyes could not help but to shine.</p><br/><p>They actually found the right place?</p><br/><p>After they left the forest, they strode into a rugged mountain land. Although the trees were no longer an obstacle, but the ground was filled with potholes, as if it has just experienced a terrible natural disaster. However, the protruding rock walls enabled them to hide themselves.</p><br/><p>When Benjamin looked towards the direction of the extinct volcano that the siblings mentioned, Benjamin suddenly saw a vague flash of light.</p><br/>\n</div>"}