{"title": "Chapter 802: Rescue", "id": 802, "volume": 9, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-802-rescue", "volume_title": "Volume 9", "body": "<h1>Chapter 802: Rescue</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 802: Rescue</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>The bishop turned his head in astonishment.</p><br/><p>All he saw, in the night, were three blurry figures walking out from the corner of the village. One was tall, the other two short. They stopped not far away, smiling, and looking to the crowd of the Church's people with slightly mischievous expressions.</p><br/><p>The priests were forced to stop advancing in attack.</p><br/><p>\"That's...\"</p><br/><p>After ascertaining, the Bishop realized, in utmost shock, that the three opposite of them were the captives they had brought onto the ship with them— the three young people who had come from the cult, causing the octopus attacking their ships to retreat, and were finally tricked by the bishop to go aboard the ship, and even forced by them to point out the sea routes.</p><br/><p>As though a cold bucket of water had been poured onto him, the bishop's excitement disappeared instantly. At that moment, he even thought that he had come up with some illusions, and his right hand, which was holding on tightly to the cross, suddenly trembled.</p><br/><p>How could these three people appear here?</p><br/><p>They were clearly locked up in the ship, and special materials had been used to lock up their spiritual energy. Logically, it was impossible for them to utilize any psychic powers, and it only made sense that they could only sit in the ship’s brig obediently.</p><br/><p>Because the situation was too strange, the bishop was unable to think things through in that moment. A horrible premonition surged up in his heart, he did not know what had happened, but... Something was wrong.</p><br/><p>What had happened over at the fleet?</p><br/><p>The bishop himself was already shocked like this, not to mention the other priests on the scene. Seeing that they were about to cleanse all the cultists, and yet, such a turn of events had occurred at this time. The people who could not possibly appear, had appeared, and because they were overly shocked, everyone was plunged into silence at this moment.</p><br/><p>The villagers, escaping death this time, were rooted on the spot, staring blankly at those three people in sort of a daze.</p><br/><p>\"What are you staring there for? Too happy?\" Seeing the people of the Church motionless in their spots, not saying a word, Benjamin sneered, and said, \"You don’t have to be too astonished, the real surprise is yet to come.\"</p><br/><p>Saying thus, he summoned a water ball, and hit it onto his own face. The water flowed under his subtle manipulation, and in a few seconds, washed off his disguise cleanly.</p><br/><p>That face, fresh in all of the priests’ memories, was revealed.</p><br/><p>\"It’s... It’s you!\"</p><br/><p>Seeing this, the bishop’s expressions kept changing. At first, it was disbelief, followed by confusion and doubt, and lastly, that white, pale face even began to turn green.</p><br/><p>\"That’s right, it’s me.\" Benjamin nodded, saying casually.</p><br/><p>At that moment, the bishop seemed to have suffered some kind of great humiliation, and, pointing at Benjamin’s nose, he roared in anger: \"You... Shameless fellow, you dare trick us!\"</p><br/><p>\"Thank you, I’m just that shameless.\" Benjamin smiled, \"What? Really angry? Weren’t you so thrilled when you locked the three of us up in the brig?\"</p><br/><p>The bishop’s face sunk, and turned from white to green.</p><br/><p>\"...Do you really think that coming out here alone, we would be scared of you?\" He seemed to loath Benjamin with every fiber of his being; every word he spoke spat out from the slits between his teeth.</p><br/><p>Benjamin squinted his eyes: \"You wish to fight me?\"</p><br/><p>The bishop scoffed, and suddenly raised the cross, yelling: \"Relic in hand, everyone, listen to my commands, wipe off this horribly sinful mage completely off this world!\"</p><br/><p>Tens of priests obeyed, putting their hands together.</p><br/><p>In the next second, they turned around in unison, and, caring no longer about cleansing the worshippers from across the sea, and ran helter-skelter in all directions.</p><br/><p>\"...\"</p><br/><p>Seeing the bishop flee like a madman right after he acted so tough, Benjamin was speechless for a moment.</p><br/><p>However, he did not intend to let any of the priests there go.</p><br/><p>The water elemental domain was opened, and Benjamin flew into the skies; a huge draft of snow suddenly drifted through the pitch black skies. The villagers huddled up together, lifting their heads in alarm, but then discovered that the snowflakes falling had extremely sharp edges.</p><br/><p>The snowflakes swept over lightly, flitting past every priest who was fleeing in a panic. The defensive crosses were activated without warning, and the shields shattered into pieces; one by one, corpses fell like falling leaves from midair.</p><br/><p>There were already not many priests left in the Church, and with the heavy snow spreading out like that, very quickly, everyone who was fleeing were buried inside. No one could block anything in this murderous thicket, not even for two seconds. In the blink of an eye, there seemed to have been a rain of corpses in the village, and the streets, already destroyed, were now full of the dead and wounded.</p><br/><p>\"You… You…\"</p><br/><p>After five minutes, the bishop was the only one left in the team from the Church. He stopped in midair, his face ashen grey, and could not speak at all as he watched Benjamin, who was blocking him in front.</p><br/><p>\"The era of the Church has passed.\" Benjamin watched him unsympathetically, saying, \"From the moment you were defeated at the battle of Icor, the Church has lost the right to look down upon the whole land. Nevertheless, you guys still do not seem to have truly realized this, and have even regarded yourselves as the kings of this age, thinking that as long as you lift up your grand heads, everything and every creature would submit to you and bow at your feet.\"</p><br/><p>\"No!\" The bishop, however, seemed to have been agitated, and in an instant, became furious, \"We... We will never wane. God is watching everything, and one day, you will pay the price for the sins you have committed.\"</p><br/><p>Hearing this, Benjamin shook his head, his eyes full of pity.</p><br/><p>\"See, I am right, you have realized nothing.\" He spoke slowly, \"Why do you not admit it? You don’t believe in any god, you are only addicted to that feeling of superiority.\"</p><br/><p>\"Shut up! You...\"</p><br/><p>The bishop was so angry, smoke seemed to be streaming out from his ears and nose, and he bared his teeth, wanting to curse and scold. However, Benjamin interrupted him with a wave of his hand.</p><br/><p>\"Enough, I have no skills to chit chat with you here, go and meet your almighty god.\" He said, as he summoned tens of turbulent water flows. The water surged towards the bishop, and in an instant, covered him up along with the shield of holy light, turning into a huge anti-magic water ball.</p><br/><p>The bishop, stuck inside, was turning white, looked lifeless, like a walking corpse. He did not have the least bit of strength to put up a resistance.</p><br/><p>And so, when the water ball started to spin madly around, mincing up the shield and swallowing up the bishop completely, there were no more hitches. After half a minute, a swollen corpse fell out, crashing into a cart full of firewood.</p><br/><p>The entire village, having been so noisy, was now plunged into a deadly silence.</p><br/><p>\"...you, are you the man the Goddess has sent to save us?\"</p><br/><p>After staying quiet for a long time, someone from amongst the huddled up villagers finally gathered up his courage and took a few steps towards Benjamin, asking carefully.</p><br/><p>Hearing that, Benjamin turned around, and shook his head without expression.</p><br/><p>\"There is no such thing as a goddess in this world. The elders have lied to you.\"</p><br/><p>The villagers stood where they were, dazed, and looked at each other; it was unclear whether Benjamin’s words had shocked them, or they had been awakened to the truth by what he had said.</p><br/><p>However, it was at this moment that the two siblings walked over to the villagers.</p><br/><p>\"The honorable Benjamin is right, the Goddess... She will never come to save us.\" The young girl lowered her head, speaking slowly. \"The things that the elders have said are only to make us slaves for them.\"</p><br/><p>The villagers turned around and, seeing the faces of the siblings, looked as though they had been struck by lightning.</p><br/><p>\"You... You guys... Did you guys not die?\"</p><br/><p>The young girl shook her head, saying: \"We almost did. Benjamin saved us. He is a mage, and this time around, he wants to rescue all of you, and bring you out.\"</p><br/><p>\"But... I saw with my own eyes... You were under guard...\"</p><br/><p>The young girl quietly clenched her fists: \"The guard is dead. The Goddess did not save him.\"</p><br/><p>Everyone was rooted to the spot, not knowing what to say.</p><br/><p>Benjamin descended from the skies, and walked before the villagers, speaking in an abnormally cold voice: \"I only rescue those who can be rescued. Perhaps you feel that my appearance is the goddess’s answer to your prayers, but I just want to tell you that your goddess is a pile of dog shit!\"</p><br/><p>There was an uproar by the villagers.</p><br/><p>Everyone widened their eyes, as though not believing what their own ears had heard.</p><br/><p>Benjamin, however, did not care in the least, and continued to speak: \"Think about all the hardships you have gone through. During the times you were in despair, has the goddess materialized to save you? No. The only ones who can save you are yourselves.\"</p><br/><p>\"Now, tell me. Which of you wishes to save yourself?\"</p><br/>\n</div>"}