{"title": "Chapter 800: A Tragic Death", "id": 800, "volume": 8, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-800-a-tragic-death", "volume_title": "Volume 8", "body": "<h1>Chapter 800: A Tragic Death</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 800: A Tragic Death</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Until the Spirit Sparrow gobbled down the last orb, other than screaming, the ancestral spirit didn’t react whatsoever. The lava below constantly swirled, even more so that it seemed to had descended into an uncontrollable state, unable to form into pillars for attacks.</p><br/><p>The screams of the ancestral spirit however, became softer little by little...</p><br/><p>At last, as the last crimson orb of light was gobbled up by the Spirit Sparrow, the voice of the ancestral spirit disappeared, the lava abruptly calmed down. The entire cavern fell into a dead silence.</p><br/><p>Benjamin stood frozen as he stared at the young girl.</p><br/><p>The atmosphere was tense, the young boy couldn’t help but hold in his breath, his palms slick with sweat.</p><br/><p>\"Phew... looks like it was a success?\"</p><br/><p>Suddenly, the young girl opened her eyes, revealing a tired look in them. The Spirit Sparrow flew up from below, and hovered before the three, aside from its eyes as red as fire and alert, nothing else seemed unusual.</p><br/><p>Benjamin furrowed his brows.</p><br/><p>\"... How are you feeling? What of the essence of the ancestral spirit? Did it disappear?\"</p><br/><p>The young girl listened, hesitated a little, then said, \"The ancestral spirit... seemed to have been devoured by the sparrow. I feel that the ancestral spirit hasn’t been eliminated, yet there seem to be no resistance from it, not sure why.\"</p><br/><p>Benjamin rubbed his chin, didn’t respond immediately, rather he turned to the System in his mind for some answers.</p><br/><p>The System then replied, \"The power of the ancestral spirit was confirmed to be completely devoured by the Spirit Sparrow, now still residing within its belly, with no unusual phenomenon. The conscious state of this young girl is still clear, spiritual energy structure stable, no signs of being possessed.\"</p><br/><p>\"That’s good...\"</p><br/><p>Benjamin heaved a sigh of relief.</p><br/><p>Although he braced himself, but if the young girl was really taken over, he could only resort to murder, killing off this child who had been following him through all this time.</p><br/><p>Fortunately that was not called for.</p><br/><p>\"Then... could you handle the ancestral spirit within its belly?\" Benjamin turned his attention back to reality, and asked the young girl.</p><br/><p>\"I don’t know.\" The young girl shook her head, and said, \"The string of behaviors from the sparrow just now, was already beyond my control. I couldn’t get any answers from it.\"</p><br/><p>Benjamin listened and shook his head.</p><br/><p>Then... what was the point?</p><br/><p>He turned around to glance at the thin barrier at the entrance, it hadn’t dissipated. Perhaps the ancestral spirit hadn’t been utterly destroyed, they couldn’t leave nonetheless.</p><br/><p>However, at this moment, the young girl yelped in surprise.</p><br/><p>\"Wait….. Master Benjamin, the sparrow seems to be trying to tell me something.\"</p><br/><p>Benjamin snapped back, furrowed his brows, then gazed in suspicion at the pair of red eyes of the Spirit Sparrow.</p><br/><p>Only to find that the Spirit Sparrow suddenly perched on top of the ice sphere, emitting an odd sound. Soon after, it opened its beak, spitting out the glimmering Heart of the Souls once more.</p><br/><p>Benjamin was stunned, immediately casted a bubble, and caught the Heart of Souls.</p><br/><p>\"Ah...\" The System suddenly took interest as well, and said, \"This stone is now different from before. Whatever complex substances there was before has been distilled, now all there’s left are bits and pieces of spiritual energy.\"</p><br/><p>As he listened, Benjamin furrowed his brows.</p><br/><p>Distilled?</p><br/><p>He looked at the Spirit Sparrow once more, he didn’t expect however, that this revenant being froze for a moment, then suddenly flapped its wings once more. Soon after, it raised its tail, then made a light smack with it, a cluster of red air was released from the end of its tail.</p><br/><p>\"...\"</p><br/><p>The voice of the ancestral spirit seemed to be slowly returning, Benjamin was mildly surprised, a thought came across his mind.</p><br/><p>In that instant, he couldn’t care about anything else, he fished out a light elemental crystal from his pocket, shattered it in his palm, then tossed it towards the cluster of red air without hesitation!</p><br/><p>The light elemental crystal shards entered the air cluster, like salt into water, it swirled aggressively in an instant, melting into an odd state, sizzling sounds can be heard from it.</p><br/><p>Rays of light beamed out like static, light elements... seemed to be reacting vigorously with the red cluster of air.</p><br/><p>The siblings barely reacted toward it, their eyes only widened, gazing at the change in the air cluster.</p><br/><p>That moment after, a boom can be heard, like something exploded, the air cluster flashed brightly in white from within, the three of them couldn’t help but shield their eyes from it. Soon after, when they opened their eyes again, the red air cluster and light elemental crystal, completely disappeared in the cavern.</p><br/><p>The three displayed various degrees of surprise on their faces.</p><br/><p>\"... Is it dealt with?\"</p><br/><p>Benjamin scanned his surroundings, and asked doubtfully in his mind.</p><br/><p>As he turned around, he could clearly see that the thin red barrier at the entrance had already begun dissipating. The surge of power gradually dispersed into nothing, revealing the tunnel once more.</p><br/><p>Did this mean the ancestral spirit had been eliminated?</p><br/><p>\"Mmm... that seems to be the case.\" The System replied, \"I don’t detect that bastard’s essence anymore after all.\"</p><br/><p>Benjamin nodded, but his facial expression remained doubtful.</p><br/><p>Just now, perhaps after the Spirit Sparrow devoured the ancestral spirit, it went through the process of digestion. Most unusual however, upon completing digestion, it not only spat out the Heart of Souls after distilling it, it even expelled the ancestral spirit like a fart...</p><br/><p>This was an unbelievable process on its own, Benjamin was rather mystified. However, he couldn’t believe any form of air clusters could dissipate just that, on the off-chance the ancestral spirit could take its shape again from death, as such, he chose to vanquish it with light elemental crystals in that instant.</p><br/><p>— According to the Academy’s research, light elementals was quite effective in subjugating revenant beings, as he witnessed firsthand that spirits were afraid of light.</p><br/><p>However, he was still not quite sure at the moment.</p><br/><p>Was it really vanquished?</p><br/><p>Given that it was an impressive foe, and carried a title as fearsome as \"ancestral spirit\", it then perished in a tragic manner in the end, this was truly odd.</p><br/><p>\"The essence of the ancestral spirit has disappeared.\" The siblings turned around, sensed their surroundings, relief spread across their faces, \"Master Benjamin... you really did vanquish it!\"</p><br/><p>Benjamin rubbed his chin, and scanned around the cavern one more time. This place became drastically different than when he first stepped foot in here, no more of the dancing red lights, no unseen spiritual energies, the bizarre sense of peril gradually disappeared... this place became no different than an ordinary lava cavern.</p><br/><p>The pair of red eyes the Spirit Sparrow had reverted back to normal as well.</p><br/><p>As such, Benjamin could finally relieve the weight on his chest.</p><br/><p>\"Let us go, we should make our way out of here a quick one.\"</p><br/><p>He waved his hand, the Heart of Souls fell into his palm, and tucked it away. At the same time, the soundproof ice sphere transported them, following the entrance’s direction, it began rapidly traveling out. The siblings snapped back to reality, nodded, jolted from their nerve wrecking experience with the ancestral spirit, they returned to the village outside once more.</p><br/><p>Now... the ancestral spirit had been vanquished, the illusion outside should be broken, right?</p><br/><p>Benjamin’s expression quickly grew stern again.</p><br/><p>Through approximate predictions, he had stayed in this cavern for almost two hours. More troubling however, the System commented, after the ancestral spirit revealed itself, those sound waves which created the illusion had gradually dissipated.</p><br/><p>Then... the battle between the Church and the worshippers from across the sea, may had already decisively concluded.</p><br/><p>As he thought about this, Benjamin accelerated his pace. They had wasted much time on the ancestral spirit, on the off-chance it derailed the entire plan, it would surely bring him to a boil.</p><br/><p>Soon enough, the three flew out from the forbidden grounds. The illusion disappeared, outside, the night was as serene as it used to be, Benjamin didn’t pause in his tracks, and made haste in soaring towards the battlefield between the two opposing forces.</p><br/><p>Five minutes later, they saw bodies lay across the land.</p><br/><p>\"Shaman... so many shaman!\" The young girl held her mouth, and yelped aloud.</p><br/><p>Across the expanse of rocky grounds, countless fresh corpses lay, most of them belonged to the shaman of worshippers from across the sea.</p><br/><p>Huge craters can be found dotted around the area, aftermath marks of Holy Cannon barrage can be clearly spotted.</p><br/><p>Benjamin tightened his eyes upon seeing this.</p><br/><p>... The Church won.</p><br/><p>Truth to be told, he expected this would happen. Without the help of the illusion, those priests held a magical relic that subdues psychic powers, the worshippers from across the sea didn’t stand a chance. The troublesome matter now however, was that he don’t know how long ago did the Church won.</p><br/><p>They should make haste in returning to the village.</p><br/><p>No time to tend to the field of bodies, Benjamin took the siblings with him, and rapidly soared toward the village once more.</p><br/>\n</div>"}