{"title": "Chapter 819: How To Restrain the Undead", "id": 819, "volume": 9, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-819-how-to-restrain-the-undead", "volume_title": "Volume 9", "body": "<h1>Chapter 819: How To Restrain the Undead</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 819: How To Restrain the Undead</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Benjamin was shocked; a chill ran down his spine.</p><br/><p>Once the water bubble burst, even without the floating black smoke and the ashen white flames, the raging water elements in the deep sea domain would immediately drown the mages inside to their deaths!</p><br/><p>\"Di- Director… What can we do?\"</p><br/><p>The mages panicked. They hurriedly constructed their magical shields, but they knew that those simple elemental shields were not very effective against the ashen white flames.</p><br/><p>The water bubbles and their shields might dissipate in mere moments. The only thing left for them would be death.</p><br/><p>All of them turned their heads in unison, looking towards Benjamin.</p><br/><p>The situation was urgent. Benjamin did not have the time to think things through; he immediately drew out runes and displayed a line of Elemental Order - Heal. If they were to be hurt by the ashen white flames or the excessively high concentrations of water elements, they could at least rely upon the powerful healing ability of the runes. He could keep them alive for a while longer.</p><br/><p>And he could then find the opportunity to reconstruct the water bubbles.</p><br/><p>As for the bone dragon…</p><br/><p>The moment the deep sea domain was spread out, the powers of the water elemental sprite were completely unleashed as well. Dozens of limited water silks swayed all around it, like vines. It rushed towards the bone dragon at high speed, its tiny body flitting in between the bones. The water silks danced and flew about, forcing the bone dragon to temporarily stop spitting out fire.</p><br/><p>With the sprite handling the greatest concern before their eyes at the moment, Benjamin could free his hands to rescue his companions. Otherwise, they might have been destroyed under the bone dragon's sharp claws!</p><br/><p>And so, after a few seconds, the water elements gathered together quickly after the runes were formed. The condensation created a drizzle that contained a vast expanse of life force. Under Benjamin's instructions, the drizzle slowly fell upon the mages…</p><br/><p>The wisp of greyish white flame had also floated over to the water bubble.</p><br/><p>Smack!</p><br/><p>With a soft sound, the water bubble barely held up against the fire for a split second. Instantly, the overflow of water elements and the greyish white flames surged in. The shields that the mages had summoned lasted all of two, three seconds.</p><br/><p>In the blink of an eye, they were exposed to the high concentrations of water element. Their expressions changed.</p><br/><p>\"Di-director…\"</p><br/><p>Luckily, in the next moment, the healing drizzle fell upon their bodies.</p><br/><p>It was also then that they felt a pain that pierced right through their bodies.</p><br/><p>They felt as though there were things in their bodies tearing each other apart. Perhaps, every piece of muscle about to be destroyed by the water elements were, at the same time, being reconstructed by the strange powers of the other set of water elements.</p><br/><p>In a matter of seconds, they had almost fainted from the pain.</p><br/><p>\"Water bubbles, form!\"</p><br/><p>Finally, Benjamin summoned new protective water bubbles. The concentration of water elements in the water bubbles decreased rapidly, and the mages slowly recovered from the unbearable pain. They were completely covered in cold sweat, and everyone had terrified expressions, as though they had just come out from hell.</p><br/><p>The mages collapsed onto the ground, their bodies so sore that they could not get up for the moment.</p><br/><p>\"Oh… That was so scary, I thought I was really going to die…\"</p><br/><p>\"What, what magic is this now? Even the Director himself can't control it properly, my god…\"</p><br/><p>However, someone began to quickly realize that something was wrong.</p><br/><p>\"...Wait, where is the fire?\" Lara cleared her mind from the intense emotions of having just survived death, and suddenly got up, lifting her head to look around anxiously.</p><br/><p>Nevertheless, she could not see the greyish white fire that had caused them such pain. For some reason, they even felt that the black smoke and the blazing flames surrounding them outside seemed to be pushed back by something, and had dissipated somewhat.</p><br/><p>What had happened?</p><br/><p>The mages were slightly thrown aback. Having just been thrown about on the fringes of life and death, they had no energy at all to pay attention to the fight before them, and naturally did not know what Benjamin had been doing all this time.</p><br/><p>They looked up.</p><br/><p>The healing drizzle that had only been big enough to cover their heads had somehow spread out, enveloping a huge area. Infused with extremely rich life force, the drizzle fell into the flames and black smoke and were burnt, eroding into nothing. Not even the least bit of element was left.</p><br/><p>However, unlike before, the fire and the black smoke did not grow stronger from swallowing so many water elements. The power contained in them seemed to dissipate alongside the drizzle.</p><br/><p>Seeing this, the mages could not help but feel somewhat shocked.</p><br/><p>\"...Healing magic! Healing magic is the weakness of the undead!\" The male mage suddenly came alive, and began to shout.</p><br/><p>Above them, Benjamin heard the shouting and could not help but give a sigh of relief.</p><br/><p>\"Good thing they're still alive.\" He glanced at the mages, muttering.</p><br/><p>While the water bubbles and the shields had been breaking, Benjamin had felt extremely tense. The Elemental Order - Heal might have reduced the destructive properties of the water elements, but the greyish white flames could very likely become the biggest factor in tilting the balance.</p><br/><p>Nevertheless, what he had not expected was how, as the drizzle scattered down, the flames had drifted on and on, and had been extinguished.</p><br/><p>In that moment, Benjamin had almost gaped in amazement.</p><br/><p>Even the System had been astonished by the sight, and shouted in a loud voice, \"This… Your water elements are not being swallowed up by the fire! It's the life force inside them! The life force and the unknown energy within the fire are canceling each other out!\"</p><br/><p>After a moment's stunned silence, Benjamin had immediately realized that he had found a sliver of hope for survival in a hopeless situation!</p><br/><p>After covering his companions with new water bubbles again, he immediately controlled the runes to combine the Elemental Order and the deep sea domain. Immediately, the vibrant, lively drizzle was extended to every corner of the domain! The raging flames were immediately suppressed, and the runic technique that had been made smoky by the thick, black smoke began to slowly light up again, as though it had been moistened.</p><br/><p>\"...Why have I not thought of this before?\" Watching as the tables were being turned, Benjamin could not help but ask in his heart.</p><br/><p>Using healing magic against the undead, was it not… something he could have easily thought of?</p><br/><p>\"This is a bit mysterious.\" The System babbled. \"The healing ability of magic should come from the special structure of the elements, but the unique energy of the undead creature, I am unable to study properly. Perhaps the structure of the elements and the energy of the undead produce a counteracting effect upon each other. I'm not so sure…\"</p><br/><p>Hearing that, Benjamin took a deep breath and shook his head.</p><br/><p>Whether or not he understood it, it was not the main issue before his eyes now. The main point was that they had opened a way to break through a dead end. If the Elemental Order - Heal could really restrain the undead, then the circumstances of this battle could be completely changed!</p><br/><p>\"Roar!\"</p><br/><p>About the same time Benjamin had used the healing drizzle to slowly suppress the fire and the black smoke, there was a sudden roar of anger. His focus was once again drawn towards the bone dragon.</p><br/><p>It flicked its tail up, and the tail vertebrae flashed like a long whip. Just as the water elemental sprite was flying past the top of its head, it was accidentally hit by the tail of the bone dragon!</p><br/><p>Benjamin's heart momentarily stopped.</p><br/><p>Through their spiritual connection, he seemed to feel a burst of searing pain emanating from his head.</p><br/><p>\"Come back!\"</p><br/><p>He immediately released a command mentally. The sprite did not wish to fight, and after it had been thrown off, flapped its wings and staggered to maintain balance. It then whooshed back to Benjamin's side.</p><br/><p>With a flash of blue light, it fled into the space of consciousness. Its ability to fight had apparently been lost.</p><br/><p>Benjamin lifted his head and looked at the bone dragon, coldly staring into the soul fires within the eye sockets, as they glared back at him.</p><br/>\n</div>"}