{"title": "Chapter 814: An Advanced Level of Magic Immunity", "id": 814, "volume": 9, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-814-an-advanced-level-of-magic-immunity", "volume_title": "Volume 9", "body": "<h1>Chapter 814: An Advanced Level of Magic Immunity</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 814: An Advanced Level of Magic Immunity</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>\"Ka ka ka ka ka…\"</p><br/><p>Seeing its own attack miss, the lower jaw of the revenant opened and closed, emitting all sorts of strange and jarring noises. It seemed to be trying to speak, but unfortunately, Miles and the mages would definitely not understand it.</p><br/><p>The language barrier had determined the impossibility of communication between them.</p><br/><p>Right then, the mages were busy extinguishing the flames that the revenant had sent out at the beginning. How would they have the time to examine the revenant's responses?</p><br/><p>They had tried water magic and dark magic, but no matter what they attempted, the ashen white flames grew and burnt even brighter, like fire doused with petrol. The light reflected on the mages' faces made them look deathly pale.</p><br/><p>\"This fire… This fire is completely different from magic. This will not work, dismiss that layer of shield, or the flames will swallow all of you up!\"</p><br/><p>A sudden shout came from nearby. The mages turned their heads in unison, only to see Lara flying out from the thick forest, yelling loudly at the mages.</p><br/><p>The mages were stunned for half a second before coming back to their senses immediately. They hurriedly changed their positions and dismissed their magic, letting the elemental shields turn back into freely dissipating elements. However, what made them feel even more confused was how even the dissipation process of magic seemed to be different under the influence of the ashen white flames.</p><br/><p>Because… The elements did not truly disappear, but were swallowed by the ashen white flames and burnt into nothing.</p><br/><p>The flames had completely destroyed the elements.</p><br/><p>The fact of the matter shocked the mages. They really wanted the opportunity to find out the principle behind this, nevertheless… Now was not the time for them to organize a research team.</p><br/><p>\"Mage Lara, why have you come here? Aren't you…\"</p><br/><p>\"I felt the magical oscillation, and indeed, you guys are in trouble.\" Lara stopped, and spoke in a low voice. \"Don't worry, the revenants nearby have not been alerted, so there won't be any more enemies coming over for now.\"</p><br/><p>Hearing this, their stress eased slightly. However… Not a single one of them looked the least bit relieved.</p><br/><p>The abilities of this intelligent revenant were far beyond what they had imagined. Not only had it escaped their attacks in an instant, the ashen white flames were even able to destroy elements. This had an extreme impact on their worldview.</p><br/><p>Were elements… Not supposed to be indestructible?</p><br/><p>The male mage stood where he was, dumbfounded. The confidence he had been filled with at the start had vanished without a trace.</p><br/><p>\"...Quite troublesome.\"</p><br/><p>While the mages were freeing themselves from the flames, Miles had not stopped fighting even to the loss of his weapon. He picked up a bone, as long as a staff, from the ground, and he continued to brandish the bone at the revenant. In just half a minute, the rotting body of the revenant had been struck by Miles about a hundred times, and Miles had used up quite a number of bones.</p><br/><p>However, the revenant seemed to be unharmed.</p><br/><p>It resisted Miles' attacks while casting its spells, summoning rotten vines constantly from the ground and sweeping them towards Miles. Miles also noticed that these vines were not made out of elements.</p><br/><p>That was the reason he was not immune to them.</p><br/><p>He was forced to be careful and avoid all attacks, dodging as he retaliated. Fortunately, the revenant's attacks were not so aggressive, and Miles was fast enough to avoid being at a disadvantage in all of this.</p><br/><p>However, the two flames in the revenant's eye sockets were still locked on him.</p><br/><p>Pity, contempt, scorn… He could feel the emotions passing on to him from the flames. It was as though this revenant had completely seen through his life, and was examining his every move with a high and mighty attitude. Miles felt a grievance he had never experienced before.</p><br/><p>For some reason, he mysteriously remembered the scene at the abyss trial. A familiar emotion, one that he did not know how to describe, slowly filled his heart.</p><br/><p>He felt really bad.</p><br/><p>Judging from the current situation, the revenant was unable to deal with him. Even if he had no way of injuring the revenant properly, it still did not pose a too great a danger to him. However… He simply did not feel good.</p><br/><p>\"We've come to help!\"</p><br/><p>Miles had just flashed out of the way of an attacking rotten vine when, suddenly, he heard the voices of the mages not far behind him, wrenching him out from those unexplainable emotions.</p><br/><p>Was he finally getting some help…</p><br/><p>Miles came back to his senses, and sighed in relief. He was well aware that he would never be able to kill the revenant just by relying on himself— the attack of ordinary weapons upon it was less than effective. Perhaps, the spells of the mages would have more effect on it.</p><br/><p>Thus, along with a burst of dark elements, gigantic, black claws appeared over the forest, aiming steadily towards the revenant.</p><br/><p>The revenant, however, ignored it; its gaze was still set on Miles. Sprawls of rotten vines broke out from the earth, targeting only the figure who was continuously flashing about.</p><br/><p>Thus, the black claws fell upon the unwary revenant.</p><br/><p>Boom!</p><br/><p>There was a loud crash. The ground on which it stood had been plummeted into a small hole. Nevertheless, the male mage who had casted the spell was stunned. He stared at the revenant, which had been drowned in dark elements; his expression was one of astonishment, as though he was watching a scene that would once again renew his perspective on magic.</p><br/><p>The mages watching also had shocked expressions.</p><br/><p>All they saw was how, for unknown reasons, the magical structure within the claws instantly dissolved as they came into contact with the revenant. Just like the ashen white flames, the claws broke down into dark elements, which were then absorbed into the body of the revenant. They were not felt anymore and had most probably been turned into nothing.</p><br/><p>Because of that, even if the aftershock of the magic had created a hole in the ground, the claws of shadow were still unable to hurt the revenant in the least bit.</p><br/><p>\"This… Isn't this mercenary Miles' magic-immune physique?\"</p><br/><p>Someone exclaimed in shock.</p><br/><p>Lara was silent for a moment, before speaking suddenly, \"No… This immunity is even more advanced. Not only does it repel elements, it also causes the elements to die, and turns the aura of death into its own power.\"</p><br/><p>Hearing that, the mages carefully observed the revenant a little more, before discovering that the undead aura emitted by the body seemed to have thickened a lot.</p><br/><p>Furthermore, the rotten vines that it could summon at one go had turned from four to five.</p><br/><p>This was a depressing realization.</p><br/><p>\"...Let's retreat.\" Miles turned his head to speak, as he dodged vines, \"The skin of this thing is too tough, I'm unable to hurt it, and your magic is useless. We can only retreat.\"</p><br/><p>To be honest, from the moment he had faced this revenant directly, he had had the desire to withdraw.</p><br/><p>It had nothing to do with how bad or good the situation was, or with the task at hand this time. It was simply an extremely instinctive reaction, an intuition accumulated by years of wandering into danger. Or perhaps, it had to do with the resurfacing of the abyss trial memories… Whatever it was, he did not wish to stay in this place a moment longer.</p><br/><p>\"Follow me!\"</p><br/><p>Lara nodded, indicating her approval of this suggestion. She immediately turned around, beckoning with her hand and shouting for everyone to hurry towards the traps they had set.</p><br/><p>Although they did not know whether the traps would be effective on the intelligent revenant, but… It was better than nothing.</p><br/><p>The other mages did not object, and promptly took off to follow after Lara. On the other end, Miles did the same. He violently lashed out with the rib in his hand and nailed the vine nearest to him to a tree, before turning around and fleeing.</p><br/><p>Soon, the mages had escaped from the area surrounding the white bone house, and were back to the place where they had set their traps.</p><br/><p>\"H-how… Did it follow us?\"</p><br/><p>The male mage turned to look, asking in a slight panic. Fortunately, the forest was empty, and he did not see anything out of the ordinary. The gloomy, strange aura of the undead had also thinned out a lot here.</p><br/><p>Seeing this, the other mages were also somewhat relieved.</p><br/><p>However…</p><br/><p>\"Not good. Where is Miles?\" Lara looked around, speaking suddenly. \"Has anyone seen him?\"</p><br/>\n</div>"}