{"title": "Chapter 830: Progress", "id": 830, "volume": 9, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-830-progress", "volume_title": "Volume 9", "body": "<h1>Chapter 830: Progress</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 830: Progress</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>It was not the contents of the other person's words that surprised Benjamin. He had already been to the Abandoned Valley of Gods, so he knew what it was like. Of course there would be no reason for him to be astonished. He was most surprised at how the Mages Inheritance Union seemed to know everything.</p><br/><p>The Abandoned Valley of Gods had always been a mystery, and not many people knew where it was located. However, Mage Armand had described every secret in detail, and Benjamin had seen them with his own eyes to know that what he said was true.</p><br/><p>This caused an immense interest in the Mages Inheritance Union to well up in him.</p><br/><p>\"You guys… How do you know these things?\"</p><br/><p>\"These are recorded within the ancient texts left to us by our predecessors.\" Mage Armand replied slowly, \"We have passed down these things for three thousand years. I dare not say that these are all accurate, but compared with the other records, we are definitely closer to true history.\"</p><br/><p>\"Why?\"</p><br/><p>\"Because the Mages Inheritance Union is an organization hidden from the world. We do not clash with the outside world and have never been involved with any historical events. Our mutually beneficial ties with other organizations are the least, so our records are usually the most objective.\"</p><br/><p>Hearing that, Benjamin rubbed his chin and knew that there was reason in what he said.</p><br/><p>Only…</p><br/><p>\"Isn't what you're doing now a type of interference with the progress of history as well?\" Benjamin crossed his arms, speaking somewhat helplessly. \"If the Mages Inheritance Union really do not care about anything, then why have you come over especially to advise us about giving up the research on runes?\"</p><br/><p>\"Because runes possess the power to destroy this world. No matter how well we hide, we would not be able to hide from that. I will not keep this from you: The Mages Inheritance Union was once a part of the early Church, however, we have always focused on sealing up all information relevant to rune magic. When those fanatical believers began to stray off even more, we split up from them and have never involved ourselves in anything that happened on this earth.\"</p><br/><p>Hearing all that, Benjamin shook his head as he gave a sigh.</p><br/><p>\"Maybe. Maybe your worries are grounded, but is it true that runes will definitely cause the world to be plunged into disaster? From what I've seen, runes have saved Icor and countless of mages' lives.\"</p><br/><p>\"That is because you've only just begun, and the runes have not yet reached the level where they could affect the flow of elements on a large scale.\" Armand did not give up with his advice, \"If we wait until the moment elemental disasters occur, even more people would lose their lives because of it.\"</p><br/><p>Benjamin, however, shook his head, saying, \"If we really wait until the elemental disasters occur, I believe that we would have possessed the ability to resist them by then. To possess power is already a frightening thing. Giving a child the power to move mountains and fill up the oceans would cause great calamity, but to hand over the same powers to a responsible person, it would be used on the right path.\"</p><br/><p>\"So… Do you think that the people now are matured enough, compared with the people from two thousand years ago?\"</p><br/><p>Benjamin shrugged, saying, \"Perhaps not enough, but if we want to mature, we cannot avoid stumbling and falling. There is always a price to pay for progress, and perhaps many might die in the future, but I'm willing to be the bad guy, because I believe that the quality of life for mankind collectively will improve.\"</p><br/><p>Mage Armand did not seem to comprehend fully, \"Why are you so sure?\"</p><br/><p>Benjamin smiled, and suddenly pulled out a small wooden shield from his pocket. He placed the wooden shield on the table and gave it a light prod. After that, a layer of elemental shield suddenly spread open, covering the entire table within it.</p><br/><p>\"This is…\"</p><br/><p>\"A magical instrument. We used runes to develop it.\" Benjamin said slowly, \"Unlike traditional concepts, this type of magical instrument is prepared for commoners. Even a savage who is utterly ignorant about magic can activate it easily and possess defenses on par with that of a mage.\"</p><br/><p>Seeing this, Mage Armand's face finally showed a hint of surprise.</p><br/><p>\"You are…\"</p><br/><p>\"Yes, we want to bring magic into the world of commoners.\" Benjamin nodded, speaking steadily, \"And this is only the beginning. In the future, we will develop even more kinds of magical instruments, and not just for battle- rune lights, rune millstones, rune plow trucks… When magic has become something that every ordinary person can use, the elemental disaster that humans were unable to avoid two thousand years ago might only be a drizzle to us now.\"</p><br/><p>\"It's similar to how, for the primitive humans, rain might have been a huge natural disaster for them. From hiding into caves, to the invention of the umbrella, this is what we call progress. All we need now is just to invent a new 'umbrella'.\"</p><br/><p>Mage Armand looked at the small wooden shield, making no sounds for a while.</p><br/><p>Benjamin continued, \"You have said it yourself, sir. Runes possess a frightening power. So why don't we use their powers well, to resist the elemental disasters?\"</p><br/><p>Armand was silent for a moment, before sighing, and said, \"...Your thinking is very dangerous.\"</p><br/><p>\"Man has always lived in danger, yes?\"</p><br/><p>Armand went quiet again.</p><br/><p>The entire room had become strangely silent. Barton took a look at Benjamin, and shifted his gaze back onto the small wooden shield on the table, not knowing what to say either.</p><br/><p>\"That is why I've said to just shut down that academy, save yourselves some trouble, squabbling about here.\" The old madam suddenly raised an eyebrow and had on a nonchalant expression, saying thus.</p><br/><p>\"...\"</p><br/><p>All three of them put their hands to their faces helplessly, in perfect unison.</p><br/><p>However, the nervous atmosphere had been suddenly broken. Mage Armand turned his head and sighed, saying, \"Since you, the Director, has already decided, then I do not wish to speak further. Be careful of the runes, be careful of the elemental disasters that they might bring. Perhaps everything you do will really usher in a new era for all of mankind.\"</p><br/><p>Hearing that, Benjamin nodded, saying, \"We will.\"</p><br/><p>\"However, if the runes really end up causing calamities, and if you do not deal with them properly, we will surely intervene once more. Please do not be angry, sir. This is the responsibility our predecessors have taught us to take on.\"</p><br/><p>\"But of course.\" Benjamin shrugged, saying, \"Moreover, if things do get to that stage, I'm afraid it would be a matter of a few hundred years from now. Where would I get the energy to be mad at you from?\"</p><br/><p>Mage Armand smiled and nodded.</p><br/><p>Thus, they gave up on persuading Benjamin, and decided to leave the place. Benjamin tried to get the old madam to stay and live in the academy for at least a while. However, the old madam did not seem willing, and it was only after the other two mages cooperated and advised her that she promised to come and stay for a few months every year, as a relaxing vacation.</p><br/><p>As for Benjamin's prior plans to pull the Mages Inheritance Union into the academy- those were clearly down the drain. Their standpoint was too conservative. It was already good that they would not interfere with the plans of the academy, so he would not expect them to come and help.</p><br/><p>After they had bid farewell, the three people left the secret room and set off on their journey to return to that secret Mages Inheritance Union headquarters where no one knew about. Benjamin kept away the wooden shield on the table and sat down in the room.</p><br/><p>After a short while, Elizabeth opened the door and walked in once again.</p><br/>\n</div>"}