{"title": "Chapter 839: The Intentions Behind", "id": 839, "volume": 9, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-839-the-intentions-behind", "volume_title": "Volume 9", "body": "<h1>Chapter 839: The Intentions Behind</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 839: The Intentions Behind</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Thus, Havenwright went through two days of turbulence under lockdown.</p><br/><p>The gigantic barrier was activated twenty four hours a day, and there were priests and Holy Knights on patrol everywhere. The royal army from all over the land had also turned the entire place upside down. It was a pity that, in the end, no one could find any clue about the King's whereabouts. He and the mage who had kidnapped him seemed to have vanished off the face of the earth.</p><br/><p>The citizens had a lot to say about such results. However, until now, the Church had not given an answer that could appease the people. The Pope Grant, who was said to have gone in search of god's will, still did not appear.</p><br/><p>What on earth was the Pope doing? Why had he not come forwards to do something about such a serious matter? Everyone had fallen into doubts such as those, but the Church remained quiet.</p><br/><p>On a remote street, in the outer city district...</p><br/><p>\"You, you are that child of the Lithur family?\"</p><br/><p>In a bedroom of a family house, the King sat up in bed. He looked at Benjamin's face with an expression of daze and suspicion.</p><br/><p>\"That's correct, Your Majesty, that's me,\" Benjamin nodded smilingly.</p><br/><p>\"What do you want to do? I… Why am I here?\" After a moment of being stunned, the King suddenly became panicked, and instinctively backed away. The fear in his eyes was exceptionally obvious.</p><br/><p>\"The Church has been using witchcraft as an excuse to imprison you in an underground room. Have you forgotten?\" Benjamin put on a concerned expressions, saying, \"I broke into St. Peter's Cathedral alone, and rescued you.\"</p><br/><p>Hearing that, the King was somewhat hesitant. \"You… Why did you rescue me?\"</p><br/><p>\"Because the enemy of my enemy is a friend, and we have the same enemy. The Church.\" Benjamin led him on in gentle patience. \"Have you forgotten? How those priests lord themselves over everyone else, using high and mighty pretentious excuses to slowly steal the authority that should have belonged to you.\"</p><br/><p>\"You…\"</p><br/><p>The King narrowed his eyes, still looking somewhat confused. He could not figure out the situation, as before, but for some reason, an instinctive feeling was mysteriously rising up in his heart, making him feel that the person before his eyes was trustworthy.</p><br/><p>At the same time, negative feelings tied to the Church were continuously surging up. The grief he felt being locked underground, the new Pope's arrogance, the humiliating memory of accidentally seeing his queen mother being \"abused\" by the previous Pope… He had already been accustomed to life under the shadow of the Church, ignoring things by numbing himself. He would even willingly turn around and defend the Church, not allowing others to say a single word against it.</p><br/><p>However… All the discontentment was coming out now.</p><br/><p>He actually felt that this mage was making a lot of sense.</p><br/><p>\"Your Majesty, don't you wish to have your revenge?\" Benjamin struck while the iron was hot, continuing his persuasion. \"Bring the Church down and return to your peak of power. Make those priests see what the dignity of the royal family truly is.\"</p><br/><p>\"I… How? The Church is too strong, absolutely no one will support me…\"</p><br/><p>\"The Church is not as powerful as it seems to be. At least, all the nobles have now come over to our side,\" Benjamin spoke steadily. \"In fact, I was able to successfully get you out thanks to their help.\"</p><br/><p>Hearing that, the King's eyes shone. \"Really?\"</p><br/><p>\"Of course it's real,\" Benjamin gave a smile. \"Your Majesty, all you have to do is go along with my arrangements, and everything will run as smoothly as eating and drinking.\"</p><br/><p>The King took a deep breath.</p><br/><p>If it were any other time, he definitely would not have believed such ridiculous words, especially coming from a mage. However, at that moment, he felt that this mage was more trustworthy than any other priest.</p><br/><p>Therefore, for inexplicable reasons, he nodded.</p><br/><p>Benjamin looked satisfied.</p><br/><p>\"Then please wait here for a few days more, Your Majesty. There are men searching for you everywhere outside. Don't simply walk anywhere. Very soon, we shall leave this place.\"</p><br/><p>Saying thus, he turned around and brought the two siblings out from the bedroom, closing the door. Outside the bedroom, he gave the two of them a big thumbs up and an approving look.</p><br/><p>\"You've done a really good job.\"</p><br/><p>The two siblings grinned happily.</p><br/><p>The spiritual imprint left in the brain of the King by the worshippers across the sea had been implanted very deeply. Because of that, not only could they forcibly control his movements, they could also truly change the mindset of the King through the power of suggestion. Such a technique was the most foolproof.</p><br/><p>The King would not even know that he was being influenced by psychic powers.</p><br/><p>Benjamin could also have him under true control. Even if the spiritual imprint were to be removed, or if the two siblings were not around to control him, the King would still listen to him, and never again be receptive to the Church's instructions.</p><br/><p>He could begin the next step now.</p><br/><p>And so, Benjamin left the two siblings in the house to protect the King, and left the building himself.</p><br/><p>In the streets, the soldiers on the search were still as numerous as before, but using the water elemental sensing technique, he was able to smoothly bypass all eyes and ears. Like an unremarkable, ordinary citizen, he wandered off in twists and turns, until finally, he arrived at a casino situated north of the city.</p><br/><p>\"This is the place.\"</p><br/><p>He walked into the casino, and passed a badge to a servant at the door. After a few minutes, the boss of the casino hurriedly walked over, and brought him to the most secret room of the casino.</p><br/><p>Within the room was Duke Collin, waiting in full anxiety.</p><br/><p>\"Director, sir, you have finally appeared!\" The moment he laid his eyes on Benjamin, he immediately rose up to welcome him, putting on a warm smile and refusing to let go of Benjamin's hand.</p><br/><p>\"My apologies. The situation in the capital has been too complicated in the past few days. I have only been able to find an opportunity to contact you today,\" Benjamin smiled, and shook the Duke's hand before taking a few steps back, speaking with deliberation, \"Unfortunately… If there had not been so many members of the Church at the time, as though there has been a traitor, I'm afraid I would have long escaped from Havenwright with the King.\"</p><br/><p>Hearing that, the mile on Duke Collin's face immediately became slightly stiff.</p><br/><p>\"...A traitor?\"</p><br/><p>\"Yeah. Otherwise, it would have been impossible for more than a dozen bishops to turn up all together and rush straight at me,\" Benjamin said, observing the Duke's expression. \"Someone must have leaked news of the mission this time, for the Church to be so well prepared.\"</p><br/><p>However, hearing this, Duke Collin suddenly lowered his head and gave a long sigh.</p><br/><p>Benjamin furrowed his eyebrows.</p><br/><p>\"...Duke, sir?\"</p><br/><p>\"It is my fault,\" Duke Collin raised his head, looking somewhat regretful. \"I am so sorry, Director Benjamin. The Church did know about your plans beforehand.\"</p><br/><p>Benjamin felt that something was wrong with this response, but continued to ask, \"How did they know?\"</p><br/><p>Duke Collin answered, \"I told them.\"</p><br/><p>Benjamin could not help but raise his eyebrows.</p><br/><p>It was not that he had not thought about this possibility, but… How could it be that the Duke was admitting it so easily? Benjamin had confirmed, earlier on, that there were no traps in this place, and no spies of the Church here. Killing Duke Collin would be a matter of an instant.</p><br/><p>Something strange was going on here.</p><br/><p>\"Why?\" Thinking thus, his tone of voice grew less friendly. \"I need an explanation.\"</p><br/><p>Duke Collin took a deep breath, saying, \"because… This is the only way to rescue His Majesty.\"</p><br/><p>\"What do you mean?\"</p><br/><p>\"His Majesty was locked in the basement of the great cathedral. If the Church did not expose any openings, it would forever be impossible to get the King out,\" Duke Collin explained. \"But how could the Church expose themselves? If they wanted to, the cathedral would be an impenetrable wall of iron, and no one would be able to enter, unless… Unless there's another factor that causes them to willingly expose themselves.</p><br/><p>Hearing that, Benjamin gave a cold scoff, saying, \"You're talking about me?\"</p><br/><p>Duke Collin immediately nodded. \"Yes, Director sir, you! The members of the Church are too desperate to kill you, and they were even willing to use His Majesty as bait, leaving themselves open to lure you in. But at the same time, that was the only way to rescue His Majesty!\"</p><br/><p>\"Then… Aren't you using me as bait too?\"</p><br/><p>\"That's different, of course,\" Duke Collin grinned apologetically. \"Director, sir, your amazing powers are unquestionable. Even if the Church had set more traps, it's impossible that they would be able to lock you down. This is something everyone knows, only, the Church is still in denial and just has to spend all their resources trying to get to you!\"</p><br/><p>However, despite such flattery, Benjamin was still unsatisfied. His face was cold, as he spoke, \"If that's the case, you should have told me such details before we began things.\"</p><br/><p>\"Why should we be bothered about these things?\" Duke Collin, however, said in persuasion. \"Haven't you left the cathedral safely, and successfully rescued His Majesty? Director, sir, all you have to know is that we stand on your side. Leaking the information to the Church is only a part of the plan.\"</p><br/>\n</div>"}