{"title": "Chapter 831: An Absurd Proposal", "id": 831, "volume": 9, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-831-an-absurd-proposal", "volume_title": "Volume 9", "body": "<h1>Chapter 831: An Absurd Proposal</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 831: An Absurd Proposal</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>\"You guys seemed to have talked for a long time. Does the madam not plan to stay on?\" Elizabeth walked in and glanced around the room, asking casually.</p><br/><p>\"She hates the Academy of Magic so much, of course she wouldn't wish to stay here.\" Benjamin had a helpless expression and shrugged, before saying, \"Enough, the matter with the Mages Inheritance Union comes to an end. We should discuss the issue with the Kingdom of Helius now. I'm sure you did not come specifically to visit the academy, just to be my guide?\"</p><br/><p>\"Of course not.\"</p><br/><p>Elizabeth nodded. After that, she took out a map from her own pocket and put it on the table, spreading it open slowly. Benjamin looked over it doubtfully, but realized that the buildings on the map seemed a bit familiar.</p><br/><p>\"This is…\"</p><br/><p>\"The complete internal structure of St. Peter's Cathedral.\" Elizabeth spoke slowly, \"Or perhaps you have other channels and feel that this isn't rare at all, but for the nobles within the country, we've had to expend huge amounts of effort to finally get our hands on this thing.\"</p><br/><p>Benjamin's eyes flashed in astonishment.</p><br/><p>St. Peter's Cathedral…</p><br/><p>This was the nest of the Church. Although previously, he had used the all-knowing perspective of the elemental planes to pry through it once, he had never thought about what he could do with it. However, now that the Wood family had thrusted the map into his face, this became quite interesting.</p><br/><p>What was happening in the Kingdom of Helius?</p><br/><p>Giving the map a few more glances, he suddenly pointed at one of the rooms with a red cross marked on it, frowning as he asked, \"What does this cross mean?\"</p><br/><p>Elizabeth answered, \"That's where the Church is keeping the King under house arrest.\"</p><br/><p>Benjamin was slightly startled.</p><br/><p>A guess that seemed almost somewhat absurd to him suddenly popped into his mind.</p><br/><p>\"You… Aren't planning to sneak into St. Peter's Cathedral and rescue the King who had been affected by psychic powers, are you?\"</p><br/><p>\"This is what the majority of the nobles in the country current wish for.\" Elizabeth lowered her head as she looked at the map, saying, \"You should also know that ever since the cultists from overseas attacked the capital, the Church has announced that His Majesty the King has been afflicted by witchcraft and needs rest. All matters have been left to Her Majesty the Queen. And, just in the past few days, the knights of our family have accidentally discovered that the Church is surreptitiously looking for citizens who look similar to the King now.\"</p><br/><p>Hearing this, Benjamin gave a scoff, not really surprised, and said, \"The Church wants to find a substitute?\"</p><br/><p>\"That's it.\" Elizabeth nodded, and continued, \"This information has been spread amongst the aristocracy circles. No one can accept what the Church is doing, and even within the Church, there are signs of discord.\"</p><br/><p>\"But still, it isn't possible to rush into St. Peter's Cathedral and rescue the King, is it?\" Benjamin crossed his arms, speaking helplessly.</p><br/><p>In Havenwright alone was a gigantic Holy Barrier, so the inside of the Cathedral itself was out of the question. The condition of the place they had managed to discover in the past was that there were hidden traces of Holy Light everywhere. Since a long time ago, men who had snuck in never ended up well. Only Miles alone was able to retreat properly.</p><br/><p>As for Miles, Benjamin was certain that he could not count on him for help now.</p><br/><p>Not to mention Grant, who was in command there.</p><br/><p>At that time, having the help of the water elemental sprite gave Benjamin the confidence to fight head on against Grant. He could even suppress him. Nevertheless, he was not as arrogant as to think that they could rush into the other party's home.</p><br/><p>These nobles… What were they thinking? They were too ambitious!</p><br/><p>\"Perhaps, in the past, it would be very difficult to succeed.\" Elizabeth explained, \"However, just a week ago, the Pope has suddenly announced to the outside that he wanted to retreat and reflect upon the will of god. After that, he has never reappeared. The matters of the Church have been temporarily passed to a few Bishops for handling. The news our family has managed to obtain is that he seems to have departed alone towards the depths of the Mountains of Magic Beasts, in the west.\"</p><br/><p>\"Mountains of Magic Beasts? What has he gone there for?\"</p><br/><p>\"No one knows.\" Elizabeth shook her head, \"However… He should not show himself here for at least a month. This is our only chance.\"</p><br/><p>Hearing this, Benjamin rubbed his chin and fell into deep thought.</p><br/><p>The entire thing felt very strange to him.</p><br/><p>It was not that he did not trust the Wood family and Elizabeth; after all, they had cooperated once before, and the information concerning the Church going out on an expedition against the worshippers from across the sea given by them had been very accurate. Only, when he thought about the fate of the Fulner family, he really did not feel that these nobles were capable of fighting the Church directly.</p><br/><p>They wanted to break into St. Peter's Cathedral to rescue the King. How was this different from officially shedding off all pretense of cordiality?</p><br/><p>Furthermore, why had Grant suddenly left the capital and run off alone into the Mountains of Magic Beasts? Other than the ruins of the Academy of Silence, there should not be anything there at all.</p><br/><p>Benjamin suddenly sensed something fishy going on.</p><br/><p>Here… It was either that there were secrets, or a plot going on.</p><br/><p>\"What is there in the Mountains of Magic Beasts? You should be rather familiar with the area there, right?\" He asked abruptly.</p><br/><p>\"My… My teacher has mentioned before that if one looks over the Mountains of Magic Beasts and go deeper in, there is a vast, low valley and plains. That was where magic was born for the first time.\" Elizabeth hesitated for a moment, before speaking slowly, \"Many years ago, he said that humans migrated from that place over here, but these are only myths, no one knows if they are true.\"</p><br/><p>\"So… Do you feel that Grant has gone to seek the secrets of the origin?\"</p><br/><p>\"I did not say that.\" Elizabeth immediately shook her head, saying, \"I know what you're suspecting. Only that, after the campaigns against Icor and the worshippers from across the sea failed one after another, the Church no longer has the resources to fight the nobles within the country. It is impossible for the story of the Fulner family to happen again. The Church needs the support of the nobles, even if it is fake, hypocritical support, they need to use it to stabilize the situation.\"</p><br/><p>Benjamin furrowed his eyebrows. \"You really don't think this is a trap set by the Church?\"</p><br/><p>\"They do not have the capacity to do such things anymore. The prestige of the Church is no longer as great as it was before. To continue cleaning up internally would be to ruin the Kingdom of Helius, and the Church will be ruined with it.\"</p><br/><p>\"...Alright.\"</p><br/><p>Benjamin could not find any loopholes for the moment, so finally, he still nodded.</p><br/><p>In fact, after careful consideration, he realized that it might be advantageous to them if the Church continued to fight internally. Even if this was a trap and Grant had not truly left the capital, turning around to kill all that opposed them, but… What next, then?</p><br/><p>At least half of the forces he could mobilize would also be destroyed by him.</p><br/><p>To have come to this point, Benjamin believed that the nobles were already determined to risk everything and go all the way. They might not possess armies, but they had wealth and land, in addition to the respect of the people. If the Church did not wish to have a situation where merchants were escaping on a large scale, prices of goods inflating, poverty occurring everywhere and the people living in destitute, then they could not strike at the nobles left.</p><br/><p>\"Give me the map. I need to make plans concerning this.\" Finally, Benjamin took the map on the table, saying thus.</p><br/><p>Elizabeth nodded.</p><br/><p>\"I will wait in the town of Academy. When you have decided, we may need to make a trip to the Kingdom of Helius. My father wishes to see you.\" Having finished speaking, she opened the door and left.</p><br/>\n</div>"}