{"title": "Chapter 837: The Reappearance of A Forbidden Spell?", "id": 837, "volume": 9, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-837-the-reappearance-of-a-forbidden-spell", "volume_title": "Volume 9", "body": "<h1>Chapter 837: The Reappearance of A Forbidden Spell?</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 837: The Reappearance of A Forbidden Spell?</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>He immediately plunged the bishops into the deep sea domain.</p><br/><p>The water elements, capable of poisoning humans, surged up. Their faces instantly changed. However, due to the protection of Holy Light and the suppression of the Cathedral itself, they were not \"poisoned\", but their hearts were merely put under pressure.</p><br/><p>Right after that, they still had to face the frightening blizzard.</p><br/><p>\"Damn it… He seems to have grown stronger.\"</p><br/><p>The bishops complained as they skillfully mobilized the energy of the runes, and increasingly more Holy Light streamed out from the sides of their bodies. In the blink of an eye, a gigantic helmet formed above their heads. The shiny, golden armor of light protected them inside it, blocking out numerous spinning snowblades.</p><br/><p>The Helmet of God's Descent was an extremely difficult high-level divine spell. They had easily displayed it after they had learnt the Law of Runes and Meditation; their powers seemed to have increased.</p><br/><p>At least, it would have been very difficult for typical high-level magic to completely block Benjamin's attacks.</p><br/><p>While the bishops were resisting the blizzard, they seemed to have enough energy left. As their spiritual energy dispersed, a gigantic Sword of Holy Light was being constructed, bit by bit.</p><br/><p>Seeing that, Benjamin could not help but feel somewhat troubled. This damned place, St. Peter's Cathedral, was amplifying the bishops too much. It was very tough for him to gain an advantage fighting here.</p><br/><p>He could only thank the heavens that Grant was not here.</p><br/><p>\"Kill them!\" Thus, Benjamin increased the intensity of the blizzard, and communicated with the water elemental sprite, which was immersed in the domain, through the spiritual connection.</p><br/><p>At that moment, the water elemental sprite had already flown quietly to the backs of the dozens of bishops. It was like a drop of dew that had fallen into a flowing river, swimming freely in the deep sea domain and leaving no trace behind. No one could see it at all. When it received the command, the tiny flash of blue light in the blizzard was not at all noticeable.</p><br/><p>Whoosh!</p><br/><p>The water silk, compressed to the limit, pierced through.</p><br/><p>In that moment, all the bishops lost consciousness temporarily. As they came back to their senses, a scream erupted from amongst them, with a light splash of blood.</p><br/><p>He could see one of the bishops clutching his shoulder, arching his body back painfully. At the back of his shoulder, there was a tiny, blood stained hole that was very noticeable.</p><br/><p>In fact… The tiny hole was actually not too far from where his heart was.</p><br/><p>A chill shot through the bishops as they felt shocked, looking around them in a confused manner as they tried to see where the attack came from. However, all they could see was the vast blizzard, as well as the great net of runes, and Benjamin.</p><br/><p>Right after that, there was another whoosh!</p><br/><p>\"What, what on earth is going on…\"</p><br/><p>They had not even determined what form the attack had taken before sensing it coming again, from another direction. Nevertheless, their experience in battle saved their lives; everyone instinctively ducked, causing the attack to miss everyone this time.</p><br/><p>A bishop took the opportunity to see exactly what the water silk looked like.</p><br/><p>\"Quickly! Strengthen our defense! It's a compressive elemental attack, similar with His Highness the Pope's techniques!\" He immediately opened his mouth and cried out.</p><br/><p>At the same time, the other bishops had temporarily given up on their offense, and caused even more Holy Light to surge towards the Helmet of God's Descent. Within moments, several dozen layers of holy light shields, packed tightly together, were summoned out to form a ring of impenetrable shield wall, adding another extremely secure layer of defense outside the Helmet of God's Descent.</p><br/><p>After that, another water silk flashed into appearance and pierced through the shield wall, but was finally blocked by the Helmet of God's Descent.</p><br/><p>\"What a pity…\"</p><br/><p>Seeing that, Benjamin shook his head. He could not help but feel somewhat resentful.</p><br/><p>Initially, the water elemental sprite had been aiming to injure. However, the layer of holy light helmet, fortified by the cathedral, had become quite formidable. Even if the water silk could successfully pierce through the helmet, its accuracy was still slightly off. Otherwise, that bishop would have already been a corpse.</p><br/><p>Now, this bunch of bishops were putting together more defenses…</p><br/><p>After hesitating for a few seconds, Benjamin suddenly waved his hand, and the internal state of the blizzard changed. The snowflakes, once sharp and shaped to cut, were suddenly not as angular, and did not bounce off the shield wall as before. Instead, they stuck to it softly.</p><br/><p>As the blizzard continued to blow, a thick layer of snow soon covered up the outside of the shield wall. The snowflakes quickly trapped all the bishops inside, and at that moment, there seemed to be a gigantic snowball in the middle of the corridor.</p><br/><p>The expressions of the bishops were forced to change again.</p><br/><p>\"Damn it… What is this devil planning to do now?\"</p><br/><p>They were not Benjamin, so the moment their vision was blocked, they were unable to sense anything moving in the outside world. Right then, they only knew that the blizzard was still going on judging by the pressure being exerted unceasingly upon the shield wall, but as for any new movement from their opponent, they were completely clueless.</p><br/><p>However, instinct told them that Benjamin must be gearing up for some sort of terrible, ultimate magic.</p><br/><p>\"Use Holy Flames to clear out the snow, quickly!\"</p><br/><p>It was impossible to fight under such blinded condition, and so they immediately summoned flame after flame of golden fire, forming a ring of fire that was then attached to the shield wall. The water elements contained within the accumulated snow was alarming, but with the help of the environment in the cathedral, the golden flames grew in power. The internal layer of snow began to melt, bit by bit…</p><br/><p>Only, the melting process still did not seem fast enough.</p><br/><p>\"How much of water element did this guy control? Is his spiritual energy limitless?\" After burning for quite a while, the bishops discovered that the snow was still not removed, and could not help but speak in utter frustration.</p><br/><p>They realized that the blizzard outside was still happening as the golden flames were clearing out the snow. The endless supply of snowflakes summoned by Benjamin were sticking to the shield wall. All they were really doing was to stop the snow from getting thicker.</p><br/><p>\"We must fight back, we cannot let that fellow to continue fooling us,\" A younger bishop suddenly said. \"With the divine protection of the cathedral, he can't actually break through our defenses.\"</p><br/><p>However, another bishop replied, \"But… It seems difficult to retaliate without knowledge of the enemy's position.\"</p><br/><p>The young bishop was startled, and immediately felt dispirited.</p><br/><p>They seemed to suddenly realize that they had fallen into a deadlock. With their vision completely blocked, they did not even know what their opponent was doing. Benjamin was standing in an almost invincible position, attacking them in whatever way he wished.</p><br/><p>All they could do was hide in their shell and endure the beating.</p><br/><p>\"Enough… Let's use the Descending of Divine Miracle!\" Finally, the bishop who seemed to be the oldest amongst them, spoke and took over as the leader of the group, giving his order.</p><br/><p>Hearing that, all the bishops nodded and abandoned their plan to melt the snow. They closed their eyes, and began to chant in a continuous murmur.</p><br/><p>A strange oscillation rose up within the corridor.</p><br/><p>\"...Is this a Forbidden Spell?\"</p><br/><p>Benjamin's voice suddenly sounded out from beyond the piled up snow.</p><br/><p>The bishops did not look too good, but they ignored Benjamin's words and pretended as though they had not heard him, focusing on murmuring the words to their spell. Upon careful inspection, one would discover that although everyone was chanting a different spell, the rhythms of their chants were strangely in harmony.</p><br/><p>All of their spiritual energy seemed to have converged, resonating continuously in the void, as though over a dozen souls were conversing with each other using a special method.</p><br/><p>\"Interesting. I can actually see a Forbidden Spell of the divine arts resurface in the midst of mankind. I guess my visit today is not for nothing,\" Benjamin's voice continued to travel in. \"However… A fair warning. Before you complete your Forbidden Spell. I'll be making all the snow explode.\"</p><br/><p>At this, all the bishops were forced to open their eyes.</p><br/><p>They chanted their spells while looking at each other, seeing the doubt in one another's expressions. If such a huge amount of snow were to explode all at the same time… They were uncertain if the defenses they had now would be able to withstand it.</p><br/><p>An unease rose in every heart, all at once.</p><br/><p>At that moment, the accumulated snow on the outer layer of the shield wall began to shake violently. Wave after wave of magical oscillation covered even the oscillations caused by their chanting of the Forbidden Spell, like frightening signs before a volcano erupted.</p><br/><p>They were forced to stop chanting the Forbidden Spell.</p><br/><p>\"Quickly! Add a few more layers of the Holy Barrier!\"</p><br/><p>The light elements, initially used on the Forbidden Spell, were now being turned into bricks, piling up one after another around the bishops. They did not know how powerful the explosion of snow could be, but they were not about to bet their lives on it.</p><br/><p>Especially… Under such pressure, the heart of man would suddenly change. It would be very difficult for them to successfully cast a Forbidden Spell, which had extremely stringent requirements.</p><br/><p>All they could do was stop, and choose to defend.</p><br/><p>However, right as they were desperately adding to the Holy Barrier, there was a loud blast: The outer layer of snow exploded violently right at that moment!</p><br/><p>A powerful impact struck. The bishops' hearts sank, and there was no other thought in their minds save for their prayers to god.</p><br/><p>The outer layer of the shield wall was the first to bear the impact of the explosion, and layer by layer, the holy light shields began to break…</p><br/><p>Within moments, however, the bishops discovered that something was amiss.</p><br/><p>\"...Wait!\"</p><br/><p>The impact of the explosion was far weaker than they had imagined. After a while, the snow disappeared and faded, but the outer layer of the shield wall had not even been completely destroyed. The remains of the holy light shields hung upon the Helmet of God's Descent, and inside, needless to say, the bishops were naturally unharmed.</p><br/><p>They were temporarily at a loss, and looked out.</p><br/><p>The blizzard was gone. The domain, filled with the immense pressure, had also vanished. St. Peter's Cathedral was once again filled with glory, as though nothing had happened.</p><br/><p>Of course… Benjamin, the King, as well as those things, had completely disappeared from their sight.</p><br/>\n</div>"}