{"title": "Chapter 833: The Plan, and Matters Outside of the Plan", "id": 833, "volume": 9, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-833-the-plan-and-matters-outside-of-the-plan", "volume_title": "Volume 9", "body": "<h1>Chapter 833: The Plan, and Matters Outside of the Plan</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 833: The Plan, and Matters Outside of the Plan</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>It had been years since they last met, but Duke Collin did not act the least bit aloof, and was very soon in conversation with Benjamin, as though he wanted to tighten the bond between them. However, at that moment, Benjamin had no intention to be involved in small talk. He quickly skipped through the old \"close friends\" sort of greetings, and got them back on track speedily.</p><br/><p>\"...In relation to your plan to rescue the King, I would like to know more about the details.\"</p><br/><p>Hearing that, Duke Collin finally withdrew his smile, and put on a solemn expression, \"Speaking of this, Director Benjamin, have you had the chance to take a look at Havenwright?\"</p><br/><p>Benjamin asked back, \"No. What has happened there?\"</p><br/><p>\"The capital is as messed up as a pot of porridge, and has not been what it was a long time ago.\" Duke Collin sighed, looking worried as he spoke, \"Ever since the King has been placed under house arrest by the Church, the upper district of the city has been very difficult to keep in check. Every day, crowds of people are in front of the Cathedral, making a huge fuss. Even the Royal Knights have been forced to patrol the streets to keep the peace.\"</p><br/><p>\"Then… How many nobles are willing to go against the Church now?\"</p><br/><p>\"Seven out of ten, at least.\" Having spoken that, Duke Collin paused for a moment, before continuing, \"You do not have to doubt their loyalty, dir. The Church has been getting too much to handle. Not many can continue tolerating this.\"</p><br/><p>Benjamin nodded, believing him.</p><br/><p>The nobles were not stupid. With the exception of those who were religious to the point of insanity, they were definitely desperate to protect the interests of their class, and the word \"King\" was the ultimate symbol of their entire feudal class. His importance was self-evident.</p><br/><p>As for the destruction of the Lithur and the Fulner families, one after another, it might only have been to serve as a warning to the others, but now the Church was pushing them completely into the corner.</p><br/><p>\"Do you have a detailed plan?\" Benjamin asked again.</p><br/><p>\"Of course.\" Duke Collin immediately nodded, speaking in an eager and pleasant manner, \"According to our intelligence, His Majesty the King is being kept in the innermost dungeon of the Cathedral's left gallery. There are two Bishops there, specifically to guard the door, and a troop of Holy Knights is constantly on patrol nearby. There seems to also be a special Holy Barrier, but we don't know how strong it is. The people on guard are the most loyal, fanatical believers, so it's very difficult for us to bribe them. So, we've decided to plan a massive protest by the people to draw their attention, and then you can break through the barrier, sir, and rescue His Majesty the King.\"</p><br/><p>Benjamin listened to the entire plan, and gave it some thought. He did not find anything wrong with it.</p><br/><p>Of course, the risk was there. Until now, he still had the nagging feeling that this might be a trap set by the Church, with Grant hiding in the Cathedral, waiting for them to fall into their nets. However… Right then, Benjamin had some confidence in himself, at least.</p><br/><p>With the intangible form, the water elemental sprite, and ten minutes of the \"Descending of Water\", whatever Grant did, he would not be able to lock Benjamin down.</p><br/><p>\"How do I slip into the Cathedral?\" He continued to ask.</p><br/><p>\"There are many ways.\" Duke Collin said, \"We could disguise you as a Holy Knight and you could slip in when the chaos starts. We could also hide you in the bags of atonement gold and send you into the storerooms, and when the time comes, you could rush out from there during the commotion…\"</p><br/><p>In mere seconds, he suggested many methods, and swore by all of them, feeling very confident. Benjamin could not help but sigh at how resourceful these nobles were.</p><br/><p>He even mentioned that Benjamin could dress up as one of the Queen's personal maidservants, and slip into the team of maidservants with the excuse of delivering His Majesty the King his meal. He would be able to go straight down to the dungeon where the King was being kept.</p><br/><p>This seemed to be the most straightforward method, but Benjamin declined it in a heartbeat.</p><br/><p>\"I think the Holy Knight plan is more reliable.\"</p><br/><p>Duke Collin gave a few loud guffaws, and nodded, \"Then it is settled.\"</p><br/><p>Following that, Benjamin naturally wished to ask the question that the Duke seemed intent on avoiding.</p><br/><p>\"Then… After I've brought His Majesty the King out, what do you intend to do?\" He lowered his eyes and spoke slowly, \"The moment I break through the barrier outsider the dungeon, the entire Church would be alerted. You nobles would be considered to have completely thrown off all pretenses with them. By then, I'm afraid, even the amiableness on the surface would be ruined.\"</p><br/><p>Hearing that, Duke Collin chuckled, \"Don't you worry about this, sir. We have our ways.\"</p><br/><p>\"What ways?\"</p><br/><p>\"This… You do not have to ask too many questions, Director. You just need to prepare yourself to rescue His Majesty the King, that is all. We have taken root in the Kingdom of Helius for many years, so we're not completely without tricks.\"</p><br/><p>Hearing that, Benjamin did not ask any further. He simply nodded nonchalantly.</p><br/><p>It looked like they had their own plans…</p><br/><p>He did not feel surprised. Although this was Elizabeth's father, but the nobles had always played the field this way. Moreover, Elizabeth had not joined the academy, and when it came right down to it, these people could not even be considered their own.</p><br/><p>However, vice versa, Benjamin had his own plans as well. Each to his own.</p><br/><p>After some discussion about the details of the plan, finally, the day of the plan to sneak into the Cathedral was set for three days later. After three days, a team of Holy Knight would be returning from raiding a neighbouring town for mages. There were many amongst them who were friends to the Wood family, and even the leader of the team had been bribed, so they were completely able to send Benjamin in with no risk of danger.</p><br/><p>Meanwhile, during these few days, Benjamin only had to wait in this small town by the lake. The troop of Holy Knights would pass through.</p><br/><p>\"Since you have planned so thoroughly, there is nothing for me to improve on.\" Thus, he nodded, saying, \"So this is it. I will stay in the tavern next door and wait for your instructions.\"</p><br/><p>Saying that, Benjamin was about to leave when Duke Collin stopped him, his face full of smiles.</p><br/><p>\"Director Benjamin, you are already twenty plus years in age, sir. The current progress of the Academy of Magic is good, and you have a successful career. I don't know whether… You have plans to start a family?\" He suddenly patted Benjamin's shoulders, speaking in an extremely hearty manner.</p><br/><p>\"Uh…\"</p><br/><p>Benjamin was instantly frozen on the spot.</p><br/><p>What was going on?</p><br/><p>The two siblings behind him could not help but cover their mouths as they giggled.</p><br/><p>\"Of course, I've heard that mages have always been celibate, but if you were to have a soulmate who is also a mage, wouldn't the path of magic not be so lonely? Don't you agree, Director Benjamin?\" Duke Collin seemed to have arrived at the true topic of the day; the more he spoke, the more eager he sounded.</p><br/><p>\"...\"</p><br/><p>Benjamin had no idea whatsoever about how he should reply; all he did was to stand there, like a wooden block, not making a sound.</p><br/><p>The System was laughing maniacally in his mind.</p><br/><p>After a long pause, as words got stuck in his throat, he finally organized his thoughts and said, \"Duke Collin, I…\"</p><br/><p>The Duke, however, patted his shoulder again, interrupting him, and continuing, \"Director Benjamin, I know this is difficult for you. In actual fact, this is a bit awkward for both our families, but… Calling off the engagement was only you guys messing around during your childhood. Even if you regret it now, it's no big deal actually. Please do not let it be an obstacle between the both of you.\"</p><br/><p>\"...\"</p><br/><p>\"How's about it? Director Benjamin, don't you think…\"</p><br/><p>\"Duke Collin, sir, that's it for now. I still have matters to attend to, so I will take my leave now. Let me know when the Holy Knights arrive!\" Before the Duke could finish, Benjamin hurriedly spoke in a louder voice to drown out those words. He turned around and left the room as though fleeing for his life, running out the back door of the tavern.</p><br/><p>\"Ha ha ha ha ha…\" The laughter of the System rang like an earworm, echoing nonstop in his heart.</p><br/>\n</div>"}