{"title": "Chapter 841: The First Step in Uprooting the Church", "id": 841, "volume": 9, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-841-the-first-step-in-uprooting-the-church", "volume_title": "Volume 9", "body": "<h1>Chapter 841: The First Step in Uprooting the Church</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 841: The First Step in Uprooting the Church</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>The soldiers guarding the city were not the only ones; all of Havenwright had actually been awakened by that loud bang.</p><br/><p>The pitch black city was immediately lit up by lamps, street after street. They were already on edge; with such a loud noise coming from the sky, who could continue sleeping in peace? Everyone walked out from their doors, looking up in alarm.</p><br/><p>St. Peter's Cathedral was the same. In just a dozen of seconds, priests began to fly out, their whole bodies surrounded by Holy Light.</p><br/><p>However, the figure in the sky did not stay too long.</p><br/><p>Bang!</p><br/><p>There was another loud noise. Everyone could clearly see a fist flashing with blue light, flying out and directly hitting the barrier protecting the city of Havenwright. For a second, the barrier shook, and a huge hole was blasted open in it by the fist.</p><br/><p>It was the exact same sight that they had seen many months ago.</p><br/><p>After the barrier had been broken, the figure in the sky took the water bubble containing the man and, with a whoosh, flew out of the big hole, disappearing into the southeast of Havenwright.</p><br/><p>\"Damn it… We've let him escape again!\"</p><br/><p>The priests chased after him, all the way to the hole in the barrier, when they could not even see his shadow anymore. No matter how disgruntled they were, they had to give up the chase.</p><br/><p>Soon after, the dozens of bishops who had stayed to guard the city center also flew out. After hearing about the situation, their faces fell as they looked at the huge hole in the barrier; they looked so bad, it was as though they had just eaten sh*t.</p><br/><p>\"Honorable bishop, what should we do now?\" A priest asked carefully.</p><br/><p>\"Inform all the sentinels nearby the capital. As that rascal flies over, we can definitely figure out the direction he is escaping towards! We must think of a way to keep him in the kingdom,\" The bishop who seemed the oldest gave a long sigh, saying, \"Also… Think of a way to inform His Highness the Pope. If he still does not return, the rascal will be riding on our heads soon!\"</p><br/><p>The priests nodded, and quickly dispersed. Havenwright, so suddenly jolted up, slowly fell back into quietness. The people discussed amongst themselves in private; some were furious, some were secretly gleeful. The nobles in the city, especially, were so angered by this event that they had gone out to hold a meeting, discussing what they should do about this out of control situation.</p><br/><p>The barrier protecting the city was once again sealed up, and the soldiers searching the streets returned to the army base. In everyone's eyes, the mage who had kidnapped the King had already broken through the blockade forcibly and left Havenwright. There was completely no point to the Church sealing off the city now.</p><br/><p>They should get busy with other matters.</p><br/><p>However…</p><br/><p>In the evening, the next day.</p><br/><p>\"The city gates have been sealed up for so long, and today they are finally open. Big brother, father has gotten so sick, is it true that he can only be cured if we see the old doctor in the village?\"</p><br/><p>Near the city gates that had just been reopened, three young people were pushing a small cart. In the cart laid a middle-aged man in a stupor. They were amongst the crowds of people leaving the city. One of them, a young girl, suddenly turned her head, and asked the young man walking on the side.</p><br/><p>\"Don't worry. Once we're out, there will be a way,\" The young man forced a smile at her, and stroke her hair as he reassured her.</p><br/><p>Although the capital was no longer sealed up, the soldiers who guarded the city were still checking the people that came to and fro, grabbing anyone suspicious for a closer inspection. As this family pushed the ice blade on their cart out while talking amongst each other, the soldiers only gave them a casual glance.</p><br/><p>\"Such a pity…\"</p><br/><p>A soldier sighed nonchalantly, and let them out of Havenwright.</p><br/><p>Leaving the city gates, they went onto the main road. There were many citizens going out of the city, and the three people mixed into the masses of people, quickly disappearing along with their cart.</p><br/><p>After half an hour.</p><br/><p>\"Alright. Now, no matter what the Church tries to do, they still won't be able to trace our location,\" The three people stopped in an empty wilderness. Benjamin pulled the King, who was lying on the cart pretending to be ill, up, and spoke thus.</p><br/><p>As for the Church's method of tracing them, he still had a lingering fear. When he and Michelle had snuck out from the capital together, they had clearly left no clues behind, and yet the members of the Church still caught up with them in the end. After various considerations, he still had to be extremely cautious.</p><br/><p>First, they had put on a show last night, causing them to think that he had forced his way through and escaped with the King. After that, using water to create a human-like figure that continued to fly towards the east, he had quietly come back, and left the capital with the two siblings as well as the King in a blatant fashion. This was a plan that the Church would never figure out within a lifetime.</p><br/><p>They would only continue searching towards the east, not knowing the true whereabouts of Benjamin.</p><br/><p>\"Th-thank you…\" The King stood up on the cart, nodding. The expression with which he was looking at Benjamin was still somewhat fearful. \"But… Now that we have left the capital, how do we fight the Church?\"</p><br/><p>Hearing that, Benjamin smiled.</p><br/><p>\"How can we strike in Havenwright if we wish to fight the Church?\" He spoke slowly, \"The Church's roots are not there. Even if I had the ability to completely destroy the cathedral, it would not clean out the countless of priests.\"</p><br/><p>\"Then, where are their roots?\"</p><br/><p>\"In the churches of every city, every village,\" Benjamin said, suddenly turning his head and looking towards the small town closest to them, grinning mischievously.</p><br/><p>The King, as well as the two siblings, could not help but feel startled.</p><br/><p>Thus, as the Church sent out great troops of men and horses towards the east on their continuous search, they also set off, speedily reaching the first town closest to the east of Havenwright.</p><br/><p>Town Hendrie.</p><br/><p>Similar to every other town, the home of the mayor was built extremely close to the church, and the meeting hall was adjacent to both places, facilitating the ease of exchange of information in case of emergencies. Only, on this day, when four mysterious guests suddenly appeared before the mayor, no one dared to inform the church.</p><br/><p>\"Your- Your Majesty?\"</p><br/><p>The mayor, in his mid-forties, widened his eyes as he stared at the familiar face before his eyes. His legs weakened and he almost knelt to the ground, involuntarily exclaiming as such.</p><br/><p>\"Sh… Keep it down, the church is still doing all they can to hunt me down,\" The King hurriedly helped him up.</p><br/><p>\"But… But the notices say that you, Your Majesty… You were hit by witchcraft, and was even kidnapped by that evil, foreign mage who had rushed into the cathedral, how can this…\"</p><br/><p>\"No, the true evil is actually the church,\" The King slowly spoke, in accordance to the script that Benjamin and he had agreed upon. \"They have long cast aside the will of god, and not only have they falsely claimed that I was cursed by witchcraft, so that they could keep me under house arrest, they even tried to kill me! If it weren't for the help of the nobles and the mages, I might have never been able to get out.\"</p><br/><p>The face of the mayor changed dramatically, \"This… The house arrest… Those rumors were true?\"</p><br/><p>He did not suspect the authenticity of the King before him, partly because he had seen the King quite a few times on his annual trips to the capital, and was actually very familiar with him. It was also because of the rumors that had been slowly spreading around in the kingdom.</p><br/><p>Since the King had been locked away by the Church, and the administrative affairs had been handled by them, the people under their reign could not help but feel suspicious; this mayor was the same. When the familiar king appeared before his eyes, naturally, there was a feeling of realization in his heart.</p><br/><p>In addition to that… An instinctive feeling had surged up, causing him to think, for some unknown reason, of the Church in such a way that he felt annoyed and hateful. He felt, then, that the King's words were reliable.</p><br/><p>Only, being rolled into such alarming matters so suddenly, the mayor's face was quickly filled with fear.</p><br/><p>\"Your- Your Majesty… Perhaps you should quickly leave this place. If the members of the Church find out… They are right next door. Please be extremely careful!\"</p><br/><p>The King, however, held his hands, reassuring him, \"Don't worry, the Church won't know that I've come here, if only… If you are willing to help us with a small favor.\"</p><br/><p>\"What- what small favor?\"</p><br/><p>Benjamin, who was standing behind the King and watching things unfold to this point, smiled for a few moments. Then, he cast a look at the two siblings, who were on the side.</p><br/><p>The two siblings nodded, understanding him.</p><br/>\n</div>"}