{"title": "Chapter 854: The Undercurrent of the Capital", "id": 854, "volume": 9, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-854-the-undercurrent-of-the-capital", "volume_title": "Volume 9", "body": "<h1>Chapter 854: The Undercurrent of the Capital</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 854: The Undercurrent of the Capital</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>While the entire Kingdom of Helius was being plunged into chaos, the nobles in Havenwright gathered once again in the secret room of the outer city district, discussing the latest situation with faces full of anxiety.</p><br/><p>\"Have you recently… heard about that Black Nightmare Society?\" When all of them had arrived, someone abruptly raised the question.</p><br/><p>\"Your investigations also led to that?\" Immediately, the nobles began responding, all at once. An old man with white hair nodded, saying, \"My spies in Worchester have been investigating the matter for a long time, and the information sent in the feedback shows that the events this time might be closely related to an organization called the 'Black Nightmare Society'.\"</p><br/><p>\"Does anyone know what on earth that it? Is it the local mages organization there? Or some new gangsters' group?\"</p><br/><p>Nevertheless, the nobles only exchanged looks amongst themselves, shaking their heads helplessly.</p><br/><p>A strange expression flashed across Duke Collin's eyes, but he did not speak. His face mirrored the other nobles' shocked looks as they stared at one another, at a loss, and pretended to know nothing.</p><br/><p>\"Whatever it is, we need to think of a way to clarify this matter,\" after a period of silence, the old noble could only part his lips to speak once more. \"The Church is beginning to mobilize the troops again this time, so something big will definitely happen soon. We must be well prepared before that!\"</p><br/><p>The others nodded. However, all of a sudden, someone asked, \"Duke Collin… Are the mage and His Majesty still in the country?\"</p><br/><p>Duke Collin immediately shook his head. \"I don't know.\"</p><br/><p>\"Didn't you have a way of contacting them, previously?\"</p><br/><p>\"That was previously,\" Duke Collin said with a solemn look on his face. \"Since approximately a few weeks ago, I've not received any news about them. Perhaps they have left the kingdom.\"</p><br/><p>\"So that's to say… You feel that what has happened this time, has nothing to do with them?\"</p><br/><p>\"Not necessarily. It might be their doing, or there might be other factors. I'm also investigating the Black Nightmare Society, but so far, the intelligence I've obtained is as pitiful like what all of you have.\"</p><br/><p>Faced with such a persuasive speech, the other nobles were unable to come up with anything else. All they could do was nod and give up on questioning him. There were a dozen or so nobles there, and every one of them harbored suspicions in their hearts. After discussing with 'sincerity' for some time, they dispersed. Everyone left.</p><br/><p>Duke Collin used the secret passageway to go out as well, but he had only gone halfway when, out of the blue, someone called out to him.</p><br/><p>\"Duke, sir… I have something I wish to speak to you about, in private.\"</p><br/><p>Duke Collin turned around. It was the old noble. There was no one else around them, but the old noble still looked very cautious, his eyes occasionally darting back and forth like a sentinel on the city walls.</p><br/><p>The duke immediately responded, putting on a smile. \"Sir, are you hungry? That can be easily arranged… Right this way, let me invite you to the restaurant next door for some refreshment.\"</p><br/><p>The old noble nodded.</p><br/><p>Thus, after two minutes, both of them walked into the business of the Wood family, and sat down in the secret compartment of the restaurant, closing the door to the room carefully.</p><br/><p>\"Sir, it's completely safe here. If you have anything to say, just say it.\"</p><br/><p>The old man kept away the wariness in his eyes, and spoke slowly. \"Duke, sir. His Majesty the King, and the mage whose name shall not be spoken… They should still be in the kingdom right now, yes?\"</p><br/><p>Hearing that, Duke Collin raised an eyebrow. \"Why do you ask?\"</p><br/><p>The old noble, however, knocked on the table, muttering, \"I understand the situation now. The Church keeps on putting pressure, and we're still unable to contact His Majesty. Our friends from before might have already fallen towards the side of the Church in secret. However… Duke, sir, you can believe me. I am definitely standing on the side of His Majesty.\"</p><br/><p>\"Of course I believe you. Such matters concern life and death, so I believe everyone at the meeting!\" Duke Collin continued to play dumb. \"However, I really know nothing of His Majesty's whereabouts.\"</p><br/><p>\"Is that so…\" The old man had on a disappointed look. \"Please forgive me, Duke. It's just that I've recently received some confidential information concerning something extremely disadvantageous towards His Majesty, so I urgently wish to pass it on to His Majesty.\"</p><br/><p>\"What information?\"</p><br/><p>\"I don't know where from, but the Church has found a perfect stand-in who looks exactly like His Majesty, and has sent him into the palace secretly, ready to familiarize him with everything before replacing His Majesty,\" the old noble lowered his head, with a pained expression on his face. \"However… Her Highness the Queen had felt extremely dissatisfied with that, and took her own life last night.\"</p><br/><p>Hearing this, even Duke Collin himself could not help but draw in a cold breath.</p><br/><p>\"Her Highness the Queen… Really?\"</p><br/><p>\"I'm not completely certain, but it is at least eighty percent confirmed,\" the old man said slowly, \"the Church is suppressing all news now, not letting anyone know about it. At the same time, it seems that they have even prepared a replacement for Her Highness the Queen.\"</p><br/><p>Duke Collin's expression became grimmer and grimmer, as he listened on.</p><br/><p>\"We must not allow such a thing to happen,\" he immediately opened his mouth to speak, \"we can spread the word about the death of Her Highness the Queen. That way, the Church would not have time to prepare, and it would be impossible for their replacements to successfully ascend the throne!\"</p><br/><p>The old noble, however, was somewhat surprised. \"You… really intend to do so?\"</p><br/><p>\"Do we have any other way, then?\"</p><br/><p>\"You could let His Majesty know about this!\" The old noble persuaded, trying his best to convince the duke. \"We can still figure out a way to help the true King back onto the throne, before the replacement is completely prepared. If we drag this on any longer… it would be too late.\"</p><br/><p>Duke Collin's face changed, and he said, \"Sir, you still don't believe me, don't you? I really can't contact His Majesty.\"</p><br/><p>For a moment, the old noble looked crestfallen.</p><br/><p>\"Then I'm afraid we can only sit and await death. If news of the death of Her Highness the Queen leaks out, the first people the Church would suspect would be us. By then, when the replacements have been brought out, they would prove that Her Highness had not died, and the Pope would be rushing to our homes with soldiers.\"</p><br/><p>\"This…\"</p><br/><p>The old noble looked to Duke Collin, somewhat hopeful as he asked, \"Duke, you must have some back up plan, yes? If we go against the Church publicly, what are our chances of escaping out of the kingdom?\"</p><br/><p>\"...I'm afraid that it would be very difficult.\"</p><br/><p>\"If that's the case, then you must not tell another soul about this secret,\" the old noble sighed, saying, \"There is nothing we can do. Let us pretend that this meeting between you and I today is just lunch we had together. Nothing happened.\"</p><br/><p>\"...yes.\"</p><br/><p>Thus, after half an hour, the old noble and Duke Collin left the restaurant one after another, returning to their respective courtyards. After Duke Collin had arrived home, with barely a second's hesitation, he walked into his study and spread out a piece of letter paper. With brushing sounds, he began to write.</p><br/><p>Within two minutes, he quickly finished up a short and simple letter. Sealing the letter up completely, he took the letter to a gambling house that secretly belonged to him, and passed it to the trusted aide who watched over the gambling house.</p><br/><p>\"This letter… Pass it to that person within a day.\"</p><br/><p>Having done all that, he turned around to leave. Walking on the streets of Havenwright, he could not help but lift his head to look into the skies, letting out a long sigh.</p><br/>\n</div>"}