{"title": "Chapter 855: News of a Death", "id": 855, "volume": 9, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-855-news-of-a-death", "volume_title": "Volume 9", "body": "<h1>Chapter 855: News of a Death</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 855: News of a Death</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Benjamin had been busy with the additions to the members of the Black Nightmare Society when he received the letter.</p><br/><p>While the matter of the indulgences was brewing, the name of the Black Nightmare Society has been slowly circulating in the Kingdom of Helius. The people were spreading the word that this was the organization that had made the truth public to the world, which subsequently stirred up the first strike. Because of that, there were also people who quietly inquired about the origin of the organization.</p><br/><p>Very soon, the fact that the Black Nightmare Society had first distributed invitations in the taverns of Worchester was discovered. More and more people began to surge into Worchester, and amongst them… were those who also harbored resentment towards the Church, as well as people who wanted to find out more news.</p><br/><p>Benjamin had the intentions to take the next step in expanding the Black Nightmare Society, so naturally, he snuck quietly into the taverns and began to screen the variety of people there. It was possible that the spies of the Church had also come, so he needed to be extremely careful. Whenever he heard someone asking about the relevant information, he would scan them ten times at the very least, and check out the person's background thoroughly before initiating contact with them.</p><br/><p>This was definitely not an effective method to expand their membership, but at least he could absolutely guarantee their safety.</p><br/><p>\"So far, there are two hundred and seventy five members in the Black Nightmare Society. Most of them are youths below the age of thirty five, including eighty seven mages… Based on this momentum, it should not be difficult to reach a thousand,\" the System reported.</p><br/><p>Benjamin nodded as well.</p><br/><p>Right then, he had just left another round of the Black Nightmare Society's mobilization meetings. Returning to the outpost of the Academy's Black Operation, he then received the letter sent from Havenwright.</p><br/><p>It took only about half a minute, from the moment he opened the letter to when his facial expression began changing slightly. By the time he had finished reading the letter, his entire expression had become grim. Rubbing his chin, he fell into deep thought.</p><br/><p>The letter was crumpled up into a ball and stuffed into his pocket, to prevent it from being seen by the King.</p><br/><p>\"Tut tut… Something fun has happened again,\" the System said with great interest in his mind, \"What do you plan to do? Pretend that you know nothing and continue on with the plan at your own pace? How interesting…\"</p><br/><p>Benjamin shook his head impatiently, saying, \"Don't talk so much.\"</p><br/><p>The bad news delivered by the entire letter had already put him in a bad mood, so he really did not have the presence of mind to deal with the System's glee at such misfortune. Things had been going on so well that he had not imagined that the Church would drive the Queen to her death at such a time as this</p><br/><p>That was right, drove her to her death… Although Duke Collin stated in the letter that the Queen had killed herself out of hopelessness, Benjamin's point of view was that if the Church had not wanted the Queen to die, it would have been impossible for her to succeed in her suicide even if she had truly wished to die.</p><br/><p>This entire letter from Duke Collin spoke of two matters: the replacements, and the news of the Queen's death. Benjamin had long been prepared for the news of the replacements, so it was nothing much. However, the news of the Queen's death… Benjamin did not dare imagine how the King would react if this reached his ears.</p><br/><p>He even felt that the Church had done this on purpose.</p><br/><p>Driving the Queen to die, or just by spreading such false news, would disturb Benjamin's momentum here. Although they could use the spiritual imprint to forcefully control the King, it would still affect their upcoming operations. If the officials realize that there was something unnatural while they spoke with the King, they might remember the rumors about the \"witchcraft\", and doubt might emerge in their hearts.</p><br/><p>Also, if he took another step back, Duke Collin's words might not be true. Perhaps those nobles only wished to deceive them and get the King back on their side, and so they had come up with such nonsense, just as they had done with the mutiny before this.</p><br/><p>Because of that, after a lot of thought, Benjamin decided to keep this news quiet.</p><br/><p>However… Right at that moment.</p><br/><p>\"Bad news!\" The person in charge of the Academy's Black Operation walked in hurriedly from outside, nodding towards Benjamin before opening his mouth to speak. \"Director, sir, the latest news obtained from the outside is that the Queen has been assassinated in the palace, and has passed away a few days ago!\"</p><br/><p>\"...\"</p><br/><p>Benjamin was at a loss for words.</p><br/><p>This…</p><br/><p>He even thought that, perhaps, he had heard him wrong.</p><br/><p>How could there be such a coincidence? Was this done on purpose?</p><br/><p>\"...are you sure you are not mistaken?\" Taking a deep breath, he quickly calmed down, and shot back with a question. \"What is your source? We have contact with so many officials in the Kingdom of Helius, and even if the Church has released an announcement, it's impossible for it to be passed down so quickly.\"</p><br/><p>\"The news are on the streets, and there are also Holy Knights who have appeared suddenly in every city, shouting about it in the form of condolences,\" the person in charge bowed his head as he answered. \"They… seemed to have kept the news brewing in secret for a long time, suddenly releasing it in an explosive manner so that everyone knows about it now.</p><br/><p>Half a minute later, around the corner of the street, a troop of Holy Knights slowly turned the corner.</p><br/><p>It was a troop of approximately a few hundred men, raising portraits of the Queen up high with their hands and shouting words such as 'we mourn the death of Her Highness'. Black cloth was hung on every person's shoulders, making them look extremely somber. The passersby watched them in a daze, feeling suddenly shocked and confused; their emotions covered up the disdain that they should have shown.</p><br/><p>\"Her Highness the Queen… has passed away?\"</p><br/><p>\"What on earth happened?\"</p><br/><p>Similar sights were happening all over the kingdom at the same time. Very quickly, the priests, who had been hiding for a long time, appeared once again to put up obituaries with their own hands on the notice boards in every city.</p><br/><p>Her Highness the Queen had been assassinated by a despicable mage, and had passed away yesterday due to her injuries.</p><br/><p>Faced with such an explanation, the people looked at each other, unsure of what was going on. The Church had said that a mage had kidnapped the King and killed the Queen, but on the other side, there were voices saying that the Church had kept the King under house arrest and created the lie of the indulgences to obtain gold. Shocking news had been surfacing one after another, and the people were beginning to find it difficult to cope.</p><br/><p>Meanwhile, in an attic in Worchester…</p><br/><p>\"Why… Why have they done this?\"</p><br/><p>The King walked in with a blank look on his face, as though he had yet to react completely to the news; he sunk into an unwillingness to believe the news, but his face was unusually white.</p><br/><p>\"Your Majesty, you must remain calm. This is the trick of the Church.\" Benjamin hurriedly walked up to comfort him. \"They are only using this to divert the people's attention so that they forget about the issue of the indulgences, and to cause you to lose your ability to think rationally. You must not fall into their trap!\"</p><br/><p>\"But… But… They…\" The King began to speak incoherently; he started to become agitated, wanting to say something but unable to piece his words together.</p><br/><p>Seeing this, Benjamin took a deep breath and gave the two siblings, who were standing on the side, a look. The two siblings saw him, and nodded. Standing behind the King, they raised their hands.</p><br/><p>Oscillations of spiritual energy began to ripple out slowly.</p><br/><p>In the next second, like a machine being switched off, the King closed his eyes and immediately lost consciousness. The two siblings held him up, before raising their heads to look at Benjamin helplessly.</p><br/><p>\"Is it possible to make him forget all this?\" Benjamin rubbed his temples, asking.</p><br/><p>\"We can… But there are Holy Knights shouting and yelling outside, once he sees all that, he would still remember it.\"</p><br/><p>Benjamin turned to look at the sight outside the windows, feeling only a bout of headache.</p><br/><p>\"...Just let him sleep first,\" finally, he shook his head and closed the curtains, saying thus to the two siblings.</p><br/>\n</div>"}