{"title": "Chapter 864: The Trump Card of the Nobles", "id": 864, "volume": 9, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-864-the-trump-card-of-the-nobles", "volume_title": "Volume 9", "body": "<h1>Chapter 864: The Trump Card of the Nobles</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 864: The Trump Card of the Nobles</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>\"Is this… the legendary Mage Benjamin? I've heard of your great name for a long time now, sir. To be able to finally meet you today is truly an honor.\"</p><br/><p>In a dense forest in the northernmost part of the Kingdom of Helius, by the Spirit Abyss, six nobles had arrived after putting on their disguises, seeing Benjamin, who had come for their appointment. They did not seem too high spirited, but the moment they met, they still whipped out the flattery that served as their lifeline, speaking as they surveyed him from top to bottom.</p><br/><p>Hearing that, the corners of Benjamin's mouth twitched.</p><br/><p>\"You have all seen me numerous times when I'd lived in the capital, so don't say such things,\" he was in no mood to go through civilities with them, and asked straightforwardly, \"Talk. Why have you sought me out?\"</p><br/><p>The nobles clearly looked somewhat awkward, due to their flattery backfiring. However, after exchanging looks amongst one another, very soon, Duke Collin stepped forward and spoke, \"We wish to know the truth behind His Majesty's death.\"</p><br/><p>However, Benjamin shook his head, and asked them back, \"Whatever the truth is, does it still mean anything to you now?\"</p><br/><p>Duke Collin replied in a resolute and decisive manner. \"Of course, it's extremely important!\"</p><br/><p>\"Alright, then,\" Benjamin sighed, and slowly spoke. \"It's Grant, your Pope His Highness. He followed me from Worchester, and finally found the King's location. During our fight, he had killed His Majesty the King through deceit, and I was unable to stop him, so… things have become as they are now.\"</p><br/><p>\"The Pope…\"</p><br/><p>Upon hearing this answer, the nobles looked at each other and gasped in surprise, all at the same time. However, if one were to truly look into their eyes, there could not be said to be much surprise.</p><br/><p>As though that they had long expected this result.</p><br/><p>\"What is the situation in Havenwright now?\" Benjamin asked in passing, \"The King has died, the Queen has died… They don't even have a nominal puppet now, what does the Church intend to do?\"</p><br/><p>\"...They plan to crown the little Princess.\"</p><br/><p>\"She's only four years old this year, isn't she?\" Benjamin frowned, \"Supporting a little four year-old girl, what's the difference between that and usurping the throne? Are you guys able to accept that?\"</p><br/><p>The nobles shook their heads in unison.</p><br/><p>\"It's because we are unable to tolerate something like that happening, that we must meet with you,\" Duke Collin gritted his teeth, saying, \"let me just get straight to the point. The six of us here, including me, have secretly raised an army in our territories.\"</p><br/><p>\"Army?\"</p><br/><p>\"That's right, an army. Soldiers who are well trained and completely able to contend with the official army,\" another noble opened his mouth to speak, \"we dare not raise too many, but by gathering everyone's power, we have about fifty thousand men.\"</p><br/><p>Hearing this, surprise sprung out of Benjamin's heart.</p><br/><p>Was there really an army?</p><br/><p>Private armies were strictly forbidden in the Kingdom of Helius; this was the strictest decree implemented by the Church. Because of that, the nobles had always shown themselves to be utter weaklings who would play small tricks at most. They did not look at all like they have the courage to keep an army.</p><br/><p>Also, the nobles had always shown a tendency towards being peaceful reformists, stubbornly afraid to oppose the Church publicly. However, right now, to say that they actually had an army was truly rather sudden.</p><br/><p>These people… had been keeping too big a secret, had they not?</p><br/><p>\"Under the surveillance of the Church? You really have an army?\" Thinking thus, Benjamin did not disguise his doubt but expressed it.</p><br/><p>\"There are many remote areas in the Kingdom of Helius. It's impossible for the Church to infiltrate every corner,\" Duke Collin answered, however, \"In actual fact, we don't just have an army; adding up all the mages every household of ours has been nurturing, we already have a three digit number.\"</p><br/><p>\"...Everything you're telling me, is serious?\"</p><br/><p>\"Of course it's serious,\" Duke Collin looked somewhat anxious, \"the Pope is already starting to suspect us. If we don't do something and the time comes, no one would be spared from this.\"</p><br/><p>Hearing that, Benjamin rubbed his chin and fell into deep thought.</p><br/><p>If all that these nobles had said were true…</p><br/><p>Then, in a situation where they had lost the support of the royalty and things had come to a deadlock, a new turn of events had presented itself before their eyes. An army of fifty thousand might not be much, but after the Church had officially helped the Princess onto the throne, it would definitely ignite a new bout of dissatisfaction. Similar to how General Stuart had wielded power in Ferelden, insurgents would spontaneously emerge from the midst of the people to oppose the rule of the Church.</p><br/><p>By that time, those insurgents… would actually be their own people.</p><br/><p>Other than that, there was already a batch of mages hurrying over here from the Academy of Magic. If Benjamin were a bit more ruthless, putting together a great army of a few thousand mages would not be a difficult task.</p><br/><p>They were about to have the power to fight the Church head-on.</p><br/><p>\"Since you possess this power, why haven't you told me earlier? Why must you delay it until now, before you're willing to talk?\" However, Benjamin still shot them these questions.</p><br/><p>\"...This was our trump card, to ensure our survival.\"</p><br/><p>\"If you had taken this trump card out earlier, His Majesty the King might not even have died.\"</p><br/><p>\"...\"</p><br/><p>The nobles were attacked in such a way that they had nothing to say. They lowered their heads; Benjamin did not know if they were regretting their decisions back then.</p><br/><p>\"I need to see your army. We can discuss further after I've confirmed everything,\" Benjamin continued speaking, \"I hope you understand that, with things coming to this, you will have no way to turn back. You can only forcefully resist the Church until the end.\"</p><br/><p>\"Of course we understand, or we wouldn't be divulging all of this today.\"</p><br/><p>Hearing that, Benjamin nodded.</p><br/><p>Thus, after the short meeting, he and the few nobles left the remote forest, hurrying towards their respective military stations. The upcoming plan was going to be extremely dangerous, so confirmation with his own eyes was necessary. Otherwise, he would not be able to ascertain whether the words of the nobles was true or false.</p><br/><p>After approximately half a day, they had flown to various locations in the Kingdom of Helius, and Benjamin had seen the six armies hidden deep in the mountains and forests.</p><br/><p>Although secretive, the facilities in every camp were absolutely complete; it was apparent that the nobles had invested a lot of money into them. The surprising thing was that every army had at least four to five years of organizational history. It was as though the nobles had begun preparing all of this since a long time ago.</p><br/><p>\"This is the deepest secret of every family. Like the Fulner family, who had raised an army of over twenty thousand men. It's a pity that when their family was destroyed, the secret army had been dragged out as well, and buried alive by the church in the outskirts of the Mountains of Magic Beasts.\" While spectating, Duke Collin gave an introduction, sending chills into Benjamin's heart.</p><br/><p>So… would the Lithur family have such an army as well?</p><br/><p>He did not know, but so much time had passed that this question was no longer meaningful.</p><br/><p>Going through six camps, Benjamin carefully sensed through every corner of the camps. The System also did a complete scan. Finally, he could confirm that everything the nobles had said was true.</p><br/><p>Under the noses of the Church, they had truly hidden, quietly, an army of fifty thousand.</p><br/><p>\"Now, Director sir, you can believe in our determination, yes?\" After that, in the village by Pearl Lake, they met once again. The six nobles looked at Benjamin as though they were gazing at the last straw they had to catch to survive. \"We can begin discussing the matter of how to bring the Church down.\"</p><br/>\n</div>"}