{"title": "Chapter 871: “Traitor”", "id": 871, "volume": 9, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-871-traitor", "volume_title": "Volume 9", "body": "<h1>Chapter 871: “Traitor”</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 871: “Traitor”</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>In the end, Benjamin left the blueprint with Morris, leaving the professional to slowly study it.</p><br/><p>Even if they were to figure out St. Peter's Cathedral and find its weak spot, it would not be something they could use immediately. So far, they had only destroyed some of the Church's sources for military armaments, defeating the Church a few times. However, it was still very difficult for this \"Black Nightmare Army\" to contend with the royal army, as it had always been.</p><br/><p>The difference in armaments and their level of training was especially stark compared to the official army.</p><br/><p>Faced with such a situation, Benjamin did not plan to take the path of delicate management. To be precise, this messy army troop that was still forming, bit by bit, in the middle of war and plundering would never be trained. They could only rely on their numbers.</p><br/><p>Because of that, he quickly sought out the person in charge of the Academy's Black Operation.</p><br/><p>\"What is the size of the rebel army in the kingdom?\"</p><br/><p>The person in charge replied, \"If you include those miscellaneous units, there are about eight groups with at least a thousand men. Three in the north, five in the south, and all of them have conquered their respective turfs. Some of them have even taken over a few remote little towns. However, so far, they are still in quite a state of disarray. They fight separately, so it can't be said that they are making any big impacts.\"</p><br/><p>Hearing that, Benjamin nodded, satisfied.</p><br/><p>\"Figure out a way for me to contact the leaders of these eight forces,\" he gave his order, \"within a month, I need to gather these people and have all of them join our troops.\"</p><br/><p>The person in charge hesitated, saying, \"This… They might not join willingly.\"</p><br/><p>\"They'll be willing,\" Benjamin snorted, saying, \"The church did not have time in the past to pay them any attention, because of Icor's pressure on the borders. Now that the church has responded, they will surely point their spearheads at them, and of course, with us included. Wait until they are backed into a corner. They will naturally be willing to join us.\"</p><br/><p>Hearing this, the person in charge nodded and did not say another word. He turned around and headed off to make the preparations.</p><br/><p>Benjamin took out the transmission woodpiece.</p><br/><p>\"Do you think the time is ripe?\" the System suddenly emerged, as though it had guessed what Benjamin was about to do, and asked him in his mind.</p><br/><p>\"If it's not ripe, then I'll ripen it. We've taken this step, and I have nothing to hide,\" Benjamin took a deep breath, replying slowly, \"the secret army has been training for so long. It is time to let them out for a breath of fresh air,\"</p><br/><p>He intended to transfer the special army that used runic tools as weapons here.</p><br/><p>The force led by the former head of Knights, Lance, had achieved the size of approximately a thousand men since its establishment. And, through the report that Varys had given him, every soldier in the force could skillfully wield the runic tools, and would not lag behind in the slightest in a one on one fight with mages. They were also considerably capable in group fights.</p><br/><p>In the situation now, they had already officially waged war on the Church. It was a matter of time before the two parties clashed head on. It was really unnecessary for him to continue hiding this troop of army that was able to change the situation of the times.</p><br/><p>After all, commoners were able to use powerful magical instruments; this was one aspect in which they were more skillfully advanced than the Church. Bringing this out during times of need, they could catch them unprepared and completely beat the Church.</p><br/><p>\"Do you plan to bring them over directly?\" the System asked.</p><br/><p>\"We can use the Spirit Abyss, smuggling them over would be very easy,\" Benjamin answered, \"however, since this is our trump card, naturally there needs to be a buffer. I won't let them appear immediately.\"</p><br/><p>\"Then how are you going to do it?\"</p><br/><p>Benjamin only smiled. He did not reply.</p><br/><p>He believed that the people of the Church would definitely like this \"surprise\" of his.</p><br/><p>At the same time.</p><br/><p>In the city hall of Rhein City, the atmosphere was as cold as lake water under 30 degrees Celsius.</p><br/><p>Grant stood on high, his face as cold as steel. He swept his gaze over the priests, officers and Holy Knights in the hall, again and again. Everyone was silent, unable to speak even a word.</p><br/><p>\"How did he know that our workshops were in Rhein City?\"</p><br/><p>After a long silence, Grant opened his mouth to ask. HIs tone could be considered quite gentle, under such circumstances.</p><br/><p>\"...No one knows what's going on,\" the leading bishop took a deep breath and gathered his courage, \"the situation is extremely unfavorable to us, those mages could have obtained an intelligence means that we are unable to deal with,\"</p><br/><p>\"For example?\"</p><br/><p>The bishop took a gulp, as a determination to get through with it surged up in his heart. Things had come to this, and it was difficult for him to escape the responsibility of the mistakes. He was also afraid that the Pope would not let him continue living. If that was the case, then he might as well just fight for it.</p><br/><p>Because of that, he immediately answered, \"For example… I think that someone is betraying our information.\"</p><br/><p>Hearing that, Grant's eyebrows moved.</p><br/><p>\"Are you saying that spies have appeared in our midst?\"</p><br/><p>\"That's it!\" Looking at Grant's expression, a sliver of hope emerged in the heart of the bishop, and he immediately struck while the iron was hot. \"We have just inspected the collapsed church, inside… the oil painting that hid the secret has vanished, it's very likely that the devil has taken it away. As for the secret inside the oil painting, other than the members of our Church, who else would be able to divulge such a thing? There must be a spy amongst us!\"</p><br/><p>Saying this, he had already thought of who to shift the blame to.</p><br/><p>In reality, he was very clear that, with the Pope's brutal style of governance, there would definitely be someone who would have to lose their life when things go wrong. As for him, being the main person in charge in Rhein City, he was forced to think of a way to shift the anger of His Highness to another person, if there was to be a chance for him to escape.</p><br/><p>So… he had some colleagues who did not seem very devout to him, usually, and had been kept around until now. It seemed that this was a good chance to clean up the Church.</p><br/><p>Whatever it was, he… He did not want to die.</p><br/><p>Also, after listening to the bishop's explanation, Grant quietened down once again. His eyebrows furrowed tightly, as though he was really contemplating the possibility of a spy.</p><br/><p>\"Come with me!\"</p><br/><p>After being in thought for a long time, he suddenly lifted his head and gave the bishop a wink, before turning around and walking towards a room deep within the corridor of the city hall. Seeing that, the bishop immediately understood him, and followed Grant from behind obediently, and walked over.</p><br/><p>The other people in the hall watched as Grant and the bishop disappear behind the end of the corridor. Thinking about the conversation prior to this, they could not help but shiver.</p><br/><p>\"A spy… is it true?\"</p><br/><p>\"I'm not sure as well.\"</p><br/><p>\"Do you think… whose name will Bishop Carril report to His Highness the Pope? Will His Highness the Pope believe him? If I remember correctly, he seemed to have had a beef with Bishop Klein before…\"</p><br/><p>There were secretive whispers amongst the priests.</p><br/><p>No one knew what the actual situation was, but at the moment, they were keenly aware that there was likely to be another bout of bloodshed within the Church soon.</p><br/><p>How had things gotten to this?</p><br/><p>Many people felt somewhat confused. They vaguely felt that this Church was no longer the Church they had joined in the beginning, not even in the slightest bit.</p><br/>\n</div>"}