{"title": "Chapter 870: A Triumphant Return", "id": 870, "volume": 9, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-870-a-triumphant-return", "volume_title": "Volume 9", "body": "<h1>Chapter 870: A Triumphant Return</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 870: A Triumphant Return</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>As the church collapsed, there was a sudden and clear sound of a horn blowing in the west of the city. Strengthened by magic, the sound spread throughout war-torn Rhein City.</p><br/><p>The amplified voice of the commander rang out.</p><br/><p>\"Soldiers, retreat!\"</p><br/><p>In the sky, the mages had just ended another exchange of fire with the priests. Receiving the order, Joanna cast a look at the enemy resentfully. At the time, the team of priests was thinly scattered; there was only approximately half of what had been there in the beginning. The bishop also looked like he was in a rather bad shape. After continuously crushing numerous crosses, the Holy Light around him had finally thinned out. It was possible that they would be in a desperate position after another ten minutes.</p><br/><p>Also, the mages on Joanna's side even had residual energy.</p><br/><p>It was a pity. Just a little more, and they could kill them all…</p><br/><p>However, this was the plan they had set earlier on, and Joanna knew that additional aid for the church would arrive soon. Because of that, they turned around quickly and swiftly flew towards the prearranged direction.</p><br/><p>At the same time, a change instantly came over the army that had descended into chaos below them. The \"Black Nightmare\" army, who originally had a numerical advantage, all withdrew themselves from the battle at that moment. From a bird's eye view, they retreated through the streets like the tide, rushing towards the broken gates in the west of the city.</p><br/><p>Compared to them, the reaction of the church and the royal army was significantly slower.</p><br/><p>\"We… have beaten them out?\"</p><br/><p>In the skies, the bishop watched the retreating army in shock and doubt. In the spur of the moment, he did not even think about chasing after them. There was only a faint sense of relief.</p><br/><p>Having just fought the teams of mages, the short ten or so minute had crushed his confidence. He had studied the divine arts for so many years, and yet he had been completely pushed down. If it had not been the fact that they possessed the skills to cast Union Magic, the bishop even suspected that he would have already been burnt into ashes by that frightening fire by then.</p><br/><p>The strength of this group of mages… had greatly surpassed the priests that they had nurtured. As for the power of the superiors, he knew that he definitely could not defeat the witch who could control fire.</p><br/><p>How many more people like this did the Academy of Magic have?</p><br/><p>The bishop could not help but feel a thrill of dread in his heart. Because of that, when the mages had suddenly retreated, he had basically lost his intention to fight. All he could feel was a long sigh of relief; with god's blessings, he had had a narrow escape.</p><br/><p>However, when they landed on the ground and confirmed the situation of the battle with the commanding officers…</p><br/><p>\"The, the church… has been destroyed?\"</p><br/><p>Looking at the pile of debris on the levelled ground, the bishop stood rooted to the ground with a face full of disbelief. It was at this moment that he finally realized what the devil, who had not shown himself, had been up to.</p><br/><p>\"What should we do? Why did they suddenly withdraw their troops? Should we give chase?\" Beside him, a government officer hurried over quickly and looked at the bishop, asking in confusion.</p><br/><p>\"...Don't give chase. What if it's a trap?\"</p><br/><p>Hearing that, the officer nodded and left. However, after just a short while, a few Holy Knights rushed over and hurriedly leaned in to the bishop's ears, saying something in a low voice. Subsequently, another change came over the expression of the bishop.</p><br/><p>\"How is it possible? How do they know? It's impossible…\"</p><br/><p>His entire face was white, and his voice raspy, giving a reaction that was greatly more severe than when the enemy had attacked the city.</p><br/><p>The Holy Knight lowered his head, speaking hesitantly, \"No one knows what to do, but… right now, all the workshops have been destroyed. What shall we tell His Highness the Pope?\"</p><br/><p>The bishop was frozen in place, however. He could not speak a word.</p><br/><p>After a few minutes, a figure covered in Holy Light suddenly appeared in the skies, bringing a great and tightly packed team of priests, flying from the direction of Havenwright.</p><br/><p>\"His, His Highness the Pope…\"</p><br/><p>The bishop lifted his head and looked at the figure. His entire body trembled as his limbs turned cold.</p><br/><p>Meanwhile.</p><br/><p>\"It looks like they don't intend to chase us.\"</p><br/><p>Benjamin led the great army into a retreat while looking towards the direction of Rhein City cautiously. Based on the responding reports of the sentinels, the church had not sent any soldiers to pursue them, and he had cleared off the spies who had followed them by using the water elemental sensing technique.</p><br/><p>At the moment, they had already distanced themselves greatly from the main road and were hidden in a valley. Benjamin had specifically arranged for a team of mages to bring up the rear and clean up the traces of their activities at the same time, to ensure that no one could catch on to their route of retreat.</p><br/><p>After such lengths, the Church should not be able to track their location.</p><br/><p>Benjamin gave a sigh of relief.</p><br/><p>\"I suggest that you don't be too delighted yet,\" the System, however, seemed to have read his expression, and dampened the mood by saying, \"you are retreating to the west. All the Church has to do is just give it some thought, and they would be able to figure out by using even their belly buttons that you guys are hiding in the Mountains of Magic Beasts.\"</p><br/><p>\"So what?\" Benjamin shook his head, saying, \"The Mountains of Magic Beasts are so big. They would need at least two months to find us. With that amount of time, we would have moved away already. What's there to be scared of?\"</p><br/><p>The System was temporarily speechless.</p><br/><p>Thus, after marching for half a day, he led them once again to the Mountains of Magic Beasts, back to the encampment to rest and recuperate. The operation this time could be considered a huge victory; after a headcount, their own troops had suffered a loss of approximately two thousand men, and there were basically no casualties amongst the mages. According to them, they had even taken the opportunity to kill many priests.</p><br/><p>Benjamin was very satisfied. After he was done with the arrangements for the rewards, he brought the oil painting to the main tent of the logistics department.</p><br/><p>\"The painting you wanted, should be this one, right?\"</p><br/><p>He put the oil painting on the table. Morris hurriedly pushed his wheelchair over and picked up the painting in his hands.</p><br/><p>\"...This is it.\" After spending a few moments inspecting it carefully, Morris nodded and suddenly took out a bottle of purple medicinal liquid, slowly pouring it onto the back of the oil painting. As the medicinal liquid seeped in, gradually, a dense pattern suddenly emerged onto the empty back.</p><br/><p>After about half a minute, the lines intertwined, finally forming a picture that looked slightly like an architectural drawing, but a hundred times more complex.</p><br/><p>Benjamin looked at it, furrowing his eyebrows.</p><br/><p>\"This is the blueprint of St. Peter's Cathedral,\" Morris introduced, \"rumor has it that it was designed cooperatively by a dozen or so masters, thousands of years ago, using the best rune techniques of their time to successfully build it. There are even… many who say that there was a room in the cathedral that was directly connected to the Realm of God. Those masters had used their superb skills to turn the Realm of God into the source of power for the entire cathedral, which is what makes it so indestructible.\"</p><br/><p>Hearing that, Benjamin rubbed his chin, saying nothing.</p><br/><p>However, he was well aware of the Realm of God and the cathedral's secret room. Without more, the key to the room was even in his hands at the moment!</p><br/><p>By snatching away the key, had he inadvertently weakened the power of St. Peter's Cathedral?</p><br/><p>Because of that, after hesitating for a moment, Benjamin suddenly said, \"About that… If I were to tell you that the only key to the so-called room connected to the Realm of God was in my hands, would the situation change?\"</p><br/><p>\"...\"</p><br/><p>Morris was stunned.</p><br/><p>Seeing that, Benjamin could only take out the ginkgo leaf that had gone through special treatment and show it to him. \"This is it. Without it, the members of the Church can't even open that door. They had suddenly attacked Icor in the past, and it had been for this thing.\"</p><br/><p>Morris took a deep breath and came back to his senses. He looked at Benjamin with an incredulous look in his eyes, and only spoke after a long while of speechlessness. \"...You are really a weirdo.\"</p><br/><p>Benjamin shrugged.</p><br/>\n</div>"}