{"title": "Chapter 874: Mobilization and Blockade", "id": 874, "volume": 9, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-874-mobilization-and-blockade", "volume_title": "Volume 9", "body": "<h1>Chapter 874: Mobilization and Blockade</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 874: Mobilization and Blockade</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>The Black Nightmare Army began to mobilize quickly.</p><br/><p>Moving tens of thousands of people at the same time was sure to attract a lot of attention. Because of that, they still did what they had done before the attacks; they took off their armor and were divided into dozens of teams, dispersing and leaving the mountains in different directions like the commoners who were fleeing for their lives.</p><br/><p>The periphery of the Mountains of Magic Beasts was thick with spies. When people continuously walked out from the mountains, these spies naturally noticed that changes had occurred to the situation in the mountain.</p><br/><p>They immediately turned to issue a message.</p><br/><p>\"Shift? What is going on? Could it be that there are people leaking our information again?\"</p><br/><p>In St. Peter's Cathedral, the bishop listened to the Holy Knight's report, and his face fell. He thought of the expression that the Pope would probably have after learning the news, and could not help but shiver.</p><br/><p>They had to quickly sort it out…</p><br/><p>\"Where is the destination of the Black Nightmare Army? I don't believe that they can find any natural hiding spot in such a short time,\" the bishop hurriedly gave his orders, \"and immediately gather the separate army troops, block those rebels!\"</p><br/><p>\"But… they are all moving separately.\"</p><br/><p>\"Then just do your best and block as many as you can!\"</p><br/><p>\"Understood.\"</p><br/><p>The Holy Knight turned around and hurriedly left the church. The bishop took a deep breath, thinking carefully about how he was to announce this news to His Highness the Pope.</p><br/><p>Under their orders, the soldiers all over the land quickened.</p><br/><p>They had no way to form a blockade within such a short period of time and seal up all of the Mountains of Magic Beasts. Thus, they chose a few of the main roads in the area and built outposts to screen all pedestrians going through. Only… the resulting effect was not exactly satisfying.</p><br/><p>In actual fact, having taken off the armor of the Black Nightmare Army, most of the soldiers were merely commoners from various places in the country. Under such a chaotic situation within the kingdom, it was very difficult for the Church to identify who were the ones who had joined the Black Nightmare Army, and who were only fleeing for their lives.</p><br/><p>Because of that, when the bishop took these results to make his report after a day had passed, Grant's expression was not at all pleasant to look at.</p><br/><p>\"Fifty two people. The enemy has an entire army moving, and you managed to capture fifty two people?\"</p><br/><p>\"This… They shifted too suddenly, we've already tried to block them as fast as we can,\" the bishop could only toughen his skin and explain, \"however, don't worry, Your Highness the Pope. We've already checked their memories and have obtained a lot of valuable information.\"</p><br/><p>\"Such as?\"</p><br/><p>\"The number of people in the Black Nightmare Army, their armaments… The mages in their army are already in the thousands, and the devil is in the army, giving orders as he wishes.\"</p><br/><p>\"Only these? What use are these? Where is the enemy's intelligence coming from? What is their next battle plan?\"</p><br/><p>\"This… Well, the ones we've caught are only common soldiers. There's no way to interrogate them about such things.\"</p><br/><p>Hearing this, there was a flash of fury in Grant's eyes. However, perhaps due to other considerations, he still closed his eyes and regained his composure, not letting himself explode on the spot.</p><br/><p>The bishop was terribly frightened as well, and hurriedly added on, \"Your Highness, don't fret, even if they move out from the Mountains of Magic Beasts, we already know where their next destination is!\"</p><br/><p>Grant opened his eyes. \"Where?\"</p><br/><p>\"At Pearl Valley.\"</p><br/><p>Hearing that, Grant took a deep breath, revealing an indifferent and resolute expression.</p><br/><p>After a few hours, horns were sounded suddenly, at the city gates of the capital. Groups of priests flew out from Havenwright, directly speeding towards the north. The royal army was also in an organized position, as though they were about to go out into battle, surging towards Pearl Lake with grandiose.</p><br/><p>Standing in a loft, Duke Collin watched the great army march out, his face full of worry.</p><br/><p>\"This is… They are going into battle so soon?\"</p><br/><p>The six nobles who secretly supported Benjamin were now standing in the loft. They watched the cluster of Holy Light leading the priests in swift flight. They understood what this scene meant.</p><br/><p>Ordinary bandits would not necessitate the action of the Pope. There was only one person in this world for whom the Pope would set out for.</p><br/><p>\"Duke Collin, you've gone to the camp and observed them last time… Do you think they can win?\" A noble took a step forward and asked anxiously.</p><br/><p>\"I don't know…\" Duke Collin was quiet for a while, before he shook his head and said, \"But based on what Director Benjamin has told me, the time is not yet ripe. They seem to still be gathering their forces.\"</p><br/><p>Hearing that, the other five were immediately slightly disconcerted.</p><br/><p>\"Then what should we do? If they lose the battle, he could still escape with those mages, back to the academy, but, but we would surely be exposed! Duke, sir, we… We cannot sit here and await death!\"</p><br/><p>Duke Collin nodded as well. \"It's best we leave the capital and lay low outside for a while.\"</p><br/><p>The nobles exchanged looks amongst themselves. Having no better idea, they nodded. To leave the capital at such a time would mean that they were being suspicious and had something to hide; every little movement they make in the shadows would all be exposed in the eyes of the Church. However, if they stayed… it would seem that they could only wait for fate to judge them.</p><br/><p>They would only be able to live if Benjamin was completely victorious and invaded the capital in a counter-attack. If not, even if both parties lost, the Church would definitely discover those few family knights they had sent over while battling the Black Nightmare Army.</p><br/><p>They were regretting sending their knights there to represent them now…</p><br/><p>\"We pack our things and immediately get out of the country,\" another noble said, \"We are completely able to run to the Academy of Magic. Under such circumstances, the great director will surely be willing to accommodate us temporarily.\"</p><br/><p>Duke Collin nodded. However, based on his expression, he seemed to be mulling over other matters...</p><br/><p>Nevertheless, just as they were discussing their escape, a person who looked like a butler suddenly ran in. He lowered his voice, but in his haste, he could not control suppress his voice enough, \"Duke, sir! Urgent news!\"</p><br/><p>The nobles turned their heads in unison.</p><br/><p>\"What's the matter?\" Duke Collin's face changed as he asked.</p><br/><p>\"The Church is preparing to seal up the capital again,\" the person halted in his footsteps and reported to the nobles, \"the priests who has stayed back are already appearing at every city gate, blocking all the citizens who are about to leave the city.\"</p><br/><p>Hearing this, the faces of the nobles instantly turned ashen white.</p><br/><p>\"Seal up the city… Why? Could the Church have suspected something?\"</p><br/><p>They looked at each other in an exchange of the shock and anxiety in their eyes. Although the capital had been under increasingly strict security under special circumstances, and the blocking of the city gates was not a rare sight, but this time, it had cut them right on their lifeline.</p><br/><p>They could not help but cast darker thoughts.</p><br/><p>\"How long will the lockdown last? How strict is it? Is there no way at all to get around it?\" Duke Collin continued asking.</p><br/><p>\"We have received information from Holy Knights close to us that the orders of the Pope this time are very strict. Not a single person is allowed to leave the capital. Only when the great army that has gone out for battle has returned can they reopen the city.\"</p><br/><p>The faces of the nobles, which had just begun recovering with a slight flush of blood, immediately turned as white as paper once more.</p><br/><p>\"...we're done for.\" Someone closed his eyes and was silent for a while, before speaking in despair. \"I'm afraid the Church has discovered that someone has been secretly sending information out. The blockade this time has turned us into cats on hot bricks. If we try to escape, even in the slightest, we will immediately be exposed in their eyes, and dragged out to be executed, but… if we don't run, we won't be able to stay alive when the Pope comes back.\"</p><br/><p>Saying thus, the nobles lowered their heads, with their faces in their hands, feeling awful. Finally, the entire secret loft fell into a deep silence. Everyone was feeling rather hopeless. No one said a word.</p><br/><p>The messenger boy stood rooted to the spot,</p><br/><p>\"...We only have one way to survive.\"</p><br/><p>After a long silence, Duke Collin suddenly lifted his head. His voice sounded abnormally raspy.</p><br/><p>Immediately, the other five men turned their heads in unison to look at him.</p><br/><p>\"The Pope has left, the royal army has left, and most of the priests and bishops have left,\" Duke Collin said in a strangely slow voice, as though every word he spoke was too heavy for him to say out loud. \"There isn't many people left in the capital now anyway, and the ones left are being used by them to seal up the city gates…\"</p><br/><p>Hearing Duke Collin's words, odd looks appeared on the faces of the five nobles.</p><br/><p>\"You, you plan to…\"</p><br/><p>Duke Collin nodded, narrowing his eyes. \"In the palace, with no one to protect her, the Princess… Oh, no! It's Her Majesty the Queen now, our one last straw to clutch at.\"</p><br/>\n</div>"}