{"title": "Chapter 878: Elusive", "id": 878, "volume": 9, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-878-elusive", "volume_title": "Volume 9", "body": "<h1>Chapter 878: Elusive</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 878: Elusive</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Thus, news of the Black Nightmare Society spread throughout the Kingdom of Helius once more.</p><br/><p>Due to the announcement publicized by the Church, most of the people really believed that a great battle had occurred, that the Black Nightmare Society had been destroyed, that the mages had been driven out of the country and had no way to continue causing trouble. It was because of this that the people were so surprised when cities and towns in the northern region of the kingdom were attacked.</p><br/><p>This elusive army… What on earth was going on?</p><br/><p>\"Is the Black Nightmare Army so powerful? They have just been defeated a few days ago, how can they come back on their feet so quickly?\"</p><br/><p>\"Are you dumb? I'm afraid they haven't really been hurt by the Church. Think about it, this isn't the first time the Church has issued a fake announcement and things like that. Do you still believe them?\"</p><br/><p>\"This… I'm so disappointed in them!\"</p><br/><p>Without a doubt, this was another heavy blow to the public confidence in the Church. The announcement issued a few days ago was still plastered on the streets, but was slapped in the face in real time by the truth, turning into a complete joke. The next morning, there were many swear words and indecent human body parts drawn on the announcement board in many places. There was even a footprint on the word 'Church', which was extremely eye-catching.</p><br/><p>At the same time, the flames of rebellion that had just calmed down reared up once more under Benjamin's push in the dark. The Black Nightmare Army had undoubtedly become a leader in the hearts of the rebel crowds.</p><br/><p>\"I thought that the Black Nightmare Society had really been defeated, fuh… What a relief.\"</p><br/><p>\"How can we become one of their members? How about the Black Nightmare Society? I've heard that they had always been operating along the coasts, don't know where they're hiding now…\"</p><br/><p>After those cities and towns had been attacked, the Black Nightmare Army had destroyed the local churches and snatched many armaments and equipment, before bringing many aspiring people from the cities as they withdrew, disappearing in the midst of the people. No one knew where they had run to, and neither did anyone know where they came from. Thus, the station of the Black Nightmare Society had become a mystery that perplexed numerous people.</p><br/><p>The commoners were curious and the rebel forces wished to get in contact. Not to mention the Church, which had sent out countless of spies throughout the Kingdom of Helius, searching for their location…</p><br/><p>At the same time, a few people were urgently looking for the whereabouts of the Black Nightmare Army.</p><br/><p>\"Why aren't there news from them yet?\"</p><br/><p>In a remote village in the southern region of the kingdom, the six nobles gathered together in a small house. There were rather anxious looks on every face. The Princess was seated next to them, leaning against a chair with an ignorant face. She knew nothing.</p><br/><p>After escaping from the capital with the Princess, they had continued fleeing and taken a few turns, finally hiding in this place to temporarily escape the pursuit of the Church. Although the Church had not yet allowed the news of the Princess' disappearance to spread out yet, they had also suppressed news about them, and had not charged them with any crimes. However, it was unquestionable that if they dared to appear in the sight of the public, they would be dead meat.</p><br/><p>They had already brought a few important family members out, using their family influence to shield them, but… that was all.</p><br/><p>The six nobles right then had on the plainest clothes, made of rough sackcloth, and were no different from a commoner. They did not have any powers that they could use, and were unable to contact the forces outside of the country. It was even more impossible for them to sneak out in secret.</p><br/><p>From the beginning, when they had seen the announcement saying that Benjamin had been beaten and chased out by the Church, their hearts had grown half-cold. However, the Church had only been forcefully maintaining their reputation. When the Black Nightmare Army appeared once more in the kingdom, the six of them had sighed in relief.</p><br/><p>Benjamin was still around. All they had to do was contact the Black Nightmare Army, and every problem would be solved.</p><br/><p>Only, they discovered that communication was a huge problem.</p><br/><p>\"There's no way. If we hide here now, surely, they would never find us,\" Duke Collin had a worried frown on his face, \"and it's impossible for us to find their hiding spot… This is a dead end.\"</p><br/><p>Everyone did not look too good.</p><br/><p>\"If this continues, the Church will search and find us one day,\"</p><br/><p>\"What can we do?\"</p><br/><p>They looked at each other and tried to come up with a plan through discussion, but the atmosphere got heavier and heavier. Very soon, no one said anything, even. After losing their identities as nobles, they had discovered that they were nothing.</p><br/><p>How could they find someone whom even the Church could not find?</p><br/><p>After a long silence, Duke Collin suddenly lifted his head and began to speak hesitantly, \"Perhaps… there's another way to find them.\"</p><br/><p>Everyone's eyes lit up.</p><br/><p>\"What way?\"</p><br/><p>\"According to the rumors circulating outside, they should be continuing the attacks on the cities in the kingdom. If we were to hurry to the targeted locations first and wait for them to come and attack, we would be able to come into contact with the Black Nightmare Army!\"</p><br/><p>Hearing that, all of the nobles frowned.</p><br/><p>\"How would we know which city the Black Nightmare Army is going to strike?\"</p><br/><p>\"Let's split up and test our luck, we only need one lucky guess to be correct,\" Duke Collin let out a sigh, saying, \"As long as Director Benjamin knows about the situation we're in, he will contact the others.\"</p><br/><p>The rest of them took a deep breath. They understood how risky it was to move out separately. The Church had not ceased their search. If one of them were to be captured, the others would be in a very precarious situation.</p><br/><p>However, under such circumstances, it did not seem as though they had another way.</p><br/><p>\"So let it be.\"</p><br/><p>Finally, the nobles nodded. They exchanged complicated but determined looks, and opened the door, leaving the place with the Princess in their arms.</p><br/><p>At the same time.</p><br/><p>Benjamin led the Black Nightmare Army in a fruitful return, as he drove the chariot. They went through the long underground tunnel and returned to the camp under Pearl Lake.</p><br/><p>The operation this time had been a huge success. The Church had not expected them to emerge from there at all. Because of that, every target had been successfully raided by them. Rations, weaponry, materials… They had snatched everything that they wanted, and had even obtained quite a few boxes of Life-Saving Crosses and two Cannons of Holy Light.</p><br/><p>However, to prevent spies from sneaking in, they could not absorb manpower from the people this time. Therefore, the numbers of the Black Nightmare Army remained the same.</p><br/><p>\"Next, the central focus of the Church's defense will definitely be concentrated in the northern region,\" Back in the tent, Benjamin quickly called for another military meeting, \"we could dig another hole next to Pearl Lake, catch them unawares, and attack the cities nearby here.\"</p><br/><p>\"Nearby here… Wouldn't this be too close to the capital?\" A knight raised a question.</p><br/><p>\"We fight fast and end it fast. If we do not pick huge targets, there will be no problems,\" Benjamin's decision was very resolute. \"The most dangerous place is the safest. They will never expect us to shift our target so quickly.\"</p><br/><p>Hearing that, the people there discussed a while more, before finally agreeing to this basic idea. They began to discuss the actual operational objectives and the division of the troops. After approximately two hours, the military meeting ended, and a new battle plan had been set.</p><br/><p>Benjamin returned to his own tent.</p><br/><p>It had only been a day, but he had done so much. He laid on his bed, feeling somewhat tired. However, he was not sleepy in the least bit, as usual. The oil lantern on his table flickered, and he turned his head to look at the light. Suddenly, he drew a deep breath.</p><br/><p>\"...I can feel that the time is nearing,\" he said softly in his heart.</p><br/><p>The System, however, remained unusually silent, saying nothing.</p><br/><p>\"Hey, where are you? Have you split again?\" Benjamin was not used to not hearing the noisy robotic sound. He began to ask in a hasty manner, unconscious of what he was doing.</p><br/><p>The System was still quiet.</p><br/><p>Benjamin started to feel a little strange.</p><br/><p>\"You…\"</p><br/><p>\"What? Why are you so noisy?\" The System emerged right then, interrupting him impatiently. \"If there's no problem, don't chatter incessantly. I'm very busy.\"</p><br/><p>Benjamin knitted his eyebrows. \"What's there for you to be busy about, why didn't you say anything when I called you just now?\"</p><br/><p>\"Of course I have my business to attend to. You will never understand with that lowly human intelligence of yours,\" for some reason, the System was exceptionally haughty today. \"Enough, enough, do what you should, don't come bothering me.\"</p><br/><p>\"...\"</p><br/><p>Who on earth was bothering who? Benjamin scratched his head, feeling as though he had taken the wrong script.</p><br/><p>However, he said nothing more. After getting up to blow out the light, he laid down again and closed his eyes. It was late, and there were many more duties waiting for him tomorrow. It was time to rest.</p><br/><p>It was night, and in the underground camp, the lights in the tents were being blown out, one by one. Very soon, the underground of Pearl Lake descended into silence once more.</p><br/>\n</div>"}