{"title": "Chapter 888: Escape", "id": 888, "volume": 9, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-888-escape", "volume_title": "Volume 9", "body": "<h1>Chapter 888: Escape</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 888: Escape</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Without a doubt, the Church would not let them escape from the battle so easily this time.</p><br/><p>Hidden in the semi-transparent cabin, the mages and soldiers watched everything from the side nervously. The previous battles had fortified their confidence in Benjamin, but at the moment, it seemed that the Church had been forced to take their trump card out, and its power was so great that people were stunned. In everyone's eyes, Benjamin's figure on the stern of the ship still looked undeniably flimsy compared to the gigantic statue.</p><br/><p>Could they really escape…</p><br/><p>The standard of magical ability for most of the mages in this team was average, so they could only hide in the cabin and watch the battle. A strong sense of helplessness surged within their hearts. At that moment, they wanted to know very much what the secret behind the Church's Union Magic was. If they knew it, they could at least be chanting on the sidelines like those priests and channeling some support by providing spiritual energy or something of the sort. At the very least, they would not be as they were at the moment, incapable of doing anything.</p><br/><p>Were they really going to stay this way, unable to help in the slightest?</p><br/><p>Morris' expression changed again and again. Suddenly, he turned his head, and his eyes fell on the unconscious Princess.</p><br/><p>\"We… could do this.\"</p><br/><p>A quiet discussion began taking place in the cabin.</p><br/><p>At the same time, the statue in the sky had started to move. Anyone could see Grant raising his right hand and clenching his fist, as he maintained the same speed as the ice ship; a ceremonious aura emanated from his entire body. The golden statue raised its fist up high as well, as though it was a giant projection of Grant. Its fist, as big as a carriage, was slowly aligned towards the ice ship.</p><br/><p>Then, Grant's right fist slammed down violently!</p><br/><p>Thonk!</p><br/><p>The gigantic fist swung as well, crashing down hard… Smashing onto the domain of the deep sea!</p><br/><p>In the blink of an eye, the blue runes floating in the domain trembled; even the ice ship within the protection of the domain shook, causing everyone inside it to lose their balance and fall everywhere.</p><br/><p>However, Benjamin had flown away from the stern of the ship by then. With a cold and calm expression, he pointed into the air lightly with his finger, deftly drawing out a string of runes. Following that, numerous water elements surged forward, forming an invisible barrier in front of the golden fist. The fist continued downward and smashed into the barrier, as though it was striking onto an extremely elastic piece of rubber.</p><br/><p>The barrier's shape changed for a few moments before finally bouncing the fist back.</p><br/><p>\"Hmph… An old trick.\"</p><br/><p>Seeing that, Grant gave a cold snort and raised his left hand again. The statue did the exact same thing. The hit just now had not seemed to use up much energy, so he and the statue did not need much time to readjust themselves. He brandished his left fist; after approximately three seconds, he struck the ice ship for the second time.</p><br/><p>There was another loud crash!</p><br/><p>Due to the support of the huge amount of water elements, the invisible barrier still managed to block the fist despite being extremely deformed. The third punch came after that, followed by the fourth… Grant seemed to be familiarizing himself with the control of the statue; their movements gradually became smoother.</p><br/><p>At the same time, the barrier was like a boxer's punching bag, enduring god-knows-how-many hits within a dozen or so seconds. The residual ripples emitted even caused dozens of small elemental swirls to appear nearby.</p><br/><p>Finally, a clinking sound that was as crisp and clear as the sound of a glass shattering could be heard. The invisible barrier, unable to withstand the punches of the statue that had come like raindrops, suddenly broke and fell apart completely in the air. The string of runes that Benjamin had drawn suddenly flickered, like electricity leaving a light bulb, and was soon dimmed.</p><br/><p>\"There is nowhere for you to escape to now!\"</p><br/><p>Grant's voice reverberated. He raised his fist once more, aiming at the ice ship.</p><br/><p>However, Benjamin, who was flying above the ship, suddenly lifted his head up at that moment. His eyes met Grant's glowing ones; there were no expressions on his face. Everyone could see that his hands had been put together, as though he was carrying some sort of treasure. Right then, however, he was slowly spreading his hands open. Vibrating its delicate wings, the water elemental sprite flew out from within his hands.</p><br/><p>At that moment, the sprite closed its eyes and emitted a delightful sound. Enigmatic blue spots of light appeared around its body.</p><br/><p>It rushed straight towards the statue's fist.</p><br/><p>Within the next second, a great wave seemed to rise within the entire deep sea domain. The water elements frenzied and surged towards the palm-sized sprite. The sprite put its hands together and allowed the water elements to surge toward it like a tsunami, finally receiving all of them into its petite little body.</p><br/><p>Ding! The gigantic fist crashed onto the body of the sprite, but strangely enough, this sound rang out. It was as though someone had hit the musical instrument of the triangle lightly. The clear, crisp quality of the sound caused everyone's heart to jump involuntarily; there was such a strong, unnatural feeling about it. Furthermore, even Grant suddenly furrowed his eyebrows, as his expression changed to one of slight confusion.</p><br/><p>No one knew what was going on, but in the next second, everyone saw the golden fist bouncing back lightly.</p><br/><p>As for the water elemental sprite, it remained floating where it had been, completely unharmed. The crazy surge of water elements around it began to settle down slowly, as though they had been absorbed cleanly by it, and the color of its body had also turned into a deeper blue. However… the strange thing was that it had not grown larger at all; in fact, it seemed to have shrunk. That scene, especially with it being face to face with the gigantic statue, was of such a vivid contrast that it looked rather ridiculous, even.</p><br/><p>Every member of the Church was astonished.</p><br/><p>\"What… was that?\"</p><br/><p>The few bishops, especially, suddenly felt an aura of the Realm of God emanating from the body of the sprite, as though God had descended upon earth. Also… Also, what made it even more unbelievable to them was how much purer this aura of the Realm of God was, compared with that of the projection they had summoned.</p><br/><p>How could it be?</p><br/><p>Even Grant looked as though he was unable to accept this. Very quickly, he raised and swung his fist again, and the statue smashed down on the water elemental sprite again and again. After a few hits, the sprite no longer received the blows but instead flashed and dodged them one by one. Nevertheless… no matter how they attacked it, the sprite remained intact. That look of matchless dexterity was, in their eyes, like a hateful fly they could not catch.</p><br/><p>As for the enigmatic blue light shining from the body of the water elemental sprite, it slowly dissipated and surrounded the ice ship. After that, the fog that enveloping the ice ship began to subside bit by bit, and the speed of the ice ship's flight increased again.</p><br/><p>Grant became impatiently very quickly.</p><br/><p>\"Annoying thing…\"</p><br/><p>Suddenly, he stopped brandishing his fist and put his hands together. The statue in the sky refrained from attacking as well and pulled its arms back to form a pose exactly like his. Both its eyes were shut tight, and it looked like a praying giant.</p><br/><p>The Holy Light that had been dispersed in the air was suddenly gathered together, returning to the body of the statue. The brightness of the light in the surroundings immediately became extremely dim. The statue was no longer as dazzling as before; seen from afar, it even looked somewhat grey and dull, like a statue no one had cleaned for a long time. In the blink of an eye, the alarming power shown before this disappeared without a trace.</p><br/><p>However, the hearts of the bishops shivered, as though they had received a signal, and began to speed up the funneling process of Holy Light.</p><br/><p>It was time…</p><br/><p>They supplied as much Holy Light and spiritual energy to Grant as they could. Not only were they not tired, they even felt somewhat excited.</p><br/><p>They were already very grateful to be able to participate in the welcoming and leading of the Holy Spirit into the world, but to think that, not only were they able to join the descent of the Holy Spirit upon the earth, they could even participate in the burning of the Holy Spirit and carry out the ceremony together to completely destroy the devil that walked in the midst of the men. They felt that this entire chase was worth it!</p><br/><p>However, it was at this moment that a loud yell could be heard suddenly from the ice ship.</p><br/><p>\"Hey! Your Princess! We're giving her back to you!\"</p><br/><p>It was then a mage was seen suddenly flying out from the ice ship. He was holding a blurry figure in his hands, raising it up high and, without hesitation, directly throwing it out of the ice ship.</p><br/><p>Every member of the Church was shocked.</p><br/><p>\"Her, Her Highness…\"</p><br/><p>In a moment of dumbfoundedness, a priest unconsciously spoke. Due to that, his spellcasting was interrupted.</p><br/><p>The chanting of the others was also affected temporarily.</p><br/><p>\"Idiot! That's a scarecrow! It's not real! All of you, continue what you're doing!\" In the next second, Grant's furious voice rang in their ears, scolding them in a way that caused the members of the Church to feel startled in their hearts. They hurriedly began to chant once more, making up for the loss of Holy Light that had occurred just now, as they looked in the direction of the ice ship.</p><br/><p>It was then that the ice ship was seen to have grabbed the opportunity just now, distancing itself from them a bit more.</p><br/><p>It was still alright… They were still within the area… It was acceptable…</p><br/><p>The bishops gave a small sigh of relief in their hearts. It would have been a result they definitely could not accept if the entire spellcasting had failed due to one of them being distracted just moments ago. Even they would not be able to stop themselves from tearing that priest who had dragged them down to pieces, what more, His Highness the Pope who would have been violently furious!</p><br/><p>Furthermore, they soon discovered something else.</p><br/><p>There was a dead end in front of them.</p><br/><p>The ice ship had been flying towards the north, and they had continued chasing all the while, with no change in the direction whatsoever. Because both parties were traveling at very high speeds, they had arrived at the borders of the Kingdom of Helius after the pursuit. The Skyfall Mountains were before them, a natural moat that was forever impassable. That devil had nowhere else to run!</p><br/><p>Realizing this, every priest was extremely excited.</p><br/><p>They… were finally going to win!</p><br/><p>In their excitement, the speed at which they funneled the Holy Light also increased. They continued spellcasting as they kept an eye on the ice ship that was flying straight towards the Skyfall Mountains, as though they were watching their enemies' graves.</p><br/><p>In the end, all they could see was the ice ship crashing into the \"mountain wall\" of Skyfall, and with a whoosh, it disappeared.</p><br/>\n</div>"}