{"title": "Chapter 897: The Counterattack Before the Retreat", "id": 897, "volume": 9, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-897-the-counterattack-before-the-retreat", "volume_title": "Volume 9", "body": "<h1>Chapter 897: The Counterattack Before the Retreat</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 897: The Counterattack Before the Retreat</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>The moment the mysterious troop charged into battle, the mages and the priests, who were still engaged in chaotic battle, were all rather alarmed.</p><br/><p>Anyone could see that this was merely a group of commoners who had no great spiritual energy and did not possess any traits of spell casters. However, that was also precisely the reason why it was even more shocking when they began to slaughter the priests by depending on a type of strange ability to float.</p><br/><p>That was right. Slaughter.</p><br/><p>When this group of people charged in, most of the priests were not really prepared. Some of them did not even look; all they did was throw a Grenade of Holy Light over conveniently. Subsequently, a strange shield suddenly unfurled from the bodies of the mysterious soldiers and blocked the Divine Charms thrown at them so casually. They closed in, before swinging their blades down!</p><br/><p>Most of the priests' Divine Charm shields were completely shattered by one swipe of the blades. It was only then that they began to realize the gravity of the situation, so they dodged and retreated from the attacks of the secret soldiers in a panic. In the tussle between the two parties, every secret soldier in the group pulled a wooden gun out respectively, firing with a series of bangs. In the blink of an eye, more than a hundred priests fell from the sky, in a state of disbelief before their deaths.</p><br/><p>These soldiers... could easily break through their shields!</p><br/><p>Aside from the members of the Church, even the mages were slightly shocked. What was the deal with the weapons this group of people wielded? Their power far exceeded that of the ordinary enchanted sword, and they even had ranged abilities so strong that their destructive capabilities were not inferior than the magic they released at all!</p><br/><p>What had the world come to?</p><br/><p>They felt that all they knew had been completely overturned by these soldiers.</p><br/><p>Furthermore, there was a problem that they had been utterly unable to ignore from the start. How were they able to stay in the air?</p><br/><p>There was probably no one on the battlefield who could answer these questions. However, a change took over the situation in the sky due to the sudden involvement of the secret soldiers. After the initial and unexpected deaths of the first batch of priests, both sides calmed down a lot and backed off slightly from each other. The situation of the battle did not seem as chaotic as it had been moments ago.</p><br/><p>In addition, those soldiers... Without a doubt, they stood on the side of the mages.</p><br/><p>After that chaotic round of battle, the losses suffered from both the sides of the priests and the mages were extremely great, but they were still about equal when compared. However, with the addition of this secret troop, the scales of victory immediately tipped towards the side of the mages, and... it had tipped drastically.</p><br/><p>Based on the combat ability they showed, it could be seen that every soldier was not at all inferior to the typical mage or priest. Furthermore, it must not be forgotten that this troop had just joined the battle and were completely unharmed. There were easily more than a thousand of them!</p><br/><p>\"What are you blanking out for? It's time to fight back!\"</p><br/><p>Everyone had been somewhat distracted by the appearance of this troop. It was right at that moment that Benjamin's voice rang out from the sky once more.</p><br/><p>Hearing this, the mages quickly came back to their senses. Although they did not recognize this troop, and even had vague, conflicting feelings about the abilities of this group of people, but... they immediately worked with them still, and began to retaliate against the team of priests quickly.</p><br/><p>Meanwhile, even higher up in the sky.</p><br/><p>\"Are you still hiding in there like a turtle shrinking its head? Haven't you seen it? Your men are almost all dead,\" Benjamin turned his head and continued to rain his punches on the golden armor while provoking Grant, who was still hiding inside, with his words. \"I'm sorry, you're about to lose.\"</p><br/><p>Although he felt that he had played this trump card a little too early, Benjamin was still extremely exhilarated at seeing the effect and result achieved by the special troop he had nurtured for so long.</p><br/><p>He had waited for this moment for too long.</p><br/><p>Starting from the powerful magical instruments strengthened by runes that even commoners could use, which Morris had developed through his research, he had known that this day would finally arrive. This was no longer just a military campaign, but a turning point in history. This meant that even commoners could possess combat abilities to contend with spell casters. From this moment on, priests and mages had been lowered from the altar, and magic had entered the lives of hundreds and thousands of ordinary people.</p><br/><p>He knew that this would produce a destructive blow to the dominant position of spell casters. However, he had long come to the understanding that that was what this world truly needed.</p><br/><p>The \"divinity\" of the priests had been removed, the \"evil power\" of magic had been removed; everyone was human. The Church could go play in the mud now.</p><br/><p>\"...You will destroy this world.\"</p><br/><p>After a long silence, Grant seemed to have foreseen all these as well. He spoke once more from within the armor.</p><br/><p>\"That's right, and then build a new one,\" Benjamin gave a soft smile. His fists stopped and rested for about half a second, before continuing to plummet again.</p><br/><p>This time, there was surge of casualties to the priests; it now seemed as though Grant was the one who could not delay the inevitable instead. Sensing through the water elements, Benjamin discovered that his expression within the armor was becoming more and more anxious. All of a sudden, he curled his fingers and hit the inner layer of the armor with a ruby ring on his right hand.</p><br/><p>Immediately after that, the ring flashed with bright light, and Grant disappeared entirely in an instant. Only the suit of armor was left floating in the air, as complete and perfect as before.</p><br/><p>Damn it...</p><br/><p>Benjamin gave a start, and hurriedly turned to look down. As expected, Grant's figure had appeared in the midst of the team of priests right then. He had teleported so suddenly that even the people below them were slightly unable to react immediately. After being dazed for a moment, the remaining priests hastily clustered around him.</p><br/><p>Seeing that, Benjamin immediately put the domain away as well and flew down, returning to the troop of mages in a haste, before Grant had the opportunity to do anything.</p><br/><p>The battle between the two sides immediately ceased due to the involvement of those two people. The mages and priests withdrew from each other and ceased fire, facing one another in midair. The suspension in the air of the special forces was also ending soon; Lance, the Head of Knights who led them, exchanged a glance with Benjamin before descending back to the ground to join the battle between the royal army and The Black Nightmare Army.</p><br/><p>\"Where are you escaping to?\" Benjamin flew to the forefront of all the mages, locking his gaze upon Grant, who was in the midst of the priests.</p><br/><p>Grant did not speak. Instead, he looked at his greatly diminished team of priests, before glancing at the battle beneath him. His expression changed again and again. A few surviving bishops keep guard beside him with faces full of exhaustion. Even the Holy Light that flowed in their midst seemed to look somewhat dim.</p><br/><p>After a few seconds of silence, Grant suddenly waved his hand in reluctance.</p><br/><p>\"All units, retreat!\"</p><br/><p>In that instant, the entire team of priest immediately gathered around him and flew backwards, increasing their speed. The royal army beneath them did a U-turn without hesitation as well, turning around and rushing out the city.</p><br/><p>Benjamin was startled at first. Immediately after that, he bellowed, \"Quick! Chase after them, don't let them escape!\"</p><br/><p>It had not been easy for them to beat the Church. How could they let them off the hook so easily?</p><br/><p>Benjamin was the first to rush forwards and give chase; the people behind him immediately followed suit.</p><br/><p>However, the Church seemed to have prepared a plan for their retreat. The entire team of priests converged all Holy Light onto Grant's body as they escaped. In a mere moment, Grant was refreshed. He turned his head to look at Benjamin, looking as though he was once again in the imposing and powerful state he had been in at the start.</p><br/><p>He pointed with a finger on his left hand. All of a sudden, a gigantic beam of light fell from the night sky and covered Benjamin's head!</p><br/><p>In that blink of an eye, Benjamin did not dodge. Instead, he activated the deep sea domain once more while summoning a piece of ice mirror above his head, trying to force his way through and continue the pursuit. However, the light beam seemed to ignore all of those things, shining down upon his body directly anyway. Subsequently, he discovered that his movements were being held back by an invisible force, as though he had fallen into quagmire. The elemental flow around him had also become extremely slow.</p><br/><p>The speed of his flight was immediately dragged down.</p><br/><p>\"Damn it... Quick! Activate the intangible form.\"</p><br/><p>Benjamin did not wish to let them escape so easily. After hesitating for half a second, he immediately opened his mouth to speak and yelled thus at the System. The System quickly got to work without saying anything. Thus, a second of intangibility was activated. Borrowing the inertial force, he speedily dashed out from the beam of light.</p><br/><p>However...</p><br/><p>\"Activate the final plan! Fire! Destroy all of them!\"</p><br/><p>He had just released himself from the beam of light when Grant's furious voice rang out once more from in front of him.</p><br/><p>At that moment, Benjamin seemed to have thought of something, and hurriedly looked to the distance. Following Grant's command, all they sound see was a vast area of white light being lit up in the camp of the royal army. Subsequently, approximately sixty cannonballs of Holy light rose up from the middle, slowly flying towards the city.</p><br/><p>His expression fell for a moment.</p><br/><p>Unexpectedly, Grant... wanted to blow up Worchester!</p><br/>\n</div>"}