{"title": "Chapter 894: Fire At You, Fire At Me", "id": 894, "volume": 9, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-894-fire-at-you-fire-at-me", "volume_title": "Volume 9", "body": "<h1>Chapter 894: Fire At You, Fire At Me</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 894: Fire At You, Fire At Me</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Rushing to beat the cannonballs before they landed, Benjamin led two teams of Water Mages in a dash upwards into the skies, striking together. They did not have much time; all they could do was their best, crystallizing over thousands of ice mirror layers upon the Runic Defense Technique.</p><br/><p>However, it was in that split-second when the layers of ice mirrors had formed when the cannonballs of Holy Light came crashing in directly!</p><br/><p>The Holy Light exploded at that moment, condensing as though it possessed a solid body and immediately burning through the ice mirrors that were blocking it from the front. Following which, the Holy Light plummeted at a slanted angle like a tsunami, hitting the Runic Defense Technique violently. For a few seconds, an earsplitting buzzing sound rang throughout the entire city!</p><br/><p>The intensely bright light was so glaring that even the royal army soldiers outside the city were forced to shield their eyes. There was even more chaos within the city. Benjamin and the mages hurriedly put on dark glasses to be able to see anything clearly, albeit their vision was still a bit strained.</p><br/><p>\"It looks like… it's blocked?\"</p><br/><p>Benjamin furrowed his eyebrows and held his breath as he carefully watched the place where the Runic Defense Technique and the Holy Light converged.</p><br/><p>The barrier had shook violently the moment the Holy Light made contact; there was serious deformation where they had come into contact, like a piece of metal board that had been dented up. Numerous cracks slowly began to spread out under the immense force of collision; the more they spread, the more there were… However, just as the barrier was withstanding enough to reach its limit, the force of the cannonballs suddenly began to weaken successively. The Holy Light started to disperse little by little as well, and the Runic Defense Technique gained the upper hand once more due to its self-repairing ability.</p><br/><p>The free elements drifting about in the surroundings received the calling of the runes and began to surge towards the barrier continuously, quickly inhibiting the spread of the cracks.</p><br/><p>Seeing this, the other mages could not help but look pleasantly surprised.</p><br/><p>\"You won't be able to fend off God's judgment!\" Nevertheless, it was right then that Grant's voice boomed out from a place even higher up in the sky.</p><br/><p>Along with an immense amount of spiritual energy, the Holy Light that was about to dissipate suddenly began to undergo condensation once more, as though a huge hand had appeared out of thin air from somewhere to mold the scattered mud into a single clump swiftly, pressing it down tightly on the barrier. Right after that, the Holy Light, along with the barrier, shook violently, emitting a buzzing noise so sharp that it pierced their ears.</p><br/><p>In the next second, bang!</p><br/><p>An alarming explosion appeared in the skies like gigantic fireworks, as the barrier shattered on the spot. Six different types of elements formed a colorful array of shattered pieces, flying everywhere uncontrollably and practically covering the airspace above the entire city.</p><br/><p>In that moment, the dark night sky was no longer dark; when the people looked up, it was as though they were looking at a wildly colorful painting of abstract art.</p><br/><p>Fortunately, the explosion took place at a very high altitude, so the residual waves did not impact the city beneath them. They merely knocked Benjamin and the mages, who had been flying in the sky, downwards.</p><br/><p>\"Damn it…\"</p><br/><p>Situated a few hundred meters away from the flying element pieces, Benjamin clenched his fists forcefully. He descended as he watched Grant, who had also been thrown back by the residual waves, with a steely gaze. The whistling wind blew into his ears, making a noise that sounded like knives being scrapped back and forth on a stone wall.</p><br/><p>Grant was looking at him as well. The only difference was that his expression was incredibly calm.</p><br/><p>As they continued to fall, they held their gaze at each other for about two seconds and a half. Grant's face was as still and unchanging as a statue, whereas Benjamin's countenance kept shifting. However, at the last moment, all of his expressions were put away abruptly; his anger had transformed into cold indifference, with the ends of his lips turning up slightly even, revealing a hint of a sarcastic smirk.</p><br/><p>In the next second, he forcefully swung his arm!</p><br/><p>\"Fire!\"</p><br/><p>At his words, the square in Worchester's city center suddenly lit up with bright white light. Immediately after that, six cannonballs of Holy Light steadily rose up from there, drawing numerous beautiful arcs in the night sky once more.</p><br/><p>There was finally a change in Grant's indifferent expression.</p><br/><p>Everything was happening too unexpectedly; the six cannonballs flew by, scouring through the sky above his head in a sweep before falling right into the midst of the royal army's charging troops. At that moment, the six cannonballs bloomed open like six lotus flowers in the middle of the battle array. Dazzling Holy Light swelled up rapidly; the soldiers had no time to escape, so they were immediately swallowed up. Terrible heart wrenching screams filled the entire sky.</p><br/><p>In just the blink of an eye, the royal army had lost thousands of soldiers.</p><br/><p>It was only after the cannonballs had completely exploded that Grant responded. As he flew back speedily, he stretched out his hand downwards and pointed; a few runes flashed past the tip of his finger. Following which, the swelling Holy Light seemed to be constrained by some sort of force and was abruptly stopped. It then began to disperse slowly…</p><br/><p>This action had preserved the lives of a few thousand soldiers. Even so, the six gigantic pits in the ground were shocking, causing the expressions of the Church members to look extremely ugly.</p><br/><p>Grant turned his head, looking towards Worchester.</p><br/><p>His emotions flashed through his eyes as he suppressed his fury. All of a sudden, he spoke, bellowing at the top of his voice.</p><br/><p>\"Press the attack!\"</p><br/><p>By then, the Runic Defense Technique had been destroyed, so the entire city was finally exposed. The explosions just now had caused the royal army to be slightly disoriented, but the cavalrymen charging at the forefront had not been affected; right at that moment, they had already rushed at the north city gate and were charging at the great gates that were tightly shut. When the follow-up troops heard the command, they also immediately dashed forward.</p><br/><p>Ladders, gigantic wooden stakes… Every weapon that could be used to invade the city had been mobilized. They moved around the six deep pits that had been blasted into the ground, surging over in densely packed crowds like a colony of carnivorous ants that had begun their killing hunt.</p><br/><p>Benjamin did not panic. He had known that such a situation would occur the moment the Runic Defense Technique had broken. In that instant, he flew down directly and swung his hand forcefully once more at the tightly packed, bustling heads of the Black Nightmare Army, roaring in a thunderous voice, \"Begin the counterattack! Defend the city gates!\"</p><br/><p>By this time, the battle had officially plunged into the most critical stage.</p><br/><p>The soldiers of the Black Nightmare Army had waited for a long time. Rolling stones, boiling water, rain of arrows… Like a heavy, torrential rain, they immediately fell upon the heads of the royal soldiers. The royal soldiers near the city gates had all clustered together to attack the city, so although they were wearing tight and solid armor, they were still suppressed heavily. Ladders that had just been put up were immediately kicked off, and the wooden stakes being struck against the city gates were stubbornly blocked by the people and sandbags behind the gates. They were unable to breach the gates at all.</p><br/><p>Many royal soldiers died instantly under the rain of arrows. However, even more soldiers surged up very soon, stepping on the dead bodies that were being piled up higher and higher. Inch by inch, they closed in on the defending troops on the city walls.</p><br/><p>Huge groups of priests had launched into a fight with the mages above the city gates.</p><br/><p>On one side was an orderly team; Holy Light flowed through every person's hands, converging to form a gigantic phantom. On the other side was a spread out formation, with mages grouped up according to their respective elements, thus forming little teams. Magic that covered the skies and earth spewed out from their hands like a long, bright colorful river.</p><br/><p>The Holy Light phantom and the torrent of magic collided; after a few moments of stalemate, the Holy Light gained the upper hand.</p><br/><p>\"Everyone, spread out! Charge at them and mess up their formation!\"</p><br/><p>The moment the magical torrent was exhausted and died out, the Holy Light phantom transformed into hundreds of Grenades of Holy Light, shooting straight at them. Seeing that, Joanna immediately yelled at the top of her voice. At her words, the mages, who had already been in a dispersed formation, immediately separated from each other and dodge the Grenades of Holy Light that were coming at them from the front. Then, they scattered into all directions, before turning to face the team of priests and charging straight at them!</p><br/><p>In that instant, the airspace above the north city gate fell into an unparalleled chaos.</p><br/>\n</div>"}