{"title": "Chapter 893: The Attack on the City Begins", "id": 893, "volume": 9, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-893-the-attack-on-the-city-begins", "volume_title": "Volume 9", "body": "<h1>Chapter 893: The Attack on the City Begins</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 893: The Attack on the City Begins</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>At that moment, everyone descended into silence. It was as though time had stopped for the entire world.</p><br/><p>After a few seconds, the sound of a horn being blown rang throughout the entire city.</p><br/><p>\"The enemy is attacking!\"</p><br/><p>Worchester, which had been in a deep slumber, was immediately awakened. The soldiers of the Black Nightmare Army rushed out from their camps and surged towards the city gates, whereas the mages flew into the skies. The pitch black night sky was lit up by numerous and tightly packed torches in the blink of an eye. Meanwhile, the troop outside that had intended to sneak an attack on them was also lit up.</p><br/><p>It was then that Benjamin and the others had a completely clear sight of that troop.</p><br/><p>There were about five to six thousand of them. Based on their attire, there were actually many priests amongst them. At that moment, they stood rooted to the ground, with shocked and uncertain looks on their faces. Many of the frontlines of the entire team had already fallen; the flames from the self-explosions had not yet completely died out. Charred black corpses fell to the ground, looking as terrible as the scene of a fire.</p><br/><p>Not unlike the Black Nightmare Army, they did not seem to have expected this situation as well.</p><br/><p>\"What, what do we do…\"</p><br/><p>In the camp of the royal army was the cavalry battalion that had originally prepared for the sudden attack. Seeing this scene, the troop leader could only turn his head, stunned and confused, to look at General Press besides him. General Press, however, was already completely frantic. He watched Worchester, which had already been stirred up; shock and fear filled his heart.</p><br/><p>How could this be? How could the Black Nightmare Army discover their sneak attack?</p><br/><p>No… Things were not supposed to be like this. Their surprise attack must not fail! This could not be… This was already his third failure before His Highness the Pope, His Highness the Pope would kill him!</p><br/><p>These were probably the most difficult few seconds in his entire life. His whole body was shaking like a leaf as cold sweat drenched his clothes, his heart beating so fast that it almost reached his throat. How would His Highness the Pope react? He did not dare turn his head to look back, afraid that the moment he turned his head, Grant would burn him into ashes with a bolt of Holy Light.</p><br/><p>After a few seconds, the Pope's voice rang out from behind him.</p><br/><p>\"All units, attack!\"</p><br/><p>The amplified voice reverberated in the campsite. General Press felt a buzzing sound in his brain and almost fell off his voice, but gave a huge sigh of relief after that.</p><br/><p>Thus, just as they had planned, the cavalry battalion charged out from the camp and continuously increased their speed, raising their spears as they dashed straight for Worchester's north city gate. The follow-up troops followed closely from behind, roaring at the top of their voices as they launched into a charge. The priests flew up like flocks of birds. At the rear of the camp, tightly packed Cannons of Holy Light were all being set up properly, aimed at the Runic Defense Technique.</p><br/><p>As for the sneak attack troop that was in front, they immediately came back to their senses from the trance after they received the order. Turning their direction, they rushed towards the north city gate along with the battalion.</p><br/><p>The battle cries were deafening; the earth trembled from the sound.</p><br/><p>From the perspective atop the city wall, it was as though someone had poked a… No, not one, but a bunch of hornet's nests. Their vision, which had originally seen nothing, was suddenly taken over by hornets surging towards them in an overwhelming manner. No matter where they looked, it was a vast piece of darkness, making them feel breathless.</p><br/><p>The soldiers standing on the city wall took half a step back unconsciously.</p><br/><p>\"Don't panic. Move according to the defense plan we had already discussed and agreed on.\" It was at that moment that Benjamin's voice suddenly sounded out from above, startling their hearts to take a half-step forward once more.</p><br/><p>The soldiers who lifted their heads could see Benjamin already ascending slowly into the sky. He was nonchalant about the royal army's show of power and might; his expression was calm and steady, as his robes fluttered in the wind. Streams of water flowed and encircled his body like birds that had come alive, able to move out smoothly at any given moment.</p><br/><p>Furthermore, the gigantic barrier formed by the Runic Defense Technique protected Worchester tightly, emitting a faint glow in the dark night.</p><br/><p>Seeing this scene, every heart in the Black Nightmare Army was greatly stilled. Steady determination revealed in their eyes as they looked once more to the royal army that was rushing towards them.</p><br/><p>Right then, the leading cavalry troop of the royal army had almost come within three hundred meters of the city gate.</p><br/><p>\"Earth Mages, move!\"</p><br/><p>Benjamin immediately gave the command. Right after that, approximately a hundred over mages flew out from the troops. Runes flashed in their eyes as their spirits condensed; thick and heavy magic oscillations rippled out. Following that spreading oscillation, the surface of the ground outside Worchester city suddenly became soft mud. The leading cavalrymen stepped on it and immediately lost their balance, falling heavily into the mud.</p><br/><p>Seeing that, there was no one in the Black Nightmare Army whose spirits were not lifted. However, on the side of the royal army, there did not seem to be much panic.</p><br/><p>\"The same old trick. Do you think we really have no preparations whatsoever?\"</p><br/><p>Press had not joined the charging troops. He was following them from behind, and upon seeing what had happened, gave a cold snort and muttered to himself.</p><br/><p>Suddenly, the cavalrymen who had first fallen into the mud emitted a wave of magic oscillation. After that, a chill dispersed and spread within the mud, freezing the soft mud into extremely hard ground in just mere moments. The cavalrymen coming from behind leapt over the corpses, unaffected. They continued the charge.</p><br/><p>The mages of Worchester frowned temporarily.</p><br/><p>\"No shame! You say we are devils, but you yourselves embed freezing spells into your magical instruments, and you're even using them in battle.\"</p><br/><p>However, things were already as such; there was no point cursing at them. Benjamin immediately issued another command. Another team of mages rose up, and as the powers of the runes converged, a blast of fierce wind descended from the sky very quickly and blocked the cavalrymen from the front. At that moment, the enchanted armor on the bodies of the cavalrymen lit up, blocking the hidden Wind Blades. However, the powerful force of the wind had immediately landed them in trouble.</p><br/><p>The great wind whistled, blowing at them so hard that their armors were making clunking noises. They immediately felt as though their galloping horses were having difficulty in taking further steps.</p><br/><p>The Black Nightmare Army were still not done with their offensive.</p><br/><p>As the Wind Mages were maintaining the fierce winds, another team of mages had risen into the sky. Accompanied by a sharp increase of temperature, they summoned clusters of fiery flames. In the blink of an eye, vast and boundless flames came over the heads of the cavalrymen like a huge net. Stuck in the fierce winds, the cavalrymen were unable to dodge or hide; they could only withstand it.</p><br/><p>\"Hmph…\"</p><br/><p>Grant stood at the entrance of the camp, releasing a cold harumph.</p><br/><p>It was right then that the priests had flown close to the north city gate. At that moment, they put their hands together in unison; light elements converged and formed a layer of thin film on the heads of the cavalrymen below them. In the next second, flames twisted up by the strong winds hit the film. Fiery sparks and Holy Light instantly flew everywhere, but… there was not much that landed on the bodies of the cavalrymen.</p><br/><p>What was even more troublesome was that, not only had the flames been blocked, half of the fierce winds that had pulled the cavalrymen back was also being obstructed.</p><br/><p>With assistance from the battalion of priests on the sidelines, the cavalrymen began to increase their speed once more.</p><br/><p>However, the attack of the royal army seemed to be far from over. Just as the cavalry was about to charge in, there was a sudden series of loud explosions coming from the enemy camp. Everyone lifted their heads, only to see a few dozens of tightly packed white lights rising from the artillery battalion of the royal army, forming smooth parabola lines in the night sky as they fell towards Worchester like a meteor shower.</p><br/><p>Every heart in the city tensed in unison.</p><br/><p>The Cannons of Holy Light… had been fired!</p><br/>\n</div>"}