{"title": "Chapter 911: Under the Surface of the Water", "id": 911, "volume": 10, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-911-under-the-surface-of-the-water", "volume_title": "Volume 10", "body": "<h1>Chapter 911: Under the Surface of the Water</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 911: Under the Surface of the Water</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>\"What...\"</p><br/><p>The bishop was somewhat at a loss for a few moments, as he watched the explosions below him. By the time they had flown down to check, the small openings on the barrier had closed, and the city gates had been shut once again as well. The royal army was in complete disorder. They did not know how many charred black bodies were lying at the bottom of the alarming, deep pit.</p><br/><p>He had not even figured out what had happened with those chariots that had charged out from the city.</p><br/><p>Chariots filled with explosives? There had been clearly no one on them, however, so who had been driving? How did they trigger the explosives?</p><br/><p>Nevertheless, now that it had come to this, they did not have the time or ability to think about those questions in detail. From the actions they had seen just now, it was obvious that the Black Nightmare Army was planning to fight with them until the end. It was very likely that there would be an abundance of traps prepared in the city, waiting for them. Because of that, Grant quickly instructed the soldiers beneath him to retreat a few dozen meters, just in case some strange things would come charging out again when the city gates open.</p><br/><p>\"Hold on.\" Grant repeated his command once more. \"Wait until the fleet arrives, then we shall launch our general offensive on Worchester!\"</p><br/><p>Thus, the royal army outside the city calmed down and patiently waited for an opportunity. Meanwhile, the city quietened down more after just having gone through a change. The city walls had even been cleared out immediately; not even a single figure standing guard was at the top.</p><br/><p>This sight was rather odd, but the Church did not dare act rashly anymore, after the explosions just now.</p><br/><p>After half an hour...</p><br/><p>Finally, accompanied by the whistling sea breeze, a fleet comprising of over ten battleships slowly glided over. They soon lined up outside the wharf to the south of Worchester; cannon after cannon was pushed onto the deck. Under the dim moonlight, the crosses on the flags fluttered in the wind.</p><br/><p>\"Ready... Fire!\"</p><br/><p>Grant had been holding his patience for too long. When all the Cannons of Holy Light had been put in place, he raised his hand high up into the air. His voice, which had been amplified by a Divine Charm, reverberated throughout this night sky like muffled thunder.</p><br/><p>In the next second, gunfire, scattered all over the place, arose around the city like a fountain where the water was flowing backwards, converging towards Worchester in the middle. Chaos had appeared in the city of Worchester as huge crowds of citizens walked to the streets and looked up at the skies uneasily, but... there was still no action from the Black Nightmare Army.</p><br/><p>They could not see anyone on the city walls at all. Most importantly, the priests flying around still could not find Benjamin, not even his shadow.</p><br/><p>Where were they hiding themselves?</p><br/><p>The bishop frowned. Before he had time to think about it carefully, he saw the numerous beautiful cannonballs of Holy Light hit the Runic Defense Technique! Along with another series of deafening sounds, Holy Light erupted violently and lit up the dark night so brightly that it felt like daytime. The intense magic oscillation rippled out and forced the surrounding priests to fly a long distance backwards.</p><br/><p>Subsequently, a series of faint sounds, like the cracking of glass, fell upon every ear.</p><br/><p>All of the sounds converged together, finally forming an abnormally crisp and clear... Ding!</p><br/><p>Grant's spirits were momentarily raised.</p><br/><p>\"All units, charge!\"</p><br/><p>The Holy Light slowly dispersed, revealing Worchester inside it. By then, the entire barrier had turned into scattered ashes and smoke. Other than the tightly shut gates, this city was like a naked body. There was no one on the empty city walls, nothing that could hinder them in the least bit.</p><br/><p>The royal army immediately charged in after that, as the navy soldiers embarked upon dry land at the wharf. Grant brought a huge team of priests and flew into the city hastily, searching for traces of the Black Nightmare Army.</p><br/><p>They were beginning to feel that something was amiss.</p><br/><p>\"Where's the Black Nightmare Army? Where are the people hiding?\"</p><br/><p>The royal army dove straight in. The priests flew directly into the center of Worchester without having to deal with any sort of resistance. More importantly, the camp ground in the city was empty. Not even half a shadow could be seen. The depositories for the armaments and rations had also been emptied out earlier on; not a grain of rice was left.</p><br/><p>Watching this sight, there was a thumping sound in the bishop's heart. Grant did not say anything; he immediately turned around and flew towards the city hall.</p><br/><p>Using a Grenade of Holy Light to blast the big doors of the city hall open, he found the inside empty. There were not even many paintings left on the wall; everything that was valuable in the slightest had all been moved out. As for the treasury beneath the city hall... Was it still necessary to mention what the condition inside was?</p><br/><p>Grant's expression had become unusually dark at this moment.</p><br/><p>\"Where have the men of the Black Nightmare Army gone?\"</p><br/><p>There were no soldiers in the city, so the royal army had the run of the place with no one to stop them. Because of that, they immediately captured a bunch of citizens and probed their memories. Most of them knew nothing. As for the memories of the other few, they obtained the same result.</p><br/><p>Two hours before the royal army had arrived, the Black Nightmare Army had packed their things and had left in secret on a ship at the wharf.</p><br/><p>The moment they knew of the result, everyone in the Church were shocked.</p><br/><p>\"This... is impossible! If they had run off so long ago, who has been maintaining the Runic Defense Technique? And the explosive chariots that had charged out the open gates just now, if they had run, who'd been controlling those things?\" Cold sweat had broken out on the bishop's forehead, as he immediately queried.</p><br/><p>\"But based on those people's memories, quite a number of people had seen this sight with their own eyes... This is most definitely not wrong.</p><br/><p>The bishop had nothing to say.</p><br/><p>Yes... The memory of a single person might have been faulty, but after comparing the memories of quite a few people without discovering anything, there was definitely no problem.</p><br/><p>However, they still felt that it was absurd.</p><br/><p>Worchester was quickly taken over by the royal army and reinstated as a territory of the Church. However, the night was far from over. A team of priests immediately flew out into the ocean, trying to track the route that the Black Nightmare Army had taken in their retreat. The others took action as well, and started to capture people on a large scale. They wanted to investigate the truth of the matter as fast as possible.</p><br/><p>Finally, from the memories of a few people, they discovered that practically all the soldiers they had seen on the city walls, had been mages in disguise.</p><br/><p>\"What does this mean?\"</p><br/><p>This was unfathomable to the members of the Church. A bunch of mages had disguised themselves and pretended to be soldiers on the city walls to confuse them, while the real soldiers had escaped on a ship a long time ago... What on earth was the Black Nightmare Army trying to do?</p><br/><p>\"...Not good.\" Grant mulled for a while, before suddenly waving his hand and giving a command hurriedly. \"Quick! Seal up the entire city! Those mages have not yet left, and there's that person as well. It's very likely that they're still hiding in the city and haven't left!\"</p><br/><p>Hearing that, the soldiers were all stunned. However, they immediately reacted after that, and began to seal up the city hurriedly.</p><br/><p>At that moment, the bishop understood everything.</p><br/><p>\"They... They are fooling us with this!\" He immediately revealed a furious expression. \"The Runic Defense Technique, the explosive chariots, the guards on the city walls... Everything was done by that bunch of mages, led by that devil. They wanted more time for the battalion of the Black Nightmare Army to withdraw, so they'd come up with and used such little tricks, even!\"</p><br/><p>\"Quick! Search the entire city.\" Grant's face was dark as well. \"Since they wish to protect those soldiers, they themselves... would have to pay the price!\"</p><br/><p>Thus, the night had not yet come to an end. Numerous soldiers were sent out over large areas to dig deeply into every corner in Worchester. They searched from house to house and did not spare any hidden space, looking for traces of the mages at all cost.</p><br/><p>At the same time.</p><br/><p>\"Fuh... Finally out of there. This sewer stinks too badly!\"</p><br/><p>Towards the south of Worchester's wharf, under the violent waves of seawater, a hole was suddenly bored through the wall of a rock. Following which, human figures protected by water elemental shields began to slip out in a single file from that hole, one after another. Upon a careful count, there were quite a few hundreds of them.</p><br/><p>While countless of people were searching for them up there, this group of Black Nightmare Army mages had dug through the sewer system, directly into the ocean.</p><br/><p>\"Stop complaining, let's go quickly!\" Benjamin, who was floating in front, turned his head and beckoned with his hand. \"Once time drags on, they'll surely realize what's going on. We cannot stay in here for too long.\"</p><br/><p>The mages nodded as well.</p><br/><p>Thus, they speedily retreated along with the currents of the ocean. No one knew that a bunch of mages were leaving Worchester under the surface of the ocean at the moment, slowly drifting into the distance.</p><br/>\n</div>"}