{"title": "Chapter 913: The Ambush by the Church", "id": 913, "volume": 10, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-913-the-ambush-by-the-church", "volume_title": "Volume 10", "body": "<h1>Chapter 913: The Ambush by the Church</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 913: The Ambush by the Church</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>\"It's just another day's journey left, let's all get a move on! After this valley, someone's going to come from the Town of Crewe to get us and provide support.\"</p><br/><p>Night had just fallen. In the desolate eastern hills of the Kingdom of Helius, Benjamin and the Black Nightmare Army were still advancing. They have already been hiding in the mountains for a very long time. By moving continuously and hiding their own tracks, they had eventually drawn gradually closer to the base camp of the Wood army.</p><br/><p>Hearing that, smiles finally broke across the weary faces of the soldiers.</p><br/><p>They had been having a hard time. Having to tramp over mountains and through ravines along the way while dragging huge amounts of rations, materials and armaments was already enough to tire them half to death, not to mention the Magical Creatures that would occasionally jump out during the journey. There were usually many huge Magic Creatures that lived in groups, in places where few people tread such as this one. Being wary of these things at all times had made it very difficult for them to completely relax themselves.</p><br/><p>However... they were about to arrive, at least. Everyone's spirits were lifted, and they wished to hurry on and cover a bit more ground before night had completely fallen.</p><br/><p>\"You don't have to follow the battalion, actually. I can get a few mages to protect you if you were to fly over first, that's fine too.\" Benjamin could not help but speak as such, after he had landed back among the troops from the air. He was looking at Morris, who was sitting on a wheelchair and advancing bumpily on the rugged mountain path.</p><br/><p>\"You don't have to worry about me,\" Morris shook his head and said as he chuckled. \"We've separated and moved so many times that the Church must've taken precautions already. We'll be very easily exposed. Moreover, we are going to live under other people's roofs this time. It's best that everyone appears at the same time. It can also be considered a sort of declaration.\"</p><br/><p>Hearing that, Benjamin did not continue to advise him. He said, \"If that's what you're saying... You're also rather worried about the situation after we reach the Town of Crewe, then?\"</p><br/><p>Morris nodded.</p><br/><p>\"Haven't you noticed that this newly appeared Duke Elizabeth has been spreading her propaganda out under the banner of vengeance?\" He lowered his voice as he explained. \"She's also a mage herself. I've heard a lot of information before, but barely anyone mentions this. Also, in the eyes of the people, it seems that she's a legitimate figurehead of the nobles in the kingdom, but very few know of her identity as a mage.\"</p><br/><p>Benjamin frowned. \"You're saying...\"</p><br/><p>\"Speaking from our perspective, whether it's a mage or a noble, the difference might not be that great because the end game is just to topple the Church. But for many more people, mages symbolize a feeling of being distanced, mystery, great power, and a life that is very different from the lives of the majority. As for nobles... They symbolize class and authority.\"</p><br/><p>Benjamin rubbed his chin, not saying anything. However, thinking about everything that Duke Collin had done, he actually already made similar guesses in his heart a long time ago.</p><br/><p>Duke Collin seemed to be the leader behind them that had shaped the situation before their eyes now.</p><br/><p>He had requested Benjamin to rescue the King, and used that to intensify the conflict. Then, he had continuously helped the side of the mages in the shadows, weakening the forces of the Church. Lastly, even the Black Nightmare Army had been established due to his support, and while that had been going on, he had even hidden a powerful army that answered directly to him outside of the kingdom... What else could a noble be risking even his own life for?</p><br/><p>\"The Wood family wishes to be the supreme family in this country.' Morris stated the conclusion in a vague manner.</p><br/><p>Benjamin hesitated for a while. Nevertheless, he said, \"That was what Duke Collin thought, but he's already dead. After his daughter takes over his dukeship... she might not wish to proclaim herself as the ruler.\"</p><br/><p>\"Oh? Are you very close with her?\"</p><br/><p>\"...In a normal way, I suppose.\"</p><br/><p>\"Then how do you know she doesn't want to be proclaimed as the ruler?\"</p><br/><p>Benjamin was briefly stuck for words. He did not know how to answer, so he scratched his head and said, \"This... It's just a feeling, I guess. I feel that she isn't a person with that sort of a personality. You shouldn't ask so many questions as well, I'm not so sure. Let's just wait until both parties have met, then we'll take a look at everything.\"</p><br/><p>Hearing that, Morris nodded. Finally, he inquired nothing more.</p><br/><p>\"Who wouldn't want to keep climbing up? To me, if this Duke Elizabeth really does want to proclaim herself Queen, it's still considered acceptable. She's a mage, at least, and I've heard that she'd graduated from the Academy of Silence? I think she wouldn't repeat the King's mistakes.\"</p><br/><p>\"Oh, really... So you think that the future monarch of the kingdom should be a mage?\" Having heard his personal opinion, Benjamin raised his eyebrows. There seemed to be some disagreement expressed through the tone of his voice.</p><br/><p>Morris said laughingly, \"There might be some unsuitability to that, but can't I be a little selfish as a mage?\"</p><br/><p>Hearing that, Benjamin smiled helplessly as well. He turned his head around, saying nothing more.</p><br/><p>By then, the color of the skies had turned completely dark. It would have been extremely dangerous to continue rushing onwards, so he issued an order to rest. The soldiers stopped and found a vast, open space within this part of the valley, before starting up fires and setting up their tents. The mages laid the defense barrier out as well, preparing to spend the night here.</p><br/><p>Benjamin flew in the air alone, patrolling to and fro and ensuring the safety of the area together with the System.</p><br/><p>En... There was a den of Magical Creatures in the east, but they were not nocturnal, so there should not be any disturbances from them. In the west, however... There seemed to be a huge Magical Beast that was wandering about everywhere. It looked rather similar to a monkey; they had never seen it before. It was better to destroy it first.</p><br/><p>After he had more or less made a confirmation, Benjamin flew to the west and covered the place with a blizzard. In an extremely expert manner, he froze the giant ape into a giant pile of ice sludge.</p><br/><p>He had already been doing too much work similar to this within the past few days.</p><br/><p>He picked and chose from within the ice sludge and gathered some materials that were rich in elements, ready to bring them back for research purposes. However, it was right at this moment that a strong and violent magic oscillation rippled out from the camp. Benjamin turned his head sharply; he seemed to detect abnormal light element activity in the air.</p><br/><p>At that moment, his heart made a thumping sound.</p><br/><p>\"That's bad...\"</p><br/><p>He immediately flew back. In ten seconds, the camp was back within his sights.</p><br/><p>At that moment, a huge bunch of priests had emerged in the airspace above the camp. No one knew where they had come from; Grenades of Holy Light were condensed in their hands and rained down on the campground. The mages in the camp had built a barrier in the sky to block their attacks, but it was already looking rather shaky, as though it was about to collapse.</p><br/><p>In the camp, the soldiers had been plunged into a desperate battle. Holy Knights and royal soldiers that had rushed out from all directions had completely surrounded the Black Nightmare Army. Relying on the powerful fighting abilities of the Runic Combat Team, they managed to cope with the enemy's advantage in numbers. However, many people were already wounded by this time. They laid on the ground; no one was able to spare a moment to give them a hand by treating their wounds.</p><br/><p>Meanwhile, Benjamin saw Grant on the other side of the sky.</p><br/><p>Joanna was just about to engage in a fight with him, with a few mages on the side giving her aid. However, Grant already had a definite upper hand at that moment even though he was only one against many. In between the flashes from the runes of Holy Light, light silks shot out one after another, hitting the blazing hot phoenix flames so much that they were nearly dispersed.</p><br/><p>Seeing that, Benjamin immediately rushed over to the other side.</p><br/><p>\"Leave the situation here over to me. You guys, go help the others.\" In an instant, he flew over and blocked the three limited light silks in front of Joanna. He turned his head immediately and spoke thus to those few people.</p><br/>\n</div>"}