{"title": "Chapter 914: The Battle to Withdraw", "id": 914, "volume": 10, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-914-the-battle-to-withdraw", "volume_title": "Volume 10", "body": "<h1>Chapter 914: The Battle to Withdraw</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 914: The Battle to Withdraw</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>A few mages with stronger combat abilities turned around and joined the battle below them. Meanwhile, Benjamin shifted his eyes back onto Grant.</p><br/><p>He had not expected the Church to appear so suddenly.</p><br/><p>Dispatching huge numbers of soldiers to mix into the mountains, and even planning such a meticulous ambush... It was very likely that the Church had long been aware of their movements, and had long ago prepared to come. Otherwise, it was impossible that Benjamin and the System had not noticed anything. He was feeling unusually heavy exactly because of that.</p><br/><p>They had hit a wall* now...</p><br/><p>The situation of the battle below them was not good. Both the numbers of soldiers and priests were greater than theirs; if they were to continue fighting, there would soon be a large number of casualties. Moreover, Grant, who was at a short distance in front of them, had not attacked. Instead, he had immediately summoned rune after rune, protecting himself like a golden bell. At the same time, his eyes were stubbornly set upon Benjamin. It was obvious that if Benjamin were to come near him as he had done the last time, he would immediately pull his position away.</p><br/><p>Having observed all that, the plan of the Church had become simply too obvious. If they could drag Benjamin back, they would win!</p><br/><p>Seeing that, Benjamin gave a cold snort.</p><br/><p>Firstly, he activated the deep sea domain and summoned the water elemental sprite, putting on a show, as though he was about to attack with full force. Then, however, he suddenly turned around and rushed towards the group of priests in the sky. At the same time, he yelled at the people below him, \"Quick! Entire army, retreat! Escape to the north!\"</p><br/><p>It was a great pity. The army's rations, materials... They were unable to keep the useful things that they had been accumulating all this while, but they had to at least preserve the lives of their men.</p><br/><p>Grant had also been shocked by his false bravado at first. After a few seconds, however, he immediately reacted by turning his head and giving chase. At that moment, Benjamin had already flown close to the group of priests. Almost ten thousand Ice Needles were summoned by him, and with a swing of his head, he scattered them towards the group of priests. The group of priests were forced into helplessness; they could only change from their offensive stance into a defensive one, and even then, their defense was done slightly sloppily.</p><br/><p>Thus, the mages were finally freed. They came out and turned to join the battling groups of the Black Nightmare Army. Dense and tightly packed magical brilliance shot towards the north all at once!</p><br/><p>It instantly struck the encirclement of the royal army, and created a small breach.</p><br/><p>\"Quick! Charge! Charge out through that opening!\"</p><br/><p>Soldiers, mages, the special soldiers who were using runic tools... The entire Black Nightmare Army let out a furious roar, and rushed towards the breach while they fought in close combat. Benjamin tossed a timely Elemental Order - Heal over as well, giving the wounded a chance of survival.</p><br/><p>However, that was all he could do.</p><br/><p>\"Do you think that they can really break through our encirclement?\"</p><br/><p>Along with words spoken in a low voice, Grant appeared at a spot not far behind Benjamin, and spread his hands open. Dazzling Holy Light arose from the hands of a few bishops and the dozens of priests, before converging towards Grant and causing the Pope's robes on his body to once again light up in strange patterns.</p><br/><p>As for the other priests, they seemed to have flown down, towards the battle</p><br/><p>Nevertheless, Benjamin did not have time to intervene and bother himself with these matters anymore.</p><br/><p>\"Really powerful. So you've become all high and mighty because you have a lot of people to rely on, huh?\" Benjamin immediately took a few bottles of Magic Potions out from his pockets and gulped them down all at once, before charging towards Grant. \"If you really want to fight so much, then let's have a proper go at it!\"</p><br/><p>In the blink of an eye, an ice armor was formed through condensation. He clenched his fists, and an endless supply of water elements were compressed onto the surface.</p><br/><p>Thonk!</p><br/><p>Before Grant could take any action, Benjamin had quickly rushed up and struck him with a punch!</p><br/><p>However, a great force spread from his fist. His eyebrows furrowed; he felt as though he had hit granite... No, even granite was not as hard as this! In that moment, the explosion of force from the water elements was blocked by a wall of light. The counterforce shook him so much that even his own arms were feeling slightly numb.</p><br/><p>His heart fell so deep, it was as though it had sunken to the bottom of an abyss.</p><br/><p>There were too many priests acting as generators for Grant. He could not hit hard enough to cause him to budge.</p><br/><p>\"Hmph! It seems that brute force is the only thing you know how to use.\" Grant let out a cold harumph, and stretched his hand out, pointing lightly. Subsequently, a golden rune rose to his glabella, before suddenly shattering into pieces. Immediately after that, a gigantic, invisible force swung straight at Benjamin, face-first.</p><br/><p>Due to the extremely short distance, Benjamin was unable to dodge it. He was instantly hit!</p><br/><p>An alarming energy pierced through the ice armor and hit his body. He almost spit out blood on the spot. In that instant, his entire person was hit so hard that he flew over ten meters. With great difficulty, he maintained his balance and halted in the air. The armor on his body had been so badly beaten that it was now dilapidated; a stinging, fiery pain surged out from the inside of his thoracic cavity.</p><br/><p>Damn it...</p><br/><p>Benjamin's eyebrows furrowed tightly. He had not imagined that Grant would be so adept at borrowing power to demonstrate his skills.</p><br/><p>Nevertheless, he immediately took control of the water elements; healing flows of water enveloped him and healed all of his injuries, and the shattered ice armor was completely fixed within a second. In the blink of an eye, everything was as though nothing had happened. Benjamin was entirely as fine as he had been at the start, and his pain subsequently vanished.</p><br/><p>Nevertheless, over at Grant's side, the second rune had also risen to his glabella. Then, it shattered abruptly.</p><br/><p>Buzz!</p><br/><p>It was another great wave of energy. Benjamin was completely unable to sense where it came from; it was as though an invisible fist had landed straight onto his body. There was absolutely no way to dodge it. At that moment, he was hit so hard that there was even a ringing in his ears; a buzzing sound erupted in his brain, and the armor that had just been fixed shattered into a pile of ice sludge once more.</p><br/><p>Fortunately, the healing flow of water was still there, and pulled him back from the excruciating pain.</p><br/><p>What on earth was that...</p><br/><p>Without any time to give it much thought, he immediately activated the Descending of Water. In an instant, the sensation that caused him to feel as though he was becoming one with the water elements, restored the ice armor on his body once more. It had even become several times more fortified. Furthermore, this time, when Grant shattered the third rune, he could finally see what was going on clearly by borrowing the extremely astute perception he possessed in that state.</p><br/><p>Great amounts of light elements had formed a gigantic hand, moving first in the elemental plane and flying towards Benjamin. It then emerged violently into the real world upon reaching him and was smashed down brutally!</p><br/><p>It was rather similar to the principle of being in the intangible form.</p><br/><p>Being prepared, Benjamin directed the water elemental sprite to go in front of the gigantic palm of Holy Light. Then, in the instant when the palm changed into its physical form, densely packed water silks shot out from the body of the sprite and were interwoven to form a huge net, forcefully blocking the attack.</p><br/><p>\"Many people, huh...\" After that, Benjamin shot out and bypassed Grant, dashing straight for the priests behind him that had been generating power for him.</p><br/><p>The wall of light appeared once more and encircled those few dozen people, which included Grant. It also blocked Benjamin's path. However, having been fortified by the Descending of Water, he still stretched out his right hand; a Sword of Ice suddenly emerged through condensation, held by him at the hilt only.</p><br/><p>The sword glistened in the night, with water elements compressed into it like the ocean. There seemed to be snowflakes drifting and falling within the blade of the sword; at the same time, it was as though numerous miniature swirls could be seen in it. An astonishing magic oscillation spread out from the Sword of Ice, causing even the temperatures within the area of a few dozen meters to plunge. As though undergoing precipitation, the speed at which the Holy Light surged seemed to begin decreasing.</p><br/><p>The Descending of Water, the deep sea domain, High Level Water Element Affinity Magic Potion, Source of Spirit Tonic... Putting such a variety of buffs together, this was the first time Benjamin was attempting to unleash the most extreme form of his fighting ability.</p><br/><p>Furthermore, all of these were condensed into this sword.</p><br/><p>Wielding that sword, he aimed at the wall of light and swung it down with all his might!</p><br/>\n</div>"}