{"title": "Chapter 925: A Battlefield Fraught with Anxiety", "id": 925, "volume": 10, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-925-a-battlefield-fraught-with-anxiety", "volume_title": "Volume 10", "body": "<h1>Chapter 925: A Battlefield Fraught with Anxiety</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 925: A Battlefield Fraught with Anxiety</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>The few members of the Church immediately realized what was going on.</p><br/><p>\"He has gone so far... as to team up with those cultists, that greatly sinful fellow.\"</p><br/><p>At that moment, a few bishops immediately flew down, taking out crosses that were specifically used to restrain psychic spells and opening up protection over the bodies of the soldiers below. These toys had been created back then to resist the worshippers from across the sea. The production of these things had been long ceased; only the bishops still carried them around.</p><br/><p>The only problem was, the psychic spell had already caused chaos within the royal army. The resolve of these men had never been strong to begin with, and after being deliberately guided, the rebellious emotions in their hearts had been unleashed all at once. This was how the scene before their eyes now had unfolded. Even if they stopped the psychic spell now, they still could not be restored to the morale that they had moments ago.</p><br/><p>Those who had been retreating were still retreating, and their actions were affecting the other conscripted soldiers as well. Many of them had been unwilling to risk their lives for the Church from the start; they had been compelled against their will, captured and dragged in. Under such circumstances, how would they had the slightest inclination to fight? Because of that, even though the psychic spellcasters within the barrier had already withdrawn their spiritual energy, the war-weary emotions was already spreading quickly throughout the royal army like a plague.</p><br/><p>The power that they had built by relying on their numbers, disintegrated cleanly in an instant.</p><br/><p>The bishops' hearts were fraught with anxiety, but they knew that they could not stop.</p><br/><p>The cannonballs of Holy light flying in the air were already halfway there. They would land within the next ten or so seconds, and everyone, from the soldiers to the priests... had to launch their attacks at the Runic Defense Technique at that moment. Only by coordinating all the explosions together and breaking through the barrier could they have a chance at winning this battle.</p><br/><p>Because of that, after they had solved the problem of the psychic spells, they did not have time to care about the disorientation of the soldiers. They rejoined the troops behind Grant and began to cast their spells together, as they had planned. At that moment, a dazzling light converged into the entire team of priests, interweaving between every individual. Seen from afar, it looked as though a glowing cloud had appeared in the sky.</p><br/><p>Meanwhile, Grant spread out both his arms. Densely packed runes appeared in the void through condensation; every one of them was flashing with golden Holy Light, encircling his body.</p><br/><p>At that moment, the mages in the barrier ceased their attacks. Under Benjamin's leadership, they entered into a state of defense once more, condensing even more shields above the barrier and trying to protect the Runic Defense Technique from being broken and shattered. Miles had also appeared once more above the Town of Crew, ready to use his body to block the cannonballs that were about to fall.</p><br/><p>\"Hmph...\"</p><br/><p>Seeing that, Grant let out a cold snort.</p><br/><p>They had learnt from their previous mistake. This time, the cannonballs of Holy light they had fired were more spread out; they had been aimed at different spots on the Town of Crewe. Because of that, the mercenary would only be able to block two or three cannonballs at most. It would be like using a cup of water to extinguish a cart of burning firewood; he would not be able to change anything.</p><br/><p>Did he really think that they would stupidly let it happen again?</p><br/><p>Thus, when the resplendent Holy Light exploded in the airspace above the Town of Crewe, the barrier shook violently. Miles had only blocked three cannonballs; the others came crashing in, causing the originally smooth and glossy surface to be distorted. At that moment, in a secret house in the Town of Crewe, two mages who specialized in runes were sweating from their foreheads. They desperately perfused spiritual energy towards the center of the Technique, guiding the entire barrier to absorb the dissipated elements in the air. They were attempting to dissolve the force of the cannonballs through a flexible method.</p><br/><p>Meanwhile, Grant stretched his right arm out and tipped the air in the direction of the barrier, which was suddenly glowing and dimming.</p><br/><p>All the runes that he had condensed shattered in an instant.</p><br/><p>Buzz!</p><br/><p>A low buzzing sound shook through the entire town, causing every brain to go numb; no one knew where it came from. By the time they came back to their senses, they saw the Runic Defense Technique cracking from the top, like glass that had shattered and spread throughout the sky. Every piece flew out, until the entire thing dissipated and vanished.</p><br/><p>\"Everyone, charge! Those who retreat shall be killed without mercy!\" Grant's voice echoed in the airspace above the royal army.</p><br/><p>At his words, around ten cannonballs fell from the sky. Every one of them accurately hit soldiers who had been escaping. Just like that, a few dozen deserters were instantly turned into smoke and dust. The remaining people were so shocked by this scene that their entire bodies trembled; they dared not escape now.</p><br/><p>The royal army was forcibly stabilized, and began to charge forward once more. At that moment, the Runic Defense Technique had already been broken. There were no hindrances before them at all; thus, they rushed straight into the center of town.</p><br/><p>A battle on the streets immediately broke out between them and the soldiers of the Black Nightmare Army.</p><br/><p>At the same time, the battalion of priests also flew into the Town of Crewe, led by Grant. It was then that a large team of mages blocked their way in front. In addition, the Runic Combat Team below them were eying them fiercely, ready to strike; their imposing aura was astonishing. However... Grant looked to the left and right, but he did not see Benjamin's figure.</p><br/><p>\"...Where did that devil go?\"</p><br/><p>Furthermore, they had definitely felt that something was amiss after they had rushed in. There were very few soldiers who had come out to fight them, and all of them seemed to be from the Black Nightmare Army. Where were the people of the Wood family?</p><br/><p>Those few bishops felt somewhat uneasy, but Grant did not hesitate because of that. If Benjamin was not going to appear, then it was fine by him; he could strike however he pleased and kill all his subordinate mages. There was already no one who could stop him.</p><br/><p>However, just as he was ready to go in for the massacre, a figure suddenly dashed out from the shadows!</p><br/><p>\"...Damn it!\"</p><br/><p>Grant's heart jumped; borrowing the extreme speed of his flight, he avoided the attack. However, a bishop behind him had not been able to dodge it. A small, thin incision appeared on his neck, and fresh blood seeped out. The bishop had not even realized what had happened; with a dazed look on his face, he dropped down from the air.</p><br/><p>Miles then stopped on top of a roof, staring coldly at Grant.</p><br/><p>After stopping temporarily, he jumped up once again. No longer aiming at Grant, he directed his attacks straight at the bishops behind him. Grant had no choice but to crush a piece of pendant; suddenly, a huge shield appeared in his hand. Raising the shield, he used it to defend the bishops from the front, helping himself block the attack this time.</p><br/><p>Thus, Grant was delayed in this manner by Miles. Neither one of the parties could deal with the other. As they continuously attacked and defended, the positions of both parties slowly diverged from where the main troops were. As for the battalions of priests and mages, they had quickly clashed with each other after a temporary stand-off.</p><br/><p>The entire Town of Crewe was soon plunged into a chaotic battle. The residents hid in their homes, cowering in fear. No one knew which side was going to win the battle this time.</p><br/><p>Relying on the advantage of having greater numbers, the royal army slowly gained the upper hand. A few thousand men fighting tens of thousands of men could not exist on the same level as their opponents at all, even if those tens of thousands had low military morale and terrible training. The Black Nightmare Army was slowly showing signs of fatigue; they could only fight as they retreated, relying on the defensive structures they had laid down in the town to barely persevere. On the other hand, the royal army had a boost of morale; realizing that it was possible for them to win, even the soldiers who had originally planned to escape became excited, and took advantage of their victorious state to pursue and attack their enemies.</p><br/><p>However, it was right around this time...</p><br/><p>A few loud and clear screeches suddenly rang out from above, echoing through the streets, big and small, of the Town of Crewe.</p><br/>\n</div>"}