{"title": "Chapter 929: After the Battle", "id": 929, "volume": 10, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-929-after-the-battle", "volume_title": "Volume 10", "body": "<h1>Chapter 929: After the Battle</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 929: After the Battle</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Yet, at the same time.</p><br/><p>\"Alright, bring the captives back to the camp. Divide into two teams and continue searching. If you discover traces of the priests, inform us immediately. The remaining people, follow us back.\"</p><br/><p>The pursuit and attack in the battle of the Town of Crewe came to an end. Almost every person of the entire royal army was captured as prisoners of war; majority of the priests were dead as well, having been chased and killed. As for the remaining enemies, they had already taken the chance during this period of time to flee, leaving no trace behind. There was no advantage to gain by pursuing them anyway. Thus, Benjamin nodded and gave the command to withdraw the troops.</p><br/><p>In actual fact, even if they let those priests escape, they would not be able to make any waves.</p><br/><p>Half an hour ago, they had received the news sent by Elizabeth. Havenwright had fallen, and St. Peter's Cathedral had been destroyed. Where else could this bunch of priests run to?</p><br/><p>The Church was already finished.</p><br/><p>\"Don't be careless, the current Pope is still alive and well. This war isn't over yet if he hasn't been dragged out.\" Miles walked over from a distance, speaking as such as he looked around.</p><br/><p>\"I know.\" Benjamin nodded, saying, \"But if he's really determined to hide and conceals himself deep in the mountains, or in some remote corner in the kingdom, I'm afraid it'd be very difficult to find him through ordinary methods. So... this heavy responsibility is passed om to you!\"</p><br/><p>For a moment, Miles was at a loss.</p><br/><p>\"Why... is this on me again?\"</p><br/><p>\"Who else is capable of finding a person from a vast sea of people, other than you?\" Benjamin patted his shoulder, speaking with a stern expression. \"Don't decline, I know you have this ability! Go, the future of the kingdom depends on you!\"</p><br/><p>\"...\"</p><br/><p>Miles was at a temporary loss for words. Before he could even say anything, the task of finding Grant had come upon his shoulders.</p><br/><p>As for Benjamin, he turned around to look at the Griffin King.</p><br/><p>After the spiritual energy of the two siblings was exhausted, the Griffin King regained its savage nature. Benjamin had no choice but to weave another water cocoon and trap it inside; however, keeping it trapped inside was not a solution. The previous cave inside the mountain was no longer usable; to bring it out this time, they had blasted a gigantic opening through the cave in the mountain. He was afraid that if he were to toss the Griffin King back there, this chap would just fly out and seek its revenge on them almost immediately.</p><br/><p>There was nothing else to be done before his eyes. The work of clearing up the battlefield could be left to someone else. He had also decided to lock up the captives from the royal army for a few days before slowly handling them. Whatever it was... The battle had been won, so their situation naturally improved by leaps and bounds. They did not have to undergo the turmoil and chaos of war as though they were fleeing for their lives, so they could first solve the problem of the Griffin King.</p><br/><p>However, he still could not come up with a solution after pondering about it. Benjamin could only drag the water cocoon and bring it back to the Town of Crewe as well.</p><br/><p>This time, the Town of Crewe was bustling with activity.</p><br/><p>The battle had ended, so the residents could finally push open the doors to their houses and walk onto the streets once more. Although there were dead bodies on the roads everywhere and the stench was unbearably horrible, their emotions were still so riled up that it was somewhat difficult for them to calm down.</p><br/><p>Within the short span of a day, these people had witnessed far too many things. The defeat of the royal army, the Pope fleeing in a pitiful state... as well as that gigantic griffin Mage Benjamin had ridden and controlled. Fear, suspiciousness, excitement... With all sorts of emotions mixed up together, they also did not know why they were being so agitated. Nevertheless, they just could not calm that emotion down.</p><br/><p>The Church... had really been defeated.</p><br/><p>Of course, when Benjamin dragged the Griffin King back, they were frightened once again, going back into their houses to hide.</p><br/><p>\"You have to prepare a cage for it.\"</p><br/><p>Benjamin flew straight into the camp of the Black Nightmare army and sought Morris out. Dragging the Griffin King which was in the water cocoon before his wheelchair, he spoke thus. Of course, to accomplish this action, two tents in the camp had been overturned, and a rather huge ditch had appeared on the ground.</p><br/><p>Morris had a speechless expression.</p><br/><p>\"I might as well prepare a coffin for myself.\"</p><br/><p>\"Please, just make one. Whatever materials it takes, we can afford it.\" Benjamin hurriedly explained. \"Have you considered what this entails? Humans have found a way to tame Magical Creatures, this is the beginning of a new era. If humans could freely ride and control Magical Beasts one day, what would this world become?\"</p><br/><p>\"...What are you trying to say?\"</p><br/><p>\"You could mimic the principles of psychic powers and try to come up with a magical instrument that can be used to control Magical Creatures through research.\" Benjamin was already willing to say anything to solve the problem of the Griffin King's existence. \"After the people over at the academy hear about its existence, they've already sent men to ask for it from me, saying they want to take it away for experiments. But if you could only produce this cage, it'll, from then on, be your research material and yours alone. No one can snatch it away!\"</p><br/><p>Hearing that, Morris narrowed his eyes. He looked up and down at the griffin king, which was still struggling in the water cocoon, sizing it up.</p><br/><p>\"Mine alone?\"</p><br/><p>\"That's right!\"</p><br/><p>\"Alright then, I'll try.\" Morris sighed helplessly, nodding as he spoke.</p><br/><p>Benjamin let out a sigh of relief as well.</p><br/><p>All the production mages in the camp had been gathered specifically to do research on the cage for the Griffin King. As for Benjamin, he could only continue maintaining the water cocoon and trap it inside, waiting for them to come up with the product. The troublesome part was that the waiting took a day and a night, and his spiritual energy was almost completely used up. He had to rely on the support of magic potions and the two siblings lending a hand to finally endure until the cage was rushed and built.</p><br/><p>A gigantic cage, with runes carved all over its bars of steel, was set up in the middle of the Black Nightmare Army's camp. Even the people of the entire Town of Crewe could see it.</p><br/><p>After Benjamin had ensured that it was sturdy enough, he let out a long sigh of relief and tossed the Griffin King inside.</p><br/><p>He wished to return and rest, but it was a pity that the messenger from the Imperial Capital had already arrived. He could only hang on mentally, changing his clothes once more before meeting with the other party in the main tent.</p><br/><p>\"What's the situation over in the Imperial Capital?\"</p><br/><p>The messenger that had come was a knight of the Wood family. He had served in the Black Nightmare Army before, so he opened his mouth and spoke without reservations. \"Honorable Director, the situation of the Imperial Capital is now stable. St. Peter's Cathedral has been completely burnt down and destroyed by us, including the various collections of books inside, and tools... Just as you've insisted during the meeting, nothing inside has survived.\"</p><br/><p>Hearing that, Benjamin nodded.</p><br/><p>It was really a pity, but this was something they had to do.</p><br/><p>\"Be careful. We might have crushed and scattered the royal army, but the Pope is still alive,\" he reminded. \"With his capabilities, you'd still be in huge trouble if he were to bring men and launch a sudden attack on the Imperial Capital.\"</p><br/><p>The knight nodded, and said, \"The honorable duchess sent me here for this. She hopes that the Academy of Magic could help by providing a few mages that specialize in runes and help us build a Runic Defense Technique in the Imperial Capital. This way, we wouldn't be afraid of any surprise attacks by the enemy.\"</p><br/><p>...So it turned out that this was the plan.</p><br/><p>Benjamin was rather surprised in his heart, but he did not say a word. He immediately expressed that he would send some people over. In fact, he could bring the Black Nightmare Army and move over there as well. Nevertheless, the Crusader Gateway was still a strategic military place, so they had best keep guard at both locations and prevent Grant from appearing suddenly.</p><br/><p>Thus, after reporting on the situation in the Imperial Capital in detail, the knight gave a bow and turned around to leave with the appointed rune mages. Meanwhile, Benjamin gave a sigh of relief. Dragging his feet, he returned to his own tent, and fell asleep the moment he laid down.</p><br/>\n</div>"}