{"title": "Chapter 935: Complete Elimination", "id": 935, "volume": 10, "url": "http://boxnovel.org/when-a-mage-revolts-chapter-935-complete-elimination", "volume_title": "Volume 10", "body": "<h1>Chapter 935: Complete Elimination</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 935: Complete Elimination</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>At that moment, a smile broke out on Benjamin's face.</p><br/><p>\"You... What are you laughing about?\" Although Cain could not see the dialog box, he seemed to have noticed that something was amiss as well. Thus, he frowned and asked.</p><br/><p>Benjamin lifted his head and slowly opened his mouth; his expression became that of a person who was confident and had a plan. \"I'm laughing at your foolishness. There's no God at all in this world, but you've created it through your imagination and wasted all seven thousand years on an empty lie.\"</p><br/><p>Saying thus, he pressed the OK button.</p><br/><p>The dialog box disappeared. Immediately after, the green interface of 360* appeared before his eyes. The small frame stating that files were currently being deleted had been activated, and its progress bar was beginning to grow longer, little by little.</p><br/><p>At that moment, Cain had not even realized what had happened.</p><br/><p>\"Nonsense! God is the one who gifts the power of magic to humans. The existence of this space of consciousness is the best evidence.\" He rebutted.</p><br/><p>\"Magic has nothing to do with God at all.\" Benjamin shook his head. The deletion had begun, and while waiting for the progress bar to fill up, he had become rather at ease. He spoke slowly. \"Magic is created because of the elemental plane. The elemental plane overlaps with our world, so the organisms there project themselves into our world, forming elements. We also undergo changes due to the influence of the elemental plane, possessing spiritual energy. Thus, magic is produced.\"</p><br/><p>As he listened to those words, Cain suddenly put on a look of disdain.</p><br/><p>\"Hmph... A bunch of gibberish. You merely want to delay the time again. It's an irrefutable truth that God had gifted magic to me, on the mountain right outside Karl village.\"</p><br/><p>\"Really?\" Benjamin laughed softly. \"So that's to say, you should have seen God himself, then? What does he look like? How tall is he, how fat? What color is his hair? On the day God appeared, was it in the morning or the evening, was he wearing long sleeves or short?\"</p><br/><p>Hearing that, an uncertain and doubtful expression showed on Cain's face. He did not immediately speak.</p><br/><p>Benjamin put his hands up, saying, \"It's very easy for memories to become blurry after a long period of time. Moreover, for you as a revenant, a lot of your memories have actually been lost the moment you died. So... you simply can't remember how you'd learn magic!\"</p><br/><p>In an instant, Cain's face turned green.</p><br/><p>\"...What are you being arrogant about, those two machines can only save you once.\" He suddenly waved his hands, once again forming a few ice needles through condensation, and aimed them at Benjamin. \"Go back to that illusion and offer up this body. That's what you're supposed to do now.\"</p><br/><p>However, Benjamin looked at him as though he was looking at a madman. He shook his head in pity.</p><br/><p>\"Find a pair of brothers, possess the body of one each, and get the two brothers to kill themselves on the mountain... Even if there really were a God in this world, how could he give such a stupid command?\"</p><br/><p>By now, a quarter of the progress bar had just been completed. Nothing unusual had been shown, so Cain did not notice anything wrong. He was merely infuriated by Benjamin's words once more, narrowing his eyes as his greyish white beard trembled.</p><br/><p>\"Stupid? You call this stupid?\" He spoke in a fury. \"This is a sliver of a chance at forgiveness that we've finally managed to beg from God's hand, us revenants who have drifted in the Netherworld for two thousand years and experienced immeasurable pain and suffering. You are a man from the otherworld, what right do you have to criticize us as such?\"</p><br/><p>Benjamin raised his eyebrow, and shot a question back at him derisively. \"So that's to say... God had manifested himself to you guys again?\"</p><br/><p>\"That's right!\" Cain spoke in an extremely confident tone of voice. \"We've tried over ten thousand ways to pass through the borders, but as revenants, it's forever impossible for us to cross the dividing line between the living and the dead. Until that day, when a beam of divine light shone down from the sky and enveloped our spirits. We heard a holy voice coming from the sky, then, by the time we came back to our senses, we'd already returned to the land of the living.\"</p><br/><p>Benjamin laughed out loud.</p><br/><p>\"How is this different from an illusion that a lunatic comes up with through his imagination?\" He shook his head, and said, \"It's just a deep abyss, and it's not a place that's too difficult to cross. Is 'God's' special help really necessary for two revenants to accidentally drift over here? And a beam of divine light... Are you sure it's not because you'd not seen sunlight for too long, so you'd regarded the first ray of sunlight you saw as divine light?\"</p><br/><p>\"You...\" Cain was speechless with anger.</p><br/><p>By then, the progress bar had advanced more than half. All of a sudden, the inside of Cain's body emitted a secret oscillation. Cain's expression changed immediately. He looked to the left and right, only to see numerous, tiny binary codes appeared in the void, turning into lines of light that bound Cain up once more.</p><br/><p>After that, a bolt of lightning comprising of data fell from the sky, high up in the space of consciousness, and struck Cain's body violently!</p><br/><p>Cain's body was struck so hard that half of him became void immediately.</p><br/><p>\"How, how is this possible?\" He was struck dumb slightly. Standing rooted to the spot, he had even forgotten that he had to defend himself.</p><br/><p>Benjamin watched him, and let out a scornful laugh.</p><br/><p>\"Such a pity, you seemed to have underestimated those two run-down machines.\"</p><br/><p>\"Damn machines, why won't the director general abide by the law...\" Cain came back to his senses and stretched out his hand in a panic, wanting to summon the golden rune. However, this time, the rune had just formed in the palm of his hand when it immediately dissipated for an unknown reason. It was completely unable to resist the assault of the data stream for him.</p><br/><p>Just like Benjamin, he suddenly discovered that he was completely unable to shift his energy.</p><br/><p>Realizing this fact, he raised his head. His eyes were filled with rage. \"You... You despicable thief!\"</p><br/><p>\"This has nothing to do with me.\" Benjamin shrugged, saying in a helpless manner. \"It's all the System's doing, it's the worst of all.\"</p><br/><p>\"No... We haven't fulfilled God's will yet, I, I cannot die in this place...\" Nevertheless, Cain did not seem to have heard him. He talked to himself as he began his attempts once more. He formed runes through condensation, and the runes would dissipate; this happened repeatedly. It was completely useless.</p><br/><p>During this process, the expression on his face changed, little by little, from rage, shock and panic, to despair.</p><br/><p>Benjamin watched him with indifference. \"Admit it, there's no God's will or anything like that at all. You've only been using a reason like this to deceive yourselves, just so you'll have a peace of mind.\"</p><br/><p>\"No, God... God exists!\"</p><br/><p>\"But you don't have any solid evidence.\"</p><br/><p>\"I have evidence.\" Trapped in the data streams, Cain had already given up on resisting by then. He looked at Benjamin with empty eyes. \"That battle seven thousand years ago... The scene I remember the most clearly. At the same, it was God who ended the war between us.\"</p><br/><p>Hearing that, Benjamin frowned.</p><br/><p>\"...That battle?\"</p><br/><p>\"It was God.\" Cain spoke hesitantly. His expression shifted continually between one of confidence and one of confusion. \"The battle had been going on for two hours, and when I'd finally had the chance to win and was about to pierce through Abel's chest with fire, the entire world shook suddenly. Our actions of slaughter and fighting between brothers had finally angered God; a crack had suddenly appeared in the sky. Violent winds, meteorites, sounds of thunder echoed throughout the entire valley... It was a scene that no one had ever seen. A terrible fire hit us after that. Before we could determine the victor and loser, we were completely obliterated. As for the entire Abandoned Valley of Gods, it was plunged into a rift in space, turning into a dead land.\"</p><br/><p>Having heard that, Benjamin shook his head. He watched Cain with a pitiful look in his eyes.</p><br/><p>\"That wasn't God showing up at all.\" He spoke slowly. \"Runic magic causes elemental natural disasters. You haven't noticed this fact at the time, have you? Large numbers of mages had gathered in the Abandoned Valley of Gods, and after a long battle, had caused the disorder of elements on a large scale. Eventually, the first horrible elemental natural disaster had been generated, sending the entire valley into the void.\"</p><br/><p>Cain was stunned.</p><br/><p>\"Elemental natural disaster...\"</p><br/><p>\"That's right. There's a very ancient Mages Organization. The development of magic over the past few thousand years has been recorded by them.\" Benjamin put his hands up. \"When they came to see me... You don't have the memory regarding this, do you? Looks like the one who'd stored this piece of memory at the time was the System.\"</p><br/><p>However, Cain did not say a word. He merely stood rooted to the ground in shock, letting the data stream wash over him and thinning him out more and more.</p><br/><p>Or perhaps, he was unable to say anything anymore as well.</p><br/><p>\"The world's so big. Fights between brothers, regicides, fornication... Immoral things happen every day. Even if there's really a God, he wouldn't be able to look after so many sins.\" Benjamin looked at Cain coldly, and said, \"The so-called atonement of sins is just you being weak and not daring to face the mistakes you've made. So you rely on begging for God's forgiveness to help yourself feel a little better, that's all.\"</p><br/><p>\"I... I'm not weak...\"</p><br/><p>\"Then do you dare admit that it'd been you who hadn't handled your relationship with your brother well, that it had been you who'd caused the division in the tribes, you who'd murdered your own blood brother, and you who'd killed all the clansmen in the Abandoned Valley of Gods? That you will forever bear these things upon yourself, and there's no god who could pardon you?\"</p><br/><p>\"I...\" Cain was stuck for words. His expression suddenly turned into one of anguish. \"What right do you have to criticize me? Do you think your hands are all that clean? I'm telling you, I remember clearly all the dirty things you've done along the way!\"</p><br/><p>\"Yes, I know I'm not clean, but I don't regret it.\" Benjamin's face did not change. \"Two hundred years from now, the world will regard me as a saint, and bow before me in worship. Two hundred years after that, they might treat me as a sinner again, spitting on and cursing at my grave. Then, after another two hundred years, they might argue over my actions, and no one would dare come to a conclusion... Whatever it is, I won't create a God and use such a pretentious excuse to excuse myself.\"</p><br/><p>Cain had nothing to say to that.</p><br/><p>Benjamin continued to say, \"Moreover... Even if there really were a God, it's not up to him to judge my rights and wrongs.\"</p><br/><p>Following his words, the progress bar reached a hundred percent. There was another lightning bolt comprising of data after that; it landed straight on Cain's head. At that moment, Cain was encircled by data streams that flashed with light. Blurring out like a cluster of light smoke, his form as a revenant was totally exposed.</p><br/><p>He looked at Benjamin. Despair and dissatisfaction flashed across his complicated expression while he opened his mouth, as though he wanted to say something.</p><br/><p>In the next second, he dissipated into the darkness of the space of consciousness.</p><br/><p>\"...Has it ended?\"</p><br/><p>Benjamin gave a long sigh of relief. The interface of 360 had already disappeared. Meanwhile, the cage that entrapped him was slowly turning into bits of fluorescent light after Cain had withered away. At that moment, the entire space of consciousness surged towards him once more. Water elements, runes, spiritual energy... Benjamin stretched out his hands and felt the power of magic fill his soul once more, even greater and more powerful than before.</p><br/><p>However, he felt a strong sense of unfamiliarity.</p><br/><p>\"This is... I am...\" He squinted and lifted his head.</p><br/><p>That feeling was akin to what he had felt on the day he had first travelled through time and space. Dazed, confused, lost... The memories of the modern world suddenly became exceptionally vivid. Although many years had passed, it felt as though he had still been working overtime when he recalled the events of yesterday.</p><br/><p>Meanwhile, the memories in this world had a layer of unreality on them, like pictures from old movies. They were mottled yellow, and had changed to the perspective of a third person.</p><br/><p>\"...I am Kubei.\" He finally remembered the name that had been screened.</p><br/><p>However, as he massaged his head, he tossed this matter aside first, and turned his head to look at the entire space of consciousness. He saw the water elemental sprite that was flying at a distance to the side, looking at him curiously. He also saw the runic star chart, sparkling above the space of consciousness.</p><br/><p>However... He had yet to find those smiley faces.</p><br/><p>\"Hey! Come out!\" He yelled immediately. He was filled with a strange feeling; there were questions he had to ask.</p><br/><p>There was no response.</p><br/><p>\"Hey! Don't hide anymore, I have something to tell you.\" Not discouraged, he continued shouting. \"Don't worry, you've just rescued me so no matter what you say, I'll definitely not bully you this time!\"</p><br/><p>There was still no response.</p><br/><p>For a moment, he stood dazed on the spot.</p><br/><p>The water elemental sprite came close to him carefully and flew in two circles next to him with a confused expression on its face. Then, it quickly flew off into the distance again.</p><br/><p>For about half an hour after that, there were echoes of hoarse shouts inside the space of consciousness. However, for an unknown reason, it still felt extremely quiet in there. The compound runes flashed, and the water elements were rippling slightly... Everything was very normal, going to and fro according to their established laws as though they could maintain this state for a thousand, or ten thousand years, and never change.</p><br/><p>Eventually, he sat on the ground weakly. The faint blue light that shone down from the runic star chart lit up a disbelieving face.</p><br/><p>\"...Really ...No more?\"</p><br/><p>Although he was talking to himself, it caused his throat to hurt as it had previously.</p><br/><p>He swept his gaze across the space of consciousness again and again,; again and again, he drew his sights back in disappointment. Cain had vanished, and along with him, the entire System had disappeared as well. Previously, he had been able to sense the subtle aura that came from the elemental plane from the bodies of those smiley faces. However, that aura had completely disappeared from this place now.</p><br/><p>It was outrageously quiet.</p><br/><p>He took a few sudden, deep breaths successively. The water elements converged, the blue light flashed, and the healing drizzle fell on his body, but none of them seemed to help him feel better.</p><br/>\n</div>"}