{"title": "Chapter 12: Protection", "id": 12, "volume": 1, "url": "http://boxnovel.org/in-different-world-with-naruto-system-chapter-12-protection", "volume_title": "Volume 1", "body": "<h1>Chapter 12: Protection</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 12: Protection</p><br/><p>“Tian You, were you always travelling the continent by yourself?” Lan Yan quickly rode Gale horse, and asked a question as he was quite curious about Ren Tian You. In his opinion, it was impossible for Ren Tian You who was only intermediate fighter to survive in the continent for so long. But he didn’t know and he would not believe that not too long ago, Ren Tian You had killed Saint Class magical beast.</p><br/><p>“He he, actually I relayed on the power of my blood lineage, so I was able to survive for this long. And I really don’t like fighting so I cultivated up to intermediate fighter and stopped cultivating.” Ren Tian You explained with a smile.</p><br/><p>“Oh, it was like that.” Lan Yan let out an understanding sound.</p><br/><p>The power of blood lineage was quite normal in this Divine Wind continent, basically every expert cultivators possessed the power of blood lineage. There are verities of all kinds of strange blood lineage, there is no lack of pure element based blood lineage and those who have this blood lineage have higher affinity with their element compared to others. Fire blood lineage, lightning blood lineage and so on are the example of pure element blood lineage. And there is also a blood lineage that is passed down from the higher level magical beasts or even mythical beasts, such as the clan of original owner ‘Ximen Tian Long’ had the blood lineage of dragon and this powerful strength of this blood lineage helped them to become one of 4 major clan.</p><br/><p>The power of blood lineage are classified into 9 rank, rank 9 is the lowest. And above rank 1 there is still Saint rank and highest blood lineage God ranked blood lineage. Although the power of blood lineage can somewhat improve the strength of the person, but higher ranked power of blood lineage would make even easy to improve the strength.</p><br/><p>So after Lan Yan heard that Ren Tian You had relayed on his power of blood lineage to survive in the continent for this long, he nodded his head in understanding. As they all knew that power of blood lineage could have any kind of strange ability.</p><br/><p>“Oh, that’s right, why were you here, Magical Beasts forest is very remote place and also very dangerous. Don’t tell me that you all had nothing to do and come here for a tour.” Ren Tian You felt quite strange as he thought why Lan Yan and others had come to such a dangerous place.</p><br/><p>Ren Tian You had already noticed that the strength of these peoples were quite good, especially that beard man Luo Tian Xing, do not underestimate him just because he looked funny, his strength was already at the level of swords master and Ren Tian You could also sense some type of fearful power hiding inside his body, and current level Ren Tian You shouldn’t underestimate this fearful power. The strength of remaining other was also not bad, weakest among them was already at the level of magic scholar.</p><br/><p>But all of them could be counted as a genius as they have this level of power at their current age. Still this level of power was not sufficient to venture inside Magical Beasts forest. And you should know that inside Magical Beasts forest, there are many high level magical beasts who are far stronger. Unless you stay outside the forest, perhaps inside the forest you could encounter class 6 or 7 magical beasts, which could easily annihilate you. And from the dress and their speaking manner, Ren Tian You was absolutely sure that they were descended of a huge clan, so why did the older generation of their clan take the risk to let these outstanding talents to come to this Magical Beasts forest without any guards.</p><br/><p>“He he, to tell you the truth, we are the student of Supreme Light Academy, we came to this Magical Beasts forest because our teacher of academy gave us the experience and training assignment. We had to complete this assignment in order to rise to a higher class.” Li Feng who was next to Ren Tian You slowly explained.</p><br/><p>“So it was like that! Yi………” Ren Tian You suddenly stopped talking in the middle of his sentence, because he sensed several powerful energy at some distance behind him.</p><br/><p>“What’s up, Tian You?” After hearing the surprised voice of Ren Tian You, Luo Tian Xin curiously asked.</p><br/><p>“It’s nothing, only just now I almost fell from the horse.” Ren Tian You explained, and he slowly immersed himself inside his mind.</p><br/><p>“Ha ha, you should be careful Tian You, don’t fall down, otherwise you would surely lose your face.” Luo Tian Xing used his violent voice to laugh heartily, as if he had already forgotten the quarrel before when Ren Tian You had called him uncle.</p><br/><p>Ren Tian You ignored Luo Tian Xing, but rather immersed in his mind and he formed several hand seal secretly, suddenly his awareness enlarged and covered a large area and finally he could clearly sense several people who were tracking them.</p><br/><p>“Altogether 5 peoples, f**k, weakest one among them is already at the level of great sword master, furthermore 2 of them are of saint level, what do they want to do?” Don’t tell me they wanted to rob Lan Yan and others, or perhaps they are their clan’s enemies.” Ren Tian You had used sensory ninjutsu and sensed all the peoples following them along with their strength, which caused him surprised. 3 great sword master and 2 saint, even Ren Tian You had to be careful to deal with them.</p><br/><p>“Yi, this is…………..” Suddenly Ren tian You felt that those peoples who were following them, had a familiar atmosphere, as if he had already seen them before.</p><br/><p>“Oh, that’s right, this atmosphere and the atmosphere around this Luo Tian Xing is quite similar, don’t tell me they are..?” Suddenly Ren Tian You felt that the atmosphere around one of fellow who was following them and the atmosphere around Luo Tian Xing was very similar. He slightly thought for a moment, he turned around and gave a mysterious smile facing towards the back.</p><br/><p>…………….</p><br/><p>“Old Luo Tou, just a moment ago, did you notice someone was sensing us.” Far behind one thin and weak looking small old man of the 5 asked to the man whose atmosphere was similar to Luo Tian Xing and this man also had his face covered with bread, although he was very old in age, he still gave tyrannical atmosphere.</p><br/><p>“I heard what you said, just a moment ago I also sensed someone examine us, but it was very weak. I thought it was my imagination.” The man who was called old Luo Tou answered to thin and weak looking old fellow with a violet voice.</p><br/><p>“I felt it too, as a result I had asked whether you had sensed it or not. Since you had also sensed, that means that was not our imagination. Nearby there should be someone who have powerful sensing ability.” After hearing the answer of Old Luo Tou, that thin and weak looking small old man said with imposing face.</p><br/><p>“Don’t tell me, those people had realized that young master had gone to Magical Beasts forest and sent an assassin. But it’s impossible, although those peoples and we are enemies, they should not have enough courage to break that rule.” After hearing the conversation, one of the 3 great sword master at the back asked.</p><br/><p>In the Divine Wind continent, the top powers had imposed unwritten rules, and that was no one was allowed to secretly attack the junior below the age of 22 or all the big powers will jointly attack. The reason for this was, if there was a conflict between two groups, then the old generation of one group would kill the junior member of another group and vice versa, this can cause the heritage of one or both to be broken.</p><br/><p>“I also think that, they don’t have that much courage to break that rule, since they know the consequences.” Another great sword master shook his head and said to his peer.</p><br/><p>Listening to the guesses of old friends, old Luo Tou was still thinking who the owner of that sense was. At that time, unintentionally old Luo Tou caught the sight of Ren Tian You who had just looked back and smiled mysteriously facing their direction. In his heart he was completely shocked, and he felt that he had seen the eyes of Ren Tian You was blood red in color.</p><br/><p>“Could it be that, he is……..”</p><br/><p>Old Luo Tou was completely surprised with his own thought, but this was one of the most reasonable explanation. And he had realized that, this sense was appeared from Ren Tian You, plus that mysterious smile. Although it was hard to believe, but this was the best explanation so far.</p><br/><p>“Its not them, rather that youth at the side of young master. It looks like, the new friend of young master this time is not ordinary.” Old Luo Tou said with his violent voice.</p><br/><p>“How could that be…………”</p><br/><p>………………</p><br/><p>Ren Tian You didn’t know anything about the conversation of those old guys, but he didn’t care. He already had a good first impression on Luo Tian Xing and the other and felt that they were worthy enough to become friends with. So Ren Tian You didn’t hold any bad intention towards them.</p><br/><p>Although now Ren Tian You had got the powers that he could never get on the earth, nevertheless he still holds the opinion that if others let him alone, then he would let them alone. But if someone attacked him, then he wouldn’t mind showing them what was known as real despair. The cultivation at Magical Forest for more than 2 years had not only increased his strength but also helped him adapt his mind. He had already adapted to the jungle law of this brutal world and already possessed a real strong heart.</p><br/><p>Ren Tian You, Lan Yan and others rode Gale horse for almost 3 hours, and he finally saw his first city, from the time he had arrived in this different world.</p><br/>\n</div>"}