{"title": "Chapter 15: Duel", "id": 15, "volume": 1, "url": "http://boxnovel.org/in-different-world-with-naruto-system-chapter-15-duel", "volume_title": "Volume 1", "body": "<h1>Chapter 15: Duel</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 15: Duel</p><br/><p>All the food and delicacies on the table were rapidly wiped out. Ren Tian You had stayed at Magical Beasts forest for more than 2 years, and had only eaten roasted meat of magical beasts like a savage, So now for him anything other than roasted meat was a high level delicacy. And Lan Yan and others were the descended of large clans, from childhood on, they had lived in luxury but this time they suddenly had to go to the Magical Beasts forest for a month long training exercise.These pampered youths had to endure hardships they hadn’t had to before . So when they suddenly saw the table full of delicacies , even Lan Xin Meng and the other beautiful girls were unable to mask their desire. Ren Tian You and company rushed to devour all the food served on the table.</p><br/><p>“Burp!” Luo Tian Xing leaned back at his chair and released a satisfied burp.</p><br/><p>“Finally I got the chance to eat my fill. At the Magical Beast forest,I, your father had to hold back for 1 month!”</p><br/><p>“Really?You cannot eat anymore!? Just a moment ago, you were vigorously stuffing your face. Take a look at the bones left on your plate, by yourself you have devoured a whole barbecued pig.”Lan Yan said with a gaze full of disdain.</p><br/><p>“Bah! You should take a look at Tian You. He is the real master.” After listening to Lan Yan, Luo Tian Xing said while pointing towards Ren Tian You. Lan Yan and company suddenly turned towards Ren Tian You, suddenly everyone’s mouth gaped open..</p><br/><p>They only saw that Ren Tian You was still furiously eating. In front of him were at least 7 or 8 empty plates as well as many scattered bones.</p><br/><p>Ren Tian You suddenly felt all of them were looking at him so he raised his head and discovered that all the others had their mouth gaping wide open and were looking at him with listless eyes. So he asked full of curiosity.</p><br/><p>“Well, why are you all looking at me like that, and why are you not eating?”</p><br/><p>“Well, brother Tian You, are you full?” Long Luo Luo asked stunned.</p><br/><p>“Well, about half full.”</p><br/><p>Along with the answer of Ren Tian You, several thumping sounds could be heard. And he merely saw that Lan Yan and the others had fallen from their chair. Lan Xin Meng and the other 2 beautiful ladies were also sitting unstable on their chairs.</p><br/><p>“God, finally I know what a real foodie is.” Still sitting on the floor, Li Feng exclaimed.</p><br/><p>“Yeah until now I believed I was someone who could eat a lot, but in front of Tian You, I am inferior.” Luo Tian Xing said with an admiring light in his eyes.</p><br/><p>Listening to the others, the face of Ren Tian You was growing darker by the second, and he was shouting in his heart, “F**k, I, your father am losing my face again and again since I came to this world, damn it!”</p><br/><p>When Ren Tian You was whining, suddenly the surprised voice of a male came from the stairs.</p><br/><p>“Luo Luo, that’s great. I didn’t expect to see you here, it seems we are truly destined.” A youth who was wearing splendid clothes and was followed by 4 guards came towards them with a surprised face.</p><br/><p>“Snort. Tian Yun Guan, who is destined with you? We are not familiar with each other, and first take a look in the mirror. Don’t try to act familiar with me!” Seeing this youth, the face of Long Luo Luo suddenly became quite unsightly, and spoke with a disgusted expression on her face.</p><br/><p>“Luo Luo, why are you speaking like this, I am very heartbroken.Am I not treating you wholeheartedly?But why do you still not understand my feelings?” This youth ,known as Tian Yun Guan, said with a sad expression.</p><br/><p>Ren Tian You who was standing at the side suddenly frowned. Just now he saw a hidden glimmer of anger flash in the eyes of Tian Yun Guan. There was no possible way to be mistaken as even his normal eyes were already powerful enough to see through others after awakening the Mangekyo Sharingan.</p><br/><p>“This fellow is definitely bad news. Deep in his heart he is scheming.” Ren Tian You thought.</p><br/><p>“Snort, you are disgusting. You think I don’t know about your matters? You have already said that same sentence to at least 50 other women, isn’t that true?”</p><br/><p>Long Luo Luo replied disgusted.</p><br/><p>“Eh, sister Luo Luo, you are misunderstanding me. How can all those women compare to you?” Hearing Luo Luo, murderous intent flashed in his eyes but he suppressed it, instead said with a smile.</p><br/><p>“Snort. I am going to vomit. And don’t address me like you are close to me. I’ll not speak with you!” While speaking Luo Luo suddenly caught the sight of Ren Tian You. The corner of her mouth raised a little and she ran towards him and took his arm in her bosom, after that she said towards Tian Yun Guan, “And I already have a boyfriend, so from now on don’t bother me.”</p><br/><p>“Brother Tian You, help me driving out this fellow.” Long Luo Luo lowered her head and whispered in a quiet voice.”</p><br/><p>“Leave it to me.” Ren Tian You assured Long Luo Luo. He didn’t have a shred of good impression towards this Tian Yun Guan. This fellow was a deep schemer and had great patience. Since he had already become friends with Lan Yan and the others, he would not allow this fellow to hurt them.</p><br/><p>“He~~..sister Luo Luo,You don’t need to deceive me. His strength is only at the intermediate fighter level, he is just a garbage! How can this garbage be your boyfriend?” Seeing Ren Tian You was only at the level of an intermediate fighter, Tian Yun Guan said with a condescending look.</p><br/><p>“You….!?” Hearing Tian Yun Guan insulting Ren Tian You, Long Luo Luo became angry.Behind Lan Yan and company also frowned and stood up.</p><br/><p>At that time, Ren Tian You suddenly patted the hand of Long Luo Luo, and stepped towards Tian Yun Guan and said,</p><br/><p>“Hey, just a moment ago you said garbage, who spoke garbage?”</p><br/><p>“I spoke garbage.” Tian Yun Guan said without thinking.</p><br/><p>“Oh, right, indeed you spoke garbage.” He shrugged his shoulders with a look of disdain.</p><br/><p>“You are courting death!” Just now Tian Yun Guan discovered his mistake, and suddenly his face blackened.He approached Ren Tian You with murderous intentions.</p><br/><p>“Snort. Tian clan’s kid, don’t force me.” Seeing that Tian Yun Guan wanted to attack, Luo Tian Xing swiftly appeared in front of Tian You and forced Tian Yun Guan to stop.</p><br/><p>“Hey, you are quite bold to raise your hand here, do you believe it when I, say I can bury you forever in this town?”Li Feng said with a face full of contempt.</p><br/><p>“You…..you all.” Tian Yun Guan couldn’t believe what he was seeing, Luo Tian Xing and others were standing up to protect an intermediate fighter trash.</p><br/><p>“What I told you before still counts. I will not object, if you chase after my sister without using your despicable means and win her heart.But now my sister already has a person she likes, you better give up before going too far!” Long You interrupted Tian Yun Guan’s words.</p><br/><p>“Snort. Very good. Bloke, if you are a man then do you dare have a duel with me? Let’s see who is more suitable for Luo Luo.” Tian Yun Guan unwillingly looked at Ren Tian You and roared.</p><br/><p>“Brother Tian You, do not accept. He is already a Great Illusion Scholar.” Long Luo Luo said anxiously.</p><br/><p>“Correct, don’t accept it, Tian You. He has a class 4 blood lineage suitable for illusionist.” Luo Meng Wu also nervously persuaded Ren Tian You.</p><br/><p>“Don’t worry and rest assured. I don’t look down on this guy.” Ren Tian You carelessly said. In his heart he was thinking, “Playing with illusion in front of me, will be your downfall.”</p><br/><p>“But……” Long Luo Luo was still anxious.</p><br/><p>“Calm down, calm down. Have a little faith in me.” He comforted the beautiful little lady Long Luo Luo. Actually Ren tian You wanted to know more about the illusionist, and magicians of this different world.</p><br/><p>“Tian You, are you really sure about this……” Luo Tian Xing also was also not convinced.</p><br/><p>“He he, rest assured, honestly speaking I am not underestimating him. Do you really believe I am only intermediate fighter…?” Ren Tian you said with mysterious smile.</p><br/><p>“Well, in short, just be a bit more careful.” Luo tian Xing said.</p><br/><p>“Snort, dumb idiot. See how I will play with you.” he said with ferocious expression ,seeing that Ren Tian You had agreed to the duel.</p><br/><p>“Yeah ,sure.” Ren Tian You was not in the mood to play with this clown.</p><br/><p>Luo Tian Xing and other paid the bills and left the Heavenly Fragrance restaurant. They directly went to the duel field which was located at center of the town. Inside Eiffel town it was not allowed to engage in combat, so if anyone wanted to settle their score they had to go to the duel field. If a battle took place inside the town then, no matter the identity of the person, you would be punished.</p><br/><p>They arrived at dueling place, Ren Tian You and Tian Yun Guan jumped onto the arena. And the staffs also arrived there, and raised a barrier so that no one could interfere with the duel. But life and death duels were not allowed in this arena.</p><br/><p>“Ha ha, dumb idiot, you snatched my Long Luo Luo, so I’ll not let you die easily. I’ll let you despair before you die!” Seeing that the barrier of the arena was raised, Tian Yun Guan arrogantly roared towards Ren tian You.</p><br/><p>“Finished? If you have finished talking then let’s begin. I want to return back to eat.” Ren tian You used his finger to dig out his ear and spoke towards Tian Yun Guan with ridicule.</p><br/><p>“Snort, since you urgently want to die, then I’ll fulfill your wish.” After finished speaking, Tian Yun Guan took out a staff, and suddenly released his illusion power.</p><br/><p>“Illusion of blood lineage!” After Tian Yum Guan shouted, his body suddenly became a little illusionary, and it became harder to know whether it is real or not.</p><br/><p>“Interesting! I hope you will not disappoint me.” Seeing Tian Yun Guan, Ren Tian said to himself. And then he suddenly closed his eyes and when he had opened it again, his eyes had changed into blood red in color and it contained 3 spiraling curves. “Mangekyo Sharingan open!”</p><br/><p>“You…….” A look of surprise appeared when Tian Yun Guan saw Ren Tian You’s eyes. Just now he had merely seen those eyes but he felt like his consciousness almost sunk. He was so scared that he immediately turned away, and no longer dared to look at those eyes.</p><br/><p>“Use all the moves you have. I just so happen to want to look at your illusions. Don’t disappoint me.” Ren tian You causally said.</p><br/><p>“Brother, do you see the eyes of Tian You?” At the audience, Luo Meng Wu asked Luo Tian Xing.</p><br/><p>“Well, this should be his power of blood lineage. I didn’t expected, his blood lineage power was located in his eyes. Still it’s quite strange.” Luo Tian Xing looked surprised, but he was not in discomfort. Because Ren Tian You had controlled his power so that it would not affect the audience.</p><br/><p>“Damn, how dare you underestimate me? I’ll cut your body into 1000 pieces.” Tian Yun Guan was filled to the brim with anger and suddenly began to use his illusion to attack Ren tian You.</p><br/>\n</div>"}