{"title": "Chapter 21: Quicksand shower", "id": 21, "volume": 1, "url": "http://boxnovel.org/in-different-world-with-naruto-system-chapter-21-quicksand-shower", "volume_title": "Volume 1", "body": "<h1>Chapter 21: Quicksand shower</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 21: Quicksand shower</p><br/><p>“Truly a violent aura.” After thoroughly observing the burst of power of Luo Tian Xing, Ren Tian You who was standing behind, thought inside his heart. After releasing the power of his blood lineage, Luo Tian Xing had already thoroughly changed into a violent war god, and was completely filled with the aura of destruction, as if any defense before him would be broken into pieces. This power of blood lineage of Luo clan and the cultivating technique of battle qi, entirely abandon all the defense and completely maximize all the attack power of the user.</p><br/><p>At the same time, suddenly Ren Tian You sensed several special aura around him, Ren Tian You turned his head and saw that one after another the body of Long You, Lan Yan and Luo Meng Wu also emitted a powerful battle qi.</p><br/><p>“All heaven fire feather blood lineage, manifest!”</p><br/><p>“Gentle gale dance blood lineage, manifest!”</p><br/><p>“Azure cold ice blood lineage, manifest!”</p><br/><p>The battle qi around Long You was fiery red in color, and gave a kind of burning sensation. ‘It looks like, this boy Long You’s blood lineage had something to do with fire, and it is definitely not an ordinary blood lineage.’ The battle qi around Lan Yan was green in color, along with the appearance of this battle qi, Lan Yan gave a kind of lively and agile sensation. This was the rhythm of the wind. And the battle qi around Luo Meng Wu was not a violent battle qi like her brother, rather a kind of azure color and gave an ice cold aura. This blood lineage was one of the two major power of blood linage of Luo clan, Azure cold ice blood lineage. This Azure cold ice blood lineage a kind of blood lineage that was only inherited by the female member of Luo clan. This power of blood lineage was also extremely formidable. If this blood lineage was cultivated to the highest level, the user could instantly freeze anything, killing the opponents within her sight. The blood lineage of Long You and others were among the first rate blood lineage, but Azure cold ice blood lineage was a little bit lower compared to them.</p><br/><p>“Younger sister, you defend in front of magicians. Do not let those damn beasts to breakthrough. I will also stop them in the front.” Seeing Luo Tian Xing in the front, Lan Yan and others also immediately released their power, but didn’t act rashly rather they started to protect Lan Xin Meng and other magicians.</p><br/><p>“Ok.”</p><br/><p>“Good.”</p><br/><p>“No problem.”</p><br/><p>Behind them Lan Xin Meng and other also finished preparing. Lan Xin Meng was a wind system magic master, and Long Luo Luo was fire system great magic scholar. Li Feng who was Illusion master also finished getting ready, but currently Li Feng still lacked large scale illusion, as a result his role in this battle was very small.</p><br/><p>Luo Tian Xing who was holding a huge sword, alone blocked most of the wolves at the front. Occasionally few wolf slipped through him, but those were taken care by Long You. At that time the magic preparation of Long Luo Luo was completed.</p><br/><p>“Wild sea of flames.” Long Luo Luo shouted with her tender voice, and with the staff in her right hand she pointed towards the middle of the wolves. Suddenly in the midst of the wolves a boundless large flame started to burn. “Howl.” From the midst of the flame, a tragic howl of the wolves were heard, and hearing these tragic howl, Long Luo Luo couldn’t help but retreated few steps and was also a bit absent-minded.</p><br/><p>“Luo Luo, concentrate. Now is not the time to take pity upon these beasts. If you don’t kill them, we’ll all die.” At that time, suddenly the voice of Ren Tian You rang in the ears of Long Luo Luo. Absent-minded Long Luo Luo immediately woke up, turned her head and saw Ren Tian You was looking at them with an encouragement expression in his face.</p><br/><p>“I know what to do, big brother Tian You.” Long Luo Luo spoke with determination. After that she concentrate to maintain her magic.</p><br/><p>“8 thousands wind.” At this time, Lan Xin Men had also finished preparing her magic and along with her command, a huge powerful wind blew at the sea of flame of Long Luo Luo. Suddenly the wind assisted the flame, under the assist of Lan Xin Meng wind magic the range of sea of flame increased and became even wilder.</p><br/><p>Time passed, under the attack and defense of Luo Tian Xing and the others, next to them there were already countless corpse of the wolves, but the number of the wolves didn’t seem to reduce. After such a long period of time, they had already severely consumed their battle qi and magic power and they could no longer persist.</p><br/><p>“It seems, we’re going to die here today.” Seeing the number of wolves still not reduced, Lan Yan said with a calm face, as if he had nothing to do with it.</p><br/><p>“Ha ha, dying together with my good friends, I Luo Tian Xing don’t have any regret.” Still defending at the front, Luo Tian Xing who was already covered with blood spoke with a tired face, after hearing Lan Yan.</p><br/><p>“Correct.”</p><br/><p>“That’s right.”</p><br/><p>…………………….</p><br/><p>Seeing these friends who were directly confronting life and death battle without abandoning any one, a warm feeling appeared inside the heart of Ren Tian You. And he thought that for having such friends, he no longer had any regret in life.</p><br/><p>“This is my final attack. Beasts, look at uncle’s finishing blow! Heavenly star 2nd kill———–Divine chariot rush.” Luo Tian Xing roared loudly, waving his huge sword he jumped in the air, and just like the yellow meteor he landed in the middle of the groups of wolves and hit the ground with his huge sword. Then with Luo Tian Xing as the center, the yellow colored shockwave was spread all around him. This shock wave swept all the wolves around him and those wolves that were swept by this shockwave bleed from its 7 apertures and fell on the ground never to rise again.</p><br/><p>“Howl.” “Howl.” Taking advantage of the gap at moment when Luo Tian Xing had just finished releasing his big attack, countless wolves threw themselves towards Luo Tian Xing.</p><br/><p>“Big Brother.”</p><br/><p>“Tian Xing.”</p><br/><p>……………….</p><br/><p>Seeing this scene, suddenly Lan Yan and others cried out in alarm, their eyes were filled with desire to help, but their current level of power was not enough catch up to Luo Tian Xing in time.</p><br/><p>When Luo Tian Xing was already prepared to die, suddenly the sands floated in front of him and blocked all the attacks of wolves. Shortly afterwards these sands immediately surrounded the whole body of Luo Tian Xing, and in a full speed retreated towards Lan Yan and dropped at the side of Ren Tian You.</p><br/><p>“This is?” Luo Tian Xing and others looked at the sands on the ground and again looked at Ren Tian You. For a while they tried to think what had happened, but no answer came.</p><br/><p>“Well, you all take a break. Everything else leave it to me.” Ren Tian You looked at Luo Tian Xing and others who were staring blankly and said with a smile. All of them had passed this trail successfully. Now it is time to end this.</p><br/><p>“Tian You, you…………” Lan Yan still wanted to say something but Ren Tian You interrupted him.</p><br/><p>“Well, no need to say anything. Before I take care of these wolf cub, first I’ll send you to a safe location.” After talking he quickly formed a series of hand seals.</p><br/><p>“Doton—Chidokaku! (Earth Style—Mobile Core!)” Ren Tian You dropped his right hand on the ground, suddenly the ground began to shake violently, and Long Luo Luo and others’ feet became a bit unstable. Along with the violent shaking of the ground, the ground 30 meter around with Ren Tian You as a center started to raise. After raising about 10 meter, it stopped.</p><br/><p>“This…….” Seeing that the ground had raised, Lan Yan and others were completely stunned and didn’t know what to say.</p><br/><p>“You all stay here, I’ll be right back.” He jumped down after speaking. He had used this Earth element jutsu to raise the ground because after fighting these wolves for a long time, they had consumed serious amount of their battle qi and magic power. Although Ren Tian You had full confidence to defeat all these wolves pack, still he feared that due to little carelessness, he won’t be able to protect them. So to thoroughly make sure that they would be safe he had raised the whole ground.</p><br/><p>Ren Tian You steadily landed on the ground. Seeing the frenzied rush of the wolves, his two eyes gradually changed into Sharingan and a cold light also flashed in those eyes.</p><br/><p>Then he started to quickly form the series of hand seals. His speed of forming hand seals was so fast that others could only see shadows not he signs made.</p><br/><p>“Ninja art—Sand Tsunami!”</p><br/><p>Along with the dramatic surge of chakra, and unexpectedly on the ground in front of Ren Tian You appeared a spring. However water was not flowing inside that spring but sands. Endless sand turned into monstrous sand waves and all the wolves that were charging towards him were tossed away.</p><br/><p>“Howl.”</p><br/><p>“Howl.”</p><br/><p>…………………..</p><br/><p>Along with the terrified howl of the wolves, the leader wolf didn’t even get the chance to act and was completely submerged in sands wave.</p><br/><p>Monstrous waves, surging sands. A range of several miles radius was instantly submerged with endless sand and the surrounding landscape was also completely changed.</p><br/><p>“This…….” On the top of the earth stage, seeing this gorgeous scene, Luo tian Xing and the others were completely dumbfounded. Seeing the youth who had used this magic, their brain had short-circuited for a short period of time.</p><br/><p>Along with the ceasing of sands waves, Ren Tian You half squatted and suddenly inserted both his hands into the sands and started to release chakra at frightening speed. After that along with the invisible fluctuation the sands started to roll around.</p><br/><p>“Sabaku Taiso. (Giant Sand Burial.)” All the grounds around him shook violently.</p><br/><p>Ren Tian You slowly stood up, looked at his masterpiece, and nodded his head with satisfaction. After that he quickly formed a series of hand and the earth stage started to descend.</p><br/><p>Ren Tian You was thinking that he will receive the heroic reception, first rate beauty Long Luo Luo and other 2 beautiful ladies will come flying towards him and give him a kiss. But Luon Luo Luo and other 2 beautiful ladies didn’t came towards him, instead Luo Tian Xing rushed towards him with terrifying looks.</p><br/>\n</div>"}