{"title": "Chapter 22: Nature of Expert", "id": 22, "volume": 1, "url": "http://boxnovel.org/in-different-world-with-naruto-system-chapter-22-nature-of-expert", "volume_title": "Volume 1", "body": "<h1>Chapter 22: Nature of Expert</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 22: Nature of Expert</p><br/><p>“Tian You, you little ah. We were desperately fighting by risking our life to withstand the attack of these wolves. And you could have obviously disposed all of these wolves in a flash, but you were only watching us fight desperately, and only now you decided to use your power. Do you know, how I felt just before, in my heart I thought I was dead for sure.” Luo Tian Xing instantly rushed over, hold the collar of Ren Tian You and right in front of his face cursed. This caused saliva of Luo Tian Xing to fly toward the face of Ren Tian You.</p><br/><p>“Ah pei pei, you deadly sprinkling can, do you want to kill me? Did you ever brush your teeth ah, your mouth is so smelly. F**k, spiting all over I, your father’s face. *freed himself* eh.. Konoha Daisenpu. (Tree Leaf Great Whirlwind)” Ren Tian You cursed, and simultaneously freed himself from Luo Tian Xing’s claw. And seeing that Luo Tian Xing was still rushing towards him, Ren Tian You yelled and directly kicked him.</p><br/><p>Ren Tian You straighten out his disordered clothes. After seeing grief and indignation expression of Lan Yan and others, Ren Tian You cleared his throat and explained, “Don’t blame me, I did this for your own good. Don’t tell me you didn’t know, although your innate talent is very high and cultivate secret or higher level cultivation method, nevertheless you could display at most only 70% of your actual strength.”</p><br/><p>Along with the explanation of Ren Tian You, Lan Yan and others started to think. Seeing that his explanation had effect on them, he continued.</p><br/><p>“Compared to ordinary people, the cultivation condition is much higher for you. You all have best guidance from teacher from your childhood, have best cultivation method, have best skill books…………….and so on. These are all the things that normal people cannot get. Nevertheless if you want to become peak expert then you all are still lacking something, which is strong resolve to get along with blood baptism.”</p><br/><p>“Only those person who had truly faced life and death situations can evolve into a peak experts. Those people who had tempered themselves with the experience of countless life and death situation, can easily excel over those so called many geniuses, even if their strength is weaker than those geniuses. Because, they know exactly how to use their own power for their own advantage, and they also gasp their each and every move and attack of themselves whether it is big or small. This is the thing which is most important to become top expert.”</p><br/><p>“The person who had grown up in a completely protected environment, even if he have high innate talent will never become truly strong. Because such person will lack a strong resolve or heart. Truly strong person, regardless of any difficulties in front of him, never gives up and fight with that problem heads on. Also you should know that, the senior members of your families had clearly understand this issue. As a result even though they had sent elders to protect you all, they didn’t tell you about it. Because they wanted you to experience some hardships and temper yourself.”</p><br/><p>“Now you understand why I didn’t help you. This was the rare opportunity for experience and training. I believe that this life and death battle will play very important role for you all to become strong.”</p><br/><p>After finishing listening Ren Tian You, Luo Tian Xing and others lowered their head and thought for a long time. Afterwards, Luo Tian Xing raised his head and looked at Ren Tian You and spoke full of resolve, “Many thanks, Ren Tian You. Now I understand why my cultivation speed was decreasing, and also know what I should do from now on.”</p><br/><p>“Yes, Tian You, if not for your advice, I think we would have never known about our error till this day. And would have walked towards wrong direction.” Lan Yan also spoke with complex emotion.</p><br/><p>“Well, it’s still not too late for you guys, as long as you focus not only on cultivating but also train in battle experience. I believe you all will definitely become top experts.” With full of certainty, Ren Tian You said. Lan Yan and others innate talents were extremely high, blood lineage was also first rate, and the cultivation method of their family also certainly not bad, as a result their path of growth is already extraordinary.</p><br/><p>“Well, let’s not talk about these things anymore, it’s better to get away from here as soon as possible. The big move that I used just a moment ago is likely to attract the attention of some people with ulterior motives, so it’s better to get out from here.” Ren Tian You changed the topic, and told everyone to leave this place as soon as possible.</p><br/><p>“Tian You is correct. Everyone lets quickly leave this place.” Lan Yan also supported the decision of Ren Tian You. The big attack of Ren Tian You had changed the landscape around them within certain range, how can this not get any attention…..so it was better to leave before trouble arrive to them.”</p><br/><p>Ren Tian You and others immediately rod their horses and hastily depart from that place towards the direction of nearest town.</p><br/><p>Lan Yan and others were riding gale horses at high speed, probably because of the big attack of Ren Tian You, the wolves of this plains were staying away from them. All along the journey they didn’t encountered another groups of wolves. When it was evening, finally they saw Emperor Fei Lu country’s border town, Di Lu city!</p><br/><p>Di Lu city is the Emperor Fei Lu country’s west border fortress, and is also the west gateway of Emperor Fei Lu country, also it was not necessary to mention that this town was also located in the strategic location. Ren Tian You and others quickly entered this city, unexpectedly this border fortress also possessed Heavenly fragrance restaurant. This clearly shows how strong the background power of this restaurant was. All of them entered this restaurant and directly went to their destination. That was bathing space. After having life and death battle with the pack of wolves and hastily running, they were all sticky with sweat and at the same time uncomfortable, as a result their first choice was to take a bath.</p><br/><p>After comfortably bathing with hot water, Ren Tian You arrived at the 3rd floor of the restaurant, he saw that Li Feng was already there and was waiting for others with table full of delicacies.</p><br/><p>“Whew, really comfortable. Just a moment ago it was really uncomfortable because my body was dirty!” Li Feng wiped his wet hair and talked to himself. “That’s enough. Come on you can’t even endure this little hardship ah. You don’t have enough endurance. I think you should start practicing to endure some hardship.” Hearing the complaint of Li Feng, Ren Tian You joked. “Ah, Is it?” Hearing Ren Tian You, Li Feng face fell, and a miserable expression appeared. “He he, I already said, the top experts are not made overnight. After going through many experience and training, only then they grew into top expert. As a result if we want to become top expert we should face many life threatening experiences and take one step at a time.” To be honest, among all these people, the strength of Li Feng was the weakest, merely great illusionist scholar. This was not because his innate talent was low, but because of his nature. The nature of Li Feng was little bit casual and too fond to play, using the terms of the Earth, you could say he had a little bit of childish nature of rich kid. So among all them, Ren Tian You had least confidence on Li Feng.</p><br/><p>“I know what to do, Tian You! Thank you!” A firm light flashed in the eyes of Li Feng and he thanked to Ren Tian You. At that time Luo Tian Xing and others also arrived there after washing themselves. Ren tian You greeted everyone and started eating. Seeing the foods that were in front of Ren Tian You on the table disappeared quickly, the serving peoples were completely dumbstruck and staring at him with silly expression. After Ren Tian You and others returned to their respective room to rest, those servants could only thought ‘from where did this starved devil came from.’</p><br/>\n</div>"}