{"title": "Chapter 25: To eat one’s own fruit", "id": 25, "volume": 1, "url": "http://boxnovel.org/in-different-world-with-naruto-system-chapter-25-to-eat-one%E2%80%99s-own-fruit", "volume_title": "Volume 1", "body": "<h1>Chapter 25: To eat one’s own fruit</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 25: To eat one’s own fruit (T.L: idiom – suffering the consequences of one’s own action)</p><br/><p>RenTian You was very happy to see the electric currents appear around his body, this meant, he had finally mastered lightning nature change. Now he could use many other jutsu, such as ChidoriNagashi(Chidori Stream), if enemies is near his body, then this will make enemy wish he was dead! In original Naruto world, Sasuke had used this jutsu for the 1st time whenNaruto and Sai had caught him. Even Naruto who was the host (jinchuuriki) of 9 tailed beast with abnormal physique was unable to resist against this jutsu! Furthermore there are still ChidoriSenbonI and ChidoriEiso (Chidori Laser Spear) ninjutsus, even to the extent of lighting style—Kirin! Now he had the ability to learn all these ninjutsus. And what’s more is, he himself could also create his own original lightning attributeninjutsu.</p><br/><p>In Naruto world, which famous ninja didn’t have their own original ninjutsu! For example, Yellow flash of Kohona created Hiraishin — Ni no Dan (Flying god thunder jutsu level 2) as well as rasengan, which didn’t need any hand seals. And Kakashihad also created his own original jutsu, Chidori! And based on this Chidorijutsu, Sasuke had created Chidori Stream, Chidorisenbon and ChidoriEiso. After that he finally created lightning style—Kirin ninjutsu! Even this stupid Naruto had created his own original ninjutsu, most of them were based on rasengan, and finally developed a first class wind style—rasenshuriken.</p><br/><p>As a result, if RenTian You wanted to walk farther, then he must create his own original ninjutsu. It was necessary, because the ninjutsuwhich is created by himself,not only will be more suitable for him, but also help him to more clearly understand the meaning of ninjutsu.But these things were still far away for current RenTian You, because he hadn’t reached shadow (kage) level,he was only elite senior ninja. So he had decided to create his own original ninjutsu after he reach kage level.</p><br/><p>At this time, he was still calm and very happy, however all the other guests who were staying in Heavenly fragrance restaurant were about to explode with fury! It was very early in the morning, each and every one who were having their beauty sleep, or were having their breakfast pleasantly. Suddenly this string of ear-piercing cry of the birds, causedthose who were having a beautiful dream, were suddenly startled to awake from their beautiful dream, where they were talking with a beautiful woman, suddenly the homerun ball hit them.And the reason for all of this was the cry of birds, how could anyone not get angry to be awaken harshly like that when they were having such comfortable dream.Each and every one wore their clothes and came out from their room with a murderous expression, and all of them wanted to look which grandson dared to disturb their dream. And they were thinking to catch him and making him kneel down without letting him escape. Those who were having breakfast pleasantly, when they were slowly savoring the fine wine, the sudden ear-piercing birds cry frightened them so much that they sprinkled all of the wine in their face and some had directly gulped down whole wine in a single breath. Immediately anger soared and they started to stand one by one.</p><br/><p>At this time when all the other were about to explode with anger, RenTian You was deeply thinking about developing original ninjutsu. Suddenly he heard the noises coming from outside his room and wondered what was going on outside! He got up from the bed, opened the door and walked out from his room! He only wanted to look what was going on, but he was completely startled. Because he saw that countless disheveled guests were grabbing those servants of Heavenly fragrance restaurant and asking them questions. He approached one of them and listened, instantly after listening he was completely drenched in cold sweat.</p><br/><p>“You give I, your father a clear explanation, where did the sound of that bird cry came from inside this restaurant in this early morning and disturbed my dream.”</p><br/><p>“I, your father was having a sweet dream, where I was talking with a fine woman, and was just prepared to mount her, these cry of the birds awoke me from my dream. Now you say, how are you going to compensate my loss!”</p><br/><p>“Yes, that’s right. Just let me know who the one behind this was. I must make the experts of my clan to chase and kill him.”</p><br/><p>………………..</p><br/><p>Listening to these roars of other tenants, his sweat was already falling like waterfall. It seem the bird cry they were talking about was his Chidori stream.He rubbed the sweat in his forehead, and again looked at those tenants with the expression likethey wanted to explode his chrysanthemum. Suddenly he sensed that his chrysanthemum tightened, he started to tremble and slowly retreated several steps!</p><br/><p>“Good gracious, fortunately I used Chidori stream only once, and because the sound travelled very quickly, theywere unable to point out where it was originated from, otherwise………………..” He simply didn’t dared to think any more about what these people had done him otherwise.</p><br/><p>“Everyone, we are extremely sorry. We have already sent someone to investigate the source of birds cry. And concerning to everyone’s loss, we Heavenly fragrance restaurant feel extremely sorry. In order to compensate everyone, today all the guest can consume foods for free in the morning!” At this time a middle aged beautiful dame walked out from the rear of restaurant’s yard and apologized towards all the guests. But inside her heart she was violently cursing, “Don’t let I, your old mother to know who caused trouble at my Heavenly Fragrance restaurant, otherwise I will definitely not forgive you for actually causing such a huge loss for us.”</p><br/><p>You should know that by giving free foods in the morning, the restaurant will lose the revenue of at least 100,000 gold coins. The cost of accommodation was very cheap in this restaurant, so all the crucial income was generated from food and drinks! Now think about it, how can this dame not hate the person who had cause such a huge loss?</p><br/><p>RenTian You was completely in awkward situation, when he heard the voice of Long You from his back, “Tian You, you were also woke up!”</p><br/><p>RenTian You turned back and saw, Long You and others were coming towards him. Long LuoLuo and other 2 beautiful girls were clearly half asleep, as they had a sleepy expression on their face!</p><br/><p>“Un-huh, Yes!” With no other choice he was forced to agree with them.</p><br/><p>“Ai, I don’t know which grandson dared to made such a huge ruckus very early in the morning while everyone is sleeping!” Li Feng cursed.</p><br/><p>“Yes that’s right. Don’t let me catch that grandson, otherwise I will let him taste our Luo clan’s stars braking hand.” LuoTian Xing clenched his hand and said.</p><br/><p>“Hump,if that grandchild is a male then sell him as a slave and if female then, hehheh, you all understand right!” Lan Yan said with a smile.</p><br/><p>“Hump, look at your filthy appearance. If that troublemaker happens to be male and I got him in my hand, then I will directly kick him in his balls and castrate him!” Long LuoLuosaid disdainfully. This sentence cause all the male present there, to sense chill on their back.</p><br/><p>As they were talking, they didn’t notice that the expression of RenTian You was getting darker and darker and thought, “F**k, I, your father. This is like getting shot even when lying down (idiom), ah!” He couldn’t even refute the cursing of LuoTian Xing and others, but was also forced to listen. And especially that sentence of Long LuoLuo, caused RenTian You to suddenly sense a slight chill in his crotch.</p><br/><p>“F**k, I, your father will tolerate for now. Look forward to next time, how I will make you all suffer.” RenTian You roared unhappily inside his heart.</p><br/><p>“Eh,Tian You, the color of your face looks so bad, is there a problem!” LuoTian Xing noticed the face of RenTian You and asked curiously.</p><br/><p>“Ah, probably because I didn’t get enough sleep!”</p><br/><p>“Hmm,soyou were also awoken by that grandchild’s birds cry, and couldn’t sleep well.” Lan Yan said.</p><br/><p>“Ah,this………..that? Should be it!” RenTian You was tongue-tied, and black lines started to appear in his forehead and said slowly. But inside his heart he was slapping his mouth and was roaring, “You despicable mouth saying I didn’t sleep well, now I gave them to curse myself.”</p><br/><p>“Well, since we already woke up. Lets go and eat breakfast!” LuoTian Xing invited everyone for a breakfast.</p><br/><p>“Ah, that’s right. Everyone is already here so lets go to eat breakfast.I’m starving.”RenTian You quickly said. RenTian You couldn’t help but urge them to go for a breakfast.</p><br/>\n</div>"}