{"title": "Chapter 40: The waves of the world", "id": 40, "volume": 1, "url": "http://boxnovel.org/in-different-world-with-naruto-system-chapter-40-the-waves-of-the-world", "volume_title": "Volume 1", "body": "<h1>Chapter 40: The waves of the world</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 40: The waves of the world</p><br/><p>Along with the shout of Wang Hai Qing, a powerful tornado column appeared at the place where Wang Hai Qing had disappeared. And this powerful tornado was advancing towards Yan Xin Luo at a very high speed.</p><br/><p>“This fellow actually forced Wang Hai Qing to use Wind spirit 1000 sword dance. It seems like, the strength of this fellow is pretty good. Now I am looking forward to see the strength of another one too!” Seeing the tornado, a flash of surprise appeared in the face of Yun Lei Xiao, then he turned his head towards the direction of Ren Tian You, and muttered to himself.</p><br/><p>Even after seeing the rapidly approaching tornado, Yan Xin Luo was completely calm. Due to this powerful wind, his hair was fluttering in the air, but only after the tornado arrived near him, did he made his move.</p><br/><p>Suddenly the a strong radiance of grey colored battle qi increased sharply, and gradually turned into a towering grey light which surrounded the body of Yan Xin Luo. This sudden increase of the strength cause the stones beneath Yan Xin Luo to disintegrate and turn into fine powders. At this time, Yan Xin Luo pull out the short sword in his right hand, and threw in the air in front of him. Then the gray colored battle qi was poured into that short sword. After that, the short sword was completely surrounded by grey battle qi.</p><br/><p>Just now Yan Xin Luo had released the strong battle qi and assimilated his battle qi with his short sword. Then he took a step with his right leg, and along with the light beam of grey battle qi, he charged towards the short sword in the air. Shortly afterwards Yan Xin Luo came in contact with the short sword, then the gray colored light beam soared towards the sky from the short sword. From this it was clear that, a powerful undead battle qi was gathered at this short sword.</p><br/><p>“Dance of death, first verse——undead cut open the sky!”</p><br/><p>Along with the voice of Yan Xin Luo, this huge light beam of short sword advance towards the approaching tornado.</p><br/><p>“Hong long long!” Along with the series of explosion, the powerful light beam of the short sword cut open the Wind spirit 1000 sword dance of Wang Hai Qing like a hot knife cutting through the butter. Then the tornado also gradually became thinner and finally dissipated. And Wang Hai Qing who was in the midst of Wind spirit 1000 sword dance flew out while spitting out a stream of mouthful of bloods and heavily fell on the ground outside the arena.</p><br/><p>When the light beam from the sword disappeared, Yan Xin Luo appeared at the arena while holding the short sword. It took less than 5 minutes to complete the battle, and from the beginning they used only 3 moves and the match was over. But the blood of the students who were watching the battle were boiling with excitement. In this match Wang Hai Qing had taken the initiative to attack and furthermore he had used 2 high level attacks, but he was unable to change his fate of losing. It’s not like Wang Hai Qing was weak, rather Yan Xin Luo was far more powerful than Wang Hai Qing. From viewpoint of Ren Tian You, he felt that the last attack of Yan Xin Luo was at least equal or stronger than the attack of that mysterious girl.</p><br/><p>“Match over, Yan Xin Luo wins.” Yun Lei Xiao stood up and declared the result. After that he walked towards the side of arena and check the condition of fainted Wang Hai Qing. He discovered that there was not any serious injuries. After that, he placed Wang Hai Qing near the stool where he was sitting. Then he went near the arena and took out an earth colored stone and placed it into the groove of the arena. Suddenly the arena started to release the yellow colored radiance, and earth system magical power started to emerge. After the yellow colored radiance disappeared, the original damaged arena was already revert back to the original undamaged state.</p><br/><p>This was the repair magic of earth system. It can revert back all the damage which was caused within a day. But it requires to place repair magic formation beforehand. And only this arena had the repair magic formation in this training ground.</p><br/><p>“Well, restoration of the arena is complete. Carry on the next match.” After seeing that the arena was repaired, Yun Lei Xiao announced the start of next match.</p><br/><p>After hearing the announcement of Yun Lei Xiao, Ren Tian You and that girl named Sun Chu Qian walked on to the arena and stand opposite to each other.</p><br/><p>“Match begin.” Without wasting any time, Yun Lei Xiao immediately announced the start of the match.</p><br/><p>Along with the announcement of Yun Lei Xiao, Sun Chu Qian extended her right hand. Then a light flashed from the blue colored ring on her right hand, after that a slender rapier appeared in the right hand of Sun Chu Qian. Along with the appearance of that rapier, a blue colored battle qi sprang out from the body of Sun Chu Qian. From this battle qi, Ren Tian You could sense a moisture of water, this was gentle water battle qi.</p><br/><p>“Sea spirit blood lineage———–now!” When Ren Tian You heard the charming voice of Sun Chu Qian, he felt like he heard the billows of the oceans.</p><br/><p>“Make your move.” Firmly staring at Ren Tian You, Sun Chu Qian spoke.</p><br/><p>“In that case, I won’t be polite.” Ren Tian You carelessly smiled and didn’t declined the offer. Heavily stepping on the ground, Ren Tian You suddenly turned into a blur and appeared in front of Sun Chu Qian. And then heavily kicked her.</p><br/><p>“Konoha Goriki Senpuu!” (Severe Leaf Hurricane!)</p><br/><p>“Peng!” The body of Sun Chu Qian flew in the air. But after flying 3 or 4 meter, she balanced herself in the air and landed on the ground. And then, she looked at Ren Tian You with a surprise expression.</p><br/><p>At this time, Ren Tian You was just withdrawing back his right leg. Seeing that Sun Chu Qian had firmly stabilized her body, Ren Tian You smiled and said, “What is it like, beauty? Seeing that I am only an intermediate fighter on the surface, do not underestimate me. Otherwise the consequences will be very serious.”</p><br/><p>“This kid truly is sinister. I don’t know what alchemy item he is using, even I couldn’t see his true cultivation level. I was thinking how was it possible that an intermediate fighter level kid is assign to the special class? Now I can’t guess whether Chu Qian with Sword master level could defeat him or not!” Seeing the very fast speed and powerful kick of Ren Tian You, Yun Lei Xian quickly revalued the strength of Ren Tian You inside his heart.</p><br/><p>……………….</p><br/><p>“Humph!” Hearing somewhat mocking words of Ren Tian You, Sun Chu Qian coldly snorted, then the battle qi surrounding her body suddenly rose sharply and held her rapier in front of herself.</p><br/><p>“Sea spirit 1st of 3 waves——–Sky dividing sea wave!” Along with the voice of Sun Chu Qian, energy suddenly sprang out from the body of Sun Chu Qian. And all the gentle water battle qi started to accumulate at that rapier. And that rapier suddenly started to emit the blue colored radiance.</p><br/><p>Seeing that Sun Cu Qian was in the midst of preparing her big move, Ren Tian You was surprised. Because he saw that a image of sea whirlpool had appeared behind her.</p><br/><p>At this time, Sun Chu Qian had already completed the preparation of her big move. She slashed her rapier which she was holding on her right hand in front of her body, towards the direction of Ren Tian You. Suddenly the light of rapier slash separated from the rapier and advanced towards the direction of Ren Tian You. And unexpectedly that sword slash quickly absorbed the moister of the atmosphere, and quickly changed into 4 or 5 meter big sea wave. And with an imposing manner advanced towards Ren Tian You in a very high speed. [T.L: something like flying slash of the sword.]</p><br/><p>“Now its too late to open Hachimon Tonkou (The Eight Inner Gates). Forget about it! After learning nature change of lightning element chakra, I haven’t use it in a battle. So its better to try it now.” Seeing the rapidly approaching attack, his eyes flashed with a peculiar light and suddenly a strong lightning system chakra appeared around his body. And they gradually formed a protective chakra membrane. All the hair of Ren Tian You was standing erect and he had bent the thumb and small finger of his right hand. At this moment Sky dividing sea wave attack of Sun Chu Qian finally arrived before Ren Tian You. Ren Tian You immediately turned into lightning blur, and right hand pointing straight forward, just like a lightning spear, directly rushed towards the big wave of sword qi. [T.L: I don’t know whether I was able to describe properly or not; here our MC is using ‘Hell Stab Three-Finger Spear Hand’ of 3rd raikage]</p><br/>\n</div>"}