{"title": "Chapter 57: Ranking Competition (6)", "id": 57, "volume": 1, "url": "http://boxnovel.org/in-different-world-with-naruto-system-chapter-57-ranking-competition-6", "volume_title": "Volume 1", "body": "<h1>Chapter 57: Ranking Competition (6)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 57: Ranking Competition (part 6)</p><br/><p>Ren Tianyou caught the identity plate which was tossed to him by the judge, then he placed it inside his ninja backpack, after that he turned around and stepped down from the arena. At the moment when he arrived at the location where the students of his class were gathering, all of them immediately surrounded him.</p><br/><p>“Tianyou, well done.”</p><br/><p>“Ha ha, truly awesome ah Tianyou, getting 1st win for our class.”</p><br/><p>…………………</p><br/><p>“He he, thanks a lot, everyone.” Felling everyone’s warm affections, Ren Tianyou feel extremely good inside his heart. Then he turned around towards Wang Jiafei and said, “Teacher, how was that, I didn’t disappointed you, right!”</p><br/><p>“Humph, you only advanced to quarter finals, nothing more. Come to me only after you became champion.” Wang Jiafei said in disdain. However the smile on her face betrayed her sentences and made her true feeling in her heart to be clear.</p><br/><p>“Rest assured, I will definitely bring you the championship.” Ren Tianyou patted his chest, and promised Wang Jiafei with a heroic spirit.</p><br/><p>“Humph, you will definitely get championship. I will see how you will seize the champion position from me.”</p><br/><p>Just when Ren Tianyou had finished promising Wang Jiafei, he heard the cold snort full of disdain.</p><br/><p>After hearing these sentence, the complexion of Ren Tianyou and others became extremely unsightly. They turned around to look at the direction where that voice was coming from, and to look at the person who couldn’t tell good from bad and dared to mock Ren Tianyou.</p><br/><p>They saw a man of 17 or 18 years old wearing a white colored illusionist robe who was standing at the side. And that person was staring at Ren Tianyou and others with an eyes full of disdain.</p><br/><p>“What are you talking about? Can you say it again?” Before Ren Tianyou could speak, Wang Haiqing angrily stared at that man and said.</p><br/><p>“I said you all are just a bunch of garbage. And you dared to dream about taking the championship from my hand, simply wishful thinking.” Hearing Wang Haiqian question, this man replied slowly.</p><br/><p>“You are courting death.” Hearing this guy, in a flash the complexion of all the students became even more unsightly. Getting extremely angry, Wang Haiqing pulled out his sword and was about to dash towards that man, but someone had immediately pull him back.</p><br/><p>Wang Haiqing turned around his head only to see that the person who had pull him from behind was Wang Jiafei. “Teacher, why did you stopped me, let me teach him a good lesson.”</p><br/><p>“You are no match for him, this is the person that we spoke about just a moment ago. Member of illusory shrine, Zhou Guangsheng.” Wang Jiafei seriously said towards Wang Haiqing.</p><br/><p>“What? He is Zhou Guangsheng.” Wang Haiqing was greatly surprised. He had never thought that he would actually meet this fellow this fast.</p><br/><p>“Humph, so you know I am member of illusory shrine. As soon as you wanted to attack me, you were courting dead.” Hearing Wang Jiafei’s explanation, he didn’t deny his identity, rather he stared at Wang Haiqing with the murderous eyes, and directly used his illusion power to pressure Wang Haiqing.</p><br/><p>“You…………….” Seeing Zhou Guangsheng was about attack, Wang Haiqing immediately became nervous and cold sweat started to appear in his forehead. Because he knew that he was not the opponent of Zhou Guangsheng.</p><br/><p>“Swish!” Wang Haiqing suddenly saw Ren Tianyou appeared before him. Then all the pressure on his body was gone without a trace.</p><br/><p>“Just try and attack me, I don’t mind battling you here before the actual match.” Ren Tianyou firmly stood on front of Wang Haiqing and stared at Zhou Guangsheng. Then his eyes changed into Mangekyo Sharingan.</p><br/><p>“You…………..” Hearing Ren Tianyou, Zhuo Guangsheng wanted to refute, however seeing those strange blood red colored eyes, he don’t know why but his mind suddenly shook and unconsciously fell into a trance. He was so afraid that he hastily turned away his eyes from those frightening blood red eyes and no longer dared to stare at those red eyes.</p><br/><p>“Humph, I will forgive for you now. But in the match, I will definitely entertain you with my illusion.” Zhuo Guangsheng left the malicious remark, then he turned around and left.</p><br/><p>“Tianyou, how are you going to deal with that guy, you should know he is the member of illusory shrine. And illusions are quite unpredictable, also no one knows what kind of strange illusion skill he possess in the end.” Seeing Zhuo Guangsheng had already left, Sun Chuqian was bit worried, so he asked Ren Tianyou.</p><br/><p>“Yes, Tianyou, the illusion of illusionist master in itself is strange. Even if elite warriors and the weak illusionist master are compared, the sprit power of illusionist is higher than warrior. As a result you can say illusionist are bane for us warriors. Because we warriors are not like Magician and illusionist who purely focuses on rising the spirit powers.” Wang Jiafei also worriedly said to Ren Tianyou.</p><br/><p>“He he, all of you, be at ease. Only using his illusion skills, he won’t be able to deal with me. Honestly speaking, the thing I am most fearless against is illusion.” Ren Tianyou laughed and said carelessly. No kidding, with Mangekyo Sharingan, why should he afraid against illusion skills.</p><br/><p>Although he said this, nevertheless he estimate that the power level of that fellow’s illusion should be comparable to his own or a bit higher with the exception of doujutsu of Ren Tianyou. After all Ren Tianyou had focused to train for all round development of ninjutsu, taijutsu and genjutsu. Because he possessed naruto system for more than 2 years, and he possessed Sharingan, he didn’t focused much to learn illusion only, rather he mostly focused to learn ninjutsu and taijutsu.</p><br/><p>Although the character of Zhuo Guangsheng was not that good, but with regards to his strength, Ren Tianyou also admire him a bit, as at this young age he had already cultivated to the peak- great illusionist master level. Through his dedication to illusion for more than 10 years, coupled with the illusory shrine’ secret manual of infinite illusion skills, it was impossible for his illusion skill to be bad.</p><br/><p>After a period of observation, Ren Tianyou had discovered that the illusion skill of this world, although a bit different with the naruto world, but was also bit similar. So Ren Tianyou was not afraid of him.</p><br/><p>“In any case, Tianyou, be more careful. But there is also the chance that you would not encounter him. If he had bad luck and encountered Wang Yanli, then it is unlikely for you to encounter him, as he is unlikely the match of Wang Yanli.” Sun Chuqian sighed loudly.</p><br/><p>“He he, be at ease, you all don’t need to worry about me.” Ren Tianyou said to others and he turned his head and stared towards the magic screen of the square.</p><br/><p>After several earth system magician used their magic, they successfully restored the arena which was heavily destroyed from the match of Ren Tianyou. Now the 2nd the second match was about to begin, so the magic screen was quickly flashing with the names of the participants.</p><br/><p>“Ding!” Along with the sound, the 2 names appeared on the magic screen. Seeing these 2 names, the corner of the Ren Tianyou’s mouth slightly rose. “He he, truly interesting. Is this for real? It looks like we shouldn’t miss this match.”</p><br/><p>“However, Chuqian, your mouth is quite effective. It’s happening just like you said.” Ren Tianyou looked at Sun Chuqian, and the corner of his mouth slightly twitched several times.</p><br/><p>“Eh, I also didn’t think this would be the result.” Seeing the two names appeared on the screen, Sun Chuqian had the urge to laugh.</p><br/>\n</div>"}