{"title": "Chapter 58: Ranking competition (7)", "id": 58, "volume": 1, "url": "http://boxnovel.org/in-different-world-with-naruto-system-chapter-58-ranking-competition-7", "volume_title": "Volume 1", "body": "<h1>Chapter 58: Ranking competition (7)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 58: Ranking competition (Part 7: Illusion country)</p><br/><p>In the huge magical screen, Zhou Guangsheng VS Wang Yanli was written. Ren Tianyou and others had never thought that the mouth of Sun Chuqian was unexpectedly this effective. Just now she had cursed at Zhou Guangsheng to encounter Wang Yanli in the match, and in a flash her curse was realized.</p><br/><p>“Ha ha, now I will see how this wicked guy will handle this.” Seeing the participants’ name of the next match in the huge screen, Wang Haiqing laughed and vented out his depression of just a moment ago.</p><br/><p>“He he, look carefully, we shouldn’t miss this match.” Ren Tianyou laughed, then he no longer spoke. Then he seriously started to watch the match.</p><br/><p>…………</p><br/><p>“F**k, that damned woman, unexpectedly had such poisonous mouth, don’t let me meet you again, or else …..” Seeing the names on the screen, Zhou Guangsheng felt pain in the ass. With regards to Wang Yanli, Zhou Guangsheng had gotten the information on him. So he was feeling a huge pressure from this next match, and inside his heart he was not certain that he was capable enough to win against Wang Yanli. Because his illusion skills were not that effective against magicians compared to warriors. And the effect was even lower against top level magicians like Wang Yanli.</p><br/><p>However he had no other choice, since it was already his turn, even if he don’t have 100% confidence to win for sure, he should fight in this match. Because he had spoken that he would win the competition, it was impossible for him to give up the match now. And Wang Yanli was already standing at the arena waiting for him. Wang Yanli was wearing a fiery red colored fire system magic robe, and he was holding a fiery red colored magic wand in his hand. And at the top of that magic wand, there was 3 fiery red colored huge magic stones.</p><br/><p>Along with the appearance of Wang Yanli, the eyes of all the female audiences changed into something similar to peach shaped eyes. Even the eyes of valiant teacher Wang Jiafei, started to become peach blossom color. It was so because this fellow was excessively handsome, so handsome that even Ren Tianyou himself was a bit jealous inside his heart. [T.L: I think, peach shaped eyes===heart shaped eyes]</p><br/><p>This fellow had smooth and fair face, and that face reveled a grave and stern atmosphere. Enchanting pitch-black eyes, that thick eyebrows, straight nose, and with that slightly raise corner of the mouth. He clearly looked noble and elegant.</p><br/><p>Some male students in the audience, seeing their own girlfriends staring at Wang Yanli at the arena with love-struck fool face, were grinding their teeth with hate. They all wanted to rush at the arena and beat the crap out of Wang Yanli, but these miserable fellow already knows that they were no match against him.</p><br/><p>Zhou Guangsheng stepped up on the arena, then he tossed his identity plate towards the judge. Then he waved his right hand, a transparent white colored magic crystal ball appeared at his right hand. This was the illusion power source equipment of the illusionist.</p><br/><p>Along with the announcement of judge to start the match, Wang Yanli spoke towards Zhou Guangsheng, “You better give up now.”</p><br/><p>“Humph, although you are a member of magic domain, but I am also the member of illusory shrine. Don’t think you can easily defeat me.” Hearing Wang Yanli, suddenly the face of Zhou Guangsheng became extremely unsightly, then he said coldly.</p><br/><p>“He he, I am saying, without wasting any time give up now, otherwise you may not get any chance later.” Hearing Zhou Guangsheng, Wang Yanli was not angry, still same as before gave the advice to give up.</p><br/><p>“You………….” Hearing those indifference words, Zhou Guangsheng was so angry that he didn’t know what to say. Shortly afterwards he just grinded is teeth, and with full of hate inside his heart he thought, “Fine, since you want me to give up, I will show you my true strength and let you know the price of looking down upon me.”</p><br/><p>“Illusion blood lineage, manifest!” Along with the shout of Zhou Guangsheng, suddenly a purple black colored illusion aura sprang out from his body and tightly surrounded him. Due to this illusion aura, everyone experienced that their thought was involuntarily attracted towards the illusion aura. And they remembered the matter that they didn’t want to remember the most.</p><br/><p>“Wang Yanli, I want you to pay the price for looking down upon me. Domain of blood lineage——illusion country.” The figure of Zhou Guangsheng was surrounded by the illusion aura and couldn’t be seen. Only the cold voice came out from the illusion aura, shortly afterwards that purple black colored illusion aura originally surrounding him, immediately spread all around the arena very quickly. Immediately all above the arena changed into purple black colored illusion domain.</p><br/><p>Domain of blood lineage——illusion country, is the combination between his rank 1 blood lineage and advance illusion skill of Illusory shrine, coupled with the advice of the seniors of Illusory shrine, this exclusive to Zhou Guangsheng special blood lineage illusion skill was created.</p><br/><p>The main principle of this illusion skill was to refine and turn his peculiar magic of blood lineage into an illusion aura in a special way, then spread it in all direction. And all the area within this illusion aura is illusion domain. But this domain is not like the domain of God class experts which is created by combining the power of heaven and earth. So this illusion domain can only be counted as pseudo-domain, but even like this this domain is quite awesome. Because within this domain, everyone would receive the endless illusion attack, and could easily confuse their state of mind. And once enemy is within the domain, Zhou Guangsheng would get a big advantage against the enemy.</p><br/><p>Once everyone in the audience saw that Wang Yanli was within the domain of Zhou Guangsheng, everyone was quite taken aback, as no one had expected this result. Nevertheless now the arena was completely surrounded by this purple black colored illusion fog, no one was able to see clearly what was happening inside the arena.</p><br/><p>Seeing the move of Zhou Guangsheng, Ren Tianyou was greatly surprised inside his heart. Seeing that the arena was completely filled with illusion fog, he firmly creased his brows, “My Sharingan do not have see through ability. Don’t tell me there is no way to observe the situation in the arena?”</p><br/><p>“Oh, that’s right!” At this time Ren Tianyou suddenly thought about something, then in a flash, his eyes shone brightly. Shortly afterwards he immediately opened Sharingan, as expected he could clearly see the situation on the arena.</p><br/><p>As a matter fact, Ren Tianyou had suddenly thought, since this purple black colored illusion fog which was spread all over the place was power of illusion, then this illusion fog itself should also be illusion power. So he thought maybe his Sharingan which have the ability to see through all kinds of illusion, is capable to see through this fog. As expected, after he opened Sharingan, he confirmed his guess, not only he see through this illusion fog, also all the image of the illusions of the thick fog also entered inside the mind of Ren Tianyou.</p><br/><p>“I never expected the illusion skills of this fellow was actually this high. I don’t know what Wang Yanli will do now?” After seeing the image of the illusions, Ren Tianyou have no choice but to sigh with feelings. He discovered that Wang Yanli was still standing at the original place without any motion, but his eyes were flashing with the trace of confusion. That should be the effect of the illusion of Zhou Guangsheng. After seeing all this, Ren Tianyou was wondering what would happen next.</p><br/><p>“Eh, Tianyou, what are you laughing at?” At this time, Sun Chuqian saw the eyes of Ren Tianyou was blood red in color and he was staring at the arena. And he also had a smile on his face, so she asked curiously.</p><br/><p>“I, I am watching the fight.”</p><br/><p>“What! You can actually see the fight. Don’t tell me your eyes have see through ability.” After hearing that Ren Tianyou could see the fight in the arena which was filled with fog, Sun Chuqian couldn’t help but cried out in alarm. Then it seemed like she thought about something, then her facial complexion immediately became extremely unsightly. Although she knew that the blood red eyes was the blood lineage of Ren Tianyou, but she didn’t know the specific abilities of that eyes.</p><br/><p>Seeing the abrupt change in the complexion of Sun Chuqian, Ren Tianyou moved his eyes towards the body of Sun Chuqian, as if checking out something. Then with a lewd smile in his face he said, “Hei hei, yeah, uh, I have no choice but to say, Chuqian, your figure is extremely fine, zeze.” [TL: zeze: pinyin of clicking ones tongue. In English what is it called?]</p><br/><p>Hearing Ren Tiayou, Sun Chuqian face become even redder, however he didn’t notice that behind that red face, her complexion was becoming even more unsightly.</p><br/>\n</div>"}