{"title": "Chapter 74: Semi-finals (5)", "id": 74, "volume": 1, "url": "http://boxnovel.org/in-different-world-with-naruto-system-chapter-74-semi-finals-5", "volume_title": "Volume 1", "body": "<h1>Chapter 74: Semi-finals (5)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 74: Semi-finals (Part 5)</p><br/><p>Without any break, he hit for 30 seconds, then he withdrew his still blazing hands. Then he look down to see that the whole arena was full of cloud of dusts, which was created due to the explosion of Asakujaku (Morning Peacock) of Ren Tianyou. And currently no one could clearly see any movements within it.</p><br/><p>After this he closed Hachimon Tonkou (The 8 Inner Gates), and all the violent chakra around his body were quickly withdrawn, then his body gradually fell down on toward the arena. With a “peng” sound, he landed on the arena on one knee, he placed his right hand on the ground supporting his whole body and was heavily panting.</p><br/><p>He was experiencing the waves of pain within his body, in addition to that the chakra amount was also had greatly exhausted. Making a wry smile, Ren Tianyou thought, “I never thought a day like this would come when I have a sorry figure like this. It seems without using ninjutsu and doujutsu, I can only do this much.” In this match, although Ren Tianyou didn’t use ninjutsu and doujutsu which he was most familiar with, but purely a taijutsu, from this fight it clearly reflect the great improvement in the taijutsu of Ren Tianyou within this 2 years. But currently only opening 6th gate and using Asakujaku (Morning Peacock) was enough to exhaust him like this, whereas Maito Gai had opened the 6th gate and used Asakujaku (Morning Peacock), and after that he could still continue to open 7th gate and use ‎Hirudora (Afternoon Tiger) which was another powerful taijutsu.</p><br/><p>But in the current state of Ren Tianyou, no need to mention about Hirudora (Afternoon Tiger), even using Asakujaku (Morning Peacock) one more time was a problem. “It seems hereafter I should also focus on training my physical strength along with Hachimon Tonkou (The 8 Inner Gates) of Maito Gai, strange power punch of Tsunade, and the body ninjutsu of Raikage. This is an extremely good way to cultivate my physical strength. Since now I can obtain all of them, why waste without cultivating.”</p><br/><p>Along with the passage of time, the clouds of dusts also slowly settled down and dissipated, revealing the circumstances of the arena. The peoples around the surroundings of arena hastily came near the barrier surrounding the arena, then each and every one extended their head and watched towards the arena. Even Long Feilu and Zhao Guanghui who were on the VIP area also couldn’t help but stared down the arena without even blinking their eyes.</p><br/><p>They saw that the originally 10 meter radius hole created by the combined skill of Feng Wu and Golden Wings Phoenix, was again increased by several meters and had become even deeper. In addition to this now the arena was full of bumps and hollows, at the bottom of that big hole, Golden Wings Phoenix was lying on its stomach with golden yellow colored blood, its body was full of injuries, and all around it was dyed with the blood. Next to Golden Wings Phoenix, Feng Wu was also silently lying there, both eyes were tightly closed, she had thoroughly lost her consciousness. But there was not that many wounds on her body, besides the shoulder and legs having some cuts with bleeding, her condition was very much better compared to the body of Golden Wings Phoenix.</p><br/><p>“It seems Golden Wings Phoenix had taken all the attacks in place of Feng Wu too, and Feng Wu had successfully avoided any serious injuries. But even Golden Wings Phoenix couldn’t block all the blast wave of Morning Peacock, so from the looks of it, Feng Wu had lose her consciousness due to the blast wave.” After the dusts dissipated, looking at Golden Wings Phoenix and Feng Wu who were in a sorry plight, Ren Tianyou sighed within his heart.</p><br/><p>Ren Tianyou directly walked towards the direction of Golden Wings Phoenix and Feng Wu. Just when Ren Tianyou was approached near Feng Wu, Golden Wings Phoenix flapped its wings, lift up its head, and stared at Ren Tianyou and said, “Human, what are you going to do?”</p><br/><p>“He he, of course going to win the match. Still don’t you need to worry about the condition of injuries of Feng Wu?”</p><br/><p>“Humph, A’Wu possess phoenix god blood lineage. This blood lineage when reached to highest achievement can bath in rebirth fire, this small amount of injuries is nothing. Even if A’Wu intentionally do not go for a treatment, within one day her injuries will be completely healed.” Hearing Ren Tianyou, the eyes of Golden Wings Phoenix flashed with a light of disdain.</p><br/><p>“Eh.” A black lines spread on the forehead of Ren Tianyou, actually even the bird is looking down upon him, although this bird was kings of the bird. “Even though you both are awesome, in the end both of you lost to me.” Ren Tianyou threw away the disdain from the bird, and coldly snorted. However within his heart regarding the ability of phoenix god blood lineage of Feng Wu, he felt extremely shocked. As expected the member of Fire phoenix villa were abnormal.</p><br/><p>“You……….” Hearing those words full of disdain from Ren Tianyou, Golden Wings Phoenix suddenly chocked.</p><br/><p>“I say, why are you still here without disappearing? Be careful I will pluck all your feather and have a barbecue.” Ren Tianyou stared at still lying on the ground Golden Wings Phoenix, then he said, while producing lightning in his right hand.</p><br/><p>After Ren Tianyou had talked, a fissure appeared on the sky, then Golden Wings Phoenix directly flew inside it leaving behind some words, “Boy, if you dared hurt A’Wu, we member of Fire phoenix villa will never let you off.”</p><br/><p>Looking at the gradually closing fissure in the sky, Ren Tianyou snorted with disdain, “Tut! Bird with fear of death.” Then he looked towards the fainted on the ground Feng Wu, he crouched down and picked her up. After that he looked at the opening of the barrier in the sky, then holding Feng Wu in his hands, he suddenly ran on the wall of the barrier in a high speed towards the opening.</p><br/><p>After he landed on the ground, Luo Tianxing and others who were waiting for him, directly surrounded him in a flash and said, “Tianyou, are you all right?”</p><br/><p>“How are you Tianyou? Do you receive any injuries?”</p><br/><p>……………………….</p><br/><p>Seeing the worried faces of his companions all around him, a warmth flow in the heart of Ren Tianyou and he said, “Rest assured, no problem at all, just a little bit tired.”</p><br/><p>“Then its ok.” Hearing Ren Tianyou, everyone felt relived.</p><br/><p>“Oh, that’s right, Chuqian, take care of Feng Wu. I don’t want to get another slap without any reason.” Ren Tianyou hurriedly gave Feng Wu who he was carrying to Sun Chuqian. The slap of Li Xinyun in the morning still remained fresh in his memory. That’s why he didn’t want to suffer from an unexpected calamity again.</p><br/><p>After he passed Feng Wu to Sun Chuqian, Ren Tianyou turned his sideways towards the judge and said, “I am asking, are you going to announce the result of the match or not?”</p><br/><p>“Ah, eh, oh……….I announce Ren Tianyou as the winner of this match.” After judge announced the result, immediately everyone on the square gave a big round of applause. It was not for the victory of Ren Tianyou, rather for his and Feng Wu’s outstanding battle. Many believed that after seeing this battle many had insights for their own training.</p><br/><p>After hearing result of the match, Ren Tianyou finally felt relived. Suddenly he felt tired and exhausted physically and mentally, as he had used Hachimon Tonkou (The 8 Inner Gates). Then he shook his head, sat cross legged at that place and started to recover himself.</p><br/><p>At the side Luo Tianxing and other saw that Ren Tianyou was starting to recover himself, all of them surrounded him so as to not let anyone disturb him. Currently the whole arena was already completely destroyed due to the battle of Ren Tianyou and Feng Wu, and average magician couldn’t restore this arena any longer.</p><br/><p>So, Zhao Guanghui helplessly sighed at the VIP section, then stood up and flew towards the arena.</p><br/>\n</div>"}