{"title": "Chapter 90: The curtain falls———Operation start", "id": 90, "volume": 1, "url": "http://boxnovel.org/in-different-world-with-naruto-system-chapter-90-the-curtain-falls%E2%80%94%E2%80%94%E2%80%94operation-start", "volume_title": "Volume 1", "body": "<h1>Chapter 90: The curtain falls———Operation start</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 90: The curtain falls———Operation start</p><br/><p>Hearing the sounds of laughter, the complexion of Liu Yuan became red through and through, and roared angrily, “Laugh, laugh, I, your father offer 30 million Gold coins.”</p><br/><p>“Ha ha, as expected Chief Liu Yuan is rich and imposing, since you offer 30 million Gold coins, I will add a little bit more. I offer 35 million Gold coins. As I am not as rich and imposing as Chief Liu Yuan.” A tyrannical voice came out from 9th private room. Hearing this voice, everyone felt restlessness within their body, as everyone felt that this voice seemed to have guts to destroy everything.</p><br/><p>“Humph, didn’t expect you people of Dark imperial court also came here. Since it is like this, I offer 45 million Gold coins.” At this time, a soft and calm voice came out from the 6th private room. Hearing this voice, everyone felt a peaceful sense of warmth, and that restlessness they felt just a moment ago disappeared without a trace.</p><br/><p>“Light palace and Dark imperial court? Too bad, this time it will be a little troublesome.” Looking at the peoples of 6th and 9th private room, hidden behind the mask, Ren Tianyou furrowed his brows, and sensed that his move won’t be that easy as he imagined. Of all the big powers Light palace and Dark imperial court could be said to be the worst power to trifle with. It’s not because that their strength was very high, rather all of them were group of crazy devotee, and didn’t afraid to fight to death, instead they felt proud to die on battle, because they believed that if they die in a fight for the sake of their belief, after death their soul absolutely will return to the side of their Lord God of their belief.</p><br/><p>Along with this offered price, the peoples of those big powers started to bid millions of Gold coins in succession. All the peoples outside the private rooms were already stupefied hearing the bids, only now did they really know what real auction meant. They simply didn’t even had a leeway to may an offer for this item.</p><br/><p>After about 10 minutes later, the price had already rose to 123 million Gold coins. And now only people of 4 big power were bidding, namely Ximen clan, Magic domain, Illusory Shrine and Light palace.</p><br/><p>“Ai, didn’t expect you all are this crazy. Today I, your father don’t have this much coins, so I give up.” Liu Yuan of 1st private room couldn’t help but speak. He had really never thought that these people actually were this crazy, and he had only prepared 100 million Gold coins. He had believed that it was more than enough to purchase it, but the auction price of this Divinity crystal unexpectedly rose higher than his expectation. And especially just a moment ago he had laughed at Yun Mei’er of Illusory Shrine, but she was still bidding till now.</p><br/><p>“Hee hee, didn’t expect you all have prepared this many coins ah. Now I have to offer all my prostitution money. If you bid any higher, I will have no other choice but to give up. I bid 130 million Gold coins.” Yun Mei’er spoke with her voice which was filled with bewitching charm. Hearing this, all the people couldn’t bear but wanted to take pity upon her. If they were still bidding, perhaps all of them would have given up to compete, and gave Divinity crystal to her. But it’s too bad, the strength of those people of those 3 big power were comparable to her, so how could the charm of her voice work on them.</p><br/><p>“He he, I will add another 2 million to that price, I offer 132 million Gold coins.” Hearing Yun Mei’er, the leader of Magic Domain laughed and added another 2 million Gold coins.</p><br/><p>“Number two, what to do, we no longer have sufficient coin. Looking at this circumstance, this Divinity crystal absolutely will go to Magic domain. I had already known earlier that the people of Magic Domain were rich and overbearing, however never thought that they actually prepared this much coins.” In the 7th private box, Ximen Shu said worriedly to Ximen Xinbo. Because according to this trend, very quickly their Ximen clan would lose the qualification to bid in this auction. And they knew that the Light Palace was also unlikely to be equal of Magic Domain. Because everyone knew that magician was wealthy profession, and also being the magician of Magic Domain they didn’t have any shortage in money.</p><br/><p>“Ai, number one, I have a method but I want your approval.” 2nd elder Ximen Xinbo of Ximen clan also had anxious expression on his face, then squinting his eyes, thought of a way, after that move closer to the ears of Ximen Shu and spoke something.</p><br/><p>But after hearing Ximen Xinbo, Ximen Shu was shocked and directly stood up and roared towards Ximen Xinbo, “Number two, are you insane? You should know that this thing is important to our Ximen clan. Even for us Ximen clan, it is not easy to obtain this thing from that place yearly.”</p><br/><p>“Ah I also know number one, but this is the only way. After losing this thing we still have a way to obtain this again, but Divinity crystal however is most valuable treasure ah. If we miss this chance, we don’t know when we will be able to get this treasure again. You should know if our ancestor got this item then he would have a chance to attack next realm.” Why would Ximen Xinbo not know the importance of that thing, but there was no other way, as only after seeing this thing, Lan Diyin auction house would pay for them.</p><br/><p>“Ok, I have them now, number two, you should quickly take this thing to the person of Lan clan.” Ximen Shu gritted his teeth and agreed to the idea of Ximen Xinbo. Then from his space ring, he took out a huge egg of magical beast and give it to Ximen Xinbo. Ximen Xinbo took this huge egg, then opened the door of private room and directly left.</p><br/><p>“Great grandfather, that thing…………..” After seeing Ximen Shu took out that thing, Ximen Yue’er exposed the frightened look, and instantly understood the idea of 2nd Grandfather.</p><br/><p>“Well, Yue’er no need to speak, now there is no other way, when we return to the clan, I will explain to Patriarch.” Without doubt Ximen Shu clearly understood the thought of Ximen Yue’er, so he extend his hand to interrupt her before she could finish speaking.</p><br/><p>At this time, the price had already rose to 140 million Gold coins. And the Light Palace also couldn’t help but was defeated, now only Ximen clan and Magic domain were left in this bidding war.</p><br/><p>“Ha ha, brother Ximen, now it’s just two of us. How about it, do you still want to continue?” The leader Qian Wanjiang of Magic Domain proudly laughed.</p><br/><p>“Humph, why not contend, I offer 141 million Gold coins.” Ximen Shu coldly snorted, then offer the price. But inside his heart he was hoping for the quick return of Ximen Xinbo, because currently altogether he had prepared only 150 million Gold coins. And looking at this trend, this won’t last long.</p><br/><p>“Aiyo, Ximen brother, how can you be so stingy ah, only adding 1 million. I offer 145 million Gold coins.” Qian Wanjiang continued to proudly laugh at Ximen Shu, nevertheless he actually was very nervous, because he had prepared altogether only 170 million Gold coins, nothing more.</p><br/><p>“I offer 150 million.” Ximen Shu couldn’t help but only announce to offer all the Gold coins.</p><br/><p>“155 million.” The voice of Qian Wanjiang shattered the hope of Ximen Shu. Ximen Shu felt powerless and sat on the hide seat. Seeing that Ximen Xinbo had still not arrived, he only thought “finished” inside his heart.</p><br/><p>“Ha ha, Ximen brother, why aren’t you increasing the price, are you out of money? Ha ha.” Seeing that Ximen Shu didn’t continued to bid, Qian Wanjiang laughed proudly.</p><br/><p>“Well, is there anyone else to bid higher?” Lan Xinmeng spoke but no one continued to bid any higher. She also clearly knew that this price was basically sky high.</p><br/><p>“155 million, once!”</p><br/><p>“155 million, twice!” Hearing the countdown voice of Lan Xinmeng, Ximen Shu felt as if he was being hit on his heart with a hammer. Then he gave up all hope and closed his eyes.</p><br/><p>“155 mill………”</p><br/><p>“Our Ximen clan bid 180 million Gold coins.” Just at that time, the voice of Ximen Xinbo interrupted the countdown of Lan Xinmeng.</p><br/><p>“Number two.” Hearing the voice, Ximen Shu agitatedly jumped up from the seat, and spoke with excitement.</p><br/><p>“What!?” Qian Wanjiang who was in the process of being proud with himself immediately choked when he heard this voice. He didn’t dared to believe what he had just heard.</p><br/><p>“Number two, you succeed?” In the 7th private room, Ximen Shu was asked Ximen Xinbo with excitement.</p><br/><p>“En.” Ximen Xinbo was feeling a lingering fear, just a little late and his clan would have failed.</p><br/><p>After the countdown of 3 seconds, Ximen clan won the bidding war, and then Lan Ximmeng announced that with the successful sale of Divinity crystal, the auction was also over.</p><br/><p>Concealed behind the mask, Ren Tianyou had the expression of excitement as he saw that the peoples of Ximen clan left the private room. Then he laughed grimly, “Really didn’t let me down, so, operation start.”</p><br/><p>After he finished speaking the body of Ren Tianyou turned into a smoke and disappeared from that room without a trace.</p><br/>\n</div>"}