{"title": "Chapter 110: Joining the fight", "id": 110, "volume": 2, "url": "http://boxnovel.org/in-different-world-with-naruto-system-chapter-110-joining-the-fight", "volume_title": "Volume 2", "body": "<h1>Chapter 110: Joining the fight</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 110: Joining the fight</p><br/><p>Nine-headed Hydra, high-God-ranked magical beast, more than 20 meters in length, had 9 head, can use fire, water, wind, earth, lightning, light, dark, blood system and finally curse, these 9 types of power. One might say that it was the most terrifying magical beast. In addition it could also use combination magic, and the magic formed by the combination of two different system magic is not simple as 1+1=2. Its power would rise exponentially and reach the level of small-scale forbidden magic.</p><br/><p>Looking at the huge snake-like body of this 9-headed hydra, everyone onboard became so scared that all of them were already deathly pale.</p><br/><p>“How is this possible? Why did 9-headed hydra appeared here?” Ling Weiwei didn’t dared to believe what she was seeing before her eyes. For the first time she had set out in the sea and she encountered a 9-headed hydra, her luck was extremely……………….</p><br/><p>At this time, Ling Weiwei heard a ‘swish’ sound, and saw that Ren Tianyou had already appeared at her side. Then Ren Tianyouy stretched his right and under the surprise gaze of Ling Weiwei, he held her hand. After that just when Ling Weiwei wanted to struggle free her hand, the voice of Ren Tianyou entered her ears, “Come with me, first let your people use those magic lead cannons. And we will go to that super magic lead cannon and use it.”</p><br/><p>After that Ren Tianyou just pulled Ling Weiwei and jumped towards the deck at the location of the Super magic lead cannon. Inside the deck, at the cannon preparation room, when they saw that huge body of this 9-headed hydra, the complexion of all these warriors and staffs inside this room had instantly became extremely unsightly. After that one Saint-ranked warrior forcedly clamed himself down and immediately roared towards these panicked staffs, “All of you, shut the f**k up, quickly aim the magic lead cannons at that 9-headed hydra. Then load magic cores and attack it. Hurry up.” After hearing this voice, originally disordered peoples of this room immediately calmed down. Afterwards each and every one started to quickly begin the preparation and got into an action according to the instruction of this Saint-ranked warrior. After that the barrier opened up and all the magic lead cannon aimed at this 9-headed hydra. Each and every cannons were completely loaded with numerous rank 7 magic core.</p><br/><p>Above the deck, Ling Weiwei also calmed down, then immediately began to adjust the firing direction of this Super magic lead cannon. After this super magic lead cannon was aimed at 9-headed hydra, she placed her right hand on the opening of the barrel of the super magic lead cannon, then a groove appeared above it.</p><br/><p>After that the space ring on her right ring flashed with radiance, and a powerful fire system magic core which was emitting a burning hot magic aura appeared on her hand. This was the magic core of Sky swallowing flame beast who was a God-ranked magical beast. Even for Jealous Heaven mercenary group, they didn’t have any luxury to squander God-ranked magic core.</p><br/><p>After this magic core of Sky swallowing flame beast entered inside the groove, instantly this super magic lead cannon was filled with a powerful flame magical power, and all those magic formations on its barrel begin to lit up. Then at the muzzle of the barrel of this super magic lead cannon, a powerful flame magical power started to gather.</p><br/><p>At this time, the 9-headed hydra sensed a huge magical power from the magic lead cannon above the deck, then its 9-heads simultaneously opened its mouth, “Ha ha, you puny humans, you have the audacity to intrude my territory. And also do you really believed that you could defeat me depending on those little toy? What a pipe dream you have there.” 9-headed hydra spoke and its sound gave a kind of extremely gloomy and cold felling to humans. And hearing this voice all of them felt a cold chill on their back.</p><br/><p>After it finished speaking, the two heads of that 9-headed hydra started to quickly chant a magic spell, then water system and fire system magical power crazily gathered inside the mouth of those 2 heads. After that these 2 heads opened their mouths, then a golden fireball and sky blue colored water ball was shot out from their mouth. And both of these magic mutually revolved around each other and quickly shot towards Soaring Dragon ship.</p><br/><p>“Not good!” Seeing that incoming 2 huge magic balls, the pupil of all the peoples on the board shrunk, and everyone instantly knew that this was bad. But at the sea battle, all those warriors were completely useless, and only a magicians had a bit of use. But the most powerful among these magicians was only at the level of Great Magicmaster, and in front of this high-God-ranked 9-headed Hydra, they also appeared completely useless.</p><br/><p>At this time, every one above the deck suddenly heard a series of thunderous sound. Along with the “hong, hong, hong, hong, hong…” thunderous sound, over 20 magic lead cannons opened fire in succession towards that 9-headed hydra. 26 huge energy balls of various system was fired towards 9-headed hydra form those magic lead cannons, and they suddenly collided with the two magical balls fired by this hydra in the sky. Instantly a horrifying fire and water system energy fluctuation spreaded in the sky, together with a loud explosion sound. All the energy cannon ball of the magic lead cannon also exploded in the midair after the collision.</p><br/><p>Just after this, an even louder sound resounded from the deck of the Soaring Dragon ship. And a sturdy flame light beam was shot towards this 9-headed hydra from the super magic lead cannon which was on the deck. The recoil of firing the Super magic lead cannon actually shook the whole Soaring Dragon ship.</p><br/><p>In the route of this advancing flame light beam, the surface of the sea around it was actually split open by the speed of this light beam. Suddenly a huge sea ravine appeared around the sea surface, this shows the power of this light beam.</p><br/><p>Everyone on deck were firmly staring at that light beam, all of them were hoping that this terrifying attack would defeat this 9-headed hydra, so that they would become safe. However bigger the expectation they have, the bigger the disappointment they would feel if this attack failed. At this moment, at another two head of this 9-headed hydra, one white and one black radiances appeared, and innumerable elements of light and dark system insanely gathered at the mouth of these head. And then those gathered elements of light and dark system condensed into a white and black combined colored huge energy barrier.</p><br/><p>“Light-dark interlock!”</p><br/><p>After the energy barrier was completely formed in front of 9-headed hydra, the huge energy light beam fired from super magic lead cannon landed on that barrier. Then due to the attack from the super magic lead cannon, the light and dark element were unceasingly being consumed rapidly, and the energy of the barrier was becoming weaker in a high speed.</p><br/><p>Seeing that its light-dark interlock was unlikely to block this terrifying attack, viciousness flashed in the eyes of that 9-headed hydra. Then one of its head flashed with a blood red colored energy radiance, and this energy was filled with vicious aura. This was the blood system ability of this 9-headed hydra, which gave this 9-headed hydra the ability to burn its own blood and vastly increase its strength. But the backlash of this ability was extremely heavy even for this 9-headed hydra, as this could hurt its main foundation, and to recover from this, it should absorb many magical beasts or humans who were of at least Saint Rank in strength. And the blood system ability was not limited to this ability only, if the people or magical beasts who were weaker than itself appeared in front of it, it could easily absorb the blood of that person or magical beast out of thin air, causing them to explode and die. And the 9-headed hydra could increase its strength by absorbing the blood of other magical beasts or humans. This is a kind of extremely vicious ability.</p><br/><p>Using the ability of blood system, this 9-headed hydra burned its blood and greatly enhanced its strength rapidly. After that the light and dark system elements also started to gather even more quickly, and the consumed energy in light-dark interlock started to recover very quickly. And the barrier in front of it, again stated to shine with greater radiances.</p><br/><p>After a while, along with the passage of time, the energy of the attack of super magic lead cannon was completely consumed. And the 9-headed hydra nevertheless didn’t even had a single scratch on its body.</p><br/><p>On the Soaring Dragon ship, when everyone saw that even after that powerful attack, the 9-headed hydra was completely unscathed, everyone was filled with despair, as they had never thought that even with the attack form Super magic lead cannon, this 9-headed hydra not only survived but also had not a single scratch on its body.</p><br/><p>Now looking at the somewhat dim magic core of sky swallowing flame beast inside the super magic lead cannon, Ling Weiwei exposed a wry smile. In addition seeing this 9-headed hydra which was able to block attack of this super magic lead cannon. She felt a deep powerlessness inside her heart.</p><br/><p>At this time, the cold voice of this 9-headed hydra was transmitted to the ears of everyone, “You damned humans, actually forced me to use my power of blood system, now I’ll change all of you into a broken pieces under my magic.” Then the 2 heads among the heads which had yet to use any magic from the beginning, started to flash with lights, one flashed with cyan color and other flashed with purple color. After that the winds system elements started to quickly gather from the air, and suddenly changed into a tornado, then a huge waterspout appeared above the sea surface. And simultaneously a pitch-black clouds started to gather in the sky, then a terrifying lightning appeared in those clouds.</p><br/><p>After that, countless lightning from the black cloud directly fell at this waterspout, then suddenly a powerful lightning spark appeared above this waterspout.</p><br/><p>“All of you drop dead, combination magic of wind and thunder system—–divine lightning hurricane!” After that 9-headed hydra yelled, this terrifying combination magic of wind and thunder system advanced towards Soaring Dragon ship.</p><br/><p>Looking at this incoming terrifying magic, Ren Tianyou frowned, and his left eye had already changed into the Mangekyo Sharingan of Obito. And he slowly released a doujutsu of this eye, and just when he was about to destroy this hurricane, suddenly a huge cyan colored barrier appeared around this Soaring Dragon ship. And cyan colored mystical runes appeared at this barrier. This barrier successfully blocked this divine lightning hurricane of 9-headed hydra.</p><br/><p>Seeing the sudden appearance of this barrier, Ren Tianyou was clearly stunned. Then Ren Tianyou looked behind him from where this powerful cyan colored radiance had flashed, no, to be more accurate he was looking towards the direction Ling Weiwei. After that Ren Tianoy instantly thought that hidden expert, then immediately used the doujutsu of left eye and instantly arrived behind Ling Weiwei with his body covered with lightning light.</p><br/><p>And this cyan colored light beam suddenly stopped approaching Ling Weiwei after seeing Ren Tianyou suddenly appeared before him, then that cyan colored radiance disappeared and an old man wearing a cyan magic robe and who was also holding a cyan colored huge magic wand which was mounted with 2 magic stone became visible.</p><br/><p>“Old man, you finally came out, I, your father had already discovered you 2 days ago, didn’t expect you were able to hide till now.” Ren Tianyou started at this old man who was releasing a wind system magical power, and spoke with ill tone. Ren Tianyou was not at all courteous towards this God-ranked expert who had appeared before him with unknown purpose.</p><br/><p>“He he, youngster, didn’t expect your reaction speed was this fast. But I’m not your enemy, I meant no harm.” Hearing the speaking tone of Ren Tianyou, this old man was surprised. But also he had never thought that Ren Tianyou was able to react this fast to stop him.</p><br/><p>“Who’s if going to believe you…………” Before Ren Tianyou could finish speaking, the voice of Ling Weiwei which was full of pleasant surprise arrived from behind him, interrupting him.</p><br/><p>“Qingfeng grandpa, what are you doing here?” Ling Weiwei heard the movement behind her, so she turned around to look. And when she saw this old man, she was pleasantly surprised.</p><br/><p>“He he, Weiwei, your grandfather was not able to rest assured, so I followed you to protect you secretly.” Hearing Ling Weiwei, that old man replied with a smile.</p><br/><p>“Do you know each other?” hearing their conversation, Ren Tianyou asked with a doubt.</p><br/><p>“Are you kidding! Do you know the Wang Qingfeng of our Jealous Heaven mercenary group? That’s him.” Hearing the question of Ren Tianyou, Ling Weiwei answered snappily.</p><br/><p>Wind god Wang Qingfeng, was vice-leader of Jealous Heaven mercenary group, and was a mid-God ranked wind system magician.</p><br/><p>“Well Weiwei, this is not the time to talk, first we must solve this problem.” Wang Qingfeng said towards Ling Weiwei. Then looked at that 9-headed hydra in front of them with a serious expression. Even if he faced this horrifying magical beasts, it would be extremely troublesome. But currently he had no choice but to face this magical beast, then along with the cool breeze, Wang Qingfeng flew in the air. Then he got rid of that already dimmed defense barrier he had created, and flew towards that 9-headed hydra.</p><br/><p>“Fire the remaining final shot of the super magic lead cannon, only after I gave you a signal. Now I will also go to help your grandfather to deal with this 9-headed hydra.” Finished speaking, Ren Tianyou jumped out from Soaring Dragon ship, when Ling Weiwei was stunned hearing him.</p><br/><p>“Zero!” Seeing Ren Tian you had suddenly jumped out from Soaring Dragon ship, Ling Weiwei immediately exclaimed. Then bending over the railing, she looked downwards, and when she saw Ren Tianyou at that time, a fear flashed in her beautiful eyes.</p><br/>\n</div>"}