{"title": "Chapter 123: Demon clan", "id": 123, "volume": 2, "url": "http://boxnovel.org/in-different-world-with-naruto-system-chapter-123-demon-clan", "volume_title": "Volume 2", "body": "<h1>Chapter 123: Demon clan</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 123: Demon clan</p><br/><p>In one of the pup of Sea heaven city, Ren Tianyou was staying in the upstairs room, and had a complex expression on his face. After fleeing from those several huge dragons, Ren Tianyou had used kamui to return to the continent, and came to the sea heaven city. After that Ren Tianyou didn’t go to hand over the mission item, rather found an undisturbed place, and released that mysterious person from inside his kamui space.</p><br/><p>When Ren Tianyou released this person from inside his kamui space, he was instantly greatly surprised. Because this guy in front of him was clearly not a human. The body of this fellow was covered with dark red colored skin, eyes were also thoroughly blood red in color, and there were also 2 sharp-pointed horns on his head. In a single glance, any one could determine that he was not a human.</p><br/><p>Next Ren Tianyou used illusion on this fellow, and directly controlling this mysterious man, Ren Tianyou got all the information he wanted to know from the mouth of that mysterious person. And after finished listening to the narration of this man, Ren Tianyou was thoroughly stupefied.</p><br/><p>According to the explanation from this guy, his name was Liman Anla of Di Lisi. He belongs to the member of Demon clan’s Di Lisi clan.</p><br/><p>In those years, when the master of devildom’s demon clan commanded the members of devildom, including 3 demon god, 7 great demon commander, 12 demon guardian including 20 peak experts of devildom, altogether 3,000 had joined the force and break through the space restriction of devildom. And created a space transfer passage on the space barrier of Divine wind continent, then the army of devildom had instantly attack the whole continent.</p><br/><p>The strength of the master of devildom was monstrous, and 3 demon god, 7 great demon commander, and 12 demon guardian who were under his command, were also super-high level experts. So they easily swept all the way across the whole continent, one may well say they didn’t ran across any worthy opponent in their invasion. So soon afterwards the master of devildom ordered all of his men to disperse, and capture the whole divine continent as soon as possible.</p><br/><p>But exactly this decision of the master of the devildom led to the failure of Divine wind continent invasion operation. Just after the master of demon clan dispersed his men, instantly innumerable experts of 100 clans appeared. And they created a multiple teams and jointly attacked the experts of demon clan.</p><br/><p>When the demon clan had invaded, the experts of 100 clans had already gathered together, and were waiting for an opportunity to strike back all along. Because although the number of the experts of 100 clans were not that small, nevertheless compared to top level experts of demon clan, many of them were still not up to standard. If the master of demon clan had not separated his forces, then they would have successfully taken over this continent. But even like that, many experts of 100 clans lost their life, and were finally able to seal or kill demon clan’s 3 demon god, 7 great demon commander, and 12 demon guardian. And with the joint effort of all the experts of 100 clans, they were finally able to force master of devildom to retreat to his own devildom, and after that sealed the space transmission passage which was opened by the members of demon clan.</p><br/><p>After this great battle, many experts of Devine wind continents were dead. The members of 100 clans also went and live in seclusion, and entered into a long recovery period.</p><br/><p>After the failure in this fight, the master of devildom also fell into nothingness, but was always preparing himself to again invade this Divine wind continent. And finally he recalled one of the clan of his demon clan, Di Lisi clan.</p><br/><p>The clansman of Di Lisi clan had a unique power of blood lineage, and if they use this power of blood lineage, their strength will be decrease by 3 level as a cost. Using this power, they could change their body into void phantom, and could pass through any barriers.</p><br/><p>So the master of devildom made them use this power of Di Lisi’s blood lineage, and had them lie low and lurk there in Divine wind continent. And ordered them to secretly take over an ancient battlefield, and create a devildom’s soul snatching dark prison magic formation. This magic formation collects the resentment power from that ancient battlefield, and give birth to the beast of resentment.</p><br/><p>Because the beast of resentment had the peculiar trait of having their body made up of energies, ordinary sealing method would be of no use, and also this beast of resentment also had the soul attack which couldn’t be defended by any means. So the master of devildom thought to use these trait of this beast of resentment, and finally break all the seals.</p><br/><p>Under the order of master of devildom, finally the members of Di Lisi clan carefully selected this God weeping region. Because on one hand, this place was far away in the sea. Since it was extremely far away from the continent, this could avoid the gaze of majority of the peoples, and it is less likely for their plans to get leaked. And also on the other hand, this place happened to be one of the battlefield during devildom invasion. In this place, large amount of experts of 100 clans and demon clan had fallen, so the resentment power was also extremely high.</p><br/><p>After selecting this place, the peoples of Di Lisi clan created devildom’s soul snatching dark prison magic formation as per the order of master of devildom. And finally they used a secret magic spell to change the souls of deceased into bones of dead ferocious beasts, making their body to continuously emit powerful resentment power. And this soul snatching dark prison magic formation collected these resentment power.</p><br/><p>After thousands of years of preparation, the beast of resentment had almost completely formed, but Liman Anla of Di Lisi had never thought that the little ant who had infiltrated in this island would unexpectedly destroy this thousands years plans of their clan.</p><br/><p>Along with these, Ren Tianyou also got the information on the location of the place where space transfer passage which was used by demon clan to invade Divine wind continent was. And Ren Tianyou was also able to get every necessary information about that passage.</p><br/><p>“So the opening of this transfer passage is located at that place, interesting.” After getting all the information, Ren Tianyou directly crushed the throat of Liman Anla, and put the end to his life. “Didn’t expect the ambition of demon clan is actually this big. 3 demon god, 7 great demon commander, in addition 12 demon guardian, as well as strongest master of devildom, it seems I am going to be busy.”</p><br/><p>Ren Tianyou thought little by little inside his heart, from the narration of Liman Anla, Ren Tianyou had also got the information on the location of the place where experts of the demon clan were sealed. Ren Tianyou decided that after he awakened Eternal Mangekyo Sharingan, he would go and see these locations. Because if he went to those place with his current strength, he would die instantly or he would be forced to use kamui to escape.</p><br/><p>Just at this time, the prompt sound of system rang out in the brain of Ren Tianyou, “Congratulation to host for completing main mission——explore the reason for the formation of the mysterious place. Host is rewarded with 10,000 system points, and Shikotsumyaku (Macabre Bone Pulse) of Kaguya clan.”</p><br/><p>Along with the system voice, the system points of Ren Tianyou was immediately increased by 10,000 points, and Ren Tianyou couldn’t help but became daze, “No wonder I didn’t hear the prompt of mission completion when I left God weeping region.”</p><br/><p>As it turned out as long as Ren Tianyou only examine the cause of the formation of this mysterious region, this mission would be completed. In another words, even if Ren Tianyou didn’t destroy soul snatching dark prison magic formation, and eliminate beast of resentment, as long as he had gotten the information from this mysterious person, his mission would be completed. Because this mission was not asking Ren Tianyou to have a battle or to destroy anything, merely he had taken the wrong road.</p><br/><p>At this time, the system prompt again, “Shikotsumyaku (Macabre Bone Pulse) is being bestowed. Because this Shikotsumyaku (Macabre Bone Pulse) belongs to Kekkei Genkai, the host will feel some pain. Hope host will exercise patience.”</p><br/><p>After the voice of system, a gold colored light beam surrounded the body of Ren Tianyou. Then Ren Tianyou suddenly felt pain in the bones all over his body, even with the fortitude of Ren Tianyou, he couldn’t help but cry out loud in pain. “Ah………”</p><br/>\n</div>"}