{"title": "Chapter 129: Weakness of Kamui", "id": 129, "volume": 2, "url": "http://boxnovel.org/in-different-world-with-naruto-system-chapter-129-weakness-of-kamui", "volume_title": "Volume 2", "body": "<h1>Chapter 129: Weakness of Kamui</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 129: Weakness of Kamui</p><br/><p>“Saiko Zettai Bogyo—-Shukaku no Tate! (Ultimate Defence—-Shukaku’s Shield!)”</p><br/><p>After Ren Tianyou yelled loudly, countless sand suddenly emerged from the ground in front of him, and under the control of powerful chakra of Ren Tianyou, these sands quickly gathered in front of him and take the form of sand shield with the shape of ichibi Shukaku. This was precisely absolute defense of Shukaku.</p><br/><p>Since the time after he had signed the summoning contact with Shukaku, Ren Tianyou had obtained some of the power of Shukaku, and now he could freely and easily control sands. He no longer needed to use huge amount of chakra like before to make sands, now Ren Tianyou could create sands anytime and anywhere without any difficulty.</p><br/><p>Li Jianrong who had turned into a huge light sword slashed at the surface of the Shukaku’s Shield, and an unpleasant to hear sound of friction rang out immediately. And due to the powerful impact of this huge light sword, a big carter appeared on this sand shield.</p><br/><p>But this Shukaku’s Shield was known as the absolute defense not for nothing, even the strongest bone spear of Kimimaro was not able to break through it. So how could this attack of Li Jianrong break through this defense of Ren Tianyou. The attack of Li Jianrong was not even able to pass through 1/3 of the thickness of the defense, after that this huge light sword slowly started to disappear, and the body of Li Jianrong appeared from inside it.</p><br/><p>After his body became visible, one could see surprise on the face of Li Jianrong but he immediately retracted it. After Ren Tianyou blocked the attack of Li Jianrong, Ren Tianyou no longer wasted his chakra, he just remove his control from Shukaku’s Shield. Immediately after that, the huge Shukaku’s Shield in front of him scattered, and become a pile of sands on the ground.</p><br/><p>“Ability to control the sands?” Looking at that pile of sands, Li Jianrong thought inside his heart. And he thought about his battle till now with Ren Tianyou, “Beside that there is still lightning system power, and furthermore that ability to control his bones. This guy is really hard to deal with.”</p><br/><p>“Since it is like this, I have to get a little bit more serious now.”</p><br/><p>After thinking these, the eyes of Li Jianrong firmly shrunk, and the aura of his body suddenly changed. Countless sword blade suddenly sprang out from inside his body, and started to float around his body. And the boundless white colored battle qi around his body were immediately replaced by these sword blade. His silver colored long hair were floating in all direction along with his aura around his body, and now his body had changed into huge sword blade column.</p><br/><p>“Heaven sword blood lineage, open!”</p><br/><p>…………………</p><br/><p>“This is……….?” Looking at Li Jianrong who had a big change in his appearance and was not that far away from him, a serious expression appeared in the face of Ren Tianyou. Seeing the current appearance of Li Jianrong, even Ren Tianyou felt formidable pressure, “This guy is even more powerful than that face paralyzed Yan Xinluo.”</p><br/><p>Now from the body of this guy, Ren Tianyou could sense the aura that didn’t lose to the aura of several God-ranked experts he had encountered before. And although he knew that Yan Xinluo was always suppressing his power, but during the finals of that competition, he had all-out battle against Yan Xinluo. So according to the estimation of Ren Tianyou, being the member of Sishen clan of ancient 100 clans, although his strength would be very high, nevertheless he estimated that the strength of Yan Xinluo won’t be higher than mid-God rank. But this Li Jianrong in front of him, however………..</p><br/><p>“As a saying goes, strike first and gain the upper hand, I should not wait any longer.” Without hesitating any longer, Ren Tianyou stretched his right hand and aimed at Li Jianrong. Suddenly huge clouds of sands gathered above his head, and countless sands fell towards Li Jianrong.</p><br/><p>“Suna Shigure! (Sand Shower!)”</p><br/><p>“En?” Seeing that sands were falling down upon him, Li Jianrong stretched his right hand and caught some of it, and sensed that there was nothing unusual on it, “Boring tricks.”</p><br/><p>After that Li Jianrong looked towards the direction of Ren Tianyou, and wanted to rush towards his direction. But his complexion immediately changed, he had the expression as if he had seen something unbelievable. He looked towards his legs and he immediately saw that 2 huge palm of sands had firmly caught both of his legs, rendering him immobile.</p><br/><p>“Caught, next is………” Seeig that he had successfully caught Li Jianrong, Ren Tianyou became excited. After that he quickly made a series of hand seals with both of his hands, and immediately poured his chakra towards the ground.</p><br/><p>“Gokusa Maiso! (Sand Burial Prison!)”</p><br/><p>Along with the voice of Ren Tianyou, the ground around Li Jianrong suddenly loosen up and changed into innumerable sands. After that the body of Li Jianrong started to slowly sink down.</p><br/><p>“You will sink down up to 200 meters underground, and due to the huge pressure underground, you won’t be able to twitch even your single finger.” Looking at the gradually sinking Li Jianrong, Ren Tianyou lightly spoke.</p><br/><p>Listening to Ren Tianyou, and looking at his body which was slowly sinking underground, Li Jianrong didn’t even had a single change in his expression. After that he lift up his head and just calmly looked at Ren Tianyou, then slowly disappeared into the ground.</p><br/><p>After the body of Li Jianrong completely sunk inside the ground, Ren Tianyou immediately controlled the sands and gathered the sands to form a firm ground. Only after completing this, Ren Tianyou relaxed and heave a sigh, “Finally resolved this matter. Now I only need to wait until that fellow exhaust his battle qi. After that I will let him out.”</p><br/><p>Just when Ren Tianyou wanted to relax a bit, he suddenly sensed that the ground beneath him started to shake violently, and the earth around him started to slowly crack, as if something terrifying was trying to break out from underground. After that the voice of Li Jianrong which came from underground, entered the ears of Ren Tianyou.</p><br/><p>“Dark lightning secret sword art—-first form——Heaven and earth wave!”</p><br/><p>Hearing the voice of Li Jianrong, the complexion of RenTianyou suddenly changed, “Not good, Kamui!” His right eye immediately released a powerful eye power.</p><br/><p>At this time, innumerable powerful sword qi were shot up from underground towards the sky. These sword qi immediately covered the ground around the radius of 100 meters, even the body of Ren Tianyou was naturally enveloped by these sword qi.</p><br/><p>But even after these sword qi shot through the body of Ren Tianyou, there was not even a single drop of blood on the body of Ren Tianyou, and furthermore there was also not even a single wound in his body.</p><br/><p>Relaying on the power of right eye’s Kamui, Ren Tianyou was able to protect himself from these terrifying sword qi formation. But after several tens of seconds, Ren Tianyou discovered something was wrong, because the sword qi were continuously shooting out from underground without any intention of stopping, as if it was endless. Even after a minute, the sword qi were continuously shooting out from underground. After this, Ren Tianyou could no longer remain calm.</p><br/><p>“It’s better to run for it.”</p><br/><p>Ren Tianyou instantly realized that the current circumstance was bad, so without losing any time he began to quickly run out from the formation of sword qi. If he stay her for a long time, then he would definitely become a Swiss cheese. Because although the kamui of right eye of Ren Tianyou could let anything pass through his body as if his body was transparent, nevertheless there was also a weakness to this jutsu. That weakness was the time limit of 5 minutes. In other words, after he activate kamui, the power of kamui can last for only 5 minutes if used continuously, and after that it would lose its effect. Ren Tianyou naturally was clearly aware of this weakness, so Ren Tianyou naturally didn’t dared to stay in this sword qi formation for the extended period of time.</p><br/>\n</div>"}