{"title": "Chapter 132: Hirudora (Afternoon Tiger)", "id": 132, "volume": 2, "url": "http://boxnovel.org/in-different-world-with-naruto-system-chapter-132-hirudora-afternoon-tiger", "volume_title": "Volume 2", "body": "<h1>Chapter 132: Hirudora (Afternoon Tiger)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 132: Hirudora (Afternoon Tiger)</p><br/><p>In the sky, Ren Tianyou quickly swung his fists repetitively. After opening the 6th gate—gate of joy, the chakra inside his body suddenly rose sharply, and a layer of crimson colored aura covered the surface of his body. Due to the extreme speed of punching, they were set ablaze due to the friction with the air, so countless flame balls appeared in the air, which advanced towards Li Jianrong. This was one of the powerful move of the 8 inner gate of Ren Tianyou— Asa Kujaku (Morning peacock).</p><br/><p>Seeing the sudden appearance of countless flame balls, Li Jianrong was completely startled. After that he immediately calm down the state of his mind, and immediately released a powerful strength from deep inside his body. This powerful strength seep out from his body and wrapped his whole body with a gold colored layer.</p><br/><p>“Blood lineage secret skill, Heaven sword 3rd form——Myriad heaven sword!”</p><br/><p>“Swish!” Along with the voice of Li Jianrong, from the body of Li Jianrong, a gold colored sword blade was suddenly released which surrounded his whole body, and his body slowly disappeared. After that this gold colored sword blade directly entered inside the dark god sword.</p><br/><p>After this gold colored energy merged with dark god sword, suddenly countless essence of huge swords whose appearance was same to the dark god sword separated from the dark god sword. And these countless huge swords were densely distributed in the air. With a single glance one could easily estimate that there were at least several thousands of these huge swords.</p><br/><p>“Swish”, “swish”, “swish”…………These huge swords immediately streak across in the sky with the gold colored radiance towards flame balls from the Asa Kujaku (Morning peacock) attack of Ren Tianyou.</p><br/><p>“Hong”, “hong”, “hong”…….. A series of loud explosion sound rang out in the air, the flame balls and huge swords continuously collided with each other. And along with this continuous crashing, a series of loud explosion sound rang out.</p><br/><p>After about a minute, the Asa Kujaku (Morning peacock) of Ren Tianyou disappeared. And only few of those densely distributed huge swords remained in in the sky. Ren Tianyou slowly descended from the air, firmly landed on the ground and lifted his head to look towards the sky. He saw that those few remaining huge swords which was dazzling with gold colored light slowly gathered in a single place in the sky, then Li Jianrong who was holding the dark god sword appeared from this gold colored light.</p><br/><p>Although Li Jianrong was able to block the Asa Kujaku (Morning peacock) of Ren Tianyou, nevertheless his present condition did not seem to be that good. Cold sweats were continuously flowing out from his forehead, and on the top of that his body was constantly twitching, but even in this condition, he had an extremely excited smile on his face.</p><br/><p>A moment ago, Li Jianrong had used the secret skill of his blood lineage to block the Asa Kujaku (Morning peacock) of Ren Tianyou. Li Jianrong was the member of ancient 100 clan’s Holy Sword clan. And all the members of this clan indulged themselves in the ‘ways of sword’ for all their lives.</p><br/><p>Holy Sword clan, one of the ancient 100 clan, possess high-saint ranked power of blood lineage ‘heaven sword blood lineage’. But their power of blood lineage was different from other blood lineage. The possessor of this Heaven sword blood lineage could only use sword as a weapon, if they use any other weapons, their fighting capacity would immediately decrease by a lot. And this Heaven sword blood lineage completely depend on ‘power of comprehension’ of the possessor of this blood lineage. If ones power of comprehension on swords is extremely deep, and had extremely high innate talent on ways of swords, then that person could bring out to play the real power of this Heaven sword blood lineage, and the strength of that person would quickly increase.</p><br/><p>If one had extremely high talent on ways of sword, and possess this Heaven sword blood lineage, then the strength of that person would increase several times faster compared to ordinary person, even to the extent of 10 times. But if one had inadequate talent in ways of swords, then this high-Saint ranked blood lineage Heaven sword would only become a burden for him. And his cultivation speed would be very slow, even to the extent that his cultivation speed would very probably be slower than ordinary person with ordinary blood lineage. And in this Holy Sword clan from long time ago, the strength of youngster of 20-30 years old outdo the strength of some old codger of 50-60 years old.</p><br/><p>Li Jianrong was the leader of the current younger generation of Holy Sword clan, his talent on ways of sword could be said to be the highest talent that had appeared within Holy Sword clan in several thousands of years. Till now not only had he completely mastered and merged all the sword skills of his clan, he had also created his own ways of sword, such as 9 swords secret art, the end of the earth way of sword, dark lightning sword secret art………and so on. He also took the advantage of the specific characteristic of his power of blood lineage, and before the age of 20, he had already cultivated to the level of high-Sword God rank, almost breaking through the limits of the body and step into a new domain of martial way.</p><br/><p>And just a moment ago, he had used the 3rd form of the secret skill of his Holy Sword clan’s Heaven Sword power of blood lineage. This Heaven sword’s 3rd form was one of the form of ultimate 3 form of secret sword art created by combining all the comprehension of ‘ways of sword’ comprehend by the ancestor of Holy sword clan and their power of blood lineage. Every form of this secret sword art had enough strength to destroy heaven and exterminate the earth. But this secret sword art demand huge amount of energy to use. Even Li Jianrong who was already a high-Sword God ranked expert, had a big burden on his body after he used this Myriad heaven sword and still could show the full power of this move.</p><br/><p>…………………</p><br/><p>On the other side, Ren Tianyou was extremely shocked inside his heart while standing on the ground. Originally he had intended to end this match with Asa Kujaku (Morning peacock), but his Asa Kujaku (Morning peacock) attack was completely blocked by Li Jianrong. Looking at the unscathed Li Jianrong, Ren Tianyou thought, “Don’t tell me I really have to use doujutsu, but I can’t always depend on doujutsu. Although the power of Mangekyo could easily deal most of the opponent, nevertheless the most important is still body itself.”</p><br/><p>“Since it is like this, I will use this new move, I hope this fellow is able to resist this attack without dying. Don’t disappoint me.”</p><br/><p>Staring at Li Jianrong, Ren Tianyou made his decision to use this final move to determine the winner.</p><br/><p>As if he sensed the determination of Ren Tianyou, Li Jianrong also slowly looked towards Ren Tianyou from the sky. After that his eyes suddenly met with the eyes of Ren Tianyou, and the intense fighting intent sparked in the air.</p><br/><p>“It seems I have to use Heaven Sword cleave to end this fight.” Looking at Ren Tianyou, Li Jianrong thought inside his heart. Then he opened a little bit distance between his legs, and his the battle qi of his whole body violently rolled over and over. This was so because at this moment, he had activated one of the form of secret sword skill of Heaven sword bloodline lineage. As if some kind of invisible power was pulling, the dark god sword in his right hand slowly separated from his hand and slowly rose in the sky. And this made other to feel gloomy as if the originally fine weather become gloomy all of a sudden. But looking carefully, the sky was still fine just like before, and that misconception was caused by the power of Li Jianrong itself.</p><br/><p>After that, gold colored energy clouds started to gather quickly in the sky, and countless terrifying energy storms spread in all direction from these clouds. Then the dark god sword which was floating in the sky immediately shot inside these gold colored energy clouds.</p><br/><p>Li Jianrong floating in the sky thought inside his heart while looking at Ren Tianyou on the ground, “I hope you are able to withstand this attack.” Finished thinking, he waved his right hand, and the light beam of his battle qi from his body suddenly shot towards the clouds and entered inside the clouds.</p><br/><p>After the battle qi of Li Jianrong entered inside these gold colored clouds, these clouds started to violently roll over and over, and stirred. After that boundless energy fluctuation spread in all direction. Then this boundless cloud was split open in the middle all of a sudden by a huge power, and a huge sword with large amount of energies appeared from inside these clouds. The length of this gold colored energy huge sword was more than 20 meters, and the huge sword blade of this huge sword was emitting a terrifying energy, as if these energy could easily split open the surrounding space. And under the control of Li Jianrong, this huge energy sword was firmly locked on to Ren Tianyou. After that under his command, this huge sword fell towards Ren Tianyou.</p><br/><p>“Heaven sword secret skill—-2nd form—— Heaven Sword cleave!”</p><br/><p>Looking at the huge energy sword, Ren Tianyou took a deep breath, then the chakra surrounding him start to surge even more violently, and all the clothes he was wearing started to slowly tear apart, and blue veins started to appear in his body and forehead, which looked very frightening.</p><br/><p>“Hachimon Tonkou—-Dainana—-Kyomon, kai! (The Eight Inner Gates—-7th gate—-Gate of shock, open!)”</p><br/><p>Ren Tianyou yelled loudly, and the green colored air steam became even more violent, and his body became even redder. After opening 7th gate, Ren Tianyou looked towards the falling huge sword. After that place both of his hand in front of him and wave towards the sky, then a terrifying amount of chakra spread in all direction.</p><br/><p>“Hirudora! (Afternoon Tiger!)”</p><br/><p>“Roar!” Along with the loud roar of tiger, a huge white colored illusory energy white tiger appeared in front of him and issued a loud roar. Then under the command of Ren Tianyou, it rushed towards the incoming huge sword and Li Jianrong. Very soon, the white tiger and that gold colored energy huge sword collided with each other.</p><br/>\n</div>"}