{"title": "Chapter 141: Surrounded (2 in 1)", "id": 141, "volume": 2, "url": "http://boxnovel.org/in-different-world-with-naruto-system-chapter-141-surrounded-2-in-1", "volume_title": "Volume 2", "body": "<h1>Chapter 141: Surrounded (2 in 1)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 141: Surrounded (2 in 1)</p><br/><p>The eyes were blurred for a moment, and when the vision of his eyes resumed, Ren Tianyou discovered that he was already in the middle of unfamiliar environment.</p><br/><p>After looking around, Ren Tianyou became even more careful. In this unfamiliar environment of this Tower of Babel, he had no choice but to be extremely cautious.</p><br/><p>After that Ren Tianyou once again carefully examined the surroundings around him, and discovered that currently he was inside a huge forest. There were only tall and big trees all around him, and these trees were far more sturdy and tall compared to the trees of Magical beasts’ forest. The sky above was emitting a layer upon layer of soft white light, which illuminate this entire place.</p><br/><p>“It seems currently I am in the middle of forest.” After looking around him, Ren Tianyou thought inside his mind. “Since it is like this, I should hurry and pass through the 6 dao domain of this 1st floor, and enter 2nd floor. This will be my first objective.”</p><br/><p>From the person of Demon clan who was caught by Ren Tianyou, he had learned that many experts of demon clans were sealed inside the Tower of Babel. But although those remnants of demon clan who were wandering Divine Wind continent know this information, nevertheless they didn’t know the specific location of this Tower of Babel. As a result, they were completely powerless to rescue these experts of demon clan.</p><br/><p>After getting this information, the voice of system was directly transmitted to the brain of Ren Tianyou, so Ren Tianyou had no other choice but to come to this Tower of Babel.</p><br/><p>“Enter the Tower of Babel, and kill a member of demon clan who is sealed inside. Rewards: 20,000 system points, and Shakuton (Scorch Style) kekkei genkai (Bloodline limit). Unlimited time. Killing any member of demon clan is alright, but must be a sealed demon clan.”</p><br/><p>It was because of this mission, Ren Tianyou was unable to hold back and wanted to enter Tower of Babel before anything else. Ren Tianyou had even delayed the matter of going to the Ximen clan due to this mission, and sent only White Tiger and Void first.</p><br/><p>No need to speak about system points, this Shakuton (Scorch Style) kekkei genkai (Bloodline limit) would definitely help him greatly to enhance his strength.</p><br/><p>And from the information he got form that captured demon clan’s member, Ren Tianyou knew that all of those sealed experts of demon clan were extremely strong. But after listening to the narration about experts of God realm from Li Jianrong, Ren Tianyou had estimated that, basically the strength of those sealed experts of demon clan would be at the level of God realm in minimum. So even Ren Tianyou himself didn’t know whether he could deal with them.</p><br/><p>But the only good news was, all of them were in the state of sealed, and they were unable to bring out to play their whole strength. And these experts of demon clan were sealed on the basis of their strength, so Ren Tianyou estimated that the experts of demon clan sealed in the 2nd floor of Tower of Babel were weakest among all the experts of demon clan sealed in this tower. As for the 1st floor, he estimate that all of them were already eradicated by the experts of the academy, after all the academy treat this 1st floor as a refine with fire test location, so it was impossible to let such dangerous existence to exist in this place.</p><br/><p>Sorting out his train of thought, Ren Tianyou jumped on the tree in front of him, then quickly started to jump from one tree to another, and advanced towards the deeper part of Tower of Babel in a high speed.</p><br/><p>After advancing for more than 10 minutes, Ren Tianyou suddenly heard a sound from above him. Hearing this sound, Ren Tianyou couldn’t help but to raise his head and look over. Then above his head, he saw a huge bird type blood beast who was flying towards him by flapping its huge wings. And after it arrived above Ren Tianyou, it immediately waved its sharp pointed claws towards his head.</p><br/><p>“Humph.” Seeing the sudden attack, Ren Tianyou quickly made a series of hand seals, after that when this huge claws hit the body of Ren Tianyou, along with a ‘peng’ sound, a white smoke rose, and a small wooden log appeared in that place. And that wood was crushed by that claw attack.</p><br/><p>Not far away from that location, the figure of Ren Tianyou appeared. He had used Kawarimi no Jutsu (Substitution Jutsu) to dodge the sudden attack of this blood beast. After dodging this attack, Ren Tianyou instantly got ready to counter attack. As for why Ren Tianyou didn’t use Kamui to dodge this attack? Nonsense, do you think kamui did not consume any blindness points, or do you think it is easy to restore the blindness point? Although the mission system is opened now, nevertheless Ren Tianyou only had a pitiful number of system points. What’s more why use an oxcleaver to kill a chicken. When a simple Kawarimi no Jutsu (Substitution Jutsu) could easily solve the problem, why must one use Kamui which consumes more chakra and also a blindness points.</p><br/><p>“Katon——Gokakyu no Jutsu! (Fire Style—-Grand Fireball Jutsu!)”</p><br/><p>Ren Tianyou quickly made a series of hand seals, and placed his right hand near his mouth, then spewed out a blazing huge fire ball form his mouth towards that huge bird like blood beast. The power of fire was far more powerful compared to before. Because he had advanced to kage level, the proficient and power of all the ninjutsu had become very powerful.</p><br/><p>But this blood beast was also not that easy to deal with, when it saw a huge fireball advancing towards it, it flew in the air and madly flapped its huge wings. Then a fierce wind cause by its wings dispersed the fireball of Ren Tianyou.</p><br/><p>“Humph!” Seeing that his fireball was dispersed, Ren Tianyou coldly snorted. But after looking at this blood beast with his Sharingan, Ren Tianyou showed a smile. And he quickly made a series of hand seals.</p><br/><p>After seeing that the fireball which was advancing towards it was dispersed, this huge bird type blood beast slowly stopped wildly flapping its wings. After that the fierce wind in front of it also slowly stopped. But just when it wanted to fly and attack Ren Tianyou again, an ear-piercing chirping sound of birds suddenly rang out, after that its eyes only saw a long and thin lightning light beam in front of it, and that lightning beam penetrate its body.</p><br/><p>At the tree in front of it, Ren Tianyou had stretched out his right hand which was covered with lightning light, and a long lightning light beam of about 5 meters was stretched out from his right hand. This was the ninjutsu of Ren Tianyou, named Chidori Eiso (Chidori Laser Spear).</p><br/><p>“Humph, got you, now you can go to the death god to report.” Seeing that his Chidori Eiso (Chidori Laser Spear) had already penetrated the body of this blood beast, Ren Tianyou exposed a cruel smile on his face, then he waved his right. Along with the movement of his right hand, suddenly the Chidori Eiso (Chidori Laser Spear) moved, and together with a large amount of blood from the body of this blood beast, the body of this blood beast was ruthlessly cut into half by Ren Tianyou using Chidori Eiso (Chidori Laser Spear).</p><br/><p>Seeing that he had disposed the enemy, Ren Tianyou stopped his ninjutsu. After that the lighting light beam of Chidori Eiso (Chidori Laser Spear) slowly dissipated. And the corpse which was cut into half of the blood beast also fell down from the sky. Falling on the ground, it created a big cloud of dust.</p><br/><p>“Peng.” Ren Tianyou firmly landed on the ground, and walked over to the corpse. After that he indifferently looked at the cut into half corpse of the blood beast, and even after seeing that the blood was unceasingly flowing out from that corpse, Ren Tianyou didn’t has a slightest ripple on his emotion. No, its not like Ren Tianyou had no feelings, or he was cruel, its just that in this people eat people society, it was important for a person to learn to become stony-hearted. If ones heart was not hard enough, then basically that person will not be able to survive in this people eat people society.</p><br/><p>“This so-called blood core should be similar magic core of magical beasts, so just like in magical beast, this blood core ought to be in the head of this blood beast.” Ren Tianyou muttered to himself. After that he pulled out his Sword of kusanagi and cut open the head of this blood beast. As expected Ren Tianyou clearly sensed that his sword bumped with something hard. After that he skillfully exerted a force on his sword, and a blood red crystal core suddenly flew out from the head towards Ren Tianyou.</p><br/><p>Ren Tianyou stretched his left hand and caught this crystal core, then he curiously looked at this blood red colored blood core which was different from magic core.</p><br/><p>“Can I absorb this blood core?” Looking at this blood core, Ren Tianyou thought. Before he had many magic cores and he had tried to absorb it, but Ren Tianyou was disappointed, as no matter any method he used, he was absolutely unable to absorb the energy inside magic core.</p><br/><p>After thinking for a while, Ren Tianyou still decided to try to absorb the energy from blood core. He sheathed his sword of kusanagi, sat cross-legged on the ground, then placing this blood core in the center of his both hands, he closed his eyes. After that he gathered the chakra in his both hands.</p><br/><p>When both of his hand lit up with his blue chakra, the blood-red energy inside that blood-red crystal core slowly spilled over, then change into a blood red thin stream and entered the body of Ren Tainyou from his hands which was covered with chakra.</p><br/><p>After this blood-red thin stream entered the body of Ren Tianyou, it slowly spread to the whole body of Ren Tianyou. Ren Tianyou could sense that countless cells inside his body were slowly absorbing these blood-red energy. After that Ren Tianyou clearly sensed a little bit of enhancement in his physical body. Although this enhancement was negligible, nevertheless it really increased the physical strength. And as if he had eaten a tonic, Ren Tianyou sensed that his whole body had become more active.</p><br/><p>Ren Tianyou had felt like that because blood core was blood essence of blood beast. This blood core was not like magic core which could increase battle qi, magical power core and illusory core. Absorbing this blood core would enhance the strength of one’s flesh and blood, and also enhance the physique, so Ren Tianyou who was cultivating chakra was also able to absorb this blood core. And on the basis of actual use, this blood core was far more important than magic, magical power, and illusory cores, because only one’s own body’s strength is the most important.</p><br/><p>After opening his eyes, anyone could clearly see the excitement in his eyes. It seems the effect of this blood core is more useful towards Ren Tianyou compared to other people. It was so because, after he successfully enhance his physique then the effect of his taijutsu would also advance by leaps and bounds. What’s more, even if he use several forbidden taijutsu, the backlash would likely to be greatly reduce.</p><br/><p>Although the effect of a single blood core could be overlooked, nevertheless there were countless blood beasts inside this Tower of Babel. If quality won’t do, then he would use quantity to replace it. In this second, Ren Tianyou had an impulse to collect a large amount of blood core. This blood beast also gave him more system points, an ordinary blood beast gave him 60 system points. So for Ren Tianyou who was worrying about the lack of system points, this was extremely good news.</p><br/><p>However, Ren Tianyou also did not forget his purpose for coming here, and furthermore there was still other important thing that was waiting for him to do. So how could these small temptation make him forget about his other great matters?</p><br/><p>Ren Tianyou stood up, patted the dust on his body, and got ready to move forward so as to not waste any more time. But just then, Ren Tianyou suddenly heard a loud commotion above his head, after that the ground started to violently vibrate, as if something huge was running towards him in a high speed.</p><br/><p>“What’s going on?” Ren Tianyou knit his brows tightly, and he sensed something peculiar in his surroundings. After that his eyes immediately changed into Mangekyo Sharingan, and he carefully scanned his surroundings, and prepared himself for anything unexpected.</p><br/><p>At that time, the loud commotion above his head became even more powerful. Hearing this, the ears of Ren Tianyou were already buzzing.</p><br/><p>Ren Tianyou temporarily suppressed the agitation he was feeling inside his heart, then raised his head, and looked above him. Seeing the scene above him, Ren Tianyou was so shocked that the pupil of Ren Tianyou immediately contracted.</p><br/><p>Above his head, he saw countless bird type blood beasts which was of same species of the blood beast which he had killed just a moment ago. And these densely packed blood beasts were directly flying towards him and they had completely filled the whole sky.</p><br/><p>“F**k!” Seeing the current circumstance, Ren Tianyou instantly felt pain in the ass, and his brain instantly muddled. “What the hell is going on? Don’t tell me that these blood beast are coming here to avenge their fallen companion? Who said that these blood beasts do not have any intelligence?”</p><br/><p>He didn’t have any time to think more, Ren Tianyou immediately fled from this place as quickly as possible. And just after Ren Tianyou left, at the location where he was standing just a moment ago, countless ferocious birds dropped there, and along with the loud sound of explosion, countless smoke of dusts rose in the air, which quickly spread in all direction. And this dusts enclosed Ren Tainyou too.</p><br/><p>Inside the cloud of dusts, the vision of Ren Tianyou was completely blocked, and his vision range also become a lot smaller.</p><br/><p>At that time, Ren Tianyou suddenly sensed a huge fluctuation in front of him, and the dusts which had filled the air was completely cut opened. Then he saw innumerable ferocious birds were rushing towards him.</p><br/><p>“Not good.” Ren Tianyou instantly used eye power of his right eye, then countless ferocious birds penetrated through the body of Ren Tianyou.</p><br/><p>Sensing countless ferocious birds were penetrating through his body, Ren Tianyou quickly jumped and landed on the top of a tree next to him.</p><br/><p>“Fu….” Ren Tianyou exhaled a long breath. Then looking down, he saw countless ferocious birds were flying in a low altitude, and most of them were fiercely staring at a single location. And when Ren Tianyou scanned at the location where these ferocious birds were staring, suddenly his eyes flashed with understanding.</p><br/><p>At the location where he was standing before fleeing, there were several ferocious birds, and these ferocious birds were pecking at the corpse of the blood beast which Ren Tianyou had cut into half. After seeing this, Ren Tianyou clearly understood that these blood beasts were attracted by the blood and flesh of the blood beast which Ren Tianyou had killed just a moment ago.</p><br/><p>Just then, the ground around him started to shook even more violently, and the trees started fall one by one. And then Ren Tianyou clearly saw innumerable rhinoceros like blood beasts with blood red eyes advancing towards the direction of Ren Tianyou.</p><br/><p>Seeing those innumerable rhinoceros like blood beast on the ground and furthermore those flying ferocious bird in the sky, Ren Tianyou instantly had a headache, “Ai, I, your father’s luck, just entered this place and already encountered this situation.” Seeing the circumstance around him, Ren Tianyou sighed with feeling, but there was not any trace of fear in his face.</p><br/><p>But this circumstance was caused by the mistake of Ren Tianyou, as he should have guessed that these blood beasts were sensitive to bloods. Because it was common knowledge that the magical beasts would flock around at the place where they smell the fresh blood.</p><br/><p>“Roar!” The rhinoceros let out a loud roar, their nose released a dense air, and staring at Ren Tianyou who was standing at the top of tree with their red eyes, they rushed towards him. Seeing the movement of these rhinoceros like blood beasts, the crowd of ferocious birds who were continuously circling in the sky also dived down towards the direction of Ren Tianyou.</p><br/><p>“Humph!” Seeing that the blood beasts were advancing towards him from both sky and land, the eyes of Ren Tianyou flashed with a pallid light, then he quickly made a series of hand seals.</p><br/><p>“Katon——Goka Mekkyaku! (Fire Style—-Majestic Destroyer Flame!)”</p><br/><p>Ren Tianyou placed his hands near his mouth, and after taking a deep breath, he spew out an ultra large scaled blazing flame from his mouth towards his front. After that his front immediately changed into a sea of flames, and all the trees around him were also ignited by this flame, surrounding those blood beasts.</p><br/><p>“Roar”, “roar”, “roar”………. The rhinoceros blood beasts on the ground who were surrounded by the fire, suddenly let out a loud roar. Many blood beasts were roasted alive by this flame, and the smell of burning meat spread in all direction. And many of the ferocious birds flying in the sky were also burned to death.</p><br/><p>But there were far too many blood beasts in this place, even though many of these blood beasts were killed by this flame, but that was only a single hair out of nine ox hides. And also due to the continuous death of the blood beast, their blood qi quickly spread in all direction, which attracted even more blood beasts in this place. And due to this blood qi, the eyes of all the blood beasts had turned red and were in frenzy. Now these blood beasts were rushing towards Ren Tianyou by stepping the corpse of their own kind, and also jumping into the fire.</p><br/><p>Ferocious birds in the sky were also in frenzy and they were violently flapping their huge wings creating a hurricane. And due to this hurricane, the Goka Mekkyaku (Majestic Destroyer Flame) of Ren Tianyou started to disperse. And under their joint command, that hurricane advanced towards Ren Tianyou.</p><br/><p>Seeing this, Ren Tianyou immediately stop Goka Mekkyaku (Majestic Destroyer Flame), after that he immediately jumped back. Just after Ren Tianyou had just left, huge hurricane collided this huge tree. Along with “hong” sound, this huge tree was instantly destroyed into pieces.</p><br/>\n</div>"}