{"title": "Chapter 146: Clearance", "id": 146, "volume": 2, "url": "http://boxnovel.org/in-different-world-with-naruto-system-chapter-146-clearance", "volume_title": "Volume 2", "body": "<h1>Chapter 146: Clearance</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 146: Clearance</p><br/><p>When Ren Tianyou said that he wanted to destroy Ximen clan, Li Xinyun instantly thought that Ren Tianyou was out of his mind, as he was actually thinking about destroying one of the 4 super big clan, Ximen clan of the Empire.</p><br/><p>As a member of Illusory Shrine which was one of the super big power of Divine Wind continent, she clearly understood the strengths of these so called super powers were not as simple as it seems on the surface. The actual strength of these super powers were very deep. For example, about the strength of her Illusory Shrine, everyone only knew the hall master and his 5 powerful subordinates, these 6 god ranked Illusion Gods, but she clearly knew that there were still many God-ranked hidden experts inside Illusory Shrine.</p><br/><p>“Are you crazy, actually thinking of attacking Ximen clan?” Li Xinyun stared at Ren Tianyou as if she was staring at a big idiot, and she couldn’t even guess why he wanted to attack Ximen clan.</p><br/><p>“Crazy? Maybe.” Hearing Li Xinyun, Ren Tianyou didn’t retort. In the eyes of other people, his action of trying to touch Ximen clan, this type of behemoth clan with only 3 peoples was only courting the death, but was it really like that, “Although I don’t know whether I can completely destroy Ximen clan or not at this time, but I am confident in destroying at least 2/3rd of its force.”</p><br/><p>“Are you really that confident?” After hearing the resolute and decisive voice of Ren Tianyou, Li Xinyun lightly asked with curiosity. She didn’t know what was giving him this much confidence, although she clearly knew that the strength of Ren Tianyou was not weak, and the other 2 member of organization were from ancient 100 clans, and their strength were also not weak, but one could say that this level of strength was merely a joke against Ximen clan.</p><br/><p>“This is not confidence, rather already planned fact of the future.” Ren Tianyou lightly smiled. Then he lifted his head, and looked towards the sky, his eyes seemed to penetrate the boundless void, and directly looked at situation of Ximen clan of Ailer Empire which was thousands of miles away. “And now I only need to make this future fact a present.”</p><br/><p>“Hee hee, if that is the case, I will also lend you a hand after we get out from here. When the time comes, I will also hurry to Ailer Empire.” Thinking a bit, Li Xinyun also decided to go to Ailer Empire.</p><br/><p>“You also want to go?” Hearing Li Xinyun, Ren Tianyou suddenly paused. He had never intended to let her join this fray, so he said, “What sort of joke is this, with your strength of only low-illusion saint, going to Ximen clan is just courting death.”</p><br/><p>“No matter what you say, I am also a member of our organization. Since this is the first action of our organization, how can I not participate in this?” Li Xinyun didn’t care about the dangers Ren Tianyou told her. Because the only reason she was living in this world was to kill Ling Yanqi, but she clearly understood that it was impossible to fulfill this aim relaying on Illusory Shrine, and she didn’t know how long it would take for herself to became powerful enough to kill him because when her strength increases, the strength of Ling Yanqi may also increase at that time. And now Ren Tianyou gave her a hope to achieve her aim of killing him, so she would naturally help Ren Tianyou to complete his task. “And I do not believe that you will not take care of my safety.”</p><br/><p>“Fine. Since it is like this, after you leave this place, directly hurry over to the imperial capital of Ailer Empire. And go to the 2nd floor of Heavenly fragrance restaurant of that city, White Tiger, Void and I arranged to meet at that place. And after you reach there, meet with White Tiger and Void, and show them your clothing and the ring. After they see your clothing and ring, they will recognize you as a member of Akatsuki.” Thinking a bit, Ren Tianyou agreed to Li Xinyun. When all was said and done, her ability may come in handy at that time.</p><br/><p>“Okay, I’ll get out from here now.” After hearing Ren Tianyou, a small transparent bead appeared in her right hand, this was the transfer bead to get out from this place which was to be used when one’s life was in danger.</p><br/><p>“Are you going out now? Could it be that you don’t intend to continue the test? You should know that the blood core of the blood beats of this Tower of Babel is very useful to increase your strength. And did you complete your test assignment? If you fail this time, then you have to wait for a year to come here again.” Seeing a transfer bead on her hand, Ren Tianyou asked whether she intend to abandon her test assignment.</p><br/><p>If one fails the test assignment of Tower of Babel, one needs to wait for a year and again had to complete refine with fire assignment, to get the chance to enter this Tower of Babel again. It is so because, although the cultivation environment of the academy was high-end, but it was also impossible for academy to provide unlimited supply, otherwise the academy would not be able to maintain the cost.</p><br/><p>“Since I have already found a way to get my revenge, as far as I’m concerned this test is of no point for me. So I don’t want to delay, and hurry over to Ailer Empire without wasting any time. Now I am more worried about whether I can cross two big Empire within 9 days or not.” Li Xinyun was actually frank about it, because she had come to study at the academy to quickly increase her strength so that she could get her revenge by killing Ling Yanqi, but now Ren Tianyou had agreed to help her, so she didn’t intend to waste her time in this place.</p><br/><p>Hearing Li Xinyun, Ren Tianyou was a bit curious about the hatred between her and this Ling Yanqi, in the end what kind of hatred was able to make one give up so many things and made them wanted to take the revenge by any means possible. But since Li Xinyun was unwilling to speak about it, he had also no intention of asking, because he know that even if he ask about it, it was extremely less likely to get an answer, besides he was also not interested to know all the matters of other peoples.</p><br/><p>“If that is the case, then its fine, just hurry over to Ailer Empire. I will also immediately rush over there after I handle the matter of this place.”</p><br/><p>“Okay, then I’ll leave first.” Li Xinyun agreed, then she crushed the transfer bead on her hand. After that a soft silver colored radiance suddenly wrapped the body of Li Xinyun and she disappeared form that place.</p><br/><p>“It seems I need to speed up the things here, I have wasted too much time here.” Seeing that Li Xinyun had already disappeared, Ren Tianyou murmured to himself, then he directly walked over to the small stone platform. After that he took out a card and insert that card inside the groove of that small stone platform. Suddenly golden colored radiances flashed from the stone platform, and 3000 points were added to his card. After that an entrance was opened on the barrier in front of him.</p><br/><p>Ren Tianyou stepped forward, and entered the entrance of this barrier, and along with the white light, he disappeared form the 1st domain.</p><br/>\n</div>"}