{"title": "Chapter 151: Before operation", "id": 151, "volume": 2, "url": "http://boxnovel.org/in-different-world-with-naruto-system-chapter-151-before-operation", "volume_title": "Volume 2", "body": "<h1>Chapter 151: Before operation</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 151: Before operation</p><br/><p>Standing at the edge of the huge crater, Ren Tianyou looked at his right hand, and saw his right hand was also slightly injured. Because he had use Rasen shuriken, his own right hand had also received the injury, but because the physique of Ren Tianyou was more powerful than Naruto due to taijutsu training for several years, he had received only light injury in his hand which was not that serious. But even like this, Ren Tianyou didn’t dare to use this move every so and often, as he had not learned sage mode yet, and also had not completely mastered Rasen shuriken. Ren Tianyou had used this move this time, because he wanted to perfectly understand the power of this technique.</p><br/><p>After that he jumped down to the bottom of the crater, then slowly walked towards Aibute who was currently laying on the ground. Arriving in front of the body of Aibute, Ren Tianyou saw that Aibute was continuously bleeding from his mouth and all over the body. It seems he won’t be able to live any longer.</p><br/><p>“Wicked human, it seems I still underestimated you. Cough cough.” Seeing Ren Tianyou, Aibute cursed to Ren Tianyou, but this affected his body which was riddled with gaping wounds, so he coughed few times, and large amount of blood flowed out from his mouth. “You brat, don’t be too proud of yourself, sooner or later we demon clan will definitely invade this Divine Wind continent again. That time will be arriving very soon, but it’s too bad, you will not be able to see that, because it is impossible for you to leave this place alive…………..”</p><br/><p>“Noisy!” Before Aibute was able to finish talking, Ren Tianyou coldly snorted, then his right hand drew his sword of kusanagi, and directly stabbed the neck of Aibute, ending his life. And along with the death of Aibute, the mission of Ren Tianyou was also completed. So inside his mind, he heard the system prompt about him obtaining 20,000 system points and the Shakuton (Scorch style) kekkei genkai (bloodline limit). Obtaining Shakuton (Scorch style) kekkei genkai (bloodline limit), Ren Tianyou didn’t feel pain like he did when he had obtained Shikotsumyaku (Dead Bone Pulse), the system suddenly released a golden colored energy which wrapped around his body, then he immediately sensed new power inside his bloodline.</p><br/><p>After that Ren Tianyou didn’t urgently rush to test out this newly obtained Shakuton (Scorch style), rather looked at a things inside the exchange system, “Hei hei. I was waiting to exchange this fellow for a long time, now it will be extremely interesting at Ximen clan.”</p><br/><p>Forcedly calming himself down, Ren Tianyou again looked at the corpse of Aibute, tightly held his sword of kusanagi and cut opened his heart. Afterwards he took out a black colored energy crystal. There was a black colored flame inside this crystal, this was the divinity crystal of Aibute.</p><br/><p>“Fu….., finally finished, now I should go out.” Packing up the divinity crystal, Ren Tianyou exhaled, and relaxed his body. But just when Ren Tianyou was getting ready to leave, suddenly a strange change occurred.</p><br/><p>A huge crack suddenly split open in the sky. And a terrifying space storm suddenly came out from inside this huge crack. And then, a huge black colored hand struck out from inside this space crack, and one of its huge finger poked towards Ren Tianyou.</p><br/><p>“Not good.” Seeing this sudden change, the eyes of Ren Tianyou showed a shocked expression. It was already too late to think, so he immediately poured out a huge amount of eye power from his both eyes, and a purple colored energy immediately started to appear on the surface of his body. And this purple colored energy condensed into huge demon god whose body was covered with purple colored flame energy.</p><br/><p>After that Ren Tianyou immediately controlled Susanoo, and placed Yata Mirror in front of his body. Just after that he heard ‘peng’ a loud sound, and then Susanoo accompanied by Ren Tianyou was directly sent flying by the poke of this this huge finger. Then after a while he heavily fell down on ground which was far away from his original location.</p><br/><p>“Cough cough!” Standing up, Ren Tianyou coughed few times, and spit out mouthful of blood from his mouth, and he also sensed that the qi and blood inside his body were rolling over and over. Although he was able to withstand this terrifying attack relying on Susanoo, nevertheless that huge force behind the attack still penetrated through his Susanoo, and directly affected his body, making him suffer form not that light injury. And to block that single attack, in a split second a huge amount of eye power was consumed. At that time his blindness value was instantly increased by 6%.</p><br/><p>“Cough cough, what the hell was that?” Recalling that terrifying hand of just a moment ago, the eyes of Ren Tianyou flashed with deeply shocked expression. Only a single move and he was seriously injured even after he had released Susanoo. Although he had just finished a battle, and had consumed not small amount of energy, nevertheless form his current state one could easily see the terror of this attack.</p><br/><p>Just at that time, Ren Tianyou suddenly saw a shadow in the sky again, so he raised his head and looked, and saw that the huge palm was again advancing towards him, “F**k, still coming.” Looking at the incoming palm, Ren Tianyou immediately cursed, and preparing to defend himself, he hastily re-activated Susanoo.</p><br/><p>But at that time, a large amount of gold colored energy suddenly appeared in the sky, which changed into a huge magic incantations, and stuck to this huge palm. Then this terrifying palm suddenly stopped moving.</p><br/><p>“What the hell is this now?” Looking at the thing that had suddenly appeared, Ren Tianyou greatly taken back, then he immediately roared excitedly, “Good opportunity.”</p><br/><p>Finished roaring, Ren Tianyou immediately dispersed the Susanoo, then his eyes instantly changed into Mangekyo Sharingan of Obito. After that he released a large amount of eye power form his right eye, then a spiral shaped space ripple appeared in front of him, which sucked in his own body, and he disappeared from that place.</p><br/><p>At the 1st floor of Tower of Babel, along with the spiral shaped space ripple, Ren Tianyou suddenly appeared in that place, then he sighed in relief. Taking the advantage of the sudden appearance of golden colored magic incantations which bound that huge palm, Ren Tianyou had used kamui to slip away form that place. There was not many time to think, so he crushed the transfer bead which was given to him by dean at the time of entering, after that along with the silver colored radiances, he again disappeared from there.</p><br/><p>And what Ren Tianyou didn’t know was, at certain mysterious space of Tower of Babel, which was thoroughly filled with terrifying gold colored energy, a voice rang out, “Ai, my power won’t be able to suppress these demon clan for too long time, furthermore from the other side of space transmission passage, that demon god is using his devildom’s world magic weapon to continuously bombard this passage. Currently even I don’t know how much longer I can hold on, I hope the 100 clans of the continent have already made their preparation.”</p><br/><p>“That boy form just a moment ago was quite interesting, although he was not that strong, still he was able to use many types of power including space power. I hope he can grow up before the catastrophe arrived and become one of the power of mankind.”</p><br/><p>…………..</p><br/><p>At the imperial capital Tianlong city of Ailer empire, red colored silk was tied all over the place of this city, and was filled with joyous atmosphere because tomorrow was the wedding day of the noble son of Ximen clan and eldest daughter of Wang clan. And the peoples of both clans had gathered here from 1 month prior to make the preparation of this wedding.</p><br/><p>When all is said and done, they were big clans, and marrying was a big matter, so they naturally won’t be careless on this matter. They had already send the invitation to all the people whom they should send. As early as 5 days before, all the people who had received the invitation had already arrived at Tianlong city in succession. Basically all the pub of this city were already full. Because many people were invited for this wedding, the clan head of Ximen clan had specially opened the Soaring dragon mountain villa for wedding ceremony which was outside the imperial capital in fear that the houses inside the imperial capital may be able to held all the people who were invited.</p><br/><p>In the sky above the Soaring dragon mountain villa, a huge phoenix was flying hidden within the clouds. On the back of this phoenix, two people wearing a black robe with red clouds imprinted on it were standing.</p><br/><p>“Tanyou, why on the earth are you drawing these things?” A beautiful woman with beautiful long hair looked at the man next to her who was drawing things in the scroll using a brush, and asked.</p><br/><p>“I draw these things so it is naturally useful, furthermore Vermillion Bird…..” Said the man who was drawing, and helplessly added, “Since now you have joined my organization, you should call me Zero, don’t always call me Tianyou Tianyou. Don’t you think calling me Zero gives you a kind of mysterious smart leader feeling?”</p><br/><p>These two peoples were naturally Ren Tianyou and Feng Wu who were at Tower of Babel. After coming out from Tower of Babel, Ren Tianyou directly handed over his card to Long Feilu completing his test assignment. Because Ren Tianyou had not delayed for a long time inside the Tower of Babel, and in addition there were many people for the test of Tower of babel daily, Ren Tianyou didn’t arise any suspicion from Long Feilu and returned to academy.</p><br/><p>After returning to academy, Ren Tianyou found a quiet corner and released Feng Wu from his kamui dimension. At first Ren Tianyou thought that she would seek to settle the accounts about the matter of suddenly getting absorbed into the kamui dimension, but who would had thought that she would continuously ask him about matter of that different dimension with full of curiosity.</p><br/><p>At that time, his expression was complex, his kamui dimension was suddenly exposed to her, and he also didn’t want to kill this girl. For such a beautiful woman, killing for no reason at all, Ren Tianyou’s conscience didn’t let him do so, as a result he directly invited her to join his Akatsuki organization. And Feng Wu also directly agreed to join, so Ren Tianyou gave her the position of Vermillion bird.</p><br/><p>But after interacting with her, Ren Tianyou finally understood the unreasonable and hard to deal with aspect of this woman, as she kept on pestering him with questions after questions. So Ren Tianyou was forced to divert her attention, he told her that he was going to Ailer Empire, told about his revenge matter, and also told about the matter he was going to do with other 3 members of organization. After hearing that she thought for a bit and directly agreed to follow him, so he asked the reason, and she simply answered like this, “Since you all are going, I will also naturally go, otherwise what is the point of joining the organization.” Next he went to say goodbye to Lan Yan and others, then he suck in Feng Wu inside his kamui dimension, after that use kamui to hurry over to Ailer Empire. On the way, Ren Tianyou used nearly 37,000 system points to exchange few things, for the preparation of tomorrow’s operation.</p><br/><p>It was already afternoon when they arrived at Tianlong city, so Ren Tianyou didn’t directly go to meet White Tiger and others, rather he released Feng Wu, let her summon her phoenix, and flew towards the site of tomorrow’s wedding, Soaring dragon mountain villa to make some advance preparation.</p><br/><p>……………….</p><br/><p>“Che, you are smart, but you are not that smart.” Hearing Ren Tianyou, Feng Wu coldly snorted with disdain.</p><br/><p>“Fine, I have already finished my preparation, let’s return and meet with White Tiger and others.” Ren Tianyou packed up the scroll and brush, then said to Feng Wu.</p><br/><p>“Okay.” Feng Wu agreed. After that she commanded her Golden winged phoenix to descend at the small forest near Tianlong city. After landing at the small forest, Feng Wu let Golden winged phoenix to return, and walked towards Tianlong city with Ren Tianyou.</p><br/><p>At the 2nd floor of the Heavenly fragrance restaurant of Tianlong city, White Tiger, Void and the Jade Meiden were sitting on the table, and were drinking wine feeling boring.</p><br/><p>“How come Zero have still not arrived here, the wedding is already tomorrow.” White Tiger drank whole cup of wine, and said.</p><br/><p>“I don’t know, I guess he is delayed by another matter.” Holding a cup of wine, without raising her head, Jade Maiden said.</p><br/><p>At this time, the voice of Ren Tianyou suddenly entered their ears, “What’s up, not meeting for few days and you are already missing me.”</p><br/><p>“Zero!” Hearing the voice, White Tiger and others immediately stood up and looked towards the direction of the voice, and saw Ren Tianyou and Feng Wu standing at the top of flight of stairs, smiling at them.</p><br/><p>“I thought you were going to be late, Zero.” Seeing Ren Tianyou, Jade Maiden said to Ren Tianyou with a smile.</p><br/><p>“Tomorrow is important day for me, so how can I be late?” Ren Tianyou said with a smile, then walked towards them and added, “This person next to me is new member of our organization, Vermilion Bird. Let’s go, we will talk about the operation of tomorrow inside the room.”</p><br/><p>“Okay.” Said White Tiger and others, then they followed Ren Tianyou to the room.</p><br/>\n</div>"}