{"title": "Chapter 152: Operation Start", "id": 152, "volume": 2, "url": "http://boxnovel.org/in-different-world-with-naruto-system-chapter-152-operation-start", "volume_title": "Volume 2", "body": "<h1>Chapter 152: Operation Start</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 152: Operation Start</p><br/><p>Inside the room of White Tiger, Ren Tianyou and others found a place to sit down, and started to discuss about tomorrow’s operation.</p><br/><p>“What’s the situation here, White Tiger?” Ren Tianyou asked looking at Li Jianrong.</p><br/><p>“Everything here is actually quite normal. Just like Lan Yan had said, Ximen clan have arranged Soaring dragon mountain villa which is outside the imperial capital as the location of wedding.” Hearing the question of Ren Tianyou, Li Jianrong answered and slowly explained the situation they had discovered, “And I reckon basically all the member of Ximen clan will show up at that time, with the exception of hidden old experts and few necessary personnel to take care of their house inside the city. From this, we can clearly see how much Ximen clan value this wedding.”</p><br/><p>“Of course they’ll value it greatly, after all it’s the wedding of my dear elder brother.” Hearing Li Jianrong, Ren Tianyou coldly smiled and said, “Since all of them will show up, then it is perfect chance to round up the whole clan at one fell swoop.”</p><br/><p>“So Zero, are we going to make a move inside or outside the city?” Li Xinyun asked to Ren Tianyou.</p><br/><p>“Of course, outside the city. It’s better for us to not make a move inside the city, as I recon there are many hidden old experts inside the city. So we should finish them off outside the city.” Ren Tianyou answered without any hesitation, because first he wanted to focus on those peoples who had bullied and humiliated him, as for those old bones, currently it was too hard for him to chew them, but if he killed all the people outside the city, then what could the remaining old experts, a general without an army do to him.</p><br/><p>“I still have a question.” Yan Xinluo looked at Ren Tianyou and slowly asked, “At that time, all the people of Ximen clan would definitely scatter in all direction and run away, so are we able to block all of them from running away with only few of us?”</p><br/><p>“You don’t need to worry about this, at that time I will create a barrier, and trap all of them within mountain villa. So not a single one will be able to flee form that place.” Replied Ren Tianyou, then he took out several scrolls which he had prepared before and hand it over to the 4 of them, “Carefully keep this scroll with you, and use this scroll to pass through the barrier which I will be creating at that time, otherwise touch the barrier and you will be severely injured.”</p><br/><p>Seeing that White Tiger and others took the scrolls, Ren Tianyou continued, “When the moment comes, I will enter the Soaring Dragon mountain villa alone first, and at that time, conceal yourself nearby until I gave a signal to move.”</p><br/><p>“Why?” Hearing Ren Tianyou, White Tiger and other asked, as they didn’t understand the intention of Ren Tianyou.</p><br/><p>“Because at that time there is bound to be many peoples entering Soaring dragon mountain villa. And all of these peoples are from various power of Divine Wind continent, so we can’t kill all of them, if we do so, then I recon we will just be waiting for a continent wide chase to kill.” Ren Tianyou rolled his eyes and slowly explained. “So at that time, I will enter alone and try to persuade them to leave but if they don’t listen to my advice, then they can’t blame me for being ruthless.”</p><br/><p>“And I also want to determine one thing at that time, I must clarify this matter, otherwise it will be extremely difficult for me to ease my mind for the rest of my life.”</p><br/><p>“If it is like that, then okay, we will wait for your signal.” After hearing Ren Tianyou, they naturally understood the thing Ren Tianyou wanted to clarify, so they didn’t say anything, just directly agreed to Ren Tianyou. And they also had confidence in Ren Tianyou as he had the ability to come out anytime he wanted with his space ability.</p><br/><p>“Okay, now we should rest, and restore our condition to its best state, for there will be a fierce battle tomorrow.” Since they had already planned their moves, Ren Tianyou let everyone to take a rest, and prepare themselves for tomorrow’s fierce battle.</p><br/><p>“Okay, Zero, you have just travelled from Supreme light academy to Empire, so you should also get some rest.” Li Xinyun looked at Ren Tianyou, and realizing that Ren Tianyou had just rushed over, and was very tired, she advised him to get some rest.</p><br/><p>“Okay, see you all tomorrow morning.” Ren Tianyou stood up, honestly speaking he was really tired because from the time inside the Tower of Babel, he had not rested once, and if he went to Ximen clan in this state, then it was just courting death.</p><br/><p>Ren Tianyou opened the door of a room, walked in and shut the door. Walking to the window of the room, he looked towards the direction of Ximen clan and recalled his circumstance in Ximen clan, then his eyes flashed with dense killing intent, “I am really looking forward to tomorrow.”</p><br/><p>……………….</p><br/><p>Early in the morning of next day, the streets of Tianlong city was bustling with noise and excitement. The streets were many times busier with many peoples, because today was the big wedding day of Ximen clan’s noble son and the Wang clan’s miss, so Ximen clan and Wang clan had dispatched many people to the streets, to ensure everything was absolutely safe.</p><br/><p>And those guests who had arrived at Tianlong city, had also woken up from their dream at an earlier time, then after washing off, they took the gifts and invitation card and walked towards Soaring dragon mountain villa outside the city.</p><br/><p>Soaring dragon mountain villa was something like a holiday villa outside the city for the member of Ximen clan which also had the function as a place of entertainment. Not only Ximen clan, other big power inside the city also possess such huge villas outside the city, because it could be said that the area covered by Tianlong city was extremely good, had a favorable climate throughout the year, and the value of the land around was also extremely good, so those big powers had occupied few villas in succession to use for the purpose of recreation place. Naturally they had also gotten the approval of the king of Ailer Empire.</p><br/><p>Today the Soaring dragon villa was dressed up with joyous atmosphere, all the servants within the villa was extremely busy, in the reception of many invited honored guests.</p><br/><p>And inside the Heavenly fragrance restaurant of Tianlong city, Ren Tianyou, White Tiger and others had also woken up early in the morning, and after they gathered together, Ren Tianyou directly opened their mouth, “Let’s go.”</p><br/><p>Finished speaking, they directly walked outside the city. Behind Ren Tianyou, Li Jianrong and others had worn the robe and the bamboo hat of Akatsuki organization. Then all of them walked towards Soaring Dragon mountain villa.</p><br/><p>Inside Soaring dragon mountain villa, many rooms were laid aside for banquet. Many fine liquor and dished were served on the table of those rooms.</p><br/><p>At the hall of this mountain villa, innumerable guests had already arrived right on schedule. The face of Ximen clan’s clan head Ximen Batian was filled with smile, next to him, extremely beautiful woman was sitting, this beautiful woman was the wife of Ximen Batian, and also the mother of Ximen Feng, Qian Meiyun. Next to them, myriad of clan elders were sitting. And as a main protagonist of this wedding, Ximen Feng was dressed in magnificent wedding dress, and was in the process of greeting those peoples of the same generation.</p><br/><p>Seeing that it was already about time, Ximen Batian spoke to his trusted aide, “Go and invite Yuxin.”</p><br/><p>“Okay, patriarch.” This trusted aid answered, then went to invite another main protagonist of this wedding——-Wang Yuxin.</p><br/><p>When Wang Yuxin who had worn a beautiful wedding dress came out with the support of two maidservant, basically all the men present on the scene were completely stunned, because in this dress Wang Yuxin looked just like a celestial goddess walking down to this mundane world from the heaven, and looked so beautiful that she attracted the gaze of everyone. But the eyes of this celestial goddess nevertheless was completely lifeless, there was not a single thread of spirit on it.</p><br/><p>Ximen Feng who was about to become the husband of this celestial goddess walked towards her with extremely excited expression, then he took her jade like hand from the 2 maidservants and walked towards the hall. When Ximen Feng had held her hand, the hand of Wang Yuxin had clearly struggled a bit at that time, but she gave up the resistance again. And along with the pull of Ximen Feng, Wang Yuxin walked towards to hall.</p><br/><p>Seeing that the main protagonists of this wedding had showed up, a middle-aged man wearing a red colored clothing walked towards the crowd of the peoples and cupped his hand, then opened his mouth, “First of all, on the behalf of Ximen clan and Wang clan, allow me to thank you all for accepting the invitation and making time in your busy schedule to attend this wedding ceremony, to send your blessing to the couple.”</p><br/><p>“The eldest son of our Ximen clan, Ximen Feng and the eldest daughter of Wang clan, Wang Yuxin naturally had favorable impression of each other from childhood, and had mutual admiration, now this couple is finally coming together, so let us use the most warm applause to send them………….”</p><br/><p>“Oh, it’s very lively here.” A simple and vigorous male voice suddenly sounded in this hall, interrupting the words of that middle-aged man.</p><br/><p>“Who?” Hearing this sentence, Ximen Batian stood up, and roared in a stern voice. And everyone on the scene looked towards direction of the origin of that sound.</p><br/><p>Then they saw the sudden appearance of a huge spiral shaped space ripple at the huge platform at the right part of the hall. And a man wearing a black robe with red clouds imprinted on it and a bamboo hat with wind-bell suddenly appeared at that huge platform.</p><br/><p>“Space magician!” Seeing the way this man had appeared, everyone present on the scene exclaimed, even the complexion of Ximen Batan became solemn.</p><br/>\n</div>"}