{"title": "Chapter 162: Reinforcements arrived", "id": 162, "volume": 2, "url": "http://boxnovel.org/in-different-world-with-naruto-system-chapter-162-reinforcements-arrived", "volume_title": "Volume 2", "body": "<h1>Chapter 162: Reinforcements arrived</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 162: Reinforcements arrived</p><br/><p>Under the incomparably alarmed and panicky gaze of Ximen Batian and others, the eyes of the 5 clones created by Ren Tianyou changed into Mangekyo Sharingan, and along with the release of huge amount of eye power from the eyes of these shadow clones, a red-purple colored ice-cold energy slowly appeared on the surface of these clones’ body, which rapidly condensed into the form of Giant Susanoo. And from these 5 giant susanoo, an extremely suffocating feeling spread in all direction.</p><br/><p>Seeing the sudden appearance of 5 giant susanoo, cold sweat flowed out from the forehead of Ximen Batian and others, after that Ximen Batian said stammeringly, “This………how can this be?”</p><br/><p>Behind these 5 Susanoo, Ren Tianyou jumped back and landed on the roof of courtyard, sat down crossed-legged, and opened his mouth, “Don’t you think it is fair now?”</p><br/><p>Then looking at Ximen Batian and others who were just standing their hesitating what to do, Ren Tianyou sneered, “What’s the matter, my dear father? Didn’t you say you will kill me to avenge those old guys? Now why are you mute? My fighting spirit is already ignited now, so you must adhere to the best”</p><br/><p>“Bastard.” Hearing the voice of Ren Tianyou filled of mocking tone, the complexion of Ximen Batian was red through and through, didn’t know whether it was due to was anger or embarrassment, then he cursed in rage. After that he spoke towards 2 dragons and 2 humans by his side, “You guys show me your fighting spirit, we have no other choice but to fight this together. Also the ancestor in the city ought to have already receive the news of this attack, so I think they should arrive here very soon. And after 10 minutes, Buluke will also arrive here with the main forces of dragon clan. When that moment comes, regardless of his strength, he will die without a place for burial. So we only need to hold on for ten minutes at most.”</p><br/><p>“Got it.” Hearing Ximen Batian, the fighting will slowly appeared in the eyes of 2 humans and 2 dragons, then firmly answered with determination.</p><br/><p>“Is that so?” Seeing the renewed fighting spirit of Ximen Batian and others, the eyes of Ren Tianyou lit up with understanding, then looking towards the direction of city he thought, “So the old fellows of Ximen clan are going to arrive very soon? Before that I must finish everything here.”</p><br/><p>“But I have never expected that the dragon clan will also involve themselves in this matter. Although I had already guessed this possibility, but this is little bit outside of my expectation. And according to the dragon that had left just a moment ago, the number of dragons coming here is unlikely to be small in number, furthermore they will arrive within 10 minutes at most. But that much time should be more than enough for me to settle everything here. As long as the peoples of this place dies, I don’t believe that it will not damage the vitality of you Ximen clan.” Ren Tianyou thought to himself, then immediately commanded the shadow clones with Susanoo to begin the attack.</p><br/><p>Along with the order of Ren Tianyou, his 5 clones with susanoo advanced towards Ximen Batian and others slowly surrounding them.</p><br/><p>“Lets go.” Seeing that 5 giant susanoo had stated to move, Ximen Batian gritted his teeth, then roared. After that he changed into golden light and took the lead to rush towards one of the Susanoo. Because the current situation didn’t let him to back down, there was no room to back down. So thinking that if he was to spare no effort and put his all into this fight, then perhaps there might be a chance for him to survive, he charged forward.</p><br/><p>Seeing Ximen Batian had rushed out, two humans and two dragons looked at each other, then they also quickly released their energy and rushed forward.</p><br/><p>“Swish!” The radiance of golden colored battle qi around the body of Ximen Batian who had taken the lead to fly towards one of the Susanoo increased, and the energy within his body violently rolled over and over. After that a large amount of energy appeared on the layer of golden dragon scale on the surface of his skin, then emitting a dim golden light, dragon scale slowly changed greatly. And 2 huge dragon horns slowly extend out from his head.</p><br/><p>“Roar!” Ximen Batian look up to the heaven and roared which was similar to dragon roar, then the energy within his body rapidly gathered in his right hand. When the energy of the whole body gathered to his right hand, his right hand rapidly became bulky. Afterwards he swung his right arm, then along with the piercing through the void sound, this fist directly hit the head of Susanoo, “Drop dead, bastard!”</p><br/><p>“Hong!” This punch which was filled with infinite anger and resentment of Ximen Batian directly hit that giant head of Susanoo. Then along with loud rumbling sound, this susanoo unexpectedly swayed. Although this was just a susanoo used by the shadow clone of Ren Tianyou which had very small quantity of chakra, nevertheless this also shows the strength behind this punch of Ximen Batian, furthermore his deep anger and resentment was also revealed form this.</p><br/><p>But even though Ren Tianyou admitted the destructive power of this punch was very astonishing, but resorting to this level of attack to destroy the susanoo of Ren Tianyou was still not adequate.</p><br/><p>This Susanoo simply raised its huge right hand, then directly slapped the whole body of Ximen Batian. “Swish!” Just like swatting the fly, Ximen Batian was directly slapped flying. His body directly changed into golden meteor, and directly shot towards the ground. After that along with a loud explosion sound, already broken and deformed ground was bombed again, making a new crater.</p><br/><p>On the other side, the fifth and sixth elder of Ximen clan were also engaging against the Susanoo of Ren Tianyou respectively. Although these peoples were rarely seen super experts on the outside, but meeting this Susanoo which was unshakable even by thunder, they could do nothing. They were continuously swatted like flies by the Susanoo of Ren Tianyou, afterwards they would stand up from the ground just like not dead cockroaches, and again continue to rush towards Ren Tianyou just to get swatted again.</p><br/><p>Ren Tianyou still clearly remembered that sentence of evaluation on the Susanoo of Itachi Uchiha by the black Zetsu which was possessed by Madara’s will power.</p><br/><p>At that time black Zetsu said that, the susanoo of Itachi Uchiha had Sword of Totsuka for attack. For defense it had Yata mirror, which could block and reflect all the ninjutsu, taijutsu, illusions and furthermore soul attacks. For long-range attack, it had Yasaka Magatama, so this made Uchita Itachi essentially invincible. Naturally this invincibility was not realistic, but from such a high rating, one could clearly understand the might of Uchiha Itachi’s Susanoo.</p><br/><p>Seeing the overall situation in front of him, made him certain of this, so he was relieved. The value of blindness of his eyes were in the process of decreasing continuously, because although the clones of Ren Tianyou could use their own Susanoo, but the blindness values of their eyes were actually continuously coming back to main body, so the blindness values were decreasing by 5 times more the usual.</p><br/><p>Ren Tianyou turned around and looked towards Ximen Feng and others at the backyard, and his eyes flashed with pallid light. His eyes were filled with deep hatred while looking at Ximen Feng and other junior member of Ximen clan who had bullied and humiliated him. He slowly scanned the faces of these people one by one, and slowly stood up intending to start dealing these guys.</p><br/><p>But just at that time, Ren Tianyou suddenly sensed that several powerful energies were approaching towards them. He raised his head and looked. Then he saw 3 huge golden lights were approaching towards him from the far-off horizon in a high speed. These 3 incomparably beautiful golden light stopped just outside the barrier Ren Tianyou had created, and these golden light slowly dissipated. After these 3 golden light completely dissipated, 3 hoary headed old men with terrifying aura leaking out from their whole body which was enough to suffocate other appeared at that location.</p><br/><p>“Finally came? Is seems time’s up, so I must finish off these 5 guys as soon as possible, then immediately withdraw. In any case after these peoples die, my goals will already have reached.” Seeing the experts of Ximen clan had arrived, Ren Tianyou’s complexion changed. Although there still was a barrier to stop them, but looking at them with his Mangekyo Sharingan, he clearly understood that these 3 were super-strong. The strength of each of these 3 men was even more powerful than the Low-god of demon clan whom he had encountered in Tower of Babel. And Ren Tianyou couldn’t determine whether he could escape unscathed from the encirclement of these 3 men.</p><br/><p>………………….</p><br/><p>At one of the mountain top outside the Soaring dragon mountain villa, a middle-aged person wearing a yellow colored robe of Emperor tightly knitted his brows seeing the appearance of 2 old men among these 3 suddenly appeared old men, “So these 2 old fellows really didn’t die.”</p><br/><p>“King father, I recognize only one of them, that one is the previous generation patriarch of Ximen clan, Ximen Kuang. But who are the other two people?” A handsome young man wearing a gorgeous expensive dress standing at the side of this middle-aged man slightly bowed, and respectfully asked. At the side of these 2 peoples, there were a group of bodyguards wearing a black colored suit of armor with black colored helmet. These body guards were firmly guarding their surroundings. If someone were to see this middle-aged person, then that person would definitely exclaim, “Your Majesty the king!”</p><br/><p>Correct, this middle-aged person really was precisely the king of Ailer Empire, Chen Wenxian, and that young man behind him that had asked him the question was the most outstanding prince among his numerous princes, and was also his next generation successor, Chen Yaxing.</p><br/><p>“Xing’er, these two people are very powerful experts who had stirred the whole continent 1000 years ago.” Chen Wenxian tightly wrinkled his brows, strong pallid light flashed in his eyes and he continued, “That lofty and rather sturdy figured fellow was once well-known Peak God ranked expert of that time, his name is Ximen Zhou. Once, in the magical beasts’ forest he killed a peak god ranked magical beast with a single punch, thereby becoming famous in whole continent. Finally it was said that he had gone to the endless seas and oceans territory, and challenged the sea clan of the endless sea in an attempt to break through the limit of his body, and advance to the boundary of god domain. But the news that he had failed and was buried in the sea forever spread out. But as it now seems that news ought to be the incorrect news Ximen clan had intentionally spread to confuse us. As a matter of fact, this guy had already successfully stepped into the boundary of god domain, obtained endless life span, and now has already entered the realm of High God.”</p><br/><p>“As for other person, more than 100 years after Ximen Zhou’s disappearance, he became Earth system Law God. Finally the news of his death while trying to enter boundary of God domain was also spread. It seems this was also done intentionally by Ximen clan. Now it is thoroughly clear that this fellow is also already at the realm of Mid-God. If not for this mysterious Akatsuki organization causing havoc in Ximen clan, which drew them out, we would still be on the dark. Truly hateful.” Saying this, Chen Wenxian clenched his hands into fists, and the domineering aura suddenly flashed from his body. As a king, he must not allow a power which he was incapable of controlling to appear in his sphere of influence, it could be said that the 4 major clans of imperial capital had already seriously threatened his imperial power. So Chen Wenxian was also continuously looking for a chance to completely eliminate these 4 major clan.</p><br/><p>But these 4 major clans were also not a fool, so via the various moves of Chen Wexian, they had already clearly sensed his intention. But resisting the whole imperial clan relaying on only their clan was still a bit overestimating themselves, so they thought to ally themselves through marriage. When 2 clans of these 4 clans allied together, even the power of imperial clan would not be able to move against them that easily.</p><br/><p>As a result when he heard Ximen clan and Wang clan was allying themselves by marriage, he was extremely mad, but he had no choice, after all currently he was moving against the 4 major clans in secret only. And when he was still thinking whether to shed all pretense of cordiality, the thing he had never thought would happen happened. During the big wedding of Ximen clan, a mysterious Akatsuki organization attacked the wedding site, and also set up a huge barrier surrounding the whole Ximen clan.</p><br/><p>When he heard this news, Chen Wenxian happily jumped, then immediately summoned the guards and quickly rushed over. And sure enough, just like the news said, a huge barrier had completely surrounded the whole Soaring dragon mountain valley. Although there were only few members in this Akatsuki organization, nevertheless the strength of each individual was very formidable, and especially the strength of the leader of the organization called Zero, was so formidable that it completely shocked Chen Wenxian. In extremely short period of time, he alone had already killed 2 god ranked experts. However seeing the death of these experts, he was also very happy inside his heart, “Due to this incident, the strength of Ximen clan is badly damaged.”</p><br/><p>……………….</p><br/><p>Seeing the appearance of these 3 experts of Ximen clan outside the barrier, Ren Tianyou decided to speed up the pace. He clearly knew that the barrier he set up would not be able to sustain for long time, so he must finish eliminating before they broke through the barrier. Thinking this, Ren Tianyou commanded to pick up the pace to his shadow clones who were fighting with 5 experts of Ximen clan, then he himself directly rushed towards the backyard where Ximen Feng and others were located.</p><br/>\n</div>"}