{"title": "Chapter 160: Tsukuyomi World", "id": 160, "volume": 2, "url": "http://boxnovel.org/in-different-world-with-naruto-system-chapter-160-tsukuyomi-world", "volume_title": "Volume 2", "body": "<h1>Chapter 160: Tsukuyomi World</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 160: Tsukuyomi World</p><br/><p>After finished using kamui, Ren Tianyou couldn’t help but to kneel down on the ground on his one knee, place his right hand on the ground to support himself, and used left hand to cover his left eyes which was tingling with pain. A large amount of cold sweats dripped down from his forehead, and he was continuously panting heavily. The stinging pain he was feeling in his left eye was continuously irritating his nerves, forcing him to helplessly grit his teeth. This negative repercussion of using kamui of his left eye, caused endless trouble for Ren Tianyou.</p><br/><p>Since he had already reached kage level, the amount of chakra consumed by the use of his left eye’s kamui was basically not much of a problem, but the burden this doujutsu placed in his left eye was still extremely big. That distorting space attack of the left eye’s kamui could be said to be an attack that is impossible to guard against, and even the strongest defense was just like a paper without any effect against this attack.</p><br/><p>Nevertheless as this attack possess advantages, simultaneously it also possess disadvantages. It heavily burdens the eyes itself, and also heavily harms them. Unless Ren Tianyou advance his eyes to Eternal Mangekyo Sharingan, he couldn’t get away with these disadvantages. Although he could use system points to prevent himself from becoming blind even without advancing to Eternal Mangekyo Sharingan, but he had no way to through erase all these harms his eyes itself had suffered, and these harms will have extremely big effect in the strength of Eternal Mangekyo Sharingan when he awakened it in the future. The reason why Ren Tianyou sometimes would rather expend a huge amount of his strength to deal with the enemy, in place of easily dealing with them by using his doujutsu were, one was Ren Tianyou wanted to increase his own strength, after all experiencing life and death fights would provide great help in improving his strength; second was to have a greater foundation when he advanced his eyes to Eternal Mangekyo Sharingan in the future, like this the strength of Eternal Mangekyo Sharingan he obtained would also be even more powerful.</p><br/><p>……………….</p><br/><p>Just at this time, suddenly a huge energy fluctuation came through underneath the huge earthen lid that was created by the use of earth style ninjutsu by Ren Tianyou, directly sending this earthen lid flying. Shortly afterwards 3 huge dragon form light beam rose from that place, which hit that flying earthen lid. Then along with the loud ‘hong’ explosion sound, this huge earthen lid was directly bombed to disintegrate. And the small pieces of rocks flew about in all direction.</p><br/><p>Along with the disappearance of earthen lid, the figure of Ximen Batian and other 2 whose whole body was emitting golden saint dragon battle qi became visible. And a powerful aura was quickly spreading in all direction from their their bodies. But when their gaze arrived at the headless corpse of Old Seven lying on the ground not far away from them, from which blood was still unceasingly flowing out, their bodies suddenly quivered, then their eyes instantly become red, and loudly roared, “““Old Seven!””” Then they immediately started to run towards the side of the corpse of Old Seven.</p><br/><p>Seeing Ximen Batian and other 2 going crazy, a sneer appeared on the face of Ren Tianyou, then coldly snorted, “Is it unbearable? Compared with those suffering you gave me, this is still far from enough.” Finished speaking, he quickly made a series of hand seals.</p><br/><p>“Katon——Gokakyu no Jutsu! (Fire Style—-Grand Fireball Technique!)”</p><br/><p>Finished making hand seals, Ren Tianyou took a deep breath, and immediately spat out a blazing hot huge fire ball from his mouth, which advanced towards them in a high speed.</p><br/><p>Seeing the path of huge fire ball spat out by Ren Tianyou, Old Four looked at the headless corpse of Old Seven lying on the ground in front, then he immediately stopped his steps and opened his mouth. After that along with a loud dragon roar, the golden lights of golden saint dragon battle qi all over his body suddenly rose rapidly and sharply, then the dragon scales on his body suddenly increased rapidly, and 2 very small dragon horn slowly stuck out from his forehead, “You damned bastard, I will tear you to pieces.”</p><br/><p>Finished roaring, his body quickly turned into a huge golden light and directly appeared in front of the Gokakyu no Jutsu (Grand Fireball Technique) of Ren Tianyou. After that he didn’t try to dodge or avoid, but directly collided with this huge fire ball. And as if his body had changed into a sharp sword, he directly cut open this huge fire ball from the center. The boundless blazing hot flame didn’t even stopped his steps, and he directly rushed towards Ren Tianyou.</p><br/><p>Seeing his Gokakyu (Grand Fireball) had no effect, Ren Tianyou also stopped maintaining this jutsu, so as to not waste his chakra in vain. After that his Mangekyo Sharingan firmly scanned the whole body of Old Four, then he instantly became clear.</p><br/><p>“So that’s why his strength suddenly rose sharply like this, and was actually able to forcibly cut open my Gokakyu (Grand Fireball) by only his physical strength. He unexpectedly burned his power of blood lineage.” With his eyes, Ren Tianyou clearly saw that the source of battle qi in the middle of the dantian of Old Four was rapidly burning, and the golden colored power was flowing in his whole body just like a liquid, “However how long can you persist in forcibly increasing your strength like this?”</p><br/><p>Looking at Old Four who was rushing towards him, Ren Tianyou slowly shook his head, then a powerful lightning chakra suddenly appeared on the surface of his body, after that he immediately changed into lightning beam, and directly appeared in front of Old Four, then his right hand directly attacked the body of Old Four. But the expression of Ren Tianyou immediately had a huge change, because even after he used lightning chakra to increase his power, his right hand unexpectedly as if hit the steel plate, not only didn’t cause injury to Old Four, but he actually felt tingling pain in his right hand due to the repulsion power of dragon scale.</p><br/><p>“How is this possible? His defense power is actually this powerful.” Ren Tianyou was greatly taken back, but just at that time, he suddenly sensed two hands had firmly clutched his right hand, and looking at Old Four, he saw that the saint dragon battle qi around his body had suddenly rose sharply, and with a ruthless smile in his face, Old Four said, “Although your speed is very fast, but your attack power however is very weak. With this level of attack, you are powerless to break through the defense of dragon scales on my body. Now I have caught you, I will not give you any opportunity to escape. Now I will tear you to shreds and avenge eldest brother, second brother and Old Seven.”</p><br/><p>Finished speaking, the grasp on the right hand of Ren Tianyou suddenly tightened, and he felt a strong power was incoming towards his right hand. But the lightning armor on the body of Ren Tianyou firmly obstructed it, but although the lightning armor was powerful, still Old Four who had obtained the power of Ancient Saint Dragon was even more powerful, so the unceasingly twinkling radiances of lighting armor on the body of Ren Tianyou were continuously becoming weaker. And the lightning defense membrane of lightning armor was slowly being pressed against his body.</p><br/><p>“You are quite powerful, merely I don’t know whether your illusion resistance is this powerful too?” Sensing a peculiar feeling in his right hand, the eyes of Ren Tianyou also flashed with strange feeling, as had never though that the strength of this fellow who had only changed into half-dragon had actually reached to this level. Afterwards looking at Old Four who was firmly staring at his own eyes, Ren Tianyou smiled, then his left eye quickly rotated and changed into the Mangekyo Sharingan of Uchiha Itachi. Immediately after that huge amount of invisible eye power gushed out from his left eye, which seeped into the eyes of Old Four who was firmly staring at him.</p><br/><p>“Tsukuyomi!”</p><br/><p>When he was preparing to use his temporarily gained powerful strength to crush the hand of Ren Tianyou, Old Four suddenly discovered the huge change in the eye of Ren Tianyou. The patterns inside the blood-red pupil quickly rotated, then he unexpectedly felt a wave of dizziness, then he felt that 7 or 8 pairs of blood red eyes appeared in front of him while he was in trance, after that his consciousness slowly disappeared.</p><br/><p>When he recovered his consciousness, Old Four shook his head and wanted to use his hands to rub his dizzy head, but he suddenly discovered that he couldn’t use his hands. After that his mind immediately became clear, and he carefully observed his own body, but his pupils immediately shrunk seeing that his body was actually tied against the huge cross, and his body was also already returned to normal state from dragon change state. Just when he wanted to use saint dragon battle qi to struggle free from the cross, he was greatly shocked, because he suddenly discovered that no matter what he tried, he unexpectedly couldn’t use a shred of his strength.</p><br/><p>After that he raised his head, and carefully observed the surrounding all around him. He saw that all around him, there was only boundless gloomy environment, and there was also a gloomy full moon in the gloomy sky.</p><br/><p>“Where is this? Wasn’t I about to crush the hand of that dammed bastard? So how can I appear here? What the hell is going on?” Many doubt appeared in his mind, the he suddenly thought about a possibility, “Is all of this an illusion?”</p><br/><p>“Your mind is moving very fast, correct, this indeed is illusion.” At this time, a soft voice suddenly came from in front of him, so Old Four immediately looked in front of him and saw the silhouette of Ren Tianyou who was wearing black robe with red clouds imprinted on it, was slowly appearing. After appearing, he slowly walked towards him.</p><br/><p>“What the hell is this place?” Seeing Ren Tianyou slowly walking over, Old Four who was tied on the cross quickly struggled to free his body, but it was just a futile effort, no matter how much he struggled, the shackles which had tied his hands and legs remained absolutely still.</p><br/><p>“Welcome to my Tsukuyomi world. In this space, time, mass and everything else are under my absolute control. Here in this space I am God.” Looking at Old Four who was tied on the cross, the face of Ren Tianyou revealed a bloodthirsty ruthless smile. Then he stretched his right hand, and a sharp sword appeared in is hand, “For next 72 hours, I will nicely repay you the favors given to me by your Ximen clan.” After speaking, Ren Tianyou slowly walked towards his side while holding that long sword.</p><br/><p>“What the hell do you want to do, you bastard?” Seeing Ren Tianyou was holding a long sharp sword which was glimmering with dazzling gleam, all the fine hairs on his body couldn’t help but stood up, so he roared towards Ren Tianyou in horror.</p><br/><p>“Humph!” Ren Tianyou coldly snorted, then he directly stabbed the abdomen of Old Four with the long sword in his right hand, then twisted his hand, causing the sword to quickly stir inside his body.</p><br/><p>“Ah!” After he was stabbed by this sword, Old Four immediately felt boundless pain which was directly poured into his brain, and flooded his sea of consciousness with this boundless pain. He firmly clutched his hands into a fists, and his eyes almost popped out due to pain.</p><br/><p>After twisting the sword, Ren Tianyou pulled out the sword. After the sword left from his body, the wound on the body of Old Four due to the stab also slowly healed thoroughly, as if he had never gotten stabbed.</p><br/><p>“Huhu……….huhu………..” Old Four continuously gasped for a breath, that boundless pain of just a moment ago almost thoroughly submerged his sea of consciousness, “Don’t panic, don’t panic, this is merely an illusion, everything is fake, everything is fake.”</p><br/><p>“Although this is fake, but the pain nevertheless is real, and all the pain suffered here is several times stronger than the outside world.” Hearing the muttering of Old Four, Ren Tianyou coldly snorted in disdain, then again directly stabbed his body.</p><br/><p>“Ah………” As the sword again stabbed his body, Old Four couldn’t help but again screamed, and thought, “How could there be real illusion like this? Could it be that this is his power of blood lineage?” Old Four suddenly recalled that he was firmly staring at those pair of demonic blood-red eyes before he was trapped in this illusion.</p><br/><p>“It is useless even if you understand my ability, in front of absolute strength, all the struggle is just a futile effort.” Ren Tianyou pulled out the sword and lightly said. Afterwards countless thickly dotted Ren Tianyou who were also holding sword appeared beside him. And all of them slowly surrounded the cross where Old Four was tied.</p><br/><p>“This is……” Seeing the sudden appearance of countless thickly dotted Ren Tianyou who were also holding the sharp sword, the complexion of Old Four had a huge change, and his body slowly started to tremble due to fear.</p><br/><p>“Now enjoy your final 72 hours.” Seeing the change in the complexion of Old Four, ruthless smile appeared on the face of Ren Tianyou, then countless Ren Tianyou in the Tsukuyomi world continuously stabbed his body with their sword.</p><br/><p>“Ah…………!” A horrible shriek reverberated in this Tsukuyomi space. Countless figure of Ren Tianyou kept on stabbing through his body with their swords.</p><br/><p>………………</p><br/><p>72 hours in Tsukuyomi world was just an instant in outside world. So everyone just saw that the saint dragon battle qi around the body of Old Four slowly weaken itself, and the dragon scale on his body due to his half-dragon change state also slowly disappeared, then his body returned back to normal state.</p><br/><p>“3 days inside that space is merely an instant in the outside world.” Seeing the familiar scene around him, this was the last sentence flashed in the mind of Old Four. After that he directly fainted, and his body powerlessly fell down.</p><br/><p>“Old Four!”</p><br/><p>“What happened? Elder brother Four!”</p><br/><p>Seeing the sudden collapse of Old Four, Ximen Batian and Old Five immediately exclaimed loudly. Then they directly started to rush towards Ren Tianyou from the side of that headless corpse of Old Seven.</p><br/><p>“Only rushing now. Its already too late.” Seeing Ximen Batian and Old Five rushing towards him, Ren Tianyou sneered with disdain, then grasp the body of Old Four with both of his hands and lifted it up above his head. After that very quickly powerful lightning appeared form his body which covered his hands and also his whole body.</p><br/><p>“Raiton—-Raiga Bomu! (Lightning style—-Liger Bomb!)”</p><br/><p>Ren Tianyou loudly yelled, then he violently smashed the unconscious Old Four head first onto the ground under the grief and indignation gaze of Ximen Batian and Old Five. When the body of Old Four was violently smashed to the ground, a huge amount of lightning also fell onto the ground, and spread to the area of 5 or 6 meters in radius.</p><br/><p>“Hong!” Along with the loud explosion sound, the ground was completely scattered and with Ren Tianyou as a center, a powerful shockwave spread in all direction. Ximen Batian and Old Five were forced to retreat by this shock wave, only after retreating more than ten steps, they were able to stabilize their body.</p><br/><p>After that they hastily looked in front of them, and seeing the scene before their eyes, the eyes of both of them immediately became thoroughly red, then both of them roared loudly.</p><br/><p>“Old Four!”</p><br/><p>“Elder Brother Four!”</p><br/><p>………………..</p><br/><p>Due to the Raiga Bomu (Liger Bomb) of Ren Tianyou, the body of Old Four was folded just like a folding bed, the skeleton of his body were directly snapped off from the flank, and had already died. Perhaps if he was still on the dragon change state, then there might be a small possibility for him to obstruct this attack of Ren Tianyou. But spirit of Old Four was already heavily damaged by Tsukuyomi, and had passed out, so there was absolutely no chance for him to survive this attack.</p><br/><p>Ren Tianyou stood up, looked at the already dead Old Four, then directly sent the corpse flying towards Ximen Batian and Old Five with a kick, “My dear father, now you should be able to slightly experience my pain.”</p><br/><p>“Old Four!”</p><br/><p>“Elder brother Four!”</p><br/><p>Seeing the corpse of Old Four which was sent flying towards them with a kick, Ximen Batian immediately caught it, placed it on the ground, and anxiously roared. But seeing Old Four was not breathing anymore, Ximen Batian and Old Five raised their face full of tears, stared Ren Tianyou in front of him and roared, “You unfilial son, I will kill you to avenge Number One, Old Two, Old Four, and Old Seven. I will personally kill you, definitely.”</p><br/><p>“Ha ha, kill me, do you have ability? Compared to the pain that your Ximen clan had given me, this is still far from enough. How did you all insult and humiliate me, I remember everything here.” Ren Tianyou pointed his heart with his finger, and continued, “Every single time you all humiliated me, it was printed directly in my heart. Just because my mother was a servant-girl, and I didn’t possess the Saint dragon blood lineage of Ximen clan, you all just wantonly bully and humiliate me.”</p><br/><p>“Now I already obtained formidable strength. So right now….” Ren Tianyou pointed to the Ximen Batian with his finger, “I am going to use my power and thoroughly destroy Ximen clan.”</p><br/><p>“You bastard, don’t think you will prevail.” After Ren Tianyou had just finished speaking, suddenly the voice filled with hatred came from behind him. A golden light was rushing towards him from behind him, this was Old Six who had stayed behind to protect the junior member of Ximen clan. After seeing 2 of his brothers were killed, he couldn’t bear any longer, so taking this chance, he suddenly shot towards Ren Tianyou from behind him, and tried to stab Ren Tianyou with his huge sword from behind.</p><br/><p>“Zero!”……….</p><br/><p>Seeing the Old Six was suddenly launching a surprise attack from behind Ren Tianyou, White Tiger and others who were in standby near the wall, suddenly cried out in alarm. Since they were only paying attention to the fights, they were not able to notice the surprise the attack of Old Six in time, so they just nervously roared.</p><br/><p>Hearing the voices from behind him, Ren Tianyou turned around his head, then saw that Old Six was already near him. And with a hideous expression on his face, Old Six stabbed towards Ren Tianyou. “Go to hell, you bastard.”</p><br/><p>Seeing that the stab was already near him, both of his Mangekyo Sharingan which belong to Uchiha Itachi quickly rotated, then a large amount of eye power flowed out from both of his eyes.</p><br/>\n</div>"}