{"title": "Chapter 173: Super powerful attack", "id": 173, "volume": 2, "url": "http://boxnovel.org/in-different-world-with-naruto-system-chapter-173-super-powerful-attack", "volume_title": "Volume 2", "body": "<h1>Chapter 173: Super powerful attack</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 173: Super powerful attack</p><br/><p>After formulating the next action plan, Ren Tianyou began to quickly make a series of hand seals. Even the eyesight of these High God realm Ximen Zhou and others were only able to see blurs, nothing more. After battling against Ren Tianyou, these peoples were already clear that Ren Tianyou would always make a series of those hand seals before he release any magic skill. So these dragons and Ximen Zhou were secretly watching out for these movements.</p><br/><p>But the next jutsu released by Ren Tianyou surprised all of those peoples, as, before he completed making a series of hand seals, Ren Tianyou yelled loudly, “Doton—-Doryu Joheki! (Earth Style—-Rampart of Flowing Soil!)”</p><br/><p>Along with the voice of Ren Tianyou, the ground in front of them began to tremble violently. After that along with ‘ka ka’ earth splitting sound, huge earthen wall broke out from the ground in front of them, and completely blocking Ren Tianyou from their line of vision.</p><br/><p>“This is……?” Seeing the rise of earthen wall which was just like city wall, Ximen Zhou and those 5 dragons were confused. They didn’t understand why Ren Tianyou did this, suddenly a light flashed in their brain, and all of them simultaneously thought one possibility.</p><br/><p>“Could it be that he want to flee?” Ximen Zhou and 5 dragons simultaneously thought this possibility. After that they glanced at each other, then Ximen Zhou immediately changed into a golden light and rushed forward. After that golden radiances covered his right arm’s fist, then his fist started to release a destruction aura in all sides. And far behind him in the sky, those 5 dragons opened their mouth, then a mysterious low and deep voice reverberated from inside their mouth. Then powerful element power from the air around them gathered towards their body. All of them were starting to prepare draconic magic.</p><br/><p>At this time, a huge sand wave suddenly rushed forward from behind the earthen wall. After that with the momentum to cover the sky and earth, it rushed towards Ximen Zhou, wanting to thoroughly bury his body inside this endless yellow sands. With no other choice, Ximen Zhou was forced to stop and struggle weakly to free himself form these sands.</p><br/><p>Right after that, a huge figure suddenly jumped up towards the sky from behind the earthen wall. Looking carefully, this was Ren Tianyou who was covered by purple colored huge demon god. And a powerful purple grey colored lightning was unceasingly flickering on the body of this huge demon god. And both hands of this demon god were holding long narrow swords which were emitting purple lightning.</p><br/><p>Ren Tianyou looked at those 5 dragons who were continuously gathering the power of elements towards their body. Now in the sky they had successfully condensed 5 huge element light balls, and from it powerful energy fluctuation were spreading in all directions.</p><br/><p>“Humph!” Ren Tianyou coldly snorted, then he raised both Futsu no Mitama in both hands of Susanoo towards the sky as it flashed with lightning. The along with a swing of these swords, 7 or 8 huge lightning blade flew towards those 5 dragons.</p><br/><p>Just when the lightning blades were about to reach them, Holy dragon Xilaisite send forth 5 light system energy balls. These energy balls changed into a protective screen in front of these 5 dragons, which successfully blocked the attack of Ren Tianyou.</p><br/><p>After that Flame dragon Adilasa, Ice dragon Keluoyi, and Death dragon Buliqite simultaneously completed the preparation of their magic. Along with 3 loud dragon roars, one red, one white, and one grey, three huge energy dragons flew out from that energy balls above their head. Then mutually spiraling in the sky, these 3 lights directly attacked Ren Tianyou’s susanoo.</p><br/><p>Along with a ‘hong’ loud explosion sound, Ren Tianyou’s giant Susanoo was directly hit and sent flying. Then along with a loud sound, it fell on the ground.</p><br/><p>And after Ren Tianyou fell on the ground, the energy ball above Earth dragon Andongni just like a meteor, fell on the ground. And along with a cracking sounds, 4 huge earthen wall suddenly grew out from the ground, trapping Ren Tianyou who was accompanied by Susanoo inside them. After that from the sky above, huge earthen lid descended on the top of 4 walls, directly covering the space above. Now Ren Tianyou was thoroughly surrounded from all sides.</p><br/><p>After Ren Tianyou was thoroughly trapped, suddenly rich amount of earth system elements rose in all direction of these 4 walls. And along with the continuous gathering of this earth system elements, 4 huge earth cannon which were several meters in length suddenly appeared in the sky. After that under the control of Andongni, these cannons attacked towards these earthen walls. From this appearance, it seems it intends to thoroughly disheartened Ren Tianyou.</p><br/><p>But just at that time, from inside that huge earth prison, suddenly huge purple colored lightning rose, and the earthen walls all around continuously trembled. After that large number of cracks appeared on the walls, as if something terrifying was about to break out from inside.</p><br/><p>Along with a ‘hong’ explosion sound, 4 huge lightning sword blade sprang out from inside that earthen prison, by splitting all these earthen walls. And this sword blade also successfully cut those huge 4 earth cannons into pieces.</p><br/><p>Looking carefully at the source of these sword blades, one could see that the purple grey colored lightning was flickering even more violently above the suit of armor of Ren Tianyou’s Susanoo. Suddenly, Ren Tianyou immediately stepped on the ground, and jumped. Continuously jumping, he along with Susanoo finally stood in the sky. After that looking at two Futsu no Mitama in both of his Susanoo’s hand, Ren Tianyou suddenly had an idea. Susanoo suddenly placed its hand together, and the two Futsu no Mitama merged together. After that along with even more violent glimmering of purple grey colored lightning, even more longer Futsu no Mitama appeared in the hands of Susanoo.</p><br/><p>And along with the appearance of this long sword, cold sweat appeared on the forehead of Ren Tianyou, both of his hands unceasingly trembled, and the blindness points of his eyes suddenly began to decline very quickly. Originally the blindness value would increase by 1% after every 1 minute, but now in every 3 seconds, 1% would increase. Along with the thought of Ren Tianyou, Susanoo slowly raised this long sword, as if raising this sword costs large amount of its efforts.</p><br/><p>Slowly this long sword was raised above the head of Susanoo under the command of Ren Tianyou. And then, suddenly a dazzling lightning appeared on this ultra large Futsu no Mitama.</p><br/><p>Along with a clacking sound just like a clap of thunder sound, this huge Futsu no Mitama sword directly slashed from high up in the air. After that 30 or 40 meters long ultra large lightning sword blade as if it possess the power of the creation of heaven and earth, directly fly out from Futsu no Mitama sword towards those 5 dragons.</p><br/><p>“Not good, everyone scatter!” Seeing this huge sword blade, the huge dragon eye of Death dragon Buliqite firmly shrunk, and he immediately felt chill. There was not enough time to think, so he immediately released large amount of dense death fog from his body.</p><br/><p>“Death pulse!”</p><br/><p>Along with the roar of Buliqite, this dense fog suddenly gathered at one point, then a powerful shockwave spread in all direction which directly hit the 4 dragon at his surrounding and sent them flying. But just after this, that huge lightning sword blade directly streaked pass from its body. There was not even a slightest bit of resistance, and all the movement of Buliqite also suddenly stopped.</p><br/><p>After passing through the body of Buliqite, that huge lightning sword blade still continued to fly onwards, and hit the mountain. And along with a ‘hong’ sound, this mountain was directly cut into two half by this sword blade. And the indistinct horrible scream came through this mountain, it seems someone unlucky lost their life from this attack of Ren Tianyou.</p><br/><p>Only after this, a long line of blood slowly appeared on that huge dragon body of Buliqite. After that along with ‘puchi’ sound, large amount of blood spread in all direction, and the body of Buliqite directly spilt into two as it fell down towards the ground.</p><br/><p>And in the distant, after using this one move, Ren Tianyou directly felt powerless and knelt down in the sky. And the Susanoo around his body also slowly changed into energy and dissipated. Large amount of cold sweats were dripping down from his forehead, and he was unceasingly gasping for air too.</p><br/><p>“Hu, didn’t……..didn’t expect the side effect of this move is unexpectedly this big. My eyes almost lost its sight.” Currently the surrounding all around him seen with his eyes were extremely blurred, and he was basically not able to see anything a bit far away, as if he had more than 800 degrees of myopia. And looking at the blindness value of his eyes, just now in that split seconds, his blindness value had already reached 67, almost reaching 100 and becoming blind for real. And the move of just a moment ago was the true might of his Susanoo which Ren Tianyou was able to bring out to play after gathering his power with great difficulty. Now it seems like, although the power was extremely powerful, but the side effect was also not that small.</p><br/><p>Ren Tianyou looked at his system points, after passing through these several battles, Ren Tianyou had already accumulated nearly 50,000 system points. Killing that High God realm dragon gave him 20,000 system points, Ximen Wuyan gave him 10,000 system points, furthermore there were several others who gave him system points, so now he had plenty of system points. Ren Tianyou used almost 4,000 system points to finally thoroughly restore his vision. But the almost empty chakra reserve inside his body and unceasingly tingling pain in his both eyes, repeatedly warned Ren Tianyou of his injuries.</p><br/><p>“Ai, even if Shukaku completely replenish my chakra, still it would be best to not use my doujutsu for the time being. If by any chance an injury is left behind in my eyes, then that would be very bad.” Although he could restore blindness value with his system points, but he nevertheless was powerless against the injuries caused in eyes after using doujutsu. So to avoid getting any big injury to his eyes, Ren Tianyou didn’t use doujutsu unless it was the absolute necessity circumstance, otherwise Ren Tianyou would have spammed Amaterasu in succession, or continuously use kamui of left eyes which was able to avoid any attacks and so on.</p><br/><p>At this time, those 4 dragons who were send flying saw the split into two corpse of Buliqite, immediately after that all of them let out a loud sorrowful dragon roar, and quickly flew downwards towards it. But someone else was faster than them. Leaving behind after image, Ren Tianyou directly appeared at the side of Buliqite’s corpse. After that using the Kusanagi sword in his right hand, he directly cut open its head, then using some strength on his sword, the divinity crystal which was releasing death fog flew out and fall in the hand of Ren Tianyou.</p><br/><p>Just after that, movement sound came from above him. Ren Tianyou didn’t even need to guess, as he knew that those dragons had arrived. So without even looking, he quickly rushed towards Shukaku. With the current state of his body, if he was to face experts of god domain, he would definitely be in danger, as without any chakra inside his body, he was basically unable to continue to fight.</p><br/><p>“Bastard, don’t run!”</p><br/><p>“You damn bastard, I am going to tear you to shreds.”</p><br/><p>…………Seeing that after killing Buliqite, even his divinity crystal was also not spared by Ren Tianyou, these 4 dragons instantly became even angrier, and began to directly chase Ren Tianyou. Because of low chakra, the speed of Ren Tianyou was not that fast, so the dragons were gradually catching up to him. When Ren Tianyou was feeling anxious, suddenly yellow colored sand appeared at his side, changed into huge palm and catching his waist, quickly flew back.</p><br/><p>Ren Tianyou directly appeared on the head of Shukaku, just when Ren Tianyou was about to thank, the earthen wall suddenly collapsed, and the huge figure of Matatabi appeared. And above its mouth, one ultra large essence energy ball was floating.</p><br/><p>Support me through patreon to get early access and other bonus. Here is the link.</p><br/>\n</div>"}