{"title": "Chapter 175: Renowned “Akatsuki”", "id": 175, "volume": 2, "url": "http://boxnovel.org/in-different-world-with-naruto-system-chapter-175-renowned-akatsuki", "volume_title": "Volume 2", "body": "<h1>Chapter 175: Renowned “Akatsuki”</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 175: Renowned “Akatsuki”</p><br/><p>Ren Tianyou forcedly calm down his state of mind which was in the state of shock seeing the result of Matatabi’s bijudama, as well as he discarded other thoughts too. Although he was totally looking forward to the power of kyubbi ‘Kurama’ and Jubi ‘One-Eyed God’, but these creatures were extremely far away matters for current him. Because even if he was currently able to exchange them, relying on his current level of strength how could he able to control them. Perhaps the movement he exchanged them, the first thing they do maybe swallowing him, if that happened then that would be a tragedy.</p><br/><p>As the saying goes, it’s important to walk step by step, food should be eaten bite by bite, who could successful become fat eating mouthful at once, Ren Tianyou was extremely clear about these inside his heart. And also he still hadn’t completely mastered all the ninjustu inside his ninjutsu system. Currently he had sufficiently mastered ordinary ninjutsu, but he still hadn’t completely learnt some secret art and forbidden art, even to the extent that there are still many kekkei genkai and kekkei tota waiting for him to exchange. These would definitely provide extremely big aid to increase his strength. And the next target of Ren Tianyou was Hiraishin no Jutsu (Flying Thunder God Jutsu), once this ninjutsu was learnt, that would definitely largely boost his strength. After that there were forbidden jutsu—- Edo Tensei (Reanimation Jutsu) furthermore Sage arts too, and moreover he also wanted to create his own ninjutsu, in addition upgrade his eyes and so on. These are the matters that demand the immediate attention of Ren Tianyou.</p><br/><p>Ren Tianyou jumped down from the head of Shukaku, looked all around him, then looking towards Shukaku and Matatabi, he said, “Shukaku, Matatabi, the things here are already almost finished. So you two should return first, I’ll see you later.”</p><br/><p>“Okay Tianyou, then we’ll leave first.” Shukaku looked all around him, discovered all the enemies had already been eliminated, even those several tens of God-ranked dragons had also changed into powder and dissipated in the air under the attack of Matatabi. But at this point, Ren Tianyou thought that it was rather pity, because including Ximen Zhou, 5 High God realm experts died under the bijudama of Matatabi, so their death didn’t gave Ren Tianyou any system points. Here Ren Tianyou again felt pity, if these 5 individuals died by his hand, then he would have obtain huge number of system points. And after that whether exchanging sanbi (3 tailed) or exchanging new eye, his overall strength would have greatly increase by one step.</p><br/><p>“Okay, you leave first.” Ren Tianyou nodded his head, after that along with two ‘peng’ ‘peng’ sound, the huge body of Shukaku and Matatabi changed into white smokes and disappeared from that place.</p><br/><p>After seeing both of them had disappeared, he turned around and looked over to the direction of Ximen clan, then muttered to himself, “Ximen Batian, this time you were able to run away due to your good fortune. But next time however you will not have such good fortune. Wait for the next time until I come to Tianlong city. At that time, you and your Ximen clan will truly perish from this world. And also at that time, regardless of whoever protect you, you will not be able to escape your death.” Finished speaking, huge amount of eye power gush out from Ren Tianyou’s right eye, creating a spiral shape space ripple at that place, after that the figure of Ren Tianyou gradually disappeared from that place along with that space ripple, leaving behind that huge crater with diameter of more than 1,000 meters created by bijudama.</p><br/><p>Ren Tianyou very clearly knew that, after Ximen Batian fled inside Tianlong city, it would be extremely difficult for him to kill Ximen Batian. Because Tianlong city was after all the supreme headquarter of Ximen clan, who knows what kind of terrifying experts were hidden inside. And also the imperial clan inside Tianlong city also couldn’t let him behave unscrupulously inside the city, because even if they also want to attack Ximen clan, but the thing was there was also a limit, if one was talking about outside the city, then regardless of what Ren Tianyou do, even if he create chaos and darkness or bloodbath, they could turn a blind eye to it, and treat it as if they didn’t see. But if you are talking about running amok inside the city, then they couldn’t pretend to have both of their ears shut to what goes on outside the window. Because once Ren Tianyou stir trouble inside the city, that would be equivalent to undisguise slap in the face of imperial clan, so how could they sit still. And Ren Tianyou also understand this point, so he go ahead and leave this place, ending his revenge for the moment.</p><br/><p>But regardless of what others says, the revenge of this time was also very satisfactory, as he successfully robbed their treasured person, ruthlessly attacked Ximen clan, they lost many elite younger generation’s juniors, and furthermore also lost quite a few God ranked experts. Two of the clan’s god domain experts also died in this battle, this was undoubtfully very heavy price.</p><br/><p>What Ren Tianyou didn’t know was, just after he left from this place, extremely powerful golden light suddenly appeared at the sky above the crater, and after looking at the circumstance around, suddenly snorted coldly and flew back towards the direction of Ximen clan inside Tianlong city.</p><br/><p>…………………</p><br/><p>After Ren Tianyou was gone, the news of this battle just like a terrifying hurricane, swept across the whole Divine Wind continent. All the high level forces got the secret report about the battle at Soaring dragon mountain villa.</p><br/><p>Above these secret report, the name ‘Akatsuki’ was clearly written, a mysterious organization called Akatsuki raided on wedding ceremony site of Ximen clan’s eldest son Ximen Feng and Wang clan’s Wang Yuxin on their wedding day, then snatched away the bride, eldest daughter of Wang clan. After that, they set up a huge barrier, trapping all Ximen clan inside. Among all the experts of Ximen clan present there, with the exception of Ximen Batian who was rescued by Ximen Kuang, all were round up at one fell swoop, not a single one survived. Eventually dragon clans experts arrived at Soaring dragon mountain villa, and cooperated with Ximen clan’s God domain experts, Mid God Ximen Wuyan and High God Ximen Zhou to annihilate Akatsuki organization. And the dispatched lineup of dragon clan was extremely magnificent, the lineups includes 5 High God ranked superior dragons, and more than 20 God ranked dragons.</p><br/><p>But the unexpected thing for everyone was, the leader of Akatsuki organization named Zero unexpectedly summoned 2 super powerful magical beasts which no one had ever seen. And using a type of mysterious art, the Akatsuki’s leader Zero changed himself into more than 40 meters giant. And this giant had a sword which chopped High God realm dragon into two, and the surplus energy of this slash easily cleaved a miniature mountain easily.</p><br/><p>But the most amazing thing were those two magical beasts, one of them suddenly released super powerful ultimate move, not only the enemies present on the scene, including remaining 4 High God realm dragons, Ximen clan’s Ximen Zhou, as well as the remaining more than 10 God ranked dragons were all blasted into powder, not even bones were left behind, this attack also crushed several more mountains within the diameter of more than 1000 meters, leaving behind a huge crater with more than 1,000 meters diameter in that place. All the mountains in that area disappeared without a trace.</p><br/><p>Still the most surprising matter was not that, rather the number of peoples of Akatsuki organization at the time of raid was more surprising. Altogether there were only 4 individuals. (Jade Maiden had already entered the kamui dimension to take care of poisoned Wang Yuxin.) Only these with these 4 individuals, they had the ability to make Ximen clan and Dragon clan to eat this big losses, causing all forces to have no coice but to pay attention to this Akatsuki organization. And those people watching the battle were able to know the code names of Akatsuki member. Leader of Akatsuki organization——Zero, and its members, white haired man with super high level swordsmanship—–White Tiger, extremely powerful indifferent and merciless sword art—–Void, and Phoenix battle qi all over the body as if bathing in phoenix fire—-Vermilion Bird. All of them wore same kind of black robe with red clouds imprinted on them, and in their head they wore mysterious bamboo hat. It was very easy for everyone to remember their dress up.</p><br/><p>Regardless of anything, this time the name Akatsuki organization thoroughly reverberate through the entire continent. Their data were placed on the hand of big forces, but after Ren Tianyou had established Akatsuki organization, he had basically not made any move, so there was also no way to examine them. Only the members of mercenary guild where he had once completed the mission, had little bit of his information.</p><br/><p>And after Ximen clan was raided, all the enemies of Ximen clan applaud and yelled well done, because Akatsuki organization replaced them and released their pent up desire which they were holding in all along. Afterwards all the powers immediately arranged to move, first to take the advantage of this heavy loss of Ximen clan, and set about to continuously suppress Ximen clan, just like beating soundly to a dog in the water, they were very unlikely to let this chance slip by. Secondly to deal with the matter of all forces, that was to send peoples everywhere to inquire about and search the member of Akatsuki organization. And all the forces instructed the same things to the scouts they dispatched, “Be sure to never provoke the member of Akatsuki organization, exert yourself to be on friendly terms with them. Whoever provokes them, I will personally kill that person. Now get to work.”</p><br/><p>And as for those who knew Akatsuki’s member, naturally Luo Tianxing and others, after they heard the conduct of Ren Tianyou and his group, all of them had their mouth wide open, and their eyes were filled with doubts. They had never thought that, that Ren Tianyou who had kind and gentle face unexpectedly created such insane matter. But they all made a resolution, that they would not let other know the identity of Ren Tianyou, because they clearly knew that, if they speak this matter, then this would absolutely cause Ren Tianyou and others a trouble.</p><br/><p>……………..</p><br/><p>In one of the mysterious island of endless sea, in the huge golden hall, at the front of this golden hall there was a huge tall platform with a huge golden dragon statue on it. In the area underneath of this statue, there were numerous small-sized transparent beads, and inside these beads, small transparent dragons were circling.</p><br/><p>In the center of this hall, a middle aged man wearing a golden battle armor was sitting crossed-leg. He was sitting cross legged in the midair, and a light golden light glimmered on the surface of his body. Just at this time, 20 or 30 transparent bead above that high platform suddenly gave out a ‘ka ka’ cracking sounds, then with a ‘peng’ sound, they scattered into pieces and the debris fell on the ground.</p><br/><p>And that middle aged man sitting crossed legged in the midair suddenly rouse up due to this unusual change. After he saw the scattered small pieces of those 20 or 30 beads on the platform, his complexion instantly become unsightly, and his body suddenly released a powerful aura, then looking towards the sky, he opened his mouth and gave out a loud roar. And a powerful golden light spread in all direction, causing the whole hall to tremble under his powerful aura. And this aura directly blew off the roof of this hall, and the whole island heard this extremely loud roar.</p><br/><p>“Hateful, Xilaisite and all others actually fell. Damned bastard, no matter if you flee to the ends of the earth, we dragon clan will absolutely find you and tear your body into thousands of pieces.”</p><br/><p>And Tianlong city’s Ximen clan was also similarly cursing to chase and kill, anyone who provides the location of member of Akatsuki organization, would get 500,000 gold coins. If anyone could kill them, and took their head, then Ximen clan would absolutely thank them heavily. But what was surprising was, the Wang clan who had their daughter stolen didn’t make any movement, this was little bit intriguing.</p><br/><p>Originally quiet Divine Wind continent, because of the move of Akatsuki under the leadership of Ren Tianyou, suddenly become stormy. And after leaving battlefield Ren Tianyou didn’t go to somewhere else instead had directly entered inside his kamui space, as he believed that White Tiger and other ought to be worried about him and he himself was also extremely worried whether the poison of Little Yu was cured by purple gauze sky magnificent flower or not.</p><br/>\n</div>"}