{"title": "Chapter 174: Bijudama", "id": 174, "volume": 2, "url": "http://boxnovel.org/in-different-world-with-naruto-system-chapter-174-bijudama", "volume_title": "Volume 2", "body": "<h1>Chapter 174: Bijudama</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 174: Bijudama</p><br/><p>Along with the huge terrifying energy fluctuation, Matatabi’s that huge figure appeared before everyone’s eyes. Matatabi was looking towards the sky, and one ultra large black colored energy ball was above its mouth. Matatabi was spitting out huge amount of its chakra from its mouth, towards this huge energy ball.</p><br/><p>“Bijudama is completed, Shukaku, lets withdraw.” Seeing that huge bijudama above the mouth of Matatabi, Ren Tianyou excitedly said towards Shukaku.</p><br/><p>Bijudama is the unique skill belongs to all tailed beasts, made up of 8:2 ratio of yin and yang chakra of tailed beasts. And the gathered chakra rotates in high speed, taking the shape of one high-density chakra energy ball. After that it is send out from above the mouth in straight line, and the explosion of this energy ball was strong enough to completely blow off a mountain. Even relying on his current Susanoo, it was basically very unlikely for Ren Tianyou to stop the power of this bijudama, and directly turn into dregs. Currently unless he use kamui of Obito to dodge, perhaps there is no other way for him to survive bijudama. But the target of this bijudama was those several dragons, not himself, so it was not Ren Tianyou’s headache, but was the headache of theirs.</p><br/><p>“Okay!” Hearing Ren Tianyou, Shukaku also roared in excitement, then directly jumped back and stood behind Matatabi with Ren Tianyou on its head. Shukaku also didn’t forget to use huge sand waves to obstruct those dragons before retreating. He didn’t give any chance for those dragons to flee.</p><br/><p>And after seeing Ren Tianyou and Shukaku had already retreated behind itself, Matatabi’s eyes looked towards those 4 dragons and 1 human who were in the process of dodging the sands of Shukaku, then its eyes flashed with pallid light. Soon afterwards, it lowered its head, aimed bijudama at enemies, then under the control of Matatabi, this huge black colored chakra ball directly shot out towards them. And this high density chakra ball flew towards those 4 dragons and 1 human in the sky.</p><br/><p>The power of this bijudama was so powerful that and all the mountains and ground beneath the route of this bijudama were directly cut open creating a long gully. Everything that were obstructing its way were immediately destroyed, and changed into powder. Even the space around as if was about to split open under this monstrous power, was sending out a peculiar fluctuation.</p><br/><p>This huge bijudama go forward and directly hit those 4 dragons. They didn’t have any resisting ability and under the hit of this huge energy ball, they were sent flying. Along with ear deafening ‘hong’ loud explosion sound, terrifying energy storm spread in all direction from that place as a center. Everything around including big mountains, and all the peoples were destroyed and changed into powder under the terrifying power of this energy storm as if they were old rotten woods. Even Ximen Zhou who had timely fled far away, under the power of this, his half dragon form body which had a layer upon layer of thick gold colored dragon scale and powerful gold colored energy of Saint Dragon Battle Qi, directly changed into powder and dissipated in the sky, left nothing behind under this powerful destructive might.</p><br/><p>“Storm is coming, be a little bit more careful, Tianyou.” Seeing explosion far away, Shukaku warned Ren Tianyou. After that along with dazzling light, terrifying energy storm arrived at their side. Immediately after it warned Ren Tianyou, in front of them, the sands quickly moved, gather and took the form of solid sand shield. And this sand shield looked just like the miniature version of Shukaku. This was the true absolute defense used by ichibi, Saiko Zettai Bogyo—-Shukaku no Tate (Ultimate Defence—-Shukaku’s Shield).</p><br/><p>After that Shukaku immediately used its own tail to block its eye, to keep out that dazzling radiances. Matatabi also used its tail to block its eye, it’s just that it had one more tail than Shukaku. At this time, Ren Tianyou immediately lied down on the head of Shukaku, and began to slowly absorb the chakra of Shukaku to recover his own body. Since there were two tail beasts at his side, no matter how strong this explosion of this bijudama was, he would definitely not be affected. So currently recovering his chakra by seizing this moment was most important. And if Shukaku and Matatabi were to know that they had become the shield for Ren Tianyou, then it was unknown whether they would be angry and just slap him to death.</p><br/><p>And among the far away mountains where those peoples who were watching the battles were staying, 3 or 4 mountains were also blown off by this powerful blast. Since these mountains were not the target of bijudama, and also very far away from the center of explosion, the energy storm that arrived here was also many times weaker, and these peoples were also not that weak, so there was no injured person. This energy storm even reached the imperial capital Tian Long city, but there was no power when this energy storm reached the city, so it only blew off some things and there was no harm to the peoples inside the city.</p><br/><p>Only after nearly 3 minutes, this terrifying energy storm slowly dissipated, and the radiances at the center also slowly weakened, and everyone around were also able to slowly open their eyes. When the explosion stopped and energy storm also completely stopped, everyone could see the scene at the center of explosion. After that each and every one couldn’t help but to had their eyes wide open with their eyeballs almost leaping out, and their mouths were also wide open, turning into a perfect ‘O’ shaped, wide enough to completely swallow a whole egg. And they unconsciously swallowed their saliva. Everyone were thoroughly shocked seeing the scene before their eyes.</p><br/><p>At the center of explosion, that huge mountain where Soaring dragon mountain villa was located had completely disappeared without a trace. And all the small mountains around within the diameter of about 1 km from that place, had also completely disappeared in the same fashion. Now instead of mountains, there was only a single huge bottomless crater. This huge crater had the diameter of about 1 km, everything within this area were swallowed. Leaving behind this huge crater, there was nothing left there.</p><br/><p>Seeing the circumstance in front of himself, even Ren Tianyou himself unconsciously swallowed saliva several times. Even though he had already estimated the result of bijudama, he was also extremely stunned seeing the scene before him. And this was the result of 2 tailed beast’s bijudama, then what about 8 tailed beast? Or 9 tailed beast? Or the 10 tailed beast which was the aggregate of all tailed beasts? Ren Tianyou couldn’t even imagine their effects, if he wish to know, then he should see it personally some day in the future.</p><br/>\n</div>"}