{"title": "Chapter 178: Flame Phoenix Villa", "id": 178, "volume": 2, "url": "http://boxnovel.org/in-different-world-with-naruto-system-chapter-178-flame-phoenix-villa", "volume_title": "Volume 2", "body": "<h1>Chapter 178: Flame Phoenix Villa</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 178: Flame Phoenix Villa</p><br/><p>“Halt, who are you people, our Flame Phoenix Villa doesn’t welcome outsiders.” Just when Ren Tianyou and his group arrived before the entrance door of the villa, two female guards stationed at the entrance immediately blocked their path, and raised the weapons in their hands, they roared with their lovely voices.</p><br/><p>“Vermilion Bird!” Seeing their way was blocked by these two guards. Ren Tianyou stopped walking, then turned around towards Vermilion Bird and spoke.</p><br/><p>Hearing Ren Tianyou, Vermilion Bird knew that she would not be able to hide herself any longer. She stepped forward in front of everyone, and under the curious gazes of these guards, she slowly extended her hand towards her bamboo hat. Along with the sound of wind-bells, the bamboo hat was slowly removed, revealing her beautiful face.</p><br/><p>“Ah, Miss.”</p><br/><p>Seeing the familiar face of Vermilion Bird, these two maids revealed a pleasantly surprised expressions on their faces, then they jumped down from the entrance platform, and arrived at the side of Vermilion Bird, they happily said. “Miss, you finally came back.”</p><br/><p>“He he, Xiao Lan, Xiao Mei, after I left, how was the villa? Also, my mother…” Looking at the two maids, Vermilion Bird spoke to them with a smile. But before she could ask about her mother, nevertheless she revealed a baffled expression on her face.</p><br/><p>“Everything is very fine, and Villa Mistress, she…” Saying up to there, these two guards noticed the expression of Vermilion Bird. However, they still carried on, “After she discovered Miss, that you had secretly ran away from the mountain, Villa Mistress, instantly became very angry. She directly split open the east courtyard with her sword. Afterwards Villa Mistress, sent people to search for you, Miss. And what should I say of what happened after that, Miss you weren’t found, now you must be prepared to be grounded for at least ten years.”</p><br/><p>“Ah!” When Vermilion Bird heard that her mother had split the east courtyard with her sword, her expression became very unsightly, and when she heard that she would be grounded for at least ten years, Vermilion Bird began to regret running away on impulse a little bit.</p><br/><p>Not to mention Vermilion Bird, even Ren Tianyou and the others behind her also had their brows beaded with sweat, and the corners of their mouths began to twitch. Now they finally understood clearly why Vermilion Bird was so fearful of her mother. Just hearing about the reaction of her mother, they absolutely believed that her mother had the temperament of a Tyrannosaurus, so who would be fearless.</p><br/><p>“Hey Vermilion Bird, don’t think of slipping away. This matter is related to my elder sister Yue’er, so you should slightly sacrifice yourself, and accompany me in this visit. ”When he saw that Vermilion Bird wanted to flee, Ren Tianyou immediately got anxious. However, he knew that this matter was related to the issue of resurrecting elder sister Yue’er, so how could he let her slip away this time. So in a moment of desperation, Ren Tianyou had no time to think properly, he directly stepped forward, and held the arm of Vermilion Bird, who was intending to slip away, then get close to her ear, and softly spoke.</p><br/><p>“Ah…eh…Zero, can you release me first?” Feeling Ren Tianyou was tightly holding her hand, as well as the hot air coming from the side of her ear, caused Feng Wu’s complexion to instantly redden, she stammered.</p><br/><p>Seeing the reaction of Vermilion Bird, Ren Tianyou also became aware of his action so he immediately let go of her arm, then expressed he was sorry, he moved back a few steps. And sensed the unbridled stares of his companions behind him, Ren Tianyou’s thick-skinned face also instantly become red all of a sudden. Only after noticing that Little Yu was not angry did he sigh in relief.</p><br/><p>“Miss, they are…?” Seeing the intimate action of Ren Tianyou with their family’s Miss, and the Miss’s unexpected lack of any form of resistance, Xiao Lan and Xiao Mei glanced at each other, and saw the surprise on the face of each other, then curiously asked Vermilion Bird.</p><br/><p>“They are my friends, I brought them here to have fun in our house. So let them enter and look at our Flame Phoenix Villa for a while.” Vermilion Bird adjusted her state of mind, then continued speaking, “Now I’m going to take them to meet my mother, so make way.”</p><br/><p>“But Miss, the Villa Mistress commanded us not to let any outsider enter our Flame Phoenix Villa, so if we let them enter like this, Villa Mistress will blame us.” Xiao Lan looked at Feng Wu with a miserable expression on her face, as she replied.</p><br/><p>“You two are so foolish.” Hearing Xiao Lan, Vermilion Bird used the finger of her jade hands to point at their heads, and continued, “Isn’t Villa Mistress my mother? So why can’t I, as her daughter let my friends enter my house? Well, don’t be at odds, I have travelled from very far away, and I am very tired, so we are entering.”</p><br/><p>“Yes, Miss.” Hearing Feng Wu, Xiao Lan and Xiao Mei clutched their aching heads and replied with grievance.</p><br/><p>Seeing the path had opened, Vermilion Bird took the lead and walked inside the villa. Ren Tianyou and the others of course followed closely.</p><br/><p>After they entered the Flame Phoenix Villa, that saw that the ground inside the villa was covered with a layers upon layers of smooth slab stone, neat and tidy without any dents or bumps. Unusual fiery red colored trees were grown inside the villa, and many fiery red colored leaves of trees were emitting a pale red light, and from a far, it looked as if these trees were emitting flames. Across the front courtyard, there was a courtyard for practicing martial arts. Many young girls wearing skin tight training dresses were currently dancing with long swords in that courtyard, making a beautiful scenery.</p><br/><p>“F**k, isn’t this a kingdom of women? Wouldn’t it be very pleasurable to stay here?” Seeing these young girls on the training courtyard, Ren Tianyou’s eyes lit up, as he madly howled inside his heart. Fortunately his face was covered with a bamboo hat, otherwise his drooling face would have been exposed for all to see.</p><br/><p>After these young girls saw Feng Wu, each and every one of them stopped what they were doing and greeted her. Feng Wu also smiled and greeted everyone back. Under the strange gazes of everyone, she continued to lead Ren Tianyou and the others.</p><br/><p>After passing the training courtyard, they continued to walk for several minutes, only then did they arrive to their destination, the hall! Vermilion Bird took Ren Tianyou and the others and entered the hall, however inside the hall, with the exception of a few maids, there was nobody else.</p><br/><p>“Miss!” Seeing the figure of Feng Wu, the few maids also had a look of surprise and delight, they bowed towards Vermilion Bird, and greeted.</p><br/><p>“You go and make several cups of tea, you go and notify my mother about my arrival, just say that I have returned.” Vermilion Bird instructed the two maids.</p><br/><p>“Yes, Miss!” Replied the two maids, then respectfully stepped back, then went to do as Feng Wu’s instructed.</p><br/><p>“Hey Vermilion Bird, from your current appearance, it seems you are not afraid to meet your mother.” After Ren Tianyou and the others respectively sat on the seats in the hall, White Tiger looked at Vermilion Bird and said with a smile.</p><br/><p>“I am still afraid, but what can I do, after all I won’t be able to hide from her forever.” Vermilion Bird slowly opened her mouth. She also knew that no matter how well she hides, she would have to meet her mother someday, as it would be impossible for her to hide for her entire life.</p><br/><p>“Oh, our beautiful Vermilion Bird wants to communicate.” Hearing Vermilion Bird, Ren Tianyou said with a smile.</p><br/><p>“Ha ha!” Hearing Ren Tianyou, White Tiger and the others also laughed.</p><br/><p>“Humph!” Hearing Ren Tianyou and the others were laughing, Vermilion Bird snorted coldly, and no longer spoke.</p><br/><p>After waiting for a while, the maid came back holding a few cups tea, and gave everyone a cup and retreated. After that Vermilion Bird and the others sat there slowly drinking tea, waiting for Feng Wu’s mother——-Feng Yunmeng’s arrival.</p><br/><p>After waiting for about five minutes, Ren Tianyou who was sitting suddenly sensed someone, and looked towards the entrance of the hall.</p><br/><p>At that time, a figure emitting golden colored flames suddenly entered from outside the hall, blazing heat spread all over the hall. Everyone’s vision blurred for a moment, and after their vision was restored, they all saw a well-developed beautiful woman about thirty years of age had appeared in front of Vermilion Bird, and the face of this beautiful woman and the face of Vermilion Bird were very similar.</p><br/><p>“Little Wu, so you actually know how to come back? Good, and you also know that running away from the mountain would really anger me, isn’t that right?” The beautiful woman looked at Feng Wu who was sitting and drinking a tea, and one stone inside her heart fell down (ie .relieved). However she nevertheless berated her (Feng Wu) with her (Motherly) mouth, also she extended her right hand to hit the head of Vermilion Bird.</p><br/><p>“Eh, mother, I will never dare to run away again anymore, please forgive me, pretty please?” Seeing the gesture of this married woman, Vermilion Bird immediately knew her next move, so she immediately placed the tea cup on the table, and threw herself into the bosom of her mother and started acting like a spoiled child.</p><br/><p>“Ai, you!” Feeling Feng Wu in her embrace, this beautiful woman, i.e. Feng Wu’s mother, Feng Yumeng couldn’t help but smile and stopped the movement of her right hand. After that, she returned her extended hand.</p><br/><p>Only after this she suddenly discovered Ren Tianyou and others who were also sitting inside the hall, so she asked with surprise, “Who are you people?”</p><br/><p>Before Feng Wu could introduce them, Ren Tianyou took the initiative to stand up, and took off his bamboo hat. Next White Tiger and other also followed Ren Tianyou’s suit.</p><br/><p>“Akatsuki’s Zero!”</p><br/><p>“Akatsuki’s White Tiger!’</p><br/><p>“Akatsuki’s Void!”</p><br/><p>“Akatsuki’s Jade Maiden!”</p><br/><p>“Akatsuki’s Santai!” (ED:who?xD)</p><br/><p>“Greetings Phoenix Villa’s Mistress!” Ren Tianyou and others simultaneously slightly bowed towards Feng Yunmeng as they spoke.</p><br/><p>Support me through patreon to get early access and other bonus. Here is the link.</p><br/>\n</div>"}