{"title": "Chapter 186: Succeed", "id": 186, "volume": 2, "url": "http://boxnovel.org/in-different-world-with-naruto-system-chapter-186-succeed", "volume_title": "Volume 2", "body": "<h1>Chapter 186: Succeed</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 186: Succeed</p><br/><p>But it was already too late, this girl named Xing Lu had already swung the dagger in her hand to stab towards the back of the head of Ren Tianyou.</p><br/><p>This girl named Xing Lu—–Amasita Xia, was the daughter of Elf Queen, and her bedchamber was exactly behind where Ren Tianyou was standing. The people of Elf clan liked to build their houses above big trees, because they believed that, like this they would be able to easily get even closer to nature, and communicate with nature.</p><br/><p>And when Ren Tianyou had landed on the branch of the tree, this movement had woken up sleeping Xinglu, and after carefully observing the activity, she clearly understood the circumstance of outside. It turned out that this mysterious man had kidnapped her friends, and was threatening her mother to hand over Spring of Life.</p><br/><p>And she also discovered that this man was paying attention only in front, completely leaving his back wide open. She instantly realized that this was an exceptionally good chance. Perhaps she would be able to kill this man, and then rescue her friends.</p><br/><p>If she used bow and arrows, or nature magic, then the movement would certainly be very big, so she took out dagger and slowly advanced towards Ren Tianyou from behind. Very quickly she arrived behind Ren Tianyou, then without the slightest hesitation, she swung her hand to stab the back of Ren Tianyou’s head. But just at that time, she heard her mother’s exclaiming voice, but now she had already made her move, so she could only continue to stab the back of Ren Tianyou’s head.</p><br/><p>Close, closer and closer, seeing her dagger was getting closer and closer to the head of Ren Tianyou, undisguised excited expression appeared in the eyes of Xing Lu. But the unexpected things for her was, her dagger unexpectedly pass through his head, without any resistance, as if hitting the air, and him standing in front of her was just an illusion.</p><br/><p>…………….</p><br/><p>As a matter of fact, just when Xing Lu had come out from the house, Ren Tianyou had already noticed her, but he pretended to not notice her. Even though Ren Tianyou’s eyes were continuously watching front, in fact each and every move of Xing Lu was under the mental perception of Ren Tianyou. And just when Xing Lu stabbed towards him, he immediately used kamui, letting her dagger pass through from his head, then directly caught the right hand of Xing Lu which was holding the dagger with his left hand.</p><br/><p>And when the left hand of Ren Tianyou caught her arm, Xing Lu immediately knew that it was bad. Sure enough, Ren Tianyou forcedly pulled with his left hand, and only relying of that frail body of Elf clan, how could she be capable to compete with Ren Tianyou. She was directly flipped down in front of him, then along with ‘peng’ sound, without a shred of pity and tenderness to women, Ren Tianyou directly fling that dainty body of Xing Lu while holding her arm, causing her to heavily fall on that sturdy branch.</p><br/><p>Instantly Xing Lu felt as if huge beast rammed her, and very soon her falling stopped, then she couldn’t help but suddenly coughed few times, and the blood slowly spilled out from inside her mouth.</p><br/><p>Afterward she felt her neck tighten, a sturdy hand grasped her neck, and lifted her up. After that she immediately felt the feeling of suffocation. Even after that, she opened her eyes with great difficulty, and saw a youth with grave and stern complexion in front of her. And his pair of evil scarlet eyes divulged a sense of mystery, and increase evil charm to his whole person.</p><br/><p>After looking at this female elf in front of him, Ren Tianyou raised his head, and said to Elf Queen who had worried expression on her face, “Your Majesty the Queen, now 5 minutes is over. Since this girl rushed to die, I will start from her.” Finished speaking, Ren Tianyou pointed the tip of his Kusanagi sword downward, then stabbed towards Xing Lu.</p><br/><p>Seeing the sword was getting closer and closer to Xing Lu, Elf Queen hastily opened her mouth and roared, “Stop, quickly stop, I agree you, I agree you, is this not enough?”</p><br/><p>But as if he did not hear the voice of Elf Queen, the speed of Kusanagi sword suddenly accelerated, and directly stabbed Xing Lu.</p><br/><p>Seeing the circumstance before her eyes, the eyes of Elf Queen immediately became red, and with powerful energy immediately exploded out from her body as she roared, “You bastard, didn’t I say you to stop? Why? Why did you still kill my daughter?”</p><br/><p>Looking at that insane appearance of Elf Queen, furthermore that terrifying aura from her body, Ren Tianyou was apprehensive inwardly, but nevertheless smiled and said, “Don’t get too excited? I am merely joking with you.”</p><br/><p>Finished speaking, Ren Tianyou pulled out his sword from the body of Xing Lu, and there was not even a trace of wound on her body in that place. As a matter of fact, Ren Tianyou had used kamui, so even though the sword had directly stabbed through the body of Xing Lu, there was not a single wound on her body, but this intimidated Elf Queen to jump.</p><br/><p>Seeing her daughter was unscathed, Elf Queen rubbed her eye and was not able to believe what she was seeing with her own eyes. After that Ren Tianyou’s right eye rotated, and the emitted eye power arrived at the eyes of Xing Lu, causing her to suddenly quite down. After that Xing Lu immediately sat down on the branch motionlessly. Then Ren Tianyou slowly said towards Elf Queen, “Well, quickly hand over Spring of Life, else I’ll really start killing people.”</p><br/><p>Hearing Ren Tianyou, Elf Queen immediately said, “Where are the other 17 people? Quickly get them out, and I will give you Spring of Life.”</p><br/><p>“Humph, without seeing Spring of Life, do you expect me to release them?” Ren Tianyou said with tone full of disdain. Honestly speaking, although he had boldness to threaten others with superb skill, but being surrounded by group of experts like this, he was still feeling great pressure. “You’d better take things out now, or I will immediately begin killing, and I mean it.”</p><br/><p>“You………” Hearing Ren Tianyou, Elf Queen was angry. She didn’t know what to say, her eyes turned around, and a light lit up in her brain, and she answered, “Okay, I’ll give you Spring of Life. If after you take this thing and still didn’t release all of them, even if I have to chase you to the ends of the world, I will definitely not let you go.”</p><br/><p>“Don’t worry, I’m not addicted to killing those peoples who don’t have any motive against me.” Ren Tianyou shrugged his shoulder, then honestly said. If it weren’t for this Spring of Life, he would have never done such boring thing.</p><br/><p>“Then okay, here are the things you asked!” Elf Queen took out 10 small transparent bottles which was filled with green liquid from inside her space ring, then she threw these small bottles towards Ren Tianyou. Ren Tianyou caught it and directly placed it inside his space ring. Then a spiral shaped space ripple appeared in front of him, and more than 10 elves appeared on the branch one after another from inside that space ripple. After that the figure of Ren Tianyou immediately disappeared, leaving behind the sentence, “Your Highness the Queen, all these elves are trapped in illusion, so they will not move for a while. You just have to wait until the illusion is lifted from them.”</p><br/><p>Looking at the disappearing figure of Ren Tianyou, the corner of Elf Queen’s mouth curved to a strange radian.</p><br/>\n</div>"}