{"title": "Chapter 195: Gamadaira — Kageayatsuri no Jutsu", "id": 195, "volume": 2, "url": "http://boxnovel.org/in-different-world-with-naruto-system-chapter-195-gamadaira-%E2%80%94-kageayatsuri-no-jutsu", "volume_title": "Volume 2", "body": "<h1>Chapter 195: Gamadaira — Kageayatsuri no Jutsu</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 195: Gamadaira — Kageayatsuri no Jutsu (Toad Subjugation Shadow Manipulation Jutsu)</p><br/><p>In the mysterious dimension, everywhere here was full of lush trees, and countless beautiful fragrant flowers grew all over this whole dimension. Cheerful and pleasant birdsongs sounded among the trees, and beautiful butterflies were dancing lightly and gracefully in the clusters of flowers. This place was simply a fairyland.</p><br/><p>And in the middle of this dimension, one huge celestial tree grew there. This tree was so tall that standing below this tree, it was impossible to see its top. And the diameter of this tree was at least 1 kilometer, and its root extends everywhere on the ground.</p><br/><p>At this time, one huge white colored radiance cut open this space, and landed on the ground of this space. After that along with the dissipating of this radiance, one female elf wearing purple colored dress appeared in that place. This elf naturally was Princess Xing Lu of Elf clan, and this place was Domain of Life where Tree of Life was located.</p><br/><p>“Is this the Domain of Life?” Feeling many times fresher atmosphere compared to outside, suddenly a male voice came out from the body of Xing Lu, and yet the mouth of Xing Lu had not opened from the beginning to end.</p><br/><p>At that time, the body of Xing Lu suddenly quivered, and behind her body, a young man wearing black robe with red colored clouds imprinted on it slowly emerged out from inside her shadow underneath her body. And after this youngster firmly stood behind her, Xing Lu powerlessly kneeled down on the ground.</p><br/><p>“Oh, it seems this technique consumed too much of her physical power.” Seeing Xing Lu kneeling down on the ground and gasping for breath, this youngster muttered to himself.</p><br/><p>This youngster was naturally Ren Tianyou, and after taking in Spring of Life, he had hurried over to Crescent Moon well together with Xing Lu. And relying on his methods, those elves were unable to discover him again.</p><br/><p>After entering into the small forest in front of Crescent Moon well, he had used Gamadaira — Kageayatsuri no Jutsu (Toad Subjugation Shadow Manipulation Jutsu) to manipulate Xing Lu.</p><br/><p>Gamadaira — Kageayatsuri no Jutsu (Toad Subjugation Shadow Manipulation Jutsu), after user of this technique infuse his chakra into victim’s shadow, the user’s body becomes very thin just like a piece of paper, furthermore combines with victim’s shadow becoming one with it. And the user is able to temporarily control victim’s body and mind. And they can also control the other person to carry out a conversation.</p><br/><p>After Jiraiya had sneaked into Amegakure (Hidden Rain village), he had used this ninjutsu to control one villager of Amegakure (Hidden Rain village) intending to secretly scout information of Pein, but unfortunately the moment he entered Amegakure (Hidden Rain village), he was already discovered by Ukojizai no Jutsu (Rainmaker Jutsu) of Nagato. After that his every action were under the surveillance of Nagato, finally after Konan met with him, Nagato’s Six Paths of Pain killed him, and his corpse sank into high-pressure deep sea.</p><br/><p>Seeing that huge celestial tree far-off in the distance, Ren Tianyou was greatly shocked, then muttered, “This….is this Tree of Life?”</p><br/><p>At this moment, the heart of Ren Tianyou was filled with a feeling of awe. This feeling had appeared extremely naturally, not an abrupt feeling. This feeling was completely different compared to the feeling of last time when he had seen Tower of Babel. That Tower of Babel was emitting majestic momentum from head to foot which pressured the mind of everyone, and the more you resist, the greater the pressure you felt, until you couldn’t move. And if you didn’t resist and let the nature take its course, then with the exception of a little bit constrain, there was no other discomfort.</p><br/><p>But Tree of Life emitted warm aura which gave people a kind of strive to improve and thriving feeling, and also make people to unconsciously sense the peaceful might of life. This Tree of Life was one of the first life form that was born in this continent, and to this must be added, this Tree of Life innately contain life law, and its capacity of life-force was simply beyond measure.</p><br/><p>Taking a glimpse at Xing Lu lying on the ground, Ren Tianyuo frowned, then walked to her side, and placed his hands which was covered with light blue colored chakra radiance on her body. Under the Mystical Palm Technique of Ren Tianyou, that tightly wrinkled brows of Xing Lu slowly loosen.</p><br/><p>In truth, Ren Tianyou actually didn’t has any killing intention towards this elf girl, but still always controlling and using her like this regardless of her life and dead, what was the difference between her and domesticated animal. Ren Tianyou himself believe that he was not a good person, was absolutely not a softhearted in killing peoples, and compared to anyone else, he was even more ruthless and cruel, just like last time when he invade Ximen clan, he directly killed nearly every one of Ximen clan, and finally used bijuudama and destroyed the whole mountain where Soaring dragon villa was located. Now the vitality of Ximen clan was greatly damaged and their strength also reduced greatly.</p><br/><p>Although he was ruthless to enemy, nevertheless Ren Tianyou still always had bottom line, and he would never run amok just because he gained strength. Otherwise there wouldn’t be any difference between him and beasts.</p><br/><p>After seeing Xing Lu’s complexion had somewhat taken a turn for the better, Ren Tianyou began using kamui of right eye. After that a spiral shaped space ripple appeared, and Xing Lu was sucked inside this space ripple.</p><br/><p>After finishing this task, Ren Tianyou stood up and looked over towards the far-off Tree of Life, then rushed towards it.</p><br/><p>Ren Tianyou was so fast that his speed was nearly comparable to the speed of sound which was nearly 340 meters per seconds. But even after running for 20 minutes in that speed, he was nowhere near Tree of Life, this shows how far this Tree of Life was. It seemed strangely near because this Tree of Life was too tall and too big.</p><br/><p>After arriving at the side of this tree, Ren Tianyou finally sensed the tallness and bigness of this Tree of Life, “Ya, is this truly a tree?”</p><br/><p>Looking at more than 1 kilometer tree trunk as well as that gaze couldn’t see the tree top, he was obviously amazed.</p><br/><p>And now Ren Tianyou was standing on one of the root of this Tree of Life. The roots of this Tree of Life which no one knows how many years it had grown were already spread all over the place. These roots were so thick that, 5-6 people could easily stand sideways on it.</p><br/><p>Ren Tianyou controlled his body and flew towards the top of Tree of Life, no, he was jumping, after all he was merely stepping on space cross-section and jumping. Arriving at the side of Tree of Life’s trunk, Ren Tianyou punched it with his right hand which was covered with lightning. There was only muffled ‘Peng’ sound without any movement in Tree of Life, but Ren Tianyou’s face nevertheless slowly became red then purple.</p><br/><p>“Ah!” Ren Tianyou cried loudly in pain, then quickly waved his right hand continuously. His fist was already red and swollen.</p><br/>\n</div>"}