{"title": "Chapter 202: Return", "id": 202, "volume": 3, "url": "http://boxnovel.org/in-different-world-with-naruto-system-chapter-202-return", "volume_title": "Volume 3", "body": "<h1>Chapter 202: Return</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 202: Return</p><br/><p>Seeing Ren Tianyou standing on the side wall without falling down by completely going against the principle, and waving his hand towards them by grinning cheekily, three words appeared on the mind of all of them simultaneously.</p><br/><p>“Impossible!” [T.L: 3 Chinese character.]</p><br/><p>You should know that the Elf clan’s nature magic however was known as number one control magic among all the magic, even ice system magic and lightning system magic couldn’t compare with. In addition they also had that terrifying nature blood lineage, which could continuously and easily control plant’s nature energy, making them thick, long, and even tenacious according to their thoughts to trap their opponent. And once trapped it was not that easy for anyone to get out from this constraint.</p><br/><p>Yet what happened before their eyes just a moment ago, the trapped person disappeared into a thin air, then again appeared on other place. No matter how mystical space magic was, it was also impossible to completely disappear into a thin air and move without any indication under the trapped circumstance.</p><br/><p>But how could these people understand all sorts of mysterious of Mangekyo Sharingan, and also how could these people understand the true might of kamui. In the first place, even in Naruto world, relying on the doujutsu of right eye kamui, Obito dared to break into Hidden Leaf village alone, and fought alone against 4th hokage Namikaze Minato known as Yellow flash at that time. Although Minato finally defeated him using Hiraishin no Jutsu (Flying Thunder God Jutsu), nevertheless he (Obito) successfully extract kyuubi demon fox from inside the body of his (Minato) wife Kushina causing her death.</p><br/><p>And again relying on the kamui of his right eye, Obito alone burst into the 5 kages summit, and loftily declared war upon them starting the ninja world war. This shows the might of kamui.</p><br/><p>“Oh, nothing is impossible, you know I however continuously tempered my body with very great effort, so the degree of flexibility of my body, you ordinary people are unable to comprehend.” Ren Tianyou placed both of his hands behind his head, then unceasingly swayed his body, and said with enigmatic face. Saying enigmatic, actually was him pretending nothing more.</p><br/><p>“You bastard, don’t look down upon others.” Hearing Ren Tianyou’s full of disdain words, as well as seeing that he was unceasingly swaying his body, the eyes of Elf Queen and 4 elders immediately become red. Must you mock people like this ah, dodged our attack, that’s fine, but still deliberately displaying such wacky movements, isn’t this clearly making fun of us?</p><br/><p>And even your reason, using your body’s degree of flexibility to dodge our nature magic’s winding, cough, will you die if you don’t brag? Where have you seen the body that is capable of squirming out from the tightly winded vine? You are blatantly telling us a bare-faced lie, do you think all of us elves are idiot ah? If we don’t teach you a good lesson today, you will not know the might of us Elf clan.</p><br/><p>The words of Ren Tianyou furthermore his that unceasingly swaying body, instantly made Elf Queen and all others inside the hall explode. Suddenly powerful nature thick fog appeared around the body of Elf Queen, and waved her right hand, then innumerable sturdy vines suddenly grew out from the ground, and originally flat floor of palace broke into pieces. Then under the command of Elf Queen, these vines quickly rushed towards Ren Tianyou.</p><br/><p>Along with the ‘hong’ sound, the wall were Ren Tianyou was standing was instantly hit by innumerable vines. Then along with the explosion sound, pieces of rock scattered everywhere.</p><br/><p>When the smoke and dusts slowly dissipated, a faint shadow was seen standing inside, causing pupils of Elf Queen and others to instantly shrunk firmly, and same question appeared inside their brain simultaneously, “Don’t tell me that he is not affected even a bit?”</p><br/><p>When smoke and dusts completely dissipated, the guesses of Elf Queen and others were proved. Ren Tianyou standing there unscathed, and the wall he was standing had thoroughly caved in.</p><br/><p>And seeing Ren Tianyou was completely unscathed, the complexion of Elf Queen sunk, then immediately prepared to continue attacking. But Ren Tianyou stretched out his hand pointing towards Elf Queen and said lightly, “Stop Elf Queen, as far as I’m concern these moves are useless.”</p><br/><p>Hearing Ren Tianyou, Elf Queen also stopped her action. She had unwilling expression on her face as she also knew that ordinary moves would not work against this person before her, and if she use big move, then her people of Elf Source would get the worst of it.</p><br/><p>“Oh, you finally calm down?” Seeing Elf Queen stopping her action, Ren Tianyou mischievously said. “As a matter of fact this time I came here not to pick a quarrel, rather for your things.”</p><br/><p>Finished speaking, Ren Tianyou waved his right hand, suddenly 30 small bottles with green colored liquid inside it appeared on the ground.</p><br/><p>Seeing the things that had appeared, Elf Queen and 4 elders were surprised. They were pleasantly surprised and was doubtful to see the sudden appearance of Spring of Life.</p><br/><p>“Yes, precisely Spring of Life.” Seeing the expression of Elf Queen and others, Ren TIanyou indifferently said. “I only needed 10 bottles of Spring of Life nothing more, so I naturally came to return these extra things.</p><br/><p>As a matter of fact, Ren Tianyou really didn’t has such good intention, merely this Spring of Life was useful only when taking first one bottle, any more were only equal to drinking beverages. So he deliberately became generous and return these things back to them.</p><br/><p>And why did he behave like this, naturally because he actually didn’t want to provoke enemies. And Elf clan was powerful enemies. After all, only fool would taunt other people everywhere making them their enemy. And the main objective of Ren Tianyou was to increase his strength and return back to Earth. And he established this Akatsuki organization precisely for this purpose.</p><br/><p>As a result Ren Tianyou return back these Spring of Life without slightest hesitation, because compared to these thing which were useless to him, exchanging it for the goodwill of one of the big power was better. Even if there is no goodwill, not becoming mutual enemy was enough. But towards his enemies, he would never be lenient just like Ximen clan.</p><br/><p>“Originally I was thinking of exchanging, exchange something your Spring of Life, but didn’t expect you to give me fake. So I had no choice but to personally take these things. Now leaving behind some which is enough for me to use, I am returning these back to you.” Ren Tianyou looked at the surprise expression on the face of Elf Queen and others and continued slowly, “Now I have already return them back, I should go.”</p><br/><p>Finished speaking, before Elf Queen or others could respond, he immediately used kamui of right eye, then along with a spiral shaped space ripple, he disappeared from that place, leaving behind dumbfounded Elf Queen and others.</p><br/>\n</div>"}