{"title": "Chapter 208: Earth Hydra", "id": 208, "volume": 3, "url": "http://boxnovel.org/in-different-world-with-naruto-system-chapter-208-earth-hydra", "volume_title": "Volume 3", "body": "<h1>Chapter 208: Earth Hydra</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 208: Earth Hydra</p><br/><p>“All of you step back, I don’t want you to get caught up in the fight, and injure yourself.” Ren Tianyou turned his head towards everyone and said, then looking at Void, he said, “You go to help White Tiger, his opponent’s speed is very fast, so you have to be careful.”</p><br/><p>“Okay!”</p><br/><p>Everyone of Akatsuki loudly answered, and quickly stepped back. And Void rushed towards the direction of White Tiger.</p><br/><p>“He is……..” After retreating, the older cousin of Vermilion Bird i.e. Di Qingyu suspiciously looked at Ren Tianyou floating midair in front of him, then asked.</p><br/><p>“He is the leader of our Akatsuki organization, Zero. We sent out the distress signal to him just a moment ago, but I have never thought that he would arrive here this quickly.” Vermilion Bird explained him. After finishing the explanation, she curiously asked him, “Elder cousin, didn’t you go out for experience and training? How come we meet you here?”</p><br/><p>“I just got back, and was planning to return to Villa after some time, but just when I was leaving, I heard the sound of fighting here, so out of curiosity, I came here, and saw you in danger, that was unexpected.” Withdrawing the spear glimmering with red light on his back, Di Qingyu answered Vermilion Bird.</p><br/><p>He was rejoicing inside his heart just thinking about that, luckily he had arrived just in time, and if he hadn’t, his cousin would have been in even more danger.</p><br/><p>After seeing Vermilion Bird and others retreat, Ren Tianyou slowly descended to the ground from the sky. Then he looked at Ling Yanqi standing in front of him, and opened his mouth, “Old man, never thought that even though I didn’t go to look for you, you actually delivered yourself right to my doorstep, saved my time from being wasted.”</p><br/><p>“So you are Zero, leader of Akatsuki organization that destroyed Ximen clan, huh? Looking at you, there is nothing great about you, you are merely a kid without even a hair grown, now I think about you being able to destroy Soaring Dragon mountain villa was the contribution of those two mysterious magical beasts of yours.” Looking at Ren Tianyou standing in front of him, Ling Yanqi frowned, then lightly spoke pretending to scorn.</p><br/><p>“Old man, don’t think I don’t know what you are thinking.” As if he had already seen through the plan of Ling Yanqi, Ren Tianyou said with disdain, “You think too highly of yourself, do you think you are worthy enough for me to summon Shukaku and Matatabi?”</p><br/><p>Although, the words of Ren Tianyou seemed extremely rude, Ling Yanqi didn’t get offended, instead felt relieved inside his heart. Because the aim of his words he had spoken was to provoke Ren Tianyou, so that he wouldn’t summon those two terrifying magical beasts. Those magical beasts could destroy an entire mountain peak, so how could he not feel anything but endless dread inside his heart.</p><br/><p>And when Ling Yanqi was pondering, Ren Tianyou quickly began to make a series of hand seals without wasting any time, then yelled.</p><br/><p>“Katon—-Goukakyuu no Jutsu!” (Fire Style—-Grand Fireball Jutsu!)</p><br/><p>Placing his right hand in front of his mouth, he took a deep breathe, then send out a huge fire ball towards the direction of Ling Yanqi. That blazing flame seemed to evaporate the air around it.</p><br/><p>“Not good!” Ling Yanqi who was in the process of pondering suddenly sensed unusual changes in front of him, then looking ahead, he saw blazing fire ball advancing towards him. His heart immediately sunk down, and realized that the situation was not good. Then the huge earth yellow crystal embedded on the top of his magic staff in his right hand flashed with rays of light, and the ground in front of him suddenly swayed violently, split open a huge crack, and a huge earthen wall grew out from the ground, completely blocking his body.</p><br/><p>After this, Ling Yanqi immediately held his magic staff and began to silently whisper, planning to chant large scale magic.</p><br/><p>Alone with the collision of Grand fireball of Ren Tianyou and the earthen wall in the front, a ‘hong’, ‘hong’ , ‘hong’…….loud sound of explosion resounded, and the wall was blown apart. Pieces of huge rocks rained all around, and because of the obstruction of this earthen wall, the intensity of grand fireball also diminished slowly.</p><br/><p>Just then, the preparation of Ling Yanqi’s magic behind the earthen wall was also completed. An earth yellow colored light ball had appeared in front of him, and along with the pointing of his magic staff, this light ball quickly entered into the ground and disappeared.</p><br/><p>“Earth magic—-Earth Hydra!”</p><br/><p>Along with the voice of Ling Yanqi, the ground in front of him suddenly began to tremble violently again, and suddenly started break down in succession, splitting open one huge crack, as if something horrifying wanted to break through the ground and rise.</p><br/><p>Feeling the fierce shaking of the ground, Ren Tianyou who was near couldn’t help but stop grand fireball jutsu, then solemnly looked towards the ground in front. His Sharingan quickly rotated, and with his eyes, he could clearly see a huge amount of earth yellow colored magical power in the process of bubbling out from inside that crack.</p><br/><p>“This is…..” A question couldn’t help but appear inside the mind of Ren Tianyou.</p><br/><p>The practical activity of Ling Yanqi clearly showed what this was all about. A huge snake head made up of rocks suddenly stretched out from that crack, then looking up to the sky, it issued a loud hissing sound, then its eyes made up of the earth system magic element firmly stared at Ren Tianyou.</p><br/><p>But that was still not over, more huge snake heads sprang out from the crack in succession, crushing the ground around them. Altogether nine heads stretched out from inside the ground, but these heads were all attached to one huge snake body, which was extending continuously underneath the ground.</p><br/><p>“This is very similar to that nine headed sea snake I encountered last time in endless sea area ah.” Seeing the sudden appearance of huge hydra, Ren Tianyou frowned as he thought inside his heart.</p><br/><p>Just then, one of the head of the hydra quickly stretched, and opening its mouth, bite towards Ren Tianyou’s body.</p><br/><p>“Even their abilities are same!” Seeing sudden fast extension of the snake head, Ren Tianyou’s eyes firmly shrunk, followed by an unfathomable expression. And after that he quickly moved sideways dodging the attack. Then along with a loud explosion sound, the ground he was standing on just a moment ago was suddenly hit by that snake head creating a huge pit.</p><br/><p>Ren Tianyou had just come to stop his body, when suddenly a huge shadow came through the sky. Looking up, he saw another two snake heads were attacking towards him.</p><br/><p>“F**k, there is no end to this.” Ren Tianyou couldn’t help but curse, then he quickly made a series of hand seals, “Just go to hell for me, Katon—-Goryuka no Jutsu! (Fire Style—-Dragon Flame Jutsu!)”</p><br/><p>Along with the voice of Ren Tianyou, a huge blazing flame shot out from his mouth, which took the form of a huge flame dragon, advancing towards the incoming two snake heads.</p><br/><p>Along with ‘hong’ loud explosion sound, the huge fiery dragon and two snake heads collided with each other, and many pieces of huge rocks continued to rain down from the sky.</p><br/><p>But there was no time for Ren Tianyou to be happy, he suddenly felt vibration coming thorough under the ground he was currently standing on. And a huge snake head with wide opened mouth suddenly broke through from inside the ground, and completely swallowed Ren Tianyou.</p><br/>\n</div>"}