{"title": "Chapter 204: Hatred of Jade Maiden", "id": 204, "volume": 3, "url": "http://boxnovel.org/in-different-world-with-naruto-system-chapter-204-hatred-of-jade-maiden", "volume_title": "Volume 3", "body": "<h1>Chapter 204: Hatred of Jade Maiden</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 204: Hatred of Jade Maiden</p><br/><p>On the other side, one youth similarly dressed in black robe with red clouds imprinted on it who was holding long sword solemnly scanned all around. Just then, suddenly a very fast movement sound came through from his right hand side.</p><br/><p>The complexion of this youth immediately changed, and he hastily swung that long sword in his right hand towards his right side. Then along with a ‘dang’ metal colliding sound, one unusual ultrathin dagger hit his long sword, and the holder of this dagger was one strangely enchanting pretty youth. Seeing his attack was blocked, this youth faintly smiled, then along with soft cyan colored light, his body suddenly changed into a blur and disappeared from that place.</p><br/><p>“Truly unlucky, why did we encounter this bastard Bu Feng here?” Seeing this strange youth had disappeared, the complexion of this youth holding long sword become unsightly, then looking towards other side, “Hope Zero would quickly come here.”</p><br/><p>…………….</p><br/><p>These people were naturally White Tiger and others. When Ren Tianyou had gone out to search Spring of Life, all of them had stayed in Flame Phoenix Villa.</p><br/><p>In the beginning, everyone were extremely curious about this well-known place, so they went sight-seeing around Flame Phoenix Villa everyday with Vermilion Bird as their guide, but after a brief period of time, everyone got bored regarding the environment here, and finally under the suggestion of Vermilion Bird, everyone went to imperial capital of Light Empire, Radiance Capital to play.</p><br/><p>After coming to Radiance Capital, under the lead of Vermilion Bird, everyone had fun and wader around the city in a good mood. But just at that time, the complexion of Jade Maiden suddenly become extremely unsightly, because she saw one person.</p><br/><p>Everyone also discovered the change in her expression, and following her line of sight, they saw one middle-aged man wearing luxurious earth system magic robe walking down the street, and his body was emitting amiable earth system magic aura, giving other people a kind of cordial feeling.</p><br/><p>“What’s up, Jade Maiden?” Seeing the unusualness of Jade Maiden, Vermilion Bird walked in front of her, and asked with concern, because usually Jade Maiden gave her a kind of everything is extremely cool feeling, as if nothing could influence her mood.</p><br/><p>“That person is my personal enemy, and I joined Akatsuki organization because Zero promised me to kill him in my place. He is one of the four big controller of Magic Domain——-Ling Yanqi.” Looking at that familiar figure, Jade Maiden firmly bit her lip and said. She was emitting such dense amount of hatred that people couldn’t help but feel chill down their spine.</p><br/><p>“What? This guy is the guy you wanted to kill? Such coincidence to meet him here.” Hearing Jade Maiden, White Tiger exclaimed. As the oldest member of Akatsuki organization, he naturally knew about this matter. When they were at Tianlong city, Ren Tianyou had mention about this matter to him, so he knew about this matter.</p><br/><p>“Yes, 10 years ago, my whole family of 13 people were killed by this bastard. If it were not for my teacher Yun Mei’er coincidently passing by, and saving me at the last moment, I would have also died at that time in his hand. Every night I always remember the tragic death scene of my whole family, my father, mother, my two elder sister, and the worst however my younger brother who was not even two years old, all of them died in the hands of this guy. At that time, my younger brother was not even two years old, not even two years old ah.” Speaking up to here, Jade Maiden couldn’t help but shed tears. She was practically roaring when she said the last sentence, making nearby passersby repeatedly cast sidelong glances towards them.</p><br/><p>“Humph, what are you looking at, look again and I, your old mother will crush your balls.” Seeing those men looking towards Jade Maiden, Vermilion Bird immediately got angry, then extending her exuberant jade fingers of right hand, she valiantly said a sentence which caused all the men on the scene to sweat immediately.</p><br/><p>“Eh.” Hearing Vermilion Bird, those men looking towards Vermilion Bird and Jade Maiden suddenly felt chill down their crotch, and all of them immediately ran away into the distance.</p><br/><p>And black lines appeared on the face of White Tiger and Void who were standing by the side of Vermilion Bird, and even they couldn’t help but took few steps back with a kind of unnatural expression on their face.</p><br/><p>Vermilion Bird ignored the expression of White Tiger and Void, rather turned around towards grieved Jade Maiden, and walking over to her, she comforted, “Jade Maiden, don’t cry, rest assured, we Akatsuki will definitely not let this beast off.”</p><br/><p>“Yes, elder sister Jade Maiden, since idiot promised you, he will definitely get it done. After idiot return from Elven forest and resurrect elder sister Yue’er, he will help you kill this demon.” Little Yu also comforted Jade Maiden.</p><br/><p>“As a matter of fact, we don’t need to wait for Zero to return.” Just then, White Tiger suddenly said. Then looking at Jade Maiden, he continued, “Since according to Jade Maiden, this guy is at most only peak-God ranked earth system magician, then I myself can absolutely kill him, and even without me, Void alone could also absolutely kill him.”</p><br/><p>Hearing White Tiger, the eyes of Jade Maiden suddenly lit up, and thought inside her heart, “Yes, how could I forget about White Tiger and Void.”</p><br/><p>With the peak-God ranked strength of White Tiger plus his high-Saint rank blood lineage Heaven sword, it could be said that he could absolutely dominate ordinary God ranked expert. And Void with mid-God ranked strength plus that strange Heart death blood lineage, also was not that inferior to White Tiger.</p><br/><p>“Are you sure?” Little Yu anxiously asked. She was still unable to be at ease.</p><br/><p>“Rest assured, sister-in-law, there will not be any problem.” White Tiger shook his head and signaled there was no issue. Then looking towards Void, he asked, “How about it, are you going or should I go this time?”</p><br/><p>“I’ll go.” Void walked forwards and slowly said. Along with his words, the death sword Karma Transmigration on his waist also issued out a light happy chirping sound.</p><br/><p>“But this is Radiance Capital, we however shouldn’t wantonly strike here. When all is said and done this place is headquarter of Light Palace, and if we infuriate them, then we will not have any good reception.” Emitting a light fighting intent, White Tiger said to Void with a smile on his face.</p><br/><p>“Cannot strike here, then draw him outside the city.” Finished speaking, Void changed into blur, and disappeared from that place, leaving behind a sentence, “All of you wait for me in the plain 2 li outside the city, I’ll draw this guy there.”</p><br/><p>“He he, didn’t expect the temper of this paralyzed face man was this impatient.” Seeing the disappearance of Void, White Tiger helplessly smiled, then said towards Jade Maiden and others, “Let’s go outside the city and wait for him to attract that guy there.”</p><br/><p>“Okay.” Jade Maiden and others replied. Then they quickly rushed outside the city. But what White Tiger and others didn’t know was, in the dark, a pair of eyes were staring at them.</p><br/>\n</div>"}