{"title": "Chapter 205: Lightning speed—-Bu Feng", "id": 205, "volume": 3, "url": "http://boxnovel.org/in-different-world-with-naruto-system-chapter-205-lightning-speed%E2%80%94-bu-feng", "volume_title": "Volume 3", "body": "<h1>Chapter 205: Lightning speed—-Bu Feng</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 205: Lightning speed—-Bu Feng</p><br/><p>Not far from the city, White Tiger and the others were waiting. They were thinking, with the strength of Void, plus his mid-saint ranked blood lineage Heart Death, dealing with one peak God ranked magician ought to be no problem.</p><br/><p>And along with the passing of time of about half an hour, they noticed two huge flowing lights far-off in the sky, one grey, and one yellow, were flying towards them.</p><br/><p>“Great, Void finally came.” Seeing those flying lights in the sky far away, with great excitement on his face, Vermilion Bird was ready to jump on to fly in the sky, to help Void.</p><br/><p>“Wait a minute, there’s something wrong.” White Tiger suddenly appeared in front of Vermilion Bird and stopped her.</p><br/><p>“What’s wrong?” Seeing White Tiger was solemn, Vermilion Bird and others couldn’t help but were distracted, and confusingly asked.</p><br/><p>White Tiger didn’t answer them, rather continued to stare at those two lights in the sky. As the strongest person among everyone here, he clearly sensed enormous pressure being transmitted from that yellow radiance following behind.</p><br/><p>When those flying lights increasingly approached, sharp-eyed White Tiger immediately saw that the person flying towards them in the front was Void, and blood was flowing out from his mouth, he clearly was seriously injured.</p><br/><p>“Not good. This bastard basically is no longer God ranked magician, he has already advanced to boundary of God’s domain. Void cannot handle it now, we should quickly go and help him.” White Tiger clearly recognized that magical power, so White Tiger knew that he was no longer any God ranked magician, he must’ve already advanced to at least the boundary of God’s domain.</p><br/><p>Otherwise, it was impossible for Void to receive such heavy injuries in such short period of time, moreover relying on his own strength, it was also impossible for his body to sense such enormous pressure.</p><br/><p>“What? How could this be?” said White Tiger. Vermilion Bird and the others involuntarily quivered, and shrieked in disbelief, especially Jade Maiden, she had never thought that this bastard would actually advance to boundary of God’s domain this quick. Two years ago, her master Yun Mei’er had undoubtedly fought with him once, and stated that he had just advanced to peak-God rank that’s all. But now merely after two years, how could it be so fast.</p><br/><p>“Don’t tell me that this bastard already cracked through the secrets of Earth Heaven Crystal?” Jade Maiden thought inside her heart. Without a doubt, it was because of the Earth Heaven Crystal, her whole family was exterminated, as treasuring a jade ring was considered a crime, and that was the only reason.</p><br/><p>“We should quickly rush over to help.” When Vermilion Bird heard this magic power was that of God’s domain magician, she already knew that this was bad, a powerful flame appeared around her body and with faint cry of phoenix, she quickly launched towards the sky.</p><br/><p>Just when White Tiger intended to fly over to help Void, suddenly in the midst of his perception, a burst of loud movement sound came through from his right side, attacking towards Little Yu.</p><br/><p>“Good galls!”</p><br/><p>White Tiger gave out a roar, he had never though that there actually was hidden assassin here, moreover the target was Wang Yuxin. If anything was to happen to Wang Yuxin here, then with the character of Zero, he don’t know what he would do.</p><br/><p>“Swish!” White Tiger instantly appeared in front of Wang Yuxin, and the long sword on his back automatically unsheathed itself and flew into his hand. After that, along with the ‘dang’ sound, a strange dagger hit on his long sword, and a pretty young man wearing white colored dress appeared on the right side.</p><br/><p>Seeing his attack blocked, the lad in white colored dress was slightly dumbfounded, as he had never expected that his assassination attempt would be blocked. Then with the sudden appearance of pale cyan colored radiance on his body, his body continuously changed into several afterimage, instantly moving several tens of meters back.</p><br/><p>“White Tiger.” Seeing the sudden appearance of the young man, Jade Maiden and others were startled and thought about helping White Tiger.</p><br/><p>“You all, quick, go to help Void, he won’t be able to hold on much longer. Also quickly send the signal to Zero, we must hang on until he returns.” White Tiger commanded Jade Maiden and others. Compared to anyone, the pressure over Void was greatest, and now in a situation like this, they had no other choice but to hang on until Zero returns. It was basically impossible for them who were merely God ranked and Saint ranked to deal with even one expert of God’s domain.</p><br/><p>“Fine, but you have to be careful.” Jade maiden earnestly said to White Tiger, then directly flew towards Void. And on the way there, everybody used the rings on their hand to send distress signal to Ren Tianyou, using the method Ren Tianyou had taught them.</p><br/><p>………………</p><br/><p>“Who the hell are you, you are not people from Magic domain.” Looking at that youth wearing white colored dress and holding a strange dagger, White Tiger holding the long sword on his hand asked in a serious manner. This guy was at least Mid-God ranked expert in strength, but his speed nevertheless was incomparably fast. Initially White Tiger estimated this guy’s speed to be at least 4 times faster than his speed.</p><br/><p>This result filled White Tiger’s heart with horror. You already know that White Tiger also practices quick sword, and his speed in itself was not slow, but although the strength of this guy before his eyes was lower than his, his speed nevertheless was too fast.</p><br/><p>“Pursue star, overtake moon!” Listening to White Tiger, this young man in white colored clothing didn’t answer directly to the question, rather lightly speak out two strange terms.</p><br/><p>“Pursue star, overtake moon?” Hearing this young man, White Tiger didn’t came up with answer instantly, but when he carefully looked at the clothes of this youth, moreover that strange dagger on his hand, as well as those words he had just speak out, a figure of a person instantly appeared in his mind, “You are Lightning speed Bu Feng?”</p><br/><p>“Yes, I am Bu Feng!” surprised with the question of White Tiger, the young man i.e. Bu Feng didn’t deny, but directly confirmed.</p><br/><p>The complexion of White Tiger instantly become unpleasant, as he thought, “We are truly unlucky, how could we let this bastard Bu Feng eye on us?”</p><br/><p>It was not strange for White Tiger to become unpleasant. Bu Feng, this name was too famous in Divine Wind continent, he was such famous expert that there was practically no one among the experts who didn’t know him.</p><br/><p>Bu Feng, no one knew his background, he was just like a person filled with a layer of dense fog. He had never joined any force, merely was one free solitary assassin. He normally come in contact with Assassin guild to take mission of assassination to maintain his livelihood.</p><br/><p>And form the time he entered the Assassin guild, he had completed all the mission he had with 100% success rate. But what truly made him famous was, 5 years ago, with merely Peak-Saint ranked strength, he actually directly assassinated White clothed Bishop Qian Duyun who was Mid-God rank in strength at that time, in a hall of Light Temple, before the eyes of innumerable people, and then under the blockade of thousands of well-known guards, he swaggered off, as one may truly say, ten steps kill one person, and thousand li across, no one remain walking.</p><br/><p>And after the successful assassination of the White clothed Bishop, Bu Feng’s reputation truly reverberated throughout the entire continent, one might as well say that he was known to every household. Therefore, the Light Temple dispatched five Red clothed Cardinal, furthermore, its three team of Golden Knights to pursue and kill Bu Feng, but even after five years, Bu Feng was still alive and fine.</p><br/><p>All of that was naturally because of the speed of Bu Feng. He was fastest person in Divine Wind continent, his speed was unmatched, and even if he was unable to defeat people, he could easily flee relying on his speed. If he wanted to run, basically no one could keep up with him.</p><br/><p>And moreover, he become famous with his two moves, precisely ‘pursue star’ and ‘overtake moon’. One can assume that these two moves brings out to play his speed to its maximum. Basically, no one could successfully dodge this, unless you depend on your powerful defense to withstand it.</p><br/><p>Three years ago, Bu Feng was surrounded by two Red clothed Cardinals with a team of Golden Knights, he was careless, so with no other choice Bu Feng directly used ‘pursue star’ and ‘overtake moon’, and he massacred 12 Peak-Saint ranked golden knights plus one God ranked leader of golden knight, in front of the Red clothed Cardinals who were experts of boundary of God’s domain, then fled.</p><br/><p>Bu Feng had left behind some words before he left right in the face of the two Red clothed Cardinals, “Although I am powerless against you two, but if I want to kill people, you are not able to protect them.”</p><br/><p>Yes ah, I cannot kill you, but you also cannot do anything to me, even if you are next to me, if I want to kill people I can kill them as usual. I can completely regard you as an air, and there’s nothing you can do to me.</p><br/><p>Since then, everyone called Bu Feng as Lightning speed—–Bu Feng, which was because of his fast speed that almost reached the pinnacle. And the ‘pursuing stars’ and ‘overtaking moon’ also became his synonym.</p><br/>\n</div>"}