{"title": "Chapter 227: Might of Hiraishin", "id": 227, "volume": 3, "url": "http://boxnovel.org/in-different-world-with-naruto-system-chapter-227-might-of-hiraishin", "volume_title": "Volume 3", "body": "<h1>Chapter 227: Might of Hiraishin</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 227: Might of Hiraishin</p><br/><p>Inside the woods, a man wearing black robe with red clouds imprinted on it and a giant ape type magical beast with long golden hairs all over were confronting each other. This magical beast was God ranked magical beast—-Feili King Kong Beast, who carries a terrifying power. Its single punch or kick possess enough power to destroy a small mountain.</p><br/><p>The eyes of this youth was blood-red in color, and inside each of his eyes, there were quickly spinning three magatama. This youth was Ren Tianyou who had taken Akatsuki members for seclusion training in the seas. Right now it had already been three months since they arrived here in this island.</p><br/><p>In this period of time, Ren Tianyou had already learnt basic of Hiraishin no Jutsu. Now he could use Hiraishin no Jutsu for simple moves. And right now he was in the process of using Hiraishin no Jutsu in actual combat to take a look at the might of Hiraishin no Jutsu.</p><br/><p>“Roar, wicked human, actually dare to disturb my rest, I will tear you to shreds.” Staring at Ren Tianyou in front of it, this terrifying Feili King Kong beast roared.</p><br/><p>“Bah, who can’t talk big, beast. Do you have ability?” Ren Tianyou said with disdain. If it was not the case for him wanting to test Hiraishin no Jutsu, with merely its God rank strength, how could this magical beast be able to survive single attack of Ren Tianyou.</p><br/><p>“Roar! I will tear you apart.” Hearing Ren Tianyou’s those disdain words, this beast angrily roared and immediately rushed quickly towards Ren Tianyou. Those huge four limbs gave out loud vibrating sounds.</p><br/><p>“Humph, all brawn no brain beast.” Seeing directly charging beast, Ren Tianyou coldly snorted with disdain. Then with a swing of his hand, he directly threw a special kunai towards Feili King Kong Beast.</p><br/><p>Seeing incoming kunai, Feili King Kong Beast waved its hand. Along with the ‘peng’ sound, this kunai was directly hit causing it to send flying downwards to its underfoot ground.</p><br/><p>Just then, the cold voice of Ren Tianyou suddenly came from through the front, “Katon—-Goukakyuu no Jutsu!” And a huge blazing fire ball spat out from the mouth of Ren Tianyou towards the beast.</p><br/><p>“Roar!” Feeling the heat coming from the blazing fireball, Feili King Kong Beast roared, then directly swung its right fists towards this blazing fireball.</p><br/><p>“Peng!” This huge fireball was directly punched through with a single fist, completely scattering it. When this fireball changed into sparks and disappeared, Ren Tianyou had a smile on his face. Then he immediately disappeared from that place.</p><br/><p>After destroying the fireball, before this beast could become happy, it heard a movement sound coming through its right hand side. And a sturdy right leg directly knocked down its head. Then the huge power in this kick was directly transmitted to its brain nearly knocking it unconscious on the spot.</p><br/><p>Moreover before it could react, a heavy palm directly landed on its abdomen causing it to involuntarily bend. After that the youth in front of it kicked it flying in the sky.</p><br/><p>While flying in the sky, Feili King Kong Beast stabilized its body with great difficulty. Then lowering its head, it carefully looked towards Ren Tianyou, but it however failed to notice a mysterious curse seal marked on its abdomen where Ren Tianyou had hit just a moment ago.</p><br/><p>Looking at the beast in the sky, the eyes of Ren Tianyou shone, then he disappeared from that location.</p><br/><p>“What?” Seeing Ren Tianyou had suddenly disappeared, Feili King Kong Beast suddenly realized this situation was not good, and he simultaneously heard movement sound from above him. Looking above, it saw Ren Tianyou had already arrived in the sky above its head, and his right hand was holding a huge energy ball.</p><br/><p>“How could he be so fast?” Seeing Ren Tianyou, this was the final thought that appeared inside the mind of this beast.</p><br/><p>“Go to hell, Choodama Rasengan!” Ren Tianyou yelled loudly. The huge rasengan of His right hand directly landed on the abdomen mark of Feili King Kong Beast. It’s that huge body was directly sent flying downwards to the ground in high speed. Along with a loud explosion sound, a huge cloud of dust rose and engulfed the explosion area.</p><br/><p>And Ren Tianyou also disappeared in the sky and appeared on the ground. After the cloud of dusts disappeared, he saw a huge crater had appeared on that place with cracks spread all around it. And in Feili King Kong Beast was lying in the middle of this crater. The flesh of its abdomen was blown into pieces, and blood was continuously flowing out from inside. And after he stabbed his long sword through its throat, its life was ended.</p><br/><p>“He he, never thought the might of this Hiraishin no Jutsui is actually this powerful. I only used few simple ninjutsu to end God-ranked magical beast. Really deserve to call number one auxiliary ninjutsu of Naruto world.” Looking at that died with remaining grievance beast, Ren Tianyou sighed inside his heart.</p><br/><p>Just a moment ago, he first used Fire style to attract its attention, then taking advantage of this chance, he used Hiraishin no Jutsu to appear in front of it, after that used taijutsu to kick it flying in the sky, and simultaneously marking its body with Hiraishin no Jutsu mark. After that he used Hiraishin no Jutsu to follow it in the sky, used Coodama Rasengan to hit it, and finally use Kusanagi sword to finish its life.</p><br/><p>Within this extremely short period of time, Ren Tianyou completed three or so attacks. And the life of this caught off guard Feili King Kong Beast was ended.</p><br/><p>“Ng, this ninjutsu really is powerful. It seems I need to seize the time to become proficient in it.” Ren Tianyou walked forward, and pulled out Kusanagi sword stabbed in the throat of Feili King Kong Beast. Next using Kusanagi sword, he dug out its magic core. A god rank magical beast core was very valuable, so he didn’t want to leave here it in vain.</p><br/><p>“Ng, since testing of Hiraishin no Jutsu is complete, I should go back and continue cultivating.” Looking all around, Ren Tianyou muttered, and he simultaneously disappeared from there.</p><br/><p>In the room of Ren Tianyou, a special marked kunai was stuck on its floor. And this moment, Ren Tianyou directly appeared inside the room. Then looking at that special kunai stuck in the floor, he smiled. After that creating two shadow clones, he began his daily training, one polishing his Sharingan, other studying Hiraishin no Jutsu and his real body refining Forever Green inside his body.</p><br/>\n</div>"}