{"title": "Chapter 237: Yin Dragon Clan", "id": 237, "volume": 3, "url": "http://boxnovel.org/in-different-world-with-naruto-system-chapter-237-yin-dragon-clan", "volume_title": "Volume 3", "body": "<h1>Chapter 237: Yin Dragon Clan</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 237: Yin Dragon Clan</p><br/><p>“Swish”, “swish”, “swish”…..sounds unceasingly resounded, and those countless huge red-hot bolides which were over two meters in diameter directly fell down from the sky. “Hong”, “hong”, “hong”….successive sound of explosion unceasingly resounded. Entire Magic Domain was suddenly engulfed with these meteors. Those huge Magic Towers collapsed in succession, each and every magicians of Magic Domain who thought themselves to be cut above other people lost their power to resist in this moment. The face of everyone were filled with dread of death about to befall on them. But this dread didn’t continue for very long, because they were engulfed by this immense explosion, and died without leaving behind intact bones.</p><br/><p>Because the range of this attack of Ren Tianyou was too large, even the surrounding cliffs of Magic Domain were also engulfed. Large amount of meteors fell down on the cliffs too, which brought about a series of loud exploding sounds. Those cliffs unceasingly shook, and pieces of huge rocks directly tumbled down into the Magic Domain. Suddenly the Magic Domain suffered one disaster after another.</p><br/><p>And all those people who were able to successfully escape the range of explosion were standing far away. Looking at that place engulfed by those countless bolides, huge explosions, huge flames and heat wave, and pieces of burning hot rocks, all of these people were terrified, cold sweat involuntarily flow down from their forehead. All of them were pleased with themselves for successfully escaping this disaster. If they were even a bit slow, then majority of them would have lost their lives.</p><br/><p>On the distant place, Ximen Han, Ximen Wuwang and Lei Wuyi were watching the destruction of far-off Magic Domain. The face of Lei Wuyi exposed a grieved expression. This Magic Domain was the place where he and his ancestors had poured painstaking effort, but now it was destroyed like this, four leaders and the current Domain Master Fen Tian also died, and there was also countless casualties among those magicians who had yet to enter boundary of God’s domain. Now in entire Magic Domain, only he was left who was now just a general without an army.</p><br/><p>Looking at those still continuously falling meteors, regarding Akatsuki organization and Ren Tianyou, if Lei Wuyi said he didn’t hate them, then that would naturally be a lie, but the fear towards them far surpassed the hatred inside his heart. He feared dying, he feared those breeding like flies means of Akatsuki organization, moreover he feared Ren Tianyou’s that move which seemed capable of destroying world. He had lived for several hundred years, making him treasure his life even more. He felt as long as he was alive, then any matter could turn for a better. As a result when Fen Tian spoke he wanted to live and die with Magic Domain, he however cowered, he feared, so he turned around and fled without slightest hesitation.</p><br/><p>Now he saw the Magic Domain was already destroyed completely. All those originally towering Magic Towers were already buried in a sea of flames, changing into broken bits. So before Ximen Han and Ximen Wuwang could take a note of him, he stealthily retreated several steps back. After that before anyone could notice his movement, he actually turned around and stealthily fled this battleground.</p><br/><p>“Eh, where is that Lei Wuyi of Magic Domain?” After a short while, Ximen Wuwang discovered Lei Wuyi was missing, so he couldn’t help but ask Ximen Han in surprise.</p><br/><p>“I also didn’t see him, but it doesn’t matter. Although the might of this move was very powerful, nevertheless all in all, both of us are completely unscathed. And I guess even for that beast Zero, it was not that easy to use this move. Moreover now we two only need to stall him for a very short time until the Dragon clan arrive. And when that time comes, this boy will absolutely die.” Ximen Han slowly said.</p><br/><p>Shortly afterwards, both of them stood back to back, and were extremely alert for any of Ren Tianyou’s surprise attack. But the unexpected thing for them was, even after three minutes, Ren Tianyou didn’t show up.</p><br/><p>Just then, from the sky above their head, suddenly a loud sound of space cracking come, then the space slowly cracked creating a huge black hole in the sky. And from inside that black hole, loud roars of dragon came out.</p><br/><p>“They are finally here.” Hearing those familiar Dragon roar, Ximen Wuwang and Ximen Han looked at each other’s face, and saw excited expression in each other’s eyes.</p><br/><p>Along with the sound of Dragon roar becoming louder and louder, those people far away clearly understood that Dragon clan whom Ximen clan relied on had finally arrived. Now the real battle would begin.</p><br/><p>Four Dragon clan emitting huge power slowly flew out from inside that black hole. Shortly afterwards, a middle-aged man wearing feminine Chinese clothing flew out from inside the black hole and stood in the sky.</p><br/><p>“We pay respect to Your Highness Camilla.” Seeing that middle-aged man in the sky, Ximen Han and Ximen Wuwang looked at each other’s face with excitement. They had never expected His Highness Camilla himself would come this time around. Afterwards both of them simultaneously bowed respectfully towards that middle-aged man, and greeted respectfully.</p><br/><p>“No need for these mere formalities, where is that bastard who killed our over 20 dragon clan? I can feel the aura of that guy here.” Camilla waved his hand, then loudly asked Ximen Wuwang and Ximen Han.</p><br/><p>“Reporting back to Your Highness Camilla. This person was still here until just a moment ago. Just a moment ago, he used a move to thoroughly destroy this valley, after that he disappeared and never showed up again. Now it’s already been four minutes since he disappeared.” Ximen Wuwang respectfully answered. Then pointed towards Magic Domain which had already turned into ruins and said.</p><br/><p>Camilla looked over towards the direction pointed out by Ximen Wuwang, then his pupil instantly shrunk, “This is.”</p><br/><p>He only saw ruins in front of him. In the valley there were pieces of incomplete Magic Towers, and countless not intact corpses were scattered all over the ground. Moreover there were countless craters on the ground, and inside those craters, one could vaguely see a number of broken-down corpses, arms, legs, heads, and so on.</p><br/><p>“Is this the work of that guy?” Seeing this sight, Camilla a little bit solemnly asked.</p><br/><p>“Yes Your Highness Camilla.” Ximen Wuwang respectfully answered.</p><br/><p>“It seems this guy is not too weak.” Looking at that disaster, Camilla solemnly thought inside his heart. He could also do the same thing in front of him, but he need to spent huge amount of effort.</p><br/><p>“Eh, didn’t expect this time Dragon clan actually send True God realm expert. It seems that kid will suffer this time. Wait if he persist continuously, then he might be able to take him down. By the way, where did this guy learn nature magic?” From the hidden place, seeing the appearance of Camilla, Elf Queen was a little bit surprised. She had never thought that this time Dragon clan would actually be so ruthless, sending out a top seat True God, and four Peak-High God realm Dragon Clan experts. As for why that Camilla was in human form, that was naturally because after Dragon clan step into True God realm, they would transform into human form.</p><br/><p>“Did that boy run away?” After not discovering the trace of Ren Tianyou even after looking around, Ximen Wuwang couldn’t help but said with some uncertainty. Normally after Ren Tianyou destroyed Magic Domain, he had already reached his goal of this time. Moreover he had definitely spent huge amount of his power for that move of just a moment ago, so withdrawal was also very possible.</p><br/><p>“Humph, he can’t run. Because he has soul mark of our Dragon clan on his body, even if he runs to the ends of the earth, I can still find him.” Camilla snorted coldly in disdain, then closed his eyes intending to use the secret magic of Dragon clan to find the track of Ren Tianyou.</p><br/><p>In the distance place within the valley, Ren Tianyou quietly stood there. Along with the disappearance of his shadow clone by his side, the chakra within his body was instantly replenished.</p><br/><p>“Finally Dragon clan came, it’s time to take action.” Finished speaking, Ren Tianyou made a hand seal, “Shadow Clone Jutsu!”</p><br/><p>Along with ‘peng’, ‘peng’ sound, two white colored smoke appeared. Then two exactly same shadow clone appeared by the side of Ren Tianyou.</p><br/><p>After that Ren Tianyou extend his right hand, and those two shadow clones unceasingly waved their hand around the chakra gathered by Ren Tianyou. After that along with ear-piercing sharp sound, a huge wind shuriken which was continuously spinning appeared above his right hand.</p><br/><p>“Hei hei, first I will give you a big gift.” Ren Tianyou mischievously laughed, then those two shadow clones by his side changed into white smokes and disappeared. Then with the wave of his left hand, Ren Tianyou also disappeared form that place.</p><br/><p>And at the same time, in the place where Ximen Wuwang and other were gathered, Camilla had just closed his eyes intending to use the secret magic of Dragon clan to search the track of Ren Tianyou. Just then, suddenly a cold voice entered their ears, “No need to search, I’m here.”</p><br/><p>Instantly everyone including Camilla raised their head and looked towards the origin of voice. But after raising his right hand’s huge shuriken, Ren Tianyou suddenly appeared in the middle of everyone, then looked everyone around with stern countenance, and said, “Receive my big gift, Wind Style—-Rasenshuriken!”</p><br/><p>Finished speaking, the Rasenshuriken in his right hand directly hit Ximen Han, then without wasting any time, he disappeared from that place using Hiraishin no Jutsu, and appeared on far-away mountain.</p><br/>\n</div>"}