{"title": "Chapter 243: Exchanging Eternal", "id": 243, "volume": 3, "url": "http://boxnovel.org/in-different-world-with-naruto-system-chapter-243-exchanging-eternal", "volume_title": "Volume 3", "body": "<h1>Chapter 243: Exchanging Eternal</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 243: Exchanging Eternal</p><br/><p>Ren Tianyou took that magic staff, and when he touched that Earth Heaven Crystal with his right hand’s index finger, suddenly a system prompt sound unexpectedly rang in the mind of Ren Tianyou.</p><br/><p>“Congratulation to host for finding Earth element’s condensed product—-Earth Emperor Crystal’s fragment. If host let system absorb it, then host will be rewarded with 7.5 million system points.” This sudden voice of Naruto system instantly froze Ren Tianyou on the spot.</p><br/><p>His face was filled with shock, as well as disbelief and unexpected pleasantly surprise expression, as if he encountered something much unexpected.</p><br/><p>“Zero, what’s up, are you fine?” Just then, Ren Tianyou suddenly heard someone calling him, and instantly sobered up. Then he saw Jade Maiden unceasingly shaking her right hand before his eyes.</p><br/><p>“Eh, I’m fine, no need to worry.” Ren Tianyou adjusted his state of mind, then holding that magic staff, he said to Jade Maiden, “Thank you Jade Maiden, this thing is very useful to me.”</p><br/><p>“Don’t mention it, you’ve earned it. Speaking about it, after our family obtain this thing, it didn’t bring any fortune to our family, instead attracted the calamity of extermination of my family. Now handing it over to you however settled one of my worries.” Looking at that earth yellow colored crystal core embedded on the magic staff, Jade Maiden said with a complex expression on her face. Precisely this one crystal core however attracted a calamity which exterminate her family. Perhaps this was the reason why people said treasuring a jade rings becomes a crime.</p><br/><p>“Well, don’t be sad, all in all this matter is already long passed. Now there is also no mission, so everyone rest well. I have something to do, so I am returning to my room first.” After comforting Jade Maiden once, he was unable to hold himself back to return back to his room with that magic staff.</p><br/><p>“What’s going on with Zero?” Seeing Ren Tianyou hastily returning back to his room, Vermilion Bird curiously asked.</p><br/><p>“I also don’t know, perhaps he is too tried because of that big battle of just a moment ago.” White Tiger scratched his head, and expressed his thought.</p><br/><p>“Then let him take a rest. Now everyone come, let’s drink, everyone was quite tense these past few days, now we can finally relax properly.” Taking the sky fragrant alcohol from the table, Great Bear called everyone to drink.</p><br/><p>……………….</p><br/><p>After returning to his room, Ren Tianyou closed the door, and sitting cross-legged on the bed, his consciousness sank into his brain’s sea of consciousness. After that entering into that familiar Naruto System interface, Ren Tianyou immediately asked, “System, what was that back then? Is the value of this crystal core really 7.5 million system points?”</p><br/><p>“Yes, this crystal core in itself is Earth element’s crystallization—-Earth Emperor Crystal. This is the heavenly treasure on the level of that Forever Green you had found in Elf clan.” System slowly explained to Ren Tianyou.</p><br/><p>“Forever Green level heavenly treasure?” Hearing the explanation of System, Ren Tianyou recalled that Forever Green he had obtained inside Tree of Life in Elf clan. But at that time system had stated that if he let System absorb it, then he however would get 100 million system points, moreover all the functions of the system would be unlocked. So why was there such a huge gap even though both of them were same level treasure?</p><br/><p>“That is not right System, if this is heavenly treasure on the same level of Forever Green, then why is its value only 7.5 million points?” Ren Tianyou confusedly asked to System.</p><br/><p>“Like I said just a moment ago, this is not complete Earth Emperor Crystal, it is only a fragment of Earth Emperor Crystal nothing more.”</p><br/><p>“Fragment of Earth Emperor Crystal? How could that be?” Hearing System, Ren Tianyou couldn’t help but become confused.</p><br/><p>“The real Earth Emperor Crystal is the aggregate of all the earth element in this world. Just like its name suggests, ‘Earth Emperor’, it is the emperor of all Earth element. If one absorb the earth element power inside it, then the earth elements between Heaven and Earth however would change his/her physique into Earth Emperor Body. After that his/her every movement would bring about a powerful feeling of earth’s profoundness and heaviness.” System slowly explained to Ren Tianyou. “But this piece of crystal core nevertheless is only a piece of Earth Emperor Crystal after it was disintegrate encountering unknown mishap. Moreover Earth Emperor Crystal had already lost majority of its energy when it disintegrated, so its value is very lacking.”</p><br/><p>“Turned out to be so.” Ren Tianyou nodded his head, then looking at this piece of Earth Emperor Crystal, he asked, “System, according to you, these heavenly treasures are very rare that can only be encounter by chance, but cannot be sought for, but here I encountered two such treasures in an extremely short period of few years, it seems my luck is very good, isn’t that so?”</p><br/><p>“Humph, obtaining me in itself is a kind of as large as heaven luck.” Hearing Ren Tianyou’s that self-important voice, System coldly snorted in disdain.</p><br/><p>“Ha ha, well, since I don’t have any big use for it, you can absorb it. After that I will exchange Eternal Mangekyo Sharingan with the reward system points.” Ren Tianyou took out that crystal core from that magic staff, then threw that magic staff to one side and holding this crystal core, he said to System.</p><br/><p>Ren Tianyou had never thought to have such a lucky break, now he was actually able to exchange Eternal Mangekyo Sharingan. According to his beginning plan, only after next three or so years, he might be able to exchange it, but now, not only could he exchange it, furthermore there was several million surplus system points.</p><br/><p>“Okay, initiating to absorb Earth Emperor Crystal!” After hearing Ren Tianyou, System replied. Then began to absorb that crystal core in the hand of Ren Tianyou. A vigorous golden colored energy suddenly gushed out from the brain of Ren Tianyou, which surrounded that crystal core in his hand. Instantly this Earth Emperor Crystal changed into earth yellow colored energy and began to enter the body of Ren Tianyou, flowing all the way to the sea of consciousness of Ren Tianyou.</p><br/><p>“Ding, congratulation to host for absorbing Earth Emperor Crystal, Reward: 7.5 million system points.” After waiting nearly 5 minutes, the sound of system was transmitted directly into his brain. After that Ren Tianyou opened his eyes and looked at his system points. Sure enough, his system points were already increased by 7.5 million system points. Now he had total of 8.1 million or so system points. This however was huge sum of system points he had never had before.</p><br/><p>“System, I want to exchange Eternal Mangekyo Sharingan, I want every Mangekyo Sharingan I have already exchanged merged together.” Ren Tianyou said to System.</p><br/><p>“Okay, exchanging Eternal Mangekyo Sharingan requires altogether 2.5 million system points. Before exchanging, may I ask which Susanoo host want to keep?” System voice sounded in the mind of Ren Tianyou.</p><br/><p>“Which Susanoo I want to keep? What does this mean, System?” Hearing System, Ren Tianyou couldn’t help but ask in surprise.</p><br/><p>“Eternal Mangekyo Sharingan is the ultimate evolution of Sharingan. After awakening Eternal Mangekyo Sharingan, each corresponding original doujutsu of two eyes—-Susanoo would also reach its ultimate evolution, becoming complete body Susanoo.”</p><br/><p>“But once evolved to Eternal Mangekyo, all the susanoo of other eyes will gradually disappear, their strength will be concentrated to one Susanoo’s form, strengthening its strength. This is the reason I asked which Susanoo you want to keep.” System slowly explained to Ren Tianyou.</p><br/><p>After hearing the System, Ren Tianyou pondered for a long time, slowly considering the uses of Susanoo’s form and performances. Uchiha Itachi’s Susanoo had Totsuka Blade that could seal everything, Yata Mirror that could reflect everything, and Yasaka Magatama for long range attack. Uchiha Sasuke’s Susanoo had bow and arrow for extremely long range attack, as well as after Eternal Mangekyo Sharingan, his Susanoo had Amaterasu ball. And his own Susanoo had Futsu no Mitama sword, which possessed power to control myriad of thunder, moreover could also seal all soul.</p><br/><p>“System, exchange Eternal Mangekyo Sharingan.” Ren Tianyou suddenly opened his eyes, and resolutely said, “As for Susanoo, keep………”</p><br/>\n</div>"}