{"title": "Chapter 240: Death God’s Reap", "id": 240, "volume": 3, "url": "http://boxnovel.org/in-different-world-with-naruto-system-chapter-240-death-god%E2%80%99s-reap", "volume_title": "Volume 3", "body": "<h1>Chapter 240: Death God’s Reap</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 240: Death God’s Reap</p><br/><p>After this dragon’s soul was extracted out from its body by the scythe of that huge projection made up of energy, this soul looked all around in alarm and panic, causing it to see it was getting increasingly farther away from its own body. This soul was surrounded by the strange ash colored substance, and was basically unable to move, so it couldn’t help but issued an alarmed and panicky roar, but now issuing out even a sound was very difficult, as its entire soul was already under the control of Void.</p><br/><p>This move of Void was a secret skill of Death clan that Void was able to use only after he advanced into Boundary of God’s domain—-Death God’s Reap. This principle of this move was, using their Death clan’s blood lineage to connect with Death Domain, then opening the Death Door, summoning the Master of Death Domain——Death God’s projection. The user of this move could use Death God’s projection to instantly kill the expert who were at most one big realm greater them himself by extracting their soul.</p><br/><p>Although it seems this move was extremely powerful which could instantly kill any expert who was one realm greater them the user, but from the point view of Death clan, this move however was downright chicken ribs move. It was so because this move had many restriction. [T.L: chicken ribs=extremely weak]</p><br/><p>First: This move’s prerequisite was, had to open special Death door to summon Death God’s projection. And to open this Death Door, they must first arrange special magic formation. And this magic formation was very tedious to set up. When Void and jade Maiden had set it up here together according to the instruction of Ren Tianyou, it had taken full three hours to completely set it up.</p><br/><p>Second: According to how much energy was inputted determines how long it would take to activate this move. Under the help of White Tiger and Great Bear these two Mid-God in addition Jade Maiden and Vermilion Bird these two Low God and his own energy, he was finally able to summon Death Door and also summon Death God’s projection only after almost 5 minutes.</p><br/><p>Third: This Death God’s projection can only exist for 5 minutes. After 5 minutes, it will disappear.</p><br/><p>In a real fight, no need to mention 5 minutes, even a split-second was enough to change the tide. Do you think your opponents are fool enough ah, so that they would give you such a long time to open Death Door? The moment you began chanting the incantation, that moment you will be killed.</p><br/><p>As a result this move was nevertheless extremely chicken ribs move for Death Clan. Although its might was very powerful, nevertheless it was too unrealistic to use it in actual combat, so very few people use this move.</p><br/><p>But when Ren Tianyou heard about this move ‘Death God’s Reap’ of Void, his eyes immediately lit up. He thought that he would stall Dragon clan and Ximen clan’s experts, letting Void and others to quickly finish off those four Low God leaders then go to open Death Door, but this plan had two risks. First was whether White Tiger and others could finish four leaders or not. If they couldn’t, then they basically would not have time to go and open Death Door. Second was Ren Tianyou betted the strength of the experts dispatched by Dragon clan would not exceed True God realm. He feared very much, if the Dragon clan dispatched God King realm expert, then the entire matter would change and become extremely troublesome.</p><br/><p>But at that time, White Tiger and Void told Ren Tianyou that all the God King realm experts were basically the strongest strength of the clan. Generally they would never dispatch them unless it concerns very important matter such as danger of the annihilation of their entire clan.</p><br/><p>But even so, Ren Tianyou still had plan B. If his first plan won’t do, then he would use next one, but that plan B might be a little bit more troublesome.</p><br/><p>However everything was already successful now. Now under the control of Void, he had already placed the soul of that dragon into a white colored bottle, then he closed the bottle with its bottle cap. After that taking out one talisman, he stuck it on the bottle. Suddenly an ash colored incantation seal filled the whole battle. This was the incantation seal developed by Death clan focusing on soul, which could effectively control souls, making them unable to move.</p><br/><p>“Good! Now quickly evacuate from this place with others, and also be careful all along the way. And after return to the Sky Fragrant Restaurant of Dark Capital, wait for me.” Seeing everything was successful, Ren Tianyou relaxed. As long as he held its soul, Ren Tianyou had plenty of means to make it open its mouth and speak out the location of Dragon Island.</p><br/><p>“Okay.” Void answered, then quickly left the woods. After meeting with White Tiger and others, under the white colored radiances emitted by Jade Maiden, the aura of everyone disappeared. Then Great Bear waved his right hand causing his body surround by flame, after that two huge wings spread out from his body which surrounded everyone. After that directly changing into light, everyone disappeared from that place.</p><br/><p>Among everyone present here, Great Bear was fastest, so making him take everyone to retreat was not a bad means.</p><br/><p>And after knowing White Tiger and others had already retreated, Ren Tianyou’s those two Moku Bunshin (Wood clone) separately took the divinity crystal of Ximen Han and that huge dragon whose soul was stolen, as these were money ah. And after thinking for a moment, Ren Tianyou took out a long bandage, and directly used sealing jutsu to seal Ximen Han and that dragon. [T.L: I think he used sealing technique use by sand village using some kind of white cloth.]</p><br/><p>After finishing all this, one might well say this time’s goals of Ren Tianyou were already completed perfectly. Ling Yanqi was killed personally by Jade Maiden avenging her whole family, Magic Domain was already destroyed by him, now it no longer exist, and one of the dragon had already fall into his hand, so now he could know the location of Dragon clan very soon. Moreover he had already marked the only Ximen clan inside the woods with Hiraishin’s cursed seal, setting it aside for later use. So now it was time to leave.</p><br/><p>“Hei hei, Ximen clan and Dragon clan, just wait for me. It won’t be very long before I appear before you all once again. When that time comes, I will absolutely give you a big gift.” Looking at tree domain far way, Ren Tianyou quickly made a series of hand seals, “Before leaving, take this small gift in advance. Katon—- Goka Mekkyaku (Fire Style—-Majestic Destroyer Flame!)”</p><br/><p>Ren Tianyou spat out huge flame from his mouth that surrounded the woods in front of him. Immediately this vast forest began to burn rapidly, spreading all over this woods.</p><br/><p>After having done all this, Ren Tianyou immediately used Hiraishin no Jutsu to fly away, returning to Sky Fragrant Restaurant where he had left behind a mark of Hiraishin in advance.</p><br/><p>“Roar, damn it, Sky Dragon’s Nirvana!” Experiencing endless vines as well as that rapidly burning fame, Camilla couldn’t help but roared loudly, then his body released a dim golden dragon shaped energy wave which quickly spread in all direction. Throughout the way, all the trees and flame which encountered this energy wave was destroyed in succession. Those three Dragon clan and Ximen Wuwang were also swept away by this energy wave, causing minor injuries.</p><br/><p>“Are you all right?” Looking at already destroyed trees, Camilla arrived in front of them, and asked indifferently.</p><br/><p>“We are fine Your Highness Camilla.” After wiping the blood from the corner of his mouth and standing, Ximen Wuwang answered respectfully.</p><br/><p>“Where is that wicked human?” Looking all around, Camilla searched for the trace of Ren Tianyou, but this moment, he however discover something was wrong. “Eh? Xilaisite? Where is he?”</p><br/><p>He suddenly discover one dragon was lacking, and he immediately had a foreboding, so he asked people all around him.</p><br/><p>“Your Highness Camilla, I also didn’t see Xilaisite. At the time when this woods suddenly emerged, all of us were separated, so we didn’t know the state of each other.” After looking all around, Ximen Wuwang slightly bowed and answered respectfully. Other three dragons also expressed they didn’t know the state of Xilaisite.</p><br/><p>This split-second Camilla determined Xiliasite had already met with mishap, and the person who was capable to accomplish this was none other than that wicked human. Immediately after that he raised his head and issued an ear-deafening dragon roar, “Roar, wicked human, I will absolutely kill you bastard. I as an eldest prince of Dragon clan Camilla—-Andelie’s name swear, no matter whether you flee to the ends of the earth, I will absolutely tear your body to thousands of pieces.”</p><br/><p>Camilla’s that roar filled with fury resounded throughout the tragic battlefield, which quickly spread in all direction. And those people who had come to watch the battle, around valley silently watch everything that had occurred underneath. This fight of today had completely shocked all those people. That as if heaven destroying and earth exterminating meteors, that instantly changing terrain into woods, and everything else finally made them understand the strength of Akatsuki organization.</p><br/>\n</div>"}