{"title": "Chapter 241: Postwar Disturbance", "id": 241, "volume": 3, "url": "http://boxnovel.org/in-different-world-with-naruto-system-chapter-241-postwar-disturbance", "volume_title": "Volume 3", "body": "<h1>Chapter 241: Postwar Disturbance</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 241: Postwar Disturbance</p><br/><p>After Ren Tianyou left, this battle of magic Domain swept across the entire Divine Wind Continent as if hurricane. Now all the people on the continent knew, Magic Domain was already destroyed thoroughly by Akatsuki organization, becoming a dust of history, which would be lost among the endless currents of history. And the original Magic Domain’s those flourishing scene, noble magicians, and Magic Towers which people yearn for, everything had now already changed into debris.</p><br/><p>Some of those people who were watching this battle had used special alchemy prop ‘Memory Magic Crystal’ to record the entire battle of this Magic Domain, which also spread all over. When people saw the scene of Ren Tianyou flying in the sky and summoning countless bolides which rained down to underneath Magic Domain, every one of them were immediately shocked deeply.</p><br/><p>Seeing those usually noble magicians of Magic Domain, now as if lambs waiting to be slaughtered, lacking strength to even resist and that deep dread they were feeling in the face of those countless bolides, furthermore that heaven destroying and earth exterminating momentum was deeply carved in the mind of those people who were watching the scene from Memory Magic Crystal, as if they were personally on the scene. And especially that final scene where Ren Tianyou had stepped on the head of the expert of Ximen clan Ximen Han, that scene of him regarding everything with disdain was also carved in their brain. Even though Ximen clan had called experts of Dragon clan in the midst of battle, they were also useless, on the contrary Ren Tianyou killed Ximen Han along with the arrival of Dragon clan. And finally Ren Tianyou instantly created a woods, changing the surrounding terrain, which was also deeply imprinted in the minds of those people.</p><br/><p>This battle made various big forces of the continent to finally understand the strength of Akatsuki organization. They were able to exterminate Divine Wind Continent’s well-known Sacred Land of Magic where every magicians of the continent yearns to be part of Magic Domain. In less than half a day of time, Magic Domain become the dust of history.</p><br/><p>Moreover Akatsuki organization’s manner of handling affairs seemed too ruthless. When they first appeared in Ximen clan, there they wiped out nearly half of their younger generation, killed two God’s domain experts, and finally killed over 20 Dragon clan who had come to aid Ximen clan.</p><br/><p>But after Ximen clan’s incident, Akatsuki organization faded out from public eyes. No one found a single trace of them, merely the rumor about someone seeing them in Light Empire circulated. And after three years, just when everyone had almost forgotten about Akatsuki organization, they again appeared mysteriously, and they had directly declared war against magic Domain in high profile. Sure enough, after ultimatum of 5 days, everyone of Akatsuki organization arrived as planned. And just like wild winds sweeping away fallen leaves, directly swept away Magic Domain completely.</p><br/><p>It was exactly as if every time Akatsuki organization appears, they would bring about calamity. Their exactly alike robe’s red clouds were just like scarlet blood, foreboding every time they appear, someone would inevitably shed blood, just like the first time incident of Ximen clan, and now of Magic Domain. When Akatsuki organization had appeared first time, there was not that many death and had also not brought about great destruction like this time, so this time all the forces of continent were a little bit afraid, afraid of Akatsuki organization’s that terrifying power, and also feared their mysteriousness. Even now no one knew Akatsuki organization’s true color, and were also unclear about how terrifying their actual strength was. Right up until now, altogether only six members of Akatsuki organization appeared before everyone. Namely leader of Akatsuki organization Zero, then White Tiger, Void, Jade Maiden, Great Bear, and Vermilion Bird. As for how many member Akatsuki organization possessed, no one was clear.</p><br/><p>But after Magic Domain was easily destroyed by Akatsuki organization, all forces of continent transmitted down a common order, and gave strict order to all the members under their leadership, “No matter who they are, nobody are to offend people of Akatsuki organization. If you offend them, then I’m sorry, you are no longer the member of our organization, whether you live or die, it has nothing to do with us.” They greatly feared Ren Tianyou would come into their organization and use that terrifying move to rain down countless bolides. Naturally there were also some malicious people trying to find people of Akatsuki organization, so that they could kill them to become famous overnight.</p><br/><p>In Dark Capital’s Sky Fragrant Restaurant’s second floor, inside the room, there was one special kunai hanging on the room’s wall. On the handle of this special kunai, stuck a talisman where mysterious incantation was drawn.</p><br/><p>And at that time, Ren Tianyou wearing black robe with red clouds imprinted on it suddenly appeared inside that room. And after looking around the circumstance of this room, as well as seeing special kunai handing on the wall, Ren Tianyou slowly relaxed. After that he placed Uchiha Round Fan on his back into his space ring.</p><br/><p>Right now White Tiger and others still hadn’t arrived back here. So he just used water style to create bathing water in the bathtub, then removing his clothing, he began to bath. He washed clean all the dirt and dusts on his body.</p><br/><p>Finished bathing, Ren Tianyou exchanged the dress of 4th Hokage. Currently outside was in great disorder, and many people were definitely investigating Akatsuki organization, so Ren Tianyou naturally shouldn’t wear that obvious clothing of Akatsuki organization and swagger out. If he did so, then wasn’t that him searching for trouble. Although Ren Tianyou was not afraid of trouble, but he didn’t want to looked for trouble for no apparent reason to spice up their lives.</p><br/><p>After opening the door, he saw elder sister Yue’er and Little Yu were currently sitting in front of the window and drinking tea, while boringly looking outside. After Ren Tianyou came out, both of them notice him.</p><br/><p>“Ah, idiot, you are back. How were things, are you injured?”</p><br/><p>“Little You, how were things, are you alright?”</p><br/><p>Both Little Yu and Muyue simultaneously asked in concern.</p><br/><p>“Hehe, rest assured, I’m fine. Relying on the strength level of those people, they are not qualified to injure me.” Ren Tianyou walked over with a smile on his face and sat down on the empty seat, then explained everything that had happened. These two people in front of him were the closest person to Ren Tianyou in this world, so he didn’t hide any of this matter, “White Tiger and others are already on the way back. I think they will arrive very soon.”</p><br/><p>Ren Tianyou had just finished spoken, and running footsteps sound came through the flights of stairs, as if someone was hastily running upstairs. Hearing these footsteps sound, the eyes of Ren Tianyou immediately shone, the he said with a smile, “Haha, just mentioned, and they are here.”</p><br/><p>Along with the voice of Ren Tianyou, White Tiger and others hastily came into second from the head of staircase. All of them had already changed their clothing. Now they were wearing their usual favorite clothing.</p><br/><p>“Haha, Zero, you are too fast, this space magic is really convenient ah. We expend great effort to run around a great circle to return back, but you have already taken a bath and comfortable sitting here accompanying two beautiful women to drink tea.” White Tiger walked over and seeing Ren Tianyou was already sitting there drinking tea while chatting with Little Yu, he was a little bit envious as he said. With regarding to Ren Tianyou’s that mysterious space magic, he very much envied it, but what is the use of envy, with no cultivation talent, he couldn’t cultivate it.</p><br/><p>And just when Ren Tianyou wanted to reply back, Jade Maiden dressed in plain clothing and white skirt suddenly walked quickly in front of him. And under the inconceivable expression of everyone, she directly kneeled before Ren Tianyou.</p><br/><p>“Jade Maiden, why on earth are you doing this?” Seeing Jade Maiden kneeling in front of him, Ren Tianyou frowned, and asked in confusion.</p><br/><p>“Yes, elder sister Jade Maiden, is there anything you want to say? If you have any difficulty, then everybody will help you to resolve it.” Kindhearted Little Yu directly got up hurriedly and hastily came over to Jade Maiden wanting to support Jade Maiden to stand up.</p><br/><p>“No, I want to think Zero.” Jade Maiden lifted her head, this moment her two beautiful eyes were already filled with rears, “I want to thank Zero. Thanks a lot for giving me this opportunity to personally kill my mortal enemy with my own hand, on behalf of my parents, sister, and my pitiful two years old younger brother’s revenge.”</p><br/><p>“Jade Maiden, you are wrong, first quickly get up.” Ren Tianyou still frowning get up and came over to support Jade Maiden to stand up, then with a stern countenance, he said to her, “When you joined Akatsuki, I personally promised you to help you in your revenge. And this time is counted as me helping you to fulfill my promise of that time. Furthermore from the time you joined Akatsuki, all of us regard you as sister. Even if I hadn’t promised you at that time, do you think if there is someone who had hurt you before, then I will not take revenge for you?”</p><br/><p>“No need to talk about me, just ask everyone else, ask White Tiger, Void, Great Bear and them.” Ren Tianyou pointed towards White Tiger and others in the surroundings, and said to jade Maiden, “You ask them, if someone dare to harm you, even if I don’t raise my hand, will they let it go at that?”</p><br/><p>“Yes, Jade Maiden.” Whiter Tiger walked over and said to Jade Maiden, “Originally I joined Akatsuki because of Ren Tianyou. I deeply respect him as a powerful expert, and also deeply respect him for his character. Originally after I lost in the battle against him, I abide by the promise and joined Akatsuki organization. But now I am most willing to remain in Akatsuki organization, not only because of that commitment, but even more because of everyone. I feel very happy to have you brother and sisters, so if anyone dare to hurt you, then I, White Tiger will be the first one to not let him off.”</p><br/><p>“Yes, originally I joined this organization because of my aunt’s request.” Great Bear also walked over and said to Jade Maiden, “But honestly speaking, that three years training on that isolated island with everyone was something I had never experienced previously. Because I had lost both my parents, from childhood I lead a vagrant life in the continent while cultivating. And was accustomed to drifting clouds and wild storks kind of life by myself. But now knowing you all brothers and sisters, for me it’s really a kind of good fortune.”</p><br/><p>“If anyone dare to injure you or want to injure you in front of me, then he must first ask my hand’s this Great Sun Gaudy Yang Spear.” Looking at jade Maiden, Great Bear directly raised his hand’s spear and said.</p><br/><p>“Insult Akatsuki or its member, kill!” Void as before coldly said few words, but this also make his feeling clear.</p><br/><p>“Thank you, everyone, I also………..” Hearing White Tiger and others, unusually incomparably calm Jade Maiden was choking with sobs in this moment.</p><br/><p>“Elder sister Jade Maiden, don’t cry anymore. Let’s go inside the room and have a good heart-to-heart talk. If there is any matter you want to tell us, then we will help you share responsibility.” Vermilion Bird went to the side of Jade Maiden and placed Jade Maiden’s hand on her neck and walked towards their room. Ren Tianyou gave a meaningful glance to Little Yu and elder sister Yue’er. After receiving the hint from Ren Tianyou, both of them also immediately accompanied Jade Maiden to her room.</p><br/>\n</div>"}