{"title": "Chapter 259: Scheme", "id": 259, "volume": 3, "url": "http://boxnovel.org/in-different-world-with-naruto-system-chapter-259-scheme", "volume_title": "Volume 3", "body": "<h1>Chapter 259: Scheme</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 259: Scheme</p><br/><p>What Ren Tianyou didn’t know was, after he had left for Dragon Island from continent, one might well say storm had swept across the continent, giving rise to a terrifying storm.</p><br/><p>Within five great empire, all the property of Ximen clan, such as auction house, pub, shop…………and so on, all met disaster. Mysterious force smashed all of them into ruins, but there was no casualties among the workers inside them. They just saw a human figure flashing before they lost their consciousness, and after waking up, they found themselves lying inside the ruins.</p><br/><p>This naturally was the work of White Tiger and others. And causing no casualties was because Ren Tianyou had ordered them to do so, after all the workers in these properties were not people of Ximen clan. They were merely some ordinary people who were working there in order to earn their livelihood. Although he himself was not a good person, but he felt handling matters however definitely requires principle.</p><br/><p>Neither he was someone addicted to killing nor it was necessary to willfully slaughter the innocents. His true enemies were Dragon clan and Ximen clan’s people.</p><br/><p>As for Ximen clan, after undergoing his purge once, one might well say they had suffered heavy loss. Now it could be estimated that, only few experts of God’s domain remain in Ximen clan, as a result in these external properties, they basically didn’t have leisure to dispatch even more experts to oversee. Then again, how could these normal experts be capable of stopping as ferocious as wolves and tigers people of Akatsuki organization?</p><br/><p>And in the outside world, all power also received the information of Ximen clan’s property meeting disaster. Then they immediately thought of Akatsuki organization, because only Akatsuki organization had big enough hatred against Ximen clan, and also only they had enough reason to raise such heavy hand against Ximen clan.</p><br/><p>But knowing was one matter, and helping Ximen clan or not was yet another matter. In the eyes of these top forces, they only see benefits. And helping Ximen clan didn’t have any benefit, but would also offend this Akatsuki organization with unknown strength. As a result helping Ximen clan was purely arduous and thankless task.</p><br/><p>And now after Ximen clan had already suffered heavy losses, only by the virtue of their relation with Dragon clan, Ximen clan was continuously standing tall. But if they knew that, now the Dragon clan was already exterminated thoroughly and extinct from Divine Wind continent, then what would be their reaction?</p><br/><p>…………….</p><br/><p>Within Ximen clan, this moment the original brilliantly shining Ximen clan however seemed overshadowed by a depressing dark clouds. Vexed aura was spread all over the place.</p><br/><p>Within the hall, the current clan head Ximen Batian however was sitting below, and currently Ximen Wuwang and Ximen Kuang were sitting above with anxious expression. They had already received the information of raid on their properties in other empires, and at this moment, they were in the process of making final decision.</p><br/><p>“Father, don’t tell me that you really want to do this?” Right now Ximen Batian didn’t have previous high-spirited and vigorous appearance. And now with a worried expression, he asked towards Ximen Kuang.</p><br/><p>“Then do you have any better measure?” Ximen Kuang angrily glared at Ximen Batian and said, “Since we are already powerless to escape, we can only choose to perish together with Akatsuki organization. Now that they do not give us a way to survive, then this time when they come, they will also not be able to go out. I want them and everyone within entire Tianlong city get buried with us Ximen clan.”</p><br/><p>“Yes!” Ximen Wuwang with insane appearance added, “Usually those villainous forces would ask our help when they had a matter, but now when we are suffering, all of them close the door to visitors, no longer wanting to have any relation with us Ximen clan. Since it is like that, we will make them disappear together with us Ximen clan from this world.”</p><br/><p>“I have already arranged death soldiers of our clan to start making arrangement on city wall, and the key point of this big formation is already finished setting up in backyard.” Ximen Kuang said with a vicious face. Thinking of how Akatsuki organization would arrive soon, his eyes flashed with ominous glint as if wanting to tear open the space before his eyes. “We have already finished purchasing 3000 slaves, all sealed within the clan. Now we only need to wait for the people of Akatsuki organization to come, and we will immediately use their (slaves) blood to start this final plan.”</p><br/><p>“Haha, Akatsuki organization, Zero, all of you feel free to come, since you want to kill to the last one, then prepare to accept my this big gift.”</p><br/><p>As the proverb says, once a person is forced to a desperate situation, many will choose insane path. Even if they die, they will also drag others to be buried with them. But Ximen clan was even more frantic, they wanted to take the people of entire Tianlong city buried with them. Moreover Ren Tianyou and others didn’t know about this plan, and those bustling with activities people of Tianlong city even more didn’t know about the impending devastating disaster.</p><br/><p>………………</p><br/><p>After two days, the weather was sunny, the sun in the sky was shining with dazzling sunrays illuminating the entire earth. And on the road to Ailer Empire’s Tianlong city, frequently many pedestrians were either walking on foot or riding a horse or sitting on the carriage to go in and out of Tianlong city.</p><br/><p>And at this moment, suddenly travelling group of six people appeared on this road. These six people were dressed in black robe with red clouds imprinted on it as well as wear wearing bamboo-hat with wind bell on their head, covering their face. And with their every action, the wind bell would give out ‘linglingling’ crisp wind bell sound.</p><br/><p>And among these six people, one person was clearly taking a lead. This person was walking in the front, and there was a huge round fan on his back, furthermore his body emitted indifferent aura, which caused people to unable to see his depth. And behind him, five people carrying their respective weapon were firmly following his back, walking towards Tianlong city in not fast not slow speed.</p><br/><p>And other people walking on this road, each and every one of them strangely looked at these six people without realizing who they were. But after seeing the clothing of these people, few people instantly recalled something, followed by huge change in their expression, then as if escaping from plague, hurriedly fled.</p><br/><p>And those spies located on the roads to Tianlong city quickly transmitted this information back to their respective power after seeing these six people.</p><br/><p>“Finally came.” And each of the powers located in Tianlong city sighed and lamented after getting this news.</p><br/><p>And only after half an hour, this travelling party finally arrived in front of the city gate of Tianlong city. After that they suddenly stopped their movement, the person in the lead raised his head, revealing a young handsome face under the bamboo hat. With his two blood red eyes with mysterious pattern on them looked at the words ‘Tianlong city’ carved on city wall, then slowly said, “Three years, I finally came back, Ximen clan, are you ready? I, Ren Tianyou came back once again.”</p><br/>\n</div>"}