{"title": "Chapter 267: Go and return", "id": 267, "volume": 3, "url": "http://boxnovel.org/in-different-world-with-naruto-system-chapter-267-go-and-return", "volume_title": "Volume 3", "body": "<h1>Chapter 267: Go and return</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 267: Go and return</p><br/><p>When Bu Feng opened activated his Stars blood lineage, his true speed would unfold before one’s eyes. With regarding to Bu Feng’s that extreme speed, Ren Tianyou already had a deep understanding after the chase of last time. As a result Ren Tianyou wanted to look at how this person who was already the member of Akatsuki organization in his mind deal with this brilliant situation of confronting one of the peak force of mankind Light Temple.</p><br/><p>Seeing Bu Feng had already flown out by breaking the window, as well as this whole building was already surrounded from outside thoroughly by magic formation, he disappeared from that place along with spiral shaped space ripple from his right eye.</p><br/><p>Right now outside the building, countless guards had already surrounded this building thoroughly. One might well say not even one drop of water could tickle pass them. And in the sky above, three white bearded old men wearing red priest clothing were floating in midair. And in front of these three old men, there was one middle-aged man wearing magnificent clothing.</p><br/><p>Those three old men were Red clothed Bishop of Light Temple, and the strength of all of them had already reached Peak-High God realm in light magic. And the middle-aged man in front of them was Holy Emperor of Light Temple—-Qian Longguang, and he was Peak-True God realm expert who had already touched the realm of God King. And this was merely the surface strength of Light Temple. No one knows how many times more powerful Light Temple was inwardly.</p><br/><p>At that time, a figure broke out from the window, and landed on the top of a building. Carefully looking, who could this figure be if not Bu Feng?</p><br/><p>“I had already estimated it was your doing when Holy Hall Pavilion met with a mishap. In this world, even those ordinary God King realm experts are unable enter Holy Hall Pavilion noiselessly by crossing Great Holy Light Stars Formation. So other than you Bu Feng, I truly never expected other people.” Seeing Bu Feng on the building in front of him, Qian Longguang indifferently said. “If it was other place, then even I am not sure whether I can stop you or not, but now you are in Light city, moreover you are already surrounded thoroughly, you cannot escape now. If you handover Heavenly Holy Law Pearl, I might consider to show mercy and spare your life.”</p><br/><p>“Do you think you can stop me, Bu Feng relying on only these?” Standing on the top of Holy Hall Pavilion, Bu Feng garbed in pure white clothing coldly said while looking at those underneath countless guards holding various weapons all around as well as those four experts in the sky. After that Bu Feng said with a smile, “Although in a direct fight, I am not able to match any one of you, but you all however can never catch even my shadow.”</p><br/><p>The words of Bu Feng were full of haughtiness. He took great pride on his unrivalled under the heaven speed. Even while being surrounded by these four experts of peak force Light Temple, he however regarded it as beneath his notice. He was this proud with his speed.</p><br/><p>And what everyone failed to notice was, on a distant hidden roof, Ren Tianyou suddenly appeared with a spiral shaped space ripple.</p><br/><p>And Ren Tianyou quietly sat there looking at the drama unfolding. He wanted to see what means Bu Feng possess, and naturally if he encounter danger, then he would step in at a critical time to rescue him.</p><br/><p>“Is that so? Now I want to see how fast your speed is, and whether you can run away from my grasp or not?” After hearing Bu Feng, the complexion of Qian Longguang sunk, then waved his right hand, causing countless light elements to condense rapidly in the sky, which changed into sharp-pointed light energy arrows, and shot towards Bu Feng in high speed.</p><br/><p>As for Bu Feng, he indifferently looked at those incoming energy arrows, and just when those arrows were near his body, almost hitting his body, he slightly tilted his right leg, then along with a large amount of dim starlight surrounding his body, his body flashed and disappeared from that place.</p><br/><p>“Humph, want to escape, then first you should ask me whether I agree to it or not.” Seeing Bu Feng had disappeared, suddenly a magic staff which was emitting pure clear light appeared on the right hand of Qian Longguang. And a large amount of light energy surrounded his body, then leaving behind an afterimage, he chased after Bu Feng. After that those three Red clothed bishop also followed closely behind him.</p><br/><p>Originally the speed of light was already super-fast, and these four experts controlled light magic, so their speed was also very fast, and they were actually able to keep up the pace with Bu Feng.</p><br/><p>And as for Ren Tianyou who was at a distant roof, seeing everything before his eyes, he frowned, and a disbelief expression flashed in his eyes, “What’s going on? Bu Feng this brat’s speed should not be slow like this, what on earth is he doing?”</p><br/><p>Yes, Ren Tianyou found the current speed of Bu Feng was slow. Although the current speed of Bu Feng, Qian Longguang and other three had already surpassed the speed of ordinary people by a great deal, but Ren Tianyou however found this fishy.</p><br/><p>Because the current speed of Bu Feng was actually not any faster instead slower than three years ago when he had chased after him. Moreover three years ago, he was merely Mid-God ranked expert. And saying his speed didn’t rise but fell was definitely a big joke.</p><br/><p>Furthermore Ren Tianyou noticed, this Bu Feng was keeping a constant distance between himself and Quan Longguang and others, making sure that they would neither overtake him nor get left behind, exactly as if……….as if Bu Feng was deliberately doing this.</p><br/><p>“If this is not deliberate, then what on earth is he playing? Furthermore he had come to the stronghold of his enemy to steal that something called Heavenly Holy Law Pearl, so this is definitely not for a simple matter like to attack Light Temple.” Looking at Bu Feng, Ren Tianyou pounder for a while, then he suddenly he had an unusual thought.</p><br/><p>“Forget it, if what I guessed is not wrong, then this fellow is intentionally leading these four fellows outside the city, and he definitely knew about that mechanism inside the groove where that wooden box of Heavenly Holy Law Pearl was kept in advance. But he intentionally let the mechanism activate to draw out the experts of Light Temple.” Seeing Bu Feng and others had already disappeared without a trace, Ren Tianyou inwardly speculated.</p><br/><p>“Then this fellow will definitely come back. This means I can just go to the town and wait from him to appear in the street.” Thinking this, Ren Tianyou used kamui and left imperial palace.</p><br/><p>In the second floor of Sky Fragrant Restaurant, Ren Tianyou was sitting on the seat by the window while indifferently looking down the streets, then frowning he thought, “It has been almost an hour, how come I still didn’t see him, don’t tell me my guess was wrong?”</p><br/><p>After that just when Ren Tianyou was intending to use Hiraishin’s mark on the body of Bu Feng to launch Hiraishin no Jutsu, he suddenly saw a familiar figure walking down the streets, making him excited, “My guess was not wrong, you rally came back Bu Feng, now I want to see what will you do.”</p><br/><p>Thinking this, Ren Tianyou tossed a gold coin on the table, then directly went downstairs and left this restaurant. After that began to follow Bu Feng from far away.</p><br/>\n</div>"}