{"title": "Chapter 274: Three Great Demon God", "id": 274, "volume": 3, "url": "http://boxnovel.org/in-different-world-with-naruto-system-chapter-274-three-great-demon-god", "volume_title": "Volume 3", "body": "<h1>Chapter 274: Three Great Demon God</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 274: Three Great Demon God</p><br/><p>Ren Tianyou had never thought that the strength of that mysterious Demon clan was actually so powerful. From the confrontation of just a moment ago, it seemed both sides didn’t gain any advantage, but in fact Ren Tianyou however had eaten a loss.</p><br/><p>The strength of that finger was so powerful that even with his current strength, he had to spend a lot of his eye power. No wonder last time he didn’t possess any resisting power against that finger of Demon clan, and almost got the defense of his Susanoo broken through with a single poke and almost deplete all of the blindness value.</p><br/><p>“It seems the status of this Demon clan is not low. Furthermore he is definitely the strongest opponent I have ever encountered.” Ren Tianyou slowly thought inwardly while lifting the rapidly spinning Rasenshuriken with his right hand, but thinking about the mark of Hiraishin which his shadow clone had left behind in that finger, he complacently thought, “Even though your strength is exceedingly high, it is hard to avoid me. Here this is the big gift I have prepared for you.”</p><br/><p>Finished thinking, Ren Tianyou instantly disappeared from that location.</p><br/><p>And in the ninth floor of Tower of Babel, in the middle of that mysterious pitch-black black hole, suddenly a loud roar resounded, and powerful sound waves shook the cave entrance, causing the rocks to unceasingly fall down.</p><br/><p>“Damned Tower of Babel, just you wait, wait until the arrival of my Demon clan’s Demon Emperor, at that time I will definitely use my Demon clan’s Universe Boundary Divine Artifact to smash you into pieces.”</p><br/><p>“Unfortunately you will not have that opportunity.” Just at that time, a cold voice suddenly resounded in that cave, immediately making this mysterious demon clan to raise his guard.</p><br/><p>“Who?”</p><br/><p>Unfortunately, what answered his question was the voice without a trace of emotion as well as a sharp ear-piercing sound, “Go to hell, Wind Style—-Rasenshuriken!”</p><br/><p>Immediately after the voice of Ren Tianyou, a loud sound of explosion rang out from inside the cave, and a huge storm rapidly swept across all direction. And this huge cave was instantly destroyed by this storm.</p><br/><p>Looking from the outside, at that mountain where this cave was located, suddenly beams of light burst out from inside the mountain, and this terrifying storm directly cut off this mountain into two half from the middle.</p><br/><p>After the mountain was cut open, terrifying storm swept across the surrounding within the range of few li together with terrifying energy breaking loose in all direction.</p><br/><p>At this time, in the sky above this mountain, along with the spiral shaped space ripple, Ren Tianyou appeared.</p><br/><p>Looking at the storm breaking loose in all direction, Ren Tianyou didn’t have any expression on his face. He was only staring underneath with his Sharingan.</p><br/><p>Nearly after five minutes, the storm gradually stopped. The original mountain peak had already disappeared, instead there was a huge crater. And Ren Tianyou was able to clearly see a figure lying in the middle of the crater.</p><br/><p>Without thinking anymore, Ren Tianyou directly descended from the sky, and walked over to that figure. After Ren Tianyou drew near to this figure, he saw this figure was Demon clan lying motionlessly on the ground.</p><br/><p>The skin of this Demon clan was dark purple in color, and had a pair of long curved horn on its forehead. It seems the height of this demon clan was slightly higher than that of human. He was about 2.1 meters in height, and Ren Tianyou himself was 1.8 meters tall which was not much of a difference.</p><br/><p>This moment, he was lying on the ground motionlessly with dark red colored blood was flowing out from its mouth. His body was full of wounds, and his body didn’t have any aura, seemingly dead.</p><br/><p>“After attacking me twice with the intention to kill, did you ever think that the person who will be lying on the ground in the end would be you?” Looking at this Demon clan lying on the ground who didn’t have any trace of life, Ren Tianyou a little bit mockingly said.</p><br/><p>Shortly afterwards he walked over to the body, and bend down to collect the corpse. But just at this moment, unusual change unexpectedly occurred, the Demon clan who was originally lying motionlessly suddenly opened his eyes, and revealed a smile of having his scheme succeed. Immediately afterwards his right hand covered with black colored mist directly penetrated through the heart of Ren Tianyou who had surprised and disbelief expression.</p><br/><p>“He he, you puny human, did you think you can kill me with that move? Too naïve, now you’re dead.” This Demon clan stood up, then looking at Ren Tianyou whose heart was penetrated with his right hand, he laughed in disdain.</p><br/><p>But at that time, this Demon clan suddenly sensed something was wrong, because he didn’t smell the scent of blood. And Ren Tianyou whose heart was penetrated suddenly deformed slowly changing into a piece of huge wood. Furthermore there was a talisman stuck on this wood.</p><br/><p>“This is………?” Seeing Ren Tianyou had suddenly change into wood, this Demon clan was confused. But just at that moment, that talisman stuck on the wood suddenly burned, and released a huge energy fluctuation.</p><br/><p>“Not good…….!” The pupil of this Demon clan firmly shrunk, and had an ominous foreboding in his heart. Shortly afterwards, along with a loud explosion sound, explosion occurred which engulfed him, and also caused a cloud of dusts to rise.</p><br/><p>And at the same time, no far away on the ground, Ren Tianyou slowly rose from inside the ground with his eyes firmly staring at the explosion in front of him.</p><br/><p>As a matter of fact, Ren Tianyou had never approached that Demon God with his real body, rather had sent wood clone. Although the might of his Rasenshuriken was extremely strong, but was not invincible. In Naruto world, Third Raikage had once resisted this Rasenshuriken of Naruto.</p><br/><p>Furthermore Ren Tianyou recalled that monstrous power of that Demon clan at the beginning, so for insurance, he sent wood clone first.</p><br/><p>“Sure enough I was right, this fellow is really hard to deal with. My Rasenshuriken was actually unable to finish him off.” Ren Tianyou thought inside his heart.</p><br/><p>At this time, that Demon clan jumped out from the cloud of dusts created by the explosion, and landed on the ground not far away from Ren Tianyou.</p><br/><p>Although this Demon clan was in sorry plight with cuts all over his body, but all were minor wounds. They basically didn’t affect things as a whole.</p><br/><p>And now Ren Tianyou was able to clearly see the strength of this Demon clan, which was actually Primary-God Lord realm. One might well say Ren Tianyou had encountered one of the strongest opponent.</p><br/><p>“Didn’t expect you puny human possess so many tricks contrary to my expectation, but it is more interesting like this. I was sealed here for 30,000 years, and I never crossed path with another individual, so I hope today you can make me take this seriously.” Looking at Ren Tianyou in front of him, this Demon clan coldly said. “Human, tell your name, you are my first opponent in these past 30,000 years, and you are also qualified for me to know your name.”</p><br/><p>“I am Zero of Akatsuki, who are you?” Ren Tianyou also firmly stared at this Demon clan in front of him with his Sharingan. Currently Ren Tianyou was feeling pressure which he had never felt before, so he was being very careful while answering.</p><br/><p>“Remember my name, I am one of the three Great Demon God under His Highness Demon Emperor, Heaven Sealing Demon God—-Amike!” This Demon Clan i.e. Heaven Sealing Demon God—-Amike coldly said.</p><br/><p>“This guy is actually one of the three Great Demon God of the legend? And he is already God Lord realm expert, then what about Demon Emperor? Don’t tell me he is God Emperor realm expert?” Hearing the introduction of this Demon clan, Ren Tianyou was inwardly surprised as he thought. And he had also never thought that such big BOSS was sealed here.</p><br/><p>“Take this, Dark Light Dragon Roar!” Large amount of black colored magic mist gathered around the body of Amike, then along with the sound of dragon roar, those dark magic mist rapidly changed into five six-headed huge black dragon that rushed towards Ren Tianyou.</p><br/><p>A life and death battle was about to erupt…………</p><br/>\n</div>"}