{"title": "Chapter 276: Amike after lifting the seal", "id": 276, "volume": 3, "url": "http://boxnovel.org/in-different-world-with-naruto-system-chapter-276-amike-after-lifting-the-seal", "volume_title": "Volume 3", "body": "<h1>Chapter 276: Amike after lifting the seal</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 276: Amike after lifting the seal</p><br/><p>“The strength of this fellow is actually so strong that a single punch can scattered the space itself. I absolutely cannot be struck by him, otherwise my body wouldn’t be able to endure it.” Seeing the situation of his Amaterasu’s flame being swallowed by shattered space, Ren Tianyou inwardly thought to himself, simultaneously also raising his guard.</p><br/><p>“Fu!” Amike inwardly breathe heavily. He sensed deadly threat from that black flame. The unreasonable and hard to deal with level of this flame was extreme to the extent that even he who had lived for several tens of ten thousand years found it troublesome. Even his Demon clan’s supreme flame ‘Heavenly Domain Disaster Fire’ was not this unreasonable and hard to deal with, because this black flame actually used energy as a fuel to burn.</p><br/><p>At that time, Ren Tianyou again made a hand seal. As the proverb says, take advantage of his illness if you want his life, just now he was burned with Amaterasu, so now was an excellent chance. As a result how could Ren Tianyou let this rare excellent chance slip by?</p><br/><p>“Mokuton—-Mokuryu no Jutsu! (Wood Style—-Wood Dragon Jutsu!)” Ren Tianyou quickly made hand seals, and when he finished making hand seals, he yelled loudly. After that along with the rapid consumption of chakra within his body, the ground around suddenly shattered, then along with loud dragon roar, a giant wooden dragon break out from the ground and flew towards Amike.</p><br/><p>“Do you think you can defeat me relying on this broken thing, too naïve.” Seeing the wooden dragon quickly flying towards him, Amike sneered, then raised his hands while quickly gathering the energy in his hands.</p><br/><p>Along with the quick gathering of energy as well as compression, it condensed into huge black colored energy ball in his hands. This condensed energy ball contained so powerful strength that even the space around seemed to be unable to bear it and was continuously cracking under the pressure of this energy.</p><br/><p>“Go to hell, Magic Yuan Cannon!” Looking at the wooden dragon which was about to arrive, Amike sneered, then waved his right hand, causing this huge energy ball to rapidly fly towards the head of this wooden dragon.</p><br/><p>“Don’t think that it’s possible to have your way.” Seeing the move of Amike, Ren Tianyou coldly shouted. He clearly understood that if this highly concentrated energy cannon hit his wooden dragon, then his wooden dragon would be disintegrated. But how could Ren Tianyou let him succeed so easily?</p><br/><p>The decorative pattern of Ren Tianyou’s left eye rapidly spun, and a large amount of eye power gushed out from his left eye, while his vision firmly staring at the route of Amike’s that Magic Yuan Cannon, “Kamui!”</p><br/><p>Along with the voice of Ren Tianyou, suddenly a black speck appeared in the space in front of the Magic Yuan Cannon. Shortly afterwards this black speck rapidly expanded, creating a huge space black hole in that place. And a powerful suction force appeared from inside this black hole, directly sucking in the Magic Yuan Cannon of Amike.</p><br/><p>After the Magic Yuan Cannon was swallowed by his kamui, without any hesitation, Ren Tianyou directly controlled wooden dragon, quickly binding Amike who was caught off guard.</p><br/><p>“Roar! Damn it!” After the wooden dragon bound him, Amike roared while releasing his powerful strength, wanting to struggle free from the binding of this wooden dragon. But this wooden dragon in itself had an ability to absorb the energy of the enemy, furthermore the wooden dragon created with the current strength of Ren Tianyou was a lot more powerful compared to before. As a result although Amike was Elementary God Lord realm expert, but it was still not that easy to struggle free from the binding of this wooden dragon.</p><br/><p>After this wooden dragon absorbed the energy within the body of Amike, its body slowly become sturdy, and its body rapidly sprout extremely big trees, moreover its binding also got stronger and stronger.</p><br/><p>“Not good, this thing is gradually absorbing the energies within my body. And after absorbing my energy, the binding of this thing is getting stronger and stronger. If this goes on like this, I might be stuck here.” Feeling the rapid drainage of the energy within his body, as well as after absorbing his energy, the binding of wooden dragon becoming stronger, Amike immediately thought this.</p><br/><p>“Now I can only lift the seal within my body. I had never expected this fellow before my eyes can actually force me to this degree. This is so hard to come by. Other than those Seven Great Saints whom I had met after we Demon clan attacked Divine Wind Continent, he is the first human to make me feel this delightful.” Looking at Ren Tianyou standing on that wooden shield, Amike thought inwardly.</p><br/><p>Finished thinking, he didn’t hesitated. He extend his right hand at the wound on his left shoulder, and touch his blood. After that he put his palms together, and slowly closed his eyes.</p><br/><p>“What does this guy want to do?” Looking at motionless Amike who had closed his eyes, Ren Tianyou thought, simultaneously he suddenly had an ominous foreboding.</p><br/><p>Shaking his head, Ren Tianyou thought, “No matter what, counter soldier with arms, water with an earth weir, I want to take a look at his trick.”</p><br/><p>At this moment, on the surface of Amike’s body, suddenly pitch-black colored magic mist appeared. This magic mist became increasingly denser, moreover this magic mist emitted a chilling energy fluctuation.</p><br/><p>After this magic mist thoroughly surrounded the body of Amike, suddenly a loud roaring sound came from inside it. And suddenly a pitch-black colored light beam descended from the sky on the body of Amike. And when this pitch-black colored light beam engulfed the wooden dragon around his body, it was instantly torn into pieces.</p><br/><p>“This is…….?” Seeing this light beam whose energy fluctuation made him feel stifling, Ren Tianyou frowned, then he inwardly raise his guard.</p><br/><p>“Seal of Demon God, Open!” Just then, suddenly a roar of Amike came from inside this light beam. Along with his voice, a terrifying energy storm rapidly spread in all direction, and the rocks on the ground were instantly swept away. As for Ren Tianyou, he used his right hand to block the attack of this hurricane.</p><br/><p>The energy of light beam slowly seeped inward, and along with the disappearance of this light beam, the figure of Amike became visible again.</p><br/><p>Ren Tianyou was quite surprised to see the current appearance of Amike. Right now the height of Amike had already increased to 3 meters from previous 2 meters. The curved horn on his head had already disappeared. And as for his skin, a purple colored magic lines had appeared all over. Furthermore now his pupils were also purple in color.</p><br/><p>Looking at far away Ren Tianyou with a slight evil smile on his face, Amike who was floating in midair said, “Didn’t expect you, a human was actually able to force me to lift the seal within my body, very good, now I will let you see my, Heaven Sealing Demon God—Amike’s true strength.”</p><br/><p>Finished speaking, a huge magic blade slowly appeared in his right hand, then pointed towards faraway Ren Tianyou.</p><br/><p>True battle was about to begin now……………..</p><br/>\n</div>"}