{"title": "Chapter 288: Trace Discovered", "id": 288, "volume": 3, "url": "http://boxnovel.org/in-different-world-with-naruto-system-chapter-288-trace-discovered", "volume_title": "Volume 3", "body": "<h1>Chapter 288: Trace Discovered</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 288: Trace Discovered</p><br/><p>Right now there was not a soul in sight inside the dean office of Supreme Light Academy. It seems Long Feilu was out to handle some matters.</p><br/><p>And at this moment, suddenly huge earth yellow light appeared inside this room. After this light dissipated, figures wearing black robe with red clouds imprinted in it suddenly appeared in the room. These figures were precisely White Tiger and others.</p><br/><p>“White Tiger, you go and open the door of secret chamber.” Vermilion Bird said to White Tiger.</p><br/><p>White Tiger nodded his head and walked towards the door of that secret chamber. After that he opened the door of secret chamber according to his memory. When the wall before their eyes rose, a long dimly lit small path appeared in front of everyone.</p><br/><p>“Let’s go!” Seeing the door had already opened, White Tiger called everyone to immediately enter the passage of secret camber. After that everybody walked towards the secret chamber.</p><br/><p>After everyone had walked inside the door of secret room, the wall behind them slowly fell and revert back to normal.</p><br/><p>“In here!” Walking to the end of passage, and seeing that transmission magic formation in front of him, Void said.</p><br/><p>Jade Maiden walked over, then released a white colored radiance from her body. “Illusory World Flowing Void blood lineage, Open!”</p><br/><p>Then Jade Maiden stretched her right hand’s index finger and pointed at the empty void in front of her. Suddenly the white colored energy changed into a mysterious light screen, and an illusionary mirror appeared in the midair. And the images on this mirror was unceasingly moving, and one image after another were flashing rapidly.</p><br/><p>“Found it.” At that time, Jade maiden suddenly called out in pleasant surprise, and the images on the mirror suddenly stopped moving.</p><br/><p>After this image reflected on the mirror became clear, and everyone were able to see it clearly. This moment the image of the original secret room with no soul in sight reflected on the mirror. Suddenly in that room, a spiral shaped space ripple appeared, and Ren Tianyou walked out from inside that space ripple into that secret chamber. After that Ren Tianyou tossed out magic cores and initiate the magic formation to enter into Tower of Babel, and disappeared from the image of secret chamber reflected on the mirror.</p><br/><p>“Sure enough, Zero really went to Tower of Babel, our guess was not wrong.” Seeing Ren Tianyou had disappeared in the Transfer Magic Formation, Southern Dipper said.</p><br/><p>“Now that we have found the trace of Ren Tianyou, let’s go to Tower of Babel immediately.” Then looking at that Transfer Magic Formation, White Tiger said to Jade Maiden.</p><br/><p>Jade Maiden walked forward, tossed out several magic cores into the grooves at the edge of this magic formation, then she quickly initiated this magic formation and said, “Okay, this magic formation is activated. Get in, everyone. Remember we will be transported to different location of the first floor of Tower of Babel, so after we reach there, immediately head to the entrance of the second floor, and wait for everyone else. The level of difficulty of the first floor is merely a joke even for us, no need to mention about Zero. So I guess Zero should be in second floor or above.”</p><br/><p>Everyone got into the magic formation one after another, and finally Jade Maiden launched the magic formation. After that along with a silver colored radiance surrounding all of them, everyone disappeared from that secret chamber.</p><br/><p>………………</p><br/><p>And under the cliff beside that blood colored brook, Ren Tinayou was sitting cross-legged while healing his injury. With the support of Sage chakra within his body, those external injuries on his body rapidly take a turn for the better, and eschars rapidly congealed on the wounds, and finally fell off.</p><br/><p>But although the external injuries were nearly healed, but his internal injuries were not something he could heal in one or two days. Because the explosion shock wave was truly too big, it nearly scattered all the internal organs of Ren Tianyou. And these internal injuries were not something his half-baked sage chakra could heal instantly.</p><br/><p>Slowly opening his eyes, and feeling weak, Ren Tianyou made a wry smile, “Didn’t expect he was actually so ruthless, he nearly finish me off, but fortunately I was able to survive that.”</p><br/><p>“But……” Thinking this, Ren Tianyou again looked at the surrounding environment, then looked at that blood colored brook as well as that overcast sky which gave people a kind of stifling feeling, “Where am I? The environment of this place give me a kind of very oppressive feeling ah.”</p><br/><p>“It’s not going to explode once again right.” Recalling the situation of passing through that explosion, Ren Tianyou again looked at that unfamiliar surrounding environment, with cold sweat flowing out from his forehead.</p><br/><p>“Oh, that’s right, Hiraishin’s mark!” At this time, Ren Tianyou suddenly thought of a kunai marked with Hiraishin which he had left behind before in a secret place of Divine Wind Continent in case he was trapped or encountered other unexpected circumstance, and also his kunai marked with Hiraishin with White Tiger and others which he had given them so that he could instantly go over to help them in emergency situation.</p><br/><p>Thinking this, Ren Tianyou immediately closed his eyes, and carefully tried to sense the mark of Hiraishin. Roughly after 30 seconds, he opened his eyes, and muttered, “What’s going on here? Although I can sense the coordinates of Hiraishin marks, but the coordinates however are very vague as if a powerful energy is covering them.”</p><br/><p>As a matter of fact just now, although he could sense Hiraishin marks’ coordinates, but they were very vague, and unstable, as if an enormous power was blocking it.</p><br/><p>Because these coordinates of Hiraishin marks were too vague, although he could still use Hiraishin no Jutsu, but the accuracy would be greatly reduced, so perhaps he might deviate from his target.</p><br/><p>“Forget it, this place is too weird. After I am completely healed, I will come back here to take a good look again. Now I should immediately leave this place, even if Hiraishin would deviate a little, but the place where I left the kunai in advance is very safe, so there should not be any problem.” Feeling the oppressing feeling from the surrounding environment, Ren Tianyou had a kind of very bad feeling. Now he was in seriously injured condition, so if he encounter any sudden situation, then he didn’t have any strength to cope with it.</p><br/><p>Thinking this, Ren Tianyou no longer hesitate. He immediately stood up, took out few kunai marked with Hiraishin mark, and stuck them in the cliff. After doing this, he decided on the coordinate of Hiraishin mark, and circulate a little bit of recovered chakra. “Hiraishin no Jutsu!”</p><br/><p>Along with the low voice of Ren Tianyou, he immediately disappeared from that place.</p><br/><p>…………..</p><br/><p>And on other side, White Tiger and others rushed rapidly through the floors of Tower of Babel, and very quickly arrived at ninth floor.</p><br/>\n</div>"}