{"title": "Chapter 302: Dance together with me", "id": 302, "volume": 4, "url": "http://boxnovel.org/in-different-world-with-naruto-system-chapter-302-dance-together-with-me", "volume_title": "Volume 4", "body": "<h1>Chapter 302: Dance together with me</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Dance together with me</p><br/><p>“Even if you all come together, why would I, Uchiha Tianyou have any fear?” Standing in front of them and looking at those 200 or so elite soldiers of Demon clan in front of him, Ren Tianyou indifferently said.</p><br/><p>“Ha ha, good, you have guts. Today I, Baluoda will take a look at how powerful your means are.” Hearing those heroic words of Ren Tianyou, Baluoda couldn’t help but laugh in anger. And his laugh was filled with dense killing intent.</p><br/><p>Baluoda had thought inwardly, “I saw you were a brave man, and I admire you for that, so I gave you a fair duel, but I had never thought that you would not appreciate my kindness making it seem like I myself was taking the initiative to stick onto your buttocks.” With this how could Baluoda who was always sitting on a high position for a long time not get angry?</p><br/><p>“All of you kill him for me!” Baluoda waved his hand, while giving orders to all the guards.</p><br/><p>“Yes, Your Excellency the City Lord.” All the soldiers answered in unison. After that other than Baluoda and those five High God realm Protection Squadron of Baluoda behind him, those 200 or so who were at least Saint ranked soldiers charged towards Ren Tianyou.</p><br/><p>“Have courage and insights, it seems thinking so highly of you was not in vain, this drama ought to be interesting.” At the far-off roof, hearing those words filled with heroism, the beautiful eyes of Yaorao flashed with unusual hue. Then looked at underneath Ren Tianyou with admiration.</p><br/><p>…………………</p><br/><p>Looking at those experts of Demon clan charging towards him, Ren Tianyou pulled off his right hand, and took off the clothing from the upper part of his body which now hung on his waist, bearing the upper part of his body.</p><br/><p>And after that along with the rapid circulation of chakra within his body, the muscles above his left arm’s shoulder wriggled, then thick white bone broke out from the muscles of his shoulder and slowly rise up. After that under the terrified gaze of everyone, his right hand reached out to this white bone and directly pulled it out.</p><br/><p>“This……this……!!!” Seeing the action of Ren Tianyou, not only were those ordinary demon soldiers so scared that they stopped, and forget to charge, even Baluoda and those five High God realm experts were stunned seeing the action of Ren Tianyou.</p><br/><p>Seeing Ren Tianyou pulling out his own bone, even these Baluoda and others who had seen bloody struggle everyday couldn’t help but felt a little bit of their blood run cold.</p><br/><p>And in the far-off roof, seeing the action of Ren Tianyou, the corner of Yaorao’s mouth rose making a beautiful radian, “Pretty good ability, possessing the ability to control all the bones within one’s body. This Bone Demon clan contrary to expectation is very interesting.”</p><br/><p>“We Bone Demon clan have the ability to control all the bones within our body. Today I will let you see Bone Demon clan’s only remaining person I, Uchiha Tianyou’s strength.” Ren Tianyou held that bone sword with his right hand which he had pulled out from his shoulder, then looking at everyone in the front, he said, “I am skillful in 5 types of dance. And I will let you all accompany me to dance together.”</p><br/><p>After speaking, Ren Tianyou suddenly dashed towards the soldiers in front of him without any fear.</p><br/><p>“All of you kill him for me!” Seeing Ren Tianyou had actually took the initiative to initiate the attack, Baluoda immediately gave order to attack. Hearing the command of Baluoda, all the demon soldiers tried to overcome the fear in their heart, and brazenly initiated assault towards Ren Tianyou again.</p><br/><p>As the distance gradually narrowed, and when Ren Tianyou and those soldiers of Demon clan were about to make contact, Ren Tianyou heavily stepped on the ground, then soaring high up in the sky, and raising the bone sword in his hand, he rapidly rushed forward.</p><br/><p>‘Puchi’, ‘puchi’………the sounds of sword stabbing through the body resounded. The white bone sword in the hand of Ren Tianyou had stabbed through that seemingly hard armors of Demon clan, then along with dark red blood flowing out from their body, they lied on the ground motionlessly.</p><br/><p>‘Step’ sound. Ren Tianyou landed on the ground, then half-squatting above the ground, he looked at those soldiers of Demon clan all around him. At that time, the scene of those tortured and deformed humans he had seen at Soul Breaking Cliff appeared in his mind, and strong killing intent rose inside his heart, then spat out one word, “Kill!”</p><br/><p>“Tsubaki no Mai! (Camellia Dance!)”</p><br/><p>Finished speaking, his body changed into a white light and rushed forward quickly. And coordinating with Ren Tianyou’s exquisite taijutsu, the bone sword in his right hand gave rise to white light while cutting all the soldiers of Demon clan obstructing his path, including their seemingly hard armors. This bone sword of Ren Tianyou could cut through even iron and steel, let alone these armors.</p><br/><p>“Roar, Hundred li Blood Killing Formation!” Seeing the unscrupulous massacre in the middle of the crowd, the demonic intent within the body of these soldiers of Demon clan instantly set off. After that along with the roar of all the soldiers of Demon clan in unison, they raised their spear, then blood colored energy mist emitted from their body. Then horizontally holding the spear with their right hand, all of them changed into a blood colored light rushing towards Ren Tianyou.</p><br/><p>Hundred li Blood Killing Formation was one of the most frequently seen battle formation. They would combine massacre energy which they had obtained from the war of all the year around within their body, then all of them would initiate unceasing assault towards their target, so that the enemy couldn’t react.</p><br/><p>“Humph!” Seeing rapidly rushing towards him soldiers of Demon clan, Ren Tianyou just snorted coldly in disdain. After that circulating chakra within his body, the muscles of the bear stomach and back of Ren Tianyou unceasingly wriggled, then sharp bones rapidly broke out from his body. Looking at current Ren Tianyou from far away, he would resemble a hedgehog with sharp thorns all over the body.</p><br/><p>Shortly afterwards, the body of Ren Tianyou began to spin unceasingly, then advance in all direction rapidly towards those assaulting soldiers of Demon clan.</p><br/><p>“Take this, Karamatsu no Mai! (Larch Dance!)”</p><br/><p>Along with those rapidly assaulting soldiers of Demon clan, and Ren Tianyou’s that rapid spinning form sweeping away, a series of blood-curdling sound resounded. Countless bones had stabbed through the body of many soldier. Some had their thigh stabbed, some had their throat stabbed, and some even had their head stabbed. Right now the ground of this square was thoroughly dyed with dark red blood.</p><br/><p>When the blood-curdling screams stopped, Ren Tianyou also stopped spinning and stood on the ground. Now corpses of demon soldiers lied on the ground around him, and blood was still flowing out from their corpses’ cuts. Right now there was only less than 50 demon soldiers who were alive and were capable of standing up.</p><br/><p>And those terrifying looking bones on the body of Ren Tianyou slowly sank into his body, and those cut opened on his flesh also revert back to the previous state without a trace of single scar.</p><br/><p>Then looking around the disaster he had created himself, an unusually evil smile appeared on the handsome face of Ren Tianyou, then he said, “This dance is very beautiful.”</p><br/>\n</div>"}