{"title": "Chapter 314: Strange purple light", "id": 314, "volume": 4, "url": "http://boxnovel.org/in-different-world-with-naruto-system-chapter-314-strange-purple-light", "volume_title": "Volume 4", "body": "<h1>Chapter 314: Strange purple light</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Strange purple light</p><br/><p>“Damn it!” Ren Tianyou heavily punched on the ground while cursing with unsightly expression.</p><br/><p>He had never thought that because of his negligence, he would unexpectedly lose his only chance to leave this place. Now even if he wanted to leave, then that would be very difficult.</p><br/><p>“Just now that place wasn’t too suitable, so I was not able to enjoy myself to the full extent while fighting with you. But now I will let you see my true power.” Seeing the unsightly expression of Ren Tianyou, Yaorao said with a smile. Then with purple colored light appearing around her right hand, she noiselessly began to chant incantation.</p><br/><p>Along with her chanting sound, flame gradually rose in the sky, and this fiery radiances slowly formed a huge flame twister in the sky above.</p><br/><p>Shortly afterwards, countless dragon roar resounded out of thin air, as countless huge fiery dragon came out from this fire twister, and looking towards the sky, they issued a loud dragon roar. After that under the control of Yaorao, they directly rushed towards underneath Ren Tianyou and that wooden golem.</p><br/><p>“Fire Dragon’s Heavenly Dance!” Looking at those countless huge fire dragons, Yaorao slowly spat out these words. After that those thickly dotted fire dragons in the sky flew down towards Ren Tianyou.</p><br/><p>Seeing those rapidly flying downwards countless fire dragons, the complexion of Ren Tianyou changed, “With so many flames, even Kagutsuchi (Flame Control) is powerless to control all of them, so I can only block them.”</p><br/><p>The dojutsu of Ren Tianyou’s right eye—-Kagutsuchi (Flame Control) had the ability to control myriad of flames. So the attack of ordinary flame was basically powerless to injure him, instead using Kagutsuchi (Flame Control), he could reflect it back.</p><br/><p>But the range of this fire magic of Yaorao was too big, so it was basically impossible for him to completely control it using Kagutsuchi (Flame Control). As a result he opt to defend against it.</p><br/><p>“Wood style—-Thousand Domain Dragon Technique!” After making the hand seals, the ground underneath Ren Tianyou began to shake violently. After that huge crack appeared on the ground, and loud dragon roar sound came from inside that crack.</p><br/><p>Shortly afterwards four-five huge wooden dragon flew out from inside the ground, then surrounded Ren Tianyou, forming into a huge wooden dragon shield wall all around him.</p><br/><p>This move was the ninjutsu created by Ren Tianyou himself, where the strong dragon spirit of wooden dragon would form a solid shield to block any external attacks. The defensive ability of this ninjutsu was only a little bit lower than Hobi no Jutsu (Wood Expulsion Jutsu).</p><br/><p>Standing in the middle of the shield formed from wooden dragon, Ren Tianyou stretched his right hand’s middle finger and index finger side by side in front of his body, while manipulating wooden golem outside the shield to rush towards faraway Yaorao.</p><br/><p>But at that moment, countless fire dragons fell down from the sky and hit wooden golem’s body and the wooden dragon shield around Ren Tianyou. Along with continuous huge explosion sound, countless flame engulfed the surrounding, and terrifying explosion winds and waves spread all around.</p><br/><p>This continuous loud explosion lasted for nearly three minutes, then it slowly stopped. The original place had already changed into huge sea of flames, with flames all around that place.</p><br/><p>Right now Yaorao was floating in the midair with purple colored radiances around her body. And looking at that sea of flames underneath, she had indifferent expression on her face.</p><br/><p>At that time, a huge figure suddenly came out from this sea of flames. Precisely was wooden golem of Ren Tianyou.</p><br/><p>But right now the original green wooden body of this wooden golem had already become slightly burned black. And it had also lost some parts of its huge body due to this continuous extraordinarily large explosion.</p><br/><p>“Humph, your skin is truly too thick.” Seeing rapidly approaching wooden golem, the complexion of Yaorao didn’t change, she merely snorted coldly. After that she stretched out her angelic right hand, and gathered purple colored energy in her right hand’s palm which changed into a purple colored energy strip.</p><br/><p>“Go!” With the cold shout of Yaorao, she swung her right hand, then that purple colored energy instantly changed into a huge purple colored energy slash and slashed towards wooden golem.</p><br/><p>This huge energy slash directly passed through the body of that wooden golem. After that this wooden golem instantly stopped its moment, then huge crack appeared on its body. Afterwards the huge body of wooden golem split into two and fell down to the ground.</p><br/><p>Although the defensive power of the wooden golem was very powerful, but the gap between the strength of two side was too huge. Furthermore Ren Tianyou had still not completely refined the power of Forever Green within his body, so the strength of his wood style was still not at its strongest.</p><br/><p>In addition, Yaorao as the Empress of Demon clan, one might well say that her strength was exceptionally high. Right up until the present, he didn’t know whether she had use all of her strength or not, but wooden golem had already suffered Yaorao’s that large-scale fire magic’s continuous bombardment, and its body was already heavily damaged long ago. This was also the reason she was able to easily cut wooden golem into half.</p><br/><p>When the two half body of wooden golem fell on the ground, a loud dragon roars resounded from within the sea of flame. After that nine lifelike huge fire dragons came out from within the sea of flame and rushed towards Yaorao.</p><br/><p>“Fire Style—- Majestic Nine Flame Dragon Formation!”</p><br/><p>The speed of these fire dragons were very fast. In just few seconds, they already reached in front of Yaorao.</p><br/><p>Seeing nine fire dragon flying over, Yaorao immediately chanted the incantation. Along with her chanting, large amount of purple colored light rose from her body.</p><br/><p>Then this purple colored magic light changed into a huge light shield in front of her. Above this light shield, purple colored magic lights were continuously circulating which gave people a kind of unusually evil feeling.</p><br/><p>After that these nine fire dragons instantly collided against that light shield, and ‘peng’, ‘peng’……muffled sound unceasingly resounded. When those fire dragons hit that light shield, the purple colored light would instantly engulf them, then a mysterious power would continuously wither away the flame body of those fire dragon, making them increasingly smaller. And after a short while, all those fire dragons disappeared.</p><br/><p>And at that time, Ren Tianyou also slowly walked out from inside the sea of flame. Seeing his fire style ninjutsu was easily blocked by Yaorao, he wasn’t surprised, as it was already within his expectation. If this kind of simple move could injure her, then she would not have the position of Demon Empress.</p><br/><p>But what sparked the curiosity of Ren Tianyou was that corroding like ability of that purple light of Yaorao. After being swept by that purple colored magic light, his flame actually got weakened continuously, and finally disappeared, as if wiped out in the thin air.</p><br/><p>“In the end what is that ability? Actually is so powerful.” Looking at purple colored light around Yaorao, Ren Tianyou inwardly thought, but he clearly understood one thing, which was he must not let this purple colored light hit him, otherwise it would truly be dangerous.</p><br/>\n</div>"}