{"title": "Chapter 316: Sage Mode", "id": 316, "volume": 4, "url": "http://boxnovel.org/in-different-world-with-naruto-system-chapter-316-sage-mode", "volume_title": "Volume 4", "body": "<h1>Chapter 316: Sage Mode</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Sage Mode</p><br/><p>And after Ren Tianyou had just left using Hiraishin no Jutsu, what he didn’t know was, a purple colored light suddenly appeared above a tree stump not far away, then disappeared.</p><br/><p>………</p><br/><p>In an isolated island of Divine Wind Continent’s endless ocean, Ren Tianyou whose upper part of the body was bare sat crossed-legged above the rock with his eyes firmly closed.</p><br/><p>After coming back for Demon World, Ren Tianyou had tried to contact White Tiger and others, but discovered that there was no way to contact them. In the beginning, he thought that they might be in trouble, but after looking at their Fire of Life, he discovered that they were fine.</p><br/><p>Ren Tianyou speculated that they might be in the crucial moment of inheriting the legacy of Seven Great Saint, so there was no way to contact them.</p><br/><p>Since all of them were undertaking the inheritance, Ren Tianyou didn’t want to disturb them. Now there was only a year and half or so time left before the invasion of Demon clan, so although he might not be able to awaken Rinnegan before then, but there was two very important jutsu, he must master.</p><br/><p>These two jutsu were Sage Mode and Edo Tensei.</p><br/><p>Ren Tianyou was very clear about the might of Edo Tensei. So after he had made a firm resolution to learn this ninjutsu, he had taken a great risk and went to the Demon Emperor’s Capital on his own. And nearly never returned back.</p><br/><p>Now he already have some corpses of experts, although not too many, but when he encounter suitable chance, he will gather more.</p><br/><p>But learning Edo Tensei was not urgent for Ren Tianyou, and he wanted to first learn Sage mode. Although Edo Tensei was very powerful, but when all is said and done, this jutsu wouldn’t increase his own strength, and he believed that increasingly his own strength was most important before anything else.</p><br/><p>So Ren Tianyou decided to train Sage Mode in this place.</p><br/><p>Sage Mode was a special state of using senjutsu chakra. The might of this senjutsu chakra was several times or even ten times more powerful than ordinary chakra, and let user possess very strong sensing as well as danger perception ability. Furthermore the body would give rise to different kind of patterns according to the different nature of natural chakra absorbed.</p><br/><p>The ordinary chakra is produced within one’s body by the means of the perfect fusion between physical energy and spirit energy, and ninjas could use ninjutsu by spending fix amount of this chakra. But Senjutsu chakra is the chakra that is formed after blending the absorbed natural energy with their own chakra. And after absorbing the fixed quantity of natural energy within one body, one could enter Sage Mode. All the ninjutsu casted in Sage Mode were called Senjutsu.</p><br/><p>After entering into Sage Mode, the user’s power would greatly increase. No need to talk about others, merely the might of Senjutsu chakra alone was already ten times or so more powerful than ordinary chakra. This point alone was already very abnormal. The might of any ninjutsu that was used in Sage Mode would be ten times or so more powerful than using it under normal state. This kind of addition was not simple like 1+1.</p><br/><p>Furthermore under Sage Mode, user’s physical strength and speed would also increase greatly. Moreover the injuries would begin to heal automatically too, and it grants user very powerful perceptivity.</p><br/><p>And unlike ordinary chakra, the more Senjutsu chakra you use, the more spirited you become, but the more you use ordinary chakra, the more exhausted you become. Moreover when Madara became the jinchuuriki of ten tailed beast, only ordinary taijutsu and senjutsu chakra had the ability to injure him, this shows the might of Senjutsu chakra.</p><br/><p>But only people with large chakra capacity could cultivate Senjutsu chakra, because it was not easy for the people with lower chakra capacity to hold natural energy, and were very likely to get swallowed by natural energy. And even the people with very high chakra capacity had similar risk. If one was swallowed by natural energy, then they would become part of the great nature, such as those failed to cultivate in Mount Myoboku would change into stone toad.</p><br/><p>Therefore the difficulty and risk of cultivating Senjutsu was extremely huge. Moreover only few people were able to achieve perfect Sage Mode. So although Ren Tianyou was very clear about the might of Sage Mode from the beginning, he had never cultivated it, rather had earnestly embarked on the cultivation of ninjutsu.</p><br/><p>In Naruto world, Senjutsu was divided into Mount Myoboku, Ryuchido and Shikkotsurin. Human ninja could use Sage Mode of Kabuto, Naruto, Jiraiya and Senju Hasirama. Among them, the Sage Mode of Jiraiya and Naruto was based on Mount Myoboku’s Senjutsu, and Kabuto’s Sage Mode was based on Ryuchido. As for the Sage Mode of Senju Hasirama, many guessed that it was based on Shikkotsurin’s Senjutsu, but Ren Tianyou however didn’t know it for sure.</p><br/><p>And now Ren Tianyou was planning to begin training Sage Mode.</p><br/><p>For training Sage Mode, first one should absorb the natural energy of outside world, then one should be able to maintain ingenious balance between this natural energy and the physical and spirit energy within one’s body. Since the prior chakra was formed with only physical energy and spirit energy, they each occupy one half, forming a balance, so formed a chakra.</p><br/><p>And for Senjustu chakra, natural energy must be added therein. And to make a stable balance among them, the absorbed natural energy must occupy exactly one third of overall amount. If exceed one-third, then one would be consumed by natural energy, and if less than one-third, then one would not enter Sage Mode.</p><br/><p>Because Jiraiya was unable to accomplish perfect balance, every time he entered Sage Mode, he needed Fukasaku and Shima, these two toad to stand at his shoulder to maintain the balance within his body.</p><br/><p>But Ren Tianyou however didn’t have any other people to help him, and he himself also didn’t want to become just like Jiraiya in Sage Mode, because that inevitably would have a huge weakness. So just like Naruto and Senju Hasirama, he wanted a perfect Sage Mode.</p><br/><p>And now Ren Tianyou was performing the first step of the cultivation of Sage Mode, i.e. absorbing natural energy for outside world and slowly adding it to the chakra inside his body. And while doing this step, Ren Tianyou was being very meticulous, because he couldn’t afford to make any error in this step. And having any error might cause mortal danger. If he absorb too much, his body will be consumed by natural energy, and if he absorb too little, then he wouldn’t be able to initiate Sage Mode.</p><br/><p>But this step was obviously not easy. Slowly beads of sweat appeared on the forehead of Ren Tianyou, and his brows were deeply creased, as if he had encountered troublesome matter.</p><br/>\n</div>"}