{"title": "Chapter 311: Demon Empress", "id": 311, "volume": 4, "url": "http://boxnovel.org/in-different-world-with-naruto-system-chapter-311-demon-empress", "volume_title": "Volume 4", "body": "<h1>Chapter 311: Demon Empress</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>**Title is somewhat spoilerish, so it’s at the bottom</p><br/><p>“So your target was this place.” Just when Ren Tianyou was preparing to break open the tomb of Shadow Demon God, a female voice filled with charm resounded from not far away. This voice instantly caused all the fine hairs on the body of Ren Tainyou to stand erect.</p><br/><p>“Who’s there?” Hearing this voice, Ren Tianyou instantly responded. And before he had time to panic in his heart, he immediately took the battle ready posture and looked towards the source of that voice.</p><br/><p>Beside the tomb not far away, along with the gathering of purple colored mist, a beautiful girl wearing purple colored clothing with skirt suddenly appeared. Right now her body was emitting indistinct aura.</p><br/><p>“It’s you!” Seeing this woman who had suddenly appeared, the complexion of Ren Tianyou tightened, and his eyes flashed with surprise. The woman who had suddenly appeared in front of him was none other than Yaorao.</p><br/><p>With regarding to the identity of Yaorao, Ren Tianyou was very curious, and coupled with the strange matter he had suddenly encountered in Demon World, he had always approached Yaorao with vigilance within his heart. But he had never thought that she would unexpectedly appear suddenly in front of him when he was at the most crucial moment of his action.</p><br/><p>“Are you surprised, seeing my sudden appearance here?” Looking at Ren Tianyou’s alert eyes, Yaorao said with an indistinct smile on her attractive lips as before.</p><br/><p>“In the end who are you?” Looking at Yaorao, Ren Tianyou asked. Now that she had appeared here, furthermore she was able to accurately grasp the timing to suddenly appear here at the crucial moment of his action, this consequently explains that she was continuously keeping watch over his every action.</p><br/><p>If it was like this then that was too frightening. He was already under her surveillance, but he however was completely oblivious to it, then how strong was this Yaorao?</p><br/><p>“Who am I is not important, what is important is that you by yourself was able to break open the space barrier between Divine Wind Continent and Demon World, it seems your strength is not low ah.” Hearing the question of Ren Tianyou, Yaorao didn’t answer, rather slowly revealed the identity of Ren Tianyou.</p><br/><p>“It seems you already know my identity.” Hearing Yaorao, Ren Tianyou was not surprise at all. She was already keeping watch on him for a long time, furthermore able to timely appear here, that already explained that she had already seen through his identity long ago.</p><br/><p>“Yes, roughly two months ago, I discovered that the space barrier of our Demon World was broken, and outsider had entered into our Demon World. But where was that person, I however wasn’t clear, so I was forced to stay in the dark without any movement.” Looking at Ren Tianyou, the eyes of Yaorao shone and continued, “And in the entire three realms and eight domains of Demon World, all of them have my small pub. This is something I made during my bored days.”</p><br/><p>“But the unexpected thing was, at that time you actually walked before me by yourself.” Yaorao said. She was speaking about the time when Ren Tianyou had entered into the pub of Yaorao for the first time.</p><br/><p>“When I saw you for the first time, I immediately see through your identity. Although your disguise is very good, and your that ability to control all the bones in your body was even better disguise, but you forget a final point, that is ‘Qi’.”</p><br/><p>“Human have human qi, demon have demon qi, and they both have nothing in common with each other, so even if you possess even better disguise, you are fundamentally unable to change your identity.”</p><br/><p>“So you had already seen though my identity, but why didn’t you directly attack me at that time, instead secretly killed Labake and frame me, afterwards using Baluoda to deal with me?” Having heard up to here, Ren Tianyou curiously asked. And he secretly began to move his hands, as he didn’t want to give up the tomb of Shadow Demon God behind. As long as he could obtain his corpse, he would immediately use Hiraishin no Jutsu to leave this place.</p><br/><p>“That is because there is special energy within your body.” Yaorao pointed towards Ren Tianyou, “The power within your body is a kind of strange power. According to my knowledge, other than myself, only Emperor Tiancai whom I had met 30,000 years ago in Divine Wind Continent possessed this kind of power, but what a pity it is that he is already dead. Now you are the second person to possess it beside me, so I didn’t want you to die, otherwise after entering into my bar at that time, you wouldn’t have any chance to go out.”</p><br/><p>“Oh, so you want me to say thank you for showing mercy and letting me go with my life?” Hearing Yaorao, Ren Tianyou said with sarcasm.</p><br/><p>“The fact is indeed the case, although you are a person of Divine Wind Continent, but our Demon World’s invasion to Divine Wind Continent is also imperative. Your Divine Wind Continent has something I want, so Divine Wind Continent must belong to me. Seeing you are a hard to come by talented person, hand over the corpses you have taken just now, then I can spare your life.” The face of Yaorao was calm just as in the past, and said indifferently.</p><br/><p>“Haha, come Demon Empress, let me see whether you have enough skill to make me, Ren Tianyou leave behind my life?” Ren Tianyou looked up to the sky and laughed loudly, and roared in disdain. After hearing all the words of Yaorao, if he still couldn’t know that Yaorao was Demon Empress, then he would be a perfect fool.</p><br/><p>Finished speaking, he quickly make a series of hand seals and said, “Doton—-Kaido Shokutsu! (Earth Style—-Erupt!)”</p><br/><p>Along with the completion of ninjutsu, the tomb of Shadow Demon God began to violently shake. Shortly afterwards, a huge coffin broke out from the ground, falling on the ground.</p><br/><p>“Humph, do evil and you cannot live!” Seeing the action of Ren Tianyou, Yaorao coldly snorted. Shortly afterwards a purple colored magic light appeared on the index finger of her right hand while she noiselessly chanted the incantation rapidly, “Purple Yuan Baleful Heaven, space seal off!”</p><br/><p>Along with the voice of Yaorao, the purple colored magic light on her fingertips suddenly rose, then changing into purple colored light, it directly shot into that huge barrier surrounding the radius of 10 li. And this barrier began to show huge reaction immediately.</p><br/><p>In the originally dim purple colored barrier, suddenly purple colored magic runes appeared. These magic runes as if essence, began to shine with special purple colored light, illuminating the entire space within the barrier.</p><br/><p>Meanwhile, Ren Tianyou had just absorbed the corpse of Shadow Demon God inside his kamui space. And the barrier’s purple colored magic light suddenly illuminated, but to his surprise, there was no harmful effect on his body.</p><br/><p>Shortly afterwards, when Ren Tianyou prepared to use Hiraishin no Jutsu to leave, he suddenly discovered that his Hiraishin no Jutsu had already lost its effect.</p><br/><p>“How is that? Can’t use space magic right?” At that moment, looking at Ren Tianyou with mocking smile, Yaorao said, “I already know that you are proficient in using space magic, so how can I give you a chance to use space magic? Now the space within this entire barrier is already sealed, meaning you can’t escape.”</p><br/><p>Demon Empress</p><br/>\n</div>"}