{"title": "Chapter 321: Source of strange energy", "id": 321, "volume": 4, "url": "http://boxnovel.org/in-different-world-with-naruto-system-chapter-321-source-of-strange-energy", "volume_title": "Volume 4", "body": "<h1>Chapter 321: Source of strange energy</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Source of strange energy</p><br/><p>Ren Tianyou instantly used Hiraishin no Jutsu to return back to the ship, and removed his clone.</p><br/><p>“Well Weiwei, that big fellow is already done in by me, now it’s already safe.” Standing on the deck, Ren Tianyou said it Ling Weiwei.</p><br/><p>“Truly thank you for this, Zero. If it was not for your timely appearance, then we might have really doomed.” Ling Weiwei stepped forward and thanked gratefully.</p><br/><p>“Haha, don’t mention it, in fact last time you helped me to go to God Weeping Region when I was in great hurry, so how can I just watch you die when you’re in danger?” Ren Tianyou shrugged his shoulders. Last time he was able to go to God Weeping Region with her help, and that reduced a lot of his trouble. Furthermore although this person Ling Weiwei had a little bit of bossy temperament, but she however was not that bad, and Ren Tianyou didn’t hate her.</p><br/><p>“But I say little girl, will you be okay hereafter? I met you two times, but both time you had attracted Boss of oceans.” Ren Tianyou thought about the ability of Ling Weiwei to attract big magical beasts, and had a pain in the ass.</p><br/><p>“This is just an accident that’s all, only accident……” Ling Weiwei tried to defend herself with red face.</p><br/><p>“Well, I will send you to shore, and after you are safe, I will leave.” Ren Tianyou looked at the boundless sea around him, and said. If he left now, he won’t be able to be at ease regarding the safety of Ling Weiwei. If she again attract another big boss of ocean en route, then that would really be tragedy. Although it was very hard to encounter ocean magical beast in normal times, but with the super strong charm to attract magical beast of Ling Weiwei, she might truly attract a number of dangerous magical beast.</p><br/><p>So Ren Tianyou stayed in the ship for the time being. And when they were only two days away from the coast of ocean, Ren Tianyou finally understood that he had still underestimated that super strong charm of Ling Weiwei to attract Bosses.</p><br/><p>On the way, they unexpectedly met three God’s domain realm ocean magical beasts. And all of them dashed towards the ship. Fortunately Ren Tianyou had not left before, otherwise Ling Weiwei and others would have already buried in the sea.</p><br/><p>And this made Ren Tianyou raise his alertness throughout the way. These ocean magical beasts as if demon and ghosts who had seen longevity meat, ran towards them just like a moth darting into a flame. This made him think about the possibility of someone onboard intentionally playing the trick, and that person was intentionally attracting these magical beast.</p><br/><p>But even after secretly observing for a long time, he didn’t discover any suspicious circumstance, everything was natural as if those magical beasts voluntarily running towards them.</p><br/><p>But it was impossible for these magical beasts to run towards them without any cause or reason. Three-four God’s domain realm ocean magical beast running towards them together, how could this be normal? If this was not the trick of outsiders, then the source of this everything should be within Ling Weiwei’s body.</p><br/><p>Bringing up these, Ren Tianyou recalled the incident of last time when they were sailing to God Weeping Region. At that time, they had encountered sea hydra. Although this sea hydra was attacking everyone, but its eyes seemed to mostly focus on the body of Ling Weiwei, furthermore it never used large-scale water magic to attack towards the ship, seemingly afraid of sinking the ship.</p><br/><p>“But how could this big boobs but no brain little girl Ling Weiwei attract the attacks of these magical beast? What on earth is going on here?” Ren Tianyou inwardly in confusion.</p><br/><p>At that time, he suddenly thought of Tang Seng of Journey to the west. This Tang Seng would also encounter countless demons and ghosts who wanted to catch and eat him because of longevity meat that would gave them immortality.</p><br/><p>After thinking of this point, Ren Tianyou thought about the physique of Ling Weiwei.</p><br/><p>“Is it because of her physique, Weiwei is attracting these ocean magical beasts?” Ren Tianyou thought this was the only possibility. Furthermore she herself including her family might not know about the special physique of Ling Weiwei, otherwise her elders wouldn’t have let her run everywhere all day long.</p><br/><p>After arriving at the shore, Ren Tianyou didn’t leave immediately rather called Ling Weiwei, “Weiwei, come with me, I have something I want to confirm.”</p><br/><p>“Eh? What’s the matter Zero?” Hearing Ren Tianyou, Ling Weiwei turned around and asked in confusion.</p><br/><p>“Come with me to the room, I have something to tell you.” Finished speaking, Ren Tianyou returned towards his room inside the ship.</p><br/><p>Ling Weiwei confusedly flowed behind Ren Tianyou and entered the room. When Ling Weiwei entered inside the room, Ren Tianyou closed the door of the room.</p><br/><p>Seeing Ren Tianyou had closed the door, Ling Weiwei as if suddenly thinking something, her face instantly became very red and her jade hands tightly clutched her purple skirt’s helm, while standing unsteadily.</p><br/><p>“Eh, why’s your complexion so red? Go and sit cross-legged on the bed.” Seeing Ling Weiwei suddenly blushing, Ren Tianyou couldn’t help but asked in wonder.</p><br/><p>“Zero……we……isn’t this developing very fast, and……and there are many people outside, so doing this might not be a good idea.” Hearing Ren Tianyou telling her to get on the bed, the complexion of Ling Weiwei became even redder, then still standing on the same location, she shyly said.</p><br/><p>Seeing the change in the complexion of Ling Weiwei as well as hearing her words, Ren Tianyou instantly understand her meaning. Furthermore he also realized that he had spoken too ambiguous words, so hitting his own forehead, he weakly said, “I say little girl, what are you thinking? It is impossible for my eyes to take a fancy on your this kind of figure, which resembled basin in front and resembles plains in back.” Pretending everything was all right, Ren Tianyou attacked Ling Weiwei.</p><br/><p>Hearing Ren Tianyou, the complexion of Ling Weiwei became increasingly redder, but this time it was not because of shyness, rather due to anger. She immediately kicked Ren Tianyou and sent him flying, “Bastard, where is I, your old mother’s figure not good? Before didn’t you say……, now saying my breasts are not big…….” While speaking, the voice of Ling Weiwei became smaller and smaller, and final words were so small that they were inaudible.</p><br/><p>“Cough cough, well, your breast is big, not a basin, is that fine?” Ren Tianyou stood up from the floor and said while smiling. After that he pointed towards the bed and said, “Okay, quickly sit cross-legged on the bed, I want to examine the interior of your body. This might help you greatly in your future cultivation.”</p><br/><p>“Oh.” Ling Weiwei nodded her head, then sat cross-legged on the bed. Ren Tianyou also got on the bed and placed his right hand on her shoulder, sending his perception within her body. “Sharingan, open!”</p><br/><p>Instantly, the eyes of Ren Tianyou changed into Eternal Mangekyo. Although Sharingan didn’t have any 360 degree perceptive ability of Byakugan, but it however could still see the flow of energy within the body.</p><br/><p>Along with his perception slowly entering into the body of Ling Weiwei, his Sharingan also began to spin rapidly, and a large amount of eye power continuously flowed out, which combined with the perception of Ren Tianyou to look for the abnormalities within the body of Ling Weiwei.</p><br/><p>While sitting cross-legged on the bed, Ling Weiwei felt as if the gaze of Ren Tianyou was able to see through her clothes and completely see her body, this kind of feeling made her fidgety. But she subconsciously believed in Ren Tianyou, so she merely sat motionless on the bed with her eyes closed.</p><br/><p>And the perceptive of Ren Tianyou slowly moved down from her head while carefully inspecting her body. And when his perception concentrated on her heart, he suddenly felt a special energy fluctuation.</p><br/><p>“Found you? Let me see what you are.” After feeling that obscured energy fluctuation in the heart of Ling Weiwei, Ren Tianyou smiled, then his entire perception instantly concentrated around the vicinity of her heart. And his Sharingan also firmly stared at her heart.</p><br/><p>Along with the perception power combined with the ability of Sharingan, Ren Tianyou found that in the vicinity of the heart of Ling Weiwei, there unexpectedly had a powerful water energy ball. The strength of this energy was alarmingly powerful. Ren Tianyou estimated that if this energy explode, then the surroundings within the radius of 1000 li would definitely change into ruins.</p><br/><p>But this energy was very tranquil, and was lurking within the body of Ling Weiwei without any fluctuation.</p><br/><p>“Strange, how can Weiwei have such strong energy source within her body?” Feeling the energy source within the body of Ling Weiwei, Ren Tianyou creased his brows while thinking in confusion. Ren Tianyou concentrated his eye power and concentrated his gaze at her heart, but just then, mishap suddenly occurred, a powerful energy fluctuation suddenly appeared from within the body of Ling Weiwei, and under the circumstance of being caught off guard, Ren Tianyou was directly sent flying.</p><br/>\n</div>"}