{"title": "Chapter 320: Flame of Amaterasu", "id": 320, "volume": 4, "url": "http://boxnovel.org/in-different-world-with-naruto-system-chapter-320-flame-of-amaterasu", "volume_title": "Volume 4", "body": "<h1>Chapter 320: Flame of Amaterasu</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Flame of Amaterasu</p><br/><p>“Hey beauty, aren’t you mistaken? I have never met you before, no need to talk about being your benefactor.” Ren Tianyou stepped forward and helped Yun Muqing to rise up. If he let such charming beauty to keep on kneeling him, then wouldn’t he suffer from lightning strike?</p><br/><p>“Qingqing, could it be that this person is……?” At that time, Ling Weiwei suddenly thought of something, and exclaimed in surprise.</p><br/><p>“Yes.” Yun Muqing nodded her head, then said towards Ren Tianyou, “Benefactor might not recognize me, but my life nevertheless was saved because of you, benefactor.”</p><br/><p>“In that year when I was ambushed by assassins, I was poisoned. That poison was so powerful that even the Red Robed Cardinal of Light Palace was not able to neutralize it, and was only able to suppress it for the time being. Furthermore to completely neutralize that poison, there was only one way.” Looking at Ren Tianyou, Yun Muqing gaze was filled with gratitude, “That was Purple Gauze Sky Magnificent Flower!”</p><br/><p>“What? Purple Gauze Sky Magnificent Flower!” Hearing Yun Muqing, Ren Tianyou instantly understood. “Then you should be the person who issued the mission of searching Purple Gauze Sky Magnificent Flower of that time.”</p><br/><p>After hearing Purple Gauze Sky Magnificent Flower, he immediately understood why she had asked whether he had been to Good Weeping Region or not, as well as he instantly realized that this Yun Muqing in front of his eyes was the person who had issued that mission at that time.</p><br/><p>“That mission was issued by my father. At that time, I was in coma due to that poison, and even the Light Forbidden Magic Spell—-Angel’s Tear used by Red Robed Cardinal was only able to suppress that poison temporarily for less than one year. At that time, my father exhausted various means to obtain Purple Gauze Sky Magnificent Flower, but was unsuccessful. And in the final moment, my father wanted to personally set out to God Weeping Region to find that Purple Gauze Sky Magnificent Flower, but to the surprise of everyone, in the final moment, young noble, you successfully obtained the Purple Gauze Sky Magnificent Flower. This not only saved this small woman’s life, but also made my father needless to take risk.” Speaking this much, Yun Muqing was about to bow to Ren Tianyou once again, but Ren Tianyou stopped her.</p><br/><p>“You actually don’t need to thank me. My true objective to find the Purple Gauze Sky Magnificent Flower was not to save your life, I merely took a liking to the reward of the mission that’s all. We each took what we needed nothing more, so there is no need for this.” Ren Tianyou stopped Yun Muqing who wanted to bow again and said indifferently.</p><br/><p>Although the reality was a little bit cruel, still the fact was indeed so. Initially Ren Tianyou basically didn’t know Yun Muqing, and at that time, he had went to God Weeping Region to find Purple Gauze Sky Magnificent Flower only because of the promotion test of academy, and while at it, he had accepted that mission from Mercenary Union too. In other words, if there wasn’t that assignment, then he would not have run to that God Weeping Region to fetch Purple Gauze Sky Magnificent Flower while risking his life.</p><br/><p>One should know that at that time, Ren Tianyou had almost lost his life, fortunately his willpower was firm, and at the last moment, he crawled to the side of Purple Gauze Sky Magnificent Flower saving himself.</p><br/><p>“You big idiot, can’t you say something pleasant? Do you have to be this direct?” Hearing those ruthless words of Ren Tianyou, Ling Weiwei stepped forward and unhappily said. And as for Yun Muqing, hearing those words of Ren Tianyou, she became somewhat dejected, and standing there she didn’t know what to say.</p><br/><p>“I am only telling the truth that’s all, and reality in itself is cruel. Everything is not as beautiful as you’ve imagined, I didn’t take the risk because I was attracted by Miss Yun’s charm.” Ren Tianyou shrugged his shoulder and continue to speak without care.</p><br/><p>“It seems I was too oversensitive, but in any case, many thanks noble son for your kindness of saving my life.” After hearing Ren Tianyou, Yun Muqing slightly bowed and said to Ren Tianyou.</p><br/><p>This time Ren Tainyou didn’t stop her, because he knew that this time Yun Muqing was sincere. Although Yu Muqing seemed very grateful to him before, but how could Ren Tianyou not tell whether she was sincere or not with her voice?</p><br/><p>Before she was looking at him as her pursuer who had taken risk to fetch Purple Gauze Sky Magnificent Flower to save her life, so that he could impress her. As a result although she had thanked him just now, but it was in fact disregarding the relationship, and saying that she was grateful for the kindness of saving her life, but will not accept his pursuit because of this matter.</p><br/><p>But Ren Tianyou gave no sh*t with regarding to this type of game. Right now he was only thinking about increasing his strength as far as possible before the invasion of Demon Clan.</p><br/><p>In this world, the foundation of everything was strength. You don’t have strength, then you could only live lowly forever, never holding your head high.</p><br/><p>Furthermore Ren Tianyou still wanted to raise his strength as quickly as possible to return back to the Earth, this had always been his ultimate goal. But up until now, he hadn’t found any means to return back to Earth, only knew that he had to increase his strength as far as possible, and when his strength reach the certain level, there will not be any barrier that could block him. Ren Tianyou firmly believed in this point without doubt.</p><br/><p>“Okay, my original over there is going to end the battle, take a look at it, that might help you in your future cultivation.” Ren Tianyou didn’t want to talk about this subject again, so he drew the attention of Ling Weiwei and other towards the battle.</p><br/><p>………….</p><br/><p>“Suiton—- Suiryudan! (Water Style—-Water Dragon!)” Ren Tianyou standing on the back of Sanbi quickly made a series of hand seals, then along with the completion of ninjutsu, the sea surface beside him rose rapidly, changing into huge water dragon. And this water dragon began to rush towards the water barrier in front of Ocean Capsizing Heavenly Beast.</p><br/><p>“Water Style—-Ultra large Water Dragon Roar! (——)” At this moment, Sanbi also completed its water style ninjutsu, then the sea surface began to violently roll over and over, and countless huge water dragon advanced towards Ocean Capsizing Heavenly Beast. These water dragons instantly destroyed the barrier in front of it and hit its body.</p><br/><p>“Aooo!” Ocean Capsizing Heavenly Beast immediately wailed mournfully in pain, as a huge wound appeared in its body.</p><br/><p>“Humph, the barrier is finally broken.” After seeing the water barrier in front of it had finally broken, Ren Tianyou coldly snorted. He had been continuously waiting for this moment.</p><br/><p>After that the eyes of Ren Tianyou instantly changed into Eternal Mangkyo, and his left eye spun rapidly, emitting a large amount of eye power, “Doujutsu—-Amaterasu!”</p><br/><p>Along with the voice of Ren Tianyou, slightly above the body of Ocean Capsizing Heavenly Beast where the sight of Ren Tianyou was focused, suddenly black colored flame appeared out of thin air, then it fell down on the body of Ocean Capsizing Heavenly Beast, and began burning violently.</p><br/><p>“Roar!”, “Roar!”……Just after the flame of Amaterasu fell on its body, Ocean Capsizing Heavenly Beast began to give out loud roars in pain, and unceasingly flapped its body, as well as threw itself into huge sea waves, wanting to extinguish the flame of Amaterasu.</p><br/><p>But to its fear, no matter what it did, it was powerless to extinguish this flame, instead it burning speed increased.</p><br/><p>“And here comes the additional fuel. Enton—-Kagutsuchi! (Inferno Style—-Flame Control!)” Looking at the Ocean Capsizing Heavenly Beast roaring in pain, Ren Tianyou just snorted coldly. Then along with the rapid spinning of right eye, large amount of eye power gushed out, and that flame burning the body of Ocean Capsizing Heavenly Beast suddenly began to spread rapidly all over its huge body. Along with the burning of Amaterasu, the roar of Ocean Capsizing Heavenly Beast became increasingly small, and finally its body sunk down the ocean. With its body sinking down, the Amaterasu continue to burn the sea surface.</p><br/><p>“Finally finished off this troublesome big fellow.” Seeing Ocean Capsizing Heavenly Beast was burned to death by Amaterasu, Ren Tianyou sighed.</p><br/><p>Although the strength of this Ocean Capsizing Heavenly Beast was weak, but it after all was one of the overlord of ocean, and it had extreme advantage in sea area, so finishing it off was truly not easy. As a result Ren Tianyou summoned Sanbi to violently attack and break its defense, and seizing that chance, he immediately used Amaterasu to finish it off.</p><br/><p>Because it had huge body, using Amaterasu to finish off was most suitable choice.</p><br/><p>“Well, now that enemy is gone, I am leaving first.” After seeing Ocean Capsizing Heavenly Beast had already died, Sanbi said to Ren Tianyou, then along with the appearance of white smoke, it disappeared.</p><br/><p>And after Sanbi left, Ren Tianyou also targeted the space coordinate of his clone body, then used Hiraishin no Jutsu to instantly appear on the ship.</p><br/>\n</div>"}