{"title": "Chapter 338: Gain", "id": 338, "volume": 4, "url": "http://boxnovel.org/in-different-world-with-naruto-system-chapter-338-gain", "volume_title": "Volume 4", "body": "<h1>Chapter 338: Gain</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Gain</p><br/><p>Along with the appearance of space black hole, huge golden energy light beam fell down straight upon him from this black hole, covering the whole body of Ren Tianyou.</p><br/><p>After this energy entered into his body, that boundless chakra within the body of Ren Tianyou began to violently roll over and over, greedily absorbing these terrifying power.</p><br/><p>After undergoing the transformation due to the power of Forever Green, the physique of Ren Tianyou could be said to have already surpassed Naruto World’s Senju Hasirama and Uchiha Madara, and the potential of his own body was already beyond the imagination of Ren Tianyou himself. Now the difference between he himself and Senju Hasirama and Uchiha Madara was merely a number of time to accumulate details.</p><br/><p>And now, half the origin power of Divine Wind Continent contained in Tower of Babel, which had become extremely pure worldly energy after undergoing the refinement for 30,000 years was directly entering the body of Ren Tianyou as if pouring, and changed into chakra within the body of Ren Tianyou.</p><br/><p>The chakra capacity of Ren Tianyou began to increase rapidly. In just a moment, his chakra had already increased by nearly one-quarter.</p><br/><p>Ren Tianyou’s chakra in itself, after undergoing the refining of these few years, coupled with his fortuitous encounter, his chakra level was already comparable to primary tailed beasts.</p><br/><p>And now, obtaining that energy of Tower of Babel which was slowly accumulated in 30,000 years, and changing it into chakra, his overall chakra began to increase at a speed which could be seen with naked eyes.</p><br/><p>Just think, how much energy did Tower of Babel absorbed over these past 30,000 years, one might well say, its beyond imagination of ordinary person. Although the amount of accumulated energy used by Tower of Babel to seal the transfer passage of Demon clan as well as Demon clans within the tower for these 30,000 years was not low, but the surplus accumulated energy was still very considerable.</p><br/><p>Along with the gradual passage of time, roughly three hours passed, and that huge golden energy beam falling down from the sky gradually become weaker, then the energy slowly disappeared. Right now a great changes had already occurred insides the body of Ren Tianyou.</p><br/><p>If the previous overall chakra of Ren Tianyou could be said to be a river, then the current was a vast expanse of the sea, this growth was far more than merely several times ah.</p><br/><p>Furthermore this was still not over. After the energy beam disappear, a small-sized Tower of Babel’s shadow gradually appeared from the space black hole. This was the energy core of Tower of Babel. As long as one obtain this tower’s shadow, he can completely control this Tower of Babel.</p><br/><p>This energy baptism of just now was the energy of Tower of Babel to strengthen its inheritor, after all, the more stronger the strength of Ren Tianyou was, that more Ren Tianyou would be able to bring out its power. Only after that, the odds of winning against Yaorao in a fight would be higher.</p><br/><p>The tower’s shadow directly fell down from the sky and entered into the body of Ren Tianyou and disappeared. After that tower’s shadow entered into his body, Ren Tianyou instantly sensed that he was connected to something.</p><br/><p>Slowly closing his eyes, Ren Tianyou suddenly discover everything within Tower of Babel was within his grasp. If he wants to then he could instantly move to anywhere within this tower. Now within this tower, he was supreme master.</p><br/><p>And not only that, Ren Tianyou also sensed a connection between him and the outside world, Divine Wind Continent’s space. Now he felt that, with a wave of a hand, he could borrow the worldly energy, and space seemed to not obstruct his steps.</p><br/><p>This was the ‘Power of Realm’ of Divine Wind Continent bestowed by Tower of Babel to Ren Tianyou. Now every movement of the entire Divine Wind Continent was within the grasp of Ren Tianyou. He could draw the support of this ‘Powe of Realm’ to completely seal off the space of certain range, just like Yaorao sealing the space to block the space ninjutsu of Ren Tianyou.</p><br/><p>Furthermore the function of Tower of Babel also appeared in the brain of Ren Tianyou, and he also instantly understood how to use Tower of Babel.</p><br/><p>Tower of Babel had a space inside the tower. In this space, all the laws and rules were determined by Tower of Babel and its master. And the biggest function of Tower of Babel was sealing, he could suck in his enemies inside the tower, then use the power of tower to seal him forever, making him unable to escape.</p><br/><p>Just like at that time’s Heaven Sealing Demon God. At that time, Tower of Babel was exerting all of its effort to withstand the bombardment of Demon clan from the other side of the passage, and was powerless to deal with the seal within the tower, leading to Heaven Sealing Demon God being able to attack others within Tower of Babel, but even like this, Heaven Sealing Demon God was still powerless to break free from Tower of Babel with his strength.</p><br/><p>Furthermore Tower of Babel could suppress other people, and use its powerful exceedingly high divine power to suppress everything with a certain rage. This was the greatest function of Tower of Babel.</p><br/><p>Ren Tianyou stood up, then sensing that terrifying chakra capacity within his body, he slowly clenched his hands into fists, and released a trace of powerful sense of oppression from his body towards his surroundings, “Haha, good power, this is my, Ren Tianyou’s true power.”</p><br/><p>“Well, now that you have already grasped my origin power, you can use Tower of Babel. Now you only need to collect my body after you go out.” After seeing Ren Tianyou had already accepted his inheritance, the spirit of Tower of Babel slowly said. Shortly afterwards, its body directly changed into a golden light and entered into the body of Ren Tianyou, then a tower’s shadow appeared in the sea of consciousness of Ren Tianyou.</p><br/><p>The current level of Ren Tianyou’s chakra was basically comparable to Senju Hasirama and Uchiha Madara. And now if he were to fight against Uchiha Madara, then who would win and who would lose was uncertain.</p><br/><p>After sensing the surging chakra within his body, Ren Tianyou instantly appeared outside the Tower of Babel with a single thought, and saw a towering huge tower piercing straight to the skies.</p><br/><p>And with a thought of Ren Tianyou, this towering Tower of Babel began to shake violently, and huge fissures appeared on the surrounding grounds.</p><br/><p>The shaking got increasingly bigger, and this Tower of Babel suddenly become smaller rapidly. In a blink of an eye, that towering Tower of Babel already changed into a merely 20 centimeter high and flew to the palm of Ren Tianyou’s right hand.</p><br/><p>“Never thought that one day I’d become the king of ‘Tower of Babel’.” Ren Tianyou couldn’t help but made a wry smile, the put away Tower of Babel within his body.</p><br/><p>And along with the disappearance of Tower of Babel, the transfer passage of Demon clan which was being suppressed by Tower of Babel began to crack slowly, “It seems, Demon clan might arrive at an earlier date, now I should return back to prepare.”</p><br/><p>Finished speaking, along with kamui of right eye, he disappeared from there.</p><br/>\n</div>"}