{"title": "Chapter 347: Edo Tensei Jutsu", "id": 347, "volume": 4, "url": "http://boxnovel.org/in-different-world-with-naruto-system-chapter-347-edo-tensei-jutsu", "volume_title": "Volume 4", "body": "<h1>Chapter 347: Edo Tensei Jutsu</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Edo Tensei Jutsu (Reanimation Jutsu)</p><br/><p>“Kuchiyose—-Edo Tensei! (Summoning Jutsu—-Reanimation!)”</p><br/><p>Ren Tianyou quickly made a series of hand seals, and finally clapped his hands, then along with the quick depletion of a portion of chakra within his body, the ground under the high platform where Ren Tianyou was standing suddenly began to crack. Shortly afterwards, three wooden coffins broke out from the ground, and appeared in front of Anlake and company.</p><br/><p>“What are these things?” Seeing the sudden appearance of three coffins, Agule couldn’t help but ask confusedly.</p><br/><p>“Be careful, you two. I suddenly have a bad feeling.” Seeing the sudden appearance of three coffins, don’t know why but a restless feeling suddenly welled up inside the heart of Anlake, as if something bad was going to happen.</p><br/><p>Shortly afterwards, the lids of three coffins slowly fell down, then three figures became visible inside the coffins. When the appearance of these three figures were seen clearly, Anlake was instantly stunned, and his eyes were filled with disbelief.</p><br/><p>“This…..how is this possible?”</p><br/><p>Anlake’s gaze was firmly fixed on the figure inside the middle coffin among these three figures. This figure was a handsome middle-aged man wearing black colored long robe, and was quietly standing inside the coffin.</p><br/><p>And as for the figures inside the remaining two coffins, both of them was also the people of Demon clan with tall and big stature. Among them, one was holding spear and wearing black colored battle armor, and other was holding sabre. This moment, they were also quietly standing inside the coffins.</p><br/><p>Just then, the body of these demons suddenly emitted a light white smoke, then their body slowly moved, and opening their eye which had grey colored sclera, they walked out from the coffin.</p><br/><p>“This is……?” After walking out of the coffin, that middle-aged man wearing black colored long robe looked all around him, then thought aloud in confusion. Shortly afterwards, his gaze was suddenly filled with disbelief seeing Anlake, and he asked in uncertainty, “Are you……? Anlake?”</p><br/><p>“Tea…teacher!” Hearing this middle-aged man, Anlake said with slightly trembling voice.</p><br/><p>“What? Teacher? Sire Anlake, this person is?” Hearing Anlake addressing this middle-aged man as teacher, Yisha couldn’t help but asked to Anlake.</p><br/><p>“He is my teacher, named Andre, once venerated as Dark Night Demon God.” Looking at this middle-aged man i.e. Dark Night Demon God—Andre, Anlake slowly said. “100,000 years ago, he was the head of three Great Demon Gods, and above all, he is regarded as the strongest Demon God in the history of Demon World, not one of the strongest.”</p><br/><p>“Stro…strongest Demon God?” Agule was stunned and asked stutteringly.</p><br/><p>“What’s going on here? Aren’t we all already dead? How come we return to life again?” That Demon God holding spear, moved his right hand, and looking at the surroundings all around, he asked in disbelief.</p><br/><p>“We indeed are already dead, but I guess someone resurrected us using special means.” That demon clan holding sabre sensed his body, but discovered that he basically was unable to feel any feeling of flesh and blood, moreover his movement seems to be under the control of a mysterious power.</p><br/><p>“I think the person who resurrected and control us should be you, this human.” Andre turned around and looked towards Ren Tianyou standing on the high platform and said coldly.</p><br/><p>Indeed, as once strongest Demon God, now, after his death, other people unexpectedly resurrected him as a pawn, moreover controlled his actions, so how could he not have killing intent towards Ren Tianyou.</p><br/><p>“Indeed, I am the one who resurrected you all.” Ren Tianyou indifferently said, “But I resurrected all of you not to talk about old days, rather to eradicate all my enemies.”</p><br/><p>These three were naturally the resurrected corpses using Edo Tensei among the corpses of Demon Generals and Demon Gods Ren Tianyou had dug out from the Demon Empress Graveyard of Demon World at that time.</p><br/><p>This Dark Night Demon God was Demon World’s publically acknowledged strongest Demon God, not one of the strongest. Legend stated that his strength had already stepped into the border of Demon Emperor. And the remaining two were former Demon Generals. That one holding spear was called Baluke, and other holding sabre was called Luoerna.</p><br/><p>As a matter of fact, the number of people Ren Tianyou had resurrected was not limited to these, but Ren Tianyou had set aside the other resurrected people for reserve.</p><br/><p>“Well, now that the chat is officially over, why don’t you all begin to take action?” Finished speaking, Ren Tianyou made a series of hand seals, immediately afterwards, Dark Night Demon God and other two resurrected Demon Generals felt their body advancing towards Anlake and others without their control.</p><br/><p>“Anlake, stop me, here, only you are most familiar with my means, moreover now I am not strong as when I was at my peak. So try your best to stop me.” Andre dashed towards Anlake, and his body began to slowly emit a dark demonic light, then terrifying aura spread out from his body.</p><br/><p>“Now we are under his control, and all our actions are basically not under our control, so juniors, come up with your strongest power to stop us.” Luoerna with sabre in his hand said to Agule, then he rushed towards him. And Baleke also rushed towards Yisha.</p><br/><p>And as for Ren Tianyou, he sat on the high platform while indifferently looking at the fight underneath, and began to rapidly recover his chakra. He wanted to keep his strongest state at all times, so that he could deal with Yaorao who might arrive at any time. As Yaorao possessed the power of four Universe Boundary Divine Artifact, he dreaded her endlessly, so he wanted to keep his strongest state at all time.</p><br/><p>………………</p><br/><p>Meanwhile, in the battle of Ailer Empire and Dark Empire, they had also already began to exchange fire. The humanity and 100 clans’ allied army had already come into contact with demon army, moreover battle was already in a full swing. Although humanity was master of battleground, but in individual battle, humanity truly occupied disadvantageous position.</p><br/><p>When all was said and done, humanity’s soldiers’ combat power was slightly weaker than demon clan, moreover the difference in the cooperation between humanity and demon clans was too much. When battling, these people of demon clan could basically understand the thoughts of each other with merely an eye contact, then mutually cooperating they pressured humanity.</p><br/><p>But although humanity was in disadvantageous position for the time being, but it was still too early to say that humanity would definitely lose. Each team under the leadership of each team leader were preparing to counterstrike.</p><br/><p>…………………..</p><br/>\n</div>"}