{"title": "Chapter 355: Super Shinra Tensei", "id": 355, "volume": 4, "url": "http://boxnovel.org/in-different-world-with-naruto-system-chapter-355-super-shinra-tensei", "volume_title": "Volume 4", "body": "<h1>Chapter 355: Super Shinra Tensei</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Super Shinra Tensei (Almighty Push)</p><br/><p>“It seems this fellow is capable of absorbing all energy based attacks, if this is the case, then things are little tricky.” Yaorao stably landed on the ground, and seeing the huge dragon created by her energy was absorbed by Ren Tianyou as well as recalling him absorbing her energy before when she came into contact with him, she couldn’t help but thought inwardly.</p><br/><p>“When we fought before, he shouldn’t have this kind of abilities, otherwise he would have use it at that time.” Yaorao unhurriedly thought, then her gaze came to stop at the eyes of Ren Tianyou. And seeing Rinnegan, she couldn’t help but thought, “Are those the abilities of his eyes? The pattern of his eyes is different from before.”</p><br/><p>“If he can absorb ordinary energy, then let try my real Purple Yuan Power.” Thinking this, Yaorao made hand signs, and a crystal ball with purple radiance floated out from her body. The purple light of this crystal ball was brighter and deeper compared to the purple radiance on the body of Yaorao. This crystal ball was Demon World’s Universe Boundary Divine Artifact—-Purple Ling Dark Break!</p><br/><p>“Intending to use the energy of divine artifact?” Seeing the action of Yaorao, Ren Tianyou couldn’t help but creased his brows, and also became alert inwardly. The power of Universe Boundary Divine Artifacts cannot be underestimated, as each of them contain 50% origin power of their respective realm. Furthermore now Yaorao had already gathered four Universe Boundary Divine Artifact, so how could Ren Tianyou not be cautious and alert.</p><br/><p>“He!” After Purple Ling Dark Break emerged, Yaorao shouted loudly, then this crystal ball slowly shrunk, and slowly entering into the space between the eyes of Yaorao, it disappeared, and at the same time, a purple colored six edged star shaped mark appeared on the space between her eyebrows.</p><br/><p>After Purple Ling Dark Break fused with her, Yaorao quickly flew up to the sky, and quickly made hand signs, while silently chanting incantation.</p><br/><p>Along with the action of Yaorao, a fierce wind suddenly blew in the originally calm sky, and this wind increasingly became strong. Suddenly above the ground, sand flew about and stones hurtled through the air as if the prelude of the storm.</p><br/><p>Meanwhile, a deep purple colored energy radiance rose from the body of Yaorao. This radiance was even brighter than the purple light of before. Along with the appearance of this purple radiance, a deep purple colored energy cloud rapidly gathered in the sky above them. This cloud covered the radius of several tens of li around the sky. After that, countless energy vortexes slowly appeared in this cloud, and huge energy storm wreaked havoc.</p><br/><p>“Purple Yuan Heaven Explosion!”</p><br/><p>After Yaorao finished chanting the incantation, and also finished making hand signs, countless purple colored hand print entered into the clouds in the sky. Then from those countless energy vortexes of purple colored cloud, countless purple colored energy tornadoes fell down in succession, quickly sweeping across Ren Tianyou. Immediately numerous cracks and fissures appeared on the ground. Even the ground itself was also unable to endure the attack of Yaorao, and ruptured continuously.</p><br/><p>“What a great spectacle!” Seeing those countless energy tornadoes and the ground beginning to rupture, Ren Tianyou exclaimed, as countless huge storm swept across the entire world.</p><br/><p>“But all energy based attack is useless against me.” Looking at these deep purple colored energy storm, Rinnegan of Ren Tianyou glimmered with large amount of eye power, then slowly extending his hand, he got ready to absorb the nearest tornado formed from Purple Yuan Power.</p><br/><p>But just at this time, Ren Tianyou suddenly felt chill in his heart, and a danger feeing also emerged in his heart.</p><br/><p>Ren Tianyou paused, and didn’t directly use the absorption power of Rinnegan, rather made a series of hand seals. “Wood Style—-Wood Clone Justu!”</p><br/><p>A wooden clone appeared beside Ren Tianyou, then that wooden clone stepped forward and used absorption power of Rinnegan on that nearest purple colored tornado. After that, before the eyes of Ren Tianyou, that purple colored tornado was slowly absorbed by the clone of Ren Tianyou, and that tornado rapidly shrunk.</p><br/><p>Seeing this, Ren Tianyou was relieved, and just when he was preparing to raise his hand again, a change occurred. Suddenly a purple colored radiance emerged from the body of his wooden clone, completely surrounding him.</p><br/><p>And after the wooden clone was completely surrounded by this purple radiance, its body began to melt rapidly, as if was dissolving.</p><br/><p>“Sure enough, my foreboding was not a mistake, fortunately I didn’t absorb myself.” Seeing the fate of his wooden clone, Ren Tianyou couldn’t help but took a deep breathe, as a trace of lingering fear flashed through his heart.</p><br/><p>Although Rinnegan could absorb all energy based attacks, but it was powerless to assimilate a number of special energies. Just like when the Preta Path clone of the Six Path of Pain absorbed the senjutsu chakra of Naruto, that clone was petrified, after Yaorao merged with Universe Boundary Divine Artifact, the energy with her body completely changed into true Purple Yuan Power, and once he absorbs it, his body would be melted by the power of Purple Yuan Power.</p><br/><p>“If it cannot be assimilated, and this Purple Yuan Power possess even stronger melting power compared to Corrosion Style, then I can only spend a bit more effort to settle this move.” Seeing countless energy storm already gathered around him, Ren Tianyou slowly thought inwardly.</p><br/><p>And as for Yaorao, after releasing this move, she quickly withdrew, in order to avoid suffering from her own move. Seeing Ren Tianyou was powerless to absorb her Purple Yuan Power, Yaorao was relieved inwardly, because this way, she would not be in disadvantage position in this fight.</p><br/><p>Ren Tianyou sighed looking at those energy storm all around him for a while, then he quickly flew up towards the sky, and spread open his arms. After that large amount of chakra with his body began to gather quickly, and eye power of his Rinnegan also began to flow out rapidly.</p><br/><p>And just when those tornadoes were about to reach Ren Tianyou, a very powerful repulsive force with heaven destroying and earth exterminating rapidly spread out in all direction from the body of Ren Tianyou.</p><br/><p>“Super—-Shinra Tensei!”</p><br/><p>“Hong!” Loud sound of explosion resounded, and the ground around him were immediately split open in succession. Along with the tore open ground, those countless purple colored energy tornadoes around were also immediately blown away by this powerful repulsive force, then changing into energy, they dissipated in the sky.</p><br/><p>Ren Tianyou’s this move—super Shinra Tensei engulfed the surroundings within the radius of over 20 li. Within this 20 li limits, everything were completely destroyed, not only that, but a huge crater which was more than 10 meters deep and over 20 li in radius appeared on the ground.</p><br/><p>As for distant Yaorao, when Ren Tianyou launched Super Shinra Tensei, she quickly reacted. She used Purple Ling Dark Break to create a layer of purple colored energy shield in front of her. And although she was also sent flying by the impact of Super Shinra Tensei, but she was still unscathed.</p><br/>\n</div>"}