{"title": "Chapter 358: Yaorao’s summon", "id": 358, "volume": 4, "url": "http://boxnovel.org/in-different-world-with-naruto-system-chapter-358-yaorao%E2%80%99s-summon", "volume_title": "Volume 4", "body": "<h1>Chapter 358: Yaorao’s summon</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Yaorao’s summon</p><br/><p>Ren Tianyou suddenly felt a spying upon power from the void, which was seemingly watching the entire battlefield. And noticing this spying upon power, Yaorao also immediately ceased her action, and spread her divine sense looking for that spying upon consciousness.</p><br/><p>Just then, a voice suddenly resounded on the mind of Ren Tianyou: “Sire Zero, I am Ling Xiaotian.”</p><br/><p>“Clan Head of Tianji clan? Why are you seeking me?” Hearing the voice in his brain, Ren Tianyou replied back in his brain feeling surprised. He wondered why he was seeking him in a time like this.</p><br/><p>“It’s like this, I would like to trouble Sire to draw this battle to the sea area, because the land there is already unable to withstand your battle. Right now Eiffle Capital’s land is already in a complete mess, and if it is hit again, then the land around will definitely sink.” The requesting voice of Ling Xiaotian resounded in the mind of Ren Tianyou.</p><br/><p>Hearing Ling Xiaotian, Ren Tianyou seriously looked the surroundings of all around. The land around was already in ruin, there were huge craters and cracks all around the ground. And water had already begun to spring out from deep underground.</p><br/><p>“Hu……!” Ren Tianyou exhaled a long breathe, then said towards Ling Xiaotian in his brain, “Well, I got it, I will try to draw the battlefield to the sea area as much as possible.”</p><br/><p>“Many thanks, Sire Zero.” Hearing the reply of Ren Tianyou, Ling Xiaotian gratefully thanked to Ren Tianyou. But he also knew that this matter was not good to do, after all, current Ren Tianyou and Yaorao were evenly matched, so it was not so easy to change the location of battlefield.</p><br/><p>“Okay, quickly leave, I will try to draw the battlefield to seaside as much as possible. The Demon Empress seems to have already noticed your existence, if she follow the tracks of your divine sense to launch an attack towards Radiance Capital, then that would be bad.” Seeing Yaorao seemed to have already discovered Ling Xiaotian, Ren Tianyou hastily said to Ling Xiaotian in his brain.</p><br/><p>“Then I hope Sire will be careful, and hope you will win a victory on raising the flag in this place.” Hearing Ren Tianyou, Ling Xiaotian said a sentence and disappeared from the battlefield.</p><br/><p>And as for distant Yaorao, after noticing that spying upon consciousness had disappeared, she again paid complete attention to that Full Body Susanoo of Ren Tianyou.</p><br/><p>“I truly cannot look down upon the energy of that thing, it seems I have to come up with real strength to deal with him.” Looking at that huge body of Ren Tianyou’s Susanoo, Yaorao couldn’t help but thought solemnly.</p><br/><p>But at this time, Ren Tianyou’s Susanoo suddenly sprout two huge energy wings behind it. Then flapping its wings, this Full Body Susanoo which was over 50 meters in height flew away.</p><br/><p>“Want to run? It’s not that easy.” Seeing Ren Tianyou wanted to fly away, Yaorao couldn’t help but snorted coldly, then changing into a purple light, she chased after Ren Tianyou.</p><br/><p>Merely after running less than 100 li distance, Yaorao had already caught up to him.</p><br/><p>After that Yaorao waved her hand, and Purple Ling Dark Break flew out from her body and shot towards Ren Tianyou.</p><br/><p>Seeing Purple Ling Dark Break flying towards him, the right hand of Ren Tianyou’s Susanoo brandished Futsu no Mitama sword, sending out a huge purple colored lighting slash towards Purple Ling Dark Break, knocking it back.</p><br/><p>“You want to run? Today unless you hand over Tower of Babel to me, don’t imagine that it’s possible to leave this place.” Yaorao caught the knocked back Purple Ling Dark Break, then coldly shouted towards Ren Tianyou.</p><br/><p>Shortly afterwards, Yaorao waved her hand again, then purple colored radiance flew towards the sky, and two space black holes appeared in the sky. Shortly afterwards, two loud roar came through these two black holes, and two figures flew out from inside that black hole.</p><br/><p>“This is…?” Seeing these two figures that had flown out from the space black hole, the pupils of Ren Tianyou suddenly shrunk, and flashed with shocked expression.</p><br/><p>One was a nine headed huge snake which was over 40 meter in length, it flew out of black hole and landed beside Yaorao, and its nine pairs of eyes coldly stared at Ren Tianyou, precisely was Yaorao’s demon pet—-Abyss Hydra.</p><br/><p>This Abyss Hydra had already stepped into the realm of God Emperor in strength, although was not as strong as Yaorao, but was far stronger than Demon Gods.</p><br/><p>And the other one made Ren Tianyou even more surprised, because it turned out that the other one was precisely that Thousand Eyes Evil Beast that was trapped in Demon World.</p><br/><p>“How can this fellow appear here? According to reason, it and Yaorao are definitely mortal enemies, so it shouldn’t have helped her.” The appearance of Thousand Eyes Evil Beast surprised Ren Tianyou the most, he didn’t understand why Thousand Eyes Evil Beast was helping Yaorao.</p><br/><p>“Roar, Your Majesty Demon Empress, is this human the enemy of this time?” Abyss Hydra flew down from the sky, and came underneath Yaorao, letting her stand at the centermost snake head, and asked. As for Thousand Eyes Evil beast, it landed beside Abyss Hydra and floated there without any movement and sound.</p><br/><p>What Ren Tianyou didn’t notice was, after Thousand Eyes Evil Beast appeared, a strange mirror suddenly appeared on the waist of Yaorao, and stuck with her belt.</p><br/><p>“Yes, we absolutely can’t let this fellow run away, Tower of Babel is with him.” Yaorao nodded her head and said to Abyss Hydra.</p><br/><p>“Got it!” Abyss Hydra answered, then it raised one of its snake head, and purple colored lightning sparks gathered above its that snake head.</p><br/><p>Along with the call of Abyss Hydra, suddenly large amount of black clouds which was densely covered with lighting sparks appeared in the sky. Huge lightning snakes were unceasingly wandering in this cloud.</p><br/><p>“Thunderbolt Roar!”</p><br/><p>Along with the voice of Abyss Hydra, countless huge thunderbolts struck towards the Susanoo of Ren Tianyou from the sky.</p><br/><p>“Hong”, “hong’, “hong”……a series of explosion sound unceasingly resounded, and the Susanoo of Ren Tianyou was engulfed by countless thunderbolts, and under these thunderbolts, the ground around ruptured with a loud bang.</p><br/><p>When thunderbolts ceased, and dark clouds dissipated, Ren Tianyou’s Susanoo was standing there without a scratch. And right now lightning sparks were glimmering around Futsu no Mitama swords, and the surroundings’ lightning elements were being rapidly absorbed by Futsu no Mitama sword.</p><br/><p>“What? He is absorbing lightning.” Seeing its lightning was being absorbed, Abyss Hydra exclaimed in surprise. It had never expected this result.</p><br/><p>No kidding, Fursu no Mitama sword was the sword of Takemikazuchi, possessing the ability to control myriads of thunder and lightning, so how could ordinary lightning attack flaunt its superiority in front of this sword.</p><br/><p>“Now that I have already recovered Rinnegan’s power, I don’t need to waste eye power using Susanoo.” Feeling the recovery of his Rinnegan, Ren Tianyou slowly thought.</p><br/><p>This was not because Susanoo was weak, rather because Ren Tianyou wanted to use other moves first to deal with these three in front of him, after all, the mobility of Susanoo was somewhat weak, so facing the besiege of three people, it would be hard to dodge.</p><br/><p>Thinking this, The Susanoo around Ren Tianyou slowly melted, revealing Ren Tianyou’s body.</p><br/>\n</div>"}