{"title": "Chapter 361: Nine tailed-beasts", "id": 361, "volume": 4, "url": "http://boxnovel.org/in-different-world-with-naruto-system-chapter-361-nine-tailed-beasts", "volume_title": "Volume 4", "body": "<h1>Chapter 361: Nine tailed-beasts</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Nine tailed-beasts</p><br/><p>“Fly to the outer space where no one can reach!” Ren Tianyou standing on Rashomon, outstretched his arms, and with chakra within his body rapidly consuming as well as powerful eye power gushing out from his those Rinnegan, that satellite floating in the mid-air, which was over 100 kilometers in diameter created by his Rinnegan dojutsu—-Chibaku Tensei, directly flew towards the sky, and breaking through the atmosphere, it flew to outer space.</p><br/><p>“Huhu!” After completing all this, Ren Tianyou suddenly felt weak and fell down to one knee on the ground. Large beads of sweat drops flowed down his face, and a feeling of lacking strength came through his body.</p><br/><p>“Your grandfather, did I create this thing too big, now I don’t have enough chakra to use.” Feeling the remaining amount of chakra with his body, Ren Tianyou forced a smile while thinking.</p><br/><p>“But if I don’t create this big, then it might be unable to suppress that Abyss Hydra. Although its strength was far below compared to Yaorao and Thousand Eyes Evil Beast, still it after all is a magical beast that had stepped into God Emperor realm. So if I was not firm enough, then I really wouldn’t have been able to suppress it.”</p><br/><p>At this time, distant Yaorao had already flown back, and seeing her demon pet ceased to exist just like this, her complexion was certainly not good-looking. Then staring at Ren Tianyou who had a little pale complexion not far away, she coldly said: “It seems I was still being too benevolent to you. Originally, seeing you are a rare talent, I thought you might have a chance to enter that place with me, but as it now seems, it’d have been much better to kill you in the beginning.”</p><br/><p>As her voice resounded, Thousand Eyes Evil Beast also arrived beside her and stared at Ren Tianyou.</p><br/><p>“Heh heh, I’m very sorry, Tower of Babel you needed is a thing I must obtain, moreover just like you, I also need even more Universe Boundary Divine Artifacts, so I must obtain all the Universe Boundary Divine Artifacts on your body too.” Ren Tianyou staggered to stand up. Although two-thirds of chakra within his body was already spent, but he still didn’t have any fear on his face.</p><br/><p>“Haha, truly funny, with your current state, do you think it is possible to seize Universe Boundary Divine Artifacts from me? Moreover, now I am using only 30% of my total strength, and here you want to fight with me relying on your this state of serious energy loss? Do you think you have that strength?” Hearing Ren Tianyou, Yaorao mocked Ren Tianyou as if she had heard greatest joke.</p><br/><p>“Relying on what? Heh heh……” Hearing Yaorao’s mocking words, Ren Tianyou sneered. Then extending his hands, he bit the thumbs of his hands. After that rapidly making a series of hand seals, he simultaneously slammed both of his hand on the ground, and large two black colored runes immediately appeared on the ground, “Relying on my nine tailed-beasts!’</p><br/><p>“Summoning Jutsu!”</p><br/><p>Along with the voice of Ren Tianyou, on the dilapidated ground in front of him, suddenly ‘peng’, ‘peng’, ‘peng’……nine huge white colored smoke appeared, pervading all over the battlefield.</p><br/><p>Just after that, several loud ‘beasts roaring’ sound resounded from inside the smoke, and the powerful sound wave directly dispersed this smoke, revealing the circumstance inside.</p><br/><p>“This……this is?” Seeing this circumstance before her eyes, the complexion of Yaorao suddenly changed and a solemn looks appeared on her face.</p><br/><p>Nine more than 30 meters giant magical beasts had appeared in front of Yaorao. These were nine tailed-beasts Ren Tianyou had exchanged before he had gone to Demon World before.</p><br/><p>Ichibi Shukaku, Nibi Matatabi, Sanbi Isobu, Yonbi Son Goku, Gobi Kokuo, Rokubi Saiken, Nanabi Chomei, Hachibi Gyuki and finally Kyuubi Kurama also known as demon fox possessing infinity chakra!</p><br/><p>This was the hidden trump Ren Tianyou had prepared to fight against Yaorao, as, Ren Tianyou was truly powerless to defeat current Yaorao by himself. After all Yaorao had survived for more than hundred thousands of years, possessed four Universe Boundary Divine Artifacts as well as had obtained the inheritance power of Universe Boundary Divine Artifacts four times, so how could Ren Tianyou who had suddenly raised his power sharply in extremely short period of time be capable of shaking her.</p><br/><p>“Xiu!” Ren Tianyou directly jumped on the head of Kyuubi Kurama, and said to Kyuubi, “Kurama, lend me a little bit of your chakra to replenish my chakra.”</p><br/><p>“Boy, we’ll help you, but we hope you are able to fulfill the promise you have made to us at that time.” Hearing Ren Tianyou, Kurama said.</p><br/><p>“You can rest assured, I have no need to deceive you all, now I have already awakened Rinnegan, you should know what this means, isn’t that so?” Ren Tianyou nodded his head, and said to Kurama. At that time, after he had exchanged all the tailed-beasts, naturally these ambitious and proud tailed-beasts didn’t listen to any of his words, but after Ren Tianyou displayed his Eternal Mangekyo Sharingan, plus with the agreement he made with them, they finally agreed to help him.</p><br/><p>“Since that is the case, I will give you chakra.” Hearing Ren Tianyou, Kurama answered, then large amount of chakra sprang out from its body and entered the body of Ren Tianyou, rapidly replenishing his chakra.</p><br/><p>Sensing powerful aura on the body of Kyuubi, the complexion of Yaorao got increasingly solemn. Immediately after that, Purple Ling Dark Break flew out from her body, and her right hand also held that mirror. After that landing on the head of Thousand Eyes Evil Beast, she said, “Attack!”</p><br/><p>“Roar!” Hearing the command of Yaorao, Thousand Eyes Evil Beast immediately looked up to heaven and roared, and those countless eyes on its body shone, then suddenly black demonic clouds appeared above in the sky, covering the sky within the surrounding of 100 li.</p><br/><p>And in this black clouds, suddenly countless eyes appeared. These eyes contained black colored energy, and were linked with the eyes of Thousand Eyes Evil Beast.</p><br/><p>“Exterminating all the life within the radius of 100 li, now I will kill you thoroughly, then take Tower of Babel from your corpse.” Looking at Ren Tianyou and nine tailed beasts, Yaorao coldly said.</p><br/><p>Along with the voice of Yaorao, Thousand Eyes Evil Beast immediately launched its attack. After that those countless eyes in the demonic clouds suddenly shone, and countless black light beam whose diameter was over one meter fell down towards Ren Tianyou and nine tailed beasts.</p><br/><p>“100 li Extermination!”</p><br/>\n</div>"}