{"title": "Chapter 363: Shadow Demon God", "id": 363, "volume": 4, "url": "http://boxnovel.org/in-different-world-with-naruto-system-chapter-363-shadow-demon-god", "volume_title": "Volume 4", "body": "<h1>Chapter 363: Shadow Demon God</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Shadow Demon God</p><br/><p>Before the gaze of everyone present, the lid of that coffin slowly opened, revealing a figure of Demon clan inside it.</p><br/><p>This was a middle-aged man with a little gloomy complexion who wore a black colored leather armor, now quietly stood inside coffin. And along with the move of Yue’er, white colored dusts slowly emerged on the surface of his body, and his two eyes also opened slowly.</p><br/><p>After this middle-aged man walked out of coffin, he looked all around in confusion, then clenching his hand into fists and feeling he could move about his body, he muttered, “Where is this? Shouldn’t I be already dead? What the hell is going on here?”</p><br/><p>“You have indeed already died, merely I resurrected you.” Looking at this middle-aged person in front, Yue’er said. From the explanation of Ren Tianyou, she knew that this middle-aged person in front was a very dangerous figure, and at his time, even demons were greatly afraid of him. Moreover because this fellow was a person without moral standard and handled affairs according to his one feeling, finally, he was personally executed by contemporary Demon Empress i.e. Yaorao, so he had notorious reputation in Demon World.</p><br/><p>The name of this fellow was Aierke, was one of the early three Great Demon God, Shadow Demon God, and was the younger brother of Dark Night Demon God. Moreover this fellow was downright assassin.</p><br/><p>He loved to move at night, and lurking in the shadows, when enemy was in most relaxed state, he would gave them a fatal blow. In his time, countless experts had died in his hand. Moreover he had once tried to assassinate Demon Empress Yaorao, although was not successful, but relying on his that remarkable assassinating means, he successfully injured her, this shows, the how dangerous this fellow was.</p><br/><p>“Eh? You all are human?” Hearing the voice of Yue’er, Aierke slowly sized up Yue’er and others, then said: “Pretty good strength, so young yet already peak God King and True God realm in strength, furthermore you, little girl is strangest, even I actually can’t see through your strength.”</p><br/><p>“I never thought that Aierke who was once known as Shadow Demon God can actually praise people.” Yue’er indifferently said, but her eyes were continuously fixed on Aierke, while maintaining the position of putting the palms together, so she can act at any time. After all this fellow in front of her was too dangerous, and she couldn’t afford to be careless. As Demon God, he dared to try and assassinate Demon Empress, this shows his madness level.</p><br/><p>So once this fellow in front make even a slightest movement, then she would immediately bind him, thoroughly sealing his consciousness.</p><br/><p>“I had no idea that my name would unexpectedly still be preserved, it seems Yaorao, that little lass’s magnanimity however is a little outside my expectation.” Hearing Yue’er, Aierke unhurriedly thought, then asked to Yue’er and other people in front of him, “Tell me, why on earth did you, humans resurrected me with this kind of special method? I don’t think it’s a simple reason like you all resurrected me just to accompany you all to chat like this.”</p><br/><p>“Yes, we want you to go and assassinate a number people of Demon clan.” White Tiger Li Jianrong stepped forward, and said directly coming to the point.</p><br/><p>“Assassinate Demon clan?” Hearing White Tiger, Aierke dazed, then with mocking smile on his face, he said to White Tiger and other in disdain, “Are you all an idiots? Want me to go and assassinate my own clansmen? I think you all are mistaken about me, I myself am a person of Demon clan, and you want me to go and kill my clansmen, this truly is as large as the heavens joke.”</p><br/><p>“Although I, Aierke don’t like a number of people of Demon clan, moreover I end up dying in the hand of my own Demon Empress, but that doesn’t mean I will go and assassinate those innocent clansmen.”</p><br/><p>“Never expected you to be so righteous. Now that this is the case, I have no choice.” Hearing Aierke, Yue’er sneered, then she changed her hand seals. Immediately after that, the body of Aierke shook, and his consciousness gradually disappeared. Now he was thoroughly under the control of Yue’er.</p><br/><p>“Don’t know what’s good for you!” White Tiger also sneered, then said to Jade Maiden Li Xinyun, “Jade Maiden, leave a mirror seed in his fellow’s body, and let’s see a good play together.”</p><br/><p>“Okay!” Jade Maiden nodded her head, then walking to the front of Aierke, her body emitted a white colored radiance which gathered in her right hand, forming a white colored bead. After that Jade Maiden shoot this bead into the body of Aierke.</p><br/><p>“Well, it’s done.” Seeing her surveillance seed had already entered into the body of Aierke, Jade Maiden said to White Tiger.</p><br/><p>“In that case, Yue’er, begin the operation. Use this pawn to thoroughly dye the camp of Demon clan red tonight.” White Tiger nodded his head, then said to Yue’er.</p><br/><p>Hearing White Tiger, Yue’er directly sat cross-legged, then began controlling Aierke. A black colored demonic light appeared around the body of Aierke, this his body slowly disappeared in the night.</p><br/><p>And at the same time, Jade Maiden also activated her blood lineage power, then linking up with the seed within the body of Aierke, a huge white colored light mirror appeared in front of them, and inside this mirror appeared the scene of Aierke and his surroundings.</p><br/><p>Aierke rushed towards the campsite of Demon clan at full speed, with dark colored demonic light emitting from his body. This demonic light slowly absorbed the dark element of surroundings, making him completely blend with the surrounding dark night.</p><br/><p>More than 10 minutes later, Aierke arrived in front of the campsite of demon soldiers. Demon clan had used earth magic to form a large-scale mountain stronghold kind of village with earthen city wall was all around this village, but these city wall didn’t have any guards at all. That was became there was a barrier above the city wall. This barrier encircled the entire campsite of Demon clan, but this barrier didn’t have any defensive ability, rather had strong perceiving ability.</p><br/><p>This barrier could perceive everything including living and inanimate things that passes or touch this barrier. If anything was discovered, then it would immediately locate them, giving them nowhere to run.</p><br/><p>But this barrier had no effect on this King of Assassin.</p><br/><p>Aierke concealed within the night, walked to the front of city gate, then his body slowly shrunk, and finally disappeared.</p><br/><p>“Eh? How did this fellow disappeared?” Seeing Aierke disappeared, Little Yu curiously asked.</p><br/><p>“He has not disappeared in real, rather he has entered inside the shadow.” Yue’er slowly introduced, “This fellow can enter into any shadow and move. This is his very rare ability I am using to sneak into the campsite of Demon clan from the crack between the barrier and city wall.”</p><br/><p>Along with the voice of Yue’er, the body of Aierke slowly became visible within the campsite of Demon clan.</p><br/>\n</div>"}