{"title": "Chapter 371: Hopeless situation", "id": 371, "volume": 4, "url": "http://boxnovel.org/in-different-world-with-naruto-system-chapter-371-hopeless-situation", "volume_title": "Volume 4", "body": "<h1>Chapter 371: Hopeless situation</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Hopeless situation</p><br/><p>“Kamui!” The left eye of Ren Tianyou who was standing on the head of Kyuubi focused firmly on the chest of that Yaorao’s Demonic Buddha. Then along with eye power bubbling out from his left eye, a space black hole slowly appeared, and with the continuous distortion of space, that powerful defensive power of Demonic Buddha with the power of four Universe Boundary Divine Artifact instantly fell apart under kamui, creating a huge gap, from where the figure of Yaorao became visible.</p><br/><p>And at the same time, the bijudama of Kyuubi also reached in front of Yaorao, aiming at Yaorao inside the gap.</p><br/><p>“Demonic Heaven Wrath!” Seeing already close at hand bijudama, Yaorao who was standing inside Demonic Buddha wasn’t panic-stricken, rather place her palms together, and emitted majestic Purple Yuan Power. Then suddenly a purple colored halo appeared on the surface of Demonic Buddha’s body, and with lights wandering about, a sound as if Buddha singing slowly reverberated throughout the world. But this Buddha singing sound didn’t made people feel peaceful, rather it made people filled with desire to massacre.</p><br/><p>Now the atmosphere around seemed to condense slowly, and the time also seemed to stop. And the bijudama of Kyuubi also seemed to stop advancing, stopping in the mid-air.</p><br/><p>And at this moment, dazzling radiance burst forth from the body of Demonic Buddha, and a loud explosion sound resounded throughout the entire horizon. The might of this explosion was more than twice the might of the explosion caused by the collision of Ren Tianyou and Yaorao’s moves of before.</p><br/><p>The nearest Ren Tianyou and Kyuubi were instantly engulfed by the impact of explosion, and without any resistance ability, the huge body of Kyuubi was directly sent flying. And under the powerful impact of explosion, the Susanoo around the body of Kyuubi issued a ‘zhi zhi’ cracking sound, and under this circumstance beyond the imagination of everyone, the huge armor of Susanoo unexpectedly stripped slowly. Even though Ren Tianyou who was standing on the head of Kyuubi unceasingly gathered chakra, and emitted eye power until his eyes were bloodshot, but he was unable to stop continuous coming off of Susanoo.</p><br/><p>Even eight tailed-beasts and Thousand Eyes Evil Beast that were several hundred li away in the seashore were instantly swept away by the explosion impact. Then with each and every one of them issuing utter sad calls, their huge bodies were directly sent flying by this shockwave and fell into the distant deep sea, splashing a huge ocean spray.</p><br/><p>When the explosion stopped, Kyuubi fell down into the gully not far away. Because of the Susanoo of Ren Tianyou, Kyuubi didn’t receive any injures, but Ren Tianyou on the head of Kyuubi was not so lucky.</p><br/><p>Because he endured the 90% of shockwave in place of Kyuubi, not only was Susanoo broken, his body also received great injury. Now he was half-kneeling on the head of Kyuubi, and coughing few times, he spat out mouthful of blood. At that moment, all the chakra within his body had instantly dried up, and although the chakra of Kyuubi was unceasingly replenishing his chakra, and all the injuries of his body were also unceasingly healed by the powerful life-force he had obtained after he refined Forever Green, but the eye power of his Rinnegan he had used however was not easy to replenish.</p><br/><p>“Cough cough…bas…bastard. I have never thought that her strength actually was fierce to this extent, don’t tell me that I really can only stop at this point?” Ren Tianyou who was half kneeling on the head of Kyuubi, said stutteringly while trembling.</p><br/><p>Now distant Yaorao’s that Demonic Buddha had become even more gigantic, had already reached over 100 meters, just like exceedingly high giant. Even Kyuubi’s that huge body was just like that of ants in front of it.</p><br/><p>And on the sea surface, the other eight tailed-beasts also emerged from the deep sea, although they were also in the midst of the explosion, still they were in the periphery of explosion, so they didn’t receive any heavy injury, merely received some minor injuries, that’s all.</p><br/><p>All of them simultaneously jumped out of the ocean, then came to the side of Ren Tianyou and Kyuubi. After that Ichibi Shukaku anxiously asked to Ren Tianyou who was covered with injuries, “Little You, are you alright? Is there any big hindrance?”</p><br/><p>“I’m fine, thank you Shukaku.” Ren Tianyou waved his hand, and totteringly stood on the head of Kyuubi. Then looking at all tailed-beasts beside him, he said while sighing, “Shukaku, Kurama, all of you leave, leave this battlefield. The farther you all go, the better.”</p><br/><p>“Leave, Little You, what do you mean?” Hearing Ren Tianyou, Shukaku instantly understood the meaning of Ren Tianyou, then not only it grumpily roared, it also got angry.</p><br/><p>“Boy, do you think we tail-beasts are all cowards?” Kyuubi also couldn’t help but coldly said to Ren Tianyou above its head.</p><br/><p>“I don’t mean that.” Ren Tianyou sighed, and slowly explained, “Truly speaking about it, this matter is only happening because of my personal reason. Because it all depends on Universe Boundary Divine Artifacts for whether I can achieve my aim of returning to my original world, but you all don’t need to go to die together with me.”</p><br/><p>“Since the time I summoned you all, you all helped me greatly, honestly speaking, perhaps I would have already died without your help, and especially Shukaku, you are the first one I summoned, and also the one who spared no effort to help me the longest.” Ren Tainyou looked at nine tailed-beast with reluctant to part with sentiment, “So even though I awakened my Rinnegan, and possessed the power to completely bind you all, I also didn’t go and resurrect Jubi, because this was my promise with Shukaku, and also my commitment to you all.”</p><br/><p>“Boy, we as a tailed beasts were continuously used by others in Ninja World only as ultimate weapon, but we were always hoping for someone who will treat us as a combat partner not a weapon, but how many people are truly capable of doing so?” Hearing Ren Tianyou, Shukaku sighed and said.</p><br/><p>………………</p><br/><p>Other tailed beasts also couldn’t help but said similar remarks.</p><br/><p>“Boy, who says you have already lost, with us tailed-beasts helping you, even if you want to lose, that would be very difficult.” Kyuubi said to Ren Tianyou on his head. “You have already awakened Rinnegan, so you have only one final step left to awaken tomoe, and achieve nine Rinne Sharingan (T.L: lit. translation was tomoe Rinnegan) exactly the same as Old man Six Path. Moreover the power contain in your body have already surpass everyone of Ninja World. Even Uchiha Madara, that bastard didn’t have this strong power before he became Six Path. Now you only need a key to unlock the hidden treasure contain within your body to obtain new power.”</p><br/><p>“Hehe, you all are speaking so simply, but first, no need to mention about I basically don’t know what this key is, moreover in this current circumstance, I am powerless to go and look for this so-called key.” Hearing Kyuubi, Ren Tianyou made a wry smile and said, now in this kind of circumstance, he was already powerless to even leave.</p><br/><p>“Who says you don’t.” All nine tailed-beasts simultaneously roared. Then their gaze simultaneously turned towards distant Gedo Statue, and with determination flashing in their eyes, they roared, “That key is all nine of us.”</p><br/>\n</div>"}