{"title": "Chapter 377: Space-Time Teleport", "id": 377, "volume": 4, "url": "http://boxnovel.org/in-different-world-with-naruto-system-chapter-377-space-time-teleport", "volume_title": "Volume 4", "body": "<h1>Chapter 377: Space-Time Teleport</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Space-Time Teleport</p><br/><p>“Barrier Jutsu—- Musekiyojin! (Six Crimson Ray Formation!)” Floating in the mid-air, Ren Tianyou quickly made a series of hand seals, then along with the rapid circulation of that could be rated as unlimited chakra within his body, instantly six huge crimson colored light beams flew out from those six black colored rods stuck around Thousand Eyes Evil Beast, then those light beams rapidly expanded, forming a huge crimson barrier that trapped Thousand Eyes Evil Beast inside it.</p><br/><p>“It’s a spectacular barrier, but do you really believe that you can obstruct my Thousand Eyes Evil Beast with only this?” Seeing that huge barrier, Yaorao who was temporarily trapped within the different space created by Ren Tianyou’s dojutsu laughed, then along with chanting the incantation in a low voice, that Heaven Defying Mirror of Yaorao suddenly emitted a hazy light. And on the surface of this mirror, indistinct phantom of Thousand Eyes Evil Beast appeared.</p><br/><p>“Roar!” Along with the action of Yaorao, Thousand Eyes Evil Beast within the barrier suddenly issued a loud roar and surging sound waves spread in all direction.</p><br/><p>And all those thickly dotted eyes on the body of Thousand Eyes Evil Beast suddenly lit up, then black colored lights flew out from these eyes, and condensed in the mid-air. After these radiances condensed, a huge black colored eyeball suddenly appeared in the sky above Thousand Eyes Evil Beast.</p><br/><p>This black colored eyeball slowly rotated, and finally its gaze locked on to Ren Tianyou who was floating outside the barrier.</p><br/><p>Then with a continuous buzzing sound, countless black colored energy radiance condensed in this eyeball. This boundless energy and the surrounding space produced a huge friction. And a black colored lightning appeared in the surrounding void, and space also issued cracking sound.</p><br/><p>“Evil God Light Whistle!”</p><br/><p>Along with the explosive roar of Thousand Eyes Evil Beast, a giant black colored energy light beam which was over 30 meters in diameter shot out from this black colored eyeball straightly towards the direction of Ren Tianyou. The ground below this shooting forward light beam instantly disappeared, and cracks appeared one after another in the space.</p><br/><p>“Humph, vain effort!” Seeing the attack, Ren Tianyou didn’t dodge nor avoid, he just snorted coldly in disdain.</p><br/><p>Even Shisekiyojin (Four Crimson Ray Formation) set up by four kage level experts could withstand the all-out one bijudama attack of Jubi. And with this Six Crimson Ray Formation trapping Thousand Eyes Evil Beast, if it wants to break this barrier with only its power, then that was only a wishful thinking.</p><br/><p>“Hong” a loud sound of explosion resounded. The instant that huge black colored light beam directly hit the barrier of Six Crimson Ray Formation, a loud sound of explosion reverberated through the entire horizon, and the explosion shockwave also spread within the entire barrier. However even though the barrier of Six Crimson Ray Formation swayed, but it firmly blocked this attack.</p><br/><p>The shock wave of explosion didn’t spread out of the barrier, all of them were contained within this barrier, which resulted in Thousand Eyes Evil Beast to eat his own bitter fruit. It was engulfed by its own attack’s explosion shockwave.</p><br/><p>Seeing the fate of Thousand Eyes Evil Beast, Ren Tianyou no longer take care of it, rather looked towards distant Yaorao. Although his eyes had already achieve the ultimate evolution, but The Other Side could trap people for at most only one minute. Now there was only 10 seconds left before Yaorao got free from that trap.</p><br/><p>“The time is just right.” Looking at Yaorao, Ren Tianyou estimated the time, then he suddenly put his palms together, and rapidly circulated the chakra within his body, as well as right Rinne Sharingan emitted powerful eye power.</p><br/><p>Along with the action of Ren Tianyou, in the void under both Yaorao and himself, suddenly a purple colored formation appeared, which emitted a strange power that spread all around.</p><br/><p>“This is?” Seeing this huge ** formation that had appeared under her, Yaorao suddenly had a bad premonition, because the pattern of this formation and Ren Tianyou’s eyes were exactly the same.</p><br/><p>And just at that time, in the void above both of them, suddenly a huge space black hole appeared, and it emitted a powerful attractive force.</p><br/><p>“Dojutsu Space-Time Teleport!”</p><br/><p>Along with the voice of Ren Tianyou, that Rinne Sharingan’s formation under two people suddenly changed into purple colored light beam and surrounded the body of those two people, then entering into space black hole, they disappeared. After these two people disappeared, that space black hole also disappeared, leaving behind only that tattered beyond recognition continent’s land.</p><br/><p>In the inner part of the endless ocean, boundless tsunami occurred throughout the year, and there were only very few very powerful water magical beast that were capable of surviving here. Usually no one could cross thousands of miles to come here.</p><br/><p>But at this moment, above in the sky of this part of the endless ocean, a huge space black hole suddenly appeared, followed by two light beams shooting out of this black hole, and both of these light beams landed in mid-air above this sea surface.</p><br/><p>And with the disappearance of this black hole, those two light beams also dissipated instantly, revealing two figures. These figures were none other than Ren Tianyou and Yaorao’s Demonic Buddha.</p><br/><p>Ren Tianyou knew that if both of them continued to fight like that on the continent, then the continent would certainly collapse, and countless people would perish because of them two. So Ren Tianyou used his newly awakened ability of Rinne Sharingan, and forcibly teleported both himself and Yaorao thousands of miles away, and arrivied to this inner part of the endless ocean.</p><br/><p>“Come, this will be our final battleground, here, no one will bother us again.” Looking at distant Yaorao, Ren Tianyou slowly said.</p><br/><p>“It seems you suddenly become strong and very confident of yourself.” Looking at Ren Tianyou, Yaorao sneered and slowly said, “Now that you are so confident, I will use my strongest state to fight with you.”</p><br/><p>“No matter what the outcome is, since we have started this battle, no one can stop it, even if I have to destroy this planet.” Looking at Ren Tianyou, Yaorao loudly said, then her Demonic Buddha slowly changed once again.</p><br/><p>“So am I.” Ren Tianyou also sneered, then with purple lightning sparks glimmering around his body, slowly a huge skeleton appeared which emitted powerful energy as if wanting to form something terrifying.</p><br/><p>Yaorao was about to go all-out. Her that terrifying Purple Yuan Demonic Buddha also changed greatly. As for Ren Tianyou, he evolved his eyes to the strongest evolution Rinne Sharingan, and was using newly evolved Susanoo. The real battle was coming.</p><br/>\n</div>"}