{"title": "Chapter 4 part2", "id": 4, "volume": 1, "url": "http://boxnovel.org/stop-friendly-fire-chapter-4-part2", "volume_title": "Volume 1", "body": "<h1>Chapter 4 part2</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>&lt;Chapter 4. Hunting Hero - 2&gt;</p><br/><p>[You have reinforced your rib bones. You have absorbed all the memories and experiences that you can from the Rural Rat.]</p><br/><p>[Jjiiiii! - Rural Rat Elite Soldier]</p><br/><p>\"...\"</p><br/><p>\"Jjii...\"</p><br/><p>Lee Shin Woo wordlessly checked the message and turned his gaze away. There he saw the face of the dying Rural Rat Queen. It seems that she had a limit to her birthing, and no matter how much she tried, there wouldn't be any more Elite Soldier births.</p><br/><p>\"What great timing.\"</p><br/><p>He couldn't be sure since he didn't have a watch, but he had killed the Elite Soldiers that she had birthed and Reinforced himself with the bones they left behind; he had already done this several dozens of times or more, and it felt like he had stayed here long enough. In the end, he had completely mastered the rat bones!</p><br/><p>It was a task that caused him to recollect his time playing an RPG; he left his character in a suitable hunting ground and used his macros to farm.</p><br/><p>\"Jjik, Jjii...\"</p><br/><p>\"Yeah, you've done well. I hope you're reborn as a rat that Cinderella takes care of.\"</p><br/><p>Lee Shin Woo spoke tenderly and swung his sword, cleanly decapitating the queen. At that moment, Lee Shin Woo heard the sound of a trumpet ringing in his ear and his eyes were filled with messages.</p><br/><p>[Level 1 dungeon, Rural Rat Nest, clear. Magic has increased by 1.]</p><br/><p>[You have gruesomely slaughtered all life within the dungeon. You have gained 1 Slaughterer's token.]</p><br/><p>[You have gained the dungeon clear reward.]</p><br/><p>The queen only left behind a large bone and some Perium, and soon after withered away and disappeared. However, when Lee Shin Woo was picking up the bone and the Perium, he found a wooden box where the queen had disappeared.</p><br/><p>It was a small and frail box that seemed like it would rot away immediately. It was definitely the dungeon clear reward.</p><br/><p>\"Hoo, now let's see.\"</p><br/><p>Lee Shin Woo opened the box. There was a book and a money pouch containing Perium inside. Lastly, there was also a dagger inside, but it didn't transform despite him touching it, so when he looked at it again, it was, fortunately, a weapon made of bone!</p><br/><p>[You have acquired the Lv2 Bleeding Tooth.]</p><br/><p>[Bleeding Tooth]</p><br/><p>[Lv2]</p><br/><p>[Durability: 450/450]</p><br/><p>[Attack Power: 18 - 36]</p><br/><p>[Options: When you attack, there is a fixed chance that it will inflict the 'Diseased' status ailment.]</p><br/><p>\"Strictly speaking, this isn't a bone... Well, whatever. There are teeth on a skeleton too, so it's probably something like that.\"</p><br/><p>Whether teeth were bones or not from a medical perspective, the important thing was that it hadn't transformed and hadn't lowered in level. There are probably authors who insist that the tooth should've changed since it's not technically bone, but he was willing to assassinate them all.</p><br/><p>[You have acquired 1,500 Perium.]</p><br/><p>[You have acquired the Beginner Stealth skill book.]</p><br/><p>\"It was Stealth!?\"</p><br/><p>He was, of course, familiar with and expected that it'd be a skill book. He had been secretly, really excited since he thought it'd be a new skill that would increase his overall fighting ability, but... to think it'd be Stealth, something that he'd trained to death in this dungeon!</p><br/><p>His teeth trembled, and he stored the book. He was already familiar with the skill, so he felt like familiarizing himself with the skill wouldn't do anything and planned to sell it at the secret shop.</p><br/><p>\"When I put it all together, the dungeon reward isn't anything special. It's probably cause it's a level 1 dungeon... Tch.\"</p><br/><p>He wouldn't be able to appease himself without complaining. Lee Shin Woo sighed and checked the items remaining in his hands. They were none other than the Ratman's, as well as the Rat Queen's bones.</p><br/><p>\"Now that it's come to this, you're my only hope... Bone Reinforcement.\"</p><br/><p>[You have sacrificed the Ratman's finger bone to strengthen your own bones. Agility and Magic have increased by 1. Absorbing a portion of the Ratman's experiences and memories.]</p><br/><p>[Ggiiiiiik! Ggihik, Ggiiiiik! (The pain of losing a part of my body is nothing compared to the pain of losing the Queen!) - Ratman]</p><br/><p>You asshole, even your dying will is way too cool! Moreover, he was able to roughly figure out what skill he would gain from this bone by automatically interpreting this guy's lines. </p><br/><p>Lee Shin Woo sported an insufferable expression and checked his hand. Hmm, as expected, there weren't any nails. Teeth are acknowledged as bones, so why aren't nails...?</p><br/><p>\"This is gonna be a skill in name only...\"</p><br/><p>His agility and magic, which became harder to increase after becoming level 2, had increased by 1 each, so he shouldn't feel disappointed, but... still, he couldn't help but be disappointed. </p><div><div></div></div><br/><p>However, he gripped the Rat Queen's bone, hoping that it would give him a better skill, but ended up with a ridiculous result.</p><br/><p>[You have sacrificed the Rural Rat Queen's pelvic bone to reinforce your pelvis. Health has increased by 1, and Magic by 2. Absorbing a portion of the Rural Rat Queen's memories and experiences.]</p><br/><p>[Ggii, Ggiiiiii! (Ah, ah, my adorable children!) - Rural Rat Queen]</p><br/><p>\"...\"</p><br/><p>Why did it have to be the pelvic bone...? No, it's probably not. … It isn't, right? As the feeling of nausea shot up, he wasn't able to control his queasiness, but Lee Shin Woo tried really hard not to think about it anymore.</p><br/><p>Then, a message appeared at an opportune time.</p><br/><p>[The dungeon will soon collapse. Please escape before it's too late.]</p><br/><p>\"So, it's done its job, then it disappears, huh. ...Good.\"</p><br/><p>He briefly took a deep breath and turned around. He could already feel the dungeon starting to vibrate slightly. Lee Shin Woo wanted to check the Slaughterer's token too, but it seemed like he'd have to do that once he got out of the dungeon.</p><br/><p>Lee Shin Woo took another deep breath, used his Sprint, and started running. Small fragments of rock were falling from behind him, as well as emitting ominous sounds.</p><br/><p>[Lee Shin Woo]</p><br/><p>[Skeleton Avenger Blessed by God]</p><br/><p>[Lv - 2]</p><br/><p>[Strength - 73 Agility - 78 Health - 82 Magic - 47]</p><br/><p>[Passive skills - Invisible Heart Lv3, Acting Lv2, Beginner Avenger Lv1, Low Rank Bursting Thunder Lv1, Beginner Archery Lv2, Beginner Magic Affinity Lv2, Beginner Stealth Lv7]</p><br/><p>[Active skills - Bone Reinforcement Lv3, Beginner Sprint Lv7, Beginner Shriek of the Dead Lv3]</p><br/><p>\"Nice.\"</p><br/><p>The first thing he did once he got out of the dungeon was check his status, and those stats made him incredibly pleased. Just before entering the dungeon, his stats hadn't even reached 200; although his Invisible Heart had activated once, his stats had risen to a sum of 280.</p><br/><p>He didn't know how much his stats needed to be to get to level 3, but he was sure he'd be able to reach it soon.</p><br/><p>'Moreover, my low health has completely overtaken my strength and agility.'</p><br/><p>The Rat Queen, which had appeared as the dungeon boss, had played a huge role in that. Because it had birthed several hundreds of Elite Soldiers, he was able to raise his stats a lot, even though they were all level 1. He was also able to raise his Stealth to level 7.</p><br/><p>'Now my bones shouldn't break, even if they're hit fairly hard.'</p><br/><p>His increase in health through his level up had certainly thickened his bones, as well as made them sturdier; when he tapped his bones, Lee Shin Woo laughed satisfyingly. Then, right on time, the dungeon he had escaped from completely collapsed and a message appeared.</p><br/><p>[A quest has occurred!]</p><br/><p>[The callousness and the cruelty you showed in the dungeon has awakened the karma of a slaughterer. However, you are still too weak, and your enemies were even weaker; ultimately, you did not receive the whole karma, but just a token of it. If you are truly confident that you can bear the weight of the karma, then gather 10 Slaughterer's tokens, and complete the karma. You should already be well aware of the method.]</p><br/><p>[Quest reward - 1 permit to the god's secret shop, and 1 exclusive equipment.]</p><br/><p>\"Now that I think about it...\"</p><br/><p>He thought it would be a quest like 'You've gone through a dungeon, so go deeper into the Empire now and annihilate the undead!', but instead, he got a quest that completely broke his expectations.</p><br/><p>It reminded him of an item he had forgotten about and pointed him in a direction where he could grow, so it was as if God was personally telling him 'you're still too weak to get a proper mission, so get as strong as possible' through a quest.</p><br/><p>'How could it be 10? I don't have to go through 10 dungeons, do I?'</p><br/><p>There's no way he'd have to go through that many. Still, it would definitely be a long journey. Lee Shin Woo wondered whether or not he'd be able to gain a new quest while progressing through this one and became a bit uneasy, but he had no choice but to get a move on for now.</p><br/><p>[Slaughterer's Token]</p><br/><p>[A fragment of a Slaughterer's karma. Once you gather 10 tokens, the karma will become whole. It only has meaning when you gather them with your own strength. Since you have gained your first fragment, it becomes easier for you to gain the same token of karma in similar situations.]</p><br/><p>'So, the tokens do have meaning after all. Does it mean that it becomes easier to get the rest since I've already gotten one?'</p><br/><p>Lee Shin Woo was definitely concerned about the hard to understand and complex factors, so he decided to not think about it too hard.</p><div><div></div></div><br/><p>He had even thought about asking his seniors in the chatting channel, but if this was a rare case, it may inversely cause them to pay more attention to him, so he decided not to. Even he thought the Slaughterer's karma wasn't normal.</p><br/><p>'Then, shall we get going?'</p><br/><p>Firstly, his goal was to acquire the 10 Slaughterer's tokens before he became level 3. Lee Shin Woo inwardly set his goal and quickened his steps. He tightly gripped the level 3 weapon in his hand, the Bone of Thunder Lasting.</p><br/><p>[Lv2 Treasure Eater]</p><br/><p>[Lv2 Treasure Eater]</p><br/><p>That's right. This treasure drew monsters that he was already familiar with.</p><br/><p>Two, at that!</p><br/><p>[Guooooooooooooooh!]</p><br/><p>[Kuaoooooooooh!]</p><br/><p>\"No wait, all these guys live nearby?\"</p><br/><p>Honestly, these Treasure Eaters (Lee Shin Woo had encountered a Treasure Eater for the first time in the external passageways), had gathered and targeted his senior hero (they were enemies that would be relatively difficult to face for the other heroes), who had entered the empire with the then level 4 version of the Bone of Thunder Lasting.</p><br/><p>His senior hero had probably been injured and exhausted from fighting so many of them, so he had run away into the dungeon and had died, but Lee Shin Woo obviously didn't know the story up to that point.</p><br/><p>There was only one thing important to him right now: because of his senior's efforts, the Treasure Eaters had all gathered in this area. Not to mention, they had lost the level 4 item in the past and were really pissed!</p><br/><p>[Gguaaaaaaaaah!]</p><br/><p>[The Treasure Eater used the Shriek of the Dead, but it was nullified by the Invisible Heart.]</p><br/><p>It must've really wanted his treasure, as one of the Treasure Eaters immediately used its Shriek of the Dead as soon as it saw him.</p><br/><p>The shriek rang out far and wide and resulted in something Lee Shin Woo hadn't expected; a gathering of the undead. And that was good news for him right now.</p><br/><p>[Patrolling... Discovered monsters... Skeleton... engaging...]</p><br/><p>[A newbie...?]</p><br/><p>The newbie enthusiast skeletons gathered one or two at a time. There were skeletons he was familiar with, like the Skeleton Soldiers or the Skeleton Archers, but surprisingly, there was also a huge skeleton with a large bone sword amongst them.</p><br/><p>[Lv2 Skeleton Warrior]</p><br/><p>It was the first skeleton he had seen since coming into the empire that was level 2, the Skeleton Warrior! If he fought it one on one, Lee Shin Woo would always come out on top, but he wasn't sure he could take on a group of them since he wasn't sure about their level of strength yet.</p><br/><p>\"Paul, it's good to see you! Hurry and help me!\"</p><br/><p>[It's also... good to see you...]</p><br/><p>However, he was just glad that that strength was on his side right now! Especially since it was just as brainless as a Skeleton Soldier!</p><br/><p>[Helping... the newbie...!]</p><br/><p>[Requesting... reinforcements. There are a lot... of monsters...!]</p><br/><p>Weak Pauls and strong Pauls came from various places. However, that gradually made it more hectic, and more Treasure Eaters appeared, as they caught a whiff of it. The situation had fallen into utter chaos.</p><br/><p>And Lee Shin Woo froze when he coincidentally identified one of the newly arrived Treasure Eaters.</p><br/><p>[Lv3 Treasure Eater]</p><br/><p>\"That's crazy, a level 3 monster...? And it's a Treasure Eater at that, so it's much stronger than normal enemies!\"</p><br/><p>He was sure. Considering how the level 2 Treasure Eater had been vastly superior in strength to the level 2 Ratman, who had appeared as a dungeon boss, the Treasure Eaters were definitely elite monsters!</p><br/><p>[Kuwoooooooooooh!]</p><br/><p>[The Treasure Eater used the Shriek of the Dead, but it was nullified by the Invisible Heart.]</p><br/><p>However, to think that the first level 3 monster he sees would be a Treasure Eater... It seemed as though Lee Shin Woo had a strong relationship with that monster species.</p><br/><p>If another hero had heard that, they would think of him as a walking lottery ticket. Since the Treasure Eater was truthfully an elite monster, and it was harder to encounter one than taking one down.</p><br/><p>'I might use the Avenger skill for the first time here...'</p><br/><p>Even while Lee Shin Woo wracked his brain for a way to get the most benefit out of this situation, he raised his sword in one hand and bravely yelled out.</p><br/><p>\"We're going with the siege destruction formation; use the siege destruction formation! Move faster, Pauls!\"</p><br/><p>A fierce battle began between the skeletons, led by a swindling skeleton, and the Treasure Eaters. It was a battle that the one in the external passageway couldn't be compared to!</p><div><div></div></div><br/>\n</div>"}