{"title": "Chapter 13 part6", "id": 13, "volume": 1, "url": "http://boxnovel.org/stop-friendly-fire-chapter-13-part6", "volume_title": "Volume 1", "body": "<h1>Chapter 13 part6</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><span>&lt;Chapter 13. Arema Steelworker - 6&gt;</span></p><br/><p><span>He didn't know exactly how far reaching Arema Steelworker's control over the golems went, but Lee Shin Woo and Jin tacitly agreed that they would be careful with their words and actions within the train.</span></p><br/><p><span>In the middle of the odd silence, the train gradually began to slow down. After that, they received a signal that they'd arrived at their destination. They had really traveled from the west end of the Empire to the south end instantaneously.</span></p><br/><p><span>\"Would anyone believe us if we told them?\"</span></p><br/><p><span>\"Probably not...\"</span></p><br/><p><span>If all of the heroes were able to use this subway line, the territory of the Empire might change immediately. The system was that revolutionary.</span></p><br/><p><span>'Is the Undead Emperor unaware of this facility?'</span></p><br/><p><span>It's because he was unaware of it that this facility had remained safe all this time. He could tell, through the examination of the Original Core, that Arema Steelworker's authority in terms of golem manufacturing was extremely high.</span></p><br/><p><span>The Emperor had probably trusted in his absolute loyalty and seemed to have entrusted Arema Steelworker with manufacturing the golems, as well as overseeing all the operations. Back then, he had to have absolute trust in them, as they were under a master-servant relationship.</span></p><br/><p><span>\"We're screwed.\"</span></p><br/><p><span>At that moment, Jin spoke in a slightly trembling voice. The land was teeming with golems beyond the automatically opening door. Considering the fact that they were all level 4 Bronze Golems and were armed with weapons, he could tell that they possessed Attack Type Cores.</span></p><br/><p><span>But Lee Shin Woo had already expected that, so he had activated his general administrator seal.</span></p><br/><p><span>[Confirming general administrator.]</span></p><br/><p><span>[Welcome.]</span></p><br/><p><span>A few of the golems spoke mechanically and greeted them. Lee Shin Woo wondered if he could, so he ordered them to stand in line, but they wouldn't follow such a detailed order. A general administrative authority only made it so that they 'wouldn't attack him', that's all.</span></p><br/><p><span>\"Well, I suppose it can't be helped. Work hard and get through them. Oh, and make sure you choose the right place.\"</span></p><br/><p><span>\"You demon!\"</span></p><br/><p><span>Lee Shin Woo acted as though he would break apart the seal any minute now, and Jin hastily stepped into the subway train door. He'd desperately moved there to force a 1 on 1 confrontation! Lee Shin Woo, without even giving him any time, erased the seal, and at that very moment, the golems turned their attention to them.</span></p><br/><p><span>[Detecting a trespasser. He has infiltrated into a critical facility. Reporting to code name, A.S.]</span></p><br/><p><span>[Communication blocked. Assessing the situation. Proceeding to eliminate the trespasser.]</span></p><br/><p><span>When the golems were blocked by Arema Steelworker, Lee Shin Woo sensed a portion of the flow of mana in the entire area snap. And what did he realize from that? He realized the way in which Arema Steelworker blocked communication with them.</span></p><br/><p><span>'He doesn't block communication with each golem, but blocks communication by region, huh.'</span></p><br/><p><span>In other words, this area was now safe from Arema Steelworker's gaze. The moment he realized that, Lee Shin Woo recreated the general administrator seal and turned the golems away. Jin's eyes blazed with indignation, and he turned around and yelled.</span></p><br/><p><span>\"Are you training me like a dog!?\"</span></p><br/><p><span>\"I have to feed you something tasty before the training starts.\"</span></p><br/><p><span>\"Ugh.\"</span></p><br/><p><span>Jin, seeing the Bone Original Core that Lee Shin Woo had been saving, spoke awfully, as though he'd eaten an entire lemon whole. Lee Shin Woo kindly motioned for him to come over with his hand, and Jin looked as though he was a criminal being offered poison, as he slowly walked over.</span></p><br/><p><span>\"But can you take that out now?\"</span></p><br/><p><span>\"The connection's been completely cut in this region. We can talk comfortably now.\"</span></p><br/><p><span>\"Really? By the way, Lee Shin Woo. How the hell were you able to stand in front of a level 8 golem and lie without even blinking!? He was a level 8 golem!\"</span></p><br/><p><span>That was probably something he'd really wanted to say. He was more shocked than awed by what he had seen. Lee Shin Woo just chuckled and replied.</span></p><br/><p><span>\"Who cares? They lied to me too. They definitely oppose the Emperor, but don't trust anything other than that.\"</span></p><br/><p><span>\"Really!? They sounded like they were going to cry...!\"</span></p><br/><p><span>\"Anyone can make something like that up.\"</span></p><br/><p><span>It seemed as though Jin had taken everything that they'd said as the truth. Lee Shin Woo looked at him pitifully, and then Jin put great effort into turning his head and spoke as if he were justifying himself.</span></p><br/><p><span>\"We aren't enemies, so it didn't seem like there was any reason to lie to each other...\"</span></p><br/><p><span>\"There are things you have to keep from your allies as well. And though we have a common enemy, there's no guarantee that they're not our enemies as well.\"</span></p><br/><p><span>\"You sure spoke bravely to that golem.\"</span></p><br/><p><span>\"Since our growth is a pressing matter. Moreover, I was able to say that to him because he doesn't know how fast our growth is.\"</span></p><br/><p><span>He replied calmly, and continued on.</span></p><br/><p><span>\"In any case, we got everything we wanted; maybe even more.\"</span></p><div><div></div></div><br/><p><span>\"A way to contact them.\"</span></p><br/><p><span>They said they'd only use the train, but as they come and go, the golems would inevitably take an interest in them again. Arema Steelworker knew that as well.</span></p><br/><p><span>Lee Shin Woo's final goal was to constantly use the train, give them a strong impression, gain their trust, and ultimately, forge a deep connection with them. If it's possible, a contract with them as well. Hearing that, Jin was frightened and replied.</span></p><br/><p><span>\"In other words, doesn't that mean that we'll remain visible to them, and they'll be watching us?\"</span></p><br/><p><span>\"Life is like that. Isn't it a worthwhile risk?\"</span></p><br/><p><span>\"You're really bold, aren't you...\"</span></p><br/><p><span>\"If I wasn't, I wouldn't be able to act. Hurry up and come over here.\"</span></p><br/><p><span>\"Damn it. I hate things that hurt.\"</span></p><br/><p><span>Lee Shin Woo had his fill of Jin's admiring gaze and placed the Bone Original Core atop Jin's forehead. And like an oral surgeon about to perform root canal surgery on a patient, he lied gently.</span></p><br/><p><span>\"If it hurts, just say so. Bone Reinforcement!\"</span></p><br/><p><span>\"Ughhhhhhhhhh!\"</span></p><br/><p><span>Of course, there was nothing he could do, even if Jin said that it hurt. All he could do was place a hand on Jin's back, share the pain through their connection, and help him to fully absorb the core. Since he'd already absorbed the core once before, it was quite easily for him.</span></p><br/><p><span>[Strength has increased by 2, and Magic by 3.]</span></p><br/><p><span>\"What a gold mine.\"</span></p><br/><p><span>Though he'd already absorbed the information from the Original Core, there was quite a bit of newfound memories remaining within.</span></p><br/><p><span>[You cockroaches. Why don't you just give up?]</span></p><br/><p><span>[Our duty is one of honor. It's all for the sake of the Emperor.]</span></p><br/><p><span>\"Hoo.\"</span></p><br/><p><span>\"Gahhhhhhhhh.\"</span></p><br/><p><span>Lee Shin Woo shouldered all of the memories that Jin couldn't handle, and the massive quantity of mana knowledge, as well as the method to harmonize the body and mana were poured into Jin.</span></p><br/><p><span>It was ridiculously easier than when he'd absorbed the core, but it seemed as though even this was difficult for Jin as he had gritted his teeth.</span></p><br/><p><span>\"It hurts! Just a little... Just a little slower!\"</span></p><br/><p><span>\"If I slow it down any further, you'll lose all the memories. It'll be tough, but endure it just a little while longer.\"</span></p><br/><p><span>As expected, even if he told him it hurt, there wasn't anything he could do about it. He should've known since he's been to a dentist before! Tears flowed from his eyes at Lee Shin Woo's betrayal as all the information from the core was being shoved into his brain. It had taken less than five minutes, yet it had felt like an eternity to him.</span></p><br/><p><span>\"Ugh, ugh...\"</span></p><br/><p><span>\"You alright?\"</span></p><br/><p><span>\"I'm not ok.\"</span></p><br/><p><span>After he had finished completely absorbing the core, Jin gasped like Lee Shin Woo had, even though nothing came out, and gritted his teeth. Lee Shin Woo asked gently.</span></p><br/><p><span>\"How much did your stats increase?\"</span></p><br/><p><span>\"Strength by 9, agility by 15, health by 7, and magic by 13... Plus, most of my skills increased by 2 or 3 levels each...\"</span></p><br/><p><span>\"It was good that you absorbed it, right?\"</span></p><br/><p><span>\"Yeah. Damn it...\"</span></p><br/><p><span>Even if he considered that Jin's agility increased by a factor of three, it was a ridiculous increase in stats. The Original Core really was a gold mine.</span></p><br/><p><span>Of course, the more he absorbed it, the less its effects would be, but it certainly remained an attractive material nonetheless. Lee Shin Woo inspected the outside, filled to the brim with golems, and spoke excitedly.</span></p><br/><p><span>\"By the time we've gone to all the points on the map, we should both be level 5.\"</span></p><br/><p><span>\"I'm not going to go through Bone Reinforcement for another month.\"</span></p><br/><p><span>\"Shouldn't we shoot for level 6 in a month?\"</span></p><br/><p><span>\"No, you demon!\"</span></p><br/><p><span>How much information could there have been for Jin to still be unable to steady himself and totter around? Lee Shin Woo knew what to do in this situation.</span></p><br/><p><span>\"Now, go out and fight.\"</span></p><br/><p><span>\"You really are a demon!\"</span></p><br/><p><span>\"The information in your head hasn't been fully organized yet, so you should gradually adapt to the knowledge and experiences by actually using them in the field. I've already gone through this before, so just listen to me.\"</span></p><br/><p><span>\"Ugh...\"</span></p><br/><p><span>Finding no alternative, Jin followed Lee Shin Woo's orders to the letter. Whenever the seal stopped radiating light, the golems would emit a mechanical sound, and come rushing over to them from all over! But at the very least, there weren't any golems equipped with long distance weapons!</span></p><div><div></div></div><br/><p><span>[Repelling trespasser.]</span></p><br/><p><span>[Aiding. The space is narrow and we cannot afford to damage the critical facility. Standing by.]</span></p><br/><p><span>\"Steel Body!\"</span></p><br/><p><span>Countless golems swarmed them! Jin, who fought them off, instinctively activated Steel Body. His body was reinforced much faster and much more naturally than before he absorbed the Bone Original Core!</span></p><br/><p><span>\"Heuaap!\"</span></p><br/><p><span>\"Ooh.\"</span></p><br/><p><span>Jin instinctually kicked the front golem and stepped on it; then, he turned his body around, and swept away the golems in the front with his hind legs in a single stroke. Through Steel Body, his hind legs were strengthened such that they were as sharp and heavy as an axe and all the golems were blown back with one kick!</span></p><br/><p><span>\"Good, you're doing well! Now you can take on a majority of the golems here!\"</span></p><br/><p><span>\"Eugeuaaaaa!\"</span></p><br/><p><span>Jin used Lee Shin Woo's cheers as fuel for his anger, and went on a rampage! What's worse is that even as he fought, he realized that Lee Shin Woo was right about the accumulated knowledge, and got even more pissed off!</span></p><br/><p><span>On the other hand, Lee Shin Woo marveled at Jin's fundamental change within such a short period of time, especially when concerning his movements in combat.</span></p><br/><p><span>'Oh, he's doing much better than I'd expected.'</span></p><br/><p><span>Jin wasn't originally this talented, but after establishing a contract with Lee Shin Woo, continuously maintaining a connection with Lee Shin Woo, and being thrust into every kind of situation, he had surpassed his limitations. It was miraculous growth that came about due to their contract!</span></p><br/><p><span>Lee Shin Woo wasn't even aware of that; instead, he just figured that since Jin was more skilled than he'd expected, he wickedly thought that he'd be able to push him even more from now on.</span></p><br/><p><span>\"Hoo, Hooo...\"</span></p><br/><p><span>It'd been 10 minutes since Jin had improved his combat abilities, and eventually, when his Steel Body skill leveled up once more, his front legs had at last touched the ground. There were no longer any enemies left.</span></p><br/><p><span>\"Hey... I took down all of the golems!\"</span></p><br/><p><span>\"Wow, there were at least fifty of them. Nice job.\"</span></p><br/><p><span>\"I really want to kill you right now.\"</span></p><br/><p><span>\"I could die for you at least once. I would have 96 lives left then.\"</span></p><br/><p><span>Lee Shin Woo calmly responded and collected the loot; after that, he applied bone powder on the cracked and cut areas on Jin's body, as if he were rubbing an ointment, and activated Bone Reinforcement. Jin twisted his body as if it had felt itchy.</span></p><br/><p><span>\"A lot of Perium came out, but there're a lot of cores, too. There are 52 Attack Type Cores...\"</span></p><br/><p><span>\"Can you complete one core with just that many?'</span></p><br/><p><span>\"The problem is that we have to be lucky with this.\"</span></p><br/><p><span>He'd already figured out the composition of the Original Core, but combining the cores to create another Original Core was a different issue entirely. The purpose of reinforcing the core wasn't to match the dislocated sections, but to restore the fundamentally lost sections by combining two cores with similar characteristics. Naturally, there was a failure rate as well.</span></p><br/><p><span>\"But it's fine. Since there should be a lot of them still out there.\"</span></p><br/><p><span>\"Some of them should've been taken care of by the other heroes.\"</span></p><br/><p><span>\"That's bad luck. Don't say stuff like that.\"</span></p><br/><p><span>Lee Shin Woo scolded Jin, who'd said something that might bring misfortune, and lead him out of the passageway. He maintained the general administrative seal with one of his hands, and Jin, who was suddenly doubtful of his actions, asked.</span></p><br/><p><span>\"Why do you keep creating the seal and then erasing it?\"</span></p><br/><p><span>\"I'm practicing.\"</span></p><br/><p><span>\"You already succeeded in making it, though.\"</span></p><br/><p><span>Lee Shin Woo chuckled and replied.</span></p><br/><p><span>\"That's not it.\"</span></p><br/><p><span>\"Huh...?\"</span></p><br/><p><span>\"I feel like I might be able to use it somewhere...\"</span></p><br/><p><span>Honestly, there was another reason he wanted to keep in touch with Arema Steelworker and his golems. He wanted them to share their plan with him, but catching their attention just seemed much too passive of an approach.</span></p><br/><p><span>Lee Shin Woo wanted to take a much more active approach. Like he had always done. And in order to do so...</span></p><br/><p><span>\"I want to obtain higher authority than just an ordinary administrator.\"</span></p><br/><p><span>\"...\"</span></p><br/><p><span>Lee Shin Woo's eyes gleamed, and the red goblin fire in his eyes shined wickedly. He was recollecting the seal that Guillotine Steelworker had created in front of the door lock. Jin, who'd finally realized what Lee Shin Woo's true intention was, thought it was fine to just laugh.</span></p><div><div></div></div><br/>\n</div>"}