{"title": "Chapter 22 part2", "id": 22, "volume": 1, "url": "http://boxnovel.org/stop-friendly-fire-chapter-22-part2", "volume_title": "Volume 1", "body": "<h1>Chapter 22 part2</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><span>&lt;Chapter 22. The Beginning of a Corps - 2&gt;</span></p><br/><p><span>'Shin Woo!?'</span></p><br/><p><span>'I have a lot on my mind right now, so don't talk to me.'</span></p><br/><p><span>That arm containing superhuman strength and that super regeneration. It was obvious that if he were to obtain both of those, he would become much stronger.</span></p><br/><p><span>[Can you even... call this living...?]</span></p><br/><p><span>\"Fine then. If you want to die, then...\"</span></p><br/><p><span>[No...!]</span></p><br/><p><span>But because he noticed Shino Rendu was clearly regaining his reasoning, he couldn't thrust his lance.</span></p><br/><p><span>It could aptly be called a whim, but he didn't feel inclined to pierce his lance forward and end Shino's life.</span></p><br/><p><span>[Let me live... Even if I have to live as an undead...]</span></p><br/><p><span>\"Alright. Sure, I'll let you live.\"</span></p><br/><p><span>[Ah, ahh...!]</span></p><br/><p><span>Immediately after he said that, Lee Shin Woo chuckled as he suddenly looked back at the thoughts he'd had the day he rescued Ye Jin Jin.</span></p><br/><p><span>'That it would be more advantageous to do that. How absurd.'</span></p><br/><p><span>A human cannot always calculate the outcomes of a situation and then act. Life isn't a game. He didn't know if he would regret making this decision, but... perhaps this decision would be the greatest decision he's ever made.</span></p><br/><p><span>He didn't know how the future would turn out, so it was an especially attractive choice. It was a choice that followed his heart. As a Joker, he couldn't make any other choice.</span></p><br/><p><span>\"My name's Paul Zero. What's yours?\"</span></p><br/><p><span>[Shino... Rendu...]</span></p><br/><p><span>Although he was undead, Shino Rendu was different from the other Pauls and precisely remembered his name; perhaps this was because he was a high level before he died. Lee Shin Woo nodded his head and spoke.</span></p><br/><p><span>\"Do you hate humans?\"</span></p><br/><p><span>[No way! I was... human...]</span></p><br/><p><span>\"But you're not now.\"</span></p><br/><p><span>[...]</span></p><br/><p><span>He remained silent for a second, and examined his body. At the sight of the rotten flesh on his right arm being regenerated, as well as the splattering black blood, he accepted that he was an undead.</span></p><br/><p><span>[A dead body...]</span></p><br/><p><span>\"How about it? I can kill you if you've changed your mind.\"</span></p><br/><p><span>[I want to live... Let me live...]</span></p><br/><p><span>\"What do you want to do if you live?\"</span></p><br/><p><span>[Revenge...!]</span></p><br/><p><span>He had roughly anticipated that. Lee Shin Woo replied harshly.</span></p><br/><p><span>\"Who do you want revenge on?\"</span></p><br/><p><span>[Metafel...! The undead!]</span></p><br/><p><span>\"Good. That's enough.\"</span></p><br/><p><span>Since it's come to this, he couldn't help but accept it. His memories of being human were intact, and was acting in accordance to his goals as a human... Shino Rendu was undergoing the same phenomenon as the other Pauls. He didn't know why that was. Since other heroes who became undead couldn't all go through the same phenomenon.</span></p><br/><p><span>'If that's the case, is it because he met me?'</span></p><br/><p><span>No way. Lee Shin Woo just laughed at his unbelievable assumption. These guys possessed the disposition of becoming like this. Their strong tenacity, as well as their deep-seated grudges would meet, allowing for them to be awakened!</span></p><br/><p><span>\"Follow me. I'll help you get you revenge on him one day.\"</span></p><br/><p><span>[I'm...!]</span></p><br/><p><span>\"Anything else and I'll kill you. This isn't an offer, nor is it a request. It's an order.\"</span></p><br/><p><span>[Keuk...]</span></p><br/><p><span>Lee Shin Woo spoke in an excessively strong voice, and stopped Shino from voicing his opinion. There were two reasons for him wanting to make Shino Rendu his subordinate.</span></p><br/><p><span>Firstly, he couldn't let someone so dangerous free without some restraints on him. Secondly, if he can't have his abilities, then he would only be satisfied by owning the possessor of those abilities.</span></p><br/><p><span>\"Will you follow me?\"</span></p><br/><p><span>[...I'll follow you.]</span></p><div><div></div></div><br/><p><span>Sparks flickered across the Drake Horn Lance. He raised the lance into the air and then thrust it into the ground. Blue sparks spread everywhere, causing Shino Rendu to tremble. Lee Shin Woo spoke quietly.</span></p><br/><p><span>\"Again.\"</span></p><br/><p><span>[I will follow you, sir.]</span></p><br/><p><span>\"Good, Shino. Henceforth, you're my subordinate.\"</span></p><br/><p><span>Once Shino Rendu understood, and obediently accepted Lee Shin Woo as his master, an unbreakable master-servant relationship was formed between them. Once that connection was formed, black light surged from Shino Rendu's  entire body.</span></p><br/><p><span>And Lee Shin Woo knew exactly what that signified. It was the same light that would appear when a Paul was reborn as an elite!</span></p><br/><p><span>[You have succeeded in making a higher leveled individual your subordinate. It was difficult to tame him, but so long as you succeed in taming him, he will become your greatest helper. The Intermediate Command skill has become Lv3. All stats have increased by 1.]</span></p><br/><p><span>[The Lv6 Zombie Elite has transformed into the Lv6 Undead Avenger - Shino Rendu.]</span></p><br/><p><span>Lee Shin Woo thought that was it, but he was wrong. In fact, they were only now moving onto the main topic.</span></p><br/><p><span>[You have successfully inspired a ruined hero who had forgotten his past with a new purpose! Revenge is the most simple and most powerful emotion. That will allow him to remain an undead that is not truly an undead. Proficiency in all corresponding skills has greatly increased.]</span></p><br/><p><span>[The Acting skill has become Lv14. You can induce the desired response from an individual with even the simplest of words.]</span></p><br/><p><span>[The Instigate skill has become Lv2. Magic has increased by 10. The emotions of those who hear your voice can be more easily moved.]</span></p><br/><p><span>[The Rebellion skill has become Lv2. All stats have increased by 3. Whenever you satisfy a condition for the Rebellion skill, stats increase even further. Currently, stats are increased by 12%.]</span></p><br/><p><span>Because he hadn't killed the hero, he wasn't rewarded with the quest reward, but as he had expected, a variety of his skills had grown. Leveling up his Instigate and Rebellion skills was especially huge. Though he didn't really know why those two skills had leveled up!</span></p><br/><p><span>[Hooooo...]</span></p><br/><p><span>Around the time Lee Shin Woo was finished reading all the messages, the light began to wane, and Shino Rendu was revealed, being reborn as a never before seen class, the Undead Avenger.</span></p><br/><p><span>Not only was his once injured head and arm completely healed, but the pitch black magic formed a bleakly glowing armor that covered his entire body, likely in exchange for the equipment that he'd lost from fighting against Metafel's undead army.</span></p><br/><p><span>'Those guys get some cool armor once they turn into elites, but what about me?'</span></p><br/><p><span>'Then why don't you stop being a hero and just start being an undead?'</span></p><br/><p><span>'My bad.'</span></p><br/><p><span>After Lee Shin Woo honestly apologized to Jin, they approached Shino Rendu. Shino Rendu briefly examined his body, but soon nodded his head as if satisfied.</span></p><br/><p><span>[It's not bad... sir.]</span></p><br/><p><span>\"How much do you remember from before you died?\"</span></p><br/><p><span>[Not... much.]</span></p><br/><p><span>Once he became an Undead Avenger, he talked more naturally than before. Lee Shin Woo was becoming more and more envious of this guy. He was an undead in name, but he had flesh on his bones.</span></p><br/><p><span>As expected, the higher leveled they were when they died, the more vibrant they were when they revived. If the starting point was a skeleton, then one would end up as a skeleton. Shit!</span></p><br/><p><span>[But... I do remember that I was originally a hero that was dispatched here. And that I had to kill all of the undead. That's all I remember. Ah, and lastly... that Metafel killed me!]</span></p><br/><p><span>\"Very good. That's plenty.\"</span></p><br/><p><span>[...]</span></p><br/><p><span>It was a comment befitting an Undead Avenger, who acted based on their hatred and vengeance. Pleased, Lee Shin Woo nodded his head as Shino Rendu glanced at him perplexingly.</span></p><br/><p><span>[Who exactly... are you?]</span></p><br/><p><span>He sure was quick to ask. Of course, they had attacked each other when they first met, so he didn't really have the time to ask.</span></p><br/><p><span>[An undead that goes around hunting other undead... Moreover, that intellect, as well as that peculiar ability. Are you also an undead who was once a hero?]</span></p><br/><p><span>It seemed like this guy became a lot smarter than when he was alive!? However, he couldn't be honest with him, so Lee Shin Woo roughly concocted a suitable response.</span></p><br/><p><span>\"I wonder. Perhaps I was a hero some time ago. It's been a long time. Right now, I just cut through any undead I encounter.\"</span></p><br/><p><span>[I see... How peculiar. I wonder why I've just been killing all of the undead I've encountered thus far. Why didn't I have any doubts about that?]</span></p><br/><p><span>\"...What about now?\"</span></p><br/><p><span>[On the contrary... it feels like I can see things more clearly now.]</span></p><div><div></div></div><br/><p><span>Shino Rendu said. Lee Shin Woo could see the pitch black goblin fire beyond Shino's helmet; That was proof that he wasn't human, but undead.</span></p><br/><p><span>[I see this world differently now.]</span></p><br/><p><span>\"That's a relief. ...More importantly, since you fought against Metafel, you should know his special characteristics. Tell me about those in detail. Since we'll face him someday.\"</span></p><br/><p><span>[Alright. I'll tell you everything I know.]</span></p><br/><p><span>Lee Shin Woo listened as Shino Rendu told him everything he knew then and there. The tens of thousands of troops that the Mercenary King Metafel lead, as well as the fearsome strength of the level 7 Metafel...</span></p><br/><p><span>\"Level 7?\"</span></p><br/><p><span>[That's right. He has a few level 7 undead troops as well, but Metafel's strength is on another level...]</span></p><br/><p><span>As expected, Metafel was weaker than the other 12 generals! He had thought so ever since he'd fought against the level 6 Corps Commander, Vitas, but it seemed like he was right. Lee Shin Woo inwardly marked Metafel as the weakest of the 12 generals.</span></p><br/><p><span>[Moreover, Metafel... often eats his subordinates to increase his strength. I feel like he was... a ghoul. He was likely a high rank ghoul at that...]</span></p><br/><p><span>\"Mmm, that'll definitely be troublesome.\"</span></p><br/><p><span>A ghoul normally eats corpses, restoring its vitality and mana. If there was plenty of prey, there was no enemy harder to face than a ghoul; that 'hard to face' ghoul was the leader of a corps! He was just like Popeye who carried spinach around with him everywhere!</span></p><br/><p><span>\"Hmm? If he's a ghoul, how did you manage to keep your body?\"</span></p><br/><p><span>[I was buried in debris during our fight... He ordered his troops to look for me, but because all of those troops were low rank...]</span></p><br/><p><span>\"They're all idiots, so they couldn't find you. You remained hidden until the very end.\"</span></p><br/><p><span>[He was just too strong for me, so I was buried under debris. That's all. I was... lucky.]</span></p><br/><p><span>Lee Shin Woo remembered the superhuman strength that Shino Rendu exhibited. To think that Metafel was even stronger than that; though he considered Metafel the weakest of the 12 generals, he was still one of the 12 generals. He was pissed that he wasn't at that level yet, but he had no choice but to accept it.</span></p><br/><p><span>[So, I became level 6 in the middle of the fight... yet I still died.]</span></p><br/><p><span>\"Tch.\"</span></p><br/><p><span>Shino Rendu had definitely spoken like that. That he attempted to grow too quickly, and would die as a result. He had died after achieving what he'd wanted, so he couldn't even begin to describe the bitterness he must feel. Lee Shin Woo thought that perhaps that bitterness allowed him to maintain his reasoning even after becoming an undead, and felt strange.</span></p><br/><p><span>\"Why did you go that far?\"</span></p><br/><p><span>[I had a junior who was so talented... Everyone liked that junior. Especially Seira...]</span></p><br/><p><span>\"...Huh?\"</span></p><br/><p><span>[Heroes... welcome exceptional heroes. I... just wanted to become like that as well.]</span></p><br/><p><span>\"...\"</span></p><br/><p><span>That comment made Lee Shin Woo feel dirty. After all, that junior he was talking about was him! Moreover, he had wanted to become just like Lee Shin Woo; he should've been careful with what he wished for, as he became an undead just like him.</span></p><br/><p><span>How could something so stupid happen... Lee Shin Woo sighed (even though nothing came out), and clutched his forehead.</span></p><br/><p><span>\"Fine. Forget about the past. You've decided to live on as an undead. You don't have to concern yourself with heroes any longer. You're not a hero, you're an Undead Avenger.\"</span></p><br/><p><span>[...Of course.]</span></p><br/><p><span>He sounded like he was full of regret, but Lee Shin Woo ignored that. Didn't Shino Rendu say it himself? That the heroes would kill the undead no matter what. If they forgot about that, they might be faced with a horrific end.</span></p><br/><p><span>[Then what... should I do now?]</span></p><br/><p><span>Shino Rendu asked. However, that's what Lee Shin Woo wanted to ask himself. He had wanted to pay his final respects to his senior, as well as gain some abilities, but he hadn't even paid his final respects; instead, he had resurrected him...</span></p><br/><p><span>\"I have some other subordinates I've taken in already.\"</span></p><br/><p><span>But the Joker, Lee Shin Woo had already reached the pinnacle of acting. He subconsciously moved his lips after finding the best possible scenario.</span></p><br/><p><span>\"Join up and lead them, and destroy the undead.\"</span></p><br/><p><span>[I understand.]</span></p><br/><p><span>To think he already had other subordinates; he truly was an extraordinary individual! Shino Rendu became certain of this and after clearing his mind, and nodded his head.</span></p><br/><p><span>While Lee Shin Woo caused trouble here and there for no reason, the beginnings of an undead force that destroyed other undead was gradually becoming visible.</span></p><div><div></div></div><br/>\n</div>"}