{"title": "Chapter 33 part1", "id": 33, "volume": 1, "url": "http://boxnovel.org/stop-friendly-fire-chapter-33-part1", "volume_title": "Volume 1", "body": "<h1>Chapter 33 part1</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><span>&lt;Chapter 33. Titan - 1&gt;</span></p><br/><p><span>If there was one thing Lee Shin Woo hadn't taken into account, it was Metafel's, or the one once hailed as the Mercenary King's 'pride'.</span></p><br/><p><span>[Kik, so there wasn't someone behind me... No, they may still be there, but that guy's the leader! K-kiiik! How funny! Kuheeeeehk!]</span></p><br/><p><span>Metafel must've thought that he was just some unknown spy, but what would he think if he knew that Lee Shin Woo was actually the mastermind behind all of this?</span></p><br/><p><span>Not only had he lost the artifact that the Archmage had given him, but it'd also been used against him to divide his troops. What if these Giants and the undead, who had gradually cut down his troops by half, were on the same side?</span></p><br/><p><span>[Kiiiiiiiik! The Mercenary King, Metafel is gone. Completely gone! Yeah, it's been a long time since my rotten brain has been eaten away, so how could I be the same as before!?]</span></p><br/><p><span>The moment Metafel was able to see the man who had cleverly led him here, used his pride against him so that he wouldn't call for reinforcements, who commanded the undead, humans, Giants, even golems and other races as well, had trapped his forces inside the mountain range, and had cajoled them...</span></p><br/><p><span>[Kukeuk. Kuheuk... Kuaaaaaaaaaaaah!]</span></p><br/><p><span>He charged forward as if he were going to do that from the very beginning. When he thought about his proud 50,000 troops being taken down by that man, he knew he couldn't just sit around like an idiot and do nothing.</span></p><br/><p><span>[You don't need a corps anymore.]</span></p><br/><p><span>[You want me to take the Lightning Shadow General's place? Archmage, I am the Mercenary King. I am strongest when I lead.]</span></p><br/><p><span>[No, you still don't understand, do you? That was all in the past. You're different now.]</span></p><br/><p><span>That was a part of the conversation that they'd had after the Lightning Shadow General's death. </span></p><br/><p><span>At the time, Metafel hadn't understood what the Archmage was telling him, and so, the Archmage gave him a mission. That mission was to invade the Giant's domain.</span></p><br/><p><span>[Kik...]</span></p><br/><p><span>Back then, he thought that by killing all of the Giants and eating all their rotten flesh and blood that he'd be able to level up. However, that didn't actually happen.</span></p><br/><p><span>Numbers were meaningless due to the perilous terrain, and his opponents were stronger than he'd anticipated. His squads would clash with a small handful of troops and would repeatedly be ripped apart over and over again. Now, Metafel understood what the Archmage was trying to tell him.</span></p><br/><p><span>[Weaklings... are unnecessary! Kuaaaaaah!]</span></p><br/><p><span>A single absolute being held no weaknesses. Metafel had a way to become the 'absolute strongest', and all he needed to do was make up his mind. It was too much of a waste to just use his ability to heal his wounds. The ability that came with his 'rebirth' wasn't something as trivial as a healing ability.</span></p><br/><p><span>[G-General...!]</span></p><br/><p><span>[Delicious! As I thought, it's delicious!]</span></p><br/><p><span>He would become stronger and grow through eating, and ultimately, evolve. Metafel shuddered. It felt like that once unbreakable wall was cracking bit by bit and light was shining through. The more he stretched out his hand, the wider he opened his mouth, the more intense that light became.</span></p><br/><p><span>[All of you... come to me! I will... eat all of you!]</span></p><br/><p><span>And thus began Metafel's feast of his troops.</span></p><br/><p><span>\"That crazy bastard is...\"</span></p><br/><p><span>Seeing that, Lee Shin Woo shuddered for a different reason.</span></p><br/><p><span>Metafel's soldiers were dwindling rather quickly. Through the efforts of the Giants and Pauls, around half of Metafel's soldiers had been defeated, and Metafel began to eat the other half.</span></p><br/><p><span>[General, why...!?]</span></p><br/><p><span>[Geureu...! There's no reason for you to live when you couldn't even take down one enemy. Be thankful that you can at least become a source of nutrients for me!]</span></p><br/><p><span>[Guaaaaahk!?]</span></p><br/><p><span>The crazed Metafel began to eat without considering the soldiers around him watching. Although Metafel looked exactly like a human at first, when he opened his mouth and his jaw stretched, his cheeks ripped open, revealing sharp beast-like teeth within.</span></p><br/><p><span>\"That crazy Ghoul bastard!\"</span></p><br/><p><span>\"I-I'm scared. He's getting stronger.\"</span></p><br/><p><span>\"Shin Woo, what are you going to do?\"</span></p><br/><p><span>Lee Shin Woo briefly thought about the unforeseen situation ahead of him. Should we take him down immediately, or should he just proceed with his original strategy? But he really didn't even need to think about it.</span></p><br/><p><span>[Kuhaaaaaaaaaaah!]</span></p><br/><p><span>\"Keuk!?\"</span></p><br/><p><span>The moment Metafel roared, a red aura surrounded the soldiers that were once under his command. Lee Shin Woo thought it was some sort of special buff skill that Metafel could only use by eating a few of his troops, so he felt really uneasy and recalled his forces, but...</span></p><br/><p><span>[Kuaaaaaaah!]</span></p><br/><p><span>[Kik, Kihiiiiiii!]</span></p><div><div></div></div><br/><p><span>\"...What the hell?\"</span></p><br/><p><span>It wasn't actually a buff; it was actually a skill that forced his subordinates to do something... to run towards their commander, Metafel.</span></p><br/><p><span>[I-I don't want to!]</span></p><br/><p><span>[Sir Metafel, please don't!]</span></p><br/><p><span>[It's better if you give your lives to me than to those insects! I'll eat you all!]</span></p><br/><p><span>Lee Shin Woo suddenly realized as he watched Metafel open his mouth wide and continue eating. That was the cheat skill that allowed him to ignore the mana's spatial inference and gather his troops with him at its center! A skill that allowed him to have an emergency food supply nearby at all times!</span></p><br/><p><span>\"So why is he doing that now!?\"</span></p><br/><p><span>[Master, you won't be able to win once he's really started eating! When he's done eating all of those elites, he might...!]</span></p><br/><p><span>\"Yeah. Since he's almost grown as much he could as a level 7.\"</span></p><br/><p><span>Shino Rendu had sent him an urgent report, but Lee Shin Woo was already aware of the situation. Lee Shin Woo didn't know why that crazy bastard began to eat his own soldiers once he caught sight of him, but the number of soldiers wouldn't matter if he became level 8.</span></p><br/><p><span>Even so, even if they attacked, all of his injuries would be healed because he was continuously eating. And despite Kratia's spell, Setoin had survived and almost as if expecting that this would happen, was standing by Metafel's side to protect him!</span></p><br/><p><span>\"Above all, it's impossible to take him down, as the Empire's troops are swarming him from all over. Then, instead... we'll stop him from eating! All forces, attack! They're nothing more than target practice right now!\"</span></p><br/><p><span>Lee Shin Woo's booming voice resounded throughout the mountain range. If they couldn't stop Metafel from eating, then they would remove his food supply. That was the only thing Lee Shin Woo could do at this point.</span></p><br/><p><span>Because of his skill, Metafel's subordinates couldn't do anything but rush towards him. Therefore, he wouldn't have to worry about any casualties and his forces could just take them down with ease!</span></p><br/><p><span>[Guoooooooooooooh!]</span></p><br/><p><span>[Kyahaaaaaaah!]</span></p><br/><p><span>[For the Titan's Pride!]</span></p><br/><p><span>All who heard his call discarded their covert operations and charged out from the canyons, above the hills, and between the boulders.</span></p><br/><p><span>Metafel continued to eat his own troops, and those troops were forced to focus on Metafel. The Paul Corps and the Giants charged at the enemy troops... and it was chaos.</span></p><br/><p><span>\"How did it come to this?\"</span></p><br/><p><span>\"Don't ask me.\"</span></p><br/><p><span>It tasted bitter. Of course, he hadn't expected that it would go his way from start to finish, but who could've known that Metafel would have that trick up his sleeve?</span></p><br/><p><span>Moreover, Metafel was situated in an unfavorable location. By breaking the entire cliff with her arcane magic, Kratia had managed to inflict a significant amount of damage onto the main force, but she had simultaneously turned the landscape into an open snowy plain, which made it difficult for them to further attack him.</span></p><br/><p><span>\"So it's a total war, huh.\"</span></p><br/><p><span>\"You can't call this a total war. ...If you really have to call it something, then call it a dining room...\"</span></p><br/><p><span>\"It's the most intense dining room I've ever seen...\"</span></p><br/><p><span>\"Stop as many of them as you can! We're going too!\"</span></p><br/><p><span>The crazed Metafel didn't discriminate between friend and foe and just continued to eat in order to reach level 8. On the other hand, the Paul Corps attacked the clamoring troops, who were stuck to the general, allowing them to rest in peace. A battle really shouldn't have changed this much in such a short period of time.</span></p><br/><p><span>'However, if we exclude the fact that Metafel is continuously getting stronger, then the situation's not bad.'</span></p><br/><p><span>Lee Shin Woo drew swords with both hands, pointed Jin to the enemy forces, and Jin began to run. The reason Lee Shin Woo had so adamantly decided to use the Giants to break the cliffs and spread poison was because of the absolute numerical disadvantage.</span></p><br/><p><span>However, right now, Metafel himself was cutting down his own troops. Moreover, Metafel's troops couldn't put up a proper fight because of his skill, so if he took advantage of this situation, then he should be able to kill Metafel fairly easily.</span></p><br/><p><span>'That's the key.'</span></p><br/><p><span>\"Whether Metafel reaches level 8 or not.\"</span></p><br/><p><span>Lee Shin Woo muttered while summoning a gigantified Melting Double Bone Axe in the air, exploding it, and spreading the Acid Poison amongst thousands of enemy troops. Hearing that, Jin slightly shook.</span></p><br/><p><span>\"What do we do if he really becomes level 8? Do we do what we did against Feotane Von Seldin...?\"</span></p><br/><p><span>\"No. He won't be that strong. Since that guy seemed really powerful, even for a level 8. ...But he'll definitely be strong. Moreover, if we take into account his innate ability as a ghoul, then taking him on with numbers is a really bad idea.\"</span></p><br/><p><span>To be honest, he didn't even want to imagine a foe like a level 8 Ghoul. If Metafel were to eat one of his troops while fighting, not only would his wounds heal, but he would become stronger as well, so no matter how many level 7 elites he had, Lee Shin Woo couldn't help but feel reluctant.</span></p><br/><p><span>\"Plus, I thought he wouldn't eat the skeletons, but he actually is. I hope he breaks his teeth from chewing on the bones.\"</span></p><div><div></div></div><br/><p><span>\"Shin Woo, get a hold of yourself. If you lose focus, then we'll all die... Tch!\"</span></p><br/><p><span>Jin called for Lee Shin Woo, who was acting like a toddler before the general and suddenly leaped into the air. He had barely avoided the black arrow that flew past his feet; it was shot by none other than Setoin Miletus. At some point, he had gotten in front of them, blocking their way.</span></p><br/><p><span>[It felt like it'd take way too long to take down the Giants or the golems.]</span></p><br/><p><span>Contrary to the Empire's troops, which continuously swarmed Metafel, Setoin was surprisingly able to retain his intellect. Of course, he was likewise clad in a red aura, but his indomitable will to protect Metafel allowed him to resist its effects.</span></p><br/><p><span>He was truly a faithful subject... He was also a true pain in the ass for Lee Shin Woo.</span></p><br/><p><span>[Come. You're not planning on running away again, are you?]</span></p><br/><p><span>\"Of course not. If we can take you down, then it'll definitely weaken him.\"</span></p><br/><p><span>Lee Shin Woo looked at Setoin, who confidently aimed his bow at him, and replied calmly, but he was actually quite frustrated. It was because of Kratia, who was sitting behind him.</span></p><br/><p><span>Immediately after she had used her arcane magic, Kratia had become dead weight. Moreover, his opponent used a bow. It would be quite difficult to take him on while protecting Kratia.</span></p><br/><p><span>\"Because I have things to do, I won't be able to play with you for very long!\"</span></p><br/><p><span>[Keuk!]</span></p><br/><p><span>If that's the case, then he had no choice but to kill his opponent as quickly as possible! Lee Shin Woo linked his mind with Jin and they suddenly charged forward at Setoin.</span></p><br/><p><span>Setoin, as though he had expected this, shot out dozens of arrows (it must have been a skill), but a shield suddenly appeared right in front of him that blocked the arrows and blew up, inflicting damage upon him.</span></p><br/><p><span>[Kuhahk!?]</span></p><br/><p><span>\"Know your place!\"</span></p><br/><p><span>To be honest, Lee Shin Woo didn't like Setoin right from the beginning. Setoin always guarded Metafel by his side and carefully planned for him. Lee Shin Woo had stolen the magical device and despite him being just an aide-de-camp, Setoin had the gall to look down on Lee Shin Woo.</span></p><br/><p><span>\"Thanks for coming over here yourself!\"</span></p><br/><p><span>[Keook!]</span></p><br/><p><span>There was a Breath of the Lightning God stuck in Setoin's neck, who had rolled onto the floor and attempted to stand. Lee Shin Woo pushed the blade all the way into the ground, preventing Setoin from moving. Jin forcefully kicked with his front legs and broke his bow to pieces.</span></p><br/><p><span>\"You're really fast...\"</span></p><br/><p><span>Although Setoin was a level 7 like Lee Shin Woo, as well as an elite, their fight had concluded instantaneously. Kratia, who had taken a defensive posture, marveled at Lee Shin Woo, as he had overpowered Setoin in an instant, while she hadn't even been able to react. If he's this powerful, then he should be able to fight Metafel head on...</span></p><br/><p><span>\"Jin!\"</span></p><br/><p><span>\"Keuk!\"</span></p><br/><p><span>Jin pulled back again. A wave of red, dreary mana struck the ground where they once were. There was only one thing that would cause Lee Shin Woo and Jin to evade: Metafel himself.</span></p><br/><p><span>[You're trying to steal Setoin away from me as well? We can't have that.]</span></p><br/><p><span>\"Ha!\"</span></p><br/><p><span>The moment Metafel touched the Breath of the Lightning God, Lee Shin Woo forcefully exploded it.</span></p><br/><p><span>Lee Shin Woo planned to either injure Metafel or finish Setoin off, but... Unfortunately, Metafel stretched out his arms and a hideous tongue grabbed onto the exploding Breath of the Lightning God and ate it.</span></p><br/><p><span>Immediately after, the Breath of the Lightning God exploded with a 'boom', blowing up his arms, but he regenerated the arms immediately with his overwhelming regenerative abilities.</span></p><br/><p><span>\"...What?\"</span></p><br/><p><span>[General!]</span></p><br/><p><span>[Setoin, good work.]</span></p><br/><p><span>[Yes, General...]</span></p><br/><p><span>Lee Shin Woo groaned at Metafel's durability, as he was able to withstand an explosion of a Breath of the Lightning God unscathed. Metafel then grabbed the toppled Setoin and ate him.</span></p><br/><p><span>He swallowed him down and red mana exploded from his body.</span></p><br/><p><span>[I think... I'm nearly there.]</span></p><br/><p><span>Metafel, who'd finished eating Setoin, turned to Lee Shin Woo and grinned.</span></p><br/><p><span>His body was lined with cracks, but then, his body swelled as if it were exploding.</span></p><br/><p><span>[Wait right there. I'll eat you in just a little bit!]</span></p><br/><p><span>Lee Shin Woo couldn't even recognize Metafel anymore, and Metafel cried out as waves of mana were emitted from his body.</span></p><br/><p><span>He had a hunch. Metafel had begun to level up.</span></p><div><div></div></div><br/>\n</div>"}