{"title": "Chapter 34 part2", "id": 34, "volume": 1, "url": "http://boxnovel.org/stop-friendly-fire-chapter-34-part2", "volume_title": "Volume 1", "body": "<h1>Chapter 34 part2</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><span>&lt;Chapter 34. Heaven Defying General - 2&gt;</span></p><br/><p><span>Metafel had left behind other loot aside from the bones, like a red, flame tinged greatsword. The blade was both wide and long and looked quite crude, but its sharpness and its sinister aura could instill fear upon any who looked upon it.</span></p><br/><p><span>[Eater's Flame Greatsword]</span></p><br/><p><span>[Lv6]</span></p><br/><p><span>[Durability: 2,350/2,350]</span></p><br/><p><span>[Attack Power: 1,400 - 1,950]</span></p><br/><p><span>[Element: Fire Lv6]</span></p><br/><p><span>[Options: Strength + 70, Magic + 40]</span></p><br/><p><span>[Special Passive Skill: Fire Eater - Absorbs all fire-related energy.]</span></p><br/><p><span>[Special Active Skill: Countercurrent - Once it reaches the maximum capacity, the fire energy is concentrated in a single point, amplified, and discharged.]</span></p><br/><p><span>'Why did an Eater, who didn't use fire, drop a level 6 fire artifact,' Lee Shin Woo wondered, but once he looked through the artifact's skills, he understood.</span></p><br/><p><span>Fire Eater. Lee Shin Woo recalled Metafel, unable to give up on eating the flames until the very end. His regrets and his will were instilled in this artifact, so it seemed obvious that the item would be so extraordinary.</span></p><br/><p><span>\"I got a weapon I can use when I'm a Titan.\"</span></p><br/><p><span>\"I'd like to see you use it, but we'll have to wait another 60 days before you can.\"</span></p><br/><p><span>\"I'm scared that you'll get to level 8 within those 60 days, Shin Woo. Aren't your stats close to 9,000 now?\"</span></p><br/><p><span>\"Even if I become level 8, it doesn't change the fact that the Titan's a powerful weapon. And if we can remodel it, then...\"</span></p><br/><p><span>\"I'm most scared of the fact that you didn't deny that you would hit level 8 within those 60 days!\"</span></p><br/><p><span>Lee Shin Woo grinned and calmly absorbed the greatsword. His strength and magic went up, and the Eater's Flame Greatsword was recorded in his Bone Armory.</span></p><br/><p><span>He thought his Bone Armory would level up with this, but it seemed like that was still out of his reach. As expected, leveling a skill to level 10 must be special. He pondered that thought, turned around, and declared.</span></p><br/><p><span>\"Let's get out of this mountain range now. There's no reason for us to stay here any longer.\"</span></p><br/><p><span>[Yes sir!]</span></p><br/><p><span>The ice curse had been released. As time passed, the ice would slowly melt, and the mana's spatial distortions would gradually go away as well. ...And if that happened, the Archmage would wonder why Metafel hadn't returned, despite how the situation had changed, and he would probably come here himself.</span></p><br/><p><span>'Even if I </span><span>could</span><span> summon the Titan again, I think he's still out of my league.'</span></p><br/><p><span>He didn't know if he could escape the effects of the Archmage's spatial magic, even with the Titan. Plus, he couldn't picture himself landing a telling blow on him either.</span></p><br/><p><span>Moreover, he wouldn't kill him by just crushing his body. Since the container, which held his life force, was hidden away somewhere in the Empire! When Lee Shin Woo considered the fact that he'd have to look for said container, he realized that beating the Archmage was still a ways away.</span></p><br/><p><span>'If I want to take him down, then I'll have to be really prepared. I'll ask my seniors about it later.'</span></p><br/><p><span>Of course, that relied on them overcoming the coming danger first. He lined up his troops, left Perlin Elta, and finally, left the gradually melting glacial mountains.</span></p><br/><p><span>[We're finally leaving this place...]</span></p><br/><p><span>[Arogan.]</span></p><br/><p><span>The Giants regretted leaving the mountains, which served as their base while they were dead, but... their meaning of existing lay in Lee Shin Woo, not in the past nor in legends. They knew that if they remained here, all they would feel is misfortune and unhappiness.</span></p><br/><p><span>[Don't look so sad. We've become able to step forward into the future! Everyone, raise your weapons! Take out the rocks!]</span></p><br/><p><span>[Hoo... Huaaaaaahp!]</span></p><br/><p><span>They put all their regrets into their fists, broke apart the mountains, and followed behind Lee Shin Woo. As expected, the Giants' strength was truly extraordinary. Their fists shook the ground and the sound of their punches rang through the air. The crumbling snow-covered mountain, the warming snowy fields... Seeing that, Lee Shin Woo felt completely refreshed.</span></p><br/><p><span>\"Wait, why are you breaking it?\"</span></p><br/><p><span>\"They're erasing all traces of us being here. It's best to make it so that the enemy's both unsure of what happened, as well as making it seem worse than what it really is.\"</span></p><br/><p><span>\"The Giants sure are energetic.\"</span></p><br/><p><span>Jin was shocked and Lee Shin Woo explained the situation. In the midst of that, Kratia was the only one to watch the Giants as they broke the mountains and her eyes shined. It seemed like she'd found the next object to study after the Huginn's Eye. The magic had lasted for hundreds of years and had transformed them into Giants, so it made sense that she was so interested in them.</span></p><div><div></div></div><br/><p><span>\"If we pick up the right materials, then I think we can make another Titan Golem by using that unique mana pattern.\"</span></p><br/><p><span>\"Wait, we just went through all that trouble to restore the Titan, so what do you mean 'make another one'... More importantly, how's the Huginn's Eye?\"</span></p><br/><p><span>\"Mm, I don't think I've made much progress yet. I brought it with me, so you want to take a look?\"</span></p><br/><p><span>Kratia brought out the Huginn's Eye from inside her robes. He didn't really feel like it had changed visually. However, she explained that she had a lot of success limiting the item to just golems.</span></p><br/><p><span>\"That's not all. I can limit it to living people too, and I can limit to the undead as well. Honestly, I just got there after studying how to limit its targets.\"</span></p><br/><p><span>\"If it's limited to the undead, then too many people will appear on it.\"</span></p><br/><p><span>\"I feel like I might be able to limit it to high rank undead, level 7 or higher if everything goes well. If that happens, then I suppose I'll have to worry about expanding its search range.\"</span></p><br/><p><span>\"What!?\"</span></p><br/><p><span>To think they'd be able to limit its search function to only high rank level 7 or higher undead. Aside from Lee Shin Woo and his Paul Zero Corps, then that only left the 12 generals or Steves!</span></p><br/><p><span>Lee Shin Woo knew that the Huginn's Eye could differentiate between species, but hadn't known that it could differentiate between levels as well. Lee Shin Woo was shocked, but Kratia explained that if she could reproduce the heroes' ability to estimate stats, as well as an ability to gauge the density of mana, then it wouldn't be too difficult. Wouldn't that be bordering on God's domain!?</span></p><br/><p><span>[The information network is functioning properly as well. If you remodel me, then I should be able to modify the artifact myself.]</span></p><br/><p><span>\"Oooh!\"</span></p><br/><p><span>If that happens, then it would be much more effective than following Arema Steelworker's movements. Moreover, if he were able to divide it and observe based on the situation, then...!</span></p><br/><p><span>\"That's really cool...\"</span></p><br/><p><span>\"I think I can guess what you're imagining right now, Shin Woo...\"</span></p><br/><p><span>\"In any case, we're still researching on that front, and we've made good progress on limiting its range to golems. It's paramount that we figure out how to use the excess energy to increase the search range, but even if it's a level 8 item, I don't think it'll work just yet. So I'll add some more materials and remodel it later.\"</span></p><br/><p><span>In the process of restoring the Titan Golem, it seemed like the responsibility of manufacturing the artifact had fallen onto Kratia, as she responded so confidently. She was so trustworthy!</span></p><br/><p><span>If he could, he would've expressed his happiness to Kratia, but if he did, then Jin, who was preoccupied with Kratia, would get pissed at Lee Shin Woo, so he decided against it.</span></p><br/><p><span>\"Then, I'll leave that to you. Since we'll probably get a chance to use it in the field soon.\"</span></p><br/><p><span>\"You still haven't contacted that senior?\"</span></p><br/><p><span>\"Now that you mention it, I think it's time I checked.\"</span></p><br/><p><span>\"But Shin Woo, are you going to keep bringing them with you?\"</span></p><br/><p><span>Jin asked. He thought that Lee Shin Woo would've sent his troops away once they left the mountain range, but Lee Shin Woo instructed Jin to move slow enough that they could keep up.</span></p><br/><p><span>\"Mm, well...\"</span></p><br/><p><span>\"I'd really like to start running now...\"</span></p><br/><p><span>\"Just wait a little while longer. I'm thinking right now.\"</span></p><br/><p><span>\"What about...?\"</span></p><br/><p><span>As if waiting for him to ask, Lee Shin Woo spoke.</span></p><br/><p><span>\"I've been thinking about this, but I confirmed my suspicions when I accepted a portion of Metafel's troops and the Giants. ...I can't keep these guys hidden anymore.\"</span></p><br/><p><span>\"...Yeah, that's true.\"</span></p><br/><p><span>Metafel's defected troops numbered 3,000, and each and every Giant really stood out. Because they weren't golems, the Giants had to live with their large size, as they had no means of miniaturizing their bodies.</span></p><br/><p><span>\"I made these guys move around in small teams thus far as an investment, but I have too many troops for that to be a viable option anymore. Even so, I can't just keep them holed up in a safe base. If I don't use them, then I'll be losing out on my investment.\"</span></p><br/><p><span>\"So...?\"</span></p><br/><p><span>\"I'm going to keep using a few teams of elites like I've been doing, and gather the rest of them into a huge army.\"</span></p><br/><p><span>That was quite a rational decision... No, it was actually just a decision he was forced into, as his army had grown too much. Lee Shin Woo knew that this would happen eventually and that's why he sought an item like Huginn's Eye.</span></p><br/><p><span>\"What if they're found by a hero?\"</span></p><div><div></div></div><br/><p><span>\"Normally, heroes wouldn't choose to fight against these guys.\"</span></p><br/><p><span>\"Shin Woo, so you realized that you're not a normal hero yourself...\"</span></p><br/><p><span>If it were Lee Shin Woo, he would've agonized over the amount of level 7 elites, but he'd charge in and sew chaos; then, once he'd profited from that, he'd retreat. Lee Shin Woo sweat at Jin's words but continued.</span></p><br/><p><span>\"The problem's the 12 generals. Because of them, I hid my forces for as long as I could, but... when you think about it the other way, you could bait the 12 generals by commanding such a huge army.\"</span></p><br/><p><span>\"Shin Woo, only you could think about it like that.\"</span></p><br/><p><span>\"You already killed two of the 12 generals. The other heroes are just cowards.\"</span></p><br/><p><span>\"Yeah, that's right.\"</span></p><br/><p><span>Lee Shin Woo's goblin fire intensified. This is what he would look like when he was talking about something serious.</span></p><br/><p><span>\"I think that time's coming soon. When Paul Zero meets with the heroes.\"</span></p><br/><p><span>\"You're going to try?\"</span></p><br/><p><span>\"Yeah. Since I'll have to do it eventually anyway.\"</span></p><br/><p><span>He was still bothered by what Lee Man Bok had told him, but even so, he had to at least try. There was nothing good about maintaining this three-way stalemate for Lee Shin Woo.</span></p><br/><p><span>\"But Lee Man Bok concerns had merit, so I'll have to approach them as cordially as possible.\"</span></p><br/><p><span>\"How?\"</span></p><br/><p><span>\"As reinforcements.\"</span></p><br/><p><span>\"!?\"</span></p><br/><p><span>If an undead suddenly showed up in front of the heroes, who enjoyed such peaceful days, and said 'can I hang out with you too?', they would definitely look at him with suspicion.</span></p><br/><p><span>But if they were struggling against one of the 12 generals, and his righteous undead army suddenly appeared to save them, then... There wouldn't be any heroes who would go 'kill them too!' without thinking, would there? Even if there were, wouldn't the heroes focus on killing one of the 12 generals first?</span></p><br/><p><span>\"If we fight on the same battlefield and on the same side, then it'll be difficult for them to attack us. And that's how we'll gradually change their perception of us.\"</span></p><br/><p><span>\"But how are you going to make such a convenient situation for yourself?\"</span></p><br/><p><span>\"Normally, it would be hard, but we have Ethan Cruz, now don't we?\"</span></p><br/><p><span>\"...\"</span></p><br/><p><span>Jin was speechless at Lee Shin Woo's statement. Kratia silently applauded. They couldn't even imagine how many problems he hoped to deal with using Ethan Cruz.</span></p><br/><p><span>\"We already know how Ethan Cruz thinks. Who knows, he might've allied himself with one of the 12 generals already. If that's the case, then all the more reason for him to put the heroes into a difficult situation. But think about it. That's when we appear! And what happens when the Paul Zero Corps comes in to save the day?\"</span></p><br/><p><span>\"Shin Woo... have you ever lost before?\"</span></p><br/><p><span>\"I have. When I was negotiating with God and got stuck in an undead body.\"</span></p><br/><p><span>\"...\"</span></p><br/><p><span>Honestly, that wasn't really a negotiation, but more like stubbornness. Lee Shin Woo thought back to that time, calmly assessed himself, and nodded his head.</span></p><br/><p><span>Back then, he'd tried his best to remain level-headed, but he had died, he came face to face with God, and he would have to fight against the Empire ruled by the dead as a hero; all these factors overlapped, so he hadn't been able to stay calm. Thus, he thought he did pretty well back then, all things considered.</span></p><br/><p><span>\"It's a good thing you're not an enemy, Shin Woo...\"</span></p><br/><p><span>\"I feel bad for Ethan Cruz.\"</span></p><br/><p><span>While Jin and Kratia muttered in the outfield, Lee Shin Woo had made his decision and announced.</span></p><br/><p><span>\"So, let's practice moving as a corps.\"</span></p><br/><p><span>\"How?\"</span></p><br/><p><span>\"We're going to attack a level 3 danger zone. Wouldn't it be cool if we split the army into two and attacked two at the same time?\"</span></p><br/><p><span>\"...\"</span></p><br/><p><span>\"Why don't you just split them into five and attack, making them into a cute star or something?\"</span></p><br/><p><span>\"Oh, that's a good idea.\"</span></p><br/><p><span>\"...\"</span></p><br/><p><span>It was almost time for the 'Paul Zero Corps' to spread their name far and wide throughout the Empire.</span></p><div><div></div></div><br/>\n</div>"}