{"title": "Chapter 44 part2", "id": 44, "volume": 1, "url": "http://boxnovel.org/stop-friendly-fire-chapter-44-part2", "volume_title": "Volume 1", "body": "<h1>Chapter 44 part2</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><span>&lt;Chapter 44. Bayran Infiltration - 2&gt;</span></p><br/><p><span>[Seira Von Retadane: I felt uneasy going alone, but I'd feel a lot better going with someone as talented as you. Let's meet in front of the city.]</span></p><br/><p><span>[Lee Shin Woo: Oh, uh... that's...]</span></p><br/><p><span>[Seira Von Retadane: Then let's do that. I'll send you a private chat request when I get close.]</span></p><br/><p><span>[Ms. Seira Von Retadane has left the chat.]</span></p><br/><p><span>Retadane had one-sidedly left the chat without giving Lee Shin Woo the chance to retort. He was dumbfounded by the unexpected turn of events and remained quiet for a moment. Then, Lloyd interjected.</span></p><br/><p><span>[Lloyd H.K.: She definitely likes him.]</span></p><br/><p><span>[Erian Ruparte: Doesn't she just like him as a strong hero...? Though I felt that exchange just now was a bit strange as well. Did she just acknowledge him as her partner? It seems like Retadane, who had always acted alone, is finally forming a party.]</span></p><br/><p><span>[Prince Altania: Uaaaah. That woman's really unpleasant! Hey, Junior! PM me a little later!]</span></p><br/><p><span>[Lee Shin Woo: Senior, please don't shorten it like that.]</span></p><br/><p><span>Seira Von Retadane. He couldn't get a read on her. But it was a fact that accompanying her to Bayran and watching her would be more comfortable for him than sending her off by herself. Especially because Seagald may interfere.</span></p><br/><p><span>'It'll be a lot harder to use Wild Card it seems.'</span></p><br/><p><span>Wild Card was the ability to set up a stage where his victory was absolute. However, it first required that he completely understood the situation and its many variables. Adding in a level 8 hero like her would create more problems for him. But recognizing and controlling those factors was what the Joker karma was all about.</span></p><br/><p><span>'I can't forget about my promise with Pleine either.'</span></p><br/><p><span>Even if he let her foolishly enter Bayran alone, all that awaited her was a dog's death at the hands of Arema Steelworker or Seagald Von Retadane. He was glad that she was being more active in overthrowing the Underground Empire, but no matter how enthusiastic she was, she would still die.</span></p><br/><p><span>[Lee Shin Woo: I feel like she made the decision on a whim, but it feels good to form a party with such a powerful Battle Priest... In any case, for the time being, please don't even think of approaching Bayran.]</span></p><br/><p><span>[Lloyd H.K.: Shin Woo, hit me up with a private chat later. I want to know how far you two went... Guek!]</span></p><br/><p><span>[Erian Ruparte: She may not look it, but Retadane is a delicate woman. She's deeply regretful too. ...Lee Shin Woo, please take care of her. I trust you.]</span></p><br/><p><span>Contrary to the witless Lloyd, Erian implored him to understand her, as she was a woman herself. To Lee Shin Woo, Seira Von Retadane's inner darkness wasn't as simple as she suggested, but he nodded his head for now. However...</span></p><br/><p><span>[Prince Altania: PM. Gogo.]</span></p><br/><p><span>[Ms. Prince Altania has left the chat.]</span></p><br/><p><span>[Lee Shin Woo: ...]</span></p><br/><p><span>[Lloyd H.K.: Seems like Prince likes Lee Shin Woo too.]</span></p><br/><p><span>[Erian Ruparte: Lloyd, please don't say that to Prince. Seriously.]</span></p><br/><p><span>[Lloyd H.K.: Of course I won't. Do I really look that witless? I won't tell her in person.]</span></p><br/><p><span>[Erian Ruparte: Oh, Lord...]</span></p><br/><p><span>Erian sighed. Lee Shin Woo grinned and was getting ready to leave the chatting channel. However, there was something that he remembered.</span></p><br/><p><span>[Lee Shin Woo: What about our rookie? Silene Viesa.]</span></p><br/><p><span>[Lloyd H.K.: Ah... That guy. I haven't seen him lately.]</span></p><br/><p><span>[Lee Shin Woo: ...Hm.]</span></p><br/><p><span>[Erian Ruparte: I'm worried that something might have happened to him. Since we can still request a private chat, he's not dead, but...]</span></p><div><div></div></div><br/><p><span>[Lee Shin Woo: I'll try to contact him later.]</span></p><br/><p><span>He felt uneasy. 'It's too late', he suddenly thought. What could've happened during the two months he'd been gone? In any case, he would eventually learn Silene Viesa's fate so long as he was still here.</span></p><br/><p><span>If he could, he would at least pick up Silene Viesa's bone. He then left the chatting channel. It was fine since the private chat request hadn't disconnected. Lee Shin Woo had gotten a private chat request from both Kratia and Prince simultaneously, but he chose Kratia first.</span></p><br/><p><span>\"It's been a while.\"</span></p><br/><p><span>[Yeah. Good job.]</span></p><br/><p><span>He decided not to ask. She seemed to agree with him, as she went on to the main point.</span></p><br/><p><span>[Bayran. We'll go there too. Our special training's done with, and Prince has gotten a lot better (personality wise).]</span></p><br/><p><span>\"There's a chance that Arema Steelworker, Seagald Von Retadane, and the other 12 Generals will show up. To put it bluntly, it'll be dangerous for you too.\"</span></p><br/><p><span>[We've trained enough. I want to become stronger now too. Like you.]</span></p><br/><p><span>\"...How did you know?\"</span></p><br/><p><span>[Shin Woo, you may seem bold, but you're actually quite thorough. If you weren't at least level 8 by now, then you wouldn't be going there. You've probably gotten some new ability too. I can't wait. I really want to see it.]</span></p><br/><p><span>As expected, her intuition was sharp. Lee Shin Woo smiled bitterly and agreed with her. But he didn't forget to warn her.</span></p><br/><p><span>\"I may not be able to keep you safe. You might die.\"</span></p><br/><p><span>[I'm like you, Shin Woo. I won't go if there's a chance that I could die. If I do die, then it's because I miscalculated. I won't hate you.]</span></p><br/><p><span>\"If you die, then it'll feel pretty awkward for me, but... Well, whatever. If you're that confident, then I'll leave you to it. Ah, Senior Prince too.\"</span></p><br/><p><span>[If need be, make me into a named undead. I like being a human, but being an undead would be kind of interesting too.]</span></p><br/><p><span>\"Don't say that kind of thing, even as a joke.\"</span></p><br/><p><span>Lee Shin Woo exchanged a few more words with her, and after designating the time and place they were going to meet, closed the private chat. He then declined Prince's private chat request since she was with Kratia, and decided to just ignore her for now. After all, harassing her like this would get a better reaction out of her.</span></p><br/><p><span>\"So wait. Three more girls are going to be joining up with us? We've just gotten away from Jin Jin and that spirit...\"</span></p><br/><p><span>\"Is that really that important?\"</span></p><br/><p><span>\"It is.\"</span></p><br/><p><span>Jin kicked the air with her legs, as if she were displeased and fluttered her steel-covered wings. (they were currently flying)</span></p><br/><p><span>She'd lowered her speed so that the Chi Pauls would be able to follow them, but she slowed down even more (the Chi Pauls were Chimeras, so they were capable of morphing their bodies; with it, they could change their stats slightly. Their 'running mode' was fast enough to keep up with Jin, who was flying at a leisurely pace).</span></p><br/><p><span>\"Let's make some time for just the two of us. Feel free to train your skills in the meantime.\"</span></p><br/><p><span>\"...\"</span></p><br/><p><span>Lee Shin Woo was speechless at the loving and honest skeleton horse's response and trained his skills as she suggested. He imparted his mana into the seventeen weapons floating around them and controlled them; at the same time, he trained his Manatization! If he felt it became too easy, then he would study the Light element as well!</span></p><br/><p><span>[The High Rank Light element has become Lv5 and Magic has increased by 20!]</span></p><br/><p><span>He had started training it last, but it was the first to level up. He was astonished that it had gone all the way up to level 5 when he had gotten it just a short while ago. But by absorbing the Garuda's bone and the Shining Bone Sword, his understanding of the light element had deepened. Therefore, it wasn't completely unreasonable that he was making such progress with it.</span></p><br/><p><span>\"You're not going to train those innate elements or what not?\"</span></p><div><div></div></div><br/><p><span>\"Studying an innate element requires that I understand my own existence. In other words, you can't attain them by focusing on a single point. It only becomes meaningful when other people are added into the fray, and their focus points are linked and fused together with your own. So, making a lame attempt by yourself won't get you anywhere. Moreover, it's not something you can train while you're on the move either.\"</span></p><br/><p><span>They weren't innate elements for nothing. The Dark Shadow element, which was only at the beginner level, was a lot harder to use and used much more mana than the high rank light element. Of course, he could gather that much mana in the blink of an eye now!</span></p><br/><p><span>[The Manatization skill has become Lv2, and Health and Magic have increased by 10. A portion of your skin is manatized. Although your physical strength decreases, you have a chance to ignore physical attacks. A portion of your Strength, Health, and Agility are manatized.]</span></p><br/><p><span>Next up was his Manatization. This skill would manatize more and more of his body, depending on its level. As Lee Shin Woo had expected, this skill had changed his other stats into magic, from the tens to the hundreds, once it had leveled up.</span></p><br/><p><span>Just in case, he tested it out. He was able to 'redefine' himself whenever he wanted to redistribute his stats. This was as expected as well. Lee Shin Woo had a really high affinity with this skill. It was a skill that would help him become whatever he wanted... a skill comparable to the Joker's innate skills!</span></p><br/><p><span>\"If I could, I'd coop myself up somewhere and train, but the situation won't allow it.\"</span></p><br/><p><span>\"Shin Woo, I honestly think that you can already do whatever you want right now.\"</span></p><br/><p><span>\"Jin, I'm the type who gets to the max level before fighting the boss.\"</span></p><br/><p><span>\"I have no idea what you're talking about...\"</span></p><br/><p><span>She didn't understand what he was saying, but as she wanted, they were alone together and they could talk freely. Before they left, Lee Shin Woo had inspected himself, which allowed him to level up his skills.</span></p><br/><p><span>[The Manatization skill has become Lv3 and Health and Magic have increased by 10. A portion of your internal body is manatized and you can more effectively handle mana. But at the same time, your muscular strength decreases proportionally. A portion of your Strength, Health, and Magic is manatized.]</span></p><br/><p><span>\"If I can, I'd like to level it up to level 5 before I get there. But is it not possible for a high rank skill like this?\"</span></p><br/><p><span>\"It's amazing that you were even able to level it up to level 3 in such a short period of time.\"</span></p><br/><p><span>Lee Shin Woo touched his halfway transparent hand and inspected his Manatization skill for the last time. After that, he returned his hand to its normal, human state. His stats, which had been converted into mana, were returned to their original values as well.</span></p><br/><p><span>He wasn't entirely sure before he'd started training his skills, but now he was. Once he mastered this skill and leveled up his Disguise skill even further, his bone-related skills would be able to affect everything, not just bone!</span></p><br/><p><span>\"...But Shin Woo, why do you think Seira Von Retadane is going to Bayran all of a sudden? Did she figure out where the Fire Slayer Sword God or the Golden General were going?\"</span></p><br/><p><span>\"That's unlikely. She said she was going there before I even said anything, so she has no ulterior motive for me... Ah!\"</span></p><br/><p><span>They had gotten close to their destination and gradually began their descent. Lee Shin Woo, who'd finished inspecting his skills and had been talking to Jin, realized one possibility and was shocked.</span></p><br/><p><span>\"Retadane took most of the loot from killing the Vulture General... If that's the case, then maybe she has one of the Bayran Inner Maps too.\"</span></p><br/><p><span>\"Then there are four of them. It's safer now, so isn't that better for us?\"</span></p><br/><p><span>\"It is.\"</span></p><br/><p><span>Jin cheered, and Lee Shin Woo agreed with him. Immediately after, his voice became slightly lower.</span></p><br/><p><span>\"If I could tell her that I killed two more of the 12 Generals, that is.\"</span></p><br/><p><span>\"Oh...\"</span></p><br/><p><span>He could already see the three women from afar waiting at their meeting place. It was time to make a choice. Lee Shin Woo briefly thought about it and soon made his decision.</span></p><div><div></div></div><br/>\n</div>"}