{"title": "Chapter 43 part2", "id": 43, "volume": 1, "url": "http://boxnovel.org/stop-friendly-fire-chapter-43-part2", "volume_title": "Volume 1", "body": "<h1>Chapter 43 part2</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><span>&lt;Chapter 43. Return - 2&gt;</span></p><br/><p><span>\"B-But...\"</span></p><br/><p><span>\"But what? You already knew this, Mr. Shin Woo. That all the undead in the Underground Empire have stagnated. Even if they raise their levels, their 'existence' won't change...\"</span></p><br/><p><span>There was no doubt about it, so when she said the unthinkable, he fumbled with his words.</span></p><br/><p><span>\"But don't the undead have a clear sense of identity? Like the Archmage. Compared to most humans, he's much more...\"</span></p><br/><p><span>\"Mr. Shin Woo, an undead's sense of identity or their intellect has no bearing on their true identity. It doesn't matter how rational or knowledgeable they are; having a clear goal doesn't matter either. Because the undead are irrevocably tied to the past, they cannot see the future. And they cannot even act in the present. That is their 'identity', which they cannot escape from.\"</span></p><br/><p><span>Lee Shin Woo was struck by a dull shock. He could understand it mentally. That's exactly what individuality and identity meant. No matter how skilled one was, they couldn't go against their natural instincts.</span></p><br/><p><span>And to the undead, that instinct was 'stagnation'. The undead didn't want to change. They wanted to stay in the same place and repeat things over and over again. Lee Shin Woo could understand. At least, he thought he could understand, but... he really didn't get it.</span></p><br/><p><span>\"How... How can that be? The Undead Emperor is level 9. The Archmage is not only level 8 like me, but understands mana much better than I do. What's worse, he knows spatial magic, so he can get through the barrier whenever he wants...\"</span></p><br/><p><span>\"It's because they've become undead. They must've stayed underground for far too long. They have become unable to go to the surface.\"</span></p><br/><p><span>\"...\"</span></p><br/><p><span>\"They forever remember the day that they were banished, and they hate everything on the surface. They want to tear the Magic Emperor to pieces, but... Despite that, they wish to remain underground. You must accept it, even if it doesn't make sense. It's their natural instinct, just like eating is necessary for humans to survive.\"</span></p><br/><p><span>How pitiful. Lee Shin Woo briefly thought that they did nothing wrong. They researched a way to get out, and made themselves into the undead, yet... As a result, they were unable to escape and were trapped underground. How ironic.</span></p><br/><p><span>\"Come to think of it, God told me that I had to kill the Emperor to stop the 'spread of the undead curse'. She didn't say, 'they might come to the surface, so stop them'.\"</span></p><br/><p><span>\"Yes. For her part, she didn't lie to you about that from the very beginning. It was also something she couldn't hide from you.\"</span></p><br/><p><span>It was so obvious that he'd forgotten at some point. He'd stopped thinking at a crucial moment. No, he'd thought that the fearsome undead weren't affected by logic and could do whatever they wanted.</span></p><br/><p><span>'I can understand why the Magic Emperor wasn't worried. He should've gotten a report from Arema Steelworker on the Undead Emperor's movements, so he would be sure that the Undead Emperor isn't going to invade the surface. That must be why the surface dispatched heroes at first, but then stopped soon after.'</span></p><br/><p><span>He'd finally solved the puzzle. There were still some mysteries he hadn't solved yet, but he could just look into those in the Underground Empire. Like the actual goal of General Seagald's Anti-Skull...</span></p><br/><p><span>'What a pain in the ass. That guy's goal might be different from what I first suspected...'</span></p><br/><p><span>\"Mr. Shin Woo. You're not thinking something strange, are you? Something like, 'I'll send all of the undead to the surface myself.'\"</span></p><br/><p><span>\"Oh, nice idea.\"</span></p><br/><p><span>\"Mr. Shin Woo!?\"</span></p><br/><p><span>\"I'm just joking around.\"</span></p><br/><p><span>Pleine was startled and yelled. Lee Shin Woo grinned and tried to calm her down, but it didn't work. She must have some deep-rooted feelings.</span></p><br/><p><span>\"When God made you into an undead, she granted you a little bit of divinity to erase the undead's 'identity'. It was a desperate attempt on her part, but it worked a lot better than she could have hoped. But to think you'd be able to do the same with other undead...\"</span></p><br/><p><span>\"Ah, as I thought.\"</span></p><br/><p><span>Lee Shin Woo was talented in using the darkness element, and was even able to make the Pauls his subordinates when he was at a low level, making them freer than before. They prioritized his orders, but they had no other restraints.</span></p><br/><p><span>In other words, they weren't stagnant like the other undead in the Empire. They were freed from the past and were capable of moving forward.</span></p><br/><p><span>\"So I thought you might take the Empire's side and lead them to the surface...\"</span></p><br/><p><span>\"Putting the deceased on the proper path, huh... That sounds pretty cool.\"</span></p><br/><p><span>\"You wouldn't be putting them on the proper path, but on the path to ruin!\"</span></p><br/><p><span>It was a joke, of course. To repeat, Lee Shin Woo didn't want to live in a world filled with death. But this plan showed him some actors that he could control on his stage. Since ancient times, there was nothing better than a foreign enemy to unite the people.</span></p><div><div></div></div><br/><p><span>If he controlled the situation properly, then he could lead it in a favorable direction for him. His vague plans, which he'd formed upon coming to the surface and acting as Kay, were being adjusted in his head.</span></p><br/><p><span>\"...Haha. It's become quite interesting.\"</span></p><br/><p><span>\"Haha. Your ominous smile is making me shake all over.\"</span></p><br/><p><span>When he was level 7, he may have had some special abilities, but he was still at a much 'lower level' than Pleine. But by reaching level 8, his existence had fundamentally changed. As a result, he became almost on par with God's representative, Pleine.</span></p><br/><p><span>She still beat him in terms of pure magic and power, but he was ahead of her in terms of his authority. It seemed like Lee Shin Woo was still unaware of this, but Pleine had noticed.</span></p><br/><p><span>'No matter how talented he is, or whether he was bestowed divinity or not, I didn't expect him to max out one of his elements already. It's much more surprising than learning a high rank element! But what is his element? I can't tell with just the energy it's emitting...!'</span></p><br/><p><span>Of course, she didn't say all that. She didn't want Lee Shin Woo to be biased or conceited about his own abilities. He would continue to grow at a rapid pace, and if she said something now and affected that growth, then she wouldn't be able to take it back.</span></p><br/><p><span>\"Alright, I get it. In the end, my job hasn't changed much.\"</span></p><br/><p><span>\"If you're willing, I'd like to hear what the job of yours entails... You won't tell me, will you?\"</span></p><br/><p><span>\"You can just watch and enjoy, Pleine.\"</span></p><br/><p><span>\"Will I really be able to enjoy it...\"</span></p><br/><p><span>\"Jin Jin, come over here.\"</span></p><br/><p><span>\"Y-Yes!\"</span></p><br/><p><span>Was she intimidated by the sight of them talking so intimately? After they'd deepened their relationship, she acted close to him too, but she walked over stiffly, as if she'd forgotten all about that. Seeing that, Lee Shin Woo smiled bitterly and asked.</span></p><br/><p><span>\"Are you still far from level 7?\"</span></p><br/><p><span>\"Ah, no. I'm not close if you look at my combat experience, but I achieved a lot of feats in the Underground Empire, so I gained a lot of stats. And as you know, I used a lot of the money I got from working as Lawrence's representative to buy medicine...\"</span></p><br/><p><span>\"You bought it and...?\"</span></p><br/><p><span>\"I need about 1,000 stats to reach level 7.\"</span></p><br/><p><span>\"So you're still not there yet... But it's a relief. You're farther along than I thought.\"</span></p><br/><p><span>She had grown a lot, considering the fact that she had been at the tail end of level 5 when she came up to the surface. If the other heroes knew about this, then they would've wrung her neck. She had grown faster than he did when he was at her level. However...</span></p><br/><p><span>'Hoo. She's my own creation, so this much is expected.'</span></p><br/><p><span>Lee Shin Woo knew how diligently she'd been working. If she had just taken what he had given her for free, then she wouldn't have grown so much.</span></p><br/><p><span>To achieve a feat, one needed to be proactive, no matter how little it was. If she hadn't tried so hard, then she wouldn't have achieved it. And she probably hadn't been lax on her skill training either.</span></p><br/><p><span>She'd 'ground her bones' [1] to catch up to Lee Shin Woo, if even a little. But Lee Shin Woo was made up of nothing but bones, so it wasn't enough!</span></p><br/><p><span>\"...You've nurtured another hero quite well.\"</span></p><br/><p><span>Pleine, who was listening to their conversation from the side, was astonished. But Lee Shin Woo shook his head, as if displeased.</span></p><br/><p><span>\"In case I had to leave Jin Jin on the surface alone, I wanted to get her to level 7. But that damn Emperor came looking for me and messed up my plans. So going back there isn't such a good idea, and though it's not ideal, I have no choice but to proceed like this...\"</span></p><br/><p><span>\"Why isn't it a good idea?\"</span></p><br/><p><span>\"In a sense, me 'dying' is good for me.\"</span></p><br/><p><span>Lee Shin Woo explained the current situation, as well as what he would do in the future to Ye Jin Jin, who was tilting her head, and the rest of his party.</span></p><br/><p><span>\"The Emperor destroyed the Lawrence mansion, fully prepared to take a hit to his reputation. My fame went up significantly, and the fear and animosity towards the undead curse increased as well. The person at the center of all that was killed, so everyone will direct their anger towards the Emperor.\"</span></p><br/><p><span>\"That's true.\"</span></p><div><div></div></div><br/><p><span>The Emperor said he was prepared for all that. He added that the people had no choice but to rely on the Emperor. And he was right. As long as things continued as they were, that is.</span></p><br/><p><span>\"But what would happen if I came out and said 'Actually, I'm alive.'? Of course, the people would be happy, but that forces me into a fight against the Emperor. Since I 'came back to life', the Emperor will consider me his mortal enemy, and it'll become hard to move around afterwards, so... It'd become really, really tough on me.\"</span></p><br/><p><span>\"But you said that it couldn't go on like this.\"</span></p><br/><p><span>\"Yeah. So I'll set up Kay's replacement. That's you.\"</span></p><br/><p><span>Hearing that, Ye Jin Jin looked extremely confused.</span></p><br/><p><span>\"But I'm already Lawrence's representative...\"</span></p><br/><p><span>\"Lawrence will come forward. Lawrence, angered by his friend's death, will do everything in his power to keep his friend's wishes alive. Together with you, who is both Lawrence's and Kay's representative. If we tell people that you're not just business savvy, but you were trained by Kay, have great power, and can wield flames, then wouldn't that make quite the story?\"</span></p><br/><p><span>\"...It's such a great story that I feel like a story depicting the love triangle between Kay, Lawrence, and Izuna (Ye Jin Jin's false name) will come out.\"</span></p><br/><p><span>\"Exactly. It'll draw people's attention. If that happens, then those who supported me will support you and Lawrence. You see, if they harm you, the successor to Kay's name and beliefs, then the Empire will break down completely.\"</span></p><br/><p><span>Honestly, that crazy Vampire Emperor may damn the risks and try to kill Ye Jin Jin anyway. So, he would need to set up some countermeasures just in case.</span></p><br/><p><span>\"It seems like the perfect plan. However, Mr. Shin Woo... Aren't there actually two huge problems with that plan?\"</span></p><br/><p><span>Ye Jin Jin, who was deeply absorbed by what he was saying (acting in Lee Shin Woo's stead felt romantic to her), pointed out some flaws in his plan, as if she felt really bad for doing so.</span></p><br/><p><span>\"First off, Lawrence is one of your names, Mr. Shin Woo. But you're going back to the Underground Empire, aren't you?\"</span></p><br/><p><span>\"From now on, Bisher Moon will become Lawrence. Not only has Lawrence never officially appeared, but through my influence, Bisher has become able to disguise himself freely, so he can play the part of Lawrence. Moreover, he can more freely connect the Lawrence shop and Moon Shadow together, so there's no better choice.\"</span></p><br/><p><span>\"Now that you mention it... But even you can't fix the second problem, Mr. Shin Woo.\"</span></p><br/><p><span>\"Go ahead.\"</span></p><br/><p><span>\"It's me. Me!\"</span></p><br/><p><span>Lee Shin Woo looked oblivious and Ye Jin Jin ultimately looked at him with a half-crying face and yelled.</span></p><br/><p><span>\"I'm not as strong as you and I can't wield flames! You even told me to get to level 7, but I couldn't even do that. Mm, even though I tried my best. I really did my best...!\"</span></p><br/><p><span>\"That's ok.\"</span></p><br/><p><span>\"That's ok!?\"</span></p><br/><p><span>Lee Shin Woo took out an artifact from his chest, and once he did, it drew everyone's attention. They had no choice but to pay attention to it.</span></p><br/><p><span>[Phoenix's Feather]</span></p><br/><p><span>[Lv9]</span></p><br/><p><span>[Durability: So long as one ember remains, it self-repairs itself]</span></p><br/><p><span>[Defense: 2,500 - 3,500]</span></p><br/><p><span>[Element: Fire Lv8]</span></p><br/><p><span>[Options: All stats increase by 100, Magic increases by an additional 100, you take no fire damage, you take no critical damage, automatic health recovery, and level 8 fire is added to every one of the wielder's attacks]</span></p><br/><p><span>[Special passive skill: Sun God's Breath - By storing enough fire mana, the wielder can concentrate the flames and discharge it whenever they wish.]</span></p><br/><p><span>[Special active skill: Sun God's Blessing - When the wielder dies, the wielder can defy death once through the use of the flames that burn away cause and effect and return to life. The one who revives through this effect receives the Sun God's blessing.]</span></p><br/><p><span>The soft dress boasted greater defensive capabilities than any of the armor within his possession. Plus, it increased one's stats by a crazy amount, and it would even add an element to one's attacks, increasing one's offensive abilities. It was the whole package, excelling in both offense and defense.</span></p><br/><p><span>It was the greatest inheritance left behind by the divine bird, the Garuda... What's worse, it was the first time God's representative, Pleine, had ever seen a level 9 piece of equipment.</span></p><br/><p><span class=\"footnote\" id=\"footnote_1\">[1] T/N: Ground one's bones is a Korean idiom. It means to feel unbearable pain and/or work incredibly hard.</span></p><div><div></div></div><br/>\n</div>"}