{"title": "Chapter 49 part2", "id": 49, "volume": 1, "url": "http://boxnovel.org/stop-friendly-fire-chapter-49-part2", "volume_title": "Volume 1", "body": "<h1>Chapter 49 part2</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><span>&lt;Chapter 49. Arranging the Stage - 2&gt;</span></p><br/><p><span>\"It's tough.\"</span></p><br/><p><span>\"Did you ever think it'd be easy?\"</span></p><br/><p><span>Lee Shin Woo and Kratia returned to the Underground Empire and immediately went to work on improving the Huginn's Eye. Although Kratia had found the documents, which acted as the catalyst, when they actually tried to actually apply that information, they encountered several problems.</span></p><br/><p><span>\"If we fail, the artifact's done for. The difficulty's too high.\"</span></p><br/><p><span>\"Even if this one breaks, there might be another one out there, right?\"</span></p><br/><p><span>\"Do you </span><span>want</span><span> me to break it?\"</span></p><br/><p><span>\"No, my bad.\"</span></p><br/><p><span>The magical engineering theory that Kratia had proposed was much too difficult for Lee Shin Woo to understand.</span></p><br/><p><span>He'd managed to recreate the Steelworker seal and created never before seen artifacts in the past, so it wouldn't be strange if he were to receive the 'Magic Engineer' title. However, that was all brought about by his intuition, as well as his mana sense. He specialized in practical application rather than theory.</span></p><br/><p><span>\"That mana sense is important. If I do something wrong, then you should be able to fix it, Shin Woo.\"</span></p><br/><p><span>\"Yeah, yeah. I already know you need me. Let's finish up. We need to kill those Liches, but finding Seagald takes precedence.\"</span></p><br/><p><span>He'd given the rest of his party jobs to do while he and Kratia were improving the Huginn's Eye. Seira, who had accepted her status as an undead Banshee, was getting used to her Banshee abilities, as well as the darkness element she'd inherited from Lee Shin Woo.</span></p><br/><p><span>Whereas Jin had only one job to do regardless of whether she'd gotten to level 8 or acquired the light element, and that was running. Of course, it wasn't </span><span>just </span><span>running. She would run using every skill and ability she had. She just ran and ran, like a madwoman. She just kept running, even though it seemed like she may not be able to run any faster.</span></p><br/><p><span>At their levels, rather than focusing on hunting a monster or two, it was much more effective to get used to their own abilities.</span></p><br/><p><span>\"Alright. I think it's possible. No, it'll definitely work.\"</span></p><br/><p><span>And thus, three days passed. Kratia's eyes shined on the dawn of the fourth day. She and Lee Shin Woo had formed and discarded over thirty hypotheses, but at the end of that all, she said...</span></p><br/><p><span>\"If we can imitate the target's mana, then we can find them. We can make it like that.\"</span></p><br/><p><span>\"Ah, you got that from the golems' basic abilities.\"</span></p><br/><p><span>\"It was hard to adapt it to the Huginn's Eye. But it'll work now. Let's begin.\"</span></p><br/><p><span>Kratia had mapped out the design but improving it was actually Lee Shin Woo's job. He was able to modify the Huginn's Eye with his Disguise and Wild Card skills, as well as his darkness element. Soon, Kratia stretched her hand towards Lee Shin Woo, but he stopped her.</span></p><br/><p><span>\"Wait a sec. Let's set-up up some insurance first.\"</span></p><br/><p><span>By 'insurance', he meant Dark Shadow. Even if they messed up the adjustment, with Dark Shadow's ability to reverse cause-and-effect, they would be able to return it to its original state.</span></p><br/><p><span>\"That's the time element!\"</span></p><br/><p><span>\"What are you talking about? It's different. It's merely changing a 'damaged state' to an 'undamaged state'.\"</span></p><br/><p><span>\"I can't understand what you're saying. What's an innate element? And what's a fusion element? It goes beyond all logic...!\"</span></p><br/><p><span>Only a small handful of people had ever attained innate elements, so it was only natural that Kratia couldn't comprehend them.</span></p><div><div></div></div><br/><p><span>Lee Shin Woo smiled bitterly and used Dark Shadow to ensure that he had 'saved' the image of the undamaged Huginn's Eye. With this, he reduced any delay in the reversal as much as possible, and he could reverse any mistake as soon as he detected it. This had only become possible because the Dark Shadow element had leveled up to the intermediate level.</span></p><br/><p><span>\"Then, let's start for real. We probably won't have to use our insurance.\"</span></p><br/><p><span>\"I trust you.\"</span></p><br/><p><span>Lee Shin Woo and Kratia grabbed each other's hand. He established a connection with her using the darkness element, causing the image in her head to clearly show in his eyes. The connection was secure. Lee Shin Woo now understood the image and grabbed the Huginn's Eye with his free hand.</span></p><br/><p><span>'...Shall we begin?'</span></p><br/><p><span>It felt like he'd become a surgeon in the operating room, as the sharply refined mana burst forth and Wild Card's influence intensified.</span></p><br/><p><span>He began modifying the artifact. He'd practiced a few times already, so the image relayed from Kratia was incredibly clear, and her thoughts were also indirectly relayed. Thus, it made it easier for him to modify the artifact.</span></p><br/><p><span>'Good. There are no problems.'</span></p><br/><p><span>Everything went so smoothly that he actually felt worried. Moreover, his mana sense had instinctively found the right path, and so he began to infuse his mana into the Huginn's Eye.</span></p><br/><p><span>The route was a bit different from what Kratia had first suggested. Kratia was briefly startled but soon created a new magic formula on the spot. Lee Shin Woo nodded his head and continued to infuse his mana into it. And so, the artifact evolved.</span></p><br/><p><span>\"...\"</span></p><br/><p><span>\"...!\"</span></p><br/><p><span>They couldn't say a thing, but their emotions ran wild at each and every moment. If the mana lost its place, then the artifact would explode. If he responded a second too late, then the level 8 artifact would crumble into nothingness.</span></p><br/><p><span>\"Heut...\"</span></p><br/><p><span>But it would be fine now. He could feel it. This was Lee Shin Woo's intuition talking. He was creating a new artifact that would find whomever he wanted, and pursue every trace of mana that existed within this world.</span></p><br/><p><span>The Archmage had exhausted every means available to him to create this supreme artifact, but with the collaboration of two, young geniuses, the Huginn's Eye was reaching a realm even beyond that. The Archmage would probably have no idea that this item would eventually become the noose around his neck.</span></p><br/><p><span>'An artifact that can categorize mana, can divide the strands into more detail, can affect a large area, and can pick out a specific target... Something that can pick up information from anywhere that's affected by mana, like Odin's raven...!</span></p><br/><p><span>At some point, the current of mana being infused ceased. Lee Shin Woo took a deep breath and carefully placed it on the table. As if waiting for him to place it down, light surged from the artifact, and it began to suck in the atmospheric mana like a vacuum!</span></p><br/><p><span>\"We succeeded...!\"</span></p><br/><p><span>\"Yeah. The artifact's crazily sucking in the surrounding mana, which means…\"</span></p><br/><p><span>Kratia said silently, and Lee Shin Woo likewise lowered his voice. Kratia didn't show her emotions often (though she tended to show them quite often nowadays), but looked quite happy and gripped Lee Shin Woo's hand tightly while still being connected.</span></p><br/><p><span>[The Lv8 Huginn's Eye has acquired suitable karma and is evolving.]</span></p><br/><p><span>[You have acquired the Lv9 Mana Radar.]</span></p><br/><p><span>\"...\"</span></p><br/><p><span>\"...Shin Woo?\"</span></p><br/><p><span>\"No, it's nothing.\"</span></p><br/><p><span>Lee Shin Woo picked up the new level 9 artifact and felt dissatisfied. It had such a cool name before, so why did it change into such an intuitive one!?</span></p><div><div></div></div><br/><p><span>Of course, this was all Lee Shin Woo's fault. As the one that modified the item, Lee Shin Woo's thoughts had caused an extreme change in the artifact, causing it to become a reflection of his subconscious will. Lee Shin Woo didn't know what to think. He stared at the Mana Radar but ultimately grabbed it.</span></p><br/><p><span>And was shocked.</span></p><br/><p><span>\"This is more amazing than my wildest imagination...\"</span></p><br/><p><span>First, it's search range. It had a huge range when it was a level 8 artifact, but now that it'd leveled up its range could cover the entire Underground Empire.</span></p><br/><p><span>That quality was enough to prove that it was a level 9 artifact, but what was even more shocking was its primary function! By categorizing the target and subdividing them, the user could figure out everything there was to know about a target they'd met once or someone who had a deep connection to mana.</span></p><br/><p><span>\"This can find anything. There's nothing it can't find. What's worse, even if it's an artifact...\"</span></p><br/><p><span>\"Yeah. It really is amazing. The result of adding our power to the surface and underground's magic engineering.\"</span></p><br/><p><span>They had, unbeknownst to the Magic or Undead Emperors, combined the surface and underground's techniques to create such a divine artifact. Would they ever become aware of this fact!? Though the two had become easier to kill because of that!</span></p><br/><p><span>[You have created a level 9 artifact with the help of a talented comrade. Though it was originally a level 8 artifact, you fused together the knowledge of several worlds and civilizations in order to develop it one step further. These techniques are so impressive that it is difficult to appraise them.]</span></p><br/><p><span>[You have acquired the title 'God's Hand'. All stats have increased by 50. The chance that you create a high-quality item increases.]</span></p><br/><p><span>He'd been expecting a message like this. Kratia was rewarded as well this time. The two briefly enjoyed the status bonuses. But the most welcoming news was that his recently acquired title would make the rest of his tasks easier!</span></p><br/><p><span>\"Then, Shin Woo. Let's move on to the next thing. A Titan equipped with the Demon Heart. I'm really excited.\"</span></p><br/><p><span>\"There's something I need to do before that. Wait just a little bit.\"</span></p><br/><p><span>\"...Tch.\"</span></p><br/><p><span>Lee Shin Woo entered Seagald's mana into the Mana Radar. If it were anyone else, they probably wouldn't have understood Seagald's Annihilation Flame, even if they experienced it first hand.</span></p><br/><p><span>However, Lee Shin Woo already had three innate elements, and had temporarily stolen the Annihilation Flame with his Dark Flame! Perfectly imitating Seagald's mana pattern wasn't impossible for him!</span></p><br/><p><span>\"...But why is it acting like this?\"</span></p><br/><p><span>\"What's wrong, Shin Woo?\"</span></p><br/><p><span>\"It's just that there's no way he's here.\"</span></p><br/><p><span>Lee Shin Woo couldn't believe his eyes and shook the level 9 Mana Radar around. In Korea, he'd learned to hit things when they didn't work to get them working again, but he suppressed that urge, as he didn't want to damage such a precious artifact.</span></p><br/><p><span>It wasn't a level 9 artifact for nothing; no matter how many times he tried the search, the result was the same. So long as there wasn't a fundamental issue with the artifact itself, there was no way the information would be wrong.</span></p><br/><p><span>\"Do you know where this is?\"</span></p><br/><p><span>\"Just a minute. I'm not familiar with these coordinates. Let me look through your memories... Yeah, I know where it is.\"</span></p><br/><p><span>Soon, Kratia understood why he was reacting like that and sported a peculiar expression. Who else could understand the absurdity of this all besides her?</span></p><br/><p><span>\"This bastard. He really is on the surface...\"</span></p><br/><p><span>\"Now I know why he was never caught...\"</span></p><br/><p><span>That's right. He didn't know how long he'd been there, but the Anti-Skull's leader... Seagald Von Retadane was on the surface.</span></p><div><div></div></div><br/>\n</div>"}