{"title": "Chapter 53 part2", "id": 53, "volume": 1, "url": "http://boxnovel.org/stop-friendly-fire-chapter-53-part2", "volume_title": "Volume 1", "body": "<h1>Chapter 53 part2</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><span>&lt;Chapter 53. The Final Stage - 2&gt;</span></p><br/><p><span>\"Your Majesty, please listen to the people.\"</span></p><br/><p><span>\"Mm.\"</span></p><br/><p><span>The Light General, Sorura Von Lilaine said so coldly that it felt like he'd fall onto the frozen floor. There was even a curtain within this gloomy, dark room, and the secluded Emperor began to murmur to himself.</span></p><br/><p><span>She'd always been cold, but after returning to the surface, she became much more passionate; her voice felt akin to a hot, sharp edge. He knew why. It must be because his loyal subordinate, Arema Steelworker, had died.</span></p><br/><p><span>To think these two had been in a relationship. Moreover, he didn't think Arema would go so far as to sacrifice himself to save her. To be honest, him dying was only beneficial to him, as Arema's body had gone missing, but he wasn't going to tell her that.</span></p><br/><p><span>'I was suspicious that Seagald had stolen Arema's body, forcing him to follow him, but... If that were true, then this woman wouldn't have come back alive. He either died, or he was taken by them.'</span></p><br/><p><span>The Emperor pondered, but Sorura cut him off like a sharp blade.</span></p><br/><p><span>\"This is the limit. We can't hold it off anymore. We have to do something. Your Majesty, you are personally needed... Or you need to send all of the remaining 12 Generals and the remainder of the elite troops.\"</span></p><br/><p><span>\"Mmmm...\"</span></p><br/><p><span>The Emperor groaned quietly. To be honest, the current situation... wasn't good for him. Originally, the Emperor was going to wait for the undead curse to spread to the surface; when his people discovered the existence of the curse and became antsy, he would only then intervene.</span></p><br/><p><span>He never had any intention of dealing with the source of the curse. Once he'd taken care of the curse, he'd then create a barrier. It was inevitable that the undead and their energy would seep out of the barrier once more, so the people would come to rely on him once more.</span></p><br/><p><span>\"The situation's... not good.\"</span></p><br/><p><span>\"No, it's not. I'm sure you're already aware. Since your eyes see everything on the surface.\"</span></p><br/><p><span>\"Lilaine, are you mocking me?\"</span></p><br/><p><span>\"Your Majesty, please leave everything to them.\"</span></p><br/><p><span>A new voice said. It was a tuxedo-wearing man, with both hands together and on standby near the curtain.</span></p><br/><p><span>It was the Spirit Sword General, Kuroin Von Begner. He was the most loyal subject of the Empire and was part of the Four Heavenly Commanders, the Empire's strongest. He cut his opponents down with his sword, which was hidden in shadow. Thus, he was called the Spirit Sword General and had only become stronger by turning into a Vampire.</span></p><br/><p><span>\"I'm referring to the alliance of religious orders, led by the woman who claims to be Kay's disciple. Force those unsightly fools into your service, and let them and the ignorant people fight against the underground's undead. It's a good chance to shut them all up.\"</span></p><br/><p><span>\"...Hoo, Kuroin. That's impossible.\"</span></p><br/><p><span>Unfortunately, Kuroin wasn't very intelligent. Did his overzealous loyalty damage his brain? Though he didn't particularly like Sorura, he agreed with her nonetheless.</span></p><br/><p><span>\"The people are far too discontent. Moreover, they have someone they can rely on. It might work if they and the undead destroyed each other, but if they were to win, then...\"</span></p><br/><p><span>The people would wholeheartedly support the religious orders. No, they were already close to doing so. The 'limit' that Sorura had mentioned was referring to this.</span></p><br/><p><span>If the Emperor waited any longer, and he left saving the Empire to Izuna and the religious orders, then... it was entirely possible for them to take his people and form an entirely new nation.</span></p><br/><p><span>\"This is all because of him (Retadane). If he hadn't caused such a commotion on the surface, then...!\"</span></p><br/><p><span>This must've been his goal! Putting the Emperor into a situation where he was forced to intervene or mobilize all of his forces! That's just how much Seagald had wanted revenge.</span></p><br/><p><span>He felt goosebumps, even though Seagald was a lower level than him. It felt as though there was always a sword beneath his neck. Even now, the Emperor felt uneasy, as he didn't know when Seagald would come for him.</span></p><br/><p><span>\"If I go, then... It would be the perfect spot to assassinate me.\"</span></p><div><div></div></div><br/><p><span>\"Even so, we have no other option. Your Majesty, you just told us yourself that you had to intervene.\"</span></p><br/><p><span>\"Keuuuum.\"</span></p><br/><p><span>The Emperor toiled over his choices. Honestly, he'd rather stay here and hide. With double or even triple the soldiers stationed to protect him!</span></p><br/><p><span>However, that was an unattainable dream. 'If', 'By some chance'. Those two hypotheticals were just wishful thinking.</span></p><br/><p><span>\"Seagald Von Retadane. He's probably still alive.\"</span></p><br/><p><span>\"I, too, would like to kill him right away. He can't hide forever. But we can't catch him from in here. We have to go out to do so. And we have to go out to kill him as well.\"</span></p><br/><p><span>\"...\"</span></p><br/><p><span>Sorura remarked, as if ignoring the Emperor's opinions, yet the Emperor couldn't bring himself to say anything. Not only was it the truth, but she was also the last remaining light magician in the Empire.</span></p><br/><p><span>She was crucial to stopping Seagald. She, too, knew this fact all too well.</span></p><br/><p><span>\"Your Majesty, you don't have to worry about a weakling like him.\"</span></p><br/><p><span>\"...\"</span></p><br/><p><span>Jirold Von Enard anguished once more. He knew his hand had been forced. The Emperor thought about how he could get what he wanted without being coerced. Ultimately, he came to a simple conclusion.</span></p><br/><p><span>\"You go, Kuroin. Kuroin Von Begner.\"</span></p><br/><p><span>It was best to not move exactly as your enemy wished. That policy had always kept the Emperor alive time and time again.</span></p><br/><p><span>\"Your Majesty?\"</span></p><br/><p><span>\"You'll be my stand-in. I can't just leave here. So I'll leave everything to you. Take the rest of the 12 Generals with you, besides the Light General, and all the elite troops as well. You must perform better than Izuna and her forces.\"</span></p><br/><p><span>For a second, the Emperor's loyal clansman, Kuroin Von Begner couldn't believe what he was hearing. But he wasn't hearing things. The Emperor had opened the curtain and stared at him seriously. He was confused, but he quickly got on one knee and bowed to him in spite of this.</span></p><br/><p><span>\"I-I understand. I will break Seagald Von Retadane and Jissehanu, and bring them to you no matter what.\"</span></p><br/><p><span>\"You won't be able to beat Jissehanu. However, he won't likely be on the front lines. Kill Seagald Von Retadane. He's the one keeping the underground afloat, so if you kill him, then Jissehanu will retreat back underground.\"</span></p><br/><p><span>\"...Understood!\"</span></p><br/><p><span>Jirold placed his hand atop Kuroin Von Begner's shoulder. The Emperor's Lightning Bind flowed from his hand into Kuroin's body, further strengthening him. This act served two purposes: helping him, as well as forcing his loyalty and preventing insubordination.</span></p><br/><p><span>\"Sorura Von Lilaine.\"</span></p><br/><p><span>\"Yes, Your Majesty?\"</span></p><br/><p><span>The Light General looked at the Emperor with unconcealed contempt, yet the Emperor shamelessly gave her an order regardless.</span></p><br/><p><span>\"You will replace Kuroin as my protector. If, and I mean if, Seagald comes for me during the chaos of the battle, then the only one who can detect him early enough and respond is a light user.\"</span></p><br/><p><span>\"...Are you forcing me to stay behind?\"</span></p><br/><p><span>\"I am essential to the survival of the Empire. If any harm befalls me, then you won't be safe either.\"</span></p><br/><p><span>Sorura gritted her teeth and shook. The Emperor acknowledged her anger but wasn't going to try to understand it.</span></p><br/><p><span>\"Moreover, there's a high chance that Seagald comes for me. Light General, if you truly want revenge on him, then it's best that you stay by my side.\"</span></p><br/><p><span>\"Do you really think he can sneak in when you have so many magic traps set up...?\"</span></p><br/><p><span>\"He went around the Empire eluding even my sight. Do you really think he can't do something more?\"</span></p><br/><p><span>The sound of her teeth grinding could be heard once more. However, the Emperor trusted that she, as one of his clansmen, as well as one affected by Lightning Bind, wouldn't be able to refuse his command!</span></p><div><div></div></div><br/><p><span>\"...I understand. I will do as you say. You disgust me though, so I'll stay this far away from you.\"</span></p><br/><p><span>\"Light General, it's an honor that the Emperor requires your services, yet you dare to...\"</span></p><br/><p><span>\"Get lost already.\"</span></p><br/><p><span>\"...Ugh!\"</span></p><br/><p><span>In response to her rage, her body radiated light mana; Kuroin wouldn't dare approach her and just shrunk back.</span></p><br/><p><span>Though he'd been strengthened by the Emperor, it didn't matter. It might be different for the Emperor himself, but Kuroin had no way of overcoming the Light General's light. Sorura snorted and said.</span></p><br/><p><span>\"You're my stand-in too. Kill all the undead. Make sure they can never tread upon our soil ever again.\"</span></p><br/><p><span>\"...Hmph, I like the sound of that. Then, Your Majesty, I'll come back after fulfilling your orders.\"</span></p><br/><p><span>\"My loyal friend... if you succeed, then I promise to give you a suitable reward.\"</span></p><br/><p><span>\"It's an honor!\"</span></p><br/><p><span>The Spirit Sword General deeply bowed his head, paid his respects to the Emperor once more, and quietly left. The Emperor merely stared at the recently emptied space, but soon closed his eyes and turned his attention to the shaking Sorura.</span></p><br/><p><span>\"I'll give you a chance to get your revenge. I promise you.\"</span></p><br/><p><span>\"I would've liked it better if that chance... came quicker.\"</span></p><br/><p><span>Sorura said hatefully and seething with rage, and then turned around. The Emperor's gaze was automatically fixed onto her back.</span></p><br/><p><span>Her elegantly curved body, having no signs of age, her captivating, flowing hair, and her scent, all of which remained unchanged even after becoming a Vampire, aroused him. However, he wasn't stupid enough to go after a woman who'd just lost her lover and was filled with malice. Yes, a rose had thorns, but these thorns were filled with poison.</span></p><br/><p><span>\"Where are you going?\"</span></p><br/><p><span>\"I was given an unexpected mission, so I have to go and prepare. ...Surely you can stay here by yourself for a short while?\"</span></p><br/><p><span>\"Of course I can. Return after you've prepared yourself. 2 hours should be enough, right?\"</span></p><br/><p><span>\"Hmph.\"</span></p><br/><p><span>She snorted, as if she could see right through him, and left. He wanted to force her onto her knees with his Lightning Bind oh so badly, but for some reason, it didn't work on her. Perhaps it was due to her element. There were so many facets of her that were displeasing to him.</span></p><br/><p><span>'I should dispose of her once Retadane's been dealt with. I can just nurture another light user.'</span></p><br/><p><span>Sorura, who'd left the Emperor's dark room, dusted her body off as if something dirty had gotten onto her. She then rushed over to her residence. Within her bedroom, which only she could enter, a single small bird awaited her.</span></p><br/><p><span>[How did it go?]</span></p><br/><p><span>No, it was a golem in the shape of a bird. Moreover, a young woman's voice came from the golem!</span></p><br/><p><span>Sorura, as if she'd done this a few times already, walked over to the bird, or Rem, and... smiled elatedly and said.</span></p><br/><p><span>\"The Emperor's doing exactly as you said he would. I'm ready... to open the gate whenever.\"</span></p><br/><p><span>[That's perfect. We'll take care of the rest.]</span></p><br/><p><span>\"I'll leave the rest to you. ...Hero Izuna.\"</span></p><br/><p><span>[Of course.]</span></p><br/><p><span>Her voice, coming from the golem, was a bit delicate, but it was unmistakably the vigorous voice of a young woman.</span></p><br/><p><span>[Since I'm fighting for the one I love as well.]</span></p><div><div></div></div><br/>\n</div>"}