{"title": "Chapter 5 - Closed Dungeon", "id": 5, "volume": 1, "url": "http://boxnovel.org/seoul-station%E2%80%99s-necromancer-chapter-5-closed-dungeon", "volume_title": "Volume 1", "body": "<h1>Chapter 5 - Closed Dungeon</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 5 Closed Dungeon.</strong></p><div class=\"innerContent fr-view\" id=\"chapterContent\"><br/><p><span style=\"\">Chapter 5 – Closed Dungeon</span></p><br/><p><span style=\"\">(<span>TLN: Please disable ad blockers if you can!!)</span></span></p><br/><p><span style=\"\">The monster’s corpses was used to summon the Skeleton Soldier with [Strength 5 Agility 8 Health 5].</span></p><br/><p><span style=\"\">Consumed Magic Point: 1, Required Control : 1</span></p><br/><p><span style=\"\">Woojin had defeated an additional 27 Drabbits, and he had leveled up twice. He was currently at level 3. Every time he leveled up, he received 5 Stat Points and he distributed the 10 Stat Points into Magic and Control.</span></p><br/><p><span style=\"\">Magic : 15 Control :14</span></p><br/><p><span style=\"\">If he summoned 15 Skeleton Soldiers, he’ll only be able to keep 14 of them. Once the Summons exceeds the range of his Control, they would turn into monsters beyond his control.</span></p><br/><p><span style=\"\">“Wake up, my minions.”</span></p><br/><p><span style=\"\">Woojin had reached the pinnacle as a Necromancer. After being transported, he had to restart from a low level, but it was a path he had already walked. He didn’t have to worry about Spells or Activation Words.</span></p><br/><p><span style=\"\">It was possible to manifest his familiars and mastered magics using just his will.</span></p><br/><p><span style=\"\">“Koo-roo-roo.”</span></p><br/><p><span style=\"\">From nearby, the three corpses of the Drabbit exploded, and three Skeleton Soldiers was summoned. They were very weak, so he rarely used them in his latter-days. Still, he felt extremely happy to see them again.</span></p><br/><p><span style=\"\">“Let’s go.”</span></p><br/><p><span style=\"\">He still didn’t have rear any support magic, but it would not be a problem with the Drabbits. Woojin and the three Skeleton Soldiers descended the stairs. It caused the Drabbits to run towards them in response.</span></p><br/><p><span style=\"\">“Charge!”</span></p><br/><p><span style=\"\">“Keehhhhhhk!”</span></p><br/><p><span style=\"\">The Skeleton Soldiers let out a horrible shriek, then they ran forward swinging their bone knives threateningly.</span></p><br/><p><span style=\"\">Puh-uk!</span></p><br/><p><span style=\"\">“Kee-ehk.”</span></p><br/><p><span style=\"\">One Skeleton Soldier fell into a heap from one blow as a Drabbit used a menacing head-butt. The others were lucky. They were only bitten on their arms and legs.</span></p><br/><p><span style=\"\">Since the Skeleton Soldiers were composed of bones, attacks using teeth weren’t a threat. The Skeleton Soldiers were very weak, and their attack capabilities were insignificant. They swung their blunt bone knives, but it wasn’t very effective against the Drabbits.</span></p><br/><p><span style=\"\">However, they had blocked the Drabbit’s dangerous first charge, so they had done their job.</span></p><br/><p><span style=\"\">Puh-uk, puk!</span></p><br/><p><span style=\"\">Woojin swung his clawed hammer, and the Drabbit’s heads continued to explode. In a flash, he had killed three Drabbits, and he used them as fodder to summon an additional three Skeleton Soldiers.</span></p><br/><p><span style=\"\">“Kee-kee-keek.”</span></p><br/><p><span style=\"\">One had been demolished, but the number of Skeleton Soldiers had increased. The five Skeleton Soldier’s reliably blocked in front of Woojin. Woojin used his will to control them as he advanced.</span></p><br/><p><span style=\"\">“Kweeeehk!”</span></p><br/><p><span style=\"\">From between the broken windows of the subway train, Drabbits ran out en masse. There were so many of them that Woojin halted in his track for a moment.</span></p><br/><p><span style=\"\">“Block them!”</span></p><br/><p><span style=\"\">The 5 Skeleton Soldiers stood parallel to each other as if they were setting up a barricade.</span></p><br/><p><span style=\"\">Puh-puh-puk!</span></p><br/><p><span style=\"\">The Drabbits jumped at the Skeleton Soldiers like moths to a flame, and they started head-butting the Skeleton Soldiers’ limbs.</span></p><br/><p><span style=\"\">Puh-suk!</span></p><br/><p><span style=\"\">The middle Skeleton Soldier fell. One Drabbit broke through the line, and it flew accurately towards Woojin’s head.</span></p><br/><p><span style=\"\">Woojin swung the clawed hammer like a clean-up hitter as it split the air.</span></p><br/><p><span style=\"\">“One more added!”</span></p><br/><p><span style=\"\">The corpse of the Drabbit was flung away, and the corpse exploded to form another Skeleton Soldier.</span></p><br/><p><span style=\"\">Woojin headed towards the Drabbits tangled between the Skeleton Soldiers, and he brought down his clawed hammer as if he was threshing.</span></p><br/><p><span style=\"\">“Die. Die!”</span></p><br/><p><span style=\"\">Puh-puh-puk!</span></p><br/><p><span style=\"\">As he ended the Drabbit’s lives, he intermittently summoned more Skeleton Soldiers.</span></p><br/><p><span style=\"\">Woojin had 15 Magical Points.</span></p><br/><p><span style=\"\">His Magical Points would become empty if he summoned 15 times. The Magical Points recovered naturally, but one could use items or Skills to recover it.</span></p><br/><p><span style=\"\">If he increased the [Recovery] stat, then his natural recovery of Magical Points quickened. For a Magician, the most important stats were Wisdom, Magic, and Recovery.</span></p><br/><p><span style=\"\">The stat [Healing] dealt with the natural recovery of his body. It increased the recovery speed of [Vitality], which was consumed when one used Healing Skills or Combat Skills.</span></p><br/><p><span style=\"\">This was the most important Stat for Warriors.</span></p><br/><p><span style=\"\">Woojin possessed 10 Stat Points on both Recovery and Healing. After a certain amount of time, the Recovery would restore 10 Magic Points, but the more important one was the 10 points in Healing.</span></p><br/><p><span style=\"\">After one day, a shallow wound would disappear without any scarring as it healed.</span></p><br/><p><span style=\"\">“All of you die!”</span></p><br/><p><span style=\"\">He trusted his healing power, so Woojin charged as he hefted his clawed hammer.</span></p><br/><p><span style=\"\">Boo-oong, puk! Boo-oong, Pul!</span></p><br/><p><span style=\"\">His movements already exceeded the limits of a human. Every time he swung his clawed hammer, a Drabbit died.</span></p><br/><p><span style=\"\">The couple dozen of Drabbits filling the subway station was defeated in a matter of moments.</span></p><br/><p><span style=\"\">When Woojin’s reached level 4, his low Magical Points instantly recovered.</span></p><br/><p><span style=\"\">“Ha, I’m so thirsty.”</span></p><br/><p><span style=\"\">Woojin looked around the station, which had turned into a field of Drabbit’s corpses, and he headed towards the vending machine. He pried open the door of the already broken vending machine.</span></p><br/><p><span style=\"\">Kwajik.</span></p><br/><p><span style=\"\">He used his superhuman strength to create a gap between the vending machine’s door, and couple cans came into sight. Woojin picked up a cola can, and he blew on top of it.</span></p><br/><p><span style=\"\">The accumulated dust flew into the air. It looked to be relatively intact, so it seemed like he could drink it.</span></p><br/><p><span style=\"\">Ddak. Cheeeeeek. (TLN: tab opening sfx, fizzing sfx)</span></p><br/><p><span style=\"\">When he opened the can, he gulped down the warm coke.</span></p><br/><p><span style=\"\">“Kooahhh. Ggguhoooo.” (TLN: sfx)</span></p><br/><p><span style=\"\">The fizzing gas made him belt out a satisfying burp. Woojin grinned.</span></p><br/><p><span style=\"\">He had defeated the monsters inside the subway station, which had turned into a dungeon. It almost made him think this was still Planet Alphen. However, the refreshing carbonated drink he hadn’t had in 20 years made his return to earth very real to him.</span></p><br/><p><span style=\"\">“I really have to go back home.”</span></p><br/><p><span style=\"\">Woojin’s Magical Point had been restored, so he used the Search Skill.</span></p><br/><p><span style=\"\">“Mmm.”</span></p><br/><p><span style=\"\">Around the broken subway train’s front car, he could see a sparkling soft light. When he approached it, he saw a finger-sized gem.</span></p><br/><p><span style=\"\">When Woojin grabbed the gem emitting a soft green light, the light dimmed.</span></p><br/><p><span style=\"\">Woojin carried the item back to where he came from. When he was close to the barrier, the Return Stone let out a light, and it scattered as it touched the barrier.</span></p><br/><p><span style=\"\">Che-che-choot.</span></p><br/><p><span style=\"\">After seeing the barrier disappear, Woojin went up the stairs of the Gwachun Station’s 1st Exit.</span></p><br/><p><span style=\"\">*</span></p><br/><p><span style=\"\">“Ooh ooh. I thought I was going to shit my pants.”</span></p><br/><p><span style=\"\">Oh-joonhwan was a rank 9 public servant. After completing the assault, he had been assigned to the closed [Gwachun Station 1st Exit] dungeon as an Access Control Personnel. It had been one month since he was dispatched here.</span></p><br/><p><span style=\"\">He fulfilled the temporary reassignemnt period without any accidents happening.</span></p><br/><p><span style=\"\">He’ll be going back to the headquarters tomorrow. After he hurriedly returned after using the restroom, it felt like the sky was about to fall.</span></p><br/><p><span style=\"\">“What, what is this?”</span></p><br/><p><span style=\"\">The locked Dungeon entrance door was open.</span></p><br/><p><span style=\"\">He felt dizzy, and the sky turned yellow.</span></p><br/><p><span style=\"\">“D..did a civilian go in? Ha, I’m fucked.”</span></p><br/><p><span style=\"\">It was unlikely to think that a Roused had entered a closed Dungeon. The [Gwachun Station’s 1st Exit] wasn’t a Spot where particular ingredient items dropped. It was a just a dungeon infested by the low-ranked monster, Drabbit.</span></p><br/><p><span style=\"\">Unless it was a beginner Roused looking to train here, he couldn’t think of a reason why someone would look for a dungeon that didn’t drop anything of significance. It was hard to think a Roused would go into a location with no benefits.</span></p><br/><p><span style=\"\">Moreover, a Roused could just apply to enter the Dungeon in the first place. This was why he was assigned to this place.</span></p><br/><p><span style=\"\">He looked across the open entrance, and he was able to see that the barrier had already formed. It was a signal indicating someone was inside the dungeon.</span></p><br/><p><span style=\"\">“Ha, fuck. I’ll have to quickly request for help.”</span></p><br/><p><span style=\"\">For the Roused, the Drabbits were classified as a low level monster, but it was a monster to civilians. Oh-joonhwan was about to quickly make a call, but the barrier became clouded and a man walked out.</span></p><br/><p><span style=\"\">“Uh uh?”</span></p><br/><p><span style=\"\">Before he could press the send button, Joonhwan’s body froze. Woojin slowly walked out, and he was surprised when he met the gaze of Joonhwan.</span></p><br/><p><span style=\"\">“Ah, I opened the door and entered out of curiosit….”</span></p><br/><p><span style=\"\">“Are..are you a Roused?”</span></p><br/><p><span style=\"\">At Joonwan’s question, Woojin puzzled over his words. Before he could speak, Joonhwan spoke quickly.</span></p><br/><p><span style=\"\">“Whew. You almost took 10 years off my life. Please leave a record of your entrance. Whew. It’s quite fortunate. Why did you go into a dungeon with nothing to gain? You cleared it as a Solo Player, so you must be quite strong.”</span></p><br/><p><span style=\"\">He passed over the Dungeon Entrance Record Log to Woojin. He half-assedly wrote down his name, and position. Then he kept his words scarce.</span></p><br/><p><span style=\"\">‘Why do you think I went in? I wanted to ride the subway home.’</span></p><br/><p><span style=\"\">He didn’t have an explanation, so he thought it was best to stay silent. The other man was making up an excuse for him. After signing everything, Woojin confidently asked a question.</span></p><br/><p><span style=\"\">“May I go now?”</span></p><br/><p><span style=\"\">“Ah, you can go now.”</span></p><br/><p><span style=\"\">Woojin turned around to ask a question after taking a couple steps. The 5 years wasn’t a short of an amount of time as he initially thought since it seemed Dungeons and the Roused had come to be in that time period.</span></p><br/><p><span style=\"\">“How much is the bus fee these days?”</span></p><br/><p><span style=\"\">“What?”</span></p><br/><p><span style=\"\">What the heck? He had heard almost all Roused were rich.</span></p><br/><p></p></div><br/>\n</div>"}