{"title": "Chapter 9 - Ill Have To Make Some Money", "id": 9, "volume": 1, "url": "http://boxnovel.org/seoul-station%E2%80%99s-necromancer-chapter-9-ill-have-to-make-some-money", "volume_title": "Volume 1", "body": "<h1>Chapter 9 - Ill Have To Make Some Money</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 9 I’ll Have To Make Some Money.</strong></p><div class=\"innerContent fr-view\" id=\"chapterContent\"><br/><p><span style=\"\">Chapter 9 – I’ll Have To Make Some Money</span></p><br/><p><span style=\"\">(<span>TLN: This will be the last regular chapter of this week. I’ll probably take it easy until Monday unless there is a sponsored chapter. Next week regular chapters are Dragon Maken War, and Legend of Legend. Please turn off your adblocks if possible. Enjoy~)</span></span></p><br/><p><span style=\"\">“Woojin. It really is our Woojin. It really is Woojin.”</span></p><br/><p><span style=\"\">His mother grabbed on to him, then she cried for a long time. She had thought he had died, yet Woojin had come back alive after 5 years. She couldn’t tell if this was a dream or reality.</span></p><br/><p><span style=\"\">“Where have you been?”</span></p><br/><p><span style=\"\">“It’ll be too long to explain it here. Anyways, where’s the other family members? I went back home, and it was gone.”</span></p><br/><p><span style=\"\">“Sooah is at her preschool. You father…”</span></p><br/><p><span style=\"\">His mother started to speak, but she started to to cry again. He felt something was amiss, so his pounding heart turned cold.</span></p><br/><p><span style=\"\">“Let’s go. Let’s go home and talk.”</span></p><br/><p><span style=\"\">“Yes. Let’s do that. Let’s go home.”</span></p><br/><p><span style=\"\">As if his mother would disappear, Woojin held both her hands tightly as they left the staff room. While they rode the bus, his mother spoke despondently about their situation.</span></p><br/><p><span style=\"\">His father had been caught up in the Dungeon Shock as he left for work. As with the other tens of thousands of people riding the subway, he had passed away. They couldn’t even find his corpse. His mother had lived on alone as she took care of Sooah.</span></p><br/><p><span style=\"\">After losing the head of the household, her son was also missing. The only reason why his mother was able to withstand everything was because of young Sooah. They hadn’t been very wealthy in the past, and his mother had to take care of the whole household by herself. He could feel the difficulties she had gone through.</span></p><br/><p><span style=\"\">The only asset they had was the apartment, but the price became dirt cheap after the Dungeon Shock. Moreover, his mother wasn’t qualified for many of the jobs, since she had only been a housewife.</span></p><br/><p><span style=\"\">To make matters worse, Sooah became ill, so the household’s wealth decreased rapidly. It was a situation where everyday was painful. She had struggled to hold on for the past 5 years.</span></p><br/><p><span style=\"\">“It’s fine since you are alive. Don’ worry too much about it. I thought you had taken the subway.”</span></p><br/><p><span style=\"\">His mother was thankful just from the fact that he was alive.</span></p><br/><p><span style=\"\">The bus traveled for an hour before they approached the neighborhood where he used to live. They moved towards a block away from the Hammer Guild’s headquarters, and they arrived at a run down neighborhood.</span></p><br/><p><span style=\"\">“Just in case you or your father might come back we moved to a close location.”</span></p><br/><p><span style=\"\">If one disappeared during the Dungeon Shock, it basically meant the person was dead. However, his mother hadn’t lost hope. Her son had returned after 5 years, so she felt rewarded by her efforts.</span></p><br/><p><span style=\"\">His mother lead him through winding alleyways, then she headed toward a specific shack. It was a very small one room, and it was smaller than Jaemin’s house. Moreover, there were a lot of luggage stacked inside, so it made the room look smaller.</span></p><br/><p><span style=\"\">“Stay right here. I’ll go to the preschool, and I’ll bring Sooah back.”</span></p><br/><p><span style=\"\">His mother left Woojin by himself inside the room, and she left the house. Woojin looked around the small room filled with boxes, then he opened one of them.</span></p><br/><p><span style=\"\">“Ah…”</span></p><br/><p><span style=\"\">The box held none other than his old belongings. He opened the other boxes, and it was all the same. It contained his father’s clothes and his clothes. There were even toys he had played with when he was little.</span></p><br/><p><span style=\"\">She had kept all the belongings they had possessed when they lived in the apartment 5 years ago. She had forced it all inside this one room, so it wasn’t inevitable for the house to become cramped. He could guess the reason why his mother couldn’t throw away their belongings, and his heart felt like it was going to break.</span></p><br/><p><span style=\"\">Soon, his mother returned home with Sooah holding her hand. Her wide eyed face looked up at Woojin. Her complexion looked pale, but her white skin just made her look cuter.</span></p><br/><p><span style=\"\">The 2 year old baby he remembered in his memories had turned into a 7 year old cute child.</span></p><br/><p><span style=\"\">“Sooah. This is your big brother. Greet him.”</span></p><br/><p><span style=\"\">“Big brother?”</span></p><br/><p><span style=\"\">Sooah grabbed on to the hem of her mother’s clothes, then she warily looked over Woojin. Woojin made his most friendly smile as he looked down towards Sooah.</span></p><br/><p><span style=\"\">“Sooah. Could you play with your big brother for a moment? Mother will make delicious food soon.”</span></p><br/><p><span style=\"\">“Huh? Mommy doesn’t have to go to the restaurant?”</span></p><br/><p><span style=\"\">“Of course. It’s my day off today.”</span></p><br/><p><span style=\"\">It was only lunch, but his mother worked as if she was in a hurry. She prepared a sumptuous feast. Sooah became unusually animated when she saw the meat side dish. It seemed like she wasn’t able to eat meat on a regular basis.</span></p><br/><p><span style=\"\">His mother looked at him with contentment, so as to repay her, he ate the food with relish. After he emptied three bowls of rice, he stopped his spoon.</span></p><br/><p><span style=\"\">It was said the act of eating food was a good way to lower the wariness in humans.</span></p><br/><p><span style=\"\">Sooah seemed to have immediately adjusted to him. She called him ‘big brother’ easily, and she stuck to Woonjin’s side. It was false to say she wasn’t wary, but it seemed she was starved for attention. It made Woojin’s heart hurt when he saw this.</span></p><br/><p><span style=\"\">“Then Sooah plays by herself after coming home from preschool?”</span></p><br/><p><span style=\"\">“Yes. Mommy goes through a lot of troubles. I have to behave, and play by myself.”</span></p><br/><p><span style=\"\">He was proud of what the 7 year old said, so Woojin patted her head.</span></p><br/><p><span style=\"\">“Jeez. You have to brush Mimi’s head instead of mine.”</span></p><br/><p><span style=\"\">“Ah. Ok.”</span></p><br/><p><span style=\"\">Sooah passed him her barbie named Mimi, then he brushed its hair with a brush as big as his finger. Woojin and Sooah played with the doll, and his mother’s gaze was on them as she washed the dishes.</span></p><br/><p><span style=\"\">She had struggled so much in the past 5 years that it felt like she had become an old lady.</span></p><br/><p><span style=\"\">His mother, who was doing the dishes, picked up the phone when it rang. Then she hurried into the restroom to answer the phone.</span></p><br/><p><span style=\"\">[What’s going on? Where did you go during the busy hours? Come back immediately.]</span></p><br/><p><span style=\"\">“Today is a really important day. May I take a leave?”</span></p><br/><p><span style=\"\">[Hey lady, what do you think this is? There is no taking leaves at this small restaurant. You even got out of work regularly by giving excuses that your daughter was sick. If you don’t want to get fired, come in right now!]</span></p><br/><p><span style=\"\">Woojin’s senses were several times more sensitive compared to normal people, so it wasn’t hard for him to hear the whispered conversation. Woojin roughly figured out the situation, and Woojin felt a heavy feeling. It felt as if a rock was pressing down on his chest.</span></p><br/><p><span style=\"\">His mother exited the restroom, then she quickly finished washing the dishes. Then she spoke to Woojin and Sooah with an apologetic face.</span></p><br/><p><span style=\"\">“Sooah. I’m sorry, but can you play a little bit with your big brother?”</span></p><br/><p><span style=\"\">“Mmm. It’s ok. I’ll play with big brother.”</span></p><br/><p><span style=\"\">Even though she didn’t have any old memories of him, Sooah was already following after her big brother, and this made her very cute.</span></p><br/><p><span style=\"\">“I’m so sorry about this, Woojin.”</span></p><br/><p><span style=\"\">Woojin gave an ample laugh.</span></p><br/><p><span style=\"\">“It’s ok. Have a safe trip.”‘</span></p><br/><p><span style=\"\">“Yes. I’ll be back soon.”</span></p><br/><p><span style=\"\">After his mother went out, Sooah let out the tears she had been holding back.</span></p><br/><p><span style=\"\">“She’s always busy. Sooah is always alone. ”</span></p><br/><p><span style=\"\">Woojin’s eyes turned round when he saw her crying figure.</span></p><br/><p><span style=\"\">“No. Big brother is here now.”</span></p><br/><p><span style=\"\">“Cheh, I’ve never seen you, so how can you be my big brother?”</span></p><br/><p><span style=\"\">“Huh huh. I’m really your big brother. Don’t you remember me from when you were young? I even changed your diapers.”</span></p><br/><p><span style=\"\">“Sooah don’t wee any more!”</span></p><br/><p><span style=\"\">Woojin tried to appease the grumbling Sooah, so he played with her. He had assumed his mother would return around dinner time, but she wasn’t back yet. Therefore, Woojin started cooking.</span></p><br/><p><span style=\"\">Woojin was used to sleeping out in the open when he was at the Planet Alphen. When he opened the refrigerator, there were several ingredients leftover from his mother’s previous shopping trip.</span></p><br/><p><span style=\"\">Woojin simply fried an egg, then he shared vegetable fried rice with Sooah. His mother returned around 9 o’clock.</span></p><br/><p><span style=\"\">“I’m sorry. Mother is late. What did you eat for dinner? We’ll have to buy you a hand phone tomorrow.”</span></p><br/><p><span style=\"\">His mother couldn’t contact Woojin, so she must have felt frustrated.</span></p><br/><p><span style=\"\">They laid down their bedding in the small one room, and he didn’t even have space to roll over. Sooah had already fallen asleep in his mother’s arms, but Woojin and his mother had a hard time going to sleep.</span></p><br/><p><span style=\"\">“I’m very glad you are back.”</span></p><br/><p><span style=\"\">His mother had already said those words multiple times as she laid down her tired body. Woojin couldn’t sleep that night, and he stayed up with his eyes wide open.</span></p><br/><p><span style=\"\">‘This isn’t it.’</span></p><br/><p><span style=\"\">Woojin felt a suffocating feeling as if he was buried within a fallen building.</span></p><br/><p><span style=\"\">The next morning everyone woke up in a flurry. Sooah had to attend preschool, and his mother prepared to go to work.</span></p><br/><p><span style=\"\">“Woojin-ah. Go to the borough office, and get your SSN reissued. After I get off work, we’ll go shop for a hand phone. Don’t go anywhere. If you are hungry then make and eat some ramen. No, if you are hungry, come to the restaurant located in the front. It is the Seungmi Restaurant located in front of the mart.”</span></p><br/><p><span style=\"\">“Yes. Don’t worry about me. I’ll see you later.”</span></p><br/><p><span style=\"\">When everyone left, Woojin was alone, so his mood dampened.</span></p><br/><p><span style=\"\">He had a lot of things to do.</span></p><br/><p><span style=\"\">He had to cancel the missing persons report, then he had to be reissued a SSN at the borough office.</span></p><br/><p><span style=\"\">He was summoned during his 3rd year of high school, so he hadn’t even graduated. He didn’t want to be unemployed, so he also had to get a job.</span></p><br/><p><span style=\"\">‘I have to make some money.’</span></p><br/><p><span style=\"\">He felt pity for his busy mother, and Sooah who had to spend everyday by herself. He was the man of the house now. He had to become the pillar of this household.</span></p><br/><p><span style=\"\">‘I have to make a lot of money.’</span></p><br/><p><span style=\"\">He’ll have to study again. Moreover, he’ll have to immediately get a temporary job. Woojin quickly thought of a way to make a lot of money.</span></p><br/><p><span style=\"\">It felt like destiny.</span></p><br/><p><span style=\"\">No, it felt like a devil’s claw drawing him in.</span></p><br/><p><span style=\"\">‘Roused.’</span></p><br/><p><span style=\"\">Woojin looked at the three crumpled bills of 10,000 won, and he came to a decision. He opened the box with his carefully stored clothes. He wore his own clothes, then he exited the house.</span></p><br/><p><span style=\"\">He had received his SSN, and he had cancelled his mission persons report. He opened an account in his name at the bank, then he went into a phone store to purchase a hand phone.</span></p><br/><p><span style=\"\">“This is our hottest item, dear customer. It is very sturdy, so it is a model used by many famous Roused.”</span></p><br/><p><span style=\"\">At the phone salesman’s recommendation, he purchased the hand phone. He entered in his mother’s phone number, then he sent a message.</span></p><br/><p><span style=\"\">‘There is a little brother that I know living close to our house. I’ll stay there for now, and I’ll prepare for the school qualification examination.'(TLN:basically a Korea GED)</span></p><br/><p><span style=\"\">His mother immediately called him when Woojin sent the message. He had to talk with her for a very long time to assuage her fears. She knew their financial situation wouldn’t allow him to study, so in the end, she agreed to his proposal.</span></p><br/><p><span style=\"\">“Whew. I feel bad about it, but I’ll make it up later.”</span></p><br/><p><span style=\"\">Jaemin’s house wasn’t very far off from Woojin’s house. It was a distance he could walk to. He had decided it was the ideal place to stay until he bought a bigger house.</span></p><br/><p><span style=\"\">Woojin unfurled the folded paper, then he input Jaemin’s number. He pressed the call button, and the ring back tone rang. Soon, a person picked up the phone.</span></p><br/><p><span style=\"\">[Hello. This is the Dongjin Agency’s Park-hweeso.]</span></p><br/><p><span style=\"\">He heard a husky voice. He checked to see if he made an error in pressing the numbers. However, it matched the phone number on the paper.</span></p><br/><p><span style=\"\">[Hello. If you made a call, then please speak.]</span></p><br/><p><span style=\"\">“Is this Jaemin?”</span></p><br/><p><span style=\"\">[No.]</span></p><br/><p><span style=\"\">Click-</span></p><br/><p><span style=\"\">Accompanying an annoyed voice, the phone call was terminated. Woojin clicked his tongue as he looked at his phone.</span></p><br/><p><span style=\"\">“Ha. What is this? Did he trick me?”</span></p><br/><p><span style=\"\">Woojin pressed firmly on his temple.</span></p><br/><p></p></div><br/>\n</div>"}