{"title": "Chapter 2 Finally Seoul! (2).", "id": 2, "volume": 1, "url": "http://boxnovel.org/seoul-station%E2%80%99s-necromancer-chapter-2-finally-seoul-2", "volume_title": "Volume 1", "body": "<h1>Chapter 2 Finally Seoul! (2).</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 2 Finally Seoul! (2).</strong></p><br/><p></p><div class=\"innerContent fr-view\" id=\"chapterContent\"><br/><p><span style=\"\">Chapter 2 – Finally Seoul! (2)</span></p><br/><p><span style=\"\">The bullies coughed several times. They stealthily got up, then they hurriedly ran away after surveying the situation. Woojin thought about chasing after them. However, he didn’t have any reasons to do so, therefore he left them alone.</span></p><br/><p><span style=\"\">“Th..thank you very much.”</span></p><br/><p><span style=\"\">As Do-jaemin approached him, he bowed his head. This strange person was wearing weird clothes, but he had helped Jaemin.</span></p><br/><p><span style=\"\">“Ah, it is nothing. However, let me ask you a question.”</span></p><br/><p><span style=\"\">Jaemin had started to come up with a story when he heard Woojin’s words. Since he had rescued a kid from being beaten by bullies, he thought he would ask a question like ‘Why were they hitting you?’.</span></p><br/><p><span style=\"\">Of course, this was assuming he was a normal adult.</span></p><br/><p><span style=\"\">“What’s today’s date?”</span></p><br/><p><span style=\"\">“Yes?”</span></p><br/><p><span style=\"\">“I’m asking for today’s date.”</span></p><br/><p><span style=\"\">“Ah, it is November, 10th.”</span></p><br/><p><span style=\"\">“What year is it?”</span></p><br/><p><span style=\"\">“It is 2015.”</span></p><br/><p><span style=\"\">“What?”</span></p><br/><p><span style=\"\">Kim-woojin was so surprised that he didn’t speak for a long time. He had been ‘summoned’ to the other world on the year 2010. He was in his 3rd year of high school.</span></p><br/><p><span style=\"\">“Ha. What is happening?”</span></p><br/><p><span style=\"\">He had spent twenty years over there, but only five years had passed on earth. Woojin pressed his hand against his temple as he ordered his thoughts.</span></p><br/><p><span style=\"\">“Maybe this is better for me?”</span></p><br/><p><span style=\"\">He thought that twenty years had passed here and would never suspected otherwise. This was why he thought it would be impossible for him to find his family again. However, if it had only been five years, then they might be living in the same house.</span></p><br/><p><span style=\"\">Once he thought about it, it wasn’t a bad situation.</span></p><br/><p><span style=\"\">He looked for a mirror in his surrounding but couldn’t find one. Woojin’s eyes once again looked towards Jaemin.</span></p><br/><p><span style=\"\">“Hey, how old do I look?”</span></p><br/><p><span style=\"\">“What?”</span></p><br/><p><span style=\"\">Should the idiom, ‘out of the frying pan into the fire’, be used in this situation? He had escaped the bullies, yet he might have been caught by a crazy person now.</span></p><br/><p><span style=\"\">Jaemin thought about what to say, but he decided to speak as he saw it.</span></p><br/><p><span style=\"\">“Around twenty-two.”</span></p><br/><p><span style=\"\">“Is that so?”</span></p><br/><p><span style=\"\">‘Did my body get younger? Did I find my youth after I lost all my magic? Or, was my body restructured?’</span></p><br/><p><span style=\"\">He would gradually puzzle over it, but Woojin had to resolve some urgent business first.</span></p><br/><p><span style=\"\">He had returned after twenty years, but only five years had passed.</span></p><br/><p><span style=\"\">His most urgent priority was to find his family. He couldn’t remember his home phone number, and of course, he didn’t remember his family’s phone numbers. Fortunately, he was at the high school he had attended so he remembered how to find his way back home to his family.</span></p><br/><p><span style=\"\">If they hadn’t moved away, he would be able to have a reunion with his family today.</span></p><br/><p><span style=\"\">The problem was, how would he get home?</span></p><br/><p><span style=\"\">It was a distance that he couldn’t just walk. The distance was equivalent to taking a subway through seven stations. Woojin’s eyes were uncertain.</span></p><br/><p><span style=\"\">“Let me borrow some money.”</span></p><br/><p><span style=\"\">“What?”</span></p><br/><p><span style=\"\">“Let me borrow some transportation fee.”</span></p><br/><p><span style=\"\">Jaemin regretted not running away with the bullies. He didn’t dare to refuse him. He had taken out the bullies with one blow, so if Jaemin refused, his fists wouldn’t forgive Jaemin.</span></p><br/><p><span style=\"\">Jaemin turned out his pocket, then he pushed forward all his money.</span></p><br/><p><span style=\"\">He had 7300 won.</span></p><br/><p><span style=\"\">“Thank you. I promise I’ll pay you back.”</span></p><br/><p><span style=\"\">“N..no. You don’t have to.”</span></p><br/><p><span style=\"\">“Uh-huh. Do you see me as someone, who would extort from a kid? I’ll pay you back.”</span></p><br/><p><span style=\"\">Woojin rooted through his pocket, then he spoke as if he had forgotten something.</span></p><br/><p><span style=\"\">“Oh yeah. I don’t have a hand phone. Write your phone number on a paper for me.”</span></p><br/><p><span style=\"\">Jaemin followed Woojin’s words, and he took out a notebook from his backpack. He ripped the corner of the notebook, then he wrote his phone number. He thought over dozens of times whether he should write his phone number or if he should write a fake number.</span></p><br/><p><span style=\"\">‘Eh-it. He won’t be able to tell.’</span></p><br/><p><span style=\"\">Jaemin purposefully wrote down a fake phone number. He didn’t want to be called out, and be extorted again. He wanted to get out of here as fast as he can before the man could harass him.</span></p><br/><p><span style=\"\">“All right. Big brother will contact you, and I’ll pay back the money.”</span></p><br/><p><span style=\"\">“Yes. Have a nice day.”</span></p><br/><p><span style=\"\">Even if the man doesn’t pay him back, Jaemin wanted to quickly vacate this place, and he never wanted to see the man again. Woojin was alone again. He left the incineration plant then he walked around the school.</span></p><br/><p><span style=\"\">“Ha. The memories keeps popping up into my head.”</span></p><br/><p><span style=\"\">Only five years had passed, but it had been twenty years since he visited his school.</span></p><br/><p><span style=\"\">“I’m 24 years old? Mother and father should be over 50 years old now.”</span></p><br/><p><span style=\"\">When he thought about his family, his heart was deeply moved again. He had endured the hellish time, as he wished for the day he would once again return to his family’s embrace.</span></p><br/><p><span style=\"\">“I wonder if Sooah grew a lot?”</span></p><br/><p><span style=\"\">His youngest sibling, Sooah, was 2 years old when he left, so she should already be 7 years old now. Woonjin’s steps quickened as he thought about his family.</span></p><br/><p><span style=\"\">When he walked on the side-walks after exiting the school, every person he met whispered behind his back. It was understandable since Woojin’s clothes was in rough shape.</span></p><br/><p><span style=\"\">Maybe it was the effect of the Dimensional Travel, but his equipment had evaporated. Woojin looked like a mess. Even the shoes he wore were leather shoes, so he would look strange in the eyes of the people.</span></p><br/><p><span style=\"\">“Jeez.”</span></p><br/><p><span style=\"\">He was unnecessarily embarrassed, but it couldn’t curb Woojin’s spirit. Woojin’s mental state had transcended the point where he wouldn’t lower his head, because of his clothes.</span></p><br/><p><span style=\"\">It’ll only be embarrassing until he had reached his house.</span></p><br/><p><span style=\"\">Woojin tried hard to ignore the whispers emanating from the people, and he found the subway station.</span></p><br/><p><span style=\"\">“Huh? Why is the military troops here? Was there an accident?”</span></p><br/><p><span style=\"\">Soldiers were clustered around the entrance to the subway station. It didn’t seem like a training exercise. They even put up a steel fence, and they had guards posted.</span></p><br/><p><span style=\"\">“Jeez. What is this?”</span></p><br/><p><span style=\"\">Woo-jiin tried to talk to a pedestrian passing by at that moment.</span></p><br/><p><span style=\"\">“Excuse me. I would like to ask you a question.”</span></p><br/><p><span style=\"\">“Ah, I don’t believe in it.”</span></p><br/><p><span style=\"\">An older woman in her 40s replied in annoyance as if she had seen some kind of insect. She hurriedly moved her feet, and she disappeared in haste.</span></p><br/><p><span style=\"\">What is this? It felt weird.</span></p><br/><p><span style=\"\">He quickly stopped two female students, who seemed to be high school students.</span></p><br/><p><span style=\"\">“Excuse me.”</span></p><br/><p><span style=\"\">“Ah, let go of me. I don’t know anything about religion.”</span></p><br/><p><span style=\"\">Woojin became angry at the irritated response, but he tried hard to calm him heart.</span></p><br/><p><span style=\"\">“I’m not here to ask you to believe in a religion. What are those soldiers doing over there? Are they training?”</span></p><br/><p><span style=\"\">“Of course, the soldiers are guarding the dungeon entrance. Ah, let me go. I have to go to my tutoring school.”</span></p><br/><p><span style=\"\">The female student broke free from Woojin’s grasp. She started walking away, while she rubbed her arm as if his touch was unclean.</span></p><br/><p><span style=\"\">“Ha, how rude.”</span></p><br/><p><span style=\"\">He guessed people referred to the subway station as dungeons. He thought the five years was a short time, but apparently it wasn’t.</span></p><br/><p><span style=\"\">“I guess it is a popular slang used by the kids.”</span></p><br/><p><span style=\"\">Well, he did the same thing when he was in school.</span></p><br/><p><span style=\"\">Short-handed words and slangs changed incredibly fast with the development of the internet. It wouldn’t be surprising if someone like Woojin from 5 years ago would not know these terms.</span></p><br/><p><span style=\"\">“Huh? There are no soldiers over there.”</span></p><br/><p><span style=\"\">After confirming no one was present at the entrance of the subway station across the street, he crossed the street. When he descended the stairway of the subway entrance, he saw iron bars and a steel door like one would see in a prison.</span></p><br/><p><span style=\"\">“What the heck? Why did they block this place off?”</span></p><br/><p><span style=\"\">No wonder no one was here. They had shut this place down. Woojin looked across the steel bars, and he saw light coming from the subway tunnel.</span></p><br/><p><span style=\"\">The steel door was locked with a sturdy lock. He looked around his surrounding and he saw a small booth like the apartment guard booths. He looked around inside, and he saw a bundle of keys. He took it and he tried to open the lock.</span></p><br/><p><span style=\"\">Click.</span></p><br/><p><span style=\"\">“What is this? Did the subway workers go on a strike?”</span></p><br/><p><span style=\"\">He returned the bundle of keys to the booth, then he headed toward the other side of the steel door. There were no one underneath the blinking florescent lights, and the atmosphere was quite creepy.</span></p><br/><p><span style=\"\">“They might have shut down the station instead of going on a strike.”</span></p><br/><p><span style=\"\">If the station was shut down then there was no chance they would operate the subway train.</span></p><br/><p><span style=\"\">Woojin was about to turn around when it happened.</span></p><br/><p>&lt;You have entered the dungeon at Gwachun Station’s 1st Exit.&gt;</p><br/><p><span style=\"\">“Huh. What is this?”</span></p><br/><p></p></div><br/>\n</div>"}