{"title": "Chapter 15 - What Goes Around Comes Around", "id": 15, "volume": 1, "url": "http://boxnovel.org/seoul-station%E2%80%99s-necromancer-chapter-15-what-goes-around-comes-around", "volume_title": "Volume 1", "body": "<h1>Chapter 15 - What Goes Around Comes Around</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 15 What Goes Around Comes Around.</strong></p><div class=\"innerContent fr-view\" id=\"chapterContent\"><br/><p><span style=\"\"><span style=\"\">Chapter 15 – What Goes Around Comes Around</span></span></p><br/><p><span style=\"\">(<span>TLN: I decided to release a 3rd regular chapter this week. I had some extra time, and I wanted to somewhat wrap up this dungeon part. Please turn off the adblockers if you are able to. Thanks~)</span></span></p><br/><p><span style=\"\">“Whew, It’s done.”</span></p><br/><p><span style=\"\">Sunggoo wiped the sweat off his ghastly face. The last floor was a very large space, and there had been enough monster to fill up the whole floor. Of course, Sunggoo wasn’t sweating, because he had participated in the battles.</span></p><br/><p><span style=\"\">“Did you excavate it all?”</span></p><br/><p><span style=\"\">At Woojin’s words, Sunggoo brought the pile of blood stones to him.</span></p><br/><p><span style=\"\">“How can someone like big brother be Rank F? At the very least, you should be Rank D. Since you have a lot of abilities, you could even receive Rank C.”</span></p><br/><p><span style=\"\">“I’ll get it later.”</span></p><br/><p><span style=\"\">Sunggoo looked at Woojin, who spoke indifferently, as if he was seeing a monster.</span></p><br/><p><span style=\"\">The monsters on the last floor of the Dungeon was wiped out by Woojin and his summoned beings. Sunggoo was assigned the role of excavating blood stone from the monsters Woojin pointed out. He basically did the clean up work.</span></p><br/><p><span style=\"\">Woojin had the ability to hunt 1 star and 2 star monsters by himself. His battle ability was close to a Rank D, and he wouldn’t fall short against a Rank C in terms of versatility. He was able to summon the Skeletons, and he could search for the blood stones. Moreover, he was able to extract some gray energy from the dead monster’s corpses, and he was able to use it to heal himself.</span></p><br/><p><span style=\"\">Isn’t there a saying that says a sandalwood is fragrant even in seed leaf?(TLN:idiom used to describe genius who display their abilities even in childhood) Sunggoo looked at this person, who had finished his Roused registration only 3 hours ago. He believed this noob Roused Kang-woojin will become someone to be reckoned with.</span></p><br/><p><span style=\"\">“Uh? What are you doing? You are going to learn it instead of selling it?”</span></p><br/><p><span style=\"\">“Yeah, why?”</span></p><br/><p><span style=\"\">Woojin inserted his magic in to the Magical Scroll he held in his hand. As the Magic Scroll disappeared, he absorbed the magic, Electric Shock. He had to save his Achievement Points since he had a lot of skills to learn. Therefore, he decided to learn the magic, Electric Shock, since he already possessed the Magic Scroll.</span></p><br/><p><span style=\"\">Even if he wanted to learn a more higher ranked Magic, he could only learn from Magic Scrolls related to the Necromancer class. Still, Electric Shock would be useful when attacking a person. There was no downside in learning it.</span></p><br/><p><span style=\"\">“Hul. You already have a lot of ability yet you are learning more magic, big brother? If you had sold it, you could have sold it for one hundred million won…..” (TLN: 100,000,000 won or $89306 dollars)</span></p><br/><p><span style=\"\">“……?”</span></p><br/><p><span style=\"\">At Hong-songgoo’s words, Woojin’s face became rigid. A 100 point Magic Scroll was worth a hundred million?</span></p><br/><p><span style=\"\">“…it was that expensive?”</span></p><br/><p><span style=\"\">“Of course. It allows you to gain an additional ability. It is qualitatively different from an Artifact.”</span></p><br/><p><span style=\"\">Magical energy had to be injected into an Artifact for it to activate its imbued magic. On the other hand, Magic Scroll allowed a Roused to learn the magic. With a Magic Scroll, one didn’t have to worry about losing it, and even a low ranked Magic Scroll could be used for research. Of course, it would be expensive.</span></p><br/><p><span style=\"\">“Huh. Why would such an expensive item drop in a mere 2 star Dungeon?”</span></p><br/><p><span style=\"\">“I’m not sure. You must be really lucky. It isn’t like it never happens. It just doesn’t show up that often. So what kind of magic was it?”</span></p><br/><p><span style=\"\">“It’s the one you got hit with. It’s the Electric Shock that was used by the hobgoblin.”</span></p><br/><p><span style=\"\">“Hul. You would have at the very least gotten one hundred million…….”</span></p><br/><p><span style=\"\">One hundred million. It was one hundred million.</span></p><br/><p><span style=\"\">“Whew.”</span></p><br/><p><span style=\"\">If he knew the Magic Scroll was worth one hundred million then he would have just used 100 points to learn the Electric Shock. He wanted to buy the Magic Scroll from the Achievement Store to sell, but the Skill Books purchased from the Point Store couldn’t be used in a transaction.</span></p><br/><p><span style=\"\">Only Woojin could learn it.</span></p><br/><p><span style=\"\">Woojin had learned ‘Soul Extract’ to restore the barely alive Sunggoo. It cost him 50 points, but he didn’t hesitate since he had to learn it anyway.</span></p><br/><p><span style=\"\">After a monster or a person dies, their souls remain next to the corpses for a brief moment. At that moment, he could extract the souls then he could use it as a source of energy.</span></p><br/><p><span style=\"\">Whether it was magic, vitality or stamina, a small portion of it could be recovered. When Woojin injected it into someone else, the efficacy decreased.</span></p><br/><p><span style=\"\">Sunggoo thought Woojin was using healing magic, but the truth was different. Woojin was stealing the life force of others to share with him.</span></p><br/><p><span style=\"\">“Ssssoop, whew. Let’s not worry about the cost.”</span></p><br/><p><span style=\"\">Woojin tried to soothe his aching innards. If he had sold the Magic Scroll, then he wouldn’t have to traverse a Dungeon for a long while. No, if he thought about the fallen real estate value in Seoul, he could have moved into a huge villa that was much bigger than the current one room…..</span></p><br/><p><span style=\"\">Ah, let’s not think about it.</span></p><br/><p><span style=\"\">“How much can I get with this much blood stones?”</span></p><br/><p><span style=\"\">“At the very least, you could get around 800. I think you can get more. I’m not too sure…”</span></p><br/><p><span style=\"\">He had invested 100,000 won, so he made a good amount of profit. If his party members hadn’t run away, we would have only received one million won for his cut.</span></p><br/><p><span style=\"\">“It’s all mine.”</span></p><br/><p><span style=\"\">“Of…of course.”</span></p><br/><p><span style=\"\">“How about the Return Stone?”</span></p><br/><p><span style=\"\">“I have it here.”</span></p><br/><p><span style=\"\">“Then let’s go.”</span></p><br/><p><span style=\"\">Woojin and Sungoo swept the blood stones into the bag, and they were about to head upstairs.</span></p><br/><p><span style=\"\">“It looks like an ambush.”</span></p><br/><p><span style=\"\">He only had a low level detection skill, but he could feel a faint sense of murderous intent. Woojin gave Sunggoo a warning. When Woojin came to a stop, Sunggoo’s expression also turned serious.</span></p><br/><p><span style=\"\">They had killed all the monsters. Unless they re-entered the Dugneon, the monsters won’t regenerate. If there was an ambush, then it had to be Bae-dohsoo’s party.</span></p><br/><p><span style=\"\">“Are they trying to PK?”</span></p><br/><p><span style=\"\">Woojin questioned Sunggoo, whose voice was shaking from worry.</span></p><br/><p><span style=\"\">“Does this happen often?”</span></p><br/><p><span style=\"\">“It happens occasionally. It probably happens more off the record. This is why people don’t party up with a group they don’t know. The hell’s gate is opened when a treasure like Magic Scroll and Artifact is found. ”</span></p><br/><p><span style=\"\">“If there is a fight, how is it handled?”</span></p><br/><p><span style=\"\">“No one will know what had happened inside the Dungeon. It is an written rule that they’ll only act when there is indisputable evidence.”</span></p><br/><p><span style=\"\">“Huh. Then it’s an easy way to dispose of a dead body.”</span></p><br/><p><span style=\"\">Woojin grinned and he looked up into the dark stairway. He stopped walking then he looked back. There were monster corpses lying everywhere. Woojin took several steps back as he distanced himself from the stairway. Sunggoo also followed Woojin’s action.</span></p><br/><p><span style=\"\">“Hey, stop hiding there like a rat. Why don’t you come out?”</span></p><br/><p><span style=\"\">Soon, there was a response from Woojin’s words. Bae-dohsoo’s party slowly stepped on to the stairs. One had an awkward expression, and another seemed to be apologetic. The rest had a no nonsense attitude.</span></p><br/><p><span style=\"\">“What happened? Did you defeat them all?”</span></p><br/><p><span style=\"\">Bae-dohsoo put on a performance as he slyly asked a question. Woojin spoke in a low voice toward Sunggoo.</span></p><br/><p><span style=\"\">“I’m planning on taking him by surprise when he gets close.”</span></p><br/><p><span style=\"\">“What should I do?”</span></p><br/><p><span style=\"\">Sunggoo looked at Woojin with worried eyes. Woojin shrugged his shoulders.</span></p><br/><p><span style=\"\">“You bastards ran away yet you have have the gall to show up again. Why are you here when you should be waiting in front of the barrier?”</span></p><br/><p><span style=\"\">The sudden disrespectful words spat out by Woojin made Bae-dohsoo’s eyebrows twitch, but he laughed awkwardly as he tried to keep his expression in control.</span></p><br/><p><span style=\"\">“Haha. Why are you being like this? Aren’t we on the same team? We just made a tactical retreat, and we came back to clear the Dungeon. When we arrived, it seemed all the monsters were killed. How did you do it?”</span></p><br/><p><span style=\"\">Bae-dohsoo’s thoughts were in a complete state of confusion. Two F ranked Roused were able to clear all the monsters, so he couldn’t believe what had happened. Bae-dohsoo secretly looked towards the bag filled with blood stones.</span></p><br/><p><span style=\"\">Woojin laughed.</span></p><br/><p><span style=\"\">Those who were blinded by greed couldn’t see what was right in front of their eyes.</span></p><br/><p><span style=\"\">“Stop fucking around. You just wanted to take the Return Stone, but now you are covetous of a ready made meal?”</span></p><br/><p><span style=\"\">Woojin threw the bag filled with blood stones in front of him.</span></p><br/><p><span style=\"\">Chwa-roo-rook.</span></p><br/><p><span style=\"\">Blood stones spilled out from the bag’s opening. It’s was thrown about the midway point between Woojin and Bae-dohsoo’s party.</span></p><br/><p><span style=\"\">“Try taking it if you covet it.”</span></p><br/><p><span style=\"\">At Woojin’s words, Bae-dohsoo’s expression stiffened.</span></p><br/><p><span style=\"\">“It seems you are mistaken. Do you think we will try to PK someone, who had defeated a monster we couldn’t kill? It is a misunderstanding. We aren’t that stupid.”</span></p><br/><p><span style=\"\">“Go on.”</span></p><br/><p><span style=\"\">“I’m sorry for not looking out for you. However, my life was one the line so what could I do? We just came back to look for the Return Stone. Since you cleared the Dungeon, we were fortunate enough to be able to retrieve Jongchul’s corpse. Therefore, I am very thankful.”</span></p><br/><p><span style=\"\">At Bae-dohsoo’s words, Woojin felt that he had been too sensitive. Yes, the people here weren’t at all like those from the Alphen Planet.</span></p><br/><p><span style=\"\">Maybe they were hiding themselves on top of the staircase in case they ran into a monster? From their perspective, they had no idea of what was going on at the bottom floor.</span></p><br/><p><span style=\"\">‘Maybe I’m being too sensitive…….’</span></p><br/><p><span style=\"\">For the past 20 years, he had lived in a location where people betrayed each other for a fistful of money. This is why he was always on edge. However, this was earth. This place was Seoul.</span></p><br/><p><span style=\"\">It is a place where peace and moral was alive….</span></p><br/><p><span style=\"\">Hwa-roo-roo-rook.</span></p><br/><p><span style=\"\">…my ass.</span></p><br/><p><span style=\"\">Woojin hurriedly waved his arm through the flame that ignited in front of his eyes.</span></p><br/><p><span style=\"\">“Right now.”</span></p><br/><p><span style=\"\">At Bae-dohsoo’s shout, the man with the bow shot an arrow toward Hong-songgoo. His fireball attack was an ability they had to get rid of first.</span></p><br/><p><span style=\"\">After Bae-dohsoo ran away, he had come to an agreement with his party. They weren’t skilled enough to attempt a 2 star dungeon. The money wasn’t that great, but they had decided to return to the 1 star Dungeons.</span></p><br/><p><span style=\"\">They returned to carefully look for the Return Stone, but all the monsters were dead. Even the hobgoblin was dead, and this made his head spin.</span></p><br/><p><span style=\"\">Greed grew in him.</span></p><br/><p><span style=\"\">No matter how hard they searched they could only find Jongchul’s corpse. Woojin and Sunggoo’s corpses were missing. This meant the two of them had conquered the bottom floor by themselves.</span></p><br/><p><span style=\"\">If they were able to defeat the hobgoblin, this meant one of them was hiding his real capability. This is why they had prepared an ambush, but their opponents saw through it first.</span></p><br/><p><span style=\"\">Bae-dohsoo tried to put Woojin at ease. At the same time, he tried to assess the situation. He tried to determine if it was worth killing them. Dohsoo’s eyes almost flipped over backwards when Woojin threw the bag filled with blood stones.</span></p><br/><p><span style=\"\">It was a sum of money equivalent to working a 1 star Dungeon for one month.</span></p><br/><p><span style=\"\">Bae-dohsoo confirmed from Woojin’s sharp reaction that he was suspicious.</span></p><br/><p><span style=\"\">‘He is on guard against us.’</span></p><br/><p><span style=\"\">The fact that he was on guard meant it would be dangerous for them. He didn’t know what method they used to kill the numerous monsters, but he was wary of attacking them.</span></p><br/><p><span style=\"\">He decided to use the fact that his opponent was feeling a sense of danger against he. He thought it was worth trying to attack them.</span></p><br/><p><span style=\"\">‘Let’s hit them.’</span></p><br/><p><span style=\"\">Bae-dohsoo gave the sign they had agreed to in advance, then he used his Ignition ability. At the same time, Woojin’s face was engulfed in flame, and an arrow pierced through Sunggoo’s shoulder.</span></p><br/><p><span style=\"\">“Koo-ook.”</span></p><br/><p><span style=\"\">The party members attacked the surprised man even before the flame had formed. The weapons would cut through more easily through human flesh than the tough leather of monsters.</span></p><br/><p><span style=\"\">“Whew. Please don’t resent me. Aren’t all Roused like this?”</span></p><br/><p><span style=\"\">Bae-dohsoo took out the dagger equipped on his belt, then he stabbed it toward the staggering Woojin.</span></p><br/><p><span style=\"\">Shweeek.</span></p><br/><p><span style=\"\">Even though, the flame was impeding Woojin’s sight, he was able to grab the hand stabbing at him. Woojin reversed the grip on the hand as he threw him. His strength and speed was so fast that Bae-dohsoo didn’t have the chance to do anything.</span></p><br/><p><span style=\"\">He was on par with a Roused with a physical ability.</span></p><br/><p><span style=\"\">“Whew. That’s pretty hot.”</span></p><br/><p><span style=\"\">As the flames faded away, Woojin wiped his face with his hands. He glared at Bae-dohsoo’s party, who was taken aback. Sunggoo had an arrow in his shoulder, and he was looking at Woojin with tear-filled eyes.</span></p><br/><p><span style=\"\">“It was pretty insolent attack.”</span></p><br/><p><span style=\"\">His face was slightly red, and it seemed he had taken some minor burns to the face. However, Woojin was smiling.</span></p><br/><p><span style=\"\">“I guess I should have expected this?”</span></p><br/><p><span style=\"\">Woojin extended both his arms.</span></p><br/><p><span style=\"\">Pah-pahk!</span></p><br/><p><span style=\"\">The scattered monster’s corpses exploded, and the scraps of meat flew everywhere. It was a grand sight. If one had a weak constitution, the grotesque sight would make one faint.</span></p><br/><p><span style=\"\">“Resent me.”</span></p><br/><p><span style=\"\">Woojin let out a white smile.</span></p><br/><p><span style=\"\">Resentment wouldn’t change anything.</span></p><br/><p><span style=\"\">“I’ll laugh to my heart’s content.”</span></p><br/><p><span style=\"\">He’ll taken on all the resentment from the weak. It would be too cruel for him to deny them that much, since their souls would be imprisoned as they will fall from grace.</span></p><br/><p><span style=\"\">The Skeletons’ bone knives didn’t show any hesitation or mercy.</span></p><br/><p><span style=\"\">“Kooh-ahhk.”</span></p><br/><p><span style=\"\">In a flash, the entire party was taken down then Woojin headed towards Bae-dohsoo. He was still twitching, so it seemed he was still alive.</span></p><br/><p><span style=\"\">“W, wait a moment, let’s talk….”</span></p><br/><p><span style=\"\">“Are you waiting for your Ignition ability’s cool time?”</span></p><br/><p><span style=\"\">Kwa-jeek!</span></p><br/><p><span style=\"\">Woojin unhesitatingly stabbed the dagger he took from Bae-dohsoo into his heart. Bae-dohsoo trembled for a moment before he went limp. Woojin looked at him without showing much interest as he took the Bae-dohsoo’s bag.</span></p><br/><p><span style=\"\">It was filled with blood stones they had acquired before they met the hobgoblin. Moreover, Woojin searched Bae-dohsoo’s body, and he took his wallet. He took out all the cash and he stuffed it into his pocket. Before he knew it, Woojin was humming a tune.</span></p><br/><p><span style=\"\">‘Un…unbelievable.’</span></p><br/><p><span style=\"\">In front of Hong-sunggoo, four lives were taken in an instant. He tried to cover his mouth with both hands as he tried to stop the words that almost leaked out of his mouth.</span></p><br/><p><span style=\"\">He was so surprised that it seemed he wasn’t conscious of the pain caused by the arrow in his shoulder. Woojin also went through the other party members’ pockets, then he mumbled.</span></p><br/><p><span style=\"\">“Anyways, the bastards who try to stab me in the back will never speak again.”</span></p><br/><p><span style=\"\">Is he saying this for his benefit? Sunggoo’s eyes trembled uncontrollably.</span></p><br/><p><span style=\"\">“The people I hate the most are those who try to stab others in the back. Isn’t that right, Sunggoo?”</span></p><br/><p><span style=\"\">Woojin whipped his head around, and he looked into Sunggoo’s eyes. He was so surprised that he almost wet his pants. Woojin had killed four people, but his face was too indifferent.</span></p><br/><p><span style=\"\">Even when one kills a monster, or even a small animal, one usually feels excitement, or guilt. Some kind of emotion should be stirred up, yet Woojin looked like he had pulled weeds out from the side of the road after he killed these people. Sunggoo couldn’t sense any change in his emotion.</span></p><br/><p><span style=\"\">It felt like Woojin was something more than a murderer.</span></p><br/><p><span style=\"\">His peacefulness drove the terror deep into Hong-songgoo.</span></p><br/><p><span style=\"\">“Why aren’t you answering me?”</span></p><br/><p></p></div><br/>\n</div>"}