{"title": "Chapter 17 - Their Situation", "id": 17, "volume": 1, "url": "http://boxnovel.org/seoul-station%E2%80%99s-necromancer-chapter-17-their-situation", "volume_title": "Volume 1", "body": "<h1>Chapter 17 - Their Situation</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 17 Their Situation.</strong></p><br/><p></p><div class=\"innerContent fr-view\" id=\"chapterContent\"><br/><p><span style=\"\">Chapter 17 – Their Situation</span></p><br/><p><span style=\"\">(TLN: This will count towards next weeks regular chapter. Elqueeness will be out next either tomorrow or Monday. Please turn off the ad-blockers if you can. Thank you~)</span></p><br/><p>A tiring battle ensued.</p><br/><p><span style=\"\">“Please quit.”</span></p><br/><p><span style=\"\">“I can’t quit.”</span></p><br/><p><span style=\"\">“You don’t have to earn any money. I’m making a lot of money now. This is the money I earned in half a day.”</span></p><br/><p><span style=\"\">Woojin opened his bank app, then he show his mother his account statement. However, she wouldn’t budge an inch.</span></p><br/><p><span style=\"\">“You came back after 5 years yet how could a mother thrust you back into such a deadly situation?”</span></p><br/><p><span style=\"\">“Then do you want me continue to live by receiving allowance from you? Do you want me to stay unemployed for the rest of my life, and live off the money you struggled to earn?”</span></p><br/><p><span style=\"\">Woojin hit his chest as if he was frustrated.</span></p><br/><p><span style=\"\">“I’ll make a lot of money. I’ll make enough that mother won’t have to worry about money ever again. Mother and Sooah is my responsibility now. I’ve returned, so I’m the head of this family.”</span></p><br/><p><span style=\"\">“Woo, Woojin. You….”</span></p><br/><p><span style=\"\">His mother couldn’t say anything. She just let her tears flow. The word, ‘head of the family’, swirled around her head.</span></p><br/><p><span style=\"\">Her oldest son had gone missing and even her husband had died.</span></p><br/><p><span style=\"\">The daughter she had late in life was only 2 years old, and she had always been a stay-at-home mom. Yet she had to live on with such a heavy burden. It wasn’t apt to say she had lived, but she had just held out.</span></p><br/><p><span style=\"\">Woojin tightly hugged his mother as a river of tears flowed out of her.</span></p><br/><p><span style=\"\">Before the tear-filled mother and son could have a conversation, the owner of the restaurant gave a fake cough. She was Soongmi’s mother, Kim-soonohk. If it was up to her, she would have yelled at them for making a spectacle at someone else’s store. However, her daughter Soongmi was giving her a signal. So she looked on without doing anything.</span></p><br/><p><span style=\"\">“Huh-oom. I don’t want to say something like this, but how can you just quit your job like this? I know what your situation is like, but you should have a conscious. You know our store is busy, so work until I can hire someone.”</span></p><br/><p><span style=\"\">Woojin’s face stiffened at Kim-soonohk’s words. He wanted his mother to immediately quit this arduous kitchen work, but his mother’s answer was faster than his.</span></p><br/><p><span style=\"\">“Yes. Even if I do quit, a responsible person can’t act that way. This isn’t about money, so don’t say anything.”</span></p><br/><p><span style=\"\">“Ughh. Then please quit this place within a week. Sooah needs mother more than me.”</span></p><br/><p><span style=\"\">She was only a 7 year old pre-schooler. She had always felt very sorry towards Sooah, so his sister might have been the straw that broke the camel’s back.</span></p><br/><p><span style=\"\">‘Husband. Our Woojin…….’</span></p><br/><p><span style=\"\">She didn’t know what skills he had acquired, but her son had suddenly showed up after 5 years. He said he would go away to prepare for the school qualification exam, but he came back after he earned a lot of money. For someone who worked at a restaurant, the money was quite the windfall.</span></p><br/><p><span style=\"\">Her tears wouldn’t stop falling as she thought about her past arduous days.</span></p><br/><p><span style=\"\">“Mother. Hoo-hook. This is so sad.”</span></p><br/><p><span style=\"\">Soongmi also started crying, so Kim-soonohk passed her a handkerchief. She had never seen her daughter act this way, so she was taken aback. Even though Soongmi was her daughter, she wasn’t a kind girl, and she could be a bit of a bitch.</span></p><br/><p><span style=\"\">Normally, her daughter would call the kitchen lady auntie, then she would treat her with a bad temper. For some reason, her daughter was acting like a chaste and modest woman today.</span></p><br/><p><span style=\"\">After crying for a long while, Lee-soogyong reigned in her emotions, then she started to plead towards her boss, Kim-soonohk.</span></p><br/><p><span style=\"\">“Do you think I could get off work early today?”</span></p><br/><p><span style=\"\">“If she doesn’t let you off, then just quit.”</span></p><br/><p><span style=\"\">At Woojin’s rejoinder, Kim-soonohk made a sound of indecision. However, in the end, she had no choice, but to allow it. It made a big difference for a single person to be missing from a busy restaurant, but she couldn’t do anything about it.</span></p><br/><p><span style=\"\">It would be a bigger trouble if she didn’t show up starting tomorrow.</span></p><br/><p><span style=\"\">“Yes, mother. Please go in first. Have a nice time with big brother Woojin..”</span></p><br/><p><span style=\"\">“O..okay, Ms Soongmi.”</span></p><br/><p><span style=\"\">Lee-soogyung was bewildered by the restaurant owner’s daughter Soongmi. She was responding in an amiable way.</span></p><br/><p><span style=\"\">“Big brother. Be safe! I’ll see you again next time. Oh yeah. Here is my phone number.”</span></p><br/><p><span style=\"\">Park-soongmi snatched Woojin’s phone away as if she was stealing it. Then she put in her number to call her phone.</span></p><br/><p><span style=\"\">“Heh heh. Have a nice day, mother.”</span></p><br/><p><span style=\"\">After receiving her goodbye, Woojin and Lee-soogyong left the restaurant. Soon the dinner crowd will rush in, but she didn’t feel like working on a day like this.</span></p><br/><p><span style=\"\">“Uh. Where are we going, mom?”</span></p><br/><p><span style=\"\">Woojin was dragged by Lee-soogyong’s hand towards a different direction from their house.</span></p><br/><p><span style=\"\">“You’ll know once you get there. Any ways, what kind of relationship do you have with Ms Soongmi?”</span></p><br/><p><span style=\"\">“Ah, her? She used to be my junior in school. Why?”</span></p><br/><p><span style=\"\">“Mmmm.”</span></p><br/><p><span style=\"\">His mother didn’t speak for a long time, then she suddenly stopped walking. She turned around to look straight at Woojin, and he could see traces of worry on her face.</span></p><br/><p><span style=\"\">“I don’t plan on involving myself in my son’s love life, but if you bring a bitch like her, mother will be against it.”</span></p><br/><p><span style=\"\">Woojin smirked at his mother’s words.</span></p><br/><p><span style=\"\">“I don’t have any interest in her. I was wondering what you wanted to say to me.”</span></p><br/><p><span style=\"\">The girl had given him a lot of stuff during Valentines day, but for him, 20 years had already passed. The only thing he remembered was her face.</span></p><br/><p><span style=\"\">At the time, he didn’t have any feelings toward her, so he doubted he would develop any feelings for her now. Moreover, he could imagine how she had treated his mother by her reaction. So he was disgusted by her.</span></p><br/><p><span style=\"\">“Where are we going?”</span></p><br/><p><span style=\"\">“You’ll know once we arrive there.”</span></p><br/><p><span style=\"\">Lee-soongyong took her son, Kang-woojin, to a newly built apartment not too far from their home. The Hammer guild built their headquarters in the devastated region, and they had made a lot of progress there. However, a massive park was also built to one side.</span></p><br/><p><span style=\"\">Lee-soogyung made her son buy a bottle of alcohol from a convenience store near the park’s entrance. Then she bought a single chrysanthemum flower from the flower shop.</span></p><br/><p><span style=\"\">They walked through a secluded path inside the park, and they arrived in front of a large monument located at the center of the park.</span></p><br/><p>&lt;Sahdahng Station’s Casualty Monument&gt;</p><br/><p><span style=\"\">Several hundred thousand people died during the Dungeon Shock. A lot more people died in the subsequent Dungeon Breaks, but if one had to pick the the day when the most deaths had occurred, it was the day of the Dungeon Shock.</span></p><br/><p><span style=\"\">Woojin had disappeared on that day.</span></p><br/><p><span style=\"\">On that day, everyone who had used the subway system had died. A lot of parks were built near the stations since it was destroyed by the subsequent Dungeon Breaks.</span></p><br/><p><span style=\"\">Woojin wordlessly placed the flower in front of the monument then he poured out the alcohol. He kowtowed with a heavy heart. Lee-soogyong could only silently watch him as she shed her tears.</span></p><br/><p><span style=\"\">“Husband. Our Woojin has returned. Our Woojin…….”</span></p><br/><p><span style=\"\">Woojin finished his kowtow then he hugged his mother tightly. His mother couldn’t’ control her emotions, so she cried endlessy.</span></p><br/><p><span style=\"\">‘Father…….’</span></p><br/><p><span style=\"\">Woojin started thinking about his father, and his emotions turned melancholy. He hadn’t had the time to spare since his mother had been struggling by herself, but he hadn’t forgotten about his father.</span></p><br/><p><span style=\"\">Woojin missed his father. However, the ache he felt towards his mother and Sooah was larger. Maybe, the past 20 years had desensitized Woojin from death.</span></p><br/><p><span style=\"\">“Please tell me now.”</span></p><br/><p><span style=\"\">“What do you mean?”</span></p><br/><p><span style=\"\">“Where and what have you been up to during that time?”</span></p><br/><p><span style=\"\">“…….”</span></p><br/><p><span style=\"\">When he saw his mother’s earnest face, Woojin struggled for a long time, but he decided to tell her the truth. However, he was mindful of the shock his mother would receive, so he tried to downplay the truth.</span></p><br/><p><span style=\"\">He had overcome countless near death experiences, and his hands snatched away countless lives as he struggled fiercely to live.</span></p><br/><p><span style=\"\">There had been countless people afraid of him, and their gazes had been filled with fear.</span></p><br/><p><span style=\"\">He didn’t want his mother to look at him like that.</span></p><br/><p><span style=\"\">“Uh, mmm. I think it was caused by the Dungeon Shock. I was summoned to a planet named Alphen.”</span></p><br/><p><span style=\"\">If everything was like before, she wouldn’t have believed him. However, the world had gone through a change, and the impossible had become possible.</span></p><br/><p><span style=\"\">“All right. What did you do over there?”</span></p><br/><p><span style=\"\">How should he explain this? Woojin thought about it, and he opened his mouth after he ordered his thoughts.</span></p><br/><p><span style=\"\">“It wasn’t too dangerous. Ah. It was like a game . I leveled up some then I diligently hunted. I ordered around my summoned beings and I even participated in wars. However, mother shouldn’t worry too much about it. I used my summoned beings, so I just watched from far away.”</span></p><br/><p><span style=\"\">“…….”</span></p><br/><p><span style=\"\">At Woojin’s words, his mother’s expression stiffened.</span></p><br/><p><span style=\"\">“Hai-eego.(TLN:SFX, I guess it is like saying OMG) I was so worried about you , but you came back after playing some game?”</span></p><br/><p><span style=\"\">Huh? That’s not it.</span></p><br/><p></p></div><br/>\n</div>"}