{"title": "Chapter 34 Dungeon Reset (2).", "id": 34, "volume": 1, "url": "http://boxnovel.org/seoul-station%E2%80%99s-necromancer-chapter-34-dungeon-reset-2", "volume_title": "Volume 1", "body": "<h1>Chapter 34 Dungeon Reset (2).</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 34 Dungeon Reset (2).</strong></p><div class=\"innerContent fr-view\" id=\"chapterContent\"><br/><p><span style=\"\"><span style=\"\">Chapter 34 – Dungeon Reset (2)</span></span></p><br/><p><span style=\"\">(<span>TLN: Another sponsored chapter. Thank you again Gary. Please turn off the adblockers if you are able to)</span></span></p><br/><p><span style=\"\">“Can anyone attempt it?”</span></p><br/><p><span style=\"\">“What? No way. It is very dangerous to attempt a newly formed Dungeon. Usually the guild takes care of these kinds of jobs….”</span></p><br/><p><span style=\"\">“Does the guild have a monopoly over it?”</span></p><br/><p><span style=\"\">That wasn’t entirely true. There were autonomous Roused teams, and there were several instances where these teams were able to possess a Dungeon. However, most of the undisclosed Dungeons were taken by the guilds, who possessed Roused teams specialized in raiding Dungeons.</span></p><br/><p><span style=\"\">“Will I be able to attempt it or not?”</span></p><br/><p><span style=\"\">“…….”</span></p><br/><p><span style=\"\">Minchan thought about what he would say several times before he finally spoke.</span></p><br/><p><span style=\"\">“You will be able to. However, the opportunity will only be available after the Dungeon Energy is measured.”</span></p><br/><p><span style=\"\">“Jeez. Just give me an explanation without holding anything back.”</span></p><br/><p><span style=\"\">Minchan had no choice, but to answer him.</span></p><br/><p><span style=\"\">“After the Dungeon Energy is measured, there is a restriction by rank on who could attempt the Dungeon. If it is a 4 star then you have to be Rank C. If it is 5 stars then Rank B. Only an A rank had the right to attempt a 6 star.</span></p><br/><p><span style=\"\">Woojin had a interested expression on his face.</span></p><br/><p><span style=\"\">“Aren’t I a Rank C? Then I’ll have the qualification if the Dungeon turns out to be a 4 star. What’s next?”</span></p><br/><p><span style=\"\">“The Roused are given a chance depending on the order they arrive in. If the first challengers fails, only the teams with superior ranked forces are qualified to go next. If there are a lot of competitors, then the order is chosen through lottery.”</span></p><br/><p><span style=\"\">“Ho-oh?”</span></p><br/><p><span style=\"\">When he heard this, Woojin turned to Sunggoo.</span></p><br/><p><span style=\"\">“Let’s go Sunggoo!”</span></p><br/><p><span style=\"\">“Yes?”</span></p><br/><p><span style=\"\">“It’s first come, first served. Hurry up and run.”</span></p><br/><p><span style=\"\">“Yes, sir!”</span></p><br/><p><span style=\"\">Woojin cut across the intersection, and Sunggoo quickly followed after him.</span></p><br/><p><span style=\"\">“W…wait a moment.”</span></p><br/><p><span style=\"\">How could he be so reckless? The Dungeons weren’t a joke. How could he attempt a dungeon with no information…</span></p><br/><p><span style=\"\">“Uh? Now that I think about it…”</span></p><br/><p><span style=\"\">Didn’t he do that just yesterday? He went into a 4 star Dungeon without any information. The person running in front of his eyes had a clear time comparable to someone with information.</span></p><br/><p><span style=\"\">“Huh. Still….”</span></p><br/><p><span style=\"\">Woojin looked excited as he ran. He looked like a shopper attacking the food section of a mart during a close out sale.</span></p><br/><p><span style=\"\">“I don’t get why he is so excited.”</span></p><br/><p><span style=\"\">Jung-minchan shook his head from side to side. Kim-haemin laughed as he walked next to to Jung-minchan.</span></p><br/><p><span style=\"\">“Haha. Isn’t it entertaining to look at Mr. Woojin?”</span></p><br/><p><span style=\"\">“Yes. It seems he has no fear.”</span></p><br/><p><span style=\"\">“Eh. Maybe he has very little knowledge about the high rank Dungeons??”</span></p><br/><p><span style=\"\">“That….”</span></p><br/><p><span style=\"\">Minchan felt like it was the opposite. However, he decided not to voice his opinion. Didn’t Woojin register as a Roused only couple days ago? It hadn’t even been a week.</span></p><br/><p><span style=\"\">Jung-minchan’s intuition was talking to him. It was saying Woojin wasn’t attacking the Dungeons without knowing anything.</span></p><br/><p><span style=\"\">‘Where did a guy like that pop out from?’</span></p><br/><p><span style=\"\">He really was like a being from an unknown star. For the past couple days, this person was firmly entrenched inside Jung-minchan’s head. Other Roused didn’t even catch his eyes.</span></p><br/><p><span style=\"\">He was pouring all of his effort in scouting only Kang-woojin.</span></p><br/><p><span style=\"\">*</span></p><br/><p><span style=\"\">The Seoul National University station’s 6th exit was very busy from people coming and going. The Dungeon Reset always starts because someone had died.</span></p><br/><p><span style=\"\">“Aigo. Junggook hyung-nim.”</span></p><br/><p><span style=\"\">In front of the Dungeon, a manager of a team was crying out loud. It seemed his team had been raiding the Dungeon, and they had been wiped out. The sadness seemed to be isolated. The public employees dispatched by the Management Bureau were busily moving around.</span></p><br/><p><span style=\"\">A truck with Dungeon Management Bureau mark drove up. After an introduction, the truck was directed towards the Dungeon entrance.</span></p><br/><p><span style=\"\">After parking the rear of the truck near the entrance, the truck’s roof opened up. A satellite antenna looking machine was revealed from the inside.</span></p><br/><p><span style=\"\">“It is a Dungeon Energy measuring instrument. One can find out the general size of the Dungeon with it.”</span></p><br/><p><span style=\"\">He didn’t know when Jung-minchan had caught up, but he gave a polite explanation from next to Woojin.</span></p><br/><p><span style=\"\">“You will be able to go in if it is a 4 star.”</span></p><br/><p><span style=\"\">“Did you write down your name on the registry?”</span></p><br/><p><span style=\"\">“I did.”</span></p><br/><p><span style=\"\">Woojin had already written his name in the application registry being held by the Dungeon Management Bureau employee. He wast he first one to do so.</span></p><br/><p><span style=\"\">“If it’s 4 star or below then it is mine.”</span></p><br/><p><span style=\"\">“Ha ha. It will be yours by regulation, but I would recommend taking a team of Roused…. Our Hammer guild has many capable Roused who will be able to keep pace with you. If you join our guild, we could even make you a leader of a team..”</span></p><br/><p><span style=\"\">“Ah, I already have one underling.”</span></p><br/><p><span style=\"\">“…?”</span></p><br/><p><span style=\"\">Woojin focused his gaze on the monitor attached next to the machine.</span></p><br/><p><span style=\"\">812837128</span></p><br/><p><span style=\"\">The numbers repeatedly fluctuated up and down, and it made one’s eyes dizzy.</span></p><br/><p><span style=\"\">“Bloodstones worth about 50 thousand dollars is used to operate it once.”</span></p><br/><p><span style=\"\">“Huh. It uses a filthy amount of it.”</span></p><br/><p><span style=\"\">“Yes. There are smaller energy measuring equipment, and it is used to measure the energy of all the high rank Roused.”</span></p><br/><p><span style=\"\">Woojin’s head turned towards Minchan.</span></p><br/><p><span style=\"\">“They didn’t use it to measure me.”</span></p><br/><p><span style=\"\">“The measurement equipment can’t be used on all the Roused. One use expends $2000 worth of Bloodstones.”</span></p><br/><p><span style=\"\">“Bloodstone are used everywhere.”</span></p><br/><p><span style=\"\">“Please let us gather some of the data on your energy measurement next time. If I have the measured value then Woojin-nim could receive a Rank befitting your ability.”</span></p><br/><p><span style=\"\">“Well, maybe later.”</span></p><br/><p><span style=\"\">While he was talking with Minchan, the measuring equipment’s number was becoming fixed.</span></p><br/><p><span style=\"\">Bbi bbi, beeek.</span></p><br/><p><span style=\"\">The cutting edge machine that looked like a monster let out an analog sound as it yielded the result.</span></p><br/><p><span style=\"\">Rank 5 star.</span></p><br/><p><span style=\"\">Disappointment flashed through Woojin’s eyes. Minchan was relieved.If it was 4 star then the possibility of Woojin soloing the Dungeon would have been high.</span></p><br/><p><span style=\"\">Then Woojin’s worth would have been displayed to everyone here. There was a world of difference between the difficulty of clearing an already assaulted Mine, and an undisclosed Dungeon.</span></p><br/><p><span style=\"\">“Ooh-wah. It’s team Vermillion.”</span></p><br/><p><span style=\"\">“Huh? Where?”</span></p><br/><p><span style=\"\">One of the 4 great attack teams of the Hwarang guild showed up. When team Vermillion appeared, everyone’s attention became focused on them. The crowd of reporters in the area started to press their camera shutters to capture their image.</span></p><br/><p><span style=\"\">Lee-yunhwee was the leader, and she was a Rank A Roused. The rest of Vermillion team consisted of 10 people, and they were all Rank B Roused.</span></p><br/><p><span style=\"\">“Uh-ooh. It seems we will lose the Dungeon to the Hwarang.”</span></p><br/><p><span style=\"\">“Chet. We can’t do anything about it.”</span></p><br/><p><span style=\"\">The Reset Dungeon was a first come, first served in its order of opportunity given. This was why the Guild headquarters, and their offices were located near the subway stations.</span></p><br/><p><span style=\"\">The Hammer guild’s headquarters was only 2 stations down from the Sahdahng station. As it so happens, Team Vermillion was nearby, so the they were the first to arrive.</span></p><br/><p><span style=\"\">Even a broadcasting van had suddenly showed up, and they were filming the Vermillion team. There were still a lot of interest in the formation of new Dungeons, and the first attack on a Dungeon.</span></p><br/><p><span style=\"\">If the attack fails, the Dungeon would soon become the seed for destruction.</span></p><br/><p><span style=\"\">“Yes. I am here at the newly Reset Seoul National University Station’s 6th exit. Hwarang guild’s Vermillon team is getting ready to…”</span></p><br/><p><span style=\"\">The announcer spoke a prepared statement towards the camera. Sunggoo was watching them when he felt a chill. He turned his head around.</span></p><br/><p><span style=\"\">“Uh? Where did Woojin hyung-nim go?”</span></p><br/><p><span style=\"\">Sunggoo started looking around. Minchan became surprised, and he also started to look around his surrounding. Woojin wasn’t too far away. He was snooping around with an curiosity-filled expression on his face.</span></p><br/><p><span style=\"\">“Eee-yah. So this is a measurement equipment?”</span></p><br/><p><span style=\"\">“Please don’t get close to it.”</span></p><br/><p><span style=\"\">“Please get out the way. You will get hurt.”</span></p><br/><p><span style=\"\">“Ah. I just want to look at it. Let me look at it.”</span></p><br/><p><span style=\"\">The public employee in charge of the Dungeon Energy measurement equipment was irritated by Woojin. During all of this, the security personnel ran in to separate Woojin from the machine.</span></p><br/><p><span style=\"\">“Uh uh? Stop pushing me.”</span></p><br/><p><span style=\"\">The security personnel’s hands pushed against Woojin, and he didn’t resist against it. He stumbled and he fell. Then he rolled down the stairway of the Dungeon’s entrance.</span></p><br/><p><span style=\"\">“Uh uh?”</span></p><br/><p><span style=\"\">While the surrounding people was frozen in shock, Woojin kept rolling his body down into the Dungeon entrance, and he slipped through. The speed of the roll was way too fast to say it was a spontaneous accident….</span></p><br/><p><span style=\"\">‘D…did he purposefully break into it?’</span></p><br/><p><span style=\"\">Even Sunggoo didn’t know what to think. This was a 5 star Dungeon. No matter how much confidence Woojin had, he wouldn’t be reckless enough to solo a 5 star Dungeon.</span></p><br/><p><span style=\"\">“This is serious! Someone went in.”</span></p><br/><p><span style=\"\">“It’s a scoop!”</span></p><br/><p><span style=\"\">The reporters, and the cameras used for broadcasting immediately filmed the entrance of the Dungeon.</span></p><br/><p><span style=\"\">“This is terrible. There was an accident where a person fell into the Dungeon by accident. An unprecedented event has happened. Currently, we are trying to ascertain the identity of the Roused, and more information is coming in….”</span></p><br/><p><span style=\"\">Sunggoo, Minchan and Haemin were all frozen, and they were looking at the Dungeon entrance with despairing gazes.</span></p><br/><p><span style=\"\">“Hul.”</span></p><br/><p><span style=\"\">Sunggoo made a sound as if he was dumbfounded. Minchan and Haemin sighed as if they had bee unfrozen from ice.</span></p><br/><p><span style=\"\">“Team leader. Isn’t it impossible for Mr Woojin to solo a 5 star Dungeon by himself?”</span></p><br/><p><span style=\"\">“Whew. Even a Rank A Roused have a hard time soloing a 5 star Dungeon….”</span></p><br/><p><span style=\"\">The highest measured Dungeon to date were 6 star Dungeons.</span></p><br/><p><span style=\"\">Those Dungeons didn’t reset often. Even if it did, the guilds and the government pulled all their resources together. They would attempt it after making a team of the best Roused in the country.</span></p><br/><p><span style=\"\">At that point, it wasn’t just a Dungeon. It was a life and death battle to prevent a catastrophe. Still, there were numerous instances where the Dungeon Break of the 6 star Dungeons couldn’t be prevented.</span></p><br/><p><span style=\"\">Realistically, the 5 star Dungeons were the highest rank Dungeons a guild could monopolized.</span></p><br/><p><span style=\"\">Any Dungeons with Artifacts had a different degree of danger when one faced the monsters.</span></p><br/><p><span style=\"\">The minimum rank to attempt it was Rank B. Normally an A Rank leader takes a B rank team to attempt this type of a Dungeon. Basically, the elite teams of the guilds attempted it.</span></p><br/><p><span style=\"\">There were only two successfully attacked 6 star Mines in Seoul. Moreover, there were only eight 5 star Dungeons.</span></p><br/><p><span style=\"\">Even the Vermillion team became nervous before attacking a 5 star Dungeon yet one Roused went into the Dungeon by accident?</span></p><br/><p><span style=\"\">He was 100% dead.</span></p><br/><p><span style=\"\">The Vermillion’ leader, Lee-yunhwee frowned.</span></p><br/><p><span style=\"\">“Chet. It’s just a delay. We’ll be able to enter soon, so be ready. Don’t relax yet.”</span></p><br/><p><span style=\"\">“Yes, team leader.”</span></p><br/><p><span style=\"\">There was only one reason why a barrier would re-open again. It happened when the Roused, who entered, died.</span></p><br/><p><span style=\"\">Lee-yunhwee thought this would happen after a brief amount of time.</span></p><br/><p><span style=\"\">Sunggoo felt the sky turn yellow when he thought about Woojin dying.</span></p><br/><p><span style=\"\">“H…hyung-nim….”</span></p><br/><p><span style=\"\">Everyone thought the barrier would disintegrate after a brief moment, but the barrier was still being maintained. Lunch passed by, and it was time for dinner. Then the sun descended, and the barrier hadn’t disappeared yet.</span></p><br/><p><span style=\"\">*</span></p><br/><p><span style=\"\">“Uh? It’s Woojin oppa.”</span></p><br/><p><span style=\"\">Soongmi’s eyes turned round as she watched the tv. Suddenly, Woojin oppa’s face was plastered all over the news.</span></p><br/><p><span style=\"\">“Heh heh. He’s so handsome. Uh uh?”</span></p><br/><p><span style=\"\">Soongmi was fawning over Woojin’s appearance when she finally was aghast at the content of the news. She ran into the kitchen.</span></p><br/><p><span style=\"\">“Madam! Something terrible had happened. Woojin oppa fell into a Dungeon.”</span></p><br/><p><span style=\"\">“What are you talking about?”</span></p><br/><p><span style=\"\">“Eeeeng? Mrs. Lee’s son fell in?”</span></p><br/><p><span style=\"\">The kitchen ladies ran as if they were were on fire, and they all directed their gaze towards the tv. The news were replaying a video taken by someone’s hand phone. Woojin was having an argument near the Dungeon entrance. He was pushed by the security personnel, and he rolled down the stairs of the Dungeon. The news kept replaying the video.</span></p><br/><p><span style=\"\">[Victim Mr Kang was a Rank C Roused, and he has experienced a Dungeon only 4 times…. However, it has been 8 hours since he first entered the Dungeon. This means 32 hours has passed inside the Dungeon. All the experts agree this is close to a miracle… The Roused Mr Kang will soon reach his limit…]</span></p><br/><p><span style=\"\">Lee-soogyong lost the strength in her legs as she watched the news. She plopped down on the floor.</span></p><br/><p><span style=\"\">“W…Woojin.”</span></p><br/><p><span style=\"\">“Aigo. What are you going to do, Mrs. Lee.”</span></p><br/><p><span style=\"\">“Why would he go to such a dangerous place…”</span></p><br/><p><span style=\"\">She couldn’t hear her fellow ladies’ comforting words, or Soongmi sobbing. Sadness welled up inside Lee-soogyong, and it felt like she couldn’t breath.</span></p><br/><p><span style=\"\">“Woojin’s father. Please look over our Woojin. Please.”</span></p><br/><p><span style=\"\">Lee-soogyong let out tears filled with sadness, and the atmosphere inside the restaurant became heavy.</span></p><br/><p><span style=\"\">*</span></p><br/><p><span style=\"\">*The scene of the accident at the Seoul National University Station’s 6th exit*</span></p><br/><p><span style=\"\">The barrier was activated over 9 hr and 12 mins ago. The Vermillion team, several employees from the Hwarang guild, reporters from the news station and several bystanders were still present near the Dungeon.</span></p><br/><p><span style=\"\">Minchan, Sunggoo and Haemin were identified as Woojin’s companion, so they were allowed to wait near the Dungeon Entrance. They were monitored as they waited for Woojin.</span></p><br/><p><span style=\"\">“Ah. He is surviving for an annoyingly long time. He should just give up now.”</span></p><br/><p><span style=\"\">Someone from the Vermillion team spoke up, and Sunggoo got angry.</span></p><br/><p><span style=\"\">“He isn’t just surviving! My hyung-nim is in the process of conquering it!”</span></p><br/><p><span style=\"\">“Huh. That son of a bitch is Rank C, so how would he conquer it? He is probably hiding as he barely extends his life line.”</span></p><br/><p><span style=\"\">Sunggoo was about to stand up, but Minchan held Sunggoo back.</span></p><br/><p><span style=\"\">“Endure it, Mr Sunggoo.”</span></p><br/><p><span style=\"\">“He is recklessly speaking when he has no idea what he is talking about.”</span></p><br/><p><span style=\"\">“We will keep faith as we wait for him.”</span></p><br/><p><span style=\"\">“Whew.”</span></p><br/><p><span style=\"\">“Mr. Sunggoo should know since you’ve seen him in action? Is it possible for him to do this?”</span></p><br/><p><span style=\"\">“Of course.”</span></p><br/><p><span style=\"\">Sunggo was filled with conviction. Woojin hadn’t even been pushed hard in the 4 star Dungeon. Woojin was thrown into a Dungeon without any preparation, but he had his sub-dimension.</span></p><br/><p><span style=\"\">“Please talk to us a little bit. What is Mr. Woojin’s ability? It says on the file he could only summon a single Skeleton….”</span></p><br/><p><span style=\"\">“I can’t tell you anything.”</span></p><br/><p><span style=\"\">Sunggoo clamped his mouth shut, and Minchan clicked his tongue inside. This young man was very stubborn. He had stealthily asked Sunggoo some questions, but Sunggoo wouldn’t tell him anything.</span></p><br/><p><span style=\"\">“Let’s have dinner.”</span></p><br/><p><span style=\"\">It was already late, and they were hungry. The jajangmyun was delivered to them. When Sunggoo received the food, his eyes suddenly misted up.</span></p><br/><p><span style=\"\">‘Hyung-nim is having a hard time inside, but I’m here…’</span></p><br/><p><span style=\"\">“Mr. Sunggoo. Eat. Let’s eat then wait. The average capture time of a new 5 star Dungeon is 12 hours.”</span></p><br/><p><span style=\"\">It would be two days worth of time inside the Dungeon. Moreover, Woojin might take longer than the average time. If he failed, they wouldn’t be able to see him ever again…</span></p><br/><p><span style=\"\">He felt guilty, but he couldn’t help being hungry. Sunggoo ripped open the seran wrap on the jajangmyun, then he stirred it around.</span></p><br/><p><span style=\"\">It happened when he put the chopstick to his mouth.</span></p><br/><p><span style=\"\">Choo-choo-choot.</span></p><br/><p><span style=\"\">The barrier disappeared, and Woojin popped out. He was walking up the stairs.</span></p><br/><p><span style=\"\">“Ooh-uhng, Uhhng-nim.”</span></p><br/><p><span style=\"\">Sunggoo wasn’t chewing the jajangmyung nor was he spitting it out. Woojin grinned when he saw this.</span></p><br/><p><span style=\"\">“Did you also order mine ?”</span></p><br/><p><span style=\"\">“Ooh-ung ooh-ung.”</span></p><br/><p><span style=\"\">Sunggoo forcefully swallowed the jajangmyun, then he ran towards Woojin. All the cameras were focused on Woojin.</span></p><br/><p></p></div><br/>\n</div>"}