{"title": "Chapter 41 - Hot Issue", "id": 41, "volume": 1, "url": "http://boxnovel.org/seoul-station%E2%80%99s-necromancer-chapter-41-hot-issue", "volume_title": "Volume 1", "body": "<h1>Chapter 41 - Hot Issue</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 41 Hot Issue.</strong></p><div class=\"innerContent fr-view\" id=\"chapterContent\"><br/><p><span style=\"\">Chapter 41 – Hot Issue</span></p><br/><p><span style=\"\">(<span>TLN: This is a sponsored chapter. Thank you for the donation John. As I have said in a previous post, I am getting bombarded with bot comments, so I’ll have to manually approve comments for first time commenters. So don’t be alarmed if your comment doesn’t show up immediately. Please turn off the adblockers if you are able to. Thanks and enjoy~)</span></span></p><br/><p><span style=\"\">“Uh uh? The barrier is disappearing.”</span></p><br/><p><span style=\"\">“What? That’s crazy talk?”</span></p><br/><p><span style=\"\">The reporters gathered in front of the Seoul National University Station’s 6th exit was surprised when they saw the barrier start to disappear.</span></p><br/><p><span style=\"\">It takes an average time of about 8 hours to clear a 5 star Dungeon. However, Woojin and Sunggoo was showing up after entering the Dungeon for 4 hours.</span></p><br/><p><span style=\"\">Even if the time flowed 4 times faster in there, they had completed the Dungeon in about 16 hours.</span></p><br/><p><span style=\"\">“H…hurry up and write the article.”</span></p><br/><p><span style=\"\">“We’ll have to try to get an interview from him. Oh-wahh. What the heck is this?”</span></p><br/><p><span style=\"\">“Doesn’t this mean he is almost at Kim-gahngchul’s level?”</span></p><br/><p><span style=\"\">“Eh-ee. Still, you are comparing him to Kim-kahngchul.”</span></p><br/><p><span style=\"\">If one had to pick the greatest Roused of Korea, then everyone would say it was Kim-gahngchul.</span></p><br/><p><span style=\"\">“Still, his impact won’t be something to scoff at.”</span></p><br/><p><span style=\"\">“Yeah. Uh, they are coming out now.”</span></p><br/><p><span style=\"\">Surely there weren’t any Roused in Korea that was hotter than Woojin right now. He was the Roused who had cleared the 5 star Dungeon by himself.</span></p><br/><p><span style=\"\">He was still obscure since he is a new Rank A Roused, but there were a lot of controversy surrounding him.</span></p><br/><p><span style=\"\">Why didn’t he reveal his true Rank? What happened during 5 years he went missing? What ability did he have….etc.</span></p><br/><p><span style=\"\">Since not a lot was known about him, there were a lot of speculations, and the conversations were hot in the internet community.</span></p><br/><p><span style=\"\">It was the job of the reporters to reveal any information about the Roused Kang-woojin, who was hidden by a veil.</span></p><br/><p><span style=\"\">“Mr. Kang-woojin. Please do an interview with us.”</span></p><br/><p><span style=\"\">The reporters crowded in to get closer to Kang-woojin. He glared as he ascended the stairs.</span></p><br/><p><span style=\"\">“I’m not in a good mood. Why dont’ you get out of the way while I’m still being civil?”</span></p><br/><p><span style=\"\">His seething voice was fierce like the sound of a wild animal. The reporters flinched at his intimidating spirit, and they retreated to the back.</span></p><br/><p><span style=\"\">However, there were over 20 reporters gathered there. The reporter at the end of the line yelled out a question.</span></p><br/><p><span style=\"\">“Mr. Kahng-woojin. Please give us a statement.”</span></p><br/><p><span style=\"\">“…….”</span></p><br/><p><span style=\"\">Woojin stood still as he looked around to see the reporters. Wooin’s gaze came to a rest on a microphone placed right in front of his nose.</span></p><br/><p><span style=\"\">“Put that away.”</span></p><br/><p><span style=\"\">“…….”</span></p><br/><p><span style=\"\">After hearing his threatening voice, the reporter quietly lowered the microphone. Woojin glared at them, and the reporters all avoided his gaze.</span></p><br/><p><span style=\"\">‘Ooh. How can a person glare like that?’</span></p><br/><p><span style=\"\">Woojin started walking away, and the atmosphere deterred the reporters from talking to him again. The reporters latched on to Sunggoo, who was walking despondently towards them.</span></p><br/><p><span style=\"\">“Mr. Hong-sunggoo. You are Mr. Kang-woojin’s only team mate. How did you guys meet?”</span></p><br/><p><span style=\"\">“There are people who are comparing Mr. Kang-woojin and Mr. Kim-gangchul. Who do you think is stronger?”</span></p><br/><p><span style=\"\">At the rapid succession of questions by the reporters, Sunggoo uncharacteristically got mad.</span></p><br/><p><span style=\"\">“Are you guys taking this a little too far? Do you think a Dungeon is a playground. We came back alive, and when he just started to breathe the air of earth, you guys are pushing the cameras in our face?”</span></p><br/><p><span style=\"\">“…….”</span></p><br/><p><span style=\"\">When the reporters didn’t’ say anything, Sunggoo became more irate, and he started yelling.</span></p><br/><p><span style=\"\">“Do you do this to other teams? Do you think we are that easy to deal with?”</span></p><br/><p><span style=\"\">The reporters covered them since they had been easy to deal with. The other large guild’s teams wouldn’t allow the reporters to rush them in the first place. The Support teams blocked the reporters as a matter of course.</span></p><br/><p><span style=\"\">“Please get out of the way..”</span></p><br/><p><span style=\"\">Sunggoo escaped from the grasp of the reporters. Woojin had already walked a fair distance away. Sunggo ran, and he fell in behind Woojin.</span></p><br/><p><span style=\"\">“Hyung-nim. I’m sorry about before.”</span></p><br/><p><span style=\"\">“Hey.”</span></p><br/><p><span style=\"\">“Yes.”</span></p><br/><p><span style=\"\">“Enough. That’s enough.”</span></p><br/><p><span style=\"\">“Yes, hyung-nim.”</span></p><br/><p><span style=\"\">“You have to act in moderation or they won’t see you in a favorable light. Weren’t you a little bit to heavy handed?”</span></p><br/><p><span style=\"\">“I’ll be careful.”</span></p><br/><p><span style=\"\">Woojin grinned when he heard Sunggo’s depressed voice. He thought Sunggoo was too innocent. He guessed it would have been more strange if Sunggoo had been fine after he came face to face with death.</span></p><br/><p><span style=\"\">How much hardship had Woojin gone through at Planet Alphen?</span></p><br/><p><span style=\"\">“You are a man…. Put your chest out, dude.”</span></p><br/><p><span style=\"\">“Yes, sir.”</span></p><br/><p><span style=\"\">“Be brave. You were only cussed out a little bit. You don’t have put on a martyred expression.”</span></p><br/><p><span style=\"\">Ah, this was unfair. He was hearing such words from the actual culprit who had berated him.</span></p><br/><p><span style=\"\">However, Sunggoo was still strangely comforted by his words.</span></p><br/><p><span style=\"\">“Yes, sir!”</span></p><br/><p><span style=\"\">“Dude. Then let’s go.”</span></p><br/><p><span style=\"\">Woojin got into Sunggoo’s car, then he made a call to Kim-haemin.</span></p><br/><p><span style=\"\">[Mr. Woojin. No. President. You’ve already come out?]</span></p><br/><p><span style=\"\">“What are you doing right now? Where is team leader Jung?”</span></p><br/><p><span style=\"\">[Team leader went home after he finalized the contract for an office. He went home to make a final inspection on the documents he will submit tomorrow….]</span></p><br/><p><span style=\"\">“You guys already acquired an office?”</span></p><br/><p><span style=\"\">[Yes. Do you want to see it?]</span></p><br/><p><span style=\"\">What’s the point of seeing it right now? He just wanted to rest today.</span></p><br/><p><span style=\"\">“I’ll see you tomorrow. Just give me the address.”</span></p><br/><p><span style=\"\">[Yes, sir. I’ll immediately send you a text]</span></p><br/><p><span style=\"\">When Woojin’s phone call ended, a text arrived. He pressed the address, and the Maps app opened to indicate where it was located at.</span></p><br/><p><span style=\"\">“It’s close.”</span></p><br/><p><span style=\"\">At Woojin’s words, Sunggoo snuck a question in.</span></p><br/><p><span style=\"\">“Isn’t this too much like a declaration of war against the Hammer guild??”</span></p><br/><p><span style=\"\">“Why?”</span></p><br/><p><span style=\"\">“If our headquarters are close, then we would be in direct competitions with them..”</span></p><br/><p><span style=\"\">When a Dungeon Reset happens, the raid opportunity is given to the very first team who arrives. If one’s headquarter is close, then one will have a higher chance of arriving first.</span></p><br/><p><span style=\"\">It was natural for the competition to become intense for nearby companies.</span></p><br/><p><span style=\"\">The large guilds were called the Korea’s 3 great guild. Everyone stayed far away from them.</span></p><br/><p><span style=\"\">KH was located at Gangbuk. Hwarang was at Inchun, and Hammer was at Gangnam. Even the medium-sized guild stayed a good distance away from their territory. This was how the large guilds kept an advantage over their competitors.</span></p><br/><p><span style=\"\">“So what? It isn’t like we want to fight them. Aren’t we just trying to keep our options open?”</span></p><br/><p><span style=\"\">“I guess so….”</span></p><br/><p><span style=\"\">Initially, they had established the guild to avoid joining the army. However, the Hammer guild wouldn’t see it like that…</span></p><br/><p><span style=\"\">Jaemin’s house was only two station’s away, so he arrived at the house in no time.</span></p><br/><p><span style=\"\">“I’ll see you tomorrow at the office.”</span></p><br/><p><span style=\"\">“Yes, hyung. Please head in.”</span></p><br/><p><span style=\"\">“All right.”</span></p><br/><p><span style=\"\">“Excuse me, hyung-nim.”</span></p><br/><p><span style=\"\">“What?”</span></p><br/><p><span style=\"\">“Thank you very much for saving me..”</span></p><br/><p><span style=\"\">“No problem, man.”</span></p><br/><p><span style=\"\">Woojin waved his hand then he headed towards Jaemin’s house.</span></p><br/><p><span style=\"\">*</span></p><br/><p><span style=\"\">Woojin opened the door to come in. It seemed Jaemin was still at his tutoring school, and he wasn’t back yet.</span></p><br/><p><span style=\"\">“Nyahh. Master has become a lot stronger again-ahong.”</span></p><br/><p><span style=\"\">Woojin grinned at Bibi, who always greeted him.</span></p><br/><p><span style=\"\">“Bibi. Do you remember Trahnet’s underlings?”</span></p><br/><p><span style=\"\">“Nyahng? What about those monsters-nyahng?”</span></p><br/><p><span style=\"\">“I was thinking about it. Let’s say these damn Dungeons were created by Trahnet to attack Earth. I understand those bastards are trying to make something like a Dimensional Tunnel. However, why haven’t we seen any signs of Trahnet’s underling?”</span></p><br/><p><span style=\"\">“Nyahk. There was that time-nyahng.”</span></p><br/><p><span style=\"\">The Rakwi and Drabbits were all low rank monsters. It was hard to call them as being part of Trahnet’s army. They were wild animals that usually showed up near Trahnet’s territory. Maybe they could be considered to be tool used by him.</span></p><br/><p><span style=\"\">“I meant that bastard’s real underlings.”</span></p><br/><p><span style=\"\">He wasn’t talking about the low rank monsters. If Trahnet’s real army showed up right now, it would be impossible for the Earth’s forces to stand in their way.</span></p><br/><p><span style=\"\">The 10 ballyhooed rank A Roused of Korea only possessed ability akin to level 60.</span></p><br/><p><span style=\"\">They were on the same class as a 6th Circle Magician.</span></p><br/><p><span style=\"\">They would have made some waves with that level of power on Planet Alphen, but it was insufficient when facing Trahnet.</span></p><br/><p><span style=\"\">“Nyahhng. Maybe they are still short on power-nyahng?”</span></p><br/><p><span style=\"\">“Power?”</span></p><br/><p><span style=\"\">“Look at me-nyahng. I can’t materialize my true body on earth, and I’m stuck in this state-nyahng. Myabe they can’t materialize on earth yet-nyahng?”</span></p><br/><p><span style=\"\">Woojin suddenly had a thought as a light-bulb went off in his head.</span></p><br/><p><span style=\"\">“Those bastards don’t have enough power to materialize on earth?”</span></p><br/><p><span style=\"\">“Nyahng. I think so-ahong??“</span></p><br/><p><span style=\"\">That seemed likely. No, it must be true. If not, why wouldn’t they actively attack?</span></p><br/><p><span style=\"\">“Those bastards are sending the Anthropomorphic races they had captured or enslaved as the advance troops.”</span></p><br/><p><span style=\"\">They were using the Dungeon and the Dungeon Break. This might mean the humans of Alphen might really come over to earth. From the perspective of people living on earth, they might be viewed as beings of the same race.</span></p><br/><p><span style=\"\">“Uh? Why does the Dungeon Break always happen on the 30th days?</span></p><br/><p><span style=\"\">“Nyahhn. Maybe it’s that-nyahng?”</span></p><br/><p><span style=\"\">“What do you mean?”</span></p><br/><p><span style=\"\">“Trahnet’s army always seemed to be reinforced each month-nyahng.”</span></p><br/><p><span style=\"\">“…!”</span></p><br/><p><span style=\"\">“Master said so before-nyahng. The bastards only come out on their payday-nyahng.”</span></p><br/><p><span style=\"\">“Yes. I did say that.”</span></p><br/><p><span style=\"\">Bibi had the face of a cat, but she spoke in a serious manner.</span></p><br/><p><span style=\"\">“The one thing for sure is Trahnet’s smell will get stronger as the Dungeon Break keeps happening-ahong.”</span></p><br/><p><span style=\"\">That sounded like trouble. The humans of earth couldn’t face Trahnet’s army yet. Earth will probably succumb to Trahnet more helplessly than Alphen.</span></p><br/><p><span style=\"\">If he could get rid of the Dungeon itself then it would be great. However, he couldn’t come up with a good idea. It felt like there should be a good solution to this.</span></p><br/><p><span style=\"\">“Oh yeah. If you return to the Summoning room, Dolsae should also be there.”(TLN: Dolsae= Rock Iron)</span></p><br/><p><span style=\"\">“Nyahng? Really-ahong?”</span></p><br/><p><span style=\"\">Woojin’s second family member.</span></p><br/><p><span style=\"\">Bibi was very happy at the Golem Dolsae’s appearance.</span></p><br/><p><span style=\"\">“Nyahng. I’m so happy-nahohng. Can I go play with Dolsae inside the Summoning room?”</span></p><br/><p><span style=\"\">“All right.”</span></p><br/><p><span style=\"\">“Yah-ohng. When you go to a Dungeon next time, please call me out-ahong.”</span></p><br/><p><span style=\"\">“Ok. I understand.”</span></p><br/><p><span style=\"\">Soo-soo-sook.</span></p><br/><p><span style=\"\">It seemed Bibi was happy at Dolsae’s appearance. She quickly disappeared as she turned into black smoke.</span></p><br/><p><span style=\"\">“Mmmm. Then should I start studying about the society?”</span></p><br/><p><span style=\"\">Woojin found the remote control, then he turned on the tv. Then he started writing a text to Jaemin.</span></p><br/><p><span style=\"\">[Buy me one bag of tangerine when you come.]</span></p><br/><p><span style=\"\">Ddi-ring.</span></p><br/><p><span style=\"\">It took less than 10 seconds before a reply came.</span></p><br/><p><span style=\"\">[I’m almost home.]</span></p><br/><p><span style=\"\">“Uh?”</span></p><br/><p><span style=\"\">Before Woojin could respond, the front door opened.</span></p><br/><p><span style=\"\">Ddi, ddi, dii. Dddi-ro ri.</span></p><br/><p><span style=\"\">“Hey. Why don’t you go out and buy some for me?”</span></p><br/><p><span style=\"\">“Yes. Let me change my cloth first.”</span></p><br/><p><span style=\"\">“Uh?”</span></p><br/><p><span style=\"\">Woojin had a puzzled expression when he heard Jaemin’s obedient words.</span></p><br/><p><span style=\"\">“I’ll be back.”</span></p><br/><p><span style=\"\">Ddi-deek.</span></p><br/><p><span style=\"\">Jaemin put away his bag then he changed his clothes. As he watched Jaemin leave, Woojin spoke as he decided not to take out his wallet.</span></p><br/><p><span style=\"\">“He isn’t even going to ask me for money?”</span></p><br/><p><span style=\"\">Soon, Jaemin returned with a bag of tangerine, and he handed it over to Woojin.</span></p><br/><p><span style=\"\">“Hey. Did something bad happen in school? Is someone bothering you again?”</span></p><br/><p><span style=\"\">“No. Thanks to hyung I’m doing well. I want to thank you once again..”</span></p><br/><p><span style=\"\">Jaemin bowed his head. Woojin’s eyes turned round, because he wasn’t use to this Jaemin. Why was he being like this?</span></p><br/><p><span style=\"\">“Do you need some spending money?”</span></p><br/><p><span style=\"\">“No. The money hyung gave me last time should last awhile. I don’t need more spending money.”</span></p><br/><p><span style=\"\">“Huh. This guy. He’s being really serious today. How odd.”</span></p><br/><p><span style=\"\">“Well, I have to study now. It’s my testing period.”</span></p><br/><p><span style=\"\">“Uh, uh. You do that.”</span></p><br/><p><span style=\"\">When he saw Jaemin open his book after sitting in front of the desk, Woojin had a sour expression on his face. This kid suddenly turned very serious, and it bothered Woojin.</span></p><br/><p><span style=\"\">Woojin pressed his remote control, and he decreased the volume.</span></p><br/><p><span style=\"\">Jaemin had his book open, but he couldn’t concentrate. He wasn’t bothered by the sounds of the drama coming from tv or the sound of Woojin peeling the tangerine.</span></p><br/><p><span style=\"\">He felt a heavy feeling in his chest. It felt like he was suffocating.</span></p><br/><p><span style=\"\">“Ha-ah.”</span></p><br/><p><span style=\"\">Before he knew it, a sigh leaked out Woojin, and he called out to Jaemin.</span></p><br/><p><span style=\"\">“Well, what? What’s going on? Are you going through puberty?”</span></p><br/><p><span style=\"\">“It isn’t anything like that…….”</span></p><br/><p><span style=\"\">Jaemin’s face was filled with worry. He looked like he was holding the burden of the whole world on his back.</span></p><br/><p><span style=\"\">Woojin called out as he clicked his tongue.</span></p><br/><p><span style=\"\">“Dude. Just hurry up and tell me. Stop sighing and just talk.”</span></p><br/><p><span style=\"\">“…….”</span></p><br/><p><span style=\"\">At Woojin’s word, Jaemin closed his book, then he sat down heavily next to Woojin.</span></p><br/><p><span style=\"\">“Hyung.”</span></p><br/><p><span style=\"\">“Yeah.”</span></p><br/><p><span style=\"\">Woojin turned off the drama. Jaemin bit his lips several times, and he was barely able to find his tongue.</span></p><br/><p><span style=\"\">“Do you remember the time I told you about my dream?”</span></p><br/><p><span style=\"\">“Uh, what. Do you mean you wanting to join a guild?”</span></p><br/><p><span style=\"\">“Yes.”</span></p><br/><p><span style=\"\">“I do. You said you want to make a lot of money.”</span></p><br/><p><span style=\"\">Woojin remembered what Jaemin had said. Jaemin bolstered his nerve, then he continued to speak.</span></p><br/><p><span style=\"\">“Hyung’s story is all over the place recently. In the past, I didn’t know hyung was such a great person.”</span></p><br/><p><span style=\"\">He extorted a high school…. No, he gave the money back. Anyways, Woojin had borrowed money for transportation, and Woojin didn’t have a place to live so he was living at his house. It would have been weirder if he had thought Woojin was a great person.</span></p><br/><p><span style=\"\">“So what? Are you sulking because I didn’t tell you?”</span></p><br/><p><span style=\"\">“No. I heard hyung-nim is making a guild….”</span></p><br/><p><span style=\"\">Woojin secretly smiled.</span></p><br/><p><span style=\"\">“Ah. So that’s what it was. Do you want me to give you a spot in my guild? Hey. I was already going to add you in, but I was told under-age kids can’t join a guild. Dude. Were you disappointed?”</span></p><br/><p><span style=\"\">“No.”</span></p><br/><p><span style=\"\">He wasn’t disappointed. However…….</span></p><br/><p><span style=\"\">“My dream is to get a job at the Korea’s 3 great guild. Then I would have a higher probability of obtaining that medicine. I am studying hard for that dream.”</span></p><br/><p><span style=\"\">“Medicine?”</span></p><br/><p><span style=\"\">“It isn’t something one can purchase with money. It is given when you distinguish yourself in a guild…”</span></p><br/><p><span style=\"\">“What kind of medicine.?”</span></p><br/><p><span style=\"\">“It’s the Regeneration Salve..”</span></p><br/><p><span style=\"\">“Ah. For your noonah?”</span></p><br/><p><span style=\"\">“…….”</span></p><br/><p><span style=\"\">Jaemin clenched his mouth shut.</span></p><br/><p><span style=\"\">Recently, he searched Woojin’s name on the internet when he was bored. Woojin was being compared to Kim-kangchul…</span></p><br/><p><span style=\"\">Will it be possible?</span></p><br/><p><span style=\"\">However, he couldn’t…. He wasn’t shameless enough to ask him for it.</span></p><br/><p><span style=\"\">Gga-ddok, gga-dok.</span></p><br/><p><span style=\"\">Jaemin’s hand phone rang just in time, and the awkward atmosphere was dispelled.</span></p><br/><p><span style=\"\">“Hyung. I have to go out for a moment.”</span></p><br/><p><span style=\"\">“Y…you do that.”</span></p><br/><p><span style=\"\">Jaemin hurriedly put on his coat, and he left. Woojin grinned.</span></p><br/><p><span style=\"\">“That guy needs to grow a pair.”</span></p><br/><p><span style=\"\">Jaemin always studied hard. It seemed money wasn’t the reason why he wanted to be hired by a guild. It was all for his noonah. Currently, his noonah was working hard for her brother….</span></p><br/><p><span style=\"\">He thought they were a very loving brother and sister.</span></p><br/><p><span style=\"\">“If he wanted to make a request, then he just needs to spit it out.”</span></p><br/><p><span style=\"\">Woojin laughed, then he opened his Point Store.</span></p><br/><p></p></div><br/>\n</div>"}