{"title": "Chapter 56 - Director Hong-sunggoo", "id": 56, "volume": 1, "url": "http://boxnovel.org/seoul-station%E2%80%99s-necromancer-chapter-56-director-hong-sunggoo", "volume_title": "Volume 1", "body": "<h1>Chapter 56 - Director Hong-sunggoo</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 56 Director Hong-sunggoo.</strong></p><div class=\"innerContent fr-view\" id=\"chapterContent\"><br/><p><span style=\"\">Chapter 56 – Director Hong-sunggoo</span></p><br/><p><span style=\"\">(<span>TLN: This is the regular chapter for next week. I’m releasing it a day early. I’ll try to have Dragon Maken next week. Please turn off the adblockers if you are able to. Thanks and enjoy~)</span></span></p><br/><p><span style=\"\">The altar for the goddess Aria was made.</span></p><br/><p><span style=\"\">Earth’s sculpting techniques were amazing, so the sculpture described by Melody was completed within a day.</span></p><br/><p><span style=\"\">Melody prayed every day in front of the goddess’ marble statue.</span></p><br/><p><span style=\"\">Hamilton quietly approached her.</span></p><br/><p><span style=\"\">She didn’t need the wheel chair anymore. If she wanted to go somewhere, her two legs were good enough to get her there.</span></p><br/><p><span style=\"\">She was a doctor of psychology. She had always believed in the will of a person. However, she had become a fervent believer of the goddess now.</span></p><br/><p><span style=\"\">“Holy Maiden. The guild master is here for a visit.”</span></p><br/><p><span style=\"\">[Understood.]</span></p><br/><p><span style=\"\">When she heard Hamilton’s polite words, Melody spoke as she got up from her knees. She still borrowed her goddess’ voice to communicate with others.</span></p><br/><p><span style=\"\">If a person didn’t accept and believe the goddess Aria, one couldn’t communicate or receive miracles from Melody. One wouldn’t be able to receive her blessing.</span></p><br/><p><span style=\"\">Melody gently smiled as she looked at Hamilton.</span></p><br/><p><span style=\"\">[In the near future, the goddess’ blessing will be with you.]</span></p><br/><p><span style=\"\">“Oh, good heavens. Thank you very much.”</span></p><br/><p><span style=\"\">Hamilton’s body shook. She followed behind Melody with a deeply moved expression on her face. She healed those fallen in despair. The members of the Aria church couldn’t be more proud of being a believer.</span></p><br/><p><span style=\"\">There were many people who wanted to be saved. When a real god appeared, people gathered like clouds. They wanted to help in forming this ‘power’.</span></p><br/><p><span style=\"\">Melody headed towards the reception room.</span></p><br/><p><span style=\"\">Melody, the Holy Maiden of goddess Aria from Alphen, was surprised by the civilization and the items they possessed. She needed time to get used to this place, and she also needed the time to get ready.</span></p><br/><p><span style=\"\">The Titan guild was actively supporting her. In return, she shared her holy powers, and she also shared her foresight with them.</span></p><br/><p><span style=\"\">When Melody arrived at the reception room, Titan guild master Deaon and his secretary got up from their seats.</span></p><br/><p><span style=\"\">“Please observe good manners towards the Holy Maiden.”</span></p><br/><p><span style=\"\">“…….”</span></p><br/><p><span style=\"\">After Hamilton spoke, Deacon approached Melody then he got on one knee. When Melody raised her hand, Deacon kissed the back of her hand. The blonde secretary also did the same gesture. Melody only smiled after this gesture was finished.</span></p><br/><p><span style=\"\">[You were looking for me?]</span></p><br/><p><span style=\"\">Her words were heard by Deacon and the secretary.</span></p><br/><p><span style=\"\">Whether they were or weren’t part of the Aria church, it was hard not to believe in the existence of the goddess Aria when miracles were performed in front of their eyes.</span></p><br/><p><span style=\"\">Deacon spoke.</span></p><br/><p><span style=\"\">“Yes. I have to speak to you about the Aria’s Holy Knight Order.”</span></p><br/><p><span style=\"\">[Have you thought about it?]</span></p><br/><p><span style=\"\">Unlike the haughty way she asked her question, there was an excitement in her voice. There was even a smile forming on her haughty face as she anticipated with much pleasure.</span></p><br/><p><span style=\"\">“I’ll help you assemble Holy Knight Order including letting those within the guild volunteer to join it. ”</span></p><br/><p><span style=\"\">[The goddess will be happy.]</span></p><br/><p><span style=\"\">There weren’t even a hint of thankfulness in her words. She said it in a way as if she expected such deeds to be done in the goddess’ name.</span></p><br/><p><span style=\"\">Deacon didn’t like that fact.</span></p><br/><p><span style=\"\">He wasn’t part of the Aria church, yet she was trying to make him into a servant, who works for the goddess Aria. He wasn’t sure if this was Melody’s doing or if it really was the will of the goddess she worshiped.</span></p><br/><p><span style=\"\">If he was going to concede something, then he expected a compensation in return.</span></p><br/><p><span style=\"\">[Trahnet’s army will re-invade Welshire/Western Station in 3 days.]</span></p><br/><p><span style=\"\">At her words, Deacon immediately glanced towards his secretary. The secretary left the reception room then she contacted the Western branch of the Titan guild.</span></p><br/><p><span style=\"\">“There is something I am curious about, Melody.”</span></p><br/><p><span style=\"\">[…….]</span></p><br/><p><span style=\"\">She stood there with a haughty expression on her face. Hamilton, who was by her side, scolded Deacon.</span></p><br/><p><span style=\"\">“You need to treat the Holy Maiden as if you are dealing with the goddess Aria. Mind your manners…”</span></p><br/><p><span style=\"\">Deacon sighed inside then he spoke again.</span></p><br/><p><span style=\"\">“I have something I want to ask you, Holy Maiden.”</span></p><br/><p><span style=\"\">[Speak.]</span></p><br/><p><span style=\"\">“What are you trying to achieve through the Holy Knight Order?”</span></p><br/><p><span style=\"\">[It is to protect those who follow Aria.]</span></p><br/><p><span style=\"\">This was already being done by the Titan guild. Furthermore, wasn’t the police of United States also protecting the people?</span></p><br/><p><span style=\"\">“I’m talking about your true purpose.”</span></p><br/><p><span style=\"\">[I cannot lie.]</span></p><br/><p><span style=\"\">At her words, Deacon changed his tactic. If she can only speak the truth, then eventually she will answer his question.</span></p><br/><p><span style=\"\">“What are you planning to do after you protect the church?”</span></p><br/><p><span style=\"\">[…….]</span></p><br/><p><span style=\"\">“The Titan won’t actively assemble the Holy Knight Order unless I know that piece of information. If you tell me, I’ll be able to help you more readily.”</span></p><br/><p><span style=\"\">Melody paused when she heard Deacon’s words. Her always peaceful expression didn’t change, and her silence also didn’t last long.</span></p><br/><p><span style=\"\">[I want to protect earth then I want to retake my homeland. I will wage a Holy war.]</span></p><br/><p><span style=\"\">“Your homeland?”</span></p><br/><p><span style=\"\">[Alphen. I will save the children of Aria, who are being tormented there.The Holy church will be sent out to protect earth.]</span></p><br/><p><span style=\"\">“Mmm.”</span></p><br/><p><span style=\"\">Deacon groaned.</span></p><br/><p><span style=\"\">Then he grappled over a thought.</span></p><br/><p><span style=\"\">With the Holy Maiden’s foresight, the Titan guild had been able to sharply increase the number of high ranked Dungeons they possessed. The bloodstones and Artifacts that came out of these Dungeons increased the power of the Titan guild.</span></p><br/><p><span style=\"\">For the Titans, Melody’s existence was akin to a goose that laid the gold eggs. It really wouldn’t burden the guild to make her a Holy Knight Order.</span></p><br/><p><span style=\"\">However, Deacon worried the risk that came with the incredible amount of profit.</span></p><br/><p><span style=\"\">Sweet chocolate can bring on obesity. He worried this sweet profit might brink some risks in the future.</span></p><br/><p><span style=\"\">[The high rank Dugeons aren’t the end. It is only a stepping stone.]</span></p><br/><p><span style=\"\">“Mmmm.”</span></p><br/><p><span style=\"\">He had already heard those words from her several times.</span></p><br/><p><span style=\"\">[There invasion hasn’t even started yet.]</span></p><br/><p><span style=\"\">If this wasn’t the invasion then what…</span></p><br/><p><span style=\"\">Deacon thought maybe he might have to share this sweet fruit with the other guilds, and maybe even with the world.</span></p><br/><p><span style=\"\">*</span></p><br/><p><span style=\"\">Woojin sat in a plain filled with the wreck of broken golems. By his side, Bibi and Dolsae was leisurely playing around.</span></p><br/><p><span style=\"\">Sunggoo’s strength and agility was increased by the Reinforcement Stones, so he was elated.</span></p><br/><p><span style=\"\">“Ooh-haha, hyung-nim. I think I’ve become stronger. Look over here.”</span></p><br/><p><span style=\"\">Sunggoo’s bloodstone extraction was faster than before.</span></p><br/><p><span style=\"\">Woojin looked at Sunggoo with a somewhat serious expression on his face.</span></p><br/><p><span style=\"\">The use of bloodstones was gaining steam. The Roused worked to decrease the Dungeon Breaks, but the number of Breaks were increasing little by little.</span></p><br/><p><span style=\"\">Trahnet’s subordinates.</span></p><br/><p><span style=\"\">Let’s say the earth is still short on mana. The lack of energy won’t allow the materialization of these beings.</span></p><br/><p><span style=\"\">However, they will be coming here someday.</span></p><br/><p><span style=\"\">Woojin felt that the day wasn’t too far off.</span></p><br/><p><span style=\"\">Trahnet’s 72 Commanders.</span></p><br/><p><span style=\"\">He called them subordinates, but the commanders were Summoners with a lot of monsters underneath their control. Each one of them were dangerous, and there were a lot of them.</span></p><br/><p><span style=\"\">If all of them showed up on earth at once, then will he be able to block all of them?</span></p><br/><p><span style=\"\">‘It’s impossible.’</span></p><br/><p><span style=\"\">On Alphen, it hadn’t only been Woojin. There were several other races, and he even had an alliance with the humans.</span></p><br/><p><span style=\"\">These numerous forces had attacked Trahnet at the same time, but all they managed to do was maintain a tenuous balance of power.</span></p><br/><p><span style=\"\">Wooin’s territory, Alandal, was only a small part of the overall picture.</span></p><br/><p><span style=\"\">If he excluded his Undead Army, Woojin only had tens of thousands of followers. He was only one part of the counter weight system.</span></p><br/><p><span style=\"\">Moreover, Woojin didn’t have his tens of thousands of his Undead Army. He had 4 followers, and only Hong-sunggoo was a Roused..</span></p><br/><p><span style=\"\">“Hey, Sunggoo.”</span></p><br/><p><span style=\"\">“Yes, hyung-nim.”</span></p><br/><p><span style=\"\">“Stop excavating the bloodstone, and come over here.”</span></p><br/><p><span style=\"\">“Yes, sir.”</span></p><br/><p><span style=\"\">Sunggoo hurried over. He was drenched in sweat, but he was happy since his stamina, and agility had increased. He was feeling the joy of seeing his improvement and development for himself.</span></p><br/><p><span style=\"\">“Did you call me?”</span></p><br/><p><span style=\"\">This guy was innocent and kind. This is why he liked Sunggoo.</span></p><br/><p><span style=\"\">“What Roused Rank do the the directors normally possess?”</span></p><br/><p><span style=\"\">“They are all around Rank B.”</span></p><br/><p><span style=\"\">“The vice presidents?”</span></p><br/><p><span style=\"\">“They should be around Rank A.”</span></p><br/><p><span style=\"\">“Hmmm….”</span></p><br/><p><span style=\"\">The vice presidents were of the 6th Circle, and the Directors were of the 5th Circle.</span></p><br/><p><span style=\"\">By looking at how the other organization were structured, there seemed to be a very small number of people in the 6th Circle. There were a good number of 5th Circle, but their power was lousy in Woojin’s standard.</span></p><br/><p><span style=\"\">Of course, he was comparing it to the standard of Alphen.</span></p><br/><p><span style=\"\">Still, the quality of the earth’s fighting power will be increasing soon.</span></p><br/><p><span style=\"\">As the mana becomes more plentiful, it’ll speed up the appearance of the 7th and 8th Circle Roused.</span></p><br/><p><span style=\"\">The problem was whether if he could trust his back to these people.</span></p><br/><p><span style=\"\">Will he be able to entrust his back to the Roused like Lee-yunhwee?</span></p><br/><p><span style=\"\">Their souls were pulsating with a rotten and foul stench.</span></p><br/><p><span style=\"\">He needed people around him.</span></p><br/><p><span style=\"\">He needed people with exceptional abilitues…</span></p><br/><p><span style=\"\">“Do you want to be the vice president?”</span></p><br/><p><span style=\"\">“What?”</span></p><br/><p><span style=\"\">“I’m askign if you want to become a 6th Circle…do you want to train to become a Rank A Roused? ”</span></p><br/><p><span style=\"\">“…!”</span></p><br/><p><span style=\"\">Sunggoo opened his eyes wide.</span></p><br/><p><span style=\"\">What had been Sunggoo’s initial goal? It was to develop into a high ranked Roused. He had wanted to join a big guild, since they had a support system.</span></p><br/><p><span style=\"\">“I want to do it. I’ll do it no matter what.”</span></p><br/><p><span style=\"\">Usually the innocent guys were the ones who wanted to reach for something higher. That greed could be qualified to be labeled as a fervent desire.</span></p><br/><p><span style=\"\">Those with aspirations had the patience to endure the pain.</span></p><br/><p><span style=\"\">“Even though it’ll be arduous?”</span></p><br/><p><span style=\"\">“I don’t care. I will do it.”</span></p><br/><p><span style=\"\">“Really?”</span></p><br/><p><span style=\"\">“I will do it with my life on the line.”</span></p><br/><p><span style=\"\">“Ok.”</span></p><br/><p><span style=\"\">Woojin grinned when he saw Sunggoo’s eyes burning with passion.</span></p><br/><p><span style=\"\">*</span></p><br/><p><span style=\"\">Where is this? Who am I?</span></p><br/><p><span style=\"\">Sweat was running down like rain from Sunggoo. Still, he didn’t want to lose his concentration, so he waited in a state of tension. If he lost his concentration even for a moment, then his life would be in danger.</span></p><br/><p><span style=\"\">“Kee kee kee kee.”</span></p><br/><p><span style=\"\">Accompanying a hair raising shriek, the Skeleton soldier pushed aside the brush. It aimed its bone knife at Sunggoo’s head.</span></p><br/><p><span style=\"\">This wasn’t a joke. If he was hit, then he was dead.</span></p><br/><p><span style=\"\">“Hoo-oop.”</span></p><br/><p><span style=\"\">While taking short breaths, Sunggoo rolled on the ground. He aimed the hand with the fireball towards the Skelton Soldier’s right temple.</span></p><br/><p><span style=\"\">Kwahng!</span></p><br/><p><span style=\"\">His fireball ability was much stronger than before, but it wasn’t enough to kill a Skeleton Soldier with a single hit.</span></p><br/><p><span style=\"\">“Kee-keek.”</span></p><br/><p><span style=\"\">The head of the Skeleton Soldier was blackened, and it ruthlessly aimed for Sunggoo’s neck with the bone knife.</span></p><br/><p><span style=\"\">Sunggoo rolled forward to avoid the blow, then he approached the Skeleton Soldier.</span></p><br/><p><span style=\"\">If one blow wasn’t enough then he would use two blows.</span></p><br/><p><span style=\"\">Sunggoo’s right hand was a handspan away from the Skeleton Soldier’s helmet when a fireball erupted from his hand.</span></p><br/><p><span style=\"\">Kwahng!</span></p><br/><p><span style=\"\">The fireball ignited and the skull of the Skeleton Soldier disintegrated.</span></p><br/><p><span style=\"\">“Kee-kee-keek.”</span></p><br/><p><span style=\"\">Even before he could be happy, another Skeleton Soldier appeared. Sunggoo shouted with a grave expression on his face.</span></p><br/><p><span style=\"\">“Huk, huk. Hyung-nim. Can’t we take a break?”</span></p><br/><p><span style=\"\">“Kee-kee-keek.”</span></p><br/><p><span style=\"\">Instead of answering him, two more Skeleton Soldiers appeared as they pushed aside the thicket. Sunggoo swallowed his saliva when he saw this. He was barely able to face two of them yet Woojin already wants him to face three…</span></p><br/><p><span style=\"\">It seemed hyung-nim was overestimating him.</span></p><br/><p><span style=\"\">While Sunggoo felt dismal, he started to focus his mind.</span></p><br/><p><span style=\"\">Woojin was watching every move Sunggoo made from atop a tree. He was using the Skills, ‘ Observation’, ‘Warrior’s Sense’, and ‘Information Analysis’. He fully mobilized all these Skills to observe Sunggoo.</span></p><br/><p><span style=\"\">He fears and admires you. He likes you as he hates you.</span></p><br/><p><span style=\"\">Class : Combat Magician</span></p><br/><p><span style=\"\">Ability : Fireball, Crisis Detection Ability</span></p><br/><p><span style=\"\">Woojin pushed Sunggoo hard.</span></p><br/><p><span style=\"\">This resulted in Sunggoo gaining 3 levels before the day was over. Moreover, he gained the Crisis Detection Ability.</span></p><br/><p><span style=\"\">Woojin looked through the catalogue of skills Sunggoo will be learning. There was only a limited selection of Skill Books. Sunggoo won’t be able to learn the ones purchased from the Point Store. However, he had saved the skill books he obtained when he cleared the Dungeons. He’ll let Sunggoo learn some suitable Skill Books.</span></p><br/><p><span style=\"\">‘There are things he can learn and there are things he can’t learn.’</span></p><br/><p><span style=\"\">Skill books didn’t have a universal compatibility. Even if magic was inserted, the Skill Book may not react. Woojin guessed the different Classes limited one from learning certain skills.</span></p><br/><p><span style=\"\">He used Observation and Information Analysis to find out Sunggoo’s class. This was a big piece of information. Woojin started picking out several Skill Book Sunggoo could learn. His level was too low to learn some of them. He would be able to learn two Skills.</span></p><br/><p><span style=\"\">“Huk, huk.”</span></p><br/><p><span style=\"\">While Woojin was distracted, Sunggoo had already defeated the 3 Skeleton Soldiers, and he was trying to catch his breath.</span></p><br/><p><span style=\"\">People will show the full extent of their ability in extreme situations.</span></p><br/><p><span style=\"\">Woojin raised his magic to make 4 nearby corpses into Skeleton Soldiers.</span></p><br/><p><span style=\"\">Goblin corpses were strewn all over the surrounding. Time flowed four time slower in here, and Sunggoo’s growth was astonishing to see.</span></p><br/><p></p></div><br/>\n</div>"}