{"title": "Chapter 51 Tareuts Plateau (2).", "id": 51, "volume": 1, "url": "http://boxnovel.org/seoul-station%E2%80%99s-necromancer-chapter-51-tareuts-plateau-2", "volume_title": "Volume 1", "body": "<h1>Chapter 51 Tareuts Plateau (2).</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 51 Tareut’s Plateau (2).</strong></p><div class=\"innerContent fr-view\" id=\"chapterContent\"><br/><p><span style=\"\">Chapter 51 – Tareut’s Plateau (2)</span></p><br/><p><span style=\"\">(<span>TLN: This is a sponsored chapter. Thank you for the donation Froggy. Please turn of the adblockers if you are able to. Thank you and enjoy~)</span></span></p><br/><p><span style=\"\">On top of a tall tree, a person was hanging off of it.</span></p><br/><p><span style=\"\">Hwa-roo-roo-rook.</span></p><br/><p><span style=\"\">The forest was burning. The body of flame raged harshly, and acrid smoke filled the air.</span></p><br/><p><span style=\"\">“This is the first time I’ve seen someone crazier than me.”</span></p><br/><p><span style=\"\">Lee-yunhwee admitted it without much difficulty.</span></p><br/><p><span style=\"\">He was a crazy bastard. The Dungeon Break would be happening soon, yet he could leisurely enjoy his hunt inside the Dungeon. Moreover, he set the forest on fire.</span></p><br/><p><span style=\"\">Kang-woojin was a crazy bastard. She was sure of it.</span></p><br/><p><span style=\"\">“I have to hurry up and find it, so I could get away.”</span></p><br/><p><span style=\"\">Clearing the Dungeon wasn’t that hard. At the very least, that was what Lee-yunhwee had thought.</span></p><br/><p><span style=\"\">She just had to carry the Return Stone back to the barrier, then she could exit the Dungeon after opening the barrier.</span></p><br/><p><span style=\"\">There is the matter of the final boss, but Lee-yunhwee was confident in herself.</span></p><br/><p><span style=\"\">She wasn’t confident that she would be able to face the monsters. She was confident she could steal and runaway with the Return Stone in secret.</span></p><br/><p><span style=\"\">She was confident in her skill to move covertly. This was why she was called the Shadow Hunter.</span></p><br/><p><span style=\"\">She travelled away from the fire, then she approached the center of the forest. Lee-yunhwee looked at the far-away canyon as she guessed her location.</span></p><br/><p><span style=\"\">“It should be around here.”</span></p><br/><p><span style=\"\">When the Jookjung Station’s 3rd exit was reset and it was measured to be a 6 star Dungeon, the first team to attempt this Dungeon was none other than Hwarang’s Vermillion team. It was the team led by her.</span></p><br/><p><span style=\"\">Then on the second try, she was also in the group collaborating with the KH Guild. They investigated the Dungeon and they assessed whether clearing the Dungeon was profitable or not. They decided not to clear it.</span></p><br/><p><span style=\"\">It was decided the economic value of a Dungeon Break was higher than clearing this 6 star Dungeon.</span></p><br/><p><span style=\"\">However, she didn’t care about the money or economic factors. Moreover, this mission hadn’t sat right with her…</span></p><br/><p><span style=\"\">“This might be better for me anyways.”</span></p><br/><p><span style=\"\">She had always disliked how her oppa did business, so she might be better off this way. Her oppa Lee-sahngho was leading Hwarang into a strange direction.</span></p><br/><p><span style=\"\">In any case, she wasn’t the one who started this. Kang-woojin had entered the portal first.</span></p><br/><p><span style=\"\">As it stands, if he dies then there won’t be any snag that’ll stop the Dungeon Break. If Kang-woojin did clear the Dungeon, it would be a big problem.</span></p><br/><p><span style=\"\">She’d prefer to end this herself rather than let Woojin clear the Dungeon.</span></p><br/><p><span style=\"\">The first try was done by Hwarang. The second try was done by a combined force of Hwarang and KH. The 3rd try was attempted by Japan’s Hennessey Guild. If something they couldn’t do was done by the newly formed Alandal Guild, they would be put in a difficult position.</span></p><br/><p><span style=\"\">The Vermillion’s reputation will fall.</span></p><br/><p><span style=\"\">She had to prevent that.</span></p><br/><p><span style=\"\">‘Hwarang can’t go under.’</span></p><br/><p><span style=\"\">Hwarang was important to Lee-yunhwee and Lee-sahngho.</span></p><br/><p><span style=\"\">The problem was they had different ideas on how they’ll make Hwarang the best guild.</span></p><br/><p><span style=\"\">After walking awhile alongside the cliff, she discovered the covertly hidden rope.</span></p><br/><p><span style=\"\">Lee-yunhwee pulled down at the rope, and the limp rope started to become taut.</span></p><br/><p><span style=\"\">They had installed this during the 1st exploration.</span></p><br/><p><span style=\"\">There were only 3 monsters across the ravine. When they realized this, they had given up clearing the Dungeon. They estimated the amount of Artifacts, and bloodstones they’ll earn from defeating the 3 monsters, and they decided it wouldn’t amount to much.</span></p><br/><p><span style=\"\">The Vermillion team had turned back at that point.</span></p><br/><p><span style=\"\">When the rope pulled by Lee-yunhwee became taut, she tied it off on a tree.</span></p><br/><p><span style=\"\">“Crazy bastard. The Dungeon is going to explode soon yet he is hunting monsters..”</span></p><br/><p><span style=\"\">Even if they had quickly ran away with the Return Stone, there might no have been enough time. Lee-hyunhwee ran atop the rope. Even on the swaying rope, Lee-yunhwee’s body was stable.</span></p><br/><p><span style=\"\">*</span></p><br/><p><span style=\"\">Hwa-roo-rook.</span></p><br/><p><span style=\"\">Fireballs were sent everywhere as the forest burned. Monsters ranging from small to large were all hunted down as they came out of the forest. Even the ogres were taken down.</span></p><br/><p><span style=\"\">Koooooong!</span></p><br/><p><span style=\"\">The bulky body of Dolsae rammed into the ogre like a bulldozer.</span></p><br/><p><span style=\"\">Ggoo-oohng.</span></p><br/><p><span style=\"\">“Koo-oh!”</span></p><br/><p><span style=\"\">When the ogre fell, Woojin didn’t miss the opportunity. He approached the ogre, and as he let out a shout, he pierced the spear through the ogre’s mouth.</span></p><br/><p><span style=\"\">&lt;You’ve just turned Level 40.&gt;</span></p><br/><p><span style=\"\">Woojin didn’t hesitate to learn all the Skills that had been restricted until he reached level 40.</span></p><br/><p><span style=\"\">The hot-blooded battle steed continues to gallop even in death.</span></p><br/><p><span style=\"\">Depending on the Summoner’s Loyalty and Trust, the Required Control is decreased. The summoned being needing control by the Summoner may be reformed into a true companion.</span></p><br/><p><span style=\"\">Magic Consumption : 30, Needed Control 1(-99 Loyalty, -99 Trust)</span></p><br/><p><span style=\"\">Skill : Phantom Gallop, ?(lv10 Cancel)</span></p><br/><p><span style=\"\">“Great.”</span></p><br/><p><span style=\"\">Woojin immediately summoned the Phantom Mount. The empty air ripped open as a blurry Phantom Mount jumped out, then its body materialised.</span></p><br/><p><span style=\"\">It alternated being transparent then turning into a midnight black color. As if it was breathing, the transparency level varied.</span></p><br/><p><span style=\"\">“Hey ShingShing. Did you miss noonah?”</span></p><br/><p><span style=\"\">“Pooh-rooh-roong.”</span></p><br/><p><span style=\"\">The very first one to run towards the Phantom Mount was Bibi. She hugged it around the neck then she rubbed her face against it.</span></p><br/><p><span style=\"\">Woojin’s familars were all trapped within the Room of Seal. If they were to come out after hearing Woojin’s voice, he had to level up quickly.</span></p><br/><p><span style=\"\">Woojin also learned the Necromancer Class skills restricted for level 40.</span></p><br/><p><span style=\"\">The roaming souls are gathered, so it can surround the overlord. These souls move on their own accord to protect the overlord.</span></p><br/><p><span style=\"\">Subordination Number : 0/10</span></p><br/><p><span style=\"\">The Phantom Spear is summoned to attack the enemy. The Phantom Spear will unerringly chase an enemy until the end to attack.</span></p><br/><p><span style=\"\">Consumed Magic : 1</span></p><br/><p><span style=\"\">Phantom Armor(Spirit Armor) and Phantom Spear(Spirit Spear) were high ranked skills for extorting souls.</span></p><br/><p><span style=\"\">The Phantom Armor would surround Woojin, and it was useful as a barrier. However, it was also a good source for energy. In times of emergency, he could extort and absorb the spirits to recover his energy.</span></p><br/><p><span style=\"\">Also, even if there weren’t any souls around his surrounding, he could change his subordinate souls in a Spirit Spear to attack.</span></p><br/><p><span style=\"\">Woojin increased the Spirit Armor level to 10, and it increased the number of spirit he can subordinate in to 100.</span></p><br/><p><span style=\"\">“Come evil spirits..”</span></p><br/><p><span style=\"\">Woojin looked around his surrounding to look at the the spirits roaming around him. The spirits shuddered then they started gathering around Woojin.</span></p><br/><p><span style=\"\">Hwee-ri-ri-reek.</span></p><br/><p><span style=\"\">They all gathered around Woojin. After being subordinated, they revolved around Woojin like satellites.</span></p><br/><p><span style=\"\">Woojin learned the level 40 Warrior Class Skills.</span></p><br/><p><span style=\"\">The Warrior’s Weapon could now change its staff form into a spear, a hammer, and a great sword. He learned how to use a great sword, and he also learned a powerful single strike move called Decisive Strike.</span></p><br/><p><span style=\"\">“All right. Let’s go. Come here, Dolsae.”</span></p><br/><p><span style=\"\">Koo-roo-roong.</span></p><br/><p><span style=\"\">Dolsae shook off the stones composing its body, and he returned to being a small golem’s heart. It returned to Woojin’s side, and it clung on to him.</span></p><br/><p><span style=\"\">Woojin got on ShingShing, and Bibi jumped to sit in front of him.</span></p><br/><p><span style=\"\">Woojin saw the Skeletons filling the surrounding, and he cleared his palate in regret. He couldn’t transport them one by one.</span></p><br/><p><span style=\"\">Pah-paht. Wah-roo-roo.</span></p><br/><p><span style=\"\">Woojin retracted his magic, and every one of the Skeletons turned into a pile of bones.</span></p><br/><p><span style=\"\">It was regrettable, but he assumed there would be more monsters beyond the ravine.</span></p><br/><p><span style=\"\">“Go. Go.”</span></p><br/><p><span style=\"\">At Bibi’s words, Woojin grinned then he grabbed ShingShing’s reins.</span></p><br/><p><span style=\"\">“Poo-rooh-roong.”</span></p><br/><p><span style=\"\">ShingShing let out a bellow as it raised its forelegs. Then he ran straight towards the cliff.</span></p><br/><p><span style=\"\">“Phantom Gallop.”</span></p><br/><p><span style=\"\">Choo-choo-choot.</span></p><br/><p><span style=\"\">At Woojin’s words, a ghostly road formed in front of ShingShing. The ghostly road formed in front of ShingShing, and it disappeared after he passed it. This process kept repeating itself.</span></p><br/><p><span style=\"\">“Ah hahaha. Let’s run, master.”</span></p><br/><p><span style=\"\">ShinShing ran towards the Temple of the Giants.</span></p><br/><p><span style=\"\">*</span></p><br/><p><span style=\"\">“Whew.”</span></p><br/><p><span style=\"\">Lee-yunhwee let out a nervous sigh. She wasn’t afraid nor did she get cold feet. The grand scene that had unfolded in front of her eyes was enough to overawe her automatically.</span></p><br/><p><span style=\"\">The terrain was shaped like a basin. It look depressed like a crater in a volcano.</span></p><br/><p><span style=\"\">In the enormous basin, there were huge statues everywhere.</span></p><br/><p><span style=\"\">It was carved more exquisitely than the Moai statues, and at a glance, there were anywhere between several hundred to several thousand statues.</span></p><br/><p><span style=\"\">There weren’t any buildings here.</span></p><br/><p><span style=\"\">At the center of the basin, there was a large tower, and the Return Stone was floating on top of it. It was so far up that normal people wouldn’t be able to see it, but the eyesight of the Roused had already surpassed the criteria of a normal person.</span></p><br/><p><span style=\"\">There were 3 monsters circling around the altar.</span></p><br/><p><span style=\"\">There were only 3 of them.</span></p><br/><p><span style=\"\">“Still, isn’t this a little bit much to attempt it by myself?”</span></p><br/><p><span style=\"\">When Lee-yunhwee arrived at the Temple of the Giants, her feet wouldn’t move.</span></p><br/><p><span style=\"\">“That bastard will probably come here eventually.”</span></p><br/><p><span style=\"\">Since he had been confident, he’ll probably jump in head first. Lee-yunhwee hid herself in the shadow of a boulder.</span></p><br/><p><span style=\"\">“I want to see you get fucked over.”</span></p><br/><p><span style=\"\">He dared to hit her.</span></p><br/><p><span style=\"\">If the opportunity presented itself, she would take her revenge. If the opportunity didn’t’ come, she didn’t care. She’ll just observe how the bastard fares against the monsters, then she’ll run away after she snatched the Return Stone.</span></p><br/><p><span style=\"\">As she hid in the shadow, Lee-yunhwee’s body assimilated into the surrounding, and she disappeared without a trace.</span></p><br/><p><span style=\"\">*</span></p><br/><p><span style=\"\">It was 1 in the afternoon.</span></p><br/><p><span style=\"\">Hwarang’s guild master Lee-sahngho was at a press conference.</span></p><br/><p><span style=\"\">“In your view, what’s the chance Ms. Lee-yunhwee and Mr. Kang-woojin will survive entering the Dungeon?”</span></p><br/><p><span style=\"\">“It is slim to none.”</span></p><br/><p><span style=\"\">“There is about 1 hour left until the Dungeon Break. From what I know, Lee-yunhwee is your biological sister. How are you feeling right now?”</span></p><br/><p><span style=\"\">Lee-sahngho glared at the reporter who asked the question.</span></p><br/><p><span style=\"\">“What kind of question is that?”</span></p><br/><p><span style=\"\">A family member was about to die in front of his eyes yet he was given such a question…. This why they are called trash reporters. Of course, Lee-sahngho felt anger and relief more than he felt any sadness.</span></p><br/><p><span style=\"\">There was only 1 hour left.</span></p><br/><p><span style=\"\">It basically meant both of them had failed. The Dungeon Break will happen as schedule. Unlike how he felt inside, Lee-sahngho spoke with sadness showing on his face.</span></p><br/><p><span style=\"\">“I’m done answering questions.”</span></p><br/><p><span style=\"\">It looked as if his red eyes were forcefully holding back his tears. His face looked like it was filled with deep sadness and anger. He got up from his seat as he dabbed at the tears welling in his eyes.</span></p><br/><p><span style=\"\">“Pleas wait!”</span></p><br/><p><span style=\"\">“Hwarang’s president.”</span></p><br/><p><span style=\"\">The reporters all got up, but the Hwarang guild members acted as bodyguards while the president exited.</span></p><br/><p><span style=\"\">After exiting the press conference room, Lee-sahngho turned to the guild member to ask a question.</span></p><br/><p><span style=\"\">His anguished face, which had been soaked in sadness, had already cooled into a cold mask.</span></p><br/><p><span style=\"\">“How’s the Dungeon?”</span></p><br/><p><span style=\"\">“It’s still the same.”</span></p><br/><p><span style=\"\">“Whew. How fortunate.”</span></p><br/><p><span style=\"\">“…….”</span></p><br/><p><span style=\"\">“Let’s go to the command center.”</span></p><br/><p><span style=\"\">From early morning yesterday until now, Lee-sahngho had bee under an incredible amount of stress. He waited to see if maybe Lee-yunhwee or Kang-woojin would come out after clearing the Dungeon…</span></p><br/><p><span style=\"\">Lee-Sahngho and the guild members got into their cars. They passed the 3rd line, and they head towards the first line on an empty road. There were soldiers in front of the commander center, and a group of people were making a fuss outside. When he saw them, Lee-sahngho’s face hardened.</span></p><br/><p><span style=\"\">“What? Why are civilians here?”</span></p><br/><p><span style=\"\">“I’ll be back after I find out what’s going on.”</span></p><br/><p><span style=\"\">“It’s all right. Let’s head there together.”</span></p><br/><p><span style=\"\">When he approached the group, Lee-sahngho saw 5 people arguing in front of the soldiers.</span></p><br/><p><span style=\"\">“Did I say we want to go in there? He is Alandal’s guild master. I just want a detailed explanation on what happened.”</span></p><br/><p><span style=\"\">“It is as the report sent out to media described.”</span></p><br/><p><span style=\"\">Jung-minchan spoke respectfully towards the soldiers, but the soldiers kept repeating the same words.</span></p><br/><p><span style=\"\">Jung-minchan, Hong-sunggoo, Kim-haemin, Woo-soonghoon, and even Dojiwon was there with obstinate expressions frozen on their faces.</span></p><br/><p><span style=\"\">“Even if you speak more words here, it is futile. It is 13 hours 6 minutes right now. In exactly 5 minutes, we have to forcefully remove anyone still left around here.”</span></p><br/><p><span style=\"\">One hour before the Dungeon break, any personnel that weren’t combat personnel were all evacuated.</span></p><br/><p><span style=\"\">Usually, the army was put in a bind when civilians entered the area of operation.</span></p><br/><p><span style=\"\">However, they had officially requested the help of Alandal on this operation. Guild master Kang-woojin had come here at their request. The members of Alandal had immediately rushed over here when they heard about the incident.</span></p><br/><p><span style=\"\">They were barely able to argue their way across the 2nd and 3rd line. However, now that they were at the command center, they weren’t able to meet the commander.</span></p><br/><p><span style=\"\">“What’s going on?”</span></p><br/><p><span style=\"\">At that moment, Lee-sahngho asked with a kind look on his face. He secretly looked at Do-jiwon. Even in such a chaotic situation, her appearance was outstanding enough to momentarily steal his gaze.</span></p><br/><p><span style=\"\">“We are guild members of Alandal. We heard our president entered the Dungeon…”</span></p><br/><p><span style=\"\">“Ah ah. I know about you guys, Alandal.”</span></p><br/><p><span style=\"\">Lee-sahngho’s face turned cold. That son of a bitch messed up his plan. Lee-sahngho was also going to lose Lee-yunhwee because of him.</span></p><br/><p><span style=\"\">“The Dungeon Break will happen in one hour. Any responsibility or compensation from the damage will be discussed after we repel back the Dungeon Break..”</span></p><br/><p><span style=\"\">“What?”</span></p><br/><p><span style=\"\">“Didn’t my dongsaeng, Lee-yunhwee, became collateral damage because of your president’s action? Didn’t that kind girl sacrifice herself in order to save your president? Hmmm?”</span></p><br/><p><span style=\"\">Jung-minchan was taken aback, but Hong-sunggoo yelled out in anger.</span></p><br/><p><span style=\"\">“Why would it be a sacrifice? Our hyung-nim will come out soon after he breaks open the barrier..”</span></p><br/><p><span style=\"\">Lee-sahngho’s oily eyes glared at Hong-sunggoo. This green rookie dared to… Even after receiving Sahngho’s murderous glare, Sunggoo didn’t back down and he glared back.</span></p><br/><p><span style=\"\">“Huh. How ridiculous… There is no chance Kang-woojin will clear the Dungeon, so all of you should go back! In the mean time, I’ll be sending my guild’s lawyers against you.”</span></p><br/><p><span style=\"\">Their faces turned dark at Lee-sahgho’s angry scolding.</span></p><br/><p><span style=\"\">It was at that moment.</span></p><br/><p><span style=\"\">The soldiers across the 1st line started making a ruckus.</span></p><br/><p><span style=\"\">“What? What’s going on?”</span></p><br/><p><span style=\"\">“I’ll go find out.”</span></p><br/><p><span style=\"\">The guild member quickly moved towards the command center when Lee-sahngho angrily yelled at him. Then the guild member returned with a pale face.</span></p><br/><p><span style=\"\">“The b…barrier was lifted.”</span></p><br/><p><span style=\"\">“…….”</span></p><br/><p><span style=\"\">Lee-sahngho’s face hardened, and Sunggoo yelled out.</span></p><br/><p><span style=\"\">“That’s our hyung-nim.”</span></p><br/><p><span style=\"\">Lee-sahngho glared at Sunggoo as he asked his guild member.</span></p><br/><p><span style=\"\">“Who is it? Who came out?”</span></p><br/><p><span style=\"\">“That is….”</span></p><br/><p><span style=\"\">The guild member haltingly gave his answer.</span></p><br/><p><span style=\"\">Do-jiwon was standing on one side with a nervous heart, and tears started flowing down from Do-jiwon’s eyes.</span></p><br/><p></p></div><br/>\n</div>"}