{"title": "Chapter 61 - Shout from Pyongyang", "id": 61, "volume": 1, "url": "http://boxnovel.org/seoul-station%E2%80%99s-necromancer-chapter-61-shout-from-pyongyang", "volume_title": "Volume 1", "body": "<h1>Chapter 61 - Shout from Pyongyang</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 61 Shout from Pyongyang.</strong></p><div class=\"innerContent fr-view\" id=\"chapterContent\"><br/><p><span style=\"\">Chapter 61 – Shout from Pyongyang</span></p><br/><p><span style=\"\">(<span>TLN: This is a sponsored chapter. Thank you John and Fima for the donation. I planned on trying to translate two chapters today, but this chapter gave me a lot of problems. It took me much longer than expected. So there will only be one release today.?? Please turn of the adblockers if you are able to. Thanks and enjoy~)</span></span></p><br/><p><span style=\"\">Sahdahng Station’s Cafe Angel Angel.</span></p><br/><p><span style=\"\">“Uh?”</span></p><br/><p><span style=\"\">Even Do-jiwon wondered if she had heard wrong.</span></p><br/><p><span style=\"\">“Where are you going?”</span></p><br/><p><span style=\"\">“Pyongyang.”</span></p><br/><p><span style=\"\">“…in North Korea?”</span></p><br/><p><span style=\"\">“That’s right. I’ll be back after I smash a Dungeon. That’s not the important thing. Should we do a meet and greet with our families?”</span></p><br/><p><span style=\"\">“Uh?”</span></p><br/><p><span style=\"\">How did going to Pyongyang become an unimportant matter? Moreover, he wanted our families to meet and greet….</span></p><br/><p><span style=\"\">Jiwon was confused as to how she should accept this request.</span></p><br/><p><span style=\"\">“Let’s just eat some food. I heard you quit work?”</span></p><br/><p><span style=\"\">“Uh? Yeah. I’ve already repaid most of my debt…”</span></p><br/><p><span style=\"\">“You have debts?”</span></p><br/><p><span style=\"\">“It was from the hospital fees incurred when I was hurt.”</span></p><br/><p><span style=\"\">The Dungeon Shock happened when she was 19 years old.</span></p><br/><p><span style=\"\">Her parents passed away, and she had received a big injury… She didn’t know how the world worked, so she incurred debt from various places. If her face hadn’t been hurt, then she could have probably earned the money easily. However, she would have been led down a bad path.</span></p><br/><p><span style=\"\">“Is that so? Then what are you going to do? Do you want to come work for me in my guild? I’m also thinking about setting up a cafe. Are you interested?”</span></p><br/><p><span style=\"\">“Huh? Cafe?”</span></p><br/><p><span style=\"\">Woojin was the hottest Roused right now yet he suddenly wanted to go into the cafe business? If he just went around the low rank Dungeons, he would make much more profit than running a cafe.</span></p><br/><p><span style=\"\">“It seems my mother is bored.”</span></p><br/><p><span style=\"\">“Ah, it’s ok. I always wanted to do something in particular when I pay back all my debt.”</span></p><br/><p><span style=\"\">“What is it?”</span></p><br/><p><span style=\"\">“I want to become an author of a romance novel.”</span></p><br/><p><span style=\"\">“Huh?”</span></p><br/><p><span style=\"\">The words came out of no where, so Woojin momentarily lost the ability to speak. At his awkward silence, Jiwon’s cheeks turned red from embarrassment.</span></p><br/><p><span style=\"\">“It…it’s just a hobby I want to try.”</span></p><br/><p><span style=\"\">“Cool.”</span></p><br/><p><span style=\"\">“Huh?”</span></p><br/><p><span style=\"\">“It’s cool. I’ll read it later.”</span></p><br/><p><span style=\"\">Jiwon’s cheeks became redder when he said he’ll read the words she had written. She was embarrassed, so she changed the topic.</span></p><br/><p><span style=\"\">“Oh yeah. The alumni association called me not too long ago… They were asking for your phone number, but I haven’t told them yet.”</span></p><br/><p><span style=\"\">After Jiwon lost her face from the accident, she became alienated from her friends. After she finished recuperating, she started working, so she didn’t have time to meet up with them.</span></p><br/><p><span style=\"\">However, Woojin had become famous after he was shown on TV. When both Woojin and Jiwon showed up on the airwaves, her former classmates must have heard about it.</span></p><br/><p><span style=\"\">The missing boy, and the monster girl had morphed into a handsome man and a beauty. Some of her alumnis saw them when their pictures were decorating the internet portal.</span></p><br/><p><span style=\"\">“Really? I guess I’ll see my friends after a long time. Jeez. I’m not sure I’ll be able to remember their names. I’ll contact them once I return from Pyongyang.”</span></p><br/><p><span style=\"\">He’ll probably have some time before he had to go to the US.</span></p><br/><p><span style=\"\">Jiwon was surprised by Woojin’s words.</span></p><br/><p><span style=\"\">“Uh? You want to go together?”</span></p><br/><p><span style=\"\">“We’ll go see them together. Why?”</span></p><br/><p><span style=\"\">He vaguely remembered several faces and names. However, he couldn’t match the names to the faces. He’ll be able to meet his friends after 20 years.</span></p><br/><p><span style=\"\">It was less than Woojin, but Jiwon would be meeting her friends again after 5 years. She had a bit of a different reason from Woojin as to why she was shaken.</span></p><br/><p><span style=\"\">“Nothing. Let’s go meet them together.”</span></p><br/><p><span style=\"\">Jiwon had a lot of close friends. No, she had thought she had a lot of close friends. Jiwon’s beauty made her the center of attention before, and there used to always be a lot of people around her.</span></p><br/><p><span style=\"\">When she hurt her face, her friends left one or two at a time. Several people looked at her with pity in their gazes, so Jiwon cut herself off from them by her own choice.</span></p><br/><p><span style=\"\">When she looked back at her high school days, she realized she hadn’t really been close to anyone. Now only Woojin was by her side. This was why he was her benefactor, who had found what was precious to her.</span></p><br/><p><span style=\"\">“I’m sure you are busy. You should go now.”</span></p><br/><p><span style=\"\">Woojin looked at his watch, and it was already 11 o’clock. His meeting was at 12, so he should start heading out.</span></p><br/><p><span style=\"\">“Do you want anything?”</span></p><br/><p><span style=\"\">“Huh?”</span></p><br/><p><span style=\"\">“I’m going to Pyongyang. At the very least, I should buy some souvenirs.”</span></p><br/><p><span style=\"\">“Poot.”</span></p><br/><p><span style=\"\">Jiwon couldn’t help, but laugh at Woojin’s words.</span></p><br/><p><span style=\"\">If one only heard Woojin’s words, one would think this trip was a trivial matter. No matter how close the land was, North Korea felt very far away to the people of South Korea.</span></p><br/><p><span style=\"\">“What was Pyongyang famous for….”</span></p><br/><p><span style=\"\">Woojin tried to sort through his memories, but he couldn’t remember the names of his friends nor could he remember the famous specialty products of Pyongyang.</span></p><br/><p><span style=\"\">“Please come back without getting hurt.”</span></p><br/><p><span style=\"\">Jiwon stroked Woojin’s face. His wound was completely healed.</span></p><br/><p><span style=\"\">“It was just a scratch. I guess I’ll just buy whatever I see.”</span></p><br/><p><span style=\"\">Maybe it was because he was too used to escaping death, and receiving wounds. He was indifferent at the prospect of getting injured .</span></p><br/><p><span style=\"\">*</span></p><br/><p><span style=\"\">Roused Management Bureaus’ Lieutenant Che-haesol of the Special Defense Brigade was meeting Woojin once again in matter of days. She pleasantly greeted him.</span></p><br/><p><span style=\"\">“It is an honor to see you again. I’ll be your guide all the way to Pyongyang.”</span></p><br/><p><span style=\"\">“Well, I would prefer someone I’m used to.”</span></p><br/><p><span style=\"\">Haesol smiled at Woojin’s words.</span></p><br/><p><span style=\"\">This man’s name came up daily on the ranking of the most searched words. Kahng-woojin’s down to earth personality was fascinating. It made her wonder if this person was really the figure in the news.</span></p><br/><p><span style=\"\">“I’ll be giving you a briefing on your schedule. After lunch, we will travel past Panmunjom to head towards Pyongyang. We should arrived at Pyongyang by dinner time. After some rest, you will enter the Dungeon in the morning.”</span></p><br/><p><span style=\"\">(TLN:Panmunjom-it’s where the DMZ is. If you are interested search youtube for Conan Stars In North Korea’s First Late Night Talk Show. He goes there.)</span></p><br/><p><span style=\"\">“That’s it?”</span></p><br/><p><span style=\"\">He thought he would have to go through complicated procedures to be able to enter North Korea. He guessed this wasn’t the case.</span></p><br/><p><span style=\"\">“We’ve already received permission to enter from North Korea’s delegation. We’ll arrived at Pyongyang tomorrow. If Mr. Woojin succeeds in clearing the Dungeon, there will be great profit for both the North and South Korea.”</span></p><br/><p><span style=\"\">Depending on whether Woojin could succeed clearing the Dungeon, the content of the negotiations would change drastically.</span></p><br/><p><span style=\"\">“You take care of the complicated stuff. Do you mind if I head into the Dungeon as soon as I arrive there?”</span></p><br/><p><span style=\"\">He didn’t feel the need to spend the night in North Korea.</span></p><br/><p><span style=\"\">To be honest, he would feel safer sleeping inside the Dungeon than sleeping in North Korea.</span></p><br/><p><span style=\"\">“Chairman of the National Defense Commission, Kim Jong-un wants to have a meeting with you..”</span></p><br/><p><span style=\"\">“Meeting my ass.”</span></p><br/><p><span style=\"\">“It would be preferable if you accede to…”</span></p><br/><p><span style=\"\">Che-haesol saw it on TV. She had seen Woojin’s fierce kick and the beating he administered.</span></p><br/><p><span style=\"\">She had worried over several dozen times whether his inappropriate behavior might get everyone in trouble. Woojin wouldn’t be the only one in danger. His companions would also be in danger.</span></p><br/><p><span style=\"\">“Well, let us head out first. We’ll talk when we get there.”</span></p><br/><p><span style=\"\">“…….”</span></p><br/><p><span style=\"\">Woojin and Haesol got into the official vehicle that had been readied for them, and they headed towards Panmunjom. The view around the Panmunjom was unfamiliar, so when the car drove on to North Korean soil, he felt kind of restless.</span></p><br/><p><span style=\"\">“Huh.. I thought this place would be full of army facilities and soldiers. There isn’t much here.”</span></p><br/><p><span style=\"\">Woojin mumbled as he saw the fields after the harvest.</span></p><br/><p><span style=\"\">Their car was surrounded by escorts in the front and back. The landscape was basically the boondocks if the military personnel were ignored.</span></p><br/><p><span style=\"\">Che-haesol, who was sitting by Woojin’s side, laughed as she spoke.</span></p><br/><p><span style=\"\">“Only a very limited locations in North Korea is developed. Otherwise, it is like looking at our country 70 years ago. It is so bad that they only have subway stations in Pyongyang..”</span></p><br/><p><span style=\"\">“If they have so few stations, then why can’t they take care of their own business? Why call for assistance? Doesn’t North Korea have any Roused?”</span></p><br/><p><span style=\"\">Woojin didn’t really care. He’ll be given a chance to clear a Dungeon. He’ll also be able to monopolize EXP and Achievement Points. Still he couldn’t help being curious.</span></p><br/><p><span style=\"\">“There are a relatively low number of Roused in North Korea. It is hard to make a team made up of only Rank A roused. Moreover, the Roused population in North Korea has a high mortality rate…”</span></p><br/><p><span style=\"\">He didn’t need an explanation to know why the mortality rate was high. Woojin was curious, so he followed up with a question.</span></p><br/><p><span style=\"\">“Then what did they do when 6 star Dungeons blew up in the past?”</span></p><br/><p><span style=\"\">If they didn’t have enough power, then he wonder how they were able to last for so long. It had been 5 years since the Dungeon Shock. It would be weird if a 6 star Dungeon hadn’t reset during that time.</span></p><br/><p><span style=\"\">“To my knowledge, the 6 star Dungeon has reset 6 times. There had been two Dungeon Breaks, and they were all handled by China.”</span></p><br/><p><span style=\"\">“So that means China couldn’t take care of this Dungeon, and they used the portal 3 times? Was this the reason why they asked for help from South Korea?”</span></p><br/><p><span style=\"\">“Mmm. It isn’t like that. North Korea failed after trying to take care of the problem by themselves. China tried to set make an example out of this situation, so they stood by idly. This spurred North Korea to put out an ad through the World’s Roused Organization to gather Roused, who will raid the Dungeon.”</span></p><br/><p><span style=\"\">“I see what’s going on.”</span></p><br/><p><span style=\"\">The bloodstones coming out of Dungeons was the energy needed for new growth.</span></p><br/><p><span style=\"\">The gap between the 3rd world countries without subway stations, and the nations with subway stations were widening even if only 5 years had passed.</span></p><br/><p><span style=\"\">Even if it was only few stations, North Korea possessed subway stations. When they received help from China, they had to give up all rights to the Dungeon as the price for their help.</span></p><br/><p><span style=\"\">Every time China helped, North Korea chafed under what they considered to be unreasonable treatment. This was why North Korea had tried clear the Dungeon with their own forces, and they had failed.</span></p><br/><p><span style=\"\">China was indignant by North Korea’s independent actions, so they decided not to help this time. This lit a fire under the feet of North Korea, and they desperately requested the Roused of the world for help.</span></p><br/><p><span style=\"\">Jung-minchan had seen this just in time.</span></p><br/><p><span style=\"\">“Well, let’s leave after we finish our business quickly. Please keep your promise about giving me 15 days.”</span></p><br/><p><span style=\"\">“Yes. We will most definitely uphold that condition.”</span></p><br/><p><span style=\"\">He had to clear a Dungeon in North Korea.</span></p><br/><p><span style=\"\">There was the issue of clearing a Dungeon in North Korea with the help of South Korea. Moreover, when Woojin’s guild succeeds in clearing the Dungeon, the two nations had to negotiate on how the Dungeon would be shared.</span></p><br/><p><span style=\"\">Woojin gave a simple condition. After clearing the Dungeon for the first time, he would be given free reign over the Dungeon for a 15 days period.</span></p><br/><p><span style=\"\">He didn’t have any other demands.</span></p><br/><p><span style=\"\">The first person to clear it received the most profit. Since Woojin could ask for a concession without giving a concession, it was considered fortunate that he only requested those conditions. However, the negotiations between the North and South Korea over the Dungeon hadn’t even started yet.</span></p><br/><p><span style=\"\">North Korea would be able to decrease their reliance on China in dealing with high rank Dungeons. North Korea was also focused on securing bloodstones, and South Korea wanted some diplomatic benefits. The negotiations between North and South Korea would start a day after they arrived.</span></p><br/><p><span style=\"\">However, the success of Woojin’s Dungeon raid was more important right now.</span></p><br/><p><span style=\"\">If Woojin failed, he would die in the Dungeon. However Lieutenant Che-haesol, who came here with him, would also be put in an awkward situation.</span></p><br/><p><span style=\"\">If a break happened, a part of Pyongyang would be destroyed, and North Korea would take a huge financial loss.</span></p><br/><p><span style=\"\">“Everything rests on Mr. Woojin.”</span></p><br/><p><span style=\"\">Woojing grinned at Che-haesol’s solemn words.</span></p><br/><p><span style=\"\">*</span></p><br/><p><span style=\"\">Kumsusan Palace of the Sun.</span></p><br/><p><span style=\"\">This place was more commonly called the Memorial Palace, and Woojin was impressed when he stepped inside the building.</span></p><br/><p><span style=\"\">He was surprised by the large plaza, and he was more surprised at the place filled with weapons and soldiers. It seemed they weren’t the parade troops they showed normally on TV.</span></p><br/><p><span style=\"\">They were armed with real guns. Machine guns and tanks were also dispatched. They were positioned in the traditional formations used to deal with the Dungeon Breaks.</span></p><br/><p><span style=\"\">Lieutenant Che-haesol was also surprised. She came back after talking to an officer of the North Korean army. She spoke in a serious manner towards Woojin.</span></p><br/><p><span style=\"\">“The reset Dungeon is called the Gwangmyong Station. They have to stop the Break at any cost, so I understand how they are feeling.”</span></p><br/><p><span style=\"\">If the Gwangmyong Station breaks out, then the Memorial Palace would be put in danger. The palace basically symbolized North Korea, and to protect the palace, they were going to stop the Dungeon Break at all costs.</span></p><br/><p><span style=\"\">“Comrade. Follow us.”</span></p><br/><p><span style=\"\">Woojin and Haesol was led by a commissioned officer of the North Korean army, and they arrived at a meeting room. There were several desks set up for dining, and several North Korean officials were sitting there.</span></p><br/><p><span style=\"\">Woojin sat on the seat he was guided to with an apathetic expression on his face. If anything, Haesol was the one sitting in her seat with a stiff expression. In the meeting room, several reporters were filming the scene.</span></p><br/><p><span style=\"\">“Aren’t you nervous, Mr. Woojin?”</span></p><br/><p><span style=\"\">“Why would I be nervous?”</span></p><br/><p><span style=\"\">At Haesol’s stiff question, Woojin answered indifferently. This was a typical method used by a politician. After inviting the guests, the host would stall to increase the psychological pressure felt by the guest.</span></p><br/><p><span style=\"\">This was a method he enjoyed using as the emperor of his empire on Alphen.</span></p><br/><p><span style=\"\">Well, it didn’t result in him making any good relationships.</span></p><br/><p><span style=\"\">It happened when Woojin propped his hands beneath his chin out of boredom.</span></p><br/><p><span style=\"\">“ Chairman of the Central Military Commission has arrived.”</span></p><br/><p><span style=\"\">The reporters, who were taking a brief rest, started busily pressing on the cameras’ shutter. Woojin was amused as he saw the other man enter.</span></p><br/><p><span style=\"\">The man with the peerless hairstyle. It was his first meeting with the third generation dictator.</span></p><br/><p></p></div><br/>\n</div>"}