{"title": "Chapter 67 - Heros Mentality", "id": 67, "volume": 1, "url": "http://boxnovel.org/seoul-station%E2%80%99s-necromancer-chapter-67-heros-mentality", "volume_title": "Volume 1", "body": "<h1>Chapter 67 - Heros Mentality</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 67 Hero’s Mentality.</strong></p><div class=\"innerContent fr-view\" id=\"chapterContent\"><br/><p><span style=\"\">Chapter 67 – Hero’s Mentality</span></p><br/><p><span style=\"\">(<span>TLN: Hey guys. This is the regular chapter for next week. I had a lot of spare time today, so I decided to translate this chapter early. Please turn off adblockers if you are able to. Thanks and enjoy~)</span></span></p><br/><p><span style=\"\">It was late in the day, so most of the newly hired employees had clocked out. The several employees that were still in the office was told leave for the day. It had been very busy recently, so they hadn’t had the chance to go out for a company dinner yet. The founding members decided to go out for dinner, which would also serve as a drinking party.</span></p><br/><p><span style=\"\">“Granny!”</span></p><br/><p><span style=\"\">“Aikoo. My baby is here?”</span></p><br/><p><span style=\"\">The congenial grandmother from the shanty town was still there, and Sunggoo helped her as if this was his own store. He started placing the basic side dishes on the table. They were the only customers in this old restaurant, so the atmosphere was chilly.</span></p><br/><p><span style=\"\">Jung-minchan was the first to open his mouth.</span></p><br/><p><span style=\"\">“President. Are you sure you don’t have to go?”</span></p><br/><p><span style=\"\">“I’m not going, so why do you keep asking me?”</span></p><br/><p><span style=\"\">He asked since his phone’s inbox was burning up.</span></p><br/><p><span style=\"\">Jung-minchan took care of most of the external business of the guild, so his hand phone was continuously vibrating.</span></p><br/><p><span style=\"\">“Isn’t it an appointment with the President?”</span></p><br/><p><span style=\"\">“I never promised I will go. They just decided on their own that I needed to go. Do I have to accept their invitation?”</span></p><br/><p><span style=\"\">“Aren’t they giving you some award?”</span></p><br/><p><span style=\"\">“I don’t want to receive an award, so tell them not to call me any more.”</span></p><br/><p><span style=\"\">“Still….”</span></p><br/><p><span style=\"\">Woojin frowned.</span></p><br/><p><span style=\"\">“Ah, I’ll go there. I’ll go there then I’ll come back. If they are going to give me a damn award, I’ll…”</span></p><br/><p><span style=\"\">“N…no. I’ll respectfully decline the offer.”</span></p><br/><p><span style=\"\">Jun-minchan looked at his silenced hand phone.</span></p><br/><p><span style=\"\"><span>[27]</span></span></p><br/><p><span style=\"\">Uh-ooh. It would be better to not send Woojin. He might unnecessarily cause trouble. Minchan briefly vacated his seat to make a phone call. Woo-soonghoon laughed as he tried to lift the slightly heavy atmosphere.</span></p><br/><p><span style=\"\">“Hahaha., Please tell us about your work in Pyongyang. I’m talking about your tale of heroism. Tale of heroism.”</span></p><br/><p><span style=\"\">“Nothing much happened.”</span></p><br/><p><span style=\"\">“Eh-ee. Stop being like that. Please tell us about it.”</span></p><br/><p><span style=\"\">Tale of heroism…</span></p><br/><p><span style=\"\">“I have no tales of heroism to tell. I just went around the Dungeon for awhile, then I punished those who needed it. Then I came back.”</span></p><br/><p><span style=\"\">“Hahaha. We were nervous at the prospect of president killing Kim-jungun. ”</span></p><br/><p><span style=\"\">“Ah. I was going to, but I decided to spare him.”</span></p><br/><p><span style=\"\">“…….”</span></p><br/><p><span style=\"\">“He said he was my fan.”</span></p><br/><p><span style=\"\">“…….”</span></p><br/><p><span style=\"\">He was going to… Also, Kim-jungun was his fan… Soonghoon and Haemin’s face turned rigid.</span></p><br/><p><span style=\"\">Then Sunggoo brought over the beef entrails, and Minchan returned to his seat after finishing his call.</span></p><br/><p><span style=\"\">“I was able to come to a resolution with them. You will have to accept an invitation from the Cheongwadae after you come back from your trip to the US.”</span></p><br/><p><span style=\"\">“Well, I guess that’ll be fine.”</span></p><br/><p><span style=\"\">Woojin gave a half-assed reply, then he focused his attention on the beef entrails that was placed on top of the hot skillet.</span></p><br/><p><span style=\"\">Chi-jiji-jeek.</span></p><br/><p><span style=\"\">“Hey. This place’s beef entrails are fantastic. It goes well with the the soju. It’s perfect.”</span></p><br/><p><span style=\"\">As they watched Woojin smacking his lips from the tasty fare, Haemin and Soonghoon exchanged glances. Haemin’s signaled with his eyes gesture. Soonghoon took a shallow breath then he spoke.</span></p><br/><p><span style=\"\">“So… Why were you trying to kill Kim-jungun?”</span></p><br/><p><span style=\"\">“Ah. Some bastard snuck inside the Dungeon with a bomb. I thought Kim-jungun ordered it, so I was going to punish him.”</span></p><br/><p><span style=\"\">“…….”</span></p><br/><p><span style=\"\">He came back alive after someone detonated a suicide bomb?</span></p><br/><p><span style=\"\">Woojin talked about it nonchalantly. Sunggoo stopped flipping the beef entrails with the tongs, so Woojin started flipping the meat with his chopsticks.</span></p><br/><p><span style=\"\">“Hey, Sunggo. It’s burning.”</span></p><br/><p><span style=\"\">“What? Yes, yes.”</span></p><br/><p><span style=\"\">Sunggoo, who was spaced out, started to pick up the beef entrails to cut it.</span></p><br/><p><span style=\"\">Chi-jiji-jeek.</span></p><br/><p><span style=\"\">“Ee-yah. It looks delicious.”</span></p><br/><p><span style=\"\">Woojin opened a bottle of soju as he watched the grilled beef entrails grilled turn brown. When the bottle of soju was pushed forward, Minchan raised his cup.</span></p><br/><p><span style=\"\">“Did someone die? Why is the mood like this. This is our first company dinner.”</span></p><br/><p><span style=\"\">“It…it’s nothing.”</span></p><br/><p><span style=\"\">Maybe it was because Woojin had indifferently talked about killing people.</span></p><br/><p><span style=\"\">They had no idea what kind of person the president was. They tried to reconcile the man in front of him, and the man they had imagine him to be. If one discounted such thoughts, the company dinner was going quite well.</span></p><br/><p><span style=\"\">Above all, this was Guild Alandal’s first company dinner.</span></p><br/><p><span style=\"\">Woojin poured alcohol into all the founding member’s cups, then he filled his own cup.</span></p><br/><p><span style=\"\">“You guys had endured a lot of hardship up until now. I wish you guys would endure more hardship in the future.”</span></p><br/><p><span style=\"\">“…….”</span></p><br/><p><span style=\"\">What kind of toast was that… Soonghoon took the cue, and he yelled out.</span></p><br/><p><span style=\"\">“Thanks for everyone’s efforts.”</span></p><br/><p><span style=\"\">Zzhang.</span></p><br/><p><span style=\"\">After downing the refreshing soju, Woojin dipped a piece of beef entrail in the sauce, then he placed it inside his mouth.</span></p><br/><p><span style=\"\">Kyahh. This was the taste.</span></p><br/><p><span style=\"\">Woojin was getting ready to dig into his food. He readied a perilla leaves for ssam. Everyone else looked around awkwardly, and they gave Woo-soonghoon a signal with their eyes. Woo-soonghoon let out an exaggerated laugh.</span></p><br/><p><span style=\"\">“Hahaha. do you know who is more famous than you, president?”</span></p><br/><p><span style=\"\">Woojin was almost always the most searched name in Korea. However, if one looked world-wide, there was another person who was more famous than him.</span></p><br/><p><span style=\"\">Woo-soonghoon showed Woojin a picture. Soonghoon had made the picture his wall paper on his phone.</span></p><br/><p><span style=\"\">“This woman is named Melody. She is the Holy Maiden of the Aria Church. I’m not sure if this is a scam or not, but the video is quite miraculous. I’m not sure if her goddess really exists…”</span></p><br/><p><span style=\"\">“It isn’t a hoax. It’s real.”</span></p><br/><p><span style=\"\">“What? How would president know if it isn’t a scam?”</span></p><br/><p><span style=\"\">“Huh? It’s someone I know from before.”</span></p><br/><p><span style=\"\">“What?”</span></p><br/><p><span style=\"\">Unlike the surprised Woo-soonghoon, Jung-minchan put on a more serious expression on his face. Melody was none other than the first person to come out of a Dungeon.</span></p><br/><p><span style=\"\">“She was the first human to be found inside a Dungeon. She is said to be a S Rank Roused at the minimum… You actually know this person?”</span></p><br/><p><span style=\"\">“Uh. I know her. Why do you think I’m going to the US? I have some questions for her.”</span></p><br/><p><span style=\"\">“…….”</span></p><br/><p><span style=\"\">They hadn’t know that fact. They had thought he was going to the US to take part in the consortium hosted by the Titan Guild. Now they found out he was acquainted with the Holy Maiden Melody…</span></p><br/><p><span style=\"\">“What kind of relationship did you have with her?”</span></p><br/><p><span style=\"\">Woojin emptied another cup of refreshing soju, then he shoved a large ssam (TLN: google it-food related) into his mouth. Everyone was waiting for Woojin to answer the question. Everyone waited for his answer, but Woojin continued to savor the taste of the food in a relaxed manner.</span></p><br/><p><span style=\"\">Woojin chewed for a long time. When he swallowed, he drank some cider.</span></p><br/><p><span style=\"\">“There is a planet called Alphen.”</span></p><br/><p><span style=\"\">Is the president interested in astronomy? Everyone stayed silent as they listed to him. Woojin opened his mouth.</span></p><br/><p><span style=\"\">“I went missing 5 years ago. At that time, I was summoned to Planet Alphen.”</span></p><br/><p><span style=\"\">“…….”</span></p><br/><p><span style=\"\">Everyone was silent after they heard Woojin’s shocking words. Woo-soonghoon gauged the mood then he let out a small laugh.</span></p><br/><p><span style=\"\">“Hahaha. President’s sense of humor is too complicated. It took me a long time to understand it.”</span></p><br/><p><span style=\"\">“I’m not telling a joke, so stay still.”</span></p><br/><p><span style=\"\">“Yes, sir….”</span></p><br/><p><span style=\"\">Soonghoon’s shoulders shrank, and everyone focused on Woojin with grave expressions on their faces.</span></p><br/><p><span style=\"\">“I don’t know why I was summoned there. I struggled to live in that place for 20 years. I survived, and I was able to return to earth. However, only 5 years had passed over here.”</span></p><br/><p><span style=\"\">“It is quite similar to the time flow within the Dungeons….”</span></p><br/><p><span style=\"\">“Yes. When I returned, Earth had changed in a strange way, and Dungeons had formed here.”</span></p><br/><p><span style=\"\">Everyone was swept up in confusion at Woojin’s earnest words. Should they trust or distrust his words? Should they take his words at face value?</span></p><br/><p><span style=\"\">Was this the secret to Woojin’s incredible abilities?</span></p><br/><p><span style=\"\">“I don’t how she did it, but Melody probably came over using a similar method. No, I have no idea how she did it. This is why I want to go ask her some questions.”</span></p><br/><p><span style=\"\">“…….”</span></p><br/><p><span style=\"\">Was it because they had heard an incredible story? No one dared to open their mouth. Sunggoo carefully asked a question.</span></p><br/><p><span style=\"\">“Hyung-nim. A…are you sure you should be telling us such tales?”</span></p><br/><p><span style=\"\">The Roused Kahng-woojin had appeared like a comet, and his backstory was being endlessly speculated. Moreover, everyone was curious as to his whereabouts when he was missing for 5 years. No on knew where he had been.</span></p><br/><p><span style=\"\">“What? Why do I have to hide it?”</span></p><br/><p><span style=\"\">“…….”</span></p><br/><p><span style=\"\">Dungeons had formed, and monsters were crawling out everywhere. On top of that, the Holy Maiden had appeared. Is there a reason why he should keep his story a secret? Woojin didn’t think too hard on it. His story would eventually become known sooner or later.</span></p><br/><p><span style=\"\">He was preemptively telling his Alandal family the information, since he wanted them to get ready for what was to come.</span></p><br/><p><span style=\"\">“What kind of relationship did you have with the Holy Maiden on the planet?”</span></p><br/><p><span style=\"\">“With Melody?”</span></p><br/><p><span style=\"\">Woojin grinned when he thought about his old memories. It was complicated. Really complicated.</span></p><br/><p><span style=\"\">“I guess she is something like a friend. A friend.”</span></p><br/><p><span style=\"\">*</span></p><br/><p><span style=\"\">Titan Head-quarter’s Aria Church.</span></p><br/><p><span style=\"\">Holy Maiden Melody borrowed her goddess’ power to communicate with others.</span></p><br/><p><span style=\"\">She had only been able to communicate with the believers until not too long ago. However, the Holy Maiden’s capacity to learn a language was almost supernatural. Now she was able to competently carry on a conversation in English.</span></p><br/><p><span style=\"\">Everyone had thought she was a mute. They were once again surprise when they heard the Holy Maiden’s beautiful voice.</span></p><br/><p><span style=\"\">“W…what is this?”</span></p><br/><p><span style=\"\">“Yes? What’s wrong, Holy Maiden?”</span></p><br/><p><span style=\"\">The Holy Maiden was always graceful, and sometime she looked to have an arrogant air around her. However, this was the first time Hamilton had seen the Holy Maiden express any expression on her face. This was how much the Holy Maiden had been taken aback.</span></p><br/><p><span style=\"\">Recently, the Holy Maiden started learning how to operate a computer. Mrs. Hamilton walked over to look at the screen. The monitor held a picture of a Roused from Korea named Kahng-Woojin.</span></p><br/><p><span style=\"\">“This is Mister Kahng.”</span></p><br/><p><span style=\"\">“Mister Kahng? Could you find more information on this man?”</span></p><br/><p><span style=\"\">“Of course.”</span></p><br/><p><span style=\"\">Hamilton was adept at using the computer. She used Kahg-woojin’s name as the key word to look up several things. She brought up several columns with fairly detailed information on Kahng-woojin, and she showed it to Melody.</span></p><br/><p><span style=\"\">Melody slowly read the columns, and the light in her eyes shook. Hamilton, who was next to her, could feel her shake. Melody had always been unflappable, so much so that Hamilton wondered if she was really human. However, she was shaken up right now.</span></p><br/><p><span style=\"\">“Holy Maiden. Are you ok?”</span></p><br/><p><span style=\"\">“How can this be…. It…it is him….”</span></p><br/><p><span style=\"\">“What? Do you know this person?”</span></p><br/><p><span style=\"\">Melody’s white face turned paler.</span></p><br/><p><span style=\"\">She knew him. How could she not know him? He was the most famous person on Alphen.</span></p><br/><p><span style=\"\">“Necromancer of Massacre… Why is he here….”</span></p><br/><p><span style=\"\">Melody’s body shook as if she had seen some horror movie.</span></p><br/><p><span style=\"\">“H…Holy Maiden. Please calm down.”</span></p><br/><p><span style=\"\">Hamilton calmed Melody. She hurried turned off the monitor showing Woojin’s picture. After 10 minutes, Melody was barely calm enough to make a request towards Hamilton.</span></p><br/><p><span style=\"\">“Could you conduct a more thorough investigation on this person??”</span></p><br/><p><span style=\"\">“Of course.”</span></p><br/><p><span style=\"\">While Hamilton was sifting through the information, Melody looked out the window to calm her heart. The Aria church was located on a high-rise building.</span></p><br/><p><span style=\"\">The Manhattan city could be seen at a glance. As she saw the panoramic view of Manhattan, her body shook.</span></p><br/><p><span style=\"\">‘I would have never guessed Immortal would be in this place.’</span></p><br/><p><span style=\"\">When he disappeared, the situation Alphen changed drastically. When the Undead Army in his control disappeared, Trahnet had taken over all the territory that used to owned by the Immortal. This quickly broke the balance of power.</span></p><br/><p><span style=\"\">Everyone had assumed the Immortal was dead. How else could they explain his sudden disappearance?</span></p><br/><p><span style=\"\">Earth was an amazing place.</span></p><br/><p><span style=\"\">The supply of mana was low, so there weren’t a lot of Roused here. Moreover, the quality of the Roused couldn’t be compared to those in Alphen, but there were much more soldiers here with chemically powered weapons.</span></p><br/><p><span style=\"\">It took them less than two hours to kill all the monsters that came out of the Dungeon Break. They had great fire power.</span></p><br/><p><span style=\"\">Moreover, information could be spread at an incredible speed. Her words couldn’t do it justice. She was too astonished.</span></p><br/><p><span style=\"\">There were many more countries on earth compared to Alphen. It was counter-intuitive, but the people of this world was more together than her own lands. It was because of the smooth communication method.</span></p><br/><p><span style=\"\">It could be attributed to the existence of the internet. The internet allowed one to find out what the other nation was doing even if they were very far apart.</span></p><br/><p><span style=\"\">“N…no way!”</span></p><br/><p><span style=\"\">“What is it?”</span></p><br/><p><span style=\"\">Melody looked towards Hamilton as she asked a question.</span></p><br/><p><span style=\"\">“Do you think my existence was reported in South Korea?”</span></p><br/><p><span style=\"\">“Of course. You are the most famous person on the world right now.”</span></p><br/><p><span style=\"\">“…….”</span></p><br/><p><span style=\"\">The Holy Maiden’s face paled.</span></p><br/><p><span style=\"\">What should she do? Should she just run away? Should she abandon all her plans? If the Immortal hears of this… Maybe he still didn’t know she was here?</span></p><br/><p><span style=\"\">“Ah, I found it. He is Guild Alandal’s master. He’ll be attending the upcoming consortium.”</span></p><br/><p><span style=\"\">Alandal. Alandal… She never expected hear the cursed name of the Undead Kingdom again on Earth.</span></p><br/><p><span style=\"\">‘This is the end.’</span></p><br/><p><span style=\"\">Holy Maiden Melody fell into despair.</span></p><br/><p><span style=\"\">She was sure the Immortal knew about her existence. She didn’t have anywhere to run, and she didn’t’ have anywhere to hide.</span></p><br/><p></p></div><div class=\"footnotes\"><ol><li><span id=\"footnote-27\">Unanswered Calls, 128 Unread Messages<i class=\"fa fa-hand-o-left\"></i></span></li></ol></div><br/>\n</div>"}