{"title": "Chapter 80 Rashmode (2).", "id": 80, "volume": 1, "url": "http://boxnovel.org/seoul-station%E2%80%99s-necromancer-chapter-80-rashmode-2", "volume_title": "Volume 1", "body": "<h1>Chapter 80 Rashmode (2).</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 80 Rashmode (2).</strong></p><div class=\"innerContent fr-view\" id=\"chapterContent\"><br/><p><span style=\"\">Chapter 80 - Rashmode (2)</span></p><br/><p><span style=\"\">There were only 72 commanders in existence and, as his title implied, Rashmode wasn't an easy opponent. He continuously used Demon Summons to get rid of Woojin's Skeleton army while simultaneously performing dangerous black magic.</span></p><br/><p><span style=\"\">“I guess you are getting tired now?”</span></p><br/><p><span style=\"\">“Koo koo kook. You shouldn't compare me to you.”</span></p><br/><p><span style=\"\">Rashmode snorted in derision. He was tired, but Woojin was in the same boat.</span></p><br/><p><span style=\"\">Woojin was drenched in blood, and a haze of heat was rising up from his body. Woojin grinned.</span></p><br/><p><span style=\"\">“I'm sure now.”</span></p><br/><p><span style=\"\">“Are you trying to bluff me again?”</span></p><br/><p><span style=\"\">“You can't use your full power either.”</span></p><br/><p><span style=\"\">“…….”</span></p><br/><p><span style=\"\">Rashmode stayed silent as if Woojin's words had hit the mark. Moreover, he realized he had made a mistake. His silence had basically confirmed his opponent's words.</span></p><br/><p><span style=\"\">“Koo-kook. Clearly the Link is unstable right now.”</span></p><br/><p><span style=\"\">Rashmode acknowledged the point. Woojin frowned.</span></p><br/><p><span style=\"\">Link? What was he talking about.</span></p><br/><p><span style=\"\">“Still, you also lost your power, the same as me.”</span></p><br/><p><span style=\"\">The Immortal had been Initialized.</span></p><br/><p><span style=\"\">He could tell that Woojin wasn't the Immortal of the past. The Immortal was barely able to fight off his weakened self. Moreover, Rashmode was slowly gaining the upper-hand.</span></p><br/><p><span style=\"\">Woojin's surrounding was filled with broken Skeletons.</span></p><br/><p><span style=\"\">“I'm quickly regaining what I have lost.”</span></p><br/><p><span style=\"\">“What?”</span></p><br/><p><span style=\"\">Woojin smirked as he looked at the face of Rashmode, who made a retort.</span></p><br/><p><span style=\"\">Woojin felt as if the pinnacle of power he had reached on Alphen wasn't far from his grasp. He was close. Moreover, even if he wasn't hunting right now, his level up was currently progressing.</span></p><br/><p><span style=\"\">He had gained a good amount of EXP hunting the monsters that were summoned by Rashmode. Moreover, Dolsae was fighting outside and the EXP he was sending Woojin's way was pushing him very close to a level up.</span></p><br/><p><span style=\"\">Woojin lifted his great sword, then clashed with Rashmode.</span></p><br/><p><span style=\"\">Kwahng, kwah-kwahng.!</span></p><br/><p><span style=\"\">Woojin attacked with all he had, but Rashmode blocked all his attacks. Woojin was too tired to face off against a monster like Rashmode, who had turned himself into a Chimera.</span></p><br/><p><span style=\"\">His Magic had bottomed out and his Energy was almost all used up.</span></p><br/><p><span style=\"\">Pah-paht!</span></p><br/><p><span style=\"\">At that moment, a light exploded forth from Woojin's body.</span></p><br/><p><span style=\"\">Woojin's body was filled with energy and he smiled.</span></p><br/><p><span style=\"\">This sensation always made Woojin feel giddy.</span></p><br/><p><span style=\"\">“Your condition doesn't look too good.”</span></p><br/><p><span style=\"\">Rashmode made a face as if he chewed on something sour.</span></p><br/><p><span style=\"\">“Go and get some rest.”</span></p><br/><p><span style=\"\">Woojin's hammer came down on Rashmode's head.</span></p><br/><p><span style=\"\">Puhhhhk!</span></p><br/><p><span style=\"\">His swing that was filled with Energy crushed Rashmode’s head in an instant.</span></p><br/><p><span style=\"\">Black bubbles started forming oas Rashmode's head was quickly regenerating. Wojin quickly changed his hammer into an axe and brought it down on Rashmode's neck.</span></p><br/><p><span style=\"\">Kahng, kwah-jee.</span></p><br/><p><span style=\"\">He didn't know what Rashmode had done to his cervical vertebrae. It was like trying to sever a steel chain. The black magician's head was separated from the body, and it came to a stop after rolling several times. His head was boiling as if he had received a severe burn. It was a sickening sight.</span></p><br/><p><span style=\"\">Rashmode's one eye barely moved as he glared at Woojin.</span></p><br/><p><span style=\"\">“Koo-koo-koo. The Link is starting soon. Why don't you run away again? Which dimension are you going to run away to?”</span></p><br/><p><span style=\"\">Woojin's foot crushed Rashmode's head.</span></p><br/><p><span style=\"\">Kwah-jeek.</span></p><br/><p><span style=\"\">“I'm not going to run away! You son of a bitch.”</span></p><br/><p><span style=\"\">&lt;Level Up.&gt;</span></p><br/><p><span style=\"\">Fucking bastard.</span></p><br/><p><span style=\"\">At least, he gave Woojin a lot of EXP.</span></p><br/><p><span style=\"\">As if he was trying to get rid of his leery feeling, Woojin started to scrape Rashmode's brain matter off of his shoe by scuffing it against the floor.</span></p><br/><p><span style=\"\">Woojin started walking, heading towards the corpse of a cat that was sprawled out on the floor.</span></p><br/><p><span style=\"\">“Hoo-ooh.”</span></p><br/><p><span style=\"\">His heart was heavy. Until she was revived, she would have to roam through the deep emptiness. He knew how scary and horrible such an experience could be.</span></p><br/><p><span style=\"\">“Rest, Bibi.”</span></p><br/><p><span style=\"\">When Woojin touched the corpse of the cat, it turned into black smoke and it was absorbed back into Woojin's body.</span></p><br/><p><span style=\"\">She would wait in the Summoning room for her revival.</span></p><br/><p><span style=\"\">“Where's the Return Stone?”</span></p><br/><p><span style=\"\">Woojin used his Search Magic, and he couldn't find anything on Rashmode's body. There were a lot of doors on every wall he faced. He headed towards the door that was giving off the most magical energy.</span></p><br/><p><span style=\"\">When he opened the door, he saw a stone stairway leading up to an altar. There was a red gem as large as his body.</span></p><br/><p><span style=\"\">“Dragon's Heart?”</span></p><br/><p><span style=\"\">The magical energy it held couldn't even be compared to the bloodstones. This was a treasure Woojin had only seen a few times before.</span></p><br/><p><span style=\"\">Woojin looked around the lab as he put away the item inside his Inventory. There were various body parts and bones of monsters mounted all around the lab, and they gave off a creepy vibe.</span></p><br/><p><span style=\"\">“What had he been trying to make?”</span></p><br/><p><span style=\"\">He didn't know what great Chimera Rashmode was trying to make, but it had required the use of a Dragon's Heart. However, Woojin didn't really need to know that information now.</span></p><br/><p><span style=\"\">“I'll use it well.”</span></p><br/><p><span style=\"\">Woojin's hand touched the gem.</span></p><br/><p><span style=\"\">&lt;You have obtained Dragon's Heart.&gt;</span></p><br/><p><span style=\"\">“Maybe I should make RyongRyong a friend.”</span></p><br/><p><span style=\"\">Woojin searched the lab in a good mood, since he had made an unexpected profit. There were high quality monster ingredients piled everywhere. He also found several black magic tomes. He put it all away into his Inventory, then used the Return Stone to cross the portal.</span></p><br/><p><span style=\"\">When Woojin exited the stairway, he saw the large figure made out of scrap metals. He looked like a pile one could find at a junk yard.</span></p><br/><p><span style=\"\">Gee-gee-geek.</span></p><br/><p><span style=\"\">When Woojin spotted him, the Steel Giant stood up. His entire body was drenched with the blood of the monsters. Instead of an Iron Golem, he looked like a Blood Golem.</span></p><br/><p><span style=\"\">“Goo-uhhh.”</span></p><br/><p><span style=\"\">“……”</span></p><br/><p><span style=\"\">Dolsae asked if Woojin had rescued Bibi. Even amongst his familiars, those two were unusually close...</span></p><br/><p><span style=\"\">“Come here.”</span></p><br/><p><span style=\"\">At Woojin's words, the pieces of tanks and helicopters that made up Dolsae's body fell to to floor.</span></p><br/><p><span style=\"\">Weeeeeng.</span></p><br/><p><span style=\"\">Golem's Heart, the ball of light that was the size of a person's head, approached Woojin and Dolsae wept in sadness.</span></p><br/><p><span style=\"\">Woojin felt complicated emotions as he stroked Dolsae once.</span></p><br/><p><span style=\"\">“Good job. Go back in to look after Bibi.</span></p><br/><p><span style=\"\">Weeeeeng.</span></p><br/><p><span style=\"\">Dolsae vibrated in mid-air, then he disappeared as if he had just melted away.</span></p><br/><p><span style=\"\">He probably shouldn't summon Dolsae for awhile.</span></p><br/><p><span style=\"\">At least, Bibi won't be lonely as she waited to be reborn in the Summoning room. Dolsae would be waiting night and day for her return.</span></p><br/><p><span style=\"\">Woojin looked around his surrounding and saw armed men taking care of the monsters’ corpses.</span></p><br/><p><span style=\"\">The Holy Maiden approached Woojin and bowed her head.</span></p><br/><p><span style=\"\">She made the right choice in not attacking him. He didn't have his Death Knights, yet he was able to defeat Trahnet's commander...</span></p><br/><p><span style=\"\">His reputation as being the God of Destruction's Champion was warranted.</span></p><br/><p><span style=\"\">“Do you know what happened here?”</span></p><br/><p><span style=\"\">Melody immediately knew what Woojin was talking about.</span></p><br/><p><span style=\"\">“Earth isn't synchronized fully yet. This was the work of a summoning circle.”</span></p><br/><p><span style=\"\">“Give me a more detailed explanation.”</span></p><br/><p><span style=\"\">“…….”</span></p><br/><p><span style=\"\">The Holy Maiden was silent for a moment as she chose what she would say.</span></p><br/><p><span style=\"\">“Dungeon… This magic circle can summon a waypoint.”</span></p><br/><p><span style=\"\">“A waypoint?”</span></p><br/><p><span style=\"\">“It is a tunnel capable of connecting to the Dimensional Domain. People of earth call it a Dungeon. It is called a Gate on Alphen.”</span></p><br/><p><span style=\"\">“…….”</span></p><br/><p><span style=\"\">Woojin pressed firmly on his temple.</span></p><br/><p><span style=\"\">They were having a hard time defending against the existing Dungeons, yet people were trying to create new Dungeons?</span></p><br/><p><span style=\"\">Why were there so many crazy people on earth?</span></p><br/><p><span style=\"\">“Melody.”</span></p><br/><p><span style=\"\">“Yes….”</span></p><br/><p><span style=\"\">“Cooperate with me.”</span></p><br/><p><span style=\"\">“What are….”</span></p><br/><p><span style=\"\">“I don't want to see Trahnet's forces tread on Earth.”</span></p><br/><p><span style=\"\">“…….”</span></p><br/><p><span style=\"\">“Give me your full cooperation. If I am able to earn my Dimensional Domain, I'll actively help you reclaim Alphen.”</span></p><br/><p><span style=\"\">“…!”</span></p><br/><p><span style=\"\">Melody's eyes opened wide all of a sudden.</span></p><br/><p><span style=\"\">She gave a shiver of disbelief, her entire body trembling.</span></p><br/><p><span style=\"\">How could those words have come out of the Immortal's mouth?</span></p><br/><p><span style=\"\">It was so shocking that tears threatened to form in her eyes.</span></p><br/><p><span style=\"\">How great would it have been if the Immortal had been as concerned and took active interest when he was on Alphen? Maybe they have been able to protect their planet?</span></p><br/><p><span style=\"\">‘Oh, my goddess….’</span></p><br/><p><span style=\"\">Maybe goddess Aria wanted her to bring back the Immortal, who had crossed back to earth. Maybe this was why she had guided Melody here.</span></p><br/><p><span style=\"\">“I'll move heaven and earth to help you….”</span></p><br/><p><span style=\"\">By protecting Earth, she would be able to regain Alphen.</span></p><br/><p><span style=\"\">The Holy Maiden bowed deeply towards Woojin to express her thanks.</span></p><br/><p><span style=\"\">*</span></p><br/><p><span style=\"\">Woojin was provided a room in a hotel owned by the Titan Guild. Only the VIPs was allowed to use this hotel. However, Woojin only stayed there for 5 minutes.</span></p><br/><p><span style=\"\">With the help of the Titan Guild, Woojin spent all of his time mainly clearing the 6 star Dungeons nearby, as well as leveling up. He had also been lucky. He had come across a 6 star Dungeon when it was Reset, and he was able to clear it.</span></p><br/><p><span style=\"\">The hotel was mainly used by Jung-minchan.</span></p><br/><p><span style=\"\">Even if he had stayed in the hotel, it wasn't as if he would be able to kick back and relax.</span></p><br/><p><span style=\"\">At the Holy Maiden's strong suggestion, Titan Guild and Alandal Guild created a powerful new alliance. They were busy making detailed plans on Earth's defense, and the expedition they will send to Planet Alphen.</span></p><br/><p><span style=\"\">The consortium had ended with a troubled atmosphere in the air. The information about Trahnet's conquest forces, the state of Alphen, the reason why Dungeons were forming, and the structure of the Dungeons were all revealed. It caused widespread chaos.</span></p><br/><p><span style=\"\">There was a dilemma.</span></p><br/><p><span style=\"\">If they excavated and used the bloodstones, Earth would fall faster into danger. However, the bloodstones could also be used as a weapon in protecting earth from danger.</span></p><br/><p><span style=\"\">On one side, there were people who wanted to stop clearing Dungeons immediately. On the other, people wanted to aggressively clear the Dungeons to strengthen earth's defense. A fierce debate had erupted.</span></p><br/><p><span style=\"\">During all of this, everyone agreed the world needed to mount a unified defense. There were some talk of creating a command group able to direct the effort of all Roused on this world.</span></p><br/><p><span style=\"\">There were too many Roused from too many countries gathered at the consortium, so no one could come up with a consensus. It seemed that it would take a long time to come to an agreement.</span></p><br/><p><span style=\"\">It was the thirty-second day since he had defeated Rashmode.</span></p><br/><p><span style=\"\">It was the day Bibi would be revived. It was also the day Woojin would be returning to Korea. Titan prepared their private plane for Woojin's return journey.</span></p><br/><p><span style=\"\">Woojin shook hands with the Titan Guild master Deacon, who had footed all the expense relating to using the 6 star Dungeons.</span></p><br/><p><span style=\"\">“Thank you for everything.”</span></p><br/><p><span style=\"\">“No. We should be the one thanking you. I've never witnessed a Roused clear a Dungeon as fast as you, Mr Kahng-woojin.”</span></p><br/><p><span style=\"\">Deacon was astonished at the speed, in which Woojin cleared the vaunted Dungeons. Even after clearing a vast number of Dungeons, Woojin still hadn't been able to reach level 70. He needed 10% more EXP to reach level 70.</span></p><br/><p><span style=\"\">It wasn't as if Korea didn't have Dungeons. He could take care of leveling in Korea.</span></p><br/><p><span style=\"\">The only regret he felt was not being able to find a Dimensional Fragment in the newly Reset 6 Star Dungeon after he cleared it.</span></p><br/><p><span style=\"\">“Please travel safely.”</span></p><br/><p><span style=\"\">“I'll see you again at a later date.”</span></p><br/><p><span style=\"\">Woojin looked at the Holy Maiden. She was still careful around Woojin, but she wasn't always in a state of panic any more.</span></p><br/><p><span style=\"\">“Let's go together when we raid Alphen.”</span></p><br/><p><span style=\"\">“There's no doubt I'll be there.”</span></p><br/><p><span style=\"\">Woojin put on a mischievous smile when the Holy Maiden lowered her head.</span></p><br/><p><span style=\"\">“You must feel relieved since you don't have to see me any more.”</span></p><br/><p><span style=\"\">“…….”</span></p><br/><p><span style=\"\">She was as thankful as she could be for his promise of regaining Alphen. The problem was she still had a lot of fear and discomfort leftover for Woojin from the past. Whenever she was next to Woojin, she always felt anxious. So, the fact that he would be gone made Melody feel much more relieved.</span></p><br/><p><span style=\"\">“Huh? Since you aren't answering, it must be true.”</span></p><br/><p><span style=\"\">“…It isn't like that.”</span></p><br/><p><span style=\"\">“It's all right. Take care of yourself.”</span></p><br/><p><span style=\"\">“Please be safe on your travels, Monarch.”</span></p><br/><p><span style=\"\">She would have never thought she would develop a relationship with the Immortal, one in which they would exchange greetings.….</span></p><br/><p><span style=\"\">After Melody saw Woojin's plane disappear into the sky, she left the airport.</span></p><br/><p><span style=\"\">The shadow from her face disappeared, and a sense of peace came over her.</span></p><br/><p><span style=\"\">The haughty and dignified air that had been missing for a brief amount of time returned.</span></p><br/><p><span style=\"\">When she returned to the temple located inside the Guild's headquarters, Melody prayed in front of the goddess' statue.</span></p><br/><p><span style=\"\">“Oh goddess… Let the day when we return to Alphen come as soon as possible….”</span></p><br/><p><span style=\"\">[…….]</span></p><br/><p><span style=\"\">“Ah!”</span></p><br/><p><span style=\"\">The Holy Maiden had her eyes closed as she prayed. She was surprised when there was a buzz around her. She calmed her heart then she sat up straight. This was her goddess's divine message. Even she had only experienced this a few times in her life.</span></p><br/><p><span style=\"\">Her forehead, palms, knees and toes touched the ground in front of the goddess' statue. Her holy and kind voice rang in Melody's ears.</span></p><br/><p><span style=\"\">[…Follow him.]</span></p><br/><p><span style=\"\">She said to follow him. Who….</span></p><br/><p><span style=\"\">[Go after him.]</span></p><br/><p><span style=\"\">“…….”</span></p><br/><p><span style=\"\">The Holy Maiden fervently wished the person, who the goddess referred to, wasn't the one that came unbidden to her mind. As if the goddess had read her thought, her brilliant voice rang once again in the Holy Maiden's heart.</span></p><br/><p><span style=\"\">[You will stay by his side.]</span></p><br/><p><span style=\"\">“…Oh goddess.”</span></p><br/><p><span style=\"\">She wanted to act as if she hadn't hadn't heard her goddess. Did her goddess want to strengthen her weak heart by putting her next to him?</span></p><br/><p><span style=\"\">[Stay next to Kahng-woojin.]</span></p><br/><p><span style=\"\">The divine message was unusually long today.</span></p><br/><p><span style=\"\">I've already understood what you meant, goddess.</span></p><br/><p><span style=\"\">I just don't want to believe it.</span></p><br/><p><span style=\"\">She didn't feel this wretched even when the goddess had told her she would have to sacrifice her body for the salvation of Alphen by crossing the dimension…</span></p><br/><p><span style=\"\">Oh, my goddess. Why would you give me such a tribulation...</span></p><br/><p></p></div><br/>\n</div>"}