{"title": "Chapter 83 - Guild Expansion", "id": 83, "volume": 1, "url": "http://boxnovel.org/seoul-station%E2%80%99s-necromancer-chapter-83-guild-expansion", "volume_title": "Volume 1", "body": "<h1>Chapter 83 - Guild Expansion</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 83 Guild Expansion.</strong></p><div class=\"innerContent fr-view\" id=\"chapterContent\"><br/><p><span style=\"\">Chapter 83 - Guild Expansion</span></p><br/><p><span style=\"\">\"Mmmm. It's something like a encouragement. It basically mean he’s watching this and he wants me to do well?”</span></p><br/><p><span style=\"\">\"Huh. He says he's dropping out, yet it’s a word of encouragement?”</span></p><br/><p><span style=\"\">“Mmm. It's used like that now.”</span></p><br/><p><span style=\"\">“Why are all the popular phrases so hard to understand these days?”</span></p><br/><p><span style=\"\">“Heh heh. People play like that on the internet.”</span></p><br/><p><span style=\"\">Woojin started looking at all the comments after her chapters.</span></p><br/><p><span style=\"\">“This guy, Spotted Dog, must be a fan. He kept saying he is dropping out after every chapter.”</span></p><br/><p><span style=\"\">“I...I guess so.”</span></p><br/><p><span style=\"\">Jiwon let out an awkward laugh.</span></p><br/><p><span style=\"\">“This is quite fun. Should I start writing too?”</span></p><br/><p><span style=\"\">“Huh?”</span></p><br/><p><span style=\"\">“Haha. I'm joking. It's a joke. I should start studying the popular slangs.”</span></p><br/><p><span style=\"\">Woojin smiled when he thought about Baek-jongdo. When meeting Baek-jongdo in the future, Woojin would be the one teaching him a popular catchphrase.</span></p><br/><p><span style=\"\">“Loot at the webtoons. There are a lot of fun stuff here. You'll be very surprised at how creative some of the netizens are.\"</span></p><br/><p><span style=\"\">“Oh. Really?”</span></p><br/><p><span style=\"\">Woojin and Jiwon put their heads together and had a fun time looking at their small smartphone.</span></p><br/><p><span style=\"\">‘My memories keep popping up in my head. They are still publishing this series.’</span></p><br/><p><span style=\"\">They were still publishing the webtoon, 'Sound of the Body'. It was something he read before he had been summoned, and it had brought up old memories. Whenever he recalled his old memories, it would always give Woojin a distant thrill.</span></p><br/><p><span style=\"\">He remembered how everything used to be... He felt a feeling of regret.</span></p><br/><p><span style=\"\">After talking and playing for a long time with Jiwon, Woojin went to the office.</span></p><br/><p><span style=\"\">It was 5 PM.</span></p><br/><p><span style=\"\">When he opened the office door to enter, the gazes of several dozen employees fell on Woojin. While everyone else hung back, there was a single person who was approaching him with haste.</span></p><br/><p><span style=\"\">“President. You are here?”</span></p><br/><p><span style=\"\">“Uh. Sunngoo and Haemin isn't back yet?”</span></p><br/><p><span style=\"\">“They are organizing the loots. They should be heading back here by now.”</span></p><br/><p><span style=\"\">“All right.”</span></p><br/><p><span style=\"\">“Heh heh. Have you eaten?”</span></p><br/><p><span style=\"\">Woo-soonghoon let out smile as he sucked up to Woojin. Woojin felt a bit of sympathy for him. He wasn't a bad guy. It wasn't as if his soul was rotten...</span></p><br/><p><span style=\"\">Woojin's eyes landed on Soonghoon's name tag.</span></p><br/><p><span style=\"\">[Support Division, Acting Section Chief Woo-soonghoon]</span></p><br/><p><span style=\"\">“Are you acting like this, because you want a promotion?”</span></p><br/><p><span style=\"\">“Heh heh….”</span></p><br/><p><span style=\"\">Woo-soonghoon let out an awkward laugh. Even some of the new employees hired much later than him were assigned to other departments based on their abilities and experience. They were either given titles of section chief or department head. As a founding member, Woo-soonghoon was still stuck as an acting section chief.</span></p><br/><p><span style=\"\">As he slowly read the signs, Woo-soonghoon felt like he was walking on thin ice every day. Woojin patted Soonghoon's shoulder.</span></p><br/><p><span style=\"\">“Don't worry about it. I have my eyes on you.”</span></p><br/><p><span style=\"\">“Heh heh. Thank you.”</span></p><br/><p><span style=\"\">“You’ll be able to drop off soon, so work hard.”</span></p><br/><p><span style=\"\">“…….”</span></p><br/><p><span style=\"\">Was Woojin pressuring him into a voluntary retirement?</span></p><br/><p><span style=\"\">When Soonghoon's face stiffened, Woojin laughed.</span></p><br/><p><span style=\"\">“Why are you freezing up for? It's an encouragement. An encouragement.”</span></p><br/><p><span style=\"\">“Ah, yes….”</span></p><br/><p><span style=\"\">“Then keep up the good work.”</span></p><br/><p><span style=\"\">“…Yes.”</span></p><br/><p><span style=\"\">He didn't know why, but his joke sapped more energy out of Soonghoon. Woojin headed towards the president's room.</span></p><br/><p><span style=\"\">“I guess I'll take some medicine.”</span></p><br/><p><span style=\"\">Woojin opened his inventory, and took out several Reinforcement Stones. He took the Reinforcement Stones for the Stats with no absorption wait time. When Sunggo returned, he would have to feed Sunggoo the Reinforcement Stones again.</span></p><br/><p><span style=\"\">Woojin was able to know his exact absorption time by looking at his Status Window. However, Sunggoo didn't have this advantage. Therefore if he repeatedly took Reinforcement Stones on Stats with a wait time, then he wouldn't get any benefit from it and they would just take a loss when the Reinforcement Stones was used up.</span></p><br/><p><span style=\"\">Woojin had to pick every Reinforcement Stone taken by Sunggoo.</span></p><br/><p><span style=\"\">When he was about to take several more Reinforcement Stones to eat, he heard a knock at the door.</span></p><br/><p><span style=\"\">Ddok ddok.</span></p><br/><p><span style=\"\">“Uh. Come in.”</span></p><br/><p><span style=\"\">The person, who pushed her head through the door, was none other than Lieutenant Che-haesol.</span></p><br/><p><span style=\"\">“Oh! Lieutenant Che.”</span></p><br/><p><span style=\"\">“I'm in the reserves now.”</span></p><br/><p><span style=\"\">Haesol walked and stood in front of Woojin, then she stood straight in a disciplined manner.</span></p><br/><p><span style=\"\">“It seems it'll be awhile before you stop acting like a soldier. When did you get here?”</span></p><br/><p><span style=\"\">“I've been coming to work since yesterday.”</span></p><br/><p><span style=\"\">Woojin shook her hand as he smiled.</span></p><br/><p><span style=\"\">Guild Alandal's third Roused.</span></p><br/><p><span style=\"\">“We'll talk about the details when Minchan is here. Sit.”</span></p><br/><p><span style=\"\">“Yes, sir.”</span></p><br/><p><span style=\"\">Woojin looked hard at Haesol.</span></p><br/><p><span style=\"\">&lt;Lv 14 Che-haesol&gt;</span></p><br/><p><span style=\"\">Ability - Monster Taming, Stat - ….</span></p><br/><p><span style=\"\">He used several skills like Observation, Intuition, and Analysis in combination to bring up Haesol's information.</span></p><br/><p><span style=\"\">“Ho. You are a Tamer?”</span></p><br/><p><span style=\"\">“Huk. How did you know?”</span></p><br/><p><span style=\"\">“I can see it.”</span></p><br/><p><span style=\"\">“…….”</span></p><br/><p><span style=\"\">“I'm sure you had a hard time developing yourself.”</span></p><br/><p><span style=\"\">“Haha. Yes.”</span></p><br/><p><span style=\"\">Were there any monsters left alive on earth?</span></p><br/><p><span style=\"\">When the Dungeon Break happened and the monsters poured out, the troops laid down concentrated fire to kill the monsters. It was their first priority.</span></p><br/><p><span style=\"\">There weren't that many opportunities to try out Taming.</span></p><br/><p><span style=\"\">If she wanted to, she could have endlessly repeated 1 star Dungeons to slowly advance her Taming skill. However, she had become a Roused when she was already enlisted.</span></p><br/><p><span style=\"\">If she requested it, she could have been transferred to the Roused units. However, she chose to stay in her old unit where she had been working.</span></p><br/><p><span style=\"\">Even if one were to become Roused, not everyone could live the life of a Roused.</span></p><br/><p><span style=\"\">Thus, she was given a choice without actually having a choice by Woojin. She had to quit her dream of being a soldier and then join the Alandal guild.</span></p><br/><p><span style=\"\">Woojin pushed forward several Reinforcement Stones.</span></p><br/><p><span style=\"\">“Absorb it.”</span></p><br/><p><span style=\"\">“What?”</span></p><br/><p><span style=\"\">“You don't know how to do it? You just have to eat this one. This one you just have to inject your magic into it.”</span></p><br/><p><span style=\"\">“Ah. I know all about that, but...”</span></p><br/><p><span style=\"\">Why was he giving her the expensive Reinforcement Stones so easily at their first meeting?</span></p><br/><p><span style=\"\">“You have to be tuned-up to be of any use. You are of no help to me right now.”</span></p><br/><p><span style=\"\">“…….”</span></p><br/><p><span style=\"\">She didn't like being called incompetent to her face, but it wasn't a bad thing. The other person wasn't some averagely strong person. He was a word-class Roused who was probably the best in this world. A person like that was trying to guide her right now.</span></p><br/><p><span style=\"\">“Then I'll take it with thanks.”</span></p><br/><p><span style=\"\">If one calculated the worth of these Reinforcement Stone, it would easily reach several hundred thousand dollars yet it disappeared in seconds. Che-haesol 's heart was beating faster each time a Reinforcement Stone disappeared. Woojin grinned when he saw this.</span></p><br/><p><span style=\"\">“Your growth will be fundamentally faster.”</span></p><br/><p><span style=\"\">As the mana increased, the Roused of earth was slowly getting stronger. Even though Haesol hadn't trained at all, she was level 14.</span></p><br/><p><span style=\"\">One was a normal human until level 9. Then, one would become a 1st Circle Roused after reaching level 10.</span></p><br/><p><span style=\"\">Her level had risen by 4 naturally, so it seemed Haesol's potential wasn't too bad.</span></p><br/><p><span style=\"\">It was actually on the good side.</span></p><br/><p><span style=\"\">“Your body is quite receptive to the drugs. Eat this too.”</span></p><br/><p><span style=\"\">There was no wait time after she absorbed the Reinforcement Stones, so Woojin handed her couple more Reinforcement Stones. Haesol felt burdened, but she kept absorbing the Reinforcement Stone in order, upon Woojin's insistence.</span></p><br/><p><span style=\"\">Woojin watched Haesol's Stats increase and thought hard about the Magic scrolls that would suit her. If he had it in his inventory then he would just give it to her right now to learn. If he didn't have it, he’d tell his employees to go purchase one.</span></p><br/><p><span style=\"\">Woojin took out an appropriate Magic scroll.</span></p><br/><p><span style=\"\">“This is Telepathy.”</span></p><br/><p><span style=\"\">“Huk. Is it ok to just give it to me like this?”</span></p><br/><p><span style=\"\">He kept giving out items that were worth several hundred thousand dollars like candies. Haesol's sense of reality would grow dull if this continued.</span></p><br/><p><span style=\"\">“This is important. You have to keep practicing and growing your abilities.”</span></p><br/><p><span style=\"\">Telepathy was important. If one wanted to command one's troop in a chaotic battle, those with a Telepathic skill could be used as a great tool for communication.</span></p><br/><p><span style=\"\">Right now the communication network was fine, and many people assumed it would stay that way. However, when a simultaneous Dungeon Break happens, the cities would be the first places to be destroyed.</span></p><br/><p><span style=\"\">Infrastructures built by civilization—like the power lines that delivered electricity—would be destroyed.</span></p><br/><p><span style=\"\">She was ex-military had great potential. He couldn't say that she was loyal to him, but she was a trustworthy person. She would be the the right person to be put in command over the newly picked Roused.</span></p><br/><p><span style=\"\">The Telepathy Skill was an essential skill. Woojin didn't stop there. He gave her a Sword skill, Defensive magic, Wind magic, etc. He gave her all the low rank skills that weren't restricted by Class.</span></p><br/><p><span style=\"\">“I...I have to learn all of these?”</span></p><br/><p><span style=\"\">“Yes. Why?”</span></p><br/><p><span style=\"\">Woojin answered as if the answer was obvious. Haesol had a puzzled expression on her face.</span></p><br/><p><span style=\"\">Even though she had developed her own abilities, it wasn't as if she didn't have basic knowledge of the Roused. A Roused had to learn a single discipline, so the Roused's growth would be stable...</span></p><br/><p><span style=\"\">“…Isn't that how it is?”</span></p><br/><p><span style=\"\">When Haesol started laying out her reasons, Woojin grinned.</span></p><br/><p><span style=\"\">“Do you play any games, Haesol?”</span></p><br/><p><span style=\"\">“What?”</span></p><br/><p><span style=\"\">“Do you have a game character you are growing?”</span></p><br/><p><span style=\"\">“…….”</span></p><br/><p><span style=\"\">“If you don't want to be left behind, learn all of them. Stop talking as if you have a full stomach.”</span></p><br/><p><span style=\"\">“…Yes.”</span></p><br/><p><span style=\"\">Haesol couldn't even let out a squeak when Woojin spoke in a forceful manner. She had developed a somewhat of a stiffened-back in the military, but she became intimidated from a glimpse of Woojin's personality.</span></p><br/><p><span style=\"\">Without complaint, Haesol started learning each Magic scrolls given to her by Woojin.</span></p><br/><p><span style=\"\">Someone knocked on the door.</span></p><br/><p><span style=\"\">“Come in.”</span></p><br/><p><span style=\"\">When the door opened, Kim-haemin and Hong-sunggoo entered the president's room with a bit of an urgent expression on their faces.</span></p><br/><p><span style=\"\">“Hyung-nim. Is it for real?”</span></p><br/><p><span style=\"\">“What are you talking about?”</span></p><br/><p><span style=\"\">This was the first time he had seen the president after returning from the US for a month, yet he gave such a greeting... Our Sunggoo had grown a lot.</span></p><br/><p><span style=\"\">“Ah… Look at this.”</span></p><br/><p><span style=\"\">Sunggoo grabbed the remote on the table, then turned on the TV. After changing several channels, he stopped on a live press conference being broadcasted. There were three people seated in the press conference, and one of them was a familiar figure.</span></p><br/><p><span style=\"\">“Isn't that Minchan? He said was going to go eat some food, so what is he doing over there?”</span></p><br/><p><span style=\"\">“…….”</span></p><br/><p><span style=\"\">Sunggoo became speechless at Woojin's reaction. Woojin pointed his chin to the two people sitting next to Minchan.</span></p><br/><p><span style=\"\">“Who are they?”</span></p><br/><p><span style=\"\">“They are the Minister of Defense and the Army Chief of Staff.”</span></p><br/><p><span style=\"\">“What's Minchan doing with them?”</span></p><br/><p><span style=\"\">“…….”</span></p><br/><p><span style=\"\">By the looks of Woojin's reaction, he didn't understand what was transpiring. Kim-haemin swallowed his saliva once and then started to explain in a patient manner.</span></p><br/><p><span style=\"\">“Alandal guild just entered into an agreement with the government. This agreement gives us support almost similar to a state-owned company. They are making that announcement right now.”</span></p><br/><p><span style=\"\">“Is that so?”</span></p><br/><p><span style=\"\">“You shouldn't just be saying, 'Is that so?'”</span></p><br/><p><span style=\"\">The fine details of planning were all being taken care of by Minchan, so Woojin wasn’t worried about it. At Woojin's cool reaction, Kim-haemin had a shocked expression on his face.</span></p><br/><p><span style=\"\">“President. This is the first time Korea has done this.”</span></p><br/><p><span style=\"\">“Why are you making such a big deal about this?”</span></p><br/><p><span style=\"\">“We are the guild in charge of the national defense... Eh. It basically means we will be treated like one of our nation's forces.”</span></p><br/><p><span style=\"\">They’dl be a national security group acknowledged by the government, and they would be under the military.</span></p><br/><p><span style=\"\">“So what?”</span></p><br/><p><span style=\"\">“That is….”</span></p><br/><p><span style=\"\">Woojin frowned. Haemin was having a hard time speaking, so Sunggoo stepped forward.</span></p><br/><p><span style=\"\">“Our military life has been lengthened.”</span></p><br/><p><span style=\"\">This might be a permanent post in the military...</span></p><br/><p><span style=\"\">“Huh?”</span></p><br/><p><span style=\"\">That son of a bitch... I said go eat dinner at the Cheongwadae yet he did such an unnecessary....</span></p><br/><p><span style=\"\">Woojin let out a sigh.</span></p><br/><p><span style=\"\">“After Minchan became the vice president, he did something this big.”</span></p><br/><p><span style=\"\">“…….”</span></p><br/><p><span style=\"\">It seemed that Woojin wasn't in a good mood, so everyone kept silent.</span></p><br/><p><span style=\"\">“When that bastard comes back, tell him to not come to work any more.”</span></p><br/><p><span style=\"\">“Where are you going, president?”</span></p><br/><p><span style=\"\">“I'm returning to the Dungeon..”</span></p><br/><p><span style=\"\">“What?”</span></p><br/><p><span style=\"\">“Sunggoo and Haesol will be following me.”</span></p><br/><p><span style=\"\">After he finished speaking, Woojin stepped out of the president's room. Haemin quickly followed after him to ready the car.</span></p><br/><p><span style=\"\">Sunggoo's eyes turned round as he looked at Che-haesol.</span></p><br/><p><span style=\"\">Then his eyes became crescent shaped as he laughed.</span></p><br/><p><span style=\"\">Haesol smiled as she faced Sunggoo. Then, she put her hand out for a handshake.</span></p><br/><p><span style=\"\">“I look forward….”</span></p><br/><p><span style=\"\">Sunggoo refused Haesol's handshake and suddenly hugged her.</span></p><br/><p><span style=\"\">“Ooh-uhng. Let's suffer together from now on.”</span></p><br/><p><span style=\"\">“Yes….”</span></p><br/><p><span style=\"\">Haesol, who was the 3rd Roused to join this guild, felt an uneasy feeling when she saw Sunggoo's reaction. Sunggoo gave a fierce hug as he laughed.</span></p><br/><p><span style=\"\">He won't be lonely anymore.</span></p><br/><p><span style=\"\">He had a comrade now.</span></p><br/><p><span style=\"\">“Let's go before we are late.”</span></p><br/><p><span style=\"\">“Yes… So which Dungeon are we going to?”</span></p><br/><p><span style=\"\">“I'm not sure. At the very least, it'll be 4 stars. Maybe we'll go to a 5 star today.”</span></p><br/><p><span style=\"\">The Dungeons they could use were limited if they didn't have an appointment. Also, they didn't own many Dungeons. Haemin would have prepared everything. Haesol's face stiffened when she heard she was going to the high rank Dungeons.</span></p><br/><p><span style=\"\">“Did I mishear you?”</span></p><br/><p><span style=\"\">“What?”</span></p><br/><p><span style=\"\">“W...we are immediately going to the high rank Dungeons?\"</span></p><br/><p><span style=\"\">“Probably.”</span></p><br/><p><span style=\"\">“I'm only Rank F, so why would I go the high rank Dungeons... Doesn't the lessons usually start from the 1 star Dungeons?”</span></p><br/><p><span style=\"\">What kind of a guild would instruct a new Roused in a high rank Dungeon? When Sunggoo saw Haesol's natural reaction, it was funny, sad, and welcoming.</span></p><br/><p><span style=\"\">‘Yes. Her response is normal. That's normal.’</span></p><br/><p><span style=\"\">Of course, a normal person should think that way.</span></p><br/><p><span style=\"\">Until now, he had grown through an abnormal route. Yes, indeed.</span></p><br/><p><span style=\"\">“Haha. You will feel like you are dying but in the end, he doesn't let you die.”</span></p><br/><p><span style=\"\">Huh? Did her ears hear wrong? She thought she heard some strange words from the cheerful director Hong-sunggoo...</span></p><br/><p><span style=\"\">“Hahaha. Let us both come back alive.”</span></p><br/><p><span style=\"\">“…….”</span></p><br/><p><span style=\"\">Wasn't he too cheerful for a resolutely determined Roused?</span></p><br/><p><span style=\"\">The director of miscellaneous work was too happy at the thought of having a comrade even if it was a confused newcomer.</span></p><br/><p></p></div><br/>\n</div>"}