{"title": "Chapter 110 - Second Alandal", "id": 110, "volume": 2, "url": "http://boxnovel.org/seoul-station%E2%80%99s-necromancer-chapter-110-second-alandal", "volume_title": "Volume 2", "body": "<h1>Chapter 110 - Second Alandal</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 110 Second Alandal .</strong></p><div class=\"innerContent fr-view\" id=\"chapterContent\"><br/><p>Chapter 110 - Second Alandal</p><br/><p>Woojin ordered Minchan to finalize the negotiation for the real estate near the Seoul Station, then ordered a move to that location. He immediately tried to head towards his Dimensional Domain.</p><br/><p>&lt;The Return Portal's recharge isn't complete. Would you like to recharge it using Energy?&gt;</p><br/><p>“What the heck.”</p><br/><p>Woojin had no choice but to hitch a ride to the Seoul Station. It wasn't far away, so he didn't feel the need to waste his Energy.</p><br/><p>\"You are here, president?”</p><br/><p>The Alandal’s Guild employees had already been dispatched to the 1st Exit and were guarding the entrance. They had followed Woojin's instruction. They hadn't taken any appointments and had sealed up the exit. There was only a single door where only Woojin could go in and out.</p><br/><p>“Work hard.”</p><br/><p>“Yes, president.”</p><br/><p>The founding member of Alandal knew Woojin from before, but the new employees only knew him as the world famous Kahng-woojin. The president was a high rank Roused who was up on the high perch above them.</p><br/><p>&lt;You've entered the Seoul Station's 1st Exit.&gt;</p><br/><p>&lt;This is the Dimensional Domain's Restored Dungeon.&gt;</p><br/><p>&lt;You can either choose Hunting or Domain Return.&gt;</p><br/><p>“What? I can hunt in my own Dungeon?”</p><br/><p>Woojin laughed at this nonsensical situation. If he was short on levels, he could hunt down the monsters respawned through his Domain's Energy. However, it was wasteful so he didn't particularly feel like doing that.</p><br/><p>When he picked Domain Return, a red portal formed in front of his eyes.</p><br/><p>Zeeeeng.</p><br/><p>When Woojin passed through the portal, he was in front of the lord's castle.</p><br/><p>“Master!”</p><br/><p>“Anything unusual?”</p><br/><p>As soon as Woojin appeared, she hugged him. Woojin stroked Bibi's head.</p><br/><p>“Heh heh. There were some drifters, but the Wyverns hunted them down. The Wyverns ate them, so I just let it be.”</p><br/><p>“Huh?”</p><br/><p>Woojin sat on his throne to answer his own question. At a glance, the status of his land came into view. Creatures that looked like wild buffaloes were roaming around various locations inside the Domain. There weren't a lot of them. There were only 20 of them.</p><br/><p>“Does this happen often?”</p><br/><p>“Yes. Ten of them showed up one time. There are times when two or three of them show up.”</p><br/><p>“Hmmm. Is that so? Where's Jaemin?”</p><br/><p>“Ah, the noob vampire?”</p><br/><p>“Yes.”</p><br/><p>“It seemed he was a bit afraid, so I gifted him a house.”</p><br/><p>“You did well.”</p><br/><p>“Heh heh.”</p><br/><p>When Woojin stroked Bibi's head, Bibi smiled with a proud expression on her face.</p><br/><p>When he exited the hall with the Throne, a well maintained garden appeared.</p><br/><p>“Huh?”</p><br/><p>When he had left, this place had been an open lot. Now there were several landscaping trees and colorful flowers that filled most of the space. Woojin was startled.</p><br/><p>“Heh heh. It's pretty.”</p><br/><p>“…….”</p><br/><p>He had left her in charge of the castle maintenance and she had changed the garden into a flower field.</p><br/><p>“You don't like it? Should I change it?”</p><br/><p>“No. It's not too bad. Where's the house you gave to Jaemin?”</p><br/><p>“Heh heh. Follow me this way.”</p><br/><p>Bibi started running with her short stride. Woojin slowly followed after her and looked around to see the lord's castle, which had changed a lot.</p><br/><p>The building where the throne and hall was had high walls around it now. Moreover, there were 3 towers added there. The inner structure was still the same, but it was decorated to Bibi's taste. It was very colorful.</p><br/><p>“Hmmm.”</p><br/><p>There were several new buildings inside the castle's vacant lot. Smoke was coming out from a house with a chimney. Bibi spoke proudly.</p><br/><p>“It's a bakery. I'm practicing right now, but I'll be able to make you delicious breads soon.”</p><br/><p>“…….”</p><br/><p>Was it ok to waste Energy on such things?</p><br/><p>Woojin looked at the building next to the bakery.</p><br/><p>Ggahng, ggahng, gghang!</p><br/><p>At a glance, it looked like a smithy and Ramson was occupying that place.</p><br/><p>“Eh-hyoh. Mr. Ramson asked for it, so I built him one.”</p><br/><p>As if Bibi didn't like the loud sound of the hammer strikes, she shook her head from side to side. There were several more buildings and he could see numerous Death Knights in them.</p><br/><p>Like Ramson, some Death Knights had unique occupations before they were reborn. The large Dimensional Domain was less restrictive than the Summon Room. The possibility of what the Death Knights could do was numerous.</p><br/><p>There were some knights in the smithy like Ramson, but most of them were gathered in a fairly large building.</p><br/><p>“What's that over there?”</p><br/><p>“It's a pub.”</p><br/><p>“They are able to drink alcohol?”</p><br/><p>“The alcohol is made from magic. However, we used up all the Energy, so we couldn't buy any.”</p><br/><p>“…so what are they all doing over there?”</p><br/><p>“They are playing cards. It's very boring.”</p><br/><p>“Hmmm.”</p><br/><p>Woojin realized his Familiars normally lived with each other in the Summon Room, maintaining a semblance of society. The fact that they had lived like that was quite interesting to Woojin. No, his Familiars had practically lived in their summoned state on Alphen. Summoned Room was a place where they waited as they recovered from their destruction.</p><br/><p>“That's the vampire's house.”</p><br/><p>“All right. You can return now.”</p><br/><p>“Heh heh. All right. Please recharge the Energy I can use, Master.”</p><br/><p>“…I'll do it later.”</p><br/><p>Bibi had already used up the 10,000 Energy he had assigned to her authority as the Butler. She had used it all in the span of a day. If he gave her any more, she would use all the Dimensional Domain's Energy.</p><br/><p>“Heh heh. I'll buy that one and this one...”</p><br/><p>Bibi was moving further away as she mumbled to herself. She opened the door to a simple two story hut.</p><br/><p>Ggeeeeek.</p><br/><p>It seemed the door needed some more oil. The loud squeal rang out instead of a doorbell, and Woojin could see the interior of the house. The large house had a kitchen with only a single dining table and stool inside.</p><br/><p>Jaemin was nowhere to be seen, so Woojin ascended the stairway.</p><br/><p>The second floor had a small bed and an end table. Jaemin was curled up on top of the bed.</p><br/><p>“Jaemin?”</p><br/><p>“…Hyuuuhng.”</p><br/><p>Jaemin raised his head at Woojin's call. Jaemin's face was pale as it could be.</p><br/><p>“Hoo-oohk. Hook.”</p><br/><p>“What...what's wrong?”</p><br/><p>“Blood… I want to drink blood.”</p><br/><p>When Jaemin saw Woojin, his instinctual craving grew. Woojiin's tanned skin and his muscular neckline looked very tasty. His canines had grown sharp and it felt as if he could bite through anything.</p><br/><p>“Hah-ahk, hahk.”</p><br/><p>“You can't hold it back?”</p><br/><p>“This place….”</p><br/><p>Even Woojin had never been a vampire. He couldn't 100% understand what Jaemin was going through, but Woojin could tell Jaemin was in pain by his face.</p><br/><p>“…It's all bones here. They are all skeletons….”</p><br/><p>“This is quite serious.”</p><br/><p>He was half out of his mind as he mumbled. Jaemin's gaze fixed onto Woojin's neck. His eyes had already turned to red, and he didn't look like a human.</p><br/><p>“Eh-whew.”</p><br/><p>Woojin took out a short sword, and he approached Jaemin.</p><br/><p>When he saw the sharp sword, Jaemin's will to live overpowered his craving for blood. His eyes was shaking with fear. He started to back away when he pitifully called out towards Woojin.</p><br/><p>“Hy...hyung?”</p><br/><p>“Open your mouth.”</p><br/><p>“What?”</p><br/><p>Chwahhk.</p><br/><p>Woojin slashed across his palm. He pulled back Jaemin's hair, and he wetted the back of Jaemin's throat.</p><br/><p>“Ah, ah, ah!”</p><br/><p>Jaemin let out a sluggish sigh, and he desperately drank Woojin's blood, which was dripping down. He looked like a man who had suddenly found water after wandering the desert for a week.</p><br/><p>Jaemin's tongue moved busily as he drank the falling blood. The red light slowly seeped away from his pupils, turning back to black. Jaemin's eyes misted up and tears started to fall down.</p><br/><p>“Hoo-oohk, hook….”</p><br/><p>“…….”</p><br/><p>Woojin healed the wound on his hand as he looked at Jaemin who cried with his head buried inside his blanket. Woojin quickly recovered after he used a soul.</p><br/><p>Jaemin sobbed. There was a smudge of blood around his lips and he cried piteously. Woojin just silently looked down at Jaemin.</p><br/><p>“Hyung. A...am I a monster now?”</p><br/><p>Jaemin wanted to die. No, he wanted to live.</p><br/><p>His fickle heart kept changing back and forth dozens of time each moment.</p><br/><p>Even he was disgusted by his own reflection.</p><br/><p>Woojin felt sorry for Jaemin, who was crying out.</p><br/><p>It really felt like he was seeing his old self. He had fallen into despair like this after killing for the first time.</p><br/><p>“Hoo-oohk. Hoo-uhng..”</p><br/><p>Tears and snot had all poured out. When Jaemin calmed down a little bit, Woojin asked a question.</p><br/><p>“Your sister is worried about you…. When do you want to go home?”</p><br/><p>“…May I stay here for a while?”</p><br/><p>He didn't have any confidence.</p><br/><p>He didn't have the confidence to see his sister. He didn't have the courage to return home, since he had become a monster.</p><br/><p>“You do as you like. I'll speak to your sister.”</p><br/><p>“…Thank you, hyung.”</p><br/><p>“All right. You should rest. If you need anything, contact me through Bibi.”</p><br/><p>After tabbing Bibi as the Butler, Woojin could speak with her on any given moment.</p><br/><p>“Then you should rest a little bit.”</p><br/><p>“Yes, hyung.”</p><br/><p>Jaemin looked like he needed some more time. Woojin left Jaemin and exited the house.</p><br/><p>“Hoo-ooh.”</p><br/><p>He somehow felt a little bit depressed, but that feeling didn't last long.</p><br/><p>Woojin tried to gather information about his Domain, so he brought up the Domain Window. It was similar to his Stat Window. The mini-map of the Domain had the locations marked where the Domain's forces, and residents were located at.</p><br/><p>The Wyvern's nest was located on top of the pointy mountain, and at a location far from the lord's castle, he saw Kiba all by himself.</p><br/><p>“What is he doing there by himself?”</p><br/><p>Woojin let his will flow out and called for a Wyvern.</p><br/><p>Kyahhhhhk!</p><br/><p>After a brief moment, the large Wyvern appeared with a loud screech.</p><br/><p>Hooohng, hoooohng.</p><br/><p>Its fierce wing beats caused a dust storm as it landed.</p><br/><p>It looked quite small compared to Yong Yong, but Yong Young was abnormally large. The Wyvern's body was as large as a fighter jet.</p><br/><p>“Let's see.”</p><br/><p>Woojin opened the Dimensional Store and bought a saddle used by the Wyvern Riders. After attaching it to the Wyvern's back, Woojin got on.</p><br/><p>“Let's look around the Domain once.”</p><br/><p>He could see the mini-map through the Status Window, and he could view each corner of his Domain when he was on his Throne. However, it felt different seeing it for himself.</p><br/><p>Hooooooohng, hoohng.</p><br/><p>After several beats of the wing, they were already in the air. The Wyvern climbed the sky and flew towards Kiba.</p><br/><p>Shwahhhhh.</p><br/><p>The Wyvern sliced through the sky in a much more stable and safe manner compared to Yong Yong. The Wyvern quickly passed by the dry plains. Occasionally, there were thin and twisted trees. He also saw patches of green grass growing from time to time.</p><br/><p>Then he saw the large Death Knight Kiba detachedly standing there in the wasteland.</p><br/><p>When Woojin landed and walked next to him, Kiba got on one knee towards Woojin.</p><br/><p>[My king.]</p><br/><p>“What are you doing here by yourself?”</p><br/><p>[…….]</p><br/><p>Kiba wordlessly stood up, and he went back to standing like before. Woojin stood side-by-side with Kiba.</p><br/><p>[What exists across there?]</p><br/><p>“Hmmm. I have no idea..”</p><br/><p>Woojin tilted his head in confusion as he looked at his borders. There were some fog stretched out, but he couldn't tell what was across there. The mini-map indicated this was the end of this place.</p><br/><p>[I'm curious about it.]</p><br/><p>“Was this why you were here? Did you find something out?”</p><br/><p>[The wild buffaloes wandered in from across there, and they invaded the Domain.]</p><br/><p>Kiba immediately killed the buffaloes that had come out of the fog. As the Domain's Defense Commander, he considered them to be invaders.</p><br/><p>Afterwards, he had killed 8 more buffaloes which had shown up. However, when the Wyverns started eating the buffaloes that appeared, Kiba left them alone.</p><br/><p>The buffaloes that had wandered into this land was the ones currently wandering around the Domain.</p><br/><p>“I'm surprised. You overlooked those mere cows.”</p><br/><p>Kiba had been the great king of the Orcs. He had spent his whole life pillaging and going to war. He had also devoted his life to protecting his tribes, so he was more attached to protecting one’s territory.</p><br/><p>[This place is your majesty's 2nd Alandal.]</p><br/><p>“…….”</p><br/><p>[It isn't your majesty's fault.]</p><br/><p>Woojin became silent at Kiba's words. A bitter laugh passed by his face. Woojin recalled his past.</p><br/><p>The land of the dead, Alandal.</p><br/><p>He was the ruler of that place. He was Alandal's monarch.</p><br/><p>[I serve you in my death, but now your majesty looks over those who are still alive.]</p><br/><p>Kiba respectfully got on his knees.</p><br/><p>“…Can I really do it?”</p><br/><p>He had already tasted defeat once.</p><br/><p>The king had been the only one alive in Alandal. It had turned into the land of the dead.</p><br/><p>The people filled with pain… He could still recall the eyes that looked at him with resentment. The souls that had turned into evil spirits also...</p><br/><p>[…….]</p><br/><p>Kiba didn't have an answer.</p><br/><p>He would follow Woojin no matter, which road he took. He wanted to walk towards a direction his master's desired.</p><br/><p>“Hoo-ooh.”</p><br/><p>Woojin let go of his frustrated feelings. He let out large breath, and he heard the sound of an alarm.</p><br/><p>&lt;Beings, who were wandering the Dimensions has stepped onto your Dimensional Domain.&gt;</p><br/><p>&lt;You can use your force to drive them out, or you can coax them into being Immigrants.&gt;</p><br/><p>“Let's go check it out.”</p><br/><p>Woojin silently crouched on top of the Wyvern's back. Kiba summoned his own Phantom Wolf.</p><br/><p></p></div><br/>\n</div>"}