{"title": "Chapter 114 Hearing (3).", "id": 114, "volume": 2, "url": "http://boxnovel.org/seoul-station%E2%80%99s-necromancer-chapter-114-hearing-3", "volume_title": "Volume 2", "body": "<h1>Chapter 114 Hearing (3).</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 114 Hearing (3).</strong></p><div class=\"innerContent fr-view\" id=\"chapterContent\"><br/><p>Chapter 114 - Hearing (3)</p><br/><p>Soonghoon, who was grabbing on to the steering wheel, was feeling nervous.</p><br/><p>‘I might become part of history now.’</p><br/><p>He really thought it would happen.</p><br/><p>If so, it would be great if he was remembered honorably….</p><br/><p>Soonghoon glanced into his rear mirror and caught sight of Woojin looking out the window with his arms crossed.</p><br/><p>“Are you really not going to shed any blood, president?”</p><br/><p>“If you ask me that one more time, I'm going to flip out.”</p><br/><p>“Huhp. Understood.”</p><br/><p>If he asked the wrong question, he would just be suffering a loss, so Soonghoon closed his mouth. There was a saying, 'Go home and kick the dog.' For no apparent reason, Soonghoon got mad at the traffic.</p><br/><p>“Uh whew. If they are going to protest, they should do it in a more organized manner.”</p><br/><p>They had been on the road from the Seoul Station to the Cheongwadae for an hour already.</p><br/><p>“We can go slowly. There's no need to be in a hurry.”</p><br/><p>“Yes.”</p><br/><p>If he was really in a hurry, he would have flown over by riding Shing Shing.</p><br/><p>As he was looking out the window, Woojin asked a question out of boredom.</p><br/><p>“What are they protesting about?”</p><br/><p>“The Dungeon Breaks from couple days ago caused a lot of damage. The people are protesting for the government to come up with a countermeasure.”</p><br/><p>“A countermeasure?”</p><br/><p>“Yes. They are saying the uncertainty is killing them. They want a safety measure.”</p><br/><p>Woojin couldn't help, but laugh.</p><br/><p>“What kind of safety measure do they want when they are living next to the Dungeons?”</p><br/><p>How could such a thing exist? It was akin to raising both hands in a battlefield, and asking for help. If one wanted to live, one had to either run away or pick up a spear and fight. Those were the only two choices.</p><br/><p>“If they want to be safe, they should leave Seoul instead of protesting.”</p><br/><p>“It is easier said than done. The rich have already left. It is just a speculation, but I'm sure none of the members of congress lives in Seoul.”</p><br/><p>“If they can't leave, then they have to fight.”</p><br/><p>“Uh whew. They aren't Roused, so how could that be easy?”</p><br/><p>Even if one had ability, it wasn't easy for a new Roused to kill monsters. Aside from the abilities, the people of modern society were weak.</p><br/><p>The fact that one had a good ability didn't mean one was good at fighting.</p><br/><p>However, everyone had the will to live, so that was why they were making such a raucous noise righr now.</p><br/><p>“…….”</p><br/><p>Woojin's car moved at a turtle's pace, and when the car passed by the vicinity of the protesters, he looked at them with a bored face. They yelled with hostility as they repeated their words of resentment. Wooin's eyes picked up what the picket signs said.</p><br/><p>- Guarantee Our Rights to Live!</p><br/><p>- Be Responsible for Seoul's Safety!</p><br/><p>Woojin looked at the policemen blocking the protesters. When he saw the wall of men, he had a thought.</p><br/><p>If the large monster army invades earth, who amongst them would go to the front-line to fight?</p><br/><p>Were they being bold and brave, since they couldn't lose their lives here? The protesters were acting very tough and outspoken. How many of them would fight against the Dungeon Breaks to protect earth?</p><br/><p>“…Take care of….”</p><br/><p>“Yes?”</p><br/><p>“Nothing.”</p><br/><p>Soonghoon looked at the rear mirror, when Woojin mumbled some words. When Woojin turned away from the window, he met Soonghoon's eyes.</p><br/><p>“Let's say I have to protect them. Do I have to protect those who doesn't have courage?”</p><br/><p>“What?”</p><br/><p>Soonghoon didn't get what he was talking about, so Woojin reworded his question.</p><br/><p>“If there are those running away from the battlefield, should I have to pick up the slack for those people?”</p><br/><p>“Mmmm. It would be a problem to leave the deserters alone.”</p><br/><p>“Right?”</p><br/><p>“…….”</p><br/><p>“If they don't have the courage, then they should fight in death.”</p><br/><p>Soonghoon spoke after he secretly tried to read Woojin's face.</p><br/><p>“Excuse me.”</p><br/><p>“Uh, what?”</p><br/><p>“Desertion is a serious problem, but.... I think it's a big problem if we put everyone on the battlefield.”</p><br/><p>“What?”</p><br/><p>“Well, isn't it? We can't send all the women and children out to the battlefield. There are some people we have to protect.”</p><br/><p>“……!”</p><br/><p>Woojin's eyes widened. This reaction made Soonghoon stumble in his words.</p><br/><p>Did he perhap make some kind of mistake? The president seemed to be in a bit of foul mood today.</p><br/><p>“No. I know there are women in the army, so I'm not saying I disagree with women enlisting. I still don't have a girlfriend yet, but just the thought her going out to battle... Uh-whew. It's a nightmare. I would rather fight instead of her.”</p><br/><p>“…….”</p><br/><p>Wooin closed his eyes.</p><br/><p>His mother, Sooah, and even Jiwon would have to go to war….</p><br/><p>Will he be able to put swords in their hands and ask them to fight with other people?</p><br/><p>Woojin's worry deepened, his brows furrowed. Soonghoon was getting restless.</p><br/><p>“I'm sorry.”</p><br/><p>“About what?”</p><br/><p>Woojin opened his eyes. Soonghoon stumbled over his words.</p><br/><p>“My parents are also advanced in age now, so they won't be able to defend...”</p><br/><p>“It's all right.”</p><br/><p>Woojin smirked.</p><br/><p>Everyone didn't have courage, but he couldn't use that as an excuse.</p><br/><p>He realized something huge.</p><br/><p>‘Alandal was also hell.’</p><br/><p>In the end, he had killed everyone.</p><br/><p>Those countless number of people.... Numerous number of people wanted to live, so he had pushed them onto the battlefield. Those without courage was revived as Skeletons to fight. Those still alive had been afraid of becoming the Undead.</p><br/><p>Maybe their real enemy had been the Immortal, not Trahnet.</p><br/><p>“Uh-whew. This road is too congested.”</p><br/><p>It was a square. They were almost at their destination, but they couldn't move forward anymore. There were too many people here. It was evidence that the people were very anxious and worried.</p><br/><p>“So what are they trying to accomplish by complaining to the congress?”</p><br/><p>“…….”</p><br/><p>Soonghoon wondered if he should say this or not. No, it was a truth that everyone seemed to know except the president...</p><br/><p>“What? Why aren't you saying anything to me?”</p><br/><p>“Mmm. Do you remember the negotiation with the government that fell apart couple days ago? It was about the Protection Guild...”</p><br/><p>“What about it?”</p><br/><p>“They want the government to restart the talks.”</p><br/><p>“Those people?”</p><br/><p>“…Yes.”</p><br/><p>“So they basically want me to fight instead of them.”</p><br/><p>“…….”</p><br/><p>In a way, that was true, but….</p><br/><p>“Let's get off here.”</p><br/><p>“What? It's dangerous out there.”</p><br/><p>“For me?”</p><br/><p>“…….”</p><br/><p>Of course, the president wasn't in danger. He was worried the people would be unnecessarily harmed.</p><br/><p>Ddal-kahk.</p><br/><p>“P...president.”</p><br/><p>Wooijn opened the car door and got out. Soonghoon quickly got out, following after Woojin.</p><br/><p>The two people walked forward as they pushed through the crowd. There were so many people gathered here that he had a hard time keeping track of where Woojin was.</p><br/><p>Wooin waded through the group of people, arriving at the front of a wall of shields being held by the police.</p><br/><p>Chwahhh!</p><br/><p>Woojin went past the line of people, and a water cannon was shot towards him. The stream of water caused the magical barrier to form in front of him. The police chief immediately used his radio.</p><br/><p>“It's a Roused. Please send the Roused Response team.”</p><br/><p>It was forbidden for the Roused to join a protest.</p><br/><p>The fact that he was in this square was breaking the law.</p><br/><p>Before the Roused Response team could arrive, Woojin jumped atop the police bus. It surprised the police officer, who was giving orders with a loudspeaker.</p><br/><p>“W...what the hell! You know this is a crime.”</p><br/><p>“Give me that.”</p><br/><p>“What?”</p><br/><p>Woojin snatched the loudspeaker away from the police officer.</p><br/><p>Bbiiiiiiiii-</p><br/><p>The ear piercing sound drew the attention of the people towards Woojin.</p><br/><p>[Ah ah!]</p><br/><p>Some unknown man wearing a tracksuit was on top of a bus, and he was speaking through the loudspeaker. The man's face was strangely familiar….</p><br/><p>“It's Kahng-woojin!”</p><br/><p>“It's Alandal's president!”</p><br/><p>When a person, who recognized Woojin yelled it out, the news spread like wildfire between the people. Woojin frowned as he saw the racket.</p><br/><p>[Be Quiet!]</p><br/><p>Wojin's words spread, whereupon silence reigned over the square. The abrupt silence caused others, who were out of Woojin's speaking range, to also stop speaking. Soon the silence had spread across to every protester there.</p><br/><p>The man on top of the bus looked around several times, then the sound of the loudspeaker was heard.</p><br/><p>[We can't stop the Dungeon Breaks.]</p><br/><p>Woojin continued to speak as he watched the people stir. He hadn't stepped forward to give a speech. He just wanted to deliver them the truth, and he wanted to give them a choice.</p><br/><p>[If you want to run, then get out of Seoul. The Dungeon Breaks will continue to happen.]</p><br/><p>The number of Dimensional Domains that will start to link to earth would increase, and Seoul wasn't an exception.</p><br/><p>[We can't stop the Break, but we can stop the monsters.]</p><br/><p>The people started to stir once again, but after looking at Woojin, they waited for him to speak.</p><br/><p>[Those who want to fight the monsters should stay in Seoul.]</p><br/><p>No matter how many Undeads he had in his army, he couldn’t protect the entire city. Others would have to help out.</p><br/><p>[I'll be staying behind in Seoul.]</p><br/><p>Woojin returned the loudspeaker to the police officer.</p><br/><p>“I...it is an honor.”</p><br/><p>Woojin smirked at the police officer's stiff words.</p><br/><p>Honor? What did this have to do with honor?</p><br/><p>“Take care.”</p><br/><p>“Y...yes sir!”</p><br/><p>Woojin jumped off the bus. The square was packed with people, but behind the boss, there were only police moving around.</p><br/><p>“P...president.”</p><br/><p>Soonghoon had barely kept up with Woojin. He smooth out his rumpled suit.</p><br/><p>“Whew. Your speech was awesome. So you finally decided to protect Seoul.”</p><br/><p>“I did?”</p><br/><p>Woojin grinned as he walked towards the Cheongwadae.</p><br/><p>Didn’t staying in Seoul imply he would protect the city?</p><br/><p>Soonghoon tilted his head in puzzlement as he followed after Woojin.</p><br/><p>*</p><br/><p>Cheongwadae's Oval Office.</p><br/><p>Kim-byungmahn's wrinkles were getting deeper by the day.</p><br/><p>“Is the protest still going on?”</p><br/><p>“Yes. The people's anger is quite significant.”</p><br/><p>At the Chief Officer's answer, Kim-byungmahn closed both his eyes and laid down on the sofa.</p><br/><p>He felt frustrated and guilt-ridden. It felt as if this was all his fault. He was too ashamed to show his face to the public.</p><br/><p>The appearance of monsters was an irresistible calamity. At the same time, a country not being able to protect its citizen was a disaster caused by human error.</p><br/><p>“Hoo-ooh. Has Mr. Kahng-woojin arrive there yet?”</p><br/><p>“Not yet.”</p><br/><p>When Kahng-woojin arrived at the National Assembly, he planned on heading over there on his helicopter.</p><br/><p>The protesters were occupying the square, and in a way, he was the cause of the protest. If the president left the Cheongwadae, he thought it would be disrespectful to those people.</p><br/><p>It tormented him, but he couldn't avoid it. If they wanted to curse him, he had to take it.</p><br/><p>“Whew. Is he trying to contact us, because of the Defense pact?”</p><br/><p>“I think so.”</p><br/><p>“It would be great if it works out.”</p><br/><p>The previous deal's benefits was already mind boggling, but Kahng-woojin was in a position to ask for much more. This truth was clearly felt when Kahng-woojin went to the Middle East. He was the messiah. The fact that he was Korean was an enormous blessing.</p><br/><p>If another country stole him from Korea.... It would be a huge threat to the safety of this country, and it might lead to the government not being able to protect the people. He wouldn't have any words to say even if he was stoned.</p><br/><p>“He's probably almost there now. I'll go ready the helicopter.”</p><br/><p>“You do that.”</p><br/><p>The Chief Officer had just stood up when a guard came running up to him to whisper into his ear. His eyes widened, and he spoke towards the President.</p><br/><p>“Mr. Kahng-woojin is here at the Cheongwadae.”</p><br/><p>“What?”</p><br/><p>Both the President and Chief Officer was surprised, so they looked at each other.</p><br/><p>Alandal had told them Kahng-woojin would be going to the National Assembly, so why...</p><br/><p>“Where is he?”</p><br/><p>“We put him in the reception room.”</p><br/><p>“Well done. I'll see him immediately.”</p><br/><p>“Yes.”</p><br/><p>Kim-byungmahn put on his coat and started walking.</p><br/><p>Korea's greatest Roused. He was single man who possessed an army.</p><br/><p>He was the celebrated hero of the world who had eradicated terrorist organizations in the Middle East.</p><br/><p>Kim-byungmahn felt his heart beat faster as he walked towards the reception room.</p><br/><p>*</p><br/><p>National Assembly.</p><br/><p>It was a rare sight to see all the congress members present at this location. They were filled with annoyance and insult.</p><br/><p>“That bastard said he was going to come, so why is he so late?”</p><br/><p>“It isn't as if he's screwing us over for just one or two day. His arrogance is boundless!”</p><br/><p>“What does he think the congress is? Is he looking down on our country? He isn't even paying attention to the anger of the people.”</p><br/><p>While everyone was letting out their complaint, Park-sogoohk and Choi-taeoh whispered to each other.</p><br/><p>“Did he back out?”</p><br/><p>“Koo-hmmm. I have no idea. He's always treated the government's requests like shit.”</p><br/><p>How many times had Alandal ignored the government's requests?</p><br/><p>He might have said he was going to come, but there was a chance he might have changed his mind. As he was thinking this, his aide approached and spoke to him.</p><br/><p>“Kahng-woojin is in a meeting with the president..”</p><br/><p>Park-sogoohk's face crumpled.</p><br/><p>“What? Why did he go there?”</p><br/><p>Why would he go to the Cheongwadae after saying he was going to come to the National Assembly?</p><br/><p>How dare he look down on the country and its people.</p><br/><p>“Arrogant bitch.”</p><br/><p>Park-sogoohk didn't hide his foul mood.</p><br/><p></p></div><br/>\n</div>"}