{"title": "Chapter 132 - Bloody Reunion (2)", "id": 132, "volume": 2, "url": "http://boxnovel.org/seoul-station%E2%80%99s-necromancer-chapter-132-bloody-reunion-2", "volume_title": "Volume 2", "body": "<h1>Chapter 132 - Bloody Reunion (2)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><span style=\"\">Chapter 132 - Bloody Reunion (2)</span></p><br/><p><span style=\"\">The Chaos mountain was the tallest mountain on Planet Jaku.</span></p><br/><p><span style=\"\">It was the base of the biggest power on Planet Jaku.  They were the Yellow Lizards, and all the Dimensional lords affiliated with the organization was holding a meeting.  There were a total of eight of them.  They were all diverse in their appearance. </span></p><br/><p><span style=\"\">There was a road with large columns lining each side.  There were Dimensional lords present on top of each column, and they looked down at the human, who was walking down the road.</span></p><br/><p><span style=\"\">“Yo-ho-ho.  That human is the messenger sent by the Great lord Iello-nim?” </span></p><br/><p><span style=\"\">“He's pathetic.  At a glance, he is a disposable item.” </span></p><br/><p><span style=\"\">Lee-sahngho  could clearly hear their conversations, but he made no comments.  No, he didn't dare to speak.</span></p><br/><p><span style=\"\">On top of the tall columns, there was a Titan, who was over 10 meters tall, and other grotesque beings of unknown races.</span></p><br/><p><span style=\"\">There were also those, who looked akin to humans, but the oppressive feeling they let out was no joke.</span></p><br/><p><span style=\"\">Lee-sahngho felt their attention on him.  His legs shook from the strain.</span></p><br/><p><span style=\"\">After passing the road lined with the giant columns, one came upon a tower.</span></p><br/><p><span style=\"\">This was the highest location on the peak of Chaos mountain.</span></p><br/><p><span style=\"\">Koo-roo-roo. </span></p><br/><p><span style=\"\">Rajakui, the Gold Dragon, took rough breaths as he appeared.</span></p><br/><p><span style=\"\">[What does a messenger of Iello-nim want with me?] </span></p><br/><p><span style=\"\">Iello's messenger Lee-sahngho felt a bit faint when he heard the voice ring inside his head.</span></p><br/><p><span style=\"\">“If you destroy earth, he will allow you entrance into the Planet Iferin.” </span></p><br/><p><span style=\"\">[Koo-koo-koo.  Iferin.] </span></p><br/><p><span style=\"\">Rajakui's body shook at the sentimental name. He alternated between being happy and angry.  The Dragon's Fear raged forward.  The gathered Dimensional lords all got on their knees as they endured the Dragon's Fear.</span></p><br/><p><span style=\"\">Lee-sahngho felt faint, and he felt like passing out.  He was barely able to resist, and his body was frozen in place.  If he was in a battle, he would have been cut down without being able to do anything.</span></p><br/><p><span style=\"\">[Do you have anything else to say to me?] </span></p><br/><p><span style=\"\">“Please send me to earth.” </span></p><br/><p><span style=\"\">[That won't be difficult.] </span></p><br/><p><span style=\"\">Rajakui opened his wings wide.</span></p><br/><p><span style=\"\">The fully extended wings was over 50 meters long. The body between the wings was also incredibly large.  The Dimensional lords stretched their necks to look up at him.</span></p><br/><p><span style=\"\">[We'll take over earth.] </span></p><br/><p><span style=\"\">“Then what are we going to do about this planet?” </span></p><br/><p><span style=\"\">There were two other coalitions on the Planet Jaku other than the Yellow Lizard coalition.  There was the Black Hats and the Red Hammer.  If they lost the initiative on keeping this planet, their profits would suffer.  However, they had to expend a considerable amount of resources to be able to co-exist with the two other coalitions on this planet.</span></p><br/><p><span style=\"\">[We'll move and make earth our main hunting ground.] </span></p><br/><p><span style=\"\">This was a planet where they hadn't even completed their links. </span></p><br/><p><span style=\"\">The risk was high, but the reward was as big as the risk. He had a goal where the sacrifice would be worth it.</span></p><br/><p><span style=\"\">A road that lead back to his home planet of Iferin was open to him now.</span></p><br/><p><span style=\"\">*** </span></p><br/><p><span style=\"\">A van stopped in front of the Mokdong Station.</span></p><br/><p><span style=\"\">“We are here, president.” </span></p><br/><p><span style=\"\">When he heard Soonghoon's words, Woojin opened his eyes, and he pulled up his reclined seat.</span></p><br/><p><span style=\"\">“It's at least a 6 star?” </span></p><br/><p><span style=\"\">“Yes.” </span></p><br/><p><span style=\"\">Mokdong Station's 4th exit.</span></p><br/><p><span style=\"\">The Dungeon had Reset 7 days ago, but no one had attempted to clear it yet.</span></p><br/><p><span style=\"\">KH guid had the priority to clear it, since they had found it first.  However, when they measured the Dungeon Energy, it was higher than the energy measured for the 6 star Dungeons.  They couldn't readily send in their Rank A Roused team inside.</span></p><br/><p><span style=\"\">They could try to clear it with an Escape Return Portal in possession, but the Item was pricey.  They could gather their dream team, but they decided to grant Alandal's request instead.</span></p><br/><p><span style=\"\">There was still a lot of time until the Dungeon Break, but Woojin was going to clear the Dungeon. Of course, the guilds would determine how they would split the profit.</span></p><br/><p><span style=\"\">Woojin just needed a place to hunt. </span></p><br/><p><span style=\"\">“I'll be here all day.  Go eat in shifts.” </span></p><br/><p><span style=\"\">“Yes, sir.  Don't worry about us.  We'll be on strict watch.” </span></p><br/><p><span style=\"\">“All right. Thanks.” </span></p><br/><p><span style=\"\">Woojin patted Soonghoon's shoulder, then he headed towards the Dungeon.</span></p><br/><p><span style=\"\">&lt;You've entered Mivich's Meadow.&gt; </span></p><br/><p><span style=\"\">&lt;Please select a mode from 'Duel', 'Dimensional Battle', 'Visit', ‘Infiltration’ or ‘Clear’.&gt; </span></p><br/><p><span style=\"\">“As I thought, another Dimensional lord is here.” </span></p><br/><p><span style=\"\">Most of the Dungeons that were 6 stars and below was owned by the Dungeon Owners.  Any Dungeons exceeded the amount of Energy held by the 6 star Dungeon were almost always owned by the Dimensional lords.</span></p><br/><p><span style=\"\">This was also the case here.</span></p><br/><p><span style=\"\">Since Dimensional lords were trying to link to earth worldwide, it was a matter of time before one of them connected.</span></p><br/><p><span style=\"\">Of course, he could clear the Dungeon to sever the link, but in the meantime, he was afraid the Dimensional lord's vassals would cause crimes against humanity.</span></p><br/><p><span style=\"\">They were on a different level compared to the mediocre Roused or the monsters.  If Woojin hadn't chased out Juliel and Rashmode, the demise of Earth would be much closer right now.</span></p><br/><p><span style=\"\">“What the hell?” </span></p><br/><p><span style=\"\">Woojin walked through the empty subway station, and he tilted his head in confusion.  Either there hadn't been any Energy invested into the Dungeon or there weren’t any monsters available to be regenerated.  He didn't even have to go downstairs to check the lower floors.</span></p><br/><p><span style=\"\">Zzeeeeeng, zzeeeeeeng. </span></p><br/><p><span style=\"\">The sound of resonance rang out as a portal emitting red light was formed.</span></p><br/><p><span style=\"\">“Does this mean he doesn't need to use the scrubs?” </span></p><br/><p><span style=\"\">The dispatch of monsters inside the Dungeon acted as a first line of defense.  This mechanism allowed one to prove to a certain extent that one was qualified to step onto the Dimensional Domain. </span></p><br/><p><span style=\"\">Of course, this all depended on the preference of the Dimensional lords.  Instead of dispatching monsters in the Dungeon, the Dimensional lord could have gathered all his forces into his Dimensional Domain.</span></p><br/><p><span style=\"\">When Woojin passed through the portal, he saw a green grassland.</span></p><br/><p><span style=\"\">There were gentle hills that made it hard to see far into the distance. He climbed the highest hill he could find to look around his surroundings. </span></p><br/><p><span style=\"\">“Why is this place so deserted?” </span></p><br/><p><span style=\"\">Woojin shook his head from side to side when he couldn't' find a single monster on the land.</span></p><br/><p><span style=\"\">Was this an owner, who preferred to have a small elite force?</span></p><br/><p><span style=\"\">The recorded Dungeon Energy was very high, and the total amount of fight power the lord would have wouldn't change.</span></p><br/><p><span style=\"\">Either there would be a lot of monsters or there would be a few powerful monsters.</span></p><br/><p><span style=\"\">He might have gotten unlucky this time, and it was the latter situation.</span></p><br/><p><span style=\"\">As a Necromancer, it was much easier to face a lot of mediocre enemies rather than fighting an absolute power.</span></p><br/><p><span style=\"\">He wouldn't be able to turn the corpses into allied forces, and he wouldn't be able to use the corpses as medium for the Corpse Explosion.</span></p><br/><p><span style=\"\">However, it wasn't as if he was helpless against strong foes.</span></p><br/><p><span style=\"\">“Rakto.” </span></p><br/><p><span style=\"\">The black smoke coalesced, and the Death Knight named Rakto appeared.  Rakto was the one that used a ghost-like spear.</span></p><br/><p><span style=\"\">[My lord.] </span></p><br/><p><span style=\"\">This particular Death Knight was almost equal to Kiba in terms of one-on-one battles.  He was also unparalleled in terms of fighting on a mount. There was a chance an intruder might infiltrate his Dimensional Domain of Alandal, so he wouldn't be able to summon all of this Death Knights.</span></p><br/><p><span style=\"\">If a being from the Planet Jaku cleared Necia's Pillar before he could sync it, he would lose his Dungeon.</span></p><br/><p><span style=\"\">If the hunt was difficult, he decided he would call up 20 Death Knights.</span></p><br/><p><span style=\"\">“Let's go as a duo.” </span></p><br/><p><span style=\"\">[As you command.] </span></p><br/><p><span style=\"\">Woojin and Rakto summoned their Phantom Steeds.  Woojin summoned his Warrior's Weapon, and he transformed it into a spear.  They raced across the grasslands.  Their destination was obvious.  It was the green colored pillar of light in the distance.  That was where the Return Stone was present.</span></p><br/><p><span style=\"\">*** </span></p><br/><p><span style=\"\">In front of the Mokdong Station's 4th exit.</span></p><br/><p><span style=\"\">“Ah-ooh.  It's cold.” </span></p><br/><p><span style=\"\">“Chief.  I think we picked up a reporter.” </span></p><br/><p><span style=\"\">“What? Where?” </span></p><br/><p><span style=\"\">Woo-soonghoon looked around his surrounding, and he saw a parked car with a man holding up a camera with long lens. He grinned as he shook his head from side to side.</span></p><br/><p><span style=\"\">“Just let him be. This isn't the first time that has happened.” </span></p><br/><p><span style=\"\">“Yes.  Is it really ok to travel like this?” </span></p><br/><p><span style=\"\">“Huh? What do you mean?” </span></p><br/><p><span style=\"\">“We haven't gained our independence yet.  Moreover, we are on Korean soil....” </span></p><br/><p><span style=\"\">Soonghoon put his arm around the employee's shoulder.</span></p><br/><p><span style=\"\">“Hey.  Do you think we are North Korea?  Does a country always have to be in war with a neighboring country?” </span></p><br/><p><span style=\"\">“Ah.” </span></p><br/><p><span style=\"\">“Moreover, the treaty hasn't been signed yet.  We are still citizens of South Korea..” </span></p><br/><p><span style=\"\">As Soonghoon had said, they were still Koreans.  They would just gain an additional citizenship into Alandal.  Basically, they would be dual citizens. When the national vote changed the Constitution of South Korea, the details of the treaty would be finalized.</span></p><br/><p><span style=\"\">The fact that Alandal was a country sounded good, but it would basically be like how Rome operated alongside the Vatican city.</span></p><br/><p><span style=\"\">It would allow Korean citizens to enter the guild, and it would also given them the right to become the citizens of Alandal.</span></p><br/><p><span style=\"\">When one leaves the guild, it would strip the rights one would have in Alandal.</span></p><br/><p><span style=\"\">“Uh-whew.  My head hurts thinking about the legal ramifications.  Let's rest a little bit.” </span></p><br/><p><span style=\"\">“Yes. I'll go buy something to eat.” </span></p><br/><p><span style=\"\">“All right.” </span></p><br/><p><span style=\"\">The employee ran across to the street to the convenience store.  </span></p><br/><p><span style=\"\">Soonghoon walked towards the people from the KH guild guarding the Dungeon.</span></p><br/><p><span style=\"\">“Uh-whew.  It seems I'll be seeing you for all of today, so let's greet each other.” </span></p><br/><p><span style=\"\">“Ah, yes.” </span></p><br/><p><span style=\"\">Soonghoon's rank wasn't low.  He was one of Alandal's founding members, and he was the Chief Secretary working directly under Woojin. There was a rumor saying that he was going to be nominated as Alandal's minister of foreign affairs.  To the rank and file employees, he was someone way above them.</span></p><br/><p><span style=\"\">The people from the KH guild awkwardly gave their greetings, and Soonghoon started chatting them up for a long time.  He was in the midst of talking, while eating the cup ramen and kimbab brought to him by an employee, when he suddenly had a thought.  He looked down at his watch.</span></p><br/><p><span style=\"\">“Uh? Why isn't he so late in coming out?” </span></p><br/><p><span style=\"\">“I know.  If we consider president's playing time, he is excessively late in coming out.” </span></p><br/><p><span style=\"\">“Hmmm….” </span></p><br/><p><span style=\"\">Soonghoon furrowed his brows when he felt a weird sense of uneasiness.</span></p><br/><p><span style=\"\">This was a first clear of a Dungeon, but Woojin showed an almost miraculous ability to clear the Dungeons.  He should have already been out by now.  It had been 6 hours since he had entered the Dungeon.  A full day should have passed inside.</span></p><br/><p><span style=\"\">This had never happened before. Soonhoon looked at the firmly closed barrier with a little bit of concern.</span></p><br/><p><span style=\"\">“Uh? There's a breaking news.” </span></p><br/><p><span style=\"\">“Huh? Put up the volume.” </span></p><br/><p><span style=\"\">An employee had been watching tv through his handphone.  At Soonghoon's words, he unplugged the earphone, and he raised the volume.</span></p><br/><p><span style=\"\">-There is a simultaneous Dungeon Reset happening right now.  Currently, there are 11 locations in Seoul, four locations in Daegoo, and seven in Busan. In total, 20 new Dungeons have formed.  When the Energy was measured, eight of them exceeded what one would measure from a 6 star Dungeon....</span></p><br/><p><span style=\"\">“What?” </span></p><br/><p><span style=\"\">Soonghoon quickly took out his smartphone, and he accessed the internet.</span></p><br/><p><span style=\"\">The Dungeon Resets were happening at random.  Numerous Dungeons had reset in a short amount of time. He was taken aback, since something big might be going on right now.</span></p><br/><p><span style=\"\">“Huh. It isn't only happening in Korea?” </span></p><br/><p><span style=\"\">The internet was in more of an uproar than the news.</span></p><br/><p><span style=\"\">US, Japan and China were all experiencing a simultaneous Dungeon Reset.</span></p><br/><p><span style=\"\">“Oh no. An additional three Dungeons were added in Seoul.” </span></p><br/><p><span style=\"\">“What the hell? Is something big about to happen?” </span></p><br/><p><span style=\"\">The employees whispered to each other in unease.</span></p><br/><p><span style=\"\">The Guilds jockeyed to claim the Reset Dungeons, because the number of Dungeons that Reset was low. However, they were all Resetting at the same time....</span></p><br/><p><span style=\"\">A weird sense of danger and worry washed over Soonghoon.</span></p><br/><p><span style=\"\">Since he was worried, Soonghoon looked for him.</span></p><br/><p><span style=\"\">“President….” </span></p><br/><p><span style=\"\">Why was Kahng-woojin taking so long to clear the Dungeon?  This was abnormal, and Soonghoon could only look on with a worried expression.</span></p><br/><p><span style=\"\">*** </span></p><br/><p><span style=\"\">A pale looking man was hurriedly walking down the streets of Hongdae.</span></p><br/><p><span style=\"\">“Huh-uhk, huhk.” </span></p><br/><p><span style=\"\">He looked to be hurt, and the man kept looking around his surrounding as if he was being chased by someone.  The light within his eyes shook.</span></p><br/><p><span style=\"\">‘Is this for real?’ </span></p><br/><p><span style=\"\">The knowledge that was in his mind was too vivid to call it a delusion.</span></p><br/><p><span style=\"\">‘If you do as I say, Haeyun will live.’ </span></p><br/><p><span style=\"\">He was merely a Rank E Roused. This might be god's mercy, and this was god attempting to fix his ailing daughter.</span></p><br/><p><span style=\"\">He didn't care if this was god's grace or a devil's temptation.  He just wanted his sick Haeyun to be healed.</span></p><br/><p><span style=\"\">‘I have to do it.’ </span></p><br/><p><span style=\"\">He didn't have any alternatives.</span></p><br/><p><span style=\"\">The man slowly headed towards the entrance of the Hongdae station.</span></p><br/><p><span style=\"\">The 1st exit was just Reset, so the police was guarding it. The place was bustling as the Roused Bureau was measuring the Dungeon Energy.</span></p><br/><p><span style=\"\">“Uh uh? Please step back.  It's dangerous here.” </span></p><br/><p><span style=\"\">When the policeman took his eyes off the man, he rushed forward.</span></p><br/><p><span style=\"\">“Uh uh? Who is that? Detain him!” </span></p><br/><p><span style=\"\">Before the alerted policemen could give chase, the man had already entered the Dungeon.  It almost looked as if he had rolled down the stairs.</span></p><br/>\n</div>"}