{"title": "Chapter 134 - Mivich", "id": 134, "volume": 2, "url": "http://boxnovel.org/seoul-station%E2%80%99s-necromancer-chapter-134-mivich", "volume_title": "Volume 2", "body": "<h1>Chapter 134 - Mivich</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><span style=\"\">Chapter 134 - Mivich</span></p><br/><p><span style=\"\">Ddi-deek, teek. </span></p><br/><p><span style=\"\">The fluorescent light blinked on and off.  The members of the Hot Girls looked at each other in surprise. The light looked as if it was about to turn off when the building shook.</span></p><br/><p><span style=\"\">“What is that? Did you just feel that?” </span></p><br/><p><span style=\"\">“Is it an earthquake?” </span></p><br/><p><span style=\"\">There were several new groups inside the ready room including the Hot Girls.  Soolgi grabbed the hands of her group members as she looked on with worry in her eyes.</span></p><br/><p><span style=\"\">“We'll be fine.” </span></p><br/><p><span style=\"\">The evacuation alarm rang out immediately after she spoke her words. The noisy siren let out a bright light.</span></p><br/><p><span style=\"\">Ehhhhhhhhhng! </span></p><br/><p><span style=\"\">“Kyahhhhhhhk!” </span></p><br/><p><span style=\"\">“What? What's wrong?” </span></p><br/><p><span style=\"\">The sudden sound of the siren, a screaming person and the disarray of people caused the waiting room to devolve into chaos. Hot Girl's Soolgi was also taken aback.</span></p><br/><p><span style=\"\">She remembered the evacuation directions she learned from her school curriculum, so she yelled out.</span></p><br/><p><span style=\"\">“Shelter! We have to get to the shelter.” </span></p><br/><p><span style=\"\">After the Dungeon Shock, every building was required to construct a shelter within.</span></p><br/><p><span style=\"\">Soolgi's words caused the frightened people to rush out into the hallway.  It was the middle of the day, yet the hallway was dark with the light off.  It amplified the fear being felt by the people. Everyone rushed towards the sign of the fire exit.</span></p><br/><p><span style=\"\">When one person started to run, everyone followed suit. Soolgi felt a sense of danger.</span></p><br/><p><span style=\"\">‘We should evacuate slowly and in order….’ </span></p><br/><p><span style=\"\">She had learned that evacuations should proceed in an ordered manner.  It prevented additional accidents from happening.  However, this was only possible in training drills.</span></p><br/><p><span style=\"\">In reality, fear made everyone run down the stair.  They wanted to live.</span></p><br/><p><span style=\"\">“Let's go, unni!” </span></p><br/><p><span style=\"\">Soolgi and the members of the Hot Girls tried their best to follow behind the group of people.  The people were rushing down the emergency staircase when everyone suddenly came to a stop. </span></p><br/><p><span style=\"\">Koo-roo-roo-roo! </span></p><br/><p><span style=\"\">They heard breathing, and it was clear that it wasn’t the sound of a human breathing.  Moreover, it was accompanied by the sound of people screaming!</span></p><br/><p><span style=\"\">Kwahng, kwah-jeek! </span></p><br/><p><span style=\"\">“Ggoo-ahhhhhh!” </span></p><br/><p><span style=\"\">Soolgi couldn't see down to the end of the staircase, but she could tell something serious was going on down there. Her mind went to the most likely catastrophe.</span></p><br/><p><span style=\"\">‘It's a Dungeon Break.’ </span></p><br/><p><span style=\"\">She was sure monsters had appeared at the broadcasting station.</span></p><br/><p><span style=\"\">“Hoo-oohk, hook.” </span></p><br/><p><span style=\"\">Numerous employees of the broadcasting station were present, but the girl groups were made up of girls in their teens and 20s. Most of the girls had their two hands over their mouths, and they were barely able to hold back a scream as they cried.</span></p><br/><p><span style=\"\">“L...let's exit here.” </span></p><br/><p><span style=\"\">A member of the boyband named Tony spoke quietly, and they quietly exited the emergency stairway.  They looked at the floor number, and they were on the 7th floor.</span></p><br/><p><span style=\"\">“There is another emergency staircase over there.” </span></p><br/><p><span style=\"\">Tony aggressively took the lead, so everyone followed his directions. They walked carefully as if they were afraid they would be found out by the monsters.  They opened the door to the other emergency staircase, but the situation was the same.</span></p><br/><p><span style=\"\">“Ggoo-ah-ahhk! Help me.” </span></p><br/><p><span style=\"\">Kwah-jeek, koo-roo-roohk.</span></p><br/><p><span style=\"\">Everyone immediately stopped walking when they heard the noise coming from the opened door to the staircase.  When they carefully closed the door again, one could hear women crying, and several people were standing in place absent-mindedly as if they were distracted.</span></p><br/><p><span style=\"\">Everyone looked at Tony.</span></p><br/><p><span style=\"\">“What should we do?” </span></p><br/><p><span style=\"\">“W...why me....” </span></p><br/><p><span style=\"\">He was a little bit more assertive than others, but he was still a normal male idol. The current situation frightened him too.  Even if they asked him for directions, his mind was blank.</span></p><br/><p><span style=\"\">Kwahng, kwahng! </span></p><br/><p><span style=\"\">At that moment, a vibration rang out from the emergency staircase, and they could hear something getting closer to them.  Everyone instinctively distanced themselves from the door.</span></p><br/><p><span style=\"\">“L...let's go to that room.” </span></p><br/><p><span style=\"\">When someone yelled out the suggestion, they opened the door, and they entered a spacious office.</span></p><br/><p><span style=\"\">“B...block the entrance.” </span></p><br/><p><span style=\"\">They moved desks and furnitures to block the entrance.  As if they felt a little bit relieved, people started speaking to each other in quiet voices.  It was as if they were trying to shed their nervousness.</span></p><br/><p><span style=\"\">Several people started to cry again. Soolgi hugged the crying members of the Hot Girls as she tried to console them.</span></p><br/><p><span style=\"\">“Hook.  What should we do, unni?” </span></p><br/><p><span style=\"\">The members of Hot Girls were still in high school.  Soolgi was the oldest of the bunch, so she hardened her heart.</span></p><br/><p><span style=\"\">“It's all right.  Don't worry.  Someone will come rescue us soon.” </span></p><br/><p><span style=\"\">Whether it was the Roused or the soldiers, the monsters would be eradicated soon.  It would be better if they were at a shelter, but the office was good enough.  They just had to hide in safety.</span></p><br/><p><span style=\"\">However, even a small task like that was too hard.</span></p><br/><p><span style=\"\">Koong, koo-oohng! </span></p><br/><p><span style=\"\">When something roughly banged into the door, everyone became surprised.  Their bodies convulsed.</span></p><br/><p><span style=\"\">“Kyahhhk! What are we going to do!” </span></p><br/><p><span style=\"\">“Be quiet! Everyone hide!” </span></p><br/><p><span style=\"\">No one dared to approach the door, and everyone tried to find a place to hide that was as far from the door as possible.</span></p><br/><p><span style=\"\">Kwah-ah-ahng! </span></p><br/><p><span style=\"\">The furnitures were roughly pushed aside, and an enormous black panther appeared from across the door.</span></p><br/><p><span style=\"\">Koo-roo-rook! </span></p><br/><p><span style=\"\">“Heek!” </span></p><br/><p><span style=\"\">Tony met eyes with the black panther, and his body froze.</span></p><br/><p><span style=\"\">Kwahhhng! </span></p><br/><p><span style=\"\">The black panther ran in as it swung its paw.  Tony's face was ripped right off his skull.</span></p><br/><p><span style=\"\">“……!” </span></p><br/><p><span style=\"\">The incident happened in an instant.</span></p><br/><p><span style=\"\">Silence descended, and it was accompanied by extreme fear.</span></p><br/><p><span style=\"\">This wasn't a movie, training drill or even a haunted house experience.</span></p><br/><p><span style=\"\">This wasn't some prank.  It was reality, and it was a catastrophe.</span></p><br/><p><span style=\"\">Koo-wahhhhng! </span></p><br/><p><span style=\"\">The black panther caused the people's body to freeze into immobility.  All they could do was shake as they didn't know what to do.  The black panther looked at the humans huddled together.  Earth was overflowing with easy preys.  It felt satisfaction as it was about to slowly start its slaughter.  </span></p><br/><p><span style=\"\">Kwah-chahng! </span></p><br/><p><span style=\"\">A flock of bats broke through the window.  The bats gathered in a single location, and they transformed into a person.</span></p><br/><p><span style=\"\">It was a man wearing a black coat.  Everyone's face lit up with hope at the appearance of Do-jaemin.</span></p><br/><p><span style=\"\">‘It's a Roused!’ </span></p><br/><p><span style=\"\">Koo-roo-roohk. </span></p><br/><p><span style=\"\">The black panther glared at the figure, and it attacked first.  It jumped into the air and it swung its paws.  It's front paw was strong enough to bend steel.  Instead of avoiding it, Jaemin swung his fist.</span></p><br/><p><span style=\"\">Kwahk! </span></p><br/><p><span style=\"\">The full weight of the black panther was behind its attack, but it couldn't win against the fist of a vampire, who had been tempered by drinking blood everyday.</span></p><br/><p><span style=\"\">Koo-wahng! </span></p><br/><p><span style=\"\">Before the shocked black panther could land on the ground, Jaemin kicked it.</span></p><br/><p><span style=\"\">Kwah-jeek! </span></p><br/><p><span style=\"\">He couldn't kill it with a single blow, but the shock was enough to give the panther a whiplash.  Moreover, his kick wasn't the end to his attack.</span></p><br/><p><span style=\"\">Kwahng, kwahk! </span></p><br/><p><span style=\"\">He crushed the black panther's head with his foot, and its large body moved no more.  The man wearing a black coat had dropped his sunglasses during the fight, so he went to pick it up.</span></p><br/><p><span style=\"\">“W...we're saved!” </span></p><br/><p><span style=\"\">“Hoo-oohk, hoooooooong.” </span></p><br/><p><span style=\"\">The people cried in relief when they saw the Roused, who had come to save them.</span></p><br/><p><span style=\"\">During all of this, Jaemin was searching for Soolgi.</span></p><br/><p><span style=\"\">“Soolgi?” </span></p><br/><p><span style=\"\">“……!” </span></p><br/><p><span style=\"\">Soolgi's eyes turned round when her name came out of the Roused's mouth.  The familiar jawline, body type, and even his voice....</span></p><br/><p><span style=\"\">“Jaemin?” </span></p><br/><p><span style=\"\">Do-jaemin walked towards Soolgi.  He had searched all over the broadcasting station.  He had finally found her.  He was thankful that she was still alive in this mess.</span></p><br/><p><span style=\"\">“Oppa is here, Soolgi.” </span></p><br/><p><span style=\"\">Do-jaemin spoke playfully as he opened both his arms.  Tears started to flow out of Soolgi's eyes.</span></p><br/><p><span style=\"\">“You idiot.  You are 7 month late.” </span></p><br/><p><span style=\"\">He watched her cry as she replied.  He had a smile that expressed his sadness and a little bit of bitterness.  Her trembling, fear and relief was all conveyed to him. </span></p><br/><p><span style=\"\">“It's all right. Everything is fine now.” </span></p><br/><p><span style=\"\">He had thought his body had been cursed when he was turned into a vampire.</span></p><br/><p><span style=\"\">At that moment, he was thankful for the strength that had allowed him to protect someone precious to him.</span></p><br/><p><span style=\"\">*** </span></p><br/><p><span style=\"\">“Wow.  What the hell?  It's another break?” </span></p><br/><p><span style=\"\">Sungoo had exited the Dungeon after he finished clearing it.  His eyes turned round when he was immediately given the news about the current situation.</span></p><br/><p><span style=\"\">“What's happening near Alandal?” </span></p><br/><p><span style=\"\">“Director Che-haesol is defending the place.” </span></p><br/><p><span style=\"\">Che-haesol's ability was at Rank B.  However, she had successfully Tamed a Wyvern recently, so it wouldn’t be an exaggeration to say her monster collection was equal to 10 Rank A Roused.</span></p><br/><p><span style=\"\">“Which area suffered the most?” </span></p><br/><p><span style=\"\">“We have to head back to Alandal.” </span></p><br/><p><span style=\"\">“Huh? Haesol is there.” </span></p><br/><p><span style=\"\">“Our region needs us the most.” </span></p><br/><p><span style=\"\">It seemed the Dungeons near the vicinity of Alandal had Broken out.</span></p><br/><p><span style=\"\">“A Dragon has appeared on top of Namsan.  The monsters that broke out from various parts of Seoul are all heading towards Namsan.” </span></p><br/><p><span style=\"\">The support team employee's words made Sunggo put on a serious expression.</span></p><br/><p><span style=\"\">“What about hyung-nim?” </span></p><br/><p><span style=\"\">“He hasn't come out of the Dungeon yet.” </span></p><br/><p><span style=\"\">“Hmmm.” </span></p><br/><p><span style=\"\">If Kahng-woojin wasn't here, he would have to step forward.</span></p><br/><p><span style=\"\">“Let's go to Alandal.” </span></p><br/><p><span style=\"\">Sunggoo got on the car with a resolute expression.  This time he'll carry the fair share of the burden.</span></p><br/><p><span style=\"\"> *** </span></p><br/><p><span style=\"\">Hotel near the Hongdae Station.</span></p><br/><p><span style=\"\">‘Ooh-oohp.’ </span></p><br/><p><span style=\"\">Do-jiwon struggled,  since she was having a hard time breathing.  She couldn't move an inch. Thread-like spider web was wrapped tightly around her like a cocoon.  The sight seen through the spider web, which was woven like a net, was disturbing.</span></p><br/><p><span style=\"\">Numerous white cocoons were hanging all over the ceiling.</span></p><br/><p><span style=\"\">Of course, she was in the same boat as everyone else.</span></p><br/><p><span style=\"\">‘I can't breathe.’ </span></p><br/><p><span style=\"\">She was barely able to maintain her breathing.  Moreover, there was a unique scent emanating from the spider web, and it made one's mind lazy and faint.  It was becoming hard for her to think straight. She had a feeling that she would be in trouble if she fell asleep.</span></p><br/><p><span style=\"\">The Spider Queen Sharot had made the cocoons.  She smiled as she stored away the humans.</span></p><br/><p><span style=\"\">“Yo-ho-ho. I never knew such a great planet existed.” </span></p><br/><p><span style=\"\">The hunt was easy, and the planet was overflowing with preys called humans. It was almost a miracle that no coalition had laid claim to such a great hunting ground.</span></p><br/><p><span style=\"\">“Are the planet's guardians of high quality?” </span></p><br/><p><span style=\"\">All the linked Dungeons that had tried to synchronize with earth had been destroyed.</span></p><br/><p><span style=\"\">Their coalition of Yellow Lizard had to incur a penalty to be able to force a link.  They received help from an outsider.  It was an 'invite' instead of an 'invasion'. </span></p><br/><p><span style=\"\">Of course, the power to make an outsider a linker was something only the 72 great lords could do.</span></p><br/><p><span style=\"\">Only they could force a link to planets without any restrictions.</span></p><br/><p><span style=\"\">“Hmmm.  This is a planet coveted by Iello-nim...” </span></p><br/><p><span style=\"\">The 25th Throne Iello had made the Linkers.  He had helped the Yellow Lizards arrive in this place.</span></p><br/><p><span style=\"\">Sharot was covetous of the planet called earth.  However, Iello had laid a claim to it, so it didn't matter if she coveted it or not.  This place would become the battlefield for the forces of the great lords with Thrones.</span></p><br/><p><span style=\"\">“Well, shall I start the colonization?” </span></p><br/><p><span style=\"\">She had to exterminate all the humans, who possessed power. This will make the exploitation of this planet easier.</span></p><br/><p><span style=\"\">Sharot approached a nearby cocoon, and she extended her hand.</span></p><br/><p><span style=\"\">When the cocoon was unravelled, a frightened face appeared.</span></p><br/><p><span style=\"\">“Hoong.” </span></p><br/><p><span style=\"\">She let out an excited moan as she brought her mouth close to the human's mouth.</span></p><br/><p><span style=\"\">Ggool-rung, gool-rung.</span></p><br/><p><span style=\"\">Something unpleasant was being passed through Sharot's mouth into the human, and his expression was quickly deteriorating.  He felt nausea and pain.  His eyes became red as if the vessels in his eyes were bursting</span></p><br/><p><span style=\"\">When Sharot pulled her lips away, the man in the cocoon struggled mightily.</span></p><br/><p><span style=\"\">Humans provided the best nutrition for her eggs..</span></p><br/><p><span style=\"\">“Hoong.  Grow my lovelies.  My babies.” </span></p><br/><p><span style=\"\">Sharot headed towards the next cocoon, and she started to lay her eggs.</span></p><br/><p><span style=\"\">If one wanted to destroy a planet with such an advanced civilization, large monsters like the Titan race were unsuitable for the job.  Small monsters like the Killer Spiders were more suitable.</span></p><br/><p><span style=\"\">Sharot was quickly increasing the number of her children, who were also her underlings.</span></p><br/><p><span style=\"\">Moreover, the other Dimensional lords were starting to build their main base like her in various parts of this world.</span></p><br/><p><span style=\"\">*** </span></p><br/><p><span style=\"\">Dimensional Domain Mivich's Meadow.</span></p><br/><p><span style=\"\">He was almost at the green pillar of light.</span></p><br/><p><span style=\"\">The pillar of light was emanating from an old castle.  Woojin headed towards the castle.</span></p><br/><p><span style=\"\">There was a person waiting in front of the gate of the fallen castle.</span></p><br/><p><span style=\"\">“What? You are alone?” </span></p><br/><p><span style=\"\">Woojin got off Shing Shing.</span></p><br/><p><span style=\"\">The man was wearing a hood over his face, but Woojin could tell he was a human.  Moreover, his hunch was telling him he was right.</span></p><br/><p><span style=\"\">When Woojin approached his opponent, the man slowly stood up.</span></p><br/><p><span style=\"\">“Are you Mivich?” </span></p><br/><p><span style=\"\">“…….” </span></p><br/><p><span style=\"\">His opponent didn't respond, so Woojin knew he was right.</span></p><br/><p><span style=\"\">He was the owner of this Dimensional Domain.</span></p><br/><p><span style=\"\">How much confidence did he have in himself that he was guarding the Domain all by himself? Or was he out of Dungeon Energy?  If so, then why did he fearlessly form a link to Earth?</span></p><br/><p><span style=\"\">Mivich slowly took off his hood.</span></p><br/><p><span style=\"\">“It's been awhile.” </span></p><br/><p><span style=\"\">“…….” </span></p><br/><p><span style=\"\">When he caught sight of Mivich's face, Woojin's face hardened.  On the other hand, Mivich had a smile on his face.</span></p><br/><p><span style=\"\">“It's been a long time, right?  Immortal.” </span></p><br/><p><span style=\"\">“…….” </span></p><br/><p><span style=\"\">Woojin let out a bitter laugh at the unwelcome face.</span></p><br/><p><span style=\"\">“What's the Alphen's hero doing here?” </span></p><br/><p><span style=\"\">“Make a guess.” </span></p><br/><p><span style=\"\">Dimensional lord Mivich had a queer smile on his face.</span></p><br/>\n</div>"}