{"title": "Chapter 138 - Lord of Pestilence", "id": 138, "volume": 2, "url": "http://boxnovel.org/seoul-station%E2%80%99s-necromancer-chapter-138-lord-of-pestilence", "volume_title": "Volume 2", "body": "<h1>Chapter 138 - Lord of Pestilence</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><span style=\"\">Chapter 138 - Lord of Pestilence</span></p><br/><p><span style=\"\">Bibi's large clear eyes had a strange appeal of catching other people's gazes.</span></p><br/><p><span style=\"\">No.  She was from the demonic race, so should this be called her magic?</span></p><br/><p><span style=\"\">Zeeeeeeng. </span></p><br/><p><span style=\"\">Dolsae reeked of blood.  He was roughly charging towards the group when Dolsae hesitated. </span></p><br/><p><span style=\"\">He gradually slowed down to a walk.</span></p><br/><p><span style=\"\">“That's our Dolsae-jjing. Are you a good boy?” </span></p><br/><p><span style=\"\">Blood started to melt off him at every step he took.  His body started to shrink as blood pooled on the floor.</span></p><br/><p><span style=\"\">“Is our Dolsae-jing angry?” </span></p><br/><p><span style=\"\">[Goo-roo-roo.] </span></p><br/><p><span style=\"\">His anger had run away from him. He was like wild animal that had escaped from his cage.  He felt hatred towards the living. However, Bibi's voice transformed into a warm energy, and it caressed Dolsae's Heart.</span></p><br/><p><span style=\"\">“Noonah understands.  Why don't you let go of your anger now?” </span></p><br/><p><span style=\"\">Bibi's small hand touched Dolsae's head.</span></p><br/><p><span style=\"\">[Goo-rook.] </span></p><br/><p><span style=\"\">Choo-roo-roo-rook. </span></p><br/><p><span style=\"\">The hardened blood around the Golem's Heart quickly melted away. The sticky blood was soaking her shoes, but Bibi didn't move an inch.</span></p><br/><p><span style=\"\">Weeeeeeng. </span></p><br/><p><span style=\"\">When the blood disappeared, the Golem's Heart was back to being a light essence, and it circled around Bibi's head.  Bibi grinned as she pointed her staff towards the cars located on one side of the parking lot.</span></p><br/><p><span style=\"\">It was a location close to the entrance of the broadcasting stations.  There were sparkling cars that looked to be luxury cars.</span></p><br/><p><span style=\"\">“Heheh.  Our kind Dolsae. They say those cars are more sturdy.” </span></p><br/><p><span style=\"\">Weeeeeeng. </span></p><br/><p><span style=\"\">Dolsae pulled together couple cars, and he was back to his Iron Golem form.</span></p><br/><p><span style=\"\">“Well, shall we go to our master after we pull this tree out?” </span></p><br/><p><span style=\"\">[Goo-oh-oh-oh.] </span></p><br/><p><span style=\"\">Dolsae moved his clinking body towards the growing tree.</span></p><br/><p><span style=\"\">*** </span></p><br/><p><span style=\"\">It wasn't difficult to find the building hosting the reunion party with Jiwon in attendance. The large building was entirely covered with spider webs. Even the surrounding buildings were infested with spiders that kept spewing out spider webs.</span></p><br/><p><span style=\"\">“An annoying one came here.” </span></p><br/><p><span style=\"\">The Insect type Dimensional lord was similar in nature as the underlings under its control.  Moreover, they reproduced very fast, so the high population was usually a big hindrance.  </span></p><br/><p><span style=\"\">However, this was the type of enemies that was very easy to deal with for Woojin.</span></p><br/><p><span style=\"\">Swahhhhng! </span></p><br/><p><span style=\"\">Ggoo-ehk! </span></p><br/><p><span style=\"\">The Bone Spears shot out from Woojin's hand, and they pierced through the spiders.</span></p><br/><p><span style=\"\">When several corpses started to pile up, he immediately raised the Skeleton Warriors.</span></p><br/><p><span style=\"\">Pah-paht! </span></p><br/><p><span style=\"\">Currently, the Control he had consumed was all for his familiars.</span></p><br/><p><span style=\"\">If he excluded the most recent Death Knight Relick from the Ratick race, every one of his familiar had been with him for a long time.  Even if his absolute will and Control as a Necromancer didn't reach his familiars, they were his comrades.</span></p><br/><p><span style=\"\">The combined Control he needed to maintain his Familiar was less than 100.  This was why Woojin could easily summon over 2000 Skeletons.</span></p><br/><p><span style=\"\">“Let's see who is faster.” </span></p><br/><p><span style=\"\">It was a race to see if Woojin's extermination was faster or his opponent's breeding was faster. </span></p><br/><p><span style=\"\">Kee-kee-keek! </span></p><br/><p><span style=\"\">The Skeleton Warriors cut through spider webs, and they entered the building.  Woojin summoned his long sword.  </span></p><br/><p><span style=\"\">When he reached level 70 of the Warrior's Class, he gained the ability to change his weapon into a long sword.</span></p><br/><p><span style=\"\">The basic form was the staff, but It was also able to change into a spear, hammer, great sword, axe and bow.  There were a total of seven forms.</span></p><br/><p><span style=\"\">If he excluded the bow, all the other forms were for close combat.</span></p><br/><p><span style=\"\">Recently, Woojin enjoyed using the sword.  The light long sword was easy to swing, and he was able to change the weapon’s form through his will.</span></p><br/><p><span style=\"\">Shwahhk, puh-uhk! </span></p><br/><p><span style=\"\">The spider webs was all over the walls and ceiling.  He charged as he cut away the spider webs, and at times, spiders suddenly jumped out at him from within the webs.  He cut them down, but some spiders were still alive even when their body was cut in half.  They kept twitching.</span></p><br/><p><span style=\"\">Kwah-jeek! </span></p><br/><p><span style=\"\">Woojin stepped on the spider, and its life expired.</span></p><br/><p><span style=\"\">Anyone could take away life, but Woojin was able to breathe life into dead things.</span></p><br/><p><span style=\"\">Puh-puhk! </span></p><br/><p><span style=\"\">The spider's corpse exploded, and a Skeleton Mage was summoned.</span></p><br/><p><span style=\"\">“Burn them all.” </span></p><br/><p><span style=\"\">Hwah-roo-roohk! </span></p><br/><p><span style=\"\">The Skeleton Mages only used a single type of magic, and the type of magic differed on each summon.  Woojin was still below level 80, so he didn't have the Lich.  This meant he could only summon the Skeleton Mages at random.</span></p><br/><p><span style=\"\">If he was lucky, he would summon Skeleton Mages that used Flame magic.</span></p><br/><p><span style=\"\">He called out his familiar, who lived as a parasite inside Woojin's shadow.  He was also the most unpleasant one of his familiars.</span></p><br/><p><span style=\"\">“Ggaebi.” </span></p><br/><p><span style=\"\">[Koo-koohk.  I almost forgot what master's voice sounded like.] </span></p><br/><p><span style=\"\">“Shut up, and go find Jiwon..” </span></p><br/><p><span style=\"\">[Did you think I wouldn't?] </span></p><br/><p><span style=\"\">Ggaebi melted into the building, and he started looking for Do-jiwon's location.</span></p><br/><p><span style=\"\">[Dear, dear. She isn't doing well.] </span></p><br/><p><span style=\"\">“Why?” </span></p><br/><p><span style=\"\">[It seems she'll become spider food soon. Koo-koohk.] </span></p><br/><p><span style=\"\">Woojin frowned. It seemed the people were being used as hosts to incubate the baby spiders.</span></p><br/><p><span style=\"\">He didn't have much time.</span></p><br/><p><span style=\"\">“Go back in.” </span></p><br/><p><span style=\"\">[Kooh-koohk.  Will your fiance's death awaken the Immortal?] </span></p><br/><p><span style=\"\">“Shut up and go back in.” </span></p><br/><p><span style=\"\">[Koo-koo-kook.] </span></p><br/><p><span style=\"\">Ggaebi slipped back into Woojin's shadow. Woojin saw, heard and felt what Ggaebi experienced.  The knowledge settled inside Woojin's head.</span></p><br/><p><span style=\"\">Jiwon was on the 7th floor.</span></p><br/><p><span style=\"\">The banquet hall was covered in spider webs.  The humans were in a cocoon, and they were hanging off the ceiling.  On the floor, the hatched baby spiders were moving in large groups.</span></p><br/><p><span style=\"\">A spider-human felt the energy from her clear soul, so it was heading towards Jiwon.  He didn't have any time to spare.</span></p><br/><p><span style=\"\">Woojin looked at the ceiling.</span></p><br/><p><span style=\"\">He changed his Warrior's Weapon into a hammer.</span></p><br/><p><span style=\"\">The energy of the 'Earth Strike' turned the hammer red.</span></p><br/><p><span style=\"\">He bent his knees.</span></p><br/><p><span style=\"\">Woojin gathered the power of 'Dash' and ‘Jump’ into his legs.</span></p><br/><p><span style=\"\">Ggwahhng! </span></p><br/><p><span style=\"\">Woojin's body shot up like a bullet. The floor collapsed on itself.  The shockwave blew out all the windows in a row.</span></p><br/><p><span style=\"\">Koo-koo-koo-koohng! </span></p><br/><p><span style=\"\">His body broke through each floor, and Woojin finally broke through to 7th floor.</span></p><br/><p><span style=\"\">Ggoo-roo-roong! </span></p><br/><p><span style=\"\">The entire building shook.</span></p><br/><p><span style=\"\">The spider human Sharot was surprised when Woojin showed up in such a tough manner. However, she started laughing in short order.</span></p><br/><p><span style=\"\">[Yo-ho-ho.  I never expected earth to have Warrior of your caliber.] </span></p><br/><p><span style=\"\">Did the planet earth have a lot of high quality Roused like the human in front of her?  Is this the reason why the Dimensional lords had a hard time linking to this place?</span></p><br/><p><span style=\"\">Juh-buhk, juh-buhk. </span></p><br/><p><span style=\"\">Woojin walked without saying anything.</span></p><br/><p><span style=\"\">[Yo-ho. Warriors are so careless.] </span></p><br/><p><span style=\"\">Sharot prepared her magic for Woojin, who was approaching her without any fear.  However, his direction was a bit off. He walked past Sharot, and he head towards a specific cocoon.</span></p><br/><p><span style=\"\">She spoke in a sharp voice when he just brushed by her.</span></p><br/><p><span style=\"\">[Insolence!] </span></p><br/><p><span style=\"\">He was close enough for her to touch.</span></p><br/><p><span style=\"\">Was he that confident? She had suffered from the forced link where her power decreased proportional to the Synchronization rate.  Still, how dare he ignore a Dimensional lord like her?</span></p><br/><p><span style=\"\">She immediately extended both her hands.</span></p><br/><p><span style=\"\">Pah-jee-jeek! </span></p><br/><p><span style=\"\">Her fingernails were like poisonous fangs.  Before she could catch Woojin, the Spirit Armor activated around Woojin. A powerful repulsive force flung Sharot away.</span></p><br/><p><span style=\"\">[Kyahhhk!] </span></p><br/><p><span style=\"\">Woojin stood in front of the cocoon.</span></p><br/><p><span style=\"\">Zzee-ji-jeek! </span></p><br/><p><span style=\"\">He dug through the spider webs, and he saw Do-jiwon's face.  She was hanging upside down.  It looked as if she had been hanging inverted for so long that her face was red.  It was so red that it looked as if her head might burst.</span></p><br/><p><span style=\"\">“W...Woojin-ah.” </span></p><br/><p><span style=\"\">Paht! </span></p><br/><p><span style=\"\">Woojin easily ripped away the cocoon.  He pulled away the spider webs that was restraining her.</span></p><br/><p><span style=\"\">“Ooh-oohk.” </span></p><br/><p><span style=\"\">Her blood flow had suddenly returned to normal, so she was having a hard time standing on her own two feet.  She leaned against Woojin's body.  Woojin's arm wrapped around her waist.</span></p><br/><p><span style=\"\">“Woojin-ah.” </span></p><br/><p><span style=\"\">Woojin felt relief when he heard her tearful voice.</span></p><br/><p><span style=\"\">He hadn't been too late.</span></p><br/><p><span style=\"\">“Our friends….” </span></p><br/><p><span style=\"\">Woojin looked around his surrounding. There were well over 100 cocoons here.  There were still a lot of them hanging on the ceiling, but there were also some that had burst open.  Bones were stacked below the cocoons that had burst open.</span></p><br/><p><span style=\"\">All the people here had once been his fellow school mates.</span></p><br/><p><span style=\"\">“I was too late.” </span></p><br/><p><span style=\"\">Would he have been able to save everyone if he hd come to the reunion?</span></p><br/><p><span style=\"\">It wasn't as if he could change the outcome by regretting over the choice he made.</span></p><br/><p><span style=\"\">He had explicitly stated that he wouldn't be coming to the reunion, yet people still showed up for the remote chance of seeing the world's best Roused Kahng-woojin.  Maybe they wanted a photo proving that they went to school with the world's most famous man?</span></p><br/><p><span style=\"\">[Kyahh-roo. How dare a human do this to me.] </span></p><br/><p><span style=\"\">There was only thing he could do for his friends, who had departed this world early.  There was one thing he could do as a consolation.</span></p><br/><p><span style=\"\">[Spider. What is your name?] </span></p><br/><p><span style=\"\">[…how are you able to speak to me?] </span></p><br/><p><span style=\"\">When the octopus Dread and several Dimensional lords kept visiting him, Woojin had taken several language pills.  One of the language was being used by the spider woman.</span></p><br/><p><span style=\"\">[Is your IQ lacking because you are a spider?] </span></p><br/><p><span style=\"\">[Koo-roohk.  How dare….] </span></p><br/><p><span style=\"\">[What is your name?] </span></p><br/><p><span style=\"\">[I'm a Dimensional lord from the Yellow Lizard coalition.  My name is Sharot.] </span></p><br/><p><span style=\"\">[You are in the same coalition as that octopus.] </span></p><br/><p><span style=\"\">Woojin lifted his hammer, and he rested it on his shoulder.</span></p><br/><p><span style=\"\">Sharot eyed him.</span></p><br/><p><span style=\"\">[So you are the new Dimensional lord he mentioned.  Was it Kahng-woojin?  Yes.  He said you were from this planet.] </span></p><br/><p><span style=\"\">Sharot deliberately looked over Woojin's face.  Dread had tried hard to recruit him to their coalition, yet Dread had been stabbed in the back by him.</span></p><br/><p><span style=\"\">[I'll kill all of you.] </span></p><br/><p><span style=\"\">[Hoong.  Death to a Dimensional lord is...] </span></p><br/><p><span style=\"\">[You'll revive. Then I'll kill you again.  You’ll keep reviving, and I'll keep killing you all.] </span></p><br/><p><span style=\"\">He'll keep killing them every time they revived. If they don't accept his Duel requests, he'll just go the the Dungeons on planet Jaku to kill them. He'll thoroughly destroy their Dimensional Domain, then he'll steal their rank of Dimensional lord away from them.  In the end, he'll bring death to all of  them. </span></p><br/><p><span style=\"\">[…….] </span></p><br/><p><span style=\"\">[Let's fight.] </span></p><br/><p><span style=\"\">[This is quite puzzling.  Is this all because of the small friction between you and Dread?  Is there a reason why you are so resolute in getting in our way?  If you thought about it a little bit, you'll realize that your actions are pointless.] </span></p><br/><p><span style=\"\">Was he being so hostile towards them, because of the friction between him and Dread? Or was it because they invaded his home planet?</span></p><br/><p><span style=\"\">Woojin grinned as he raised his hammer.</span></p><br/><p><span style=\"\">[Do I need a reason to kill a bug?] </span></p><br/><p><span style=\"\">[…….] </span></p><br/><p><span style=\"\">Koohng! </span></p><br/><p><span style=\"\">Woojin's Hammer struck the floor.  The shockwave flowed across the floor.</span></p><br/><p><span style=\"\">Pah-sahk, pahk! </span></p><br/><p><span style=\"\">The shockwave made the baby spiders explode.  The entire building rang out.</span></p><br/><p><span style=\"\">[How dare you.  My young...] </span></p><br/><p><span style=\"\">Before she could glare at Woojin in anger, she became surprised. She felt a searing pain in her stomach, and she felt her body being lifted into the air.</span></p><br/><p><span style=\"\">Kwah-jeek! </span></p><br/><p><span style=\"\">Woojin had already rushed forward, and he had changed his hammer into a spear.  The weapon pierced through Sharot's stomach, and she was pinned to the pillar of the building.</span></p><br/><p><span style=\"\">Sharot's four legs were tipped with poison, and they tried to stab at Woojin.  However, he had let go of his spear, and he jumped away from her.</span></p><br/><p><span style=\"\">[Koo-oohk.] </span></p><br/><p><span style=\"\">Woojin couldn't help it when he saw Sharot pinned against the wall.  He laughed.</span></p><br/><p><span style=\"\">‘I guess I’m a little bit nuts’’ </span></p><br/><p><span style=\"\">He had no choice, but to accept that fact. He couldn’t stay serious.  Maybe, his anger wasn’t that strong right now.</span></p><br/><p><span style=\"\">When he saw Sharot stuck to the wall, he thought about the summer assignment he completed when he was little.  It was an assignment where he had to pin a bug.</span></p><br/><p><span style=\"\">[You can look forward to the day you revive.  I'll search you out soon afterwards, and I'll kill you.] </span></p><br/><p><span style=\"\">Woojin summoned his Bone Spears, and he threw it all at once as if he was throwing the spears against a dart board.</span></p><br/><p><span style=\"\">Pah-pah-paht! </span></p><br/><p><span style=\"\">The Bone Spears embedded themselves in various locations on Sharot's body.</span></p><br/><p><span style=\"\">[T...this humiliation!  I will...] </span></p><br/><p><span style=\"\">Kwah-jeek! </span></p><br/><p><span style=\"\">The last Bone Spear embedded itself in Sharot's head, and she stopped moving.</span></p><br/><p><span style=\"\">“W...Woojin-ah.” </span></p><br/><p><span style=\"\">The living baby spiders were gathering around Jiwon.  They were baby spiders, but the smallest one was the size of a person hand.  The larger ones were the size of a human body.</span></p><br/><p><span style=\"\">Swahhhhng. </span></p><br/><p><span style=\"\">The souls that belonged to the Spirit Armor became Spirit Spears.  It flew towards the spiders.Pah-sahk! </span></p><br/><p><span style=\"\">When the Spirit Spear impacted on the spiders, they fell away dead.</span></p><br/><p><span style=\"\">“Rise!” </span></p><br/><p><span style=\"\">Pah-pah-paht! </span></p><br/><p><span style=\"\">At Woojin’s summon, numerous Skeleton Warriors and Skeleton Magicians were summoned. There were over 500 of them.</span></p><br/><p><span style=\"\">“Sweep this place.” </span></p><br/><p><span style=\"\">Kee-kee-keek. </span></p><br/><p><span style=\"\">The Skeletons started to stab the numerous baby spiders.  When the clean-up ended, the Skeleton Warriors cut open the cocoons, and they rescued the people within.</span></p><br/><p><span style=\"\">“Ooh-ooh-oohk.” </span></p><br/><p><span style=\"\">“Hook, hook.  Woojin-ah.” </span></p><br/><p><span style=\"\">“Thank you. I almost died.” </span></p><br/><p><span style=\"\">“I shouldn't have come here. I came here for nothing.  Ooh-ook.” </span></p><br/><p><span style=\"\">“I'm alive.  Hoohk.  I'm alive!” </span></p><br/><p><span style=\"\">From Woojin's perspective, 15 years had passed.  However, it had only been 5 years for his class mates, and their faces hadn't changed much.  Memories started to bubble up.</span></p><br/><p><span style=\"\">He didn't remember their names, but their faces were familiar.</span></p><br/><p><span style=\"\">“…….” </span></p><br/><p><span style=\"\">It had been a long time since he met them.  What should he say?</span></p><br/><p><span style=\"\">This wasn’t a good place to talk to these nervous people.  He didn’t have much to say.</span></p><br/><p><span style=\"\">“I'll see you guys next time.” </span></p><br/><p><span style=\"\">Heeeeng. </span></p><br/><p><span style=\"\">He summoned Shing Shing.  Woojin grabbed Jiwon around the waist, and he got on Shing Shing with her.</span></p><br/><p><span style=\"\">Pah-shee-sheek. </span></p><br/><p><span style=\"\">When the spiders were all eliminated, all the Skeletons were unsummoned.   If these Skeletons weren’t put under the commanders, they would revert back to being Undead monsters when Woojin traveled farther away from them.</span></p><br/><p><span style=\"\">‘I'll be 80 soon.’ </span></p><br/><p><span style=\"\">It seemed his familiars were successful in their hunt.  His EXP was rising fast. However, Seoul was stil in danger, and Woojin was busy.</span></p><br/><p><span style=\"\">Pah-ahng! </span></p><br/><p><span style=\"\">Shing Shing ran across the hall and he jumped through the window.  Shing Shing used the Phantom Gallop to race across empty air.  Cindy, who had barely survived, stared at them with an absentminded expression.</span></p><br/><p><span style=\"\">‘Kahng-woojin.’ </span></p><br/><p><span style=\"\">Cindy's heart started to beat faster.</span></p><br/>\n</div>"}