{"title": "Chapter 131 - Bloody Reunion", "id": 131, "volume": 2, "url": "http://boxnovel.org/seoul-station%E2%80%99s-necromancer-chapter-131-bloody-reunion", "volume_title": "Volume 2", "body": "<h1>Chapter 131 - Bloody Reunion</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><span style=\"\">Chapter 131 - Bloody Reunion</span></p><br/><p><span style=\"\">The Dimensional Domain of Alandal was developing quickly as each day passed.</span></p><br/><p><span style=\"\">When the territory taken from Liah was added, Alandal's size had increased by 10%.  Moreover, the Mercenary guild and the Goblin Research Facility was put in place.</span></p><br/><p><span style=\"\">When one exited Woojin's castle on top of the mountain, one immediately entered the street for commerce.</span></p><br/><p><span style=\"\">There was quite a lot of variety of stores on the street.  It wasn't crowded, but the place was very lively.</span></p><br/><p><span style=\"\">The profit earned from the commerce buildings was slowly raising the Domain's Dungeon Energy.</span></p><br/><p><span style=\"\">After exiting this street, the mountain road had houses of the Domain residents interspersed along the way.  If one traveled down the road a little bit more, the military facilities were built next to each other.  Then there were the additional land that had been added to the Domain, where the refugees were staying.</span></p><br/><p><span style=\"\">Woojin didn't have to go to Jaemin's house to meet him.</span></p><br/><p><span style=\"\">Woojin was about to walk past the cafe when he came to a stop.</span></p><br/><p><span style=\"\">“Uh? What are you doing here?” </span></p><br/><p><span style=\"\">Woojin tilted his head in confusion when he saw a teen sitting at the terrace of a cafe.</span></p><br/><p><span style=\"\">“You are back, hyung?” </span></p><br/><p><span style=\"\">Woojin sat in the seat opposite of Jaemin.  He quickly surveyed the place.  The place was way more modern compared to the pub where the Death Knights played their card games. </span></p><br/><p><span style=\"\">It seemed someone missed the modern sensibilities...</span></p><br/><p><span style=\"\">“Did you build this?” </span></p><br/><p><span style=\"\">“Yes.  I helped Butler Bibi choose the design. It seems there are numerous planets that has similar tastes as earth.” </span></p><br/><p><span style=\"\">There were several thousand variety of buildings one could buy in the Dimensional Store.</span></p><br/><p><span style=\"\">For some reason, there were numerous items from earth present in the Achievement Store, but there were none in the Dimensional Store.  It only had Items that were similar to the ones found on earth.</span></p><br/><p><span style=\"\">‘Is it related to the fact that this place hasn't synchronized fully with earth?’ </span></p><br/><p><span style=\"\">There were still the four times the time difference between earth and the other dimensions.</span></p><br/><p><span style=\"\">Woojin only needed 30 days to link to Planet Jaku through Necia's Pillar.  However, if he wanted to purchase a Dungeon on earth, he would need 120 days to link to earth.</span></p><br/><p><span style=\"\">There was 0 time difference between his Dungeon and the Planet Jaku.  Earth still had a time difference of four times with the Dungeon.</span></p><br/><p><span style=\"\">Woojin looked at the coffee Jaemin was drinking.</span></p><br/><p><span style=\"\">“Does it taste similar to the ones on earth?  Over here.” </span></p><br/><p><span style=\"\">Woojin raised his hand to call over the employee working within the cafe.  The girl had cat ears, and she was of the anthropomorphic race. She approached Woojin, and when she saw his face, she lowered her head in surprise.</span></p><br/><p><span style=\"\">“I give my greetings to you, lord.” </span></p><br/><p><span style=\"\">“Yes. Just give me one of that.” </span></p><br/><p><span style=\"\">“Y...you want to drink that?” </span></p><br/><p><span style=\"\">“Huh? What is it?” </span></p><br/><p><span style=\"\">Woojin turned to look at Jaemin.  Jaemin was laughing awkwardly.</span></p><br/><p><span style=\"\">“It's blood.” </span></p><br/><p><span style=\"\">“Blood?” </span></p><br/><p><span style=\"\">“Yes. I tried various blood, but the human blood is the tastiest.  I don't have the courage to personally harm others...  They sell it for cheap here.” </span></p><br/><p><span style=\"\">“…they really do sell all kinds of things here. May you bring me a cup of coffee?” </span></p><br/><p><span style=\"\">“Yes, lord.” </span></p><br/><p><span style=\"\">The girl of the anthropomorphic race wore a pretty uniform with frills on it.  She gave a bow, and she entered the cafe.  There were tables clustered together on the terrace, and it was an ideal place to watch the people walking the streets.</span></p><br/><p><span style=\"\">“Isn't it strange?” </span></p><br/><p><span style=\"\">Jaemin liked to sit in the cafe.  It was party of his daily life to watch the streets, which had a peaceful and lazy atmosphere about it.</span></p><br/><p><span style=\"\">In the beginning, there weren't a lot of people here, but there were over 400 beings here even if one excluded the military forces.</span></p><br/><p><span style=\"\">“What's strange?” </span></p><br/><p><span style=\"\">“I just can't believe such a world exists.” </span></p><br/><p><span style=\"\">Woojin leaned back into his chair, and he looked out onto the street.  At the very least, the anthropomorphic race resembled humans.  He saw orcs, and occasionally, a large troll walked by.  There were also the Naga race, whose lower body consisted of a tail of a large snake...</span></p><br/><p><span style=\"\">“It feels like I'm visiting a Halloween parade in the US. It sometimes feel like I'm visiting a movie set.” </span></p><br/><p><span style=\"\">“Hmm.” </span></p><br/><p><span style=\"\">Woojin sat still as he looked at Jaemin. Jaemin's face was a bit paler than before, but the sickly air that had been around him was gone.  The atmosphere around him had also brightened significantly. </span></p><br/><p><span style=\"\">“Do you feel like living now?” </span></p><br/><p><span style=\"\">“I guess I just got used to everything now.” </span></p><br/><p><span style=\"\">Woojin smirked.  Jaemin's words were correct.  In the end, everyone adapted to the situation.</span></p><br/><p><span style=\"\">“When are you going to go see your noonah?” </span></p><br/><p><span style=\"\">“I was going to ask you about it once hyung arrived. When are you returning to earth?” </span></p><br/><p><span style=\"\">“If you ask Bibi, she will open a portal to the Seoul Station’s 1st Exit for you.  Just ask her whenever you want to return.” </span></p><br/><p><span style=\"\">“Hoo.  I guess I have to buy a pair of sunglasses.” </span></p><br/><p><span style=\"\">Woojin couldn't hold back his laughter.</span></p><br/><p><span style=\"\">Night and day didn't matter in the Dimensional Domain.  However, Jaemin wouldn't be able to see the sun on earth.  All of his skin would be burned to a crisp </span></p><br/><p><span style=\"\">“So what's up with the Dimensional Battle? Did you play a little bit of Warcraft before?” </span></p><br/><p><span style=\"\">“A little bit.  I wasn't able to play it when I became a senior in highschool.” </span></p><br/><p><span style=\"\">“If you are bored, do you want to try the Dimensional Battle?” </span></p><br/><p><span style=\"\">“Me?” </span></p><br/><p><span style=\"\">“Yes.” </span></p><br/><p><span style=\"\">“Can't you just use a pro-gamer?” </span></p><br/><p><span style=\"\">“I could, but why would I trust someone else?” </span></p><br/><p><span style=\"\">“What?” </span></p><br/><p><span style=\"\">Of course, there probably was a Roused pro-gamer, who could enter his Dungeon.</span></p><br/><p><span style=\"\">“You can lose.  I don't care about the wins and losses.” </span></p><br/><p><span style=\"\">Woojin's aim wasn't to rise up in the Rankings.</span></p><br/><p><span style=\"\">“Hmm.  Is that so?  Well, that'll be great for me.  I heard from Butler Bibi that you give her points for winning?  She boast a lot about it.” </span></p><br/><p><span style=\"\">“…mmm.  I'll also give you the points.” </span></p><br/><p><span style=\"\">Bibi might be too greedy about the points, and she might insist on playing.  </span></p><br/><p><span style=\"\">Still, he didn't care if they won or not.  He could get his money's worth through the Revenge....</span></p><br/><p><span style=\"\">“The next Dimensional Battle is in 4 days.  We can spend a day on earth.  Do you want to go see your sister?” </span></p><br/><p><span style=\"\">“Yes, I will.” </span></p><br/><p><span style=\"\">Jaemin picked up his cup on the table, and he downed the remaining blood.  After drinking it, there was a red bloodstain near his mouth.  He licked at his lips as if he wanted more.</span></p><br/><p><span style=\"\">“Ha-ah..” </span></p><br/><p><span style=\"\">He struggled mightily to keep his composure, but Jaemin's eyes shook as he tried to suppress the sense of ecstasy he felt whenever he drank blood.  </span></p><br/><p><span style=\"\">“Let's go.” </span></p><br/><p><span style=\"\">Jaemin immediately regained his wits, and he stood up from his seat.  At that moment, the girl from the anthropomorphic race brought Woojin a cup of a coffee.</span></p><br/><p><span style=\"\">“Your coffee is here, my lord.” </span></p><br/><p><span style=\"\">“Mmm.  Let's leave after I drink this.” </span></p><br/><p><span style=\"\">Woojin leisure sipped at his coffee, and Jaemin sat back down once again.</span></p><br/><p><span style=\"\">*** </span></p><br/><p><span style=\"\">Alandal's Housing Complex. </span></p><br/><p><span style=\"\">“Yes.  It's 7 PM tonight?  Yes.  Woojin won't be able to go.  Yes.  He's busy.” </span></p><br/><p><span style=\"\">Jiwon ended the call, and she looked at her watch.</span></p><br/><p><span style=\"\">It was 9 in the morning.</span></p><br/><p><span style=\"\">There was still a lot of time left until the appointed time, so Jiwon decided to take a shower.</span></p><br/><p><span style=\"\">Shwahhhhh. </span></p><br/><p><span style=\"\">It had been a long time since she had went out.</span></p><br/><p><span style=\"\">The country of Alandal was in the process of gaining independence from Korea. However, Alandal hadn't finalized its treaty with Korea, so the border situation was a bit ambiguous. Therefore, people were allowed to travel freely between the two countries.</span></p><br/><p><span style=\"\">Even if the two countries came to an agreement, it would be possible for people to travel freely between Korea and Alandal.</span></p><br/><p><span style=\"\">However, there were several radical religious organizations and advocacy groups that protested the change near Alandal.  As a precaution against potential danger, a lot of security personnel had to travel with the members of Alandal.</span></p><br/><p><span style=\"\">Woojin's family and Do-jiwon, who was known to be his girlfriend, was under extra protection.</span></p><br/><p><span style=\"\">She wasn't anyone special, yet she had to drag around several dozen guards. She felt like she was causing inconvenience for people, so she chose to seclude herself.</span></p><br/><p><span style=\"\">She had fun watching Che-haesol train her new monsters, and she wrote her own novels.  She wasn't lonely, but it did feel suffocating.</span></p><br/><p><span style=\"\">This school reunion party was an outing she had been looking forward to.</span></p><br/><p><span style=\"\">“Ha-ah.  It would have been great if Woojin went too.” </span></p><br/><p><span style=\"\">It wouldn't be false to say that this school reunion party had been planned, because of Kahng-woojin.</span></p><br/><p><span style=\"\">He had become the most famous person on earth, so it wasn't an exaggeration to say that most of the graduates would be showing up to see Woojin.</span></p><br/><p><span style=\"\">Even Cindy, who had never came to a high school reunion after she became a celebrity, was coming.</span></p><br/><p><span style=\"\">It didn't matter what they want, since Kahng-woojin was too busy right now.</span></p><br/><p><span style=\"\">“Hmmm.” </span></p><br/><p><span style=\"\">After her shower, she put on a towel, and she was surprised when she exited the bathroom.  An unexpected person was sitting on the living room's sofa.</span></p><br/><p><span style=\"\">“It's been awhile, noonah.” </span></p><br/><p><span style=\"\">Jaemin awkwardly got up, and he raised his hand.</span></p><br/><p><span style=\"\">“Ha ha.” </span></p><br/><p><span style=\"\">Jiwon placed both her hands on her surprised face.  Soon her round eyes started to mist up.</span></p><br/><p><span style=\"\">“Jaemin-ah!” </span></p><br/><p><span style=\"\">She ran towards her dongsaeng, and she hugged him tight.  </span></p><br/><p><span style=\"\">Was it because of the soft objects touching him?  Or was it because her towel was in a precarious situation of coming undone?</span></p><br/><p><span style=\"\">Jaemin's face became red.</span></p><br/><p><span style=\"\">“Ooh-ook, noonah.” </span></p><br/><p><span style=\"\">“Hoo-hook, hook.  It's all right.  It's all right.  Your noonah will understand everything.” </span></p><br/><p><span style=\"\">He didn't know what there was to understand.</span></p><br/><p><span style=\"\">“Noonah.  Just let me go and....” </span></p><br/><p><span style=\"\">“Who cares if you are a vampire?  You are still the same person.  Noonah won't throw you away.  Hoo-hoohk.  Are you eating properly?  Look how white your face is.” </span></p><br/><p><span style=\"\">Jiwon grabbed Jaemin's face, and she turned his head this way and that way to inspect him.</span></p><br/><p><span style=\"\">It had been strenuous for her as she had be worried about her tormented dongsaeng...  Why was his face so pale and gaunt?</span></p><br/><p><span style=\"\">“Noonah.  This a bit...” </span></p><br/><p><span style=\"\">Jaemin grabbed the shower towel that was about to fall off.  Was it because he was her dongsaeng?  She didn't show much embarrassment as she readjusted her towel.</span></p><br/><p><span style=\"\">“Hoo-oohk.  All right.” </span></p><br/><p><span style=\"\">“Woojin-hyung is also here...” </span></p><br/><p><span style=\"\">Jaemin's face unnecessarily got redder from embarrassment.</span></p><br/><p><span style=\"\">“Huh?” </span></p><br/><p><span style=\"\">Jiwon thought she had misheard him.  She was about to turn her head around when her body froze.  Woojin was sitting on the sofa with a grin on his face. </span></p><br/><p><span style=\"\">“You body is also very pretty.” </span></p><br/><p><span style=\"\">“…….” </span></p><br/><p><span style=\"\">The only thing that could be seen was the gap showing the side of her body, but...</span></p><br/><p><span style=\"\">Jiwon's face turned red, and she backed away from them. Woojin smiled as he saw her silently disappear into her dressing room.  </span></p><br/><p><span style=\"\">“Why's your noonah acting that way?” </span></p><br/><p><span style=\"\">“Don't ask me.” </span></p><br/><p><span style=\"\">Is he really asking because he didn’t know?  </span></p><br/><p><span style=\"\">Jaemin shook his head from side to side.</span></p><br/><p><span style=\"\">“It was a very beautiful brother and sister reunion.” </span></p><br/><p><span style=\"\">“Are you heading out?” </span></p><br/><p><span style=\"\">“I don't have any time to rest.  I'm returning to the Dungeon.” </span></p><br/><p><span style=\"\">“…it isn't as if you need more money.  Why are you so diligent in going to the Dungeons?” </span></p><br/><p><span style=\"\">Woojin possessed a Dimensional Domain.  Jaemin had some understanding about the change the world was going through.  The Dungeons were locations where one went to earn regular Bloodstones.  On earth, the Bloodstone were worth money.  In the Domain, the Bloodstone could be converted to points.</span></p><br/><p><span style=\"\">Jaemin wasn’t fully knowledgeable about Woojin's situation, so this was a mystery to him.</span></p><br/><p><span style=\"\">“Level Up.” </span></p><br/><p><span style=\"\">“Level Up?” </span></p><br/><p><span style=\"\">Woojin waved his hand as he started to exit the room.  Jaemin tilted his head in confusion.</span></p><br/><p><span style=\"\">“If you are trying to level up... That means you still have more room to grow?” </span></p><br/><p><span style=\"\">He was already so strong, yet he was still challenging the Dungeons....  His diligence was probably the reason why he became so strong.</span></p><br/><p><span style=\"\">*** </span></p><br/><p><span style=\"\">An exit formed within the deep emptiness.</span></p><br/><p><span style=\"\">‘Ooh-oohk.’ </span></p><br/><p><span style=\"\">Enough time had passed that he had lost his sense of self.  As the light from the exit approached him, his old memories started to surface.</span></p><br/><p><span style=\"\">‘I want to live.’ </span></p><br/><p><span style=\"\">The light from the exit surrounded his entire body, and he regained his self that he had lost.</span></p><br/><p><span style=\"\">‘I don't want to die again.’ </span></p><br/><p><span style=\"\">After a very long time had passed, Lee-sahngho had finally been revived from his death.</span></p><br/><p><span style=\"\">He was lying flat on the floor of a familiar Ice Castle.</span></p><br/><p><span style=\"\">“Useless bastard.” </span></p><br/><p><span style=\"\">“…….” </span></p><br/><p><span style=\"\">Lee-sahngho's body was trembling.</span></p><br/><p><span style=\"\">Iello spent his precious points to revive this bastard.  He looked down with an expression of  displeasure on his face.</span></p><br/><p><span style=\"\">“I have a task for you.” </span></p><br/><p><span style=\"\">“J...just leave it to me.  This time I won't make any mistake in causing the Breaks....” </span></p><br/><p><span style=\"\">“Stupid bastard!” </span></p><br/><p><span style=\"\">Lee-sahngho’s earnest words was caught off by Iello’s roar.</span></p><br/><p><span style=\"\">He couldn't cause Dungeon Breaks like before.</span></p><br/><p><span style=\"\">When he experienced death and revival, he ceased to be a 'Roused from Earth'. Now he was solely the vassal of Iello, who was the 25th Great Dimensional lord.</span></p><br/><p><span style=\"\">Lee-sahngho no longer had 'Roots' on earth.</span></p><br/><p><span style=\"\">“I want you to take this to Planet Jaku.” </span></p><br/><p><span style=\"\">A ring floated up in front of Iello, and it came to rest in front of Lee-sahngho.  He respectfully took it with two hands.</span></p><br/><p><span style=\"\">“What should I do with this?” </span></p><br/><p><span style=\"\">“Find Rajakui, and deliver a message for me.” </span></p><br/><p><span style=\"\">“Please favor me with your order.” </span></p><br/><p><span style=\"\">“If he can destroy Earth, I'll allow him entrance into Planet Iefrin.” </span></p><br/><p><span style=\"\">Lee-sahngho had no idea what those words meant.  However, he was tasked to deliver the message, so he would.</span></p><br/><p><span style=\"\">“I'll deliver those exact words to him.” </span></p><br/><p><span style=\"\">“Also, go to earth instead of coming back here.  You should sow dissent amongst the people of earth.” </span></p><br/><p><span style=\"\">“…how will I be able to travel to earth?” </span></p><br/><p><span style=\"\">“Wear the ring.” </span></p><br/><p><span style=\"\">“…….” </span></p><br/><p><span style=\"\">Lee-sahngho opened his hand. An unknown magic could be felt emanating from the item.  He slowly put on the Polymorph ring.</span></p><br/>\n</div>"}