{"title": "Chapter 145 - Doctor Toppler", "id": 145, "volume": 2, "url": "http://boxnovel.org/seoul-station%E2%80%99s-necromancer-chapter-145-doctor-toppler", "volume_title": "Volume 2", "body": "<h1>Chapter 145 - Doctor Toppler</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><span style=\"\">Chapter 145 - Doctor Toppler</span></p><br/><p><span style=\"\">“Ah.  It is an abbreviation for the ‘Saviour's Eyes and Ears’.” </span></p><br/><p><span style=\"\">“Saviour's Eyes and Ears?” </span></p><br/><p><span style=\"\">“Yes.  It is a group that follows Kahng-woojin-nim.  All the reporters you saved last time have gathered...” </span></p><br/><p><span style=\"\">“…….” </span></p><br/><p><span style=\"\">Woojin looked at the reporter with a dumbfounded expression on his face.  The reporter responded with a proud expression on his face.</span></p><br/><p><span style=\"\">“If you need something, we'll act swiftly to help you.  You just have to ask.” </span></p><br/><p><span style=\"\">“Hmmm.” </span></p><br/><p><span style=\"\">It was a party of reporters.</span></p><br/><p><span style=\"\">If an organization decided to follow you, how was one suppose to react to it? </span></p><br/><p><span style=\"\">One might feel uncomfortable by the invasion of one's privacy, or one might feel flattered by the overwhelming interest.  </span></p><br/><p><span style=\"\">In this case, Woojin was indifferent.</span></p><br/><p><span style=\"\">‘What a strange thing to form.’ </span></p><br/><p><span style=\"\">Woojin smirked as he brought the reporter closer by putting his arm around the reporter’s shoulders.  Then he make a V sign.</span></p><br/><p><span style=\"\">“So you are saying it's something like a fan club?” </span></p><br/><p><span style=\"\">“It is similar.” </span></p><br/><p><span style=\"\">“I'll use you guys sometimes.” </span></p><br/><p><span style=\"\">“It is an honor to be able to repay your favor.” </span></p><br/><p><span style=\"\">Click, click.</span></p><br/><p><span style=\"\">Several dozen cameras let out flashes.</span></p><br/><p><span style=\"\">After the brief meeting, Woojin and the Holy Maiden left on the helicopter.  The reporter quickly ran to his car, and he opened up his laptop.</span></p><br/><p><span style=\"\">- This is an announcement to all the members.  The savior's first order has been given. He wants us to find and set up a meeting with the Dungeon expert, Doctor Toppler.</span></p><br/><p><span style=\"\">The reporter performed the most urgent task of delivering Woojin's words.  Then he uploaded the pictures he took.</span></p><br/><p><span style=\"\">- This will be kept as a family treasure.  I never expected to be able to take a picture with him....</span></p><br/><p><span style=\"\">He was still moved with emotions, and he looked at the uploaded bulletin with a rapturous expression on his face.  His satisfaction multiplied when he saw it quickly being shared with other people.</span></p><br/><p><span style=\"\">*** </span></p><br/><p><span style=\"\">&lt;Level up!&gt; </span></p><br/><p><span style=\"\">Woojin had reached level 81.  He opened his Status Window, then he put all his Bonus Stats into Control.</span></p><br/><p><span style=\"\">“You guys take care of it.” </span></p><br/><p><span style=\"\">[We do as the lord wants.] </span></p><br/><p><span style=\"\">The Undead army started to kill the remaining monsters.</span></p><br/><p><span style=\"\">The London's clock tower was almost unrecognizable. The destruction was so bad that it made one wonder if the city could recover again.</span></p><br/><p><span style=\"\">The evacuation of the civilians had been slow.  Moreover, they had military forces with powerful weapons, yet they had hesitated in attacking the colony. This had resulted in a catastrophe.</span></p><br/><p><span style=\"\">“I found one.” </span></p><br/><p><span style=\"\">Woojin put away the Dimensional Fragment that had appeared. At that moment, the president of England's Roused organization approached Woojin.  His name was Tom Clarkson.</span></p><br/><p><span style=\"\">“Hoo. You are as I have heard. The British Armed Forces has taken a lot of damage, but the casualty would have been larger if Mr. Kahng-woojin hadn't stepped in.” </span></p><br/><p><span style=\"\">“Well, this is to our mutual benefit.” </span></p><br/><p><span style=\"\">They received his help, and Woojin gained EXP and two Dimensional Fragments. </span></p><br/><p><span style=\"\">He got one in Rome, and he gained another one in London. If he added it to the ones earned in Korea, he had a total of five.</span></p><br/><p><span style=\"\">If he included the one he earned from clearing Dread's Dungeon, he had six.</span></p><br/><p><span style=\"\">He'll be able to buy a Dungeon with six.  He could also combine the three Fragments to create Dimensional Seals.</span></p><br/><p><span style=\"\">“So this is why I'm offering this proposal.  The spoils of war from this hunt...” </span></p><br/><p><span style=\"\">“I don't need the corpses or Artifacts. You guys can keep it all.” </span></p><br/><p><span style=\"\">He had no reasons to sift through all the monster corpses littering the city to excavate the Bloodstones.</span></p><br/><p><span style=\"\">He was already overflowing with money.  Moreover, Alandal's earnings wasn't going to dry up any time soon.</span></p><br/><p><span style=\"\">There was no reason why he should covet the Bloodstones or money.</span></p><br/><p><span style=\"\">Tom's eyes shone as he asked a question.</span></p><br/><p><span style=\"\">“Would you like to sell the crystal you earned to England?” </span></p><br/><p><span style=\"\">“What? Are you talking about the Dimensional Fragment?” </span></p><br/><p><span style=\"\">“Oh! So it is called a Dimensional Fragment.” </span></p><br/><p><span style=\"\">Woojin took out the gem that was letting out a purple light. Even if one didn't have a detection related Roused ability, one could clearly feel the incredible amount of magical energy it was emitting.  It was most definitely an incredible treasure. </span></p><br/><p><span style=\"\">This was the gem that had come out from the bizarre structures created by the Monster lords.</span></p><br/><p><span style=\"\">US, Japan, China and Germany had already acquired this luminous crystal named the Dimensional Fragment.</span></p><br/><p><span style=\"\">It was probably an epic Item like the Return Marble that allowed one to escape the Dungeon. He had to find a way to obtain it, so the scientists could carry out research on it.  He had to have it at all cost.</span></p><br/><p><span style=\"\">Woojin smirked as he saw Tom's fiery eyes.  </span></p><br/><p><span style=\"\">“How much do you want to buy it for?” </span></p><br/><p><span style=\"\">“Y...you really are going to sell it to me?” </span></p><br/><p><span style=\"\">“I'll hear you out.” </span></p><br/><p><span style=\"\">“…….” </span></p><br/><p><span style=\"\">He never expected Woojin to surrender the gem. For a moment, words failed Tom.</span></p><br/><p><span style=\"\">“What? You don't even have your ducks in order to give me an offer right now?” </span></p><br/><p><span style=\"\">“N...no.  If it is within my authority, it wouldn't be a problem... Would you like to go in front of the Parliament?” </span></p><br/><p><span style=\"\">Woojin furrowed his brows.</span></p><br/><p><span style=\"\">He was asking Woojin to go into a boring negotiation? If he knew this would happen, he would have brought either Woo-soonghoon or Jung-minchan.</span></p><br/><p><span style=\"\">“I'll give it to you if you guys hand over an aircraft carrier to me.” </span></p><br/><p><span style=\"\">“…what?” </span></p><br/><p><span style=\"\">“If you don't want to than forget about it.” </span></p><br/><p><span style=\"\">“P...please wait a moment.” </span></p><br/><p><span style=\"\">Woojin's offer was so sudden and out of left field that Tom couldn't even think through the cost involved.</span></p><br/><p><span style=\"\">“Can you give us an opportunity to negotiate the price?” </span></p><br/><p><span style=\"\">“I'm busy.” </span></p><br/><p><span style=\"\">“Please….” </span></p><br/><p><span style=\"\">Tom's imploring face was a piteous sight.</span></p><br/><p><span style=\"\">It made one wonder what orders he had received from the British Parliament.... Woojin spoke as if he was being magnanimous. He was good at pushing and pulling deals, but it wasn't as if he cared for it.  For the past 20 years, he had taken what he wanted, and he destroyed anything he didn't need. Didn't he make Alandal, so he didn't have to deal with annoying deals that required a deft touch?</span></p><br/><p><span style=\"\">“Go to Alandal and negotiate for it.  I'll leave one behind.” </span></p><br/><p><span style=\"\">“……!” </span></p><br/><p><span style=\"\">Tom's eyes shone. This meant Woojin had more than one?  It was best to have as many samples as possible for research.  If they could negotiate well... </span></p><br/><p><span style=\"\">“I understand.  Thank you for giving us the opportunity.” </span></p><br/><p><span style=\"\">“Go about your business.” </span></p><br/><p><span style=\"\">“Would you like to go to the palace?  There is a standing invitation for you.” </span></p><br/><p><span style=\"\">“If anyone wants to see me, they can come to me.” </span></p><br/><p><span style=\"\">“It is an invitation from the Queen.” </span></p><br/><p><span style=\"\">“Why would that matter?” </span></p><br/><p><span style=\"\">“…….” </span></p><br/><p><span style=\"\">“…….” </span></p><br/><p><span style=\"\">Woojin smirked as he turned around.</span></p><br/><p><span style=\"\">“The people who are thirsty should be the one coming to me.  I have someone else I have to see.” </span></p><br/><p><span style=\"\">Woojin turned around coolly, and Tom didn't even think about stopping him.</span></p><br/><p><span style=\"\">“Whew. I guess this problem is out of my hands.” </span></p><br/><p><span style=\"\">He requested an aircraft carrier..  Tom was only the president of England's Roused Association. This problem exceeded his authority.</span></p><br/><p><span style=\"\">Since every country was eyeing that Item, they would have to quickly dispatch their best professional negotiator. </span></p><br/><p><span style=\"\">When Woojin couldn't sense Tom's presence, he returned all of his Undead Army back to his Dimensional domain.</span></p><br/><p><span style=\"\">Woojin rode his Phantom Steed awhile before he finally arrived at the edge of the demolished city.</span></p><br/><p><span style=\"\">“Thank you for your hard work, monarch.” </span></p><br/><p><span style=\"\">“Are you busy?” </span></p><br/><p><span style=\"\">Of course, she was busy.  A lot of patients had been created from this chaos.</span></p><br/><p><span style=\"\">“Since it seems like this might be something important, I'll accompany you.” </span></p><br/><p><span style=\"\">“Whatever.” </span></p><br/><p><span style=\"\">The Holy Maiden left behind the patients moaning from pain as she followed after Woojin.  This was too important to her. It was for Alphen's salvation... </span></p><br/><p><span style=\"\">They were going to meet with a scholar, who had accumulated the most knowledge of the Dungeons on earth.</span></p><br/><p><span style=\"\">“What about the reporter from before?” </span></p><br/><p><span style=\"\">“She went to get her car.” </span></p><br/><p><span style=\"\">“Is that so?” </span></p><br/><p><span style=\"\">After a brief moment, Jonie pulled up in her old SUV.  She exited from the driver's seat, and she bowed deeply towards Woojin.</span></p><br/><p><span style=\"\">“I'm sorry for such a shabby accommodation.” </span></p><br/><p><span style=\"\">“Don't worry about it.  I don't live the high life.” </span></p><br/><p><span style=\"\">He had spent a lot of time on the battlefield, so his lifestyle had been far from being luxurious.  Of course, when he consolidated Alandal, he had been treated in a manner akin to an emperor.</span></p><br/><p><span style=\"\">When Woojin sat on the hard seat, the car started to move.</span></p><br/><p><span style=\"\">After arriving at a location far away from London, the car arrived at a site packed with 4 story buildings.</span></p><br/><p><span style=\"\">\"This was a city that had been formed after the Dungeon Shock.\"</span></p><br/><p><span style=\"\">If a country had subway stations, something similar to this had occurred.</span></p><br/><p><span style=\"\">Subway station sphere.</span></p><br/><p><span style=\"\">One's safety increased as one got farther away from the Dungeon.</span></p><br/><p><span style=\"\">It was good to live near a Dungeon only if you are part of a guild or you worked for a company with ties to the Dungeon businesses.  </span></p><br/><p><span style=\"\">Civilians were safer as they got further away from the subway stations.</span></p><br/><p><span style=\"\">The road narrowed as they traveled between the buildings, and they came to a stop.</span></p><br/><p><span style=\"\">“It's that building.” </span></p><br/><p><span style=\"\">“That doesn't look anything like a research center.” </span></p><br/><p><span style=\"\">“The research center was destroyed in the most recent incident.  This place is Doctor Toppler's residence.” </span></p><br/><p><span style=\"\">“Hmm.  Is that so?” </span></p><br/><p><span style=\"\">Jonie guided Woojin towards Dr. Toppler's house. It took a long time for the doctor to answer the doorbell.</span></p><br/><p><span style=\"\">[Who is it?] </span></p><br/><p><span style=\"\">It was a familiar voice.  He had heard it on the tv.</span></p><br/><p><span style=\"\">“It's Kahng-woojin.” </span></p><br/><p><span style=\"\">[……please enter.] </span></p><br/><p><span style=\"\">Beeeeeee! </span></p><br/><p><span style=\"\">The door unlocked, and the inside of the house was revealed.  The house was so dirty that it made one wonder if the Doctor ever cleaned it before. Woojin turned around to look at Jonie.</span></p><br/><p><span style=\"\">“You can go now.” </span></p><br/><p><span style=\"\">“Excuse….” </span></p><br/><p><span style=\"\">“What? Just speak.” </span></p><br/><p><span style=\"\">Jonie, who had been hesitating, mustered her courage, and she spoke.</span></p><br/><p><span style=\"\">“Do you mind if I take a selfie with you?” </span></p><br/><p><span style=\"\">“All right.” </span></p><br/><p><span style=\"\">When Woojin agreed to it without hesitation, Jonie let out a laugh of joy, and she took out her handphone.</span></p><br/><p><span style=\"\">“You get in here too.” </span></p><br/><p><span style=\"\">“…….” </span></p><br/><p><span style=\"\">The Holy Maiden, who had been standing to the side, joined in as the picture was taken.</span></p><br/><p><span style=\"\">Click! </span></p><br/><p><span style=\"\">“Thank you.” </span></p><br/><p><span style=\"\">“It is nothing. I'll call on you again.” </span></p><br/><p><span style=\"\">“Well, how about making an SNS account?  It'll be a good line to contact the S.E.E.” </span></p><br/><p><span style=\"\">“I'll think about it.” </span></p><br/><p><span style=\"\">“Thank you.” </span></p><br/><p><span style=\"\">She was saying 'thank you' to every word he said.  Wasn't he used to this?</span></p><br/><p><span style=\"\">It was like the organizations in Alphen, who had revered the Immortal.</span></p><br/><p><span style=\"\">Woojin and the Holy Maiden entered into the messy  house.  The house wasn't that large. There was a kitchen leading into living room, and there was a single bedroom that one could see through the door. </span></p><br/><p><span style=\"\">Professor Toppler was in the kitchen.  He was boiling water in a kettle.</span></p><br/><p><span style=\"\">“Please sit.” </span></p><br/><p><span style=\"\">“You are quite fluent in Korean.” </span></p><br/><p><span style=\"\">When Woojin sat, Toppler poured hot water into the tea cup.  He spoke to the Holy Maiden, who was just standing there.</span></p><br/><p><span style=\"\">[Holy Maiden should sit, too.] </span></p><br/><p><span style=\"\">“…….” </span></p><br/><p><span style=\"\">“…….” </span></p><br/><p><span style=\"\">Woojin's face hardened, and the Holy Maiden was surprised.  Woojin was the first one to react.  In the blink of an eye, a summoned short knife was aimed at Toppler's neck.</span></p><br/><p><span style=\"\">[How do you know how to speak the language of Alphen?] </span></p><br/><p><span style=\"\">[I learned it.] </span></p><br/><p><span style=\"\">He learned it? He probably had never been to the Planet Alphen, yet he spoke their language?</span></p><br/><p><span style=\"\">[Are you a Dimensional lord?] </span></p><br/><p><span style=\"\">[No.] </span></p><br/><p><span style=\"\">[Then what are you?] </span></p><br/><p><span style=\"\">“You can speak in Korean now.” </span></p><br/><p><span style=\"\">“Huh.” </span></p><br/><p><span style=\"\">Woojin was dumbfounded as he glared at Toppler.  Their two gazes interlocked for a long time.</span></p><br/><p><span style=\"\">‘This bastard isn't afraid of death.’ </span></p><br/><p><span style=\"\">It seems threats wouldn’t work on him. What was this leery feeling he felt?</span></p><br/><p><span style=\"\">Woojin suddenly got up from his seat.</span></p><br/><p><span style=\"\">As he stared at Toppler, he took two steps backwards.  Then he changed his Warrior's Weapon into a spear. The atmosphere was tense like a drawn bow. </span></p><br/><p><span style=\"\">Woojin's face hardened as he asked a question.</span></p><br/><p><span style=\"\">“What are you?” </span></p><br/><p><span style=\"\">His Korean was almost as good as a native.  He also knew the language of Alphen, which a very select few on earth knew.  However, this was insignificant compared to the other thing.</span></p><br/><p><span style=\"\">Something else made Woojin's thoughts race.</span></p><br/><p><span style=\"\">“How come you don't have a soul?” </span></p><br/><p><span style=\"\">Doctor Toppler.</span></p><br/><p><span style=\"\">Woojin couldn't feel his soul.</span></p><br/><p><span style=\"\">Every person, animal, monster and even insects had a soul. It ranged between the blackest of black to the clearest of clear color. This didn't change even if one was a Dimensional lord.</span></p><br/><p><span style=\"\">Basically, he had never seen a human without a soul before.</span></p><br/><p><span style=\"\">When one is confronted with an unknown being, how much fear does the absence of knowledge actually cause?  Woojin had serious expression on his face as sweat beaded on his forehead.</span></p><br/><p><span style=\"\">On the other hand, Toppler was letting out a generous laugh.</span></p><br/><p><span style=\"\">“You don't have to be so defensive.  My goals are the same as Kahng-woojin-nim.” </span></p><br/><p><span style=\"\">“I asked you a question!  What are you!!” </span></p><br/><p><span style=\"\">“…I am a human from a different Dimension.” </span></p><br/><p><span style=\"\">Different Dimension? Was he from the same Dimension as Alphen?</span></p><br/><p><span style=\"\">Then why couldn't Woojin feel his soul?  The sense of danger felt by Woojin didn't lessen at all.</span></p><br/><p><span style=\"\">“I don't care if you kill me.  However, don't you have questions for me?” </span></p><br/><p><span style=\"\">“…….” </span></p><br/><p><span style=\"\">Woojin narrowed his eyes.</span></p><br/><p><span style=\"\">Doctor Toppler. </span></p><br/><p><span style=\"\">He knew much more than Woojin had expected.</span></p><br/><p><span style=\"\">When he came out on the tv program to talk about his research, Toppler had been playing a character. He knew much more secrets about the Dimensions than he had revealed in the media.</span></p><br/><p><span style=\"\">Woojin unsummoned his Warrior's Weapon, and he sat back in his seat.</span></p><br/><p><span style=\"\">He didn't care if this person was soulless.  He didn't even care if he wasn't a human.</span></p><br/><p><span style=\"\">Woojjin could kill him anytime he wanted to.</span></p><br/><p><span style=\"\">“Tell me everything you know.” </span></p><br/><p><span style=\"\">Woojin's menacing gaze fixed itself on Doctor Toppler.</span></p><br/>\n</div>"}