{"title": "Chapter 156 Recruitment of Roused", "id": 156, "volume": 2, "url": "http://boxnovel.org/seoul-station%E2%80%99s-necromancer-chapter-156-recruitment-of-roused", "volume_title": "Volume 2", "body": "<h1>Chapter 156 Recruitment of Roused</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><span style=\"\">Chapter 156 - Recruitment of Roused</span></p><br/><p><span style=\"\">When Woojin arrived at the Dimensional Domain, he sent his Will towards his strategist Do-jaemin.</span></p><br/><p><span style=\"\">[What are you doing, Jaemin?] </span></p><br/><p><span style=\"\">[I'm beating up a really big bear.] </span></p><br/><p><span style=\"\">[What about defending the Portal?] </span></p><br/><p><span style=\"\">[Uh? We have to defend it?] </span></p><br/><p><span style=\"\">Of course.</span></p><br/><p><span style=\"\">He had left open a return portal just in case they wanted to return.  It led directly into the lord's castle of Alandal. It was his fault for not giving them a heads up, so he could only let out a sigh.</span></p><br/><p><span style=\"\">[What about our loot? I left it open, so you can move it.] </span></p><br/><p><span style=\"\">[Ah. Is that how it is?  No wonder the portal didn't close after I returned.] </span></p><br/><p><span style=\"\">[…….] </span></p><br/><p><span style=\"\">[We are traveling around using a wagon, but there are too much stuff.] </span></p><br/><p><span style=\"\">[Wait a moment.] </span></p><br/><p><span style=\"\">Woojin wondered if there was a better solution to the problem, and he found the answer in the Dimensional Domain's Admin option.</span></p><br/><p><span style=\"\">He assigned points, so his vassals could use the storage room at their discretion.  He gave Jaemin, who was his strategist, access to his Dimensional Storage room. </span></p><br/><p><span style=\"\">[Open the Inventory.] </span></p><br/><p><span style=\"\">[What? Inventory? Ooh-ahk!  What the hell is this?] </span></p><br/><p><span style=\"\">[Put all the loot in there.] </span></p><br/><p><span style=\"\">[Wow. Jackpot.  Wow.  This is amazing.] </span></p><br/><p><span style=\"\">Jaemin kept letting out exclamation as he put all the loot into the storage.  New Items were uploaded into his Inventory.</span></p><br/><p><span style=\"\">“Hmmm. A Domain administrator….” </span></p><br/><p><span style=\"\">The Domain residents used the Dungeons to explore and hunt on other planets.  They brought back Bloodstones and Items as earnings.  Even if a Dimensional lord did nothing, the points would accumulate, and the Dimensional lord's ranking would go up.</span></p><br/><p><span style=\"\">One had to just manage everything.</span></p><br/><p><span style=\"\">“Whatever.” </span></p><br/><p><span style=\"\">Woojin looked through the Inventory to see if there were any Items he needed, then he called out to a Wyvern.  It had a saddle attached to its back.  He passed through the portal heading to Planet Jaku as he rode the Wyvern.</span></p><br/><p><span style=\"\">When he passed through the portal, he immediately closed it.  He brought out Ggaebi to scout his surrounding.</span></p><br/><p><span style=\"\">“Dungeon is great.  Colony is great.  Just find me anything.” </span></p><br/><p><span style=\"\">[Koo-koohk.  All right.  I'll bring a really really good prey.] </span></p><br/><p><span style=\"\">Woojin tried  hard to ignore Ggaebi's creepy laugh.</span></p><br/><p><span style=\"\">If he had to pick a familiar that was crazy about killing, he wouldn't hesitate to pick Ggaebi.  Ggaebi endlessly walked that fine line, and it made Woojin feel uneasy about Ggaebi. </span></p><br/><p><span style=\"\">“Should I head out too?” </span></p><br/><p><span style=\"\">Woojin got on the back of a Wyvern.</span></p><br/><p><span style=\"\">Kieeeeehk! </span></p><br/><p><span style=\"\">The Wyvern let out a roar as it pushed off with its back legs.  It jumped into the air, and it started to flap its wings.  After a moment, it had ascended quite far into the air, and Woojin chose the direction of their flight through his will.</span></p><br/><p><span style=\"\">Shwahhhk. </span></p><br/><p><span style=\"\">The sound of the wind assaulted his ear.  It made one's eardrum feel numb.  If it it got worse, his barrier of souls would activate automatically.</span></p><br/><p><span style=\"\">After flying for awhile, Woojin saw a colony being bombed.</span></p><br/><p><span style=\"\">*** </span></p><br/><p><span style=\"\">Dimensional lord Joseph was with the Red Hammers coalition.  When he heard the colony he had built on the Jaku Planet was being attacked, he quickly traveled to his colony.</span></p><br/><p><span style=\"\">“Which bastard dared to attack my colony!  Which coalition was it?” </span></p><br/><p><span style=\"\">The vassal, who had been left behind to manage the colony, bowed his head.</span></p><br/><p><span style=\"\">“It wasn't one of the coalitions. Recently, some crazy bastard came to the Planet Jaku, and I believe he is the one responsible for this.” </span></p><br/><p><span style=\"\">“The one that smashed the Yellow Lizards?” </span></p><br/><p><span style=\"\">“Yes.” </span></p><br/><p><span style=\"\">It was a famous story being passed around the Dimensional lords.</span></p><br/><p><span style=\"\">Recently, they had all been synchronizing with a planet called earth.  The entirety of the Yellow Lizard Coalition had decided to invade earth, and they had all met an untimely death.</span></p><br/><p><span style=\"\">There was only one Roused linked to the planet earth. Kahng-woojin was from earth, and he was the only Dimensional lord there.</span></p><br/><p><span style=\"\">The Red Hammer coalition, and the Black Hat coalition had heard the news that Kahng-woojin had come to Planet Jaku with revenge in his heart.   </span></p><br/><p><span style=\"\">“How dare he! Activate the last line of weapons on the fortress.” </span></p><br/><p><span style=\"\">“That's...  It has already been destroyed.” </span></p><br/><p><span style=\"\">“What?” </span></p><br/><p><span style=\"\">What will we do now that our fortress' final weapon was destroyed?</span></p><br/><p><span style=\"\">“How many guards do we have left?” </span></p><br/><p><span style=\"\">“Most of them are still alive.  The enemy's attack was so intense that they didn't dare get any closer.\"</span></p><br/><p><span style=\"\">“……?” </span></p><br/><p><span style=\"\">What kind of nonsense was this?</span></p><br/><p><span style=\"\">His final weapon was destroyed, yet almost all his guards were still alive...</span></p><br/><p><span style=\"\">“Then who is fighting the intruder?” </span></p><br/><p><span style=\"\">“…two beings attacked us, and they are fighting each other.” </span></p><br/><p><span style=\"\">“……?” </span></p><br/><p><span style=\"\">Did he hear wrong? Joseph picked at his ears.</span></p><br/><p><span style=\"\">“The two of them are fighting each other?” </span></p><br/><p><span style=\"\">“Yes.” </span></p><br/><p><span style=\"\">Are they crazy?  There were plenty of open land to fight on, so why were they fighting here?</span></p><br/><p><span style=\"\">Koo-roo-roo-roohng! </span></p><br/><p><span style=\"\">Joseph frowned when he heard his castle shake.</span></p><br/><p><span style=\"\">“Those bastards!” </span></p><br/><p><span style=\"\">His city was about to be destroyed as collateral damage to someone else's fight?</span></p><br/><p><span style=\"\">The infuriated Joseph stormed out of the castle.  His weapon of choice was a large staff.  He ascended to the top of the tower with his weapon in hand.</span></p><br/><p><span style=\"\">Kwah-ah-ahng. Kwahng! </span></p><br/><p><span style=\"\">“Is it a small Fire Golem?” </span></p><br/><p><span style=\"\">A Fire Golem, which had the stature of a human, was flying around the sky.  That was what it looked like to Joseph.</span></p><br/><p><span style=\"\">Kwahng, kwah-ahng! </span></p><br/><p><span style=\"\">[Goo-ha-ha-ha.] </span></p><br/><p><span style=\"\">As it was letting out a deranged laughter, it shot out consecutive magic spells that was causing explosions.  The one doing this was not a living being.</span></p><br/><p><span style=\"\">“Lich?” </span></p><br/><p><span style=\"\">Joseph assessed the situation.</span></p><br/><p><span style=\"\">“They said Kahng-woojin was a Necromancer.  It seems his real identity is a Lich!” </span></p><br/><p><span style=\"\">A poisonous bastard, who had turned himself into a Lich, had become a Dimensional lord.</span></p><br/><p><span style=\"\">“Ah.  It isn't like that.  The Dimensional lord Kahng-woojin is a human.  The Lich is his familiar.” </span></p><br/><p><span style=\"\">“What?” </span></p><br/><p><span style=\"\">Joseph furrowed his brows.</span></p><br/><p><span style=\"\">What the hell was the Lich chasing? </span></p><br/><p><span style=\"\">“Uh, uh? They are coming toward us.” </span></p><br/><p><span style=\"\">“They dare!” </span></p><br/><p><span style=\"\">Joseph raised his staff, and he gathered his magical energy.  Before his planet went under, he had been one of the top 10 Archmages.  A Lich and some mysterious Fire Golem dared to trash his colony.</span></p><br/><p><span style=\"\">Hwah-roo-roo-roohk! </span></p><br/><p><span style=\"\">An extreme heat that could rival the conflagration of hell was gathered.</span></p><br/><p><span style=\"\">“I'll turn you into ashes!” </span></p><br/><p><span style=\"\">Shwahhhhhk! </span></p><br/><p><span style=\"\">It shot out like a Dragon's Breath. The unknown being he considered to be a Fire Golem was hit with the heat.  This was Joseph's ultimate attack.  It wasn't a joke when he described it as an attack that rivalled a Dragon's Breath.</span></p><br/><p><span style=\"\">However, the Fire Golem was made out of something very sturdy.</span></p><br/><p><span style=\"\">Shoo-shoo-shoohk! </span></p><br/><p><span style=\"\">It burst through the heat. The being suddenly grew in size, and its fist covered in fire was extended.</span></p><br/><p><span style=\"\">“You dare!” </span></p><br/><p><span style=\"\">He hurriedly erected a barrier to stop it, but Joseph experienced something he had never experienced for the past 10 years.</span></p><br/><p><span style=\"\">Kwah-ahng! </span></p><br/><p><span style=\"\">His body and barrier was sent flying, and he was nailed to the outer castle wall.</span></p><br/><p><span style=\"\">“How can there be such a humiliation!” </span></p><br/><p><span style=\"\">He got up immediately to find his opponent, but his opponent was already beside him. A foot encased in fire descended towards Joseph's head.</span></p><br/><p><span style=\"\">“……!” </span></p><br/><p><span style=\"\">Kwah-jeek! </span></p><br/><p><span style=\"\">“Jeez.  It's really hot.” </span></p><br/><p><span style=\"\">Sunggoo grumbled as Joseph's head exploded.  Sunggoo’s eyes widened when the body dissolved into a gray light.</span></p><br/><p><span style=\"\">“Uh? He was a Dimensional lord?” </span></p><br/><p><span style=\"\">Was a Dimensional lord supposed to be this weak?</span></p><br/><p><span style=\"\">This thought briefly passed through Sunggoo's brain when he remembered Jaenis' promise.</span></p><br/><p><span style=\"\">He'll be given a break if he killed a Dimensional lord or if he destroyed a Dungeon.</span></p><br/><p><span style=\"\">Sunggoo looked to the sky, and he saw a long-bodied dragon that had been generated out of fire.  It had the property of chasing after its target.  Sunggoo had run away, but in the end, it had followed him here. </span></p><br/><p><span style=\"\">“Give me a ten minute break! I caught one.” </span></p><br/><p><span style=\"\">[Goo-hoo-hoo. Too bad.] </span></p><br/><p><span style=\"\">“…….” </span></p><br/><p><span style=\"\">Too bad?</span></p><br/><p><span style=\"\">Did the Lich really plan on killing him?</span></p><br/><p><span style=\"\">He didn't have the energy to give a reply.  His time was too precious.</span></p><br/><p><span style=\"\">Sunggoo quickly sat on the floor, and he absorbed the flames that was present in the surrounding.  During all of this, the Lich sent the Flame Dragon towards the city.</span></p><br/><p><span style=\"\">Kwah-kwah-kwahng. </span></p><br/><p><span style=\"\">Every time the Flame Dragon passed by the city, the buildings erupted in flames.</span></p><br/><p><span style=\"\">‘Mmmm.’ </span></p><br/><p><span style=\"\">When he felt enough fire was in his body, Sunggoo opened his eyes.</span></p><br/><p><span style=\"\">He saw Woojin standing in front of him with the Lich.</span></p><br/><p><span style=\"\">“Uh?  When did you get here, hyung-nim?” </span></p><br/><p><span style=\"\">“Just right now.  You are pretty good now.” </span></p><br/><p><span style=\"\">“Heh heh.” </span></p><br/><p><span style=\"\">Sunggoo was able to taken down a Dimensional lord.  He had made an incredible leap in his development.</span></p><br/><p><span style=\"\">Woojin grinned as he looked at the LIch.</span></p><br/><p><span style=\"\">“You have to do it properly.  Do it properly .” </span></p><br/><p><span style=\"\">[Goo-haha.  I was about to start his training for real right now.] </span></p><br/><p><span style=\"\">Excuse me, hyung-nim and Skeleton-nim.  How can you have so much fun when having such a conversation?</span></p><br/><p><span style=\"\">[Shall we fight for real now?] </span></p><br/><p><span style=\"\">“We haven't been fighting for real...” </span></p><br/><p><span style=\"\">[There is nothing more useful than a real fight in a training.  Goo-haha.] </span></p><br/><p><span style=\"\">“What are you talking about….” </span></p><br/><p><span style=\"\">Woojin spoke as he looked at the confused Sunggoo, and the gleeful Jaenis.</span></p><br/><p><span style=\"\">“While you are at it, you should clear out the surrounding a little bit.” </span></p><br/><p><span style=\"\">[Goo-ha-ha. All right.  I'll do you a favor.  If you kill or destroy 5 Dimensional lords or colonies, you will get a 10 minute break.] </span></p><br/><p><span style=\"\">Sunggoo had a tearful expression on his face.</span></p><br/><p><span style=\"\">“Ah.  I'm so thankful that tears are...” </span></p><br/><p><span style=\"\">[I'll kill you in 10 seconds!] </span></p><br/><p><span style=\"\">“Shit!” </span></p><br/><p><span style=\"\">Kwahhhng! </span></p><br/><p><span style=\"\">Sunggoo's body exploded up into the air.</span></p><br/><p><span style=\"\">In a flash, Sunggoo had already flown away a great distance.  Woojin put on a satisfied smile as he looked at Sunggoo.</span></p><br/><p><span style=\"\">“He's like a rocket now.” </span></p><br/><p><span style=\"\">Useful Roused were slowly forming around him.</span></p><br/><p><span style=\"\">Kee-ahhhhhk! </span></p><br/><p><span style=\"\">The Wyvern had been roaming around the sky.  It let out a roar, then it lowered its head. Woojin got on the saddle, and it flew into the air.</span></p><br/><p><span style=\"\">“I wonder how much Jaemin has grown?” </span></p><br/><p><span style=\"\">Jaemin had drunk from the Vampire Lord's Heart, and he had gone through the Ritual of Blood.</span></p><br/><p><span style=\"\">He was now able to turn subordinates, so he could make his own troops.  Moreover, his physical growth limit had risen to a sky high level.  Woojin's expectation of Jaemin was on a whole different level now.</span></p><br/><p><span style=\"\">Woojin unnecessarily felt excited as he drove the Wyvern towards Jaemin.</span></p><br/><p><span style=\"\">*** </span></p><br/><p><span style=\"\">The madness that made him lose his mind was gone.</span></p><br/><p><span style=\"\">He didn't recklessly charge into his enemies.</span></p><br/><p><span style=\"\">“Hoo hoo hoo.” </span></p><br/><p><span style=\"\">Now he was constantly insane.</span></p><br/><p><span style=\"\">Kwah-kwahng, kwahng! </span></p><br/><p><span style=\"\">Every time Jaemin moved blood exploded.</span></p><br/><p><span style=\"\">He wasn't alone now.</span></p><br/><p><span style=\"\">Goo-ooh-ooh. </span></p><br/><p><span style=\"\">His subordinates were now dependent on blood.  They were like red eyed zombies as they ran in towards the enemies.  There were orcs, goblins, and even ogres amongst them.</span></p><br/><p><span style=\"\">Jaemin walked into a battlefield that was a complete pandemonium.  Corpses that had been bitten were strewn everywhere.</span></p><br/><p><span style=\"\">The eyes of his subordinates became redder, and much sharper.  One could even feel a sense of dignity from them too.</span></p><br/><p><span style=\"\">One couldn't look down on them.</span></p><br/><p><span style=\"\">These pawns were all his subordinates, but at the same time, they were challengers that could attack him at any time.</span></p><br/><p><span style=\"\">Jaemin had killed and drank from the Vampire that had bitten him.  This allowed him to absorb the Vampire's power through the Succession of Blood.  If he showed a little bit of weakness to his underlings, they'll challenge him.</span></p><br/><p><span style=\"\">“Ooh-ooh-ooh.” </span></p><br/><p><span style=\"\">Jaemin came to a stop in front of a moaning human.</span></p><br/><p><span style=\"\">His two legs had been severed, and his arm couldn't be moved from being crushed. One could see his eyes through the blood covering his face.  One could see fear, and at the same time, there was malice in those eyes.</span></p><br/><p><span style=\"\">“Do you want to live?” </span></p><br/><p><span style=\"\">“H...help me.” </span></p><br/><p><span style=\"\">The malice turned to begging as his eyes started to fill up with tears.</span></p><br/><p><span style=\"\">He liked seeing the fear.  He liked seeing the will to live in this man’s eyes.  This would be the foundation to the loyalty that would be given to Jaemin.</span></p><br/><p><span style=\"\">Death was the end of the road for the refugees wandering around the Dimensional Domain.</span></p><br/><p><span style=\"\">Jaemin bit his hand, and he wetted the lips of the dying human warrior. </span></p><br/><p><span style=\"\">“Ooh ooh ooh ooh.” </span></p><br/><p><span style=\"\">His eyes opened wide as the vessel in his eyes burst open.  Then his body started to shake.</span></p><br/><p><span style=\"\">“Koo-ah-ah!” </span></p><br/><p><span style=\"\">The man let out a scream as his body was surrounded by black blood before his body exploded.  The pieces of his body turned into several dozen bats as they flew around Jaemin.</span></p><br/><p><span style=\"\">Jji-jee-jee-jeek.</span></p><br/><p><span style=\"\">The bats coalesced in front of Jaemin, and it formed into the warrior that had been about to die.  His face was whiter than before, but this severed limbs were completely regenerated.</span></p><br/><p><span style=\"\">His purple lips was bloodless, and it was proof that his life had gone through a change.</span></p><br/><p><span style=\"\">“Name?” </span></p><br/><p><span style=\"\">“Cabal.” </span></p><br/><p><span style=\"\">His cracked voice gave an answer.  Jaemin could feel it.</span></p><br/><p><span style=\"\">He could feel this man's hate and fear towards him.  Moreover, he could feel his thirst for blood.  It was all transmitted to him.  If he showed a fraction of weakness, this man would try to eat Jaemin.</span></p><br/><p><span style=\"\">“Kneel.” </span></p><br/><p><span style=\"\">At Jaemin's words, Cabal got on one knee, and he lowered his head. This underling was different from the monsters he had turned.</span></p><br/><p><span style=\"\">He was the first member of Do-jaemin's tribe.  His family of blood had been born.</span></p><br/><p><span style=\"\">“Drink the blood of the enemies.” </span></p><br/><p><span style=\"\">“Kyahhh.” </span></p><br/><p><span style=\"\">When he got Jaemin's assent, Cabal immediately ran towards the battlefield.  It seemed Cabal was thirsting for blood so much that he couldn't maintain his rationality.</span></p><br/><p><span style=\"\">This reminded Jaemin of his old self, so he put on a bitter smile.</span></p><br/><p><span style=\"\">He felt an indescribable thrill at gaining an underling that would follow his every word.  Jaemin's two fists were trembling.</span></p><br/><p><span style=\"\">‘I’m pretty cool now.’ </span></p><br/><p><span style=\"\">Jaemin was slowly turning in a noble of the night.</span></p><br/>\n</div>"}