{"title": "Chapter 157 Recruitment of Roused (2)", "id": 157, "volume": 2, "url": "http://boxnovel.org/seoul-station%E2%80%99s-necromancer-chapter-157-recruitment-of-roused-2", "volume_title": "Volume 2", "body": "<h1>Chapter 157 Recruitment of Roused (2)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><span style=\"\">Chapter 157 – Recruitment of Roused (2)</span></p><br/><p><span style=\"\">“I would like to take a break.” </span></p><br/><p><span style=\"\">“Whew.  Let's regroup.” </span></p><br/><p><span style=\"\">At Haesol's signal, Baek-jungdoh let out a long sigh as he wiped away the sweat on his forehead.</span></p><br/><p><span style=\"\">After he had developed an ability to become a Roused, he had thought he had walked the hard road as he went around attempting the fairly difficult Dungeons.  However, it felt as if he had deluded himself up until now.</span></p><br/><p><span style=\"\">He had hunted on Planet Jaku for the past couple days, and he was pushed to his limit daily.  Maybe this was why he saw his abilities actually progress compared to before.</span></p><br/><p><span style=\"\">The constant suspense gave him a lot of stress, but the change it caused was not bad.</span></p><br/><p><span style=\"\">“How are you doing?” </span></p><br/><p><span style=\"\">“Oh. Brother Kahng.  When did you get here?” </span></p><br/><p><span style=\"\">When Kahng-woojin suddenly appeared, Baek-jungdo greeted him warmly.</span></p><br/><p><span style=\"\">“I arrived a little while ago.  Anyways, how are you doing?” </span></p><br/><p><span style=\"\">“This has been a good stimulus for me.” </span></p><br/><p><span style=\"\">“If you want, we can walk the same road.” </span></p><br/><p><span style=\"\">At Woojin's words, Baek-jungdo shook his head from side to side.  He was an outsider, and he shouldn't continue to impose himself upon Woojin's hospitality.</span></p><br/><p><span style=\"\">“No.  I've already gained a lot from this expedition.  Moreover, I have a lot of work to do after I return to the guild.” </span></p><br/><p><span style=\"\">“Do as you like then.” </span></p><br/><p><span style=\"\">Woojin didn't go out of his way to keep him.</span></p><br/><p><span style=\"\">If he was short on Roused, he could just hire more.</span></p><br/><p><span style=\"\">This is what he did with Sunggoo, Haesol and Blanka.</span></p><br/><p><span style=\"\">Bake-jungdo couldn't hide the disappointment in his eyes.  However, he couldn't abandon the KH guild to work under Woojin, so he didn't say anything more on the subject.</span></p><br/><p><span style=\"\">“Where's Jaemin?” </span></p><br/><p><span style=\"\">Haesol had been organizing the battlefield. She approached and answered Woojin's question.</span></p><br/><p><span style=\"\">“He went to a fortress up ahead.” </span></p><br/><p><span style=\"\">He looked towards where Haesol was pointing.  He saw a castle perched on top of a small mountain.</span></p><br/><p><span style=\"\">“By himself?” </span></p><br/><p><span style=\"\">“Yes.” </span></p><br/><p><span style=\"\">“Hmmm.” </span></p><br/><p><span style=\"\">Woojin stroked his chin.</span></p><br/><p><span style=\"\">Jaemin had gone through the Ritual of Blood using the Vampire lord's heart.  However, he had never expected him to be able to already attack a Dimensional lord's colony city by himself.</span></p><br/><p><span style=\"\">“He went there to scout, so you don't have to worry about him.” </span></p><br/><p><span style=\"\">“It doesn't look like he was scouting.” </span></p><br/><p><span style=\"\">“What?” </span></p><br/><p><span style=\"\">“He's coming back after a fight.” </span></p><br/><p><span style=\"\">When Woojin started to rub his chin, Haesol turned her gaze away.  She could see a cloud of bats in the distance.  However, there was a group of monsters chasing after the bats.</span></p><br/><p><span style=\"\">“It seems he's on the run.” </span></p><br/><p><span style=\"\">“Nope.” </span></p><br/><p><span style=\"\">“What?” </span></p><br/><p><span style=\"\">“Never mind.  You can return to what you were doing.” </span></p><br/><p><span style=\"\">“Yes.” </span></p><br/><p><span style=\"\">Woojin headed towards the bats.  The cloud of bats coalesced in front of him to form Do-jaemin.  He looked calmer than the past, and there was a little bit more presence to him.  Woojin met Jaemin's eyes. </span></p><br/><p><span style=\"\">A queer smile formed on Woojin's face.</span></p><br/><p><span style=\"\">“What is that?” </span></p><br/><p><span style=\"\">“I thought there would be a limit on what I could do by myself.” </span></p><br/><p><span style=\"\">“Hmmm.” </span></p><br/><p><span style=\"\">Goo-uh-uh-uh. </span></p><br/><p><span style=\"\">The underlings were like zombies with red eyes.  They looked to be a bit dangerous, and at a conservative estimate, there were 300 of them.</span></p><br/><p><span style=\"\">“Kyahhhk.” </span></p><br/><p><span style=\"\">The bats next to Jaemin coalesced, and Cabal revealed his teeth towards Woojin.  It was as if he was trying to show his own loyalty towards his master in his own way.  </span></p><br/><p><span style=\"\">Shwahhhhhhk! </span></p><br/><p><span style=\"\">Black smoke coalesced, and a large hammer dropped on top of its head.</span></p><br/><p><span style=\"\">Kwah-jeeek! </span></p><br/><p><span style=\"\">[A puny mosquito dares to be rude to the king!] </span></p><br/><p><span style=\"\">Even though Ramson's hammer had bludgeoned his head, Cabal was still alive.</span></p><br/><p><span style=\"\">“Can you handle them?” </span></p><br/><p><span style=\"\">Jaemin didn't know the reason behind the question, so he stared blankly at Woojin.</span></p><br/><p><span style=\"\">“It looks as if you are trying to copy me.  I don't think you are doing a good job.” </span></p><br/><p><span style=\"\">Woojin didn't deal with any Undeads that exceeded his Control.  Once the Undead broke free from his Control, the Undead were basically reduced to being monsters.</span></p><br/><p><span style=\"\">The underlings created by Jaemin was similar in nature.</span></p><br/><p><span style=\"\">Undeads had a hatred for the living, and it looked as if the Jaemin's underlings were much worse than the Undead.</span></p><br/><p><span style=\"\">It seemed they had an endless thirst for blood.  </span></p><br/><p><span style=\"\">As their lord, how much control did he have over them?</span></p><br/><p><span style=\"\">“I...I can do it.” </span></p><br/><p><span style=\"\">“Really?” </span></p><br/><p><span style=\"\">“······.” </span></p><br/><p><span style=\"\">“Then tell me with more confidence.” </span></p><br/><p><span style=\"\">“I...I have no idea.” </span></p><br/><p><span style=\"\">Woojin fired the souls he had in storage.  It was like tracking missiles, which followed the enemies until the target was hit. The Spirit Spears flew in towards the head of the underlings.</span></p><br/><p><span style=\"\">Shoo-shoo-shoo-shoohk! </span></p><br/><p><span style=\"\">Puh-puhk! </span></p><br/><p><span style=\"\">The sound of watermelons exploding was heard as the underlings fell over with their heads missing.</span></p><br/><p><span style=\"\">Do-jaemin felt dispirited when he saw his vampire army be dispatched so easily.</span></p><br/><p><span style=\"\">Woojin put his arm around Jaemin’s shoulders.</span></p><br/><p><span style=\"\">“Jaemin.” </span></p><br/><p><span style=\"\">“Yes, hyung.” </span></p><br/><p><span style=\"\">“Quantity isn't important.  First, try to get good at controlling one.” </span></p><br/><p><span style=\"\">“······.” </span></p><br/><p><span style=\"\">If one didn't have complete control over one's Familiars, it was better to not have them.  Cabal had used a large amount of energy to quickly regenerate his head.  Cabal looked at Woojin with fear in his eyes.</span></p><br/><p><span style=\"\">“This kind of bastard won’t do you any good.” </span></p><br/><p><span style=\"\">He was barely hit once yet he was showing so much fear.</span></p><br/><p><span style=\"\">A Familiar should be willing to die to protect one's master.  It was better to not have one like him, who had put his tail between his leg from fear. </span></p><br/><p><span style=\"\">Hwah-roo-roohk! </span></p><br/><p><span style=\"\">“Ggooh-uh-uhk!” </span></p><br/><p><span style=\"\">The Spirit Spear shot out by Woojin pierced through Cabal.  Cabal immediately exploded as he burned up.</span></p><br/><p><span style=\"\">“······.” </span></p><br/><p><span style=\"\">The subordinates he had made were killed in less that 1 minute.  Woojin's voice pushed into Jaemin's ears.</span></p><br/><p><span style=\"\">“No matter how many you have as support it is all useless if you are weak.” </span></p><br/><p><span style=\"\">He was right.  The power of a lord could be stolen by a member of a vampire clan that he had shared his blood with.  His position could be stolen.</span></p><br/><p><span style=\"\">“Even if you build up your troops, you should be slow and careful in who you choose.  Look at what I did.” </span></p><br/><p><span style=\"\">“Hyung has a lot of troops.” </span></p><br/><p><span style=\"\">Woojin smirked.</span></p><br/><p><span style=\"\">“The Skeletons and Zombies are disposable troops.  Look at my Familiars.” </span></p><br/><p><span style=\"\">He had accumulated them over a 20 years period .  If one thought about the amount of time Woojin had lived, 54 Death Knights was a small number.</span></p><br/><p><span style=\"\">“I think I get what you are trying to say.” </span></p><br/><p><span style=\"\">“All right.” </span></p><br/><p><span style=\"\">Woojin mussed up Jaemin's hair.</span></p><br/><p><span style=\"\">“Also, you should relax your eyes a little bit.” </span></p><br/><p><span style=\"\">“···yes.” </span></p><br/><p><span style=\"\">Woojin smirked as he patted Jaemin's back, then he turned to look at the party.</span></p><br/><p><span style=\"\">“In 6 days earth time or 24 days here, there will be a general guild assembly.  I want you guys to do your best to destroy all the Dungeons and colonies on this planet by then.” </span></p><br/><p><span style=\"\">It was finally D-Day.</span></p><br/><p><span style=\"\">Melody's eyes twinkled as she asked her question.</span></p><br/><p><span style=\"\">“Where's your next destination?” </span></p><br/><p><span style=\"\">“You already know, so why ask?” </span></p><br/><p><span style=\"\">There were traces of tears in Melody's eyes.  The smile on Woojin's lips deepened.</span></p><br/><p><span style=\"\">“I'm going to Alphen.” </span></p><br/><p><span style=\"\">She was finally going back.</span></p><br/><p><span style=\"\">She had voluntarily thrown herself into earth with her homeland in mind.  She'll be returning to her bleak planet with a helper.  She was deeply moved.</span></p><br/><p><span style=\"\">The most unbelievable part of all of this was the fact that the helper was the Immortal.</span></p><br/><p><span style=\"\">** </span></p><br/><p><span style=\"\">While Jaemin and the other party members started to clear Dungeons and colonies one by one, Sunggoo was destroying the Dimensional lords, since he wanted to live.  When Jaemin's party cleared one, Sunggoo cleared three.</span></p><br/><p><span style=\"\">During all of this, Woojin was like a person gathering grains. He put pressure on the Dimensional lords.</span></p><br/><p><span style=\"\">The Dungeons were were in the form of pillars.  There were much less Dungeons on this planet compared to earth. However, the Dimensional lords had made a lot of colonies with artificial gates.</span></p><br/><p><span style=\"\">There were clear pros and cons to making a colony.  The fact that one could construct a Dimensional domain on a planet was a pro and a con.</span></p><br/><p><span style=\"\">In a Dungeon, there was a cap of how many challengers there can be.  At most, only ten people could enter.  However, one couldn't limit the number of challengers attacking a colony.  One had to have a lot of troops and facilities.</span></p><br/><p><span style=\"\">However, a colony solved one of the most important problem.</span></p><br/><p><span style=\"\">Only the Roused could enter a Dungeon.  However, those with almost no abilities could enter the colony.</span></p><br/><p><span style=\"\">This was the reason why Woojin was trying to make a colony on earth.</span></p><br/><p><span style=\"\">He had snatched around 20 Dimensional Fragments, so it wouldn't be much of a loss if he used one of them to form a colony.</span></p><br/><p><span style=\"\">Woojin had faithfully kept up with his Dimensional battles, and Jaemin had won every single one of them.  After twelve days or 3 days in earth time, Woojin exited the Seoul Station's 1st Exit. </span></p><br/><p><span style=\"\">“Aht! My king.” </span></p><br/><p><span style=\"\">An employee had been put on standby.  At Woojin's appearance, the flustered employee called Woo-soonghoon.</span></p><br/><p><span style=\"\">“Yes, sir.  He’s just arrived.  Yes, sir.” </span></p><br/><p><span style=\"\">Woo-soonghoon was back being the chief secretary once again.  However, in the past, he had been the chief secretary of a president.  Now he was the chief secretary of a king.  There was  a big difference between these posts, and his current job might be more important than being a minister of a department.</span></p><br/><p><span style=\"\">“You didn't have to call him.  I'll be heading there immediately.” </span></p><br/><p><span style=\"\">“Yes.  I'm sorry.” </span></p><br/><p><span style=\"\">“What are you sorry about?” </span></p><br/><p><span style=\"\">“······.” </span></p><br/><p><span style=\"\">Woojin made fun of the overly cautious employee several times before he moved on.  Twelve security guards in suits moved with Woojin.</span></p><br/><p><span style=\"\">“Why are there so many people here?” </span></p><br/><p><span style=\"\">“It is the interview day.” </span></p><br/><p><span style=\"\">“Ah.” </span></p><br/><p><span style=\"\">The people packing the street was all here to apply to Alandal?</span></p><br/><p><span style=\"\">Woojin concentrated as he looked at the crowd.  Most of them were between level 11 and 30.  They were Rank F and E Roused.</span></p><br/><p><span style=\"\">“Isn't that Kahng-woojin” </span></p><br/><p><span style=\"\">“I think it is.  He looks exactly like the pictures.” </span></p><br/><p><span style=\"\">Their murmurs reached Wooijn's ears. </span></p><br/><p><span style=\"\">It was obvious that Woojin was someone of importance.  He was surrounded by twelve security guards.</span></p><br/><p><span style=\"\">When Woojin reached the front gate of Alandal, Prime Minister Jung-minchan, Woo-soonghoon and the employees were gathered there to greet Woojin.</span></p><br/><p><span style=\"\">“Today is the interview day?” </span></p><br/><p><span style=\"\">“Yes,  president.  We haven't let them in yet.” </span></p><br/><p><span style=\"\">People were gathered in front of Alandal's front gate.  It was as if they were examinees waiting to enter the testing ground.</span></p><br/><p><span style=\"\">Also, it wasn't as if there were only Koreans present here.</span></p><br/><p><span style=\"\">There were plenty people from around the world, who wanted to join Alandal.</span></p><br/><p><span style=\"\">“I'm busy.  Let's pick them right now.” </span></p><br/><p><span style=\"\">“What? We haven’t even separated them into Ranks.” </span></p><br/><p><span style=\"\">It was still early in the morning. If he knew Woojin would arrive so early, he would have sent out an early notice....</span></p><br/><p><span style=\"\">“It's all right.  Ranks aren't important.” </span></p><br/><p><span style=\"\">Woojin climbed the front wall.</span></p><br/><p><span style=\"\">“Quiet!” </span></p><br/><p><span style=\"\">His voice hadn't been loud, but everyone's attention was drawn towards Woojin.  He had put magical energy into his voice, and even the people in the back could hear him clearly.</span></p><br/><p><span style=\"\">\"The people I choose will become citizens and Roused of Alandal. I'll start the selection.” </span></p><br/><p><span style=\"\">This wasn't an interview process.  It was a selection process.  He was going to pick those with high potential for growth.</span></p><br/><p><span style=\"\">Woojin used a combination of basic skills like Observation, Measurement and Analysis to sort out the people.</span></p><br/><p><span style=\"\">“You, you and you. Pass.” </span></p><br/><p><span style=\"\">“Me?” </span></p><br/><p><span style=\"\">“Uh uh?” </span></p><br/><p><span style=\"\">The process had started very abruptly.  The people that were chosen were confused, but they passed through the front gate with delight.  The support given to the Roused of Alandal was the best in the world.</span></p><br/><p><span style=\"\">They would be trained by Kahng-woojin, the best Roused of earth.  Moreover, each chosen Roused would be given a support staff much larger than what other guilds gave.</span></p><br/><p><span style=\"\">After making the selections, Woojin drew a line.</span></p><br/><p><span style=\"\">“All right.  Everyone else beyond this point can go home.  The people behind the line should step forward now.” </span></p><br/><p><span style=\"\">The 500 people addressed by Woojin started to talk amongst themselves.  One of the braver soul spoke up.</span></p><br/><p><span style=\"\">“H...how can you do this to us?” </span></p><br/><p><span style=\"\">“That right. How can you judge a person from a single glance?” </span></p><br/><p><span style=\"\">Woojin smirked.</span></p><br/><p><span style=\"\">“If you have a problem, you should become a king.” </span></p><br/><p><span style=\"\">“······.” </span></p><br/><p><span style=\"\">What an unreasonable...</span></p><br/><p><span style=\"\">“Don't you have to give us a fair opportunity?” </span></p><br/><p><span style=\"\">“That's right. I have confidence I'll do well if chosen.  Please let us take a test.” </span></p><br/><p><span style=\"\">Being noticed by Kahng-woojin was the test.  Even if he chose people with high potential, there might be people he might not get along with, and some might not be able to adjust to Woojin.</span></p><br/><p><span style=\"\">Everyone good at swordplay didn’t correlate to everyone becoming a great killer.  Everyone had different potential and propensity.</span></p><br/><p><span style=\"\">The 1st step was to sort them out through potential....</span></p><br/><p><span style=\"\">“All right.  I'll give you all a chance.” </span></p><br/><p><span style=\"\">These people wouldn't understand him even if he explained it.  It would be better to show them.</span></p><br/><p><span style=\"\">Shoo-shoo-shoohk! </span></p><br/><p><span style=\"\">He summoned the Death Knight Al Assad in front of the gate.  Al Assad had just barely reached the AA Rank or the 7th Circle when he was alive.  When  he was reborn as a Death Knight, he was able to gain the abilities of an S Rank or an 8th Circle.</span></p><br/><p><span style=\"\">“I don't have time to waste.  If you last 30 seconds, you pass.  However, the price of failure is your life.  Anyone want to take up the challenge?” </span></p><br/><p><span style=\"\">“······.” </span></p><br/><p><span style=\"\">The cat got everyone's tongue.</span></p><br/><p><span style=\"\">A challenge with one's life on the line······  It was basically a choice of dying or lasting for 30 seconds to get into Alandal.</span></p><br/><p><span style=\"\">Several people shook their head from side to side, and they left without any regret in their heart. However, most of the people just stood there watching how the situation would develop.  They were waiting for Kahng-woojin to give them some other options.</span></p><br/><p><span style=\"\">“I'll attempt it.” </span></p><br/><p><span style=\"\">At that moment, a Roused standing in the backline stepped forward pompously.</span></p><br/><p><span style=\"\">Woojin's eyebrows twitched when he observed him.</span></p><br/><p><span style=\"\">“Ho-oh.  It's a 7th Circle.” </span></p><br/><p><span style=\"\">He never expected an AA Rank Roused to show up.</span></p><br/><p><span style=\"\">This was the first time Woojin had seen him, but this wasn't the case with everyone else.</span></p><br/><p><span style=\"\">“It's Kim-kahngchul!” </span></p><br/><p><span style=\"\">“That's right.  It's Kim-kahngchul.” </span></p><br/><p><span style=\"\">He was the number 1 ranked Roused in Korea before Kahng-woojin had appeared.</span></p><br/><p><span style=\"\">It was the Free Roused, who wasn't affiliated with any guild.  Kim-kahngchul had appeared.</span></p><br/>\n</div>"}