{"title": "Chapter 178 - Defense (2)", "id": 178, "volume": 2, "url": "http://boxnovel.org/seoul-station%E2%80%99s-necromancer-chapter-178-defense-2", "volume_title": "Volume 2", "body": "<h1>Chapter 178 - Defense (2)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><span style=\"\">Chapter 178 - Defense (2)</span></p><br/><p><span style=\"\">\"You met the goddess?\"</span></p><br/><p><span style=\"\">\"I did.  Why are you surprised?\"</span></p><br/><p><span style=\"\">\"This isn't your first time.  I'm just surprised you were able to meet her for the second time.\"</span></p><br/><p><span style=\"\">Woojin shrugged his shoulder at Melody's reaction.</span></p><br/><p><span style=\"\">\"Are you saying you've never seen her before?\"</span></p><br/><p><span style=\"\">\"Yes.  I've only heard her voice....\"</span></p><br/><p><span style=\"\">Woojin shook his head from side to side, and he summoned Shing Shing.</span></p><br/><p><span style=\"\">\"Anyways, I have to get back quickly. The oracle or whatever is annoying, but it seems to be  legitimate.\"</span></p><br/><p><span style=\"\">\"....\"</span></p><br/><p><span style=\"\">Woojin used his will to contact Do-jaemin, who was his Domain's vassal.</span></p><br/><p><span style=\"\">[What are you doing?]</span></p><br/><p><span style=\"\">[Hyunnnnnnng!]</span></p><br/><p><span style=\"\">Woojin was greeted so fiercely that he could easily guess that Jaemin need something from him.</span></p><br/><p><span style=\"\">[Do your best to hold out.  I'll be there quickly.]</span></p><br/><p><span style=\"\">[Yes, we'll protect this Colony no matter what.]</span></p><br/><p><span style=\"\">He had one Dungeon and one Colony.</span></p><br/><p><span style=\"\">He only had two gates, but it seemed the nearby Dimensional lords seemed hellbent at attacking him.  The Dimensional lords were pooling their strength together, and they were gathering enough forces to finish this deed on its first try.</span></p><br/><p><span style=\"\">\"I'll have to return quickly.\"</span></p><br/><p><span style=\"\">\"Is the situation really that bad?\"</span></p><br/><p><span style=\"\">\"I've been told around 100,000 monsters have gathered at the Nero plateau.\"</span></p><br/><p><span style=\"\">\"How can that be...\"</span></p><br/><p><span style=\"\">\"Is it close to the Saurus mountain?\"</span></p><br/><p><span style=\"\">\"It would take the land monsters about a week to travel that distance.\"</span></p><br/><p><span style=\"\">\"One week...\"</span></p><br/><p><span style=\"\">He had to get there before the week ended.  </span></p><br/><p><span style=\"\">How could the Coalition stop an army of 100,000 monsters by themselves?  Moreover, it was obvious that the Dimensional lords would take part in the fight.</span></p><br/><p><span style=\"\">\"We have to fly back.\"</span></p><br/><p><span style=\"\">Woojin got on Shing Shing.</span></p><br/><p><span style=\"\">\"What are you doing?\"</span></p><br/><p><span style=\"\">Woojin extended his hand towards her.  He was just standing there blankly.  She grabbed his hand in a moment of bewilderment, and she got on behind him.</span></p><br/><p><span style=\"\">Poo-roo-roohk.</span></p><br/><p><span style=\"\">The icky Holy Power could be felt through her butt, so Shing Shing neighed.  However, it was able to be easily ignored.</span></p><br/><p><span style=\"\">\"Hold on tight.  If you fall off, I'm leaving you behind.\"</span></p><br/><p><span style=\"\">\"Yes.\"</span></p><br/><p><span style=\"\">He didn't have to say it like that...  </span></p><br/><p><span style=\"\">However, she knew his words weren't an empty threat, so she clung tightly to Woojin's waist.</span></p><br/><p><span style=\"\">Shwahhhk.</span></p><br/><p><span style=\"\">The Phantom Steed stepped onto the empty air, and it started galloping through the sky.</span></p><br/><p><span style=\"\">****</span></p><br/><p><span style=\"\">Tauric had climbed a watchtower, and he worriedly looked out into the setting sun.</span></p><br/><p><span style=\"\">Hwah-roo-roohk.</span></p><br/><p><span style=\"\">A fireball fell from the sky, and it landed lightly on top of the watchtower.  The flame resolved into the shape of a man.</span></p><br/><p><span style=\"\">\"Oh, Fire Spirit King.\"</span></p><br/><p><span style=\"\">\"Ah.  I'm not a Spirit.\"</span></p><br/><p><span style=\"\">\"But...\"</span></p><br/><p><span style=\"\">\"Ah, whatever.  So how's everything going?\"</span></p><br/><p><span style=\"\">Somehow, Sunggoo felt as if he was being mocked, so he frowned.  He quickly brought up his business.</span></p><br/><p><span style=\"\">\"Can you see them?\"</span></p><br/><p><span style=\"\">\"Mmm.  Their numbers keep increasing, but they haven't shown any signs of moving yet.\"</span></p><br/><p><span style=\"\">It wasn't as if the monsters were showing up from some capital on this planet.  They were coming from the Dimensional lords' colonies.  They were using their Points to bolster their forces.</span></p><br/><p><span style=\"\">\"When do you think they'll move?\"</span></p><br/><p><span style=\"\">\"Since I'm not the god of prophecy, I wouldn’t know such information.\"</span></p><br/><p><span style=\"\">\"Hmm.  I hope they don't move towards us until hyung-nim arrives.\"</span></p><br/><p><span style=\"\">Tauric agreed wholeheartedly at Sunggoo's mumbled words.</span></p><br/><p><span style=\"\">How great would it be if thing turned out that way?</span></p><br/><p><span style=\"\">Tauric wasn't confident that they could take on such a massive number of troops.</span></p><br/><p><span style=\"\">Currently, if one excluded children and the wounded, their own forces numbered in the 3,000.  It was a small number.</span></p><br/><p><span style=\"\">\"Just let me know when they start to move.\"</span></p><br/><p><span style=\"\">Tauric was curious as to why the Fire Spirit from earth kept bringing up this topic.</span></p><br/><p><span style=\"\">\"If they start to move, we have about a week before they reach us.\"</span></p><br/><p><span style=\"\">This was also the time frame given by the Immortal regarding his return.</span></p><br/><p><span style=\"\">This was why Tauric and the people of the fortress held out hope.</span></p><br/><p><span style=\"\">If they could keep out the vanguard, they believed the Immortal would take care of the rest.</span></p><br/><p><span style=\"\">\"You never know what will happen.  If they start to move, I might have to delay their progress.\"</span></p><br/><p><span style=\"\">A massive army, which numbered in the 100,000, was going to march towards them, yet he wanted to delay them by himself?</span></p><br/><p><span style=\"\">\"...aren't you afraid?\"</span></p><br/><p><span style=\"\">\"If I screw up here, I won't be able to return home.  I'm more afraid of that possibility.\"</span></p><br/><p><span style=\"\">\"...\"</span></p><br/><p><span style=\"\">If Tauric thought about it, this being was from earth.</span></p><br/><p><span style=\"\">Even now he could use the Portal to run away to earth, yet he was still fighting for Alphen.</span></p><br/><p><span style=\"\">Tauric face was full of emotion as he bowed his head.</span></p><br/><p><span style=\"\">\"I want to give my deepest gratitude for the Fire Spirit King's courage and favor.\"</span></p><br/><p><span style=\"\">\"Jeez.  You don't have to thank me.\"</span></p><br/><p><span style=\"\">Sunggoo tried to wave it away with his hands. </span></p><br/><p><span style=\"\">Didn't everyone had their own motivation for fighting here?</span></p><br/><p><span style=\"\">These beings were fighting for Alphen's survival and salvation.  Sunggoo was fighting for the chance to return to his home.</span></p><br/><p><span style=\"\">Currently, the gate in front of the portal was unusable, since the owner of the Colony wasn't present.</span></p><br/><p><span style=\"\">If Woojin had designated someone to be in charge of the Colony's defense, this person would have been able to use the Points and Gate freely....</span></p><br/><p><span style=\"\">However, there would be nothing to be gained by regretting past decisions.  The only thing he could do was to pray for Woojin's swift return.</span></p><br/><p><span style=\"\">\"Ah.  It seems king Raul is looking for the Fire Spirit King.  You should go meet him.\"</span></p><br/><p><span style=\"\">\"Hmm.  Is that so?\"</span></p><br/><p><span style=\"\">Sunggoo was curious as to why the king of the Dwarves was looking for him.</span></p><br/><p><span style=\"\">\"Please alert me immediately when you see them move.\"</span></p><br/><p><span style=\"\">\"Yes. I'll do so.\"</span></p><br/><p><span style=\"\">The worshippers of Skia, the god of Adventurers, were scouting the enemy.  Therefore, they'll know the exact moment when the army starts to move.</span></p><br/><p><span style=\"\">Hwah-roo-roohk.</span></p><br/><p><span style=\"\">A haze emanated from Sunggoo's body before he ignited.</span></p><br/><p><span style=\"\">Accompanying the scorching heat, he flew from the watchtower to one of the walls.</span></p><br/><p><span style=\"\">Several short dwarves were gathered to check on the defense weapons mounted on the castle walls.  These were magical weapons, which could be activated using Bloodstones.  There were also several primitive looking weapons placed on the walls too.</span></p><br/><p><span style=\"\">It didn't matter if it was cold water or dirty water.  Every weapon they had was being deployed.</span></p><br/><p><span style=\"\">\"You were looking for me, Raul?\"</span></p><br/><p><span style=\"\">\"Oh oh.  Earth's Spirit King.\"</span></p><br/><p><span style=\"\">\"...\"</span></p><br/><p><span style=\"\">Did he have to accept the name now?</span></p><br/><p><span style=\"\">Sunggoo ignored Raul’s words as he asked a question.</span></p><br/><p><span style=\"\">\"What business do you have with me?\"</span></p><br/><p><span style=\"\">\"I've found an interesting Item.  I thought it might be very compatible with the Spirit King.\"</span></p><br/><p><span style=\"\">\"What is it?\"</span></p><br/><p><span style=\"\">\"Let's go together.\"</span></p><br/><p><span style=\"\">He was led away by Raul.  From the castle wall, they climbed to a clearing at the mid-slope of the mountain.</span></p><br/><p><span style=\"\">\"This is where the research facility of the magicians is located at.\"</span></p><br/><p><span style=\"\">When Woojin was constructing the fortress, he had built several types of building including the research facility.</span></p><br/><p><span style=\"\">\"I had an interesting Item, and since the earth's Spirit King deals with the source of fire, I remodeled it to fit you.\"</span></p><br/><p><span style=\"\">Raul was proud of his research room, and he pointed towards the round cylinder in front of the room.</span></p><br/><p><span style=\"\">\"Hmm.  What is this?\"</span></p><br/><p><span style=\"\">\"It is a magic amplifier.  When I was making it, I made it so that it'll grow one's magical energy.  If you stand within it and shoot your amplified magic, it'll become a splendid weapon.\"</span></p><br/><p><span style=\"\">\"Ho-oh.\"</span></p><br/><p><span style=\"\">Sunggoo got up on the round platform.</span></p><br/><p><span style=\"\">Weeeeng.</span></p><br/><p><span style=\"\">The entire platform was engraved with complicated magic circle.  It let out a light, and it made Sunggoo feel a profound and mysterious sensation. When he touched the crystal ball in front of him, the round cylinder was pointed frontward like a cannon.</span></p><br/><p><span style=\"\">The cylinder had a hole where a single person would be able to fit through, and it was also engraved with various magical circles.</span></p><br/><p><span style=\"\">\"How much can it amplify my magic?\"</span></p><br/><p><span style=\"\">As Sunggoo asked his question, he discreetly pushed his magic into it.</span></p><br/><p><span style=\"\">Hwa-roo-roohk!</span></p><br/><p><span style=\"\">A small amount of energy had gone out of him into the crystal ball, and it traveled through the tube. An unexpected result occurred.</span></p><br/><p><span style=\"\">Koo-ooh-ooh-oohng!</span></p><br/><p><span style=\"\">Accompanying a large explosions, a flame rose high into the sky as it left behind a trail of fire.  Sunggoo, who was surprised, took his hands off the crystal ball, and he looked at Raul with a dumbfounded expression.</span></p><br/><p><span style=\"\">\"Doo-hahah. No race can hold a candle against the magical engineering of the Dwarves.  To be precise, it'll amplify your power by 9 times.\"</span></p><br/><p><span style=\"\">\"How many times did you say?\"</span></p><br/><p><span style=\"\">\"I said 9 times.\"</span></p><br/><p><span style=\"\">Raul proudly unfurled nine fingers.  Sunggoo looked at the amplifier with a pale face.</span></p><br/><p><span style=\"\">'This is quite the Item.'</span></p><br/><p><span style=\"\">The durability of the Item was a problem, but if one considered only the power it could generate, it was an incredible weapon.  It felt as if he had gained a much needed item.  The only downside was the fact that this was a fixed defensive weapon.</span></p><br/><p><span style=\"\">\"Could you make this a bit smaller so I can carry it around?\"</span></p><br/><p><span style=\"\">\"You are talking about a portable amplifier?  Do you mean a magician's staff?\"</span></p><br/><p><span style=\"\">\"Ah....\"</span></p><br/><p><span style=\"\">The magicians carried around a staff, because it acted as an amplifier for their magic?</span></p><br/><p><span style=\"\">When Sunggoo nodded his head, Dwarf King Raul shook his head from side to side.</span></p><br/><p><span style=\"\">\"You can't get such results with a staff.  It merely amplifies one's magic by three fold.\"</span></p><br/><p><span style=\"\">\"....\"</span></p><br/><p><span style=\"\">Did his ears hear wrong?  Three times?</span></p><br/><p><span style=\"\">\"Did you say three times?\"</span></p><br/><p><span style=\"\">\"That's right.  A staff can't generate a power of this magnitude.\"</span></p><br/><p><span style=\"\">\"I don't mind it.  May you make me one?\"</span></p><br/><p><span style=\"\">\"Mmmm?  If we had enough ingredients....\"</span></p><br/><p><span style=\"\">Raul smirked at Sunggoo's shining eyes.  How could a magician not even know about the existence of a staff?</span></p><br/><p><span style=\"\">Was it because he was a Spirit?</span></p><br/><p><span style=\"\">\"I'll gather the materials from the other heroes, and I'll make you one.\"</span></p><br/><p><span style=\"\">At Raul's words, Sunggoo's face became flushed from the anticipation.</span></p><br/><p><span style=\"\">If he had this Item, it felt as if he would be able to hold out against the enemies until Woojin came back.</span></p><br/><p><span style=\"\">***</span></p><br/><p><span style=\"\">Shing Shing had been running through the sky, and it came to a stop.</span></p><br/><p><span style=\"\">\"....\"</span></p><br/><p><span style=\"\">\"....\"</span></p><br/><p><span style=\"\">Neither Woojin nor Melody was able to speak when they saw the sight in front of them.</span></p><br/><p><span style=\"\">Kee-ah-ahh.</span></p><br/><p><span style=\"\">The sky was filled with dragonfly-looking monsters, and the ground was filled with ground type monsters.</span></p><br/><p><span style=\"\">\"When they said an army of 100,000 had gathered, did they mean here?\"</span></p><br/><p><span style=\"\">Woojin was dumbfounded as he looked at the monster army in front of him.  There was so many of them that it was meaningless to count them.</span></p><br/><p><span style=\"\">\"So they want to block my way back?\"</span></p><br/><p><span style=\"\">It was either his enemies trying to delay his return to his Colony, or they thought the massive amount of monsters would be able to take him down.  Either way it was an unpleasant situation.</span></p><br/><p><span style=\"\">This was especially true, since he was in a hurry.</span></p><br/><p><span style=\"\">\"Open a path, Jaenis.\"</span></p><br/><p><span style=\"\">[Who dares to stand in front of our lord!  Who?]</span></p><br/><p><span style=\"\">Koo-ah-ahng! </span></p><br/><p><span style=\"\">The summoned Jaenis let out his flame.  It shot into the front line, and several hundred dragonfly monsters were burnt to crisp.  Shing Shing ran through the newly opened path.</span></p><br/><p><span style=\"\">However, it didn't take long for the monsters to get in front of his path again.</span></p><br/><p><span style=\"\">Shoo-shoo-shoohk!</span></p><br/><p><span style=\"\">The interference occurred not only in the sky.</span></p><br/><p><span style=\"\">The monsters on the surface shot poisoned darts or magical spells.  They were doing various acts to bother Woojin.</span></p><br/><p><span style=\"\">\"Ah.  They are being annoying.\"</span></p><br/><p><span style=\"\">If he wanted to smash through this, it might be better to do it on the ground.  There were too many enemies for Woojin to handle by himself.  Moreover, Melody was riding behind him, and it was complicating the use of his power.</span></p><br/><p><span style=\"\">The Holy Power of Melody and Woojin's Necromancy were at odds with each other.  They reduced the effectiveness of each other's power.</span></p><br/><p><span style=\"\">If he wanted to cut open a path through slaughter, he would be better off going forward with his Familiars.</span></p><br/><p><span style=\"\">When Shing Shing landed, the monsters in the surrounding tried to mob him.</span></p><br/><p><span style=\"\">Kwahng!</span></p><br/><p><span style=\"\">Woojin detonated the souls hovering around him as he pushed back the monsters.  The Immortal summoned his Familiars in the clearing.</span></p><br/><p><span style=\"\">\"My dudes!\"</span></p><br/><p><span style=\"\">At their master's calling, every Death Knight except Kiba, who was protecting the Dimensional domain, appeared.</span></p><br/><p><span style=\"\">[Koo-hoo-oohp.  It is the smell of the battlefield.]</span></p><br/><p><span style=\"\">[What do you want us to do?]</span></p><br/><p><span style=\"\">Woojin took out his Warrior's Weapon, and he pointed forward.</span></p><br/><p><span style=\"\">\"We are going straight towards the Saurus Colony.\"</span></p><br/><p><span style=\"\">[It is a battle!]</span></p><br/><p><span style=\"\">[I'll bring down the blessing of death!]</span></p><br/><p><span style=\"\">The Death Knights charged forward like mad men, and the monsters crowding them were cut down helplessly.</span></p><br/><p><span style=\"\">Did they really think such small fries could stop the Immortal's advance?</span></p><br/><p><span style=\"\">It would delay him a little bit, but on the other hand, he would also gain something from this encounter.</span></p><br/><p><span style=\"\">\"You can do whatever the hell  you want, Jaenis.\"</span></p><br/><p><span style=\"\">[I like that command.]</span></p><br/><p><span style=\"\">Jaenis didn't need to worry about friendly fire, so he indiscriminately used his magic against the monsters.  As the monsters started to burn, his EXP started to climb steadily .</span></p><br/><p><span style=\"\">\"L...look over there!  It is one of Trahnet's commander.\"</span></p><br/><p><span style=\"\">Melody yelled out in dismay when she saw the familiar flag. Woojin turned to look up into the sky.  The large stingray monster Feris was flying in the sky, and there was a familiar symbol drawn on the belly of the beast.</span></p><br/><p><span style=\"\">\"Isn't that Ilrak?  The 44th Throne..\"</span></p><br/><p><span style=\"\">Woojin's face turned serious.</span></p><br/><p><span style=\"\">He had always referred to them in terms of them being Trahnet's subordinates and commanders.  However, it felt different now.</span></p><br/><p><span style=\"\">This being was considered to be a god in 44 different Dimension.</span></p><br/><p><span style=\"\">Now the Dimensional lord was here on Alphen for a Code that'll make him qualified to be a god in 45 Dimensions.</span></p><br/><p><span style=\"\">\"What...\"</span></p><br/><p><span style=\"\">One could describe this as being amazing. This noble personage was special and holy.</span></p><br/><p><span style=\"\">However, it was funny to Woojin.</span></p><br/><p><span style=\"\">\"...utter nonsense.\"</span></p><br/><p><span style=\"\">These divine beings were allying themselves to each other to bring him down.</span></p><br/><p><span style=\"\">Woojin could feel their fear.</span></p><br/><p><span style=\"\">\"It is up to you to follow me, Melody.\"</span></p><br/><p><span style=\"\">Woojin put Melody on the ground, and he gripped the reins.</span></p><br/><p><span style=\"\">Poo-roo-roohk!</span></p><br/><p><span style=\"\">Shin Shing blew out air from its mouth as it galloped into the sky.  It headed towards Ilrak's Feris.</span></p><br/>\n</div>"}