{"title": "Chapter 179 - Defense (3)", "id": 179, "volume": 2, "url": "http://boxnovel.org/seoul-station%E2%80%99s-necromancer-chapter-179-defense-3", "volume_title": "Volume 2", "body": "<h1>Chapter 179 - Defense (3)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 179 - Defense (3)</p><br/><p><span style=\"\">Indulgence.</span></p><br/><p><span style=\"\">This was the only reason why a being with 44 Admin Codes decided to put a Colony on Alphen. </span></p><br/><p><span style=\"\">He wanted to become the Administrator by taking Alphen's Code as his own.</span></p><br/><p><span style=\"\">There were only five spots here.</span></p><br/><p><span style=\"\">There’s always a finite number of Admin Code, and the competition to gain it was fierce.</span></p><br/><p><span style=\"\">The Dimensional lords with other Admin Codes were concentrated on Planet Alphen, because there was an Admin Code that was yet to be settled.</span></p><br/><p><span style=\"\">Unlike other places, this place had too many gods.  It had taken them a very long time to find, who had had the real Codes.</span></p><br/><p><span style=\"\">It had taken them over 200 years.</span></p><br/><p><span style=\"\">Still, all the Dimensional lords were easy going in finding the Code.  They wanted to enjoy their eternal life.  No, they were living a life where death was no longer the end.  The process of acquiring the Codes gave them pleasure, and it gave them a goal to pursue.</span></p><br/><p><span style=\"\">This was true until the being that was the exception to the rule appeared.</span></p><br/><p><span style=\"\">On the back of the enormous flying stingray Feris, an extraordinarily extravagant throne was placed there.</span></p><br/><p><span style=\"\">Ilrak had been sitting on the throne.  He yawned as he got up, and the guards around him moved alongside him.</span></p><br/><p><span style=\"\">Ilrak's Seven Knights.</span></p><br/><p><span style=\"\">They served as the tools of Ilrak. The seven knights were first grade vassals, who helped Ilrak rise to his Throne.</span></p><br/><p><span style=\"\">Ilrak left behind his throne as he walked slowly forward.  He brushed back his long unruly hair.</span></p><br/><p><span style=\"\">\"Ah.   You were always an eyesore.\"</span></p><br/><p><span style=\"\">He made invidious remarks as he watched Woojin arrive on Shing Shing.</span></p><br/><p><span style=\"\">\"It's been awhile.\"</span></p><br/><p><span style=\"\">Woojin half-heartedly raised his hand once, and he looked at the seven knights lined up behind Ilrak.  The knights were probably the reason why Ilrak didn't try to stop Woojin from landing on Feris' back.</span></p><br/><p><span style=\"\">Ilrak trusted his guardian knights too much.</span></p><br/><p><span style=\"\">Woojin got off Shing Shing's back.</span></p><br/><p><span style=\"\">\"Koo-koohk.  How funny.\"</span></p><br/><p><span style=\"\">Ilrak found Woojin's relaxed attitude to be funny.</span></p><br/><p><span style=\"\">\"What's so funny?\"</span></p><br/><p><span style=\"\">\"I find it funny that you are acting so calm.\"</span></p><br/><p><span style=\"\">\"Didn’t you die at my hands before?  Why should I not be relaxed?\"</span></p><br/><p><span style=\"\">From Woojin's memory, he knew he had killed Ilrak on three occasions.</span></p><br/><p><span style=\"\">\"The deaths were a very valuable experience.  Have you never considered the possibility that I might have learned from those experiences?  I've made some preparations to use against you.\"</span></p><br/><p><span style=\"\">Ilrak was still enjoying the situation right now, and there was good reasons to be happy about it. He was about to see the relaxed expression on the Immortal's face crumple as desperation took hold.  It'll be very enjoyable.</span></p><br/><p><span style=\"\">\"Even if you made preparations, I'm sure you made it in error.\"</span></p><br/><p><span style=\"\">\"Koo-kook.  Your arrogance still remains as same as before.\"</span></p><br/><p><span style=\"\">\"It is confidence.\"</span></p><br/><p><span style=\"\">\"It seems you still don't realize what kind of situation you are in.\"</span></p><br/><p><span style=\"\">Ilrak removed the smile from his face.</span></p><br/><p><span style=\"\">\"Unon has gathered the nearby lords, and they are in the process of attacking your Colony.  Celrak also gathered an elite unit to clear your Dungeon.\"</span></p><br/><p><span style=\"\">\"You guys really have a hard-on for me.\"</span></p><br/><p><span style=\"\">\"Koo-koohk.  That's right.  We are tired of your bullshit.  Why do you have to unnecessarily try to awaken the god of Destruction.\"</span></p><br/><p><span style=\"\">When Ilrak mentioned the god of Destruction Thrash, Woojin laughed. They were being vigilant.  No, at this point in time, they looked to be afraid.</span></p><br/><p><span style=\"\">In other words, the Thrash’s Executioner was definitely an Item that threatened the Dimensional lords.  It was the solution to stop the war and pillaging between Dimensions.</span></p><br/><p><span style=\"\">\"Our problems will be solved if we get rid of you, yet everyone is too scared of you.  You are only a mere human.\"</span></p><br/><p><span style=\"\">Woojin smirked.  So what allowed Ilrak to have so much confidence in himself?</span></p><br/><p><span style=\"\">\"How will you do it?\"</span></p><br/><p><span style=\"\">\"Koo-koohk.  I bet you thought I was sloppy in my planning.\"</span></p><br/><p><span style=\"\">Ilrak raised both his arms.</span></p><br/><p><span style=\"\">A soft light leaked out from Feris’ back as it made a round barrier.</span></p><br/><p><span style=\"\">\"However, that isn’t the case.  You walked into a trap on your own volition.\"</span></p><br/><p><span style=\"\">Ilrak had the smile of victory plastered on his face as he looked at Woojin. </span></p><br/><p><span style=\"\">He wanted the Immortal to feel flustered.  </span></p><br/><p><span style=\"\">Ilrak wanted him to hurry up and feel the despair.</span></p><br/><p><span style=\"\">\"It can only be a trap if it is a threat to me.\"</span></p><br/><p><span style=\"\">Ilrak’s smile soured when Woojin continued to act relaxed.</span></p><br/><p><span style=\"\">It seemed the bastard’s bravado was on a different level.</span></p><br/><p><span style=\"\">\"This barrier blocks any summons.\"</span></p><br/><p><span style=\"\">\"So what?\"</span></p><br/><p><span style=\"\">\"Koo-koohk.  None of your Familiars will be able to stand here.\"</span></p><br/><p><span style=\"\">\"...\"</span></p><br/><p><span style=\"\">Ilrak let out a belly laugh when Woojin stayed silent.</span></p><br/><p><span style=\"\">\"Koo-ha-ha.  Do you understand it now?  You are a Necromancer without his familiars.  It'll be too easy for me to lop off your head.\"</span></p><br/><p><span style=\"\">Ilrak let out a smile of victory when he saw Woojin doing nothing.  </span></p><br/><p><span style=\"\">Unon and Celrak were a bit lacking in their dignity as great lords.</span></p><br/><p><span style=\"\">They were so afraid of a new Dimensional lord that they planned on isolating him.  These were actions taken by cowards.</span></p><br/><p><span style=\"\">Ilrak decided to conduct a research on the Immortal, and when he found a viable hunting method, he decided to take the hunt into his own hands.</span></p><br/><p><span style=\"\">\"Bring me that bastard's head.\"</span></p><br/><p><span style=\"\">[We obey your order.]</span></p><br/><p><span style=\"\">The seven knights walked slowly towards Woojin.  Ilrak smirked when he saw the Immortal still rooted to the same location.</span></p><br/><p><span style=\"\">\"He gave up really fast.\"</span></p><br/><p><span style=\"\">\"....\"</span></p><br/><p><span style=\"\">One, two....six, and seven.</span></p><br/><p><span style=\"\">They weren't wearing armors.  They were wearing similar clothes akin to suits.  Moreover, their faces looked similar that it wouldn't be strange to call them septuplets.</span></p><br/><p><span style=\"\">Woojin remembered that all of them were outstanding at armed conflicts.  They were even able to stand up against his tyrannical Death Knights. </span></p><br/><p><span style=\"\">Shwahhhk.</span></p><br/><p><span style=\"\">\"Koo-ha-ha-ha!\"</span></p><br/><p><span style=\"\">Ilrak roared with laughter when his guardian knights swung their swords.</span></p><br/><p><span style=\"\">It was his victory.</span></p><br/><p><span style=\"\">Unon and Celrak were dumb.  They were so scared of this noob Dimensional lord named Immortal that they were wasting Points to take out the Immortal’s assets.</span></p><br/><p><span style=\"\">Ilrak had succeeded in eliminating this troublesome Necromancer, so his standing amongst the great lords would....</span></p><br/><p><span style=\"\">Cha-chahng, kahng!</span></p><br/><p><span style=\"\">The Warrior's Weapon in Woojin's hand turned into a long sword.  The summon of the weapon and the swing was almost simultaneous.</span></p><br/><p><span style=\"\">He had looked as if he had given up on resisting, so his sudden retaliation took a knight by surprise.  Woojin's sword was already embedded in the knight before he could even flinch.</span></p><br/><p><span style=\"\">Chwahhhhk!</span></p><br/><p><span style=\"\">\"Ggoo-ook.\"</span></p><br/><p><span style=\"\">When the sword pierced through the throat of a knight, the surprise lasted only a moment.  Their formation broke in an instant, but all the knights except the dead one reacted swiftly.</span></p><br/><p><span style=\"\">Kah-kahng, chwahhk!</span></p><br/><p><span style=\"\">Even if they hadn’t underestimated their opponent, they would have been found lacking.</span></p><br/><p><span style=\"\">\"Ooh-oohk.\"</span></p><br/><p><span style=\"\">Every time Woojin's sword passed by the knights, blood fountained forth as they fell dead.  Ilrak's smile of victory had been very wide, and this smile froze in place.</span></p><br/><p><span style=\"\">\"What...what the hell.\"</span></p><br/><p><span style=\"\">He was only a mere Necromancer, yet....</span></p><br/><p><span style=\"\">He was supposed to be a Necromancer, who controlled dead knights.  When did he learn how to use a sword?  Was it after he became a Dimensional lord?  Or was it from before?</span></p><br/><p><span style=\"\">\"Shit!\"</span></p><br/><p><span style=\"\">This fact wasn't important now.  The bastard had killed his last guardian knight, and the Immortal was charging towards him.</span></p><br/><p><span style=\"\">\"What the hell are you all doing!  Come out now and take that bastard....\"</span></p><br/><p><span style=\"\">He quickly tried to summon his guards, but he had to give up on that idea.</span></p><br/><p><span style=\"\">Zeeeeeng.</span></p><br/><p><span style=\"\">The barrier spread across Feris' large back blocked all summons.  It sealed off access to this Dimension.</span></p><br/><p><span style=\"\">\"What?  What's the rush?\"</span></p><br/><p><span style=\"\">\"...\"</span></p><br/><p><span style=\"\">Woojin's words were spiteful.  Ilrak couldn't believe he would be killed again by this odious bastard.  However, he wasn't afraid of his eventual death.</span></p><br/><p><span style=\"\">The annoying part was the fact that he hadn’t been able to take care of this bastard, who had killed him on three previous occasions.  He personally conducted the research to get his revenge, yet...</span></p><br/><p><span style=\"\">The source of his trouble was the fact that he had been disinterested in the Immortal for far too long since revenge didn't net him any profit.</span></p><br/><p><span style=\"\">Ilrak gave up on running away.  He glared at Woojin.  If he couldn't get out of this, at the very least, he wouldn't act in an ugly way.</span></p><br/><p><span style=\"\">\"I regret that I didn't nip you in the bud.\"</span></p><br/><p><span style=\"\">\"You are right.\"</span></p><br/><p><span style=\"\">Woojin agreed with that statement.  The territory of Alandal had occupied a significant portion of Alphen.  When he had declared himself the king, the Dimensional lords had left him alone.</span></p><br/><p><span style=\"\">If the Dimensional lords were human, they probably would have come at him for revenge.  However, they had died several hundred to several thousand times before, so they were dull to such emotions.  Instead of the desire for revenge, they were more worried about losing their Points.</span></p><br/><p><span style=\"\">Moreover, Woojin was so foul that they had avoided him.  He was akin to shit to them.</span></p><br/><p><span style=\"\">Since he was merely a human, they knew he would die someday.  </span></p><br/><p><span style=\"\">The Dimensional lords had thought Woojin was playing at king amongst the dead corpses.  However, he had been devious, and he was aiming for the revival of the god of Destruction.  If Ilrak knew about this, he would have killed the Immortal long ago.</span></p><br/><p><span style=\"\">The Dimensional lords would have united to work against any plans regarding the god of Destruction.</span></p><br/><p><span style=\"\">\"It is as you have said.  I made a mistake.  My preparations were inadequate.\"</span></p><br/><p><span style=\"\">Woojin smirked at Ilrak's words.</span></p><br/><p><span style=\"\">These bastards were really deluding themselves.</span></p><br/><p><span style=\"\">\"I'm saying the preparation itself was the mistake.\"</span></p><br/><p><span style=\"\">\"....\"</span></p><br/><p><span style=\"\">Woojin's smile deepened when Ilrak couldn't comprehend what he was trying to say.</span></p><br/><p><span style=\"\">\"You guys look like a delicious buffet table to me.\"</span></p><br/><p><span style=\"\">\"What do you mean?\"</span></p><br/><p><span style=\"\">\"You don't need to know anything.\"</span></p><br/><p><span style=\"\">\"....\"</span></p><br/><p><span style=\"\">Woojin sword moved gently across Ilrak's throat, but the result of his action was gruesome.</span></p><br/><p><span style=\"\">In a flash, Ilrak was slaughtered, and his body was surrounded by gray light before it disappeared.</span></p><br/><p><span style=\"\">\"This is the mother of all grinding.\"</span></p><br/><p><span style=\"\">He would have had to sweep through Alphen to find each and every one of his enemies, yet hundreds of thousands of his enemies were gathering to attack him.  He was thankful for their actions.</span></p><br/><p><span style=\"\">Woojin leisurely raised the seven guardian knights as zombies.  He made them move towards the head of Feris.</span></p><br/><p><span style=\"\">Goo-uh-uh.</span></p><br/><p><span style=\"\">When they arrived at the head of the large stingray, he caused the corpses to explode.</span></p><br/><p><span style=\"\">Ggooh-ah-ahng!</span></p><br/><p><span style=\"\">Accompanying the explosion, the stingray flopped in the air as it fell towards the ground.  Woojin summoned Shing Shing, and he got on.</span></p><br/><p><span style=\"\">Even as he was falling towards the ground, he looked at the great monster army covering the ground beneath him.  </span></p><br/><p><span style=\"\">All the Dimensional lords of Alphen was aiming for him?</span></p><br/><p><span style=\"\">He was so thankful that he didn't know what to do.</span></p><br/><p><span style=\"\">\"Shall I start my power leveling?\"</span></p><br/><p><span style=\"\">The already dead souls wandering around the battlefield was sucked towards Woojin.  It was as if he was a black hole.</span></p><br/><p><span style=\"\">***</span></p><br/><p><span style=\"\">Hwah-roo-roohk, kwahng!</span></p><br/><p><span style=\"\">The magical energy emanating from his body passed through the staff, and the amplified flame magic flew towards the enemies.  It was very destructive, but it was also well below Sunggoo's expectation.</span></p><br/><p><span style=\"\">\"Shit!\"</span></p><br/><p><span style=\"\">They were reaching the one hour mark, and he had poured out most of his magic.  He had killed over 1,000 monsters.</span></p><br/><p><span style=\"\">His hardened expression refused to relax, because the enemies were endless despite his kills.</span></p><br/><p><span style=\"\">It was as if he had taken a bucket of water out of the sea.  He couldn't delay the great army.</span></p><br/><p><span style=\"\">The bastards didn't even stop to pick up the corpses of their comrades.  They just stepped over the wounded and the dead as they advanced.</span></p><br/><p><span style=\"\">\"We are royally screwed if things continue along this path.\"</span></p><br/><p><span style=\"\">Sunggoo had immediately mobilized when they received the news that the large army was on the move.  Even though the Dimensional lords hadn't taken active roles in the battle, there was no change to the progress of the army as Sunggoo darted in and out to detonate his magic.</span></p><br/><p><span style=\"\">It would take the great army about 5 days for it to reach the Saurus Colony.</span></p><br/><p><span style=\"\">Should they defend the Colony by putting their trust in the castle walls?  </span></p><br/><p><span style=\"\">It was impossible.</span></p><br/><p><span style=\"\">The Saurus castle wouldn't be able to hold out for more than half a day.</span></p><br/><p><span style=\"\">The Colony would merely be a brief impediment to their charge.</span></p><br/><p><span style=\"\">Shwahhhk!</span></p><br/><p><span style=\"\">The swarm of bats gathered in the sky, and they coalesced to form Jaemin.  He appeared next to Sunggoo.</span></p><br/><p><span style=\"\">\"Hyung!  Unon is personally coming here.  We have to get out of here.\"</span></p><br/><p><span style=\"\">\"Hoo.  All right.\"</span></p><br/><p><span style=\"\">The army of 100,000 monsters was beyond what he had imagined.  The army was so large that the advance party was a day ahead of the main force.  This was also the reason why Sunggoo was able to conduct a guerrilla warfare.</span></p><br/><p><span style=\"\">However, it would be dangerous if he was caught by the Dimensional lords.  This was why he had teamed up with Do-jaemin.  Jaemin used all his efforts to keep track of the Dimensional lords.</span></p><br/><p><span style=\"\">Jaemin consoled Sungoo, who looked depressed.</span></p><br/><p><span style=\"\">\"Don't despair too much over this.\"</span></p><br/><p><span style=\"\">\"Hoo.  My feelings doesn't matter.  We really might die here.\"</span></p><br/><p><span style=\"\">\"That's...\"</span></p><br/><p><span style=\"\">Sunggoo wasn't feeling despair.  He was angry that his abilities couldn't make a difference.</span></p><br/><p><span style=\"\">\"Hyung.  Why don't you attack the terrain instead of the monsters?\"</span></p><br/><p><span style=\"\">\"What are you talking about?\"</span></p><br/><p><span style=\"\">\"If we change the terrains, we'll be able to delay their advance.\"</span></p><br/><p><span style=\"\">\"Huh?\"</span></p><br/><p><span style=\"\">Sunggoo's eyes turned round.  What would the monsters do if he got rid of the roads?  No matter how they responded to it, it'll delay their advance.</span></p><br/><p><span style=\"\">\"As expected of someone who took school seriously!\"</span></p><br/><p><span style=\"\">\"Hahah...\"</span></p><br/><p><span style=\"\">Sungoo hyung went to college, so he should be more knowledgeable...  </span></p><br/><p><span style=\"\">Jaemin let out an awkward laugh.</span></p><br/><p><span style=\"\">\"Let's get out of here first.\"</span></p><br/><p><span style=\"\">\"All right.  I'll have to scout the surrounding again.\"</span></p><br/><p><span style=\"\">Sunggoo and Jaemin quickly got out of there.  It was easy to predict the movement of the army, since they knew their final destination.</span></p><br/><p><span style=\"\">If they were able to pick and destroy the treacherous parts of the roads, it would surely help them delay this army.</span></p><br/><p><span style=\"\">There was 5 days left until Woojin’s promised return.</span></p><br/>\n</div>"}