{"title": "Chapter 184 - Descendant of a Dragon (2)", "id": 184, "volume": 2, "url": "http://boxnovel.org/seoul-station%E2%80%99s-necromancer-chapter-184-descendant-of-a-dragon-2", "volume_title": "Volume 2", "body": "<h1>Chapter 184 - Descendant of a Dragon (2)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><span style=\"\">Chapter 184 - Descendant of a Dragon (2)</span></p><br/><p><span style=\"\">The flame in front of the World Tree had grown.</span></p><br/><p><span style=\"\">It looked like a black flame.  The color looked to be the manifestation of impure blood.</span></p><br/><p><span style=\"\">When one got closer, one could see the evil spirits swimming around it.  </span></p><br/><p><span style=\"\">Within the black flame, one could see a white flame burning within.</span></p><br/><p><span style=\"\">There was a Dragon's Heart slowly melting away, and the white flame was using the Dragon's Heart as fuel.</span></p><br/><p><span style=\"\">Woojin had already sat in front of the burning fire for well over 10 days.  He was focused solely on the evil spirits, so he didn't have the time to take stock of what was going on around him.</span></p><br/><p><span style=\"\">It was a private battle that drew the attention of the people around Woojin.  However, when it continued on for over 10 days, the heroes of the Coalition started focusing on their assigned roles.</span></p><br/><p><span style=\"\">It would have been great if Woojin fixed the Colony using his god-like power, but he was too busy.  So the Coalition had to fix the place themselves.</span></p><br/><p><span style=\"\">It took them 20 days to roughly secure the surrounding.</span></p><br/><p><span style=\"\">The corpses of tens of thousands of monsters were gathered in a single location, and an enormous mountain was transformed from it.  One could see blood stained patches in various locations on the mountain.</span></p><br/><p><span style=\"\">The Immortal stayed steadfastly in place, but his Undead Army was razing the nearby regions as they slaughtered all the monsters.</span></p><br/><p><span style=\"\">Their activities allowed the people of the Coalition, who had been barely hanging on by a thread by hiding, to gather in droves around the Saurus mountain.</span></p><br/><p><span style=\"\">However, there were still a lot of suspicious people, who thought this was a trap made by some Dimensional lord.  So they weren’t rash in coming to the mountain.  This was why the heroes of the Coalition had to expand their base of operation as they rescued the people.  They were steadily growing their forces.</span></p><br/><p><span style=\"\">The Phantom Unit being led by Blanka and Che-haesol was also achieving great results in Alphen.</span></p><br/><p><span style=\"\">\"It has been awhile, yet the rear troops haven't come through yet.\"</span></p><br/><p><span style=\"\">\"....Hmmm.  We might be the last one to cross.\"</span></p><br/><p><span style=\"\">Supporting troops had been sent in an effort to save Alphen.</span></p><br/><p><span style=\"\">Kahng-woojin, Hong-sunggoo and Do-jaemin had been the first wave, and the Phantom unit was the second wave to arrive.  Everyone was a member of Alandal.</span></p><br/><p><span style=\"\">Whether it was to exploit or putting a prescence on Alphen, many guilds from various countries wanted to come to Alphen.  However, none of them had show up yet.</span></p><br/><p><span style=\"\">Either they gave up on coming here themselves, or there was a reason why they weren't able to come here.</span></p><br/><p><span style=\"\">\"It seems something grave may be happening on earth....\"</span></p><br/><p><span style=\"\">Hong-sunggoo lay near death, and Do-jaemin quickly returned to earth using the Gate.  Their king hadn't moved an inch after sitting in front of the flame, so they couldn't even ask him questions.  Their curiosity was driving them nuts.</span></p><br/><p><span style=\"\">They had several  suspicions, yet they had no choice, but to wait.</span></p><br/><p><span style=\"\">They decided to stick to the initial plan.  The Phantom Unit trained as they helped the Coalition.</span></p><br/><p><span style=\"\">\"I'm a little bit worried.  What if we aren't able to go back home?\"</span></p><br/><p><span style=\"\">\"I'll be ok, Blanka.  Do you doubt our king?  If there is no roads, he'll pave one himself.\"</span></p><br/><p><span style=\"\">\"Hoo-ooh.  My mother sometimes appears in my dreams.  I'm really worried.\"</span></p><br/><p><span style=\"\">\"....\"</span></p><br/><p><span style=\"\">Haesol calmly soothed Blanka, then she went to meet Tauric.</span></p><br/><p><span style=\"\">\"Ah, Captain Haesol.  What can I do for you?\"</span></p><br/><p><span style=\"\">Tauric welcomed her.  Even amongst the freaks that came over from earth with the Immortal, Haesol and the Phantom unit was a bit special.  They worked very well together, and they were very good at carrying out missions.</span></p><br/><p><span style=\"\">They were a group that specialized in search and rescue.</span></p><br/><p><span style=\"\">\"Have you found the Holy Maiden yet?\"</span></p><br/><p><span style=\"\">\"Hmm...  We are trying our best, but we haven't found her yet.\"</span></p><br/><p><span style=\"\">Aside from the people from Alandal, the Phantom Unit was most familiar with Holy Maiden Melody in the Coalition.  She had already been missing for several dozen days.</span></p><br/><p><span style=\"\">She had left with Kahng-woojin to find Aria's Temple, yet she hadn't returned yet.</span></p><br/><p><span style=\"\">Several cynics spread a false rumor that Melody had been murdered by the Immortal.</span></p><br/><p><span style=\"\">Since the accused couldn't defend himself, there was no way they could completely dismiss such a claim...</span></p><br/><p><span style=\"\">\"Tauric!\"</span></p><br/><p><span style=\"\">Latasha lightly ran down the road leading from the castle walls, and she came to a stop in front of them.  There was an excited expression on her face as if she had met an old friend. Her face was flushed.</span></p><br/><p><span style=\"\">\"The Holy Maiden of Aria is back!\"</span></p><br/><p><span style=\"\">\"Oh oh.  Really?\"</span></p><br/><p><span style=\"\">\"She is coming up from the base of the mountain.\"</span></p><br/><p><span style=\"\">\"It seems all the spirits within Alphen is trying to help us.\"</span></p><br/><p><span style=\"\">Since the Holy Maiden was back, she would be able to cure those, who weren’t recovering from their wounds.  She was basically like a savior sent by the gods.</span></p><br/><p><span style=\"\">There was no one, who could rival Melody in terms of Holy Power.  Moreover, since she had acquired Aria's Holy Item, her power would have grown much stronger.</span></p><br/><p><span style=\"\">The gathered heroes ran down to greet the Holy Maiden of Aria.  They went to greet her with a happy heart.  A big crowd was gathered around her to celebrate her return, but when they caught sight of her, Melody didn't have a bright expression on her face.</span></p><br/><p><span style=\"\">\"What happened, Voice of Aria?\"</span></p><br/><p><span style=\"\">\"Skia's Monk.\"</span></p><br/><p><span style=\"\">Melody's voice somehow sounded sorrowful.</span></p><br/><p><span style=\"\">\"The Immortal was short on time, so he went ahead of me.  I just followed behind...\"</span></p><br/><p><span style=\"\">\"Oh oh.  Is that so?  You went through a lot of hardship.  You did very well.\"</span></p><br/><p><span style=\"\">Even as Tauric fiercely greeted Melody, he immediately ask her for a favor.  Since he was the leader, he had to deliver the difficult messages.  It was the right thing to do.</span></p><br/><p><span style=\"\">\"I know you’ve just arrived, so I’m being shameless.  However, there are people crying out from pain.  Could you give them the Blessing of Aria?\"</span></p><br/><p><span style=\"\">\"Of course.\"</span></p><br/><p><span style=\"\">Melody let out a weak laugh as she followed after Tauric..</span></p><br/><p><span style=\"\">\"I want to welcome you back.\"</span></p><br/><p><span style=\"\">\"I am so happy that you came back safely.\"</span></p><br/><p><span style=\"\">\"Thank you, Holy Maiden.\"</span></p><br/><p><span style=\"\">She was being congratulated by the people, but she barely smiled.  Her smile indicated that she was uncomfortable with something.</span></p><br/><p><span style=\"\">***</span></p><br/><p><span style=\"\">It seemed as if Woojin would wake up in a short amount of time, but 20 days had passed.  He wasn't showing any signs of waking up.</span></p><br/><p><span style=\"\">Many people wondered how a person could live without moving or eating.  However, if one thought about the Immortal's past exploits, this was nothing.</span></p><br/><p><span style=\"\">Moreover, people were more worried about the state of the planet than him.</span></p><br/><p><span style=\"\">The political landscape of this continent had gone through a seismic change.</span></p><br/><p><span style=\"\">The Immortal had re-appeared, and the fractured Coalition was being rebuilt.  Moreover, the Dimensional lords, who had taken over almost the entirety of Alphen, were being taken down.</span></p><br/><p><span style=\"\">The Undead army had swept through the battlefield, and they had already cleared a wide area.  They had cleared about one third of the planet.</span></p><br/><p><span style=\"\">In other words, even as this large area was being pacified, the Immortal hadn’t woken up.</span></p><br/><p><span style=\"\">He stayed in place to protect the waning flame of a life.</span></p><br/><p><span style=\"\">A woman was watching the Immortal.</span></p><br/><p><span style=\"\">'Immortal.'</span></p><br/><p><span style=\"\">Melody looked at the nearly melted Dragon's Heart, the small flame, the black evil spirits, and Kahng-woojin.  He was sitting in front of these elements, and she monitored the situation. </span></p><br/><p><span style=\"\">'Oh goddess.  How could you give me such a tribulation.'</span></p><br/><p><span style=\"\">She felt resentment.</span></p><br/><p><span style=\"\">After giving everything of herself to her goddess, this was the first time Melody felt resentment towards her goddess.   </span></p><br/><p><span style=\"\">Melody couldn't understand the latest oracle.</span></p><br/><p><span style=\"\">-You have to burn the World Tree for Alphen.</span></p><br/><p><span style=\"\">They were barely able to bloom this Symbol, which had become the hope of the Coalition.  Yet she had to burn it with her own hands?  Moreover, this was the last gate leading to Kahng-woojin's Dimensional Domain.</span></p><br/><p><span style=\"\">If the gate was destroyed, he'll be trapped in Alphen.  He'll be trapped here until he could gain another Dungeon.</span></p><br/><p><span style=\"\">It wasn't as if she didn't know what her goddess was aiming for.  However, she questioned whether such an action was just.</span></p><br/><p><span style=\"\">She felt tormented.</span></p><br/><p><span style=\"\">The feelings inside her heart fought each other to fill her with anguish and suffering.  It was a big burden for her.</span></p><br/><p><span style=\"\">\"What are you doing here?\"</span></p><br/><p><span style=\"\">\"...!\"</span></p><br/><p><span style=\"\">Melody was so surprised that her heart almost jumped out of her chest.</span></p><br/><p><span style=\"\">\"Hic.\"</span></p><br/><p><span style=\"\">\"What's up?\"</span></p><br/><p><span style=\"\">Kahng-woojin smirked when he saw the hiccuping Melody.</span></p><br/><p><span style=\"\">\"Are you a pervert?  Why are you spying on me?\"</span></p><br/><p><span style=\"\">\"I...I'm not a pervert.  Hic.\"</span></p><br/><p><span style=\"\">Melody's face was red for no reason, and she couldn't look straight into Woojin eyes.  She was feeling embarrassment, guilt and sorriness.  Moreover, her heart was  pounding....</span></p><br/><p><span style=\"\">\"What made you move right now...\"</span></p><br/><p><span style=\"\">Melody took a glance behind him, and she couldn't locate the evil spirits nor the Dragon's Heart.  The only thing left behind was a small red and white flame.  It was lighting up the surrounding like a candle.</span></p><br/><p><span style=\"\">\"Well, I pretty much did all I can.\"</span></p><br/><p><span style=\"\">\"How's Sunggoo-nim doing?\"</span></p><br/><p><span style=\"\">\"It is all up to him now.  Ah.  I hope he comes out ok.\"</span></p><br/><p><span style=\"\">\".....?\"</span></p><br/><p><span style=\"\">Melody's eyes turned round.</span></p><br/><p><span style=\"\">\"What do you mean..?\"</span></p><br/><p><span style=\"\">\"He's being reborn without experiencing death.  He'll probably come out after remolding himself a little bit.\"</span></p><br/><p><span style=\"\">\"....?\"</span></p><br/><p><span style=\"\">Melody was still confused by his words, so her puzzled expression refused to leave her face.  Woojin changed the topic.</span></p><br/><p><span style=\"\">\"Give me your Holy Item.\"</span></p><br/><p><span style=\"\">\"....\"</span></p><br/><p><span style=\"\">Melody hesitated.  As soon as he got up, he was asking for her Holy Item....</span></p><br/><p><span style=\"\">\"Hurry up and give it to me.\"</span></p><br/><p><span style=\"\">\"I...I lost it.\"</span></p><br/><p><span style=\"\">\"Hmmm.\"</span></p><br/><p><span style=\"\">Woojin suddenly pushed his face towards Melody, and he looked straight into her eyes.</span></p><br/><p><span style=\"\">She didn't have the courage to look into the fathomless depth of his eyes, so she lowered her head.</span></p><br/><p><span style=\"\">\"Well, all right.\"</span></p><br/><p><span style=\"\">Woojin backed off without making much of a fuss.</span></p><br/><p><span style=\"\">\"I want it found before I get back.\"</span></p><br/><p><span style=\"\">He still had one more Holy Item to acquire besides Aria's Holy Item.</span></p><br/><p><span style=\"\">\"W...where are you going?\"</span></p><br/><p><span style=\"\">Is he going back to earth?  What if he never returned to Alphen?</span></p><br/><p><span style=\"\">She looked at him with worried eyes, but Woojin spoke in an offhand manner. </span></p><br/><p><span style=\"\">\"Where else?  I need to go catch Heres' follower.\"</span></p><br/><p><span style=\"\">The five Holy Items were sub-ingredients for the Thrash's Set Items.</span></p><br/><p><span style=\"\">He just needed the ingredient for the belt.  Afterwards, his task would be complete once he received Aria’s Circlet.  The other Ingredient Items were co across different Dimensions, so he could just use his Points to purchase it.</span></p><br/><p><span style=\"\">\"Ah.  I want you to protect the Colony until I get back.\"</span></p><br/><p><span style=\"\">\"....\"</span></p><br/><p><span style=\"\">\"Why aren't you answering me?\"</span></p><br/><p><span style=\"\">\"Yes?\"</span></p><br/><p><span style=\"\">\"Then I'll be putting my trust in you.\"</span></p><br/><p><span style=\"\">\"....\"</span></p><br/><p><span style=\"\">When Woojin walked away, Melody was alone.  The strength in her legs drained out of her, and  she sat on the ground as if she was collapsing.</span></p><br/><p><span style=\"\">\"Oh goddess....\"</span></p><br/><p><span style=\"\">Her anguish deepened.</span></p><br/><p><span style=\"\">***</span></p><br/><p><span style=\"\">Ggee-ahhhhhk! </span></p><br/><p><span style=\"\">The Wyvern's screech stabbed at her ears.</span></p><br/><p><span style=\"\">Shwahhhh.</span></p><br/><p><span style=\"\">She would have preferred a Dragon's roar.  She was used to the sound of the wind brushing by her ears, so the sound of the Wyverns was painful to the Elf.</span></p><br/><p><span style=\"\">\"W...why do I have to go with you?\"</span></p><br/><p><span style=\"\">The headwind was making her skin scrunch up.  The poor elf complained about her unfair situation.</span></p><br/><p><span style=\"\">\"You were the only one, who looked completely free.\"</span></p><br/><p><span style=\"\">The Immortal spoke in an off hand manner as if her troubles were over nothing.  Latasha’s clenched fists shook.</span></p><br/><p><span style=\"\">\"...of course, I have things to do!\"</span></p><br/><p><span style=\"\">\"The one that has least to do has to become my guide.\"</span></p><br/><p><span style=\"\">\"....why do you keep insisting I was doing nothing?\"</span></p><br/><p><span style=\"\">\"Am I on the right path?\"</span></p><br/><p><span style=\"\">The surface of the ground was passing by quickly.  When Woojin indirectly asked her a question, she looked around in a disgruntled fashion before she spoke.</span></p><br/><p><span style=\"\">\"Over there.  You have to go past the rock mountain.\"</span></p><br/><p><span style=\"\">\"The one with the best eyesight has to be my guide.\"</span></p><br/><p><span style=\"\">\"....\"</span></p><br/><p><span style=\"\">She couldn't refute the Immortal's argument, so she kept biting at her blameless lips.</span></p><br/><p><span style=\"\">\"God of time...\"</span></p><br/><p><span style=\"\">Five gods had the Master Codes of Alphen.</span></p><br/><p><span style=\"\">He'll have the last Holy Item in couple days.</span></p><br/><p><span style=\"\">***</span></p><br/><p><span style=\"\">Sizzle sizzle.</span></p><br/><p><span style=\"\">The meat was spitting out fat as it cooked deliciously over the campfire.</span></p><br/><p><span style=\"\">\"Wow. It looks incredibly delicious.\"</span></p><br/><p><span style=\"\">Six children were gathered in a small group.</span></p><br/><p><span style=\"\">They were sitting around the fire with meat skewers in their hands.  When the meat was done, one of the children started chewing on it.</span></p><br/><p><span style=\"\">\"Oh wow.  It is really tasty!\"</span></p><br/><p><span style=\"\">\"Wow.  You’re right.\"</span></p><br/><p><span style=\"\">All the children started taking a bite out of the meat, and they had a happy expression on their faces.  Up until now, the children had been busy trying to follow the adults as they fled for safety.</span></p><br/><p><span style=\"\">However, they were very quick to adjust to anything thrown at them.  The very first change that happened when they arrived at the Saurus mountain was the fact that smiles returned to their faces.  Laughters of children erupted from within the mountain.</span></p><br/><p><span style=\"\">One child spoke in a boastful manner.</span></p><br/><p><span style=\"\">\"I heard it from my mom.\"</span></p><br/><p><span style=\"\">\"What did she say?\"</span></p><br/><p><span style=\"\">\"I heard the Flame Spirit King died here.\"</span></p><br/><p><span style=\"\">\"Really?\"</span></p><br/><p><span style=\"\">\"Yeah.  She said it is the reason why this flame never goes out.\"</span></p><br/><p><span style=\"\">\"Wow.\"</span></p><br/><p><span style=\"\">It was the first time they heard this story, so the children's eyes shone brightly.  The Fire Spirit King from earth had performed a lot of weird shows at the square, so he was very popular amongst the children.</span></p><br/><p><span style=\"\">A flame remained where he had died....</span></p><br/><p><span style=\"\">\"So that's why our meat is cooking so deliciously!\"</span></p><br/><p><span style=\"\">\"Let's cook here again tomorrow.\"</span></p><br/><p><span style=\"\">\"Yeah.  Let's do that.\"</span></p><br/><p><span style=\"\">The children were in a world where deaths and goodbyes were too familiar.  The innocent children made a promise as they swore to meet again tomorrow as they locked their dirty pinkies.</span></p><br/><p><span style=\"\">Hwah-roo-roohk.</span></p><br/><p><span style=\"\">The flame continued to get smaller and larger.  It was breathing.</span></p><br/>\n</div>"}