{"title": "Chapter 3: Rich family of the Imperial Capital", "id": 3, "volume": 1, "url": "http://boxnovel.org/masked-knight-chapter-3-rich-family-of-the-imperial-capital", "volume_title": "Volume 1", "body": "<h1>Chapter 3: Rich family of the Imperial Capital</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 3: Rich family of the Imperial Capital</p><br/><p>Translator: EndlessFantasy Translations Editor: EndlessFantasy Translations</p><br/><p>The carriage went all the way into the city. Although it was nighttime, because the Imperial Capital was the Empire's largest and most famous commercial center, the gates of this place had never once been closed, except during the warring era.</p><br/><p>Rody was tailing the carriage from a distance. He did not dare to stay too close to the carriage. Only God knew how powerful the beautiful girl actually was, and in the event that Rody was discovered, he would end up in prison together with Star.</p><br/><p>The carriage passed through the capital’s magnificent Victory Square and entered a wide road. Rody had already been in the capital for 2 years but he was still not familiar with this road. He knew that only the most powerful of aristocrats could live here. All the people living here were from rich and powerful families.</p><br/><p>The carriage slowly stopped in front of a large mansion. The thick wooden door of the mansion was painted in red giving it an iron-like look. Rody was surprised and almost fell down when he saw the family insignia on the door. He knew what that pattern was! It was the insignia for the Flame Tulip Family!</p><br/><p>As a senior student in the Imperial Academy, he was familiar with the Empire's military history. Rody obviously knew what that flame-like tulip insignia represented.</p><br/><p>It represented honor and glory! It represented the people's respect and admiration! The Flame Tulip Family. It was the family of the descendants of the first Marshal that helped His Majesty the Emperor found the Empire. In the Empire's 600 years of history, the family has had a total of 14 Marshals. Each and every one of them was an outstanding strategist. They have contributed much to the Empire. Rody remembered his history teacher telling him in a tone of reverence that this family was the God of War’s family.</p><br/><p>Naturally, Rody only had respect for this family! Never in his life would he have imagined that he would attack the Tulip Family. It looked like there was now a perfect explanation for her ridiculous power. As she was part of the Flame Tulip Family, she must be very powerful. As the carriage slowly passed through the main entrance, the door closed. Rody’s heart was now filled with anxiety.</p><br/><p>He knew how serious it was to deal with the Tulip Family if they found out that he secretly came here to rescue someone. If they caught him, terrible things would happen. If they found out that a group of people had attacked the Tulip Family, it was certain that this group of people would all be hanged. Any normal person would pack up and run away immediately, as far away as possible.</p><br/><p>Rody thought to himself for a moment and sighed. He could not abandon his friend and run away on his own. It was not consistent with his principles of life. Although Rody was not a virtuous person, he would not abandon his family and friends.</p><br/><p>Gritting his teeth, Rody entered a small alley next to the mansion. He looked around carefully to make sure that there was no one around before he climbed the walls and jumped into the compound….</p><br/><p>Nicole watched her drunk little brother being ferried back. Although she was extremely angry, her face was expressionless. She then called her servants and waved her hand as she coldly said, “Carry him down and let him rest.”</p><br/><p>Unfortunately, the idiotic future duke was not an obedient person. Being drunk, he could not recognize the person in front of him. His eyes were lax as he laughed and jokingly looked at his sister. He also stretched out his finger and attempted to tease her chin.</p><br/><p>In a daze, he mumbled to himself, “Ah, my dear Sarah! I did not see you for a few days and you have already forgotten about me? You little fox! Let’s see how I shall teach you tonight!” He then stretched his arms and threw himself forward.</p><br/><p>Nicole’s face turned ghastly pale as she skillfully turned sideways, causing him to stumble into a void. Anger started to show in her eyes as she spoke coldly, “Sarah? You even went to that kind of filthy place?” The pitiful playboy was still not aware of the dangerous situation he was in. Nicole flicked a finger and immediately, a white light shot out and struck the playboy’s stomach.</p><br/><p>The playboy did not even have the chance to scream as he flew 3 meters away and crashed face first into the ground.</p><br/><p>Rody was hiding on top a tree outside the hall and saw the entire scene. He wondered, that if he was the target being shot at, would he be able to dodge it? The answer in his heart made him give out cold sweat.</p><br/><p>In fact, Rody did not even dare to breathe heavily at his hiding place as he carefully hid himself. He knew that Star was tied up somewhere in the yard. Although there was nobody in the yard, Rody did not dare rescue his friend while the female mage was still around. He planned to wait until the middle of the night when everybody was asleep before he began his rescue.</p><br/><p>They would probably not send Star to jail so late at night. Star should be tied up somewhere like the stables or the firewood store until dawn. As the beautiful female mage should be the proprietress here, her bedroom would most likely be far away from such places. In that case, Rody would be safer when he rescues his friend.</p><br/><p>Rody, hiding within the trees and lost in his thoughts, was unaware that the people in the yard had moved away. Star, who was left in the yard earlier, was also carried away by one of the stronger servants.</p><br/><p>Although the mosquitoes and ants made Rody feel very uncomfortable, he persevered until the middle of the night.</p><br/><p>From the position of the moon in the sky, Rody guessed that it should be past midnight now and he slowly descended the tree.</p><br/><p>He was not familiar with his surroundings, but it so happened he had good grades for architecture in the academy. Hence, from the entire mansion, he could guess the location of the living quarters of the owner, the servants and other areas such as the stable. Rody picked a path and quickly dashed towards the stable.</p><br/><p>Rody had never seen such a huge stable before! He had always thought that the stable in the Academy was quite large. However, the stable here was twice as big compared to the Imperial Academy's! It was large enough to fit more than a hundred horses. Rody sighed. A glance at the windows of the stable showed that it did not have any lights on. He quietly pushed the door open and went in.</p><br/><p>“Star!” Rody whispered as he walked. He stumbled over the straws and wooden boxes on the ground twice but he still did not dare to light up the place. He had brushed into a lot of straw and horse manure but he could not be bothered. He knew that if he could not find Star by tomorrow, they would be finished!</p><br/><p>As soon as Rody reached the end of the stable, he heard light footsteps from across the door. His heart suddenly jumped into his throat as he desperately hid in the biggest horse shed.</p><br/><p>The shed was obviously larger than the rest in the stable and particularly well constructed.</p><br/><p>On the railings was also a saddle. Naturally, it was a high-quality item. Rody looked back and saw a pair of eyes staring back at him in the dark. Before he could cry out, he realized that it was just a horse.</p><br/><p>Even in the dark, Rody could faintly see that this was a very handsome black horse. Its limbs were healthy and strong like reinforced iron. The horse was watching Rody. Its nose puffed hot air and its hooves were restless. Apparently, Rody disturbed its sleep.</p><br/><p>Rody gingerly moved to the side of the horse and muttered, \"Dear horse, dear horse. I am not a horse thief. I mean no harm.\" Rody then touched the horse's mane. He tried to use the skill learned in the Imperial Academy to calm down the horse.</p><br/><p>At this time, he heard footsteps gradually approaching. Clearly, someone was heading here.</p><br/><p>Rody complained in his heart. In a moment of desperation, he caught sight of a cross-beam above. He quietly leaped up and caught the beam. His legs then latched onto it so that his body was hanging from it.</p><br/><p>“Garrus … you are really not well-behaved,” a soft timid voice came from outside the horse shed. Nicole was standing outside the shed as she looked at the restless horse in it. Her father loved horses and this battle horse was used in the battlefield when her father commanded the army.</p><br/><p>“Garrus…. Do not flail about…. I'm in a bad mood tonight.” Nicole’s tone was low and her wonderful voice gave out a sad mood. Her soft voice was capable of breaking the hearts of listeners.</p><br/><p>Nicole gently opened the barrier gate of the horse shed and slowly walked in. Rody was so scared that he even stopped breathing. He also dared not move as he feared to make any sound. Nicole reached out and gently stroked the mane and neck of the horse. Under the gentle strokes of its master, the horse soon calmed down.</p><br/><p>“Garrus…. I am very sad….” Nicole’s words sounded immeasurably aggrieved. “Why… Why do I have to bear all this… I miss my father....” She slowly hugged the horse such that her face was at its neck. “I know. You are also thinking of father as well?”</p><br/><p>In the dark, the girl, wearing a white nightgown, continued to whisper and cry softly. Seeing the beautiful blonde Nicole’s heartbreaking crying face, the hair at her forehead damp from her tears, Rody's young heart was touched, as if someone was poking it softly with a stick.</p><br/><p>God, what kind of abominable matter is this?! To let such a beautiful girl cry in such a pitiful manner is surely a crime.</p><br/><p>Nicole wept quietly for a long time before she let go of the horse and gently tidied her hair. She sighed and whispered, “Enough. Garrus, I cried again today and that is wrong. I should live up to my father’s expectations … I need to be brave. I cannot cry!” She gently said, “I know you are unhappy as well. The stable hand told me you are very irritable too. I also know that you do not like being in the stable every day and you also miss father. You also miss the days when he took you out for a ride, do you not?”</p><br/><p>\"But I really do not know what to do. The family is gradually declining. The Tulips are fading away … but I am powerless! If I were a boy, I could inherit my father's responsibility. However, that playboy is father's only son. The only male in the family. However, he is ignorant and only tarnishes the name of the family. I feel isolated and helpless!\"</p><br/><p>Nicole sighed and prayed, “May father’s soul in heaven bestow me courage! May the heavens bestow the Tulip Family a ray of hope! May God give me a guide so that I am no longer alone in my fight!”</p><br/><p>Just as soon as Nicole's delicate voice ended her prayers, there was a ‘plop’ sound as a dark figure fell from the sky and in front of Nicole. The man slowly raised his head and turned his dirty face towards Nicole. What truly scared the girl almost to the point of suffocation was his half-black-half-white Yin Yang face.</p><br/>\n</div>"}