{"title": "Chapter 17: Charming Visitor at Night", "id": 17, "volume": 1, "url": "http://boxnovel.org/masked-knight-chapter-17-charming-visitor-at-night", "volume_title": "Volume 1", "body": "<h1>Chapter 17: Charming Visitor at Night</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 17: Charming Visitor at Night</p><br/><p>Translator: EndlessFantasy Translations Editor: EndlessFantasy Translations</p><br/><p>If Master Autumn had known that the ‘seed' he gave Rody would bring about a huge change in the world, there was a possibility that he would not have done it.</p><br/><p>Many years later, a new proverb would appear in the world: A finger changes the world, a seed brings about the fall of an empire.</p><br/><p>Naturally, the famous sage Master Seth somehow understood the philosophical words left by the sage Dandong and comprehended its meaning.</p><br/><p>Lost a nail, break a hoof.</p><br/><p>Broke a hoof, lose a battle horse.</p><br/><p>Lost a battle horse, injure a knight.</p><br/><p>Injured a knight, lose a message.</p><br/><p>Lost a message, lose a battle.</p><br/><p>Lost a battle, lose a war.</p><br/><p>Lost a war, the fall of an empire.</p><br/><p>The phrase was extremely interesting. Something that is insignificant could snowball and develop unexpectedly.</p><br/><p>The ‘seed’ filled with power that was given by Master Autumn to Rody was one of them.</p><br/><p>Rody, after receiving Master Autumn’s finger treatment, finally woke up after a long time. He did not truly understand what Master Autumn was saying but he understood subconsciously that he was no longer the same.</p><br/><p>However, he could not tell what was different.</p><br/><p>Nicole did not intend to let him come into contact with more outsiders. After the meeting with Master Autumn, she immediately led him back to the laboratory in the small building.</p><br/><p>“From today onwards, you will live here!” Nicole said before she started to leave.</p><br/><p>Seeing Nicole starting to leave, Rody had summoned his courage and could not help but shout, “Wait, wait… Please wait for a moment!”</p><br/><p>“Mm?” Nicole turned around and looked at the boy.</p><br/><p>Rody slowly took off his mask and sighed, “Miss Nicole… I mean, Master… I want to know, why this face?”</p><br/><p>Nicole looked at him indifferently without speaking.</p><br/><p>Rody continued, “I know this face is exactly the same as your brother’s. Why did you transform my appearance into your brother’s?”</p><br/><p>Nicole frowned, “When the time comes, you will naturally know. For now, you just need to obey my commands.”</p><br/><p>“No,” Rody carefully said. “Actually, I can already guess a little…” Rody hesitated for a moment before he probed again carefully, “You… You want me to pretend to be your brother… Am I right?”</p><br/><p>Nicole’s expression changed and she lightly said, “You knew?”</p><br/><p>“Of course,” Rody curled his lips. “Just looking at my face now was enough for me to guess.”</p><br/><p>Nicole sneered and asked, “Are you not satisfied? You should know that my little brother is famous in the Imperial Capital as a handsome man. This face, compared to your old face is over a thousand times better looking!”</p><br/><p>Rody shrugged his shoulders and lightly said, “Unfortunately, no matter how good this face is, it is not my own face!”</p><br/><p>Nicole was stunned for a moment. She never expected the young Rody to have such thoughts.</p><br/><p>Nicole approached and looked closely at Rody before saying, “Do you know that I want you to impersonate my brother to help me out? Since you have already guessed it, I will no longer keep it a secret from you! I assume you know about the status of our family! If this matter is completed successfully, I will reward you! You see... Anyway, you cannot go back to the academy. I can recommend you into the army! Then you can become an officer! That would be my compensation to you! Are you willing?”</p><br/><p>Army? Officer? Rody became silly! Willing?</p><br/><p>Of course, I am willing!</p><br/><p>Who doesn’t know the Tulip Family’s standing in the military? Their family is basically the Empire’s Marshal family. If Nicole personally arranged for him to enter the army and he does not perform too poorly, Rody would have a bright future!</p><br/><p>No matter how you look at it, it is more attractive than staying in the Imperial Capital as an unknown warrior!</p><br/><p>So what if he became an ordinary warrior? Unless he became an expert like Master Autumn, there would be no future as there were thousands of ordinary warriors within the Imperial Capital. The ones that were better off became guards for nobility. As for those that were less capable, they were reduced to street thugs just like what happened to Rody in that incident.</p><br/><p>Rody’s eyes turned bright.</p><br/><p>Was there any young boy that would not want to succeed in the future, especially if they were like Rody who was born a commoner?</p><br/><p>Although Rody did not speak, there was now no trace of doubts left in his face.</p><br/><p>“In that case…” Rody thought for a moment and said, “Alright. I promise you! But… I have a request! It is really just a small request!”</p><br/><p>“What?”</p><br/><p>“My friend…” Rody gently said, “Miss Nicole… I know one more or one less groom would not make a difference in your family. Can you let my friend go? Let him go back to the academy!”</p><br/><p>Nicole smiled, “This is not a big problem but I must warn you. Although I can promise you that, you must be careful! The most important thing here is confidentiality! Pretending to be my brother, that must not be told to anyone! If someone else found out, hmm hmm…” Nicole did not say what. She just ‘hmm-ed’ twice and Rody quickly shut his mouth without daring to say a single word more.</p><br/><p>Since this woman was able to give him a pair of rabbit ears, only God knew what else she could do!</p><br/><p>“Alright! From now on, you are going to pretend to be my younger brother! As of today, you are Seth! As you do not know my brother’s habits, I will come every day to train you! This is a secret even at home! You must not let others know about your identity! I will declare that you ran away from home to play and was caught by me. Now you will be confined here to reflect on your actions! That way, we can avoid contact with outsiders!”</p><br/><p>Rody nodded, “In that case… Can I look at those books?”</p><br/><p>Rody pointed to the huge bookshelves around the room. They were packed with classical literature.</p><br/><p>Nicole secretly sighed. Since young, her younger brother Seth had made a lot of errors and had always been confined in this room to reflect on his mistakes. However, every time that fellow set foot in this place, he had only tried to find out how to escape and would never even so much as touch the books.</p><br/><p>This child in front of her, although simple minded, had the drive to improve himself.</p><br/><p>It was a pity… If the heir of the Tulip family was like this, it would really save Nicole a lot of headaches.</p><br/><p>Nicole sighed and said, “Sure! However, you cannot touch these bottles of drugs, as well as those things on the second floor. Anyway, I have already set a spell on them. You will not be able to touch them!”</p><br/><p>After finishing what she had to say, Nicole waved her sleeve, turned and left.</p><br/><p>Rody watched Nicole leave and breathed a sigh of relief. His eyes glowed excitedly as he cheered and ran to the bookshelves. He greedily and excitedly looked at the huge bookshelves.</p><br/><p>That night, Rody did not rest. He excitedly took a tall stack of books to read. Later on, he was just too lazy to run to the table and started to sit cross-legged on the floor.</p><br/><p>When nighttime came, he brought the room’s candlestick to his side. He then sat beside a heap of books, leaning against the bookshelf, and continued reading.</p><br/><p>Rody had never been so pleased! Although he liked to read books about strange things in the world, the academy could not satisfy his demands. For starters, civilians were not allowed to enter the library to read the collection of rare books. This was a noble’s privilege!</p><br/><p>Rody was immersed in joy and satisfaction when he heard the faint sound of footsteps.</p><br/><p>The warrior in Rody made him immediately tense up. He jumped up and listened intently.</p><br/><p>Sure enough, the gentle footsteps were getting closer. Rody was sure that the person intentionally walked on tiptoes so as to be silent!</p><br/><p>Rody dashed to the door and waited at its side.</p><br/><p>At that moment, there was a gentle knock on the door. A delicate and timid voice followed. “Young Master Seth… Are you here?”</p><br/><p>Rody froze for a moment as he did not know how to answer.</p><br/><p>The door slowly opened as a delicate figure came in.</p><br/><p>Rody stared at the person but was shocked.</p><br/><p>The person that entered was the pretty female servant he saw this morning! At that moment, she dashed out from the doorway with a shy and nervous expression. Her face was extremely red. Her eyes could not look at Rody but at the same time, she could not help but look at him out of the corner of her eye.</p><br/><p>“Young Master Seth… I heard… you have been confined in here by Miss… so… I brought you… something to eat… to eat.”</p><br/><p>Angel’s voice was trembling. Her face was red as if blood was about to seep out. In a timid manner, she gave him a basket. Rody did not look at its contents but from the fragrance, he could already guess what they were.</p><br/><p>Angel looked at Rody’s handsome face with twinkling eyes. She showed an infatuated expression as her eyes fluttered while continuing to look at Rody’s body.</p><br/>\n</div>"}