{"title": "Chapter 19: Subversion", "id": 19, "volume": 1, "url": "http://boxnovel.org/masked-knight-chapter-19-subversion", "volume_title": "Volume 1", "body": "<h1>Chapter 19: Subversion</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 19: Subversion</p><br/><p>Translator: EndlessFantasy Translations Editor: EndlessFantasy Translations</p><br/><p>Rody’s face turned into a pale white. He looked at the skeleton that just spoke in a human’s voice, and he was about to scream!</p><br/><p>“You… you... you… you…” Rody could feel his mouth trembling. It was understandable. Most people would be scared to death if a skeleton suddenly appeared in front of them and started talking in the middle of the night.</p><br/><p>“Who are… you?” Gathering a bit of courage, Rody completed his sentence.</p><br/><p>“Who?” The jaw of the skeleton moved, “Do you think I am a person?”</p><br/><p>Rody moved away a little, a bit to its side. Only God knows if this thing has any malice. \"In that case, what are you?\" Although his mouth was doing the asking, Rody's eyes were looking at the sword on the floor. It would be great if he could get the sword.</p><br/><p>“Do you want the sword?” The skeleton’s voice made Rody jump. Without thinking, he reflexively asked, “How did you know?”</p><br/><p>The skeleton stretched out its hand, picked up the sword and gently tossed it over.</p><br/><p>Rody grabbed the sword without difficulty and immediately took a defensive posture.</p><br/><p>“Are you planning to fight me?” The skeleton looked at Rody and slowly asked.</p><br/><p>Honestly, Rody felt his legs going limp but he still gritted his teeth and asked, “What are you?”</p><br/><p>“I am Andy, just a human skeleton!” The skeleton’s voice was flat as he continued, “You are too weak, it is better if you don’t attempt to fight me.”</p><br/><p>“Andy? A skeleton can also have a name?” Rody could hardly believe his ears.</p><br/><p>“Why not?” The skeleton’s voice was somewhat dissatisfied. “Why can’t skeletons have names? My name is given to me by my master. Therefore, there is nothing wrong about it! Everything my master does is correct!”</p><br/><p>“Master?” Rody asked, “In that case, who is your master? Is your master Miss Nicole?”</p><br/><p>“Who is Nicole? My master’s name is not Nicole…” The skeleton’s voice was not loud but the next few words almost made Rody jump in surprise.</p><br/><p>“My master’s name is Dandong!” The skeleton said.</p><br/><p>Dandong?</p><br/><p>As in 'Sage Dandong'?</p><br/><p>Is this some kind of big joke?</p><br/><p>That Sage Dandong left behind a talking skeleton, a skeleton with a name?</p><br/><p>Rody had heard that a powerful sorcerer or magician would be able to manipulate objects. There were also rumors of a sorcerer in the northern part of the Roland continent who could manipulate skeleton soldiers.</p><br/><p>However, if it was a talking, thinking skeleton, chances are that nobody in this world has seen it before.</p><br/><p>If it was really one of the ‘things’ left behind by the Great Sage Dandong, (Rody was unable to treat it as a ‘person’) then the skeleton would be at least 200 years old, right?</p><br/><p>Even if a spell could make this thing move, even if the Great Sage could make the skeleton walk and talk, it would be strange if the spell had not worn out after 200 years!</p><br/><p>Thinking like this, Rody turned pale with a scary thought! This thought truly frightened him.</p><br/><p>Perhaps the skeleton was not manipulated with magic. (The spell would have dissipated 200 years ago)</p><br/><p>Then the only remaining possibility is that the skeleton is already alive! It is a living creature!</p><br/><p>My God!</p><br/><p>A living creature! Dandong created a living skeleton!</p><br/><p>Rody’s face was already white as he stared at the skeleton known as Andy.</p><br/><p>“You… you were created by Dandong?\" Rody took a deep breath and asked. He emphasized the word ‘created.'</p><br/><p>“Yes.”</p><br/><p>My God!</p><br/><p>Rody could not help but cry out! This completely overthrew the Empire’s entire theological system.</p><br/><p>Rody still remembered his first day in the Imperial Academy. The first sentence of the first chapter in theology said:</p><br/><p>All life was created by God!</p><br/><p>What does this sentence mean? It means that in this world, all life was created by the Almighty God! All species were created by God!</p><br/><p>God! Only the Almighty God, could create life!</p><br/><p>On the other hand, although humanity was known to be clever, although they could create tools and invent new cultures, they were unable to create life out of thin air!</p><br/><p>Naturally, giving birth is not counted. One way of looking at it was that humanity’s reproduction is merely a kind of replication.</p><br/><p>That is why the Empire's largest theological system proudly declared that all life was created by God! Only God is able to create life!</p><br/><p>But this Dandong! The Empire’s greatest sage, actually destroyed this eternal truth?</p><br/><p>“You… you are here… Were you always here?” Rody swallowed.</p><br/><p>“Correct…” Andy’s voice was a little bit low, “Master said, I am not allowed to go out… this is because if I am seen by others, there will be a lot of trouble.”</p><br/><p>“Trouble…” Rody forced a smile.</p><br/><p>Big trouble! If others found out that Dandong actually created life out of thin air, or some kind of strange creature, even if Dandong was the Empire’s greatest scholar and sage for hundreds of years, he would be seen as a heretic and would immediately be dragged out by the guys at the temple to hang!</p><br/><p>Even the Emperor would not be able to save him!</p><br/><p>It was no joke! It was challenging God’s prestige!</p><br/><p>It was a subversion!</p><br/><p>“So you stayed here? For 200… 200 years?” Rody felt that his brain was starting to fail him.</p><br/><p>“I do not know. Basically, I am always here.”</p><br/><p>“There are always people moving around this room. No one has ever discovered you?”</p><br/><p>Andy’s tone became strange, “My Master has taught me of a method to sleep. As long as I do not want to wake up, others would not be able to find me!”</p><br/><p>“My luck must be really good!” Rody groaned.</p><br/><p>Surprisingly, Andy’s scary skull started to shake as it told Rody something even more astonishing.</p><br/><p>“I dared to talk to you because you have Master’s odor. You are wearing Master’s mask! If I did not see you wearing this thing, I would not be bothered with you!”</p><br/><p>Rody subconsciously touched his face and cried out in fear, “You mean this shitty ‘God’s Smile’? My God! It was something that Dandong wore?” Suddenly, Rody’s eyes turned bright as he blurted out, “Do you know how to use this thing?”</p><br/><p>Rody’s heart was filled with hope. He could finally get rid of these damned rabbit ears!</p><br/><p>However, the skeleton’s next words almost made Rody faint.</p><br/><p>“You do not know? The mask, once worn, cannot be taken off by anyone except Master.”</p><br/><p>The Master?</p><br/><p>Dandong has been dead for 200 years! His bones could even be used for drumming already!</p><br/><p>Rody felt his legs go weak again and sat on the floor.</p><br/><p>Was he really so unlucky? He finally got rid of his Yin Yang face and became better looking but the rabbit ears would now follow him for life!</p><br/>\n</div>"}