{"title": "Chapter 18: The Skeleton Can Speak!", "id": 18, "volume": 1, "url": "http://boxnovel.org/masked-knight-chapter-18-the-skeleton-can-speak", "volume_title": "Volume 1", "body": "<h1>Chapter 18: The Skeleton Can Speak!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 18: The Skeleton Can Speak!</p><br/><p>Translator: EndlessFantasy Translations Editor: EndlessFantasy Translations</p><br/><p>If Rody had looked stunned, it would not be the fault of the fragrance of the food in the basket but that of the shy expression of the beautiful young maid!</p><br/><p>Rody was already quite grown but he had never once had a girl look at him like that before! Not to mention the fact that this girl was quite charming.</p><br/><p>To be frank, Rody’s head felt a little bit dizzy.</p><br/><p>“Young Master Seth…” Angel could not help but softly call out.</p><br/><p>Actually, Angel was terribly confused. She was a natural beauty and Seth also quite liked her. Unfortunately for her, Young Master Seth was born with the innate talents of a playboy. In addition, he did not have just one beautiful maid beside him but also hundreds of noble women around him.</p><br/><p>Angel also knew about her Young Master’s behavior. However, she was at that young age of being love-struck and that playboy was a veteran in this area. Although Angel constantly reminded herself to be careful, she eventually still fell for the talented, handsome young man. Although Seth frequently took advantage of them and made the young girls feel helpless, he also usually treats them well.</p><br/><p>As a commoner with a beautiful face, Angel already knew her own fate. She was just a servant. Even though Young Master Seth may like her at the moment, she did not dare dream about rising one day and turning into a phoenix!</p><br/><p>She may feel helpless, but in fact, this kind of situation was quite common in the Imperial Capital.</p><br/><p>As long as there are nobles in this world and there are beautiful maids, this kind of thing would definitely happen again.</p><br/><p>Angel knew that if she were to continue to follow Young Master Seth, the best outcome in the future would be to marry him as a concubine or to be secretly arranged as his lover.</p><br/><p>However, the most likely outcome was that she would be seduced and then abandoned. After all, she was just a lowly servant.</p><br/><p>She had such complex emotions; Angel had some feelings for the playboy Young Master and at the same time she also feared him. However, she heard that Nicole had once again caught him and confined him. At that moment, her soft heart immediately relented. After thinking for a long time, she took some food and secretly came running in the darkness.</p><br/><p>Rody felt really afraid and nervous, but also happy!</p><br/><p>He was not stupid enough to think that the girl actually liked him. He knew that her target of affection was the playboy that had disappeared to a distant place, not this idiot stand-in that had never even known the tenderness of ladies. Anyway, Rody just could not bear to tell her the truth.</p><br/><p>“Anyway, Miss Nicole told me not to tell the truth,” Rody comforted himself in his mind.</p><br/><p>He trembled and laughed as he stretched out his hands to receive the basket. When his hands touched the other party’s soft hands, Rody’s heart almost jumped out of his chest.</p><br/><p>However, Angel was frightened. The Young Master in front of her had a strange expression and his eyes were scary.</p><br/><p>Angel subconsciously stepped back and tried to regain her composure. She then said in a heavy voice, “Let me… speak first... I came to see you because I was afraid something had happened to you… I am not here because I agreed to.... to… Do not think of any nonsense…”</p><br/><p>“Think about what nonsense?” Rody could not help but ask.</p><br/><p>Hearing those words, Angel blushed. She said, “You… you are bullying me again! I’ll tell you first… If you… If you try to touch me… from then on, I will ignore you!”</p><br/><p>Rody’s heart thumped once again and his face turned red. Although he was not a romantic person, he understood the meaning of the girl’s words.</p><br/><p>Seeing the girl looking at him with fondness and also fear in her eyes, Rody’s heart felt heavy. He thought to himself. What has happened to me? Even if she is beautiful, the person she likes is not me. How can I do that kind of thing? Thinking along these lines, Rody felt ashamed and slapped himself in the face.</p><br/><p>Angel jumped in surprise and then saw Rody suddenly look sad. She sadly said, “Young Master Seth… You… you… I… I…”</p><br/><p>Rody sternly replied, “Sorry, sorry… I will not do… that anymore!”</p><br/><p>Angel looked like she was about to cry. “Young Master Seth… are… are you angry? Do you not like me anymore?”</p><br/><p>After that, Angel hid her face with her hands, turned around, and ran out.</p><br/><p>Even after the door was slammed shut, Rody was still in a daze. With no experience in dealing with girls, he did not know how he ended up making a pretty girl cry.</p><br/><p>Rody sighed and told himself. This is fine. It would avoid trouble. If she found out about my identity, I am afraid Miss Nicole would become angry.</p><br/><p>Rody was secretly glad that if not for the unique circumstances earlier where Angel was already agitated, she would have noticed that compared to the real Seth, Rody’s voice was slightly hoarser. This would have given him away.</p><br/><p>Rody’s kept thinking about the matter. Even after he sat down, he could not concentrate on reading.</p><br/><p>Feeling agitated, Rody stood up again and started to swing his sword.</p><br/><p>The sword that he had initially picked up that day was already destroyed by Master Autumn. His current sword was given to him by Nicole. It was a noble’s popular accessory sword. The scabbard was gorgeous and the hilt was embedded with an expensive cat’s eye. Not to mention the sword, just the cat’s eye was enough to buy a hundred of Rody’s original sword.</p><br/><p>With a sword in his hand, Rody started to practice slashing. He then tried the techniques he learned at the academy. These techniques were constantly practiced until Rody had mastered them. The amount of strength used must be just right.</p><br/><p>Fortunately, the hall of the first floor of the small building was quite spacious. There was enough space for Rody to strike out without restrain in his sword dance.</p><br/><p>As Rody trained with his sword, he recalled the words of Master Autumn. The attack that Master Autumn displayed at the end earned Rody’s heartfelt admiration.</p><br/><p>Thinking like this, Rody started to focus and stood like Master Autumn during the day, his sword pointing skyward. He focused on gathering his strength into his hands, then suddenly shouted and cleaved with the longsword!</p><br/><p>The sword stroke was full of energy but nowhere near that of the sword stroke used by Master Autumn during the day.</p><br/><p>The sword stroke that Master Autumn displayed can only be described as ground-breaking. It was just a strike yet it would be able to cut a boulder into pieces.</p><br/><p>As for Rody’s sword stroke, as opposed to the lightblade, the gusts coming out from the sword slashes would not even be able to blow out a candle.</p><br/><p>Rody sighed in frustration and was a little angry.</p><br/><p>He was normally a stubborn person. Otherwise, he would not have had the guts to break into the Tulip Family’s house in the first place.</p><br/><p>He did not stop to catch his breath but stood up again to practice. His sword's strength and his expression seemed more serious this time. He also tried to condense the energy for a longer period of time. His sword strikes did get somewhat swifter and fiercer. However, reaching the realm of lightblade was easier said than done.</p><br/><p>Not to mention the fact that Rody originally did not understand advanced swordsmanship. Even if he knew how to practice using the energy, he might need to do it for at least 8-10 years. How would he be able to achieve that state now?</p><br/><p>Rody got angry as he continued to slash a few more times. He continued to try several more times without progress. Each time he did it, the power of the sword grew weaker.</p><br/><p>After his last slash, Rody started gasping heavily. His two arms felt soft and weak.</p><br/><p>The moment Rody stopped using his energy, he felt dizzy and was forced to sit down.</p><br/><p>At this point, something strange happened!</p><br/><p>A ray of light started to shine from Rody’s forehead and he felt a severe pain in his head. Rody screamed loudly! He felt like hot water was flowing down from his brain, and it slowly flowed to his arms. His weak and soft arms immediately felt like they could lift a thousand pounds!</p><br/><p>The severe pain in his head became more and more violent and Rody felt like his head would split in two. Unable to bear it, Rody screamed and slashed.</p><br/><p>‘Whoosh!’ A silvery half-moon-shaped light shot out from Rody's sword. The lightblade shone like a rainbow. Rody did not react until he heard the sound of the table in front of him being smashed.</p><br/><p>The wooden table was shattered. Even the scattered books and utensils on the table were also crushed.</p><br/><p>Rody stupidly looked at the scene in front of him.</p><br/><p>He looked at the table that was divided into seven or eight pieces as well as the mess on the floor. Rody took a deep breath.</p><br/><p>“Did… did I do this?”</p><br/><p>Being pleasantly surprised, Rody no longer cared if he was going to be scolded by Miss Nicole in the morning.</p><br/><p>He weighed the sword in his hands, took a deep breath and suddenly shouted out. The sword slashed out again!</p><br/><p>This was, without a doubt, the lightblade. Rody laughed loudly. As Rody was agitated and he had put too much force in his hands plus the fact that he did not hold the sword firmly enough, his sword flew out!</p><br/><p>That really scared the wits out of Rody.</p><br/><p>The sword flew across the hall and towards a massive iron shelf. Rody clearly understood that the iron shelf was the one with all the terrifying medicine bottles Nicole told him about.</p><br/><p>“I’m doomed!” Before Rody could cry out, from within a void, an eerie claw stretched out and grabbed the longsword in its hands.</p><br/><p>The white skeleton that had been standing in the corner appeared in front of Rody all of a sudden, with the sword in its hands.</p><br/><p>Rody’s eyeballs almost popped out!</p><br/><p>“Aaah!” Rody gave out a blood-curdling scream. The white skeleton threw the sword onto the ground. Its eye socket looked at Rody and a human voice came out from its mouth.</p><br/><p>“I was sleeping peacefully! If I had not been careful, your sword would have already pierced my heart!”</p><br/>\n</div>"}