{"title": "Chapter 11: Why Did It Turn Out Like this?", "id": 11, "volume": 1, "url": "http://boxnovel.org/masked-knight-chapter-11-why-did-it-turn-out-like-this", "volume_title": "Volume 1", "body": "<h1>Chapter 11: Why Did It Turn Out Like this?</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 11: Why Did It Turn Out Like this?</p><br/><p>Translator: EndlessFantasy Translations Editor: EndlessFantasy Translations</p><br/><p>“You...” Rody suppressed his surprised feeling. He was not surprised that Nicole was a magician or a sorcerer. For him, there was no difference if Nicole was a magician or a sorcerer but now that Nicole was holding that thing known as ‘God’s Smile’ the situation was entirely different.</p><br/><p>That was because only sorcerers could use this magical artifact. Magicians could not use it.</p><br/><p>Rody suddenly had a thought and gulped, “You… want me to wear this mask?”</p><br/><p>Nicole smiled and slowly approached Rody.</p><br/><p>Rody abruptly shouted out, \"No! I don't want to wear it! I don't want to wear the face of a several-hundred-years-old man!\"</p><br/><p>He stepped back and waved frantically.</p><br/><p>Nicole raised her head. “You don’t want to? This is a magical artifact you know?! A miracle of sorcery! Don’t you want to change your face? Do you want to remain as a little guy for the rest of your life? Remain as a junior swordsman and a poor guy struggling to survive in lower society? Do you want to live your life with that black-and-white face forever?”</p><br/><p>Nicole’s last words stirred Rody’s thoughts a little but he immediately shook his head. “I am not a fool! You wanting me to wear this must be because you have some sort of devious intention in mind! I…”</p><br/><p>“Hmph!” Nicole snorted in disapproval before coldly saying, “You no longer have a choice! Do not forget! I am your master! You will do whatever I command!”</p><br/><p>“No!” Rody said resolutely. He had lost all interest in beauty and temptation. His instincts told him to escape!</p><br/><p>Rody moved quickly. Not bothering to take the stairs, he ran to the railings on the second floor and tried to jump across it.</p><br/><p>Nicole responded faster than him. She coldly grunted, stared at Rody in contempt, and shouted, “Stop!”</p><br/><p>She lifted her hands and Rody’s body suddenly stopped as if he was a puppet that had lost its strings. His body froze and fell from the second floor.</p><br/><p>His head hit the ground and he fainted before he could make a sound.</p><br/><p>Nicole calmly walked down the stairs and arrived beside Rody. She sighed in relief when she saw that Rody had only fainted and did not have any injuries. After that, she gently said, “Don’t blame me for this! Who asked you to suddenly appear that night and knock me out! As a result, that bastard ran away! Since you are the one who started this mess, I can only trouble you. Hmph! Do you know how many people would want to be a part of the Tulip Family and yet do not have that chance?”</p><br/><p>The young girl slowly leaned down and turned over Rody's face. She took a deep breath. Her hands were holding the ‘God's Smile' that was glowing with a strange light. She slowly covered Rody's face with the mask.</p><br/><p>Nicole then sat with her legs crossed. She folded her arms and closed her eyes.</p><br/><p>The air around her started to stir. Nicole suddenly opened her eyes. Her lips moved lightly as she sang the incantation.</p><br/><p>“Bang!” The ‘God’s Smile’ on Rody’s face started to glow brighter until it became a dazzling golden light. Nicole’s expression turned serious and she continued to chant the incantation. The brilliant light became even more magnificent before it gradually began to dim and eventually disappeared.</p><br/><p>Nicole was out of breath. Her forehead was sweating and her face was pale.</p><br/><p>It seemed that the ‘artifact’ called ‘God’s Smile’ was not so easy to use.</p><br/><p>Nicole quickly looked at Rody without giving herself time to rest. One glance was enough to tell. Rody’s black birthmark was now completely gone but… but…</p><br/><p>It was quiet outside the old, dilapidated building. The sunlight was blocked by the lush trees. This tranquil setting was suddenly shattered by a loud scream.</p><br/><p>“Arghh!!!”</p><br/><p>It was a scream that came from inside the building.</p><br/><p>It was a scream of anger, disappointment, frustration and other sorts of emotional anguish!</p><br/><p>“Why! Why did it turn out like this!!”</p><br/><p>Rody did not know how long he had slept. He felt like he had been walking a huge distance in darkness.</p><br/><p>Everything around him was empty. There was no sense of direction nor light. Rody even suspected that he was dead. However, he was still able to think and was conscious. It was strange.</p><br/><p>What did that girl do to me?</p><br/><p>Where in hell is this place?</p><br/><p>“Anyone there?”</p><br/><p>Rody tried to shout but found that he was unable to. It was exactly like how people in dreams would feel. Sometimes, they just wanted to cry out desperately but may find that they did not have a voice.</p><br/><p>The only thing he could do was move his legs to aimlessly walk forward.</p><br/><p>Am I really dead? Does this happen to dead people? The Academy’s Theology teacher said that good people go to heaven and bad people go to hell. Is this heaven or hell? Shit. Don’t tell me dead people can only wander around aimlessly? God, what do I do if I get hungry? How long do I need to walk?</p><br/><p>Everything was pitch black and it was no different from having his eyes closed. Either way, he still could not see anything.</p><br/><p>If only there was some light. I wish I have a candle. Rody could not help but think.</p><br/><p>As soon as the thought flashed through his mind, a light suddenly appeared. A large candlestick with a lighted candle appeared nearby.</p><br/><p>Unfortunately, the flame was too small and could only illuminate the small area around it.</p><br/><p>Rody looked around the candle but found nothing. It was just open space. He looked below the candle and was startled. There was no ground. Everything, himself included, was standing on empty space as if it was normal.</p><br/><p>“What’s going on?” Rody thought to himself. “It will be great if there is more light.”</p><br/><p>As if on cue, the candlestick immediately transformed into a row of candles, brightly lighting up the place.</p><br/><p>However, it was of no use. Although the flames were stronger and lit up a larger space, there was nothing around it. It was still just empty space.</p><br/><p>Rody was stunned.</p><br/><p>From the day before till then, he had encountered too many strange things. For a young man like him, these encounters had already exceeded his mental capacity.</p><br/><p>Although he was a brave man, in an environment where there was absolutely nothing, he could not be certain as to whether he was dead or alive. This feeling almost made him crazy.</p><br/><p>“Argh!” Rody cried in insanity but even his voice failed.</p><br/><p>Cut through this damn darkness!</p><br/><p>A sword magically appeared in Rody’s hands. Rody gradually started to go berserk. His hands held the hilt. His body trembled. With all of his might, Rody suddenly cleaved!!</p><br/><p>A sound rang out from the void. The sound gradually came closer and louder until it seemed to be next to Rody.</p><br/><p>The void in front suddenly cracked open. Rody’s sword had actually managed to cleave through the void.</p><br/><p>The crack seemed to give out a dazzling light as Rody screamed and fainted.</p><br/>\n</div>"}