{"title": "Chapter 29: Rich Folk's Evening Banquet", "id": 29, "volume": 1, "url": "http://boxnovel.org/masked-knight-chapter-29-rich-folks-evening-banquet", "volume_title": "Volume 1", "body": "<h1>Chapter 29: Rich Folk's Evening Banquet</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 29: Rich Folk's Evening Banquet</p><br/><p>Translator: EndlessFantasy Translations Editor: EndlessFantasy Translations</p><br/><p>“That skeleton! He dares to lie to me!” Rody cursed.</p><br/><p>What kind of treasure is this? The damn skeleton had claimed that with this sword in hand, I would not need to fear Grade 4 or Grade 5 swordsmen. He even said that if he had this sword, he would not fear the Sacred Swordsman. Such an arrogant braggart... Luckily, I did not use this sword to fight anyone and risk my life. Otherwise, there is no need for a Sacred Swordsman, even a Grade 3 swordsman is strong enough to kill me... isn't it so? In any duel, if the opponent attacks, this sword will not only be unable to block anything, the user will also be likely to be split into two.</p><br/><p>Rody was so angry that he immediately threw the absurd sword on the floor. He wanted to trample on it but changed his mind when he saw the transparent blade flashing from the floor.</p><br/><p>Rody sighed. “Whatever. It seems this sword still has some value and can be sold. At the very least, I don’t think that the gem on the handle is fake.”</p><br/><p>Thus, although reluctant, Rody picked up the broken sword and hanged it up carefully. However, he angrily kicked the broken fragments on the floor, until they were under the bed.</p><br/><p>For the rest of the day, Rody felt depressed. Even, later, when Angel came to accompany him, he had no interest in her laughter.</p><br/><p>The depressed Rody did not know that somewhere else, someone was raging.</p><br/><p>“Stupid! Fool! Idiot! Retard! He used the precious sword to carelessly cut scrap metal! My lightsaber! Master’s treasure! This kid is a fucking son of a bitch!”</p><br/><p>At that moment, if anyone were present, he would have been scared to death. Have you ever seen a raging skeleton stamping his feet while shouting curses into the heavens?</p><br/><p>In the evening, while Rody was still distressed about the sword, Nicole quietly walked into the room. Only when she had stopped in front of Rody, was he finally aware of her presence and he stared at her.</p><br/><p>That night, Nicole was wearing a splendid attire. Her charming body was wrapped in a fitting white evening dress. It exposed her white shoulders and thin neck. She looked like an elegant and noble swan. Her golden hair was tied into a knot and scattered on her shoulders. The combination of the snow-white skin and the blonde hair made her look very captivating.</p><br/><p>“What are you thinking about? You look like you are in a trance,” Nicole asked, with a slight smile.</p><br/><p>Rody used a great deal of his willpower to control his gaze and to make sure he did not look at Nicole’s chest. However, he failed. When Nicole walked to his side to talk to him, she inadvertently and bent over slightly.</p><br/><p>Rody blushed as he faltered. “N... No...What!”</p><br/><p>Nicole became aware of Rody’s blushing face and immediately realized why he stuttered. Her face turned red and she cursed in a whisper, “Little lecher! Thinking of funny ideas again.” She immediately stood up and moved back two steps.</p><br/><p>Rody did say anything but thought to himself: What is this? Anyway, I have already seen everything I wanted to, that night.</p><br/><p>Naturally, he absolutely could not say that out loud.</p><br/><p>Nicole, with her pink cheeks, was looked charming. She glanced around the room then looked at Rody and said, \"Get ready. We are going out tonight.\"</p><br/><p>“Going out?” Rody was startled.</p><br/><p>Nicole took a deep breath and elaborated, “Tonight, we will attend a small banquet. It will be a study for you. Of course, you do not need to worry. No one will expose you in this banquet. None of the participants are people familiar with my brother. Most of them have not even met my brother. So, I decided to take you to this banquet to improve your knowledge of noble banquets and etiquette. When you masquerade as my brother in the future, you will inevitably need to be familiar with these things.”</p><br/><p>Rody immediately tensed up. He felt like his head got larger.</p><br/><p>Attend a banquet with nobles? That was something unexpected. He thought that all he needed to do was to pretend to be Nicole's brother, practice hard his swordsmanship, get through the training and then pass the examinations. He had not expected so much trouble.</p><br/><p>“This… can I not go?” Rod cautiously asked.</p><br/><p>“Of course not!” Nicole refused. She then called out to Angel and instructed her to help Rody get dressed.</p><br/><p>The clothes needed would naturally be those left behind by that playboy. Angel skillfully picked a few clothes from the wardrobe, meant for banquets. However, Rody pulled his face into a grimace the moment he saw those clothes.</p><br/><p>As a warrior, Rody felt that warrior's clothes were better. He was more accustomed to simple warrior’s clothes.</p><br/><p>However, the playboy’s preference in clothes was clearly different from Rody's.</p><br/><p>Angel very quickly found him a new set of noble's clothes.</p><br/><p>“What kind of clothes are these?” Rody sighed.</p><br/><p>The clothes were complicated. Its collar was wrinkly and had a floral shape. The outer garment was decorated with a few silver chains which would sway when one move about. There was a simple shoulder strap on the shoulder area of the outer garment. As the playboy was not yet of age, the shoulder strap had no military insignia attached to it. Instead, the family crest was embroidered on it with golden threads. The sleeves were more ingenious with designs decorating the wrist area in a circle such that they looked like bracelets. The thin pants made Rody feel awkward as both sides of the pants had decorative folds.</p><br/><p>“This is not a man's clothing!” Rody whispered to himself when he saw his neatly dressed reflection in the mirror.</p><br/><p>Angel looked surprised and softly said, “Young Master Seth… but these are your favorite clothes… you even personally designed them.”</p><br/><p>Nicole immediately looked at Rody and motioned for him not to say anything unnecessary.</p><br/><p>Rody was afraid and no longer dared to speak.</p><br/><p>Nicole smiled and looked at Rody with a satisfied face. In the past, when her brother wore these clothes, she had always found that he looked weak and delicate. However, this same set of clothes, for some reason, seemed to highlight Rody’s strength. Maybe this was because Rody was truly a warrior.</p><br/><p>Nicole then dragged Rody, who looked like he was about to face execution, out of the mansion. She dragged him until they reached the main gates of the mansion. It was after Nicole gave Rody a stern look, warning him, that Rody immediately boarded the carriage.</p><br/><p>This carriage and the carriage she rode on the night Rody attacked, were different. The body of this carriage was painted black, but it was still shiny in the night. The paint used must be unusual. The passenger compartment was spacious, enough even for a few people to lay down side by side. It also had soft velvet cushions that made you feel like you were sitting on clouds.</p><br/><p>Six white horses were pulling the carriage. A halter was placed on each horse's head. The halters had patches that blindfold the horses' eyes as well. A white feather was also placed at each of their heads, giving them a dignified air and pompous appearance.</p><br/><p>The old horseman, Mark, was also neatly dressed. He sat in the driver's seat, holding a whip.</p><br/><p>On both sides of the carriage were another 4 horses each led by a guard. Leading them was the bearded Instructor Carter.</p><br/><p>Rody sighed. Now, this is the noble's pomp. Why did Miss Nicole only have one horseman with her while using that path that night? If it were not for that, we would not have accidentally attacked her.</p><br/><p>When the old horseman lightly whipped the horses, the six well-trained horses, in unison, started to run and pull the carriage. Ting, ting, ting... The bells on the carriage rang as the carriage started to shake. Rody knew he was on his way.</p><br/><p>The four guards quickly mounted on their horses. Two went to the front to lead the way while the other two followed at the sides of the carriage. The guards had a majestic air as they rode on their horses with their torso held straight and alert eyes.</p><br/><p>Rody was tense the moment he was in the carriage. It was not just because he needed to attend the banquet for nobles but also because he was sitting extremely close to Nicole in the dark carriage.</p><br/><p>Nicole did not notice Rody’s restlessness as she continued to explain to him the etiquette of nobles at the banquet. She was thankful the playboy was unconventional. Even if Rody made mistakes later, he would not draw any suspicion.</p><br/><p>Rody felt like the entire carriage was filled with Nicole’s fragrance. That evening, Nicole had used a perfume that Rody was not familiar with. Rody gently sniffed the fragrance. Combined with Nicole’s beauty and her delicate voice, Rody’s thoughts strayed.</p><br/><p>Nicole did not notice anything. When she finished coaching Rody, she thought for a moment. Then her face turned serious as she cautioned, “You might meet someone during the banquet. You must remember, no matter what, do not provoke this person!”</p><br/>\n</div>"}