{"title": "Chapter 20: The Voyeur", "id": 20, "volume": 1, "url": "http://boxnovel.org/masked-knight-chapter-20-the-voyeur", "volume_title": "Volume 1", "body": "<h1>Chapter 20: The Voyeur</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 20: The Voyeur</p><br/><p>Translator: EndlessFantasy Translations Editor: EndlessFantasy Translations</p><br/><p>Rody held his head in his hands as he sat on the floor without saying a single word. On the other hand, Andy was standing quietly at one side.</p><br/><p>After some time, Andy said, “Perhaps you want to take off the mask? Do you know that there are a lot of people in this world who would want to get their hands on this thing? Why do you seem so unwilling?”</p><br/><p>“Ummm?\" Hearing these words, Rody's heart stirred. Perhaps this unlucky ‘God's Smile' had more secrets to it.</p><br/><p>Andy lazily said to himself, “You don't look stupid. How did Master’s mask end up being passed to you? Master once said that whoever obtained this mask would be able to inherit his wisdom! But you… you don’t seem to appreciate it…”</p><br/><p>Its voice was lazy but when its words reached Rody’s ears, it was earth-shattering!</p><br/><p>Dandong’s wisdom!!!</p><br/><p>Rody immediately stood up and shouted, “You… did you say… Dandong’s wisdom?!”</p><br/><p>Andy suddenly burst into laughter. The sound of his laughter sounded creepy in the middle of the night. Without bold courage, most people who were unlike Rody would have already fainted if they saw a skeleton laughing heartily.</p><br/><p>Rody could not help but ask loudly, “How could this be? Why does obtaining this mask mean being able to obtain Dandong’s wisdom?”</p><br/><p>Andy stopped laughing and asked back, “Why do I need to tell you?”</p><br/><p>“…” Rody was stumped for words.</p><br/><p>Andy simply continued on its own. “Mm... Based on what Master has told me, if you want to get an answer from me and I am unwilling to tell you, you can only use coercion and cajolery… Mmm, something about people using force to threaten other people and something like torture… but you are too weak. I can defeat you with one finger... it seems that method is impossible for you… hmm… there is also lying and deceiving me into giving you an answer… But you don’t look that smart either…”</p><br/><p>Those words made Rody’s face turn red.</p><br/><p>“What do you want so that you are willing to tell me the secrets?”</p><br/><p>Andy asked back, “Why do you want Master’s wisdom?”</p><br/><p>This question made Rody freeze for a moment.</p><br/><p>Why?</p><br/><p>Dandong's wisdom and heritage were priceless. With Dandong's wisdom, there would be many earth-shaking discoveries.</p><br/><p>But what do these have to do with an ordinary commoner like him?</p><br/><p>Subconsciously, Rody knew that Dandong’s wisdom was very important and must definitely be discovered. However, he never thought about what to do with Dandong’s wisdom after its discovery.</p><br/><p>“I…” Rody thought for a long time and finally gave a wry smile, “At the very least, I can find a way to take off this mask?”</p><br/><p>Finishing this sentence, Rody looked at Andy with hope.</p><br/><p>Suddenly, there was a clear and crisp knock on the door.</p><br/><p>Rody was shocked and subconsciously looked at the door. He was not checking for ghosts but if someone saw him talking to a skeleton, nothing good would come of it!</p><br/><p>When Rody turned back to look at Andy, he found Andy already standing quietly at its original corner, motionless. It was like how Rody had first seen it on the first day.</p><br/><p>The skeleton looked completely lifeless as it should!</p><br/><p>Rody sighed in relief. He knew that Andy did not want others to discover its existence. Rody cleared his throat and shouted loudly, “Who is it?”</p><br/><p>A respectful voice answered from outside, “Young Master, it is me.”</p><br/><p>After that, the door opened and an old man with gray hair walked in.</p><br/><p>The old man looked somewhat familiar. Rody finally remembered. This old man was the one on Miss Nicole’s carriage that he and Star had attacked that night.</p><br/><p>Speaking of which, that Rody was in such a predicament today was also partly the fault of this old groom.</p><br/><p>That night, Nicole had told him to pick someone to carry home. Of all the people on the ground, the old man decided to grab Star who was the furthest away from him.</p><br/><p>As a result, Rody got desperate and broke into the Tulip Family’s home before being captured by Miss Nicole.</p><br/><p>Thus, Rody decided to show a somewhat unfriendly face.</p><br/><p>The old groom, Old Mark, did not care about Rody’s expression and bowed respectfully, “Young Master, it’s dawn. The lady has asked me to bring you over.”</p><br/><p>“It is dawn?” Rody was shocked. “It’s already dawn?”</p><br/><p>“Yes,\" Old Mark, while still a maintaining respectful form, glanced at the table that was cut into seven or eight pieces by Rody and the messy floor.</p><br/><p>Rody felt somewhat embarrassed and said, “This is... last night I was practicing swordplay and accidentally…”</p><br/><p>Old Mark did not bat an eye. He said in the same tone as before, \"Master, you must be tired after practicing throughout the night. I will ask the others to help clean this up. Follow me to see Miss Nicole for now. If you are late… I am afraid it would not bring you any good.\"</p><br/><p>Rody sighed. Since Nicole called him, he would not dare to delay.</p><br/><p>Without a choice, he followed Old Mark out of the room.</p><br/><p>Once he walked out of the door, he looked back at Andy to find the skeleton secretly lifting his hand to wave goodbye.</p><br/><p>This skeleton!</p><br/><p>The sky was indeed starting to turn bright. However, it was still not quite sunrise yet. Rody honestly did not know why Nicole had called for him so early in the morning. Perhaps the whole family liked to get up early?</p><br/><p>Nicole's bedroom was upstairs, above the room Rody had slept in that day, Seth's bedroom. It was in the biggest most well-designed building in the luxurious complex.</p><br/><p>Old Mark brought Rody to Nicole’s bedroom. He knocked on the door before stepping back to stand behind Rody.</p><br/><p>Someone inside the room immediately and gently opened the door.</p><br/><p>A maid was standing at the doorway. When she saw Rody, she immediately bowed and greeted Rody, “Young Master.” After that, she moved aside to make way for Old Mark and Rody.</p><br/><p>Rody put on a brave front and entered the room.</p><br/><p>Nicole’s room was slightly smaller than Seth’s room but the decorations in the room were more refined. Especially the elegant jewelry and the other small ornaments on the dressing table. These gave the room a softer mood.</p><br/><p>Nicole was not in the room but was behind a screen in the corner of the room. Her voice came from behind, “Stay there and wait! Wait for me to come out and talk to you!”</p><br/><p>Behind the screen, a maid was attending to Nicole, helping her to get dressed. She stood behind Nicole to help her fasten the complicated ribbons and buttons.</p><br/><p>Rody could not help but look at the screen. Although he was separated by the screen and could not really see anything, he could still see the shadows from behind the screen. The sexy silhouette of a young girl changing clothes made Rody’s heart accelerate.</p><br/><p>He suddenly had a strange thought. It would be great if I could see through that screen.</p><br/><p>As soon as that thought passed, Rody felt his eyes become brighter. After that, the screen in front of him immediately turned transparent.</p><br/><p>What just happened?</p><br/><p>Before he was even surprised, the sexy scene behind the screen had firmly grabbed Rody’s gaze!</p><br/><p>Behind the screen, Nicole’s beautiful golden hair was being tied up as the maid helped her put on a skirt. Nicole was also only in her undergarments. That bold and unrestrained figure almost made Rody’s eyes pop out. Nicole bent over and her whole body formed a graceful curve that looked like a deformed ‘S’ shape. She looked stunning, especially when you consider her long legs, slender waist and most importantly, her full bosom.</p><br/><p>Rody could not help but gently cried out, \"Ah.\"</p><br/>\n</div>"}