{"title": "Chapter 46: Song of an Unrivalled Beauty", "id": 46, "volume": 1, "url": "http://boxnovel.org/masked-knight-chapter-46-song-of-an-unrivalled-beauty", "volume_title": "Volume 1", "body": "<h1>Chapter 46: Song of an Unrivalled Beauty</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 46: Song of an Unrivalled Beauty</p><br/><p>Translator: EndlessFantasy Translations Editor: EndlessFantasy Translations</p><br/><p>When Rody and the other three entered the doorway, they were immediately surrounded by a few women. The women leaned towards them with their savoury bodies. Rody’s face immediately turned red but he did not know how to get away from the women at both his sides.</p><br/><p>“Go! Get out and greet the other guests! Young Master Seth is not interested in inferior women like you.” A middle-aged woman immediately came out and chased away the women surrounding the four of them.</p><br/><p>The woman was over forty years old but she still managed to preserve her charm. Her peach-coloured eyes were very powerful and could seduce the souls of men. She was probably much better when she was younger.</p><br/><p>“Young Master Seth, you haven’t come here for a while…! Your Excellency Bayan! You are such an infrequent customer! Look at my eyes! Why are you hiding at the back? Are you shy? Young Master Didi, Young Master Dardaniel, did you come here to fool around as well?” That woman was so smooth with her words that she could completely entertain four people at once.</p><br/><p>Rody was feeling too nervous to speak. Meanwhile, Bayan scolded in jest. “Madam Sophie, enough superfluous words. Bring us the most beautiful women!”</p><br/><p>The four then followed Madam Sophie into the hall.</p><br/><p>Rody has never been to a place of debauchery like this. The floor of the hall inside was covered by a layer of thick carpet, imported from the West. The smell of perfume and alcohol was in the air, causing the customers to feel dizzy. More than ten tables were arranged in a circle in the hall. In the middle of the circle were six dancing women wearing revealing red clothing. Rody has never seen that type of dance before. The dancers all wore a thin veil and were barefooted. Their bodies were lithe and when they swayed, the veil would move and expose their graceful bodies. There were already a lot of guests at the tables. There were some strong looking warriors and well-dressed businessmen from foreign countries. There were even some that gave a surprised expression when they saw Seth and Bayan’s group. They were probably officials of the Empire. The only thing all the guests had in common was that they each have at least one or two women at their sides, laughing happily and teasingly.</p><br/><p>On the left side of the hall, was a small table. Hidden behind a transparent bead curtain, on that table, was also a harp. It was about half as tall as an average person. That harp was made out of pure gold. A woman in white was gently plucking the strings of the harp with her hands, giving out a wonderful melody. The dancers in the hall were also dancing to the music.</p><br/><p>Rody who has never experienced this before in his life immediately slowed down and fell to the back. His eyes could not look away from the seductive bodies of the dancers. However, Bayan seemed to be completely oblivious and continued to follow Madam Sophie. He did not even spare a glance at the attractive scenes in the hall and continued leading his people to the back.</p><br/><p>Going up the stairs and after a few turns, Madam Sophie led the four of them into a small compartment. The moment they entered the compartment, they could no longer hear the dancing and singing in the hall. It would seem that the sound insulation in this compartment is remarkable.</p><br/><p>Earlier, in the middle of the hall, there were some single tables arranged. The three of them also came early to claim their seats. Rody sighed and could only sit down next to Bayan.</p><br/><p>Madam Sophie smiled and clapped lightly. The side door immediately opened, as a woman came walking out.</p><br/><p>The woman was all dressed in white. She looked like a dignified beauty but upon closer inspection, the opening of her skirt was split up to her thighs.</p><br/><p>With each step, the skirt moved, revealing her legs. Contrary to expectations, she had the expression of someone who is calm, pure and dignified. The great contrast in appearance made the guys itched. Didi and Dardaniel kept staring. They hardly moved their eyes and continued to focus at the swaying skirt.</p><br/><p>Didi laughed and was the first to speak, “Good! Sophie! I like this one! Ask her to come over here!” Dardaniel also seemed like he wanted to say something but the moment Didi spoke up, he decided to stay silent. However, his face exposed an unnatural expression.</p><br/><p>Bayan looked at him and smiled. “Dardaniel, do not be disheartened. I am sure Madam Sophie will pick another good one for you. Right?”</p><br/><p>Sophie did not say anything. She merely smiled as she waited for the white-clothed woman to sit down beside Didi. She nodded to her and then raised her hands to lightly clap again.</p><br/><p>Sure enough, another woman came out from the side door.</p><br/><p>This woman dressed completely different from the first one. She was tall and well developed. Her upper body was only wearing a thin sleeveless garment. The garment was wrapped around the body yet did not seem to be able to conceal the flaming chest. Her short skirt also revealed her slender, long legs. Every step had the intention of seducing others. However, the most extraordinary thing was her captivating expression. Her eyes were like hooks that hooked away Dardaniel’s soul.</p><br/><p>Dardaniel’s displeasure had long since disappeared. The moment that woman appeared in front of him, he quickly reached out for her.</p><br/><p>Sophie gave a faint smile before glancing at Bayan and said, “Your Excellency Bayan. Rolin is currently changing and will take a while more.” She then glanced at Rody and gave a strange smile. “Young Master Seth, how would you like it arranged?”</p><br/><p>Rody felt embarrassed and did not know what to say. However, with a laugh, Bayan rushed to speak. “Nonsense. Naturally, according to regulations! Quickly go down!”</p><br/><p>Sophie smiled faintly and gave another glance to Rody before she finally went down. After a while, they heard gentle footsteps from the side.</p><br/><p>Rody suddenly smelled a fragrance. The fragrance was different from the smell of perfume used by most women. It was like the smell of fresh flowers that could coolly seep into the hearts of people.</p><br/><p>Then the side entrance slowly opened and a gentle and graceful figure slowly walked in. This woman was different compared to the previous two women. Her eyebrows were like a crescent moon and eyes like peaches. Her delicate mouth smiled, showing a dimple on her left cheek. Her long white skirt was also extraordinary and seemed to be made by an expert. One glance was enough to tell that this woman had ladylike qualities and was unlike a prostitute.</p><br/><p>The woman walked slowly towards Bayan’s side and gave a shallow smile. She gently said, “Rolin greets Your Excellency Bayan.”</p><br/><p>Rody suddenly remembered a phrase he read from a book.</p><br/><p>The fragrance preceded the perfume. Just a dab was enough to steal a lady's heart.</p><br/><p>Bayan beamed in joy and pretended to be reserved. He only let Rolin sit by his side. Fortunately, he did not display Didi's and Dardaniel's monkey-like manners.</p><br/><p>Now that those three people had someone to accompany them, except for Rody. Didi laughed and said, “Seth is still the best! If not for him, we will not come here today and will not have the chance to see the ‘sorrowful’ Miss Myka1.”</p><br/><p>Bayan raised his eyebrows and thought to himself but did not say anything.</p><br/><p>Suddenly, at that moment, there was a loud “bang” The door was forcefully pushed open by someone and a woman walked in with large strides.</p><br/><p>The woman wore a long black dress and did not have any unnecessary accessories. She could be regarded as extremely simple. Her gentle and radiant black hair was also tied behind her in a simple manner. Her face does not seem to be coated in any kind of powder and looked extremely simple. It is evident that she came without any makeups.</p><br/><p>However, the moment this woman appeared, all the other women in the room, including Rolin, was immediately overshadowed.</p><br/><p>This woman, although she did not have any form of accessories on her, still seemed to be extremely beautiful. The moment she saw Rody, her eyebrows raised for a moment and then she showed a bitter expression. Her eyes, which were like the cold stars of the Heavens, gazed at him resentfully and seemed like she was going mad. A drop of crystal-like tears started to flow gently from her eye and her sad expression would make any man brokenhearted.</p><br/><p>Bayan’s face showed a stunned expression. His eyes swept across the scene.</p><br/><p>The woman looked at Rody for a long time before she slowly approached him. Her body was slender and graceful. Her every step was faithful to her appearance. Didi and Dardaniel had also been watching her until their eyes were frozen.</p><br/><p>When Myka approached Rody, she suddenly gave him a hateful glare. She stretched out a hand and then threw something onto Rody’s chest and bitterly said. “Seth. You dared to come and see me. This thing… I’m returning it to you!”</p><br/><p>Rody subconsciously picked up the object to find that it was a badge with a silver flame, which was the crest of the Tulip family. Seeing the beauty’s sorrowful face, Rody’s mind became blank. He could only hear his heart beating....</p><br/><p>While everybody was still stunned looking at Myka, suddenly, there was a loud crashing sound. The door of the pavilion flew open and hit both sides of the wall.</p><br/><p>Walking through the doorway in big strides was a guy about two metres tall. He was extremely huge and wore leather armour. He was also draped with an animal hide. He was bald and had a face so ferocious he looked like he was going to eat other people. The women in the hall all became afraid. “Ah!” They all screamed and trembled. Even Myka moved backwards and hid behind Rody.</p><br/><p>Didi and Dardaniel became angry. “What a joke! There are people in the Imperial Capital that dare to offend us?”</p><br/><p>Didi and Dardaniel had already drew out their swords. They shouted as they rushed forward.</p><br/><p>There were two whacking sounds. The two men rush forward but before they even attacked, the robust man kicked one of them, who flew and fell onto the floor, unable to get up again.</p><br/><p>______________________________________________________________________________</p><br/><p>Translator’s Footnotes</p><br/><p>1 The name Myka () has many different ways of reading. Among these are, Miao Ge, Mou Ge, Mu Ge, and Miu Ge. Among the possible names that I could use, are Myla and Myra. Since the name ends with Ge, I decided to go for Myka.</p><br/>\n</div>"}