{"title": "Chapter 42: Voyeur Skeleton", "id": 42, "volume": 1, "url": "http://boxnovel.org/masked-knight-chapter-42-voyeur-skeleton", "volume_title": "Volume 1", "body": "<h1>Chapter 42: Voyeur Skeleton</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 42: Voyeur Skeleton</p><br/><p>Translator: EndlessFantasy Translations Editor: EndlessFantasy Translations</p><br/><p>Following Seth's original schedule, Rody was brought by the Principal to the Imperial Academy's famous White Tower.</p><br/><p>The White Tower was the Imperial Academy's tallest building. It was twenty-two storeys high and almost a hundred meters tall. It was built two hundred years ago, and was where Dandong's experimented with new spells. It later became the landmark of the Imperial Academy.</p><br/><p>The whole tower was built using white granite shipped from the north. Every day at noon, the sun would shine on the huge magic crystal on top of the White Tower. The magic crystal would reflect the light and could be seen by everyone in the Imperial Capital. That is why the people in the Empire called it the Tower of Light.</p><br/><p>Rody arrived there with an uneasy feeling.</p><br/><p>This is where all the students learned different spells. The Empire's most famous magician, Elder Glenn, teaches his disciples here.</p><br/><p>Rody's identity as a commoner meant that he was not eligible to study under Elder Glenn. As a matter of fact, the entire tower was off-limits to common civilians. Only those from the noble families have an actual opportunity to learn the teachings of Elder Glenn. There were also a few commoners that were studying there as well. This is because every two years, Elder Glenn would choose a few commoners with potential to study under him as his disciples.</p><br/><p>Unfortunately, Rody was not so lucky. As he was from the warrior department, he does not have the chance to learn spells. However, Seth was different. He was someone who hated to use the sword and preferred more refined subjects. As a result, learning spells was indispensable. Unfortunately, based on the information given by Nicole, the genius Young Master was completely hopeless in learning spells. He was an outright playboy. He was a complete layman whether it was in military, magic, or sorcery.</p><br/><p>While Rody was thinking these thoughts, he slowly followed Principal Sowell up the spiral staircase. His mind also gave birth to all sorts of strange thoughts.</p><br/><p>Just the fact that this was Dandong's old domain, filled Rody's mind with many thoughts.</p><br/><p>These past days, he had seen and met lots of the old Dandong's creations,. Who knows what else he would discover in Dandong's old lab.</p><br/><p>The old principal in front of him started to breathe heavily. His large buttocks constantly swayed in front of Rody. Two slender legs supporting Sir Sowell's fat body which seemed to almost give way. Rody had a difficult time understanding how a person's body could be so fat yet his hands were as slender as the talons of a chicken.</p><br/><p>Rody wanted to kindly tell him that it was not necessary to personally send him up. However, he also knew that the old man was not going to give up the opportunity to curry favor. After all, he is currently the heir to the Empire's most influential family.</p><br/><p>At this time, Rody suddenly heard a familiar shout. Rody was so surprised that he almost fell down the stairs.</p><br/><p>\"Aha! It has been two hundred years yet this place has not changed at all!\"</p><br/><p>This.... .. this clearly is that scary skeleton's voice!</p><br/><p>Rody subconsciously cried out, \"Andy!\"</p><br/><p>Sir Sowell immediately turned around and asked,\"What? Seth, what did you say?\"</p><br/><p>\"No... nothing!\" Rody replied.</p><br/><p>However, Rody's eyes wandered around looking. When did the skeleton follow me? Did the world change so much that a skeleton can walk out in broad daylight?</p><br/><p>\"Shut up stupid!\" Andy's voice rang again in his ear. \"I am not around you. I am still at home!\"</p><br/><p>At home?</p><br/><p>This time, Rody covered his mouth and fought against his urge to speak. Fortunately, Sir Sowell has already continued to walk in front and was not looking back at him.</p><br/><p>\"I am really at home. Didn't I tell you? When you wear this mask, I can see and hear the same things as you.\"</p><br/><p>Rody's immediate response was to feel faint on the spot.</p><br/><p>\"Do not be so alarmed! I am the mighty skeleton and the first man made skeleton with intelligence that was created by the mighty Dandong! If I can't do this, what else can I do?\" Andy's voice was excited.</p><br/><p>If he could, Rody wanted to immediately go back and smash the skeleton to pieces! The last time, he was given an 'exceptionally good sword' only for it to get cut through by an ordinary sword during an experiment. Now this guy is also saying that by using the mask, it could see and hear the same things as him?</p><br/><p>\"What is this? Could it be that he was watching when I am eating, sleeping and in the toilet? He can see and hear everything?\" Rody thought to himself.</p><br/><p>\"Don't get angry, little guy! You want to be angry? Do you even have the rights to be angry at me? I did not even go looking for you after you broke my precious sword! Yet you dare to get angry at me?\" Andy's tone was filled with anger.</p><br/><p>Rody felt so angry he was about to faint. Thankfully, he was nimble and managed to prevent himself from falling. This is because he suddenly noticed that the other party could read his mind! There was nothing he could hide from that irritating skeleton.</p><br/><p>\"For now, shut up! Boy! I won't always follow you! You can rest assured about this! Who do you think you are? Master Dandong? I only borrow your eyes and ears temporarily. Remember! This is only temporary! We old people do not inconvenience others for no reason!\"</p><br/><p>Rody's facial expression at the moment can only be described as wonderful. For an instant, it was blue. After that, it turned red and then turned white. His face was filled with many different emotions. Unfortunately, there was nobody around to enjoy it.</p><br/><p>Elder Glenn's lecture was on the twelfth floor of the White Tower. After going up twelve floors, Sir Sowell looked so tired and he was gasping for air.</p><br/><p>However, Rody was no longer the same as he was in the past. He could see that at least half of the Principal's fatigue was an act to pretend that he exerted all his strength, to curry favor.</p><br/><p>Glenn was not pleased when he saw the headmaster open the door and walked in. Glenn was even more displeased when he realised that it was the headmaster.</p><br/><p>\"Your Excellency. I remembered saying not to disturb me when I am teaching.\"</p><br/><p>Elder Glenn looked as if he was at least eighty years old. He was wearing a pointed hat and a standard gray magician's robe. His long, white beard reached his chest. At this moment, the old man was looking at Sir Sowell who was still standing at the doorway.</p><br/><p>Sowell immediately showed a smile. He does not dare to put on airs as a principal in front of Elder Glenn. Although Elder Glenn was not the most powerful magician in the Empire, he was the most reputable one. This old guy had been teaching magic spells for a long time. Even before Sir Sowell became the president, this old man has already worked for several principals in the Imperial Academy. His disciples are mostly the wealthy nobles. Even in the Imperial Capital, there are not many that had more prestige than him. Sir Sowell cannot afford to offend such a person. Otherwise, it will not just be a matter of Elder Glenn becoming angry but all of his students will also come out and look for trouble. At that time, Sir Sowell would receive more than he bargained for.</p><br/><p>\"Elder Glenn, I brought you a student.\"</p><br/><p>Sowell did not say anything but Glenn could guess that the students the principal personally sent would certainly have a impressive background. After so many years, Glenn understood this natural truth.</p><br/><p>\"Come in.\" Glenn softly said. He then looked at Rody who came in after the principal.</p><br/><p>The students around Elder Glenn also looked at Rody's body.</p><br/><p>Rody pretended to look calm and walked in steadily.</p><br/><p>He was now at Glenn's laboratory. In the middle of the room was a table with different instruments on it. Some of the instruments were the same as the one Rody saw in the small house at home. The students were sitting in a semi-circle around the table.</p><br/><p>Glenn squinted his eyes and looked at Rody for a moment and then whispered, \"You are from the Tulip family?\"</p><br/><p>\"Yes.\" Rody answered quickly while bowing.</p><br/><p>\"N, your blonde hair and blue eyes match your family lineage.\" Glenn continued to look closely at Rody and measure him up. He was so close that Rody felt uncomfortable.</p><br/><p>\"Hmph!\" Andy's voice suddenly sounded in his mind. \"This guy is using a probing spell to look at you! Haha, what good is that probing spell? Watch my skill!\"</p><br/><p>Before Rody could react to Andy's words, there was a large 'bang' sound in his head. He immediately looked around and saw a horrible scene that he would never forget.</p><br/>\n</div>"}