{"title": "Chapter 54: Sunflower Treasure", "id": 54, "volume": 1, "url": "http://boxnovel.org/masked-knight-chapter-54-sunflower-treasure", "volume_title": "Volume 1", "body": "<h1>Chapter 54: Sunflower Treasure</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 54: Sunflower Treasure</p><br/><p>Translator: EndlessFantasy Translations Editor: EndlessFantasy Translations</p><br/><p>What is God? Does God exist?</p><br/><p>Thinking of it, Dandong could later create a living skeleton and an independent space out of nothing! These abilities were already almost God-like!</p><br/><p>Rody felt agitated about Dandong’s words but when he flipped to the next page, he found that Dandong did not continue on this topic.</p><br/><p>Rody who was anxious to know Dandong’s comments about God, flipped through many pages but he did not mention the word God anymore in the later pages. He did not even record the skeleton, Andy and that space in his diary.</p><br/><p>Suddenly, a line of text caught Rody’s attention.</p><br/><p>“ ‘God’s Smile’ is just a hoax. According to my research, it is only a variant of fantastic and amazing sorcery. The Elven Race's mysterious magic is just simple magic with major improvements. Wearing this mask can definitely change a person’s appearance but its real use was to receive the elements of sorcery. It is merely a small trick but a few hundred years ago, the legends mentioned it as something outrageous.”</p><br/><p>“According to the legends, the Elven Race had magical talent from birth. Unfortunately, their species was already extinct and I could not find an entity to study. However, I suspect that what they consider an innate magical talent was the result of the brains of this race developing differently compared to humans. They could also have the benefit of being able to sense the energy which the locals call the magic elements. Alas, the studies have shown that sorcery and magic are just energy with different names. The brilliant Elven Elder who made ‘God’s Smile’ during those years, must have had the same opinion as me. When he made this mask during those years, it was to reduce the limitations of the interaction between magical… no, interaction between the energies. Unfortunately, that elder was skilled in conjuration. That is why the created mask only made conjuring more powerful.”</p><br/><p>“Today… I found out that this mask has a spell to see through objects. How interesting. If I could return to my world and bring this mask, wouldn’t I have X-ray vision? It would be great to walk down the street looking at beautiful woman with this mask…. Sigh, I am thinking too crookedly…. See-through spell or X-ray effect, in the end, it is still a kind of energy. Ah, how boring. I studied for a lifetime and found nothing new. It seems that I really cannot go back home.”</p><br/><p>Rody felt his heart beat like thunder. He took a deep a breath and looked down. He only hoped to see if Dandong wrote anything about how to use this mask.</p><br/><p>Perhaps at that moment, this so called ‘God’ really blessed him because Dandong really made a detailed record on the various methods of how to use this mask. However, Rody felt frustrated after reading it.</p><br/><p>This is because according to Dandong, ‘God’s Smile’ is a tool of sorcery. To use it, he must have a certain level of ability in sorcery. Also, it could only be used by a sorcerer of Grade 4 or higher. Rody definitely could not do this alone. Even if he searched the whole Empire, he probably could not even find 10 sorcerers that were at least Grade 4. That was because the Radiant Empire was a kingdom of magicians. There were a lot of Grade 4 magicians but not many Grade 4 sorcerers.</p><br/><p>Rody read the back of the book. There were too many things but most of it were very profound and difficult to read. Therefore, he skipped to the back.</p><br/><p>When he turned to the last page, a few fine words caught his attention.</p><br/><p>“I originally wanted to burn this as it contains too many things that do not belong in this world. However, I spent a lifetime writing all of these things down and felt like it would be a pity to burn it. Might as well leave it for the future generations. When I was young, I read stories of rookie warriors finding books containing the secret skills of senior heroes and then becoming the strongest. Although this is not a skill book, it is probably as useful as one. I don’t care anymore! I will be that senior hero!”</p><br/><p>“I have found a way to preserve the life but it does not interest me. I have had enough of this world. The past few decades, the emperor has provided me with money, women and entertainment to the extent that I got bored of them all. It's probably better to be dead. Although Rudolph treated me kindly, the demise of his family in the future is inevitable. Even if I want to do something about it, it is not within my control. Either way, leaving behind a person to become this family’s bodyguard is already considering him as a brother. Sigh… I do not care anymore!”</p><br/><p>“Note: The two-months’ worth of notes in front, are recorded in our common language. This is to enable the future generation rookies to understand the secrets contained within my notes. I purposely used two days to translate this into the Imperial Language. To the person who obtains this, even though I do not know who you are, I have already done my utmost best. I hope that you are magnanimous! Alas what a pity, this book needs a prestigious name. All those novels also had resounding names for their secret books… Nine Yin Scriptures? Falling Dragon’s Eighteen Palms? Ying Yang of Great Compassion? Aha! Found it! Let’s call it Sunflower Treasure!1”</p><br/><p>“Person of the future generation! This book is known as the Sunflower Treasure! If you get a hold of this book, you must practice the teachings here then, you would be invincible! Haha… how do you say that in a line… Sunflower in My Hand, Country in My Possession…. Haha, I’m leaving now!”</p><br/><p>Rody felt confused. He found that the 200 year old Great Sage Dandong’s words were difficult to understand. He could only understand four to five sentences out of every ten sentences he read. As for the Sunflower Treasure, he simply could not understand it from the beginning.</p><br/><p>Rody exhaled and put the book back into the wooden box. He gently stroke the box with his hand. Thinking of it now, the words engraved on the wooden box which he could not understand, must be “Sunflower Treasure”. Those words were written in a flamboyant cursive style with a ancient slant to it, except that he did not recognize a single word.</p><br/><p>Rody earnestly held the box, knelt and vowed, “Master Dandong, I, Rody am a useless child. However, I will learn to use the Sunflower Treasure you left behind and not bring disgrace to it.”</p><br/><p>Rody spoke righteously, wondering whether Dandong would laugh if he ever found out in the netherworld.</p><br/><p>Suddenly, he heard Andy’s voice, “Idiot! Quickly! You are so slow that the sun is already rising. Quickly go!” Rody immediately stood up and left the room through the hole. He did not forget to cover the entrance back up with the rock. There were not many people who went there on normal days and even if they did, they would unlikely notice.</p><br/><p>Taking advantage of the dark, Rody quietly left the White Tower. He carefully climbed over the wall and left the academy and then returned to the Tulip Family’s mansion while avoiding patrols and pedestrians.</p><br/><p>Early the next morning, His Majesty the Emperor sent someone to officially announce that in three days, it would be the examination for the Tulip Family’s heir. His Majesty would personally host the examination.</p><br/><p>Nicole did not dare to slack off. Although she knew about Rody’s strength, she stepped up his training for the next three days. Instructor Carter also anxiously used all of his abilities to proudly teach Rody swordsmanship. If Rody passed the examination, he would become Tulip Family’s next generation duke. Then, he would be master of the Tulip Family’s dukes!</p><br/><p>Rody trained every day for the past few days and he hid under the quilt to read the Sunflower Treasure at night. When he came across something he did not understand, he asked Andy. Andy did not ignore him and responded immediately each time Rody called for him. However, Andy did not seem to be in a good mood. His words were melancholic but were not sarcastic like usual.</p><br/><p>Translator’s Footnotes</p><br/><p>1 Kuíhuā băodiăn basically means Sunflower Treasured Book or Big Flower Treasured Book. I went with Sunflower Treasure because it still sounds right and also sounds cooler. Although he could not understand it, he suspected that the words carved onto the box were “Sunflower Treasure”. He just felt that he could not understand a word of that imposing and primitive carving.</p><br/>\n</div>"}