{"title": "Chapter 57: Inheriting Peerage in the Audience Hall", "id": 57, "volume": 1, "url": "http://boxnovel.org/masked-knight-chapter-57-inheriting-peerage-in-the-audience-hall", "volume_title": "Volume 1", "body": "<h1>Chapter 57: Inheriting Peerage in the Audience Hall</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 57: Inheriting Peerage in the Audience Hall</p><br/><p>Translator: Zenobys Editor:</p><br/><p>All the participants who passed the examination were gathered in the audience hall. Those who were eliminated had lost the opportunity to inherit their title.</p><br/><p>The Radiant Empire’s tradition of inheriting titles started during Dandong’s era. Abbas the Great was afraid that his kingdom would only experience a short moment of glory and then decline. To ensure the quality of the Empire’s upper class, Dandong was asked to design the examination system. It should be known that the history’s greatest emperor, Abbas the Great, was exceptional. His foresight with regard to this examination was ample proof.</p><br/><p>Any noble who was in line for the title of earl or higher had to pass the examination to inherit the title. Those that could not pass the examination would be eliminated.</p><br/><p>Of course, a noble would not have only one son. If one son was eliminated, their other sons could also participate in the examination. They believed that at least one of their sons would pass the examination. Even if all their sons failed to live up to their expectations, the emperor would not deprive them of their title. They could wait for outstanding individuals in the next generation to participate in the examination and restore their titles.</p><br/><p>In other words, the noble title bestowed upon the family was always reserved. If a family member of that generation had the ability, they would be able to inherit the title. However, if they did not have the ability, they could always wait for the next generation to try again.</p><br/><p>Dandong set up such an examination system to maintain the standards of the Empire and to prevent the upper class of the society from rotting after long years of peace. That was one of the reasons the Empire was still powerful after 200 years.</p><br/><p>The military examination was over and now it was time for the other examinations.</p><br/><p>His Majesty personally presided over and assessed the second round of examination. Several elderly royal think-tanks also separately assessed a few young nobles.</p><br/><p>That examination was a walk in the park for Rody. Nicole had hired a lot of scholars to teach him both political and other knowledge. As a result, Rody had already built a strong foundation. On top of that, Rody had read many books at home and gained a lot of knowledge. Fortunately for him, even if there were occasionally some strange questions that he could not answer, he could ask Andy, the 200-year old monster in his mind. The old thing in his head was an encyclopedia by himself!</p><br/><p>Of course, Rody still had his own weakness. His weakness was his faith! Most of the questions about theology could not be answered by Rody. He could not be blamed. From the start, he already felt suspicious about the issue of faith. After all, those he had dealings with like Andy, Old Mark, and even Dandong who died 200 years ago were all rebels against God.</p><br/><p>Fortunately, he managed to answer those questions with Andy’s help.</p><br/><p>After the end of a day of examinations, a few of the families were delighted while a few were worried. Some of the younger nobles had been eliminated but their families were probably not very disappointed. As some of them were the eldest sons, their younger brothers would rejoice as they would then have the opportunity to inherit the title. However, there were also families that just lost their last glimmer of hope to restore the glory of their family. They could only wait until the next generation to inherit the title.</p><br/><p>Rody and seven other young nobles stood respectfully in the hall, waiting for the Emperor to confer on them their titles. Abbas XI was currently experiencing a complicated feeling. The present situation was going according to his plans. He was originally hoping to send the Tulip Family to the front lines to be made as a scapegoat. Allowing him to inherit the title was as planned. However, the strength this kid displayed that day was too amazing! He could defeat 16 Grade 1 swordsmen on his own! On top of that, his opponents could not even fend him off! He had already surpassed the level of a Grade 3 swordsman!</p><br/><p>This kid has amazing strength. I am afraid of what he will do if he is sent to the northwest!</p><br/><p>Moreover, there was Gray. The Emperor did not send him. However, Abbas XI knew who sent Gray to attack Rody. He heard that the Commander in Chief in the north, Milo did not have a good relationship with Seth. Meanwhile, Gray was one of Milo’s close friends. Those kids were always up to mischief.</p><br/><p>That Milo is skilled and I really trust him. However, he seemed too anxious about sending people to the Northwest to help with the war. He is insistent on sending the Northern Legion to the Northwest. He is too impatient about earning merits… It is no wonder that he is thinking about how to suppress the Tulip Family...</p><br/><p>Milo must have known my true intention of letting Seth inherit the title. This is why he dared to resort to lowly tricks, right before my very eyes... Hmm.</p><br/><p>Abbas XI thought of many things before he slowly looked at the eight young nobles before him. Other than Rody who had a calm expression, the other seven looked flush as they could not suppress their inner excitement.</p><br/><p>“You all make me very proud,” Abbas slowly spoke. His voice was loud and clear. “You are all also worthy of your family’s glory!”</p><br/><p>After that, His Majesty the Emperor stood up and lifted a scepter which symbolized supreme authority and loudly proclaimed, “I, the descendant of Abbas the Great and the supreme ruler of the Radiant Empire, hereby declare that you have officially inherited the title of your family and that your glory will coexist with the Empire!”</p><br/><p>“Long live the Emperor!” All the guards inside and outside the audience hall shouted loudly. The eight young warriors knelt down immediately.</p><br/><p>The Emperor slowly walked in front of them and took out his sword. He gently placed the blade of the sword on the shoulders of each and every one of them. He then stretched out his hand allowing them to kiss his ring.</p><br/><p>Rody felt the Emperor’s cold hand and saw that his smile had no excitement or joy. He smiled coldly in his heart but maintained his composure.</p><br/><p>Just when the eight young nobles stood up to accept the congratulations of the other nobles, a strange and sad horn sound was heard in the audience hall.</p><br/><p>“Aargh!” A lot of people cried out in alarm and felt nervous. His Majesty the Emperor also changed his expression.</p><br/><p>That was because they realized that it was the sound of a special horn in the Imperial Capital. Following the teachings of Abbas the Great, whenever there was a military emergency or any important situations, the messenger could blow that horn. With that, all the guards would not obstruct their passage into the audience hall. Even in the middle of the night, horses and carriages were not allowed to be obstructed.</p><br/><p>They heard the sound of galloping quickly approaching from outside. A warrior wearing silver armor rode all the way to the audience hall. He almost rolled down from his horse. His whole face was sweaty, his armor was a mess, and he had no helmet. Tied to his back, a red colored command flag1 that was used for emergencies, fluttered in the wind,</p><br/><p>Gordon and several guards immediately surrounded him. Although he could not be obstructed on his way into the palace, they still needed to inspect him before he could see the Emperor.</p><br/><p>The silver armored warrior could hardly stand. Supported by two of the guards, he quickly took out a command token2. It was the passage token3 of the Northwest Legion Commander!</p><br/><p>Gordon nodded his head and personally brought the warrior into the hall.</p><br/><p>“Your Majesty! Military Army of the Northwest!”</p><br/><p>Abbas XI trembled for a moment, struggled to stand firmly before he commanded loudly, “Speak!”</p><br/><p>The silver warrior hesitated for a moment. He was not a fool. The audience hall right now was filled with a lot of people. It would not be good to report in front of so many people.</p><br/><p>Abbas XI’s heart sank and he lightly spoke, “Just speak. We cannot hide this forever”</p><br/><p>The silver warrior immediately knelt to the ground.</p><br/><p>\"Your Majesty! Two days ago, the crown prince of the Great Moon Kingdom, Reuenthal led an armored cavalry of 18,000 in a two-day and night raid over five 500 miles! We have lost the Northwest cities of Trier and Loulan! The garrisons were defeated and we have lost 30,000 soldiers! Currently, Reuenthal's army has already formed a pincer attack and has surrounded the Northwest Legion! General Reuben has requested that His Majesty quickly send reinforcements!\"</p><br/><p>“Huh?”</p><br/><p>The audience hall became very noisy There were those who screamed and shrieked. There were also those who whispered to one another. All of them were terrified.</p><br/><p>Abbas XI’s face turned pale and became gloomy. He looked resolutely at the silver armored warrior for a moment. Soon after that, the Emperor spoke, “Gordon, summon all the ministers.” The Emperor sounded lifeless. He then looked at the nobles in the hall, waved and sighed. “Those unrelated to this can all disperse now!”</p><br/><p>Everyone knelt and dispersed. Although Rody had just inherited the title, he had not taken up any government post. So, he followed Nicole out of the hall. In the end, only a small number of nobles holding government posts remained in the hall.</p><br/><p>Along the way, many nobles talked about the war in the Northwest. Rody, without saying a word followed Nicole and the crowd out.</p><br/><p>At the square, Instructor Carter felt excited when he heard about the war in the Northwest and whispered, “Young ma… no, I mean…Your Excellency. Now, will His Majesty dispatch us out on an expedition? Every time the Empire entered a difficult situation, it would be the Tulip’s Family time to earn merits!”</p><br/><p>Rody looked unconcerned and glanced at Nicole. When he saw Nicole’s preoccupied look, he smiled and whispered, “Yes. Instructor Carter… It seems like it is time for us to fight.”</p><br/><p>However, Rody had something in his heart which he did not say.</p><br/><p>Are we going to survive this?</p><br/><p>____________________________________________________________________________</p><br/><p>1 command token,  (lìng pái), is the authority token.</p><br/><p>2 passage token,  (tōngxíng lìng pái), works like a visa, guaranteeing safe passage through any checkpoint.</p><br/><p>3 command flag,  (lìng qí )</p><br/>\n</div>"}