{"title": "Chapter 52: Night Exploration of the White Tower", "id": 52, "volume": 1, "url": "http://boxnovel.org/masked-knight-chapter-52-night-exploration-of-the-white-tower", "volume_title": "Volume 1", "body": "<h1>Chapter 52: Night Exploration of the White Tower</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 52: Night Exploration of the White Tower</p><br/><p>Translator: EndlessFantasy Translations Editor: EndlessFantasy Translations</p><br/><p>“Boy, how much have you been studying these past few days? How much of the famous historical Art of War have you learned? Don't tell me all the knowledge has been fed to the dogs? Did the little girl not tell you about the war in the Northwest? Don't you know how to think using your brain?”</p><br/><p>“Let me ask you, if you were the commander of the Great Moon Kingdom who just defeated the Empire’s Army of 200,000 in one swoop, you have now occupied the Northwest and you are aware of the Empire’s lack of military strength as well as its inability to mobilize more soldiers in a short time, what would you do? The entire Northwest Region is now vulnerable to the Great Moon Kingdom! They have assembled 80,000 cavalries at a strategic location in the Northwest, Oldenburg. Why would they assemble so many cavalries there? Don't tell me they went there for their horses to graze? To the Great Moon Kingdom, the rest of the Northwest Territory is undefended. Don't tell me they will not be tempted to attack?</p><br/><p>“The Northwest Legion is already finished! The fact that it was not completely destroyed is already a miracle from God! Just now in the audience hall, did the emperor say he wanted to send more reinforcements? Did he say he wanted to dispatch more soldiers? Idiot!”</p><br/><p>Rody’s face immediately changed and he could not help but frown. “Perhaps the emperor would send reinforcements... After all, Northwest is also part of the Empire…”</p><br/><p>“Aah!” Andy’s tone of voice sounded as if he was sneering. “Dispatch troops? If the Empire could do that, why would the emperor need to receive an emissary from the Great Moon Kingdom? It is not that the Empire will not send reinforcements, it is that they have no soldiers to send as reinforcements! How long would it take to mobilize troops from the North? How long would it take to assemble willing participants? Even if the emperor is resolute enough to take the risk and fight against the cavalry, how many days would it take to send out troops from the Imperial Capital?”</p><br/><p>Rody immediately closed his mouth. His mind was churning at high speed with calculated thoughts.</p><br/><p>Not dispatching any troops? Then there could only be one explanation! The emperor received the envoy to delay the attack! But because the envoy was attacked, it would seem that peace is no longer an option... Or rather, the Great Moon Kingdom had never really wanted peace. The envoy was just sent over to deceive the public. Otherwise, what is the point of assembling more soldiers? For a military parade?</p><br/><p>Since war is inevitable, or rather since defeat in the war is inevitable, then there must be a malicious intent in dispatching me...</p><br/><p>Who were the people the emperor hated the most in the Empire? Rody finally understood that the emperor hated the Tulip Family who had earned high merits for protecting the lord. The emperor would be very willing to take this opportunity to shoot down the Tulip Family’s foundation!</p><br/><p>After dispatching him to the Northwest, it would no longer be a matter of whether the Northwest Legion could withstand the Great Moon Kingdom’s cavalry. They would most likely be defeated and Rody would be killed in the process. Even if Rody somehow manages to escape, the Tulip Family’s record of being undefeated would be tarnished and they would lose the respect they once had. It was the perfect solution to the internal threat for His Majesty the Emperor!</p><br/><p>Rody started to sweat and whispered, “But… the emperor would not sacrifice the lives of thousands of soldiers in the Northwest Legion to achieve this goal right? That price is too big!”</p><br/><p>Andy’s voice turned unfeeling and grim. “You are too young! Since when was there never a bloody river in a fight for imperial power? As long as he gets to keep his power, why would he care about the lives of tens of thousands of people? Even if the Emperor does not have the courage to sacrifice the Northwest Legion, the Northwest Legion only just needs to be defeated and escape. Then his objective would already be achieved! Although, to the people in the Empire you are just a special envoy meant for show, other people out there would not see it that way. The world would think that the Tulip Family is the real commander! The defeat of the Northwest Legion would be the fault of the Tulip Family! If I was the emperor, I would also accuse you of not accomplishing the mission as His Majesty’s special envoy, and execute you. Others would also have nothing to say!”</p><br/><p>These words made Rody’s heart pound wildly.</p><br/><p>Rody thought to himself and did not discuss this with Nicole. With a bitter feeling and knowing that he was actually not a particularly resourceful person, how could he find a solution in such a short amount of time?</p><br/><p>After a long time, Andy’s voice sounded out again, “Boy, as long as you promise me one thing, I will help you to solve this problem!”</p><br/><p>“What?” Rody’s heart stirred. Although he was originally an honest person, these past few days Rody had been influenced and now had the ability to scheme. Now that this skeleton has woken him up, come to think of it, he must have a solution already.</p><br/><p>“Tonight! It must be tonight! You must sneak into the White Tower. Go to that wall you saw this morning, break it down and go in to look around,” Andy’s voice was soft but resolute.</p><br/><p>“Fine!” Rody, without thinking immediately agreed because he had no choice. The behavior of the mysterious skeleton could not be comprehended. It was also unknown as to how many secrets the skeleton possessed. Since it was able to wake him up, it must have a solution.</p><br/><p>Rody patiently waited until evening. Nicole did not visit him as she was shy but she ordered Angel to serve Rody dinner.</p><br/><p>Late that night when the moon reached its peak, Rody quietly got up from his bed. He quietly put on his warrior’s clothes. He hesitated for a moment before he took the silver mask that Nicole gave him. He had used it before. He then took the light saber before he quietly left through the window.</p><br/><p>In fact, he was not clever at leaving without being noticed. Several guards actually saw him. However, the original Young Master Seth also used to slip out in the middle of the night. The guards who recognized Rody’s figure kept their calm. They allowed him to get past without stopping him. They just thought to themselves that the young master was finally reverting to his old self after so many days.</p><br/><p>Rody knew the way to the academy. The streets were devoid of pedestrians at that hour. He only needed to avoid the night patrols. Without any trouble, he ran towards to the academy and this took him quite a long while.</p><br/><p>He silently climbed over the walls of the academy. Thankfully, the Imperial Academy was not a heavily guarded place. Without anybody noticing him in the dark, Rody dashed discreetly towards the White Tower while concealing himself behind the trees.</p><br/><p>The bottom floor of the White Tower was a prototype foundation. The large gate was open and there were no guards, probably because it was also the home of the famous magician Elder Glen. It was just that Andy needed to constantly warn Rody.</p><br/><p>“Do not step on the sixth step! There is a spell trap! Do not touch the handrails on the staircase! Also… be careful not to step on that pattern on the floor! That is a magician’s cloth spell!</p><br/><p>With the guidance of the skeleton, Rody quietly arrived at the wall he saw during the day. Once again, he stood in front of that wall. Rody was sweating and felt relieved. He ran all the way here and was lucky enough not to be spotted. He was already feeling extremely nervous. He had never tried being a thief before!</p><br/><p>Rody pushed the wall gently with his hands. He strained his ears and listened to determine that there was nobody near him. He then gently knocked on the wall.</p><br/><p>“Use your sword!” Andy’s voice advised Rody.</p><br/><p>“It is like what you did during the day when you attacked and defeated that barbarian. Concentrate all your power, bit by bit into the sword. After that… do you see the jewel on the hilt? Use your strength and pinch those jewels! Use your strength bit by bit, don't be too nervous,” Andy’s voice also sounded nervous but like before he never neglected to talk nonsense. “Pity that foreign prince. He thought you were using fighting energy… How could such an elementary thing be compared to your current strength? Even though fundamentally you are like trash however, your body has already received the ‘real power’ from Old Man Autumn. Although it was only a small amount, after many days of training the power has automatically built up. Ah… it is better than that trash earlier…”</p><br/><p>“Shut up, Andy!” Rody felt his head ache listening to him and was unable to concentrate. He could not help but scold him.</p><br/><p>Rody then concentrated on being vigilant and mimicked what he did with his sword the previous two times. Little by little, he concentrated the warmth of his hands as he held the sword. And then, slowly using his strength….</p><br/><p>Suddenly, there were brilliant enchanting lights bursting out of the jewel at the hilt of the sword which immediately dimmed. After that, the body of the sword also radiated a strange, gentle light while the edge of the sword emitted a pale golden light.</p><br/><p>“Uh?” Rody was a bit surprised but he could not help but snort lightly.</p><br/><p>“Idiot! Act quickly. Use the sword to slash! Slash lightly!” Andy’s voice urged.</p><br/><p>Rody grit his teeth and ruthlessly slashed the sword into the wall... “Shih,” it made a soft sound. The seemingly fragile scrape enabled the lightsaber to pierce through the wall easily as if it was extremely thin!</p><br/><p>Rody stared at the sword in his hands with eyes wide open and was too surprised to speak.</p><br/><p>“Quickly!” Andy scowled. “Don’t be in a daze! You are too weak and the sword will not last long!”</p><br/><p>Rody restrained his thoughts and slowly moved the sword. He cut a big square shaped pattern in the wall. To his horror, the solid hard wall under the lightsaber was softer than the bread he ate at home! A big section was easily cut out by Rody, creating an entrance big enough for one person to squeeze in.</p><br/><p>Rody pulled out the lightsaber and carefully inspected it for damages. He was pleasantly surprised and carefully kept it. After that, he moved the piece of rock he just cut away.</p><br/><p>It was really empty behind the walls! However, it was so dark inside that he could not see anything clearly. On top of that, a smell of decay emerged from that hole.</p><br/><p>Rody gnashed his teeth and searched his own body. He then took out an illumination gem and gently threw it out. The gem rolled on the ground and gave out light, making the empty space less obscure.</p><br/><p>Two mice in the corner were frightened and ran away. With one big stride Rody entered. He turned around and carefully placed the brick back on the wall. This was so that if anyone should come, they would not be aware that the rock was moved without looking carefully.</p><br/><p>Rody looked around the place with that faint light and frowned. “Where is this place?”</p><br/>\n</div>"}