{"title": "Chapter 64: Life-Saving Treasure", "id": 64, "volume": 1, "url": "http://boxnovel.org/masked-knight-chapter-64-life-saving-treasure", "volume_title": "Volume 1", "body": "<h1>Chapter 64: Life-Saving Treasure</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 64: Life-Saving Treasure</p><br/><p>Translator: Zenobys Editor:</p><br/><p>Old Mark was abnormally familiar with the roads in the Imperial Capital. He took Rody through a path that had very few people and they soon reached the southern gate of the Imperial Capital.</p><br/><p>Rody stared at the nearby buildings with wide eyes. Without a doubt, they were at the southern gate of the Imperial Capital. A carriage, moving at normal speed would take an estimated half an hour to reach it from the prostitution den. However, Rody was sure that Old Mark did not take that long to walk to the gate.</p><br/><p>“I have driven carriages for decades,” Old Mark lightly spoke when he saw that Rody was surprised. “I am also very familiar with the roads in the Imperial Capital. The path we took earlier was almost a straight path to the southern gate.”</p><br/><p>Rody secretly muttered to himself.</p><br/><p>Nonsense. You have lived here for over 200 years. Of course, you would be familiar with the roads here!</p><br/><p>Old Mark did not continue to speak and led Rody into a small alley. After that, he stood in front of a medium-sized residence.</p><br/><p>“What is this place?”</p><br/><p>Old Mark did not reply but he pushed the door open and walked in with long strides. Rody followed him.</p><br/><p>The residence was not small. It had two courtyards but the courtyards looked deserted. It looked like not many people usually visited the place. After both of them entered the innermost courtyard, Old Mark closed the door and turned around.</p><br/><p>“Give me your sword.”</p><br/><p>“Huh?” Although things felt suspicious, Rody gave his sword to Old Mark. He knew there was no point trying to oppose that man who had unfathomable strength.</p><br/><p>Old Mark took the sword, drew it out and carefully looked at it before sighing, \"It really is the Master's lightsaber! Where did you get it from?\"</p><br/><p>Rody was about to speak when Andy cried out in his mind, “Do not tell him about my existence!”</p><br/><p>“I found it in the laboratory at home. It should be one of the Great Dandong’s relics,” Rody spoke while remaining calm. He had been posing as Seth for a while dealing with others and thus, needed to lie a lot. As a result, he became more proficient at lying and no longer had the appearance of a clumsy child when he did.</p><br/><p>Old Mark sighed. He gave the sword back to Rody and frowned. “This sword is powerful but do you know how to use it?”</p><br/><p>“I roughly know how to use it.” Rody nodded. He lied again when he saw Old Mark’s puzzled face, “In the laboratory at home, I found one of the Great Dandong’s notes.”</p><br/><p>“Good! Show me how to use it.”</p><br/><p>Rody understood that Old Mark wanted to test his strength. Rody took a deep breath and slowly gathered his strength from his body into his arms. He then felt the heat slowly flowing out of his arms and into the lightsaber. Sure enough, the gem on the hilt of the sword lit up and a cool, brilliant ray of light emerged from the sword.</p><br/><p>“Hmph!” Rody did not expect Old Mark to be dissatisfied. “You fool! Are you this slow every time you use the sword? Every moment on the battlefield is dangerous. If enemies confront you, do you think they would wait for you to slowly gather your strength? The moment they see you standing there stupidly, they will immediately hack you into several pieces!”</p><br/><p>After he was verbally abused, Rody replied feeling depressed, \"I have no choice. The amount of power in my body is still too weak to properly use this sword. You know very well that if one is unable to gather power, this sword is simply scrap! Even a normal sword will be able to cut it.\"</p><br/><p>Old Mark frowned. He took the sword from Rody’s hands and gently swung it without paying much attention to Rody. The lightsaber suddenly gave out a pleasing sound and the gems on the hilt turned bright. The full length of the blade also radiated an extreme brightness.</p><br/><p>“Look!” Old Mark shouted. He flicked his wrist and the sword in his hands swung back. When the sword was swung, it gave out a distinct sound. Before the sound ended, Old Mark’s body floated. It was as if he became extremely light. How he moved was not clear. The only thing that could be seen was light moving downwards.</p><br/><p>A soft thud was heard as a limestone table was sliced into two and both sides slowly fell to the ground.</p><br/><p>Rody watched the scene very carefully and noticed that before the lightsaber actually touched the table, the faint light from the blade of the sword had easily sliced the limestone table into two halves.</p><br/><p>Rody sighed.</p><br/><p>This 200-year-old man has frightening strength!</p><br/><p>Old Mark returned the sword to Rody and spoke seriously, “My fighting style relies on speed and is not a style that can be learned by someone with a body build like yours. However, I want you to understand that the lightsaber’s main strength is not its sharpness but its ability to amplify the amount of power used by the body. Although the amount of power in your body is still too weak, as long as you can understand this and cleverly use the power in your body, this sword can really be useful.”</p><br/><p>Rody gave him a condescending look and could not help but whisper, “Useless advice.”</p><br/><p>Old Mark replied lightly, “So, I suggest you keep the lightsaber and bring another slightly better sword with you. The lightsaber can only be used during an emergency. After all, you are currently too weak. Even though you have learned Master Autumn’s Half Moon Slash, you become weaker or run out of energy every time you use it. That is not right. On the battlefield, each time you cut down a few enemies, more will appear to attack you. You cannot just lie down and wait to be killed.”</p><br/><p>“In that case, what do you think I should do? Can you teach me how to use your so called 'power'?”</p><br/><p>“Do you think it is that easy?” Old Mark sneered. “I spent 10 years trying to comprehend fighting energy. I spent another 10 years learning how to control it. After that, I spent another 10 years trying to comprehend this ‘power’! Normally, this ‘power’ is sublimated from a higher level of fighting energy! Right now, you do not even have fighting energy. Do you think 'power' is something that will just fall from the sky? It is like a pot of boiling water. The water needs to be boiled to be turned into steam but right now, you are just an empty kettle!”</p><br/><p>Having said that, Old Mark took out a parchment he kept near his arm and gave it to Rody. “This is a training method for fighting energy. It suits your current strength. Normally, you would need to wait until you become a Grade 5 warrior before you can learn this but you were damn lucky! Master Autumn gave you a bit of power and now you will end up progressing much faster than others!”</p><br/><p>Rody’s eyes turned bright. He was always someone who liked martial arts. He immediately picked up the parchment and noticed that the first line read, ‘Tulip’s Bloom’.</p><br/><p>“This is…” Rody blurted out.</p><br/><p>“This is the Tulip Family’s training method for obtaining fighting energy!” Old Mark smiled triumphantly. “I have been with the Tulip Family for over 200 years now. I used this method when I started training to gain fighting energy.”</p><br/><p>“Did you steal it?” Rody stared at him.</p><br/><p>“Do you want to learn it?” Old Mark stared back.</p><br/><p>Rody thought to himself as he kept the parchment.</p><br/><p>Since I am fighting for the Tulip Family, I guess that it is not wrong to learn how to use fighting energy from them? Either way, the Tulip Family’s current generation, that bastard Seth, is definitely not willing to learn it. With his current strength, even if he wants to, it is unlikely that he will be able to. Grade 5 warrior? That playboy will never reach Grade 5 in this life!</p><br/><p>Rody carefully put away the parchment and suddenly asked, “Why do you not do what Master Autumn did, directly give me a bit of power? Wouldn’t I become much stronger?”</p><br/><p>Old Mark immediately became so furious that he felt like kicking Rody. He shouted, “Do you think that ‘power’ is something that is sold on the streets?! Let me tell you, that little bit of power Master Autumn gave you is something only a highly trained master can acquire after training for several years! I really do not know what was wrong with Master Autumn! To think that he just gave you his hard-earned power without any condition!”</p><br/><p>Rody immediately shut his mouth. He knew that there was a difference between the old monster in front of him and the skeleton, Andy. At most, Andy would only curse when he was angry plus he would not be able to cause him any physical harm. However, the same could not be said for this old monster. If Old Mark got annoyed, he would be able to harm Rody.</p><br/><p>Old Mark gradually calmed down. He thought for a moment and took out a small transparent crystal that was about a third of the size of an egg. This time, his face was unusually serious.</p><br/><p>“Take this with you and use it if you encounter a critical situation, I mean fatal situation. You hold this in your palm and exert your strength on this crystal. Once you do so, the crystal will be crushed. For a 2-hour period, your stamina will increase exponentially and you will also have greater strength! Naturally, your ‘power’ will not improve. It just allows you to have unlimited stamina. For example, although the Half Moon Slash is useful, based on your own strength you can only use it once. However, once you break the crystal, you will be able to use the same tactic without worrying about strength running out for a 2-hour period!”</p><br/><p>“So good!” Rody was surprised.</p><br/><p>Unlimited Half Moon Slash! What kind of power is that? Ah!</p><br/><p>When Rody used the Half Moon Slash previously, he was able to defeat the Grade 4 swordsman, Randt and the Great Moon Kingdom’s Rondo. If he could within the 2-hour period, use that tactic as many times as he wanted, then it would mean that his strength had multiplied many folds!</p><br/><p>Rody felt his heart beat very fast. He was in a daze and was unable to say anything.</p><br/><p>Old Mark sighed and said, “You must remember, you only have two hours! This has side effects! After two hours, you will be finished! You will feel like you have exhausted your whole body and you will not be able to even lift a finger. This will last for a few days. In other words, this is something that will make you overuse your energy! It can only be used in critical situations and the problems must be solved within two hours! Otherwise, you will be dead!”</p><br/><p>Old Mark then looked dejected and said, “This is something that Dandong personally made. There were only three of it. When I was in the war, to protect the Duke, I had to use one piece. Now, there are only two left. I cannot give you both so you have to make good use of this one!”</p><br/><p>Rody was unable to calm down even after he was brought out of the residence by Old Mark. His heart was filled with awe, surprise, curiosity, and excitement.</p><br/><p>This thing that Dandong left behind is too amazing! What warrior would not want his strength to increase a lot in a short while? Even if it is only temporary, it is still good!</p><br/><p>With that in mind, Rody gave Old Mark a salute and earnestly said, “I know that this is very valuable and I will use it properly... Also… thank you, Mister Mark!”</p><br/><p>Old Mark was in a good mood. He waved his hands and was about to say something like, “I am an old man.” However, Rody interrupted and his statement almost made Old Mark explode.</p><br/><p>“Mister Mark, you have worked for the Tulip Family for 200 years and must have saved a lot of money! Did you personally buy this residence? I guess no one in the family actually knows about this! In the Imperial Capital, this kind of residence is not cheap... Aargh!”</p><br/><p>Old Mark was furious. When Rody was walking out the door, Old Mark took advantage of the timing to kick him in the ass.</p><br/>\n</div>"}