{"title": "Chapter 72: Bloodstained Tulip", "id": 72, "volume": 1, "url": "http://boxnovel.org/masked-knight-chapter-72-bloodstained-tulip", "volume_title": "Volume 1", "body": "<h1>Chapter 72: Bloodstained Tulip</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 72: Bloodstained Tulip</p><br/><p>Translator: Zenobys Editor:</p><br/><p>The siege warfare became more intense at midday. After the fierce battle in the morning, several thousand corpses from both sides were strewn all over and in the vicinity of the fortress walls. The walls of Watt Fortress were dyed red with blood and gave off a pungent smell.</p><br/><p>Reuenthal did not order a retreat even after the fierce battle in the morning. Instead, he kept ordering his soldiers to charge into Watt Fortress in batches. Even though a lot of his men had perished atop the walls, he did not feel a tinge of regret. It was because he knew that he had to capture Watt Fortress to fortify his position in the Northwest. He had to capture Watt Fortress before he could consider the possibility of having complete control of the Northwest.</p><br/><p>As long as he could occupy the Northwest for a long period of time, he would be able to make use of the mines and harvests from the fertile soil to steadily advance the Great Moon Kingdom! His cavalries would be able to wear armor. He would also be able to provide his infantrymen with the best equipment and his soldiers with sufficient supply of food.</p><br/><p>These were all things that the Great Moon Kingdom were very short of.</p><br/><p>With these materials, they would be able to build a foundation to crush the Empire. As long as they had 2 or 3 years for cultivation, the Great Moon Kingdom would gain enough military strength to fight a full-scale war with the Radiant Empire and compete for supremacy of the continent!</p><br/><p>That was why Reuenthal made up his mind to capture Watt Fortress even if he had to sacrifice half of his soldiers.</p><br/><p>So what if we lose half of our soldiers?</p><br/><p>The grasslands were full of valiant warriors. Reuenthal only needed to give the order and all the young men would immediately get on their horses and form a brave cavalry.</p><br/><p>Due to this, Reuenthal decided that he had to obtain Watt Fortress no matter how large his sacrifice. He needed the Watt Fortress and the other military positions to establish a strong defense system in the Northwest. He had to do so to make sure that the Northwest would remain in the hands of the Great Moon Kingdom!</p><br/><p>The Empire’s soldiers on the walls were already exhausted. They were injured and all of them had blood on their faces. Reuben also no longer had any more reserves. He had already on two occasions, mobilized soldiers from the other three gates up to the walls. He did not dare to do so again because Reuenthal’s military strength was too strong. It would be very dire if any one of those gates left empty, was attacked by the cunning Reuenthal.</p><br/><p>In one morning, the archers had exhausted all of their arrows. As more and more enemies successfully climbed up the scaling ladders and clambered atop the walls, the archers no longer have space to shoot their arrows, so they pulled out their swords for close combat with their enemies. That morning, up on those narrow walls Reuben had already lost more than 20,000 of his soldiers!</p><br/><p>Many of the Empire garrison soldiers had fully utilized their swords. It was not known if the blood that coated the swords belonged to their enemies or themselves. The foreign barbarians did not seem to be afraid of death and continued to charge forward. Their swords were like tools used for harvesting human lives. Every time they swung their swords, they would collect a slice of bloody flesh. Above the walls, the people were tightly squeezed together like ants. Their screams and roars filled the whole earth.</p><br/><p>Reuben also personally participated in the battle. He did not remember the number of soldiers he had killed. He met an exceptionally sturdy foreign warrior and managed to pierce the warrior’s chest. However, before the warrior died, he slashed at Reuben and almost severed his arm. The wound on Reuben’s right arm was so deep that even his bone was visible. However, he kept fighting and did not have time to dress his wound.</p><br/><p>Reuben started to feel afraid. He did not fear death but he was afraid that they would finally be unable to defend Watt Fortress. The sound of killing could still be heard above the walls. The morale of the Imperial Army had dropped. They looked at the group of fierce and fearless enemies who continued to rush up the walls. They all looked like savages and seemed to be endless.</p><br/><p>Are they really not afraid to die?</p><br/><p>An extreme sense of grief and heroism entered his heart and made him feel restless. He felt a sharp pain in his shoulder as a sword cut through his broken armor. Reuben subconsciously swung his sword with his left hand and cut the enemy into two. Suddenly, he felt weak and he almost fell to the floor.</p><br/><p>A few loyal bodyguards rushed forward and engaged the enemy while two more soldiers desperately held Reuben’s body and pulled him out.</p><br/><p>“It’s the end. We cannot defend the walls any longer!” Reuben was about to give an order for his soldiers to retreat from the walls and to fight on the streets. Suddenly, one of his soldiers trembled in excitement and shouted, “Your Excellency, Your Excellency! Listen… that… that is…!”</p><br/><p>The loud and clear sound of a horn could be heard from a distance. The sound of the horn was long and sounded different from the sound that Reuben was used to hearing.</p><br/><p>A few cavalrymen then came into view on the slopes behind the Great Moon Kingdom’s battle formation. Although they were too far away and their attire as well as equipment were hardly discernible, the cavalryman leading them held a huge flame-like banner.</p><br/><p>Behind the man with the banner were rows of cavalrymen. They were like a black mass which seemed to grow bigger and bigger.</p><br/><p>The military horn sounded once again but this time the sound was short and sharp. It sounded six times in succession.</p><br/><p>Although they were far away, Reuben could still hear the neighing of their horses.</p><br/><p>It was the Central Cavalry’s peculiar ‘order to charge’ signal. When the horn sounded six times, everyone in the cavalry had to fall into attack formation. Those who delayed would be summarily executed.</p><br/><p>Reuben’s eyes immediately gleamed.</p><br/><p>“Your Excellency, it is the ‘Lightning God’s Whip’! It is the ‘Lightning God’s Whip’!” The two soldiers with him were veteran soldiers. They could identify the sound and knew who they were as soon as they heard the horn.</p><br/><p>“Reinforcements are here! The Empire’s reinforcements are here!”</p><br/><p>Although nobody on the walls spoke, tens of thousands of the Imperial soldiers all had the same thought.</p><br/><p>Suddenly, a loud and clear voice resounded through the area.</p><br/><p>“Wolves Fang!”</p><br/><p>“Kill!” Tens of thousands of voices cried out at the same time.</p><br/><p>At the same time, a storm started to gather in the sky.</p><br/><p>A huge black mass of cavalrymen thronged down the slopes like a dark cloud being blown by the gathering storm. The thunderous but dull sound of hooves trampling the ground had a suffocating effect like a huge pressure bearing on one’s heart.</p><br/><p>Led by the cavalryman holding the banner, more and more cavalrymen appeared, like a big swarm of ants on the slope.</p><br/><p>The midday sun shone on the flame-like banner and revealed a brilliant tulip in flames.</p><br/><p>“That… that’s the Tulip Family’s war banner!” Reuben was stunned and muttered as he could not believe his eyes. The muscles around his eyes also trembled for a moment. He then had a peculiar expression.</p><br/><p>“It’s the Tulip Family’s war banner! The Tulip Family's war banner!” The soldiers of the Empire cried out in surprise. Their cry of surprise spread throughout the army.</p><br/>\n</div>"}