{"title": "Chapter 78: Knights of Roland", "id": 78, "volume": 1, "url": "http://boxnovel.org/masked-knight-chapter-78-knights-of-roland", "volume_title": "Volume 1", "body": "<h1>Chapter 78: Knights of Roland</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 78: Knights of Roland</p><br/><p>Translator: Zenobys Editor:</p><br/><p>Rody’s legs felt numb like they were being pricked by countless needles.</p><br/><p>After running for nearly an hour, the horse finally collapsed. It foamed at the mouth and could no longer stand. Rody was forced to continue on foot.</p><br/><p>His sweat and tears mixed. He was desperate. A little while ago, he heard the screams of his dying men behind him and felt agitated. He almost turned around to join the fight so that he could die together with his loyal soldiers.</p><br/><p>However, Andy constantly reminded Rody about his soldiers’ resolution and how his actions of going back there would only court death. If Rody died, everything would be over. If the Duke of the Tulip Family was dead, there would be no Tulip Family banner and the Northwest Legion would immediately fall apart.</p><br/><p>If only I wasn’t the Duke of the Tulip Family but an ordinary warrior, I could just go back to my comrades and die with them...</p><br/><p>So, he kept on moving until it was the middle of the night. Finally, he realized that the enemy cavalry stopped pursuing. The enemy probably believed that they had gotten rid of most of the soldiers after killing the bodyguards. Even though a majority of the Empire’s soldiers had eluded the enemy cavalry due to the dispersion of forces, they could only retreat helplessly.</p><br/><p>Rody could no longer continue so, he looked for a place to sit down and rest. He was out of breath as if a boulder was pressing against his body.</p><br/><p>In Rody’s expedition, among his first orders was the execution of the 10 villagers who had collaborated with the enemy. After that, it was the battle at Watt Fortress where he helped repel Reuenthal’s forces. Unfortunately, his joy was short-lived. He no longer felt joyful when he learned about the corrupt practices of the Northwest Legion. In the last few days, he had raced all the way to the Great Moon Kingdom and met the villagers there. Although he had ordered his men not to kill civilians, many still died. They were killed by the ‘Lightning God’s Whip’ when they revolted in retaliation to their homes being burned.</p><br/><p>No matter how powerful he was at that moment, Rody was still a young man. He might have been resolute but he was not ruthless. Although his journey had been progressing smoothly from the outset, he was not happy about the burning and killing.</p><br/><p>Lying on the soft grass, Rody thought of many things.</p><br/><p>Was I wrong? Is war always a matter of ‘I live, you die’? Being compassionate will only make the enemy happy!</p><br/><p>When Reuenthal invaded, he killed everyone regardless of whether they were civilians or soldiers. As a result, the entire Northwest region fell into shock and immediately ran away at the sight of the invading force. Reuenthal barely encountered any resistance. In hindsight, Rody was too weak.</p><br/><p>When Rody thought about his loyal subordinates who were willing to sacrifice their lives just to cover his escape, he could only feel remorse.</p><br/><p>The Great Moon Kingdom's cavalry had more than 20,000 soldiers. However, those cavalrymen were all initially civilians. Who were soldiers? Who were civilians? That was something the Great Moon Kingdom did not need to differentiate. The cavalrymen were herders before the war but whenever the Great Moon Kingdom gave an order, all of them could become soldiers instantly.</p><br/><p>He felt truly wretched due to his own indecisiveness and the fact that he was clinging on to his principles.</p><br/><p>The enemy could kill my citizens. Why couldn’t I kill the enemy's citizens?</p><br/><p>When Rody thought of it, his blood started to boil. He quickly wiped away the tears that started to form in his eyes. He felt like screaming.</p><br/><p>From the start of the expedition until then, he had witnessed the tragic deaths of many of his loyal subordinates. It changed Rody. The originally resolute, slightly gloomy and ignorant juvenile was gone forever.</p><br/><p>After resting for a while, Rody calmed down. He knew that if he continued running aimlessly, it would be difficult to get out of the grasslands. He decided to head for the right direction and find a small tribe. He would then steal or snatch a horse from the tribe.</p><br/><p>At dawn, Rody finally came across two herders who were grazing their cattle and sheep in the grasslands. One was male and the other was female. The two herders in the distance were wearing fur-lined jackets and hats. They used their long whips and special calls to move the cattle. Two wolf dogs barked continuously to help their owners corral the herd.</p><br/><p>Rody hid among the bushes and watched for a while. He gritted his teeth as he held his sword. He crouched a little bit to stay hidden and moved quickly towards the herders.</p><br/><p>Before the herders noticed Rody's presence, the two wolf dogs were already aware and they ran towards Rody, barking ferociously. The stronger looking dog could smell the blood on Rody’s body and bared its fangs at him. Rody kicked the dog in the head, splitting its head open. The other dog shrank back in fear. Without a glance, Rody raised his scimitar and cut it into two.</p><br/><p>The two herders were alarmed and they rushed over furiously. The male herder shouted loudly but Rody could not understand a word. Rody simply rushed towards him with his scimitar.</p><br/><p>The people of the grasslands were valiant. The male herder immediately put down his whip, took out a bow and arrow and shot at Rody. Rody smiled coldly and deflected the arrow with his scimitar. When he got nearer, Rody held the hilt of his scimitar with both hands and lifted it up before he slashed the male herder. Before the herder could draw his sword, there was a spurt of blood and his head flew into the sky. Rody's face felt warm as it was splashed with blood. However, he did not hesitate to pick up the bow and arrow on the ground as he rushed towards the female herder.</p><br/><p>The female herder shrieked repeatedly but she did not run away. Instead, she took out a sword and rushed towards Rody.</p><br/><p>Rody saw the grief on her face. At first, he turned soft but then he remembered the tragic deaths of his subordinates and thought to himself.</p><br/><p>If I do not kill her, she will nurture their young. The cattle will also be used to replenish the enemy’s strength and then they will be able to harm us.</p><br/><p>Rody did not hesitate any longer and shot an arrow. The arrow pierced through the female herder’s neck and she fell to the ground.</p><br/><p>He looked at the two corpses on the ground. Rody felt like a bloodthirsty and ruthless man. He had to scream a few times to eliminate the choked feeling in his chest. He then grabbed a horse and quickly set off in the direction of his base.</p><br/><p>Rody spent another day riding quickly and occasionally resting in between. In the evening, Rody finally reached a small hill at the edge of the grasslands. According to his survey before the start of the expedition, crossing the small hill would lead him out of the Great Moon Kingdom’s territory. He would then arrive at the Northwest plains. In less than two days, he would be able to reach Watt Fortress. Rody’s mood improved as he urged his horse to run forward.</p><br/><p>Just before the sun set, a rumble could be heard coming from the direction of the hill. Immediately after that, a group of cavalrymen appeared and stopped in front of Rody. Rody immediately stopped his horse too as his heart sank.</p><br/><p>The faint neighing of their horses, their dazzling armor and gleaming swords all came into view.</p><br/><p>That cavalry only had several hundred soldiers. From a distance, he could tell that the cavalry was unlike the Great Moon Kingdom’s. Most of the time, the Great Moon Kingdom’s cavalry did not wear metal armor but thin leather ones instead. Some of them even wore thick leather armor with longbows hanging across their backs.</p><br/><p>The cavalry in front of him wore heavy silver armor. Craftsmen and minerals were scarce in the grasslands which made it impossible for them to produce such good armor. Their equipment was comparable to the ones worn by the Empire's most elite cavalry, the ‘Lightning God's Whip'. Across their backs were not bows and arrows but strange cross-shaped swords. They each held a sharp spear, which flashed under the sunlight in one hand and a large shield with a cross-shaped symbol in the middle in the other hand.</p><br/><p>The cavalry did not immediately rush at him but slowly moved into a battle formation. They were very different from the shoddy cavalry of the grasslands. Hundreds of soldiers arranged themselves neatly to form a thick wall with their shields. Although there were openings in between the shields, the front and rear were closely packed together to form layers of defense. They had already begun to surround Rody from a distance</p><br/><p>.</p><br/><p>One of the cavalrymen slowly approached and shouted loudly, “Honorable cavalryman of the Radiant Empire, please dismount and hand over your weapons!” The words were spoken in the Empire’s common language. However, the accent was a bit odd.</p><br/><p>Rody took a deep breath. He was calm and unafraid. As he had been experiencing a lot of life and death situations for the past few days, he did not panic at all. Rody coldly shouted back, “Who are you guys?! Are you from the Great Moon Kingdom?”</p><br/><p>They were dumbfounded when they heard Rody’s question. The cavalry asked Rody to hand over his weapons again and slowly moved forward a few steps in a slightly intimidating manner.</p><br/><p>Rody sneered, “What if I am unwilling?”</p><br/><p>The other side no longer spoke. With one order, their formation slowly shifted. Their half-moon shaped formation started to push forward. Rody knew that they were preparing to charge. A cavalry cannot start a charge by immediately running fast. They have to start running slowly for a few steps for the horse to warm up before sprinting for maximum efficiency.</p><br/><p>The horse that Rody took from the herders was not a war horse. It sensed the cavalry's murderous aura and approaching crisis due to its natural instincts. It gave a troubled neigh as it slowly backed away.</p><br/><p>The cavalry on the other side suddenly shouted with their spears in the air. They then pointed their spears at Rody but kept their formation.</p><br/><p>Rody’s horse was startled and it suddenly started to neigh loudly...</p><br/>\n</div>"}