{"title": "Chapter 70: Before The War", "id": 70, "volume": 1, "url": "http://boxnovel.org/masked-knight-chapter-70-before-the-war", "volume_title": "Volume 1", "body": "<h1>Chapter 70: Before The War</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 70: Before The War</p><br/><p>Translator: Zenobys Editor:</p><br/><p>The Watt Fortress was quiet and calm when the first light of dawn broke. Looking at the scene, no one would expect that an episode of horrific killing occurred just the night before. Tens of thousands of people shed their blood and cried miserably there. Now, the reddish looking soil was the only reminder of the battle.</p><br/><p>The 'Thorny Flower' banner was still raised but the soldiers who stood on the wall were already tired and at a loss. The army of the Great Moon Kingdom had suddenly attacked the Watt Fortress at midnight and the battle lasted until dawn. After both sides lost thousands of lives, the Great Moon Kingdom finally retreated.</p><br/><p>The soldiers on the city wall had not slept at all throughout the night. They gazed frustratingly at the Great Moon Kingdom's camp. At their camp, the fur-coated foreign barbarians with long blades had already begun to gather. \"It looks like there will be another day of fierce battle…\" Some of the veteran soldiers sighed. They looked at the rising sun as they were unsure if it would be the last time they see it.</p><br/><p>The original solid and tall city wall was already in a terrible condition. The mixture of black smoke and red blood stains turned the color of the wall into a horrifying gray. The gate was also destroyed in the previous night's battle. There was now a hole in the gate. Although the soldiers were already using giant pieces of wood to reinforce the gate, the soldiers on top of the wall could see that the enemy had taken out a heavy looking ram. They could not help but feel agitated.</p><br/><p>The Northwest Legion's General Reuben stood above the gate. He also fought in the battle last night but he was not feeling exhausted. He had been suffering defeat for the past few days. As a result, he was feeling frustrated. As the Supreme Commander of the Northwest Legion, he had lost a substantial portion of the Empire's territory and many soldiers. In the end, he was besieged at Watt Fortress. Reuben knew that even if he managed to hold their position until reinforcements arrived, he would still lose his head. The first thing His Majesty the Emperor would do was to execute him, the defeated general.</p><br/><p>However, Reuben still struggled to hold on because he could not allow the Northwest Legion to be completely annihilated at the Watt Fortress. As a loyal soldier of the Empire, he would fight to the end. He could not allow the Empire’s last line of defense in the Northwest, the Watt Fortress to fall into the hands of the Great Moon Kingdom! He knew that behind him were the Northwest plains. If the Great Moon Kingdom was to capture the Watt Fortress, the entire Northwest plains would be subjected to the oppression of the Great Moon Kingdom!</p><br/><p>Morale had already reached rock bottom after their continuous defeats. There were less than 100,000 soldiers left from the original army of 200,000. Reuben was also certain that if he deducted the soldiers who were injured and could not fight, there would be less than 70,000 soldiers left. Reuben also had a sense of fear towards his enemy's supreme commander, Reuenthal. This terrifying opponent used strange tactics and was proficient in long-distance raids. Like a wolf, he was always able to find an opponent's weakness and persistently attacked it.</p><br/><p>Frankly speaking, Reuben knew that he was not an outstanding strategist. He was a diligent soldier. He was better at implementing rather than making decisions! During the years he had served under the late Duke of the Tulip Family, Reuben was able to accomplish any order or task given by the Duke.</p><br/><p>He completely relied on the commands of the late Duke to fight courageously in those battles. The merits he earned then were accumulated until he ended up in his current position. Naturally, it was also because the Empire lacked talented military personnel after the Duke’s death. However, commanding a troop and devising strategies to win battles were not things Reuben was competent at. It was especially true when he had to fight against the fierce and cunning Reuenthal. In all the battles against him, Reuben was forced to retreat in a completely passive state!</p><br/><p>Reuben remembered the times when he served under the Duke. He sighed and touched his partially white beard. He actually did not like to be a supreme commander. He preferred to be a normal commanding officer serving under the duke. At that time, he did not need to think at all. He only needed to execute the Duke’s orders. Unlike then, he now needed to discuss with a bunch of commanding officers all day long, trying to figure out his opponent's next move.</p><br/><p>Shaking his head, Reuben forced himself to concentrate. In the distance, the Great Moon Kingdom had already gathered up their soldiers. It appeared that a fierce and bloody battle was about to start!</p><br/><p>“Hmph, let's see whose weapons are stronger!” Reuben ordered the soldiers who were resting on rotation to return to the wall and prepare to fight.</p><br/><p>Fortunately, like the traditional barbarians of the plains, Reuenthal also had his own weakness. He may have been good at field operations but he was not very good at siege battles.</p><br/><p>Earlier information stated that Reuenthal had launched a very quick surprise attack to capture Trier Fortress and Blackstone Fortress. With that in mind, Reuben was on high alert to defend against his attacks there.</p><br/><p>Sure enough, during the past few days the Great Moon Kingdom applied their usual tactics. Three nights ago the Great Moon Kingdom suddenly gathered thousands of soldiers and launched a surprise attack. They immediately laid siege to the place and caught General Reuben by surprise. His stupid mounted scouts were part of the reason why they were caught by surprise. Four hours before the siege, the scouts reported that the enemy was still at the Redwood garrison, a strategic location a few hundred li away. However before he knew it, the enemy was at his doorstep. If it was not because of the precautions that General Reuben took after experiencing a few defeats, the enemy would have succeeded.</p><br/><p>The past few days, the Great Moon Kingdom had always laid siege to them at night and only harassed them in the morning. It was obviously a method to wear out the mental strength of General Reuben’s soldiers and also to make them collapse from the exhaustion.</p><br/><p>The cavalries were extremely exhausted but the Northwest Legion were after all, still the Empire’s elites. They were unable to defeat Reuenthal on the plains as the foreign cavalries were very fast. However, it was a siege. No matter how powerful the cavalries were, they no longer had the advantage. Sieges were best encountered with infantries.</p><br/><p>Reuben ordered the archers to get ready. Then, his only hopes left were the archers. During the surprise attack on Redwood garrison, the Northwest soldiers had abandoned their catapults and other weapons when they retreated. They had also abandoned the catapult stones and fire crossbows. There was no way they could bring those weapons along with them during the chaos in the retreat.</p><br/><p>Luckily, General Reuben made what was probably the boldest decision of his life!</p><br/><p>When he knew that defeat was inevitable, Rueben reluctantly ordered his men to burn down all the military supplies at the Redwood garrison that they had gathered over many years. There were many sophisticated weapons such as flaming catapults and also a year's worth ration of food for 100,000 soldiers. All of it was completely burned. The burning continued for three days and three nights. In the end, Reuenthal had to order his soldiers to help put out the fire. That cost him the lives of a few hundred soldiers and in return he only managed to salvage a little bit of food.</p><br/><p>It was fortunate that Reuben made the decision. Otherwise, the Great Moon Kingdom would have laid siege to the rest of the Empire with their catapults.</p><br/><p>“Your Excellency, they have arrived!” One of the commanders cried out.</p><br/><p>Reuben raised his sword in high spirits and shouted, “Raise the flags!”</p><br/><p>Below the walls of the city, the Great Moon Kingdom had assembled. The cavalries were on both sides with the infantries neatly lined up in the middle.</p><br/><p>“Damn them!” Reuben cursed. “Infantries! Reuenthal’s men only know how to ride horses and cannot fight on foot! Hmph, do you think being able to use the phalanx formation means you are already an infantry army? Let me see how strong your infantries are!”</p><br/><p>The sun started to shine from the east. It shone on the wilderness as rows of scimitars reflected the dazzling and murderous sunlight!</p><br/>\n</div>"}