{"title": "Chapter 85: Wolves Attack", "id": 85, "volume": 1, "url": "http://boxnovel.org/masked-knight-chapter-85-wolves-attack", "volume_title": "Volume 1", "body": "<h1>Chapter 85: Wolves Attack</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 85: Wolves Attack</p><br/><p>Translator: Zenobys Editor:</p><br/><p>The horse gradually slowed down in the middle of the night. Muse’s entire body was sore and it felt like the duke was getting heavier with each passing moment. Although she called out to him, she did not get a reply.</p><br/><p>They had been running for a very long time and she finally realized that they were not being chased anymore. Muse then got off the horse and carefully lowered Rody from the horse. She could not properly carry Rody down because her body was really sore and she was not physically strong. Muse had qualms about igniting a light so, she examined his injury carefully under the moonlight.</p><br/><p>The bottom half of Rody’s body was not seriously injured but his upper half was covered in blood. She gritted her teeth and tore his shirt. She was shocked and terrified when she saw his injuries.</p><br/><p>Rody’s shoulder was badly injured and his bone was exposed. If Rody had not dodged as quickly as he did, his whole arm would have been severed. When she turned him around, she saw an astonishingly long cut on his back. The cut was about 6 inches long. The wound looked extremely serious but fortunately, it was not too deep and it did not reach his bones.</p><br/><p>She checked his breathing and noticed that it was becoming weaker. Muse panicked as she had relied on Rody for everything for so many days. They had just escaped but Rody was severely injured and unconscious. The vast grassland was pitch-dark and not a single shadow could be seen. From a distance, she could also hear the howling of a wolf. The sound frightened Muse.</p><br/><p>Taking a few deep breaths, Muse took out the medicine Rody stole the other day and the water flask. She then removed Rody’s clothes and carefully washed his wounds. After that, she applied the medicine. Although she was gentle, it was still very painful for Rody. Despite being unconscious, Rody was groaning in pain. His forehead was covered in cold sweat and his eyes were tightly shut.</p><br/><p>Muse’s hands trembled and she shed tears. She had never panicked this much before. With great difficulty, she applied the medicine all over Rody's body. After some thought, she also tore parts of her clothing to bandage Rody. The dressing was rushed and messy because she had never done it before. However, she managed to eventually bandage Rody’s entire body.</p><br/><p>After that, she gently wiped away Rody’s cold sweat as she looked at his pale, handsome face. Muse then felt something she never felt before. She could feel herself getting mad when she thought of the time Rody risked his life to protect her and shouted for her to quickly escape in the dark.</p><br/><p>Suddenly, she heard the sound of rustling grass. Muse was startled and she nervously looked around. What she saw made her break out in cold sweat. Under the moonlight, she could see several short figures on a slope in the distance. The figures were looking directly at them.</p><br/><p>The figures were wolves. Two wolves howled as they slowly approached Rody and Muse.</p><br/><p>Muse was so frightened that she immediately screamed. The wolves were startled by her scream and moved a few steps back. They lowered their heads and howled again.</p><br/><p>After that, the panicked Muse quickly carried Rody onto the horse and got on herself.</p><br/><p>The horse, which was raised by herders was also frightened by the howling and it quickly ran.</p><br/><p>Muse sat on the horse holding Rody with one hand. She turned her head around and saw the wolves chasing them. The wolves in the grasslands were extremely bloodthirsty. Although they saw their prey escaping, they could smell Rody’s blood and refused to give up.</p><br/><p>The horse, which Muse and Rody rode had been running for almost half the night. In addition, there were two of them on it so, the horse gradually slowed down. After a few hundred steps, Muse noticed that the wolves were slowly getting closer. She kicked the horse but it could not run any faster.</p><br/><p>She saw a forest in front of her and immediately rushed in. Without waiting for the horse to stop, she slid down the horse together with Rody. Shortly after, she saw a short tree. She held onto a low branch with one hand and tried to pull Rody up with the other.</p><br/><p>Unfortunately, she did not have enough strength. Normally, it would not be a problem for her if she was alone. However, this time she had to carry another person with her so, she could not climb up the tree.</p><br/><p>The wolves did not immediately attack but they surrounded Rody, Muse and the horse in a circle. Muse was extremely afraid. She would be able to escape if she abandoned Rody and climbed up the tree on her own. In spite of that, her heart refused to let her abandon Rody. Muse turned pale. She took a dagger out of her boots and continued to scream. She continued to wave her dagger to scare off the wolves.</p><br/><p>She noticed that the wolves were beginning to become impatient. The wolves slowly approached them. Muse slowly dragged Rody and backed up a little as she held the dagger tightly. Suddenly, she remembered that she still had a ‘Fireball’ magic crystal. She quickly took out the small crystal and threw it on the ground. The crystal broke and flames rose from the ground. The wolves were frightened and immediately took a few steps back. However, they still refused to leave and continued to look at Rody and Muse.</p><br/><p>Muse knew that the flame would not last very long. She dragged Rody to the side of the tree trunk and carried Rody up. In desperate situations, people just have more strength than they normally would for some reason. Although Muse was weak, she was desperate and somehow managed to push Rody onto one of the branches. After that, she climbed up the tree herself and pulled Rody a bit higher up.</p><br/><p>Soon, the flames got smaller and the wolves started to gather around them again. When the flames were finally extinguished, the wolves swarmed and attacked the horse. The horse neighed pitifully until its throat was finally bitten. Muse trembled from fear and could only hear the howling of the wolves and the neighing of the horse. The air that night chilled her to the bone.</p><br/><p>After they tore apart the horse, the wolves still refused to leave. They looked at Muse up on the tree and continued to howl. The more aggressive wolves constantly threw themselves at the tree trunk but fortunately, the tree trunk was very sturdy. It only shook each time upon impact.</p><br/><p>Muse was so frightened that she started crying. She had never felt so terrified before. She held onto Rody tightly as her tears continued to flow. The dagger she held earlier had already dropped to the ground.</p><br/><p>The wolves could smell Rody’s blood and they did not leave even though they had already eaten the horse. Instead, the number of wolves increased and they walked around the tree in circles.</p><br/><p>Muse was tense as she stared at the wolves. The two of them waited on the tree until the sky turned bright. The wolves walked around impatiently. Some even tried to jump up onto the tree branch but they could not reach.</p><br/><p>Suddenly, there was a sharp sound cutting through the wind. A sharp arrow shot out from the woods and pierced the neck of a wolf. The powerful force of the arrow nailed the wolf to the ground. After that, arrows continued to fly out. The archer was extremely accurate. The arrows continued to hit the wolves and about four or five wolves cried out before dying. The remaining wolves finally became timid. They whimpered before running away.</p><br/><p>Muse was surprised and after a while, a brawny man on a horse appeared. The man wore a thick fur jacket and leather cap. He also held a long bow in his hands. The man dismounted and looked down. He then picked up two of the wolves and put them on his horse. After that, he looked up at Muse on the tree and shouted, “The wolves have already run away. You two can come down now!” The voice resounded loudly in the language of the grasslands.</p><br/><p>.</p><br/><p>Muse did not reply because she was still frightened. The man thought that Muse could not understand. He paused for a moment and repeated himself in the common language of the Radiant Empire. Then, he saw the unconscious Rody next to Muse and frowned. “Is your companion injured?” Next, he walked up to the trunk and extended both of his hands, signaling for Muse to let Rody down first.</p><br/><p>Finally, Muse was relieved and she slowly lowered Rody from the tree before climbing down herself. The brawny man lowered Rody gently to the ground and looked at Muse. He saw her beautiful face and was stunned for a moment. He then asked, “Who are you? How did you end up here at night?”</p><br/><p>Muse stammered and was unable to find a reply. The brawny man waved his hand and said, “It is fine if you do not want to tell but recently, this place has been infested with wolves. Many people have already moved away from this place. Fortunately, I came out here to get a few wolf skins for money. Otherwise, the two of you would not have survived.”</p><br/><p>Muse frowned and asked in the language of the Radiant Empire, “Won’t the wolves leave if we hide on the tree long enough?”</p><br/><p>The man smiled and replied, “Looks like you are from the Radiant Empire.” Muse blushed. Pretending not to notice, he continued, “The wolves of the grasslands are cunning and greedy. They will not give up once they see a prey in front of them. Even if you hide on the tree for a few days, they will not leave. Most will also pretend to leave and actually hide as they wait for you to come down the tree.”</p><br/><p>Muse thought for a moment and sighed before saying, “Thank you very much for your help.” She then looked at Rody and hesitated to ask for help again.</p><br/><p>The brawny man saw her expression and could already guess what she was thinking. He then smiled and said, “Your friend's injury is not light. My tent is not far from here. Maybe you are better off following me back. I also have my own herbal medicine.”</p><br/><p>The brawny man then looked at the horse’s remains on the ground and laughed. “But you do not seem to have a horse anymore. My horse cannot carry three people.” After that, he went up to his horse and threw the wolf carcasses back onto the ground. They were his prey after an entire night’s hunt but he threw them away without hesitating in a real heroic manner.</p><br/><p>He then let Muse and Rody get on the horse while he walked on foot. The three of them left together.</p><br/>\n</div>"}