{"title": "Chapter 96: Stench of Blood in the Setting Sun", "id": 96, "volume": 1, "url": "http://boxnovel.org/masked-knight-chapter-96-stench-of-blood-in-the-setting-sun", "volume_title": "Volume 1", "body": "<h1>Chapter 96: Stench of Blood in the Setting Sun</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 96: Stench of Blood in the Setting Sun</p><br/><p>Translator: Editor:</p><br/><p>“Kill!” The assistant governor shouted as he hid behind his bodyguards.</p><br/><p>After that, the soldiers all rushed to clash with Rody’s group. Rody cut down a soldier as he kicked another one away. He shouted, “Rush out!”</p><br/><p>The public square ended up in chaos. The ordinary citizens saw a fight had started. They were afraid and were running all over. However, some of them were immediately killed by the subordinates of the assistant governor. Some of the ordinary citizens were from a wealthy background. They brought along their servants who also fought with the soldiers.</p><br/><p>Some of the citizens tried to run out of the public square but their paths were blocked by the soldiers. As they were unarmed, they were immediately killed by the soldiers.</p><br/><p>Rody and the eight Wolf Fang soldiers were already covered in blood. They tenaciously protected Jojo as they tried to rush out of the public square. However, their opponents prevented them from escaping.</p><br/><p>Rody, along with his soldiers had already been surrounded by dozens of enemy soldiers and could not advance through the layers of encirclement. He then heard Jojo's scream. One of Rody’s Wolf Fang soldiers had been killed by the enemy. While Rody was distracted, one of the soldiers managed to slash him.</p><br/><p>Rody moved as he fought. He continued to swing his sword and prevented others from getting close to him. From time to time, he heard a tragic scream and his heart was filled with anger. He glared and rushed angrily towards the assistant governor.</p><br/><p>Suddenly, he heard the neighing of a horse as his opponent charged at him from one side. Rody could not block it in time and was knocked several meters away. As he laid down on the ground, he darted his scimitar at the cavalryman. The cavalryman gave cried in agony and fell down from the horse. Rody then jumped on the horse, bent down and pulled out his scimitar from the soldier’s corpse.</p><br/><p>From the corner of his eyes, Rody saw his subordinates struggling by Jojo’s side. Out of eight of them, only four remained. Those who remained were covered in blood. One of them had injured his legs. That moment, a soldier tried to slash him. Rody’s subordinate could not dodge in time and injured his shoulder. That Wolf Fang soldier then gathered his courage and roared. He rushed forward and was stabbed several times but he still managed to sever the head of an opponent.</p><br/><p>Rody whipped the horse and charged forward. He knocked down all the soldiers who tried to block him. Rody did not care about several other cavalrymen who were rushing towards him from both sides. He rushed to Jojo’s side and helped her onto the horse as he got off. After that, he shouted, “Protect the horse! We will rush out!”</p><br/><p>Fortunately, the other side did not have many cavalrymen. Otherwise, they would not have been able to defend themselves from a cavalry charge. The public square was filled with the shouts and cries of the people and horses. Rody and his subordinates formed a circular formation. They continued to resist. Although their opponents had more people, their opponents were not elites and could not compete with the Wolf Fang soldiers. On top of that, Rody had abnormal strength. Although Rody’s group had only a few people, their opponents were cautious in going up to fight them..</p><br/><p>The public square was filled with the stench of blood. Most of the citizens were already dead. The other rebel soldiers mostly moved towards Rody’s group. After a little more of the fierce fighting, another Wolf Fang soldier met his demise.</p><br/><p>Rody was extremely frustrated. His subordinates had followed him to fight fiercely in the Northwest battle and even raided the grasslands. They were all brave and strong warriors. However, they did not die in the Northwest battlefield instead, they were killed by rebel soldiers.</p><br/><p>Rody’s body suddenly emitted a faint golden fighting energy. He swung his shiny scimitar and a blade of light appeared. A sharp wind materialized and cut the rebel soldiers who were blocking the way into two.</p><br/><p>Rody did not stop swinging his scimitar. A dozen soldiers felt the dazzling light of the scimitar before they felt their bodies being torn apart.</p><br/><p>Rody had just used two Half Moon Slashes. His fighting energy was exhausted, and his face was pale. He saw his opponents retreat in confusion and fear, but he also felt weak. The scimitar in his hands felt extremely heavy and he almost could not lift it up. The assistant governor became furious and growled., “Kill him! Quickly, kill him!”</p><br/><p>Suddenly, there was an uproar coming from the north of the public square. The sound of trampling hooves were heard. As the sound came closer, a loud voice could be heard. “Your Excellency the Duke! Your Excellency the Duke!” The voice belonged to Commander Gordon.</p><br/><p>Rody shouted back, “Commander Gordon, the West Hill City’s Assistant Governor has started a rebellion! Kill the rebels immediately!”</p><br/><p>After that, there was the sound of a horn and the rebel soldiers started to withdraw. The sound of horses could be heard as the golden armored cavalry of the Imperial Guards rushed in.</p><br/><p>The rebel soldiers suddenly saw a huge cavalry coming towards them. They immediately cried out, threw away their helmets and armor before fleeing in all directions.</p><br/><p>The assistant governor had turned pale. He shouted in despair, “Don’t run! Fight back! Kill them all!”</p><br/><p>The assistant governor might have gone mad but the others had not. The moment they saw that that they were in big trouble, they quickly scattered. The Imperial Guards also spread out and mopped up the rebels at the public square. The cries of misery continued as the rebel soldiers were all slaughtered like chickens by Gordon's cavalry.</p><br/><p>Gordon took a group of soldiers and rushed towards Rody to protect him.</p><br/><p>Rody was somber and hatefully said, “Seize that assistant governor! Give the order for the Wolf Fang to guard the city gates and make sure no one leaves!”</p><br/><p>Gordon saw Rody covered in blood and quickly stepped forward to support him. He then loudly said, “Your Excellency the Duke, do not worry! Before I entered the city, Commander Sieg had already ordered the Wolf Fang soldiers to guard the gates! These rebels will not be able to escape!”</p><br/><p>Rody sighed and gritted his teeth. “This scoundrel is extremely audacious! Capture him! I want to tear him apart!”</p><br/><p>Jojo was pale and looked at Gordon, “If you had not come, we would have died. Why did you come into the city?”</p><br/><p>Gordon earnestly replied, “Actually, when Miss Jojo and the duke entered the city, I dispatched a few people to secretly tail you. Ever since the duke had that mishap in the Northwest region, we have all been extra careful. We could not allow the duke to encounter any more trouble. The soldiers had reported that you all ran into trouble at the public square and you were all outnumbered. I took the soldiers into the city but I did not expect it to be like this. Why did the assistant governor suddenly rebel?”</p><br/><p>Rody waved his hands and did not say anything. Everybody guarded him as he walked towards the assistant governor’s mansion.</p><br/><p>That night, thousands of the Wolf Fang soldiers surrounded the city gates while the remainder and 2,000 Imperial Guards went inside the city to track down the rebels. A few hundred of Gordon's men had earlier taken control of the local government and protected Rody as well as Jojo. The West Hill City was not quiet that night. The city was brightly lit as the people were thrown into confusion. When dawn came, most of the rebels were captured and gathered at the open area in front of the government mansion.</p><br/><p>Those soldiers were not the local defenders of the city. They were the assistant governor’s hired bodyguards. After the fierce fighting that night, some of them were immediately killed. Those who were arrested were injured. They were tied up tightly and forced to kneel down.</p><br/><p>The assistant governor had taken a few of his subordinates and tried to escape, but they were all blocked by the Wolf Fang soldiers at the city gates . All of his subordinates were then killed during the fight, and he was captured.</p><br/><p>Rody personally executed the assistant governor and ordered his soldiers to expose the corpse in public. As for the other rebels who were also arrested, Rody thought about them for a moment. However, when he recalled the slaughter of the citizens that night, he did not hesitate. He ordered for all those rebels to be executed.</p><br/><p>After the assistant governor’s subordinates were also executed, the entire West Hill City was stirred up. Many of its citizens flocked to the parade of corpses. Even though they were dead, some of the citizens still gathered to throw rotten eggs and tomatoes at their bodies. Obviously, the assistant governor had caused a lot of grievances.</p><br/><p>Rody had also ordered some of his soldiers to interrogate a few of the captured prisoners. He was shocked and frightened at the things that were revealed.</p><br/><p>The embezzlement of money or the corruption was only the tip of the iceberg. The first problem was the assistant governor’s younger brother, Trey, who died at the public square. Trey alone was responsible for deaths of many. Trey had relied on his brother’s influence to go wild in the West Hill City. In two years, he forced the end of several rich merchant families and used all of their money for his own personal gains. The elder brother was even more problematic. His own bodyguards were all outlaws. On the surface, he was the Assistant Governor of the Empire but he relied on his subordinates and did many questionable businesses. In the last few years, there were robberies at the borders of the Westwood province which exterminated the entire families of several wealthy merchants. These were all part of the assistant governor’s actions. Millions of gold coins were also found in the assistant governor’s home.</p><br/><p>Half of the officials in the Westwood province had collaborated with the assistant governor. Many were in cahoots with the assistant governor, and there were also some who were afraid of the his influence. He had relied on the support of such officials to become the governor of the capital city.</p><br/><p>Seeing the report of the long list of names, Rody sneered and smashed the table in anger. With a loud crash, the table frame broke.</p><br/><p>“Dispatch 2,000 soldiers to various places in the Westwood province! Investigate those who collaborated with him! Do not allow a single one of those involved to escape! Arrest them all for me to personally question!” Rody said ruthlessly, before he frowned at Gordon and asked, “Westwood province is my territory. Do I need permission from the Imperial Capital if I want to punish them?”</p><br/><p>Gordon lightly replied, “By right, you will need permission from the Imperial Capital because they are all officials of the Empire. However, this time Miss Jojo was almost killed by them. I believe that His Majesty would also not defend them! My advice is that we arrest them first and wait for the orders from His Majesty.”</p><br/><p>Rody sighed and said, “I cannot believe that the Westwood province is like this. To think that the dignified Tulip Family’s territory is actually so foul!”</p><br/><p>Gordon also sighed and replied, “The late duke had already passed away for a few years. Miss Nicole was young and you… you… usually did not like to be involved in such matters. So…”</p><br/><p>Rody blushed and lightly said, “The past is the past. Now that I know, I cannot ignore it anymore!” His face sank and he continued, “I do not care about the official and political matters but I know that the law must be fair! I will use blood to scare these people, and if they are found guilty after investigation, they will be sent to the guillotine!”</p><br/><p>Gordon was frightened by Rody’s words and could not help but say, “Your Excellency the Duke… Although you are very influential, if you disposed of all of them… the government will be in disorder. We do not know who else in the Imperial Capital is also collaborating with them.”</p><br/><p>Seeing that the duke did not speak, Gordon gritted his teeth and said in a low voice, “There are some things I need to say! The Westwood province may be Tulip Family’s territory but in the past few years, the Tulip Family was starting to fall. As a result, control of the territory was also not as strict as before. Most of the officials in the Westwood province were placed by the people from the Imperial Capital. The Westwood province is rich, fertile and flourishing. Obviously, everyone would be envious! Although the annual income is still handed over to the Tulip Family, a lot of money is still secretly embezzled! The Westwood province is a precious gold mine that is constantly being fought over by influential and powerful people. Your Excellency the Duke is still young, and you have not established yourself in the Imperial Capital. If you offend so many people within such a short time… I think it would be better for you to slow down. Some people should be executed but if possible some people… should be released! When Your Excellency has established yourself, it will still not be too late to dispose of them one by one!”</p><br/><p>Rody laughed coldly and said, “If I do not care about my own territory being messed up so badly by others, then there is no need to talk about the Tulip Family’s stupid glory! Say no more! The longer these people remain in the Westwood province, the more harm they will cause! Did you not see how many innocent people died in the public square that day? Hmph, the West Hill City only has one pair of such brothers! How many more people like these brothers are there in other places?”</p><br/><p>As Gordon walked out, Rody sighed and sat down.</p><br/><p>“Andy, are you here?!” Ever since Rody was healed by the Black Veiled Saint, he was once again in contact with Andy. They had already met each other in Watt Fortress. However, Andy was, after all, a skeleton and could not move around in front of people. Most of the time, he stayed in the box.</p><br/><p>Andy’s voice resounded in his mind. “Boy, why do you have such a heavy murderous aura? You are not someone who is really of the Tulip Family. The things that happened in their territory has got nothing to do with you. Why are you so angry? I think Gordon’s advice was good.”</p><br/><p>Rody spoke indifferently. “The Tulip Family’s glory? This has nothing to do with the Tulip Family! If the Westwood province is like this, what about the rest of the Empire? Just an assistant governor dared to openly rebel because of greed. His subordinates had gathered so many desperate runaways. What about the rest of the Empire? What about the Northern and Southern regions?”</p><br/><p>“You are becoming more and more tough. You now have a murderous aura, and you are no longer soft-hearted at all!” Andy sighed.</p><br/><p>Rody’s expression showed a tinge of pain as he gave a wry smile and said, “Murder? Did you forget? Dandong’s notes advised to use heavy punishment in troubled times! Reeking of blood is not a good thing but during a critical moment, it is more useful than anything else! Killing people... I am no longer the soft-hearted Rody… hehe… Kill... for every piece of trash I kill, tens or even hundreds of innocent people will live! Kill one to save ten. Kill ten to save hundreds, thousands, tens of thousands. At the end of the day, I do not mind even if I am covered in blood! On the battlefield, if the enemy does not die, I will! This is the principle that I have long remembered!”</p><br/><p>Rody slowly stood up and went towards the window to look at the bright sun at the distance. He then said softly, “Not only the Tulip Family’s glory…but the whole of Radiant Empire is about to fall!”</p><br/>\n</div>"}