{"title": "Chapter 95: Rebellion", "id": 95, "volume": 1, "url": "http://boxnovel.org/masked-knight-chapter-95-rebellion", "volume_title": "Volume 1", "body": "<h1>Chapter 95: Rebellion</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 95: Rebellion</p><br/><p>Translator: Editor:</p><br/><p>Rody frowned. Initially, he just wanted to teach the other guy a lesson and forget about it. However, Trey had tried to humiliate Jojo’s sister. It meant death for him. Jojo’s sister was Her Highness, the Empress. To disgrace the Royal Family could only mean death.</p><br/><p>Trey laughed coldly and said, “Do not speak nonsense! Get them!”</p><br/><p>A dozen of Trey’s subordinates swarmed their opponents. The eight Wolf Fang soldiers moved up and stopped them. There was the sound of swords clashing followed by a few screams of agony as two of Trey’s subordinates dropped dead.</p><br/><p>Rody’s subordinates were all bloodthirsty warriors who had fought in the Northwest region. When they fought, they showed no mercy. They did not even blink when they killed. Although Trey had more subordinates, after losing two of his men, the others were afraid to step forward. Trey was furious. He was the tyrant of West Hill City and had never met anyone who dared to oppose him. He promised his subordinates a large reward, and they once again rushed forward.</p><br/><p>Rody squinted his eyes as he stood at Jojo’s side to protect her. He did not fight at all. However. there were two people who thought of taking advantage of the situation. They tried to attempt a sneak attack on him and Jojo. With a kick, Rody sent them flying.</p><br/><p>The screams continued as blood flew all over the place. Most of Trey’s subordinates were dead and only about three of them remained. On the other hand, Rody’s subordinates only received light injuries. The scimitars in their hands were stained with blood and they looked murderously at Trey.</p><br/><p>Trey was so frightened that he knelt down. One of the Wolf Fang soldier went up and dragged Trey up to Rody. Trey's whole body was weak as he laid on the ground, trembling.</p><br/><p>Suddenly, there was the sound of a whistle and a group of public security soldiers separated the crowd and rushed in.</p><br/><p>Trey was relieved and his face once again lit up. “Boy, this time, you are dead!” He then raised his head and shouted to the public security soldiers, “You fools! Quickly, come and save me!”</p><br/><p>The captain saw that Trey was captured and waved his hands to call his men. He held a sword in his hand and moved towards Rody.</p><br/><p>Rody was stern and he shouted, “Get lost!” Rody had commanded thousands of soldiers before and his voice was imposing. The captain was surprised and stopped. He was afraid to move forward.</p><br/><p>“You are all public security! How can you indiscriminately arrest people?” Rody’s face was serious.</p><br/><p>The captain’s face turned red as he shouted, “Nonsense! You carried weapons on the street and murdered people! That is a capital offense!”</p><br/><p>Jojo laughed happily. “His subordinates carried weapons too! Isn’t that a capital offense as well? The laws of the Empire state that other than soldiers and warriors, others are not allowed to carry weapons! If you want to talk about murder, they were the ones who attacked first. Why aren’t you catching them?”</p><br/><p>The captain’s face sank as he replied, “Nonsense! You dare offend Master Trey! You are asking for death! Arrest them!” The public security soldiers all pulled out their swords and surrounded them.</p><br/><p>They were not like Trey’s unruly subordinates. They were public security soldiers and were well trained. With overwhelming numbers, they surrounded Rody and his group of people.</p><br/><p>Rody frowned. “Is this how the West Hill City’s public security does things? Is this how your garrison commander controls you?” Jojo felt odd and looked at Rody.</p><br/><p>The captain ferociously replied, “From the way you talk, you must be a country bumpkin! The West Hill City is the capital of the Westwood province! The whole of Westwood does not have any garrison. How could there be a garrison commander? We, the public security soldiers, obey the instructions of the assistant governor! Mister Trey is the younger brother of the assistant governor. If you want to live, put down your weapons obediently and release Mister Trey!”</p><br/><p>Rody snorted. He looked at Trey, who was at his feet and lightly asked, “You are the younger brother of the assistant governor?”</p><br/><p>Trey thought that Rody was afraid and loudly shouted, “That’s right! Quickly release me! Otherwise, don’t think you can leave West Hill City alive!” He tried to get up only to get kicked down by a Wolf Fang soldier.</p><br/><p>Rody coldly replied, “Even the assistant governor should not hide the truth! West Hill City is the capital city of Westwood province. How could the governor here allow you to commit such an atrocity?”</p><br/><p>The captain became impatient and shouted loudly, “West Hill City does not have a governor! Quickly release Mister Trey!”</p><br/><p>Jojo secretly pulled Rody aside and quietly asked, “Seth, do you really not know or are you pretending not to know to play tricks on them? When was there a governor in Westwood province? Don’t they all answer to you?”</p><br/><p>“They answer to me?” Rody was stunned.</p><br/><p>Even though they were surrounded by the public security soldiers , Jojo was relaxed. She pulled Rody’s hands and smiled. “Just now, I said that you have changed, but now, you are being crafty again! The entire Westwood province is the Tulip Family’s territory. You, as the Duke of the Tulip Family, will certainly have the final say! If the Westwood province belongs to the Tulip Family, how can there be a governor? The taxes of the Westwood province all go to the Tulip Family! The public security, the assistant governor and all the officials here are paid by the Tulip Family. In a way, these people are all your subordinates.”</p><br/><p>The moment Rody heard this, his expression became weird. He did not know whether to laugh or to cry.</p><br/><p>This is actually the Tulip Family’s territory.</p><br/><p>When Rody became an impostor, he might have been told about such matters. However, he did not really understand it then. Even though someone told him about it occasionally, he would immediately forget.</p><br/><p>Seeing Rody’s strange expression, the captain could wait no longer. His men all intimidated Rody as they waved their swords and slowly advanced. The captain was sweating profusely. If anything happened to Trey, he would definitely lose his job and maybe even his life.</p><br/><p>Jojo laughed and said, “How is it? My dear duke, isn’t mingling with the people incognito really interesting?”</p><br/><p>Rody shook his head. Just as he was about to open his mouth to tell the other party his identity, there was an uproar among the crowd standing at a distance. Suddenly, someone shouted loudly, “His Excellency, the Assistant Governor, has arrived!”</p><br/><p>Hundreds of soldiers surrounded the public square with the crowd in the middle. A group of local soldiers holding lances separated the crowd and entered the middle. A team of cavalrymen then opened the way. They were followed by a man on a black horse. It was a middle-aged man in an Imperial Officer’s uniform. His appearance was also similar to Trey.</p><br/><p>Jojo curled her lips and softly whispered, “He is merely an assistant governor but he has so many soldiers accompanying him. Such arrogance! Even the military minister in the Imperial Capital doesn’t have that many soldiers.”</p><br/><p>The man shouted angrily, “Who dares to capture my brother? Are you all good for nothing?”</p><br/><p>The soldiers gave way for the man to go in front. His face was full of anger until he saw Rody. His arrogant expression turned pale and his forehead started to sweat. He quickly got down his horse and ran towards Rody. He then knelt in front of Rody and spoke with a trembling voice, “Your Excellency the Duke! This subordinate of yours did not know that you were here! Your subordinate should be punished!”</p><br/><p>Rody was startled for a moment, “You know me?”</p><br/><p>The assistant governor smiled and replied, “I met Your Excellency the Duke and Miss Nicole at the Imperial Capital last year! Have you forgotten?”</p><br/><p>After replying Rody, the assistant governor stood up and turned around before shouting. “Quickly, put away your weapons! Do not be rude to the duke! Do you want to die?”</p><br/><p>Rody laughed coldly. “Rude? Your brother had been very rude much earlier!”</p><br/><p>That assistant governor sweated profusely. He saw his brother on the ground. He went up to him and cruelly kicked him as he cursed, “Idiot, you actually dared to offend His Excellency the Duke! Quickly get up and beg His Excellency for mercy!”</p><br/><p>Trey almost fainted but managed to get up and kowtowed as he trembled. However, Jojo coldly said, “Begging for mercy is not enough. He humiliated me and my sister. He is definitely not going to escape execution. I look at you, and you do not look like a good person! Your brother here was so arrogant. This must also be because of your support!”</p><br/><p>The assistant governor turned pale. His eyes gave off an ominous glint. He did not know Jojo’s identity but thought that she was the duke’s lover.</p><br/><p>The duke, with his status, scolding me is enough. How dare a little girl like you scold me as well?</p><br/><p>Rody was aware of the other party’s expression and sneered. “I will take your brother away. You stay back to disperse the crowd and go to the military camp outside the city to admit your guilt!”</p><br/><p>Trey was so scared that he could barely move his body. He could only cry out, “Brother, save me!” After that, his eyes rolled up and he fainted.</p><br/><p>The assistant governor’s heart trembled. He knew that the duke had already been offended in the incident and was afraid that he could not save his post. He had also committed a lot of evil acts in the West Hill City. Acts that would be enough to cause him to be beheaded at least a dozen times. If the duke found out, he would definitely be dead. In addition, even if his brother was not a good person, how could he just watch his own brother, whom he grew up with, die? His brother knew too much and he was being taken away. In case his brother accidentally let anything slip, he would be doomed!</p><br/><p>He looked around at the other party and only saw eight guards. Even if they were powerful, they were outnumbered by his own hundreds of subordinates.</p><br/><p>Although the public square had a lot of ordinary citizens, the outside of the square was guarded by his trusted subordinates. The several hundred soldiers with him, were all paid by him. He thought he might as well just go all out to get rid of the duke! Moreover, the duke had also secretly entered the city. Although there were hundreds of ordinary citizens, the assistant governor planned to kill them all and leave no witnesses. After that, he would concoct a story about how the duke got killed by robbers. Then, he would take a few prisoners from the prison as scapegoats to execute. In the West Hill City, he was the most powerful. Even, if the higher authorities sent people over to investigate, no one would dare to say much with him in charge. As such, there would be no case.</p><br/><p>Even if the emperor finally pursued the case, there would be no evidence and witnesses. At most, it would be a crime of negligence. The duke had himself to blame because he secretly sneaked out unguarded. If that was insufficient, he could also turn one of the public security soldiers into a scapegoat.</p><br/><p>Thinking of that, his eyes turned merciless. He slowly stood up and stepped a few steps back before saying, “Your Excellency the Duke, my brother offended you but it is not a death sentence. Just beat him up and forget about it.”</p><br/><p>Jojo shouted back, “Nonsense! Who do you think you are? You dare plead mercy for him?”</p><br/><p>At this point, it was time to stop giving face to the other party. Rody’s subordinates wanted to drag Trey away. The assistant governor observed with a hesitant face and finally gritted his teeth. He decided that fighting was better than waiting for his death. Waving his hand, he ordered his subordinates to block Rody’s way.</p><br/><p>Rody turned cold. He turned and looked at the assistant governor. He asked, “What are you trying to do?”</p><br/><p>The assistant governor secretly ordered his trusted subordinate next to him to leave the public square. He was to order the subordinates outside the public square to seal all the entrances of the public square. After that, nobody would be allowed to leave the public square alive.</p><br/><p>The assistant governor looked at Rody and said, “Your Excellency the Duke, you forced me to do this! I did not want to do this! As the saying goes, you should always leave a way out for your opponents! You did not give me a way out so I am forced to do this! Hmph!”</p><br/><p>He signaled with his eyes and his cavalrymen started to approach Rody. They pointed their lances at Rody and those with him.</p><br/><p>Rody frowned and loudly shouted, “I am the Duke of the Tulip Family! You dare raise your hand against me! Are you not afraid of being guilty of rebelling?”</p><br/><p>The soldiers were startled and hesitated for a moment. After that, they heard the assistant governor shout back, “Do not speak nonsense! Kill this kid! Leave no survivors! If they escape, we will all be dead!”</p><br/><p>The assistant governor then shouted louder, “Brothers, today we will kill this kid! We must not leave a single one alive! After that, everyone will be safe! Everyone will also be rewarded with 100 gold coins!”</p><br/><p>A few of his trusted subordinates quickly gave the orders. The soldiers were all the assistant governor’s bodyguards. They did not have any governor in the Westwood province . The Tulip Family also usually never bothered about the place. The local army were all under the command of the assistant governor. Although he faced a deficit in paying their salary, it was better than leaving the local garrison in chaos. However, he made hundreds of those soldiers his own private soldiers. Although they wore the uniform of the Imperial Army, they only listened to the assistant governor. They had followed the overlord and had gotten used to his domineering ways. They were like his private army. When they heard that they would be rewarded, they stopped hesitating and started to advance. Others who were still hesitating also moved forward when they saw the majority doing so.</p><br/><p>Seeing that the other side had surrounded him aggressively, Rody’s heart tensed.</p><br/><p>The eight Wolf Fang soldiers were also discouraged. Although they were brave, they still felt nervous when they faced hundreds of opponents. They felt that their deaths would not be very important. However, if the duke was harmed, the Wolf Fang pride would be tarnished.</p><br/><p>The eight soldiers pulled out their scimitars but were forced by their opponents to step back.</p><br/><p>At a distance, there were also soldiers who took out their weapons and surrounded the crowd of ordinary citizens. The citizens were frightened and they thought of running away. However, they were defenseless when they saw the gleaming swords in front of them. They were not brave enough to resist.</p><br/><p>Rody took out his scimitar and told his subordinates. “Right after this, I want you to protect Miss Jojo! When you find the chance, run back to the military camp!” Jojo looked fearful, but she was moved when she saw Rody’s resolute face as he stood in front to protect her. She thought to herself:</p><br/><p>Even if I died here today, I would die together with him. It’s worth it!</p><br/>\n</div>"}