{"title": "Chapter 91: The Pain of Separation", "id": 91, "volume": 1, "url": "http://boxnovel.org/masked-knight-chapter-91-the-pain-of-separation", "volume_title": "Volume 1", "body": "<h1>Chapter 91: The Pain of Separation</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 91: The Pain of Separation</p><br/><p>Translator: Zenobys Editor:</p><br/><p>Rody was neatly dressed. He felt clean and fresh. He could also feel his dexterity coming back. Miraculously, he felt even better than before he was injured. However, he had some doubts so he went next door to ask Muse.</p><br/><p>Muse was standing in front of the window when she heard Rody enter the room. She turned around and looked at him. She slowly said in a cold voice, “Do not speak, listen to me.”</p><br/><p>Muse then explained what happened the night before. She spoke slowly and indifferently but her eyes were constantly observing Rody’s expression. Rody was puzzled. He frowned and said, “So it was Andy. When I get back, I will need to ask him in greater detail.”</p><br/><p>Muse lightly replied, “That is your problem. Your business here is now finished and I have also recovered so…” Muse hesitated for a moment before saying, “So, I will be leaving.”</p><br/><p>“Leave?” Rody’s heart jumped. A feeling that was difficult to explain rose in his heart as he asked, “Why do you want to leave?”</p><br/><p>Muse tried to sound cold as she replied, “Why can’t I leave? When I lost my magic, I was your prisoner! But now I have recovered completely. Do you have the ability to stop me? Watt Fortress may have tens of thousands of soldiers but if I want to leave, will they be able to stop me?”</p><br/><p>Rody was agitated. He walked up to her and said in a low voice, “Prisoner? You’re saying that you were a prisoner? That day I was seriously injured. If you wanted to go, how could I have stopped you? You said you were a prisoner but along the way here, you had plenty of chances to escape!” Rody looked straight at Muse. His eyes gave a complicated gaze.</p><br/><p>Muse could not look him in the eye so, she turned away. She sighed and said, “Why do you want to keep me here? You know that I am not from here. There are also matters at the grasslands... I need to go back to the Temple and warn them about King Sauron’s conspiracy to subvert the Temple. I have to go back. On top of that… staying here… what is the use of staying?”</p><br/><p>Rody stared at her without speaking. Muse’s heart softened as she said, “Both of us are people with high positions and big responsibilities… I… If I asked you to follow me to the Roland Continent, would you be willing to?”</p><br/><p>Rody almost shouted, ‘I am willing!’ but he remained clear-headed. After a moment of silence, he said softly, “Very well, I understand.” He then looked at Muse and reluctantly laughed. “I will send you out of the city.”</p><br/><p>Rody ordered his men to prepare the horses. After that, he accompanied Muse out of the Watt Fortress alone and they moved towards the northeast.</p><br/><p>As the sun rose, two horses walked side by side in the wilderness. Rody was unhappy. He accompanied her stretch after stretch. Finally, they stopped their horses after traveling for about 10 li.</p><br/><p>“Alright, let us split up here. You do not need to accompany me anymore,” Muse said softly. Rody sat on his horse and looked at Muse without saying anything.</p><br/><p>Muse was heartbroken. She took out a ring and gave it to Rody. Her voice trembled, “This is a keepsake to remember me by. I have kept it with me since my childhood. After I leave today, I do not know when we will meet again…” Her voice choked with sadness and her tears started to flow.</p><br/><p>Rody took it and looked at the small ring in his hands like it was the most important thing in the world. He gritted his teeth and said, “I will keep this properly and protect it as though it were my own eyes!” Rody then took out his scimitar and cut a lock of his blonde hair. After that, he cut out a piece of cloth and wrapped his hair before giving it to Muse. “I do not have anything to give you so, take this to remember me by. In the future… if you do not forget me, I will not forget you!”</p><br/><p>Muse trembled. She took the hair wrapped in cloth and kept it close to her chest. She then looked at Rody and said softly, “If you do not forget me, I will not forget you too!”</p><br/><p>After that, she whipped the horse and the horse ran a few dozen steps before it stopped. She then turned around and asked, “Seth, I heard that woman call you Seth! Is that your name?”</p><br/><p>During the past few days, they called each other ‘idiot’ and ‘Duke of Tulip Family’ but they had never called each other by their names.</p><br/><p>Rody shook his head and shouted, “No, Seth is a name used by others! Remember, my name is Rody!” He then paused and added, “Only those close to me know me by this name!”</p><br/><p>Muse looked happy when she heard the words, ‘those close to me’. She nodded and loudly replied, “You command a lot of soldiers and you are an important figure. The bureaucracy is like the battlefield. Many want to claim your life. It is easier to dodge the thrust of an open spear than to avoid being stabbed from the back. Be careful.”</p><br/><p>Rody laughed loudly and replied, “King Sauron is a very ambitious man and must be a very formidable person! Although you are strong, you are not crafty at all. Therefore, you need to be careful.”</p><br/><p>Muse turned red and loudly replied. “I will remember that Rody! Remember, Muse is my religious name. My real name is Mouceria. If you are willing to, you can call me Mouse!”</p><br/><p>After having said that, she turned around and went on her way without stopping. She left Rody sitting on the horse, as he silently repeated her name, “Mouse...”</p><br/><p>Rody waited until she disappeared from his view before leaving in low spirits. He was young and had never experienced the pain of separation. He felt depressed as he rode all the way back to the city.</p><br/><p>Sieg saw both of them leaving the city but only one person came back. He also noted the duke’s unhappiness. He spoke carefully and avoided agitating Rody.</p><br/><p>Rody then heard from Sieg that Jojo was a special envoy dispatched by His Majesty. Rody sighed and despite his reluctance, he ordered his men to request for Jojo’s presence.</p><br/><p>When Jojo came out, she was feeling gloomy. She simply handed the emperor’s orders to Rody and then she turned around without a word.</p><br/><p>Rody was already depressed so, he paid no attention to Jojo’s actions. When Jojo turned around, she had hoped for her lover to call out to her. However, there was no response. Once again, she felt wronged as she had endured an arduous journey and had rushed there for nothing. Her feet started to move faster and she was finally out of sight.</p><br/><p>Rody sighed and carefully read the orders of His Majesty the Emperor. After he read it, he frowned and said, “General Reuben, please summon the commanders of the army.”</p><br/><p>Within a short time, all the different rank commanders of the Northwest Legion had gathered. This time, Rody did not modestly decline Reuben and sat in the chair of the Commander-in-Chief.</p><br/><p>When all the officers were in attendance, Rody announced the orders of His Majesty.</p><br/><p>“General Reuben is dismissed as the Regimental Commander of the Northwest Legion and is to report back to the Imperial Capital. The Northwest Legion will temporarily be under the command of Northwest Military Special Envoy, Duke Seth Rudolph.”</p><br/><p>“The Northwest Legion is to remain and repair the Watt Fortress. Opening hostilities against the Great Moon Kingdom is not allowed without His Majesty’s orders!”</p><br/><p>“The Central Cavalry is to remain until the Northwest Legion is appointed a new Regimental Commander. Once a new Regimental Commander is appointed to the Northwest Legion, Duke Seth Rudolph is to report back to the Imperial Capital! The Central Cavalry is also recalled.”</p><br/><p>After the orders were announced, everybody frowned.</p><br/><p>Reuben was relieved of his post. Everybody had seen it coming. However, His Majesty’s orders to repair the Watt Fortress and not open hostilities against the Great Moon Kingdom was strange. Based on common sense, His Majesty should have dispatched the Southern Legion to the Northwest and battle with the Great Moon Kingdom to regain lost ground.</p><br/><p>On top of that, they believed that once the two countries go back to war, the Duke of the Tulip Family should obviously be the Commander-in-Chief. However, His Majesty did not seem to have any intention to fight. His Majesty also intended to transfer the duke back to the Imperial Capital and send someone else to the Northwest Legion.</p><br/><p>Among the soldiers, only Sieg and Gordon understood. Before the expedition, Rody had already told them that their objective was only to save Watt Fortress. The Empire would not fight against the Great Moon Kingdom. Although the Empire appeared strong, it was actually very weak. The military was lax and the financial situation did not seem good. As a result, His Majesty did not want to recklessly fight against the Great Moon Kingdom. Holding the Watt Fortress and protecting the Northwest region was enough. The captured provinces and the rest were up to political negotiation and had nothing to do with the army.</p><br/><p>Rody coughed twice and the soldiers immediately stopped murmuring. After looking at them, Rody slowly said, “By the order of His Majesty, I will be taking control of the Northwest Legion from today onwards! Now for my order, from today onwards the whole army is to repair Watt Fortress! The military camp is to remain on alert! Other than the scouts, all other soldiers are not allowed to leave the city without my orders!”</p><br/><p>Reuben remained calm and handed over the Regimental Commander’s command seal to Rody in front of everyone. After that, he ignored everyone’s confused expressions as he went out to find his bodyguards. He packed up and was prepared for his journey.</p><br/><p>Rody dispersed everyone. He was unhappy. In his opinion, Reuben was not responsible for the defeat of the Northwest Legion. The Northwest Legion had already been weakened by parasites. In such a situation, how could Reuben not be defeated?</p><br/><p>Of course, it was Reuben’s fault for not being strict with his own army. However, the general environment in many of the Empire’s armies was likewise. Even the Empire’s most elite Central Cavalry was also like that. How could Reuben have changed the situation on his own?</p><br/><p>After that, Rody, Sieg, and Gordon sent Reuben and his bodyguards off to the Imperial Capital. Rody was still unhappy. He then remembered the two parasites in the city and sneered. I have long wanted to punish you. I have returned late and allowed you to stay happy for so many days!</p><br/><p>When he returned to the garrison, his subordinates immediately reported to him that Garrison Commander, Fedol and Northwest Commander, Ferara had presented him with a lot of gifts.</p><br/><p>Rody entered the hall and saw several heavy boxes on the floor. He ordered the soldiers to open the boxes and he saw that a few of the boxes were full with no less than 100,000 gold coins.</p><br/><p>Rody sneered.</p><br/><p>These guys really act quickly.</p><br/><p>The last time, he had pretended to ask for bribes and earned 100,000 gold coins. All of the money was used to pay the soldiers and build fortifications. He had just returned for one day and the two of them had already sent money again.</p><br/><p>“What did they say when they sent this?”</p><br/><p>The bodyguard replied, “The two commanders congratulated Your Excellency on returning after a victory and said that this gold was given to reward the army! They also invited Your Excellency to attend the afternoon feast to celebrate the victory of the ‘Lightning God’s Whip’.</p><br/><p>Rody smiled and replied, “Well, take these gifts and give them to Sieg. Give a portion of the money to the families of those who perished or those who became disabled. Let Sieg handle the rest of the money.”</p><br/><p>The hundreds of thousands of gold coins will be useful. That damn Fedol! According to the law of the Empire, the walls of the fortress have to be 12 meters tall but the walls of Watt fortress are less than 10 meters tall! This parasite only wants money, not his life!</p><br/><p>Rody sighed. He could no longer wait. When he gets replaced by someone else, he would not have the right to deal with those two fellows anymore. He ordered his men to dispatch from the Central Cavalry two groups of the Wolves Fang. He then exchanged a few words with the captain and told him to take one group with him. After that, he took the other group and headed towards the banquet.</p><br/><p>Ferara and Fedol had already gathered the nobles in the city. They had prepared everything in the mansion. That day, both of them felt greatly relieved.</p><br/><p>That day, they heard that Reuben was dismissed by the Emperor and ordered to return to the Imperial Capital. With Reuben gone, there was nobody left who was familiar with the situation in the Northwest Legion. They had earlier received news from the Imperial Capital that once Reuben returned, he would be court martialled. As long as Reuben was found guilty, he would be the only one to take responsibility for the defeat.</p><br/><p>The duke also knows the truth but he has already taken our money. One hundred thousand gold coins! If he dares to become hostile, we will all die together! Haha, we are all corrupted! Hasn't he received our money again as well?</p><br/><p>That was why Ferara immediately sent hundreds of thousands of gold coins to the garrison hoping to make the duke an accomplice.</p><br/><p>He heard the soldiers announce the arrival of the duke. Ferara felt relieved. As long as he got past the day, everything would be solved.</p><br/><p>He dragged Fedol to go out together and greet the duke but felt disdain when he saw Fedol’s frightened face. That Garrison Commander was indeed a real oaf. Ferara had plans to report to the people at the Imperial Capital so that they would transfer that useless oaf elsewhere once their problems were solved.</p><br/><p>While Ferara was deep in thought, a group of heavily armed Central Cavalry soldiers suddenly burst through the door. All of them had unsheathed their swords. With a murderous look on their face, they rushed in.</p><br/><p>Men and women in splendid costumes attending the banquet screamed and ran away. The more courageous ones tried to intimidate the soldiers. However, they were the Wolves Fang soldiers who had followed Rody to the Northwest. They only knew how to take orders from the duke. They grabbed and threw out all the offenders despite their noble ranks.</p><br/><p>There were a lot of screams and soon, the entrance was occupied by the soldiers and the venue was empty. After that, the sound of footsteps could be heard as Rody walked in gloomily.</p><br/><p>Ferara was surprised and wanted to walk forward to talk to Rody. However, when Rody saw Ferara, he pointed at Ferara and the frightened Fedol. He ruthlessly shouted, “That’s the two of them! Drag them out and execute them!”</p><br/>\n</div>"}