{"title": "Chapter 108: Negotiation", "id": 108, "volume": 2, "url": "http://boxnovel.org/masked-knight-chapter-108-negotiation", "volume_title": "Volume 2", "body": "<h1>Chapter 108: Negotiation</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 108: Negotiation</p><br/><p>Translator: Editor:</p><br/><p>Seeing that the rebels have laid down their weapons, their leader gave them the order to line up. Following Camus’ orders, the Southern Legion dismounted, surrounded the mountain soldiers and led them to the barracks. Two rows of cavalrymen followed them from both sides. They were heavily armed and gave off the impression that they were ready to fight.</p><br/><p>Rody looked at the defenseless rebels below the city walls and for some unknown reason, suddenly had a fearsome thought.</p><br/><p>Now that they have dropped their weapons, let’s execute them all to prevent any potential problems occurring in the future!”</p><br/><p>The thought was so sudden that Rody himself was shocked and started to have cold sweat.</p><br/><p>Shit. Why did I suddenly have these kinds of thoughts? Rody cursed in his mind. Andy took no heed and spoke in his mind. “Why do you care? Right now, the rebellion of the mountain tribes is imminent. With the presence of the mountain soldiers, the other soldiers would not be able to relax. Once the mountain tribes openly rebel, these Empire's mountain soldiers would become extremely dangerous. Whether they will rebel or not is anybody's guess. Perhaps, it is better to take advantage of the fact that they are unarmed at this moment and kill them all!”</p><br/><p>“Nonsense!” Rody frowned. “How can I indiscriminately kill innocent people?”</p><br/><p>Rody then heard Andy laugh. “What’s wrong? Why are you so agitated? I did not give you this idea. You thought it up yourself! Hehe, let me tell you. The late Duke would have done this. He is someone who would take preventive measures! As you know, the success of a general is built on the bones of ten thousand soldiers1. Let us say they refuse to surrender. What would you have done? Would you really execute their family? Didn’t you say that you would not spare a single life? Hehe, just now you said it so resolutely but now you are being soft-hearted.”</p><br/><p>Listening to Andy’s words, Rody just gritted his teeth and did not reply. He could not help but think. What will I do if they did not surrender? Will I kill their family members? According to the Imperial decree, they must be executed but… but… will I kill them?</p><br/><p>Suddenly his heart stirred as he felt a sharp glare directed at him. Rody looked back and saw Camus looking at him from below the city walls. Camus squinted his eyes and showed a profound gaze. A ruthless smile present on his lips. When Camus saw that Rody made eye contact with him, he gently signaled at the mountain soldiers who were returning to the barracks. Camus’ eyes had a questioning look.</p><br/><p>Rody was very disturbed. He understood Camus’ intentions and the meaning behind the look Camus gave him. Camus had asked himself a similar question.</p><br/><p>To kill or not to kill?</p><br/><p>Rody took a deep breath and inhaled the cold air of the night. He forced himself to calm down and then he looked at Camus and shook his head.</p><br/><p>Camus gave a wry smile and gently whipped his horse. Together with his subordinates, he escorted the mountain soldiers back to the barracks.</p><br/><p>Rody was confused. After a short while, he saw that both parties had completely departed and they only left behind two corpses in their pools of blood.</p><br/><p>“Let’s go back!” Rody said softly. “Let us go back to the Governor-General’s office. Dispatch someone to tell the Governor-General to come and see me.”</p><br/><p>During that entire incident, the Xier's Governor-General did not show up at all. Rody was calm but angry. He wanted to fault that Governor-General. He is one of the highest ranked officers. How could he just hide in fear?</p><br/><p>Rody and his subordinates had just reached the entrance of the Governor-General’s office when he saw a carriage protected by bodyguards heading towards the office. Rody could recognize that it was that Governor-General’s carriage and immediately felt gloomy.</p><br/><p>Sure enough, the Xier's Governor-General got down from the carriage the moment it stopped. He then approached Rody and said, “Your Excellency the Duke, I heard you are looking for me and I immediately rushed over...”</p><br/><p>Rody was angry when he saw him and did not dismount from his horse. He spoke coldly, “Have you received the news? Your nephew Toohey had embezzled the soldiers’ wages and had slaughtered them indiscriminately. He had caused the mutiny and was executed by me.”</p><br/><p>The Governor-General was startled. He immediately lifted his head to look at Rody. His expression changed. A trace of anguish could be seen on his face as he hung his head and said, “Your Excellency the Duke, Toohey’s mistakes had caused the mutiny and he deserved the punishment.”</p><br/><p>Rody snorted and said, “You are actually very understanding.” He then paused for a moment before coldly continuing, “Just now a disaster almost started outside the city gates. Where were you during that time? As the Governor-General, could it be that you were still sleeping at home?”</p><br/><p>The Governor-General started to have cold sweat. He did not lift his head as he softly said, “I… I received the news late… this… so…”</p><br/><p>Rody felt furious and wanted to denounce him loudly. However, he had to suppress his anger and warned himself. This is someone else’s land. I only have a few guards with me. I do not have any soldiers or power. The situation here is too complicated. Even though this person is a hateful person, he is still the Governor-General. If I were to suddenly become hostile to him, the stability of the province will be threatened.</p><br/><p>Taking a deep breath, Rody replied, \"Governor-General, it is fortunate that tonight's incident did not end up as a big problem. You better restrain your soldiers and have them carefully watch the city gates. Take essential precautions. Right now, both of us are in the same boat. If the Southeast is stable, then both of us would have no worries. Otherwise, we would be in trouble.\" He then paused and continued softly, \"Do you know Reuben from the Northwest? He had the title of Earl but because of his failure, his title was stripped. Besides that, he was also locked up in the martial court. Governor-General, do you have as much power and influence as Reuben? That will be all for tonight. Right now, Camus is making sure that the mutinying soldiers return to their barracks. I suggest that the Governor-General can allocate some soldiers to speed up preparations and provide support.</p><br/><p>After finishing what he had to say and without looking at the Governor-General, Rody entered the government building. He left the Governor-General standing at the same spot.</p><br/><p>The moment Rody entered the building, he immediately called for Randt and whispered: \"Take additional precautions. Tonight, we killed the Governor-General's nephew. Although the Governor-General did not have a fall out with me, after all, we are now in his territory. In another two days, when the Wolf Fang arrives, we would not need to worry anymore!\"</p><br/><p>Randt left after receiving his orders. Rody felt physically and mentally exhausted. When he thought of what happened that night, he was confused. He shook his head and went back to his room.</p><br/><p>Rody was agitated. When he remembered the thoughts he had earlier, he felt afraid. When did I become so bloodthirsty? Is it true that people will change after they have killed a lot?</p><br/><p>He then heard Andy laugh, “Kid, You do not need to feel strange about it. After all, you have been the Duke for quite some time. These kinds of thoughts are normal as most leaders are usually cruel and ruthless. You were not wrong to have those thoughts.”</p><br/><p>Rody helplessly asked, “Do you think those thoughts are normal? Don’t you think that it is too cruel?”</p><br/><p>Andy’s voice was full of disdain as he replied, “Cruel? I am different from you. I am not a human. I am just a skeleton. I do not care about how many people are killed. With you as an exception, I would not bat an eye even if everyone in the world is killed.”</p><br/><p>Rody shook his head as he disagreed with Andy’s words. However, he was unable to tell which parts of Andy’s words were wrong. Feeling drowsy, Rody finally fell asleep.</p><br/><p>At dawn, Rody heard the faint sound of people talking outside the door. After that, the door was gently opened. Light footsteps accompanied by the crisp ringing of bells drifted in.</p><br/><p>Rody sat up from his bed and saw the woman dressed in red from yesterday’s banquet entering the room. She held a silver pot in her hand and looked flushed as she walked to his side. She was still wearing the small, short red dress, exposing her four limbs and small waistline. Her foot had an anklet with small bells. The bells gave crisp jingles with every step she made.</p><br/><p>Rody frowned. “How did you come in?”</p><br/><p>The woman hung her head and said softly. “Your Excellency the Duke, the Governor-General is the one who sent me here to serve you.”</p><br/><p>Rody was startled and then he gave a wry smile. “The Governor-General is really considerate in that area.”</p><br/><p>That woman smiled. Although her face still looked flushed, she boldly looked at Rody and whispered, “The Governor-General has good intentions. Although you already have people to serve you, but they are all rough men. You will need women for some other matters because we women are naturally more attentive.”</p><br/><p>After that, she handed Rody a wet towel. He could not get angry at her, but instead, he sighed and then accepted the towel from her.</p><br/><p>Suddenly, Randt pushed open the door and walked in as he said in a muffled voice, \"Your Excellency the Duke, General Camus is here to see you. He is waiting for you in the front hall.\"</p><br/><p>Rody immediately removed the towel. Rody rushed out with Randt, without sparing a glance at the woman and so, had missed the change in her expression.</p><br/><p>Camus still had a cold expression. He only nodded when he saw Rody walk into the front hall. Rody saw that Camus looked quite haggard. Apparently, Camus did not sleep the previous night. Although Camus did not have a pleasant attitude towards him, Rody knew that Camus, the Commander of the Southern Legion, was the only one that could help him in the Southeast.</p><br/><p>“General Camus. You are very early.” Rody smiled.</p><br/><p>Camus coldly replied. “This is only natural. Did Your Excellency the Duke sleep well?”</p><br/><p>Rody replied, “General must be blaming me for being lazy… However, I do not have a single soldier with me. I am only a phony special envoy, so I can only sleep at home.</p><br/><p>Camus gave a sarcastic laugh and said, “Just a phony special envoy? Your Excellency's actions last night showed a lot of power and wisdom. With one command, you managed to get the soldiers to surrender. It looks like His Majesty was not wrong in dispatching you here.”</p><br/><p>Rody sighed and said, “General Camus, I know you have some grudges with my family. But the late… my father had already passed away. Please forget all your feelings of resentment. This time, I have come to the South and I would need a lot of your help.”</p><br/><p>Camus’ expression changed and he lightly said, “What resentment? You are the Duke and His Majesty’s special envoy. I am just the Commander-in-Chief of the local army in the Southeast. If you have any instructions, just say it and nobody would dare to defy you.”</p><br/><p>Rody just shook his head as he knew that years of grudges cannot be solved within a short period of time. He reluctantly smiled and continued. “What is the condition at the barracks outside the city?”</p><br/><p>“The mountain soldiers have been paid and are now in the barracks. I have already stationed some soldiers to secure the barracks.” After saying that, Camus showed an anxious expression as he continued, “These soldiers are only temporarily stable. When news of the combined tribal rebellion is out, I am afraid...” After that, Camus’ eyes showed a murderous glint.</p><br/><p>Rody nodded and said, “Someone had secretly provoked them to mutiny last night. However, we do not know any of the current news about the mountain tribes.”</p><br/><p>Camus sighed, “I came here to talk to you about this matter.”</p><br/><p>“Alright.” Rody said as he laughed, “In that case, I will call the Governor-General over to discuss this together with us.”</p><br/><p>“The Governor-General? That good-for-nothing,” Camus sneered. He then looked at Rody and said, “Seth. Let us speak the truth. An old man like me is too lazy to talk in circles. The Governor-General here is just a good-for-nothing! If not for the two of us, I am afraid we would have lost Purple Leaf City before dawn due to last night’s incident! What is the purpose of discussing things with that useless person?”</p><br/><p>Rody felt awkward and somehow managed to laugh without speaking.</p><br/><p>Camus waved his hand in disapproval. “Although I do not like your Tulip Family, I am not stupid and also not devoid of sense. The current situation is complicated. I have also seen that your actions are not much different compared to your late father. Hehe… The mountain people wants to rebel? They better ask if my sword will approve of it or not!”</p><br/><p>Rody nodded and said, “Alright. In that case, why did General Camus come and visit me so early in the morning?”</p><br/><p>Camus walked forward two steps and whispered, “The Flame Tribe has dispatched someone to see me. They said they intend to negotiate with us.”</p><br/><p>“Negotiations?” Rody opened his eyes wide as he said, “They have already gathered the chiefs together and would probably start their rebellion in the next few days! What do they want to negotiate at this time?”</p><br/><p>Camus suddenly smiled and said something that surprised Rody.</p><br/><p>“Your Excellency the Duke, you must have missed the news. I received news this morning that Wuya of the Flame Tribe, their newly elected Chief, was attacked by an assassin. He was attacked the day before yesterday and is now seriously injured. His chance for survival is uncertain.”</p><br/><p>------------------------------------------</p><br/><p>Translator's Footnote:</p><br/><p>1 , yī jiāng chéngmíng wàn gǔkū. The original line , yī jiāng gōng chéng wàn gǔkū , is a Tang Dynasty poem which says that a general's success is built on the sacrifice of 10,000 soldiers. The minor variation  (fame) and  (success) does not alter the meaning.</p><br/>\n</div>"}