{"title": "Chapter 112: Prophecy", "id": 112, "volume": 2, "url": "http://boxnovel.org/masked-knight-chapter-112-prophecy", "volume_title": "Volume 2", "body": "<h1>Chapter 112: Prophecy</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 112: Prophecy</p><br/><p>Translator: Editor:</p><br/><p>“What?”</p><br/><p>Rody was shocked to hear Andy’s surprised voice. In his mind, Andy was a skeleton that would be able to stay composed even if the sky started to fall. It was very rare to see him surprised.</p><br/><p>There was a moment of silence before Andy replied, “Strong! Very strong! There is some kind of energy… Shit! It is not any kind of magical or spiritual energy! Kid. You have to be careful. There is someone ridiculously powerful inside!”</p><br/><p>“What is it?” Rody was also serious.</p><br/><p>“I do not know,” Andy sounded helpless as he replied, “I can’t see through to the inside. The see-through spell is also useless! There is a very powerful person inside. It is someone who is more powerful than anyone you have ever encountered.”</p><br/><p>“Could it be the chief?” Rody asked, “Is he more powerful than you, Old Mark and Mouse?”</p><br/><p>“I do not know,” Andy sounded very serious. “However, that is probably true! From the vibrations, it is likely that this person can use ‘Domain Force’!</p><br/><p>“What?” Rody could not help but speak out. He then took a deep breath and continued to stay silent. The people around him also looked at him in surprise. The mountain people thought it was strange that the people of the Empire would suddenly shout for no reason. After that, Randt asked in a whisper, “Your Excellency. Is something wrong?”</p><br/><p>“No. Nothing.” Rody gave a serious expression and shook his head. After that, he secretly said, “’Domain Force’? Andy. Did you say ‘Domain Force’? Didn’t Mouse say that after reaching the level of ‘Domain Force’ it is almost like reaching the level of God?”</p><br/><p>Andy gave a strange laugh that sounded uneasy. “The level of God? Didn’t the mountain people say that their Chief had descended from the heavens?”</p><br/><p>At this moment, the shaman appeared from behind the curtain and faintly said something. Wuyu immediately shouted after that, “Duke of Tulip. Please come in.”</p><br/><p>Rody looked at Randt and said, “Wait here for me.” He then stepped forward and walked through the curtain.</p><br/><p>The interior of the wooden house was very large. Rody felt that something was wrong and soon realized that this house did not have any windows.</p><br/><p>The room was filled with a strange plant-like smell. There was a copper stove in the room. There was a life-like snake sculpture on top of the stove. Smoke slowly rose from the snake’s mouth. On a platform not far from there was the figure of the famous Chief Wuya who was sitting cross-legged.</p><br/><p>Rody was surprised that the mountain people’s ‘strongest warrior’, the Chief, looked extremely weak.</p><br/><p>Although Wuya was just sitting there, it was clear that he was not tall. In fact, he was small sized even when compared to Rody. Wuya was different compared to the other mountain people. He was wearing white linen clothing and his face was clean and beardless. His face also did not have the painting of the mountain people.</p><br/><p>The more startling thing was that Wuya’s face was white. It was white and a little bit transparent like a block of ice. His face was so strange that it was unlike the face of a human. On the other hand, it was more like a jade carving.</p><br/><p>At that moment, Wuya’s eyes were closed and he was just sitting with his back leaning against the wall.</p><br/><p>Suddenly, Rody felt his eyes glow. At the same time, Wuya who was in front of him was also wrapped in a glow. A light was moving around the body as if the person was on fire. His body was shining as if he was a flame illuminating the area.</p><br/><p>Rody knew that Andy was using the see-through spell with his eyes. The light moving around Wuya was that person’s fluctuating energy.</p><br/><p>Suddenly Wuya opened his eyes. His eyes were extremely cold and did not have a single trace of emotion. He looked at Rody so coldly as if he was a God looking at an ant.</p><br/><p>“Are you watching me?” His voice was light. It was in the language of the Empire but the voice was calm and devoid of emotion.</p><br/><p>“What?” Rody’s expression did not change. “Chief Wuya. What are you talking about?”</p><br/><p>Wuya slowly closed his eyes and gently repeated. “Duke of a distant land. You are watching me. Why?”</p><br/><p>Rody was secretly afraid and Andy was disturbed. “He can detect me!”</p><br/><p>Rody cleared his throat and slowly replied, “Chief Wuya. I was watching you because I did not expect the famous Chief of the Flame Tribe to have this kind of appearance.”</p><br/><p>Wuya’s voice was still extremely cold as he asked, “I noticed that your body has a fluctuation of magic. Duke. Are you a warrior or a sorcerer?”</p><br/><p>“Warrior,” Rody involuntarily replied. He felt a strange feeling. It was as if the Chief of the mountain people gave out an extraordinary pressure. Wuya’s light voice sounded infinitely majestic. It was as if Wuya could see through Rody with just a glance.</p><br/><p>Wuya raised an eyebrow as he continued to look at Rody. “Warrior? In that case, the magical fluctuations in your body must be because you possess a magical treasure. I heard that the Radiant Empire’s Tulip Family was the most formidable family. Is that your family?”</p><br/><p>Rody tried to calm himself down and walked forward a few steps. He then smiled and said, “Chief. You invited me here for negotiations. I believe it is not to talk about my Tulip Family. Now that I am here, isn’t there something more important to discuss?”</p><br/><p>Wuya was silent for a while and then he nodded his head and agreed. “Alright. Duke, please sit.”</p><br/><p>After Rody has sat down, Wuya slowly started the conversation. “Duke. If you are here, you must have brought your conditions. There is nobody else besides us right now. Please speak directly.”</p><br/><p>Rody was startled and did not expect that Wuya would be so direct. He thought for a moment and then replied, “Chief Wuya. I would like to take the liberty to say that we cannot comply with your demands. Before anything else, the uniting of the tribes and the election of a Chief is something that His Majesty the Emperor would never accept. Since hundreds of years ago, the law made by Abbas the Great stated that the tribes cannot elect a Chief. This action is undoubtedly a challenge against the Empire.”</p><br/><p>Wuya smiled and asked, “Since all of you cannot accept the demands, why did the Duke travel here?”</p><br/><p>Rody took a deep breath and replied, “I came to persuade Chief Wuya to give up this intention.”</p><br/><p>Wuya looked at Rody and asked again, “Duke. Do you know my intentions?”</p><br/><p>Rody gave a cold smile and answered, “Chief Wuya is ambitious. You want to unify the tribes of the mountains and establish a foundation!”</p><br/><p>Wuya was silent for a moment. After that, he started to laugh. Wuya’s white face seemed to glow as he slowly replied, “Unite everyone and establish a foundation? Looks like all of you think that way as well…”</p><br/><p>“Am I wrong?”</p><br/><p>Contrary to Rody’s expectations, Wuya shook his head and replied, “You are wrong.”</p><br/><p>“Oh?” Rody did not expect Wuya to deny it.</p><br/><p>“Duke. Frankly speaking, I have no interest in uniting the mountain tribes. I also do not want to establish a foundation.” Wuya’s tone was very calm, “I don’t even care about the title of Chief.”</p><br/><p>Rody frowned and said, “Chief Wuya. I am afraid I do not quite understand your words.”</p><br/><p>Wuya opened his eyes and looked at Rody. “Duke. Why do you not understand? Haven’t you already made up your mind that your objective here was to find ways to stop our opposition? To find my assassin, destroy our unity and overthrow my authority?”</p><br/><p>These words were mentioned casually and calmly. However, the words rang like thunder. Even if Rody could stay calm, he would not be able to stop his cold sweat. Rody’s expression started to change.</p><br/><p>“You do not have to be surprised.” Wuya gently waved and lightly declared, “I have already understood your intentions the moment you walked into the room.” Wuya then gave a smile. “I forgot to tell you. I can read minds!”</p><br/><p>“What?” Rody could not help and finally whispered, “You can read minds?”</p><br/><p>High-level magicians and sorcerers have similar abilities. However, it was used to listen to another person's heartbeat and breathing as they talked. This was generally used to determine if that person is telling the truth or if he was lying. To be able to read another person's mind would be God's magic.</p><br/><p>Wuya’s voice remained calm and cold. “Duke. Do not be so surprised.” Wuya sighed and continued, “For me, I am not interested in power and influence.”</p><br/><p>“That…” Rody gritted his teeth. “In that case, why do you want to unite the mountain tribes and take the position as Chief? Isn’t your actions contradictory and only for the purpose of that objective?”</p><br/><p>Wuya looked gloomy and shook his head. “You are wrong… you are all wrong… they are also wrong. Uniting the mountain tribes? Do you mean like the people of the grasslands in the Northwest that established their own country to fight the Empire? Ridiculous. Humans fighting each other is so pointless.”</p><br/><p>“Humans?” Rody could not help but ask. His breathing had also become heavier. “Could it be that Chief Wuya is not a human?”</p><br/><p>Wuya showed a confused expression. He was hesitant for a while before he shook his head and gave Rody a surprising answer, \"I do not know.\"</p><br/><p>Rody’s mouth turned dry and he wanted to laugh wildly. He wanted to laugh at Wuya’s crazy words. However, his heart felt heavy. Somehow managing a smile, Rody asked, “Chief Wuya. What is the meaning of your words?”</p><br/><p>Wuya shook his head and replied, “I do not know. However, I can tell you that I have no interest in fighting the Empire. If I wanted to fight you, I would have done it a long time ago. The Southern Legion would not be able to stop me.”</p><br/><p>Rody was silent for a moment before he coldly asked, “What exactly do you want?”</p><br/><p>“A promise!” Wuya opened his eyes and demanded, “I want the Empire to ensure that no one would enter the mountains!”</p><br/><p>“What?” Rody looked at the chief of the mountain people in surprise. “You only want that?” Rody secretly thought. If he really only asked the Empire not to step into the mountains, it would not be difficult for the Empire to accept. The Empire had no interest in the mountains. However, is that really the objective of the possibly ambitious Chief?”</p><br/><p>Rody asked again, “Chief Wuya. I am afraid I do not really understand your words. I hope you can give me a complete explanation.”</p><br/><p>Wuya slowly stood up and closed his eyes. He took a deep breath and then his cold voice resounded around the house. The voice was like a distant singing.</p><br/><p>“Shackles of the millennium have decayed.</p><br/><p>The Devil’s eye shall gaze at the Earth.</p><br/><p>The blood of the Empire will eventually solidify.</p><br/><p>Its vicious curse will taint the radiance of the surface.</p><br/><p>They will spread evil throughout the land.</p><br/><p>They will bring calamity to the world.</p><br/><p>God’s blood will wash away the temple.</p><br/><p>The thorns of the withered flower will be the end.”</p><br/><p>The song was recited as if it was a magic spell. Rody felt depressed and afraid when he heard this. However, he did not know why he was afraid.</p><br/><p>Suddenly, Andy’s voice screamed in his mind, “Prophecy! He speaks of a prophecy!”</p><br/><p>“What?” Rody could not help but stand and glared at Wuya.</p><br/><p>Wuya gave a wry smile and spoke in low spirits, “Yes. It is a prophecy.”</p><br/><p>Rody froze for a moment and pointed at Wuya, “You… What did you say…? You could listen to…”</p><br/><p>Wuya gave a smile as he looked at Rody and lightly said, “I was wondering… Why are there two souls in your body?”</p><br/><p>Wuya saw that Rody was at a loss for words before slowly continuing, “Duke. I know you are not an ordinary person. I hope you keep the words I have just said in your mind.”</p><br/><p>Rody took a deep breath and asked, “Chief Wuya. That… prophecy? What is the meaning of the prophecy? How do you know of it?”</p><br/><p>Wuya shook his head and replied, “Find the meaning to the prophecy yourself. Perhaps the other soul within you might know something.” Wuya then gave an unfeeling smile and continued, “I just want to tell you that I hope that in the future, the Empire would not send anybody into the mountains! I will also keep the mountain people in the mountains. The mountain is our world. We will not go out. However, none can enter! Otherwise, I will not show mercy!”</p><br/><p>Rody’s face turned pale as he murmured, “The vicious curse will stain the radiance of the surface. They will bring disaster and calamity everywhere. Is the radiance the Radiant Empire? What is the curse? What is the disaster?”</p><br/><p>Wuya shook his head and replied, “I do not know. I only hope that the mountain people would be able to escape. The mountain people only live in the mountains. The mountain is our home. If there is a disaster, let it happen outside the mountains!”</p><br/><p>Rody was agitated and shouted, “Nonsense! Nonsense!”</p><br/><p>Wuya simply laughed and replied, “I was speaking nonsense? In that case, what benefits would I obtain from that? Is there anything from what I said that would inconvenience the Empire?”</p><br/><p>Rody became silent.</p><br/><p>What would the Empire lose by agreeing to those terms?</p><br/><p>The Empire must not enter the mountains? What a joke! Since centuries ago, the Empire was never interested in the mountains and only wished for the stability of the cities in the Southern Region.</p><br/><p>The strange Chief’s demands are for the Empire to not enter the mountains. He wants the mountains and the Empire to be completely separated. Could it… Could it really be to escape the ‘disaster’ in the prophecy? If he speaks nonsense, why would he lie to himself?</p><br/><p>The more Rody thought, the more confused he became. His breathing started to become heavier.</p><br/><p>When Rody somehow managed to calm himself, Rody asked again, “In that case, Chief Wuya. Why did you try to unite the mountain tribes? Why did you try to incite a rebellion from the mountain soldiers in the army?”</p><br/><p>Wuya shook his head and answered, “The union of the mountain tribes is inevitable. The Empire is like a strong magnet that would attract the mountain people. The mountain people would then slowly become a part of the Empire. If this goes on, the disaster in the future would definitely plague the mountains! A united mountain nation is the requirement so that it would not get assimilated by the Empire. As for the incitement of the rebellion… Those were not due to my orders.”</p><br/><p>“That was not ordered by you?” Rody shook his head. “You are the person recognized as the Chief of the mountain people! If it was not ordered by you, who else could it be?”</p><br/><p>Wuya slowly walked to the copper stove and placed his hand on the mouth of the snake. He allowed the white mist to spray onto his palm. With a complicated look on his face, he said, “You people of the Empire have a more complicated way of thinking compared to us mountain people. How is it that you still do not understand? There are also mountain people that are ambitious. When they are strong, it is hard for them to forget about the hatred from many years ago. They do not mind spilling blood. I do not like it but I cannot convince them. I… Can’t you see it? I am currently a weak patient!”</p><br/><p>Rody lowered his voice and asked, “Patient? Wuya could not possibly have fallen sick. Is it true that you were attacked by an assassin?”</p><br/><p>Wuya showed a complicated expression and thought for a moment before denying, “No. That is not true! No one can assassinate me! At the very least, nobody on the mountain can do it. My weakened state is because of the Death Canyon. You might have seen it on your way here. A few days ago… I secretly tried to enter it.”</p><br/>\n</div>"}