{"title": "Chapter 120: Bloodthirsty Spider", "id": 120, "volume": 2, "url": "http://boxnovel.org/masked-knight-chapter-120-bloodthirsty-spider", "volume_title": "Volume 2", "body": "<h1>Chapter 120: Bloodthirsty Spider</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 120: Bloodthirsty Spider</p><br/><p>Translator: Zenobys Editor:</p><br/><p>Spider!</p><br/><p>Diane almost fainted the moment she saw it.</p><br/><p>It was an extremely large spider!</p><br/><p>The thing that was crawling toward Rody was as large as a washbasin. Its eight, long, yellow, hairy legs were as thick as Rody's arms. Its eight legs were crawling non-stop, rubbing against the gravel on the path and making a strange noise.</p><br/><p>Diane was a woman, after all. She was frightened of such furry creatures and immediately screamed.</p><br/><p>Rody was also stunned. Cold sweat appeared on his head, and he could not help but murmur, “Spider…What the hell! I have never seen spiders as large as a washbasin before!”</p><br/><p>Seeing that the spider was rushing towards him faster than ever, Rody quickly stooped to pick up an egg-sized stone and threw it hard at the monster.</p><br/><p>There was a loud ‘clang’ sound. The stone struck the back of that large spider causing it to roll away a little before stopping. But the spider was none the worse for it. It merely shook and hissed at Rody with a strange sound.</p><br/><p>“What the hell! The spider can hiss!” Rody glared at it, “Its shell must be very hard! The strength I used just now was enough to break an ox’s bones.”</p><br/><p>After shaking its body that spider then started crawling towards Rody again. It was so fast that Rody was surprised. In a hurry, Rody responded by kicking the spider. He felt as if he was kicking a stone. With that kick, that spider flew up, somersaulted twice in the air and then landed on the ground. After that, the spider got up again. Its front legs pointed towards Rody and made threatening gestures.</p><br/><p>Seeing that the spider was cautiously approaching again, Rody held his dagger and harshly shouted, “Shit! Come on! Large insect! I am not afraid of you! Let us see if your shell is harder or my blade is sharper!”</p><br/><p>Rody then glanced at Diane who was trembling violently beside him. She was also clutching more tightly onto his clothes. Rody could not help but pat her and shout, “What are you afraid of? If it dares approach, I will cut it into several pieces. I…”</p><br/><p>Rody suddenly paused. He could hear loud crashing sounds of the spiders from the surrounding areas. The sounds were destroying Rody’s confidence. Large shadows began to show up in the surrounding fog. Following that, numerous spiders crawled out of the fog in front of Rody. They too were as large as a washbasin.</p><br/><p>Those long and hairy legs crawled all over as the spiders surrounded Rody and Diane.</p><br/><p>“Ahh!” Diane screamed. Her voice was full of horror and fear. Rody swallowed his saliva and thought to himself. I am finished. It seems like I won’t be eaten by the snake, but instead, I will be eaten by spiders.</p><br/><p>Taking a deep breath, he gathered his fighting energy and was instantly wrapped in a pale golden light. He swept around with his dagger as he spun around and drew out a golden circle in the fog. The spiders closest to the circles fell down. Their hard shell was broken by the golden fighting energy. Some had their limbs broken, some were immediately sliced into two, revealing their red and green insides.</p><br/><p>When Rody saw that, he was scared and nauseated, but he did not dare to stop moving his hands. He berated in a loud voice and brandished his dagger, continuously driving away the approaching spiders.</p><br/><p>The surrounding huge and hairy monsters continued to gather and grew larger in number. They did not fear death and crowded together. Occasionally, there were a few spiders that were swept away by Rody or had their abdomens sliced open. That immediately caused a few other spiders to jump at them while many more continued to give an itch-inducing hiss.</p><br/><p>What the hell? Are these really spiders? Shouldn’t spiders be on trees?</p><br/><p>As more and more spiders rushed in, the amount of space Rody could control became smaller. There were times that a few of those monsters got past Rody’s guarded area and landed near his feet. Those spiders were immediately kicked away by Rody.</p><br/><p>The dagger in Rody’s hands was too short. It was inconvenient to bend down and slash the spiders at his feet. Rody was sweating from tension and fatigue. He had been running around the entire night carrying Diane, and he had traveled for quite a long distance. At the moment, he was using his fighting energy in desperation, but the consumption of that energy was also quite high. He soon noticed his fighting energy becoming weaker and the golden light becoming dimmer. He was depending on Andy to warn him about which direction the spiders were coming from and was barely resisting the attacks.</p><br/><p>Rody was breathing heavily when Diane suddenly shouted, “Sit down beside me!”</p><br/><p>He looked down and saw that at some point in time, Diane had drawn a small circle. She was sitting in the middle of the circle, with her legs crossed. Her face was as white as paper, and she was sweating profusely. In front of her was a squarish crystal-like object placed on the ground. Diane’s eyes were shut. Her two hands were at her chest with her index finger pointing upwards.</p><br/><p>“Quickly!” She shouted again when Rody did not respond.</p><br/><p>The moment Rody heard her, he stopped thinking and immediately sat down.</p><br/><p>Diane suddenly opened her eyes and spat out a mouthful of blood. The blood splattered all over the crystal-like object and then she shouted, “Move back!”</p><br/><p>The crystal-like object suddenly burst into brightness. A dazzling red light then burst out within the circle. The spiders near the circle shrieked and retreated. The spiders that were in the circle immediately scurried away as if they were being burned.</p><br/><p>More and more spiders continued to gather outside the circle, but not a single one dared approach the circle.</p><br/><p>Rody and Diane turned pale just by listening to the unending hisses and the occasional nipping sound of the spiders. They felt that even their nightmares were never as frightening as that. Although they knew that the spiders dared not cross the red circle, the threatening screeches of the numerous huge spiders were still bone chilling.</p><br/><p>“Good!” Andy’s voice sounded relieved. “Fortunately, that woman knows a little bit of magic. These ‘Bloodthirsty Spiders’ are just low ranked Mythical Beasts. There is nothing frightening about them. However, they always appear in groups and becomes problematic. These low ranked Mythical Beasts could only bite with their fangs. It will be alright as long as you are careful when they fly up.”</p><br/><p>Rody immediately turned stiff. His hands and legs turned cold as he shouted, “What did you say? These strange monsters can… they can fly?”</p><br/><p>Before Andy could reply, one of the spiders suddenly shook. After that, a pair of wings suddenly appeared at the top of the spider’s shell. The wings started to flap and the spider flew towards Rody. The red circle on the ground could not stop it. Rody was quick to respond. He waved his dagger while sitting on the ground and cut the flying spider into two. It fell onto a group of spiders and then the spiders pounced on it.</p><br/><p>Diane quivered and almost cried, “They… they can fly.”</p><br/><p>Rody gritted his teeth, “Damn it! Let’s fight!” Rody stood up and held his dagger with one hand. He then gathered all of his fighting energy, and his body started to emit a golden flame. The light was very bright and dazzling. The pale gold color was also becoming more intense. Rody’s body was soon wrapped in the golden light. Rody suddenly opened his eyes. He grabbed Diane off the ground and shouted, “Go to hell!”</p><br/><p>The golden light on his body suddenly burst out. Countless rays of golden light scattered like arrows. All the spiders that were struck by the light were crushed.</p><br/><p>All the other spiders immediately scattered and backed away. Immediately, an open space with a radius of at least ten meters was available. The ground was covered with the dead bodies of the spiders and a strange stench filled the spot. The golden light had also immediately faded. Rody’s body shook as he could barely support himself. He then whispered, “Quickly run! To the left!”</p><br/><p>Sure enough, after sweeping out those spiders on the left, a large opening could be found. The two of them supported each other as they ran towards the opening. However, after they had just walked a few steps, the spiders surrounded them again. There were many spiders, and all of them did not seem to fear death. When he saw that the opening had been sealed off by those hairy monsters, Rody showed a trace of despair and gave a wry smile, “That’s it. I am going to die here, today. However, I just never expected to be eaten by spiders.”</p><br/><p>Diane also gave a wry smile and whispered, “The True God Kara will protect my soul.”</p><br/><p>Rody pursed his lips and cursed, “Pray to your God only after you’re dead and buried in the ground!”</p><br/><p>Diane raised her eyebrows but before she could speak, a cold voice came from behind. “Lord Duke. You seem to be enjoying yourself at my place.”</p><br/><p>When Rody heard the voice, he turned around and was shocked.</p><br/><p>Rody saw Wuya’s white figure slowly approached from behind him. Wuya was covered in a white ball of light. He slowly walked into the group of spiders. The spiders acted as if they had encountered their worst enemy. Wherever Wuya went, they would retreat to avoid him. They did not dare approach the white light around his body. Occasionally one or two spiders would get too near. Before they could actually touch Wuya, they would come into contact with the white light. Immediately, the spiders would hiss as they were burned to ashes by a white flame.</p><br/><p>Wuya was like a flame moving in the snow. Wherever he went, the snow would melt. As he slowly approached, he had casually swept the numerous groups of spiders to clear out a path.</p><br/><p>Wuya slowly stood in front of Rody. The surrounding groups of spiders stayed a few meters away. Wuya then looked at Rody without expression and lightly said, “Lord Duke. Please come with me.” After that, he glanced at Diane, who was beside Rody.</p><br/><p>Wuya did not mention anything about Rody sneaking into his room nor did he rebuke or interrogate Rody. Rody showed an embarrassed expression. He supported Diane and immediately followed Wuya.</p><br/><p>Gradually, they used the road they came from to go back to the open space at the end of the canyon. They had arrived at the cave exit used by Rody and Diane earlier.</p><br/><p>The spiders initially followed closely from behind. However, once they reached the end of the canyon, they seemed to have bumped into an invisible wall. They stopped there and did not step out of the canyon.</p><br/><p>“Those spiders… what happened?” Rody could not help but comment, “It looks like they only dare remain at the canyon.”</p><br/><p>Wuya turned around and glanced at Rody. “Lord Duke, you think this is strange? Let me tell you why.” He then stretched out his hand, opened his palm and shot out a flame from the middle of his palm. Wuya then gently shook his hand and that flame flew out and landed in the middle of the group of spiders. The spiders were shocked and immediately scattered. In the rush of the spiders, some were pushed out of the dense fog in the canyon... and an extremely strange scene appeared in front of Rody.</p><br/><p>The few spiders that were pushed out of the dense fog barely had the chance to crawl back in before their body stopped. The spiders' bodies gradually petrified starting from its legs and within a short moment, they had turned to stone.</p><br/><p>“Has Lord Duke seen it clearly?” Wuya smiled and asked. However, the smile was indifferent and did not have a single trace of emotion.</p><br/><p>Rody opened his mouth to take a few deep breath before he replied, “Abnormal! Everything here is abnormal!”</p><br/><p>Wuya nodded. “Well said.” He then paused and said softly, “Let’s go.”</p><br/><p>Diane then asked, “Go where? The cave is on the right!”</p><br/><p>Wuya gave a smile and replied, “Cave? I did not say we are going to the cave, nor did I say that we are going back that way.”</p><br/><p>Rody’s expression changed and he asked, “Chief Wuya, what did you say?”</p><br/><p>Wuya looked at an open space in the distance and lightly said, “Weren’t you interested in this place, Lord Duke? Since you have put in so much effort to come here, you might as well go in and take a look. Just as well, I have recuperated for so many days and had planned to go to this ‘Summit of Evil', to take a good look inside. What is in this restricted area of Kara?”</p><br/><p>Wuya showed a strange gaze as he finished speaking.</p><br/><p>Andy’s voice suddenly reached Rody, “Boy, have you noticed? He seems… he seems to have become younger. He seems to have reverted to when we first saw him.”</p><br/><p>Wuya glanced at Rody and Diane before he lightly said, “Since all of us are interested in this place, we might as well go in together. Lord Duke, Do you agree?”</p><br/><p>Do I agree?</p><br/><p>At this moment, is it possible to disagree?</p><br/>\n</div>"}