{"title": "Chapter 127: Powerful Domain", "id": 127, "volume": 2, "url": "http://boxnovel.org/masked-knight-chapter-127-powerful-domain", "volume_title": "Volume 2", "body": "<h1>Chapter 127: Powerful Domain</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 127: Powerful Domain</p><br/><p>Translator: Zenobys Editor:</p><br/><p>“You don’t believe me?” Sky seemed greatly insulted. He suddenly raised his voice and cried out, “ I am Sky! Who do you think I am? Why should I lie to a boy like you? You wait!”</p><br/><p>Before Rody could speak, Sky swung his arms. Rody then felt himself being thrown back by a powerful force. He crashed hard onto the ground. Sky put both his hands on his chest and suddenly a human shadow appeared. The shadow looked as if his body had been enlarged several times. Rody felt his body shake. It was as if a powerful force had distorted the space in front of him. The powerful force was like a large and invisible hand, violently tearing Rody’s body. Suddenly, his body stiffened, and he was unable to move his whole body, not even a single finger. He could feel a severe pain all over his body and could feel like his heart was being torn to pieces. He could not help but groan in pain and almost spat out a mouthful of blood.</p><br/><p>Sky then suddenly said, “Ah! I forgot that your strength is too weak and cannot withstand my domain.” He then shot out a light to cover Rody. Rody suddenly felt that the powerful force that was tearing his body apart had suddenly disappeared. He breathed heavily and felt like collapsing. At that time, Andy, who had been cut off, suddenly spoke in his mind. “Domain Force! Boy! This is domain force!”</p><br/><p>Andy continued to shout, “This guy is really a top ranked practitioner! He has already obtained ‘Domain Force’!”</p><br/><p>“Shut up, Andy!” Rody could not help but reply in a soft voice. “Why didn’t you say anything earlier?”</p><br/><p>Andy helplessly replied, “This stupid cavern has a boundary. All my magic does not work properly here! Our connection also relied on the magic in your mask. However, as a result of that fatty’s ‘Domain Force’, the boundary was broken.</p><br/><p>Rody took a deep breath. He looked at Sky not far from him and showed a complicated expression. “Is this really the ‘Domain Force’?”</p><br/><p>At that moment, Rody felt as if he had returned to the time when he was just a low ranked warrior in the Imperial Capital. The time when he saw Master Autumn's display of swordsmanship and exclaimed in astonishment. In the past six months, his strength had grown so much and he even became famous in the Northwest Region. As a high ranked warrior, he was already considered a master in the eyes of the ordinary people. Even if he encountered high-level practitioners like the Black Veil Saint, Rody believed that he would at least have the strength to fight back even if he could not win.</p><br/><p>However, the moment he saw Sky summon a ‘Domain Force’, Rody felt extremely powerless. That made him feel empty and uncomfortable. When he was facing Sky, he was just an extremely low leveled practitioner. A master of ‘Domain Force’ could easily kill him by just lifting a finger. Just now, Sky only made some motions and he was almost killed by the pressure from the domain force.</p><br/><p>Sky's entire body was covered in a flaming aura. The flaming aura was far more vibrant compared to Rody's ‘Holy Light'. Besides that, the flame was also pure silvery white. The white flame flickered and Sky’s entire body emitted an extremely strong power. His fatty image had disappeared and was replaced by a proud looking world's greatest master.</p><br/><p>There was a continuous rumbling sound as the stones on the floor broke into pieces. The large boulder also could not withstand Sky’s 'Domain Force' and was broken into pieces.</p><br/><p>There were countless pebbles that quietly floated above the ground and were suspended in midair. There was a strange formation as Sky stood in the center with many dazzling gems surrounding him. It was like he was surrounded by a strange battle formation.</p><br/><p>Sky suddenly looked up and shouted. Rody felt a violent quake that rammed his body. His ears suddenly felt a very sharp pain and Rody could not help but cover his ears.</p><br/><p>Sky continued his shouts as he raised one of his legs and he forcefully stomped on the ground...</p><br/><p>The whole cave trembled from the impact. The stone bells which were at the ceiling of the cavern started to fall down. Sky's loud laughter filled the cavern and he shouted, “Come out!”</p><br/><p>Sky once again forcefully stomped his foot on the ground. The cavern vibrated incessantly. Rody was unable to stand firmly. He staggered and held on to a boulder beside him for support.</p><br/><p>Suddenly, Rody heard a roar coming from the abyss. A huge wave of magma splashed ten meters high from the abyss. The red magma had splashed all over. The high waves of magma splattered at the surrounding boulders and they started to emit black smoke.</p><br/><p>Waves after waves of magma continued to be tossed up. The waves became more and more vicious. Suddenly, there was a resounding long howl in the cavern. A huge figure separated the waves and jumped out of a pool of magma. It then landed heavily on the ground, right in front of the Abyss.</p><br/><p>When the figure jumped up, he spilled a bit of magma which emitted a sizzling sound.</p><br/><p>The huge figure had a long neck and a massive head. It opened its big mouth and roared loudly. Then it lowered its head. Its two red eyes glared at Sky as it continued to growl angrily.</p><br/><p>Rody opened his mouth wide as he watched the confrontation between Sky and the huge monster. “Is this the legendary Mystic Dragon?”</p><br/><p>The Mystic Dragon really lived up to the name of ‘dragon’. Its heavy body had a long tail. The long tail was spiky like a meat tenderizer. Its huge body was covered in black scales, with a pair of large wings on its back. It breathed heavily and brought along waves of violent wind. On its large head was a sharp horn. Unlike the rest of its body, the horn was white. It stood on two legs and brandished its claws at Sky. It also opened its mouth to breathe out fire.</p><br/><p>The Mystic Dragon was much bigger than the large snake that Wuya had transformed into. However, Rody had some doubts. That was because he could not see any differences between the legendary Mystic Dragon and an ordinary dragon described in books. Was this really the Mystic Dragon that once challenged the Gods?</p><br/><p>“Idiot! Don't tell me that you cannot see?” Andy could not help but call out.</p><br/><p>“What?”</p><br/><p>“Where is the dragon standing right now? It is standing right in front of that fatty! It is standing inside the ‘Domain Field’, but the ‘Domain Field’ doesn’t seem to affect him at all.</p><br/><p>Rody then realized and understood.</p><br/><p>Under the powerful strength of the 'Domain Force', the surrounding several meters high boulders had all broken into pieces. The whole cave was also shaking. The dragon ignored all that and brandished its claws as it slowly approached Sky. However, as it breathed out fire, it vigilantly observed Sky. It was apprehensive of Sky and it did not immediately charge forward.</p><br/><p>“Be careful, this guy is getting angry.” Sky suddenly shouted.</p><br/><p>Sure enough, the giant dragon suddenly flapped its wings violently. It caused two, huge, wind blasts which were like the sharp edges of a knife as it slashed out in all directions. Even the huge boulders were shattered into bits.</p><br/><p>The two blade-like wind blasts charged towards Sky and he coldly said, “This trick again!” Sky stretched out one of his hands and a solid-looking light shield appeared. That shield was completely different from the light shield that Rody formed with his fighting energy. That shield was not just sparkling but was solid as well, like a crystal.</p><br/><p>Andy whispered, “This is the ‘Energy Transformation’ that was once stated by Master. This 'Domain Force' master can really do it!”</p><br/><p>There was a loud sound that made Rody feel dizzy. The two blades collided against Sky’s shield. The collision caused the surrounding walls and gems to break into pieces. The Mystic Dragon lowered its body, stretched its neck and opened its mouth. After that, the dragon breathed out a crimson flame.</p><br/><p>Sky then shouted, “I will block it!”</p><br/><p>The shield in his hands magically became larger. It became large enough to hide the whole of Sky’s body behind it.</p><br/><p>The crimson flames splashed on the shield. Sky’s body seemed to flash. Although his body did not move, it was as if he was being pushed back by an invisible force. The ground at his feet also started to crack.</p><br/><p>The Mystic Dragon roared and continued to breathe out flames.</p><br/><p>Sky’s body shrunk behind the shield and then he shouted again, “I’ll block! I’ll block! Sh*t! I will block!”</p><br/><p>After breathing out flames about ten times, the dragon started to become exhausted. Its imposing aura also started to grow weaker. The stones on the ground surrounding Sky had all been charred. Sky then laughed heartily. \"Haha! Big lizard, are you out of breath? Now, let me teach you a lesson!\"</p><br/><p>The large shield in his hands transformed into a long giant hammer. Sky then sprang up from the ground and instantly jumped in front of the Mystic Dragon. He then hammered the Mystic Dragon's head.</p><br/><p>The earth shook.</p><br/><p>Rody was amazed to see Sky move at a speed his eyes could not follow. Sky appeared just below the Mystic Dragon’s nose. He then saw Sky ruthlessly hammer the Mystic Dragon’s head.</p><br/><p>Even though Sky was huge and fat, he was much smaller in comparison to the Mystic Dragon. It was like a tall and fat mouse standing beside a lion. Besides that, the giant hammer was only like a toothpick to the Mystic Dragon.</p><br/><p>Have you ever seen the effect of a person being hammered by a 'toothpick'?</p><br/><p>A huge black figure flew out and crashed into the wall. The impact caused the cavern to shake violently. At that moment, Rody almost thought that the cavern would collapse.</p><br/><p>The large Mystic Dragon was sent flying by a ‘toothpick’!</p><br/><p>The Mystic Dragon then stood up from the ground and shook its head. It roared at Sky in anger. Sky felt proud of himself and laughed heartily. “Big lizard, was it comfortable, just now? Haha...”</p><br/><p>However, that time Sky had laughed too early. He saw a shadow flashed by as the Mystic Dragon swung its tail. Sky was struck mercilessly. Before he could even cry out, he flew out and crashed into two boulders.</p><br/><p>Sky felt like a fly being hit by a fly swatter.</p><br/><p>Sky shouted as he climbed out of the pile of gravel. He then shouted angrily, “Good one! You actually learned how to bluff! Prepare to be punished!”</p><br/><p>Even without reciting any incantation, the stones on the ground started to float. When Sky waved his hand a countless number of stones severely pelted at the Mystic Dragon. There were big and small stones.The small stones were the size of an egg while the big ones were the size of several people.</p><br/><p>The sound of the stones pelting the Mystic Dragon could be heard. The Mystic Dragon received concentrated pelting from the stones. Although the stones could not smash through the thick scales of the Mystic Dragon, it was enough to make the dragon roar in pain.</p><br/><p>Sky seemed like he was addicted to it. He kept waving his hand to pelt more stones onto the Mystic Dragon. As he did that, he laughed.</p><br/><p>As Rody continued to watch the scene, he heard Andy whisper in his mind, “Boy, did you see that? This guy does not use any skills or magic to move the stones. Although this could be done with magic, he would need to chant an incantation. It would absolutely not be as easy as the way he did it!”</p><br/><p>Rody’s eyes lit up as he asked, “Andy, what happened? Is this because of the so-called 'domain'?”</p><br/><p>Andy whispered back, “Boy, this is indeed the 'domain'. Once a person obtained the strong domain, his energy would surpass all the other practitioners. More importantly, they would be considered close to the existence of God.” Andy paused for a moment before continuing. “The so-called close to the existence of God meant they could create a ‘domain’ with their own abilities. Everything in this ‘domain’ would obey the commands of the master of this 'domain'. In this ‘domain’, the master is God! He would easily be able to do anything in his 'domain'!”</p><br/><p>Rody’s heart started to race and his depression was swept away. He had a new intention as he watched Sky playfully fight back the Mystic Dragon. He could not help but loudly say, “Andy! I have decided! I definitely want to obtain a powerful 'domain'!”</p><br/><p>Andy was silent for a moment and then he laughed bitterly. “This won’t be so easy! Don’t you know that all the people with powerful domains were all mythological figures? The Empire had not even seen one in centuries. To be able to reach the rank of 'Sacred Swordsman', which is similar to that of Black Veil Saint is already at the top!”</p><br/><p>“Oh?” Rody gave a stubborn expression.</p><br/><p>Andy sighed and continued, “Do you know this? According to the legend, those people with powerful domains were all strong people that showed disdain for the world and were never defeated!”</p><br/><p>Unfortunately, the moment Andy finished that sentence, the person, in front of him, with a powerful domain exhibited a shameful situation.</p><br/><p>The Mystic Dragon was beaten until it was furious. Suddenly, it roared and breathed out its crimson flames.</p><br/><p>That time the flames were more ferocious than the previous ten times. Sky was caught off guard and could not take out his shield in time. He was hit by the flames head on. He screamed as his body turned into a huge fireball and flew away.</p><br/><p>Rody was stunned and could not help but murmur, \"This… he seems to have lost.\"</p><br/><p>Andy angrily cursed. “Idiot! His opponent is the Mystic Dragon!”</p><br/><p>“Well, in my opinion, the Mystic Dragon is not that great. It does not seem to be much stronger than Wuya!”</p><br/><p>“Bullshit! If it was that giant snake, when it stands in that powerful domain, it would have shattered into pieces before the battle started!” Andy shouted hatefully. “Also.... Ah! Be careful!”</p><br/><p>The Mystic Dragon had finally noticed Rody. It suddenly roared and then it breathed fire out at Rody.</p><br/><p>“Don’t block! Quickly run!” Before Andy had even finished speaking, Rody had already jumped away. Although he was weaker than the Mystic Dragon, he was still quite agile. When Rody jumped out of the way, he saw the location he was standing at was already charred.</p><br/><p>“It just breathes out flames! What is so special about it?\" Rody rolled on the ground and stood up.</p><br/><p>“Idiot! It is not an ordinary flame! It is a dragon’s breath! If you even just touch it, your whole body will be burned to ashes! You… be careful!”</p><br/><p>When the Mystic Dragon saw Rody avoided its attack, it flapped its wings to create a gust of sharp wind. Rody felt a powerful aura charge at him. However, at that moment, he felt his body turn stiff and he could barely move. It was as if his whole body was being wrapped in a powerful aura.</p><br/><p>He fiercely bit his tongue. The sharp pain stimulated his alertness, but it was already too late to dodge. He used both of his hands to summon a light shield from his ‘Holy Light’.</p><br/><p>After that, there was a loud sound as Rody’s shield was crushed. His body then flew out and crashed into the walls of the cavern.</p><br/><p>Rody felt like every single bone in his body was broken and he could not even move a finger. After coughing out a few mouthfuls of blood, he felt a trace of pain in his chest while the rest of his body had turned numb.</p><br/><p>“Sh*t! Such power! It is much stronger than those huge monsters…” Those were Rody's last thoughts before he fainted. Just before he fainted, he vaguely saw a figure popped out of the gravel and shot towards the Mystic Dragon. The figure was surrounded by a silver aura. The silver figure was like a shooting star, holding a long flaming sword.</p><br/><p>The large and small figures collided at each other and then Rody closed his eyes. He heard the continuous roars of the Mystic Dragon and then thought to himself. This place will not collapse, right?</p><br/>\n</div>"}