{"title": "Chapter 122: Wuya’s True Colors", "id": 122, "volume": 2, "url": "http://boxnovel.org/masked-knight-chapter-122-wuya%E2%80%99s-true-colors", "volume_title": "Volume 2", "body": "<h1>Chapter 122: Wuya’s True Colors</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 122: Wuya’s True Colors</p><br/><p>Translator: Zenobys Editor:</p><br/><p>Rody pulled Diane along and followed Wuya as closely as possible. He had just seen a small bird perched on a flower. That flower which was as large as a bowl suddenly closed up, as if it was a mouth swallowing the bird. After that, they no longer dared to approach those strange plants.</p><br/><p>Wuya had already told them their destination. It was at the center of the forest.</p><br/><p>Legend said that in the center of the forest, there was a tree. The tree was as large as a small mountain and was tall enough to reach the skies. However, the tree could not be seen until one had reached the foot of the tree. That tree was the gate to the ‘Summit of Evil’.</p><br/><p>Wuya said those words with a grave expression. His words did not sound very natural. Wuya then smiled and lightly said, “This is something I just heard about. I have never entered this place before.”</p><br/><p>Wuya then glanced at the pale-faced Diane and coldly said, \"For the situation in this area, perhaps that little girl from the Silvermoon Clan might know more? I know that her clan has lots of legends about this place. Isn’t that right?”</p><br/><p>Diane then coldly glared at Wuya as she accused, “Is obtaining those ancient records the reason you exterminated our clan?”</p><br/><p>Wuya stared at Diane for a while and then continued to walk forward without answering.</p><br/><p>It was not easy to travel in that dense forest as there were no paths. Lush plants constantly blocked the way forward. When Rody entered the mountain, he had seen how the mountain people traveled through the mountain forest. Usually, one of the mountain people would carry a machete and lead the way. As he walked ahead, he would swing his machete left and right, clearing the branches and bushes that blocked the way and create a path.</p><br/><p>However, Wuya did not need to do that. As he strode in front, his body emitted a white light. All the plants that touched the white light would immediately wilt. There were also some plants that were immediately pulverized. Thus, as Wuya went by, he would create a path behind him.</p><br/><p>This kind of superb cultivation made Rody and Diane exclaim in astonishment. However, Andy reminded Rody to be careful. This Wuya had been here before. Despite his incredible strength, he had to retreat in defeat. We still do not know what was the strange spell that caused him to age rapidly...</p><br/><p>“Stop!” Rody suddenly shouted and pulled Diane to a side.</p><br/><p>Wuya, who was in front, glanced at Rody with a knowing look. “Lord Duke. You noticed too?”</p><br/><p>Rody replied, “Yes!”</p><br/><p>Diane frowned and then asked, “Notice what?”</p><br/><p>Rody shook his head and replied, “An hour ago, I already had a strange feeling. I felt something was staring at us.”</p><br/><p>Diane shrugged her shoulders. She immediately looked around and trembled before saying, “Don’t talk nonsense! Where is it?”</p><br/><p>Rody closed his eyes and whispered, \"It's definitely there somewhere!\"</p><br/><p>Wuya also nodded and said, “As expected of someone who fought against thousands. You are really sensitive. I also noticed it, but you were faster.”</p><br/><p>Diane gritted her teeth and asked, “What is it?”</p><br/><p>Rody did not reply and coldly looked at Wuya. Wuya shook his head and replied in a low voice, “Don’t look at me. I don't know either.”</p><br/><p>Just as soon as Wuya finished saying that, a howl from the forest suddenly pierced the air. Following that howl, more howling sounds came from all directions as if they were responding to one another.</p><br/><p>All of them turned wary. They then heard the sound of a muffled rumbling, and the ground seemed to shake. Another faint muffled sound was heard, and then all the surrounding plants started to tremble.</p><br/><p>“What is that?” Rody looked around vigilantly.</p><br/><p>The rumbling sounds did not stop, and the vibrations of the earth became more and more violent. The sounds came from all directions and they seemed to be getting closer.</p><br/><p>“What is approaching us now?” Diane turned pale.</p><br/><p>Wuya took a deep breath, put his hands together and closed his eyes. From his body, a huge and transparent shadow rose. The shadow was several times his size. It was as if Wuya himself had become a phantom several times larger. The large image of Wuya suddenly opened its eyes, and they shot out a brilliant ray of light. After that, the shadow dissolved revealing Wuya still standing at the same spot. He then opened his eyes and said, “I saw it. It is a ‘Fenrir’.”</p><br/><p>Before Rody could speak, Diane had already turned pale.</p><br/><p>“What is ‘Fenrir’? What does it mean?”</p><br/><p>Diane whispered, “In the language of our Silvermoon Clan, Fenrir means gigantic monster.”</p><br/><p>“Gigantic monster? What gigantic monster?” Rody continued to ask loudly. Suddenly, there was a loud rumble, and a large tree in front crashed not far from them. It was then accompanied by a long howl. A huge figure then appeared in front of the three of them.</p><br/><p>“Gigantic… gigantic monster?” Rody was stupefied looking at the large monster.</p><br/><p>That monster had a height of over ten meters, a ferocious face, and long messy crimson hair and beard. Behind the monster was a scaly dragon tail. Its colossal body was wrapped with what looked like some broken armor. Wherever that giant monster treaded on, it crushed out an open space. It carried a large hammer in its hands and was looking straight at Rody and the others.</p><br/><p>The monster howled loudly and swung its hammer. The hammer shot out a fierce gust of wind as it smashed towards the three of them.</p><br/><p>“Run!” Rody shouted as he pulled Diane to the side.</p><br/><p>There was another large rumble. A tree was swept down at the location where the three of them had initially stood. The hammer had slammed ferociously onto the ground and created a deep crater. The earth shook. Rody staggered and was unable to keep his balance. He fell while holding Diane, and they both tumbled to the ground.</p><br/><p>Rody felt and heard another gust of fierce wind. A huge shadow fell from the sky. The hammer had started swinging downwards.</p><br/><p>Rody held Diane on the ground and roared loudly. His fighting energy burst out. It was as if his body had become a golden light. He exhausted all the energy in his body and lifted the dagger in his hand towards the falling hammer.</p><br/><p>There was a loud explosion as the golden fighting energy repelled the black hammer. Rody spat out blood, and the dagger in his hand also broke apart.</p><br/><p>The giant monster also roared loudly. It once again raised its hammer and smashed down at Rody.</p><br/><p>Diane responded immediately and pulled Rody along. She ran away as swiftly as an arrow and jumped onto a tree a short distance away. But the violent quake caused by the hammer when it smashed on the ground caused both of them to fall off the tree.</p><br/><p>When they fell, Diane landed on Rody, causing him to cough out more blood.</p><br/><p>Wuya shouted from afar, “Quickly run! Run to the middle of the forest! Do not turn back!”</p><br/><p>Diane struggled to pull Rody up and they ran away in terror. She heard Wuya’s voice, followed by a burst of fire being shot into the sky. After that, there was a roar and the gigantic monster fell down crushing several trees. In a hurry, the two of them had not taken any precaution. When that gigantic monster fell, it dropped its large hammer right in front of Rody and Diane.</p><br/><p>The impact caused both Rody and Diane to fall. They noticed that the shaft of the hammer was as broad as a person’s waist.</p><br/><p>They then looked back and saw a shocking scene.</p><br/><p>That snake with ten heads was in the distance. Its ten heads were stretched out, bobbing about. Its large body had already crushed the surrounding small patches of trees. The large snake hissed loudly and started to breathe out fire.</p><br/><p>Lying on the ground was the gigantic monster whose body was charred. Its body kept trembling as it struggled to get up. More roars could be heard, and several more strange creatures crushed the surrounding trees and approached from a distance.</p><br/><p>The large snake held its position. Its ten heads rose up and hissed in protest at the approaching strange creatures.</p><br/><p>The large monsters all raised their heads and roared back angrily. One of the monsters swung its hammers and struck one of the snake's head. The head fell down sideways and crashed into a tree. However, another of the snake's head struck the large monster's chest. The large monster roared, staggered backward and fell.</p><br/><p>The remaining large monsters approached in big strides. The heads of the snake opened their mouths and breathed out fire. One of the large monsters used its hand to ward off the flames. It then gave an earthshaking shriek before it fell, right onto the snake’s body.</p><br/><p>The snake hissed in pain as another hammer came down. It smashed into the snake’s body, causing a loud impact sound. Some of the snake’s rigid scales immediately broke, and the snake rolled on the ground in pain. It then wrapped its body around the large monster. Both the snake and the large monster fell down and twisted together. The roar of the monster and the hissing sounds of the snake did not stop as they fought.</p><br/><p>One of the large monsters dropped its hammer and used its hands to seize the tail of the snake. It struggled to separate the snake from the body of the other large monster. However, it did not take precautions against a snake head that breathed fire out into its face.</p><br/><p>That large monster screamed. Its crimson haired face was immediately burned. Releasing the snake’s tail, it used both its hands to cover its face and continued to scream. It then staggered aimlessly towards Rody and Diane.</p><br/><p>Rody and Diane exclaimed and frantically escaped. The large monster clutched its face and could not see anything. It then tripped over the body of its collapsed companion and crashed.</p><br/><p>Rody and Diane continued to exclaim and retreat. They saw a huge shadow falling towards them. Even though they were already running frantically, the large shadow was getting closer... With a loud bang, the large monster fell right in front of them.</p><br/><p>Both of them thumped on the ground, feeling extremely exhausted.</p><br/><p>Diane suddenly shouted, “Wuya! Where is Wuya? Shouldn’t that snake be in that cave? How did it appear here?”</p><br/><p>Rody showed a strange expression and then said softly, “Do you still not understand? That huge snake… is Wuya!”</p><br/>\n</div>"}