{"title": "Chapter 126: History’s Strongest Fatty", "id": 126, "volume": 2, "url": "http://boxnovel.org/masked-knight-chapter-126-history%E2%80%99s-strongest-fatty", "volume_title": "Volume 2", "body": "<h1>Chapter 126: History’s Strongest Fatty</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 126: History’s Strongest Fatty</p><br/><p>Translator: Zenobys Editor:</p><br/><p>Walking down the passageway, Rody saw the exit in front. However, Rody did not know what he would find the moment he walked out. Would it be a sleeping dragon or something else?</p><br/><p>Rody took a deep breath and slowly walked out. The moment he stepped outside, he immediately felt like he had hit an invisible whirlpool. His body involuntarily bounced a few steps back.</p><br/><p>“Huh?”</p><br/><p>“Boy, be careful. This looks like a boundary!” Andy warned vigilantly.</p><br/><p>Rody took a deep breath and concentrated as he started to walk out again. He then felt a force assaulting his body. He tried to push himself forward and felt as if he was facing the wind. He also felt like he was wrapped by a layer of warm water, and that feeling was very comfortable.</p><br/><p>Andy called out in his mind, “This boundary is weird… boy, you…”</p><br/><p>The voice in his head stopped as if a knife had cut away Andy's voice. Rody suddenly felt the force holding him vanish. He felt himself plunge forward a few steps and thus entered that cavern.</p><br/><p>Taking a good look, he noticed that this cavern looked similar to the cave he was in when he was attacked by the large snake. However, this cavern was a little bit bigger. The cavern was full of large and small boulders. The first thing that Rody saw in front of him was a pile of gems that were piled up like a mountain in the cavern.</p><br/><p>The mountain of gems emitted a dazzling light and almost blinded Rody. He quickly looked away and did not dare to look directly at the gems. When he turned his head, he immediately saw that at the distant edge of the cavern was not a wall, but rather a gap. It was a Gate to the Abyss.</p><br/><p>After that, Rody heard a faint roar and could not help but walk forward. Standing in front of the abyss, he looked down. With that look, Rody could not help but breathe in the cold air.</p><br/><p>He gazed into the abyss and found crimson magma surging turbulently. The magma was not throwing out flames. Instead, it was raging, back and forth, and emitting traces of smoke.</p><br/><p>“Strange…” Rody could not help but murmur. “The magma is just underneath but why is it not hot standing here?”</p><br/><p>Rody thought to himself and called out to Andy but he did not get any response. Rody started to feel uneasy and repeatedly called out to Andy. However, there was still no response.</p><br/><p>Shit! Is this because of that boundary?</p><br/><p>Rody nervously looked around. However, this was a dead end. Other than the gap he entered from, there were no other exits. The ceiling had some strange stone bells, hung upside down, and glimmering faintly. The surrounding wall was also full of large gems. The whole cavern was like a legendary storage for treasure.</p><br/><p>“Hey!” Rody shouted, “Is anyone here? Whether you are a person or a beast, answer me!”</p><br/><p>“Is there anyone here?” Rody whispered, “Anyone here? What about that dragon?” Rody suddenly looked back at the abyss and thought, Maybe the Mystic Dragon is in that abyss… Maybe, it is really hiding inside that blazing hot magma.</p><br/><p>Rody thought for a moment and walked back to the abyss. He then picked up a stone and wanted to drop the stone into the abyss.</p><br/><p>Rody stretched his hands out but just before he dropped the stone, he heard a languid voice behind him.</p><br/><p>“I would not do that if I were you!”</p><br/><p>Rody looked back and saw a person, lazily half-lying down on a boulder.</p><br/><p>“Who?” Rody discarded the stone and walked towards the man behind him. However, he was vigilant. There was no one on that boulder earlier. Where did he suddenly come from?</p><br/><p>That man stood up on the boulder and stretched his waist. After that, he loudly said, “Interesting. After so long, someone has finally come down here. How come that lion let you in? Did you defeat him?” He looked at Rody for a moment. After that, he shook his head and said, “No, you are not strong enough. You definitely would not be able to defeat that old lion… Hey, how did you come in here?”</p><br/><p>As he spoke, the man jumped down from the boulder. His body was like a goose that slowly floated down and stood in front of Rody.</p><br/><p>He then looked at Rody and smiled. “Hi! My name is Sky1. Who are you?”</p><br/><p>Rody stared at the person in front of him. The man had just jumped down from a boulder that was seven to eight meters high. Instead of falling, the man floated down like a leaf. That already stunned Rody.</p><br/><p>However, such gracefulness did not suit Sky’s chunky appearance.</p><br/><p>Rody did not want to say that he was too fat, but he was like some animals who only knew how to eat and sleep. In fact, pigs were thinner compared to him. His two short legs were like tree stumps and his waist looked like a bucket. His neck was so short that it was almost hidden. His head was large enough to make others ignore his obese body. Rody swore to God (even though he never believed in God) that he had never met anyone whose head could be so big.</p><br/><p>His face was flat like the bottom of a cauldron. His pair of eyes were so small that people could barely notice them as they just looked like two thin cracks. As for his nose, one could barely recognize it as a nose. It was as if his nose had caved in after being punched and only two holes remained for respiration.</p><br/><p>His mouth was so wide that it was scary. Rody was sure that if the man laughed, his smile would reach from ear to ear.</p><br/><p>It was amazing for such an extremely fat person to have such a light and graceful movement. Rody found it hard to comprehend because he could not imagine an obese person, the size of seven to eight pigs combined, casually floating in the air.</p><br/><p>“My… my name is Rody,” Rody froze for a moment before saying his name.</p><br/><p>Sky carefully looked at Rody and laughed. “Boy, how did you get in here? You spoke in the Protoss language, then you must be a descendant of Protoss, right? Good! The ones I hate are Kara’s people. You are not one of Kara’s people! Very good!” As he spoke, the man circled around Rody and then he pulled Rody by his hand and led him to a mountain of gems.</p><br/><p>Rody felt like a helpless puppet being pulled by Sky. He heard Sky laugh. “Boy, I have not met anyone for many years. This is very good! Take any gem you like. Consider them my gift to you!”</p><br/><p>Rody finally recovered from the shock. He broke away from Sky’s grip and retreated a few steps. He then asked, “What are you? Are you a human or… are you that Mystic Dragon?”</p><br/><p>Sky froze for a moment before he laughed out loud. He laughed as if he had just heard the most ridiculous joke ever. He pointed at Rody and gasped for air, “Did you said that I am the Mystic Dragon? Do you actually think that I am that reptile? Do I really look like that overgrown lizard?”</p><br/><p>Before Rody could reply, Sky stopped laughing and raised his neck. “Don’t compare me to that overgrown lizard! I am a real human! I am a human like you!” At that moment, the fatty lowered his voice and showed a puzzled expression. He then said to himself, “Huh? Am I really the same? It seems like there are some differences. Humans cannot live for a few hundred years… does that mean I am not human? Ah, this question gives me a headache!”</p><br/><p>Rody exclaimed. “A few hundred… A few hundred years? Did you just say that you have lived for a few hundred years?”</p><br/><p>Sky responded, “Of course. I have been in this cave for a few hundreds of years, and I am still not dead!”</p><br/><p>Rody’s mouth hung open and he thought to himself, Monster! Monster! Another monster! Why do I keep encountering monsters that are several hundred years old?</p><br/><p>“Then… how did you survive these past few hundred years? What have you been eating and drinking? Why are you here?”</p><br/><p>Sky pursed his lips and replied, “What did I eat or drink? Hmph. Once you have reached my level of skill, there is no need for those things. As for why I am still here, you must first tell me the reason you are here.”</p><br/><p>Rody gave a wry smile. He understood that this man had been in here for several hundred years and was not able to talk to others in an orderly way. Rody thought for a moment and told Sky about what had happened to him. When Sky heard the story, he became high spirited. When he heard about Wuya fighting Sphinx, he showed a curious expression and asked, “Really? That large snake was really fighting that old lion and it was hard to determine the winner? It seems like that snake’s cultivation was also quite good...”</p><br/><p>Rody kept quiet and looked at Sky. Sky then asked, “In that case, why did you come here? Ah, it must be to kill the dragon. Am I right? I know a lot of people who had nothing better to do than to look for trouble and try to kill the dragon. They just want to show off. However, your strength is too weak. You will not be able to fight that dragon…” Sky carefully looked at Rody again and murmured, “No, you cannot. The difference is too big. The dragon’s flames will burn you to ashes... Your fighting energy will be of no use. You have not practiced how to condense the air. You do not even have the abilities to escape... Terrible...”</p><br/><p>Rody could not help but frown, and he asked, “What about you? Why are you here?”</p><br/><p>Sky laughed and replied, “Me? Last time, I had heard of this legendary place and came here out of curiosity. I had also encountered the spiders and the large monsters outside. They were interesting but were too weak. The lion at the entrance was no threat to me. In the beginning, he was guarding the gate and did not want to let me in. He insisted that I get him someone’s blood. I was impatient and beat him up until he cried for mercy. After that, I forced my way in.”</p><br/><p>“You beat up Sphinx until he cried for mercy?” Rody looked at the fatty in front of him. Sky certainly did not look like a master...</p><br/><p>Sky’s eyes grew wide and exclaimed, “You do not believe me? Haha, very simple. Let us go out right now and I will beat up the lion in front of you.”</p><br/><p>Rody gulped. He felt like everything he had encountered that day were all inconceivable things. Right now, the large snake that had cultivated for a 1000 years could not deal with that lion. Sh*t! Both of them were legendary Mythical Beasts. However, the fatty in front of him said he could make the Sphinx cry for mercy.</p><br/><p>Sky then became dejected and sighed. “Although I came in here, I did something wrong… I heard that there is a Mystic Dragon here. I wanted to see how powerful was that legendary figure who could challenge the Gods. As a result, I forced my way in, but something bad...”</p><br/><p>Rody became frightened and asked, “Did the Mystic Dragon escape?”</p><br/><p>“Of course not!\" Sky glared at Rody and continued, \"I am here. How could it escape?\" He paused for a moment and his face showed a helpless expression. \"That reminds me, it makes sense why the lion did not want to let me come in here. According to the lion, the blood of two different clansmen must be offered and an ancient spell must be chanted to revive the Mystic Dragon and restore its power. Unfortunately, I was impatient. I did not know how to chant the spell, and I did not even know where to find Kara's clansmen...Kara's clansmen had supposedly gone extinct a 1000 years ago. Where was I supposed to find them? That was why I had no choice but to force my way in.”</p><br/><p>“What was the result?”</p><br/><p>Sky gave a wry smile and said, “The result was that the Mystic Dragon had been revived but… not quite…” Sky sighed and continued, “Legend says that the Mystic Dragon was strong enough to challenge the Gods. However, if it was not revived the proper way, it would not be as strong and would only be a Mythical Beast without a sense of self.”</p><br/><p>Rody felt his heart jump wildly and could not help but ask again, “So… you revived it?”</p><br/><p>Sky gave a wry smile and replied, “Yes, revived…”</p><br/><p>Rody could not help but whisper, “Oh my God… You really revived it… Who are you? Don’t you know the consequences of reviving the Mystic Dragon?”</p><br/><p>Sky shook his head and replied, “What consequences? I have been here for hundreds of years doing nothing but sleeping. When I was awake, I would ask the dragon for a fight as a form of exercise... I didn’t feel anything wrong.”</p><br/><p>“Just to fight... as a form of exercise?” Rody’s expression looked like he had just been cut by a knife.</p><br/><p>---</p><br/><p>Translator's Footnote:</p><br/><p>1Tian (Sky) Lie (Violent). Pronounced Ti-en Li-e. The closest name I got from baby names is Thierry which still sounds very far off. A google image search found several things I cannot recognize and a sword that seemed like Kamen Rider weapon. After more searching, I found that it was the weapon of Solar Pyro Warrior(?) from Armor Hero. The weapon's name had another two more characters besides Tien Lie but it ended up as something like ‘Armor Penetrator'. I decided to just use Sky.</p><br/>\n</div>"}