{"title": "Chapter 125: Strange Human Faced Lion", "id": 125, "volume": 2, "url": "http://boxnovel.org/masked-knight-chapter-125-strange-human-faced-lion", "volume_title": "Volume 2", "body": "<h1>Chapter 125: Strange Human Faced Lion</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 125: Strange Human Faced Lion</p><br/><p>Translator: Zenobys Editor:</p><br/><p>There was a faint sigh and the voice seemed to come from the depths of hell. “It has been a few hundred years since I last had visitors...”</p><br/><p>Wuya's normally cold face looked agitated. He could not help but walk two steps forward.</p><br/><p>“Eh? Aren’t you the large snake?” The stone statue looked at Wuya and laughed. “Why are you here?”</p><br/><p>Wuya glared at the stone statue and demanded, “Enough nonsense, Gatekeeper! Open the door!”</p><br/><p>The stone statue opened its mouth and roared loudly. A strong wind blew out causing the grass to sway. Wuya’s clothes also fluttered but his face remained indifferent.</p><br/><p>“Damn you! You dare call me a Gatekeeper?” The stone statue bellowed, revealing a mouth full of sharp fangs. “You long-tailed snake, you dare call me that!”</p><br/><p>Wuya looked at him and coldly said, “Enough nonsense, you weird-headed lion. I have already fulfilled the conditions to wake you up. Quickly open the door!”</p><br/><p>“Wu…” The stone statue gave a soft roar and slowly sat down. He then said, “Fine! In that case, answer my question correctly and I will let you pass!”</p><br/><p>“Questions?” Wuya frowned. “What questions? I still need to answer questions?”</p><br/><p>Rody quietly walked a few steps forward and stood a distance away from the side of Wuya. He laughed loudly, “Wuya, don’t you know the teachings of God? If you want to pass through the Sphinx, you must answer its riddles.”</p><br/><p>“Bastard! What did you say?” Wuya became angry. “What teachings? You are just a Protoss watchdog!”</p><br/><p>Sphinx raised its head and roared loudly. Its roar was so loud that Rody could not help but cover his ears.</p><br/><p>“Insolent large snake! If you dare insult me, the Sphinx, again, I will eat you up!” It then growled loudly from its throat. “Well! Enough nonsense! Do not disturb my rest! Whoever can answer my question, I will let him in!”</p><br/><p>Wuya shouted loudly, “No! This is not right! The ancient texts of the Silvermoon Clan did not say anything about this!”</p><br/><p>Sphinx ignored him and shouted, “What animal walks on four legs in the morning, two legs at noon and three legs at night? The more legs he has, the slower and weaker he is!”</p><br/><p>The moment Rody heard the first sentence, he was already laughing to himself. This riddle again. It is the same riddle as the one in the records. Doesn’t this guy know how to change the riddle after hundreds of years?</p><br/><p>In accordance to the classics about the God in the church, the Sphinx was a mythological animal that guarded the gates. To get past it, one must first answer its riddle. According to the records, that Sphinx's favorite question was the one he just asked.</p><br/><p>Rody waited confidently for Sphinx to finish its riddle. While Wuya was frowning and thinking, Rody hesitated for a moment and answered, “Humans! The answer is humans!”</p><br/><p>Sphinx roared loudly. After that, it angrily whispered, “Correct! This human has given the right answer. You may enter!”</p><br/><p>As soon as it finished that sentence, Rody felt like he was grabbed in mid-air and involuntarily pushed towards the stone door.</p><br/><p>Wuya roared in anger, “Bastard! I am the one who is supposed to go in!” His figure flashed as he rushed towards the stone door.</p><br/><p>Sphinx roared again. Before Rody could clearly see what actually happened, there was the sound of a large explosion and Wuya was thrown back. Sphinx’s voice then resounded again, “Those who have not answered the riddle are not allowed to go in!”</p><br/><p>Wuya got up from the ground, looking extremely angry. He gave a shout and his body was immediately wrapped in a white light. His body transformed within the dazzling light. Wuya’s figure got bigger and bigger. Finally, with a roar, Wuya disappeared. In its place was a large snake, with its ten heads, hissing at Sphinx.</p><br/><p>One of the snake heads opened its large mouth and shot out a stream of fire at Sphinx. Sphinx responded with a resounding roar. The invisible sound waves extinguished the flames! Sphinx then shouted, “How dare you, a despicable snake, be rude to me, the great Sphinx! Even the Mystic Dragon had to be polite to me!” After that, Sphinx roared again and the snake was struck by lightning. The snake was flung away, and it severely crashed into some trees at the edge of the grassland.</p><br/><p>The large snake hissed and turned back into a human. Wuya then struggled to get up from the ground. Before he could stand firmly, he spat out blood. Wuya then glared at Sphinx. Suddenly, he opened his mouth and spat out a small and shiny square shaped object.</p><br/><p>Rody immediately heard Andy shout, “This is it! I can feel that the strong aura comes from the top of this thing! Shit! I initially thought that it was Wuya’s aura!”</p><br/><p>Sphinx looked disturbed and commented, “Dragon’s tooth! You actually have the Mystic Dragon’s tooth!</p><br/><p>Wuya was ghastly pale and had a ferocious expression. He no longer looked like the calm Chief of the Flame Tribe. Wuya glared at Sphinx. He slowly stretched out his hands, wrapping the dragon's tooth in his palms. In a burst of fire, the dragon's tooth in his palms was transformed into a sharp longsword.</p><br/><p>“Sphinx, are you going to let me in?” Wuya whispered as he held the hilt with both hands.</p><br/><p>Rody could feel the imposing, oppressive presence even from behind the stone statue, smacking him right in the face. The murderous intent gave off a very violent aura, even stinging his skin.</p><br/><p>Sphinx looked up and roared, “Do you think, I, the great Sphinx, would fear you just because you have a dragon’s tooth. You are just a despicable snake! I am God’s most loyal servant! Bring it on!”</p><br/><p>Wuya gritted his teeth and shouted, “No matter what, I am definitely going in there today! To hell with you!” Wuya did not seem to take any action. But suddenly, his body disappeared from that place. In a flash of white light, he reappeared in front of the Sphinx and with that dragon's tooth giant longsword, he proceeded to slash down on the Sphinx's head.</p><br/><p>Sphinx let out a thunderous roar and a white light screen appeared in front of it. The light covered the entire giant tree, together with Sphinx and Rody inside.</p><br/><p>The flaming sword had slashed onto the light screen and caused a strong shockwave, but it was unable to penetrate it.</p><br/><p>Sphinx roared again. Wuya took two steps back, caught his breath and then spat out some blood. After that, he threw himself forward as he slashed again at the light screen. Sphinx roared even more violently but the light screen seemed to be dimmer now. Wuya did not step back this time around, even though he spat out blood again.</p><br/><p>Wuya's face was deathly pale. The veins in his skin were clearly visible, giving his face a hideous and fierce look.</p><br/><p>“Boy, why are you still watching? Quickly go in!” Andy reminded Rody. He immediately ran to the stone gate, and it opened automatically. At that moment, Rody heard a loud crash behind him. However, he did not dare to look back and quickly rushed inside the giant tree trunk.</p><br/><p>The moment Rody walked in, the gate immediately closed behind him. There was no light inside the giant tree trunk, but Rody could faintly feel the vibrations from outside the tree. Wuya and Sphinx were still battling fiercely outside.</p><br/><p>Since he could not see, Rody felt his way around. There were walls on both sides. He pushed ahead as he groped with his hands, stumbling into open space. He then kept going forward step by step in the dark. However, he stepped into a void and fell down.</p><br/><p>That hole in the tree was actually a passageway. The slope Rody fell on was also unexpectedly steep. He rolled all the way down and bumped so much that he ached all over and was extremely dizzy. His body was already weak before this. So, even though he managed to grab two withered vines along the way, he could not hold on to them and could only continue to roll down.</p><br/><p>Finally, Rody rolled into a pool of water at the bottom. He accidentally swallowed a few mouthfuls of water before he stood up. The pool of water was not too deep and only reached up to Rody’s thighs when he stood up. However, the water was extremely cold. Rody trembled from the cold as a faint wind blew onto his wet body.</p><br/><p>In the dark, he slowly walked against the direction of the wind. This time, he was more alert and tested his footing before walking forward as he was afraid of falling and rolling down again.</p><br/><p>After a short distance, Rody had stepped out of the pool and onto dry land. A strange thing happened. Rody's injuries that had soaked in that pool of water started to feel better and now no longer hurt. Instead, they started to feel itchy. Rody did not hurry ahead. He returned to the pool of water and sat there, totally immersing himself. He then started washing away the sludge in his nose and mouth. It felt extremely comfortable and there was no longer a disgusting taste in his mouth.</p><br/><p>His mind even felt extremely refreshed and his whole body felt lighter. It was as if he could fly.</p><br/><p>There is something weird about this water. The moment Rody thought of that, Andy spoke, “Boy. This seems to be holy water. You are bathing in holy water. Such good fortune. Even the Pope never had anything this extravagant.”</p><br/><p>“Holy water?” Rody froze for a moment. He then took off his clothes and carefully touched his wounds. Instead of wounds, he found that the skin was smooth and his injuries had healed.</p><br/><p>“It really is holy water.” Rody sighed. When he was injured in the army, they had treated him with holy water. However, holy water is extremely valuable and was something that ordinary people could not afford to use. Holy water was not only used to treat injuries but could also be used to replenish the magic power of sorcerers and magicians.</p><br/><p>Rody sighed and gave a wry smile. “Unfortunately, I am neither a sorcerer nor a magician. This holy water cannot replenish my fighting energy.\" After that, Rody stood up and walked away, shaking his head.</p><br/><p>“Hm?” After walking a little in the dark, Rody saw some light in a distance. Rody then asked, “What is that? Could it be the Mystic Dragon?”</p><br/><p>Andy then replied in his mind, \"What do you think? Aren't you the one that cut ahead of the line and entered earlier than Wuya? Are you trying to be a Dragon Slayer?\"</p><br/><p>Rody replied, “I don't know. Kill the dragon? Don’t joke around. Who am I to think that I can kill a dragon? Especially since the dragon here is the Mystic Dragon that even challenged the Gods. Even Wuya could easily kill me, let alone the Mystic Dragon.</p><br/><p>“Hmm, so you still know your place, boy. What were you trying to do by entering this place?”</p><br/><p>Rody shook his head and was caught off guard when he knocked the side of a wall. He gave a wry smile as he nursed his head and replied, “I told you. I do not know. I just wanted to prevent Wuya from entering. If he manages to revive the dragon, would we still have a future? Have you never read the religious classics? Mystic Dragon. His name has the word mystic and would probably not be a good thing.1 Don’t you think that there would be chaos if he enters the human world?”</p><br/><p>“Hahahaha.” Andy laughed heartily. “You really have a lofty way of thinking, but what will you do now? How are you going to get out of here?”</p><br/><p>Rody shook his head and replied, “Doesn’t matter. Let us go in first before we talk about it. Maybe that dragon is asleep and I can get rid of it with one stroke of my sword.”</p><br/><p>“I think you are going to get killed.”</p><br/><p>Rody lightly replied, “If I am courting death then so be it. Either way, it is good as long as Wuya cannot get in here. That way the Mystic Dragon cannot be revived.”</p><br/><p>Andy was silent for a moment before asking, “Boy, are you serious about this? Are you not afraid of death?”</p><br/><p>“Hmph.” Rody continued to walk as he replied softly, “Who is not afraid? However, we must keep moving forward. Once we can no longer move forward, we will die. In short, I will not stand by and just watch Wuya revive the Mystic Dragon!”</p><br/><p>“I really can’t tell if you are a great man or just an idiot,” Andy muttered.</p><br/><p>The light in front of him started to get nearer. Rody’s footsteps also became lighter and lighter. After a few more steps, Rody was shocked. The passageway was filled with magnificent radiance.</p><br/><p>A variety of colorful gems could be found on both sides of the walls, on the ground and even the ceiling. These gems emitted a dazzling brilliance and each of them was the size of an egg.</p><br/><p>Rody’s mouth gaped open for a long time and then he sighed. “Good heavens! There are so many gems here! If we brought them outside, we could make a fortune!”</p><br/><p>Rody could not help but lightly hold onto the uneven walls. Putting his hands around a gem, he pulled lightly and it came off the wall! Rody then exclaimed as he looked at the gem in his hands and smiled. “Andy. I am rich! Do you think this gem is worth two thousand gold coins?”</p><br/><p>Andy sneered. “You are the Duke of the Tulip Family. A mere one or two thousand gold coins is nothing to you!”</p><br/><p>Rody gave a supercilious look and replied, “What Duke? I am just an impostor. When I stopped becoming a Duke, this gem would be extremely valuable!”</p><br/><p>Rody thought to himself for a moment and then he kept the gem at his chest. After that, he thought of pulling out more gems when he suddenly gave a wry smile and said, “I am really stupid. Right now, I do not know if I would survive! What is the use of these things?” Rody then laughed and continued forward without looking anymore at the gems on the wall.</p><br/><p>After walking for a while he asked, “Andy. Why do you think there are so many gems here?”</p><br/><p>“I heard that dragons are greedy beings. They like sparkling things like diamond, gold and various other gems.</p><br/><p>“This place is where that dragon is imprisoned. This is where they put him to sleep. In fact, for this so-called imprisonment, the gems were placed here to coax the dragon to sleep. Have you seen people who coax their children to sleep by letting their children hold their favorite toy? They used the same principle to coax the dragon to sleep.”</p><br/><p>Rody took a deep breath and gave a wry smile as he said, “I hope that the dragon does not think that I stole his toy from the gem I grabbed. I know that children are absolutely relentless against people who take their toys.”</p><br/><p>The passageway slowly moved down the further they went. More and more gems could also be found on the walls. Finally, the walls were completely covered in gems. The gems were also larger and shined so brilliantly that people could hardly keep their eyes opened.</p><br/><p>Rody suddenly stopped and shouted, “No!”</p><br/><p>Andy was shocked and angrily said, “Have you gone mad?”</p><br/><p>Rody stood still with a pale face and whispered, “I suddenly remembered Sphinx’s words. Have you noticed it?”</p><br/><p>“What words? That Sphinx said a lot of things.”</p><br/><p>Rody took a deep breath and replied, “His first sentence… The words he said when he just woke up…”</p><br/><p>Andy coldly replied, “What about that sentence? I remember that he said that this was the first visitor he had in a few hundred years. What is wrong with that?”</p><br/><p>Rody gave a peculiar expression. His voice was also a little bit strange. “Have you not thought about it? Andy. His first few words were ‘a few hundred years’…”</p><br/><p>Andy was silent for a moment and then his voice also started to sound weird. “That’s right… according to the legend, the Mystic Dragon should have been sealed thousands of years ago. The Silvermoon Clan had also guarded this valley for thousands of years. However, Sphinx’s words were…”</p><br/><p>Rody whispered, “It has been a few hundred years since I last had visitors…” Then it dawned on him, and he said with a tremulous smile, “That means a few hundred years ago… someone was here.”</p><br/><p>---</p><br/><p>Translator's Footnote:</p><br/><p>1 Mystic Dragon in the chinese raw is mo long. The ‘mo’ can mean magic, mystic or evil. As Wuya had accused that ‘it was just like his despicable enemies to call that place the Summit of Evil’. It implies that Wuya does not consider himself or his parent/master evil. Hence, the dragon’s name cannot be Evil Dragon. At the same time, ‘mo’ could also mean evil and is obviously not a ‘good thing’ as claimed by Rody.</p><br/>\n</div>"}