{"title": "Chapter 146: Go To Hell!", "id": 146, "volume": 2, "url": "http://boxnovel.org/masked-knight-chapter-146-go-to-hell", "volume_title": "Volume 2", "body": "<h1>Chapter 146: Go To Hell!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 146: Go To Hell!</p><br/><p>Translator: Editor:</p><br/><p>There were more and more miserable screams coming from outside. After a while, the miserable screams gradually ended.</p><br/><p>Time seemed to have stopped. A single second seemed like an eternity. Jojo trembled more and more violently as Rody tightly held her with a solemn expression.</p><br/><p>Someone gently knocked the door of the carriage twice.</p><br/><p>After that, Sophie spoke in a happy voice, “Well, how long do you want to remain in there? Auntie Sophie has no time to wait for you. Miss Jojo, Young Master Seth, please come out.”</p><br/><p>Rody turned pale. He then looked at the frightened Jojo in his arms and sighed. He gently held her with one hand and opened the door of the carriage with the other.</p><br/><p>Under the night, the monster stood not far from the door of the carriage.</p><br/><p>The monster was about two meters tall and had a pair of pointed ears. It had a green face with a sharp chin. Her pair of long arms was full of black hair which was so long that it could reach her knee. Behind her tall body was a pair of huge wings, and her big hands were bloody. That monster was looking at Rody and Jojo in the carriage.</p><br/><p>She looked at them with mocking face. Suddenly, she put her finger into her mouth and slowly sucked it. After that, she stretched out her long tongue and licked her mouth.</p><br/><p>The monster gave a strange laugh. “I have not tasted human blood for a long time… This is an unforgettable taste.”</p><br/><p>The sharp and delicate voice belonged to Madam Sophie. Rody did not expect that she would look so terrifying after she had transformed into a real vampire.</p><br/><p>Rody was still holding Jojo. Before he could get off the carriage, Sophie laughed and raised a fireball from one of her hands, then lobbed it at the carriage.</p><br/><p>Rody immediately grabbed Jojo and jumped out of the carriage. He then rolled on the ground, tightly holding on to Jojo. Rody then heard an explosion behind him. The carriage was destroyed.</p><br/><p>The horse that was harnessed to the carriage was dead. It looked like its head had been twisted at some point in time.</p><br/><p>The two of them were covered in dust. A piece of flesh on Jojo’s arm had been torn off, and she was in extreme pain. Tears started to flow out, and she continued to hold onto Rody. She trembled even more violently, and her teeth continued to chatter.</p><br/><p>Bodies littered the floor outside the carriage. The seven or eight guards that Jojo brought were lying on the ground motionless. They were obviously dead. The floor was covered with blood, and some of the guards had a bloody hole in their body as if their hearts had been dug out.</p><br/><p>Rody took a deep breath and struggled to stand up. “Sophie… Madam Sophie, you have won. Come and kill me!”</p><br/><p>The vampire gave a strange laugh and said, “Today seems to be my lucky day. That idiot had wasted the lives of so many vampires, yet he could not kill the Duke of the Tulip Family. However, I have caught the Duke! Just now, I could not recognize you because I could not see your face. However, I heard your conversation… Sigh. Don’t you know that vampires have better hearing than humans?”</p><br/><p>She stretched out a bloody claw and slowly walked towards Rody.</p><br/><p>She then laughed and said, “Seth, all this while, I have been surprised. Initially, you were nothing but a playboy. I did not expect you to become so powerful within a short period of time… I thought it was strange since that time I saw you defeat the warrior from the Great Moon Kingdom in the brothel. Could it be that the Tulip Family is really so magical? Come on... Show me how powerful you are. Show me the power of the human world’s outstanding Tulip Family!”</p><br/><p>She suddenly swayed her body and instantly appeared in front of Rody. Out of desperation, Rody forcefully pushed Jojo away. However, his opponent had already swung her claw at him, and he could not dodge in time. In fact, with his current condition, dodging was out of the question.</p><br/><p>Before Rody could even groan, his body was already flung several meters away. He crashed into the ground.</p><br/><p>“So, you are only at this level?” The vampire spoke in a soft voice, “This is strange… You seem weaker than these few guards. How come you were able to use fighting energy that day?”</p><br/><p>Rody struggled to sit up and sighed, “Consider yourself lucky… If it were two months ago, I would have already cut you up into several pieces!”</p><br/><p>Rody was a determined person. Although he despaired, he did not show his emotion on his face. However, he still looked helpless as he said, “If it was not because of my encounters in the South, do you think your claw would be enough to kill me?”</p><br/><p>“Hahaha… Are you saying that you are injured and cannot fight?” Sophie burst into laughter. “You are an arrogant human. Do you think you can defeat me if you are not injured? You have underestimated us! I am a high ranked vampire! Even your Grade 3 or even Grade 4 human warriors would not be a match for me! You are only someone who had just comprehended fighting energy! How dare you speak like this!”</p><br/><p>Rody shook his head and grunted in disagreement.</p><br/><p>In fact, Rody had good reason to disagree. When he went to the Northwest, he was severely injured. The Black Veil Saint strived hard to heal him with the greatest sorcery skill she had — ‘Reshape Origin’— losing some of her powers in the process.</p><br/><p>After that, Rody’s body became even more powerful than ever. His skills had made a breakthrough to new levels, breaking past his old limits. He may have seemed extremely weak at the mountains but that was because his opponent was either Wuya or some magical beasts. Wuya was so strong that he had already reached the level of demigods. Even that “Domain Force” Sky was not sure he could beat Wuya. Rody, of course, was no match for such a strong opponent. However, if he was graded according to the level of an ordianry human, Rody had already surpassed a Grade 5 swordsman. With a little bit more practice, he would soon reach the rank of a Grade 6 swordsman. Even the strongest ‘Sacred Swordsman’, Master Autumn, was only a Grade 7 swordsman. A Grade 7 swordsman was already at the peak amongst the human warriors. After Rody had gone through all sorts of miraculous turn of events, his strength soared until it was close to a Grade 6 swordsman. Becoming a Grade 7 swordsman was just a matter of time.</p><br/><p>If Rody had not converted that dragon, he believed that he might stand a chance against this vampire tonight.</p><br/><p>Rody gave a wry smile. “Tonight, I have nothing left to say but… Madam Sophie… Can you let Miss Jojo go? She…”</p><br/><p>“Haha...” The vampire sneered. “You are really stupid! She has already seen my appearance tonight. Do you think I will let her live?”</p><br/><p>Rody felt his heart ache and glanced towards Jojo. His voice was filled with guilt as he said, “Jojo… I am sorry… Because of me…”</p><br/><p>“Don’t!” The frightened Jojo suddenly burst out screaming. She somehow gathered her courage and struggled to get up before running in front of Rody. Jojo held on to Rody and straightened her chest to block Rody from the vampire. She then looked unwaveringly at the vampire and said in a hoarse voice, “You… I beg you… Do not kill Seth…I beg you... I will give you money. I will give you a lot of money! Ten thousand gold coins! One hundred thousand gold coins! One million gold coins! I will give you whatever you want! I will give you my life! You can kill me! But I beg you, please do not kill Seth!” Jojo’s face was pale, and her voice was hoarse. She tightly held on to Rody. Her pretty face was full of tears.</p><br/><p>“How touching…” The vampire spoke softly, “Why do you humans have all of these stupid and useless emotions? In this case, show me an even more touching scene.”</p><br/><p>Sophie extended her huge claws. The sharp fingers stretched out, and in a flash, they were right in front of Jojo. Instantly, those fingers fiercely pierced Jojo in the chest. Before Rody could react, Jojo had already groaned. Her white dress had been stained red with blood.</p><br/><p>There was a faint sound and Sophie’s claws emitted a black gas. Jojo screamed as her body flew away. Rody, who was held on by Jojo, also flew several meters away. Both of them landed fiercely on the ground, hugging each other.</p><br/><p>Jojo’s pretty face was full of blood and dirt. Her chest had a hole with blood gushing out of it. Her face was devoid of color while her dress was red with blood.</p><br/><p>Rody was at a loss as he looked at Jojo. He was stupefied and shocked to see the bloody body in his arms.</p><br/><p>Rody suddenly roared as if he was in pain. He held Jojo’s shoulder with one hand and shouted, “Jojo!”</p><br/><p>Jojo’s body twitched and her lips trembled. She suddenly spoke in a soft voice, “Seth… I… am I going to die?” Rody felt something flowing out of his own eyes. He could feel the twitching of Jojo’s body getting weaker and her body turning colder.</p><br/><p>“Jojo… Jojo…” Rody had also lost his voice.</p><br/><p>“Seth… It hurts…” Jojo’s face was full of tears and was distorted in pain. Her voice sounded weaker and weaker, “It really... really hurts… Why does it hurt…so much... I am afraid of pain…”</p><br/><p>“Jojo...” Rody tasted something salty as his tears flowed into his mouth.</p><br/><p>Jojo then forced a smile and said, “Seth… You… Called me Jojo… Do you know…recently you have been calling...calling me, Miss Jojo. I don’t like… you… calling me Miss Jojo… I do not like… I don't like to hear you to call me… Miss… You are my Seth… I am your Jojo…” She took a deep breath and showed a radiant expression. “Seth, I am going to die… I am really going to die…I can sense it... I... I am not afraid, at all… We are going to die tonight… You...After we die… You... Will accompany me...am I right?”</p><br/><p>“Yes! Yes!” Rody felt his body also trembled as he desperately nodded. He looked at the beautiful and lively woman covered in blood in his arms. Her large seductive eyes started to gradually lose their luster, and Rody felt his heart gradually being torn apart.</p><br/><p>He did not love Jojo.</p><br/><p>He also knew that the person Jojo loved was not him, but Seth. However, as he faced Jojo who was dying for him, Rody was willing to do anything to exchange for the girl’s life.</p><br/><p>Anything for her life!</p><br/><p>Jojo’s eyes had become lax, and she could no longer utter anything clearly. She gently opened her mouth but her throat did not produce any sound. With tears in his eyes, Rody placed his ear next to her mouth and only heard her repeating...</p><br/><p>“You are my Seth, I am your Jojo.”</p><br/><p>Her soft body gently twitched one final time before it stopped moving. Her rapid breathing also slowed down before finally turning quiet.</p><br/><p>Rody suddenly looked up and roared loudly. In the dark night, the roar was like from an angry and injured beast.</p><br/><p>“How touching!” The vampire clapped her hands from behind Rody. Her green and fanged face revealed a terrifying smile. “Truly touching... How many years has it been since I last saw a scene that was this touching? However, you do not have to be so sad. I will let both of you die together. I will…”</p><br/><p>Sophie suddenly stopped talking.</p><br/><p>She saw Rody slowly let go of Jojo. Although he was still trembling, he had already stood up.</p><br/><p>As Rody listened to Sophie's sharp laughter which was like that of the night owl, he slowly raised his hands. His hands were full of blood.</p><br/><p>This blood is Jojo’s blood… Jojo's tears mixed with her blood…</p><br/><p>How pitiful… Truly pitiful! Pitiful Jojo… Pitiful me...Damn! This damn world!</p><br/><p>For a moment, Rody felt rays of light - like needles piercing through his brain. Something that was extremely hard broke within the depths of his mind.</p><br/><p>It seemed that the shackles of an ancient abyss— the chains that had fettered his very soul— had suddenly ruptured!</p><br/><p>Rody’s eyes became blank. There was no trace of sadness or anger. Although he stood there, he no longer showed any anger or other emotions.</p><br/><p>After that, Rody’s body started to tremble violently.</p><br/><p>It was a kind of unrestrained trembling. His trembling became more and more vigorous, and his face also became more and more distorted.</p><br/><p>“Hahahaha…” Rody suddenly burst into a kind of neurotic wild laughter. “Good! Bleed! Bleed! Look! There is so much blood! How pitiful! This world is really damned! Damned! Go to hell! Hahaha… Everyone, go to hell!” His eyes then turned and rested on Sophie, not far from him. He then fiercely shouted, “Did you not hear me? I said, go to hell!”</p><br/><p>Rody then looked at the vampire with a gloomy expression as he slowly walked towards her.</p><br/><p>Crack...</p><br/><p>With every step Rody took, the ground below him broke into fine cracks. The surrounding earth seemed to tremble as if it was crying sorrowfully.</p><br/><p>A mass of dazzling golden flame then burst out from Rody’s body. The golden flame rose two meters high and shrouded Rody’s body in the middle. His hair danced from within the flames and his eyes had a murderous glint.</p><br/><p>Sophie was surprised when she saw Rody’s sudden change. Her instincts as a higher organism made her feel a sense of fear. It was a cold fear that came from the depths of her soul.</p><br/><p>It seemed like she had made a big mistake. It seemed like she had...she had released a demon!</p><br/><p>Sophie turned stiff. Her arrogant expression had disappeared and was replaced with fear. Her instinctive fear made her slowly step back as she confronted the purposeful advance of Rody.</p><br/><p>Rody suddenly stopped, and his face contorted in pain. After that, his whole body started to tremble, and the golden flame around his body started to vibrate violently...</p><br/><p>It was as if the golden flame was unstable. It swayed violently as if the flame was being blown by the wind. Rody sweated and blue veins appeared on his forehead. His face distorted hideously. Suddenly, he looked up to the stars in the sky and shouted, “Are you still thinking of restricting me? No way!”</p><br/><p>Boom!</p><br/><p>Even though there was no explosion, Sophie heard a loud noise.</p><br/><p>After that, the scene in front made her mouth drop open.</p><br/><p>The golden flame covering Rody's body grew violent again and rose even higher than two meters. It looked like a huge fireball in the night sky.</p><br/><p>Immediately, the huge fireball started to change under the dark clouds.</p><br/><p>Not knowing since when, the original golden flame had started to emit a trace of black color. After that, the black color gradually diffused and swallowed the surrounding golden flame. The original golden flame then turned black. It was black like the black hole in the night sky and black like the abyss of hell.</p><br/><p>Finally, Rody’s golden flame was entirely swallowed by the black flame. His whole body was then covered by the black flames. The flames were not obvious but it seemed to have a kind of incomparable foreboding manner.</p><br/><p>Sophie felt like her whole body was covered in cold sweat. That was an instinctive reaction... It was the kind of reflex action of a prey meeting a predator.</p><br/><p>“No… Not possible!” Sophie screamed, “He… He is nothing but a human!”</p><br/><p>Rody closed his eyes. The painful contortions in his face had subsided. It was as if the black flames were extremely comfortable. His clothes were gradually torn to pieces as the fragments of the clothes flew away, revealing his bare arms and robust chest.</p><br/><p>Surprisingly, the dragon pattern on his left arm had completely disappeared.</p><br/><p>Instead, a pattern appeared on Rody’s chest.</p><br/><p>That black Mystic Dragon that was once cursed by the Gods, the demons, the Mythological Animals— it’s flaming orbs, its soaring wings — were imprinted onto Rody’s chest.</p><br/><p>Rody opened his mouth and let out a low moan that did not seem human. When Sophie heard this sound, she felt as if her face was just kicked by someone.</p><br/><p>This sound! Damn! This sound!</p><br/><p>This is definitely not a human voice! Humans cannot make this kind of sound! This is…”</p><br/><p>Suddenly, Rody chanted as he gently stretched out one of his hands and pressed it onto his face. There was a brilliant light, and soon after that, it seemed like something was taken off from his face.</p><br/><p>In his hands was a vivid mask that seemed to flash with a silver light.</p><br/><p>His original long golden hair had turned blue in color. His handsome face had also changed in shape and was filled with killing intent. Half of his face had white skin while the other half had black skin.</p><br/><p>After that, the black skin on one-half of the face gradually disappeared, and his whole face started to harmonize.</p><br/><p>Rody had already opened his eyes. The normal deep blue eyes had turned brown. He looked at Sophie emotionlessly and calmly said, “What did I say earlier? Oh right... I said... go to hell.”</p><br/><p>He looked at the world indifferently, as if he could turn the world into dust with a snap of his fingers!</p><br/>\n</div>"}