{"title": "Chapter 149: Myka’s Feelings", "id": 149, "volume": 2, "url": "http://boxnovel.org/masked-knight-chapter-149-myka%E2%80%99s-feelings", "volume_title": "Volume 2", "body": "<h1>Chapter 149: Myka’s Feelings</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 149: Myka’s Feelings</p><br/><p>Translator: Editor:</p><br/><p>It was in the middle of the night. Diane sat on the chair with a tired expression, but she still stayed awake. From time to time, she looked at the door. When there were occasional signs of noise outside, she would immediately get up to listen.</p><br/><p>“This bastard! It is already late yet he still has not returned from that place!” She cursed quietly. Suddenly, she sensed something strange. She stood up and immediately walked towards the door to open it. She saw a man standing at the door.</p><br/><p>Diane was shocked when she saw an unfamiliar face. She instinctively stepped back and took out her dagger.</p><br/><p>Rody shook his head and whispered, “It’s me.”</p><br/><p>The familiar voice that said, “It's me” made Diane feet relaxed. She was relieved, then she put her dagger back in and looked at the person in front of her with a surprised expression. She whispered, “Are you… that Tulip? Your face…”</p><br/><p>Rody shook his head and lightly said, “This is my real appearance…” He then laughed softly and continued, “But this is better than last time.”</p><br/><p>Diane’s mouth dropped open. She would not have believed that the person in front of her would be the impostor of the Duke if Rody did not speak.</p><br/><p>Rody’s blonde hair had turned blue. His blue eyes had turned brown. He was also no longer as handsome as before. However, the edge and corners of his face showed that he was an unyielding man.</p><br/><p>However, Diane could also see that the face was not hiding its expression of grief.</p><br/><p>What happened tonight?</p><br/><p>Rody shook his head and said in a soft voice, “There is something I need you to help me with. Follow me.”</p><br/><p>After that, he grabbed Diana’s hands and pulled her outside.</p><br/><p>Diane was surprised. “Going out again? Aren’t you afraid…”</p><br/><p>Rody interrupted her with a faint laugh and asked, “What is there to be afraid of? I look like this right now. Who would think that I am the Duke of the Tulip Family?”</p><br/><p>Diane was stunned for a moment, but then she also started to laugh. “That is also right… But you don’t seem to be alright. What happened? Your expression does not look good.”</p><br/><p>Rody then mentioned casually. “Nothing much… One of my friends was killed by a vampire. I killed the vampire, and I also got rid of an Elder of God’s religion.”</p><br/><p>Diane was shocked and quickly let go of Rody’s hand. She took a step back and asked, “Wh...What did you say? Vampire? Elder of God’s religion? You… Has your body recovered?”</p><br/><p>Before Rody could answer, Diane shook her head vigilantly. “No… Even if you had recovered, you would not be able to achieve those feats… Could it be?”</p><br/><p>Rody’s expression turned cold. “Are you afraid of me? That’s right. I used that dragon’s power! That’s right! I feel like I am no longer a human now! I am a monster!”</p><br/><p>Diane became afraid when she saw Rody’s furious expression. She slowly replied. “No. That is not what I meant.”</p><br/><p>Rody looked at her and said softly. “I know the reason you were following me… But right now, I need you to help me do something and leave the Imperial Capital.”</p><br/><p>“Leave? Why?”</p><br/><p>Rody started to laugh coldly and then he replied, “That is because the Imperial Capital will soon become chaotic…”</p><br/><p>Myka could not sleep.</p><br/><p>After Rody had left, there was a ruckus outside. The ruckus had lasted through half the night. She had heard that two people died in the brothel. They had died tragically with their necks broken.</p><br/><p>When the public security soldiers had arrived, Madam Sophie had also disappeared. Without anybody managing the brothel, there was confusion everywhere. In the end, the soldiers had detained a few of the servants.</p><br/><p>Myka was worried about Rody. Rody had secretly come back to the Imperial Capital. If he was found, others would deliberately frame him for the complicated situation in the Imperial Capital. Those aiming for the throne had always been worried that they would be unable to get rid of the Duke of the Tulip Family.</p><br/><p>She secretly sneaked out to look but did not notice anything. She then returned to her room and thought to herself.</p><br/><p>I have decided to leave the next morning. Would anybody notice if I secretly escaped?</p><br/><p>Rody asked me to go to the South and find his friends and not to go to the Tulip Family’s territory. Does he understand my intentions?</p><br/><p>Myka then shook her head and smiled wryly. Myka, stop being silly.</p><br/><p>However, Myka could not help but have a complicated feeling when she thought that she would finally leave behind the Imperial Capital, the brothel and her connection to Seth and the Tulip Family.</p><br/><p>She then remembered Rody’s laugh and his warm eyes. Although Rody looked like Seth, his kind and warm eyes were pure, unlike Seth. She remembered him agitatedly saying, “Who dares to bully you? I will go and slaughter him!”</p><br/><p>Unfortunately, Rody did not know that Myka’s face was full of tears when she heard him say it.</p><br/><p>Compared to the guy that had disappeared without a trace, Myka thought that Rody was sometimes cute. He was in danger because of secretly returning to the Imperial Capital, but he still risked his life to come and see her.</p><br/><p>Myka then went out for a while and took out a short harp. Her fingers then gently played a lighthearted melody.</p><br/><p>Myka sang as she played the harp.</p><br/><p>“The hem is gently raised, it’s the dance of the monarch!</p><br/><p>The sword is ruthless, the beauty dares not dream!”</p><br/><p>She sang the same thing again and again until she herself felt that it was crazy.</p><br/><p>These sentences were from the second time Rody had visited her and before he left for the battlefield in the Northwest. These were the words he said after watching her dance.</p><br/><p>These words were extremely strange. It was as if they were the words of a poet but at the same time, it was not alike. The poems made by the bard of the Radiant Empire were different compared to the one that was just said. When she thought about it, she felt that Rody’s words were more meaningful and were also in a different style.</p><br/><p>Myka could not help but laugh when she remembered Rody blushed after speaking too much and said, “As long as I come back from the Northwest, I will come and see you.”</p><br/><p>She stood up and went to the window. She then opened the window and looked at the night sky. She didn’t know whether to be happy or sad as she looked at the sky.</p><br/><p>Suddenly, she heard a voice calling from behind her. “Myka.”</p><br/><p>Myka was surprised. She turned around to see a tall man standing behind her. The flame from the candle in her room swayed, revealing a resolute face that was looking calmly at her. The door behind them was slightly close and Myka did not know when he entered the room.</p><br/><p>“It’s me. Rody!”</p><br/><p>Myka smiled when she heard a familiar voice. She did not seem surprised by his appearance and quietly asked. “Are you alright? There was a ruckus outside, and I was worried about you.”</p><br/><p>Rody shook his head and replied. “I am fine.”</p><br/><p>Rody then paused for a moment before continuing. “I came here to pick you up. I will now take you away! I will take you away from this place!”</p><br/><p>Myka trembled, feeling as if she was in a dream.</p><br/><p>‘I will take you away from this place!’</p><br/><p>These were the words she had always wished to hear. At first, she had hoped that one other person would say it, but now, these words were spoken by Rody.</p><br/><p>Myka’s face immediately turned red as she replied without hesitation. “Yes!”</p><br/><p>Without taking anything with her, Myka walked to Rody’s side and softly said. “Let’s go.”</p><br/><p>Rody was stunned and asked, “Don’t you need to pack up?”</p><br/><p>Myka smiled and glanced at the room. Although she was smiling, her eyes were steadfast. “No. I don’t want to take these with me!”</p><br/><p>Rody nodded his head, and then he suddenly held Myka’s waist. Myka was surprised and turned red. Her breathing became quicker. After that, Rody whispered in her ear. “There is someone at the door. I can enter but you cannot leave that way.”</p><br/><p>He then carried Myka with one hand and went to the window. He looked at the situation below before saying, “Hold on tight.”</p><br/><p>Myka could only feel her heart beating crazily and her face burning hot. She closed her eyes in confusion only to hear the wind blowing. She felt herself very close to Rody’s chest and did not know anything else. She also did not know where she was at and subconsciously clutched Rody’s clothes tightly.</p><br/><p>She felt her body floating but was not sure for how long. She felt as if she was fluttering in the clouds. Finally, when she landed, she opened her eyes and found herself already on one of the roads outside of the Imperial Capital.</p><br/><p>A gorgeous carriage with a Silver family insignia was in front of them. However, the insignia looked unfamiliar. Myka was stunned for a moment before she asked, “Did you prepare this? Where did you get this?”</p><br/><p>Before Rody could answer, a girl appeared from behind the carriage and angrily asked, “Where did it come from? Hmph, was it stolen?”</p><br/><p>Myka’s expression became uncomfortable as she looked at the girl wearing a red dress. Although she could not see her face clearly in the night, she could vaguely tell that it was a beautiful girl.</p><br/><p>More importantly, women are, by nature, very sensitive. Myka could sense that the other girl was also uneasy with her.</p><br/><p>Rody nodded and simply answered, “It was stolen.”</p><br/><p>Diane sighed when Rody said, “It was stolen”.</p><br/><p>She was very upset because the carriage was stolen. The insane fellow had changed too much in one night.</p><br/><p>In order to steal the carriage, Diana saw Rody casually went inside a noble’s mansion. Diane waited anxiously outside as she heard the sound of fighting inside the mansion. After that, she saw the crazy fellow holding a carriage and the horses with two hands and jumping from behind the wall.</p><br/><p>After that, in the night streets of the Imperial Capital, Rody once again jumped over a ten meters high wall carrying that horse together with the carriage.</p><br/><p>This is too ridiculous!</p><br/><p>However, Rody indifferently said, “There is no other way. There are no other places to find carriages in the middle of the night. We can only do this.”</p><br/><p>Rody did not seem afraid at all, but the horses he was holding seemed to be so afraid that their legs had turned soft…</p><br/><p>When Diane saw the woman in Rody’s arms, she could not help but think, He did all this for her.</p><br/><p>Rody let go of Myka and helped her up the carriage. He then faced Myka and said, “It’s too bad that you cannot ride a horse. Fortunately, there is a carriage, and it would not be too slow. She is my friend. I asked her to take you to that place I talked about. Don’t worry. It will be safe with her around.”</p><br/><p>Diane’s expression was cold and she felt angry. She looked at the beautiful woman and sighed. “No wonder this fellow is so crazy about her…she really is…”</p><br/><p>Tonight, Diane had accompanied Rody in the Imperial Capital, running back and forth several times. Finally, she promised Rody to escort one of his friends to meet Sky. However, she did not expect that it would be such a beautiful woman. Even though she was angry, she could not say anything.</p><br/><p>Myka trembled and whispered, “You… Are you not coming with me?”</p><br/><p>Rody looked apologetic as he replied, “No, I still have a lot of things to do in the Imperial Capital. Also… The two of you better leave quickly. In the next few days, the Imperial Capital will be in turmoil. I would not be able to relax if the two of you were still here.”</p><br/><p>Rody looked at Myka’s tender expression and felt moved. He could not help but have a strange feeling and unknowingly whispered, “Go there first. When I am done with my business in the Imperial Capital, I will definitely come and find you!”</p><br/><p>Myka looked at Rody, and then she looked at the girl beside her. She suddenly smiled and said, “I understand. I will listen to you.”</p><br/><p>When Myka finally got onto the carriage, Rody turned around to look at Diane. He then said, “Thank you.”</p><br/><p>Diane was a bit uneasy and coldly replied, “I will accomplish the things I promised you! I will take your lover to Sky safely. However, I will not care about what happens after that!”</p><br/><p>Rody froze for a moment before he smiled. “She is not my lover.” He then continued, “You should also leave quickly. Once the two of you are gone, I would not need to worry so much while doing my work.”</p><br/><p>Diane nodded as her heart turned soft. She could not help but say, “You should also be careful! You are possessed by the Mystic Dragon and must not act recklessly. Otherwise, my Silvermoon Clan would come after you even if they had to throw away their lives...”</p><br/><p>Rody suddenly gave a bitter laugh. “Throw away their lives…” Rody then looked at the sky and said, “The weather tomorrow should be good. In a good weather, the blood might flow a little bit faster.1”</p><br/><p>Rody’s indifference made Diane's heart feel cold. Before she could reply, he had already pushed her onto the carriage and whispered, “Sorry to trouble you.”</p><br/><p>Diane sighed. She then whipped the horses, and the carriage started to move slowly.</p><br/><p>Myka, who was sitting inside the carriage, suddenly opened the window. She looked at Rody and softly said, “The hem is gently raised, it’s the dance of the monarch! The sword is ruthless, Myka dares not dream!”</p><br/><p>That phrase was what Rody had said that day. However, this time, she substituted her name in and did not use the original phrase. That meant that she had clearly expressed her own feelings.</p><br/><p>Rody looked at Myka’s haggard face and became anxious. He then loudly shouted. “I will come and find you! Definitely!”</p><br/><p>Rody then watched the carriage travel south and gradually disappear from his view. He then released the breath he had been holding and turned around to look at the towering walls of the Imperial Capital.</p><br/><p>The Imperial Capital was quiet in the middle of the night. Rody suddenly smiled and murmured. “Great! Now I can make this place livelier.”</p><br/><p>Rody did not run and slowly walked towards the Imperial Capital.</p><br/><p>Rody remembered what Dandong’s notes had stated. If a person could not understand his opponent’s strategy but had absolute power, it was better to just put away strategy and fight with brute force. With the absolute power to destroy, even geniuses at strategizing would easily be torn to shreds.</p><br/><p>As Rody advanced, his smile gradually subsided.</p><br/><p>“Absolute power… Breaking through with brute force… This method really suits me.” Rody whispered. “Dandong was really an interesting person.”</p><br/><p>“Bayan, wait for me! I will become your nightmare tonight! I believe that the Prince’s mansion is in the West…”</p><br/><p>After confirming the direction to the Imperial Capital, he accelerated his pace.</p><br/><p>As the carriage sped to the South, Myka and Diane were silent.</p><br/><p>“You… Are you Rody’s friend?” Myka who grew up in the brothel had finally broken the ice.</p><br/><p>“What about you? Are you his lover?” Diane asked back.</p><br/><p>Myka realized that the other party had an unfriendly tone, and she just gave a cold smile.</p><br/><p>Diane felt angry when Myka laughed and could not help but say, “Didn’t you know? The only person that guy likes is Miss Nicole of the Tulip Family. He knew that Miss Nicole was about to marry the Emperor and quickly rushed back, regardless of everything... you ...”</p><br/><p>“I know.” Myka replied calmly. “I was the one who told him about Miss Nicole.”</p><br/><p>Diane looked as if she swallowed an egg whole. “You?”</p><br/><p>She turned around and no longer cared about the horses galloping in front. She looked at Myka with a surprised expression and loudly asked, “Don’t you like that guy? Why did you do that? Didn’t you know that he liked Miss Nicole? You… You…You...”</p><br/><p>“What about me?” Myka gave a wry smile and had an unusually calm expression.</p><br/><p>Diane could no longer endure it and shouted loudly, “You don’t have a chance to marry him! When he goes to Miss Nicole, what are you going to do?”</p><br/><p>“So, what?” Myka finally spoke. She raised her eyebrow as she looked at the surprised Diane and indifferently replied, “I will just be his concubine!”</p><br/>\n</div>"}