{"title": "Chapter 159: Assemble in the Imperial Capital", "id": 159, "volume": 2, "url": "http://boxnovel.org/masked-knight-chapter-159-assemble-in-the-imperial-capital", "volume_title": "Volume 2", "body": "<h1>Chapter 159: Assemble in the Imperial Capital</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 159: Assemble in the Imperial Capital</p><br/><p>Translator: GamingLife/Zenobys Editor: - -</p><br/><p>A uproar had arisen within the Imperial Capital. Even the ordinary civilians could feel that something was wrong in the Imperial Capital.</p><br/><p>Large groups of soldiers from the Central Cavalry had lined up on the streets and replaced the public security soldiers. They were fully armed as they patrolled the streets.</p><br/><p>The Imperial Guards in the Imperial Palace also looked like they were about to face a formidable enemy. Almost all of the fifty thousand Imperial Guards had been mobilized. They walk up and down on the palace city walls and the guards at the entrance of the Imperial Palace were stricter than usual.</p><br/><p>The guards of the city gates of the Imperial Capital too became even more strict. Both the commoners and the nobles were subjected to strict checks. This action cemented the fact that something was wrong in the Imperial Capital.</p><br/><p>The higher ranked nobles of the Empire had learned that the Emperor was dying. The palace also officially announced that the Empress was pregnant. The smarter ones immediately realized that a fight for the throne was about to begin.</p><br/><p>Even some of the duller nobles knew. When Prince Barond suddenly returned to the city after hearing that the Emperor was dying, they realised that he had come back to fight for the throne.</p><br/><p>Nicole now lived in the Imperial Palace and stayed by the Empress’ side every day. She did not like this at all. It was not a happy thing to face a woman who could not control her own emotions. However, Nicole could understand the Empress’ feelings. The Empress was alarmed, dejected and frightened.</p><br/><p>The only people the Empress could rely on right now were the people of the Tulip Family. As a result, Nicole was now so worried that she lost her appetite everyday.</p><br/><p>Gordon constantly provided Nicole with information.</p><br/><p>Prince Barond has returned to the city!</p><br/><p>Regiment Commander Barry of the Central Cavalry has come into contact with Prince Barond!</p><br/><p>There is an unusual activity in the Central Cavalry. They have assembled the army!</p><br/><p>Marquis Garoline has contacted Prince Barond!</p><br/><p>The Northern Legion has started to act strangely!</p><br/><p>Every time Nicole heard a piece of information, she felt that her worries had increased. According to common knowledge, the Marquis and the Lionheart Family were the trusted subordinates of the Emperor and the Empress. He also never got along with Prince Barond. In this situation, the ally that could be most easily won over would be the Marquis.</p><br/><p>However, there were two reasons why this would not work.</p><br/><p>It was also common knowledge that the Lionheart Family and the Tulip Family were at odds. Now that the Empress had relied on the Tulip Family, she would not be able to win the support of the Lionheart Family. These two families would never stand on the same side.</p><br/><p>Naturally, there were no such things as an eternal enemy in politics. Nicole clearly understood this. Garoline knew that, right now, Prince Barond and the Empress’ child were going to fight for the throne. The winner would become the new Emperor. Now, Garoline needed to decide who to support. If he successfully helped the new Emperor, then the Lionheart Family would become the greatest contributor that helped the new Emperor secure the throne.</p><br/><p>For the Marquis, this was the best opportunity for the Lionheart Family to trump the Tulip Family as the first family in the Empire. Besides that, the odds for the current situation laid with Prince Barond, not with the unborn child.</p><br/><p>Although the Marquis had always been loyal to the Abbas XI, he was not blindly loyal.</p><br/><p>The other reason for his decision was because the child in the Empress’s belly was not the child of His Majesty the Emperor.</p><br/><p>Nicole’s only peace of mind was that the Central Command of the Imperial Guards had maintained their loyalty to the Imperial family, especially Commander Gordon who, without hesitation, had declared his allegiance to her.</p><br/><p>The Imperial Guards Central Command had rejected contacts with Prince Barond. The other old generals had also announced their neutral stances. They wanted to discuss such things only after the Emperor’s condition has improved. Only God knew whether he would wake up.</p><br/><p>Nicole believed that once things turned violent, besides the other Tulip Family supporters, the Central Command would not hesitate to fight on her side.</p><br/><p>However, there was another ridiculous question.</p><br/><p>How much power did the Imperial Guards Central Command still have?</p><br/><p>In order to reduce the influence of the Tulip Family, the Emperor had weakened the strength of the Imperial Guards Central Command. On the other hand, power in one of the Empire’s four largest armies, the Northern Legion, was given to Marquis Garoline's Lionheart Family. The Central Cavalry's power was also given to the one of the Imperial Family's nobles, Regiment Commander Barry. Originally, the Northern Legion was loyal to Abbas XI or at least, that was what Abbas XI had thought. However, the Northern Legion were now Garoline’s chips, and they now supported Prince Barond.</p><br/><p>On the other hand, the Central Cavalry and Barry were close to Prince Barond. There was even less hope in gaining their support.</p><br/><p>At present, the Northwest Legion’s Regiment Commander, Elliot, was the only one left who originated from the Imperial Guards Central Command. His support would be desired, but now that Reuenthal was watching them in the Northwest, it was improbable for the Northwest Legion to be transferred back. Besides that, the Northwest Legion was already crippled after the war. How much strength could it have left?</p><br/><p>The Southern Legion was also a part of the Central Command's traditional power base . However, there was still no news from Rody ever since he left for the South.</p><br/><p>The Northern Legion had already started to assemble. Although they had not taken the next step, only God knew when the Southern Legion would arrive at the Imperial Capital.</p><br/><p>Nicole sighed as she tried to forget about these worries and kept a calm expression. She understood clearly that she was now the backbone of her faction. The Empress was totally reliant on Nicole, making Nicole feel very uneasy deep in her heart...</p><br/><p>Are my actions correct? After all, that child is Seth’s! It is not of royal blood! Prince Barond is the one holding legitimate claim to the throne. I feel like I am scheming for the throne…</p><br/><p>\"Seth. Is this part of your scheme? Although you have left, everything is still going according to your plans. You have tied everybody to your war chariot.\"</p><br/><p>Nicole hesitated again and sighed.</p><br/><p>Should it really be like this?</p><br/><p>...</p><br/><p>The soldiers responsible for guarding the Imperial Capital had all already been switched with the soldiers from the Central Cavalry. A group of soldiers wearing the uniform of the ‘Lightning God’s Whip’ guarded the four gates. They also strictly examined each person passing through the gates. Prince Barond had originally intended to ban all movements through the gates of the Imperial Capital. However, Garoline gave a different suggestion, and Prince Barond dropped that idea.</p><br/><p>After all, he had not started a coup and had not rebelled. The Emperor was also still alive. If they locked up the Imperial Capital, their opponents would spread gossips.</p><br/><p>That afternoon, at the South gate of the Imperial Capital, there were more than a dozen horses traveling on a road. In the front was an extremely fat man. Behind him was a pale-faced young man that looked frustrated and dejected. Behind the two of them were about a dozen men with cold eyes and indifferent expressions.</p><br/><p>The fat man looked at the distant city wall and then turned back to look at the pale young man. \"Little bat, is that the Imperial Capital? We are about to arrive. Why are you still so crestfallen?\"</p><br/><p>The young man gave a wry smile and replied, \"You would naturally feel relaxed but I… Sigh… I did so many things for you and am already considered a traitor to Master Simao. If I get caught… Well, do you even know what the punishment would be for us vampires?\"</p><br/><p>The fat man raised his eyebrows and said, \"I want to see who is so bold. Right now, you are one of my followers. Who would dare to harm you?\"</p><br/><p>He then looked at the city walls and laughed. \"I wonder what that Rody is currently doing. Is he locked in Nicole's embrace, kissing? Sigh… That boy looks honest, but he is also quite a playboy. A few days ago, he sent a woman to me. How annoying… If it was not because I glared angrily at her and sent her on her way, I do not even know when I would reach the Imperial Capital!\"</p><br/><p>The fat man then looked at the young man again and shouted, \"Tell me! What about that boy Darke? When will he recover?\"</p><br/><p>The young man rolled his eyes and replied, \"He would recover in about seventeen or eighteen days.\"</p><br/><p>The fat man felt relieved and said, \"That’s good. I hope Darke stays that way for a few more days. That way, he can delay those two troublesome women.\"</p><br/><p>He looked at the city walls again and laughed. \"I wonder if the Imperial Palace is really interesting… If the Emperor dares to attack Rody, I would really burn the palace down! Hahaha! Taking a dozen vampires to attack the palace would certainly be interesting!\"</p><br/><p>The young man then criticized, \"The Empire has an association of magicians and the Church. The Pope is also in the Imperial Capital. If you tried to do anything, you would be asking to die.\"</p><br/><p>The fat man hmphed coldly. \"What Magician Association? Do you think a group of magicians is worth paying attention to? As for the Pope, we could just burn down the church. There is nothing that could not be handled! What about you? These two days, you have started to talk back. Are you looking for more trouble with me?\"</p><br/><p>The young man trembled and forced out a smile as he said, \"How could I be so daring? Master Sky, you are like the sun while I am just a firefly. How could I be so daring to try and compete with you?\"</p><br/><p>Sky felt happy and was about to laugh. Suddenly, he heard someone jump out of the side of the road.</p><br/><p>The clothes that person wore were mismatched and looked as if he had stolen them from somewhere. The man’s face was out of shape; his eyes and nose were crooked. His arms were different in size, and one of his legs was shorter than the other.. He went to the middle of the road and shouted, \"I am the one that opened this road. I am the one that planted that tree. If you want to pass here…\"</p><br/><p>He looked around for a moment and then shouted, \"Leave behind a horse!\"</p><br/><p>There was a moment of silence.</p><br/><p>Suddenly, Sky burst into laughter. He laughed so wildly that he almost fell off his horse. The young man also laughed and looked at the person standing in the middle of the road in pity...</p><br/><p>The man stood calmly in the middle of the road and did not get angry when he saw Sky laugh. He calmly stood there until they stopped laughing. After that, he asked. \"Why are you laughing? Is it ridiculous that this old man is asking you for a horse?\"</p><br/><p>Sky raised his eyebrow. The young man then rushed forward and stretched out a claw towards that person...</p><br/><p>There was a miserable cry as the young man flew back, and his body ended up hanging on the tree at the roadside!</p><br/><p>\"Hm?\" Sky’s eyes gleamed. He showed a strange expression and stared at the person obstructing the road. He could not help but comment, \"A little robber like you actually have some ability...\"</p><br/><p>The man pursed his lips for a moment and then he laughed. \"In that case, give me a horse. Or at least, let me ride with you.\"</p><br/><p>Sky’s eyes opened wide as he held back his laughter. \"What did you say?\"</p><br/><p>The man sighed and loudly replied, \"The gates to the Imperial Capital are strictly guarded. I cannot fly around during the day and the guards also would not let me in with my current appearance... That is why, I am asking you for help.\"</p><br/><p>He then whimpered and just sat on the floor, with a posture that seems to say: If you don't agree then you cannot pass.</p><br/><p>Sky rubbed his nose hard. He then laughed and said, \"I can see that you are quite skilled. Even if the gate is blocked, I am sure that you could fly in or break your way in anyway.\"</p><br/><p>The man rolled his eyes and looked at Sky as if he was talking to an idiot. He then spoke an strange voice, \"Don’t you know that the guards are more strict in the Imperial Capital right now? It is said that vampires had attacked the Imperial Capital a few days ago. Now the Church have dispatched a lot of magician to patrol the town. Fly in? The moment you start flying, you would be surrounded by magicians! It is not hard to get into the city, but it would create an uproar. Why would I do that?\"</p><br/><p>After that the man whispered to himself, \"Are the people with strong domains all brainless?\"</p><br/><p>Sky’s eyes grew wide. \"What did you say?\"</p><br/><p>The man laughed again. \"Guys, lend me a horse and let me follow you into the city. It would be beneficial for all of us…\"</p><br/><p>Sky's was getting more and more curious. He was itching to beat up the man in front of him. \"Should I let you live now that you tried to rob me?\"</p><br/><p>However, this person' mysterious and strange ways made Sky extremely curious. Sky’s curiosity was his most important desire. It was also his biggest weakness.</p><br/><p>\"Fine!\" The fat man finally gritted his teeth and waved his hand. \"I will give you a horse and let you follow us into the city. I want to see what other tricks you have. The weirder it is, the more interested I am.\"</p><br/><p>Hearing this, the man on the ground laughed. He then jumped up and immediately sat on the pale young man’s horse.</p><br/><p>Sky then looked at the young man hanging on the tree and shouted, \"Little bat! Quickly catch up with us if you are not dead! If you are late, I am going to punish you!\"</p><br/><p>After that, the horses resumed their journey to the Imperial Capital.</p><br/><p>The weird man sat on his horse behind Sky. That person sighed and said, \"How interesting. A fat person with an funny mind but a strong domain. What happened in the Imperial Capital? Sigh, Rody. Why have you not shown up? This old man is going to give you a surprise!\"</p><br/><p>...</p><br/><p>Master Autumn was outside the hall calmly looking at the clouds. Although he looked calm, his heart was in a turmoil. In the past few days, he did not even dare to look at the Empress. He felt distressed every time he saw the Empress’ resentful expression.</p><br/><p>At some point in time, Nicole looked at Master Autumn’s back and sighed.</p><br/><p>Master Autumn suddenly turned and smiled. He then asked, \"Miss Nicole. Why are you sighing?\"</p><br/><p>Nicole’s charming face showed a trace of sadness. She whispered. \"Master Autumn. I know you feel bitter. You have chased Seth away for Her Highness’ benefit. However, you must know that Her Highness does not really hate you. A woman in love cannot be reasoned with.\"</p><br/><p>Master Autumn shook his head and lightly replied, \"I know. I know about this. I am not upset because of her. I am upset because of myself.\"</p><br/><p>\"Yourself?\"</p><br/><p>\"Yes.\" Master Autumn looked at the sky and smiled bitterly. \"I was laughing at myself.I have mastered the sword and reached the apex of warriors. I have reached a place others could only dream about. The world is big; I could go anywhere. However, I continue to keep watching over her, here, in the Imperial Palace. Don’t you think that it is just sad? So what if I have exceptional power and strength? People's feelings are fragile. Even if you could control the world, you cannot control your own heart.\"</p><br/><p>Nicole was silent. She followed Master Autumn's gaze and looked at the clouds helplessly.</p><br/><p>She then remembered the present situation. Would things really go according to Seth’s scheme?</p><br/><p>At that moment, the sound of hurried footsteps came from behind her. Commander Gordon, in full armor and fully equipped with weapons, strode in and loudly informed Nicole, \"Miss! The Pope has arrived. He wishes to see the Empress!\"</p><br/><p>\"The Pope?\" Nicole frowned. What is he doing here? Could it be that the Pope who never had any interest in Imperial powers now also want to fight for the throne?</p><br/><p>She looked at Master Autumn silently, and then she immediately told Gordon to leave.</p><br/><p>A bitter smile appeared at the corner of Master Autumn's lips...</p><br/><p>He suddenly remembered what Seth had said before he disappeared. \"Master Autumn. I want to warn you that the Pope has long known of your secret.\"</p><br/><p>Master Autumn sighed and smiled. \"He already knew? I tried hard to hide my strength for so long and tried not to gain any attention, but he still found out?\"</p><br/>\n</div>"}