{"title": "Chapter 164: Playing It Big", "id": 164, "volume": 2, "url": "http://boxnovel.org/masked-knight-chapter-164-playing-it-big", "volume_title": "Volume 2", "body": "<h1>Chapter 164: Playing It Big</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 164: Playing It Big</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Sky immediately rushed out when he felt the Domain Force vibration and no longer paid any attention to his companion in the room. Using the vampire’s Blood Escape technique, he flew towards the square.</p><br/><p>He saw the apparition of God in the sky bringing down his Light-Axe on the Light-Domain . He then saw Master Autumn transform into a sword and shoot towards the sky.</p><br/><p>Meanwhile, Rody's men had already reached the palace walls outside of the Imperial Palace. Tens of thousands of Central Cavalrymen were in formation around the palace gates, seemingly a wall of swords and sabers, totally blocking the entrance.</p><br/><p>Rody was feeling anxious. He could feel the power fluctuation inside the palace. The intense sword aura obviously belonged to Master Autumn.</p><br/><p>Have things already turned violent inside the Imperial Palace?</p><br/><p>The Central Cavalry soldiers outside the Imperial Palace were shocked. They could all clearly see the God apparition in the sky. The huge Light-Axe was extremely stunning. Some of them had forgotten their duties and immediately knelt on the ground to pray to God.</p><br/><p>The holy presence in the palace grew stronger and completely covered Master Autumn’s sword aura.</p><br/><p>Rody and the Wolf Fang began to rush through as the Central Cavalry soldiers were transfixed with the situation. All of them were terrified as they looked at the sky. It’s a miracle … a miracle!</p><br/><p>As Rody and his group of Central Cavalry soldiers rushed through, the surrounding ‘Lightning God’s Whip’ suddenly realized the situation. Some of their officers recovered enough to start to berate the intruders. The Wolf Fang soldiers, however, had grouped into a black mass charging into their formation.</p><br/><p>For a time, everything was a mess. Numerous cavalrymen had scattered as they threw away their scimitars and spears. Some of the soldiers even abandoned their horses and ran off. For a while, there was absolute confusion; the troops and their commanding officers were in disarray.</p><br/><p>They could only hear a rallying cry from the Wolf Fang soldiers. \"The Duke of the Tulip Family had orders to return to the Imperial Capital! Kill all who block the way!\"</p><br/><p>Thousands of people then shouted in unison, \"Kill!\"</p><br/><p>This thunderous shout and the Tulip Family’s banner fluttering in their faces, together, immediately broke the confidence of all those who would still defend their positions. They were so scared that they fell to the sides to get out of the way.</p><br/><p>It was a strange scene. Two cavalries collided. One cavalry was vigilant and murderous. The other was panic-stricken and fled everywhere. However, not one of them had even used their swords.</p><br/><p>There was no resistance at all except for one unlucky and careless person who ran towards a horse and got trampled. Just like this, Rody and the Wolf Fang broke through the Central Cavalry’s defensive line outside the Imperial Palace.</p><br/><p>The doors of the Imperial Palace opened and a group of Imperial Guards rushed out. They welcomed Rody’s group and led them in while leaving behind a large number of Central Cavalry soldiers. Their officers could only watch the dust settle in a dumbstruck manner.</p><br/><p>When Rody entered the Imperial Palace, he saw a dazzling light at the distant square. He then saw that the apparition of God got run through by the light blade. Immediately, they disintegrated with a loud explosion. The light that followed was painfully blinding. Almost no one could keep their eyes open.</p><br/><p>Rody shouted loudly and jumped off the horse. He then ran straight towards the square.</p><br/><p>He then saw everything happen. A light flashed from within Master Autumn's body, immediately splitting his body apart and disintegrating into a bloody mist.</p><br/><p>Before Rody could react, a light figure shot towards the Pope. The Pope then shot out a black light which was the Dracula Spear.</p><br/><p>Finally, Master Autumn’s soul was pierced by the Dracula Spear and was mercilessly nailed to the ground. The spear quickly consumed the soul, causing it to vanish...</p><br/><p>Rody felt like he was struck by lightning. His body trembled as he shouted, \"No!\"</p><br/><p>He trembled in anger as he felt like one of his most precious treasures was shattered. His eyes turned black, and an uncontrollable force began to fill his body...</p><br/><p>\"They killed Master Autumn! They killed Master Autumn!\" Rody muttered to himself.</p><br/><p>\"Boy! Stop now!\" Suddenly, a fat figure appeared in front of Rody. Sky grabbed Rody’s hand and shouted softly, \"Don’t be impulsive! If you go down there, you will die!\"</p><br/><p>Sky spoke hurriedly as he transmitted a gentle force to suppress the violent energy in Rody.</p><br/><p>\"They used the God’s Vanquish spell. It is not something you can handle!\" Sky spoke ruthlessly. \"That guy down there had a strong domain but he also could not resist its might. Not to mention you!\"</p><br/><p>Rody continued to struggle. \"I don’t care! They killed Master Autumn! I want to kill them all!\"</p><br/><p>Sky frowned. \"You know that Domain Force guy?\" He then shook his head and gripped Rody tightly with his hands. After that, he surrounded himself and Rody with a thin circle of light and whispered. \"Quickly calm down! Don’t reveal your dragon aura!\" He paused for a moment and then he whispered, \"That guy is not dead! His soul was just taken away! If you want to save him, calm down now!\"</p><br/><p>Rody stopped struggling instantly and looked back at Sky. He asked softly, \"Are you telling the truth?\"</p><br/><p>Sky nodded gloomily and replied, \"I did not expect that someone in this world could use God’s Vanquish. This is not a spell a human could withstand. It is not just you. Even if I go down there, I will get myself killed! God’s Vanquish is a spell to summon God's power. Do you understand? This is the power of a real God. Even those with strong domains are much weaker compared to real Gods.\"</p><br/><p>Rody gritted his teeth and asked, \"The power to summon God? Didn’t you say that God has not visited the continent for hundreds of years? How is it that they could use God’s Vanquish?\"</p><br/><p>Sky laughed bitterly and retorted. \"How would I know? God really did not appear for hundreds of years but how would I know when they would come to the human world? After all, the continent is God’s territory. They can visit whenever they want.\"</p><br/><p>Rody saw the dust gradually settle down in the square. Master Autumn was dead, and his domain gradually disappeared. The violent flow of the air also calmed down.</p><br/><p>\"How do I save Master Autumn?\" Rody trembled and asked, \"How do I save him?\"</p><br/><p>Sky frowned and replied, \"That thing down there. Wasn’t that the legendary Dracula Spear? Its black magic absorbs souls. That Master Autumn’s soul was impaled by that spear and was absorbed. It is easy to get him out, but a soul that has left the body would soon disappear. Although a person with strong domain is stronger than normal humans, in the end, they are still humans…\"</p><br/><p>\"I am asking you how to save him!\" Rody asked.</p><br/><p>Sky shook his head. \"First, you get that spear.\"</p><br/><p>Just as soon as he said that the Pope walked towards the middle of the square. He pulled the spear out of the ground and the spear immediately turned into a black light and disappeared into his sleeve.</p><br/><p>\"Sigh. That fellow from God’s religion is really not so simple. To think that he can even control a demon ...\" Sky was in deep thoughts.</p><br/><p>Rody coldly glared at the Pope and whispered. \"First, we kill him. After that, we grab the Dracula Spear!\"</p><br/><p>Sky turned impatient and shouted, \"Shut up! Do you think you can kill him? Didn’t you see that God’s Vanquish? That strong domain was immediately destroyed. Do you think you are stronger than that guy with the strong domain?\"</p><br/><p>Before Rody could reply, Sky had pulled him and shouted, \"Follow me!\"</p><br/><p>At that moment, the crowd in the Radiant Hall were all in shock. They all came back out when they saw that the situation at the square had calmed down. Numerous gold-armored warriors had been tossed around by the wind and thrown all over the square. Barond who was escorted by several men had also fallen and was struggling to stand up.</p><br/><p>The Pope, Corsica VI, had an enigmatic smile. He raised his staff high and look as if a beam of light shined down on him, enveloping him.</p><br/><p>Nicole had turned pale when she saw Master Autumn destroyed by the Church's followers. For a moment, her heart was at a loss. Suddenly, she screamed and knocked away two of the generals by her side. She rushed to the square and looked at the blood on the floor. There were only bloodstains and the remnants of Master Autumn’s broken body. Finally, she started to cry.</p><br/><p>The Empress also came out from the hall, escorted by the Imperial Guards. Her face was pale as she looked at the square. The figure that was proudly standing there could no longer be seen. She grieved, then went soft and collapsed.</p><br/><p>Nicole cried for a while. She then looked at the Pope hatefully and hissed, \"Why did you kill him? Why did you kill Master Autumn?\"</p><br/><p>Fire emitted from her fingertips. She raised her hand and shot out several fireballs towards the Pope.</p><br/><p>The Pope looked at the angry Nicole indifferently and gently raised his hand. The fireballs disappeared. After that, he spoke majestically, \"Master Autumn is a descendant of the devil. His presence is the greatest blasphemy to God! I removed him in the name of God! Do you dare to defy God’s will?\"</p><br/><p>He then gently waved his staff causing Nicole to tremble and stagger backward.</p><br/><p>Prince Barond slowly stood up and sneered. \"Very good! Your Excellency! I finally understood your true intentions! You came here to show your strength. Am I right? First, you suppressed me and then you got rid of Master Autumn! After this, the God’s religion would be able to suppress the Royal Family! The God’s religion would now forever be great! Am I right?\"</p><br/><p>Corsica VI laughed coldly and said, \"Prince Barond, the God’s religion is only protecting the servants of God. I am only here to punish the blasphemous heathen. As for the dispute between you and Her Highness the Empress about the Crown Prince, we have all already seen what happened just now. Have you still not given up?\"</p><br/><p>All the nobles in the hall had finally come out and looked at the Pope in awe. The shocking scenes earlier had already surprised them too much.</p><br/><p>The Empress was supported by a few people. Her voice trembled. \"Your Excellency the Pope,… You…\"</p><br/><p>Corsica VI shook his head and replied, \"Your Highness. Master Autumn is a Devil’s descendant. I only killed him to defend God’s dignity. We do not intend to oppose the Royal Family. Concerning the matter of the Crown Prince, we maintain our previous stance.\"</p><br/><p>Garoline also came out from the crowd and showed a complicated expression. He hesitated for a moment but still spoke, \"Impressive power! Impressive killing intent!\"</p><br/><p>Garoline then laughed, his laughter full of ridicule, and coldly said to the Pope, \"Your Excellency. You have suppressed Prince Barond, and then you killed one of Her Highness’ most powerful subordinate. It is really hard to figure out your stand.\"</p><br/><p>He then looked at Barond and said loudly, \"Your Highness. Now that it has turned out like this today, we might as well just leave! The Crown Prince matter stops here. Without His Majesty’s orders, nobody can elect a Crown Prince. Otherwise, the nobles and loyal ministers will defend the dignity of the Thorn Flower Family!\"</p><br/><p>He then went to Prince Barond and whispered. \"Your Highness. Let us leave quickly for today. We still have the ‘Lightning God’s Whip’ and the Northern Legion. However powerful the Pope is, he cannot deal with thousands of soldiers on his own. Although we have lost face to the Pope today, our opponent has lost a strong master. As long as the issue of the Crown Prince is not resolved, we will still have an opportunity!\"</p><br/><p>Prince Barond nodded and grunted coldly. He pushed away his subordinates that were supporting him and got ready to leave.</p><br/><p>The large gate in front of the square then suddenly opened and large groups of soldiers started to enter. The black-armored Wolf Fang soldiers were on the left, the Central Cavalry soldiers were on the right and the ‘Lightning God’s Whip’ soldiers were right behind them.</p><br/><p>The two sides were incompatible with each other and stood on different sides of the square.</p><br/><p>The Duke of the Tulip Family’s expression was filled with grief. He glared sharply at the Pope as he strode towards Nicole and held her at her shoulders. When she looked at Rody, she felt her body turn soft and almost fell down. Tears clouded her eyes as she cried, \"Autumn… Master Autumn is dead!\"</p><br/><p>Rody nodded and whispered. \"I know. Don’t worry. My friend says that there is a way to save him.\"</p><br/><p>The Wolf Fang soldiers rushed to protect Rody from all sides. Rody then turned to look at the Empress at the top of the steps, took a deep breath, and loudly said, \"The Duke of the Tulip Family responds to Your Highness’ summon and have returned to the Imperial Palace. If anyone dares to plot against you, the Duke of the Tulip Family swears to make him die a cruelest death!\"</p><br/><p>The Wolf Fang soldiers drew their scimitars and shouted. \"Long live the Tulip! Love live Her Highness!\"</p><br/><p>The Central Cavalry continued to protect Prince Barond. Although their numbers were more than the Wolf Fang, they did not look as powerful or imposing. Some of them even seemed to look fearful.</p><br/><p>The people on the square were immediately divided into two factions. The first faction was with Prince Barond, Garoline and the Lightning God’s Whip. The other faction was the Wolf Fang who were protecting the Empress, Rody and several nobles and ministers behind them.</p><br/><p>Some of these people supported the Empress. However, there were also some that actually supported Prince Barond. As the Wolf Fangs were standing guard in the middle, their position was awkward. They wanted to go to Prince Barond’s side. But seeing the fearless Wolf Fang soldiers and the sudden return of the magnificent Duke, they started to sway and did not take a single step.</p><br/><p>Prince Barond gave a vicious expression and shouted, \"Duke of the Tulip Family! Do you intend to follow the Empress’ rebellious plans? To return to the Imperial Capital without His Majesty’s orders would result in death! Now that you are here, do you intend to kill me in the Imperial Palace?\"</p><br/><p>Commander Barry started to sweat and gritted his teeth. \"The ‘Lightning God’s Whip’ is traditionally loyal to the Thorn Flower Family!\"</p><br/><p>He then gave an order, and the Central Cavalry soldiers then drew their weapons. The two factions glared at each other and a close combat was imminent.</p><br/><p>Corsica VI and the Bishops stood in the middle of these two factions and frowned. \"Your Highness, Duke, please calm down!\" He then loudly said, \"His Majesty the Emperor is still alive. Do you want to create a river of blood in the Imperial Palace? Do you want the blood of God’s servants to flow in vain?\"</p><br/><p>Prince Barond felt perturbed. However, Rody had started to speak before he had a chance to say anything.</p><br/><p>Rody’s voice was devoid of respect as he said to the Pope, \"Your Excellency. This is the internal affair of the Royal Family. Didn’t the God’s religion say that they would not intervene? You just said that you would only defend the dignity of God. This matter is not related to the dignity of God! You said that Master Autumn is a heathen and killed him! Can you call all of us heathens and kill us all?\"</p><br/><p>He then shouted, \"Ask my men! See if they listen to your orders, the Emperor’s orders, or my orders!\"</p><br/><p>The Pope’s expression turned ghastly pale and had almost started to tremble. He looked at the Duke with a fierce expression.</p><br/><p>Sieg was standing behind Rody when he felt someone pull him. He turned around and saw an old general of the military.</p><br/><p>\"Sieg. Has the Duke gone mad? Prince Barond controls the Central Cavalry and has two hundred thousand soldiers in the Imperial Capital! How many soldiers does your Wolf Fang have?\"</p><br/><p>Sieg nodded his head and replied, \"So what if they have two hundred thousand soldiers? Against such useless people, each one of my elite soldiers could easily defeat ten!\"</p><br/><p>Corsica VI laughed coldly and slowly left the square. He no longer tried to interfere.</p><br/><p>Rody felt anxious watching him walk away. He immediately pulled Sky to speak to him. Sky who was standing inconspicuously within a large number of Wolf Fang soldiers whispered, \"What?\"</p><br/><p>Rody frowned and said, \"That spear is still in his hands!\"</p><br/><p>Sky shook his head and said, \"You cannot grab it now. There will be a way in the future. He is the Pope. He cannot take a demon weapon with him everywhere he goes.\"</p><br/><p>Rody then took a deep breath and whispered, \"Alright. Let us deal with Prince Barond first.\"</p><br/><p>The square was now silent as both sides no longer spoke. The soldiers glared at each other. However, many of the Central Cavalrymen were uneasy while the Wolf Fang soldiers did not feel any fear. They had fought against the enemy armored cavalry in the Northwest before. Every single one of them has spilled blood and seen death. Besides that, they were now flying the Tulip Family’s banner. As a result, they were waiting for their commander to give them the order. It did not matter whether it was the Prince or the Marquis. They would kill them first and ask questions later.</p><br/><p>Nicole had calmed down and whispered into Rody’s ear. Rody nodded and stepped forward. He then said, \"Prince Barond. You have the title of Prince, but you have secretly mobilized the army to besiege the Imperial Palace! General Barry. You are the Regiment Commander of the Central Cavalry but you have taken over the defenses of the Imperial Capital without the orders of His Majesty the Emperor! These are serious crimes! Quickly tell your subordinates to lay down their weapons and apologize to the Empress!\"</p><br/><p>Prince Barond laughed wildly and said, \"Nonsense! Duke! You were dispatched to the South under His Majesty’s orders! To return to the Imperial Capital without his orders would mean the death penalty! I am the Prince of the Empire! A legitimate heir of the Thorn Flower Family! Who dares to say I am guilty? That woman is not qualified to judge me!\"</p><br/><p>At that moment, large numbers of Central Cavalry soldiers continued rushing into the square. Barond’s men grew in numbers while the nobles and the Empress started to turn pale with fear.</p><br/><p>The Central Cavalry soldiers had stationed a lot of people outside the Imperial Palace. At this moment, the tense situation here caused these people to rush in. The small numbers of Imperial Guards could not stop them.</p><br/><p>People entered the square from all directions. Some were from the Central Cavalry while others were Imperial Guards. All of the soldiers seemed to have a tacit understanding and each lined up together with their own faction.</p><br/><p>More people entered the huge square until it was almost fully occupied.</p><br/><p>At some point in time, Gordon approached Rody and said softly, \"Your Excellency. They have too many people and have surrounded the Imperial Palace. I have ordered the Imperial Guards to concentrate our defense here. We will gather our men to defend the Empress and push them back.\"</p><br/><p>Rody coldly asked, \"Why should we chase them out?\" Rody glanced at Gordon and coldly said, \"We will eliminate them right here.\"</p><br/><p>Gordon started to panic and whispered. \"Your Excellency. They have two hundred thousand men. The Imperial Guards have less than fifty thousand. Along with the Wolf Fang, we will only have about one hundred thousand soldiers. I am afraid…\"</p><br/><p>Rody shook his head and then looked at Nicole. \"What do you think? Are you afraid?\"</p><br/><p>Although Nicole had turned pale, she still smiled. She had a meaningful gaze as she whispered, \"I am not afraid… I will listen to you.\"</p><br/><p>Rody then said in a low voice, \"If Prince Barond had not cooperated with vampires, Jojo would not have died. No matter what, I will not let him live!\" He then gritted his teeth and drew his sword. He was about to give the order to fight.</p><br/><p>Suddenly, rapid footsteps came from the corridor behind the hall, and then several palace servants ran out.</p><br/><p>These people turned pale from fright when they ran out and saw the armies gathered at the square. Two of them went soft in their limbs and almost stopped. The nearest servant then threw himself to the ground in a panic and shouted, \"Your Highness the Empress. H-H-His His Majesty the Emperor has woken up!\"</p><br/><p>His voice was not loud, but in the quiet square, it was crystal clear.</p><br/><p>Prince Barond trembled, and his face turned pale. He immediately looked at Garoline’s face and saw that the old Marquis also had a similar expression.</p><br/><p>\"Impossible!\" He could not help but whispered. \"Im-Impossible! How could he have woken up? I…\"</p><br/><p>Garoline immediately grabbed him and whispered, \"Your Highness!\"</p><br/><p>Prince Barond trembled and had almost fainted.</p><br/><p>The Emperor has woken up? The Emperor has woken up!</p><br/><p>He had schemed for so long, and now that the Emperor was on his deathbed, he finally had the opportunity to fight with the Crown Prince for the inheritance of the throne.</p><br/><p>But now the Emperor did not die and even woke up.</p><br/><p>Since the Emperor did not die, the whole issue of ‘inheriting’ the throne would become a joke.</p><br/><p>Garoline also had a deathly pale face. He saw his entire life as an official crumble before him. He could already see the downfall and extermination of the Lionheart Family.</p><br/><p>The interesting part was that while this was truly bad news for Barond, it also caused the people from the Empress’ faction to almost faint from fright.</p><br/><p>The Emperor had woken up.</p><br/><p>When the Empress heard this, she almost could not stand still.</p><br/><p>She knew that the child in her stomach did not belong to the Emperor. She knew it. The Emperor would also know it.</p><br/><p>There would be no problem if the Emperor was unconscious, but the Emperor had woken up.</p><br/><p>Nicole’s expression also changed. She trembled and almost fell into Rody’s arms.</p><br/><p>We are doomed!</p><br/><p>This was Nicole’s first thought.</p><br/><p>The Emperor would know that the child in the Empress' stomach did not belong to him. In that case, the Tulip Family would not be able to escape from being accused of plotting together with the Empress.</p><br/><p>Just like Garoline, Nicole could also see the downfall and extermination of the Tulip Family.</p><br/><p>Rody sighed and gently held Nicole. He whispered, \"Do not panic. No matter what, I will protect you.\"</p><br/><p>The servants were prostrated on the ground and could not see everyone’s expression. He trembled as he continued, \"His Majesty… His Majesty gave the order for the Empress, Prince Barond, Duke, Marquis and all of you to go to his sleeping quarters.\"</p><br/><p>Everyone had a complicated expression. Some looked joyful while others looked sad. Corsica VI who was standing at the side of the square also had a conscientious expression. He gave a meaningful glance as he furrowed his eyebrows.</p><br/><p>Only Sky had a strange expression. He gave a strange smile and whispered. \"This guy. He is really playing it big.\"</p><br/>\n</div>"}