{"title": "Chapter 181: Comprehension", "id": 181, "volume": 2, "url": "http://boxnovel.org/masked-knight-chapter-181-comprehension", "volume_title": "Volume 2", "body": "<h1>Chapter 181: Comprehension</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 181: Comprehension</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>\"I hate people who scheme against me! It is really disgusting!\" Rody spoke as he looked at Fielding.</p><br/><p>Fielding started to have cold sweat.</p><br/><p>Dead? Did he die just like that? The Gray-Robed Saint of the Temple was so easily killed? Even if that other guy was a Sacred Swordsman and therefore stronger than the Gray-Robed Saint, the difference in strength between the two should not have been that large.</p><br/><p>The black flames burnt until nothing was left. Fielding’s heart felt heavy watching the sword fall to the ground.</p><br/><p>\"Shit! The God Slaying Bow!\" Fielding suddenly exclaimed and jumped up. He went over ten meters high and looked but there was nothing in the sky. He could not find the God Slaying Bow.</p><br/><p>\"Are you looking for this?\" Rody looked at Fielding, who was still searching in the sky. A burst of flame appeared in his hands. He slowly stretched out his hand. The short bow was wrapped in a black flame. However, the beautiful silver color of the bow had dimmed inside the black flames.</p><br/><p>Fielding felt really frantic. He dashed down again and stood in front of Rody. \"Why is it in your hands?\"</p><br/><p>\"This?\" Rody lightly replied, \"I do not know. When I killed that guy, I remembered this and then it just appeared in my hands. Fielding. Is this the God Slaying Bow?\"</p><br/><p>\"Give it back to me!\" Instead of stepping back, Fielding moved forward to grab the bow. Rody waved his hand forward, instead of dodging. However, before Fielding's hand could come into contact with the black flames, he immediately pulled his hand away as if he had just experienced an electric shock. He stepped back a few steps and exclaimed, \"Hellfire! Aren’t you a Sacred Swordsman? Why is it that you could use hellfire?\"</p><br/><p>Rody shook his head and pondered for a bit. After that, his eyes flashed and he smiled. The flames in his hands flickered and then the bow disappeared.</p><br/><p>Fielding raised his sword and pointed it at Rody. \"Give it back to me! That is an artifact of our Temple!\"</p><br/><p>Rody ignored him and pulled out the Dragon Fang Sword from the ground. He waved it twice and then he frowned and said, \"Something does not feel right…\"</p><br/><p>Fielding looked somber as he gritted his teeth. \"Duke of the Tulip Family. It is not right for them to plot against you. However, you have already killed the Gray-Robed Saint. We are even now! Please return the bow!\"</p><br/><p>Rody looked up at Fielding. He then lightly said, \"Come and take it if you have the skills!\"</p><br/><p>Fielding did not hesitate and golden fighting energy burst from his body. He charged down and slashed. Rody shook his head, his eye twitched as though he was still thinking. He did not react quickly. Not like the duel earlier where he had used a fierce fighting energy. Instead, he just merely raised his sword.</p><br/><p>Fielding immediately felt something strange. His opponent’s sword had easily broken through his golden energy and struck hard at the tip of his sword.</p><br/><p>Cling! A crisp sound rang out. Fielding felt as if a strange twisting force came from the sword. He instantly felt a sharp pain in his arms and was startled. His hand trembled and he almost dropped his sword. He turned quickly, jumping away a few steps and looked at Rody with a surprised expression. \"What kind of move is this?\"</p><br/><p>Rody was also frowning as he shook his head. He thought to himself and said, \"I think it is like this…\" He suddenly glanced at Fielding and lifted his sword forward like a poisonous snake. It was a blur in Fielding's eyes. He could not see the attack clearly. He could only see the sword point in front of him and hastily raised his own sword to block it.</p><br/><p>The clash flung Fielding away. He staggered a few steps after crashing before he could stand firmly again.</p><br/><p>\"What is going on!\" He was terrified. His opponent's sword was not wrapped in fighting energy but that attack felt like it had the force of a heavy hammer.</p><br/><p>Rody’s blank expression had vanished and he smiled lightly. He then sighed gently and said, \"I understand. I finally understand…\"</p><br/><p>Facing the Paladin, he unexpectedly closed his eyes and muttered, \"The sword in my hand is my anger and spirit. It strikes like the Autumn wind and is cold like Winter… Master Autumn. This must be what you mean by real swordsmanship.\"</p><br/><p>Rody then shook his head and turned to leave.</p><br/><p>\"Duke of the Tulip Family!\" Fielding roared. Gritting his teeth, he grabbed his sword with two hands and slashed out a golden spiral wave at Rody.</p><br/><p>Rody frowned and turned around. Instead of using his sword, Rody merely raised his left hand with the palm opened. The spiral wave struck his hand and disintegrated!</p><br/><p>There was no explosion, no splinters, or radiation of energy.</p><br/><p>It just disintegrated.</p><br/><p>\"Fielding,\" Rody called out. \"You can no longer defeat me. You did not kill me just now. So, I will no longer fight with you. Our duel ends here.\"</p><br/><p>\"Nonsense!\" Fielding said with a pale expression. He had clearly seen how his opponent had resisted his wave of fighting energy with just one hand. However, the pride of a knight does not allow him to give up so easily. He shouted, \"I am a Paladin of the Temple! Do you think you can defeat me? Who was the one who struggled so badly just now?\"</p><br/><p>\"It was me,\" Rody admitted calmly. \"Just now, I was not a match for you. Although I had reached the strength of a Sacred Swordsman, in terms of strength and experience, or knowledge, I was a little bit weaker than you. I could fight with you for so long earlier because I relied on my body's resistance.\"</p><br/><p>\"Then let us continue!\" Fielding clasped the sword in his hands.</p><br/><p>\"No need.\" Rody shook his head and said, \"You no longer can defeat me, Knight Fielding. Thank you for your help earlier. It made me comprehend some strange things. I think I have broken through something…\"</p><br/><p>\"What did you break through?\" Fielding eyes grew wide with surprise as he said, \"Are you talking about Domain Force?\"</p><br/><p>Rody shook his head and replied, \"No. It is not Domain Force. However, I can feel myself standing in front of a door. If I can push this door open, I would comprehend Domain Force. What I meant was that I can now understand the rules a little.\"</p><br/><p>Fielding’s fighting energy was still burning brightly but Rody was standing silently. When he heard Rody’s words, Fielding could not help but laugh and said, \"You talk too much. Let's see how you actually fare!\"</p><br/><p>Rody frowned and looked at Fielding. He then lightly said, \"Do you know that we are at the same level? Do you know what is the biggest difference between us and those with Domain Force? He slowly pointed at Fielding and said, \"It is how we utilize the power!\"</p><br/><p>\"There are rules in this world. That rule is that nothing is eternal, including power. Someone once told me that you are not stronger just because you have more power. I understood this today.\" Rody laughed. \"Let me tell you this before I leave. Your moves and strikes were very powerful and earth-shattering... However, it disappeared before it could hit your opponent. You have a lot of fighting energy. The golden light was bright and dazzling. You just need to restrain your fighting energy. Fielding. Do you know that it is easy to blow a balloon? But, it is difficult to compress that balloon into a point. Like this…\"</p><br/><p>Rody stretched out both of his hands. There was no fighting energy and the movement was casual.</p><br/><p>In front of Fielding, Rody only pointed his fingers. There was a loud explosion and a large and deep ravine immediately appeared.</p><br/><p>Rody then strode away, leaving behind the surprised Fielding.</p><br/><p>He was not worried that Fielding would attack him from the back. Based on his character, Fielding would not attack someone from the back. Besides that, Rody was not afraid of Fielding even if he attacked.</p><br/><p>Rody gathered his disorganized men like Sieg and the others and went back to the city, leaving behind the puzzled Fielding. Fielding instinctively put down his sword, as if using it as a crutch to support himself.</p><br/><p>The gates opened. Rody brought his subordinates into the city while numerous soldiers, lined up on both sides, cheered, \"Long live the Duke! Long live the Tulip Family!</p><br/><p>The people on the walls also cheered loudly. In their eyes, Rody looked like a god. The scene they saw earlier was shocking. The kind of battles with fierce wind and rain, together with the huge light ball was like the legendary battles of the undefeatable God of War.</p><br/><p>Rody was riding Garros. The horse did not suffer any injuries. The fierce wind made it run away but then the horse came back after that.</p><br/><p>After the cheering, only the mouths of two people remained shut. The first one was Milo while the other was the Bishop Elder of the God’s religion.</p><br/><p>Milo had a complicated expression while the Bishop Elder had a strange gaze.</p><br/><p>\"That scene earlier. Was that the Dragon Transformation?\"</p><br/><p>The most depressed person was undoubtedly Tiger. He had carefully prepared that duel. He originally thought that sending out the Paladin and then using the Dragon Break spell would allow them to get rid of the Duke of the Tulip Family. Everybody knew what would happen if the banner of the Duke was lost.</p><br/><p>Now the Dragon Break spell was destroyed, dozens of sorcerers were seriously injured and many more have temporarily lost their sorcery ability. Most importantly, the Gray-Robed Saint has perished and the God Slaying Bow was lost.</p><br/><p>Either one of these incidents could finish him off publicly.</p><br/><p>What kind of image did the Temple Saints have? On the Roland Continent, the Saints have more authority than the Kings except for the Sauron Kingdom. They had one of the highest positions in the Temple. Now that they lost the God Slaying Bow...Tiger shuddered at the thought.</p><br/><p>Fielding was silent after he returned to the barracks. He did not even bother to look at Tiger. He felt extreme disdain towards the commander of the coalition army. In Fielding’s point of view, these people have tarnished an honest duel.</p><br/><p>Tiger also did not dare to approach Fielding as he was a Paladin.</p><br/><p>The various kingdoms' army commanders were anxious and noisily talking among themselves. Tiger was no longer patient and he was angry as he shouted, \"Fine! You want to fight? You want to fight? Go ahead then! From today onwards, I want a total siege! All the sorcerers will attack too! I don't believe that we cannot kill the Duke of the Tulip Family!\"</p><br/><p>Everybody became quiet when they saw their supreme commander got angry. Tiger then, in a low voice, ordered murderously. \"From tomorrow onwards, I want a full siege. Those who go up there are not allowed to return even if they are the last one alive! Those who try to escape will be executed!\"</p><br/><p>The next day, the Empire soldiers in Thunder City immediately felt a different kind of oppressive atmosphere.</p><br/><p>When the sky had just turned bright, the Roland army has already begun their siege. In the morning, three assaults were repelled. By the afternoon, the Roland army started to become desperate.</p><br/><p>Tiger had killed four commanding knights and six hundred soldiers and officers that retreated. He threw their heads to the ground and shouted, \"I have already spoken very clearly. Nobody is allowed to retreat, even if we are down to the last man!\"</p><br/><p>Tiger’s personal army formed a solid line at the rear of these soldiers with their swords and shields. Those that retreated would die while those who advanced could fight for their lives. The Roland soldiers finally started to demonstrate unprecedented bravery and ferocity.</p><br/><p>Since they would die if they retreated, it would be better to go charge in front and fight. At the very least, they would have a ray of hope.</p><br/><p>Group after group of Roland soldiers charged to the walls and erected their ladders. The soldiers scaled the ladders with red eyes. They see their companions above scream miserably as they fall down the walls when hit with falling rocks. Others did not even bother to look and continued to climb the ladder that had been dyed red with blood.</p><br/><p>On the walls, the archers continued to shoot their arrows. They no longer needed to aim! The Roland army below had packed tightly together as they held a gigantic wooden log to ram the gates, miserably crying out again and again. But no one retreated. The Roland soldiers were covered in blood. Some wished that they could also use their heads to smash the gate open.</p><br/><p>More than ten thousand Roland soldiers sieged the city the entire day. In the afternoon, they had managed to scale the wall and occupied a small section of it. However, the Flame Warriors managed to recapture it with their counterattacks.</p><br/><p>The surprising thing was, even though the Roland soldiers had been pushed back to their ladders, their escape route, not one of them retreated further and they fought to the last man!</p><br/><p>In the evening, the walls of the city were covered with corpses. Below the walls, there were piles and piles of corpses. The air was filled with the stench of blood. The floors of the city walls were wet and slippery, saturated with blood. Blood puddles had also formed in some places.\"</p><br/><p>It was a shocking sight. There were broken limbs everywhere. A step in any direction would meet with a broken body or broken sword. Exhausted soldiers gasped for breath at the sides, and severely injured soldiers mournfully begged to be put out of their misery.</p><br/><p>That pile of dead bodies below the wall had blocked the gate. Thousands of corpses, with arrows in them, lied where they fall beside the wooden ramming log. These soldiers fought to their last drop of blood.</p><br/><p>The rugged gates of Thunder City had been damaged. The gates were made from the scarce ironwood in the Radiant Empire. It was the same kind used by the Roland armies to build ships. Although the ironwood was reinforced with iron bars, some of these were broken after a day of fierce fighting. Those that were not broken were twisted.\"</p><br/><p>The soldiers of the Empire were busy carrying corpses and wounded soldiers down the wall. Many others also recovered the rocks dropped from the walls. The buildings in Thunder City near the gates had been demolished and the stones carried to the city walls for defense. Some were used by craftsmen for strengthening the walls.</p><br/><p>Outside the city, hundreds of Roland army soldiers in white were cleaning up the battlefield. The carried back the wounded and the dead Roland army soldiers. The soldiers of the Empire also did not shoot them with their arrows. Both parties had a silent, somber mutual understanding in carrying out their cleaning work.</p><br/><p>Both continent's sorcerers and the magicians took this opportunity to recover their energy. Both sides had clashed against each other several times in the fierce battle that day. However, the Empire magicians were at a total disadvantage. This was because the Roland sorcerers had used combined sorcery to increase their power. The magicians of the Empire were defeated and some of them perished.</p><br/><p>Even when Rody fought with the sorcerers he had to rely on his tough body to ward off the blows. After a day of battle, Rody was extremely exhausted.</p><br/><p>That night, the sky was dark as the moonlight was bleak; as though the heavens sighed. The soldiers on the castle wall sat on the floor as they gathered in small groups. They were calm and occasionally they looked at the golden Tulip Banner on the gates.</p><br/><p>The soldiers' eyes were steadfast, filled with trust and worship.</p><br/>\n</div>"}