{"title": "Chapter 195: Bitter Then Sweet1", "id": 195, "volume": 2, "url": "http://boxnovel.org/masked-knight-chapter-195-bitter-then-sweet1", "volume_title": "Volume 2", "body": "<h1>Chapter 195: Bitter Then Sweet1</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 195: Bitter Then Sweet1</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>The military office in the Imperial Capital was very busy in the past few days, dealing with the post war matters. Proper arrangements were made for hundreds of thousands of prisoners of war. Arrangements also were made for the civilians that lived in the North. While the Duke’s strategy of luring the enemy was effective, the issue of restoring was no longer Rody’s problem.</p><br/><p>News, both good and bad, kept coming into the Imperial Capital.</p><br/><p>Good news came from the northwest. The Northwest Legion under the command of General Elliot, the Empire's new star, had repelled the tenacious invasion of Reuenthal of the Great Moon Kingdom. Reuenthal was unable to accept defeat after General Elliot's earlier victory at Trier Fortress. He once again led his army to attack Watt Fortress. The Northwest Legion, led by General Elliot and the cavalries of the grasslands fought at Watt Fortress and both sides suffered losses. In the end, Reuenthal had to retreat with his tail between his legs. However, Elliot played a trick on his opponent while they were retreating. He dispatched about ten thousand light cavalries to ambush the supply units of Great Moon Kingdom. Although they called it an ambush, it was closer to harassment. After all, a cavalry of about ten thousand would not be any threat to the Great Moon Kingdom who had tens of thousands of cavaliers. Besides that, the Northwest Legion's cavalry was inferior compared to the grassland's heavy cavalry.</p><br/><p>However, Commander Gieslund of the ten thousand cavalrymen was an excellent commander who remarkably completed General Elliot's task.</p><br/><p>When Reuenthal’s reinforcement army came to help, the Empire’s ambush cavalry had already retreated. They only left behind the ambushed supply unit. More than half of the supplies had already been burned.</p><br/><p>At the end of the north crusade, the second war in the Northwest Region also ended. After losing their Roland allies on the battlefield, the Great Moon Kingdom wisely requested to make peace with the Empire.</p><br/><p>However, this time, the peace talk conditions would depend on how much the skeleton wished to extort from the Great Moon Kingdom.</p><br/><p>Besides the news of the victory in the Northwest, there was another major news. The Duke of the Tulip Family had taken leave from His Majesty the Emperor and returned to his manor in the Westwood province to rest. Everybody guessed that the Duke’s injury was even more serious than they had imagined.</p><br/><p>That news had caused some people in the Imperial Capital to feel restless. Fortunately, news of the victory in the Northwest had eased off that atmosphere.</p><br/><p>Finally, after three days, the Duke of the Tulip Family and his beautiful older sister left the mansion of the Duke of the Tulip Family in the Imperial Capital. Of course, the mansion was now known as the mansion of Marshal Duke of the Tulip Family.</p><br/><p>Under the escort of a group of WolF Fang soldiers and Imperial Guards, they left the Imperial Capital and journeyed to the Westwood province.</p><br/><p>The Wolf Fang was known to be under the command of the Duke of the Tulip Family. Their actions of escorting the Duke was naturally not met with any criticism. However, the presence of the team of Imperial Guards was unexpected.</p><br/><p>His Majesty the Emperor seemed to really favor the Tulip Family. He even ordered the Imperial Guards specialized in protecting the Imperial Family to safeguard the Duke of the Tulip Family...</p><br/><p>Marquis Garoline also had a more detailed information regarding that. The captain of these two thousand Imperial Guards was the newly appointed Court Warrior, Viscount Rody!</p><br/><p>\"Looks like, His Majesty is using a different approach to win over the Tulip Family...\" Garoline's expression was somewhat complicated.</p><br/><p>Milo frowned and asked, \"Uncle, should I dispatch some people to carefully investigate this Rody?\"</p><br/><p>Marquis Garoline shook his head and said, \"Investigate? Don’t forget, he is His Majesty the Emperor’s man…And maybe he is… Investigate him? Can you guarantee that your action would not be noticed by others? If His Majesty the Emperor found out that we are investigating Rody, what would His Majesty think? This is the kind of things that cannot be investigated as it involves privacy of royalty. Even if you know, you have to pretend not to know. If you do not know, it is best not to ask any question!\"</p><br/><p>Rody was wearing the armor of the Imperial Guards and was riding in the middle of the Imperial Guards. Rody was not familiar with the other Imperial Guards around him. In just a few days, he already became their superior. Obviously, those people were very respectful of Rody and even revered him.</p><br/><p>In fact, since the award ceremony, rumors of that young hero of the Empire had spread extremely quickly. Although those kinds of news could not be openly written about in the newspapers, it had still quickly spread throughout every corner of the Imperial Capital.</p><br/><p>At that moment, many officers and soldiers of the Imperial Guards suspected that their young superior was in some way related to His Majesty the Emperor.</p><br/><p>After all, the personages of the upper ranks of noble society and the Imperial Family usually have many mistresses. It would not be unusual to have one or two illegitimate children. However, His Majesty the Emperor’s skill at concealing that was really admirable.</p><br/><p>The East was covered with miles of clouds while the West had turned red with the setting sun. The clouds in the sky looked like a greenish gray sheer canopy. Rody took a deep breath and with a relaxed feeling looked at the wonderful sight of the horizon. After that, he sighed.</p><br/><p>He felt extremely relaxed after leaving the Imperial Capital. Since the start of the war until then, he hardly had time to rest. Now, he had some free time; no nobles nearby eagerly watching him, no war and no political squabbles. He was just accompanying his beloved to Westwood. Since the ‘Duke of the Tulip Family’ was there to recuperate, he could just treat it as a holiday.</p><br/><p>As he was thinking about himself, a horse immediately rushed up from behind. One of the Duke’s guards went to Rody’s side and said, \"Lord Rody, His Excellency the Duke invites you to see him in his carriage.\"</p><br/><p>Rody nodded and smiled. While being looked at with envious eyes, Rody turned his horse around and rode back to the carriage at the back.</p><br/><p>A huge carriage was in the middle of the cavalry formation. The carriage was specially modified and was two to three times bigger than an ordinary carriage. Its windows were sealed because His Excellency the Duke could not be exposed to the wind until his injury had healed.</p><br/><p>The driver of the carriage and the Wolf Fangs who were guarding the carriage were all the personal bodyguards of the Duke of the Tulip Family —these warriors were those that had been transformed into vampires.</p><br/><p>The Wolf Fangs and the Imperial Guards looked at Rody enviously. It looked like the Duke really value this young man. Everyone has not seen the Duke for a very long time, but the Duke will only call him into the carriage to discuss some matters for a very long time every day...</p><br/><p>However, that was not surprising as the young Viscount was originally the Deputy Captain of the Duke’s bodyguards. Naturally, he was the Duke’s trusted subordinate.</p><br/><p>Rody took a deep breath and gently tapped on the door of the carriage. Immediately the door slowly opened a little. A pair of white and fair hands gently held the door open and a beautiful face came into view.</p><br/><p>Nicole gently looked at Rody, smiled and softly said, \"Come in, Lord Rody.\"</p><br/><p>Once the door was closed, Nicole snuggled into Rody’s arms. Rody held Nicole and gently sniffed her aromatic hair. He held her face and whispered, \"Why did you call me in again? This is not too safe. Others may suspect something. Didn’t we agree to wait until we reach West Hill where we would have more opportunities to meet then?\"</p><br/><p>Nicole shook her head and revealed a reluctant expression. \"You wouldn’t understand. Being alone in this carriage is extremely suffocating! Although it is said that I am inside this carriage to take care of the His Excellency the Duke… Sigh... I cannot even open the windows of this carriage.\" Nicole then raised her head and looked tenderly at Rody. \"I want you to sit with me!\"</p><br/><p>Rody’s heart turned soft. When he looked at her beautiful face in front of him, he could not help but bend forward to kiss her and whispered, \"Alright, I will accompany you.\" He smiled and softly said, \"The scenery outside is really good. We have already entered the Westwood Province. The Tulip Family’s fief is really a wonderful place. We passed by a large river just now. The scenery at the river was very beautiful.\"</p><br/><p>Nicole smiled and gently leaned on Rody’s chest. They held each other as they sat in the carriage. Nicole closed her eyes as she lazily rested the back of her hand on Rody’s waist. She softly whispered, \"That large river? That must be the Red River2. It is the largest river in Westwood. I often played there when I was younger. I could still remember the time father often took us there…\" Although her eyes were closed, she had a sweet smile. \"When I was younger, I liked to run barefooted in that river. The water was clear and cool ...\"</p><br/><p>Rody gently stroked her hair and smiled as he said, \"Well, it must be very beautiful.\"</p><br/><p>Nicole opened her eyes and asked, \"How do you know it must be very beautiful? You have never seen it before.\"</p><br/><p>Rody turned his eyes and laughed, \"I meant that your feet must be beautiful. I have never seen the river but I have seen your feet before…\"</p><br/><p>Nicole’s face turned red. She bit her lips and cursed, \"You have learned bad things! The previous Rody would not say this kind of things!\"</p><br/><p>\"Haha…\" Rody laughed, \"Is it really bad to say that? Last time, when you kicked me, I had already seen your feet…\" Rody then looked at Nicole’s shy face. Smelling the delicate fragrance of a woman, he could not help but hold Nicole in one hand and stretched out the other towards her feet. He then laughed and said, \"Here, this is the foot you kicked me with!\"</p><br/><p>Nicole was about to refute when she suddenly realized her foot was caught by Rody. She could not help but whimper. She did not struggle but her face turned even redder. She looked at Rody and said, \"At first, you were just a thief that broke into my family home. If I did not kick you, then what…\"</p><br/><p>Before Nicole could finish her sentence, her mouth was already blocked. Rody was already pressed against her body and could not help but kiss her soft lips.</p><br/><p>Not knowing for how long, Nicole finally gasped for breath and said, \"You… You are really too bold. There are so many people outside, aren’t you afraid?\"</p><br/><p>\"What is there to be afraid of? The wall of the carriage is so thick, they would not be able to hear anything. Besides that, you invited me in here. Are we just going to sit here and chat?\" Rody whispered and smiled. He then became serious and said, \"Nicole, I know you are bored. However, very soon, we will reach West Hill and then we can be together. At that time, I will use Rody's identity to publicly pursue you. After that, we could openly be together!\"</p><br/><p>Nicole spat and gritted her teeth, \"Declare openly... really so important?\" Her face was flushed. Her eyes were watery, with a small degree of fake anger but mostly shyness. This kind of look was so attractive that Rody could not help but gently kiss her again. He then whispered, \"Then, I am going out now.\"</p><br/><p>\"Don’t!\" Nicole frowned and tightly grabbed Rody’s clothes. She sighed. \"You did not know. When you were in the North, I could not sleep every night. I worried about your safety in the North every day and night. Even when you were in the Imperial Capital, you were in the Imperial Palace and were not always by my side. Every day, I stayed in my room claiming that I was ‘accompanying' my brother, the Duke. In fact, I was bored to death!\"</p><br/><p>Rody gave a wry smile. \"We had no choice. Didn’t I travel by carriage to visit you every day? It was ridiculous as some people thought that I was a medical officer dispatched by the Emperor...\"</p><br/><p>Nicole shook her head and said, \"Anyway, when we reach West Hill, I want you to accompany every day and every night...\" When she said ‘every night’, her face flushed and her voice was soft like the buzzing of a mosquito.</p><br/><p>Rody's heart trembled as he looked at Nicole's red face. His breathing gradually became faster and he held Nicole's hands tighter. He kissed her hard and then whispered, \"What… What did you say?\"</p><br/><p>Nicole shook her head. Although she was shy, her expression was firm. \"I don’t care. I just want to be your woman… When you went to war, I... I was worried about you…\"</p><br/><p>Rody took a deep breath and said, \"You are my woman. Nobody can take you away from me!\"</p><br/><p>The two of them embraced each other for a while. Rody knew that if he did not leave then, he would not be able to control his feelings. He then cleared his throat and gave a wry smile. \"Alright, I have to go out now. Wait patiently. We will reach West Hill soon.\"</p><br/><p>Nicole nodded and sat up from his arms. She then took out a silver bottle and gave it to him. She whispered, \"This is today’s medicine. This is the last bottle. After drinking it, your voice will change completely. In future, you will no longer need to worry about those who are familiar with you, as your voice will not be the same as the voice of the Duke of the Tulip Family anymore.\"</p><br/><p>Rody took the bottle and drank its contents. He then gave a wry smile and said, \"This medicine is really bitter. It is more bitter than the medicine you made me drink at that time.\"</p><br/><p>Nicole glanced at him and said, \"That medicine was to make you sound like Seth. It was meant to make you sick! Now… Now I cannot bear to let you experience that kind of hardship, so I put in a lot of effort to concoct this medicine.\"</p><br/><p>Rody licked his lips and frowned, \"It is really bitter… It is not good to be so bitter. Need a little bit sweetness!\" He ignored Nicole’s exclamation as he pecked her on her lips and then laughed, \"Now this is better. Bitter first then sweet later.\"</p><br/><p>Just like that, every day passed similarly, 'bitter first then sweet later', as they traveled to the capital of the Westwood province, West Hill City.</p><br/><p>Translator Notes:</p><br/><p>1. A Chinese proverb which could mean ‘To first suffer hardships so that you could enjoy its benefits later'. Literally, it would be ‘Bitter first, sweet later', much like Rody's situation</p><br/><p>2.  Literally it is the TuoTuo River. There is a real river with the same name. It is also known as Ulan Moron (Red River in Mongolian) or Tearful River in some sources cited from Wikipedia. I chose Red River because it sounds simple.</p><br/>\n</div>"}