{"title": "Chapter 204: Legendary Scimitar", "id": 204, "volume": 3, "url": "http://boxnovel.org/masked-knight-chapter-204-legendary-scimitar", "volume_title": "Volume 3", "body": "<h1>Chapter 204: Legendary Scimitar</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 204: Legendary Scimitar</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Rody squinted his eyes slightly as he sized up the Baron, Gadar.</p><br/><p>Of course, Rody is aware of the renowned Sharp Metal Lane. He had been in the army for a very long time and therefore, he understood the relationship between the military and Sharp Metal Lane.</p><br/><p>Although that famous business family of the Empire did not reveal the extent of its power in the political field, he knew they really had a powerful influence. That was because almost half of all the local garrison's equipment was purchased from that family.</p><br/><p>They had shops almost all over the Empire. The Empire had a special law stating that only soldiers and those with the title of warriors could carry weapons; civilians were not allowed to. However, one-third of the weapons held by the warriors of the Empire were all purchased from Sharp Metal Lane. Even Rody's sword when he was still studying in the Imperial Academy was purchased from Sharp Metal Lane.</p><br/><p>The most important thing was that the armies of the Empire purchased a lot of weapons and equipment from the Sharp Metal Lane every year. Besides equipment used by the local garrison even weapons used by the Northern Legion and the Northwest Legion were also supplied by them.</p><br/><p>It was impossible for their business to have grown to such an extent unless they really had some strong influence.</p><br/><p>Rody frowned and asked, \"Baron Gadar, why are you looking for me?\"</p><br/><p>Baron Gadar glanced at Nicole. He then straightened his body and said, \"Your Excellency, can we sit down and chat? Miss Nicole, I am sure you would not mind being separated from Rody for a while?\"</p><br/><p>The two of them then walked together as they talked and looked for a place near the barbecue stands to sit down. Baron Gadar seemed subtle. He laughed casually and was not worried about the way he spoke.</p><br/><p>Rody was also no longer as impatient as before. After the war, Rody had become more confident; he was not anxious at all. Rody smiled calmly as he handed over a bota bag1. He watched Gadar drink a mouthful of water before he asked again, \"Baron Gadar, Why are you looking for me?\"</p><br/><p>Gadar laughed and replied, \"Viscount Rody, you are the youngest hero of the Empire awarded by His Majesty for this crusade. Unfortunately, I was not in the Imperial Capital at that time. This time, I came to West Hill to deal with some matters related to my family’s shops. This is why today I took the liberty of coming here, just to visit you and express my admiration for you!\"</p><br/><p>Rody smiled and waited quietly for the other person to continue.</p><br/><p>Gadar continued to laugh. \"You know this too. Our family’s business is closely related to the Empire’s military. Personally, I really like to make friends with military heroes. You are a new rising star in the Empire and I would certainly regret if I do not get to know you.\"</p><br/><p>Rody faintly smiled and said, \"Baron Gadar, you are too polite. Right now, I am just a small officer in the Imperial Guards. As for titles, I am only just a Viscount. I feel extremely flattered that a distinguished person like you from such a large business family in the Empire came to show appreciation for me!\"</p><br/><p>Gadar shook his head and loudly said, \"A rising hero among the young! Viscount Rody, at your tender age you already displayed remarkable talents in the military. Your future is definitely limitless. I, Gadar, would definitely not be wrong in my judgment of people!\"</p><br/><p>Rody looked at him and softly said, \"You are too polite.\"</p><br/><p>Gadar gently smiled. He then took out something that was wrapped in layers of embroidered cloth. He smiled and said, \"A precious sword must be bestowed to a hero. My family sells weapons and we have very little treasures. However, this blade is quite good. As it is my pleasure to meet you today, please accept my humble gift.\"</p><br/><p>Rody looked at the gift that was handed over but he did not reach out to accept it. Instead, he shook his head and said, \"Baron Gadar, I do not understand. I am just a small viscount. I am already very surprised that you specifically came to see me. It is even more inexplicable for you to present a gift to me.\"</p><br/><p>Gadar did not refute Rody's statement. Instead, he drew off layer by layer of the embroidered cloth to reveal the thing inside.</p><br/><p>It was a scimitar. The shape of that scimitar was the same as the scimitars used by the Wolf Fang of the Lightning God's Whip. However, other than the appearance, everything else about the scimitar was very different.</p><br/><p>The sheath of the scimitar was made of leather from an unknown animal. It looked very thick. That leather was coated with cutin, giving it a rough appearance.</p><br/><p>Gadar revealed a proud expression as he said, \"This scimitar is my gift to you. The scabbard was made by using the skin of a strange fish, which was a specialty of the Southwest of the Empire. That fish was enormous and the body was a few meters long. It was very powerful. Its mouth was large enough to swallow a horse. Its skin was also tough and difficult cut with swords. Just the sheath, alone, was already a top-grade item.\"</p><br/><p>After saying all that, Gadar slowly pulled out the scimitar and gently swung the scimitar a few times. Although his actions were light, the scimitar hummed with a faint resonance.</p><br/><p>The blade of the scimitar gleamed like the cold autumn waters. There was also a strange writing engraved on the blade of the scimitar. The writing was crooked making it look a bit weird. When the blade moved, the writing flashed with a strange light.</p><br/><p>\"The blade of that scimitar was made from a very special and rare cold iron. That cold iron was considered an absolute gem among iron. Usually, only a little bit of that rare cold iron could be extracted after mining tens of thousands of iron ores. Although cold iron was rare, it was still something from the mortal realm. Although weapons made from cold iron might be sharper and can cut through steel, it still could not be considered a sublime product. However, the spell casted on it was powerful...\"</p><br/><p>Gadar then lowered his voice and said, \"With this line of incantation, this scimitar is now comparable to an ordinary magical artifact!\"</p><br/><p>Rody raised his eyebrows in surprise when he heard that.</p><br/><p>Gadar noticed Rody’s reaction and felt very satisfied. He then looked around and whispered, \"Viscount Rody, The line of writing on the blade... is in the Dragon language!\"</p><br/><p>\"Dragon language?\"</p><br/><p>\"Yes!\" Gadar whispered, \"Dragon language! Dragons are powerful creatures that possess outstanding magic. The Dragon text written on the blade is a line of magic spell. With such a dragon’s augmented magic, this scimitar has now become a sorcery weapon!\"</p><br/><p>Rody took a deep breath and vigilantly looked at Gadar. He then whispered, \"Dragon sorcery? This does not seem like something we have on the Radiant Continent.\"</p><br/><p>Gadar smiled faintly and there was a bit of pride in his smile. \"Our family has businesses all over the Radiant Continent. Naturally, we are also familiar with the Roland Continent. This scimitar was obtained unintentionally by my family from the northern Roland Continent. This scimitar has a long history. It is believed that this scimitar was the creation of a famous master sword smith from the Roland Continent more than a hundred years ago. That master sword smith was also a great sorcerer. He had somehow learned the dragon language and engraved the dragon magic spell onto the blade! Look at the hilt of this scimitar...\"</p><br/><p>Gadar then opened up his hands to show the hilt.</p><br/><p>Rody took one glance at the hilt and his eyes flashed strangely.</p><br/><p>The hilt... Why is it that the hilt is so similar to my previous lightsaber's?</p><br/><p>Of course, there were still differences between the two hilts as they were made from different materials. However, both hilts looked very similar.</p><br/><p>The hilt seemed to be made from a type of transparent crystal. The hilt was transparent, while the tip of the hilt was embedded with a red gem. However, the red color was weird. Rody could tell with a glance that other than the size of the gem, it was exactly the same as the one in the lightsaber.</p><br/><p>Rody was naturally very familiar with the lightsaber and he also knew about the extraordinary feature of the red gem. The secret of the lightsaber was in that gem on the hilt. By transmitting fighting energy through that gem to the blade, it would turn from a fragile lightsaber into a very sharp weapon.</p><br/><p>According to Dandong’s notes, that kind of gem was purely a special ‘energy converter’.</p><br/><p>Gadar saw Rody’s strange expression and thought that Rody was impressed by the scimitar. He then smiled and said, \"Viscount Rody, like I said, this weapon can only be wielded by a hero like you. Please accept it!\"</p><br/><p>Rody did not move. He pondered. The lightsaber was a strange weapon created by Dandong. However, the gem on the hilt of this scimitar... almost certainly confirmed that this scimitar had the same fantastic usefulness as the lightsaber. But how did Dandong’s casting method appear on the Roland Continent?</p><br/><p>When Rody still refused to accept the weapon, Gadar smiled and asked, \"Viscount Rody, do you still have any questions?\"</p><br/><p>Rody took a deep breath and replied, \"Baron Gadar, this gift is too valuable. I cannot accept it.\"</p><br/><p>Gadar shook his head and replied, \"I sincerely just want to make friends with the hero of the Empire. To tell you the truth, this scimitar is just a beautiful ornament in my hands and is of no use to me. I believe it can only display its true potential in the hands of a hero, like you.\"</p><br/><p>Rody’s heart stirred as he showed a strange smile and said, \"It’s true potential?\"</p><br/><p>Gadar smiled bitterly and shook his head, \"Even though it sounds ridiculous, I will still say it. Although according to legend, this scimitar is apparently very miraculous, ever since I obtained it, I found that it did not have much use. Of course, it is really sharp to the extent that it can break ordinary weapons. However, according to the legend, this scimitar is supposed to be much more powerful. It is supposed to be able to split mountains. Naturally, the people from the Roland Continent likes to boast about their own sorcery. I believe it is mostly just groundless hearsay. So, please do not think it is too precious to accept...\"</p><br/><p>Rody hesitated for a moment. He then smiled and asked, \"Can I take a look?\"</p><br/><p>\"Of course!\" Gadar immediately gave the scimitar to Rody.</p><br/><p>Rody held the scimitar with one hand. He then stretched out the other hand and lightly flicked the blade of the scimitar. Omm... The scimitar issued a soft, continuous hum, sounding a bit strange.</p><br/><p>Rody raised his eyebrows and said, \"You do not know how to use this scimitar?\"</p><br/><p>When Gadar saw that Rody had already taken the scimitar in his hand, he smiled, \"Yes, it is not just me. Even on the Roland Continent, for more than one hundred years, this scimitar had already changed hands many times. Each of its owners was an excellent knight. However, in their hands, the scimitar had never shown any of its true power as stated in the legend. Instead, it was just an ordinary sharp and gorgeous-looking weapon only.\"</p><br/><p>He laughed in a relaxed manner and lightly said, \"This scimitar, after all, is made of cold iron. I just think that it is a waste to keep with me. It is better off in the hands of a hero of the Empire like you. It will be better if it can display its true potential. You are in the army. In the heat of the battle, it would be more convenient for you if you have a sharp weapon.\"</p><br/><p>Rody laughed lightly. He had secretly figured it out. That Baron Gadar was obviously there to curry his favor for whatever reason. He personally came to present a gift and the present was, nothing else but a scimitar. That was a very smart move.</p><br/><p>Giving gold coins and other treasures would be crude. Based on his position as a soldier and warrior, giving him a very good weapon was very clever. — this man truly understands the psychology.</p><br/><p>Gadar had also said that that scimitar was not really very expensive. Although, according to legend, the scimitar was amazing, the fact was that it was just like an ordinary sharp weapon. Although weapons made from cold iron were expensive, they were not very uncommon. At the very least, many of the wealthy nobles have this kind of cold iron weapons in their homes. The price ranged from several thousand gold coins to several tens of thousands of gold coins. Although they were extremely expensive in the eyes of ordinary people, it was nothing to those VIPs.</p><br/><p>Although the scimitar had some sort of scary legend attached, that only made it more mysterious. The only peculiar thing was Gadar most likely did not know how to use that scimitar. Rody could not help but laugh to himself. If he knew how to use this scimitar, would he still give it away as a present?</p><br/><p>Naturally, Rody would not accept someone’s gift without any reason. He also knew that nobody would give him things unless they have a reason. However, he was curious about the scimitar, especially the gem on its hilt. Is it the same kind of weapon as the lightsaber?</p><br/><p>When things involved Dandong, Rody had to pay attention.</p><br/><p>Everyone and everything that he encountered, as long as they were related to that legendary old man, were strange. Just one of that example was that living skeleton, Andy.</p><br/><p>The legend of the scimitar aside, a cold iron weapon is probably only worth tens of thousands gold coins. It is not too expensive. Let me see what he wants first.</p><br/><p>With those thoughts in his head, Rody smiled. He gently held the scimitar in front of him and whispered, \"Baron Gadar, you traveled so far to visit me and to give me a gift. I am someone who does not like going in circles. Please tell me your intentions!\"</p><br/><p>Gadar saw that Rody did not refuse his gift but simply put the scimitar in front of him. He already had some ideas.</p><br/><p>He then smiled slowly — his mustache made him look a little cunning.</p><br/><p>With a calm expression, Gadar slowly said, \"Viscount Rody, at the moment, you are still just an officer of the Imperial Guards. With your strength, that post is unworthy of your talents. Let me ask you, are you interested in transferring to a different place?\"</p><br/><p>Rody smiled as he looked at Gadar’s face.</p><br/><p>Gadar looked at his side before he lowered his voice and said, \"For example… The Military Affairs Department?\"</p><br/><p>Military Affairs Department?</p><br/><p>Rody laughed in his heart. Looks like he was sent by Marquis Garoline to win me over.</p><br/><p>When Rody thought of that, he could not help but feel dejected. After the investiture ceremony that day, Rody had heard some rumors. It was at that moment that he understood the purpose and consequence of the old skeleton’s words. Illegitimate child? It must be have been very tough for him to come out with such an outrageous idea!</p><br/><p>Now, Marquis Garoline really thinks that I am the illegitimate son of that old skeleton. He actually went to such a great extent to win my favor. He also seems to know that it is now impossible for the Lionheart Family to measure up to the Tulip Family.</p><br/><p>The Emperor now clearly favors the Tulip Family! This means Marquis Garoline will have no choice but to earn my, the illegitimate child’s, favor. Perhaps, this illegitimate child will become the future Emperor. After all, the Emperor has no son and the Crown Prince’s seat is empty. It is simply a mess!</p><br/><p>Rody then shook his head and laughed in a strange manner.</p><br/><p>Gadar looked at Rody quietly. Although he did not understand the meaning of Rody's strange laugh, fortunately, Rody did not immediately reject him.</p><br/><p>After waiting for a while, Gadar slowly asked, \"Viscount Rody, what do you have in mind?\"</p><br/><p>Rody thought for a moment before he smiled and replied, \"Baron Gadar, I believe you are asked by Marquis Garoline to visit me. However, Marquis Garoline is the Empire’s Military Minister. He has a lofty position and so why does he need to bother with a minor person like me. I really do not dare to accept your gift.\"</p><br/><p>Gadar was very smart and he immediately laughed, \"Viscount Rody, His Excellency the Marquis absolutely appreciates your worth. However, because of some special reasons, the Marquis cannot express it to you directly. I am merely entrusted by him to meet you and nothing more.\"</p><br/><p>Rody nodded.</p><br/><p>This sounds right. Marquis Garoline is a smart person. Since he thinks I am the illegitimate child of the Emperor, he would definitely not dare to contact me directly, to win me over. After all, he is also afraid of the Emperor’s suspicion. But… But I am not the Emperor’s illegitimate child!</p><br/><p>Rody did not know whether to laugh or cry when he thought of that. However, that was not something that also could be spoken of openly. He shook his head and said, \"I truly appreciate your kindness and I have to politely refuse your good intentions. Right now, I am very happy in the Imperial Guards. I cannot accept the Military Minister's good intention but I am grateful he appreciates my worth. Please convey my words to him.\"</p><br/><p>Rody clearly understood Marquis Garoline’s intentions.</p><br/><p>He was thinking of winning Rody over to his side. Since in the hearts of most people, he was the illegitimate child of the Emperor, then he would become a major chip to be used in the future. Therefore, gaining Rody's favor before he appreciates in status would result in a major advantage.</p><br/><p>If Marquis Garoline, as the Military Minister, wants to transfer me to the Military Affairs Department, naturally he will have a way. In fact, he does not need to personally come forward. He can just secretly instruct his trusted subordinates handle it. Although he is a Military Minister, the transfer of soldiers and other internal management of the army is not in his jurisdiction. However, he was already in the military department for so many years, he would definitely have his connections; for example, he already has Milo in Central Command.</p><br/><p>On top of that, Garoline had identified me as the illegitimate son of the Emperor. He also thinks that if he were to transfer me to a senior position in the military office, then his action of promoting the Emperor’s illegitimate son would definitely make the Emperor pleased.</p><br/><p>What a mess… Very messy…</p><br/><p>Gadar was not surprised to hear Rody refuse. Rody’s mindset was still simple.</p><br/><p>Before he left to visit Rody, Marquis Garoline had already given him instructions. Marquis Garoline had said that it did not matter if Rody refused the proposal this time.</p><br/><p>After all, he was the ‘illegitimate child of the Emperor' and he would most likely not be interested in whatever high post. The important thing was to make the gesture of appreciating him and leave a good impression. The goal would be achieved when a preliminary and harmonious relationship was established.</p><br/><p>About that scimitar … why would a big noble family from the Imperial Capital care about a scimitar?</p><br/><p>The gifts did not necessarily have to be expensive. In fact, to people with such status, precious gifts would not impress them. It was more important to cater to their tastes.</p><br/><p>A young warrior would presumably not refuse a beautiful and sharp weapon.</p><br/><p>Gadar smiled and replied, \"Since you are unwilling, it does not matter. However, His Excellency the Marquis sincerely invite you to pay him a visit at the Marquis' mansion, when you return to the Imperial Capital.\" He then saw Rody was about to return the scimitar and quickly added, \"But, please accept this scimitar.\"</p><br/><p>Rody smiled and without another word set the scimitar down.</p><br/><p>In fact, he never had the intention to return the scimitar.</p><br/><p>This scimitar is weird. I must take a close look at it later. Perhaps I should discuss with Andy about this when I return to the Imperial Capital.</p><br/><p>At the very least, Marquis Garoline had guessed one thing correctly. Rody was a person who would not be interested in expensive treasures. However, he would be impressed by a mystical weapon.</p><br/><p>The two then chatted freely. Rody remained calm and indifferent. His calm and confident temperament was developed in the battlefield. However, it was different in Gadar’s eyes. To Gadar, Rody's temperament affirmed Marquis Garoline's view.</p><br/><p>A person with such a calm, easy going temperament is definitely not an ordinary person!</p><br/><p>They were sitting at the edge of the temporary camp. While they were chatting, they suddenly heard a sharp cry of alarm from the lakeside.</p><br/><p>The cry was full of fear and surprise. It was obvious that the voice belonged to a woman.</p><br/><p>\"Ah!\" The cry of alarm turned into a miserable scream. Rody’s expression changed. Before Gadar could react, Rody had already shot out like an arrow.</p><br/><p>Translator's Notes:</p><br/><p>1. Small leather pouches filled with drinking water. Ancient non-breakable drinking bottles before plastic was invented.</p><br/>\n</div>"}