{"title": "Chapter 213: The World at the Bottom of the Lake", "id": 213, "volume": 3, "url": "http://boxnovel.org/masked-knight-chapter-213-the-world-at-the-bottom-of-the-lake", "volume_title": "Volume 3", "body": "<h1>Chapter 213: The World at the Bottom of the Lake</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 213: The World at the Bottom of the Lake</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>The tunnels underwater turned in several directions. Rody and Diane did not know how many turns they had made as they were being swept by the turbulent undercurrent. Even though Rody was tough, after crashing continuously a few times, he could no longer persevere. Finally, he suddenly felt the surrounding terrain sink deeper until he arrived at an open space. Several of the surrounding chaotic pathways converged together, as the two of them were thrown up and out of the water.</p><br/><p>Boom!</p><br/><p>They crashed onto the ground. Diane groaned in pain.</p><br/><p>They groped around and realized they were on a hard surface. They took a deep breath. The air was damp and very cold. They sighed in relief after realizing that they could breathe.</p><br/><p>When they opened their eyes, the light was dim and they could vaguely see the surroundings. They seemed to be in a cave and they were standing on cold and hard limestone. It was wet and slippery. They supported each other and stood up and then shook their dizzy heads.</p><br/><p>Diane suddenly exclaimed and pulled Rody to look at something by her side...</p><br/><p>They found out that they were standing at the edge of a cave with a huge curtain of water by their side.</p><br/><p>The water curtain looked turbulent. When they looked through the water curtain, they could see many large and small whirlpools. However, the water curtain was just right in front of them and did not flow towards them!</p><br/><p>It was as if there was an invisible wall stopping the water at the mouth of the cave. Although it was still a world of water outside the cave, the turbulent waves simply could not flow in.</p><br/><p>\"What the hell! What is going on?\" Rody could not help but mutter. He felt dizzy. He also felt a dull ache all over his chest and his back. All the bumping earlier had left him some serious internal injuries as the force of the collision was unexpectedly strong. Even though his body was reinforced by the blood of the Mystic Dragon, he could hardly endure it.</p><br/><p>Diane could not help but reach out her hand to touch the water curtain in front of her. Her hand easily passed through the water curtain. However, when she retracted her hand, the water curtain immediately reconnected without any water flowing in.</p><br/><p>\"This place is really strange.\" Diane became terrified and suddenly exclaimed, \"We cannot see the sky from here at all. How do we get out of this place?\"</p><br/><p>Rody had an imposing expression as he said, \"Looks like the only way out of here is the underwater path we used to come in here…\" Rody seemed unable to continue speaking further.</p><br/><p>They had been swept here by the furious waves of the undercurrent. With the furious waves in the pathway, once anyone entered the tunnel, they would not be able to move and could only be swept along following the violent flow of the current. To leave by swimming against the current was simply impossible.</p><br/><p>Diane's face showed fear and despair. Rody suddenly smiled and said, \"Let us not think about this first. This place looks strange and maybe there is another way out.\" He stretched out his hand and patted Diane’s shoulder as if he was comforting her.</p><br/><p>Diane suddenly had the urge to act like a baby as she took advantage of that moment to snuggle up to Rody. She trembled, from either the fear or the cold, as she tightly held onto Rody’s other arm with both her hands.</p><br/><p>As both of their bodies involuntarily huddled each other, Rody clearly felt a little strange. Diane’s red dress was thin and after being soaked in water, it tightly stuck to her body, carving out her exquisite body. As she was snuggling so close to Rody’s arms, Rody felt his heart jump wildly. His body stiffened and he did not dare move.</p><br/><p>After a long time, he heard Diane whispered, \"Just now, when we were in the water, thank you, thank you for saving me.\"</p><br/><p>Rody blushed in the dark but luckily, Diane did not see it as she had her head in his arms. Rody cleared his throat and smiled, \"Just now, under that situation, I had no choice. Hmm, it is fine as long as you do not blame me.\"</p><br/><p>Diane’s face turned red. However, she courageously whispered, \"I... how can I blame you?\"</p><br/><p>Rody did not dare say anything. He took a deep breath and then gathered his fighting energy.</p><br/><p>After that, Rody violently burst out with a golden flame. They were both wrapped in the flame and that golden flame quickly dried their wet clothes. Besides that, the golden flame also lit up the dim environment a little. Diane finally stood up from Rody's arms. Both of them carefully looked around with the help of the golden flame.</p><br/><p>The cave had a width of about ten meters. The cave was totally empty. Not a single blade of grass could be found on the stone walls and the cave was deathly still. Deeper inside the cave was a dark hole. Based on the terrain, it looked like it was going all the way down.</p><br/><p>Rody said with a forced smile, \"Going down again…We are already somewhere deep under the lake. If we go even deeper, I am not sure if we can actually get back out.\"</p><br/><p>Diane felt at peace. The earlier fear in her heart had already been swept away. She was content just standing beside Rody and snuggling up to his arms. She was not afraid even if she were to die the next moment.</p><br/><p>\"Let’s go.\" Rody gritted his teeth and pulled Diane by her hand in the dark. Diane could not help but tremble as she involuntarily leaned towards Rody.</p><br/><p>Rody’s entire body was like a golden torch illuminating the path as they entered the dark hole and moved downwards.</p><br/><p>As they walked further in, the passageway became more and more spacious. Rody carefully looked at the surrounding environment and could not help but whisper, \"Strange...\"</p><br/><p>\"Hmm?\" Diane was at a loss. She was being pulled by Rody and all her focus was on Rody beside her. She actually did not pay any attention to the surrounding environment.</p><br/><p>Rody sounded surprised as he said, \"Look, this dark hole is obviously a passageway. Look at the surrounding walls. There seem to be traces of chiseling...dug out by people. The cave at the bottom of this lake is man-made!\"</p><br/><p>After listening to Rody’s words, Diane took a careful look at the surrounding. Sure enough, like what Rody said, the dark passageway that they were walking through was obviously a man-made passageway. There were traces of chiseling on the surrounding walls of the dome-shaped passageway. Such a passageway definitely was not formed naturally.</p><br/><p>Diane was reminded of the time they spent together in the cave in the Southern mountains. Her heart was suddenly filled with tender feelings. She approached Rody and clung to his arms with both her hands as she whispered, \"Do you think this cave is similar to the cave behind the tribe village where Wuya hid when he transformed into the large snake?\"</p><br/><p>Rody smiled and replied, \"There are some similarities. I just hope that there will be no more of the dozen-headed snake. Right now, we are both exhausted and won’t have enough strength to resist.\"</p><br/><p>People easily gave birth to intimate feelings when beside a companion in a strange and dark environment. Rody seemed to not notice that it was strange that Diane kept holding onto his arm. He even placed his arm around her shoulder as they continued to descend.</p><br/><p>The passageway gradually widened as they walked. Diane, in a daze, followed Rody moving forward step after step and was totally unprepared when Rody suddenly stopped.</p><br/><p>\"Look at the wall.\" Rody’s voice sounded weird. \"Those meandering scribbles on the wall up there looks like some kind of writing.\"</p><br/><p>Diane looked at the wall with the help of the golden flame. She saw that both sides of the walls were chiseled with some blurred writing.</p><br/><p>Looking at the curly writing, Diane had an idea and said, \"Let us go nearer to look! This writing looks very familiar.\"</p><br/><p>Rody looked at her in surprise and asked, \"Can you understand this writing?\"</p><br/><p>Rody pulled Diane to the side of the wall. Diane stretched out her hands to gently touch the engravings on the wall. She seemed a little excited.</p><br/><p>\"What is written on the wall? Can you read it?\"</p><br/><p>Diane raised her head to look at Rody and she nodded. Her voice was trembling with excitement. \"This, this is written in the Kara clan language.\"</p><br/><p>\"Kara clan language?\" Rody was shocked. He knew that Diane’s Silvermoon clan was a real descendant of the Kara clan. God's religion called them the descendants of the \"Devil' Kara clan. Rody swallowed his saliva and asked slowly, \"So, what is written up there?\"</p><br/><p>Diane shook her head and replied, \"Just some simple words. For example, this one means the Great Kara would lead us to defeat the evil.\" She paused for a moment as if she was afraid that Rody could not understand. She then explained, \"This is the scriptures of our Kara clan which is the same as your Church’s teachings.\"</p><br/><p>They slowed down their pace after finding the texts on the wall. Rody pulled Diane’s hand and followed the path as she read the writings along the way.</p><br/><p>However, most of those writings were simple parts of the Kara clan’s scriptures praising the Kara God and had nothing special.</p><br/><p>Rody thought for a moment and suddenly loudly said, \"I understand now!\" He looked at Diane and said, \"This place must have been built thousands of years ago during the time the Kara clan ruled the Radiant continent! The writings on both sides of this passage must have been engraved by the craftsmen of the Kara clan at that time. If I were to follow this path, I am sure I will find the relics of the Kara clan!\"</p><br/><p>Diane shook her head and replied, \"No, not really similar…I do not think this place was constructed by the Kara clan!\"</p><br/><p>She pointed at the text on the wall and said slowly, \"Did you notice? Besides the writings we found, there were also other writings on the wall. However, most of those writings were roughly crossed out. Look at this sentence…\" Diane pointed at a wall with a blurred carving. \"This should also be part of the carved scriptures, but it seems that half of the carving was intentionally destroyed.\"</p><br/><p>Diane spoke with remorse, \"I believe that this place must be constructed during the time when your Protoss clan had just invaded the Kara clan. The workers that excavated this passageway might have been the captured slaves from the Kara clan. As they were tortured, they would turn to the prayers of the God of Kara. They engraved on the wall of the passage the texts from the scriptures, seeking help from the God of Kara. However, most of the texts were destroyed after they were discovered.\"</p><br/><p>Rody felt startled and sighed. He then said, \"That is probably true. Sigh, how much manpower would they need to excavate this large cave under the lake?\"</p><br/><p>Rody and Diane continued to move forward for a while. Since the place was artificially excavated, then there must be something under there. Suddenly, there was a large and empty space in front and the cave was suddenly brighter. When Diane saw the scene in front, she screamed.</p><br/><p>In front of her was a large pit that had been covered up again. However, there were still some hands and some arms poking out from the ground. Looking at the posture, it seemed like they were grasping upwards in pain. It must have happened many years ago and the hands had long become bones and were scattered all over the ground like claws, giving off a scary scene.</p><br/><p>Rody sighed and said, \"This must be where the slaves were buried alive.\" He then saw that Diane looked pale and had an agonizing expression. He hurriedly pulled her away.</p><br/><p>Diane’s body turned soft. Tears rolled down her face as she quietly cried for her ancestors.</p><br/><p>They then walked forward to the huge and open area. It was a huge and deep square pit, about one hundred meters wide densely packed with people. Thousands of people sat on the ground in there.</p><br/><p>Rody and Diane were shocked and at the same time knew that those people were all dead.</p><br/><p>Those dead men were sitting in the same posture. All of them wore metal armors. Those armors looked quite similar to the armors worn by the present-day soldiers, except they were more crude and simple.</p><br/><p>After the passage of time, those bodies had become bones. Some of the skeletons had collapsed and scattered while others remained in their sitting postures. At a glance, thousands of skeletons sat neatly arranged in a phalanx formation. That was somewhat horrifying.</p><br/><p>Diane was pale with fright, while Rody had a somber expression. Rody suddenly let go of Diane's hand and jumped into the pit. From the scattered armor on the ground, he picked up a sturdy looking shield. After that, he also selected a sword before going back to Diane.</p><br/><p>He stared at Diane and said, \"This place is strange. Only God knows what else is down there. We must not be unarmed. We might as well grab a weapon for defense!\"</p><br/><p>With a shield in one hand and a sword in the other, Rody led Diane forward by going around the pit. After going around the pit, they encountered a big square stone gate.</p><br/><p>Rody carefully looked up and down for a while. He found out that the stone gate was very strong and did not have a single gap around it.</p><br/><p>After looking at the gate for a long while, Rody still could not figure out how to open it. Feeling impatient, he gathered his fighting energy and slashed at the gate.</p><br/><p>Suddenly, there was a loud noise. The stone gate faintly shook and only a superficial scratch appeared on it.</p><br/><p>Rody and Diane looked at each other. Based on Rody’s strength at that moment, together with the golden fighting energy, he could not only destroy a stone gate, he could even destroy a house. He even destroyed the ironwood gate at Thunder City with one strike. However, he only managed to scratch that stone gate.</p><br/><p>\"D*mned gate!\" Rody grunted. \"You, move out a little!\"</p><br/><p>He then put down the sword in his hand and took a deep breath. He saw that Diane had already retreated a distance away and he slowly stretched out his left hand.</p><br/><p>Rody’s eyes then flashed a black aura and his golden fighting energy suddenly changed color!</p><br/><p>The golden fighting energy suddenly turned into a mass of black flames. The black flames condensed into a black ball of light on the palm of his left hand. The black ball of light gradually became bigger and there were black sparks bursting from the top...</p><br/><p>Diane stood at the side with a complicated expression. She had a mixed feeling when she saw Rody use the Mystic Dragon’s power.</p><br/><p>She faintly heard the roar of a dragon coming from Rody’s hand. A light shaped like a dragon sprang out from the ball of black light. It roared as it charged towards the stone gate.</p><br/><p>Violent waves of air seemed to roll and all the nearby skeletons of the soldiers were broken by the waves of air. After the loud explosive noise, Rody suddenly shouted, \"Not good!\"</p><br/><p>In a flash, he scuttled out grabbing Diane and rolled away.</p><br/><p>Rody had used the Mystic Dragon Purge and forcefully attacked the stone gate. However, at the moment of impact, a strange glimmer suddenly flashed at the surrounding of the stone gate. After that, the rough stone gate had transformed into a glossy square mirror-like thing. On the surface, it faintly flashed a trace of strange brilliant light.</p><br/><p>The violent black dragon light collided against the mirror. It shook fiercely for a moment before it bounced back.</p><br/><p>The roaring black dragon was bounced back straight in the direction where Rody was standing. Fortunately, Rody responded quickly. He had grabbed and carried Diane, who was standing behind him, and they both rolled down. He then heard an extremely loud earth-shaking sound in his ear...</p><br/>\n</div>"}