{"title": "Chapter 215: Staff of Moses", "id": 215, "volume": 3, "url": "http://boxnovel.org/masked-knight-chapter-215-staff-of-moses", "volume_title": "Volume 3", "body": "<h1>Chapter 215: Staff of Moses</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 215: Staff of Moses</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>\"What is this?\" Diane looked at the small silver bow in Rody’s hand and asked. Although she did not know what it was, she could feel the invisible and powerful aura coming out of the silver bow.</p><br/><p>Rody pulled the string of the silver bow until it nearly formed a circle. Holding the string lightly with his fingers he said, \"God Slaying Bow.\"</p><br/><p>Diane turned solemn with a grave expression.</p><br/><p>Rody took a deep breath. Both his hands started to release golden fighting energy. He gathered his energy into a ball. The lower hem of his clothes fluttered. He put more effort into his fingers, then he said, \"That stone door is nothing more than a mirror spell! It reflected my hellfire, but I don't think it can reflect this pure God's artifact!\"</p><br/><p>Rody’s fighting energy flashed and condensed into a light arrow. The bow then resounded as the light arrow shot out. The smooth mirror was struck by the arrow and started to shatter with a light crackling sound. Slowly, cracks began spreading until the mirror shattered into countless pieces.</p><br/><p>Diane cried out in alarm when she saw the stone gate instantly destroyed. The cracks spread throughout the surrounding walls. The sorcery array symbols around the gate also broke apart and fell.</p><br/><p>Rody kept away the silver God Slaying Bow. He then pulled Diane and was about to walk forward. Suddenly, they heard a faint thunderous sound coming from the passageways behind the stone gate. This sound gradually grew louder as the cause of the sound approached. Rody and Diane turned pale. Rody suddenly embraced Diane the moment he saw a wall of white qi wave approach. The surging qi wave swept into the entire cave.</p><br/><p>Rody’s body shook violently. He felt the radiance of the qi wave become more and more violent and he could not open his eyes. The strong qi seemed to penetrate both their bodies. As the qi went through his body he felt his fighting energy going out of control. It was as if a powerful spiritual energy passed through his body from all directions. He was shocked. Then his body swelled up like a balloon. As the spiritual energy grew stronger and stronger, Rody staggered and groaned from the alternating pain and comfort.</p><br/><p>Diane felt Rody’s body tremble. Although she could not open her eyes in the bright light, she could also feel her body filled up with something. Her whole body felt so full of energy that she needed to open her mouth to say something.</p><br/><p>The bright light had disappeared as quickly as it appeared. After a moment, everything turned calm. The strong light shrank into bright dots and vanished.</p><br/><p>Rody let go of Diane and gasped for breath. Earlier, he felt his strength rise dramatically as if it was about to explode out of his body. Even his scalp was sweating. He probably would not be able to endure anymore had that light continued to shine for a little while longer.</p><br/><p>At that moment, Rody’s body was full of energy and he felt dizzy. However, he felt like his every move was so full of energy that he was about to explode.</p><br/><p>\"This is truly scary!\" Rody looked surprised. He raised his hand and looked at it as he gasped. \"Did you feel it? Just now…\"</p><br/><p>Diane nodded and replied, \"Yes. I felt it…The strange thing was it felt like my strength has returned.\"</p><br/><p>The two of them looked at the passage behind the stone gate with a puzzled expression. Rody then said, \"I wonder what is in there?\"</p><br/><p>Diane shook her head and replied, \"It does not matter. We will just need to go forward.\"</p><br/><p>They looked at each other for a moment. Rody then reached out to Diane’s waist. He held her as they walked towards the passage behind the stone gate.</p><br/><p>Before entering the stone door, they tried to guess what they would find at the end of the passage. Rody guessed that there might be an ancient tomb or a place where a monster was sealed.</p><br/><p>However, when they went through the stone gate, they both found that their guesses were wrong.</p><br/><p>They found a small room that was only a few square meters big. They could easily see the entire room. The four walls around the room had no doors and looked evidently sturdy. It was basically a dead end.</p><br/><p>In the middle of the room, there was a stone platform that was about one meter long. On top of the stone platform was a wooden staff.</p><br/><p>The wooden staff was about as long as an ordinary sword. It was blackish and looked ordinary. It was thicker at the top end and thinner at the bottom end. It did not look any different from the firewood used by civilians at home. However, Rody felt a strange illusion when looking at it.</p><br/><p>It seemed that the wooden staff was softly emitting an aura off and on—just like the fully energized radiance that passed through their bodies earlier.</p><br/><p>Diane looked disappointed. They went through so much trouble to swim to the bottom of the lake and somehow ended up in such a dangerous place. At the end of the journey was evidently this very small sealed room. On top of that, the room only had a wooden staff.</p><br/><p>Rody frowned. He slowly walked forward and gently rubbed the stone table. A thick layer of dust had gathered on the stone. After wiping away the dust, a line of ancient writings was revealed on the stone.</p><br/><p>Rody only took a glance and his expression changed immediately. His eyes looked astonished. He looked at the text in a daze, his mouth gaping open.</p><br/><p>Diane saw Rody’s expression and quickly asked, \"What’s wrong? What is written here? Is it the way out?\"</p><br/><p>Rody turned to look at Diane with a serious expression. He then said, \"I finally understand why the water outside would not pour in. I also finally understand what that radiance that charged out was and what this place is!\"</p><br/><p>Rody then spoke slowly in a heavy tone, \"This wooden staff is the legendary Staff of Moses2. Legend says it is the most powerful magic staff. It is one of the most powerful artifacts!\"</p><br/><p>Diane looked solemn but also seemed to be at a loss. She asked, \"Staff of Moses?\"</p><br/><p>Rody nodded and had a weird expression. He glanced at Diane and said, \"Perhaps you do not know about this legend…but basically, the people of Protoss only managed to conquer the Radiant Continent and almost caused the extinction of the Kara clan because they had this staff.\"</p><br/><p>Diane immediately turned pale. Rody then shook his head and whispered, \"When I was studying in the Imperial Academy, I read the teachings of the Church, including the legend of the Staff of Moses!\"</p><br/><p>\"During ancient times, the people of Protoss and the people of Kara were divided into two different continents. The people of Protoss occupied the continent in the north which is now called the Roland Continent. Meanwhile, the Radiant Continent was ruled by the people of Kara! The people from both continents were hostile to each other but because of the Thunderous Straits, the powerful people of Protoss were unable to cross over and fight. However, one day, the Gods had bestowed mankind a heavenly messenger. The messenger was originally just an ordinary farmer. At that time, the people in the Northern Continent did not have a unified country and was also fighting with each other. However, the heavenly messenger was a devout believer when he grew up and was bestowed a staff by God...\"</p><br/><p>At that moment, Rody looked at the wooden staff in his hand and said, \"That staff is this thing!\"</p><br/><p>After pausing for a moment, Rody continued, \"The name of that heavenly messenger was Moses! Perhaps you have heard of this name before. Everybody in this whole world who believes in the Church would know this name! Moses was mankind's first Pontiff3. He was also the one and only person who was ever crowned as Pontiff.</p><br/><p>\"Because Moses obtained this magic staff, he managed to persuade different kingdoms in the Northern Continent to stop the war amongst themselves and to set their sights on Kara’s Radiant Continent across the treacherous Thunderous Straits. Moses then used his staff and created a legendary miracle.\"</p><br/><p>At this point, Rody showed a weird expression as if he felt uneasy and said, \"At the coast where the waves were roiling the Pontiff raised his staff and walked towards the ocean. Behind him was the Protoss’ allied army. According to the records, the instant Moses entered the ocean it seemed an earth-shattering event happened. The calm ocean waves immediately turned into a heavy swell with its waves thrown high into the sky. Then right in front of the Pontiff, the ocean split into two! The water opened up to reveal a wide road...The Pontiff Moses raised his staff high and walked in front while the magnificent army followed behind. The army thus crossed the impassable Thunderous Straits unobstructed. They easily crossed the Kara clan’s natural line of defense.\"</p><br/><p>Rody sighed. He glanced at Diane and then said, \"You should know what happened next! The people of Protoss advanced south and conquered the entire Radiant Continent. The Radiant Continent became Protoss’ territory. The Pontiff Moses then became the greatest man in the teachings of the Church because of this miracle!\"</p><br/><p>Diane turned pale. She looked at the wooden staff on the stone table with a complicated expression of hatred and agony.</p><br/><p>Rody could not help embracing Diane, who was trembling lightly. He whispered, \"The Pontiff Moses was the only Pontiff in history. Although both continents had been united under his leadership, human greed made the continents split up again. This created today’s situation.\"</p><br/><p>Diane closed her eyes and softly leaned onto Rody’s body. She trembled and said, \"This is the thing! This is the thing that destroyed our nation! There are also those skeletons with their hands sticking out of the ground outside.\"</p><br/><p>Rody sighed and patted her back, \"That outcome was predetermined. Since Kara had been defeated by the Gods, the people of Kara were already destined to be wiped out. Even if Moses and his staff had not existed, the Gods would still use other ways to help the people of Protoss conquer the Radiant Continent.\"</p><br/><p>Rody watched the trembling Diane calm down. He then shook his head and looked at the Staff of Moses. 'Is this normal looking wooden stick really the legendary Staff of Moses? Could it really be one of the strongest legendary artifacts?'</p><br/><p>Rody thought for a moment and then suddenly had an idea.</p><br/><p>Staff of Moses, miracles, the ocean water dividing into two, the passageways under the lake…</p><br/><p>Rody's face gradually looked excited!</p><br/><p>For hundreds of years, the army of the Radiant Continent was invincible on land. The powerful Lightning God’s Whip could easily sweep across the land, but the roiling waves of the Thunderous Straits blocked the way forward. Now that Rody had this staff that could apparently split the ocean into two, nothing would be able to stop the Lightning God’s Whip.</p><br/><p>The Roland Continent’s strong navy would become useless and the Lightning God’s Whip could easily cross the Thunderous Straits to subjugate the Roland Continent.</p><br/><p>Thinking of that, Rody could not help trembling in excitement. He reached out to grab the wooden staff when another thought flashed through his mind. What would happen then? Countless people would die! Thousands of warriors would spill their blood.</p><br/><p>Rody’s outstretched hands trembled gently as the two thoughts in his mind conflicted. Finally, Rody took a deep breath, restrained his complicated thoughts and grabbed the Staff of Moses on the stone platform. The wooden staff felt rough and icy cold. Rody then slowly lifted the staff.</p><br/><p>As he lifted the wooden staff, he suddenly heard a faint rumble. After that, the small room started to sway.</p><br/><p>'Not good!' This thought barely appeared in Rody’s mind when there was a sudden change. The stone table holding the wooden staff suddenly sank down. A deep and square-shaped hole then appeared in its place. The bottom of the pit could not be seen but a splashing sound could be heard after the stone platform fell in.</p><br/><p>After that, big pieces of rocks on the ceiling started to fall. One large square rock smashed onto the ground. Diane loudly exclaimed, \"This place is collapsing!\"</p><br/><p>The moment she spoke, there was a loud booming sound. A large boulder had fallen at the stone gate and blocked the exit. A few large and small rocks then fell at the same place to tightly seal it off.</p><br/><p>The movements at the ceiling became even stronger until they could not stand steadily. As the huge rock right above their heads started to totter, Rody suddenly shouted, \"Jump down! Jump into the pit!\"</p><br/><p>Before Diane could react, Rody continued, \"It is water down there! There must definitely be a way out!\"</p><br/><p>Disregarding any view Diane might have, Rody grabbed the wooden staff with one hand and Diane with the other and jumped into the pit.</p><br/><p>...</p><br/><p>The skies outside were bright. Darke was standing anxiously at the shores of the lake. From time to time, he would grasp his beard or scratch his head. Worry and nervousness filled his face.</p><br/><p>There were no more movements ever since Rody and Diane entered the lake last night. He would obviously see the rope glow with golden fighting energy indicating Rody’s signal to pull Diane up. However, what he pulled up was only a cut-off rope.</p><br/><p>Darke was extremely frightened when he saw the broken rope. He would have immediately jumped into the lake if he knew how to swim.</p><br/><p>The two Mythical Beasts—the fox-wolf and the owl—started to get restless again. Darke was feeling impatient and when he saw the two Mythical Beasts becoming restless, he blew the whistle and kicked them several times. The two Mythical Beasts then trembled and shrank in fear.</p><br/><p>\"Know your place!\" Darke scolded. \"Otherwise, I will roast and eat you!\"</p><br/><p>Just as soon as he had scolded them, the earth at his feet shook. Darke missed his footing and fell. He then saw a large wave surging at the normally calm lake.</p><br/><p>A huge whirlpool formed at the center of the lake. As the swirling of the whirlpool became more intense, it separated from the surface of the lake and flew ten meters above the lake. It then turned into a waterspout.</p><br/><p>The trees around the lake were bent and crushed by the waterspout. Suddenly, the waterspout stopped. The water splashed down everywhere in waves. One wave smashed into Darke near the lake, sending him off-balance. By the time he regained his balance, he was already totally soaked.</p><br/><p>Before Darke could exclaim, he saw the water at the center of the lake separate. The lake separated rapidly on both sides and formed a wide space in the middle. The various boulders at the bottom of the lake came into view.</p><br/><p>Darke murmured, \"What in the world is going on here?\"</p><br/><p>The moment he said that, two figures appeared on the ground in the middle of the separated lake walking slowly along the path.</p><br/><p>Walking at the front, holding a worn-out wooden staff high up, was Rody.</p><br/><p>Translator's Note:</p><br/><p>1. The raws simply said \"Wood used for burning\" Some might say firewood but firewood is thick and does not look like a staff.</p><br/><p>2. Literally, Moses’ God Staff/Cane/Rod. Staff of Moses is also referred to as staff of God or rod of God. I decided to go for staff instead of rod.</p><br/><p>3. The 'Pontiff' here could actually mean Pope or Bishop, mostly applied to high/chief priests. The reason I used Pontiff here instead of Pope is because Moses here is a , jiaohuang, while the Pope Corsica VI is a  jiaozong. While both are Popes, Moses was the only ‘jiaohuang’ that has ever existed.</p><br/>\n</div>"}