{"title": "Chapter 223: Muddy and Turbid", "id": 223, "volume": 3, "url": "http://boxnovel.org/masked-knight-chapter-223-muddy-and-turbid", "volume_title": "Volume 3", "body": "<h1>Chapter 223: Muddy and Turbid</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 223: Muddy and Turbid</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>The Sauron Kingdom occupied half of the Roland Continent. However, the capital city of the Kingdom was not as big as imagined.</p><br/><p>The imperial palace definitely did not deserve to be called ‘Brilliant Golden Wall’.</p><br/><p>The Sauron Kingdom's reputation as a hundreds-of-years-old ancient kingdom was well known; there were even traces of history in the construction of the main building of the palace.</p><br/><p>Beneath the tallest tower that had eighteen floors, was the main part of the palace. At the periphery of the palace were about a dozen statues recording the glorious achievements of great legendary personages in the kingdom. Around the carvings of those personages were also carvings of birds and beasts. Below the carvings were stone tablets packed with details of the brilliant histories of those personages. The stone tablets usually stated on a certain date, a certain monarch conquered a certain land or on a certain date, a certain monarch triumphed over a certain enemy army.</p><br/><p>The main hall was spotless and extremely silent. The beautiful murals on the wall were lifelike. There were also sky-like reliefs on the ceilings. Although the floating cloud reliefs were not real, there were peculiar gems mounted on it, making it appear colorful. Unlike a normal palace, there were no guards on strict patrol here.</p><br/><p>Like the previous kings before him, King Sauron had the same belief: unseen power was the most effective deterrent.</p><br/><p>Having the place heavily guarded would be akin to what a newly rich would do; a meat bun's filling is not placed on top of the creases1.</p><br/><p>The reigning king of the Sauron Kingdom was only thirty years old. However, he looked much older and stronger than his actual age. That ambitious king had been working hard for his country every day since he became king five years ago. The greatest potential danger to his monarchical power would undoubtedly be the ubiquitous Roland Temple.</p><br/><p>\"God’s authority is the greatest…\" The king sneered, whispering to himself, \"Why is God so high and mighty? Since I rule this country, then everything should be carried out according to my will.\"</p><br/><p>The wrinkles at the corner of the King’s eyes gradually reduced as he opened his eyes. He turned to look at his most trusted minister, the old aged Senior Prime Minister2.</p><br/><p>The Senior Prime Minister was his teacher when he was still a crown prince. As the man was the King’s teacher, the King trusted him and showed him more respect. Or at the very least, superficially, he was extremely respectful.</p><br/><p>Looking at the Senior Prime Minister, the King smiled and said, \"Senior Prime Minister, what is the Temple doing? Does our man have any information for us?\" The King was a smart ruler. He knew that he needed to use an amiable approach with his most capable assistant, the Senior Prime Minister.</p><br/><p>The aged Senior Prime Minister’s face was wrinkled like the skin of dried mandarins. The King's court revered that ugly old man but to the King, he was just someone who could be trusted.</p><br/><p>\"Your Majesty, do not worry. Commander Bia has sent the fleet out to welcome them. Presumably, the Temple will not succeed so easily! We must take advantage of the current situation. The Temple would not dare to publicly turn hostile against us. Even if they want to act, they would do so secretly. We can take advantage of this.\"</p><br/><p>The King casually played with the ring on his finger and slowly said, \"Then, what about the Black Veil Saint? What is her position on these matters?\"</p><br/><p>The Senior Prime Minister looked wise as he replied, \"That woman seldom appears in public ever since she came back from the South. Before the war, she had already lost most of the Temple’s trust. As a matter of fact, based on my secret observations, the Temple had long wanted to recall her. However, as she is already known to the public as a Saint and had been dispatched here by the Temple, they are probably waiting for an excuse to arise before acting.\"</p><br/><p>The King laughed and said, \"So, should we provide the Temple with an excuse? The Black Veil Saint is very powerful. Do we need to worry about this?\"</p><br/><p>The aged Senior Prime Minister lowered his head as if he was hiding his gaze and said, \"No, I believe a Saint who only appears to be in harmony with the Temple is actually beneficial to us. If the Temple were to send us a completely loyal Saint, then we would have more trouble.\"</p><br/><p>The King nodded, apparently satisfied with the aged Senior Prime Minister’s answer. He then asked again, \"Then, what is happening in the Temple right now? What is that Elder of the Temple thinking about? They actually appointed five new Paladins within the last ten days! I suspect he is up to some tricks! Are Paladins now worthless? It was so difficult to even find two to three real martial experts throughout the entire continent but suddenly so many of them appeared. Did they grow out from the ground?\"</p><br/><p>The King sounded a little angry and a little impatient. The more Paladins the Temple had, the greater the strength and the threat of the Temple.</p><br/><p>The Senior Prime Minister bowed and whispered, \"The Paladins' strength is beyond doubt. I have secretly sent people to investigate. These five people who were given the title Paladin all have outstanding strength. Their backgrounds are also very clean and nothing strange could be found. However, I feel like their clean backgrounds are very suspicious.\"</p><br/><p>The King’s eyes lit up. \"Do you mean...all these Paladins come from...\"</p><br/><p>The Senior Prime Minister kept quiet. He stretched out a single finger and pointed to the north.</p><br/><p>The King looked at the Senior Prime Minister’s gesture and showed a contemplative expression. \"Is it the Franks Kingdom? Although the Franks Kingdom was known as the ‘knight’s birthplace’, they have not produced a single Paladin for more than a hundred years.\"</p><br/><p>The Senior Prime Minister shook his head and continued to point north.</p><br/><p>The King frowned, \"Is the Teuton Kingdom secretly supporting the Temple? Hmp, the current Paladin Fielding is from the Teuton Kingdom. It is said that the Teuton Kingdom had produced a few outstanding martial experts. However, these people could not become Paladins overnight! Is their power given to them by God?\"</p><br/><p>The Senior Prime Minister shook his head again. His finger was still pointing towards the north.</p><br/><p>The King’s expression finally changed as he asked, \"Teacher, do you mean…those creatures?\"</p><br/><p>The Senior Prime Minister nodded and sighed, \"This is probably the only logical explanation! Even if it was the Radiant Continent, it would be impossible for so many Sacred Swordsmen to emerge in such a short time. Similarly, it is impossible for so many Paladins to emerge out of thin air on the Roland Continent. The only possibility is that strong race in the north!\"</p><br/><p>The King sneered and said, \"That old scoundrel of the Temple. In order to become a Pontiff, he even dared to collaborate with the Dragon race. Weren’t the Dragon race heathens? Could it be that the Dragons now dared to venture out of their territory?\"</p><br/><p>The Senior Prime Minister laughed and softly said, \"Your Majesty, do you still remember the words I said during the time when I was your teacher?\"</p><br/><p>The king lowered his head and thought for a moment. He then laughed and said, \"I remember!\" He closed his eyes and repeated those words, \"When something involves the highest interests, even grievances with mortal enemies could be solved. There are no permanent enemies nor permanent friends. Religion is just a deceit under guise. The brighter the place, the darker the hidden corners!\" At this juncture, the King opened his eyes and looked at the Senior Prime Minister. He then gently said, \"So, that old scoundrel of God, for the sake of achieving his highest interests, took this desperate action. He even went to the extent of tearing off their hypocritical religious masks. Is that right?\"</p><br/><p>The Senior Prime Minister did not say anything. He just bowed.</p><br/><p>The King slowly walked towards the edge of the hall. His palm gently touched the beautiful murals and reliefs on the wall. When his fingers touched the cold reliefs, his movements were gentle as if he was caressing his lover. The King then showed a proud expression. \"This is the wealth left behind by my ancestors. I will not give this kingdom away to God’s scoundrels!\" He then sighed and gave the Senior Prime Minister a glance. The King smiled. \"That’s enough. You may go back now. Tell me when there is news about the Radiant Empire’s envoy.\"</p><br/><p>The Senior Prime Minister gathered his sleeves and bowed.</p><br/><p>He slowly stepped back a few steps and then turned around to leave. The moment he left the palace hall, the chilly air on his face startled him and he involuntarily straightened his hunched body. His senile look disappeared and his muddy eyes flashed brightly. \"Our King is getting harder to control…\"</p><br/><p>Suddenly, he felt as if he was being watched. However, when he turned around to look, he found that the corner was empty. Was that uneasy feeling just an illusion?</p><br/><p>The Senior Prime Minister once again hunched his back and slowly hobbled away from the palace—it is better to be more careful in this place.</p><br/><p>The King seemed to be alone in the hall. Suddenly, he sighed. After that, he smiled and asked, \"Master Sith, what do you think?\"</p><br/><p>A black robe suddenly appeared at an originally empty corner. Under the black robe, a figure was revealed. The figure had an indifferent expression as though he did not have any emotions.</p><br/><p>\"Your Majesty, how am I supposed to answer this kind of question?\" His face gradually emerged from the dark corner, revealing a flat face as if it had been pared off with a knife. He had a cold expression and a cold tone of voice.</p><br/><p>If there were other people here at the moment, they would definitely be surprised to see his face. That was because he undoubtedly had one of the most recognizable faces on the Roland Continent. He was the Chief Sorcerer of the Sorcerer’s Association. The Grand Sorcerer, Master Sith, was undoubtedly the most famous person on the Roland Continent.</p><br/><p>An even more surprising thing was that the Chief Sorcerer of the Sorcerer's Association had appeared at the Sauron Kingdom. This was because the Sorcerer’s Association had always been the Temple’s most loyal ally.</p><br/><p>The King waved his hand and showed a dissatisfied expression. \"Master Sith, do you need to show me that cold expression even when I am your ally, now? I also know that the Senior Prime Minister is secretly having dealings with the Temple. However, I am not surprised! It is just like what he taught me! When it involves personal interests, there are no permanent enemies nor permanent friends. For example, he is working together with the Temple and right now, you are here on my side.\" The King then showed a profound smile as he looked meaningfully at the greatest sorcerer of the Roland Continent.</p><br/><p>Sith’s solemn expression flashed with a trace of color as he said, \"However, you must also not forget. We are only temporary allies. There are some reservations in all cooperation with the Sauron Kingdom. Do you really trust me so much?\"</p><br/><p>The King gently smiled and cleverly changed the topic, \"Is your information about the Radiant Empire’s envoy accurate? Did he really kill the Temple’s Paladin on his own?\"</p><br/><p>Sith shook his head and replied, \"To be precise, I do not know very much. I only know that the Temple had dispatched the person I dislike, Amore Hughes, to intercept them. However, none of them returned.\"</p><br/><p>The King laughed happily. He then sighed and said, \"Looks like our new ally at the southern continent has given us an extraordinary fellow.\"</p><br/><p>As if he deliberately did not want the King to feel too pleased, Sith’s cold eyes flashed with ridicule as he said, \"This news is not only known to us. In fact, your Senior Prime Minister should have received this news last night but…\"</p><br/><p>The King shook his head and said, \"However, he did not tell me because this news came from the Temple. He is afraid that I would suspect the source of his information. Master Sith, is this the purpose you are telling me this?\"</p><br/><p>Sith coldly looked at the King and remained silent.</p><br/><p>The King slowly sat down and firmly said, \"No matter how the situation changes, I always believe in one truth. Exploit!\" His serious expression revealed a bit of pride as he continued, \"Any circumstance can be exploited, provided you are clever enough!\"</p><br/><p>Sith looked at the ordinary person sitting in front of him. Although he respected the King, from the point of view of a sorcerer, the King was just an ordinary person. He did not have the strength of a knight and he did not have the powerful magic of a sorcerer. Even for now, if Sith were to casually cast a spell, the King would easily die.</p><br/><p>However, the King’s confidence gave Sith a strange feeling. The Sorcerer’s Association and the Sauron Kingdom was cooperating so that we would not be swallowed up by the Temple. However, would we be swallowed up by this King instead if we continue to cooperate?</p><br/><p>...</p><br/><p>In the dark of the night, at a distance of about one hundred kilometers away from the King Sauron’s tall and grey tower, there were about five horses rushing quickly towards the temple hall. As they held the staff of a High Priest of the Temple, the guards did not stop them.</p><br/><p>When they directly rushed to a flight of stairs on their horses, they were finally stopped by two of the Temple's padres.</p><br/><p>Looking at the big closed door behind the two padres, the five men dismounted from their horses. Black robes tightly wrapped around them and big hoods covered their faces. The man leading them said in a hoarse voice, \"We came from the Temple to see Her Excellency!\"</p><br/><p>The two padres looked at each other and one of them showed an awkward expression as they replied, \"Her Excellency is cultivating behind closed doors. I am afraid…\"</p><br/><p>That leader cried out, \"This is the order of the Chief Elder of the Temple. Do you dare to defy it?\" He slowly pulled down the hood covering his head and revealed his angry expression. The two padres could clearly see a metal armor gleaming below his neck.</p><br/><p>Just when that man was about to say something, he felt a strong big hand gently pat his shoulder. That man immediately lowered his head and retreated.</p><br/><p>A tall figure then came out from behind him. His voice sounded deep and resonant. \"Go and report this to Her Excellency. You will not be punished.\"</p><br/><p>Before the two padres could speak, four young knights had already appeared from the corridors on both sides of the hall. Each of them wore silver armor and had a black cloak with the 'Holy Knight' symbol on it.</p><br/><p>The young knight taking the lead had a cold expression. He said, \"Who dares to disturb Her Excellency’s cultivation? Her Excellency has commanded. If there is anything, you can just relay it to me!\"</p><br/><p>Some of the young knights had already moved their hands to the hilts of their swords at their waists.</p><br/><p>Some of them thought to themselves, ‘Temple! The Temple again! Did the Temple send people to punish Her Excellency? No matter what, we must not let them harm Her Excellency.'</p><br/><p>The tall man with the deep voice sighed. He slowly raised both his hands to pull back his black hood, revealing his squarish face and his beard. The dense beard made him look courageous and resolute. After that, the man untied his belt and took off his robe to reveal a Paladin’s golden armor.</p><br/><p>The young knight who stopped him was finally so astonished that he called out, \"Your Excellency Augustine!\"</p><br/><p>When faced with the most well-known and oldest Paladin of the Roland Continent, those young people immediately lowered their arrogant heads as if they saw their dream idol. They immediately moved their hands away from their sword hilts.</p><br/><p>None of them dared to be rude in front of the Paladin. Besides his position, those young men also respected Augustine’s refined personality.</p><br/><p>Augustine spoke in a very mild tone, \"Well, I came in secret. Do not disclose this. Now, take me to see Her Excellency.\"</p><br/><p>Despite his mild tone, the Paladin could not help revealing an anxious expression.</p><br/><p>The four young knights hesitated for a moment and then softly said, \"Your Excellency Augustine, Her Excellency had said this before going in there that she would not meet anyone even if it was the Chief Elder.\"</p><br/><p>Augustine frowned and replied, \"Too willful! Don't tell me that just because of a little bit of discord, she can disobey the orders of the Temple?\"</p><br/><p>He suddenly walked two steps forward. The four young knights hesitated, but they still stood in front to stop him. However, they did not dare to touch their swords at their waists. They simply blocked the narrow flight of stairs with their bodies.</p><br/><p>Augustine gently raised his eyebrow and whispered, \"As the Holy Knights Regiment Commander, I command you to move aside. Do not force me to fight.\"</p><br/><p>The young knights were still hesitant. Augustine suddenly laughed and said, \"It seems like you really respect your Excellency. You even dare to defy my orders for her.\"</p><br/><p>Augustine slowly raised his palm and put it on the shoulder of a young knight in front of him. A gentle power transmitted through to the body of the young knight. The body of that young knight went soft and was pushed to one side.</p><br/><p>At that moment, the door above the flight of stairs opened quietly and a slender figure wrapped in black robe slowly walked out.</p><br/><p>Her long and black satin-like hair fluttered in the night wind. The corners of her black veil also fluttered. Under the night light, her face was beautiful like a goddess. Her eyes were like the stars in the sky, coldly looking down at the Paladin who was at the bottom of the stairs.</p><br/><p>Augustine released his hands, smiled and said, \"Mouse! Long time no see!\"</p><br/><p>The eyes within the black veil revealed some warmth, but her voice remained bland. \"Augustine, they sent you here this time. However, I will not compromise even if it is you!\"</p><br/><p>Augustine sighed and replied, \"I already guessed that you would say this. However, this time I am not here to force you to make a decision. I came bringing the latest order of the Temple. This is a joint decision by several Elders and not just His Excellency’s intentions. I do not think you would oppose it this time.\"</p><br/><p>The black veil woman closed her eyes and seemed to ponder for a moment. She then lifted her head and looked at Augustine. \"Your Excellency Paladin, please come in.\"</p><br/><p>Translator's Note:</p><br/><p>1. A saying or phrase to tell people seeking the limelight that it is not necessary to display one’s abilities.</p><br/><p>2. (yòu xiāng ). In ancient China, circa 700 BC, there used to be 2 Prime Ministers, (yòu xiāng ) and (zuǒ xiāng ). The more senior of them is , hence, the translated term is Senior Prime Minister.</p><br/>\n</div>"}