{"title": "Chapter 235: Stunning Beauty", "id": 235, "volume": 3, "url": "http://boxnovel.org/masked-knight-chapter-235-stunning-beauty", "volume_title": "Volume 3", "body": "<h1>Chapter 235: Stunning Beauty</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 235: Stunning Beauty – Seth</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Seth completely regretted it.</p><br/><p>He really did not expect that such a day would come. Seth Rudolph! The most famous playboy in the Imperial Capital, the master of love and the perfect lover to young women. Yet today, he had been forced to act as a woman to seduce a man!</p><br/><p>His other regret was offending that woman named Mouse. However, he did not know when he had offended her!</p><br/><p>What Seth did not know was that the majority of Mouse’s actions was for Rody to vent his anger. Along the way here, Mouse had listened to Rody narrate his life experiences. Mouse felt resentment for Seth since he manipulated Rody like a puppet. This was a good opportunity to punish Seth!</p><br/><p>Mouse did all she could to make Seth look like a beautiful and charming woman.</p><br/><p>As they were in the Summer Palace of the King, there were naturally a lot of female clothes. Besides that, the King had also dispatched his men to deliver other stuff for women when he found out that the envoy had arrived with womenfolk.</p><br/><p>Mouse carefully selected an evening dress that is most suitable in showing off a woman’s charm. She then got started with Seth’s 'painful' makeup!</p><br/><p>The first was Seth’s skin. As an elegant man, Seth actually had very fair skin. That being said, a man’s skin, however fair, could never be compared to the delicate smoothness of a real beauty’s skin. As far as that was concerned, Mouse had a solution too!</p><br/><p>According to Mouse, after a bath, the skin of a person would be in a fair and tender state...so Seth was then forced into the bath for a round of scrubbing by Rody and Old Mark!</p><br/><p>King Sauron apparently was a person who enjoyed life's pleasures. That was why his temporary royal residence also had an exquisite bathroom with even a sauna. After washing and steaming a few times and after Seth passed out from the heat, Seth’s skin completely revealed a fair, delicate and rosy complexion...</p><br/><p>Mouse took almost two hours to do Seth's makeup!</p><br/><p>The first was Seth’s face. According to Mouse, a person’s skin was at its most delicate state when they had just taken a bath. At that moment, the makeup lotions would be readily absorbed by the skin. Mouse prepared some unknown lotion and applied it on Seth’s face and neck. That made Seth’s face and neck display a genuine and feminine delicate fairness.</p><br/><p>Next was Seth’s eyebrows. Although he had already been dressed up as a female along the journey here, as he was going to attend a banquet, close observation would reveal the flaws. Therefore, Mouse was especially attentive.</p><br/><p>Since Seth was a man, his eyebrows were naturally a little bit thicker. Mouse took out a small tweezers to pull out Seth’s eyebrows, strand by strand. She then used a magical medicine to stick on a pair of fake eyebrows on him!</p><br/><p>Now looking at them, Seth’s eyebrows could be said to be beautifully curved like the moon. They were truly long and shapely feminine eyebrows!</p><br/><p>Seth’s eyes were relatively simple to deal with since he had natural long eyelashes. With the application of a magical medicine that lengthened eyebrows, Seth’s slender eyes were shrouded under his long eyelashes. That gave his eyes a hazy look, making him charmingly seductive.</p><br/><p>After using blusher to the rough corners of his face, the entire contour of his face became softer. Seth no longer looked masculine. A quiet and leisurely look came to life.</p><br/><p>In all fairness, Seth was originally a rare beautiful man. He was of a totally different category compared to Rody. Seth had a delicate handsome face with a little bit of femininity. After Mouse’s meticulous makeup, his face had been cleverly transformed!</p><br/><p>Mouse also put in a lot of thoughts to his hair. She spent a full hour to heat up his long golden hair into small curls. His whole head of long hair was curled up into spiral coils. The curly loose strands in front of his forehead draped down in waves. That gave the ‘beauty’ a strange attraction.</p><br/><p>As for Seth’s body, it was more difficult. After all, he was a man with a slim body and could not have the kind of nice curves like that of a female. However, Mouse had chosen an evening dress with loose style. Fortunately, Seth was naturally slim. His waist was deliberately bound with a belt that highlighted his waist, giving it a ‘water snake’ shape.</p><br/><p>Finally, what was left was the way he walked. As a man, Seth's walk was naturally very different from that of a woman's. However, with Mouse’s demonstration, Seth finally managed to walk a few steps.</p><br/><p>Getting him to sway his hips was like asking for his life. Despite how Mouse threatened or cajoled Seth to gently sway his hips like a woman, Seth refused to, even if it meant killing him.</p><br/><p>In fact, given Seth's intelligence and wisdom, if he had wished to, it would not be a problem. As a playboy, he had encountered countless women and his understanding of women might not necessarily be less than Mouse. However, Seth was embarrassed and could not let go of his pride to sway like that.</p><br/><p>However, in the end, that problem was solved by Rody.</p><br/><p>After Rody whispered something in Seth’s ear, Seth turned pale and looked troubled. He was distressed! Finally, he sighed and obediently gave up. What followed next greatly exceeded Mouse’s expectations.</p><br/><p>Seth not only walked a few steps barefooted on the ground, he also swayed his waist like a woman. Even when he was wearing high heels, the way he walked was quite stylish. The way he walked and his lovely figure even made Mouse consider herself inferior. Although she was a woman, as the Black Veil Saint, she rarely had the opportunity to show her gentle and charming side. She had also never worn evening gowns and high heels before.</p><br/><p>Mouse was very puzzled as to why Seth suddenly became so obedient. Feeling surprised, she asked Rody and Rody's answer was very simple.</p><br/><p>Rody said, \"I told Seth that I had brought the 'God’s Smile' mask with me. I let him choose. He can refuse to let us dress him up, but I will make him wear ‘God’s Smile’ and change his face. He can change his face, but he will have an additional pair of long donkey ears that cannot be removed.</p><br/><p>Although Seth was red with shame as he spun in a circle in front of everyone, in the eyes of the men around, that blushing ‘woman’ looked even prettier especially when the evening dress accentuated his beauty and concealed his defects.</p><br/><p>Mouse carefully examined Seth all over including his hands!</p><br/><p>Fortunately, he was a pampered noble since young. He had slender fingers and a fair skin, not rough like those of an ordinary man. After Mouse ingeniously applied some flesh colored lotion, his hands became like a woman’s 'lily-white' hands. His fingernails were also smeared with lotions, giving them a faint red color.</p><br/><p>Everyone was stunned to look at the transformed Seth. Before Rody could speak, Old Mark had already sighed, \"This is no longer Young Master Seth. This is obviously Miss Nicole!\"</p><br/><p>Without a doubt, the Seth in front of them looked very similar to Miss Nicole. As they were blood siblings, both Seth and Nicole resembled each other. Now, after the rigorous modification, the transformed Seth looked remarkably alike to Miss Nicole when he stood in front of everyone.</p><br/><p>Rody had no choice but to agree to Old Mark’s words. He could not help but sigh and say, \"Indeed, even for me, I also thought you were Nicole at first glance.\"</p><br/><p>After hearing those words, Mouse looked at the radiant ‘Miss Nicole’ in front of her. She could not help revealing a bit of jealousy. She then smiled and suddenly clapped her hands as she laughed, \"I almost forgot, there is one more thing left!\"</p><br/><p>Seth turned pale. \"What else is there?\"</p><br/><p>Mouse had already turned around to take out a pair of shiny things from the cupboard. She smiled evilly and said, \"Your ears are slightly bigger than a woman’s. In order to cover that up, you will need to wear this.\"</p><br/><p>She opened up her hand and on her palm was a pair of blue gem earrings.</p><br/><p>Mouse then smiled and said, \"Come over, I will help you pierce your earlobes!\"</p><br/><p>…</p><br/><p>A pair of fully equipped elite soldiers of the Royal Knights were in front of a luxurious carriage. Sitting side by side in the carriage was Rody and Seth.</p><br/><p>Although the seats were soft and velvety, Seth seemed to sit uncomfortably and squirmed restlessly. Rody had to warn him not to fidget around so much, so as not to mess up the disguise.</p><br/><p>Seth hated it so much. He felt the two earrings on his ears uncomfortably heavy. Earlier, the process of having his earlobes pierced was simply a torture!</p><br/><p>That Mouse did not know how to pierce earlobes! Seth secretly regretted. He should have realized that Mouse, who had been cultivating in the Temple, would not have known how to pierce earlobes. He should have long realized that when Mouse clumsily held the earrings to his ears and pricked arbitrarily!</p><br/><p>The result was, Seth gave a blood-curdling scream as two messy holes appeared in his earlobes. Fortunately, Mouse was amongst the best sorcerers and readily healed Seth’s ears with her magic.</p><br/><p>It was useless even if Seth struggled. Rody held Seth’s head and Seth was unable to resist. He could only obediently surrender his ears to Mouse for her to prick arbitrarily...</p><br/><p>He was afraid even just thinking about it!</p><br/><p>Crown Prince Aven stood in front of his own palace and waited anxiously.</p><br/><p>He looked like an innocent boy waiting for his first date. His eyes contained feelings of expectations, joy, nervousness, and worry.</p><br/><p>He felt nervous that he could not help pulling the lower hem of his clothes. Just then, the carriage for the Special Envoy of the Radiant Empire finally arrived.</p><br/><p>The attendant walked up and opened the door of the carriage. The first to get down the carriage was the special envoy, Earl Rody. After that, a foot wearing a black leather shoe appeared from the inside of the carriage...followed by a slim white hand holding onto the door of the carriage.</p><br/><p>After that, Crown Prince Aven saw the face that made him yearn day and night.</p><br/><p>Prince Aven almost pushed the attendant aside and strode over. In the most graceful and gentlemanly manner, he helped ‘Miss Nicole’ get off the carriage.</p><br/><p>Looking at the beauty in front of him with endless admiration, he picked up his courage and said in his most sincere and tender voice, \"Welcome, Miss Nicole of the Tulip Family. Your presence is my greatest honor!\"</p><br/><p>The ecstatic youngster could no longer wait. He pulled Seth’s hand towards his lips and kissed his hand like a noble knight.</p><br/><p>Prince Aven then faced Rody and nodded. After greeting him with a few words, the host, Prince Aven, led them into his palace.</p><br/><p>What Aven did not see was that ‘Miss Nicole’, who was walking behind him, had goosebumps all over his face. He could not help but put the hand that Aven kissed at the back of his skirt and rigorously rub twice.</p><br/><p>Aven led them through a big circular door and entered the banquet hall.</p><br/><p>There were already several other invited guests in the hall. As the identity of the Radiant Empire’s Special Envoy was not disclosed to the public, it was only a small private banquet.</p><br/><p>The thick soft carpet was luxurious to walk on. The other invited guests were also people of status.</p><br/><p>Rody was surprised and was not sure of the intention of Prince Aven. Surprisingly, he actually invited all the other kingdoms’ diplomatic ambassadors who had been staying in the Sauron Kingdom.</p><br/><p>Those ambassadors of the other kingdoms clearly knew Rody’s identity as the Special Envoy of the Radiant Empire and were extremely deferential towards Rody and Seth. It was obvious that after the peace negotiation, hundreds of thousands of soldiers would be released and those kingdoms actually needed that urgently.</p><br/><p>His Highness, Aven, had originally opposed the peace negotiations. Why would he organize the peace faction banquet?</p><br/><p>Rody did not have time to think. His Highness Aven impatiently led Seth around and introduced him to the other guests. He even boldly but gently touched Seth’s hands a few times. Seth had grown up in an aristocratic circle and was naturally very familiar with the etiquette. So when faced with these noble smiling guests, Seth did not make any mistake that would give him away.</p><br/><p>The only thing that made Seth feel cold was the way the Crown Prince looked at him. The gaze was filled with more and more affection...</p><br/>\n</div>"}