{"title": "Chapter 237: Provocation", "id": 237, "volume": 3, "url": "http://boxnovel.org/masked-knight-chapter-237-provocation", "volume_title": "Volume 3", "body": "<h1>Chapter 237: Provocation</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 237: Provocation</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Sky?</p><br/><p>That old fellow with fat all over his body? He was the strongest Paladin in the history of the Roland Continent?</p><br/><p>Rody could not imagine what Sky would look like in Paladin armor...</p><br/><p>Although there were a lot of people in this world with the same name, to have the ability to defeat two Paladins, there was unlikely anyone else other than Sky...</p><br/><p>When the Crown Prince and the Senior Prime Minister saw the Special Envoy coughing violently with a strange expression, they could not understand why Rody reacted strangely.</p><br/><p>Rody realized they were looking at him in a strange way. He pretended to clear his throat and smiled wryly, \"It is nothing. I was just a bit too excited when I heard of this person’s legendary exploits.\" He could not help but look again at the sword in the Crown Prince's hands and he thought to himself, 'To think that that fatty had such a marvelous story. Looks like I would need to ask him about it when I return.'</p><br/><p>The Crown Prince gently caressed his sword. He then narrowed his eyes, revealing a sharp gaze as he said, \"Your Excellency the Earl was originally from the Lightning God’s Whip. I heard that in your country, there is a strong Wolf Fang army within the Lightning God’s Whip. They are the elites and use a peculiar type of scimitar. Those scimitars were meticulously forged by the blacksmiths and are sharper than ordinary swords. Is that true?\"</p><br/><p>Rody nodded and replied, \"The Wolf Fang is the cavalry regiment directly under the Duke of the Tulip Family. Naturally, their weapons would be special.\"</p><br/><p>The Crown Prince then looked towards Rody’s waist. He smiled and said, \"Your Excellency the Earl, the scimitar at your waist must be from the Lightning God’s Whip? It looks unique.\"</p><br/><p>Rody smiled as he thought to himself. He then nodded silently.</p><br/><p>The Crown Prince gradually revealed his true intention as he said, \"The scimitars of the Wolf Fang in your country are well known throughout the world. It is said to be better than the scimitars from the Northern Grasslands! Although the scimitars originated from the Great Moon Kingdom, their forging standards could not be as developed compared to the Empire. The scimitar that belongs to Your Excellency the Earl must be something unusual! Is it possible for us to have a look?\"</p><br/><p>Rody frowned since his scimitar was not the standard weapon of the Wolf Fang. It was the Dragon Spell Sword. Rody did not want to complicate matters. Since the Crown Prince had already raised the issue, Rody simply smiled and removed the sword from his waist. He handed it over and said, \"Your Highness, please take a look. However, my scimitar is just an ordinary weapon. I do not dare to compare it with Your Highness’ treasured sword.\"</p><br/><p>Aven drew out the scimitar and looked at it for a while. He was amazed. Rody’s scimitar originally had a unique shape. In addition to that, a few days earlier, it was refined with the Ice Dragon’s soul. Unsheathed, it was exceptionally radiant and threateningly cold.</p><br/><p>The Crown Prince asked, \"What are the strange words on the sword?\" He could not help but gently stroked the sword. His face clearly showed his fondness for it.</p><br/><p>Rody looked at his expression and immediately became vigilant. The Crown Prince seemed to have a habit of collecting strange weapons. It would be difficult to refuse if he suddenly asked for it or wanted to buy it, so Rody said, \"This scimitar was presented to me by His Majesty the Emperor. I, too, don't understand those words on it.\"</p><br/><p>Sure enough, Aven’s expression looked slightly more depressed the moment Rody said that the scimitar was presented to him by the Emperor. Although he really liked the scimitar, he also knew that an Emperor’s gift could not easily be given away or sold.</p><br/><p>Aven did not have good intentions when he gave the order to bring out his prized collection. He originally wanted to incite the Earl to outshine him and to compete in a duel with those weapons. As long as he could break the Earl’s weapon, then he would have embarrassed the Earl and that would help him vent a little of his resentment.</p><br/><p>However, when Aven saw that the Earl's scimitar was not an ordinary weapon, he hesitated a little. The scimitar looked very sharp. If they were to suggest a competition, it might be possible for his treasured sword to get damaged. Losing face was one thing. But he would be in distress as the sword was not easy to acquire.</p><br/><p>Aven’s expression immediately changed a few times. Suddenly, he recalled that the Earl's scimitar was a gift from the Emperor. He made a ruthless decision.</p><br/><p>'Take the risk!'</p><br/><p>Since the scimitar was a treasured gift from the Emperor, then if he could break the scimitar here, the Earl would get into big trouble! It would not be a minor offense if the treasured gift presented by the Emperor was damaged!</p><br/><p>Thus, Aven secretly gritted his teeth and said, \"Your Excellency the Earl, it looks like your scimitar is extraordinary. Why don't we test it out? It is rare to see two mysterious weapons together. Why don’t we find out whose weapon is better?\"</p><br/><p>How could Rody agree to that kind of match? He naturally refused outright in all ways possible, and also pretended to be modest. \"Your Highness’ treasured sword is an unusual weapon. How could my scimitar compare? Let's forget it!\"</p><br/><p>When Aven saw Rody declined, he continued to insist. Rody simply shook his head and refused.</p><br/><p>The Senior Prime Minister beside them did not say anything. He deliberately stepped back and quietly observed them with a smile. Seth smiled meaningfully and said, \"Your Highness, I have an idea. Should I say it?\"</p><br/><p>Aven laughed and immediately replied, \"Miss Nicole’s ideas must definitely be good. Please go ahead!\" He paused for a moment, then felt like he should encourage her more. He then added, \"Please speak. I will definitely respect your idea.\"</p><br/><p>Rody was stunned for a moment and then glared at Seth. He wondered what kind of trick Seth wanted to play.</p><br/><p>Seth did not look at Rody. He gently smiled and said, \"Earl Rody is our country’s Grade 5 Swordsman. He is a warrior under the command of the Duke of the Tulip Family. As the Regiment Commander of the Navy for one of the kingdoms on the Roland Continent, Your Highness must definitely have powerful warriors reporting to you. What is the point of just comparing weapons? I suggest we might as well have Earl Rody compete against a warrior selected by Your Highness. Let's see who is the more powerful warrior. As the warriors spar, the advantages and disadvantages of the two weapons would be show up.\"</p><br/><p>The moment those words were spoken, Rody's first reaction was to strangle the troublemaker to death.</p><br/><p>He was trying to conceal his strength. His real purpose of coming here was to find out the actual situation of the other party. However, if he were to compete, he would end up revealing his strength.</p><br/><p>Seth still did not look at Rody. He deliberately gave the Crown Prince a shallow smile and softly said, \"Your Highness, what do you think of my suggestion?\"</p><br/><p>The Crown Prince was swept away by the gaze from ‘Miss Nicole’. He felt dizzy and flushed as he said, \"Good! Good idea!\"</p><br/><p>Rody frowned and he could only look at the Senior Prime Minister. He hoped the Senior Prime Minister would say something to stop it. However, the Senior Prime Minister silently stood there smiling. He looked at Rody’s eyes meaningfully.</p><br/><p>Rody was clear in his mind. The Senior Prime Minister’s standpoint was strange. He believed that the Senior Prime Minister wanted to take this opportunity to gauge his strength.</p><br/><p>Thinking of that, Rody shook his head and said, \"Your Highness, I came to your country to negotiate for peace. It is not good for me to fight in a challenge.\"</p><br/><p>\"We are just learning from each other. It is unrelated to Your Excellency the Earl’s mission. I have long heard that it is common for the people of your country to learn from each other in contests. Perhaps you are worried? Don’t worry. My subordinates know their limits when they fight.\"</p><br/><p>Rody smiled helplessly.</p><br/><p>Rody was of course not afraid to fight. No matter how powerful the Crown Prince’s subordinates were, they would not be as powerful as Paladins. However, hurting the Crown Prince’s subordinates in a private contest would be bad. No matter what was said, he came here for peace negotiations. Besides that, the Senior Prime Minister was also not a simple person. He looked as if he could see through Rody.</p><br/><p>That being said, the proposal was made by ‘Miss Nicole’. Rody could not openly oppose the words of the ‘eldest daughter of the Tulip Family’.</p><br/><p>As he could not decline, everybody went outside the palace. After hearing what had transpired, the smarter diplomatic envoys from the other kingdoms immediately thought it strange. They were worried that the Crown Prince, who had opposed the peace negotiations, had now come up with another trick. One by one, they went outside to spectate.</p><br/><p>The Senior Prime Minister did not say anything from the start until the end. He simply stood on the sidelines, watching. However, when the Crown Prince suggested he personally compete, the Senior Prime Minister cautioned him and said, \"Today, in the palace, Your Highness has just been reprimanded by His Majesty. I suggest you do not compete.\"</p><br/><p>After what the Senior Prime Minister said, Aven hesitated for a moment before he gave up the idea of personally competing in the fight. After all, no matter what the result would be, His Majesty the King would definitely be angry if he were to go out and fight personally. That day, he had already angered His Majesty, so it was better for the Crown Prince to restrain himself. Moreover, Aven knew his own capability and he might not necessarily defeat a Grade 5 Swordsman. It would be even more unsightly if he were to lose.</p><br/><p>The person who would fight in the contest was the sturdy warrior that brought the sword. His name was Leho. Aven had introduced him as one of the commanders of the Navy. Originally, Leho and Aven were part of the Royal Knights. Aven was extremely reverent when he talked about Leho; he was probably quite skillful.</p><br/><p>Rody and Leho stood facing each other. Leho was holding the Crown Prince’s treasured sword. His eyes were like lightning as he fixed his stare at Rody as if he was getting ready to strike.</p><br/><p>Rody pretended to look tensed but at the same time was pondering over the matter.</p><br/><p>'The Crown Prince is of the pro-war faction. Naturally, he does not know my strength. However, the Senior Prime Minister has heard the news that I have killed three Paladins. Although he does not really believe the news, he will not be so naïve as to think that I am just a bungling oaf. What are his intentions by consenting to this competition?'</p><br/><p>'Regardless of the outcome, the Crown Prince will certainly be reprimanded by the King. In other words, he is not on the Crown Prince’s side.'</p><br/><p>'Whose side is this old fellow with?'</p><br/><p>'Perhaps he heard the news about me and doubted my strength? He also wanted to take this opportunity to find out how strong I am?'</p><br/><p>Aven deliberately stood beside Seth. His words were filled with attempts to win her favor. He also faintly boasted to Seth that Leho was one of the greatest masters during his time in the Royal Knight. He was even selected to become a Paladin. However, he rejected the offer to become a Paladin because of his loyalty to the Crown Prince. He remained by Aven and followed him to join the Navy.</p><br/><p>Aven then told Seth not to worry as Leho knew how to restrain himself and would not hurt the Earl.</p><br/><p>Feeling tired of it all, Seth sighed. He looked at the Crown Prince with pity.</p><br/><p>Rody was still thinking of something else when he heard Leho roar loudly. Leho raised the sword in his hands as he rushed forward and slashed down!</p><br/><p>Rody was helpless. He only raised his hands holding his scimitar to block!</p><br/><p>There was a loud clang as the swords struck each other. Rody deliberately moved back a few steps. On the last footstep, he also deliberately stomped forcefully on the ground, creating a hole in the stone slab on the ground. He then spat and loudly said, \"Good!\"</p><br/><p>Leho's attack was blocked. However, he moved quickly and with just a few steps, he was attacking furiously. He indeed had extraordinary strength. According to Rody’s estimate, he had already achieved the rank of a Senior Knight. If Rody was a real Grade 5 Swordsman, against those series of attacks, he would have been battered a long time ago.</p><br/><p>The two fought for a while, their swords clashing with loud clanging sounds. Rody deliberately concealed his own strength. He did not use any fighting energy and only defended passively. Blocking repeatedly from left and right with the scimitar in his hands, he took all the attacks from his opponent.</p><br/><p>Those diplomatic envoys from the other kingdoms were knowledgeable. They saw that the Crown Prince’s subordinate was powerful. His violent onslaught made them secretly fearful. They could not help but softly applaud. They dared not applaud loudly because of Rody's identity.</p><br/><p>Seth watched the battle and yawned repeatedly. Although Leho was quite strong and his onslaught was imposing it could not be compared to the Wind Dragon Amu’s earth-shattering attacks...</p><br/><p>Rody pretended to look engrossed. Clang! Clang! Clang! They fought for a while but Rody had only defended since the beginning. He did not strike back at all. When he felt that the fight had gone on long enough, he blocked another attack from his opponent and jumped away. He then smiled and said, \"Stop!\"</p><br/><p>Leho gasped for breath and asked, \"What’s wrong?\"</p><br/><p>Rody loudly said, \"That’s enough! I have great admiration for your strength. I think it is time to end this spar.\" He turned his scimitar, holding it so that the cutting edge was topside, ready to walk to the side.</p><br/><p>Leho’s eyes flashed. He rushed forward and shouted, \"As a warrior, how could you so easily admit defeat?\"</p><br/><p>Rody frowned as he lightly dodged his strike and said, \"We are only sparring. Do we need to fight to the death?\"</p><br/><p>Leho held the sword with both his hands and slashed it down. When they got closer to each other, Leho whispered, \"I can see that you are concealing your strength!\"</p><br/><p>Rody’s eyes lit up. He narrowed his eyes and softly asked, \"What do you want?\"</p><br/><p>\"Show your true strength! Convince me by making me lose. Then I will let you go!\"</p><br/><p>As the two of them talked, the people around them gradually started to applaud.</p><br/><p>Leho fought seriously during the time the two of them talked. As they exchanged those few words, Leho had slashed about eleven times. Each of those slashes faintly brought with it a strong gust of wind and the sword was covered with fighting energy!</p><br/><p>Leho was very fast with his attacks. However, Rody dodged even faster. In his hand, Rody was still holding the scimitar in reverse. Although Leho’s attacks were ferocious, they could not even touch Rody’s clothes. Rody’s figure was like a ghost in everybody’s eyes. He was like a falling tree leaf that was constantly fluttering. No matter how fiercely Leho attacked, he could not do anything with that leaf!</p><br/><p>Rody gradually got angry when he saw his opponent persistently attacking him. Since the start of his career, he had never gotten into a disadvantageous position in a contest. Although he was trying to hide his own strength, the arrogance in his heart was becoming agitated. Suddenly, the opponent’s sword slashed down at him. Rody’s eyes flashed with anger as he turned over his hand and raised his sword. Clang! There was a clashing sound as the weapons struck against each other. Leho grunted as he staggered back seven to eight steps. The hand holding the sword faintly trembled and his face turned red.</p><br/><p>Rody saw that the Senior Prime Minister, who was at the side, was astonished, and he regretted not controlling himself better.</p><br/><p>Seeing Leho gasping for his breath, Rody realized something. He recalled how Master Autumn confused the Church when he was in the Imperial Capital.</p><br/><p>'Hmph! You all want to see my real strength? In that case, I will show you my \"real\" strength!'</p><br/><p>\"Do we really need to determine the victor?\" Rody narrowed his eyes.</p><br/><p>Leho did not speak. Silver fighting energy burst out from his sword. He suddenly took a deep breath and slashed his sword downwards and a blade of wind shot towards Rody. He also instantly scuttled out and stabbed forth from the left!</p><br/><p>Rody sneered and stretched out a hand. He gently touched the space above with his left hand and a golden light shield immediately emerged in front of him!</p><br/><p>Leho's wind blade smashed into Rody’s shield which instantly broke. Rody's action was even faster. The moment he saw Leho’s sword in front of him, instead of blocking with his sword, he readily caught it with two fingers!</p><br/><p>Leho had put in all his strength into that attack, but it just did not have any effect! He had thrust with his sword but could not move it forward an inch!</p><br/><p>Rody lightly held the sharp end of the blade with his two fingers and said, \"Let go!\"</p><br/><p>Leho’s face had turned purple. He was stubborn by nature. Not only did he refuse to let go, instead he suddenly clenched the fist of his other hand and swung it towards Rody. Rody coldly looked at his opponent and he then forcefully twisted the sword blade of his opponent with his fingers ...</p><br/><p>Halfway through swinging his fist, Leho felt a strong, inexorable turning spiral force on the other hand. He could not counter that force. He quickly rotated his body in the air like a gyroscope to follow that rotation of his sword before crashing to the ground!</p><br/><p>However, Leho was a valiant man. Although he was lying down on the ground, he still held on tightly to the sword. Rody sighed and loosened his fingers. He was about to withdraw when Leho roared loudly and attacked again!</p><br/><p>Rody was really angry now. He suddenly slashed with his scimitar, creating a loud crisp sound.</p><br/><p>Ting!</p><br/><p>The precious sword in Leho’s hands was broken into two by Rody. Half of the broken sword flew up into the sky and spun a few times before it fell and stabbed into the ground.</p><br/><p>It had fallen right in front of Crown Prince Aven's feet!</p><br/><p>He looked at the pale Leho, the surprised and frightened Crown Prince, the strange gazes of the surrounding people and the Senior Prime Minister with his thoughtful eyes.</p><br/><p>Rody did not care about all that anymore. He looked at the broken sword in Leho’s hands and thought to himself. 'Shit, I broke fatty’s sword into two. Will he come after me?'</p><br/>\n</div>"}