{"title": "Chapter 263: The Enlightened Bait", "id": 263, "volume": 3, "url": "http://boxnovel.org/masked-knight-chapter-263-the-enlightened-bait", "volume_title": "Volume 3", "body": "<h1>Chapter 263: The Enlightened Bait</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 263: The Enlightened Bait</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Although Rody was very angry, because of his many past trials, he forced himself to calm down. His rationale told him there was no point in getting angry. It would better to wait for the other person to finish talking.</p><br/><p>With that thought in mind, Rody sat down again and calmly looked at the Grand Sorcerer of Roland Continent and said, \"Continue to speak.\"</p><br/><p>The wrinkles on Sith’s face were like dried orange peels. His eyes revealed a complicated gaze as he slowly said, \"In the history of the Roland Continent, there was once because of the resource of ironwood, a war broke out between the various kingdoms on the Roland Continent and the dwarfs...The King has mentioned this to you before.\"</p><br/><p>\"Yes.\" Rody nodded calmly.</p><br/><p>\"During the beginning of that war, the Temple secretly supported the many kingdoms of the Roland Continent. It could even be said that the Temple was the one who instigated the war. In the eyes of the Temple, the dwarfs were, after all, a different race. They could not rest easy having a different race control the essential resources of the Roland Continent.\"</p><br/><p>\"Although the dwarfs were quite strong, they were unable to fight against the united armies of the numerous kingdoms. But just when they were about to be defeated, news came from the Temple…\" Sith looked at the ceiling and expressionlessly said, \"The Temple called for an immediate cessation of hostilities!\"</p><br/><p>\"What’s the reason?\" Rody frowned.</p><br/><p>\"Don’t know!\" Sith’s facial muscles seemed to tremble the moment he said that. He then sighed and continued, \"At that time, nobody knew the reason. However, later...later, after a long time and going through a variety of channels, we managed to receive a bit of news...The dwarfs seemed to have something important and the Temple seemed to be very fearful of that thing. At that time, the dwarfs issued a warning. If they were defeated, they would find a way to put that thing...\"</p><br/><p>\"Destroy?\" Rody laughed bitterly.</p><br/><p>\"I really don’t know this one.\" Sith sighed. \"We did not know what the Temple was afraid of. Was the Temple afraid that the dwarfs would destroy that thing or would take it out to use? Anyway, nobody knew the answer to this. That was a really big secret of the Temple. We, the survivors of the Shaka Empire, have been trying hard to restore the empire. This is why we tried every possible way to obtain more information. Yet, we could only obtain this much.\" He paused and then slowly said, \"However, there is one thing that is definitely unmistakable! That is, the Temple is extremely terrified of that thing!\"</p><br/><p>\"I understand now. You attack the dwarfs, not because you want to subjugate them but because you want to obtain that thing!\" Rody looked with a little ridicule.</p><br/><p>\"Yes!\" Sith sighed. \"So we need you for this matter. Once our army disembarks, we will attack all the way. When we reach a crucial moment, it would be inevitable for the dwarfs to have a life and death struggle. This is why we request you, Earl Rody, or rather the Duke of the Tulip Family, a Domain Master to help…\"</p><br/><p>This time, Rody did not wait for Sith to finish speaking. He stood up and waved his hand as he said, \"Enough!\"</p><br/><p>He mockingly looked at Sith and said, \"So one of the reasons of this fleet is to attract the dwarfs’ navy and allow the main offensive force to disembark safely...The other reason is to send me here because you believe that even if we were to encounter the dwarf's fleet, we will be able to safely disembark with my strength. After that, I would help you obtain that thing by sneaking in. After all, a single person entering is much easier and more secretive than sending an entire army in. Am I right?\"</p><br/><p>Sith nodded his head.</p><br/><p>\"In other words, these hundreds of warships are, firstly, to act as bait and secondly, to send me here...You are really very magnanimous!\"</p><br/><p>\"For the end result, it is acceptable to pay a price.\" Sith sighed. \"My task is to sneak into the dwarf's territory with you. Under my guidance…\"</p><br/><p>Rody lightly said, \"There is no need to say anymore!\"</p><br/><p>\"What?\" Sith became slightly angry.</p><br/><p>\"I said, you do not have to say anymore!\" Rody’s had a cold expression. \"No matter what you ask of me, I can clearly tell you... \" Rody stared at Sith’s eyes and slowly said, \"I refuse!\"</p><br/><p>\"You…\" Sith frowned. \"Are you still angry about this matter? I believe you can understand…\"</p><br/><p>\"Yes, I can understand.\" Rody calmly replied. \"I can understand this diversion plan as a commander of an army. However, I can understand that this does not necessarily mean that I can calmly accept being deceived by you all.\"</p><br/><p>Rody looked at the speechless Sith and coldly said, \"I only do things based on my own beliefs. If you had told me this earlier, perhaps I would have agreed to help you. But the way you did it…\" Rody suddenly smiled. Even a blind could see that his smile did not have the slightest feeling of pleasure. \"...makes me really angry!\"</p><br/><p>He turned around and walked towards the door. At the door, he suddenly and coldly said, \"Tell His Majesty that those who have deceived me have paid the price! However, as we currently are allies, I will not immediately cause him trouble! However, it is better not to use these similar methods on me again!\"</p><br/><p>Leaving the stunned Sith behind, Rody went to the deck above and saw the soldiers respectfully salute him. Rody sighed in his heart. These poor guys still did not know that the King had sold them out!</p><br/><p>That night, the strong sea breeze blew across Rody’s face. Rody exhaled deeply, throwing out all the depression in his heart. He then gently shook his head as if he was trying to shake the confusion out of his head.</p><br/><p>'What should I do next?'</p><br/><p>Rody looked at the tranquil surface of the distant sea. He could faintly see the land at a distance. That must be the island country of the dwarfs.</p><br/><p>Rody then pondered.</p><br/><p>If this fleet is a bait, then the dwarf's fleet must be in the vicinity. They will soon attack and swallow the bait!</p><br/><p>When will the fighting start?</p><br/><p>Rody looked up at the sky. It should probably be before dawn.</p><br/><p>If Rody were the commander, he would choose to attack at night.</p><br/><p>Rody was not worried about himself. With his strength, he wouldn’t get injured even in the boundless sea...The moment he thought about this, he suddenly smiled wryly...There is still a problem in the cabin!</p><br/><p>He subconsciously walked towards his own cabin. When he reached the door, he suddenly remembered that Nedis was still bathing.</p><br/><p>Rody smiled helplessly as he suddenly felt less disgusted with the problematic woman. At the very least, she was more likable than King Sauron.</p><br/><p>As he thought of these complicated things, he suddenly heard a sailor at the observatory platform above shout out, \"There is something going on!\"</p><br/><p>There were two sailors at the observatory platform. One of them nervously looked at a distance. The other one slipped down the mast and strode towards the cabin. Rody pulled him and asked, \"What happened?\"</p><br/><p>\"There is a fleet approaching! They are dwarf warships!\" The sailor nervously gasped for breath. He then broke away from Rody’s grip and ran in.</p><br/><p>\"They are coming!\" Rody raised his eyebrow. He had already gotten up from the deck and jumped onto the observatory platform. He glared at the panic-stricken sailor and lightly asked, \"Where?\"</p><br/><p>\"There!\" The sailor forcefully calmed himself and then pointed towards a direction.</p><br/><p>Rody concentrated in that direction. His eyesight was better than ordinary people. He faintly saw the shadow of a sail approaching on the right side of their fleet. It was extremely fast.</p><br/><p>At that moment, there were voices on the deck below Rody. The sailors and the soldiers had received the news and begun to assemble.</p><br/><p>After the horn was sounded, the sailor on the observatory platform immediately took out a small torch. He gently shook it and the torch immediately gave out a dazzling light.</p><br/><p>That small torch was so dazzling that Rody was surprised.</p><br/><p>The strength of the Royal Navy of Sauron Kingdom was truly extraordinary. As soon as the torch on the flagship was lit, the other surrounding ships immediately responded similarly by lighting up torches. Within a short while, countless spots of light twinkled on the surface of the sea. Even the stars in the sky seemed to dim.</p><br/><p>Based on some understanding of the navy of the Sauron Kingdom, Rody knew that the torch was meant to alert the whole fleet.</p><br/><p>It could not be said that the Royal Navy of the Sauron Kingdom had not reacted fast enough. However, nevertheless, they had fallen behind.</p><br/><p>That was because those on that fleet did not know that they would be fighting against the dwarfs. They only acted according to normal practice and became alert when they saw a large fleet approaching.</p><br/><p>However, the dwarfs were already, aggressively, prepared for combat.</p><br/><p>The dwarfs launched the first attack.</p><br/><p>As it was dark and too far away, Rody could not see what the dwarfs' attack was like. In fact, the unluckiest ones were the vessels on the periphery of the fleet of Sauron Kingdom.</p><br/><p>They could only hear a faint thunderous roar. One of the smaller warships of the Sauron Kingdom in the distance suddenly burst into flames. Fire arrows then flew over like locusts.</p><br/><p>Within a short few minutes, that warship had already turned into a large ball of fire...burning. Rody did not even understand what kind of attack the dwarf warships had used.</p><br/><p>Fighting had started at the periphery and the tranquility of the sea was broken. Sounds of whistling and explosions continued endlessly. There were also blood-curdling screams from the soldiers and sailors.</p><br/><p>Rody understood clearly that this round, the fleet of Sauron Kingdom would definitely lose the battle.</p><br/><p>Perhaps this was an enlightened bait.</p><br/><p>The Sauron Kingdom fleet was immediately dispersed.</p><br/><p>The dwarfs' five-sail warships were truly powerful. Numerous warships immediately advanced and rushed into the midst of the Sauron Kingdom’s fleet. They launched a concentrated attack as they crossed each other. Although the Sauron Kingdom’s fleet did their best to resist, their surrounding warships, one by one, started to burn.</p><br/><p>The nearest of the dwarfs’ five-sail warships finally came into Rody's view.</p><br/><p>The soldiers on the deck had picked up their weapons and their gunmen had begun firing back. A large number of soldiers shouted, ‘Protect His Majesty!’ as they advanced towards the King’s cabin.</p><br/><p>Rody frowned and suddenly kicked open the door to his cabin as he rushed in.</p><br/><p>The room was steaming. Nedis uttered a scream. Rody faintly saw a white figure quickly squatted down inside a large barrel.</p><br/><p>\"Get…get out!\" Nedis’ voice was shrill and alarmed.</p><br/><p>Rody simply asked, \"You have not finished bathing?\"</p><br/><p>\"You…I told you to get out!\" Nedis was anxious but she did not forget to argue back at Rody. \"Don’t you know that girls bathe slowly?\"</p><br/><p>Rody picked up the military uniform from the shelf and threw it at Nedis. He then coldly said, \"Now you have finished bathing! Quickly, wear your clothes!\" He then turned around.</p><br/><p>Nedis heard the screams outside and realized that something had happened. She quickly put on her clothes.</p><br/><p>There was a thunderous roar as the hull of the ship shook violently. Nedis was caught off-guard. She staggered and crashed towards Rody. Rody frowned and held her.</p><br/><p>Nedis was tense as she asked, \"What is going on outside?\"</p><br/><p>\"Put on your clothes properly first!\" Rody coldly looked at her.</p><br/><p>In her haste, Nedis did not button her clothes at her chest. She was only wearing a shirt. Fortunately, the person who provided the clothes thought that it was for Rody and the clothes given was according to Rody’s size. The large military uniform that Nedis wore had already covered the lower part of her body down to just above her knees. However, half her snow-white chest was exposed at the placket1.</p><br/><p>With a red face, Nedis quickly buttoned up. Suddenly, there was a loud roar from outside. Immediately, the hull of the ship shook violently, once again. Rody could even hear cracking sounds in the ship.</p><br/><p>\"It's too late!\" Rody said, \"Follow me!\"</p><br/><p>Rody quickly pulled a woolen blanket from the side. Not allowing Nedis to resist, Rody wrapped her body with the blanket. He then took her hand and ran out the door of the room.</p><br/><p>There were lots of voices on the deck outside the cabin. Countless archers were desperately shooting arrows. Rody could only hear the whistling sounds of the arrows flying back and forth. Rody hugged Nedis with one hand and deflected the arrows that were occasionally flying towards him with the other.</p><br/><p>Translator's Notes:</p><br/><p>1. The ‘middle’ where you button your shirt.</p><br/>\n</div>"}