{"title": "Chapter 267: Kikukawa Yukinari", "id": 267, "volume": 3, "url": "http://boxnovel.org/masked-knight-chapter-267-kikukawa-yukinari", "volume_title": "Volume 3", "body": "<h1>Chapter 267: Kikukawa Yukinari</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 267: Kikukawa Yukinari</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>\"You all don’t look like you are from the Hakone Kingdom. I am simply dressed elegantly. This is our Hakone Kingdom’s standard clothes for noble male scholars.\" That beautiful man inside the carriage gently smiled. He showed a sly expression and said, \"In Hakone Kingdom, nobody would dare to rob me after seeing my carriage! It is even more impossible for a person not to know my identity after seeing this carriage!</p><br/><p>\"My name is Kikukawa Yukinari. I am the youngest son of the family of the current Kikukawa general.\"</p><br/><p>Sith stopped his actions as he stood near the carriage in shock when he heard this.</p><br/><p>After a long silence, Sith gave a long sigh and patted Rody’s shoulder. \"Looks like our luck is really good…\"</p><br/><p>Rody faintly smiled. Suddenly, he raised his hand and swung at Yukinari’s neck. When Yukinari fainted, Rody turned around and asked, \"Is this person very influential?\"</p><br/><p>Sith did not speak. Nedis was the one who replied, \"His identity is just acceptable. However, his father is really not so simple. It could be said that there are not many dwarfs who have a more influential identity than him.\"</p><br/><p>After that, Nedis and Sith explained the situation in the dwarfs’ kingdom to Rody.</p><br/><p>Although the dwarfs also have an Emperor, their Emperor did not have much power. Respectable the name was, yet it was actually but an empty frame. The real power of the dwarfs’ kingdom belonged to the generals.</p><br/><p>The generals had their own political organization that controlled the country. It was called a ‘shogunate’. Worse of all, the position of general was hereditary. When the father dies, the son would take over.</p><br/><p>\"Why don't they just abolish the position of Emperor? Why are they still keeping it?\" Rody was confused.</p><br/><p>Nedis and Sith looked at each other with a bitter smile. They felt that this was a question difficult to answer. However, Nedis continued, \"Naturally, there is a reason why an Emperor is an Emperor. There is probably a secret behind the existence of the royal family. Even if the Emperor is just an empty name, the generals of the shogunate will not dare to do anything to the Emperor.\"</p><br/><p>Rody thought for a moment and suddenly said, \"Then what should we do about this Yukinari? We need an identity to enter their capital. How about…\"</p><br/><p>Nedis giggled and said, \"This is simple. We might as well dress you up as Yukinari. We then go back to Home River and get a few people to dress up as your warrior escorts. Nobody will dare to block you along the way.</p><br/><p>Rody immediately refused. It was fine if he were to disguise as somebody else but Yukinari looked like a woman. Making Rody dress up like him was something Rody could not do.</p><br/><p>Sith sighed and suddenly said, \"In this case, we will take him along. With us accompanying him, it is unlikely that he will dare to do anything.\"</p><br/><p>Rody nodded. \"This seems feasible...but now there is another problem…I do not understand the dwarf language. If we were to pose as the Kikukawa family’s entourage, I will expose my identity the moment I speak.\"</p><br/><p>Sith smiled and took out a sparkling gem. He gently pinched and broke it, revealing a green colored pearl. \"I had prepared this earlier. Eat this and your problem will be solved.\"</p><br/><p>Rody took over the green pearl as he frowned at Sith.</p><br/><p>Sith explained, \"This is a pill I magically compounded. The main ingredient is cloverleaf. Once you eat it, you will be able to speak the dwarf language.\"</p><br/><p>\"Is it really so miraculous?\" Rody swallowed the pill. It tasted bitter and after swallowing, he felt a violent burning sensation bubbled up his head. It was as if he had a fever...His face felt hot and his ears turned red.</p><br/><p>Sith suddenly smiled. \"Now, there will be some discomfort. However, the discomfort will be over after a while. The effectiveness of this pill can last for ten days. Now, I will speak in the dwarf language. See whether you can understand it.\"</p><br/><p>Sith coughed gently and stepped back. He then said, \"@$^[email protected]@\"</p><br/><p>After listening to this sentence, Rody's expression immediately changed. First, he was shocked. After that, he showed a pained expression. He suddenly grunted softly and ran to the side of the carriage before vomiting violently.</p><br/><p>Sith squinted his eyes and smiled, \"It seems to be effective. He can now understand.\"</p><br/><p>Many years later, there would be a time when Nicole would ask for the meaning of the words that made Rody vomit at the dwarf kingdom. Smiling, Nedis would reply, \"The old sorcerer said that the main ingredient of the pill, cloverleaf, was not expensive. However, the other ingredients were very rare. One of the ingredients used was the tongue cut off of a live dwarf!\"</p><br/><p>And so, Rody’s second robbery finally ended in success.</p><br/><p>In his first robbery, he had robbed the daughter of the Radiant Empire’s most prominent family. In his second robbery, he robbed the son of the dwarf kingdom’s most prominent family.</p><br/><p>\"Are you thinking of going to the capital?\" Kikukawa Yukinari woke up and asked. The three robbers intimidated him after he woke up. That beautiful man seemed a little surprised. \"What is your purpose of going to the capital?\"</p><br/><p>The moment he asked, Yukinari realized that his question was inappropriate and immediately added, \"Right now, there is a war in the south. The security at the capital is more stringent. If you were to go…\"</p><br/><p>The dwarf meant that the public security at the capital was most stringent now. For these few robbers to go to the capital now would be suicidal.</p><br/><p>Nedis coldly replied, \"You do not need to worry about this. You only need to be obedient and cooperate with us.\"</p><br/><p>At a side, Rody had already tied up the group of Yukinari's warriors and threw them into a low-lying place away from the roadside.</p><br/><p>After that, with Sith looking after those people, Rody and Nedis got onto the carriage. They threatened Yukinari to leave for Home River.</p><br/><p>They wanted to buy a few people in the slave market to act as entourages, but they could not find any suitable candidates.</p><br/><p>Home River was the second largest city of the dwarfs' Hakone Kingdom. The slave market in that city was quite large and there were many kinds of slaves...Men and women, young and old. However, after looking around, although there were some physically strong slaves, most of them looked dispirited and shrank with fear. Even if he were to buy them, dress them up and give them warrior swords, they would still not look like warriors.</p><br/><p>Finally, Yukinari could not help but ask, \"If you want to find a few entourage warriors, then why don’t you just go and buy a few vagrant warriors? Home River is my Hakone Kingdom’s second largest city. There are a lot of vagrant warriors here.\"</p><br/><p>Rody frowned. \"If we have money to buy warriors, we would not have robbed you in the first place!\"</p><br/><p>Yukinari’s widely opened his mouth as he stared at Rody, looking surprised. He no longer dared to mock the others as he cautiously said, \"Let us go and take a look first. When the time comes, we will certainly find some people.\"</p><br/><p>In the vicinity of the slave market, there was a side street where the vagrant warriors gathered. There were pubs on both sides of the street. Drunken shouts could be heard from the pubs when the doors were opened. There were also faint noises of chaos. Obviously, someone had caused trouble after drinking.</p><br/><p>It seemed like the dwarfs were naturally irritable and their love for wine was just like what the legend said.</p><br/><p>Rody acted as a driver of the carriage and entered the street. He immediately felt numerous gazes shot over towards him. Their gazes were full of surprise and reverence. However, after taking a glance, they bowed their heads and no longer dared to look. Even the arrogant and obstinate warriors carefully stepped aside and no longer dared to be presumptuous on the street.</p><br/><p>They looked for a pub. Rody and Nedis then moved, one to the left and the other to the right as they supported Yukinari down the middle of the carriage. Rody softly and coldly warned, \"You better be careful not to say anything unnecessary.\"</p><br/><p>Yukinari smiled, \"I dare not. My original warriors were masters, yet you easily defeated them. How would I dare act presumptuously? Ah…lighten your grip. My arm is going to break.\"</p><br/><p>The moment the three of them entered the pub, the noisy room immediately turned silent as everyone immediately looked towards them.</p><br/><p>A person who looked like the shopkeeper frantically ran over. He then threw himself on the ground and he uttered something out loud. Yukinari's face looked calm but his eyes were full of haughtiness.</p><br/><p>When Rody and Nedis did not say anything, Yukinari could not help but whisper to Nedis, \"Speak up. According to custom, I am not supposed to speak to these untouchables, on such occasions.\"</p><br/><p>Immediately, Nedis deliberately and loudly said, \"The Young Master of Kikukawa family is here to recruit a few warriors. Who is willing to come?\"</p><br/><p>There was a moment of silence and then there was an uproar.</p><br/><p>'The Kikukawa family is recruiting?' The vagrant warriors shouted and rushed forward. There were also those that ran into each other and started cursing each other.</p><br/><p>The Kikukawa family was the most prominent family of the dwarfs. Those who were recruited would receive a lifetime of glory and wealth. Those vagrant warriors in dire straits immediately became excited. They all kept their heads high and shouted loudly.</p><br/><p>When the irritable ones saw that they were blocked by others in front of them, they pulled out their katanas as they mutually glared at each other.</p><br/><p>\"Keep quiet!\" Rody shouted, \"Everyone, keep quiet!\"</p><br/><p>A sturdy warrior at the side also roared, \"Everyone, keep quiet! You are all making too much noise! It is rude!\"</p><br/><p>That warrior seemed authoritative at that place. His voice was also loud. Within a short moment, the pub quietened down.</p><br/><p>The warrior sounded pleased with himself as he loudly said, \"The Kikukawa family is obviously looking for the most excellent warrior. What is the point of being so noisy! Whoever considers himself the bravest warrior, then speak with his katana!\"</p><br/><p>He then pulled out his long and thin katana, swung a few times in the air and said, \"Let the best man win.\"</p><br/><p>That person was probably skillful as nobody else said anything after he spoke. He was obviously satisfied with everybody’s reaction. He then turned around and looked at Yukinari and the others. He then said, \"My name is Kazakiri Hideyoshi. Do I have the honor of serving the Kikukawa family?\"</p><br/><p>Rody narrowed his eyes to look at the man. Judging from his appearance, he seemed quite skillful. He nodded and said, \"Well, we only need six people. You count yourself as one and you help us to pick the remaining five.\"</p><br/><p>The moment Rody said those words, the audience immediately started boiling. Some cursed Hideyoshi for being shameless while some angry ones pulled out their weapons. There were even more who began currying favor with Hideyoshi, hoping to be selected.</p><br/><p>Yukinari seemed to be accustomed to that scene. He took a white jade plate from his pocket and threw it on the floor. He then said to Hideyoshi, \"When you are done here, go outside the city and find us.\"</p><br/><p>Hideyoshi respectfully picked up the white jade plate. He wiped it with the corner of his clothes, before carefully putting it away.</p><br/><p>The three of them then left the noisy pub filled with dispute. They saw that Hideyoshi had quite a bit of ability and was sure that he would be able to deal with it.</p><br/><p>Rody smiled. \"Looks like having an influential identity is really useful. If we were to look for people on our own, most probably they would not even look at us.\"</p><br/><p>Yukinari seemed proud as he deliberately said, \"This is not surprising. To be in service of the Kikukawa family is a supreme honor in the Hakone Kingdom. When our family goes out, even the local officials must be courteous to us.</p><br/><p>Nedis gave a faint smile and unintentionally said, \"Do you think it is something to be proud of? This is nothing. They are behaving like this because of your family’s influence. Your family’s influence is not your own.\"</p><br/><p>Those words made Yukinari startled. He looked at Nedis with a complicated gaze as if he had countless thoughts.</p><br/><p>On the way back, Yukinari stopped being haughty and became quiet.</p><br/><p>Hideyoshi was really skillful. Before Rody’s carriage left the city, six warriors had started to catch up from behind. The one leading them was Hideyoshi.</p><br/><p>Rody stopped the carriage. Several people then rushed to the front of the carriage and fell on their knees. After that, they automatically stood up and divided themselves into two groups. They moved in front of the carriage to lead the way.</p><br/><p>They then joined up with the old sorcerer outside of the city. Yukinari’s original warriors had already been thrown into an unknown place by the old sorcerer. Rody gave the horses that belonged to those warriors to the new warriors. He then gave the horsewhip to Hideyoshi for him to drive the carriage. Hideyoshi felt angry as it was outrageous for a warrior to drive the carriage. However, when he saw that Yukinari did not say anything, he quietly picked up the whip.</p><br/><p>Rody smiled coldly and exerted a little bit of force to pinch the horsewhip. His fingerprints could clearly be seen on the whipstock of the golden horsewhip where he had pinched. When Hideyoshi looked at the horsewhip in his hand, he immediately turned pale. He opened his mouth wide as he looked at Rody but remained speechless. Hideyoshi naturally did not have such shocking abilities. He then saw Rody enter the carriage that belonged to the Kikukawa family and became unsure of Rody’s identity.</p><br/><p>That woman could be assumed as Yukinari’s woman. Yukinari seemed respectful of that old man and he could be assumed as his teacher. However, he could not figure out that young man's identity. Rody had such ability that Hideyoshi did not have and also had never seen before. After all sorts of speculation, he guessed that Rody must be a bigshot of the Kikukawa family.</p><br/><p>Yukinari was not a person who did not care about the life and death of his subordinates. When Rody got onto the carriage, he immediately whispered, \"What have you done to my men...\"</p><br/><p>Sith lightly replied, \"Do not worry. They did not die. However, they will not wake up for the next few days. I have put them somewhere in the wilderness and they will wake up in three days' time. I think there are no wolves nearby and I suppose there is nothing life threatening there.\"</p><br/><p>They did not expect Yukinari to suddenly become stern and grunt, \"They were responsible for protecting me. Now it is considered a dereliction of duty. Even if they survived, when they return, I will order them to commit seppuku1.\"</p><br/><p>His tone was cold as if he felt some bitterness.</p><br/><p>Nedis smiled. She knew that Yukinari was helpless and forced to cooperate with them. That was because he was held under duress. With his identity and status, he felt angry. She smiled and said, \"This is simple. We can go and kill them now. It is not a difficult thing to do.\"</p><br/><p>Rody leaned back and looked at Yukinari. He said, \"You are lucky. I am in a good mood today and do not want to kill.\"</p><br/><p>Rody’s words sounded like an understatement but Yukinari felt a chill when he heard those words. Rody’s words contained a murderous aura that could not be hidden. It was an aura that only those who had been covered in blood would have.</p><br/><p>Yukinari’s expression changed as if he was struggling with his doubts. He suddenly became determined and sat up straight. He rolled up his sleeves and put both his hands at his chest. He fixed his gaze on Rody and said, \"Your Excellency, may I have a serious conversation with you?\"</p><br/><p>Translator's Notes:</p><br/><p> 1. Cutting off one’s own stomach, done to protect/restore honor.</p><br/>\n</div>"}