{"title": "Chapter 260: Departure", "id": 260, "volume": 3, "url": "http://boxnovel.org/masked-knight-chapter-260-departure", "volume_title": "Volume 3", "body": "<h1>Chapter 260: Departure</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 260: Departure</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>The sky was clear.</p><br/><p>At a desolate harbor that was less than a hundred miles away from the capital city of Sauron Kingdom.</p><br/><p>The banks of the inland sea of the Roland Continent were shaped like an inverted crescent forming a natural pier. In fact, that was the main naval base for the Royal Navy of Sauron Kingdom.</p><br/><p>Fourteen huge premier Roland warships were lined up at the docks. At the moment, the pier was full of large and small warships. Those warships had already undergone a simple refurbishing. All its weapons had been disassembled. Its flags and banners had been exchanged for the Sauron Kingdom’s banners on one side and banners with a thorny golden flower on the other—those were, the banners of the Radiant Empire.</p><br/><p>A total of a hundred ships had already lined up awaiting orders.</p><br/><p>After a few days of waiting at the Sauron Kingdom’s capital city, the first batch of ships from the various kingdoms on the Roland continent had been mobilized. According to the agreement, the first batch of one hundred warships would depart from the port and sail to the Radiant Continent on that day.</p><br/><p>The King and Rody were standing, side by side, on a simple and high platform built on the pier. They were smiling and looking at the fleet at the pier below. Rody sighed. The navy of the Roland Continent was really powerful, especially the fourteen largest premier warships. Those warships were so large that they could accommodate more than two thousand soldiers each. The Radiant Empire did not even have one such special warship, but these kingdoms could easily give away fourteen!</p><br/><p>King Sauron had dispatched a special envoy with a copy of the signed peace agreement to the Radiant Empire. In accordance with the agreement, the first batch of released war prisoners would be shipped back when the first batch of warships arrived in the Radiant Empire.</p><br/><p>He was not worried that the Radiant Empire would take the warships and not release the prisoners. After all, the Duke of the Tulip Family and Miss Nicole were still on the Roland Continent. The two of them were worth more than a hundred warships. According to the conditions stated, Rody would remain on the Roland Continent until the transaction was complete. That was also a form of disguised collateral.</p><br/><p>After the roar of gun salutes, a signalman standing at the tower at the pier vigorously waved the colored flags in his hands. The largest warship in the fleet then hanged up the flagship’s banner. After that, the signalmen at the watchtower waved their flags. The fleet then started to line up and depart from the port majestically.</p><br/><p>The sun shone brilliantly illuminating the surface of the sea. The ripples glowed like golden scales. Feeling proud of himself, the King smiled and asked, \"Earl Rody, what do you think of the fleet in front of you?\"</p><br/><p>Rody gave a simple reply. \"Very good! This fleet is invincible in the ocean!\"</p><br/><p>Suddenly a person groaned coldly from a side. His voice seemed somewhat dissatisfied. That person was the Crown Prince, Aven. As the Commander of the Navy, he was naturally unwilling to see the sturdy warships being sent to the enemy.</p><br/><p>The King was not concerned about Aven’s mood. He smiled and said, \"Aven, it is getting late. You should also board the ship.\"</p><br/><p>As that was the first batch of warships and it concerned the good faith of the two nations, the Sauron Kingdom needed to dispatch an important person with high enough status to show their sincerity. Therefore, the Crown Prince, Aven, was selected to be dispatched to the Radiant Empire.</p><br/><p>Although Aven was from the pro-war faction, the King had made great efforts to persuade him to agree to this request. When Aven saw his men got onto the flagship at the shore, he finally sighed. He then faced the King and Rody as he saluted and said, \"Your Majesty, I am leaving.\"</p><br/><p>After that, the proud young man walked away in large strides without sparing a glance at Rody.</p><br/><p>The King looked at the Crown Prince’s back and suddenly sighed. \"Youngsters are too rash. This is not a good thing.\" The King then deliberately or otherwise looked at Rody.</p><br/><p>Rody kept quiet and remained silent. 'This is your family matter. Why are you telling me this?'</p><br/><p>Now that there were no other people around them and the guards were standing at a distance, the King suddenly lowered his voice and asked. \"Rody, are these warships good?\"</p><br/><p>Rody was startled and then replied, \"Of course, it is good! It is much better compared to the warships from our Radiant Empire.\"</p><br/><p>The King suddenly sighed and softly said, \"Yes, the other kingdoms unexpectedly abided to the rules. They did not send us trash to fool us. After all, with hundreds and thousands of prisoners in your hands, they do not dare substitute with shoddy goods. But…\" He suddenly pointed on the largest flagship, that Aven was on, and said, \"Do you see that ship? That is our Roland Continent’s first-class warship! It is made from ironwood and is incomparably sturdy. The warship is 100 meters long and can accommodate three thousand people! There are less than one hundred of such warships in the entire Roland Continent.\"</p><br/><p>\"Oh?\" Rody’s eyes turned bright. 'Less than one hundred? That means giving away fourteen is an excessive amount.'</p><br/><p>The King smiled and said, \"Although the coalition armies of Roland Continent are known to be invincible at sea, only we know that the real overlord of the sea is not us who live on the mainland but the navy of the dwarf kingdom.\"</p><br/><p>After pausing for a moment, the King sternly said, \"Although the dwarfs have a small population and could not have a large army, they have an abundance of ironwood in their territory. This natural advantage allows them to build a navy more formidable than ours.\"</p><br/><p>The King took out a thin roll of paper and then slowly spread it out in front of Rody.</p><br/><p>\"Look, this is the main warship of the dwarfs’ navy! Although the size of the warships is different, it is made in accordance to design of this model...The bow of the warship is tall and sharp, making it more advantageous in braving the waves. It has three masts with a total of five sails. It is known as a five-sail warship. The mast uses a special method to rotate itself with abnormal flexibility giving it the warship fanatic speeds.\"</p><br/><p>The King gently pointed at the picture of the warship on that piece of paper and continued, \"The hull of the ship is very high. The largest five-sail warship is four storeys high with railings and arrowslits.</p><br/><p>\"Arrowslits?\" Rody froze for a moment. \"Is using bows and arrows useful in naval battles?\"</p><br/><p>The King laughed. \"Have you forgotten that the dwarfs have an abundance of ironwood?\" He smiled helplessly and said, \"Even though the Roland Continent also has ironwood, we do not have the luxury of using ironwood to make arrows! However, these damn dwarfs even use ironwood to make arrows! The speed of these arrows is extremely fast, and it could fly fifty percent further compared to ordinary bows and arrows. In a naval battle, we would already have a headache before the ships even got close. Its range is even farther compared to a sorcerer’s spell attack. If the two parties were to go into battle, our sorcerers would not be able to fly up and attack within the range of their bows and arrows.\"</p><br/><p>\"Besides that, the dwarfs are born as good artisans and they are good at making fine weapons. When they are still far away, they will use their bows and arrows to fight with us. When both parties get closer, they will use another weapon to fight.\"</p><br/><p>The King’s eyes flashed as he pointed at the drawing. There were thin tubes stretching out on both sides of the hull of the ship. He then said, \"This is a kind of nozzle. Once the enemy ship is within a certain distance, black oil will be sprayed from the nozzle. Once the enemy ship is covered in that oil, their archers will launch fire arrows. Just a drop of the oil is enough to ignite. The more water is poured onto this oil, the stronger the fire will be. Although the Roland warships are made of ironwood and are more resistant to fire than other ships, ironwood is still wood.\"</p><br/><p>Rody was lost in thought as the King continued, \"According to the information I received, the dwarfs have a total of two hundred and fifty warships. One of their largest five-sail warships can accommodate one thousand five hundred people. Its combat effectiveness is definitely not lower than our Roland Continent’s first-class warship. Besides that…\" The King showed a helpless smile and said, \"… more than half of our fleet are of this kind of large ships. The other smaller ships are just used for patrolling and scouting.\"</p><br/><p>Rody closed his eyes and muttered, \"In other words, we lose out in speed. We also do not have an advantage in long distance and also close distance battles. Your Majesty, you certainly have given me a difficult problem.\"</p><br/><p>The King smiled as he rolled up the drawing in his hands. He then gave the drawing to Rody and smiled as he said, \"Naturally, we do not intend to fight directly with their navy. The price of doing that is too big and it will be disastrous even if we win.\"</p><br/><p>After saying that, the King took out another thin roll of paper from his sleeve like a magic trick. When spread out, it was the map of the sea.</p><br/><p>\"We plan to attack in half a month's time! We will move normally as if we are delivering the last batch of warships in exchange for the prisoners of war!\" He then pointed to the map and slowly said, \"Look here, this is their island. Our fleet will pass by their left, all the way south, out of the sea and continue south towards the Radiant Empire. These dwarfs are not very courageous. They are also afraid of being attacked by us. This is why when the earlier fleets pass by, they will dispatch their navy to patrol the left side of their island! What we need to do is to take full advantage of this.\" The King smiled and continued, \"You will take the last batch of fleets which is a total of two hundred and fifty warships. I will also gather the best of Sauron Kingdom’s navy to follow you. After leaving the port and traveling for a day, the ships will suddenly turn to the north!\"</p><br/><p>\"North!\" Rody’s eyes lit up. He meaningfully looked at the King.</p><br/><p>The King smiled and said, \"Looks like you also understand. Our fleet would turn to the North. After five days, we would be able to reach the back of their island. After that…\" The King suddenly waved his hand and clenched his fist resolutely said, \"We will disembark and attack!\"</p><br/><p>Rody thought for a moment and then said, \"This plan sounds pretty good, but I do not understand matters related to the sea. Your Majesty is telling me this…\"</p><br/><p>The King smiled and replied, \"My naval commanders will naturally be responsible for matters at the sea. However, the responsibility falls on you once we disembark! I know that your distinguished country is invincible on land. I hope you do not mind assisting me.\" He then smiled and said, \"I will give you the intelligence describing the distribution of the dwarf army on the island in two days.\"</p><br/><p>Rody sighed. \"It is most important to keep such a big plan a secret. After all, I am just an outsider. Your Majesty still needs to carry out these plans.\"</p><br/><p>The King smiled and said, \"Of course, only four people know of this right now. Even the soldiers who are setting off in half a month's time do not know where we will go. I will issue a declaration of war at sea. Until that time, this information absolutely would stay a secret.\"</p><br/><p>At that moment, the fleet had gradually left the pier. The last one to leave was the flagship.</p><br/><p>Aven stood on the bow deck of the flagship. His eyes were closed as he enjoyed the sunlight and the sea breeze. He made great efforts to calm himself.</p><br/><p>Hmph, the purpose of His Majesty dispatching me to the Radiant Empire was to get me out of his way. Otherwise, I might affect the peace treaty. Sigh…</p><br/><p>Aven shook his head and the image of that exceedingly beautiful woman appeared in his mind. He smiled bitterly. \"Forget it, she likes women just like Her Highness. Why must I keep thinking about it?\" He then opened his eyes and struggled to breathe as he called one of his trusted subordinates. He then softly asked, \"Where are those things that we brought onto the ship?\"</p><br/><p>\"They are all in the cabin.\"</p><br/><p>\"Good.\" Aven sighed in relief. As requested by Nedis, Aven secretly made use of his position to help Nedis move her property to the Radiant Empire. At that moment, all the goods had long been sneaked onto the flagship’s cabin before the journey.</p><br/><p>That could be regarded as smuggling. However, Aven would not think so. He was simply using his position to help a friend.</p><br/><p>\"Alright. Now that the ship has departed, invite my friends out of the cabin. I presume they are already very uncomfortable hiding there for such a long time.\" Aven smiled lightly.</p><br/><p>That subordinate immediately accepted the order and went in. After a while, with a tense expression, that subordinate came out with a middle-aged man.</p><br/><p>The middle-aged man wore simple clothes. He respectfully bowed the moment he saw the Crown Prince and greeted, \"Your Highness.\"</p><br/><p>Aven frowned and asked, \"Who are you? Where is Miss Nedis?\"</p><br/><p>With an even more respectful expression, the middle-aged man smiled apologetically and said, \"Our master is not on board. She asked me to convey a message to Your Highness. She said that she still has some unfinished private matters to take care of in the capital and would not board the ship back. Anyway, I will be responsible for dealing with the people collecting the merchandise at the Radiant Continent. Master also said that Your Highness is hospitable and keeps his promises. She said that you would definitely not disappoint your friends.\"</p><br/><p>Aven was shocked and became a little unhappy. \"She did not board the ship? Hmph, this woman actually dared to trick me.\" He then smiled and said, \"Alright. Since I have already promised Miss Nedis, I would definitely help until the end...Ah, what other matters does your master still have in the capital?\"</p><br/><p>The middle-aged man smiled and replied, \"I am not too sure but apparently someone has promised to meet the master. That person made the master wait for an entire night, so the master intends to go and find this person to understand what actually happened.\"</p><br/>\n</div>"}