{"title": "Chapter 275: Treasure Hunters (2)", "id": 275, "volume": 3, "url": "http://boxnovel.org/masked-knight-chapter-275-treasure-hunters-2", "volume_title": "Volume 3", "body": "<h1>Chapter 275: Treasure Hunters (2)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 275: Treasure Hunters (2)</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>\"Strange…\" Sith felt something strange and smiled wryly. \"According to this gem, there is magic fluctuating from all over. The strong and weak fluctuation is mixing.\"</p><br/><p>Rody then said, \"Let us go in first before bothering with all that!\"</p><br/><p>After distinguishing the circumstances, the three of them walked towards the foot of the mountain from the shore. The strange thing was that the journey was smooth and nobody appeared to stop them. It was as if the ninjas at the lake were the only guards.</p><br/><p>The rumored forbidden area was not difficult to find.</p><br/><p>The trees separated on both sides, forming a passage in the middle. The passage went all the way until the cave at the foot of the mountain.</p><br/><p>\"Why are there no guards?\" Nedis frowned.</p><br/><p>The night was so quiet that they could hear their own heartbeats.</p><br/><p>\"This is the place!\" Sith was extremely excited. He held the Magic Appraisal gem and excitedly exclaimed. \"The magic is fluctuating here the most!\"</p><br/><p>The magic gem in his hands become more and more dazzling. The red light from the gem suddenly burst out. Gradually, the strong light made the others unable to look at it directly. The three could not help but look away from the cross.</p><br/><p>\"Let’s go in!\" Nedis exclaimed and took a large step forward. Rody then pulled her hand and laughed, \"Don’t you find it strange?\"</p><br/><p>\"Strange?\" Nedis was stunned for a moment.</p><br/><p>Rody replied, \"This is probably the Royal Family’s forbidden area. How could such a secret and important place have no guards? Do you think they only relied on the ninjas to stop everyone from entering? If it was so simple…\"</p><br/><p>Rody suddenly went to the side of the road and held a thick tree. Using brute force, he managed to uproot the tree.</p><br/><p>He carried the tree as easily as he carried a chopstick. He then signaled Nedis and Sith to step back. Rody lightly spat and then threw the tree into the cave.</p><br/><p>There was a sudden change.</p><br/><p>The entrance of the dark cave seemed to twist. As if a vegetable was being blended, a frightening rustling sound continued endlessly. The tree was crushed by an invincible force at the entrance, leaving only debris.</p><br/><p>Nedis turned pale. The tree that Rody threw was the ironwood that belonged to the dwarves. Yet, it was instantly crushed. If she had really rushed in front earlier, the same would have happened to her.</p><br/><p>Nedis became more frightened the more she thought about it and shuddered.</p><br/><p>Rody did not seem surprised and sighed. \"I knew it was not that simple.\"</p><br/><p>He patted and comforted the frightened Nedis and then said, \"That thing that the dwarves hid here is a thorn to the Temple. The Temple had so many masters in the past few hundred years and even Paladins. How could they stop the Paladins just based on those ninjas earlier.\"</p><br/><p>Sith sighed and said, \"If we can’t even get past this, there is nothing left to discuss! Let us try it!\"</p><br/><p>He then started to cast a spell. Black fireballs appeared and revolved around him, suspended in mid-air. The air faintly fluttered. Sith finally opened his eyes and shouted, \"Go!\"</p><br/><p>A dozen black fireballs shot towards the entrance of the cave. However, the fireballs simply exploded and disappeared before it reached the entrance. It was as if a strange unseen force caused the fireballs to explode and scatter as sparks.</p><br/><p>\"If fire does not work, how about water?\" Sith waved his hands to summon water.</p><br/><p>As they were near a lake, there was an abundance of water elements. The sorcerer lifted his hand a little and waterballs of different sizes came out from the lake.</p><br/><p>The dozen waterballs floated in the air and coalesced. It squirmed as if it had a life of its own and finally transformed into a white dragon.</p><br/><p>The water dragon was lifelike. It roared earthshakingly loud into the sky a few times, and shot towards the entrance.</p><br/><p>Rody was watching at the side when he suddenly thought of something and shouted, \"Not good!\"</p><br/><p>Without having any time to explain, he grabbed Nedis and moved to her front. He then shielded her with his large body.</p><br/><p>There was a loud roar along with a sound similar to beans being fried. The water dragon disintegrated the moment it got near the entrance. It transformed into a storm that shot back towards the three people.</p><br/><p>The water that was reflected was extremely fast. The water droplets cut through the air like arrows.</p><br/><p>Sith had already begun setting up a protective enhancement. The water droplets struck his protective enhancement with loud and crisp sounds, causing the enhancement to tremble.</p><br/><p>The trees on both sides of the road were also damaged. Countless leaves and branches were pierced by the powerful water droplets. Even the tree trunks were pierced by the water droplets. It went to show how powerful the water was.</p><br/><p>Rody held Nedis to his chest and felt as though his back was slashed by hundreds and thousands of warriors. Fortunately, his body was strengthened by the Mystic Dragon’s blood. Otherwise, the powerful attack would have torn his body apart.</p><br/><p>After that was over, the expression of the three changed. Rody let go of the frightened Nedis. Nedis lifelessly looked at the surrounding trees. She was speechless.</p><br/><p>Rody took off his shirt and saw that the back of his shirt had hundreds of small holes. It was already extremely tattered.</p><br/><p>He laughed bitterly and looked at Sith as he said, \"You better not try any other spells. It does not seem to be effective. I guess that there is a Sorcery array here that stops people from entering. It would be useless no matter what spell you use.\"</p><br/><p>Sith looked bitter as Rody’s eyes suddenly gave a swift and sharp gaze. He then said, \"Let me try.\" He paused for a moment and added, \"It is best for the rest of you to stand further away.\"</p><br/><p>This time, Nedis did not bother arguing with him. She and Sith retreated a few dozen steps away. Rody frowned and shouted, \"Go further!\"</p><br/><p>Rody saw Nedis and Sith retreat back to the lake. He then took a deep breath.</p><br/><p>Although he could feel a burning pain in his stomach when he used his energy, Rody could only grit his teeth and endure it.</p><br/><p>He slowly opened and expanded his domain. His aura spread out and wrapped the space around him.</p><br/><p>Rody’s eyes flashed with a golden light. He slowly exhaled and said, \"Appear.\"</p><br/><p>Everything within Rody’s domain, such as the trees, flowers and stones, started to become transparent.</p><br/><p>They turned into an illusory image as if they had never existed.</p><br/><p>It was seemingly made by all the energies in the world. Rody looked into the cave and saw that the entrance of the cave looked different.</p><br/><p>There were dark rotating discs at the entrance of the cave like cyclones. It blocked the entire cave behind it.</p><br/><p>The rotating discs was not joined together. It rotates quickly at different directions.</p><br/><p>Some of it spinned clockwise while others spinned counter-clockwise.</p><br/><p>The discs rotated quickly like gears. The ironwood Rody threw had been crushed from the friction caused by the principles of these force.</p><br/><p>On the other hand, Sith’s water dragon was created from condensing the water. As water did not have a fixed shape, it was broken apart before it was reflected.</p><br/><p>Nedis and Sith looked at the wonders in front of them with surprise. They had opened their eyes so wide that their eyes could fall out.</p><br/><p>Rody lowered his head and thought for a moment. He then had an idea.</p><br/><p>He waved his hand and fighting energy emerged from his palms.</p><br/><p>The golden fighting energy condensed into a large disc. It was larger than the other discs. However, the disc created by the fighting energy also glowed with a golden light like a smooth reflection. It was as if it was a mirror.</p><br/><p>With two hands, Rody moved the huge disc towards the entrance of the cave.</p><br/><p>As he continued to step forward, he could feel the air in front resisting. It was as if he was walking into an invisible wall. A lot of strength was needed for each step. Gradually, his footsteps became slow and made a chattering sound when it stepped onto the ground. That was how strong the resistance Rody felt as he walked.</p><br/><p>The disc continued to spin and there was a cyclone in front of him. Rody suddenly exhaled his breath. To Nedis and Sith, it was as if the entire place instantly shined. They could then hear Rody shout, \"Stop!\"</p><br/><p>Sith’s eyes lit.</p><br/><p>This was a power to stop space! Only a person with strong domain powers could do this!</p><br/><p>Inside Rody’s domain, the wind stopped. The branches no longer moved. The clothes no longer fluttered and the tree leaves no longer swayed.</p><br/><p>It was as if he was the only person left in that space. Everything else became motionless.</p><br/><p>The only exception was the rotating cyclone.</p><br/><p>However, the cyclone seemed to have slowed down. Earlier, it had rotated so quickly that a person could not feel anything. However, it had slowed down and now, a faint humming could be heard from the friction in the air.</p><br/><p>Rody looked at the slow cyclone and did not dare to hesitate. Although he had strong domain power and could stop space, he was not able to maintain it forever.</p><br/><p>Rody then covered the cyclone with the disc in his hand.</p><br/><p>There was a loud screeching sound.</p><br/><p>It was similar to the ear grating sound of a person scratching the bottom of a plate with a knife during mealtime.</p><br/><p>However, this sound was ten times louder and a hundred times even more ear grating.</p><br/><p>Even though Nedis and Sith stood far away, they were not able to endure it. They screamed painfully and covered their ears. Their bodies were curle up like shrimps.</p><br/><p>Sith’s expression changed. He bit his lips and stopped covering his ears for a moment. In that moment, he suddenly crushed the gem on the cross at his chest. A milky white and pure light covered Nedis and Sith, making the two of them feel much better.</p><br/><p>If there was someone else present, that person would have been surprised. The leader of the Sorcerers was forced to use the most powerful Guardian Boundary.</p><br/><p>Naturally, Sith’s actions were sensible.</p><br/><p>The harsh sound became even more terrifying and eventually took shape as a sound wave. Only Rody was able to withstand the sound wave. The branches and leaves broke apart and even the rocks started to crack from the sound wave.</p><br/><p>Rody felt that the disc he was holding was unable to endure much longer. A faint creaking sound could be heard. It rotates powerfully as though it wanted to place pressure on the cyclone. Rody growled. The flames from his fighting energy suddenly rose, making him shine like the sun.</p><br/><p>The rotating cyclone and the disc caused friction, making the disc even more fiery. Red flames started to appear at the edge of the disc. Even the air could not withstand the violent friction and started to burn.</p><br/><p>Rody's eyes flashed, and then he roared! He suddenly grew to several times his normal size. The shape shifting sorcery spell that he had used to disguise himself broke down. His body then reassumed his real physique. His muscular arms held on desperately to the faintly screeching light disc </p><br/><p>If there was a top spinning extremely quickly on the ground, it could easily be stopped by gently pressing the head of the top with a finger.</p><br/><p>However, the thing that was spinning quickly was not a top but a disc. More than ten times the strength is needed if a person wants to stop it.</p><br/><p>Besdies that, the cyclone could easily mince ironwood. It was much more powerful than a millstone.</p><br/><p>That was why Rody still needed to use all his strength despite having strong domain powers.</p><br/><p>Dust gradually built up to his heel. He stood there and persisted, moving forward one step at a time.</p><br/><p>After that, there was a loud sound.</p><br/><p>The whole mountain trembled. Rody felt as though the incomparably powerful force in front of him disappeared. His hands loosened as he staggered forward a little. The cyclones had vanished.</p><br/><p>There was another cracking sound. The disc made out of Rody’s fighting energy could no longer endure it and broke into fragments like glass. It disintegrated and dispersed like golden stars.</p><br/><p>Rody was already sweating and his face was soaked. The hair on his forehead stuck to his face and he looked as though he was just fished out of the water. He looked extremely tired and was more exhausted then when he fought against ten Paladins.</p><br/><p>Nedis and Sith were tensed. The sharp and harsh sound earlier had almost pierced their eardrums. Despite the fact that they covered their ears, the noise seemed to penetrate everything and drilled its way into their ears. If it was not because Sith had desperately used a Guardian Boundary, it was possible that even their bodies could have been torn apart by the sound.</p><br/><p>Nedis quickly ran over to support Rody. She then asked, \"How are you?\"</p><br/><p>Rody sighed and released himself from Nedis’ arms as he replied, \"I am fine.\" Rody then showed a rare lifeless smile. \"However, it feels like I have aggravated my earlier injuries.\"</p><br/><p>Sith seemed to have recovered from the shock and gave a long sigh. \"I finally understand how these dwarves keep this thing safe for hundreds of years! This sorcery array was something that could not have been broken by people. Without a strong domain power, the Temple would also not be able to do anything even if they had dispatched ten Paladins.\"</p><br/><p>Sith gave an uneasy expression and added, \"I have dabbled in sorcery for many years. Despite that, I have never even heard of such a powerful and terrifying sorcery array before.\" He then paused and gave a wry smile. \"This is not something that could be made by mankind! Only the Gods and Devils in the God and Devil war could have created such a terrifying sorcery array.\"</p><br/><p>\"I just hope there is nothing else like this inside!\" Rody laughed bitterly. \"Let us go in!\"</p><br/><p>Rody walked ahead and took his first step into the dark cave.</p><br/><p>\"Strange…\" Sith felt something strange and he smiled wryly.\" According to this gem, there is magic fluctuating from all over. The strong and weak fluctuation is mixing.\"</p><br/><p>Rody then said, \"Let us go in first before bothering with all that!\"</p><br/><p>After distinguishing the circumstances, the three of them walked towards the foot of the mountain from the shore. The strange thing was that the journey was smooth and nobody appeared to stop them. It was as if the ninjas at the lake were the only guards.</p><br/><p>The rumored forbidden area was not difficult to find.</p><br/><p>The trees separated on both sides, forming a passage in the middle. The passage went all the way to the cave at the foot of the mountain.</p><br/><p>\"Why are there no guards?\" Nedis frowned.</p><br/><p>The night was so quiet that they could hear their own heartbeats.</p><br/><p>\"This is the place!\" Sith was extremely excited. He held the Magic Appraisal gem and excitedly exclaimed. \"The magic is fluctuating here the most!\"</p><br/><p>The magic gem in his hands become more and more dazzling. The red light from the gem suddenly burst out. Gradually, the strong light made the others unable to look at it directly. The three could not help but look away from the cross.</p><br/><p>\"Let’s go in!\" Nedis exclaimed and took a large step forward. Rody then pulled her hand and laughed, \"Don’t you find it strange?\"</p><br/><p>\"Strange?\" Nedis was stunned for a moment.</p><br/><p>Rody replied, \"This is probably the Royal Family’s forbidden area. How could such a secret and important place have no guards? Do you think they only relied on the ninjas to stop everyone from entering? If it was so simple…\"</p><br/><p>Rody suddenly went to the side of the road and held a thick tree. Using brute force, he managed to uproot the tree.</p><br/><p>He carried the tree as easily as he would a chopstick. He then signaled Nedis and Sith to step back. Rody lightly spat and then threw the tree into the cave.</p><br/><p>There was a sudden change.</p><br/><p>The entrance of the dark cave seemed to twist. As if a vegetable was being blended, a frightening rustling sound continued endlessly. The tree was crushed by an invincible force at the entrance, leaving only debris.</p><br/><p>Nedis turned pale. The tree that Rody threw was the ironwood that belonged to the dwarfs. Yet, it was instantly crushed. If she had really rushed ahead earlier, the same would have happened to her.</p><br/><p>Nedis became more frightened the more she thought about it and shuddered.</p><br/><p>Rody did not seem surprised and he sighed. \"I knew it was not that simple.\"</p><br/><p>He patted and comforted the frightened Nedis and then said, \"That thing that the dwarves hid here is a thorn to the Temple. The Temple had so many masters in the past few hundred years and even Paladins. How could they stop the Paladins just based on those ninjas earlier.\"</p><br/><p>Sith sighed and said, \"If we can’t even get past this, there is nothing left to discuss! Let us try it!\"</p><br/><p>He then started to cast a spell. Black fireballs appeared and revolved around him, suspended in mid-air. The air faintly fluttered. Sith finally opened his eyes and shouted, \"Go!\"</p><br/><p>A dozen black fireballs shot towards the entrance of the cave. However, the fireballs simply exploded and disappeared before it reached the entrance. It was as if a strange unseen force caused the fireballs to explode and scatter as sparks.</p><br/><p>\"If fire does not work, how about water?\" Sith waved his hands to summon water.</p><br/><p>As they were near a lake, there was an abundance of water elements. The sorcerer lifted his hand a little and waterballs of different sizes came out from the lake.</p><br/><p>The dozen waterballs floated in the air and coalesced. It squirmed as if it had a life of its own and finally transformed into a white dragon.</p><br/><p>The water dragon was lifelike. It roared earthshakingly loud into the sky a few times and shot towards the entrance.</p><br/><p>Rody was watching at the side when he suddenly thought of something and shouted, \"Not good!\"</p><br/><p>Without having any time to explain, he grabbed Nedis and moved to her front. He then shielded her with his large body.</p><br/><p>There was a loud roar along with a sound similar to beans being fried. The water dragon disintegrated the moment it got near the entrance. It transformed into a storm that shot back towards the three people.</p><br/><p>The water that was reflected was extremely fast. The water droplets cut through the air like arrows.</p><br/><p>Sith had already begun setting up a protective enhancement. The water droplets struck his protective enhancement with loud and crisp sounds, causing the enhancement to tremble.</p><br/><p>The trees on both sides of the road were also damaged. Countless leaves and branches were pierced by the powerful water droplets. Even the tree trunks were pierced by the water droplets. It went to show how powerful the water was.</p><br/><p>Rody held Nedis to his chest and felt as though his back was slashed by hundreds and thousands of warriors. Fortunately, his body was strengthened by the Mystic Dragon’s blood. Otherwise, the powerful attack would have torn his body apart.</p><br/><p>After that was over, the expression of the three changed. Rody let go of the frightened Nedis. Nedis lifelessly looked at the surrounding trees. She was speechless.</p><br/><p>Rody took off his shirt and saw that the back of his shirt had hundreds of small holes. It was already extremely tattered.</p><br/><p>He laughed bitterly and looked at Sith as he said, \"You better not try any other spells. It does not seem to be effective. I guess that there is a Sorcery array here that stops people from entering. It would be useless no matter what spell you use.\"</p><br/><p>Sith looked bitter as Rody’s eyes suddenly gave a swift and sharp gaze. He then said, \"Let me try.\" He paused for a moment and added, \"It is best for the rest of you to stand further away.\"</p><br/><p>This time, Nedis did not bother arguing with him. She and Sith retreated a few dozen steps away. Rody frowned and shouted, \"Go further!\"</p><br/><p>Rody saw Nedis and Sith retreat back to the lake. He then took a deep breath.</p><br/><p>Although he could feel a burning pain in his stomach when he used his energy, Rody could only grit his teeth and endure it.</p><br/><p>He slowly opened and expanded his domain. His aura spread out and wrapped the space around him.</p><br/><p>Rody’s eyes flashed with a golden light. He slowly exhaled and said, \"Appear.\"</p><br/><p>Everything within Rody’s domain, such as the trees, flowers, and stones, started to become transparent.</p><br/><p>They turned into an illusory image as if they had never existed.</p><br/><p>It was seemingly made by all the energies in the world. Rody looked into the cave and saw that the entrance of the cave looked different.</p><br/><p>There were dark rotating discs at the entrance of the cave like cyclones. It blocked the entire cave behind it.</p><br/><p>The rotating discs were not joined together. It rotates quickly in different directions.</p><br/><p>Some of it spun clockwise while others spun counter-clockwise.</p><br/><p>The discs rotated quickly like gears. The ironwood Rody threw had been crushed from the friction caused by the principles of these force.</p><br/><p>On the other hand, Sith’s water dragon was created by condensing the water. As water did not have a fixed shape, it was broken apart before it was reflected.</p><br/><p>Nedis and Sith looked at the wonders in front of them with surprise. They had opened their eyes so wide that their eyes could fall out.</p><br/><p>Rody lowered his head and thought for a moment. He then had an idea.</p><br/><p>He waved his hand and fighting energy emerged from his palms.</p><br/><p>The golden fighting energy condensed into a disc larger than the other discs. However, the disc created by the fighting energy also glowed with a golden light like a smooth reflection. It was as if it was a mirror.</p><br/><p>With two hands, Rody moved the huge disc towards the entrance of the cave.</p><br/><p>As he continued to step forward, he could feel the air in front resisting. It was as if he was walking into an invisible wall. A lot of strength was needed for each step. Gradually, his footsteps became slow and made a chattering sound when it stepped onto the ground. That was how strong the resistance Rody felt as he walked.</p><br/><p>The disc continued to spin and there was a cyclone in front of him. Rody suddenly exhaled his breath. To Nedis and Sith, it was as if the entire place instantly shined. They could then hear Rody shout, \"Stop!\"</p><br/><p>Sith’s eyes lit.</p><br/><p>This was a power to stop space! Only a person with strong domain powers could do this!</p><br/><p>Inside Rody’s domain, the wind stopped. The branches no longer moved. The clothes no longer fluttered and the tree leaves no longer swayed.</p><br/><p>It was as if he was the only person left in that space. Everything else became motionless.</p><br/><p>The only exception was the rotating cyclone.</p><br/><p>However, the cyclone seemed to have slowed down. Earlier, it had rotated so quickly that a person could not feel anything. However, it had slowed down and now, a faint humming could be heard from the friction in the air.</p><br/><p>Rody looked at the slow cyclone and did not dare to hesitate. Although he had strong domain power and could stop space, he was not able to maintain it forever.</p><br/><p>Rody then covered the cyclone with the disc in his hand.</p><br/><p>There was a loud screeching sound.</p><br/><p>It was similar to the ear-grating sound of a person scratching the bottom of a plate with a knife during mealtime.</p><br/><p>However, this sound was ten times louder and a hundred times even more ear-grating.</p><br/><p>Even though Nedis and Sith stood far away, they were not able to endure it. They screamed painfully and covered their ears. Their bodies were curled up like shrimps.</p><br/><p>Sith’s expression changed. He bit his lips and stopped covering his ears for a moment. In that moment, he suddenly crushed the gem on the cross at his chest. A milky white and pure light covered Nedis and Sith, making the two of them feel much better.</p><br/><p>If there was someone else present, that person would have been surprised. The leader of the Sorcerers was forced to use the most powerful Guardian Boundary.</p><br/><p>Naturally, Sith’s actions were sensible.</p><br/><p>The harsh sound became even more terrifying and eventually took shape as a sound wave. Only Rody was able to withstand the sound wave. The branches and leaves broke apart and even the rocks started to crack from the sound wave.</p><br/><p>Rody felt that the disc he was holding was unable to endure much longer. A faint creaking sound could be heard. It rotates powerfully as though it wanted to place pressure on the</p><br/><p>cyclone. Rody growled. The flames from his fighting energy suddenly rose, making him shine like the sun.</p><br/><p>The rotating cyclone and the disc caused friction, making the disc even fierier. Red flames started to appear at the edge of the disc. Even the air could not withstand the violent friction and started to burn.</p><br/><p>Rody's eyes flashed, then he roared! He suddenly grew several times his normal size. The shape-shifting sorcery spell that he had used to disguise himself broke down. His body then reassumed his real physique. His muscular arms held on desperately to the faintly screeching light disc.</p><br/><p>If there was a top spinning extremely quickly on the ground, it could easily be stopped by gently pressing the head of the top with a finger.</p><br/><p>However, the thing that was spinning quickly was not a top but a disc. More than ten times the strength is needed if a person wants to stop it.</p><br/><p>Besides that, the cyclone could easily mince ironwood. It was much more powerful than a millstone.</p><br/><p>That was why Rody still needed to use all his strength despite having strong domain powers.</p><br/><p>Dust gradually built up to his heel. He stood there and persisted, moving forward one step at a time.</p><br/><p>After that, there was a loud sound.</p><br/><p>The whole mountain trembled. Rody felt as though the incomparably powerful force in front of him disappeared. His hands loosened as he staggered forward a little. The cyclones had vanished.</p><br/><p>There was another cracking sound. The disc made out of Rody’s fighting energy could no longer endure it and broke into fragments like glass. It disintegrated and dispersed like golden stars.</p><br/><p>Rody was already sweating and his face was soaked. The hair on his forehead stuck to his face and he looked as though he was just fished out of the water. He looked extremely tired and was far exhausted than when he fought against ten Paladins.</p><br/><p>Nedis and Sith were tense. The sharp and harsh sound earlier had almost pierced their eardrums. Despite the fact that they covered their ears, the noise seemed to penetrate everything and drilled its way into their ears. If it was not because Sith had desperately used a Guardian Boundary, it was possible that even their bodies could have been torn apart by the sound.</p><br/>\n</div>"}