{"title": "Chapter 286: Sly Fatty (1)", "id": 286, "volume": 3, "url": "http://boxnovel.org/masked-knight-chapter-286-sly-fatty-1", "volume_title": "Volume 3", "body": "<h1>Chapter 286: Sly Fatty (1)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 286: Sly Fatty (1)</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Kara, Sith, and Nedis were all completely stunned. They had placed their trust in Rody. In the end, the life-saving trick merely summoned a …</p><br/><p>A fat guy!</p><br/><p>Rody's mouth hung open. Before he could say anything, Sky magnanimously waved his hand and loudly said, \"Alright, alright. Let this old man help you first before continuing…huh? Fuck!\" Sky turned around and saw the huge Hakone Serpent behind him.</p><br/><p>The eyes of the chaos-loving Sky burst in excitement. He looked at the angry Hakone Serpent and excitedly ran towards it. He shouted as he ran, \"How interesting! I have never seen such an interesting thing in a very long time!\"</p><br/><p>Sky casually stood in front of the Hakone Serpent as he stood akimbo. He then shouted, \"Hey! You ugly being! Are you the one that beat up my little brother mercilessly? However, you do not look so bad. I will not make things difficult for you. You just need to obediently follow me back and accompany me to workout sessions.\"</p><br/><p>Sky started to laugh after he finished speaking.</p><br/><p>The Hakone Serpent was stunned to see a small human run towards him instead of escaping. Even if it was a beast, it was confused by the strange situation. Immediately after that, its ferocious nature returned. It then swung its huge tail.</p><br/><p>Within a moment, several rocks flew into the sky. The tail made a sound like a wind blade.</p><br/><p>Sky had underestimated his opponent. He had stayed on the Radiant Continent and did not know that Rody had already mastered domain powers. He thought that Rody was still at the stage of a Sacred Swordsman. He believed that the monsters Rody fought against could be easily handled as he has a powerful Domain Master. Even though the snake with many heads looked strange, Sky only thought of it as a slightly more powerful Mystic Beast at best. After all, the Roland Continent had many more Mystic Beasts in comparison.</p><br/><p>In front of the other four, the fat guy summoned by Rody's life-saving trick was swept away by the snake's tail. There was a whistling sound as Sky's body flew sideways.</p><br/><p>'He…he is an idiot…' Nedis subconsciously thought to herself.</p><br/><p>Sith was lamenting his own fate. He could not believe he gave up the opportunity to escape and instead had believed in Rody's life-saving trick.</p><br/><p>Suddenly, there was a huge and angry roar.</p><br/><p>The fat man that was sent flying had turned around in midair and came back!</p><br/><p>Sky's face was filled with anger. His armor had been smashed into pieces. The common armor of the Imperial Guards could not withstand a hit from the Hakone Serpent. The thing that made Sky angry was the embarrassing position he was put into by the snake despite the fact that he was powerful Domain Master.</p><br/><p>\"Shit! Do you think you are so extraordinary with five heads? I have seen snakes with a dozen heads, not to mention the Mystic Dragon!\"</p><br/><p>In anger, Sky's body burst into a golden light as though it was a blooming flower. He then created many balls of light with a wave of his hand.</p><br/><p>Kara's expression changed as he saw Sky's actions. He could not help but blurt out. \"This guy is also a Domain Master?\"</p><br/><p>Obviously, Sky had already mastered domain powers. Energy easily condensed in his domain.</p><br/><p>His body inflated like a balloon. As he occupied a commanding position, he roared, \"Rody, go and hide further away! I want to deal with this ugly thing!\"</p><br/><p>Sith immediately pulled Rody and the others further away. He saw Sky give out a cry and throw both his hands forward. The countless balls of light shot towards the Hakone Serpent like a meteor shower.</p><br/><p>They heard an endless thunderous loud sound. The balls of light smashed into the Hakone Serpent's body like a heavy rain. The flames on the Hakone Serpent flashed endlessly.</p><br/><p>In the air, Sky shouted, \"I strike, I strike, I strike again! To hell with it!\"</p><br/><p>After Sky had fun fighting and followed Rody out of the Mystic Dragon cave, he had not fought so happily or launched a storm of attacks on that scale. Immediately Sky realized that he had actually rediscovered the pleasure similar to the time he spent fighting the Mystic Dragon at that cave.</p><br/><p>The Hakone Serpent roared in anger from within the explosions. At that point in time, it was already much weaker. If their strengths were to be graded, Sky was about only as powerful as Rody and Kara. Although Sky's attacks were intensive, it was not more powerful than the attacks Kara and Rody. However, Sky was fresh and combat-worthy. On the other hand, the Hakone Serpent had been fighting throughout the night and had three of its heads cut off. Its strength had plunged a lot.</p><br/><p>Smoke rose from the Hakone Serpent's body. It became angry and began to fight back. It raised its five heads to the sky and sprayed fire and ice at Sky.</p><br/><p>\"Aha! You even dare to fight back!\" Sky laughed. A shield of light immediately appeared from his hands. It was a weapon made from energy. That shield of light was big and was able to cover Sky's body.</p><br/><p>\"I block!\" Sky laughed. However, then the Hakone Serpent's spray attack heavily struck Sky's light shield, Sky's laughter stopped as he said, \"Shit. This is bad. I can't block it.\"</p><br/><p>His laughter turned to curses. Sky was like a housefly that got knocked out from the sky and spun as he fell to the ground. A deep hole appeared when he crashed to the ground.</p><br/><p>Sky climbed out of the rubble and fiercely shook his head. His body seemed to be bleeding. However, he immediately waved his hand, seemingly as easily as he was breathing, as he used Reshape Origin of the Light series spells.</p><br/><p>Sith was knowledgeable about spells. He saw this from a distance and sucked in the cold air. This fat guy was not only a strong person with powerful domain mastery. He was also powerful at sorcery!</p><br/><p>Sith did not know who Sky was but Rody certainly did. Rody already knew that Sky was the strongest Paladin of legends in the Roland Continent. For a Paladin to know how to use spells from the Light series was nothing strange. The spells the common Paladins knew were not too advanced.</p><br/><p>But such common rules could not be applied to a monster like Sky.</p><br/><p>\"Shit. I got careless.\" Sky grumbled. He was not in a hurry to strike back. He turned his head to look at Rody and scolded. \"Boy! Why didn't you warn me that this monster is so powerful? When did a Domain ranked Mystic Beast appear on the Roland Continent?\"</p><br/><p>Rody hid at a distance and laughed bitterly. \"Fatty! Be careful! This is not a Mystic Beast. It is…\"</p><br/><p>Before Rody finished speaking, the Hakone Serpent came out from the rubble. Its body was scarred and charred from Sky's attacks. Although its injuries were not fatal, it had made the snake angry. It sprayed out an attack at where Sky was standing.</p><br/><p>This attack was similar to a dragon's breath. He had fought the Mystic Dragon in that southern cave for several hundred years. For several hundred years, he fought the Mystic Dragon whenever he was not sleeping. That was why Sky was extremely experienced in fighting large monsters.</p><br/><p>Rody saw Sky's body flash and disappear. There was a huge explosion as a large crater appeared where Sky was standing.</p><br/><p>Two of the Hakone Serpent's heads moved over to look for its enemy but then suddenly its body shook.</p><br/><p>Sky had suddenly appeared behind the Hakone Serpent.</p><br/><p>Although he had fought chaotically earlier, he had already seen that the snake had only one tail despite having many heads.</p><br/><p>Sky was extremely experienced in fighting and naturally had faith in himself. He found the snake's tail and then hugged it with his body.</p><br/><p>Although Sky was obese, he was still small when compared to the Hakone Serpent. Yet, he was able to lift up the Hakone Serpent that was hundreds of times heavier with his two hands.</p><br/><p>Sky had carefully grabbed the snake's tail and lifted it up.</p><br/><p>He held the Hakone Serpent's tail in an embrace and spun around on his feet. As he spun the snake around faster and faster it seemed like a huge wind wheel, with a continuous whistling sound caused by the spinning. The Hakone Serpent even looked dizzy. Sky spun faster and faster and suddenly shouted, \"Go!'</p><br/><p>He released his hands and the Hakone Serpent was sent flying away!</p><br/><p>Sky then acted quickly. He placed both hands in the air and two huge dazzling balls of light issued out from his hands.</p><br/><p>\"Die!\" Sky suddenly roared loudly.</p><br/><p>From a distance, Rody and Kara could clearly feel the fluctuation of energy in Sky's body as his aura seemed to burst out to the strongest peak.</p><br/><p>After that, there was a violent whistling sound as two huge balls of light shot out of Sky's hands.</p><br/><p>Kara's expression changed slightly. 'This fat guy can make the energy of his domain reach the peak instantly? He truly has mastered his domain powers to the peak.'</p><br/><p>The two balls of light sped along. One flew to the right the other flew to the left. The rays then curved and moved in front of the Hakone Serpent.</p><br/><p>There was a thunderous sound. The two huge balls of light had flown towards the front and back of the snake. After that, there was a huge shockwave like a hurricane at the ocean. The hurricane swept down, scraping the ground. The four people even had trouble staying on their feet.</p><br/><p>Thick black smoke rolled and covered the sky.</p><br/><p>Sky did not bother to look at the sky and gently patted his hands. He then laughed and said, \"How is my Gale Break? I suppose it is not inferior to your Mystic Dragon Purge?\"</p><br/><p>He then laughed and loudly said, \"Alright. I have finished fighting! I am going back to sleep!\"</p><br/><p>He did not even manage to take two steps forward before his legs turned soft and almost fell to the ground. He then cursed. \"Shit. I spun too fast and became dizzy.\"</p><br/><p>Rody and the others held back their laughter. Nedis then went up to help Sky.</p><br/><p>It was at this moment when the black smoke in the sky gradually dispersed. The Hakone Serpent roared once again.</p><br/><p>Its body was badly broken. Half of its body was badly mangled. Even more importantly, it only had four and a half heads left.</p><br/><p>That half head was broken and tattered but was healing rapidly.</p><br/><p>Sky looked back and shouted, \"This guy is so tough? That attack of mine would even have bested Domain Masters!\"</p><br/><p>Suddenly, the four remaining snake heads opened their mouths at the same time. The heads acted in unison and spewed out golden lightning.</p><br/><p>Boom! Boom! Boom! Boom! The four bolts of lightning were like a chain of thunderbolts. Before Sky could react, it had already struck where Sky was standing. The four bolts of lightning engulfed Sky's fat figure in flames. Kara cried out in alarm, yet he could not do anything.</p><br/><p>Sith had been vigilant the entire time. He had always felt that the odd fatty was not too reliable and had not put down the staff in his hands.</p><br/><p>At that moment, Sith had roared out an incantation. His potential had been stimulated in that moment of crisis. He had used one of the most advanced summoning spells. It had a long incantation that needed two breathes to recite. However, Sith had managed to recite the incantation in a single breath, without pause, during that moment of crisis. He had roared out over sixty syllables 1 .</p><br/><p>He pointed his staff to the sky and a golden light from the sky formed a wyvern.</p><br/><p>\"Summoning spell?\" Kara looked at Sith. He then softly said, \"The summoning spell is indeed very powerful. However, even if you summon a dragon, you cannot defeat the Hakone Serpent.\"</p><br/><p>The wyvern gave a sharp roar. Its loud voice immediately attracted the attention of the Hakone Serpent.</p><br/><p>Beasts were simply beasts. They were dumb beings that would attack the largest and most conspicuous enemy. As the wyvern was large and loud, it managed to attract the Hakone Serpent's attention.</p><br/><p>At this moment, Rody and Nedis dragged Sky to the side. There were cracks around the ground that was struck by lightning and a little bit of black smoke too. Sky's eyes were closed. His armor was already destroyed and even his clothes were burnt until only a strip of cloth was left.</p><br/><p>\"Fatty, how are you?\" Rody shouted while Nedis shook Sky. Sky then gasped for breath and opened his eyes. He suddenly sighed and said, \"It has been a long time since I have been struck like this by lightning. It feels really great!\"</p><br/><p>\"Are you okay?\" Rody laughed.</p><br/><p>Sky then jumped up from the ground. He glared and said, \"I am obviously fine! Did you think you are the only one that wiped the Mystic Dragon's blood all over your body? I have fought with the Mystic Dragon for a few hundred years in that place. Did you think I would not have wiped its blood on my body?\"</p><br/><p>Sky then used Reshape Origin on his own body. In fact, his injury was light. He was simply put in an awkward position by being struck by lightning. However, the crazy fatty had used the most advanced spell that many high-ranked sorcerors could not use even once in their entire life, Reshape Origin, as though he was eating Chinese cabbage.</p><br/><p>\"You…you are really alright?\" Nedis still felt uneasy. She could not help but cautiously ask, \"Those bolts of lightning that struck you, isn't it painful?\"</p><br/><p>\"Pain?\" Sky looked at her. He narrowed his eyes as he thought for a moment and then said, \"It is not really painful. It is soft yet rough. It is like the feeling of first love.\"</p><br/><p>Without waiting for Nedis to glare at him as though she was looking at a ghost, Sky jumped back to the sky. He looked at the Hakone Serpent and shouted, \"Ugly thing! I am not defeated yet! Let's go again!\"</p><br/><p>At that moment, the wyvern summoned by Sith was being chased around the sky by the Hakone Serpent.</p><br/><p>Indeed, a real dragon 2 was being chased by a snake and was in a difficult position.</p><br/><p>Sky shouted when he saw the Hakone Serpent ignore him. He was about to rush ahead when Kara suddenly shouted, \"Hey! Fatty! Be careful when you attack. Attack its head! That head that was half destroyed has still not yet recovered. I am guessing that it must be a weakness!\"</p><br/><p>Sky could not help but look at Kara. Kara calling him a fatty had put him in a bad mood. Sky looked at Kara's mask and then turned to Rody and loudly asked, \"Where did that sneaky masked fellow come out from?\"</p><br/>\n</div>"}