{"title": "Chapter 280: Hakone Battle (1)", "id": 280, "volume": 3, "url": "http://boxnovel.org/masked-knight-chapter-280-hakone-battle-1", "volume_title": "Volume 3", "body": "<h1>Chapter 280: Hakone Battle (1)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 280: Hakone Battle (1)</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>\"Are you ready?\" Kara asked Rody with a smile.</p><br/><p>Rody nodded and returned a glance. \"Alright. Are you going first or am I going first?\"</p><br/><p>Kara laughed bitterly and said, \"I will go first. Otherwise, you would think that I am treating you as cannon fodder…I will pave the path and you follow behind me! Remember the plan we had discussed earlier.\"</p><br/><p>Kara then gave a loud and resonant cry in that dreamland. His long and loud voice was filled with a challenging tone. He then moved in.</p><br/><p>Kara's white and slender figure was like a meteor as he dashed towards the evil red sun radiating a red light within the clouds.</p><br/><p>Rody drew out his Dragon Spell Scimitar while gritting his teeth and scurried out as well.</p><br/><p>Both of them were covered in the flames of their fighting energies as they pressed onward. Suddenly, they heard an earthshaking roar. Red flames shot out of the clouds like a monstrous wave that immediately punched into the faces of the two men.</p><br/><p>\"Rush past it!\" Kara shouted. The two charged past the flames while being covered in fighting energy. They then heard a whirling sound of the flames. The dazzling red flames around them made them unable to open their eyes</p><br/><p>This flame was clearly not ordinary. Despite Rody's fighting energy protecting his body, he could feel his hair and his clothes burning. It was shocking. Suddenly, there was a break in front, and something had already charged towards them!</p><br/><p>Kara then was met by the snake's first attack!</p><br/><p>The triangular head of the large snake shot out of the clouds. Its mouth opened wide revealing its two long fangs. The bifurcated-tongued snake tried to bite Kara.</p><br/><p>Kara suddenly accelerated to avoid being eaten. Rody could clearly hear the loud snapping sound of the snake biting into empty space. Rody immediately caught up after that. He clenched the Dragon Spell Scimitar and swung it down onto the monster!</p><br/><p>This attack was the first time Rody had fully utilized his strength ever since he mastered domain powers. Black flames could faintly be seen on the Dragon Spell Scimitar. The weapon was as if it was a supernatural weapon from hell. The slash was like lightning.</p><br/><p>Such a powerful attack amazed even Kara, who was at a distance. He shrank back and covered his face, hoping not to get caught in the crossfire.</p><br/><p>Suddenly there was a roar.</p><br/><p>Rody felt as though he had slashed something. However, it was a strange feeling.</p><br/><p>'A wall!'</p><br/><p>Rody immediately had that thought!</p><br/><p>Rody had indeed felt as though he had slashed a wall. The blade was on top of the snake's head, but there seemed to be some distance away from it. It was as if something had obstructed it!</p><br/><p>There seemed to be a crimson flame around the snake's head, like a barrier. It protected the snake from Rody's attack that was as powerful as a thunderbolt.</p><br/><p>'Hell. This snake has fighting energy?'</p><br/><p>There was a sizzling sound under Rody's blade, at the part where the large snake's fighting energy protected its body. Flames started to surge from that area because of the fierce collision. Some of the flames were red and some of the flames were black. Rody gasped and immediately retreated. At that moment, he no longer dared to preserve his strength as he withdrew as fast as lightning. He immediately retreated to behind Kara and said, \"It's very hard!\"</p><br/><p>Rody could feel his hands trembling a little as he held the scimitar. The violent trembling made him feel as though his weapon would drop out of his hands.</p><br/><p>\"Retreat!\" Kara looked at the giant snake roaring angrily and seemed agitated. \"It is coming out!\"</p><br/><p>The two of them separated to the left and right like shooting meteors.</p><br/><p>The snake saw the two people separate into two sides and did not know which one to chase. It spewed out flames angrily, shook, and then it slowly left the clouds.</p><br/><p>The Hakone Serpent finally revealed its body to the two.</p><br/><p>Kara did not have any reaction to seeing the Hakone Serpent. On the other hand, Rody looked blankly at the monster and laughed bitterly. \"One, two, three, four…As expected, it is like this.\"</p><br/><p>This was the largest snake Rody had ever seen in his life...</p><br/><p>Yes, it was the largest creature Rody had ever seen in his life!</p><br/><p>The red light was reflected off the scales of the giant snake. Its body was like the walls of the capital. It also had eight heads.</p><br/><p>Its eight identical heads of various sizes were up in the air. Some were roaring angrily, some were coldly staring at Rody and Kara, and some were rushing forward.</p><br/><p>Rody had seen strange snakes like these before. In fact, Wuya, who was in the mountains South of the Radiant Empire, was a dozen headed snake.</p><br/><p>However, Wuya paled in comparison to the Hakone Serpent. The Hakone Serpent was about a dozen times larger than Wuya. The large aura emitted by the huge monster was also far more powerful than Wuya. That powerful aura even made Rody, a Domain Master, sweat. He was faintly shocked by the formidable enemy.</p><br/><p>The snake slowly came out of the clouds covered in that red light!</p><br/><p>\"Stop being dazed! Attack quickly! Before it completely wakes up!\" Kara shouted. He suddenly ascended a few tens of meters. He lifted his hands in front of his face and towards the snake. He then read an incantation causing a golden light to appear from his hands.</p><br/><p>A massive circular halo gathered at his hands and agglutinated. When he chanted softly again, the ring of light shot towards the Hakone Serpent.</p><br/><p>The ring of light expanded endlessly as it flew. When it hit the Hakone Serpent, it tied up the snake's body.</p><br/><p>Kara seemed to be sweating. His hands were faint as he abruptly endured. The ring of light seemed to be controlled by him. It shrank rapidly and tied up the snake.</p><br/><p>The snake became extremely irritable after being tied by the golden ring. Its eight heads roared which clearly showed that the golden ring made it feel very uncomfortable.</p><br/><p>Kara's hands trembled after that as if he was exhausted. The snake started to twist and with every twist, Kara became even paler.</p><br/><p>\"Boy, get to work!\"</p><br/><p>Rody had already rushed out before Kara finished speaking. His golden flames burned brightly and he was like a golden comet flying towards the snake.</p><br/><p>He waved the scimitar in his hands that burned with the black flames of a god's spell.</p><br/><p>A pure black light about ten meters appeared and whizzed out of the scimitar.</p><br/><p>Rody did not stop and continued to slash in a single breath. A dozen huge black lights shot towards the giant snake.</p><br/><p>After slashing out more than a dozen waves, Rody seemed to have consumed too much energy. His golden fighting energy seemed to dim a little.</p><br/><p>\"Old guy, get back!\" Rody hurriedly shouted. He himself also started to move back.</p><br/><p>There was another roar.</p><br/><p>In that beautiful place, the dozen black waves struck its target. In fact, it was impossible to miss as the target was too near and too gigantic. Rody would be able to strike it even with his eyes closed.</p><br/><p>The Hakone Serpent once again spread out its crimson barrier. All the black waves struck it.</p><br/><p>All the eight heads of the Hakone Serpent suddenly roared in unison. It rolled about and even caused the clouds to scatter. It was evident that the black waves were extremely painful to it.</p><br/><p>The crimson barrier shattered like ice when struck by the black waves. The black waves also severely cut into the snake's body.</p><br/><p>The black waves were filled with all of Rody's own energy along with condensed hellfire. As the hellfire had the ability to burn everything, even the Hakone Serpent could not endure it.</p><br/><p>However, the black waves could not cause too much damage as it still needed to burn through the barrier, causing it to lose power.</p><br/><p>The Hakone Serpent roared when a dozen slash marks appeared on its body. It was unfortunate that only two of those slashes caused severe harm to the snake, cutting off its scales and causing it to bleed. On the other hand, the other waves only left black slashing marks but did not manage to cut off the scales.</p><br/><p>After the smoke had cleared, Rody looked at the results of the battle. He could not help but become stupefied and murmur. \"This guy is actually so strong.\"</p><br/><p>\"Now do you believe me?\" Kara sighed beside him.</p><br/><p>Rody laughed bitterly. \"Yes, I believe you. But this guy is so powerful. How are the two of us going to fight it? I think we may not be able to get rid of him even if we add another guy with strong domain! It is simply arms-proof! Its fierce fighting ability is too high.\"</p><br/><p>\"Do not rush! Just like what I said, this guy has a weakness. We must test and find it!\" Kara said and charged forward again. He opened up his hands and his white robes fluttered. His body instantly emitted light. After that, his opened hands also started to emit two balls of light. It then whistled as it flew towards the snake's head from two directions.</p><br/><p>Rody gritted his teeth and shot forward, leaving behind an afterimage. He no longer used any fancy tricks with his sword since he knew how terrifying the snake was when it fought back. That hellfire attack he made earlier was powerful enough to kill ten Paladins. However, the monster only received two injuries. Rody was now unwilling to use up more of his strength in vain.</p><br/><p>The snake saw Rody approaching and seemed to realize that the severe pain it received from the ten waves earlier was caused by him. It gave up on chasing Kara and moved towards Rody. It opened its mouth wide and forcefully spat.</p><br/><p>Rody smelled a stinking smell that almost made him faint as the fierce wind blew into his face. He then saw a large mouth right in front of him. He could not help but curse and evade to the left. Even though they were weaker than the Hakone Serpent, they were fortunately smaller and more agile.</p><br/><p>\"Bleh! So smelly! This beast did not brush its teeth for thousands of years!\" Rody cursed.</p><br/><p>The snake bit into empty space. It then nimbly turned its head, opened its mouth and spat, but these were not flames.</p><br/><p>It was a blast of freezing cold air!</p><br/><p>\"Shit!\" Rody cursed. \"Wasn't the snake a fire type?\" Unfortunately, it was too late. He lifted a palm and instantly created a shield of light with his fighting energy. He hid behind his shield.</p><br/><p>There was a loud explosion as the magnificent freezing cold air pounded onto Rody's light shield. Rody's entire body shook. He could feel the strength of the impact, and it kept coming wave after wave. Rody gritted his teeth as he slowly retreated. He then heard sizzling sounds as a thick frozen layer gradually formed on his light shield. The ice from the light shield gradually spread and half-froze Rody's arm.</p><br/>\n</div>"}