{"title": "Chapter 281: Hakone Battle (2)", "id": 281, "volume": 3, "url": "http://boxnovel.org/masked-knight-chapter-281-hakone-battle-2", "volume_title": "Volume 3", "body": "<h1>Chapter 281: Hakone Battle (2)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 281: Hakone Battle (2)</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Kara could see that Rody was in a difficult position. A hammer made of light suddenly appeared in his hands. He lightly brandished the light-hammer and suddenly swung it at the snake's head.</p><br/><p>There was a loud explosion as the hammer struck the snake's head. The head that had caused Rody to freeze up was shaken causing its mouth to snap shut.</p><br/><p>Rody immediately retreated and used his fighting energy to melt the ice on his frozen arm.</p><br/><p>\"Boy, are you alright? I forgot to tell you that this guy is a universal type.\" Kara's voice came from above.</p><br/><p>\"Just take care of yourself!\" Rody unhappily replied. Sure enough, the snake head that had been clobbered by the hammer roared angrily and loudly. It gave up on Rody and charged toward Kara. Suddenly faced with a few snake heads charging at him, Kara was caught off guard. If he had not had the speed advantage...</p><br/><p>Rody did not dare to step forward recklessly and observed from the side.</p><br/><p>'Hm, I have tried this, I have tried that. One, two, three, four…Also that!'</p><br/><p>Rody looked at his target and once again flew towards it in an arc.</p><br/><p>According to Kara, the Hakone Serpent might be powerful but it was still defective. There must be a weakness that was difficult to hide.</p><br/><p>The Hakone Serpent had eight heads but one of the heads was its weakness. If that weakness could be found and cut off, its strength would be weakened by one-eighth.</p><br/><p>Once this head was cut off, a weakness would appear at the remaining seven heads! As long as the weakness could be found again, its head could be cut off again and make it one-seventh weaker.</p><br/><p>Another weakness would then appear on the remaining six heads.</p><br/><p>This would keep repeating. As long as a person could get rid of its heads one by one, they would be able to slowly weaken it and have a good chance of winning when it only had one head left.</p><br/><p>\"Shit. It is not this head!\" Rody cursed. He moved to a side like lightning, but his shoulder had already turned red with blood.</p><br/><p>He had risked himself to test out a head, but he felt like he was trying to cut a rock. The Dragon Spell Scimitar in his hand was vibrating with a whining sound as Rody retreated. However, one of the snake heads saw an opportunity and shot out a blade of wind!</p><br/><p>Rody could not take precautions in time so he was swept away. If he had not avoided a majority of the attacks, he would have been cut into pieces!</p><br/><p>Even the Mystic Dragon's blood could not protect him from such a powerful enemy.</p><br/><p>The situation was even worse for Kara. He had been shot at with a breath of fire and his snow-white robe had been charred black. It was unknown what material his robe was made off that it had not burned instead. With just a look, it could be seen that he was in an extremely difficult position. An even more surprising thing was that Kara's mask had also turned black after getting burned by the flame.</p><br/><p>At that moment, the ancient Devil God wearing a blackened mask was like a buffoon being chased by several snake heads all over the sky.</p><br/><p>Rody could not help but laugh. Kara then roared from the sky. \"Boy, quickly! Come and help!\"</p><br/><p>Rody was about to agree when he suddenly felt cold. Rody turned around and saw a huge snake head less than five meters away from himself.</p><br/><p>\"Hell! This guy knows how to attack sneakily?\"</p><br/><p>This was Rody's last thought.</p><br/><p>The cunning snake took advantage of the moment its two enemies were busy with the other heads and had silently approached Rody. It had moved in such a way that even Rody, a Domain Master, had not noticed it.</p><br/><p>Its bloody mouth then swallowed Rody!</p><br/><p>In the sky, Kara clearly saw his comrade getting swallowed.</p><br/><p>His eyes turned black and he almost fainted.</p><br/><p>It was wrong to say he had any feelings for Rody. However, he had spent a lot of time winning Rody's cooperation and had great hopes and expectations that Rody would be able to help him defeat the snake. He did not expect Rody to be swallowed up in such a short time.</p><br/><p>Kara became very angry and almost vomited blood. While he was distracted, one of the snake heads swept over and heavily knocked him away...</p><br/><p>He was in severe pain as his body was thrown flying through the air, rolling over and over. When he came to a stop, one side of his body was bleeding, the flesh lacerated and numb.</p><br/><p>\"Is there really no other way?\" Kara ignored the pain as he groaned.</p><br/><p>Suddenly, the snake head that ate Rody started to whine. Kara then saw a scene that surprised him.</p><br/><p>The huge snake's head suddenly expanded like a balloon. Its eyes also protruded out.</p><br/><p>The snake's head then exploded in a spray of blood. The body under that head twisted and fell powerlessly.</p><br/><p>As that head exploded into pieces, the other heads roared agonizingly at the same time.</p><br/><p>From within the exploding bloody mass, something that looked badly mangled shot towards Kara.</p><br/><p>Kara looked closer only to find that the thing flying towards him was Rody.</p><br/><p>Rody's entire body was covered in blood. However, it was not clear if he was covered in his own blood or the snake's blood. He wiped away the blood on his face and gasped for breath. He then cursed. \"So smelly! That snake definitely had not brushed its teeth for thousands of years.\"</p><br/><p>Kara saw that Rody had a few injuries and was bleeding. Rody's face also looked pale after wiping the blood from his face. He was turning as white as paper.</p><br/><p>\"Old guy, stop looking. Aren't you a sorcerer? Quickly give me some treatment…\" Rody smiled wryly.</p><br/><p>The Hakone Serpent stopped writhing around in pain. Its remaining seven heads suddenly roared loudly as one. It then spotted Rody and Kara before charging over.</p><br/><p>Kara had managed to stop Rody's bleeding with a high ranked Light series healing spell before the snake rushed over.</p><br/><p>The two of them could not do anything and could only escape again.</p><br/><p>Kara was alright as the snake seemed to target the assailant, Rody. Fire, ice, wind blades and light blades all shot towards Rody. Rody dodged up and down like a firefly beside the snake. Several times he could not dodge completely and had to rely on his fighting energy to protect him.</p><br/><p>Seeing Rody being chased around, Kara steadily retreated to a side. He healed up his own wounds with a high-level healing spell and then shouted, \"Boy, come over to me!\"</p><br/><p>Rody had just been rammed at by a snake head. The light shield in his hands disintegrated as he somersaulted out of there. He then turned around and went towards Kara.</p><br/><p>Rody was exhausted and was having trouble sustaining himself. He then cursed, \"Old man! What are you doing standing here?\"</p><br/><p>Kara pulled Rody's hand. A holy light flowed from Kara's hand to Rody's body. Rody felt relieved knowing that this was the Light series' healing spell. In the beginning, he had several wounds. Now, his muscles squirmed as his wounds closed.</p><br/><p>\"We are going out!\" Kara said, \"We need to change plans. It seems the original plan is not working.\"</p><br/><p>Rody did not say anything and immediately nodded.</p><br/><p>Both Domain Masters were injured. They had fought with all their strength but they only managed to cut off one head. The cost was that Rody had almost used up all the strength in his body and Kara was also injured. If they continued fighting, they would die.</p><br/><p>Kara extended his fingers as though he was counting something quickly. The large snake has turned its body over. The seven heads then looked at where the two were standing and launched seven waves of attacks. Fire, ice, and wind crashed towards them, all of which were on the rank of domain powers.</p><br/><p>The two did not dare to approach and quickly retreated to the back.</p><br/><p>There was a thundering crack in the sky. The seven attacks tangled together and became a huge blast. The clouds in the illusive world scattered. The burning flames burned half the sky and the freezing air froze the other half of the sky.</p><br/><p>\"What are you thinking of? Didn't you say we should get out?\" Rody hurriedly asked.</p><br/><p>Kara shook his head and replied, \"There is still half an hour! We will hold out for a little bit. You will wait for my signal. When I say retreat, the two of us must retreat to the entrance. You must rush out in time no matter what is blocking you!\"</p><br/><p>\"Are you thinking of…\" Rody's eyes lit up.</p><br/><p>Kara no longer replied. He repeatedly patted Rody and then turned around to once again charge at the large snake.</p><br/><p>\"God of the Wind, hear my call…\" Kara started to chant, \"As punishment for angering the Gods, grant me your tornadoes!\"</p><br/><p>As soon as Kara finished his incantation, four tremendous columns of tornadoes appeared around the Hakone Serpent at the same time.</p><br/><p>The tornadoes swept everything including the flames that had not dispersed, including the large snake.</p><br/><p>The snake's angry hisses turned into a violent wind that clashed into the four tornadoes. Suddenly, the snake roared loudly, beckoning the red evil sun to come down. The large snake then coiled itself around the sun forming spirals that kept the sun under its body.</p><br/><p>The red light from the evil sun seemed to spread all over the snake's body. The Hakone Serpent's dimmed protective barrier then started to light up again.</p><br/><p>Although the four tornadoes roared violently, it could not do anything to the large snake. At most, it could only hold back the snake's movements.</p><br/><p>At that moment, three of the snake heads roared majestically in the air and attacked Kara, who was controlling the tornadoes. Kara quickly dodged right and left and was so angry that he roared.</p><br/><p>Kara almost fainted from anger when he watched the monster use his own Divine Primordial Spirit to deal with him.</p><br/><p>Rody breathed in for a moment. He felt some of his strength had restored. He then stepped forward with his Dragon Spell Scimitar.</p><br/><p>\"Hey, monster! You can use fire but did you think that I cannot use ice?\" Rody roared and slashed.</p><br/><p>Inside Rody's Dragon Spell Scimitar was a special entity. It was the Dragon Paladin that got refined into the sword. The soul of an Ice Dragon.</p><br/><p>At the moment he gathered his strength into his scimitar, his scimitar seemed to cry out like a dragon. Ice covered the skies.</p><br/><p>Kara was looking at the side when he suddenly shouted, \"Don't!\"</p><br/><p>Before Kara had finished his word, a strange scene had happened.</p><br/><p>The ice gathered around the Hakone Serpent suddenly changed rapidly. The Divine Primordial Spirit under the Hakone Serpent suddenly emitted a brilliant ray of light. It was like a black hole that pulled in the ice from the surroundings. It gradually condensed and was steadily absorbed into the sun.</p><br/><p>The Hakone Serpent roared. The snake head released a shockwave. Rody had put the sword in front of him to block it. His body was thrown back. Rody then cursed, \"What happened?\"</p><br/><p>Kara could not deal with the Hakone Serpent and dodged a few times. He created an image of himself in front of the snake and then his real body escaped and landed beside Rody. He then said, \"This fellow seemed to have learned how to use my Divine Primordial Spirit after thousands of years. My Divine Primordial Spirit has a name, it is called Magatama! Once it is used, it can absorb fire and ice series spells!</p><br/><p>\"Why didn't you so say earlier?\" Rody angrily replied. \"What do we do now?\"</p><br/><p>Kara glanced at Rody and said, \"I think that the Hakone Serpent only mastered this! How could it easily grasp how to use my Divine Primordial Spirit? However, even if your attacks are absorbed by the Magatama, it does not give any benefits to the Hakone Serpent. It is simply an additional defensive skill.\"</p><br/><p>At that moment, Kara looked at the distant Hakone Serpent and said, \"Time's up. It is time to leave!\"</p><br/><p>Using the fastest speed, the two of them quickly rushed towards the exit. The Hakone Serpent obviously did not want to let its enemies escape, so it chased after them with its extremely long body.</p><br/><p>Although the exit was not far away from Rody and Kara, the Hakone Serpent was also not slow. Kara was the first to get out with Rody following behind. The moment Rody passed through the exit, he heard a loud crash.</p><br/><p>The huge snake head had crashed into the top of the exit. The exit was too small and the snake head could not get through. The Hakone Serpent was extremely angry. It roared and moved back a little before ramming into the exit again.</p><br/><p>Rody had just left the cave when he heard a loud roar behind him. He also heard the sound of the mountain cracking from impacts caused by the Hakone Serpent.</p><br/><p>Nedis and Sith were still outside the cave as they had not left yet. They had been standing at a distance. When Nedis saw the two come out, she was pleasantly surprised and cried out to them as she ran over. However, she was shocked when she saw their appearance.</p><br/><p>Rody and Kara were in a pathetic state. Both Domain Masters were left in rags and covered in blood. If it was only Rody then it would be one thing. However, even Kara's dignified snow-white robe had turned black and his mask was also charred black by flames. Even his hair looked burnt.</p><br/><p>\"You guys…\" Nedis only had enough time to say these two words when she heard a long and uninterrupted hissing sound from the cave!</p><br/><p>With the sound of a loud explosion, the four people suddenly felt the earth tremble. There was a rumbling sound coming from behind the sacred mountain. The Hakone Serpent rammed against the exit as if it was coming out.</p><br/><p>The walls of the mountain collapsed. The Hakone Serpent's head then came out of the hole. Nedis was shocked when she saw it and cried out in alarm.</p><br/><p>Rody pulled her behind him and said, \"Go back further!\"</p><br/><p>Nedis then asked, \"You guys…what did you guys do inside? Did you fight with the monster?\"</p><br/><p>Kara looked gloomy. He looked at the snake head struggling at the narrow entrance and slowly counted, \"Five…four…\"</p><br/><p>There was another loud sound. Rody could see cracks forming at the entrance of the cave. The largest crack had already spread towards the peak of the mountain.</p><br/><p>\"Two…one! It is done!\" Kara sighed and then pulled Rody back.</p><br/><p>At that moment, the snake's head had left the exit. It stared fiercely at the four with its electric-like eyes as it struggled to come out.</p><br/><p>However, its body was too big. Although its head managed to get out, its body could not get out unless it made the mountain collapse.</p><br/><p>Rody suddenly felt the space at the entrance twist. A burst of wind started to blow. Rody was very familiar with that swift and fierce atmosphere.</p><br/><p>That entrance made by the Gods had a powerful God-ranked sorcery array. After some time, it started to move…</p><br/>\n</div>"}