{"title": "Chapter 297: Swept Away", "id": 297, "volume": 3, "url": "http://boxnovel.org/masked-knight-chapter-297-swept-away", "volume_title": "Volume 3", "body": "<h1>Chapter 297: Swept Away</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 297: Swept Away</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>When Rody saw the figure in the air, he became relaxed and half knelt on the ground. He leaned onto his scimitar so as to not completely fall to the ground. That battle had drained all his fighting energy, leaving behind only emptiness and fatigue. </p><br/><p>The hurricane spun in the air for ten minutes. </p><br/><p>Oda Nobunaga looked at this and was stunned. He could not believe that the hurricane was man-made. </p><br/><p>When the hurricane stopped, there was dust everywhere. Thousands of corpses fell from the sky and caused more dust to fly into the air. </p><br/><p>When the dust settled, and visibility was restored, the banners were scattered all over and had lost their usual majesty. The ground was full of bright red blood mixed with the soil. The blood and soil had mixed to form a dark red mud. </p><br/><p>Nobunaga’s eye socket cracked, and he bled a little from the corner of his eye. He could not help but roar endlessly. He did not expect the figure in the air to have such ability. </p><br/><p>When Nobunaga looked at the figure in the sky again, he saw that person softly landing on the ground. The figure quickly moved towards Rody. </p><br/><p>The black veiled figure went in front of Rody. She half knelt and hugged Rody’s shoulder. </p><br/><p>Before she could speak, Rody suddenly sighed. He released the sword in his hand and tightly hugged her in return. </p><br/><p>After the two hugged for a while, the black veiled figure stretched out her right hand and touched Rody’s face. The resolute and firm edges of his face were covered with blood and dirt. It no longer looked like last time. The fingers of the black-veiled figure were slender and thin, looking like they belonged to the hands of a woman. 1 </p><br/><p>The black veiled figure suddenly took off her veil and used it to help Rody wipe off the blood and dirt on his face. </p><br/><p>Rody muttered softly. \"Mouse, why are you here?\" </p><br/><p>Mouse raised her head. Her sparkling eyes carefully inspected Rody’s face. The black veil in her hands moved and restored Rody’s facial appearance. It was no longer blood-stained and dirty. Although Rody’s face still looked pale, it started to look more like before. </p><br/><p>At that moment, Mouse had many questions. Like how a guy like Rody with such great powers got bested by a warrior whose level was only at a major Knight level. She also wondered about his experiences during the long time that he spent here...and many other questions. However, seeing that Rody was pale and dazed, she was reluctant to ask any question. She then tightly held on to Rody with all her strength. </p><br/><p>Rody laughed bitterly and sighed. Except for the time at the Duke of the Tulip Family’s mansion with Nicole, he had never relied on a woman for protection before. He had myriad feelings in his heart but was unable to control his actions. He could not even struggle away from Mouse’s embrace to stand up. Rody thought to himself, 'How long has it been since I ended up in such a situation? Even encountering that damn Hakone Serpent was not so miserable or unbearable.' </p><br/><p>Besides him, there were two more whose expressions had changed. However, both were surprised and confused. </p><br/><p>The first one was Kikukawa Yukinari. He saw Mouse leading the charge of the soldiers and then, right out of empty space, she created a hurricane of knives and swords. With a snap of the fingers, Nobunaga’s one thousand elite cavalrymen were massacred. He then saw that Mouse had a close relationship to Rody. At the start, he thought they were just siblings or good friends. That was until Mouse took off her veil. Yukinari was surprised to see that she was a woman. It was ordinary if a man were so powerful...but it was especially surprising since Mouse was a woman that was exceedingly beautiful. </p><br/><p>When he saw Mouse hold Rody’s head to her chest, he had already given up all hope for the woman. First, it was the breathtakingly beautiful Nedis, and now, this unbelievably beautiful woman also showed extreme concern for Rody. </p><br/><p>The other person was Oda Nobunaga. Nobunaga could not believe it when he saw Mouse’s hurricane. However, he soon understood why the army at the South was so quickly defeated. The other party was so powerful that he could not figure out what to do. With a single wave, he had lost thousands of his elite soldiers and horses. The army at the South might dominate in numbers but in the end, Mouse only needed to wave her hand a few more times. </p><br/><p>Right now, Mouse no longer needed to wave because there were already thousands of casualties with that single wave. A soldier in the army only had a certain amount of mental endurance. After seeing such a terrifying enemy, they would start to break down psychologically. At that time, his own army would break and scatter on their own—the Roland Army need not even give any assistance. Just with them running in all directions, they would trample over each other causing a significant number of casualties. </p><br/><p>Nobunaga could not understand. A person with such extraordinary powers was a woman. On top of that, she had slain thousands of his soldiers simply because Rody was injured. </p><br/><p>Nobunaga saw Mouse and Rody silently reuniting in front of him with a mix of joy and anguish. He believed that the opportunity to attack was right in front of him. </p><br/><p>The idiot was still having delusions of mounting a sneak attack to kill Mouse and continuing to chase his dream of becoming the Shogun. </p><br/><p>Nobunaga moved slowly in fear of alerting Mouse. He gathered the remnants of his army and prepared to move </p><br/><p>Nobunaga’s cavalry deserved to be called brave warriors that fought hundreds of battles. They had witnessed their colleagues torn to pieces, yet they continued to wait for orders and did not break away. They were worthy of being called well-trained soldiers. </p><br/><p>At the side of the battlefield was another person who wore a strange expression—that person was Nedis. </p><br/><p>She had already vaguely guessed that the figure was Mouse the moment she arrived. Although she already knew of Mouse’s relationship with Rody, she had always been stuck inseparably with Rody these past few days. As a result, Nedis was completely different from last time. Previously, she had always had a vengeful perception towards Rody because of his previous frivolous actions that day. However, by now, she was already infatuated with Rody. But Rody did not seem to have any interest in her. </p><br/><p>Nedis was a proud and arrogant woman. When Rody did not respond to her, she too did not profess her love to Rody. However, when she saw Rody and Mouse embracing each other, an ache arose in her heart. </p><br/><p>At this moment, Nobunaga had already mobilized his soldiers and horses as they quietly moved towards Mouse. </p><br/><p>When they were about ten meters away from Mouse, Nobunaga pressed his legs on both sides of his horse and charged towards Mouse. </p><br/><p>Nobunaga pointed his katana forward like a short spear, with its tip pointing straight towards the back of Mouse’s waist. </p><br/><p>Mouse had not realized this and continued to bask in the warmth of Rody’s body. </p><br/><p>Rody had long felt the pressure coming from up ahead. His eyes opened wide as he looked at the tip of Nobunaga’s katana. </p><br/><p>He roared loudly and turned around. His back became completely exposed to the tip of Nobunaga’s katana and his hands also moved quickly to push Mouse away. </p><br/><p>At that moment, Nedis had broken out of her sentimental feelings when she saw the imminent danger. She could not help but shriek in concern. </p><br/><p>Mouse was surprised for a moment when Rody pushed her away. However, she was stunned for only one-tenth of a second before she lifted both her hands as if pushing forward. </p><br/><p>The tip of Nobunaga’s katana had almost reached Rody. During that imminent peril, Rody suddenly roared. </p><br/><p>Nobunaga had an expression of disbelief. His blade had clearly felt the elasticity of Rody’s muscles. However, it could not pierce through. On the contrary, his own stomach felt as though a powerful force had boxed him. </p><br/><p>Nedis’ expression of worry and self-reproach did not last long. She saw Nobunaga’s movement stall as though it was hit by a giant hammer and flew away as though he was a broken kite. </p><br/><p>Nobunaga flew back a full thirty meters and heavily crashed on the ground. The once-calm cavalrymen started to panic. They could not understand what had happened since their master had obviously succeeded but was then suddenly thrown through the air by the enemy. Their opponent’s strength seemed to have already become terrifying. </p><br/><p>The moment Nobunaga fell to the ground, a few loyal men immediately dismounted from their horses and helped Nobunaga up as he was lying on the ground with a disbelieving look. Blood that was almost black in color flowed out of the corner of his mouth. </p><br/><p>Mouse became furious. If she had been a little bit slow, Rody would have been injured by Nobunaga. Although Rody had once basked himself in the Mystic Dragon’s blood and was unlikely to be pierced through by a katana, the power from a horse charge would still cause the injured Rody to suffer a powerful blow. </p><br/><p>Mouse once again floated to the air. Like in the earlier attack, she placed her hands in front her chest, muttering some incantations before pushing her hands outward. </p><br/><p>Suddenly, the sky and the earth changed their color. The dark clouds in the sky gathered and rolled as if there was a mighty force standing in the sky. Under the dark clouds came thunder that rolled towards Nobunaga and his soldiers. </p><br/><p>Nobunaga and his men had given up all hope. Their belief of being able of fleeing from the tremendous dark clouds had already long shattered like the illusion it was. </p><br/><p>When the dark clouds were a few meters away from them, it once again formed into a hurricane. It rolled with a dull, rumbling sound. </p><br/><p>When the hurricane reached the cavalry, its shape could no longer be seen. It was completely covered with dust and broken weapons. </p><br/><p>The whistling hurricane trapped the cavalry in the middle... </p><br/><p>There was endless screaming... </p><br/><p>In front of them was the sky covered in red... </p><br/><p>Their faces were filled with expressions of fear and despair... </p><br/><p>Those in that wretched situation could only give up hope. </p><br/><p>By this time, Nobunaga had already been helped up onto a horse by his subordinates. Only he remained calm and roared, \"Retreat!\" </p><br/><p>The cavalry all around started to retreat. They were no longer like well-trained soldiers as they scattered away. </p><br/><p>Nobunaga took a few subordinates with him and rushed through the gaps in the hurricane. He hoped he would get a chance to stay alive. </p><br/><p>Seeing all of this play out in front of him, Rody praised Nobunaga in his heart, 'This person can be considered a great general of this generation. Even in such a situation, he is still trying his best. He did not panic or even try to escape. All of these are not things that come naturally. It is a talent honed from hundreds of dangerous battles!' Although Rody appreciated Nobunaga in his heart, he could not help but feel sad since they were enemies. If they had not been enemies, and he had not yet chosen to help Yukinari, Rody would have chosen to help Nobunaga. </p><br/><p>While Rody thought of all this, the subordinates following Nobunaga had taken advantage of the fact that the hurricane had not yet fully gathered. They found a gap and escaped from the rage of the hurricane. </p><br/><p>After escaping the hurricane, Nobunaga no longer had the energy to reorganize his men. He just shouted to the ones that followed him to run without looking back. In a flash, they escaped far away. </p><br/><p>The remaining ones that did not follow Nobunaga did not have such good luck. They were caught by the powerful hurricane and pulled to the center. For a moment, there were tragic screams. </p><br/><p>Even Yukinari and Nedis could not bear watching this. After all, just like that, thousands of lives were turned to dust and wrecked remains from the majestic force. </p><br/><p>After a long time, the hurricane finally stopped, and the dust settled. The cavalry thrown into the air had fallen as smashed and scattered remains. </p><br/><p>The moment the hurricane stopped, there was a rain of blood. For everyone present there their eyes saw only a crimson hue. </p><br/><p>Soon, the ground was full of the remains of the cavalry. There was not a single intact corpse. There were eyes, limbs and even internal organs. </p><br/><p>Nedis felt dizzy. Although she did not care about these people, she could not bear seeing them die so tragically. </p><br/><p>Yukinari was not thinking about the corpses. He only thought of Nedis who was beside him. Yukinari could smell the aroma from Nedis’ well-endowed body; he could not prevent himself from feeling excited. He saw Nedis looking as though she was about to faint and felt his heart shook. 'This woman is my lucky star. If I could keep her here as my wife, then…' Nedis was not in the condition to deal with this. She did not even notice Yukinari's insolence. Nedis was completely shocked by the sight in front of her and felt nauseous. </p><br/><p>... </p><br/><p>There were no more signs of the cavalry on the battlefield. All of them seemed to have perished from Mouse’ rage. </p><br/><p>At that moment, some of Rody’s strength was restored and he could finally stand up from the ground. </p><br/><p>Nedis looked at the battle scene in front of her and said, \"That scene was so devastating. I am afraid less than one hundred people escaped!\" </p><br/><p>Mouse was still furious but when she turned around to speak to Rody, the coldness in her voice reduced slightly. \"I have already estimated. The leader took ten cavalrymen with him. Besides them, the others that escaped elsewhere is probably less than ten.\" </p><br/><p>Rody had experienced battles more brutal than this one. However, when he saw the devastation and the rivers of blood, he was still unable to bear it. He gave a long sigh and no longer said anything. </p><br/><p>Hideyoshi rushed forward unaware that Yukinari was still fantasizing about Nedis and knelt down. He then said, \"Young Master Yukinari, that traitorous Oda Nobunaga is still alive. It will cause us a major disaster in future.\" </p><br/><p>Yukinari was startled out of his daydream by Hideyoshi. He looked at the kneeling Hideyoshi, unsure of what the man had just said. </p><br/><p>Hideyoshi also knew that Yukinari had not heard his words and added, \"I request Young Master Yukinari to allow me to command the 'Maruyuki' and take Nobunaga’s head!\" </p><br/><p>Although Yukinari was a bungling oaf, he knew that Hideyoshi’s words made sense. If Nobunaga were to rest and recover, he would remain a huge threat. And so, Yukinari imposingly waved his hand and said, \"Alright. I order you to command the 'Maruyuki' and get Nobunaga. I want to see him dead or alive. If you cannot find him, do not come back!\" </p><br/><p>Hideyoshi greeted his teeth and accepted the military order. He thought to himself in his heart, 'Shit! This damn oaf is actually pretending to look wise. He can’t do anything but is first-rate at pretending to be the Shogun. He could even say words like ‘do not come back’!' </p><br/><p>Thinking about it, Hideyoshi was confident about hunting down Nobunaga. How far could a seriously injured person and a few people go? Presumably, he would look for a resting place to escape to. It was because Hideyoshi did not expect Nobunaga to run far that he was willing to take the initiative and requested to pursue and kill Nobunaga. Hideyoshi thought this through and decided to help Yukinari so that he could claim credit. </p><br/><p>Soon after that Hideyoshi took a small group of 'Maruyuki' with him and pursued Nobunaga.</p><br/>\n</div>"}