{"title": "Chapter 317: Rody's Happy Life", "id": 317, "volume": 4, "url": "http://boxnovel.org/masked-knight-chapter-317-rodys-happy-life", "volume_title": "Volume 4", "body": "<h1>Chapter 317: Rody's Happy Life</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 317: Rody's Happy Life</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>The grand wedding of Miss Nicole, the eldest daughter of the Tulip Family, had become the topic of enthusiastic discussion for the common people as well as the aristocrats in the Imperial Capital for a very long time. In addition, several newspapers in the Imperial Capital also published extensive propaganda on this.</p><br/><p>Even members of the royal family also admired the gorgeous wedding and the extent of its lavishness. That was coupled by the strong support of the military force that allowed the most powerful army of the Empire, the 'Wolf Fang' of the 'Lightning God's Whip' to serve as guards of honor. The formidable marshal of the Empire and the great Emperor of the Empire personally acted as host and witness of the marriage. That kind of arrangement could be considered unprecedented and never to be duplicated.</p><br/><p>Of course, in the eyes of some resolute people, they also saw that little bit of subtle differences...</p><br/><p>As everyone knew, regardless whether it was the Roland Continent in the north or the Radiant Empire, people believed in religion. The religious bodies of the two continents were doctrinally different and mutually regarded the other party as blasphemers. However, at least in the Radiant Empire, the Church was still the state religion and had supreme status. Religious rights were even on par with imperial power. Right from the Emperor to aristocrat ministers of the Empire, they were all believers of God.</p><br/><p>However, in that grand wedding, whether it was the great Duke of the Tulip Family or the mysterious Marquis Rody, no one invited the clergymen to be witnesses of the marriage!</p><br/><p>For all followers of the religion, their marriages must be conducted in the church and presided by the clergy. Only then could it be considered as an official ceremony. However, that wedding that affected the political landscape of the Empire actually did not have any participation of the clergy. In fact, they were even not invited to the ceremony!</p><br/><p>Moreover, it was quite obvious that His Excellency Marquis Rody was not a follower of God...The Empire was not without non-believers of God. Generally speaking, the Empire allowed people to be non-believers of God, but at the same time did not allow them to believe in other religions. However, in the aristocratic circle in the Empire, there were very few non-believers of God. Moreover, Marquis Rody, who held such a high position, controlled the military power, and also had the trust of His Majesty, actually did not believe in God. That was simply something unheard of.</p><br/><p>Even His Excellency the Duke of the Tulip Family did not seem to believe in God...The significance of such matter was somewhat thought-provoking.</p><br/><p>After the wedding, the situation in the Empire was very peaceful. News about the northern Roland Continent came in secretly. Of course, all those news were deliberately blocked under the command of the higher authority of the Empire.</p><br/><p>The war in the Roland Continent had started and the Sauron Kingdom became the leader of the alliance of more than a dozen kingdoms of the Roland Continent. They had gathered millions of troops and, together with the Temple's Holy Knights, have had thirteen large and small skirmishes.</p><br/><p>Under the command of General Tiger of the Sauron Kingdom, all of the thirteen military campaigns ended with the defeat of the alliance of kingdoms of the Roland Continent. However, under the command of Tiger, although their huge army suffered certain losses, their strength was not affected. Tiger actually divided the troops of millions into several groups to fight respectively! Such deployment was indeed a very clever move.</p><br/><p>From the combat effectiveness of the troops, regardless of whether it was the Royal Knights of the Sauron Kingdom or the armies of any other kingdoms, they were far from comparable with the elite Holy Knights of the Temple. However, in terms of numbers, there was no doubt that the Temple was at an absolute disadvantage. Tiger had divided the huge army into several groups, but purposely only harassed the enemy and did not give them any chance to make a decisive battle stand. Obviously, he had prepared himself for fighting a war of attrition. At the same time, due to the disadvantage of numbers, the Holy Knights of the Temple were unable to divide their troops...If they were to do so, they would only make their troops, which number only few hundred thousand, weaker and ultimately difficult to avoid the danger of attacks on the reduced numbers.</p><br/><p>The Roland Continent was caught in a stalemate. Although there were occasional reports of the war, both sides also did not achieve a decisive victory.</p><br/><p>In such a moment, the attitude of the Church of the Radiant Empire was somewhat ambiguous.</p><br/><p>Although there were disagreements with the doctrines of the northern Temple, seeing the conflict in the northern Roland Continent between the Temple and the kingdoms, there was a possibility that the Temple would be destroyed. The Church of the Radiant Empire inevitably would have some sympathy.</p><br/><p>Due to the fact that the two continents had always been hostile to each other, it was impossible for the Church to intervene in the affairs of the northern continent. However, at that moment, the status of the Church was inevitably a little awkward. Under the leadership of Pope Corsica VI, the churches in all the cities of the Radiant Empire were significantly busier than in the past.</p><br/><p>Many activities for winning the hearts of the populace had started, such as distributing holy water and disseminating doctrine. Some bishops even personally went out to all parts of the country to preach and to win over the people.</p><br/><p>However, at this point in time, the situation in the Imperial Capital was unsettling.</p><br/><p>All officials of the Empire had remained silent! Historically, every large-scale activity of the Church would be officially coordinated by the imperial government. After all, in the Empire, the Church and the imperial government had always mutually supported each other. However, based on the situation now, it seemed that under the instruction of the Emperor, the officialdom of the Empire stood completely on the sidelines as a spectator and indifferently watched the people from the churches busy running back and forth.</p><br/><p>Thinking of the last court event; thinking of the wedding of the Empire's most important figure in the Tulip Family; that people from the Church were not invited; and that His Excellency the Duke of the Tulip Family was actually not a believer of God...With all those added up, the people could not help wondering.</p><br/><p>\"Let them jump! The higher they jump, the heavier they fall!\" Andy sighed. He just casually put aside those reports on the activities of the Church in various places that were sent to him and then picked up a battlefield report from the northwest.</p><br/><p>General Elliot of the Northwestern Army personally wrote a report on the battlefield. Five days ago, at the Watts Fortress in the Northwest, the Northwestern Army led by General Elliot, once again, thwarted the army of the Great Moon Kingdom led by Reuenthal. That time, the military objective was very successful. General Elliot killed a total of twenty-five thousand grassland cavalry. As in the past, he did not spare any prisoners...All were executed!</p><br/><p>Elliot's iron-fist approach was undoubtedly the most suitable way to deal with those wolves in the grassland. Reuenthal had repeatedly invaded for such a long /time but had always been foiled by Elliot. It was said that the Dragon Plateau had already started to find their losses gradually intolerable!</p><br/><p>The Northwest Army had also suffered huge losses, but the original Northwest Army had been re-established earlier and reorganized and expanded repeatedly. The Empire was almost an endless source of soldiers compared to the grassland where the population was too sparse.</p><br/><p>Andy smiled after reading the battlefield report. He immediately drafted an order and gave it to a chamberlain to send it down.</p><br/><p>\"The Empire is not without talent. However, under the jurisdiction of the original muddleheaded Abbas XI, it would be a wonder if the nation was not subjugated.\" Andy smiled and stretched himself lazily. \"Very true...It is really tiring to be an Emperor. This old man here really cherish those days when I was sleeping all day.\"</p><br/><p>Andy waved his hand to send all the chamberlains in the room away. Only Fatty Sky stayed behind.</p><br/><p>\"Old Skeleton, the damn old Pope has asked to see you three times. You have always refused to see him. Are you not afraid of offending them?\"</p><br/><p>Andy laughed. \"It is because he saw the fate of the Temple in the Roland Continent. He is inevitably somewhat distressed because he is concerned that the same misfortune may befall the Church and wants to repair our relationship. Hmm, the Radiant Empire is not like those kingdoms of the Roland Continent where all the kingdoms are not cooperative. Here, we have a strong and unified empire! Let him wait. It is not the time to sort them out yet.\"</p><br/><p>After pausing for a while, Andy's smile gradually turned treacherous. \"I have ordered all newspapers not to report any activities of the Church! They wish to win over the people, very good, ah. Just let them struggle slowly with it. I will not allow them to get the people's attention! I have already ordered all the newspapers in the Empire to give full coverage of Rody's recent wedding. After the news of the wedding has quieted down, give full coverage of the war in the northwest! Coincidentally, Elliot has won the war again! Hmm, the Church! They have gone to such great lengths and put in so much effort, but they could not catch the public's attention! It is like throwing a stone into the water. I purposely made sure that there would not be any splash at all!\"</p><br/><p>Fatty lowered his head and thought for a moment. Suddenly, he said, \"Right now, you have been staying out of this matter. Are you waiting for an opportunity?\"</p><br/><p>Andy nodded. \"Yes, I have waited for so long. I think those vampires should also have noticed something, right? I have made it clear when I drew the boundary with the Church. Those vampires must be very happy now. They will seize the opportunity to attack the Church. Let them fight it out. Anyway, I live in the palace now and will pretend that I did not see anything.\"</p><br/><p>Fatty sighed. \"Damn you old man. You are always thinking of these ruinous activities all day. I see …\"</p><br/><p>Andy shook his head. \"This is nothing. Some days later, there will be even better shows to see! By the way, how is Princess Ruolan these days? I am afraid she has gone crazy, getting stuck in captivity.\"</p><br/><p>Fatty immediately revealed a bit of a smile. \"That chubby girl has a bit of talent. I taught her a few tricks and she actually was not a slow learner. Now I do not have to bother with her. Every day, she would hide in the secret room to practice...This person is somewhat interesting. She actually has quite a bit of the charm that I had when I was young. Even the Fighting Energy Style that I created...She actually mastered it faster than I did then...\"</p><br/><p>...</p><br/><p>In the fief of the Tulip Family of the Empire, at the outskirts of West Hill of the capital city of Westwood Province was the Tulip Family hunting ground.</p><br/><p>\"Rody, hurry up! There!\" Diane stood on a branch of a tree, carrying a bow and excitedly pointing at the distance.</p><br/><p>Hearing the shouts of people, a wild fox vigilantly pricked its ears, whizzed into the underbrush and channeled into it.</p><br/><p>Swish!</p><br/><p>As an air-splitting sound broke out, a sharp arrow bored right into the body of the fleeing wild fox. The beast rolled on the spot twice, then it immediately collapsed and started to twitch.</p><br/><p>After a long howl, a gray shadow channeled through like lightning. A huge three-eyed gray wolf had channeled over and bit that wild fox in the mouth. Straightaway, it bit off a piece.</p><br/><p>\"How dare you!\" Diane jumped down from the tree. She pulled out a whistle and fiercely blew it. That three-eyed wolf immediately trembled, shrunk into a mass and buried its head in the ground whimpering. Diane mercilessly flayed it twice with her whip before stopping.</p><br/><p>\"Enough, Diane, enough.\" Rody was riding on a black warhorse. He had already put down the bow in his hand as he slowly approached from behind.</p><br/><p>He wore a simple warrior outfit. His blue hair was ingeniously pleated into a whip and draped at the back of his head. It was not known whether that was the handiwork of Nicole or Myka.</p><br/><p>\"Not enough! This guy is always not obedient. I must teach it a good lesson.\" Diane kicked again before she stopped.</p><br/><p>Rody sat on his horse not knowing whether to cry or to laugh. He also did understand how a woman thought. That monster was a captured beast—he had not expected Diane to actually treat it as a pet.</p><br/><p>Diane was a beautiful girl, but it was not easy to be her pet. It was ridiculous that Diane was determined to raise that three-eyed wolf to become the first vegetarian wolf in the history! The three-eyed wolf had not eaten meat for a long time, so naturally, it could not help itself when it saw the prey. Although Rody pitied the wolf, he would not because that beast had provoked that girl, Diane. He could only look sympathetically at the whimpering wretched wolf and keep his mouth shut, not saying anything.</p><br/><p>Rody whistled and a night owl flew down from the branch of a tree. The owl was also originally one of the beasts they had snatched from the vampires.</p><br/><p>Rody tidied up the prey hanging on the horse. Together with Diane, they went towards the lake in the middle of the hunting ground.</p><br/><p>At the lakeside, a simple camp had already been set up. A few fine horses were quietly feeding on grass at the side. Myka and Nicole had already laid out the barbecue grill.</p><br/><p>Mouse was sitting by the lakeside alone with her eyes closed, meditating and practicing magic power. In the previous few days, her strength had gradually restored. Although the progress was a little slow, she meditated and practiced magic every day. One fine day, she would be able to restore her powers to the level of the original Black Veil Saint.</p><br/><p>They heard a 'plop' sound and a person jumped out of the lake. It was the bodyguard, Randt. His whole body was soaked and he had two big fish in his hands.</p><br/><p>He strode onto the shore. He gathered his fighting energy and, in a moment, his wet clothes were completely dry. Myka had already taken over the fish and proceeded to prepare them.</p><br/><p>When Rody looked at that scene, he couldn’t help but wonder, \"Isn't this lake without fishes?\"</p><br/><p>Nicole looked up and smiled. \"Originally, there were none. But after we left last time, I got some people to channel a lot of fry from the surrounding lakes and rivers. After all these days, the lake is now full of fishes and shrimps.\"</p><br/><p>Rody gave a wry smile. \"If you want to eat fish, just bring some directly from outside. Why do you need to go through so much trouble?\"</p><br/><p>Nicole smiled and stood up. She pulled Rody over and whispered, \"It is more fun to catch our own. Otherwise, it is very easy if you just want to eat fish.\"</p><br/><p>Diane had already thrown the prey hanging on the horseback over and Randt caught them, one after another. Immediately, his longsword flashed with a cold light and, within a short while, the preys had been skinned.</p><br/><p>The group chatted and laughed, as they prepared the food in a confusing manner. On normal days all of them were waited on by servants, so naturally, they were not used to any kind of kitchen work. It was not until the sun set before they finally finished preparing dinner.</p><br/><p>Since Rody's wedding, he took everyone and left the Imperial Capital to come to Westwood Province. He had a carefree and unfettered time here, with nothing eventful every day. He spent all his time with his lovers and was also very happy. He really wished to retire in that forest mountain, no longer caught in the messy matters outside.</p><br/><p>He saw Mouse finally open her eyes, stand up and walk towards them. Rody pulled her hand and whispered, \"How are things?\"</p><br/><p>Mouse smiled faintly. \"It was quite alright. In the beginning, the progress was a little slow, but these past two days, it was much better.\"</p><br/><p>After she finished, she gently raised her hand and with her fingertips turned out a bunch of small flames. She smiled and said, \"Look.\"</p><br/><p>Beside her, Nicole enviously said, \"Well, truly a Black Veil Saint. Although I am a high-level sorcerer, to use the magic of fire, somehow I would need to first recite some incantation. It is very different from your relaxed style.\"</p><br/><p>Mouse blinked her eyes, smiled and said, \"You wish to learn sorcery. I will teach you.\"</p><br/><p>Nicole shook her head and smiled, \"Let's forget it. My innate sorcery skill differs greatly from yours. Even if I were to practice, I will absolutely not reach your level. It is still better for you to practice properly. In future, if something happens, only you can help Rody. \"</p><br/><p>Randt handed over a leather bag filled with fine wine. Rody lifted his head and drank a few mouthfuls. Excitement had completely filled him. He smiled and said, \"It has been a long time ever since I had such a carefree feeling. Perhaps it is better to stay here tonight and not go back.\"</p><br/><p>Next to him was Myka, who smiled and whispered, \"If you wish to stay, then let's stay.\"</p><br/><p>After she finished speaking, she took out a little harp. She gently fiddled a few times with her slender fingers and, immediately, a stream of wonderful musical notes flowed from her fingers. Myka gently opened her lips and started singing softly.</p><br/><p>Everyone stopped whatever they were doing and looked at Myka. Myka's voice was pleasant. Accompanied by the evening breeze, it intoxicated the people who listened to it.</p><br/><p>When the song had ended, everyone was still reflecting, but Diane suddenly shouted, \"Really infuriating!\"</p><br/><p>Myka gave her a glance and held back her laughter, \"Why are you mad again?</p><br/><p>Diane frowned and said, \"Miss Nicole is so refined, beautiful and open-minded. Myka has unparalleled talent in singing and dancing. Mouse excels in magic. Except for me, I am good at nothing!\"</p><br/><p>Nicole smiled slightly and said, \"You have swordsman skills and you are a powerful warrior. As far as this is concerned, we cannot compare with you.\"</p><br/><p>Diane rolled her eyes and said, \"Yes, come, Randt, let's fight!\"</p><br/><p>After saying that, she rolled up her sleeves and pulled out a dagger. She then headed towards Randt for the challenge.</p><br/><p>The tall and sturdy Randt was silent. He did not even dare look at Diane, as if he was a wooden stake standing there.</p><br/><p>Myka pulled Diane, smiling as she said, \"You are actually very smart. Rody is the strongest here. Why don't you challenge him?\"</p><br/><p>Diane covered her mouth and smiled, \"Although I am not smart, I am not stupid either. With my ability, I am only able to bully Randt. How would I dare challenge the master of 'Domain Power'?\"</p><br/><p>Rody sat at one side and just smiled. Looking at the moonlight in the sky, he just felt that life's happiness could not exceed this. He only hoped that this moment could last for a long time.</p><br/><p>In the midst of the jungle, a horse galloped over from the distance. On the horse was an Imperial Guard. That warrior had rushed over, then he jumped off his horse and respectfully said, \"Your Excellency Marquis, something has happened in Westwood Province. Please return immediately…\"</p><br/><p>Rody sighed. He stood up and looked at Nicole and the others. \"What happened again?\"</p><br/>\n</div>"}