{"title": "Chapter 315: New Home", "id": 315, "volume": 4, "url": "http://boxnovel.org/masked-knight-chapter-315-new-home", "volume_title": "Volume 4", "body": "<h1>Chapter 315: New Home</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 315: New Home</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>\"Don’t you mean, destroy this spear?\" Andy asked in an abnormally solemn voice.</p><br/><p>Rody thought for a moment. \"Not exactly.\" He seemed to struggle to find the right words to express his idea, \"I felt that the spear had absorbed a lot of heterogeneous energy. Under this messy mix, I am unable to interact with Master Autumn. Unless...\"</p><br/><p>\"Unless you destroy the spear and then let you have a good search, is it?\" Andy squinted his eyes and shook his head. \"Stupid! You silly boy, what is the Dracula Spear? It is a legendary magic weapon that can even harm God! Do you think it can be easily destroyed? Moreover, it is precisely because of the special characteristics of the spear that enable it to absorb the spirits of those souls! Without this spear as the object that can be attached, the spirits of those wandering souls and Master Autumn would have been long gone! If you were to ruin the spear yet there is nothing like that for Master Autumn to attach his spirit, then...Just think of the consequences yourself!\"</p><br/><p>\"You mean, the soul vanished into thin air and the spirit entirely destroyed!\" Rody's expression changed slightly.</p><br/><p>Andy looked seriously at Rody and slowly nodded his head.</p><br/><p>Rody felt a little terrified. Fatty Sky frowned and said. \"Just now, you actually projected your 'Domain Power'. When did you recover to this extent?</p><br/><p>Rody was alarmed. \"'Domain Power'? Did I project my 'Domain Power' just now? But why did I not feel it myself?\"</p><br/><p>Fatty and the Old Skeleton looked at each other and after that Fatty squinted his eyes. Suddenly, he gave a gentle cry and punched at Rody. Rody was taken aback. He dodged backward by reflex. Seven weird forces suddenly burst out from the fist of Sky. Boom! Rody was hit by the blast and he crashed into the wall.</p><br/><p>Rody snorted. That smash caused some cracks in the wall. Rody fell to the ground.</p><br/><p>\"He does not seem to have recovered!\" Fatty frowned. Although he punched Rody he was only testing. At that instant, he had already held back ninety percent of his strength and did not injure Rody.</p><br/><p>Rody stood up from the ground. \"Hey!\" He angrily yelled, \"Fatty, what are you doing?\"</p><br/><p>Andy dragged Rody and then looked up and down at him carefully. He frowned and whispered, \"Strange, he did not have fighting energy flowing in his body, but just now, very clearly...\" After a short pause, Andy continued, \"Rody, tell me, what were you doing just now?\"</p><br/><p>Rody closed his eyes and pondered for a moment before saying, \"I have sat here for a long time and I am still unable to get any response from inside the spear. I can only try to use different kinds of energy to test. I have tried various methods to apply the energy; sometimes large, sometimes small, sometimes light, sometimes heavy, sometimes straight, sometimes flexed. I have been thinking. This spear can absorb numerous souls so that they are not scattered, then naturally it carries a type of fantastic force inside itself. If I can find out the law of that field of force, then naturally I can find a solution. Tapping the spear, time after time, was me trying to find a way to test the law of that force field.</p><br/><p>Andy squinted and said, \"So, it can be said that, just now, when we approached you, we felt that there was an external force around you. That was...That should be the response given by the spear. That was also the energy of the responding vibration! \"</p><br/><p>Fatty also frowned and said, \"But how could the energy of the response vibration actually be condensed into a weird 'Domain Power'? The force field of the 'Domain'...could it be...\"</p><br/><p>Andy sighed, \"Who else could it be? Of course, it must be Mr. Autumn!</p><br/><p>The three of them were confused. They discussed more for a while, yet they still could not find a solution. Finally, Andy sighed, \"Let's not talk about this matter now. In any case, the spear is now in our hands, as long as we are careful not to let the Church find it. Study it slowly. We will certainly come out with a solution.\" After a short pause, he smiled wryly, \"You better go out first. Nicole, that girl, is so anxious that I am afraid she cannot wait and may send someone to tear down the palace. In addition, that Black Veil little girl, you brought along, also seems extremely anxious.\"</p><br/><p>Fatty also laughed, \"That's true. You better go out first. You have been here for a few days, do you not need to eat?\"</p><br/><p>\"Few days?\" Rody was shocked. \"Has it been a few days already? Why do I feel like I have only worked at it for a while?\"</p><br/><p>The two old monsters looked at each other and revealed a wry smile.</p><br/><p>Previously, the Black Veil Saint had followed Rody into the palace. The day before, after the meeting in the great hall, Rody had gone into the secret room. Naturally, Andy had settled Black Veil Saint inside the palace. The explanation he gave her was that Rody had sealed himself up in cultivation to restore his strength.</p><br/><p>Mouse was originally from the Temple. Therefore, she had experienced a lot of such closed-door matters and naturally familiar with it. However, next to her was, Concubine Ruolan, the person who had always liked to mess up matters. Fortunately, they both had lost their powers and thus did not cause any trouble.</p><br/><p>Rody had not realized it when he was in the secret chamber and it was only after he came out that he found his body was already very weak. He ate a little and then rested for a while before he met Mouse. He also reviewed with her those strange matters pertaining to the spear. Although Mouse had super magical strength, she also, for the time being, could not think of any clue. After that, the three of them prepared to leave the palace.</p><br/><p>\"Well then, go back to your mansion to have a look.\" Andy smiled slightly. \"You will probably like that place?\"</p><br/><p>\"What do you mean?\"</p><br/><p>Fatty smiled and said, \"Kid, you are already a Marquis, now! The Old Skeleton has given you a house. You will certainly like it when you see it.\"</p><br/><p>When Andy saw that Rody was at a loss, he smiled and said, \"Do you still remember Prince Baron? You destroyed his palace. I ordered the reconstruction of a large mansion on that original site and now it is the mansion of Marquis Rody. Now that you have found Seth, the mission of the Duke of Tulip Family has also been completed. We cannot let you continue staying in the mansion of the Duke of Tulip House. Also, kiddo, I did not expect you to have waited in the secret room for so many days. Tomorrow is your wedding day! How can you get married and yet not even have a house?\"</p><br/><p>After hearing the phrase 'Mansion of Marquis', Rody merely nodded his head. However, when he heard the phrase 'Tomorrow is your wedding day',\" he reflexively became startled. \"Tomorrow?\"</p><br/><p>\"Of course, it's tomorrow!\" Andy smirked. \"That day in the great hall, I have already said to bestow you a marriage in three days' time. Tomorrow is the third day! If not for the Empire's custom that the groom and the bride must not meet before the wedding, Nicole would long have rushed into the Palace to look for you!\"</p><br/><p>Rody was surprised yet happy. He also could not help but look at Mouse, who was next to him. From Mouse's eyes, she looked a little bit dejected. Just when he was about to say something, Fatty Sky patted both their shoulders hard and laughed, \"Is the black veil girl jealous? Rest assured. Although Rody, this kid, is a little stupid, he is actually a good person. At worst, next month, he will have another wedding and marry all you girls. Anyway, his Marquis mansion is not too small... Big enough for all to live in.\"</p><br/><p>Fatty had good intentions. However, Princess Ruolan, who was beside him, sneered. \"Nonsense! Miss Mouse, do you still want to continue to follow this heartless man? He will marry another woman tomorrow. Why don't you follow me back to the Roland Continent?\"</p><br/><p>Sky eyes opened wide, \"You, fat pig! Shut up!\"</p><br/><p>With Ruolan's temper, how could she tolerate this kind of words? With a loud hoo-hah, she rushed up to fight with Fatty. Fortunately, Rody held onto him tightly. The two fatties, a man and a woman, glared at each other. Nevertheless, both of them refused to look away.</p><br/><p>Andy laughed cunningly, \"Concubine Ruolan, you came to our Radiant Empire, so you are our distinguished guest. I think it is still better for you to live in the palace for the time being. When the situation in the Sauron Kingdom has stabilized, I will naturally dispatch some men to send you back.\"</p><br/><p>Ruolan looked ferociously at the Emperor of Radiant Empire in front of her. Hateful as she was, she strangely laughed, \"Aha, obviously you kidnapped me and now you are being sarcastic! Now that I am already here, it's up to you whether you want to kill me or whatever!\"</p><br/><p>Fatty Sky really found her intolerable. He went up and knocked Ruolan's head with his palm. He instantly knocked her out as he scolded, \"Where did this woman come from? These past two days, she was extremely annoying!\"</p><br/><p>...</p><br/><p>It had been just a few days after the construction of the new Marquis' mansion started that rumors began in the Imperial Capital that Rody was the Emperor's illegitimate child. So, soon after Andy ordered the construction of Rody's mansion, the officials in charge of this matter built that mansion very luxuriously to please the Emperor. The original residence of Prince Baron was situated very close to the Palace, occupying a large area. The grand residence was built with an imposing style with splendid golden walls. However, the family emblem above the main door gave the officials a little headache.</p><br/><p>In their hearts, Rody was the illegitimate child of the Emperor, but they could not blatantly use the emblem of the royal family. However, Rody himself did not have any family crest. Finally, Andy himself solved that problem. That Old Skeleton brandished his brush. He personally drew a brand new family emblem for Rody…</p><br/><p>A skeleton!</p><br/><p>However, Fatty, who was watching at the side, was obviously not satisfied. He made some changes to the emblem. Finally, he changed it into a skeleton that had an enormous knight's sword inserted into its skull.</p><br/><p>As a result, that emblem shocked the officials responsible for the construction!</p><br/><p>Whichever way you looked at that emblem, it was scary. If that emblem was really engraved above the door, the fear was that, within a short time, it would become the laughingstock of the Imperial Capital.</p><br/><p>Eventually, the final emblem was decided on by Nicole. Everyone had long regarded her as Rody's fiancée and naturally, no one objected to it.</p><br/><p>Nicole finally changed the emblem into a sword within a flame and there was a blooming tulip clearly carved on the sword! And that flame, it was golden!</p><br/><p>In the Radiant Empire, only the emblem of the royal family can be golden in color. After Andy's approval of the emblem, the relationship between that Mr. Rody and the royal family was finally confirmed in the entire Imperial Capital…</p><br/><p>Rody got off the carriage and stood in front of this own mansion. He could not help feeling a little lost.</p><br/><p>From staying in a dilapidated dormitory that had cost him five silver coins per year of rent, he had now turned into the currently-in-favor marquis of the Empire...And all those were obtained not by impersonating as someone else. They were all truly his own!</p><br/><p>In front, the main gate was made from a fiery silver material and the huge family emblem was engraved from a fiery diamond. There was also the row of respectful servants standing in the doorway.</p><br/><p>Rody took a deep breath. His brain was filled with a complex mood. In a daze, he saw inside the door a woman dressed in a white muslin gown slowly walk out. That woman had a cool elegant face, but her eyes were filled with excitement and even more fiery passion. As she stood there, her tender and timid figure seemed to be trembling slightly. If it was not Myka, then who could it be?</p><br/><p>Myka half bit her lips and looked, a little puzzled, at Rody. She saw Rody holding the hand of a black-clothed woman. She felt a little uncomfortable. Originally, the moment she saw Rody, she had wanted to throw herself into his arms, but then she was a little hesitant now.</p><br/><p>Right behind Myka was a woman fully clothed in a fiery red dress. It was Diane. She deliberately sneered and deliberately pushed Myka vigorously. After that, she pretended to say loudly, \"Well! You think about him all day and all night. Now that he has come back, why are you just staring blankly at him?\"</p><br/><p>Rody took a deep breath and gave a warm smile. He looked at Myka and waved at her. Myka also finally smiled. She walked forward a few steps and gently hugged Rody.</p><br/><p>Diane jealously smiled from behind, \"Rody, your new home was organized by Myka, personally. Everything inside was also selected by Myka personally. These few days, she was so tired that she has lost a lot of weight. You should repay her well!\"</p><br/><p>Myka smiled slightly. She quietly pulled Diane's hand and then stuffed it into Rody's hand. Diane blushed and gently tried to break free. She did not try very hard though and, instead, ended up holding firmly on to Rody's hand and was reluctant to let go.</p><br/><p>Myka then looked at Mouse, smiled and said, \"How do you do? You certainly must be Miss Mouse. My name is Myka.\" After she finished speaking, she pulled Mouse by her hand.</p><br/><p>Mouse was naturally indifferent. Besides Rody, she had never been so close to other people. However, when she looked at that beautiful and attractive Myka in front of her and was being pulled by her soft little hand, she could not refuse. She just, as if in a daze, followed Myka to enter the door...</p><br/><p>…</p><br/><p>At the same time, in the mansion of the Duke of Tulip Family, Miss Nicole was spellbound. Seth, who was carefully standing next to her, laughed and said, \"Well, my dear sister, Rody, that kid, has already left the palace. Didn't someone already announce it just now? Anyway, tomorrow you are going to marry him. For now, there is no need for you to hurry.\"</p><br/><p>Nicole blushed and immediately tensed up. She said coldly, \"Shut up! Your opinion is not needed now!\"</p><br/><p>Seth immediately laughed apologetically and said, \"Well, that's enough. Haven't you tormented me enough for the past two days? You have hit and scolded me. On the first day you saw me, you have already struck me with a lightning magic and almost murdered your brother. If I were to die, where are you going to find someone to replace Rody as the Duke of Tulip Family?\"</p><br/><p>Nicole bit her teeth and hatefully said, \"If I do not teach you properly, only God knows what tricks you will come up with next!\"</p><br/><p>Seth giggled and then he walked over to gently hug Nicole. He casually said, \"Well, sister, tomorrow is your wedding day. It is said that an angry woman will age and turn ugly faster. Now, there are many beautiful women by Rody's side. You must be a little bit cautious, ah!\"</p><br/><p>After saying that, he quickly loosened his hold on Nicole and rushed to one side to escape. Nicole was full of anger as she raised her hand. Shortly after, Seth's miserable screams and flashes of lightning issued from the room...</p><br/>\n</div>"}