{"title": "Chapter 313: Coincidental Loss of Military Power", "id": 313, "volume": 4, "url": "http://boxnovel.org/masked-knight-chapter-313-coincidental-loss-of-military-power", "volume_title": "Volume 4", "body": "<h1>Chapter 313: Coincidental Loss of Military Power</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 313: Coincidental Loss of Military Power</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>The entire hall was shocked.</p><br/><p>\"Your Majesty, I object!\" A military elder rushed to speak. \"Earl...no, Marquis Rody. Although he has served meritoriously for the Empire, he is still young and he is still quite a junior. The Lightning God’s Whip is the Empire’s elite and invincible army! The Marquis’ prestige is not enough to undertake this task!\"</p><br/><p>The military elder was about fifty years old. Rody recognized him. When he was still pretending to be the Duke of the Tulip Family, this elder was the one that had helped him in the hall. Unexpectedly, the situation now had been reversed.</p><br/><p>After he spoke a lot of people also concurred.</p><br/><p>Unexpectedly, Sieg did not speak.</p><br/><p>First of all, Sieg knew Rody capability. He had fought together with Rody during the sneak attack on the Thunderous City. He admired Rody’s strength, courage, insight, and judgment.</p><br/><p>Secondly, Rody was also about to become related to the Tulip Family. Everything would be fine as long as the Lightning God’s Whip belonged to the Tulip Family. The other issues were not important.</p><br/><p>Thirdly, Sieg had visited the Duke’s residence and met Nicole prior to that day’s meeting. She had hinted to him that he must not oppose His Majesty’s decision on that day.</p><br/><p>Although His Majesty’s decision was alarming, Sieg remained silent due to these three reasons. Sieg was a smart person. He knew that this was just a transfer of power from the Duke of the Tulip Family to his brother-in-law. It did not matter as long as it is still in the hands of the Tulip Family. The Duke also had not shown up for a really long time and had also neglected military affairs for too long.</p><br/><p>On top of that, the troops were trained by Sieg himself. If Rody was a disloyal person, he would not be able to do much with Sieg around.</p><br/><p>Sieg also had a faint suspicion in his heart as he looked at the young man. Sieg always had a faint inexplicable feeling. It was as though Rody was an old friend that had gone through trials of life and death together with him. He was unable to understand this feeling.</p><br/><p>Looking at the military men objecting one after another, Andy narrowed his eyes and smiled. \"Everyone, this decision is, in fact, also Seth’s decision. As we all know, the Duke has been recuperating after the war and is unable to deal with military affairs...\"</p><br/><p>\"But there is still General Sieg. If Your Majesty is worried about the military affairs, it is better to allow General Sieg to temporarily command the Lightning God’s Whip until the Duke has finished recuperating!\"</p><br/><p>The military elder objected again.</p><br/><p>The Marquis Garoline could not help but sigh at the side.</p><br/><p>'It seems like His Majesty is determined to push his illegitimate son onto the center stage. He wants to make Rody the heir and first marry him off to the Tulip Family, tying him to the strongest pillar of the Empire, and then dominate military power. Hey, His Majesty really has a good plan.'</p><br/><p>As he was thinking of that Garoline suddenly saw the Emperor looking at him with a wry smile. He realized that His Majesty wanted him to say something.</p><br/><p>Garoline laughed bitterly. 'Looks like I have to play the villain again.' He coughed gently and immediately gained the attention of the rest of the hall.</p><br/><p>The military elders frowned. They all knew that Garoline was not a good person. Garoline had always helped the Emperor to face off the military and the Tulip Family.</p><br/><p>\"Your Majesty, I think your decision is correct!\" Garoline smiled and said, \"Although Marquis Rody is young, he has experienced fighting in a recent holy crusade and also experienced acting as an envoy of the Roland Continent. It is clear that his abilities are outstanding. In addition, he has served under the Duke. Therefore, he must also be very familiar with commanding the military. As for status…finally, regarding his status and position, how could being a Marquis and the brother-in-law of the Duke of the Tulip Family be insufficient for him to become the Commander of the army?\"</p><br/><p>\"But…it is not an ordinary army! This is the Empire’s most powerful army, the Lightning God’s Whip! It is the backbone of the Empire’s military!\" an old general from the military immediately objected.</p><br/><p>\"Enough,\" Andy said in a timely manner. He continued, \"This decision is, in fact, also the Duke’s intentions.\"</p><br/><p>'The Duke’s intentions?'</p><br/><p>The military elders glanced at each other. Though they were somewhat skeptical, their voices had started to lower.</p><br/><p>\"Your Majesty!\" Finally, one diehard opened his mouth. \"I still feel that this is wrong…\"</p><br/><p>\"Oh? What, then, do you suggest?\" Andy asked with a smile and without any anger.</p><br/><p>\"I believe that Marquis Rody is young and promising. However, the Commander of the Lightning God’s Whip is an important position that cannot be changed so easily. The Duke of the Tulip Family now commands the Central Cavalry and has earned the support of the soldiers. This prestige is something Marquis Rody would be unable to match. Changing the commander like this may cause the soldier’s morale to be unstable. If Your Majesty insists on advancing Marquis Rody’s career, you may wish to find him a more suitable different military post.\"</p><br/><p>Andy gave a cunning expression as he looked at the others. \"Do the rest of you think so as well?\"</p><br/><p>\"Yes!\"</p><br/><p>\"What about Marquis Garoline?\" Andy looked at the old fox again and asked.</p><br/><p>Garoline thought for a long time but also felt that Rody was being promoted too quickly. He laughed and said, \"I have no opinion. Your Majesty should decide as you please.\"</p><br/><p>Andy laughed. The laughter made Rody shudder. Every time Andy laughed like this, someone would be met with misfortune.</p><br/><p>\"In that case, I will revoke this command…\" The military elders sighed in relief. However, Andy suddenly said, \"However, it is not suitable for Marquis Rody to remain as an Imperial Guard. I have decided to dispatch him to a localized army…He has just returned from the Roland Continent so he should be most familiar with the situation over there...Let us do it like this. Milo has been in the Northern Legion long enough. Let him return to the capital to give his report to the Central and then assume responsibilities there. The position of Commander of the Northern Legion is given to Marquis Rody! That is all!\"</p><br/><p>As soon as these words were said, the military elders showed a weird smile as though they were forcibly holding back their laughter. They were all looking at Garoline maliciously.</p><br/><p>Garoline was shocked and angry. The Emperor’s action is clearly to remove military power from his family.</p><br/><p>'But…is it possible to argue?'</p><br/><p>'Letting his nephew and the potential future Emperor compete for military leadership? What a joke! Unless my entire family is looking for a disaster.'</p><br/><p>The military elders did not expect the change in the Emperor's proposal to make such a huge difference. They felt happy seeing the Emperor playing tricks on that thorn in their sides and loudly agreed.</p><br/><p>Garoline was angry but he did not dare to show it on his face and could only nod his head in agreement.</p><br/><p>Sieg squinted and looked at the Emperor. He suddenly remembered the Emperor giving him the order that instead of withdrawing totally, to leave twenty thousand of the Lightning God’s Whip behind, at the Thunderous City, to assist the Northern Legion in managing a large number of prisoners after the war. Now, the profound meaning of that action became obvious.</p><br/><p>'His Majesty the Emperor had long wanted to relieve the military power from the Marquis Garoline’s family! Everything has already been planned. If the Marquis and the Northern Legion dared to defy his commands … heh, heh, there would be twenty thousand of the elite Lightning God’s Whip to control the situation!'</p><br/><p>Once the meeting ended, Andy instructed Rody to remain behind for a private talk while the rest left the place.</p><br/><p>The military elders now saw Rody in a good light as they had finally put Garoline in his place. They gave Rody words of support before leaving. Finally, Sieg also came to see Rody. With a kind smile, he said, \"Rody, congratulations.\"</p><br/><p>Rody looked at his old comrade who had been with him ever since he enlisted in the army. His warmed up and held out his hand to Sieg as he laughed. \"General Sieg. I will be relying on you in the North.\"</p><br/><p>Sieg held Rody’s hand and felt a strange familiarity. He then laughed. \"You are about to become a part of the Tulip Family. May you bring more glory to the Tulip Family’s banner.\"</p><br/><p>The two of them then shook hands and bid each other farewell.</p><br/><p>...</p><br/><p>\"What the hell were you doing?\" Rody immediately asked loudly the moment he followed Andy to a secret room in the palace.</p><br/><p>\"Boy, you don't need to complain.\" Andy lay on his chair and laughed lazily. \"I gave you a pleasant task. Aren’t you satisfied?\"</p><br/><p>Rody was vigilant as he replied, \"Pleasant task? I think it is more of you having a different intention. The civil war on the Roland Continent has begun and you are sending me to the north. Are you going to take advantage of the war to send the army across the ocean?\"</p><br/><p>\"I do not have that in mind.\" Andy shook his head. \"I am simply taking advantage of this opportunity to take away the military power from Garoline. That old man is an expert in administration. Unfortunately, his ambition is a little wild. Taking away military power from their family would also make them work more honestly in future and not think of useless things.\"</p><br/><p>Rody nodded and finally believed Andy.</p><br/><p>Sky then came in through the door and laughed when he saw Rody. \"Rody, you are back! You still have all your body parts with you?\"</p><br/><p>Rody looked at Sky angrily and said, \"Thanks to your help, I almost died by you messing around with the Divine Primordial Spirit!\"</p><br/><p>\"Aha!\" Sky scolded, \"I simply had good intentions. Can’t you tell the difference between good and bad?\"</p><br/><p>The three had a friendly banter for a while. Rody told them all the interesting news about the Roland Continent such as the secrets of the Temple, the secrets of the royalty of the Sauron Kingdom, and Prometheus’ identity. These things could not be revealed at the meeting earlier.</p><br/><p>When Sky was summoned earlier, there was not enough time to talk about these things. At that moment, Rody finally explained everything.</p><br/><p>Andy finally frowned. \"Kara…Dragons…Putting these two things together is really a headache.\"</p><br/><p>Rody sighed. \"Although Kara still lives, he has not yet obtained the Divine Primordial Spirit. He is also seriously injured and will not recover so quickly. The dragon Paladins are all dead. The self-proclaimed Dragon God is just one of the Mystic Dragon’s son and I have killed him. The remaining dragons should not be anything for us to worry about. After all, these things only concern the Roland Continent. Right now, we cannot do anything about it...\"</p><br/><p>Andy smiled slightly. \"That is not necessarily true.\" He laughed cunningly. \"I think that Kara is not such a simple person. With the God’s Record around it is even more complicated.\"</p><br/><p>Rody sighed. \"I have been puzzled about the God’s Record for a long time. In the memories I saw from the Mystic Dragon’s son, the ancient humans and dragons were different from the current entities. I feel that this is connected to the God’s Record.\"</p><br/><p>Andy shook his head. \"For now, let's not think about this. We can discuss this again at leisure when there is time.\"</p><br/><p>Rody nodded and replied. \"Yes. On my return, I saw a lot of Flame Warriors in the Imperial Capital. What happened? Why did the Church suddenly mobilize so many Flame Warriors to the capital?\"</p><br/><p>Andy looked at Sky. Sky then laughed and said, \"Boy, do you still remember me telling you that I have a surprise to give you when you come back?\"</p><br/><p>\"What?\"</p><br/><p>Andy nodded and created a magical barrier that isolated everything in the room including the fluctuation of energy. He walked to the back of the secret room and took out a long narrow box.</p><br/><p>The box seemed to be made from an unknown magical material and had a luster to it.</p><br/><p>\"This box can keep the aura of the thing inside from emitting out. It is something from the Church. You will know what it is when you see it.\"</p><br/><p>Rody was curious and slowly opened the box. He immediately felt an extremely strong and dark aura emitting from inside. It had a cold and murderous aura.</p><br/><p>A dark aura filled the box and a cold light flickered, revealing the contents.</p><br/><p>\"The Dracula’s Spear!\" Rody exclaimed. \"How did you steal it? When did you steal it?\"</p><br/><p>Sky laughed. \"This? I must thank those vampires…\"</p><br/>\n</div>"}