{"title": "Chapter 319: Show of Authority (1)", "id": 319, "volume": 4, "url": "http://boxnovel.org/masked-knight-chapter-319-show-of-authority-1", "volume_title": "Volume 4", "body": "<h1>Chapter 319: Show of Authority (1)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 319: Show of Authority (1)</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Rody had just arrived at the Tulip’s mansion, but Nicole had already come running out to him, her brows drawn together and there was a worried look on her face.</p><br/><p>\"Rody, I’ve heard that you asked your men to besiege the church? You’ve held the clergies captivity in the church?\"</p><br/><p>Rody smiled.</p><br/><p>\"But isn’t it way out of line to do so? After all, the Empire has never besieged a church and imprison the people of the church for centuries! Even during the coup in the era of the Great Emperor Abbas, nobody dared to be disrespectful of the church.\"</p><br/><p>Rody thought carefully and replied with a smile, \"Don’t worry, it will be fine. Someone will be more than happy to see me do this...\" He paused before mumbling to himself, \"I’m afraid the old rascal has predicted that I will help him fan up the flames of trouble, which is why he sent his men here to create trouble in West Hill instead of other places.\"</p><br/><p>After explaining in detail to Nicole to lessen her worry, Rody went in to change and had some food. Although Nicole was comforted by Rody, she still seemed a bit heavy-hearted. On the contrary, Diane, who could not care less, said, \"Those rascals from the Church, what’s the big deal about imprisoning them? If it was me, I would have stabbed each and every one of them with a sword!\"</p><br/><p>Rody could not hold back his laughter, but he immediately remembered that Diane was from the Silver Moon Tribe, which meant she was the true descendant of Kara. The Church was their absolute enemy, as they had exterminated her entire tribe and kingdom.</p><br/><p>After drinking Myka’s concoction of oriental flavor tea, Rody walked into one of the studies in the mansion. He soon sent someone to bring over the old man who was the representative of the villagers.</p><br/><p>The old man had arrived at the Tulip’s mansion moments ago and had been waiting outside all the while. As he entered, he tried to maintain his composure to look calm, but his eyes wandered around.</p><br/><p>Rody chuckled and said, \"Please have a sit. I've always respected elders.\"</p><br/><p>Rody paused then asked somewhat casually, \"Have those villagers retreated?\"</p><br/><p>\"Marquis Rody, in the face of your commanding presence, nobody in West Hill City dared to defy your orders. You may rest assured since as soon as you left just now, everyone immediately dispersed, and they asked me to thank you for being just!\"</p><br/><p>Rody laughed coldly, \"Being just? I don’t think so.\"</p><br/><p>The old man’s eyes flickered around and flattery remarks spilled out from his mouth. Rody did not interrupt him but listened quietly until he finished talking. Then suddenly, his brows snapped together and an impulsive murderous aura radiated from his body. He roared, \"How dare you!\"</p><br/><p>The old man was startled and he almost fell down from his chair. His voice was trembling as he asked, \"Marquis Rody, what do you mean by that?\"</p><br/><p>Rody’s eyes narrowed. His expression remained calm, but the chilling energy emitted from him caused sweat to trickle from the old man’s forehead.</p><br/><p>\"What’s your name?\"</p><br/><p>\"Uhm...\"</p><br/><p>While he was hesitating, Rody bellowed, \"Speak up! What’s your name?!\"</p><br/><p>\"Old Lennon!\" Rody’s bellow caused the old man to stand up on his feet involuntarily and answered in reflex.</p><br/><p>\"Where are you from?\"</p><br/><p>\"Zolen suburbs of West Hill Province.\"</p><br/><p>\"Age!\"</p><br/><p>\"Fifty-four!\"</p><br/><p>The aura surrounding Rody became more and more intense, and his questions shot out faster and faster. The old man was forced to the verge of suffocation. Rody’s previous questions were of no importance, but he asked his final question in one breath, \"What’s your post in Andy Bulletin?\"</p><br/><p>\"Regional editor contact person…ah!!!\" Before the old man could think deeply, the words slipped from his mouth in reflex. He suddenly shrieked, his face went white and he stared at Rody aghast.</p><br/><p>A smile crept up Rody’s face. He stood up slowly and walked to the old man, giving him a pat on his shoulder. He then said gently, \"All right, you need not be shocked. Since you work for Andy Bulletin, whatever you say here is safe.\"</p><br/><p>The old man’s mouth was wide open, and his voice shook as he said, \"You...you’re a devil!\"</p><br/><p>Rody shook his head and smiled, \"As I said, you don’t have to be afraid.\"</p><br/><p>He sat down again, \"How many of you are in West Hill for this act?\"</p><br/><p>\"What...what act?\"</p><br/><p>Rody smiled lightly and said, \"Of course I’m referring to what you guys have been doing in the towns and villages around West Hill in the past few days! Cheating and igniting anger among civilians, and then framing up the God’s religion, how brilliant!\"</p><br/><p>The old man almost died of fright, and he was unable to utter another word.</p><br/><p>Rody sighed and stared at him. He then said slowly, \"Why, you still don’t trust me? If I wanted to harm you, I wouldn’t have asked my men to besiege the church today! Isn’t this sufficient to reassure you?\"</p><br/><p>The old man hesitated for a moment, the look on his face seemed like he was having some inner struggle. Finally, he replied in a hoarse voice, \"All right, Marquis Rody, what do you want?\"</p><br/><p>Rody shook his head and said slowly, \"You’re wrong. Now it’s not about what I want! But instead, what do you want! Clearly, it’s you, not me, who needs help! I must admit that you’re very cautious and also loyal, but to do such things, it’s not enough to just rely on these. I suppose your men must be hiding somewhere now? But what happened today has blown up. Even though there are no Flame Warriors in West Hill now, once the Church received the news, the Flame Warriors troops would arrive here within three days. At that time, do you think your men can escape from being hunted down by the fierce warriors?\"</p><br/><p>Rody’s smile was serene, \"Okay, I repeat, while in here, you can absolutely trust me! In fact, it was obviously prearranged for you to be sent here and to create trouble at my place.\"</p><br/><p>The room fell into dead silence. After some time, the old man finally sighed and smiled wryly. \"I’m overwhelmed, Marquis Rody. It seems like you really are one of our men...You already knew everything, and if you really wanted to harm us, you would have directly arrested me and sent me to the interrogation chamber. Well, my men are currently hiding in a place not far from West Hill City.\"</p><br/><p>\"How many of you?\"</p><br/><p>\"Eleven, including me.\"</p><br/><p>\"Are there magicians and warriors among you?\"</p><br/><p>\"Two warriors and two magicians, including me. I’m also a magician.\"</p><br/><p>Rody nodded satisfactorily, \"That’s right, only magicians can imitate the Light Series Spells to deceive those civilians. What is your mission? To create trouble and then frame the church?\"</p><br/><p>The old man pondered and replied with a bitter smile, \"As a matter of fact, we don’t really know much, it’s just that we are absolutely loyal to the organization. Our mission is to complete today’s task and the following order was to stay put in West Hill. We were told that there will be further arrangements later on—now it seems like Marquis Rody, you are our next step.\"</p><br/><p>Rody sighed and massaged his temple. He gave him a bitter smile. \"You guys are so good at messing around...Hmm, no, your boss is really good at messing around. He knows very well that I’m off duty, but he deliberately created trouble for me. Humph, is it because there are no Flame Warriors at the Tulip Family’s fief, so he thinks that he can do whatever he like here?\"</p><br/><p>Rody was silent for a moment, his fingers lightly tapping on the table. He finally let out a sigh and said, \"Let’s do it this way. You immediately go fetch all your men and come to the Tulip Mansion tonight. I suggest that you hide here; because even if the Pope comes here personally, he will not dare to search this place. Before the sun sets tonight, I want to see all eleven of you standing here unharmed! And that money that you swindled, and the stolen goods, make sure they are hidden properly! Do you understand?\"</p><br/><p>The old man’s eyes glinted cunningly. He bowed deeply, \"Dear Marquis Rody, please do not worry, my boys have been rigorously trained! Another thing, tonight, can I borrow one of the studies here?\"</p><br/><p>\"Hmm?\"</p><br/><p>\"Hehe, I need to write a detailed report as soon as possible and send it back to the bulletin’s office in the Imperial City. I need to tell the public about the scandal regarding the Church which has happened here!\" An evil smile spread across the old man’s face.</p><br/><p>Rody looked him up and down carefully before waving his hand, \"Okay! After you’ve finished writing let me have a look first, and then...I will dispatch a cavalry to help you deliver it to the Imperial City under the pretense of delivering battlefield report.\"</p><br/><p>\"That’s brilliant, Marquis Rody!\" the old man complimented aptly.</p><br/><p>‘Humph! Old Skeleton, this was already in your plan too, right!’</p><br/><p>Three days later, a troop of two thousand men from the Flame Warriors arrived at the West Hill Province! These Flame Warriors clad in weird uniforms immediately attracted the civilians to gather and watch. The Tulip Family’s fief had never seen any other troops of the Empire for generations, and the civilians were attracted to their weird uniforms. But when the crowd knew that these armed forces were under the command of the church, their gaze gradually became disdainful.</p><br/><p>Someone in the crowd shouted, \"These are the goons of the Church’s bloodsuckers!\"</p><br/><p>The crowd immediately boiled and buzzed.</p><br/><p>\"Stooges! Get out of West Hill!\"</p><br/><p>\"Drive them out!\"</p><br/><p>\"Don’t let them defile the Tulip’s sacred land!\"</p><br/><p>All of a sudden, several eggs and tomatoes shot out from the crowd. This action immediately acted as a reminder to the cursing crowd, and subsequently more objects came flying.</p><br/><p>The Flame Warriors dared not attack the civilians. Moreover, there was a large group of security forces ‘protecting’ them throughout the journey, so they could only cover their heads and scamper around. The face of the chieftain of the Flame Warriors was dark in rage.</p><br/><p>The Church’s sacred Flame Warriors was an army protecting the holy church! They represented the supreme dignity of God’s religion! When did they receive such ‘courteous treatment’ in any other place in the Empire before?</p><br/><p>When they finally broke through the crowd and came to the church of West Hill City, they were stunned by the scene before their eyes!</p><br/><p>Was this still the honorable, supreme holy site where the Gods were worshipped?</p><br/>\n</div>"}