{"title": "Chapter 7 You Can’t See Me? (4)", "id": 7, "volume": 1, "url": "http://boxnovel.org/everyone-else-is-a-returnee-chapter-7-you-can%E2%80%99t-see-me-4", "volume_title": "Volume 1", "body": "<h1>Chapter 7 You Can’t See Me? (4)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>You Can’t See Me? (4)</p><br/><p>While looking at that scene, Yu IlHan was unexpectedly calm. It was because he always thought that a day where this could happen would come.</p><br/><p>Perhaps other people may also have some worry about this in some corner of their hearts. In fact, they may have more resolve than Yu IlHan. They experienced other worlds for the last 10 years. Wouldn’t everyone know well that the Earth is different from before the Great Cataclysm?</p><br/><p>However, they had insufficient preparation. The fighting power to go against the monsters weren’t there no matter how they looked at it, and the levels of the monsters seemed quite high.</p><br/><p>They either judged the situation wrong, or they don’t have the leisure to.</p><br/><p>[Tutorials have already ended. Lord God has already given everything that he can to humanity. Humanity has to survive by itself from now on.]</p><br/><p>Erta’s voice sounded quite distant. From that, Yu IlHan felt that she looked at the scene with different eyes. He was convinced that she wouldn’t help in anyway no matter how much energy she had.</p><br/><p>Unless an unexpected element comes up.</p><br/><p>It seemed like there were no casualties yet. However, lest their eyes fall on the buildings, it was a matter of time before a casualty occurs. Actually, they were slowly coming towards the building, that is, the Business Hall that the students along with Yu IlHan was in.</p><br/><p>“Kyaaaaak!”</p><br/><p>“What should we do? We gotta run!”</p><br/><p>“Everybody calm down. The school has already contacted the……”</p><br/><p>“Who wants to party with me and hunt that!”</p><br/><p>“Here! One more casualty please!” (T/N: Said as if someone’s ordering at a restaurant)</p><br/><p>“Run, f*ck!”</p><br/><p>“F, Finance Hall! Let’s run to the Finance Hall!”</p><br/><p>“Isn’t the roof better!?”</p><br/><p>The students who realized that danger was approaching, ran out the lecture room while screaming. The professor also sighed and followed them.</p><br/><p>As a result, in an instant, Yu IlHan was left alone in the lecture room. If it came to this, it was suspicious whether he had a special skill to become a loner.</p><br/><p>However, he also had no thoughts of sitting there quietly alone in the lecture room.</p><br/><p>Yu IlHan looked over the window again, and sighed shortly.</p><br/><p>And started moving.</p><br/><p>[You’re planning to go, aren’t you?]</p><br/><p>“They look much worse than a sperm whale. Isn’t this a good opportunity?”</p><br/><p>[Monsters are different to animals. Skin…… Well, in their case, carapaces, become abnormally hard, and their motion capacity changes too. However, yes…… There doesn’t seem to be any that goes over 20 so it’s a good opportunity for levelling up.]</p><br/><p>“Yeah. I don’t move it’s dangerous.”</p><br/><p>While muttering in self-mockery, Yu IlHan looked around before approaching a desk and taking out its legs.</p><br/><p>It was insufficient with just one so he pulled out all 4 of them and grabbed one in his hand while tying up the rest after ripping a part of his shirt and tied it around his waist and tightened it. That happened in 10 seconds after he was left alone.</p><br/><p>[……Your handicrafts are neat.]</p><br/><p>“Yeah. I was bored so I played around with some things and I got better at it.”</p><br/><p>[Rita……!]</p><br/><p>The abs that were revealed due to ripping his clothes were truly perfect. His physical body, which was trained to its extreme limits to become the peak of the living, was revealed slightly.</p><br/><p>However it was his own body, so Yu IlHan ran out of the lecture room without reacting to that. At first, he was about to go straight to the square but he soon remembered that he was bare faced.</p><br/><p>“No matter how high my concealment level is, they will recognize me if I stir up the square, right?”</p><br/><p>[A mask is sufficient. It will probably increase the effect of concealment.]</p><br/><p>If it was a mask, he could think up of one.</p><br/><p>The underground stationery store of the Business Hall.</p><br/><p>When his thoughts reached there, he quickly ran towards the stairs and jumped over the railings. He grabbed onto the pillar to slide down to floor B3. He ran to the stationery store and randomly picked an Ir*nm*n mask and put it on his face.</p><br/><p>This was another 10 seconds. It was an inhuman reaction time.</p><br/><p>“Shall we go?”</p><br/><p>He jumped over the stairs to go to the ground floor and came out to the square. Coincidentally, a human sized mantis was in the middle of destroying the spinning door of the Business Hall.</p><br/><p>[Kuiiiiiiiii!]</p><br/><p>“Paha!”</p><br/><p>With a strange shout, Yu IlHan’s body flew across the air. The moment his razor-sharp kick landed on the mantis’s head, its head burst with an unpleasnt ‘puk’ sound. It was a refreshing laughable insta-kill.</p><br/><p>[Experience rises by 800.]</p><br/><p>[You have become level 3. 2 Health, 2 Magic, 3 Strength, 3 Agility increases]</p><br/><p>[You have awakened Close Quarters Combat lv Max. You can evolve it to the next level skill if you have the skill evolution materials.]</p><br/><p>[You have earned the record of Lv13 Big Mantis.]</p><br/><p>Texts that momentarily appear on his retina and disappear – With those, suddenly, a wondrous strength filled his entire body.</p><br/><p>This was level, the system of strength that the creatures in the worlds that have come in contact with the Akashic Records have acquired.</p><br/><p>It was the act of stealing the opponent’s records and even potential by stealing life.</p><br/><p>He felt his muscles gaining strength. The millet-sized lump of mana which was emitting a faint light inside his heart, was very slightly increasing its size.</p><br/><p>This was a truly marvelous and wonderful experience. And the other humans experienced this for 10 years? He felt as if he was dying due to being envious.</p><br/><p>‘But from now, I’m no different.’</p><br/><p>Yu IlHan landed on the ground and slightly smiled. It wasn’t just because he levelled up but because he was satisfied with his first fight with a monster. It was a different feeling from the animals that he hunted for disassembly. It was more fierce and heavy and thrilling.</p><br/><p>The new information and new stimulation that Yu IlHan liked so much, was raising him to new heights. At that moment, Erta spoke with an uninterested voice.</p><br/><p>[Did you open your eyes to the pleasure of violence?]</p><br/><p>“Yes. I will definitely beat you up some time.”</p><br/><p>The square which was full of insect monsters fell into silence again. They didn’t seem to think that their comrade will die so easily.</p><br/><p>However that was brief. The monster’s gazes focused on the human that killed the Big Mantis.</p><br/><p>[Kih!]</p><br/><p>[Kiik kik!]</p><br/><p>[Kuiiiiik!]</p><br/><p>Perhaps because their comradery was strong, even the monsters that attacked other buildings became conscious of Yu IlHan and turned their bodies towards him and showed off their hostility. Their numbers were no less than 40.</p><br/><p>While looking at that, Yu IlHan spoke with a calm voice.</p><br/><p>“Now that I think about it. I didn’t learn how to fight groups.”</p><br/><p>[Just cover it with your body! They can’t kill you with their ability anyway!]</p><br/><p>Using Erta’s words as signal, Yu IlHan dashed out. The insect monsters also moved as if they were waiting for that moment.</p><br/><p>[Kuiiiiiiii!]</p><br/><p>The first one to come at him was a pillbug which rolled itself up to roll towards him! Above it, there was a fly-looking thing that flew towards him while flapping its wings unpleasantly.</p><br/><p>Yu IlHan burst the fly’s head first by throwing the desk leg at it, then he took out another short spear from his waist and smashed it towards the pillbug.</p><br/><p>With a refreshing sound that sounded like splitting watermelons, the pillbug’s carapace burst away. The desk leg was amazingly still holding out.</p><br/><p>[You have earned 700 experience.]</p><br/><p>[You have awakened Spearmanship Lv Max. You can evolve it to the next level skill if you have the skill evolution maetrials.]</p><br/><p>[You have earned the record of Lv11 Big Fly.]</p><br/><p>[You have earned 850 experience.]</p><br/><p>[You have become level 4. 2 Strength, 1 Agility, 1 Health, 1 Magic increases]</p><br/><p>[You have earned the record of Lv14 Big Vulgare.]</p><br/><p>“This is useful!”</p><br/><p>[Above!]</p><br/><p>They were giant mosquitoes seeming like the fly’s comrades. And it was 3 at once! Yu IlHan jumped using the pillbug’s corpse as foothold while clicking his tongue. After snapping the mosquito’s dangerously developed mouth, he swung his short sword to break its head.</p><br/><p>[You have earned 400 experience.]</p><br/><p>[You have earned the record of Lv7 Big Mosquito.]</p><br/><p>At that moment, one of them swiftly went behind Yu IlHan and tried to bite him. Its mouth touched Yu IlHan’s back the moment he realized it, but unfortunately it failed to see Yu IlHan’s back. For a low level mosquito to pierce it, the tough skin had broken its mouth.</p><br/><p>“How dare you!”</p><br/><p>While letting go of the mosquito’s corpse, he jumped backwards and swung his short spear. When the short spear which hit cleanly on the mosquito’s mouth and smashed its head just like that and was shot down, the remaining one came at him with hostile flapping sounds, but even its tube was grabbed by Yu IlHan and could only be swung around.</p><br/><p>[You have earned 300 experience.]</p><br/><p>“Mosquito Strike!” (T/N: Said in English.)</p><br/><p>[Kuiiiiiiiiiiii!]</p><br/><p>Yu IlHan, who landed on the ground while grabbing the mouth of the mosquito, swung it and bullseye’d the giant honeybee that flew at him fiercely.</p><br/><p>The mosquito was killed by the honeybee’s sting, and perhaps a honeybee was just a honeybee even after evolving as the honeybee also died just like that. It was truly a brave death.</p><br/><p>[You have earned 350 experience.]</p><br/><p>[You have earned 580 experience.]</p><br/><p>[You have become level 5. 2 Strength, 1 Agility, 1 Health, 1 Magic increases]</p><br/><p>[You have earned the record of Lv10 Big Honeybee.]</p><br/><p>[To think it would die with its own attack, it seems like it wasn’t perfectly monsterized. But then, what is this level about…… hm……]</p><br/><p>“Fuu, so refreshing!”</p><br/><p>When he turned his gaze while ignoring Erta’s mutterings, coincidentally there was a mantis that looked exactly the same as the mantis he killed first, but just 1.5 times bigger, in front of him.</p><br/><p>Immediately after he recognized that mantis, its scythes which shined dangerously, swooshed at him with no breaks.</p><br/><p>“Tch!”</p><br/><p>Yu IlHan, who limboed the scythe threw the short spear backwards in that position to sever the breath of the fly that flew at him from another direction. And when his 2 hands became free like that, he went and did a back tumbling just like that to distance himself from the big mantis.</p><br/><p>[You have earned 380 experience.]</p><br/><p>[There are monster reinforcements!]</p><br/><p>[Kuiiii!]</p><br/><p>[Kuoooooooooon!]</p><br/><p>Just where did they hide before coming out? Flies, mosquitoes, mantises, pillbugs, centipedes and even cockroaches! He moved his body while clicking his tongue.</p><br/><p>“Heh!”</p><br/><p>[Kuik!]</p><br/><p>He grabbed the two remaining short spears in both of his hands and swung it without restraint to break open the insects’ heads. The insects that came like a swarm of bees fell powerlessly like mosquitoes in front of mosquito repellent incense.</p><br/><p>[You have earned 700 experience.]</p><br/><p>[You have earned 550 experience.]</p><br/><p>[You have earned 950 experience.]</p><br/><p>[You have become level 6. 1 Strength, 2 Agility, 1 Health, 1 Magic increases]</p><br/><p>The body fluids of the insects soaked him but he didn’t mind. What if they were insects? The important thing now was the fact that those monsters were opponents that Yu IlHan could bring out his techniques from the long time of training!</p><br/><p>Yu Ilhan, who rampaged like a crazy storm inside the monsters was already in a state of half selflessness.</p><br/><p>And when some time passed.</p><br/><p>Something flashed in front of his eyes.</p><br/><p>“Mm?”</p><br/><p>The honeybee which was about to sting him couldn’t even scream before falling onto the ground. When Yu IlHan raised his head, he met his eyes with a woman who held his out towards him, no, to be exact, to the honeybee which collapsed over the countless insect corpses.</p><br/><p>With a woman who was wearing a cheap H*lk mask which was sold in the underground stationery store in Business Hall.</p><br/><p>“No. I’m worse as Ir*nm*an……!”</p><br/><p>[Stop speaking nonsense and kill those monsters!]</p><br/><p>As Erta’s point was truly reasonable, Yu IlHan cleaned out the monsters with effort even while pouting. The woman wearing the H*lk mask also emitted lightning bolts from her hands and attacked the monsters steadily. It was a truly strong destructive power.</p><br/><p>[That’s an unbelievable amount of mana quantity. How can she grow that much in just one day……]</p><br/><p>“Isn’t she levelling up like me?”</p><br/><p>[Oh, it may be like that…… How did you know that mana recovers when you level up?]</p><br/><p>“Because my stamina is recovering every time I level up!”</p><br/><p>When H*lk mask joined the fray, the situation settled down soon. There weren’t many monsters in the first place, and her attacks also had the power to kill monsters in one strike.</p><br/><p>But perhaps the military already knew that monsters invaded the school as not long later, several tens of soldiers on 2.5 ton trucks came. However, the scene they saw wasn’t one a where a square was full of monsters.</p><br/><p>It was a scene where a man wearing an Ir*nm*n mask was splitting the last insect, a centipede, in half with a drop kick.</p><br/><p>“I’m sorry. The f*cking truck couldn’t climb the hill……Whoa!?”</p><br/><p>[You have earned 1,250 experience.]</p><br/><p>[You have become level 7. 1 Strength, 2 Health, 2 Magic increases]</p><br/><p>While splendidly ignoring the soldiers, Yu IlHan muttered as he was fliping the centipede’s corpse.</p><br/><p>“Isn’t there some Jewel of the four souls?”</p><br/><p>[If you mean a magic stone, there is one.]</p><br/><p>“Oh, there really is one?”</p><br/><p>[Didn’t you say you learnt disassembly? For insect monsters, you have to take out the hardest part of the carapace, which became like that due to mana, and the magic stone. I will tell you the parts so do it now.]</p><br/><p>“Okay. Wait a bit.”</p><br/><p>Yu IlHan stepped on the joints of the smallest Big Mantis and pulled out the its scythe. The soldiers who were coming to the square stopped while being frightened after they looked at that scene.</p><br/><p>“Who is that guy? What level is he?”</p><br/><p>“How did he acquire that much strength in just one day?”</p><br/><p>“That was a drop kick!”</p><br/><p>Whatever the others said, Yu IlHan started the first monster disassembly of his life. He couldn’t eat the meat so he threw them away, and as Erta said, he took away the hardest part of the carapace and the magic stone.</p><br/><p>The scythe of the Big Mantis was very sharp, so when it was in the hands of Yu IlHan, a disassembly meister, it sliced apart the monsters’ corpses as it became a peerless sword.</p><br/><p>[You have awakened Disassembly Lv Max]</p><br/><p>The soldiers were obvious and even the H*lk masked woman could only stare at his lively movements dumbfoundedly.</p><br/><p>When they confirmed that all the monsters had disappeared, the people hiding inside the buildings also started crawling out but they also couldn’t approach Yu IlHan.</p><br/><p>“Is this it?”</p><br/><p>While cutting apart the centipede, a small blue stone rolled out. When he picked it up and asked Erta with a small voice, Erta nodded her head.</p><br/><p>[It’s a magic stone. The crystalization of mana. It’s a high efficiency energy and at the same time, the origin of every artifacts.]</p><br/><p>After Yu IlHan wiped it on the grass on the floor and put it in his pocket, he changed his target. Of course as he was a Korean man with manners, he didn’t touch the monsters killed by the H*lk masked woman. The corpses killed by the H*lk mask had unique traces of a burn so it was easy to identify.</p><br/><p>It was not that every monster had a magic stone, and not every one of them had hard carapaces so there were less spoils of war then he thought. There were 8 magic stones with the size of a millet, 3 rice grain-sized ones, 1 soy bean-sized one, and a few carapaces the size of his head.</p><br/><p>“Phew……Whoa.”</p><br/><p>Yu IlHan raised his head like a farmer that just finished working on his field. But from some time, the H*lk masked woman was staring at him. Without moving from the place she appeared at the beginning.</p><br/><p>The people who came out to the square, and the soldiers who came too late, gulped while looking at the confrontation of the two heroes.</p><br/><p>It was the meeting of the two strongest in Seoul, no in the country of Korea as a whole, or perhaps even the whole world. How historical was this scene!?</p><br/><p>“Uh……”</p><br/><p>The H*lk masked woman carefully spoke. It was an unexpectedly calm and unflustered voice.</p><br/><p>“Can you…… disassemble for me?”</p><br/><p>Yu IlHan fell into thought for a brief moment before replying.</p><br/><p>“How much will you give me?”</p><br/><p>It was the first meeting of the dropout and the Empress.</p><br/><p>Author’s notes</p><br/><p>Ah… really, I should cut it off at a suitable point but why do I have so little control…Fuu…</p><br/><p>It’s not that Yu IlHan’s power and the Empress’s power is the same. It’s just that Yu IlHan was too much of an overkill.</p><br/><p>Erta’s blatant bait.</p><br/><p>Apparently, there’s a plot where Ironman gets thrashed by Hulk in the Marvel World.</p><br/><p>The 2.5 ton truck … cannot… climb… the hill……!</p><br/><p>The jewel of 4 souls(Shikon no Tama) is an item that appears in Inuyasha. A centipede monster swallowed it at the beginning of the story.</p><br/><p>Today, I have something to ask of you readers. This chapter is the chapter where Yu IlHan’s first fight occurs. What do the readers think of the fighting scene? No, not about whether the author did good or not, that’s a problem with the author’s ability so let’s put it aside… T^T</p><br/><p>Short, lengthen it.</p><br/><p>Alright, keep it as it is.</p><br/><p>Long, shorten it.</p><br/><p>I would appreciate it if you express your opinions!</p><br/>\n</div>"}