{"title": "Chapter 4 You Can’t See Me? (1)", "id": 4, "volume": 1, "url": "http://boxnovel.org/everyone-else-is-a-returnee-chapter-4-you-can%E2%80%99t-see-me-1", "volume_title": "Volume 1", "body": "<h1>Chapter 4 You Can’t See Me? (1)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>You Can’t See Me? (1)</p><br/><p>The first one to realize that something was wrong was not Rita but Yu IlHan.</p><br/><p>“Something’s moving.”</p><br/><p>[What’s moving?]</p><br/><p>“Your sword.”</p><br/><p>[What? Kyaaaa! No!]</p><br/><p>The sword was trash amongst trash to the current Yu IlHan’s eyes – that sword which he made on his 5th year after picking up the hammer was vigorously vibrating on Rita’s waist.</p><br/><p>Was it only that? The cars on the street, the clothes Yu IlHan was wearing, and others which made up the world was showing movement.</p><br/><p>This meant one thing. The world was returning to the time when time first stopped.</p><br/><p>“They are all the ones that were moved or changed since time stopped on Eart!”</p><br/><p>[Rather than that, do something about this sword.]</p><br/><p>“I’ll make you something better so why don’t you give up on it?”</p><br/><p>[Never!]</p><br/><p>While Rita was flustered and praying while grabbing on to the shabby sword, Yu IlHan’s body finally also moved against his will.</p><br/><p>It wasn’t that his physical body was returning to its former state. It was just that he was moving to the place he was at when he was left out by humanity. With a visual that looked like a flying bird.</p><br/><p>“I can fly!” (T/N: Said in EN)</p><br/><p>[Ah, IlHan, wait! L, Lord God, just a bit! Just give me time to say farewell!]</p><br/><p>Rita who realized the situation after she was focused on the sword, desperately shouted but God didn’t fulfill her request.</p><br/><p>While Yu IlHan’s physical body was flying to the college campus from his home due to the irresistible, huge force, Rita was dragged to the sky due to another type of power. It was strong to the point that she cried from being sad.</p><br/><p>[You took it easy until now but why so suddenly…… You’re going too far, You’re going too far!]</p><br/><p>Rita insulted God while complaining, truly unbefitting of a God’s envoy. The only thing she could do right now was to watch the distant Yu IlHan’s back and pray for his fortune. While tightly embracing the shabby sword.</p><br/><p>‘You left the sword. So I take back the words ‘you’re going too far’.’</p><br/><p>Will there be a time she meets Yu IlHan again? She prayed that they did. She prayed that she will see Yu IlHan after he is free from the clutches of time.</p><br/><p>As soon as possible. Even tomorrow.</p><br/><p>While embracing the hope that she wouldn’t even think about one thousand years ago, when she came to find Yu IlHan, a drop out, Rita slowly closed her eyes. And she realized one thing.</p><br/><p>[In the end, we didn’t even kiss!]</p><br/><p>At the same moment that poor angel Rita was returning, Yu IlHan also dropped in to the campus. Yu IlHan, who was half thrown at the last moment, balanced himself in mid-air and landed in a neat pose to reduce the damage done to him.</p><br/><p>“I have a good feeling”</p><br/><p>Above anything that he experienced in the long years, flying just now was definitely the most interesting. Wasn’t that a clear proof that the boring days had ended? While resolving that he would learn to fly by himself after learning mana, he raised his head.</p><br/><p>And found Rita who was ascending into the skies.</p><br/><p>“Ah.”</p><br/><p>Yu IlHan subconsciously moaned. To think she left like that without any farewell, as expected, was Yu IlHan no more than just an interesting human to Rita? Was he an existence she gained out with only to serve to fill her boredom?</p><br/><p>But that didn’t matter. No matter what, Rita who confronted him was an existence who was kind, pretty and someone who consoled his loneliness. When he thought that he wouldn’t see her again in the future, he felt that his heart was empty.</p><br/><p>Originally, this was normal. He thought that being with her was natural as he was together with her for a long time, but an angel such as Rita coming into contact with an ordinary person like Yu IlHan was, in the first place, an extremely rare case.</p><br/><p>An existence that can never be connected to even in the same space. Didn’t Rita herself name herself a higher existence?</p><br/><p>“A higher existence, eh……”</p><br/><p>Yu IlHan softly muttered to himself and tightened his fists.</p><br/><p>Pile up techniques and knowledge to not lose behind other humans when the Great Cataclysm occurs. This was Yu IlHan’s objective until now.</p><br/><p>However, now, he had a grand, but a firm objective.</p><br/><p>Higher existence, if I become one, then I’ll be able to meet and talk to her again. I will finally be able to stand on the same level as her.</p><br/><p>So I’ll become one. There was nothing that didn’t work out after I put in effort so won’t I be able to become one if I work hard as if I’m about to die? – Yu IlHan resolved himself as such.</p><br/><p>Of course, Yu IlHan didn’t know that forget the same level, he had completely caught her heart to the point that he couldn’t catch any more. It was because he was a virgin who didn’t even hold hands with a woman for more than 1000 years.</p><br/><p>Regardless of whether Yu IlHan resolved or not, the world was returning to its original state. The exploded cars were restored and returned to their original positions, and everything in the world, which was damaged when coming in to contact with Yu IlHan, returned to its former state.</p><br/><p>And that moment was approaching.</p><br/><p>Yu IlHan calmly closed his eyes and waited, like he did in the distant past.</p><br/><p>And when a few hours passed, he felt the world, and himself changing. He knew about his physical body more than anyone else. And a small but a clear changed had occurred to his body.</p><br/><p>A cool, luminous, wondrous, strong energy. When his heart beat, that energy also beat along with his heart as if it was originally like that.</p><br/><p>He didn’t even need to ponder about it. This was mana. A new energy that Earth had come in contact with. The energy that humans adapted to in the 10 years they stayed in other worlds. The energy that Yu IlHan had to adapt to in the future.</p><br/><p>‘Well, I’ll probably be able to do it.’</p><br/><p>He was different to his past self who was a childish college freshman. No, well, the two were on the same point in the time axis, but didn’t he have a history of the countless years of effort, and its achievements?</p><br/><p>He opened his eyes. There were a lot of people inside the campus which was cramped. While making expressions that they were surprised, but nervous as if they were waiting for this.</p><br/><p>People. There were really a lot of people. Due to being too happy, he wanted to scream, but he suppressed it.</p><br/><p>“We really came back after 10 years.”</p><br/><p>“According to their words, we can finally……”</p><br/><p>“Uu, I’m scared.”</p><br/><p>“Hey, I can open the status here too!”</p><br/><p>“Kek, Everything really reset!”</p><br/><p>Screams and exclamations happened here and there. It was at this moment that Yu IlHan felt that something was off.</p><br/><p>The fact that they said that they came back in 10 years was something that Rita said and it was nothing strange. However, weren’t they too familiar with each other? Normally, when people lived separately in other worlds, it was normal to be awkward with each other.</p><br/><p>If not, then what. Doesn’t that mean that everyone here was in the same world!? No, wait, thinking about it, there was no reason to separate the people who were in the same place. And if that’s true…… Wouldn’t they find out that Yu IlHan was left behind!?</p><br/><p>Yu IlHan became nervous and he turned his head even though the ‘people’ he had missed for such a long time were in front of him. However, it was impossible. He was in the center of the square. He could only be found o……</p><br/><p>‘……Eh?’</p><br/><p>Yu IlHan raised his head. However, the people around him only talked to themselves and didn’t spare a glance towards Yu IlHan. No, it seemed like they hadn’t even noticed him.</p><br/><p>Of course, the special situation of just being returned played a role, but they had a good reason to find out about him but as if they had planned beforehand, they were all ignoring him. How was this possible!?</p><br/><p>‘Oh. It was like that wasn’t it?”</p><br/><p>However, after pondering for a bit, Yu IlHan had no choice but to accept the impossible situation.</p><br/><p>He had forgotten due to talking with Rita for so many years, but he had a legendary achievement of being left out during elementary school picnic, middle school training camp, and high school trip.</p><br/><p>Was it only that? Being missed out even if he raised his hand at the very front seat while registration in college happened very often. It was no exaggeration to call him the Phantom Sixth Man.</p><br/><p>And so, there was no way the excited Earthlings could recognize Yu IlHan. Once a loner was forever a loner.</p><br/><p>“Great, I say. Great, you Earthlings……!”</p><br/><p>He even spoke out loud but the people surrounding him didn’t look like they had noticed him at all. For some reason, the returnees he had waited for such a long time had appeared but he cried tears of not from being touched but tears of sadness.</p><br/><p>He really wanted to see Rita who always recognized him. He wanted to become a higher existence as soon as possible. However, before that, he first.</p><br/><p>‘Let’s go back faster than anyone and different to everyone.’</p><br/><p>With drooped shoulders, he left the campus while ignoring the returnees’ cheers, their unease for the future, and their expectations for change. It was none of his business. I hope everyone falls down and have their noses broken – he thought.</p><br/><p>The bus still didn’t run. Well, it was no time for both the bus drivers and the passengers to sit down on the bus. They would probably go home and wait for the official announcement by the government or hurrying to meet their beloved ones after the unavoidable separation.</p><br/><p>In any case, It was Yu IlHan, who could run at tens of kilometers per hour if he ran a bit fast, so he didn’t have the intention to take the bus in the first place. It was no lie that he was faster than anyone. Of course, that was if mana wasn’t taken into account.</p><br/><p>‘She said that mana was an almighty power. It can strengthen the physical body, make it move faster, or generate strong strength.’</p><br/><p>If he remembered the scenes where Rita used magic, he could accept it. Human class would once again be divided into those who can and those who can’t. Unlike humanity who had practiced for 10 years, Yu IllHan awakened to mana just now, so it they were categorized in to mana ability, then he would be placed at the bottom.</p><br/><p>‘What’s so wrong about that? The knowledge and training I piled up is in no way inferior. If 10 years pass, I can grow without having to be envious of anyone.’</p><br/><p>Now that he trained for countless years, he now had such a confidence. Truthfully, even that was under evaluating his personal ability, but he himself didn’t know that. It was because Rita forbid him to say those in order for him to not get ahead of himself.</p><br/><p>‘Oh, yeah. Status.’</p><br/><p>It was his thought just before he arrived at home. Rita said that due to the Great Cataclysm, the Akashic Records had come into contact with Earth and humans gained the right to see some of its records. The other returnees also talked about status and whatnot.</p><br/><p>But how can I see this?</p><br/><p>As soon as he thought that, green texts started popping up in his eyes as if it was being engraved on his retina.</p><br/><p>[Yu IlHan]</p><br/><p>[Human Jobless Lv1]</p><br/><p>[Title – Pancosmic Loner (Concealment becomes passive)]</p><br/><p>[Strength – 72 Agility – 81 Health – 78 Magic – 1]</p><br/><p>[Active Skills – Concealment Lv Max (Evolvable. Skill evolution materials are necessary.)]</p><br/><p>[Passive Skills – Unidentifiable]</p><br/><p>[Dropout bonus was acquired, and distributed]</p><br/><p>[Status rises by 5 when leveling up by 1.]</p><br/><p>“……”</p><br/><p>The thousand years of training was showing its results.</p><br/><p>Author’s notes</p><br/><p>Humanity’s strongest loner! (Bang!)</p><br/><p>It’s obvious but Rita is not a side character so she will come up later. Humanity’s loner MC gets along with angels rather than other humans. Tears are covering my eyes.</p><br/><p>Despite being the beginning, I’m delighted that many people are interested. In some time, if I have enough stockpile, I will release a multiple!!! Please take care of me in the future too!</p><br/><p>PS – There was a big edit. The initial setting was that the status increases were to be reflected in levels, but while answering several readers’ question, and explaining, my thoughts started becoming inconsistent. Conclusion – I edited MC’s level to level 1. I will also mention his in the next chapter’s notes.</p><br/>\n</div>"}