{"title": "Chapter 9 I Hunt Alone (1)", "id": 9, "volume": 1, "url": "http://boxnovel.org/everyone-else-is-a-returnee-chapter-9-i-hunt-alone-1", "volume_title": "Volume 1", "body": "<h1>Chapter 9 I Hunt Alone (1)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>I Hunt Alone (1)</p><br/><p>The day after he exorcized the low level monsters, Friday – That day, Yu IlHan left home to go to college again.</p><br/><p>Despite the fact that there were no lectures on Fridays.</p><br/><p>“You’re going to college, son? Be careful, run away if you see monsters. It would be good if you just rest at home.”</p><br/><p>“Today will be alright. Mom, you stay at home and don’t go out, okay?”</p><br/><p>Yu Ilhan had succeeded in making a blank Friday somehow during his course registration for first year, which he didn’t even remember now, but it was more stifiling for him to stay at home now.</p><br/><p>This was because the only thing he could do at home was to eat popcorn in his room due to his mother receiving a positive bonus on her child-worrying skill due to the 10 years of separation.</p><br/><p>But he also couldn’t tell his worried mother that although he couldn’t use mana, he was so awesomely strong because his body developed to the extreme. The easiest path was to fool his mother, who couldn’t remember her son’s lecture timetable after 10 years, and come outside.</p><br/><p>‘I know how she feels, but…’</p><br/><p>And that was exactly the reason he had to move. To become as strong as possible before dangerous monsters come out, to acquire strong skills and get used to mana, to protect his mother and father and for him to live well.</p><br/><p>“I want to have a workshop. I want a car too.”</p><br/><p>[You need to earn money.]</p><br/><p>“I want to use mana quickly.”</p><br/><p>[You need to level up.]</p><br/><p>“I also want to make a good defensive equipment.”</p><br/><p>[You need to kill strong monsters.]</p><br/><p>That’s right. All conclusions required for him to hunt monsters!</p><br/><p>Therefore Yu IlHan wore a big bag over his shoulders, and was walking with the cloth-wrapped steel spear in his hands. He was looking for monsters himself.</p><br/><p>Of course, although the current Republic of Korea was in the middle of being on guard as if it were a war due to the simultaneous monster incidents, such as the campus monster invasion incident, for Yu IlHan, who even evaded God’s eye before, evading the eyes of the military humans who were unknown whether they were from the Korean military or were idiots, was easy.</p><br/><p>No, even so, it would be alright for one of them to find him, but nobody saw him as if they purposely looked away. It was a sad thing.</p><br/><p>“Can we really find monsters this way?”</p><br/><p>[Are you looking down on me, a higher existence? I will find it even if a slime comes out through a gap on the ceiling air conditioner so believe me.]</p><br/><p>Even with the big talk from the self-claimed monster radar, Erta, he only snorted. At that moment, inside a store he was passing by, he saw a somewhat familiar scene inside the big TV. He automatically stopped his steps and looked at the screen. And when he did, he knew instantly.</p><br/><p>It was the campus of the college he went to. Not only that, the ones rampaging there was the Ir*nm*n mask and the H*lk mask!</p><br/><p>[The government is tracking these people who rescued the people by appearing suddenly on the disaster scene and defeating the monster horde.]</p><br/><p>[The two ability users, who are thought to be related to Sung****kwan university, immediately appeared after the monster horde appeared inside the campus and defeated all the monsters before a casualty occurred and suddenly disappeared. The researchers named these people ‘overbalanced’ ability users, and they are estimating that their mana adaptability was way too high and that they had recovered and raised several skills immediately after the return.]</p><br/><p>You don’t have the qualification to research yet!</p><br/><p>[Disasters are occurring in many parts of the world due to the Great Cataclysm. Many people are expressing their worry at the rapid proliferation of monsters, and are demanding fast countermeasures from the government. The government is aiming to create an elite ability users’ unit with these two ‘overbalanced’ as the center……]</p><br/><p>There was no value to listen to it anymore. He was already annoyed due to not being able to use mana and they called him ‘overbalanced’? If he wanted to follow his temper, he would’ve swung his spear, but when he thought about how he had to listen to a power sermon from Erta after he snapped the swing, the raging anger also calmed down.</p><br/><p>He snorted with a humph and left that place.</p><br/><p>Of course, he wasn’t that honorable to cooperate with the government. The things Yu IlHan had to protect was first himself, then his family.</p><br/><p>In the end, what remained in his head from the news just now was one person.</p><br/><p>“That H*lk mask, she was called Empress, wasn’t she?”</p><br/><p>[Are you interested? Although I didn’t see her face due to the mask, her body figure was exceptional. Well, if the level is high, then she will become pretty due to the racial correction, so it might be worth it to look forward to. Anyway, men are all…]</p><br/><p>“No, I’m not interested in that direction.”</p><br/><p>[Really?]</p><br/><p>“Yes.”</p><br/><p>It was a very Yu IlHan-like rejection, who can’t lie very well.</p><br/><p>Erta thought ‘impotent?’ at that moment when she heard the answer. It was because even in her, an angel’s, view, the charm of the one called Empress was unordinary.</p><br/><p>However, of course Yu IlHan wasn’t impotent. This was something that Yu IlHan himself had questions about: he didn’t feel that much excited even if he saw a very pretty woman or a woman with exceptional body figure. It definitely wasn’t like this from the beginning. Before being left out, it was normal.</p><br/><p>It was the same with the ‘treasure’ that shone brightly behind the screen and not just real women. Worrying for his son who didn’t react no matter how much put his strength into, he could only give it energy after trying many different genres. It was no different now.</p><br/><p>He didn’t think about the reason until now for some reason, but now that he thought about it, he realized the reason instantly.</p><br/><p>“It’s probably because I’m too used to Rita’s looks.”</p><br/><p>[Oh.]</p><br/><p>Erta agreed with a sad voice.</p><br/><p>[It’s probably that. You spent so much time with Rita, a higher existence, so you’re no different from being impotent with human women as a partner……]</p><br/><p>“I’m not impotent, not an impotent!”</p><br/><p>As it was a sensitive topic, Yu IlHan ensured that point. However, the fact that no one glanced his way even though he shouted impotent, impotent in the middle of the street, made him even more miserable.</p><br/><p>He lowered his voice, despite the fact that no one paid attention to him, and spoke to Erta as if emphasizing.</p><br/><p>“The thing I’m talking is about that power. the ability to use mana.”</p><br/><p>[……Oh, as expected. It’s not such a special thing compared to you who can process monsters’s carapaces without mana. The name of ‘Empress’ is truly grand but the reason why God sent humanity to other worlds is to create cases such as that woman.]</p><br/><p>“Except me.”</p><br/><p>[Except you, who can pancosmically hide his presence.]</p><br/><p>Yu IlHan thought that Erta became more eloquent with her words faster than Rita. Even while doing that, he moved was continuously moving his body.</p><br/><p>[Wait. We finally found one. it’s near.]</p><br/><p>At one moment, Erta stopped him. Her solid tone of voice indicated that it wasn’t anything common. Yu IlHan asked carefully with a voice comprable to picking potato chips with his hands.</p><br/><p>“How many?”</p><br/><p>[70].</p><br/><p>I beg your pardon? In his surprise, Yu IlHan was almost about to reply in English.</p><br/><p>[It’s the presencen of a monster horde with a level 35 Direwolf as the head. Not in a dungeon, but on a field.]</p><br/><p>“Do you perhaps remember what you said to me yesterday? You said that high level monsters wouldn’t appear since it’s the initial stages of the Great Cataclysm. Didn’t you say that even if they appeared, it would be in dungeons?”</p><br/><p>[They didn’t fall for the trap. Due to the fact that their intelligence was too high.]</p><br/><p>When Yu IlHan sighed due to the absurdity, Erta sighed even more magnificently than him before speaking.</p><br/><p>[Truthfully, I thought it was strange even yesterday. No matter how I think about it, there’s a problem with a large number of level 10+ monsters appearing.]</p><br/><p>“And you reacted so calmly then.”</p><br/><p>[I didn’t want to show a ripple to a lower existence.]</p><br/><p>Erta’s tone of voice while replying was strangely cold. Was Rita also like this in the past? To Erta, who built a too sturdy and thick wall between them, Yu IlHan became a bit fed up.</p><br/><p>Emphasizing her own position and secretly disdaining her counterpart made her seem like a haughty ojou-sama. He wanted to see Rita’s face, who he was used to like his real sister.</p><br/><p>At that moment Erta spoke as to interrupt his thinking.</p><br/><p>[However, now, I have to request cooperation from you so I will tell you honestly. The current state of Earth is not normal.]</p><br/><p>It seemed as if just speaking while standing still was a waste of time as Erta pulled his hair to indicate him to go in a certain direction. While experiencing the feeling of a giant robot, controlled by a hero, Yu IlHan dashed out while Erta continued speaking.</p><br/><p>[You must already know that during the mass migration of humanity, in other words, during your dropout period, all life forms except humans were left on Earth.]</p><br/><p>“Well, yeah, since I disassembled some of them. Rita was noisy about killing a small number of them.”</p><br/><p>[There was no choice but to do that to match the balance of the world. We can’t be too biased towards humans so…… Anyway, you must also know that they weren’t allowed changes unlike you.]</p><br/><p>“Yeah.”</p><br/><p>[Lord God deemed that that was enough. He had thought that it wouldn’t be a problem even if he left them alone for 10 years before humanity came back.]</p><br/><p>Somehow, Yu IlHan felt that he knew what she wanted to say.</p><br/><p>[However, due to an unknown mistake, the time axis of Earth became very off, and while 10 years passed in other worlds, on Earth, one thousand years had passed.]</p><br/><p>“A thousand years!?”</p><br/><p>And as expected, Yu IlHan was surprised at that part!</p><br/><p>“I thought it was about 150 years!”</p><br/><p>[It was a thousand years.]</p><br/><p>“Not 300 years, 500 years?”</p><br/><p>[Millenium!] (T/N: Spoken in English)</p><br/><p>“Mommy!”</p><br/><p>Regardless of whether Yu IlHan was frightened at the past years, Erta pressed on.</p><br/><p>[Although it is said that they were reset at the point that humanity came back, but it didn’t manage to revert their mentality. It’s a thousand years. If animals, who are suppose to live 10 years, lived for 1000 years without dying, then it would instead be strange that they don’t change. And it happened at the exact moment the restriction on time disappeared, dramatically.]</p><br/><p>“Just the conclusion.”</p><br/><p>[It’s highly possible that the monsters that will appear on Earth will be absurdly strong and intelligent compared to other worlds.]</p><br/><p>“We’re doomed……”</p><br/><p>[We exist for that to not happen.]</p><br/><p>Erta declared. Even Yu IlHan, who felt distant at her arrogant, emotionless words just now, felt that she was cool when she said those words to the point that he felt favourable towards her again.</p><br/><p>[I’ve already reported to heaven, and to tune the balance, everybody is moving. However, it will take time for that to implemented. Yu IlHan, do you have any thoughts in moving quite busily just until then? A suitable reward will be waiting for you if you do.]</p><br/><p>Erta was saying this – Become the human shield until the weapons are prepared.</p><br/><p>Yu IlHan replied while smiling bitterly.</p><br/><p>“It sure sounds painful and difficult.”</p><br/><p>[I won’t deny that.]</p><br/><p>He stopped in his place. And spoke his honest feelings.</p><br/><p>“And so I like it!”</p><br/><p>It was a masochistic thought even when he thought about it, but Yu IlHan liked moving better than spacing out doing nothing. Now that he had lived for countless years, or as Erta said, 1000 years, he had changed like this.</p><br/><p>Moreover, he even thought to be enthusiastic if it was approaching the unknown that no one had experienced.</p><br/><p>If he didn’t die.</p><br/><p>“If I think I’m about to die, I will run away, though.”</p><br/><p>[There’s no way you will die. You are underevaluating your own ability.]</p><br/><p>Erta snorted. She already saw a fragment of Yu IlHan’s ability. Yesterday, she saw his overwhelming fighting ability against multiple monsters, she saw a scene where he created an artifact worthy of evaluation using monsters’ byproducts,</p><br/><p>and she saw the steel spear that he took out while leaving his house today.</p><br/><p>Erta was meticulously misevaluating him. Level 30 monster? Don’t joke. He wasn’t someone who would struggle with monsters at that level. The power and technique, trained to breach the limits, inside his body was proving that fact!</p><br/><p>[The Monsters will show up soon. And they will bare their fangs to devour humans to reach higher heights. So before that.]</p><br/><p>Yu IlHan’s steps became faster.</p><br/><p>Wwearing the Ir*nm*n mask on his face, he gripped the steel spear, shining under the sunlight, after unwrapping the cloth and stepped out.</p><br/><p>Now, he also felt it. A murderous intent on a different level he felt in the campus!</p><br/><p>Erta shouted.</p><br/><p>[Pull out all their fangs. Oh, Exectutor!] (T/N: Apparently, a TYPE-MOON reference)</p><br/><p>Author’s notes</p><br/><p>There are other executors other than Yu IlHan. It will be explained soon, but just in case you’re curious.</p><br/><p>Truly, what higher existences are doing is basically robbing Peter to pay Paul……!? As many people had guessed, the surpassing existences in this novel are not almighty nor omniscient in any way.</p><br/><p>To think I…I’m impotent!</p><br/><p>Then I will come back tomorrow at 6 PM! Please put it on your reading list/recommend it/comment if you like it! ^^</p><br/>\n</div>"}