{"title": "Chapter 11 I Hunt Alone (3)", "id": 11, "volume": 1, "url": "http://boxnovel.org/everyone-else-is-a-returnee-chapter-11-i-hunt-alone-3", "volume_title": "Volume 1", "body": "<h1>Chapter 11 I Hunt Alone (3)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>I Hunt Alone (3)</p><br/><p>The soldiers drove away the civillians with the excuse that monster might appear again.</p><br/><p>Even if they went to other worlds for 10 years, the civillians couldn’t boast about themselves in front of rifles, right? The people obediently left.</p><br/><p>“Fuu. It’s fortunate that we meet you again like this.”</p><br/><p>How could both of the soldiers that he met two times be both women? He was curious but that was that. He could tell what the soldiers wanted to say to him without asking.</p><br/><p>As for the reply the reply, Yu IlHan had already prepared one.</p><br/><p>“I’ve looked for you a lot. Really, why did you leave when a person was about to speak to you?”</p><br/><p>I didn’t go… I was packing up right in front of you…- he thought.</p><br/><p>“Ha, I wouldn’t be treated like this if I wasn’t wearing a military uniform…… I’m really frustrated. I should just throw all of it away or something.”</p><br/><p>“Second lieutenant. Sungdaein Bolt isn’t listening to your words right now.”</p><br/><p>Yu IlHan moved his hand up to hold the spear by the head as he started to dismantle the monster bodies while using it as a knife. It was unbelievably uncomfortable, but he had no choice as the leathers of the wild dogs and the wolves couldn’t be cut without the sharpness of his spear. He could schedule a day to make a knife.</p><br/><p>And for that, too, he needed a personal workspace.</p><br/><p>“Just! Listen when a person’s talking!”</p><br/><p>“I’m not listening. I’m not doing it. I’m not helping.”</p><br/><p>Yu IlHan replied shortly.</p><br/><p>“So you don’t have to say anything.”</p><br/><p>“D, do you perhaps have any feelings against the country or the military……?”</p><br/><p>He didn’t have anything against them. He, too, felt proud when the Korean sports representatives in world-scale competitions achieved good results, and he also believed that there was a value in Korean history and tradition. He never regretted being born Korean.</p><br/><p>It was just that such a sense of belonging to the country cannot direct Yu IlHan’s choices, and his fate. Just that.</p><br/><p>Yu IlHan, who was peeling the wild dogs’ skins in a blink of an eye, questioned whether he really needed to take the wild dogs’ bodies when there were a lot of wolf bodies.</p><br/><p>Due to the level differences, the dogs’ leather, teeth, and bones were obviously weaker than that of the wolf’s. Of course, it was frightening that it had higher defensive stats than steel plate armor.</p><br/><p>“The dog bodies, would you like to buy them? I will dismantle it for you.”</p><br/><p>With Yu IlHan, who changed his attitude as if flipping a hand when a matter came up, even after he said he wouldn’t talk, in front of her, the female second lieutenant was dumbfounded.</p><br/><p>However, the moment that Yu IlHan turned his head while saying that it was fine if they didn’t need them, she came to her senses and shouted urgently.</p><br/><p>“I’ll buy! We’ll buy them!”</p><br/><p>“Then I’ll sell it to you.”</p><br/><p>“If possible the magic stones too……”</p><br/><p>“I won’t sell those.”</p><br/><p>“Yes!……Tch.”</p><br/><p>Yu IlHan bargained with the second lieutenant while he kept dismantling the dogs. The second lieutenant said that she didn’t have the authority to decide and contacted her superiors, and those superiors who learned well that they needed to use the monster’s bodies in the end to go against the monsters, accepted Yu IlHan’s offer right away.</p><br/><p>However, in truth, monsters were appearing in the whole world and not just Korea. Of course, strong monsters, such as the Direwolf that Yu IlHan killed, didn’t appear, but sightings of those as strong as the [Wandering Dog] were quite frequent, and those were in the range of what the K-2, K3, and grenades from the strong Korean military friends could manage.</p><br/><p>But why did they nod their heads when Yu IlHan said that he will sell the bodies? That was because of the state of the bodies.</p><br/><p>The strong friends from the military shoots guns when they meet monsters. Even soldeirs confident in their physical ability would shoot guns.</p><br/><p>Just those at the level of the Wandering Dog would have unbelievably thick skin, so they needed to use several tens of rifile bullets, and sometimes grenades to kill them with no difficulties. As a result, the state of the corpses would normally be horrible to look at.</p><br/><p>The leather would be damaged to the point of being considered trash, and the bones would shatter. So, although it may be possible to use it for research, it would be impossible to use it on its own.</p><br/><p>In contrast, how was the state of the bodies of the Wandering Dogs that Yu IlHan hunted?</p><br/><p>Even otherworlders would raise up their thumbs as they looked at Yu IlHan, who would insta-kill monsters, with the least amount of damage, and call him the best hunter.</p><br/><p>Even that would be a good deal for them, but if his dismantling skills were also accounted for, then they would become speechless. The scene where the intact corpses separated into leather, bones, and meat as if they were like that from the beginning, was passed to the second lieutenant Han YeoRang’s superiors without problems no matter how bad the quality of her phone camera was.</p><br/><p>‘Second lieutenant Han, don’t ever let him go. Drag him here using any means other than violence!’</p><br/><p>“But he says that he will never talk with us.”</p><br/><p>‘Even if you have to use a honey trap, drag him here!’</p><br/><p>The strong friend and ‘beauty’ second lieutenant Han YeoRang, who heard the word ‘honey trap’ for the first time in a real situation since she was born, was in agony. Did she have to quit the military after beating up her superiors, or did she have to take him to the optometrists to check his eyesight…</p><br/><p>“…..I will try to persuade him.”</p><br/><p>In the end, her grass root-sized patriotism and the even smaller soldier’s attitude grabbed a hold of her. However, before Han YeoRang ended the call with an amazingly small voice after killing her emotions, Yu IlHan, who finished dismantling the dogs and was about to go into working with the wolves, spoke.</p><br/><p>“I will exchange in cash so please get it ready.”</p><br/><p>“……So he says, sir.”</p><br/><p>Han YeoRang wanted to cry. This was the tragedy of the middlewoman.</p><br/><p>On another hand, Yu IlHan finished dismantling while humming.</p><br/><p>Unlike yesterday, when he fought with the insect monsters, he had gained more. It was because it was easier to process animal bones and leather in comparison to insect carapaces.</p><br/><p>Of course, the wolf’s bones weren’t metal so it would be impossible to melt them down, but he could recreate them into defensive equipment and weapons according to the innate structure of the bones, and the leather would become good defensive equipment without a doubt. Not only that, he would be able to create other artifacts using the magic stones.</p><br/><p>However, the more important profit were the magic stones. He didn’t know while he was killing, but the leader, the Direwolf, and the vice-leader, the Big Wolf, both had magic stones.</p><br/><p>Moreover, unlike the soybean sized magic stone from the Big Mantis, the Direwolf’s magic stone was about the size of an almond chocoball.</p><br/><p>“It looks quite tasty……”</p><br/><p>[NEVER! A magic stone isn’t something that a human can intake directly! Do you want to be controlled by the monster’s mana!?]</p><br/><p>“Whoa……”</p><br/><p>Yu IlHan, who heard Erta’s sharp warning, voiced his horror.</p><br/><p>Because… Wasn’t this too blatant of a foreshadowing!?</p><br/><p>Yu IlHan, a trained loner, ended up predicting the disaster that her words would bring. Some time in the future, humans would turn into monsters by swallowing magic stones in their greed to become stronger faster, and Yu IlHan would fight against them……</p><br/><p>Yu IlHan could assure himself that this would happen not just once, but many times, as humans are foolish and would repeat the same mistakes.</p><br/><p>He lost all his strength as he already knew that, so Yu IlHan rolled the guiltless magic stones in his hands.</p><br/><p>“The magic stones are sure pretty.”</p><br/><p>“Yeah, well.”</p><br/><p>Excluding the boss and the mid-boss magic stones, the trivial magic stones that Yu IlHan harvested numbered about 20. Han YeoRang gulped when she saw that.</p><br/><p>Combining all of those, it would end up equalling an enormous amount of money even in Guundia, the other world that she had gone to. And as it was one of the key materials to make ‘artifacts’ that everyone wanted, on Earth, its value would multiply by hundreds or thousands of times.</p><br/><p>Of course, it was a different story as to who ccould create such artifacts.</p><br/><p>‘Hmph, what, shall I use a honey trap?’</p><br/><p>While Han YeoRang was thinking idiotic things, Yu IlHan organized the maagic stones and the dismantled wolf bodies. To carry them, he temporarily made a bag using the wolf leather, and he put the leather, bones, and magic stones inside it.</p><br/><p>And when he put all of them inside, what was remaining were the mountains of wolf monster meat.</p><br/><p>“Is this edible?”</p><br/><p>[If you have the weak poison resistance skill.]</p><br/><p>At Erta’s cool headed words, he gave up on the wolf meat. However, when he was about to put the bag on his shoulder, Han YeoRang approached him carefully and asked with pitiful eyes.</p><br/><p>“Can you… sell some mwagic stwones and some of the grey wolf lweather…..?” (T/N: Ask cutely…?)</p><br/><p>“Nope.”</p><br/><p>“Okay.”</p><br/><p>How could he reject so refreshingly? Was he some stiff general in his past life…? (T/N: Actually, this was a pun in Korean. Raws are literally, ‘Was he some danhobak farmer in his past life?’ with danhobak being a pun of danho(being determined))</p><br/><p>Han YeoRang, who spoke with a bit of cuteness, had to step back with tears in her eyes when her charm didn’t work on him. She resolved to beat the soldiers up until they were half dead when they went back.</p><br/><p>At that time, the cash arrived. It was a cash delivery service with a lieutenant colonel-level personnel, and a government personnel attached as bonus.</p><br/><p>Yu IlHan wanted to refund just the bonus, but things didn’t turn out that way. It was said that the Goddess of fortune and the Goddess of misfortune always came in pairs, and it seemed like it was true.</p><br/><p>“You’re really amazing! To think that you killed all those monsters with your strength alone!”</p><br/><p>Nonsense starting with those words were completely chewed by Yu IlHan and he just quietly checked the amount of money. (T/N: chewed is a Korean way of saying ‘ignored’; You can ‘chew’ someones words means you can ignore someone’s words)</p><br/><p>370 million won in total. (≈ 320,000USD)</p><br/><p>His hands trembled lightly. Despite the thousand years of training, he couldn’t not be nervous in front of the enormous sum of money in front of him. It was because despite the fact that he had driven big ships and high-class sports cars, he had yet to steal from banks.</p><br/><p>[No matter how good of a condition that the leather and the bones are in, considering that the Wandering Dogs are less than level 20, this is quite generous. It’s highly possible that they want to leave ties with you.]</p><br/><p>“As expected, it’s like that, right……?”</p><br/><p>Yu IlHan carried the bag on his shoulders. Yu IlHan, who confirmed that their gazes were fixed on the bag with the wolf leather in it, which was incomparbly more valuable than some wild dog, he relaxed and spoke.</p><br/><p>“The exchange is over right? This is my money, right?”</p><br/><p>“Of course it’s yours! However before that, why don’t we tal……”</p><br/><p>“We’ll probably see each other again soon.”</p><br/><p>“Huh?”</p><br/><p>Yu IlHan retorted icily and ran an app after taking out his smartphone. It was an app he downloaded after realizing something yesterday in the campus square.</p><br/><p>The app’s function was very simple. It would flash an enormous amount of light in one moment. After the flash, everyone there, except Yu IlHan himself, closed their eyes for a moment, and opened.</p><br/><p>“Wh, what was that!”</p><br/><p>“He’s not here. He disappeared!”</p><br/><p>“He disappeared in such a short time!? Just how high level is he……!? Just what kind of vision(?) did he acquire in the other world?”(T/N: the raws literally says vision… but I don’t know what it is, may be a reference to an anime or smth)</p><br/><p>“Amazing, Sungdaein Bolt……”</p><br/><p>“No, m*n *n bl*ck……!”</p><br/><p>Of course, there was no need to explain. Yu IlHan was still right in front of them. (T/N: LOL)</p><br/><p>Even though the passive concealment wasn’t active during to the fight, if he distracted their gazes, then the concealment would activate again. What Yu IlHan used was the gap in recognition.</p><br/><p>“Shall we go now?”</p><br/><p>[The time it will take for heaven to move due to my report is one day. I’m sorry but during that time, we’ll need to keep moving. Dangerous monsters would have shown themselves in other places as well.]</p><br/><p>“Okay, okay. Let’s go after leaving this in a safe place. And I need to check that class thing.”</p><br/><p>Yu IlHan left the people who were desperately searching for him and moved his body.</p><br/><p>His long day had only began.</p><br/><p>Author’s notes</p><br/><p>Next chapter, he will get his class! I was trying to shove it in this chapter, but it was too long…</p><br/><p>I should give him a mask full of originality and strip him of the ironman mask……!</p><br/><p>After Yu IlHan’s busy day finishes, in other words, chapter 3 finishes, I can say that the main novel will start. Please look forward to it!</p><br/><p>Translator’s notes</p><br/><p>Disassembly will now be called dismantling… thx guys.</p><br/><p>‘Strong friend’ refers to the military.</p><br/><p>Poor second lieutenant… lol</p><br/><p>What I love about this author is he gives blatant foreshadows… and that the MC knows them!</p><br/><p>Weak poison -&gt; poison -&gt; strong poison (the other two will come up later)</p><br/>\n</div>"}