{"title": "Chapter 29 I Also Go to Dungeons", "id": 29, "volume": 1, "url": "http://boxnovel.org/everyone-else-is-a-returnee-chapter-29-i-also-go-to-dungeons", "volume_title": "Volume 1", "body": "<h1>Chapter 29 I Also Go to Dungeons</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>I Also Go to Dungeons</p><br/><p>Time flew by quickly.</p><br/><p>He wanted to try the pile bunker out quickly, but he still had lots of things to do. Not to mention making Traps of Destruction, there were many other things such as supplementary defensive equipment or supplementary weapons or other things for hunting monsters safely.</p><br/><p>In the end, he stayed in his workshop for more than one month. (T/N: It’s because he does this that others can catch up.)</p><br/><p>[Meticulous Underground Trap of Destruction was completed.]</p><br/><p>[Mana crafting has become level 24. You can make better artifacts with less mana.]</p><br/><p>An unknown time has passed after he became used to making the Traps of Destruction.</p><br/><p>Yu IlHan tilted his head in confusion at the mana crafting process which ended in a blink of an eye compared to when he first did it.</p><br/><p>[It, it has both options again.]</p><br/><p>[We need to change the trap layout. We might end up with an Overflow.]</p><br/><p>Whether the angels panicked or not, Yu IlHan just silently handed the Trap of Destruction over while asking Erta.</p><br/><p>“How many is this now?”</p><br/><p>[17. The plan is… was to make 11 more, but thanks to your ability, it seems that the number will decrease.]</p><br/><p>“Is it because of that Overflow thing that the angels mentioned?”</p><br/><p>[You really are quick witted. Yes, that’s right. It’s becase of Overflow.]</p><br/><p>Overflow. Leak due to going beyond capacity.</p><br/><p>Dungeons? No, the flow of mana characteristic to the Traps of Destruction.</p><br/><p>[The Traps of Destruction that you make are too exceptional. Not only is the scale large, it even increases the effect of the Traps of Destruction already scattered on Earth.]</p><br/><p>“Do you mean that too much is as bad as too little?”</p><br/><p>[if a single Trap of Destruction calls more monsters from a wider range, then eventually, there will be a remnant Trap of Destruction. Let’s say that there is a Trap of Destruction which scatters mana to attract monsters even though there aren’t any. What will happen?]</p><br/><p>“……Do humans get caught up instead of the monsters or something?”</p><br/><p>[Fortunately, no.]</p><br/><p>Erta, who rejected Yu IlHan’s horrifying imagination, spoke while smiling bitterly.</p><br/><p>[Random records of the Akashic Record and the flow of mana in the Traps of Destruction mesh with each other to create new monsters.]</p><br/><p>“I said make it easier to understand.”</p><br/><p>[An awesomely strong boss monster swallows the Trap of Destruction and appears.]</p><br/><p>“Good, much more straightforward.”</p><br/><p>[……I keep having the impression that you’re trying to tame me.]</p><br/><p>“It’s your imagination.”</p><br/><p>At least, he now knew how horrifying Overflows are.</p><br/><p>His honest thoughts wanted to deny confronting 3rd class monsters for a while. He had such a hard time fighting the black leopard which blatantly showed him its weakness due to its speciality being concealment, and if there was one which wasn’t like that…… just imagining it made him horrified.</p><br/><p>[That is why, we will fix the coordinates of the Traps of Destructions to prevent Overflow. After calculating, it seems it will end after just making 8 more.]</p><br/><p>[Haa, really. It’s a problem since only unpredictable things happen on Earth. Erta, please manage that person well.]</p><br/><p>Was it the frequent conflict between colleagues? The moment Yu IlHan thought that, Erta raised one of her hands. In her hands, light gathered to make a sword-like form.</p><br/><p>However, her voice which came out after that was sharper and colder than that sword.</p><br/><p>[You do your mission, Shiuta. Just your mission.]</p><br/><p>[……Okay. I will.]</p><br/><p>When that angel stepped back with a stiff face, Yu IlHan also realized that Erta was currently angry. The other angels seemed to have notice that as well as they chimed in in abusing Shiuta and consoling Erta. Those figures were quite funny. Yu IlHan laughed thinking that what angels did were not much different from what humans did.</p><br/><p>After the chain of disturbance, the angels left holding the Traps of Destruction. Erta, who looked at that, only erased her sword of light after the angels’ presences completely disappeared before shrinking her body.</p><br/><p>Then, she spoke to Yu IlHan who was staying still.</p><br/><p>[To think that we became like this when we have suppose to overcome our emotions……. You really are amazing, Yu IlHan.]</p><br/><p>“Whoa? Why does the sparks spatter to me!?”</p><br/><p>[Isn’t that obvious. Just now, that angels was jealous of you.]</p><br/><p>Hearing her words, he thought that it might be interpreted that way. However, Yu IlHan only made a small smile while picking up the hammer.</p><br/><p>“That’s an honor. Anyway, I don’t plan on getting involved with them if I get my rewards properly.”</p><br/><p>[We’re selecting the rewards at the moment. And amongst them.]</p><br/><p>“Amongst them?”</p><br/><p>[There are two things that I have to tell you beforehand.]</p><br/><p>“What is it? What is it?”</p><br/><p>Yu IlHan’s two eyes started shining. Erta thought that he looked quite cute, but soon, she shook her head and drove that thought out of her head.</p><br/><p>[The first is information.]</p><br/><p>The moment he heard that, Yu IlHan’s expression started becoming rotten.</p><br/><p>“I don’t receive anything other than items.”</p><br/><p>[If you listen, then you will change your mind though?]</p><br/><p>Erta’s confident words made him even more frustrated. However, her following words really did make him change his mind.</p><br/><p>[It’s the information on location of the dungeon where you can acquire a metal which newly appeared on Earth.]</p><br/><p>“Tell me!”</p><br/><p>[I knew you’d say that.]</p><br/><p>How much suffering did he make the steel spear go through? He killed 3rd class monsters with an item used in the middle ages of Earth, so there was no need to describe how much suffering it had gone through.</p><br/><p>Yes, now it was the time to make it rest!</p><br/><p>[The second is a bag.]</p><br/><p>While Yu IlHan was excited, Erta took out an item from her magic inverntory. It was a black leather cross bag which wasn’t big at all.</p><br/><p>“……You want me to carry this around? For fashion?”</p><br/><p>[It’s an item with spatial expansion magic on it. You can put about 1,000 of those pile bunkers over there.]</p><br/><p>The cross bag was a truly small. It didn’t feel like a melon would fit in no matter how much he stretched it, so Yu IlHan carefully asked back.</p><br/><p>“I think it will rip while putting it in, though…….?”</p><br/><p>[I will give you a replacement reward if it’s ripped so please test.]</p><br/><p>He tested.</p><br/><p>It got in.</p><br/><p>Since he was at it, he also tried putting in the leopard hunter’s harpoon set.</p><br/><p>It got in.</p><br/><p>At this rate, even an Elephant would fit in.</p><br/><p>“Ooooooooooooh!”</p><br/><p>[You ‘re like a country bumpkin so stop it.]</p><br/><p>“Erta, I love you!”</p><br/><p>[I, I don’t need such a cheap love!]</p><br/><p>Of course, Yu IlHan wasn’t listening to Erta’s words anymore. Starting off with the Giant’s Rubber String, the leather, and the weapons made from the bones, he seemed to put in shovels, pickaxes and all the equipment in the workshop one by one, and in the end, he only became calm before he put the entire workshop inside.</p><br/><p>Erta looked at his figure with satisfiaction before she warned him as she thought of something.</p><br/><p>[You can take an item inside the bag out with just a thought. However, please be ware in using it. No matter how it has a spatial expansion magic applied on it, there is a limit to its capacity, and there is no weight deduction magic on it.]</p><br/><p>Now that he had heard that, he thought that it became heavier than when there was nothing insdie it. However, since his physical body was enhanced transcendentally, it didn’t even itch for him to carry something around 1 ton.</p><br/><p>The moment he thought that, lightning flashed inside Yu IlHan’s head.</p><br/><p>“Hey, I think I can use this as a weapon! I can just swing it around after stuffing tens of tons inside it!”</p><br/><p>[It’s probably only you in the entire world who can think like that.]</p><br/><p>Now that he had acquired a bag which he can put his ores inside without worry, there was no need to hesitate. Yu IlHan left the worshop just like that.</p><br/><p>Of course he didn’t forget to take the Trap of Destruction he had already made. This was to proceed with mana crafting when the angels came to him after recovery even if he wasn’t at the workshop.</p><br/><p>As the dungeons hadn’t completely been activated, the world was still like this. Human history had stopped since the Great Cataclysm.</p><br/><p>Even in countries where Dungeons took their place properly, there was still the threat of monsters appearing, so the governments were advising to at least acquire 1st class in other worlds before coming back.</p><br/><p>“The streets are surely empty.”</p><br/><p>[Are you reminded of your dropout days?]</p><br/><p>“A little.”</p><br/><p>Yu IlHan spoke and made a small smile.</p><br/><p>“However, it’s different now. Since everything is changing right now.”</p><br/><p>It was different to the time he had to be nervous waiting for the time for humanity to come back. The stopped time was flowing, and people like the Empress who stayed behind on Earth to fight monsters, and the people who earned their strength in other worlds, were all putting in effort. As he knew that, he didn’t feel solitary.</p><br/><p>The place Erta told him was fortunately in Korea. Although it would normally be alright for it to be in a foreign country, state of emergency was passed down in many countries. He couldn’t get on boats nor planes so he might have had to start from building.</p><br/><p>[So you mean that you would have built a ship if it was in a foreign country……]</p><br/><p>He ignored Erta’s words and ran. While running without rest he kept accelerating. While thinking that he would buy a car if the world normalized again.</p><br/><p>Although he could find patrolling police officers, soldiers, and a few ordinary ability users, it was quite meaningless as they couldn’t notice Yu IlHan. He was sad that he wasn’t sad due to becoming used to it.</p><br/><p>[It might be a little sudden.]</p><br/><p>While Yu IlHan approached the vicinity of a nameless hill, Erta suddenly started speaking.</p><br/><p>[Do you know how monsters which weren’t on Earth appear?]</p><br/><p>“Didn’t you say something like they will appear if the concentration of mana reaches a certain point?”</p><br/><p>[That’s the most basic requirement.]</p><br/><p>Erta started off with that and asked Erta.</p><br/><p>[What appears on a discarded bag of rice?]</p><br/><p>“Rice weevils.”</p><br/><p>[In a dirty room with bits of chips scattered around without being cleaned?]</p><br/><p>“Cockroaches.”</p><br/><p>[It’s like that.]</p><br/><p>“I did understand but you do really choose the worst examples.”</p><br/><p>She probably wanted to say that monsters are generated in an environment most suitable for them to live. Although rice weevils and cockroaches only crawl inside the environments suitable for them, well, the image wasn’t that different.</p><br/><p>Yu IlHan asked her while ignoring the mountain path and jumping up using rocks and trees.</p><br/><p>“But why are you speaking about that so suddenly? There are no new monsters on Earth though.”</p><br/><p>[No, they did appear.]</p><br/><p>“Huh? What did you say?”</p><br/><p>[Huh?]</p><br/><p>Erta tilted her head and spoke.</p><br/><p>[Not only not all mosnters are categorized as ‘life form’…… For you to acquire a new metal you will need to kill the monsters living inside the dungeon you will be entering and extract their heart.]</p><br/><p>“Huh? What did you say?”(T/N: Eh? Nandatte?(Haganai reference))</p><br/><p>[You did hear it properly.]</p><br/><p>Although he pretended to be deaf, it didn’t work on Erta. Fuck, I should have realized when she only spoke he could ‘acquire’ a new metal without mentioning any mining!</p><br/><p>The moment after Yu IlHan exclaimed, he ended up stopping his walking. He had arrived at the middle of the mountain, and had arrived in front of the dungeon that Erta told him.</p><br/><p>The dungeon was positioned in the form of a blurry grey vortex in front of a cave, and the moment he found it, the text, [Limited access for under Lv50], appeared.</p><br/><p>Of course, Yu IlHan’s level was still 36.</p><br/><p>“Hey.”</p><br/><p>[Who do you think is with you?]</p><br/><p>“Embarrassing angel.”</p><br/><p>[I’m a higher existence who makes and manages Traps of Destruction!]</p><br/><p>The moment Erta shouted in boasting, which was rare for her, the text saying limited access for under lv50 disappeared from his retina.</p><br/><p>[I can take such measures since I know of all your abilities.]</p><br/><p>“You are unexpectedly useful…….”</p><br/><p>[Please remember, I’m quite of use to you!]</p><br/><p>Yu IlHan stepped inside the dungeon with the unexpectedly-useful angel Erta.</p><br/><p>This was the moment where the dropout met a monster from another world for the first time in his life.</p><br/><p>Author’s notes</p><br/><p>1 month has passed. It’s the beginning of a mass level up of the ready warrior, Yu IlHan!</p><br/><p>The rewards of the quest are being given one by one. There are still a lot left!</p><br/><p>Angel killer Yu IlHan.</p><br/><p>Unlike monsters which are born naturally in an invironment with mana, rice weevils lay their eggs in rice, and cockroaches cral inside dirty environments. They don’t appear with a *poof!* in an empty space! …Although, in fact, the author thought that it was like that until a while ago……</p><br/><p>Huh? What did you say? : A famous hearing-impaired patient. I will skip the details. (T/N: Haganai reference, apparently, Chamber hasn’t watched it. Google ‘Eh? Nandatte?’ for more)</p><br/><p>I will emphasize this since it’s important. It’s not harem! (T/N: I don’t believe you, your previous two works were both harem.)(E/N: pls no harem)</p><br/><p>Translator’s notes</p><br/><p>Ignore 6, author retracts it later, saying he won’t say anything. Apparently, there is an ‘ending’ he is planning, but who knows… Also, I only found about the haganai reference through the comments…</p><br/><p>Editor’s notes</p><br/><p>*sobs in a corner* why is it harem T.T</p><br/>\n</div>"}