{"title": "Chapter 26 Call me Ishmael (2)", "id": 26, "volume": 1, "url": "http://boxnovel.org/everyone-else-is-a-returnee-chapter-26-call-me-ishmael-2", "volume_title": "Volume 1", "body": "<h1>Chapter 26 Call me Ishmael (2)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Call me Ishmael (2)</p><br/><p>The black leopard which got hit by a strong bolt of lightning collapsed on the ground with a boom. As the three ropes that bound him became taut, it damaged the body even further.</p><br/><p>Immediately after that, the armored vehicle Kang MiRae was driving arrived near Yu IlHan and stopped. Kang MiRae, who peeked out her body a little through the window had a small bottle in her mouth, and inside, something luminescent could be seen. Now that he thought about it, she was also wearing a metal mask which covered her nose to her forehead and not the H*lk mask.</p><br/><p>“Just how did you bind such a monster?”</p><br/><p>“That’s what I want to say.”</p><br/><p>To say the magic just now from Kang MiRae was 1st class magic, it was too strong. Of course, as they weren’t in a situation for him to ask that, Yu IlHan retorted and just kicked off the ground. In his hands was pilllar(d).</p><br/><p>“Here!”</p><br/><p>Bang! Yu IlHan ended up becoming proficient in nailing pillars into the ground as only one chop down with the pillar, pillar(d) had dug deep into the ground.</p><br/><p>After fixing it firmly with a punch, he aimed harpoon(d) which was connected to it towards the black leopard which was just lifting its body up.</p><br/><p>[KuYuuuu! KuFuAAAaaaa!]</p><br/><p>The leopard didn’t seem to have gotten rid of the electric shock despite lifting its body. It had lost its mother before it was even born, and even more, it was bound by its own mother’s bones and leather. This was a pitiful scene.</p><br/><p>And so, Yu IlHan decided to finish it off quickly.</p><br/><p>“Hup!”</p><br/><p>[KuooWaaaAAAaaaa!]</p><br/><p>Harpoon(d) unerroringly pierced its right paw. At the instantaneous throw and hit, Kang MiRae even panicked for a moment as she couldn’t understand the situation.</p><br/><p>“Whenever you think you can put a hit in, attack. That guy’s so strong so we don’t know when the pillars will be pulled out.”</p><br/><p>“It doesn’t seem like it will be pulled out at all, though.”</p><br/><p>Ignroing Kang MiRae’s words, Yu IlHan moved his body again. Although 4 harpoons had pierced its body from 4 directions, it was insufficient to bind it fully.</p><br/><p>Most importantly, its mana hadn’t depleted yet! As though it had decided to escape the binding’s first, it grit its teeth while shooting blade winds onto the leather rope continuously.</p><br/><p>[KuAOoooOOOOoooo!]</p><br/><p>Yu IlHan checked its state while driving pillar(e) into the ground. If it could use its power through its gaze(E/N: if looks could kill basically), it would have killed Yu IlHan already. A truly overwhelming hostility and muderous intent was endlessly pouring towards him. Even though it had received a considerable hit from Kang MiRae’s lightning just now, it didn’t seem to mind her at all.</p><br/><p>[Ku……KuoOOoooo……!]</p><br/><p>“So you want us to die together.”</p><br/><p>It was a gaze he met a few times while hunting a few animals in order to master dismantling.</p><br/><p>Although all existences put life as its foremost priority and do anything and everything in order to protect it, there was a time where its desire for survival would be surpassed by another desire.</p><br/><p>Ironically, an existence would shine the most brightly at that moment. It was like a flame that burned even more intensely as it knew the emptiness that comes after it becomes extinguished.</p><br/><p>Yu IlHan threw harpoon(e). Striking its left eye, blood gushed out like a fountain.</p><br/><p>“It will attack. When can you counterattack?”</p><br/><p>Without even checking the results, Yu IlHan asked while escaping that place. Kang MiRae also replied while turning on the armored vehicle’s engine.</p><br/><p>“If you want pocket change lightning then I can do it now, and I can use a really strong one in 2 minutes!”</p><br/><p>“Okay. Please tell me before you use your ultimate attack.”</p><br/><p>Immediately after he spoke, blade winds flew towards him. He had pierced both of its paws to seal its blade winds, but it didn’t seem to mind as it kept swinging its front paw.</p><br/><p>Naturally, the paws couldn’t endure the shock as blood erupted from them like waterfalls, but the truly formidable thing was that even that blood was mixed into the blades as it shined even more frighteninglly.</p><br/><p>[It’s also called Blood Buff, but……Simply speaking, it’s berserk! It will be stronger so be careful!]</p><br/><p>“I knew that was it!”</p><br/><p>Immediately after Yu IlHan rolled on the ground, the concrete floor was soundlessly dug deep. It was a place where Yu IlHan was at just now. As if panicking at that scene, the armored vehicle Kang MiRae rode also became louder.</p><br/><p>“I don’t think I can approach it……!”</p><br/><p>While rolling on the ground with pillar(f) in his embrace, Yu IlHan clicked his tongue. The blood blades became more serious and flew all over the place as time went. The leather ropes binding it gradually reached its limits and it was stretching with a worrying sound.</p><br/><p>It didn’t mind even though the harpoons pierced into its body was ripping its muscles and bones while shaking all over the place, and was going to free itself. It was a movement to take its enemy’s life while being sure of its own death!</p><br/><p>Kang MiRae, who was in the armored vehicle, kept shooting lightning but it couldn’t stun him like it did last time. He had to hold out for 2 minutes!</p><br/><p>“Fuu.”</p><br/><p>Yes. He never thought it would be so easy in the first place. Wasn’t it a 3rd calss? How could it be called 3rd class when it became bound due to an preemptive strike and be riddled with holes just like that and even get hit by lightning and die? That was called a punching bag.</p><br/><p>“Can’t you use some stronger skills to stop it!?”</p><br/><p>“How about this!?”</p><br/><p>A short reply came. Along with that, a machine gun popped out of the armored vehicle’s window and it started shooting towards the black leopard madly. Yu IlHan shouted one syllable while looking at that.</p><br/><p>“Ah!”</p><br/><p>[You’re worried that its hide will be damaged, right?]</p><br/><p>“You, from when did you know me so well……?”</p><br/><p>If there was one amazing thing, it was the fact that machine gun bullets didn’t help at all to the point that it would make Indians shocked. (T/N: I don’t know why Indians came out here… maybe from a movie, maybe it’s from Moby Dick…?E/N: the author is one strange guy)</p><br/><p>There was no need to talk about whether it had a large calibre or whether it was made from special materials. In the first place, due to its violent movements, more than half had missed, and even when they hit, it couldn’t even make a mark on its hide. It was overwhelmingly lacking in power and technique.</p><br/><p>However, if it was Yu IlHan, it might have been different.’</p><br/><p>“Lend me that machine gun!”</p><br/><p>“You can even use guns!?”</p><br/><p>Kang MiRae voiced out in surprise, which was rare for her. Obviously, the person who mastered all personal weapons over hundreds of years was Yu IlHan. He had the confidence to shoot guns better than anyone than any other humans on Earth that went to a business trip to another world!</p><br/><p>Moreover, thanks to the monster running all around the place, he couldn’t use his spearmanship or close combat without taking a big risk. It seems that the moment he pierces harpoon(f) into its body will be the moment all the rest of the harpoons will be pulled out harmonically so that was meaningless, if there was any possibility……!</p><br/><p>“Just give it to me!”</p><br/><p>“Fred, give it to him!”</p><br/><p>Although he guessed from the fact that the leopard was still getting hit by lightning despite the machine gun spitting sparks everywhere, it seemed the one shooting the machine gun was not her as expected.</p><br/><p>After another wave of its blood blades flew at him, when Yu IlHan nimbly approached the armored vehicle, a heavy belt of bullets came down first. While receiving that, he rolled once more to wrap the belt around his body, then he caught the machine gun which was thrown outside the open door.</p><br/><p>“But the machine gun doesn’t have much effect……”</p><br/><p>Although the brown haired foreigner, Fred, spoke with confusion even while passing the machine gun to Yu IlHan, Yu IlHan ignored him and ran to another side. Blood blades flew and it sliced off the armored vehicle’s door.</p><br/><p>“Dodge!”</p><br/><p>At the same time as Kang MiRae’s warning came, the black leopard finally pulled out two of the pillars. This meant that it had exerted enough strength to pull out the pillars even though the leather rope hadn’t snapped yet.</p><br/><p>“Even so, I really made that harpoon and rope well. It even endured such an enormous strength, right?”</p><br/><p>[This is not the time to be positive!]</p><br/><p>As the balance which bound him crumbled, the other pillars also became worrying at once. There wasn’t much time before it regained freedom!</p><br/><p>Even while he was joking with his mouth, Yu IlHan’s two hands moved busily to check the state of the gun, connect the bullet belt and load before rolling once again on the ground.</p><br/><p>Now, the leopard was only few meters away from him. The rope pulling it from the other side also looked dangerous, and the piillar was already being pulled out little by little. There was no monster like this.</p><br/><p>However, Yu IlHan was also locking onto it without being late. Yes. With the machine gun.</p><br/><p>“Eat bullets, you alien monsters!”</p><br/><p>[This monster’s from Earth, though?]</p><br/><p>As the machine gun spat fire, one line popped up on Yu IlHan’s retina.</p><br/><p>[You have awakened Shooting Lv Max.]</p><br/><p>Immediately after that, bullets started hitting its left eye, where harpoon(e) had pierced and pulled out from.</p><br/><p>[KihyAAAaaaacccccc!]</p><br/><p>“Huuuuuup!”</p><br/><p>Whether Erta thought that shout was strange or not, Yu IlHan endlessly shot bullets. Even though a human body was supporting the machine gun, he didn’t shake at all.</p><br/><p>Just how hard was it to shoot bullets into the exact place one wants while ignoring the rebound occuring from shooting the bullets?</p><br/><p>However, such a difficult thing was possible for Yu IlHan.</p><br/><p>The macine gun bullets, which shot into its eyes continuously called forth a miraculous difference as if it made one wonder it was still the same machine gun that Fred used.</p><br/><p>[Kuaaauuuccc, KKKSUXNCCUCCjc!]</p><br/><p>A blood waterfall flowed. The black leopard rolled around the ground while screaming sounds that didn’t seem like it was from the human realm. Even so, Yu IlHan didn’t stop. He nimbly rolled onthe ground to follow it and pulled the trigger after aiming its left eye again!</p><br/><p>The machine gun bullets slowly, very slowly broke its bones as they hit in the same spot again and again. To the point that it made one wonder if it was possible to break its brain like this, if it wasn’t a 3rd class!</p><br/><p>“……Is there some buff on the gun that I don’t know about?”</p><br/><p>Kang MiRae quietly muttered in shock while looking at that scene. The figure of one little human blocking a huge leopard with a single machine gun seemed grand as if modern civilization was struggling with its last strength in front of the change in environment.</p><br/><p>“Magic!”</p><br/><p>Yu IlHan shouted.</p><br/><p>“Can you do it now!?”</p><br/><p>“7 more seconds!”</p><br/><p>“Okay! Attack whenever possible!”</p><br/><p>“Yes!”</p><br/><p>Fortunately, he had enough bullets. Yu IlHan shot bullets into its eyes while calmly moving around to dodge its wildly shot blood blades, and when he thought that about 5 seconds had passed, he threw the machine gun and the bullet belt and jumped.</p><br/><p>It was to where pillar(f) and harpoon(f) was.</p><br/><p>[KKKyyyYYYYAAAAAAKDSKDKC!]</p><br/><p>With a good timing, it pulled out all the pillars from the ground. With five pillars dangling and dragging on the ground, it jumped to the air!</p><br/><p>And at that moment.</p><br/><p>“Triple Lightning!”</p><br/><p>The moment Kang MiRae shortly shouted, Yu IlHan’s vision colored in gold. The absurdly strong streak of lightning streaked through the air and hit the black leopard!</p><br/><p>Yu IlHan saw that it had lost all its strength and dropping down. However, Kang MiRae voiced out!</p><br/><p>“Concealment!”</p><br/><p>3rd class monsters were amazing. Even though it was beaten up and burt, to think it still had the mental strength to plan the fight.</p><br/><p>Moreover, concealment? It seemed Yu IlHan’s guess was wrong. It was trying to leave this place through whatever means possible. After realizing that it wasn’t a match for them, it was trying to escape and look for a next chance!</p><br/><p>Of course, whether it did or not, Yu IlHan didn’t care.</p><br/><p>[KaHHHAACCCKKK!]</p><br/><p>The shortest, but the most fatal scream resounded out. It was a scream that burst out from Yu IlHan nailing pillar(f) without hesitation into its bloody left eye as it was falling down while activating concealment!</p><br/><p>Yu IlHan muttered while clicking his tongue.</p><br/><p>“I said it wouldn’t work from the beginning.”</p><br/><p>Bang! The black leopard and Yu IlHan fell onto the ground simultaenousy. Yu IlHan agilely stuck onto its head to lessen the shock, but the black leopard received a double hit without any of that so it was in a near-groggy state.</p><br/><p>However, Yu IlHan didn’t even rest and moved. He started to tie it up with the rope tying piillar(f) and harpoon(f).</p><br/><p>“He… saw through the concealment……”</p><br/><p>Just how much surprise does he have to give her in one fight before being satisfied? While Kang MiRae, who leaned powerlessly onto the seat after shooting out lightning, muttered in shock, Yu IlHan tied the leopard’s entire body with the rope and as a finisher, he pushed harpoon(f) into its butt, hard.</p><br/><p>[You have learned Binding Skill.]</p><br/><p>[You can just kill it without tying it up, though……?]</p><br/><p>Erta asked in confusion, but Yu IlHan shook his head and distanced himself from the black leopard which couldn’t move at all. Then, he slowly approached Kang MiRae who was dumbfoundedly looking at him.</p><br/><p>“Wh, what is it?”</p><br/><p>Kang MiRae, who felt a type of madness from his movements, asked in a slightly scared tone. If someone who knew the Empress, heard this, then that person would be shocked. In fact, Fred, who was next to him, was also very shocked.</p><br/><p>However, Yu IlHan, who didn’t know of the Empress’ reputation, nor was he interested, declared firmly to her, who was about to run away.</p><br/><p>“Aren’t we gonna party? Should I eat the experience alone this time too?”</p><br/><p>Yu IlHan was a kind adult who does not make the same mistake twice.</p><br/><p>Author’s notes</p><br/><p>N/A</p><br/><p>Translator’s notes</p><br/><p>Tired… Cya</p><br/><p>Editor’s notes</p><br/><p>Enjoy~</p><br/>\n</div>"}