{"title": "Chapter 43 I Also Do 2nd Job Advancement – 6", "id": 43, "volume": 1, "url": "http://boxnovel.org/everyone-else-is-a-returnee-chapter-43-i-also-do-2nd-job-advancement-%E2%80%93-6", "volume_title": "Volume 1", "body": "<h1>Chapter 43 I Also Do 2nd Job Advancement – 6</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>The pile bunker ammo which flew like a flash and struck like lightning, instantly crushed the giant troll’s skin and bones before making its brain rupture, and not stopping at that, it even crashed all the way down its spine while destroying everything in its path.</p><br/><p>After it smashed everything from the troll’s head to its crotch, it embedded itself into the ground without losing any momentum, and due to that effect, a regional earthquake occurred and everyone on the ground lost their balance.</p><br/><p>“Kuhk!”</p><br/><p>“Kyaaak!”</p><br/><p>{Kiiuaaaaaa!}</p><br/><p>As mentioned, the pile bunker Yu IlHan was holding self destructed. This was the moment where his strongest weapon, which helped him at decisive momements, was destroyed completely. Until he could find an object to replace the Giant’s Rubber String, he wouldn’t be able to make another pile bunker again.</p><br/><p>Of course, the pile bunker really did bring out the effects of extreme modification. There was no troll which would still be alive even after it had its brain matter crushed, spine destroyed, body bisected, and its heart ruptured, as of yet on Earth.</p><br/><p>[You have earned 7,854,557 experience.]</p><br/><p>[You have earned the record of Lv 109 Highland Troll Boss.]</p><br/><p>[You have earned the title ‘Not two hits, nor three hits, but one hit’. If you kill an enemy in a single strike, the experience earned and the possibility of acquiring a magic stone increases by 20%]</p><br/><p>[Kill a 3rd class monster in a surprise attack 1/1]</p><br/><p>Yu IlHan recovered the remnants of the pile bunker in an instant while in midair before landing on the ground safely by using the troll’s corpse as a foothold.</p><br/><p>Looking behind, he could see two humans and a scorpion who could not get themselves up properly due to the shockwave of the bone nail striking the ground.</p><br/><p>If there was any common points between them, it was that they were looking at Yu IlHan with disbelieving eyes. Loner Yu IlHan, who wasn’t used to receiving attention from others, shyly spoke up.</p><br/><p>“Oh, continue with whatever you were doing just now.”</p><br/><p>“Like hell!”</p><br/><p>The man shouted in frustration, but the priestess shouted as if afraid of missing this opportunity.</p><br/><p>“If you help us kill that scorpion, we’ll give you everything other than the poisooon!”</p><br/><p>“Hey, this idiot. Whoa!”</p><br/><p>It seemed that the priestess, Na YuNa, was sure that the man couldn’t kill the scorpion by himself. This could be said to be a lack of trust in her companion, but could also be said to be that she had the ability to judge the situation cool headedly, unlike her clumsy outer appearance.</p><br/><p>The man stopped bickering with the woman as the scorpion’s poison needle assaulted him after getting balanced faster than him. Meanwhile, Yu IlHan thought about her offer for a moment before nodding his head.</p><br/><p>“Okay.”</p><br/><p>“Yes! See, oppa!? I said he was kind riiiight!?”</p><br/><p>“Ah, fuck. I don’t know anything anymore, dammit all!”</p><br/><p>Kang HaJin replied as if slightly relieved, slightly hurt, but slightly despairing tone before posturing himself.</p><br/><p>“As YuNa said, if you help us, we’ll give you everything other than the poison!”</p><br/><p>“Okay.”</p><br/><p>Isn’t that couple’s relationship quite interesting? – With such useless thoughts, Yu IlHan took out his spear and postured himself. Then, at the same moment as the scorpion assaulted towards the man, he kicked off the ground.</p><br/><p>Fortunately, the strength from the superhuman strength skill was maintained. He’d finish that scorpion off within that duration!</p><br/><p>“Hup!”</p><br/><p>At the same time as Yu IlHan flew at it, the scorpion swept its scorpion tail on the floor. Kang HaJin dodged it by jumping backwards, but Yu IlHan coudln’t care less, so he just charged forward.</p><br/><p>“Hah!”</p><br/><p>Then he swung his spear with all his strength to slash the tail mid way!</p><br/><p>{Kukyaaaakagagak!}</p><br/><p>“Wao!”</p><br/><p>“How’s he so…!”</p><br/><p>You should think about how to strike hard now, since the scorpion is rampaging all over the place, if you have the time to exclaim!</p><br/><p>Yu IlHan really did that. The spearhead, which didn’t lose any strength even after cutting off that thick tail, and struck the scorpion’s head after slashing through the air!</p><br/><p>“Oppa, attack!”</p><br/><p>“Yes! Fuu, Chasing Strike!”</p><br/><p>A skill! So envious!</p><br/><p>Yu IlHan momentarily thought that, but Kang HaJin’s skill, which struck the scorpion’s chest with a bright pink light, was weaker than Yu IlHan’s normal attack under superhuman strength mode. Feeling a crack appearing on the expectations he had of mana, Yu IlHan asked Erta in a small voice.</p><br/><p>“Not all skills are like that, right?”</p><br/><p>[Not all humans are you.]</p><br/><p>Anyway, Kang HaJin did his role sufficiently. It was because his skill, Chasing Strike, was a special skill which would become stronger, affected by the attack which attacked the target previously.</p><br/><p>When a chain of strong shock was applied, the Giant Death Stalker ended up falling into a stunned state, and Yu IlHan, who would never miss the enemy’s slight change in sttate, didn’t miss that opportunity and attached himself on top of its head.</p><br/><p>“Huuuuup!”</p><br/><p>His spear strike had already drilled a sufficient wound on its head. What was Yu IlHan’s specialty? Wasn’t it kicking where he kicked before?</p><br/><p>As if being possessed by a woodpecker, he clung onto its head by clamping his legs around its head, before striking down the same place with his spear held in both of his hands.</p><br/><p>“Wow, so cute!”</p><br/><p>“Ah, fuck, I don’t know what’s what anymore!”</p><br/><p>Na YuNa spoke a line that didn’t fit the situation, and Kang HaJin, who once again received a buff from her, gave up everything and charged like Yu IlHan before beating up the scorpion.</p><br/><p>[Kku, Kkuweeek!] (T/N: This is a little like ‘yelp’ in English, but scorpions don’t ‘yelp’… hence literal raws)</p><br/><p>When the chain of strikes full of Yu IlHan’s superhuman strength, and, although Yu IlHan didn’t know, the buffed attack of a 2nd class warrior was added, the scorpion collapsed, not being able to endure having its most lethal means of attack destroyed.</p><br/><p>Cruely, Yu IlHan didn’t stop thrusting his spear until he was sure that it was dead.</p><br/><p>[You have earned 2,479,989 experience.]</p><br/><p>[You have earned the record of Lv 95 Giant Death Stalker.]</p><br/><p>As they weren’t in a party, the experience was solely taken by Yu IlHan. Kang HaJin, who only realized that the scorpion was dead after Yu IlHan stopped his attacks, made a bitter expression after realizing that they weren’t in a party.</p><br/><p>“Even so, we can’t help it. It’s a profit just killing the Giant Death Stalker safely.”</p><br/><p>“You’re really really strong! It’s the first time I’ve seen someone stronger than oppaaaa!” (T/N: Savage)</p><br/><p>“Kuhk!”</p><br/><p>Kang HaJin seemed to have a crack on his pride as a man after hearing Na YuNa’s innocent comment. Of course, Yu IlHan couldn’t care less if his pride was wounded or not. He started dismantling the scorpion the moment it died, and as they said in the beginning, he was pulling out the poison gland.</p><br/><p>“Here. I’ve taken out all the poison within this thing’s body.”</p><br/><p>“Wow, so clean.”</p><br/><p>“Thank you.”</p><br/><p>Kang HaJin, who expressed his appreciation obediently while receiving the poison needle and the venom sac, was a calculative man when it came down to it. In contrast, Yu IlHan went into working with the rest the moment their transaction ended.</p><br/><p>Although there was no magic stone in the Giant Death Stalker, its carapace was absurdly hard, and the meat looked very delicious at a glance.</p><br/><p>Yu IlHan finished dismantling it while humming, and continued on to the Highland Troll Boss, while Na YuNa and Kang HaJin were looking at him working with absent-minded gazes after they received the Death Stalker’s poison, while Erta, was interrogating Feyta.</p><br/><p>[You intended to receive help from Yu IlHan from the beginning, right?]</p><br/><p>[N, no.]</p><br/><p>[If you’re honest, I’ll forgive you.]</p><br/><p>[In fact, I did intend that!]</p><br/><p>[Angel Sleeper Hold!]</p><br/><p>[You liar, *Screams*!]</p><br/><p>“Wao, angel-nims seem to be close!”</p><br/><p>“In my eyes, it looked like divine retribution.”</p><br/><p>“Wow.”</p><br/><p>At that time, Yu IlHan subconsciously exclaimed. It wasn’t because he became satisfied after looking at the angels becoming closer to each other, nor was it because he got goosebumps after listening to the couple’s conversation.</p><br/><p>It was because a magic stone popped out from the giant troll’s head.</p><br/><p>“There is one.”</p><br/><p>[Angel Cross Choke, wait, what!?]</p><br/><p>[3rd class magic stones are appearing already!? *Screams*!]</p><br/><p>This was the moment when the opportunity for evolving the Resting skill, which he had lost previously, had come again, in a more perfect manner. That was because the 3rd class magic stone was from a troll, which had a Resting skill.</p><br/><p>Although there was no differentiation on the types of monsters from which the magic stone had to be acquired from, it was needless to say that the magic stone from a troll, which had a closer affinity, was better than one from the shadow leopard.</p><br/><p>However, he didn’t need to make them aware of Yu IlHan’s skill by evolving it right now. Yu IlHan cleaned the magic stone well and put it inside his Cross Bag before continuing with the dismantling of he troll. Forgetting about Na YuNa and Kang HaJin who were making absent-minded gazes at the flash of appearance of a 3rd class magic stone.</p><br/><p>Around that time, the duration of the superhuman strength ran out and he suddenly felt extreme fatigue, but Yu IlHan didn’t stop. His techniques were good to the point that it would sufficiently make up for the deficiencies in his strength.</p><br/><p>What was amazing, was that Na YuNa, who was looking at that process, activated her skill suddenly.</p><br/><p>“Make that person stronger, yapp!”</p><br/><p>“Hmm?”</p><br/><p>Yu IlHan spoke out in surprise. When the light pink colored magic, which came from her stretched hand, cameinto contact with Yu IlHan, the fatigue which covered his entire body eased up a little.</p><br/><p>He thought that it was a recovering ability befitting a priestess, but what was more amazing was that even though Yu IlHan didn’t show it much on the surface, she had noticed something wrong with his body.</p><br/><p>“You have good eyes.”</p><br/><p>“Ehem!”</p><br/><p>Yu IlHan could only say that sourly. Na YuNa obediently accepted his praise and straightened her waists.</p><br/><p>The already plump chests were emphasized, so Yu IlHan turned his gaze to the troll in embarrassmnet. Only Kang HaJin was making a strange expression as he understood Yu IlHan.</p><br/><p>“That’s done.”</p><br/><p>The Highland Troll Boss was a treausre without wastes.</p><br/><p>He was thankful that it had died in a single strike without any words, but not only had it left behind a magic stone, it also left behind a tough hide, strong bones, muscles and tendons which seemed like they were processable into Giant’s Rubber Band, and lastly, blood which looked thicker than other trolls! Adding meat on top of this, there really was nothing to throw away.</p><br/><p>Even though it may not have had the slightest intention to become like this, Yu IlHan would still express his thanks to him. He would even hold X to pay respects if there was a keyboard.</p><br/><p>“We’re planning to go back, but if it’s alright with you, won’t you come back with us?”</p><br/><p>While Yu IlHan was being joyful over his harvests, a line which was out of his expectations could be heard. It wasn’t Na YuNa, but Kang HaJin, who was wary of him at fist, who talked first.</p><br/><p>“You should have noticed as you received Yuna’s and my id cards, we’re a Korean Clan, who’s proactive as a small-scale team of elites. Honestly speaking, your fighting skills are jealous-provokingly good. To the point that I want to receive you as a clan member despite my pride.”</p><br/><p>“Woow. That’s so good! MiRae will like it tooooo!”</p><br/><p>Realizing that his words were an offer, Na YuNa became delighted while clapping like a seal. The angel, Feyta also brightened up.</p><br/><p>[Yes. It’s good to work together! It’s an advantage of the race known as human race to fill what each other is lacking!] (T/N: The only thing MC lacks is his communication skills)</p><br/><p>And Yu IlHan retorted with a kind smile.</p><br/><p>“Don’t wanna.”</p><br/><p>“*Groan*, although I did know you would answer that, you are quite firm.”</p><br/><p>Yu IlHan only smiled when he heard that, and didn’t say anything else. Of course, like a loner, his insides were boiling up.</p><br/><p>There was no one who could intrude on the territory of loners. Social butterflies would interact with other social butterflies, but loners would even reject other loners.</p><br/><p>Filling what each other lacks? That really is an advantage in a group. However, Yu IlHan had never benefitted from that. It was because no one had looked at him until now.</p><br/><p>Until now, Yu IlHan endured if things were lacking. Do you think I’ll go over to that side just because you want to be together with me since my skills are exceptional? There is a limit to looking down on loners.</p><br/><p>There was no way that Kang HaJin would know of the path and experiences that he had been through until now. It might have bee na big decision for him to say to come with him, and might have wanted him as a companion for real. Perhaps, he really did want to associate with him. (T/N: Note that Kang HaJin is around 30 years old (other world included) while MC is 1020 years old)</p><br/><p>However, Yu IlHan couldn’t accept his offer positively despite knowing that Kang HaJin didn’t</p><br/><p>have any malicious intentions. His twisted personality couldn’t be helped. He will think like this in the future.</p><br/><p>Unless, a huge situation where he has to change his reasoning occurs.</p><br/><p>“Hiing, I want to hunt together though, it sounds like so much fun though.”</p><br/><p>“He doesn’t like it. He’s so strong, so we’ll be able to meet him again in the future. Try tempting him again then.”</p><br/><p>“Uu… Okaaaay.”</p><br/><p>Conversing such things blatantly in front of the person in question, Kang HaJin bowed his head with a smile.</p><br/><p>“Now that I think about it, you saved us yet again just now. If you contact us we will give you twice, or even three times the compensation. Then we’ll take our leave now.”</p><br/><p>“Good bye.”</p><br/><p>“Let’s see each other again! Definitely!”</p><br/><p>[Phew… that steel like human.]</p><br/><p>[Let’s not see each other again, Feyta.]</p><br/><p>Kang HaJin, who was clear with his finishing, and Na YuNa, who clung to him even though it had been a little since they even met. Finishing farewell with the two contrasting people, Yu IlHan watched them disappear over the horizon. Until the point that he was sure that the passvie concealment would activate again.</p><br/><p>And when he became sure of that, he spoke in a delighted voice.</p><br/><p>“Then should I evolve the Resting skill now!?”</p><br/><p>[How can there be such a my-pace human…?]</p><br/><p>It seemed that the conversation they had until now couldn’t affect Yu IlHan at all. One could only marvel at Yu IlHan’s train of thought, thinking, and doing what he wants.</p><br/><p>However, perhas this was the source of power that made Yu IlHan endure for 1000 years? While thinking that, Erta smiled and decided to look at his work.</p><br/><p>Author’s notes</p><br/><p>Chapter isn’t over yet.</p><br/><p>x key: the key pressed when paying respects… (T/N: I looked it up, apparrently, it’s from Call of Duty)</p><br/><p>Translator’s notes</p><br/><p>I wonder how priest-classes get their exp… if you heal without being in a party, then… Or is the heal not effective if not in the same party…? Let’s leave the difficult stuff to the Akashic Record…</p><br/><p>Yet another sponsored chapter. That’s the end of the sponsored chapters. Unlike with GoM and Coder… I will try to keep this work up, despite my busy schedule. Just… don’t donate too much, I still have a life to live (Yeah, like hell I do)</p><br/><p>Translator : Chamber</p><br/>\n</div>"}