{"title": "Chapter 48 A Partner Only for Me – 1", "id": 48, "volume": 1, "url": "http://boxnovel.org/everyone-else-is-a-returnee-chapter-48-a-partner-only-for-me-%E2%80%93-1", "volume_title": "Volume 1", "body": "<h1>Chapter 48 A Partner Only for Me – 1</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>“Thank you for saving me.”</p><br/><p>“That’s what I should say.”</p><br/><p>After the situation was over with, Kang HaJin bowed his head deeply to Yu IlHan, but Yu IlHan just waved his hands and denied it. If it wasn’t for them, Yu IlHan definitely would have died. Just like that.</p><br/><p>“But if it didn’t die, the dungeon’s exit wouldn’t have opened, and if so, we would have died as well. So it’s us who should be thanking you.”</p><br/><p>Yu IlHan thought that Kang HaJin had a very stiff head and didn’t understand what he was saying, but he didn’t say it out loud. Instead, he spoke while picking up the black magic stone and Reta Kar’iha’s relics.</p><br/><p>“Then I can take this, right?”</p><br/><p>Momentarily, Kang HaJin’s eyebrows twitched, but he couldn’t say ‘that’s a bit too……’ now, since that would be going against his words. Honestly, it wouldn’t be exaggerated to say that Yu IlHan had killed it all by himself, so Kang HaJin eventually decided to clearly give up.</p><br/><p>“Okay, YuNa would probably not be against it either.”</p><br/><p>Na YuNa didn’t object it either. Instead, she demanded.</p><br/><p>“Give me your numberrrr!”</p><br/><p>“No.”</p><br/><p>“Wao, I got rejected again! Even though I’m so pretty! Even though I’m the prettiest in the world!”</p><br/><p>Na YuNa was definitely beautiful. Since it was Yu IlHan, who would not eye anyone below an angel, who acknowledged that, it could be said that her appearance was exceptional.</p><br/><p>He didn’t know the order of sequence: whether she became like that since she was blessed by the Goddess of Beauty, or whether she was blessed because she was pretty; but she was beautiful to the point that he could realize that she wasn’t blessed by the Goddess of Beauty for nothing.</p><br/><p>He also understood why she was so proud of her appearance. Although, honestly, he felt unpleasant about it.</p><br/><p>Yu IlHan rejected even her even more because of her confidence, and confirmed with Erta.</p><br/><p>“Are there anything else that I need to do in here?”</p><br/><p>[There should be, but not now. We all need rest. You worked very hard so you should rest now. The rest will be taken care of by us, as we should be responsible for this in the first place.]</p><br/><p>“But in my opinion, I think it will become even more dangerous if your powers are restricted again doing that.”</p><br/><p>At Yu IlHan’s sharp opinion, Erta replied while smiling helplessly.</p><br/><p>[In fact, I’m worried about that as well. We will probably seal the dungeon itself using Heaven’s power, and will probably give out quests to humans later. To those like you, who have exceptional ability.]</p><br/><p>“I knew that.”</p><br/><p>Yu IlHan ended up laughing.</p><br/><p>However, to blame her for anything, she worked very hard today, so he decided to shut his mouth. Erta also seemed to have felt his consideration as she quietly lay on his head.</p><br/><p>“Let’s get out togetherrrr. You won’t reject that, right?”</p><br/><p>“Ok, then.”</p><br/><p>He had already left the party. His passive concealment would probably activate again when they arrive in Korea, so he should be able to leave them. As such, Yu IlHan didn’t bother rejecting that.</p><br/><p>He had already finished his business here anyway. Splitting up here was instead more annoying.</p><br/><p>“I will drink beer with MiRae, when I go back to Korea!”</p><br/><p>“Do whatever you want…”</p><br/><p>“Oppa, drink with us toooo!”</p><br/><p>“I’m busy.”</p><br/><p>“Uuu, I keep getting rejected today.</p><br/><p>Meanwhile, Na YuNa didn’t seem to be tired at all, as she kept chatting. If acting childish was her secret to her beauty, then he wouldn’t really want to imitate that.</p><br/><p>However, he didn’t feel so bad about her screaming ‘kyak kyak’ from time to time, so Yu IlHan looked at that scene with a faint smile. With the thought that she might miss Yu IlHan’s figure if she kept chatting loudly.</p><br/><p>“But what is your naaame?”</p><br/><p>“Hmmm.”</p><br/><p>To think that she called out to him when his concealment seemed like it would activate in just a few more moments, was that a simple coincidence? Just why does this woman show a completely different side to her at completely unexpected times…</p><br/><p>Yu IlHan became a little nervous. Whether she knew that or not, Na YuNa continued speaking with an innocent voice.</p><br/><p>“I asked Feyta before, but she said she’ll die if she tells me.”</p><br/><p>[I definitely don’t want an angel cobra twist!]</p><br/><p>“I think it’s beyond the level where you should put an ‘angel’ in front of it…”</p><br/><p>While retorting blandly to Feyta, Yu IlHan thought for a moment. The one he thought about was Kang MiRae.</p><br/><p>First, it was a clear fact that Kang MiRae and these two belonged to the same group. Moreover, from Na YuNa’s chatters, he could judge that they were friends. Since Kang HaJin had the same surname, it was likely that he and Kang MiRae were kins.</p><br/><p>They will defniitely talk about Yu IlHan with her, and Kang MiRae should be able to think up of Yu IlHan the moment they mention concealment, spear, and Korean. It’s not that Yu IlHan was being arrogant. It’s just that there are no strong people with those characteristics on Earth right now, other than him.</p><br/><p>In other words, there’s no meaning in hiding it.</p><br/><p>“It’s Yu IlHan.”</p><br/><p>“Waa, such a cool name!”</p><br/><p>This person was the first to say that so nonchalantly as soon as she heard his name. The best social butterfly of social butterflies, the queen of social butterflies was here.</p><br/><p>Honestly, he didn’t feel that bad hearing that, but his strong resolve that loners cannot associate with social butterflies made him calm.</p><br/><p>Meanwhile, Kang HaJin was looking at him as if looking at a strange human. Even he, who grew up with Na YuNa from their toddler age, had his heart pound sometimes, when looking at her, but he could feel that Yu IlHan was rejecting Na YuNa honestly.</p><br/><p>He really wished that that wouldn’t provoke Na YuNa’s challenging mind. She always looked clumsy, but exactly due to that, it was unknown what she would do. Fortunately, as she was more interested in making herself look pretty rather than a man, it would be alright to not assume the worst……</p><br/><p>“You don’t have to back down so much. I won’t eat youuuu.”</p><br/><p>“If you’re too close, it makes me unpleasant and hot so go away a little further.”</p><br/><p>“Wao!”</p><br/><p>Now, Na YuNa seemed like she enjoyed the conversation with Yu IlHan. Well, she might feel new about Yu IlHan’s reactions, who was different to other men, since other men either exaggeratedly close, or exaggeratedly wild.</p><br/><p>New things bring with it, joy, but there was a limit to that. If there was no reaction, she was bound to get bored with it eventually. Just what kind of charm would she feel to someone who keeps rejecting her? Seeing Na YuNa giggling so much, Kang HaJin’s worries indeed seemed like it would end as worries.</p><br/><p>They could escape the dungeon soon, but amazingly, in front of the dungeon, a few angels were waiting, fully armed.</p><br/><p>Seeing those stiff expressions, they already seemed to know what happened inside the dungeon.</p><br/><p>[Erta.]</p><br/><p>A female angel wearing an armor of light, at their front, called Erta’s name.</p><br/><p>[Report.](armored angel)</p><br/><p>[I understand.](Erta)</p><br/><p>From Erta’s polite speech, it seemed that that angel was in a higher position than Erta. Yu IlHan looked at Feyta, wondering why they didn’t call out to her even though she suffered through the same thing, and she replied in a small voice.</p><br/><p>[It’s because I’m a newbie.](Feyta)</p><br/><p>[Quiet.](armored angel)</p><br/><p>[Hik.](Feyta)</p><br/><p>Erta and the armored angel seemed to converse for a while before they turned their heads towards Yu IlHan. The armored angel spoke.</p><br/><p>[Human Yu IlHan, it seems difficult to rewards you immediately.](armored angel)</p><br/><p>“……Ah, okay. You can give it to me after you finish work.”</p><br/><p>Yu IlHan tilted his head when he heard the word ‘reward’, before he realized that it was for saving Erta.</p><br/><p>Definitely, since Erta got seen, he couldn’t attack it first with a strong attack, and that made the battle a little disadvantageous. However, it wasn’t like he wanted a reward while he was saving Erta, so Yu IlHan couldn’t think of that until he heard the word ‘reward’.</p><br/><p>[I don’t know what you are thinking about with this matter, but this incident is very important even to Heaven. For a more accurate story, we will borrow Erta for a little.](armored angel)</p><br/><p>“Do as you wish.”</p><br/><p>[Then…… Everyone gather. We will now proceed with sealing the dungeon temporarily.](armored angel)</p><br/><p>[Yes!]</p><br/><p>With just one heavy line from the armored angel, all the angels in that area gathered at the front of vortex-entrance. Yu IlHan fell into thought while seeing the entrance to the dangerous dungeon being closed.</p><br/><p>Is this kind of dungeon the only in this place? Perhaps, won’t these kind of dungeons keep appearing in the future? Perhaps, someone’s will had played a role in this dungeon? If so, what for?</p><br/><p>The thought that started from a hypothesis kept chaining on until it scattered away like smoke. This thought was impossible to come to a conclusion in the first place, nor was there a need to come to one.</p><br/><p>Yu IlHan gripped his fist while thinking back to Reta Kar’iha’s smile that he saw at her last moments.</p><br/><p>Yu IlHan couldn’t care less of what’s going on. He would only become stronger in order to survive. He had no plans in shivering in fear of the things that have not even occurred yet.</p><br/><p>The temporary sealing of the dungeon was over. The angels only stopped emitting their power only after they saw that the vortex of the dungeon decreased and eventually became a metallic gate.</p><br/><p>[With this incident, Earth has become the world with the most variables, where God’s power is especially not effective. According to that, the angels assigned to Earth will increase in the future.]</p><br/><p>While he was quietly looking at the dungeon’s entrance, Yu IlHan could hear an angel’s voice in his ears.</p><br/><p>When he looked back, amazingly, he could see the armored angel, who kept her stiff attitude all this time, smiling slightly with the corner of her mouth slightly raised.</p><br/><p>[Lita really seemed to want to see you. It was painful to endure her hysteria until now.]</p><br/><p>“Is that so.”</p><br/><p>He thought of the things he thought when fighting Reta Kar’iha alone, and his face became a little red. It was fortunate that he was covering his face with a mask.</p><br/><p>No, rather than that, just how much does this poor angel talk about Yu IlHan to the other angels to the point that the angels that Yu IlHan meets talk about Lita!?</p><br/><p>While he was thinking that, at one moment, Yu IlHan realized what the armored angel was implying and widened his eyes.</p><br/><p>“W, wait.”</p><br/><p>[Then, Yu IlHan, I wish you luck in your future. I will send Erta back as soon as the business is done.]</p><br/><p>[Feyta, you come too.]</p><br/><p>[Wait, I need to prote…… Uwaaa!]</p><br/><p>The angels vanished in an instant. Taking back his hand he stretched towards the armored angel, Yu IlHan grumbled quietly.</p><br/><p>“Sneaky… She should have told me to the end if she was going to at all.”</p><br/><p>“……You’re very friendly with them.”</p><br/><p>Meanwhile, Kang HaJin, who was stiff throughout the entire incident since he was overwhelmed by the angels’ auras, became surprise yet again after looking at Yu IlHan’s attitude. Now, he was even tired of feeling inferior to him.</p><br/><p>Of course, there was no way Yu IlHan would know of that, so he could only make a vague smile.</p><br/><p>“Let’s go back nooow. HaJin-oppa, IlHan-oppaaaa.”</p><br/><p>“Fuu, yeah.”</p><br/><p>“I’m not your oppa.”</p><br/><p>Na YuNa, who simply wouldn’t understand the situation ended the situation and pulled on the two’s clothes. Kang HaJin sighed in defeat, and Yu IlHan felt electrified due to the power of social butterfly queen after hearing the change in her way of calling him, and cut her off with the power of a loner king.</p><br/><p>“Then IlHan?”</p><br/><p>“I’m sorry, but I have no plans in becoming close with you, so don’t call me so closely.”</p><br/><p>“Wao!”</p><br/><p>Na YuNa, who became to enjoy Yu IlHan’s reactions, kept talking to him until they got on the airplane at the airport. Of course, Yu IlHan escape them since he had to stowaway, so she could only hope for another meeting.</p><br/><p>Although, it was unknown when that meeting would come.</p><br/><p>Author’s notes</p><br/><p>Kang HaJin dong idiotic things trying to take back his pride. Did you know? Many smart and wise people ruin their work due to pride.</p><br/><p>Yu IlHan’s AT field was strong!</p><br/><p>Thanks for waiting. (T/N: Guess who appears in the next chapter, though, it’s quite obvious)</p><br/><p>Translator’s notes</p><br/><p>Last chapter for a while… due to exams…</p><br/><p>Fresh out of my brain yet again! No edits whatsoever.</p><br/><p>Translator : Chamber</p><br/>\n</div>"}