{"title": "Chapter 55: I Carry – 3", "id": 55, "volume": 1, "url": "http://boxnovel.org/everyone-else-is-a-returnee-chapter-55-i-carry-%E2%80%93-3", "volume_title": "Volume 1", "body": "<h1>Chapter 55: I Carry – 3</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Like Lita and Erta said, the monsters appearing inside this dungeon all had the power of lightning.</p><br/><p>{Kirrr!}</p><br/><p>{Kurrrr!}</p><br/><p>Monsters that looked like P*dg**tt* and P*dg**t numbered the most in the dungeon, and sometimes, a giant bird that looked like a M*g* P*dg**t could be seen as well. Of course, there weren’t only avians here but also lightning rats that looked like P*k*ch* R**ch*, which made him worry about copyright infringements, and also lizards, snakes and even bears. (T/N: In case you don’t know pokemon(i.e. me) they are Pidgeotte, Pidgeot, Mega Pidgeot, Pikachu and Raichu)</p><br/><p>“This is bad.”</p><br/><p>While cleaving a giant lightning rat by swing his deathgod’s dragon-exterminating spike spear, Yu IlHan muttered.</p><br/><p>[You have earned 579,839 experience.]</p><br/><p>[You have earned the record of Lv 71 Big Lightning Rat.]</p><br/><p>“These guys are too weak and I don’t get injured at all.”</p><br/><p>[That’s quite the unfortunate matter.](Erta)</p><br/><p>[Zzz](Lita)</p><br/><p>The first thing he did when he came inside this dungeon was to check the levels of the monsters. He had to do this first in order for his life to not be threatened.</p><br/><p>Befitting of a dungeon with level 70 as the restriction, all monsters were above level 70, and some even reached level 80 or 90, but all of them died with a single hit from Yu IlHan’s spear.</p><br/><p>Just how was this possible? – if you ask that, it was because of the absurd characteristics of his equipment.</p><br/><p>Setting aside the trivial options with his concealment or critical hit rate, and considering just the attack power,</p><br/><p>his attack power would increase by 30% and his fighting ability would increase by another 20% due to fighting ‘life’. These were the effects of being a Rookie Reaper.</p><br/><p>Due to the option from the spike spear, his attack power would increase by another 30% when doing a surprise attack,</p><br/><p>the robe increases his attack power by another 20% in a surprise attack,</p><br/><p>and finally his armor increased his attack power by 50% in a surprise attack.</p><br/><p>In other words, when he attacks in surprise, he would attack with a 130% increase in attack power. There would be a 20% increase in damage as long as the counterpart was a life form, so, within this dungeon where undead cannot be found, his surprise attack would be 2.5 times powerful!</p><br/><p>2.5 times didn’t simply mean the effect of hitting two and a half times.</p><br/><p>For example, let’s say that Yu IlHan’s attack power was 1,000, and the defense of the opponent was 500.</p><br/><p>The defensive stat would vary according to the state of the armor, and the part where the attack lands, but anyway, when Yu IlHan’s spear successfully lands, the opponent would be inflicted with the amount of attack value that surpassed the defense value, in other words, 500, damage.</p><br/><p>If it was just two and a half hits, then it would end with 500 damage being inflicted twice, and would end with 1,000 damage in total, and even calculating by multiplication, it would end at 1,250. (T/N: In case you don’t get this, the calculations are:</p><br/><p>However, in a real situation, the damage was not like that. Yu IlHan’s attack power would be multiplied by 2.5 to become 2,500, while the opponent’s defense would still be 500. Therefore, the damage would be 2,000. In other words, it would increase by 4 times.</p><br/><p>Since the attack power and the defense was just set at random, in a real situation, it didn’t necessarily mean the damage would be 4 times as much.</p><br/><p>Just that, within this dungeon, at least, Yu IlHan’s spear strike was bringing out a more fearsome might than the deathgod’s scythe.</p><br/><p>{Kwek!}</p><br/><p>[Critical Hit!]</p><br/><p>[You have earned 776,754 experience.]</p><br/><p>[You have earned the record of Lv 82 Lightning Bear]</p><br/><p>[You have earned 822,122 experience.]</p><br/><p>[You have earned the record of Lv 88 Lightning Bird]</p><br/><p>As a finisher, his title, ‘Not two hits nor three hits, but one hit’, gave him 20% more experience when he killed the monsters in a single strike, and even dropped magic stones at a higher rate, so Yu IlHan just had to harvest the experience and the magic stones.</p><br/><p>[Now you’re even complaining that you aren’t getting injured? You really are a pervert.](Erta)</p><br/><p>“I’m not getting injured so I can’t train my transcendent regeneration.”</p><br/><p>[That’s your problem?](Erta)</p><br/><p>[Zzz.](Lita)</p><br/><p>Of course, once he deployed transcendent regeneration, there was a need for him to rest. However, Yu IlHan was a master of rest; All moments when he’s not in battle was resting time for him, and no matter how much he hunts he could use transcendent regeneration again in just 3 hours.</p><br/><p>In the first place, transcendent regeneration didn’t require a mastery of rest for nothing. If one did not master rest, then the prerequisites to use the skill wouldn’t be fulfilled at all.</p><br/><p>As it’s such a harsh skill, if he did not train and lower the conditions now, he may have to train it while confronting 4th class monsters. Yu IlHan didn’t want to call that ‘training’ but a ‘life and death battle’.</p><br/><p>As such, he decided.</p><br/><p>“Oh well, I’ll train the superhuman strength too then.”</p><br/><p>In fact, he did have the thought to train transcendent regeneration and superhuman strength parallel, but it was more correct to say that he found it interesting that the monsters were snapped to death one after another, and did not use the skill.</p><br/><p>Superhuman strength increased physical abilities for 3 minutes, but once the duration ended, he would be weakened for 10 minutes. no matter how strong Yu IlHan is, he wouldn’t be able to kill monsters over level 80 in a single strike in his weakened state… right?</p><br/><p>If then, the monsters would have the chance to counterattack, Yu IlHan would be injured, and he would be able to train the transcendent regeneration. Killing monsters and training skills; there, everyone’s happy!</p><br/><p>“Perfect. This really is a perfect plan!”</p><br/><p>[Yes, perfect. You’re a perfect pervert!](Erta)</p><br/><p>[ZzzZzz.](Lita)</p><br/><p>Erta condemned Yu IlHan, who chose the path of suffering, without knowing how he felt. With the poor sleeping ‘beauty’ angel Lita on his head, Yu IlHan charged through the dungeon.</p><br/><p>First, he used superhuman strength on purpose to sweep monsters with frightening destructive power for 3 minutes, and waited for the penalty to decrease his abilities.</p><br/><p>[Superhuman strength has become level 2.]</p><br/><p>[Physical strength decreases by 50% for 9 minutes 50 seconds since the duration of superhuman strength skill has ended.]</p><br/><p>People feel more loss the more they have. Yu IlHan, who, not counting mana, had status points that neared the 3rd class, even wanted to lie down right there and rest due to the weakened physical strength.</p><br/><p>However, that moment was exactly the moment to move. The conviction that monsters would not be killed by his weakened power was invading him. And coincidentally, there was a strong looking monster nearby. That thing that looked like M*g* P*dg**t!</p><br/><p>{Kweeeeek!}</p><br/><p>“Good, it really didn’t die!”</p><br/><p>{*Kuuuk*}</p><br/><p>Only after it allowed a preemptive strike to land did it recognize Yu IlHan’s figure before the giant lightning bird spat out lightning from its mouth with a bizarre sound.</p><br/><p>Yu IlHan even got hit by an attack that was fast, but could see the trajectory of, on purpose, while charging. In fact, it was hard to dodge since his muscular power was weakened too!</p><br/><p>“Khk, that’s ticklish.”</p><br/><p>{Kuruk! Kurururuk!!}</p><br/><p>When the attack landed, the lightning bird charged towards him in delight.</p><br/><p>On one side, Yu IlHan was confused since its attack did not hurt at all, before he realized that his armor was a legend rank one. Since he either fought monsters that couldn’t even scratch the armor, or those that literally ignored it, he had no chance to see the might of his armor.</p><br/><p>“Should I take it off?”</p><br/><p>[I’ll get angry.](Erta)</p><br/><p>“Tch.”</p><br/><p>Yu IlHan seriously considered de-equipping himself, but even for him, in a dungeon where he did not know what would pop out, it was foolish for him to take off his armor. He knew this fact well.</p><br/><p>Moreover, no matter how small, isn’t it still an injury? If he got hit 30 more times like this, he would be able to use transcendent regeneration.</p><br/><p>“Fuu, Ha!”</p><br/><p>{Kuuuk!}</p><br/><p>Yu IlHan grabbed the spear with both of his hands, which became slightly numb due to lightning, and charged at the lightning bird. His spear wouldn’t flinch with just a small injury.</p><br/><p>The breathing that matched instantly, and the spearhead that struck out in the correct moment! The spear, which looked like it would split the horizon in half, halved the lightning bird.</p><br/><p>[You have earned 784,343 experience.]</p><br/><p>“Ah, still, it died with two hits.”</p><br/><p>[That’s because your abilities would increase by 20% when confronting life. The abilities of a class are important due to that. Rookie Reaper not only increases surprise attack power to the extreme, but is also a good unique class that helps out sufficiently in battle situations. You would also have no problem with fighting undead since Angel’s Partner will support you. Although it’s a coincidence, Rookie Reaper and Angel’s Partner have quite the good affinity.](Erta)</p><br/><p>“I should get hit more before the penalty ends.”</p><br/><p>[You really are hateful.](Erta)</p><br/><p>[Zzzzz](Lita)</p><br/><p>Like that, Yu IlHan kept using superhuman strength, swept the monsters in the 3 minute duration, and fought a hard battle with his weakened strength.</p><br/><p>If he fought for 5 minutes with the penalty, he could use transcendent regeneration. However, as mentioned before, transcendent regeneration required rest energy to use, so he couldn’t use it again until he recovered rest energy. Like this, there was no way this would be a proper training session.</p><br/><p>At that moment, there was something that Yu IlHan took out from the Cross Bag to drink. It was none other than a portion-pack of bloodrink.</p><br/><p>[Ah, why did you take that out at this time!?](Erta)</p><br/><p>“Kuuu, rest energy is filling me!”</p><br/><p>[What!?](Erta)</p><br/><p>[Zzzzzzzzzzz.](Lita)</p><br/><p>The story turns back a little. This was when Yu IlHan pondered on how to train his skill after he came back after defeating Reta Kar’iha.</p><br/><p>He could use try&amp;try to somehow train the rest of the skills, but the only skill that weighed on his mind was the transcendent regeneration.</p><br/><p>Resting at least 3 hours after using it once… Just considering the skill training requirements, he had to reuse transcendent regeneration for hundreds or thousands of years. There was no way he would do something that useless.</p><br/><p>As such, Yu IlHan pondered on how to recover rest energy that would normally be filled with rest, with another method.</p><br/><p>The first thing he could think of was Na YuNa’s holy power. However, she wasn’t an item that Yu IlHan could carry around like a battery. Then what else? What came to his mind then was the troll’s blood.</p><br/><p>As soon as he thought that, he started making the bloodrink and… it became like now. At least several thousand liters were packed into small portions and were waiting for their consumption within the Cross Bag.</p><br/><p>Yu IlHan calmly explained to Erta, who was looking at him dumbfoundedly.</p><br/><p>“Trolls only eat and sleep and eat and sleep, rinse and repeat. Their blood is full of rest energy due to that, and isn’t that concentrated energy that’s healing their injuries fast? I thought like that.”</p><br/><p>[Of course, it should be.](Erta)</p><br/><p>“Then, wouldn’t this bloodrink, which is made by refining troll’s blood, be the only drink that would be able to recover rest energy in this world?”</p><br/><p>[Probably, if you have extreme poison resistance that is.](Erta)</p><br/><p>“Yes. This bloodrink isn’t simply a potion-replacement that recovers injuries fast. This is a specialized potion to train transcendent regeneration!”</p><br/><p>His conclusion was very absurd, but at the same time, very reasonable. Well, he just recovered rest energy using bloodrink right now, so it just got proven!</p><br/><p>And just 200ml worth had enough effect of 3 to 4 hour rest. This was really a rest drink.</p><br/><p>[Oh my, you’re right. Just how did I not think of that until now? No, just why did other people not think of training transcendent regeneration with troll’s blood?]</p><br/><p>“They didn’t learn it, that’s all.”</p><br/><p>[Ah.]</p><br/><p>Erta ended up acknowledging Yu IlHan’s nonchalant reply.</p><br/><p>Since Rest skill was unimaginably hard to learn and train, there weren’t many who mastered it.</p><br/><p>Naturally, those who learned transcendent regeneration would be few as well.</p><br/><p>There maybe cases where they learn a similar skill to transcendent regeneration due to the special characteristics of a class or a race. The demon race, which are the higher existence of Breakers, and the innate overlords, the dragonkin are like that. Holy knights were known to have a similar skill when their job reached the extreme.</p><br/><p>However, those were not transcendent regeneration. They were skills with a different effect, a different penalty, and different requirements to use.</p><br/><p>Perhaps, Erta maybe might currently be with a man who may master transcendent regeneration for the first time in the multiverse.</p><br/><p>Of course, all this was not possible without extreme poison resistance. It was truly absurd, but currently, Yu IlHan was the only(Yu IlHan) existence who was perfectly ready to train transcendent regeneration!</p><br/><p>[Extreme Poison Resistance Skill has become level 8.]</p><br/><p>[Cooking Skill has become level 15.]</p><br/><p>“Oh, other skills level up too.”</p><br/><p>Regardless of refining the troll’s blood or not, it was still extreme poison, so when he drank it, extreme poison resistance skill would grow. Since it was also a high difficulty cuisine with the ingredients being extremely toxic, just drinking it would increase the cooking skill as well.</p><br/><p>[I’m tired of getting shocked so I won’t. Although I’m forgetting nowadays, higher existences are able to control their emotions.]</p><br/><p>[ZzzZzz.]</p><br/><p>To be more shocked, it would affect her pride, so Erta started controlling her emotions. Along with the ever-sleeping angel Lita, Yu IlHan proceeded to the deeper part of the mutated species dungeon.</p><br/><p>In front of Yu IlHan, who could finish all monsters with two strikes even with the penalty from the superhuman strength skill, the dungeon was being destroyed at a frightening rate.</p><br/><p>Author’s notes</p><br/><p>In the last chapter, some people were doubtful about the prices of the weapons, so to explain, Kang MiRae only offered the highest price she could after considering the abilities of the smith, the level of the materials, the magic stone, and all other elements! We know of Yu IlHan’s ability, but the only thing she knows that he has a connection with a smith with level 29 mana crafting! Meaning that she isn’t just trying to buy a legendary equipment with 10 billion won!</p><br/><p>Answer – Bloodrink was a drink to train transcendent regeneration. There are people with extraordinary deductive powers…</p><br/><p>Skill training labor should be done in groups…</p><br/><p>Translator’s notes</p><br/><p>I’m NOT translating Onomatopoeia… I’m just leaving it as it is… how do birds cry when they are injured…? chirp chirp? How do they cry when they’re delighted? Still chirp chirp…</p><br/><p>Translator : Chamber</p><br/>\n</div>"}