{"title": "Chapter 65: I am also a Building Owner – 4", "id": 65, "volume": 1, "url": "http://boxnovel.org/everyone-else-is-a-returnee-chapter-65-i-am-also-a-building-owner-%E2%80%93-4", "volume_title": "Volume 1", "body": "<h1>Chapter 65: I am also a Building Owner – 4</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Yu IlHan, who had first come home, became stupefied by the flood of photos that came through his mobile messenger, which came from Na YuNa, because his mobile messenger app automatically added her as a friend the moment they exchanged numbers.</p><br/><p>The photos contained information on the building inside Gangnam reinforced district, that he was supposed to take over. At the end of the message, there was a curse message, saying that she would contact him frequently. He really wanted to delete her number immediately, but for his aims, there was a need to keep in contact with her.</p><br/><p>Na YuNa also knew this, so this may have made her send cute and annoying emojis, trying to become closer to him.</p><br/><p>More than that.</p><br/><p>“What do I do…”</p><br/><p>Somehow, he now had become an owner of a building. And this was no ordinary building, but one inside the Gangnam reinforced district where many ability users, hired by various VIPs and those in power, were keeping strict security!</p><br/><p>[Loan them out for rent, and you’d become filthy rich.](Lita)</p><br/><p>[It’s kinda funny how they’re bragging about ‘reinforced district’, when the ones protecting them are only around level 40, but it is for sure that this would become the center of Korea for a while. It’s no loss owning it, right?](Erta)</p><br/><p>That was true; by selling a staff and a robe, Yu IlHan had instantly entered the center of Korea.</p><br/><p>Just having a lot of money didn’t allow one to enter the Gangnam reinforced district. Above all, the ones with the vested interests would not allow it to happen.</p><br/><p>However, somehow, Yu IlHan now had a connection with Kang MiRae, who was one of the top-runners in both the ones with vested interests, and in financial power. As a result, he could enter the center of Korea too easily.</p><br/><p>The problem was that Yu IlHan didn’t find that fact that helpful.</p><br/><p>“This kind of building is doomed with a stomp from a monster, though?”</p><br/><p>In the current world, there was nothing more false than visual treasures. Of course, Yu IlHan had no such greed in money in the first place, but the world as it is right now was like that as well.</p><br/><p>Do they know? That the land that they’re desperately guarding, is just a delusion that would collapse with the appearance of a single shadow leopard.</p><br/><p>“i wonder if they don’t know, or they can’t do anything even if they know; since they’ve been to other worlds and all.”</p><br/><p>[Strong people over level 50 are not that common.](Erta)</p><br/><p>[Humanity’s growth rate is exceptionally fast. Wouldn’t the guarding forces become stronger as well?](Lita)</p><br/><p>Yu IlHan truly wished that it would become so. And he was moving around for that objective as well.</p><br/><p>At that moment, Lita clapped her hands and spoke to Yu IlHan.</p><br/><p>[Perhaps, that woman, may have given IlHan the building in order to draw him to her side?](Lita)</p><br/><p>“Yeah, that’s probably it.”</p><br/><p>Yu IlHan also expected that much. She may have thought that Yu IlHan would do something if Gangnam was in danger, even if to protect his own assets.</p><br/><p>Thinking that Na YuNa was the one to bring it up, he judged that she wasn’t such a klutz.</p><br/><p>“20 billion was fine too.”</p><br/><p>“Of course, that would only work against people who were greedy for money. Yu IlHan only wanted to enhance the Empress’ power in the first place, so there was no way he would become obsessed with protecting the building; he couldn’t care less.</p><br/><p>He couldn’t care less, but he thought that he might be able to achieve something he wanted to do with that building.</p><br/><p>“That building would receive everyone’s attention.”</p><br/><p>[Well, it is in the yolk part of the commercial center of Korea.](Erta)</p><br/><p>[So, there were some famous brand stores but some left this time. Well, the Great Cataclysm shakes the original standards.](Lita)</p><br/><p>Yes. A developing industry might start to regress, and a completely unattended industry might develop as well. Earth, which was advancing and making different standards to other worlds, was making a society unseen anywhere else, after the Great Cataclysm.</p><br/><p>However, there was one industry that would never collapse as long as monsters existed in the world.</p><br/><p>The arms industry.</p><br/><p>“That’s good. I’ll just sell here.”</p><br/><p>[You’re quite optimistic?]((Lita)</p><br/><p>“Well, anything would never end if you hesitate. I should get this over with quickly and do something else.”</p><br/><p>[Work again without rest!?](Erta)</p><br/><p>Playing soccer in physical education class in middle school was like that. He didn’t want to play but he needed to at least pretend he was playing, but the ball won’t come his way; he would get treated like an invisible man, and to just leave, he was scared.</p><br/><p>And as such, he felt the time until the end of the class was so long. If there was a room of mentality and time, then it was probably there. (T/N: No idea what this means)</p><br/><p>[Whoa, there are 14 floors too!](Lita)</p><br/><p>[There are 5 floors underground as well. Until B3 is a parking lot, but 4th and below seem to be locked.](Erta)</p><br/><p>[You should contact a management company.](Lita)</p><br/><p>[This jewelry looks really nice.](Erta)</p><br/><p>[IlHan, give this noona a necklace.](Lita)</p><br/><p>These angels, despite looking like they had no desire for worldly items, were being delighted after looking at the details of the building. It seemed like women were the same whether they were higher existences or not. Rather than that, they sure did talk when they were talking about how this was all Na YuNa’s scheme and whatnot just a moment ago.</p><br/><p>However, Yu IlHan didn’t stop them. In his head, another plan was already forming. Enhancing the people of Earth, with this building as the center!</p><br/><p>“Let’s decide on a brand name.”</p><br/><p>[How about Angel Love?}(Lita)</p><br/><p>[Let’s go with Unique.](Erta)</p><br/><p>Rejecting Lita’s nonsensical suggestion, Ertaa suggested. However, Yu IlHan shook his head.</p><br/><p>“I’m embarrassed so no.”</p><br/><p>[How about Y&amp;L?](Lita)(T/N: One of the reason why I changed Rita to Lita)</p><br/><p>[I can see your intentions clearly in that name. Then let’s go with Savior.](Erta)</p><br/><p>After that Angelove, Hammer of Hephaestus, Feather Wing, God Hand, and such embarrassing and exaggerated suggestions came out, but Yu IlHan ignored them all.</p><br/><p>“Let’s go with Vanguard.”(T/N: Zhan Long, anyone?)</p><br/><p>Vanguard, the front most soldier of the battlefield. This name contained Yu IlHan’s desperate wish to fall behind, as he was unintentionally at the front most of the people of Earth.</p><br/><p>As soon as he decided to act, Yu IlHan moved quickly. First, he cleared up the problem regarding the transferring the rights to the building, and had a meeting with the people related to the building. The wolf skull mask was too well known as a sign of Sungdaein Bolt, so he used another mask.</p><br/><p>The people never seemed to have imagined that the owner was the strongest ability user in Korea. The tenants all finished talking with him, and the only fact they were able to get was that their new owner had a grade 8 syndrome.</p><br/><p>And some, left the building with sufficient compensation.</p><br/><p>Yu IlHan bought an apartment near the building he received. Once, this apartment boasted the greatest price in Korea, and now, it became even more expensive due to being within the Gangnam reinforced district, but since Yu IlHan had 150 billion won, he bought out the entire top floor. tens of billions flew away like that, but he didn’t mind.</p><br/><p>[My IlHan spends his money so well too. So cool.](Lita)</p><br/><p>[That’s because he doesn’t have any desire for money.](Erta)</p><br/><p>Never did he manage a building in his life, so he hired a management company, like what Kang MiRae had advised, and decided to not care anymore about it.</p><br/><p>The only thing important to him was the space for himself to use and manage.</p><br/><p>He also moved his workshop to the 5th underground floor of the building. Angels helped him out in this one. Somehow, only the males were summoned, but they all had good impressions towards Yu IlHan.</p><br/><p>[Aha, so this is the promising guy?]</p><br/><p>[I think you might be able to become an angel some day.]</p><br/><p>[No, we can’t give him a cast of an angel to this kind human.]</p><br/><p>[That’s true.]</p><br/><p>All the things in the workshop was moved to the 5th underground floor of the building in Gangnam, and while they were at it, they also enhanced the protective magic on it. On the building, and on some of the floors too! Thanks to the fact that Yu IlHan had become an Angel’s Partner, he could receive some minor help like this in everything he did.</p><br/><p>“Good environment.”</p><br/><p>Looking at the underground workshop that kept its silence due to the soundproofing magic, and the eternal flame that burned strongly within a bigger, new furnace, Yu IlHan smiled.</p><br/><p>“Then should I start?”</p><br/><p>He didn’t go through mana crafting. Using the byproducts from monsters between level 30 and 40, which he had a pile of in his Cross Bag, he made swords, spears, axes, hammers, shields, breastplates, shoulderplates, shinguards, boots, gauntlets, etc.</p><br/><p>As he didn’t use the byproducts from Metal Hearts or Quegnae, they were mostly made of bone or leather, but even so, their performance was truly vicious to the point that they couldn’t be seen easily in other worlds as well. For example, there was something like this.</p><br/><p>[Frightening Hard Leather Gauntlet]</p><br/><p>[Rank -Rare]</p><br/><p>[Defense – 1,900]</p><br/><p>[Options – 10% increase in attack power in close combat.]</p><br/><p>[Durability – 1,500/1,500]</p><br/><p>[A mass produced armor that the world’s best smith had made using low quality materials. Other smiths would curse on their own ability upon seeing this.]</p><br/><p>Such weapons with nonsensical performance were produced in units of tens per day. Because Yu IlHan didn’t put his heart into it? Yu IlHan had never not put in his heart in anything, and even if he did, there was no way a single blacksmith would produce tens of weapons per day.</p><br/><p>Yu IllHan’s work had already escaped the range of an ordinary person’s reason. He looked like he wasn’t moving fast, but despite that, swords and shields and breastplates kept popping out.</p><br/><p>[I don’t think he’s at a point that’s possible by just hammering on metal for a few hundred years. He isn’t even using metal either.](Erta)</p><br/><p>[Did you just realize that it was strange?](Lita)</p><br/><p>Yu IlHan thought that now was the most important time for him. Earth had gone crazy, and it seemed like the 2nd Great Cataclysm, planned 150 years in the future, may arrive at any moment. Reta Kar’iha was nagging him to grow fast, and it was unknown what other forces may be targeting Earth from another world other than dragons.</p><br/><p>Even so, he kept hammering away.</p><br/><p>He had to live a very long time when the Earth was stopped, and during those years, he had learnt to live correctly and not quickly. Being hasty would make things fail, and trip over a stone.</p><br/><p>Yu IlHan thought that now was the time, that he had been announced the shocking news from Reta Kar’iha, to walk on the right path.</p><br/><p>Endlessly, truly endlessly he hammered away and raised his techniques beyond perfection, raised Eternal Flame, tried to feel mana by sticking as close to the angels as possible, tried to listen to other souls than Reta Kar’iha, and checked on the skills that he had learnt.</p><br/><p>He reconfirmed his titles, saw the limits of his status points, looked back to the techniques engraved in his body, not the skills, and rechecked on his equipments.</p><br/><p>Then he thought not about the ones he had to do, but the ones he could do.</p><br/><p>The worst villain appearing in an anime once said something nonsensical that great responsibility followed great power, but Yu IlHan thought that power that’s swung around by responsibility would never become strong.</p><br/><p>To Yu IlHan, power was not something to protect today, but the ability to make tomorrow.</p><br/><p>While Yu IlHan was working, a lot of things happened outside as well.</p><br/><p>There was an interior reconstruction in the 13th and 14th floor of the building, a corporate was formed, the brand, Vanguard, was registered, Lita did her special training, and the interior construction in the top floor of the apartment had ended. He hired people to work in his shop, and made a passport.</p><br/><p>2 weeks flew past like that. Just as Yu IlHan was about to rest after making a spear, a few green lines of texts appeared on his retina.</p><br/><p>[From a dimension far away, the God of Smithing, ???, has discovered you.]</p><br/><p>[The God became shocked at your ability to make miracles without the power of miracles. He wants to give you a blessing.]</p><br/><p>[If you fulfill two more tasks, the blessing of the God of Smithing, ???, would descend upon you. The contents of the tasks are……]</p><br/><p>Becoming dizzy at the hook that came from a direction that he had never imagined, Yu IlHan read down the text again.</p><br/><p>However, he had neither read wrong, nor was it an illusion. He didn’t know who the God of Smithing was, but it was true that he wanted to give blessings to Yu IlHan so suddenly, when he was just working. It seemed like this God truly had a lot of free time.</p><br/><p>“Erta, it says here that the God of Smithing will give me blessing after I do some homework.”</p><br/><p>[……Heh, I am not surprised at all.](Erta)</p><br/><p>Erta, who rolled off from the top of Yu IlHan’s head, said that in mid air with her legs trembling. Calmly placing her on his palm, he asked.</p><br/><p>“Is this God of Smithing and the God you follow the same guy?”</p><br/><p>[No.](Erta)</p><br/><p>“Are they existences on an equal level?”</p><br/><p>[Not at all. Lord God is a unique existence across all the worlds, but they aren’t like that.](Erta)</p><br/><p>“That means that they aren’t unique, right? Are there like hundreds of the same God of Smithing?”</p><br/><p>[No, it was ½ probability, but unfortunately, you guessed wrong.]</p><br/><p>Erta replied with a small smile.</p><br/><p>[God of Smithing, God of Warriors, Goddess of Beauty…… They are each unqiue, but they do not exist.](Erta)</p><br/><p>“Oh my.”</p><br/><p>Yu IlHan became shocked.</p><br/><p>He didn’t even ask and Erta gave him a simple answer!</p><br/><p>[I think you’re imagining something very rude right now.](Erta)</p><br/><p>“I thought you were pretty.”</p><br/><p>[So it was something rude.](Erta)</p><br/><p>Yu IlHan said a lie that wouldn’t work at all, but Erta replied coyly while touching her black hair. (T/N: So Erta had black hair… I thought all angels were blond…) She seemed to become slightly happy even though it was a lie. With a faint smile, she continued.</p><br/><p>[They don’t exist for real. They are only false egos that were born after countless records of a specific field had gathered. They could be called a byproduct of the Akashic Record.](Erta)</p><br/><p>“Such nonsensical things are possible?”</p><br/><p>[Why are you able to live and breath here right now?](Erta)</p><br/><p>Yu IlHan lost his words. So he asked something else.</p><br/><p>“The blessing he wants to give me?”</p><br/><p>[What can an ego made of records give out? Of course, records. What’s different about a blessing is to the rewards of the Heaven’s Quest is that we add our power into a record that you already have, but they process a completely new record to give you.](Erta)</p><br/><p>“Why?”</p><br/><p>[Because more records related to smithing would pile up the more you progress as a smith.](Erta)</p><br/><p>All records and achievements by Yu IlHan as a smith would enhance the abilities of the God of Smithing. He wasn’t sure what that blessing would be about, but it should probably enhance his smithing abilities.</p><br/><p>So, putting it in an old-fashioned way, it was a win-win scenario.</p><br/><p>He accepted that point, but there was something that he still couldn’t understand.</p><br/><p>“If a God is only a false ego, then what the hell is holy power? The power that Na YuNa wielded; healing injuries and strengthening the body.”</p><br/><p>[I will explain about that to you next time, so just know that it is a type of mana for now. Anyway, if it’s you, there won’t come a time where you would use holy power of the God of Smithing, so don’t get your hopes up on that.](Erta)</p><br/><p>“Quick-witted as always…”</p><br/><p>Yu IlHan inwardly imagined himself doing tanking, dealing, and healing all by himself, but his expectations had been completely shattered. Just as Yu IlHan was stretching himself with a sigh, Erta asked while tilting her head.</p><br/><p>[So, what are those tasks? You said that he didn’t give the blessing out for free?](Erta)</p><br/><p>“Not telling.”</p><br/><p>[Are you picking a fight?](Erta)</p><br/><p>“No, not that.”</p><br/><p>Yu IlHan ended up laughing. However, his laugh contained unconcealable rage.</p><br/><p>“That fucker isn’t telling me what the tasks are.”</p><br/><p>[……]</p><br/><p>It was fortunate that this God was a false ego beforehand.</p><br/><p>If he didn’t, then he would have wandered around several worlds looking for this God of Smithing, to smack him, in vain!</p><br/><p>Author’s notes</p><br/><p>1. There was a reader who asked about God some time ago. I hope your questions were alleviated a little.</p><br/><p>2. Thanks for the passionate reactions. It should be better for me to not say whether it is harem or not. I’m scared that I might be led by the majority. There is an ending I’m thinking of, but it might become different according to the progression, so I won’t give you a clear answer from now.</p><br/><p>What I can tell you now is that because Yu IlHan has no interest in romance (Because he’s busy surviving) it would take a long time before romantic details appear, and the opposite sex he feels the closest with is Lita, but he is thinking of her as a family, not the opposite sex. The path our IlHan has to walk is 90 thousand li, so you don’t have to focus on just Lita! Of course, I find Lita cute as well, though!</p><br/><p>Translator’s notes</p><br/><p>Romantic details do appear… That’s like… in X more chapters though…. (X is censored due to being a spoiler)</p><br/><p>Translator : Chamber</p><br/>\n</div>"}