{"title": "Chapter 66: I am also a Building Owner – 5", "id": 66, "volume": 1, "url": "http://boxnovel.org/everyone-else-is-a-returnee-chapter-66-i-am-also-a-building-owner-%E2%80%93-5", "volume_title": "Volume 1", "body": "<h1>Chapter 66: I am also a Building Owner – 5</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>The start of the brand, Vanguard, was very simple.</p><br/><p>Of course, no one would describe a brand starting in the Gangnam reinforced district as ‘simple’.</p><br/><p>However, it might not be wrong to say it’s simple since Vanguard, that appeared out of nowhere, started with just a sign board without any advertisements.</p><br/><p>Moreover, that brand, despite using the 13th and 14th floors of a building, had locked away the 14th floor entirely. Even a person who had business in other floors questioned that fact.</p><br/><p>“Is it a storage room? No, it shouldn’t be. The rent here is huge.”</p><br/><p>That didn’t matter since the brand owner was also the owner of the building.</p><br/><p>“Just with what confidence did someone hang a poor looking sign in the middle of Gangnam? At least they could tell people what they’re selling. Debt and stock must be piling up soon.”</p><br/><p>That didn’t matter since the owner had a lot of money.</p><br/><p>Of course, the other people didn’t know of those circumstances. The majority laughed awkwardly upon seeing it, and some laughed in loathing.</p><br/><p>The rest of the people, came to the 13th floor to ask what kind of store it was.</p><br/><p>And they could understand that the brand Vanguard meant what the word really meant.</p><br/><p>“Welcome to Vanguard.”</p><br/><p>The two employees that Yu IlHan had picked out after personally interviewing them, greeted the customers. One guide, and one at the counter. He thought about just taking one, but he decided on two after thinking about it.</p><br/><p>However, the customers weren’t ready to receive the welcomes of the employees. They had become absent minded after seeing the weapons in display.</p><br/><p>“Just what is…”</p><br/><p>“What are these, weapons? There are finally these kind of stores?”</p><br/><p>Strictly speaking, it wasn’t that there were none of these stores until now, but none of them were as accessible as Vanguard. Well, there was no helping it, because despite the fact that blacksmiths existed on Earth, they did not have the ability to make better products than the artifacts in other worlds. Not to mention, factory produced weapons.</p><br/><p>“If you want, you can check the information of the products by grabbing them, but you are not allowed to swing them.”</p><br/><p>“I wondered what was up. It looks okay on the outside. Let’s go back. There’s no way they are better than those in other worlds, right?”</p><br/><p>“But they look cool. Let’s just look at the information. I can check this one, right?”</p><br/><p>“As you wish. However, if you step outside with a product that you haven’t purchased, then the sensor would activate so be careful.”</p><br/><p>The employees were only warned of 3 things from Yu IlHan.</p><br/><p>First, Vanguard would only operate once a week, on Monday, from 10 a.m. to 5 p.m. They wouldn’t be able to enter on other days.</p><br/><p>Second, one customer may buy up to 2 products.</p><br/><p>Third, merchants are not allowed.</p><br/><p>Unlike the companion that wanted to go back after thinking that only the outside looked pretty well, the man who could somehow check that the blade of the sword was at least very straight and sharp, grabbed the bastard sword as soon as the employee’s permission fell.</p><br/><p>This man had hunted quite a lot both in another world and on Earth, so his level was 22. He was long past the time he would sway due to the weight of the weapon.</p><br/><p>“Wow.”</p><br/><p>As such, he knew as soon as he picked up the weapon; how perfect the balance of the bastard sword was, and how good the grip was.</p><br/><p>Even if the performance of this weapon wasn’t that good, he would be satisfied; he could feel the sincerity of the crafter.</p><br/><p>Despite that, he could only get frightened after seeing the text appearing on his retina.</p><br/><p>[Sharp Wolf Bone Bastard]</p><br/><p>[Rank – Rare]</p><br/><p>[Attack Power – 1,950]</p><br/><p>[Option – The wielder can cut apart those with higher defense than the attack power of this sword.]</p><br/><p>[A mass produced weapon made by the world’s best smith, using low quality materials. Despite the fact that its power does not lack, this bastard was made with common materials and it shows the path that mass produced weapons must go.]</p><br/><p>“Just, what is…”</p><br/><p>“It’s trash, right? So let’s go to somewhere else.”</p><br/><p>“Yes. You can go all you want.”</p><br/><p>Kicking his colleague that was speaking nonsense, the man asked the employee.</p><br/><p>“Is this sword I grabbed coincidentally this powerful? It’s not, right?”</p><br/><p>“Of course it isn’t. It’s Vanguard standard.”</p><br/><p>“Vanguard standard…”</p><br/><p>An exceptional product that even the 2nd class, the top of the Earth’s ranking right now, would receive without hesitation, was the brand’s standard. The man could only laugh awkwardly/</p><br/><p>“Oh my god. Just what is happening on Earth?”</p><br/><p>“Why are you being so annoying! Huh?”</p><br/><p>The colleague couldn’t stand the man’s hype, and picked up a dagger nearby and ended up screaming. The dagger’s attack power was a staggering 1,300 despite the fact that it looked like it was carved from a bone at most. He didn’t want to believe his eyes, but he knew very well that he couldn’t not believe it.</p><br/><p>They exchanged glances. Then asked the employee with one mind.</p><br/><p>“How much is it?”</p><br/><p>The employee replied with a clean smile.</p><br/><p>“All Vanguard’s standard weapons are 100 million won each, sir customer (85,000USD). You can also buy them with suitable monster byproducts.”</p><br/><p>The thing Yu IlHan thought about the most while making weapons was of course, the price. Honestly, he wanted to give them out for free to give everyone an opportunity, but he knew very well that opportunity was called opportunity because it could not go in everyone’s direction. There was no way he would be able to make weapons for all the people of Earth.</p><br/><p>As such, it was 100 million. A margin between what could prove his value, and what other people could afford. Yu IlHan thought that margin as 100 million.</p><br/><p>Like how Yu IlHan did not know of all the circumstances of all the people, he knew the fact that there would be people who wouldn’t be able to buy these weapons despite their sufficient qualifications and talent, and that there would be people who would buy these weapons despite the fact that they had neither motivation nor ability to move forward. However, who would be able to calculate everything? Didn’t even God fail?</p><br/><p>As such, he thought that this was the best he could do. If he was wrong, then he would change it later.</p><br/><p>“No way, such a good weapon only costs 100 million!? People would line up even if this was sold at 5 billion!”</p><br/><p>“However, we don’t even have that 100 million.”</p><br/><p>“That’s true.”</p><br/><p>The first customers could not buy the weapons so they left helplessly.</p><br/><p>Like modern people who liked to gossip, they started chatting about Vanguard on mobile messengers and various SNS, and as they had expected, that information grabbed a huge amount of attention almost instantly.</p><br/><p>[Anyone heard of Vanguard?]</p><br/><p>[I think it’s a lie though.]</p><br/><p>[I just bought a breastplate and a warhammer. I won’t make this long. Anyone that has money should run there right now. Just think that you’re deceived and go. It’s a waste of time just waiting.]</p><br/><p>[Ah, shit. It’s definitely a lie but it keeps nagging on my mind.]</p><br/><p>[We sold our house and bought weapons for my little brother and I. I don’t know who the owner is, but thank you so much.]</p><br/><p>[You bought a weapon after selling your house? It looks like that guy is really well off.]</p><br/><p>[Wao, things turned out like this!](T/N: Guess who)</p><br/><p>Nothing was sold in the first 2 hours of the store opening, but on the third hour, 2 were sold at once, and 50 more on the two hours after. Then, the store closed.</p><br/><p>Not even one week had passed, only half a day had passed and the gossip had spread around to many people, and they all wanted to buy the items, but the employees who were instructed strictly by Yu IlHan, had locked the store as soon as it became 5 p.m.</p><br/><p>There were some who tried to force their way in, and those who tried to sneak in and steal, but they all failed just before they could succeed. The magical protection that blocked them, top be exact, the angels’ protective magic, was the reason.</p><br/><p>“It’s obvious, but it is no ordinary store.”</p><br/><p>“Just what the hell is it? Is this prepared by the one called God?”</p><br/><p>“Wouldn’t he give out quests rather than asking for money?”</p><br/><p>The people asked the employees who were leaving work, but since they were only hired by Yu IlHan, they could not answer the questions.</p><br/><p>There were only 3 that knew how things worked right now, excluding Yu IlHan. Kang MiRae, Kang HaJin, and Na YuNa. On a round table, they were talking about the situation that happened after they gave out the building to Yu IlHan.</p><br/><p>“Just what is that person… fuu. It’s tiring to just say it. He shouldn’t have taken the smith here to Earth, right?”</p><br/><p>“You know very well that that’s impossible, oppa. It’s his ability. He would be supplied from another world, and release them on Earth.”</p><br/><p>Kang MiRae replied in a cold tone after looking at the performance of the shoulder plate and the boots that Kang HaJin had bought himself. After realizing that he was feeling the same emotion as the one that his little sister was feeling, Kang HaJin just made a bitter smile.</p><br/><p>“Yes, that must be true. It’s not that his own ability is good. I thought he was a quiet kind of guy, but he had an unbelievable connection like this. Just what did he do to receive total support from such a smith?”</p><br/><p>“I don’t think it would just end with ‘such a smith’. It says the best across all worlds. ALL WORLDS.”</p><br/><p>Na YuNa pointed out Kang HaJin’s error. All worlds, it couldn’t be said lightly, but the item’s info was as such, so there was no helping it.</p><br/><p>So, this meant that the crafter that made this shoulder plate had a better ability than any of the smiths in other worlds. It wasn’t a level that could be reached just by hammering away for hundreds of years, but only Yu IlHan himself didn’t know that.</p><br/><p>“It’s a good thing for Earth. It’s unbelievable, but this business of his is only an extension of the trade he had with me. He really is an upright person.”</p><br/><p>Kang MiRae concluded. She had a face that had non-acceptance written on it. SHe was feeling slightly touched, and a bigger rage; faint hope and deep despair.</p><br/><p>“Fuf, Fuffhi.”</p><br/><p>Suddenly, Na YuNa made a weird laugh. The siblings thought that she put on a stone mask, (T/N: Google tells me stone mask is “Ishikamen” from JoJo) but it wasn’t that. She just found this situation too funny.</p><br/><p>“Puhi, puhihihi.”</p><br/><p>“Na YuNa, did you get inflicted with mental magic or something?”</p><br/><p>“Puhhh, Nooo. Just, huhu. I just understand.”</p><br/><p>Na YuNa made a nonchalant wink that didn’t fit with her idiotic laugh. Naturally, Kang MiRae asked back, stupefied.</p><br/><p>“What do you understand?”</p><br/><p>“A little, more than MiRae though.”</p><br/><p>“Nonsense.”</p><br/><p>Kang MiRae’s brows twitched. Kang HaJin, who realized that she had become enraged, tried to stop Na YuNa, but stopping here was not worthy of Na YuNa’s name. She kept laughing and touched the shoulder plate in front of her eyes.</p><br/><p>“How funny. How can this be? It’s so interesting.”</p><br/><p>“What a coincidence, I also think it would become much more interesting now.”</p><br/><p>In Kang MiRae’s two hands sparked golden lightning. If Kang HaJin didn’t stop her, either Na YuNa would have blown up or the office would have blown up.</p><br/><p>“Should I tell you what’s so interestiiiing?”</p><br/><p>“Shut up.”</p><br/><p>“MiRae’s so cute when angry too!”</p><br/><p>“Stop.”</p><br/><p>Kang HaJin smacked Na YuNa’s had while sighing. Leaving her, crying while stroking her forehead, he took back the shoulder plate and the boots before placing a pile of paperwork on the table.</p><br/><p>“Enough about Mr. Yu IlHan. Us moving won’t really help anything, but I’ll do something about it. Shall we go onto our work, Clan Master?”</p><br/><p>“Fuu.”</p><br/><p>Clan was something that both Kang MiRae and Kang HaJin had once offered to Yu IlHan. It referred to an group of ability users based in Korea.</p><br/><p>Kang MiRae was the master while Kang HaJin was the vice-master, and Na YuNa was just an ordinary member. The clan members were just those three.</p><br/><p>Until now, that is.</p><br/><p>“The number of clans that officially made themselves known numbers in the hundreds just until now. There are some small scale groups that made themselves known in Korea too. Delaying anymore would make this half-hearted. To bring your name up, we should start doing activities after receiving members.”</p><br/><p>“Yes, we should.”</p><br/><p>Kang MiRae nodded obediently. Her expression was still complex, but the words from her mouth were very clear.</p><br/><p>“Let’s start recruiting the members of the ‘Lightning God’ clan.”</p><br/><p>“It’ll be better if we change the name though…”</p><br/><p>“Shut up.”</p><br/><p>Meanwhile, Yu IlHan, who had unintentionally made the executives of the Lighting God clan chaotic, was…</p><br/><p>[You have earned 2,989,744 experience.]</p><br/><p>[You have earned the record of Lv 93 Dark Shadow.]</p><br/><p>[Killing a 2nd class with concealment in one strike with a surprise attack 1/3,000]</p><br/><p>“Ah shit. How is this any ‘easier’!”</p><br/><p>[Well maybe it was killing a 4th class in one strike with a surprise attack before.](Erta)</p><br/><p>[Zzzz.](Lita)</p><br/><p>…currently training alone to evolve his concealment skills in the most dangerous dungeon in the world.</p><br/><p>Author’s notes</p><br/><p>1. I wanted to convey the feeling that people were adapting and changing to the world after the Great Cataclysm in a viewpoint other than the main character. How was it? Did I convey it well?</p><br/><p>2. Since he hadn’t set up Vanguard to earn money, the standard weapons will end at 100 million won! Well, there’s no price for the materials so he would still profit.</p><br/><p>3. Concealment skill evolution criteria doesn’t end with just that.</p><br/><p>Translator’s notes</p><br/><p>Enjoy~</p><br/><p>Translator : Chamber</p><br/>\n</div>"}