{"title": "Chapter 63: I am also a Building Owner – 2", "id": 63, "volume": 1, "url": "http://boxnovel.org/everyone-else-is-a-returnee-chapter-63-i-am-also-a-building-owner-%E2%80%93-2", "volume_title": "Volume 1", "body": "<h1>Chapter 63: I am also a Building Owner – 2</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Lita said she would come back soon, but she didn’t come back even until when Yu IlHan went to sleep after he left the dungeon and came back to Korea.</p><br/><p>When she didn’t come back even though it was the afternoon, Yu IlHan started being worried about her.</p><br/><p>“Did something happen?”</p><br/><p>[……Wouldn’t she come back alive and well when it’s time?](Erta)</p><br/><p>Erta said in a slightly dissatisfied voice. She wouldn’t want to admit, but she was currently jealous of Lita. She didn’t think that Yu IlHan would slightly panic just because Lita came back one or two days late.</p><br/><p>“It was alright when I thought I wouldn’t be able to meet her again, but now that she’s not here when she’s supposed to, it feels slightly weird.”</p><br/><p>[Do you like Lita?](Erta)</p><br/><p>“Yeah, I like her.”</p><br/><p>Yu IlHan replied immediately without hesitation.</p><br/><p>“She’s the only non-family member who cherishes me without any ulterior motives.”</p><br/><p>[……Oh, really, now…](Erta)</p><br/><p>Yu IlHan was having a huge misunderstanding. If Lita didn’t have any ulterior motives, then the men who gather at clubs in Gangnam were daoists. Lita’s figure of busying herself with just that one feeling of hers without any regard for pride and arrogance of a higher existence, was a marvel.</p><br/><p>Erta really wanted to tell him that, but she was afraid what he would do after she did so, so she couldn’t say it out aloud.</p><br/><p>‘To think that my emotions are being swayed by confronting a mere human, I’m disqualified as an angel. The biggest problem is that I’m thinking it is alright to do this. Aah, this is making me crazy.’</p><br/><p>Heaving a small sigh, Erta obediently lied on Yu IlHan’s head. She just wished that this ripple wouldn’t last long.</p><br/><p>At that moment, Yu IlHan said in a bland tone.</p><br/><p>“Erta, you too. You always make me enjoy myself. I’m thankful for that.”</p><br/><p>[Wh, what’s this all of a sudden? I have a lot of ulterior motives for doing that! You’re misunderstanding quite a lot.](Erta)</p><br/><p>“What the hell are you saying?”</p><br/><p>Due to the panic of Yu IlHan’s sudden surprise attack, Erta said whatever was on her mind.</p><br/><p>Immediately after that, she realized the meaning of her words and screamed silently while rolling on Yu IlHan’s head, but he, who had talent in reading foreshadows, but had none in interpreting a woman’s words, just thought that they were jokes and laughed.</p><br/><p>“Well, then. Shall I go about creating the weapon to sell to the Empress?”</p><br/><p>He was still worried about Lita, but he couldn’t not work right now. His stamina returned while exchanging jokes(only he thought like that), so now it was time to start working.</p><br/><p>[I’m home!](Lita)</p><br/><p>But Lita just had to come back at that moment. It was more annoying since she said that in a bright voice.</p><br/><p>[This isn’t your home, Lita.](Erta)</p><br/><p>[The place where IlHan is my home!](Lita)</p><br/><p>It was frustrating since it actually sounded quite reasonable. However, while Erta was thinking up of about 20 lines that made angels go crazy, that Yu IlHan said in the two months without LIta, Lita embraced Yu IlHan.</p><br/><p>[I’m sorry I’m late, IlHan!](LIta)</p><br/><p>“[email protected]##$%&amp;#*@.”</p><br/><p>As she normally refrained from such direct skinship, it was more sudden. Moreover, the breathtaking, rich, elastic, good-feeling……Eeeei! (T/N: This is not the translator’s whim. It says that in the raws)</p><br/><p>“It’s embarrassing!”</p><br/><p>[No, I won’t let go until I charge up!](Lita)</p><br/><p>Yu IlHan pushed Lita away with a red face, but Lita, unlike usual, was very clingy. Heaven and hell assaulted Yu IlHan alternately.</p><br/><p>In contrast, Erta thought that there was a reason to why Lita suddenly became like this and asked her with narrowed eyes.</p><br/><p>[What happened, Lita?](Erta)</p><br/><p>[I’m going to get busy again.](Lita)</p><br/><p>“Even though you just came down?”</p><br/><p>[Yeah, that damned angel. I need to prepare for an advancement.](Lita)</p><br/><p>Yu IlHan’s resistance momentarily stopped.</p><br/><p>That was true. He had completely forgotten due to the story of the Abandoned World he heard from Reta Kar’iha, but a gate to another world opening in a dungeon was definitely not a normal matter.</p><br/><p>“So? What was actually up with that? You can explain, right?”</p><br/><p>[Yeah. I will explain it to you after just 48 more hours.](Lita)</p><br/><p>[If you do not get apart after 48 seconds, then I will report it above.](Erta)</p><br/><p>Even while gritting her teeth, Lita obediently left Yu IlHan at Erta’s knife-like declaration. After she clung to him for exactly 48 seconds more, that is.</p><br/><p>[I think there’s someone behind him. He seemed to get scared after we said we’ll kill him so he blabbed on about that.](Lita)</p><br/><p>[Behind? Do you mean a transcendent group?](Erta)</p><br/><p>[Probably.](Lita)</p><br/><p>Yu IlHan expected that much. That angel was not insane, why would he do something that would screw him over if he got found out? And alone too.</p><br/><p>“So? Who is that ‘behind’ person?”</p><br/><p>[Dunno.](Lita)</p><br/><p>“Ah, got it.”</p><br/><p>[Oooooooooouch.](Lita)</p><br/><p>Coincidentally, Lita was human sized right now. Yu IlHan commenced noogie’ing Lita. Lita suffered while flapping her wings.</p><br/><p>[But we really don’t know!](LIta)</p><br/><p>[There’s no way a higher existence would open his mouth with mere torture. He didn’t even say anything even with Lita’s 3000 air combo.](Erta)</p><br/><p>“Isn’t that because he was in too much pain to speak?”</p><br/><p>However, just because they didn’t know who was behind him, it wasn’t like they could do nothing in preparation. Increasing the ratio of higher ranked angels dispatched to Earth, and managing the dungeons more strictly would be able to prevent most situations before they got too big.</p><br/><p>[This is all thanks to IlHan.](Lita)</p><br/><p>“I was just lucky.”</p><br/><p>They were just coincidentally walking nearby and Lita noticed a dungeon concealment. If Yu IlHan did anything that was killing the mage before he could do anything. Just that.</p><br/><p>[There’s a lot to do. Cleaning up Daréu, and severing the connections with other worlds… If we think about how this all happened because we sent the humans of Earth to other worlds, I can only sigh. There probably won’t be another case where we prepare another world for a Great Cataclysm like with Earth.](Erta)</p><br/><p>[Probably, right? Well, I’m not gonna complain since I got to meet with IlHan thanks to that……but what? Daréu?](LIta)</p><br/><p>Erta and Yu IlHan told her that they talked with the thought of Reta Kar’iha. When they talked about how an Abandoned World was connected with Daréu completely, and that dragons were all over the place in that world, Lita asked back while blinking.</p><br/><p>[So? Why did it get connected to Earth?](Lita)</p><br/><p>“Dunno.”</p><br/><p>[Hey.](Lita)</p><br/><p>Yu IlHan’s counterattack saw light.</p><br/><p>[It seems she couldn’t understand to that point. In my estimation, as the Earth, which was static for 1000 years, got connected to numerous other worlds, the backlash due to that caused a chemical reaction in dungeons, which can be called a separate space despite belonging to Earth, and as a result, a path to another world was created.](Erta)(T/N: Such a long sentence dammit…)</p><br/><p>“Shortly.”</p><br/><p>[Earth was really unlucky. You will have to suffer a lot in the future too.](Erta)</p><br/><p>“Good, it makes me angry, but that’s much more direct.”</p><br/><p>Erta summed it up and Yu IlHan accepted. Lita resolved to learn to shorten everything clearly and directly.</p><br/><p>[Oh, yeah. Get your rewards, IlHan.]</p><br/><p>“Oh, yes, that happened.”</p><br/><p>Lita embraced Yu IlHan’s head again. Erta did wonder if she really had to give him the reward that way, but didn’t interfere this time.</p><br/><p>[Heaven’s Quest, Guarding Earth, complete!]</p><br/><p>[All status has increased by 4. Magic increases by an additional 10.]</p><br/><p>[The skill, Superhuman Strength, has become level 20. The duration of the skill increases.]</p><br/><p>[The skill, Critical Hit, has become level 20. The probability of critical hits activating increases.]</p><br/><p>[The skill, Leap, had become level 20. You can do a single additional leap in mid air.]</p><br/><p>The reward was 26 status points and a massive level up in a portion of his skills. This should be similar to when he acquired the superhuman strength skill, where his abilities were amplified using the power of the records from the monsters he killed.</p><br/><p>Not to mention the stats, the skills enhanced were all that influenced battle so he was very satisfied. The fact that his enemy was a 4th class mage probably increased his reward.</p><br/><p>Especially, even though the Leap skill was something he had acquired relatively recently compared to other skills, it was also increased to level 20 at once like the others. The fact that a new ability was added in that process was more wonderful. Now he could leap again without the use of mana.</p><br/><p>As the leap skill was derived from superhuman strength, he only predicted that the abilities of the monsters he killed were realized through this skill.</p><br/><p>“So, do you need to go back to Heaven, Lita?”</p><br/><p>[Not immediately, I’m just going to be away for a few hours a day until I advance for real. I will definitely follow you when you’re going to dungeons so don’t worry!](Lita)</p><br/><p>That was the solution. He was nervous for a moment thinking that he wouldn’t be able to meet her again. With a lightened heart, Yu IlHan took out a magic stone from his Cross Bag before flicking it. The Eternal Flame in the furnace flickered its tongue and swallowed it.</p><br/><p>“Then I should start working now.”</p><br/><p>Earth’s environment was already so cruel but it was becoming even harsher. He did need to suffer, but he wouldn’t suffer alone even if he died. All people of Earth had to suffer together fairly.</p><br/><p>The important thing in order to do that was to bring up their battle power! The first step was creating Kang MiRae’s equipment.</p><br/><p>Quegna’s bones were materials that were extremely hard to handle, but since Yu IlHan had a previous career of making Traps of Destruction using harkanium, it was no different from goblin hunting.</p><br/><p>As soon as he found out that it was possible to reshape them by melting them despite being bones of a monster, Yu IlHan went into work like a fish that met water.</p><br/><p>“The flaw is that it’s a little too soft. Hm, alloy?”</p><br/><p>Since he had used the hearts of Metal Hearts here and there, he really didn’t have much left. It wasn’t like Kang MiRae was going to beat the monsters up with this by swinging it around, so it would be possible to increase enough hardness by mixing other metals.</p><br/><p>Taking care so that the characteristics of Quegna’s bones would not be damaged, Yu IlHan tried alloying a number of times, and as he didn’t have a master level blacksmithing for nothing, he could make a staff with the best hardness and the best magic power amplification ability. Erta and Lita did not try to retort anymore.</p><br/><p>“And a 3rd magic stone to finish.”</p><br/><p>[Aah, our IlHan does not know what he’s doing.](Lita)</p><br/><p>[If he tries to sell that at 10 billion won (8.5 million USD), then Lita, you should restrain him, got that?}(Erta)</p><br/><p>The staff was a unique rank item even before the mana crafting. Its value was already over 10 billion won at that point, but now he was about to proceed mana crafting with a 3rd class monster’s magic stone, even though no other person on Earth would dare fight against such monsters. He would have to see the result to realize.</p><br/><p>‘Lightning magic ability amplification. And magic cool time reduction. The Empress told me of the hero. Let’s imagine that figure.’</p><br/><p>Kang MiRae’s useless chatter actually became useful. Imagining the figure of a hero that was in her story, Yu IlHan focused on mana crafting as much as possible. If some lame weapon came out, then the place she could suffer in would be limited. As strong as possible! As strong as possible!</p><br/><p>Light appeared. A storm of brilliant golden light, befitting of the Empress who wielded the power of lightning, covered Yu IlHan’s workshop! Lita and Erta, who already predicted what the outcome would be, closed their eyes and prayed that the Empress had enough money.</p><br/><p>And green text appeared on Yu IlHan’s black colored retina.</p><br/><p>[Lightning God-Blessed Heavenly Lightning Excitement Bone Staff was completed!]</p><br/><p>[The skill, Mana Crafting, has become level 31.]</p><br/><p>[Lightning God-Blessed Heavenly Lightning Excitement Bone Staff]</p><br/><p>[Rank – Legend]</p><br/><p>[Attack Power – 1,900]</p><br/><p>[Magic Attack Power – 3,100]</p><br/><p>[Options – 40% increase in all lightning magic, 60% decrease in casting time, 30% decrease in lightning magic cool time, special skill, Excitement, usable once a week.]</p><br/><p>[Excitement – For 5 minutes, all casting time, activation time, cool time of all magic disappears, but the mana used increases by 2 times. Only applicable to user, and after the duration ends, all abilities decrease by 30% for one hour.]</p><br/><p>[User restrictions – 200 Magic or above, lower level lightning magic Lv 50 or above]</p><br/><p>[Durability – 2,800/2,800]</p><br/><p>[A staff that was completed by transcending the limits of the materials, by the best smith across all worlds, using low level materials that did not fit him, with all his soul. The wielder would be able to destroy mountains.]</p><br/><p>Yu IlHan read down the descriptions of the item, and muttered composedly.</p><br/><p>“Wao.”</p><br/><p>Bullshit ‘composedly’.</p><br/><p>[I knew this would happen.](Lita)</p><br/><p>[I think this is better than the staff that the legendary hero in that story used, what do we do now?](Erta)</p><br/><p>Yu IlHan pondered for a moment, but he shrugged his shoulders and spoke.</p><br/><p>“Well, she’ll give me even if she has to pull her roots out.”</p><br/><p>Quegna’s bones, which had mana inside them, and were preserved at their best conditions due to Yu IlHan’s fighting method, was useful for making all kinds of weapons and not just staves.</p><br/><p>Thinking that it was fortunate that he had killed about 1000 of them since he was bored, Yu IlHan made other gear and lastly, made a robe that Kang MiRae would use.</p><br/><p>The robe, made with the leather of the Giant Thunder Bird that died most normally, and several 2nd class magic stones, fortunately stopped at unique rank.</p><br/><p>“Well, then. Let’s go pull the Empress’ roots out.”</p><br/><p>[I’m quite curious of her reaction if you show her even the black mage’s coat.](Erta)</p><br/><p>[She wouldn’t ask for marriage saying she would pay back in her lifetime, right?](Lita)</p><br/><p>With the two angels who were tainted by the ridiculous Korean media, Yu IlHan finished preparing to go meet the Empress. This was the moment when the weapon made by the best blacksmith across all worlds, appeared in the world.</p><br/><p>Author’s notes</p><br/><p>Looking up the dictionary, the word ‘ulterior motive’(T/N: ‘사심’, look in TL note) has quite a lot of meanings. What ‘ulterior motives’ is Erta’s?</p><br/><p>Noogie : Also called ‘spinny-spinny attack’. It’s the technique that Shin-chan’s mother does to Shin-chan. It’s very painful so let’s not imitate it.</p><br/><p>Translator’s notes</p><br/><p>For those that know CN or JP, ‘사심/ulterior motives’ can be written as ///, all pronounced ‘sa-shim’ in Korean. Obviously, I can only choose one to translate to.</p><br/><p>Translator : Chamber</p><br/>\n</div>"}