{"title": "Chapter 88: You, I, Strangers – 7", "id": 88, "volume": 1, "url": "http://boxnovel.org/everyone-else-is-a-returnee-chapter-88-you-i-strangers-%E2%80%93-7", "volume_title": "Volume 1", "body": "<h1>Chapter 88: You, I, Strangers – 7</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>(Translation changes: Close combat -&gt; Physical Combat, this would be ‘taijutsu’ in JP)</p><br/><p>Yu IlHan had stopped caring about evolving the skill since some time ago. Why? Because he had thought that it would be ages until he could evolve them.</p><br/><p>Whether it was the Spear Mastery or the Sword Mastery, he vaguely thought that he had to kill thousands of 4th class monsters.</p><br/><p>As such, he did not consider skill evolution in his short-term planning, and was only planning to use what he had to solve this problem.</p><br/><p>[Killing 3rd class monsters with a single piercing strike 300/300]</p><br/><p>[Killing 3rd class monsters with a single slashing strike 300/300]</p><br/><p>[3rd class magic stones 100/100]</p><br/><p>[4th class magic stone 1/1]</p><br/><p>However, that wasn’t it. The evolution criteria for Spear Mastery couldn’t have been easier than this. Now that he thought about each of these conditions that popped up since they were fulfilled, he remembered the time when he saw the evolution criteria for Spear Mastery when he just evolved the Resting skill.</p><br/><p>Yes. There was the very same text at that time as well. (T/N: Sorry if the translation is inconsistent). Although there was a difference in number due to the conditions becoming easier, there was no fundamental change in its contents.</p><br/><p>“Hah.”</p><br/><p>Yu IlHan finally understood what happened to him.</p><br/><p>At that time, he shrugged saying those conditions were impossible, and decided to forget about it. And then, he modified, in his heart, those criteria into frightening beings that could never be done!</p><br/><p>Like how the fox decided that the grapes were sour just because it couldn’t get to it! (T/N: Aesop fables)</p><br/><p>Killing a 3rd class monster with a single strike. With a pierce, with a slash. Both of these were piss easy for Yu IlHan right now, and he had come this far without even being conscious of the conditions.</p><br/><p>The evolution for Spear Mastery hadn’t proceeded yet only because he was lacking a 4th class magic stone.</p><br/><p>[What is it, Yu IlHan?]</p><br/><p>“Nah, I’m just wondering about whether I should exclaim at my own foolishness or be thankful for this wonderfully timed notice.”</p><br/><p>Yes, let’s think about it positively. This was the first time he had acquired a 4th class magic stone anyway. Even if he was conscious of the conditions, he couldn’t have evolved the conditions any earlier.</p><br/><p>Considering his mistake, the payback was too little to the point of having no damage.</p><br/><p>However, this shouldn’t continue from now on. It was a sin to not be conscious and not to use the things he had on his hands.</p><br/><p>What if something went wrong and he couldn’t evolve his spear mastery? What if he couldn’t advance to Blazing Reaper because of that? What if he met his death due to that? Yu IlHan wouldn’t be able to forgive himself.</p><br/><p>To think he, who had put so much effort in order to survive, wasn’t even aware of his own belongings!</p><br/><p>‘Good, now it’s fine.’</p><br/><p>Taking a deep breath, Yu IlHan calmed himself down. He was relieved that the problem was dug out before the situation became worse, and resolved that something like this would never happen again.</p><br/><p>[I also didn’t know. Evolving martial arts really doesn’t happen that often. And most angels use magic too……]</p><br/><p>“I don’t have any intentions on blaming you, Erta. I know that you’re helping me with all you’ve got.”</p><br/><p>[Th, that’s not entirely true either.]</p><br/><p>[Evolving martial arts… My weapon mastery was only 71 when I died. Truly an amazing talent.]</p><br/><p>Erta’s consolation and Reta’s out-of-timing nagging was as usual, but now really wasn’t the time he wanted to listen to them. What he needed now wasn’t people to flatter him.</p><br/><p>Yu IlHan first looked back to all the skills he could evolve right now.</p><br/><p>“There are none at the moment.”</p><br/><p>His maxed out skills were: Spear Mastery, Blunt Weapon Mastery, Physical Combat Mastery, Sword Mastery, Shooting, Throwing, Dismantling, Blacksmithing, and Language.</p><br/><p>Amongst these, excluding ones that cannot be evolved any more, and excluding Spear Mastery which is about to go through evolution, there was Blunt Weapon Mastery, Physical Combat Mastery, Sword Mastery, Throwing, and Language. There was only one amongst these that didn’t take a lot of time, which was Throwing.</p><br/><p>[Killing 2nd class monsters using a throw 100,000/100,000]</p><br/><p>[Killing 3rd class monsters using a throw 10,000/10,000]</p><br/><p>[Killing 3rd class monsters using a single throw 100/100]</p><br/><p>[Killing 4th class monsters using a throw 1/5]</p><br/><p>[3rd class magic stones 400/400]</p><br/><p>[4th class magic stones 1/2]</p><br/><p>“What the hell, it’s even harder than Spear Mastery?”</p><br/><p>[That’s because Throwing skill is more of a support martial arts skill rather than a martial arts skill. Due to that characteristic, it can’t evolve alone but has to fusion evolve, which is why the evolution criteria are harder than most other skills.]</p><br/><p>That was true. The other skills were just ‘evolution’s, but only the Throwing skill had the words ‘fusion evolution’ written on it. Fusion? What other skill would it fuse with? He was very curious but he endured for now. He would be able to see it soon anyway.</p><br/><p>[What’s more shocking is that you fulfilled most of those conditions.]</p><br/><p>“Well, I did use the atlatl to death in Japan.”</p><br/><p>Moreover, wasn’t it a throw that he used to kill the Orochi?</p><br/><p>Since he had to use a magic stone for the evolution of Spear Mastery, to evolve Throwing, he had to kill an additional 4 4th class monsters with a throw, and acquire 2 more 4th class magic stones.</p><br/><p>If it was in the past, he would have shook his head saying it was nonsense, but for the current Yu IlHan, who was in a world full of dragons, it wasn’t so much of a nonsense.</p><br/><p>“Well, then.”</p><br/><p>He looked forward to evolving the Throwing skill a little, but first came Spear Mastery. Yu IlHan confirmed that he had fulfilled all the criteria for evolving Spear Mastery, before taking in short, deep breaths and wishing that he wanted to evolve his Spear Mastery.</p><br/><p>At that moment, 100 3rd class magic stone and a 4th class magic stone in his possession all came out and started emitting light. It was a brilliant light to the point that he was worried that nearby dragons may find him!</p><br/><p>No matter how trained his physical body was, he couldn’t even see properly within that blinding light.</p><br/><p>“Erta, is this going well?”</p><br/><p>[I’m not of a martial faction, so it’s the first time I’m seeing an evolution of martial arts related skills! It would be better if Lita was here!]</p><br/><p>[Aaaaah. It’s really an absurd scene.]</p><br/><p>These two girls really didn’t help out at all! – thought Yu Ilhan in his heart and waited for the light to dissipate. However, the light didn’t decrease at all, but instead, increased until it devoured the world.</p><br/><p>No, it was more correct to say that it had not devoured the world, but Yu IlHan himself.</p><br/><p>While Yu IlHan was thinking those things, green text appeared on his retina.</p><br/><p>[Pioneering a path of a unique skill as a lower existence. The Akashic Record has realized it as the fastest record. You have acquired the title ‘The Quickest’. Training speed of all skills increase by 10%, and experience earned increases by 10%]</p><br/><p>[A unique skill is created from all the records of the human, Yu IlHan.]</p><br/><p>[The mastery of the related skill has reached Max. The classification of the skill increases to become an even higher ranked skill.]</p><br/><p>[The class of your records are exceptionally higher compared to your level. The skill’s growth accelerates.]</p><br/><p>[All records are absorbed. The skill, Spear Master, evolves.]</p><br/><p>Although the Akashic Record couldn’t read all of Yu IlHan’s life, his records and achievements were subliming into a definite reward. The texts related to skill evolution were a proof of that.</p><br/><p>Yu IlHan successfully remembered.</p><br/><p>The days he swung his spear and trained his body while waiting for ‘tomorrow’.</p><br/><p>The days where he charged across the world in order to acquire new wisdom and techniques.</p><br/><p>Lita’s smile, and the days he did his best to catch up to her level of martial arts.</p><br/><p>The days where he endured and endured and gritted his teeth trying to endure even more.</p><br/><p>Just as he was trying to understand the meaning of the words that flashed in his head, all the light was sucked into Yu IlHan’s body.</p><br/><p>At the same time, the power and records he knew, but couldn’t connect, sublimed into one and struck his mind.</p><br/><p>[You have learned the skill, Spear of Undrawable Trajectory.]</p><br/><p>[You have fulfilled one of the conditions to acquire a 5th class. The acquiring difficulty of 5th class becomes lower.]</p><br/><p>Even though the light had dissipated and he was on the plains, Yu IlHan still had his eyes closed.</p><br/><p>Erta and Reta only watched over him in worry, since they didn’t know what had happened to him, Yu IlHan himself wasn’t even conscious of the fact that the light had dissipated, as he was accepting the skill that was engraved onto his body, soul and mind.</p><br/><p>He already had experience in evolving skills. Resting skill into Transcendent Regeneration, and Concealment into Deathgod. Both were exceptional skills, but they weren’t so difficult to comprehend.</p><br/><p>However, martial arts were different. This wasn’t something that was like a switch, which used 0 and 1 as on and off. He could understand how it happened and how it should be implemented, as it was a result of his own records, understanding and accepting were different concepts.</p><br/><p>Even wearing clothes that fit one’s body may feel a little off at first. There was a need for some time to become used to it.</p><br/><p>[Yu, Yu IlHan. Are you alright?]</p><br/><p>[I think, I feel a wondrous aura.]</p><br/><p>“……”</p><br/><p>Still with his eyes closed, Yu IlHan picked up his spear. Then, he started swinging it. There was neither form nor formulae to his spear techniques, so there was no set trajectory to the spear he was swinging.</p><br/><p>And that, was the most important. That, was the path his martial arts had to take, and was also the core of Yu IlHan’s existence.</p><br/><p>1, 2, 4 hours had passed since Yu IlHan started swinging his spear.</p><br/><p>Even though he still had to kill 999 more 4th class monsters, he was spending 4 hours doing something. Erta worried that he may fail the quest at this rate, but Yu IlHan didn’t seem to notice the flow in time, as he kept swinging his spear.</p><br/><p>[If I knew this would happen, then I should have made him open the barrier before evolving the skill……]</p><br/><p>[I also want to enter next time.]</p><br/><p>Reta carefully asked when Erta spoke. Erta also thought up of one thing when she said that.</p><br/><p>In the barrier made by the Hourglass of Eternity, a god-ranked artifact, only existences with the permission from the owner, Yu IlHan, could enter.</p><br/><p>Yu IlHan had subconsciously took Erta and the Eternal Flame into the barrier, and the majority of the thoughts that talked to him could not enter the barrier. It was because they were recognized as a separate existence, regardless of permission.</p><br/><p>Perhaps due to that vague recognition, the majority of the thoughts that were silent while the barrier was opening couldn’t enter, unlike the ones who were being loud all the time, like the Orochi. Reta, was one of those victims.</p><br/><p>Yu IlHan found it curious that although the life force was with him, the thoughts were treated as a separate existence, but that was it. Since there was nothing he could do with those life force, or thoughts ‘yet’, it wasn’t something he gave much meaning to.</p><br/><p>[Ah, Yu IlHan?]</p><br/><p>[Yu IlHan-nim?]</p><br/><p>At that time, Yu IlHan suddenly stopped his actions. Erta and Reta hurriedly talked to him, but Yu IlHan picked up his spear again as if he didn’t listen to them.</p><br/><p>However, this time it was different, as he aimed at a nearby tree rather than swinging in mid-air.</p><br/><p>‘I think I got it now.’</p><br/><p>He hadn’t swung around his spear meaninglessly. He had tuned his clothes in order to adapt to the clothes quickly. Although he had to spend 4 hours, if he could succeed this strike he was doing now, that much time would become meaningless.</p><br/><p>Yu IlHan moved. He held up his spear neither fast nor slow,</p><br/><p>and at that moment, the tree was cut apart diagonally and fell down.</p><br/><p>[The skill, Spear of Undrawable Trajectory, has become level 3.]</p><br/><p>[……Huh?]</p><br/><p>It seemed it was true when it said that the skill growth would accelerate – thought Yu IlHan while nodding. Meanwhile, the only higher existence here, Erta, tilted her head.</p><br/><p>[I couldn’t recognize your swinging motion.]</p><br/><p>[Me neither.]</p><br/><p>Just what had happened just now? – Erta had such an expression. To her, Yu IlHan replied while retracting his spear, and with a satisfied face.</p><br/><p>“It’s that kind of skill.”</p><br/><p>[……]</p><br/><p>[……]</p><br/><p>Swinging the spear, but swinging so that the trajectory couldn’t be seen. The ones to get struck by it would not be able to know when, or how it was swung. No one would not fear the attack that distorted even cause and effect.</p><br/><p>This was a skill only Yu IlHan could learn and implement, as he had reached the maximum in both concealment and the spear, along with other martial arts skills, which allowed him to bring out all the destructive power within the human body. Although it looked like a single skill, it wasn’t one.</p><br/><p>Of course, he couldn’t implement such a high ranked skill with his body alone, so he had used up a lot of mana. It was using this much just cutting trees, so he may even run out if it was used to slash dragons.</p><br/><p>To use it normally, he would have to mix it within his normal strike, but at this rate, he would have to worry about his mana rather than his level of techniques.</p><br/><p>For Yu IlHan, whose only active skills were Concealment and Superhuman Strength until today, this was a big damage. He didn’t mind his magic stat being lower than his other stats, but it seemed like he had to focus on his magic stat’s growth.</p><br/><p>[This really is.]</p><br/><p>While Yu IlHan was pondering on the pros and cons of his skill, Erta absent-mindedly spoke in shock.</p><br/><p>[A skill that’s like you.]</p><br/><p>“Hey, don’t say it.”</p><br/><p>And here, he wanted to exclaim at his own level of power! She just had to say it!</p><br/><p>[Now you’ve concealed even your skills, how pitiful……]</p><br/><p>“Shaddap!”</p><br/><p>He didn’t want this kind of scene! He wanted his allies to exclaim at his new, wondrous, and powerful skill!</p><br/><p>Meanwhile, his ally who could make the reaction he wanted, wasn’t saying anything due to the shock after seeing the severed tree.</p><br/><p>Thinking that she was a million times better than Erta who was consoling? or laughing? at him. Yu IlHan took out some 3rd class magic stones and a flask from his Cross Bag. This was the mana potion he had acquired after killing the 4th class mage, Dakié Von Illastra.</p><br/><p>He opened the lid to the flask and sipped a little of the potion. As expected of a potion made for a 4th class, Yu IlHan’s mana filled up easily with just that. With that, a single potion would allow Yu IlHan to refill his mana at least 40 times.</p><br/><p>He didn’t know whether to rejoice at the potion’s performance, or to despair at his little mana capacity, but there was one sure thing.</p><br/><p>“Let’s go, Reta. We’ll be doing things faster now.”</p><br/><p>[Yes!]</p><br/><p>Despite not possessing a physical body, Reta felt her heart quickening. It was probably due to her expectations rising.</p><br/><p>She activated the magic formation in joy, and without fail, a dragon that just entered 4th class, was sleeping.</p><br/><p>Yu IlHan charged like the last time, and the time he took to hunt was halved. The more he got used to his spear, the more record of dragons he earned, the speed became faster.</p><br/><p>Since 800 of the 4th class dragons were just over 200, they had around the same power.</p><br/><p>Finally, doomsday was arriving upon the rulers of Dareu, the dragons.</p><br/><p>Thanks to a single loner!</p><br/><p>Author’s notes</p><br/><p>Both this and the previous chapters are overflowing in quantity, but I couldn’t cut it mid way due to the story progression, so I just give up. Please do consider that it won’t always be this way T^T</p><br/><p>Although many should have predicted from Reta’s line, the maximum numerical level of all skills are 99, and at 100, it will be Max level. In other words, 100 is the max.</p><br/><p>Whenever I make a higher ranked skill, I ponder a lot. Previously, I had no such worries, but when I made a too profound skill and it became a little strange to use them in battle… However, readers, the main character this time will suffer with his body no matter what happens! Please be rest assured!</p><br/><p>Even his skill is a loner now</p><br/><p>Finally, the climax of all his fights! The already fast speed will become even faster!</p><br/><p>Translator’s notes</p><br/><p>There’s one thing that many people are confused about.</p><br/><p>People COULD NOT DIE when they were sent to other worlds for 10 years before the first GC. I’m thinking that even suicide isn’t possible. I’m also thinking that pregnant women were pregnant for 10 years. It’s like how MC was, the cells do not age, but they are still active.</p><br/><p>Yesterday.</p><br/><p>[You’ve got 4 e-mails]</p><br/><p>-Oh? That’s rare.</p><br/><p>*Checks e-mail to find out they are all from paypal*</p><br/><p>-Let’s see, 25, 25, 25, 70… wut? I got 145 USD for EER? What the hell? Is this my birthday? Wait, it is…</p><br/><p>Are you trying to kill me on my birthday? dammit…</p><br/><p>PR: Keep them coming! muahahaha more eer = good!</p><br/><p>KCDS: Chamber wrote the TLnote days ago thus 145$ and not the 182$ of now</p><br/><p>Translator: Chamber</p><br/><p>Proofreader: Koukouseidesu</p><br/>\n</div>"}