{"title": "Chapter 97: You, I, Strangers – 16", "id": 97, "volume": 1, "url": "http://boxnovel.org/everyone-else-is-a-returnee-chapter-97-you-i-strangers-%E2%80%93-16", "volume_title": "Volume 1", "body": "<h1>Chapter 97: You, I, Strangers – 16</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Tens of dragons with levels over 220 and thousands of dragonkin with immense physical power nearing level 200 all gathered at an island that was tiny compared to their bodies.</p><br/><p>Were the dragons having a home party? They would say now but as the host of the party, Yu IlHan thought that this was the most joyful party in the world.</p><br/><p>Well, with regards to Yu IlHan’s growth that is.</p><br/><p>When people neared level 130, one had to kill at least ten thousand monsters of the same level for a single level up. It was literally torture.</p><br/><p>Leaving aside the difficulty of the hunt, it wasn’t like such a large number of monsters were constantly waiting to be slaughtered, so the pain they went through was really indescribable. They could only go at it slowly with their increased lifespans.</p><br/><p>As such, even in worlds that had gone through the 3rd Great Cataclysm, 4th class beings were a rare sight. Only warriors that had stared death in the face 24/7 could barely level up to that point if they survive.</p><br/><p>The 4th class mage that Yu IlHan finished off like swatting a fly was also a genius that came by once every tens of years. That genius took 227 years to reach 4th class. (T/N: Well, we can see that Erta wasn’t 7X when she reached 5th class. It’s at least 3 digits)</p><br/><p>Even after considering that the majority of the countries possessed one or two 4th class agents, 4th class beings were indeed rare existences.</p><br/><p>However, all of that didn’t matter to Yu IlHan right now.</p><br/><p>[You have earned 2,422,175,401 experience.]</p><br/><p>[You have earned the record of Lv 225 Flame Dragon.]</p><br/><p>“Yeah! 2.4 billion exp really melts in the mouth!”</p><br/><p>However, level 225 dragons gave out more than 200 times the experience of a level 130 monster so by simple calculations, Yu IlHan only needed to hunt 50 for a level up.</p><br/><p>“How is it, easy right?”</p><br/><p>[Yeah, right!] (Erta)</p><br/><p>[Damned thiiiiing!]</p><br/><p>Yu IlHan used the rebound of the pile bunker to fly in the air. Now that he had levelled up explosively after acquiring his 3rd class, he didn’t feel nervous at all even with tens of dragons surrounding him.</p><br/><p>He didn’t know about Earth, but if it was here, where he was supported with the skill, Angel’s Support, he felt like he could go against 4th classes with his 3rd class strength.</p><br/><p>On top of that, not only was he in possession of all sorts of dragonhunter equipment such as the Black giant bone spear, he could also use his concealment whenever he made the dragons lowered their guard, so he was no different from disaster to the dragons.</p><br/><p>[Yu IlHan, lightning incoming! You need to block that!]</p><br/><p>“Wow, that’s…”</p><br/><p>Of course, Yu IlHan was still human. Although he had no problems taking their lives as he had a clear attack method, that didn’t change the fact that their attacks hurt him.</p><br/><p>Although he could somehow endure fire magic with the increased fire attribute resistance due to his class advancement, binding magic, wind magic, ice magic, lightning magic, and other attribute magics were painful with just a single hit, and two hits were critical.</p><br/><p>[Kyaaaa! Die!]</p><br/><p>“Iron Fortress!”</p><br/><p>[You still haven’t given up on that name!?] (Erta)</p><br/><p>If he took a serious hit, it wasn’t something that would make him cry, but something that would break his bones and burst his innards, so he could only use the three thousand shields that were neither iron nor a fortress.</p><br/><p>It seemed that even all that wasn’t enough to block the attacks perfectly as Yu IlHan’s damage was not that small. He was only holding out while sucking on the Bloodrink and Breath!</p><br/><p>[Critical Hit!]</p><br/><p>[Kyaaaak! Human!]</p><br/><p>“Aren’t ya smart. Yes, I’m human.”</p><br/><p>It didn’t hurt so much even when he was hunting dragons around level 210.</p><br/><p>No, most of the time, he started off by decreasing their numbers as much as possible after setting things up on the ground, so the situation was a little different, but it was also true that the dragon’s magic abilities increased more than Yu IlHan’s resistance and defense, which rose along with his level.</p><br/><p>Especially, it became more painful as the dragons started using other attribute magic than fire, as their levels were pretty high. In Yu IlHan’s view, they were only 10 levels apart, but to them, those same 10 levels were a proof of tens, or perhaps, hundred of years of existence. It was natural for them to use a variety of magic.</p><br/><p>[Die!]</p><br/><p>Even within those hellish conditions, the reason why Yu IlHan could endure and acquire experience was not only due to his power alone.</p><br/><p>[I’m going now! Blowing Barrier!]</p><br/><p>[Khhhk, damned bitch! You dare stand on a human’s side!]</p><br/><p>Yes. Since all dragonkin in the continent were gathering on this particular uninhabited island, there were also dragons belonging to the Garden of Sunset. The dragonkin that were in a party with Yu IlHan!</p><br/><p>[Yu IlHan-nim, I will bind him now!] (Lecidna)</p><br/><p>“Watch your back instead!”</p><br/><p>[Lecidna-nim. We’re going now as well!]</p><br/><p>Yu IlHan honestly didn’t expect that much from their support, but they appeared just as he was about to get tired after killing 50 dragons and around 1000 3rd class dragonkin, along with the other dragons. They came out at the decisive moment and bit on the necks of the dragons that trusted in them.</p><br/><p>True chaos ensued, and under the party members’ meticulous support, Yu IlHan could rampage around even more.</p><br/><p>[Drive them back! Let’s wipe out any traces of those damned Destruction Demon Army guys!]</p><br/><p>[Kroaaaaar!]</p><br/><p>[Ugh! You low-level things!]</p><br/><p>Unlike how the dragons belonging to the Garden of Sunset had an easy time identifying their allies and enemies due to the party, the other dragons weren’t in a party so the chaos kept being amplified. Moreover, since two sides of dragons were creating a messy fight, a perfect condition for Yu IlHan’s concealment and ambush was also created.</p><br/><p>Yes, like right now!</p><br/><p>[You have earned, 1,725,607,882 experience.]</p><br/><p>[You have become level 137. 1 Strength, 1 Agility, 1 Health, 2 Magic increases.]</p><br/><p>“Huh, The experience got split this time.”</p><br/><p>Perhaps because an allied dragon damaged it a lot, Yu IlHan had lost about 30% of the experience, although, he levelled up despite that. This was the third level up after he became 3rd class. The fact that this all happened in one day spoke very well of the traits of this battlefield.</p><br/><p>How many dragons died on this island since the beginning of the battle? Including those killed by the dragons belonging to the Garden of Sunset, or those he killed with their support, around 160 dragons should have been killed.</p><br/><p>That was because there were less than 60 4th class dragons on the scene even after counting allies.</p><br/><p>[A lot of them died huh. I was worried that the dragons belonging to the Garden of Sunset will get wiped out quickly as they were the absolute minority, but there still more than half that’s alive. Especially that dragon, her abilities are quite good.] (Erta)</p><br/><p>“That’s true, but I think she’s set on supporting me. Look at her now.”</p><br/><p>Leaping again in mid-air, Yu IlHan pointed at ‘that dragon’ that Erta talked about. The dragon with the golden scales harbored wind around her entire body while charging throughout the battlefield to distract the dragons.</p><br/><p>[Storm Guard! Your opponent is me!] (Lecidna)</p><br/><p>[Kroaaaaaaaaar!]</p><br/><p>The golden dragon was none other than Lecidna, the female dragon that requested Yu IlHan for the alliance in the beginning. She wasn’t the highest levelled dragon within the party, but she was the wisest.</p><br/><p>Yu IlHan didn’t know if her unique golden color had any influence on this, but her wind magic was very proficient, and she used that to deflect, block, dodge the other dragons’ attacks, and rampaged around in order to set up a good environment for Yu IlHan to make surprise attacks.</p><br/><p>[Khaaaaaaa! Get out of my way, Lecidna! I will definitely kill that bastard!]</p><br/><p>Religion was scary, yes, but there was no need to refuse if she fed him without him asking. Yu IlHan suitably used Lecidna’s support to hide himself from his enemies, and succeeded in concealing himself.</p><br/><p>“Here’s the ‘bastard’ you ordered, sir!”</p><br/><p>After that was simple. He calculated the angle that wouldn’t get in the way of the magic of dragon or dragonkin, then he would use three re-leaps in the air to make a ㄷ shaped turn to strike his spear into a flying dragon’s head.</p><br/><p>[Kyaaaak!]</p><br/><p>Immediately after an attack, he would widen the wound with Spear of Untraceable Trajectory, and bury two grenades made with 3rd class magic stones, which completed the perfect surprise attack-package.</p><br/><p>[Critical Hit!]</p><br/><p>[You have earned 2,119,029,334 experience.]</p><br/><p>“Good, everything’s going well.”</p><br/><p>Above the dead dragon’s corpse that was falling, Yu IlHan blocked an incoming attack before collecting the corpse with remote collection.</p><br/><p>However, he couldn’t let his guard down just because the situation was going well. The dragons that survived until now were all frightening existences. Moreover, even the dragons belonging to the Garden of Sunset were starting to decrease in number.</p><br/><p>It wouldn’t be an exaggeration to say that Yu IlHan’s number of kills would decide which side would win!</p><br/><p>However, it seemed that there was someone else who thought the same thing.</p><br/><p>[Kihyaaaaaaa!]</p><br/><p>Along with the roar that sounded like the Orochi’s laugh, something fell above Yu IlHan’s head. Yu IlHan immediately changed directions with re-leap, but ‘that’ caught up to Yu IlHan despite its massive size.</p><br/><p>[Let us bosses hang out!]</p><br/><p>It was a very sleazy voice, but it was clear that this dragon wasn’t someone to be looked down upon. The moment Yu IlHan felt the immense mana reaction along with its presence, he protected himself by taking out shields immediately, but just as he had feared, the violent eruption of mana wiped out the shield before assaulting Yu IlHan.</p><br/><p>Yu IlHan used re-leap again to avoid and shot higher into the air. In his eyes at several kilometers high in the air, he could see a comparatively smaller sized black-scaled dragon with a streamlined body shooting towards himself.</p><br/><p>[You are really fast!]</p><br/><p>“Hmm, you do look like their boss.”</p><br/><p>Seeing the dragon charging towards him in a straight line, Yu IlHan took out one of the corpses of a 3rd class dragonkin. Just before it fell down, he put his hand above it and quietly muttered, ‘weight transfer’.</p><br/><p>[Kihyaaa…… Kahak!?]</p><br/><p>[Critical Hit!]</p><br/><p>A corpse of a dragonkin that fell down at a speed akin to a meteor due to the nearly a million ton weight crashed head on against the black dragon. The loud noise that occurred at that moment resounded across and gathered the attention of all dragons.</p><br/><p>“Dang, it’s fine even after all that.”</p><br/><p>He didn’t usually do this since he didn’t like to waste corpses, but the thought that he had to damage it somehow before the dragon crashed head on made him move like that. From the fact that he saw the black dragon dissolving the body with the black aura emitted from its body, his judgement didn’t seem to be wrong.</p><br/><p>[Kyaha! Damned guy!]</p><br/><p>Although the black dragon looked fine on the outside, it seemed there was some profit – swear words started appearing in its speech. Yu IlHan confirmed that with a smile and re-leaped to land on a dragon nearby.</p><br/><p>It wasn’t that he wasn’t running away from battle. It was just that he landed to gain a foothold to leap again.</p><br/><p>[Dirty human!]</p><br/><p>The dragon that became a foothold cast magic in rage, but Yu IlHan ran up to the head and stabilized himself before stabbing the dragon many times.</p><br/><p>Magic exploded here and there and his shields were working hard to block them, but Yu IlHan stabbed and slashed even while controlling tens of shields. After a chain of critical hits did the dragon’s movement became clearly slower.</p><br/><p>[Hey, you’re in the way, so get out!]</p><br/><p>[But Karrows-nim……!]</p><br/><p>[Tch.] (Karrows)</p><br/><p>At that moment, an alarm rang out inside Yu IlHan’s head. He gave up killing the dragon he used as a foothold and leaped up, and immediately after that, a huge black flame assaulted where he was just before.</p><br/><p>[Khaaaaaaaa!]</p><br/><p>The dragon that was once an enemy foothold, but now a black flame whole roasted ragon cried out in frustration!</p><br/><p>While all dragonkin in the battlefield abruptly widened their, eyes, the black dragon called Karrows decreased the distance between itself and Yu IlHan with a single flap of its wings while shouting out loud.</p><br/><p>[Get away from him! Don’t blame me even if I kill you!] (Karrows)</p><br/><p>“How kind.”</p><br/><p>It should have found out about the secrets to Yu IlHan’s leap! Even so, warning by burning one ally to death… All were frozen stiff regardless of ally or enemy.</p><br/><p>[Yeah, yeah! Let’s go at it! Human!] (Karrows)</p><br/><p>Only the black dragon was moving around with vitality. It was approaching Yu IlHan with a clearly faster speed than any other dragons here.</p><br/><p>Yu IlHan had no intentions on avoiding the dragon anymore. Since he had seen through its movement speed and offensive power to a certain point, if he didn’t kill it quickly, his allies would die out with his absence.</p><br/><p>[Yu IlHan, are you going to use it?] (Erta)</p><br/><p>“No.”</p><br/><p>The one that Erta asked about and Yu IlHan rejected was none other than the 1 time-use pile bunker and the grenade he made to fight against a boss monster.</p><br/><p>[Why?] (Erta)</p><br/><p>Leaving his body to gravity, Yu IlHan fell down towards the dragon while inserting power into the hand that was grabbing the Black bone giant spear when Erta asked.</p><br/><p>Why isn’t he using a good weapon when the situation was urgent!</p><br/><p>However, Yu IlHan just laughed before carefully speaking to Erta in case the nearing dragon heard it.</p><br/><p>“I guarantee that if I kill that, the real boss would appear. There was never EVER a case where a guy with that personality was the final boss. NEVER.”</p><br/><p>[…….Ah, yes. It must be so…}</p><br/><p>[Khaaaaaaa!]</p><br/><p>While the black scaled dragon never even imagined in its dreams that there was a slight difference in position between itself and Yu IlHan while roaring, the two ‘bosses’ of the two sides finally clashed!.</p><br/><p>Author’s notes</p><br/><p>I wonder if your suspicions on level ups a little satiated.</p><br/><p>Monsters occur where mana exists. You can just think that they multiply rapidly like cockroaches. In other words, they can fight with numbers. However, even amongst monsters, special races like dragons are born in a completely different way from humans.</p><br/><p>Garden of Sunset fellows that finally came are battling quite ardently!</p><br/>\n</div>"}