{"title": "Chapter 100. I Am A Drifter of My Soul – 1", "id": 100, "volume": 1, "url": "http://boxnovel.org/everyone-else-is-a-returnee-chapter-100-i-am-a-drifter-of-my-soul-%E2%80%93-1", "volume_title": "Volume 1", "body": "<h1>Chapter 100. I Am A Drifter of My Soul – 1</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>After Yu IlHan put away all the corpses on the battlefield, landing on the ground and proceeded to tilt his head. The 5th class dragon was still staring at him.</p><br/><p>“I thought you can’t touch me. Why are you still here?”</p><br/><p>Of course, Yu IlHan was also incapable of touching it. With the same reason that angels were able to use absurdly strong defensive magic, albeit not offense magic, that guy could also use as much power as it wanted if it was used to protect itself.</p><br/><p>Oh, of course, In an Abandoned World out of Heaven’s reach, Erta is just a fairy with wings. Her role is mainly retorting and explanation.</p><br/><p>[You really are a daring human.] (???)</p><br/><p>“Try living a millennium with an angel at your side, and see what happens.”</p><br/><p>There shouldn’t be many people who could so daringly speak in front of such an overwhelming aura, even after knowing that the enemy couldn’t touch him. This was all because Yu IlHan was used to being around the angels.</p><br/><p>The dragon was slightly dumbfounded at Yu IlHan’s retort, before shrugging its shoulders and gave the answer Yu IlHan wanted.</p><br/><p>[I at least wanted to see what the results would be.] (???)</p><br/><p>Yu IlHan snorted at those words.</p><br/><p>“I know there’s 19 more hiding. Don’t you know that scamming has its risks?”</p><br/><p>[……] (???)</p><br/><p>Yu IlHan was accompanied by the elven empire’s magic formation! The dragon, who failed even the last deceit, crumpled its expression momentarily, but in the end, it just sighed and shrugged its shoulders.</p><br/><p>And, spoke with a slightly pitiful expression, which did not fit its appearance.</p><br/><p>[They are still newborn who haven’t awakened yet.] (???)</p><br/><p>“Yeah, they will live sooooo quietly when they grow up, won’t they?”</p><br/><p>Even the last persuasion failed. Yu IlHan thought that the dragon would become enraged, but it surprisingly burst out laughing.</p><br/><p>[If you think that way, then it can’t be helped. Okay, go ahead. Kill them all. I also put on an act, which does not befit a higher existence, so it counts as me being faithful until the end to my race.] (???)</p><br/><p>“Yup. I’ll kill them all without a single one remaining. If you’re done then go on your way.”</p><br/><p>[No, not yet.] (???)</p><br/><p>The dragon shook its head and spoke.</p><br/><p>[You, become a Destruction Demon Soldier.]1 (???)</p><br/><p>“What?”</p><br/><p>[Stop with your nonsense!] (Erta)</p><br/><p>Yu IlHan was dumbfounded and Erta was enraged at the unexpected offer. However, the dragon started talking fluently as if its original objective was this in the first place.</p><br/><p>[You have the quality of a Destruction Demon Soldier. Overwhelming strength! Forcefulness! Those are truly all qualities that we from the Destruction Demon Army pursue. If you become reborn as a true Destruction Demon Soldier, then you will acquire power that puny angel over there will never imagine. Yes. Like me.] (???)</p><br/><p>“So, that’s why the Destruction Demon Soldier candidates with ‘oh so much power’ were wiped out like this?”</p><br/><p>[They are only failures that only wanted to join the Destruction Demon Army. Right now, I’m talking about the future, when you become a higher existence.] (???)</p><br/><p>The dragon smirked with that enormous mouth while laughing.</p><br/><p>[You should know that one must join a transcender group in order to become a higher existence. Do you not want to become stronger? Do you not want to gain even more power?] (???)</p><br/><p>One must join a transcender group to become a higher existence? What was this?</p><br/><p>However, when Yu IlHan turned his head around to Erta, she seemed to hesitate a little before nodding eventually.</p><br/><p>[Correct. The wall to become a higher existence is too difficult to overcome by oneself. So, that’s why one borrows the record of a group, as one’s own is insufficient.] (Erta)</p><br/><p>“Simply put.”</p><br/><p>[It’s like studying with the past year’s exam papers since the test is too hard.] (Erta)</p><br/><p>He understood immediately. So that’s it. That’s why all higher existences belonged to somewhere like Heaven’s Army, or Destruction Demon Army and such, despite knowing that they would not be able to use their powers on a lower world.</p><br/><p>While Yu IlHan nodded in realization, Erta spoke in a sharp voice.</p><br/><p>[If Yu IlHan wants to become a higher existence, if such a moment comes! Then we of Heaven’s Army will gladly accept…….![ (Erta)</p><br/><p>[You want to make him God’s slave when he has so much potential? You really are foolish to no end!] (???)</p><br/><p>[We are much more constructive than you idiots who charge forwards towards destruction without actually knowing it!] (Erta)</p><br/><p>[Hah.] (???)</p><br/><p>The dragon snorted.</p><br/><p>[Just who is it that does not recognize destruction? If it’s you bitches who rely on a mere God for everything, then yes. You may be able to spit out lines like that.] (???)</p><br/><p>It finished speaking and flapped its wings. A pitch black light seemed to envelop it before a handsome young man with long black hair and red eyes appeared. Of course, in an elven appearance.</p><br/><p>[Fools who can’t even analyse the situation. The connection of Dareu and Earth is merely the start. Soon, countless changes, that you will not be able to stop, will arrive.] (???)</p><br/><p>[What do you mean?] (Erta)</p><br/><p>The dragon ignored Erta and spoke while glaring at Yu IlHan.</p><br/><p>[Human Yu IlHan, you will have a lot of opportunities to meet Destruction Demon Army from now on. You will also feel their overwhelming battle power.] (???)</p><br/><p>“In the future too?”</p><br/><p>Just Dareu made him fed up, and more of these things will appear on Earth?</p><br/><p>[I will not ask for your answer right now. But remember. We of Destruction Demon Army are the strongest when all our shackles as higher existences are thrown off, and we are ready to welcome you at ay time.] (???)</p><br/><p>[Eeek, Eeeeeek!] (Erta)</p><br/><p>Erta was enraged, but she was in an Abandoned World where flapping her wings was all she could do! While she was just piling up her frustration, the dragon snorted at her before turning around.</p><br/><p>[My name is Teraka. Yu IlHan. We will definitely meet again later.] (Teraka)</p><br/><p>Then it spat out the line that was within ‘Best 3 lines of villain’s parting lines’, and disappeared. It had gone to where a Destruction Demon Soldier should be. It was a splendid villain until the very end.</p><br/><p>Glaring at the place where the dragon disappeared, Erta spoke in a frustrated voice.</p><br/><p>[Do not mind that guy’s words, Yu IlHan. Destruction Demon Soldiers are beasts who only rush towards destruction in order to fulfill their greed and desire for power, and the higher worlds they reside in are also horrible! That is also why we Heaven’s Army are doing our best too in order to prevent that!] (Erta)</p><br/><p>“There’s no way I will though.”</p><br/><p>Strictly speaking, it was not because it was the Destruction Demon Army, but because there was no way Yu IlHan would ‘belong’ somewhere!</p><br/><p>In fact, Yu IlHan was very angry right now because of that.</p><br/><p>He thought that he could become a higher existence if he put in effort, but there was a need to join a transcender group to become a higher existence?</p><br/><p>And here he thought that joining a group would end with him forcefully entering the volunteer club in highschool!</p><br/><p>Did the world hate loners so much! What kind of unfair world was this, where one could not become a higher existence by oneself!</p><br/><p>Yu IlHan thought that he had prepared a lot of things for the Great Cataclysm, but he couldn’t help but feel like a fool whenever he heard of new things like this.</p><br/><p>Yes, this was all because of Lita. Wasn’t he feeling this way because Lita didn’t explain properly? Yu IlHan decided to punish her when she came back. And other than that.</p><br/><p>“Should I give up on becoming a higher existence then?”</p><br/><p>[Why does it come to that!? You can just come to us Heaven’s Army! Angels are good, you know? You get wings!] (Erta)</p><br/><p>“But I hate joining groups!”</p><br/><p>[You pursued the life of a loner so much!? Wait, if it’s only that much, you just may……] (Erta)</p><br/><p>“I what?”</p><br/><p>When Yu IlHan tilted his head wondering what Erta’s words meant, Erta shook her head powerlessly.</p><br/><p>[It’s nothing. Forget it.] (Erta)</p><br/><p>“Nice one there, Erta. You just brought up a blatant foreshadow. Hint me when the time comes, okay?”</p><br/><p>[It’s nothing like that!] (Erta)</p><br/><p>Yu IlHan joked with Erta while stretching out.</p><br/><p>He wondered what would happen when he met the frightening opponent, but he survived and completed his objective. Although he was really bothered by the dragon’s words, it could be said that he had finished all the things he had to do in Dareu.</p><br/><p>“Oh, wait. There’s dragonkin left.”</p><br/><p>[Are you going to go right away? Even though the battle just ended?] (Erta)</p><br/><p>“It’s better to rest after finishing everything.”</p><br/><p>Yu IlHan checked the scene for one last time and put away everything into his Cross Bag. Even though he had decreased the volume while working to death in the Hourglass of Eternity, he felt that it was getting full.</p><br/><p>“Increase the space properly for the reward this time, yeah? And it doesn’t look so good to wear that over the armor, so attach an invisibility option, okay?”</p><br/><p>To a 3rd person’s view, it might seem like Heaven owed him, and in reality, that really was the truth. Yu IlHan asked for the rewards without hesitation.</p><br/><p>[We’re thinking up of even better things, so wait a little.]</p><br/><p>Even though Yu IlHan had expected that Erta would grumble at his request! Yu IlHan nagged Erta about how they were going to upgrade the Cross Bag, but she never told him, as if willing Yu IlHan to die in frustration.</p><br/><p>In the end, Yu IlHan had no choice but to activate the formation.</p><br/><p>The newborn dragons belonging to the Destruction Demon Army were all hiding in a secret cave, that looked like it was impossible to access without the formation. As if it was the headquarters of the dragons, it was connected to numerous caves.</p><br/><p>[Just when are the lords coming?]</p><br/><p>[If it’s Karrows-nim, he will definitely finish everyone off. Moreover, there’s him, Teraka-nim who became a higher existence.]</p><br/><p>[Destruction Demon Army is so cool. I will definitely grow up to be a strong dragon and destroy everything that disturbs my eyes!]</p><br/><p>[There’s nothing more to destroy in this world. I also want to invade other worlds like the grown ups.]</p><br/><p>They say a fine child become a fine adult, and these newborn dragons seemed to be the same! If there was anything funny, it was that they were in elven forms despite the fact that they had tried to massacre them.</p><br/><p>“Then let’s start.”</p><br/><p>Yu IlHan had the power of a deathgod, so his concealment would not wear off if he killed an enemy with a single strike. Also, now that he had become a Blazing Reaper around at level 137, dragons around level 150 were insta-kill material without the need for Blaze.</p><br/><p>[You have earned 21,901,287 experience.]</p><br/><p>[You have earned the record of Lv 153 Immature Dragon.]</p><br/><p>[Wh, what!?]</p><br/><p>[Karl, Karl died!]</p><br/><p>Yu IlHan waved his hand at the newborn dragons that panicked and became enraged at their kin’s death, but they, as expected, did not notice Yu IlHan.</p><br/><p>Then, there was no need to hesitate any more. Yu IlHan killed the dragons while humming. His figure was truly befitting of a reaper harvesting souls.</p><br/><p>[What bastard! Karrows-nim will definitely kill you when he comes back!]</p><br/><p>[Kroaaaaar!]</p><br/><p>[Kak![</p><br/><p>[I, I can’t die like th……]</p><br/><p>When over ten dragons died in an instant, some of them tried to run, but Yu IlHan killed them all without exception like a farmer not missing out a single grain.</p><br/><p>After that, he meticulously checked to see if there were any surviving dragons, but really, there weren’t any left now. Only tens of minor dragonkin were scattered around the continent.</p><br/><p>That was the moment when dragons became extinct from Dareu.</p><br/><p>“Fuu, It’s finally over.”</p><br/><p>[……Perhaps he really is fit to join the Destruction Demon Army.]</p><br/><p>Yu IlHan’s figure was truly daring in the sense that he killed everyone regardless of age or gender once he decided that they were his enemy, and although she didn’t want to accept that, he even looked a little cruel.</p><br/><p>Erta thought he was cool since she had already half-fallen for him, but some angels would become frightened at that scene.</p><br/><p>Yu IlHan put away the baby dragons’ corpses and looked around the cave.</p><br/><p>Although there was nothing in this cave, it wouldn’t be empty since it was the headquarters of the Destruction Demon Army.</p><br/><p>“Isn’t there anything like Dragon HEART?”</p><br/><p>[I guarantee you that there won’t be.] (Erta)</p><br/><p>“No, the universe will help if I wish for it dearly.”2</p><br/><p>Said Yu IlHan before searching again. However, no matter how hard he searched, he only found a single cave of gold and silver.</p><br/><p>[It really is quite a large amount. Did they gather all the precious items of this world here? A dragon’s greed really is amazing……] (Erta)</p><br/><p>“There’s no Dragon Heart!”</p><br/><p>[I said give up!] (Erta)</p><br/><p>Yu IlHan took away the precious items since he didn’t want to go back with nothing. After that, only after he searched every single place in the cave to look for even a single piece of a Dragon HEART did he activate the formation.</p><br/><p>Erta asked.</p><br/><p>[What will you do now? Are you going to hunt the remaining dragonkin? Or shall we gather the elves?] (Erta)</p><br/><p>“No, let’s go to where we first met Lecidna.”</p><br/><p>Lecidna’s last words really bothered Yu IlHan.</p><br/><p>Really, she had traded her life for his, just with the reason that she was under the Garden of Sunset’s orders, without a shred of greed. Yu IlHan did not understand her line of reasoning, and as such, he wanted to know what she was thinking, even if it’s a little more.</p><br/><p>[Perhaps, she fell for you?] (Erta)</p><br/><p>“Fuu, Erta. There’s no woman who likes me in this world.”</p><br/><p>At least there’s one here! – Erta had no courage to say that. To be exact, she had no courage to make any progress despite knowing how Lita would react after knowing that.</p><br/><p>While Erta was silent, Yu IlHan activated the formation.</p><br/><p>Light appeared, before Yu IlHan felt like he was floating. The next moment, he was back at the place where he first met Lecidna.</p><br/><p>“Aha.”</p><br/><p>Yu IlHan realized the moment he came into the cave. He immediately realized why he could not understand Lecidna to the very end.</p><br/><p>There was no helping it. There was a line that the two could never cross. Perhaps, from the moment he met her.</p><br/><p>“She was a housewife.”</p><br/><p>In the place where she was sleeping before, laid a huge golden egg and a letter.</p><br/><p>Author’s notes</p><br/><p>Dang, I did give some obvious hints, but to think you’d realize that there was an egg in the cave so quickly…</p><br/><p>Yu IlHan is the best in reading malicious intentions towards himself!</p><br/><p>FYI, the ‘volunteer club he had to forcefully join’ is NOT the volunteer club full of pretty girls that a certain Japanese light novel protagonist joined, but the volunteer I joined in highschool. Instead of listening to students’ worries, I earned volunteer time while watering flowers…… (T/N: There’s compulsory amount of volunteer time required in Korea in order to graduate middle school, and highschool)</p><br/><p>Erta threw a bait even while working hard for Heaven’s Army.</p><br/><p>Translator’s notes</p><br/><p>Next arc author’s note says this arc title (and the next arc title) is supposedly a parody of a line from ‘Invictus’ by William Ernest Henley…</p><br/><p>PR: 100th chapter wooooohooooo!!!!! “insert fireworks”</p><br/><p>Translator: Chamber</p><br/><p>Proofreader: Koukouseidesu</p><br/>\n</div>"}