{"title": "Chapter 113: I’m the Master of Your Lives – 5", "id": 113, "volume": 2, "url": "http://boxnovel.org/everyone-else-is-a-returnee-chapter-113-i%E2%80%99m-the-master-of-your-lives-%E2%80%93-5", "volume_title": "Volume 2", "body": "<h1>Chapter 113: I’m the Master of Your Lives – 5</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>People accepted Yu IlHan’s explanations and relaxed. No, rather than accepting it, they judged that it was much safer to use those guys like how they were trying to use us rather than fighting back recklessly.</p><br/><p>“It’s a very big matter. It will be insufficient even if we gather all the ability users in the world. Do you understand my words?”</p><br/><p>Yu IlHan expressed his opinion to the Front Line Alliance, and the other clans who tried to create ties with them through this incident.</p><br/><p>Everyone, who realized that this matter was very big the moment Susanoo asked for their opinions instead of handling everything by himself, nodded their heads.</p><br/><p>“We do not have a lot of time, so please give your opinions on how to efficiently prepare against our ‘enemies’.”</p><br/><p>“I thought you weren’t human, but now that you’re asking us on the same level as us, this feels quite strange.”</p><br/><p>Clan master Carina Malatesta of Magia didn’t seem to have a lot of hostility towards Susanoo unlike Michael Smithson of Metal Knights, as she shrugged and said that.</p><br/><p>Continuing,</p><br/><p>“The most important thing is to restrict the area of the battlefield. Although I’m very sorry for the clan master of the Lightning God Clan, there is a need to isolate a wide area in order to not let the damage spread outside even if the enemies escape our formation. If the enemies retreat into a mountain or something, then that would be the worst.”</p><br/><p>When Yu IlHan looked at Kang MiRae after hearing those words, she firmly nodded while picking up her phone.</p><br/><p>“I’ll use all the support I can get. That should be possible. However, I do wish for some help from other countries. Physical isolation does not mean anything. We need ability users, enough of them to surround the entire Seoul.</p><br/><p>“There should be no idiots who won’t send their ability users in this matter, miss Kang. Of course, I can guarantee that we of England will come to a just decision.”</p><br/><p>It was Michael Smithson. Even though he looked like a fool when he was naggy about holding monsters in place in order to kill them despite not having any offensive abilities, he seemed to have reason at least.</p><br/><p>It was funny how he was still glaring at Yu IlHan, but Yu IlHan inwardly raised his evaluation on him.</p><br/><p>“Ned should be setting up battlefield environments. Even though we did gather a sufficiently wide area, it’s still not enough, so we need to hurry. Moreover, there are too many obstacles.”</p><br/><p>“Is the evacuation of the citizens completely done? Oh, if possible, I want to know one of those wolf monster’s weaknesses at least.”</p><br/><p>“I thought it wouldn’t work, but attacking using weights worked with 3rd class beings as well, at least until level 130. Since we’re removing them, I don’t think it will be so bad to install some bombs in those high-rise buildings and use them.”</p><br/><p>Most of the people here were representatives of a faction, so they were perfect in coming up with countermeasures.</p><br/><p>Under the condition that they had to fight together with a group of monsters even while fighting against all monsters, they started coming up with methods to reduce human casualties to the minimum possible, and bring back victory.</p><br/><p>The people didn’t just end with words. From the moment many suggestions acquired agreement from many, they were being carried out one by one. This matter was already told to all the higher ups in the world. Even the ability user factions who were just watching the situation now, and even the military started moving.</p><br/><p>“But then.”</p><br/><p>Asked Kang HaJin to Yu IlHan.</p><br/><p>“What are you going to do? Although it’s very embarrassing for us, we may need to come up with new tactics according to how you move.”</p><br/><p>“The forces of our enemies are 130 thousand, 30 thousand being 3rd class, and 6 being 4th class, from what I’ve heard.”</p><br/><p>Yu IlHan’s reply made Kang HaJin speechless. Yu IlHan laughed lightly. If he told him how many 4th class dragons there were in Dareu, he might fall into shock and die.</p><br/><p>“For your reference, excluding the wolfkin we’ve slayed, the scale of our allies are 50 thousand, 13 thousand being 3rd class, and 2 being 4th class including the Royal Guard here.”</p><br/><p>“Oh my god.”</p><br/><p>All the people who were moving around busily in order to consolidate their tactics collapsed on the spot after listening to the differences in their fighting power.</p><br/><p>Well, human forces numbered much larger, but the people here knew very well the difference in destructive power between each classes.</p><br/><p>Especially 4th classes, the one that was about to bring about a disaster to the Kantou region! And the biggest reason why the humans didn’t attack the wolf monsters when they stopped in unison!</p><br/><p>“I’m going over to the other side.</p><br/><p>As such, Susanoo’s declaration sounded like their lives were saved.</p><br/><p>“In order to prevent the 4th classes from coming over to this side, I’m planning to clean them up myself over there.”</p><br/><p>“……”</p><br/><p>Thanks to the cool and firm declaration, Kang HaJin exclaimed.</p><br/><p>Kang MiRae couldn’t hear that as she was calling orders while moving, but Na YuNa, who was right next to him, heard it and burst out laughing.</p><br/><p>“Is that so…”</p><br/><p>Takagaki Asuha, the clan master of the Magic Dragon clan, nodded calmly instead of Kang HaJin before asking.</p><br/><p>“But when you say 4th class, do you mean including that one?”</p><br/><p>“Of course.”</p><br/><p>The one she pointed to was the captain of the Royal Guards, Flemir. Yu IlHan was satisfied that she pointed out an important point immediately and nodded with a smile.</p><br/><p>“They will never be able to come over here to Earth.”</p><br/><p>The moment he said that, Flemir shouted.</p><br/><p>“We’re at our limit. They will start coming over as well!”</p><br/><p>“Then everyone, please start.”</p><br/><p>Shortly declared Yu IlHan before moving immediately. First, he gave Yumir in his arms over to Liera and asked her.</p><br/><p>“It will be fine for you if it’s just flying around with him in his arms, right?”</p><br/><p>[Of course, I’m a 6th class. Although direct interference is impossible, there’s no problem with protecting myself.] (Liera)</p><br/><p>“Yes, then Yumir.”</p><br/><p>Yu IlHan nodded at Liera, who declared confidently, before turning his gaze to Yumir. He was preparing to shoot magic at any time while overlapping the mana he had piled up during multiple level ups last time.</p><br/><p>“Don’t hold back on your mana, and kill them all. If you wait here patiently while levelling up, then dad will come back soon.”</p><br/><p>“Yeah! I will kill them all!”</p><br/><p>Such was the conversation between a newborn who was born less than 24 hours ago, and a father.</p><br/><p>Continuing on, he looked at the elves as well. They looked like they would follow Yu IlHan, but he lightly shook his head when they accepted it even while looking slightly disappointed.</p><br/><p>It was insufficient with just the humans here. They, with their legend ranked equipments, had to hold out here in order to block 3rd classes.</p><br/><p>“Then Erta, let’s go.”</p><br/><p>[I was waiting for those words.] (Erta)</p><br/><p>With Erta on his head, Yu IlHan headed to Flemir. Making his direct subordinates retreat a few steps, he was glaring at the gate at the closest position possible.</p><br/><p>Was he worried about his own kin who should be fighting beyond the gate? Or was he worried about the enemies coming over to this side?</p><br/><p>Whatever the case, Yu IlHan couldn’t care less. He would know soon anyway.</p><br/><p>“You’re coming with me.”</p><br/><p>“What do you, I’m remaini-”</p><br/><p>“You need to come with me and kill enemy captains!”</p><br/><p>Before he even finished speaking, Yu IlHan deployed Superhuman Strength and kicked him over the gate.”</p><br/><p>“Uaaaaaaah!”</p><br/><p>After confirming that Flemir had fell into the gate, Yu IlHan flicked his fingers, when, the spears of lightning he had collected last time, fell into the surroundings of the gate. This was an overwhelming scene.</p><br/><p>“This should be enough.”</p><br/><p>Not to mention enough, it was near perfect. Yu IlHan exclaimed in impression at his own work, before sending a simple message on how to use the fence of giant spears to Kang MiRae. Then, he threw his body into the gate.</p><br/><p>After the long gate, was a country of snow.</p><br/><p>[C, cold!] (Erta)</p><br/><p>It was snowing everywhere, and the place that once should’ve been a plain had formed a beautiful white. Of course, it was being tainted real time with blood, flesh and bones.</p><br/><p>“I’m not cold at all.”</p><br/><p>[This, is, Abandon, World!] (Erta)</p><br/><p>So what, she wanted to say she can’t use her angel powers because this is an Abandoned World?</p><br/><p>Yu IlHan decided to let Erta be when he saw that she was making herself shrink even smaller in order to get in the gap between his hair and his helmet. It would probably be safer there as well.</p><br/><p>“Good, I definitely did become stronger.”</p><br/><p>Coming out from the gate, he could feel power in his body. Not only was there a higher concentration of mana here as this was a world which had gone through its 2nd Great Cataclysm, he had also raised the level of Angel’s Support skill so all of his abilities were being strengthened by around 30%.</p><br/><p>His stats, which were already higher than other people, were being enhanced yet again, so from his stats alone, he would be nearly level 200</p><br/><p>“Shit, that guy sent me here aga……!”</p><br/><p>Meanwhile, Flemir, who had fallen nearby, muttered while gritting his teeth without even knowing that Yu IlHan had followed him. Around the gate, countless 2nd class wolves were throwing their bodies inside the gate, but unlike the wolfkin who had black fur, they all had red fur. Yu Ilhan confirmed that they were the small fries moving under Destruction Demon Army.</p><br/><p>Flemir also saw that and rampaged with his eyes flipped.</p><br/><p>“Kroaaaaar! You dare ignore me!”</p><br/><p>When he roared despite being in human form, and waved his hand, a black claw of mana popped out of thin air and slashed apart the wolves around.</p><br/><p>However, regardless of how many tens or hundreds of wolves were dying or not, the red wolves were only charging to the gate.</p><br/><p>“So you’re back, Flemir! How nice to see you!”</p><br/><p>“You bastard, Ikedka!”</p><br/><p>Along with the stereotypical villain line, someone charged towards Flemir! While Flemir was fighting against that guy, Yu IlHan raised his head and looked at his surroundings.</p><br/><p>“It’s a complete battlefield.”</p><br/><p>[Those wolves, I think they’re chasing the black wolves.] (Erta)</p><br/><p>The number of black wolves that charged through the gate numbered a little less than 30 thousand. There were more than 20 thousand black wolves left, but the red wolves were trying to prevent them from going through the gate while charging into it themselves.</p><br/><p>And he could see another humanoid wolfkin blocking them from another side. Hm, it seemed that there were indeed two 4th class wolfkin. Flemir hadn’t lied about that point.</p><br/><p>[But Yu IlHan, there’s something I don’t understand.] (Erta)</p><br/><p>Coincidentally, Erta pointed it out.</p><br/><p>[Those red wolves, of course, they are under Destruction Demon Army so they should be aiming for Earth, but aren’t they getting their priorities messed up? Isn’t it normal to aim for Earth after exterminating all the wolfkin?] (Erta)</p><br/><p>“Of course that’s the normal way.”</p><br/><p>[Then why are they ignoring the wolfkin here and are trying to go over to Earth?] (Erta)</p><br/><p>“Because they want to exterminate the wolfkin.”</p><br/><p>[Are you playing with words on me…… Oh.] (Erta)</p><br/><p>Erta exclaimed in realization. Then she looked back on the error she had committed.</p><br/><p>Just because the royal guards had humanoid form, it didn’t mean that wolfkin royalty would have them either.</p><br/><p>[So the royalty of the wolfkin had already gone over to Earth!?] (Erta)</p><br/><p>“Of course, there’s no way Flemir would be so enraged if that wasn’t the case.”</p><br/><p>Replied Yu IlHan in a leisurely manner.</p><br/><p>His words were correct. Flemir had ended up leaving behind the target he had to protect on Earth, and was fighting against his enemies while expressing his rage.”</p><br/><p>“Uaaaaaaaah! Shitttttttttttttttttt!”</p><br/><p>“Kuhahahahahah! Your despair makes me joyful! Slowly recount to me what happened to you!”</p><br/><p>Killing was happening everywhere. The black wolves were desperately blocking the red wolves, and the red wolves were crushing them with superior quantity and quality.</p><br/><p>From how the 4th class beings on the red wolves’ side couldn’t be seen anywhere, it seemed they were optimistic about the situation and were moving around quite slowly.</p><br/><p>Just one, there’s one who’s over-classed.</p><br/><p>“That guy’s too strong for me right now. I knew I should’ve come over to this side. I need to keep that guy in some way or another in this place.”</p><br/><p>[It’s impossible now, but how are you going to do it?] (Erta)</p><br/><p>“That, you’ll see from now.”</p><br/><p>Muttering with a laugh, Yu IlHan moved his body.</p><br/><p>It was truly funny. Even though snow had covered this wide expanse of land, the places he went past had no traces at all. This was the power of a concealment master, and a pancosmic loner!</p><br/><p>“Now I don’t feel so good.”</p><br/><p>[You’re feeling things. So Yu IlHan, what is it that you will show me?] (Erta)</p><br/><p>Many wolves had gone over to Earth. However, he could dare to say that those were the minority.</p><br/><p>Disregarding black or red, there were still 120 thousand wolves here on the snowy plains. What more, all 8 of the 4th classes were still here.</p><br/><p>“What do you mean what.”</p><br/><p>Yu IlHan Laughed. It was a ‘smile’ befitting a truly evil ‘deathgod’.</p><br/><p>“It’s nothing other than complete obliteration.”</p><br/><p>The moment Yu IlHan’s words ended.</p><br/><p>Hundreds of dragon bone spears rained from the sky and assaulted the wolves!</p><br/><p>Author’s notes</p><br/><p>After the long gate, was a country of snow. : A parody of the first line of the novel ‘Snow Country’ by Kawabata Yasunari. (T/N: I dunno the exact line)</p><br/><p>That’s right, the royalty of wolfkin had already come over to Earth! Would the royalty be able to survive on Earth even after being isolated due to Yu IlHan who sees through everything?</p><br/><p>What do you think he means by hunting a monster he can’t in his current state? The hint is sufficient, right?</p><br/><p>Translator’s notes</p><br/><p>Yumir does not need class advancement quests. He classifies as a monster.</p><br/><p>Translator: Chamber</p><br/><p>Proofreader: Koukouseidesu</p><br/>\n</div>"}