{"title": "Chapter 112: I’m the Master of Your Lives – 4", "id": 112, "volume": 2, "url": "http://boxnovel.org/everyone-else-is-a-returnee-chapter-112-i%E2%80%99m-the-master-of-your-lives-%E2%80%93-4", "volume_title": "Volume 2", "body": "<h1>Chapter 112: I’m the Master of Your Lives – 4</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>“Wh, what the hell?”</p><br/><p>The front line forces exclaimed in amazement.</p><br/><p>“That man is a monster, right?”</p><br/><p>“The monsters are retreating?”</p><br/><p>At the same time the black-haired man bashed his head on the ground, the monsters stopped their attacks and gathered around the man. It was completely different to their attitudes until just now when they charged forward without the fear of death.</p><br/><p>The people of Earth didn’t go “Yay, a hexa-kill chance!” and do other idiotic things like that, but became wary of the man and kept their guard up as they sheathed their weapons.</p><br/><p>It was undeniable that the man’s aura was very strong, as such, rather than attacking first and enraging him, they decided that it was better to judge the situation a little later. Good, a wise choice – nodded Yu IlHan.</p><br/><p>“We do not have any intention to invade this world! It was our last ditch effort as we were chased out by our enemies, so please! May you spare my kin in exchange for my life!”</p><br/><p>Meanwhile, the man was still shouting in that position, but only Yu IlHan could understand him here.</p><br/><p>No, well, it was something only Yu IlHan needed to understand.</p><br/><p>Yu IlHan was in the air with Yumir in his arms, but the moment the man’s second line ended, he re-leaped towards the ground and landed. Standing behind the first huge spear he shot on the ground, Yu IlHan deactivated his concealment.</p><br/><p>“Whoa!”</p><br/><p>“It really was Susanoo.”</p><br/><p>“……But Susanoo has someone in his arms?”</p><br/><p>Yumir tried to get into concealment in embarrassment as he was being seen by so many stronger people, but Yu IlHan covered him with a blanket and took him into his arms again. Then, he confronted the black haired man.</p><br/><p>“I think you’re misunderstanding something.”</p><br/><p>Retorted Yu IlHan using the language he just learned through the maxed out language skill.</p><br/><p>“My son is indeed a dragon, but he’s much weaker than you right now, so I don’t think there’s any meaning in asking for help.”</p><br/><p>“What do you……?”</p><br/><p>The man finally raised his head. Before him was a grown man covered in armor that definitely smelled like a human, and someone that looked human but definitely smelled like a dragon.</p><br/><p>“……Son, is dragon? Human? Is father?”</p><br/><p>“Yup.”</p><br/><p>Replied Yu IlHan while calming the embarrassed Yumir in his arms down.</p><br/><p>“How can that be…”</p><br/><p>The black-haired man was stunned, leaving his mouth agape. Meanwhile, the number of monsters, mainly wolves, that exited the gate, was increasing.</p><br/><p>As their room for movement became smaller and smaller, there came a moment where they had to exert strength into their legs in order to not get fried by the lightning fence. Just as the man tried to remove the fences, Yu IlHan stopped him with his hand gesture.</p><br/><p>“Explain the situation.”</p><br/><p>“If we don’t remove the fence first……!”</p><br/><p>“Very well, I’ll give you some room.”</p><br/><p>Confirming that the people had backed off enough, Yu IlHan waved his hand. When he did, the tens of giant spears around the gate disappeared instantly!</p><br/><p>The man gaped his mouth at the incredible show of technique, when Yu IlHan waved his hand again and the collected spears started reappearing.</p><br/><p>The gigantic spears that appeared a little above the ground embedded themselves in the ground with booming sounds and formed yet another circle, but if there was anything different from last time, it was that the space inside had gotten wider, and the electric fence had disappeared.</p><br/><p>However, the electric energy was still there, so if someone like the Empress stimulated them lightly, then another fence would lightning would form.</p><br/><p>Moreover, as new spears were added in order to make up the lengthened circumference, it was still very difficult to escape between the spears. It would be different if all the monsters here could jump, but Yu IlHan would never let that happen.</p><br/><p>Naturally, the man became shocked and marvelled at the scene. Although he was a 4th class being, he developed physically so he was clueless in regards to magic.</p><br/><p>“A human can cast such a high-level spatial magic!?”</p><br/><p>“I’m not a dragon’s daddy for show.”</p><br/><p>A loner’s disease of not being able to communicate with others without boasting or deception had activated. The palm-sized Erta asked while sighing.</p><br/><p>[Did you receive some inventory education somewhere?] (Erta)</p><br/><p>“Learned through anime.”1</p><br/><p>Yes. Although he boasted to the man, what he utilized was merely the options from his inventory.</p><br/><p>He first collected the spears using the remote collection option, then with the exact same option, he called out the spears at around 1m above the ground.</p><br/><p>At that time, he added the weight transfer and weight control options to add about 100 tons to each of the spears, so they naturally embedded themselves into the ground.</p><br/><p>“……”</p><br/><p>The man seemed to hesitate after looking at Yu IlHan. However, in the end, he seemed to have come to a decision as he nodded and smacked his head on the ground again.</p><br/><p>“It doesn’t matter whether you’re a dragon or not. What is important is the power you possess. Please help us. Even if we fight you here, that will all be in their favor!”</p><br/><p>“Hmm.”</p><br/><p>The moment he heard that, Yu IlHan made a thick smirk that no one other than Erta and Liera could see as they could see through his helmet.</p><br/><p>Everything was as Yu IlHan had planned. The moment the man appeared and bowed his head, Yu IlHan thought that the situation may turn out like this if he showed his strong side.</p><br/><p>Yu IlHan’s aura on the surface definitely didn’t look that strong. At least, in a 4th class being’s view, it would be as such. Then, it should have immediately stood up and ripped apart Yu IlHan with his own hands, but he didn’t.</p><br/><p>Why? Because there was something he needed to protect. It’s current mindset was that of someone who wanted any kind of help possible.</p><br/><p>Yu IlHan saw through his heart correctly.</p><br/><p>“That’s why I said….”</p><br/><p>Yu IlHan approached the man. The surrounding wolves glared at him, but when the man shook his head, they immediately backed off. These monsters had a clear method of communication and hierarchy. This was quite a good sign.</p><br/><p>Having approached the man, Yu IlHan showed one action while receiving the gaze of all the people and monsters here.</p><br/><p>He made the man stand up.</p><br/><p>“Explain the situation. If it is of merit to me and to this land, then I’ll cooperate. I’ll also persuade the other humans for you.”</p><br/><p>Yu IlHan could only do this as he had thrown away his unconditional hostility against monsters after he cooperated with dragons once. The man seemed to believe Yu IlHan’s honesty as he nodded while sighing in relief. Then he started explaining.</p><br/><p>“We call our world Kiroa. Just until a few hundred years ago, humans and us wolfkin were balanced as we developed mutually and fought against each other.”</p><br/><p>Wolfkin, or so the man and the wolves were called. So they evolve to be humanoid if they become 4th class? Yu IlHan was pondering when Liera spoke from behind him.</p><br/><p>[I know about Kiroa. Not long after the 2nd Great Cataclysm, the wolf monsters reproduced at incredible speeds and exterminated the humans. Of course, we backed off at that point.] (Liera)</p><br/><p>Yu IlHan started pondering again after hearing Liera’s explanation; he somehow felt like he had heard about this.</p><br/><p>And as he had expected, the man’s following words convinced Yu IlHan of that fact.</p><br/><p>“The 2nd Great Cataclysm occurred, and a few of our colonies grew rapidly. We became stronger, faster, and numbered many. Since the balance was tilted, a war was inevitable. We exterminated the humans, and a world of wolfkin opened. I thought that war would end like that and there would come a time of peace.”</p><br/><p>“And it didn’t?”</p><br/><p>“The various chiefs of the colonies that developed rapidly had a scheme. They attacked the traditional royalty of the wolfkin and the princess……”</p><br/><p>“Oh, okay.”</p><br/><p>After that was the cliché rebellion and love story that any fantasy novels you pick up at a bookstore would have. How was the repertoire so obvious… While Yu IlHan was yawning in boredom, a new element came in.</p><br/><p>“We finally realized: They were wolfkin, but at the same time, they weren’t.”</p><br/><p>“So what, they had the transcender group, Destruction Demon Army, behind them?”</p><br/><p>The man lost his words. It seemed like Yu IlHan had hit the bullseye. If that was an act, then Yu IlHan would bring that man to Hollywood.</p><br/><p>“H, how did……”</p><br/><p>“Very well, I believe you.”</p><br/><p>The moment Destruction Demon Army came in, the reliability of the information skyrocketed.</p><br/><p>The higher existence he met in Dareu, Teraka, definitely did say that Yu IlHan would encounter the Destruction Demon Army quite a lot from then on. Although he didn’t know that it would come so soon, now that they did come, Yu IlHan had no choice but to kill them all. He first checked the remaining details fast.</p><br/><p>“So, wolfkin split up into two factions? The Destruction Demon Army faction is trying to bring down the royalty and want the authority, and you guys want to protect them.”</p><br/><p>“Yes. However, we’re the weaker side!”</p><br/><p>“But since it was confirmed that your world was connected to Earth, Destruction Demon Army side want to invade Earth while they’re at it?”</p><br/><p>“Y…… You’re completely correct. And we were sacrificed in that process! They pushed us through the gate in order to deplete the power of both Earth and ours, and they would take over Earth with their full power…… How do you know all this!?”</p><br/><p>The man shouted with eyes of disbelief. Yu IlHan answered again with ‘I’m not a dragon’s daddy for nothing’, but inside, he was laughing at him.</p><br/><p>That guy’s no good for Hollywood after all, his eyes were trembling like mad.</p><br/><p>Those guys pushed the wolfkin through the gate? That was a complete lie. Well, yeah, they were at a numerical disadvantage, but they tried to ‘escape’ here.</p><br/><p>They would first check the safety with scouts, and if they judge that this side is weaker than them, then they’d wipe out the humans and prepare to fight back.</p><br/><p>No, thinking more about it, it wasn’t that either. The highest possibility was a three-way war between wolfkin, Destruction Demon Army, and Earth.</p><br/><p>If the wolfkin scattered throughout the Earth, then would the traitors in the Destruction Demon Army ask the people of Earth politely and hunt only the wolfkin? Would the humans let the monsters free in their cities?</p><br/><p>No way.</p><br/><p>Naturally, Earth will become a chaos, and wolkin would be able to hide their royalty and even look for a chance for reversal. Only one side would profit in this three-way war.</p><br/><p>Their plan was perfect, but somehow, the scouts were wiped out the moment they went through the gate. Even elites of 3rd class were wiped out. The moment they thought that their plan had failed, a dragon magic flies in from beyond the gate.</p><br/><p>So, they would think that something is going wrong. That was why, a quite a high ranking wolf-man popped out and bowed his head, and spoke a lie that would not work at all, trying to decrease their sin.</p><br/><p>After asking about the scale of the forces of both the wolfkin and the Destruction Demon Army, he confirmed one last thing.</p><br/><p>“I’ll ask this just in case, but is the Garden of Sunset helping you guys out or something?”</p><br/><p>“Wh, what kind of group is that?”</p><br/><p>The wolf-man that was horribly at lying asked with an expression that said he really didn’t know. Yu IlHan just laughed it off saying it’s nothing and shook his head.</p><br/><p>Garden of Sunset, unpredictable guys as always. Yu IlHan thought that they were complete idiots, helping some and not helping the rest.</p><br/><p>“Good, I’ll explain the situation to the humans. You call your troops here. Oh, your name?”</p><br/><p>“Ah, thank you! I’m the Head of the Royal Guardians of the wolfkin, Flemir!”</p><br/><p>Yu IlHan snorted seeing Flemir sigh in relief as he flicked his hand. The widened circle completely disappeared this time.</p><br/><p>“Dad is so cool.”</p><br/><p>“Yes, you can also grow up to be a fine man as well.”</p><br/><p>“Yeah!”</p><br/><p>[Look at his thick skin, this guy……] (Erta)</p><br/><p>[What’s wrong with that? He’s the coolest in the world.] (Liera)</p><br/><p>[Ah, yeah, he sure is. Have a nice love.] (Erta)</p><br/><p>Yumir, impressed at his father who talked firmly against a 4th class monster, tried to get into Yu IlHan’s embraced again, but bashed his head on the armor yet again. Yu IlHan embraced Yumir to be as comfortable as possible as he turned back around to the humans.</p><br/><p>Fear, admiration, respect, hatred, all sorts of emotions were directed towards him.</p><br/><p>What took the most part was admiration. Even though they were both people of Earth, he made a monster higher level than him kneel down in front of him and converse. The humans couldn’t put Yu IlHan in the same line as themselves.</p><br/><p>Of course, there were some exceptions.</p><br/><p>“You, Susanoo! We will definitely [email protected]#$%#@!”</p><br/><p>“Sheesh, such a shameless guy.”</p><br/><p>Such as Michael Smithson who stepped up daringly before being dragged back by the other clan masters.</p><br/><p>“May we, ask for an explanation?”</p><br/><p>There was also a woman with clear eyes, who did not forget her position and role even while despairing at the incomparably widened gap from before even though she thought that she had caught up considerably.</p><br/><p>“Good, I will explain then.”</p><br/><p>Answered Yu IlHan. In English that was no less refined than hers.</p><br/><p>“Before that, one thing. I want to change ‘priorities’ in hunting the monsters, but what do you think?”</p><br/><p>Yu IlHan didn’t trust in monsters, whether it was the always annoying Destruction Demon Army, or the sons of bitches who looked down on the human intelligence of Earth. They were both enemies he had to get rid of in Yu IlHan’s eyes.</p><br/><p>Author’s notes</p><br/><p>There were some (T/N: apparently) who didn’t like a Korean MC being called ‘Susanoo’. I guess it does to me as well. However, since he got it from Japan, there’s no helping it? Since he’s in action in Korea this time, if you have any ideas for a nickname, then please recommend me one.</p><br/><p>Inventory, OP, successful.</p><br/><p>Yu IlHan saw through the man’s patterns because he read most of the novels out there.</p><br/><p>Translator’s notes</p><br/><p>Not sure how to translate ‘wolf-man’, cuz werewolf don’t really fit the bill here. Werewolves are humans mutated into having wolf like features, but this ‘wolf-man’ here was originally a wolf who mutated/evolved into a humanoid.</p><br/><p>Translator: Chamber</p><br/><p>Proofreader: Koukouseidesu</p><br/>\n</div>"}