{"title": "Chapter 131: I Invade – 7", "id": 131, "volume": 2, "url": "http://boxnovel.org/everyone-else-is-a-returnee-chapter-131-i-invade-%E2%80%93-7", "volume_title": "Volume 2", "body": "<h1>Chapter 131: I Invade – 7</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>When he entered the gate, the surrounds transitioned to a wide grassland with fresh air. What was particularly impressive was the fact that there were two suns in the sky.</p><br/><p>He did feel a little strange, having been instantly warped from underwater to above water, but at this point, nothing could really surprise Yu IlHan.</p><br/><p>In any case, the place he was on was on flat ground, so Yu IlHan lightly shook his body before swapping his armor. The change was lighting quick (P/R Even faster than grilling beans with lightning), so Liera, who was staring at him, clicked her tongue.</p><br/><p>[You should really show off a little.] (Liera)</p><br/><p>“I have leather armor underneath anyway, didn’t I say that before?”</p><br/><p>Confirming that his armor was equipped correctly on every part of his body, he tied his boots again and looked around.</p><br/><p>Behind him was the gate that was connected to the undersea dungeon of Earth, and besides it were mages that managed the gate on either side.</p><br/><p>Around 20 meters away from Yu IlHan, there was a copy-paste version of the army battalion that Yu IlHan had just wiped out.</p><br/><p>What this meant was that Yu IlHan had took off his armor and changed it to a new one in a blink of an eye in front of all these people. Of course, they could not see Yu IlHan as he was in concealment. The venue was silent under strict order.</p><br/><p>“From how I can see the castle wall over there, this place should be some kinda garden in the inner castle?”</p><br/><p>[Wouldn’t it be more secretive? Wow, this place is so high. Don’t you think it will be a downhill trip if we go beyond that castle wall?] (Liera)</p><br/><p>Yu IlHan, who looked around as if he had come here for camping, estimated his location before stretching his body. As he had seen all the things he needed to, only action was left.</p><br/><p>“Those mages……”</p><br/><p>[You can kill them. I can re-establish a connection as long as the initial connection is set up.] (Liera)</p><br/><p>“Got it.”</p><br/><p>When Yu IlHan flicked his fingers, the bodies of the mages instantly exploded. To be exact, their bodies were instantly squashed with thousand-tonne heavy spears.</p><br/><p>“Kyaaaaak!”</p><br/><p>“Wh, what the hell!”</p><br/><p>“Everyone calm down! I said calm down!”</p><br/><p>Looking at the exploding bodies of the mages that managed the gate, chaos ensued.</p><br/><p>Chaos, it was a word that Yu IlHan loved the most; he became the strongest in such times.</p><br/><p>This time was no exception.</p><br/><p>[You have earned 6,201,293 experience.]</p><br/><p>[You have earned 10,291,343…]</p><br/><p>[You have…]</p><br/><p>Well, as there were many people in this place, there were quite a few 3rd class ones as well. Yu IlHan also took out his throwing spears to massacre the army unlike the time he was in the sea.</p><br/><p>It wasn’t just his throwing spears. Yu IlHan himself also picked out the ones he could not kill with throwing spears alone and killed them.</p><br/><p>However, what he took out in order to do that was not a spear, but a whip. A black whip with dragon leather as the base, and had ground dragon scales embedded inside!</p><br/><p>[Insanely Passionate Spiked Black dragon whip]</p><br/><p>[Rank – Legend]</p><br/><p>[Attack power – 6,200]</p><br/><p>[Durability 7,200/7,200]</p><br/><p>[Options-</p><br/><p>1. 40% increase in attack speed, and inflicts a random curse that activates one of: big bleeding, bleeding, paralysis, at 100% chance upon hit.</p><br/><p>2. If Whip mastery is over level 60, bloodflame blossoms when wielding the whip. The power of the flame becomes strong according to Whip mastery level, and becomes stronger according to the amount of enemy blood absorbed.</p><br/><p>3. Additional attack by protruding spike on contact of attack.]</p><br/><p>[User restrictions – Whip mastery level 50 or above]</p><br/><p>[A whip created with the maximum desire for the crafter’s offensive desire. If there is a disadvantage, it is that the victim may receive death faster than pain.]</p><br/><p>Although the description on the artifact was slightly disturbing and had a lower attack power than the Eight-tailed dragon spear, this whip had an ability that Eight-tailed dragon spear did not have. That was the various additional attack options that specialized in attacking everything within a certain range!</p><br/><p>What Yu IlHan liked the most was the second option. Eight-tailed dragon spear also had the purple flame, and in fact, strictly speaking, the purple flame was stronger than the bloodflame by a little, but as the whip had a longer reach, it was possible to cause more damage than the spear in a fixed duration of time.</p><br/><p>Above all, the second option truly came to light when meeting with Blaze. That was because Blaze burnt lifeforce to widen the range, and burnt mana to become stronger.</p><br/><p>In other words, no matter how long the whip is, there is no additional consumption of mana in activating Blaze! And although he couldn’t really compare, Yu IlHan had collected the most lifeforce in the world!</p><br/><p>“The enemy is still in the vicinity. Don’t panic and secure the retreat path! And call the mages who can detect concealment…… Kuaaaak!’</p><br/><p>An advanced knight that calmly gave orders was instantly burnt to death on the spot. This happened the moment Yu IlHan’s absurdly fast whip enveloped his body.</p><br/><p>[You have earned 14,302,394 experience.]</p><br/><p>Yu IlHan quickly withdrew the whip before lashing out again. The whip marvelously did not make any sound as it flew and enveloped the next advanced knight.</p><br/><p>[Critical Hit!]</p><br/><p>“Kuhak!”</p><br/><p>His whip attacks were comprised of 3 stages.</p><br/><p>First, the moment the whip envelops the target, the shock and the sharp dragon scale fragments instantly shatter the target’s defensive equipments.</p><br/><p>The moment it hits, sharp spikes protrude out and dig deep into their flesh.</p><br/><p>And finally, the bloodflame absorbed the target’s blood and enters the body through the wound and explode.</p><br/><p>[That sounds painful.] (Liera)</p><br/><p>Liera compressed her thoughts into one line. Yes. In any case, it would REALLY REALLY hurt. They wouldn’t even be able to endure that pain and die!</p><br/><p>[You have earned 16,043,439 experience.]</p><br/><p>“E, even the vice-squadron captain of Lyel Knights…”</p><br/><p>“We haven’t even found the enemy’s shadow!”</p><br/><p>“We can’t do anything with our power.”</p><br/><p>“W, wwwwwwwe are paying for the price for trying to taint the sacred Battle of Competition!” 1</p><br/><p>When the captains and vice-captains of the knight orders started burning to death, thousands lost their morale and wandered around helplessly.</p><br/><p>However, the whip’s real action was starting just now. While the rain of spears fell again and again, Yu IlHan moved around separately as he swung out with his whip to his heart’s content, and the whip that had the power of Blaze, did not lose its power even while it stretched out to tens of meters as it swiped across his vision and sliced and burnt all knights!</p><br/><p>“S, save me…..!”</p><br/><p>“Run, run from this pl……. Kkuaaaaak!”</p><br/><p>[You hav……]</p><br/><p>Would shooting laser cannons create such a scene? The whip Yu IlHan lashed out with extended in a straight line to pierce everything in its path, and when Yu IlHan lightly shook his wrist, the whip moved according to the trajectory and slashed apart everything in its path.</p><br/><p>Tens of 2nd classes were killed instantly with Yu IlHan’s light strike. People of Earth would be shocked upon seeing this. No, perhaps Takagaki Asuha, who also wielded the whip, may become angry; saying that this wasn’t a whip, but a weapon of mass destruction.</p><br/><p>Was it just that? Whenever Yu IlHan caused chaos, the flame that flickered off the whip would spread to the ground and cause a fire.</p><br/><p>Not only there would be an addition in fire attribute attack in a land of fire, as this place was some other land which Yu IlHan didn’t need to care about, he was only more happy.</p><br/><p>[You have…….]</p><br/><p>[The skill, Deathgod, has become level 34. It becomes possible to enhance your abilities by a maximum of 65%.]</p><br/><p>Even the skill, Deathgod, which didn’t increase in level that frequently perhaps due to it being an advanced skill, levelled up. Of course, as Yu IlHan’s concealment didn’t wear off even once after coming to this world, his Deathgod skill’s ability enhancement was being applied at maximum value right now.</p><br/><p>“Is it because it’s their main camp? Or is it because they gathered only their elites? There sure are a lot of 3rd classes.”</p><br/><p>[IlHan. I can feel 4th classes approaching from afar. And two of them too!] (Liera)</p><br/><p>“Well, it would be strange if they didn’t notice anything after all this mess.”</p><br/><p>He intended for this a little as well. Yu IlHan wouldn’t be able to burn an entire country head on, would he? As such, he was planning to set up the spider web and chew the ones that come into his range, little by little. And at the same time, it was also easier to set a main target with Orochi’s interrogation too.</p><br/><p>However, there were two 4th classes, and they weren’t monsters but a hidden card of the humans, so this was very surprising. Honestly, he had expected around a hundred easy 3rd classes, so this was unexpected. Since things became like this, he could only make changes to his spiderweb plan.</p><br/><p>As this was no Abandoned World, nor was the enemy a higher existence, it was impossible to receive power from Angel’s support, and as he couldn’t receive the benefits of anti-dragonkin weapons, he couldn’t say anything was easy.</p><br/><p>The only thing Yu IlHan could believe in right now was the massive attack power support from the ambush with the Deathgod skill active. To just believe in that though, the wall of 4th classes weren’t so easily overcome.</p><br/><p>“God dammit. Let’s think after I clean these mobs out.”</p><br/><p>Yu IlHan stopped thinking and lashed out with his whip even widely. He lashed out as if to burn the entire caste!</p><br/><p>“YOU, MOTHAFUCKAAAA!”</p><br/><p>“That’s one loud voice he has there.”</p><br/><p>Hearing the loud sound that came from afar, Yu IlHan exclaimed quietly. The whip that lashed out at the same time of his exclamation silently burnt the necks of tens of knights.</p><br/><p>“However, it seems his legs aren’t faster than his voice.”</p><br/><p>[Such evil words… Of course, it isn’t like the enemy can hear you.] (Liera)</p><br/><p>“Shut up. I have a weak heart so I can’t diss them up front.”</p><br/><p>[Someone with a ‘weak heart’ is massacring people like this?]</p><br/><p>“That’s that, and this is just some exp pot.”</p><br/><p>Even while Yu IlHan was retorting while pouting, his wrist did not relax, and the army decreased in number again and again.</p><br/><p>It seemed that the two 4th class beings were charging towards him diligently, but they were overwhelmingly slower than Yu IlHan’s ‘hunting’ speed. Only Yu IlHan’s experience kept piling up.</p><br/><p>“Ugh, just how can he in this fire……!”</p><br/><p>“It’s a magic warrior. I’m sure of it. Fuck. Survivors respond!”</p><br/><p>The places around the gate was already a sea of fire. The endlessly soaring fire, and the disturbing smell of smoke offered a sharp sting to everyone in this place with the exception of Yu IlHan.</p><br/><p>The army, which had lost all its power as a group, shattered into pieces, and in fact, they were all being ‘shattered into pieces’ before burning up completely, all in real time.</p><br/><p>“I will definitely find you and kill you!”</p><br/><p>“Master!”</p><br/><p>When the master of the voice approached near Yu IlHan, there were zero survivors from the army. There was only the massive wave of fire rushing towards the castle walls. It was rather impressive for the gate to be still existing.</p><br/><p>“Oh my god, the entire army was obliterated……!”</p><br/><p>Was the voice of a middle-aged man that arrived at the scene, as soon as he confirmed that scene. So it was impossible to deceive a 4th class with just fire huh. Of course, Yu IlHan had no intentions of deceiving them anyway.</p><br/><p>“Obliterated? They were obliterated!? How can that be! They must have gone over to Earth already!”</p><br/><p>“No, they died! All of them, here. Because of that fucking Earthling mutt!”</p><br/><p>Oooh, invaders were of a different class alright. Even though they were classified ‘human’, he was being treated like a mutt even though it was them who was skinning other people!</p><br/><p>Since there was such a cool racism, Yu IlHan felt very refreshed. Although he had no sense of guilt because he knew that, with this, the final line was cleanly crossed.</p><br/><p>[The middle aged man looks much stronger! Huh, he’s really strong? Wouldn’t he become a higher existence if he trains about 300 more years?] (Liera)</p><br/><p>“Nope, because that guy will die today.”</p><br/><p>It seems the two 4th classes were master and disciple. The relatively younger man, and the middle-aged looking man. Although ‘middle-aged’ was the description, according to Liera, he should have lived for several hundred years.</p><br/><p>“I do need to kill them……”</p><br/><p>[It will be hard. The younger man isn’t so simple as he looks either. He should be at least over 220.] (Liera)</p><br/><p>“I knew it.”</p><br/><p>It would be hard to kill either even if he use an ambush, and when that happens, he would have to fight against two. However, Yu IlHan was thinking about how to fight against those two when he came to a genius conclusion.</p><br/><p>“Liera, did you say that gate was closed right now?”</p><br/><p>[Yeah. Unless I open it, or 10 3rd class mages do it, or a 4th class mage recites incantations for 10 minutes, it will stay closed.] (Liera)</p><br/><p>“Ooookay.”</p><br/><p>Yu IlHan seemed to smile before he started charging. The direction, to the place where the two men came from; at full power. Of course, his concealment, still active.</p><br/><p>“Hasta la vista!”</p><br/><p>The enraged middle-aged man and the youth were gritting their teeth while venting their frustration on the innocent ground, even though Yu IlHan had rushed right past them.</p><br/><p>“He is still here. He’s waiting for the moment we let our guard down in this fire! We need to hold out no matter how disgusting this fire is!”</p><br/><p>“I understand, master! I will definitely kill him!”</p><br/><p>Looking back at the beautiful training session of the master and disciple, Yu IlHan seriously sent salutations; salutations for the delusions and useless actions of idiots.</p><br/><p>“Yes yes. Hold out to the best of your ability in that place. Until the empire falls!”</p><br/><p>Adding on top of that, there would be DoT since they were in a place of fire!</p><br/><p>[Oh my, how clever.]</p><br/><p>“I’m quite capable.”</p><br/><p>Yu IlHan, who became proud after receiving such a praise, diligently moved his legs and assaulted the inner castle without the two protectors.</p><br/><p>It took 20 minutes for the two to realize that something was wrong, and at that time, every important item in the empire had already been burnt to the ground.</p><br/><p>Author’s notes</p><br/><p>Yu IlHan-brand equipment is world’s best!</p><br/><p>Brilliant teasing by Yu IlHan even admist of battle.</p><br/><p>‘Hasta la vista’ – spanish for ‘see you later’</p><br/><p>Translator’s notes</p><br/><p>~~~</p><br/><p>Translator: Chamber</p><br/><p>Proofreader: Koukouseidesu</p><br/><p>1. Notice it’s in capitals</p><br/>\n</div>"}