{"title": "Chapter 134: Not Me But My Son?! – 2", "id": 134, "volume": 2, "url": "http://boxnovel.org/everyone-else-is-a-returnee-chapter-134-not-me-but-my-son-%E2%80%93-2", "volume_title": "Volume 2", "body": "<h1>Chapter 134: Not Me But My Son?! – 2</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>“Hup!”</p><br/><p>The knight took forward as if protecting the emperor. However, Yu IlHan didn’t even glance at the legless emperor, and struck out his spear while looking at towards the knight.</p><br/><p>Yu IlHan’s spear trained over a millennium, and the knight’s fist, which had gone through hundreds of years of battle, clashed!</p><br/><p>Boom!</p><br/><p>Yu IlHan’s two-handed spear strike, and the opponent’s fist clashed head on and caused a boom under the ground.</p><br/><p>However, the one to step back first in that monstrous clash, was Yu IlHan.</p><br/><p>“Kuhk!”</p><br/><p>[Kroaaaaar!] 1</p><br/><p>Yu IlHan couldn’t believe it. The opponent’s attack did not contain a lot of mana, and he was single-armed too! But even after that he couldn’t endure it? His psyche took a good churn.</p><br/><p>‘Let’s be serious. No matter how weakened he is, he’s still a 4th class, and he’s the highest levelled one too if I exclude the higher existences I met before. There’s over a hundred levels of difference and he has learned an advanced martial art as well. Moreover, he’s the first one to have seen through my concealment.’</p><br/><p>Yu IlHan’s eyes changed. His stance became more meticulous, and his spear twisted at a weird angle and aimed for the opponent’s heart. Synchronizing his breathing and mana, he focused everything on the spear tip.</p><br/><p>Although he did say that it was fine because of the armor, and he could run at anytime, to Liera, that was only to make her relax.</p><br/><p>If he could not kill him here, this guy may recover using some strange methods and invade Earth again, so there was no way he could leave behind a potentially dangerous element!</p><br/><p>“You……! You’re only a mere 3rd class, but how?”</p><br/><p>However, the surprise was the same for the enemy. It seemed that he had realized that Yu IlHan was not a simple bomber, but a trained spearman. Yu IlHan smiled and charged forward again.</p><br/><p>“Try blocking again!”</p><br/><p>“I’ll block it a million times!”</p><br/><p>“Bullshit.”</p><br/><p>Another clash. Although he tried to add a fake to his hand or shoulder movements, it seemed that it wasn’t that effective against an opponent who has learned an advanced martial art. Yu IlHan was the one to retreat in the second clash as well.</p><br/><p>However, with this, he was finished measuring the opponent. The opponent really was not hiding any of his power.</p><br/><p>“Come at me! My defense will not crumble with just this!”</p><br/><p>“Hey.”</p><br/><p>Yu IlHan laughed and re-gripped his spear.</p><br/><p>“Did you really think I wouldn’t know that you are calling for reinforcements by causing this mess?”</p><br/><p>Illusion magic and protective magic was a finished story, and since Yu IlHan had destroyed them both with the explosion, anyone could approach this place.</p><br/><p>This knight was considering the scenario where he couldn’t block Yu IlHan, and was dragging this fight out.</p><br/><p>“Kuhk……!”</p><br/><p>The knight bit his lips, it seemed that Yu IlHan was right.</p><br/><p>The moment Yu IlHan charged forward was exactly at that moment. The moment his psyche took a slight shock and power left his body for a brief moment!</p><br/><p>[So sneaky!] (Liera)</p><br/><p>“Call me an expert of psychological warfare! Hah!”</p><br/><p>On top of Yu IlHan’s spear, purple flames and Blaze intertwined and created a violent flame. Perhaps the opponent realized that Yu IlHan was now doing a full-out attack, it seemed that the knight with lacking mana gathered whatever energy he had in his body and prepared to counterattack.</p><br/><p>“Sir Elbani, that is……!”</p><br/><p>“You vile creature, this, is human will……!”</p><br/><p>He focused his mana as if to make his remaining arm explode, and was subliming it into something other than mana! It was a beautiful energy that made one forget about the battle and look at it.</p><br/><p>“Take this, my……. Kyahak!”</p><br/><p>However, that was that, and opportunity was still an opportunity.</p><br/><p>Just before Yu IlHan’s spear clashed head on with the opponent’s fist, an Untraceable Trajectory Yu IlHan had struck out beforehand ripped his neck apart.</p><br/><p>“Kuhp, Huuuuup!”</p><br/><p>What was really amazing was that the fist did not even tremble with that attack. As expected of an advanced skill that is equal to the Spear of Untraceable Trajectory! And!</p><br/><p>“Kyahak!”</p><br/><p>[Critical Hit!]</p><br/><p>[The skill, Spear of Untraceable Trajectory, has become level 27. It becomes possible to attack faster, more secretively and consecutively.]</p><br/><p>[The skill, Critical hit, has become level 51. The critical hit rate increases.]</p><br/><p>The moment Yu IlHan’s spear seemed to clash with his fist, yet another invisible spear strike created a second hole in his neck!</p><br/><p>[Oh my god, two at almost the same time!?] (Liera)</p><br/><p>“Just die.”</p><br/><p>Unless Yu IlHan was some single-episode monster that came out in Power Rangers, there was no way he could receive a full power hit head on, is there? In fear of getting hit by the remaining energy in the fist, he hurriedly retreated and landed.</p><br/><p>“Kuhp, Kuhuk……!”</p><br/><p>However, it seems he was overly worried. Although the opponent tried to attack Yu IlHan with purely superhuman willpower, the moment Yu IlHan’s second strike landed as a critical hit, the option on the Eight-tailed dragon spear activated and scattered extremely poisonous material fog.</p><br/><p>This poisonous fog was difficult to endure even with Extreme poison resistance. And this time, the opponent had inhaled it directly through the windpipe, so the result was obvious. However, the knight still muttered more words even while trembling in this situation.</p><br/><p>“How, can……”</p><br/><p>“This, is human will!”</p><br/><p>“You, bas…….!”</p><br/><p>Even while coughing out blood due to using an advanced spear skill twice almost simultaneously, he kept mocking the knight. If there was a mocking competition, gold would be his!</p><br/><p>However, Liera managed to read the deep rage inside his light words. She had seen so much of him hiding his true thoughts inside his light actions for a millennium.</p><br/><p>Moreover, she was also fed up with those humans with their multiple rulers. If there was any time she felt disgusted for humans in her time as angel, it would be right now.</p><br/><p>“Did you really have to do this! Did you really have to destroy a castle with an entire history of a whole world, and step on the dreams and hopes of everything that grew in it! Did you have to kill the imperial family! And even the descendents who knew nothing!”</p><br/><p>“……knew nothing? And did you really have to skin innocent people all the way on Earth? huh?”</p><br/><p>It seems Yu IlHan’s patience was near the limit. He asked the knight who was coughing out blood with a bright smile. At that moment, the knight’s eyelids trembled and he shut his mouth.</p><br/><p>Of course. This was about invading an entire world. There was no way an imperial bodyguard knight would not know when he protected the emperor right by his side.</p><br/><p>“If you make me accept it, then I’ll let you go, so please speak. Hey, I’m giving you the chance.”</p><br/><p>“Th, that’s……”</p><br/><p>“Speak.”</p><br/><p>Said Yu IlHan softly. The knight seemed to stutter before opening his mouth.</p><br/><p>“That, has something to do with the fate of our world……”</p><br/><p>“Oh, yes, of course. And that fate looks to be sure now. From now, you will be destroyed. I’ll make it so.”</p><br/><p>Yu IlHan made a thick smile. Unconcealable killing intent could be felt from his light words. Liera, who was quietly watching this entire conversation playing out in his embrace, thought ‘How cool!’ as expected of a hopeless angel.</p><br/><p>“Ka, hak……!”</p><br/><p>“And you, you talked about human will or whatnot, but that wasn’t even funny.”</p><br/><p>Yu IlHan raised his Eight-tailed dragon spear. As he had serious injuries, and even had holes in his neck 2, and even directly inhaled the poisonous fog, he would die even if he left him alone, but it didn’t fit with Yu IlHan’s personality to leave the enemy alone.</p><br/><p>“You guys are not human.”</p><br/><p>Purple flames and Blaze burned. Perhaps this, too, has something that was more than just mana.</p><br/><p>“You are trash worse than monsters.”</p><br/><p>When he threw his spear, it flew as and struck as if the spear was meant to be in that place, and pierced the head of the knight. Blaze, which gave the greatest pain by burning extremely brightly, severed his life the next moment.</p><br/><p>[You have earned 23,820,227,405 experience.]</p><br/><p>[You have earned the record of Lv 257 Elbani Da Qurad.]</p><br/><p>“Wow, I’m still not levelling up. That’s really frustrating.”</p><br/><p>How many would this ‘Elbani’ guy would have killed in order to reach level 257? Yu IlHan stuck out his tongue at the overwhelming weight of time, and approached the last man here.</p><br/><p>“S, spare me.”</p><br/><p>Shouted the emperor in despair.</p><br/><p>“W, we only wanted a safer dungeon!”</p><br/><p>“What the hell is up with that?”</p><br/><p>[Ah, aaaah…… so that was it.] (Liera)</p><br/><p>Yu IlHan didn’t understand at all, but Liera seemed to have instantly understood it.</p><br/><p>[This world, was just before the 3rd Great Cataclysm, right? Earth is just before its second.] (Liera)</p><br/><p>“And so?”</p><br/><p>[You should know that there is a limit to the materials of Traps of Destruction in Heaven’s possession, right? Among them, the quantity of materials to make Traps of Destructions to safely entrap more and stronger monsters, amount to even less. There is not enough to go around to every world. However, every world would want to get their hands on it, right?] (Liera)</p><br/><p>“Of course.”</p><br/><p>[That’s why, at certain intervals, Heaven’s Army opens the Battle of Competition between worlds that are about to meet their next Great Cataclysm. The winner takes the Traps of Destruction.] (Liera)</p><br/><p>Just by attaching the word ‘competition’ it wasn’t like it could beautify the cruel word ‘battle’. Anyhow, having heard that, he wanted to ask about the rules of the battle, or about the balance of power between worlds, or about the list of matches, but he had no time to listen to any of that.</p><br/><p>If there was anything important, it was that,</p><br/><p>“So, these guys would sneak into Earth with the help of traitors, and become spies in the Battle of Competition to make Earth lose?”</p><br/><p>[Bingo.] (Liera)</p><br/><p>I knew it! It really wasn’t just a simple invasion! Only now did everything become clear.</p><br/><p>Nothing changed the fact that these guys were bitches, but it was good to find out what these bitches are trying to do!</p><br/><p>“So, why didn’t you tell me that before?”</p><br/><p>[It’s forbidden to say it beforehand. And these guys know already because they have a prior experience in their 2nd Great Cataclysm. And since you’ve heard it from them, it’s fine for me to tell you as well. Moreover, even I didn’t think that there would be a world that would cause such an absurd thing like this just because of the Battle of Competition……] (Liera)</p><br/><p>“Okay, that’s enough.”</p><br/><p>With that, he felt refreshed. Since he was, it was time to finish his this. Since he had stirred too much a mess, he felt people approaching this palce.</p><br/><p>“Heeek!”</p><br/><p>When Yu IlHan approached the emperor with a spear in his hand, the guy shouted in fear.</p><br/><p>“If you kill me, the emperor of Kadra empire, there will be a disaster! You must not kill me!”</p><br/><p>“Oh, really now.”</p><br/><p>“Y, yes! The demonic beast that is contracted to the empire will rampage around in rage! If that happens, it will be the end of everything!”</p><br/><p>“Great!”</p><br/><p>Even while exclaiming, he swung his spear without hesitation and severed the emperor’s neck. Yu IlHan snorted while looking down at the emperor, who had an expression of fear until the very moment he died.</p><br/><p>“You’re talking as if giant robot will come out of the pentagon.”</p><br/><p>[What if it really happens?] (Liera)</p><br/><p>“Then that’s the karma of this empire.”</p><br/><p>The innocent civilians will be massacred just because the emperor was killed?</p><br/><p>No matter how rotten and hypocritical this empire was, there was no way they would treat its people as if they were insects, was th…….</p><br/><p>[Kgaaaaaaaaaaaah!]</p><br/><p>At that moment, Yu IlHan could hear a roar from far away as if to smash apart his naïve thoughts.</p><br/><p>He knew just from the cry. Whatever this cry belonged to, it had an absurd amount of power!</p><br/><p>Yu IlHan looked at the dead corpse of the emperor with dizzy eyes before muttering in vain.</p><br/><p>“Ha… ha… oh shit.”</p><br/><p>These bitches were really bitches until the very end. No, calling them bitches was an understatement.</p><br/><p>[What are you going to do, IlHan?] (Liera)</p><br/><p>“I dunno. If I go back to Earth, I’ll try visiting the Pentagon.”</p><br/><p>[Yes, yes. I’ll go together with you. So what about now?] (Liera)</p><br/><p>“…….Well, of course.”</p><br/><p>Yu IlHan heaved a deep sigh. He would welcome that beast if it just stomped on the leader-class people of this empire, but the probability of that was infinitely close to 0……</p><br/><p>“Shouldn’t I take care of it since I caused it? ……. I really don’t want the innocent people to die.”</p><br/><p>[How can you be so merciful at such critical moments…] (Liera)</p><br/><p>“Hmph, shaddap”</p><br/><p>Yu IlHan could see that the knights that were approaching this place had already stopped due to that cry.</p><br/><p>Well then. What did he have to say in order to use them well.</p><br/><p>Yu IlHan pondered on such useless questions as he prepared for battle.</p><br/><p>Author’s notes</p><br/><p>Those who were curious about how the emperor keeps his power, should have understood the means after reading this chapter….. probably T^T</p><br/><p>The method Heaven’s Army uses to manage the worlds is ‘Provision of Traps of Destruction’ from beginning to end. Without this, all worlds will become doomed.</p><br/><p>So is it possible for those that disguised themselves in human skin, to act as spies in the Battle of Competition! – This will be handled later with more content on the Battle of Competition.</p><br/><p>In fact, IlHan’s current attitude is quite hypocritical. It’s not like I created the perfect saint from the beginning either. However, I think I can promise you that he will walk his own path without wavering. Perhaps one of the enjoyable elements of this series if how the character known as Yu IlHan develops throughout the story, or so I think.</p><br/><p>Translator’s notes</p><br/><p>~~~</p><br/><p>Translator: Chamber</p><br/><p>Proofreader: Koukouseidesu</p><br/><p>1. Probably Orochi here.</p><br/><p>2. How was he even speaking…</p><br/>\n</div>"}