{"title": "Chapter 158: If I Open It, It’s The Gate To Hell – 6", "id": 158, "volume": 2, "url": "http://boxnovel.org/everyone-else-is-a-returnee-chapter-158-if-i-open-it-it%E2%80%99s-the-gate-to-hell-%E2%80%93-6", "volume_title": "Volume 2", "body": "<h1>Chapter 158: If I Open It, It’s The Gate To Hell – 6</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>“And so I came here to ask for his opinion…… Oh.”</p><br/><p>After explaining her story to Yu IlHan, Kang MiRae exclaimed after drinking the tea in front of her.</p><br/><p>“The tea is great. What did you do to get this fragrance?”</p><br/><p>“I received the most valuable tea leaves from the elves in Dareu. It’s called Fyylita.”</p><br/><p>Of course, there was an additional processing through the Giant Bucket, but since she wouldn’t understand even if he explained, he didn’t see the need to say so. Instead, he thought over about Kang MiRae’s proposal.</p><br/><p>“To place Vanguard at the center of attention, you say…”</p><br/><p>“Although it will probably become like that even without me doing anything…… If we could control that process, things would become much smoother. And there is a precondition for all of this.”</p><br/><p>Kang MiRae’s eyes shined.</p><br/><p>“Do you have any intentions on selling the advanced weapons to the people of other worlds?”</p><br/><p>“You’re right. That’s a big precondition.”</p><br/><p>If Yu IlHan refused to sell no matter what, then there would be no solution. As such, it was Kang MiRae who confirmed this up front. And so, Yu IlHan replied with a question of his own.</p><br/><p>“If I cooperate with you, do you have the confidence to control the influx of otherworlders?”</p><br/><p>“I do.”</p><br/><p>Declared Kang MiRae.</p><br/><p>“The equipment you make are literally ‘unique’. Just that fact alone would be sufficient to flip everyone’s eyes over, but if you offer a piece of legend tier equipment… even if it was just once in awhile…… I’ll guarantee that everyone from the other worlds will cut off their arms if you ask them to. The villains who try to secretly come over to Earth? The masses will kill them for you.”</p><br/><p>“Is it really that significant…..”</p><br/><p>“It really is. You are much more amazing than you think you are.”</p><br/><p>Yu IlHan shrunk back a little after seeing a madness beyond that of conviction, in her eyes. However, she, had only judged Yu IlHan’s worth precisely. To be specific, the ‘worth’ from what she had seen from him until now.</p><br/><p>Yu IlHan, as expected of a loner, was feeling very pressurized from the strong sense of faith from Kang MiRae, but now that he had received the blessing of the god of smithing, it wasn’t much of a load to make a few more advanced weapons, so if the bothersome things decreased with him doing that, he thought that it may be a better conclusion for him as well.</p><br/><p>“Very well. I’ll cooperate. What do I need to do?”</p><br/><p>“You only need to make the equipment. You do not need to make a lot, and in fact, it should suffice to make only small amounts and put it on an auction. I’ll do the rest myself. I’ll control the people of Earth as well as those from other worlds.”</p><br/><p>Kang MiRae sticking her fork into an unknown fruit coated with sauce on the table, as she spoke those words that made Yu IlHan’s life much easier. After that, her eyes rounded.</p><br/><p>It’s the first time I ate something so rich and refreshing and so… interesting. What is this?”</p><br/><p>“There are fruits in Dareu which become richer if two are put together. I sliced them up and submerged them in the honey that the wolfkin brought over from Kiroa.</p><br/><p>Of course, that ‘submersion’ process happened within the Giant Bucket, but… rest omitted. Kang MiRae extended her hand to the cookie next to the fruits.</p><br/><p>The cookie itself, was of course, baked in a normal oven, but the dough and the spices were put in the Giant Bucket to….. and you know the rest.</p><br/><p>“…..Delicious. So delicious. I’ve never eaten such delicious cookies before.”</p><br/><p>“That’s good.</p><br/><p>“You made it, didn’t you, Mr. IlHan.”</p><br/><p>“Yes. My cooking skill rose quite a lot.”</p><br/><p>“You know what. Let’s sell these too.”</p><br/><p>“…… Sorry?”</p><br/><p>When Yu IlHan raised his head at the sudden proposal, he saw that Kang MiRae’s eyes were spinning. Even though she acted quite meek outside of battle, she was currently fidgeting excitedly with cookie crumbs scattered on her lips.</p><br/><p>“I’ve never tasted such excellent desserts before. There probably won’t be any people that have experienced such things in other worlds either. Let’s launch a brand that sells desserts exclusively! Mr. IlHan. this item is one that can grasp the upper echelons of other worlds! This will become a specialty not losing to that of the equipment. I guarantee it!”</p><br/><p>“No matter how delicious it is, it’s just dessert, though…”</p><br/><p>It wasn’t hard to make them. The tea leaves, fruits, and the cookie dough were all mass-producible. In fact, Yu IlHan had also thought of selling these when he first tasted it.</p><br/><p>However, not to the point of Kang MiRae’s words just now. No matter how delicious something was, something that wouldn’t lose out to the equipment? Did that even make sense?</p><br/><p>However, if Yu IlHan lacked something, it was experience of living as an upper echelon of society. The psychology that he would never understand even if he died, just by reading books and other materials. Kang MiRae, on the other hand, knew it too well.</p><br/><p>“It’s not ‘mere’ dessert. It’s an amazing dessert! If there are two things that people are most concerned about, first is the practicality, and the second is pride. An absurdly expensive dessert that is just as delicious, and produced only in extremely small amounts, only on Earth. This can only go well!”</p><br/><p>Kang MiRae finished her words and sipped her tea again. Then, she narrowed her eyes.</p><br/><p>“It’s not just the things you told me, is it? There is a special process for this, right?”</p><br/><p>“Correct.”</p><br/><p>“I knew it. You wouldn’t have only crafted equipment with smithing…… Ah, so delicious. We must start a brand.”</p><br/><p>“Okay, I get it, so calm down.”</p><br/><p>Kang MiRae received another cup of tea and emptied the dessert dishes. Although Yu IlHan was surprised, as he thought that she had a low desire for food, seeing as how cute her figure was when eating a cookie, Yu IlHan also smiled in satisfaction.</p><br/><p>Although Liera pulled on his hair, he ignored it.</p><br/><p>“……I didn’t plan to do this. Sorry for my appearance.”</p><br/><p>“There are still plenty left, so it’s fine.”</p><br/><p>Kang MiRae, who finally realized what she had done after clearing everything, coughed meekly while covering her mouth; then she spoke.</p><br/><p>“The production method, I’m curious but I won’t ask. Instead, please pack me some of those tea leaves and desserts.”</p><br/><p>“Pfft.”</p><br/><p>The high-class luxury dessert brand, Angel Tear, that spread its fame as widely as the brand Vanguard, was born.</p><br/><p>After Kang MiRae received a clear answer about Vanguard and Angel Tear from Yu IlHan, she contacted a few clan masters in the Front Line Alliance that cooperated with her to control the entry and exit of other worlders coming to Earth. Together, they made Gangnam the center of all worlds.</p><br/><p>That confident-sounding, and in fact, a little over-the-top sounding objective, became reality with just two conditions.</p><br/><p>First, Vanguard sells items to the people of other worlds; exclusively to the people of other worlds who had a clear record of entrance. And also, to the ones who registered for the official trade market that would be created in Gangnam!</p><br/><p>Second, countries, who do not leave a record and does not manage the people of other worlds as well as the creation and management of gates, will have the rights to purchase Vanguard equipment.</p><br/><p>There was no need to advertise a lot. The ones with enough ability to open gates right now on Earth, were all those that had bought Vanguard items before. The ones who would pass through the gates to Earth, should know of the existence of Vanguard, or have their own predictions about it.</p><br/><p>If so, what remained was very simple – importing a policy to meticulously manage the positions of the people from other worlds.</p><br/><p>If anyone refused, then that person would be returned right away, and if that failed, not only that world, the country that opened the gate would also be excluded from the trade with Vanguard.</p><br/><p>When this was all announced, many countries who were making various plans due to the 2nd Great Cataclysm, angrily ripped off the Lightning God Clan and Vanguard; that a mere equipment brand was trying to place earth and the people of other worlds on their palm!</p><br/><p>The problem was that they had no choice but to be swung around as Vanguard wished to. Without Vanguard’s equipment, their national power will fall behind that of other countries, and will only face their doom against the monsters that grew stronger by the day!</p><br/><p>Vanguard had already became an indispensable existence for all countries. And Kang MiRae, knew that very well.</p><br/><p>Kang MiRae proceeded with the plan without shedding any blood or tears. She couldn’t care less about the well-being of other countries. Her only aim was to calm the chaos of the Great Cataclysm down, and make Earth as peaceful as possible!</p><br/><p>Of course, the ones who were already in possession of Vanguard items could try to trade those items on their own, but Yu IlHan had already announced that if his equipment was found to have been resold, not only would the item be confiscated, that person, as well as the country that person hailed from, would no longer be in trade partnership with Vanguard. 1</p><br/><p>No one would try to cut the stomach of the golden-egg-laying duck. If anyone tried to, their own stomachs would be cut open instead.</p><br/><p>If there was a problem, it was the ones with malicious intentions without any concern for any trade with Earth. It was highly probable that even the people of Earth accompanying them were on their side.</p><br/><p>This was the most headache-inducing case, and it could only be prevented by requesting cooperation from other clans as much as possible. And if the crime was exposed, then their stomachs would be cut as well.</p><br/><p>“Once the initial chaos dies down, and the trade with the other worlds stabilizes, we can make a 2nd branch and a 3rd branch in the countries where the clans that cooperated with us, are from. We will make it so that you can raise your heads up in your respective countries.”</p><br/><p>“The countries and clans in Miss Kang’s country would not let that be though.”</p><br/><p>When Michael Smithson, the leader of the Metal Knights from England, who had decided to cooperate purely based on ‘good will’, asked, Kang MiRae smiled and shook her head.</p><br/><p>“They can only prepare the related laws and venue, and cannot affect us in any way. The ones who have the power behind this is me and Mr. Yu IlHan alone. The core is with us, so no matter how much they shout, it’s meaningless, no? This position of authority will not reverse.”</p><br/><p>“Miss Kang, if you really mean it, can we sign a contract? In front of the contract with magical effects, you won’t be getting off easy if you try to scam me.”</p><br/><p>Those were the words of Carina Malatesta, the leader of the Magia Clan of Italy, who decided to cooperate, not based on good will, but had ‘her own circumstances’, and was in fact, full of complaints and jealousy inside. However, Kang MiRae nodded her head.</p><br/><p>“If you can sign the contract I’ve prepared, then of course. In the long run, it is not good for a single country to have overwhelming power. As I’ve said before, what I want is as little bloodshed as possible. Look at Earth right now. We have no room to fight amongst ourselves.”</p><br/><p>Carina Malatesta had to back off while biting her lips. If she rejected here, only she would look petty!</p><br/><p>Other than that, the other clan masters also thought about this a lot in their minds, when they said they would cooperate in fear of not being able to trade with Vanguard if they didn’t, but they had no way of enduring without hopping on the big wave lead by Kang MiRae.</p><br/><p>The world started changing yet again. Laws related to the residence, and trade with the otherworlders, were created, and many new facilities were built as well.</p><br/><p>The place that was met with the biggest change, was of course, Gangnam. Many skyscrapers were erected one after the other, and not to mention the people of the globe, the people from other worlds who visited Earth also focused their attention here.</p><br/><p>No one rejected the simple identity check and management process that Earth had put up. This was because Vanguard equipment was the best across all worlds.</p><br/><p>Heaven’s Army gave out Heaven’s quests related to the gates to other worlds, and the people moved accordingly. Gates that connected with other worlds opened up one after the other, and there was even a newly created job of maintaining the gates by injecting mana.</p><br/><p>A huge wind of change, incomparable to the 1st Great Cataclysm, was billowing over Earth.</p><br/><p>In the center of all this were Kang MiRae and Yu IlHan, but unlike Kang MiRae who had to run around without even being able to dry her hair, Yu IlHan was spending time quite leisurely.</p><br/><p>How much suffering did he and his subordinates go through until now? From Earth to Ferata to Kiroa, and another Abandoned World too! They had gone against entire worlds in succession. Their fatigue wasn’t one that would be relieved after one or two days of rest.</p><br/><p>Yu IlHan knew very well that his subordinates were not masters of Resting unlike him. As he knew about their prior circumstances, he allowed them to have a proper rest this time.</p><br/><p>He fed them everything they wanted to eat, and allowed them to do anything they wished to. Comparing this to how all the other people on Earth were faring now, this was no different from paradise.</p><br/><p>Since around 20% of the monsters generated over the world were finding their way over to the mansion anyway, they could also raise their experience while playing around.</p><br/><p>[What are you going to do about that strange world, then?] (Liera)</p><br/><p>“Nothing happens unless I open that gate, right? And for me to invade that world, I’m still not ready yet.”</p><br/><p>[I don’t think that’s something you’d say!] (Liera)</p><br/><p>Yu IlHan also forgot about the matters he was faced with, and rested like his subordinates. He read books he couldn’t read until now, and played with Yumir.</p><br/><p>[Ah, a vortex appeared in the garden!] (Liera)</p><br/><p>“Uooooooh! Nerf this!”</p><br/><p>Of course, if a vortex appeared nearby the mansion, he tapped on the monitor like mad and made them burst. The perverted vibration demon was beyond horrifying just by imagining it. He didn’t want to face another one like that anytime soon.</p><br/><p>And like that, time flowed past.</p><br/><p>When Yu IlHan judged that he had enough rest.</p><br/><p>To be exact, when exactly one month had passed since he lastactivated the Hourglass of Eternity.</p><br/><p>Yu IlHan moved the workshop located in the underground floor of the Vanguard building, to the underground workshop of his mansion, and even upgraded it. After that, he gathered all of his subordinates in it.</p><br/><p>“Is everyone here?”</p><br/><p>“Of course.”</p><br/><p>“This will be a harsh 2 months. Everyone is prepared, right?”</p><br/><p>The subordinates simultaneously gulped. Only Yumir was all smiles as always. It was a heart-purifying scene, but he now had to restrain from playing around with him for a while.</p><br/><p>“I want to start right away, Your Majesty. My body’s all itching since all I did was resting.”</p><br/><p>“Ugh, in fact, me too……”</p><br/><p>They were at the point of being awkward with resting since they suffered too much! Yu IlHan blamed himself for making them like this, but nodded his head anyway.</p><br/><p>“Good, then let’s start. The two months that does not last an instance. We will recreate the brand Vanguard, and the brand Angel Tear.”</p><br/><p>[Stop with the details and open it already.] (Erta)</p><br/><p>[I thought you spent most of them during the creation of Bittersweet Persona. When did your inventory fill up again…..?] (Liera)</p><br/><p>[Great Cosmos-severing Spear! Let’s train the spear already!] (Spiera)</p><br/><p>He was now used to the angels’ banter as well. Yu IlHan laughed each of their words over, and activated the Hourglass of Eternity after checking that everyone was there.</p><br/><p>Such was the moment when the miracle that would connect Earth with other worlds, was born.</p><br/><p>Author’s notes</p><br/><p>The all-purpose production kit, Giant Bucket</p><br/><p>Vanguard spreads their fame across the worlds</p><br/><p>The poor subordinates now like work more than rest due to Yu IlHan’s ‘teachings’</p><br/><p>Translator’s notes</p><br/><p>Chamber posting (yet again). This is a sponsored chapter! And I’d like to give special mention the name Mark G. for sponsoring two chapters within a short period of time! (He was the sponsor for 155 as well) Thank you!</p><br/><p>And man, the comments sure are interesting (look at the final one in 156, like how MC ‘raped’ a ‘tentacle monster’ to death.)</p><br/><p>Since there were so many sponsored chapters during the past couple of weeks, looks like I have to translate more now! But, I’m still open to sponsors! (I still have like 7 stockpiled right now) Why do I not increase the regular chapters? I might do, when this semester ends…</p><br/><p>Interesting note, I actually translated ‘Angel Tear’ as ‘Angel Tier’ first when it popped up. (Cuz they literally sound the same in Korean, and IMO, in English as well) Until some side character went ‘This is a blessing from Heaven for us to taste the tears of the angels!’ – I was like… wtf? Why the heck would you eat(?)/drink(?) Angel’s tears…? And yeah, it’s Angel Tear, not Angel Tier. I thought Angel Tier cuz the cookies are Angel-grade stuff, but I guess it isn’t.</p><br/><p>Enough from me. Thanks for reading, and thanks for the support!</p><br/><p>P.S I know many people are having ad problems (like leaving the site on for 10 minutes with ad block gets you over 4K ads blocked) There was one comment (moderated) saying that he got over 5K popups(is that even possible???).</p><br/><p>My advice, use adblock. Well, until the ads work properly. From KCDS’s research, it’s from that coffee video ad after the chapter, before the comments section, that’s trying to load over and over again, just to get blocked. However, in my knowledge, KCDS will not come back for a while, due to his final exams. (I mean, some weeks ago, he said ‘I have exams in 6 weeks so I gotta study’, and ofc, I was like, dude, I have exams EVERY 6 weeks… and people simply don’t study 6 WEEKS BEFORE EXAMS)</p><br/><p>So yeah, until he comes back, I can only say sorry (Only he has access to controlling ads).</p><br/><p>Another advice, maybe to stop loading the page once the chapter is up. (Click on that x button next to the forward page button)</p><br/>\n</div>"}