{"title": "Chapter 164: I am the Center of the World – 6", "id": 164, "volume": 2, "url": "http://boxnovel.org/everyone-else-is-a-returnee-chapter-164-i-am-the-center-of-the-world-%E2%80%93-6", "volume_title": "Volume 2", "body": "<h1>Chapter 164: I am the Center of the World – 6</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Around two days time was taken for Yu IlHan to: 1. confiscate the mass-supplied Vanguard gear, 2. finish up the battle between Tsoner and Netherlands, and 3. Checking that the gate was completely closed. It had taken more time than he had expected.</p><br/><p>When he came back Korea after cleaning things up, all traces regarding the auction in the central plaza was gone. Of course, this included the attackers that died there.</p><br/><p>It hadn’t even been 3 days, but the people were walking around in liveliness as if nothing of the sort had happened at all, while embracing the joy of inter-versal trade.</p><br/><p>[Humanity really is amazing.] (Spiera)</p><br/><p>[But they won’t be able to forget it. It should have become a plenty of a warning to the others.] (Erta)</p><br/><p>Yu IlHan succeeded in spotting Kang MiRae and Irma An Ill’ta in the overflowing crowd.</p><br/><p>“Ah, they’re still here.”</p><br/><p>[Why isn’t that woman going back? Don’t tell me she has ulterior motives for IlHan……] (Liera)</p><br/><p>[There’s no way that all women in the world like Yu IlHan. Please calm down, since a cool man in your eyes may not be the same for others.] (Spiera)</p><br/><p>It wasn’t just Kang MiRae and Irma An Ill’ta. Ericia, Na YuNa, the elves, and even Yumir were with them, and were attracting attention from everywhere, so it would be strange if he couldn’t find them instead!</p><br/><p>“Dad!”</p><br/><p>“Yes, yes. I’m back.”</p><br/><p>At the same time Yu IlHan lightly landed next to them and folded his wings, Yumir, who noticed his presence, jumped up into his embrace. Just as when Yu IlHan was hugging Yumir, Kang MiRae, who was watching asked him with narrowed eyes.</p><br/><p>“I thought you said ‘I’ll be back soon’ and you’ve destroyed an entire country, eh?”</p><br/><p>“I wanted to do it as peacefully as possible.”</p><br/><p>So, I’ve scattered a country instead of killing people. Although it was unknown what change of heart he had after going to Ferata, it seems he had evolved in the worst way possible.</p><br/><p>“Peacefully, you say……. haha.”</p><br/><p>Kang MiRae could only make a bitter smile at his reply. On the other hand, Irma An Ill’ta and Na YuNa greeted him with bright smile.</p><br/><p>“We were waiting, Mr. Yu IlHan.”</p><br/><p>“Hi!”</p><br/><p>Yu IlHan also replied in a small voice.</p><br/><p>“Hello, and goodbye.”</p><br/><p>“Wao!”</p><br/><p>Then, he turned around to lead his subordinates back to his house. Na YuNa desperately grabbed onto his sleeves.</p><br/><p>“I have a request for you! Go with me to Breya~!”</p><br/><p>Breya referred to the other world Na YuNa had been to. It was a world where various religious influences were very large, and because of that, Na YuNa got a lot of special treatment there.</p><br/><p>Yu IlHan replied with a kind smile.</p><br/><p>“Please look elsewhere.”</p><br/><p>“The reward is the highest-quality holy stones, though?”</p><br/><p>At that moment, Yu IlHan’s body was inflicted with a stun.</p><br/><p>Holy stones referred to the minerals that have the power of gods in them. Yu IlHan also had an experience of processing the god of beauty’s holy stones to make Na YuNa and Kang HaJin’s weapons.</p><br/><p>Although he once pondered deeply on how holy power from gods that were a collection of records were realized, and how they could be imbued into a mineral. Right now, he had come to a vague conclusion that even the holy power was a record that people made as a group.</p><br/><p>And holy stones had an enormous mana concentration, in any case. It was absurd. That meant, that the performance was guaranteed no matter what he made. If he made weapons with that along with the metals he gained through this auction……</p><br/><p>He turned around and asked carefully.</p><br/><p>“……Can I even use them? I’m probably one of the furthest people away from the word ‘beauty’.”</p><br/><p>“If I bestow a holy blessing, you can use it! Even though I look like this, I’m a holy maiden!”</p><br/><p>Declared Na YuNa confidently. Her attitude seemed like Yu IlHan had already accepted her request! Yu IlHan was frustrated that he had to go along with her, but it was also true that it was too seductive of a reward to refuse it based on his emotions.</p><br/><p>“Then let’s hear it.”</p><br/><p>“Yay!”</p><br/><p>“Wait, I wish you’d listen to me first before you listen to her.”</p><br/><p>This time, it was Irma An Ill’ta. She pushed Na YuNa smoothly away from Yu IlHan, because Na YuNa was clinging to him, and took out a few thick books from her pockets and gave them to Yu IlHan.</p><br/><p>“But first, here are some magic engineering texts. This is the original text which has a tremendous value both historically and literarily, containing the fruits of the researchers during the magic kingdom days. So you must return it back to us ‘sometime’.”</p><br/><p>“Aha.”</p><br/><p>When he gave a glance towards Kang MiRae while putting the book into his inventory, she nodded with a slight difficulty. This felt quite suspicious – he thought, when the imperial princess continued speaking.</p><br/><p>“But in fact, this is not the complete version.”</p><br/><p>“How is it not? Is there some restriction that forbids you from taking them out?”</p><br/><p>“If you say that, what I just gave you now is also forbidden from being taken out. I took it on the princess’s rights.”</p><br/><p>She took a sigh before continuing.</p><br/><p>“Although there were a lot of ups and downs for us to stand up again using the name ‘Palladia’ after the magic kingdom of Ill’ta fell, we’ve succeeded in restoring most of the magic texts. But there are some which were unlucky to be not included in the ‘restored’ texts……”</p><br/><p>“And you mean to say that magic engineering is one of them.”</p><br/><p>“Yes! Magic engineering, due to its characteristics, is the easiest to learn if learned along with metalworking. However, after the magic kingdom fell, there were no talents in that area, so neither research nor technology was passed down properly.”</p><br/><p>“However.”</p><br/><p>Kang MiRae intercepted.</p><br/><p>“It seems there is a ruin with traces of magic engineering. The imperial princess coincidentally found one while researching into materials to give you, Mr. IlHan, and excavated it. So perhaps, there might be texts that may enable you to deepen your magic engineering knowledge.”</p><br/><p>“Wao!”</p><br/><p>She found a ruin and even excavated it in just a few days, she was one capable princess alright! Just as Yu IlHan was exclaiming, the imperial princess took the baton again. However, her expression wasn’t so good.</p><br/><p>“The problem starts here. No one amongst us are capable of entering those ruins. It was a place full of walls with unknown characters. We can’t just destroy it either. Even though we can feel a flow of magic, we have no method of doing to it……”</p><br/><p>“So that’s it.”</p><br/><p>That was why she said it wasn’t the complete version. They could have said that the job was done with just the text she gave her now, but it seems like she was an honest person, like Kang MiRae.</p><br/><p>However, the imperial princess’s words hadn’t ended yet.</p><br/><p>“However, I came to the thought that if it was you, Mr Yu IlHan, who can make such exceptional artifacts, you may be able to do something about it.”</p><br/><p>“Hm, yeah. well, probably.”</p><br/><p>Indeed, Yu IlHan also thought that he maybe able to do something about it. Not only did he have the language skill, enabling him to comprehend any kind of text, he also thought himself to be more capable than anyone in regards to handling artifacts.</p><br/><p>“So, Mr. Yu IlHan. Come with me to Lanpas.”</p><br/><p>“Wuh.”</p><br/><p>So, he should have expected for such an offer, but as he had no experience being invited by someone else, he was slightly taken aback. At that moment, Na YuNa shouted instead of Yu IlHan.</p><br/><p>“Mr. IlHan will go to Breya first!”</p><br/><p>“Our empire is also waiting for him. He’s a savior that traded such an artifact with us.”</p><br/><p>Despite the fact that the person in question, Yu IlHan, didn’t say anything, Na YuNa and Irma An Ill’ta started having a staring contest. It looked like they were having a competition to take him to their world first. Kang MiRae only let out a sigh as she stood between the two.</p><br/><p>[IlHan’s so popular now.] (Liera)</p><br/><p>[Isn’t it good? He’s going to visit another world, not to invade it, but for another objective. We can think of it as a gift from the 2nd Great Cataclysm.] (Spiera)</p><br/><p>“That sounds like the gift has a lot of strings attached to it…”</p><br/><p>The 2nd Great Cataclysm brought about a big change, that made Yu IlHan visit another world peacefully, when all he did before the 2nd Great Cataclysm, was to destroy worlds.</p><br/><p>He would be able to observe how other people lived in other worlds, and it would become a good experience for him as well…… but would the situation proceed so optimistically like this? Yu IlHan thought that it was not possible.</p><br/><p>“Whenever something good happens, something much worse happens later. Like how when school finished early, and you come back home in joy only to find out that it’s cleaning day, and have to help out; or how you apply for a slightly higher uni than your grades when you got a good test result than you had expected, only to repeat a year.”</p><br/><p>[You’re making me worried because that sounds so realistic!] (Erta)</p><br/><p>Of course, that was because it was his actual experience. Yu IlHan sighed while looking at the imperial princess and Na YuNa, before smacking Na YuNa on the forehead, because he couldn’t do that to the imperial princess. The staring contest ended with Na YuNa’s defeat.</p><br/><p>“Ouch.”</p><br/><p>“So, did you open a gate going to Breya?”</p><br/><p>“No, not yet!”</p><br/><p>She shouted, as if all that staring contest until now was nothing. Yu IlHan made a bright smile and turned around after smacking her once again on the forehead.</p><br/><p>“Well, then. Let’s go to Lanpas.”</p><br/><p>“Wao, Solomon!”</p><br/><p>Na YuNa acknowledged her defeat. Yu IlHan was seeing through her quite well! Looking at the dejected Na YuNa, Kang MiRae laughed before speaking.</p><br/><p>“Na YuNa, you stay here and make a gate to Breya.”</p><br/><p>“Even if you didn’t say so, there was a dungeon extermination order, so a few clans are waiting. Gate connecting to Breya will be handled by HaJin-oppa!”</p><br/><p>“Oh, there was him.”</p><br/><p>Although the big battle immediately after the Great Cataclysm had ended, it was still true that the number of monsters in each of the dungeons were rapidly rising, so the clans gathered their strength to exterminate them.</p><br/><p>Although this was experienced in the battles after the Great Cataclysm, the most probable place to connect gates to other worlds were places with a lot of monsters, and where most of them were killed. Naturally, dungeons were the number 1 candidate.</p><br/><p>A few vortices formed while the alliance clans exterminated dungeons, and if someone wished to open a gate, they would set on an order, and take turns to open the gates after a suitable process.</p><br/><p>And now, it was the Lightning God’s sub-master, Kang HaJin’s turn to open a gate to Breya! Of course, the guild master, and the core member, the priestess, would not be present!</p><br/><p>So, there was no problem even with Na YuNa tagging along. Kang MiRae pondered for a moment, but came to a conclusion fast, as she judged that Na YuNa being with her and Yu IlHan was the safest instead of by her brother’s side.</p><br/><p>“Okay, then. Let’s leave that to him and go.”</p><br/><p>“Yay!”</p><br/><p>“……Sir Kang HaJin is quite pitiful.”</p><br/><p>Like that, The first imperial princess of the empire of Palladia, Irma An Ill’ta, Kang Mirae, and Na YuNa, travelled to another world. Other than them, there was Yumir, who didn’t want to be apart from Yu IlHan.</p><br/><p>“Kill some monsters until I’m back.”</p><br/><p>“Yes, we’ll do our best!”</p><br/><p>It wouldn’t be the end of the world for Yu IlHan to take all of his subordinates, but it wasn’t like he was going there to destroy the world like he did last time, and was just going to visit a ruin, so they wouldn’t be of help even if they went anyway.</p><br/><p>Moreover, the level gap between Yu IlHan and his subordinates widened again just as they had began to catch up a little due to the Bittersweet Persona destroying the vortices, it was time for them to level up a little through hunting.</p><br/><p>“Earth looks like it will do fine for a while with the other clans, so you can go over to Dareu to help the elves, or to Kiroa to help the wolfkin, or do whatever you want.”</p><br/><p>“Understood!”</p><br/><p>As soon as Yu IlHan’s words ended, Ericia and Mirey did a rock-paper-scissors, and Mirey won with scissors. Yu IlHan, who saw them off as they went to Dareu, finally prepared to depart.</p><br/><p>“So, where’s the gate?”</p><br/><p>“It’s close, it’s in Gangnam.”</p><br/><p>Yu IlHan thought that she had one tremendous influence. As long as the gate was connected, wouldn’t the imperial princess be able to find her way to the trade center even while on a stroll?”</p><br/><p>Although, he did make a gate connecting to Dareu in his own house as well!</p><br/><p>[We didn’t know it was possible for the elves to create gates too. They’re not like the people of Earth who are connected to other worlds, and just tagged along with IlHan.] (Liera)</p><br/><p>[Perhaps it’s not much different since the people on Earth are opening gates to the world they ‘belong to’ while on Earth. What’s strange is Yu IlHan, who opened a gate where that perverted vibration demon came from.] (Erta)</p><br/><p>“Shut up.”</p><br/><p>Only 10 minutes were taken with the limousine Kang MiRae had called. The ones guarding the gate weren’t the members of the Lightning God clan but the people under the Kang family. As soon as the company arrived, they bowed their heads.</p><br/><p>“Guard it well.”</p><br/><p>“Yes! Please take care, lady!”</p><br/><p>“Please take care, Sir Yu IlHan!”</p><br/><p>Yu IlHan felt slightly strange that they were being overly respectful to him as well, but passed it off as it being because he was her friends, as he passed over the gate.</p><br/><p>The imperial palace of Palladia, was awaiting him.</p><br/><p>Author’s notes</p><br/><p>A monumental moment! Going to another world peacefully!</p><br/><p>Magic engineering, we’re going to meet you now!</p><br/><p>Translator’s notes</p><br/><p>2/6 chapters!</p><br/><p>Sponsored by Matthias S Man you’re da best (He’s sponsored 4 now)</p><br/><p>4 more coming later.</p><br/><p>P.S You guys drained me of my stockpile. Good going there.</p><br/>\n</div>"}