{"title": "Chapter 168: I am the Digger – 2", "id": 168, "volume": 2, "url": "http://boxnovel.org/everyone-else-is-a-returnee-chapter-168-i-am-the-digger-%E2%80%93-2", "volume_title": "Volume 2", "body": "<h1>Chapter 168: I am the Digger – 2</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>[Yu IlHan, now…….?] (Erta)</p><br/><p>[Now!] (Liera)</p><br/><p>“Yes, now!”</p><br/><p>While Erta was unsure, Liera was, and Yu IlHan agreed while crouching in a fetal position. At that moment, a grand explosion occurred!</p><br/><p>[Kuwaaaaaaaaah!]</p><br/><p>“Uaaaaaaah!”</p><br/><p>The golem roared, but the one who actually wanted to scream was Yu IlHan. The effect of the explosion was so large that, Yu IlHan’s body sprung upwards due to the impact! He only endured while putting his faith into Aegis and his armor. Also…..</p><br/><p>“Damn, this thing still isn’t dead! Then……”</p><br/><p>[You really are going to do that? Do you have to do it?] (Liera)</p><br/><p>“I don’t know anymore!”</p><br/><p>Yu IlHan took out his Eight-tailed dragon spear, and activated purple flames, enhanced it with the Eternal Flame, and activated the Dragonic blood-enhanced Blaze.</p><br/><p>[Are you really going to do it?] (Liera)</p><br/><p>[You’ll really die!] (Erta)</p><br/><p>“If I die……. please blast my the (D:) drive on my laptop to smithereens without asking!”</p><br/><p>An absurdly high temperature heat appeared on the spear, and Yu IlHan struck beneath his foot with it.</p><br/><p>“Uooooh!” (This is MC)</p><br/><p>BOOOOOOM! An explosion incomparable to the one just now, occurred! The once-exploded magic gunpowder on various parts of its body (scattered due to the first explosion) was affected by Blaze and caused a secondary explosion!</p><br/><p>[Kuooooooh!]</p><br/><p>The true might of the bomb only started now. The magic gunpowder scattered deep inside its body, amplified the already volatile energy of Blaze to the extreme, and instantly melted its body into a pool of magma. That which melted the golem’s body, also tried to melt Yu IlHan as well.</p><br/><p>No matter how high Yu IlHan’s fire attribute resistance was, it was impossible to endure without a single scratch amidst all that. In the pain that made him feel like his guts were melting, he glugged on Breath like mad and endured. He actually found it quite endurable after a while.</p><br/><p>“Hey, it’s actually pretty warm once you get used to it…..”</p><br/><p>[Even a higher existence like me is feeling hot! What was that!?] (Spiera)</p><br/><p>[IlHan, come to yourself! You must not sleep!] (Liera)</p><br/><p>[I can understand your worry for him, but that’s a death flag for the snowy mountains!] (Erta)</p><br/><p>How long had he endured in that state? The moment Yu IlHan decided to take out a new cheer pack, the surroundings turned silent as if everything was a lie. Until just now, his ears were almost numb from the golem’s roars, the churning of the insides, and the trembling from everywhere, but now they had all disappeared.</p><br/><p>Immediately after that, the text that signified his victory, etched onto his retina.</p><br/><p>[You have earned, 488,910,776,003 experience.]</p><br/><p>[You have become level 162. 2 Strength, 2 Agility, 2 Health, 2 Magic increases.]</p><br/><p>[You have earned the record of Lv 270 Keshna Golem.]</p><br/><p>“Urgh.”</p><br/><p>And at that moment, an enormous quantity of information flowed into Yu IlHan’s head. To exaggerate a little, it was similar to the time he received the blessing from the god of smithing.</p><br/><p>Yu IlHan didn’t imagine that such a thing would happen, but the golem named ‘Keshna Golem’ had absorbed the records of the ruins in the process of fusing everything into its body, and with Yu IlHan defeating the Keshna Golem, all the records had flowed into Yu IlHan’s brain now!</p><br/><p>No….. well, to be exact, this was precisely what those ancestors intended!</p><br/><p>“This fucker! This is no trap, but something that would activate either way!”</p><br/><p>[Sheesh, there really are some lunatics out there. Do you think humanity dies out in places because of psychos like this one…..?] (Liera)</p><br/><p>Of course, it wasn’t like the magic engineering researchers had intentions to destroy the empire with a golem levelling 270. The problem was the golem they had created!</p><br/><p>Keshna. This magic metal possessed incredible mana absorbability, tensile strength and was counted as one of the highest-tier metals, but other than that, if it was processed through a special means, it becomes possible for it to absorb the records from another object and preserve it in its entirety.</p><br/><p>That was why, the ancestors created a golem from it, intending for it to absorb the records, and enable the successors to defeat it and absorb all of those records!</p><br/><p>…….. That, was, the original intention, but the record absorbability of the Keshna Golem was beyond their imaginations. It would have been good if it just ended with absorbing the magic engineering-related records, but while it was waiting in darkness, it had rapidly grown stronger by absorbing all sorts of other records!</p><br/><p>Contrary to the ancestors’ intentions for a successor to find the place soon, it was left alone for countless years, and the golem which became stronger through absorbing records alone for a long period of time, had actually broke through to the 4th class, and reached level 270!</p><br/><p>And, as intended, it lifted its body in order to defeat the invaders. Result being the scene that had just taken place.</p><br/><p>In other words, the ancestral researchers wanted make a ‘golem that can act as a device to transfer all of the records in its entirety’, but ended up creating a ‘golem that infinitely becomes stronger’. This was a result more absurd than inventing post-its while trying to develop adhesives!</p><br/><p>“And this must be their karma.”</p><br/><p>The angels who heard Yu IlHan’s short explanation could only smile bitterly. They, decided to stop at the conclusion that mana crafters, whether new or old, were all psychos.</p><br/><p>[So, how are you going to get out, IlHan?] (Liera)</p><br/><p>“Oh, this is all mine now.”</p><br/><p>Replied Yu IlHan while avoiding the still uncooled magma. He swung his Eight-tailed dragon spear to procure a place to stand, and without much difficulty, he put away the golem, to be exact, the parts that were only composed of the magic metal.</p><br/><p>One moment, and the space was empty. Yu IlHan, took out spears from his inventory and destroyed his way out.</p><br/><p>Beyond the traces of the stone mountain, which looked like a disaster had struck, his group was waiting for him.</p><br/><p>“Dad!”</p><br/><p>“Mr. IlHan!”</p><br/><p>“So cool…… It will be perfect is there was the white letters ‘END’ at the bottom left of the background~!”</p><br/><p>First, I’ll smack Na YuNa on the forehead – he decided, as he walked towards them.</p><br/><p>Well, there was something else he had decided on.</p><br/><p>He wouldn’t even look in the direction of Lanpas from today onwards!</p><br/><p>***</p><br/><p>“I’m extremely sorry! I was planning to repay you for the necklace, but to think I’d ended up causing an inconvenience…..!”</p><br/><p>“It’s alright. I’ve got the experience and the magic metal as well.”</p><br/><p>The imperial princess couldn’t lift her head in front of him. Yu IlHan didn’t bother mentioning the fact that the golem would have activated either way. The opponent was being humble, so he didn’t find a need to relieve her burden at all.</p><br/><p>Well, he did express his thanks saying that he had acquired plenty of materials related to magic engineering.</p><br/><p>“Oh, and I won’t be going to that banquet either. I want to go back quickly.”</p><br/><p>“But you’ve suffered so much. Why don’t you rest for a day here-”</p><br/><p>“If you really want, then please give me the food that will appear in the banquet.”</p><br/><p>Said Yu IlHan while taking out a L*ck&amp;L*ck box.</p><br/><p>“I hate people, not the food.”</p><br/><p>“Put it…… here? The food?”</p><br/><p>“If you can, pack an assortment into it.”</p><br/><p>The imperial princess couldn’t possibly say no, and accepted the box with a strange expression. Then, she looked towards Kang MiRae for help. Kang MiRae noticed that, and said as well.</p><br/><p>“We’ll wait for you to come back, so please be on your way.”</p><br/><p>“Traitor!”</p><br/><p>The imperial princess walked on the hallway while stomping on the ground. Yu IlHan smile at that and asked Kang MiRae.</p><br/><p>“I’ll borrow the bath though. My body’s a mess right now.”</p><br/><p>“Yes, this way.”</p><br/><p>“I wanna bathe with daddy too!”</p><br/><p>“Then me too, with Mr. IlHan~…… ouchouchouchouchouch!”</p><br/><p>Na YuNa’s attempt to go with them was for naught. Thanks to Kang MiRae’s consideration, Yu IlHan and Yumir could enjoy a luxurious and leisurely bath.</p><br/><p>Of course, he had also set up a luxurious bath in the Bittersweet Persona, but it did lose out when compared to the one in the imperial castle. Yu IlHan entered the bath with Yumir and stretched his body, while trying to find any points to learn from the bath facilities of the imperial castle.</p><br/><p>“Dad, wasn’t it scary?”</p><br/><p>These were Yumir’s words while he scraped Yu IlHan’s back with a soft towel. Yu IlHan thought about what he was referring to, and realized that it was the battle a while ago.</p><br/><p>Scary, huh. It looks like Yumir had felt a sense of fear facing the overwhelming size of the golem. Well, it was no wonder, since the golem did indeed have an overwhelming size, and an overwhelming strength to go with it.</p><br/><p>If he did not have the magic gunpowder or the Death Driver, Yu IlHan would have had to put much more effort into defeating it. Although, he didn’t think he would lose.</p><br/><p>So, it was natural for Yumir, who was both young and still weak, to get scared. Perhaps Yu IlHan was a bad parent for forgetting that he was only three years old now…</p><br/><p>“You don’t have to worry about the big-sized guys. Dad won easily, didn’t I?”</p><br/><p>“Was it easy?”</p><br/><p>Yumir’s voice turned serious, so Yu IlHan pondered seriously as well. Of course, the conclusion was the same.</p><br/><p>“Yup, it was easy.”</p><br/><p>Yu IlHan had already prepared a lot to fight against large enemies, and had coincidentally met one that just fit that criteria. Naturally, there was no other outcome than victory, and so, he won.</p><br/><p>Well, yes, he did panic when the enemy used an attack he didn’t predict, but in any case, they were all attacked that he had put up countermeasures against. It wouldn’t have been so easy if his Excavation skill didn’t rise at the decisive moment, but in any case, it was quite an easy battle.</p><br/><p>“Then what is hard to you, dad?”</p><br/><p>“Higher existence.”</p><br/><p>Yu IlHan immediately replied.</p><br/><p>“If it’s the others, I feel like I can face them with my techniques artifacts or wits, but I still can’t find a solution against higher existences. I feel like I can do it once I am 4th class, but for now, it’s still impossible. No matter how stealthily I move, it will be meaningless if I cannot penetrate their skins.”</p><br/><p>“So that’s it. Dad is strong after all. Your standards are completely different from others.”</p><br/><p>Yumir nodded, but his voice was trembling as if slightly frustrated. Yu IlHan could feel more pressure on his back.</p><br/><p>“I wanted to help dad, but I was sad because I couldn’t do anything.”</p><br/><p>“You helped out plenty.”</p><br/><p>“No, it’s not that.”</p><br/><p>His abilities rose just by fighting together, and he also inflicted a fatal strike with Dragonic blood, so he couldn’t say that Yumir wasn’t of help. However, Yumir didn’t seem to be satisfied with just that. As expected of a dragon.</p><br/><p>“I want to become stronger. I want to fight a lot, and eat a lot.”</p><br/><p>“Yes.”</p><br/><p>“And I’ll become a dragon that suits you, dad.”</p><br/><p>“Yes, you will be able to.”</p><br/><p>In fact, Yumir was plenty strong right now, but Yu IlHan thought that it was not a bad thing to give a positive stimulus to the child. And also……</p><br/><p>“Now I got my hands on magic engineering knowledge, I’ll make a present for you Mir. However, I’ll only give it to you once I see that you’re growing fast.”</p><br/><p>“Really!?”</p><br/><p>A suitable reward would help his desire! Yu IlHan could feel that the mana in Yumir’s body was thumping, in a positive way. Yu IlHan felt better since he thought that he took a step forwards as a father.</p><br/><p>[I wanna bathe too! With Mir~~~!] (Na YuNa)</p><br/><p>[……come, here, and, sit, down.] (Kang MiRae)</p><br/><p>[Hiik!] (Na YuNa)</p><br/><p>At that moment, faint voices could be heard. It looks like the people out there didn’t think that it would be audible inside the bath, but Yu IlHan’s senses were already beyond that of a 3rd class. Mir was the same. The father and son looked at each other and laughed.</p><br/><p>When the father and son exited the bath, the imperial princess was waiting outside. Her expression of achievement was quite impressive.</p><br/><p>“Here, I’ve put in every single one of them! By me! For Mr. Yu IlHan only!”</p><br/><p>“Splendid!”</p><br/><p>Yu IlHan took back the L*ck&amp;L*ck box from her. However, the imperial princess also handed him a jewel that was emitting violet light.</p><br/><p>“This is?”</p><br/><p>“It’s an item that was found when we first went to the magic engineering ruins. Mana can be felt from it, but we can’t do anything about it, so I’ll give it to you.”</p><br/><p>Yu IlHan accepted the jewel. He also checked its information, but for now, he had the same conclusion as the imperial princess. This was an item that was already processed once, and its uses were incomprehensible right now. Perhaps he would understand after he made all the magic engineering knowledge his.</p><br/><p>“Our empire wants to be on friendly terms with you in the future. I implore you to please remember this.”</p><br/><p>“……Got it.”</p><br/><p>He did expect this, but it looks like she still had a sense of guilt.</p><br/><p>Well, it was no wonder, since, although such things were everyday life for Yu IlHan, for her, it was a disaster that would only have a chance of happening once every few hundred years. It was natural that she thought that Yu IlHan had a bad first impression of the empire.</p><br/><p>“It really is alright. If anything, I profited since I levelled up.”</p><br/><p>“Even so…..”</p><br/><p>“Then let’s do it this way. This jewel is my compensation. Oh, and when you enter a newly found ruin, please be careful. It looks like the magic kingdom had quite a lot of psychopaths.”</p><br/><p>“Yes, sir.”</p><br/><p>[As if he’s not a psychopath…..]</p><br/><p>[Shh.]</p><br/><p>Although they had to do something completely different from what he had expected here, Yu IlHan, Yumir, Na YuNa, and Kang MiRae could safely return to Earth. They had harvested more than they had expected too!</p><br/><p>And the next day, he set off for Breya after repairing his equipment.</p><br/><p>Time to acquire a new source of metal and holy stones.</p><br/><p>Author’s notes</p><br/><p>What 2nd Great Cataclysm is to the people of Earth : Struggle for survival</p><br/><p>What 2nd Great Cataclysm is to the people of other worlds : Opportunity.</p><br/><p>What 2nd Great Cataclysm is to Yu IlHan : Labour</p><br/><p>Translator’s notes</p><br/><p>Special thanks to Daniel P!</p><br/>\n</div>"}