{"title": "Chapter 173: Hell Picnic, Alone – 3", "id": 173, "volume": 2, "url": "http://boxnovel.org/everyone-else-is-a-returnee-chapter-173-hell-picnic-alone-%E2%80%93-3", "volume_title": "Volume 2", "body": "<h1>Chapter 173: Hell Picnic, Alone – 3</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Blood-red skies without a speck of clouds, and the lands that bathed in an unpleasant light. Although Yu IlHan had experienced a lot of worlds, this was the first one he felt unpleasant from just watching. Had it not been for the angels bantering away by his side, he wouldn’t be able to keep his smile.</p><br/><p>[Kuooooooh!]</p><br/><p>[??? ???? ?????? ?????????? experience.]</p><br/><p>“Oh, and this experience.”</p><br/><p>Muttered Yu IlHan while watching the perverted vibration demon, which he had defeated many of falling on the ground. In his hands, the Death Driver that finished the thing off was still emitting heat.</p><br/><p>“Whew, that was hard.”</p><br/><p>It was good until the point he where had struck a bone screw deep into its body with the pile bunker.</p><br/><p>However, no matter how much he had hit it with the thunderhammer afterwards, the monster endured the vibration and the battle simply wouldn’t end – making him undertake dangers and charge forwards with a Death Driver in his hands, and drill on it like mad. That kind of suffering was indescribable.</p><br/><p>[Those demons, are definitely getting stronger. I’m sure of it.] (Liera)</p><br/><p>Muttered Liera while watching Yu IlHan approach the demon to pull out the screw. Erta agreed with her.</p><br/><p>[The battles should be getting easier since Yu IlHan is getting stronger, but somehow, I feel like he’s been put into extreme situations in every battle.] (Erta)</p><br/><p>[That’s because the league difference between those demons and Yu IlHan is originally so big, so Yu IlHan’s rate of improvement seems insignificant in comparison. I must remind you that he is still a 3rd class.] (Spiera)</p><br/><p>[That’s true, but……]</p><br/><p>While the angels chatted, Yu IlHan dismantled the vibration demon. He put away the magic organ that generated the vibration on its skin, and drained it of moisture to dry it. All of the processes looked very natural in his hands.</p><br/><p>However, he had to stop his work there since he had no room to make the magic gunpowder. The piled up corpses would be taken care of when he opened a barrier using the Hourglass of Eternity. Despite the fact that he had compressed the overall size through several times, his inventory was starting to fill up.</p><br/><p>“Looks like I should go back to Earth in a while.”</p><br/><p>[So you’re planning to come back?] (Liera)</p><br/><p>“Of course. If you tell me there’s another hunting zone like this on Earth, I might consider otherwise.”</p><br/><p>No matter how fast Earth developed, it was still a world where not long passed after the 2nd Great Cataclysm. There were still numerous dungeons spouting 1st class monsters only, there weren’t many 3rd classes, and 4th classes couldn’t be seen anywhere.</p><br/><p>In contrast, what about this place? Although each and every one of them possessed frightening power, the amount of experience was definitely large as well. Yu IlHan was planning to see the end of this place even if he had to resupply on Earth.</p><br/><p>“But I still wanted there to be an intelligent species. Looks like there aren’t any.”</p><br/><p>[What will you do if those demons are the ‘intelligent species’?] (Liera)</p><br/><p>“Then I’ll stop being human, Liera!”</p><br/><p>[Ok, let’s be angels then!] (Liera)</p><br/><p>Or so he had replied to her, but in fact, Yu IlHan thought that it was highly improbable that those demons were the intelligent species here. The reason was simple. They, neither spoke, nor communicated. There was no possibility of them communicating in a way Yu IlHan could not comprehend, as he had mastered the Language skill long ago.</p><br/><p>It looked like there was no end to scouting this world. Even when he flew at fast speeds using Ruin Calling, all he saw were demons of various colors, and Baobab trees that looked like they were connecting the land with the skies. Well, no, he didn’t know exactly what it was called. He only called them Baobab trees just because they looked like one.</p><br/><p>“How much time has passed?”</p><br/><p>Yu IlHan confirmed with Liera while drinking the water(a.k.a. extreme poison) from the Baobab tree. She replied with a smile.</p><br/><p>[Four and a half months. You want to go see Mir, right?] (Liera)</p><br/><p>“Yup, I wanna see him so bad.”</p><br/><p>Yu IlHan obediently acknowledged that, and picked the fruit(of course, it was also extremely poisonous) from the baobab tree. It tasted quite good, while being a little sour after he grilled it with the Eternal Flame after peeling its skin. He took a bite and continued speaking with his mouth full.</p><br/><p>“But the fact that no one communicated me, is that there is nothing wrong. He’s not looking for me, so what good would anything be if I go see him first? If one did everything as one wanted, then that person wouldn’t be able to do the things that actually needs to be worked on. It will just be an endless loop.”</p><br/><p>[If everyone thought like you, there would be no extinct intelligent species out there.] (Liera)</p><br/><p>[Instead, everyone would become a loner. Doing things when one wants, is the ordinary go to solution. Ouuuuuuch.] (Erta)</p><br/><p>Yu IlHan pulled on Erta’s cheeks. He was plenty lonely already and she just had to pinch right where it hurt!</p><br/><p>[Eeek, just because we can’t use our powers as angels here, you’re too……] (Erta)</p><br/><p>[Hmm, from how you’re flapping your wings, you look like you’re enjoying it. Or is that my imagination?] (Spiera)</p><br/><p>[Erta is a pervert who can only feel that she’s in a relationship through such actions, so you can’t help it.] (Liera)</p><br/><p>Yu IlHan punished Erta thoroughly and ate two more grilled fruits. The sour and bitter taste was truly first class.</p><br/><p>[Not to mention bitter, it’s just poison!] (Erta)</p><br/><p>“Actually, I want to evolve Extreme poison resistance as well……”</p><br/><p>[So your entire life is training.] (Liera)</p><br/><p>It wasn’t just Extreme poison resistance. Yu IlHan cleared away over ten fruits on the spot, and trained other skills while he stooed there.</p><br/><p>These included his class skill, Deathgod, Blaze, the skills he constantly deployed now, such as Superhuman strength and Transcendent regeneration as well as the skills he trained in that state, such as the Spear of Untraceable Trajectory, and the Great Cosmos-severing Spear!</p><br/><p>“It hasn’t been one month yet since I last used the hourglass, right?”</p><br/><p>[Not yet.] (Erta)</p><br/><p>“Dang, I need to learn Great Cosmos-severing spear somehow before the 4th class…….”</p><br/><p>[That’s a lot of things you want to do before 4th class.[ (Liera)</p><br/><p>“But the possibility of acquiring a better class increases the more I raise the skills before 4th class.”</p><br/><p>[Of course, that’s true. But to compensate, the class advancement quest difficulty will also be all the way up there in the Andromeda galaxy.] (Liera)</p><br/><p>Yu IlHan couldn’t care less about the future. He only needed to worry about class changes at that time. The problem now was the Great Cosmos-severing spear he had to learn now.</p><br/><p>By now, the Spear of Untraceable Trajectory had grown to be less burdensome to the point that he had almost no pressure using three strikes at once, but with the Great Cosmos-severing spear, he couldn’t grasp a crucial point.</p><br/><p>He could now bring out the power of a sword and a whip at once, and the power of a sword and a blunt weapon at once, but once he actually did that, the advantages of the spears somehow disappeared, or his physical balance was disrupted. He could understand why Spiera could barely learn the skill after reaching 6th class.</p><br/><p>[What you lack is only time. Your progress right now is still plenty fast. With a little more time, you will definitely be able to succeed.] (Spiera)</p><br/><p>“No, there must be a way to shorten it more. I sure think so……!”</p><br/><p>However, he couldn’t find that way in a measly 3 hours. Since he couldn’t stay here swing his spear forever, his training had to end there today.</p><br/><p>“God dammit, dammmmmmmmmiiiiiiiiiit!”</p><br/><p>Yu IlHan decided to postpone finding a path later, and struck down with the spear with all his power, containing his frustration, hatred, and the weight of his inventory to boot. The land shook with an enormous boom, and Yu IlHan nodded while thinking that he had perfect control in putting the weight of a blunt weapon into the spear.</p><br/><p>But that spear strike, which could be considered to be a mid-way check, and venting frustration, called for much more serious consequences than he had thought it would.</p><br/><p>The shock to the ground was enormous, and since the balance of power was also strangely artistic in a way, the ground cracked along with the strike he did, and the scene tens of meters underground had appeared.</p><br/><p>“Huh, hey. I think I can use that. What should I call this technique?”</p><br/><p>[Do you think that you’ll get a skill just because you name one?Active skills aren’t as easy as you think they are.] (Liera)</p><br/><p>[I don’t care about technique names so let’s start moving……. huh?] (Erta)</p><br/><p>Erta’s eyes glistened. Her eyes were looking at the deep hole underground in the crack that Yu IlHan had split open. Yu IlHan also followed her gaze and looked towards that place, but he couldn’t find anything. However, Erta said with a voice full of expectation.</p><br/><p>[I think, that the mana density is higher down there.] (Erta)</p><br/><p>[Now that I see it, it does actually feel like that…..] (Liera)</p><br/><p>[No, I’m sure of it. It’s definitely higher down there.] (Spiera)</p><br/><p>“Well? This world must have higher mana density below the ground than on the surface. That has nothing to do with me…….?”</p><br/><p>Yu IlHan made the sentence into a question. Now that he saw it, the angels’ gazes were fixed on him. Those eyes were akin to the eyes of a thirsty wanderer who had found an oasis in the desert.</p><br/><p>“……What? You mean I have to dig it? That… endless…. thing?”</p><br/><p>[The light of salvation must be down there.] (Liera)</p><br/><p>[You should be able to do it with your excavation skills.] (Erta)</p><br/><p>[Why don’t you just make this place your base camp? You can dig through the ground whenever you aren’t hunting.] (Spiera)</p><br/><p>Now that there was the slightest hint, Yu IlHan was out of choices. Moreover, his objective was to scout this world in the end!</p><br/><p>With a deep sigh, he took out the pile bunker loaded with a bone screw. There was a method to fulfill the other half the objective, hunting, at the same time.</p><br/><p>“Yeah, well. I’ll just call them here instead.”</p><br/><p>Yu IlHan dispelled the passive concealment, and shot up in the air with Ruin Calling first, and rapidly shot down by directing a shockwave upwards and struck with his pile bunker tens of meters underground.</p><br/><p>BOOOOOOOOOOOM!</p><br/><p>The sound that sounded like the skies were collapsing, resounded across very, very far away. However, that wasn’t the end. Yu IlHan’s Death Driver was still waiting for its turn to cry its heart out.</p><br/><p>“I’ll blow this place to bits if nothing appears.”</p><br/><p>[I’ll give you a kiss at that time!] (Liera)</p><br/><p>“That’s what you always do though.”</p><br/><p>Even while grumbling, Yu IlHan connected the Death Driver to the screw. Please let there be something beyond this thing, and please call for those perverted demons a lot at least – prayed Yu IlHan as he inserted mana into the Death Driver.</p><br/><p>***</p><br/><p>While Yu IlHan, was busy with his work as a digger, not knowing or caring about how the people of Earth combined their forces to develop Earth or to harmonize with other worlds –</p><br/><p>In a world outside of Yu IlHan’s knowledge, the conspiracy, that anyone would have thought up of and would be worried about, was occurring.</p><br/><p>“The Destruction Demon Army and the Army of Brilliant Light? How can those two cooperate?”</p><br/><p>“It’s up to you to believe it or not. However, at this rate. It is sure that the situation will be boring for you guys, no?”</p><br/><p>In a world Yu IlHan had never been to, or rather didn’t know that there was a ‘gate leading to it’, many people were having a conversation. However, the biggest problem was that the people in that place were each from different worlds.</p><br/><p>As mercenary work became active and more and trades opened up between many different worlds, they, who escaped the nets casted with the most amount of carefulness, slowly started to rise, like fungus on bread.</p><br/><p>“Earth is too dangerous. And the current situation, where many worlds are connected through Earth, is even more dangerous. Doesn’t everyone agree with that?”</p><br/><p>“It’s unpleasant and inconvenient. Yes, that’s right.”</p><br/><p>“It was really unpleasant when foreign people invaded the world, and we found out that we could neither chase them out nor kill them.”</p><br/><p>“So you must be talking about the method to solve all of that. Just what is it?”</p><br/><p>Everyone’s gaze focused on one person – the person that had called all of them here. With a smirk, he spoke.</p><br/><p>“It’s nothing difficult. You only need to make a ‘simple magic formation’ behind the angels’ backs, in each of your worlds. By activating all of them at the same time, the magic would become complete, and you will no longer have to worry about Earth.”</p><br/><p>The host of the venue, had shown the plan without even considering the possibility of hiding anything. The pitch black wings behind his back, made it clear that his affinity was the Army of Brilliant Light, the organization of fallen angels.</p><br/><p>“Just that, since it’s a world-scale magic, the more worlds we can do this on, the better. A lot of worlds, to completely suppress the power of Earth, as well as the power of God that influences it. So from now, you guys need to act – as mercenaries, and as merchants – come into contact with Earth, and many people of other worlds and increase our sphere of influence.”</p><br/><p>“I can’t understand what higher existences are saying whether it’s the past or the present. So, okay. What is this magic?”</p><br/><p>“Good question. We call it this.”</p><br/><p>The fallen angel smirked. The smile on his face was as evil as it was handsome.</p><br/><p>“‘Freedom’.”</p><br/><p>Author’s notes</p><br/><p>These guys are like cockroaches, they don’t even die and crawl up.</p><br/><p>The arc just ended and he ends up doing digging work again!</p><br/><p>IlHan is being trained by Liera!?</p><br/><p>Translator’s notes</p><br/><p>Notes. I used the word ‘intelligent species’ but author actually writes what would translate into ‘humanity’. So basically, when I say ‘intelligent species’ it refers to the ones in charge, or the mainstream species. Argh, god dammit. I don’t know either, okay?</p><br/><p>Question, though, should I use the word ‘mankind’ instead? Mind you, this ‘mankind’ may refer to elves, dwarves, beastmen, or others of the sort.</p><br/>\n</div>"}