{"title": "Chapter 180: Everyone Else is a Guardian – 6", "id": 180, "volume": 2, "url": "http://boxnovel.org/everyone-else-is-a-returnee-chapter-180-everyone-else-is-a-guardian-%E2%80%93-6", "volume_title": "Volume 2", "body": "<h1>Chapter 180: Everyone Else is a Guardian – 6</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>There was a limit to the sleeper’s net catching a lot of fish. Never did he imagined he would master Leap while training to kill the boss of the dungeon, and even escape the dungeon with the advanced version.</p><br/><p>He could have predicted it when the title, ‘Frog that leaped out of the well’ came into play in the evolution process… perhaps his foreshadow-reading abilities had come to an end?</p><br/><p>Well, it didn’t matter that much, since he could now go back home, but Yu IlHan still couldn’t erase the sense that something was remaining in his heart.</p><br/><p>“Although it’s good that everything’s solved, what is this stuffy feeling…”</p><br/><p>[That’s because you’re a pervert that cannot rest still until you kill the boss in whichever dungeon you’re in. But, I still like you that way!] (Liera)</p><br/><p>“I also like myself this way. ……And yes, I like you too.”</p><br/><p>[Eheheh.] (Liera)</p><br/><p>Liera thought that she would be forgiven if she just attached ‘I like you’ at the end of her lines, and… it was true. Yu IlHan stroked her hair and checked the skill he had earned just now, Warp.</p><br/><p>“The conditions for using this skill is so tedious…… It’s not like I can go to anywhere I’ve been to, but only after I have a thorough comprehension of that area. What is ‘thorough comprehension’?”</p><br/><p>[Spatial transfer magic is normally a lot more tedious than that. However, you have acquired the Warp skill, and the skill activation conditions you’ve just said is like drawing simple pictures while we, are writing 1 gigabyte worth of mathematical formulae.] (Erta)</p><br/><p>To think back, Erta probably did say she had learnt spatial transfer magic. His time here was so hectic that he had forgotten about that.</p><br/><p>Then, why didn’t she use it…? He looked at her with such eyes, and Erta turned her head away and spoke in a powerless voice.</p><br/><p>[I can only move between worlds. That’s how normal higher existences are!] (Erta)</p><br/><p>“Aha.”</p><br/><p>Erta probably had her pride as a higher existence specializing in magic. Yu IlHan decided to not touch on that.</p><br/><p>[And so? How do you draw the magic formation?] (Erta)</p><br/><p>“There’s nothing like that, I only need to spend some magic stones. But since the skill level is low right now, I think it will take a little time.”</p><br/><p>Yu IlHan thought up of the place he knew about the best, the Bittersweet Persona. Since he had designed it himself, he would at least not fail!</p><br/><p>The number of magic stones to go there in that exact spot, while bringing 3 angels with him……</p><br/><p>Just by thinking up of the conditions, the answer popped out of his head, as if a calculator did all the working out in his brain.</p><br/><p>50 4th class magic stones for Yu IlHan, as he didn’t reach higher existence yet, 80 for the 5th class Erta, and 110 for the remaining two, for a total of 350. It was insanely expensive.</p><br/><p>“Hey I won’t be able to even use it frequently. The cost would probably increase if I move between worlds, too……”</p><br/><p>Yu IlHan once again realized the power of the title ‘Frog that leaped out of the well’. It was only used in the evolution process, and still retained its ability, so he would be able to use it in the future as well. The problem, was that he couldn’t do it here.</p><br/><p>[Why? How many do you need to spend?] (Liera)</p><br/><p>“350 magic stones, all 4th class.”</p><br/><p>[Kehk.]</p><br/><p>“Pay back 300 4th class magic stones later.”</p><br/><p>[Kehk.]</p><br/><p>[Let’s send the bill to Heaven……] (Spiera)</p><br/><p>Yu IlHan, gave the angels the debt, and activated the skill while watching out for any assaults. However, he couldn’t even hear the boss, much less the steps of the demons he had beaten up to death.</p><br/><p>“Done.”</p><br/><p>[I can feel a path opening! But look at that! It’s so secretive, just like IlHan!] (Liera)</p><br/><p>“You shut up.”</p><br/><p>As Yu IlHan’s skill was an advanced version of Leap, there was no tedious process like summoning a gate outside, and just needed for everyone to jump from the spot. That action would become the trigger and distort the path.</p><br/><p>“Now!”</p><br/><p>The moment Yu IlHan jumped hand in hand with the angels, he remembered the faint memories that were almost buried under the weight of a thousand years.</p><br/><p>In his high school, there was once they went to a theme park for a school trip, and the guys who naturally did not include Yu IlHan in their group (probably because they didn’t know he was there), tried to take a cool photo and all jumped at once for it, only to drop all of their phones in their pockets at the same time.</p><br/><p>It would be fine if one or two were intact, but as if to prove their solid friendship, they had all broken their phone screens, which made Yu IlHan very happy.</p><br/><p>[Don’t bring up sad memories and package it like a good one! I’ll do it with you from next time! I’ll do a lot of other things with you!] (Liera)</p><br/><p>“Don’t read my mind.”</p><br/><p>The skill activated successfully. Yu IlHan and the angels ignored the physical and magical spatial limitations and instantly moved to the Bittersweet Persona.</p><br/><p>Yu IlHan blindly believed that this was possible because it was an advanced skill, but in truth, it was a special skill that was only generated due to the achievements he had pulled off until now. No matter how many magic stones were invested, it wasn’t so easy to leap through space.</p><br/><p>However, at the time the scene of the dungeon blurred about with the scene of his property, a small voice could be heard in his ears. It was a voice belonging to a very young child.</p><br/><p>[Don’t come again. No one come again. Do not ever come again.] (???)</p><br/><p>“I won’t, you damn thing.”</p><br/><p>[Hm?]</p><br/><p>“It’s nothing.”</p><br/><p>He shook his head. He was sure that that guy was the boss of the dungeon. The reason it kept sending out those demons was also because it didn’t want to meet Yu IlHan.</p><br/><p>Of course, he said he won’t go back, but Yu IlHan would mercilessly go beat it up if he had the certainty to. Whether it wanted to fight him or not, it was a serious crime to trap Yu IlHan in a cage for more than 2 years!</p><br/><p>And like that, Yu IlHan came back to Earth, in a way he had never even imagined he would.</p><br/><p>[We really came back. With such a crude skill too.] (Erta)</p><br/><p>[The mana concentration of this area has become even higher. I can only sigh thinking about how much change Earth would have undergone in these two years.] (Spiera)</p><br/><p>[Hey, that’s not the problem right now. We’re getting calls from everywhere. EVERYWHERE!] (Liera)</p><br/><p>The angels became emotional that they could communicate with the Heaven’s Army again, and started working busily. Well, since they were away for 2 years, they were probably going to be busy. Yu IlHan had the confidence that he would not be surprised even if all three of them left his side for the next two months.</p><br/><p>“But……”</p><br/><p>Yu IlHan, who finally became emotional that he had come to Earth when he took a fresh and sweet breath of air, noticed something and looked around him.</p><br/><p>Of course, all the trees within the mansion grounds were monitored and managed by the automated system in the mansion, so it didn’t look that different, but he could instinctively feel that they hadn’t undergone much human hands recently.</p><br/><p>“Looks like everyone was busy until now.”</p><br/><p>[Nothing bad happened…… right?] (Liera)</p><br/><p>“No, there are traces of them being here from time to time. Mir was also here not too long ago.”</p><br/><p>What he did was to empty out the fridge. Yu IlHan had finished maturing all the remaining dragon meat and had put them in the fridge, but they were all gone right now.</p><br/><p>“……I suddenly feel like a lot of time has passed.”</p><br/><p>[This guy, you didn’t say anything like that when you were learning magic engineering to craft artifacts and levelling up.] (Liera)</p><br/><p>[Well, parents only feel the flow of time with the growth of their children.] (Erta)</p><br/><p>Yu IlHan couldn’t deny Erta’s words. Not to mention deny, he wanted to meet Yumir right now. The things he had endured until now started exploding all at once.</p><br/><p>“Oh crap. I might even be glad even if I meet Miss YuNa right now.”</p><br/><p>[Hey, don’t go saying that to that woman. It will become a mess. She might try to put a stamp on you.] (Liera)</p><br/><p>Yu IlHan entered the mansion while laughing. The first thing he wanted to do was to have a nice bath with the luxurious facilities in the mansion! Thinking back to how he couldn’t even wash properly in the dungeon for 2 years, he gritted his teeth.</p><br/><p>[Let me go with you too!] (Liera)</p><br/><p>“You also need to scrape your body though. Let’s use a bath each, while I still stay calm.”</p><br/><p>The angels all agreed that they needed to wash up before getting busy, and they each headed to their own battlefield after splitting up. Liera couldn’t let go of the regret, but Spiera and Erta forcefully took her.</p><br/><p>Yu IlHan first took off all his armor and washed them clean, and jumped into the bath after a quick wash.</p><br/><p>Dirt and dead skin floated up the bathtub without even needing to scrape his body. It was as i looking at a birth of an army. Although, the bath was also an artifact so the waste automatically disappeared……</p><br/><p>“Wait.”</p><br/><p>It was at that moment that Yu IlHan thought of the Giant Bucket in his inventory. He discussed the the angels about how it would be good to train mana inside it, but he had forgotten about it since he had a lot of other things to use it on.</p><br/><p>But since he had used up all the materials in the 2 years in the dungeon, there was no need to use the Giant Bucket for quite a while. Then……</p><br/><p>“Good.”</p><br/><p>Scraping all the dead skins and dirt off his body in a flash, he stood up after draining the bath. But then, he realized something else as well.</p><br/><p>“Huh?”</p><br/><p>Although he didn’t notice until now since he had no time to check his growth in the dungeon, it looked like he had grown taller in the past two years, and he reached 190 cm.</p><br/><p>“So I didn’t notice since the growth was too gradual……”</p><br/><p>Yu IlHan was surprised after seeing himself in the mirror. He thought that his growth period had ended with him entering 20 years of age, but it looked like the cells that had evolved over his millennium on Earth, had gradually changed his physical body with the repetitive level ups and the flow of time.</p><br/><p>He alternated between gripping and loosening his fists, and cleanly shaved the beard he had left alone until now, since he was in front of the mirror. He also took out the spear to cut off his hair and it became quite neat.</p><br/><p>“Well then.”</p><br/><p>Thankfully, the bath was wide enough for the bucket to fit. He burned all the cut off hair with Blaze and poured hot water in the Giant Bucket.</p><br/><p>But then, he thought up of something and took out a bottle of Breath and put a few drops of it into the water. Then, the water was dyed in pink and the bucket vibrated slightly for a moment. Yu IlHan thought that his thoughts weren’t wrong.</p><br/><p>‘Perhaps because it’s made of dragon hearts, it sure does have a great compatibility with dragon blood.’</p><br/><p>Yu IlHan scraped his body once again before entering the bucket, and jumped in without hesitation.</p><br/><p>“Phewwwww.”</p><br/><p>Although on the outside, the bucket looked normal since the magic organs comprising the heart had all been fused into the bucket, it was quite clear that the group of dragon hearts absorbed in the bucket were doing their jobs.</p><br/><p>The waves of mana from various parts of the bucket vibrated the water, and vibrated the dragon blood diffused inside it, and even shook the mana residing in Yu IlHan’s body. The feeling was quite….. no, considerably good.</p><br/><p>‘Since I made so much, I won’t need to make cookies for a while right? Looks like I should make this my exclusive bath.’</p><br/><p>Yu IlHan allowed his body to be taken away by the minute vibrations of the water. This caused a lot of positive changes with his mana resonating naturally.</p><br/><p>He thought back to the dragon blood that he had absorbed in the process of evolving the Leap skill. Those dissolved the magic stones and changed it to direct the skill’s growth, and acted as a catalyst for Yu IlHan to absorb more easily. The blood being absorbed into Yu IlHan was actually a side effect.</p><br/><p>They, did not disappear anywhere. They were compressed and took place in Yu IlHan’s soul, his record, and deep inside his bones. Even when he focused now, he could feel the absorbed dragon blood resonating with the Giant Bucket.</p><br/><p>Perhaps the most absurd item Yu IlHan had made until now was not the Bittersweet Persona or anything else, but this Giant Bucket.</p><br/><p>“Dad!”</p><br/><p>At that moment, the door to the bath opened and Yumir ran in. Yu IlHan knew that he was coming as he was half-sharing his senses with the mansion, and when he was about to turn his head towards him.</p><br/><p>“*Waaaaaaaaaaaaah*!” 1</p><br/><p>Yumir ran into him while crying as soon as as he discovered Yu IlHan. Since he did not care about any objects in his path, such as the Giant Bucket, Yu IlHan had to receive him using his arms.</p><br/><p>“*Sob*, *Waaaaaahhhh*!”</p><br/><p>“Yes, yes. It’s alright now.”</p><br/><p>Yu IlHan also put to a lot of rest seeing Yumir safe and sound. He had grown in the meanwhile, and also became more mature.</p><br/><p>Although he was still 3rd class, their realms didn’t look to be that far apart from each other. Just with hunting, there was no way he could have caught up to Yu IlHan, who suffered in hell, but it looks like the effects of the dragon meat were really effective.</p><br/><p>“Dad, where did you go!?”</p><br/><p>“It’s a long story….. a really long one, do you want to listen?”</p><br/><p>“Yeah!”</p><br/><p>“Okay, then.”</p><br/><p>“No, unfortunately, right now, it’s a little……..”</p><br/><p>However, the one that answered him was a female voice and not Yumir. When Yu IlHan turned his head, he could see Kang MiRae who had become more mature and more beautiful over the past 2 years.</p><br/><p>As Yu IlHan could see Kang MiRae, Kang MiRae was also met with the nude body of Yu IlHan inside the bucket.</p><br/><p>“Oh, Miss MiRae was here too.”</p><br/><p>“Huu…”</p><br/><p>Then fainted without a moment’s delay. Yu IlHan blinked a few times and looked at Mir.</p><br/><p>“Mir, why did she just faint?”</p><br/><p>“I don’t know.”</p><br/><p>“What was she about to say again?”</p><br/><p>“That I do know.”</p><br/><p>Yumir answered confidently.</p><br/><p>“They say the 3rd Great Cataclysm is coming!”</p><br/><p>[Whaaaaaaaaaaaaaaat!]</p><br/><p>The moment Yu IlHan was about to say something, a loud noise resounded from where the angels would be washing. Just where did Liera throw her pride and dignity as an angel… Yu IlHan missed the her of when they first met as he stood up.</p><br/><p>It looked like this was no time for a leisurely bath.</p><br/><p>Author’s notes</p><br/><p>Let IlHan rest already! T_T</p><br/><p>Translator’s notes</p><br/><p>No, you don’t need those donors right now, you guys are killing me. And hey, sponsors are done! No more in the queue now! But there are still 2 regular chapters tomorrow! (presumably at this time)</p><br/><p>1. God, I have NO IDEA how to translate crying sounds.</p><br/>\n</div>"}