{"title": "Chapter 181: Everyone Else is a Guardian – 7", "id": 181, "volume": 2, "url": "http://boxnovel.org/everyone-else-is-a-returnee-chapter-181-everyone-else-is-a-guardian-%E2%80%93-7", "volume_title": "Volume 2", "body": "<h1>Chapter 181: Everyone Else is a Guardian – 7</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Yu IlHan tried to lightly wipe his body and get clothed, but the clothes he had bought 2 years ago didn’t fit him anymore.</p><br/><p>Without any options, he just wore a gown over his underwear, and pushed the Giant Bucket to one corner of the bath. The water inside was constantly affected by the bucket to keep the cleanness of the water, so he only needed to heat it back up again when he entered later.</p><br/><p>“But why is dad having a bath here?”</p><br/><p>“Mir, you have yours here from now too.”</p><br/><p>“Ok!”</p><br/><p>Yumir would always start off by accepting whatever his dad said. Even now, his figure sticking to Yu IlHan was like a kid. Well, he just turned 61, so it was natural that he was like this. Moreover, weren’t they separated for more than 2 years now?</p><br/><p>“What did you do until now?”</p><br/><p>“We were very busy. And we still are.’</p><br/><p>From how he was talking about the impending 3rd Great Cataclysm, well, yeah they should have been busy. Yu IlHan strokes Yumir’s head with a smile, and completely dried his hair.</p><br/><p>He went outside after clothing himself and while carrying the fainted Kang MiRae, and was met with the relatively calm Na YuNa.</p><br/><p>He thought about how Kang MiRae had become quite pretty, but compared to Na YuNa, who had innate beauty, and a blessing from the goddess of beauty to top it off, she was quite well off.</p><br/><p>“Hi! It’s good that you’ve returned safely~.”</p><br/><p>“And you too, Miss YuNa.”</p><br/><p>Before, she was quite a ways off to higher existences, but with the increase in her level, and becoming more proficient in utilizing the power of the goddess of beauty, she had an appearance that was hard to believe as human. As Yu IlHan couldn’t see the change process over the 2 years, he was shocked even more.</p><br/><p>Since she was already catching up to the original beauty of a higher existences, despite being a lower one, what would happen once she became a higher existence? He could finally understand why the heads of the various factions aimed for her. And at the same time, he was sure that a lot of annoying things would happen in the future because of her.</p><br/><p>“But Mr. IlHan. You became a lot more handsome than last time~!”</p><br/><p>“Thanks.”</p><br/><p>“You should have said that ‘Miss YuNa too has become very pretty’!”</p><br/><p>“I shut my mouth because I knew you’d say that. You’re as unpleasant as ever.”</p><br/><p>Na YuNa puffed her cheeks, but Yu IlHan did not mind her. Instead, he took out a truly beautiful circlet made of clean, red metal, and had small jewels embedded in places.</p><br/><p>“Is it a new product~?”</p><br/><p>“I can’t sell that. It’s epic ranked.”</p><br/><p>Well, for Yu IlHan, this was nothing more than some random accessory he had made in his spare time in the 2 years of hell, but even the carefree Na Yuna couldn’t help but flinch at that. However, Yu IlHan’s next words were even more serious.</p><br/><p>“You can have it, miss YuNa. Although there’s an ability to strengthen mana, it tilts more to protection. You’d be able to endure even if you were ambushed by a higher existence in some higher world, that should be able to hold out twice. So you need to find someone to protect you while you run away. There’s a lot of other options so do take a look.”</p><br/><p>“……”</p><br/><p>He turned around since he couldn’t hear a reply, and it looked like she was so absorbed in the circlet, and didn’t listen to him at all. Well, it was no wonder. Anyone would be like that with an epic ranked item in their hands. Yu IlHan understood her feelings.</p><br/><p>And soon, a reply came back in a small voice.</p><br/><p>“Thank you.”</p><br/><p>“It’s fine if you use it well.”</p><br/><p>“……Ok.”</p><br/><p>Na YuNa immediately put the circlet on. The circlet did not lose against Na YuNa’s transcendental beauty, and even made her look better while emitting bright light. Of course, the protection ability was on as well.</p><br/><p>“Pretty?”</p><br/><p>“Who do you think made it, of course it’s pretty.”</p><br/><p>Yu IlHan replied with not a lot of wits as if to prove he was single from his birth, as he laid Kang MiRae on the sofa. Na YuNa grudgingly followed him.</p><br/><p>“I know you fell for me.”</p><br/><p>“Please dream when you sleep.”</p><br/><p>Yu IlHan also grumbled and sat on the opposite sofa to Kang MiRae. Yumir followed him and sat on his laps.</p><br/><p>“And so? Why is Miss MiRae like this? Did something happen while I was away?”</p><br/><p>“Although I think I know the reason, but I’ll keep it secret to remain her friend~.”</p><br/><p>Now he wanted to know even more. Thinking about how he should ask about it again later, the angels also rushed out from the other side.</p><br/><p>The problem was that the one at the front, Liera, had flown to him naked with water all over her body, perhaps due to the panic.</p><br/><p>[IlHan, the third! It’s the 3rd Great Cataclysm!] (Liera)</p><br/><p>“I also know about it so get dressed up properly.”</p><br/><p>Since Yu IlHan had seen her naked body quite a few times already due to various circumstances, this was nothing new. Even while sighing, he helped Liera wipe her body and helped her to get dressed.</p><br/><p>In the meanwhile, Na YuNa asked Erta in a whisper.</p><br/><p>“That angel is making a move on Mr. IlHan, right~?”</p><br/><p>[Yes, like how you always do.] (Erta)</p><br/><p>“And Mr. IlHan is receiving it so naturally~?”</p><br/><p>[Yes, like how he always does it with you.] (Erta)</p><br/><p>“Eheheh, that’s nothing.”</p><br/><p>[I wasn’t complimenting you!] (Erta)</p><br/><p>Kang MiRae also regained consciousness while the group was in a mess. Her face was as red as ever, but there was at least no problems with having a conversation. Yu IlHan checked with her just in case.</p><br/><p>“Are you alright? You don’t need to overdo it and can take a rest.”</p><br/><p>“……Oh, no. I’m alright. Of course.”</p><br/><p>He felt like Kang MiRae was avoiding his gaze. Of course, other people not looking at him was a quite frequent thing, so Yu IlHan decided not to mind.</p><br/><p>What he needed right now was information on the current situation on Earth as well as the matters that were happening inside it.</p><br/><p>However, it looked like the ones with Yu IlHan right now, really wanted to know what Yu IlHan was doing for the past 2 years. Yu IlHan could only explain the outline of the situation.</p><br/><p>“You were…… trapped in a dungeon?”</p><br/><p>“And so, I trained like mad for two years to kill the boss, but became lucky in the meantime and was able to get out before I could clear it.”</p><br/><p>The words were like a hit on the back of their heads, as they thought that he was doing some heroic stuff in some other world somewhere.</p><br/><p>“…….Alone inside a dungeon for 2 years?”</p><br/><p>“No, the angels were with me so it wasn’t exactly alone.”</p><br/><p>“But even so……”</p><br/><p>Yu IlHan didn’t feel anything when he said that, since he treated angels as they were on the same level as him, but Kang MiRae and Na YuNa who couldn’t do that yet, could only imagine how he had endured in a place he called hell.</p><br/><p>“So, let’s talk about the 3rd Great Cataclysm now. I have no idea what happened on Earth for the past 2 years.”</p><br/><p>Of course, to Yu IlHan, it was a good thing since he could grind in the dungeon. Rather than that, the 3rd Great Cataclysm was much more important. Kang MiRae opened her mouth with an awkward expression.</p><br/><p>“So…… while you weren’t here, Mr. IlHan, the growth rate of Earth for the past two years was insane.”</p><br/><p>“I did predict that was happening.”</p><br/><p>“Fundamentally, there is an incomparable quantity of mana compared to the other worlds, and so, the frequence of monsters are overwhelming, and the growth of the people were extremely fast as well. Normally, in other words, there should have been many people who shouldn’t have reached 2nd class due to their limitations in talent, but the more good weapons from Vanguard gets sold……”</p><br/><p>Yu IlHan’s auctioned items were the advanced ones only, the ‘standard equipment’ sold by Vanguard, were sold to various worlds as they were still items that were very valuable in the front lines.</p><br/><p>As a result, the class missions that each of these people could never hope to accomplish with their ability, easily cleared those missions with the equipment and proceeded to the next class.</p><br/><p>As such, becoming 2nd class became the minimum requirement to join clans right now on Earth. Had it been any other worlds, it would have been unimaginable.</p><br/><p>Of course, this much, Yu IlHan had predicted. Protecting Earth would become smoother if the average battle power of the people was raised.</p><br/><p>However.</p><br/><p>“As you probably know, the development of Earth will speed up the more humans develop on it. Like going into the fire from the frying pan, the people who achieved sufficient levels also opened gates to the worlds that connected to their worlds, and many people flowed into Earth as well…..”</p><br/><p>Numerous gates opened in each countries, and in that process, mana that composed that world mixed with that of Earth. They stimulated each other through various reactions like repulsion, fusion, and rejection, and called for a result that accelerated Earth’s growth.</p><br/><p>“So, you mean to say that the entire multiverse is helping Earth’s growth?”</p><br/><p>“Even listening to the people of other worlds, and from the notices from the angels, we’re only seeing signs of the 3rd Great Cataclysm for now. But at this rate, it would happen in 3 months, and even 1 month if it’s fast……”</p><br/><p>Yu IlHan could only smile bitterly. He thought that he could finally have a nice rest after suffering in that dungeon, but now it was the 3rd Great Cataclysm already. Really, he was blessed with work or something.</p><br/><p>[If Earth, that achieved a level of a 3rd Great Cataclysm just after its 2nd, experiences its third……] (Liera)</p><br/><p>[That dungeon weighs on my mind as well. Really, Earth is full of trouble. When are we going to solve all of this.] (Erta)</p><br/><p>“We worked a lot until now. We don’t have to think so hard about it, probably.”</p><br/><p>It was still the 3rd Great Cataclysm. When monsters invaded, then he would only defeat them all. Of course, there was a need to strengthen the Bittersweet Persona using the ability of magic engineering he had digested until now.</p><br/><p>“But the real problem is in other places.”</p><br/><p>“Other places?”</p><br/><p>Yu IlHan’s ears perked up, even though he was quite relaxed when he heard the words ‘3rd Great Cataclysm’.</p><br/><p>[Was there something else? There was nothing special on the reports other than the 3rd Great Cataclysm.] (Spiera)</p><br/><p>[Connections with Abandoned Worlds, maybe? No, it looks like that’s everyday life for Earth right now. Earth is like some candy that attracted ants right now.] (Liera)</p><br/><p>“Hey, it makes me sad so don’t speak about it. And so, Miss MiRae, what is it?”</p><br/><p>Kang MiRae didn’t know what to say and hesitated even though she had brought up the topic, and looked at the three angels with him before closing her eyes.</p><br/><p>“In truth….. other than the Abandoned Worlds, it looks like enemies are preparing to attack Earth.”</p><br/><p>“Oh yeah, the Army of Brilliant Light and Destruction Demon Army didn’t come up yet.”</p><br/><p>At first, Yu IlHan thought that the dungeon he went to was a scheme of theirs as well, but he over thought that. That space which was full of ‘will to not let any others in’, was not suitable to attack others.</p><br/><p>“What are those fuckers doing again? Shouldn’t we move immediately?”</p><br/><p>“Ah, no. We just finished one as well…… Mother will explain.”</p><br/><p>“Then it’ll be better if I heard from…… huh?”</p><br/><p>Yu IlHan asked back before he could finish his sentence.</p><br/><p>“Mother, you say……. is your mother also?”</p><br/><p>“Ah, no. Not my mother but yours……”</p><br/><p>Kang MiRae’s cheeks reddened again. Yu IlHan couldn’t possibly imagine the connection between his mother and Kang MiRae, and tilted his head, when his mother did indeed show up at the entrance of the mansion.</p><br/><p>And, she had the appearance from his pre-school days, and didn’t look to be that far apart from Kang MiRae.</p><br/><p>“Just what happened here!?”</p><br/><p>“It was your mother who told us about this matter in the first place. She helped us a lot over these two years as well……”</p><br/><p>“Mother is awesome~!”</p><br/><p>Yu IlHan, who felt dizzy with all this information from Kang MiRae and Na YuNa, first let her inside, and faced her with very complicated eyes.</p><br/><p>“Mom……?”</p><br/><p>“It’s not that you came to the past, nor did I come from the past.”</p><br/><p>“Whoa!”</p><br/><p>Yu IlHan could only acknowledge her now. Only she (and Liera) could read him so easily!</p><br/><p>“I did predict that mom was strong…..”</p><br/><p>“What’s the problem if you did?”</p><br/><p>“I never imagined you were that strong.”</p><br/><p>Yu IlHan scratched his head in embarrassment. From some time onwards, he thought that Earth would be doomed without him, but perhaps that was arrogance on his part.</p><br/><p>But then, it would be good if she helped out a little earlier… Yu IlHan grumbled a little, but there was something to do before he went to that topic.</p><br/><p>“Uh…… I’m back.”</p><br/><p>“Yes, son. Welcome back.”</p><br/><p>His mother made a bright smile and hugged him.</p><br/><p>Other than the fact that they looked more like siblings than mother and son, it was quite an emotional reunion.</p><br/><p>Author’s notes</p><br/><p>If you wish for it dearly….. no it’s nothing. (T/N: This…. is the now-impeached-ex-president’s words – “if you dearly wish for it, the universe will help you achieve it.” And FYI, this chapter was posted in 29th Oct 2016, when the first candlelight vigil occurred in Gwanghwa Moon. This line is like tagged on her whenever her name comes up. And apparently, the original line is from Paulo Coelho’s [The Alchemist] “when you want something, all the universe conspires in helping you to achieve it.”)</p><br/><p>This is a kind of a resting chapter for the main character to catch up since he was away from other for a long time.</p><br/>\n</div>"}