{"title": "Chapter 189: The Path I Walk – 6", "id": 189, "volume": 2, "url": "http://boxnovel.org/everyone-else-is-a-returnee-chapter-189-the-path-i-walk-%E2%80%93-6", "volume_title": "Volume 2", "body": "<h1>Chapter 189: The Path I Walk – 6</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>(T/N: You guys will sooo hate this chapter)</p><br/><p>“Miss YuNa, Miss YuNa? Are you alright?”</p><br/><p>“Wao, I would have fallen for you long ago if you were this kind all the time.”</p><br/><p>Yu IlHan repeatedly called out to her in fear that she may disappear altogether, but the person in question was actually quite calm.</p><br/><p>“I’m not dying so you don’t have to worry.”</p><br/><p>“What do you mean you’re not dying, then just what is…….”</p><br/><p>“That magic formation, doesn’t seem like it directly causes harm on Earth. It looks like it had done something not to Earth but to the people of it, in an unknown, profound, and annoying way.”</p><br/><p>“It’s the same feeling as when I’m going over to Breya. But unlike when I’m going over of my free will, it feels like someone’s forcefully sending me there.”</p><br/><p>“Forcefully? Who?”</p><br/><p>“Who knows~? Probably Earth? I’m scared since I don’t think I’ll be able to come back once I go.”</p><br/><p>Na YuNa replied playfully but Yu IlHan couldn’t laugh. To understand the situation, he had too little facts.</p><br/><p>“It looks like all the others were ejected like me. I can feel that the Earth itself is rejecting me. This curse…… I’m holding out with the holy power of Lady Leytna, but…… ah god dammit. It doesn’t work. It’s not a curse I can do something about.</p><br/><p>The most capable priestess on Earth had given up! Yu IlHan grabbed her tightly in panic, but that did nothing to stop the phenomenon. He became more and more worried, but Na YuNa didn’t understand his feelings and spoke even more.</p><br/><p>“I get it now. When we interrogated the people that set up the formation in Lanpas, I heard that the fallen angels told them to ‘increase their allies’ by going to as many worlds as possible. We only thought that that meant that more magic formations will be installed, but that was the mistake. We should have thought about that more carefully…….”</p><br/><p>[……So that’s it. It was an infection.]</p><br/><p>Liera also seemed to have realized after hearing that. She explained further with an absurd expression.</p><br/><p>[The magic formation was not on standby. It was already active! By spreading the curse inside it among the humans…..!]</p><br/><p>“Curse? That purple fog thing……?”</p><br/><p>[That’s also just a disguise. By covering the actual curse with a highly offensive one….. it’s the basics when using curses. Uu, I knew this when I was beating up mages all the time!]</p><br/><p>There were such curses? But he didn’t even know that…… perhaps Yu IlHan had rejected most of the curses approaching him thanks to possessing a high level of higher curse resistance, so he might have not realized it as he had rejected all of them.</p><br/><p>Na YuNa added at this time.</p><br/><p>“Mr. IlHan. You said I smell good, right? I think that was the curse. Their objective must have been spreading that among the humans…… and perhaps the Earth doesn’t like this smell?”</p><br/><p>Na YuNa’s predictions were relatively on the mark.</p><br/><p>The sole purpose of the installation of the magic formation was to spread a special type of curse aura among the people of Earth. She, along with Kang MiRae and co, was absorbed in destroying them, but by the time the magic formation was destroyed, it was already game over.</p><br/><p>In the fallen angels’ view, they didn’t even care about if the humans destroyed the magic formations or not. No, in fact, they probably wanted them to. The curse that would stick to them would proliferate onto others when they went back to Earth.</p><br/><p>The ones installing the formations would spread the curse, and the ones destroying the magic formations would spread it once again. And after 2 years, there was no one on Earth who was not cursed.</p><br/><p>If it was possible, they would have installed these formations directly on Earth, but then, they would have been destroyed before they could even activate. That was why, they used a method to do it from other worlds, and the result, was very successful, as you see here.</p><br/><p>And the trigger was none other than the 3rd Great Cataclysm. The power of Earth, outgrowing the speed of the humans that live on it, was expelling the people of Earth to the worlds they were connected to. As Yu IlHan was seeing now, the people who could freely go back and forth were disabled from coming back to Earth.</p><br/><p>It was funny that Yu IlHan had the ability to reject that curse when he didn’t have anywhere to be expelled to.</p><br/><p>It was truly ironic. Just during the 2nd Great Cataclysm, countless gates connecting Earth with other worlds were generated, but now that it became the 3rd, the people of Earth were being expelled precisely because of that.</p><br/><p>“But curse is your field. Can’t you dispel it?”</p><br/><p>“It’s, uh, a high dimensional curse that is hard to recognize even as a curse, since it has no offensive power at all. It’s more like a prank that makes my mana emit a certain aura. I think I can do something about it if I get my 4th class, but right now I can’t…..”</p><br/><p>[Don’t come.]</p><br/><p>Before Na YuNa’s words even finished, a voice of quiet and deep wrath, resounded across the region. Na YuNa instantly shut up due to the ‘league’ contained in the voice, but Yu IlHan was unaffected.</p><br/><p>“Dammit, it’s that guy!”</p><br/><p>He remembered hearing that voice once before – inside the hellish dungeon that he had opened gate to.</p><br/><p>[Everyone should go away. And don’t come back.]</p><br/><p>With that, Na YuNa’s blurred even faster. Just what was that guy, just what was that guy to the Earth? Yu IlHan became nervous and sensed for his presence, but it was impossible after all. He couldn’t sense him no matter how hard he searched.</p><br/><p>Moreover, from the point in time they heard the voice, the transformation of nearby buildings and landscape also started accelerating. Even though it hadn’t even been 3 years since the 2nd Great Cataclysm, and the landscape change due to the effects of that hadn’t even finished yet, an even more vigorous change was occurring.</p><br/><p>“Then, the fallen angels’ objective was to eject everyone out of Earth? And that’s why it’s ‘Freedom’? Just why did…..!”</p><br/><p>“Mr. IlHan.”</p><br/><p>Just as Yu IlHan was racking his brain, Na YuNa spoke to him. Her holy powers were amazing so she was still holding out when others would have been ejected long ago.</p><br/><p>“You have to come to Breya to find me.”</p><br/><p>“By what method?”</p><br/><p>“At times like these, you need to say ‘Believe in me!’ and give me a deep kiss!”</p><br/><p>“I’m not that cool, and I won’t do that.”</p><br/><p>“You’re already cool, sheesh. I’ve said that multiple times before.”</p><br/><p>Na YuNa, who grumbled at Yu IlHan’s words, smiled again.</p><br/><p>“Like I said, you will be able to do it if it’s you. So you need to come find me, okay? I’ll also do my best to get 4th class.”</p><br/><p>[Do you think 4th class is some hill on your garden? It’s not as easy as you say…… uh, hey hey hey hey hey!]</p><br/><p>Liera suddenly started shouting. However, Na YuNa had already taken advantage of Yu IlHan being in shocked to steal his lips.</p><br/><p>“Uvvvvv!?”</p><br/><p>“Uuuup, up.” (I leave this to your imagination fellas)</p><br/><p>It was just a moment, but it was a violent kiss that even caused sound effects. This was a moment when Yu IlHan was thinking about the schemes of the Army of Brilliant Light and the Destruction Demon Army, and he instantly came to his senses!</p><br/><p>That was no wonder, since obviously, it was his first kiss! The place where her soft and moist lips touched his instantly turned hot as if he was burned, and the complex thought process inside his head all crashed in an instant. His lips trembled.</p><br/><p>“Just what did you do……”</p><br/><p>He looked down at Na YuNa with dumbfounded eyes. It looked as if her transport to Breya was already commencing as her body was becoming translucent. However, even Yu IlHan could know that her face was bright red. It looked like even she was embarrassed.</p><br/><p>“Fufufu. Mr. IlHan, did you kiss Liera yet? Not yet, right~?”</p><br/><p>“……”</p><br/><p>“Mr. IlHan’s first kiss is not Liera, but this Na YuNa! Ufufufu!”</p><br/><p>And immediately after that, Na YuNa disappeared from his arms. The shocking surprise attack as well as the sudden disappearance had no where to deduct points from.</p><br/><p>“Just…….. what……!”</p><br/><p>Yu IlHan was stiff at that spot even after she had disappeared. Instead, Liera was enraged.</p><br/><p>[To think she was hiding such a trump card! IlHan, wash your lips with murky water, right now!]</p><br/><p>“To think you’d joke over my first kiss. Uaaaaah.”</p><br/><p>He was worried about the future of Earth, as well as his parents, Mir and the others, and also worried about how to deal with the master of that voice, but right now, Yu IlHan had temporarily forgotten about them all. He was dealt a serious blow by Na YuNa.</p><br/><p>And she just ran away like this… He had to look for her even if it was to get it back or something! In the end, only Na YuNa had profited! Yu IlHan thought that she was one clever woman.</p><br/><p>[…… Perhaps she wanted to give you assurance.]</p><br/><p>It took a little time for Liera to speak seriously about this.</p><br/><p>[Speaking honestly, you won’t even believe it even if other people say they like you.]</p><br/><p>“…….You know me too well.”</p><br/><p>[But that woman likes you, no? So she put the stamp on after looking for opportunites. So that you won’t doubt anymore. So that you will completely be sure of it.]</p><br/><p>Saying that, Liera ended up laughing. It was frustrating to see Yu IlHan being done in like that, on one hand, she thought that she (Na YuNa) was cute.</p><br/><p>[Thinking that you’d believe in her feelings just due to a small kiss. She’s such a kid. Looks like she did grow up in a sheltered environment.]</p><br/><p>“Huh?”</p><br/><p>[Huh?]</p><br/><p>“Huh…….?”</p><br/><p>[Huh…….!?]</p><br/><p>After a conversation with just nuances and no proper words, Liera acquired a realization. Yu IlHan was currently, was truly thinking that Na YuNa was liking him! Well, it was true!</p><br/><p>“…….She doesn’t?”</p><br/><p>[No, it’s true……]</p><br/><p>“Right?”</p><br/><p>[…….]</p><br/><p>Seeing Yu IlHan, who was acting worse than a 10 year-old kid despite having lived for over a millenia, Liera was shocked, while Yu IlHan was coming to himself by tapping on his cheeks.</p><br/><p>‘Let’s think about that later. Miss YuNa is a big problem, but there are more important problems that I need to attend to.’</p><br/><p>Didn’t Na YuNa say so? That he had to come looking for her. Rather than wasting time like this, she would probably want him to take action.</p><br/><p>Of course, it wasn’t like Yu IlHan wanted to move according to her words, but it was indeed the correct thing to do right now. Not only Na YuNa, he had to place all the expelled people back to Earth. Living one thousand years alone on Earth was enough!</p><br/><p>“The problem is, how do I go about it.”</p><br/><p>[Ah, I can’t communicate with Heaven either. Erta and Spiera are also there right? Wow, Earth is completely closed off. Unless Earth become a higher world or something, I’m all out of options……!]</p><br/><p>“Don’t throw new bait. My head aches just as it is now.”</p><br/><p>Yu IlHan sighed and raised his head. Looking around, there was no one there, of course. He felt like he could greet Na YuNa like nothing had happened, but reality was too cruel.</p><br/><p>He was left alone again on Earth. And this time, the Earth itself had expelled everyone to other worlds.</p><br/><p>Just why was he left alone so many times in his life? Though, it was very fortunate that Liera was by his side.</p><br/><p>“Huh.”</p><br/><p>It was at that moment that Yu IlHan realized something.</p><br/><p>“How about Mir? He was born on Earth.”</p><br/><p>[Ah.]</p><br/><p>“There are also other children who were born after the Great Cataclysm, what happened to them? Even if they were cursed, they have no worlds to be expelled to!”</p><br/><p>[…… Right, you’re right!]</p><br/><p>Liera also realized that. She couldn’t think up of this since she thought that the entire mankind was connected to other worlds, and just thought of it now thanks to Mir!</p><br/><p>“Shit.”</p><br/><p>This was no time to be standing still. Yu IlHan urgently unfolded Ruin Calling.</p><br/><p>“Just the children without any parents in a world where the 3rd Great Cataclysm is happening……. Uoooooh!”</p><br/><p>Bringing out every last bit of his power, he leaped and at the same time, spread out his sense as far as possible. He was under the mission that he had to find and protect the children!</p><br/><p>However, that was all in vain.</p><br/><p>Despite having made several round trips on Earth, Yu IlHan could not find a single human other than him.</p><br/><p>Author’s notes</p><br/><p>Your first kiss is not OOO, but this XXX! : A famous line from the villain Dio Brando, from the first volume of Jojo’s Bizzare adventures. Let’s wash our lips with murky water if we get kissed with this line.</p><br/><p>Until when does Yu IlHan have to be dropped out! The reason for the fallen angels expelling the people from Earth!? These will be revealed throughout the novel.</p><br/>\n</div>"}