{"title": "Chapter 191: The Path I Walk – 8", "id": 191, "volume": 2, "url": "http://boxnovel.org/everyone-else-is-a-returnee-chapter-191-the-path-i-walk-%E2%80%93-8", "volume_title": "Volume 2", "body": "<h1>Chapter 191: The Path I Walk – 8</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>While Yu IlHan was undergoing season 2 of Earth-alone, in Heaven’s Army, Erta was currently listening to an unbelievable news from the other angels.</p><br/><p>[Did I…… hear wrong?]</p><br/><p>[No, you’ve heard correctly.]</p><br/><p>The 6th class high angel Tibera spoke in a serious voice.</p><br/><p>[The Heaven’s Army, through negotiations with the Army of Brilliant Light and the Destruction Demon Army, has decided to neglect Earth. The expulsion of humans with the 3rd Great Cataclysm was also carried out together with them.]</p><br/><p>[How!]</p><br/><p>[It is to decrease the sacrifices of Earth as much as possible. Are you not aware of it as well? The scene of the original humanity in a newly ascended world. In that aspect, Earth was lucky. The ‘majority’ of them could depend on other worlds.]</p><br/><p>Erta lost her words at the firm reply.</p><br/><p>Well, it was indeed Heaven’s Army’s duty to protect humanity. However, they expelled all the people on there to other worlds to do that?</p><br/><p>No, before that, how could they even join hands with the Army of Brilliant Light, whatever the cause was? The angels should know better than anyone the reason they were corrupted!</p><br/><p>[The children…… What happens to the children that are born after the Great Cataclysm?]</p><br/><p>Erta asked while thinking up of Yumir. Tibera coldly replied.</p><br/><p>[That’s the minimum number of sacrifices we have to bear. …… Yes, those children will probably die.]</p><br/><p>[Those poor little lambs that cannot even differentiate good and evil of their own accord…… you will sacrifice them? Just with the reason that you have to decrease the sacrifices on Earth……?]</p><br/><p>[It’s much better than all the adults dying as well due to Earth’s ascension. Is it now?]</p><br/><p>Erta felt her heart ripping when she heard that. The figure of Yumir looking for his father lingered in her eyes.</p><br/><p>Although she tried not to show it, Yumir was perhaps the most important existence to her, even more than Yu IlHan himself. In the 2 years and 9 months in the Abandoned World, how much help did she get from him? But now, she had to leave him to die?</p><br/><p>[Their souls will all become new life and be born. You do not need to feel despair. That is the law.]</p><br/><p>[Law…..]</p><br/><p>Yes, souls reincarnate. That was the unchanging law, and also a concept that all angels believed in. However, that did not justify the sacrifice of many living life.</p><br/><p>Life was beautiful because it bloomed, and because it wilted at the right time. Erta could not accept this kind of sacrifice. This was not how the God she believed in, worked.</p><br/><p>[Opinions may differ on this. And so, we proceeded with this without telling the lower angels. However, I’m telling you this now because you’re being promoted soon into 6th class, and because you are the guardian angel of that man, Yu IlHan.]</p><br/><p>Looking at the enraged Erta, Tibera added. It was as if saying ‘I have given you special treatment so accept it and get over it’. However, that only made Erta more enraged.</p><br/><p>If she knew this would happen, she wouldn’t have cheered at the words ‘6th class’ and fly over! She would have ignored whatever orders Heaven gave her and stick next to Yu IlHan like what Liera did! She should have looked after that child, Yumir!</p><br/><p>[And Liera? Is she aware of this?]</p><br/><p>[She does not know anything. She was too tainted by humans. She was focusing more on that single human than her work as a member of the army…… It’s obvious how she would react if she heard this.]</p><br/><p>Erta also could predict what would happen. If it was her, she would try to flip over the entire Heaven. Then it would be Earth. She would not accept that Yu IlHan would be in that state. However, Erta was instead envious of her boldness.</p><br/><p>She unhesitantly did everything she wanted to, and that was very similar to Yu IlHan.</p><br/><p>Look at it now. Erta thought that acquiring 6th class would be of more help to Yu IlHan and had come to Heaven, only to be put in a state where she would never perhaps meet him again. However, Liera disregarded all rationale and reason, as well as the priority of her work, and stayed with Yu IlHan, honest to her feelings to stay next to him. And the result? She was next to him right now, wasn’t she?</p><br/><p>‘Yes. The two matches so well. Unlike me, who goes over everything, thinking about rationale and what not, and eventually end up failing……’</p><br/><p>Erta felt a sense of self-loathing. She felt miserable, tragic and above all, she wanted to see Yu IlHan.</p><br/><p>[It is not like we accepted this plan from the get-go. However, the growth of Earth is too fast. We thought that at this rate, a massive disaster would fall upon Earth…..]</p><br/><p>[Did….. did ‘The Lord’ intend to do this?]</p><br/><p>There was only one ‘Lord’ that the angels referred to. Tibera nodded without hesitation when Erta asked that.</p><br/><p>[Yes. The Lord even directly talked with the leaders of other factions to proceed with this.]</p><br/><p>[Then……]</p><br/><p>I do not have a choice.</p><br/><p>Erta couldn’t say the latter parts. She still could not accept it. Sending the people of Earth to other worlds of their own accord just because ‘it was obvious that they are going to die?’ What was dictatorship if this wasn’t?</p><br/><p>She thought until that point, when she remembered that Heaven was committing dictatorship from the time they sent humans to other worlds for 10 years of their own accord.</p><br/><p>Yes. What had changed was not the Heaven’s Army, but Erta herself.</p><br/><p>Her gaze pointed towards the angel standing next to Tibera. The one who stood there was Spiera. She was the one who brought her to Tibera despite saying that she had a lot of work. Perhaps this was a consideration for Erta in her own way, but Erta was annoyed above all.</p><br/><p>[Spiera, you knew this, didn’t you?]</p><br/><p>[It has not been long. And I also felt very unpleasant. That is because the one who lead this joint scheme was none other than the traitors.]</p><br/><p>[But you accepted it.]</p><br/><p>[It was not something that could be changed with my disagreement alone.]</p><br/><p>Spiera was a high angel of 6th class that had nothing to fear in this world, but there were plenty of others who were comparable to her in power in the Heaven’s Army. She was right. Nothing would change even if she disagreed.</p><br/><p>[And so, I wanted for Yu IlHan to become an angel as fast as possible. If a citizen of Earth becomes an angel, there is no need for a war on Earth, and we could immediately make Earth Heaven’s territory. Yu IlHan grew rapidly according to my expectations, but unfortunately, time was lacking. Earth…… has exceeded all our expectations.]</p><br/><p>[……Haha.]</p><br/><p>Erta ended up laughing after hearing that. The despair she could not feel frequently from the time she became a higher existence, enveloped her body. It was as if she had become a complete fool while everyone was acting on their own judgement.</p><br/><p>‘What do I do, Yu IlHan? It was me who always told you to believe in the Heaven’s Army, and its angels, but now I’m like this…..’</p><br/><p>While Erta was at a loss on what to do with her sense of guilt about Yu IlHan, Tibera spoke without even knowing what she was thinking.</p><br/><p>[Erta, you will become a high angel of 6th class soon. So, you need to get rid of your thought processes when you were with a lower existence. Once Earth becomes a complete, higher world, then all higher existence factions will clash upon Earth once again…..]</p><br/><p>[……No.]</p><br/><p>Erta shook her head after a moment of silence. Tibera tilted her head in confusion, but Spiera instantly realized what Erta meant.</p><br/><p>[Erta, are you…… serious?]</p><br/><p>[Yes.]</p><br/><p>Erta tried her best to hold in the rage in her heart and replied curtly.</p><br/><p>[My abilities…… are not yet suitable to become a high angel. When I judge myself to be suitable to become a high angel, I will ask you again then.]</p><br/><p>[Erta, this was our decision after judging that both your magic, as well as your abilities are sufficient……. But if the person in question does not think so, then I cannot help it. Understood. Let’s do it that way.]</p><br/><p>[Yes, I would appreciate it.]</p><br/><p>No matter how much she tried to suppress it, her rage was so large that it was virtually unhidable. Tibera also noticed her emotions.</p><br/><p>[…….Are you not perhaps thinking of something strange?]</p><br/><p>[What specifically do you mean by something strange?]</p><br/><p>Tibera could not reply to that, and Spiera only made a bitter smile on the side. Facing the two high angels, Erta acknowledged that with a laugh.</p><br/><p>[Yes. In fact, I am indeed thinking of something strange.]</p><br/><p>[Erta!?]</p><br/><p>Spiera shouted in shock, but it was too late. Erta couldn’t hold back her raget to the end, and a thin strand of rage slithered like a viper. Her words were sharp as if she was going to bite the two high angels to death.</p><br/><p>[I believe and admire the Lord, but also think that not everything will work his way. This matter is the same. This plan only has meaning after all the people of Earth dies, and Earth has wholly evolved into a higher world alone…… but.]</p><br/><p>[It will become like that. Is it not obvious?]</p><br/><p>[It is indeed not obvious.]</p><br/><p>Erta’s eyes glistened. Even she couldn’t believe it, but she was tearing up right now.</p><br/><p>[You have said that Earth has always exceeded our expectations no? However, there was an existence that exceeded our expectations way before that. Yes, you’re right. It’s Yu IlHan. He will become a higher existence one day, and rule over Earth of his own accord. And no one would be able to acquire Earth!]</p><br/><p>[That is not possible. No matter how exceptional of a human, one cannot become a higher existence on one’s own. He, who is trapped in Earth, cannot come into contact with any of the higher existence factions, and no one will see him.]</p><br/><p>[There were three in this long history. It won’t be strange if there is another one! Wait no, perhaps it’s four? There is a possibility that even the one we serve was once a mere creation, no?]</p><br/><p>[Blasphemy!]</p><br/><p>Shouted Tibera, and Spiera also gripped on her spear in rage. However, Erta continued speaking even with the two stronger beings in front of her, without hesitation.</p><br/><p>[You have mentioned that none of the Heaven’s Army, Army of Brilliant Light, Destruction Demon Army, and the Garden of Sunset, will not look at Yu IlHan, but it is the opposite. Not once did Yu IlHan gave a glance to us higher existence factions. The us he sees is only a bunch of cowards who group up in fear of standing alone! He will become a higher existence on his own!]</p><br/><p>[……Let’s say that the promotion never happened. It looks like your training of the heart is still lacking. You need to cool your head.]</p><br/><p>[I’d love to. Then I’ll take my leave here. I’d appreciate it if you do not look for me.]</p><br/><p>Erta didn’t lose out with her words until the very end, and unfolded her wings. Then she flew away before the high angels could even grab her.</p><br/><p>‘Idiot. I’m really an idiot.’</p><br/><p>She couldn’t even control her emotions and said something blasphemous, and even provoked her superiors. She was disqualified as a higher existence. However, at the same time she also thought this.</p><br/><p>‘So, I have to be careful not to make bigger mistakes in the future.’</p><br/><p>She thought of Yu IlHan. She believed that he would become a higher existence of his own and become the lord of Earth. No, perhaps she only wanted to believed in that, but she was that desperate.</p><br/><p>‘I need to prepare starting now.’</p><br/><p>Resolving on the inside, she flapped her wings again.</p><br/><p>Only she knew where she was heading.</p><br/><p>Author’s notes</p><br/><p>The path Yu IlHan walks, the path Liera walks, the path Spiera walks, and the path Erta walks. Looks like they’re all different.</p><br/><p>Translator’s notes</p><br/><p>Get rekt Tibera. No one likes you</p><br/><p>aaaaaaand 6/6 Queue cleared! (Though, $9 until next one)</p><br/><p>The past 6 chapters have been a hell of a ride haven’t they? Na YuNa’s kiss, Erta’s character development, (hey who knows, she might have a thing for Yumir).</p><br/><p>Anyway, enjoy your read!</p><br/><p>I was not going to do sponsored chapters…. but as I said before. I’m not gonna be able to handle them if they keep coming at this rate, even when this semester is over… Gotta keep doing them I guess…</p><br/>\n</div>"}