{"title": "Chapter 194: I Create – 3", "id": 194, "volume": 2, "url": "http://boxnovel.org/everyone-else-is-a-returnee-chapter-194-i-create-%E2%80%93-3", "volume_title": "Volume 2", "body": "<h1>Chapter 194: I Create – 3</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>From the moment he opened the Hourglass, Yu IlHan had never stopped hammering away at the anvil.</p><br/><p>He did not need a lot of sleep even when he was 2nd class. Right now, he could remain in his top condition with the rest energy generated naturally when not in battle, without even having to drink Breath or Bloodrink.</p><br/><p>So, currently, Yu IlHan was closer to a machine than human 1 A machine that moved perpetually with the minimum amount of energy! Liera was watching over him for the first week or two, but seeing how Yu IlHan was not going to lie down at all, she tried to stop him for fear that he may have gone bonkers.</p><br/><p>[You should not be able to ignore mental stress….. shouldn’t you rest for a little bit?]</p><br/><p>“I decided to not factor in anything that cannot affect my actual body condition. Humans will do fine with willpower alone. Even I don’t feel like I’m human anymore.”</p><br/><p>Yu IlHan replied while moving the carving knife made of dragon bones towards the unknown gigantic lump of metal. However, Liera rejoiced instead.</p><br/><p>[Yes, you finally want to stop being human, right!]</p><br/><p>“But not an angel either.”</p><br/><p>[Why!]</p><br/><p>This lump of metal was was so hard that it couldn’t be damaged by normal weapons, yet brittle enough for him to smash it apart if he put some strength into it. But as he had an understanding on all types of metals with the blessing of the god of smithing, he was masterfully etching on the metal without damaging the internal structure.</p><br/><p>He mixed and matched several magic languages that made the magic formations created by the fallen angels look like a joke, and etched them on the lump of metal. The power of Blaze and the Eternal Flame focused on the tip of the carving knife ensured a precise and beautiful etching.</p><br/><p>However, the most important thing was mana crafting. If Yu IlHan’s designs and the magic language did not harmonize well, mana crafting would immediately fail. Also, if the quantity of magic stones he used in mana crafting was less than that if required for the etched magic language, it would fail as well. Of course, the opposite was true too- mana would go berserk if he used too much.</p><br/><p>Unlike what he was doing now, the creation of artifacts were something that usually took over 10 years.</p><br/><p>And Yu IlHan poured out tens of 4th class magic stones in one corner of the workshop, precisely in order to commence mana crafting, prompting Liera to shout in shock.</p><br/><p>[Why do you need so many 4th class magic stones?]</p><br/><p>“I can’t help it if I want to build a magic device that is permanent. If I don’t want to spend any additional magic stones, I need to invest a lot at this point.”</p><br/><p>And Yu IlHan cleanly used all of those magic stones to succeed in mana crafting. It was a high level technique he couldn’t even imagine when he first learnt the skill.</p><br/><p>A mana crafting technique that bordered mastery, combined with a high level of magic engineering made this possible.</p><br/><p>[They were all cleanly used up, wow. Insane….]</p><br/><p>“The materials are good. You can see it as this being an alloy of all the rare metals from various worlds that I gathered through the auctions. It has incredible hardness, but what it truly excels in is its ability to absorb mana.”</p><br/><p>Normally, metal alloys were created only after countless failures and despair, but Yu IlHan had received the blessing of the god of smithing. Liera listened to his explanation, and felt an inexplicable emotion while looking at the mysterious artifact.</p><br/><p>[Now that Earth is expelling all others, you are making a weapon using metals from numerous other worlds to go against it…..]</p><br/><p>“I had no such intentions……”</p><br/><p>When the process was nearly over, the giant lump of metal started levitating without anyone needing to touch it, and Yu IlHan collected it into his inventory with a satisfied expression. On the other hand, Liera became speechless after feeling a level of magic that was comparable to epic grade artifacts.</p><br/><p>[You, this is…..]</p><br/><p>“Looking forward to it, huh?”</p><br/><p>Yu IlHan achieved the feat of shocking an angel with just a single part, but did not stop to rest and started refining another lump of metal. He felt like he was one step closer to finishing the fortress every time he finished a part.</p><br/><p>Right now, he did not worry about Yumir, his kin, not the Earth. He only looked forward to the results he was going to make.</p><br/><p>[What if a God ranked artifact is actually born from a human? It really is a pity for Earth to be closed off.]</p><br/><p>“We don’t know what is above chaos, perhaps god may not be the end.”</p><br/><p>[You’re so easily saying there’s something above a deity….. no, it isn’t like it’s anything new from you so I’ll stop there.]</p><br/><p>Liera became depressed and stopped speaking. Although the time she spent with Yu IlHan was overwhelmingly short compared to her whole life, that short period had changed her perspective on life.</p><br/><p>Unpredicted change and mistakes on Earth, and Yu IlHan’s actions which she had watched up close. Those raised doubt in her heart. She had never doubted the word ‘absolute’ before, but she didn’t even know if such a thing existed now.</p><br/><p>So, she could only say this.</p><br/><p>[……Then prove it by making an actual one.]</p><br/><p>“You think I can’t?”</p><br/><p>Yu IlHan snorted and picked up the hammer again.</p><br/><p>There was still a month and a half until the Hourglass of Eternity ended. It was more than enough time to finish the flying fortress.</p><br/><p>***</p><br/><p>Yu IlHan’s time flowed fast as always. Since he always found work to do without rest, he did not waste any time.</p><br/><p>His concept of time was already beyond that of a human’s. Majority of humans scheduled their daily workloads, but as Yu IlHan moved towards achieving his objective, there was no ‘night’ nor ‘day’ in his working life, so the concept of ‘date’ had no real meaning to him.</p><br/><p>Like that, 48 days passed, and 80% of the construction of the fortress was done, by his standards anyway. Yu IlHan finally started making the core devices of the flying fortress, the engines.</p><br/><p>[Finally, you’re making something I know!]</p><br/><p>Cheered Liera. She looked as if she would press the launch button on a spaceship at any second.</p><br/><p>“Are you really an angel? And not a person of Earth?”</p><br/><p>[You don’t think that we would work all the time during our long lives, do you? We are the king of disguising and enjoying human lives.]</p><br/><p>“Yeah sure. That’s why you saw some blood in SNS too.”</p><br/><p>[Don’t talk about that!]</p><br/><p>In fact, Yu IlHan also found the making of the levitation engine for the fortress, much more enjoyable than refining and alloying metals. It was a man’s romance!</p><br/><p>He made a gigantic engine, and implemented the power of the Leap skill he possessed through mana crafting, before ensuring continuity in the engines. And there was a total of 10 of these! The number of 4th class magic stones he had spent numbered over a thousand.</p><br/><p>“First, I’ll activate a barrier that covers the entire mansion region and install this engine below it.”</p><br/><p>[Will it really levitate with this?]</p><br/><p>Now that the reality of the flying fortress was becoming closer, Liera’s expectations also rose. Yu IlHan answered with a smile and kicked his creation of other parts up a notch. From now, it was time to make devices that attracted monsters, and weapons that dealt with them!</p><br/><p>In actuality, these were already included in the parts of the current mansion, so Yu IlHan only needed to modify them in order to suit the flying fortress. Of course, 4th class magic stones were also used without holding back here.</p><br/><p>[Looking at the quantity of mana, I think it can kill a 4th class monster.]</p><br/><p>“The final objective of the flying fortress is to restrain and inflict damage to 5th class beings. It has to kill 4th class ones easily.”</p><br/><p>It was just a short while ago when he thought that installation type artifacts could not inflict a fatal damage to 4th class monsters, but such past was meaningless to him! Strong materials with high mana absorption ability increased by the day, and the number of magic stones also had increased a lot!</p><br/><p>[But even so, you are being arrogant about that.]</p><br/><p>“Fufu, will you be able to say that after you see this?”</p><br/><p>What Yu IlHan took out along with those words was the body of the fallen angel.</p><br/><p>[……]</p><br/><p>Liera became speechless for a moment when she saw that, and smiled after seeing that he was pulling out the black feathers from the wings of the fallen angel as if he was plucking feathers from a chicken.</p><br/><p>[Just what are you trying to make with that……?]</p><br/><p>“The flesh and the muscles are honestly useless, but the rest are different. Especially their wings. When mana is imbued inside, it is expelled after changing its properties in a unique way and in a specific direction. What can we do with these characteristics?”</p><br/><p>[We can reflect the opponent’s mana if we use it on a weapon.]</p><br/><p>“You fool! I won’t be satisfied with such a passive method!”</p><br/><p>[Hiik?]</p><br/><p>Liera didn’t even know why she was being scolded. However, to Yu IlHan who had entered work mode, there was not a single shred of mercy in him.</p><br/><p>He imbued mana into a piece of a feather, and the feather that received the mana immediately shot out an energy wave with a diameter of 10 millimeters and put a hole through the wall.</p><br/><p>The process of amplifying, gathering, and shooting the mana was so natural and quick that it made people unsure about what actually happened.</p><br/><p>Looking at the scene where Yu IlHan’s non-attributed mana was colored in black, and generating poison and curse attributes before shooting out in a straight line, Liera clapped.</p><br/><p>[It’s the first time I’ve see that since there is no way lower existences could kill higher ones. Well, it’s nothing strange that you’re surprised since higher existences are already beyond the realm of laws……]</p><br/><p>“I don’t care about other people! So, did you feel anything after looking at that?”</p><br/><p>[Uh, I dunno……?]</p><br/><p>Yu IlHan sighed. He could finally make a weapon that he had given up on until now as it would be useless against strong enemies, except, with these feathers. But Liera had such a lukewarm reaction!</p><br/><p>He spoke in a serious and stern voice.</p><br/><p>“It’s beams.”</p><br/><p>[B, beams?]</p><br/><p>“Beams.”</p><br/><p>Yu IlHan’s eyes were full of stars. Liera thought that if expectations had any weight, the current Yu IlHan may be able to make the Earth collapse in itself.</p><br/><p>“Condensing mana into a more destructive energy to shoot. It’s the perfect beam weapon!”</p><br/><p>[Well, yeah. Fallen angels do fight a lot that way…..]</p><br/><p>Since it was such a natural thing to higher existences, Liera didn’t seem to realize how amazing this was.</p><br/><p>However, beam weapons would overwhelm all of Yu IlHan’s other weapons that he had made from the Giant’s Rubber Band or the magic gunpowder, in terms of speed. And not only that, even its destructive power would be superior to them. Beams were closer to Yu IlHan’s dream ultimate weapon!</p><br/><p>“Higher existences are the best!”</p><br/><p>[I’m sorry but I don’t think I can cheer so openly when you say that……? You won’t pluck mine out, right, right?]</p><br/><p>Yu IlHan first put together tens of feathers and a few 4th class magic stones before grinding them into powder. Then, he made a huge mirror that could reflect his entire body with some room left over using dragon bones and other rare metals, before applying the powder over the surface of the mirror.</p><br/><p>On top of that, he used another 4th class magic stone to mana craft! Yu IlHan wished deeply and even more deeply while mana crafting.</p><br/><p>“BEEEEEEEEEEEEEEEAAAAAAAAAM!”</p><br/><p>[Your desires are leaking!]</p><br/><p>And the process was finished.</p><br/><p>The black mirror made of the feathers belonging to a fallen angel reflected sunlight and began glistening, when the information on the item that Yu IlHan had wanted so much, had finally appeared on his retina.</p><br/><p>[Miraculously apocalyptic and Unbelievably curseful Destruction mirror]</p><br/><p>[Rank – Epic]</p><br/><p>[Attack power – 7,500 (increases according to the magic the enemy possesses)]</p><br/><p>[Durability – 12,700/12,700]</p><br/><p>[Options –</p><br/><p>1. Indestructible, and power increases according to time.</p><br/><p>2. 30% increase in attack power and critical hit damage.</p><br/><p>3. Moves by sensing the enemy and automatically intercepts.</p><br/><p>4. Inflicts continuous damage by imbuing an undispellable curse to the exposed enemy.]</p><br/><p>[A miraculous weapon that a crafter of a lower existence had made using a portion of a higher existences body. It has the ability to move by sensing the enemies, as well as the ability to amplify the internal mana to shoot energy beams, and also possesses the ability to absorb enemy attacks to reflect them back at higher power. However, it needs to absorb the natural mana once it is drained of its charged mana. Just this could be a weapon considered to be beyond the realm of the original concepts, but there is a function that is not activated yet.]</p><br/><p>[That’s so OP!]</p><br/><p>“Yes, it’s OP.”</p><br/><p>Yu IlHan also acknowledged that. However, this was not the end. As the Akashic Record had explained, this was only a portion of an entire offense system.</p><br/><p>“But it will become even more so.”</p><br/><p>Looking at the destruction mirror that followed him in the air as if it had recognized its master, Yu IlHan’s eyes now contained an entire galaxy of stars.</p><br/><p>Liera thought while looking at him.</p><br/><p>The feathers, how many were there again?</p><br/><p>Author’s notes</p><br/><p>Beams is one of a man’s dreams</p><br/><p>Translator’s notes</p><br/><p>(To early readers) Don’t bother looking for typos anymore. Koukouseidesu is back</p><br/><p>1. This line perfectly describes me, lol</p><br/>\n</div>"}