{"title": "Chapter 193: I Create – 2", "id": 193, "volume": 2, "url": "http://boxnovel.org/everyone-else-is-a-returnee-chapter-193-i-create-%E2%80%93-2", "volume_title": "Volume 2", "body": "<h1>Chapter 193: I Create – 2</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>When Yumir came to himself, he was in a world he had never experienced before.</p><br/><p>“Huh?”</p><br/><p>He tilted his head and looked at the surroundings. The skies were all red, and the lands glistened in bloody light. It was strange, this new environment that he did not want to get used to. Just being here made him unpleasant, but he still felt an odd sense of safety.</p><br/><p>“Grandma? Noona?”</p><br/><p>Looking for the ones he was with until just a moment ago, he spread out his mana, but it was in vain. Nowhere in this wide world could he sense their mana.</p><br/><p>They definitely destroyed a magic formation together, came back to Earth, and just as they were about to go back to the mansion, he seemed to get dizzy before an unbearable pressure seem to assault him and blew his consciousness away.</p><br/><p>And waking up, he found himself here. He did not know what was happening.</p><br/><p>“Dad…….”</p><br/><p>Yumir looked for his dad first in this unknown situation. That wasn’t in vain as he could feel traces of Yu IlHan in various parts of this world. Of course, those were just traces, and the person himself couldn’t be felt, but right now, that was enough.</p><br/><p>“So dad came here before.”</p><br/><p>Having reached a conclusion, Yumir felt calmer than before. Just with the fact that Yu IlHan had been to this place before, he could sense the connection between him and Yu IlHan.</p><br/><p>Holding himself from crying on the spot, Yumir pondered. If it was his dad, what would he have done in this situation?</p><br/><p>“I know, kill everything in sight!”</p><br/><p>That was all he saw of Ilhan as he grew up, as well as the only viable conclusion he could reach! In fact, Yu IlHan was doing the exact same thing on Earth right now, so Yumir had completely seen through him.</p><br/><p>Yumir first grilled the dragon meat in the magic bag that Kang MiRae gave him and ate them. And he became level 192. Really, he was not that far off from evolving into a true dragon.</p><br/><p>“…….Good.”</p><br/><p>Since he was full, Yumir tensed himself and spread out his senses again. This time, he wasn’t trying to find other people, but trying to find the weakest enemies for him to kill.</p><br/><p>However, the results were insane. He could only feel auras of strong beings that he had never felt before on Earth or any other worlds!</p><br/><p>“Wow, so strong. Level 250, 253, 261, 274, 280 ……. Hmmmm.”</p><br/><p>At his current level, level 250 was somewhat doable but anything above that, he thought it was impossible. Perhaps things might change if he became a true dragon after the 4th class…… but since the world he came to were full of these freaks, Yumir was only confused.</p><br/><p>“…….Okay.”</p><br/><p>However, his disappointment did not last long. Many strong enemies meant levelling up faster through defeating them! His dad would be happier if he came back stronger, and he would also be able to fight against stronger enemies.</p><br/><p>His instinct told him to dig a hole and hide as there were only stronger monsters than him here, but as he had grown after fighting monsters non-stop for a few years, Yumir knew very well that such embarrassment disappeared only after enduring through it.</p><br/><p>“Then let’s go with this guy fir…..st?”</p><br/><p>Just as he was about to start defeating them with the lowest levelled one first, he found a new presence he couldn’t sense before.</p><br/><p>“…….Huh?”</p><br/><p>The presence of monsters he had found until now all belonged to freaks with a minimum level of 250, but the one he sensed now was of level 1, or at most level 2. And they were bunched up in one spot.</p><br/><p>Humans. Yumir instinctively felt it. Weak, and young humans.</p><br/><p>How? He didn’t know, but he couldn’t let this be. A frightening monster had sensed them and was fast approaching. However, it was fortunate that there was only one.</p><br/><p>“Hhp!”</p><br/><p>After realizing that, Yumir kicked off the ground. His chantless wind magic made his body lighter than ever.</p><br/><p>At that time, he could hear a voice through the wind from not far away.</p><br/><p>“Hik, Hiccup.”</p><br/><p>“I’m scared. I’m scared.”</p><br/><p>“Mommy, daddy……!”</p><br/><p>It was the basics to hide one’s presence once one was placed in somewhere unknown, but those foolish human children were crying their hearts out as if someone will come help them if they did. And as expected, the monster raised its speed after settling on the target.</p><br/><p>“*Sigh*.”</p><br/><p>Yumir clicked his tongue like how his dad always did when seeing such people, and thought that this situation could be used to his advantage.</p><br/><p>Now, Yumir’s concealment had also reached the master stage. Although he wasn’t confident that it would work against such high level monstered, if there were beings that could distract its attention from him, his chances of failure would decrease.</p><br/><p>‘The strongest strike. And another strike hidden in that strike. I’ll be able to kill it if I do that.’</p><br/><p>Thinking like that, Yumir took out a magic stuffed cookie from the magic bag and crunched on it. Yu IlHan’s dragon cooking, magic stuffed cookies and other numerous types of cooking raised Yumirs cooking skill considerably as well, and perhaps thanks to that, his overall power increase with a single magic stuffed cookie was over 20%.</p><br/><p>‘Fuu, good. I can do this, it’s possible…..!’</p><br/><p>Strong power gathered on his fist. The aura of wind enhanced through the 3 class advancements, as well as the physical combat he had inherited from Yu IlHan and trained in, as well as Superhuman strength he had also inherited, was all the power he could use at once right now.</p><br/><p>Yumir could find the humans soon. As he had predicted from the beginning, young human children had gathered up in one spot.</p><br/><p>Babies that didn’t even look 3 or 4 years old. In fact, they weren’t that much different in age to Yumir, but their power level difference was rather deplorable.</p><br/><p>“I’m scared!”</p><br/><p>“Mommy, where are you!”</p><br/><p>[Kuaooooooooooooh!]</p><br/><p>Instead of the mommies they were looking for a monster replied to them. It was a horrifying one with a height of over 20m tall, and one that spat out flames from all over its body.</p><br/><p>Yumir could not understand its body structure despite looking at it, but was also assured that it was not an enemy he could not win against. A full frontal fight was still impossible, but if he could take the advantage with a surprise attack, it was doable.</p><br/><p>Yumir’s innate attribute was wind. It was a sharper sword than anything, and at the same time, a sturdier shield than anything. He enveloped his body in wind in order to not get injured by the flames, and gathered all his destructive power into his fist.</p><br/><p>‘Sharper, sharper, sharper.’</p><br/><p>As if hypnotizing himself, Yumir muttered like that and leaped with all his power.</p><br/><p>Although he couldn’t leap several kilometers in one go like Yu IlHan, the aura of wind below his feet acted as a booster, so his speed was not inferior to Yu IlHan’s instantaneous speed. The results of his training to move as quickly as his dad had finally borne fruit.</p><br/><p>[Kioaaaaaahk!]</p><br/><p>“*Uwaaaaaaan*!”</p><br/><p>“Monster, monster scary! *Uwaaaan*!”</p><br/><p>The children cried, and the monster found them and was about to assault them in a joyous mood.</p><br/><p>But at that moment, Yumir’s frontal fist pierced through all the flames that guarded its body and hit the center of the head!</p><br/><p>[Critical Hit!]</p><br/><p>[Kuoooooh!]</p><br/><p>The monster screamed. However, Yumir accepted that as not a threat but a new opening and moved his body once again. While his momentum still existed, he kicked the head of the monster just like that!</p><br/><p>[Critical Hit!]</p><br/><p>Yumir’s kick covered in advanced wind magic had a very good affinity against the flames on its body. Even the flames made to protect the freak’s body was made his, as he proceeded forward. The perfect surprise attack made it lose all its flaming armor and allowed a near-fatal strike to its neck!</p><br/><p>Of course, that was only possible because Yumir had a fantastic control over his wind magic. Yumir’s ability in controlling wind to soften anything each time he faced an external shock, was already beyond that of a simple 3rd class.</p><br/><p>[Kuoooooh!]</p><br/><p>“Hmph!”</p><br/><p>The monster that allowed 2 critical strikes to Yumir without even fighting back, roared and turned around. Although it wanted to eat those annoying crying kids, it was in too much pain to ignore Yumir!</p><br/><p>“That’s not enough!”</p><br/><p>However, its flames could not harm Yumir at all. Yumir, born from the flames Yu IlHan had put his heart into, innately had a strong resistance against fire, and that resistance, paired with the advanced wind magic, went beyond just enduring the flames, and used the flames against it.</p><br/><p>“Wow, that!”</p><br/><p>“It’s the hero!” 1</p><br/><p>“Hero!”</p><br/><p>The children who could express their words a little forgot about crying and shouted with glistening eyes. Yumir thought that idiots were really not to his liking, and applied more mana to his body. 2</p><br/><p>[Kihaaaah!]</p><br/><p>“Give me experience!”</p><br/><p>The freak with critical wounds on its head and neck went against the completely intact Yumir.</p><br/><p>These demons relied more on their attributes than their physical abilities, so Yumir, who had the ability to nullify its flames, could fight it head on without much difficulties. The children couldn’t even think about running away from this battlefield and watched the battle, entranced.</p><br/><p>“Eeeek! Iiiiii!”</p><br/><p>[Khuaooooooooh!]</p><br/><p>An unknown amount of time had passed since the cries of an infant dragon and the screams of a flame demon started intermixing. At one moment, Yumir’s fist finally smashed against the giant head of the monster.</p><br/><p>[Kihk, Kihi……]</p><br/><p>The monster couldn’t even shout one final word and collapsed on the ground. At that moment some unknown text appeared on the tired Yumir’s retina.</p><br/><p>[You have earned 37??91?782?4 experience.]</p><br/><p>[You have earned the record of Lv 25? In??r??????.] 3</p><br/><p>“Fuu.”</p><br/><p>Yumir sighed and landed on the ground as if he was collapsing. The battle was harder than he had expected. It was easy to inflict damage as the monster had a lower health compared to its level, but that was compensated by the strong mana it had possessed, so every single one of its attacks were dangerous.</p><br/><p>“Uu, so difficult.”</p><br/><p>And painful. As Yumir was no God, he could not control all the wind perfectly at every moment, so he was burnt here and there, and where he was nicked by the monster’s fist, his bones could almost be seen.</p><br/><p>Although he was recovering fast with Dragonblood regeneration, unique to dragonkin, it looked like it would take a little time for him to make a complete recovery. Of course, this was a cheap price for winning against an enemy 60 levels higher than him.</p><br/><p>“The hero won!”</p><br/><p>“Hero!” “Hero!”</p><br/><p>The children gathered around Yumir. However, Yumir ignored that and looked at the monster he had just killed. Seeing him silent, the children also stopped in their tracks.</p><br/><p>“Hero……?”</p><br/><p>And then, Yumir started taking action. He ripped out some flesh from the monster he had just killed, and took a bite.</p><br/><p>“Kyaaaaak!”</p><br/><p>“Kyaak! Kyaaaak”</p><br/><p>“Hero is eating monster! Dirty!”</p><br/><p>Yumir, who possessed Extreme poison resistance and higher curse resistance, ate away the monster even while bearing the pain. Looking at that, the young children were taking steps back, but a growl could be heard.</p><br/><p>“I’m hungry.”</p><br/><p>“I’m hungry too.”</p><br/><p>“Uuuuu.”</p><br/><p>Yumir stopped eating and looked at them. He hesitated a little before grilling a considerably less poisonous part and asked.</p><br/><p>“Wanna eat? But you need to listen to me if you eat.”</p><br/><p>The children, who were too hungry to refuse, gave into the devil’s temptation and accepted the meat. The interesting fact was that they did not die even after eating the poisonous meat that contained a curse.</p><br/><p>It was unknown whether this was due to some weird transformation in their constitutions upon coming to this hell, or something else, but Yumir couldn’t think of that. He only thought that the other kids were able to eat them because he could do so.</p><br/><p>Looking at the children eating away on the monster’s meat, Yumir smiled.</p><br/><p>Now that they ate, they could not refuse him. No matter how young they were, or whether they were babies who couldn’t even walk, it did not matter.</p><br/><p>They were all Yumir’s subordinates now. Although he didn’t know where he could use them, but making useless things useful was his dad’s field of expertise. He believed that he could do it too as the next in line of the Yu family.</p><br/><p>Dragon’s Hell Army was born here.</p><br/><p>Author’s notes</p><br/><p>Here’s an episode from Yumir. Next chapter will be back to Yu IlHan.</p><br/><p>Earth’s Great Cataclysm was not ordinary. It seemed like Newtypes (Children born after the Great Cataclysm) were newtypes after all.</p><br/><p>Translator’s notes</p><br/><p>Announcement: Sponsors are temporarily disabled (You can’t donate) until the end of my semester (21st of June)</p><br/><p>There’s 411USD in the queue (wow), and I’ll try to do them by Tuesday since it’s a National Holiday in Korea that day.</p><br/><p>1. Think ‘Yuusha-sama’</p><br/><p>2. Technically ‘idiot’ means acting like a 3 year old. And the oldest of them should still be about 3 years old.</p><br/><p>3. From the raws, it looks like it’s ‘Inferno’ something.</p><br/>\n</div>"}