{"title": "Chapter 229: I Go With You – 5", "id": 229, "volume": 3, "url": "http://boxnovel.org/everyone-else-is-a-returnee-chapter-229-i-go-with-you-%E2%80%93-5", "volume_title": "Volume 3", "body": "<h1>Chapter 229: I Go With You – 5</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>“Whoa.”</p><br/><p>“Wow, the scenery changed in an instant. Captain, what magic did you use this time?”</p><br/><p>“You won’t know even if I explain it to you.”</p><br/><p>The Warp skill and the magic formation of the elves were quite similar in the aspect that they required magic stones to activate, but the preparations and activation process itself was very different. If Warp had a lot to consider, the magic formation would activate instantly once the magic stones were ready!</p><br/><p>Right now, they had moved several thousand kilometers from the unknown battlefield, in a blink of an eye. Of course, since Phiria had just died here not too long ago, there should be a crucial battle going on!</p><br/><p>“And this place…..”</p><br/><p>“Sh.”</p><br/><p>When Kang HaJin was about to speak, Liera, who felt something, quietened everyone. However, Yu IlHan shook his head.</p><br/><p>“No, you won’t cancel the concealment even if you host America’s got talent or whatever other programme you might want to, so it’s fine.”</p><br/><p>“That’s quite good.”</p><br/><p>Originally, the Flying fortress was treated as Yu IlHan’s equipment, and could receive the effects of his concealment. Also, his allies within the Flying fortress would also receive the benefits of concealment thanks to the Flying fortress.</p><br/><p>“I can feel not one, but several presences of higher existences at once.”</p><br/><p>“We can’t see them though……”</p><br/><p>“They have basic concealment abilities, or are using magic. Also, I can see them as well.”</p><br/><p>No one in this world could not escape Yu IlHan, the concealment master. Right now, Yu IlHan had found 3 beings that had similar mana patterns to the Destruction Demon Army, and two who he couldn’t read.</p><br/><p>They were fighting while moving rapidly in mid air, and despite the fact that the Destruction Demon Army had the numerical advantage, there was a very intense battle.</p><br/><p>“There are no angels…… so they are from the Garden of Sunset, I suppose.”</p><br/><p>“You’re right. The angels make up the Heaven’s Army, and the fallen angels make up the Army of Brilliant Light, while Destruction Demon Army accepts both man and monsters, and the one that belongs to none of them is the Garden of Sunset.”</p><br/><p>“So they are the weakest faction huh.”</p><br/><p>“But they aren’t to be looked down upon. In a 1 vs 1 battle, they are the most threatening…… The records they are given, in other words, their leader, is special in some way.”</p><br/><p>That was definitely the case with this scene where two were on equal footing with three. However, to Yu IlHan, they were pretty much on the same level, so he did not care. The important matter here was Phiria, and Phiria alone.</p><br/><p>The problem was that he could not see the body of Phiria no matter how much he searched over the ground. Perhaps her body was erased by the enemy. If it was not that, he could take her body and run, but right now, not to mention Phiria, he could not feel the presences of any lower existences at all.</p><br/><p>In the first place, the landscape was battered with the five higher existences clashing. He didn’t even know why Phiria had come to this place at all.</p><br/><p>“I guess I can’t help it.”</p><br/><p>Yu IlHan once again scanned the battlefield before taking out his spear. Liera asked.</p><br/><p>“What are you going to do?”</p><br/><p>“I need to earn some records.”</p><br/><p>“From what?</p><br/><p>“From that guy.”</p><br/><p>Right now, there were only five beings that did not belong to his allies, so it was obvious who Yu IlHan was pointing towards. It was one of the Destruction Demon Army monsters that was in a better state!</p><br/><p>“There’s a guy that’s half-dead, so I won’t be able to earn any experience even if I kill that guy.”</p><br/><p>“Yes, my IlHan is very smart.”</p><br/><p>Killing a higher existence just to earn some info, huh. While everyone else other than Liera was shocked at Yu IlHan’s insane actions, he raised his spear in a posture to throw it while ordering Mystic.</p><br/><p>“Maximum output. One-point shooting.”</p><br/><p>[I’m already preparing.]</p><br/><p>“Miss YuNa. Can you strengthen the Flying fortress as well?”</p><br/><p>“I could if this place was a holy region.”</p><br/><p>“Then I guess I can’t help it. Then please buff me, and Mystic, you shoot whenever you’re ready.”</p><br/><p>“Lady Leytna, it’s time to work~!”</p><br/><p>[Yes, right now!]</p><br/><p>[Attack power increases by 33% for 30 minutes due to a blessing.]</p><br/><p>After Na YuNa’s buff was cast on Yu IlHan, a beam of white light shot straight from the center of the Hundred Eyes that had gathered in mid air. Of course, since this was an attack in concealment, the Destruction Demon Army had received the hit without recognizing the attack.</p><br/><p>[Kugh!? Kahak!?]</p><br/><p>And the thrown spear that followed immediately pierced its body while the fire contained in the attack exploded to incinerate the whole body. Enemies that still could not be killed with Yu IlHan’s surprise attack on top of the maximum output from the Flying fortress, would have to be 6th class and above.</p><br/><p>[You have earned experience.]</p><br/><p>[You have become level 274. 1 Strength, 2 Agility, 1 Health, 1 Magic increases.]</p><br/><p>[You have earned the record of Lv306 Berein.]</p><br/><p>Yu IlHan collected his spear and the corpse. Meanwhile, the members belonging to the Destruction Demon Army and the Garden of Sunset respectively, all turned their heads and found the Flying fortress.</p><br/><p>[To think you’d interfere in a duel, you cowar……. what’s that!?]</p><br/><p>[This aura……. is a lower existence? How can he deal with a higher ex….!?]</p><br/><p>All were shocked after seeing the Flying fortress. They were first shocked at the scale of the castle, and then at the fact that such a large thing could appear so suddenly. Lastly, they were surprised at the fact that they could not call anyone inside it a higher existence.</p><br/><p>[Who are you!]</p><br/><p>“Well, then. First.”</p><br/><p>He did not care about what they said and activated his Record skill to collect the information on the enemy he had just killed.</p><br/><p>[The skill, Record, has become level 4.]</p><br/><p>His expression creased as he sorted out the records he had just earned. He looked through the stuff that occurred not too long ago to find traces of Phiria. And fortunately, he had some success. While this guy was not the culprit behind Phiria’s death, it knew the culprit.</p><br/><p>[I’ll kill you!]</p><br/><p>[You shall not harm them!]</p><br/><p>The strongest of the Destruction Demon Army threw the rotting sword it had. The sword that pierced through the air while containing an enormous quantity of energy, only ended up going back to its owner after being shot down by an energy beam from a member of the Garden of Sunset.</p><br/><p>There should be a reason why that guy shot down the attack instead of him. And as expected, it looked like the Garden of Sunset judged that Yu IlHan was not their enemy after seeing him kill a member of the Destruction Demon Army.</p><br/><p>[I do not care who you are! Help us to erase those evil offsprings!]</p><br/><p>[The Destruction Demon Army is trying to make a paradise-on-land for monsters after obliterating even the residents of this world. You look human, and the fact that you ambushed them is probably because you knew that, right?]</p><br/><p>The two higher existences belonging to the Garden of Sunset, approached the Flying fortress while deflecting the attacks that aimed for the Flying fortress while at it. Yu IlHan was creasing his expression until then as well, and only whispered to Liera after he could confirm their faces.</p><br/><p>“Liera, you take the left.”</p><br/><p>“Got it. Mine is the left one. Hey, Na YuNa. Buff me as well.”</p><br/><p>“Yes of course, unni.”</p><br/><p>“……That sounded unpleasant for some reason.”</p><br/><p>“Oh, then do you want me to call you grandma?”</p><br/><p>“Call me unni.”</p><br/><p>While Liera was receiving the buff from Na YuNa. Yu IlHan kicked off the Flying fortress to stop in front of the members of the Garden of Sunset.</p><br/><p>“You guys are from the Garden of Sunset, right?”</p><br/><p>[So you know of us after all. We knew that you were not ordinary after seeing you kill a higher existence and….. Kugh!?]</p><br/><p>[Critical Hit!]</p><br/><p>[Critical Hit!]</p><br/><p>[Critical Hit!]</p><br/><p>[Critical…….]</p><br/><p>After they approached a little more, as they saw that Yu IlHan had a friendly attitude, the Eight-tailed dragon spear that Yu IlHan had struck out pierced the abdomen of the one on the right.</p><br/><p>[Kugh! Why…….!]</p><br/><p>Even though he had only attacked once, there were ten holes on the body. That was enough to put the guy near death!</p><br/><p>“You killed our Phiria, bitch.”</p><br/><p>[Kugh, Cough!?]</p><br/><p>[Eeek!]</p><br/><p>“Hhp.”</p><br/><p>To save the ally that was instantly put to near death, the other member tried to move, when Liera, who followed after Yu IlHan, after being buffed by Na YuNa, severed his two arms.</p><br/><p>[How, there’s two……!]</p><br/><p>“Quite the, thick, face, after, all, that, bullshit.”</p><br/><p>Yu IlHan imbued his mana into the spear tip to make an essence flame of Blaze, then which he pierced and slashed his enemy like mad. The blood, flesh, bones, muscles, and brain fluids of the enemy, as well as the crystallized mana scattered to the surroundings.</p><br/><p>[Kugh, Kugggh, Kyahk, Khaak!]</p><br/><p>Each strike of his spear activated the Record skill to cram the tragic scene that it had pulled out until now. Amongst them, was the face of Phiria.</p><br/><p>Going before that, he knew that this guy approached the elves as if he was their ally. They had a prior record of helping to protect the elves by cooperating with the dragons once before, and in reality, there was no reason for the elves to not believe them.</p><br/><p>The Garden of Sunset utilized that. Even though, in the first place, whether it was the Destruction Demon Army or the Garden of Sunset, they were the same type of guys that were only thinking of wiping out the lower existence to acquire this world!</p><br/><p>The reason Phiria died first was surprisingly due to her equipment. The legend-ranked equipment that Yu IlHan made for her. These guys were after that.</p><br/><p>Only after finding out the reason behind Phiria’s death, did Yu IlHan finally realized that when Liera said his equipment wasn’t easily found even in the treasury of Heaven’s Army, that she meant what she said.</p><br/><p>Amongst that, the equipment Yu IlHan had made for his subordinates had especially good specs. If he was too late, then not only Phiria, but the lives of Paté, Mirey, as well as Jirl would have been put in danger. No, perhaps they were in a dangerous situation now. Paté even had an epic-ranked weapon.</p><br/><p>[Kugh! Khiiik!]</p><br/><p>The enemy pierced by the Eight-tailed dragon spear struggled to escape and shot bullets of mana from the two arms and legs to injure Yu IlHan, but mana bullets after the majority of the mana had already leaked out would not even damage the Infernal dragon body, not to mention hurting Yu IlHan.</p><br/><p>His incomplete armor was already one of the best armors across all worlds.</p><br/><p>“Although I want to make you suffer for 3 more hours.”</p><br/><p>[No, spar……]</p><br/><p>[You have earned experience.]</p><br/><p>[You have earned the record of Lv 317 Piltah.]</p><br/><p>Yu IlHan finished him off by using the power of a blunt weapon and a sword into his spear. Looking to his side, Liera had also finished the enemy with several shockwave chains. Despite the fact that not even 5 minutes had passed since they arrived at this place, three 5th class higher existences had died.</p><br/><p>“What the hell is that.”</p><br/><p>Kang HaJin absent mindedly muttered.</p><br/><p>“Not to mention ‘able’ to go against higher existences, he’s completely overwhelming them!”</p><br/><p>“Ooh, so cool, Mr. IlHHan.”</p><br/><p>“And that’s your impression after all that!?”</p><br/><p>Yu IlHan did not stop with that. The two survivors of the Destruction Demon Army that tried to run away after estimating that he would cooperate with the Garden of Sunset, had forgotten about fleeing and turned stiff after seeing two higher existences die instantly like that.</p><br/><p>[Just, what is your objective!?]</p><br/><p>One of them shouted.</p><br/><p>[You shocking lower existences. What exactly is that power that you possess, and where did your arrogance of facing against both the Destruction Demon Army and the Garden of Sunset, come from!]</p><br/><p>“Not your problem.”</p><br/><p>Yu IlHan collected the remains of the ones that died and shook his spear to shake off the blood. Then, he charged against the remaining two at his full speed, and bared his fangs at them while activating Falling Down to prevent them from running away.</p><br/><p>“You guys are so dead.”</p><br/><p>Brilliant white flames burned in the entirety of the Falling Down domain. By the power of Yu IlHan’s fire attribute attack power increase, it became endlessly hotter.</p><br/><p>Such was the start of the festival of fire that would cover the entirety of Dareu.</p><br/><p>Author’s notes</p><br/><p>Hm, I had to fix the ending line several times because I didn’t like it. And in fact, I still don’t like it, dammit….</p><br/><p>Translator’s notes</p><br/>\n</div>"}