{"title": "Chapter 223: I’m Coming To Get You Now – 7", "id": 223, "volume": 3, "url": "http://boxnovel.org/everyone-else-is-a-returnee-chapter-223-i%E2%80%99m-coming-to-get-you-now-%E2%80%93-7", "volume_title": "Volume 3", "body": "<h1>Chapter 223: I’m Coming To Get You Now – 7</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>“Haaaaaap!”</p><br/><p>When Yu IlHan swung his hammer, everything in its path was erased. It was a too big of a trajectory to be made by a single human. What was more was that the white flames within the attack had spread out and attacked enemies by itself!</p><br/><p>“A higher existence?”</p><br/><p>“Is that also an angel? But how can an angel fight us!”</p><br/><p>“Cheating, that’s cheating!”</p><br/><p>The people who couldn’t even recognize if he was a lower existence or a higher one, just jumped around while seeing the results.</p><br/><p>“Higher existence? You guys, you haven’t even fought against a higher existence yet……Hhp!”</p><br/><p>“Khaaak!”</p><br/><p>[Kyak! Kuhk!]</p><br/><p>However, nothing would change with those cowards blabbing on their mouths without actually moving. Regardless of what they were thinking, or saying, Yu IlHan only erased the enemies with his hammer.</p><br/><p>“Khaaaahk!”</p><br/><p>“W, we can’t win…….!”</p><br/><p>Every time Yu IlHan swung around the hammer lightly as if playing around, the imperial army was being ‘wiped’ away like the bath detergent adverts on TV! Eventually, the white flames covered the majority of the battlefield, and was burning just the imperial soldiers.</p><br/><p>“He’s the envoy of the goddess.”</p><br/><p>“That beauty, that strength…… He’s definitely the goddess’s envoy!”</p><br/><p>“But I think I saw him once before……”</p><br/><p>“There’s no way that’s true! He’s the envoy of the goddess!”</p><br/><p>No one thought that Yu IlHan, who was wiping out the imperial army with the appearance of the Flying fortress, was the same person as the construction worker that built their temple before. They only thanked the miracle that occurred in front of their eyes, and raised their spears and swords.</p><br/><p>“The goddess is with us! Enact justice to those pigs!”</p><br/><p>“Uooooooh!”</p><br/><p>With the Flying fortress and Yu IlHan’s actions, the flag of victory had already come over to Elfroce. There was no turn for Dragon’s Army, much less Mir or Liera.</p><br/><p>“Hhp!”</p><br/><p>[Here, and there! Don’t run and just die!]</p><br/><p>Yu IlHan destroyed the formation of the imperial soldiers, and blew away everyone that he saw. Mystic used the long-range weapons from the Flying fortress to kill the fleeing imperial soldiers. No one could do anything to them, nor could anyone run away with their lives.</p><br/><p>If anything was possible for the imperial army, it was to shiver in fear while wishing that their deaths would be delayed as far as possible. What was there to fear about an enemy that lost their will to fight? The Elforce army just needed to take the credit.</p><br/><p>“HaJin, do you perhaps know those people?”</p><br/><p>“I thought I did, but it looks like I don’t.”</p><br/><p>“What do you mean?”</p><br/><p>“No, it’s just nonsense.”</p><br/><p>Kang HaJin’s voice of reply to the pope sounded very powerless.</p><br/><p>He had just resolved himself to die for Na YuNa, but that resolved had crumbled to bits. Of course, with both of them still surviving, there was no better outcome than this, but what was this sense of powerlessness over his body?</p><br/><p>Moreover, that castle! That beam! He would be happy if the reinforcements were within his expectations! How was he supposed to react if something that transcended every kind of reason like that, appeared so suddenly!</p><br/><p>“Ah, ahhhh. Yes, that’s it. Don’t lose.”</p><br/><p>However, seeing Na YuNa who was cheering for Yu IlHan with her two eyes following wherever he was, his thoughts disappeared as well. Just how much did she like him to be like that? It even made Kang HaJin’s heart warm.</p><br/><p>He explained shortly to the pope that was still full of questions.</p><br/><p>“That man, is the man who YuNa loves. He should have come after receiving her call……. Though, I don’t know how he did it.”</p><br/><p>“Oh, I thought that YuNa somehow became really docile……. girlie, she was in love with some amazing man.”</p><br/><p>Kang HaJin could only agree with the pope. Well, he was amazing alright! The last time he saw him, he wasn’t this amazing though!</p><br/><p>The war ended in a mere 30 minutes after his appearance. 190 thousand out of the original 200 thousand were killed, while the remaining 10 thousand was captured; with 100 thousand being killed by the Flying fortress, and 80 thousand killed by Yu IlHan.</p><br/><p>This was an overwhelming number, but Yu IlHan’s experience didn’t even go up by 3%. As his level was very high, killing enemies around level 100 wouldn’t give him any experience at all.</p><br/><p>“Fuuu.”</p><br/><p>“Mr. IlHan!”</p><br/><p>After judging that the war was over, he landed on the ground when Na YuNa immediately flew at him. Yu IlHan thought about whether to accept her or not for a moment, before dodging her, but Na YuNa had already changed directions with him as if she knew that he would do that!</p><br/><p>“Why did you avoid me!”</p><br/><p>“Well, because I have a reason to…..”</p><br/><p>Just as Yu IlHan was about to explain the reason while shaking Na YuNa off, he could not continue his words after seeing tears well up in Na YuNa’s eyes. Na YuNa spoke in a sobbing voice.</p><br/><p>“I really……. really wanted to see you.”</p><br/><p>“Uhm, even if you tell met hat……”</p><br/><p>“I really really wanted to see you. Why did you avoid me…”</p><br/><p>“……”</p><br/><p>When they were separated, she was as haughty as ever. Just what happened within these 3 years for her to become like this?</p><br/><p>Yu IlHan looked at Kang HaJin in a plea for help, but he only nodded in satisfaction. To him, who was already in oppa-mode, there was no way Yu IlHan’s feelings could be felt.</p><br/><p>[Was master always this popular? Such a pretty woman too.]</p><br/><p>[Opposites attract.]</p><br/><p>Mystic was surprised at Yu IlHan’s ‘abilities’ once again, and Orochi spat out sage-like words of wisdom. Well, neither of them helped him though. Yu IlHan first consoled Na YuNa even while sighing.</p><br/><p>“It looks like it was dangerous. It’s good that you called me after I became able to come over to this side.”</p><br/><p>“Yeah…”</p><br/><p>“But since everything is over, I wish you would get off me…..”</p><br/><p>“Fuuuu…….”</p><br/><p>Na YuNa no longer replied. Not long after he heard periodic breaths and looked down, and saw that Na YuNa fell asleep in his arms while standing up.</p><br/><p>“What the…..”</p><br/><p>“Fuuuu…….”</p><br/><p>After being tense for so long, fatigue had come upon her all at once after she became relieved, and fell asleep. Yu IlHan pitied her before he felt absurd about it. He stroked the sleeping Na YuNa’s head and asked Kang HaJin.</p><br/><p>“Just how long had she not slept for?”</p><br/><p>“About a week. She pushed herself a little.”</p><br/><p>Replied Kang HaJin. Even he had heavy eyelids, and it seemed like he had not slept for a week either. Not only that, the pope, and the other paladins hadn’t slept for a week either. They only endured using holy power until now.</p><br/><p>“This won’t do.”</p><br/><p>There was a lot he wanted to hear, and say. However, in this situation, no proper conversation would take place. Yu IlHan declared with a firm voice.</p><br/><p>“Everyone go to sleep. I’ll listen to your words afterwards.”</p><br/><p>“But the imperial army would…..”</p><br/><p>“Don’t worry if you mean that weak imperial army in that forest over there.”</p><br/><p>Liera, who jumped down from the Flying fortress, splendidly landed next to Yu IlHan and replied instead of him. Wearing the Battle dress made by Yu IlHan, and a spear reborn from the power of the god of love on one hand, she looked very brave and beautiful.</p><br/><p>“Ah, beautiful.”</p><br/><p>“Perhaps more than our own maiden…… ah, no.”</p><br/><p>“To think Lady Leytna made such a beauty again after the holy maiden. Ahh, a new teaching has dawned upon me.”</p><br/><p>The paladins that saw a beauty that was blessed by the god of love, and so had a different kind, but not inferior, kind of beauty, sparkled their eyes as expected of the believers of the goddess of beauty, but Liera only looked at the pope without giving them a glance.</p><br/><p>“I can take care of them by myself. You’re the bigshot around here, right? Make everyone go to sleep and you have some sleep too. Think about it after you wake up.”</p><br/><p>“…….If you say so.”</p><br/><p>Realizing that Liera’s words were true, the pope did not reject that. They quickly cleaned up the battlefield, tied up the captives, and made everyone sleep without a single night watch.</p><br/><p>“Then see you in a moment. Oh, please take care of our YuNa.”</p><br/><p>The pope that had returned to her old age, made a slight smile and headed to the dorms in the temple. At that time, Kang HaJin stayed next to Yu IlHan and the others without sleeping.</p><br/><p>“Mr. Kang HaJin looks very tired as well.”</p><br/><p>“I still have some words to say.”</p><br/><p>Kang HaJin looked around to see that there were no others before bowing towards Yu IlHan.</p><br/><p>“Thank you very much. We’ve given you so many hindrances until now but you still came to another world to save us…..”</p><br/><p>“……I think a similar thing happened before.”</p><br/><p>“Now that you mention it, that’s true.” (T/N: When they first met in the dungeon)</p><br/><p>Kang HaJin lifted his head and exchanged slight smiles with Yu IlHan. He saw that Na YuNa was still sleeping within Yu IlHan’s arms and made a thicker smile.</p><br/><p>“Please take care of YuNa. Personally, I want to make you take care of her future…..”</p><br/><p>“No, I already……..”</p><br/><p>When Yu IlHan found it awkward, Kang HaJin tilted his head. However, when Liera wordlessly leaned against Yu IlHan quietly and looked at Kang HaJin, he finally realized what was happening and his face turned stiff.</p><br/><p>“How can this be, no……. ugh. If that’s the case I can’t do anything…..”</p><br/><p>“Although I won’t be able to say it to her now since she’s in a weakened state both of her mind and body…..”</p><br/><p>“Hmph.”</p><br/><p>To think Yu IlHan had a lover. And she was a beauty that did not lose out to Na YuNa at all despite the fact it’s the first time he saw her!</p><br/><p>Kang HaJin became very awkward. It was not because Yu IlHan already had a lover.</p><br/><p>“YuNa, this girl, won’t give up so easily.”</p><br/><p>Wasn’t she the girl who would die to live her way? Thinking back to how she was stubborn until the very end, he naturally came up with that conclusion.</p><br/><p>Moreover, Yu IlHan wouldn’t be aware of this, but Yu IlHan was Na YuNa’s first love. Meaning, that it was unknown how she would act towards Yu IlHan in the future.</p><br/><p>Of course, as Yu IlHan didn’t know that Na YuNa had such a side, he lightly laughed over Kang HaJin’s worries.</p><br/><p>“I’m planning to say it when Miss YuNa calms down later. There should be lots of other men who are more attractive than me in the world. Miss YuNa will find her own new lover sooner or later.”</p><br/><p>“Hmph, I’ll only trample on her if she still tries to.”</p><br/><p>“Don’t kill her, okay……?”</p><br/><p>Even the mighty Liera could not throw Na YuNa off Yu IlHan’s arms right now. Yu IlHan found that fortunate and lifted her up for real. He was planning to let her sleep in a proper place and not in his arms.</p><br/><p>“You have some sleep too, Mr. Kang HaJin. We’ll do the night watch.”</p><br/><p>[You’re just pushing it all to me though!]</p><br/><p>“Sharp.”</p><br/><p>Kang HaJin wanted to ask about the Flying fortress, but thought about his current situation and just turned around after swallowing his question. Yu IlHan saw him off and first returned to the Flying fortress with Liera.</p><br/><p>“It’s a pretty noona!”</p><br/><p>“Captain, what are we doing here?”</p><br/><p>“Can I play on that again?”</p><br/><p>These kids were still full of energy even though they played on those for three days straight. Yu IlHan made a small laugh and nodded. They would become busy soon. Rest was best taken satisfactorily.</p><br/><p>“Hmmmmm.”</p><br/><p>Perhaps due to all the noise, Na YuNa mumbled in her sleep in Yu IlHan’s arms. Looking at her provoked his male instincts, Yu IlHan thought that she would have a very harsh life ahead of her even though this was nothing new.</p><br/><p>Just what kind of man would be able to let her live freely by herself in this world? Before the Great Cataclysm, she was relatively safe as her family had political power, but from now, she would have to endure with her power alone. The three years she spent here would also have been very arduous for her. It wasn’t surprising that she burst out crying when she saw him.</p><br/><p>“Y, you really like that woman? More than me? Because of that first kiss?”</p><br/><p>“How many times do I have to say no?”</p><br/><p>“……But it is true that that woman is more special than the others, right?”</p><br/><p>“The most special one to me is you.”</p><br/><p>Yu IlHan entered one of the guest rooms and let Na YuNa lay on the bed before covering her with blanket. He also smacked Liera on the forehead to calm her down when she was thinking about if she had to assassinate Na YuNa here and now.</p><br/><p>“Ouch.”</p><br/><p>“I’ll be off then so guard well with Mystic here.”</p><br/><p>“Go? Where?”</p><br/><p>Yu IlHan shrugged his shoulders at Liera’s question. As if asking if she didn’t know it already.</p><br/><p>“Isn’t the Li Catriana-whatever empire cooperating with the Destruction Demon Army? What do you think, then, is in the main camp of the empire?”</p><br/><p>“Fatsos?”</p><br/><p>“That’s true, but there’s something else as well.”</p><br/><p>“Monsters?”</p><br/><p>“Evolve them a little.”</p><br/><p>“…….Don’t tell me you’re going there to assassinate higher existences?”</p><br/><p>“…….”</p><br/><p>Yu IlHan didn’t deny that. Timing was crucial in life. Now that the higher existences still weren’t wary of him, it was a good time to kill them!</p><br/><p>“You, that’s……”</p><br/><p>Liera thought about how foolish that kind of thinking was, but when she actually thought about it, she found out that there was no way Yu IlHan would fail.</p><br/><p>“*Sigh*. Although this isn’t really possible, you have to run away if there’s a 6th class, okay?”</p><br/><p>“Of course.”</p><br/><p>“Dad, can I go as well?”</p><br/><p>Yumir, who was listening obediently the whole time, suddenly asked. Yu IlHan pondered for a moment, but that didn’t last long.</p><br/><p>“Yes, it’s also about time for Mir to experience it.”</p><br/><p>“Don’t speak like you’re teaching him to drink soju!”</p><br/><p>“Yay!”</p><br/><p>“And you don’t be happy either, Mir!”</p><br/><p>Yu IlHan and Yumir joyfully left the Flying fortress, disregarding Liera. Yumir changed into a dragon and started flying fast with his dad on top. With the mastered concealment of the two harmonizing and emphasizing each other, they became faint even while she saw them off.</p><br/><p>“*Sigh*. That worst tag-combo had finally formed…..”</p><br/><p>[Just how are they able to conceal themselves when I’m staring holes in them!?]</p><br/><p>While Liera sighed and Mystic was shocked, the father and son flew rapidly to their destination.</p><br/><p>At this point, there were a total of four Destruction demon soldiers in Breya.</p><br/>\n</div>"}