{"title": "Chapter 233: I Hear Your Voice – 1", "id": 233, "volume": 3, "url": "http://boxnovel.org/everyone-else-is-a-returnee-chapter-233-i-hear-your-voice-%E2%80%93-1", "volume_title": "Volume 3", "body": "<h1>Chapter 233: I Hear Your Voice – 1</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>When the elves and the wolfkin woke up from their sweet rest, the world hadn’t changed a single bit. No intense battles, no suspicious higher existences; nothing was able to invade their area. It was as if they were isolated from the world.</p><br/><p>“The flow of the air is……”</p><br/><p>“It’s the same with the surrounding scenery. Oh, but a lot of the trees are gone.”</p><br/><p>“Just what happened?”</p><br/><p>“If you woke up, then please come this way.”</p><br/><p>“Ah, Your Majesty!”</p><br/><p>Next to Yu IlHan was a mountain of paper, and in front of that, new sheets of paper was coming out from a black metallic machine continuously.</p><br/><p>Of course, what made up those pile of sheets were blueprints that were required to build the satellite. After realizing that he had to hand out one to each and every one of the elves and wolfkin, he ended up developing a pseudo-photocopier!</p><br/><p>“I’m going make a foothold to win this war. Cooperate.”</p><br/><p>“Foothold……?”</p><br/><p>“Just, what is……?”</p><br/><p>“You just need to put those into action. Well, then. Let’s start!”</p><br/><p>Their doubts did not last long. What was necessary was already explained on the blueprint, and the materials necessary for construction were already within Yu IlHan’s inventory!</p><br/><p>Of course, delicate control and mana crafting required Yu IlHan himself, so what they were doing was to build the basic foundation and confirm the area of the satellite, but that was enough from them.</p><br/><p>“Like this, the construction happens once again……”</p><br/><p>“Move if you have the time to speak! We are on a tight schedule if we consider your training as well!”</p><br/><p>“As expected of His Majesty! Unfaltering in his work!”</p><br/><p>“I said move!”</p><br/><p>The elves and wolfkin had fast adaptation speeds and they quickly got used to the large scale construction process of building an aerial fortress after flipping over the entire area. The enormous region was separated according to areas, and they split up suitably to construct in their own areas.</p><br/><p>“Area 1-A-13, construction complete!”</p><br/><p>“Area 2-C-27, support! We require support!”</p><br/><p>“We are lacking materials, what do we do?”</p><br/><p>“Mana cement incoming!”</p><br/><p>The forest that was the habitat for the elves for several hundred years. Right now, it was being tainted by the greed of humans. They wiped out any traces of nature in pursuit of civilization, and were inserting metal pipes and cements and whatnot into the ground to terraform the area!</p><br/><p>“So Mr. IlHan can make anyone a construction worker~.”</p><br/><p>Muttered Na YuNa while playing around with compressed holy power at the entrance of the mansion, watching the elves and wolfkin busy working. Ericia, who was carrying an enormous metal pillar, found her and spoke with narrowed eyes.</p><br/><p>“Don’t be so leisurely and work.”</p><br/><p>“I need to adapt to the holy region!”</p><br/><p>“Oh, you also have some work to do, Miss YuNa.”</p><br/><p>“Kek.”</p><br/><p>“Fufu, good for you.”</p><br/><p>The merciless Yu IlHan did not allow anyone to rest. His eyes were akin to that of the quartermaster trying to give any kind of work to the soldiers. Not that Yu IlHan had ever been to the military or anything!</p><br/><p>“Miss YuNa, please make some holy stones from now. I’ll give you all the magic stones you need.”</p><br/><p>“What are you going to do with them?”</p><br/><p>“Well, of course, I’ll make the satellite into a holy region. Although it would not be as good as the Flying fortress, I’m planning to give some buffs to the ones residing in it.”</p><br/><p>“Uhiiiik.”</p><br/><p>As Na YuNa’s exceptional ability allowed her to adapt to the artificial holy region very fast, if this area was extended, she really wasn’t confident in controlling all of it.</p><br/><p>However, just as she was about to say that she was not confident, Yu IlHan grabbed her hands with glistening eyes and spoke in a voice that tickled her heart.</p><br/><p>“Please, Miss YuNa.”</p><br/><p>“…….I, I guess I can’t help it if you want me to do it that much.”</p><br/><p>“IlHan, you…… are seriously evil.”</p><br/><p>“Nah, Miss YuNa told me to do it like this when I had something to ask of her.”</p><br/><p>“Ah, why did you say that!”</p><br/><p>“Oho.”</p><br/><p>Na YuNa had to be first beaten up by Liera before going to work. Yu IlHan thought that the two really got along well, before going back to his work. His ‘work’ being, making equipments for all elves and wolfkin.</p><br/><p>Other than a few elves and wolfkin under Yu IlHan’s rule, the rest were equipped with rare or inferior equipment. Even though it had been several years since Yu IlHan stopped making anything under unique rank!</p><br/><p>This was no good. They had to survive amidst higher existences, and if their equipment was not perfect, even the ones with potential will not blossom properly.</p><br/><p>‘I really wish I could make them all with 5th class materials……’</p><br/><p>No matter how much 5th class beings he had killed, it still amounted to less than one hundred, and he could not cover for them all. He might screw up while trying to be fair and give them all equal ones, so it would be better for him to focus on equipping the high-levelled core members, as well as the Flying fortress and the satellite.</p><br/><p>However, with that, he’d get leftover materials. Then, with that…</p><br/><p>“Good, I can only use alloying+plating combo.’</p><br/><p>Other than a few things that he left aside for a specific purpose, he ground five corpses belonging to higher existences, and produced a massive amount of alloy by combining it with the metals he had in his storage.</p><br/><p>Of course, that was still lacking in order to make 40,000 equipments. This was purely for plating. The main materials were of course, the corpses of perverted demons which were both good in quality and plenty in quantity!</p><br/><p>“Then.”</p><br/><p>The preparations were done. Yu IlHan awoke the Eternal Flame sleeping inside the Infernal dragon body before moving it to the furnace, and heaved a deep sigh after feeling the hot air inside the workshop.</p><br/><p>“Let’s start.”</p><br/><p>He started working on the mass production of over 40,000 equipment, including both weapons and armor.</p><br/><p>“Be careful not to let it go over!”</p><br/><p>“Pour it here. Sorry? Mix it with holy stones?”</p><br/><p>“Area 1-D-13, construction complete!”</p><br/><p>“Area 3-C-2, construction complete!”</p><br/><p>“It’s not complete! We still have additional work!”</p><br/><p>Construction was a very good prescription to the elves and wolfkin who were panicking due to the sudden change in their environments. They just needed to run forward without thinking about anything else. The most positive aspect about this was that this would help protecting them.</p><br/><p>“How long has it been?”</p><br/><p>“A month and a few days!”</p><br/><p>“Wow, a lot changed during that time.”</p><br/><p>Because the Flying fortress was just his mansion and the mansion ground floating in the air, the Flying fortress didn’t look like it was a fortress from the outside, aside from the fact that it was floating in the air. Different to that, the new satellite fortress that was designed with intense battle and defense in mind, felt a little crueler with all the plants gone and concrete that replaced it.</p><br/><p>It was the same with the tall sturdy walls of the fortress containing sharp spike traps, but there were all sorts of installation type weapons as well as battle camps where they could prepare for battle while switching around, which made the onlookers very nervous for some reason.</p><br/><p>As this was a fortress constructed for elves and wolfkin, the environment was optimized for their battle as well, and the one thing that Yu IlHan poured his mind into the most was the jumping pads installed in the fortress.</p><br/><p>The jumping pads helped one to instantly exit the satellite fortress and ambush against the enemy as long as they jumped with the right power and at the right angle, but it was of course made as an artifact, so it had the option to raise attack power and jumping power the moment one used it. If the tens of thousands of wolfkin all jumped into the jumping pads at once, not even bones would be left of the enemy.</p><br/><p>Other than that, there was a line of small ballistas for castle defense for the elves that had great sniping abilities; a poisonous swamp that the wolfkin could dowse their claws in before attacking (* does not work against allies.); as well as secondary and even tertiary walls that can be collapsed and rebuilt at any time!</p><br/><p>The problem was that the various elements of the satellite fortress and the satellite fortress itself was not made into artifacts yet, and could not be used in real battle just yet. The elves still could not believe that this fortress would be able to fly high like the Flying castle. They only thought that Yu IlHan had poured a lot of his mind into constructing a line of defense!</p><br/><p>And when 43 days passed after the barrier was put up, the moment finally arrived.</p><br/><p>“Area 1-A-3, construction complete!”</p><br/><p>“Huh? Then where do we have left?”</p><br/><p>“None!”</p><br/><p>“It’s over!”</p><br/><p>“Did we really do it!?”</p><br/><p>“Y, yay!”</p><br/><p>“I still don’t get what’s happening though!”</p><br/><p>“Woof! Wooooof!”</p><br/><p>“Awooooooooo!”</p><br/><p>The elves and the wolfkin became of one mind. The joy of liberation from labor, and the sense of achievement that they finished this massive construction work! Above all, the fact that they could properly carry out Yu IlHan’s orders made them happy.</p><br/><p>At that time, Yu IlHan also left his mansion. As he roughly knew what happened after hearing their cheers, Yu IlHan immediately jumped down from the Flying fortress and landed in the middle of the satellite fortress.</p><br/><p>“Ah, Your Majesty!”</p><br/><p>“Your Majesty!”</p><br/><p>“Stop there.”</p><br/><p>Where they cast with some magic that made them long for him if they didn’t see him for one day? Yu IlHan actually didn’t like showing up in front of them that much since they all called him Your Majesty and tried to rush into him. Would there be a day where they get used to his presence? He only wished that the day would come soon.</p><br/><p>“It’s perfect. You’ve worked hard, everyone. It’s above my expectations.”</p><br/><p>“It’s all thanks to your Majesty!”</p><br/><p>Really, he wanted to let them rest now, but it seemed that it would be better to finish it off here and now. He gathered all the elves and wolfkin into a clearing and called his subordinates out.</p><br/><p>“First, Ericia, Flemir, Paté, Jirl, Mirey.”</p><br/><p>“We’re ready.”</p><br/><p>“Yes.”</p><br/><p>“Yes, Your Majesty!”</p><br/><p>“Take these.”</p><br/><p>“Sorry……?”</p><br/><p>“Whoa.”</p><br/><p>He handed out weapons, armors and accessories to each of them. Only Paté with the epic-ranked bow did not receive a new weapon. The weapon and armor he gave out were all at epic rank. Each of them were given 5 accessories as well, and each of them were at least legend rank.</p><br/><p>“*Hiccup*.”</p><br/><p>“Just what……”</p><br/><p>“I promised you. that I’ll give you all epic ranked equipment and not only Paté if you do well. I’m only carrying out that promise.”</p><br/><p>“But how can we receive such…….”</p><br/><p>They hesitated in front of the enormous treasure in front of them. Yu IlHan made a bitter smile while looking at them.</p><br/><p>“Receive them when I give it to you. I’m not going to see any of my subordinates die again.”</p><br/><p>“…….Yes, sir.”</p><br/><p>“Understood.”</p><br/><p>His subordinates were secretly jealous of Paté all this time. The power behind his bow helped him survive any battle, and the power that could call the dead enemies into undead helped them win a battle they should originally not be able to win against.</p><br/><p>Moreover, as it was bestowed by Yu IlHan, they felt that Paté was receiving special treatment from Yu IlHan, and they were envious. But now, everyone could be equipped with epic ranked equipment!</p><br/><p>“There aren’t many that has special abilities like Paté’s. But the power should be sufficient.”</p><br/><p>“It’s more than enough!”</p><br/><p>“U, Uoooh. My mana……!”</p><br/><p>Epic ranked meant that their equipment didn’t lose out much to what Yu IlHan was using. Yu IlHan had used the remains of higher existences to bring their battle capabilities to the maximum.</p><br/><p>His objective was to make them hold off against one higher existence by cooperating with each other, while being backed up by Na YuNa in the holy region, and seeing them hurrying to adapt to their gear right now, it seemed possible after all.</p><br/><p>“It’s not the end. Next is your turn.”</p><br/><p>Declared Yu IlHan while looking at the elves and wolfkin that were exclaiming. The elves didn’t understand who he was referring to and Mirfa asked as their representative.</p><br/><p>“Do you mean you have made equipment for all of us?”</p><br/><p>“Yup.”</p><br/><p>Yu IlHan called out equipments enough to arm the one and a half thousand elves and the twenty thousand wolfkin. They were made with over half of the materials from the perverted demons he had stacked up until now, and were all at least of legend rank, boasting their glows that filled the area.</p><br/><p>“Woooooow.”</p><br/><p>“…….This idiot. He surpassed the armory of the Heaven’s Army within mere two months.”</p><br/><p>“Oh my god, all these weapons are all….!”</p><br/><p>Yu IlHan bestowed all of those equipment to the elves and wolfkin without so much as flinching an eyebrow, even though any of those equipment would call about a massive ripple to any world out there. Of course, he didn’t give it to them for free.</p><br/><p>“Take them. And now that you’re armed with those, your objective is to.”</p><br/><p>Ther lower existence that surpassed all history of artifacts of all worlds, declared his ambition.</p><br/><p>“Obliterate a higher existence with a thousand of you.”</p><br/><p>With the equipment set that Yu IlHan had poured his blood and sweat into, it may actually be possible for lower existences to beat higher existences. The proof of such a thing was steadily approaching.</p><br/><p>Author’s notes</p><br/><p>I had a sudden urge to buy a MacGyver knife, and ended up buying one. Even though I had no use for it since I’m not IlHan…… Oh, I’m using the bottle opener though!</p><br/><p>With Yu IlHan, even you can be a proficient construction worker.</p><br/>\n</div>"}