{"title": "Chapter 234: I Hear Your Voice – 2", "id": 234, "volume": 3, "url": "http://boxnovel.org/everyone-else-is-a-returnee-chapter-234-i-hear-your-voice-%E2%80%93-2", "volume_title": "Volume 3", "body": "<h1>Chapter 234: I Hear Your Voice – 2</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>The battle powers of the newly armed elves and wolfkin were doubled, or even tripled compared to before. Even if their levels or skills lacked in some parts, excellent weapons would fill that gap!</p><br/><p>Moreover, these fellows had all broke through level 150 at least thanks to their rapid growth amongst the rapidly changing environment of Dareu. It would be a spectacle if they all broke through to 4th class!</p><br/><p>“If they could acquire the experience from killing higher existences, that actually may just be possible.”</p><br/><p>Here was a guy that was thinking of shameless stuff in a war for a higher world. The problem being, that it was actually quite realistic.</p><br/><p>“Combining with the Dragon’s Army, it will be a frightening force.”</p><br/><p>“They are under Mir, but yeah, I guess.”</p><br/><p>A force under the loner Yu IlHan? If the him of 5 years ago had heard this, he would have burst into laughter. However, right now, it was quite real. Yu IlHan laughed seeing that they were struggling to adapt to their increased powers. Then, he thought of something.</p><br/><p>“The Rule skill is also just before mastery…… should I subordinate some of them?”</p><br/><p>“I’ve prepared a list.”</p><br/><p>As expected of Ericia who was ready, she carefully handed him a paper despite the fact that he only casually said that. From the fact that the names of elves and wolfkin were listed in the order of importance, it didn’t look like she prepared this in just one or two days.</p><br/><p>“Amazing.”</p><br/><p>“Thank you.”</p><br/><p>When he praised Ericia, some people whispered behind his back.</p><br/><p>“That wolf is suspicious too.”</p><br/><p>“She’s still fine since she’s bound to hierarchy, unni. …….Unless Mr. IlHan is moved or something.”</p><br/><p>“Quit your yapping over there.”</p><br/><p>Yu IlHan’s Rule skill was currently at level 98. Although it was normally impossible to level up the Rule skill so fast, Yu IlHan’s subordinates didn’t lack in rarity or growth speed so he had reached this level in such a short amount of time.</p><br/><p>Of course, the remaining two levels didn’t increase like hell, but if he took in some more elves and wolves and raise them, mastery would perhaps not be far away. This was another reason why Yu IlHan wanted to take in additional subordinates.</p><br/><p>“It is my honor for you to make me into your subordinate, Your Majesty! I’ll do my best in the future, for you! By your side!”</p><br/><p>“Uh, no, you don’t have to go that far.”</p><br/><p>“I’ll do my best.”</p><br/><p>Yu IlHan prioritized in accepting the elves who had high levels and had potential to grow further while possessing special abilities, as well as wolfkin who could change into human form thanks to the blessing of the moon, then he accepted new subordinates until his Rule skill did not allow any more.</p><br/><p>If one became his subordinate, then that one would be strengthened under the effect of the Rule skill, and not only that, they could become closer to Yu IlHan, so the elves that saw that Yu IlHan took in additional subordinates glistened their eyes in order to become the next one. Their loyalty was frightening in some places.</p><br/><p>“Fuu.”</p><br/><p>“I want to move my body.”</p><br/><p>“I want to prove myself to His Majesty.”</p><br/><p>The distribution of the new equipment and the receipt of the new subordinate finished in a flash. Originally, Yu IlHan was going to give them some time to rest, but it seemed that the elves and the wolfkin thought differently. They desired to repay Yu IlHan, and at the same time, receive his approval.</p><br/><p>“Let’s go into training immediately. There’s only around 2 weeks left too.”</p><br/><p>“To think they like moving more than resting, they’re all perverts alright.”</p><br/><p>Hearing Yu IlHan’s words, Liera thought that they were all becoming similar to their master Yu IlHan, but didn’t voice that out loud.</p><br/><p>“Good, then this will be the beginning of the battle training. I’m not asking each of you to hold off against a higher existence alone. Whether it’s a hundred or a thousand of you, you need to be able to go against a higher existence without any sacrifices. Liera will take the role of the trainer.”</p><br/><p>“Good, I’ll train you all good!”</p><br/><p>She was once a 6th class, and had a seriously good ability even now when she had fallen to 4th class. If it was her, she would be able to teach them the power of higher existences without killing the elves or the wolfkin. Yu IlHan left them all under Liera’s charge.</p><br/><p>Meanwhile, the Dragon’s Army under Yumir were doing battle training even while the elves and wolfkin were doing construction work, and they were also fighting against Yumir and would be completely beaten up by him in order to go against higher existences in the future.</p><br/><p>In fact, Yumir was slightly lacking compared to a real higher existence, but if he received the support from Na YuNa in the holy region, that wasn’t exactly the case.</p><br/><p>When the battle training commenced for real, cheers and shouts of pain started bursting out here and there. Just from the sound, it was no different from hell.</p><br/><p>[And you, master?]</p><br/><p>“I’m going to complete the satellite.”</p><br/><p>[…….Do you really have to call it that?]</p><br/><p>“Well, the name will change once it’s complete.”</p><br/><p>Yu IlHan looked around the new fortress and didn’t hold back on his 4th class magic stones to create artifacts. He focused especially on the jumping pads, and gave some variations to each of the poisonous swamps, and checked on the wind traps that were only made thanks to Yumir’s techniques. Other than that, he checked a lot of other things that needed his hand, and that took 3 days.</p><br/><p>“Good, now this fortress is prepared.’</p><br/><p>[Oh, a 5th class magic stone. So you were going to use it here?]</p><br/><p>“It’s good that there’s still one left.”</p><br/><p>Yu IlHan had a total of three 5th class magic stones.</p><br/><p>One of them was used in the upgrade of Yumir’s armor, the Breath of Gold. The Breath of Gold rose from Chaos rank to Demigod rank. The power inside the magic stone dissolved into it more naturally, and if it acquired enough records through him battling, then the Breath of Gold will also grow in power and reach God rank.</p><br/><p>Another one was used in the new parts for Yu IlHan’s armor, the Infernal dragon body. Using the remaining half of the body of the naturally occurring 6th class that resented Yu IlHan, Chaos Will, as well as the 5th class magic stone, he made a pair of gauntlets.</p><br/><p>The Infernal dragon body was originally made with new parts in mind, into a form that covered his entire body, right above his skin, so it was possible to make any additional parts, and the amazing thing about the Infernal dragon body was that the equipped armor can be stored as a part of its own and share its abilities, at the same time it took the role of the central control system for the new parts to prevent the mana going berserk. His objective was to strengthen it by adding boots, a helmet, a torso armor and a lower body armor.</p><br/><p>In any case, using two magic stones there, two were left, and the remaining one was taken out this time. To make the satellite a mobile aerial fortress like the Flying fortress!</p><br/><p>But somehow, Yu IlHan hesitated for a moment when the only thing he had to do was to activate mana crafting.</p><br/><p>“Fuu.”</p><br/><p>[That’s unlike you, master.]</p><br/><p>“Nah, I only thought for a little.”</p><br/><p>That was, the thought that there may have been less sacrifices if he did not let the elves and wolfkin equip with new arms; if they did not construct the fortress for them, and just make some equipment for a small, elite force to go against the higher existences.</p><br/><p>[You’re too late in regretting that.]</p><br/><p>“……Yeah. I was only scared for a moment. The rage from when I lost Phiria has cooled and now I’m afraid I’ll lose those that remain as well……”</p><br/><p>He really was cowardly even when he thought about it himself – hesitating after all that he did until now. If it was his past self, he would not have hesitated in acting in consideration for others…. Was this progress, or regress as a human being? In any case, it was quite funny.</p><br/><p>[It’s a path that they want to walk themselves. Hesitating any more will be rude to their courage and resolve.]</p><br/><p>Orochi scolded Yu IlHan with cool words despite being a snake. A strong smash that shattered his last shred of hesitation. Yu IlHan snorted and raised his magic stone.</p><br/><p>“I know. This is my type as well. Though, I did hesitate because I feel like I’m forcing my ways of actions onto them……”</p><br/><p>He raised his head to look at the location where the training was carried out. Ericia, Mirey and his other subordinates were being beaten up mercilessly by Liera, but they still gritted their teeth and went against her – it was very like his past self.</p><br/><p>Not only that, Yumir and the Dragon’s Army, the elves and the wolfkin, and all living things within the barrier was becoming similar to him. Although he didn’t know if this was a good thing or not, it did make him smile when he saw them.</p><br/><p>“Gosh, I don’t know anymore. We’ll all live reckless lives and die due to it.”</p><br/><p>[Nice words even though you don’t plan to let anyone go.]</p><br/><p>Yu IlHan ignored Mystic’s words and activated Mana crafting. The region that became a fortress thanks to the one and a half months of construction, reacted to the magic stone by vibrating, and emitted brilliant light.</p><br/><p>[Uwaaa, I can feel the sharing of the senses. Do I have to control this as well?]</p><br/><p>“Do your best. I’ll give you an assistant when I get an obedient 5th class thought-soul later.”</p><br/><p>[And how probable is that!]</p><br/><p>“So you know that you’re a special case.”</p><br/><p>His artifacts traps and castle walls that he made, and the others installed, were all tied into one by resonating with the mana from the magic stone. The satellite fortress gave out massive sounds and started cracking off from the surrounding land.</p><br/><p>However, Yu IlHan didn’t make it float on purpose. If he did that, it would escape the barrier made by the Hourglass of Eternity.</p><br/><p>The vibration intensified, and all the artifacts within the fortress emitted light along with mana, and at one moment, the vibration suddenly stopped and a series of texts appeared on Yu IlHan’s retina.</p><br/><p>[Bloodlight Guardian fortress was complete.]</p><br/><p>[Bloodlight Guardian fortress]</p><br/><p>[Rank – Demigod]</p><br/><p>[Durability – 15,223,004/15,223,004]</p><br/><p>[User restrictions – bound to the Destroyer’s Flying fortress. Will go berserk once the Flying fortress is destroyed.]</p><br/><p>[Options –</p><br/><p>1. Recovers durability by stealing life force and mana from the attackers.</p><br/><p>2. Grows by absorbing the records of various beings.</p><br/><p>3. Flight enabled. Sudden acceleration, sudden rise, sudden descent, enabled.</p><br/><p>4. 30% increase in attack power and defense of all items within the fortress</p><br/><p>5. 30% increase in recoverability of allies within the fortress.</p><br/><p>6. Guards against attacks aimed at the Destroyer’s Flying fortress. 30% increase in the fortress’s defense in these cases.]</p><br/><p>[One of the miracles made by the one that walks on an unexisting path. As it was made with a simple objective in mind, the power surpasses imagination. When a miracle meets a miracle, a myth is born.]</p><br/><p>“Good, it came out as I expected.”</p><br/><p>[So I can’t move this now, right?]</p><br/><p>“Wait ten more days.”</p><br/><p>Yu IlHan called Liera, the elves and the wolfkin into the fortress. Their main battlegrounds would be this fortress, the Bloodlight Guardian fortress in the future!</p><br/><p>“Your Majesty, does this fly as well? Really?”</p><br/><p>“It does, but I won’t make it float for now. Calm down.”</p><br/><p>Yu IlHan once again thought his subordinates of the artifacts within the fortress that just activated, and ordered them to use them in battle this time. Only Liera, who had to face them all, had to suffer.</p><br/><p>“IlHan, you’re giving me too much work!”</p><br/><p>“I’ll reward you later. Once we have some time.”</p><br/><p>“It might as well be hundreds of years before you have some time!”</p><br/><p>Will it really be just a few hundred years? Yu IlHan pondered on that seriously, but was seriously worried that his worries may become real and didn’t say it out loud. Then, he commenced the final piece of work that he decided to do within the barrier, with the shouts of his subordinate as the BGM.</p><br/><p>That is, the modification of the magic formation.</p><br/><p>[Just what can that man not do……?]</p><br/><p>[I think there was a few before, but I don’t think there is any right now.]</p><br/><p>[There was something before!?]</p><br/><p>Yu IlHan’s series of actions even made Mystic and Orochi close to each other! However, disregarding what everyone else said, Yu IlHan only worked on. He put his hand on the ground, and tried to feel the magic formation installed over the entire continent.</p><br/><p>“Before, I only used it without understanding the principles.”</p><br/><p>[…….And you know the principles now?]</p><br/><p>“Not only that.”</p><br/><p>Suddenly, the 4th class magic stone in Yu IlHan’s hand seemed to glow before disappearing. When the land glowed for a very short moment, the magic formation, embedded deep under the continent, twitched minutely. Yu IlHan felt that change and made a smile.</p><br/><p>“I can also interfere and modify it.”</p><br/><p>The only problem was that an enormous quantity of mana had to be used in the process, but Yu IlHan still had an enormous quantity of 4th class magic stones he had got from Earth!</p><br/><p>“Let’s see who wins.”</p><br/><p>[Master, don’t you think that you’re being too main character-like nowadays?]</p><br/><p>[He’s at that age so leave him alone.]</p><br/><p>However, just as the big match between Yu IlHan’s finesse and the history of the ancient elven empire was going to begin.</p><br/><p>[Yu IlHan?]</p><br/><p>“…….Huh?”</p><br/><p>Where, or how did that happen.</p><br/><p>The voice that he thought that he would not hear for a long time, entered his ears.</p><br/><p>Author’s notes</p><br/><p>Huh, just who is it!? (Eyes opening wide)</p><br/><p>We stayed in the barrier for quite a while as there were quite a lot of things to do. We’ll exit it soon.</p><br/>\n</div>"}