{"title": "Chapter 266: Wherever I Go – 8", "id": 266, "volume": 3, "url": "http://boxnovel.org/everyone-else-is-a-returnee-chapter-266-wherever-i-go-%E2%80%93-8", "volume_title": "Volume 3", "body": "<h1>Chapter 266: Wherever I Go – 8</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>[Kill him!]</p><br/><p>[Kill!]</p><br/><p>[Revenge for Helièna!]</p><br/><p>Numerous monstrous beings, each with enough power to destroy a world by themselves, charged at Yu IlHan. Of course, their league fell as soon as they entered the region of Falling Down, but they didn’t realize that as anger had gotten their heads. Even that was according to Yu IlHan’s plan.</p><br/><p>Just that, there was one thing he didn’t understand.</p><br/><p>“I can understand if it was just the Destruction Demon Army…….”</p><br/><p>Yu IlHan entered mana-saving mode and focused the white flames on the tip of his spear while he titled his head.</p><br/><p>“Why are even the guys from the Army of Brilliant Light and the Garden of Sunset also shouting out Helièna’s name?”</p><br/><p>[I’m everyone’s idol, darling. A being like the sun! – you’ll be burn if you get too close, but you can’t stop longing for it when you can’t see me! Who was the lucky one that got to monopolize such an idol?]</p><br/><p>“Yeah, yeah. You’re great. Tch.”</p><br/><p>Helièna should be in the Flying fortress right now, but as he was connected deeply with her from the moment she became a thought-soul, she could express her will like how Orochi and Mystic could.</p><br/><p>Yes, even though he had given back her a body, the liberation he wanted did not come to him!</p><br/><p>[Kuaaaaaaaa!]</p><br/><p>[Kill, I’ll kill everything!]</p><br/><p>[I see a familiar face. That resentful face, but dimmer!]</p><br/><p>Although there were a few angels before he crossed over the Wall of Chaos, now that he had crossed over the boundary, this was completely enemy territory. Right now, it was the worst since even the fallen angels and the members of the Garden of Sunset were also unrestricted with their powers. They were sure that they were in the advantage and immediately charged to where he and his companions were/</p><br/><p>“IlHan, there are quite a few 6th class beings so be careful. You’ll die the moment you’re careless.”</p><br/><p>Liera gripped on the light pink-colored spear as she crouched forward. The Wall of Chaos – although she had a lot of experience fighting in this place, this was naturally the first time she did so as a lower existence.</p><br/><p>Although she was slightly tense due to the nervousness, she did not plan to back out; the person next to her was her beloved that she had to protect. The moment she thought that, the light in her spear became stronger, and the blessing of the god of love boiled and enveloped her. Pink light protected her.</p><br/><p>“I can do something about 6th class with Falling Down. Erta, can you primarily use support magic? Liera and I will take care of the enemies.”</p><br/><p>“Leave it to me. That’s my specialty.”</p><br/><p>Numerous magic formations floated within the region of Falling Down simultaneously. They were magic formations that defended against enemy magic, decreased their power of physical attacks, interrupted the enemy movements, and making the mana of the enemy berserk in reverse.</p><br/><p>However, the already strong magic formations were supported by the white flames that spread on it. When Erta saw that the effectiveness of her magic had increased by at least 2 times, shock filled her eyes.</p><br/><p>“This is……!”</p><br/><p>“Falling Down is growing as well, you know.”</p><br/><p>Yu IlHan replied like it was nothing and threw his spear to one of the higher existences that just entered the domain. The Eight-tailed dragon Spear grew in size instantly by 10 times after absorbing the white flames as it flew along its flight trajectory, nicely pierced the enemy.</p><br/><p>[You have earned experience.]</p><br/><p>[What!?]</p><br/><p>A lower existence just killed a higher one with just light movements! A few of those that tried to charge into the domain became stiff on the spot. Of course, they became the next sacrifices for the Eight-tailed dragon spear. Grabbing the spear that came back, Yu IlHan muttered.</p><br/><p>“In the end, they only amount to so much. There are so many worlds that it’s uncountable. But even if they reached peak in one of those worlds, they are merely one of countless. Why didn’t I know this before?”</p><br/><p>“IlHan, your thoughts are really daring. Though, it’s frustrating that it’s not exactly wrong.”</p><br/><p>One of those ‘countless peaks’, Liera, replied while gritting her teeth. However, her rage wasn’t vented towards Yu IlHan but the other higher existences.</p><br/><p>“Haaaaaaaaaahp!”</p><br/><p>[Kyak!? My body……!]</p><br/><p>One Destruction Demon soldier was instantly ground up by her spear after it was bound by Erta’s magic formation and had its magic cancelled. Next was a fallen angel, and next was from the Garden of Sunset! Black and blue blood scattered everywhere. All the corpses were all collected into Yu IlHan’s inventory.</p><br/><p>“Huh.”</p><br/><p>Liera soon realized one thing.</p><br/><p>“It’s much more doable than I expected?”</p><br/><p>“It’s all thanks to Falling Down. This skill is not from a lower existence……!”</p><br/><p>Erta sweated cold sweat after looking at the region of the soulflames that now grew quite a bit to cover quite a portion of the battlefield.</p><br/><p>“It even restricts and lowers the league of 6th class beings. I didn’t see such skills even with Battalion Commanders!]</p><br/><p>“There we go! Isn’t that because IlHan is too good?”</p><br/><p>Even right now, the flames restrained and damaged the enemies, enhanced Erta’s magic, and added power into Liera’s spear! It was as if looking at an army that moved according to Yu IlHan’s orders.</p><br/><p>“That’s amazing! As expected of a loner! You made a skill that enables you to do almost everything by yourself……!”</p><br/><p>“You come to the rooftop after school!”</p><br/><p>It wasn’t just a ‘distraction’ that they were doing. Yu IlHan, Liera and Erta had become a storm that swept the battlefield! Titaera, who watched as the domain of the soulflames became larger and larger as it enveloped more and more of the battlefield, was covered in cold sweat.</p><br/><p>[My god…… I thought he was only good at ambush attacks……]</p><br/><p>“His personality must have changed.”</p><br/><p>Kang MiRae was also shocked after seeing his incomparably overwhelming power to before, but could easily derive an answer and could tell the angel.</p><br/><p>“Before, he liked to hide and be alone, but right now, he has found the room to give us a share of his heart. He’s distracting the enemies for me too. …… I think it’s definitely because of that.”</p><br/><p>[That does not make any sense.]</p><br/><p>The angel immediately denied her words. However, Kang MiRae wanted to believe that it was like that even if it wasn’t actually so. After meeting him again, her heart that had gotten excited was pushing her thought process to be more emotional.</p><br/><p>[However…… whatever the source of his ability is, he really is doing a perfect job. It’s now. This is the perfect time. We shall depart as well.]</p><br/><p>[Good, got it.]</p><br/><p>Mystic initiated the Flying fortress. Under Yumir’s power, the Flying fortress smoothly went over the Wall of Chaos while being concealed, and inside, Kang MiRae opened her eyes wide to find the traces of the Army of Brilliant Light.</p><br/><p>[There are many worlds under the administration of the Army of Brilliant Light. Amongst them, we need to find one that leads to their main headquarters.]</p><br/><p>“I’m…… looking for one right now!”</p><br/><p>[We shall help!]</p><br/><p>However, what the angels could do was to just differentiate the mana belonging to fallen angels and telling her which. Countless fragments and traces of mana were in the battlefield. They had to find one that connected to the main world of the fallen angels!</p><br/><p>“First one…… here we go!”</p><br/><p>A portion of the mana crystals that swirled around Kang MiRae rapidly flew across the air and arrived at their destination, when a vortex appeared with a strong light burst akin to fireworks. Beyond that was definitely a higher world. However……!</p><br/><p>[That’s not it! That’s not their main quarters!]</p><br/><p>[That’s!? A gate has opened!]</p><br/><p>[What is that island? ……Island?]</p><br/><p>[It’s angels! They’re with a lower existence!]</p><br/><p>Naturally, there was no way the concealment was maintained after a grand process of generating a gate. At that moment, Yumir changed into dragon form and roared.</p><br/><p>[Kroaaaaaaaaaaaaaar!]</p><br/><p>Although it meant ‘Dad, we were found out, hiiing’, the enemies heard it as an intimidating roar, and the allies heard it as a signal for the start of battle. The angels and the dragon immediately went into battle formation and Kang MiRae hurriedly cancelled her gate and recollected her mana.</p><br/><p>[That girl opened a gate connecting to our world.]</p><br/><p>[But how?]</p><br/><p>[It doesn’t matter how. Perhaps maybe…… shit!]</p><br/><p>[Oho!?]</p><br/><p>[That aura was definitely, hmm!]</p><br/><p>The fallen angels were all swept by nervousness, while the Garden of Sunset and the Destruction Demon Army became interested. A crack had appeared in the already unstable alliance.</p><br/><p>[We need to kill her!]</p><br/><p>[Get them out right now!]</p><br/><p>[But Yu IlHan is……!]</p><br/><p>[Yu IlHan is not of importance right now!]</p><br/><p>“No, I will be!”</p><br/><p>When the camp of the fallen angels shook, Falling Down once again expanded in area and instantly dragged the fallen angels in, restraining them, while Erta’s magic formation also expanded and dispersed their magic power! Yu IlHan and Liera flew side by side within the domain to behead them and pull out their wings.</p><br/><p>“This is…… I feel like I became stronger than when I was a higher existence!”</p><br/><p>“Haaaaaaaap! Lunatic wave!”</p><br/><p>“Hhhhhhhp!”</p><br/><p>Yu IlHan just poured out all the dragon bone spears in his inventory into the air and grabbed his Thunder hammer.</p><br/><p>The hammer expanded with lightning after absorbing his magic power! Even the flames gathered towards it, enhancing it further. He activated God Force to the very limits as if to boast his puffed muscles and shouted while swinging the gigantic hammer</p><br/><p>“You say you’d attack who!?”</p><br/><p>The souls and flames that made up Falling Down were absorbed by the scattered bone spears and controlled them. The throwing spears were shot precisely at the fallen angels, while the Thunder hammer was being swung in the middle! The overwhelming force generated from the hammer resonated with the vibrating bone spears, which made ordinary higher existences unable to resist. At least those within the domain of Falling Down.</p><br/><p>[Destroy the spears!]</p><br/><p>[Dammit…… this sticky thing is, Kugh!]</p><br/><p>Tens to hundreds, hundreds to thousands. It felt like just yesterday when Yu IlHan trembled at the sight of a single higher existence, but right now, he was massacring them like it was nothing. His transformation was extremely dramatic and frightening. Even considering the support from the Record skill which was now over level 60, his movements were too surprising.</p><br/><p>[Perhaps……]</p><br/><p>[Perhaps he is.]</p><br/><p>As if spitting out what it had in its mouth in fear.</p><br/><p>Someone, or something, muttered.</p><br/><p>[Perhaps he is the Fifth?]</p><br/><p>It was like this every time a transcender was born. They crushed beings of equal league or higher like it was nothing, had domineering personalities, and made everything that was around them their possessions, or destroyed them if they couldn’t.</p><br/><p>Like that, the peculiar, messy beings that didn’t die all reached the realm of transcenders. The ones at the realm of absolute that no one could dare dream to pass. Right now, Yu IlHan looked like such a person to them.</p><br/><p>[However, not now.]</p><br/><p>Someone appeared out of nowhere.</p><br/><p>[So we just have to erase him here and now.]</p><br/><p>Three pairs of pitch black wings, two eyes glowing in red like rubies. Black fur coat that covered the entire body. He had the appearance of a middle-aged man, but the league from his body was that of an emperor’s.</p><br/><p>[Lord Satière……!]</p><br/><p>[Lord Satière himself has……!?]</p><br/><p>[The 4th Wing of Brilliant Light!?]</p><br/><p>The battlefield fell into commotion once again. No matter how big of a ripple Yu IlHan had called out, would he be able to surpass a 7th class that descended upon the battlefield? This was precisely why Yu IlHan told them to send out a 7th class, but why did the angels never listen to him!</p><br/><p>[You damn pigeons. You really do annoy me. This war has become annoying again.]</p><br/><p>His gaze swept over the battlefield. Minor 5th class beings ended up being petrified, with their mana being dissipated. The Flying fortress managed to block it in a desperate attempt with the help of the angels, but this was too strong to be just from a gaze.</p><br/><p>[I’ll clean you up. Your wings, your hopes. I shall snap them all.]</p><br/><p>“That person! That person must be from the main army! I can feel the presence of a strong mana!”</p><br/><p>Shouted Kang MiRae. Well, even the angels were sure of that. But how? How were they supposed to approach such a frightening being and grasp the trace of mana!</p><br/><p>[Oh my, it looks like it’s my turn now.]</p><br/><p>A single bud of a flower bloomed above the Flying fortress as if having waited for that moment. The immeasurably potent poison that held the appearance of a beautiful flower. Despite the fact that it was snapped by a brutal man once, it still hadn’t lost its vitality and gloss.</p><br/><p>[Come play with me, Satière.]</p><br/><p>The name of that flower, was of course, the Succubus Queen Helièna.</p><br/>\n</div>"}