{"title": "Chapter 276: Why Only Me? – 2", "id": 276, "volume": 3, "url": "http://boxnovel.org/everyone-else-is-a-returnee-chapter-276-why-only-me-%E2%80%93-2", "volume_title": "Volume 3", "body": "<h1>Chapter 276: Why Only Me? – 2</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>“What the hell is this? There are over a hundred thousand people from other worlds!”</p><br/><p>Liera peeked over Yu IlHan’s shoulders to look at the figures of people who filled a certain region of Earth, before making an expression that suggested she couldn’t believe it. Yu IlHan shrugged and replied.</p><br/><p>“You guys brought them back too.”</p><br/><p>“That’s true, but…….”</p><br/><p>“It’s funny to see them move so slowly altogether~. Mr. IlHan, can’t you control the speed of the time? The speed!”</p><br/><p>“There’s no such advanced feature yet. Eih, get off me, all of you.”</p><br/><p>“Hiing.”</p><br/><p>All of Yu IlHan’s companions had gathered in one place. Liera was alright, but when more people started to stick to him to ‘supplement their Yu IlHan vitamins’, Yu IlHan got annoyed and shook them all off before checking with ERta.</p><br/><p>“There aren’t any people who are resisting the magic formation other than us, right?”</p><br/><p>“At first, yes. However, after some of them realized that we were moving too rapidly, there were some that noticed the magic cast over Earth. Of course, that does not change anything, but there are exactly three people who have regained 40% of their normal movements by resisting.”</p><br/><p>The three referred to Carina Malatesta of Magia, Michael Smithson of Metal Knights, and Takagaki Asuha of Magic Dragon.</p><br/><p>Looking at them, Yu IlHan realized that they had achieved their 4th class in such a short time. Considering that Han YeoRang, the leader of one entire world, was at 3rd class right now, their realm of achievement was shocking.</p><br/><p>“Why is that?”</p><br/><p>“Perhaps it’s because just resisting against this magic is a tremendous achievement. Normally, even 4th class being shouldn’t be able to endure it. People of Earth are really strange.”</p><br/><p>“Michael Smithson, before, he was a guy with no guts at all, but I guess he’s progressed a lot. Humans sure are interesting.”</p><br/><p>[*Sigh*, I can’t believe that we’ll need to defend Earth, which will become the center of attention of all universes with those maggots. Darling, do something about it.]</p><br/><p>“I’ll try.”</p><br/><p>Yu IlHan called the three. As they were late in their reaction, it was difficult to have a conversation with them, but he pushed his patience to his limits and told them. The contents were simple.</p><br/><p>“Do you guys want to train within the Hourglass of Eternity with us?”</p><br/><p>“Of course! (2.5 times slower)”</p><br/><p>Takagaki Asuha replied immediately, while Carina Malatesta and Michael Smithson looked at each other for a little before nodding their heads.</p><br/><p>“Okay. (2.5 times slower)”</p><br/><p>“I shall (2.5 times slower)”</p><br/><p>Having gotten their answers, there was no need to hesitate now. Yu IlHan created a barrier that surrounded the two fortresses, his companions, the three clan masters, and finally the Dragon’s Army that hadn’t been affected by the magic in the first place.</p><br/><p>“Wow, the range is so much larger than before~.”</p><br/><p>“The effect of the magic doesn’t disappear even within this barrier. Hm, but the pressure on my body is a little less now.”</p><br/><p>Kim YeSeul was surprised while looking around inside the barrier. However, the most surprised ones were the clan masters that entered the barrier with them.</p><br/><p>“Fuu, I can finally move better now!”</p><br/><p>“Ooh, you can speak faster now.”</p><br/><p>“Phew.”</p><br/><p>They were able to resist the magic to a certain extent, and now that they were inside a God-ranked artifact which could also resist the effect of the magic, they could move at normal speeds.</p><br/><p>“Eeeeeek.”</p><br/><p>After Michael Smithson gained complete control over his body, he immediately turned his head around to Yu IlHan and shouted his lungs out.</p><br/><p>“Just what did you do to Earth, mister Unique! I think I get it, but still!”</p><br/><p>“I couldn’t help it since Earth was developing too fast. You understand me, right? Though, I do not really need your understanding either.”</p><br/><p>“Uaaaaaaaah! This guy irritates me as always!”</p><br/><p>Meanwhile, Takagaki Asuha shouted towards Yu IlHan with glittering eyes.</p><br/><p>“Amazing, Lord Susanoo! Now you can manipulate space and time!”</p><br/><p>“No, this is the power of my companions…….”</p><br/><p>“Amazing! I knew you were the reincarnation of the god Susanoo!”</p><br/><p>“Hey, you aren’t listening are you?”</p><br/><p>“Aaah, Lord Susanoo……!”</p><br/><p>Although a seedling could be seen from her before, it seemed like she now harbored something like religious faith towards Yu IlHan, after she watched him leap through dimensions and cast a magic on a global scale. That heavy gaze, the same gaze he saw from elves, and the gaze that could not simply be called admiration!</p><br/><p>“Lord Susanoo, so cool.”</p><br/><p>“Right, this woman’s hopeless as well.”</p><br/><p>He made a groan and turned his head around to see the final one, Carina Malatesta, and saw that she was taking a deep breath.</p><br/><p>“Why are you taking a deep bre……oh.”</p><br/><p>“Fuh!”</p><br/><p>“Miss Malatesta? Kugh!”</p><br/><p>Before Yu IlHan could stop them, Carina Malatesta assaulted Michael Smithson. ‘Assaulted’ without causing much physical damage, but rather by knee-kicking him on the abdomen to make him fall down and ‘assault’ him from the top with a kiss. As there was a paralysis magic within the knee-kick, he couldn’t resist at all.</p><br/><p>“Uhp! Uhhhhp!?”</p><br/><p>“Stay still.”</p><br/><p>“…… Looks like she had a lot of stress piled up.”</p><br/><p>Yu IlHan decided to leave the lioness Carina Malatesta and the pitiful rabbit Michael Smithson alone for a while. The ones that were watching the passionate scene that occurred as soon as the barrier opened also coughed awkwardly and turned away their gazes.</p><br/><p>“Then let us do our own thing.”</p><br/><p>“Dad, what do I do?”</p><br/><p>“Mir just has to eat dragon meat and bathe in the Cradle of Miracles. If you get bored, practice your skills too.”</p><br/><p>“I can do that!”</p><br/><p>Yu IlHan took out the Cradle of Miracles in one corner of the barrier and filled it with Echjar’s blood. He explained to his companions that were absent-mindedly looking at the glowing Cradle of Miracles.</p><br/><p>“From now, we will all share this Cradle of Miracles. There are a lot of people, so when bathing, many of us should go in at the same time according to gender. The children belonging to the Dragon’s Army are small so more of them should fit.”</p><br/><p>[Mixed bathing with darling? How marvelous.]</p><br/><p>“DIdn’t I just say ‘according to gender’?”</p><br/><p>He shushed Helièna and continued explaining.</p><br/><p>“Although I’m not sure about this yet, there is a high probability that the Cradle of Miracles may lead us into the realm of higher existences. Even if weren’t the case, I believe you can acquire new abilities if you succeed in resonating with the dragon’s blood within the cradle. So everyone should go in periodically.”</p><br/><p>“Yes.”</p><br/><p>“Understood.”</p><br/><p>The next thing they had to do was of course, training. The only place they could train without worrying about the flow of time was the barrier made from the Hourglass of Eternity.</p><br/><p>“To think we acquired 2 months that amounts to less than a second on the outside, it really is an amazing artifact…….”</p><br/><p>“Well, I’m not sure about if it’s really just two months.”</p><br/><p>Yu IlHan denied Kang MiRae’s mutter that she voiced out in surprise. He looked at the Hourglass of Eternity. After the barrier had been activated, the Hourglass had flipped and the sand was now falling down once again. However, the speed was very slow, and it definitely didn’t look like it would be flipped again in just two months.</p><br/><p>“Mr. IlHan, this is…….”</p><br/><p>“It’s just as you see. The slow magic cast over the entire globe made the cooldown time of the barrier slow down. That is why I thought that the slow magic may even affect the barrier’s duration time and…… and it seems like I was spot on.”</p><br/><p>“This is…… broken.”</p><br/><p>Muttered Liera. Yu IlHan lightly nodded and agreed with her. Erta still found this absurd.</p><br/><p>“That magic worked against a God-ranked artifact!? At this point, I’m even wondering how we can move so normally within the effects of the magic!”</p><br/><p>“Well, through sheer tenacity and stubbornness.”</p><br/><p>“You’re wrong if you can explain everything with just those two words!”</p><br/><p>“You guys always explained me with the wrong things though.”</p><br/><p>Erta was frustrated after she heard Yu IlHan’s words and flailed her arms around – she looked quite cute doing that.</p><br/><p>“But it really is like that!”</p><br/><p>“Yeah, and that goes for now as well.”</p><br/><p>“Uuuuuuu……!”</p><br/><p>He couldn’t help it since that was the truth. One may think that non-life-forms may endure better against this magic than the life-forms, but that wasn’t true as the higher monsters that were late 4th class were all affected without exception.</p><br/><p>Just as Erta’s mind was about to be tangled into a mess, Yu IlHan raised his thumbs up with a uselessly fresh smile.</p><br/><p>“Have more confidence in your tenacity!”</p><br/><p>“Shut up!”</p><br/><p>[And so?]</p><br/><p>Helièna, who regained her calm relatively faster than the others, looked at Yu IlHan and asked.</p><br/><p>[This barrier, how long do you think it’ll last?]</p><br/><p>“Just looking at the state of the Hourglass now, around a year and a half.”</p><br/><p>[The barrier can be activated once every two months, so under the assumption that darling will keep patrolling other worlds, we would have several more opportunities to be inside this barrier before Earth becomes a higher world.]</p><br/><p>“Well, yeah.”</p><br/><p>[Darling…… really amazing.]</p><br/><p>This was the first temporal advantage Yu IlHan had gained ever since he lived a thousand years alone on Earth, as he had to move around very busily after the 1st Great Cataclysm. Inside the barrier, he at least had the time to train his skill profeciencies and work on his crafting!</p><br/><p>When Yu IlHan was about finished with explaining the duration of the barrier and what they all had to do, Carina Malatesta finally let go of Michael Smithson, seemingly satisfied.</p><br/><p>“Fuu, tssp.”</p><br/><p>Even though she had just assaulted a man, she licked her lips calmly, which looked very scary. Looking at Michael Smithson trembling below her, Yu IlHan felt pity for him for the first time.</p><br/><p>“M, Miss Malatesta…….”</p><br/><p>“Call me Carina, okay?”</p><br/><p>“……Carina.”</p><br/><p>“Very good. Our family only allows parents, teachers and family to call us by our name. Now that my family are all scattered across other worlds and my teacher is in another world, the only one that is allowed to call my name on Earth is you. Please remember that.”</p><br/><p>“I, I understand. Please call me Michael as well.”</p><br/><p>“That’s the answer I wanted, Michael.”</p><br/><p>Carina Malatesta’s figure that won what she wanted with force was very bright. Perhaps it was the few years of separation and suffering that had made her strong! In the past, Micahel Smithson had romantic feelings towards Kang MiRae, but looking at things now, it seemed that Carina Malatesta’s bold approach was quite effective.</p><br/><p>Only after she fished up a man’s life, did she look back to Yu IlHan once more.</p><br/><p>“Although my greetings are late…… thank you. Mr. Yu IlHan. Thanks to you, I could finally meet the one I love.”</p><br/><p>Carina Malatesta seemed to have completely thrown away the haughty rich-lady demeanor of before as she bowed her head politely towards Yu IlHan. However, Yu IlHan was more joyful towards her heartfelt words rather than her change in attitude.</p><br/><p>The burden that remained inside him after hearing that if there was really a need to protect Earth, had finally disappeared a little.</p><br/><p>“Well…… glad to hear that I helped you.”</p><br/><p>“There should be a lot of others like me. Ones that are suffering due to the loss of their loved ones, ones that were separated from their close friends, as well as people who have lost their parents and children.”</p><br/><p>Carina Malatesta’s eyes glistened.</p><br/><p>“So, please let me help you so that those people can all reunite together.”</p><br/><p>“Of course. …… Of course. Please take care of me from now on.”</p><br/><p>“I shall now follow you as leader from now on. Please give me any orders.”</p><br/><p>After hearing that Yu IlHan pondered for a little before looking around to Takagaki Asuha and Michael Smithson as well to speak.</p><br/><p>“Then I shall have you guys level up first. Your levels are still way too low.”</p><br/><p>“I’m also 4th class now, though, I should still be lower than you……. But level up? How? There are no monsters here.”</p><br/><p>Yu IlHan turned around. The place his gaze headed to was none other than where Erta was.</p><br/><p>“Erta, you can summon monsters in here, right? The ones on Earth.”</p><br/><p>“Saying such irresponsible things again…… Of course.”</p><br/><p>“So you can’t do it, well then.”</p><br/><p>Just as Yu IlHan was about to go with Plan B, Erta gave a confident smile towards him and spoke.</p><br/><p>“I can naturally do it.”</p><br/><p>“Hey, you’ve gotten better at fooling others?”</p><br/><p>“Well, I was fooled a lot by a certain someone until now.”</p><br/><p>Even the exchange of deals that occurred between the angels when he was still an Angel’s Partner finished smoothly. Erta raised her hand after turning around to the clan masters who had expressions of shock.</p><br/><p>“Well, then. Can you all prepare for battle?”</p><br/><p>“Wait, the three of us have never fought together bef-“</p><br/><p>“That much.”</p><br/><p>When Erta swung her hand as if to cut Micahel Smithson’s excuses off, a gigantic monster appeared in front of the three of them. It was a demonic monster that was definitely within the late 200s! From its vibrating body, it was definitely a vibration demon.</p><br/><p>“You can just do it now.”</p><br/><p>“You devillllllllll!”</p><br/><p>[Kuoooooooooooooooh!]</p><br/><p>Like that, the curtain to year and a half of barrier life had smoothly been raised.</p><br/>\n</div>"}