{"title": "Chapter 273: If You Wish To Follow Me – 7", "id": 273, "volume": 3, "url": "http://boxnovel.org/everyone-else-is-a-returnee-chapter-273-if-you-wish-to-follow-me-%E2%80%93-7", "volume_title": "Volume 3", "body": "<h1>Chapter 273: If You Wish To Follow Me – 7</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>The moment Chaos was subordinated under Yu IlHan, he immediately released it into the lake. No, to be exact, it should be said that he tied the entire lake with the 5th class magic stone, and spread its thought-soul into it.</p><br/><p>The mastered mana crafting and soul enchant activated simultaneously and transformed the lake into a golem. Chaos Will spread its consciousness throughout the entire lake, and became able to control it, and proved that it could proficiently use its new body by making a twisted face of Yu IlHan on the surface.</p><br/><p>“This damn thing.”</p><br/><p>[Hmph.]</p><br/><p>[Will of the Guardian was complete.]</p><br/><p>[Will of the Guardian]</p><br/><p>[Rank – Demigod]</p><br/><p>[Durability – indestructible as long as a drop of water remains]</p><br/><p>[Options –</p><br/><p>1. Will not evaporate with a lower-ranked flame.</p><br/><p>2. Able to transform into ice and steam at will.</p><br/><p>3. Able to absorb water and make it a part of the body.</p><br/><p>4. 40% increase in all abilities on Earth]</p><br/><p>What once had the name of ‘chaos’ in its name now harbored ‘Guardian’. When he giggled due to it being so funny, Kim YeSeul asked him.</p><br/><p>“Son, what did you just do?”</p><br/><p>“I made the lake into a golem.”</p><br/><p>“That’s not something you should so casually say like you’ve ate toast for breakfast! You were supposed to make an artifact that will draw the magic formation but you made a golem!? How is that different from claiming to be a vegan when you’re cooking meat!?”</p><br/><p>“But I never lied. The Will of the Guardian will draw the magic formation by itself.”</p><br/><p>“……!”</p><br/><p>The smart Erta immediately realized what he was trying to do with that. Kim YeSeul and Helièna were the same.</p><br/><p>[Oh, how did you think up of such a thing? Well, this golem may actually be able to do it. And it can move as it wishes to as well…….]</p><br/><p>“Seeping into the Earth and carving it would even be possible if necessary. I wondered what you were thinking but this is really…… absurd.”</p><br/><p>“That’s why the only thing remaining thing is the magic formation.”</p><br/><p>Yu IlHan checked the state of the lake golem, Will of the Guardian, that just came to be and told his companions.</p><br/><p>“We need to make a magic formation that can hold back the flow of time on Earth as soon as possible.”</p><br/><p>“Leave it to us. We found a hint now.”</p><br/><p>However, it wasn’t as easy as it was said. This was not something that could be solved with just Yu IlHan hurrying, so he decided to focus on making an artifact that would reinforce the magic formation while he was waiting for the magic formation to be finished.</p><br/><p>Although this was obvious, he couldn’t have complete faith in the magic formation in order to delay the Earth’s leap into the realm of higher worlds. Wouldn’t he have to do everything he could? For that, Yu IlHan started pulling out the feathers of angels and fallen angels.</p><br/><p>[Is it a similar device to Hundred Eyes?]</p><br/><p>“Well, the principle is similar since I’m using the feathers, but their objective is completely different.”</p><br/><p>Feathers belonging to angels and fallen angels had the power of transform the energy into a specific attribute, compress it, and eject it out. What Yu IlHan focused on was none other than the absorption and compression.</p><br/><p>The reason Earth was evolving, in the end, was because the concentration of mana on Earth was getting higher. Then, if he prevented the mana concentration from increasing, wouldn’t the evolution be delayed as well? Compressing the mana with the feathers and making it disappear!</p><br/><p>[And where would it disappear to?]</p><br/><p>“Dareu.”</p><br/><p>[Master……]</p><br/><p>“The war in Dareu is settled for now, and there’s still a lot of time until the 6th Great Cataclysm there so it should not be a problem. And it’s not like I’ll release it immediately into Dareu. I’m going to make a separate device that gathers mana.”</p><br/><p>[Leaving everything aside, is there a method that can make mana leap over dimensions?]</p><br/><p>“Good question. However, that will be solved if I just imbue the functions of my Warp skill into an artifact. Isn’t it simple?”</p><br/><p>[Hoo, yeah, right.]</p><br/><p>Yu IlHan ignored Orochi’s sarcasm and first created the artifacts that would be placed in Dareu. As this had to compress and store large quantities of mana, the material he went with was of course, the 8th wing of Brilliant Light, Natière! He dismantled all three pairs of wings that Natière had and pulled out her bones and ground it.</p><br/><p>What he chose as sub-material was the 6th class dragon, Teraka. He pulled out the hardest bone he had and mixed Natière’s bone powder and shaped it with Eternal Flame to make a gigantic cylinder that was over 3 meters in diameter and over 50 meters tall. The glistening black cylinder looked very intimidating.</p><br/><p>[Why is it a cylinder?]</p><br/><p>“Well, wouldn’t I need a container to contain energy?”</p><br/><p>[You’re blatantly hiding things, master.]</p><br/><p>“Sometimes, concealing things has more beauty.”</p><br/><p>He applied Natière’s powdered feathers and magic stone powder on the inside of the cylinder. To finish it off, he mana crafted it with Teraka’s magic stone. The results were satisfying.</p><br/><p>“Good, that should serve as a good foundation…….”</p><br/><p>[You really look like you’re enjoying yourself…….]</p><br/><p>And the more Yu IlHan enjoyed his work, the more horrifying the results came to be, mainly against the enemies! He checked the finished product including its heat capacity and durability, before lightly telling the ones that were working on the magic formation.”</p><br/><p>“I’ll go to Dareu for a little.”</p><br/><p>“Like I said, even if you tell us like you’re going out to a convenience store or something…… oh, sheesh! Just go already!”</p><br/><p>Yu IlHan laughed at Erta’s reply and activated Warp. Now, it only took him one minute for the teleportation to Dareu to activate. Like what he said to Mirfa before, going back and forth two worlds was almost nothing to him right now.</p><br/><p>‘Of course, I won’t be able to go meet her this time…….’</p><br/><p>Although he felt sorry remembering Mirfa’s sad gaze towards him, unfortunately for her, Earth was at an emergency right now. And actually, he even felt pressured by the women who had romantic feelings towards him.</p><br/><p>[It’s something that a ruler has to experience. From what I see, it’s good that you’re accepting and acknowledging that it was because you have a strong power.]</p><br/><p>“Damned dragonkin power freaks.”</p><br/><p>He looked for the place where the mana was most agitated within Dareu to install the cylinder. Of course, he didn’t forget to make it so that no one other than him could touch it. Imbuing his concealment ability onto artifacts was as easy as pie right now! Unless he came and intentionally revealed it, no one would be able to discover it.</p><br/><p>[I can now feel what master has made. Isn’t that a weapon that has a lot of uses after Earth has become a higher world?]</p><br/><p>“That’s why it’s two birds with one stone.”</p><br/><p>Well, it was exactly as he had described it so Orochi couldn’t really retort. If one action could acquire two achievements, there would be nothing better! While Orochi became silent, Yu IlHan finished installing and quickly returned to Earth.</p><br/><p>“Now I’m going to make a device that will send the gathered mana to Dareu.”</p><br/><p>[I’ve long since given up on trying to understand the things you do, so do whatever you want.]</p><br/><p>“You should chime in to make me more enthusiastic. Such a bland guy.”</p><br/><p>[It’s all your fault.]</p><br/><p>The amount of feathers of angels and fallen angels literally amounted to an ‘insane’ quantity, and he gathered around 60 percent of all of it and powdered it with some magic stones.</p><br/><p>He lightly mana-crafted on those lightly in order to synchronize them, and mixed them with the bones of dragons including Teraka’s, to create hundreds, thousands, tens of thousands, hundreds of thousands, millions of small cylinders, each about 30 centimeters long. And in just 4 days. It wouldn’t be an exaggeration to say he made more than 10 per second!</p><br/><p>[……How can you be so fast?]</p><br/><p>“As I always said before, the time taken to do repetitive work will become shorter the more proficient you get in it.”</p><br/><p>[…….]</p><br/><p>Yu IlHan’s reply to Orochi’s retort (Orochi forgot that it shouldn’t have asked) still lacked any persuasive power whatsoever. Becoming proficient was enough to make things with such a ridiculous speed?</p><br/><p>[A blessing of a god really is strange……. Of course, master’s existence is even stranger!]</p><br/><p>“Haha, I’ll be embarrassed if you praise me so much.”</p><br/><p>[I’m not!]</p><br/><p>“Good, now let’s do the wide-area mana crafting…….”</p><br/><p>[Wide-area!?]</p><br/><p>Yu IlHan ground the all lower-class magic stones he didn’t use until now and, mana crafted the several million artifacts at once. After that, he started installing them on various parts of the Earth. Another four days was used in this process.</p><br/><p>Later, when Will of the Guardian formed the magic formation that covered the entire Earth, these artifacts will also go under the control of the Will of the Guardian, and receive its protection. Really, it could be said to be a meticulous preparation.</p><br/><p>Only then did Kim YeSeul succeed in calculating the specifics for a magic formation that was at the scale of the Earth, and imbued her own powers inside it. It was all thanks to Erta and Helièna’s help.</p><br/><p>“I’ve really learned a lot. I can even feel that it may reach the realm of advanced skills one day.”</p><br/><p>“That goes for me as well. Magic that manipulates time and space using pure distortion of mana without the interference of higher mana, just by coming into contact with such a thing enabled me to do a lot of things.”</p><br/><p>[Oh my, I’m happy to hear that I was of help. Then you’ll speak well about me to darling, right?]</p><br/><p>“Fufu, I shall.”</p><br/><p>Although this was not within Yu IlHan’s intentions, it seemed like Kim YeSeul became closer to Erta and Helièna in the process. He received the blueprint from Kim YeSeul with an awkward expression.</p><br/><p>“If you expand this, then you should be able to slow the advancement of Earth.”</p><br/><p>“Thanks, mom. I believed in you.”</p><br/><p>Yu IlHan interpreted the blueprint by himself and absorbed the complete knowledge about the magic formation using the Record skill. Even though he wasn’t enlightened with the magic of manipulating space and time, and only recorded a magic formation with just one specific purpose, the Record skill experienced an explosive growth and was now over level 70. The value of this blueprint was that high.</p><br/><p>“However, you know that it will be useless without my mana, right?”</p><br/><p>“Of course, that’s why I’ll need your help, mom.”</p><br/><p>Yu IlHan transferred his knowledge he acquired from the Record skill to the Will of the Guardian who was waiting in the form of a lake.</p><br/><p>[……So I need to apply this on Earth, you mean?]</p><br/><p>“Of course, it won’t be perfect. However, you should know the lay of Earth better than most of us do, no?”</p><br/><p>[Stop with the flattery. I can only think you’re showing disdain to me.]</p><br/><p>“I’m not joking. The reason I chose you as the container for the magic formation is precisely because of that. I do know that you treated me as an obstacle, but what I’m trying to do is to maintain as a proper world. So…… let’s do this properly.”</p><br/><p>[……. Hmph.]</p><br/><p>Although it snorted, it did not deny Yu IlHan’s words. Yu IlHan laughed and grabbed Kim YeSeul’s hand to put it on the surface of the water.</p><br/><p>“Now you only need to emit as much mana as you can possibly emit.”</p><br/><p>“Would that do?”</p><br/><p>“Yeah, this guy will do the rest, amplifying and transforming it.”</p><br/><p>“Okay then.”</p><br/><p>Kim YeSeul poured her mana into the lake. The Will of the Guardian accepted the mana as if it had waited for it and started transforming its body little by little. When the entire lake emitted a faint light, Erta and Helièna, who were watching, all exclaimed as if they had waited for this moment.</p><br/><p>“Really…… I’m glad that I’m by Yu IlHan’s side. To think I can see such a spectacle… to think I could see a golem made from a lake becoming magic itself…”</p><br/><p>[My, and darling is still a lower existence. Aah, I can’t endure my beating heart. Darling, can’t you give me a kiss? Please?]</p><br/><p>Yu IlHan ignored her words. Just helping the Will of the Guardian to implement the magic made him busy enough.</p><br/><p>“You can do it, right?”</p><br/><p>[…… it’s a simple matter.]</p><br/><p>The light emitted by the lake became brighter as time passed, and the surface level eventually started decreasing. A portion of the Will of the Guardian that escaped through the underground absorbed the moisture within the grounds to become bigger, spreading slowly, but surely, throughout the various parts of Earth.</p><br/><p>[I.]</p><br/><p>It transferred its intention to Yu IlHan with a voice that was contained resolve, like the first time it attacked Yu IlHan. No, perhaps this was its declaration to all beings in this world.</p><br/><p>[Shall protect Earth.]</p><br/><p>The cause and effect predestined on Earth was delayed by a long time.</p><br/>\n</div>"}