{"title": "Chapter 274: If You Wish To Follow Me – 8", "id": 274, "volume": 3, "url": "http://boxnovel.org/everyone-else-is-a-returnee-chapter-274-if-you-wish-to-follow-me-%E2%80%93-8", "volume_title": "Volume 3", "body": "<h1>Chapter 274: If You Wish To Follow Me – 8</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>“It’s a spectacle you won’t see again so engrave it into your memory.”</p><br/><p>“I…… am doing that already.”</p><br/><p>“Oh my god.”</p><br/><p>[Wow, the ego of that golem is not an ordinary one either.]</p><br/><p>The Will of the Guardian that accepted all of the information on the magic formation, succeeded in perfectly analyzing and amplifying its effects, and spread around to the surroundings in an instant, leaving the original lake empty.</p><br/><p>As there was higher probability of destruction if it was too close to the surface, it decided to activate the magic formation around 10 kilometers deep underground, and went downwards. However, the key players who participated in this work, including Kim YeSeul, who supplied the mana, could clearly feel its movements.</p><br/><p>“The water levels are decreasing rapidly. Looks like the bottom will show at any moment.”</p><br/><p>“It’s increasing in size while absorbing water from all over the Earth, so the water levels will decrease as a whole.”</p><br/><p>Since she had finished the magic formation, there was nothing for Kim YeSeul to do. They immediately left the lake and stood on land. Even while they did that, the magic formation’s expansion was happening non-stop, and Yu IlHan was still focusing on the magic formation.</p><br/><p>“No, not yet.”</p><br/><p>“It only just covered Gangnam. No, it’s Seoul now. And Gyeongi-do…… it’s expanding at a rapid rate.”</p><br/><p>[Well, the amount of water it’s absorbing will increase as time goes. Whoaa, how fun. Can you feel a part of the magic formation we’ve created being etched into this country?]</p><br/><p>He focused his consciousness on the Will of the Guardian. No matter how far apart they were, as long as its foundation was a thought-soul, it was possible for Yu IlHan to communicate with it.</p><br/><p>[There are no problems.]</p><br/><p>‘Something always happens to those that are overly confident. Be careful and concentrate.’</p><br/><p>The magic formation beyond Korea and to Japan and China. The golem froze its body solid and was implementing the magic formation at rapid speeds.</p><br/><p>Sharing its senses, Yu IlHan felt like his head was exploding, but he suppressed the pain. He still had one more thing to do.</p><br/><p>[The mana of Earth is resisting violently, darling. I don’t think it’s going to be obediently trapped under the magic formation.]</p><br/><p>“I predicted that much. But it’s not like the magic formation is the only card I prepared.”</p><br/><p>The millions of dragon bone pillars that Yu IlHan had created. The trigger that activated them was in Yu IlHan’s hand in the form of a pendant.</p><br/><p>It was none other than a remote-control that he had created using the principles of resonance that once appeared in the Thunder hammer! The pendant that had Teraka’s skull as the base, and was decorated with his eyes, had a frighteningly strong magic power, and was flashing dangerously.</p><br/><p>“This pendant has the abilities to both suck the surrounding mana, and the power to resonate with artifacts made of the same materials. And those that belong to a special network of artifacts.”</p><br/><p>“So to put it simply, it’s like setting a channel?”</p><br/><p>“Exactly.”</p><br/><p>When he gripped on the pendant to activate it, the pendant sucked the surrounding mana and at the same time, gave a command to millions of artifacts scattered over Earth – to suck the mana of Earth and send it to Dareu!</p><br/><p>However, even Erta and Kim YeSeul couldn’t possibly feel something of a global scale, so the only one that could shiver in excitement at the destructive results that occurred from a light motion was Helièna.</p><br/><p>[Oh my, my god. How can……. Aah, wonderful.]</p><br/><p>She even felt a sense of bliss when the millions of artifacts simultaneously sucked the mana and made it disappear. Although a lot of preparation was needed, controlling the mana of a world with a single gesture made Yu IlHan look like the Supreme being that ruled over numerous worlds!</p><br/><p>“……Hm? I suddenly feel like I’ve lost my vitality a little.”</p><br/><p>“It’s not just ‘a little’. I feel that my shoulders are light as well. The mana concentration is definitely lowering.”</p><br/><p>When the concentration of mana started being lowered for real, Kim YeSeul and Erta also felt something and tilted their heads. Yu IlHan made a small smile at them and focused more. The millions of artifacts had successfully activated, so this was the perfect moment for the magic formation to act now that the mana covering Earth had become weaker!</p><br/><p>[Good!]</p><br/><p>The Will of the Guardian voiced out. The golem that already spread to three continents once again sucked the water of Earth to become bigger, and pierced the Earth’s crust to cover the entire Earth!</p><br/><p>[I will envelop everything!]</p><br/><p>“It really does suit you.”</p><br/><p>[Master really is cruel.]</p><br/><p>“It’s nothing new.”</p><br/><p>Yu IlHan closed his eyes and thought up of the figure of Earth in his head. The magic formation that was perfectly designed by Kim YeSeul, Erta, and Helièna was completed into a perfectly spherical magic formation that covered the Earth.</p><br/><p>[The magic.]</p><br/><p>Feelings the end of its body meeting another end at the other side of Earth, achieving its purpose, the Will of the Guardian voiced out with deep emotion.</p><br/><p>[Activates.]</p><br/><p>At that moment, everything on Earth became slower.</p><br/><p>“……Wow.”</p><br/><p>Yu IlHan barely managed to say that out loud. As he had made everything on Earth slower than usual, Yu IlHan was also naturally affected by the magic formation.</p><br/><p>“This is crazy. It’s like training just by being here.”</p><br/><p>“Training? Ordinary lower existences wouldn’t even be able to move in such an environment! Han YeoRang! We need to go check up on them!”</p><br/><p>Screamed Erta. Even she was feeling difficulties in moving despite the fact that she had gained insights into the manipulation of space and time thanks to working with Kim YeSeul, AND even though she had activated a magic on herself to resist it! The other lower existences wouldn’t even be able to move!</p><br/><p>However, someone denied her opinion, and it was none other than the caster of the magic, Kim YeSeul herself.</p><br/><p>“Everything on Earth has become slower, so the speed of external stimulation and the internal processing speed would equally be slowed down. So Erta, your words implying that lower existences cannot move are wrong.”</p><br/><p>Meaning, they were only moving slowly in the views of people that were aware of the slowness due to the magic formation, and the people themselves wouldn’t feel a thing. In other words…….</p><br/><p>“In other words, we are already resisting against this magic. And it’s difficult because we’re trying to ignore the slowed time on Earth and are trying to move as fast as usual. ……And tremendously quickly to boot.”</p><br/><p>He didn’t remember when the last time he sweated was, but even Yu IlHan was sweating right now. Right now, he felt like he was moving slightly slower than usual, considering that the Earth had slowed down, he was moving really fast!</p><br/><p>[That’s it, darling. Darling’s movement speeds should have decreased more than normal, no?]</p><br/><p>“Hmmm……. This is really nothing new, but we really are in a situation where science can go screw itself.”</p><br/><p>Although he had to realize that from the moment Earth was stopped by God, this time, it was his own doing.</p><br/><p>Yu IlHan once again thought that he was not ordinary. Of course, this applied more to the crux of this matter, his mother. Perhaps the Fifth they were talking about would not be him, but his mother?</p><br/><p>“Anyway, it’s two birds with one stone. The ones that cannot notice this magic will just move normally, while we, resisting against the magic, are training even while we do nothing. Hm, perfect.”</p><br/><p>“Yes. I understand that you’re a total pervert!”</p><br/><p>[However, the magic could not be more perfect. The golem called the Will of the Guardian too…… yes, has been placed well. Now that the magic formation is complete, not only are there very few ways to damage it, even if it does get destroyed…….]</p><br/><p>“It can be restored if it just absorbs more water.”</p><br/><p>Yu IlHan made a smirk. Although he was sweating a lot due to resisting against the power of the magic formation, his smirk could not be more evil.</p><br/><p>[It’s the first time I’ve seen such a perfect magic formation. No one could have done this in reality.]</p><br/><p>“You can praise me more at times like these.”</p><br/><p>[Ufufu.]</p><br/><p>Boasted Yu IlHan, unlike his usual self. Helièna giggled since she thought Yu IlHan was adorable, and Erta didn’t like Helièna’s smile and only stomped on the ground with her shoes.</p><br/><p>At that moment, there were presences of those that tried to enter Earth. Unless it was the leaders of each faction, the only one that can enter the closed-off Earth was Kang MiRae. Of course, Yu IlHan knew that it was her and did not activate the Ruler of Dimensions skill.</p><br/><p>[It seems like they’ve sensed your presence and are coming here…… oh, they’re here.]</p><br/><p>[Uaaaaaaaaaaaaah!]</p><br/><p>As soon as Helièna’s words ended, Mystic’s shouts hit everyone’s ear drums. Of course, they knew why she was screaming.</p><br/><p>“Welcome back, Mystic.”</p><br/><p>[Masteeeeeeeeeeeeer! Just what did you do to Earth!]</p><br/><p>“I made everything go slower.”</p><br/><p>[Don’t say such an absurd thing so calmly! Don’t reply to me so calmly!]</p><br/><p>Even while speaking like a machine gun, Mystic’s movements were very careful. The reason was simple – some people on board the Flying fortress could not recognize the effects of the magic formation.</p><br/><p>A tragedy would occur if Mystic moved fast while they were moving slowly! She was really wise.</p><br/><p>“Wwwwwwwwwwwwwweeeeeeeeeeeeeeeeeeeeeeee.”</p><br/><p>“Hm.”</p><br/><p>Yu IlHan found a figure of someone that was trying to shout something very slowly.</p><br/><p>The identity of this guy, that had become very strong, but was still 3rd class, was Michael Smithson, the leader of Metal Knights, one of the pivots of the Front Line Alliance, as well as the most elite guild in England.</p><br/><p>“Miiiiiiiiiiiiiiiiissssssssssssssstteeeeeeeeerrrrrrrrrr.”</p><br/><p>“Goddamn.”</p><br/><p>But he was too slow. Moving his lips moving so slowly, Yu IlHan subconsciously gripped his fist. He wanted to smack this guy on the face! Even though he knew that this guy had done nothing wrong!</p><br/><p>“It seems like I should give up on conversing with this guy under the effects of the magic formation.”</p><br/><p>“You can converse with him if you give up resisting against the magic.”</p><br/><p>“I don’t want to converse with him to the point that I have to do that.”</p><br/><p>“My son, you’re quite cold…….”</p><br/><p>“They’re coming.”</p><br/><p>Perhaps it was set beforehand that Mystic would be the one that would transport the members of the Front Line Alliance, as Yu IlHan’s party members all resisted against the effects of the magic formation and jumped down. Yu IlHan caught Yumir who came down first and patted him.</p><br/><p>“Mir, you’re holding out well.”</p><br/><p>“It’s amazing, dad! I feel like I’m training just by standing here!”</p><br/><p>“As expected of father and son, they said the exact same thing.”</p><br/><p>“Mr. IlHaaaaaaaan!”</p><br/><p>“IlHan, is this that magic? I thought you were planning to do it later, but you did it already?”</p><br/><p>“……Fuuu.”</p><br/><p>Erta made a surprised expression after seeing quite a few members resisting against the magic formation and not just Na YuNa, Liera and Kang MiRae.</p><br/><p>“It’s amazing that a lower existence is resisting this magic formation in the first place. Yu IlHan, this means that the ones by your side are all unusual.”</p><br/><p>“Of course, if they were normal, they wouldn’t have held out until now.”</p><br/><p>Yu IlHan gave a chic reply to Erta, and laughed when he saw the members that gathered around him. He ignored Liera and Helièna having a staring contest.</p><br/><p>“There’s around a week left, so please do your best until then. Let’s meet again after that.”</p><br/><p>“One week left until what?”</p><br/><p>Yu IlHan was about to reply that it was the cool-down time of the Hourglass of Eternity, but thought up of something and took it out. The hourglass was still flipped, indicating that it could not be used. Once all the sand fell to the bottom, he would be able to activate it again.</p><br/><p>But…….</p><br/><p>“Hoo, what’s this?”</p><br/><p>Unlike usual, the sand particles fell at very slow speeds. Of course, as this was a God-ranked artifact, it was resisting against the magic formation, but at this rate, they wouldn’t be able to use it even after one month passed, not to mention one week. However, this also indicated one other fact…….</p><br/><p>“This will be interesting.”</p><br/><p>“Uh, he has an evil smile again.”</p><br/><p>“Uu, that smile is so cool…….”</p><br/><p>[My, ex-angel. We agree on one thing at least.]</p><br/><p>Yu IlHan looked forward to the time he could activate the barrier again and made an evil smirk.</p><br/><p>Perhaps a profit he had never expected, and one that was huge, maybe waiting for him.</p><br/>\n</div>"}