{"title": "Chapter 288: I Will Prepare – 6", "id": 288, "volume": 3, "url": "http://boxnovel.org/everyone-else-is-a-returnee-chapter-288-i-will-prepare-%E2%80%93-6", "volume_title": "Volume 3", "body": "<h1>Chapter 288: I Will Prepare – 6</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>[This is…….]</p><br/><p>As someone who possessing the Counter skill, Lemiel immediately realized what was happening.</p><br/><p>The rain of lightning that contained immense mana were gathering to one place and were changing into a red flame.</p><br/><p>In the center of that was one human and one dragon. To be exact, Yu IlHan was utilizing even Yumir’s mana to redirect all that mana.</p><br/><p>Overwhelming the opponent with the surge of mana, Changing the ruling structure of the mana by seeping into the gaps, changing the properties by scattering the mana array, and finally emitting an overwhelming amount of physical and magical force would allow him to resonate with all the mana in his surroundings and change their flow.</p><br/><p>[You have acquired the active skill, Counter.]</p><br/><p>[The skill, Dimensional Ruler, has become level 67.]</p><br/><p>This was counter. The supreme skill that reversed cause and effect.</p><br/><p>[Such a being…… cannot exist!]</p><br/><p>“Well, I don’t know about that.”</p><br/><p>The moment Yu IlHan quietly muttered that, a red rain of fire poured towards Lemiel, who was once the controller of the rain.</p><br/><p>[You dare…… with just this much!]</p><br/><p>He clenched his teeth and unfolded the remaining half of his wings. This was because using Counter against an attack that was already Countered was a realm still far beyond his reach. This could be said to be his critical mistake for using such a grand magic.</p><br/><p>[Critical Hit!]</p><br/><p>A shield of bluish-white lightning that came from the three wings clashed against the rain of flames and resulted in a massive boom. It felt like the entire world was shaking due to the clash of enormous quantities of mana.</p><br/><p>“No way. When did IlHan get so strong……?”</p><br/><p>“His mana rose in general, but I feel like the resonance with Mir drew out the true power of dragons and both of them became stronger. But even so…….”</p><br/><p>[Amazing. I’m amazed that such an insane mana control can bring about such a change. Is the mana darling senses different to the mana I’m looking at……?]</p><br/><p>Even the ones watching could not move due to shock. Just from the blast the barrier surrounding the two fortresses cracked. Mystic poured mana into the barrier to reinforce it and screamed.</p><br/><p>[Master, you madmaaaaaaaaaan!]</p><br/><p>However, Yu IlHan’s Counter hadn’t even begun yet. Counter referred to a technique that ruled the entirety of power that the opponent had used. This meant only one thing in this situation.</p><br/><p>[The skies are……!]</p><br/><p>“My word…”</p><br/><p>The skies were colored in red. Streaks of blue lightning changed into red flames, and the ruling rights of this world was temporarily forcibly transferred to Yu IlHan from Heaven. The grand magic that utilized the power of the world was Countered in its entirety.</p><br/><p>[The skill, Dimensional ruler, has become level 70. The time to adapt to a dimension decreases, and you can draw out and rule more of the mana in the world you have taken.]</p><br/><p>[Kuuuuoooooooooooooh!]</p><br/><p>“Kugh, huk, uuugh.”</p><br/><p>Yumir roared loudly. Yu IlHan also groaned due to the violent flow of mana that assaulted him but still had his side open and raised the spear in his hand.</p><br/><p>“Echjar, cooperate! Help me out Eternal Flame.”</p><br/><p>[I comply with the Lord’s orders.]</p><br/><p>[Yes!]</p><br/><p>Echjar, who had completely submitted to him both physically and mentally, as well as Eternal Flame that acted more friendly towards him than any other subordinate. The full support from the two souls had enhanced Yu IlHan and Yumir’s mana control to the limits.</p><br/><p>Yu IlHan applied God Force into his trembling arms and bit his lips. Although he didn’t like spirituality that much, the only thing he had remaining now was his guts.</p><br/><p>“Uooooooooooh!”</p><br/><p>In the end, all the flames started to gather towards the tip of his spear.</p><br/><p>[The skill, Dimensional Ruler, has become level 71.]</p><br/><p>“Wao…….”</p><br/><p>“So beautiful. It’s the first time I see such a beautiful flow of mana…….”</p><br/><p>“IlHan……!”</p><br/><p>It was a spectacular scene where it seemed like the world itself bowed in respect for Yu IlHan. The blast of mana had all disappeared as well. Power submitted to him, and was all gathering towards one spot without a single particle remaining.</p><br/><p>[Foolish, human……!]</p><br/><p>“Hmph.”</p><br/><p>Lemiel uttered vicious words that sounded like they were from the depths of hell. Although he was aware of the energy of fire that gathered towards Yu IlHan’s spear, there was no way for him to dodge it or block it. In his current state, defending against the rain of fire was all he could do.</p><br/><p>[Kugh, dammit…… fuck, I lost to a mere human! Dammit, I’ll remember this!]</p><br/><p>In the end, he clenched his teeth and unfolded his wings. He instantly shook off the rain of fire, and activated another kind of magic even while undertaking some hits. It was a magic that allowed him to leap through dimensions!</p><br/><p>[It’s your victory. I’ll take your head next time!]</p><br/><p>“No you don’t.”</p><br/><p>The moment he was about to lose the 7th class angel just like that, Yu IlHan’s Dimensional ruler skill activated, preventing new forces from entering, but most importantly, it also prevented Lemiel from escaping.</p><br/><p>Calling for reinforcements and aiming for another opportunity was only allowed to the protagonist! He couldn’t allow a mere extra like him any more screen time!</p><br/><p>[The skill, Dimensional Ruler, has become level 73.]</p><br/><p>[You!? How can a mere mortal possess a fragment of the power to rule dimensions!]</p><br/><p>Realizing that his escape attempt had failed before he begun, Lemiel shouted in panic. Yu IlHan’s lips curved into a corner.</p><br/><p>“Hey, you put down your guard.”</p><br/><p>[What!?]</p><br/><p>If he only trusted in the Dimensional ruler skill, he wouldn’t have even started this. The moment he showed the biggest opening Yu IlHan literally called out hell unto this world with the flames. This was the biggest Falling Down he had used yet!]</p><br/><p>[Kugh!]</p><br/><p>Just where was there to run? The entire world was his enemy! Chains made of flames and souls came from his surroundings and restrained him. They restrained each of the feathers and even bound his sole arm and neck.</p><br/><p>Him being 7th class didn’t matter at all right now. An odd-winged angel that wasn’t even backed up by a higher world no longer had the power to overwhelm Yu IlHan.</p><br/><p>[A lower existence! A mere lower existence! I will kill you, I WILL KILL YOU!]</p><br/><p>The color of his eyes changed to a deep crimson. They were full of viciousness that didn’t seem to originate from an angel.</p><br/><p>The atmosphere changed. And the energy he emitted changed as well. The record skill sensed that and notified Yu IlHan.</p><br/><p>[You, cannot, I…… I, the Lord has!]</p><br/><p>“Who’s this ‘Lord’ you’re talking about?”</p><br/><p>Asked Yu IlHan. He tempered the flames that gathered on his spear and created the sharpest blade, and told the angel as though he was a professor that knew the answer, asking his students a trivial question-</p><br/><p>“Well, go ahead and answer.”</p><br/><p>[Fu, Ahahahahahahahah! So laughable, yes, laughable! Yes, I’ll answer you!]</p><br/><p>He also felt that and burst out laughing. The words that came out of his mouth next were words that Yu IlHan had anticipated already.</p><br/><p>[The Great Traitor, the Final God! The one that will cover the Heavens and the one that rules Hell! Lord Satan!]</p><br/><p>The moment he admitted that he followed the traitor, his white wings started to turn black. This was one of the rarest moments in history when an archangel corrupted himself on his own will.</p><br/><p>[Kuaaaaaaaaaaaaaaaaaaaaa!]</p><br/><p>All the mana he possessed reversed and went berserk. The chains that bound him broke momentarily, and the place where his wings were ripped off emitted black foggy energy and started being regenerated. Black blood scattered in the air to create numerous magic formations, while the flames and souls that made up the Falling Down domain burned upon contact with them!</p><br/><p>[The skill, Record, has become level 88.]</p><br/><p>“He really was a traitor!?”</p><br/><p>“Although I did believe in Yu IlHan, to think such a thing was really happening…… Just what is happening within Heaven’s Army?”</p><br/><p>“Ah, isn’t it bad when you have to acquire the records of an angel but he fell to a fallen angel~!?”</p><br/><p>While Liera and Erta were serious, Na YuNa worried about something slightly different! However, Yu IlHan shook his head and denied her words.</p><br/><p>“In fact, it’s better. I could record the moment he changed to being a fallen angel, so now I can even inversely change the records of fallen angels into that of angels. You could say that it’s a Buy One Get One Free item for multiple products.”</p><br/><p>“Wao!”</p><br/><p>[Such a thing is possible!?]</p><br/><p>That was Yu IlHan’s simple analogy!</p><br/><p>[I will kill youuuuuuuuuuuuu! With all my power as the 11th Wing of Brilliant Light!]</p><br/><p>He gave up on receiving the support of the world and fell to being a fallen angel as compensation for recovering his body. The 11th Wing of Brilliant Light. His mana went berserk and pushed back the mana of Falling Down. The chains that tried to bind him were immediately colored in black and burst out. The reason he could use more powers than he could before was probably because he was under the awakening process. This would only be a temporary thing!</p><br/><p>[He’s trying to kill you even if it costs his life! Eeek, at this rate…….]</p><br/><p>“No, it’s over. That’s his final struggle.”</p><br/><p>Everyone was trembling, but only Yu IlHan was quite calm. He poised with his completed flaming spear and aimed for the shoulder blades of the fallen angel that was slowly changing black.</p><br/><p>[Kuaaaaaaaa! Yu IlHaaaaaaaaaaaan!]</p><br/><p>“Here.”</p><br/><p>Yu IlHan threw his spear. With the master level Absolute Accuracy, the spear shot forward in a straight line and pierced its target without any delay. It was an effective strike that disallowed the black mana from interfering in time.</p><br/><p>“I’ll kill you now.”</p><br/><p>[Kahk!]</p><br/><p>[Critical Hit!]</p><br/><p>When the impaled Lemiel twisted his body, the black colored blood scattered in the air. And his very last remnants of mana were concentrated into them.</p><br/><p>[I curse…….]</p><br/><p>“Curse?”</p><br/><p>[You to death!]</p><br/><p>When the blood made a small circle, the black lightning that shot out from it flew straight towards Yu IlHan and struck him. A vicious curseful aura covered Yu IlHan. It even made him think that Lemiel allowed himself to fall on purpose, all for the sake of this attack.</p><br/><p>[Ke, Khahahahahahaha! Come with me, to the infernal depths of hell! Kugh!]</p><br/><p>And that was his last. His head drooped downwards with a bright smirk; he didn’t have the slightest worry that Yu IlHan would not die from his curse.</p><br/><p>[You have earned experience.]</p><br/><p>[You have earned the records of Lv 548 Lemiel.]</p><br/><p>[The skill, Record, has become level 89.]</p><br/><p>[The skill, Dimensional ruler, has become level 77.]</p><br/><p>Yu IlHan dusted off his armor. The black lightning that lingered on his armor after it struck his armor were all crumbled into bits by the flames after resisting against it in vain. He made a bitter smile.</p><br/><p>“He was a truly good extra until the very end. He didn’t throw any baits and left like a douchebag.”</p><br/><p>[To think he was insulted like that even after death, such a pitiful extra.]</p><br/><p>“IlHan!”</p><br/><p>“Yu IlHan!?”</p><br/><p>Liera and Erta, who felt the power of the final curse, called out for Yu IlHan in shock. However, Yu IlHan’s expression as he returned to them was too normal.</p><br/><p>“Yes, it’s all over now.”</p><br/><p>“……What about the curse?”</p><br/><p>“I won against even Echjar’s curse; there’s no way I would get killed by such a half-assed curse.”</p><br/><p>“…….”</p><br/><p>Yu IlHan collected Lemiel’s corpse without thinking much about it, and organized the world that was messed up due to the battle by sucking in some of the mana. His companions didn’t know how to react to Yu IlHan, who treated the curse that took all the remaining life force from a 7th class as ‘half-assed’, and decided to not say anything at all.</p><br/><p>“Anyway, it seems like things have gotten annoying.”</p><br/><p>Skimming through the records he had acquired from Lemiel, Yu IlHan scratched his head. He did think that Heaven’s Army was not in a normal state anymore from the moment he found out that Lemiel was a traitor, but he didn’t know it would be this bad. The more he comprehended Lemiel’s records, the more he sighed about it.</p><br/><p>“It seems like everything is happening according to my growth. Let me just catch whoever’s behind this and I’ll…”</p><br/><p>[What is it, darling?]</p><br/><p>“Well, it is a mess already but I feel like there would be even more of a mess in the future.”</p><br/><p>“More than it is now? Why?”</p><br/><p>Liera asked her question. Yu IlHan made a bitter smile and shortly replied.</p><br/><p>“It seems like God ran away from Heaven.”</p><br/>\n</div>"}