{"title": "Chapter 283: I Will Prepare – 1", "id": 283, "volume": 3, "url": "http://boxnovel.org/everyone-else-is-a-returnee-chapter-283-i-will-prepare-%E2%80%93-1", "volume_title": "Volume 3", "body": "<h1>Chapter 283: I Will Prepare – 1</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Mystic became serious.</p><br/><p>[Is there really a need for master to proactively get involved with them?]</p><br/><p>“I wanted to avoid getting involved with them for as long as possible, it would have been the best if I never needed to.”</p><br/><p>Once Earth became a higher world, the seal on it would be lifted. However, Yu IlHan had the subclass Dimensional Traveler, once he activated his Dimensional ruler skill, he could prevent other higher existences from entering Earth. Yu IlHan was only preparing for cases where the Dimensional ruler skill could not impede the invasion.</p><br/><p>And so, he thought that he wouldn’t be caught up in the conflict for the foreseeable future…….</p><br/><p>“But if I want to stop the really scary guys, I think I have to become stronger, much stronger.”</p><br/><p>[Just how strong are you going to become? You’re already comparable to the majority of 7th class beings!]</p><br/><p>“It’s because that is not enough.”</p><br/><p>In the end, the Cradle of Miracles only stimulated the energy inside him, and did not allow him to reach greater realms. No, it probably was, but the speed was so slow that it would take him more than just a millennium or two to become a higher existence like that.</p><br/><p>“I need more samples.”</p><br/><p>[So, what are you going to do specifically, darling?]</p><br/><p>“I’ll participate in whatever the higher existences are doing.”</p><br/><p>It had been approximately ten months since he did not meet with the angels belonging to the Heaven’s Army. Yu IlHan and the others were going around various worlds to gather the people of Earth, and take in the mankind of doomed worlds other than when they were training inside the barrier. From some time ago, neither Yu IlHan’s group nor Kang MiRae’s could feel the presences of the angels no matter which world they went to, not to mention other higher existences.</p><br/><p>However, Helièna suddenly said something completely unexpected.</p><br/><p>[That’s likely to be darling’s fault.]</p><br/><p>“My fault? Why?”</p><br/><p>[Didn’t the information about the main headquarters of the Army of Brilliant Light leak thanks to you? Did you really think that they would stay passive?]</p><br/><p>“But the headquarters of the Destruction Demon Army is also known to everyone, isn’t it?”</p><br/><p>[Of course, all the more reason for a mess. They should be having a blast by now.]</p><br/><p>A smile of satisfaction appeared on Helièna’s lips. Even while thinking about how Helièna’s smile could be so evil, he was afraid of himself that got used to it.</p><br/><p>“Then do we need to go to the HQ of the Army of Brilliant Light?”</p><br/><p>[That’s a no, darling.]</p><br/><p>Helièna immediately replied.</p><br/><p>[Visiting a world ruled by the leader himself is completely different from visiting a higher world. You can only go after you have, at the very least, become a higher existence. I like destruction and murder, but I would really prefer if darling didn’t die. I’ll die with you if that happens.]</p><br/><p>“……Okay.”</p><br/><p>Yu IlHan treated the main headquarters of each faction lightly until now, but it looked like there was something that he didn’t know about until now. It was alright within the Heaven’s Army, though…… Hmm?</p><br/><p>“……Now that I think about it, I never felt a being that transcended 7th class while I was in Heaven. Is that because I cannot sense God?”</p><br/><p>[Well, perhaps God does not exist after all?]</p><br/><p>“Helièna, don’t speak nonsense. God exists. ……Though, I cannot be sure about whether he really exists in Heaven.”</p><br/><p>Liera’s reply to Helièna felt dejected for some reason. She herself had her suspicions as well. Yu IlHan reached the conclusion that probing any further was not a wise thing to do.</p><br/><p>“If the main HQ is no good, we can settle for the branches.”</p><br/><p>[That’s a good idea. Higher existence factions become stronger according to the number and size of the worlds they own. And so, they should be entering a phase where they nibble away at each other’s worlds prior to the big war. Meaning, there is likely to be a war of unprecedented and truly epic proportions in the near future.]</p><br/><p>Helièna’s voice was getting agitated as she replied. Yu IlHan was slightly afraid of her now since she looked like she preferred that outcome above all else, and asked carefully.</p><br/><p>“Then wouldn’t they weaken each other out if we just wait? They’ll quit their focus on Earth too.”</p><br/><p>[What are you saying, darling? This is all a war for Earth, you know? Their final objective is Earth.]</p><br/><p>Yu IlHan was silent for a moment. He felt very perplexed. Until now, the back story about this world was always skipped without much attention, but it seemed like he couldn’t just pretend to not know about it anymore.</p><br/><p>“Talk about it, Helièna.”</p><br/><p>In the end, he asked.</p><br/><p>“Just what is up with Earth so that makes all those damned bastards aim for it?”</p><br/><p>[There was a prophecy.]</p><br/><p>“That damned prophecy again.”</p><br/><p>[So what happened was…….]</p><br/><p>Just as Helièna was about to speak, she looked around. A month and a half remained until the barrier of the Hourglass of Eternity dispersed for the eleventh time. Everyone else was focused on training or hunting monsters while those that gathered around Yu IlHan were Helièna, Kim YeSeul, Kang MiRae, Na YuNa, and Liera.</p><br/><p>[I want to talk with darling alone, so can everyone else leave?]</p><br/><p>“What are you going to do? I’m never letting you do anything suspicious.”</p><br/><p>Liera desperately rejected that, but Yu IlHan shook his hand.</p><br/><p>“I’m only going to listen to her story so don’t worry.”</p><br/><p>“That sounds interesting. Is it a story that I can’t hear?”</p><br/><p>[No, it’s meaningless for anyone other than darling to hear it. It’s best for only darling, who’s the ruler of the Earth, to hear it.]</p><br/><p>“Then I guess I can’t help it. Girls, let us give them room for now.”</p><br/><p>Kim YeSeul slowly nodded her head and made the others back off. The girls, lead by Liera, protested a lot, but they couldn’t help but back off in front of Kim YeSeul’s soft yet subtly menacing hand gestures.</p><br/><p>[Then…….]</p><br/><p>Helièna checked the surroundings two or three times again, and even proceeded to make a simple barrier before finally turning around to Yu IlHan and speaking.</p><br/><p>[The prophecy came from the Garden of Sunset. Have you heard the rumor that the leader of the Garden of Sunset possesses prophetic powers, darling?]</p><br/><p>“I guess I did.”</p><br/><p>Yu IlHan nodded after glancing towards Liera who was looking at him beyond the barrier. He had heard from her, during the war for Dareu.</p><br/><p>[Yup, his power should be real. It was also him that said that I will eventually stand next to the Fifth God as well…….]</p><br/><p>Helièna’s blushing cheeks and meek demeanor was very adorable. She was embarrassed of her emotions even while saying that.</p><br/><p>Just this made her look pure and naïve, but ‘pure’ and ‘naïve’ were words that were the polar opposite of Helièna, and Yu IlHan ended up thinking that all girls were horrible liars.</p><br/><p>[That’s why everyone is wary of the movements of the Garden of Sunset. But from some time onwards, the leader started focusing his attention on Earth, which hadn’t even experienced a Great Cataclysm yet.]</p><br/><p>“How did you know that?”</p><br/><p>[It was me who found that out. The leader of the Garden of Sunset is a man, and I could seduce any kind of man at that time! I also heard about the prophecy of the Fifth God from him then. Oh, I did have to run away right after hearing that.]</p><br/><p>“…… Sure.”</p><br/><p>The war for higher worlds happened because of that? Perhaps the reason the Destruction Demon Army, who only wanted destruction, aimed for the Heaven’s main headquarters because of that as well.</p><br/><p>It made sense. And that made him more frustrated. He finally accepted why he acquired the Record skill.</p><br/><p>[Anyway, after I learnt that, I spread the information everywhere. …… Can you ask me why?]</p><br/><p>“Why? For the Destruction Demon Army?”</p><br/><p>[No, because only when all the factions got caught up with Earth would I have a chance to meet you darling.]</p><br/><p>Yu IlHan became silent. Well, indeed. If the matters surrounding Earth didn’t become so big, he would have never come into contact with Helièna.</p><br/><p>“Huh?”</p><br/><p>The moment he realized that, his forehead twitched.</p><br/><p>The leader of the Garden of Sunset prophesized about the Fifth God, and Helièna had spread around the information to agitate all of the factions after finding out. Wasn’t that too natural?</p><br/><p>“Were you…….”</p><br/><p>[Yes. I was used by the leader of the Garden of Sunset. He used me as compensation for telling me the information that I will eventually come into contact with the Fifth God. Of course, it was much later when I realized that.]</p><br/><p>That simultaneously implied one more thing. Rather than just aiming for Earth, the leader of the Garden of Sunset…….</p><br/><p>“Intended for my growth? Before I was even born?”</p><br/><p>[Yeah, that’s the conclusion I arrived at. The Garden of Sunset, the leader at least, wanted to make you a God.]</p><br/><p>“The reason I could become strong, although it was very annoying, was because I was dropped out on Earth. Then he even foresaw that I will be left alone?”</p><br/><p>[Probably? ……Or perhaps, he may have intended for that.]</p><br/><p>Yu IlHan was dumbstruck. What was the Heaven’s Army and the Garden of Sunset’s agenda to interfere with his growth and his life? They just decided to make him a God? And started fighting over Earth all on their own…….</p><br/><p>It felt very unpleasant. He especially didn’t like the word ‘prophecy’. That was cheating. He could just say ‘I saw this coming’ or ‘I knew this would happen’ no matter what the outcome was!</p><br/><p>“But I can’t just avoid walking on the path laid out in front of me.”</p><br/><p>Muttered Yu IlHan while gritting his teeth. Whatever they wished for, Yu IlHan would do his own thing. And if possible, in a way that they didn’t expect as well.</p><br/><p>[Now, I spoke about almost everything I could, darling. ……What are you going to do?]</p><br/><p>“What do you mean what am I going to do, I’ll just continue doing what I was about to do.”</p><br/><p>Yu IlHan’s voice that replied to Helièna was freezing cold.</p><br/><p>“We’re stealing higher worlds.”</p><br/><p>[That’s not what darling originally was going to do though!?]</p><br/><p>Shouted Helièna in shock. Yu IlHan ignored her and gathered everyone.</p><br/><p>“It’s war! We’ll be preparing for war now!”</p><br/><p>Pancosmic Loner(-さん) was seriously pissed now.</p><br/>\n</div>"}