{"title": "Chapter 307: I Am Your Father – 8", "id": 307, "volume": 4, "url": "http://boxnovel.org/everyone-else-is-a-returnee-chapter-307-i-am-your-father-%E2%80%93-8", "volume_title": "Volume 4", "body": "<h1>Chapter 307: I Am Your Father – 8</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>The world changed, or at least the dragonkin born in Dareu felt so. Whether they possessed intelligence or not, the ones that were not born as dragons had their mind cleared up. Their admiration towards the absolute ruler boiled.</p><br/><p>The winged dragon that fell to the ground after it lost its control over fire, had forgotten about its pain and looked up to Yu IlHan and said in a trembling voice.</p><br/><p>[Can you, really, make me into a…….]</p><br/><p>“If it’s you who pursues power, you should know how vain and endless that path is, as well as the fact that you will give up your freedom once you come under my command, right?”</p><br/><p>[Of course. …… Even so, I want to become stronger. Even if it’s an endless road, I want to embark on it. I want the qualifications to challenge it. I…… want to become a dragon.]</p><br/><p>It became quite honest. Even though a tyrant was pressuring and forcing them into serving him mere hours or even minutes after their birth, they still couldn’t hide their desires even as they were frustrated that they couldn’t object.</p><br/><p>“Good, you should also know what you need to do for that, right?”</p><br/><p>[Kugh…… I do, I mean, I understand.]</p><br/><p>Yu IlHan liked its honest attitude. Despite being a monster, it was very humane, narrow-minded and violent, and above all, gave its entire life to someone else for its foolish greed. Wasn’t that lovely?</p><br/><p>He replied with a smirk.</p><br/><p>“Right, you’ll be the first. And hence your name will be ‘First’ as well. You will be the first dragonkin to be reborn as a dragon.”</p><br/><p>[First…….!]</p><br/><p>Despite receiving a very simple and direct name, First did not realize that and became emotional. At that moment, a strand of mana came out from Yu IlHan shook the entire world. An enormous quantity of mana gathered on one spot to begin the restructuring and as he activated his skill.</p><br/><p>[The Lv 290, First, submits to you. Accepting First as a subordinate.]</p><br/><p>[The skill, Declaration, activates.]</p><br/><p>The skill, Declaration, was an evolved version of the skills, Rule and Record. All of his subordinates receive the effects of this skill.</p><br/><p>Realizing his words into reality didn’t mean that he could make 1st class beings into 3rd class or revive the dead, but under the condition that he had enough materials, it was possible for the skill to make the impossible, possible.</p><br/><p>So, it was the perfect skill for situations like these.</p><br/><p>[Kugh!?]</p><br/><p>[What is that!]</p><br/><p>[Kyaak! Kyaaaaaahk!]</p><br/><p>Without any signs, a giant bucket appeared in midair. It was the artifact, Cradle of Miracles, that had helped him during his ascension into the realm of higher existences.</p><br/><p>The bucket had already become a God-ranked artifact after absorbing countless records and materials, and as Yu IlHan had become a higher existence, it had transformed along with him to become something more than that.</p><br/><p>[That…… an enormous amount of dragon powers.]</p><br/><p>“It’s good that you can feel it. Well, then, this is the start. You’re ready, right?”</p><br/><p>[……Yes, I am.]</p><br/><p>Yu IlHan swung his arms like an orchestral conductor. According to his gestures, the Cradle of Miracles expanded in size, and eventually became big enough to engulf First’s body and have some room left over.</p><br/><p>This would have been impossible in the past. No matter how amazing the Cradle of Miracles was, it was still in the realm of matter after all!</p><br/><p>Of course, that didn’t apply now. In his awakening as a higher existence, like how the Flamesoul Dragon Body became one with Yu IlHan, the Cradle of Miracles was tied to his soul and was bound to it.</p><br/><p>The reason Yu IlHan’s faction was named ‘Dragon’s Nest’ was not by chance. The ‘nest’ in Dragon’s Nest meant the very essence of Yu IlHan, the world on a wider scale, and on the smallest scale, it referred to the Cradle of Miracles.</p><br/><p>[Inside this…… I will?]</p><br/><p>“Concentrate. I’m not so kind as to make such a half-assed being into a dragon.”</p><br/><p>[Y, yes!]</p><br/><p>First shut its mouth. The Cradle of Miracles didn’t stop at just becoming big, and it opened its ‘mouth’ as if it was alive, and swallowed First whole. First’s figure couldn’t be discerned from the outside.</p><br/><p>[It died!]</p><br/><p>“No it’ hasn’t.”</p><br/><p>Yu IlHan snorted at the dragonkin that were shivering in fear and flew above the Cradle of Miracles. Like the time Yu IlHan had been reborn into a higher existence, the Cradle of Miracles had formed a gigantic red egg and protruded out a long straw towards the sky. It was as if looking at one of those pipes that divers used to breathe.</p><br/><p>“Kuh.”</p><br/><p>Yu IlHan slashed his finger above it. A few drops of burning red blood was sucked into the straw. Yu IlHan’s wound healed and when the blood was about to be sucked into the Cradle, the Cradle of Miracles, in the form of a red egg, beat out once like a heart.</p><br/><p>“You watch too.”</p><br/><p>He winked towards the dragonkin that were still suspicious of him. At this point, they should have realized that Yu IlHan wouldn’t have gone through all this if he was just going to deceive them and use them and simply bind all of them forcibly through mana, but perhaps they weren’t as intelligent as dragons after all.</p><br/><p>[Aaaaaaah.]</p><br/><p>At a good time, First’s moans could be heard. The moan was half from the pain of having its body transformed, and the other half from the joy of its records growing at a fundamental level. However, Yu IlHan knew that this was just the beginning.</p><br/><p>[Khaaak, Khaah! It hurts! It hurts……! It’s good but it hurts!]</p><br/><p>“You can’t help having it more painful since both your qualifications, records, mana, and level are lacking. To become a dragon in the truest sense, you’ll have to level up at least 10 more times.”</p><br/><p>[Kugh, Khuuugh, Haaaaaaaah!]</p><br/><p>Not too long after, a single crack appeared on the egg. For Yu IlHan, who had expected it to take several hours, it was quite a surprising result. It seems like its desire for power and to be a dragon was not on a normal level.</p><br/><p>[A, aaaaaaaah.]</p><br/><p>The red egg cracked all the way down before splitting in half. This was the moment a dragonkin transformed into a dragon, as well as the moment when the limitations of species were surpassed.</p><br/><p>[O, ruler!]</p><br/><p>“That was quick.”</p><br/><p>First was at that place. Standing on its two legs, it possessed an even bigger and redder pair of wings than before. Starts glistened in its red pupils. Its intelligence probably rose as well. Yu IlHan asked with a smile.</p><br/><p>“How do you feel?”</p><br/><p>[Truly…… truly great, o, ruler.]</p><br/><p>Not all dragons were fat and had short limbs. Just looking at Yumir, he had an agile body that never gave off the feel that he was fat despite being huge, and had long arms and legs as expected of a fighter that fought in close combat.</p><br/><p>[It really…… became a dragon.]</p><br/><p>[How? How did it overcome the limitations of species?]</p><br/><p>[Then I too.]</p><br/><p>[Krrrr, krrrrraaaaaaaaahhhhhhhh!]</p><br/><p>[I, too, I also want to become a dragon……!]</p><br/><p>The reaction that Yu IlHan had expected started appearing. First felt the gazes on itself and expanded its two wings wide and shouted in joy while flying into the air.</p><br/><p>[Kraaaaaaaaaaaah!]</p><br/><p>[Roar! A dragon’s roar……!]</p><br/><p>[It’s a dragon! A dragon!]</p><br/><p>First had a body that was like a shrunk version of Yumir’s. As it was originally a winged dragonkin specializing in flight, its wings developed more than its limbs, but it had transformed fundamentally.</p><br/><p>Not only the outside, the unstructured, boiling mana had become more refined and was coursing through its body, and the flames that it controlled from the moment it was born were even amplified thanks to Yu IlHan’s influence. Since it awakened under Yu IlHan’s management, it should be much stronger than ordinary higher existences of other factions that had just become level 300.</p><br/><p>[I have become a dragon! I have become strong! And I will become even stronger!]</p><br/><p>[I…… me too! I want to become a dragon too!]</p><br/><p>[I shall follow you! No, o, mighty ruler! Let me serve you!]</p><br/><p>The ones that watched as First actually transformed into a dragon all widened their eyes and rushed towards Yu IlHan. Some of them thought that even seemed to think that all they needed to do was to enter the Cradle of Miracles and entered the cracked Cradle of Miracles and rubbed its body all over it. Yu IlHan shook his hand with a laugh. The Cradle of Miracles burned in place and disappeared.</p><br/><p>“You don’t think that was such an easy feat, right? I do not know how many of you possess qualifications like First does.”</p><br/><p>Of course, that was all bullshit. With the power Yu IlHan possessed in Dareu, making dragonkin into dragons was not such a difficult task. Of course, as he had to consume the power of records he possessed, he shouldn’t be able to do it infinitely, but if the ones that became dragons piled new records under him, then it would result in overall gain and not a loss.</p><br/><p>“The point is that only the those who grow until the end have the qualifications to become a dragon.”</p><br/><p>[I am prepared to do anything, my lord.]</p><br/><p>First, who came back down after immersing in its joy of being reborn into a dragon, folded its wings and submitted in front of Yu IlHan.</p><br/><p>It wasn’t just because it felt appreciation towards him. In the process of becoming a dragon, and by the time it was completely recreated into a dragon, it felt the true power of Yu IlHan, and felt that it was by Yu IlHan’s grace that he came here to talk to them in the first place. To speak of it simply, it was abiding by the logics of power.</p><br/><p>[M, me too!]</p><br/><p>[Kroaaaaaaaaar!]</p><br/><p>[I, I also want to do it!]</p><br/><p>[I will do anything, if it’s to escape this body!]</p><br/><p>[I also…… want to become as handsome, strong, and wise as First!]</p><br/><p>“Wow, I’m popular.”</p><br/><p>Perhaps, if the Great Cataclysm never occurred on Earth, Yu IlHan would have made quite a living being a host on some home shopping channel? Well, under the condition that the camera could catch him that is! Yu IlHan put away his thoughts there and looked back at the dragons.</p><br/><p>“I actually have one thing I want you guys to take care of. Hey, your siblings are coming too.”</p><br/><p>[Siblings……?]</p><br/><p>First realized something after questioning and raised its head. The other dragonkin did the same.</p><br/><p>From the moment Yu IlHan decided to use the Manifestation skill, he was spreading his presence all around to call for dragonkin. If there was a trivial problem, it was that the skill was too powerful, and was calling for all the beings on Daeru and not just dragonkin.</p><br/><p>[Dad!]</p><br/><p>[Father!]</p><br/><p>[Khaaaah! A strong dragon, I can feel the power of dragons!]</p><br/><p>[Master, just what is……!?]</p><br/><p>“IlHan, what is up? Did those strange things attack us again!?”</p><br/><p>[Master, is it a battle!? Even though you just told us to rest!?]</p><br/><p>The dragons that went off to fight dragonslayers with Yumir, as well as the monsters with dragon-slaying powers, the ones that came out from the Flying fortress after feeling the aura of strong dragons, as well as the others! Mystic thought that situation was urgent and even brought both of the fortresses.</p><br/><p>“First, you know what you and the other dragonkin need to do now, right?”</p><br/><p>Yu IlHan waved his hand to greet the others while checking with the dragonkin here. They all nodded in acceptance. Although some of them showed signs of fear, they couldn’t retreat now.</p><br/><p>Prove your qualifications if you want to become stronger. Isn’t it simple and reasonable?</p><br/><p>[Understood, my ruler.]</p><br/><p>First unfolded its wings again and flew up. A strong power of fire gathered in its mouth.</p><br/><p>[I shall punish all enemies that dare to go against the ruler.]</p><br/><p>[If it’s to become a dragon!]</p><br/><p>[If I have to disappear like that, I’d rather resolve death and fight!]</p><br/><p>[Kraaaaaaaahn!]</p><br/><p>[Wh, what is it!? Aren’t we fighting these guys? What is going on!?]</p><br/><p>Like that, the battle between the ones that wanted to live in Dareu commenced. It was a battle that was comparable to the creation mythology!</p><br/>\n</div>"}