{"title": "Chapter 322: I’m One That Closes The Curtain – 6", "id": 322, "volume": 4, "url": "http://boxnovel.org/everyone-else-is-a-returnee-chapter-322-i%E2%80%99m-one-that-closes-the-curtain-%E2%80%93-6", "volume_title": "Volume 4", "body": "<h1>Chapter 322: I’m One That Closes The Curtain – 6</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>‘It’s a beautiful day outside. Clouds are floating under the endless skies, and the birds are singing.’</p><br/><p>[On days like this, Angels like you…….]</p><br/><p>Yu IlHan extended his hand into the air. Eternal Flame and Echjar’s breathing synchronized and the two of them released mana simultaneously. The energy of dragons and the energy of flames fused into one to form a huge wave of force, in the very next moment, Yu IlHan’s domain was declared in this world that had lost its master.</p><br/><p>[……Should be burning in hell!]</p><br/><p>Along with the Declaration skill, the Manifestation skill activated and colored an extremely small portion of the vast world into the color of Yu IlHan’s aura. It was a dominating scene, but Liera, who was watching, screamed.</p><br/><p>“Dangerous! We’ll really be sued!”</p><br/><p>“I re-arranged it so it’s fine.</p><br/><p>Yu IlHan was no longer a lower existence. He was the master of the vast world known as Dareu, and was also the lord of all dragons! His records were depthless and vast, naturally, the reserve of mana which he possessed was also in a completely different dimension from before. With such mana taking over a portion of Heaven, what would happen? All beings, that is, all the angels of Heaven, recognized his presence.</p><br/><p>[This, absurd……!]</p><br/><p>[A leader has attacked directly!?]</p><br/><p>[E, emergency! It’s an emergency! A leader of a higher existence faction…… Yu IlHan! My God, Yu IlHan from Earth has!]</p><br/><p>“You didn’t know I’d invade the last stage first, did you? All plot foreshadows in the world can go eat shit!</p><br/><p>However, what Yu IlHan was doing wasn’t anything new either. Until now that is!</p><br/><p>Yu IlHan shouted in satisfaction after seeing the angels rushing towards him. He brought up his ruling power through the Declaration skill!</p><br/><p>[From this moment on, and for only this moment, there will be a grand event for the announcement of Dragon’s Nest’s existence!]</p><br/><p>Such light words, were not something anyone would expect from a leader of an entire organization. But,</p><br/><p>[Recruiting new members to join Dragon’s Nest! As long as your records are intact, it’s fine even if you completely fall to a lower existence! From an angel into a dragon, an opportunity to be reborn into a cooler self! There are not that many chances nor there is much time, grab your tickets now while they are still available!]</p><br/><p>[What……?]</p><br/><p>Thought light words, his meaning behind them struck Heaven strong. Of course, the majority of the angels snorted at his words, but none thought that he was lying. Angel to a fallen angel, fallen angel to a gatekeeper. There were plenty of precedents.</p><br/><p>It was just that they thought that Yu IlHan was struggling to increase his forces since his faction was relatively new.</p><br/><p>[This world is the main camp of the Heaven’s Army! I can commend you for having the talen to become a higher existence on your own, but how dare you try to drag angels into becoming mere reptiles! In God’s name, we the angels shall pierce you until you die!]</p><br/><p>[Stab the eyes of that cretin and pull his heart out! Envoys of God, it’s time to execute!]</p><br/><p>So there were so many angels in the main army. Yu IlHan made a bitter smile while looking at the angels that couldn’t be counted with just thousands or tens of thousands. Well, he did know that it was a rather crucial time, but why were they all stuck at home when they had so many lower worlds to attend to?</p><br/><p>It seems like these guys needed a rather striking awakening. Yu IlHan resolved himself and brought up his mana once again.</p><br/><p>[I shall bind myself with the power granted unto me.]</p><br/><p>“I thus declare, [I cannot lie.]”</p><br/><p>[Nonsense!]</p><br/><p>He bound himself through Declaration. With this, he could really not lie. Using his power to restrain himself… such a foolish thing to do!</p><br/><p>However, he needed that right now.</p><br/><p>[God is no longer in Heaven. Your God is creating a new army in order to erase everything. You are all abandoned as a failed project. To the God of Heaven, you are merely luggage that will get in his way.]</p><br/><p>[Nonsense!]</p><br/><p>[H, how dare you try to taint the name of the LORD……!]</p><br/><p>[I shall tell speak again.]</p><br/><p>Yu IlHan’s lips curved into a thick smile. With the ensemble of Declaration and Manifestation skills, his expression could be seen from anywhere in Heaven, and his voice was omnipresent.</p><br/><p>[I do not lie. The God of Heaven has abandoned all of you.]</p><br/><p>[Y, you……!]</p><br/><p>[Kill him! Punish the evil cretin that taints the name of the Creator!]</p><br/><p>The 7th class archangels that were so hard to see normally appeared all of a sudden here and there. As expected of the biggest faction. Even though Yu IlHan had killed and stolen away many of them, there were so many high-ranked angels left. They were one frightening force alright.</p><br/><p>[How dare you lie!]</p><br/><p>[He’s a leader that just ascended! Bring down that false God and butcher him! Such is God’s orders!]</p><br/><p>[I declare in the name of Archangel Miriel! He’s an evil that we must eliminate, more so than Satan!]</p><br/><p>There’s no way Yu IlHan’s voice could reach them so easily when they denied everything. However, he could still see ripples here and there. Now, it was time to deal the strongest strike.</p><br/><p>[Open your eyes and see for yourselves. Open your ears and listen carefully.]</p><br/><p>Yu IlHan’s lips still retained its smile. Mocking their foolishness, he extended one hand toward his side.</p><br/><p>[From where did your so called ‘orders’ come from? I can guarantee that they were from the Four Great Archangels rather than God. Isn’t this true, Uriel?]</p><br/><p>“Yes.”</p><br/><p>[……What?]</p><br/><p>[Lady, Uriel……?]</p><br/><p>He had the strongest trump card that could strip all their falsehood, namely, Uriel. Under Yu IlHan’s orders, she stepped forward but still glared at him once.</p><br/><p>“Quite the vicious person you are. You could have told me about this beforehand.”</p><br/><p>“That’s no fun though.”</p><br/><p>“You really…… take after Gabriel.”</p><br/><p>She finally realized what Yu IlHan needed her for, accepted it and joyfully played her part. Poaching angels! There was no way she would refuse this. In fact, this was natural. Since she had revealed her identity and left Heaven, what was there for her to fear! What was there for her to hesitate! If she could draw in the feeble and ignorant companions to her side without killing them, what was there for her to be indecisive about!</p><br/><p>A ripple spread around to all angels that formed the Heaven’s Army.</p><br/><p>[No way, there’s no way it’s her.]</p><br/><p>[It’s a lie, she’s a fake! There’s no way Lady Uriel of the Four Great Archangels has joined that evil cretin…….]</p><br/><p>[It’s a lie. It’s false. It’s Yu IlHan’s deceit…….]</p><br/><p>“I am Uriel. Everyone, I could not reveal my true feelings until now in fear of Michael’s power. However, please listen.”</p><br/><p>Uriel looked down at everyone with her brilliant looks so that anyone could realize it was her. Four pairs of dragon wings being unfolded behind her was a grand spectacle. Everyone could feel her league, grandeur and mana.</p><br/><p>[8 wings…….]</p><br/><p>[That. That’s a lie. That is not Lady Uriel. She isn’t an 8th class either. It’s a dragon! There’s no way a dragon’s wings can represent her league!</p><br/><p>“I.”</p><br/><p>Uriel’s nonchalant, yet firm voice broke all suspicions and doubts.</p><br/><p>“Am Uriel herself; one of the former Four Great Archangels, and am now a dragon of the 8th class. I am here to prove the absence of God. The God of Heaven is in no way, the Creator, nor was he a good ruler. He’s merely a tyrant attempting to erase all worlds and create a garden of puppets.”</p><br/><p>[No! That isn’t true!]</p><br/><p>[There’s no way that is the case…… Please, Lady Uriel!]</p><br/><p>[Please tell us that it isn’t true! Ooh, please!]</p><br/><p>Whenever Uriel spoke a line, angels could be seen struggling in various places. They could probably no longer reject Uriel herself as the angels, and even high angels and archangels, no longer tried to attack them.</p><br/><p>Yu IlHan thought that it was about time where he could enjoy some popcorn.</p><br/><p>“This is quite interesting to watch.”</p><br/><p>“Darling. I thought that too.”</p><br/><p>“Aah, how did I end up falling for such…….”</p><br/><p>“I keep feeling like we’re the bad guys!”</p><br/><p>However, Uriel’s mass-range mental attack had just begun.</p><br/><p>“Please listen to my words. The Lord of Dragon’s Nest, Yu IlHan, that you see right here is very rude, arrogant and egoistic, but is a person that tries to protect all who enter his service. Just with that, he is worthy for us to serve!”</p><br/><p>“What the hell was that!”</p><br/><p>The mental attack did a collateral damage! However, Uriel ignored Yu IlHan’s sharp glare and continued.</p><br/><p>“We had to endure too much sadness until now, and had to watch as countless lives were sacrificed. Order was broken, while law had collapsed. God is attempting to bring doom to all worlds for his desires!”</p><br/><p>Uriel gave a glance to Yu IlHan. Yu IlHan understood her intentions and took out an intact body of Legna from his inventory. A deformed ring of light and twisted pairs of wings made the angels drink a gasp of air after looking at it. None of them had the Record skill, but could vaguely estimate what power it possessed, and how it was created.</p><br/><p>Uriel’s voice maxed out in rage after looking at Legna.</p><br/><p>“This is his new army. We were…… abandoned. He was never the Creator. He requested sacrifices for the greater good, but his ideal of a greater good was merely for the sake of furthering his own trivial desires! Angels of the Heaven’s Army! Please listen to my words……!”</p><br/><p>Uriel’s eyes glistened in tears. She could probably win the leading actress award with that.</p><br/><p>“Please, do not accept any more sacrifices in vain. By the side of this immature ruler, please protect this ugly yet oh so beautiful world!”</p><br/><p>“Hey, I sense thorns in your words.”</p><br/><p>Uriel ignored his words again and wiped away her tears again. With that, the world temporarily regained its peace. The flames that composed Yu IlHan’s domain was still burning but the angels no longer felt a sense of rejection towards them.</p><br/><p>Was Uriel’s heartfelt persuasion transmitted to them? Little by little, some angels threw away their hostility and approached Yu IlHan and the others. Of course, they could not achieve their objective.</p><br/><p>[I will not accept it even despite that.]</p><br/><p>A voice that snapped the wills of all resounded across the sky. Yu IlHan felt that it was his turn and raised his head.</p><br/><p>He was there. The one that ruled fire, and was the greatest in this God-less world.</p><br/><p>“I knew you’d be here around this time, Michael.”</p><br/><p>[I never knew you’d so fearlessly rush into Heaven. However, Yu IlHan, do you not know that this place is where all power of Heaven is focused? Do you really believe that I only have the power to brawl mindlessly?]</p><br/><p>Michael was inferior to Yu IlHan in all aspects. His flames obeyed Yu IlHan instead and all of his artifacts were influenced by Yu IlHan. However, that was different in Heaven where God’s power ruled. Holding onto the name of ‘God’s executor’, he possessed the largest fragment of God’s power and would possess a power and mana that equaled any other supreme being!</p><br/><p>However, Yu IlHan’s expression was still calm even after feeling that vast power.</p><br/><p>“I’d be disappointed if that were the case. You lived countless times more than me but there’s no way you can only get into brawls.”</p><br/><p>[Then you came here knowing all that? Even accompanied by a traitor……!]</p><br/><p>Michael’s gaze on Uriel glowed strangely. Oh, from his sticky gaze, it seems like they weren’t in a simple relationship either. Yu IlHan instinctively felt so.</p><br/><p>[The fact that Uriel, you are there means that Gabriel is also a traitor! Yes, Gabriel! So he’s the one leading the Garden of Sunset! So you two deceived the Heaven’s Army, the world, and even the Akashic Record!]</p><br/><p>“It is you who deceived us. Why did your mind change? You were shining brightly and purely when we promised to protect the world with our power and declared God as wrong!”</p><br/><p>Shouted Uriel. All angels looked at Michael. They requested an answer from him.</p><br/><p>[I am the same as that time.]</p><br/><p>Claimed Michael.</p><br/><p>[God, has definitely chosen a wrong path. I had to turn my back on him in order to protect his dignity. And yes, I still haven’t changed my mind about that. I will protect the current world.]</p><br/><p>“Then why!”</p><br/><p>[And I will stand above him.]</p><br/><p>“What…… was that?”</p><br/><p>Uriel asked back. At that point Michael’s body was wrapped by a mysterious brilliance.</p><br/><p>[I have been enlightened after a bout with that trivial being. I have realized the power I need, and took it. With that, I have become anew. Yes, now that all are looking at me, this is the right time.]</p><br/><p>“Michael……?”</p><br/><p>Uriel panicked. In her scenario, she had no line to counter against Michael’s craziness! However, Yu IlHan made a thick smile after looking at him.</p><br/><p>“Good, now this is done.”</p><br/><p>“What is done, Lord?”</p><br/><p>[I shall stop being an angel, Uriel! I will transcend fire and become light! I! AM GOD!]</p><br/><p>Michael released a blinding brilliance. As he had said, everyone could see the fire around him subliming into light.</p><br/><p>Everyone realized. It wasn’t just pure magic power. It was a phenomenon when a being stepped onto a new realm.</p><br/><p>Michael was now reaching the position of God from being just an executor who worked for him. He took in God’s power, and absorbed all the records necessary for him to ascend and reached the realm of supreme beings!</p><br/><p>[The God you want, is here. You need not doubt, nor worry. You shall follow me!]</p><br/><p>Five wings of light sprouted behind Michael’s back. It was a dominating scene. Realizing one’s own powerlessness and growing… that was only allowed to main characters though! So Yu IlHan wasn’t a main character after all?</p><br/><p>“Lord, everything has gone wrong! We need to run!”</p><br/><p>“What do you mean run. It just became easier to differentiate between ally and enemy.”</p><br/><p>However, Yu IlHan was still as calm as ever. His gaze towards Michael that ascended to the realm of transcenders even looked like a girl in love.</p><br/><p>“I was worried that he might not hold out because he was so weak. But with this, I’m relieved. At least he won’t die until I kill him.”</p><br/><p>His calmness even dropped Uriel’s nervousness into naught! She asked, given up.</p><br/><p>“……Lord, do you have anything that you’re afraid of?”</p><br/><p>“Of course I do. Mom being angry is one of them? So don’t go seducing my dad okay?”</p><br/><p>“……”</p><br/><p>Uriel gave up on understanding. At the same time, Michael held up a spear of light and pointed it at Yu IlHan, while Yu IlHan leisurely created a spear of flames in retaliation.</p><br/><p>[I shall kill you and bring order to the universe!]</p><br/><p>“You must have killed me a thousand times over using words alone! Why don’t you come at me for real this time!”</p><br/><p>[As you wish! Die, Yu IlHan!]</p><br/><p>Two spears swung against each other. With a vast distance between the two, two transcenders clashed.</p><br/>\n</div>"}