{"title": "Chapter 335: Harmageddon – 11", "id": 335, "volume": 4, "url": "http://boxnovel.org/everyone-else-is-a-returnee-chapter-335-harmageddon-%E2%80%93-11", "volume_title": "Volume 4", "body": "<h1>Chapter 335: Harmageddon – 11</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>When Kim YeSeul opened her eyes, she was met with an endless sea of flames. Her front, back, above her, below her, left and right – each and every side was tinted a bright red. She was momentarily afraid that she would be burnt to death, but ended up being confused since it felt more comfortable than anything.</p><br/><p>She remembered having felt this once before, and realized that it was during the process in which she became a higher existence through the Cradle of Miracles.</p><br/><p>She finally realized what was going on. Yu IlHan had definitely activated Declaration along with Creation and threw the Cradle of Miracles high up into the sky, and due to that, Dareu and Earth started being tied into a single entity.</p><br/><p>Just what exactly happened after that? She was scared because she couldn’t see anyone else in her surroundings. However, it was mysterious since she could clearly feel Helièna’s hand and Erta’s hand in each of hers.</p><br/><p>Wait, hands? She muttered carefully.</p><br/><p>“Erta, Helièna, can you hear me?”</p><br/><p>“Probably.”</p><br/><p>“It seems like darling is doing his best to protect all of us.”</p><br/><p>“Fuu, so that’s what’s happening…… I wish he could have done it in a…. calmer way.”</p><br/><p>This was probably a type of interspace created by the Cradle of Miracles. Even right now, a horrifying scene of mana going haywire and matter and non-matter being assimilated with each other. Yu IlHan had chosen this method to protect all the members of Dragon’s Nest.</p><br/><p>[You have stopped your calculations. The great leader is wishing for the completion of this magic formation. O, mage, please hurry up.]</p><br/><p>“Yes, let’s keep going.”</p><br/><p>Kim YeSeul held onto her faint consciousness and continued calculating the magic formulae. She had to calculate the total mass of energy as well as the surface area and epicenter of the world that would be born after Yu IlHan compressed the entirety of Daeru, and had to complete a spherical magic formation before then.</p><br/><p>[The two magic formations shall become one. You shall mark the center of the world.]</p><br/><p>His son’s Declaration could be heard from an unknown place. The Creation abilities it possessed instantly amplified the power of the Will of the Guardian. Kim YeSeul soon realized what the two magic formations were referring to. It was the ancient elven magic formation that covered the entirety of Dareu (aka ‘carpet), and the body of the Will of the Guardian.</p><br/><p>[Khaaaaaaaaaaah, just what is this insane lump of power, and records! Before I am a magic formation, I am a golem! You gave me such a huge burden! Yu IlHan, my master and my most detested enemy! You force upon me unspeakable pain even after I stood on your side!]</p><br/><p>“Please hold on for a little. I’m calculating now!”</p><br/><p>“But it’s still too hard. Unless Yu IlHan forms the vague outline of the world……!”</p><br/><p>“You know that it isn’t so easy to do, lady.”</p><br/><p>“We can do it. We only need to formulate a universal magic formula that can be applied anytime, anywhere. Don’t we?”</p><br/><p>“That’s easy for you to say……. But fine. We have to do it.”</p><br/><p>“Good, let’s do it.”</p><br/><p>The two mages gathered their heads. The Will of the Guardian accepted their intentions even under the intense pain that almost made its mind go black and changed form continuously, while clenching its teeth in order to settle down in the incubating world.</p><br/><p>[What I wish to protect, what I wish to see is Earth……! Let’s see whose will is stronger!]</p><br/><p>***</p><br/><p>Kang MiRae too, was thrown into the red interspace. She made a bitter smile while feeling a string of mana that connected her to the gate.</p><br/><p>The gate was pressuring her as if it would shrink and close at a moments notice, and maintaining that with massive amounts of mana without resting for so much as the smallest fraction of a second made her feel like her mind would shut off first before the gate did.</p><br/><p>However, Kang MiRae didn’t give up. She was the lord of mana, and a dimensional mage. If she couldn’t maintain a single magic, then she wouldn’t be qualified to call herself a mage anymore.</p><br/><p>“Because no one helped him, that he prepared everything so that he could do everything himself, huh…….”</p><br/><p>Kang MiRae ended up laughing after muttering what Yu IlHan said last time. She once wondered why she was so attracted to Yu IlHan, but thinking about it now, it was so obvious. Kang MiRae and Yu IlHan were similar fundamentally.</p><br/><p>‘Everyone flattered me and tried to do everything for me because of my family backing, so it was hard to properly judge my own value.’</p><br/><p>She wanted to be acknowledged with her abilities alone. Without any assistance from her family, her father, her brother, or her friends, she wanted to stand with her own power, and put the best of her efforts in everything. Although their motivations were the complete opposite, Kang MiRae and Yu IlHan’s actions ended up following the same pattern. Quite ironic.</p><br/><p>‘So that’s why I was attracted to him. I finally get it now.’</p><br/><p>Honestly, she thought that the reason didn’t matter much, but still felt refreshed after knowing exactly what happened. At the same time, an assurance of some kind, or the thought that leaving things this way was fine, smeared into her body.</p><br/><p>Even though maintaining ‘Galactic Trajectory’ brought her a tremendous headache, Kang MiRae made a bitter smile. She raised her staff high, and closed her eyes after putting one of her hands onto the Crown of Wisdom.</p><br/><p>“It was possible to connect two separate dimensions, so it should be possible to make two into one. Please let me be of help to Mr. IlHan. My will shall blossom into hope.”</p><br/><p>Rainbow-colored magic power was added on top of Galactic Trajectory. Her outrageous attempt at going beyond just connecting two dimensions but to fuse two dimensions into one became another small miracle.</p><br/><p>***</p><br/><p>Na YuNa, who had also been thrown into the red interspace as well, did not panic at all. Her power of miracles was currently closely connected with Yu IlHan, and she could feel vividly what he was doing.</p><br/><p>“Huh?”</p><br/><p>Rather, what surprised her was a strand of thought-soul that approached her through her miracle. She was very familiar with this thought-soul, and it was very warm, and exuded a sense of beauty simply with its presence.</p><br/><p>[YuNa, I’m not dead yet.]</p><br/><p>“Huh, Lady Leytna. I thought you were completely dead~.”</p><br/><p>[Just how can you be so rude with every single sentence you speak. Well, you were born pretty so I guess you can’t help it.]</p><br/><p>This was the moment the reason behind Na YuNa’s blessing was clearly revealed. Na YuNa went a step further.</p><br/><p>“I think I’m prettier than you right now, Lady Leytna.”</p><br/><p>[Hmm, I admit that.]</p><br/><p>“It’s not only that. You saw my man, right? He’s so cool. He’s probably one of a kind, whether it’s the past or the future.”</p><br/><p>[Well, yeah. In the current world, that man was indeed the best. But that man still isn’t yours though.]</p><br/><p>“He will be soon!”</p><br/><p>[Mm…….]</p><br/><p>Leytna seemed to ponder a bit before speaking.</p><br/><p>[You can’t just go at such a man with just a face. I thought that was enough before, but it didn’t turn out to be the case.]</p><br/><p>“Then what do I need to do?”</p><br/><p>[You can’t go with just a face, but an insanely pretty face!]</p><br/><p>“Ah!”</p><br/><p>Na YuNa gained enlightenment after hearing Leytna’s weird advice. So that’s it! If Na YuNa was waaaaay prettier than Liera or Helièna, to the point that she was pretty enough that no one could not look at her, then Yu IlHan would have shown a reaction much earlier on! Leytna’s teaching came down on the foolish Na YuNa, hard.</p><br/><p>[No matter how pretty you think you are, you got to make yourself up a little more, and bless yourself with miracles every time you wake up, before you eat breakfast, after you eat breakfast, as you brush your teeth, as you put on makeup, as you do your business, as you walk, before you eat lunch, after you eat lunch, and every other bit of time you have and try to make yourself prettier! You are still too naïve, too arrogant!]</p><br/><p>“How can this be! I was so foolish. I thought I was the top beauty since you died, but I still have a long ways to go!”</p><br/><p>[If you keep my words in mind then you will be able to seduce that man. He’s a good man so you can’t let go of him. It will be an embarrassment for the goddess of beauty if you let go of such a man.]</p><br/><p>“I’ll keep that in mind, lady Leytna!”</p><br/><p>At that time, a strand of warm energy entered Na YuNa’s body. She realized this was the final bit of power that Leytna possessed.</p><br/><p>“Thanks, Lady Leytna.”</p><br/><p>[I’ll really go and die now. Oh, can you tell your man that we thank you for liberating us?]</p><br/><p>“Then I can’t listen to your voice from now on?”</p><br/><p>[In the future, when your man can sense records that are unrecordable, perhaps we may be able to meet once again.]</p><br/><p>“Records that are unrecordable…… So that’s it. It works like that.”</p><br/><p>“Recorded gods”? How funny was that. Akashic Record called them ‘gods’ because they surpassed the limits of what it could record because they were too exceptional in a single field, and there would likely be no successor to them in the future.</p><br/><p>But the ignorant could not accept that their vision was narrow and degraded the beings that transcended records by referring to them as ‘recorded gods’. There couldn’t be a more foolish thing.</p><br/><p>“I think that much will be able to work on Mr. IlHan~.”</p><br/><p>[Yes, that’s it. Your faith will make the impossible possible, and become your man’s power in the name of ‘miracles’. Do your best, the new goddess of beauty. I’m tired after all this time. I want to rest now.]</p><br/><p>“See you later, lady Leytna.”</p><br/><p>Na YuNa bid farewell with a bright smile. That voice didn’t go anywhere and only remained in Na YuNa’s consciousness. Leytna’s will had appeared in her consciousness after all.</p><br/><p>[Yes, see you later.]</p><br/><p>Then she disappeared, as quietly as she had arrived. Na YuNa made a smile, and added more miracles with her newly acquired power.</p><br/><p>[Mana that follows me, all creation that has fallen for my beauty! Please help the one I love, please make everything that he wishes to do, possible!]</p><br/><p>***</p><br/><p>Yu IlHan closed his eyes. Fusing two equal worlds into one is already hard enough, but right now, he had to drag Earth’s position up to where Dareu was, when it was overwhelmingly inferior in comparison.</p><br/><p>If he could just mix in any way possible, then he wouldn’t have used a difficult magic like Galactic Trajectory. Neither would he have had to ask Na YuNa for miracles.</p><br/><p>[You are both mine.]</p><br/><p>Perhaps what he was doing had similarities to cooking. Since the results of cooking differed a lot according to the amount of ingredients put in.</p><br/><p>He had to be delicate, precise, and sincere. Though, this wasn’t something he should say since he learned cooking through trial and error, but since he understood the essence of cooking with the help of the Akashic Record, he was, in any case, at the very peak of cooking!</p><br/><p>[So you shall become equal through me.]</p><br/><p>Just why did I do a Declaration like this one – the moment he uttered that line, Yu IlHan regretted it. Well, yes. Through the ruler, Yu IlHan, it was indeed possible to equalize the two worlds, but didn’t that mean that the power of Dareu that was completed would assault Yu IlHan once again!</p><br/><p>However, this was the only method, screw it all! Either all of his thoughts will halt, or the two worlds will be complete as one.</p><br/><p>At that time, an unexpected source of support came. The dimension magic that Kang MiRae used synchronized not just Earth and Dareu but the two dimensions that they were in and made the flow of power between the two worlds more natural. It was a perfect assist to the point that it made him wonder if she read his mind or not.</p><br/><p>“Miss MiRae, she’s amazing indeed.”</p><br/><p>To think she’d enhance Galactic Trajectory which was a miracle in itself… Yu IlHan chuckled since this was so absurd. However, that wasn’t the only help. The miracles that Na YuNa emitted had become significantly stronger and started protecting his body!</p><br/><p>“Hah.”</p><br/><p>He would have poured kisses on her if she had been by his side… though, perhaps it’s fortunate that she wasn’t, because he’d get beaten up by Liera later if he did that. Yu IlHan sighed in relief and raised his head again. He could feel that the pain that assaulted his body from the moment he uttered the Declaration, decreasing slightly.</p><br/><p>The assurance that he can actually succeed came to him for the first time. The incubation process for Earth and Dareu fusing into one. Although this was a very short time that didn’t even last even a millionth of a second, that instant would dictate their fates.</p><br/><p>“Good, with this…… with everyone’s help.”</p><br/><p>He raised his hands. The mana that comprised the two worlds entered his body and flowed out again before being synchronized at an incredibly slow pace. No, the two were already one. If he was the world, then the world was him as well.</p><br/><p>A smile appeared on Yu IlHan’s lips. Thinking about this world in the future, and the expressions of his enemies, he couldn’t help but be overjoyed.</p><br/><p>“Let’s do this.”</p><br/><p>Why was he called God, why was he called the Creator.</p><br/><p>He finally understood why.</p><br/><p>He was now ready.</p><br/>\n</div>"}