{"title": "Chapter 346: Sole God – 7", "id": 346, "volume": 4, "url": "http://boxnovel.org/everyone-else-is-a-returnee-chapter-346-sole-god-%E2%80%93-7", "volume_title": "Volume 4", "body": "<h1>Chapter 346: Sole God – 7</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>“I, I had a feeling that this would happen.”</p><br/><p>Yu IlHan shrugged his shoulders the moment he arrived in Heaven. What spread out in front of them was the limitless skies, along with the clouds that filled it, as well as…….</p><br/><p>[It’s the first time we meet like this, is it not, Yu IlHan?]</p><br/><p>Satan was standing amongst the mountain of angel corpses. The thirteen wings behind his back flapped loosely as if mocking Yu IlHan and the others.</p><br/><p>“My word, all the angels were…….”</p><br/><p>“Satan, what did you do! All of these innocent angels……. Although Yu IlHan did something similar in the past! But even so!”</p><br/><p>“I still believed in you in one corner of my heart, Lucifer…….”</p><br/><p>The ex-angel dragons became enraged and Uriel shed tears filled with sorrow and disgust. Satan made a bitter smile for a moment after hearing Uriel’s words, before shrugging his shoulders.</p><br/><p>[You should have trusted someone else who you could place your trust in, Uriel. I was your enemy from the moment I created the Army of Brilliant Light. Didn’t you know that?]</p><br/><p>“Why? You and the four of us were of one mind. Me, as well as Gabriel as well as-.”</p><br/><p>[Stop dreaming, lady.]</p><br/><p>Satan sighed. With a voice that sounded neither like the truth nor the falsehood, he blamed Uriel.</p><br/><p>[It was only you that thought like that in the first place. All of us five were aiming for different objectives.]</p><br/><p>“Lucifer, no, Satan……! I am sure of it now. You are our enemy! Unforgivable, a treacherous existence that has to be killed!”</p><br/><p>Uriel abruptly turned around to Yu IlHan. She felt like a little child that asked her parents to scold her opponent after having a quarrel, so Yu IlHan ended up laughing even though the situation was urgent. Then, he scratched his head and spoke.</p><br/><p>“I would have been able to minimize damage if I came here a little earlier. I hurried a lot but it still turned out like this. It hasn’t been that long since you came here too, no?”</p><br/><p>[You are quite smart, fellow. Well, you can hear that loud noise over there, right?]</p><br/><p>Satan pointed his hand beyond the Wall of Chaos. Yu IlHan nodded his head. He already knew who were clashing there.</p><br/><p>“Michael and Greed……no, the God of Heaven, I guess? I think they’re still fighting with each other.”</p><br/><p>[……!]</p><br/><p>“What!?”</p><br/><p>“IlHan, what did you just say?”</p><br/><p>The others doubted their own ears after hearing Yu IlHan’s words. The leader of the Destruction Demon Army was actually the God of Heaven? What sort of connection did the two have? Yu IlHan just replied nonchalantly.</p><br/><p>“What? It’s nothing surprising. Even the ex-Archangel Satan made the Army of Brilliant Light and my old man Gabriel made his own faction too, so there’s no way their master, God, couldn’t do the same thing? Hey, even I could have done it.”</p><br/><p>“Can you really do it too…… no, no, no. That’s not the important thing here. So did you just say that God, is the leader of the Destruction Demon Army himself……!?”</p><br/><p>“What, did no one actually realize that? There will never come a day where I’ll hand down the mantle of foreshadow master to you guys. Such a pity.”</p><br/><p>“How!”</p><br/><p>“Why!”</p><br/><p>“My head hurtsssss!”</p><br/><p>The others all fell into confusion at the same time! And Satan wasn’t an exception either.</p><br/><p>[You…… how did you know that?]</p><br/><p>“I wonder if I really have to tell you, but fine. It’s a special service from me.”</p><br/><p>Yu IlHan shrugged his shoulders and explained in a warm and kind voice to Satan.</p><br/><p>“There are quite a lot of capable people in my group. There’s even one that can discover worlds that each factions have been hidden away or even interspatial dimensions.”</p><br/><p>[Discover, hidden worlds……?]</p><br/><p>“And I happened to have the ability to erase them and bound them to our world.”</p><br/><p>[That’s definitely an interesting topic. Yes, I also had a time when I found fun in hiding things. So you’re saying that you erased them all and made them yours?]</p><br/><p>“Correct, and among those worlds.”</p><br/><p>Yu IlHan nonchalantly uttered.</p><br/><p>“Was Greed’s, that is, God’s, flesh.”</p><br/><p>[Flesh……?]</p><br/><p>“Ah!”</p><br/><p>Yu IlHan’s group also understood when he phrased it like that. Na YuNa widened her eyes and exclaimed.</p><br/><p>“The one that looked like someone swallowed it whole and vomited it back out with stomach fluids splattered all over it!”</p><br/><p>“Thanks for the reminder of that disgusting scene, Miss YuNa.”</p><br/><p>“Ehehe.”</p><br/><p>“I wasn’t complimenting you.”</p><br/><p>Replied Yu IlHan with an unpleasant expression as he raised his hand. Inside there was a small vortex, and everyone realized that it was a very small interspatial dimension.</p><br/><p>“At my level, creating such an interspace isn’t hard at all.”</p><br/><p>“Whoa, so cheeky.”</p><br/><p>“Of course, this means that it isn’t hard for Greed to, right? And inside his own stomach too.”</p><br/><p>[Indeed…… that should have been the safest place.]</p><br/><p>Even Satan didn’t know about this. God did not reveal everything to him after all. If he knew everything, then Satan would have already found numerous ways to screw God over.</p><br/><p>Satan didn’t know the process of making Legnae and Archlegnae, and did not know what mechanism God’s so-called new world will run with. No matter how capable he was, there was a limit. However…… if he thought about it, it was actually quite possible.]</p><br/><p>[Yes. Perhaps someone like him can do that. And you…… and your comrades, opened the doors to that hidden world.]</p><br/><p>“Yup, the mage on our side is amazing.”</p><br/><p>Kang MiRae blushed. She might die of happiness if he praised her any more. Yu IlHan smiled at her and continued explaining to Satan.</p><br/><p>“No matter how amazing I am, there was no way I can see through his real identity just with one meeting with him. But then, I got a piece of his flesh, and something that was deep inside his body, so wouldn’t it be strange if I didn’t know anything about him? Moreover, there are plenty of samples around me that contain traces of God’s power.”</p><br/><p>[That maybe from him devouring angels and acquiring a tiny portion of God’s power…….]</p><br/><p>“Not that one, God’s power that the Four Great Archangels ‘and you’ shared. A portion of that was with him as well. So, who else could it have been apart from God himself? Greed is the fallen God, the same God that was chased out by you five, and the same God that vowed to avenge the betrayal of his children.”</p><br/><p>Satan decided to give up on this battle of smarts with Yu IlHan. It would in fact, be better for his mental health to converse with him under the assumption that Yu IlHan knew everything.</p><br/><p>He was the worst kind of monster since genesis. He was a talent that could achieve everything he wished for and still have room for more. He would truly stand with his chest held high, in a place where the God of Heaven, Michael, Gabriel nor Satan, could stand.</p><br/><p>Satan felt his heart thumping. With the existence of Yu IlHan, his plan would be a success. Without hiding his joy, he stopped Yu IlHan; not doubting that he would speak of even more amazing things!</p><br/><p>[Then I ask, Yu IlHan. ……What was inside!]</p><br/><p>“Recorded gods, and the new record storage that he tried to make using them.”</p><br/><p>[…….]</p><br/><p>No, but even so… Satan became speechless because he didn’t expect this. Yu IlHan finished off with a bright smile.</p><br/><p>“So, God can’t do anything now. He’s doomed. Legna or Archlegna, he can’t even make a single one of them, much less anything else. Even if he tries to make a new record storage by gathering new gods, they’re all within my group now. So, in the end, he will have to kill me, but he wouldn’t be able to win against me even if he dies and revives three times. So, it’s game over.”</p><br/><p>[Pff…….]</p><br/><p>The dumbfounded Satan burst out in laughter.</p><br/><p>[Puhahahahahahahaha! Keke! Kehihihihihihi! Oh, my stomach hurts! Kuhahahahahahaha! Wheeeeeew!]</p><br/><p>“Was that so funny?”</p><br/><p>[The best! It is the best! Yu IlHan…… You just gave me the greatest joy of my life! This is really amazing, I will admit it! You are the best across all worlds! Aaaah, I knew I was in the right to have let you go! I would have been in so much trouble if I killed you by mistake.]</p><br/><p>“That Lucifer actually praised someone else this much…….”</p><br/><p>Uriel, who knew the past Satan, muttered in a voice of disbelief. However, Yu IlHan nodded his head in satisfaction.</p><br/><p>“Hm, as expected of a leader, he knows his stuff.”</p><br/><p>[Yes, of course I do! That is why it’s even more funny! Loooool, I want to show you the serious expression he made when he mentioned the new world he was going to make!]</p><br/><p>“Yes. And so…… are you forfeiting because you know everything?”</p><br/><p>Yu IlHan’s cold words run inside Satan’s ears the next moment.</p><br/><p>Satan stopped laughing and raised his head. The thirteen wings reflected the ripple inside him and trembled slightly.</p><br/><p>[Forfeit? Me? Forfeit what? I’m not four-feeted at all, fella.]</p><br/><p>“That’s the third time already. What I meant is that…… you have already given up on yourself.”</p><br/><p>[I did? On myself?]</p><br/><p>Satan asked back and concentrated mana on one hand. He, who was greater than any other mage in the world, had the ability to manipulate magic that was twisted to the point that no one could tell the original source of, or type magic.</p><br/><p>The magic in his hand was also a high-levelled one that looked extremely difficult to block or dispel.</p><br/><p>[I don’t know what kind of misconception you have, but my fellow young transcender. I have never stopped believing for one moment. I’ve been proceeding towards my destination all the time, and I’m planning to arrive there soon. And that is why you are wrong. Or…… should I let you experience it for yourself!?]</p><br/><p>The sphere disappeared from his hand. It was a magic that could strike anywhere with unknown effects! However, Yu IlHan extended his hand as if he knew what was coming.</p><br/><p>Then, he pulled Uriel into his arms.</p><br/><p>“Whoa?”</p><br/><p>Uriel, hugged by the son of the man she likes, thought ‘perhaps it would feel like this to be hugged by your own son?’ and was slightly happy even while feeling awkward, the sphere that appeared where she was disappeared after being gazed at by Yu IlHan. Satan’s expression turned strange.</p><br/><p>[You……?]</p><br/><p>“What could have made you aim for Uriel and not me? What could have allowed you to kill my father Gabriel by yourself? Why is it that you are trying to get yourself killed by me at this point in time, especially now that Michael is being killed by God and victory is oh so close?”</p><br/><p>[Yu IlHan, you…….]</p><br/><p>“Although I was suspicious, I’m sure of it with that attack just now. I would be an idiot if I hadn’t realize with all these hints.”</p><br/><p>Yu IlHan spoke with a strange conviction.</p><br/><p>With the sharp and cheeky expression of the high school boy trapped in a little kid’s body, five minutes before the ending of an episode of an anime, he asked Satan. (T/N: Conan probably)</p><br/><p>“In order to kill God, the ones that stole God’s power must all die, right? That is why, you five were unable to kill God in the past.”</p><br/><p>Satan closed his mouth. Uriel widened her eyes. The others were shocked.</p><br/><p>Satan eventually nodded his head.</p><br/><p>[Yes.]</p><br/><p>Like the culprit confessing his crimes, he admitted to Yu IlHan’s claims powerlessly.</p><br/><p>[You are correct.]</p><br/><p>In just the right time, the Wall of Chaos started collapsing. Soon, Michael’s aura could no longer be felt while God’s own presence increased. He had managed to recover his powers and became slightly stronger.</p><br/><p>The final battle was coming.</p><br/>\n</div>"}