{"title": "Chapter 341: Sole God – 2", "id": 341, "volume": 4, "url": "http://boxnovel.org/everyone-else-is-a-returnee-chapter-341-sole-god-%E2%80%93-2", "volume_title": "Volume 4", "body": "<h1>Chapter 341: Sole God – 2</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>The barrier shattered. The aerial city that contained the Flying fortress and the Guardian fortress instantly floated up toward Earth’s atmosphere,. The people who remained on Earth watched as the city levitated further and further away from them and finally realized that time had started flowing again. Below that, Yuni was jumping around.</p><br/><p>“I’m going to marry godfather when I grow up! So you have to stay safe! You can’t get your face injured!”</p><br/><p>“Stop dreaming, kid!”</p><br/><p>Liera, who punished anyone and everyone who aimed for Yu IlHan, firmly rejected that. Yu IlHan activated the Warp skill while wondering what she was doing to a little kid and why she took her seriously in the first place.</p><br/><p>[Come back after eliminating all who aim to inflict harm upon Earth, o, ruler.]</p><br/><p>The one that was born of chaos, became a guardian, and eventually was reborn in to Earth itself spoke in a grave voice. Yu IlHan nodded his head with a laugh.</p><br/><p>“Don’t worry about anything, just leave it to me.”</p><br/><p>He had long since mastered the Dimensional Ruler skill. Since all the worlds he had to protect became one, the barrier that he cast over Earth also became incredibly sturdy. That was also the reason he could prevent the original population of Earth from returning for a few hours.</p><br/><p>“I’m going to end everything before that. It’s not like Earth is 100% complete either.”</p><br/><p>“It still isn’t!?”</p><br/><p>Shouted Erta in shock. Yu IlHan tapped on the ground he was on and nodded his head.</p><br/><p>“Didn’t I say so? This city must be fused back into Earth before the end of everything.”</p><br/><p>“Oh yeah, speaking of this city, just what is this city? I can feel that it’s supposed to be a part of Earth.”</p><br/><p>“You can consider it a part of Earth but at the same time, a small, independent world. It’s simply a matter of perspective.”</p><br/><p>No one understood his words, but they could understand that Yu IlHan was about to use that concept to do something interesting. However, the Warp skill activated before they could ask him more about it.</p><br/><p>Yu IlHan had mastered the Warp skill as well, so the others were all moved to the Netherworld before they could even feel anything weird. They were all taken by the surrounding scenery, so they couldn’t even ask the details of the aerial city.</p><br/><p>“It’s the Netherworld!”</p><br/><p>“It is indeed!”</p><br/><p>“It’s the first time that I’ve ever come here.”</p><br/><p>An endlessly dark, and ominous world. It was the world that Satan came after he fell from Heaven, and the world that contained his foundation.</p><br/><p>“This world…… does not have Satan right now?”</p><br/><p>Yu IlHan nodded his head without hesitation when Kim YeSeul asked.</p><br/><p>“The battlefield should be somewhere else. Satan apparently teamed up with God so he’s probably going there right now.”</p><br/><p>“That world is…….”</p><br/><p>“Unknown as of yet. However, it’s not something absurd like an unrecorded world or something. The God of Heaven isn’t capable to that extent. So, I’m planning to find more information about it here.”</p><br/><p>“Lord, if possible, Gabriel must be saved as soon as…….”</p><br/><p>Uriel was looking left and right for Gabriel with a nervous expression plastered onto her beautiful face. He wondered how she lasted all these ten years. Yu IlHan nodded his head with a bitter smile.</p><br/><p>“At my level, I can do a lot of things even while I’m talking. I’m scrolling through the records of this world as fast as possible right now, so don’t worry about it too much. Dad should be safe, and we will be able to find him. Though, you won’t be able to get him for yourself.”</p><br/><p>Regardless of Uriel’s dejection, Yu IlHan continued searching through the Netherworld. As expected of the main world of the Army of Brilliant Light, the Netherworld was extremely vast and had a frightening density of mana, but what was weird was that there was not a single fallen angel in this world.</p><br/><p>“How can it be so clean?”</p><br/><p>“The most important world for the Army of Brilliant Light is the Netherworld. Even though Satan may have left, how could they have left it completely empty? Was Satan such an idiot?”</p><br/><p>“Well, I don’t think so.”</p><br/><p>Since he discovered the connection between the recorded gods and the Archlegnae, the possibility that Satan was a schemer beyond Yu IlHan’s expectations became nonexistent, Yu IlHan still didn’t think that a leader in charge of a faction, and the one that first found a way out of God’s reign, was such an ignorant man.</p><br/><p>“If this was an important place, they should be guarding it. But they aren’t. That means that this place is not that important.”</p><br/><p>“It’s not so simple…… how can a main world not be important?”</p><br/><p>Yu IlHan answered.</p><br/><p>“It can be that there’s no longer any meaning to the main world anymore.”</p><br/><p>“No…… meaning to the main world……?”</p><br/><p>They just talked about how the main world was the most important for a faction, but he just straight up denied it! And he was a leader of a faction too!</p><br/><p>Yu IlHan shrugged his shoulders and explained for those who didn’t get it.</p><br/><p>“He teamed up with God, didn’t he? God said he’ll make the world anew, so wouldn’t he erase the Netherworld as well?”</p><br/><p>“But once that happens, Satan’s power would be…….”</p><br/><p>“He won’t be able to perfectly erase the main world unless he does something about the leader, so to be exact, God will erase the Netherworld under agreement from Satan. You can say that he will be making himself weaker.”</p><br/><p>“Then does that mean that Satan really believes in God and has taken a place next to him once again……?”</p><br/><p>Wasn’t that the most foolish thing to do! However, Yu IlHan shook his head and did not give them the answer they wanted.</p><br/><p>“It’s not like there’s absolutely no guard after all. Moreover, this one’s even aware of me.”</p><br/><p>“Where?”</p><br/><p>“In the center of the world. I’m going to go there now.”</p><br/><p>When Yu IlHan’s mind drifted there, the aerial city received his intentions and immediately started moving. Thanks to the Warp skill, the members in it couldn’t even feel the slightest turbulence despite moving absurdly fast. They were only exclaiming while looking at the changing surroundings.</p><br/><p>“Aah, I can feel it now. That’s an amazing aura.”</p><br/><p>“I would have been scared if it was the past me…….”</p><br/><p>Muttered Erta. That meant in reverse that she wasn’t afraid of it at all right now. Really, the number of the days she spent with Yu IlHan could be clearly seen here.</p><br/><p>After a blink of an eye more, the aerial city arrived at the destination. There was a truly huge palace, and there was another one that was sitting alone on top of the rounded roof.</p><br/><p>[You came here earlier than I expected.]</p><br/><p>The one there was a woman who had an impressive head of black, long hair. Wearing a black silk dress that did not seem suited for battle, and even black silk gloves, she was a lady that exuded a deep aura of luxury. However, the eight wings sharply protruding behind her back made them rethink about the true extent of her power.</p><br/><p>“Lazière. So you were a woman.”</p><br/><p>Said Yu IlHan. The others all flinched for a moment after finding out that the woman in front of them was the 1st Wing of Brilliant Light, but the person in question actually just nodded her head nonchalantly.</p><br/><p>[That is so. I am the 1st Wing of Brilliant Light, Lazière. And you must be Yu IlHan, the Lord of Dragon’s Nest.]</p><br/><p>“I am he.”</p><br/><p>Lazière glanced at Yu IlHan very carefully as though she was afraid that she might seem rude. Even while knowing that they were enemies, she was very polite.</p><br/><p>[I have heard that you were someone who became strong rapidly, but I never imagined that you became even stronger since then. I cannot fathom the depth of your power even with my powers as an 8th class being…… My Lord may be a good opponent for you.]</p><br/><p>From what Yu IlHan had seen until now, Yu IlHan was sure that Satan wouldn’t be his match unless he somehow became at least five times as strong since they last met, but it would be embarrassing if he said it and it turned out to be wrong, so didn’t say it out loud.</p><br/><p>Instead, he asked her.</p><br/><p>“I have something i would like to ask.”</p><br/><p>[As long as it’s within my knowledge.]</p><br/><p>“Is Satan really my enemy?”</p><br/><p>The world stopped.</p><br/><p>Or at least it felt so. Everyone was looking at Yu IlHan in shock.</p><br/><p>“What do you mean!? You were preparing to kill him up until moments ago while steeping in rage!”</p><br/><p>“You nailed a straw doll to the wall three times before you slept while shouting Satan’s name!”</p><br/><p>“You resolved that you will break him if you couldn’t have him~!”</p><br/><p>“You looked so expectant and excited while saying you were going to rob an empty house!”</p><br/><p>“Please put away all those false information and BL delusions.”</p><br/><p>Yu IlHan just nonchalantly corrected the mistakes. His gazed was fixed on Lazière, but he found it cute that she was making an absurd expression. He urged her to answer.</p><br/><p>“And so? How is it?”</p><br/><p>[Do you think that way because Lord Satan has protected you until you became a transcender? Unfortunately, Satan is your enemy. Perhaps not if you were not a transcender, but you are already complete. Bakers may wait for the bread to be baked, but…….]</p><br/><p>“Yes, yes. You mean to say that there are none that will watch the completed bread in satisfaction. I know, I heard that before.”</p><br/><p>[Did you accept it now?]</p><br/><p>Yu IlHan shrugged his shoulders and replied.</p><br/><p>“In some way.”</p><br/><p>[Then that is fine.]</p><br/><p>Lazière slowly stood up.</p><br/><p>[I am aware that I am not a match for you. However, I shall block you until the moment my life disappears. At that point, Lord Satan will return and take your life himself.]</p><br/><p>“No, I’m not going to fight you.”</p><br/><p>[……What?]</p><br/><p>“Heh.”</p><br/><p>Yu IlHan extended his hand and let out a short shout. With just that, Lazière was bound to the spot.</p><br/><p>He had subdued an 8th class Battalion Commander that received the largest share of support from the world after Satan, within the domain of the Army of Brilliant Light!</p><br/><p>[H, how can this be. Even though you are a leader of a faction, even though you may be a transcender, you shouldn’t be able to so easily…….]</p><br/><p>“When I lacked power, killing all my enemies was the best way. That’s because I felt like my insides were burning every time main characters in novels were humiliated because they let an enemy live. I could never understand why they would leave a potential problem be. In fact, there were some novels where I just straight up liked the antagonist better.”</p><br/><p>“Isn’t that because you’re a villain too, IlHan?”</p><br/><p>“Shut up. Anyway, that’s why I maintained my philosophy of killing enemies as soon as I see them before I decide to think about anything past that. But living like that…… mm, had some annoying bits to it as well.”</p><br/><p>He killed anyone that he found difficult to distinguish between enemy and ally, killed the ones that were enemies, but could potentially have been future allies, and even erased numerous future possibilities in fear of potentially pessimistic future possibilities.</p><br/><p>[That’s natural. You have chosen the correct choice in order to survive. I will not resent you even if you kill me right now. Enemies should be treated like that after all.]</p><br/><p>“Of course, there are many kills that I do not regret at all. Sons of bitches, bitches that I wanted to kill, bitches that I had to kill, bitches that must be killed and so on……. But it’s not like all my victims were like that. There are too many that I killed because I was afraid of the consequences. So.”</p><br/><p>[So?]</p><br/><p>Yu IlHan said to her with a refreshing smile.</p><br/><p>“If I could erase all negative future possibilities, perhaps such an unpleasant act of monotonous killing might not be necessary anymore.”</p><br/><p>[……Are you saying, that, you will, not kill me?]</p><br/><p>Lazière asked back in shock. Surprisingly, Yu IlHan nodded his head.</p><br/><p>“Yup. Especially in your case, you need to die after stalling for time even though you don’t specifically hate me. I really hate killing harmless ones like you. Especially because I feel like I’m being toyed with by the scenario.”</p><br/><p>[If you let me go, you will definitely regret…….]</p><br/><p>“I won’t. Didn’t I just say so? I’m going to erase all negative future possibilities.”</p><br/><p>Yu IlHan took out a small cube from his bosom. Lazière titled her head while looking at that.</p><br/><p>[What is that item?]</p><br/><p>Yu IlHan replied.</p><br/><p>“This is called the Trap of Restoration.”</p><br/>\n</div>"}