{"title": "Afterword (END)", "id": 354, "volume": 4, "url": "http://boxnovel.org/everyone-else-is-a-returnee-afterword-end", "volume_title": "Volume 4", "body": "<h1>Afterword (END)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Hello, it’s Toika, swooshing around as always.\n</p><br/><p>Everyone Else is\na Returnee, actually came to an end. Actually I already wrote the\nending waay back, so I felt all the emotions at that time, but adding\nthe side stories recently made my heart feel weird all over again.\n</p><br/><p>This\npiece started on the 26th of June 2016. Wow, it’s been 9 months\nalready.\nAll pieces that were with me until now were already quite special, but\nthis piece was even more so. The fact that I can laugh with you readers\nwhile writing something that I want to write – I realized once again how\nhappy such a thing is.\n</p><br/><p>I wrote a few side stories since I felt\nit’s a pity to let IlHan and his family go with just the epilogue, but\nnow I did it, I feel even more pity. But I think I wrote everything that\nneeds to be written. Personally, I’m very satisfied with everything.\nDid you have a joyful time with this writing as a reader? Of course,\nthere may be times where I have disappointed you. However, I do wish\nthat you are more happy than disappointed since you are reading this\nafterword.\n</p><br/><p>My\nnext writing contains more of my preferences and desires in a more\nshameless way. I am aware that the likes and dislikes may drastically\ndiffer, but I will introduce it again for those that ran all the way\nhere, in hopes that you will be able to enjoy it.\n</p><br/><p>‘I Shouldn’t\nHave Reincarnated’ – It’s a story about two selected heroes, where only\none of them was supposed to appear, and their adventures of somehow\nending up in the demon king’s castle. Please go look it up right away if\nyou are curious.\n</p><br/><p>And finally, I’ll retreat by uploading the\nfan-art I’ve received from the user “Warpic”. It’s a very very very very\nvery very very very very pretty picture! Mr. Warpic. Thank you\nsoooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooo much!!!\n</p><br/><p>PS\n– Personally, there was something that made me spit my drink out. If\nyou are an EER enthusiast, then you will probably notice so go look for\nit!\n</p><br/><p>***\n</p><br/><p>Afterword from translator (this is gonna be long)\n</p><br/><p>TL;DR – Chamber is retiring from translation\n</p><br/><p>Okay,\nbefore I start, I’ll get a couple of things out of the way. First, the\npicture. Yes. the text translation at the bottom right of the picture is\nINDEED COMIC SANS. I don’t know any other font that fits… I never\nedited manga after all. Also, Erta’s hair was described as ‘long black’\nsomewhere early on in the story (I’m guessing the green winged\nfairy-like girl is Erta cuz she looks obviously tsundere)\nSecondly, there are three novels by 토이카/Toika/Toy Car that have NOT been\ntranslated. (There’s actually another one but he dropped that one)\nHere they are:\nDevil King – written before the author wrote the dropped one. I\npersonally think this is meh, since MC has no personality. It’s story\nabout two worlds that get connected to each other, and every human on\nEarth has a counterpart ‘being’ (humans or monsters) in the other. One\nday, the two worlds suddenly fuse and MC becomes a goblin.\n</p><br/><p>I\nshouldn’t have reincarnated – written after he wrote EER. This is\nactually pretty fun. I won’t spoil, go ask NaughtyOtter/CalifornianOtter\nfrom Otterspace/Wuxiaworld to translate it. He seems interested in this\none. Finished with 206 chapters. It’s pretty fun though.\n</p><br/><p>Only I can log in – I haven’t read this novel yet since it does not serialize on Munpia but Kakaopage. It’s currently ongoing.\n</p><br/><p>Now onto my real afterword.\n</p><br/><p>At\nfirst, I didn’t even know I would take this series, much less finish\nit. At first, I just had some donation money lying around (from God of\nMusic I believe), and just clicked on the rank 1 novel on Munpia, which\nwas this. I immediately got hooked, and started translating because it\nwas fun to do as well. But then, Rainbowturtle told me that it was\nalready being translated at NovelsnChill (who seem to be inactive\nnowadays). Bingryong (translator of the prologue) had already done the\nprologue before I even started reading the novel! However, I only\ndiscovered that when I translated around 12 chapters. So, I just\nstraight up gave them (NNC) my google drive and told them to do whatever\nwith it. Heck, then, JohnSmith (Admin at NNC) approached me and said\n“Hey, don’t you wanna do it? Come and do it here!” And that was the\nstart of me actually translating EER.\n</p><br/><p>Various things happened mid\nway throughout translation. First, my grades dropped (Urgh), translating\nis so fun that I actually became loose with my studies… Second, I got\nto know a bunch of people and their personalities (AKA admin at NNC and\nadmin at kobatochandaisuki, I’ll keep quiet about their personalities\nthough). Third, Coder Lee YongHo got a takedown notice from the original\npublisher (such a pity, I want to finish what I started). And fourth, I\nended up dropping God of Music. Personally, I really like God of Music,\nas much as it is painful to translate, though, author’s releases have\nbeen becoming quite sporadic as of late. A few people have approached me\nsaying they want to translate God of Music, but I’ve yet to hear news\nfrom them. I even gave them full permission to utilize my translations\nand even get help from me if they wished to. But, oh well. At least I\ngot to focus on EER. God of Music will NOT be resumed (at least not by\nme).\n</p><br/><p>My\nfuture plans? I actually have to serve the Korean military for nearly\ntwo years mandatorily, and it’s about time I do it. So, I will not take\nup any translation work and apply for the military (Although, the\ncompetition for the military is so fierce nowadays so I doubt I’d get in\nsoon). So yeah, I’m going to halt translating. I will hang out on the\nnovel community though, so if you want to see me, then come to\nr/noveltranslations discord server or kobatoland discord server. I’ll\nalso join a bunch of other servers as well like NUF, Wuxiaworld and\nVolare.\n</p><br/><p>After my military service… I probably still won’t start\ntranslating. I actually do need to study (Remember how my grades\ndropped?), so tough luck.\n</p><br/><p>It’s been a blast reading through all of\nyour comments throughout this series and thanks to all the supporters\nand readers that have supported me until now.\n</p><br/><p>Ahh how could I\nforget, give a big round of applause to Koukouseidesu, who has been with\nme through the majority of this novel with editing. I didn’t actually\npay him much too (kobatochandaisuki does not pay editors, so I pay\nmine). He had a lot of schoolwork to do, but still stuck through with me\nand the hard schedule of more than two chapters per day on some days,\nuntil the very end of this novel. Thanks Koukouseidesu.\n</p><br/><p>Alright, that’s it from me. Perhaps Koukouseidesu wants his own afterword as well.\n</p><br/><p>PS – there’s no event or anything to commemorate the end of the novel.\n</p><br/><p>P.P.S – if you want to donate, please do so here, since I will be closing the support button. shamelessly asking for money.\nOh yeah, remember how I mentioned about the ‘generous people that still want to donate’? Too bad no one did, I guess.\n</p><br/><p>です(Koukouseidesu) here!~\nYea I wanted my own afterword too! :^)\n</p><br/><p>I officially joined KCDS\nand started proofreading for EER at chapter 83, heck that was a long\ntime ago, we’ve come really far since then! I was motivated to give back\nto the novel community after having binge read thousands upon thousands\nof chapters over the past few years.\nWell, was it worth it? Of course it was! I had a blast getting to know\nChamber-nim (still remember making jokes about him being robot unni,\nheh) and getting early access to all the chapters that I wanted to read,\nbrowsing through them comments (constructive or appreciative, toxic or\nnot, it didn’t matter! I had fun reading through most of them.) and\ninteracting with fans on the discord channel. It was tiring and\ndemanding at times, heck I made quite a lot of mistakes early on (still\ndo, but not as terrible and not as often!) so I’m really glad and\nappreciate the fact that you guys stuck through with us this year or so\n</p><br/><p>Similar\nto Chamber, I’m going to have to go into the singapore army for a\nperiod of two years sometime next year, so you guys won’t be seeing me\npost anything regularly for quite a while! I’ll hang around on the\ndiscord channels so feel free to come and chat with me and chamber~\n</p><br/><p>Signing\noff and behalf of everyone at KCDS, Thank you very much for your\nsupport! please continue to browse the site (without ad blockers) and\nread some of our other novels!\nIt was a pleasure proofreading for Everyone Else is A Returnee, though\nyou might have found the ending slightly anticlimactic, the afterstories\nshould make up for that.\n</p><br/><p>Regards,\n</p><br/><p>Koukouseidesu\n</p><br/>\n</div>"}