{"title": "Chapter 8: A delighful pledge", "id": 8, "volume": 1, "url": "http://boxnovel.org/tsuki-ga-michibiku-isekai-douchuu-chapter-8-a-delighful-pledge", "volume_title": "Volume 1", "body": "<h1>Chapter 8: A delighful pledge</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 8: A delighful pledge</p><br/><p>~Shen POV~</p><br/><p>Supremacy must refer to this.</p><br/><p>A mysterious existence. Mysterious experiences. Mysterious memories.</p><br/><p>To think about destroying this would be a stupid thing to do.</p><br/><p>Trapping him in the mist barrier. While I was checking out the memories of the enemy hyuman I was shocked.</p><br/><p>By the way, I don’t know what kind of illusion he is being shown. I just pour in the power inside this barrier and can only decide if the direction of the illusion will be pleasure or fear.</p><br/><p>Normally after that there wouldn’t be any problems. If it goes into the fear side most of them would die and a lot of them would also struggle. If its pleasure, the struggle would be low but the time it takes for them to die would get longer.</p><br/><p>For speed its fear, for safety I would go for pleasure. That’s how I divided the use of them.</p><br/><p>But this time, to have chosen this method made me feel terribly ashamed.</p><br/><p>This memories are wonderful. Just, wonderful.</p><br/><p>This enemy, no, this man, it was hard to believe but, he was someone that had come from another world.</p><br/><p>Memories can’t lie. There is no source more truthful than this.</p><br/><p>An unknown existence unknown existence unknown existence.</p><br/><p>Even with my long time here I have never seen such memories before, he was a person of great interest.</p><br/><p>To let this living being to die. Such a thing is something that shouldn’t be done.</p><br/><p>Especially, this.</p><br/><p>This that seems to be one of the hobbies of this man.</p><br/><p>It jolted my heart with a tremendous force.</p><br/><p>I don’t want these memories that seemed like I had cut them off, I don’t want dead memories.</p><br/><p>I want memories that are alive. I want to hear it directly from him. And I want to converse with him.</p><br/><p>In his strength, his treasures, his existence.</p><br/><p>I don’t remember a time where my heart has been moved so much. Is this what they call interest?</p><br/><p>It wasn’t just a whim, from the bottom of my heart I knew that this was interest.</p><br/><p>I don’t want to lose him.</p><br/><p>I want to know. That’s why I won’t let this person die.</p><br/><p>I have to release him. To enclose him in a dangerous barrier is a foolish thing to do.</p><br/><p>The moment I release him I should talk with him.</p><br/><p>For the sake of that, what should I do?</p><br/><p>I have to let him know that I don’t feel hostility for him anymore.</p><br/><p>Using a word from his world it would be, show your stomach and everything will be understood?</p><br/><p>I don’t understand.</p><br/><p>But, first of all I should release him and then ask for his state. If he is surprised I should be able to use that as a trigger to begin a conversation.</p><br/><p>I have already learned human words. There should be no problem.</p><br/><p>Though, he can speak with the orcs so he should be able to speak with me as well.</p><br/><p>“Then” (Shen)</p><br/><p>Thinking I should release the barrier, I look at it. Anyhow, it’s my first time that I have been this entranced in a person’s memories so.</p><br/><p>What a sweet feeling.</p><br/><p>But once again, I was the one who ended up being surprised.</p><br/><p>Inside the barrier I could sense the activation of power.</p><br/><p>It was quite the power.</p><br/><p>I can hear something.</p><br/><p>“Anyways… girls… after the other!” (Makoto)</p><br/><p>What is it, the power has increased even more. The barrier is crying.</p><br/><p>“Already… tyr…. kiiiiii!!!” (Makoto)</p><br/><p>“Oooh?!” (Shen)</p><br/><p>The mist that was in the surface of the barrier disappeared as if crying.</p><br/><p>And then.</p><br/><p>A dull and dreadful sound rose out, my barrier, for the first time, had been destroyed from the inside.</p><br/><p>How out of the standard can you be? Just how powerful is that power that the God from the other world has given you?</p><br/><p>Cold sweat.</p><br/><p>Thinking about that attack hitting me send shivers down my body.</p><br/><p>Showing my stomach, I prepare myself to round my eyes the best way possible. (TN: Yeah I imagine her going all kawaii mode) To how lovely I can look, I don’t have much confidence though.</p><br/><p>Most likely he thinks of me more in the animal class. Not the pet type but the wild animal class. To what extend I can look as a caring animal, I am a bit insecure.</p><br/><p>And then, he appeared.</p><br/><p>“Hey” (Makoto)</p><br/><p>In a really calm voice he calls me out and my body hardens.</p><br/><p>“I am sorry, good man that has come from another world. I now know the circumstances of the destruction of the gate. I have learned that it was a misfortunate accident. I will also apologize for my quick temper. Could you please lower you weapon?” (Shen)</p><br/><p>“Wa?” (Makoto)</p><br/><p>“I will add this to my apology, I have read your memories. I don’t know the contents but that I have shown you an unpleasant illusion, I apologize from the bottom of my heart” (Shen)</p><br/><p>“… That wasn’t something you had shown me?” (Makoto)</p><br/><p>“I can choose if it will be pleasure or pain but the details and the contents are dependent on the target” (Shen)</p><br/><p>When I answered him like this, he crouched while holding his head. ‘So it’s as I thought~’ is what he groaned.</p><br/><p>“Other world person, I am Shen. A superior dragon and an existence that is called “invincible”. Just as you know, I am particularly good at illusions” (Shen)</p><br/><p>I made a decision that would make the me from yesterday laugh.</p><br/><p>“A, I see… I am Misumi Makoto. If I said Misumi Makoto would you understand? (TN: he says it twice. One in kanji and the other in hiragana. I wish he would use Hiragana for names more often) You may already know but I have come from another world” (Makoto)</p><br/><p>I already knew but him saying it shocks me for a second. To watch memories is deep that’s for sure. For the sake of the future this is something that must be said.</p><br/><p>“Makoto-dono, won’t you sign a pact (TN: I will use pact instead of contract) with me?” (Shen)</p><br/><p>I have already decided to follow this man. I already know that he is close to a traveler and that he is aiming to head to human settlement. A human settlement, it was more like he was looking for people.</p><br/><p>Then a pact is fine.</p><br/><p>I will follow him as a partner.</p><br/><p>I will lent him my power and I want him to talk to me about his experiences. Especially about ‘that’</p><br/><p>“Uh? A pact? Like a summoning beast?” (Makoto)</p><br/><p>“It’s an event that can only be done one-on-one, it vaguely differs depending on circumstances. The existences that are in my class most likely can only do this once. I can brag about me being the strongest class. I promise you that I will not bring any loses to you!” (Shen)</p><br/><p>His way of seeing things may be a bit different but it must still be pretty similar.</p><br/><p>“N? To have more people along is better?” (Makoto)</p><br/><p>“Yes! Yes! I am extremely interested in your hobbies! Please do give me a favorable answer!” (Shen)</p><br/><p>Yes, those wonderful memories. With just a glance they captured everything of me.</p><br/><p>“Guha!! What kind of threat is that?! What did I get my hands on?!” (Makoto)</p><br/><p>For some reason he was crouching and agonizing.</p><br/><p>“How is it? I think it’s something that will bring benefits for both of us though” (Shen)</p><br/><p>“Gugugugu, you schemer. Alright, I get it! I will be counting on you” (Makoto)</p><br/><p>“Yes! I as well in the many years to come, I will be counting on you!” (Shen)</p><br/><p>With his approval I began the process of the pact with me as the lead. He doesn’t know the process of it so it’s a matter of course.</p><br/><p>A pact of 50-50. This is absurd, the configuration I am trying to push is not maintaining at all. How out of the standards.</p><br/><p>A 70-30 parent and child pact. Impossible, this is also pushed away. Just how much maryoku does he have?</p><br/><p>An 80-20 ruling pact. I was somehow able to retain the configuration. To think I would be pressured down to this point. My pride as a superior dragon is a bit hurt.</p><br/><p>I can’t maintain my consciousness any longer. This is the first time I think that being a dragon is a good thing.</p><br/><p>A ruling pact, in essence I would be his familiar, no, it wouldn’t be an exaggeration to say that I am his slave.</p><br/><p>Fufufufu. Isn’t that fine.</p><br/><p>I am looking forward to what he, no, that great person will do in the future.</p><br/><p>It seems that in the next hundred or less years.</p><br/><p>It will be the most fun times I will have in my whole life.</p><br/><p>Being liberated from my boredom, I felt my heart shaking in joy.</p><br/><p>“Then once more, please take care of me, my master, Misumi-sama” (Shen)</p><br/><p>****</p><br/><p>TN: Slave get! I mean, Harem member +1!</p><br/><p>An easy to translate chapter with not as many idioms as in the last chapter.</p><br/><p>I really wish the other chapters are like this.</p><br/>\n</div>"}