{"title": "Chapter 2: I rely on the scream", "id": 2, "volume": 1, "url": "http://boxnovel.org/tsuki-ga-michibiku-isekai-douchuu-chapter-2-i-rely-on-the-scream", "volume_title": "Volume 1", "body": "<h1>Chapter 2: I rely on the scream</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>As far as I can see is a vast wasteland and rocky hills.</p><br/><p>Continuing blindly on this vast wasteland and rocky hills.</p><br/><p>A scenario that continues on and on.</p><br/><p>When I was falling my eyes were filled with tears and I didn’t have room to look carefully at what was at the bottom.</p><br/><p>Seriously? This situation.</p><br/><p>This is already the third day you know?</p><br/><p>It should be fine to have a change about now.</p><br/><p>Since the time I had fallen, I had been walking forward without caring about day or night. Anyhow, a wide barren land. Before I noticed I am in the same place, kind of thing, for the sake of not happening I made signs in a part of the scenery and continued to walk on.</p><br/><p>Even with that, the thing that I am already used to seeing in front of me, a conspicuously tall mountain, I felt it hadn’t gotten any closer. It may be an illusion, and many times I felt my heart would crumble.</p><br/><p>After all, there was commendably no one here nothing here.</p><br/><p>In a sense it was incredible. Not only people, there aren’t even animals you know?</p><br/><p>Ah, I had forgotten it.</p><br/><p>Things I could eat there were none you see. I in times saw a dry straw like grass, as expected, I don’t think I would be able to eat it. But even that is scarce though!</p><br/><p>That I feel hungry but can still walk may be because my body has become superhuman. If it were the usual, I would have already dried up and rendered unable to stand.</p><br/><p>Doing what Tsuki-sama told me, I tried using my given ‘power’ so I concentrated to activate it but I failed(?)</p><br/><p>I tried to gather the power onto the palm of my hand but.</p><br/><p>I don’t understand it a single bit. I could certainly feel the power gathering but, nothing is happening.</p><br/><p>I tried placing my hand on the ground but that was in vain.</p><br/><p>I tested a lot of things but.</p><br/><p>Only, the objects I have in my hand will slightly move depending on how much energy I utilize. This is probably the most easiest to see and understand form.</p><br/><p>But it’s not like it actually moves, it just trembles in my hand.</p><br/><p>It’s a mystery. And also, I don’t think I can use this to get out of my current situation.</p><br/><p>Well, this power is something precious that Tsuki-sama has given me. I believe that great person wouldn’t make a mistake.</p><br/><p>I will try to experiment more with it, I have to understand this power as soon as possible.</p><br/><p>Anyways, it’s hot.</p><br/><p>In the day it’s reasonably hot.</p><br/><p>At night it’s reasonably cold.</p><br/><p>That’s how I felt it but.</p><br/><p>At noon I could clearly see the heat haze with my eyes. Right now is just like that.</p><br/><p>At nights the surface of the rocks began to frost.</p><br/><p>This seemed like an incredibly harsh environment for a human, yes.</p><br/><p>I once more thank my superhuman body.</p><br/><p>Well, without caring about my surroundings I advanced forward at a pretty fast pace.</p><br/><p>The moment I reach that mountain there should be a change in the situation, probably. Please may there be. I implore.</p><br/><p>The only thing I hear is the wind and my own footsteps!</p><br/><p>It’s already been 3 days!</p><br/><p>At this point in time there should already be an event right?!</p><br/><p>“I see, it’s because I am not a hero anymore~ I’m just an ugly duckling after all”</p><br/><p>I began to speak to myself. It may be the effect of loneliness but the times I have said what I was thinking have increased. So sad.</p><br/><p>My eyes become slightly hollow. I gazed at the far distance. I want to believe there is human population at that side.</p><br/><p>What might the two heroes be doing now I wonder? They are surely being received with open arms by the royalty and nobles, and must be eating a nice feast.</p><br/><p>Compared to me.</p><br/><p>I look at my back. Nothing but reddish-brown wasteland. The path I have travelled.</p><br/><p>Every time I saw a mirage I dashed to it so I should have shortened quite a bit of distance. I most likely wouldn’t even recognize the place I was dropped to.</p><br/><p>At first I planned to walk mindlessly and then encounter someone or find a settlement or so I thought but.</p><br/><p>It seems that is a privilege that is reserved only for main characters.</p><br/><p>Also, to be so perfectly without anything at all. There wasn’t a single shadow of a per- ???</p><br/><p>“?? ???”</p><br/><p>So.</p><br/><p>That voice was slight but.</p><br/><p>I tried with all my ability to concentrate my changed body, probably this would be the first time in all my life that I have become so sensitive.</p><br/><p>My ears didn’t let the sound escape.</p><br/><p>I stop my steps.</p><br/><p>I perk up my ears with my hands and silently close my eyes.</p><br/><p>Where is it, from where did I hear it?</p><br/><p>I have to concentrate. Just concentrate.</p><br/><p>As if to not miss even the moment a single drop of water falls.</p><br/><p>I definitely heard a voice, I have to make sure of it.</p><br/><p>“? Sa… Ple…a”</p><br/><p>“It’s over there!!!!!!”</p><br/><p>I heard it once more, it was definitely a scream.</p><br/><p>I open my eyes. Like if wanting to obtain those sound waves!</p><br/><p>I am still admirably fasting though!</p><br/><p>My stomach is extremely empty but!</p><br/><p>Since the time I came here, it’s the most power I have had.</p><br/><p>I kicked the ground and ran.</p><br/>\n</div>"}