{"title": "Chapter 14: Debut. My headaches have reached level 2", "id": 14, "volume": 1, "url": "http://boxnovel.org/tsuki-ga-michibiku-isekai-douchuu-chapter-14-debut-my-headaches-have-reached-level-2", "volume_title": "Volume 1", "body": "<h1>Chapter 14: Debut. My headaches have reached level 2</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 14: Debut. My headaches have reached level 2</p><br/><p>Translator:</p><br/><p>This chapter is a little late, but let me be clear here guys. There is no schedule. There may be issues in RL that can slow my speed, this is no job after all. I will try to release 1 chapter a day though. This is just a heads up for everyone, not a rant😛</p><br/><p>Then, enjoy the chapter ^^/</p><br/><p>——</p><br/><p>The next morning after the name-giving night.</p><br/><p>When I left the tent I saw all the orcs reunited and the backs of my two followers who were standing there.</p><br/><p>What is it this early in the morning?</p><br/><p>“Alright, you guys. Yesterday night I received my name from master. As I have told you, from now on you guys will make sure to call me Tomoe” (Shen-&gt;Tomoe)</p><br/><p>“I have been given a name as well. Call me Mio from now on” (Spider-&gt;Mio)</p><br/><p>Wa…</p><br/><p>They began to cheer for I don’t know what.</p><br/><p>What, is this such a big event?</p><br/><p>Did I mess up something again?</p><br/><p>“Concerning master being the feudal lord of this place. It is no good if you call him master like me” (Tomoe)</p><br/><p>“And I would also hate it if you called him master-sama or danna-sama. Of course, I won’t forgive anyone who calls him by his name” (Mio)</p><br/><p>No, its fine if you call me by my name you know? This will only make me itchy! Spare me from that!</p><br/><p>However, all of the orcs just nod in agreement every time.</p><br/><p>I, how big of a person am I?</p><br/><p>“So!”</p><br/><p>Both of them shouted. More like, this cheers and the cut of words, how skillful.</p><br/><p>This looks like it was already made to flow like this?</p><br/><p>“Everyone!”</p><br/><p>Yes, yes. What is it?</p><br/><p>“Tono-sama, waka-sama, elder, choose whichever you want! Let’s decide by majority vote-zo!” (Tomoe) (TN: they don’t translate well in English, you just need to know they are respectful ways to call someone)</p><br/><p>Y-Yes? Yeess?!</p><br/><p>What is up with that?! Like you know… What is up with that?!</p><br/><p>“A…e… wai…” (Makoto)</p><br/><p>I can’t put it into words properly!</p><br/><p>More like, what is with that third choice?</p><br/><p>There is no decent one!</p><br/><p>“Then, the ones who want Tono-sama!” (Tomoe)</p><br/><p>Wa…</p><br/><p>There are quite a few?!</p><br/><p>“Next, the ones who want Waka!” (Tomoe)</p><br/><p>Wa…?!</p><br/><p>It’s surpassing the last one?!</p><br/><p>“Last one! The ones who want elder!!” (Tomoe)</p><br/><p>Wa…</p><br/><p>I am not an old man yet!</p><br/><p>The two of the followers turn and face to the right.</p><br/><p>“So that’s how it is-de” (Tomoe)</p><br/><p>“So that’s how it is-desu node” (Mio)</p><br/><p>What is?!</p><br/><p>“Please go with waka-sama” (Tomoe) (TN: waka-sama = Young master)</p><br/><p>“Are you stupid? Are you stupid?! Or maybe an idiot?!” (Makoto)</p><br/><p>“I decided it democratically-zo. You like it right? Democratically” (Tomoe)</p><br/><p>“I also hold one vote for waka-sama, after all, no matter where you see it you are waka-sama-desuwa” (Mio)</p><br/><p>I can’t accept this!</p><br/><p>From how the things flowed it was all planned beforehand!</p><br/><p>“No,no, I am the master right? Why did it become like this?” (Makoto)</p><br/><p>“You asked us to decide for it after talking it last night so, we decided it with everyone” (Tomoe)</p><br/><p>“Why is it that there was a weird third choice?!” (Makoto)</p><br/><p>“That is the third choice we got after slapping them up last night-desu! It is definitely not a weird one!” (Tomoe)</p><br/><p>A-An all-nighter?!</p><br/><p>Tomoe-san what are you doing?!</p><br/><p>That means, the ones that are standing here have all been up the whole night to go along with this farce?</p><br/><p>That was definitely a third choice that Tomoe would come up with.</p><br/><p>Uuh, I am sorry.</p><br/><p>The orcs and the pair who are watching me with eyes of expectation and waiting for my speech.</p><br/><p>Uuh.</p><br/><p>I have no problems with you guys calling me by my name though.</p><br/><p>‘Go ahead, Go ahead!’ is what their eyes press me with.</p><br/><p>To wake up to this.</p><br/><p>This is slightly bullying right?</p><br/><p>“It’s fine with waka-sama” (Makoto)</p><br/><p>Great cheers of joy that made me want to plug my ears were sounding out.</p><br/><p>I didn’t want her to brainwash everyone into making the third choice after all.</p><br/><p>—-</p><br/><p>After that, every person I ran into, adult to child called me waka-sama, waka-sama.</p><br/><p>Earnestly.</p><br/><p>I didn’t care anymore and continued my travelling. The moment I saw the town my tension increased.</p><br/><p>They told me to wait for a moment.</p><br/><p>Again?!</p><br/><p>It’s already pulling on my nerves.</p><br/><p>Well, there is no helping it.</p><br/><p>Let’s leave the arrival for tomorrow.</p><br/><p>I leniently gave up and decided to rest in Asora.</p><br/><p>Well, by tomorrow they should have finished with the migration procedures.</p><br/><p>When that happens, it is okay to just leave the guiding to the clone of Shen.</p><br/><p>For some reason.</p><br/><p>They told me the dwarfs would be greeting me the next day at noon, so I slept while watching them with a doubtful look.</p><br/><p>This turn of events, will not be bad right?</p><br/><p>—-</p><br/><p>The next morning.</p><br/><p>It was splendidly bad. I had a headache.</p><br/><p>Yesterday there was only a group of orcs but.</p><br/><p>Today I can see the dwarfs at the left side. At the lead, Beren-san. It looked like there were close to 50.</p><br/><p>At the center there were what I think to be blue scaled lizardmen. At the lead, Tomoe-san. At this side there were more than a hundred of them.</p><br/><p>At the right there was something that had the lower-half of a spider and the upper part of a human. At the lead, Mio-san. On this side there were 5 counting Mio-san.</p><br/><p>What in the world is this?! There are more?! Eeeeeh?!</p><br/><p>“Let’s do it then. You told him that it would be at noon after all” (Tomoe)</p><br/><p>Tomoe-san who praises Beren-san.</p><br/><p>“No, no, if it concerns the dependents debut then in this chance I would like it if we can greet them along with everyone! After all, it would have a different impact!” (Beren)</p><br/><p>“…”</p><br/><p>“Geez, you guys are really taciturn~ I will tell you this, if you disrespect waka-sama in any way I will eat you” (Mio)</p><br/><p>“!!! (*nod*nod)”</p><br/><p>Un, chaos.</p><br/><p>I don’t understand the situation at all.</p><br/><p>Dependents, is what Beren-san said.</p><br/><p>If you say dependents it has the feel of subordinates. Or maybe, children?</p><br/><p>However, the number of people are all over the place.</p><br/><p>If that is all the dwarf village then they are pretty few.</p><br/><p>A family is normally two or more, organized as a married couple or parent and child. If we think about having father, mother and child a number of 3 persons there would be 16 families.</p><br/><p>If there is a grandparents in that equation then it would be 10 families in total.</p><br/><p>Can you form a village with that?</p><br/><p>Maybe my way of thinking about villages is just too big? It is possible, after all, this is a thinking that came from a peaceful Japan.</p><br/><p>And then there is the beautifully blue scaled lizardmen. Judging by their arrangements, I suppose its Tomoe’s family race.</p><br/><p>With a sword stabbed on the ground she had her hands on top of the handle and her chest up. Her shoulders and head slightly lowered. That appearance made me think of a knight.</p><br/><p>There doesn’t seem to be a scabbard. I think it would be convenient if you had one. I am in the katana culture so when I see the unsheathed sword I feel it’s very dangerous.</p><br/><p>I really can’t think that that Shen has such a proper family race like that. She must be the type that was blessed by her subordinates.</p><br/><p>Behind the Calamity Spider, Mio, there are 4 half human half spider.</p><br/><p>That is definitely not a number for a village. So that makes them, her subordinates?</p><br/><p>In the fight they didn’t appear though. Also, how to say it, it is hard to imagine them living in groups.</p><br/><p>More like, these fellows had more of a boss character feel.</p><br/><p>With their body upright, right hand on their chest and their heads lowered.</p><br/><p>And, probably taciturn. Their mouths haven’t opened once.</p><br/><p>In their eyes I could feel intelligence and some other color I didn’t get.</p><br/><p>Right now they all had their heads lowered so I can’t see it clearly though.</p><br/><p>“You understand right? Listen well, that great person, waka-sama has saved me and also saved you guys from starvation. Devote your whole self to him, you children” (Mio)</p><br/><p>They are children huh. Ha~ for them, just how much of a delicious meal am I?</p><br/><p>I see. Aside from intelligence the other interest they inquired about was ‘so that is the origin of the delicacy?’</p><br/><p>Talking about that kin, I think that in times of emergency they would appear and devour everything.</p><br/><p>Un, it seems that even after Mio shared that maryoku with the 4 of them, she has not lost her rationality.</p><br/><p>No, let’s stop thinking about my maryoku for now.</p><br/><p>“Mu, you guys” (Makoto)</p><br/><p>Tomoe noticed me and the two of them faced me.</p><br/><p>When the two of them looked at me, they both straighten their posture.</p><br/><p>“Ah, good morning everyone?” (Makoto)</p><br/><p>Was it fine to say everyone? I felt a bit nervous.</p><br/><p>“Good morning waka-sama!!”</p><br/><p>Oh? I could understand the words of everyone here. Also, that they were able to return my greeting must mean that my words also got through. Bug, thank you for your useful power.</p><br/><p>Beren asked the permission of both of them and then stepped forward.</p><br/><p>The dwarfs that were on their knees stood up, took a step forward and saluted. As expected, they have intensity.</p><br/><p>“Makoto-sama, please pardon me the impoliteness of using your name. The elder dwarfs that are here number 54, from today on we will be residing in this lands. I look forward to working for you!” (Beren)</p><br/><p>“Yeah, I look forward too. I am Makoto. I don’t mind if you guys call me by my name you know~?” (Makoto)</p><br/><p>“Then, I will get the village chief and have him greet you as well!!” (Beren)</p><br/><p>Yeah, I have no answer to that. It is okay to relax a bit you know. Beren-san is seriously stiff right now.</p><br/><p>Beren-san takes a few steps back and the other dwarfs also return to their spots. And then, a dwarf with a majestic moustache walked to the front. He looks at me with evaluating eyes but I don’t feel it’s rude.</p><br/><p>It’s a person that I feel stands atop others. He is clearly older than Beren-san. That Beren-san is a young one seemed to be true.</p><br/><p>To discern someone who you first met I don’t know what to say to that but. To do diplomacy in this kind of place is just…</p><br/><p>A bow. Seeing that I also bow. So there is also the culture of lowering ones head in this world.</p><br/><p>“I am the one who leads the elder dwarfs, my name is Eldo. For us who have been living in hiding in this extremity of the world, to give us the chance to live in this bountiful land I am truly thankful” (Eldo)</p><br/><p>“Ah, no problem. My name is Makoto. If there is anything troubling you or anything you want to ask don’t hesitate to do so” (Makoto)</p><br/><p>“Thank you. Then is it okay to do so now?” (Eldo)</p><br/><p>“Yes?” (Makoto)</p><br/><p>“Waka-sama seems to be barely a hyuman race. But the followers you have made a pact with, the Illusion Ruler Supreme Dragon Shen-sama and the one feared to devour the whole planet the Calamity Black Spider. No matter how I see it, there is no way they are existences that a hyuman can rule over” (Eldo)</p><br/><p>“Well, yeah…” (Makoto)</p><br/><p>Now that he says it, the two are also surprised. Maybe it’s because of my cheat disposition. Also, what’s with the ‘barely’ hyuman?</p><br/><p>“I will ask you frankly. You have been given a mission from the goddess that governs this world, received her divine protection and sent out to this wastelands right?” (Eldo)</p><br/><p>The eyes of chief-san began sparkling. But I have an objection to this!</p><br/><p>“L-Like I would want to receive divine protection from that bug! It is true that because of her I was thrown into this wastelands but rather, I am having it harsh here!” (Makoto)</p><br/><p>“B-Bug?” (Eldo)</p><br/><p>“Yeah, that woman is sufficient to call her a bug! ‘Go live your life in the corner of the world with the mamono’ so she says and then throws me into this wasteland!!” (Makoto)</p><br/><p>Ah, just remembering it makes me angry!</p><br/><p>“T-Then, there is no mission? You don’t have an objective?” (Eldo)</p><br/><p>“Yeah, I have none! Not a single one! I am a victim here you know?! Well, she did make it so I was able to speak with mamonos and demonic beast so I am a bit grateful for that but…” (Makoto)</p><br/><p>My last words were getting lower.</p><br/><p>“That you are able to speak with us is not a divine protection in itself?” (Eldo)</p><br/><p>“That is ‘comprehension’. She told me that it would be filthy to give me divine protection!” (Makoto)</p><br/><p>I really don’t want to remember it.</p><br/><p>The chief dwarf seemed to be thinking something.</p><br/><p>“T-Then, waka-sama is a hyuman that is not linked to any influential power right?” (Eldo)</p><br/><p>“Of course. Also, can you please stop it with the hyuman hyuman? It feels better to be called human” (Makoto)</p><br/><p>“Human huh. It’s the name of the ancient residents. Some call them the forefathers of the hyuman” (Eldo)</p><br/><p>“Whatever. But I am a human. Well, because of circumstances I have reasonably powerful maryoku and physical power” (Makoto)</p><br/><p>Tomoe said, ‘there is no way a person that can punch a dragon can be ‘reasonably powerful’, and faced the other side.</p><br/><p>And Mio, ‘that maryoku, and his flesh and blood are a supreme delicacy-de gozai masu!’ she said with a vigorous expression.</p><br/><p>I can’t hear you, I can’t hear anything at all.</p><br/><p>“I am relieved. We are existences that disagree with the goddess. We don’t hold hostility though. Also, we don’t have any hyuman or demon race we can call comrades” (Eldo)</p><br/><p>“That is. You guys are self-dependent huh~” (Makoto)</p><br/><p>“But you are interesting. The idea of a mirage city. The ability to speak with us, and that over the top maryoku” (Eldo)</p><br/><p>It would be interesting to follow you.</p><br/><p>Is what he said.</p><br/><p>“Awawa. I am not that great of a person though” (Makoto)</p><br/><p>“Fufufu, then, I am sorry for this long talk. Later in time I will bring a product as a greeting” (Eldo)</p><br/><p>The chief steps back. He must have taken it as humility. And, an over the top maryoku he says.</p><br/><p>Is maryoku something that can be seen?</p><br/><p>“Then, it seems the next is me” (Tomoe)</p><br/><p>It’s Tomoe. As always, she seems to be in good humor.</p><br/><p>The blue scaled lizardmen all stand in formation. What a magnificent view. It makes me think that they are a trained army.</p><br/><p>“Waka! The ones behind me are my kin, mist lizardmen-da. Water and wind, it’s a rare strong race that can control both of those elements. Their special trait, no matter how you see it, it’s their beautiful blue scales-da” (Tomoe)</p><br/><p>“It’s the first time I learned that you had a kin” (Makoto)</p><br/><p>“Taken into account the ones who venerate me by themselves, there are quite a lot you know? And taking also the ones that call me a God and boom. But these are the ones that are most closely related to me, just what you would call a kin. The warriors here would be able to go against a lower-dragon” (Tomoe)</p><br/><p>“That is pretty impressive. Moreover, this presence, their specialty must be group battles. They are practically at the level of weapons” (Makoto)</p><br/><p>“It is unusual that you say it. Also, it is surprising that you are able to see through their quality. Well, from today on this 108 fellows will be migrating here. Together with them, please take care of us” (Tomoe)</p><br/><p>Tomoe lightly lowers her head. Matching her, the lizardmen also expressed their thanks with movements that seemed to have been trained beforehand.</p><br/><p>Really, these guys are too good for Tomoe. If one of them is able to go against a lower-dragon then, the moment they work as a group. Depending on their application, they can become incredible.</p><br/><p>Even if they are called warriors, they give me more of a knight impression so they may not be able to move like a special corps but there is no doubt they are elite existences.</p><br/><p>Next one is Mio.</p><br/><p>“Waka-sama, the ones behind me are my kin, Arke-de gozai masu. These guys were also the same as me, without being able to escape their starvation. But thanks to having received the energy of waka-sama they have returned to their senses so I brought them here” (Mio)</p><br/><p>Arke. I don’t know about them.</p><br/><p>As expected, the kin of Mio is a being I haven’t heard and has no relation to my previous world.</p><br/><p>Eh, that is not the point.</p><br/><p>Energy? What does she mean by energy?</p><br/><p>She probably just gave her a bit of my maryoku but to call it energy, I don’t like it. (TN: she calls it  = sei, which can also mean semen)</p><br/><p>More like, how did she even share it?</p><br/><p>“H-How did you share something that can’t even be seen?” (Makoto)</p><br/><p>I spoke in honorific. Asexpecteditbecomessomethingsticky?</p><br/><p>“Well that is of course, like this-desu wa!” (Mio)</p><br/><p>It was faster than Mio explaining so she called one Arke that was close by and somewhere around its shoulder she pierced her hand in. Piercing.</p><br/><p>“Hey!!” (Makoto)</p><br/><p>Without thinking, my voice came out.</p><br/><p>“~~♫”</p><br/><p>But the pierced Arke seemed to be feeling good.</p><br/><p>E, Ew?!</p><br/><p>All of these guys are the same type?!</p><br/><p>So they have increased into mini-mio and puppy-mio?! A, my headache…</p><br/><p>From the pierced part that Mio is feeding the kin with, something was flowing from it. So this is what she said about sharing.</p><br/><p>How violent.</p><br/><p>“Yeah~ I understand now, no, I have understood it. It’s alright now Mio” (Makoto)</p><br/><p>“Yes. Thanks for your time” (Mio)</p><br/><p>She pulls out her hand. Without even bleeding, the wound just closed. That mysterious method was also inherited. These guys are also plenty cheat.</p><br/><p>“We, called, Arke. Name, don’t have. Please, take care, of us”</p><br/><p>It seems they are not that good at speaking.</p><br/><p>But they slowly and surely speak to me. They might be pretty diligent people.</p><br/><p>Also, I think they were living on their own and they had no one they could speak to in their surroundings. That’s why they must have had no need to speak.</p><br/><p>And Mio was also starving like them. No, she was.</p><br/><p>“You were missing the ‘from now on’ you know? Do you want to be eaten huh?! An?!” (Mio)</p><br/><p>From what Yakuza group are you!</p><br/><p>“Mio, its fine! They were able to speak well. In order, they should just slowly get used to the live in here” (Makoto)</p><br/><p>When Mio slowly steps back, the Arke felt relieved and agreed with me.</p><br/><p>This team makes me worried about the future…</p><br/><p>“I and the Arke can produce a special material inside our bodies. Also, we have knowledge of alchemy from ancient times-gozai masu. I hope it helps you in any way. Then, we may be an unworthy kin but please do take care of us from now on, waka-sama” (Mio)</p><br/><p>Blacksmithing we have dwarfs, sewing Arke, in battles we have mist lizardmen, and for basic works we have the tenacious highland orcs and we can also count on the lizardmen.</p><br/><p>Fumu, it looks like its taking proper shape. There is a shortage in the number of people though.</p><br/><p>And so, the introductions were all finished, and because we did this I was delayed in my visit to the town.</p><br/><p>Anyways, now I am able to go. After one hour or so of walking, there is the most anticipated hyuman town.</p><br/><p>Finally I can meet with human beings!</p><br/><p>“Yeah, so then everyone, I look forward to working with you. If you want to hear any details ask my followers. Tomoe, Mio. Instruct Eldo-san please. The place that you will live can be freely chosen but, make sure not to fight. I am going to be heading to town. It’s close by so I will be going alone” (Makoto)</p><br/><p>“Isnt it dangerous to go alone?” (Tomoe)</p><br/><p>“That’s right, I will accompany you” (Mio)</p><br/><p>“No, it should be alright. Compared to before, this is definitely safer. Also, all these people, if there is no one who will direct them it would not be controlled properly. Don’t worry, if everything goes well I will stay there for one night and return tomorrow. Then” (Makoto)</p><br/><p>Saying that, I leave the gates without even eating breakfast.</p><br/><p>Tomoe and Mio seemed to have consented to it. They are not following me so that’s what I think.</p><br/><p>If a confusion in Asora occurs I will just have to resolve it later!</p><br/><p>Right now I should go to the town.</p><br/><p>It’s already been one week since I got here.</p><br/><p>Without meeting anyone. Moreover, almost dying twice.</p><br/><p>It’s already time for me to meet human beings!</p><br/>\n</div>"}