{"title": "Chapter 38: Is the elixir supposed to be boiled?", "id": 38, "volume": 1, "url": "http://boxnovel.org/tsuki-ga-michibiku-isekai-douchuu-chapter-38-is-the-elixir-supposed-to-be-boiled", "volume_title": "Volume 1", "body": "<h1>Chapter 38: Is the elixir supposed to be boiled?</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>The Rembrandt Company seems to be bigger than I originally thought.</p><br/><p>The place I went to last time was only a store. I thought that place was a store and a residence at the same time!</p><br/><p>Today we are going to compound the elixir. Now, let’s watch the proper young man in his natural habitat, alchemy.</p><br/><p>I was going in an unusually relaxed manner to the Rembrandt residence but…</p><br/><p>Their plans were speedier than what I thought they would be.</p><br/><p>They are going to have the compounding done as soon as possible and administer the dosage.</p><br/><p>As expected, since they were told something that wasn’t planned, they were impatient.</p><br/><p>The image of alchemy here is to use a giant pot or vase to throw a lot of things in it and wait for it to boil for a long time.</p><br/><p>I won’t say that it reminds me of witches.</p><br/><p>Is he okay with showing two adventurers like us his ill wife and two daughters?</p><br/><p>I don’t know the conduct of this world though.</p><br/><p>I feel like a girl would hate to be seen by an unknown male in a state where they can’t even put on make-up properly.</p><br/><p>Is it really okay? The husband and father, Rembrandt-san, gave his okay, so it shouldn’t become a serious thing.</p><br/><p>Umu~</p><br/><p>However, when I use my two followers as standards, there is no such word as needless anxiety in this world.</p><br/><p>The merchants are probably the sane type. I am scared but, let’s believe in that.</p><br/><p>“Raidou-san, it is my miss that I jumped to the elixir talk and didn’t ask the circumstances. But you know, I would have liked if you said that it was the Rembrandt Company beforehand!”</p><br/><p>The proper man was nervously talking to me in the reception room.</p><br/><p>Hearing the name of the elixir, he gave me an immediate okay, so it is truly his miss for not asking first. Honestly speaking, there was no fault in me.</p><br/><p>By the way, it was out of my expectations that the Rembrandt Company was a pretty established name, moreover, an extremely rich one.</p><br/><p>Thinking about it, it was not just a well-established one, but a major company as well. Geez, if I had previous knowledge of how their residence looked, I would have come better dressed.</p><br/><p>I should have just asked the dwarfs to mend those experimental clothes. To have the same clothing as when I am travelling is clearly inappropriate.</p><br/><p>We are waiting in a reception room that is even bigger than my inn, sitting on a sofa that felt as if we could sink in it.</p><br/><p>The drink that was on the table in front of me had a smell of syrup.</p><br/><p>I, who normally spreads out a search perimeter in my surroundings, am not doing it. Or more like, I basically don’t do it indoors.</p><br/><p>Outside I would pay attention to the houses and presences in my surroundings, at interiors, even if I search for strange presences, I don’t research the insides of the building itself.</p><br/><p>I think this is half-assed, but I was raised in a world where privacy is strict and because of that I practice restraint.</p><br/><p>Furthermore, inside this residence there is a wife and two daughters in an ill state.</p><br/><p>As expected, I wouldn’t feel good hearing their conversations or watching them.</p><br/><p>[This is my first time in Tsige, so I didn’t know about the Rembrandt Company]</p><br/><p>“… Hah~, now that you mention it. Well, I am sorry. In this Tsige, it is a pretty big name. It is to a point where I would honestly have a hard time staying here if he were to glare at me.”</p><br/><p>[I see. If that’s the case then, it is natural for you to be nervous]</p><br/><p>“That’s right! Moreover, a request to produce the elixir, Ambrosia! Even though the manufacturing method has already been prepared, I haven’t been able to calm myself since a while ago…”</p><br/><p>Will there be retribution if it happens to fail? No, in normal cases there shouldn’t be.</p><br/><p>Because he is a merchant you know? Not the mafia. And the said person looks more of a martial artist than a merchant, the suit doesn’t match him that well.</p><br/><p>…, no wait, wouldn’t he look unexpectedly good if he were to wear one? The thick-chested sport players do look good in suits so.</p><br/><p>[It should be fine. They did say that if there was a level 80 it would be easy to produce]</p><br/><p>“The elixir Ambrosia. I have heard that it’s an almighty medication made from the nectar of the Kanbana Ambrosia. Just what kind of production method does it have and what type will it come out as?” </p><br/><p>He is mumbling by himself and entering his own little world, saying, ‘it’s not like this and neither like this…’</p><br/><p>It’s to a point where I would want a follow for the ‘it will be alright’ consolation I gave him, geez.</p><br/><p>Rembrandt-san and the butler-san haven’t arrived yet.</p><br/><p>How long are they planning on having us wait in this mansion?</p><br/><p>I had already drunk about half of my drink (Probably a type of tea) and the moment it was beginning to cool down, a maid-san came and changed it to a new one with perfect skills.</p><br/><p>They have already confirmed the level and job of the young man with his guild card, so there should be no issues but…</p><br/><p>Hn, what was the name of the young man that has a pale face?</p><br/><p>I can’t remember it no matter how hard I tried. I really shouldn’t have drunk that much in the first day that I arrived here.</p><br/><p>I remember the names of Toa and Rinon though~. The other members, I have a vague recollection of… No, sorry, I actually don’t remember.</p><br/><p>“I apologize for making you wait”</p><br/><p>Finally hearing the sound of the door opening, we turn to look at the source.</p><br/><p>Rembrandt-shi and his butler-san.</p><br/><p>Finally.</p><br/><p>“We have prepared everything so we have come to receive you. The facilities are in the basement, so I will guide you there”</p><br/><p>“If I remember correctly, Raidou-dono will also be observing. Please go along with Hazaru-dono” (Rembrandt)</p><br/><p>[Rembrandt-san will not be coming?]</p><br/><p>“I will be going to where my wife and daughters are first. I will be guiding you when the elixir is done, so let’s meet at that point in time.” (Rembrandt)</p><br/><p>He must want to stay by the side of his relatives that are going to be healed.</p><br/><p>Well of course, if there is a butler that you can trust in, it would be better to stay with your relatives instead of looking at the production of a medicine you wouldn’t understand anything about. He can also give them peace of mind after all.</p><br/><p>[I understand. Then, let’s meet at a later time]</p><br/><p>I personally have an interest in alchemy. I don’t think that watching the production of a medicine and the magic of it is a habitual sight so.</p><br/><p>Anyways.</p><br/><p>I look at the pale face of the young man that is following the butler-san.</p><br/><p>I see, so his name was Hazaru.</p><br/><p>Thinking such a rude thing, we followed the butler-san and headed to the basement.</p><br/>\n</div>"}