{"title": "Chapter 41: Determining my path", "id": 41, "volume": 1, "url": "http://boxnovel.org/tsuki-ga-michibiku-isekai-douchuu-chapter-41-determining-my-path", "volume_title": "Volume 1", "body": "<h1>Chapter 41: Determining my path</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 41: Determining my path</p><br/><p>[Now, quickly use the medicine]</p><br/><p>I was restraining the arms and body from behind, perfectly immobilizing the wife who has lost all sense of humanity.</p><br/><p>I don’t know how she was before, but her hair that was falling down, her cheeks that were hollow, the bloodshot deep crimson eyes, as well as the saliva that was oozing from her mouth, they were all strong images that made me think of her as a ghost. Even if she were in between a horde of zombies I wouldn’t see any difference.</p><br/><p>What was it? The one where the main character was living accompanied of a dog in a world that was destroyed because of a virus. She looks like one of those people that were infected by that virus. </p><br/><p>Well, a ghost is also plausible. Who would believe that this was once a beautiful wife? (I haven’t seen her before though).</p><br/><p>Her legs were still rattling, but it proves no problems for someone to make her drink the medicine.</p><br/><p>With the wife in her current state, even my face looks decent.</p><br/><p>While thinking something like that, I began to consider showing my face to them when all of this is resolved.</p><br/><p>Outward appearance, I feel like something like that won’t matter anymore.</p><br/><p>If there are people that care about it, I can just have Tomoe or Mio change their mind.</p><br/><p>Moreover, to hide my face would affect the faith they would have on me.</p><br/><p>Because I actually want to live my life as a merchant, hiding my face is not an option.</p><br/><p>And I have decided on handling the medicine department. I don’t want to see another family lose someone in this kind of unreasonable situation.</p><br/><p>Even I think that this may be a hasty decision, but I don’t care about it.</p><br/><p>That’s why I decided on revealing my face. I think that people will get used to it after seeing it numerous times.</p><br/><p>“A-Are you really a level 1?” (Rembrandt)</p><br/><p>Rembrandt-shi says surprised. It’s a given. Because level 1 is a number that is even lower than him after all.</p><br/><p>[Don’t mind it, concentrate on the medicine. Don’t tell me that at this point in time you are worried about getting bitten, right?]</p><br/><p>“Such a thing won’t even become an issue!” (Rembrandt)</p><br/><p>He was surprised by the fact that I was able to restraint her by myself, but with my challenging words, I was able to make him take action. In reality, it wasn’t like the body structure changed, so it is natural that the grapples which are effective on people to work here.</p><br/><p>And I have a body that surpasses the norm after all. Just because she is ignoring her limits won’t pose problems for me.</p><br/><p>However, the power of a person’s jaw is something that is stronger than I thought.</p><br/><p>Even more so on this woman that has removed her own limiter. For people that are not adventurers, this power would be enough to scare them.</p><br/><p>But without fearing the teeth that had changed to fangs, the man drained the contents of the medicine in her mouth. From his face, I could feel a determination that told me he wouldn’t mind even if all of his fingers were bitten off.</p><br/><p>Maybe the body of the wife was beginning to feel the changes, her body started to convulse and the symbol of her madness, the scarlet eyes, were growing dimmer.</p><br/><p>Her outward appearance didn’t change drastically, but her whole body began to lose strength and her breathing grew constant.</p><br/><p>“Oh, Risa. With this… With this I will be able to speak with you again right? It’s bringing a smile on my face” (Rembrandt)</p><br/><p>He has been crying and crumbling on the floor a lot. Of course, I wouldn’t say such a thing in this kind of situation though. He is weeping manly.</p><br/><p>The butler, Morris-san, was expressionless, but he was wiping his tears.</p><br/><p>[Now then, which daughter should we begin from? I think we should prioritize the one that is in a worse state though]</p><br/><p>If Hazaru is able to make it, we will have the last elixir we need. But in the current situation, we have to make a choice.</p><br/><p>Well I heard him confidently say that ‘it’s a wasteful manufacturing process’ so I think he is doing his best and will manage somehow.</p><br/><p>He is not a 3 digit level just for looks after all.</p><br/><p>“Hngh~, y-you are right. Even though it’s not over yet, I am sorry. If we are talking about my daughters, the smallest one is in a worst state. Let’s go treat her first” (Rembrandt)</p><br/><p>Even if he was trying to put himself together, his face was still red from crying so much. Please stop your nose snot, nice middle-aged man.</p><br/><p>[Understood]</p><br/><p>We once again walk for a bit.</p><br/><p>It seems that her daughter wasn’t in the room next door.</p><br/><p>Of course.</p><br/><p>Because at the moment when the medicine was broken, the three of them would have attacked. His life would be gone in that case.</p><br/><p>It seems that the range where the person can detect the medicine is not that wide.</p><br/><p>“It’s inside here” (Rembrandt)</p><br/><p>Saying that, Rembrandt-san points at a door that was deep in the corridor.</p><br/><p>[I understand. I will be doing the first move. Please give me the key]</p><br/><p>“W-Will you be alright?” (Rembrandt)</p><br/><p>Even though he saw me do it before, he still asked me anxiously.</p><br/><p>[No problem. When I have restraint her I will sent you a signal with light magic. However…]</p><br/><p>I intentionally cut off my words to create the atmosphere.</p><br/><p>The two people gulp.</p><br/><p>[If I touch her breast or ass by mistake, please don’t get angry, Oto-san*] </p><br/><p>“?!?!”</p><br/><p>They were clearly caught off guard, both of them looked at each other and waved their hands weakly while giving me a sidelong glance.</p><br/><p>It’s no good to be too tense after all~. I hope he lets it slip as a joke though.</p><br/><p>“How to say it…”</p><br/><p>“What a big-shot”</p><br/><p>“Yeah. He is quite the person”</p><br/><p>I wasn’t able to catch the words that both of them exchanged while smiling bitterly.</p><br/><p>*Click *Open</p><br/><p>Hm, she is not on the bed.</p><br/><p>The dark interior was quiet.</p><br/><p>With a calm face, I spread out a search area.</p><br/><p>There she is.</p><br/><p>She is in a place that is a blind spot for me. I don’t know how she did it, but she was at the left side ceiling while I was looking at the bed. She was clinging to that corner and looking at me. Are you a monkey? Are you Spiderman?</p><br/><p>Purposely showing her my back, I walk a few steps.</p><br/><p>When I did that, she leap onto me. It seems that the scent of the elixir was also stuck on me. In this case, it can be considered a medium level misfortune.</p><br/><p>Because she is considering me a hindrance after all.</p><br/><p>Her condition was better than the wife, but her short build and quick-witted part was ferocious and intense. Her stamina was also bigger.</p><br/><p>I should prepare myself better for the last one.</p><br/><p>While still having my back turned, I grab the left hand of the girl that plunged onto me.</p><br/><p>Just like that, I turn to her back and restrain her remaining right hand. Shifting my body once more, I made it so that I would be able to hold both of her arms down with one hand. In this position, even if she tried multiple times to bite me, I would be able to evade it. If I pay attention, I can do evade it with slight movements. I can deal with it in a calm manner.</p><br/><p>With the free hand I had, I hold her head down and take away her freedom. Yosh, okay.</p><br/><p>Entwining both of her legs from the inside… done.</p><br/><p>Sitting on top of her, I was able to seal her movements perfectly.</p><br/><p>In this position, I signal the other party with light magic.</p><br/><p>Hearing the footsteps, Rembrandt-san and the butler Morris-san entered.</p><br/><p>[Please have her drink the elixir quickly]</p><br/><p>Seeing the medicine, she once again tried to rampage. I hold her down, taking away all her strength and urge them on.</p><br/><p>It is better if she suffers the least amount of damage in her body after all.</p><br/><p>“Thank you. I truly thank you very much!” (Rembrandt)</p><br/><p>After that, her breathing began to grow constant like in the case of his wife. Releasing her, I take her back to her bed.</p><br/><p>After doing that, a number of maids entered the room and began treating the girl and clean the room.</p><br/><p>I see, I didn’t think of this. Maybe it’s the butler-san that is being attentive, or it might be Rembrandt-san.</p><br/><p>And then, rough and rude footsteps were heard.</p><br/><p>“Hah~Hah~! Raidou-dono, I was able to somehow make one more! The ingredient was the elixir itself, a creation of this Hazaru- ah?!” (Hazaru)</p><br/><p>Are you an idiot?!</p><br/><p>How is it possible that you stumble again?!</p><br/><p>The distance is way too much so it is impossible for me to do a follow-up! Moreover, I am right now having a pleasant time with this young girl!</p><br/><p>Well, my worry was unneeded.</p><br/><p>With clever movements, Morris-san was able to protect the medicine.</p><br/><p>It’s to the point that I want one of him on every house. More like, I began to seriously wish for him to come to Asora. I want him to be my counselor for common knowledge!</p><br/><p>And, Hazaru. This night’s meal will be on you. No matter if it’s good or bad, I will chomp down like no tomorrow! Of course, after I punch you in the face!</p><br/><p>“For bringing us this miracle today, I thank you. Oh Goddess, thank you” (Rembrandt)</p><br/><p>Please don’t go thanking that particular one. It makes me lose my strength.</p><br/><p>I negated from the bottom of my heart the prayer that Rembrandt-san did.</p><br/><p>The other girl was faster and stronger than the previous daughter, but in my point of view, there wasn’t that much of a difference.</p><br/><p>The problem is if the medicine that was made with the remaining ingredients will actually work. But Hazaru said that he properly compared the components of the elixir, so I decided to believe in him.</p><br/><p>More like, the girl still held a bit of her reasoning, and as if fighting against the flickering light of her eyes, she repeatedly said ‘Run away’ while attacking me. This part was actually harder for my heart to handle.</p><br/><p>I already knew that she wouldn’t understand me, but I told her that ‘It is okay, I have come to save you. Wait for a bit’.</p><br/><p>Sorting out my own emotions, I call Rembrandt-san and have her drink the medicine.</p><br/><p>Fuh~</p><br/><p>Leaving the girl on the bed, I take a deep breath unintentionally. I have accomplished a big job, so it should be okay for me to do it.</p><br/><p>“How to say it…? I think that Raidou-dono being a merchant is like completely ignoring your own aptitude” (Hazaru)</p><br/><p>The young man said something incredibly rude that didn’t fit his age.</p><br/><p>Moreover, Rembrandt-san and Morris-san are agreeing!</p><br/><p>“It was a splendid restraining ability. I think that being a level 1 is some kind of mistake”</p><br/><p>“I think that you are more fit as an adventurer”</p><br/><p>Even though I have already decided to do my best as a merchant. As a senpai, please don’t say such things!</p><br/><p>“I am being trained by my followers so” (Makoto)</p><br/><p>“Ah, if it’s something like that, I can comprehend. After all…” (Hazaru)</p><br/><p>Hey, Hazaru. You have been causing blunders one after the other so please stop.</p><br/><p>I will be giving you a lecture in air reading using physical language you know?</p><br/><p>“Your two followers are both over level 1,000~” (Hazaru)</p><br/><p>GOD DAMN!</p><br/><p>This thoughtless Hachibei-san*, what have you done? </p><br/><p>Looking at the two people that were stiffened by his statement, I turn to the sky and grieve. At least learn to distinguish between things that you can say and thing that you can’t…</p><br/>\n</div>"}