{"title": "Chapter 45: Talking with the dwarfs in a drinking party", "id": 45, "volume": 1, "url": "http://boxnovel.org/tsuki-ga-michibiku-isekai-douchuu-chapter-45-talking-with-the-dwarfs-in-a-drinking-party", "volume_title": "Volume 1", "body": "<h1>Chapter 45: Talking with the dwarfs in a drinking party</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 45: Talking with the dwarfs in a drinking party</p><br/><p>It’s already been a few days since the talk with Tomoe, and it was to the point that made my head go in circles.</p><br/><p>The reluctant Onee-san opposed to my decision of making my company a ‘Do Anything Store’.</p><br/><p>I told Toa-san and the others the situation and left Tomoe in their custody.</p><br/><p>I know that I am being a bit naïve, but with what happened on Zenno, I can’t help but feel bad. And Rinon is the first person that I have been involved with after all.</p><br/><p>From a third-person view, this bunch would look like people that were involved with loan sharks and ended up digging their own grave.</p><br/><p>Will they just indulge in their temporal luck, or will they grow up from this experience? I honestly don’t mind whatever they do. If they level properly from now on, I can expect something from them. In case my wallet doesn’t swell enough…</p><br/><p>Will they turn me down?</p><br/><p>…</p><br/><p>I have no confidence.</p><br/><p>Toa, huh. I haven’t asked her age but, as expected, she is Hasegawa! She is practically her. It’s like, when you see two similar, you will find three. There is only one in this world though.</p><br/><p>She is obeying Mio and Tomoe. And she also uses polite speaking with me, which reminds me of my kohai!</p><br/><p>No matter what I do, I end up backing her.</p><br/><p>Since the time we arrived to Tsige and did a party, I have managed to leave a certain distance between them, but it is hard to control myself.</p><br/><p>Even if I know that the two are different people, I end up looking after her. Even though I know that it won’t benefit either of us.</p><br/><p>I want her to be independent, but I want to look after her. Those sisters are, in a sense, a hardship. After the Goddess and my followers though.</p><br/><p>Right now I have left Tomoe with them to learn how to act and to walk around the wasteland.</p><br/><p>Even with how she is, Tomoe is actually a person that can handle people well. She is not a dragon for anything huh.</p><br/><p>That’s why, the other job that I left her, she has been able to properly do it.</p><br/><p>After returning from her requests, she used that time and found a good land for the store. Saying that she won’t be renting, but buying it, made the seller happy.</p><br/><p>While I was going to all the residents of Asora, hearing their petitions, I made appointments with Rembrandt Company and have done several meetings with them. I received permission to join the store of Rembrandt Company as a tenant. (As expected, saving his family made the negotiations proceed smoothly)</p><br/><p>I have also gathered information regarding Academy Town.</p><br/><p>Time flies like an arrow, or so they say.</p><br/><p>And so, at the six day.</p><br/><p>Eh, that I have been talking all grandiose and it hasn’t even been one week?</p><br/><p>Geez, it was seriously hectic you know? Every day, every single day was an instant.</p><br/><p>I finally received the report of Mio finding the ambrosia. Wanting to confirm if they could get used to the environment of Asora, I accompanied her. Then took a few stumps of the flower and placed them on areas that had the closest resemblance to their own environment. I left the supervision of it to the Arkes that were close by.</p><br/><p>The Arkes, even with those looks, are actually good at taking care of plants. Umu, I shouldn’t judge someone by their appearance. Their learning capability is also pretty high. Right now they are able to speak with everyone normally.</p><br/><p>There was the problem of not having enough qualified people, but it’s going pretty well.</p><br/><p>Tomoe seems to be learning properly regarding the raw materials of demonic beasts and mamonos, and over here I am resolving the problems of this land, but there are no pressing issues. Toa-san and the others seems to have changed their class, and their levels seem to have increased quite a lot.</p><br/><p>They are most likely done with their rehabilitation since the time of the debt. I have asked a few times about how they are and we are able to speak without minding much about each other. Seeing that, I am able to continue my day without worrying too much.</p><br/><p>Ngh, my naivety came out again. I have to be careful.</p><br/><p>Tonight will be the return of the Arkes and Mio. And the time I have been in Asora has increased, so the delighted residents made a party to celebrate that. I am happily participating in it.</p><br/><p>They are really good people. Their passion is a lot more profound than those hyumans.</p><br/><p>I tried to, but as expected, because of the impact of their outward appearance, I have been unable to open up to them. And I use writing to speak. And my common language still ends up in groaning. Umu, everything is the fault of that Goddess.</p><br/><p>As a merchant, I can’t continue like this. As expected, after 3 days I have already gotten tired of looking at them, well not like that but, it is to a level that I am able to get a good impression of them because of their outward appearance.</p><br/><p>Even though they are beautiful in person, we are a business here so it should be fine. Certainly. Most likely. Maybe.</p><br/><p>“Waka-sama is staying in a town after leaving the wasteland. How is it, the hyumans’ town?”</p><br/><p>One of the dwarfs begins talking to me with a face completely red. He reeks of alcohol.</p><br/><p>“It’s a good energetic town. Maybe it’s because they are in a remote region, they don’t hold prejudice on demi-humans, or more like, they float around the high leveled Tomoe and Mio” (Makoto)</p><br/><p>“Ha ha ha ha!! That is pleasant! Well, with those two in town it is obvious that they would make a racket!”</p><br/><p>“Seriously. Especially Tomoe, since the time she left to hunt, she has obtained a mountain of raw materials. The wholesale guys that handle materials are already treating her like a hero” (Makoto)</p><br/><p>“I am jealous of the two girls that can be your companions. They must be overflowing with impetus every day!”</p><br/><p>Impetus every day, huh. That is exactly how it is though.</p><br/><p>I see. The people in Asora are always in Asora after all. To feel a bit caged isn’t that strange.</p><br/><p>Then it would be better to give them a way to exit Asora as well. Right now it is impossible to leave this place without my permission.</p><br/><p>I have no intentions of leaving them caged but, certainly, there are times when you want to go out.</p><br/><p>“Waka-sama, what’s wrong? Suddenly going silent”</p><br/><p>“Ah, don’t worry. As expected, being in Asora is too straining huh” (Makoto)</p><br/><p>When I said that, the dwarf that heard it went *kyoton*, and looked back at me.</p><br/><p>“Eh, huh? Did I say something weird? I only thought that you wanted to go out once in a while~ though” (Makoto)</p><br/><p>“Waka-sama, look carefully. Right now it’s being enveloped by darkness but, where in this world do you think that there is a sense of closure? We still don’t know how far the limit is, and are only able to see that mountain range at the distance. And the other day, a large river appeared. The creation of the city has barely begun”</p><br/><p>“Eh? Uhm…” (Makoto)</p><br/><p>“Moreover, the harvest is plentiful and as of now we haven’t encountered any dangerous species! For us, this world is a place where we can’t ask for anything more, a paradise!”</p><br/><p>What insistence.</p><br/><p>I see. From my point of view, this is a garden-like world that was created by Tomoe’s power, but, in reality, it is incredibly vast, and the pioneering is still in its beginning steps. There are unknown frontiers here and there.</p><br/><p>So for the people here, there is no sense of closure huh. I see, I feel a bit relieved by that.</p><br/><p>“On top of that, we have Waka-sama and the others who hold a power that is outside of norms. People that even when we use all of our knowledge and techniques we are still unable to reach. There is no better happiness than being able to create weapons for you. Even the great elder is doing all nighters every day”</p><br/><p>The dwarf-san laughs with a gahaha. More like, great elder-san, don’t overexert yourself! Even though you are already pitiful for being told by Tomoe that your name elder dwarf is too long and to make it eldwarfs!</p><br/><p>“However, I want to try going out. There is certainly that kind of emotion in me. I have an interest in what has the world’s equipment evolved into”</p><br/><p>“Ah, an interest as a craftsmen huh” (Makoto)</p><br/><p>“Yeah. What level of things they are looking for, that kind of interest is also involved”</p><br/><p>‘If we make poor things and it becomes an uproar, it would be troublesome for Waka-sama’, is what he said after that.</p><br/><p>Certainly. We have been luring in several adventurers and having them take a number of items so, it would be better if there are one or two craftsmen that understand this.</p><br/><p>The Arkes… are impossible as expected. They will have to practice a bit more in their transformation ability before letting them out. It is just a matter of time before they learn a technique to take the form of a hyuman.</p><br/><p>There is no real issue in letting the dwarfs out now. In Tsige there are a number of dwarf adventurers after all. And even if they are elders, their appearance isn’t that different.</p><br/><p>“Then, how about going to the town we are in, while looking after the shop?” (Makoto)</p><br/><p>I have already confirmed that there won’t be any problems in letting a demi-human be a member of my company. The registration to the guild is troublesome, but the process itself isn’t that different from a hyuman’s.</p><br/><p>“Oh! That sounds fun!”</p><br/><p>“Then, please gather a number of people please. I will be meeting them at a later time. In the demi-humans species, the dwarf is one of the races which has blacksmiths that create outstanding equipment after all. Maybe there will be requests for weapons” (Makoto)</p><br/><p>“Hoh! Is it okay for us to accept them?!”</p><br/><p>“If it’s possible I want you to accept them. I also want to know the level of weapons that town will be asking for. It would be even better if you hear the wishes of the requester instead of suggesting them yourself. There is also the option of rejecting it if their request is a pathetic one” (Makoto)</p><br/><p>“I am looking forward to it. It puts me in the mood of opening one of those festival carts that Tomoe has told me about!”</p><br/><p>Tomoe, what are you teaching the dwarfs? The festival carts have an image of being expensive and have no good bargains in them though.</p><br/><p>But now that I say it, it’s unusual. It could be the perfect thing to get kids in the festive mood. It would be good for the craftsmen that have been making the equipment for me and my 2 followers with all their effort.</p><br/><p>The dwarf that was my talking companion called some friends and told them right away the conversation we had, and we began a merry discussion.</p><br/><p>I once again look at my surroundings. Everyone seemed to be cheerful and having fun while drinking alcohol.</p><br/><p>Lizard, Arke, Orc, Tomoe, Mio, Tomoe… Tomoe?</p><br/><p>Uwa… Did I get drunk? I see two Tomoes. No, there ARE two Tomoes.</p><br/><p>Ah, she is jumping up and down with a cup of sake in her hands, it must be that so called clone huh. Now that I look at it closely, she is smaller and its only two heads big.</p><br/><p>That clone is the role of brain in here and doing various things huh. Umu, thinking like that, I am beginning to feel that her unfit drinking style is actually quite pretty.</p><br/><p>I am relieved to see that everyone is getting along well.</p><br/><p>Using a day like this to dance and drink creates a fellowship between us.</p><br/><p>The various races are living in one place, so it is important to make this kind of events. With the implication of creating a new culture as well.</p><br/><p>It will be easier to blend in if the culture is the same after all. If Ema-san has thought about it up to this point, it seems that she has talent as a statesman.</p><br/><p>… If she is just a festival lover, it will reduce my stress in the future though. Moderation is the best. Moderation.</p><br/><p>Honestly, I don’t want to interfere myself in the affairs of Asora~. Them looking at me so highly would make my words like that of a King, and it would end up as if I am driving them to a wall against their will.</p><br/><p>Even though I say that I don’t interfere, I still pretend to talk with the new residents that come. As expected, I think it is important to speak with the people that will be living with you all the time.</p><br/><p>Now, the party has calmed down a bit so. Each races’ moms and kids are slowly leaving. The ones left are the heavy drinkers.</p><br/><p>I should return to my bed now.</p><br/><p>Ah, that’s right. Let’s shoot the bow that I haven’t used for a while. Archery calms my mind after all.</p><br/><p>Okay, let’s do that.</p><br/><p>Then…</p><br/><p>I will stealthily slip out and enjoy myself.</p><br/>\n</div>"}