{"title": "Chapter 50: My reliable blue dragon", "id": 50, "volume": 1, "url": "http://boxnovel.org/tsuki-ga-michibiku-isekai-douchuu-chapter-50-my-reliable-blue-dragon", "volume_title": "Volume 1", "body": "<h1>Chapter 50: My reliable blue dragon</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 50: My reliable blue dragon</p><br/><p>Fu…</p><br/><p>Fufufu…</p><br/><p>Fufufufuhahahahaha!</p><br/><p>I knew it. I already knew it!!!</p><br/><p>That this world will never be kind with me!</p><br/><p>Yes, this is Misumi Makoto at the scene!* </p><br/><p>I am right now using [Sakai] and both of my hands to handle the arrows and magic that are falling on us, while calming down Mio who is on the verge of snapping by using my left arm to cradle her. Covering for a party of three people that appeared out of nowhere, I am now in the process of negotiating a ceasefire!</p><br/><p>Just what kind of situation is this?!</p><br/><p>Chaos, truly chaos.</p><br/><p>What in the world is going on?! I was seriously trying to hold myself down from screaming.</p><br/><p>There are two enemies. It’s the rumored fairy race.</p><br/><p>One of them is using a bow and sniping us with precision. The problem is that the shot arrows were multiplying and I am having trouble evading them. What a troublesome effect these arrows possess!</p><br/><p>The other one has a short cane and, probably, using superior ancient language. Using magic that is called Ancient, she knits her arias, raining attack magic on our location. The thrown magic explodes before impact and it increases the area of the attacks. It was a ball of ice that spread like a buckshot and invisible wind blades.</p><br/><p>That there is no fire attribute attack that could cause a conflagration is one of the few blessings. These fellows really like propagating attacks!</p><br/><p>Just by the name of superior ancient language it sounds as if it were impressive, but it’s different from the language that I use. Well, as expected of being superior, it is better than the lower in terms of utilizing the magic power effectively in the allotted time. In terms of magic power it may be the number one.</p><br/><p>The two fairies were perfectly exposing their brownish skin and using green grass as their armor. It looks more like clothes than armor. Their weapons are like that, so I think that their armor is also enchanted.</p><br/><p>I thought that stylish green colored clothing would only fit the high-elfs from that cursed island*, but it seems I was wrong. No matter what a beautiful person wears, she will still look beautiful. </p><br/><p>Red eyes and white hair. Their body build looked delicate, and instead of calling it glamorous it was more like slender.</p><br/><p>The one using a bow was one head taller than the one using magic. Those two lined up would make a great picture.</p><br/><p>Yaa~! Please stop your attacks~ Hear us out~!</p><br/><p>“You bastard hyumans! To aim for the crimson flower that takes root in this land, we will provide punishment!”</p><br/><p>It’s troublesome if I die. If that punishment’s choice is only dead, I will avoid it! Would you stop shooting already?! So you guys call the ambrosia, crimson flower! Certainly, the outside appearance was similar to that of a crimson lotus flower.</p><br/><p>“That sin, take it with your life”</p><br/><p>What do you mean by *take it*! Is that modern terminology?! Are you nuts?! </p><br/><p>Throwing me a combination of invisible wind blades and ice buckshots as if she were a demon!</p><br/><p>“I’m telling you it’s a misunderstanding. Listen, I and my follower are not related to these three people. For now, please listen to our story! More like, stop your attacks!” (Makoto)</p><br/><p>“Aren’t you protecting those three for a while now?! If you are not their comrade, then what are you?! Using a magic of unknown origins!”</p><br/><p>I don’t think I can explain [Sakai] in this kind of situation. Even the residents of Asora were half-convinced after all.</p><br/><p>“Moreover, I can smell the scent of the crimson flower from you. You, who has taken it, are now dead or alive!”</p><br/><p>Are you a dog?! What you are saying is all weird, in a lot of meanings! Goddess you bastard, properly translate things! Are we even communicating here?!</p><br/><p>If you are a dog, appear like a dog and be obedient.</p><br/><p>“Wan”</p><br/><p>“Why are you barking?!” (Makoto)</p><br/><p>“Some sort of revelation came from myself, telling me to bark”</p><br/><p>“Revelations don’t come from yourself! Anyways, stop… no, please stop! It’s getting dangerous!” (Makoto)</p><br/><p>This browny-san is weird. If her ears were longer, she would be a perfect dark elf! Though they don’t have a dark atmosphere and the elf nobleness at all!</p><br/><p>“Hey, you! Haven’t you been running away only? If you are able to defeat them, please do so right now!”</p><br/><p>“That’s right, since we have finally found a treasure like the ambrosia! We are going to share some with you, so go and defeat those two!”</p><br/><p>“I’m free~zing, dying~~, this time, for real, I will die~!”</p><br/><p>Shut up, you hyuman trio. From the timing of your appearance, it’s clear that you have been following us! Since when were you the finders?!</p><br/><p>If I knew this would happen, I would have scattered those three that were following me so unskillfully! I shouldn’t have been so cautious as to wait for what they would do!</p><br/><p>I thought they wouldn’t pose any problems, so I let them run about freely, but it totally backfired on me. I admit that I was sort of confident I could handle anything that would come from them.</p><br/><p>By the way, that woman crying about treasure, I remember her from somewhere… If I remember correctly, it’s that brothel Onee-chan. She was an adventurer?</p><br/><p>From hyumans I am called a demi-human, and from demi-humans and demons I am called an ugly hyuman. Just how sad of a bat am I.</p><br/><p>“Waka-sama~ its fine to eat them right? These, it’s fine to kill them right? Those two are wasting so much of your time after all. I will eat them, it’s alright-desu ne?” (Mio)</p><br/><p>“Nooooo! Mio, wait!” (Makoto)</p><br/><p>I deny that dangerous murmur Mio did while in between my arms with all I had! She is definitely planning on eating everything in the area! She is talking while looking at the floor after all!</p><br/><p>All my ways are blocked! I was truly surrounded by all sides (counting my side). What should I do, what would be fine to do in this situation?!</p><br/><p>(Waka. What a pleasant situation you are in) (Tomoe)</p><br/><p>Oh, my first follower! Is it the arrival of a reversal? Is it that? Even when you are surrounded from all sides, there is still the sky?</p><br/><p>(Tomoe, its Tomoe! Can’t you do something about this?!) (Makoto)</p><br/><p>(… Even if I receive an order from a master that has gone to a date with just Mio…) (Tomoe)</p><br/><p>(No, that’s different-jan. I just came here to talk with the fairies-jan. It’s because I felt that if I left Mio alone, they would end up in her stomach!) (Makoto)</p><br/><p>Tomoe, saying that after seeing this situation. You seriously don’t know how to read the mood.</p><br/><p>Seriously just come and save me, Tomoemon*! </p><br/><p>(You even bring hyumans along, it must be pretty fun huh) (Tomoe)</p><br/><p>(They tailed us! Tomoe, I ask of you! It’s fine if you want to make paddy field or katanas or whatever experiment! If you have some sort of plan, please do it!) (Makoto)</p><br/><p>(?! I was waiting for those words! Sure punishment or reward, is this society’s truth! I will drag those three hyumans to Asora, so do a moderate explosion of sorts please. After that, Waka can let go of Mio and have a talk with those forest ogres) (Tomoe)</p><br/><p>Forest ogres!</p><br/><p>They are ogres! Not fairies! Moreover, I made an incredibly stupid promise! I am a 100% sure that swordsmiths and paddy fields will be born in Asora now!</p><br/><p>I have confirmed that they are a pretty grim race. Do ogres enter the fairy category in this world?</p><br/><p>“Kill kill kill…” (Mio)</p><br/><p>Rape face, the rape face came~. </p><br/><p>Rape face</p><br/><p>Mio is going in an incredibly dangerous route. Tomoe-san, I ask of you, please do it fast!</p><br/><p>The forest ogre-san is sending a rain of arrows.</p><br/><p>“DIE!”</p><br/><p>“Please do something!”</p><br/><p>From the forest ogre to the hyuman party. And from the hyuman party to me. The words were flying out.</p><br/><p>The rain of arrows is smoothly flying towards us.</p><br/><p>I make a flame barrier that surrounds all the circumference of the hyumans. The primary element of the arrows is wood. And there doesn’t seem to be any enchantments in the speed so.</p><br/><p>The layer of flame that was spread out from the floor for show was still hot enough to burn them all. It wasn’t hot enough to burn the arrowheads, but if it can at least kill the momentum, it’s the same as not having attack power.</p><br/><p>… Forgive me for the scalds.</p><br/><p>I can tell that the presence of those three has disappeared. The fire wall that appeared all of a sudden made them fall in panic, making them unable to say any words of opposition to Tomoe who took them away.</p><br/><p>So it’s finally only Mio and the fairy ogres left huh.</p><br/><p>“Mio, hey Mio!” (Makoto)</p><br/><p>There’s no response, it seems to be only a corpse~*, no, she is whispering something. </p><br/><p>“I’m so done, I will do it, eat, melt everything and drink it like juice~” (Mio)</p><br/><p>Great. That’s what you will be doing huh?!</p><br/><p>Uuuuh, no choice!</p><br/><p>I was a bit hesitant, but I grabbed a sharp pointed ice shot with the palm of my hands and grasp it with force.</p><br/><p>There were a lot of better ways, but it’s too late for that.</p><br/><p>My blood was dripping. It wasn’t that much okay?</p><br/><p>I bring my wounded hand closer to Mio, who I was carrying in my left arm. Accurately speaking, I sealed her mouth.</p><br/><p>Her murmurs stop. Not because I sealed her mouth, it’s because of the red substance that touched Mio’s lips.</p><br/><p>The feeling of Mio’s tongue in my hand send currents through my body. Geez, drink drink. And then stop your monologue that sounds like a spell of some sort.</p><br/><p>With this, Mio should stop her movements for now.</p><br/><p>Then.</p><br/><p>I will now change my actions of calling out the forest ogres continuously while moving around.</p><br/><p>I look at the girls firmly, and stop my feet.</p><br/><p>“Hyuman, is it an internal fall down?”</p><br/><p>They must be thinking that I burned those 3 people down. From the outside, it certainly looks like that.</p><br/><p>“No, I just isolated them” (Makoto)</p><br/><p>“Movement has stopped”</p><br/><p>She soon points her cane at me.</p><br/><p>I feel a change in the surroundings. This is wind magic huh. I don’t know what kind of magic it is, but I can partly tell from the aria what the girl is doing and the magic power that is gathering. It’s a big technique that differs from anything she has released until now.</p><br/><p>“Mio, scatter” (Makoto)</p><br/><p>One word, with one word I order Mio, who was being held by me.</p><br/><p>The dark magic has a number of special characteristics that other magic doesn’t have. One of those characteristics is that it is the polar opposite of light which is the element of the Goddess and everyone hates it. By the way, I don’t care about it one bit.</p><br/><p>One of the other special characteristics is that…</p><br/><p>“Yes, Waka-sama” (Mio)</p><br/><p>She has returned to her senses (maybe), I watch the flow of Mio’s magic. She must have ‘grasped’ the situation with a glance. How impressive, it must be a skill that was born from her instincts.</p><br/><p>Just before the magic is gathered and its attribute added.</p><br/><p>The magic that was being formed, scatters.</p><br/><p>“?!”</p><br/><p>The two forest ogres have a face that told me they didn’t understand the situation. Well, that’s obvious. This kind of technique is most likely in the field of acrobatics. I tried to practice it when I heard of it, but it’s still not in a stage where it can be used practically. It’s in a level where if I know about the skill that is going to be used, I will be able to scatter it.</p><br/><p>The dark element eats magic power. Moreover, in normal situations it is very efficient.</p><br/><p>For a magic that has been formed completely, it will eat it in a very inefficient manner. If you want to make it disappear you would need several number of times the magic power used. Against people that use catalysts like canes and people that gather their magic power in their fingertips, it can eat it quite effectively.</p><br/><p>What would happen if the magic power gathered in the hands is eaten before it is activated?</p><br/><p>The answer is simple. The magic itself will be canceled. Moreover, the eaten magic power won’t return to the user, so the magic power will be expended.</p><br/><p>In short, a counter to magic will be accomplished. To every other element.</p><br/><p>But you will have to be one step ahead of that person in the moment it is being prepared and be able to read the spell’s arrangement, moreover, you will have to activate your magic before your opponent and do a reverse scan on the enemy’s spell core, the place where the magic power is gathering.</p><br/><p>The difficulty is really high. Well, even if I say that, Mio, who has been familiar with the darkness element for a long time, can finish this process as if she were breathing. Instinct, what a scary skill.</p><br/><p>And you have to do all those acrobatics in actual combat. If you want to go against Mio, instead of using magic that has a long aria and possesses high attack power, it is more effective to use a simple and high powered magic that you can shoot continuously. Well, you may be eaten though. Yeah, I don’t want to do it.</p><br/><p>“If there is a need to show our strength before having our talk…” (Makoto)</p><br/><p>“Hoh~ so you are eager to fight now?”</p><br/><p>“Wait. There is something strange”</p><br/><p>B girl feels a slight disturbance from the fact that she couldn’t activate her magic. But it’s already too late!</p><br/><p>“I will prove it to you by leaving you powerless!” (Makoto)</p><br/><p>The enemies are using a short cane and a bow. However, if they aim like this, the attacks will reach my body completely*. </p><br/><p>(Mio, it will be glowing a bit) (Makoto)</p><br/><p>I briefly tell Mio my intentions.</p><br/><p>Raising the power of the light magic and making the effective time an instant, I throw it in between the two of them and have it explode. It had no special properties, it was only to block their vision.</p><br/><p>Hmph, because of my mask that I haven’t removed yet, it is no surprise my field of vision is a bit bad. I think it’s good that they had a bit of an advantage!</p><br/><p>The two of them were trying to retreat from the light, in that space I shoot a [Brid] on the objects that were on their hands.</p><br/><p>I destroy the cane and bow that were their weapons. Just in case the weapons were sturdier than I thought, I had already prepared the next aria, but it seems there was no need to.</p><br/><p>I, I’m tired…</p><br/><p>We can finally enter negotiations. In a game all would be done by just pressing the TALK button though.</p><br/>\n</div>"}