{"title": "Chapter 55: Reflection", "id": 55, "volume": 1, "url": "http://boxnovel.org/tsuki-ga-michibiku-isekai-douchuu-chapter-55-reflection", "volume_title": "Volume 1", "body": "<h1>Chapter 55: Reflection</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 55: Reflection</p><br/><p>As one would expect, Tomoe had planned to invite the forest ogre race to Asora.</p><br/><p>But I couldn’t agree to it.</p><br/><p>Right now, that guy is the only one who has that power, but after accepting them in Asora and getting involved with Tomoe and mini Tomoe, I feel like they will awaken one after the other.</p><br/><p>If you call me a scaredy-cat, then yeah, that’s exactly what I am. There is no other reason behind.</p><br/><p>The forest ogres were the same as the previous ones, they all agreed. They seemed to have no issues with coming to our Asora (or more like they are taking it as the holy grounds of Tomoe). There was no disadvantages for either side, so it was the logical conclusion. Even if they consider me a suspicious masked brat, Tomoe is a superior dragon they owe. And that dragon is telling them to come.</p><br/><p>Don’t joke around.</p><br/><p>I am scared of that so called Tree Punishment. Honestly scared.</p><br/><p>The cursed disease that I saw at Rembrandt-san’s place was as well. At that time I felt fear. But even so, I had a lot of other emotions like anger mixed in, so I wasn’t as broken as I am now.</p><br/><p>In this Tree Punishment, the only thing it left me was fear. Maybe it was because I couldn’t cure it, or it might be because I didn’t hold any other feelings since I didn’t know them, a part of it might be because I saw how it was truly used.</p><br/><p>I didn’t think it was unforgiveable. It’s just that it gave a bad feeling like freezing down my spine. Like being poured cold water on my back. A feeling I couldn’t explain properly affected my body.</p><br/><p>The moment I came here, I was seriously thinking about such ‘stupid things’ like accepting my desires. Now that kind of mood was completely blown away. Coming out directly from my throat. Well, I might be troubled again by it once we return though.</p><br/><p>I couldn’t completely accept the forest ogres and say: “Now, go ahead”.</p><br/><p>That’s why I talked about the area they were managing and the barrier Tomoe made and led the conversation to a different direction. There was no need for any special conversation skill. Because we were the ones that held the priority.</p><br/><p>The right to decide was fundamentally on our side. *The cranes cry* perfectly describes this situation. </p><br/><p>Tomoe was eager to invite them as residents because she saw favorably their quick-wittedness and combat power, as well as their appearance that was close to hyumans, but I was somehow able to persuade her. It seems that my opposition was actually unexpected.</p><br/><p>Mio as well, even when she personally didn’t like them, she had a favorable view of the forest ogres’ plentiful knowledge in plants, and was in favor of the migration. It seems to be different to the ability of plant communication. Looks like Mio was also a bit surprised by my dry way of dealing.</p><br/><p>Of course, it’s not like I want to deny everything. If we continue like this, the fight between Tsige and these people will definitely occur. There’s no doubt a large number of casualties will appear.</p><br/><p>I clearly knew that my opposition was because of my fear, that’s why I wanted to reach a compromise and obtain an acceptable conclusion.</p><br/><p>First of all, we will have Tomoe create a brand new barrier. This was definite. I didn’t want to leave them in this dangerous state after all.</p><br/><p>I will also enclose the area where the Ambrosia is growing wild. No matter what happens from here on, as long as people are not let in, the dreams of becoming rich quickly in the wasteland will just increase by one. Of course, that pipe dream doesn’t affect us.</p><br/><p>Next topic, it seems that the forest ogres don’t want to lose their relationship with us. I also like their way of associating with the forest that is close to forestry. The thing I don’t like is that Tree Punishment. But that seems to be a power that stems from their ancestors, and it’s a pride of them. How complicated.</p><br/><p>Just like how Tomoe emphasized, the forest ogres have high combat ability and their appearance is pretty close to that of hyumans, so I think they could prove useful in the management of the company. Even if I am trying to find a cure for the Tree Punishment, it is better for us to have a good relationship with them.</p><br/><p>Just like how Mio agreed, if they were to move to Asora, I think they would surely bring great benefits to the residents. Because the Asora of now doesn’t have a forest expert.</p><br/><p>It’s like there isn’t a choice of not accepting them.</p><br/><p>That’s why I…</p><br/><p>……</p><br/><p>…</p><br/><p>“… I see, so that’s how it is”</p><br/><p>After the first stage of the meeting was over, we bid farewell to the forest ogres for now and return to Asora.</p><br/><p>In the end, the forest ogres will be doing commerce with us separately in the form of cooperation with Asora and the company, without migrating the whole village.</p><br/><p>With this, they are now able to safely sell and buy. Moreover, their jobs will increase. More concretely speaking, we will be teaching them how to look after the business first before giving them work regarding negotiations. There is also… information gathering.</p><br/><p>Yes, they are through and through shinobis.</p><br/><p>Well, I actually don’t want to think about the benefits and just create a distance from them though. That’s why I found annoying how persistent Tomoe was.</p><br/><p>To my surprise, Tomoe-san was seeing them as an *Iga or Koga* group. She was making strangely sound arguments like the benefits for the company or their living basis becoming more stable, so I look like an idiot for seriously trying to accept them. </p><br/><p>Even though we were in the middle of a meeting, I should have been able to confirm our wills anytime with thought transmission.</p><br/><p>I am seriously surprised by my lack of flexibility.</p><br/><p>The talk was able to proceed and end in a calm manner.</p><br/><p>After that, we were able to move to Asora without hiding it, and decided to do the guiding and touring for the forest ogres. Afterwards we had the recruitment of people that wanted to migrate, by the way, this has a number limit. If all the people wanted to migrate and ended up moving the whole village, it would be like invalidating everything I have said. I was able to impede that from happening.</p><br/><p>I feel like Tomoe was aiming for that, but once I know her line of thinking, it is easy-peasy.</p><br/><p>“Tomoe, the shoguns put their best shinobis in a place close to them” (Makoto)</p><br/><p>With one sentence I was able to K.O her.</p><br/><p>While they were touring Asora, the other residents were explaining Asora’s region details. Tomoe-mini played a big role. Ema-san also did a nice assist. A number of the forest ogres were able to speak in common language, so the language issue seems to somehow be able to resolve itself.</p><br/><p>… At this rate, the common language will end up being the main language here. I have to learn that groaning soon. Isn’t there something I can do? I don’t want to lower my head to that bug so, isn’t there a way to negotiate and get the blessing?</p><br/><p>If Japanese were possible, it would be incredibly easy for me, but if I think about the data warehouse and the important information, it is better for only a part of the people to understand. No choice.</p><br/><p>I will have to use my pseudo-writing communication at Academy Town, and I will always need one of my followers accompanying me. I won’t be able to have peace of mind. I want to have time alone where I can mingle with people of my own age after all.</p><br/><p>More like, just thinking about having Mio and Tomoe beside me all the time, I feel like at some point I will end up like a ventriloquism doll. 4-digit level and a level 1. There is no need to think about who will be looked as the extra.</p><br/><p>“But Waka, the unique skill of status abnormality is something that Waka shouldn’t have to worry about. Why are you so scared of it? I don’t understand” (Tomoe)</p><br/><p>It’s Tomoe. The previous ‘I see’ case was also her. </p><br/><p>In this place, there is right now only 4 people. At my house in Asora. In my own room. Well, it seems to still be temporary though. This is sufficiently big you know? It’s fine if you don’t make a new one you know?</p><br/><p>I was explaining the reason of my behavior at the meeting once more.</p><br/><p>I, Tomoe, Mio, and the other person who was in the middle of resting.</p><br/><p>“Even I don’t understand. The moment they explained me that everything in that forest was actually hyumans and demi-humans, I had a strange chill” (Makoto)</p><br/><p>“Fumu…” (Tomoe)</p><br/><p>“I am really sorry, I didn’t notice at all” (Mio)</p><br/><p>I really don’t know why. I was probably psychologically displeased by a factor in that practice. Tomoe was nodding while having a thoughtful face, and Mio was apologizing by the fact that she didn’t notice my mood. It wasn’t like Mio was at fault anyways.</p><br/><p>“Sorry” (Makoto)</p><br/><p>“Waka, there is nothing to apologize for” (Tomoe)</p><br/><p>“That’s right-desu!” (Mio)</p><br/><p>“Then, let’s put on hold the plan of awakening the power of the forest ogres. Regarding that man, let’s order him to cooperate and restrain himself” (Tomoe)</p><br/><p>I don’t know if we will be able to hold him down with simple words, but it seems that Tomoe has some sort of plan. Let’s leave it to her. No matter how hard I try, I can’t handle that ability.</p><br/><p>Ah, at any rate, it may be because the matters have been put in order, or because I told everything, I feel a lot better.</p><br/><p>For now… Let’s return to Tsige.</p><br/><p>I-I feel like I am forgetting something…</p><br/><p>What is it?</p><br/><p>N?</p><br/><p>Being attacked by the forest ogre AB in the Ambrosia forest (temporary name), while I was cradling Mio and was somehow able to repel them, and after arriving at the village and meeting their gross Shishou, the banquet finished, Lich came out from his mouth… That’s right, one of the forest ogres died.</p><br/><p>That’s not it!</p><br/><p>Lich! That’s right, Lich!</p><br/><p>No wait, something feels wrong. It’s not that I am mistaken, but there is still something more.</p><br/><p>Before that happened.</p><br/><p>Uhm…</p><br/><p>!!</p><br/><p>I remember the happening that occurred when the forest ogres attacked us and I was cradling Mio. I almost forgot about it.</p><br/><p>No good, get a hold me.</p><br/><p>Now that I think about it, since the time I left Tsige, I have been messing a lot.</p><br/><p>About the trio, and also the time with the handshake of that Shishou, regarding Lich I was only able to feel something and I left it just like that, then everything ended up that way.</p><br/><p>That forest ogre as well. Maybe I could have saved her.</p><br/><p>When I lower my guard, my thoughts soon get blocked by something and I was unable to calm down.</p><br/><p>In my endless worry, I felt my sexual desire. And it’s in this state you know? At the time in the wasteland I didn’t feel like this.</p><br/><p>No matter how surprising it was, just because there are a lot of beautiful people, just because a few girls approached me, I ended up in this sorry state.</p><br/><p>Even if I was able to more forward because of my crazy strength, it doesn’t mean I can keep going like this.</p><br/><p>Remember that feeling of being poured cold water in my back when I touched that Tree Punishment.</p><br/><p>Geez, hold it down. Anyways, I should put an end to all this!</p><br/><p>I don’t know how much I can recover. I am in a world where I don’t know what will happen next. I can’t forget that.</p><br/><p>“What happened to that hyuman trio?” (Makoto)</p><br/><p>“Oya, shouldn’t this be first?” (Tomoe)</p><br/><p>The fourth. Tomoe points out at Lich-san with her chin. Maybe it’s because the priest robe-looking outfit (though even if I say ‘priest’ it is black and has an ominous and complex gold embroidery design) was made out of magic power, the skeleton wasn’t laying bare (bones). His eye sockets seem to be shining a red light, so I could tell that he was awake.</p><br/><p>After I had Tomoe finish him (made it look like), I had him return to Asora first and send him to my room. Of course, I limited his movements to this building and left him in a confined state.</p><br/><p>It seems like he didn’t do anything while we were talking and didn’t participate either, he stayed quiet. He is a bit eerie, but his special characteristic wasn’t something I felt danger about. Leaving him free for now shouldn’t be a problem.</p><br/><p>“No, now that I think about it, I haven’t asked what happened to them at all. Tomoe?” (Makoto)</p><br/><p>“Of course, they are receiving the invitation course of the Mirage Town. The three of them were bewildered at first, but this morning they took their breakfast obediently, and by now the orcs and dwarfs should be keeping them company” (Tomoe)</p><br/><p>“… Eh?” (Makoto)</p><br/><p>“Is there something wrong?” (Tomoe)</p><br/><p>“They are, here, now?” (Makoto)</p><br/><p>“Yes” (Tomoe)</p><br/><p>Isn’t that bad?</p><br/><p>I isolated them when we fought against the forest ogre AB you know?</p><br/><p>Wouldn’t it be bad if they end up running into the forest ogres that were now touring the town?</p><br/><p>“You, what would happen if they end up encountering the forest ogres?!” (Makoto)</p><br/><p>“Don’t worry. To make sure it didn’t happen, I soundly divided the area. I will have those guys stay in the workshop of the eldwa and have them returned by tomorrow. That forest is already in a state where you can’t see it nor enter it, so let’s just throw them in the entrance of the bottleneck” (Tomoe)</p><br/><p>She said that, since they are adventurers, they should be content by giving them some nice weapons.</p><br/><p>Tomoe continued: “The forest ogres seems to want to protect the Ambrosia as their priority, so it seems that they were giving it more importance than the barrier of the village”</p><br/><p>The dwarf workshop is certainly an isolated place. If they want to move to another area, someone would definitely see them. In that case, there is no way for the forest ogres to suddenly encounter them.</p><br/><p>Giving them weapons huh. I feel like it is because of that idiot trio that we were faced with so many troubles.</p><br/><p>One of the girls there seemed like the one who caused Tomoe and Mio to almost ravage me. But her hairstyle was different… so maybe it isn’t?</p><br/><p>Humu.</p><br/><p>There are a few things I just don’t feel that satisfied about, but…</p><br/><p>Oh well. As Tomoe said, if they are given relatively good weapons, even if they are thrown at the entrance of the wasteland, they should have enough attack power. I will pray for them to walk the proper path from now on. Because if they don’t do that, the next time they do a crazy thing, they will only die. Moreover, the bottleneck that one has to pass in order to return to Tsige is, just like its name suggests, a narrow and difficult path. It stretches up and there are a lot of people that aim at you. If you lose your stamina on the way, that’s as far as you go.</p><br/><p>The eldwas’ weapon is excellent after all. It is plenty enough as a farewell gift.</p><br/><p>Weapon, weapon huh.</p><br/><p>I feel like I have heard the word quality weapon somewhere before…</p><br/><p>This unlikeable image is… Lime! Limelatte!</p><br/><p>I did tell him I would give him a weapon. It’s a man who reached that level with his own efforts and has quite good ability. Though he passed a terrible time because of Tomoe and was extorted by Mio.</p><br/><p>Now I remember, now I remember.</p><br/><p>There is still the progress of my equipment, so I should show my face in the eldwa-san’s place before going to Tsige.</p><br/><p>Umu, I was planning on easing myself after losing the tension but…</p><br/><p>I still have a lot to do!!</p><br/><p>“Then, I will be leaving that trio to you. I can’t meet them after all” (Makoto)</p><br/><p>“Understood” (Tomoe)</p><br/><p>“Well then, we are done for now you two. After this, there is only a bit of a talk with Lich anyways” (Makoto)</p><br/><p>“It seems like it will be interesting and I have something I want to test out, so I will be present as well” (Tomoe)</p><br/><p>“There was also the case of that pervert. An enclosed space with only two is a no-desu!” (Mio)</p><br/><p>Uh? There isn’t really any danger so it should be fine for the two of them to do work related to Asora.</p><br/><p>Mio, for this bone to prove any danger to my chastity is most likely impossible you know? </p><br/><p>Well, you can do whatever you want.</p><br/><p>Now then, let’s listen to his circumstances.</p><br/>\n</div>"}