{"title": "Chapter 66: Looking at the departing back", "id": 66, "volume": 1, "url": "http://boxnovel.org/tsuki-ga-michibiku-isekai-douchuu-chapter-66-looking-at-the-departing-back", "volume_title": "Volume 1", "body": "<h1>Chapter 66: Looking at the departing back</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>“So it has been carried out. It’s been a while since we had such a busy day”</p><br/><p>A man in the prime of his life has his hand on his prided beard and looking at a certain direction on top of a castle wall’s pathway.</p><br/><p>This place is Tsige’s northeast department. In this land that is practically surrounded by high castle walls, only the northeast department is different.</p><br/><p>From the northeast exit there is a wide beautifully paved path that extends forth.</p><br/><p>The wall that protects the city is just as it is, it stretches out on both sides of these big path. That length goes on onto the horizon and one couldn’t see its end.</p><br/><p>It is called the Golden Highway. It is the safest and highest priced path in this world. The width reaches 10 meters, but it is protected by a high wall. The highway goes from the southern tip to Tsige, from the northern extremity to the empire’s trading city, Robin City. Each nation maintains and improves it.</p><br/><p>The lands that can use this highway to go in and out, without exception, are protected by a tall wall. There are even cities that were created in turn of this path and have evolved from it.</p><br/><p>So that the merchants could transport large amounts of goods safely, so that important people can move safely from countries, for the sake of passing on important information that can’t be told through thought transmission as fast as possible; for various purposes, these highway is utilized.</p><br/><p>Because the cost to use is pretty high, there are practically no pedestrians or adventurers in sight. Even if there are, it would be to protect people that are looking for even more safety than it is already provided.</p><br/><p>Also, in various towns that work as relay points, magic formations are set, so it is made in the form that you are able to transfer one after the other in the different towns that are connected to the highway.</p><br/><p>Raidou, who has left Tsige today, didn’t walk through the highway. He used the numerous magic formations to head to the far away Academy Town. But even from those relay points, the arrival to their destination will take long. In the direction that the prime man and the man who has his whole body clad in black look, there is no doubt that “he” is there.</p><br/><p>“You are totally right. Even if they transit without resting, for them to reach Academy Town would take up to 3 days”</p><br/><p>“Yeah. But wouldn’t it have been fine to at least have Lisa and the girls see him off? Even if their hair is a bit short, I don’t think Raidou-dono would mind”</p><br/><p>“Women have their women way of thinking”</p><br/><p>“Fumu, so it’s such a thing. And so, Morris…”</p><br/><p>The man tries to change the topic from the male butler. His eyes were not those of someone seeing off an acquaintance, nor the eyes of a father thinking about his family.</p><br/><p>“What is it?” (Morris)</p><br/><p>The man called Morris must have noticed, he responds to his master somewhat stiffly.</p><br/><p>“Tomoe-dono and Mio-dono. From your eyes, how do they look like to you?”</p><br/><p>“In terms of physical strength, no matter which one, I would have to raise my hands in defeat. In terms of doing trades, Mio-sama would be more comfortable, but in the end, she can’t do anything that doesn’t leave a bad after taste. I think that they are ladies that match their level”</p><br/><p>“… So that’s how it is huh. Well, the words “I know my own position as a person being lent a spot” that Tomoe said… I have no other choice but to believe in them. What about the people from Kuzunoha Company stationed at our store?”</p><br/><p>“I have talked to them a number of times and from what I could get, the dwarfs are craftsmen. The other ones that I saw with Tomoe-sama once, from what I could see, they seemed hyuman but they had brown skin and red eyes so I think they are demi-humans. They have decorum, so it didn’t look like people who would cause trouble” (Morris)</p><br/><p>“Does Raidou-dono not have intentions on employing hyumans?”</p><br/><p>Rembrandt tilts his head. The followers that he has, Tomoe and Mio, are hyuman, but the other ones are all demi-humans. Taking into account their characteristics, most of them seemed to have appearances close to hyumans, but there is no hyuman employed.</p><br/><p>“For now it seems to only be Tomoe-sama and Mio-sama. He knows various demi-human languages, so he may be taking into account the cost and ability as a priority when he is choosing. This is just an impression I got when I was talking to them but, I felt like they hated the so called discrimination” (Morris)</p><br/><p>“Ability… and cost huh. This place is certainly dangerous, but Tsige has a principle of accepting people with ability after all. If we think like so, it is not that strange. If it were me, I wouldn’t care if they were demi-humans or whatever as long as they are proficient. Or at least that’s how I think now” (Rembrandt)</p><br/><p>“… In time, an undesirable war might occur between the hyumans and the demi-humans but… a trend like that does exist” (Morris)</p><br/><p>With a voice that one could feel slight grief from, Morris affirms his master’s words. If the demi-humans’ position goes up too much, it might create friction between the hyumans. He was worried about that.</p><br/><p>“At least the Kuzunoha Company won’t become an explosive agent for now. They are still in a state where they don’t even have their own store. They won’t do anything rash. If it looks like a seed will appear, we just need to talk with Tomoe-dono and the others. It’s not like those girls won’t employ any hyumans at all” (Rembrandt)</p><br/><p>“Yeah. Most of the adventurers will suppress their voices, so currently there shouldn’t be any problems” (Morris)</p><br/><p>Rembrandt and Morris seemed to feel certain distress over the future of Kuzunoha Company.</p><br/><p>“Now that I think about it, I wanted to meet the other follower that Raidou-dono said he would reunite with later. By the time he returns, I hope he brings him here” (Rembrandt)</p><br/><p>“We tried to investigate on our side, but we couldn’t get who in the world he was. We can’t get any information of Raidou-sama either. It’s to the point that it makes me wonder if they are mushrooms that sprouted after rain” (Morris)</p><br/><p>“… Mushrooms huh” (Rembrandt)</p><br/><p>“Yes, with the sentiments of not knowing anything about them. Mushrooms” (Morris)</p><br/><p>“… Well, it is a personage that would bring trouble if he tried after all. It’s not like I don’t understand how you feel. I don’t mind it if that is how the investigations turned out to be. I am having you guys do something that is hopeless after all. There was an inquiry from the castle about their registration in the guild and the level of those two…” (Rembrandt)</p><br/><p>“!!”</p><br/><p>The words “From the castle” that Morris’s master said, made him tense. Because if the Aion Kingdom’s attention is taken, Raidou’s movements will be limited a lot.</p><br/><p>“No problem. Right now he is not properly moving as a merchant so, if I get anything, I will report it. Is what I told them and send them back” (Rembrandt)</p><br/><p>“Rembrandt-sama…” (Morris)</p><br/><p>“Don’t make that face Morris. Being in this kind of remote place makes one forget slightly that this place belongs to the country. It is not like they are doing anything to protect Tsige after all. It is obvious which side I will take between the useless bugs that only look for gold and the person that saved my family” (Rembrandt)</p><br/><p>“… Certainly. The government officials that are brought here by the country, all of them think only about bribes. This is practically an autonomous place run by merchants. It’s just… this kind of topic is…” (Morris)</p><br/><p>“I understand. This will stay between us. If someone got us from behind, it would be no laughing matter” (Rembrandt)</p><br/><p>Rembrandt faces Morris and makes a childish face, like the one a kid would do when he does a prank. And Morris responds with an evil face as if punishing.</p><br/><p>“If it comes to a point where Tomoe-sama takes my back, please leave me behind” (Morris)</p><br/><p>He may have remembered an error of some sort, Morris shows a face of discomfort.</p><br/><p>In the past, Morris saw Tomoe in a bookstore in town and he tried to confirm her skills so he erased his presence and approached her.</p><br/><p>The moment he stepped into the store and thought he was at her back, her figure was suddenly nowhere to be seen. It only ended up in him being hit on his left shoulder.</p><br/><p>Morris embarrassedly reported that to Rembrandt and he bursted in laughter. Her threat was higher than Morris ever imagined, so this was advice of not making her their enemy.</p><br/><p>Morris clearly understood the difference of strength between him and Tomoe. In the case she and Mio, who is even higher in level than her, get serious, Morris reported to Rembrandt that his last wall of defense, Morris himself, would not be able to protect him. He is an honest person.</p><br/><p>“… When Raidou-dono returns, he will surely be stronger than before. Today when he came to ask me about the Academy, if he were to mention about the things I don’t want to be publicized or about his followers, he could have controlled the conversation. In terms of his heart, I want him to stay as he has always been” (Rembrandt)</p><br/><p>Learning various kinds of knowledge and studying, Raidou will surely increase his abilities as a merchant. His close aide Tomoe is also proficient. He predicts that his company may develop incredibly in the future.</p><br/><p>Rembrandt felt grateful that he didn’t have any intentions of joining Aion and making Tsige his headquarters. Because they could stay as good partners without minding about dividing the business area.</p><br/><p>Also, Tomoe and Mio.</p><br/><p>This was the first time Rembrandt had seen people of 4 digits. Those two would cause quite the pressure and mental strain just thinking about confronting them. Because they could easily blow away a town if they so wanted. </p><br/><p>Instigating their imperial wrath would truly make that happen. In a sense, it’s scarier than taunting a dragon.</p><br/><p>Unless you have enough courage, trying to make business with those girls would end up in one being completely swallowed by their demands.</p><br/><p>The requests regarding the wasteland are numerous but their completion rate is bad. That should be the case and yet, since the time Tomoe and Mio arrived, the request board in the Adventurer Guild that was always increasing only, now has a tendency to decrease.</p><br/><p>Because of their arrival, the state of Tsige has begun to slowly change.</p><br/><p>“Was it okay to talk about the heroes? There were contents that were supposed to be secret in what you disclosed” (Morris)</p><br/><p>“I am incredibly grateful for my wife, my daughters and Raidou-dono. They told me they want me to do as much as I can so… I don’t mind this much” (Rembrandt)</p><br/><p>“But to disclose such information so easily would make us look like we are cheap people. Please act with a bit more prudence” (Morris)</p><br/><p>Morris warns his master on his rash act.</p><br/><p>“It is fine. Honestly speaking, if I am able to gain their trust with something like this, I would consider it a huge profit. Raidou-dono is my benefactor and a business partner. Above all, he is a person I can’t see limits on” (Rembrandt)</p><br/><p>“… I overstepped my line. And also, here is a follow-up report on the hero of Gritonia” (Morris)</p><br/><p>“Hm, let’s hear it” (Rembrandt)</p><br/><p>“Yes. He is favorably obtaining military gains for the empire. And it also seems that he is being used in “researches” by the second princess” (Morris)</p><br/><p>In midst of the report, the word “researches” made Rembrandt’s body stiffen.</p><br/><p>There were previous rumors that the empire did human body experiments. But after the descent of the hero they still continued, on the contrary, this is the first time he heard that even the hero himself was being included in it.</p><br/><p>“Gritonia might be intending to use the hero as a weapon”</p><br/><p>“That may be the case”</p><br/><p>“… Is the hero such a submissive one? Well, an easy to drive hero is actually something the country would be grateful for”</p><br/><p>Existences that possess strong power normally have intense ego. It makes it troublesome to control.</p><br/><p>“I heard that he is still a boy. Limia and Gritonia are big. Satisfying the desires of a boy and girl should be easy for them” (Morris)</p><br/><p>“How pitiful. So they are just going to be used in the war against the demon race huh” (Rembrandt)</p><br/><p>If they are not aware of it themselves, that would be for the better. No matter what kind of title you possess, an idiot is still an idiot huh. Rembrandt grieved.</p><br/><p>“… Also, there were no signs of any of the heroes approaching the Academy” (Morris)</p><br/><p>“They are the trump cards in the front lines after all. I thought about it just in case, but it seems that the Academy will not be receiving the sparks” (Rembrandt)</p><br/><p>“Yes, the ojo-samas’ preparations to return to school have already been made, so this was a matter of worry. But it appears that their heads are currently filled with the fight that is about to occur in Stella Fort” (Morris)</p><br/><p>“Stella Fort huh. There are a number of anecdotes about that place, it seems to be a barrier that is protected by a demon general of four arms. From what I have heard, it seems that the hero of Limia will only participate by going around helping people in this capture mission. If I remember correctly… her name is Hibiki Otonashi” (Rembrandt)</p><br/><p>Regarding Limia’s hero, she is a person that goes around the neighboring countries and solves the problems concerning the demon race. There are people that say she is the splitting image of what a hero in stories should be. When Rembrandt heard those kind of rumors in the information investigated, the time when he received the report, he heard them half in doubt and just ignored it. Because he thinks that there is no way such a holy person of virtue would exist.</p><br/><p>For Rembrandt, the hero that is still in the empire, who is filled with greed and lust, is an existence that is easier for him to comprehend.</p><br/><p>“Yeah, it will be a joint front with both of the heroes. I will make moves so that we can obtain as much information as we can” (Morris)</p><br/><p>“That would help a lot. No matter if the fight in Stella ends up in a victory or a defeat, it will decide the flow of things from now on. I want to know the conclusion as precisely as possible” (Rembrandt)</p><br/><p>“Yes. I am looking forward to a few days from now. Who knows when the ojo-samas will get a complete recovery. We need to prepare for it” (Morris)</p><br/><p>“By the way, what about the royal palace’s report?” (Morris)</p><br/><p>“… It’s okay, just leave it alone. At any rate, the Stella Fort battle will utilize the consensus of all 4 major powers, so they must already know by now” (Rembrandt)</p><br/><p>“Understood. Then I will do as you say. The preparations to return to school, to think such a day like this would come. Now that I think about it, to invite Raidou-sama to the Academy was also one of the wishes the ojo-samas did” (Morris)</p><br/><p>“… Do you think that means they are in love with Raidou-dono?” (Rembrandt)</p><br/><p>For a father, this made him have terrifying complex feelings. He is a benefactor, but seeing the two girls that have not been followed by any bad bugs to grow interest in a person of the opposite sex, there is no helping those feelings.</p><br/><p>They must have remembered about him, the two, with synchronized voices, asked about his whereabouts and circumstances.</p><br/><p>Rembrandt himself didn’t possess that much information, and he had no intentions on retaining him pointlessly.</p><br/><p>When he said that he doesn’t know when he would leave the town because he is an adventurer, along with his wife the three of them said “Please stop him until we are able to thank him”.</p><br/><p>The deceiving would at one point lose its effect and when he was planning on telling him, they came and pleaded Rembrandt…</p><br/><p>To have him go to the same Academy they are going to. He thought that they were quite into it, but this is something he felt even from before, ‘isn’t this a bit too much?’</p><br/><p>But he was originally indulgent and, on top of it, a father that dotes his family. If it’s his two daughters’ request and his wife supports it, he didn’t care about the morals and laws of this world.</p><br/><p>He smiled and ended up consenting to it.</p><br/><p>These were the details regarding the matriculation of Raidou into the Academy from Rembrandt’s side. Even if Raidou didn’t have any intentions of going to the Academy, he would have forced it somehow.</p><br/><p>But for some reason, he himself came to say that he wanted to go to Academy Town. When he heard that he made a complete turn and said over and over again “There’s no way there was a problem”</p><br/><p>“I don’t know myself. But it seems that the two of them have a no ordinary interest in him” (Morris)</p><br/><p>“Interest huh. You are right. They didn’t change their attitude even when he showed his face after all” (Rembrandt)</p><br/><p>(The moment he took off his mask, it may be rude but… his outward appearance was ugly, no, poorly made? No, hmm… deplorable? No, that’s not it. Ah that’s right, it had such a strong sense of individuality that it made me lose my words) (Rembrandt)</p><br/><p>It was on a degree that if he weren’t a hyuman but a demi-human it would be in a level that wouldn’t cause surprise, so Rembrandt was already used to it.</p><br/><p>And if the words he said about having his mask off from now on are true, he will surely pass a lot of hardships. Rembrandt felt for him. The lie of him not being able to take off his mask because of a curse so that he didn’t have to show his face was a bit undesirable for Raidou, but Rembrandt understood him.</p><br/><p>Seeing their own appearance crumble because of the curse disease may have bended their own way of viewing the outward appearance. He remembered that his two daughters had a strong inclination to physical looks. He himself didn’t change his love to them at all when he saw them in that ghost-like appearance, so he does understand that feelings and appearance are not directly related.</p><br/><p>‘Let’s see how the situation unfolds’, is what Rembrandt decided to go with.</p><br/><p>(If he suddenly returns with my two daughters having a swelled stomach, I will throw the army at him. At least think of it as an opposition of sorts, Raidou-dono) (Rembrandt)</p><br/><p>“Danna-sama, I share the same sentiments as you but I think that your thoughts are somewhat accelerated” (Morris)</p><br/><p>Fumu, as expected of their many years of fellowship. Their thoughts get through easily. Rembrandt was wondered with Morris’ words. It was still unknown if it was because it was being transmitted or because it could be seen at plain sight though.</p><br/><p>“I am happy that you feel the same way” (Rembrandt)</p><br/><p>There are practically no occasions where he has left something to him and he has failed. He is truly a reassuring butler.</p><br/><p>That’s right, there are practically no cases where he has left something to him and he has failed.</p><br/><p>That’s why he didn’t confirm with him. He was negligent. It was a negligence that didn’t normally happen on the merchant that even has influence in Tsige.</p><br/><p>In another day…</p><br/><p>An error was found in the documents submitted to Rotsgard Academy. Raidou, condolences.</p><br/>\n</div>"}