{"title": "Chapter 73: Decision in Stella", "id": 73, "volume": 1, "url": "http://boxnovel.org/tsuki-ga-michibiku-isekai-douchuu-chapter-73-decision-in-stella", "volume_title": "Volume 1", "body": "<h1>Chapter 73: Decision in Stella</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 73: Decision in Stella</p><br/><p>“W-What?!”</p><br/><p>The swordswoman that had fallen back had now returned, her body clad in radiance.</p><br/><p>The attack that Io used as a feint was evaded in a speed that was clearly at a completely different level from before and, just like that, her sword travels to his flank.</p><br/><p>Tightening his abdominal muscles, the attack that was repelled until now had brilliantly cut the body of the giant and blood flowed.</p><br/><p>“It can cut!”</p><br/><p>“Naval, what kind of magic is that?! I will also go to the rear and have it casted on me as well!” (Hibiki)</p><br/><p>“Hahaha, Hibiki that is impossible. This needs a special catalyst after all! Just obediently provide me support!” (Naval)</p><br/><p>Naval stops Hibiki who was already trying to head to the rear.</p><br/><p>“Wu wu, if you had such a trump card, you should have used it faster! You are sparkling and look beautiful too~” (Hibiki)</p><br/><p>“We are pushing hard!”</p><br/><p>The speed of Naval was originally higher than him. Even if Io’s strategy is to freely move his sturdy body with fluent body techniques, against the hyuman whose height is different and excelled his speed, it was impossible to evade them completely. Now that her attacks were connecting properly to damage, the schema has made a complete reversal.</p><br/><p>Keeping a distance not too far yet not too close, she coils about the demon general Io while one-sidedly cutting him.</p><br/><p>There was no chance for Hibiki to intervene, Naval was dishing as much attacks as she wanted. With her speed, there was no chance to follow her and the wounds continued.</p><br/><p>Compared to the regeneration, the speed in which he received wounds was faster. But at this rate, it will never reach a fatal wound. The wound she did at the beginning in his flank has already healed. If there is something she can aim for, it would be the weakening of his strength by lost of blood. As expected, things like neck, chest and stomach; he didn’t permit her to aim at them.</p><br/><p>Hibiki’s two handed attacks leave shallow cuts. She is changing into a style where his muscles won’t be able to catch her attacks. Putting slicing as her objective, she is moving in a way so the previous error doesn’t occur again.</p><br/><p>But in that turn of events there is one knight that had practically stopped parrying attacks or stopping them. He looked at the battle with a dazed expression.</p><br/><p>“… That is… Rose Sign. Are you kidding me? Why does she have such a…” (Bredda)</p><br/><p>It seems he had noticed something, he turned to the rear where Wudi is.</p><br/><p>Wudi, who knew the position of prince that Bredda possessed, could only turn his eyes away.</p><br/><p>No one in the party except Wudi knows, about Bredda holding the position of prince. Because of that, there were a lot of chances where he obtained information other people would be unable to touch. In that information, there was also the reason as to why Naval was able to change this situation into an advantageous one.</p><br/><p>A fragment of a rose, Rose Sign.</p><br/><p>Its size is on the level of a coin, but in reality it is one of the magic items that holds terrifying power.</p><br/><p>It’s a one-time use item and, when used, the pattern of a crimson rose will appear at the back of your neck. This is also one of the reasons for its name.</p><br/><p>Its effect is simple. It uses life as food and forcefully brings out power. When it is born, it will slowly consume you until your death and will greedily devour that power you will never be able to recover. And so, it will provide the user with strength surpassing one’s limits.</p><br/><p>The effective time is until that person dies. It is by no means a long time. That is to say, in exchange for a power that the user will never be able to obtain in his entire life, your death is set in stone.</p><br/><p>“Calling such a thing… a plan? Naval, you are…” (Bredda)</p><br/><p>A pure swordswoman like her can’t activate it. Bredda understands that. His thoughts reach at the conclusion that it must be Wudi or Chiya that cooperated with her.</p><br/><p>(It is most likely Wudi. If it were Chiya, she wouldn’t be cheering so merrily for her. Is she going to such lengths to protect Hibiki-dono and I?!) (Bredda)</p><br/><p>It is certainly not a situation where they could survive with the sacrifice of no one.</p><br/><p>However, to take all the responsibility by herself and forcing her own death, it is something Bredda would never approve. The knight that faked his social position and joined the party, still didn’t have the way of thinking a royalty should possess. Sometimes it is necessary to sacrifice someone. This reality is one that a politician can’t avoid.</p><br/><p>And actually, the effectiveness of Rose Sign is immense. Even in the present state, Io, who had been proving a difficult time for them, was now taking the defensive. He is someone that even with a handicap of 4-times blessing was still able to win.</p><br/><p>“Ah, Naval! You must not, that attack is…!” (Hibiki)</p><br/><p>There is no way to know if Hibiki’s warning reached her. Naval, who had jump up to the air, swung her sword straight ahead and got the demon general’s arm. And then, that sword continues unto its insides… and stops.</p><br/><p>“I got you!” (Io)</p><br/><p>Io wedged the sword and tightened his muscles. His opposite arm fires a powerful uppercut at Naval.</p><br/><p>“Not yet!!” (Naval)</p><br/><p>In midair, she puts her right hand on top of the left that is at the back of the sword’s handle and places force as if pushing her whole body. Naval, kicking the body of Io, uses that momentum to push the sword that had stopped in the middle and slices the bone and remaining meat.</p><br/><p>The uppercut that was approaching her from below, Naval manages to put her feet on top of it and use that strength to propel her to the direction of the attack.</p><br/><p>Io didn’t let out a single scream from having his arm cut off and didn’t stop his fist either. Nevertheless, one could clearly see that he was sweating and looking at his own arm that was now bleeding, he finally distorted his expression.</p><br/><p>A blood spray that had never occurred was happening now.</p><br/><p>“How scary, white woman. You said your name is Naval? Knowing an attack was coming and yet still greedily come to get my arm, moreover, kicking my fist and killing its power. Are you a monster of the sword?” (Io)</p><br/><p>“For a demon general to call me a monster. It doesn’t feel bad. I now grasped the way to cut off your arms. If the arms that protect you are gone, it will be easier to make your head fly” (Naval)</p><br/><p>Laughing fearlessly, she brushes off the blood sticking onto her sword. Her sword was already clad in a faint radiance and the white aura that she was releasing from inside her was steadily getting stronger. The shining aura flows to all sides as if dancing and then disappears.</p><br/><p>“So there’s a hyuman magic I don’t know right? Honestly, I am deeply surprised” (Io)</p><br/><p>“Well, I am surprised as well. At your power that I can’t overwhelm even when going to such lengths that is. As expected from a 4-armed giant race. You are one of those we call genius huh” (Naval)</p><br/><p>“… I was originally a normal 2-armed giant you know? What you cut off is not one of my original arms” (Io)</p><br/><p>Io responds to Naval’s praise.</p><br/><p>“At that time when we were attacked by the spider, I couldn’t save my best friend. When I managed to repel it with my wound-filled body, I returned with his arms and transplanted it on me. It took a lot of time until I was able to move them properly though” (Io)</p><br/><p>“Well, that was impolite of me then. I am sorry but I will have to finish this. There is also a fox woman right? From the 4 demon generals you are the weakest one. We can’t take our time” (Naval)</p><br/><p>The light that was coming from Naval’s body surpassed its peak and was now weakening.</p><br/><p>Maybe she is self-aware of this or maybe not, she once again begins her offensive.</p><br/><p>“I am the weakest? Fumu, it seems you guys are doing a weird labeling there. Why would a weak general come to the frontlines? In terms of battle, I am the strongest one of the demon generals. There’s no demon general that can beat me in a one-on-one” (Io)</p><br/><p>Against Naval’s fierce attack, Io limits himself to harden only the parts that he uses to guard and slowly manages to make them shallow. In these scene where blood is spraying here and there, Io seems to be calm, but in reality he is slightly reorganizing.</p><br/><p>“That is good news then! If we manage to defeat you, we will be able to make a big step forward!” (Naval)</p><br/><p>She didn’t even flinch at the words “strongest”. Naval goes full force at the demon general.</p><br/><p>While handling the combo of fists, she puts force into the arm holding the sword and little by little, using full powered attacks, she maintains her distance while mobilizing.</p><br/><p>In the middle of that, Naval does one step back and turns over her body. As if he had been waiting for this moment, she did just as Io planned.</p><br/><p>(No good! Naval hasn’t noticed?!) (Bredda)</p><br/><p>Bredda, who has been watching that fight with complex emotions, holds fears about Naval not being able to evade the next attack that is coming from the demon general.</p><br/><p>It may be because Bredda receives attacks a lot, he is skilled at reading his enemy’s knacks.</p><br/><p>This time, Io moved knowing that Naval would take her distance because she didn’t like how the situation was flowing.</p><br/><p>“… A kick?!”</p><br/><p>That’s right. Io hadn’t used a kick at all until now.</p><br/><p>The distance it has is wider compared to a fist. The place where Naval is, is not a safe range anymore. She is within his range sphere.</p><br/><p>In the space between them that she thought was safe, a fast kick that doesn’t fit the appearance of this giant was released. Avoiding it was impossible.</p><br/><p>“You shouldn’t be careless!” (Io)</p><br/><p>“Seriously!” (Bredda)</p><br/><p>From the side of the released kick, a shadow appears.</p><br/><p>Bredda, who had noticed Io’s prediction, moved to make a follow-up. From the front this attack is dangerous to defend, but attacking the leg from the side to shift its direction is something he can somehow manage. Bredda’s decision was correct.</p><br/><p>Getting his kick’s direction shifted by an unexpected obstruction, of course, the balance of his body crumbles. Naval’s eyes shine with the desire to attack.</p><br/><p>“I did it!” (Bredda)</p><br/><p>Replacing the kick of Io, comes Naval. Her movements while spreading light powder were beautiful like a dance.</p><br/><p>Io, who had read the aim of the girl accurately, leaves the arm that is supporting his body and uses the two remaining arms to protect his neck.</p><br/><p>“I won’t get in the way! At this moment he isn’t even able to counterattack right?!” (Hibiki)</p><br/><p>Hibiki forcefully cuts one of the arms of his and strikes his whole body. If it is at least cutting off one of the arms that are protecting his neck, it is possible.</p><br/><p>“Hibiki, thank you!” (Naval)</p><br/><p>Slipping through the arm that was left, Naval’s sword reaches Io’s neck.</p><br/><p>“Nuu wu! Gu!!!”</p><br/><p>She wasn’t able to make it fly off. It took her all to slip through his arm and release a punch.</p><br/><p>But the sword of her, certainly got through his neck. The white radiance that was covering the sword was now shining faintly and only protecting Naval’s body.</p><br/><p>The white swordswoman uses her remaining power to try and cut off his neck by placing force on the opposite side.</p><br/><p>It doesn’t budge.</p><br/><p>The sword that had gone through his neck didn’t move a centimeter.</p><br/><p>“Praiseworthy. To think you would be able to do this much. I apologize for my impoliteness of thoroughly making light of you guys” (Io)</p><br/><p>“… You bastard. That body is…” (Naval)</p><br/><p>The purple skin of Io began to dye in pitch black.</p><br/><p>“To think in this fight I would find an opponent I have to use my all” (Io)</p><br/><p>The words of the black giant sent chills down Naval’s spine. The sword that had clearly reached to his throat by pressing all of the strength of both of her arms, was brushed to the side. The sword… broke.</p><br/><p>Without minding that, she exchanged looks with Hibiki and Bredda and took her distance from Io. He didn’t give chase.</p><br/><p>The giant, with the sword’s edge still in his neck, stays standing.</p><br/><p>“… This is a joke right? Are you telling me from now on its stage 2?” (Hibiki)</p><br/><p>Hibiki’s words are blurred. Until now it has been already been a plenty strong opponent that they could hardly match and yet, he becomes even stronger. There is no situation more despairing than this.</p><br/><p>“No way. To not even use all of his strength when fighting Naval in that state” (Bredda)</p><br/><p>Bredda’s words were of mortification, a person that has been filled with despair.</p><br/><p>“Sorry there” (Io)</p><br/><p>Io silently prepares.</p><br/><p>“Wudi!!!!” (Naval)</p><br/><p>The words of Io were drowned by Naval’s yell and resounds in the area.</p><br/><p>Wudi, returning to his senses, quickly activates a spell he had prepared.</p><br/><p>“Chiya, I will activate high-speed mobilization. Do a follow-up!” (Wudi)</p><br/><p>“Y-Yes!” (Chiya)</p><br/><p>The opened hands he placed to the front were retracted and tightly gripped at the same time. His eyes were firmly locked at Hibiki and Bredda. He didn’t look at Naval.</p><br/><p>“Eh”</p><br/><p>“Uah”</p><br/><p>Both Hibiki and Bredda felt like they were pulled by something and were brought to Wudi’s side.</p><br/><p>He closes his eyes. For the sake of reaffirming his determination.</p><br/><p>An unexpected turn of events occurred, but he already accepted the predicted future he talked with her in the thought transmission.</p><br/><p>The wide opened eyes of Wudi were only looking at the path the Gritonia hero took. There may be some soldiers blocking the way, but there is no doubt that is the place with less defenses.</p><br/><p>He hoists his staff.</p><br/><p>“Wai- Wudi?” (Hibiki)</p><br/><p>He ignores Hibiki’s words.</p><br/><p>On the contrary, with the spell activated on top of Chiya’s support, they retreat from the battlefield at a speed not seen before.</p><br/><p>“Eh, Wudi-san! Naval-san is still!” (Hibiki)</p><br/><p>“Chiya, you must not, at any cost, cut off the support” (Wudi)</p><br/><p>“Wudi! What are you doing?!” (Hibiki)</p><br/><p>“Bredda-sama. Please hold down hero-dono. I don’t mind if it is only for a short while” (Wudi)</p><br/><p>Without hearing the opinions of anyone…</p><br/><p>Wudi fulfilled his promise with Naval and used his magic at max power to bring the party outside the boundaries of the battlefield. The demon soldiers that touched the gentle green area that surrounds the party were cut into pieces, and coupled with their screams, they went at full speed. Even when they arrived where the Kingdom’s soldiers who were trying to save Hibiki were, they still didn’t drop their speed.</p><br/><p>The moment the spell lost its effect, he didn’t speak a word and just fainted.</p><br/><p>At the other side.</p><br/><p>Io, who had understood the reason of Naval’s shout, ordered the soldiers to pursuit them. However, the party passed through the battlefield at high speed and it was quite the difficult order to follow. The ones who followed this order faithfully were turned into minced meat, the arrows were broken and the spells were blocked and avoided.</p><br/><p>“Wudi-dono, I am truly grateful” (Naval)</p><br/><p>“This is your plan huh” (Io)</p><br/><p>With a bitter-filled expression, Io asks the hyuman woman left.</p><br/><p>“Yeah, that’s right. My trump card is a bit dangerous you see” (Naval)</p><br/><p>Saying that, Naval puts up her stance with her broken sword. The radiance that was rising from her body was already hollow, and what was left only dispersed.</p><br/><p>“I can’t see you able to fight anymore though. Even so, you will continue?” (Io)</p><br/><p>The words of the giant were like a sigh that resounded in the place.</p><br/><p>“Of course. I haven’t used my everything yet after all!” (Naval)</p><br/><p>The light in Naval’s eyes were actually stronger even in this situation. Holding tightly her broken sword, she reduces her distance between Io.</p><br/><p>“Are you wishing for an honorable death?!” (Io)</p><br/><p>“My life would have mercilessly and worthlessly fallen in the battlefield anyways!! I am able to decide my death place, I got a reason to die, and moreover, I am able to remain in the memories of an irreplaceable friend! For the death of the sword monster, this is a stage that is too good!” (Naval)</p><br/><p>“Wha-“(Io)</p><br/><p>Io was thinking Naval would evade his fist and advance to pointblank range. Seeing his prediction turn out completely different, he unconsciously voices out his surprise.</p><br/><p>The demon general’s fist… pierced the girl. It’s an attack that anyone would be able to tell it is a fatal wound. Naval, who had a fist growing out of her back, just what was she expecting to do now?</p><br/><p>The girl who was vomiting blood, raised the corners of her mouth.</p><br/><p>“Come to me, Death Messenger” (Naval)</p><br/><p>“?!”</p><br/><p>Just before death, the whisper of Naval didn’t reach Io’s ears.</p><br/><p>In an instant, the blue fire that spread out in his surroundings covered all his field of vision. The fire steadily converged onto him and her as if trying to surround them, turning everything that touched it into dust.</p><br/><p>It wasn’t the vivid sky blue that refreshes one’s eyes…</p><br/><p>It’s like the one you see after dusk, a dark and stagnant blue.</p><br/><p>“This is… this is?!” (Io)</p><br/><p>An ancestral magic that uses life as its price, is what Io concluded. Because she is a swordswoman, this possibility completely slipped from his mind. Now that the two who could use magic were gone, in a part of his mind he had set that there was no “magic” in her options.</p><br/><p>Extremely high density blue flame balls were wrapping up Naval’s corpse and the black giant.</p><br/><p>With an expression as if he would explode at any moment, he made himself smaller, and in the area, one could hear the shouts of Io. Maybe it took the increasing shouts of him as a signal, the blue flames showed a change.</p><br/><p>In the moment they shone brightly, at the next instant, they created a large explosion.</p><br/><p>The explosion was vast in range and the demons and hyumans aiming to retreat in the surroundings were caught in the blast.</p><br/><p>A thunderous roar rules the entire area for a moment, a flame that burns the battlefield.</p><br/><p>When the two of them vanished, a charred lump of something was left on the ground.</p><br/><p>What was once Io.</p><br/><p>With a form as if cowering, the charred body looked like a big rock.</p><br/><p>Beside that rock, a blue skinned woman that appeared out of nowhere touched his hand.</p><br/><p>She seemed like a demon, but in that face the horns that are their special trait are nowhere to be found. She had a slim figure and an extreme outfit that barely hid the most important parts.</p><br/><p>She looked at the black lump with bored eyes.</p><br/><p>“Io, wake up. You are not dead right?”</p><br/><p>“…..”</p><br/><p>“We still have the mending of the “Hades” so do it quickly. Even if we have concluded it beautifully, we still have to do the maintenance properly. Hey, wake up!”</p><br/><p>The demon woman, who didn’t hold a sliver of doubt about his survival, kicks the black rock. It seems she was in a bad mood.</p><br/><p>The scene where he showed Hibiki his regenerated charred arm, was once again reproduced but with his whole body.</p><br/><p>“She did a good one on me, that woman” (Io)</p><br/><p>“… As expected, you were still alive huh. To kill you would take quite a lot. Let’s return, we still have a lot to report after all”</p><br/><p>“Yeah, go ahead first” (Io)</p><br/><p>“Ah, is that so. Then return walking. To say such a cold thing even when I went out of my way to come and get you”</p><br/><p>“… Naval huh. That name… I will remember it” (Io)</p><br/><p>Io looks deeply emotive at the arm that was sliced by a single hyuman. The figure of the woman is nowhere to be found. Not only her body, even her sword and tools; everything turned to dust.</p><br/><p>“Ah that’s right. The blitz attack on Limia Kingdom failed”</p><br/><p>“What?!” (Io)</p><br/><p>Hearing the unexpected words, Io’s voice gets rough. The actions of that woman called Naval were out of expectations, but the strategy as a whole should have been proceeding smoothly.</p><br/><p>For the part he was the most confident to succeed to have failed, his reaction was natural.</p><br/><p>“In the time you were turned into an ugly rock, a number of unexpected events occurred. And so, the other side failed. Later I will tell you the parts we could understand”</p><br/><p>“That group of monsters… failed?” (Io)</p><br/><p>“That’s right. Right now they are weak enough even we would be able to kill them. Just what in the world happened? If I were there accompanying them, I would have been able to see”</p><br/><p>“I can’t believe it” (Io)</p><br/><p>“Isn’t it just that in this world we don’t know what could happen? Even I, if these were how it ended, it wouldn’t be fun. If I knew this would happen, I would have killed the Gritonia Hero. The effect of the ring was instant on that side. He became a small fry in a breath”</p><br/><p>The woman that was already flying in the sky, without hiding her bad mood, throws casually at Io words that could be taken as a monologue of her. Afterwards, he returned to Stella Fort alone.</p><br/><p>Maybe he wasn’t perfect yet, he dragged his body while getting in contact with the soldiers and ordering them to clean up the remaining hyumans. And following the path the woman took, Io returned to the fortress.</p><br/><p>Like this, the Stella Fort capture battle had ended.</p><br/><p>Leaving a big wound on the hyumans…</p><br/><p>And moving the world bit by bit.</p><br/>\n</div>"}