{"title": "Chapter 79: Mio in the middle of a trip", "id": 79, "volume": 1, "url": "http://boxnovel.org/tsuki-ga-michibiku-isekai-douchuu-chapter-79-mio-in-the-middle-of-a-trip", "volume_title": "Volume 1", "body": "<h1>Chapter 79: Mio in the middle of a trip</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 79: Mio in the middle of a trip</p><br/><p>Sorry for being late. I am trying to catch up with my friends in Blade and Soul.</p><br/><p>“Mitsurugi you say? That brat, he wasn’t dead huh” (Tomoe)</p><br/><p>One could tell Tomoe’s slight surprise from her words. I was somehow able to detach myself from them and tell them the situation, but, as expected, the two of them were quite angered.</p><br/><p>“Probably. Also, he was with Dragon Killer that supposedly killed him” (Makoto)</p><br/><p>First of all, I have to tell them everything. If I stop all the time to soothe them, I will never end.</p><br/><p>“I still don’t know that part yet, I just know that the battlefield the Goddess kidnapped Waka to, is probably one of the battles in order to capture Stella Fortress. It seems it was an awful battle. I heard a big part of the hyumans died. But well, I see, Mitsurugi did that to Waka… Hoh~, fumu…” (Tomoe)</p><br/><p>Ignoring Tomoe who is narrowing her eyes in a dangerous way…</p><br/><p>I see, Stella Fort huh. It’s a name I haven’t heard before.</p><br/><p>Certainly, it was the construction that had the most amount of people around. So that was the fortress huh. I took notice of it when I was high in the skies so it was on the moment I was about to return. In the end it became a losing fight for the hyumans huh.</p><br/><p>If people like Sofia are in the demons side, I can understand. That was a scary living being. My last attack was probably only useful as pestering.</p><br/><p>Experiencing a place where people kill people is a first in my life, now that I think about it. Not as a spectator but as a concerned party. It may be too late to say it now, but it was scary.</p><br/><p>“I see. That Goddess threw me into an outrageous place. Moreover, the moment she found me, she didn’t even say anything! I seriously thought I would die!” (Makoto)</p><br/><p>“Doing something like that to Waka-sama, how dare her… Goddess, unforgivable” (Mio)</p><br/><p>Mio is now in a state where conversation won’t get through her. She is in a trip of her own. Her eyes have lost color and are completely still. It is a state where her ears are not working properly.</p><br/><p>She won’t suddenly go rampage, so there is no need to soothe her for now.</p><br/><p>“However, to cause so much trouble for Waka, just how did they do it? With that equipment and magic power, it isn’t something that one can defeat. But it is true that you were severely injured. Wumu” (Tomoe)</p><br/><p>“It is because of my negligence and lack of knowledge. I think these were the reasons. Suddenly being thrown in the battlefield and suddenly encountering such a monster, I was in a total state of panic” (Makoto)</p><br/><p>I was in a terrible state where not only did I not deploy numerous magic, I wasn’t even able to properly put up a barrier.</p><br/><p>“Fumu…” (Tomoe)</p><br/><p>“It was a woman that swung around a sword bigger than her own body and was even able to slice twice in midair. On top of that, I don’t know if it was instant movement ability, but she was able to ignore distance as much as she wanted. It made me think that I have to learn how to deploy a barrier as fast as possible and increase the amount of magic power I can use at once. In my current state, I am unable to use my advantages to their best” (Makoto)</p><br/><p>“The amount of magic power you can use huh. Certainly. Setting aside the purity and density, Waka normally doesn’t seem like you are using that much magic power. It’s a changed magic with high effectiveness but in terms of aggregate amount, it certainly would be best to be able to form magic on the level of several rings. The time when you were against Mio, Waka had a different atmosphere there too” (Tomoe)</p><br/><p>Yeah. Taking into account the amount of magic power I have, the amount I can use is way too low. Only having it is really a waste.</p><br/><p>“I think that if I learn the basics in the magic academy, things will change a bit. I will try asking Shiki over there as well” (Makoto)</p><br/><p>“… About that. I think that it would be better if we also accompany you there. We don’t know when the Goddess will interfere again. Her saying “found you” must mean that she has been looking for you over there and was able to find you” (Tomoe)</p><br/><p>“…”</p><br/><p>“Please reconsider” (Tomoe)</p><br/><p>I understand the concerns of Tomoe. Even I, if an important friend or family suddenly disappears and returns injured, I would worry as well. I think it is best to strive in not making something like that happen again.</p><br/><p>“Tomoe, I am definitely worried about the Goddess, but it is because of that that I don’t want you and Mio who she probably doesn’t know of yet, to hide their existence in Asora. She probably already knows about Shiki now, so instead of making him return, I think it is better to have him stay with me. Just like what I asked you, I want you to research for a way to oppose the summoning of the Goddess. It is also because I want to leave people I can count on in Tsige” (Makoto)</p><br/><p>That’s right. I was kidnapped on the magic transfer formation, so Shiki’s existence might have been exposed. But if she discovers the existence of Tomoe and Mio as well, before learning a way to oppose her summon, I feel like she will kidnap me and dry me up.</p><br/><p>In that case, I want to hide the two of them. I don’t know if good fortune will come out of this or a misfortune, but I don’t like having the Goddess know all my cards.</p><br/><p>“Fuh~ a function to negate the interference of the Goddess and the creation of something so the thought transmission isn’t obstructed. If Waka is able to summon us immediately, the problems will be mostly resolved, so tackling both problems is more efficient. Yareyare, there are only difficult problems. However, I feel honored that Waka thinks of us as trump cards. For the sake of the day to come, we will remain in obscurity for now” (Tomoe)</p><br/><p>“Sorry for the trouble. When I arrived at that battlefield, I was unable to feel the connections of anyone. Also the thought transmission was in a suspended state. I was really panicked. It is probably the Goddess’ fault, but the ring that Sofia used later also picked my interest” (Makoto)</p><br/><p>“The first time was probably because of the Goddess’ barrier, but the reason why it was restored for a second and then returned to the previous state might be because something obstructed the interference of the Goddess. The information we need to collect is way too much. I can’t ask you to let me go there and investigate in more detail either” (Tomoe)</p><br/><p>The words “restored for a second” of Tomoe interested me. I also want to know about what happened as a whole in that battlefield. Well, me going to the actual place to investigate right now feels like a poor move, so I refrain from that.</p><br/><p>“Sorry for counting on you for everything. For the time being I will also do my best in regards to summoning everyone. I promise that if there is a time it is okay to rampage, I will definitely call you both” (Makoto)</p><br/><p>Sorry for pushing all the troublesome things to you *dad* . In terms of countermeasures against the Goddess, the only thing I can think of is pulling my bow as much as I want and obtain magic power surpassing hers. Right now my equipment is able to hide my magic power so maybe I should do it.</p><br/><p>Ah~, I want to shoot.</p><br/><p>“I am looking forward to that. Nevertheless, I don’t want to feel that liver wrenching sensation again, so please prioritize a summon route. It is okay if it’s just my needless anxiety but please, instead of using magic formations to mobilize, use Asora. We will manage the increase of gates on this side” (Tomoe)</p><br/><p>“Ah, okay” (Makoto)</p><br/><p>No good. I was showing withdrawal symptoms from my lack of archery. Even if I was unable to eat or sleep, I never missed a time with my bow after all. More like, it is a given. Now that it has come to this, I will not restrain myself.</p><br/><p>“The battle between hyumans and demons is still far north. Fumu, in that case we need a detached force for the battlefield verification huh” (Tomoe)</p><br/><p>“I will leave it to you. If it is Tomoe’s personal selection, I can have peace of mind” (Makoto)</p><br/><p>Let’s flatter her a bit. I have been asking her a lot after all. Also, if it is Tomoe, there isn’t that much worries about throwing the job to the wrong personnel and cause a big mess. I may be overestimating her though.</p><br/><p>“Thank you for your graceful words. Also, can you have a word with Mio as well?” (Tomoe)</p><br/><p>With a quite troubled face, Tomoe points out Mio. Her face is telling me she doesn’t want to deal with her.</p><br/><p>“…”</p><br/><p>Mio huh. Her miasma is unnaturally thick right now and I really don’t want to get close. Maybe I should tell her to think countermeasures along with Tomoe in order for this to not repeat again?</p><br/><p>Hmph.</p><br/><p>Yeah!</p><br/><p>But I refuse!</p><br/><p>Ignore ignore!</p><br/><p>“Go and wake her up Tomoe. Shiki is waiting for me so I will be going now. It is pitiful to make him line up alone right? Shiki doesn’t know the situation at all too” (Makoto)</p><br/><p>“… As you will. When you return, there will be a surprise so be careful. Also, lying is no good. The first one you made contact with was Shiki right?” (Tomoe)</p><br/><p>“W-Well, I would be grateful if you don’t think too much about the order. There was no deeper meaning in me contacting Shiki first after all” (Makoto)</p><br/><p>Surprise she says. What a bad feeling those words give! At least say look forward to it. Moreover, for some reason she knows that I have done thought transmission with Shiki.</p><br/><p>But I don’t want to get close to the current Mio. Tomoe’s surprise will probably be in a scope profitable for me, so for now I will endure. If things get busy at the Academy, I don’t know when I will be able to return. Leaving aside the surprise, I am looking forward to the reports of what they did while I was in the academy.</p><br/><p>But for now it would be better to be cautious about the Goddess in terms of communication. Mobilizing by mist, I can’t really hold back from that one. They are way too convenient. I can’t use them as frequently now, but mobilizing with them is something I will probably be doing. It doesn’t seem like the Goddess has noticed that I am using Asora as an intermediary to move. Probably the Goddess knows all the actions I did at that time, or maybe not. In that case, it is about that bug, she would probably come to me saying a word of complain or two. If she is not coming, it is probably safe to say she doesn’t know yet.</p><br/><p>Yareyare, I haven’t entered Academy Town and it is already like this.</p><br/><p>No matter which is the case, what I have to do is polish myself. Let’s go strengthen myself for anti-Goddess measures. Before even learning about hyumans and magic, that Goddess might once again drag me into some trouble.</p><br/><p>Geez.</p><br/><p>In time, there will be no need for you to look for me, I will be the one going to you, so sit your ass and wait there. The things I want to do, want to aim for; if I am able to at least clear those, there is no need to stay hidden anymore.</p><br/><p>No matter if I stand out or not, I will continue business and search for information about my parents.</p><br/><p>“U-Uhm!”</p><br/><p>When I was about to head to the Academy, a new voice calls me out. From PE sit to a firm and upright posture, a single girl holding her loved katana with both hands like embracing it, was there.</p><br/><p>“Ah, Komoe-chan. Did I wake you up? Sorry” (Makoto)</p><br/><p>“Waka-sama, please don’t push yourself and have a safe trip!” (Komoe)</p><br/><p>You are a kid so it is okay to not force yourself to use polite language. Well, having a small girl doing her best talking is something that brings a smile to my face though.</p><br/><p>“Okay, I will be going now. If Komoe-chan is being bullied by Tomoe, tell me okay?” (Makoto)</p><br/><p>Waving my hand at her, I pass through the mist gate.</p><br/><p>“Komoe will do her best!” (Komoe)</p><br/><p>Komoe is tightly holding a long sword bigger than her. I didn’t hold that many conversations with the first generation. Because I thought the consciousness of the clones were shared with the original body. But Komoe holds a separate consciousness from Tomoe. The first generation didn’t hold that many conversations with Tomoe either and seemed to be doing decisions, so I misunderstood. Or maybe Komoe is different. But I don’t intend to confirm this. I will treat her as a completely different person. That’s fine for me.</p><br/><p>Taking that into account, I am probably treating her kindly. Even when I know this won’t atone for the death of the first generation.</p><br/><p>Ah~ but…</p><br/><p>If Tomoe were this polite with me it would be nice~.</p><br/><p>I grasp the position of Shiki.</p><br/><p>“… Waka, I like samurais but… I wish you to stop the pedophilia” (Tomoe)</p><br/><p>“Like hell I am!!” (Makoto)</p><br/><p>The words that Tomoe said with a slightly serious face, I thoroughly deny them.</p><br/><p>The last words of her wore me out a bit, but I still continue to head out to Academy Town.</p><br/>\n</div>"}