{"title": "Chapter 71: Ring", "id": 71, "volume": 1, "url": "http://boxnovel.org/tsuki-ga-michibiku-isekai-douchuu-chapter-71-ring", "volume_title": "Volume 1", "body": "<h1>Chapter 71: Ring</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 71: Ring</p><br/><p>Reigokai: Hey guys, let me get this out of the way first.</p><br/><p>If you are dropping this or leaving, you don’t need to post it. I won’t say I don’t care because I actually do, so if you are going to complain try to limit it to me and the story. And when you decide to leave, do so silently.</p><br/><p>By the way, I know you guys don’t like these recent chapters of the heroes. If you feel this way, just let them accumulate and return at a later time to read. I personally like these chapters. If I wasn’t the one translating, I would actually enjoy them. The change of pace and view from another perspective is not bad.</p><br/><p>So yeah, this chapter is hella long and I found it interesting. If you feel like you don’t like them: skim, skip, let them accumulate.</p><br/><p>I will leave you a note, 2 chapters more till our MC comes back.</p><br/><p>“Tomoki, Iwahashi Tomoki! Wait, weren’t you listening?!”</p><br/><p>“I heard and understood everything! The moment where the enemy has his guard lowered the most is right now when our rear guard is sluggishly falling back! I will open you your path so shut up!” (Tomoki)</p><br/><p>The dragon takes the lead and Hibiki’s group chases.</p><br/><p>“The retreat has not finished yet and if we do something like begin the battle again it will only expand the damage of the units! The enemy has already been deployed and waiting, there is no way you can expect that much negligence from their side!” (Hibiki)</p><br/><p>“If there is just a bit, that is enough! We are in the battlefield. Everyone is prepared to die! Hibiki-san, you are way too soft!” (Tomoki)</p><br/><p>“Don’t mess around! What are you trying to achieve by deepening the chaos in your own team! We should find the escape routes that are possible and see how many units we can use…” (Hibiki)</p><br/><p>“A geez! You are noisy! Don’t you understand?! A hero is a figurehead and that will serve as a salvation! This way more people will be saved! It is obvious which one is more beneficial! We are special! Chosen ones! If you say you want to die, do as you wish. I don’t care about that self-satisfaction. I will do your part as a hero in Limia as well so don’t worry!” (Tomoki)</p><br/><p>Hibiki’s group is taking the road where the rear guard should retreat and Tomoki is riding a dragon to mobilize. Their natural speed is clear and the distance between them slowly widens.</p><br/><p>Words already couldn’t reach. In the path they have taken there is only scorched ruins. Even if their speed can’t be compared to that of when they are fighting, the difference between a dragon and a person can’t be filled so easily.</p><br/><p>“What a guy. Isn’t encouraging the troops, standing in the battlefield as a standard-bearer, the way a hero should be? For him to try to save himself no matter what. I won’t approve that” (Hibiki)</p><br/><p>“But Tomoki-dono has a point as well. If we lose you, Hibiki, in this battle, the thousands of people you could have saved will no longer be saved. Your life is far more important than the hundreds of soldiers we are looking to save here” (Naval)</p><br/><p>“Naval, shut up. I don’t want to hear anymore. I won’t ask. Because I still want to stay as your partner” (Hibiki)</p><br/><p>“Hibiki-dono…” (Bredda)</p><br/><p>Hibiki shakes her head horizontally at Bredda’s words.</p><br/><p>“This is one way as a hero. I understand that is what you want to say. That our job is to survive at any cost. But I don’t like that. Also this can also be called a way of surviving in a fatal situation. In the middle of fighting the enemy general, if there is an opening somewhere, we will escape at once. That is what I am also thinking. I know this is optimistic thinking though” (Hibiki)</p><br/><p>She knows this is quite the wishful way of thinking, even so, she doesn’t want to say this is completely hopeless directly from her mouth. A decent reconnaissance has not been done. Then she at least wants to have this much hope. It is also the naïveness of Hibiki who was raised in modern society.</p><br/><p>“It doesn’t change the fact that we got the short end of the straw, but someone has to do it. There is the chance the demon general will surround the remaining troops. If you tell me that is the responsibility of a hero, that is certainly true. Yareyare” (Wudi)</p><br/><p>Wudi. He may have seen the hero way in Hibiki’s actions, it seems he had resolved himself to what was to come.</p><br/><p>“I will do my best. I won’t fall down in the middle like last time!” (Chiya)</p><br/><p>Chiya. Remembering the time with the black spider when she dropped out and left Hibiki all by herself, she brings out her fighting spirit.</p><br/><p>“I am sorry, the hero I chose is Hibiki. I will accompany you till the end” (Naval)</p><br/><p>“Me also, I won’t be defeated so pathetically like last time. We are the five that pushed the calamity away. Something like a demon general, we will be able to deal with him somehow” (Bredda)</p><br/><p>Naval and Bredda.</p><br/><p>Tomoki, while burning the demon troops with overwhelming fire power, slows down his pace and Hibiki confirms his location.</p><br/><p>Is he waiting for her, or is he just having difficulties. No matter which one it is, she won’t accept the ways of that hero. That is what Hibiki decided.</p><br/><p>Increasing her pace by one, the girl runs down the gentle slope and finds a messenger soldier. She makes her way to where he is.</p><br/><p>“T-This is hero-sama! Just as instructed, we are having all troops retreat!”</p><br/><p>Feeling deeply moved to have a heaven descended person, the hero, pat his shoulder, the young messenger soldier returns an upright and firm salutation.</p><br/><p>“Thanks for your hard work. I am sorry for the continuous changes but, I want you to send a message to the generals of each unit. To stop the retreat and silently reorganize. Me and the Gritonia hero will open a path to escape so follow us” (Hibiki)</p><br/><p>“That is…”</p><br/><p>“I understand. They can’t change their movements so constantly. But please. Also, tell the same thing to the Empire. In this kind of situation, there is no Empire nor Kingdom. We are definitely going to open our way” (Hibiki)</p><br/><p>“… Yes, understood ma’am!”</p><br/><p>He breathes deeply and slowly exhales it.</p><br/><p>Seeing the running man that is hurrying to spread the message, Hibiki does one deep breath.</p><br/><p>Silently closing her eyes, instead of resuming her breathing, she envisions the future. This is a habit she does whenever she is about to have a match with a strong opponent in kendo.</p><br/><p>“Let’s go!” (Hibiki)</p><br/><p>Hibiki’s party runs through the corpse-filled path that Tomoki has opened. It’s vexing, but this kind of destruction power deserves a special mention, is what the girl thinks. This is a feat Hibiki wouldn’t be able to accomplish. At least not in this short amount of time.</p><br/><p>Taking into account the mobility of the dragon Mora called, coupled with the sturdy defense of Ginebia that is riding it, the high firepower of Tomoki who is using sacred treasures, and also the one providing support to Ginebia’s defense and Tomoki’s firepower, the one utilizing a replica storage and mass producing golems with alchemy, Yukinatsu.</p><br/><p>Their figure when destroying the barriers the demons create with surplus and pushing on is fierce. As long as their barriers can’t resist, it would mean the only ones that could stop their advance is someone who has a good amount of power. In short, this means that they are able to shine indefinitely against these demon soldiers.</p><br/><p>Just how many are feeling uncomfortable by the fact that this man is only opening this path just for obtaining his own safety. This is what Hibiki thought while looking at that far back.</p><br/><p>“These are the last two!” (Tomoki)</p><br/><p>Even the unit that was in front of the 4-armed general and wielded relatively high-class equipment were being burned down by the enhanced mowing light that was being shot from Tomoki’s spear. And the blaze that Nagi breathed out also minces the soldiers that try to approach. It seems it was spewing out an invisible wind blade.</p><br/><p>The ones who thought about grabbing the flying dragon to obstruct its movements were scattered by the golems. People, beasts; the lifeless dolls that donned different forms didn’t permit the approach of anything.</p><br/><p>“What an inelegant hero we have here. Looks like a kid raging at a party”</p><br/><p>Releasing his crossed arms, the light purple skinned giant makes a fist. To be about three meters in height made him a small one in the Giants race, but the muscles that were packed in that body and the overpowering aura that spread out showed that he is a demon who is befitting of his title as a general.</p><br/><p>The words that he directed to the hero also carried weight. It was calm yet heavy. And the presence of the 4 fists he made were also quite the thing.</p><br/><p>“We don’t know about the inelegant part! Aren’t you the one with the broken head, going barehanded in combat?” (Tomoki)</p><br/><p>Tomoki throws a light as a substitute of a greeting.</p><br/><p>“Mun!!”</p><br/><p>The demon general, with one hand, intercepts the dark cleaving light.</p><br/><p>Meeting a collision, the light disappears. But the arm that was used to intercept this attack was burned black and had lost its base form.</p><br/><p>“… As expected, one hit won’t be enough huh. Well, your opponent is another one. With this I am bidding sayonara. There’s no way I would lose if I fought, but I have to keep my promises you know!” (Tomoki)</p><br/><p>The surplus-filled Tomoki and the others change direction, avoiding the front where the demon general is and beginning their attack on the troops at the left side.</p><br/><p>“I won’t let you do that! Mu!”</p><br/><p>The demon general tried to chase Tomoki, but feeling something, he looks at the path where Tomoki had appeared in.</p><br/><p>A something clad in crimson light and crescent moon shape was approaching. As if running after Tomoki who is riding a dragon.</p><br/><p>“Hoh~, this one looks like a warrior. Did you get a chance to learn speech?” (Four arms)</p><br/><p>Whispering amused, the demon general scatters away the red attack with one hand. The figure of Hibiki wielding a sword clad in red is now in sight. In that clash of powers there wasn’t a single wound in his arm. This was prove of the difference in firepower between Tomoki and Hibiki.</p><br/><p>“Did I make you wait? If the one that came here before me did something impolite I apologize but…” (Hibiki)</p><br/><p>Maybe he was not taking into consideration the male hero from just a few moments ago anymore, with a ferocious smile in his face, the figure of him waiting for Hibiki’s arrival was truly imposing.</p><br/><p>“Nah, he was a really hyuman-like hero. Because even when words got through, it was impossible to establish a conversation” (Four arms)</p><br/><p>Severe sarcasm.</p><br/><p>“It annoys me that you think that is the obvious reaction a hyuman would have” (Hibiki)</p><br/><p>“Then you prove it. However, it won’t be with words, but with your skills” (Four arms)</p><br/><p>Against the giant that puts his fists on the front, Hibiki looks at his face and prepares her bastard sword.</p><br/><p>“Of course, I will do so. I am Limia Kingdom’s hero, Otonashi Hibiki” (Hibiki)</p><br/><p>“Well, well, how polite. I am the demon army’s third group general, the demi-giant Io” (Io)</p><br/><p>The demon general that had his eyes wide open for a second because of Hibiki’s self-introduction, returns it with his own introduction.</p><br/><p>“We may be outnumbered, but still, we will win. Even if we look like this, we were able to drive away the calamity after all” (Hibiki)</p><br/><p>“The spider huh. I have heard the report. It seems you guys are quite capable. Also, outnumbered is a misunderstanding. I promise I will be the only one fighting the hero and her party” (Io)</p><br/><p>“?! Wait, he has one arm burned off and he still says that?” (Hibiki)</p><br/><p>Looking at the charred arm that is probably unable to be used at all, the girl stops her movements from the surprise.</p><br/><p>“N, ah, this isn’t even worth calling handicap. Fuhm” (Io)</p><br/><p>Small cracks appear in the charred arm. With one swing of it, that charred skin was brushed off and an arm appeared as if nothing had happened.</p><br/><p>“… Is that the so called, high-speed regeneration?” (Hibiki)</p><br/><p>“That’s right. Well, it is not in the absurd level of the black spider, so I might not match expectations though” (Io)</p><br/><p>“You have made me remember an unwelcomed memory. Also, it seems you know quite a lot and set up such a trap!” (Hibiki)</p><br/><p>“This time I had a lot of things pushed onto me so. I am not fighting just for myself here. That trap was the idea of the fox woman that calls herself tactician” (Io)</p><br/><p>The scorn of Hibiki is answered by Io with apologetic words. The regeneration ability is not something he obtained to pester but something he was born with and the plan was planned by someone else.</p><br/><p>He himself likes to fight fair and square by clashing their abilities. He is a warrior from the core after all.</p><br/><p>“Are you telling me the one who holds the responsibility is someone else? Isn’t that dirty?” (Hibiki)</p><br/><p>“Fufufu, are you provoking me? It’s not like I am trying to escape the responsibility. Also, I am planning on becoming a hero by defeating thousands of hyumans you know? There is no need for me to let achievements slip my hands. If I obtain subordinates by climbing in ranks, I end up unable to fight in the way I desire. That is the only thing I wanted to say” (Io)</p><br/><p>Letting Hibiki’s words slip, Io shows the simple but good quality ring on his thick finger.</p><br/><p>“What? An engagement ring?” (Hibiki)</p><br/><p>“No no, what a funny joke. I am single. This is one of the things I said before, something that was pushed onto me. They told me to use it to snipe the hero. Right now the two of you should be in range, a nice time to use it. *Ghjkop \\ kkjjgf*” (Io)</p><br/><p>With the unknown words he used as a signal, the ring crumbles as if made of clay.</p><br/><p>“… What?” (Hibiki)</p><br/><p>The strength in her body feels like it is seeping away. The strengthening that she obtained with the blessing, she felt like it was coming out from her body. Not only that, the wolf that was by her side protecting her, became dim and disappeared.</p><br/><p>“Hoh. It really showed effect. With this I can finally see our world coming to fruition” (Io)</p><br/><p>The giant, seeing the wolf vanish, opened his eyes wide and makes a satisfied smile.</p><br/><p>“What… did you do?” (Hibiki)</p><br/><p>“I tried… erasing the blessing of you guys. It seems to only work for a limited time though. I was holding my breath, but it seems to have worked. What a splendid result” (Io)</p><br/><p>“You blew away the God’s power with that one ring?!” (Hibiki)</p><br/><p>“It has a crazy cost and it’s disposable. An incomplete product that is barely able to be of use in limited situations. Anyways, having something like a 4-times curse, do you really think we would just stay biting our fingers? First of all, did you think we were halved in this fight? I am sorry to say this but, we have already made countermeasures for your curse. To plan thinking you are fighting the same opponent as 10 years back, not even a fool would do that you know?” (Io)</p><br/><p>“Uh” (Hibiki)</p><br/><p>That’s true. If I were to be affected by a 4-times curse, I would try to do something about that first, is what Hibiki thought as well.</p><br/><p>“Now, Hibiki and the others. Let’s begin. Please show me the power of a hero. Show me that it is a power that can reach the Demon Lord!” (Io)</p><br/><p>A truly elated voice resounds in the battlefield.</p><br/><p>Hibiki and Naval advance as an answer. In a distressing situation where one would normally retreat, the fight of the demon general and the hero began.</p><br/><p>—</p><br/><p>“Hibiki, what is that girl doing?!”</p><br/><p>The impatient voice of Tomoki is heard from the top of the dragon flying in the battlefield.</p><br/><p>His body had suddenly become heavy. It felt like his body had become even heavier than before, like a limiter had been put on himself. But what is important is not that. The problem is that the spear and boots as well as the armor were not showing any reaction.</p><br/><p>The necklace that is being used as storage can be activated. But everything else showed practically no reaction. The armor that he could barely feel any weight from and had showed numerous defensive effects, had now become a mere heavy armor. When this happens, even the rubber suit that he had on as a foundation felt uncomfortable.</p><br/><p>Practically every single weapon he called from his ring showed no reaction. The only thing that showed a response was a thin sword.</p><br/><p>For him who is not suited at close quarter combat, this equipment was pointless. It wasn’t a weapon one could use when in a mounting state anyways.</p><br/><p>The one responsible for this irregularity is probably that demon general. In that case, it means this was caused by Hibiki’s ineptitude.</p><br/><p>(Is the power of the goddess sealed?! Is it okay for an opening boss to have this kind of power?! Or more like, if I can’t use the power that the Goddess gave me, then isn’t… the demon eyes in trouble as well?! I have to escape from this place as soon as possible!) (Tomoki)</p><br/><p>But Tomoki who had thought until that point, notices an important reality. That if the Goddess’ divine protection has been lost, the most important condition has been lost as well. Tomoki looks at the sky.</p><br/><p>(Don’t tell me, could it be, could it be, could it be! The immortal state is also canceled?!) (Tomoki)</p><br/><p>Blood rushes to Tomoki’s head.</p><br/><p>This is no joke. If that is really the case, the point of choosing night would turn meaningless. It is because even if things turn to the worse, he still had this immortality to rely on. That’s why he accepted to participate in this wide-scale operation.</p><br/><p>He wasn’t sure, but with reasoning was enough. The fact that he might die with just a stray bullet in his current state.</p><br/><p>The fear of death begins to take control of him.</p><br/><p>(No good, if I stay in this kind of place I will die! But if I were to get agitated and go back… At any rate, the affection points that I had painstakingly racked up, if I were to retreat now… Well, no matter. If I am released from this state, I will be able to get them back anytime. Even Nagi, if it were to die, I just have to capture a new one. I have to retreat even if by force!) (Tomoki)</p><br/><p>Being unknown to death, he had obtained equipment of the highest class and had behaved strongly in the battlefield. Even if his level is high, he hadn’t experienced the death and life situations that fit that experience. This kind of reaction was no surprise.</p><br/><p>Up until now, when he thought there was a chance for him to get shot, he would only come out at night when the moon is out.</p><br/><p>“Tomoki, what’s wrong?” (Ginebia)</p><br/><p>“Ginebia, the situation has changed! We are going to return as soon as we can to where Lily is!” (Tomoki)</p><br/><p>Ginebia, who was concerned about Tomoki, was repaid with a yell.</p><br/><p>“B-But what about Hibiki and the others? And everyone from the Empire? I think if it’s just cover, we can still do so safely” (Yukinatsu)</p><br/><p>“Shut up Yukinatsu! I am worried about Lily’s safety, I have a bad feeling. Anyways, just hurry! Nagi, hurry up!” (Tomoki)</p><br/><p>A lie. The thing about Lily and about having a bad feeling. Right now he was only praying for his own safety.</p><br/><p>“Onii-chan?” (Mora)</p><br/><p>Losing her words because of the sudden change, Mora simply mutters. This is the first time she has seen such a side of him.</p><br/><p>Seeing Tomoki, who has begun talking about returning as if he had lost his mind, the three companions began having doubts. But those three had already accepted his order of retreating once, even if he has become impatient and forceful, there is no way they can decline at this point.</p><br/><p>“Hurry! We are going to leave this place!” (Tomoki)</p><br/><p>“U-Understood. Nagi, we are going all out! Do your best!” (Mora)</p><br/><p>“No helping it. It doesn’t seem like we can fight until Tomoki calms down anyways. Ginebia, I am counting on you. Aaah geez! I will also prepare myself to go in the red by doing a giant release of golems and replicas!” (Yukinatsu)</p><br/><p>“Roger!” (Ginebia)</p><br/><p>The three, who were basked in the demon eyes close to the level of being prisoners, were now released from that curse temporarily but all of the effects piled up until now tied up their bodies. Just as how Tomoki planned, all of that piled up love is now binding them.</p><br/><p>While Hibiki and Io’s fierce battle continues, Gritonia’s hero overtakes the enemy lines and heads to the Empire’s camp, to the tent where Princess Lily is waiting.</p><br/><p>If they can at least pass the enemy lines, there won’t be other obstructions. It seems that even though the demon army was deployed at the rear of the united army, they haven’t reached the point of controlling it yet.</p><br/><p>The time needed to reach the campground they sortied out from wasn’t that long.</p><br/><p>“Tomoki-sama, so you were alright! Ah, what a relief!”</p><br/><p>While being injured, Nagi was finally able to arrive at the destination and because of all the fatigue it didn’t even fold its wings and just fell to the ground. Seeing the hero that got down from it, Lily quickly ran to his side and while giving him a hug, she gave words of happiness at his return.</p><br/><p>Tomoki, released from the grasps of death, loses his strength in relief. Sweat came out all at once and his body couldn’t stop trembling.</p><br/><p>“Princess, to have let such an error occur, please forgive me!” (Ginebia)</p><br/><p>Ginebia falls onto her knees and apologizes at the princess that continued her hug. Promising victory at their departure and then returning by themselves, just how unsightly this is.</p><br/><p>“Ginebia, arrange the report of the situation. Come to my tent. Someone, come and take care of Mora’s dragon. It is incredibly exhausted. Mora, thank you for saving everyone” (Lily)</p><br/><p>“Tte, wait! Isn’t there anything for me?!” (Yukinatsu)</p><br/><p>Yukinatsu. Seeing the princess giving out prompt instructions but not being mentioned anywhere, Yukinatsu did a tsukkomi even when the other party is a princess. It was an act that proved their close relationship.</p><br/><p>“Yukinatsu, looking at your state, it seems you have done quite the expense. But for you to choose your comrades over money makes me really happy. If you give me the full list of what you used, I will bear full responsibility of it so rest assured. Go and take a most deserving break” (Lily)</p><br/><p>“Expenses in these dangerous situations don’t matter. More importantly, in this situation what we need right now is someone that can see the whole battlefield and give clear instructions. Can you do it?” (Yukinatsu)</p><br/><p>Yukinatsu looks serious and Ginebia lifts her head and agrees.</p><br/><p>“I understand. That is why I came. In the end we ended up going back immediately though. Tomoki-sama let’s return. Please tell me what happened as well” (Lily)</p><br/><p>Lily glances at the battlefield. And soon turns her body and returns to the campground.</p><br/><p>While hearing the report from Ginebia, Lily soothed Tomoki, cheered, comforted, healed. She also confirms the situation of the battle from his mouth.</p><br/><p>(It completely became a losing fight huh. In that case, no matter what kind of damages the empire receives, what’s important is to withdraw. Luckily the Kingdom’s hero seems to still be fighting, so let’s have the Kingdom’s army work as our shield. The Kingdom’s strength will also be chipped, so two birds with one stone. Thinking about it, if the Limia hero dies here, the future would become much easier for me but… this would be too greedy. Our hero somehow managed to return without breaking and we have understood a bit of the demon race’s moves and tactics. As a harvest, this is enough. It was originally fine if we didn’t win anyways, so let’s leave it at this. Also, the empire right now should be… Fufufufu) (Lily)</p><br/><p>“Tomoki-sama, you have gone through a lot. Because of my own lack of ability in information gathering I have made you pass through such a harsh time. I am truly sorry!” (Lily)</p><br/><p>“Lily. It’s fine, even Limia didn’t know anything. More importantly, should I have acted together with the Limia hero? With the two of us, the chances to win might have been higher” (Tomoki)</p><br/><p>“No! The stupid one is that mockery of a hero, Hibiki. The existence called hero gives hope by living. To die for the sake of relieving her own satisfaction is just abandoning her duty. Tomoki-sama is a special one, if you were saved by the sacrifice of thousands of soldiers, it would still be cheap. It was the right decision. Please have more confidence in yourself” (Lily)</p><br/><p>“… I see. You are right! If I die nothing will come out of it right?! Thanks Lily, I will have more confidence and I will become even stronger!” (Tomoki)</p><br/><p>“Yeah, get as strong as you want. Lily will always be at your side Tomoki-sama” (Lily)</p><br/><p>(If the Goddess’ divine protection is suppressed, in the current state, there is almost no worth in using “this”. Seeing the compatibility of sorcery tools he has, I think it is better to increase the amount of items that have as much use. Having weapons stacked inside the ring storage that he doesn’t even use would just get in the way anyways. How troublesome. That pathetic sight he showed this time is out of the question. The clean up will be such a pain. Being blessed with such an environment and having that equipment as well as level, he still shamefully trembles. The hero the Goddess gave us is seriously thrash) (Lily)</p><br/><p>She deeply embraces Tomoki once more. While having a slight cold shine reflected in her eyes that the other three companions don’t have.</p><br/><p>(The empire soldiers that personally saw our hero’s pathetic figure are mostly dead already. In the case they return, we make them experiment materials. Doing that, the result will be the same. We will obtain silence. The guns tend to explode a lot and to complete them we need a lot of people after all. No matter how many we have, it won’t be a problem. For Stella, we will let it sleep for three months… No, around half a year. Even if this was part of their plan, it’s still true that we were able to assault the outsides of the gate. If our side manages to talk smoothly, we should be able to buy that amount of time) (Lily)</p><br/><p>Lily arranges her thoughts.</p><br/><p>Stella Fort recovery plan failed. Using the Limia hero that decided herself to hold back the enemy, the Empire troops withdraw from the front. The Kingdom’s army wait for their hero to escape and work as a rear guard while retreating. Barely escaping from the demon race’s dirty trap, the Gritonia hero apologizes to the citizens and promises a comeback.</p><br/><p>This being the result of the current strategy, the princess concludes and controls the truth of the information her own army should know. Getting in contact with the Kingdom’s officers, they decide on the process of their retreat.</p><br/><p>With the information in disarray and not being able to contact the front lines at all, the information of Gritonia hero being the only one who returned was used as a weapon by the princess and, manipulating in the shadows, the results came out instantaneously.</p><br/><p>The actions of Hibiki backfired completely. The information that the hero directly brought out weren’t lies, is what the Empire’s princess made them think and the Limia officers that received this information, while crying and giving praises to Hibiki’s decision, happily accepted the task of being the rear guard. Not only that, one unit of young people stood up and asked permission to rescue her which the superior officer gave his authorization. Princess Lily, maybe because she didn’t consider this as anything that would bring trouble to her plans or because if she denies them she would bring doubts, only cried tears and gave praises at their bravery before departing.</p><br/><p>Thus, by the time the sky was turning gray, the united army’s retreat began.</p><br/>\n</div>"}