{"title": "Chapter 74: The suffering of the Golden one", "id": 74, "volume": 1, "url": "http://boxnovel.org/tsuki-ga-michibiku-isekai-douchuu-chapter-74-the-suffering-of-the-golden-one", "volume_title": "Volume 1", "body": "<h1>Chapter 74: The suffering of the Golden one</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 74: The suffering of the Golden one</p><br/><p>First of all, thanks AnimeloverN7 for the donation ^^</p><br/><p>Now, Makoto is finally back! &gt;:) Btw, I decided to use servant instead of follower. At first I felt like servant was too degrading but now I feel it is quite fitting. Do tell me which one you prefer.</p><br/><p>Anyways, this chapter shows how human Makoto actually is. I like that🙂</p><br/><p>Inside the dazzling light, I feel like I heard a voice I have heard before. The moment I tried to turn my attention to it, a soft sensation enveloped my body.</p><br/><p>There is also a floating sensation I didn’t feel in the transfer formations at the other towns. Before I could grow vigilant, a strong light as if exploding, dazed me and I reflexively closed my eyes.</p><br/><p>I waited until the sudden strong light weakened before I open my eyes. I didn’t want to receive that flash-like light. It seems I was somehow able to protect my eyes, but I didn’t know what was going on.</p><br/><p>This is… where? It is clearly not a place I have seen before.</p><br/><p>Is it a stream? A river is flowing in front of me. It has a bit of width, but it’s a shallow river which I can see its bottom. If I feel like it, even without looking for a bridge, I would be able to cross just like this.</p><br/><p>This is so sudden that I don’t know what to do.</p><br/><p>I certainly got on the transfer magic formation. Then this should be the inside of the next relay town. Yeah, thinking things through is important. Uh?</p><br/><p>That thing I see in front of me… a mamono? There are also demons there. They are heavily armored and walking in a really imposing manner. What, what in the world is…?</p><br/><p>They are on the other side of the river. Since the river itself is pretty big, there is a relative amount of distance between us.</p><br/><p>My breathing becomes shallower. I try to push aside this strange atmosphere for now. And then, I notice something.</p><br/><p>I can feel presences at my back as well. I am scared, but if I don’t see what it is, nothing can be done. I felt uneasy about turning my sight away from that strange-looking group, but I push those feelings aside and turn to my back.</p><br/><p>Behind me there is a forest. In the spaces of the many trees, I could see the shadows of people. That equipment… the army?!</p><br/><p>The people that I could see were mostly facing the other side. It looks like they are retreating, but I can see a number of them looking at this side. Are they scouting?</p><br/><p>I don’t know from which country’s army they are from, but looking at their uniform equipment, they remind me more of the army than soldiers. At my back, a hyuman army; at my front, a demon army. Then does that mean… this is, this is… a battlefield?!</p><br/><p>I am right in the middle of both armies?! EH?! How?! Why?!</p><br/><p>I don’t understand, I don’t understand at all! I was with Shiki… That’s right, Shiki. My servant. Where is he?</p><br/><p>Of course, just noticing that Shiki is not by my side makes me feel a sense of crisis. This is bad. I am quite unsettled.</p><br/><p>(Shiki! Shiki! Can you hear me? If you can hear me, I want you to please explain me what is happening!)</p><br/><p>There is no response. Or more like, I can’t feel it reaching. Is it being obstructed? Then…</p><br/><p>(Tomoe? Tomoe! Can you hear me?!)</p><br/><p>(Mio, it is me. Makoto! Can’t you hear me?!)</p><br/><p>No good. It feels like the call isn’t even connecting.</p><br/><p>To think I can’t even get in contact with my servants. This is the first time something like this has happened. What should I do? For some reason I am in a battlefield-looking place and it seems they are currently not fighting, but it doesn’t mean this place is safe. No, it is better to think this place is dangerous.</p><br/><p>If the hyumans are retreating, the demons are chasing them, or so I think. If that is so, then this kind of river won’t even serve as an obstacle. I don’t think they are an army of *vampires* after all. What was it that stopped their advance? No, before that, why am I even here? From the Academy Town, there is quite the distance to the north before one reaches the war fronts. Are you telling me I have arrived to that north? </p><br/><p>What I can think of is, that voice I heard when I was inside that transfer light. That was… the voice of the worst existence that I met when I first came to this world.</p><br/><p>Goddess.</p><br/><p>There is no way I would mistake that voice. No doubt it’s her.</p><br/><p>If I remember correctly, that bug said… “I found you” or something like that. Are you telling me after all this time she now has some business with me and called me?</p><br/><p>But what is that business? I wasn’t told anything. Well, even if I hear it, I don’t plan on doing it though. There is no way that after treating me so badly she would come and say “become a hero” anyways.</p><br/><p>To throw me in this situation so suddenly without any information, just what is going on? I can’t read the thought patterns of a God. Especially when it comes to that self-centered idiotic Goddess!</p><br/><p>Damn it. There is only questions popping up inside me. What should I do? How should I move?</p><br/><p>?!</p><br/><p>Wa?!</p><br/><p>A bad feeling instantly runs through my back.</p><br/><p>This is… blood thirst! And it is pretty precise!!</p><br/><p>It resembles the one my sensei poured on me when she told me I should get used to it. The strength of the presence also!</p><br/><p>The person that can show such an impressive power is in no way decent! It is the type of presence I tried not get close to in my previous world.</p><br/><p>From in front me. From the demons side, something is heading my way.</p><br/><p>A human shaped one. Is it a demon? There is no doubt this one is strong. Or more like, scary.</p><br/><p>Should I run to Asora? But I can’t have that one enter as well. The time it takes for the gate to close after opening it, there is no assurance that one won’t plunge into it at that time. Tomoe said something about enclosing an opponent in a small airspace and one-sidedly attack it, however, using that ability is still impossible for me.</p><br/><p>There is no choice but to probe huh. Oioi, you are kidding me right? Isn’t that, a kid?</p><br/><p>When I look closely, I can see that he is floating, his legs are not moving. A boy(?) with orange hair is heading my way at a pretty fast speed. Certainly, I feel the blood thirst from that kid. But it is a kid you know? It doesn’t look like he is equipped with any exaggerated equipment. Both of his hands are empty too. If he were a magician, a staff would fit but… I can’t see a single difference with him and the children I see playing at town.</p><br/><p>From the place that innocent looking child is, I can feel that strong blood thirst I previously felt. Also the part about him floating.</p><br/><p>Feeling nervous at the scent of the battlefield I have never felt before, it choked me. While feeling my breathing grow increasingly shallow, I watch the kid’s actions.</p><br/><p>As if it were natural, he had already reached until the middle of the river and without dropping his speed, he advanced to my location. *So there’s no problems in crossing the river huh*. Is it settled that he has business with me? </p><br/><p>That means, the reason the demon army stopped its advance, could it be…</p><br/><p>… Me?!</p><br/><p>“Disappointing”</p><br/><p>From my left, a sudden voice! A woman?!</p><br/><p>No way! There is no one—?!</p><br/><p>Sensing something closing in to my face, I lower my head and instantly cover it with my left hand. Immediately following, a dull and powerful impact. Without being able to confirm its identity, I was thrown by that attack.</p><br/><p>Gu… wu wu.</p><br/><p>This might be the first time since I came to this world that I feel a strong and clear pain. An attack I didn’t expect to come. In the blow that was firmly packed with blood thirst, my body was sent rolling on the ground and after I stopped, a cloud of dust was created.</p><br/><p>It hurts. The throbbing pain is coming from my head. If I instantly lowered my posture and it hit my head, it means… its aim was my neck?! The insistent *zukin zukin* pain throbs in my confused head without holding back.</p><br/><p>My hand is burning. It must be because I tried to cover against that attack with my left hand. This one is going *dokun dokun*. It hurts… what is going on?!</p><br/><p>While collapsed face up, I bring my left hand in front of my face. I was astonished.</p><br/><p>“My fingers… half of them are gone” (Makoto)</p><br/><p>Even though it’s my voice, it felt strangely distant. My middle and index finger are practically gone from the root and a half is missing from the ring finger. Even though it is an emergency, I can’t seem to truly feel my current situation.</p><br/><p>What… what is this?</p><br/><p>Ah that’s right, I gotta get up! If I stay down, I won’t be able to do anything. I will be killed.</p><br/><p>The bleeding also. Since I can’t heal myself, if I am not careful, I might die from blood loss. The random tools I had were mostly in my bag that is presently gone. What I have is… the bow that I use for training. I can’t be picky here. At any rate, I have to bandage myself first. The bow is not in a ready to use state anyways. There is no problems if they try to stop me.</p><br/><p>Where should I begin tying from? For now let’s just randomly bandage beginning from my elbow. I should have gone to a short course for first aid.</p><br/><p>“Heh~ you are not dead. As expected from a person called by the Goddess. To not be cut by this sword, just what kind of defense you have? That face… could it be you are a hyuman synthetic beast, a chimera?”</p><br/><p>The woman voice states her amazement at me. Even if you voice out your admiration at my survival, it doesn’t make me happy. Also, I am not a mixed product! Don’t go mixing me!</p><br/><p>“Sofia, even though *I* went out of my way to turn his attention to me. For you to not be able to finish him, that’s not like you” </p><br/><p>It’s that kid. He is using *“Waga”. Damn it, a fantasy specialty. A character that one can’t tell its age by its outward appearance huh.</p><br/><p>“N? My attack connected perfectly. This sword isn’t soft you know? This Mitsurugi” (Sofia)</p><br/><p>I am still dizzy. I look at the person that is probably the one who attacked me. There is distance so, since my vision is blurry, I haven’t confirmed the person properly, but it seems she is forming a *combi* with that kid. </p><br/><p>Her bang is covering her right side, so I can only see one of her eyes. She has blue hair like Tomoe. This is a natural thing in this world, but her figure is well-built. On her body she has shoulder plates and a breastplate, also, protection in key points like knees and elbows. The other inner parts were barely covered by lightweight equipment. Her bottom part looks like she is wearing denim short pants. If it weren’t in this situation and we were just passing by each other, I would probably have turned around and admired those beautiful legs.</p><br/><p>sofia</p><br/><p>Also, that giant sword. It’s slightly bigger than her. Even so, in terms of length it’s shorter than a long sword. That thing has quite the width so it makes you feel it is bigger than it really is. With one glance I can tell that it is not an ordinary weapon, it has an emerald green almost-transparent blade. So I was mowed by that sword and sent flying huh. I thought it was a blunt weapon though… Normally one would have his head or neck cut clean. I am glad at my own defense power from the bottom of my heart. Thank you magic power, thank you eldwas.</p><br/><p>The barrier is only deployed when I am aware a battle will occur. That I lost my rings is my complete blunder. How shameful.</p><br/><p>However, to have such a big object at hand while approaching me and I didn’t notice. No way.</p><br/><p>Are you telling me there is that much difference in ability, in experience? That’s no joke.</p><br/><p>“That is a swing I provided practically all of my power. There is no way it was insufficient” (kid)</p><br/><p>“But I felt like I was hitting a giant metal lump when I attacked him. No matter if he is a letdown. There is no doubt he is a troublesome opponent” (Sofia)</p><br/><p>This is bad. Bad. It is obvious that they still intent to continue. I can’t help feeling like the lifted corners of her mouth looked aggressive.</p><br/><p>What should I do? I can’t call for help. I don’t know where I am. The hyuman army at my back is beginning their retreat for some reason. For a while now, the mamono army seemed like they were looking out for my actions or maybe the two over there, they didn’t show signs of moving. At a glance, I feel like there isn’t only a hundred or two hundred. A thousand, no, even more maybe.</p><br/><p>But in my side… well, I have magic, so I will manage somehow. If I calm down I will be able to handle it. I should be able to do it.</p><br/><p>Anyways, right now what I am clear about is that I can’t take my eyes off those two. I have to make sure not to miss a single movement of them or I will definitely regret it. I don’t have a mirror so I don’t know the degree of my head’s injury, but since there isn’t that much blood flowing out, I won’t mind it for now. And the bleeding of my hand has also calmed down a bit.</p><br/><p>I am in the verge of falling into panic. First I should understand that point clearly and make sure not to really fall into panic, try to stop it.</p><br/><p>I tell myself this.</p><br/><p>There is only one way for me to return. Create a mist gate and escape. This is certain. I don’t understand the current situation one bit after all. If possible, I don’t want the Goddess to see me when I create the mist gate. In the worst case scenario I should do so without caring, but if possible I want to take as much distance from them first.</p><br/><p>Even if my life is foremost, bringing these two to Asora is way too dangerous. Their strength is unknown, but it is certain that they are strong.</p><br/><p>What is it you want to achieve you bug?! Are you telling me to get killed by these guys?!</p><br/><p>Don’t mess with me! Don’t!</p><br/><p>Even when I know I would definitely lose to the Goddess if I tried to fight her right now, my displeasure is overflowing. As expected, I am not confident I can win against a God in my current level.</p><br/><p>Also, the fear I feel from these two. If someone told me they are the executioners send by the Goddess, I would believe it. Anyways, if earthlings are giving me a hard time, that means I am still not strong enough to fight against that bug huh.</p><br/><p>Damn bug, I will definitely hit you!</p><br/><p>Someday, definitely. Right now is the time to work for the sake of obtaining that someday.</p><br/><p>The problem is that combi of young woman and kid. For now, the only ones that are clearly showing hostility are these two. The hyumans are escaping so it is fine not to pay them attention. I don’t have the leeway to do so.</p><br/><p>…</p><br/><p>…</p><br/><p>Right now, what I am aiming to do. Eliminate those two that are being an obstruction or pull away from them, open a mist gate and return to Asora.</p><br/><p>Whether I can open the gate or not, I will confirm it after I have taken my distance first. A certain amount of time is needed to erase all the remains of a closed mist gate. Opening it takes 30 seconds and to close it takes about the same amount of time.</p><br/><p>I should be an out of norm existence in this world. That 1 minute of freedom, let’s create it.</p><br/><p>Sofia is at the demons side?! More reasons to join the demons :3</p><br/>\n</div>"}