{"title": "Chapter 87: Wishing that it will go well through all seasons", "id": 87, "volume": 1, "url": "http://boxnovel.org/tsuki-ga-michibiku-isekai-douchuu-chapter-87-wishing-that-it-will-go-well-through-all-seasons", "volume_title": "Volume 1", "body": "<h1>Chapter 87: Wishing that it will go well through all seasons</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 87: Wishing that it will go well through all seasons</p><br/><p>Even though I slept late, I woke up when the outside is still dim.</p><br/><p>It’s been 2 weeks since I began working as a teacher in the academy.</p><br/><p>In that period, I went to Gotetsu 10 times. I personally feel like I don’t want Nabe for a while… wait, that’s not it. Let’s leave aside my personal feelings.</p><br/><p>Today is the day Kuzunoha will be opening its first store.</p><br/><p>For the first store to be a branch office and not in Tsige feels weird, but I decide to just ignore that. In the midst of complicated circumstances, the time to finally open my store has come.</p><br/><p>After consulting Tomoe, I had 2 Forest Onis send here. These guys are her personal selection so I believe in them, but the two people were the ones who attacked me, Akua and Eris.</p><br/><p>The moment they got send here, I looked at their face and was thinking “change” but they were on the verge of crying and hugged me, so for now I decided not to do it.</p><br/><p>I brought them to the outskirts once to test their skills, they have gotten pretty strong. It’s a mystery why they tremble at the mention of Tomoe, Mio and, for some reason, Komoe-chan. They must have passed through tough training.</p><br/><p>I explained them about the work details, gave them advance payment and with an incredibly serious face, they swore loyalty.</p><br/><p>It seems that the days here are a lot easier than in Asora. So that they don’t slack off, I must discipline them every now and then. We are in a situation where we can’t secure sufficient employers, so I thought I laid out quite the strict conditions though…</p><br/><p>The conditions here are that they will be working for 10 hours each day with only one weekly holiday you know? It will be like living-in so even if daily necessities are guaranteed, for them to be this happy, just what kind of life were they leading in Asora? It should be mainly about correcting them, so it shouldn’t be putting that much pressure on them.</p><br/><p>They were happy that they would be eating meals before working and at noon and also that they would have free time after finishing work. They cried happily while asking me if it was really fine to eat out. It’s not like they were thrown in an isolated cell at Asora and guarded 24/7. How exaggerated.</p><br/><p>Last night at the time when Tomoe, Mio, Shiki and I were doing the closings of our discussion, it turned out that two eldwas will be send as well. These ones seem to have experience as staffs in the small store at Tsige, so I intent to frankly depend on them.</p><br/><p>The initial members will be them, me and Shiki. In the end, when I tried asking the guild about interviews and abilities, they told me that the usual is to employ and then teach them. It seems like they don’t seek for abilities beforehand. Not only that, the job offers are something rare and the cases of company’s shopkeeper employing friends and family members are high. It seems like requests for part timers are not usual in this world. With worried faces, they asked me if I wanted to have the guild provide some people, but for now I refused.</p><br/><p>And so, our numbers are totally not enough (at least for me), but for the store policy I am aiming for, these members have sufficient capability.</p><br/><p>The first forte of this store will be that it will be opening late at night, when the night entertainment people and customers are returning home. When we have gathered people, I plan on having it operate ordinarily. Luckily, in this town there are no policies regarding the time a store that sells medication or miscellaneous goods should open. It’s just that all the stores think about the balance of customer numbers and security, so they close at evening, which in this world is at 18:00. In short, as long as there is enough safety, one is able to open at night and take all the customers in that hour, probably. Also, it would be nice if the miscellaneous stores that sell medicine remember our name.</p><br/><p>It’s just that I don’t know how many customers are at night and if I should really go with this opening time, and I have to think if I should aim to be a convenience store. In this world, the people that work until late at night are not as many as I thought. I think it is a special case because it is Academy Town, but even with that.</p><br/><p>That’s why, depending on the circumstances, I am thinking about doing direct deliveries at night. In that case, I would have to think about how to receive the orders. We will have to do various test runs, but the thing about opening at night will be done as an experiment to see how it goes.</p><br/><p>Ah, that’s right. Now that I think about expectations, I remember that these are not all the members.</p><br/><p>Tomoe said something about sending a useful one along with the eldwas. That Tomoe said was useful, so I think I can expect something. She herself has gone to the battlefield I was before to investigate, so she isn’t here and can’t come. Mio seems to have a previous engagement as well and didn’t seem to be so attached to coming to Academy Town. She must be making connections with people aside from me. I am a bit happy.</p><br/><p>“It’s a surprise after all”, is what Tomoe said while smiling, so I feel slightly uneasy though…</p><br/><p>I finished changing and walk outside the room.</p><br/><p>At the indoors of a place where people are not present yet.</p><br/><p>I walk down from the second floor where my room is, to the first floor where the store is.</p><br/><p>That’s right, since 3 days ago, Shiki and I have already vacated from the inn and been living at the second floor of the store.</p><br/><p>The number of rooms at the second floor is 6. Shiki and I have a room each, the forest onis will have one room, eldwas one room and the surprise person will have one room. The storeroom is at the first floor for now, so the second floor is completely a residence area. The forest Onis and eldwas will be changing places and returning to Asora every now and then, so I am not sure if those rooms will actually be used for sleeping though.</p><br/><p>Each room is about 4 to 6 tatamis. It’s smaller than the rooms at Asora, but maybe because of Shiki’s interior design reform, the sense of the inside is pretty well done. I also participated in that, but I despaired at my lack of interior design sense in the middle of it and left it in the hands of Shiki. I noticed it when reforming the store as well, but it seems that Shiki has unexpectedly good sense in this. Even though he was a former skeleton.</p><br/><p>Pulling myself together, I check the interior of the store that was created by my instructions and Shiki’s sense. Last night, I stayed up until late at night to check the goods line up and confirming the inventory. It felt bad to leave it to someone else, so I unintentionally stayed until late in things like changing the position of the spittoon, confirming that the shelf of the special products doesn’t obstruct the path of the customers…</p><br/><p>While thinking that I was doing the same thing, I repeated it several times.</p><br/><p>And as I moved my hands with a wry smile, I noticed that a faint light was coming from outside.</p><br/><p>Finally huh.</p><br/><p>I plan on opening at evening so it is still not the time yet, but even so, seeing the sun rise reaffirms my determination.</p><br/><p>For now, I plan on using the medicines Shiki made, the energy drink I suggested, unusual southern fruits (in short, Asora), and also armor repairs by the eldwas. About the armor, I decided that instead of selling armor, we will just accept repair petitions. I received a report saying that people are placing a lot of armor petitions in Tsige and are creating quite the pressure.</p><br/><p>Cutting the fruits of Asora in small sizes so that they don’t know what it is and put them in a container to sell, is also one of the reasons for their achievements in Tsige. While the fruit in itself is ‘effective’, we have discovered that there’s a bit of a problem with the seed. That’s why we cut the unusual fruits to make them easier to eat, is what we make them believe and remove the seeds beforehand. The refrigeration installations are easily made with magic and it is so convenient it makes me believe it surpasses science.</p><br/><p>Regarding the medicines, we will be selling the wound medication Shiki advertised, generic poison antidotes, fever, pain-killer and cold medicine that works for various purposes, and also a strengthening medication that increases your abilities temporarily. Each one of them has been adjusted and limited into common sense level (probably), so I can have peace of mind.</p><br/><p>Thinking about it calmly, I consider that this store, instead of having a lot of customers flowing in the first day, it is more the type that slowly gathers popularity and waits to gain regulars. Today it is fine if we attract people who are interested in the energy drink and the fruits, since it will serve as a seed for the future. If we disperse too many of them, it might create trouble, so I have already decided on the limit we will be selling in a day. It would be nice if it goes well. I can’t help but feel uneasy.</p><br/><p>Today I don’t have lectures, so I can stay in the store when it opens. At night I should go to Asora and tell Tomoe and Mio about how the first day went.</p><br/><p>I walk outside and look at the sign that’s at the top of the entrance which has written “Kuzunoha”. Writing that only we can read. It may become a minus point, but I unconsciously did it. I don’t regret it. I did add the translation at the top anyways.</p><br/><p>I decided on the material of the sign just because I liked the smell of it, but it gives that Japanese feeling and it’s pretty nice. The eldwas also praised the material quality. The Hinoki cypress might be quite the tree.</p><br/><p>Looking at the sign that has the name of the store, I resolve myself and returned inside the store.</p><br/><p>◇◆◇◆◇◆◇◆</p><br/><p>The time is morning 10:00 o’clock. While I have the two forest oni girls and Shiki clean the store’s interior, I receive a call from Beren-san which I haven’t received for a long time.</p><br/><p>It was to notify me that the two eldwas are ready to be sent. I do as he says and open a gate in the second floor and receive the two eldwas that came.</p><br/><p>The person that came from behind them.</p><br/><p>It was a person I feel I have seen before. Is he the helper?</p><br/><p>But for him to be hyuman, what a surprise.</p><br/><p>However, have I met him somewhere?</p><br/><p>“Long time no see, boss”</p><br/><p>He seems to know me. That means this sensation of not being able to remember is actually real. But, I don’t remember having a hyuman call me boss.</p><br/><p>A bad feeling subtly rises in my mouth. Is that a hint? My body seems to remember.</p><br/><p>Anyways, a hyuman huh. In that case, I have to use written communication. What a pain.</p><br/><p>“B-Boss? I was instructed to help boss here by sis Tomoe though”</p><br/><p>Sis Tomoe? More and more I can’t tell who he is.</p><br/><p>Short cut silver hair, high stature and slender arms and legs. Because of that, he gives the impression of thin, but his whole body has proper muscles. His chin is pointed and his eyes are slanted, one can feel a wildness in them. The light that resides in his eyes that transmits composure and gives a cool feeling… cool?</p><br/><p>Uhm. For some reason, I feel like I drank something disgusting… Ah, I think I am remembering.</p><br/><p>[Could you be, a person I met in Tsige?]</p><br/><p>It’s vague, but I ask him with that kind of feeling.</p><br/><p>“S-So horrible! Could it be, you forgot about me?!”</p><br/><p>[Sorry, there’s been so much lately]</p><br/><p>“It’s me, Lyme! Lyme Latte, Boss! The adventurer Boss let go before”</p><br/><p>Oh!</p><br/><p>Now that he mentions, there was a disgusting name like that! Right right, Lyme Latte. It didn’t feel tasty. Ah~, so it’s him.</p><br/><p>“… It seems you have remembered” (Lyme)</p><br/><p>[Yeah, I let Tomoe handle this, but why is it that you were sent here?]</p><br/><p>That’s right. If I remember correctly, Lyme Latte had his loved dagger broken by Tomoe and on top of that, Mio robbed him, so I had the eldwas create a decent sword and had Tomoe give it to him through the guild.</p><br/><p>I thought that was all our connection was about though? Did Tomoe do something?</p><br/><p>“After that, I received the sword from Sis Tomoe. It was in a class I have never seen before. I felt like my hips were gonna lose out” (Lyme)</p><br/><p>Eh? I told Tomoe to leave it in the hands of the guild and told the eldwas to not make an absurd weapon though?</p><br/><p>“Since then, Sis has been keeping an eye on me and in times she even let me accompany her in requests” (Lyme)</p><br/><p>I haven’t heard of this… Tomoe.</p><br/><p>“She even said something pleasant like “I have capability”” (Lyme)</p><br/><p>Lyme scratches his nose happily with his index finger.</p><br/><p>“Of course, I still don’t have the skills to use such a great weapon. Even so, I still want to help out Sis and Boss who have expectations of me. I may be undeserving of this, but I have come here to help by the orders of Sis Tomoe!” (Lyme)</p><br/><p>… Tomoe, what in the world did you teach him in this few months?</p><br/><p>Lyme looks at the katana that is half-drawn and has the length of a short sword, with determined eyes. S-She gave him a katana. That, instead of a dagger…</p><br/><p>The vermillion scabbard shines vividly and draws one’s eyes. Because he is holding the scabbard, I can see the hilt perfectly. Around the hilt I can see diamond shaped drawings lined up and in the guard there’s some sort of flower pattern carved. That guard is the same as Tomoe’s one. I have seen it before.</p><br/><p>Instead of calling it a coincidence, I think it is more of a move that Tomoe used in order to win him over. How to say it, for a dragon, she is able to read the hearts of hyumans.</p><br/><p>“At times I report her the sketchy occurrences in Tsige and at times I receive training. Every day is so fun I can’t help but be elated!” (Lyme)</p><br/><p>[I see]</p><br/><p>I can clearly tell that the person himself doesn’t regret it at all. Then, isn’t it fine?</p><br/><p>“Yes! And so, Sis requested me to help Kuzunoha Company and here I am. Go ahead, you can even use me in frauds if you want, Boss!” (Lyme)</p><br/><p>Lyme says in one breath and falls onto one knee, lowering his head deeply.</p><br/><p>Tomoe, could it be you… were using him as a spy in Tsige? What a scary person. I’m glad she is an ally.</p><br/><p>I still can’t bring myself to trust him completely, but at least he is a person Tomoe can judge safe to bring to Asora. Let’s rely on him.</p><br/><p>But this guy, he is the person with the highest level in Tsige, right? Is it okay to take him away?</p><br/><p>By the way, in Academy Town there is a main office of the Adventurer Guild, but there is no section where one can accept requests. That’s why, it is hard for adventurers to gain money here. Obviously, the number of adventurers is low.</p><br/><p>[I am happy that you say I can use you and I will be relying on you, but you are the number one adventurer in Tsige right? Is it okay to be here?]</p><br/><p>“No need to worry. I am already not the number one after all. Right now, the party of Toa is at the top. Also, please refer to me as Lyme with no honorifics” (Lyme)</p><br/><p>[I see, right now Toa-san and the others are top huh]</p><br/><p>The girl and the others that were sticking like suckerfish onto Tomoe have grown in a way huh. The day they once again step into the inside of the wasteland might be close.</p><br/><p>“Yeah, they probably have an objective now. They are frantically aiming for higher heights. I think that’s one would call growing” (Lyme)</p><br/><p>[It would be great if that’s the case. As a senpai of the adventurers, I feel like I can believe you]</p><br/><p>“… I am no longer a senpai though” (Lyme)</p><br/><p>[What do you mean?]</p><br/><p>“Yes. The moment I decided to give my life to Sis Tomoe, I reported my retirement at the guild” (Lyme)</p><br/><p>[Retire?]</p><br/><p>I tried to continue writing calmly, but inside me, I was quite altered. Retired he says. As in quitting as an adventurer?!</p><br/><p>“I want to see what Sis and Boss are aiming for. Surprisingly, I am not regretting it at all” (Lyme)</p><br/><p>H-He hasn’t been brainwashed right?</p><br/><p>What can Tomoe be aiming for aside from Edo? Or more like, regarding me, I am trying to look for the tracks of my parents, hit the Goddess once and do business. Those are the only objective-like things I have you know?</p><br/><p>What did she indoctrinate Lyme with? I’m beginning to get scared.</p><br/><p>[If you have no regrets, then I won’t say anything more. In this place the only work I have for you is store tending, is that okay?]</p><br/><p>I think it is an incredibly wasteful way though. He is a person that would even be useful if I bring him to the Academy after all.</p><br/><p>“I don’t mind. Sis also asked me to keep an eye on the town’s rumors and trends though…” (Lyme)</p><br/><p>What should I do? Is what Lyme’s eyes are asking me.</p><br/><p>She also intends to use him as a spy here huh. I see, it certainly wouldn’t be bad to have him gather information. Inside the Academy I can ask Shiki, but if it’s the whole town, he might be better suited. He looks like he is accustomed already and there’s also the fact that it is a difficult task for the forest onis and eldwas, who are demi-humans.</p><br/><p>Right, let’s try leaving it to Akua, Eris and Lyme; I will study. Lyme also temporarily gathered and acted as the head of the adventurers in Tsige. Then, he should have skills in dealing with people.</p><br/><p>[Understood. I will leave that to you as well. Just, when there’s a need for money, don’t hesitate to tell me. Before stepping into dangerous information, make sure to report to me first and we will decide. Those type of things are not of my taste]</p><br/><p>“Roger. Then, without delay, let’s see the goods while I help cleaning” (Lyme)</p><br/><p>It was unexpected, but I have obtained one hyuman. Moreover, he played quite the active role.</p><br/><p>After obtaining Lyme Latte, Kuzunoha Company’s opening day was able to finish safely. Thanks to him skillfully moving around, the distinguished people of the merchant guild and the influential people of the land, even when they suddenly appeared; Shiki, Lyme and I were able to somehow manage. It’s the first day of opening, so there will obviously be people coming to greet us. I was totally oblivious. That was a close one.</p><br/><p>Regarding the results of our first day, the requests for armor repairing were zero. Even if we take into account the student level armor that they are provided, it is still armor that they entrust their life to, so trust is important. We can’t help the results in this. The fruit cuts that I prepared were gone by early afternoon and the extra ones lined up at evening were instantly sold out. About the medicines, each were sold slowly and at evening the students that Shiki advertised in the lecture came and the medicines’ sells increased in an instant. Maybe I should have restricted the number each person can buy.</p><br/><p>Probably because they weren’t familiar with it, the cold medicine didn’t sell that much. Well, when real sick persons appear and the effects begin to show, the situation should change. I wonder how the composite cold medicine works in this world. When Shiki heard the concept from me, he said something about being ground-breaking and went to develop in high spirits, so it is probably the type that he didn’t put that much mind into. He felt down when it showed the lowest effect rank. If I have to translate what he said, it would be that it is an all-powerful medicine against light illnesses, or something like that? All-powerful is quite the exaggerated word, so I am not really sure.</p><br/><p>The one that unexpectedly did well was the energy drink. The people that bought medicines, most of them bought a number of energy drinks. Regarding the strengthening medications, there wasn’t a single sell. Thinking about its effect, it is more an item for adventurers, so it might be better to sell this one at Tsige. The armor manufacturing is temporarily stopped, so I was thinking of lining up a new product. Also, I feel like when exams come in the Academy, it might even get restriction order.</p><br/><p>Anyways.</p><br/><p>Kuzunoha Company has only begun moving.</p><br/><p>Business rivals will appear, doubts with the merchandize we handle, and we might even receive pressure from the people.</p><br/><p>From now on will be the true company management. I don’t know how far a teenager with an inhuman face like me can go, but I will do my best.</p><br/>\n</div>"}