{"title": "Chapter 89: Gossip – Mio, Cooking and Hero (1)", "id": 89, "volume": 1, "url": "http://boxnovel.org/tsuki-ga-michibiku-isekai-douchuu-chapter-89-gossip-%E2%80%93-mio-cooking-and-hero-1", "volume_title": "Volume 1", "body": "<h1>Chapter 89: Gossip – Mio, Cooking and Hero (1)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 89: Gossip – Mio, Cooking and Hero (1)</p><br/><p>Reigokai: Hey guys!</p><br/><p>First of all, I have to do something important that I should have done a long time ago.</p><br/><p>Everyone that donated, thank you very much!</p><br/><p>Since no one commented for a nickname, I just didn’t know how to express my thanks and it has been piling up inside me. So here I thank everyone who has supported. Thank you very much.</p><br/><p>Also, here comes my favorite char, Mio!</p><br/><p>Author note said: “There have been voices of people wanting Mio, so here it is. The chapter of Tomoe was wrapped up in one chapter but this one has parts, so there’s slight favoritism here”</p><br/><p>Enjoy! ^^</p><br/><p>“Ehm, seaweed with thickness and hard dried fish… was it?”</p><br/><p>A woman that doesn’t fit the port town’s market walks.</p><br/><p>The bustling sells of various articles that are unfolding on both sides of the street, and the calls of the shopkeepers that shout with a loud voice.</p><br/><p>That the places where there are no stands are the street, makes it a complicated labyrinth with irregular shaped pathways.</p><br/><p>The people seen when walking down the road were normally naked on the upper half or wearing a thin shirt. The number of muscular men was high.</p><br/><p>She was clearly not familiar in this place, a girl wearing clothes deep indigo blue that were close to black was obviously an existence that was out of place here.</p><br/><p>The clothes called kimono is probably an attire that no one in this port town has seen before.</p><br/><p>And also, her hair that may or may not reach her shoulders, glossy black hair that has been beautifully trimmed. Her long slit and black eyes, and her vibrant deep red lips. The beauty that emitted conspicuous colors was clear in everyone’s eyes.</p><br/><p>Her attire and appearance, with those two combined, make the people walking by turn and look twice. That person is one of Kuzunoha Companies strongest jewels, Mio.</p><br/><p>Her representative Makoto is currently in Academy Town and finished opening a store there. Tomoe who has been acting alongside her, has received a task by Makoto and is in a faraway place, so right now Mio is alone.</p><br/><p>But she is not free.</p><br/><p>For the sake of pioneering the port town as Makoto told her, she advanced through the north road of Tsige and arrived at this town that is located at the sea.</p><br/><p>It isn’t that big of a town. Compared to Tsige, the size of this one is clearly smaller.</p><br/><p>The other remote regions have a land route for goods distribution called the gold highway, but the growth of this town is slightly restraint.</p><br/><p>To walk with hyuman legs and take just a few days, one would be able to raise several questions.</p><br/><p>Whatever the case, this location is port town Koran that is blessed to a certain extent, doesn’t have a direct connection to the world’s border special procurement route and even when they have the potential to receive merchant ships of the highest class, they still haven’t reached that scale. A deplorable town.</p><br/><p>Even so, there’s obviously no need to compare this to Tsige in marine products. There were many ingredients Mio had seen for the first time and were unfolded in the market.</p><br/><p>However, it seems that the thing she is looking for or something close to it, she still couldn’t find it. Mio stops her feet and sighs.</p><br/><p>“I can’t find anything close to kelp and skipjack tuna”</p><br/><p>What Mio is looking for are ingredients that are pretty common in Makoto’s world.</p><br/><p>It’s just that, this isn’t something that Makoto asked for.</p><br/><p>After Mio separated from Makoto, she has been enjoying the food and she has mostly visited the famous restaurants and bars in Tsige. Makoto has accompanied her in eating while walking and has been accepting the food he recommended, but even if it’s wide, there’s still a limit. There are a few where she hasn’t visited, but it’s clear that she will hit the bottom soon. For Mio who loves Makoto and delicious food, this was a worrying situation.</p><br/><p>Then a chance came.</p><br/><p>Tomoe nonchalantly said this.</p><br/><p>“In that case, isn’t it fine for Mio to just make the food Waka likes?”</p><br/><p>For Mio, these words were literally a divine revelation.</p><br/><p>To make food… HERSELF.</p><br/><p>Wk4-Nichijou7</p><br/><p>For the girl who just ate the food that was brought to her, the impact of those words made her body stagger. And then she looked at Tomoe with a serious face, as if looking at a genius.</p><br/><p>That’s exactly it.</p><br/><p>If she makes it herself, she can create what she considers the ideal taste. Even the taste that Makoto wishes for, she might be able to make it as well, is what she thought.</p><br/><p>To begin, she tried to recreate the food she has eaten until now. But she was left astonished.</p><br/><p>She didn’t know the process of cooking at all.</p><br/><p>Cut, bake, boil, fry; that level she can manage, but the further steps she just can’t.</p><br/><p>There are people in Asora who can cook, and she was mostly taught by the orcs in cooking which increased her skills.</p><br/><p>Even so, she wasn’t able to reach the level of the food she ate in Tsige. Mio, lowering the number of requests she took in the Adventurer Guild, revisited the restaurants and bars and lowered her head to the cooks there.</p><br/><p>She challenged a number of times and failed. And Mio who had begun understanding the basic parts of cooking, had felt some sort of respect for the people that she couldn’t replicate the food from. That’s why, for Mio who wants to be taught the recipe and technique, it was natural to lower her head. On the other hand, the shopkeepers and cooks who saw this, couldn’t bear it.</p><br/><p>In Tsige, the adventurers and the people related, there is not a single one who doesn’t know the existence of Mio. And that person herself is suddenly lowering her head and asking to teach her cooking.</p><br/><p>The cooks showed such respect that one wouldn’t be able to tell who was the one asking for a favor, and practically in an instant they accepted her request. Just, there’s also the deal about competing stores and secret recipes, so there were parts they couldn’t teach her; is what they supplicated Mio with visible sweat. Of course, Mio nods at their words. She told them that it was okay to just teach about some particular foods, and she is not intending to be a hindrance in their business so it was fine to not tell her the secret recipes and techniques.</p><br/><p>And so, relinquishing sleep time, Mio went to the cooks’ kitchen to get taught and there were cases when she matched times with them and accompanied them. After 1 month, Mio was able to recreate the food, not to a perfect level, but she was able to understand the basic essentials of the food in Tsige and mimic them.</p><br/><p>The complex parts like the hand skills and sauce, she still doesn’t reach their level, but it’s an acquisition rate that would surprise anyone.</p><br/><p>This may digress, but Mio who normally treats adventurers coldly, was using formal language with cooks. And because of that, in the restaurants, bars, and inn’s which are close to that connotation; her behavior with the adventurers became docile.</p><br/><p>And so, now. The objective of Mio in this port town was exactly, the recreation of Japanese food.</p><br/><p>The food of her Master Makoto’s world. Before heading to the Academy, Makoto explained her about the world he had come from. And Mio, seeing that it would be impossible to meet that scenery and food, was truly sad. By the way, she really didn’t have any particular impression about Makoto’s blood-line. Shiki was incredibly excited and made quite the ruckus, so he received the iron fist of Tomoe, but Mio honestly didn’t mind what country Makoto was from, no, no matter what world he was from, it wouldn’t change. He is just her only master and an irreplaceable existence. That’s why, no matter what’s in his past, she wouldn’t mind. Instead of such boring stuff, her interest in the Japanese food Makoto was eating was more important.</p><br/><p>The Japanese food’s foundation was different from Tsige’s food. Instead of using meat, it gave the impression that they used more marine products and she thought that the port town would serve as some sort of clue, but…</p><br/><p>“No good. To begin with, there’s not much dried stuff. From the Japanese food I saw in those memories, the only thing I can recreate is the sunny-side fried eggs. I had Tomoe cooperate with me and research for ways to cook, but it seems that the kelp and skipjack tuna are indispensable. The rice and miso are being recreated by Tomoe so, leaving that to her, I should gather various ingredients and learn different ways of cooking, and yet…”</p><br/><p>Mio who had resolved herself to someday provide Makoto with Japanese food in Asora, had quite the expectations from the port town, Koran.</p><br/><p>However, the truth was that she couldn’t find the ingredients and the important dried fish was absolutely scarce. It was to the point that it made her question if this town didn’t actually delve in that kind of manufacturing.</p><br/><p>“Dried fish? Things dried in the sun? Hmph, around this area there’s no one who would go all the way to dry in order to eat fish and if they plan on carrying it to a faraway place, they normally freeze it”</p><br/><p>“In here the most important thing is freshness after all. To go through the trouble of drying it. Well, there might be houses where they dry them for one night but…”</p><br/><p>“They are low in numbers but, in places like souvenir and wholesale stores there might be some”</p><br/><p>She went around and asked, but the answers that she received were all unreliable. Even so, there was a bit of information regarding dried fish. The problem is the kelp. Even when telling them their characteristics, they all made faces like they haven’t heard of it before, making Mio dejected.</p><br/><p>After doing a round around the market, Mio decided to go check the beach.</p><br/><p>Because she was taught that the place where fishes are dried is in the sandy beach, she thought that maybe she could get some information from the people that actually practice this. She felt like she was clinging to straws.</p><br/><p>“Is it that. It makes a peculiar smell. Like raw, or more like… a bad smell I have felt in the city but at the same time different. Fuh~, even though there should be marine plants drifting all around in the beach. Why is it that I can’t find any?”</p><br/><p>While viewing the work at a distance, Mio despairs at the fact that there is only fish there. Glancing at one part of the beach, there was a black lump there and Mio noticed that it was washed up seaweed.</p><br/><p>In a place with pebbles spread all over and wood put together, a base was made located at an area where the sunlight hits easily. Fishes were placed there. The small ones are left as is and all the others were cut opened.</p><br/><p>“Now that I think about it, the smell of fish stinks more than beast meat. I feel like even boiling beast bone for a long time to make Dashi , there are also no fitting ingredients for it either. Tomoe-san told me that: “That’s where the kelp comes in-nan ja”, and said there was a special method. I thought that the basic process behind making soup with beast bone and fish bone as well as the ingredients were practically the same, but maybe that’s not the case…”</p><br/><p>In the end, she wasn’t able to get any new information from the workers. However, she was holding doubts about her own thoughts and gets closer to the black lump located at the beach.</p><br/><p>One of the workers said: “That’s trash of the sea”, but Mio didn’t mind.</p><br/><p>“There are some that are warm to the touch and ones that are thin. There’s quite a lot of types. When I look closely at their color, there’s green and blue, and there’s even red. The taste is… ara. Crispy and tasty. Saying its trash, what a waste. This one here is… well, the slight stickiness is worrying, but it is eatable. The lukewarm one has some white powder stuck on it-desu wa ne. Heh~, this one has a strong taste. The aroma is like that of the beach, a nice scent. The white powder is not poison either. From what I have gotten, the parts that are dry get hard but their taste gets stronger. Isn’t this quite enough to qualify as ingredients-desu ka? Geez, they really have no insight”</p><br/><p>In order to have Tomoe inspect it, Mio looks for ones whose current state is good. The people that were drying fish gathered at a distance and looked at her eccentricities with a disgusted face. But in the middle, someone suddenly faced where Mio was, lifted both of its hands and began screaming.</p><br/><p>But Mio who was concentrated in selecting seaweed, didn’t notice that.</p><br/><p>Several people look at the source, but Mio concentrated in her mouth. After they made noise is when Mio finally noticed. But it was already too slow.</p><br/><p>“That is… what’s going on? Ah, maybe you were curious after seeing me eat seaweed? Eh?!” (Mio)</p><br/><p>An impact suddenly came from the back.</p><br/><p>If it was a normal person, it would have certainly been a fatal attack. That’s how strong the attack Mio received was.</p><br/><p>Mio who had stood up from her squatting position with both hands filled with her harvest, had completely let her guard down. If she had spread out a “network” and expanded her perception area it would have been a different story, but Mio isn’t that skilled in the perception of her surroundings. Without any proper preparations, she received the attack and was blown away.</p><br/><p>Mio was in the inner part of the beach at a place a bit faraway, attacked from behind while she was testing the seaweed.</p><br/><p>A loud sound of water mixed with the noise of waves was raised.</p><br/><p>That’s right, Mio was completely thrown into the sea water.</p><br/><p>The ingredients that she had carefully selected and were in her hands, were released because of the surprise attack. And were washed by the waves and disappeared into the open sea.</p><br/><p>“…”</p><br/><p>Mio stood up silently.</p><br/><p>At her shoulder, there was a ferocious silver beast hanging onto her, biting her hard. With its hind legs it kicked Mio’s body several times and from its moving jaw, one can see that the beast is still continuing to put in power. And yet, Mio didn’t show any reaction.</p><br/><p>From the sandy part of the beach, there was a shadow running to where Mio is, and it was reflected in her field of vision.</p><br/><p>“… I have been drenched” (Mio)</p><br/><p>A cold penetrating voice rang out.</p><br/><p>The big wolf that would reach the ground if it stretched its legs, stopped its kicks. That’s the identity of the beast that attacked Mio.</p><br/><p>But that big and ferocious beast was scared by Mio’s words and weakness became present in its eyes.</p><br/><p>From its throat, an unreliable groan resounded.</p><br/><p>“…”</p><br/><p>Using her right hand, Mio casually grabs the silver wolf that was biting her left shoulder by the neck.</p><br/><p>It was a show of strength that none would expect from a woman, but just like that she pulled the wolf that was at her shoulder and smashed it into the sea.</p><br/><p>Mio’s shoulders didn’t have a single wound. It just left a small mark on the kimono she was wearing. The cloth resisted the attack of a wolf that was obviously not a normal beast. It was clear that it was not a simple kimono.</p><br/><p>On the other hand, the wolf, just by being smashed into the ground, was so weak it couldn’t even stand up properly. It was pushing its body up with its front legs, but its hind legs didn’t do the same. It could only look at Mio while moaning weakly.</p><br/><p>“Die, you bitch” (Mio)</p><br/><p>Mio takes out the folding fan from her bosom and swings it closed.</p><br/><p>Looking at the wolf with cold eyes that showed no mercy, she swings it in a breath.</p><br/><p>It was literally a paper-thin difference.</p><br/><p>The dark shadow enters into the space between Mio’s attack and the wolf, and runs past while holding the wolf.</p><br/><p>It must have been quite the desperate sprint. Without taking its distance from Mio, the shadow’s posture crumbles.</p><br/><p>“…”</p><br/><p>Mio, with her dangerous chill still around her, stops her movements and looks at the intruder that was standing on its knees.</p><br/><p>*Zuu Zuu</p><br/><p>An unusual sound reverberates in the place. The intruder thinking what was that sound, concentrates on the source of the sound.</p><br/><p>At the sea that preceded Mio’s folding fan swing…</p><br/><p>Without caring about that disturbance, the sea that was carrying the wave… suddenly split up.</p><br/><p>The sea had divided in a range of several tens of meters from where Mio is and the bottom of the ocean was exposed.</p><br/><p>It was only a phenomenon that lasted for a few seconds, but the intruder gulped its breath and stared at that spectacle.</p><br/><p>“The owner? Then accompany it” (Mio)</p><br/><p>Mio swings her folding fang without hearing the answer of the intruder who had lost its words because of the previous phenomenon.</p><br/><p>“I’m sorry!!”</p><br/><p>The arm that was swung trembles, and stops. Because it lowered its head with all it had, when she thought it would stand up.</p><br/><p>“…”</p><br/><p>Maybe it piqued her interest. The hand of Mio stops and she waits for the next words of the intruder.</p><br/><p>“When I went to check the beach, this little one suddenly attacked you and… It’s my fault. I understand that you are angered, but please, forgive us. The treatment of your injury and the mending of that kimono; I will definitely do it so!”</p><br/><p>Mio slowly lowers her folding fan, and puts it back into her bosom. She forgave it, or more like, it was because this one has piqued her interest.</p><br/><p>In this place where people don’t know the name of kimono, the black haired girl here had said it as if it were natural. The girl in question stares at the folding fan that was lowered, and looked like all her strength left her.</p><br/><p>“… I am not injured so there’s no need for treatment. Also, mend my kimono? It’s is unfortunate, but this isn’t something you can fix” (Mio)</p><br/><p>It looked like she was a bit down because of the traces of fang in her kimono, but it wasn’t torn. Actually, the only damage-like damage was the washed away seaweed and that she was drenched.</p><br/><p>“I-I am sorry”</p><br/><p>“Let’s see, if you help me out and treat me to dinner, I can leave it as if it never happened” (Mio)</p><br/><p>“If there’s anything I can do! Regarding the dinner, please let me treat you! Thank you very much! Uhm…”</p><br/><p>“Mio-desu. And you lady?” (Mio)</p><br/><p>“Hibiki. Mio-san, I am truly sorry. This child is also reflecting so…” (Hibiki)</p><br/><p>At the place where she points out, there was the wolf curling its tail, but it was still sending a hostile gaze at Mio. It didn’t look like it was reflecting at all.</p><br/><p>“Reflecting?” (Mio)</p><br/><p>“Sorry! Horn, return!” (Hibiki)</p><br/><p>The silver wolf is enveloped by light and disappears into the sash of Hibiki. Seeing that, Mio slightly narrows her eyes.</p><br/><p>“That wolf is a spirit who lives in a tool?” (Mio)</p><br/><p>“I don’t know in detail, but it’s something like a guardian beast” (Hibiki)</p><br/><p>“… I see. Then Hibiki, could you please help me sort out the seaweed that is in good state?” (Mio)</p><br/><p>“Seaweed? Uhm… is it for wakame or kelp? Mio-san is a cook?” (Hibiki)</p><br/><p>Mio’s eyes widen at the nonchalant words of Hibiki. For Hibiki, her real reason to ask about her being a cook is because she actually wanted to continue by asking Mio what in the world is she. Of course, she doesn’t really think that Mio who easily split up the sea, to be a cook.</p><br/><p>“?! That! Is there kelp among these?!” (Mio)</p><br/><p>“Eh?! Ah, uhm, it’s probably the big one over there” (Hibiki)</p><br/><p>“This one?! Or maybe this one?!” (Mio)</p><br/><p>Just where in the world did her previous intensity go. She was now holding the said seaweeds in each hand and looking at Hibiki with eyes that radiated a different kind of intensity.</p><br/><p>“T-The one Mio-san is holding at your right is probably… kelp I think….” (Hibiki)</p><br/><p>“To think that not only was it not being sold, but dropped?!” (Mio)</p><br/><p>Throwing away the one at her left, Mio holds the kelp (probably) at her right with both hands and looks at it seriously.</p><br/><p>(Eh? Is she really a cook or something like that? I have heard that the wasteland before the town called Tsige was a place where common sense didn’t work but… is it that common sense won’t work beginning from the outside part? She was uninjured after being attacked by Horn and was able to easily split the sea with a folding fan. For someone like that to be a cook…) (Hibiki)</p><br/><p>Hibiki looks seriously at that Mio.</p><br/><p>“Uhm, Mio-san. The one you threw is probably something called wakame and it is used in miso… I mean, as an ingredient which I think will go along well in soup” (Hibiki)</p><br/><p>Just from the looks she wasn’t sure, but Hibiki follows her explanation on the other one that was cruelly thrown away onto the beach. Immediately after that, Mio once again holds the wakame and washes it with sea water.</p><br/><p>“Wakame! That’s right, this was wakame! Ah, Hibiki-san! I thank Waka-sama for this encounter!” (Mio)</p><br/><p>“Uwa!! Mio-san, just what is Waka-sama? Or more like, I’m sorry, it hurts, it stinks. Please let me go~~!!” (Hibiki)</p><br/><p>In her left hand wakame, in her right kelp; holding both of them, Mio embraces Hibiki with quite the vigor and strength, without reserve.</p><br/><p>Mio didn’t notice at all, but this is how the Limia hero Otonashi Hibiki and Mio met.</p><br/>\n</div>"}