{"title": "Chapter 85: First Class", "id": 85, "volume": 1, "url": "http://boxnovel.org/tsuki-ga-michibiku-isekai-douchuu-chapter-85-first-class", "volume_title": "Volume 1", "body": "<h1>Chapter 85: First Class</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 85: First Class</p><br/><p>Sorry guys, an announcement.</p><br/><p>I will be leaving for a trip that will be taking 2 weeks. Sadly to say, I won’t be able to translate in those busy days. I apologize. Mainly because there is a big ass cliffhanger.</p><br/><p>“Did you hear? Seems the new practical skill teacher can’t speak”</p><br/><p>“What with that? Then how is he going to do his lectures? Don’t tell me he will be teaching his students through their body”</p><br/><p>“It seems he uses written communication. I don’t care as long as I get stronger. That’s why I don’t like incompetent ones”</p><br/><p>“It’s Brait-sensei’s instructions, so I will at least attend once but… it seems he is a demi-human you know?”</p><br/><p>“Demi-human?! Why did the academy accept such a thing as a teacher?”</p><br/><p>“… Who cares if he is a demi-human. We see elves quite a lot, so it isn’t good to have prejudice”</p><br/><p>“Rotsgard specialty. I hope it doesn’t become an empty class”</p><br/><p>“If it isn’t good, it will soon become that way. There are a hell lot of choice classes after all”</p><br/><p>“Yeah. I at least hope he is a cool person”</p><br/><p>“Ahahaha…”</p><br/><p>…</p><br/><p>Seriously?</p><br/><p>How to say this… are they serious?</p><br/><p>These are the students I will be teaching for my first class.</p><br/><p>Pressured by my uneasiness, I use Sakai to feel the presence of the people heading here and instinctively strain my ears, which I regret doing now.</p><br/><p>Their impression of me is bad even before we meet?!</p><br/><p>Shiki and I finally arrived at the field and were waiting while sitting on a bench there.</p><br/><p>This is obvious but, what I am going to do is a practical skill class, so there won’t be that many times where I will be indoors. If we are doing muscle training, indoors is also a choice, but… it will become a plain class, so it will be okay to do so when the students decide to follow me.</p><br/><p>The people in the staff room gave me a few textbooks and a number of booklets related to teachers for reference. When I finished reading it today, I understood a little about what’s special about this academy and about magic.</p><br/><p>Being able to finally touch on the topic I have come to Academy Town for, today, I finally feel like I have moved a step forward.</p><br/><p>First, it’s about what makes the Academy special.</p><br/><p>In this Rotsgard Academy, there are obligatory classes one has to attend, and the rest it is free for one to decide if one wants to take it. It’s a system that lets a certain amount of freedom.</p><br/><p>Leaving aside the fixed classes and the subjects that are necessary for your related technical skill, the position of the people teaching the optional classes is weak. It would be one thing if you were not able to change them for half a year or all year around once you choose it, but since one can change it anytime they want, the position of the students is a lot higher.</p><br/><p>Avoiding the hours of popular classes and holding a course in a different lot of time, making tests easier and I heard there are even teachers who buy students in order to get attendance. That there aren’t many teachers thinking of improving the contents of their own class to get students, makes me feels like it is already too late.</p><br/><p>In short, one’s position can be that of a part-time teacher, but the possibility of being looked down by your students is abnormally high. On top of that, I just learned that I already have a bad impression.</p><br/><p>Magic. I have to put this in my mind, but the common knowledge I have earned until now, I feel like it is better to not put it out.</p><br/><p>The arias are memorized and magic is something that one has to activate by chanting the aria in a sonorous voice, is what seems to be the standard.</p><br/><p>To do an aria without letting your voice out is called voiceless aria and it seems it will reduce the original power of the magic.</p><br/><p>… From the very start I have been doing things that deviate from the standard, and I just learned this after coming here.</p><br/><p>Well, if I want to have originality in my class, I thought that it would be fine to just teach the students things around this particular area. Saying random things like “In real combat…”</p><br/><p>“Raidou-sama, looks like they will be coming soon” (Shiki)</p><br/><p>“Yeah, I know. Shiki, it is okay for the class objective to be as we discussed right?” (Makoto)</p><br/><p>“I think there won’t be any problems. Show your true strength and teach combat aria to the students that remain. There may be low amounts of students who use physical combat that remain, but in that case, I will be teaching them anti-magician battle techniques. It’s a course the other teachers don’t have, so I think we should be able to choose students” (Shiki)</p><br/><p>“Teaching knowledge and power to strange individuals will not bring anything good, so it will be more comforting to teach a chosen minority of elites” (Makoto)</p><br/><p>“Yes. However, for Raidou-sama to be the one getting angry and me being the kind one, aren’t the roles reversed? In the first place, I don’t think there is a need to divide the roles” (Shiki)</p><br/><p>“… Well, it seems that in optional classes 2 persons is unusual, so there is a part of me that wants to try if this will really work out. I feel like me playing the bad guy will have better results. If it turns into something weird, I will stop, so accompany me for a bit in this” (Makoto)</p><br/><p>“Okay…” (Shiki)</p><br/><p>Shiki seems like he is still not convinced. But this is something I have wanted to try once if I had the chance. Like the ones in detective dramas. A combi of one being the angry and the other the soothing one, they manipulate the impression of the person.</p><br/><p>In this case I will be the scary one and since us two will be doing the lectures, I think people will gather if one of us holds a favorable impression.</p><br/><p>… If I am already not being treated as a human being, then let’s just have them hate me… is not how I deal with my despair okay?</p><br/><p>I am not thinking about being an ass and then be a bit gentle to see if I can increase affection points, okay?</p><br/><p>I feel the gazes of a number of people.</p><br/><p>Fuh~ so they have come.</p><br/><p>“Uhm~, is this Raidou-sensei’s practical skill class?”</p><br/><p>The female student who called me demi-human not too long ago, knits her eyebrows but still uses formal language to talk to us.</p><br/><p>I nod lightly, not at the girl, but at Shiki. Now then, let’s try doing the scary teacher.</p><br/><p>“Yeah, that’s right. Everyone here are students that came because of Brait-sensei’s referral right? I am this lecture’s assistant, my name is Shiki. And this person here is…” (Shiki)</p><br/><p>[Shiki’s master and was a merchant at the border of the world, Raidou. Because of circumstances I can’t speak, but in this way I am able to communicate. This will be a harsh class that will be centered on magic, but I hope you guys follow me]</p><br/><p>My personal history is a lie and I tried making my attitude like that of a slightly strict instructor. When my appearance is a minus, instead of smiling friendlily, I feel like it is better to be someone who is kind every now and then to create a gap.</p><br/><p>I actually wanted to go with a shouting type, but since that would be hard with written communication, I decided to go with being strict.</p><br/><p>“We are planning on opening a slightly unusual store, so if you have the chance, please check it out” (Shiki)</p><br/><p>Shiki advertises.</p><br/><p>If we don’t say the store’s name, they shouldn’t nag much about it. And I had Shiki smile gently from beginning to end. Try your best in being the kind and gentle Shiki-sensei. I will also try my best in being the scary Raidou-sensei.</p><br/><p>[Since it’s the first class, let’s begin with a self-introduction]</p><br/><p>I have the 10 people that came to my class introduce themselves.</p><br/><p>Name, age, what year they are currently in, and after that, their objective and the element they are the strongest in.</p><br/><p>It ended safely, but a question still remained. About the element.</p><br/><p>[You, you said you were best at water right? How well can you use other elements?]</p><br/><p>“The others? Uhm… A bit of earth and fire”</p><br/><p>[Can you have a spirit lend you its power?]</p><br/><p>“No way! There’s no way I can do that!”</p><br/><p>Doesn’t that mean you practically can only use water? Moreover, this one doesn’t have that much magic power and the balance is bad.</p><br/><p>Wait. Could it be…?</p><br/><p>[You, you said you were best at fire right? Others?]</p><br/><p>I ask another one, the student that said she doesn’t care if I was a demi-human as long as my face was good. Maybe she felt discomfort that I asked her, she frowns.</p><br/><p>“… I can use a bit of wind as well. I can’t use spirit magic”</p><br/><p>After that, I asked the others, but it seems that the highest is three.</p><br/><p>(Shiki, what is this? Are hyumans limited in the elements they can use?) (Makoto)</p><br/><p>(No. It’s just that they are so accustomed to use the element they are fit in that they neglect the training of their other elements. They consider the ability to use other elements as a type of talent) (Shiki)</p><br/><p>(So everyone can do it right?) (Makoto)</p><br/><p>(Of course. It’s just that they will use more magic power than when using the element they are most fit in) (Shiki)</p><br/><p>(I see. Understood) (Makoto)</p><br/><p>No matter if it is their specialty, it is not like they are beginners who just began to learn, so I think it is a bit weird to only get better at their forte element. It is actually convenient to be able to use the others after all.</p><br/><p>Even that superior dragon kid was surprised by it. So yeah, it would be interesting to train and see how it goes.</p><br/><p>[I have understood the abilities of everyone. Sadly, I can only call you guys unskilled]</p><br/><p>“Unskilled?! Us?!”</p><br/><p>It’s the one who said I can’t use my mouth. He has vigor, or more like his appearance does too but, you, aren’t you a warrior?</p><br/><p>[That’s right. I want to be appointed by the country, I want to spread my name as an adventurer, I want to stay in this academy as a researcher. I have heard the objectives of everyone here. In the present condition it is possible to make this true, but you will always stay as second-rate]</p><br/><p>“… Aren’t you going a bit far with your words? Even though you are just a mere part-time teacher”</p><br/><p>It’s the girl that said “don’t be a teacher if you are a demi-human”. She is angry. Today we will show off our strength and have the gentle Shiki-sensei leave an impression. This part is important, so I am sorry about provoking you.</p><br/><p>[That’s the truth. Well yeah, then, let me ask you something. You said you were a magician right? Then, what is it that a magician should fear the most in a battle?]</p><br/><p>“… Being isolated, to get the enemy close to you, to panic, to have one’s magic power dry up”</p><br/><p>An answer right out from the book. Well, I think that’s not wrong though.</p><br/><p>[Splendid. Then, what’s the proper form we try to achieve in a battle?]</p><br/><p>“To adapt ourselves. No matter if we are isolated, approached, in an unexpected situation or run out of magic power; we have to be magicians that can choose the best choices in the right moment. That is the ideal form that we have to aim for”</p><br/><p>[That’s exactly right. Excellent. Then, if the girl beside you that said her forte is water, encounters an opponent who is weak against only wind magic so she can’t effectively damage it, what would you do to “adapt”?]</p><br/><p>“In that case I will prepare a wind element attack at the vanguard or a different attack…”</p><br/><p>[There’s only her there]</p><br/><p>“… Then, before it reaches, prepare a wind element attack method. There’s no other choice but to use magic items to prepare”</p><br/><p>[Yeah. If you are unable to do anything about it, it’s the right choice to depend on tools. For that sake, it is a good idea to save a tool of another element, but there’s nothing wrong with being able to use it yourself. 3 at most, is not right. You should at least be able to freely control 3 elements or in real combat there’s no doubt you will feel like something is lacking]</p><br/><p>“… In the academy and in the country, it is common sense to first learn the one element you are most fit in”</p><br/><p>So this time it’s the male student who said this would become an empty class huh. It’s not just “first”, the problem is that you are only doing that. You guys are considered elite after all. I understand their faces of displeasure. It isn’t fun to have someone deny the way they have been doing things after all.</p><br/><p>[You guys are elite right? Is it okay for you guys to be like the other ones? Having your element seen through, be countered and ripped through like paper?]</p><br/><p>“T-That is, we should believe in the swordsman and knights at the front…”</p><br/><p>[Believe huh. That’s a nice word, but it’s not good to use that word as an escape route and not do anything. To create counter-plans from a high point of view, isn’t that how an elite should really be? Of course, even if it is a way to protect your body, to give up on it just because it is not your forte element that’s just no good. It would be one thing if it were impossible, but if it is a possible, you should try and reach out]</p><br/><p>“Guh”</p><br/><p>“Then, does that mean Raidou-sensei is able to maintain a high point-of-view and succeed when being isolated and approached by an enemy?”</p><br/><p>This one is… Oh yeah, the boy that said he didn’t want an incompetent teacher. Did he get interested a little bit?</p><br/><p>[In my case, for the sake of surviving, the point-of-view method is a bit different. Let’s see, then let’s today let’s show a mock battle between me and Shiki. Because it’s better to know the skills of the people that you will be learning from]</p><br/><p>When I look at Shiki, he nods and takes out a staff that is wrapped in lustrous cloth. The staff that was humbly made by the Eldwas was showing its bare presence. The beautiful cloth that resembled silk, I don’t know how it was made, but it seems it has the ability to hide the status of an equipment.</p><br/><p>“Me and my master, Raidou-sama, will be showing a bit of our abilities, so please do attend. It would be good if you are able to get used to one of the forms you should be aiming for” (Shiki)</p><br/><p>I don’t know if Shiki’s words were reaching them or not. The students’ gazes were gathering at his staff. Their looks were filled with shock.</p><br/><p>“Oi, that staff…”</p><br/><p>“What is… that?”</p><br/><p>“What crazy magic power. Also, the elements are jumbled together”</p><br/><p>“Incredible. Not even in the academy’s displayed items have I seen something like this”</p><br/><p>As expected, that staff is quite the creation. My clothes should be even more, but it doesn’t have the nature of leaking its power outside, so its looks are that of normal clothes.</p><br/><p>We begin to move to a place a bit away from them.</p><br/><p>Shiki had his hair tied up at his back and wearing a serious expression. Even if it was an order, he is a diligent one so he won’t cut corners.</p><br/><p>[If it’s at this distance, it is enough to call it “having an enemy approach” right?]</p><br/><p>In the midst of the glances that gathered on Shiki’s staff, I confirm with the boy who was the trigger of this mock battle. He nods with a meek face.</p><br/><p>[Shiki, let’s begin]</p><br/><p>“Then Raidou-sama, here I go!” (Shiki)</p><br/><p>The mock battle to show our abilities and make the future easier to handle, had begun.</p><br/>\n</div>"}