{"title": "Chapter 123: Noble’s way of fighting", "id": 123, "volume": 2, "url": "http://boxnovel.org/tsuki-ga-michibiku-isekai-douchuu-chapter-123-noble%E2%80%99s-way-of-fighting", "volume_title": "Volume 2", "body": "<h1>Chapter 123: Noble’s way of fighting</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 123: Noble’s way of fighting</p><br/><p>The guest seats are lined up as if enclosing the round stage.</p><br/><p>To think that this is the way I would see a coliseum which I have always thought about visiting once. You can’t predict what life will bring you.</p><br/><p>It isn’t the famous Roman type though.</p><br/><p>At the outskirts of the academy, there’s a giant arena for the tournament. It surprises me to see this enormous construction, which could pass to history in the future, as a facility of the school. When looking at the conduct of the students and the teachers of Rotsgard Academy, there are times when one would think that this is a second-rate institution you could find anywhere. Even so, when looking at the facilities and its scale, it reminds you that this is the highest academic center of the hyumans.</p><br/><p>“What was Rembrandt-san hesitating in saying?” (Shiki)</p><br/><p>“His daughters’ safety… is most likely not. It looked like he was heading to the merchant guild today regarding that case. Might be a considerable problem” (Makoto)</p><br/><p>“The Hopelace pressure?” (Shiki)</p><br/><p>“It could be” (Makoto)</p><br/><p>I was completely underestimating the stratum called noble.</p><br/><p>It may have been for only one night, but just in case I had Shiki posted. In the meal of the store that they first went to, there was poison that would make them lose their sense of balance; in the water that the waiter provided at the dormitory, there was poison that induced diarrhea and stomachache; at night, there were several assassins. It was truly a full-course of actions to obstruct their participation in the tournament. Listening to the report, while it was in the range of my expectations, it still amazed me quite a lot.</p><br/><p>At the appointed day, or so to say, today, I thought it already finished and was feeling relief.</p><br/><p>And then, this time I received a sudden call from Rembrandt-san. It seems the Merchant Guild said something happened regarding me. He said he would head there and see what he can do. Since his wife also accompanied him, today Rembrandt-san isn’t here to watch. I do feel that this also has to do with the obstruction of the big noble.</p><br/><p>‘Do nobles go that far?’ Is what I thought.</p><br/><p>This is a school, and no matter what his family is, he is still one student. In other words, the methods of poison and assassins that I made a guess of, were the worst methods. Because you know, even if it is a tournament, it is just one event in the school festival.</p><br/><p>“I am surprised he could go this far…” (Makoto)</p><br/><p>I look at the chart of pairings in my hands.</p><br/><p>There, I have a paper that has written ‘tournament chart’ in it. A pamphlet of the tournament.</p><br/><p>The warrior category and the magician category are divided the same. After several steps, it is made so that the categories clash at one point.</p><br/><p>From my class, there’s: Jin, Misura, Daena and Yuno in the warrior category; Amelia, Sif and Izumo in the magician category.</p><br/><p>And the ones participating are the ones that passed the preliminaries, in total, there are 40. By the way, after the individual battles, there will be team battles, so there aren’t many people participating in the individual battles.</p><br/><p>This most likely means that there are more students better suited for team battles. Probably because instead of having a crushing defeat in individual fights and leave good results in the team battles, it is better to just participate in the team battle and leave only good results, is what I suspect. Because it is plenty possible to leave good results by the abilities of the people around you after all. The people that didn’t watch it directly will only see the final results that will be remaining.</p><br/><p>The students that are only participating in the team battles can put a front saying that they are scared of injuries that might happen in the individual battles, to pull back from participating. How well done. Tte, I unintentionally ended up thinking about it in the bad direction.</p><br/><p>By the way, Jin and the others will be participating in both. And the second son of the Hopelace household will be as well.</p><br/><p>“The first matches will be Jin vs Misura, Daena vs Yuno. The winners will be clashing later. In the magician category: first match is Amelia vs Sif, and the winner will clash with the seeded, Izumo. So he can even manipulate the tournament chart…” (Makoto)</p><br/><p>“Meaning, it will be a battle between Waka’s students. I am looking forward to it” (Tomoe)</p><br/><p>“Tomoe… What an incredibly positive way of thinking. I am simply surprised. Isn’t it an ‘everything goes’? He can even put his hands on the rules” (Makoto)</p><br/><p>Maybe Tomoe doesn’t understand what this implicates, she speaks something out of point. What I am trying to say is that the rules are futile to nobles. Even when he is still a student, he is still able to push this much authority.</p><br/><p>This is too incredible.</p><br/><p>“It seems the Hopelace household has more authority than I thought, and the academy is not a place of fairness huh. That bunch over there too…” (Makoto)</p><br/><p>I look at the people sitting on the guest seats that are far away from the general seats of us.</p><br/><p>There are several faces I have seen before lined up. Proof that my surroundings have become even messier than before.</p><br/><p>There are several people close to the Academy principal, whose only thing I know of is his face. They are probably people from the four major powers. In other words, Limia or Gritonia. Sitting in a place a little away, is the Adventurer Guild’s head, Root. In the line of people related to the church, there’s the priest I met before, and there’s also the big-shot of Lorel, Sairitz. They most likely don’t know that this matches were fixed by a mere student. But my students have suffered damage from it, so in my eyes, they are reflected as having the same offense.</p><br/><p>In those people, there is one that I had no choice but to have connections with because of my thoughtlessness, and there’s also another that locked me because I am an otherworldler.</p><br/><p>… Now that I think about it, since the time I came here, I have been lying a lot. That has been piling up bit by bit, and I feel like it’s beginning to turn troublesome. To protect the lie, make a lie. There’s no end.</p><br/><p>“Waka?” (Tomoe)</p><br/><p>“That is… now, after all this time of moving around huh. This is probably the limit. Hey, Tomoe” (Makoto)</p><br/><p>“Y-Yes?” (Tomoe)</p><br/><p>Why are you stuttering Tomoe? Is it bad for me to do a serious face?</p><br/><p>“Do you want the four seasons in Asora?” (Makoto)</p><br/><p>“! Of course!” (Tomoe)</p><br/><p>“… I see” (Makoto)</p><br/><p>“Waka-sama, I found something interesting so I bought it-desu wa~~, just in case, I bought enough for three” (Mio)</p><br/><p>“Thanks, Mio” (Makoto)</p><br/><p>“You are now capable of being mindful huh, Mio” (Tomoe)</p><br/><p>When I take the paper bag from Mio, a scent resembling basil tickles my nose. Today’s priority is scent? The heat transmits to my hands and tells me that this is a warm food. I’m looking forward to it. I hear a low ‘That’s unfair-desu’ from Mio while she bites her lips. I decide to act as if I didn’t see it and look at the stage. Now that they have come this far, Jin and the others just have to do what they can. There’s a lot of things to think about, however, I have no choice but to watch over it.</p><br/><p>A voice announcing the beginning of the tournament resonates.</p><br/><p>◇◆◇◆◇◆◇◆</p><br/><p>“Now then, the next match is between two of the highest levels participating in this tournament! Both of them are level 97! First, Jin Roan! While being a high grade department’s second year, in terms of practical skill, he is a prodigy that has already entered the highest ranking of all! Especially in his sword techniques, there are many that are paying attention to it! On the other hand, we have Misura Kasper! The vanguard that is the highest rated by magicians! His defensive power that can be called impregnable fortress, and the skillfulness in his ability to utilize even healing magic. He is a swordsman that possesses both of this!”</p><br/><p>The high-tensioned voice clearly resounded.</p><br/><p>But the expression of the two that walked up the stage were as if they chewed a bitter bug. What a bad face they are making. Even I can tell the reason why. The weapon in their hands, and also this pairing. I don’t know the specific quality of the wood, but Jin and Misura have a wooden sword in their hands.</p><br/><p>A wooden sword that has a general size for one hand.</p><br/><p>The other students had metal-types. I could tell that each of them brought the weapons they liked the most. Some of them even got victories because of the specs of their weapons.</p><br/><p>I didn’t give any instructions about fighting with wooden swords, and of course, this is most likely not their will. When you receive a different weapon from the one you originally had, it is understandable why they would have that kind of face.</p><br/><p>“First of all, a word to everyone. This season’s tournament has several participants that have achieved levels over 90, so for the sake of making a balanced evaluation with the other students, a number of restrictions have been established”</p><br/><p>Then just make a grade system for levels from the very beginning like the ones in judo and boxing to divide the ranks before doing the tournament.</p><br/><p>If they talk about level difference and all that gibberish, they should have considered adding restrictions to the weapons and tools utilized.</p><br/><p>Ah~, my head is rotting.</p><br/><p>“The equipment they possess is only that one. It is in consideration of the other participants. Well then, before beginning, we will confirm the rules! The time limit of the battle is 10 minutes. The damage will be transferred to dolls and will substitute for the injuries the person itself takes. The destruction of this doll denotes incapacitation in battle, and at that moment, the battle will end. Also, in the battles of the warrior category, the use of attack and healing magic are prohibited, and the only ones that can be used are self-support related magic. In the case that someone steps out of boundaries, it will decrease points, and if the battle is not decided in the time limit, it will affect the verdict greatly”</p><br/><p>‘Doll’, if it is prepared beforehand, this convenient item will shoulder the damage you should be receiving. It looks like a matryoshka of around 1 meter height. In this kind of tournaments it is sometimes used and it is extremely high priced.</p><br/><p>I thought this was a tool that might increase in effectiveness when used in real combat, but for the doll to be useful, there’s the need of adjusting the place, and in terms of the effective time, it has a lot of restrictions, so it is in essence impossible to use in real combat.</p><br/><p>In this case, they prepare the high priced doll and make a connection with it and the arena that will be serving as the stage, and while at it, they do the procedures between the students and the doll. And by doing that, it seems it is possible to shoulder the damage for around 15-30 minutes.</p><br/><p>In the case that there’s surplus of damage, an overkill, the remaining damage will return to the person itself, so just in case, there’s 3 dolls prepared for each person in each match. The vivid depiction of a bourgeois academy. In other words, if only one of those are destroyed, it means you lose.</p><br/><p>At any rate, this rules are like bullying Misura. Don’t use healing magic; finish the fight fast. Both of those are heavy constraints for Misura. In comparison, Jin practically doesn’t have anything binding him. Also, Jin is not the type to be merciful, so it will be a fight with him on the offensive till the fight ends. The verdict will also turn to, obviously, Jin.</p><br/><p>“Well then, Jin Roan versus Misura Kasuba, battle start!!”</p><br/><p>The spectator seats were slightly quiet, but when they received that signal, it changed into a high volume roar.</p><br/><p>With the improved eyesight I wouldn’t be able to fathom in my previous lifestyle, I can tell that the two of them are doing some kind of talk.</p><br/><p>Jin immediately closed the distance and swings downwards at Misura. The unreliable wooden sword that is several times thinner than what he normally uses, was stopped by Misura. As expected of Misura who has the highest defensive ability, he didn’t break his stance even with the sudden attack. A combo of attacks that are fit to be called a rush were coming one after the other with low amounts of intervals towards Misura. Just as expected, against Jin’s swift attacks, Misura can’t throw an effective attack and is being forced to just defending.</p><br/><p>The conversation probably went: ‘This is also a part of luck, don’t think badly of me’, and ‘Even so, I won’t slack’.</p><br/><p>“Well, what to say, this is quite the simple and one-sided match huh” (Tomoe)</p><br/><p>Tomoe looks at the development of the fight with bored eyes. There’s no doubt that this isn’t a show one can consider interesting. But, in terms of technique, the people that specialize in swordsmanship and close combat should have something to look at. The way of chaining attacks, way of blocking; those kind of things should make minute differences.</p><br/><p>“… In terms of body, I will take back what I said, but as I thought, if I was told this is something a lot of people gather to watch, I still wouldn’t be able to understand-desu wa” (Mio)</p><br/><p>Sadly, it looks like it showed as a boring exhibition for Mio. Misura’s fighting style is centered in defense. A plain style to the taste of professionals. That she took back what she said, must be because she got a bit of a better opinion regarding their technique.</p><br/><p>Compared to the time they began taking my lectures, it was clear that the two fighting right now have a more polished thought process, and in my eyes, it is actually a pretty worthy watch.</p><br/><p>Shifting their bodies, opening the distance; Jin and Misura are truly fighting while thinking thoroughly. They are probably better than me at instant decision making already. They have incredibly good wit after all.</p><br/><p>In the eyes of the spectators as well, they can tell that the speed of this fight is several times faster than previous ones, furthermore, the movement of their body is smooth and varied, so at the beginning, there were quite a lot of cheers. But the attack turn of Jin isn’t ending, so it slowly turned into booing directed at Misura. This is pitiful.</p><br/><p>Misura is a boy that has the ability to even handle Jin using dual swords. Moreover, even in lectures or in his free time, he is doing mock battles. In terms of swordsmanship sense, he is without doubt higher than Jin. The experience is clearly defining his abilities and he is able to defend.</p><br/><p>For example, when there’s a combo of more than three attacks, Misura chooses one of the attacks accurately to repel it. In that framework, in that flow, his eyes that are able to see through the core of the attacks can be considered one of his strongest weapons. He also learned how to parry strong attacks in the fights with Zwei-san. A discreet stock in his growth.</p><br/><p>Misura is properly killing the momentum of Jin with the way he moves his body and the way he takes his distance. Even with that much flow and momentum killed, the attacks still continue probably because it is Jin. That guy also has the wit and instincts of a beast, and he mixes both to push his sharp sense of the sword. Well, if I had to evaluate with only this match, I would praise Misura.</p><br/><p>Both of them can’t do a winning move, so they have no choice but to clash a lot.</p><br/><p>The booing towards Misura gets higher. The match is already not about victory or defeat, and has changed into something similar to military exercises where both fighters confirm each other’s movement, power and techniques. There are several people that have already noticed this.</p><br/><p>The moment Tomoe noticed that change, she narrowed her eyes and let out a ‘Hoh~’ as if in admiration. Looks like she sensed it. Even though it is an incredible fight, there’s something out of place. The impressions of the many people around are just as it looks. Those harmonious movements that give a strange out of place sensation are probably noticed only by people that have seen military exercises before and people like Tomoe, who have a decent amount of technique. By the way, I am of the former type. I have seen several serious military exercises with swords. Jin and Misura are giving the same kind of atmosphere.</p><br/><p>I feel like Mio is also able to tell. She is watching the match with a bored look. The fast food in her hand and the match; her interest is probably divided 80% on the food and 20% on the match. Even so, the reason why I feel like she might respond with the right answer if I asked, is because Mio’s intuition has a scary rate of striking home.</p><br/><p>“Hm, the match is over huh. Like this, the winner will be Misura” (Makoto)</p><br/><p>“Right. In the end, there were practically no effective attacks. Jin, who has been in the offensive, will win by verdict, but in terms of the fight, Misura is the winner” (Tomoe)</p><br/><p>“Winning the match but losing the fight huh. And yet, the venue is treating Misura as a coward. Ahaha, that Jin, he is making a pretty easy to understand face. Misura is also showing his sense of achievement through his face” (Makoto)</p><br/><p>“Well, compared to the idiotic matches until now, I have enjoyed myself a lot more. As expected of Waka’s students. After all, the ones until now have been mostly: prepare their stance, attack, block or evade, fix their stance, counter-attack. Their actions and the execution of their next movement was so obvious that the stupidness was shooting out full-throttle. Honestly speaking, with that level of skill, just by having a good weapon, the match is decided. In a sense, I was watching with opposition” (Tomoe)</p><br/><p>“Exactly. Jin and the others said that recently it has become hard to hide their strength in the other classes. I understand the reason why now. If they were to make those kind of movements in those classes, they would definitely… stand out. It seems they were taking me into consideration. It makes me happy to have good students” (Makoto)</p><br/><p>“That’s a good thing. Fumufumu, for the time being, I will think of a reward for Misura. A bout, a bout, a bout… Well then, who should it be~?” (Tomoe)</p><br/><p>… You are rewarding him with a slap.</p><br/><p>Just as expected, Jin won by verdict. Contrary to the results, Misura walks out from the arena with a satisfied expression. It was a match that had impact. Even if he will be involved with Tomoe, no doubt it will turn into good experience for him, so when the school festival is over, let’s make some time for that.</p><br/><p>The next match that my students will appear in is the magician category, first match and in the next match of the warrior category.</p><br/><p>It doesn’t feel like it will be taking that much time, so maybe I should just stay watching like this.</p><br/>\n</div>"}