{"title": "Chapter 122: The Interlude’s footsteps", "id": 122, "volume": 2, "url": "http://boxnovel.org/tsuki-ga-michibiku-isekai-douchuu-chapter-122-the-interlude%E2%80%99s-footsteps", "volume_title": "Volume 2", "body": "<h1>Chapter 122: The Interlude’s footsteps</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 122: The Interlude’s footsteps</p><br/><p>I want to take a small moment to thank all donators again. Arigato!</p><br/><p>I feel like doing another fast release week or weeks. I will be announcing the moment I plan on doing it, as it is extremely time consuming, so preparations for that moment are needed.</p><br/><p>“You are making a scary face there, Princess Lily. It looks like the face of someone having business with me. Did I hit the mark?”</p><br/><p>“Falz-dono, why iss the head of the Adventurer Guild involving himself with a merchant like that? Can you please tell me?” (Lily)</p><br/><p>After separating with Raidou, the person Root met was Gritonia’s princess.</p><br/><p>Not as the head of the superior dragons, but as the head of the Adventurer Guild. He made contact with Gritonia’ princess, not as the myriad color dragon, Root, but as Falz.</p><br/><p>After the two exchanged something resembling a greeting, Lily takes out Root as if urging him, and brings him to a place with no one around, on top of that, by making probing eyes, finally, the real conversation began.</p><br/><p>“Heh~, you know that he is a merchant? Raidou-kun, the head of a company that opened a store in this town. It has been one of my favorites recently” (Root)</p><br/><p>“I won’t ask you to correct that rude way of speaking this late, but that doesn’t mean I will also permit lies. Falz-dono, what is your real relationship with that man?” (Lily)</p><br/><p>To the broke down words of Root that one wouldn’t be able to imagine were directed to a princess, Lily shows her displeasure in her face while inquiring his true motives. Her way of speaking is also one that can be scolded upon when using it on someone that has the power to affect the whole world. Maybe it’s because they can act this way and no one else would know cause of their current location, or it might be because the relationship between Root and Lily was originally like this, who knows.</p><br/><p>“It is true that it’s my favorite though” (Root)</p><br/><p>“Is Kuzunoha Company using the guild as backing?” (Lily)</p><br/><p>“No way. The Adventurer Guild doesn’t belong to any country, power or noble. It’s an organization that provides support to everyone that is accepted as an adventurer” (Root)</p><br/><p>Root speaks out one of the basics of the Adventurer Guild. Of course, there were no lies in those words.</p><br/><p>“The woman in that company whose name is Tomoe, the hero of our country is interested in her. She also possesses strength I can’t ignore, and personally, when it comes to his wishes, I have a hard time refusing. In this occasion, I don’t mind if you just tell me information you are able to disclose. That place… is there a need to crush it?” (Lily)</p><br/><p>“To think that your mark was Tomoe. The Empire’s hero is also an interesting lad huh. The answer for your question is: nope nope. For now, those guys don’t have interest in the general situation of the world. And while I’m at it, let me tell you something. Fighting with the Kuzunoha Company will be like waging war with demon races on both sides. Even if it’s the major power Gritonia, I don’t recommend it” (Root)</p><br/><p>“They have connections with the demon race?!” (Lily)</p><br/><p>“Just a way of putting it. It is certain that they are able to be at least that much of a threat after all. Regarding your objective, you have already gathered plenty enough cards. I can’t admire sidetracking that much you know” (Root)</p><br/><p>Root gives little information of Kuzunoha Company to Lily. He probably felt something in those words of her, that ‘tell me information you are able to disclose’.</p><br/><p>“I thank you for your warning. Even so, to ignore what’s in front of my eyes is just not fit for me. I see, so Kuzunoha’s fighting power is, as I thought, not only Tomoe…” (Lily)</p><br/><p>While actually knowing that they have connections to the demon race, the contents of what Root said, didn’t answer the query of Lily directly. Lily also doesn’t think that the head of the Adventurer Guild is honestly cooperating with her. She wants to deepen her information even if a little bit.</p><br/><p>“More importantly, is it okay to be here in this kind of times? It is coming soon right? For the curtains of the war festival to open” (Root)</p><br/><p>“… You know that, and yet, you haven’t used that information as a base to move or haven’t left traces of it. Falz-dono, you might actually be pretty similar to me” (Lily)</p><br/><p>“Ahaha, me and the princess? I am not a slave of revenge like you. Just that, I also have something I am aiming for. And in the path to reach there, at some point, the paths you and I walk will cross, that’s all” (Root)</p><br/><p>“… Objective. I don’t think that’s just a simple ambition. In my opinion, I don’t want to turn into an enemy the person that gave me the information of Sofia’s rebellion and the demon race’s ring beforehand. And, it may be irritating to say so, but I don’t even know how much information of the Empire you have in your hands. If possible, can you please tell me that objective? There might be something I can help out with” (Lily)</p><br/><p>Lily’s words were her true feelings. This Guild Master with a bold attitude, even when he spoke out the basis of the Adventurer Guild, he has been cooperating with the Empire’s princess. At times, giving important information or warnings. There have been several times where she has been saved by that. Just that, he is not a subordinate nor a close friend. In this current state where she doesn’t know his objective, it just gives Lily an inexplicable amount of anxiety.</p><br/><p>But he answered by shaking his head.</p><br/><p>“When there’s the need to, I will. It is fine for you to just continue aiming for that ideal world with the hero. As long as you are accepted as an adventurer, I intent to continue the relationship we have had till now” (Root)</p><br/><p>“As long as I am accepted as an adventurer huh”</p><br/><p>“That’s right. No matter who and from where, as long as that person is accepted as an adventurer and receives the guild, I will be that person’s collaborator. Well then, we probably will meet again soon but, see you later” (Root)</p><br/><p>Without destroying the barrier that would repel several intruders at once, Root walks normally through it. Lily, who he interacted with as the Guild Master, only looked at his back with surprise.</p><br/><p>The words of Root as well as the meaningful smile he left, changed the expression of the princess.</p><br/><p>“No matter who and from where, he says. Not just the empire, you aren’t even the ally of the hyumans only huh. No matter if it’s demi-human or demon, as long as they are accepted as adventurers, you are their collaborator. Is that what you are trying to say?” (Lily)</p><br/><p>Lily bites her lips.</p><br/><p>She thinks that her interpretation of the words just now weren’t wrong. That’s why he holds information of several powers, is what he probably meant, but there’s no way of knowing.</p><br/><p>No matter which, it is trouble, is what she thinks.</p><br/><p>“… From the very beginning, he grasped almost every objective I had. On top of that, he told me about the ring that suppresses the power of the Goddess and the betrayal of the Dragon Killer” (Lily)</p><br/><p>Thanks to that, the empire has been able to steer the war better than other countries, is how Lily thinks. From his position of assisting the adventurers, the act of leaking the movements of Sofia would go against what he said, but the words of him, the Guild Master, were that the actions of Sofia are a big betrayal to the Guild. She is a target of punishment, so she is not under his protection, is what he explained.</p><br/><p>And in reality, the Empire, or more like, a country which has influences with the Empire, investigated and discovered that Sofia has not used the guild a single time since Falz explained to her. That would at least mean that one of her backings disappeared.</p><br/><p>It is true that in the past she was opaque and, of course, wasn’t someone trustworthy though.</p><br/><p>(It’s certain that bringing down Stella is our number one priority right now. If there are no outstanding talents by the time I am here, I will return to the Empire early. Currently, I should look at the contact of Raidou and Falz as a plus. If our interests still match, that means it would be bad to put a hand on the Kuzunoha Company. That’s why he gave me information. And also, right now I have no leeway to fight anyone other than the demon race) (Lily)</p><br/><p>This time for sure, we will attack and succeed.</p><br/><p>In the princess’ eyes, there was a clear strong spirit.</p><br/><p>◇◆◇◆◇◆◇◆</p><br/><p>“Yo, have you woken up?”</p><br/><p>I pour water on the man that is bound at the seat to wake him up.</p><br/><p>I have the all-purpose skill called magic, so there’s actually no need to tie him to a chair or urge him to wake up by pouring water, but Shiki and Lime say that this should be the pattern.</p><br/><p>I originally didn’t have plans on making contact with him in this kind of way, and yet, here I am doing it. Maybe I am getting influenced, and also, probably have pent-up stress too.</p><br/><p>“!!”</p><br/><p>“I think you have already heard from Rona-san but, I am Raidou. Nice to meet you” (Makoto)</p><br/><p>“This is… Kuzunoha Company’s basement room huh”</p><br/><p>The blue skinned man splendidly guessed right his current location. He knows that I am Raidou, and moreover, he knew of the existence of this room beforehand. Meaning, it was a perfect guess to the right answer, but… intelligence. As a group member, that reaction was a major fail. I’m glad. If all the intelligence members of the demon race were like Rona-san, I feel like it would scrape away my nerves after all.</p><br/><p>“And you are a demon, right?” (Makoto)</p><br/><p>“Why… are you getting in our way? We have received orders from Rona-sama stating that we should not put a hand on you guys, and if there’s a need to, cooperate. At least there shouldn’t be any reason to receive this kind of treatment”</p><br/><p>“No need to be scared. In the times I am here, the things you think don’t happen that much” (Makoto)</p><br/><p>If I am not here, the danger increases in an instant though, the basement room. Maybe it is because he knows dangerous types of information, the young man with a fit body despite his small build, had his eyes blurred with fear. Even if he is a subordinate of Rona-san, he is a newcomer huh. He doesn’t give me that uncomfortable feeling that Rona-san gives out.</p><br/><p>So he was told that by Rona-san huh.</p><br/><p>True.</p><br/><p>Since the time she left the academy, no matter if in public or in the shadows, there was no instance where the demons did something to us. That’s why, even when I noticed several presences of demons, I tolerated them since they had no evil intent. That thinking didn’t change even when I saw the infiltrated demon escorts of the big-shot of Lorel, Sairitz.</p><br/><p>“What do you plan on doing to me?”</p><br/><p>“I want you to hear my request. It would have been fine to call Rona-san for that, but I was in a bit of a hurry. I apologize for my rough method. One of our employees got the meaning of ‘politely’ wrong you see. Sorry” (Makoto)</p><br/><p>“Request? A request for cooperation?”</p><br/><p>“In the time of the tournament and until it ends, I want all the demons in this town to leave. Just that” (Makoto)</p><br/><p>“?!! I can’t decide that on my own discretion. Also, you said all, but in this town there are several demons that have different views from us. It is impossible to bring them as well”</p><br/><p>…</p><br/><p>Maybe it is the truth or a lie. If it is a lie, this is probably a means to make it look as if some of the others are outsiders with different affiliations, in order to leave several comrades here.</p><br/><p>For now, I should have all the ones posted on us depart, and the ones who are remaining, it is fine to just be cautious. For the meantime, it is okay if the demons affiliated with the demon lord just refrain from doing anything on their own convenience.</p><br/><p>I look at Lime. Maybe he understood what I was trying to say, he looks back at the demon.</p><br/><p>“Waka thinks that it is fine to just have the ones posted around us withdraw. We infer that there’s 13 comrades of yours out there. That’s the amount of comrades we want you to at least withdraw” (Lime)</p><br/><p>“?!!”</p><br/><p>“You said that this can’t be decided by your own discretion, but please decided it. Right now, we don’t want to have troubles with you guys. I don’t know about the future, but right now that’s the case. If you acknowledge it, we will soon release you” (Makoto)</p><br/><p>The intelligence member retains silence for a moment after seeing my attitude.</p><br/><p>It took a bit after before he folded to our ‘request’ and promised that he would get in touch with them.</p><br/><p>“It is effective when you threaten them with force, Waka-sama”</p><br/><p>“If I knew this would happen, it would have gone smoother if I just brought the talk to Rona-san. Well, I didn’t want her questioning me so I chose this kind of method though. Hah~ why did it turn out this way?” (Makoto)</p><br/><p>“I unintentionally said something out of my way like ‘who would be able to incapacitate him the fastest and restrain him’ and we ended pumped up. I am sorry” (Lime)</p><br/><p>Stalking boasting, no, capture boasting? A conversation of intelligence members huh. I can’t understand how that conversation made them pumped up. It seems this time Lime won. What was wagered was the payment of a meal, how peaceful.</p><br/><p>Since it turned out this way, I should at least contact Rona-san to say a few words.</p><br/><p>“Shiki, I count on you for the preparations. Make sure to makes it in time by the tournament. I will go talk to Rona-san for a bit” (Makoto)</p><br/><p>“Understood” (Shiki)</p><br/><p>I return to my room and finish changing.</p><br/><p>Last night I slept early and woke up early by the time it was still dark, so my consciousness is still clear. After taking a light breakfast of pan, I should talk with Rona-san, is what I thought while passing some time troubled.</p><br/><p>Ei, not the time to be saying I’m not good at dealing with her huh.</p><br/><p>The improvement and analysis of the Kuzunoha Company style thought transmission is now useable, but I use the thought transmission that Rona-san gave me in a memo just like it is. Until the connection is established, I have no choice but to wait soundless. By the way, the Kuzunoha Company’s thought transmission has a ‘purururu’ standby sound. This is probably also a beauty pattern in a sense. Since this has practically nothing to do with security after all.</p><br/><p>(Raidou, I am happy to receive a call from you. Is there anything we can help you with? Or could it be, you only wanted to talk with me?) (Rona)</p><br/><p>(Both, is what I want to say, but this time I have a request) (Makoto)</p><br/><p>‘He wants my cooperation in something, right?’ She probably already received the report from her subordinates. Even so, she still plays as if she doesn’t know huh.</p><br/><p>(I will listen. Say it~) (Rona)</p><br/><p>(For a brief amount of time, until the tournament finishes is fine, I want the subordinates Rona-san has hidden in Rotsgard to withdraw. Until now, I have been able to tolerate them without problems but…) (Makoto)</p><br/><p>(Can I ask the reason why?) (Rona)</p><br/><p>She would obviously ask. But, what would be a good answer? If I said something about the Limia noble, there’s the chance Rona-san would take some kind of action. Well, thinking that way might be a bit conceited of me though.</p><br/><p>(If possible, I want you to please not ask) (Makoto)</p><br/><p>(I see. But to do it by today would hard…) (Rona)</p><br/><p>(I can’t talk about it in detail, but part of it is for Jin and Amelia’s sake) (Makoto)</p><br/><p>(Ara, it might have been a short time, but they are acquaintances that took the same class as me. If that’s the case, I will push myself the most I can. The payment will be meeting the demon lord once, how about it?) (Rona)</p><br/><p>(… Got it. Someday, at a time that fits your convenience) (Makoto)</p><br/><p>(Ufufu, I will do my best to create some time, okay? Well then, I will have all my subordinates in Rotsgard, uhm, it was somewhere around 10 right? Until the school festival is over, I will have them take a holiday) (Rona)</p><br/><p>(13. I’m counting on you) (Makoto)</p><br/><p>(To mess up the numbers, I am a failure as a superior. Please keep what happened here a secret from my subordinates okay? Raidou-do-no) (Rona)</p><br/><p>(Understood. Well then, with this…) (Makoto)</p><br/><p>(Call me again, anytime you want, okay? I will be waiting) (Rona)</p><br/><p>… Hah~, just as I thought, this is tiring. After the thought transmission was cut off, fatigue attacked my body in an instant.</p><br/><p>Having the conversation proceed strangely smoothly was unpleasant instead. It felt like she was appealing that ‘I am good willed you know~’ and trying to sound out my intentions. I don’t like that.</p><br/><p>But with this, I can concentrate in the follow-up of the students. I wondered what would happen if I brought out the name of Jin and Amelia, but it seems it went better than expected. Maybe the demon race didn’t plan on doing anything in this period of time?</p><br/><p>If it’s just meeting the demon lord, it isn’t something I can’t pay. If I meet him/her and it’s a crazy good person, I even think I wouldn’t want to make him/her my enemy.</p><br/><p>What’s left is the Hopelace household huh. Limia is the country where the hero is, so it is hard to do anything rash. Luckily, the king himself came here, so I want to believe that he won’t do anything crazy. Please restrain yourself to a level where we can resolve it in a peaceful manner. At any rate, Hopelace huh. I feel like I have heard that before.</p><br/><p>◇◆◇◆◇◆◇◆</p><br/><p>“To stand up in the middle of a strategy meeting. You are beginning to resemble Sofia, Rona”</p><br/><p>“Don’t joke around. Can you please not put me in the same category as that traitor and battle-junkie? More importantly, the preparations on your side are proceeding right?” (Rona)</p><br/><p>There’s an important meeting that’s being done all morning. This has been a regular scenario in Stella Fort recently.</p><br/><p>The demon general Rona left her seat, something she normally doesn’t do, and just like that, without returning to the meeting, she placed an elbow on the ramparts of the fortress and looked faraway as if thinking about something.</p><br/><p>In the top edge of the fortress walls, the place where the archers and magicians are located to attack, is also normally used as a place for the soldiers to rest. In this time when they are training, it is also a place that no one is in.</p><br/><p>Rona has been here for quite a long time, and it is because that man has been basically living with her in that place that he was able to know her location.</p><br/><p>The other demon general stationed in Stella Fort, Io.</p><br/><p>After the meeting finished, he came to this place and called out at Rona’s back.</p><br/><p>“Of course. And, it seems you were in thought transmission though?” (Io)</p><br/><p>“How sharp sighted. Men that mind the thought transmissions of women are hated you know? It was from the person I reported before, Raidou. I thought he would have a bit of troubles in Rotsgard, but it seems that’s not the case. Rotsgard and Raidou, I couldn’t ignore those” (Rona)</p><br/><p>“My life is devoted to my lord and the nation. I don’t care what women think about me. Will it affect the strategy?” (Io)</p><br/><p>Hearing the name Rotsgard and Raidou, Io’s expression clouds. He is the person that Rona said in her report to be careful of, and in the upper stratum of the demon race, he is pretty known already. It was hinted that there’s the chance he could become a powerful cooperator, so a prompt decision was made that they shouldn’t show antagonism towards them.</p><br/><p>“None. At most, I was a bit angered by the fact that he knew the exact number of people concealed. Also, the incompetency of my subordinates. I have already finished what I had to do, so there’s no problems in having them withdraw” (Rona)</p><br/><p>Turning around her body, Rona leans her back in the place where her elbow was placed, and looks at Io face to face.</p><br/><p>“He requested the withdrawal of the personnel in Rotsgard huh. Could it be he really noticed something? Also, it seems you accepted those conditions, but if things continue, it would go against his request, right?” (Io)</p><br/><p>“That boy doesn’t have means to gather information from the demon race camp. Also, he only asked me to withdraw my subordinates. Even if I am here and do something, it wouldn’t go against my promise with him, right?” (Rona)</p><br/><p>Narrowing her eyes, Rona lifts the corners of her mouth and laughs. The expression of the woman that thinks up schemes, a portion of people would find her charming, but in the eyes of a military man like Io, it wasn’t a likeable face.</p><br/><p>“… What an unpleasant woman you are. I pity that young man called Raidou” (Io)</p><br/><p>“I will take that as a compliment. I think you already understand this but, this will decide it” (Rona)</p><br/><p>“No need to tell me. It’s only been half a year. I am not going to underestimate them. No matter how much Hibiki, the Limia hero, has grown, I will just crush it” (Io)</p><br/><p>The four armed giant has an expression as if anticipating the growth of his enemy that he hasn’t met for half a year.</p><br/><p>“And the ring?” (Io)</p><br/><p>“Of course, it has been changed from the early stage prototypes to the middle stage prototypes. It’s about that Goddess. With this, we will be able to seal their powers again. And so, after a few steps more…” (Rona)</p><br/><p>“The hyumans will steer clear from the wastelands for certain. By the plans of Demon Lord-sama. After obtaining the divine protection of the spirits and a rich land, we will finally be able to receive the spring of this world with enjoyment” (Io)</p><br/><p>The ring that seals the powers of the Goddess was already perfected by the hands of the demon race. Just that, after using it once, there’s no guarantee the Goddess camp will not counter it. Because of those fears, they first manufactured a small version to seal the power of the Goddess and check if it worked. When the Demon Lord confirmed the results, he told this to the demon generals and acknowledged the development of a middle stage prototype that will negate the countermeasures for the early stage one. It is a tactic that was born by the information of the Goddess countermeasures for the early stage rings, provided by the high spirits of fire and earth.</p><br/><p>On top of that, to make sure that they make a countermeasure for the early stage prototype, they leaked out information of the ring to a part of the hyumans beforehand and manipulated it in a way that it would reach the ears of the Goddess as well.</p><br/><p>The trap of the meticulous demon race was about to bare its fangs.</p><br/>\n</div>"}