{"title": "Chapter 125: Champion", "id": 125, "volume": 2, "url": "http://boxnovel.org/tsuki-ga-michibiku-isekai-douchuu-chapter-125-champion", "volume_title": "Volume 2", "body": "<h1>Chapter 125: Champion</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 125: Champion</p><br/><p>Love is blind, love is darkness, the ups and downs of love show no discrimination. The people that disturb the love of someone else should get kicked by a horse and die, huh.</p><br/><p>It was great that I didn’t go to comfort Amelia afterwards.</p><br/><p>Looking at the girl entwining her arms around Shiki’s right arm, I honestly thought this.</p><br/><p>Most likely, nothing special happened, but for her, there’s no doubt that she passed a sugary time.</p><br/><p>Shiki has a troubled expression and is worrying about how to deal with Amelia. While at it, I also entrusted the follow-up of Jin and Sif as well.</p><br/><p>When I tell him to help the ones who have lost as well, Shiki does a bow and leaves the sit with Amelia.</p><br/><p>Including the meal, the afternoon time passed safely and it is already the climax of the individual matches. In the warrior category, Jin defeated Daena, and after that, he heedlessly defeated the others with ease and continued advancing.</p><br/><p>Disarming the opponent from his weapon, he attacked several times with light hits, and then, smashes an attack that breaks 2-3 dolls.</p><br/><p>Instead of calling it docile, it was more like he was patiently holding in something while doing work. It was an unpleasant way of fighting. Dolls cost a good amount of money, so it seems he isn’t thinking about the damage it is causing. That I am thinking this way makes me feel like I am becoming more merchant-like.</p><br/><p>Even though he is only holding a wooden sword, that’s pretty impressive. He uses body enhancing magic in a peculiar way, where he activates it the moment an attack connects.</p><br/><p>Maybe the effect increases by only activating it for a second? From what I have seen, the attack power has increased more than when Jin uses attacks that are already enhanced.</p><br/><p>But he hasn’t used it in this kind of way until today.</p><br/><p>… Did he grasp something in his fight between Misura?</p><br/><p>It is hard to think that he left it as a secret weapon for the sake of this day after all. If that were the case, he would have used it in the fight with Misura. I haven’t seen it in the mock battles with the Mist Lizard either.</p><br/><p>I can only categorize it as an abnormal-level of sense and just accept it huh.</p><br/><p>Tonight, let’s try and see if I can do it as well.</p><br/><p>Enhancing magic in itself is one of my specialties, so I feel like I will be able to master it to a certain extent. Seriously, I really have talented students. The things that have to be done, to learn, I am the one being taught after all.</p><br/><p>What’s left is the finals of the warrior category and magician category, and then the champion battle between the winners of both categories. It seems the winner will receive the cringy title of champion.</p><br/><p>… In other words, Jin or Sif.</p><br/><p>Well, it will most likely be Sif.</p><br/><p>Leaving aside the question of whether Rembrandt-san will like that kind of title for his daughter, as a teacher, having both of my students as winners in both categories makes me happy.</p><br/><p>My students are wiping the tournament in both the warrior and magician category, but Sif, who fought Amelia and Izumo in the magician category and got a practically flawless victory, is truly the very meaning of matchless.</p><br/><p>Izumo also sprinted from the beginning, and while evading the spells of Sif, he tried to attack her with short aria spells. But Sif soon created a stone wall around her surroundings with earth magic, and so, Izumo had no choice but to destroy that wall first.</p><br/><p>On the other hand, Sif is in a stage made wholly of stone, so even if she can’t see her surroundings, she is able to sense them with her earth spirit magic. In a stage filled with advantages for her, Sif was able to accurately target Izumo even when she can’t see him.</p><br/><p>It may be simple, but it is a literal location advantage.</p><br/><p>… You put up a good fight, Izumo.</p><br/><p>Even in the face of the stone walls that were continuously regenerating, your unbreakable courage must have definitely given you points.</p><br/><p>“Fumu, Sif is being completely favored by the rules. Fit for your pants is truly how this situation can be described. The chances for Jin to win are just…” (Tomoe)</p><br/><p>“Impossible-desu wa ne. If he were able to shoot his attack with the sword to some extent, he might have had a chance, but even if he is able to, because of this rules, it feels like it would be seen as an attack magic and treated as breaking the rules. In terms of uses on the outside, a stone paved stage is improper. Moreover, in this situation where the warrior side has their close combat limited considerably, the element of Sif is overwhelmingly advantageous-desu wa” (Mio)</p><br/><p>Tomoe and Mio also think that Sif’s victory has already been settled.</p><br/><p>Just like me.</p><br/><p>Having the circumstances itself as your ally, is a truly fearsome power that the winners possess.</p><br/><p>It is sad, but no one is thinking about the final round opponents of Jin and Sif.</p><br/><p>Sif’s opponent is a battery that is relatively resistant and packs decent punch. In other words, there’s no problem.</p><br/><p>The match will end before he even charges.</p><br/><p>Jin’s opponent is him, Hopelace’s ‘I will inherit this family’-sama. He clearly had a weapon of a whole different level, but his techniques were also not that bad.</p><br/><p>Compared to the participants until now, his abilities were actually in a level that I would consider favorable. Just that, the sword that seems to have been brought from the warehouse of his house, is an excellent sword that can’t even be compared to a wooden sword, and in his hands it is just a waste of a good sword.</p><br/><p>The fighting style of the Limia nobles that adhere to tradition and formality is also extravagant, no, it can enter into the actual combat type.</p><br/><p>So he wasn’t just a simple pompous child huh. But that just makes it more disappointing.</p><br/><p>Jin probably intents to crush him completely. What he was trying to hold in will most likely be released in the fight with Hopelace. Even though he says he doesn’t care what happens to him, he cares about his comrades. A person that no matter what he says, he just can’t abandon the people that rely on him.</p><br/><p>And well, that brings us to how it has turned out.</p><br/><p>In the tournament everyone was so psyched up, a noble interfered with it, and as a result, their evaluations have been severely affected.</p><br/><p>I think he is shouldering all their regrets.</p><br/><p>“Waka? Is there something bothering you regarding the warrior category finals?” (Tomoe)</p><br/><p>“Don’t be stupid. There’s not even the need to watch it. The results are obvious. Waka-sama, more importantly, how about we go eat some snacks while we wait for the next match? Should I add something to drink as well?” (Mio)</p><br/><p>“Mio, the food is fine. If you want it, buy it. There’s nothing bothering about the match. I just thought that ‘it is Hopelace huh’” (Makoto)</p><br/><p>I respond to the words directed at me.</p><br/><p>Other people might not have expected this development. But for me, Tomoe and the others, it was a pretty obvious result.</p><br/><p>“Ah… That Limia boy. To think that a mere noble’s second son tried to meddle with Waka. Honestly, I pity him” (Tomoe)</p><br/><p>“Well then, how will Jin settle it? I wonder if Hopelace-kun will be able to participate in the team battles tomorrow. That’s the question… hehe” (Makoto)</p><br/><p>I don’t know why he hates me that much, but he came at me this persistently, so I hope he shows a decent fight. A wish that if the two people at my side hear it, they would smile wryly.</p><br/><p>I hear the voice of the announcer presenting the participants of the warrior category finals and I turn to look.</p><br/><p>3 matches left.</p><br/><p>The first day of the tournament is finally nearing its end.</p><br/><p>◇◆◇◆◇◆◇◆</p><br/><p>“Winner, Sif Rembrandt!”</p><br/><p>The Hopelace idiot is buying time huh. Maybe for the sake of preparing another dirty hand.</p><br/><p>The warrior category that was scheduled to begin first was changed and the magician category happened first.</p><br/><p>The winner was Sif, just like how it was announced just now.</p><br/><p>As expected, with this rules, her strength gets emphasized. If only the earth element wasn’t spirit magic, there would still be a chance to fight back but…</p><br/><p>Her opponent is someone that is one year higher than us, and it seems that after graduating he would become a sword serving in the imperial court as a researcher. And that said person is currently sticking out his head from the stone paving with his body buried and crying.</p><br/><p>Before the match began, it seems they exchanged words. The contents of that conversation probably got on Sif’s nerves. And quite a lot at that.</p><br/><p>A bit after the match began, the swept-back haired man that confronted Sif –self-proclaimed the highest firepower in history- fell into a hole that opened in the floor. Or so I thought, but everything above the neck stuck out and that hole soon closed.</p><br/><p>She should have been able to settle it all with that one move, but maybe Sif was controlling the pressure, she only used that spell as a restrain.</p><br/><p>Losing his staff and barrier in a second, he could only watch the woman’s feet as she approached. In his field of vision, he must be looking at the smiling face of Sif. She grabs the staff in her right hand and after turning sideways, she taps the tip on her left hand, resembling the gesture of what a teacher would do when explaining to a student. An appearance filled with composure.</p><br/><p>When the distance of both was reduced to about 1 meter, Sif points that staff to her opponent. He should have just surrendered as soon as possible, but he just seemed to be shouting something and was not surrendering.</p><br/><p>That thing is actually a senpai. Makes me laugh.</p><br/><p>With the sphere at the tip of the staff, she lifts his head up by putting it below his jaw and pushing up. And then, after looking down at him, Sif turns to the referee.</p><br/><p>‘Still not going to turn the verdict?’ is what her looks told.</p><br/><p>There was no reason to judge that the winner was not decided yet. It was clearly the win of Sif, so it should be fine to just announce that. Even if they prolong this more, it would just be her doing a finishing spell and further hurting the pride of the opponent.</p><br/><p>Sif sighs and narrows her eyes. A short aria leaks out from her mouth.</p><br/><p>What a foolish fellow.</p><br/><p>Maybe he saw the reformed Sif after her return and has misunderstood her for a kind high-class lady that wouldn’t do a finishing move, or maybe he still has some sort of method to win. I don’t know, but whichever it is, he is a fool.</p><br/><p>The eyes of the man open wide. And then, in the moment his mouth was probably going to announce his surrender, a red light converged into a ball and was silently fired at the floor just in front of the man. I thought ‘It is that’.</p><br/><p>And yes it was.</p><br/><p>In front of the man, heat and fire exploded in an instant, and that red light of the fire made the already bright venue into an even brighter one.</p><br/><p>H-Heartless.</p><br/><p>Instantly, the 3 dolls blew up and an unbearable scream resonated from the man. Looking at the scale, she held back. But that was still enough to destroy all the dolls huh. In terms of holding back, magic definitely works differently from swordsmanship.</p><br/><p>That magic as well. The spell that Sif created to counter the approach of Zwei-san, flare pillar. An arranged spell based on the fire pillar spell.</p><br/><p>Setting the activation point somewhere slightly below the ground, charging it and by lowering its effective time, it increases its explosive power. An oblique mass of fire spouts from her opponent’s feet.</p><br/><p>To get hit by that right in front of you, I can’t see it as anything other than torture. As I thought, at that moment, I was sure that woman’s true character hasn’t changed.</p><br/><p>Maybe sensei felt something from that as well, he seemed to be whispering something.</p><br/><p>The effective time was low, and before the screams of the man disappeared, the fire did so first. She used the man’s head as the indicator, and by using the dug-up stone paving of the stage as a gathering point, she was able to control the range of her spell.</p><br/><p>In truth, the further she is, the lower the power it has, but the impact it left is plenty enough.</p><br/><p>The guest seats gave big cheers.</p><br/><p>There were scalds in the cheeks of the man, and a part of his hair was burned. His whole face was trembling, and there was not a single trace left of the confidence he had when the match began. That level of scalding can be easily healed by receiving treatment in the waiting room.</p><br/><p>It shouldn’t leave any scars.</p><br/><p>Just that, the wounds he received in his heart might leave a mark.</p><br/><p>After the referee announced Sif’s victory, she bend her knees towards the ‘severed head’. The weak-looking slender arms take ahold of his neck, and just like that, she stands up and lifts the man as if nothing happened. A strange scene of a female student lifting a male student with one hand.</p><br/><p>The man simply stood still with a frightened face, and after that, without meeting eyes, Sif bows to both sides of the spectating audience and leaves the stage.</p><br/><p>“Well done”</p><br/><p>I call out to Sif who was returning to the waiting room. Seeing that overwhelming victory, I couldn’t think up any counter-measures. It’s honest admiration.</p><br/><p>If possible, I want to get the title of champion though…</p><br/><p>“Thanks, Jin. It would have been fine to finish it faster, but that man, it seems tomorrow he will be in the team of Hopelace, so I scared him a bit” (Sif)</p><br/><p>“That wasn’t a bit. Even Sif is angered by this tournament huh?” (Jin)</p><br/><p>“… I will let you guess. But I am jealous of you who are in the warrior category. That’s as much as I will say. Jin, I think you understand what I mean” (Sif)</p><br/><p>“Yeah, of course I do” (Jin)</p><br/><p>“Great. When being shown just how much the power of money and authority can do, I also feel like I have to reflect as well… Well then, I will be thinking up a plan to get the title of champion with relief okay? I will be watching so, I wish you luck” (Sif)</p><br/><p>In the middle of the conversation, Sif makes a face as if scoffing at herself, and after finishing her conversation with me, she disappeared into the corridor that leads to the waiting room.</p><br/><p>Maybe she was feeling self-disgust towards her past-self that resembled Hopelace.</p><br/><p>… Well, it is true that there wasn’t much difference. Not like I can speak that out of my mouth though.</p><br/><p>I do feel anger at those unreasonable actions. And also, I am feeling the weight of defeating Misura and Daena. I haven’t fought her directly but, Yuno as well.</p><br/><p>This is the individual battles in the tournament. Of course, I was expecting to fight my own comrades. But I didn’t imagine that I would have to clash with them so fast, and to not be able to show my own strength to the audience and, more importantly, to those people. Well, I do feel like I was able to show some of it when we fought with each other. But, the only ones who were able to properly show it off were me and Sif.</p><br/><p>Even if they speak nonchalant words, cheer for us, or don’t say anything at all; when thinking about how I would feel if I were in their position, I end up understanding how they feel.</p><br/><p>Well… this trouble is related to sensei though.</p><br/><p>When I had a connection with sensei, I was prepared for a certain extent of trouble… but to receive interference from an outsider that nobody cares, I don’t like it.</p><br/><p>I just don’t like it.</p><br/><p>Ilumgand Hopelace.</p><br/><p>“Jin. Jin Roan! The finals are beginning. Hurry up!”</p><br/><p>An official in duty calls me out.</p><br/><p>I see. It’s time huh.</p><br/><p>I will finally be able to fight against him.</p><br/><p>“… I will soon go” (Jin)</p><br/><p>Turning my body, I hurry to the corridor that connects to my entrance side.</p><br/><p>Walking in the corridor that continues straight, I could tell that there were several presences I recognized. Lately, there have been moments this has happened.</p><br/><p>In the times I am concentrating to my maximum, I can slightly grasp the situation in my surroundings. Nice. That means my condition is at its best.</p><br/><p>Shiki-san, Amelia, Misura, Daena, Yuno, Izumo. They are probably guarding the surroundings to prevent any dirty tricks. So that’s why they didn’t show themselves.</p><br/><p>Above, there’s sensei and what seems to be his two close aides. I can somehow tell that they are crazy strong. Like this, even if I put them as an objective, I wonder if it is even possible to reach their backs.</p><br/><p>… Interesting.</p><br/><p>Regarding sensei, I can’t tell well.</p><br/><p>Maybe I am still not in the level where I can feel anything from him. He gives off a presence that is thinner than even normal hyumans.</p><br/><p>“Sensei, please watch” (Jin)</p><br/><p>I silently voice my enthusiasm. It wasn’t directed to anyone in particular, a simple whisper.</p><br/><p>I reach the exit of the corridor.</p><br/><p>My field of vision instantly turns brighter. In front of me, there’s the stage. Maybe the excitement of the magician match still remained, the audiences’ mood was already in its climax.</p><br/><p>Each step I do it firmly, and after advancing one by one, I finally go up the stage.</p><br/><p>“Jin Roan, please comply with the arranged time of the match. As a person participating in this tournament, your attitude is not the proper one. We will subtract points for that”</p><br/><p>“… I’m sorry. I will be careful” (Jin)</p><br/><p>I came as soon as I was told, and yet, I get this.</p><br/><p>But, it doesn’t matter.</p><br/><p>Subtracting points only affects the verdict. No matter who the referee sides with, it is pointless in this fight.</p><br/><p>I match my gaze with that bastard.</p><br/><p>It’s him. The intruding outsider.</p><br/><p>There’s no need to worry. I won’t leave wounds in your body that would hinder your participation for tomorrow. In those two days starting tomorrow, we will be having you serve in our favor at the team battle competition.</p><br/><p>Listen well, stop when the dolls are destroyed.</p><br/><p>I don’t know what that guy would say if there’s damage transferred to him after destroying the 3 dolls.</p><br/><p>I have already finished my training with all the matches I had until now.</p><br/><p>I will precisely destroy 2 and finish it there.</p><br/><p>“Oioi, this is a historic armor handed down in my family. In this kind of formal places and in the battlefield, the Hopelace household will always go with this equipment. Even if you complain at me with those eyes, it will only trouble me. The rules also accept it”</p><br/><p>With an arrogant face, the second son is saying something to me.</p><br/><p>Seriously, what an out-of-place misunderstanding.</p><br/><p>I don’t care if your equipment has become even stronger than in the semi-finals. And I don’t care if the match was postponed because you were preparing the equipment.</p><br/><p>I was just thinking about how to finish you.</p><br/><p>“I am not complaining here. It is obvious to do your best. Let’s make this a good fight” (Jin)</p><br/><p>“… I don’t like that attitude. Don’t go giving up early and bore the audience, got it? Just think of this as bad luck for taking the class of Raidou and frantically struggle”</p><br/><p>Audience.</p><br/><p>I see. There were those people too.</p><br/><p>If these were my past-year self, I would be concerned about the eyes of scouts I don’t even know of and fight while minding them.</p><br/><p>Right now, I don’t care who and from what country is looking though.</p><br/><p>“Let’s both do our best”</p><br/><p>Hiding his real self, he sends words he doesn’t even mean and only maintains his righteous front.</p><br/><p>Maybe he felt that the exchange was over, I could tell that his right hand strengthened the grip in his sword.</p><br/><p>The referee nods at the signal of the second son and lifts his hand high up.</p><br/><p>Hahaha, he is been totally bribed.</p><br/><p>“Well then! Ilumgand Hopelace versus Jin Roan! The school festival tournament of the Rotsgard Academy, final match of the warrior category, begins!!”</p><br/><p>So strange.</p><br/><p>In front of me, there’s a prodigy senpai with his whole body clad in incredible equipment I would have a hard time seeing in my life. And yet, a kohai like me, who only has one wooden sword in hand, am not feeling any fear at all.</p><br/><p>Maybe the days fighting with the blue-scaled lizardman forged me this way. Or it might be because compared to the level 70 Hopelace, I am higher with my level that’s over 90.</p><br/><p>I place my right hand that’s wielding the sword to the front and prepare the stance in my upper half.</p><br/><p>The senpai approaches my location with light movements one wouldn’t be able to imagine from someone wearing a plate armor. Those are movements that told that his whole equipment is endowed with weight reduction, body strengthening or enchantment magic.</p><br/><p>But his moves are too obvious.</p><br/><p>I can easily tell that he intends to swing downwards the big sword he brandishes with both hands.</p><br/><p>Too slow.</p><br/><p>It felt like I was watching frames.</p><br/><p>If I wanted to, I could have cut him several times before he swung down his sword.</p><br/><p>Along with a yell filled with fighting spirit, a brilliant giant sword is swung down.</p><br/><p>I thought of evading it, but I soon changed opinions and do one step forward.</p><br/><p>His left hand is just there to support, so I swing my wooden sword from below and hit his right hand which is wearing a much exaggerated gauntlet. Just like I thought, Ilumgand drops his giant sword that was being lifted mainly with his right hand.</p><br/><p>The grounds fall silent.</p><br/><p>I turn my back and take a bit of distance. I turn, facing him once again, and take a stance with my wooden sword.</p><br/><p>He doesn’t pursue. He won’t do it.</p><br/><p>I will get rid of his ‘fair and square’ farce.</p><br/><p>Maybe he understood what I was trying to do. He once again lifts up his sword.</p><br/><p>His face was soon filled with anger.</p><br/><p>Oioi, what are you doing by telling your opponent you are not calm?</p><br/><p>Try hiding it… just like me.</p><br/><p>“…”</p><br/><p>Looks like he doesn’t want to shame himself.</p><br/><p>Your country’s king and your relatives must be watching this match.</p><br/><p>I wait for my match opponent to finish his slow body enhancing spell.</p><br/><p>What. Is it already time for your special move?</p><br/><p>What a hurried fellow.</p><br/><p>Oh, right. That attack just now, the doll’s damage is… doesn’t look like it’s much. Even if there is, it would just be a small crack somewhere.</p><br/><p>He has brought an armor with really high defensive power.</p><br/><p>After his body enhancement, he does a low-posture dash. The moment his opponent enters the range of his sword, he does his special move, a horizontal swipe.</p><br/><p>Ilumgand dashes just as the information I gathered states.</p><br/><p>I didn’t gather that much information about him, and yet, I have been hearing about his special attack and the patterns of that special move.</p><br/><p>He is not trying to hide it, so that’s an obvious result though.</p><br/><p>Because the action of closing the distance and the action for attack are done in two different executions, there was a lot of time to interfere with it. If one uses body enhancement in the interval of the attack and does one step backward, it can be avoided.</p><br/><p>Well, in my case, I can avoid it without enhancing myself though.</p><br/><p>Even if the frame gets slightly faster, it still doesn’t change anything.</p><br/><p>In truth, there isn’t that much difference in speed between me and Ilumgand. But maybe because my brain processes information continuously, I feel like my opponent’s movements are slow.</p><br/><p>It might be thanks to the fact that I am always thinking about how to do this or that in order to decrease the amount of delay in my movements.</p><br/><p>“?!!”</p><br/><p>A horizontal swipe approaches.</p><br/><p>I hit the core of that giant sword with all my strength.</p><br/><p>Once again, the sword falls to the ground.</p><br/><p>It may be a good sword, but if the person holding it is this guy, there’s no point.</p><br/><p>He turns both of his hands, which were holding the giant sword, upwards, and just like that, his hands trembled.</p><br/><p>Hahaha, in other words, his physical strength is on the same level as my past-self the first time I fought Zwei-san.</p><br/><p>Holding back quite a bit, I present his open face with a swing of my wooden sword.</p><br/><p>The doll shakes greatly and cracks.</p><br/><p>The match is not over yet.</p><br/><p>I once again take distance from him, take my stance, and wait.</p><br/><p>“??!! Referee!!”</p><br/><p>He calls out the referee, and while holding his face, he pointed a finger at me with his other hand while shouting: ‘what’s going on here?!’</p><br/><p>If you are a swordsman, at least pick up your sword.</p><br/><p>The referee nods several times.</p><br/><p>Maybe he will say something like fight with your fists?</p><br/><p>Well, I don’t care one bit even if I have to fight with my bare hands though.</p><br/><p>“Jin Roan, I can see that you have been taking a stance of only waiting for your opponent to attack. Make sure to use your all your power to fight in an active way”</p><br/><p>“Understood. I will finish this already” (Jin)</p><br/><p>“?!!”</p><br/><p>Ilumgand takes the sword in his hands once more.</p><br/><p>His proud white skin has become red like someone drunk.</p><br/><p>Well then, let’s go for the first and last attack.</p><br/><p>The time I will leave you all beaten up will be in the team battle. In order to have you face shame in both of those tournaments, I will spare you with just this much in the individual matches.</p><br/><p>In the first place, if I were the only one taking him out, I don’t know what everyone would do to me later.</p><br/><p>“Your name was Jin right?! Jin Roan! You bastard… You bastard, I won’t forgive you! Wa-“</p><br/><p>Rules this, rules that, what a pesky tournament.</p><br/><p>After properly confirming the referee gave the resume sign, I, for the first time, run forward and close the distance.</p><br/><p>Maybe he didn’t even expect such an obvious move, Ilumgand stops what seemed to be threats or whatever he was trying to accomplish with that, and leaks out a voice of surprise.</p><br/><p>Seeing Ilumgand prepare his sword in a hurry, I close the distance to an even closer range than my sword, and kick his armor-protected stomach.</p><br/><p>Because he was protected by his armor, there is no damage to his body, but the shock will still transmit, so he was blown backwards and fell on his ass.</p><br/><p>I swung downwards to his head, but Ilumgand’s sword managed to defend in time and the attack line to his head was intercepted. At this rate, the wooden sword will break in two.</p><br/><p>I pull my upper-half and shift the trajectory of the sword, preventing my sword from clashing with his.</p><br/><p>Passing the giant sword, the wooden sword reaches down and just like that, I changed to an upwards slash.</p><br/><p>The attack aiming at his face beautifully connected, and the head of Ilumgand bends backwards greatly. And just like that, the back of his head hits the stone paving.</p><br/><p>But without caring about that, I punch with the arm I haven’t straightened completely.</p><br/><p>When I thought Ilumgand’s face caved in with that hit, the stone paving makes a dull sound and cracks, and the sound resonated in the grounds.</p><br/><p>I throw away the wooden sword that’s not even mine to the fumes of the stone paving that cracked and step back to where the referee is.</p><br/><p>“Referee, it seems the three dolls have broken you know” (Jin)</p><br/><p>I went overboard.</p><br/><p>I just glanced at it for a bit, but not only did all the dolls get destroyed, it seems I ended up breaking his face lightly as well.</p><br/><p>I can tell he is bleeding.</p><br/><p>Well, it isn’t a wound that can’t heal.</p><br/><p>If he doesn’t take part in the team battles with only that much, we can just settle it outside.</p><br/><p>But, he will participate right? He was made this much of a fool after all.</p><br/><p>He plans on using more dirty tricks to take revenge right?</p><br/><p>After overwhelming Ilumgand Hopelace and shaming him, I win.</p><br/><p>In my victory, I didn’t injure him that much. I think I was able to achieve my objective.</p><br/><p>If I get the impressions of Shiki-san and sensei, it would make me happy.</p><br/><p>As the winner, my name was called, and while I was thinking those kind of things, I left the stage.</p><br/><p>◇◆◇◆◇◆◇◆</p><br/><p>This year’s champion is Sif huh.</p><br/><p>If the whole stage is turned into swamp, the current Jin won’t be able to do anything after all. On top of that, Sif was one-sidedly floating on the surface and was making movements as if surfing.</p><br/><p>The moment he repelled the exploding beam, I unintentionally let out a shout. Jin’s highlights were pretty impressive as well.</p><br/><p>Well, it didn’t serve me as a reference for anything though.</p><br/><p>Because you know, those kind of feats that are like a mass of instinct and sense, there’s no way I can copy them.</p><br/><p>In my perspective, the feat of changing the trajectory of a spell that Amelia showed looks like a more realistic goal.</p><br/><p>Tomoe and Mio said it was interesting.</p><br/><p>Those two probably see the technique Jin showed as something that can be realistically achieved.</p><br/><p>The flare pillar that Sif showed in the match before, it seems there was no turn for it in this occasion. If there’s no one drawing near, there aren’t many chances of using it after all.</p><br/><p>I secretly named that spell: Power Geyser.</p><br/><p>The first time she activated that spell, I reflexively said in a low voice ‘P-Power Geyser…’ A memorable spell.</p><br/><p>Instead of calling it a spell that counters approaches, it is more like a technique that crushes approaches.</p><br/><p>As long as it is a magic spell, she can move the activation point or change the effective time, so there should be many different uses for it, but luckily, it seems Sif has not thought that far yet.</p><br/><p>That firepower can affect the terrain, moreover, if she were to combine it with land mines, she would be a stronghold.</p><br/><p>This time as well, I whispered ‘The Power Geyser? So ruthless’.</p><br/><p>The two that were accompanying me have sharp ears, and while remembering the spell, they said:</p><br/><p>“… Power… Geyser”</p><br/><p>And their eyes were glittering. It made me have a bad presentiment.</p><br/><p>I don’t think this is a spell that’s fit for you guys.</p><br/><p>◇◆◇◆◇◆◇◆</p><br/><p>A dark room.</p><br/><p>The poor-looking man that is sitting on the couch seems to be muttering something.</p><br/><p>Before leaving, it seems a person came to give a report to the man, but after the messenger finished what he came to do, he soon left the room.</p><br/><p>“I understand. I am not wavering. I understand it all. Who do you think I am?”</p><br/><p>The voice that had remarkably increased in volume, resonates in the room.</p><br/><p>The tumult of the night’s festival didn’t reach that place one bit.</p><br/><p>The voice of the man that was hanging his head down didn’t stop through the whole night.</p><br/>\n</div>"}