{"title": "Chapter 131: A certain student’s background (Lower) ~Undercover actions~", "id": 131, "volume": 2, "url": "http://boxnovel.org/tsuki-ga-michibiku-isekai-douchuu-chapter-131-a-certain-student%E2%80%99s-background-lower-undercover-actions", "volume_title": "Volume 2", "body": "<h1>Chapter 131: A certain student’s background (Lower) ~Undercover actions~</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 131: A certain student’s background (Lower) ~Undercover actions~</p><br/><p>Raidou was appointed as a teacher in the Academy.</p><br/><p>Moreover, he has obtained popularity in one portion of the students.</p><br/><p>Ilumgand has been ingesting the medicine that the student gave him before.</p><br/><p>From what he could tell, there were no secondary effects, just like that person said. His physical strength and magic power became stronger.</p><br/><p>That strengthening is continuing even now.</p><br/><p>The strengthened power increased his leveling speed, and his level reached 70.</p><br/><p>“Raidou. That guy is even moving around the academy!”</p><br/><p>But the irritation of Ilumgand didn’t stop.</p><br/><p>It was a simple matter.</p><br/><p>Even when he obtained power, Ilumgand has been unable to meet with Ruria.</p><br/><p>Not only that, he has received reports several times of Raidou and Shiki going to Gotetsu and conversing with Ruria in a friendly manner.</p><br/><p>There’s no way that’s amusing for him.</p><br/><p>The one there is not supposed to be Raidou, but him, Ilumgand.</p><br/><p>The being that has stolen the place he was supposed to enter and the smile he was supposed to receive.</p><br/><p>Inside of him, Raidou had become an existence that was worthy of being killed.</p><br/><p>Moreover, he lost to a student that is taking the classes of Raidou.</p><br/><p>Ilumgand put pressure in the people and stopped the attendance applications to Raidou’s class.</p><br/><p>And yet, even with him placing pressure, that student was one of the scholarship students that still send the petition to Raidou’s class.</p><br/><p>A defeat is not something that’s okay to happen.</p><br/><p>Moreover, that student said this when Ilumgand was defeated.</p><br/><p>“Ah, damn. I messed up adjusting my power”</p><br/><p>She whispered that and returned to the line of students.</p><br/><p>It wasn’t like she said it for Ilumgand to hear, it was more like, her monologue leaked out.</p><br/><p>Her name is Amelia Hopelace.</p><br/><p>A scholarship students that originated from Gritonia.</p><br/><p>Hopelace.</p><br/><p>Same family name as Ilumgand.</p><br/><p>But it is a female student that has no connection with him at all.</p><br/><p>At least he doesn’t know of any connection with her.</p><br/><p>Amelia has not talked to him in any way, so he thought that it is probably a coincidental match.</p><br/><p>And in reality, Amelia is not even from a noble origin, and Ilumgand had already lost interest in her name.</p><br/><p>“Held back? Went easy, on me?”</p><br/><p>What was important wasn’t the name, but the fact that she went easy on him.</p><br/><p>Her year was lower, her level was lower, moreover, in a state where there’s no blessing, a girl went against an upper-grade top class and won.</p><br/><p>There’s no way he could accept that.</p><br/><p>“You are Raidou’s! That Raidou’s student right?! Don’t mess around! Don’t mess with me!!!”</p><br/><p>Little by little, unconsciously, he lost his ability to control his emotions.</p><br/><p>Slowly, without stopping, it silently progressed.</p><br/><p>At that time, his countenance, rigidness, and forcefulness increased, and the amount of people hanging around him decreased.</p><br/><p>After he returned to his room, the rumors of him losing his temper slowly spread around.</p><br/><p>The room was especially bad today.</p><br/><p>He shoved away the furniture around, and the breaking sounds and screams resonated even on the outside.</p><br/><p>After raging for a while, Ilumgand sat on his couch and suddenly yelled.</p><br/><p>“Oi, reinstated! Oi, are you there?!”</p><br/><p>Thought transmission.</p><br/><p>He didn’t need to say it out loud, and yet, Ilumgand voiced out what he was saying in his thought transmission.</p><br/><p>Proof that he is quite irritated.</p><br/><p>(… Sorry. I was doing something. Ilum-sama, what’s wrong? Are you running out of medicine?)</p><br/><p>The voice that responded to the yell, was a glossy voice.</p><br/><p>It is the person in duty that hears out the progress reports after he received the medicine.</p><br/><p>When the student said superior, Ilumgand thought that it would be a male, but when he connected the thought transmission, it was a woman.</p><br/><p>The woman responded to the emotional voice of Ilumgand in an extremely calm demeanor.</p><br/><p>(That’s not it! What is going on?! Why is the class of a mere temporary teacher having more increasing effects than the medicine?! Are you telling me that’s also one of the plans you guys have been doing secretly in the academy?!)</p><br/><p>(… Ilum-sama, please calm down)</p><br/><p>(How can I be calm?! Today, I lost to a student that has only been attending Raidou’s classes a few times! A woman that has a lower level than mine!)</p><br/><p>(There’s not supposed to be any such plan though… Raidou. Are you saying the name of that teacher is Raidou?)</p><br/><p>(That’s right! That ugly, mere merchant that makes a fool out of me wherever I go!)</p><br/><p>Ilumgand’s exasperation was the very definition of the stupid nobles he hated with a passion.</p><br/><p>And Ilumgand didn’t even notice that.</p><br/><p>There’s no noticeable secondary effects.</p><br/><p>That’s certainly true.</p><br/><p>The concerned person, Ilumgand, is unable to notice it after all.</p><br/><p>The woman that continues talking with a calm voice as always, slightly ponders when the name Raidou was mentioned.</p><br/><p>She thought that it would take a bit more time.</p><br/><p>She has been destroying the calm in Ilumgand’s heart little by little.</p><br/><p>Just like how his heart is inclined to defeat.</p><br/><p>All she has actually done is assist in the medicine’s effect, and has not really placed any suggestions or anything like that.</p><br/><p>That’s why she thought that even if it comes into fruition fast, it would need at least half a year. However, Ilumgand was cornered faster than she thought, and for her, he is being completed in a good sense.</p><br/><p>But at the same time, being too fast brings anxiety.</p><br/><p>The main cause of Ilumgand’s accelerated destruction, Raidou.</p><br/><p>She felt that she has to see that person at least once.</p><br/><p>Because she couldn’t think it possible that a female student whose level was a lot lower than the strengthened Ilumgand could beat him.</p><br/><p>Without saying it in the thought transmission, that’s what the woman thought.</p><br/><p>‘At least for hyumans’</p><br/><p>Her interest was pointed to the academy town that already had no need to head to.</p><br/><p>(Understood. Ilum-sama’s regret, I have understood it well. I thought about waiting for your body to get used to it a bit more, but I will prescript you the next medicine)</p><br/><p>(?! The next medicine?! If there’s such a thing, bring it out from the beginning!)</p><br/><p>(Sorry. It is because that medicine has a light side effect. For people that can’t control their emotions, it will bring danger, and more importantly, the body will also…)</p><br/><p>(I don’t care! I can control my emotions! Are you making a fool of me, you bastard?!)</p><br/><p>(Truly sorry. I have said too much. Please forgive me, Ilum-sama. Well then, I will bring it to you as soon as possible. Also, we have a necklace that increases magic resistance. Consider it a gift from us. We will be sending it along as well, so please do use it. It isn’t something bulky, so it won’t be a hindrance)</p><br/><p>(Hmph! don’t think such a mere gift will compensate for your previous utterance!)</p><br/><p>(Of course. We will not be frugal in our cooperation hereafter, so please do pardon me)</p><br/><p>(Those words, don’t forget them!)</p><br/><p>Ilumgand one-sidedly cuts off the thought transmission.</p><br/><p>The woman that was in a dim room, seemed like she was going to leak out a sigh, but instead, she silently bended her mouth into a smile.</p><br/><p>“Fufufu. It seems quite a good wind is blowing. I can control my emotions, huh. What a funny young man. With this, the Hopelace has fallen. Limia will have to move no matter what now. But… Raidou… was it? It would be troublesome if it goes too far, so maybe I should confirm what kind of person it is, at least once”</p><br/><p>Blue skin, a face with no horn.</p><br/><p>The woman that stood still in the room alone, demon general Rona, placed a hand over her mouth as if thinking something.</p><br/><p>This is a story that happened a bit before she pretended to be Karen Frost and infiltrated the school.</p><br/><p>◇◆◇◆◇◆◇◆</p><br/><p>Timing.</p><br/><p>I can’t mess up the opportunity.</p><br/><p>This is the final step of the plan.</p><br/><p>The final phase of a plan that was carefully laid out.</p><br/><p>“Until this point, the plan has proceeded in a truly smooth manner. Leaving aside Limia, the problem was how many high officials of Gritonia we would be able to pull, but I didn’t think Princess Lily would fish them out. Moreover, the princess fished the Limia King as well. I can’t stop laughing”</p><br/><p>There’s only one worry.</p><br/><p>Kuzunoha Company’s, Raidou.</p><br/><p>He said he was neutral, but he is also a hyuman. He is an ingredient that brings anxiety.</p><br/><p>I want him to owe us, but it will be troublesome if there’s an impediment in our plan.</p><br/><p>At least, with Larva there, Raidou won’t be in danger regarding this matter.</p><br/><p>It also depends on how loyal that Lich is to him, but Raidou himself possesses quite the fighting power.</p><br/><p>In the worst case scenario, it is possible that he would move to suppress the situation.</p><br/><p>Even so, thinking about the information relay ability of the hyumans under a chaotic situation, there won’t be any problems.</p><br/><p>That’s right. Depending on his posting, the demerit of the demon race will be big.</p><br/><p>“Raidou, you accepted the meeting with the demon lord-sama, so you must have a certain amount of interest in us right? In that case, please overlook us this time okay?”</p><br/><p>It sounds as if I were praying to someone. Haha.</p><br/><p>Even though we have no God to pray to.</p><br/><p>“Rona!”</p><br/><p>The partner in this time’s plan and also a demon general as well. The loud voice of that giant resonates.</p><br/><p>Now then, it is the time for fruition.</p><br/><p>Let’s watch the end of the heroes.</p><br/><p>The death of all that oppose the demon lord will tell us of our victory.</p><br/>\n</div>"}