{"title": "Chapter 148: Sudden Turn", "id": 148, "volume": 2, "url": "http://boxnovel.org/tsuki-ga-michibiku-isekai-douchuu-chapter-148-sudden-turn", "volume_title": "Volume 2", "body": "<h1>Chapter 148: Sudden Turn</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 148: Sudden Turn</p><br/><p>(This is unbelievable)</p><br/><p>The person that manages the rituals of Lorel and possesses strong political weight as well, in other words, the person Makoto considers a ‘big-shot’, Sairitz.</p><br/><p>Learning about the light that illuminated the night sky for an instant, she could feel cold sweat flowing on her cheek.</p><br/><p>The calamity that swallowed even the neighboring towns. Because of one of the incidents in it, the thought transmission jamming, Sairitz was 90% sure that all of this was caused by the demon race.</p><br/><p>The demon race that has advanced their knowledge in magic a lot more than the hyumans. If it’s something they set, it would be quite difficult to resolve the issue at an early stage.</p><br/><p>No, she thought that way.</p><br/><p>(So this is the result of his ‘I will try’. I will abide to my promise of keeping it secret. Just because of a mere verbal promise, the situation was solved so easily. With an existence so out of norm like Raidou, as expected, he is without a doubt a Wise. And on top of that, one that has quite a lot of power compared to his antecessors. It would be troublesome to have Limia and Gritonia know, but there’s finally the need to take him in) (Sairitz)</p><br/><p>Conciliate with the person, take that person in, and enclose it; Sairitz possesses several methods to achieve that.</p><br/><p>There’s appealing methods, fear and pain inducing methods; truly varied.</p><br/><p>But Sairitz decided to not use the negative methods for now.</p><br/><p>Because she learned about the dangers of doing so.</p><br/><p>(If possible, I would want to use his emotions to bind him. Because if we try to force him to do as we want, our country might get crushed into pieces. Inviting him, tempt him into interest, and bringing him to Lorel is the number one priority. Have him learn of the Wises’ deeds of the past and make him feel deep affection is second. It would be ideal if it reached the point where he thought of our country as his second hometown, but well, I want to make it feel natural. For now, it would be better to make my invitations light. No, the thing I should focus on is reducing the contact between him and other countries) (Sairitz)</p><br/><p>She doesn’t know what kind of easy and scary method the demon race uses to jam the thought transmission.</p><br/><p>Could it be a level of understanding the hyumans are far from reaching, or maybe a plan that they took a lot of time to prepare in order to make it work?</p><br/><p>And yet, there’s people that carefreely thwart those plans, with small numbers.</p><br/><p>Kuzunoha Company, and their master, Raidou.</p><br/><p>Honestly speaking, they surpassed by leaps and bounds the power and scale that Sairitz initially anticipated.</p><br/><p>Battle power that can heedlessly take care of variants, and knowledge that can easily destroy the plans of the demon race.</p><br/><p>On top of that, the sword one of his followers named Tomoe showed a few days ago; the teleporting sword.</p><br/><p>Counting all those factors in, in the worst case scenario, it can even reach the level where they are able to destroy countries.</p><br/><p>Imprudently provoking them would be extremely stupid, and to hand them over to another country would be practically the same as giving them her own country, is what she thought.</p><br/><p>And so, revising her evaluation of Raidou and looking at him again, Sairitz felt like her consciousness would fly away after learning about how dangerous of an existence he is.</p><br/><p>At first glance, he looks like a docile person.</p><br/><p>Thinking about his real strength, it is to an impossible level even if taking into account that the evaluation of Raidou was low at first glance.</p><br/><p>That’s why, thinking about the people that have a bit of power, nobles, wealthy merchants, or people that easily get arrogant, that might try acting in a pressuring manner towards him, and if by chance his mood is harmed by that attitude; simply thinking about it makes Sairitz have cold sweat.</p><br/><p>Also, Raidou has a liking towards demi-humans and employs them.</p><br/><p>If certain demi-humans that have been unreasonably treated by the hyumans enter their ranks and the Kuzunoha Company begins to move for their sake, what would happen?</p><br/><p>Not only cold sweat, Sairitz wouldn’t be able to sleep for several days.</p><br/><p>Without doubt, they would be able to make a demi-human country on the level of the four major powers. To have five major powers; not a joke that can be laughed at.</p><br/><p>(There’s Wise that don’t hold discrimination towards demi-humans, so it is scary that I can’t even joke about it. That situation would still have salvation, but in the worst case, if he were to support the demon race…) (Sairitz)</p><br/><p>Sairitz stopped thinking in the middle.</p><br/><p>Because she thought that having demi-humans as their allies and creating a country on the level of the four major powers is still in the level of cute. In her mind,something even scarier popped up.</p><br/><p>The unification of the world.</p><br/><p>The demon race that challenges the Goddess.</p><br/><p>It would turn into a situation that can be considered the end of the world.</p><br/><p>Kuzunoha Company is a double-edged sword.</p><br/><p>A sword of calamity that has the power to cut countries apart.</p><br/><p>(This is the worst. I feel like I am participating in a roulette with destruction written in it for eternity) (Sairitz)</p><br/><p>While feeling discomfort similar to anemia, Sairitz touches her forehead with her right hand.</p><br/><p>The sticky sweat felt cold, and it was denoting her current mental state.</p><br/><p>“Sairitz-sama, so you were here!”</p><br/><p>“… What happened?” (Sairitz)</p><br/><p>She wasn’t feeling well, but when her subordinate called her, she reacted and lifted her head.</p><br/><p>“Yes, it is an emergency. Please return to the shelter at once!”</p><br/><p>“Emergency? Tonight there’s nothing aside from the meeting Falz-dono proposed though, did something-” (Sairitz)</p><br/><p>“At any rate, just hurry please!”</p><br/><p>Sairitz felt it was slightly rude of the subordinate to cut her words, but she judged that something must have happened, so she followed her subordinate and entered the courtyard’s shelter.</p><br/><p>A tense atmosphere she didn’t feel when she left, and the noisiness as if she returned to the first day of the incident, surprised Sairitz.</p><br/><p>The back of the subordinate that was short of words was already far away. Sairitz regretted that she didn’t calm down a bit more and had him explain the situation.</p><br/><p>(This doesn’t look like a trivial matter. The most I know is that our dragon units are supposed to arrive by early morning, but I haven’t received any report of it yet. Maybe they have obtained new information after the thought transmission was recovered) (Sairitz)</p><br/><p>‘And it is not good information’, is what Sairitz added internally.</p><br/><p>Walking towards the place where the hurriedness is the highest, Sairitz saw the representative of a major power with a complexion she normally doesn’t see that person with.</p><br/><p>The Limia King is personally giving orders violently. The prince and the convalescent knight are also moving busily.</p><br/><p>The Gritonia Princess is giving out orders to her several subordinates, however, she shows an unconcealable irritated expression from time to time. Well, Sairitz is skilled at looking at people, so she is able to detect the slight changes in the expressions of others.</p><br/><p>Even if she stays in place, she won’t understand anything in detail.</p><br/><p>The action Sairitz took, was to enter that place.</p><br/><p>“Limia, Gritonia; just what in the world is happening to make the representatives of major powers like this?” (Sairitz)</p><br/><p>The response for the calm words of Sairitz, were a pair of harsh expressions.</p><br/><p>Limia King, Princess Lily.</p><br/><p>What both of them had in common was their impatience.</p><br/><p>“… Sairitz-dono huh. I have something I want to ask quickly. Where’s Raidou?” (King)</p><br/><p>“Same here. I want to know where Raidou is” (Lily)</p><br/><p>“Just a moment ago I met with him. Just like how you two said, I requested him to somehow restore the thought transmission” (Sairitz)</p><br/><p>And then, without even 10 minutes after, it was restored.</p><br/><p>If she accepts the reality of that, she can’t help but feel shivers all over her body.</p><br/><p>She doesn’t understand the reason why they didn’t move until after several days, but this means that, if the situation requires it, they can act in a heartless manner.</p><br/><p>The more faces she sees of their company, the more terrifying it looks.</p><br/><p>“… As expected, if it’s them, they are able to do it huh. Or maybe, they were able to, but didn’t do it? No, this is something we decided, right now it is not the time for that. The time it would take to look for him is precious. In that case, the moment we are able to make contact with him, it would be best if we wait for him at the entrance of the shelter” (King)</p><br/><p>“I will accompany” (Lily)</p><br/><p>Limia King and the one accompanying him, the prince, and also Princess Lily, lined up and began to walk towards the exit.</p><br/><p>Sairitz, who hasn’t heard about the situation yet, was anxious.</p><br/><p>Trying to somehow understand the situation, she catches up with the back of the two and requests an explanation.</p><br/><p>Because they seem to be the ones that know the most. No, her intuition was telling her that they were a related party.</p><br/><p>“Both of you, please explain me the situation” (Sairitz)</p><br/><p>“… It’s a raid”</p><br/><p>“Raid?” (Sairitz)</p><br/><p>Limia King fires words with a loathsome expression. And Sairitz returns it with a question.</p><br/><p>“The demon race, Sairitz-dono” (King)</p><br/><p>“Yeah, I do think this incident with the variants was caused by the demons but…” (Sairitz)</p><br/><p>“That’s not it. In the homegrounds” (King)</p><br/><p>“The imperial capital” (Lily)</p><br/><p>“!!”</p><br/><p>A scream that can’t be turned into words filled the throat of Sairitz.</p><br/><p>Because the words the representatives said were a scary truth.</p><br/><p>The advance of the demon race.</p><br/><p>News that shake the world.</p><br/><p>“I know that it is an inane plan to provoke Raidou, but in this kind of situation, we have no choice but to ask for the unreasonable of him” (King)</p><br/><p>“Totally agree your Majesty. One step wrong and their teleportation might turn into a threat. If it were to damage the sword, I would be secretly happy about it though” (Lily)</p><br/><p>“Oya, how dangerous. Is Lily-sama stating that they are a threat?” (Sairitz)</p><br/><p>“Sairitz-dono, let me state this frankly, this is not the time to be chit-chatting. The moment we secretly agreed on how to deal with them, it made us practically into accomplices. Please don’t forget that” (Lily)</p><br/><p>“?!!”</p><br/><p>“I hold the same opinion as the Empire’s princess. Sairitz-dono, you still don’t fully understand the situation yet. Listen well, the ones attacking are an army that is being led by a demon general. The ones being attacked are the capital of my country and the empire’s municipal. In other words, Lorel’s important Priestess-dono is also fighting” (King)</p><br/><p>“Chiya-sama too?! Your Majesty, what do you mean by that?! For the capital to be attacked and have both the hero-sama and priestess-sama in the middle of battle is just… isn’t that strange?! What is the army of the kingdom doing?! To let the enemies infiltrate so far and haven’t let the hero-sama and its party escape is just… that’s abandoning their responsibility towards the world and-” (Sairitz)</p><br/><p>“Shut up!” (Lily)</p><br/><p>Seeing that Sairitz suddenly began blaming Limia King, Lily shouted.</p><br/><p>Being cut off in the middle of her words, Sairitz looked like she still had more to say as she glared at Lily.</p><br/><p>For her, no, for Lorel, the Priestess is that much of an important existence.</p><br/><p>Just by having the Priestess that the residents in the country hold deep affection for, in another country, they hold no good affection towards Limia, and yet, on top of that, if she hears that danger is approaching them, it can’t be helped that she would lose her calm for a moment there.</p><br/><p>The reason why she acts more friendlier with Princess Lily than to the Limia King, is also because of this.</p><br/><p>“Listen well, Sairitz-dono. My country’s imperial capital is facing several enemy units already. And it seems they all appeared at the same time. We are currently trying to handle the situation, investigating from what direction they came attacking from. Limia is also the same” (Lily)</p><br/><p>“At our country, it seems they detected a black mass appearing at the coast and advancing. It is already close to approaching the capital. I don’t understand what’s going on anymore. Those guys hold several trump cards?” (King)</p><br/><p>“We need to revise the current battle progress as well. The aim of the demon race that holds the iron wall Stella Fort and is able to fight against both the Kingdom and the Empire. One wrong step and it might prove fatal. That’s how it is, so if you think that we are doing something excessive in our negotiations with Raidou, enter in the middle of it and make a good follow-up. It is not a bad deal right? His impression of us will lower, and his impression of you will increase after all” (Lily)</p><br/><p>“I don’t care if I am the carrot or the stick, I just want to dispatch him to my country” (King)</p><br/><p>“I also have to give commands in the imperial capital. I have to at least avoid the hero-sama of ending up in a hopeless situation” (Lily)</p><br/><p>Impatience also begins welling up from Sairitz.</p><br/><p>The Priestess might die.</p><br/><p>The Priestess of the next era has not been born yet.</p><br/><p>If Chiya dies, Lorel will lose the fulcrum for their spirit. Moreover, if something happens to Limia and Gritonia, Lorel will also turn into a country standing in the frontlines.</p><br/><p>If those two catastrophes were to overlap, just what would happen to the country, it isn’t something she can predict at all.</p><br/><p>“Could it be that… using the variants here was a decoy in itself?!” (Sairitz)</p><br/><p>“I don’t think it is a complete coincidence” (King)</p><br/><p>“I want to believe that it is a coincidence there are more VIP gathered this year than normal, but if information about Academy Town being attacked appears, it is obvious that the other countries will send troops and supplies. As a decoy it has a lot of inconsistency, but it will surely show some sort of effectiveness” (Lily)</p><br/><p>“We were on the misconception that the demon race would stay in Stella Fort maintaining defense like a turtle, so even if we were to send troops, we would only need to delay our attack to the Fort. And because we had that way of thinking, we lowered our guard. They splendidly got the better of us. How irritating” (King)</p><br/><p>“Well, it isn’t all bad news. At the very least, restoring thought transmission with this timing, it should be safe to assume that Kuzunoha Company and Raidou are not spies of the demon race” (Lily)</p><br/><p>“Even if we endure this, it wouldn’t be a laughing matter if they used that teleport technique to attack us while we are in an audience after all. If Raidou were someone that is in cahoots with the demon race, he wouldn’t have restored the thought transmission. In that part, I am also slightly relieved” (King)</p><br/><p>The three representatives of the major powers were talking while walking in quick pace. Without waiting for their escorts to catch up, they arrived at the entrance of the shelter.</p><br/><p>They felt every second as long. Painful tens of minutes pass.</p><br/><p>A major power King, a major power royalty, and a person with high position in a major power.</p><br/><p>The player that is making this many major power leading personages wait, Raidou, received a call from the Academy and appears in front of the shelter.</p><br/><p>Tomoe and Shiki; two followers of his and Falz-dono, the Adventurer Guild’s master, were accompanying him.</p><br/><p>“Raidou, we have to talk” (King)</p><br/><p>“It is something incredibly important” (Lily)</p><br/><p>“I am sorry that this has to come as soon as I made a request before” (Sairitz)</p><br/><p>Three restless voices were shot at Raidou simultaneously.</p><br/><p>He showed surprise for a second, but not long after, without showing any hesitation in his expression, he bowed in front of the three.</p><br/><p>His followers also follow his lead.</p><br/><p>While they hear the talk of the three, Raidou’s face gradually turns severe.</p><br/><p>The King thought that this reaction was brought by his hate towards the demon race.</p><br/><p>But the truth was different.</p><br/><p>Raidou (Makoto) felt insecure, thinking that his days would pass without ever meeting the two Japanese that came to this world, and the anger towards the truth about this attack of Rona being a decoy; those two emotions were warping his expression.</p><br/><p>The long night slowly advances.</p><br/>\n</div>"}