{"title": "Chapter 184: Welcoming and Audience", "id": 184, "volume": 2, "url": "http://boxnovel.org/tsuki-ga-michibiku-isekai-douchuu-chapter-184-welcoming-and-audience", "volume_title": "Volume 2", "body": "<h1>Chapter 184: Welcoming and Audience</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 184: Welcoming and Audience</p><br/><p>Parade.</p><br/><p>There really was one.</p><br/><p>With an open carriage that was ornamented in a conspicuous way to the level of a portable shrine in festivals, it carried us from the gate to the castle.</p><br/><p>Since coming to this world, this has been the most embarrassment I’ve had.</p><br/><p>It made me think that there’s no other day I wanted to bring my mask as much it did today.</p><br/><p>At the front, Io slowly advanced on his black horse-like ride; at our side, there’s Rona.</p><br/><p>Well these guys are in their own country, and their position is that of a demon general, so they are probably used to this kind of treatment.</p><br/><p>But I was a normal citizen in Japan, and in this world I am a merchant, so being immediately able to cope with this type of event is impossible.</p><br/><p>I was somehow able to return my stiffened face to normal, but I was unable to reach an understanding or free myself from obstructive thoughts.</p><br/><p>What surprised me was Mio and Shiki.</p><br/><p>Mio had an unconcerned face as if nothing’s happening, and Shiki was smilingly responding to the welcoming words thrown at him and was waving his hand.</p><br/><p>Incredible.</p><br/><p>These two are honestly impressive.</p><br/><p>Also, I don’t know if this is the sense of worth for the demon race, or that’s just their valuation of hyumans, but it felt fresh.</p><br/><p>As soon as the parade began, obviously, the gaze of the blue crowd that was lined up at both sides of the wide street were gathered at us.</p><br/><p>I had shrunk the magic armor to a point that can’t be seen, and my magic power itself is in a state where other people would find it hard to notice.</p><br/><p>Because of that, I who was the main guest, was looked at with puzzled eyes; at Mio with curiosity; and at Shiki, they simply let out their breath.</p><br/><p>From three of us, the one who was showing the most power to the outside was Shiki.</p><br/><p>Not much later, eyes of respect were also directed at Mio.</p><br/><p>Glittering eyes were directed at her.</p><br/><p>Not long after, cheers were also poured at me.</p><br/><p>Even though I am barefaced.</p><br/><p>For the demon race, the appearance is secondary. I understood that here they evaluate people by their power.</p><br/><p>Because they are demons, they have blue skin and have horns on their head, but just as expected from the people created by the Goddess, they all have nice looking features.</p><br/><p>I don’t know what kind of introduction they did to us, but being welcomed by a group of beauties feels uncomfortable.</p><br/><p>“Fufufu, they really did it. Last night’s reception in the village was truly exaggerated as well, but I didn’t expect that they would go through so much effort.” (Shiki)</p><br/><p>We enter a towering castle, and were led into a spacious room.</p><br/><p>Shiki, this is not something to laugh about.</p><br/><p>Here I am, unable to stop sighing because of the mental fatigue.</p><br/><p>If I let my guard down, a deep sigh would leak out from the depths of my stomach.</p><br/><p>Even if Mio confirmed me that there’s no tapping and spying set up in this room, my rapid fire sighs were not stopping.</p><br/><p>How deplorable.</p><br/><p>“There were a number of stores that seemed delicious-looking. I will check them out later.” (Mio)</p><br/><p>Now that she mentions it, the kebab-looking one looked good.</p><br/><p>Wait, that’s not it.</p><br/><p>Is it okay to go outside? That’s the first thing that should be answered, Mio.</p><br/><p>Fuh…</p><br/><p>“Outside huh. I will ask later and see if we can step out, Mio. And so, as expected, the reception at last night’s village was also a plan from them, Shiki?” (Makoto)</p><br/><p>I ask for confirmation of Shiki.</p><br/><p>It is certainly true that for a town that has been enduring blizzard and existing, they gave us a warm welcome.</p><br/><p>I thought that it might be because people related to the Demon Lord and the Demon Generals had come, but is there some sort of underlying reason?</p><br/><p>The most I thought was: ‘The Demon Lord is also giving orders to the towns’.</p><br/><p>“Of course. ‘Even in unexpected places, the demon race is a monolith, and the Demon Lord also has good reputation’, is most likely what they were trying to appeal. The parade is also a part of it. They probably thought that a welcoming was obvious for guests of the Demon Lord, and they must have wanted to show the trust they have for their own lord.” (Shiki)</p><br/><p>“Are you trying to say that this appeal is another word for political pressure?” (Makoto)</p><br/><p>“No. The Demon Lord is without doubt doing a good government for the demons- no- the demi-humans as a whole. This capital is without doubt the place with most demons, but the sight of demi-humans wasn’t rare, right? In the citizens that were welcoming us, they were naturally mixed in.” (Shiki)</p><br/><p>“Ah, that’s true. In that case, there’s no need to make an appeal. We would be able to tell just by looking around normally.” (Makoto)</p><br/><p>“…They wanted us to understand the demon race in the short time of our stay, is most likely what they were trying to achieve. If it were people that only had good points… it would have been easier though.” (Shiki)</p><br/><p>“Eh, is there anything troublesome coming?” (Makoto)</p><br/><p>Seeing the words of Shiki stalling, I felt a sense of foreboding.</p><br/><p>“No. It seems like for the demon race side, they are properly trying to grasp Waka-sama. At this rate, they will probably not try a scheme of separating us. Of course, I will be keeping an eye and providing support.” (Shiki)</p><br/><p>“Yeah, do your best Shiki. I will leave that part to you.” (Mio)</p><br/><p>… Mio.</p><br/><p>If you are leaving that to him, just what do you intend to do.</p><br/><p>“I will leave the protection of Waka-sama and recklessness display to Mio-dono. I am counting on you. If I don’t have to fling my power as Larva, they will probably slightly understand the depths of our power after all.” (Shiki)</p><br/><p>“… You two, I am counting on you, okay?” (Makoto)</p><br/><p>It seems like Mio does have intentions to work.</p><br/><p>For now I am relieved.</p><br/><p>Ah, I kinda feel nervous now.</p><br/><p>At Rotsgard, when I met with the high-standing people of countries, it was an emergency situation, so I remember that I wasn’t that nervous.</p><br/><p>Being welcomed in this kind of way and even putting on a parade, well, it was to be expected.</p><br/><p>At the Empire, before I could get nervous, there were a lot of events going on, and Tomoki served as a good stress relieve. Well, he made it possible for me to use him that way.</p><br/><p>*Knock*</p><br/><p>Uo, it’s here.</p><br/><p>“Excuse my intrusion. The representative of Kuzunoha Company, Raidou Misumi-sama. The preparations for the audience have been finished.”</p><br/><p>A serene voice.</p><br/><p>The lively words increased my nervousness.</p><br/><p>Deep breath~, deep breath~.</p><br/><p>“Ah, yes! I will go soon!” (Makoto)</p><br/><p>Shiki opened the door and leaves to the corridor.</p><br/><p>Two armed soldiers were there and two demons with a nice personal appearance.</p><br/><p>There are 4 people coming to guide me?</p><br/><p>No, but the two others are not armed. Did civil officials come as well?</p><br/><p>They must have noticed me staring unconsciously, the two lowered their head.</p><br/><p>But they don’t say anything.</p><br/><p>The two had a difference in height like that of Akua and Eris.</p><br/><p>The tall one is a man with indigo blue short hair and a fine goat-like horn.</p><br/><p>In terms of age, he is obviously older than me, but I think he is young. Maybe in his mid-twenties?</p><br/><p>His demeanor is soft and has a gentle smile on his face.</p><br/><p>The other one is a small woman.</p><br/><p>Or more like, little girl.</p><br/><p>Long straight blonde hair, and a still small horn.</p><br/><p>Her mouth looks like it is smiling, but her eyes were showing a light as if inspecting me.</p><br/><p>… At least it is better than the scheming eyes of Eris.</p><br/><p>Hmph, well, there should be an explanation later.</p><br/><p>Even though they have come to tell me that the audience preparations have been done, it would be rude to keep talking here. As Shiki said, it seems like the demon race won’t be coming with any foul plays, so let’s just be obedient.</p><br/><p>This may be common etiquette of the demon race.</p><br/><p>“Then we will be guiding you.”</p><br/><p>“Please do.” (Makoto)</p><br/><p>One of the armed soldiers measured the timing and talks to me.</p><br/><p>I nod.</p><br/><p>Right now it is without doubt noon, and yet, we are walking the corridor with lit lights.</p><br/><p>It is always night here after all.</p><br/><p>A capital of everlasting night does sound kinda cool.</p><br/><p>The people that were walking the opposite direction, no matter their appearance, they all shifted to the sides and lowered their heads as they saw us off.</p><br/><p>Yeah, it does feel itchy.</p><br/><p>But that time didn’t continue for long.</p><br/><p>We arrived at a big door that felt like a gate.</p><br/><p>There were two robust soldiers… no, maybe knights, with a clear difference in hair color that were standing at both sides of the door.</p><br/><p>The two that were silently walking behind until now went along with the two soldiers and approached the door. They seem to be talking about something.</p><br/><p>As expected, the two with good personal appearance are probably from a higher standing.</p><br/><p>While I was thinking that, the big door opens.</p><br/><p>I was bask by a faint light, so maybe it has some sort of magic imbued.</p><br/><p>From the door that opened without making a sound, I could see a red carpet spread out.</p><br/><p>Oh, it truly looks like an audience room.</p><br/><p>Being urged to go in, I thought this before going into the room.</p><br/><p>Maybe there’s some sort of etiquette here.</p><br/><p>“Uhm, can you please tell me if there’s some sort of custom I am required to do?” (Makoto)</p><br/><p>I approach the smiling man that has an easy to talk atmosphere, and quietly ask him.</p><br/><p>“It is okay to just act as you normally do. It is a given that you don’t know the etiquette of the demon race. If Raidou-sama holds respect for our Lord, then it is enough if you just show it in your own way.”</p><br/><p>“I-I see. Understood.” (Makoto)</p><br/><p>‘If you don’t know, it is fine even if you are lacking in manners’, is what he is trying to say, right?</p><br/><p>Okay.</p><br/><p>Let’s go.</p><br/><p>Resolving myself, I face forward.</p><br/><p>The man that gave me an explanation and the girl that came along with him were standing at both sides of the red carpet that I advanced in.</p><br/><p>Are they people that will be participating in the audience?</p><br/><p>If there’s people like that, it would make me feel better.</p><br/><p>I continue straight through the red carpet.</p><br/><p>Mio and Shiki were following a few steps behind.</p><br/><p>After the red carpet, there’s a stairway, and after that there’s the throne.</p><br/><p>I can see that there’s someone there.</p><br/><p>… Or more like, standing.</p><br/><p>It is not sitting on the throne?</p><br/><p>No no no, not only that, it is walking down the stairs?!</p><br/><p>Eh?!</p><br/><p>Is the Lord of the demon race supposed to do something like that?</p><br/><p>No good, don’t fall in chaos.</p><br/><p>This might be a plan from them as well.</p><br/><p>I was about to walk in quick steps, but I was somehow able to maintain my speed.</p><br/><p>If I continue on, someone will probably notify me of where is the point I should stop.</p><br/><p>I walk in a calm pace.</p><br/><p>I’m totally at my wits end inside my head though.</p><br/><p>The person that’s probably the Demon Lord doesn’t stop its feet and continues going down the stairs.</p><br/><p>The distance steadily shortens.</p><br/><p>This is unexpected, really unexpected.</p><br/><p>Being bewildered in this occasion can’t be helped.</p><br/><p>I should at least try not to stutter. Yeah, let’s do that.</p><br/><p>Subordinates, stop that person!</p><br/><p>Your Lord and a stranger merchant will end up talking at close range, you know?</p><br/><p>Isn’t that bad?</p><br/><p>But my internal screams ended unanswered.</p><br/><p>My legs stop.</p><br/><p>Because I can’t advance further.</p><br/><p>Right in front of me, there’s the Demon Lord.</p><br/><p>Wearing a luxurious cloak that covered all sides of its body.</p><br/><p>The height of my gaze would be staring right at his chest, so the first impression that came out was his cloak.</p><br/><p>Looking up at the Lord of the demon race who is standing straight, I look at his face closely.</p><br/><p>And so, he was younger than what I thought.</p><br/><p>It is an appearance that would make me question if he has already turned 40.</p><br/><p>As a man, he looks like the age where he has passed the difficult period.</p><br/><p>His short blonde tortoise shell cut hair was lifted up in order to avoid having it on his horn. At around the top of his ears, there’s two thick curved horns like those of a goat.</p><br/><p>Our eyes met and we both look at each other.</p><br/><p>He is the Lord. I could tell that in one glance.</p><br/><p>What an incredible presence.</p><br/><p>If we fight, I will probably win.</p><br/><p>But, how to say it. Right, he is a man that I can’t beat at anything else aside from that, is what I thought.</p><br/><p>It is not a sharpness that shoots through, but eyes that seem to envelop you.</p><br/><p>His face had turned into a wide smile.</p><br/><p>But that wasn’t a sensation of closeness, it was something that made him feel even bigger. I felt overawed by it.</p><br/><p>Noticing my legs that were about to step back, I stop them.</p><br/><p>Then, I noticed. The hand stretched out from the Demon Lord.</p><br/><p>I thought that he was asking for a handshake, so I reflexively put out my right hand, and just as expected, he grabbed it.</p><br/><p>With relatively high strength.</p><br/><p>“I’m glad you have come. Welcome to the capital of the demon race, Raidou-dono. This one is the Lord of the demons, in the outside, the people call this one, Demon Lord. My name is long and troublesome, so it is fine for Raidou-dono to just remember this one as Zef.” (Zef)</p><br/><p>With a clear voice, the Demon Lord speaks.</p><br/><p>“Zef-sama. I am Raidou Misumi. A merchant running a business called Kuzunoha Company.” (Makoto)</p><br/><p>Eh, I didn’t say anything strange, right?</p><br/><p>I should be fine, right?</p><br/><p>“Umu, this one is truly sorry for having you walk through such a tough route. We are in the middle of a war, so please forgive us. In exchange, at the time you are here, this one promises you that you will not face any discomfort. Along with the rudeness of this one’s subordinates, I will have them atone for it plenty.” (Zef)</p><br/><p>“I thank you for the grateful words. Just that, the case with the Demon Generals was a misfortune in war and being at cross purposes. Please don’t think about atonement.” (Makoto)</p><br/><p>“A misfortune brought in war huh. You will think of it that way. This one is truly grateful. But about the entertainment, it is something obvious to do for our guests. This one wants you to enjoy yourself. And so, are those two there Raidou-dono’s subordinates? People from your company?” (Zef)</p><br/><p>“Ah, sorry! The man is called Shiki, and the woman is Mio. The both of them are followers that are helping me out a lot.” (Makoto)</p><br/><p>With my words, Mio and Shiki lift their lowered heads and do a bow.</p><br/><p>“My name’s Shiki. One of the Kuzunoha Company members that has come together with master.” (Shiki)</p><br/><p>“Same, Mio-desu.” (Mio)</p><br/><p>“Hoh~. The two of you seem to be really strong. This one is jealous of Raidou-dono. No, saying something like being jealous would be rude huh. Raidou-dono must possess quite the power as well. Then it is natural that these two would serve under you. It was this one’s mistake, please do forgive this one.” (Zef)</p><br/><p>“I am always being helped out by them anyways.” (Makoto)</p><br/><p>“My apologies. But it is regrettable that this one can’t even measure your strength. If you are hiding it, that means you have enough ability to even hide it from this one. It seems that inviting Kuzunoha Company was fortuitous for us demon race.” (Zef)</p><br/><p>“Those words are wasted on me.” (Makoto)</p><br/><p>“Fufufu. An audience that would stiffen one’s shoulders would be tiring for Raidou-dono, right? Then let’s change locations and do some leisure talk.” (Zef)</p><br/><p>?!!!</p><br/><p>It’s still not over?!</p><br/><p>“Understood. Do you mind having my followers accompanying us as well?”</p><br/><p>“Of course this one doesn’t. Your companions can also come. Right, this one is thinking about having a few of my relatives, children of mine, accompany us. It is a good chance for them to have a conversation with a hyuman, moreover, a merchant at that. Is it okay?” (Zef)</p><br/><p>“Children huh. I don’t mind.” (Makoto)</p><br/><p>The children of the Demon Lord. Then does that mean the prince and princess?</p><br/><p>Now that I think about it, the princess Lily from Gritonia, prince Yoshua from Limia; I have quite a good amount of prince and princess’ as acquaintances.</p><br/><p>It makes me actually feel that me and my company are strangely famous.</p><br/><p>“Then let’s go.” (Zef)</p><br/><p>“… Zef-sama will guide us himself?!” (Makoto)</p><br/><p>My tone reflexively comes out strong.</p><br/><p>“Don’t worry, it is just around the corner. Ah, you haven’t placed anything in your stomach since coming to the capital, right? About that, this one will have it prepared.” (Zef)</p><br/><p>Zef-san glances at Mio?</p><br/><p>He looked at Mio.</p><br/><p>It is not like she is dissatisfied because of hunger.</p><br/><p>It even seems like she is slightly happy to hear that we will be eating something.</p><br/><p>Waving his cloak, Zef-san walks towards the door we had entered from.</p><br/><p>I follow the Lord.</p><br/><p>It would obviously be bad to be left behind.</p><br/><p>With a speed that doesn’t turn into running, I hurriedly follow after him.</p><br/><p>◇◆◇◆◇◆◇◆</p><br/><p>“Now then, the Kuzunoha Company is an interesting bunch. What do you guys think?”</p><br/><p>A room that’s used for meetings.</p><br/><p>At the big table there’s plates, and light meals that can be taken with the hand were being brought to it.</p><br/><p>Beginning with the Demon Lord, the demons that were in that place also had food still on their plates, but the three plates at the empty seats were still on the table and its contents had been cleanly finished.</p><br/><p>This is after the conversation with Raidou, Mio and Shiki had finished.</p><br/><p>The situation in the room was proof of this.</p><br/><p>“…A beast that devours meat, no matter how docile it tries to be, there won’t be any assurance that it won’t attack. That’s the impression I had of Kuzunoha Company.”</p><br/><p>The first one to respond to the Demon Lord’s words was one of the demons that went to receive Raidou; the tall man.</p><br/><p>“Roshe huh. Fumu, then if it’s you, how would you associate with Raidou and the Kuzunoha Company?” (Zef)</p><br/><p>“From their words, obtaining true cooperation from them is impossible. But there’s no need to go out of our way to awaken the sleeping danger. We will have a connection when necessary, and in the future, I think that it would be appropriate to act in a way that we don’t end up facing front to front with them. Fortunately, it seemed like they didn’t have any intentions of providing man power to the hyumans.” (Roshe)</p><br/><p>“So cooperation will be impossible huh. It is certainly true that it will be difficult. They clearly stated that they won’t take any powers as allies. Even if any of the sides does an action that benefits the other, it will be an action that directly relates to their benefit and not with the intentions of being hostile with anyone.” (Zef)</p><br/><p>Roshe nods at the words of the Lord.</p><br/><p>“Those words of Raidou sounded very dangerous to me. In this war that has our fate at stake, they will only participate in the war with their benefit at foremost. That’s how it sounded to me.” (Rushia)</p><br/><p>“Rushia, are you saying that the Kuzunoha Company will become a third power?”</p><br/><p>The next one to speak was a woman.</p><br/><p>A different female from the girl that had come to receive Raidou. A woman with a calm atmosphere around her.</p><br/><p>Looking straight at the Demon Lord, the light in her eyes didn’t waver.</p><br/><p>From this group, she is the only one wearing armor even if it’s lightweight, which made her stand out.</p><br/><p>“… Right now I wouldn’t go so far as to say that. But it is like having a sword hanging on our heads. An unrestful sensation.” (Rushia)</p><br/><p>“… The words of Raidou: ‘If there’s hostility, we will deliver retribution’, is the part that you are worried about?” (Zef)</p><br/><p>“Yes. Raidou said that if anything is tried against his friends, he wouldn’t forgive it. In a clear manner.” (Rushia)</p><br/><p>“This one thinks that those words of his had another way of taking it. Most likely its foundation is that he won’t be showing hostility to anyone himself; is what he intended to mean when saying it.” (Zef)</p><br/><p>“But just like what your Majesty has said, Raidou made an allusion that there’s a chance they might do something that could antagonize us. Moreover, adding the intention of having us overlook it.” (Rushia)</p><br/><p>“Fumu, those words, this one doesn’t think they were said with the intentions that you have stated, Rushia. There’s certainly a few words from Raidou that gave out a doubtful feeling though.” (Zef)</p><br/><p>“As long as Raidou and the Kuzunoha Company doesn’t properly state their position, without stating if they are black or white, I am against being intimate with them.” (Rushia)</p><br/><p>“This one properly understands your view now. Sem, how do you view it?” (Zef)</p><br/><p>Listening to the last words of Rushia, the Demon Lord shifts the conversation to the man that was silently listening to the conversation.</p><br/><p>A demon with long silver hair tied in a bundle and wearing glasses.</p><br/><p>It is also the demon that secretly felt closeness to Raidou because he felt like they were glass comrades.</p><br/><p>Although the Raidou in question had already taken them off since the matter at the wasteland though.</p><br/><p>Opening his narrow eyes, the man called Sem speaks.</p><br/><p>“I have a similar opinion to big brother, but I thought that it would be better to have a deeper connection with them.” (Sem)</p><br/><p>“Hoh~. That’s quite different from Rushia.” (Zef)</p><br/><p>Sem looks at Rushia.</p><br/><p>She didn’t show an displeased expression after hearing the opinion of him which is practically the complete opposite of hers. She just closed her eyes and silently took her seat.</p><br/><p>“We have different standings by nature. If I was in the same position as Rushia who thinks of the national defense as foremost, I would have had the same opinion as her.” (Sem)</p><br/><p>“You who are in the position of diplomacy, has a different opinion, right? Let’s hear it.” (Zef)</p><br/><p>“Yes. Sadly, Raidou-dono didn’t answer much of the questions I asked and it was mostly Shiki-dono who did, but I think this is the opinion of the Kuzunoha Company. First of all, they possess a transportation ability that surpasses us by lengths and bounds.” (Sem)</p><br/><p>“… What’s your basis?” (Zef)</p><br/><p>“They have experienced the harsh travelling in the demon race territory. But well, even in the demon race territory it was one of the most harshest of the places though. Our territory has increased quite a bit after all.” (Sem)</p><br/><p>“Sem, that’s not answering anything.” (Zef)</p><br/><p>“Oh, I am sorry. I unconsciously lengthened it. It was my bad habit. In other words, they have experienced that level of travelling, and yet, if for example I asked something like: ‘We need these type of things prepared, would you be able to bring them?’ Shiki-dono would normally nod, and its price was truly reasonable. It was a price that was purely placed to obtain profit from the cost of production.” (Sem)</p><br/><p>“…Continue.” (Zef)</p><br/><p>“Yes. In other words, it didn’t take much into consideration the expenses that would come from travelling in these lands. The warranty for the danger should make the price even higher or it would be strange. Moreover, they were talking as if they didn’t have any problems with bringing fruits, vegetables and meat. This is something that Raidou-dono said though.” (Sem)</p><br/><p>“That’s why you think the Kuzunoha Company has some sort of method to certainly deliver the goods, moreover, in a way that doesn’t entail any danger?” (Zef)</p><br/><p>“That’s how it can be taken. If there’s a company that’s able to transport the goods from faraway without any damage in the goods, their worth would be unmeasurable. There would be no other foreign trade partner as beneficial as this. The problem would be if our market would appeal to their interest though. I don’t think it will be that much of a problem since he is a hyuman and the specialties of the demon race territory have a rare value. Of course, thinking of the possibility that those goods might be sold to other hyumans, I think it would be best to not trade anything that’s related to our classified information.” (Sem)</p><br/><p>“Then your opinion is that: ‘As a partner that can help enrich the demon race, it would be best to hold a connection with them’?” (Zef)</p><br/><p>“Yes. We are beginning to realize a wealthy country for us demons and the demi-humans that have decided to coexist with us. But the territory that has become bigger now, still has slow movement in goods. If we create a good business connection with the Kuzunoha Company, it would become a big help to the goods distribution in our territory. If put in an example, it would be like having blood flowing better through the veins.” (Sem)</p><br/><p>“So you are saying that the current demon race doesn’t have its blood flowing all the way huh.” (Zef)</p><br/><p>The words of the Demon Lord had a tone of self-blame.</p><br/><p>“Fast development will always create bents in places. It is only because I am lacking in skills. Normally, we shouldn’t be relying on external sources, but even so, I have judged that our current demon race requires their existence.” (Sem)</p><br/><p>This is what Sem declares.</p><br/><p>For Sem, the Kuzunoha Company might have looked like the hand of salvation.</p><br/><p>“Understood. This one will use it as reference. Now then, the remaining one is Sari huh. This one thought that you would be the first one to state your opinion though. The first one that wished to come along was you after all.” (Zef)</p><br/><p>“…”</p><br/><p>“Seeing the Kuzunoha Company and speaking with them; this one wants you to tell me what you felt about it.” (Zef)</p><br/><p>“…Yes” (Sari)</p><br/><p>The last one the Lord shifted the conversation to was a little girl.</p><br/><p>One of the people that came to escort Raidou.</p><br/><p>She had a face as if meditating something in a deep, really deep manner.</p><br/><p>Doing a short reply, Sari moves aside the hand that was at her mouth and lifts up her head.</p><br/><p>“Those people… no, more accurately speaking, Raidou is incredibly dangerous.” (Sari)</p><br/><p>“… Fumu.” (Zef)</p><br/><p>The same direction as Rushia’s opinion huh, is what the Demon Lord thought.</p><br/><p>For someone that had interest in them, she had stopped to a quite normal viewpoint, is also the unexpected feeling he had of Sari.</p><br/><p>She continues.</p><br/><p>“My ally by nature is the analysis of information, but after being face to face with these people, I will be speaking with a bit of instinct mixed in as well.” (Sari)</p><br/><p>“This one doesn’t mind. What did you feel?” (Zef)</p><br/><p>“Trackless power. Moreover, at an overwhelming extent.” (Sari)</p><br/><p>Hearing the abstract words of Sari, all the people present narrow their eyes.</p><br/><p>“You are saying quite the abstract words there. That’s rare, Sari.” (Zef)</p><br/><p>“I am sorry, your Majesty. But if I am to put it together, that’s the result that comes out. As an existence of power, the Kuzunoha Company is certainly not an existence we can ignore. In that aspect, I am of the same opinion as Ani-sama and the others.” (Sari) </p><br/><p>Roshe, Sem, Rushia; the three of them nod at the words of Sari.</p><br/><p>“Just like in the report of Rona, they are appealing. For us, they are incredibly appealing, moreover, strong. Conversely, that is also incredibly dangerous and an existence that can jeopardize the demon race. What I mean is that, uhm, I can’t properly bring it out in words. For all that power they have, they are way too much of an unstable factor, is how I thought of it.” (Sari)</p><br/><p>“Unstable?” (Zef)</p><br/><p>“If I am to force myself to put my personal opinion into words, then yeah, that’s how it is. Unstable, moreover, an unstable factor that we don’t know its limits of. Raidou said he won’t cooperate with anyone in the war, he won’t be taking sides. That is just like Rushia ane-sama said, having a sword hanging over our heads. But just as Sem ani-sama said, that power could be the wonder medicine that might solve many of the problems the demon race has.” (Sari)</p><br/><p>“Then wouldn’t it end up the same as Roshe’s opinion? Thinking of the risks while having a connection with them.” (Zef)</p><br/><p>“…I am concerned about what’s further beyond that.” (Sari)</p><br/><p>“Beyond?” (Zef)</p><br/><p>“I illustrated Raidou as a power that can’t be kept in check. In other words, the time when Raidou suddenly turns to face us.” (Sari)</p><br/><p>“Acting in a way to make sure it doesn’t happen, won’t work?” (Zef)</p><br/><p>“We don’t know how something that can’t be kept in check will move. If in the middle of our war with the hyumans, we end up instilling his rage in a moment we don’t know of, he would most likely not hesitate in baring his fangs towards the demon race. Let me ask you, your Majesty. Your Majesty, can we defeat Kuzunoha Company?” (Sari)</p><br/><p>The words of Sari make the air in the area colder.</p><br/><p>Words that could be taken as rude.</p><br/><p>But the Demon Lord, after a moment of silence, looks straight at Sari without signs of faltering in his voice.</p><br/><p>“…Don’t know. But probably…” (Zef)</p><br/><p>“Probably?” (Sari)</p><br/><p>“We won’t win. The best we could do is most likely to put our efforts in not losing. After all, Io and Rona who are our prided demon generals, couldn’t be his opponents even when fighting at the same time. And in reality, Io was dealt with in his spare time, eliminating him from the battlefield. His close aides as well as his employees, they are surely not normal either.” (Zef)</p><br/><p>“?!!”</p><br/><p>“…”</p><br/><p>Aside from Sari, the eyes of the other three opened wide at the words of the Demon Lord.</p><br/><p>Sari took those words in silence.</p><br/><p>“So you see them as a power that can’t be kept in check huh. As a commentary describing Raidou, it might be the most appropriate. This one’s opinion is that he is a sleeping dragon. It might be a poor plan to just try not waking it up huh.” (Zef)</p><br/><p>“He needs a choker. Also, it can’t be just any choker. There’s the need for a choker with the seed called demon race which will double as an insurance as well.” (Sari)</p><br/><p>“A choker even when we can’t keep it in check?” (Zef)</p><br/><p>“Yes. Fortunately, I don’t think there’s an existence that is guiding his will yet. At the very least, he is not a talent that we can let the hyumans have. This timing is truly fortunate. I think that there’s worth in trying.” (Sari)</p><br/><p>“So we will be making Raidou into our lap dog? It is an opinion quite different from the other three.” (Zef)</p><br/><p>“No. We will do our best to lead him into not biting the demon race, is probably the best result. He will most likely not be tamed.” (Sari)</p><br/><p>“Fu… hahahaha!! You have seen through Raidou to this extent and yet, you still say that? Well, they are still staying in the capital. In that case, there’s no need be so pessimistic. It may not be a long stay by any means, but… there’s still time.” (Zef)</p><br/><p>“…Yes. Just that, looking at the information of him until now, Raidou didn’t show strong any strong will to have a relation of cooperation or minded about his own standing. I don’t know what happened in this short time, but if something did happen, I can’t go without resenting that reason. If he were in a more normal state, it would have been easier to handle.” (Sari)</p><br/><p>“That unyielding attitude was also unexpected for this one. Was he like that from the very beginning, or did he have a change of heart, there might have been someone who did something unnecessary. What a troublesome thing they have done. Now then, let’s finish this up. It was worthwhile to hear all your opinions without reserve. You can leave now.” (Zef)</p><br/><p>The Demon Lord wraps up the conversation.</p><br/><p>The four demons leave the room, and the Demon Lord Zef was the only one left in the room.</p><br/><p>“…Fuh, they have become reliable. If the Kuzunoha Company didn’t exist, this one wouldn’t have minded retiring even now. As expected, it is all because of Raidou and the Kuzunoha Company huh. This one doesn’t think the meeting point at Kaleneon’s area was a coincidence. It seems there’s still more surprises for us. It is truly good timing that we were able to make contact with him before he joined any of the heroes.” (Zef)</p><br/><p>After words akin to a whisper, the happy expression of the Demon Lord made a complete change. From a Lord, he had turned into an individual called Zef.</p><br/><p>“Raidou… how long has it been since this one has felt cold sweat. To have power that even this one can’t measure. At the very least he is stronger than a spirit. Not only a hero, his power might be close to that of a God.” (Zef)</p><br/><p>A line of sweat runs down his cheek.</p><br/><p>Zef didn’t move for a while in his room.</p><br/>\n</div>"}