{"title": "Chapter 180: White Desert", "id": 180, "volume": 2, "url": "http://boxnovel.org/tsuki-ga-michibiku-isekai-douchuu-chapter-180-white-desert", "volume_title": "Volume 2", "body": "<h1>Chapter 180: White Desert</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 180: White Desert</p><br/><p>The surface of the spread out ground is bright white.</p><br/><p>This is…just beautiful.</p><br/><p>Incredible.</p><br/><p>At my field of vision there’s only white and blue. The white of the ground and the blue of the sky.</p><br/><p>“Hah…” (Makoto)</p><br/><p>I let out a long sigh.</p><br/><p>“Raidou-dono, did you like it? Our Empire’s unexplored region, the White Sand Sea.”</p><br/><p>Hearing the voice from my back, I remember that I didn’t come here alone.</p><br/><p>That’s how much I was moved and surprised.</p><br/><p>“… It is a splendid scenery. I am truly moved.” (Makoto)</p><br/><p>“A splendid scenery, is it. I see. It may be a merchant-like impression.”</p><br/><p>“What do you mean by merchant-like?” (Makoto)</p><br/><p>“Pardon me. Merchant-like was a slightly incorrect word to use. I just thought that this is not an impression a fighter would give. That’s how I felt, that’s all. The desert is not a gentle place for the people entering it after all.”</p><br/><p>From Gritonia Empire’s capital Ruinas to here, we only used one teleport formation.</p><br/><p>This female knight says it is an unexplored region, but there isn’t that much distance from a hyuman settlement.</p><br/><p>It is a place that is shut out by a mountain range at the east of Ruinas, and it is practically neighboring it.</p><br/><p>The Empire is completely under control of it. Entrance is restricted.</p><br/><p>In that sense, it is correct to say that it is an unexplored region.</p><br/><p>“A white desert. Well, I have seen something nice. I have to be grateful of that pervert.” (Makoto)</p><br/><p>“What’s most important is that you like it. This is a place that not even the Empire related people dare to get close to. The entrance is being strictly managed, and originally, even if you were a guest of Lily-sama, it would still be impossible to have you come here. Please do understand the solicitude Lily-sama and Tomoki-sama have for you.”</p><br/><p>It seems she didn’t hear the last part, since I said it in a low voice.</p><br/><p>Tomoki huh.</p><br/><p>Yesterday, after having the hero Tomoki face a little pain, I reunited with Tomoe and Shiki, and finished my talk with Princess Lily.</p><br/><p>It seems the destination of the Root’s errand is at a place called White Desert in the Gritonia Empire. That’s where the superior dragon Grount is supposed to be. It is a dragon that is somewhat connected with the Empire, and it is certainly true that this is an errand done just because I had the chance.</p><br/><p>I did hear from Root that he would be getting the permission, but I didn’t think Princess Lily was involved in it as well.</p><br/><p>Well, it is not like every request is going to pass through. This place seems to be important for the Empire, and it has ended in me going with a guide that the Empire prepared.</p><br/><p>When I heard the talk about a guide, for a second I thought it would be Tomoki and I frowned.</p><br/><p>That was a relief.</p><br/><p>My guide is a direct subordinate of Princess Lily called Ginebia-san. It seems she is also Princess Lily’s bodyguard.</p><br/><p>She is young and still a royal guard, so she must be quite talented. Just that she is a part of Tomoki’s party, and is filled to the brim with the charm power though.</p><br/><p>They gave me a guide that is the bodyguard of Princess Lily and a member of the hero party.</p><br/><p>This is something Ginebia-san said, this must be the will of Princess Lily, and also a way to keep me in check. Tomoe and Shiki told me this.</p><br/><p>A royal guard and one of the most prominent knights.</p><br/><p>But there’s a title placed on her. Royal guard Grount.</p><br/><p>The strongest knight that has received the blessing of the superior dragon Grount.</p><br/><p>According to Tomoe, in terms of protection, it is prominent even in the world. Also, if she is able to obtain location advantage, Tomoe said that she could stop an army of thousands.</p><br/><p>It is impressive since she was able to make Tomoe say that much about her.</p><br/><p>After that she said: “Well, it would take me around 3 minutes to beat her. Just about right for a warm-up.” Which completely ruined the whole image. She is still in her twenties, so being able to climb that high is worth of praise.</p><br/><p>What’s important is the point that after Ginebia-san obtained the job of royal guard and became the direct knight of the princess, it lead to taking the trial of Grount and receiving the blessing.</p><br/><p>She has the power to travel solo in this white sea of sand and meet Grount.</p><br/><p>The princess must have judged that this knight would be able to chase after me no matter where I go.</p><br/><p>“Superior dragon Grount. His alias of Sand Sea might come from this place.” (Makoto)</p><br/><p>“Raidou-dono, I am sorry for the rudeness but…” (Ginebia)</p><br/><p>“Ginebia-dono, of course I am deeply grateful for the princess and Tomoki-sama.” (Makoto)</p><br/><p>“It is okay if that’s the case. The previous statement was from my own volition, so please do keep it a secret from the two.” (Ginebia)</p><br/><p>“Yes, I understand. By the way… Ginebia-dono, I heard that you passed the trial and met with Grount, but which direction is this dragon’s dwelling?” (Makoto)</p><br/><p>While facing Ginebia-san, I grab a fistful of sand with my left hand.</p><br/><p>The pure white sand smoothly spills from my hand. The feel of it is also impressive.</p><br/><p>“… I also got lost for several days with no idea of the direction. It was only a miracle. But this is something that Grount tells the people that wish for their blessing. It’s also engraved on the gate, but it is to: ‘Go straight without wavering’. Of course, I also followed those words.” (Ginebia)</p><br/><p>As you go by, there’s only sand in sight.</p><br/><p>Going straight isn’t as easy as it sounds. And I don’t want to stay here for several days.</p><br/><p>I am planning on returning tomorrow after all.</p><br/><p>For now, I will try going straight and see. When I separate from Ginebia-san, I can use [Sakai] to search for the location of the dragon.</p><br/><p>“Go straight without wavering huh. Thanks for the info.” (Makoto)</p><br/><p>“Raidou-dono, let me tell you this. From here onwards, there’s no guarantee of your life as this is a dangerous desert. Mamonos will appear as well. It seems you are carrying some sort of luggage, but trying to challenge the desert with only that is akin to suicide. If you want to go, I recommend coming at another time…” (Ginebia)</p><br/><p>“Ah, I will be returning by today, so Ginebia-dono, please wait at the cabin of the teleport formation. Thanks for guiding me.” (Makoto)</p><br/><p>I shift the bag where the egg is in.</p><br/><p>When I checked this morning, I caught Tomoe, Mio, and Shiki messing with it by scribbling on it.</p><br/><p>Is it a cast of a hospitalized patient? Is what I thought.</p><br/><p>… Well, what’s important is the inside, so no matter what’s written on it, I think there won’t be any problem though.</p><br/><p>It is the egg of Lancer, so it can’t be helped.</p><br/><p>For me, he is already dead, so I am able to clear my conscience by treating it as a new life. But Tomoe and Mio who were unable to deal with him themselves, were especially eager to do something to him.</p><br/><p>In a sense, it is proof that they treasure me, so well, I ended up letting them off.</p><br/><p>“Wa?! Raidou-dono!! The White Sand Sea is supervised by Grount, and there’s sand and fire traps in many places! Please return!!” (Ginebia)</p><br/><p>Ignoring the words of Ginebia-san, I change the color of my coat after a long time of not doing it.</p><br/><p>Acceleration equipment~.</p><br/><p>Errand, here I go~.</p><br/><p>“Well then, I wonder where he is.” (Makoto)</p><br/><p>I kick the ground.</p><br/><p>The feeling of accelerating at once is pleasant.</p><br/><p>When I look at my back for an instant, there was a cloud of white sand scattered at my back. Because of that, I can’t see Ginebia-san.</p><br/><p>“Wah?! Just how much movement speed do you have?!” (Ginebia)</p><br/><p>I land.</p><br/><p>I could hear the voice of Ginebia from afar. At this rate, I can easily lose her.</p><br/><p>While carefreely pondering, I change [Sakai] into search and increase its range.</p><br/><p>This place is really big.</p><br/><p>“Oh.” (Makoto)</p><br/><p>My feet were sinking into the sand in an unnatural way. The sand at my surrounding is also pushing me down at an incredible rate. Soon, the sand had become like a mortar, dragging me to the center of a space of sand.</p><br/><p>Is this like, a classic?</p><br/><p>I thought that maybe it is an ant hell or the pattern where the center is hollowed. When I checked at the center, there were sharp edges resembling those of a beetle waiting for me there.</p><br/><p>“An ant hell huh.” (Makoto)</p><br/><p>“Raidou-dono!!! That place is the den of a Mamono that drags their prey with sand. I was too late!! I will be going right—- Eh?!!” (Ginebia)</p><br/><p>“Heave-ho!!” (Makoto)</p><br/><p>I grab that beetle-like thing with both hands and just like that, I use brute force to lift it.</p><br/><p>Oh, it is truly an ant hell.</p><br/><p>Its buttock is pretty grotesque.</p><br/><p>Sorry butt, I am looking for a different game so… at a direction where Ginebia-san isn’t and a place where I won’t be going… I throw it.</p><br/><p>Next time I should just jump out of it and escape.</p><br/><p>I once again jump and land. Repeating that process of jumping and landing, I use the search [Sakai] and wait until it catches the presence of something that might be the one of Grount.</p><br/><p>It didn’t take long.</p><br/><p>I found what’s most likely the place.</p><br/><p>“It really was straight head. Is it a dragon that doesn’t tell lies?” (Makoto)</p><br/><p>A divided desert, storms of sand, a burning sand river(the fire’s also white).</p><br/><p>I coated myself with the *magic armor* and while advancing straight into it, I was unable to feel the presence of Ginebia anymore. </p><br/><p>When I was at a distance to confirm with my eyes the point that [Sakai] had detected, I caught sight of it.</p><br/><p>“At the end there’s a white cone? Is that wind swirling at high speed? I am impressed that Ginebia-san was able to pass through this.” (Makoto)</p><br/><p>I am beginning to get hungry, so let’s quickly deliver this egg.</p><br/><p>I advance until it is right at my nose.</p><br/><p>“It is going at quite the speed. I thought it was a reversed tornado version, but it seems to be something even more fiendish. It is completely white and I can’t even see the inside. If someone tries to pass with normal means, he would end up as minced meat.” (Makoto)</p><br/><p>While saying that, I take one step forward.</p><br/><p>“Pardon the intrusion.” (Makoto)</p><br/><p>I put the arms of the magic armor inside.</p><br/><p>Forcibly tearing up the conic sand and the spell that composes it, I enter inside.</p><br/><p>◇◆◇◆◇◆◇◆</p><br/><p>“What’s this?”</p><br/><p>I experienced something that I have never felt before.</p><br/><p>In my long thousands years of life, this is something I have never experienced before.</p><br/><p>This sea of white sand is being called names like ‘Sand Wave’ and ‘Dragon’s Trial’.</p><br/><p>That’s me.</p><br/><p>Superior Dragon, Grount.</p><br/><p>Earth and fire resides in this body of mine, but for a long while, I haven’t used this power to fight with any enemies.</p><br/><p>While giving blessings to the strong ones that cross this sand sea, I have been watching over the world’s natural course for a long time with the help of the spirits.</p><br/><p>The latter is actually the work of Root, but he is our chief, and has also created the Adventurer Guild and living within hyuman society.</p><br/><p>This work that should have just been temporarily changed, by the time I noticed, it had become my livelihood.</p><br/><p>Ah, right now is not the time to be rambling like this.</p><br/><p>There’s someone that is traversing this sand sea at a frightening speed.</p><br/><p>The one’s who passed the gate are: the knight, who I gave a blessing before; and that other person.</p><br/><p>But even if he were to receive the advice of the knight in advance, I don’t understand how he was able to arrive here in less than an hour.</p><br/><p>He easily evaded the Mamonos of the desert, moreover, he didn’t kill a single one of them.</p><br/><p>He plunged into all the traps that I set up and has broke through them.</p><br/><p>His speed didn’t drop, so he is probably unscathed.</p><br/><p>Until now, the fastest record has been 3 days. If made into hours, it would be around 72 hours.</p><br/><p>It is someone that would easily break the notion of records.</p><br/><p>But you know… 1 hour is way too crazy.</p><br/><p>From the gate till here, it would be around 70 km.</p><br/><p>His speed is at 70km per hour while evading all the mamonos and traps, and traversing through the desert with no signs?</p><br/><p>I-I feel like my head will explode.</p><br/><p>Don’t joke around.</p><br/><p>To meet someone like that, I would feel bad for all the previous challengers.</p><br/><p>Okay, in that case… I used a spell formation with all my power and rolled up a massive amount of sand, heated it up to a high temperature, and had it swirl conically.</p><br/><p>It is a barrier that would turn anyone into minces no matter their defense.</p><br/><p>I will have you receive at least this much maliciousness.</p><br/><p>… Well, it would be unfair as a trial to make it too severe, so I made it possible to cancel.</p><br/><p>With this, he will learn a bit about the harshness of the trial.</p><br/><p>Whether it is a hyuman or demihuman, they utilize their given powers too readily. </p><br/><p>And yet, they think that they are worthy of that power.</p><br/><p>I thought that the system Root created about levels in the adventurer guild was also dangerous.</p><br/><p>Power should be something that one obtains after passing through a trial that fits it.</p><br/><p>Giving my blessing to two persons in the present time, I didn’t think this would happen. I need to have him know of this, or my reputation will cry.</p><br/><p>“Well, I can’t deny that I am looking forward to seeing the face of that person.”</p><br/><p>That mutter was my last moment of composure.</p><br/><p>“?!!!!”</p><br/><p>Something pierced through the barrier I created.</p><br/><p>“Impossible… An arm? A cluster of magic power. Is he trying break the barrier by brute force with that thing?!”</p><br/><p>A whole different level of magic power.</p><br/><p>When it touched the barrier, I was able to tell its characteristics.</p><br/><p>It is a hyuman.</p><br/><p>But outside his body, there’s something crazy made of magic power that seemed as if it were made by gathering the magic power of all the people in the world.</p><br/><p>The two arms of that cluster of magic power had thrusted inside the barrier.</p><br/><p>My common sense was crumbling at this very moment.</p><br/><p>Surpassing the magic power amount of a dragon in the body of a hyuman. Even in the Lorel priestesses, this is something that rarely happens.</p><br/><p>As expected, having it break in this way will hurt my dragon pride.</p><br/><p>I place even more power into the barrier.</p><br/><p>The shadow of a person that was slowly advancing, stopped its feet.</p><br/><p>“Eh?”</p><br/><p>The voice of a male.</p><br/><p>From where I am, I am able to pick up his voice, but it seems from his side, he still hasn’t grasped my presence.</p><br/><p>He must have noticed that the density of the barrier increased.</p><br/><p>He is able to bring out such a mass of magic power and stabilize it. He should be able to do this much.</p><br/><p>But…</p><br/><p>“…The pierced place doesn’t return to its original state. The power…is increasing further?! This is, just what in the world am I witnessing?” (Grount)</p><br/><p>“As expected of the last trap. It will be a bother when going back, so let’s tear it off.”</p><br/><p>Muttering this nonchalantly, the man that is wearing a red blazing coat controlled the magic power arms that were piercing through and spread the area in one breath.</p><br/><p>As the master of the spell, I can tell how the composition of the spell is slowly breaking into pieces.</p><br/><p>Sand spinning at high speed and in high temperature. It didn’t serve as an obstacle at all.</p><br/><p>This is…different.</p><br/><p>This isn’t the strength of a person taking the trial.</p><br/><p>There’s no such challenger.</p><br/><p>Could it be, the invasion of a person that is coming here to subjugate me after all this time?</p><br/><p>Since the time Gritonia Empire was made, that hasn’t happened once though.</p><br/><p>Was the blessed Ginebia threatened into guiding him?</p><br/><p>There’s the possibility.</p><br/><p>Even if it’s her, she wouldn’t be able to stop a person like that.</p><br/><p>No.</p><br/><p>I don’t think anyone in the Empire can stop him.</p><br/><p>“…”</p><br/><p>I look at the dispersed barrier with strained eyes.</p><br/><p>I waited inside my den which I made wide and sleep in.</p><br/><p>Now that it has come to this, I have no choice but to meet him myself.</p><br/><p>That is also a part of a superior dragon’s pride.</p><br/><p>He soon appeared.</p><br/><p>His equipment was so light to the point that it was surprising.</p><br/><p>The only thing he had was a bag that seemed to be his luggage. There’s no weapons on his self. His red coat seems to be an armor though.</p><br/><p>He didn’t prepare anything to travel through the desert.</p><br/><p>The presence of a hyuman.</p><br/><p>It is certainly the presence of a hyuman, but it is heavily different from the one I know.</p><br/><p>Thoroughly different.</p><br/><p>“Y-You are the superior dragon Grount?”</p><br/><p>“… That’s right. Do you wish for my blessing?” (Grount)</p><br/><p>“Blessing? No. I just came because of an errand. Grount-san, you are Root’s Oba-san, right?” (Makoto)</p><br/><p>“Root?! Oba-san?!” (Grount)</p><br/><p>Root’s acquaintance?!</p><br/><p>No, more importantly! Oba-san he says?!</p><br/><p>“Uhm, there’s something Root entrusted me with. He said: ‘it would be best to leave it under the care of an Oba-san, so I am counting on you’.”</p><br/><p>“… You said it twice…” (Grount)</p><br/><p>“Hah?”</p><br/><p>Yeah. There’s no need to confirm it.</p><br/><p>He said it twice.</p><br/><p>This boy, he certainly said it twice.</p><br/><p>“If you are an acquaintance of Root, you should at least know that I am not related to *her*, right? In the first place, why do you think that being a superior dragon makes us relatives? It is strange when you think about it, right? If you think about the structure! And yet, you said it twice.” (Grount)</p><br/><p>“Eh? Eh?”</p><br/><p>Even Root only says it once.</p><br/><p>And she apologizes after doing so.</p><br/><p>“I see. You don’t have any intention to apologize, right?” (Grount)</p><br/><p>“Ah, sorry! Frankly speaking, I don’t know much about the manners between dragons. Root only told me to bring this to you, that’s all! If there was any discourtesy in my words…”</p><br/><p>If there was any discourtesy, he says.</p><br/><p>In other words, he doesn’t understand what was the discourtesy.</p><br/><p>Guilty.</p><br/><p>This is not on the level of whether he is an enemy or not.</p><br/><p>Let me teach you the proper way of treating an older lady!!</p><br/><p>Root is also guilty.</p><br/><p>She send such a strange hyuman in.</p><br/><p>She should faint from the agony of the increased work she will get if I am killed by this person!</p><br/><p>I was thinking about being young again, so this is convenient.</p><br/><p>Normally, I had someone who I have blessed to assist me in my suicide, but with this, it will save me the trouble.</p><br/><p>I don’t care anymore.</p><br/><p>In any case, I am angry now.</p><br/><p>I am angry!!</p><br/><p>“Then, I will teach you the etiquette of dragons. Stand upright.” (Grount)</p><br/><p>“Upright? Eh? U-Uwaa!!”</p><br/><p>I let out a roar at the boy that doesn’t seem to understand the situation.</p><br/><p>Most of the hyumans won’t be able to move with this, but as expected, it didn’t work on him.</p><br/><p>As if being pushed, I head to the exit of my shrine.</p><br/><p>A drying breath that snatches away the water, a burning breath that reaches the bone, and the strongest scales prided by the peak of dragons, making it possible to take every attack with my own body.</p><br/><p>I will welcome you with my most difficult trial.</p><br/><p>Under the sunlight that mercilessly shines down, I confronted him.</p><br/><p>◇◆◇◆◇◆◇◆</p><br/><p>“By the way Tomoe-dono, was it really okay to have Waka-sama go by himself?”</p><br/><p>“You are referring to Grount, right? In that case, there’s no problem. That person, even if she is a dragon, she has a quiet personality and doesn’t like fighting. Waka is also pretty polite towards strangers-ja. He will probably not say the prohibited word.”</p><br/><p>A male and female pair were walking together in the streets of the Empire.</p><br/><p>The man was slightly worried, but the woman didn’t seem to be worried at all.</p><br/><p>Tomoe and Shiki.</p><br/><p>Accompanying Raidou, they had come to the Empire. His followers.</p><br/><p>“It is okay if that’s the case though.” (Shiki)</p><br/><p>“That doesn’t matter. Waka will probably be returning by evening after all. So let’s continue our survey, Shiki.” (Tomoe)</p><br/><p>“Tomoe-dono, it seems like you have been in good mood since yesterday.” (Shiki)</p><br/><p>Shiki speaks to Tomoe who was visibly high in spirit.</p><br/><p>“Hmph, you can tell huh. It’s just that Waka did something slightly pleasant-ja yo.” (Tomoe)</p><br/><p>“Waka-sama did? Is it when he spoke to the hero yesterday?” (Shiki)</p><br/><p>“Yeah, at that time-ja.” (Tomoe)</p><br/><p>“Gritonia’s hero, Iwahashi Tomoki. Seeing this Empire that has been spread with the charm disease, leaving aside his ability, it looks like there’s a problem with his character.” (Shiki)</p><br/><p>“That part, Waka gave him a good scolding-ja na. Scolding.” (Tomoe)</p><br/><p>“The details… he didn’t voice it out, right?” (Shiki)</p><br/><p>“I was able to guess it. Really, nice job.” (Tomoe)</p><br/><p>“Is that so. Then Tomoe-dono, from now on…” (Shiki)</p><br/><p>“Umu, Waka also spoke about the atmosphere of the Empire but, you understand, right?” (Tomoe)</p><br/><p>The eyes of Tomoe narrowed slowly.</p><br/><p>“Of course. The situation of the gun development, the details of the hero’s achievements in war. In the remaining time, let’s go collect information.” (Shiki)</p><br/><p>Shiki crooks his mouth into a smile.</p><br/><p>“Then we will divide. First of all, let’s lose the people shadowing us. The appointed time and place, Shiki, don’t get them wrong.” (Tomoe)</p><br/><p>“To tell you the truth, I am slightly interested in the food of the Empire. But I won’t be late.” (Shiki)</p><br/><p>“I don’t think it would rival Asora though.” (Tomoe)</p><br/><p>“Even so, it might help bring out some new ideas. That’s how I think.” (Shiki)</p><br/><p>“Well then.” (Tomoe)</p><br/><p>“We will meet later.” (Shiki)</p><br/><p>With one blink, the figure of those two disappeared from the sight of the people that were silently watching from the shadows.</p><br/>\n</div>"}