{"title": "Chapter 199: The Sea and Makoto are doing well", "id": 199, "volume": 2, "url": "http://boxnovel.org/tsuki-ga-michibiku-isekai-douchuu-chapter-199-the-sea-and-makoto-are-doing-well", "volume_title": "Volume 2", "body": "<h1>Chapter 199: The Sea and Makoto are doing well</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 199: The Sea and Makoto are doing well</p><br/><p>Sponsored Chapter</p><br/><p>Surprise! It was about time to unveil the mystery patch.</p><br/><p>Sponsored chapters are not going to be set to only on Sundays, but will be free. Of course, there will be a obligatory sponsored ones at Sundays, but if we were to continue at this pace in sponsored, I will never be able to finish them.</p><br/><p>And dayum guys, the 600+ comments in 2 days really shocked me!</p><br/><p>Thanks a lot for the continued support!</p><br/><p>“I have been nailed down…”</p><br/><p>The contact of Limia was as expected.</p><br/><p>They unreservedly called me regarding the schedule.</p><br/><p>Come as fast as possible(in the time that Senpai is at Lorel), and my thoughts were splendidly shot down.</p><br/><p>They probably have a lot of things to prepare, so the date and times that were proposed were all reasonable.</p><br/><p>The fastest one will probably have Senpai in Limia already.</p><br/><p>In that case, I feel like I will have Mio stay.</p><br/><p>Luckily, we have the sea, so she probably won’t get bored. That part is a saving.</p><br/><p>“Well, it is good that a day has been decided. It will clear one pain after all.” (Makoto)</p><br/><p>Deliberately voicing it out, I make myself think that something good has happened.</p><br/><p>With this, the troublesome country visits will be over.</p><br/><p>It seems like Rembrandt-san is doing his moves, so the Aion Kingdom isn’t calling me.</p><br/><p>I have interest in Lorel Union, so I actually want to visit it once.</p><br/><p>Maybe because the Goddess is being docile, the Church seems to be docile as well.</p><br/><p>I just have to endure a bit more.</p><br/><p>Even so, the talk finished faster than anticipated.</p><br/><p>The reason was because I compromised fast though.</p><br/><p>I am slightly interested in the details of the growth of Jin’s group, but returning to the Academy is just…</p><br/><p>Yeah, let’s confirm the work in Asora.</p><br/><p>I take out the documents I wanted from the desk.</p><br/><p>Shiki puts together the documents that I should be seeing, so it is a great help.</p><br/><p>“For now, it seems like the races that will be going to the sea have been decided.” (Makoto)</p><br/><p>I turn over the documents.</p><br/><p>This time, before having an interview with me, I had Tomoe and the others do a trial and have them do a survival for a set period of time.</p><br/><p>It may sound excessive when calling it survival, but the point is, it is just to try living there.</p><br/><p>Even if I say sea, the environment is varied, and we will test if the various races are actually able to live in the sea of Asora.</p><br/><p>Tomoe is the one in charge of this trial and she is also the advisor.</p><br/><p>So long as there’s no excessive actions in the period of time she is in charge, she doesn’t need to show herself.</p><br/><p>“It would be ideal if there are races that can accommodate in land as well though.” (Makoto)</p><br/><p>As expected, things won’t go so smoothly.</p><br/><p>The large sized aquatic demonic beasts are far from being able to relate to land.</p><br/><p>And the mermaids are fish at their lower half.</p><br/><p>Even if they are hyuman-like, it is obvious at a glance that even trying to walk would be a difficulty.</p><br/><p>In terms of race, the Lorelei that seem to be a variety of demons have hyuman shaped bodies, so instead of in the sea, they live close to the sea, which makes them able to adapt easily to land.</p><br/><p>The reversed race that has hyuman limbs and fish body are able to run in land as well.</p><br/><p>Because of that, the name of the race is Neptune Sea Lord. I feel like their very existence is a joke already.</p><br/><p>There’s also a race called Sahuagin that is half hyuman-like, and even when it is not their specialty, they are able to move in land.</p><br/><p>About them, what left the most impression was actually the plate that was shining at their head.</p><br/><p>I thought they were kappa. Sea kappas.</p><br/><p>And so, While having the races that can go in both land and water at the port, it would be ideal if they were to interact with the other races that are only able to live in the sea.</p><br/><p>I thought that it would be nice if that port and my house were to interact with a certain town.</p><br/><p>And so, I left the detailed parts to Tomoe and the others.</p><br/><p>“Mermaids, Lorelei, Sahuagin, and Neptunes. Sea horses, Kelpie, Sea Serpents, Blue Moons…” (Makoto)</p><br/><p>When I confirm them in order, I could tell that there were quite a lot.</p><br/><p>There are more than 10 races.</p><br/><p>It is not like they are competing for a spot in the migration, so as long as they are able to adapt to the sea of Asora, I don’t mind having them all migrate.</p><br/><p>And as long as there’s no clear hostility between the races.</p><br/><p>The sea is vast, so they are able to find a place to live anywhere.</p><br/><p>If they are preyed upon, or are about to become prey by the living beings that were originally in that sea, I can just have them retire.</p><br/><p>Will I have to do an interview with all the races, or are all the races going to retire?</p><br/><p>…No, the latter would be problematic, so I want them to do their best.</p><br/><p>◇◆◇◆◇◆◇◆</p><br/><p>A pleasant report came in.</p><br/><p>Almost all the races that are trying to live in the sea are able to adapt to the lifestyle of Asora.</p><br/><p>There were about two races that retired because they felt danger towards the sharks and giant octopuses that were originally there, but it seems like most of the races are able to safely live.</p><br/><p>At this rate, we will be able to obtain residents for both the cold sea and the warm sea.</p><br/><p>Asora has a lot of land compared to the population.</p><br/><p>This also applies to the sea, so if they live in a lot of places and gather information, there’s nothing I would be more grateful for.</p><br/><p>It would be incredibly troublesome if we were to investigate every nook and cranny by ourselves after all.</p><br/><p>“And well, it seems like all in all, there’s no problem. There’s also people that are beginning to communicate with the pre-existing living beings there. The fear we had about quarrels between races has not occurred.”</p><br/><p>With no real problem, Tomoe finishes her report.</p><br/><p>“That’s great. It is regrettable for the races that retired, but tell them that if there’s a time when they need the Kuzunoha Company, we will cooperate.” (Makoto)</p><br/><p>“I have already told them. If a problem were to occur at hyuman territory, we will hear them out.” (Tomoe)</p><br/><p>“As expected. Is Sari doing well?” (Makoto)</p><br/><p>“Because it is her first job, she is full of vigor. There’s no strange movements.” (Tomoe)</p><br/><p>“I see.” (Makoto)</p><br/><p>A few days have passed since my lecture at the Academy.</p><br/><p>The migration test in Asora has been progressing smoothly.</p><br/><p>It is peaceful like the calm of the sea.</p><br/><p>“By the way Waka, I heard from Shiki that the students of Rotsgard have grown quite a lot.” (Tomoe)</p><br/><p>“Hm, ah yeah. It is impressive. Every single one of them have become great. It feels like it would be overdoing it if we were to train them as we first planned, so…I think that it would be okay to let them be on the teaching side.” (Makoto)</p><br/><p>“The teaching side, is it? They will probably come pestering that they want to become even stronger though.” (Tomoe)</p><br/><p>“There’s growth in teaching as well. Also, even if they want to become stronger, they are already the strongest in the Academy, you know? If we are talking about the same year, they are easily the strongest. There’s no need to train them more than this and increase the difference, right? I think that they will be able to contribute plenty enough in a war between hyumans, or against most of any fight against other races.” (Makoto</p><br/><p>“…I see. I am slightly interested, so do you mind if I have Shiki show me the information later?” (Tomoe)</p><br/><p>“Of course it is fine. Just don’t go doing any weird interference with the students, okay? Because you trained Misura, he has learned some weird power after all.” (Makoto)</p><br/><p>“I will be careful.” (Tomoe)</p><br/><p>Seriously.</p><br/><p>Tomoe training Misura became the trigger, and Jin and the others have grown an incredible lot.</p><br/><p>Every one of them learned a special ability fit for them, and made their own trait more prominent, and the result was that they have gotten stronger.</p><br/><p>When they were in Rotsgard Academy, they were originally kids with talent.</p><br/><p>When someone aims high, in a sense, it is normal for them to grow.</p><br/><p>When thinking that way, Shiki and I only helped out in it.</p><br/><p>I will only have the new students increase their levels to where Jin’s group is, and after, I will just let them grow up on their own and they will most likely become plenty strong.</p><br/><p>As a teacher, I have found a standard of how strong I will train my students and am doing well.</p><br/><p>Truly good.</p><br/><p>“Then Tomoe, do you have time now?” (Makoto)</p><br/><p>“Again? I have to look after the races that want to migrate, so I think that it would be hard to accompany you today.” (Tomoe)</p><br/><p>“…I see.” (Makoto)</p><br/><p>Too bad.</p><br/><p>“Reproducing the environment of Waka’s world tired me a lot after all. The next time I am available would be the day before Waka leaves for Limia. Sorry.” (Tomoe)</p><br/><p>“Understood. I know that I am asking for too much when you are busy after all. It is fine.” (Makoto)</p><br/><p>“…Ah, Waka, do you have time?” (Tomoe)</p><br/><p>Tomoe?</p><br/><p>Tomoe suddenly makes a bitter face as she asks me.</p><br/><p>Ah, thought transmission huh.</p><br/><p>I want to learn how to skillfully utilize thought transmission while speaking as well.</p><br/><p>It is hard to concentrate in both of them.</p><br/><p>If I am able to do something about it by practicing, I should try.</p><br/><p>“What? Is it thought transmission?” (Makoto)</p><br/><p>“Yes, it was from Lime.” (Tomoe)</p><br/><p>“Heh~, he was together with Senpai and her group, right? What did he say?” (Makoto)</p><br/><p>“…Yeah, it wasn’t anything big. It seems like that purple cloud didn’t disappear completely with what we did the other day.” (Tomoe)</p><br/><p>“…As I thought. I felt like the resistance was way too thin. It hasn’t been that long since then. Is it already doing evil?” (Makoto)</p><br/><p>“Yes. And it seems that Lime and Hibiki are currently dealing with it, but it seems like it is not going well.” (Tomoe)</p><br/><p>“Even Hibiki-senpai?” (Makoto)</p><br/><p>“Seems so.” (Tomoe)</p><br/><p>I can’t believe it.</p><br/><p>Even though it is Hibiki-senpai.</p><br/><p>Even though she should be able to do something about an opponent of that level.</p><br/><p>Is it because her methods of long ranged attacks are low?</p><br/><p>She does use a sword after all.</p><br/><p>“I said that I would be helping Lorel, and yet, it was so half-baked. That’s not cool. Troubling Senpai would be bad, so I will do something about it.” (Makoto)</p><br/><p>“…Can I leave it to you?” (Tomoe)</p><br/><p>“Yeah. Just that, I think it will be useless to deal with that group with the previous method. The response was thin after all. I do have something in mind, but I have to get relatively close or I feel like it won’t work.” (Makoto)</p><br/><p>I would like to at least get an approximate location of it.</p><br/><p>“Then how about using the strategy that the winged-kin utilized in last time’s mock battle with Waka? The one about sharing information with a third party from a faraway location.” (Tomoe)</p><br/><p>“Ah, I see. It will definitely be useful. Let’s go with that. Then I will have to move to a location where I can aim.” (Makoto)</p><br/><p>“There’s a mountain with good view. It has a bit of distance from the location, but if it’s Waka, there shouldn’t be any problems, right?” (Tomoe)</p><br/><p>“I do have Azusa and magic after all. I actually don’t have to worry about range.” (Makoto)</p><br/><p>“Well then, go ahead. I will send the winged-kin there, so while confirming with the information share, try to tackle it.” (Tomoe)</p><br/><p>“Understood.” (Makoto)</p><br/><p>“Waka.” (Tomoe)</p><br/><p>“What?” (Makoto)</p><br/><p>“Lime and the hero are floating close to that area, so I don’t mind if you gift them a few shots, you know? Especially to Lime.” (Tomoe)</p><br/><p>“Why do I have to do something like that to Lime?” (Makoto)</p><br/><p>Calling me to a stop when I was about to enter the created gate with Azusa in one hand, she said something strange.</p><br/><p>“…That’s because he has slacking slightly you see, so I thought that it would help for discipline.” (Tomoe)</p><br/><p>“You say some scary things.” (Makoto)</p><br/><p>“It could serve as good motivation to Hibiki, you know?” (Tomoe)</p><br/><p>“I don’t want to. If it gets discovered later, just how do you think we would be able to apologize? Seriously.” (Makoto)</p><br/><p>“…Have a safe trip.” (Tomoe)</p><br/><p>“Yeah, I will return soon.” (Makoto)</p><br/><p>The other side of the gate was as stated, the summit of a mountain.</p><br/><p>Truly a panorama of 360° degrees.</p><br/><p>What a superb view.</p><br/><p>And in the faraway sky, there’s one clearly visible thing.</p><br/><p>I could tell that that purple stain was the problematic cloud.</p><br/><p>“It has become quite big. It is not as big as before though.” (Makoto)</p><br/><p>I prepare my bow.</p><br/><p>I set an arrow.</p><br/><p>The target cloud is quite a distance away, but maybe because I am using magic simultaneously since coming to this world, I don’t feel like I will miss.</p><br/><p>I have stopped worrying about whether it will reach or not.</p><br/><p>If I can see it, I can hit it.</p><br/><p>I am beginning to naturally think in this way.</p><br/><p>Just that, in the case of that cloud, it is a united form of many individuals, so I feel like I can’t consider it as just a single enemy.</p><br/><p>It is something that I felt after reflecting on last time though.</p><br/><p>“Now then, the link with the winged-kin…” (Makoto)</p><br/><p>While I wait for the arrival of the winged-kin, I could tell that they appeared at a place a bit further away from the purple cloud.</p><br/><p>Two huh.</p><br/><p>A thought transmission soon came from them, and asked for confirmation if it’s okay to send information.</p><br/><p>Of course, I said okay.</p><br/><p>After finishing a short thought transmission and waiting for a bit, a strange scenery as if looking at the purple cloud from a closer place appeared in my mind.</p><br/><p>What was in my eyes was the cloud far in the distance, and the gap between distances made me feel slightly nauseated.</p><br/><p>It was as if looking at it from afar, and at the same time, looking at it from a monitor.</p><br/><p>But if I get used to it, it might be convenient.</p><br/><p>Thanks to it, I was able to clearly tell where Hibiki-senpai, her comrade magician, and Lime were floating.</p><br/><p>‘I will give you the coordinates’, is the follow-up report that came from the winged-kin.</p><br/><p>The scenery of where the cloud and Senpai’s group were, was shown to me like a grid, and several numbers appeared.</p><br/><p>Hmph~.</p><br/><p>So this is how the winged-kin exchange information with each other and getting their aim huh.</p><br/><p>It is certainly easy to understand.</p><br/><p>It is not that necessary for me who snipes by relying on my senses, but I think that it is an advantage to erase the measurement errors in the attack.</p><br/><p>I give my thanks to the winged-kin and tell them to be in standby.</p><br/><p>“I will pierce that purple cloud in my sight. At that scenery that’s in my mind, I only pierce the cloud.” (Makoto)</p><br/><p>It was a mysterious feeling.</p><br/><p>It was the same sensation as aiming straight.</p><br/><p>But at the same time, it was as if I was placing my aim at the scenery in the monitor.</p><br/><p>In my time at Japan, this would be an incredible stunt, and yet, I was able to lock the target.</p><br/><p>No, not yet.</p><br/><p>It is no good to just avoid Senpai’s group.</p><br/><p>And it is also no good to just pierce through the part that seems to be the cloud’s core.</p><br/><p>More, more, more, more…</p><br/><p>Concentrating in each live that comprises the cloud, I target everything of it, all the links.</p><br/><p>Not shooting vaguely.</p><br/><p>And for that sake…</p><br/><p>“…”</p><br/><p>While maintaining my concentrated state, I lower the arrow I set up.</p><br/><p>This time, I won’t use this one.</p><br/><p>What I need right now is not an arrow, but a catalyst for my spell.</p><br/><p>To pierce through several targets at once, I need both archery and magic.</p><br/><p>From the variety of arrows that I had the Eldwas make, I choose an arrow that has the most ability to inject magic power in, and once again, I set it up.</p><br/><p>An amber colored arrow.</p><br/><p>“Avoiding Senpai’s group, I will pierce the core, and kill all the clouds in a chain.” (Makoto)</p><br/><p>The cloud that appears in my mind is being filled with countless numbers of aims.</p><br/><p>I can do it.</p><br/><p>I silently release my arrow.</p><br/><p>For a while, the arrow continued on as a normal arrow, but the amber arrow soon broke, and in exchange, it turned into a big mass of light that could take up the whole field of vision, and flew towards the purple cloud.</p><br/><p>And then, after a while, the mass of light bursts.</p><br/><p>Okay, I did it!</p><br/><p>Avoiding Senpai’s group, it pierces through the core of the cloud, and at the same time, it pierced through the scattered portions that I placed my aim on. I could tell that it was effective.</p><br/><p>I have killed it.</p><br/><p>Different from last time, this time I actually felt it.</p><br/><p>“Fuh~, I have defeated it.” (Makoto)</p><br/><p>It seems like the winged-kin have witnessed it as well.</p><br/><p>They face this way and are flying here.</p><br/><p>Even though one is carrying the other, they are incredibly fast.</p><br/><p>Thanks to their help, my possibilities with the arrow increased more.</p><br/><p>I am happy.</p><br/><p>I felt like I once again confirmed that the bow is something irreplaceable for me.</p><br/>\n</div>"}