{"title": "Chapter 196: Unknown Sky", "id": 196, "volume": 2, "url": "http://boxnovel.org/tsuki-ga-michibiku-isekai-douchuu-chapter-196-unknown-sky", "volume_title": "Volume 2", "body": "<h1>Chapter 196: Unknown Sky</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 196: Unknown Sky</p><br/><p>Happy Lunar Year everyone!</p><br/><p>Sari was looking at the stars while feeling deep unpleasantness for being unable to arrange her mixed thoughts.</p><br/><p>Her eyes were distant as she kept looking at the stars.</p><br/><p>“The scale is one, two, three, or maybe four…no, that’s not it.”</p><br/><p>She mutters lowly.</p><br/><p>Without being heard by anyone, those words fade and vanish.</p><br/><p>“Even though what I have to do hasn’t changed, I can’t move.”</p><br/><p>For her, this was something unusual.</p><br/><p>Think and act.</p><br/><p>She has never hesitated in acting.</p><br/><p>Abandoning her own position till now, she easily did something like engraving the slavery stigma onto her body, and the actions following that.</p><br/><p>And this here is the result of it.</p><br/><p>In the next move, she has to enter deep into Raidou’s domain. And yet, in this place that he has brought her into himself -In Asora-, Sari has been unable to make contact with Raidou properly.</p><br/><p>The actual state of affairs is that the time she has been staring at the starry sky has increased.</p><br/><p>“Could it be that Raidou is the king of a different world?” </p><br/><p>Sari looked at the starry sky and thought this.</p><br/><p>It is heavily different from how Raidou himself sees it, but the understanding of Sari wasn’t that far from reality.</p><br/><p>He has a space called Asora.</p><br/><p>That space has been expanding in size, and currently, it has a vast land, sky, and sea. It is already in a state where it is fitting to call it a ‘world’.</p><br/><p>And one can only enter Asora with them as intermediaries, and they themselves can enter and exit as they want.</p><br/><p>From the standpoint of Sari who doesn’t know the circumstances, Raidou is the king of a parallel world, and she is a guest of his world. Without any decorated words, she can even be considered an ‘intruder’.</p><br/><p>His attitude of antagonising the Goddess could now be understandable in her view.</p><br/><p>But if that’s the case, the fact that ‘Raidou is a hyuman’, would be a contradiction in itself, is how Sari thought.</p><br/><p>Or could it be that there’s hyumans in parallel worlds as well, and this world is under the protection of an existence like that of a Goddess?</p><br/><p>If that’s the case, why is there no other hyuman in this world called Asora?</p><br/><p>What about an existence that is related to that Goddess?</p><br/><p>For a while since she is been here, Sari has been flooded by this thoughts that had no answers, and was unable to act.</p><br/><p>“Anyways, becoming a friend of Raidou is the first priority. If I become a close friend of his…Raidou probably wouldn’t do ‘something as meager’ as turning his fangs towards the demon race…”</p><br/><p>Raidou ‘always’ moves by his emotions.</p><br/><p>That’s what Sari guesses.</p><br/><p>That’s why, she will be by his side, and if she is able to change those emotions of his, she will be able to obtain safety.</p><br/><p>She has been calmly looking at Raidou when she was outside, and that’s why, she reached this conclusion and acted in this way. It could be said that she got a good grasp on him.</p><br/><p>…It can’t be considered a perfect analysis though.</p><br/><p>In Sari’s view, it was a scary result.</p><br/><p>If imprudently dealt, Raidou might not even care about the whole picture, and destroy a country and race just because of a reason like being asked by someone close to him.</p><br/><p>If someone with a deep hatred towards the demon race becomes a close friend of his, or a lover, there’s a possibility of Raidou turning hostile towards the demon race.</p><br/><p>Things like diplomacy, period, or economics; those kind of things would hold no weight.</p><br/><p>If even Raidou turns into an enemy, added with the heroes and the Goddess, the demon race will be exterminated.</p><br/><p>Sari was sure of this.</p><br/><p>Looking at Asora, she thought exactly like this.</p><br/><p>“Totally self-sufficient. Even though powerful races are mixed here, they have an army that works together splendidly well. They clearly possess crafts that surpass ours by several steps. A teleportation ability that not only makes it possible for them to attack any place without the need for a march, it can also be used for retreats. Added to that, there’s the abnormally high individual battle power of the close aides of Raidou.” (Sari)</p><br/><p>If she had to put out a weakness of them, it would be their numbers.</p><br/><p>Asora doesn’t have that much population.</p><br/><p>For a fertile land, it has a low population to the point that it was strange.</p><br/><p>Sari still didn’t know of the reason why.</p><br/><p>But even the hyumans that are the strongest force in her world, would they really fight against them just because they are winning in numbers, when all of these disadvantages are lined up?</p><br/><p>If her father the Demon Lord had accurate information of Raidou and Asora, what would he have done? She tried to imagine it.</p><br/><p>“Even if it’s slightly disadvantageous, he would probably make an alliance. Fufufu, it doesn’t sound like it would be a talk to a company, but a talk between countries.” (Sari)</p><br/><p>By the way, if Sari were the Lord, she would have wished to migrate into this Asora.</p><br/><p>But that’s because she still hasn’t been in a position of responsibility within the race, and he is a rare type of hyuman that the demon race doesn’t hate.</p><br/><p>As long as Raidou acknowledges it, it would be a great proposal that would lead to the least sacrifices, and would bring a peaceful future.</p><br/><p>In a sense, it would be a proposal that would be ideal for the future of the race.</p><br/><p>But…</p><br/><p>“Without doubt, there will objections from the majority, moreover, there’s the danger of me being assassinated for it. The hatred for hyumans…and the will of the demon race. If this is the will of the demon race, his Majesty would oppose this proposition even if it is the path to destruction.” (Sari)</p><br/><p>Sari had a sad expression in her face.</p><br/><p>Thinking about her father, this is something that comes into her mind at times; just what kind of existence is an excelling Lord?</p><br/><p>There’s probably several different types, but the Demon Lord Zef is the type of Lord that would make reality the demon race’s will. </p><br/><p>For that sake, he would easily shelve his own will.</p><br/><p>In that sense, the actions of Zef are incredibly simple.</p><br/><p>Pass judgement to the hyumans, and prosperity to the demon race.</p><br/><p>That’s all.</p><br/><p>And those two come in a set.</p><br/><p>It can’t be toppled.</p><br/><p>Sari does think that having the demon race prosper and triumphing over the hyumans is one way of revenge, but most of the demons don’t think that way.</p><br/><p>They want the blood of hyumans.</p><br/><p>“If Raidou were to approve of the demon race’s objective of passing judgement to the hyumans, there would be a different path. Just that, the chances of it are way too low.” (Sari)</p><br/><p>In the end, she couldn’t put anything in order.</p><br/><p>It was at that moment…</p><br/><p>“Sari, are you available now?”</p><br/><p>“!! Yes, go ahead, Waka-sama.” (Sari)</p><br/><p>Sari heard a voice there’s no way she would hear wrong.</p><br/><p>By the way, the one who opened the door was the owner of the voice.</p><br/><p>The lifelong master of Sari; the person who she bounded her own stigma with.</p><br/><p>No one was accompanying him today.</p><br/><p>Without knowing about her worries at all, Raidou naturally entered her room.</p><br/><p>“You don’t look well. Are you okay?” (Raidou)</p><br/><p>“I’m okay. I am just slightly in disorder because I am still not used to my surroundings. I am sorry for making you worry. Is there something you needed?” (Sari)</p><br/><p>“I wanted to have Sari work a bit in something, you see.” (Makoto)</p><br/><p>“Just say the word. Giving this much hospitality to a slave like me, there’s no need to be reserved.” (Sari)</p><br/><p>These were the true feelings of Sari.</p><br/><p>As a slave, Sari has received a better treatment than what she was prepared for.</p><br/><p>They are not forcing her into any work, so right now, the treatment they are giving her is like that of a guest.</p><br/><p>It was temporary, but she was still in an unbelievable situation.</p><br/><p>“I see. Tomorrow morning, there’s a race I want you to meet. Meet them, and well, I want you to hear their requests and what they have to say.” (Makoto)</p><br/><p>“I don’t mind but, is that a job that’s okay for me to be doing?” (Sari)</p><br/><p>Even with this light explanation, it was clear that this had an atmosphere different from that of a miscellaneous job.</p><br/><p>Because of that, Sari asks to confirm.</p><br/><p>“Yeah. We are low in people, and Shiki did say that you seem to have past knowledge.” (Makoto)</p><br/><p>“…Meaning that I can be useful, right? Understood. I am happy that you believe in me enough to give me work.” (Sari)</p><br/><p>“Because you can’t betray us, right? With the ritual and all that.” (Makoto)</p><br/><p>“Yes. I don’t have the intentions to betray you either, and I can’t betray you. Even so, you don’t have any suspicions that there may be some sort of loophole. I am truly lucky that the person I have decided as my master is an open-minded person.” (Sari)</p><br/><p>“…Loophole huh. I didn’t even think about it. Because there’s no need to think about it, right?” (Makoto) </p><br/><p>“Is that so?” (Sari)</p><br/><p>“Yeah. Because if you do something like that, Sari would be my enemy, right? You must have some reason to work under me with the resolve to die, so something as careless as that, the intelligent Sari wouldn’t do that.” (Makoto)</p><br/><p>“…”</p><br/><p>“I am not good at thinking that much. Betrayers are enemies, contributors are allies. That’s how I think, and that’s all. I want to go simple.” (Makoto)</p><br/><p>What a scary thing to say, is what Sari thought.</p><br/><p>“For example; in the case that it looks like a betrayal when it was actually for the good of Waka-sama?” (Sari)</p><br/><p>“If I notice that it is good, then an ally; if I don’t notice it, enemy. Simple, right?” (Makoto)</p><br/><p>“…”</p><br/><p>Raidou nonchalantly said this.</p><br/><p>On the other hand, Sari was speechless.</p><br/><p>She added into her data that he is someone with a thought pattern that’s scarier than she originally thought.</p><br/><p>“Hm? What’s wrong?” (Makoto)</p><br/><p>“Nothing. I will keep those words in mind.” (Sari)</p><br/><p>“…I see. And so, about the race I want you to meet.” (Makoto)</p><br/><p>“Yes?” (Sari)</p><br/><p>“There’s a race that wants to migrate to this place you see, a race called Lorelei. It seems like they were originally from the demon race, but as they were living in the sea, it seems like they have become a different race and things changed. Have you heard about it?” (Makoto)</p><br/><p>“…Lorelei?!” (Sari)</p><br/><p>“Good, it looks like you know them.” (Makoto)</p><br/><p>“I have heard that in a long past, there was a household of the demon race that was called Lorelei that had escaped into the sea and disappeared.” (Sari)</p><br/><p>“Then it is probably them. Their outward appearance is similar to the demon race after all. It seems like they were in quite the cold sea, but because of a slight connection, there was talk about having them migrate here, you see.” (Makoto)</p><br/><p>“Migrate?!” (Sari)</p><br/><p>“And so, there’s going to be an interview. But there’s the need to arrange the information of the race and the requests the other side has beforehand, right? I am counting on you for that.” (Makoto)</p><br/><p>“…This place accepts the migration of a race?” (Sari)</p><br/><p>“Yeah, well, depends on the situation though. This time it is applications for people that live in the sea, it seems.” (Makoto)</p><br/><p>“It seems? Wasn’t Waka-sama the one who ordered it?” (Sari)</p><br/><p>“Ah, would that be the case? Asora is big after all. Even if everything moves as I order, there’s just no time. The people that want to live here can participate in an interview by all means, is how I feel. But in reality, there’s a lot going on, and it can’t go smoothly like that.” (Makoto)</p><br/><p>“…Is that so.” (Sari)</p><br/><p>“Sari, you can have a house made somewhere eventually. If you want to, after the migration of the Lorelei is decided, it should be fine to live with them. It seems like you were the same race in the past after all.” (Makoto)</p><br/><p>Raidou continued making carefree statements.</p><br/><p>But he is the king of this Asora.</p><br/><p>“I-I see… Uhm! About the investigation, I will properly do it. Is it okay to begin starting tomorrow?” (Sari)</p><br/><p>“Yeah, I am counting on you. I will place a Gorgon and an Orc to assist you, so go at it without pressure.” (Makoto)</p><br/><p>(…Is it for surveillance? Or is it really out of goodwill? This plan is probably from someone else, so there’s that chance, and it makes it hard to tell.) (Sari)</p><br/><p>“Sari?” (Makoto)</p><br/><p>“Ah, sorry! Thank you for your kindness, Waka-sama.” (Sari)</p><br/><p>“Well then, good night.” (Makoto)</p><br/><p>“Good night.” (Sari)</p><br/><p>Sari still doesn’t know Raidou’s real name.</p><br/><p>She hasn’t been told.</p><br/><p>Leaving aside Raidou himself, she is in a situation where her surroundings don’t trust her.</p><br/><p>She doesn’t know that reality, but she does feel like she is being tested.</p><br/><p>Even if she is ready or not, Sari thought that from now on, it was a critical moment for her.</p><br/><p>◇◆◇◆◇◆◇◆</p><br/><p>“Ah, Shiki. About the preliminary investigation, I have requested it from Sari just like you told me.” (Makoto)</p><br/><p>“Thanks, Waka-sama. If we don’t make those kind of people work, it would be a bad example. You have been a big help.” (Shiki)</p><br/><p>“I was being reserved because she was a girl after all. Because you told me, it served as a chance. The one that should be giving his thanks is me.” (Makoto)</p><br/><p>“I am grateful to hear that.” (Shiki)</p><br/><p>“By the way, what’s that?” (Makoto)</p><br/><p>After returning from asking Sari to investigate the Lorelei, I met with Shiki and follow his gaze, and there, I saw Ema and the Al-Elemera.</p><br/><p>Just that, the Al-Elemeras that are always flying around, are now on the floor.</p><br/><p>What a rare sight.</p><br/><p>Reflexively, I ask Shiki for an explanation of the situation.</p><br/><p>“Ah, just like you see. The Al-Elemera are, how to say it, partly similar to Waka-sama.” (Shiki)</p><br/><p>“Ehm…” (Makoto)</p><br/><p>I couldn’t understand the meaning of Shiki’s words.</p><br/><p>“Looking for a place to live in, they were strolling the forest, and in the very first day, they broke onto the den the wolves live in.” (Shiki)</p><br/><p>“…Uwaaa” (Makoto)</p><br/><p>All of a sudden they were at that place huh.</p><br/><p>What an unlucky bunch.</p><br/><p>Ah, they are indeed similar to me in that part.</p><br/><p>“They were splendidly scattered and are now like this. Not everyone can cut through their bad luck like Waka-sama does after all. Well, it can be said that they are normal.” (Shiki)</p><br/><p>“Now that I look properly, they are doing dogeza. Ah, Ema did say something like that. I see…the king and the important people are doing dogeza huh.” (Makoto)</p><br/><p>“No, all the race is.” (Shiki)</p><br/><p>“…Quite a big part was caught by the wolves huh.” (Makoto)</p><br/><p>Their numbers are a lot less than when I saw them last time.</p><br/><p>The wolves against them wouldn’t even amount to a fight.</p><br/><p>“They have been scared witless and have run back here.” (Shiki)</p><br/><p>The wolves of Asora are crazy strong.</p><br/><p>No, it seems like the living beings of Asora in general are quite strong. The carnivorous beasts are especially strong within that group.</p><br/><p>Currently, the wolves are in the strongest class.</p><br/><p>If it turns into a serious fight with them, even Orcs and Lizardmen might be in danger. </p><br/><p>They are like experts in forest and group fights.</p><br/><p>…The first time I encountered them, I was truly relieved that I was sturdy.</p><br/><p>Also, I was deeply moved when I was able to speak with the wolves.</p><br/><p>Because of reasons, I am the only one that’s able to though.</p><br/><p>Well, wolves are intelligent, so even without speaking, they are able to communicate with their actions.</p><br/><p>They properly give warnings.</p><br/><p>The problem is if the other side complies with those warnings.</p><br/><p>And it seems like the Al-Elemera weren’t able to do that.</p><br/><p>“…I wonder if Ema will forgive them.” (Makoto)</p><br/><p>“Even if she does, the Al-Elemera will probably not be able to lift their heads to Ema anymore.” (Shiki)</p><br/><p>“Now that you mention it Shiki, it wasn’t Al-Efemera.” (Makoto)</p><br/><p>“My apologies. Remembering the names of something like flying insects, is pretty difficult huh.” (Shiki)</p><br/><p>He easily admitted it.</p><br/><p>He didn’t even try to smooth it over.</p><br/><p>“Even though they are feisty, their impression is weak after all.” (Makoto)</p><br/><p>“Seriously.” (Shiki)</p><br/><p>“Ah, by the way, did you hear the talk about what they said of their forest?” (Makoto)</p><br/><p>“If I remember correctly, it was done in by a purple cloud.” (Shiki)</p><br/><p>“Do you know the details?” (Makoto)</p><br/><p>“Yes. It is a big disaster, but it is a phenomenon that happens pretty often in the wastelands. Thick accumulated dark purple clouds bring about strong rain and it fills the land in poison.” (Shiki)</p><br/><p>A cloud that rains down poison huh.</p><br/><p>Sounds dangerous.</p><br/><p>I am glad I didn’t encounter that when I was in the wasteland.</p><br/><p>When he says thick and accumulated, does he refer to a form like that of a cumulonimbus cloud?</p><br/><p>If that’s in purple color…it would have quite the intensity.</p><br/><p>“That’s troublesome.” (Makoto)</p><br/><p>“It is only possible to take refuge, so things like bases that have a set location would be completely wiped out. Just that…” (Shiki)</p><br/><p>Shiki who was explaining, slightly hesitates in saying the next.</p><br/><p>“Just that?” (Makoto)</p><br/><p>I urge him to continue.</p><br/><p>“I heard this from Tomoe-dono, but that purple cloud isn’t actually from the weather; it is actually a living being.” (Shiki)</p><br/><p>“Living being? A cloud is?” (Makoto)</p><br/><p>That’s hard to believe.</p><br/><p>“She said they were a group of small gas living beings. Normally, they are not much of a threat, but when it surpasses a set number of them, they grow bigger in a breath and bring about disaster. As expected of someone that has lived a long time, she has quite the vast knowledge.” (Shiki)</p><br/><p>“A gas living being. As I thought, it just doesn’t ring well.” (Makoto)</p><br/><p>“But being a living being means it has life force, so in other words, I thought that it might be possible to kill them or scatter them.” (Shiki)</p><br/><p>“I see. It is certainly true that if we kill the living, they will stop.” (Makoto)</p><br/><p>“But well, they are special beings that move in group, so if they are a gas type where each one is as small as a grain, trying to kill them might not be realistic. It doesn’t have much relation to Asora in the first place, so I don’t think there’s much need to research it.” (Shiki)</p><br/><p>“I want to see it at least once. How about you, Shiki?” (Makoto)</p><br/><p>“To tell the truth…I am also interested. There’s a mountain of work to do, so right now I can’t move though.” (Shiki)</p><br/><p>“Hm…in that case, how about asking Tomoe and Mio to bring a sample?” (Makoto)</p><br/><p>“It seems like the two of them are busy as well, so…how about asking the Winged-kin? It seems like they haven’t heard of it, but maybe they will be able to bring new information of it.” (Shiki)</p><br/><p>“As expected of Shiki. Yeah, let’s try that!” (Makoto)</p><br/><p>If it has an interesting special characteristic, I might be able to use it in the lectures of the Academy.</p><br/><p>In the case that it is hard to utilize, it would be biohazardous, so I will refrain from using it.</p><br/><p>Even if there’s still a brief time before going to Limia, I still have to do the things I can do at Asora and the Academy.</p><br/><p>“But I think that it will be impossible to utilize it in the lectures of the students.” (Shiki)</p><br/><p>“…As expected of Shiki. Wait, since when did you learn to read minds?!” (Makoto)</p><br/><p>“Guessing what my master thinks, is a basic skill of a butler; is what Morris-dono said, so I tried learning it.” (Shiki)</p><br/><p>It is not ‘I tried learning it’.</p><br/><p>That’s normally not possible.</p><br/><p>“You are a diligent one, Shiki.” (Makoto)</p><br/><p>“I am honored.” (Shiki)</p><br/><p>‘Maybe I should just throw all the classes in the Academy to Shiki’, is what I slightly thought.</p><br/>\n</div>"}