{"title": "Chapter 193: Gift from a God", "id": 193, "volume": 2, "url": "http://boxnovel.org/tsuki-ga-michibiku-isekai-douchuu-chapter-193-gift-from-a-god", "volume_title": "Volume 2", "body": "<h1>Chapter 193: Gift from a God</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 193: Gift from a God</p><br/><p>“Good morning.”</p><br/><p>As soon as I woke up, I did my daily bow shooting and return to the mansion. At the entrance, there was Tomoe and Shiki.</p><br/><p>Maybe because of the after-effects of depleting a high amount of magic power, my head was a bit heavy.</p><br/><p>When I was pulling my bow, I felt refreshed, but when I finished, that sluggish sensation returned.</p><br/><p>While I was greeting the two, my head went round and round and there was no change.</p><br/><p>“Good morning, Waka. It looks like your complexion is still not that good but…could it be that for Waka, pulling the bow works as a medicine?” (Tomoe)</p><br/><p>“Good morning, Waka-sama.” (Shiki)</p><br/><p>“Instead of calling it medicine, it is more like a part of me. I was told that it was okay to not hold back after all.” (Makoto)</p><br/><p>I look at the bow in my hands and a wry smile appears in both of their faces.</p><br/><p>“The classes are tomorrow, is what I have heard but, are you heading somewhere today?” (Shiki)</p><br/><p>“…No, I still haven’t decided yet. I have something to take care of in Rotsgard, so I was thinking about showing my face in the store, but…I think that’s all I have in my plans.” (Makoto)</p><br/><p>“Then can you accompany me for a bit? There seems to be a small change in Asora you see.” (Tomoe)</p><br/><p>“…In that case, I will change quickly. Mio is already there?” (Makoto)</p><br/><p>I ask Tomoe as we walk the corridor.</p><br/><p>“No, she has unexpectedly woken up early you see. She said that she will be checking the bowl and has gone to the Eldwas’ furnace.” (Tomoe)</p><br/><p>“Bowl…ah, the cooking one. Ceramics have already been completely incorporated in Asora huh. I thought it would end up as a hobby for only a part of them, that’s unexpected.” (Makoto)</p><br/><p>I had the Eldwas make a furnace and have them practice ceramic.</p><br/><p>Of course, it was the proposal of Tomoe.</p><br/><p>It is quite a while back, but the pottery that was created from the ceramic was liked by the people of Asora.</p><br/><p>Interestingly, the Highland Orcs, Mist Lizards, Arkes, Gorgons, and the Winged-kins; in all the races, there were people that showed interest in it.</p><br/><p>In Asora where metallic and wooden tools prevailed even in tableware, lately, it has been ceramics in all.</p><br/><p>It has become natural to make the tablewares that one will be using on their own.</p><br/><p>I returned to my room and finished changing, and once again follow the two.</p><br/><p>Breakfast will be for later.</p><br/><p>If something has happened in Asora, I have to know swiftly.</p><br/><p>“Ceramics serve as greetings from the Company, in negotiations, and even for souvenirs. It is truly convenient. Seeing that there’s currently no products similar to others, it seems like everyone is adhering to reproducing it by magic. It is a grateful thing for us that it is showing worth, but, although it is true that they are not teaching the manufacturing methods, they are not trying to hide it at all. How idiotic.” (Shiki)</p><br/><p>When we grouped up again, the conversation was still about ceramic.</p><br/><p>Shiki was prioritizing the ‘worth’ of ceramic.</p><br/><p>Maybe that’s why he has begun giving them away in negotiations and important customers as gifts.</p><br/><p>Lately, this has also been known around as a defining product of the Kuzunoha Company.</p><br/><p>…There’s also talk that it is being sold at high prices in the black market.</p><br/><p>I think that it won’t be long for Limia and Gritonia to begin making them as well though.</p><br/><p>Also, Lorel has the knowledge of our world as well, moreover, there’s already people putting it into practice, so there should be no reason to be getting this much attention.</p><br/><p>Yeah.</p><br/><p>Just like how Shiki said, we are not making obvious the manufacturing method, but we are not hiding it either.</p><br/><p>That’s why I thought it was strange that it hasn’t been copied till now.</p><br/><p>Even in the store, the Eldwas, Forest Ogres, and Shiki himself were distributing the bowls they made to the customers.</p><br/><p>It is limited to a number of important customers is what I told them, and the others, I left it to their own discretion.</p><br/><p>By the way, in terms of how well they are made, I think that the ones the Eldwas make are number one, but for some reason, the ones that Akua, Eris and Shiki worked on, have more popularity.</p><br/><p>Maybe that’s why the Eldwas had their competitive spirit lit on and increased their own skills, and it seems a portion of the dilettantes assessed them highly.</p><br/><p>“Well, in given time, it will circulate to the Empire and the Kingdom, won’t it? There’s the hero there and all.” (Makoto)</p><br/><p>“Right. Well, it is already pretty well-known that it is our style anyways. It won’t really bother us.” (Shiki)</p><br/><p>“Right. Then Tomoe, what was that about a change?” (Makoto)</p><br/><p>“Yes, according to the Winged-kin…it seems like at the northeast, a giant lake can be seen.” (Tomoe)</p><br/><p>“Lake?” (Makoto)</p><br/><p>Does that mean the terrain has increased?</p><br/><p>But I don’t have more followers.</p><br/><p>It is way too short of a time for a lake to have formed naturally, but if it is Asora…it might be possible?</p><br/><p>Ah, they did say it was giant, so even in Asora, that wouldn’t happen.</p><br/><p>“Yes, they said that it was the first time they have seen a size like this, and that they can’t see the end of it. Everything is water, and that new scent was carried by the wind, they said. We won’t know until we actually see it ourselves though.” (Tomoe)</p><br/><p>“So big you can’t see the end of it, and a new scent? Could that possible be…” (Makoto)</p><br/><p>“Yes, I also thought of the probability. And so, I was bringing Shiki to check it out and met with Waka.” (Tomoe)</p><br/><p>“Lately, I have been going with Mio-dono to the port city when there’s time, so I am already used to seeing the sea.” (Shiki)</p><br/><p>Shiki speaks about a port city.</p><br/><p>As expected, the two thought the same as I.</p><br/><p>“Sea huh.” (Makoto)</p><br/><p>“It can be taken that way. And in reality, when I asked the Winged-kin if it was the sea, they asked me what was that.” (Tomoe)</p><br/><p>“But if it’s the sea, Waka-sama hasn’t gotten a new follower, and I don’t think Asora has expanded for no reason. It might be some sort of sign.” (Shiki)</p><br/><p>That’s true.</p><br/><p>Until now, Asora has been increasing its size depending on my increase in magic power.</p><br/><p>But it hasn’t made any big changes in topography.</p><br/><p>Those kind of cases occur when a new follower like Mio and Tomoe get added to the team.</p><br/><p>The biggest change lately would be…the addition of Sari.</p><br/><p>She is the first demon element here, but she doesn’t have much power, so I don’t think this place would change much just because she was added.</p><br/><p>Demi-humans, Mamonos, and hyumans who have more power than her have entered, and it hasn’t shown much change, so the chances are low.</p><br/><p>“Anyways, I want to confirm it quick. Tomoe, you know where it is, right?” (Makoto)</p><br/><p>“Of course. Just in case, I have told everyone not to get close to it.” (Tomoe)</p><br/><p>“Then, let’s go. Can we teleport there?” (Makoto)</p><br/><p>“Yes.” (Tomoe)</p><br/><p>Tomoe quickly creates a Mist Gate.</p><br/><p>I don’t think it will be dangerous, but it is the first time something like this has occurred.</p><br/><p>With a bit of cautiousness, I enter the mist, and then…</p><br/><p>A pure white sandy beach, and waves of water, water, water…a whole space of water and the horizon that can be seen afar.</p><br/><p>A splendid beach like the ones that can be seen in the southern touring catalogues.</p><br/><p>“…”</p><br/><p>I was speechless.</p><br/><p>This is the sea.</p><br/><p>It is a type that I have not seen in real life, but I was sure that it was the sea.</p><br/><p>I have actual proof that poisons practically don’t work on me, so without much cautiousness, I went to the beach and gave a lick to the water.</p><br/><p>Yeah, it is salty.</p><br/><p>Salt water.</p><br/><p>Tomoe and Shiki did the same and nod.</p><br/><p>“This is definitely the sea.”</p><br/><p>“It is the sea, it is strangely peaceful though.”</p><br/><p>“No doubt about it.”</p><br/><p>Shiki, who has done a variety of tasks in the port city, seems to be excited.</p><br/><p>I use [Sakai] to search for our current location and the end of the sea.</p><br/><p>There’s a number of islands, and there’s also a wall of mist quite far.</p><br/><p>Just that it is not visible from here, so it must be really far.</p><br/><p>From the Mirage Town to here…I wonder, maybe with a carriage it will take quite a bit to get here.</p><br/><p>It might take one to two hours if they hurry, but it would be necessary to have transportation.</p><br/><p>Ah, I spontaneously thought of the carriage with luggage accounted as well.</p><br/><p>If it’s just people in it, it should be a bit faster.</p><br/><p>Especially the Winged-kin, I think they would arrive here pretty fast.</p><br/><p>But to make it realistically possible to come and go regularly, there would be a need for a method to teleport huh.</p><br/><p>Specially in Asora where there’s no enemy, there’s not much worry about setting a teleport formation.</p><br/><p>“Now that I think about it, at our back…?!”</p><br/><p>I am at the very center of the sandy beach. Maybe because of my surprise in the sea, I didn’t check out the scale of the beach.</p><br/><p>Thinking about that, I look at my back.</p><br/><p>There, the sandy beach continued for a while, and then, it turns into land.</p><br/><p>This is something that I somewhat understood with Sakai though. But looking at it with my own eyes makes my body stiffen.</p><br/><p>At the other side of the white sand that continues on for a while, there’s dry land.</p><br/><p>In the land, there’s sparse amounts of grass growing, and trees here and there.</p><br/><p>It could be said that at the other side of the super high quality beach, it was a bit dry.</p><br/><p>But that’s not the part I was surprised about.</p><br/><p>It was the fact that there was something there that Sakai didn’t detect at all.</p><br/><p>That’s one of the reasons.</p><br/><p>The other reason, are the trees.</p><br/><p>A tree I have only seen once in TV, but has an unforgettable form.</p><br/><p>“Hm, it seems like there’s something there. A sign? In Asora?” (Tomoe)</p><br/><p>It seems like Tomoe has also noticed it.</p><br/><p>It is not surprising that she hasn’t given attention to the trees.</p><br/><p>I approach the sign that Tomoe pointed out and my Sakai didn’t react to.</p><br/><p>I activate my Magic Armor, and use Sakai in enhancement as I approach.</p><br/><p>I was quite on guard.</p><br/><p>Approaching it, and arriving at the sign from a distance where I can read its contents…</p><br/><p>“…Hah?” (Makoto)</p><br/><p>I unconsciously let out a stupefied voice.</p><br/><p>Tomoe and Shiki also run to where I was.</p><br/><p>Each time they kick the sand, it makes a *kyukyu* sound and it makes it less dramatic.</p><br/><p>When I finish reading it till the end, the sign shines brightly and flew up.</p><br/><p>Yeah, like a touch and go.</p><br/><p>…Hah…</p><br/><p>‘You have really increased your magic power, Makoto. This is a gift from me. I had my brother help a bit, but it is frankly, the sea! By the way, this is a relay gift, and the gift from Daikoku-jisan will be coming a bit later. Do your best from now on as well. Also, after you finish reading this sign, it will become fireworks. There’s no reason for it.</p><br/><p>-By Susanoo.”</p><br/><p>And so, that’s what was written.</p><br/><p>And here I was wondering what was going on.</p><br/><p>Now that he mentions it, when those Gods came, they did say something about gifts.</p><br/><p>…It seems that because of Daikokuten-sama’s gift, I ended up seeing those weird dreams, so at this rate, I feel like I will be played around for 1 more round.</p><br/><p>I don’t know what it will be, but I think that once I increase my magic power more and make Asora bigger, I will know.</p><br/><p>Sea.</p><br/><p>The sea huh.</p><br/><p>What an incredible surprise.</p><br/><p>It seems like there are rich people that get things like islands and castles, but receiving a sea is kinda…rare, I think.</p><br/><p>A *Don* sound that let us know of the firework resounded in the sky.</p><br/><p>“Waka, what’s going on?” (Tomoe)</p><br/><p>“Are you hurt anywhere?” (Shiki)</p><br/><p>“I am fine. It is from a God, he says that he will be giving me a sea.” (Makoto)</p><br/><p>“…”</p><br/><p>“…”</p><br/><p>“It seems like in this matter of the sea, we are free to use it in whichever way we like.” (Makoto)</p><br/><p>“So a sea is something that can be given.” (Tomoe)</p><br/><p>“Even if it’s Asora, that’s way too absurd.” (Shiki)</p><br/><p>Shiki’s voice was a bit cracked.</p><br/><p>I feel like the words of Shiki about being absurd include me as well.</p><br/><p>Please spare me from that.</p><br/><p>I also understand how you feel.</p><br/><p>“The sign didn’t mention it, but with that tree here, I wonder if Athena-sama was involved in this as well.” (Makoto)</p><br/><p>“Tree? The tree that is here and there? It is certainly true that it has an interesting shape. As I thought, it really is something from your world, Waka?” (Tomoe)</p><br/><p>“Yeah. This is my first time seeing this personally though. It has that form, after all. I don’t think there’s a way I would mistake it.” (Makoto)</p><br/><p>“Is it a tree that’s related to a God? In other words, a type of sacred tree? Now that you mention it, I have heard from Tomoe-dono that there are Shrines in your world that are made in places with these kind of sacred trees.” (Shiki)</p><br/><p>Shiki makes a wrong guess about my words and is deeply misunderstanding.</p><br/><p>“No, sacred trees are mostly trees that have history in it and are seen to have long longevity-ja ga.” (Tomoe)</p><br/><p>Tomoe seems to have begun holding a dispute with Shiki.</p><br/><p>Well, there’s no need to do something like that. Tomoe’s explanation is correct after all.</p><br/><p>“Shiki, I didn’t say it with that meaning. I brought out the name of that God because that tree originally grows in places close to where people who hold believe towards that God are.” (Makoto)</p><br/><p>I think that this was part of a homework I had.</p><br/><p>“From its shape, it looks like a mushroom.” (Shiki)</p><br/><p>Right.</p><br/><p>It has a look like that of a mushroom or a broccoli.</p><br/><p>From a set distance of the trunk, a large amount of branches spread, and at the top side of it, it is filled in green.</p><br/><p>The trunk stretching straight up makes it look like a mushroom, but midway, it ramifies and that makes it look like broccoli.</p><br/><p>Its name has impact, and after looking at its strange look from videos, I was able to clearly remember it.</p><br/><p>I really wanted to one day see it for myself, but to think that it would be fulfilled in this way.</p><br/><p>“It is called the Socotra Dragon Tree, and it is written as Dragon Blood Tree.” (Makoto) </p><br/><p>dragon-blood</p><br/><p>“…Quite the dangerous name it has.” (Tomoe)</p><br/><p>Tomoe had a slightly bitter face.</p><br/><p>“In my world, dragons didn’t exist, so I think dragons had no real relation to it. If I remember correctly, the sap that comes out from the trunk is deep red, and it serves as medicine. And they called it dragon blood or something like that, so it moved by word of mouth and was called the Dragon Blood Tree…or so I think” (Makoto)</p><br/><p>There’s Gods, so maybe Dragons actually did exist, but well, in my common sense, they didn’t, so…</p><br/><p>If a dragon was actually involved in that tree, it would be interesting, but that’s of no importance right now.</p><br/><p>There’s no way to confirm it after all.</p><br/><p>“A red sap that can be used as medicine. That’s interesting.” (Shiki)</p><br/><p>Shiki looks at the Dragon Blood Tree with different eyes.</p><br/><p>“Yeah, it is not only used as ointment, it seems like it has a trait of hardening in rain, so it seems like it was used as a pill as well.” (Makoto)</p><br/><p>“…Do you mind if I investigate it?” (Shiki)</p><br/><p>“It’s fine. It’s related with the flora, so call the Arkes and Forest Onis as well, okay?” (Makoto)</p><br/><p>“Yes!” (Shiki)</p><br/><p>“Waka, in my part, I want to investigate the sea itself. Do you mind if I use Mio for that?” (Tomoe)</p><br/><p>“Okay.” (Makoto)</p><br/><p>“…Just that, Mio and I aren’t specialized in the sea, so if possible, it would be a great help if we had someone that knew of the sea and what’s in it.” (Tomoe)</p><br/><p>“True. Is there someone like that?” (Makoto)</p><br/><p>“None. How about it, Waka? Asora has increased in size quite a bit, so how about doing a resident selection again?” (Tomoe)</p><br/><p>“New residents huh. Looking at the Gorgons and the Winged-kin, if it’s the people that you guys select, it won’t be a problem, maybe.” (Makoto)</p><br/><p>“Of course, I will have Waka do a final interview.” (Tomoe)</p><br/><p>Uh, she got me.</p><br/><p>Even though I haven’t proposed anything, she already got me.</p><br/><p>Hm?</p><br/><p>Ah!</p><br/><p>“Hm, I will do that, but hey Tomoe, weren’t there people that weren’t able to pass in the end? The small ones.” (Makoto)</p><br/><p>“Small…ah, there were. I heard they made Ema angry. I don’t remember if they were fairies or spirits or whatever” (Tomoe)</p><br/><p>“Yeah, those guys…eh? What was their name?” (Makoto)</p><br/><p>Ah…ehm…</p><br/><p>“Antonio?” (Makoto)</p><br/><p>“If I remember correctly, they did have that kind of name. It was A-something.” (Tomoe)</p><br/><p>“What happened to them? We want people related to water right now but, can you investigate that just in case?” (Makoto)</p><br/><p>“…Waka-sama, Tomoe-dono; they are called Al-Efemera. A peculiar fairy race that controls a part of the Spirits.” (Shiki)</p><br/><p>Shiki entered the conversation that was proceeding between Tomoe and I.</p><br/><p>Oh, right.</p><br/><p>They did have that kind of name!</p><br/><p>The only thing I could remember was how feisty they were.</p><br/><p>“Oh, Al-Efemera huh. I could only remember that they were a spunky bunch.” (Tomoe)</p><br/><p>So Tomoe was almost the same huh.</p><br/><p>Who was the one that was responsible for them?</p><br/><p>As I thought, I can’t remember the details.</p><br/><p>“Thanks, Shiki. Al-Efemera, right. Then Tomoe, begin the selection, okay?” (Makoto)</p><br/><p>“…No well, there’s already a flood of people wishing for migration, you know? Even if I call it selection, it is more like, finally opening one door for a massive line. Well, it is something like that, so it won’t take that much time. What we will be doing is having a few interviews, and investigate the particulars of that race, so…it won’t be long before Waka interviews them.” (Tomoe)</p><br/><p>“…A flood, I see. Well, I count on you for the investigation of the numbers in the race and its scale.” (Makoto)</p><br/><p>Tomoe and Shiki had begun doing thought transmission.</p><br/><p>As for me, I was looking at the sea.</p><br/><p>The more I looked at it, the more this beach instilled my desire to take off my clothes and jump into it.</p><br/><p>I feel like I can expect quite a bit when the starry sky and the moon come out.</p><br/><p>With this scale, there shouldn’t be any complains in having it as a private beach for a bit of time, right?</p><br/><p>My expectations are growing.</p><br/><p>Anyways, new residents, and a subject that Shiki is interested in researching huh.</p><br/><p>Counting the business in the demon race territory, there are a lot of things to do now.</p><br/><p>When I go to Rotsgard, there will probably be talk about me going to Lorel, so the other party will most likely want it to happen soon.</p><br/><p>It is known that I went to the Empire, so even if I don’t refuse them, I wonder when I will actually be able to go.</p><br/><p>Mio and Senpai didn’t have a good atmosphere between them, so if possible, I should leave Mio. I want to go in a time when Senpai is not there and return though.</p><br/><p>Regarding this, I should confirm the plans.</p><br/><p>Thinking of resting today and working tomorrow might have been a bit of wishful thinking from me.</p><br/><p>Looking at the waves that were peacefully overlapping in the sea, matters appear one after another, and yet, I make a bitter smile.</p><br/><p>Yeah, let’s begin moving starting today.</p><br/><p>The only business I had in Rotsgard was to look at the weakened Root that Tomoe told me about, but that idiot, he literally used all his strength in that blaze, and because of the recoil, he is bedridden, or so I heard.</p><br/><p>He is really an idiot to the core.</p><br/><p>About visiting Root…I will do some extra tasks while I’m there.</p><br/><p>And so, from today on, I will be working.</p><br/>\n</div>"}