{"title": "Chapter 203: The name Neptune is not just for show", "id": 203, "volume": 3, "url": "http://boxnovel.org/tsuki-ga-michibiku-isekai-douchuu-chapter-203-the-name-neptune-is-not-just-for-show", "volume_title": "Volume 3", "body": "<h1>Chapter 203: The name Neptune is not just for show</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Without anything special happening, the test for the sea migrants ended.</p><br/><p>The departure day of Limia was stretched, and the day for the interview came first, which I consider lucky.</p><br/><p>Their side must have their own circumstances, but since it also fits with my own circumstances, there’s no need to get aggravated.</p><br/><p>And so, in a variety of meanings, we arrived at the day where I will be doing the last interview with the patriarchs of the races that will be migrating to Asora.</p><br/><p>Different from before, I wait for the other party with time to spare, knowing that it is my own arbitrary decision.</p><br/><p>About the data of the test, I was given the documents beforehand, so I have already read them and am totally ready now.</p><br/><p>“Now then, let’s begin.”</p><br/><p>The one at my side is Ema again.</p><br/><p>She is truly a big help.</p><br/><p>And so, the interview with the sea races began.</p><br/><p>The first to come were the Sahuagins.</p><br/><p>They have the special trait of Kappas at their head, and are half-fish.</p><br/><p>They are able to live in both land and water, but the main place they live in is the sea.</p><br/><p>Their houses are there as well.</p><br/><p>From what I saw in the documents, they were truly living peacefully at the sea of Asora.</p><br/><p>They are good at hunting, gathering, and they are also trying to do something like animal husbandry in the sea, so my impression of them is that they are like Sea Highland Orcs.</p><br/><p>They don’t have friction with any race, and they are showing their will to migrate.</p><br/><p>Moreover, they are cooperating with the harbour constructions, so they are exemplary people that I find no reason to refuse.</p><br/><p>The interview with the Patriarch-san couple ended smoothly, and Ema was also smiling from beginning to end.</p><br/><p>The interview ended in an incredibly peaceful manner.</p><br/><p>By the way, the green scaled ones are male, and the brilliant red scaled ones are female.</p><br/><p>The male are in charge of being warriors, and they are specialized in group fights. They said that in terms of magic related to water, it is their specialty.</p><br/><p>In terms of fighting style, they gave me the impression of Mist Lizards.</p><br/><p>Well, whatever the case, it is a good start.</p><br/><p>“Next is…” (Makoto)</p><br/><p>“The mermaids.” (Ema)</p><br/><p>“…How are they going to come here?” (Makoto)</p><br/><p>Their lower half is completely fish though.</p><br/><p>We are doing the interview in land.</p><br/><p>The races that can’t come to land are interviewed later, and the meeting place is also at a different area.</p><br/><p>“It seems like they are using a medicine that comes with a cost, and are able to temporarily turn hyuman shaped. That’s why it seems like there’s no need for our assistance this time.” (Ema)</p><br/><p>“What’s with that sad story-like feeling?” (Makoto)</p><br/><p>Will it take away their voice or turn their body into foam?</p><br/><p>I can’t laugh at that.</p><br/><p>More like, I would prefer to go to the sea.</p><br/><p>“Ehm, the price seems to be random, but it seems like it isn’t that big of a deal, and the heaviest price is a slight fever.” (Ema)</p><br/><p>“…If I remember correctly, they didn’t call it an elixir right? For some reason, I feel kind of betrayed though.” (Makoto)</p><br/><p>Even so, it is a medicine that’s sold at the market? Is what I wanted to retort.</p><br/><p>“Waka-sama, is it okay to call the next people?” (Ema)</p><br/><p>“Ah, yeah. It is fine.” (Makoto)</p><br/><p>“Then, I will call them.” (Ema)</p><br/><p>Well, the mermaids didn’t give a good first impression, but in terms of personality, they didn’t have any problem at all.</p><br/><p>Or more like, they hated combat so much that they accepted the invitation to Asora. That’s how pacifist they were.</p><br/><p>The fishing grounds of the hyumans has been increasing lately, and they didn’t want any friction with the races, so they were thinking about a place to move it seems.</p><br/><p>There’s reports that they are exemplar magic users, and they mainly utilize healing, but it was a race that deserved a special mention.</p><br/><p>Also, they like public entertainment and the people themselves like to sing.</p><br/><p>Because of that, they get along well with the Sirens and Lorelei.</p><br/><p>They can adapt to land without the need of using medicine, but their natural residence is in the sea.</p><br/><p>The race has a village, and it seems like they want to extent the present condition. Of course, it was an okay.</p><br/><p>They take the interaction with other races positively, and they have promised to cooperate with the harbour town.</p><br/><p>Ema also spoke, and in the end, they nodded satisfied at my gaze of confirmation.</p><br/><p>“To think that they will be inviting us to a singing show, how pleasant.” (Ema)</p><br/><p>“Right. Since we have the chance, how about having a bi~g party at the seashore?” (Makoto)</p><br/><p>“To celebrate the meeting of new comrades huh. I think that’s a great idea. I will plan it promptly, okay?” (Ema)</p><br/><p>“I am counting on you.” (Makoto)</p><br/><p>Oh, the one that made its appearance after my talk with Ema was…a mountain.</p><br/><p>The knolls of Marine Blue.</p><br/><p>This interview is done at the seashore.</p><br/><p>It is a quite big building in the form of a gymnasium that I said will be used as a meeting place.</p><br/><p>Just that, the entrance is gigantic.</p><br/><p>The door opens responding to the size of the people that open it. It is a gimmick that the Eldwas are proud of.</p><br/><p>When people of normal size like us open the door, it will act like a fake big door, but when a big living being pushes it, one will be able to tell it wasn’t actually a picture on the wall.</p><br/><p>The light pushes in at once, and a shadow that obstructs it appears as well.</p><br/><p>Receiving the light from the back, the identity of the mountain that shone like a blue gem was a shell.</p><br/><p>This is my first time seeing it, but…it is big.</p><br/><p>When I check on Ema, she was also looking at it dumbfounded.</p><br/><p>I have only seen her sharp expressions lately, so this one is rare.</p><br/><p>Blue Moon.</p><br/><p>A giant turtle.</p><br/><p>Or is it?</p><br/><p>It is floating after all.</p><br/><p>It is great that it won’t be walking and creating steps that would resound and destroy the floor though.</p><br/><p>Its gigantic figure contrasted with how it floated lightly.</p><br/><p>Or more like, I am surprised it could enter.</p><br/><p>I was now completely confident of the abnormal designing abilities of the Eldwas.</p><br/><p>“Nice to meet you, King. I am the Blue Moon, Fua.”</p><br/><p>Common language!</p><br/><p>For a mythical beast like this to be able to use common language is incredibly fresh.</p><br/><p>Ema seems to have returned to herself when the Blue Moon called me King, she fixed her expression and faced him.</p><br/><p>“Nice to meet you, Fua-san. My name is Misumi Makoto, over here is my subordinate, Ema.” (Makoto)</p><br/><p>“To think that the one who gave birth to this vast sea was a young and small hyuman, the world is truly big. And so, will I be able to stay in this plentiful sea?” (Fua)</p><br/><p>“Of course. What we want to know here is your approximate residence, and confirm if you have the will to reside here. After that, we will only be telling you some rules.” (Makoto)</p><br/><p>“I am grateful. The Blue Moons have a relationship with the sea and we leave children. I for some reason didn’t have a good compatibility with the sea of that Goddess’ ‘world’, so I was troubled. I still don’t know if I will be able to live well in this sea, but it is incredibly comfortable.” (Fua)</p><br/><p>It seems like the Blue Moon considers that this is not the world of the Goddess, but some other completely different place.</p><br/><p>When he says they have a relationship with the sea, it was literally, as they don’t need a companion to reproduce.</p><br/><p>From his explanation, it feels like they really have a kid with the sea.</p><br/><p>Even though he has the personality of a male, he doesn’t feel anything out of place in the fact that he is giving birth to eggs himself. I thought that maybe the gender in their race is vague.</p><br/><p>…I wonder why, different from the time with Root, I feel respect with him.</p><br/><p>It must be that, it is because the person in question is not weird, probably.</p><br/><p>And he is the only one wishing to migrate.</p><br/><p>In this time’s migration of Asora, there’s only two races that are wishing to migrate alone, so this is one of them.</p><br/><p>It seems like both of them don’t have any problems with it, but I wonder if they won’t get lonely.</p><br/><p>For the Blue Moon, it seems like as long as there’s the sea, he won’t be feeling lonely at all.</p><br/><p>Anyways, it is a composed race.</p><br/><p>Obviously, there were no problems, so he is approved.</p><br/><p>As he was leaving, he told me that he wanted me to watch when he gives birth, but…when I asked when was his breeding time, he said that it is once every 500 to 1,000 years.</p><br/><p>…I don’t think I will be able to witness it.</p><br/><p>It is on the level that I would need incredible luck.</p><br/><p>I answered that at that time, I would love to, but I think the chances of it will be low.</p><br/><p>“He was truly a mountain.” (Ema)</p><br/><p>“Right.” (Makoto)</p><br/><p>“It seems like it was named Blue Moon because of the shell that shines lightly in the moonlight, but even when looking at him in daytime, it was beautiful.” (Ema)</p><br/><p>“Yeah. His address was uncertain, but he said that he would respond to the thought transmissions, so when there’s any business, the races in the vicinity or I will be moving.” (Makoto)</p><br/><p>“I am thinking about asking him to report of any resources he finds.” (Ema)</p><br/><p>“Isn’t that fine? Since he is wilfully swimming and floating around, he will probably be able to find unexpected things.” (Makoto)</p><br/><p>He was gigantic, but he had a truly carefree atmosphere.</p><br/><p>It might also be because my image of a turtle is affecting my impression though.</p><br/><p>I wasn’t overwhelmed like Ema after all.</p><br/><p>“The next one is also a candidate that wants to migrate alone.” (Ema)</p><br/><p>“Ah, her huh. If I remember correctly, she was a Scylla, right?” (Makoto)</p><br/><p>“Yeah. She has a slight problem as well, so please confirm it in the interview that is to come.” (Ema)</p><br/><p>“Understood.” (Makoto)</p><br/><p>“Well then, I will call her.” (Ema)</p><br/><p>A while after the words of Ema…</p><br/><p>A girl around the same age as me enters alone.</p><br/><p>Scylla.</p><br/><p>It seems like in the world of the Goddess, it is a race that doesn’t have that many in numbers.</p><br/><p>It is incredibly belligerent towards hyumans, and for that reason, they go out of their way to attack ships, and even though they are able to silently live at an island on the ocean, they end up living close to the hyuman towns.</p><br/><p>Even though their numbers are low, among the sailors, it is considered the strongest mamono within the sea.</p><br/><p>In the first place, the races that come to this Asora are races that are low in numbers, but for some reason, a girl has come here alone.</p><br/><p>“Nice to meet you, Asora’s King. I am the Scylla, Levi.” (Levi)</p><br/><p>The Scylla gracefully bows.</p><br/><p>So there’s sailor uniforms in this world.</p><br/><p>This is the first time I see a person wearing it.</p><br/><p>It feels like I am looking at a high school girl.</p><br/><p>“Nice to meet you, Levi-san. I am Misumi Makoto. Over here is Ema, my subordinate.” (Makoto)</p><br/><p>Ema bows with a slightly stiff expression.</p><br/><p>“Makoto-sama, I heard that this is the last interview. In other words, until today, I was at the passing level, right?” (Levi)</p><br/><p>“Yeah.” (Makoto)</p><br/><p>“Thanks. Having so many worthy opponents was fun.” (Levi)</p><br/><p>The report of the Scylla was filled with battle information.</p><br/><p>It wasn’t between migration candidates.</p><br/><p>It seems like she went and confronted the strong-looking animals that live in the sea by herself.</p><br/><p>And at times, those targets could also be living beings from the land as well.</p><br/><p>It is certain that she has quite the aggressive personality.</p><br/><p>“There’s a few questions I would want to ask you myself. Is it okay, Levi-san?” (Ema)</p><br/><p>“Of course, Ema-san. Ask me anything.” (Levi)</p><br/><p>“You Scyllas attack hyumans because you want to, right? But in this place there’s no hyumans, and it can’t be said that Makoto-sama is one. In that case, what was your objective in migrating?” (Ema)</p><br/><p>…What am I, Ema-san?</p><br/><p>“Regarding the question about the race as a whole, the answer to your former question is yes. And regarding the latter, almost all the race has no answer for it. That’s why only I am here. I am an eccentric Scylla.” (Levi)</p><br/><p>“…Let me be straight here. Do you hold any hostility towards Makoto-sama, or evil intent?” (Ema)</p><br/><p>At the words of Levi-san that were as if dancing around the topic, Ema throws her a straightforward question.</p><br/><p>That worrywart side of her makes her ladylike.</p><br/><p>“None at all.” (Levi)</p><br/><p>“Is that because you are an eccentric one?” (Ema)</p><br/><p>Against the sarcastic-filled tone of Ema, Levi nods at it with a wide smile devoid of evil.</p><br/><p>“That’s right. I don’t have fun at all against hyumans.” (Levi)</p><br/><p>“Not fun?” (Ema)</p><br/><p>“That’s right. The majority of them are weak, and yet, at my surroundings, there were people that were competing over who defeated the most hyumans. And they do it properly without being caught by the eyes of the Goddess, that’s just low and boring.” (Levi)</p><br/><p>“…”</p><br/><p>“…Even though we have been born with such a strong body, right?” (Levi)</p><br/><p>The conversation of Levi-san and Ema continue.</p><br/><p>“In other words, the reason why you wanted to come to Asora was because there were strong people there?” (Ema)</p><br/><p>“Yes! This is a splendid place! There are people I have never seen before, and I also saw several strong Neptune Sea Lords, who I have always wanted to fight with one day. You Highland Orcs, the Mist Lizards, and those Arkes as well!” (Levi)</p><br/><p>In an excited state, Levi-san speaks about the forces of Asora in her own vision.</p><br/><p>How…impressive.</p><br/><p>But hearing the words that show her way of thinking, I noticed something.</p><br/><p>“Ah Levi-san, sorry for interrupting but, in that case, Levi-san…you have no hostility or evil intent at all, but you want to fight with me as well, is that what you are trying to say?” (Makoto)</p><br/><p>“…Not yet. But in a future, I would want to have a match with you. First, I will be polishing my strength with the system called Asora Ranking.” (Levi)</p><br/><p>The Asora Ranking is the mock battle system that Tomoe began within Asora. Obviously, it is only composed of land races, and until now, there have not been other races mentioning even the name of it, but…Levi-san already knew of it, and moreover, she wants to participate in it.</p><br/><p>“Asora Ranking, is it? But that system has rules that don’t consider the sea races at all, so…” (Makoto)</p><br/><p>“I don’t mind at all. I don’t have any intentions to seek for a change in the rules.” (Levi)</p><br/><p>“Are you thinking about living in land?” (Makoto)</p><br/><p>“Hm, that’s…there’s fights that can only be tasted in the sea, so I don’t want to choose between them.” (Levi)</p><br/><p>The fighting standard came in.</p><br/><p>This person, there’s probably a lot of people in Asora she could get along with.</p><br/><p>A battle junkie that doesn’t hold any real discrimination huh.</p><br/><p>…I can’t be sure of it though.</p><br/><p>“Giant sharks, sea urchins, shelled animals, and eels; it seems like you have been fighting quite a lot, but why is it ‘not yet’ for me?” (Makoto)</p><br/><p>To confirm about it, I once again interrupt and try asking.</p><br/><p>About the record in the sea fights, there’s a lot of self-filing, but counting the wins and defeats, there’s quite the number.</p><br/><p>It doesn’t seem like she is choosing her opponents.</p><br/><p>Within those, there were also some where she barely escaped with her life.</p><br/><p>And for some reason, after that, she has challenged them around three more times.</p><br/><p>“…I just can’t imagine it at all, fighting Makoto-sama. Even so, I don’t feel like it will be boring. At those times, it is mostly because it is an opponent I am unable to do anything about. I am speaking from experience. And so, not yet. By the way, Tomoe-sama, Mio-sama, and Shiki-sama give the same feeling.” (Levi)</p><br/><p>“I see. To live here, there are rules as well. It is fine to consider that you are accepting those when you migrate, right?” (Makoto)</p><br/><p>For now, it looks okay.</p><br/><p>So I decided to enter the last confirmation.</p><br/><p>“Yes. I will study about things I don’t understand like currency, so at first, I might be a bother, but I would like you to please let me live here.” (Levi)</p><br/><p>Currency huh.</p><br/><p>Tomoe has done something unreasonable about that after all.</p><br/><p>Well, that’s fine.</p><br/><p>Levi-san is saying that she will be adapting, so…</p><br/><p>“Well then Levi-san, I accept your migration. Looking forward to being with you.” (Makoto)</p><br/><p>“Thank you very much!” (Levi)</p><br/><p>Levi-san lowers her head deeply, but she energetically lifted it up and made a turn.</p><br/><p>She is leaving.</p><br/><p>Could it be that in her case, since she has been with a race that says things like ‘I have obtained x number of hyuman ears~’, she is lenient?</p><br/><p>If it’s fine if there are strong opponents, then Asora might be a paradise for her.</p><br/><p>“Ah.”</p><br/><p>While I was thinking that, Levi-san stopped.</p><br/><p>Her gestures as well remind me of a high school girl.</p><br/><p>No, she looked like one.</p><br/><p>Until this happened.</p><br/><p>“But if there’s a war with some other place, definitely call me, please. Because at that place, there would be no problem no matter how many I kill after all~. Well then, I am excusing myself~.” (Levi)</p><br/><p>The expression of Levi-san who turned as she laughed, the gap between what she said and her tone made my back shiver.</p><br/><p>The documents did say that the Scylla have a deep hatred towards hyumans, I don’t know about the reason though.</p><br/><p>Could it be that they are actually battle junkies that don’t mind if they are hyuman or not as long as they kill something?</p><br/><p>She is odd as I thought.</p><br/><p>“She is only good at fighting, so in a sense, she is a safe girl, but…is it okay, Waka-sama?” (Ema)</p><br/><p>“Even if she participates in the ranking, I don’t think she has it yet to enter the core of it, so I think there won’t be any problems.” (Makoto)</p><br/><p>“I think that those kind of girls will change for the worse when the environment is appropriate though… Should I call it strengthening, or wickedness, or maybe mentally abnormal?” (Ema) </p><br/><p>For some reason, I feel like all of those fit her.</p><br/><p>The Asora Ranking is properly made so that it doesn’t turn into killing each other, so at that part, I don’t have to worry.</p><br/><p>If I have Shiki leave her without gas from time to time, it should be fine.</p><br/><p>…I definitely don’t want to fight against a high schooler with a transformed body that shouts spells as she attacks me.</p><br/><p>“Ehm, about the next one…” (Ema)</p><br/><p>The next ones were the Sirens.</p><br/><p>Their upper half was that of a woman, and their lower half that of a bird.</p><br/><p>I thought they would have wings on their backs, but the Sirens that were in front of me had wings instead of arms.</p><br/><p>It is a race that has a stronger ratio of bird traits.</p><br/><p>They live mainly at the seashore and at reefs, and in Asora, they said that they like islands that are slightly open into the sea and has cliffs rising perpendicularly.</p><br/><p>There’s no problem in having them live in one, so I gave them permission.</p><br/><p>These girls are similar to the mermaids in the sense that they are pacifists, and like to sing.</p><br/><p>It is a race that has only girls, and in that part, they are similar to Gorgons.</p><br/><p>In the time of the exam, they discussed of these circumstances with the other races, and it seems like it didn’t turn into any problem, so I decided not to get involved in it.</p><br/><p>People like Lime should be relieved about that.</p><br/><p>Even if he were attacked because of a misunderstanding, the experienced Lime will probably be totally in, yeah.</p><br/><p>They told me that they were planning on having the Lorelei in charge of the musical instruments, and the Mermaids and Sirens for the singing, so in the flow, Ema spoke about the festival, and they flew around and were shouting in joy.</p><br/><p>Looks like they are an energetic race.</p><br/><p>When they told me the Neptunes will be the one doing the dancing, I was personally taken aback.</p><br/><p>They asked me to please take care of the Loreleis that will be coming after, and after lowering their head, they left.</p><br/><p>Getting along is something great.</p><br/><p>“They were cheerful people.” (Ema)</p><br/><p>“It is great that Ema doesn’t have to get angry.” (Makoto)</p><br/><p>Remembering the disaster with the fairies, I tease her.</p><br/><p>“That was because they were lacking way too much manners! And in reality, they are now able to act in a somewhat decent manner now, you know? In other words, they could do it, and yet, they didn’t. I was angry because of that!” (Ema)</p><br/><p>…</p><br/><p>I can’t say much about others, but I feel like this is similar to seeing circus lions jumping fire rings, and then expecting the wild lions to do that as well.</p><br/><p>“Is there something wrong?” (Ema)</p><br/><p>“No, nothing.” (Makoto)</p><br/><p>“Well then, I will call the Loreleis next.” (Ema)</p><br/><p>“Yes.” (Makoto)</p><br/><p>Lorelei huh.</p><br/><p>It is a type of demon race it seems.</p><br/><p>Honestly speaking, there isn’t much I would question them about.</p><br/><p>…Because you know, thanks to Sari doing her best and working a lot, almost all the questions I wanted answered are already written in the documents after all.</p><br/><p>I even think that it would be fine if it just went: ‘How’s been lately?’, ‘Not bad’, ‘Then I am looking forward to being with you’, ‘Excuse us then’.</p><br/><p>Different from Tomoe, Sari must be a girl that likes to gather all the information perfectly in the documents.</p><br/><p>In other words, it can also be said that she is a girl that doesn’t set up things for me to experience for myself.</p><br/><p>The interview with the Loreleis was truly just casual talk.</p><br/><p>Confirming the content in the documents, and also speaking about Sari.</p><br/><p>It seems like the Lorelei are truly being helped out by Sari. It seems like Sari is also feeling affection towards them as she interacts with them.</p><br/><p>She has slept over at their village a few times already, so I can tell from that.</p><br/><p>“Ah, now that I think about it, I heard that you guys are good at playing with instruments?” (Ema)</p><br/><p>Ema must be thinking about touching the topic of the festival for last, she talks about one of their specialties.</p><br/><p>“Yes. We make musical instruments, and we are also specialized in playing them. In Asora there are many materials we have yet to touch, so we are looking forward to it.”</p><br/><p>“We are also looking forward to hearing your musical performance.” (Ema)</p><br/><p>“With the cooperation of the other races, I think we will be able to do so in a near future. We are all doing our best in order to entertain you.”</p><br/><p>I think that it is quite special to be able to play musical instruments, since I am no good at it.</p><br/><p>In the case of the Lorelei, it seems like they are able to combine their magic with their melodies, so being diligent in their musical performance will also count in increasing their strength at battle.</p><br/><p>Hm?</p><br/><p>But if they are able to do musical performances, can’t they dance as well to match it?</p><br/><p>“Uhm, it is your specialty to do musical performances but, could it be that you are also good at dancing as well?” (Makoto)</p><br/><p>I tried asking them.</p><br/><p>“Yes. We are not that good at singing, but at the village, we would always pair musical performances with dancing.”</p><br/><p>Oh~.</p><br/><p>Then let’s have them do that for the coming festival!</p><br/><p>“In that case, I would like to see it at the time when you do your performance.” (Makoto)</p><br/><p>“No well, the ones in charge of the dancing will be the Neptunes. There isn’t that many chances to see their super high-class dancing, and it is incredibly rare to be able to do a musical performance when that happens. We are thinking of concentrating in our musical performance which is our main role.”</p><br/><p>…I am unable to evade the Tuna and Red King Crab dragon palace dance.</p><br/><p>Is it okay to expect something when they say it is super high-class? </p><br/><p>Inside me, the image of the Neptunes are already a profound mystery though.</p><br/><p>Regarding the singing and music, they have already seized the dancing role.</p><br/><p>“I see. Understood. I am looking forward to it.” (Makoto)</p><br/><p>“Yes. And so, will we be able to continue living in this land?”</p><br/><p>“Yeah. I am thinking about having you guys be the leads of the harbor town.” (Makoto)</p><br/><p>“Thank you very much!”</p><br/><p>They are more of a land race after all.</p><br/><p>“From hereafter, I will be cooperating with Sari-dono and working hard as a part of everyone.”</p><br/><p>“I think that Sari will be involved with you in the future as well, but I am thinking about having her do the follow-up for the races that will be migrating. That’s why she will not be able to make contact with you guys that often, please do understand.” (Makoto)</p><br/><p>“Is it a promotion? That’s great.”</p><br/><p>“There’s worth in doing it, is what the person herself said as well, and she is talented. In the first place, if I were to leave Ema here with two settlements, she would collapse.” (Makoto)</p><br/><p>“Waka-sama!” (Ema)</p><br/><p>“I want her to keep the strength to get angry at me like this. I am thinking about having Sari do her best. Everyone, please cooperate as well.” (Makoto)</p><br/><p>It didn’t seem like Sari said ‘there’s worth in doing it’ to please me, so I decided to leave her in charge of the sea business.</p><br/><p>Pushing it to Ema would be a bit too much after all.</p><br/><p>In terms of trust and results, it is true that I would like to leave it to Ema, but thinking about how exhausting this work would be, I could tell that it would be hard.</p><br/><p>She is telling me the things in a refreshing manner, but in reality, we are low in hands.</p><br/><p>This is something that I understand even if not told, so I don’t touch that topic though.</p><br/><p>“To think that us who are related to the demon race, can live in such an abundant land…Fuh… Live is truly unpredictable.”</p><br/><p>“Right. The demon race has increased their territory and isn’t as bad as before, but that side is shouldering a war. You all will be making a town peacefully. It is truly unpredictable.” (Makoto)</p><br/><p>“From now on, we are in your hands, Waka-sama.”</p><br/><p>“I am looking forward to being with you.” (Makoto)</p><br/><p>Maybe they are filled with emotion, the Lorelei had tears in their eyes as they left.</p><br/><p>The Lorelei that abandoned living in that harsh land and searched for hope in the sea, it seems like they didn’t live an abundant live at all either.</p><br/><p>Having piled up misfortune over misfortune, they probably see Asora as a paradise.</p><br/><p>If this brings them happiness, it makes me happy as well.</p><br/><p>“A type of demon, Lorelei huh.” (Makoto)</p><br/><p>“As expected of people that have lived in a harsh environment, they are all people that have high endurance.” (Ema)</p><br/><p>It seems like in this place, being a type of demon is viewed as a simple difference in the race.</p><br/><p>In other words, it is like the difference of a white person and a black person.</p><br/><p>Looking at it from a genetic point, they might have a bit more of a difference than that, but honestly, I wonder if they have that much difference to call them a type though.</p><br/><p>“The demon race that’s challenging the hyumans and the Goddess together with the Demon Lord, and the Lorelei that came to Asora with the flow. I wonder which one is happier.” (Makoto)</p><br/><p>“That question changes in answer depending on what they consider as happiness, you know?” (Ema)</p><br/><p>“Ema, don’t you have a lingering discomfort between them and the demon race?” (Makoto)</p><br/><p>Ema answered straightly, but I was a bit bothered.</p><br/><p>There’s the event where the Highland Orcs were almost pushed into a dangerous state by the demon race.</p><br/><p>It is not like everyone knows this, but she knows it.</p><br/><p>“I don’t have anything to say about the Lorelei. About the demon race…I do have a bit, but even so, it is the truth that thanks to that, I was able to meet Waka-sama. I am not Waka-sama, but I am beginning to think that everything is okay as long as the result is good.” (Ema)</p><br/><p>“I see.” (Makoto)</p><br/><p>“Well then, I will call the next ones.” (Ema)</p><br/><p>“Got it.” (Makoto)</p><br/><p>The next ones…are here.</p><br/><p>They are here.</p><br/><p>Neptunes!</p><br/><p>Three of them.</p><br/><p>A tuna and a thorny crab, probably the one they call a Red King Crab.</p><br/><p>And the other one is…a whale.</p><br/><p>It is a whale but…hey, it is small.</p><br/><p>Is that the punchline?</p><br/><p>For a whale to be around two meters is…obviously small.</p><br/><p>“Nice to meet you, Neptunes. My name is Misumi Makoto. The one here is the Highland Orc, Ema, my subordinate.” (Makoto)</p><br/><p>Until now, I have lost in presenting myself first, but they are different to the other races in a lot of meanings, so I hyped myself up and made the greetings.</p><br/><p>When I did that, the tuna and the crab that were at the left and right lowered their knees.</p><br/><p>It is a gesture that I feel would be done by knights.</p><br/><p>And then, the mini-whale that was at the very center, made one step forward and does a refined bow.</p><br/><p>Even though it is a whaleman that has hyuman limbs growing out of it, I felt elegance from it.</p><br/><p>That’s impressive.</p><br/><p>“Nice to meet you, King of Asora, Makoto-sama.”</p><br/><p>After saying that, the whale took a step back.</p><br/><p>“I am in charge of the circulation of goods as a courier, the tuna race, name’s Tsuna. Nice to meet you, Makoto-sama.”</p><br/><p>A tuna named Tsuna.</p><br/><p>We are joking with the names already.</p><br/><p>“As my strong point is strength, I am mainly in charge of public works, constructions, and physical jobs, Red King Crab race, name’s Hanasaki. Nice to meet you, Makoto-sama.”</p><br/><p>Didn’t you say you were a Red King Crab?!</p><br/><p>What’s this about a Hawaiian crab?! </p><br/><p>Just what are you?!</p><br/><p>“And I am the head and a fireman, protecting the living of everyone, whale race, name’s Serwhale Gay. Being granted this audience today, I feel truly happy.”</p><br/><p>…Gay.</p><br/><p>Goddess…just what are you creating?</p><br/><p>No, for that Goddess to create something like this, the molding is just way too terr-….way too unique.</p><br/><p>They might be the antique races that originally lived here.</p><br/><p>In that case, it would mean they have an amount of history comparable to the Superior Dragons.</p><br/><p>Now that I think about it, there’s no Superior Dragon supervising the sea, right? Could it be that these guys are just like their name state, the protectors of the sea? That’s not it, right?</p><br/><p>“A fireman, is it? Uhm, sorry for the rudeness, but from my knowledge, a fireman just doesn’t give a good image though.” (Makoto)</p><br/><p>In the first place, it is weird for your job to be a fireman, right?</p><br/><p>Aren’t you in the sea?</p><br/><p>There’s no fires.</p><br/><p>When talking about firemen, it is the ones from the Edo-period. </p><br/><p>Or more like, it may not sound bad, but from what I know, the jobs of those firemens was to destroy the houses that were in fire.</p><br/><p>Could it be that the Neptunes are lenient in their housing?</p><br/><p>“You know well. It is certainly true that within our race the word fireman means the fireman that you refer to, and it normally doesn’t have a good image. But I am surprised. It seems like you already knew beforehand about the courier and the strong, and on top of that, you even knew about the firemen. You are knowledgeable like a scholar.”</p><br/><p>This self-proclaimed fireman is incredibly gentlemanly.</p><br/><p>This person is totally talking in Kanjis, but I will probably lose if I am bothered by it.</p><br/><p>Also, it would be troublesome to call him only as Gay, so I should also add the Ser as well.</p><br/><p>Let’s do that.</p><br/><p>He said I was like a scholar, but things like couriers, strong, and firemen; as a Japanese, it is not that impressive of knowledge though. In terms of Edo times, るえるべえとか, might be considered knowledgeable. </p><br/><p>I am probably a bit more knowledgeable than the normal.</p><br/><p>“Serwhale-sama knows the meaning of that name, and even with that, he is still calling himself a fireman.”</p><br/><p>Tsuna does a follow-up.</p><br/><p>“There’s no one as noble as Serwhale-sama.”</p><br/><p>Hanasaki also speaks.</p><br/><p>It is probably better to not worry about this guy’s identity.</p><br/><p>Honestly, I don’t know anything aside from his name.</p><br/><p>In terms of fleshiness, I have seen travelling programs where crabs had fleshy legs like that, but in terms of ecology and source, I completely don’t know what’s the difference he has with the Red King Crabs.</p><br/><p>“Is there some sort of circumstance?” (Makoto)</p><br/><p>Leaving aside their looks and composition, the Neptunes have a good reputation with all the races, and on top of that, they are incredibly cooperative with us.</p><br/><p>Not only Sari, they also have a good evaluation from Tomoe, Mio and Shiki.</p><br/><p>From the documents, there were no problems found, a race with moral rectitude.</p><br/><p>If there’s some sort of circumstance from that race, I want to hear it here.</p><br/><p>“We came here with the intention to tell Makoto-sama. It may become an embarrassment for us Neptunes, but will you please listen?”</p><br/><p>“Of course. If you are going to be living in Asora, you are practically family. I think that we have to receive those circumstances as well.” (Makoto)</p><br/><p>“The Neptunes are existences that can be called the protectors of the sea world. We have varied outward appearances, but all of us possess excelling abilities, and since time immemorial, we have been protecting the order of the sea.”</p><br/><p>“The protectors of the sea…” (Makoto)</p><br/><p>No way…</p><br/><p>“Even if we are called the protectors of the sea, as long as we are a race, we will be targeted by friction and civil war, and there were times when we have divided our forces and done wars that drag other races into it. This is something that’s not recorded in the hyuman history, but it is not like the sea has been living in constant peace like how the land sees of it.”</p><br/><p>“I see.” (Makoto)</p><br/><p>So the sea has also experienced a big war within the sea huh.</p><br/><p>“Right now there’s nothing like that and we are living peacefully, but a problem has occurred. I who am the son of the King, am actually a twin, so there’s an exact older brother of mine.”</p><br/><p>“In that case, the one who will be inheriting the throne will be your older brother?” (Makoto)</p><br/><p>“No, he has already inherited it. I don’t have any intentions to fight over the throne, and intended to help brother, so my brother was able to smoothly inherit it without any obstruction.”</p><br/><p>Then there’s no problem.</p><br/><p>“It is stupid to divide the race and fight, and it would have been fine to just offer this body of mine to the Neptunes as a General of the army, but the fact that I thoughtlessly got stronger than my brother, had individual abilities surpassing him, and was the top of the army, must have been bad. Steadily, a bad atmosphere was beginning to born between my brother and me.”</p><br/><p>…It is beginning to turn muddy.</p><br/><p>Even though they are like a gag, why does it turn into such a serious conversation, Neptunes?</p><br/><p>“In other words, even though you have higher abilities to become the King, your brother became the King. People that didn’t like this began appearing.” (Makoto)</p><br/><p>“In terms of disposition as a king, my brother and I have no difference. It is just that I am higher in physical and magical capacity. But it is true that there were people resembling what you mentioned, Makoto-sama.”</p><br/><p>At this rate, he is probably also higher in knowledge and grades.</p><br/><p>And maybe he was more popular too.</p><br/><p>“My brother began thinking that it would be dangerous for me to do as I wish with the army, he fortified his faction, and tried to take in the army into the authority of the King. To avoid the concentration in authority, the Neptunes tried to decentralize the authority with a few methods. My normal brother would have been able to reach an understanding though.”</p><br/><p>“The Neptunes have quite the advanced government.” (Makoto)</p><br/><p>The words decentralization of authority, just when did I hear these words? </p><br/><p>I have heard centralization a lot though.</p><br/><p>It is incredible that they have a lot of different ways of thinking instead of just thinking about who’s the better one.</p><br/><p>Since coming to this world, I have finally begun to understand the words separation of powers, central and local authority; words that sound like some sort of chant.</p><br/><p>Until then, it was more of memorization.</p><br/><p>“Thank you very much. And then, after that, I obstructed the ones who seemed to have excessive centralization of power, and tried to work in mending my relationship with my brother, but in the end, it turned into a situation where it was impossible to avoid a civil war. I could only be embarrassed by my incompetence.”</p><br/><p>“A civil war.” (Makoto)</p><br/><p>“It was a situation where I was searching for a way to avoid it. But there was a light. It was for me to be exiled from the Neptunes. My brother probably said those words with the intention to declare a war, but for me, those were truly words of salvation. I accepted the exile, was called a firemen, and became a wanderer of the sea.”</p><br/><p>I don’t know how many volumes are in the biography of Serwhale, but it seems like it has ended.</p><br/><p>“Ehm, then after that, you visited several places, and ended living with the Neptunes of other places?” (Makoto)</p><br/><p>“No. After being exiled, warriors and populace from my country chased after me. But there were pursuers from my brother, and we were somehow able to cut through it with the minimal amount of fights, created a hidden village, and we were invited by Asora.”</p><br/><p>“That was impressive timing.” (Makoto)</p><br/><p>Seriously.</p><br/><p>“We are truly grateful for this miracle. From now on, we will consider this sea as our homeland, hold hands with the people that are living there, and serve Makoto-sama. That’s what we have decided.”</p><br/><p>The strength in his eyes is incredible.</p><br/><p>As expected of someone that has been troubled by raging waves like the one I have heard just now.</p><br/><p>Even someone as competent as him was unable to stop a political strife that has picked up in pace.</p><br/><p>How scary.</p><br/><p>“The Neptunes have a good reputation with the other races, so there’s no problem. That’s why I don’t mind having you live here. I have already received the okay to our rules beforehand so, is there anything else you want to tell me?” (Makoto)</p><br/><p>“Thank you very much. I think it is truly shameless for us to be saying it, but we have two wishes. The first is that we want to meet with the strong warriors of the Asora ranking, and we want to request for an accommodation. The other one is something related to the conversation just now; if there’s a possible problem regarding the Neptunes my brother commands, we can’t participate. Those are the points.”</p><br/><p>So they can’t participate.</p><br/><p>A valid line.</p><br/><p>I even think that it wouldn’t be strange for him to tell us not to fight him.</p><br/><p>“Then are you saying that if the Neptunes invade from outside, you won’t be fighting?” (Ema)</p><br/><p>Ema refutes.</p><br/><p>Even for a possibility, it is way too improbable.</p><br/><p>“If something like that happens, we will commit suicide. I understand that it won’t serve as atonement for anything, but even so, we are unable to fight, and it will trouble the other races. Choosing sides…would be unbearable. Just that, we are unable to bear it.”</p><br/><p>“You can’t. Suicide is not permitted. Please think of another way aside from that.” (Makoto)</p><br/><p>“But…Makoto-sama…”</p><br/><p>“Sorry, I have made a strange supposition. I will leave this case as a homework of the Neptunes to Waka-sama.” (Ema)</p><br/><p>Ema cuts off the flow of the conversation.</p><br/><p>Maybe because the answer differed a lot from what she expected.</p><br/><p>“Ema-dono, this is something that we have discussed with everyone of us…”</p><br/><p>“Serwhale-dono, please understand. It might be better to think of a way to turn that chance into zero. There are a number of people here that are able to make that possible.” (Ema)</p><br/><p>The eyes of Ema were serious.</p><br/><p>By turning the chances to zero, does she mean…</p><br/><p>“Zero?! Could it be…”</p><br/><p>“I will leave it to your imagination. Suicide is not something that Waka-sama, me, and anyone wishes for. Please discuss it properly once more.” (Ema)</p><br/><p>“Understood. Well then, with this, we will be excusing ourselves. Waka-sama, Ema-dono, we are looking forward to being with you.”</p><br/><p>“Same here.” (Makoto)</p><br/><p>Zero huh.</p><br/><p>Ah, I see.</p><br/><p>If we slaughter all the Neptunes from his brother’s side, that chance would disappear.</p><br/><p>The chances of invading Asora are low to begin with, but if we were to make it zero, it is probably that.</p><br/><p>Looking at the back of Serwhale-san, I remember something I had forgotten.</p><br/><p>“Ah, right. Sergay-san!” (Makoto)</p><br/><p>“What is it, Waka-sama?”</p><br/><p>Sergay is already calling me Waka-sama.</p><br/><p>“I can’t find the relation between being exiled and turning into a fireman though. Because there shouldn’t be any fire extinguishing in the sea.” (Makoto)</p><br/><p>“Ah, about that. Before being in the army, I was dealing with volcanos.”</p><br/><p>“Volcanos?” (Makoto)</p><br/><p>In the sea?</p><br/><p>“In the sea, there’s things called submarine volcanos. They erupt just like the ones in land. The scale of the ones I did were small, but there was a time when I stopped one of those eruptions myself, and since then, I have been called the Number One Target, Serwhale.”</p><br/><p>“Submarine volcanos. Is that so. That’s why it is called firemen. I understand now.” (Makoto)</p><br/><p>“Well then.”</p><br/><p>The three lower their heads deeply, and this time for sure, they leave.</p><br/><p>Number one target and currently a firemen huh.</p><br/><p>The submarine volcanoes are fires, I see.</p><br/><p>“W-Waka-sama?” (Ema)</p><br/><p>As I was nodding in understanding, Ema speaks to me with a trembling voice.</p><br/><p>“What is it?” (Makoto)</p><br/><p>“That person said he was able to stop the eruption of a mountain with that small body of his though?” (Ema)</p><br/><p>“…Oh.” (Makoto)</p><br/><p>Even if he says it was a small eruption, it is still quite the big deal.</p><br/><p>I haven’t seen a submarine volcano, but it is probably quite the exploit.</p><br/><p>“It seems like there’s powerful people in the sea as well. I have to tell everyone.” (Ema)</p><br/><p>“Even if their names were gags as well, they were diligent people. Neptunes, how fearsome.” (Makoto)</p><br/><p>And so, we did interviews with several other races, and in the end, there were races that could only be in the sea, so we went to meet them.</p><br/><p>We were safely able to decide on the migration of all the races.</p><br/><p>The population of Asora -well, I don’t know if it is okay to call it population- has surpassed two thousand now.</p><br/><p>Hm.</p><br/><p>So from two thousand and higher, I am being recognized as Waka-sama huh.</p><br/><p>I am fine with being called Landlord-san which they sometimes call me with though.</p><br/><p>◇◆◇◆◇◆◇◆</p><br/><p>Second floor of the Kuzunoha Company, at the reception room.</p><br/><p>“Shiki-san, what was the reaction of Raidou-sensei?”</p><br/><p>At the time when Makoto was doing an interview with the races of the sea, Shiki-san was meeting with four of his students: Jin, Amelia, Sif, and Yuno.</p><br/><p>It is the students that currently wish to be employed in the Kuzunoha Company.</p><br/><p>Jin who didn’t have the surplus to even place the tea in his mouth, said this tense words to Shiki, and Shiki showed the usual gentle smile he shows to his students as he opens his mouth.</p><br/><p>“About Jin, he said that he can’t put out that much salary, but it seemed like…he was positive in it.” (Shiki)</p><br/><p>“!! Is that true?!” (Jin)</p><br/><p>“Yeah, just that, I think it is a job that won’t bring much money despite its difficulty.” (Shiki)</p><br/><p>“As long as I can eat and sleep, gold is only worth that much. In the Kuzunoha Company, they provide equipment when needed, right?” (Jin)</p><br/><p>“When needed, and corresponding to the person’s ability, you know?” (Shiki)</p><br/><p>“Yes! Yosh, yosh!!” (Jin)</p><br/><p>Jin was happier than ever at the words of Shiki.</p><br/><p>It was a scene that one could tell he considers the Kuzunoha Company that appealing.</p><br/><p>Also, he said that as long as he can eat, have somewhere to sleep, and be provided with equipment, gold is of no importance. It was a scene where one could have a peek of that.</p><br/><p>“Shiki-san, what about us?” (Sif)</p><br/><p>Sif asks Shiki worried.</p><br/><p>Even if they have a connection with her father, Yuno did something that displeased Raidou at the previous lecture(or at least that’s what the sisters think).</p><br/><p>They were thinking that they are in no way in the safe zone.</p><br/><p>The expression of Yuno was also stiff.</p><br/><p>“About Sif and Yuno…” (Shiki)</p><br/><p>The silence of a few seconds felt as if a gulp could be heard.</p><br/><p>“Your father has requested of it as well, and he has understood your passion with your decision of surely passing the guild exam. He will probably not have you work in dangerous places, but he says that he wouldn’t mind having you work.” (Shiki)</p><br/><p>“Aaah~, Yuno!” (Sif)</p><br/><p>“Onee-chan!” (Yuno)</p><br/><p>The Rembrandt sisters hug each other.</p><br/><p>It was a happiness as if they had already passed the exam.</p><br/><p>“Just that, he said that he won’t be able to treat you specially in your salary. If you are unable to accept this…” (Shiki)</p><br/><p>“Something like that, we haven’t thought of it as a problem from the very beginning! Right now I want to test more of my own possibilities. For that sake, I am thinking that being by the side of Raidou-sensei and Shiki-san is best.” (Sif)</p><br/><p>“Just as Onee-chan says! I also want to train myself more and more. I want to try going to the wasteland one day, and I think that I will be able to experience things I won’t be able to experience anywhere else in Kuzunoha Company!” (Yuno)</p><br/><p>With this, from the four, three now have expressions filled with happiness.</p><br/><p>There’s one left.</p><br/><p>Only Amelia.</p><br/><p>“Shiki-san, what did Sensei say about me?” (Amelia)</p><br/><p>“Hm, right. Jin, Sif, Yuno, can you please leave for a bit?” (Shiki)</p><br/><p>“!”</p><br/><p>The three were able to tell the meaning of those words in an instant.</p><br/><p>And Amelia herself as well.</p><br/><p>She closed her eyes and hung her head slightly.</p><br/><p>She exhaled deeply and lifted her head.</p><br/><p>“Shiki-san, there’s no need to do that. Please say it in front of everyone here.” (Amelia)</p><br/><p>“Is that okay?” (Shiki)</p><br/><p>“Yes.”</p><br/><p>“…”</p><br/><p>The three were silent.</p><br/><p>Their faces were tense like the time before they heard the answer from Shiki.</p><br/><p>It may be the business of someone else, but Amelia is a member of their party, and is a comrade of them in the truest meaning of the word.</p><br/><p>“Amelia, from the perspective of Waka-sama, you have no specialized ability, and your personal ability is already reaching its limit. Looking at it only from the present state, you are excellent in synthesizing, but it is easy to see that you are the precocious type that other students can catch up to and surpass.” (Shiki)</p><br/><p>…</p><br/><p>Hearing the harsh evaluation, Amelia’s expression turns bitter.</p><br/><p>“You are a talented person that by gathering experience you can have an active role in the future, but…” (Shiki)</p><br/><p>“…”</p><br/><p>“You are not necessary in Kuzunoha Company.” (Shiki)</p><br/><p>“!!”</p><br/><p>“That’s all.” (Shiki)</p><br/><p>Words like ‘No way’ and ‘this must be a lie’ were leaking from them.</p><br/><p>And the person in question, Amelia, was clearly told that she was not necessary, and she is unable to hide her shock.</p><br/><p>It may be faint, but in her wide opened eyes, there were tears coming out.</p><br/><p>It was something rare for the firm Amelia.</p><br/><p>It was truly something rare.</p><br/><p>“…”</p><br/><p>Shiki exchanged looks with Jin, and noticing the meaning of it, he took Sif and Yuno, and they left the room.</p><br/><p>Silently, the door closed.</p><br/><p>“As I thought, Sensei noticed it huh. That I am not a big deal.” (Amelia)</p><br/><p>“…”</p><br/><p>Maybe because she knew that they were alone now, Amelia opened her mouth.</p><br/><p>About Amelia being precocious, the fact that there’s the chance it will turn for the worse in the future, being able to only gather low amounts of experience, isn’t something Makoto discovered.</p><br/><p>It was Shiki.</p><br/><p>And it was him who gave her the harsh evaluation and the answer that she is not needed. Not Makoto.</p><br/><p>Even so, Shiki told Amelia this as if they were the words of Makoto.</p><br/><p>From the state of the four and Shiki, it was clear that they were asking for the opinion of Makoto regarding their employment in Kuzunoha Company.</p><br/><p>But the reason why Shiki falsified the words of Makoto is unknown.</p><br/><p>“I knew. Compared to the others, I don’t have something that makes me stand out. Even so, I am not an all-purpose type either. That’s why I tried polishing my leadership abilities, tried to be useful with my knowledge, and I also tried scheming…” (Amelia)</p><br/><p>“Yeah, you did put your effort.” (Shiki)</p><br/><p>“Shiki-san, if I were to obtain the approval of the merchant guild, do I still have a chance? Is there anything, anything I can do to be accepted in Kuzunoha Company?!” (Amelia)</p><br/><p>“…Sif and Yuno huh.” (Shiki)</p><br/><p>“Sif has the magic synthesis and incredible talent, Yuno is compatible with that suit, but if I just need to be as good as those two, then I can try even harder and…” (Amelia)</p><br/><p>“You must know already, Amelia. Those two are the daughters of Rembrandt-shi. Even if those two had lower ability than you, he would have hired them.” (Shiki)</p><br/><p>“That’s called having connections, right?” (Amelia)</p><br/><p>“That’s right.” (Shiki)</p><br/><p>“That’s unfair.” (Amelia)</p><br/><p>“Right.” (Shiki)</p><br/><p>Amelia was pressing on as if she was holding in something, and Shiki was answering indifferently.</p><br/><p>“…Why, why only me?” (Amelia)</p><br/><p>“It is okay to cry. Amelia, you are trying too hard. It is good to work hard and look up, but there’s also things that can’t be gained with only that. Learn to cry and break. You have been trying too hard without knowing of that.” (Shiki)</p><br/><p>The words of Shiki that were close to her feelings, finally made Amelia cry loudly.</p><br/><p>Just like how Shiki told her to cry, she didn’t stop, and he silently held Amelia.</p><br/><p>Even though she called Raidou an idiot just as her feelings told her to, she didn’t blame him, and even when she blamed herself, she wasn’t angered.</p><br/><p>The feelings Amelia was voicing out are coming from her true feelings, but she also understands that they weren’t all of her feelings.</p><br/><p>Even though she respects him, she also holds minus feelings towards him.</p><br/><p>Just because she voiced out only the latter doesn’t mean the feelings of respect disappear.</p><br/><p>After Amelia cried, cried, and cried her eyes out, the force calmed down. By the time she had turned quiet and had entrusted her own weight to Shiki…</p><br/><p>“Amelia, please listen.” (Shiki)</p><br/><p>“…”</p><br/><p>There was no response.</p><br/><p>But Shiki continued without minding.</p><br/><p>“About Waka-sama’s decision, honestly speaking, I also agree with it.” (Shiki)</p><br/><p>“…”</p><br/><p>Makoto is simply not that interested in Amelia, and if she were to supplicate, he probably wouldn’t mind hiring her.</p><br/><p>He has that part of him.</p><br/><p>That’s why Shiki replaced his own words of Amelia and made them as if they were Makoto’s.</p><br/><p>“You are weak. The Kuzunoha Company has a lot of harsh works, and Jin and you will without doubt be thrown into it at a point in time.” (Shiki)</p><br/><p>“…”</p><br/><p>“And you will die there. Without doubt.” (Shiki)</p><br/><p>“!!”</p><br/><p>“There’s low chances for you to make a drastic change now. If you continue as always, your chances of dying are certain and you will have no choice but to make a drastic change. Even so, if you wish for that, you will probably have to throw away the style you have had until now.” (Shiki)</p><br/><p>“…I heard that the Kuzunoha Company has safe workplaces.” (Amelia)</p><br/><p>“There are. Just that, in those places, there’s no Jin, Waka-sama, and…I am not there either.” (Shiki)</p><br/><p>“!!”</p><br/><p>“That’s why, Amelia, even if there’s dangerous work, you will most likely come to this side. And you will lose your life. That’s something clear to the eye. I also concurred with Waka-sama. Even if you don’t come to our place, there’s plenty other good jobs for you.” (Shiki)</p><br/><p>“I don’t care about a workplace with good conditions. The only place I want to work in, is here after all.” (Amelia)</p><br/><p>When she said only place, Amelia grabbed Shiki.</p><br/><p>Shiki also understood what she meant.</p><br/><p>And with this reply to the comment of a safe workplace, Amelia noticed her own feelings as well.</p><br/><p>“Gritonia Empire has invited you, right? Isn’t it a desireable major power?” (Shiki)</p><br/><p>“I hate cold places and the womanizer hero.” (Amelia)</p><br/><p>“There will probably be someone from the Limia Kingdom coming to probe about this as well, you know?” (Shiki)</p><br/><p>“Are you saying this seriously? I am the very person that killed a high noble of their place, you know? Misura, Izumo, and Daena too. I definitely won’t go to Limia Kingdom. It would be a different story if the person is an incredible idiot or is able to interpret everything in a positive manner and has the heaven’s luck though.” (Amelia)</p><br/><p>(Or if that person is able to unconsciously nullify all the obstructions. Just like Waka-sama.)</p><br/><p>With the words ‘incredible idiot’, Shiki made a wry smile in a manner that couldn’t be seen by Amelia.</p><br/><p>Because his own master had surfaced in his mind.</p><br/><p>“I can prepare a good intermediary for Lorel as well though?” (Shiki)</p><br/><p>“Please give that to Izumo. That boy, he is shouldering it by himself, but he is quite troubled about his home.” (Amelia)</p><br/><p>“I will think about it.” (Shiki)</p><br/><p>“Shiki-san, I want to enter Kuzunoha Company. And it is probably for a bad reason compared to the other three.” (Amelia)</p><br/><p>“…”</p><br/><p>“But I am serious. I will do anything. Anything…so…” (Amelia)</p><br/><p>Shiki had replaced his own words as Makoto’s.</p><br/><p>It is an action he normally would never do.</p><br/><p>Because it is an action that if not handled properly, would make Amelia hold animosity towards Makoto.</p><br/><p>Leaving aside if the person holding the animosity can cause harm to Makoto, it isn’t something that a person serving him should do.</p><br/><p>The reason was because Shiki himself was unable to hate her.</p><br/><p>This student that loved him.</p><br/><p>To the point that he wanted to pull her aside in order for her to not die.</p><br/><p>Maybe because his undead side complicated things, he still hasn’t thought of protecting her himself, but compared to the many girls that are simple students or came to confess her feelings to him, his awareness of her is definitely different.</p><br/><p>“Anything, you say?” (Shiki)</p><br/><p>“Yes.” (Amelia)</p><br/><p>“Even if it is…to abandon your hyumanity?” (Shiki)</p><br/><p>“Eh?” (Amelia)</p><br/><p>Amelia lifted her face and looks at the expression of Shiki.</p><br/><p>He does look sad, but he is asking her resolve, an expression that’s definitely not that of someone joking.</p><br/><p>“…Trying hard and continuing to try hard, and after experiencing something harsher than ever before, and even with that, if there’s a time when you are unable to match the task, will you be able to compensate by abandoning your hyumanity?” (Shiki)</p><br/><p>Once again.</p><br/><p>With the same face, Shiki says this.</p><br/><p>Looking at the eyes of Shiki, Amelia was able to tell…this is the last chance.</p><br/><p>In the first place, she felt that if she is not in the Kuzunoha Company, she would forget about Shiki in time.</p><br/><p>Trying to escape from that rabble, she asked for employment in Kuzunoha Company.</p><br/><p>Even though she said words akin to a confession, there was no answer.</p><br/><p>Even so, Amelia felt like this was the last chance to connect her feelings.</p><br/><p>“If with that…I am able to stay by your side, I won’t regret it.” (Amelia)</p><br/><p>“…”</p><br/><p>“I…” (Amelia)</p><br/><p>“If I remember correctly, Lime said he wanted a subordinate. I was troubled because there’s the need for intelligence gathering abilities, magic, and high fighting power.” (Shiki)</p><br/><p>“I will do it!!” (Amelia)</p><br/><p>“The time I have until introducing him would be, let’s see…probably by the time you graduate. Let me tell you this, it will as if the party fights until now were just playing around, you know? You will be resting at the Academy, and learn after school. You will probably be living a life like that.” (Shiki)</p><br/><p>“I don’t mind!!” (Amelia)</p><br/><p>“Without lowering your grades, and continuing your part-time job, I will have you go through the training of an official employee.” (Shiki)</p><br/><p>“Of course!!” (Amelia)</p><br/><p>“Understood. I will arrange the necessary. Make a desperate effort to have Waka-sama recognize you, Amelia.” (Shiki)</p><br/><p>At the end, he gently said Amelia’s name and made a smile as if he had been beaten by the persistence of his opponent.</p><br/><p>(In the first place, he wasn’t against hiring Amelia. Even though I said all this, there’s actually not much problem in hiring her with how she is currently. What do I want with Amelia? At worst, if I were to do a breech of morals, just how much should I show and just how much should I involve myself? This is bad. Even though I am aware that I am cruel, maybe because I was originally a hyuman, there are times when I can’t be like Tomoe-dono and Mio-dono. Amelia is simply a stray cat that I coincidentally found. It is an existence that even when stirred by others at times, it is not someone that can bring harm. And yet, am I feeling reluctant to relinquish it? It is someone that I haven’t shown my real self, you know? I…) (Shiki)</p><br/><p>While holding questions within himself, Shiki felt that a part of him wished for this development, and was bewildered.</p><br/><p>◇◆◇◆◇◆◇◆</p><br/><p>“Ara, Tomoe-san. What’s wrong? It is rare for you to come to the kitchen.”</p><br/><p>“Don’t ‘what’s wrong?’ me. You are plotting something, right?” (Tomoe)</p><br/><p>In the kitchen where Mio was endeavouring herself in, Tomoe appeared.</p><br/><p>Right now she was in the middle of preparing dinner.</p><br/><p>“Plotting, you say. What are you talking about?” (Mio)</p><br/><p>“Clearing out the people, I have come to ask you in this way. Don’t play dumb.” (Tomoe)</p><br/><p>Just like what Tomoe said, the preparation work that normally has a lot more people working in, only has Mio today.</p><br/><p>There were actually people, but Tomoe slowly gave them work and had them leave. Right now, there’s only Mio remaining.</p><br/><p>“Even if you say that, I just can’t understand what you mean.” (Mio)</p><br/><p>“About accompanying Waka-ja yo.” (Tomoe)</p><br/><p>The kitchen knife that moved nimbly, stopped.</p><br/><p>Until now, Mio had been speaking with Tomoe without looking at her and only directing it to her presence, but she slowly turned around.</p><br/><p>“About going together with Waka-sama to Limia Kingdom without letting Tomoe-san or Shiki, is it that-desu ka?” (Mio)</p><br/><p>“That’s right-ja. About you going, well, it is not like it is necessarily a no, but there’s one troublesome hero at Limia. I don’t know what you are thinking, but I will be going as well.” (Tomoe)</p><br/><p>“I refuse-desu wa.” (Mio)</p><br/><p>“What authority do you have in saying that? I want you to tell me along with your scheme-ja no.” (Tomoe)</p><br/><p>“Hibiki isn’t even to fear. Isn’t Tomoe-san just being overcautious?” (Mio)</p><br/><p>“If we are just looking at the fighting power of her, it would be as you say. But the troublesome part of Hibiki is not that. That intuition and way of conduct, if we were to let her involve herself with Waka without proper supervision… I just can’t overlook it.” (Tomoe)</p><br/><p>“I don’t understand that intuition you are talking about. No matter what Hibiki learns of, just what would she able to do about it-desu? In the first place, if she were truly sharp, I wouldn’t even need to move out.” (Mio)</p><br/><p>At the latter part, Mio mutters it incredibly low as if talking to herself.</p><br/><p>It seems like Tomoe was unable to hear that part.</p><br/><p>“It is not about what she learns. What’s troublesome is the chance of her teaching Waka something she has thought of. Looking at the chances, I can’t say it is zero.” (Tomoe)</p><br/><p>“Even though Tomoe-san always goes without interfering, the moment Waka-sama is about to learn something that inconveniences you, you turn defensive-desu wa ne.” (Mio)</p><br/><p>“You, are you looking at me in that way?!” (Tomoe)</p><br/><p>“Because, isn’t that the truth? You have a lot of things you don’t tell Waka-sama, right? You have also silenced me from telling him about me killing the individual that revived.” (Mio)</p><br/><p>“…There are a lot of things in this world that are premature to know, and things that are better not known.” (Tomoe)</p><br/><p>“This is something I learned recently but, it is about that merchant Rembrandt that Waka-sama likes. Wasn’t he quite the merchant-sama in his younger times? Even though it is something that you should know because of your mind reading abilities, you didn’t tell Waka-sama.” (Mio)</p><br/><p>“W-What good would come…from telling him? Wouldn’t it only make Waka suffer? That’s why I will tell him when he has grown enough to be able to take it. Don’t you think it is okay to do that?” (Tomoe)</p><br/><p>“I just can’t agree with that ‘watching over is best’ thinking of Tomoe-san.” (Mio)</p><br/><p>“Then what are you telling me to do-ja?” (Tomoe)</p><br/><p>“That…I will be showing it in Limia. But it would be troublesome if you were there. Please rest for a bit. There’s a lot of other work to do after all.” (Mio)</p><br/><p>“Is it okay to think that it has something to do with you giving a similar equipment of Waka to that Rembrandt daughter? That troubled Waka a lot, you know?” (Tomoe)</p><br/><p>“That’s right. I have already received my scolding, and I have already received his forgiveness. Until now…I have not said anything about most of what Tomoe-san has done. Is Tomoe-san going to interpose in what I will do? Are you thinking that I will harm Waka-sama?” (Mio)</p><br/><p>The eyes of Mio shoot a dangerous light.</p><br/><p>“That’s not it. I know of your deep affection and loyalty to Waka. You don’t even have a shred of a thought about harming him. What I am anxious about, is you going out of control-ja. Because of your deep affection to Waka, you view other people aside from Waka way too lightly. As long as Waka cares for the general trend of others, we should also accommodate to that as well. You should also be able to understand that too, right?” (Tomoe)</p><br/><p>While thinking that the words of Mio hit in a part that hurt, Tomoe responds.</p><br/><p>“Yeah.” (Mio)</p><br/><p>“That’s why I am saying that I will accompany you and do a follow-up.” (Tomoe)</p><br/><p>“That’s why I am doing it-desu.” (Mio)</p><br/><p>Their words weren’t in sync.</p><br/><p>“What?” (Tomoe)</p><br/><p>“The one that’s caring is Waka-sama. And yet, there are idiots that just don’t know that the match is already over. Why is it that there are people troubling Waka-sama’s heart one after the other?” (Mio)</p><br/><p>“…”</p><br/><p>“That’s why I just want them to understand just what kind of person Waka-sama is, to those idiots and Hibiki as well. It is just that-desu.” (Mio)</p><br/><p>From the words of Mio, Tomoe understood that it was impossible to convince her and gave up.</p><br/><p>She has known that Mio and Shiki have been mostly complying with what she said.</p><br/><p>“…This is something you are doing when already knowing about the power of the priestess, right?” (Tomoe)</p><br/><p>With a power different from magic, the priestess Chiya is able to see through something within the person. Tomoe was confirming this of Mio.</p><br/><p>With the report of Lime, this has become evident. Shiki and Tomoe are currently thinking about a countermeasure to it.</p><br/><p>“Of course, I know of it-desu wa.” (Mio)</p><br/><p>“Knowing that, you want to accompany him alone, that’s what you are saying, right?” (Tomoe)</p><br/><p>“This time I won’t yield.” (Mio)</p><br/><p>Saying that, she points her kitchen knife at Tomoe.</p><br/><p>Without a single sign of joking.</p><br/><p>“…Understood.” (Tomoe)</p><br/><p>Without placing a hand on her katana, Tomoe lifted both of her hands and showed her intend to give up.</p><br/><p>“You are unexpectedly obedient-desu wa ne. Even though I thought you would be a bit more persistent.” (Mio)</p><br/><p>“The reason that the preparations for the meal were a bit earlier than normal was because you were expecting something like this to ‘happen’, huh.” (Tomoe)</p><br/><p>“Yeah. I don’t want to delay the meal of Waka-sama, so I made sure that even with one match, it won’t happen.” (Mio)</p><br/><p>Once again, the sound of the kitchen knife hitting the chopping board was heard.</p><br/><p>Of course, it is because Mio returned to her preparations.</p><br/><p>“I understand that you don’t want to hurt Waka or make him suffer, but you know, that’s something I don’t want, and probably Shiki neither. No one is thinking about wanting to see him break or crumble.” (Tomoe)</p><br/><p>“Yeah. I wouldn’t forgive someone like that after all.” (Mio)</p><br/><p>“You said you won’t be yielding this time, but I will be using that, Mio.” (Tomoe)</p><br/><p>“…Eh?” (Mio)</p><br/><p>“At least bring Lime with you. Even if he is like that, he is useful. He won’t be able to get in your way, and it is also useful as a pawn to use in that side, right?” (Tomoe)</p><br/><p>“But…” (Mio)</p><br/><p>“I won’t be yielding-ja, Mio. Waka will also be able to comfortably travel having one man alongside. Just as you wish, Shiki and I won’t be going.” (Tomoe)</p><br/><p>“Waka-sama will…” (Mio)</p><br/><p>“Please.” (Tomoe)</p><br/><p>“Fuh~, understood. I will accept Lime coming along. But it is also prohibited for Tomoe-san and Shiki to stealthily follow from behind, okay?” (Mio)</p><br/><p>“I wouldn’t do something like that. Also, I don’t know what the other side will do in the time you guys are in Limia, and I have asked Waka to avoid coming and going to Asora as much as he can. You will be able to do as you wish.” (Tomoe)</p><br/><p>“I trust in you-desu wa.” (Mio)</p><br/><p>“…”</p><br/><p>“There’s no need for Waka-sama to care about the world to the point of collapsing. There’s also no need to protect the town just because there have been complains of here and there. Every single one of them, there’s a limit to being dense.” (Mio)</p><br/><p>“…Don’t overdo it, Mio.” (Tomoe)</p><br/><p>Makoto didn’t know that Tomoe and Mio had this kind of conversation before heading to Limia.</p><br/><p>Tomoe feared the irregular possibilities that might be born from the long time that Hibiki and Makoto have lived together.</p><br/><p>Mio was angered by the world that surrounds Makoto.</p><br/><p>And Shiki is more into his students than Makoto thinks of.</p><br/><p>Without noticing the thoughts of his followers, Makoto, Mio, and Lime head to Limia Kingdom today.</p><br/>\n</div>"}