{"title": "Chapter 202: I do think it is a bit hasty though", "id": 202, "volume": 3, "url": "http://boxnovel.org/tsuki-ga-michibiku-isekai-douchuu-chapter-202-i-do-think-it-is-a-bit-hasty-though", "volume_title": "Volume 3", "body": "<h1>Chapter 202: I do think it is a bit hasty though</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>A surprise chapter! 😀</p><br/><p>I was thinking about posting two chapters to celebrate the 200 chapters, but I felt like posting these two chapters would be better for the continuity. So, there we go.</p><br/><p>Happy 200 chapters! 😀</p><br/><p>P.S: Guys, there’s a lot of new POV’s and Side Stories published already. To check the links for the sites, just go to the table of contents. For the people that haven’t read it yet and are craving for more Tsuki.</p><br/><p>Rotsgard, Kuzunoha Company’s office room.</p><br/><p>Today I am being at ease in this room.</p><br/><p>But well, it is not like I am not doing work.</p><br/><p>Right now I am in the middle of work related to the documents of the highly praised students.</p><br/><p>Shiki said he wants to make Jin an apprentice of his as a researcher.</p><br/><p>Jin was able to guess out my [Sakai] by instinct, and the power that he deployed -putting it in layman terms- he is able to make his opponent heavier or make himself lighter; it can be considered adjustment of gravity.</p><br/><p>He is unable to make himself lighter and the opponent heavier at the same time, but if he is just making himself lighter, it is possible to reduce the range of the spell.</p><br/><p>Jin is able to center the activation of the spell in a person other than himself, and opposite of being able to lighten himself, he is able to make the opponent heavier and reduce the range as well.</p><br/><p>Excluding the activation point and the consumption of magic power, the utilization of it is truly similar to that of Sakai.</p><br/><p>When I asked Shiki why he makes things heavier or lighter, he said that it is probably the easiest to picture in the interference with his space.</p><br/><p>From Jin’s cognisance, the power will take effect at the direction where a mass is existing and trying to move, so the power actually takes effect when the target is actually moving, so it reduces the burden and losses, is what Shiki explained to me, and I understood the outline of it while ignoring the fine details.</p><br/><p>Shiki seemed to be having fun in a different sense from me.</p><br/><p>It might be the difference between a normal person and a researcher.</p><br/><p>In other words, Jin’s new spell is a power that needs movement in order to increment its power.</p><br/><p>Impressive.</p><br/><p>I felt like I was hearing a physics lesson.</p><br/><p>In this world that hasn’t developed that study properly, just how was Jin able to reach to that idea?</p><br/><p>Now that I think about it, he is also a member of the elites that attend the Rotsgard Academy.</p><br/><p>And a scholarship student at that.</p><br/><p>He must be a prodigy or a genius.</p><br/><p>It seems like Shiki was surprised in the same point as me. He took my physics book and it seems like he understood it by instinct, he opened it in the section regarding vectors.</p><br/><p>I…don’t hate physics, but I honestly didn’t like it either.</p><br/><p>In terms of tests, it was one of the subjects that I was able to increase the grades satisfactorily.</p><br/><p>“Jin as a researcher huh. It differs a lot from the image of a dual-wielding warrior cutting through the vanguard.” (Makoto)</p><br/><p>“At that point, Jin will probably become first rate and reach a stop there. In terms of being a researcher, he will probably be able to discover one or two groundbreaking ideas. There’s plenty chance he can become more than first rate.” (Shiki)</p><br/><p>But only as a researcher.</p><br/><p>How complicated.</p><br/><p>“He will probably be bewildered. Not as a clerk or as a warrior, but a disciple to become a researcher. By the way, aren’t there other kids Shiki has an eye on?” (Makoto)</p><br/><p>Like Amelia maybe.</p><br/><p>It would be interesting if he were to say that he wants to have her dress in a wedding dress.</p><br/><p>If it is someone like that, I wouldn’t mind that person entering Asora.</p><br/><p>Currently, the only ones that have the chance for that are Shiki and Lime after all.</p><br/><p>“Right. I think that even without my judgment, Sif and Yuno would have been hired as employees in given time. In terms of our relationship with Rembrandt-shi.” (Shiki)</p><br/><p>“…Well, that’s how it is.” (Makoto)</p><br/><p>“In terms of ability, there’s nothing that especially interests me, but it seems like they have quite the good will towards us, so I think that there won’t be any problems in using them as employees of the company. They also declared that they will be passing the merchant guild exam by the time they graduate, so it will be easier by the time we have a branch store.” (Shiki)</p><br/><p>“So they have enough motivation huh. It seems like Rembrandt-san is also in approval of this. And, how about the others?” (Makoto)</p><br/><p>“Others… Regarding Izumo, it seems like his true feelings are that he wants to return to his homeland Lorel, but in terms of his course, he hasn’t consulted me. It seems like there’s some circumstances, but he doesn’t say it, so he probably has enough confidence that he can resolve it. The discord between head family and branch family is troublesome, so it would save us the pain. I think it would be better to leave it alone, and if Izumo contacts us, it would be good to take distance by limiting it to only listening to what he has to say. A magician that has no good or bad, there’s no real appealing point that would make me want to hire him.” (Shiki)</p><br/><p>He isn’t saying it, but hey, he is talking as if he already knew everything.</p><br/><p>Head and branch family.</p><br/><p>It is a talk that could happen in Japan as well.</p><br/><p>It is true that it is not something that I would want to get involved in.</p><br/><p>“What about Daena?” (Makoto)</p><br/><p>“He is married, so the person himself said that he would want to be employed in the Academy. ‘If you are going to fight with the Academy, tell me first, I will run away’, is what he said as he laughed while being drunk. His eyes were serious though. The same as Izumo; he isn’t a talent that I would want to invite at all costs, so if he has a different path in mind, I wouldn’t mind ignoring it.” (Shiki)</p><br/><p>“His wife is pregnant, right?” (Makoto)</p><br/><p>If I remember correctly, there were those kind of rumors.</p><br/><p>The person himself hasn’t said anything though.</p><br/><p>If she has morning sickness, you can just be absent for the class and be by her side, is something I would want to tell him.</p><br/><p>“Yeah. If Waka-sama were to hear that, you might tell him to take absence for the lectures and be together with her, so until she is stable, he wanted to have it stay as a secret at all costs, is what he requested me.” (Shiki)</p><br/><p>“…He readily said that huh.” (Makoto)</p><br/><p>“The morning sickness has calmed down quite a bit already. He has come to buy medicine a few times, but lately, he hasn’t done that.” (Shiki)</p><br/><p>“Hmph~, are you telling me that he has been going to the Academy normally and taking classes while his wife was suffering with morning sickness?” (Makoto)</p><br/><p>Is that fine with you, husband?</p><br/><p>And the medicine as well, if you were to say it, we could have send it to your room.</p><br/><p>Since you are buying it at our place, we can provide at least that much service you know.</p><br/><p>“Daena is also a special student, so I think that diligently doing his best as a special student of the Academy is actually something good though.” (Shiki)</p><br/><p>“…Is that how it works? Then what about Misura and Amelia?” (Makoto)</p><br/><p>“The damage delay of Misura interests me a lot. By the time he graduates, I want to have it completely clarified. He is a favorite of Tomoe-dono, so she will probably train him until she is bored of it… If the person himself wishes it, it is possible to hire him as well.” (Shiki)</p><br/><p>“Saying it like that. Is there some sort of problem?” (Makoto)</p><br/><p>I was bothered by the slight time he took to say it.</p><br/><p>“It seems like his parents are ardent believers of the Goddess and want Misura to serve in the Church, or more like, they want him to be employed there. The person himself is troubled and holding his head because of it, but I think that the chances that he is pushed just like that and enters the Church are high.” (Shiki)</p><br/><p>“Ardent believers of the Goddess… What withering words.” (Makoto)</p><br/><p>“His fighting style and his personality are passive, so if he has already accepted being pushed by the flow, he can just do whatever he wants.” (Shiki)</p><br/><p>“I see.” (Makoto)</p><br/><p>“Just in case, I did tell him that there’s the chance that the Church and Kuzunoha Company will confront, so he will probably groan about this until his graduation.” (Shiki)</p><br/><p>“He would obviously be troubled.” (Makoto)</p><br/><p>“Thinking about a future where Waka-sama is laughing loudly and pointing a finger at him, even the passive Misura that goes with the flow, will probably desperately swim against that current. His parents or Waka-sama, I think we will be able to see an interesting decision.” (Shiki)</p><br/><p>“…You are dark, Shiki.” (Makoto)</p><br/><p>“Thanks for the compliment.” (Shiki)</p><br/><p>“Then, what about Amelia?” (Makoto)</p><br/><p>Since he is placing her at the end, maybe he is considering it pretty important?</p><br/><p>Or the contrary?</p><br/><p>“Amelia is a jack of all trades and master of none, so there’s no real appealing skill. There has been a scout coming from Gritonia Empire, and she already has the choice of entering their knight corps. She wants to be employed in our place, but there’s no merit in it, so there’s no need to.” (Shiki)</p><br/><p>A scout from Gritonia huh.</p><br/><p>Quite the tall talk.</p><br/><p>It seems like Limia hasn’t spoken to any specific student, so is there no candidate for Limia in the students?</p><br/><p>If I had to choose between Gritonia or Limia, I would without a doubt choose Limia though.</p><br/><p>Even so, that’s cold.</p><br/><p>Amelia has been approaching Kuzunoha Company that aggressively, or more like, approaching Shiki, and yet…</p><br/><p>“So there’s no one thinking about going to Limia?” (Makoto)</p><br/><p>“The king has spoken to a few, but there’s no approach from Limia Kingdom, so they probably haven’t placed it in their options. Leaving aside Jin, Sif, and Yuno; I think that the other four have a chance of being invited by Limia.” (Shiki)</p><br/><p>“Daena and Misura as well?” (Makoto)</p><br/><p>Daena’s wife is in this town, and Misura’s parents are Church lovers, right?</p><br/><p>“If Daena were to be invited with his whole family, there’s plenty choice to go. I think that he will decide by the trouble of the moving and the treatment. About Misura, there’s the hero chosen by the Goddess in Limia, so there’s enough chance for his parents to accept.” (Shiki)</p><br/><p>Senpai huh.</p><br/><p>It is true that if they are ardent believers of the Goddess, cooperating with the hero can enter in the choices.</p><br/><p>It might become a fulfilling job.</p><br/><p>I don’t understand it at all though.</p><br/><p>“I see.” (Makoto)</p><br/><p>Amelia, it doesn’t seem like it is working.</p><br/><p>If I were asked if I wanted to hire her, I actually don’t care whichever it is.</p><br/><p>“Waka-sama, are you bothered by Amelia? Is there a part in her that you are interested in?” (Shiki)</p><br/><p>So he took it in that way huh.</p><br/><p>“Hm, no. It seems like she is um…quite attached to Shiki, and that’s why she is working part-time at our place, right? And so, I was a bit bothered by it.” (Makoto)</p><br/><p>“If it’s only that, there’s plenty other girls like that at the Academy, so in terms of wanting to embrace her, it isn’t to that degree. She is the only one that’s taking the lectures within those girls though.” (Shiki)</p><br/><p>…Maybe I should have Shiki go to the Academy alone once and tail him for that one day.</p><br/><p>Just how popular are you?</p><br/><p>Be it Lime or Shiki; learn a bit from Rembrandt-san who is single mindedly in love with his wife.</p><br/><p>And so, sorry Amelia.</p><br/><p>I don’t intend to get in the way of someone else’s love, but I don’t have any intentions of touching it either.</p><br/><p>“But Amelia…if I remember correctly…” (Shiki)</p><br/><p>“Yeah?” (Makoto)</p><br/><p>Could it be, a revival route?</p><br/><p>“She is appealing as a base for a chimera, like the ones at the hyuman base. With her compatibility to elements and her abilities, she is great all around, so…I was thinking about fulfilling the subjects I have few data about.” (Shiki)</p><br/><p>“Uwaa~.” (Makoto)</p><br/><p>It probably would have been better if I didn’t ask.</p><br/><p>“I received an interesting document from Tomoe-dono, but as expected, raw experiments are important.” (Shiki)</p><br/><p>“That’s…too much. It would be safer to have Amelia leave to a different country as an elite huh.” (Makoto)</p><br/><p>At worst, she would go to Gritonia and fall victim to Tomoki, but…it should be better than being a guinea pig for Shiki.</p><br/><p>“I see. Well, it is still future talk anyways.They are currently gaining a higher salary than some adults, so they probably won’t choose the paths they have compromised to.” (Shiki)</p><br/><p>Right.</p><br/><p>Jin and the others are receiving quite the high salary every month from the Academy.</p><br/><p>If they were to become my employees, the salary they get would probably be lower.</p><br/><p>Ah, Jin.</p><br/><p>Shiki said that it would be good to hire Jin, but is the person himself intending to come to our place?</p><br/><p>“Jin…intends to come to our place?” (Makoto)</p><br/><p>“The person himself hasn’t thought of any other path aside from that, is what he said.” (Shiki)</p><br/><p>He is serious huh.</p><br/><p>“His salary will decrease though.” (Makoto)</p><br/><p>“…Jin strongly aims for higher heights, but lately, he has been showing a slight change.” (Shiki)</p><br/><p>“Hm?” (Makoto)</p><br/><p>“Since the moment we met him, he has been dry about his sensation for loss and gains, and he had a tendency to decide in that way. And that hasn’t changed at all since now.” (Shiki)</p><br/><p>“Then why?” (Makoto)</p><br/><p>Would he want to be employed in Kuzunoha Company?</p><br/><p>He will definitely suffer a loss.</p><br/><p>“Jin understands it. That there’s a lot of value in the experience that he can obtain in Kuzunoha Company. And that he won’t be able to obtain it in any other place.” (Shiki)</p><br/><p>Experience is worth.</p><br/><p>Ah, so the loss and gain sense of his also counts that.</p><br/><p>Then I can understand.</p><br/><p>Something that only in that place you can do.</p><br/><p>Things that he can learn only in that place.</p><br/><p>…Fufu, if his loss and gain sensation are dry because of that, I am also like that.</p><br/><p>For the first time, I felt familiarity with Jin.</p><br/><p>“Merit huh. Leaving aside Asora, I am doing outside work as an owner of Kuzunoha Company and playing as a make-believe adventurer after all. It is not like I don’t understand him.” (Makoto)</p><br/><p>“Jin still has a lot to go before being able to reach Akua and Eris by himself, but that kid probably wants to become stronger in Kuzunoha Company.” (Shiki)</p><br/><p>“Stronger…” (Makoto)</p><br/><p>“I don’t know why he wants to be stronger though.” (Shiki)</p><br/><p>“Shiki, that’s fine. Even if you know, don’t tell me. If Jin wants to tell me, he will do so.” (Makoto)</p><br/><p>“…Understood.” (Shiki)</p><br/><p>I felt like he knew, like in the case of Izumo, so I stopped him.</p><br/><p>…I see.</p><br/><p>The students are thinking a lot.</p><br/><p>And so, Amelia is in a pretty precarious position.</p><br/><p>She is not totally out, so there’s a chance…probably.</p><br/><p>No matter how it rolls, I don’t think I will be showing them Asora, so they are people that I don’t think there’s the need to be counted as a danger.</p><br/><p>And so, about my opinion of Jin and the others, as a teacher involved with them in lectures, I think that it is fine if they just go to the paths that they have worked hard to head to.</p><br/><p>Ah, maybe that’s why I was bothered by Amelia who wanted to be hired in Kuzunoha Company.</p><br/><p>It is sad that there’s no choice but to use the state power there, but that makes me, me after all.</p><br/><p>“Well then, Waka-sama. Before heading to Limia, let’s do a little selection within these student candidates.” (Shiki)</p><br/><p>“We are doing it right now? Isn’t it okay to do it in Limia?” (Makoto)</p><br/><p>There’s an incredible pile after all.</p><br/><p>And it looks like the chances of reaching the summit in their level is pretty low.</p><br/><p>“Of course, the final check will be done while heading to Limia, but there’s this amount after all. We have to advance even if for a bit.” (Shiki)</p><br/><p>“…Right.” (Makoto)</p><br/><p>It is not an amount that we can take, and actually, it is a bit impossible to leave in Asora.</p><br/><p>“And so, here.” (Shiki)</p><br/><p>Shiki gave me a bundle of documents with the thickness of a tissue box.</p><br/><p>I could feel a pressure surpassing its weight.</p><br/><p>First, I should check these ones out huh.</p><br/><p>Can I finish checking them all?</p><br/><p>“And about that pile over there…” (Shiki)</p><br/><p>“Hm?!” (Makoto)</p><br/><p>The mountain of documents that Shiki pointed with his finger, burned in an instant.</p><br/><p>A fire!</p><br/><p>It will turn into a fire!</p><br/><p>“Wa?!” (Makoto)</p><br/><p>“The fire won’t spread, so don’t worry.” (Shiki)</p><br/><p>“Ah, I see.” (Makoto)</p><br/><p>“About that mountain, they are all failures. I have dealt with it with a small performance.” (Shiki)</p><br/><p>Don’t do it with such a pleasant smile.</p><br/><p>Don’t do it so suddenly.</p><br/><p>It will normally surprise me.</p><br/><p>This is a closed room.</p><br/><p>The second floor of the store.</p><br/><p>“Then that means, from all of that, only this much is left?” (Makoto)</p><br/><p>“Yes. There’s still a relative amount of it, but after seeing that mountain, I feel like this amount is something possible.” (Shiki)</p><br/><p>“True.” (Makoto)</p><br/><p>I do feel that way.</p><br/><p>Shiki magic huh.</p><br/><p>“Seriously, just looking at that made me feel like my brain would be contaminated. It felt like a dangerous substance, and the amount was a lot as well. I don’t know what would have happened if Waka were to see it.” (Shiki)</p><br/><p>…</p><br/><p>Aren’t those documents about the application for my lecture?</p><br/><p>“The documents here are not all good either, but are on an acceptable level that giving it to Waka-sama can turn into experience, so…” (Shiki)</p><br/><p>“I am already scared of even looking at it.” (Makoto)</p><br/><p>What experience?</p><br/><p>What’s this about acceptable level?</p><br/><p>What’s that about dangerous substance that can contaminate the brain?</p><br/><p>“I did an all nighter death march and got kinda high, so there’s probably interesting components still remaining within those documents. Please do take them with you to Limia.” (Shiki)</p><br/><p>“T-Thank you for your hard work.” (Makoto)</p><br/><p>So having continuous all nighters can make Shiki dangerous as well huh.</p><br/><p>I can’t imagine it, but I should at least be prepared.</p><br/><p>Anyways, Limia huh.</p><br/><p>I have not decided which follower I should be taking with me.</p><br/><p>Shiki would be fine, but he has a lot of things he has to do.</p><br/><p>It is also a bottleneck that he is acquainted with Hibiki-senpai and her group.</p><br/><p>“Well then, I will be checking the state of the sea.” (Shiki)</p><br/><p>“Ah, Shiki, regarding Limia.” (Makoto)</p><br/><p>“? What is it?” (Shiki)</p><br/><p>“Tomoe or Mio, who do you think would be better to bring?” (Makoto)</p><br/><p>“Mio-dono.” (Shiki)</p><br/><p>Instant answer.</p><br/><p>Or more like…</p><br/><p>“Shiki, why are you averting your gaze?” (Makoto)</p><br/><p>Not only that, his eyes are swimming.</p><br/><p>Why is he showing such obvious suspicious behavior?</p><br/><p>“As for me, I think that Mio-dono is a good choice.” (Shiki)</p><br/><p>“Shiki…” (Makoto)</p><br/><p>Did something happen in the shadows?</p><br/><p>He has made a complete change from before and is not looking my way at all.</p><br/><p>“T-The sun is still high up in the sky of Asora, so I will be using a bikini and bath in the seawater that I haven’t tasted for several hundred of years!!” (Shiki)</p><br/><p>“Bikini?!” (Makoto)</p><br/><p>Isn’t that the part where you say trunks?!</p><br/><p>No wait.</p><br/><p>“Please tell Mio-dono that Shiki has given his support in having her go alone with you! I will be going now!!” (Shiki)</p><br/><p>“Shiki?!!” (Makoto)</p><br/><p>Please tell her?!</p><br/><p>That girl…Mio.</p><br/><p>There’s also the matter with the suit, but it feels like she is plotting something.</p><br/><p>It is surely not something that would bring me harm though.</p><br/><p>I know that.</p><br/><p>I know that but…</p><br/><p>I-It makes me uneasy.</p><br/><p>I am suddenly anxious about going to Limia.</p><br/>\n</div>"}