{"title": "Chapter 212: Drowsiness of the Victor", "id": 212, "volume": 3, "url": "http://boxnovel.org/tsuki-ga-michibiku-isekai-douchuu-chapter-212-drowsiness-of-the-victor", "volume_title": "Volume 3", "body": "<h1>Chapter 212: Drowsiness of the Victor</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>“I understand… Makoto-kun pushed away my serious emotions of the several millions of lives that I have been entrusted with. From what I was shown, I felt like he was a lot more scary than that Goddess.” (Hibiki)</p><br/><p>After Makoto left from the passage, Hibiki was left alone.</p><br/><p>A self-depreciating mutter came from her mouth.</p><br/><p>“I am seriously the type that stumbles when it counts the most.” (Hibiki)</p><br/><p>The fight with Io.</p><br/><p>Remembering the invitations she did to Mio and Lime, Hibiki makes a wry smile.</p><br/><p>She felt as if the important things were slipping from her hands, an irritating feeling.</p><br/><p>The wind passes in between the fingers of her opened hand.</p><br/><p>She felt as if it was a feeling similar to this.</p><br/><p>Her self-depreciation continued.</p><br/><p>“If we lose to the demon race, that’s the end; if we lose in the war against Tomoki, it will be the end as well; and if Makoto-kun goes haywire, it will be the end too huh. What an incredible situation. The last one has a narrow chance of hope though. A world without the Goddess huh… Thinking about the current state, it will most definitely become a warring era with the flood of the small countries, so it wouldn’t change the fact that it will be despairing.” (Hibiki)</p><br/><p>A disastrous image appears in the mind of Hibiki, and disappears.</p><br/><p>Winning against the demon race, shutting the Empire, and on top of that, restrain Makoto with something aside from power.</p><br/><p>After doing all that would Hibiki finally be able to begin with her objective.</p><br/><p>Just like what she said about it being an incredible situation, it is practically close to impossible.</p><br/><p>Even so, Hibiki can’t just withdraw.</p><br/><p>“Even so, I have to do my best till the end. Believing in me, many have died. For the sake of my objective, I have killed many. There’s also people like Naval that have sacrificed themselves. I can’t give up. I have to struggle.” (Hibiki)</p><br/><p>As an awakened one from the world transfers, she has obtained the ability to change the conception of others into power.</p><br/><p>Because of that point as well, she is aware of the innumerable cord-like feelings that have been placed on her.</p><br/><p>The lives that have been entrusted to her, and the lives she has taken away; while having those in mind, Hibiki fights.</p><br/><p>Hibiki felt that she has the obligation to do her best until the last moment of her life.</p><br/><p>That’s why she can’t just push them aside.</p><br/><p>Even if the other party is someone with power that can easily cut apart those feelings.</p><br/><p>“Seriously…being a hero is quite the worthwhile position.” (Hibiki)</p><br/><p>For Hibiki, the Goddess is the person that has provided her with this environment.</p><br/><p>That’s why Hibiki feels a set amount of gratitude towards her.</p><br/><p>But that’s all there’s to it.</p><br/><p>Hibiki’s impresion of her was like that of the first person that had found her.</p><br/><p>Sadly to say, she is a type that is hard to respect as a superior, and there’s several problems with her as well.</p><br/><p>But as a numerical value, she provides benefits, so it is someone that can’t be cut off and there’s no choice but to just accept it.</p><br/><p>It is something like that.</p><br/><p>Thinking until there, Hibiki sighs.</p><br/><p>“Hah…If I could change the religion I am shouldering, I think it would be easier to have Makoto-kun instead of the Goddess. Even if he were to be treated as a God, by using the front of worshipping, it can be hidden in many ways. But even when he said such outrageous things, the only strong reactions I got from him were with the Goddess, and…his discrimination towards hyumans. He doesn’t have a purpose. That boy doesn’t even have the intention of founding a nation. If he at least had something like that…” (Hibiki)</p><br/><p>Hibiki could tell that the options for the future would increase a lot.</p><br/><p>If Makoto were to become a king, if he were to announce that he would be founding a nation, the hyumans and demons wouldn’t be able to ignore it.</p><br/><p>Because it would be a big problem that would force them to even stagnate this hatred-filled war in order to deal with it.</p><br/><p>Anyone that has seen his power would be able to tell.</p><br/><p>Because it would mean that a country that surpasses all the currently existing countries in military power will be born all of a sudden.</p><br/><p>At the very least, in the time that Makoto and his close aides are alive, they wouldn’t be able to enter a full-out war without that country, is what Hibiki thought.</p><br/><p>“He doesn’t have the intentions to become a king or a God either. Because of that, his inability for authority is unconsciously showing, and thinks that the Goddess is an enemy of equal ground. I seriously don’t understand him…” (Hibiki)</p><br/><p>Hibiki’s waist falls to the ground.</p><br/><p>Hibiki sits in the cold corridor.</p><br/><p>“My legs gave out…but that’s a given, right? If I made a mistake, I might have ended up dead cold right now at this place. Not only my spirit, even my body was enduring the fear huh.” (Hibiki)</p><br/><p>An absolute strength.</p><br/><p>Currently for Hibiki, that’s exactly what Misumi Makoto is.</p><br/><p>The moment those straining feelings loosened, Hibiki’s body reminded her that.</p><br/><p>What she wanted to ask, her invitation, and also, the confrontation she feared.</p><br/><p>For Hibiki, the conversation just now was something she challenged with the feelings of standing on thin ice.</p><br/><p>(He is already not in a dimension where I can think of him in human standards. Earthquake, tsunami, eruption, tornado…he is close to those. Fighting against him is not that realistic, but…as long as it is someone that moves with a will, I can’t ignore it. Seriously, he has become quite the monster.) (Hibiki)</p><br/><p>Hibiki then notices.</p><br/><p>That within herself, two things began to bother her.</p><br/><p>The first one is something that she had already expected.</p><br/><p>They were her own emotions after all.</p><br/><p>(Then why I don’t obey him? If it’s just in military power, he surpasses that of a country; a monster in the skin of a human. No matter what Limia tries to do, they probably wouldn’t be able to beat him. Then there should be no other choice but to curry his favor, and yet…) (Hibiki)</p><br/><p>The lights of the land near the castle she was looking at were few, and as she saw them grow sparse, Hibiki sunk into silence.</p><br/><p>(…I see. It is hatred. I can’t forgive the demon race. They have burned many villages, killed many hyumans, and also my comrade…Naval as well. Ah, maybe that’s why.) (Hibiki)</p><br/><p>Hibiki nodded a few times.</p><br/><p>Facing your own emotions and controlling them.</p><br/><p>It is something important, but difficult to do.</p><br/><p>When those emotions turn so natural that they seemer deep into yourself, it becomes even harder to do.</p><br/><p>Overcoming the death of a comrade is also a different matter.</p><br/><p>Hibiki finally understood why she didn’t choose to completely curry favor on Makoto.</p><br/><p>(Of course, I have killed many of them as well. Within them, there should have been people with comrades, family, and lovers. Even so, I hate the demon race. I see…so this is how it feels to be a concerned party. Is the hatred of war something so troublesome?) (Hibiki)</p><br/><p>Hibiki was surprised that within her deepest self, hatred towards the demon race had piled up.</p><br/><p>It is true that the demon race is the enemy, and there’s no doubt that they are a hateful enemy, but she didn’t know that it was binding her this much.</p><br/><p>Since she thought she had it somewhat under control, this was shocking.</p><br/><p>(To curry the favor of Makoto-kun, I would have to affirm his ideals even if it is only on the outside. In other words, it would become hard to continue the war. That’s why I…) (Hibiki)</p><br/><p>In other words, she wished for the continuation of the war.</p><br/><p>With her hand covering her mouth, Hibiki’s pair of eyes opened wide.</p><br/><p>(That’s why I can’t. I want to bring down my enemy. That’s right. Until I kill Io, I…) (Hibiki)</p><br/><p>Thinking about the reason why she wanted the war to continue, she reached an answer.</p><br/><p>In the end, it was an incredibly personal reason, and Hibiki was amazed of herself.</p><br/><p>Even though it was not funny at all, she felt a laugh coming out from within her throat.</p><br/><p>After a while, the laughing stopped, but Hibiki didn’t stand up and was sitting just like that.</p><br/><p>She was thinking about the other thing that was bothering her.</p><br/><p>(I…what did I feel a sense of discomfort in? The moment I thought of Makoto-kun as a monster, I certainly felt it… Right, ‘refuge’! He said that when the world goes into chaos and turns into an End of the Century era, they could just go take refuge for a while. Why is there a need to take refuge? There’s no doubt that the world will fall into great chaos if the Goddess is defeated. But it is not a situation where individuals with power or organizations would take refuge. If it’s the Kuzunoha Company, it is realistically possible to even be able to become the number one company. But he said that he would be taking refuge.) (Hibiki)</p><br/><p>That word coming from someone strong made Hibiki feel a sense of discomfort.</p><br/><p>(Just that, when it comes from the mouth of Makoto, it doesn’t feel that strange. Refuge huh. A safe place. In other words, he has a place where no matter if the world has fallen into chaos, he is able to secure safety. That wouldn’t be his store. In the variant incident at Rotsgard, the Kuzunoha Company’s store was destroyed. Also, Rotsgard and Tsige won’t be spared from the chaos.) (Hibiki)</p><br/><p>Hibiki lists out the places where Makoto has connections with.</p><br/><p>Because she wanted to grasp even if a little bit more information of Makoto and his tendencies.</p><br/><p>(! There is. The place that he arrived in when he came to this world. The border of the world. If he has a base in the deepest parts of that wasteland, it would signify that it is safe. They would be able to cut themselves away and live peacefully for years. For him who doesn’t think about calming the chaos himself, it is plenty possible.) (Hibiki)</p><br/><p>She digs out the memory she had of Tsige where she went to train temporarily in.</p><br/><p>She tries to remember as many stories of bases in the wasteland as possible.</p><br/><p>And then, she arrives at one answer.</p><br/><p>In the first place, those kind of talks are rare, and by elimination process, it was plenty possible to arrive at ‘that’ place.</p><br/><p>“…The Mirage Town. I don’t want to think it is possible, but could it be, that’s the base of Makoto-kun -of the Kuzunoha Company?” (Hibiki)</p><br/><p>A Mirage Town that a few number in Tsige have heard of.</p><br/><p>In the end, Hibiki returned to Limia without going to that town.</p><br/><p>But the more she thought about it, the closer she felt the relation between Kuzunoha Company and that Mirage Town.</p><br/><p>“A mirage town located somewhere in the wasteland. If that’s his base, his first store being in Tsige begins to look like a splendid decoy. The wasteland is his base and has set up a store at Tsige. That’s right, if he already had a base by the time he left the wasteland and entered Tsige…” (Hibiki)</p><br/><p>Hibiki noticed one other scary thing.</p><br/><p>Her words stop unconsciously.</p><br/><p>(For a base, the wasteland is just far. WAY too far! A base needs to be in a place where one can return in a short amount of time. His Majesty and prince Joshua said this when they returned from Rotsgard, that they have broken the long distance teleportation that the Kuzunoha Company was relying on… That’s a lie. It hasn’t been broken. They don’t use the merchant transportation method to ‘return’, they have in their hands a stable long-distance teleportation. Because they are able to take refuge after all.) (Hibiki)</p><br/><p>Hibiki doesn’t know of Asora.</p><br/><p>She does know that there’s a mirage town somewhere in the vast border of the world.</p><br/><p>It would be impossible for her to be able to predict a parallel space, so even if it’s not a perfect correct answer, it was a guess that was close to what Makoto’s base is.</p><br/><p>(If he is able to do business in this world while ignoring distance completely, it would be logical how he is able to have a store and has allowance to do peddling around the whole world. Yeah. Kuzunoha Company is like the Goddess, if I were to consider them an existence living on a different plane altogether… They declared that they didn’t have interest in the war, so there’s many ways to deal with this.) (Hibiki)</p><br/><p>Hibiki thinks about how she will be interacting with the Kuzunoha Company.</p><br/><p>At the same time, she was estimating the way to progress in the war with the demon race.</p><br/><p>(It is slightly different from the request of Waterfall, but if I have Makoto-kun compromise that he won’t be destroying the world, it is still salvageable. If we are able to bring the advantages of Kuzunoha Company and him to the hyumans…next, as long as the demon race does a big move in the time that the Goddess is still okay, there’s the chance that it will turn advantageous for us. But well, the demon race is also hostile to the Goddess, so there’s not much for me to worry about in this part huh.)</p><br/><p>Hibiki stands up.</p><br/><p>She walks towards the opposite direction of the passage that Makoto walked away in.</p><br/><p>Even when she knew Kuzunoha Company’s power to a certain degree, her eyes didn’t show the light of giving up, it reflected strength.</p><br/><p>Makoto and Hibiki’s conversation, and Hibiki’s monologue. That one act had ended.</p><br/><p>At one of the castle’s spires pretty far away from the passage, one shadow was sitting there.</p><br/><p>It is the roof portion of the spire that shouldn’t have people to begin with.</p><br/><p>The girl that was eavesdropping at the whole conversation of Makoto and Hibiki, first smiled with her mouth, and it spread all the way to her eyes.</p><br/><p>“Ufufufu, a breakdown. That’s a given-desu. Waka-sama and Hibiki’s way of thinking about the current state was simply coincidentally similar after all. It has gone well.”</p><br/><p>Makoto’s follower, Mio.</p><br/><p>Mio had created a flow where it would lead to Makoto and Hibiki’s conversation, and induced it.</p><br/><p>But she didn’t manipulate the result, and didn’t interfere in it either.</p><br/><p>Mio was able to read to a certain degree what was going to happen if they were to clash their opinions.</p><br/><p>“When I heard Tomoe-san’s assessment of Hibiki, it came to me. That it would be fine; that Waka-sama and her are not compatible. It is Hibiki who doesn’t know of what’s beneath, and Waka-sama who, in a sense, only looks from beneath. It was an obvious result-desu.” (Mio)</p><br/><p>The assessment Mio heard from Tomoe.</p><br/><p>It is something that even now Hibiki isn’t aware of, a subconscious part.</p><br/><p>From what Tomoe said: Hibiki doesn’t know of the standing of the weak.</p><br/><p>What Tomoe said of Hibiki was that: ‘She doesn’t understand the standing of the absolute weak. Because that girl believes that if they do their best, they will be able to bring about results-ja. No matter how they struggle it will be for naught, she doesn’t know that there are people that can only be weak. Well, she herself can do anything she tries to do, so since she is young, thinking that way can’t be helped~’.</p><br/><p>And in truth, that’s what Hibiki thinks.</p><br/><p>If you try till death, people will be able to bring about some results.</p><br/><p>Of course, there’s many people in reality that can bring about ‘some’ results, but in society, there’s also a part that can’t do anything no matter what they try.</p><br/><p>Not only the environment and the talent, there’s also cases where there’s external pressure they can’t go against.</p><br/><p>But Hibiki, who clearly has not been a concerned party of these cases and even in Earth was born in a blessed household in Japan and with high talent, speaking about how much she understands of the current state, just like how Tomoe said, it is a part that can’t be helped.</p><br/><p>On the other hand, Makoto doesn’t hold the point of view of a strong one.</p><br/><p>Even in the parts of position and responsibility, he doesn’t understand in what stage he should be standing in.</p><br/><p>Without any jokes and exaggeration, a responsibility that fits the strength of Makoto would be to act while thinking about the whole world in itself.</p><br/><p>“It is because the more she learns, the more she doesn’t understand. That’s why, Hibiki is cautious towards Waka-sama. And so, because she is unable to bring him in, what they are trying to do is to exclude Waka-sama as much as possible from the war. But Waka-sama won’t consent.” (Mio)</p><br/><p>Mio was laughing in a truly gleeful manner.</p><br/><p>The figure of Mio laughing simple-mindedly below the moonlight felt like it had madness drifting about, and a dangerous beauty.</p><br/><p>“That’s because Waka-sama doesn’t care if it’s hyuman of demi-human after all. He would help out the demi-humans that are troubled, but that’s all. What’s important for that personage is his own circle. And from the hyumans that I have seen, there was an abundance of idiots, so his preference turned into demi-humans, that’s all. It is so simple, and yet…everyone can’t understand it. That’s just strange-desu wa.” (Mio)</p><br/><p>Mio looks at the true character of Makoto in that way.</p><br/><p>That’s correct.</p><br/><p>That’s why Makoto is still involving himself with hyumans, and at the same time, he has turned into a point where he can’t hold a wider field of vision no matter how much time passes.</p><br/><p>“It is impossible to not get involved in the war. If there’s people troubled coming from it, Waka-sama will act. There’s no way he would think about what would happen in the future or the troublesome things that might come. There’s no need to match the pace of Hibiki who only thinks about big things like the future, the world. In the first place, that’s all empty dreams. Waka-sama most likely noticed it with this. To begin with, future things should be thought by the people of the future-desu wa. No matter what Waka-sama who lives in the present does, no matter what happens to the world because of it, it is simply an unavoidable destiny for the people that will be born later.” (Mio)</p><br/><p>She once again voices out an unreasonable logic.</p><br/><p>But Mio originally doesn’t care for anyone other than Makoto.</p><br/><p>That’s why, for her. what makes Makoto happy is the correct thing to do.</p><br/><p>If the noise is getting unbearable and her master is troubled, she wants to remove the seed of that distress.</p><br/><p>The actions of Mio this time, were simply because of that.</p><br/><p>Just that, Makoto takes in mind his surroundings way too much, to the point of overdoing it.</p><br/><p>That’s why Mio moved slightly indirectly.</p><br/><p>“The hyumans, the demons, and that one above, are really annoying. Waka-sama is saying that he doesn’t have any interest, so you should just go kill among yourselves as much as you want in a place that Waka-sama’s eyes don’t reach-desu. Seriously.” (Mio)</p><br/><p>Mio disappearing from the spire, and those words, were done at almost the same time.</p><br/><p>◇◆◇◆◇◆◇◆</p><br/><p>“Eh? Isn’t that Priestess-san -ah no, Priestess-sama?”</p><br/><p>“…”</p><br/><p>Before arriving at my room, I encountered an unexpected person.</p><br/><p>One member of Senpai’s party, the priestess of Lorel. If I remember correctly…her name was Chiya.</p><br/><p>She looks like she is the same age as Rinon, so she is probably 12-13.</p><br/><p>Even though it is already pretty late in the night, she was standing there as if lying in wait for me.</p><br/><p>Her attire is also probably not the one she uses when going to sleep.</p><br/><p>“Ehm…do you have business with me?” (Makoto)</p><br/><p>She maintained her silence, but I ask her who has been staring at me all this time.</p><br/><p>“I am the priestess of Lorel, my name is Chiya. First of all, I want to apologize for my impoliteness. I am very sorry.” (Chiya)</p><br/><p>She lowers her head deeply.</p><br/><p>The 90° type, the one that bends the body a lot.</p><br/><p>“You suddenly collapsed, so please don’t mind it too much. I have heard a bit of the circumstances after all. Uhm, I would be happy if you were to tell me what you can about what you saw though.” (Makoto)</p><br/><p>“It is not only for the matter of me collapsing. In the time of the dinner, I was unable to take part in it, not even once.” (Chiya)</p><br/><p>“Your physical condition was not good, so it didn’t affect my mood. It is something that can’t be helped.” (Makoto)</p><br/><p>It is true that in the dinners, I was together with Senpai and prince Joshua a lot, but I haven’t been together with the priestess once.</p><br/><p>In one instance, there was clearly a seat prepared for her and even the meal was prepared, and yet, she didn’t come.</p><br/><p>At that time, it was a probably a ‘maybe’ case, but if her condition is not good, there should be no responsibility taken in not being able to attend to a dinner. Even when she is this young, she is quite the level-headed girl.</p><br/><p>“Thank you very much. My impoliteness can be taken as the impoliteness of Lorel, so it is great that you say that.” (Chiya)</p><br/><p>But she is so stiff.</p><br/><p>It is not an atmosphere fitting her age.</p><br/><p>This is not something that requires an apology, but it is certainly true that what she saw interests me.</p><br/><p>About what she saw that could make a girl like this lose herself and faint.</p><br/><p>“…”</p><br/><p>That’s why I stay silent and wait for her next words.</p><br/><p>“I rudely tried to peek into the true nature of you and your Kuzunoha Company’s entourage. Even if it’s my power as a priestess, it is an action that wouldn’t be helped if you were to scorn me. If you so wish to, it might be my duty to give you the answer of that result.” (Chiya)</p><br/><p>“No well, I don’t really scorn you or anything…” (Makoto)</p><br/><p>In the first place, it is something that Senpai made you do.</p><br/><p>Also, if a girl of her age were to get the power to see inside others, I don’t think it would be strange to want to use it.</p><br/><p>Well, the Priestess-san doesn’t fit that much into the kids of her age though.</p><br/><p>“What I saw in Lime was a gentle large tree. Lush leaves wet in rain were glittering, and…maybe it was making it its dwelling? The young figure of a dragon was visible. I don’t know if it’s a hint to something, but I felt like he was a likeable person. That’s how I viewed it.” (Chiya)</p><br/><p>A gentle large tree.</p><br/><p>And a young dragon huh.</p><br/><p>I see.</p><br/><p>So it is true that she can see things only she can.</p><br/><p>But it comprises many truths. There’s a high chance that it truly touches their essence.</p><br/><p>“Mio-san was…a big black spider. The Calamity Spider. Around its neck there was a big choker, and that spider looked like it was lovingly caring for that choker that had a chain attached to it.” (Chiya)</p><br/><p>So it saw through Mio’s true identity perfectly huh.</p><br/><p>But a choker…</p><br/><p>That’s probably hinting at the pact.</p><br/><p>In that case…this girl saw that chain connected to me?</p><br/><p>“Yeah. There’s a lot regarding Mio. As you can see, she is no longer the rampaging monster with no sense of sanity. In most cases, she is safer than in the past so…” (Makoto)</p><br/><p>“…No matter if I make a racket about it, I have already reached the conclusion that the situation won’t change for the better anyways. Please don’t mind it.” (Chiya)</p><br/><p>“I see…that’s great.” (Makoto)</p><br/><p>“And, you were…a pure white hyuman-shaped form with no features.” (Chiya)</p><br/><p>Something like a white doll?</p><br/><p>No, I don’t think that’s all there’s to it.</p><br/><p>It is not something to collapse for.</p><br/><p>“A white hyuman shape with no facial features huh. Once again, I don’t know what it means.” (Makoto)</p><br/><p>“Sorry. I have awakened this power just recently, so I still can’t accurately grasp the meaning of the things that I see.” (Chiya)</p><br/><p>“No, I wasn’t blaming you.” (Makoto)</p><br/><p>“Just that, that white hyuman shape had a crack. A small crack.” (Chiya)</p><br/><p>“A crack?” (Makoto)</p><br/><p>“At that part…… Sorry. At that part, in my eyes, it looked like…there was something incredibly repulsive dwelling there.” (Chiya)</p><br/><p>Repulsive is quite the word.</p><br/><p>Leaving aside my outward appearance, is this the route where it is telling me that even my true nature is ugly?</p><br/><p>Something like this really depresses me.</p><br/><p>“Was it something so repulsive that it made you collapse?” (Makoto)</p><br/><p>“I don’t know. I didn’t looking straight at it for long after all.” (Chiya)</p><br/><p>“I see…” (Makoto)</p><br/><p>“…”</p><br/><p>“…”</p><br/><p>“Please! There’s probably nothing I can do, but…! Please…don’t bring that ‘thing’ outside! If you call yourself a merchant, please!!” (Chiya)</p><br/><p>“Uo, ehm, please calm down a bit.” (Makoto)</p><br/><p>When I thought there was a short silence, the Priestess-san draws closer as if she had lost it.</p><br/><p>Moreover, what she asked me to do is something I have no way of doing anything about.</p><br/><p>In the first place, what is ‘that’?</p><br/><p>Something that not even I know myself, there’s no way I would be able to control if it comes out or not, you know?</p><br/><p>While trying to somehow calm the Priestess-san, I was troubled by the request that I was unable to nod at.</p><br/><p>The Priestess-san that had returned to herself, was heaving with her shoulders going up and down while having a tension-filled face. Because of the same reason, her whole body was still stiff.</p><br/><p>“I-I am very sorry.” (Chiya)</p><br/><p>“Uhm, I don’t understand it well, but I will do my best, so it would be better if you didn’t pay much mind to it. You might have seen something dangerous, but it seems like it isn’t showing you the future or anything like that.” (Makoto)</p><br/><p>“I heard this from Onee— I mean, Hibiki-sama, but she said that you don’t hold a religious belief towards the Goddess? Ah, it is not like I am condemning you. For the sake of future reference, can I hear about what you rely on, whether it be in the Spirit-samas or in the studies, and the teachings and thoughts you hold?” (Chiya)</p><br/><p>“Hah? The teachings and thoughts?” (Makoto)</p><br/><p>“Yes. The teachings of the Goddess, the teachings of the four elemental Spirits that are born from those, and the truth that a number of scholars have arrived at in their studies. Those kind of things.” (Chiya)</p><br/><p>“…I don’t have those. I don’t have much interest in religion, even so, if told that science is everything, I also think that’s not the case. What I rely on huh. Hmm….” (Makoto)</p><br/><p>“…”</p><br/><p>The Priestess-san looks at me and was dumbfounded.</p><br/><p>Maybe she thought she would get some sort of thoughts of mine immediately.</p><br/><p>That’s just unreasonable.</p><br/><p>“Well, I do have experience in an art called archery that has created some rules inside myself. Are you fine with that?” (Makoto)</p><br/><p>“Please let me hear them.” (Chiya)</p><br/><p>“It is not something complicated or anything like that. It is to do what you have decided to do with your own power. It is something that you have decided to do, so don’t rely on someone else, and adhere to it with your own discipline. It is quite vague in many points, but it is something like that. But in truth, there’s only one thing that I have decided myself to do though.” (Makoto)</p><br/><p>“What would that be?” (Makoto)</p><br/><p>Maybe she is used to listening to the talk of others, it feels like this Priestess-san is easy to speak with.</p><br/><p>…One of the reasons might be because she is a kid though.</p><br/><p>“To continue with the bow. In the future, no matter what path I take, no matter what employment I have, no matter what place I end up living in, I have decided to continue with the bow for the rest of my life. That’s all there is.” (Makoto)</p><br/><p>“…I see. To continue doing something, no matter what it is, it will require strong will. It may be difficult, but I think it is a splendid thought.” (Chiya)</p><br/><p>“Thanks. I feel like I am being comforted though.” (Makoto)</p><br/><p>“When you decide you will do it, you will definitely do it…” (Chiya)</p><br/><p>“Priestess-sama? By the way, how are you feeling? If you are still not feeling well, I can provide you with medicine just in case.” (Makoto)</p><br/><p>“Wah? ah…I-It’s okay.” (Chiya)</p><br/><p>“I see. In that case, it is already late, so how about returning to your room? If you need to, I can accompany you partway.” (Makoto)</p><br/><p>“I will return by myself. I am grateful for your consideration. Sorry for intruding so late in the night. Have a good night.” (Chiya)</p><br/><p>“Good night.” (Makoto)</p><br/><p>How old was the girl I was talking to?</p><br/><p>That’s the kind of impression I had remaining even now.</p><br/><p>“Ah, Boss. Welcome back. The priestess was here a while ago, you know. Didn’t you meet her on the way?” (Lime)</p><br/><p>“Yeah, I did. That girl, she came alone to this room huh.” (Makoto)</p><br/><p>“Yeh, she said she wanted to apologize to Boss. I told her that you are not someone who would mind that, and that I would tell you when you come back, so she should return and sleep, but she didn’t listen.” (Lime)</p><br/><p>“I see. Well, the talk felt similar to that, Gentle Large Tree-san.” (Makoto)</p><br/><p>“Hah?” (Lime)</p><br/><p>“The white featureless one will go to sleep now. Good night.” (Makoto)</p><br/><p>“Okay…Good night, Boss.” (Lime)</p><br/><p>The day of leaving Limia is close.</p><br/><p>The home of Hibiki-senpai, the Limia Kingdom.</p><br/><p>I did think that it was somewhat comfortable, but…it became a lot more tiresome visit than I expected.</p><br/><p>I don’t have the power to think about the future of the country and the world in whole like Senpai does.</p><br/><p>I can’t even understand individuals well, so there’s no way I would be able to understand hundreds of wills, and the country that is like the crystallization of the race’s will.</p><br/><p>The Demon Lord, Senpai, and the Kings of each nation probably understand those things though.</p><br/><p>But I who can’t even grasp the circumstances and tendencies of my company employees, this is just a heavy talk.</p><br/><p>I can’t do it, but I should at least make an effort huh.</p><br/><p>I should try to pursue what I can do.</p><br/><p>When I return to Asora, I should try speaking with Tomoe and Shiki about it. Ah, when I return, I should show myself in Kaleneon.</p><br/><p>….After that, a small talk with Zef…</p><br/><p>Because I was doing some thinking, or more like, a lot happened and it is already this late of an hour, my thoughts were cut off in the middle.</p><br/><p>Drowsiness is the best.</p><br/>\n</div>"}