{"title": "Chapter 216: I heard from a whale", "id": 216, "volume": 3, "url": "http://boxnovel.org/tsuki-ga-michibiku-isekai-douchuu-chapter-216-i-heard-from-a-whale", "volume_title": "Volume 3", "body": "<h1>Chapter 216: I heard from a whale</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>You thought there wasn’t going to be a chapter today?! Well surprise!!! (Actually, I barely made it.)</p><br/><p>I was able to get the meeting with Zef at the night of this same day.</p><br/><p>I apologized to Eva who had regained consciousness, and since I had the chance, I also visited Ruria.</p><br/><p>Before heading back to Asora, I contacted Zef via Rona, and it turned into meeting him tonight.</p><br/><p>What a flexible schedule this king has.</p><br/><p>Since it was sudden and they have a variety of matters at hand, they couldn’t throw a warm reception, but I don’t wish for something like that in the first place.</p><br/><p>I am the one who requested it, so I fully intended to go to their capital myself.</p><br/><p>But they said something about the preparations of welcoming blah-blah-blah, and I felt like they dodged the topic when they refused. In the end, we are going to be meeting at the place where I met with Rona and Io the time when I went to visit the demon race territory.</p><br/><p>Why is it. Even though I said that I would arrive at the promised time if they just wait. Maybe they didn’t trust me?</p><br/><p>Is that the reason why they went through the trouble of designating a meeting point that is close to our location?</p><br/><p>Zef is the Demon Lord, and yet, the moment I asked him to make a moment where I can meet with him, not only did say he would come meet me in person, it was even in the same day I asked him, which makes me think I am not being treated badly.</p><br/><p>I think that way, but…</p><br/><p>Oh well, worrying about it won’t progress anything.</p><br/><p>Anyways, if there’s useful information for Kaleneon, I want to know, and it is also true that I want to try throwing him the question that I had in Limia.</p><br/><p>“Waka, I heard of it!”</p><br/><p>“Tomoe huh. I heard that you have been shut in with Shiki when you find the time. Just what are you doing?” (Makoto)</p><br/><p>Lately, I have only seen Tomoe in meal times, but she has now come to where I am.</p><br/><p>Right now, I am in the Elder Dwarf workshop to tell them about the remodelling of the drill spear.</p><br/><p>That she has come all the way here to talk to me must mean that the two have reached some sort of result, or maybe they have thought of something that is not concrete yet?</p><br/><p>I don’t want to think it is the case, but there’s the chance that something bad has happened.</p><br/><p>The chances of it being a good happening is…none.</p><br/><p>“Oh, I have gratefully read the memories of the archives of Waterfall. Later, please give me a report…wait, right now that doesn’t matter, Waka!” (Tomoe)</p><br/><p>“Yeah…” (Makoto)</p><br/><p>It doesn’t matter?</p><br/><p>Even though you were browsing it pretty happily…</p><br/><p>“That Serwhale said that Waka had gone to the snow mountains of Kaleneon and dug up a hot spring!” (Tomoe)</p><br/><p>“Y-Yeah, I did. It can be used as a countermeasure for the winter, and I thought that it can used as a selling point as well.” (Makoto)</p><br/><p>“Hot springs, taking a bath, restorative properties! HOT SPRINGS!” (Tomoe) </p><br/><p>“You are rebounding Tomoe.” (Makoto)</p><br/><p>“I want to take my time and soak in it.” (Tomoe)</p><br/><p>Tomoe suddenly falls into a tranquil tone.</p><br/><p>But something was still welling up from her whole body.</p><br/><p>“I understand how you feel. But first we have to confirm the components of it to see if it is a hot spring that we can enter just like that, and that’s after we finish the construction work of it. Well, I think we can manage something by spring. When it is currently in its source, it has too high of a temperature to bathe in, so there’s the need to dilute it as well. In that case, it might be easier to draw the water all the way to the river. At any rate, it is impossible to use it currently.” (Makoto)</p><br/><p>“If it’s fresh water, it is fine if it’s warm. It is not on the point of boiling. I can manage.” (Tomoe)</p><br/><p>“Won’t do. Also, even if we make a hot spring like that in a hurry, the only ones who would be able to use it are people like you.” (Makoto)</p><br/><p>“Uh~, is that a no?” (Tomoe)</p><br/><p>“I’m telling you to wait. If you want one that much, why don’t you go find one in the volcanoes of Asora. If you do that, it would be easy to gather the people and work on it.” (Makoto)</p><br/><p>“…I have already searched the volcanoes, but I just can’t find a good one, Waka. When I open a hole in a place that looks like it might work, the most that comes out is ores.” (Tomoe)</p><br/><p>To think that she has already tried looking for one.</p><br/><p>As expected of Tomoe.</p><br/><p>It is impressive that she already had a grasp of the existence of hot springs, but that she went into action is also impressive.</p><br/><p>But is it that difficult?</p><br/><p>I did it on the first try though.</p><br/><p>Maybe there’s no hot springs in Asora?</p><br/><p>Just in case, I should try asking the surroundings.</p><br/><p>Serwhale-san and the Neptunes seem to know of the real deal, so there might be something similar to it in the bottom of the ocean.</p><br/><p>If we find one, we can just remove the water from the surroundings and create a hot spring-like place at the bottom of the ocean.</p><br/><p>…The problem is if Tomoe can accept that though.</p><br/><p>I can also try asking the bears and the wolves to see what they have to say.</p><br/><p>Can’t throw the possibility that one has already come out.</p><br/><p>In my original world, there were animals like deers and monkeys entering the hot springs after all.</p><br/><p>“You wanted to enter a hot spring so much that you came all the way here?” (Makoto)</p><br/><p>“Please! And then, I will bring a warmed sake and gaze at the snow as I drink! That kind of first experience in a hot spring would be extreme bliss for me! Knowing that Kaleneon is currently covered in snow, and there’s already a hot spring on top of that, I…I am already…!!” (Tomoe)</p><br/><p>Tomoe writhes as if suffering from withdrawal symptoms.</p><br/><p>Lately, Tomoe has been in a serious and languid mood, but…Tomoe is still Tomoe huh.</p><br/><p>These days she has been hooked on *Certain kill monk*, so it must have made her have even more interested in hot springs. </p><br/><p>In those times when I read all that stuff about the healing properties of hot springs, I was the same. Looking at Tomoe, I am beginning to crave entering one as well.</p><br/><p>Postponing the plan of putting the hot spring to practical use, we should first investigate if it has the components of a hot spring and learn if it’s okay to bathe in it. If that’s the case, let’s make a bathtub for it.</p><br/><p>“Well then Tomoe, go check if the properties of the hot spring are ideal. If it can be used, gather the people that can be mobilized and create a bathtub of stones or something to begin with. However! The people that participate in it will have to participate in the public works related to the hot springs of Kaleneon as well, no questions asked. Also, make sure not to force yourself.” (Makoto)</p><br/><p>“!! Of course! We have been in a stalemate on our side, so this is a convenient happening!” (Tomoe)</p><br/><p>“…Is that related to what you said a moment ago about a report?” (Makoto)</p><br/><p>“Yes. I spoke with Shiki as well, but it has reached a point where we will need the permission and cooperation of Waka in order to proceed. Well then, wait for me, hot springs!” (Tomoe)</p><br/><p>Just like how Tomoe entered, she ran towards the door.</p><br/><p>She is boisterous, but when Tomoe has those eyes, she is reliable, so it helps me out a lot.</p><br/><p>But that report related thing seems to be troublesome enough to leave for later huh…</p><br/><p>“Oh, Waka.” (Tomoe)</p><br/><p>Is what I was thinking when Tomoe places a hand on the doorknob and turned to look back.</p><br/><p>“What?” (Makoto)</p><br/><p>“Is this Waka’s permission, order, or request?” (Tomoe)</p><br/><p>“…Well, I don’t intend to push you guys, so a request.” (Makoto)</p><br/><p>“It’s been awhile since we have received a request from Waka. The goal is: finish in two days-ja!” (Tomoe)</p><br/><p>This time Tomoe actually left.</p><br/><p>When she said the goal is two days, did she mean making the hot spring?</p><br/><p>That’s not it, right?</p><br/><p>Because I asked her to check it out just now, and it is not like Asora has so much free time.</p><br/><p>The first town that is close to my house is still continuing its construction, and the port town is still in the middle of soil preparation.</p><br/><p>That mountain has bad visibility as well, so the work will be rough.</p><br/><p>She probably really said that with the intentions of finishing in two days.</p><br/><p>“Waka-sama! I have heard of it!!”</p><br/><p>What’s this feeling of deja vu?</p><br/><p>There’s a slight difference in the voice and words, but it is practically a replay of just now.</p><br/><p>“Ema?” (Makoto)</p><br/><p>This is again an unexpected one.</p><br/><p>When I meet with her, it is mostly in moments when we have already planned beforehand.</p><br/><p>From my part, I normally just go talk to her when I find the time to, but when she comes to me, she properly makes an appointment first.</p><br/><p>It is extremely rare of her to come rushing so suddenly in this manner.</p><br/><p>Moreover, all the way to the workshop of the dwarfs.</p><br/><p>…Is it an incident this time around?</p><br/><p>“Ema, what’s wrong?” (Makoto)</p><br/><p>“I heard from Serwhale-san!” (Ema)</p><br/><p>…Even Ema with the hot springs?</p><br/><p>Hot springs are super popular huh.</p><br/><p>There should be one in Asora somewhere, so maybe I should try searching seriously for one?</p><br/><p>“About the hot springs? If it’s about that, I have already given permission to Tomoe, so you can just cooperate with her and…” (Makoto)</p><br/><p>“I heard you used a Draupnir?!” (Ema)</p><br/><p>“Eh? Dra…?” (Makoto)</p><br/><p>Upnir?</p><br/><p>Ah, I was mistaken, it wasn’t about the hot springs.</p><br/><p>“I heard that you threw it into a reservoir.” (Ema)</p><br/><p>Ema has a serious face.</p><br/><p>It seems it was the wrong topic.</p><br/><p>“Ah, about that. It is true that I did throw it. It splendidly blew up and it was a big failure. I messed up that one.” (Makoto)</p><br/><p>“I heard you tried to use that ring to heat the water of the pond?” (Ema)</p><br/><p>“Yeah. I tried it thinking that it could be used to automatically heat things up in the winter.” (Makoto)</p><br/><p>To think that it would turn out that way.</p><br/><p>The pond was gone and maybe because of the waves of the explosion, a mass of hot gale collided onto us.</p><br/><p>Thanks to that, the snow on the surroundings melted and the ground was a mess.</p><br/><p>When that freezes over, it will be a problem again. I truly did something bad.</p><br/><p>“I reported it before, but me and a number of others have been thinking about a way to utilize the scrapped Draupnirs that have Waka-sama’s magic power stored. But the utilization of the ring is hard and just trying to dispose of them is a chore, and there’s also danger to it.” (Ema)</p><br/><p>Right right, I remember now.</p><br/><p>Ema was thinking of a method to utilize them aside from simply disposing of them.</p><br/><p>If there’s a mistake in the disposal process, there’s times when it might turn dangerous, so the disposal of Draupnirs is difficult.</p><br/><p>From what she has thought, it seems like she plans on using them for things like the town’s lighting, to power the workshops, and to maintain the barriers in the several points.</p><br/><p>“I should have asked for confirmation before using it. I tested it with one just in case and it didn’t go out of control, so I got overconfident. I should have tested it not only in my hand, but by throwing it inside of water as well.” (Makoto)</p><br/><p>“We are talking of Waka-sama, so I don’t think you were hurt, but I did get slightly worried there. The Draupnirs are troublesome rings that are incredibly hard to deal with. Please be careful.” (Ema)</p><br/><p>“As I thought, even the way of dealing with it is special. It is certainly true that it was strangely unstable.” (Makoto)</p><br/><p>“It goes well until the point of giving it a function. The problem is that when it surpasses a certain point in power, the moment it leaves the hand of the person doing the process…” (Ema)</p><br/><p>“It goes out of control in an instant.” (Makoto)</p><br/><p>Seriously, what a ring, even if I do say so myself.</p><br/><p>“If it’s on the level of having it in hand and utilizing when it is still there, it’s incredibly useful. But once it reaches the dangerous point, the element and function it is given is transformed into output power in an instant, and just like that, after repeating the process of increasing its own power, it surpasses the limit it can take and explodes.” (Ema)</p><br/><p>H-How picky.</p><br/><p>I see.</p><br/><p>When I made it a heating tool, the moment it left my hand, it turned unstable and increased in power instantly.</p><br/><p>It feels like a baby that begins to cry the moment it leaves your arms.</p><br/><p>Hm?</p><br/><p>Hm hm?</p><br/><p>Something is bothering me here.</p><br/><p>“Wait Ema, wait for a moment please. When I did it, the ring didn’t break, you know?” (Makoto)</p><br/><p>Right.</p><br/><p>“That’s it! That’s why I rushed all the way here!” (Ema)</p><br/><p>Ah, so that’s the reason of the strange action of Ema.</p><br/><p>What I did was bad, but it was also an irregular result.</p><br/><p>“Please tell me about that moment in detail!” (Ema)</p><br/><p>“Is it okay if I am present for this as well, Waka-sama?”</p><br/><p>“Elder-san?” (Makoto)</p><br/><p>“Currently, we have been cooperating with Ema-dono and finally found one way to utilize the ring of Waka-sama. But if we can hear in detail about what Waka-sama has experienced, we might be able to find a future for the utilization of it. Well, it is simply the instinct of an old craftsman though.” (Elder)</p><br/><p>“…By the way, what is this use you found?” (Makoto)</p><br/><p>“It would be best to demonstrate it. Hey.” (Elder)</p><br/><p>Taking the opportunity when Ema makes her request, the Elder joins the conversation.</p><br/><p>It is in the matter of the uses for my rings, so I was interested in what they have accomplished and when I asked the Elder, he called someone at the deep parts of the workshop.</p><br/><p>The voice of the Elder wasn’t that high, and yet, a response with good energy soon came.</p><br/><p>Then, one dwarf showed up.</p><br/><p>When he notices me and Ema, he lowers his head deeply.</p><br/><p>“Bring that.” (Elder)</p><br/><p>“Understood!”</p><br/><p>The dwarf who went inside again, returned to where we were with some sort of package.</p><br/><p>“Show it.” (Elder)</p><br/><p>“Yes!”</p><br/><p>He takes the cloth off the package, and what came out of it was a spear.</p><br/><p>But even if I say spear, it is not the drill spear.</p><br/><p>It is a strange spear.</p><br/><p>The bladed part looks like the lances that are used in horseback, a cone-shaped one.</p><br/><p>Even so, the handle is long.</p><br/><p>The lower part of the cone is shaped like a bowl, and as if protecting it, there’s transparent crystal-looking spherical part attached to it, and from there, the handle is adhered to it.</p><br/><p>The edge is thin, and if it were a normal spear, it would be like the throwing type, a javelin, but…what is this?</p><br/><p>“I have named it *Bakusou*. I plan on distributing it to the Winged-kin.” (Elder) </p><br/><p>“Bakusou…” (Makoto)</p><br/><p>“I think you can see the transparent spherical part.” (Elder)</p><br/><p>“Yeah.” (Makoto)</p><br/><p>“There, we will set the Draupnir that was planned to be disposed.” (Elder)</p><br/><p>“I see.”</p><br/><p>“And after that, you simply throw it. When the lance part detects impact of a certain degree, the ring will activate and create an explosion.”</p><br/><p>So that’s why it is called Bakusou. </p><br/><p>I see, if it is for the use of weapons, explosions are welcomed.</p><br/><p>It is also the most simple of directions.</p><br/><p>I think that reaching the level of practical use was quite difficult though.</p><br/><p>“When Waka-sama said that you used the rings to increase the power of Brid, this is something that was worked on by the dwarfs as an armament to put this principle into use.” (Ema)</p><br/><p>Ema gives a supplemental explanation.</p><br/><p>It is certainly true that I combined it with Brid and increased its destructive power.</p><br/><p>It is difficult to use as a weapon, but if we use it by throwing the unstable ring, it is pretty simple to understand.</p><br/><p>“If there’s no battle, it can’t be used, but in a battlefield, one attack can dispose of one ring.” (Ema)</p><br/><p>We were planning on disposing them from the beginning, so it is fine to just use it with the intentions of throwing it away as well.</p><br/><p>It kinda sounds…reasonable.</p><br/><p>If Ema says it this way, it must mean that from the beginning, she saw worth in them and was thinking about a way to utilize them.</p><br/><p>“But…” (Ema)</p><br/><p>Ema continues.</p><br/><p>“The Draupnir that Waka-sama threw into the pond seems to be stable even within the lava. I want to see the real thing in person. If a method to restrain the ring from going out of control is born with the information of the circumstances and what Waka-sama did…” (Ema)</p><br/><p>“It would be possible to utilize it for the livelihood that we were originally planning to use it for. If that happens, the Draupnir will turn from a troublesome article into an incredible resource. It would be a dream come true.” (Elder)</p><br/><p>And then, progress will be made for the tool that will be able to deal with them.</p><br/><p>I am the main culprit for the production of these rings, so this is quite the pleasant talk.</p><br/><p>There’s no way I won’t cooperate.</p><br/><p>“It would be nice if I am of help though…” (Makoto)</p><br/><p>Saying so, I spoke to the two about my big failure in a truly detailed manner.</p><br/>\n</div>"}