{"title": "Chapter 214: Speaking of winter…", "id": 214, "volume": 3, "url": "http://boxnovel.org/tsuki-ga-michibiku-isekai-douchuu-chapter-214-speaking-of-winter%E2%80%A6", "volume_title": "Volume 3", "body": "<h1>Chapter 214: Speaking of winter…</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 214: Speaking of winter…</p><br/><p>Translator Note:</p><br/><p>Heya guys! First things first, thank you for all the great recommendations, the massive amount of feedback surprised me a lot.</p><br/><p>This chapter was luckily a pretty short one, so I was able to check a few of them, and look for some prospects on my own.</p><br/><p>Let me be clear on one big misunderstanding though.</p><br/><p>I am not slowing down the translations for Tsuki and no, I won’t be taking two projects at once. There’s still a good number of chapters in Tsuki left, so I wanted to begin the candidate selection now since I know choosing a new novel is not an easy task.</p><br/><p>Choosing a new translation is like marriage, I will take my time in searching for that perfect one.</p><br/><p>In that sense, Tsuki was literally a blind marriage where I knew nothing of my partner and said “Hey, that one doesn’t look bad!” and just randomly married. Which turned out to be a real jackpot (lol). (Don’t marry blindly people, it doesn’t turn out like that all the time!)</p><br/><p>But of course, it wouldn’t be possible without the help of you readers! The support has given me the strength to actually persevere to where I am now.</p><br/><p>…Someone smells the cheese? CAUSE I LOVE CHEESE.</p><br/><p>Now that I think about it, Limia is really a wealthy and easy to live in country.</p><br/><p>I remember Hibiki-senpai, the priestess Chiya-san, Prince Joshua, and the other many that came with us to the national border to see us off.</p><br/><p>I felt like it was quite extravagant for an escort, but it seems they also had some other business.</p><br/><p>If it’s that, I can understand.</p><br/><p>Even till the end, Chiya-san didn’t open her heart, and had a stiff face from beginning to end.</p><br/><p>She didn’t leave the side of Senpai, and it seems I have become quite the scary existence.</p><br/><p>With Chiya-san in that state, and the good willed attitude of Hibiki-senpai and prince Joshua, I thought that their load of work must been heavier because of that, which made me depressed.</p><br/><p>….When looking at the priestess being all business-like and doing her best because it is needed, I just can’t see her being the same age as Rinon, and within me, she had become Chiya-san.</p><br/><p>I can’t bring myself to call her Chiya-chan.</p><br/><p>Senpai calls her that way though.</p><br/><p>“Even so, this is my first time coming here but, is Kaleneon always snowing?” (Lime)</p><br/><p>It is Lime.</p><br/><p>Right.</p><br/><p>The reason I began thinking that Limia is a wealthy land was because of this snowy landscape.</p><br/><p>I can’t see a speck of light brown ground.</p><br/><p>It is also because this is the outside of the town, but this is the very definition of a snow country. No, it makes me wonder if this is even a place where people would be able to live in.</p><br/><p>Honestly speaking, I have grown tired of looking at it, and to reach the town, there’s the need to walk for several more minutes.</p><br/><p>Let’s hop there.</p><br/><p>I wanted to show myself to the Winged-kin and Mist Lizards that are guarding the national borders, so I didn’t teleport directly to the town that Eva is in.</p><br/><p>And I thought it would be nice to walk through the snowy path, which was a mistake.</p><br/><p>The path had snow pushed to the sides and it rose like walls, making it feel like an enclosed area. Are they doing this everyday?</p><br/><p>They must be. If not, the path would be covered in snow and I wouldn’t be able to tell which is the path.</p><br/><p>How fearsome is the north.</p><br/><p>When heading to the demon race territory, it turns from a snowy field into an icy one after all. The wind also turns hectic. Well, at least Kaleneon is better since you are able to live in it after shoveling the snow huh.</p><br/><p>“Isn’t it nice to have a lot of snow? If you put sweet concentrated fruit juice, it can become a splendid desert-desu yo, Lime.” (Mio)</p><br/><p>“Nee-san… frozen sweets taste good in hot weather, but in this cold it is just…” (Lime)</p><br/><p>Mio’s thought has probably been imagined by Japanese people at least once.</p><br/><p>…Like for example; grade schoolers that love shaved ice.</p><br/><p>Tired of seeing the same pure white landscape for who knows how long, I didn’t feel in the mood for that.</p><br/><p>And in reality, for the people that have to do work in this kind of place everyday, they wouldn’t think of such an idea.</p><br/><p>“Normally, there’s the need of shaving the ice, so in a place like this where it snows this much, I can eat until I am satisfied-desu wa.” (Mio)</p><br/><p>“If you eat too much at once, your head will hurt, Mio. At this rate, it will be the same sight until we reach the town so, let’s hop there.” (Makoto)</p><br/><p>“Yes, Waka-sama.” (Mio)</p><br/><p>“That will be a great help-ssu, Boss.”</p><br/><p>For some reason the two began a conversation about food, but it seems like internally, they both felt the same way as me, they gave an immediate answer to my proposal.</p><br/><p>With a Mist Gate, we hop to the only town currently existing in Kaleneon.</p><br/><p>The location is the second floor of the Adventurer Guild branch in Kaleneon.</p><br/><p>When going to the town, we normally teleport there.</p><br/><p>“Ah, are you new adventurers?”</p><br/><p>“Idiot! They are from Kuzunoha Company! The representative Raidou-sama, his escort Mio-sama, and…”</p><br/><p>The staff member stationed there mistook us for adventurers.</p><br/><p>But the person on her side soon retorted to this.</p><br/><p>This is the first time I see someone mistaking us, so maybe she is someone that hasn’t been here for long.</p><br/><p>But well, the staff member that corrected her was stuck in her words cause it seems like it is the first time she sees Lime.</p><br/><p>“I am Lime Latte. I do miscellaneous jobs for Kuzunoha Company-ssu. I am a former adventurer so well, just be at ease around me.” (Lime)</p><br/><p>“So you can become an employee of Kuzunoha Company even when you have the history of being an adventurer…”</p><br/><p>“You, just shut up already.”</p><br/><p>“Aw…, I-I am sorry~.”</p><br/><p>The newbie staff member returns a reaction that’s off point towards the self-introduction of Lime.</p><br/><p>It is not like the Kuzunoha Company doesn’t employ adventurers though.</p><br/><p>Being chewed by her superior for a second time, she scratches her head as she apologizes to Lime.</p><br/><p>“I have come to check the state of the town. Can you tell me where Eva and Ruria are?” (Makoto)</p><br/><p>“At this time…I think both are at the hall. There have been unexpected snowfalls in succession, and adding up with the current situation where it is getting colder by the moment, they should be in the middle of a meeting.”</p><br/><p>“As expected, this amount of snow is a lot.” (Makoto)</p><br/><p>“It seems like removing the snow is taking quite the amount of personnel and expenses, by using magic, it is possible to settle the matter for the moment but…it is easy to see that in the future, this problem will be continuing, so they are thinking of a solution for the root of the problem.”</p><br/><p>“You are pretty detailed.” (Makoto)</p><br/><p>“Even if we are the Adventurer Guild, having the town enclosed by snow in the winter isn’t a desirable situation. If there’s a good countermeasure for this, we won’t be frugal in our cooperation. Of course, there’s already permission from the tops.”</p><br/><p>“For this town -no, for the country, the Adventurer Guild is a big power. I look forward to working with you from now on.” (Makoto)</p><br/><p>“Here as well.”</p><br/><p>She lowers her head deeply.</p><br/><p>Kuzunoha Company is in charge of practically the whole supply of goods in this town, and we are being held up relatively high.</p><br/><p>I have already gotten used to this treatment.</p><br/><p>It seems like they are in the middle of a meeting, so I didn’t use thought transmission and look at the state of the town while heading for the specially big building that is used as the center for administration.</p><br/><p>“The energy is still insufficient-ssu ne.” (Lime)</p><br/><p>“In the first place, it is a mistake to compare it to Tsige and Rotsgard, Lime.” (Makoto)</p><br/><p>“I know that, but with the Guild and the state of the town, I feel like there’s a variety of things that are lacking.” (Lime)</p><br/><p>“Well, yeah.” (Makoto)</p><br/><p>Even though it is not to the level of when we were walking through the walls of snow, even when we entered the town, there was still a certain pressure, or more like, a sense of enclosure.</p><br/><p>As if the snow that is falling continuously in the town was piling up and silently cornering the whole town.</p><br/><p>The environment is completely different after all.</p><br/><p>It seems like the land Eva and Ruria had as their territory in the past didn’t have such deep snow.</p><br/><p>This place in itself was made half because of our own circumstances after all.</p><br/><p>It would be nice if we could be of help somehow.</p><br/><p>“To begin with, there’s no soil to grow delicious things with how the town currently is-desu wa ne. Instead of calling it a newborn, it is more like on the verge of death-desu wa.” (Mio)</p><br/><p>Mio doesn’t have mercy.</p><br/><p>“That’s saying too much-ssu, Nee-san. I concur with what you say though.” (Lime)</p><br/><p>“Eva is doing her best though.” (Makoto)</p><br/><p>Lime and I were of the same opinion as what Mio said at the latter half.</p><br/><p>What Mio said about there being no soil to grow delicious things might be referring to the lack of energy.</p><br/><p>“This is! Raidou-sama, Mio-sama. It’s great that you have come visit us.”</p><br/><p>After walking for a while, the guard of the building confirmed our figures, and after fixing his posture, he welcomed us.</p><br/><p>“I didn’t give any contact beforehand, but I have come here to see the faces of Eva and Ruria. Can I meet them?” (Makoto)</p><br/><p>If it can’t be done immediately, I can just walk around town for a bit more.</p><br/><p>Thinking about it in that way, I ask.</p><br/><p>“…Right now, it might be important to have the opinion of someone that is not a resident, or so it seems. I will guide you immediately.”</p><br/><p>He probably conversed with someone in thought transmission, the guard opened the path for us.</p><br/><p>The one that is currently stationed here is…Ema or a friend of hers.</p><br/><p>No…maybe a hyuman or a demi-human that they have selected.</p><br/><p>We were guided by a Highland Orc that came from the inside, and the meeting room……we pass by it and stand in front of the private room of Eva.</p><br/><p>Weren’t they in the middle of a meeting?</p><br/><p>Maybe it didn’t go well.</p><br/><p>Just me being here is probably enough to make one’s stomach hurt.</p><br/><p>“Come in.”</p><br/><p>When the Orc knocks, a voice comes from inside.</p><br/><p>Eva’s voice.</p><br/><p>From the voice, I could perceive exhaustion.</p><br/><p>“Long time no see, Eva. I heard that you are being quite troubled by this cold and snow.” (Makoto)</p><br/><p>Since coming to Kaleneon, Eva has been using formal speech with me even though she is older, which I don’t like.</p><br/><p>Before I got used to it, it felt incredibly uncomfortable, but now I think I am somehow able to talk normally.</p><br/><p>“Raidou-sensei.” (Eva)</p><br/><p>Looking at Eva straight from the front, I could certainly tell that she was incredibly tired.</p><br/><p>Things like make-up, her hair, and her attire; the parts that she would normally not be negligent about, I could tell that she was slowly growing negligent about it.</p><br/><p>In my time at Japan, I wouldn’t have been able to tell this at all.</p><br/><p>This is one of the specialties that I learned when coming to this world. I don’t know whether it will be useful or not though.</p><br/><p>This is a standard ability that hyumans come equipped with though.</p><br/><p>“Honestly…there’s a lack of personnel. And the money…the money to move people… We are training people specialized snow removal magic, but as expected, we won’t be able to deal with it promptly. It may be a taboo word but, because it is winter…it is a situation I feel like giving up in.” (Eva)</p><br/><p>“Hearing that, can I assume that the pioneering and cultivation of new land is not advancing?” (Makoto)</p><br/><p>“Yeah. The fields that we have, have been plowed and crops are being cultivated, but we were unable to secure the planned scale.” (Eva)</p><br/><p>“With this amount of snow, it can’t be helped.” (Makoto)</p><br/><p>“I think…there’s plenty enough methods to deal with it. But the problem is that I am lacking in experience and knowledge. In my time as a noble, if I had learned of how to manage the territory from the nobles that possess territories in the north, the situation might have been different. Seriously, just what was my past self doing?” (Eva)</p><br/><p>Stressing over that won’t help in any way.</p><br/><p>Eva must be pretty tired out.</p><br/><p>Seeing her muttering is kind of scary.</p><br/><p>“Even for Ema and the others that were dispatched here, with this much snow, I don’t think it is a matter of experience. It is the first year, so in the beginning, I think it would be best to not be completely influenced by the plans and continue in a pace that is adequate.” (Makoto)</p><br/><p>There’s still several years of leeway before we get involved with foreign countries after all.</p><br/><p>It wouldn’t be good to hurry it.</p><br/><p>“We can’t do that!!” (Eva)</p><br/><p>“…Eh?” (Makoto)</p><br/><p>It was an unexpected reaction.</p><br/><p>Eva suddenly raised her tone.</p><br/><p>“I am not at an age where I can waste year after year! You know just how important time is for Kaleneon right…Raidou-sensei? I am sorry for shouting.” (Eva)</p><br/><p>“N-No, don’t mind it.” (Makoto)</p><br/><p>It has become an atmosphere where I can’t say that since it is an unexpected situation, it should be okay to think up a countermeasure this year.</p><br/><p>“Ema-san and the others have become a big help as well. They introduced a number of crops that generate heat, and even if it’s not all, there’s some crops that were in the land of Kaleneon in the past growing in the fields as well. The growth is fast, and the snow of the surroundings is being removed in an acceptable level, so it is become a priceless treasure.” (Eva)</p><br/><p>It is the first time I hear of such a crop.</p><br/><p>…No, from the crops that I was taught of the wasteland, Asora, and this world, there were no hot things.</p><br/><p>If it becomes an ordinary occurrence when gathering them, it is obvious that I wouldn’t know huh.</p><br/><p>I have practically no involvement in the farm work after all.</p><br/><p>The amount of people that know the specialties of the crops that are in the middle of growing are few.</p><br/><p>The most I know is that the crops of Asora require a lot of nutrients, and when these crops are grown outside of Asora, it becomes a situation that can’t be laughed at.</p><br/><p>A crop that produces heat huh.</p><br/><p>Must be a wasteland one.</p><br/><p>“It is an amount of snow that would even make you lose the location of the fields after all. Ah, but if it just melts the snow, wouldn’t the earth get all soppy because of water?” (Makoto)</p><br/><p>It is not like the snow will disappear.</p><br/><p>It most likely only melts, so obviously, the melted snow becomes water.</p><br/><p>Can it be used in the fields?</p><br/><p>I feel like it would become a paddy field though.</p><br/><p>“Regarding the water, we have a root crop that has good affinity to it, so there’s no problem. Of course, we are contemplating in creating a waterway to drain it to a river. Just that…” (Eva)</p><br/><p>“Just that?” (Makoto)</p><br/><p>“When the water flows through the waterway and gets slightly apart from the field, it ends up freezing. On top of that, the three rivers that are flowing around the surroundings of the town, are currently all frozen and can’t be used.” (Eva)</p><br/><p>“…”</p><br/><p>A river frozen over?</p><br/><p>It is a word that I am not used to, so my thoughts stopped for a second there.</p><br/><p>…No well, it is running water, so when it gets cold it does freeze huh.</p><br/><p>The harbour of the demon race is practically on an unusable state from the end of fall to spring, that’s why they wanted to secure an ice-free port so much.</p><br/><p>If the sea freezes, it is a given that rivers will freeze too.</p><br/><p>“The bottom part seems like it is not frozen, so it is not like it can’t be used at all. By melting the snow, we can procure water for living. It is a fact that we will have to utilize unnecessary personnel and it is more trouble.” (Eva)</p><br/><p>Eva places a hand on her forehead and makes a small sigh.</p><br/><p>I see. So in the end, they are going around in circles.</p><br/><p>The lack of personnel, and the snow and cold that is the main culprit of this.</p><br/><p>If we are able to at least reduce the trouble it causes in the daily lives of the town, it would make it more comfortable.</p><br/><p>Like for example…</p><br/><p>“If there’s something that can be used as reference, I don’t mind if it’s about anything, I would like to hear it.” (Eva)</p><br/><p>Oh, the moment I was thinking about saying my idea, she came out with convenient words.</p><br/><p>“You are saying that if we reduce the trouble that the snow in the town and the fields is reduced, you will be able to put your hands in other matters, right?” (Makoto)</p><br/><p>“Yes.”</p><br/><p>“Then the irrigation canals that are being used in the town and fields, sewers, the barrels and vases used as water storages…how about changing the roof of the houses to make it produce light heat in order to make it so that it doesn’t freeze?” (Makoto)</p><br/><p>Have the places where the snow piles up produce heat on their own, and with that, we melt the snow in one end, making it easier.</p><br/><p>The footing will be consistently filled with water, but thinking about the amount of work it will take, I don’t think it can be put to practical use.</p><br/><p>“That has been taking into account. We adopted that method by the proposal of the dwarfs, but we are way too lacking in production materials. And regarding the houses and waterways that have already been made, there would be the need of a large scale construction work, so it isn’t progressing as expected.” (Eva)</p><br/><p>“Ah, so you have already tried that huh.” (Makoto)</p><br/><p>“When Raidou-sensei had gone to do a business discussion with the demon race, you said that instead of having the waterways for drainage in hard to see places, it would be better to have them underground, right?” (Eva)</p><br/><p>“I did say that.” (Makoto)</p><br/><p>“At that time, the dwarfs had the idea. When it lowers to a set temperature, there’s a sedge used in ceramics that produces heat and doesn’t freeze. It is currently being implemented in the roofs and as a material for construction works. Just that the manufacturing can’t catch up, so it will most likely show its effectivity next year.” (Eva)</p><br/><p>In other words, it won’t become a solution for the current situation.</p><br/><p>And they have already thought of the years to come and begun preparing them.</p><br/><p>I have underestimated them.</p><br/><p>As expected of the Elder dwarfs.</p><br/><p>I haven’t brought many people here, but even with the low numbers, they are doing their very best.</p><br/><p>Fuh~, I should think about the recruitment of dwarfs from Lorel, or I will feel bad for them.</p><br/><p>Cause their environment itself is at a place with a relative amount of volcanoes.</p><br/><p>…</p><br/><p>Volcanoes?</p><br/><p>Speaking of volcanoes, there’s many ores…no not only that…the smell of sulfur…Oh!</p><br/><p>Hot springs!</p><br/><p>That’s right, it is not about the dwarfs’ living environment or the mineral resources.</p><br/><p>This is it!</p><br/><p>The memories I had of travelling with my family revived in an instant.</p><br/><p>“Hot springs!” (Makoto)</p><br/><p>I ended up abruptly raising my voice.</p><br/><p>But it has come to me.</p><br/><p>No, I remembered it.</p><br/><p>“Hot springs? If I remember correctly, it is a local word of Lorel. Warm water that gushes forth, is what I think it meant…” (Eva)</p><br/><p>It seems like Eva knew of hot springs, her words didn’t carry certainty, but she still said it.</p><br/><p>That’s not it.</p><br/><p>Hot springs can’t be defined with such cheap words.</p><br/><p>You can enter them, at times, you can drink it as well.</p><br/><p>The soul of Japanese that love bathing…but well, let’s leave that aside for now.</p><br/><p>“I honestly feel complicated in having it being defined as simple warm water, but it is that.” (Makoto)</p><br/><p>“What is it about that hot spring? Don’t tell me, are you saying that hot springs can also come out from Kaleneon?” (Eva)</p><br/><p>“There’s plenty enough chance. But what I thought of is the method to use the hot springs.” (Makoto)</p><br/><p>“Ehm…hot springs are supposed to come out from locations with a pretty high temperature. And even in the times when Kaleneon was in good health, I hadn’t heard of hot springs, so even if you suddenly speak about a usage for them…” (Eva)</p><br/><p>Eva is bewildered.</p><br/><p>“Hot springs come out even in cold places. In the place that I visited in the past, it was winter, and was used as an effective method to remove snow. Because it is water that is warm the whole year after all.” (Makoto)</p><br/><p>“…In other words, you are saying that that place is cold enough to have snow and be able to freeze, and yet, they have warm water, that is hot enough to let out steam, flowing all year long?” (Eva) </p><br/><p>Oh, she is making an incredibly doubtful gaze.</p><br/><p>But I don’t think hot springs rely on the temperature of the area.</p><br/><p>Is it not the same here?</p><br/><p>Maybe I should check out the hot springs in Lorel just in case?</p><br/><p>“That’s right. Well, I think that it will be fine to have warm water in places that are currently troubled with the freezing and the fallen snow. At the very least, it will decrease the trouble with personnel quite a lot, right?” (Makoto)</p><br/><p>“True, that would be the case if it can actually be realized. The Adventurer Guild has a massive amount of snow removal requests and it has become hard to find requests in other matters.” (Eva)</p><br/><p>“Places like roofs, I honestly can’t think of anything right now about it, but for main streets and the waterways utilized for irrigation, it will be dealt with, right?” (Makoto)</p><br/><p>The more I think about it, the more useful it sounds.</p><br/><p>Thanks, hot spring district I forgot the name of.</p><br/><p>“In other words, Raidou-sensei is saying that we should look for hot springs in this state of affairs?” (Eva)</p><br/><p>The expression of Eva who was sitting down in front of me was saying: ‘that is unreasonable’.</p><br/><p>…Does she think I am a person that would say something unreasonable?</p><br/><p>Why is it, I feel kind of depressed.</p><br/><p>Something like looking for hot springs can be done by us, and with that as the onset, I think that the town will be able to move.</p><br/><p>“No, we will be the ones doing it. Also, you have the construction work to look after, and looking at the situation of the town, it would be impossible for you. The point is that it is fine as long as there’s warm water, so in this moment of urgency, if we are able to endure the situation with this, it will be fine.” (Makoto)</p><br/><p>“…Where are we going to find warm water at this time?” (Eva)</p><br/><p>“I have a perfect plan for that. If you leave it to us, we will begin tomorrow or the day after. At a price.” (Makoto)</p><br/><p>“If the Kuzunoha Company will move, our side’s weight will lower, so I will do something about the money, but…no, I understand. There’s still things I have to take care of, so I will believe in Raidou-sensei. The talk of Sensei leading Kuzunoha Company to take over the country has become famous in the taverns.” (Eva)</p><br/><p>“…As extra compensation, I would like you to reduce those talks about Kuzunoha Company and me.” (Makoto)</p><br/><p>“It is something to be proud about though.” (Eva)</p><br/><p>“My heart is not ready.” (Makoto)</p><br/><p>If I leave it be, it might become a conversation that will persist as the founding of Kaleneon.</p><br/><p>I am counting on you to rewrite that. Please fabricate a truth like: ‘the fallen noble daughters, Eva and Ruria, stood up against adversities and caused a miracle’.</p><br/>\n</div>"}