{"title": "Chapter 228: Studying at once", "id": 228, "volume": 3, "url": "http://boxnovel.org/tsuki-ga-michibiku-isekai-douchuu-chapter-228-studying-at-once", "volume_title": "Volume 3", "body": "<h1>Chapter 228: Studying at once</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 228: Studying at once</p><br/><p>Sponsored Chapter</p><br/><p>Being the beginning of the month, I wanted to thank all the people that became patrons in my patreon, and also the people that have been supporting me.</p><br/><p>Thanks a lot!</p><br/><p>By revolution, is he referring to the one that changes society? That revolution?</p><br/><p>Rembrandt-san nodded when I asked for confirmation, so there’s no mistake.</p><br/><p>When he said ‘this country’, did he refer to the Aion Kingdom?</p><br/><p>In other words, people that can start a revolt against the royalty have appeared.</p><br/><p>…Eh? Isn’t that a big deal?</p><br/><p>Why is Rembrandt-san so calm?</p><br/><p>“That’s right, a revolution. Regarding the details, I will be telling you as I teach Raidou-dono, but well, in terms of the time…I think it will start moving by summer.” (Rembrandt)</p><br/><p>“Summer?! T-There’s already less than a half a month left!” (Makoto)</p><br/><p>Even if Aion Kingdom is not a frontline country that is fighting directly with the demon race, it is one of the four major powers.</p><br/><p>If a big country, that’s at the rear and is in an alliance with Limia and Gritonia, begins a civil war, it would be no time to do war with the demon race.</p><br/><p>No no no.</p><br/><p>Isn’t this a lot more important than my resolve?</p><br/><p>If this country falls into civil war, even Tsige might get enveloped in the flames of war.</p><br/><p>I don’t want to think this is true but…could it be that this is also related with the demon race?</p><br/><p>“Hahaha, an organization that has been caught before doing their move, wouldn’t be able to do anything big like a revolution anyways. Catching them with a margin of half a month is already superb, Raidou-dono.” (Rembrandt)</p><br/><p>“By the way, this matter was not orchestrated by the demon race. It is not like they are completely unrelated, but they are not deeply related either.” (Morris)</p><br/><p>Morris-san read my mind.</p><br/><p>Even so…I think that a big affair like a revolution happening in half a month is outrageous, and I think that half a month passes by quickly.</p><br/><p>That’s what I think, but…</p><br/><p>It seems like Rembrandt-san and Morris-san think that half a month is plenty enough time.</p><br/><p>“And so, what did you want to consult with me regarding the revolution?” (Makoto)</p><br/><p>“Umu. I will be direct. I want you to witness and hear your opinions about the way Tsige will move at that time.” (Rembrandt)</p><br/><p>The way Tsige…will move?</p><br/><p>“And I wanted to hear about Raidou-sama’s thoughts regarding this revolution. That’s what it would be.” (Rembrandt)</p><br/><p>“My thoughts, is it.” (Makoto)</p><br/><p>In the first place, I don’t know much of Aion Kingdom.</p><br/><p>Frankly speaking, aside from Tsige, I don’t know of this country.</p><br/><p>If I remember correctly, it is a country that excels in information gathering, and their cavalry unit.</p><br/><p>That’s the most I know.</p><br/><p>“Sorry but, I don’t know the condition of Aion Kingdom itself, so I don’t have any sort of opinion in it.” (Makoto)</p><br/><p>Thinking about it once, I spoke my honest thoughts.</p><br/><p>This isn’t the moment to try looking good.</p><br/><p>“That’s fine.” (Rembrandt)</p><br/><p>“Hah?”</p><br/><p>“No well, that way is better, is how I should say?” (Rembrandt)</p><br/><p>“Uhm…”</p><br/><p>“If you had an opinion regarding this country itself with knowledge beforehand, I would of course want to hear that as well. However, what I want to hear more than that is how Raidou-dono views ‘revolution’ itself. It would be strange to call this a normal revolution but, Raidou-dono, what do you think about this?” (Rembrandt)</p><br/><p>So that means it doesn’t have to be centered in Aion huh.</p><br/><p>A revolution.</p><br/><p>It is a vague image, but it would mean that the tops of the country would change, right?</p><br/><p>Mainly by force or by illegal methods.</p><br/><p>And if as a result, the revolution is successful, the government and economy will change as well.</p><br/><p>If asked what I think about it, it would be that the allies will change depending on the times and society.</p><br/><p>If the government was good, there wouldn’t be a revolution to begin with, so if a bad government was going rampant, a revolution is a valid path for change.</p><br/><p>There would be a lot of side-effects because of it, but…I wouldn’t say it is completely wrong.</p><br/><p>In that case, my thoughts about it would be that depending on the situation, it is a valid method.</p><br/><p>“I don’t think it would be the correct method in all situations, but I do think that there’s times when a revolution is necessary.” (Makoto)</p><br/><p>“Hoh!” (Rembrandt)</p><br/><p>“That’s…” (Morris)</p><br/><p>I thought they wouldn’t like this incredibly vague answer of mine, but the reaction of the two was of simple surprise.</p><br/><p>“Did I say anything strange?” (Makoto)</p><br/><p>“…No. I was just surprised that you didn’t consider revolution as evil.” (Rembrandt)</p><br/><p>“If the government is corrupt, a revolution is bound to occur. I think there’s times when that happens. And when it is a revolution in those cases, I think it is something necessary.” (Makoto)</p><br/><p>“You see, a king that rules over the country, is someone that has been given the right by God to do it.” (Rembrandt)</p><br/><p>The Goddess huh.</p><br/><p>But that’s quite the valid way of thinking.</p><br/><p>Like, the king has the right, so he can rule the country.</p><br/><p>How was it called?</p><br/><p>I remember I learned it in world history.</p><br/><p>…The divine right of kings? </p><br/><p>Ah right, that’s the one.</p><br/><p>In the case of this world, it actually happens, so it is not a simple expedient though.</p><br/><p>“Meaning, the temple and the general populace think of revolution as absolute evil.” (Morris)</p><br/><p>Morris-san supplements the explanation.</p><br/><p>I see.</p><br/><p>That’s why my way of thinking that ‘it is necessary depending on the situation’ is already heresy in itself huh.</p><br/><p>Let’s be careful about that from now on.</p><br/><p>In the first place, this is the first time I have talked about the topic of revolution, so I doubt there will be more times to come.</p><br/><p>“In that case, I have said something bad. Sorry, I will be careful.” (Makoto)</p><br/><p>“No, I think Raidou-dono is in the right. But well, it isn’t something that you can disclose in public, so you are correct in taking note of it.” (Rembrandt)</p><br/><p>“Haha, thanks.” (Makoto)</p><br/><p>“Fumu. But with this, it has made it a lot easier to say.” (Rembrandt)</p><br/><p>“So true.” (Morris)</p><br/><p>It seems like Rembrandt-san and Morris-san were saying something to each other with their eyes.</p><br/><p>Is it my imagination? Even when we are in the reception room, it feels kind of stormy here.</p><br/><p>“Rembrandt-san? Could it be…you are participating in that revolution?” (Makoto)</p><br/><p>I nervously ask this.</p><br/><p>I heard from him before that he wouldn’t become a merchant that profits from war, but if he was in favor of the revolutionary forces’ believes, it is plenty possible.</p><br/><p>Because he wouldn’t profit from it after all.</p><br/><p>“I am unrelated.” (Rembrandt)</p><br/><p>“Ah, I see.” (Makoto)</p><br/><p>“Currently, that is.” (Rembrandt)</p><br/><p>“…”</p><br/><p>“Later, I will give you the documents pertaining the revolution that will be occurring in Aion. Well, if I had to summarize it, I would say, they are an amusing bunch of idiots.” (Rembrandt)</p><br/><p>“Isn’t that no good then?” (Makoto)</p><br/><p>“Umu, that’s right. It is no good. This is something that’s felt daily in the government officials of Tsige as well, but it is truly no good at all.” (Rembrandt)</p><br/><p>“Yeah…” (Morris)</p><br/><p>It wasn’t me but Morris-san who nodded seriously.</p><br/><p>Rembrandt-san emphasized that it was ‘no good’ twice, but is it that much?</p><br/><p>I have not seen the government officials appointed in Tsige, but if they are people evaluated in this way, it is probably for the best that I didn’t meet them.</p><br/><p>“Raidou-dono, do you know who Tsige belongs to?” (Rembrandt)</p><br/><p>Rembrandt-san asks me while maintaining that tired expression.</p><br/><p>Well, I at least know that much.</p><br/><p>“If I remember correctly, a noble…I think it was the fourth prince.” (Makoto)</p><br/><p>He is still young.</p><br/><p>If I count the time since I heard this, he is probably 6 years old now.</p><br/><p>“That’s right. The current king had given this land to this fourth prince he dotes on so much, soon after he was born.” (Rembrandt)</p><br/><p>Tsige was gifted to a baby?</p><br/><p>That’s pretty sad.</p><br/><p>In that case, the king owned this town before that.</p><br/><p>“So until then, Tsige was owned by the king, right?” (Makoto)</p><br/><p>Is it a territory that is in direct control of the country?</p><br/><p>Well, since it is a gift from father to son, there’s probably not going to be nobles who would take it away from him, so in a sense, it is valid.</p><br/><p>“…”</p><br/><p>“…”</p><br/><p>“W-What is it?” (Makoto)</p><br/><p>When I asked for a confirmation, the two of them simple stared at me silently.</p><br/><p>Unable to take it anymore, I speak out, and Rembrandt-san did a small sigh and began speaking.</p><br/><p>“This Tsige is the second most prosperous land in Aion. This is a number simply going by the payment of taxes though.” (Rembrandt)</p><br/><p>“Heh~” (Makoto)</p><br/><p>That’s impressive.</p><br/><p>It is certainly true that it is a lively place and it is in the wasteland as well.</p><br/><p>The transit of people is intense, and I did know that it had power as a town, but to think that it was the number two town in Aion for their payment of taxes even when they are a remote region like this.</p><br/><p>“The primary disadvantage is the distance it has from the capital, but in terms of population, economic scale, its location of being the entrance to the wasteland, being the ending point of the Golden Highway, and the adventurers’ quality; the worth of this town cannot be measured.” (Rembrandt)</p><br/><p>“Right.” (Makoto)</p><br/><p>“And the king has given the rights of this town to a kid that literally doesn’t have the ability to do anything.” (Rembrandt)</p><br/><p>Ah.</p><br/><p>I see.</p><br/><p>Now I understand the reason of why Rembrandt-san is dismayed.</p><br/><p>Conferring the rights of Tsige to someone, means that the person who conferred it holds incredible authority.</p><br/><p>Giving authority like that to a kid would only stir the people around into having disagreeable thoughts, and in the first place, it wouldn’t serve as anything good for that kid.</p><br/><p>No matter how cute that kid was, this is not a correct decision for a father to his son.</p><br/><p>To bring your fondness into governmental affairs is not good. </p><br/><p>“And then?” (Makoto)</p><br/><p>“A king that would do something as stupid as throwing away his own authority. Even though he is already in a complicated position where he has so many children that it is creating problems regarding the successor, he still did something as stupid as that. If he was aiming for that when he did it, then he is quite the schemer.” (Rembrandt)</p><br/><p>“From the sound of it, he wasn’t aiming for it.” (Makoto)</p><br/><p>“Even though he is still in good health, he easily relinquished a town that offers money to the country as if it were trivial. He did that, and yet, he didn’t place a capable and loyal subordinate as a set for this action of his. I can understand the emotions of the people that want to cause a revolution. At those times, I sended people disguised as aborigines and attacked him night after night.” (Rembrandt)</p><br/><p>…A-Attacked him.</p><br/><p>Just how pissed were you?</p><br/><p>It is true that it was gifted to a child, but it is not like their everyday life would change.</p><br/><p>“…Since then, the newly appointed government officials were all nobles that have been influenced by the mother of the fourth prince and has been changing constantly in that way. This type of people are not rare in the nobles, but they were all people that only sucked off this town as much as they wanted.” (Morris)</p><br/><p>Morris-san complemented the explanation once again.</p><br/><p>Well, that’s something.</p><br/><p>The worries must have piled up at mach speed.</p><br/><p>It truly affected the daily life of the people.</p><br/><p>No wonder he wanted to punch him.</p><br/><p>Well, it is not like Rembrandt-san himself is punching the king. It is simply his aborigin disguised people that are secretly punching him, so Rembrandt-san probably held back quite a lot.</p><br/><p>If those government officials don’t know about what was happening to the king, it would simply be releasing stress after all.</p><br/><p>“Petty officials that are crazy in the head, and idiotic generals, that have muscle for brains, were coming and going. It was a crisis that remained in the history of Rembrandt company. Seriously, there’s a limit to doting on your children.” (Rembrandt)</p><br/><p>“A crisis that would remain in the history of the company?” (Makoto)</p><br/><p>But I feel like Rembrandt-san is also the type who doesn’t have a limit when doting his children though.</p><br/><p>“They tried to put their hands on my wife and daughters, and after receiving strange marriage proposals, I judged it had already surpassed the limit and did a few things. Anyways, they were noisy about raising the taxes and demanding money, you see. No matter how much you try being rational with them, talking with that bunch just doesn’t work. They always say: ‘Understood. Then, when can you ready the money?’” (Rembrandt)</p><br/><p>I have dealt with people like that from time to time. The type of people that understand words but conversation is useless huh.</p><br/><p>Those kind of people are annoying.</p><br/><p>In my case, I could just have Tomoe and Shiki deal with them and ignore it, and it would be resolved later, but how do you deal with people like that in reality?</p><br/><p>Anyways, tax huh.</p><br/><p>I know that Rembrandt-san is a merchant that possesses incredible power in this town, but he was someone that could even participate in the decision of the taxes?</p><br/><p>I feel like that surpasses the domain of a single company.</p><br/><p>“Taxes, is it. But in that case, wouldn’t it be a lost cause if the government officials just decide for it to be that way?” (Makoto)</p><br/><p>“If it were the usual, then it would be just as Raidou-dono says. But they are people as well. It is possible to indoctrinate our side’s thoughts into them. The most simple method is to entertain them.” (Rembrandt)</p><br/><p>Entertain huh.</p><br/><p>Entertain the government officials, hear their thoughts, request of them, and place your own side’s thoughts in them.</p><br/><p>I see.</p><br/><p>“Entertain, is it. Then the taxes were also dealt with at that time?” (Makoto)</p><br/><p>“Omitting the details of it, yeah, that’s right.” (Rembrandt)</p><br/><p>“It is thanks to master that Tsige only has to face the current amount of tax burden, Raidou-sama.” (Morris)</p><br/><p>“By the way, what’s the tax currently?” (Makoto)</p><br/><p>“The visible rate is 30%, counting the personnel and goods, 10%. In total, it would be around 40% of our income most of the time.” (Rembrandt)</p><br/><p>40%.</p><br/><p>Since he mentioned the other 10% is not visible, that means the residents view it as a 30%.</p><br/><p>Even so, it is still a pretty impressive number.</p><br/><p>If you gain 10, 4 of it would be taken and you would only be left with 6.</p><br/><p>But from how Morris-san said it, it seems like even this is already good, so this place must be in the normal boundaries or lighter.</p><br/><p>I wonder how much is the normal amount.</p><br/><p>For the people paying, it would be best if it were closer to zero, but if that were the case, the community service would become worse.</p><br/><p>“40%.” (Makoto)</p><br/><p>“The nobles wanted to make it at least 70% though. If that happened, the town might dry to its death -even if it’s Tsige. This is simply my personal opinion based on experience, but once the tax surpasses half of the income, it only brings negative results.” (Rembrandt)</p><br/><p>70% is just too exaggerated.</p><br/><p>There’s no way someone would be able to live that way.</p><br/><p>Even the desire to work would be gone with a 70%.</p><br/><p>Moreover, what’s that about ‘at least 70%’.</p><br/><p>Did they want to make it even higher than that?</p><br/><p>But the topic about half being the limit, that Rembrandt-san speaks of, also sounds unreasonable.</p><br/><p>“That’s terrible. But how were you able to turn that unreasonableness into 40%?” (Makoto)</p><br/><p>“Simple. From the 70% that they want to take, we pay the other 30% from our own pockets as bribe money. It is not like we have become saints or anything. If the town dies, we wouldn’t leave unscathed either. And in the first place, I carry a considerable amount of responsibility for this town.” (Rembrandt)</p><br/><p>When Rembrandt-san mentioned: ‘Carrying responsibility’, his expression turned complicated.</p><br/><p>While showing strong determination, there was also regret, sorrow, and affection mixed in it. Something that the current me would definitely be unable to make.</p><br/><p>He has lived in this town for a long time, experienced a lot of things, and worked on his company here, so he probably has a strong attachment to it.</p><br/><p>Even so, the bribe is most likely an outrageous amount.</p><br/><p>I feel like it would be best to not ask the amount of gold.</p><br/><p>“It must have been quite the severe battle.” (Makoto)</p><br/><p>“Yeah. Right now it has calmed down though. And so, there’s the background of it as well. The current state is that we are stuck with that crazy bribe amount, and we also have to help in gathering confidential information. Because of that, not only the Rembrandt company, all the companies in Tsige have a bad impression of the Aion Kingdom.” (Rembrandt)</p><br/><p>“I understand that sentiment.” (Makoto)</p><br/><p>Or more like, it would be a mystery if they were able to pledge loyalty to a kingdom like that.</p><br/><p>That would be impossible.</p><br/><p>Even I am beginning to think if Aion Kingdom is okay doing all this.</p><br/><p>“And so, regarding this time’s plan for revolution, I haven’t reported it to the country yet.” (Rembrandt)</p><br/><p>“?!”</p><br/><p>“If I were to report it now, the revolution will probably end as a small insurrection.” (Rembrandt)</p><br/><p>He has no intentions of reporting it.</p><br/><p>In other words, he plans on having the revolution occur.</p><br/><p>“Experiencing this upheaval that has lasted for about one year, looking at this Tsige that has been changing each passing day, my way of thinking has changed quite a bit you see.” (Rembrandt)</p><br/><p>“…”</p><br/><p>I am most likely one of the reasons why.</p><br/><p>The change of Tsige, as well as the one who changed Rembrandt-san’s way of thinking.</p><br/><p>I can tell that I am involved in it.</p><br/><p>“I have been thinking this since a long time ago. I wonder, are the country and nobles really necessary for the government and management of a town?” (Rembrandt)</p><br/><p>“…”</p><br/><p>In the case of Tsige, nobles take turns coming to this town and supervise it for several years before leaving.</p><br/><p>Moreover, it seems like they don’t do much work.</p><br/><p>In that case, with how the current Tsige is, even if the nobles are gone, the government and the administration would have no problems.</p><br/><p>But if they maintain that, Tsige would be disconnecting itself from the Aion kingdom.</p><br/><p>Looking at it in terms of security, I feel like it would turn into a minus.</p><br/><p>No matter how you pick it, Aion Kingdom is still one of the major powers.</p><br/><p>Rembrandt intends to turn Tsige independent.</p><br/><p>He intends to use the revolution that will occur in Aion as the trigger.</p><br/><p>As long as it is viewed as a town that creates a lot of wealth, even if they are in a remote region, the Aion Kingdom will most likely not accept something like independence.</p><br/><p>That’s why it has to be now.</p><br/><p>“It is still not even at the level where we can question if there’s form as a nation though. At present, we plan on forming a municipality with several representatives of households, and first have Tsige reborn into an independent land. In my perspective, this is something that has steadily become more of a realistic goal as time goes on, but Raidou-dono, what are your thoughts?” (Rembrandt)</p><br/><p>An independent land.</p><br/><p>As I thought.</p><br/><p>Rembrandt-san knows the exact population of Tsige, the percentage of food supply that can be self-supported, the fighting force that can be dispatched at once, the amount of goods coming and going from the wasteland, and the connection it has with the surrounding towns.</p><br/><p>Lately, I heard that Mio and Shiki have been staying quite a long time in the port town that has been developing, and have been exchanging things with a good amount of people.</p><br/><p>From my view, Rembrandt-san is a merchant with plenty experience.</p><br/><p>If a person like that has reached the point where he asks someone like me, he probably has already received implicit consent from his surroundings or obtained a promise for cooperation.</p><br/><p>He is definitely not the type that would put his greed and wishes as the priority and do something unreasonable, and yet, he has laid bare his thoughts of independency, which means, he most likely has a proper amount of confidence and foundation for independence.</p><br/><p>Of course, if possible, I want to help him out.</p><br/><p>But if he is putting his confidence in my Kuzunoha Company, then that would be slightly troublesome.</p><br/><p>“In my eyes, Tsige is the place where I began my business for real. It is like a second homeland to me. If separating from Aion is connected to the benefit of this town, I am personally in favor of it. But I currently am not able to declare how much cooperation I will be able to provide.” (Makoto)</p><br/><p>If it drags the Kuzunoha company as well, I can’t make a prompt decision.</p><br/><p>I will first discuss this.</p><br/><p>That’s my standard.</p><br/><p>This time it is just deciding how much we will cooperate, so in essence, my position in this has already been mostly decided.</p><br/><p>But to promise what I will be doing at this moment, wouldn’t be good.</p><br/><p>“You don’t have any intentions of being on the kingdom’s side?” (Rembrandt)</p><br/><p>“Nope, I don’t.” (Makoto)</p><br/><p>No chance of that.</p><br/><p>There’s no reason at all for me to betray Tsige.</p><br/><p>It is the homeland of Lime, and the people working here are being well treated.</p><br/><p>“Fuh…Is that so. So at the very least, you will support the idea utilizing the revolution to gain independence.” (Rembrandt)</p><br/><p>Rembrandt-san looked relieved as he smiled.</p><br/><p>That’s cruel.</p><br/><p>Was he thinking I would become scum or something?</p><br/><p>“I don’t have any obligations for Aion kingdom to the point of betraying Tsige.” (Makoto)</p><br/><p>“I do know that. Just that, if the very idea of utilizing the revolution in order to gain independence went against the believes of Raidou-dono, I was thinking about abandoning the idea of independence.” (Rembrandt)</p><br/><p>“…To do something like that because of me is just…” (Makoto)</p><br/><p>“That’s why Morris and my close aides had discussed for several days things like: the methods to evacuate the people that hate fighting, and the protection of people that are not fit for battle, in order to convince Raidou-dono.” (Rembrandt)</p><br/><p>“Aha…hahahaha. There’s no need to mind me. If it’s Rembrandt-san, you should be able to do those kind of things.” (Makoto)</p><br/><p>In order to convince me alone, the tops of Rembrandt company gathered and did meetings.</p><br/><p>What’s that? That’s not funny.</p><br/><p>If I remember correctly, it was Sofia, right? The one who could destroy a few countries on her own.</p><br/><p>Being treated as that kind of existence by a part of the people. What a complicated feeling.</p><br/><p>Even for Rembrandt-san, I probably look like a jack-in-the-box.</p><br/><p>“It is certainly true that I thought it more thoroughly while having Raidou-dono in mind. Also…even if it’s not facing the country directly, we are still going against a major power, so we have to think about a lot of things.” (Rembrandt)</p><br/><p>…That way of thinking about ‘a lot of things’ is something that I have abandoned as well.</p><br/><p>Even if it’s impossible immediately, I will have to learn one step at a time.</p><br/><p>…</p><br/><p>“In other words, this is truly a convenient moment. Raidou-dono, since there’s the chance, use this opportunity to watch and learn.” (Rembrandt)</p><br/><p>“Hah?! Well, it is certainly true that a real revolution and an independence will serve as incredible teaching material, but…” (Makoto)</p><br/><p>What if I am asked for a report after all this is over?!</p><br/><p>If I am dragged into it, it wouldn’t be the time for learning!</p><br/><p>“In the end, there’s no better learning experience than mixing in the actual place of the action. Not by standing at the front and acting, but by being one step back and watching. It might become an incredible learning material.” (Rembrandt)</p><br/><p>Uh.</p><br/><p>Saying ‘incredible learning material’ without thinking, might have been bad.</p><br/><p>Even if I am like this right now, compared to my past self, I don’t immediately say things without thinking that much.</p><br/><p>I am aware that my verbal slips have decreased.</p><br/><p>“By the way, Raidou-dono, why do you think a mere merchant like me, who is planning something so outrageous like making the remote region of Tsige independent, going through such lengths to even tell you this?” (Rembrandt)</p><br/><p>“That’s probably because Rembrandt-san knows about this town the most and it is the result of you gathering information of the outside as well. Also, maybe because you have identified a big incident like that of a revolution beforehand.” (Makoto)</p><br/><p>He said he would take advantage of the revolution after all.</p><br/><p>How to say it, he does look like he has more confidence than before, and this is not overconfidence, but I feel it has something to do with me being in favor of it.</p><br/><p>Of course, I won’t be saying it out loud though.</p><br/><p>“That’s part of it. Putting more to it, your previous approval has given me quite a lot of confidence. But the direct impetus for this thought of independence was my contact with a certain person, and this was the result of learning that person’s nature.” (Rembrandt)</p><br/><p>“Contact with a certain person, is it. Who’s that?” (Makoto)</p><br/><p>There’s no doubt that the ones who would benefit the most from the trouble of hyumans would be the demon race.</p><br/><p>But this time, there’s no way it is the demons.</p><br/><p>Rembrandt-san has a pretty good amount of people that sympathize with him, like: Zef and his son. But Morris-san said that there’s not much interference from the demon race.</p><br/><p>The demons are being careful of me, and even if they did it, the most they would do would be to bring out money or lightly stir up someone.</p><br/><p>Not only Senpai and Tomoki, every direction of Limia and Gritonia; I don’t think there’s anyone there who would be able to become the reason for why Rembrandt-san would wish for independence.</p><br/><p>His back is probably filled with people that are against him, so those kind of people would be the very definition of people who would want to crush the revolution.</p><br/><p>Since Lorel’s territory is adjacent to Aion, they are not directly fighting with the demon race.</p><br/><p>…But they are a country that has deep religious believe in the Water Spirits that are subordinates of the Goddess.</p><br/><p>In other words, it is impossible to ask the temple to accept the revolution in the first place since it is viewed as evil.</p><br/><p>As I thought, the highest possibility is an Aion noble.</p><br/><p>Since it would lead to the decline in national power, the chances are low, but the most possible one would be an Aion noble or someone influential.</p><br/><p>A person that approves of the revolution, and a noble that is in a standing of influence.</p><br/><p>Someone like that cooperating with Rembrandt-san sounds plausible.</p><br/><p>“Is it a noble from a big household in this country?” (Makoto)</p><br/><p>“Fufu. Thinking about it reasonably, it is one of the possibilities that you can arrive at.” (Rembrandt)</p><br/><p>I missed!</p><br/><p>Even though I had quite a bit of confidence in that one!</p><br/><p>“I was wrong huh.” (Makoto)</p><br/><p>“For Raidou-dono who wants to learn about society, this can be considered an interesting reality. Well then, let’s have you meet with that person. But well…I don’t think this is your first time meeting that person though.” (Rembrandt)</p><br/><p>“…Eh?” (Makoto)</p><br/><p>With the sign of Rembrandt-san, Morris-san who was at the door, turned the knob and invited someone into the room.</p><br/><p>She looked at me, but without changing her expression, she made a deep bow.</p><br/><p>Why is this person…</p><br/><p>In my surprise, I couldn’t find any proper words to speak.</p><br/><p>Unable to open my mouth, my mind was simply in chaos.</p><br/><p>“Raidou-dono, it’s been long. To think that you would help out in Limia, I am truly grateful for that action of yours.”</p><br/><p>“Ah…yeah.” (Makoto)</p><br/><p>I somehow manage to gulp.</p><br/><p>This person is the person that I had excluded just a moment ago.</p><br/><p>Thinking about it normally, there’s no way she would be here, and no way she would sympathise with Rembrandt-san.</p><br/><p>Why?</p><br/><p>Just, why?</p><br/><p>“This might be the first time I see you so surprised.” (Rembrandt)</p><br/><p>Rembrandt-san laughs amused.</p><br/><p>“…Sairitz-san.” (Makoto)</p><br/><p>“Yes. Lorel’s empress, Saritz. It makes me happy to know that the merchant-dono who’s the current talk of the time’s, remembers my name.” (Sairitz)</p><br/><p>The empress of the Spirit temple in Lorel Union.</p><br/><p>Why is a person like that in a place where the conversation is about using the revolution to gain independence?</p><br/><p>Moreover, it seems like she knows the situation.</p><br/><p>After Sairitz-san, a number of people enter the room as well.</p><br/><p>From within them, there’s people I have seen in Tsige, and there’s also people I see for the first time.</p><br/><p>“Now then, since we have now gathered here, let’s begin by laying bare our thoughts and positions so we can begin the talk. Don’t worry, this is just to let first timers know. No need to proceed the talk in a smooth manner. First, we will talk about our opinions. I have prepared light meals and drinks, so let’s proceed without tension.” (Rembrandt)</p><br/><p>I-I take back what I said.</p><br/><p>I already want to abandon my thoughts and return to Asora.</p><br/><p>At this moment, I was not simply over my capacity, I was feeling something incredibly scary.</p><br/><p>This is definitely not how you begin learning something!</p><br/><p>Why is it that in this world, it always begins from the messed up parts?!</p><br/>\n</div>"}