{"title": "Chapter 223: Shinto Shrine……", "id": 223, "volume": 3, "url": "http://boxnovel.org/tsuki-ga-michibiku-isekai-douchuu-chapter-223-shinto-shrine%E2%80%A6%E2%80%A6", "volume_title": "Volume 3", "body": "<h1>Chapter 223: Shinto Shrine……</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 223: Shinto Shrine……</p><br/><p>“As I thought, it seems to be only one person.” (Makoto)</p><br/><p>“If even Waka feels that way too, then there’s no mistake. It is hard to believe that there’s only one person here in this vast grounds-ja…” (Tomoe)</p><br/><p>Tomoe seems to be pondering something.</p><br/><p>Having entered the grounds of the Shinto Shrine, there hasn’t been anything strange happening yet.</p><br/><p>Just that, it seems like in this excessively spacious grounds, we learned that there’s only one person.</p><br/><p>Doesn’t seem like it is moving.</p><br/><p>Must mean that it is waiting for us.</p><br/><p>“For a Shinto shrine precinct, it feels strange.” (Mio)</p><br/><p>Mio is looking curiously around as she follows us.</p><br/><p>Shiki is doing pretty much the same.</p><br/><p>“It is completely different from the temple of the Goddess. If this is the precincts of a shrine, just who’s the God?” (Shiki)</p><br/><p>It seems like he is stuck in a question that he won’t be getting an answer by himself, so maybe he is actually doing something a bit different from Mio.</p><br/><p>Even so, I check the surroundings like Mio.</p><br/><p>Tall trees were lined in a row.</p><br/><p>Every single one of them were so tall that I had to look up.</p><br/><p>The atmosphere they create is calm, dignified, and yet, it was comfortable.</p><br/><p>Maybe because the one who made it was an actual God.</p><br/><p>It is a place that would be fit to call: a legendary forest, or an ancient forest.</p><br/><p>“Truly fitting for a Shinto shrine. If it has this much space, it could even be called a Grand Shrine.” (Makoto)</p><br/><p>“That much? If that’s the case, we can expect much from the actual place huh.” (Tomoe)</p><br/><p>Tomoe’s eyes were sparkling.</p><br/><p>Maybe she is unaware of it, her breathing is also rough.</p><br/><p>What I am most interested about is in “how long” the person in this place has been here.</p><br/><p>Thinking about the place, maybe it is a Shinto priest?</p><br/><p>But this is supposed to be a present from Daikokuten-sama.</p><br/><p>In that case, I feel like a Japanese-style Buddhist temple would be more fitting.</p><br/><p>We climb one by one the stairs that have no fallen leaves.</p><br/><p>It seems like the cleaning is being properly done.</p><br/><p>Thinking of the cleaning a single person would have to do in a place as big as this, I would feel like it would be more of a punishment than anything, but there’s probably magic involved in this.</p><br/><p>“I thought it would be a more troublesome forest filled with traps.” (Mio)</p><br/><p>Mio, this is no dungeon.</p><br/><p>You can’t do something like that in a Shinto shrine…probably.</p><br/><p>Well, it is certainly true that I am a bit disappointed in this atmosphere that doesn’t have a speck of hostility.</p><br/><p>Now that I think about it, when I received the sea, they didn’t set up anything worth mentioning.</p><br/><p>They probably gifted me a person to take care of the Shinto shrine or something like that.</p><br/><p>There’s no Shinto shrines and temples in Asora after all.</p><br/><p>“Oh, I can see it now. Is that the Shinto shrine that can be seen in Waka-sama’s world?” (Shiki)</p><br/><p>Just like Shiki said, a Shinto shrine building that I am used to seeing appeared in our field of vision.</p><br/><p>Now that look at it in person, it is pretty big.</p><br/><p>Surprisingly big.</p><br/><p>“Ooooh!!” (Tomoe)</p><br/><p>Tomoe is trembling.</p><br/><p>She is incredibly moved.</p><br/><p>A wry smile appears in my face.</p><br/><p>But my smile soon froze.</p><br/><p>That’s because of the other buildings that I suddenly saw at the sides.</p><br/><p>What…is this?</p><br/><p>“Uhm, Waka-sama? In my eyes, the buildings at the front and the right don’t look like they have much similarity. Well, they have a few similarities though. But the one at the left, isn’t the atmosphere completely different from the rest?” (Mio)</p><br/><p>“Y-Yeah.” (Makoto)</p><br/><p>I could only nod at the question of Mio.</p><br/><p>It was certainly as Mio said.</p><br/><p>“It instead feels like only the one at the left has traces of a Goddess’ temple, or how to say it, in my eyes, it is close to the temples I am used to seeing. The ones at the front and the right are completely unknown to me though.” (Shiki)</p><br/><p>“…Yeah.” (Makoto)</p><br/><p>I also nod at the words of Shiki.</p><br/><p>The building at the left felt more like a temple of the Goddess.</p><br/><p>It doesn’t match this place.</p><br/><p>I do know that there are separate shrines in the Shinto shrine grounds.</p><br/><p>Even in the common knowledge inside me, there’s information about this.</p><br/><p>The ones called Jingu-ji.</p><br/><p>Also called the Protectors of the Shrines, or Palace Guards; the materialization of Shinto and Buddhist syncretism. </p><br/><p>They are shrines that protect the Shinto shrine, or so I think.</p><br/><p>That’s as far as I know as a hobby.</p><br/><p>Leaving aside the modern era, the Buddhist temples and Shinto shrines obviously had times when they were at odds, so I think that the Jingu-jis vary depending on if it is a Buddhist temple or a Shinto shrine.</p><br/><p>“…Waka, I am incredibly moved by this, but I see something at my left that is throwing cold water in my mood though. Is that a Shinto shrine too?” (Tomoe)</p><br/><p>“That’s not. Or more like, the one at the front is certainly a Shinto shrine, but the one at the right is a Buddhist temple. And the one at the left is a foreign country’s temple.” (Makoto)</p><br/><p>“As I suspected, the one at the right is a Buddhist temple! Then it is the so called Jingu-ji, right?! Like the one at the Toshogu shrine. I see, I see, so that’s what this is huh.” (Tomoe)</p><br/><p>So she even knows of a place that has them.</p><br/><p>As expected of Tomoe.</p><br/><p>Gongen-sama are supposed to be the temporal forms of Buddha-sama after all. </p><br/><p>Even so…</p><br/><p>“That thing…it is so out of place. Even if a Shinto shrine has a lot of depth to it, I feel like this is a bit too deep…” (Makoto)</p><br/><p>“A foreign country’s temple. Now that I think about it, in Waka-sama’s world, there were indeed a variety of religions.” (Shiki)</p><br/><p>“Well, yeah. Taking that as the context, the religions we have here would be 3.” (Makoto)</p><br/><p>“3, is it. That’s quite the confusion.” (Shiki)</p><br/><p>What Shiki said is completely right.</p><br/><p>“Well then, the one on the front would be the Shinto shrine; Shintoism.” (Makoto)</p><br/><p>Pointing out the one at the front, I tell Shiki.</p><br/><p>“The temple at the right, Buddhism.” (Makoto)</p><br/><p>“Fumu, fumu.” (Shiki)</p><br/><p>“And the one at the left is a Parthenon temple…I think. If I had to put a classification on it, it would be Christianity?” (Makoto)</p><br/><p>“Why do you say it as a question?” (Shiki)</p><br/><p>“The design has remained, but it has been engulfed in history and repeatedly received changes, in the end, it is a place that has been taken by many different religions.” (Makoto)</p><br/><p>“In other words, there’s no remainings of its teachings?” (Shiki)</p><br/><p>“Well, that would be the case I guess. From what I know, that is.” (Makoto)</p><br/><p>The Greece mythology isn’t something that has been named as a religion and remained in the current times.</p><br/><p>Greece was taken by Rome, and the Gods of Olympus have received name changes, and after being influenced by the Israel religion, it settled down as the next worship target of the Roman Empire.</p><br/><p>But the Christian religion that was born from that Israel religion had received the official recognition of the Roman Empire, and it exterminated the other religions, or something like that.</p><br/><p>There have been myths from other races flowing into Rome, and at first, the Christian religion had a mixture of those, is how I remember it.</p><br/><p>Looking back at Christmas, there have been theories that say that it was a festival for the Gods in Rome.</p><br/><p>Hmm, if I remember correctly…Saturn…</p><br/><p>I kind of feel something is wrong.</p><br/><p>But I remember I laughed at the name of that old game console with the same name, so there’s no doubt the name was Saturn.</p><br/><p>Was it some sort of festival because of the winter solstice? </p><br/><p>I just researched a bit deeper from what I learned in school and it isn’t knowledge that one can teach to someone else, but I still did my best there.</p><br/><p>There are times when I want to show off a bit.</p><br/><p>“Speaking of Christianity, it is one of the worldwide religions, right? If I remember correctly, Buddhism is also one of those.” (Shiki)</p><br/><p>“Yeah, that’s right. By the way, christianity is monotheist, but in the myths, there’s a lot of Gods appearing. So it would be better to not force yourself classifying it in one of those religions. Sorry for the confusion.” (Makoto)</p><br/><p>“Don’t mind it.” (Shiki)</p><br/><p>“I think it would be fine to just place a name like Greece myth religion, or Hellenism religion though. But the religion has not remained in the current times after all. The myths are famous worldwide though.” (Makoto)</p><br/><p>“There’s some mysterious teachings in the world of Waka-sama.” (Shiki)</p><br/><p>“Ahaha…” (Makoto)</p><br/><p>“Even so, in the beginning, there were a lot more Gods, and yet, right now there’s only one. Did the Gods do a battle royale or something?” (Shiki)</p><br/><p>B-Battle Royale.</p><br/><p>In a sense, that might be correct.</p><br/><p>The ones that actually fought were the humans, and it was more of a fight between representatives.</p><br/><p>“Shiki, if you are to call it something, it should be *Kodoku*, right? The strongest God devours the rest, and had its name resound for the posterity-ja.” (Tomoe) </p><br/><p>Tomoe, describing it as Kodoku is a bit…</p><br/><p>Well, a battle royale and Kodoku are both a battle till the death though.</p><br/><p>It is true that the history of religion is dyed in blood, and there’s probably something wrong with me, because I think that there’s no mistake that the strongest survived.</p><br/><p>“W-Well, leaving aside that stuff, the Buddhist temple isn’t that strange since there’s Jingu-jis just like Tomoe said, but the temple at the left, I haven’t seen it before. I think it is a Parthenon temple, so maybe it is fine to call it a Jingu Parthenon?” (Makoto)</p><br/><p>It is completely white and it is made of stone after all.</p><br/><p>It is clearly giving a different atmosphere.</p><br/><p>The trees at its surroundings are a type I don’t have any recollection of as well.</p><br/><p>“Doesn’t sound good. Why is something like this here?” (Shiki)</p><br/><p>“I do have a slight idea of why. Do you remember the Gods that came here before?” (Makoto)</p><br/><p>“Yeah, that group of three, right?” (Shiki)</p><br/><p>“These are probably the temples that pertain to those three. The one at the front would be Susanoo-sama, or maybe Tsukuyomi-sama; the one at the right, Daikokuten-sama; the one at the left is most likely Athena-sama.” (Makoto)</p><br/><p>“Hohoh~. In that case, that means that Gods from different organizations went through the trouble to come to Asora? That’s interesting.” (Shiki)</p><br/><p>Ah.</p><br/><p>That’s right.</p><br/><p>If we are talking about Athena-sama, then that tree might be an Olive tree.</p><br/><p>If I remember correctly, the Olive tree and Athena-sama have a deep connection.</p><br/><p>If it were the Roman Minerva-sama, it would probably be a different tree.</p><br/><p>But I can’t differentiate Greek temples and Roman temples. The person herself said she was Athena, so I think I am correct though.</p><br/><p>I haven’t seen Olive trees before after all.</p><br/><p>The most I have seen would be the matured fruit turned completely black.</p><br/><p>“And so, the presence comes from the temple at the front. It seems like the other party doesn’t have any intentions of coming out iself. Since we have come all the way here, we should do a shrine visit. I do think that’s the manner when coming to places like this after all.” (Makoto)</p><br/><p>“What’s the correct etiquette in this place, Waka?” (Tomoe)</p><br/><p>“Let’s go for the normal 2 bows, 2 claps, and 1 bow. If that’s not the correct one, the person inside will probably tell us. See there, there’s a water place. Tomoe, teach Mio and Shiki the way to use it.” (Makoto)</p><br/><p>“Understood! Mio, Shiki, follow me!” (Tomoe)</p><br/><p>There’s a pretty big and splendid water place.</p><br/><p>As if waiting for the moment for me to suggest her to, Tomoe takes Mio and Shiki along, and she teaches them how to use the water place while doing it herself.</p><br/><p>A wide space with gravel laid all over.</p><br/><p>The Buddhist temple at the right and the Parthenon at the left.</p><br/><p>It is certainly a familiar spectacle.</p><br/><p>To the point that I unconsciously forgot about Asora for a moment.</p><br/><p>It really brings me back.</p><br/><p>Is ‘water place’ the common way to call it, or is it ‘hand water’?</p><br/><p>Both are correct, so it is hard to decide for one.</p><br/><p>By the way, I call it ‘water place’, but it differs completely between people.</p><br/><p>But from what I have heard, ‘hand water’ is the one that most people use. &lt;</p><br/><p>Okay, let’s call it water place in Asora.</p><br/><p>Because I would have to teach them about the other ways of calling it as well.</p><br/><p>Kukuku.</p><br/><p>While I was thinking that, it seems like the three have finished using the water place.</p><br/><p>I also go and cleanse my hands and mouth quickly.</p><br/><p>There was no snake or dragon gushing water from their mouth, instead, there’s a flower basin that was made out of stone and had water coming out naturally.</p><br/><p>Maybe the bottom of the flower basin had water coming out, the water surface had ripples.</p><br/><p>Well then, let’s do the shrine visit.</p><br/><p>I stand in front of the offering box that’s probably empty inside.</p><br/><p>Since it is a shrine in Asora, I place in the currency of Asora that Tomoe made.</p><br/><p>1 ryo per person, so it would be 4 ryo.</p><br/><p>Next, I grab the robe that has a bell connected above it, and rang it loudly.</p><br/><p>“You can do the same as I did. This may be obvious, but don’t show hostility.” (Makoto)</p><br/><p>The three nod.</p><br/><p>First, they make a light bow.</p><br/><p>Two deep bows, two claps, and then, one bow.</p><br/><p>At the end, one light bow.</p><br/><p>The beginning and the end are probably a greeting of sorts.</p><br/><p>This feels really nostalgic.</p><br/><p>Tsukuyomi-sama, I am somehow still alive.</p><br/><p>One of my objectives is to return to Japan which you told me was impossible, but since I have other things left to do, I am thinking about prioritizing those first.</p><br/><p>No matter what I become in the future, the words you told me: ‘Live freely and do as you please’, have become a support for me.</p><br/><p>Please take care of your body, and recover with a tranquil heart.</p><br/><p>My last bow became a bit long.</p><br/><p>I lift my head and take a deep breath.</p><br/><p>“Okay, we are done. Good job.” (Makoto)</p><br/><p>I face the three.</p><br/><p>The presence moved.</p><br/><p>At our left, from inside the main shrine.</p><br/><p>As always, no hostility.</p><br/><p>There has been no contact yet, but it has moved to a pretty close distance from us.</p><br/><p>This is bad. I have no experience in entering a shrine.</p><br/><p>If it’s for a prayer, I have probably done it when I was a kid, but I don’t remember now.</p><br/><p>I look at the direction of the presence.</p><br/><p>Hm?</p><br/><p>Is that an Omamori reception counter?</p><br/><p>There are *charms* there after all.</p><br/><p>…Eh?</p><br/><p>“It seems like it is telling us to go there.” (Tomoe)</p><br/><p>“It feels like that person is belittling Waka-sama, and that isn’t pleasing-desu wa.” (Mio)</p><br/><p>“Tomoe-dono said a while ago that ringing the bell signifies a greeting to the God. That person must have moved because of that.” (Shiki)</p><br/><p>“Well, let’s go and see. At least let’s be grateful that that person is not telling us to go to the Buddhist temple and the Parthenon temple first.” (Makoto)</p><br/><p>I honestly don’t know how to pray in a Parthenon.</p><br/><p>—-</p><br/><p>When we went to the Omamori stand, there were a number of charms, votive pictures, and ceremonial arrows lined up there.</p><br/><p>The difference between this and my previous world would be that these items clearly have magic power tinged in them.</p><br/><p>When talking about charms, they are something like amulets which provide a passive effect.</p><br/><p>But the ones here are more like talismans and feel like they give off an active effect.</p><br/><p>They are probably charms that have quite the effectivity.</p><br/><p>—-</p><br/><p>The inside of the main shrine is being delimited by the the sliding doors.</p><br/><p>But that person is certainly there.</p><br/><p>“Isn’t it okay to meet each other face to face already?” (Makoto)</p><br/><p>I make up my mind and called that person.</p><br/><p>As if responding to my words, the curtains opened quietly, and then, the door opened.</p><br/><p>…</p><br/><p>There’s one shrine maiden-san with three fingers pressed on the floor.</p><br/><p>She didn’t use her hands but a spell to open the door huh.</p><br/><p>The person herself has her head lowered deeply.</p><br/><p>Why is it, I don’t feel any fear and I don’t feel that much power from her, and yet, it is strangely suffocating.</p><br/><p>I don’t know if to call it mental pressure, but I could feel something from that girl.</p><br/><p>I unconsciously gulp down my breath.</p><br/><p>Then, the girl slowly lifted her head.</p><br/><p>White, her skin was so white it was unbelievable.</p><br/><p>Black hair, slightly bright light brown eyes, and her shrine maiden clothes made me think that she was Japanese for a second.</p><br/><p>But I felt as if her skin itself was negating that she was a person.</p><br/><p>I don’t think it is make-up. It was a white that was more like paint.</p><br/><p>But it wasn’t pure white, I could feel a tinge of blue in it.</p><br/><p>In my eyes, it looked like the color was not natural.</p><br/><p>“Nice to meet you, Goshujin-sama. I was working as the shrine maiden of Tsukuyomi-sama, but I have been ordered to serve Makoto-sama. Please take care of me for the many years to come.”</p><br/><p>With a beautiful gentle smile, she called me her Goshujin-sama.</p><br/>\n</div>"}