{"title": "Chapter 231: Whirling banquet", "id": 231, "volume": 3, "url": "http://boxnovel.org/tsuki-ga-michibiku-isekai-douchuu-chapter-231-whirling-banquet", "volume_title": "Volume 3", "body": "<h1>Chapter 231: Whirling banquet</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Late at night.</p><br/><p>The time when the sound of the town stopped and Tsige finally entered silence.</p><br/><p>Even so, in this town that has lately been called as a nightless town, there’s still places where the liveliness still continues.</p><br/><p>At the very least, this room where only one man is in, is wrapped in silence.</p><br/><p>That man is Patrick Rembrandt.</p><br/><p>The big company that everyone recognizes in Tsige, the owner of Rembrandt company.</p><br/><p>“…”</p><br/><p>Rembrandt was still silent. His eyes were going through the mountain of papers that were piled up on his desk.</p><br/><p>With his left hand, he took the papers, and with his right hand, he holds a pen he uses to write sometimes.</p><br/><p>It goes without saying that what he is currently pondering in his head is about the information of Aion kingdom and Tsige.</p><br/><p>And this is the most recent information he has received from the eyes and ears that Rembrandt company has placed in the several areas.</p><br/><p>Of course, there’s always new information coming to his place everyday.</p><br/><p>In this moment when they are trying to take advantage of the revolution to gain independence in Tsige, he is technically the central figure, so he has been living days where sleep is precious.</p><br/><p>“…Fumu. There’s still rough areas but…the path has been made.” (Rembrandt)</p><br/><p>If this were the representative of Kuzunoha company, he would have already been drowned in information a long time ago and escaped from reality with this amount of work.</p><br/><p>It is an amount that even if a miracle happens, arranging it all would be his limit.</p><br/><p>But Rembrandt who has his wit and experience, secures a small amount of sleep everyday by properly grasping the situation, and has already finished his insight regarding the revolution of Aion kingdom and independence of Tsige.</p><br/><p>“You are being quite cautious.”</p><br/><p>“…Well well, I am astonished. To think that you were someone who didn’t show any manners when entering a room, I really didn’t expect that.” (Rembrandt)</p><br/><p>“It seems to be called a ‘surprise’. I learned this from Raidou-sama.”</p><br/><p>The sudden visitor responded to the sarcasm of Rembrandt who was pointing out her lack of common sense.</p><br/><p>It is certainly true that visiting late at night without any prior appointment is quite rude.</p><br/><p>It is not something that can be forgiven by just saying it is a surprise.</p><br/><p>“Do you think that will make me consent, Sairitz-sama? Coming late at night without even knocking, and obviously, no appointment. That’s nothing but a trespasser.” (Rembrandt)</p><br/><p>“That’s true. I apologize for the rudeness. I am truly sorry. But, don’t you think that we should get to know each other more, Patrick-sama?” (Sairitz)</p><br/><p>The young woman that’s called Sairitz, warded off the the sharp gaze and words of Rembrandt, and gave him a flirtatious glance with a glossy tone.</p><br/><p>She is from the a neighboring country of Aion, Lorel Union, moreover, a person in an influential position.</p><br/><p>Thinking about her position, she is currently taking an unbelievably dangerous action.</p><br/><p>“I think you already understand what we both need though.” (Rembrandt)</p><br/><p>On the other hand, Rembrandt didn’t break his usual attitude.</p><br/><p>He simply waits for the next words of Sairitz.</p><br/><p>“Ara, even though you are going to be doing the same shrewd acts you committed in the past, you are being quiet frank. It seems like the image I knew of you is slightly different now.” (Sairitz)</p><br/><p>“You intend to show me the power of Lorel Union’s information gathering, and place pressure on me? Even if I show the ability I had in the past, it would be unnatural to maintain the same personality as that time. You have already investigated that much, so don’t joke around.” (Rembrandt)</p><br/><p>“You only have eyes for your wife and daughter huh. I can’t help but view this as strange in my eyes. Matching your history and personality, it may be slight, but it feels like something is out of place. We are in a relationship where we will become comrades. I wouldn’t do something like this just because of a small sense of discomfort of mine. That’s one of the reasons of my invitation just now though.” (Sairitz)</p><br/><p>“You are saying that if we were to unite our bodies, we would be able to trust each other? Well…I will admit that it is a valid method when in a complicity. But that’s a delusion that only works between one individual and the other. It is not something I would expect the empress of Lorel would do at all.” (Rembrandt)</p><br/><p>“…”</p><br/><p>“The scale of this matter is way too big to apply. I don’t know what’s making you so impatient, but if you need someone to consult with, depending on the case, I might be able to help.” (Rembrandt)</p><br/><p>“Good grief. I have been incredibly hurt as a woman, but I now understand that you truly love your wife and family. Even if I knew that my objective would be achieved no matter where the dice rolled, it still hurts. I will restrain from doing so in the future.” (Sairitz)</p><br/><p>Sairitz speaks out words that can be taken as giving up.</p><br/><p>It was an attitude that one can tell that the discomfort she had of Rembrandt inside her head had vanished.</p><br/><p>“Seriously. If my wife were to have even slight suspicions about it, my daily life would become the worst. You seem to have already noticed, but I would like you to completely stop these kind of methods that only bring risks to me.” (Rembrandt)</p><br/><p>While sighing, Rembrandt reprimanded the behaviour of Saritz.</p><br/><p>It can’t be helped.</p><br/><p>Late at night, in the room where he is supposed to be doing work and already had his butler leave, there’s a young woman.</p><br/><p>It is clearly a situation that’s unprofitable for the man.</p><br/><p>“This matter is incredibly important for Lorel as well after all. Even if it is my personal impression, I still wanted to confirm the uncertain factor I felt. I am in a situation where I can’t even touch the highest uncertain factor which is the Kuzunoha company you see.” (Sairitz)</p><br/><p>“Kuzunoha and Raidou-dono are quite simple existences. It is not like I don’t understand how you feel, but those guys return sincerity with sincerity, and fang with fang. They move with a truly simple logic.” (Rembrandt)</p><br/><p>“There are times when it is fearsome not knowing just how far that simple logic can go. Especially for someone like me who is involved with the health of my country.” (Sairitz)</p><br/><p>“Well, it probably can go real far. It is truly a nice sensation.” (Rembrandt)</p><br/><p>“As a person that follows the religion of the Goddess, and serves the Spirits, this is something someone like you can’t understand.” (Sairitz)</p><br/><p>This time, Sairitz was the one who sighed, and then returned words of criticism at Rembrandt.</p><br/><p>“Hahahaha! You can’t understand huh. And yet, you have offered cooperation and are trying to make the Kuzunoha company owe you. You said before that it didn’t matter where it rolled, but with that kind of principle in your actions, you still possess this much ability in making decisions. You are truly a fearsome one.” (Rembrandt)</p><br/><p>“Not as much as you. Even if you had to discard your everything, the common sense that you believed in, you concentrated on Raidou-dono. That’s truly the borderline of madness.” (Sairitz)</p><br/><p>“No no. Contrary to expectations, we might actually be more similar than you think. That’s why, leaving aside trust, I am able to believe in you. I highly value that stubbornness of yours, and I can believe in your judgment as well.” (Rembrandt)</p><br/><p>“…I also…believe in your madness…and the conviction that supports it. That conviction of never betraying Kuzunoha company no matter what happens. That’s why someone like me,who wants to avoid confronting them, is able to believe in you.” (Sairitz)</p><br/><p>“Seriously. In other words, there’s absolutely no problems. We…” (Rembrandt)</p><br/><p>“‘Can form a good relationship’, right?” (Sairitz)</p><br/><p>“Yeah.” (Rembrandt)</p><br/><p>“Understood. I am sorry for interrupting your silent night. I once again apologize, Patrick-sama.” (Sairitz)</p><br/><p>“Don’t mind it. Next time, I ask that you make a proper appointment beforehand, but I will welcome you. Ah right. Since we have the chance, is it okay to ask you one other thing?” (Rembrandt)</p><br/><p>“Of course. Ask me.” (Sairitz)</p><br/><p>“I had some slight doubts regarding your actions and proposal you see. I wonder, just what kind of existence is a priestess for you?” (Rembrandt)</p><br/><p>“…So you went for that.” (Sairitz)</p><br/><p>“Being one-sidedly shown the information gathering abilities of Lorel, felt unfair you see.” (Rembrandt)</p><br/><p>Rembrandt obviously had gathered information of Sairitz as well.</p><br/><p>Saying: ‘Regarding your actions and proposal’, was only an excuse.</p><br/><p>It is because he had gathered information of Sairitz that he felt doubts about her.</p><br/><p>Rembrandt had questioned her about one of them.</p><br/><p>“…For me, that personage is…” (Sairitz)</p><br/><p>“‘That personage is…’” (Rembrandt)</p><br/><p>“A sister, a daughter, and also a monarch as well. No…that’s not it.” (Sairitz)</p><br/><p>“…”</p><br/><p>The words that were slowly tied together by Sairitz, Rembrandt waited for them in silence.</p><br/><p>“She is most likely…someone that we…want to protect no matter what.” (Sairitz)</p><br/><p>And then, the revised words of hers made the eyes of Rembrandt show a light of surprise.</p><br/><p>“Hoh~. For the empress, the priestess is obviously an important existence, but when I probed into it, I thought she was an existence that could be replaced.” (Rembrandt)</p><br/><p>“Replaced? It is certainly true that it is essentially that way. But for me, she is the only priestess. Fufu, that’s an answer that would make people question my position as empress. Please keep this a secret.” (Sairitz)</p><br/><p>“Of course. Even so, I see. With this, I have also cleared a few of my doubts I held about you. I was able to make this time profitable for me as well. This is something to be happy about.” (Rembrandt)</p><br/><p>“That’s great to hear. Well then, have a good night.” (Sairitz)</p><br/><p>“Dream well.” (Rembrandt)</p><br/><p>Sairitz left the same way she came in, without making a single sound.</p><br/><p>Silence returns to the room once again.</p><br/><p>“Fuh~. Being in the border of madness applies to both of us. If the basis for her judgment is the safety of the ‘present age’ priestess, I can understand that heavy bias of hers. This was an unexpected harvest.” (Rembrandt)</p><br/><p>He mutters in this room where only he remains now.</p><br/><p>“If you lack consideration for the priestess, your neck might be taken in your sleep; but if we turn it around, it also means that if you are not negligent in your consideration to the priestess, you can believe in that empress as long as it is within acceptable bounds. It is truly a grateful thing that it has become a lot more easy to grasp her true motives.” (Rembrandt)</p><br/><p>When Rembrandt received an offer of cooperation from the empress of Lorel, he was obviously incredibly cautious.</p><br/><p>Of course, he still hasn’t released the necessary amount of cautiousness towards Sairitz.</p><br/><p>However, now that he was able to grasp a part of Sairitz’ principle of actions, he is able to understand her moves.</p><br/><p>It was a big step forward.</p><br/><p>“But, ‘no matter where it rolls’ huh. It is true that in this matter, there’s definitely not going to be any losses for Lorel. It is a truly ingenious choice of positioning. That woman would have done pretty well as a merchant too. If a bureaucrat like that existed to a certain extent in this country as well…is something I do wonder, seriously.” (Rembrandt)</p><br/><p>Nevertheless, there’s no doubt that Sairitz is not an imprudent person at all.</p><br/><p>She is dependable and can work as a good partner. That’s the kind of person she is, is what Rembrandt once again recognized of her.</p><br/><p>“Anyways, I have done what I had to do. I also got my chance to brag. Now, I just have to continuously choose the thin but correct path. That’s all I can do in what’s left after all…” (Rembrandt)</p><br/><p>In order to not regret it, he wrings out his everything.</p><br/><p>Before the light of the room went out, the last words of Rembrandt were packed with those kind of emotions.</p><br/><p>◇◆◇◆◇◆◇◆</p><br/><p>-The night a few days after the renewal of Kuzunoha company.</p><br/><p>In the Rembrandt store, there’s an amount of merchants gathered there that can’t be compared to any time before.</p><br/><p>For people that deal in trades at Tsige, an invitation from Rembrandt is in essence, the same as a forced summon.</p><br/><p>Moreover, in the wording of that invitation, there’s a part that says: ‘if possible, make sure it is the representative coming’. That’s the kind of event tonight.</p><br/><p>In the fancy hall, there’s cooking that didn’t lose in splendor.</p><br/><p>Looking at this, there were many merchants who didn’t have a good color in their face.</p><br/><p>“Oi, Raidou is also here.”</p><br/><p>“That’s obvious, right? It hasn’t been long since he has made his store. He can’t just instantly return to Rotsgard after that. No matter if he is the favorite of Rembrandt-san.”</p><br/><p>“What. So he already intends to curry favor? He changes gears as quickly as always huh.”</p><br/><p>“You are one to say.”</p><br/><p>A number of people were sending gazes and talking in a low voice about Raidou who was having a friendly chat in the hall.</p><br/><p>They were puzzled as to why Raidou, who didn’t attend to the meetings from the Tsige merchants, was now in this place, and they were also displeased by it.</p><br/><p>In other words, a group that didn’t hold a good impression of Kuzunoha company.</p><br/><p>In terms of percent, it is about a 20-30% of the people here.</p><br/><p>They are also people that pursued to do business in this town, hold ambitions, are young, and have a slight amount of talent without being blessed by enough good opportunities.</p><br/><p>“Well, even so, I am being thoroughly defeated by Milliono company lately. Can’t do anything at all, seriously.”</p><br/><p>“Fortunately, we are being well treated by the guild and the adventurers. But the reason why there has been a good wind blowing to our side as well…”</p><br/><p>“As expected, because we are having a good relationship with Rembrandt company?”</p><br/><p>“Isn’t that the same for everyone? I feel like there’s a different wind blowing.”</p><br/><p>“…Hoh.”</p><br/><p>“I would like to get along with Raidou from now on as well. There’s no need for us to crush each other, right?”</p><br/><p>“It would be great if you were to tell us how.”</p><br/><p>“Of course. It is pretty easy. I will also be teaching you a rule that you must keep no matter what. Listen well. Try having a sincere relationship with Kuzunoha company.”</p><br/><p>“Kuzunoha?”</p><br/><p>The man lowered his voice and was talking with someone that was a business rival in the past.</p><br/><p>In the hall where groups of people have been formed here and there, this is one of the conversations that continues within it.</p><br/><p>Everyone had a trait that they shared in common.</p><br/><p>That from the companies that have been facing a radical growth, the people here are the centre of them.</p><br/><p>Those people had grouped with their planned people, and were speaking about things they had planned beforehand.</p><br/><p>The name of Kuzunoha company.</p><br/><p>Normally, they would suspect the scheme of the other party.</p><br/><p>But tonight, the circumstances are a bit different.</p><br/><p>The person that’s doing the conversation and the person that opened the conversation, knew that there’s something backing the Kuzunoha company.</p><br/><p>And different from the budding younglings, they also know that Rembrandt is in essence, the one that has a hold of this town.</p><br/><p>Kuzunoha company has recently opened a store with unbelievable scale.</p><br/><p>Of course, this can’t be made possible without support from their surroundings.</p><br/><p>It is hard to believe that this was done by a young representative that doesn’t even stay in town for much. But Rembrandt even changed the name of a Street for his sake.</p><br/><p>It was a nailed down truth.</p><br/><p>“T-Then, are you saying that the land the Eleor company was holding onto…was in order to present it to Raidou?” </p><br/><p>“That’s right. Well, it was a gamble knowing it would be of high profit, but…he build a store of that scale. Everyone, do you understand?” (Eleor representative)</p><br/><p>“Yeah. Honestly…that’s one joke I can’t laugh at.”</p><br/><p>“He is indeed someone that’s been doing well in this town, but there’s no way he would have enough savings to make something of that scale. That means he is gaining quite a lot in Rotsgard as well.”</p><br/><p>“I only know about selling and buying land, but Raidou-dono payed the full amount when he did the deal. It is a truly unusual way of buying.” (Eleor representative)</p><br/><p>“Seiously?”</p><br/><p>“A plot of land of that extend? Rather than calling it unusual, it is impossible.”</p><br/><p>At a place slightly separated, the representative of Eleor company was also doing a similar conversation.</p><br/><p>Both representatives from the Milliono and Eleor companies were told by Rembrandt to create a deep connection with Raidou for the sake of the future.</p><br/><p>There’s no doubt that their deep connection with Rembrandt company has played a big role in their recent success.</p><br/><p>The people that are in this group right now are the merchants that serve as the backbone of Tsige, and they are people that Rembrandt has been paying a reasonable amount of attention to.</p><br/><p>Rembrandt had judged that even if it’s slightly late, they would be bringing Raidou’s topic into the conversations.</p><br/><p>Looking at it as a whole, there’s around 30% of younglings here that don’t think of Raidou in a good light and were invited today into this gathering.</p><br/><p>Also, there’s special companies that fulfill a low amount of demands, and private companies that don’t really hold much ambition; in short, there’s currently around 40% of people in this place that don’t hold much interest in Kuzunoha.</p><br/><p>There’s people that differ in the type of industry and people that have different type of customers, so even if they are in the same Tsige, it is natural that there’s a lot of companies that have practically no connection with Kuzunoha company.</p><br/><p>“…Fuh.” (Raidou)</p><br/><p>Loosening the necktie that he is not used to wearing, Raidou takes one glass from the waiter, and gets some rest in a place slightly faraway.</p><br/><p>There were many gazes that were concerned about his movements, but they were holding back and no one tried to approach him.</p><br/><p>In a place where there’s gazes on him, Raidou couldn’t show an unsightly behaviour.</p><br/><p>He had relaxed while knowing the limits of how much.</p><br/><p>“Around this time, Rembrandt-san is probably doing the last confirmation with the long standing shops huh.” (Raidou)</p><br/><p>Around 10% of the merchants in the hall are representatives that have been doing business for a long time in Tsige.</p><br/><p>Those people have been able to cope with the town’s prosperity, and have been able to maintain their power without defaming their name.</p><br/><p>In title and in public, they are side by side with Rembrandt. In other words, there’s a good amount of companies that are at the top.</p><br/><p>Soon after being invited, they were led into a separate room by the Rembrandt company, and for now, they have only been able to see who are the people present.</p><br/><p>Today, Rembrandt was planning on revealing the movements of Aion kingdom to the merchants.</p><br/><p>That means the phase of laying the groundwork has already passed.</p><br/><p>But well, the standing of Kuzunoha company and Lorel Union’s participation won’t be disclosed though.</p><br/><p>“…”</p><br/><p>Raidou held in the sigh that he was going to let out and fixes his attire.</p><br/><p>And then, after emptying the glass he had in his hand, he returned to the hall.</p><br/><p>It is time.</p><br/><p>A few minutes after he returned to the place where the merchants are gathered, tonight’s host: Patrick Rembrandt, had appeared with the big shots that everyone knows of, and the atmosphere in the place made a complete change.</p><br/><p>Seeing that the amount of people appearing here were the same as the people that entered the separate room, Raidou slightly furrowed his brows.</p><br/><p>Because even if he had heard from Rembrandt that he has been speaking with those people to a certain extent since a while back, it was still kind of hard to believe that he was really able to convince everyone.</p><br/><p>But well, in the eyes of Raidou, Rembrandt is a flawless hyuman.</p><br/><p>Rather than thinking about the details of the confidential talk they had, Raidou simply held amazement towards Rembrandt.</p><br/><p>“…Now then.” (Rembrandt)</p><br/><p>Saying his thanks for accepting the invitation, voicing out words that praised each merchant for the prosperity of Tsige, and finishing all of that general talk, a sharp light appeared in the eyes of Rembrandt, and he began the real talk.</p><br/><p>“Sadly, it has become a certainty that the fire of revolution will be burning in Aion kingdom. How will you…how will we move?” (Rembrandt)</p><br/><p>With a questioning tone, Rembrandt’s speech began.</p><br/><p>The revolution in Aion.</p><br/><p>Tsige’s independence.</p><br/><p>“…I don’t think it will come true, but if possible…I pray that the kingdom, the empire, and the demon race don’t get involved in this matter.” (Raidou)</p><br/><p>Feeling that the words of Rembrandt were bringing heat into the hall, Raidou muttered this.</p><br/><p>Because he already felt that they would definitely get involved in it as well.</p><br/><p>This mutter was not because he didn’t have the resolve, but because he had already resolved himself.</p><br/><p>Just how many ripples will this revolution create?</p><br/><p>This was something that not even the Goddess could predict its outcome.</p><br/><p>TLN: This marks the ending of Arc 4!</p><br/><p>For people that want to know, there’s still 40 chapters more to go.</p><br/>\n</div>"}