{"title": "Chapter 247: The strength of the assassins", "id": 247, "volume": 3, "url": "http://boxnovel.org/tsuki-ga-michibiku-isekai-douchuu-chapter-247-the-strength-of-the-assassins", "volume_title": "Volume 3", "body": "<h1>Chapter 247: The strength of the assassins</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 247: The strength of the assassins</p><br/><p>TLN: I was more busy than expected! Phew, schedule will return to normal now… I hope.</p><br/><p>“Uff, that really got me. That man was outrageously skilled.”</p><br/><p>Directing her gaze at the three corpses, Akashi had sheathed her sword and was now scratching her head.</p><br/><p>“Umu, rather than us, Iroha-sama would be safer with Raidou-dono. In that time, we will find the assassins and eliminate them. And by the time we return to Kannaoi, the situation should have been resolved.” (Shougetsu)</p><br/><p>“After babysitting, we are now fishing. We have been way too busy lately, seriously.” (Akashi)</p><br/><p>“Don’t say that.” (Shougetsu)</p><br/><p>“‘Kay ‘kay.” (Akashi)</p><br/><p>Akashi was talking with someone who is most likely her superior, Shougetsu, with words that were not really polite.</p><br/><p>But there was no intention of going against him from her words, and it seems like she is properly accepting his orders and objectives. Leaving aside her speech and conduct, it can be seen that their relationship is good.</p><br/><p>“Nei, sorry but, I leave the double of Iroha-sama to you.” (Shougetsu)</p><br/><p>“Understood.”</p><br/><p>After Shougetsu ordered this to the servant, one of the servants that was at the leftmost side responded and turns around.</p><br/><p>In an instant, her appearance turned into that of Iroha with her princess clothes.</p><br/><p>It was a splendid transformation.</p><br/><p>Looking at that skillful display, it can be seen that this wasn’t the first time the girl called Nei has done this kind of job.</p><br/><p>“…”</p><br/><p>“What’s wrong, Yuduki? Since the time we saw him off, or more like, since the time he finished the assassins, you have been kind of strange, you know?” (Akashi)</p><br/><p>Akashi asked this to her partner that has had a hand on her mouth and been completely silent since the time Raidou left.</p><br/><p>Yuduki is not a person of many words to begin with, but Akashi felt that this time’s silence was strange.</p><br/><p>“Your manner of speech was slightly bothering too. We at least made clear what was his standing but, was it not enough?” (Shougetsu)</p><br/><p>Shougetsu also asked Yuduki after Akashi.</p><br/><p>At the very least, in the current stage, Raidou is a beneficial person for them, and it is important to create a favourable relationship.</p><br/><p>And yet, the attitude of Yuduki towards Raidou was not that gentle, and for her that normally adapts faster to situations than Akashi, this was a strange attitude.</p><br/><p>Being pressured by the two, Yuduki finally opened her mouth.</p><br/><p>“You two, after looking at these assassins and Raidou-dono…you didn’t feel anything?” (Yuduki)</p><br/><p>“Anything, you say. I did say this just a few moments ago: ‘he is not your average person’. The assassins were also hiding their strength when they fought us, so honestly, if they were to fight us seriously, I did think it would have been bad.” (Akashi)</p><br/><p>“Akashi, can you really call yourself the bodyguard of Iroha-sama with that kind of thinking?! That level of assassins, even if they are three, you alone can do something about it! In the first place, the young uns these days are lacking in training. Every single one of them just runs for the flashy skills.” (Shougetsu)</p><br/><p>Since the moment Akashi heard the words: ‘the young uns these days’, she knew that Shougetsu had begun again with his blabber and sighed once.</p><br/><p>Yuduki still maintained that meek expression, but had a small smile showing in her face.</p><br/><p>“Shougetsu-sama, we will of course not neglect our training in the future either, but this time, Akashi has a point.” (Yuduki)</p><br/><p>“Yuduki! You are saying something like that as well?!” (Shougetsu)</p><br/><p>“These three, they were quite skilled. They had stealth techniques to erase their presence and real strength, and it is because it was Raidou-dono that he was able to deal with it in that kind of way, but…I don’t know if we would be able to hold them back even if we were in a one-on-one.” (Yuduki)</p><br/><p>As Yuduki finished speaking, she closed her mouth and once again fell into pondering.</p><br/><p>“What are you saying? Then, even if we were to add one more of you in your team, you wouldn’t be able to hold back Raidou-dono for even five seconds? Is that what you saying? You two are the bodyguards of a Kannaoi princess, don’t say something so pathetic.” (Shougetsu)</p><br/><p>“…”</p><br/><p>“…”</p><br/><p>“Akashi, Yuduki?” (Shougetsu)</p><br/><p>“…It is exactly as you say, Shougetsu-jisan. Even if we were to make a party, even if we were to face him with an army, we probably wouldn’t be able to stop him. Just saying but, we are on the level that we have been assigned as the bodyguards of the tenth princess with inheritance rights. But that wasn’t a level like that, it was on a completely different plane. Even if we were to gather all the power of Kannaoi -no, of all Lorel, we wouldn’t be able to defeat…that.” (Akashi)</p><br/><p>“Shougetsu-sama, that person’s strength was not on the level of a Rotsgard teacher. The words of Akashi had no falsehood, they are her true feelings. I am also of the same opinion.” (Yuduki)</p><br/><p>Akashi and Yuduki had answered Shougetsu as they shook their heads to the sides.</p><br/><p>It is something they can’t do anything about, that’s the kind of face they were making.</p><br/><p>“It is certainly true that his skills were splendid, but…I didn’t feel that much force in him though. I have seen my share of strong people too. Hm…” (Shougetsu)</p><br/><p>“That’s something that you can only feel after getting actual experience, and can only feel when you are about to die. That feeling when you think: ‘ah, he was someone that I shouldn’t have fought with’.” (Akashi)</p><br/><p>“These assassins, they should have been remarkable people that surpassed level 300.” (Yuduki)</p><br/><p>“?!!! Three hu—what kind of stupidness are you spouting?” (Shougetsu)</p><br/><p>“Here it is, her adventurer card. Geh, it seems like they were a lot higher than that, Yuduki. This is the first time I have seen the job ‘Shadowless’.” (Akashi)</p><br/><p>Akashi searches for the card at the chest of one of the three and gives it to Shougetsu.</p><br/><p>There, the numbers 420 were engraved on it.</p><br/><p>At the job field, there’s ‘Shadowless’ written.</p><br/><p>It was just as Makoto had guessed.</p><br/><p>“420…isn’t that on the level of a country’s strongest? Why are such strong people aiming for Iroha-sama…?” (Akashi)</p><br/><p>“They have the ability to assassinate any prince or princess if they wanted to. No, putting it straight, they are not people that would fall to being assassins.” (Yuduki)</p><br/><p>“Not only that, they properly have a family name and a family crest engraved… Could this be…someone from Gritonia?” (Shougetsu)</p><br/><p>“I can’t tell that much, but honestly, if two or more assassins of the same level were to appear, I don’t think that the two of us alone would be able to do anything about it.” (Yuduki)</p><br/><p>“This degree of internal problems, could it be that there’s a plot from foreign countries involved in this as well?” (Shougetsu)</p><br/><p>The Osakabe princess, Iroha, is certainly being targeted by assassins.</p><br/><p>It is something that can be sufficiently possible.</p><br/><p>But assassins also have targets they aim for that have a suitable status for their level.</p><br/><p>A level 420 is without doubt among the highest in terms of assassins.</p><br/><p>This is the kind of people that the Limia kingdom and the Gritonia empire would send when they want to eliminate their targets with certainty.</p><br/><p>These are not assassins someone would send, even if by mistake, to kill an influential noble of Lorel, and on top of that, a young princess that has low chances of succeeding the family.</p><br/><p>“Ah, so that’s why Yuduki had fallen silent. It was because maybe Iroha-sama -no, not only her, us as well, have been involved in an unexpected conspiracy, right?” (Akashi)</p><br/><p>*Pon*</p><br/><p>Akashi hits her clenched right fist onto her left palm.</p><br/><p>“That’s not it.” (Yuduki)</p><br/><p>“Eh? It is not?” (Akashi)</p><br/><p>“Not only 300, they were monsters on the level of over 400, and they had a job like ‘Shadowless’ which might even be able to assassinate dragons; I certainly was surprised by that, but that’s a small thing…compared to what we currently have on our hands.” (Yuduki)</p><br/><p>“Is it small? I think that’s pretty important though. Assassinating dragons, if publicized well, military officers would be all over the place, you know?” (Akashi)</p><br/><p>“What I mean is that compared to that man, Raidou, this is something small.” (Yuduki)</p><br/><p>“Raidou huh. I don’t think he is that much of a problem, you know. He seemed like a guy that could be spoken with, and he is strong, as an ally, he is reliable. In the first place, he crushed those Shadowless. Isn’t that impressive? But well, he did defeat them so easily that thanks to that, Shougetsu-jisan ended up getting angry at us though.” (Akashi)</p><br/><p>“Mugh…” (Shougetsu)</p><br/><p>Receiving the gaze of Akashi, Shougetsu shuts his mouth.</p><br/><p>Now that he has seen the adventurer card, he couldn’t scold Akashi.</p><br/><p>No matter how easy of a danger it was to wipe them out, in normal circumstances, it wouldn’t have been strange if they were all dead by now. This is something that he could understand.</p><br/><p>“The problem is that very misunderstanding of Shougetsu-sama.” (Yuduki)</p><br/><p>“What do you mean by that?” (Shougetsu)</p><br/><p>As if escaping from the gaze of Akashi, Shougetsu questions Yuduki.</p><br/><p>“Raidou dealt with those three way too easily. With only that, you should be able to understand that a strong person has shown their power, and yet…” (Yuduki)</p><br/><p>“Fumu.” (Shougetsu)</p><br/><p>“Shougetsu-sama didn’t feel that much power from him. That was the same for me though.” (Yuduki)</p><br/><p>“That’s true. The peculiar presence that strong people give out…I didn’t feel anything like that from him. He is working as a merchant, so I thought it was because of that, but is it a type of stealth technique?” (Shougetsu)</p><br/><p>“Yeah. He is most likely using some special method to conceal his ability. And in reality, I saw him fighting with magic, but I didn’t feel any spells or the preparation of them at all.” (Yuduki)</p><br/><p>“That’s true. Now that you mention it, I wasn’t able to feel at all how much magic power he had.” (Shougetsu)</p><br/><p>“That’s why, in our eyes, we ended up seeing the merchant Raidou-dono as a reasonably strong teacher of Rotsgard Academy that was able to deal with three assassins. Being able to conceal such high strength with a concealment technique, is one of my fears.” (Yuduki)</p><br/><p>“Fear huh.” (Shougetsu)</p><br/><p>A complicated expression appears on Shougetsu.</p><br/><p>Even though they have made a cooperative relationship with Raidou just a few moments ago, they already have people in their camp that have minus emotions.</p><br/><p>“And the other one, it leads to what I unconsciously said to him but…that heart…” (Yuduki)</p><br/><p>“Heart?” (Akashi)</p><br/><p>Akashi repeated what Yuduki said.</p><br/><p>That’s because Akashi couldn’t understand the meaning of Yuduki fearing his heart.</p><br/><p>“Killing three people without a single change from his usual self. Don’t you think that’s impossible, Akashi?” (Yuduki)</p><br/><p>“Hey hey, they were enemies, you know? Of course that depends on the experience, but he was most likely used to being attacked. It is certainly true that, for a merchant, he was a bit too calm but…” (Akashi)</p><br/><p>Reprimanding someone for killing enemies without any conflicting feelings, that’s what shouldn’t be done.</p><br/><p>It is a fight with people that are aiming for your life.</p><br/><p>First time, second, third; it may be slowly, but people get used to being attacked and fighting back.</p><br/><p>Akashi was pointing out exactly that.</p><br/><p>“It was different from being accustomed. You and I, if they are enemies, we will of course cut down our enemies without hesitation. But at those moments, our bodies and hearts become that of someone that kills others.” (Yuduki)</p><br/><p>“…”</p><br/><p>“…Fuh… You see, killing someone as naturally as breathing, as doing casual talk, as going to bed; that’s not something that someone would normally be able to do, right?” (Yuduki)</p><br/><p>“Yeah, I probably wouldn’t be able to relax to that extent. I do still have that nature in me.” (Akashi)</p><br/><p>“That’s right. That’s how it normally should be. That’s why, when Raidou was attacked, he was supposed to stand up, prepare to fight, and should have let out killing intent from his eyes and whole body, right?” (Yuduki)</p><br/><p>“Well, that should be the case……. Eh?” (Akashi)</p><br/><p>“I was observing him, but he didn’t show any signs of that. He was sitting and was exactly in the same state as he was when talking with Shougetsu-sama and us. Without showing a bit of fighting spirit and killing intent, he confirmed the attackers, and killed them. He looked at the assassins, and decided to fight them -no, to kill them, and that’s how he did it.” (Yuduki)</p><br/><p>She didn’t feel the normal reactions a person should have when faced with a fight from Raidou.</p><br/><p>Yuduki had seen a nature that she has never seen in the past.</p><br/><p>“…”</p><br/><p>“Within the super first rate adventurers, I have heard that there are people that are always on their top gear level of concentration. This probably can also be applied to people that are always in the battlefield. Being in your top gear of concentration, for a normal person, they would only be able to maintain that state for several minutes at most, so in order to do this, you would have to face quite the training.” (Yuduki)</p><br/><p>Whether it is in battle or in a match, it is obviously difficult to maintain your highest level of concentration.</p><br/><p>If replicated in your everyday life, it would make it even more difficult.</p><br/><p>“…”</p><br/><p>“But it was also different from that. He did it so smoothly -no, he probably finished the fight before he even entered a battle state of mind. That’s why we were unable to properly grasp what had happened a few moments ago. Sorry, I am also unable to properly express what’s in my mind.” (Yuduki)</p><br/><p>Yuduki not only fulfills the role of a warrior, she also has the job of seeing through people, appraise them, and evaluate them.</p><br/><p>That’s exactly why she is able to observe many people and evaluate their characteristics.</p><br/><p>This is something that Shougetsu, Akashi, and Iroha trust.</p><br/><p>But right now, a person that even her eyes are unable to understand has appeared.</p><br/><p>A strong person that was able to wipe out three remarkable assassins while still sitting and as if it was nothing. And yet, he is a merchant that they couldn’t feel any traces of being a combatant.</p><br/><p>Yuduki herself was still unable to grasp the person called Raidou.</p><br/><p>“A fight that’s not a fight…as if breathing. Hm, I don’t get it.” (Akashi)</p><br/><p>On the other hand, Akashi who had heard the words of Yuduki seemed like she didn’t understand it much.</p><br/><p>Her impression of Raidou was that as long as they don’t cause any problem, he wouldn’t be hostile towards them. It wasn’t such a complicated matter.</p><br/><p>“Right. Once I finish sorting it out, I will speak of it again. And so, Shougetsu-sama, just as you said, it is certainly true that having Iroha-sama in the care of Raidou-dono is the number one safest choice.” (Yuduki)</p><br/><p>“Un, yeah.” (Shougetsu)</p><br/><p>Shougetsu was also thinking about the origin of this conspiracy.</p><br/><p>The words of Yuduki returned him to his senses, and he pays attention to what she has to say.</p><br/><p>“Is that really okay?” (Yuduki)</p><br/><p>“What do you mean by that?” (Shougetsu)</p><br/><p>“Something about Raidou-dono is…different. Is it really fine to leave Iroha-sama at his side?” (Yuduki)</p><br/><p>“Are you saying that he will be a bad influence?” (Shougetsu)</p><br/><p>“Honestly speaking, it is an anxiety that maybe Iroha-sama will end up changing.” (Yuduki)</p><br/><p>“It can’t be helped if she were to change to a certain extent. In the first place, if we are talking about that, then her fiance, Izumo Ikusabe, has already been influenced quite a lot by him after all. Whatever the case, in the future, he is a factor that we won’t be able to avoid anyways.” (Shougetsu)</p><br/><p>“Izumo-sama…that’s true. Then, are you saying that she already has resistance towards his influence while in their travel to Kannaoi?” (Yuduki)</p><br/><p>“Yeah. Also, Iroha-sama is a sagacious princess. Even if she were to have an interest in someone she doesn’t know, she won’t idolize them. More the case if they are only going to be together for a short amount of time. Believing in the princess in this kind of moments, isn’t that how loyalty works?” (Shougetsu)</p><br/><p>“…Understood.” (Yuduki)</p><br/><p>“I will be expecting things from your trained eyes in the future as well, but the situation seems to be a bit different from what we expected. Currently, we have no choice but to rely on him. With that into consideration, I am counting on you.” (Shougetsu)</p><br/><p>“Yes.”</p><br/><p>“Akashi as well, the journey from tomorrow on, I expect much from you. Even if they are skilled individuals, if it is you guys, I believe that you can manage.” (Shougetsu)</p><br/><p>Shougetsu looked at the two bodyguards with a wide smile as if looking at his own granddaughters.</p><br/><p>“Well, we will try to manage with our lives on the line.” (Akashi)</p><br/><p>“I will do my best.” (Yuduki)</p><br/><p>“Good grief, not only inside our country, to think we would be involved in a conspiracy from a foreign country as well. I can’t even get a comfortable retirement after reaching this age. The world is not kind to old people anymore.” (Shougetsu)</p><br/><p>Contrary to his words, the old man’s spine was straightened which was seldom seen nowadays, and was brimming with vitality.</p><br/><p>The girls that were looking at him had a troubled smile, and obeying Shougetsu who was walking at the front, they left the place.</p><br/><p>Raidou is aiming for the labyrinth.</p><br/><p>And as if welcoming him, a blood-stench strife had both arms wide open.</p><br/><p>The moment Lorel learns of Kuzunoha Company…was close to coming.</p><br/>\n</div>"}