{"title": "Chapter 255: Beren’s report", "id": 255, "volume": 3, "url": "http://boxnovel.org/tsuki-ga-michibiku-isekai-douchuu-chapter-255-beren%E2%80%99s-report", "volume_title": "Volume 3", "body": "<h1>Chapter 255: Beren’s report</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 255: Beren’s report</p><br/><p>There’s a garden, and we were guided to the shed there.</p><br/><p>Even if the hotel is big, it is still strange to have a shed at the third floor of a hotel, and on top of that, there’s a garden.</p><br/><p>From the window of the room there, I could appreciate the pseudo-japanese garden.</p><br/><p>No well, it does feel strange to have palm trees and several colorful fruits constantly changing colors, but I think this enters into the category of a japanese garden.</p><br/><p>I don’t have much knowledge about gardens after all.</p><br/><p>I am simply feeling like: what the hell is this?</p><br/><p>The inside of the house is tiled and the rooms were covered in tatami mats.</p><br/><p>It may be a mix of japanese and european style, but it is a bit more relaxing this way.</p><br/><p>Probably because my house felt similar to this.</p><br/><p>Nevertheless…there’s 4 rooms and the passage is wide enough for two people to walk side by side.</p><br/><p>How fearsome is Chihiro Man Rai restaurant.</p><br/><p>“Now now, Waka-sama, over here.”</p><br/><p>After checking out the rooms and the garden, Beren guides me again.</p><br/><p>Well, even if I say guide, he simply led me to the room where I saw the garden, and made me seat at the seat of honor.</p><br/><p>Around the square table, there’s a number of floor cushions.</p><br/><p>This is something I see for the first time in this world as well, but for me, it is a fresh view.</p><br/><p>It is been awhile since I have seen a room without chairs.</p><br/><p>When I sit, Mio beckons Iroha-chan and both of them sit as well.</p><br/><p>I did suggest Beren to take a seat too, but he stayed standing.</p><br/><p>‘It would be outrageous to sit before Tomoe-sama comes’, apparently.</p><br/><p>The Forest Oni, Shii, in a terrible twist of fate, respects Eris and is mimicking a lot of her speech and conduct, but in this kind of situations, she hasn’t been able to completely mimic her.</p><br/><p>At her roots, Shii is a serious and athletic type of girl, so she hasn’t taken a sit either.</p><br/><p>If it were Eris, she would have the guest Iroha-chan sit, and while at it, she would also sit as well, no doubt about it.</p><br/><p>Seems like Akua and Eris are pretty admired by their juniors, but the athletic type ones, no matter if male or female, are easily attracted to Akua’s side, but for some reason, Shii is one of the worst cases.</p><br/><p>Her way of fighting is one that’s rare in Forest Onis, close range combat, and she is the power type that swings around a metal rod that doesn’t match her small stature.</p><br/><p>In this part as well, she is not similar to Akua and Eris.</p><br/><p>Hokuto who is at her side, is one of the 4 Arkes.</p><br/><p>He is a serious person and likes fights.</p><br/><p>We don’t interact much, but I heard from Tomoe that he likes ninjas.</p><br/><p>His looks are that of a big man of good build, and yet, he has a technical battle style using strings.</p><br/><p>The reason these two were chosen to accompany us this time was because, from Tomoe’s perspective, ‘they are the casts that fit the best in terms of physique and ability’.</p><br/><p>Beren, who had encouraged me to take the seat of honor, is probably the person within the Elder Dwarfs that I speak with the most.</p><br/><p>In terms of weapons, he has a decent mastery in a good amount of them, but the one he is the best with is the axe. In terms of magic, he can use self-buffs and healing, but the other magic is on the negative side.</p><br/><p>Even so, calling him a warrior would not be accurate.</p><br/><p>Beren’s fighting style is to use a variety of equipments and tools with effects, and by taking advantage of those, he aims for a decisive strike with his axe.</p><br/><p>My impressions when spectating him, feels like the style of magic warriors.</p><br/><p>Hm, she is here.</p><br/><p>“Sorry for the tardiness.” (Tomoe)</p><br/><p>While I was thinking about the people from the Kuzunoha Company that have come with us to Lorel, I felt the presence of someone at the door.</p><br/><p>After an apology, Tomoe entered the room.</p><br/><p>Confirming that Mio, Iroha-chan, and I were sitting, she nods and finds her floor cushion to sit on.</p><br/><p>“Sorry about leaving you a troublesome matter like that.” (Makoto)</p><br/><p>“It’s okay. Aside from the fried rice that is famous, there’s also many other things that seem to be delicacies as well, so I think we will be able to enjoy the meals here for a few days.” (Tomoe)</p><br/><p>“As expected of Tomoe-san. Gud jobbu-desu.” (Mio)</p><br/><p>Before I got the chance to answer, Mio makes a thumbs up satisfied.</p><br/><p>“Leave it to me, Mio. As we journey, we will eat their specialties. That is one of the good parts about journeys-ja.” (Tomoe)</p><br/><p>“Just as you say. Fried rice, I wonder just how good of a rice dish it will be.” (Mio)</p><br/><p>It is rare to see Tomoe and Mio be so in sync, and they are all smiles too.</p><br/><p>“Oh, you guys as well, good work-ja. Now then, take a seat already. Let’s hear your report.” (Tomoe)</p><br/><p>I can tell that the two of them are in a good mood.</p><br/><p>After this, as long as there’s no troublesome things coming out from anyone’s mouth, it would be great.</p><br/><p>The three heed the words of Tomoe and sit.</p><br/><p>…In seiza.</p><br/><p>N-No well, it is true that that’s not incorrect, but is that okay?</p><br/><p>By the way, I am sitting cross-legged, Mio looks like she is in seiza, but she is actually more slanted to the side. Tomoe and Iroha-chan are doing seiza.</p><br/><p>Tomoe is used to it already, and Iroha-chan did it naturally so she is most likely used to it as well, but…I haven’t seen Beren and the others doing seiza at Asora…</p><br/><p>Well, they did it themselves so let’s not mind it.</p><br/><p>“Well then, I will begin.”</p><br/><p>The three look at each other and Beren nods.</p><br/><p>The report begins with Beren huh.</p><br/><p>If I remember correctly, he entered the country from the north mountain ranges.</p><br/><p>Seems like it was because the dwarfs he is familiar with are living at the north side.</p><br/><p>“Beren huh. Fine, begin.” (Tomoe)</p><br/><p>“Yes. I received the order to act independently from Waka-sama and the others, and to enter the country from a different way to gather information. So I crossed the Tortoise Soul mountain range and passed the mountain belt to reach Kannaoi.” (Beren)</p><br/><p>“The Tortoise Soul mountain range?! The one at the north national border…” (Iroha)</p><br/><p>“Ah, yeah. That’s right, Ojou-san.” (Beren)</p><br/><p>“Iroha, sorry but, please stay silent for a bit. Hm, right. Beren, Hokuto, Shii, let me introduce her. This girl is Iroha. Fate brought us together, and she is a guest that will be accompanying us for a while. Then Beren, continue.” (Tomoe)</p><br/><p>Now that I think about it, we didn’t properly introduce her… I feel like they already knew.</p><br/><p>“Yes… after I visited the village of my acquaintance dwarfs, I traversed to mostly settlements of demi-humans on the way, but what piqued my interest was how high the good will of demi-humans was towards hyumans, and also, the attitude of the hyumans towards the demi-humans.” (Beren)</p><br/><p>“As expected, it was a lot better compared to other countries?” (Tomoe)</p><br/><p>“Yes. But…both sides had the influence of that special existence called Wise. Accurately speaking, the good will of the demi-humans is directed towards the Wise, and this indirectly affects their view towards the hyumans in this country that treat the Wise well. The comparatively softer behaviour the hyumans have towards the demi-humans is also…because the Wise are tolerant with the demi-humans, so it indirectly affects them as well.” (Beren)</p><br/><p>…Fumu.</p><br/><p>If the Wise are japanese, they would definitely treat the demi-humans more equally than most of the hyumans in this world.</p><br/><p>The Wise were loved by the demi-humans, and as a result, the hyumans in this country that were actively giving the Wise shelter were favorably seen.</p><br/><p>Favorably huh.</p><br/><p>It somewhat feels like a warped relationship…but delving deeper would be uncouth.</p><br/><p>This is allowing them to have a better impression with each other compared to other countries, so if their relationship is also better, there’s no need to touch the topic.</p><br/><p>“That’s why, when the absence of the Wise is long, there’s the tendency that the relationship between hyumans and demi-humans deteriorates. There have been conflicts recorded in the past.” (Beren)</p><br/><p>“That’s a lie-desu! It is because the demi-humans try to advocate for too much authority—” (Iroha)</p><br/><p>“Iroha, we will hear that later. Don’t make me say it so many times.” (Tomoe)</p><br/><p>“Y-Yes, sorry.” (Iroha)</p><br/><p>“The first dwarf village I questioned didn’t interact much with hyumans. Of course, there weren’t conflicts between them either. However, in a number of mountain villages, there was indeed that kind of reality. No doubt about it.” (Beren) </p><br/><p>“We are not doubting you, Beren. Continue. We have already understood the relationship between demi-humans and hyumans, so move on.” (Tomoe)</p><br/><p>“Then, this is a report I have brought to Tomoe-sama before. Along my journey, I told the clearly skilled craftsmen and the people that were especially interested in migrating about the ‘Kuzunoha Company’, and there were several cases where the other party got pretty proactive about it. We have already made the proper arrangements.” (Beren)</p><br/><p>Ah, if I remember correctly, I heard that from Tomoe before. That there were quite a lot of people aside from the first dwarf village he went to, that want to move to Asora.</p><br/><p>Wanting to migrate and being proactive about it doesn’t exactly mean that the settlements are fed up with hyumans, but I heard that more than half of them are.</p><br/><p>I think I will be meeting the people that Beren has already spoken to in the near future.</p><br/><p>The customary closing interview.</p><br/><p>“This is only to confirm but, is there any race or settlement there that is deeply involved with the current Lorel?” (Makoto)</p><br/><p>“Of course, no. This is a strict order from Waka-sama, so I edged it in my heart and didn’t forget a single word of it.” (Beren)</p><br/><p>“Thanks. Then, there’s something I want to ask before you continue.” (Makoto)</p><br/><p>Regarding the mysterious sprite that Beren probably knows more of than us.</p><br/><p>That bearded–I mean, that strong sprite that has a beard, and yet, it is cute.</p><br/><p>Well…it is the beard.</p><br/><p>“If it is information that I have heard along the journey, ask me as much you want!” (Beren)</p><br/><p>“Then, I will be straight, what in the world is a Marikosan?” (Makoto)</p><br/><p>“…Marikosan, huh.” (Beren)</p><br/><p>“Yeah.” (Makoto)</p><br/><p>The tension of Beren lowers.</p><br/><p>It feels like he felt despondent the moment he heard that name.</p><br/><p>“The only thing I heard of it is that they are sprites that live mainly in the Yaso-Katsui dungeon. Since they are earth sprites, they probably have connections with us dwarfs, but…in terms of details…I am truly sorry!!” (Beren)</p><br/><p>“Ah, no, there’s no need to apologize.” (Makoto)</p><br/><p>“Things I know would be…they are around this size. They are girls with an overall cute appearance. Also, they are mainly wearing things like hard hats, hunting caps, or have beast ears. Anyways, no matter which one it is, they all like to wear a hat.” (Beren)</p><br/><p>O…oooh…</p><br/><p>Detailed information came out!</p><br/><p>As expected of Beren!!</p><br/><p>But wait…something is kind of bothering me here.</p><br/><p>What part?</p><br/><p>Uhm…</p><br/><p>“It seems like their physical strength is decent, but maybe they are lazy, they hate walking and are mostly floating. There was also information that they have a number of mysterious special characteristics from Spirits and other sprites.” (Beren)</p><br/><p>As I try to think about what part of Beren’s explanation was bothering me, his explanation of Mariko-san continued.</p><br/><p>Overall cute gir—Ah?!</p><br/><p>That’s it!</p><br/><p>“The Marikosans are only girls? Isn’t that pretty rare as a race?” (Makoto)</p><br/><p>Well, there are races like the Gorgons, but frankly speaking, I haven’t met a race that’s only women aside from the Gorgons.</p><br/><p>There’s no doubt they are quite the rare race.</p><br/><p>By the way, I have not met them in person, but there are races that are the opposite of Gorgons, races that only have males. It is apparently pretty rare as well, but they do exist.</p><br/><p>If it is only knowledge, I know of the Ogre Rex, a type of Oni race, and the Veil Gazer, a type of one-eyed demonic beast.</p><br/><p>If the Marikosan are in that category of races, I feel like their name should be more widespread.</p><br/><p>“I think this is something that lacks credibility, but I heard that if you have a special crystal and fulfill a number of prerequisites, races other than Marikosan can…uhm…’increase’.” (Beren)</p><br/><p>“Increase? Ah, like in a reproductive kind of way? The propagation type?” (Makoto)</p><br/><p>“I…wonder…” (Beren)</p><br/><p>With a troubled expression, Beren is stuck in how to respond.</p><br/><p>Can’t be helped.</p><br/><p>After finally gathering outward features, this new information about using crystals and doing things to ‘increase’, what’s with that? We learned one thing and then even more mysteries got piled up.</p><br/><p>“…From what I heard of Beren, rather than calling it a peculiar race, aren’t they just a washout version of Spirits?” (Mio)</p><br/><p>Mio voices out a deduction of hers.</p><br/><p>It is true that he said they had similar characteristics of Spirits and other sprites.</p><br/><p>Abilities that naturally activate strongly for Low Spirits in places where the respective element is.</p><br/><p>In that case, they would be a race that’s a lot closer to spirits?</p><br/><p>“It is a possible hypothesis, but I wonder if a race that’s closer to Spirits would be at the side of a Superior Dragon. Superior Dragons and Spirits are fundamentally in an antagonistic relationship, you know?” (Tomoe)</p><br/><p>Tomoe tilts her head at Mio’s opinion.</p><br/><p>The conditions apply, but the relationship doesn’t huh.</p><br/><p>According to Tomoe and Root, the Spirits were existences created by the Goddess.</p><br/><p>They began by being able to govern over the four elements, and then, headed on to many other elements…as a result, the ones that were managing these elements from the ‘beginning’ and were the personifications of them, were replaced by the Spirits.</p><br/><p>Like for example; the Superior Dragons.</p><br/><p>Root also wasn’t content with that result, and in the long past, quite a lot of fights took place.</p><br/><p>For some reason, there’s a lot of cases where, the older the race is, the higher the hate they have towards the Spirits, with the Superior Dragons being the first ones. I heard this from a certain genius and perverted dragon who then said that these sequence of events are not written in any existing books.</p><br/><p>It seems like the I am the only one who knows this within the currently living demi-humans and hyumans.</p><br/><p>I can still remember the face of Root. He had a wide smile as he placed his index finger onto his mouth and whispered to me: ‘If you imprudently speak of this, the Church will use their whole force to erase you, so Shh~, okay?’.</p><br/><p>Yeah, even though I didn’t ask of it, he still told me this on his own convenience.</p><br/><p>Oops, gotta stop.</p><br/><p>This is a bad habit of mine I can’t seem to throw away.</p><br/><p>Concentrate on the reports.</p><br/><p>When I turned to look at Iroha-chan to change my mood, I could see a question mark floating on her head.</p><br/><p>For her, Marikosan is simply Marikosan, and probably doesn’t have any issues about what kind of existence they are.</p><br/><p>It is certain that they are a mascot-like existence for Kannaoi after all.</p><br/><p>“Pardon.”</p><br/><p>“What is it, Shii?” (Makoto)</p><br/><p>I urge the small Forest Oni, who suddenly raised her hand, to go ahead with what she wants to say.</p><br/><p>“Isn’t it okay to think of it in a more simple way? We also investigated a variety of things about Marikosan, but thinking about the results, I thought that maybe they are unexpectedly pretty easy to understand.” (Shii)</p><br/><p>“Result?” (Makoto)</p><br/><p>Is it the point that this rare and mysterious sprite is indeed existing in the dungeons?</p><br/><p>“This labyrinth, that is the biggest within the ones that have been currently confirmed, is the dwelling of one of the Superior Dragons, Doma, and seems like there’s a sprite race that likes the place. In other words…isn’t it an incredibly simple reason like ‘their interests align, so they are coexisting’?” (Shii)</p><br/><p>“…”</p><br/><p>Tomoe, Mio, Beren, and I, and even Hokuto who has been silent from the beginning were staring at Shii.</p><br/><p>“Even if we say Superior Dragons, each one of them has an individual personality, and that Marikosan who I don’t know if it’s a fairy or a spirit, had a perfect affinity with each other, and they went like: ‘why don’t we coexist?’. How is that?” (Shii)</p><br/><p>That kind of attitude that is practically saying: ‘this is so troublesome’ and rounds up all documents and throws them in the trash can.</p><br/><p>Nice.</p><br/><p>I like that attitude.</p><br/><p>But society normally hates that way of acting.</p><br/><p>‘Because it would make things more complicated as a result’, or so they say.</p><br/><p>“…Fuh…normally, I would have slapped you with the paper fan a long time ago, but…we are talking about Doma after all. The possibility is there-ja.” (Tomoe)</p><br/><p>Hah?!</p><br/><p>The first one speaking out was Tomoe, and what came out from her mouth were words that sounded like an affirmation.</p><br/><p>“Even a dragon like you who was sleeping till death would say that much about this dragon? Just saying but, if that guy is worse than Root, I will stop thinking and just let my instincts move my body.” (Mio)</p><br/><p>“I won’t stop you, I promise.” (Tomoe)</p><br/><p>With a look of being truly fed up, Tomoe sighs.</p><br/><p>Even in the eyes of Tomoe, there’s the chance that, in terms of personality, this dragon is even more hopeless than Root.</p><br/><p>“A dungeon Spirit huh. Well, we are going to be meeting them in person, so let’s just think of them in that way for the time being.” (Makoto)</p><br/><p>“Sorry for not being of much help, Waka-sama.” (Beren)</p><br/><p>“No, you have been plenty helpful.” (Makoto)</p><br/><p>With his tension still low, Beren apologizes.</p><br/><p>I tell him that it was plenty enough. And in truth, he worked pretty hard, and looking at his luggage, I can tell that he has also checked a variety of materials.</p><br/><p>There were so many things that you would even question just how in the world he carried them all the way here, and they were stuffed in a different room, so I can tell.</p><br/><p>“That’s the only amount of information I could gather about Marikosan, and the demi-humans didn’t have any detailed information about the mercenary group that’s based at the labyrinths depths. That’s why, what’s left for me to say is about the products and specialties…ah.” (Beren)</p><br/><p>“What’s wrong?” (Makoto)</p><br/><p>“I will return soon, so please wait for a bit.” (Beren)</p><br/><p>Regarding the products and specialties, we can move them all to Asora and have them investigated, researched or whatever they want to do.</p><br/><p>That’s why I thought the report of Beren was over, but he seemed like he had just remembered something. He rushed out from the room, and went to the above mentioned room where the luggage is.</p><br/><p>Sounds were heard for a few minutes, and then, Beren returned with what clearly looks like a special cloth wrapped around something.</p><br/><p>It is pretty big.</p><br/><p>And it looks reasonably heavy.</p><br/><p>It is a long and thin cylindrical shape, so maybe it is a sword or a spear.</p><br/><p>“How to say, it is interesting…or more like, ill-natured…anyways, it is that kind of weapon. The chief of the dwarf village that had it stored told me to please show it to Waka-sama. I was also told that, if pleases you, you can take it as a present from them.” (Beren)</p><br/><p>“Is it a sword…or a spear?” (Makoto)</p><br/><p>I try to directly confirm my guess.</p><br/><p>Whichever it is, I don’t think I would be able to properly use it even if I had it –to my disappointment.</p><br/><p>“It is a sword.” (Beren)</p><br/><p>“Hoh?” (Tomoe)</p><br/><p>Seems like the answer of Beren pulled the attention of Tomoe, she made a sound of being interested in what it is.</p><br/><p>“…It is probably not something that would fit Tomoe-sama’s taste, but this was most likely the favorite sword of a person called Iori. The demonic dragon slayer sword *‘Einkaref’*. Please take a look.” (Beren) </p><br/><p>“?!! Ior–?! A-Au…wafuuu…” (Iroha)</p><br/><p>“Wa, Iroha-chan?!” (Makoto)</p><br/><p>What appeared when Beren unwrapped the cloth was a very long and thin sword.</p><br/><p>Hearing the explanation of Beren, Iroha-chan suddenly stood up and screamed unintelligible words in an upright stance, and just like that…she fell backwards.</p><br/><p>I hurriedly catch her as she fell to the floor and breath a sigh of relief.</p><br/><p>Iori huh.</p><br/><p>If I remember correctly, that’s the historical figure that Iroha-chan likes.</p><br/><p>“This time she loses consciousness huh. Iroha is a troublesome girl, but it is nice that she is quiet now. But, Dragon Slayer huh.” (Tomoe)</p><br/><p>The eyes of Tomoe narrow.</p><br/><p>A risky atmosphere leaks out slightly, but maybe her curiosity is winning, it wasn’t a dangerous atmosphere.</p><br/><p>But probably because of how much the Forest Oni, Shii, has been wrung by Tomoe, her body springs up reflexively and trembles.</p><br/><p>…</p><br/><p>The sword of a Dragon Slayer huh.</p><br/><p>The figure of Sofia appears in my mind for a second.</p><br/><p>Her sword was a lot bigger than this.</p><br/><p>Compared to that one, this one looks pretty delicate.</p><br/><p>I don’t know if you are supposed to smear poison at the blade of the sword, but there’s some complicated patterns on it, or maybe those are seams? Anyways, I don’t understand it well, but the craftsmanship looks pretty complicated.</p><br/><p>Rather than saying it is strong enough to cut the scales of a dragon like butter, it is probably more like a special effect lets it be more advantageous against dragons.</p><br/><p>I don’t know about this ill-natured part that Beren mentioned, but…it is certainly true that I feel something different compared to the weapons I have seen before.</p><br/><p>I wonder what.</p><br/><p>“This demonic sword Einkaref was made by our ancestors at that time, and crafted with a certain tree as its core…” (Beren)</p><br/><p>The explanation of Beren begins.</p><br/><p>Aside from Mio, everyone else showed some interest in it and were listening to what he was saying.</p><br/><p>A special tree huh.</p><br/><p>Is that the reason for this sense of discomfort that’s different from other weapons?</p><br/><p>But I feel like it somewhat resembles my Azusa…or maybe not…</p><br/><p>(Is that true, bro? Those are really unsure words, but do you know a companion of mine? Seriously?)</p><br/><p>…</p><br/><p>“Waka, is there something wrong?” (Tomoe)</p><br/><p>“…No, it is nothing.” (Makoto)</p><br/><p>I heard something.</p><br/><p>I look at my surroundings.</p><br/><p>But aside from me, there’s no one that seems to have noticed it.</p><br/><p>The most that happened was that they were worried about me looking around the room.</p><br/><p>But this was not an auditory hallucination.</p><br/><p>It had a clear sensation of being here and speaking.</p><br/><p>It felt kind of light and cheap though.</p><br/><p>(That’s rude~. Even though I have finally been freed and was able to arrive at a place with an interesting bunch.)</p><br/><p>Ah.</p><br/><p>Lately, the boundaries have been slowly disappearing and I have been able to speak with a variety of things.</p><br/><p>I see.</p><br/><p>I look at the sword that’s on top of the Japanese style desk.</p><br/><p>It is this thing huh.</p><br/><p>(Jackpot, bro. You are a guy with good adaptability. I am Einkaref. The supreme Dragon Slayer that accompanied the old man Iori his whole life.) (Einkaref)</p><br/><p>So I am now able to speak with weapons.</p><br/><p>It is true that I was able to speak with things like trees and stones, and not only people, I am able to speak with most things that can hardly be called animals.</p><br/><p>If I am not careful, I will be treated like even more of a weirdo.</p><br/><p>Hah…</p><br/><p>(Don’t worry, bro. The only ones that can speak with me are a handful of worthy swordsmen. It is not like you have gone crazy.) (Einkaref)</p><br/><p>I am not even a swordsman, so it is a situation I can’t be relieved about.</p><br/><p>Ah…the reason why I felt you were similar to Azusa was because the sensation was close to when my will is connected to my bow huh.</p><br/><p>(Eh? Wait, this is strange. Looks like it is true that bro is not a swordsman. I was created so that I can only talk with masters that are ‘compatible’ with me though. Hm…oh well, let’s not mind the small stuff. I’ve had a lack of people to talk to, you see. Let’s begin by introducing ourselves.) (Einkaref)</p><br/><p>The explanation of Beren goes through my left ear and out to my right.</p><br/><p>Not much of it enters in my brain.</p><br/><p>Because this odd sword, Einkaref, that’s one-sidedly talking to me, is sonorously talking about his own history and achievements without stopping.</p><br/><p>Makoto Excalibur2</p><br/><p>Seeing myself slowly become less and less human, I felt a bit of self-pity.</p><br/><p>Iroha-chan didn’t show any signs of waking up, and the strange meeting (for me) continued.</p><br/>\n</div>"}