{"title": "Chapter 259: That’s probably the Mascot M", "id": 259, "volume": 3, "url": "http://boxnovel.org/tsuki-ga-michibiku-isekai-douchuu-chapter-259-that%E2%80%99s-probably-the-mascot-m", "volume_title": "Volume 3", "body": "<h1>Chapter 259: That’s probably the Mascot M</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 259: That’s probably the Mascot M</p><br/><p>What a problem.</p><br/><p>Even the thought transmission made in Asora was not able to connect at all.</p><br/><p>I can feel the safety of Tomoe and Mio who I have formed a pact with, so the other side probably also knows about my safety.</p><br/><p>That’s what I want to think.</p><br/><p>In this labyrinth, the first thing we do when we arrive at a new floor is to search for the Obelisk-like device called ‘Portal’ and register the floor we have reached.</p><br/><p>The Alt floor I am currently in, curves and bends loosely back and forth, but it is one road.</p><br/><p>That point honestly makes me happy.</p><br/><p>Probably, as long as I continue advancing in the path that I am directed to, I will arrive at some portal, or…the teleport formation for the next floor.</p><br/><p>Now that I think about it, if there were a portal here, an adventurer that has come here once, would be able to come here as many times as they want.</p><br/><p>…In that case, the chances that there’s no portal and only a teleport formation are high.</p><br/><p>The enemies at the second floor were, as expected, not that big of a deal, so the mamonos at this floor shouldn’t cause me much trouble either.</p><br/><p>That applies for me and for Tomoe and the others as well.</p><br/><p>In other words, instead of stopping here trying to regain communication, it is better to move ahead and hope to regroup.</p><br/><p>“Let’s go.” (Makoto)</p><br/><p>With slightly fast-paced steps, I advance through the red lighted corridor.</p><br/><p>There are times when mamonos are encamped normally at the corridor, and some that come out from the other pitch black side of the pillars where the light doesn’t reach to make surprise attacks, and it is a pattern of being attacked every several minutes.</p><br/><p>It is not to the point that I would have to stop my advance.</p><br/><p>It all finishes with one magic attack, but…they are a lot stronger than the ones of Drake Garden.</p><br/><p>At the second floor, there was a sign saying that the second floor is a fiendish area, and there were few parties fighting close to the teleport formation.</p><br/><p>When we advanced, we saw a number of lesser dragons, that were slightly stronger than the one that defeated Jin and the others quite a long while ago, flying in the sky and walking on the ground.</p><br/><p>Just like the name Garden denotes, it is a strange area where there’s a pseudo-blue sky and verdant grass.</p><br/><p>It was an important place that taught me that a dungeon doesn’t always equal caves.</p><br/><p>“At that place, the dragons called drakes were divided between two elements: earth and wind, but this place…” (Makoto)</p><br/><p>After already defeating around 20 of those, I could tell that the element of the enemies on this floor are all a mess. Not only that, there’s also ones that cast magic from far away, some that try to cut me with their claws and fangs, undeads that are armed and come rushing at me; truly a variety that doesn’t bore me.</p><br/><p>I am using a non-elemental Brid to bulldoze through the place, so it doesn’t feel problematic at all.</p><br/><p>But compared to the second floor, I feel like the difficulty has increased quite a lot.</p><br/><p>No, saying it bluntly, this is practically throwing someone to their death.</p><br/><p>Alt huh.</p><br/><p>There’s no assurance that it is connected to the keyboard’s Alt, but it sounds like it has connections with english.</p><br/><p>A word that begins with those three letters…</p><br/><p>…</p><br/><p>Someone please bring me an english-japanese dictionary.</p><br/><p>Well, I can try to associate words and see…</p><br/><p>I am not using my brain for anything aside from moving forward, so thinking about this is better than moving foward brain death. </p><br/><p>[Alto, Alter, Altar…</p><br/><p>Alter…I think I have seen it before in a game written as alternative.</p><br/><p>What was the meaning of it?</p><br/><p>Like ‘the other thing’? ‘One other’? I feel like that was the meaning of it.</p><br/><p>If I remember correctly, I learned at the music class that Alto is the volume of your voice.</p><br/><p>But I wonder if that was english.</p><br/><p>It felt kind of european.]</p><br/><p>From within those choices, well, it’s probably safe to assume that alternative is the one.</p><br/><p>Different floor, one other floor; it feels like that’s correct.</p><br/><p>I can also understand why it is at a computer’s keyboard.</p><br/><p>…At any rate…isn’t the encounter rate for mamonos increasing?</p><br/><p>The amount of Brids I am casting has increased quite a lot since the initial stages.</p><br/><p>From the front, from the sides, and even from the back where I have already passed through; even though I haven’t found the portal or the teleport formation, a variety of mamonos are attacking me.</p><br/><p>Leaving aside the lights from the ceiling, the density of mamonos is enough to cover most of the red lights from the floor.</p><br/><p>At this rate, it is a matter of time before I get completely swarmed over and can’t move at all.</p><br/><p>Let’s increase the pace.</p><br/><p>From a jogging pace, I changed into running speed and shake off the mamonos from behind while I scatter the ones from the front.</p><br/><p>I single-mindedly run on top of the red light.</p><br/><p>I evade the avoidable ones from the side, and blow away any that seemed like they would get in the way of my progression.</p><br/><p>Seeing the second big curve I encounter, I somewhat understood the shape of this floor.</p><br/><p>The first straight line was around 3km, a circular curve of around 90°, and then, it returned to a straight line and once again a curve, after that, another long straight line.</p><br/><p>It is close to the form of a track field.</p><br/><p>Also, there’s some slight slopes, so it might have a spiral shape.</p><br/><p>On top of not finding the portal, the frequency of enemy encounters isn’t lowering at all.</p><br/><p>I pray that there’s no more curves ahead.</p><br/><p>As I pray for this, I continue running.</p><br/><p>Even if the situation is different at the place of Tomoe and the others, I wonder if they are facing the same unavoidable battles.</p><br/><p>If that’s the case, this place is really ill-natured.</p><br/><p>More than scheming, more than solving puzzles, and more than mapping precision; it is simply stressing on battle prowess.</p><br/><p>If this kind of floors appear sporadically in this place, Yaso-Katsui is quite a bothersome dungeon.</p><br/><p>While thinking this and running, I found something that was not a portal, but is better than another curve.</p><br/><p>“Is that…a curtain of light?” (Makoto)</p><br/><p>A fleeting and gentle green light was undulating like an aurora as it trails forward.</p><br/><p>This thing that covers the floor all the way to the ceiling certainly did look like a curtain.</p><br/><p>If this means that we are at the end, that would be the best, but at worst, I would like it to be a checkpoint of sorts.</p><br/><p>“And goal.” (Makoto)</p><br/><p>I pass the curtain without much resistance.</p><br/><p>It felt like cutting through a goal tape.</p><br/><p>Well, I wasn’t the athletic type in my world, so I don’t really know how it feels to cut through a goal tape though.</p><br/><p>There’s no presence of mamonos at my front.</p><br/><p>At my back…</p><br/><p>When I turn around, the mamonos that were approaching the curtain retreat towards the darkness at the other side of the pillars.</p><br/><p>That’s pretty sportsmanly of them.</p><br/><p>At any rate, it seems like I have arrived at some sort of resting area.</p><br/><p>A sigh unconsciously leaks out from my mouth.</p><br/><p>“If possible, let there be a teleport formation for the next floor…” (Makoto)</p><br/><p>I move to investigate the area.</p><br/><p>“You have passed the goal curtain, so it is obvious that there will be a teleport formation. You say some interesting things.”</p><br/><p>This is the first time I hear the voice of someone else in this floor.</p><br/><p>What came flying gently out of the shadow of the pillar was a small floating…</p><br/><p>“…Could it be…you are a Marikosan?” (Makoto)</p><br/><p>“Eh? Am I popular?!”</p><br/><p>Incredible.</p><br/><p>What an exaggeration.</p><br/><p>What’s with this criter?</p><br/><p>First of all, as expected of a fairy race, her body is small.</p><br/><p>Just like the information.</p><br/><p>Hm? Even so, she doesn’t look so small. </p><br/><p>For example, if you were to place her on your shoulder, it would be pretty strainful depending on her weight.</p><br/><p>“I feel like…I am being directed quite the rude gaze.”</p><br/><p>Looking at her total size, she would be the size of a medium-sized owl.</p><br/><p>If she were standing, she would be at a baby size.</p><br/><p>Her face is cute. Rather than calling it beautiful, it is cute.</p><br/><p>Her overall attire is not fit for the place, but it looks good on her.</p><br/><p>She doesn’t have anything resembling a weapon, but the medal furnished hunting cap looks like a trademark of hers and fits her equally well like her clothes.</p><br/><p>For some reason, there’s the letter M engraved on it that’s probably from the first letter of Marikosan.</p><br/><p>…</p><br/><p>No, let’s stop averting my eyes.</p><br/><p>This is probably…no, this is definitely an existence that the Wise are extremely involved in.</p><br/><p>She is the very picture of the popular brother plumbers. </p><br/><p>Aside from her gender, everything else is a cosplay. Yes, let’s be honest, this is a cosplay.</p><br/><p>Are Marikosans that kind of existence?</p><br/><p>She also has the bob cut hair that I haven’t seen much in this world aside from Mio.</p><br/><p>“Well, that’s fine. You have shown me something nice after all. A good while ago, there was someone that finally managed to clear this place, but not only is that person not here anymore, they probably aren’t adventurers anymore. That person’s eyes were not normal, you know. A rude person that left even though I showed myself.”</p><br/><p>I am the second.</p><br/><p>And the first person was quite exhausted.</p><br/><p>Well, that’s a matter of course. Being suddenly thrown into a floor like this, anyone would be.</p><br/><p>I wasn’t really cornered, but I can understand how that person felt.</p><br/><p>Wait…one person?</p><br/><p>Is there such a brave soul that would dive into the dungeon alone?</p><br/><p>Is what I thought without really answering to the words of the Marikosan, and as I was pondering her words, she lightly flies around me as if observing me.</p><br/><p>“The one at that time was used to the labyrinth, and also knew the way to clear the Path floor, so I thought that person would have the chance to clear it. And in truth, it was quite the unsightly and boor way to do it, but that person was able to come all the way here. On the way, that person would abandon companions as the occasion calls and used them as bait, so only that person remained in the end. For a fiend like that, it was quite the deplorable result.”</p><br/><p>…</p><br/><p>So that person came with a party huh.</p><br/><p>The only survivor then.</p><br/><p>…</p><br/><p>If this place can be done with a party…why am I alone?</p><br/><p>“In that point, you are incredible in a lot of ways. Path is a floor which the mamonos’ strength and numbers are directly proportionate to the time passed. That’s why, it is of highest priority to obtain a map and concentrate on arriving at the next floor as fast as possible.”</p><br/><p>“…”</p><br/><p>I did hear a bit about the floor, but I only saw Path as a battle centered floor.</p><br/><p>But did they also mention something like that?</p><br/><p>I feel like they did a different explanation though.</p><br/><p>“And yet, you began to leisurely investigate at the entrance, and after taking your time loitering around, you made a ‘walking’ start. I thought you were a funny challenger. On top of that, you were alone.”</p><br/><p>That was a bad move huh.</p><br/><p>Yeah, if it’s a floor where time is of essence, I can understand that making a running start is the correct choice.</p><br/><p>But leaving aside the strength, the encounter rate was at quite the nasty level.</p><br/><p>Calling that directly proportionate is a bit hard to swallow.</p><br/><p>I was only standing around for 20 minutes.</p><br/><p>“Moreover, this is the Alt floor, you know? All the mamonos are enraged and their strength…well, even if there’s a lock in their strength so they don’t surpass the 10th floor power… The increase was even changed into being inversely proportional. Ah of course, the numbers as well.”</p><br/><p>…</p><br/><p>Not only were they throwing people to their death, they were totally intending to kill everyone.</p><br/><p>Even I can clearly understand the difference between directly proportionate and inversely proportionate.</p><br/><p>It is clear that inversely proportionate is no good.</p><br/><p>Taking 20 minutes, I did something crazy.</p><br/><p>And it really was Alternative huh. An alternate floor.</p><br/><p>Understood.</p><br/><p>“Wouldn’t that normally kill the person?” (Makoto)</p><br/><p>If you are thrown here by yourself, it wouldn’t simply end with death.</p><br/><p>So as usual, this time my luck was the worst as well huh… Ah.</p><br/><p>Party.</p><br/><p>It is that huh.</p><br/><p>I am not in a party with anyone.</p><br/><p>About Tomoe and Mio, I didn’t enquire about where Tomoe trained, but it seems like she was able to increase her level and is now close enough to Mio’s level, so they are able to form a party.</p><br/><p>Beren and Shii as well.</p><br/><p>But in that case, Hokuto would be a hanging element in our group as well.</p><br/><p>It is true that I wasn’t in a party, but I feel like there’s no reason for me to be experiencing something like this.</p><br/><p>“…Of course. It was made with a relatively high difficulty after all.”</p><br/><p>The Marikosan was showing a wide smile.</p><br/><p>It is a pure smile that instead of condemning herself, it felt as if she was saying: ‘go ahead and praise me’ as she puffs her chest.</p><br/><p>“Let me tell you this since I am one of the few ones who have cleared this. Isn’t this kind of crazy difficulty a bit too much for being such an early floor?” (Makoto)</p><br/><p>“The concept is that the difficulty is similar to that of the 10th floor and below after all. In the first place, even if you tell me this after clearing it unscathed, it doesn’t sound convincing.”</p><br/><p>10th floor and below, she says.</p><br/><p>I was at a loss of words.</p><br/><p>“To begin with! You can’t enter the Alt floor unless you clear the previous floor with an excelling grade. In your case…at the Drake Garden…the Earth Dragons and Flying Dragons…you killed over a hundred of both? Eh? Is this number for real? Do you some special grudge towards dragons?”</p><br/><p>…So that’s the cause.</p><br/><p>It is true that most of the second floor was handled by me.</p><br/><p>All that came into my sight, I shot them down.</p><br/><p>Because I hunted way too many on my own, I ended up being invited here alone huh.</p><br/><p>Hah…</p><br/><p>“What an outrageous person. But personally speaking, I like those kind of people. If the current master of this place were the same kind of outrageous as you, I would be able to work a bit harder though… The world doesn’t always go favorably.”</p><br/><p>The Marikosan tilts her head with a charming gesture.</p><br/><p>Until now, I have somehow been able to ignore it but, at her face, there’s a toothbrush moustache.</p><br/><p>‘There’s something on your face’, that’s how out of place that moustache felt.</p><br/><p>Hitler fairy</p><br/><p>…It feels as if you can really take it off.</p><br/><p>It is evident that trying to have a connection with her would be the worst.</p><br/><p>Let’s try to be careful here, yeah.</p><br/><p>It doesn’t really bother me much that she is floating even though she doesn’t have wings, but a fairy with a cute face and beard, I feel like that’s an incredible trait.</p><br/><p>The impact of having her face to face is unbelievable.</p><br/><p>“Master. Are you referring to Doma?” (Makoto)</p><br/><p>Master.</p><br/><p>A word that bothers me.</p><br/><p>And I know of an existence that this word can apply to.</p><br/><p>I did hear that he is quite the peculiar dragon though.</p><br/><p>“Doma…wait, isn’t that the dragon that was defeated not that long ago? That was someone who poured power to this labyrinth, but he isn’t the master of this labyrinth. You are an interesting adventurer, so I will tell you. Right now, he is normally together with the mercenary group that’s at the deeeep parts of the labyrinth, but the one that manages this labyrinth since a long time ago has recently returned.”</p><br/><p>“Manager? Returned?” (Makoto)</p><br/><p>“Yup, that’s the master here. That’s why the labyrinth has grown active again and the Alt floors have revived. We Marikosans are now pretty numerous, you know. Unless you are at an Alt floor or a pretty deep floor, you won’t get much chances of meeting them though.”</p><br/><p>Why, why?</p><br/><p>Why didn’t you return AFTER we left, administrator?</p><br/><p>Being thrown into this kind of places just because we are going fast, leaving it to brute force, and doing a bit of search and destroy; seriously, what a pain.</p><br/><p>I was planning on just taking a peek today and return, you know!</p><br/><p>“Uhm, if possible, can you tell me a bit more about that?” (Makoto)</p><br/><p>But since I have encountered a source of information, I have to hold it on returning and ask her a lot of things.</p><br/><p>“Hm…next time we meet, adventurer-san. I have spoken a bit too much after all.”</p><br/><p>“Ah, my name is—” (Makoto)</p><br/><p>I notice that I haven’t introduced myself.</p><br/><p>And I don’t know her name either.</p><br/><p>Marikosan is the name of the race and not the name of the individual.</p><br/><p>“Let’s leave the introductions for next time too. Well, I say that, but I actually don’t have a name as an individual, and I haven’t thought about wanting one. The only ones that would want something like that would be the ‘rogue’ ones. Once we meet again, please tell me your name! See ya, mysterious adventurer-san! It was fun!”</p><br/><p>Cutting off my words, she one-sidedly talks a storm and disappears, leaving only a faint phosphorescence behind.</p><br/><p>I can see a teleport formation deeper inside.</p><br/><p>Silence takes over the place.</p><br/><p>No well, I actually think the Marikosan was several times more of a mysterious existence than me though.</p><br/><p>She looks like a mascot, and yet, her bearing is like that of a merchant.</p><br/><p>But it is certainly true that…she has powerful traits that can make them be considered the specialty of this labyrinth.</p><br/><p>I stood on the teleport formation while praying that I wouldn’t be send to another Alt floor.</p><br/><p>Fortunately, it ended in an unnecessary worry.</p><br/><p>I was safely able to reunite with the 5 that were waiting close to the entrance of the next floor.</p><br/>\n</div>"}