{"title": "Chapter 265: The despicable acts of the sleepless city", "id": 265, "volume": 3, "url": "http://boxnovel.org/tsuki-ga-michibiku-isekai-douchuu-chapter-265-the-despicable-acts-of-the-sleepless-city", "volume_title": "Volume 3", "body": "<h1>Chapter 265: The despicable acts of the sleepless city</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 265: The despicable acts of the sleepless city</p><br/><p>“Oops, we ended up talking quite a lot. Well then, let’s continue the conversation when you arrive at the lower floor. But well, that’s only if it still ends up that way even after trying to do our best to kill each other. Hahaha, anyways, I will be waiting in anticipation.” (Rokuya)</p><br/><p>Rokuya-san said this and leaves.</p><br/><p>It is true that we talked about a variety of things.</p><br/><p>But how to say it…the important parts were made vague.</p><br/><p>That’s the impression I got from his story.</p><br/><p>I sweep away this feeling of mine.</p><br/><p>He probably hinted to it when he said that we would be continuing at a later time.</p><br/><p>Right now, there’s one thing I can say for sure, my impression of Root worsened quite a lot.</p><br/><p>…By the way, it wasn’t good to begin with.</p><br/><p>“I am sorry, Waka. Just like before, I couldn’t read his memories.” (Tomoe)</p><br/><p>Tomoe reports to me mortified.</p><br/><p>It seems like it somewhat succeeded with Tomoki, but as I thought, it doesn’t work on everyone.</p><br/><p>There’s people with high resistance towards it, and there’s a variety of spells that serve as countermeasure against this.</p><br/><p>Senpai and Tomoki should be getting stronger by the day.</p><br/><p>In that case, in the future, the memory vaccuum probably won’t work that much on the Japanese people.</p><br/><p>In a sense, the only way for her to get information of Japan will be from my memories, and that will most likely depress her.</p><br/><p>…I see.</p><br/><p>We can’t confirm how much of what Rokuya-san said was true huh.</p><br/><p>It brings me down a bit.</p><br/><p>But everyone has surplus in their stamina, so let’s continue a bit further for today.</p><br/><p>We don’t know how accurate the map will be in the floors that follow, and we also don’t know how much we can progress.</p><br/><p>No matter how my mental state is in, we should continue on.</p><br/><p>Since we will be mapping on the way, our speed won’t be the same.</p><br/><p>“It is fine, don’t worry about it. But this is a problem. Telling us to do our best in killing Japanese people that have become immortals. This is a situation I wouldn’t have been able to imagine at all before coming to Lorel.” (Makoto)</p><br/><p>“At worst, we would have to go against five people with strength on the level of Waka. This certainly wasn’t in our plans. Depending on the situation, we might have to make you guys return to the 19th floor.” (Tomoe)</p><br/><p>The first half was directed at me, the latter half was directed at Beren and the others as she lets out a slightly heavy sigh.</p><br/><p>“Rather than on my level, they might even surpass me. Right…it is true that having Beren and the others fight together with us would be a bit…” (Makoto)</p><br/><p>“I have been prepared since long. The Adventurers of Origin are certainly higher than us, but who knows how strong the mercenary group and the dungeon administrator will be. We are three here. We will definitely serve for something. Please let us stay this way.” (Beren)</p><br/><p>Beren does one step forward and interrupts my words.</p><br/><p>Right.</p><br/><p>There’s other people aside from Rokuya-san’s group, like the dungeon administrator -or wait, was it dungeon designer?- on top of that, there’s a big number of Marikosans.</p><br/><p>From what I saw, these three are plenty enough to fight against the Marikosan.</p><br/><p>For example; even if we look at Beren alone, he is a skilled craftsman even within the Elder Dwarfs. There’s a lot of combatants that are attached to their equipment. The trust he has between his comrades is also deep, and he has a good relationship with the other races as well. He is also beginning to become an irreplaceable existence in the company.</p><br/><p>Shii as well, if we were to exclude the problematic part about her admiring Eris, she is a dependable Forest Oni. Her fighting skills, forestry skills, and her agricultural skills regarding bananas are high. She is one of the few power fighting styles within the Forest Onis which is important too.</p><br/><p>Regarding Hokuto, he was a powerful Arke to begin with, and at present, the things he can’t do are less than the things he can. He himself has a hand-to-hand combat style that utilizes strings and is researching in order to reach higher heights in it, but in the process, he has created several byproducts. All the Arkes are immersed in the field they themselves have decided on, and the work they are given are reliably done. No need to say, he is an important man of talent.</p><br/><p>I don’t want to lose them.</p><br/><p>…Now that I think about it, I suddenly remembered something that Shiki told me quite a long time ago.</p><br/><p>It was when we fought together at the Limia capital.</p><br/><p>‘If you are about to be too entranced in a fight, please have the people of Asora in a corner of your mind’, is what I think he said.</p><br/><p>This will certainly be a tough fight incomparable to the one at that time.</p><br/><p>I think I am able to control myself quite better now, but who knows what will happen.</p><br/><p>Daikokuten-sama also told me something unreasonable. ‘Don’t incline too much on your emotions and logic’.</p><br/><p>But I wonder what he actually meant. Maybe he meant that as long as I live a normal life, it will not incline to any of those, so don’t worry. Or it might be that if I am not careful, without noticing, I will end up inclining in either of those, so watch out.</p><br/><p>As expected of a God, the things he says are complicated.</p><br/><p>“Calm down. The right person in the right place, that’s all there is to it. Tomoe-san as well, what worthless things are you saying. Even if we bring Hokuto and the others, they won’t get in our way, and just like they said, they will do their best. If that’s the case, they will definitely show one or two results that will bring a ‘well done’ from Waka-sama-desu wa. Right?” (Mio)</p><br/><p>I won’t let them die.</p><br/><p>“It is as if you are telling them to become meat shields if it comes to the worst, Mio.” (Tomoe)</p><br/><p>“Don’t jest. I am simply saying that they should show Waka-sama how the weak ones can also fight in their own way-desu wa.” (Mio)</p><br/><p>“Honestly speaking, just thinking about being attacked by a presence concealment on the level of that Rokuya in a group battle, I know that even I can’t let my guard down.” (Tomoe)</p><br/><p>“Fufufu, like we would let him.” (Mio)</p><br/><p>Oh, Mio, did you think up something?</p><br/><p>“Hoh? Are you saying you have some sort of plan?” (Tomoe)</p><br/><p>“No.” (Mio)</p><br/><p>So you don’t…</p><br/><p>“What, so you are planless. That confidence without basis of yours, is it that? Is your instinct telling you that?” (Tomoe)</p><br/><p>“I haven’t thought of anything special, but there’s no way Waka-sama will let his companions die in the same battlefield he stands in. He definitely won’t forgive that.” (Mio)</p><br/><p>…Yeah.</p><br/><p>“…”</p><br/><p>For some reason, Mio was filled with confidence.</p><br/><p>On the other hand, Tomoe didn’t say anything and was at a loss for words.</p><br/><p>Right after hearing what Mio said, Beren and the others straightened their backs and their faces turned meek.</p><br/><p>Wait, I am the one who will be doing it?</p><br/><p>Well, she is right though.</p><br/><p>I did decide already that I won’t be letting them die.</p><br/><p>I am a bit embarrassed knowing that she saw through me though.</p><br/><p>…Yeah, it is just as Mio said.</p><br/><p>Beren, Hokuto, Shii, and Tomoe and Mio as well; I…wouldn’t want the people that are fighting for my sake dying in a battlefield where I am in.</p><br/><p>Even if the fight below is unavoidable, this will not change.</p><br/><p>My objective was not ‘making the immortal Japanese yield’.</p><br/><p>It was something a lot different.</p><br/><p>Bring back the mercenaries to Tsige without losing anyone.</p><br/><p>Yeah, the fight below will have that objective.</p><br/><p>Things like our opponents being immortals, japanese, the owner of the dungeon, or designer, or administrator; well, whatever it is, that’s not a big problem.</p><br/><p>I am even thinking about fighting against the Goddess -a God-, so why am I getting worried here.</p><br/><p>If we win this fight, we will get one step closer to checkmate.</p><br/><p>“Fufu, ahahahaha!! Right, it is just as Mio said. Let’s all go. I won’t let anyone die. Now then, first we gotta get there or we won’t advance at all! Mapping, exploration; honestly speaking, I am bad at both of those, so I am counting on you guys!” (Makoto)</p><br/><p>Curse of immortality, long experience, and companions that most likely trust each other.</p><br/><p>I was subconsciously held down by the things that Rokuya-san was shouldering.</p><br/><p>But then, what about me?</p><br/><p>I have Asora, Tomoe, Mio, Shiki…and there’s Tamaki too.</p><br/><p>Also, even in the long experience of Rokuya-san’s group, I don’t think they have experience in challenging the Goddess.</p><br/><p>And haven’t been overpowered.</p><br/><p>Just like always, if they point their swords at us, we just have to sweep it all away.</p><br/><p>“My my, you are making me jealous here. It seems like I will have to let all these out in our afternoon exploration. Let’s depart. You guys, put some spirit into it… but well, looks like I don’t even need to say it-ja na. From now on, the amount of labour division will increase. You understand, right?!” (Tomoe)</p><br/><p>“Yes!!”</p><br/><p>A response with good strength.</p><br/><p>They have faces that ooze motivation.</p><br/><p>Looks like there’s no need to motivate them again.</p><br/><p>First, let’s gather information regarding the three teleport formations that lead to the 11th floor and then discuss about it.</p><br/><p>In the end, Rokuya-san didn’t tell me a single thing about a method to advance in the lower floors after all.</p><br/><p>Please, let there be no confined and damp place.</p><br/><p>Thinking about something shameful that differs a lot in temperature compared to the determination just now, we resumed our exploration.</p><br/><p>◇◆◇◆◇◆◇◆</p><br/><p>In the end, we continued our exploration till before evening and arrived at the entrance of the 14th floor.</p><br/><p>We divided the labor and explored the different types of the floor, the strength of the mamonos, its size, the traps that are set up, and after gathering the information, Hokuto, Tomoe, and Mio analyzed it and decided on the course to take.</p><br/><p>We advanced in that way, so we didn’t go as far as we expected.</p><br/><p>At this rate, if we count any irregulars that might happen, the X day will probably be the day after tomorrow, or the day after that one.</p><br/><p>The motivation of everyone was pretty high, and the divided labour was finished without delay.</p><br/><p>Everyone, thanks.</p><br/><p>“Even so, this city is mostly sleepless. Tsige and Rotsgard were the same as well.” (Makoto)</p><br/><p>In this world, it is truly rare to see a town where the hustle and bustle doesn’t die out late at night and there’s no lack of lights on.</p><br/><p>The nights are dark, inconvenient, and dangerous.</p><br/><p>That’s why, a while after dinner time passing, the towns enter silence waiting for the next day to come and is enveloped in darkness.</p><br/><p>That’s the usual.</p><br/><p>Tsige is at a wasteland, Rotsgard has an academy, and here, a grand labyrinth.</p><br/><p>When there’s something special about the place, it ends up in an uncommon place like this?</p><br/><p>But well, in Rotsgard’s case, the one that didn’t have its lights off was the Academy, so if I were to choose, I would say that the liveliness here resembles that of Tsige.</p><br/><p>Right now it is…around 2:00 a.m.</p><br/><p>It is late in the night.</p><br/><p>And yet, the doors of the store are open and receiving customers.</p><br/><p>I could hear the noise of people in good mood at the inside.</p><br/><p>Now that I think about it, the World’s Border and the Grand Labyrinth are always there, so it is probably natural that it turns out this way.</p><br/><p>By the way, the reason why I am walking alone at this time is…not that big of a reason.</p><br/><p>I opened my eyes not that long ago and noticed that there were several people missing in the room.</p><br/><p>And well, after searching with Sakai, I learned that a number of them were at the grand labyrinth.</p><br/><p>I was wondering what was going on, so I decided to go and see.</p><br/><p>…It is not like I was agitated because the moment I opened my eyes, the sleeping face of Mio was right in front of me, or that the leg of Tomoe was on top of my thighs.</p><br/><p>Definitely not.</p><br/><p>Now then, the ones who were gone from the room were Beren, Hokuto and Shii, and there’s also the bodyguards Akashi-san and Yuduki-san.</p><br/><p>But Akashi-san and Yuduki-san were investigating in the city, so maybe they simply haven’t returned yet.</p><br/><p>That’s why, the ones currently at the room are Tomoe, Mio, Iroha-chan, Shougetsu-san, and the maids.</p><br/><p>We will be exploring tomorrow, so what are Beren and the others doing this late in the night.</p><br/><p>We have already paid for the entrance fee of today, so there’s no proble—hm?</p><br/><p>Now that I think about it, how are the days set in this place?</p><br/><p>Is midnight the mark for the next day?</p><br/><p>At sunrise?</p><br/><p>What a problem. I currently don’t money at ha—ah, it is fine.</p><br/><p>I do have a decent amount.</p><br/><p>Even if they ask me to pay, there’s no problem.</p><br/><p>We will be entering tomorrow anyways, so this will be a simple pay in advance.</p><br/><p>Well then, let’s chase after the three that disappeared inside.</p><br/><p>Oh?</p><br/><p>Are those…Akashi-san and Yuduki-san?</p><br/><p>At a slightly further road that’s connected to the grand labyrinth, I coincidentally saw those two.</p><br/><p>If I remember correctly, that direction is the area where the rich live in, Blue Jewel Zone.</p><br/><p>I guess the place by comparing with the map of Kannaoi in my mind.</p><br/><p>Those girls are the bodyguards of Iroha-chan to begin with, and Iroha-chan herself is the daughter of a family in the ruling strata of this city, so going to a place like that shouldn’t be strange.</p><br/><p>The Osakabe household is like the feudal lord of this whole city after all.</p><br/><p>I look at the grand labyrinth.</p><br/><p>It is certainly true that I am bothered by Beren and the others.</p><br/><p>…But I don’t feel that uneasy about it.</p><br/><p>I look at the bodyguards.</p><br/><p>They are giving off an atmosphere differing from usual. The two move towards a place that doesn’t have much people.</p><br/><p>…I am uneasy.</p><br/><p>Can’t be helped.</p><br/><p>Let’s grasp the movements of those two.</p><br/><p>My first time walking this path in a city I don’t know. Moreover, it is late at night.</p><br/><p>If I didn’t have Sakai and wasn’t confident about my skills, I definitely wouldn’t have thought about following them.</p><br/><p>Looks like Akashi-san is guiding Yuduki-san somewhere.</p><br/><p>I observe the state of the two and try to grasp the situation.</p><br/><p>This is something that I should be reporting immediately to Shougetsu-san, but…my relationship with Akashi-san and Yuduki-san is not that deep, and there’s a lot of things I don’t know about them.</p><br/><p>Because of my face and appearance, I was caught in what seemed to be people trying to rob me, but I politely had them rest.</p><br/><p>“A bar huh. It is an establishment that reeks of suspicious.” (Makoto)</p><br/><p>I mutter this in front of the door where the two entered.</p><br/><p>It seems like it is still open, but the door is not open.</p><br/><p>This place doesn’t give me the atmosphere the sign is telling me.</p><br/><p>“Hm?”</p><br/><p>The scent inside the bar reached my nose.</p><br/><p>A deep and strong fragrance that reeks of a night store.</p><br/><p>But this is…not only that!</p><br/><p>“It really doesn’t make me happy that my instincts hit the mark in this kind of things, seriously!” (Makoto)</p><br/><p>Being certain that my uneasiness wouldn’t end with unnecessary worry, I resolve myself and opened the door.</p><br/>\n</div>"}