{"title": "Chapter 288: Wish of Futsu", "id": 288, "volume": 3, "url": "http://boxnovel.org/tsuki-ga-michibiku-isekai-douchuu-chapter-288-wish-of-futsu", "volume_title": "Volume 3", "body": "<h1>Chapter 288: Wish of Futsu</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 288: Wish of Futsu</p><br/><p>‘Well then, over here please’, the moment those words reverberated in his head as always, the landscape around changed completely.</p><br/><p>The faint red world disappeared, and a forest overflowing in natural beauty appeared.</p><br/><p>The shadow of animals could be seen in the corners here and there.</p><br/><p>At the place where a tree that was thicker than the rest was located and the sunlight was shining, Aznoval finds a stump and immediately takes action. In other words, he walked to it and sat on it.</p><br/><p>His moves felt practiced as if this wasn’t his first time.</p><br/><p>And then, he looks at his right, and as if this served as a signal, the contour of a pale blue woman comes out from the shrubs.</p><br/><p>That figure didn’t have any specific individual traits, it simply had the figure of an adult woman.</p><br/><p>At her hands, she holds 2 mug cups.</p><br/><p>There’s no other people here.</p><br/><p>There was no Makoto or Tomoe.</p><br/><p>“Looks like you were beaten up pretty badly, Azu.”</p><br/><p>“Futsu… Even though it has been so long since the last time we met, why are you appearing in such a half-assed appearance?” (Aznoval)</p><br/><p>“There’s no point in putting on airs using my figure with you guys anyways. I have already used up all my surprises.” (Futsu)</p><br/><p>“What a regret. Truly a regret.” (Aznoval)</p><br/><p>“Even if it is something important, I refuse. And so, are you going to answer me? That person, did you finally piss it off?” (Futsu)</p><br/><p>She gives one of the mugs to Azu, and while at it, points at his shoulder.</p><br/><p>“This is the result of an unlucky encounter. The misunderstanding has been resolved.” (Aznoval)</p><br/><p>“‘The misunderstanding has been resolved’? It is been awhile since I have heard that classic phrase of yours. Should I interpret it as your muscles pushing through? Why did you even end up fighting against an apostle of the Goddess?” (Futsu)</p><br/><p>“…It was to protect the lineage of my little brother. Well, it was one the few connections I have. Have to treasure it.” (Aznoval)</p><br/><p>“I see. Sorry.” (Futsu)</p><br/><p>“Being one of the few friends that know my favorite dishes, there’s no need for you to apologize.” (Aznoval)</p><br/><p>Inside the mug, there’s a completely white liquid.</p><br/><p>It is letting off warm steam.</p><br/><p>It is hot milk.</p><br/><p>“…It is just milk. But well, it is true that providing a feast for a person that can actually eat is pretty hard in this place though.” (Futsu)</p><br/><p>“There was no need to prepare my share, you know. It is the same anyways.” (Aznoval)</p><br/><p>“I have to provide the best warm reception for the person that will be bringing the guests I have been waiting for after all. The matter of the shoulder is fine already. Other injuries are…from him?” (Futsu)</p><br/><p>“…Yeah.” (Aznoval)</p><br/><p>“Fuh~, I was prepared for this, but seriously, he truly is a fearsome outstanding one.” (Futsu)</p><br/><p>The mug of Futsu was filled with a blackish brown liquid that looked muddy.</p><br/><p>Without hesitating, Futsu drinks from it and sighs once.</p><br/><p>“I completely agree with you. Truly fearsome. If I hadn’t surrendered at that moment, I wouldn’t have been able to come here for sure.” (Aznoval)</p><br/><p>“Even in your state where you had learned the name of the Princess?” (Futsu)</p><br/><p>“…So you really did know. No, I won’t ask you about about how you know about me knowing the name of Princess, okay?! No way I will!” (Aznoval)</p><br/><p>Maybe Aznoval remembered something of his past, he screamed as if in a spasm.</p><br/><p>“Yeah yeah, I said something unnecessary there. And so, about the future you might have ended up in…” (Futsu)</p><br/><p>“First of all, Makoto-kun stopped in the middle of evading the Iai I unleashed. It is the technique that was activated when I first heard of the name of Princess Seoritsu.” (Aznoval)</p><br/><p>Aznoval recalls the fight.</p><br/><p>The fight that he was doing just a while ago.</p><br/><p>It still remains vividly in his memories.</p><br/><p>“He purposely received an attack that he could avoid? A technique that you yourself had unleashed for the first time? Isn’t that just you misunderstanding?” (Futsu)</p><br/><p>“In my eyes, that’s how I saw it.” (Aznoval)</p><br/><p>“What was his aim?” (Futsu)</p><br/><p>“In order to bring me down.” (Aznoval)</p><br/><p>“…He should have known you are immortal, right?” (Futsu)</p><br/><p>“But I do get injured. If I receive a grave injury, there’s the need for time to recover. The worst the wound, the longer it immobilizes me.” (Aznoval)</p><br/><p>“…”</p><br/><p>“He stopped evading in the middle of it, and received my sword with his head. It cut the meat at his forehead and the blade slipped from his skull. But well, I don’t know at all how much of it was calculated. But for him, that must have been the ideal moment to go on the offensive.” (Aznoval)</p><br/><p>…</p><br/><p>“And then, before I can shift the katana and seal the battle with a reverse swing, Makoto-kun would create distance by shooting an incredibly powerful arrow that had several ring-like things added to it.” (Aznoval)</p><br/><p>“…Was that his trump card?” (Futsu)</p><br/><p>“Next, he would shoot four rapid-fires of the light arrows that incapacitated Rokuya at the *openings of my armor*, and in those few seconds restrained, the silver arms would be appearing at both of my sides.” (Aznoval) </p><br/><p>“Silver arms? What’s that?” (Futsu)</p><br/><p>“I don’t know at all. I have never seen them before or heard about them. It seemed to obey the Elder Dwarf, so maybe it is a treasure of them, or maybe it is something Makoto-kun had them make.” (Aznoval)</p><br/><p>“So he is controlling armor designed for giants with magic power?” (Futsu)</p><br/><p>“…Might be the case, but my intuition is telling me otherwise. Rather than calling it an equipment for giants, it was more like…the arms of a robot.” (Aznoval)</p><br/><p>“Robot. Aah, an evolved version of a Golem? The Japanese people called them Robots.” (Futsu)</p><br/><p>“Umu. But even so, I felt that even for something like that, it consumed an incredible amount of magic power. He didn’t look like the type who would wish for robots, and it didn’t looks as if he was utilizing equipment for giants. The one point I am certain of is that it possesses dreadful efficiency.” (Aznoval)</p><br/><p>“To the point that it would make you unable to act for a long period of time?” (Futsu)</p><br/><p>“…No doubt about it. And then, I would be captured in some sort of barrier-looking thing, my whole body would be steadily crushed by some superhuman strength, and in the end, me together with my sword Princess Seoritsu…would be wrung into meat paste.” (Aznoval)</p><br/><p>“…Uh, that’s quite the image.” (Futsu)</p><br/><p>“Of course, in that time, he continued looking at me with eyes as if he wouldn’t miss any sort of opposition or obstruction as he maintained his bow locked at me, and then…a bizarre conclusion was reached. Seeing that much into the future, I decided on surrendering. Because if I let him go that far, what would be waiting after would only be bad for everyone; the worst end to it all. Nothing good would be left.” (Aznoval)</p><br/><p>“Decisive judgement…maybe?” (Futsu)</p><br/><p>Was that honest praise, or was it sarcasm?</p><br/><p>Futsu looks at Aznoval’s face with a bitter and complicated expression.</p><br/><p>“I was about to be made unable to move for half a century.” (Aznoval)</p><br/><p>“Against a youngster that hasn’t even been here for a decade?” (Futsu)</p><br/><p>“…That’s the part that makes it the scariest. The three this time, counting the heroes, are all a group of excelling individuals. But within them, he is a special one. He is a person that I think fearsome from the bottom of my heart.” (Aznoval)</p><br/><p>“I agree that he is special. Even from my eyes, there’s no doubt about it. Yeah, to the point that even if we were to fill up the place with warning posters all around, it would never be enough.” (Futsu)</p><br/><p>“Well, that’s why I brought him here ‘while at it’. I wish that he will be able to obtain some sort of experience in this place.” (Aznoval)</p><br/><p>“Yeah, I am truly grateful. You have finally brought Makoto to my place. My request has been fulfilled without room for complaints.” (Futsu)</p><br/><p>“I am a superb adventurer after all –is what I want to say, but this time was completely a godsend. Also, don’t call it a request. I was simply fulfilling the favor of a friend. Ah, refill for the milk please.” (Aznoval)</p><br/><p>Feeling the warm sunlight, Aznoval spends a relaxing time.</p><br/><p>***</p><br/><p>‘Well then, over here’, with those words of invitation, the landscape changes in an instant.</p><br/><p>The faint red world disappeared, and what appeared was a hermitage.</p><br/><p>She sat on the veranda, and then, looks at the woods.</p><br/><p>There’s no one else here aside from her.</p><br/><p>“Well well, I thought I had returned to my home, but that wasn’t the case. In this place, what we see, what we touch is all what you wish it for huh.”</p><br/><p>Without making any special movements, Tomoe let out a clear sounding voice.</p><br/><p>“Well, it is more like, this is the appearance, aspirations, scenery, and the projection of the heart that you wish for though. Doesn’t look like Lorel. Could this be Japan?”</p><br/><p>This place looked like the hermitage Tomoe had made at Asora.</p><br/><p>And that hermitage was heavily influenced by a period drama that Tomoe really liked, where the main character had retired to and was living in.</p><br/><p>The only thing that was clearly different about it was that in the woods you can see from the veranda, there’s a conifer that has never been seen before.</p><br/><p>“So, woman, what business do you have with me-ja?” (Tomoe)</p><br/><p>Tomoe talks to the woman that had approached her with the appearance of a village girl from the Edo period.</p><br/><p>Being asked her business, the village girl stopped her feet for a moment, but continuing her silence, she sits at the side of Tomoe.</p><br/><p>Tomoe, who was sitting in the veranda, stands up.</p><br/><p>She didn’t place her hand on her katana. She simply sat back at the fireplace that was at the back.</p><br/><p>The village girl nods once and sits opposite of Tomoe.</p><br/><p>“Nice to meet you, I am Futsu. Aside from Root and Doma, the other Superior Dragons don’t even know of my name, a very old existence.” (Futsu)</p><br/><p>“You are a Superior Dragon, right? It was just recent that I heard that you and Root had an era where you were acclaimed existences in the long past.” (Tomoe)</p><br/><p>“Close. That woman -no, he is currently a man, right. Well, whichever is fine. In the old era, it ruled over the skies and harmony, and I ruled over the land and souls.” (Futsu)</p><br/><p>“But you incurred the wrath of Root, and as a result, you were killed or imprisoned, hence, you are now here. Was it a fight over a man? Whatever it is, what a loser-ja na.” (Tomoe)</p><br/><p>The tone of Tomoe was calm, but there was probably displeasure and hostility mixed in it.</p><br/><p>Because she had concluded that there’s a 9/10 probability that Futsu will prove to be a harmful existence for her master.</p><br/><p>That’s because even if there have been twist and turns and in the past they couldn’t let their guards down around him, Makoto and Root are temporarily in a cooperative relationship.</p><br/><p>It would be better to have a shallow relationship with Futsu, who is clearly antagonistic towards Root.</p><br/><p>“Yeah, it is just as you say. The biggest reason was because of a man. And so, now I am the manager of the world of the dead where I know only few.” (Futsu)</p><br/><p>“Moreover, after several centuries, even in Lorel, the name of Doma and Futsu are being mixed up. And it will most likely fuse with Doma who actually exists.” (Tomoe)</p><br/><p>“I am truly at a loss against the persistence of Root. But in this occasion, that’s of no importance.” (Futsu)</p><br/><p>“No importance, you say?” (Tomoe)</p><br/><p>“That’s right. My existence has already been accepted to a certain extent by Makoto –no, by Tomoe, so the next important thing is to have you lose your hostility and cautiousness towards me.” (Futsu)</p><br/><p>“Are you saying you want to be friends?” (Tomoe)</p><br/><p>“…I don’t hold a grudge towards Root. I was the reason why the relationship fell apart to begin with anyways. I am not in an antagonistic relationship with him, and I don’t have any intentions of involving Tomoe’s master into our problems. I promise this.” (Futsu)</p><br/><p>“…”</p><br/><p>“Actually, the main guest this time is you.” (Futsu)</p><br/><p>“…What did you say?” (Tomoe)</p><br/><p>“I have no discontent in being the manager of this world of the dead and the souls in it, but…there’s only one thing that I regret.” (Futsu)</p><br/><p>“The manager of the world of the dead’s regret. Doesn’t give any good vibes.” (Tomoe)</p><br/><p>Grudge of the dead.</p><br/><p>Associating it with that, Tomoe furrowed her eyebrows.</p><br/><p>“Fufufu, true. When put in words, even I think it wouldn’t be anything decent.” (Futsu)</p><br/><p>“Then…Umu, Futsu, that fight between you and Root for a man, what was it that caused your failure? If you tell me that part, I would be fine with hearing what you have to say.” (Tomoe)</p><br/><p>Maybe Tomoe thought of something, she showed interest in Root and Futsu’s relationship and an evil smile surfaced in her face.</p><br/><p>“Ara, that’s simple. I was unable to accept being the second wife. I wanted to be number one. And, I didn’t want other women aside from me.” (Futsu)</p><br/><p>“…I heard that the man that was the husband of Root made a grand inner palace and shut-in there drowning in carnal desire though.” (Tomoe)</p><br/><p>“That’s why I lost against Root who didn’t care about other women as long as she were given the chance to give birth to the child of a human.” (Futsu)</p><br/><p>“In a place where an idiot and a retard are, if a normal one tries to join in, the normal one will be repelled huh. Even when your wish was normal and humble.” (Tomoe) </p><br/><p>The face of Tomoe was showing clear amazement at it.</p><br/><p>“I wonder about that. It is difficult for normal women to get close to heroes. And in truth, he married Root and lived a happy life…and died. The people that were loved by him left numerous children and he was wrapped in love and died in happiness. He truly had a nice face in his final moments…to the point that all of my unsightly emotions towards Root melted.” (Futsu)</p><br/><p>“…Did you…meet him here?” (Tomoe)</p><br/><p>The eyes that were always directed at Tomoe had for the first time looked away, and Futsu looks at the garden, answering with silence.</p><br/><p>On the other hand, Tomoe was at a loss of words in a different meaning.</p><br/><p>Because the experience of Futsu was the one that Tomoe had been fearing the most since the time she met Makoto.</p><br/><p>“…Ara, I might have found an ingredient for a deal. But it might not be needed…hmm. For now, let’s leave it aside! Well then, can I finally talk about this regret I have?” (Futsu)</p><br/><p>Maybe Futsu was aiming to blow away the heavy mood that was going on, she continues the conversation with a pretty cheerful tone.</p><br/><p>“Umu, let’s hear it.” (Tomoe)</p><br/><p>“I want someone to succeed the things I govern over. There’s no need to be the manager here. There have been powers that have been unused treasures for a truly…truu~ly long time. Isn’t it a waste?” (Futsu)</p><br/><p>“What an outrageous thing to say. There’s no way a Superior Dragon can pass over the powers they govern over.” (Tomoe)</p><br/><p>“It is possible. Azuma, Doma, Ryuka, Grount, Lancer, and you are the proof of this. For Root and I, it is possible.” (Futsu)</p><br/><p>“In other words…you are saying our powers are things that Root had passed onto us? Are you saying that those were originally a part of his powers?” (Tomoe)</p><br/><p>Tomoe showed a truly displeased expression.</p><br/><p>She didn’t even show any signs of trying to hide it.</p><br/><p>“Don’t hate it that much. It already cannot be affected by Root, it is your own power now. Also…” (Futsu)</p><br/><p>“What more is there-ja?” (Tomoe)</p><br/><p>“Your master will in time -in a not so far future- be breaking into a domain that is the most dangerous within the Wise that have arrived to this parallel world.” (Futsu)</p><br/><p>“…The Goddess huh.” (Tomoe)</p><br/><p>“So it goes without saying. At that time, it wouldn’t be troubling to have as much power as possible, right?” (Futsu)</p><br/><p>The curtains of silence fall.</p><br/><p>Futsu waits for the answer of Tomoe.</p><br/><p>It was a silence as if everything that had to be said had already been spoken.</p><br/><p>Tomoe thinks; about Futsu’s aim, wish, and what she is plotting.</p><br/><p>The silence continued for long.</p><br/>\n</div>"}