{"title": "Chapter 280: The moment we have been waiting for", "id": 280, "volume": 3, "url": "http://boxnovel.org/tsuki-ga-michibiku-isekai-douchuu-chapter-280-the-moment-we-have-been-waiting-for", "volume_title": "Volume 3", "body": "<h1>Chapter 280: The moment we have been waiting for</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 280: The moment we have been waiting for</p><br/><p>Two women were breathing heavily.</p><br/><p>They are still alive.</p><br/><p>How impressive.</p><br/><p>Waka is in essence a hyuman but in terms of side, he is more of a human-ja.</p><br/><p>Watching Waka all the time by his side, I learned of the strength of this living beings called humans…or at least that’s what I thought.</p><br/><p>Tenacious body, massive magic power, unique tactics that stem from their special powers, and most of all…their will to never give up.</p><br/><p>It might also be attributed to the fact that these guys have lived for far more time than a normal human but, they don’t show signs of breaking.</p><br/><p>So this is a human huh.</p><br/><p>Even when their opponent possesses far more power than them, they never give up on winning and struggling.</p><br/><p>The moment I shed blood I wasn’t intending on shedding, I stopped holding back because it might make Waka worry.</p><br/><p>It goes without saying but, this is the enemy base; The moment Mio, Waka, and I entered this floor, they activated a large scale spell.</p><br/><p>We are in no way fighting with them in even grounds, and can’t say that we are showing our full strength.</p><br/><p>But, in the first place, a battlefield is not a place where you can wish for ideal conditions.</p><br/><p>Complaining about that would make you lower than a greenhorn-ja.</p><br/><p>Because this also counts as strength and luck.</p><br/><p>And so, I have seriously acknowledged them as enemies, and fought.</p><br/><p>Even so, I am still unable to finish them.</p><br/><p>“Illusion, illusion, illusion. Moreover, she overwhelms us in close combat as well. What’s with that?”</p><br/><p>“I’m totally with you. Just lowering your guard for a little bit will result in being swallowed by illusions and the match would be decided. She isn’t giving a single bit of leisure in our movements. What a terrible opponent.”</p><br/><p>Only seeing my advances as annoying, I am the one who wants to cry.</p><br/><p>In our first encounter, even Waka was engulfed by the illusion mist, on top of that, I learned illusion magic from Shiki.</p><br/><p>I also utilized normal elemental magic attacks.</p><br/><p>Of course, my body has learned swordsmanship too.</p><br/><p>I have thrown all of that against them, and yet, they resist it, cancel it, and create distance.</p><br/><p>These two continue to stand before me.</p><br/><p>That’s what’s been happening all this time.</p><br/><p>“To think that the priest there would be able to use a bow as well. You really got me good there.” (Tomoe)</p><br/><p>That’s right.</p><br/><p>I permitted even more opposition and got injured.</p><br/><p>I thought that the woman called Ginebia was someone specialized in only close combat and support. But the second my attention strayed from her, her partner Haku kicks her the bow she let go in an instant, and with a stance that looked exactly like that of Waka, Ginebia shot me.</p><br/><p>The power was also plenty enough.</p><br/><p>I don’t know if she aimed for it, but the arrow pierced the same place that her partner had shot me last time at.</p><br/><p>That first battering at the beginning, the joint lock that followed after; I have been caught in their unpredictable attacks all this time-ja.</p><br/><p>Well, everything has been healed, and -obviously- I have not been receiving them all without hitting back.</p><br/><p>I have been paying them back little by little.</p><br/><p>And so, the fruition of this is shown in the painful figure of those two.</p><br/><p>“If that’s the case, I would like you to show a little bit of a pained expression to visualize the damage.” </p><br/><p>“I see, it does sound reasonable. Next time, I will show you an illusion that fits your request.” (Tomoe)</p><br/><p>“…”</p><br/><p>The patterns in the opposition of these two, and the magic power expenditure that these requires.</p><br/><p>The former I have been observing it, and at times, when I receive damage, I had them pay by analyzing those attacks.</p><br/><p>I have mostly grasped them all-ja.</p><br/><p>Well, even if I say that, we are talking about these two here, so there might be some sort of trap set up somewhere. I can’t lower my guard.</p><br/><p>The latter one, the longer the fight goes on, the more magic power it is expended.</p><br/><p>It is at the point where the end is finally at sight.</p><br/><p>It was a pain to the extreme, but the magic power of these two is on the level of the heroes.</p><br/><p>Their ability to manage their magic power and the way they use it is unbelievably good-ja na.</p><br/><p>That’s why, for a temporary amount of time, I even misinterpreted that both of them had the same amount of magic power as Shiki or even more than that.</p><br/><p>“Sometimes, silence can be an easy to understand answer. Right, it’s like you’re telling me your falling point is close.” (Tomoe)</p><br/><p>“…Says the dragon. Also, if you are a superior dragon, go for the more rough and easy to understand attacks or it will be troublesome for us.” (Haku)</p><br/><p>As usual, the tone of Haku sounded as if she still had leeway.</p><br/><p>No matter how cornered she is, no matter how much damage she receives, the attitude of this girl doesn’t change.</p><br/><p>So humans can grow to have such tenacious strength of mind as well-ja na.</p><br/><p>“Fukuku, if I did that, I would have already fallen beneath your feet. You two would be able to hunt Superior Dragons with just the two of you, no joke.” (Tomoe)</p><br/><p>…If Waka wanted to, he would be able to do that while humming though.</p><br/><p>Seeing that these two are compensating for their lack in strength with technique and experience shows me that these two clearly have something that surpasses Waka.</p><br/><p>Specially their teamwork, it is already polished to the point that it can be called art.</p><br/><p>“Doma-kun told us that too.” (Ginebia)</p><br/><p>Ginebia showed her tiredness in her eyes, but she doesn’t lose her composure.</p><br/><p>Those two have been analyzing my illusions and observing them, and even at this time, they are still trying to come up with a plan to reverse the situation.</p><br/><p>Their healing and support is also fast and calm; their sense is top tier.</p><br/><p>If I show an opening, I will get a taste of her fists -no, I have to take into account her bow as well huh.</p><br/><p>On top of that, her attacks synergize and bring out the full potential of the straightforward and highly accurate attacks of Haku.</p><br/><p>They are truly strong.</p><br/><p>“Even if that NEET dragon tells us that, it doesn’t make us happy at all, but it also doesn’t make me happy hearing that from you. Even though this is a compliment that’s on the level of only being directed at heroes, and yet, I wonder why…” (Haku)</p><br/><p>“Sleep for a while. Everything will end with that.” (Tomoe)</p><br/><p>“…It is finally the time where we have no choice but to use all the strength we have left.” (Ginebia)</p><br/><p>“[Dancing Bow, Septen—?!” (Haku)</p><br/><p>“Septentrion, right?” (Tomoe)</p><br/><p>Aiming for a surprise attack, the hand of Haku shone and her whip shoots seven light arrows.</p><br/><p>Right now, I can’t use my ability of changing reality to illusion.</p><br/><p>But, if it’s the opposite…to bestow temporary reality to illusions, it is possible.</p><br/><p>What appears are seven arrows.</p><br/><p>The arrows that appeared from the illusion mist and had obtained substance followed the same trajectory as the seven arrows of Haku and offsetted each other.</p><br/><p>It is a skill that I have shot several times in my mind, moreover, it is a skill that I have seen in reality once already.</p><br/><p>Reproducing it is easy.</p><br/><p>“Skill copy?! What a copycat!” (Haku)</p><br/><p>“A high-power skill that destroys seven magic pressure points of the target. Even if if doesn’t manage to defeat the opponent with all attacks hitting, it would still seal their magic. It is incredibly handy-ja na. I can understand why you rely on it.” (Tomoe)</p><br/><p>“…I see, memories. So that’s how it is huh. We have an unbelievable opponent.” (Haku)</p><br/><p>Haku Mokuren.</p><br/><p>Her insight that’s mixed with instinct is also polished to an extreme.</p><br/><p>“It means that I have as much methods to throw off your teamwork-ja. And…methods to cut it off completely as well.” (Tomoe)</p><br/><p>“?!! Illusion?!” (Ginebia)</p><br/><p>I appear right in front of Ginebia.</p><br/><p>That’s right, just like she saw through in that one second, it is an illusion-ja.</p><br/><p>But, from that illusion, only the blade of the sword has substance.</p><br/><p>If it’s with this, no matter how excelling that person is, this should be enough. Well, even if they manage to deal with this, I won’t be surprised though.</p><br/><p>“Ah, this is cheating!” (Ginebia)</p><br/><p>She probably noticed the possibility that it has substance, she instantaneously prepares her arm and was intending on dealing with the katana.</p><br/><p>Splendid reaction speed-ja na.</p><br/><p>By the time she noticed the sword slipping through her arm without making contact with it, it was already too late.</p><br/><p>The katana made a big cut on her shoulder.</p><br/><p>“[Blessing of the Eccentric God, Almaty]!” (Ginebia)</p><br/><p>…And with almost no space in between, she healed herself.</p><br/><p>She did it in the instant she was cut-ja.</p><br/><p>Seriously, the fact that they don’t even show an opening for a second really doesn’t let me take this with leisure.</p><br/><p>In that second where Ginebia was concentrating to heal, I arrive right in between the two of them even faster than the time it took for the illusion just now to appear.</p><br/><p>These fast legs I have been concealing from them until now.</p><br/><p>I am truly glad I continued training diligently.</p><br/><p>Seriously thinking this in that instant, I place a finger on Haku and Ginebia’s nape.</p><br/><p>Now that I am directly touching them, have caught them off guard, and, on top of that, have shaved off this much magic power from them, it should be possible.</p><br/><p>“[Fifth Hamlet, Mist Gorim]” (Tomoe)</p><br/><p>It has degraded quite a bit, but it is still one of my special moves-ja.</p><br/><p>This is something that I had warmed up to use against an army, but these girls have a lot more backbone than your regular army.</p><br/><p>I don’t mind. They are fitting targets for it.</p><br/><p>Glancing at the two that slowly fell into deep sleep, I heaved a big sigh.</p><br/><p>They were with no doubt tough opponents.</p><br/><p>Even if I was holding back, even if I was swelling in anger, I can’t say it is a win.</p><br/><p>…Wise huh.</p><br/><p>I have learned a lot.</p><br/><p>◇◆◇◆◇◆◇◆</p><br/><p>“Rokuya-san has been restrained, Haku-san and Ginebia-san lost, Hitsuna-san fainted in the middle of buying time?! And the side we expected to win first and provide reinforcements for the others, Picnic Rosegarden, is in a stalemate… Are you serious?”</p><br/><p>This lineup that was practically assured victory is, for some reason, displaying a different result.</p><br/><p>It is to the point that it can be called despairing.</p><br/><p>In this place where many numbers are being continuously displayed in the various monitors, there’s one man covered in cold sweat as he analyzes it all. </p><br/><p>“If they had waited until Pione calmed down and waited until the messed situation aboveground was put in order, this fight wouldn’t have occurred to begin with!”</p><br/><p>It seems like he finally couldn’t hold it in anymore, it was overflowing from his mouth already as the man, Makado Takane, slams the desk.</p><br/><p>It was a stainless glass type of desk that’s rare to see in this world.</p><br/><p>This and the cheap-looking chair are the favorites of Takane.</p><br/><p>Thanks to this, his room created a strange atmosphere that felt like that of modern Japan.</p><br/><p>“In the first place, what is that person doing?! According to the information of the Marikosans, they should have already used the teleport formation a long time ago!” (Takane)</p><br/><p>“That’s something I want to know too. Really, for some reason, I couldn’t take the instant teleport formation.”</p><br/><p>“There’s no way that’s possible! I have unlocked it so that all the members can utilize it the safest and fastest as possible!” (Takane)</p><br/><p>“And I’m telling you I couldn’t use it. Thanks to that, I had to use my ability ‘White Crow’ to somehow fly all the way here.”</p><br/><p>“Now here—!! Eh?” (Takane)</p><br/><p>“Yo, Takane-kun, long time no see. I suddenly received an emergency call, so I hurried back. It looks like the state at Kannaoi is fishy, but for now, I prioritized on returning.”</p><br/><p>“A-Azu-san?!” (Takane)</p><br/><p>“Yeah. And so, are they guests? Moreover, it looks like it has turned into a fight.” (Aznoval)</p><br/><p>“T-That’s right! That’s why we called you. It looks like Rokuya-san and the others won’t be able to deal with it without you.” (Takane)</p><br/><p>“…Fumu. Looks like they are invading with quite the small amount of people. Moreover, they are opponents that can set up a giant magic barrier in this whole floor without having you notice huh.” (Aznoval)</p><br/><p>“That’s right, they are unbelievable opponents—eh? Barrier…magic?” (Takane)</p><br/><p>Takane got surprised by the man that was suddenly inside the room, and then, he once again got surprised by what the man said.</p><br/><p>“Umu. I couldn’t make a complete analysis of it, but it is placed in such a way that it won’t be noticed. The effects are: obstructing the trespassing to this floor, and probably some sort of illusion type of magic. But from what I see, I don’t know for what it is at all. I can’t read their intentions.” (Aznoval)</p><br/><p>“No way. To think they would be able to form a magic in this floor of Yaso-Magatsuhi, the Prison Palace, without me noticing!” (Takane)</p><br/><p>“That means they have quite the gathering of powerful ones. To the level that they have the chance of bringing down this place even when confronting us right from the front. I see why my strength is needed.” (Aznoval)</p><br/><p>The fully armored man goes ‘umu umu’ as he nods.</p><br/><p>He is calm.</p><br/><p>On the other hand, Takane was busily typing on the keyboard at hand.</p><br/><p>In front of him, there’s a device that resembles that of a PC.</p><br/><p>“Damn it, damn it!! Where is it, where is it, where is it?! Just what did they set up?!” (Takane)</p><br/><p>“Good grief. In that case, I should first regroup with Rokuya. An opponent that is trying to finish this fight without killing and under these conditions huh. I am scared of the sermon of Rokuya but…I wonder, what will be happening.” (Aznoval)</p><br/><p>A white crow that came from who-knows-where perched on the shoulder of the knight.</p><br/><p>Aznoval whispers: ‘what is it?’ with his head turned to it.</p><br/><p>Right after, his figure disappeared from the room.</p><br/><p>“Oh, these are the ‘Grim Tale Gears’ of Rokuya. But, for some reason, he is not here?”</p><br/><p>“How dare he do this to me…inflicting pain and shame in such a way…no, that’s not all there’s to it, he dared to do this to me, a follower of Waka-sama… that man, Rokuya……”</p><br/><p>What Aznoval saw right in his front as he finished his teleportation was a black haired girl restrained with a familiar power.</p><br/><p>She seemed to be slightly crazy in the head –no well, seemed to be acting strange.</p><br/><p>A japanese clothed beauty with long glossy hair wearing a kimono.</p><br/><p>“…That Rokuya, to think he would be thought of this much by a woman that can stay so composed while caught in this…” (Aznoval)</p><br/><p>The stiffened Aznoval lets out a strained laugh with a complicated expression.</p><br/><p>“You…”</p><br/><p>“Oh, what is it, young lady?” (Aznoval)</p><br/><p>“If you destroy these gears…I will kill you.” (Mio)</p><br/><p>Even without acting, the gaze of Mio itself felt like it was enough to kill a person, and this very gaze was being poured directly at the knight.</p><br/><p>“Yeah, I understood that from the very instant I saw it. You are unbelievably strong but…it seems you have complex circumstances.” (Aznoval)</p><br/><p>“…Yeah. That’s why, just leave me be. Honestly speaking, if I get released from this restraint in an undesirable manner…I don’t have the confidence that I will be able to hold myself back at all.” (Mio)</p><br/><p>“Then, I will not destroy it under a condition. It looks like you know the man called Rokuya but, where is he now?” (Aznoval)</p><br/><p>“He is running around somewhere……no, he was. Fufufufu. From all the people, he ended up encountering Waka-sama. That ultra duper idiot.” (Mio)</p><br/><p>“! Looks like I have to hurry.” (Aznoval)</p><br/><p>The figure of Aznoval disappears once again.</p><br/><p>“So that’s the trump card they were waiting for? He probably is. Because he entered from the outside after all.” (Mio)</p><br/><p>Mio, who had slightly regained her sanity, pondered this.</p><br/><p>“Then, he also noticed the spell that Waka-sama setup? Well, even if that’s the case, the trump card in our side is also about ready, so it doesn’t matter. Aaah…can’t these gears disappear quickly?” (Mio)</p><br/><p>But that last part she said once again changed the tone of her voice into darkness.</p><br/><p>“But I wonder how long Rokuya will be able to last against Waka-sama. If he can endure two hits, I will consider being a bit more gentle in the punishment. Let’s see, let’s spare him from the pocky at least.” (Mio)</p><br/><p>With an innocent tone, Mio predicts the scene that will be reaching its conclusion in time.</p><br/><p>“Since when did you change your job to mole, Makoto-kun?!”</p><br/><p>“Hey there. It’s a long story. I was literally send to ‘be in a wall’, you see.” (Makoto)</p><br/><p>“…No no no, there’s limits to things, you know.”</p><br/><p>The head of a person suddenly broke through the ground and appeared.</p><br/><p>OneHead</p><br/><p>Seeing the identity of it, Rokuya inadvertently shouted.</p><br/><p>Probably with the feelings of ‘why in the hell is he okay’.</p><br/><p>And then, the person in question said something absurd as he makes a wry smile.</p><br/><p>He smoothly comes out from the earth and makes a big stretch.</p><br/><p>giphy (1)</p><br/><p>“Leaving aside the many talks for later, the fact that you are moving around safely must mean that Mio is in a bad situation.” (Makoto)</p><br/><p>“…”</p><br/><p>“I will have you go down.” (Makoto)</p><br/><p>The ringleader and also intruder, Makoto, instantly changed the atmosphere around him and declared this.</p><br/><p>“Tch, we chose the proper opponent for you though!” (Rokuya)</p><br/><p>Is he going to fight, or flee?</p><br/><p>Measuring his own strength and the strength of Makoto, Rokuya instantly arrived to an answer.</p><br/><p>Flee.</p><br/><p>Especially because his compatibility against him is way too bad.</p><br/><p>In a situation where they are already facing each other, he has practically nothing he can do against Makoto.</p><br/><p>Even if he were to have a party to fight against him.</p><br/><p>In this current 1 vs 1 situation, the conclusion that Rokuya arrived at was 0% chance.</p><br/><p>In that case, even if it’s reckless, the best choice he has is to escape from him and head to the other battles to provide reinforcement.</p><br/><p>“[Sky Wal—” (Rokuya)</p><br/><p>With incredible initial velocity, Rokuya took distance and was about to use his forte, presence erasure -but at that instant…</p><br/><p>His face stiffened at the fierce numbness that was running from his stomach to all over his body.</p><br/><p>In the instant Rokuya took to create distance from him, Makoto already had bow in hand and even locked him on.</p><br/><p>The prayer of the assassin for his skill to activate was not heed.</p><br/><p>His abdomen had been pierced with an arrow.</p><br/><p>“…”</p><br/><p>“Damn…it…As expected, it was no use.” (Rokuya)</p><br/><p>“Just in case, I used a paralyzing arrow for capture. Please take a rest. This battle is already over after all.” (Makoto)</p><br/><p>“I wonder…about that. It seems…our trump card…appeared first.” (Rokuya)</p><br/><p>Rokuya, who was shot in mid-air, fell just like that and made a dull sound once he dropped.</p><br/><p>He twitched several times, but it seems his body can’t move as he wants.</p><br/><p>But after that, he must have caught the presence of someone, he made a small sigh, and then, showed opposition towards Makoto.</p><br/><p>Hearing that, Makoto also searched for the presence, and then, turns his eyes towards the one that appeared.</p><br/><p>“So the star arrives huh.” (Makoto)</p><br/><p>“”Well, you may say that, but it seems like I was slightly late. I am Aznoval, and you? Are you an acquaintance of that black haired beauty?” (Aznoval)</p><br/><p>“Yeah. I am the representative of the Kuzunoha Company, Raidou. It might be easier to understand for you guys if I were to introduce myself as Misumi Makoto though.” (Makoto)</p><br/><p>“Kuzunoha…Raidou… I see, so you are the one. Looks like fateful encounters do exist. This is just my personal feelings here but, if possible, I would have wanted to meet you in different circumstances.” (Aznoval)</p><br/><p>“I also don’t have any grudge against the Adventurers of Origin. Once the matters are solved, it will definitely go well. I still think that.” (Makoto)</p><br/><p>“Well, all that said, you are currently an enemy that hurt my comrades and attacked the members of this base. So…” (Aznoval)</p><br/><p>Aznoval points the strangely-shaped big sword with one hand at Makoto.</p><br/><p>“Can you please wait for a bit? With that, the battle will be over.” (Makoto)</p><br/><p>“I don’t know what you guys are scheming, but I wonder about that. If you guys who don’t wish to fight are still here putting your lives at stake, it must mean that both parties -or maybe only one side- has a decent reason for it. It is not like there will always be a way to wrap things up nicely, you know?” (Aznoval)</p><br/><p>With fighting spirit and pressure still directed at Makoto, his right arm continuously rose in power.</p><br/><p>“I learned of the core reason for this battle. That’s why, I created a counter-plan for it. Aznoval-san…” (Makoto)</p><br/><p>“And in that plan of yours…” (Aznoval)</p><br/><p>“…”</p><br/><p>“Was the reason for pointing my sword at you also accounted in it? Even if you resolve this ‘core reason’ you speak of, reasons to continue the battle will be born in the middle of the battle. And as proof of this, here I am, pointing my sword at you for hurting my family. Without knowing the basis of all this fighting.” (Aznoval)</p><br/><p>“…”</p><br/><p>“Once again, I introduce myself. I am the Beast Knight, the squire Aznoval. The public calls me by many names, but not properly introducing myself against an opponent I will be facing seriously would be rude after all. The Kuzunoha Company’s Raidou, as an intruder, I will—-” (Aznoval)</p><br/><p>“It is here. Finally broken.” (Makoto)</p><br/><p>The expression of Makoto suddenly changes to one of joy while he was hearing the knight introducing himself.</p><br/><p>“Hm?”</p><br/><p>“Aznoval-san, it is true that we injured your comrades. But! The ones who attacked us no-questions-asked when wished for a talk and negotiation were Picnic Rosegarden. Please hear the circumstances first. Our circumstances, and the circumstances of your comrades; both of them!” (Makoto)</p><br/><p>“…”</p><br/><p>“No one has died. We have not killed a single person in this battle. We can still make over. Isn’t that right?!” (Makoto)</p><br/><p>“Circumstances huh. I somewhat understand the circumstances of you guys but…it is true that I still don’t know the reason why our side is aiming to kill you guys from the Kuzunoha Company.” (Aznoval)</p><br/><p>“Yes.” (Makoto)</p><br/><p>“…Understood. It looks like this time buying of yours has already bore fruit anyways, so first, let’s hear what you have to say.” (Aznoval)</p><br/><p>Sheathing his sword back, Aznoval faces Makoto with a calm expression and nods.</p><br/><p>The short but fierce battle between the Kuzunoha Company and the guardians of the labyrinth was finally reaching its conclusion.</p><br/>\n</div>"}