{"title": "Chapter 295: Izumo’s resolve, Haruka’s resolve", "id": 295, "volume": 3, "url": "http://boxnovel.org/tsuki-ga-michibiku-isekai-douchuu-chapter-295-izumo%E2%80%99s-resolve-haruka%E2%80%99s-resolve", "volume_title": "Volume 3", "body": "<h1>Chapter 295: Izumo’s resolve, Haruka’s resolve</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 295: Izumo’s resolve, Haruka’s resolve</p><br/><p>“You can still stand up huh.” (Haruka)</p><br/><p>There was only one boy that is standing by relying on a staff and a katana. Looking at the figure of this boy, Haruka lets out a heavy sigh.</p><br/><p>The words that followed after held no ridicule and you can tell there’s confusion in it.</p><br/><p>Even now, the eyes of the boy still release strong will.</p><br/><p>That boy is Izumo Ikusabe.</p><br/><p>Jin and Daena were overwhelmed by the difference in technique, but they fought bravely. Without forgetting about their teamwork with the backlines, they resolutely faced an enemy they couldn’t defeat with their own ability.</p><br/><p>Amelia and Sif also didn’t make any mistakes. Or rather, they showed a miracle-like fight. Those girls who showed strength that far surpassed their actual ability should be commended for it.</p><br/><p>Misura, with a special ability and tenacious spirit to endure, exposed his body to the attacks of Haruka to the bitter end.</p><br/><p>And then, there’s Yuno. She learned a variety of things from Misura in the middle of the battle and became a tough shield for the backlines as well as coordinating with them to increase the firepower.</p><br/><p>The user of Ein-Khalif, or more like, the person that was participating in the fight with it as her proxy, Iroha, also lasted till her last attack.</p><br/><p>Being able to maintain a strong heart until then is also something that should be commended.</p><br/><p>The failure of the wave attack had severed her connection with it and she lost consciousness, but no one can blame her for that. The Ein-Khalif in her hands had returned to the appearance of a normal sword and already didn’t move a single bit.</p><br/><p>A secluded girl like her that hasn’t experienced a battlefield before managed to stay conscious for so long because of the existence of Izumo.</p><br/><p>Due to the violent attacks of Haruka that came often, the bodyguards of Iroha -Akashi and Yuduki- as well as Shougetsu had already fallen.</p><br/><p>This situation could be called many things.</p><br/><p>Wiped out.</p><br/><p>Crushing defeat.</p><br/><p>There was only one backline magician barely standing, but aside from that, there was no one else left.</p><br/><p>The others are still alive –but they are unconscious.</p><br/><p>Their life-or-death was already being grasped by Haruka.</p><br/><p>“That just a while ago was…the everything of you people but…are you telling me you still have more to show me?” (Haruka)</p><br/><p>‘That’.</p><br/><p>The ‘that’ Haruka was referring to was the attack that Jin and the others squeezed their all to do.</p><br/><p>The few seconds that the frontline gained with their bodies on the line, Amelia used them to cast enhancement magic on the combined element magic of Sif.</p><br/><p>Yuno utilized that power to release a big move ‘Red Salamander’.</p><br/><p>After shouting: ‘If we can’t bring you down from above, we will break you from below!’, the combined element magic that Sif released had changed the form of the armor of Yuno, Juuki, but this powerful combo technique was deflected by Haruka.</p><br/><p>Faced with the retaliation of Haruka, Juuki was completely destroyed and there wasn’t a single person who had the leeway to catch the falling Yuno. There was also no one who could go against the Haruka that summoned mamonos from the sky.</p><br/><p>And so, it leads to now.</p><br/><p>“That’s why you pushed to end us…like toys you have gotten bored of.” (Izumo)</p><br/><p>“‘Toys you got bored of’, that’s quite the self-deprecating way of speaking.” (Haruka)</p><br/><p>“…Don’t underestimate us.” (Izumo)</p><br/><p>“…”</p><br/><p>“Don’t underestimate us! What’s with this!! We…we were doing our very best! Even if you are stronger, I will never forgive an act like making fun of them!” (Izumo)</p><br/><p>“Make fun of them? I had no such intentions, child of the military family Ikusabe. Just that—” (Haruka)</p><br/><p>“My comrades and I had the resolve in this fight!!” (Izumo)</p><br/><p>“That’s simply delirious talk from the weak.” (Haruka)</p><br/><p>“!!”</p><br/><p>“I had no obligation of doing my best to answer to your resolve.” (Haruka)</p><br/><p>“Why…? Aren’t you a warrior?! Is ridiculing the people who do their best something that a warrior would do?! I have not been taught that by no one! Not my sword master, or my magic master, or anyone from my household. And I feel pride from that!” (Izumo)</p><br/><p>Izumo’s expression was distorted in anger.</p><br/><p>Even Iroha had chosen to clash blades with her mother.</p><br/><p>Izumo wouldn’t allow anyone to dare say that there was no resolve in that.</p><br/><p>He wouldn’t let that happen.</p><br/><p>The attack of Ein-Khalif that she used was vicious. Leaving aside how much Iroha herself was able to control that, it was an attack that showed absolutely no signs of holding back.</p><br/><p>Her expression also showed no hesitation. She had a strong face as she viewed the attack towards her mother –without showing a single sign of bitterness.</p><br/><p>Izumo was deeply moved by the strong resolve of Iroha.</p><br/><p>“I definitely won’t acknowledge you!” (Izumo)</p><br/><p>“Stop it already. There’s no way you don’t know that you have been shaving off your life as you wring out magic power, right? No matter how much power you bring out, I can summon mamonos that can serve as shield and mamonos that can interrupt your aria. It is an ability that’s said to have been used by the Wise Tokito-sama, called Hyakki Yagyo.” (Haruka)</p><br/><p>“I know, you can use it as a Rebound Person. That doesn’t matter anymore.” (Izumo)</p><br/><p>Izumo also understands.</p><br/><p>Osakabe Haruka is a Rebound Person. Moreover, an abnormal Rebound Person that possesses several Wise powers.</p><br/><p>She might even be stronger than a Wise.</p><br/><p>But even if that’s the case, Izumo has absolutely no intentions of changing his plans.</p><br/><p>“…If you still have something you want to do, go ahead.” (Haruka)</p><br/><p>“…”</p><br/><p>“If that’s the way you want to use your life, go ahead. Do it.” (Haruka)</p><br/><p>“…Is that your way of pity?” (Izumo)</p><br/><p>Izumo grips his staff and katana.</p><br/><p>He was bringing out dangerous magic power from inside of him and shaping it.</p><br/><p>“Fighting is by no means something that I find fun. What role did God give to me when it granted these many powers to this body…” (Haruka)</p><br/><p>Haruka wasn’t showing a single trace of feeling danger.</p><br/><p>“Then watch. I will be showing you right now what lies beyond the power of a military household!” (Izumo)</p><br/><p>Finishing his calculations, he spreads many fragments of arias.</p><br/><p>Multiple magic activation, a technique that is passed down and classified as a special move by the military family.</p><br/><p>(Fourteen activations of ‘Garuda Tempest’ and four ‘Dust Wings’. It should look beautiful.) (Izumo)</p><br/><p>Fully on the know of what will come out, Izumo gathers more aria fragments.</p><br/><p>“Well, leave that for later, okay?”</p><br/><p>A voice suddenly resounded.</p><br/><p>But that wasn’t an unfamiliar voice for Izumo. Or more like, the moment Izumo heard it, he felt as if he would lose all strength out of relief.</p><br/><p>—A voice he has been waiting for eagerly.</p><br/><p>“…Wa?”</p><br/><p>The voice that Haruka heard right in front of her was from someone Izumo knows.</p><br/><p>The dumbfounded voice he let out was a reaction after seeing the shining needle pierced in the neck of Haruka.</p><br/><p>“Who goes there!” (Haruka)</p><br/><p>“Woah now.”</p><br/><p>Without caring about Izumo, Haruka’s naginata leaves a shiny trail as she turns around, but the person easily jumped away from it and stands in the middle of Izumo and Haruka.</p><br/><p>“Sensei?” (Izumo)</p><br/><p>“Yeah.” (Makoto)</p><br/><p>The quest has been accomplished.</p><br/><p>Even if this was the result of them being made light of, no one died.</p><br/><p>‘Ah, with this, I can let go of my consciousness’, is what Izumo thought as his knees hit the ground.</p><br/><p>It must have also been the backlash of him exploding with the most anger he have had to feel in his whole life until now.</p><br/><p>But, sadly, their Sensei won’t be easy-going.</p><br/><p>“Sensei. Then…you are Raidou?” (Haruka)</p><br/><p>The state of Haruka made a complete turn.</p><br/><p>Bloodthirst that would make you shiver was released in an instant from her whole body.</p><br/><p>The magic power needle made a small sound as it broke.</p><br/><p>“…Right. Izumo.” (Makoto)</p><br/><p>“Y-Yes?!” (Izumo)</p><br/><p>“Wake up everyone and watch.” (Makoto)</p><br/><p>Without turning back, the Sensei says these short words and faces Haruka.</p><br/><p>****</p><br/><p>Osakabe Haruka tried to receive everything that Jin and the others brought out.</p><br/><p>She was trying to bring out their power as she hurt them to an extent where she wouldn’t kill them.</p><br/><p>A delicate job that required the highest of care.</p><br/><p>Their anger, bloodthirst, and the many miracle-like techniques that these young group of talents were giving birth to; she received them all and crushed them.</p><br/><p>That’s how it looked to me.</p><br/><p>And that delayed it enough for me to intervene.</p><br/><p>In other words, it could be that……ah…this is hard to deal with. Even if it is something that I have decided on, I wonder if this really is the correct choice.</p><br/><p>Fighting really doesn’t bring out anything good.</p><br/><p>“The enemy of Tomoki-sama; the one who injured his personage…is how I should think of it, right?” (Haruka)</p><br/><p>“You can.” (Makoto)</p><br/><p>Was it at the time she fought Lime and Levi? Or maybe after seeing the fight of Jin and the others?</p><br/><p>It…couldn’t have been at the time when she killed Kougetsu-san.</p><br/><p>At that time, I thought we were too late, but due to the power-up of Tomoe’s illusions, it seems she can even interfere with the boundary between life-and-death.</p><br/><p>After reviving the whole unit, we have had them cooperate for the time being.</p><br/><p>…But she sulked quite a lot though.</p><br/><p>‘I will become lad Kosugi~~!!’, is still burned in my mind. </p><br/><p>“Fufu, so the one I was looking for has finally appeared. Moreover, it looks like you are pretty strong.” (Haruka)</p><br/><p>Haruka-san rubs the back of her neck.</p><br/><p>How did she nullify the needle?</p><br/><p>If it’s her who possesses several Wise abilities…ah, it is this one huh.</p><br/><p>Investigating with ‘Sakai’, I gather detailed information of her.</p><br/><p>This person has quite a lot of real combat experience and is quite strong.</p><br/><p>“It is called Wings of the Saint.” (Haruka)</p><br/><p>“…”</p><br/><p>So she already knew that I was investigating her and about the result as well huh.</p><br/><p>That’s right, Wings of the Saint; the last power that she hadn’t displayed until now.</p><br/><p>“Because of this, fighting had become nothing short of boring.” (Haruka)</p><br/><p>Because of that huh.</p><br/><p>“Must have been. A Wise power that activates the moment you receive a certain amount of damage or are afflicted by a status effect that affects your life.” (Makoto)</p><br/><p>And after activating, all damage will be healed and you receive a permanent resistance against that status effect.</p><br/><p>It truly is an unbelievable power fitting of its name.</p><br/><p>Get injured for long, and in time, become immortal huh.</p><br/><p>Was that the power of a brave of that era, or maybe a Wise of reputation?</p><br/><p>“How scary. It is correct. It also heals wounds and poison disappears.” (Haruka)</p><br/><p>“…No way. That’s cheating.” (Izumo)</p><br/><p>I heard the pained voice of Izumo coming from my back.</p><br/><p>Looks like Jin and the others have woken up. They are making noise.</p><br/><p>“ So, what will you do? That mysterious needle attack of yours won’t work on me anymore. This is the first time I have had Wings of the Saint activate with a single attack though.” (Haruka)</p><br/><p>“Of course, I will be incapacitating you.” (Makoto)</p><br/><p>I glance at my students.</p><br/><p>Jin, Daena, Misura, Amelia, Sif, Yuno…and Izumo.</p><br/><p>They have…truly become strong.</p><br/><p>Just how much experience have they gained in this short amount of time.</p><br/><p>I couldn’t understand the reason of them being here until I saw it directly with my eyes.</p><br/><p>I even thought it could have been a mistake that stemmed from Shiki indulging the selfishness of Izumo.</p><br/><p>No, if we think about the danger, my thinking is correct.</p><br/><p>But that’s not it –it wasn’t solely a mistake.</p><br/><p>They have already grown a lot more than someone like me.</p><br/><p>I am simply a teacher though.</p><br/><p>Shiki must have talent as a mentor.</p><br/><p>“Incapacitate? The more I swing my weapon, the stronger I become; just by receiving an attack, I gain resistance against it; I can’t use big magic, but I can summon a number of mamonos that possess many abilities –you want to incapacitate someone like that? Even if you look around the world, there’s no one who can clash upfront against me.” (Haruka)</p><br/><p>Haruka-san shows a praiseworthy feat of smiling while not loosening her bloodthirst at all.</p><br/><p>…How vain.</p><br/><p>“In reality, I have been thinking for a bit. I was wondering if you and I are similar. But it looks like I was wrong.” (Makoto)</p><br/><p>“That doesn’t answer anything.” (Haruka)</p><br/><p>“Haha, you say you have ‘become’ bored?” (Makoto)</p><br/><p>“What’s so funny about that?” (Haruka)</p><br/><p>“In that case, I might be able to express my gratitude towards you for stimulating the growth of my students.” (Makoto)</p><br/><p>“…”</p><br/><p>“I will make it so your last fight will be slightly fulfilling at the very least.” (Makoto)</p><br/><p>“?!!”</p><br/><p>When I look at Haruka-san, she takes a stance with sharp eyes and points her weapon in my direction.</p><br/><p>“Haruka-san.” (Makoto) </p><br/><p>“What?!” (Haruka) </p><br/><p>I call her as I stand right before her eyes.</p><br/><p>Being suddenly closed in in such a short space of time, she was clearly agitated.</p><br/><p>“You see, I…” (Makoto)</p><br/><p>I pierce her with a needle.</p><br/><p>The needle that had a petrifying effect endowed was pierced in her chest.</p><br/><p>“Why?! But!” (Haruka)</p><br/><p>The needle crumbles.</p><br/><p>It doesn’t matter.</p><br/><p>“Things like ‘a fight being fun’…I have never thought of it before. Even the battle trainings, I only do them because they are necessary. No matter if I get injured or not, no matter if it is a complete victory or a crushing defeat; I don’t feel worth in battle. Honestly, inside of me, there’s only the feeling of whether it is necessary or not.” (Makoto)</p><br/><p>“Are those your words as a warrior?!” (Haruka)</p><br/><p>“Is that a joke? This is simply a farewell gift. If Haruka-san is a person that’s fickle about victory or defeat, it is still possible to bring out something that will make fighting worth after all!” (Makoto)</p><br/><p>This time, I create a fire needle and attack.</p><br/><p>She tries to evade, but it looks like she still has some leeway in her.</p><br/><p>Utilizing the power of the red-colored coat, I accelerate without reservation, and break through the evasion and defense of hers that was mixed with hesitation.</p><br/><p>“It doesn’t have any effect! Raidou!!” (Haruka)</p><br/><p>Two naginatas are swung inside the hot wind.</p><br/><p>The trajectory of the blades are on the level of a master, but I am the faster one.</p><br/><p>I grab both blades around the base with its respective hand.</p><br/><p>“You grabbed it?!” (Haruka)</p><br/><p>“It is pure physics. I wonder if you gain complete immunity if you were to be hit with physical damage.” (Makoto)</p><br/><p>“Wa, guh!!” (Haruka)</p><br/><p>I continue by striking her with my Magic Armor.</p><br/><p>Aiming up.</p><br/><p>The strongest team attack of Jin and the others began just like that.</p><br/><p>Was it the ‘Aerial’ of Izumo? That had stayed in my mind, so I might have punched her up unconsciously because of it.</p><br/><p>But the figure of Haruka-san in the sky disappears while she was still hanging in the air.</p><br/><p>Teleportation?</p><br/><p>No, this is…</p><br/><p>I move my gaze to the side and I found her using the crumbling rubble of buildings as foothold to jump and approach me.</p><br/><p>A feat that’s impossible for a hyuman; ability on the level of a Wise.</p><br/><p>Is that the blessing of the ability that enhances the body whenever it receives damage; War Beast?</p><br/><p>She is making moves like those of a wild animal.</p><br/><p>“Dwell in it, fifteenth beast; the inescapable black thorn, Great Tusk Ogre!” (Haruka)</p><br/><p>Summoning a familiar and endowing it into her weapon with no aria, just simple words, Haruka-san moved at lightning speed with a blade that’s clad in a black muddy-something and came mowing down at me on both sides.</p><br/><p>She said it was inescapable, but it seems possible to evade.</p><br/><p>I move back at the place slightly before the two blades intersect.</p><br/><p>“I got you!!” (Haruka)</p><br/><p>So she had my evasion in mind huh.</p><br/><p>The two naginatas became one and was thrusted at me who was trying to evade.</p><br/><p>A charge that came at me together with her whole body.</p><br/><p>The part of the Magic Armor that came in contact with its tip was blown away.</p><br/><p>Literally blown away.</p><br/><p>Hm~.</p><br/><p>I crouch my body; my two legs properly staying on the ground.</p><br/><p>Grabbing the naginata that was still clad in a black aura, I pull it towards me.</p><br/><p>Now that she was at close range, I create a needle endowed with blast power from my right hand, and pierce it onto the shoulder of Haruka-san.</p><br/><p>“…!!”</p><br/><p>She is blown to the ground without letting out a single word.</p><br/><p>But that’s not the end.</p><br/><p>From the dust cloud that was raised, several shadows aside from hers appeared.</p><br/><p>So she summoned something again huh.</p><br/><p>“Scary. You truly are a scary monster, Raidou. Even so, I won’t be losing.” (Haruka)</p><br/><p>I am beginning to feel as if I am being attacked by a zombie.</p><br/><p>“Why do you think of something that’s so far from the truth?” (Makoto)</p><br/><p>“The Wings of the Saint will remember all of your abilities in time.” (Haruka)</p><br/><p>“And?” (Makoto)</p><br/><p>“And I am saying that’s the moment where you will be prostrating!” (Haruka)</p><br/><p>“If you want to win against me, immortality is not enough.” (Makoto)</p><br/><p>I am certain.</p><br/><p>If she were really charmed by Tomoki, Jin and the others would have been all killed in just a matter of seconds.</p><br/><p>Izumo called it an insult and was angered, but she wouldn’t have let them show their abilities and the limits of their power.</p><br/><p>Haruka-san —you, just how did you do it, and when?</p><br/><p>Did you undo the charm of Tomoki on your own?</p><br/><p>I was thinking this while listening to her frivolous talk.</p><br/>\n</div>"}