{"title": "Chapter 297: Puppet revolt, end", "id": 297, "volume": 3, "url": "http://boxnovel.org/tsuki-ga-michibiku-isekai-douchuu-chapter-297-puppet-revolt-end", "volume_title": "Volume 3", "body": "<h1>Chapter 297: Puppet revolt, end</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 297: Puppet revolt, end</p><br/><p>TLN: Hey guys, Reigokai here!</p><br/><p>I know I promised a two chapter release of extras, but guess what! Yes! New chapter of Tsuki main blew away all priorities!</p><br/><p>So remember, whenever that happens, I will change schedule to main instead of extra (if time allows it).</p><br/><p>Also heads up, this is a pretty decently lengthed chapter.</p><br/><p>Now then, enjoy the chapter! :DD</p><br/><p>There’s an innumerable amount of Spirits in this world.</p><br/><p>Most of them are harmless existences that don’t have a will and don’t act on their own. They are not even noticed by most of the hyumans. They may not have a clear will, but there are a good amount of them that can act instinctively. They are called Low Spirits.</p><br/><p>There do exist some that can communicate, but they are few in number, and they are called Mid Spirits.</p><br/><p>For the many mages that utilize Spirit magic, being able to communicate with a Mid Spirit and have a contract with them is a life goal.</p><br/><p>And from within that category, there’s an even higher grade than the Mid Spirits. The High Spirits that rule over a respective element.</p><br/><p>There’s only six High Spirits in the world. Fire, Water, Wind, Earth, Light, Darkness; there’s only one of each respectively. They serve the Goddess, and they are also a target of worship as existences affiliated to her.</p><br/><p>It is impossible to make a contract with High Spirits using Spirit magic.</p><br/><p>Being able to make contact with them and obtaining their cooperation would already be a great enterprise for a hyuman.</p><br/><p>That’s why the Lorel Union’s Priestess of each generation is respected as an existence capable of communicating with the Water Spirit.</p><br/><p>For Lorel who has many rivers with swift streams, the ability of communicating with the Water Spirit to obtain a big blessing in the flood control is something that can’t be lacking in the country’s maintenance and development.</p><br/><p>There has been no mention of the Fire, Wind, or Earth raising a country and being worshipped, and the most mention they have gotten is when a brave that appears every now and then gets involved with them. Thus, the relationship that Lorel Union has with the Water Spirit is an incredibly special case.</p><br/><p>And this came about from the first generation Priestess who was the progenitor of talisman magic and a Spirit user that held high expectations. It was heavily related with it being Hitsuna though…but at any rate, the current Lorel’s worship towards the Water Spirit is tremendous.</p><br/><p>Putting it bluntly, they worship the Water Spirit more fervently than the Goddess.</p><br/><p>The Goddess is simply being prayed at on the side because she is the master of the Water Spirit.</p><br/><p>Aside from the fact that they themselves have taken it to accept all Wise, they are a single nation.</p><br/><p>Not only that, they have raised their name to one of the major powers and stay loyal to being unchanging.</p><br/><p>The flood control and many other miracles.</p><br/><p>The benefits that the Water Spirit brings about to Lorel go from small things to big things.</p><br/><p>But…how strong is a High Spirit?</p><br/><p>A Water High Spirit that receives the fervent worship of a whole nation that is considered a major power of the world. It wouldn’t be an exaggeration to say it is an existence close to that of the Goddess.</p><br/><p>“I thought for a moment that it was the Goddess that was interfering, but…it was a Spirit-jatta ka.” (Tomoe)</p><br/><p>Tomoe mutters slightly unamused.</p><br/><p>While looking at the battle high in the sky, she was showing an expression as if she had met an unsavory person.</p><br/><p>It was quite the change from her excited state when she saw the big youkai war and had her eyes sparkling to the point of skipping.</p><br/><p>“It was an opponent that Tomoe-san and Shiki had to give up on even when going against it two against one, right?” (Mio)</p><br/><p>“Don’t put it in a way that can be misunderstood. I can understand you not liking that that woman has absorbed the magic power of Waka though.” (Tomoe)</p><br/><p>“…Hmph.” (Mio)</p><br/><p>“I simply pulled back temporarily because I had judged that, no matter how we dealt with it, it would affect this country and would be impossible to keep it undercover. That’s how deep and old the relationship Lorel Union and the Water High Spirit is.” (Tomoe)</p><br/><p>“Those Spirits are servants of the Goddess after all. They are different from Superior Dragons in that they increase their strength with worship.” (Mio)</p><br/><p>“Seriously. From the perspective of a Superior Dragon, they are basically problematic parasitic existences that do whatever they want with a proud face. Well, that’s solely how a Superior Dragon would think of it-ja ga.” (Tomoe)</p><br/><p>“……From the perspective of a Superior Dragon huh. Yeah yeah.” (Mio)</p><br/><p>Haruka clad with a golden and soft clear blue light is fighting with Makoto.</p><br/><p>This was occurring in the sky, and at times, lights of destruction would rain in the city as it continued even now.</p><br/><p>Makoto had an indigo blue aura around his body and clashed with Haruka while leaving trails of light behind, and sometimes, they would exchange blows at close range.</p><br/><p>The high ranked magic shot with crazy amounts of magic power and the rampaging skills were akin to a natural disaster.</p><br/><p>But Tomoe and Mio, who were watching this extraordinary fight, didn’t show much change in their looks.</p><br/><p>The most they did was chat with the students that were in the same place as them and were tasked to protect.</p><br/><p>“Spirit-sama is helping out mother?” (Iroha)</p><br/><p>“Even if the Priestess-sama is absent, that’s just…”</p><br/><p>Iroha says with a cracked and trembling voice.</p><br/><p>It is unknown if it is because of exhaustion or a mental matter, but she is unable to stand up even now and was being held up by Izumo who had a pale face as well.</p><br/><p>It couldn’t be helped.</p><br/><p>For them, the Water High Spirit is a target of worship.</p><br/><p>An existence close to that of a God.</p><br/><p>And that existence close to being a God, who would only communicate with the Priestess, was currently lending part of its power to Haruka. Just thinking that made their body tremble.</p><br/><p>“And so, how is it, Tomoe-san? The level of its power.” (Mio)</p><br/><p>“Same as mine, or maybe higher than mine.” (Tomoe)</p><br/><p>“Meaning that it would be a bad idea to clash with it without any plans. I don’t like it, but I think the same.” (Mio)</p><br/><p>“But well, we are not Waka after all. Picking a fight with a High Spirit without any plans would be impossible. However, if we were to properly have a plan…it would be impossible for us to lose.” (Tomoe)</p><br/><p>“Right-desu wa ne.” (Mio)</p><br/><p>“?!”</p><br/><p>Mio narrowed her eyes slightly at the words of Tomoe that were said without any special meaning, and Jin and the others who heard this had their eyes wide open.</p><br/><p>It was a surprise that Mio might be on the same level as Haruka and Tomoe who are on the level of superhyumans and braves.</p><br/><p>Surprised by the fact that Haruka was such a dangerous existence, and that Tomoe and Mio are combatants on that level of power; those two facts brought about this reaction from them.</p><br/><p>(In that case, Sensei who these two serve under…just who in the world…) (Jin)</p><br/><p>There was only one. Only Jin was carving in his heart the awe he felt towards the person that precedes them, Raidou.</p><br/><p>He already didn’t care about the pain in his neck as he burned everything that was happening before him in his eyes.</p><br/><p>They may have been healed and their injuries treated, but it is not as if they are brimming with energy. But even with that, rather than the desire of lying down to rest, their desire to witness everything was winning inside the hearts of everyone there.</p><br/><p>“Tomoe-dono.” (Kougetsu)</p><br/><p>“Hm? …Oh, Kougetsu-dono huh. You being here must mean that you have finished collecting the maddened guys already?” (Tomoe)</p><br/><p>A weak and low but clear voice calls out Tomoe by name, and she turns to receive it.</p><br/><p>In that place, there’s the man that dispatched and commanded the troops of Kannaoi to deal with the surprise attack of Haruka, Kougetsu.</p><br/><p>“Yeah. Excluding that though. That blue and golden…is Haruka, right?” (Kougetsu)</p><br/><p>“Umu.” (Tomoe)</p><br/><p>“And the one confronting her is your master, Raidou-dono then?” (Kougetsu)</p><br/><p>“As you guessed.” (Tomoe)</p><br/><p>“That damn Sairitz. Just how in the world would I… No, I would be crying over spilt milk. At any rate, Tomoe-dono, I once again give my thanks for saving this short life of mine and the young lives that will be supporting the future.” (Kougetsu)</p><br/><p>“I don’t mind.” (Tomoe)</p><br/><p>“You say it as if it is nothing. A miracle like that—” (Kougetsu)</p><br/><p>“I had to get used to my own power, and I also had the order of Waka. That’s why, just think of yourself and your subordinates as lucky. And since you have died once, you must have learned a lot from it, right? Just use what you have learned plenty well in the future.” (Tomoe)</p><br/><p>Tomoe pushes aside the thanks for the resurrection she performed as if it was nothing.</p><br/><p>She only told him to put that important experience to good use.</p><br/><p>A lesson.</p><br/><p>How this lesson will turn out to be in the future depends on Kougetsu and the others, but this is also an ingenious salesmanship of Tomoe to push a high-pressure debt on them.</p><br/><p>It could also be considered an induction of fear.</p><br/><p>They were massacred by Haruka, so some of them might retire from being soldiers due to the trauma though.</p><br/><p>“Is Tomoe-dono saying that even that was of no difficulty?” (Kougetsu)</p><br/><p>“By no means. It was quite the troublesome and problematic job, you know. If it weren’t under the order of Waka, I wouldn’t want to do that a second time-ja na.” (Tomoe)</p><br/><p>“…”</p><br/><p>A feat of such degree.</p><br/><p>What Kougetsu referred to was not simply the resurrection of the dead.</p><br/><p>Of course, resurrection itself is an incredibly high-ranked magic, so it isn’t something that can be readily used.</p><br/><p>But what Tomoe did was resurrecting everyone, even the ones who were minced by Haruka and were literally just red splatters, and the ones that were burned and only left a burned mark on the ground; all of them were resurrected with their whole body intact.</p><br/><p>Resuscitation out of scraps. It was a feat that wouldn’t be an exaggeration to call a miracle.</p><br/><p>Kougetsu, who was the first one to be resurrected from a state where only one of his legs were left, had witnessed all of it.</p><br/><p>‘Aah, I went too far-ja~!’ and ‘That’s not it!’ and ‘Why did it suddenly connect there~?!’, she spouted those kind of words that lacked tension as she performed what should be miracles, and Kougetsu, who saw and heard all of this, already had no ill feelings towards the Kuzunoha Company.</p><br/><p>Hyuman bodies were gradually taking form from the earth, and from that meat, life took dwelling and they opened their eyes, and then, he as the commanding officer looked at his own body and said: ‘It is like something out of legends’.</p><br/><p>Kougetsu wished for this situation to be resolved more than fulfilling his own ambition.</p><br/><p>He wished from the bottom of his heart to save this city from the tragedy that he himself created because of his own impatience.</p><br/><p>That’s why, when Tomoe had asked him for his cooperation after she finished her miracles, he immediately accepted, even if the request of her was to shelter the attackers.</p><br/><p>That resolve of his didn’t change even when he saw the spectacle in the sky.</p><br/><p>He cannot be considered a pious one, but he does have faith towards Spirits on the level of an average person.</p><br/><p>A Spirit may have lend Haruka its strength, but he who has already experienced death once was able to accept that truth with somewhat cold eyes.</p><br/><p>In the first place, there’s someone who seems to be, at the very least, fighting on the same level as Haruka.</p><br/><p>That’s why he placed those two realities on a scale, and had headed towards where Tomoe, Mio, and Iroha are while minding the transitions of the battle.</p><br/><p>—For the sake of thanking his benefactor, to see the conclusion of the battle, and to decide how he will be acting from now on.</p><br/><p>“That woman…she is gradually getting stronger. If I were to get hit by her attacks as she is now, I feel like even the special gear would be smashed to pieces.” (Yuno)</p><br/><p>“Correct. As expected of Waka-sama’s student. You have quite the good eyes. Work even harder. If you are able to handle it well, I will upgrade it to mark 2.” (Mio)</p><br/><p>“Eh?!” (Yuno)</p><br/><p>Mio gave out unexpected words towards the evaluation of Yuno that had surpassed mortification and entered the area of resignation.</p><br/><p>“Also, Misura, was it? You are also pretty decent yourself. You are already stepping into the realm of a brave. Single-mindedly specializing in defense. Complete party doctrine. You have piqued my interest.” (Mio)</p><br/><p>“E-Eeeeeh?!” (Misura)</p><br/><p>“I kind of understand why Tomoe-san was interested in you. You managed to coordinate with Yuno within real combat, took leadership, and are a defense oni. Fufu, being pulled in by single specializations might be the influence of Waka-sama.” (Mio)</p><br/><p>Mio pats Yuno and Misura in a joyful mood.</p><br/><p>Even though Tomoe alone was already plenty hellish enough, if he were to get another one…the body of Misura was trembling in fear at the prospects of not being able to endure it.</p><br/><p>On the other hand, Yuno had her eyes sparkle at the sound of ‘mark 2’ and then, reminisced the fight she had together with Misura and nodded several times.</p><br/><p>(Right. Since the moment Misura-senpai took command and coordinated, moving around got incredibly easier. Now that I think about it, I don’t know how to act as the shield of the party after all. Today’s Misura-senpai was truly incredible…) (Yuno)</p><br/><p>Moreover, at the times when she would use offensive skills, he would properly send Yuno to the frontlines.</p><br/><p>He was truly an artisan of defense. Yuno had felt directly the degree of his ability.</p><br/><p>With the words of praise from Mio, Yuno send a slightly passionate look towards Misura who was looking at what was directly above them.</p><br/><p>“It is true that it is impressive. It is impressive, but…it is somewhat different. This is the first time I have seen a Spirit power this thick, but…there’s something…” (Sif)</p><br/><p>Sif was looking up as she muttered.</p><br/><p>It seemed as if, after being told about the existence of the Spirit from Tomoe, she had agreed but at the same time couldn’t.</p><br/><p>As a mage that borrows the power of Spirits, the current state of Haruka is something that she can’t understand well.</p><br/><p>It is as if the Spirit itself had descended, and at the same time, it hasn’t.</p><br/><p>In the first place, if a High Spirit were to dwell inside the body of a hyuman, in most cases, that vessel would explode.</p><br/><p>It has been said that a number of Lorel Priestesses have done the descent ceremony in the past and have done incredible miracles, but they all -without exception- died a few minutes later.</p><br/><p>A death by burning through their lifeforce and mental strength. The Priestesses are incredible in itself for managing to have their whole body intact after that.</p><br/><p>But Haruka is still alive, even though several minutes have long passed already.</p><br/><p>Then, is the High Spirit lending its power?</p><br/><p>But there’s a thick presence of something in the place.</p><br/><p>The current Haruka is fighting like a hyuman who has become one with a Spirit. It was as if a Spirit had manifested and had borrowed the vessel of a hyuman; that kind of strange state.</p><br/><p>There’s no way one could create a convenient situation like that in reality, and whether it is a manifestation or a descent, if there was such an efficient way, anyone would be jumping at it.</p><br/><p>Sif would be one of them.</p><br/><p>She was burning the state of Haruka in her head.</p><br/><p>In order to use it as a reference for the time when she summons an Earth Spirit, manifests it, and turns it into her own strength.</p><br/><p>It is currently an impossible to fulfill goal, but she judged that the only thing she can currently do in this situation is to watch this fight and think for the sake of the future.</p><br/><p>(Even so, something like this where someone aside from a Priestess is able to borrow the strength of the Water Spirit in this Lorel, there’s no doubt that there will be a gag order issued.) (Sif)</p><br/><p>Even if they can’t tell anyone, it won’t dilute the worth of it.</p><br/><p>“At that level is…where Shiki-san is.” (Amelia)</p><br/><p>Amelia was looking up, not to learn, but as if she were confirming a resolve that was lying in her heart.</p><br/><p>For her who has changed her involvement with the Kuzunoha Company not that long ago, it was an important sight to understand that the back of the person she aims for is at that place.</p><br/><p>The figure of Haruka is still far away.</p><br/><p>Amelia would be cut down in less than a second.</p><br/><p>It is impossible to line up shoulder to shoulder. She thought that it would be fine to be three steps back from him, but as expected, her objective and her current position are way too far apart.</p><br/><p>Even so, the figure of Haruka clashing against Raidou didn’t bring much despair to Amelia.</p><br/><p>(Shiki-san is holding my hand and pulling me. Even if it is impossible right now, someday, I will definitely… I will also have Raidou-sensei acknowledge me as well. When that happens, it would be fine for me…to call Sensei as Waka-sama too, right?) (Amelia)</p><br/><p>Well, even if she were to ask that of Makoto right now, he would have accepted that way of calling him while making a defeated expression though.</p><br/><p>But for the sake of Shiki who guides her, Amelia pledged to this slightly deviated objective of hers strongly as she reinforced her resolve believing, not in herself, but in Shiki.</p><br/><p>Tomoe, who was peeking at that state of hers from the side, showed a slightly tired expression with a tint of amusement as she lets out a small sigh.</p><br/><p>“…It is incredible, isn’t it.” (Daena)</p><br/><p>“?”</p><br/><p>Daena mutters lowly.</p><br/><p>Those short words of his gather the gazes of the students.</p><br/><p>“That woman called Haruka was crazy strong. Even when she was not being serious, she was on a whole different level.” (Daena)</p><br/><p>“……”</p><br/><p>“And yet, even against an opponent like that, Sensei is able to fight her back. Corner her, make her pull out her cards, and make her bring out her all. And even with that, not only is he not pulling back a single bit…he is pushing her. Is the world such a vast place? Is it such…a limitless place?” (Daena)</p><br/><p>“……”</p><br/><p>“Adventurers, knights, or mages; native-borns, the Academy, graduation….. They are all conflicts on a truly pitiful level. The outside world is like this. Even if we were to look like absolute existences, there’s an absolute out there that can crush us. There’s no end……” (Daena)</p><br/><p>There were no words in return.</p><br/><p>Because the fight happening high up was truly on a whole different level.</p><br/><p>Even if they can use it to better themselves, if they were asked if in the future they can participate in such a place, the answer would be no.</p><br/><p>A battle of the chosen.</p><br/><p>Anyone experiences the powerlessness of what they have done until now after they face moments like this.</p><br/><p>But no matter how powerless you think of yourself, it is not pointless.</p><br/><p>The words of Daena had despair and resignation in them, but no one was able to refute him.</p><br/><p>“…Puh…haha…hahahahaha!! I see, I see. The chicks are worrying in their own chick way huh!” (Tomoe)</p><br/><p>“Wa?” (Daena)</p><br/><p>Seeing Tomoe suddenly break out laughing, Daena’s words were cut short.</p><br/><p>When looking around, Mio had her folding fan over her mouth, and looked like she was holding in her laugh.</p><br/><p>In the eyes of Daena, these two were chosen ones, and that reaction of theirs had agitated him heavily.</p><br/><p>“T-Tomoe-san, a-at the very least… pufu…t-these children…fufu…are seeing the vanity of…pfft…their own…ufu…” (Mio)</p><br/><p>Mio was trying to do a follow up, but it wasn’t making any sense.</p><br/><p>The self-deprecating monologue of Daena had, for some reason, strung the cords of Tomoe and Mio.</p><br/><p>“Ah…gangly boy with a child, your name was Daena, right? First, can I say one thing?” (Tomoe)</p><br/><p>After having a good laugh, she took the trouble of walking to the front of Daena, placed a hand on his shoulder, and looked straight at his eyes before speaking.</p><br/><p>On the other hand, Daena could only nod.</p><br/><p>“Don’t get ahead of yourself.” (Tomoe)</p><br/><p>“!!”</p><br/><p>“It is true that you people are the result of Waka and Shiki’s teachings and inquisitiveness. After obtaining strength unfitting to that of a student, you guys must be dreaming about the possibilities you have. Run to your heart’s content. But, don’t get ahead of yourself.” (Tomoe)</p><br/><p>“It wasn’t my intention to get ahead of myself though.” (Daena)</p><br/><p>“Listen here. Since Waka is not here, I can tell you guys in an easy to understand way without the need to be picky about the words. The ones that are currently fighting there are…” (Tomoe)</p><br/><p>“……”</p><br/><p>“One is a prodigy-ja. And, from what I see, only has one weakness. The very definition of a brave class that appears in fairy tales. The height of natural talent.” (Tomoe)</p><br/><p>“…Then, the other one?” (Daena)</p><br/><p>“A Great Demon Lord that not even that Brave would be able to do anything about —a monster-ja yo. There’s no way you guys who are currently ordinary people can even challenge one step into it, right? Even I would be wounded if I were to jump into that.” (Tomoe)</p><br/><p>“True. Even I wouldn’t be able to do much with just a kimono. I would also be decently wounded.” (Mio)</p><br/><p>Mio nods at the words of Tomoe.</p><br/><p>Looks like Mio finally managed to escape from the laughing tunnel. Can’t let her guard down since there might be an afterquake.</p><br/><p>“Listen well. Carve today’s battle inside your head, and when you think that your strength has reached its peak period, imagine that woman and try fighting her. If you can last a minute, you are plenty good-ja. If you are shouldering something that you can’t protect with that level of strength, it would be an issue of the article not matching its risks.” (Tomoe)</p><br/><p>“One minute…” (Daena)</p><br/><p>“That’s right-ja. It is that kind of fight-ja yo. For you people, that is. It will definitely serve as the best kind of measure.” (Tomoe)</p><br/><p>“But Tomoe-san. You said ‘the height of natural talent’, but isn’t Sensei overwhelming her? To the point that even Haruka in that state is desperate…” (Jin)</p><br/><p>“Jin huh. Idiot. What are you trying to measure yourself to Waka for? That in itself is what would be completely pointless. Go ahead and carefully look at his movements.” (Tomoe)</p><br/><p>“Eh?” (Jin)</p><br/><p>At the moment when Daena had closed his mouth and had entered thinking mode, this time, Jin was the one to ask Tomoe.</p><br/><p>Must be because he felt something strange in Tomoe describing it as a battle between a brave and a monster.</p><br/><p>Being asked this, Tomoe chided him as an idiot, and then, pointed at the state of the battle.</p><br/><p>“A body that has been trained to the limits, and the technique, on top of that, the many healing spells that she has free use of thanks to the power of the Water Spirit. If this is not a prodigy, what would you call it?” (Tomoe)</p><br/><p>“……”</p><br/><p>A rapid-fire of sure-killing techniques thrown by Haruka.</p><br/><p>Offensive, defensive, and evasion that utilizes the full of her power, technique, and experience.</p><br/><p>Even when they are in a special terrain that is the sky, she was moving as if she were running through the ground, to the point that would make one think that she was a resident of the sky since the time she was born.</p><br/><p>Erasing the opening of a swing with another swing, and erasing the opening of swinging both of the weapons in her hands with a spell.</p><br/><p>Accurately reading the counter-attacks of Makoto, she would handle the attacks that she can’t evade by setting healing magic beforehand. There was no moment where her attack and defense would lossen.</p><br/><p>Even if Makoto were to use the hyuman reflex to his advantage and deal attacks that not only are impossible to defend but even impossible to react, she would evade them by utilizing the forced movements of activating skills.</p><br/><p>On top of that, she would erase the opening the skill creates by overwriting it with another skill.</p><br/><p>Adding to that, there’s the traps and offensive magic of the Spirit power.</p><br/><p>It is true that, if one were to pay attention, it is all overwhelming technique.</p><br/><p>Her offensive and defensive abilities go without saying, but all the actions of Haruka felt as if they would serve as a learning experience for anyone.</p><br/><p>It is truly a battle style that one would label as a battle prodigy.</p><br/><p>But the Great Demon Lord Raidou was repelling them all to the point that one could only laugh at it.</p><br/><p>That’s right, the Great Demon Lord couldn’t be defeated. It is a mass of unreasonableness.</p><br/><p>“See? Even when she knew that she would be shot the moment she intercepted, she setup a post-activation magic to speedup, and is aiming for the neck of Waka. No, not only that. After doing that swing, she aimed for the heart from the back, and even if that didn’t succeed and a counterattack is dealt…she escaped further up. That last one, could it be the beginning movement of a skill that jumps up to cut down?” (Tomoe)</p><br/><p>“…Incredible.” (Jin)</p><br/><p>“Right? What that woman is showing is, in a sense, the best of a hyuman battle. A battle that goes a different line from Sofia and Hibiki. That’s why…that guy must have seen it as its chance and possessed that woman, but…it was overhasty.” (Tomoe)</p><br/><p>Then, why is it that Jin thought somewhere inside his heart that Haruka is not that big of a deal?</p><br/><p>The answer to the question that Jin had was simple.</p><br/><p>Because the person that stands as his Sensei is overwhelming her.</p><br/><p>That’s why…Jin thought that Haruka was, at most, at a higher place from them and was under-evaluating her.</p><br/><p>“Well well, it really is a parade of fascinating high-grade technique. Even when she had a blank in her life because there was no equal opponent for her to fight against, she can still manage to pull so much skill-ja. Hyumans are truly fearsome.” (Tomoe)</p><br/><p>It can’t be helped that, in the young eyes of the students, a proper evaluation can’t be made when all of that high-grade technique is being shot down.</p><br/><p>“Yeah, really. As expected, hyumans, or so to say the human race in general, is truly fearsome.” (Mio)</p><br/><p>Mio says with a pitying tone.</p><br/><p>“Hngh…” </p><br/><p>“She may be trying to hide in cleverly, but her fervour has changed. She is…going for the end.” (Mio)</p><br/><p>“Eh?!”</p><br/><p>The small change Tomoe and Mio felt was something that Jin and the others couldn’t see at all.</p><br/><p>They could only watch over the fight of Raidou and Haruka who were clashing as always.</p><br/><p>Feeling that the ending might be coming near, Iroha held the hand of Izumo tighter.</p><br/><p>And then, he gripped back that small hand of hers while still looking at the battle above.</p><br/><p>“It is about to end huh. The request of Futsu only smelled like trouble all over, but it ended up being a night with lots to gain.” (Tomoe)</p><br/><p>“I managed to protect the miso and soy sauce, so a single all-nighter was plenty worth it.” (Mio)</p><br/><p>The black and white naginatas of Haruka had left her hand.</p><br/><p>For a brief moment, silence reigned the battle.</p><br/><p>◇◇ ◆◆ ◇◇ ◆◆ ◇◇ ◆◆ ◇◇ ◆◆</p><br/><p>Scared eyes.</p><br/><p>Haruka-san.</p><br/><p>This person is not fit for battle.</p><br/><p>Her techniques and body are polished to an unbelievable level, but…there’s one thing.</p><br/><p>Her heart is not there.</p><br/><p>In a…different meaning from me…</p><br/><p>If there were an opponent of the same level or higher, a meaning to battle would be born?</p><br/><p>In regards to Haruka-san, that would be a mistake.</p><br/><p>Until now, I have…moderately cornered her, and had her expose all the skills that she can use.</p><br/><p>She had some revelations and growth within the battle, making the job quite difficult, but she probably only has her last plan remaining.</p><br/><p>Haruka-san is scared.</p><br/><p>Scared of injury, scared of defeat, scared of death.</p><br/><p>She hasn’t conquered those fears at all.</p><br/><p>Or more like, in all her life till now, she hasn’t felt that kind of fear and has managed to survive with her overwhelming talent —even when she was forced to the battlefield.</p><br/><p>That part is actually miraculous, and makes me think about what a winner she is.</p><br/><p>Being able to accept a High Spirit in her body even when she is not a Priestess and not lose her self-conscious, that in itself is crazy.</p><br/><p>This is just pointless assumption, but if it were a one against one between her and Zef-san with only the things that one has been born with, he might end up being pummeled.</p><br/><p>…In that sense, it might have been a blessing that Tomoki didn’t personally come in contact with her.</p><br/><p>Hm.</p><br/><p>Haruka-san, who was heaving heavily, suddenly let go of her two naginatas.</p><br/><p>The black and white weapons of hers didn’t fall and were floating at both sides of their owner.</p><br/><p>“Is your resolve to finish this ready?” (Makoto)</p><br/><p>“…I don’t plan on ending this so easily. Especially at this moment when I can’t even get to fight you properly.” (Haruka)</p><br/><p>“True. You were supposed to teach me what fighting is, right?” (Makoto)</p><br/><p>“!”</p><br/><p>“Right now, the roles seem to have reversed though. Haruka-san, it is true that you are person overflowing with talent. Honestly, it is incredible. And you are hitting me with all the strength you have. I see. I can understand why the Water High Spirit would make a gamble like descending to your body.” (Makoto)</p><br/><p>“…So you knew.” (Haruka)</p><br/><p>“Well, yeah. Just that…in regards to that, it feels more as if this wasn’t all planned, and simply that it couldn’t wish for a better situation than this. It wouldn’t be a bad idea to ask about this later. Wait, right now that’s of no importance.” (Makoto)</p><br/><p>“…”</p><br/><p>“…Haruka-san, you are scared, right?” (Makoto)</p><br/><p>“?!”</p><br/><p>“I can tell. It is too obvious. Those eyes that were desperately -truly desperately trying to bite at me. They were fierce, unique, and more powerful than any I have seen before…and yet, I couldn’t feel the fighting spirit of a warrior in them. Craving for battle? You don’t have any of that, you know. If I were to speak of something I felt, that would definitely be to—” (Makoto)</p><br/><p>Oops.</p><br/><p>It is not the time to say things like she wants to have a child, which would aggravate her maternal feelings.</p><br/><p>I was about to say something like that, but I manage to stop myself.</p><br/><p>There’s no need to go through the trouble of pointing that out.</p><br/><p>For a woman, it is in their nature to feel the most happiness from having a child with the man she loves and create a family as they pass their life.</p><br/><p>But for the blood-covered woman here, that might be way too late.</p><br/><p>“Uh…” (Haruka)</p><br/><p>“You undid the charm of Tomoki and left the Spirit as the controller -even if not completely- as you fought, not me, but your fear. Your heart was not together with you. Fufu, how to say it… You are similar to me.” (Makoto)</p><br/><p>“There’s no one who would be happy to hear that they resemble a monster, you know.” (Haruka)</p><br/><p>“So you admit it? That you are already not under the effects of that guy’s charm.” (Makoto)</p><br/><p>“Kh.” (Haruka)</p><br/><p>In that case, she should have surrendered.</p><br/><p>With that, the fight would have ended.</p><br/><p>And yet, she confronted me with her power and the power of the Spirit.</p><br/><p>Was it her being conceited about being almighty? Or was it the influence of the Spirit that wanted to deal with me?</p><br/><p>Those factors might have played a role as well.</p><br/><p>“…..You were planning on dying, right?” (Makoto)</p><br/><p>While fighting against her fear.</p><br/><p>While devoting her all to her desire of not wanting to die.</p><br/><p>This woman…was trying to die here.</p><br/><p>“Learn that reading someone’s heart is the act of a low-life.” (Haruka)</p><br/><p>“It is not as if I read it. It is just that you continued attacking me while shouting that in your heart. Even if I didn’t want to, it would transmit.” (Makoto)</p><br/><p>“I…” (Haruka)</p><br/><p>“The best end would have been for me to kill you, or die together with me. You were wishing for that kind of end.” (Makoto)</p><br/><p>“…..”</p><br/><p>“Even if the charm has been undone, the past won’t change. The lives that you robbed away from others under your love for Tomoki; the inhyuman actions and attitude you continued taking towards the people that you should have truly treasured; those kind of things cannot be taken back. You simply regained sanity while maintaining those memories.” (Makoto)</p><br/><p>It is way too cruel.</p><br/><p>In the time that one is under the effects of the charm, the things that one does vary from person to person, but they are all to the point that would make one fall into despair and want to kill themselves.</p><br/><p>It is on a level that killing them would actually be an act of mercy.</p><br/><p>Is what I said, but in regards to this…there was no answer from Haruka-san.</p><br/><p>Instead of that, I felt that an overwhelming mass of water power was being compressed inside of her, and while being knitted, it was about to come out of her body.</p><br/><p>There was a slight feeling of resistance from the Water Spirit as well.</p><br/><p>But right now, Haruka-san is the one who possesses all the rights in her body.</p><br/><p>Looks like it has hostility towards me and is trying to give advice to Haruka-san, but it seems like it can’t force anything.</p><br/><p>But the fact that she is able to properly utilize that power made me feel the hyuman potential.</p><br/><p>Though, it may have something to do with her being familiar with the usage of the Hyakki Yakko that is related to summoning.</p><br/><p>Even so…it really makes me see the incredible potential that the magic category of summoning has.</p><br/><p>It might be because I am only seeing abnormally strong people like Azu-san and Haruka-san though… Yeah, when this is over, let’s consider consulting this with Shiki in whether to add this in the classes of Jin and the others.</p><br/><p>“No way. This is the power of the Spirit —no, this is a combination of the Spirit power and the Hyakki Yakko…” (Makoto)</p><br/><p>While I was thinking about the new theme of the class, 6 things that look like weirdly-shaped ice shields had appeared between me and Haruka-san.</p><br/><p>For a second, I thought that she had managed to do Creation by utilizing the magic power of a Spirit, but…that wasn’t the case.</p><br/><p>Calling Ayakashis that had good compatibility with water or ice, make them the core, and project them as equipment with the thick Spirit power.</p><br/><p>I-I feel like it is more advanced than my Magic Armor.</p><br/><p>No well, the Magic Armor is useful even until now, you know? I have no regrets in the time I spend to master it.</p><br/><p>But you know, it took me a whole summer, and yet…she did it on the moment?</p><br/><p>Even though she showed off coordination with skills and magic that overflowed ability… I see…she can do those kind of things in the spur of the moment huh~.</p><br/><p>“There’s already nothing to say to you. Just break!” (Haruka)</p><br/><p>Even if you tell me that with teary eyes…!</p><br/><p>Six shields and two naginatas.</p><br/><p>A close combat expert is using an 8 wielding style to approach a long-ranged type like me, and even though she doesn’t want to die, she has decided to die, and yet, she shows no hesitation!</p><br/><p>I don’t understand!</p><br/><p>No matter how I think about it, there’s no way those shields are simply shields.</p><br/><p>I change my clothes to red and try to retreat at once, but Haruka-san, as if saying she doesn’t care, mindlessly chased me.</p><br/><p>I keep the apparent-death needle that I had created and is in between the index and middle finger of my right hand, and for now, I try shooting the standby bridds against the six shields to see what happens.</p><br/><p>Welp, their directions were bended.</p><br/><p>The six Bridds didn’t hit the shields and flew towards who-knows-where as if avoiding Haruka-san. </p><br/><p>Then, next.</p><br/><p>I concentrate on Haruka-san and one of the shields, and after confirming that they would hit the targets, I once again release bridds.</p><br/><p>The power is a bit higher than the Moon spell.</p><br/><p>If it hits, it should hurt quite a bit…probably.</p><br/><p>Now then…</p><br/><p>“Oi, seriously?” (Makoto)</p><br/><p>In terms of results, both failed.</p><br/><p>The bridd that hit the shield broke in an instant and became glittering rubbish.</p><br/><p>It was probably frozen and broken.</p><br/><p>Well, that one’s fine.</p><br/><p>The problem is the one that was aimed at Haruka-san herself.</p><br/><p>It missed…as if natural.</p><br/><p>Accurately speaking, one of the shields that I wasn’t aiming at had instantly exchanged places with Haruka-san, and the bridd headed towards it and was deviated.</p><br/><p>Of course, after that, it had the same fate as the other one.</p><br/><p>It broke and turned into sparkles.</p><br/><p>…Tch.</p><br/><p>“Kgh.”</p><br/><p>“……”</p><br/><p>I am up and Haruka-san is down.</p><br/><p>If I were to attack in this positioning and the attacks are deviated, it might create damage to the city.</p><br/><p>But ending it with other methods…would not be amusing.</p><br/><p>It is not amusing that I certainly pictured that it would hit, and yet, it missed!</p><br/><p>To hell with those shields!</p><br/><p>I harden the magic power close to my hand and spin once. And just like that, I use that hardened area as a foothold and kick it real hard.</p><br/><p>In response to me trying to close the distance, Haruka-san deploys the six shields as if surrounding me, and does a combination of slashes and thrusts by controlling her naginatas, but I somehow managed to move past her.</p><br/><p>The positions are now reversed, and now Haruka-san was up and I was down.</p><br/><p>With this, I can go all out in testing it.</p><br/><p>“It will only take a few seconds, so allow me to do it.” (Makoto)</p><br/><p>I make the elements go wild while maintaining their firepower high, I set the target to Haruka-san and the shields here and there, and shoot.</p><br/><p>A gatling of colorful bridds filled up the place between her and the shields that surround her.</p><br/><p>“Eh? I intended to use that to buy time and analyze my opponent but…” (Makoto)</p><br/><p>Haruka-san’s shields were crumbling one by one as they press forward.</p><br/><p>The speed of their advance has not decreased much, but at this rate, by the time they arrive to where I am, all the shields that seem to be her trump card will be gone.</p><br/><p>What’s going on?</p><br/><p>“With this…!” (Haruka)</p><br/><p>After the last shield was gone, she was now back to her original equipment, and with those naginatas, she released a technique that she had already shown.</p><br/><p>But with only this, my Magic Armor won’t crumble.</p><br/><p>Not only that…</p><br/><p>“…Your weapons…have broken.” (Makoto)</p><br/><p>“Yeah, they have served me plenty well already.” (Haruka)</p><br/><p>“What are you thinking this ti—!!!” (Makoto)</p><br/><p>My body can’t move!</p><br/><p>This is like the time when I was hit by the ultimate move of those Marikosans!</p><br/><p>I can still breath, but just what in the world…</p><br/><p>“A…seventh one?” (Makoto)</p><br/><p>At the right corner of my vision, at the place where there was nothing just a few seconds ago…there was now one of those shields.</p><br/><p>It is touching the Magic Armor that is thinly deployed.</p><br/><p>Ah.</p><br/><p>I see.</p><br/><p>The bridds that touched these shields were frozen and smashed up. But bridds normally don’t freeze.</p><br/><p>Cause it is made out of magic power after all.</p><br/><p>It doesn’t have an actual body.</p><br/><p>And yet, they managed to freeze it.</p><br/><p>In that case, it wouldn’t be strange at all for those shields to be able to affect the Magic Armor in some way.</p><br/><p>“No, it is the first one.” (Haruka)</p><br/><p>Kh.</p><br/><p>Ah, so that’s how it is.</p><br/><p>In other words, I was done the contrary of what Sofia did in the past.</p><br/><p>I don’t know if it is easy or not, but that shield can regenerate in a relatively short amount of time.</p><br/><p>Or it can fake out a crafty destruction in itself.</p><br/><p>“Meaning that, you made them close the distance, and regenerate them close to me in an instant so I can’t react to them. That’s why you abandoned those naginatas. A rush in with the resolve of being defeated.” (Makoto)</p><br/><p>As if confirming my deduction, a second and third ice shield had regenerated, and Haruka-san was now at close range, so I am currently being surrounded at quite the close distance.</p><br/><p>“Yeah. Adding to that, the reason why I used them as shields was to make you misunderstand. Because I thought that, even if this is the first time you see something, you would still try to destroy them no questions asked.” (Haruka)</p><br/><p>“…?” (Makoto)</p><br/><p>Make me think…they are shields?</p><br/><p>At that moment, it clicked.</p><br/><p>Looks like…I have finished buying time.</p><br/><p>“I probably…no, most likely no one in this world is able to kill you. In that case, there’s only one way to finish the existence called Raidou.” (Haruka)</p><br/><p>“These are not shieldss but…coffins huh.” (Makoto)</p><br/><p>“It may have been for a short moment, but this is the best method I could pull by using all my strength and the strength of the Water Spirit-sama. Now Raidou, let’s rot together.” (Haruka)</p><br/><p>“So sealing was your—!” (Makoto)</p><br/><p>“Six Ice Coffins, open!!” (Haruka)</p><br/><p>Luckily, it is not as if my magic has been sealed.</p><br/><p>I can’t move or undo the Magic Armor and it is sealing my own movements as well.</p><br/><p>Too bad.</p><br/><p>I still have teleportation magic.</p><br/><p>With the spell that I am familiar with as much as bridd, I set the coordinates to the back of Haruka-san, and activate teleportation.</p><br/><p>“…..Oi oi.” (Makoto)</p><br/><p>But my familiar spell didn’t activate.</p><br/><p>“If it is teleportation magic, the Water Spirit-sama was looking out for the spell formation, and has completely sealed it. It is pointless.” (Haruka)</p><br/><p>Since when…</p><br/><p>The presence of the Water Spirit inside Haruka-san has disappeared.</p><br/><p>They have one upped me here.</p><br/><p>“Hah…” (Makoto)</p><br/><p>“Iroha, this mother of yours, please…” (Haruka)</p><br/><p>Maybe she took my sigh as resignation, Haruka-san began to send words towards Iroha-chan.</p><br/><p>They did read a part of my cards, but my sigh actually meant that it was great that this was all they have done.</p><br/><p>In other words, they haven’t taken into account what comes further beyond.</p><br/><p>That maybe there’s more left.</p><br/><p>“……Eh?”</p><br/><p>I look at Haruka-san and the six open coffins.</p><br/><p>In my hand, there’s…Azusa.</p><br/><p>Because I understood that the strength of my magic was lacking to destroy those coffins.</p><br/><p>While I was buying time and was picturing myself ‘shooting through’ them, I learned about them.</p><br/><p>A distance of around ten meters was opened between her and me.</p><br/><p>Haruka-san’s face was dyed in surprise.</p><br/><p>Her eyes were wide open.</p><br/><p>The method was simple.</p><br/><p>I have two means for teleportation.</p><br/><p>One is teleportation through magic.</p><br/><p>And the other is teleportation using the mist of Tomoe. This one is not even magic.</p><br/><p>If I had to categorize it, I would say it is more of a skill. There’s no way the Spirit who dealt with the magic formation and aria of the teleportation would be able to deal with this.</p><br/><p>As a result, I was able to escape from the encirclement of coffins.</p><br/><p>Now then, first, the coffins that are tired from the Spirit power.</p><br/><p>The next moment the arrows leave my hand, they didn’t draw an arc and were already penetrated in the six ice coffins.</p><br/><p>Three coffins sealed the body, and the remaining three sealed time; these fearsome tools crumble this time for sure, and in time, the six Ayakashis that were pierced by the arrows fell to the ground.</p><br/><p>“…”</p><br/><p>“…”</p><br/><p>‘Just like this, I will use Azusa to…’, is what crossed my mind for a moment.</p><br/><p>That’s most likely the second wish of hers after all.</p><br/><p>But that’s not the good choice for the future of the Kuzunoha Company and for this city.</p><br/><p>It would only serve as self-satisfaction between me and her.</p><br/><p>That’s why…</p><br/><p>I once again create a needle from my fingers.</p><br/><p>It is a bit long and thick to call it a needle, but this is how it turned out due to how I pictured it.</p><br/><p>I raise my right hand overhead silently and set my aim.</p><br/><p>Haruka-san didn’t move.</p><br/><p>I swung down my hand aimed at her.</p><br/><p>“Kh—ah…” (Haruka)</p><br/><p>Letting out that short groan, Haruka-san, who had a needle piercing her forehead, fell down as if she were a doll with her strings cut.</p><br/><p>I used the apparent-death needle like a kunai.</p><br/><p>At first, I was thinking about finishing everything with these needles without using Azusa though.</p><br/><p>Looks like I was pushed by her tenacity in an unexpected way.</p><br/><p>“Hah… I want to take a hot bath…” (Makoto)</p><br/><p>I would feel bad for Haruka-san if she were to crash onto the ground.</p><br/><p>I held down my urge to have a bath…and land at her falling point beforehand.</p><br/><p>“Welcome back, Waka.” (Tomoe)</p><br/><p>“Thank you for your hard work, Waka-sama.” (Mio)</p><br/><p>“I am back, you two, and also Jin and the others. Looks like everyone is safe. Great to see that.” (Makoto)</p><br/><p>I respond to Tomoe and Mio who welcomed me back, and not long after, catch the falling Haruka-san in a princess carry.</p><br/><p>Seeing that state, Iroha-chan was, as expected, showing a pained expression.</p><br/><p>She didn’t avert her eyes though.</p><br/><p>“It is okay, Iroha-chan. I hit her with the blunt side. She can wake back up the same as her other comrades.” (Makoto)</p><br/><p>“Even though she has a thick needle pierced in her head? Please don’t joke around.” (Iroha)</p><br/><p>It has been a while since we have had a conversation, and I even gave her good news, and yet, she gave back a bitter response.</p><br/><p>She was holding tightly the hand of Izumo with teary eyes, and it was clear to everyone that she was doing her best to act like a princess.</p><br/><p>“It is the truth. Hey, uhm…Kougetsu-san, right?” (Makoto)</p><br/><p>“Eh? A-Ah, yes! Princess Iroha, the other people who are in the same state as her are simply in a state of apparent death. Thus, Haruka-sama should still be alive.” (Kougetsu)</p><br/><p>When I ask for the help of Kougetsu-san who had been resurrected by Tomoe and had him secure the charmed group, he immediately caught on in what I wanted and followed up on my explanation.</p><br/><p>He is an unexpectedly good guy.</p><br/><p>“…It is…true. She is breathing.” (Iroha)</p><br/><p>A voice of relief.</p><br/><p>But big tears were forming at the corner of her eyes.</p><br/><p>Too late huh.</p><br/><p>Well, it is good to cry to your heart’s content.</p><br/><p>It is such a crazy night after all.</p><br/><p>She must have taken in way too much already.</p><br/><p>That’s why I want to take a bath as soon as possible.</p><br/><p>And then, not long after, Iroha-chan began to cry loudly.</p><br/><p>Iroha-chan and her group, Jin and his group, Kougetsu-san, and us; it was only after a good while later that we were able to leave that place.</p><br/><p>And in this way, the long long night in Lorel had come to an end.</p><br/>\n</div>"}