{"title": "Extra 34: Manga SS – Tomoe’s training journey and a Crab", "id": 322, "volume": 4, "url": "http://boxnovel.org/tsuki-ga-michibiku-isekai-douchuu-extra-34-manga-ss-%E2%80%93-tomoe%E2%80%99s-training-journey-and-a-crab", "volume_title": "Volume 4", "body": "<h1>Extra 34: Manga SS – Tomoe’s training journey and a Crab</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Extra 34: Manga SS – Tomoe’s training journey and a Crab</p><br/><p>TLN: This is a complementary story with the chapter 17 of the manga, or so it says…but I would say it is actually chapter 20.</p><br/><p>And all extras with ‘Manga SS’ in them are exactly that, manga side stories, meaning they are from very early stages of the story.</p><br/><p>“What-ja. You only got numbers going for ya? It has been a while since pipsqueaks have tried to go against me, so I ended up expecting something.” (Tomoe)</p><br/><p>A wasteland that is called the World’s Border and is considered one of the most dangerous places in the world.</p><br/><p>For some reason, a woman was standing there in the middle of a pile of corpses, sweeping away the stains in her sword.</p><br/><p>“Hm…If I remember correctly, aren’t they called Red Bees? I think I defeated the boss of this swarm…” (Tomoe)</p><br/><p>The woman looked at a part of the corpses, and steps on one of the corpses that is specially bigger than the others.</p><br/><p>Her opponents were indeed Red Bees, which are big insect mamonos.</p><br/><p>The one she was nudging with her leg is a Red Bee Queen.</p><br/><p>It is normally at the deepest parts of the swarm making it difficult to encounter.</p><br/><p>“From what I know, the ones doing the hunting outside should be the soldiers. Are there instances where the whole hive goes hunting?” (Tomoe)</p><br/><p>The Red Bees are the kind of mamonos that have their danger level change heavily depending on the size of the hive.</p><br/><p>When many are encountered at once, unless they are adventurers who are incredibly skilled or have their own circumstances, the normal decision is to escape.</p><br/><p>But Tomoe is not only on a whole different plane from adventurers, her very existence is different. She was a peak existence within dragons before she had decided to have Makoto as her master after all.</p><br/><p>Even if the whole hive of Red Bees were to attack, counting the Queen, it wouldn’t even be a challenge.</p><br/><p>She could crush them all with just brute force swordsmanship without the need to use techniques or skills.</p><br/><p>Of course, without damaging the clothes she likes.</p><br/><p>“…Fumu, now that I think about it, I practically have no meetings with enemies that prove challenging. If this incident was caused because these guys were being chased and attacked me due to being cornered…” (Tomoe)</p><br/><p>Right in the middle of the wasteland where even surviving is difficult, Tomoe was smiling all in her lonesome.</p><br/><p>And then, she looks at the direction where the insects had come from.</p><br/><p>“There might be an interesting one. I have to catch up with Mio quickly, but well, it is not as if I am inferior to her in actual ability, it is just that this weird number called level is lower than that of hers though.” (Tomoe)</p><br/><p>For some reason, she was making excuses by herself.</p><br/><p>Tomoe had sheathed her sword and ran looking forward to this supposed strong opponent.</p><br/><p>She abandoned the corpses that would easily be enough to afford a two story house if gathered properly as if they were nothing.</p><br/><p>“In the first place, Waka’s level being one is the very proof that such a number is a deception, but if I think of this as a training journey, it does feel fun. I have gotten pretty used to using a katana too.” (Tomoe)</p><br/><p>Tomoe touches in glee the sheathed single-edged sword that she plans on having as her trusty weapon.</p><br/><p>A katana.</p><br/><p>Right now, it is simply a prototype that the dwarves made though.</p><br/><p>An ivy that was approaching her at fast speed had frozen in place with a single glare of hers and was blown away.</p><br/><p>That ivy normally aims for prey that is alone or is sleeping. It is a creature that one has to be on alert for in the wasteland.</p><br/><p>Even when the real body that is the bulb lives underground, it can dig through the ground like a mole and move. It is one of the species that usually wipes out parties, considered an Adventurer Killer.</p><br/><p>There’s many an adventurer that get attacked by them at night and have had their life end there.</p><br/><p>“If I were to hunt the same stuff as Mio -as that spider-, would I level 500 to 600 levels? I was still in the middle of the third arc of Yatsushiro Shogun, and Waka had just recently recommended me the Tokaido arc of Koumon-sama, and yet…” (Tomoe)</p><br/><p>Tomoe continued running deftly at a speed faster than riding a horse.</p><br/><p>Inside her head, there wasn’t a single shred of fear in regards to the dangers of the wasteland.</p><br/><p>She was thinking about easily finishing this training journey that his master had told her about before.</p><br/><p>It was clear that she didn’t believe that strength was equal to level.</p><br/><p>And in reality, Tomoe doesn’t think that she would lose to Mio if they were to have an all-out fight, and she doesn’t think she would be able to win against Makoto even if he is level 1.</p><br/><p>While she was rambling, a number of mamonos camouflaging as different shaped rocks attacked Tomoe all at once.</p><br/><p>They had sharp claws and fangs, and were covered in scales similar in texture to stone, and had a look similar to that of crocodiles.</p><br/><p>At the end of their tails, they also have some sort of needle used for attacks resembling that of scorpions.</p><br/><p>It was a complete surprise attack.</p><br/><p>But Tomoe used a punch and kick to deal with two of them that rushed first, and after that, she unsheated her sword and went by cutting them down with one slash.</p><br/><p>Even those scales that clearly had high defensive capability were powerless against Tomoe.</p><br/><p>It didn’t take long to trample down those pitiful creatures, but Tomoe stopped her feet in place without running on just like the time with the ivy.</p><br/><p>Crocodile</p><br/><p>“…What’s with these guys? I don’t remember there being mamonos like these. Hmmm…” (Tomoe)</p><br/><p>She picks up one of the corpses.</p><br/><p>A whole corpse of it should be bigger than Tomoe in size, but she managed to pick them up without any difficulties as she checked them out one after another.</p><br/><p>“Someone or something has tinkered with them. I see, it would be safe to assume that those insects were running away from an opponent of this nature huh.” (Tomoe)</p><br/><p>The scales, claws, and every part of their bodies; Tomoe patted those areas, checking them out in order.</p><br/><p>“I see. They made them eat Spirits huh. Earth element…the low-ranked ones most likely. They change in this way after eating several of those Spirits that look like mini people huh. Nfufu, I don’t know who it is, but this is quite the crazy and interesting experiment here-ja na.” (Tomoe)</p><br/><p>Tomoe continues investigating the mamonos in the same fashion.</p><br/><p>“Hoh? Even though they were artificially raised, they are different from chimeras in the fact that these guys still retain their ability to reproduce. Let’s check out the taste……Hm, let’s not. Just in case, let’s throw a few of these corpses into Asora to research them. We can check out whether they are comestible after. In the first place, these guys don’t look like they would taste good raw.” (Tomoe)</p><br/><p>Tomoe continued her investigation, but for now, stopped her hand that was grabbing a piece of meat, and looked at her surroundings.</p><br/><p>Light brown stones were strewn about here and there.</p><br/><p>A number of them were mamonos camouflaged.</p><br/><p>In other words, the place that Tomoe was standing in was already incredibly dangerous, but the mamonos, that had their comrades defeated easily, didn’t attack immediately, and Tomoe didn’t show signs of being bothered by the current situation.</p><br/><p>Within that strange state of things, Tomoe showed the best smile of the day as she raised her head and looked up.</p><br/><p>“It must be this one-ja na. The ruler around this area. It is quite big. And it looks like it has been tinkered in a different way from the pseudo-lizards here.” (Tomoe)</p><br/><p>Her gaze was directed at a massive rock that was creating a big shadow.</p><br/><p>No, it is a mamono camouflaged as a massive rock.</p><br/><p>“It doesn’t matter if you are or not the one who caused the abnormal behaviour of the Red Bees. Simply rejoice that you will become a stepping stone towards my first training journey!” (Tomoe)</p><br/><p>Even when she understood that it is a mamono, Tomoe charged towards the massive rock with katana in hand.</p><br/><p>She was truly like a maddened warrior.</p><br/><p>On the other hand, the mamono noticed that it was in danger, so it undid its camouflage and showed its real form as it made the ground tremble.</p><br/><p>The giant mass of stone had opened up from the middle, and two eyeballs were visible close to the ends of it.</p><br/><p>From the sides, four pairs of legs spread out and supported its giant body.</p><br/><p>Aside from those eight legs, there’s also a characteristic extremity of it that resembled that of a giant scissor, and using that, it tried to attack Tomoe.</p><br/><p>It was a strange-looking mamono that differed from the crocodile-looking ones.</p><br/><p>The scissor attack was by no means fast, but seeing that figure of it, Tomoe had stopped her movements for an instant, and the attack of the mamono made a direct hit on her.</p><br/><p>She was blown away and fell on her knees.</p><br/><p>But…there was a hand in between where the quite heavy scissor was and Tomoe, so this showed that she at least managed to defend against it.</p><br/><p>“Giuuuuiii!!”</p><br/><p>“…”</p><br/><p>The giant mamono makes the air tremble with a strange cry.</p><br/><p>It is a roar that showed its will to battle.</p><br/><p>Even so, Tomoe didn’t show any signs of faltering. She silently brushes away the dirt from her clothes and raised her face.</p><br/><p>“O-Ooooooh!! Isn’t that a c-crab?!” (Tomoe)</p><br/><p>She didn’t show any pain towards the attack she received, or anger, and didn’t return a roar against it.</p><br/><p>Her eyes and expression were filled completely with happiness and excitement as she shouted.</p><br/><p>It was a mystery whether she had received damage or not, but at the very least, there’s doesn’t seem to be any effects from blocking those giant pincers.</p><br/><p>“I saw it! I certainly did! Your meat dipped inside a nabe in a warm household with cold snow dancing at the outside!! You are a crab-ja!!” (Tomoe)</p><br/><p>“???”</p><br/><p>“Are you a red king crab? A snow crab? A hanasaki crab? Ei, it doesn’t matter which you are! The meat in your pincers, every bit of paste in your shell; I will bring it all to Asora!!” (Tomoe)</p><br/><p>“Ugiii?!”</p><br/><p>“Kufufufufu. Ready your blade —- I-Itadakimasu-jaaaaa!!” (Tomoe)</p><br/><p>Within the quite aggressive land crab types, there’s one that’s named Gran Crab.</p><br/><p>It is omnivorous, and eats grass, insects, animals, and even attacks mamonos without any distinction. It is quite the powerful mamono.</p><br/><p>There’s stories telling of it being a delicacy, but there’s few alive in the present who have tasted it and can confirm it. </p><br/><p>This one resembles the Gran Crab quite a lot, but it has far superior defensive and offensive power, as well as size. It is the one standing at the top of the food chain in an area of the wasteland…..or at least, it was standing until yesterday…</p><br/><p>Crab</p><br/><p>◇◆◇◆◇◆◇◆◇◆◇◆◇◆◇◆</p><br/><p>“This is…a crab huh. It is a delicacy-ja na.” (Tomoe)</p><br/><p>“Yes. It takes away my words. It is without doubt splendid. It is delicious.”</p><br/><p>“Umu, umu.”</p><br/><p>“…”</p><br/><p>Tomoe had put a stop to her training after the appearance of a crab, and returned to Asora. Right after, she pushed the preparation of it and checked the taste.</p><br/><p>Leaving aside whether it is the exact same taste as the ones that the people in period dramas enjoy, the Gran Crab that has been prepared by the hands of someone was truly delicious. Tomoe and the lucky Orcs and Mist Lizards that were at that place were munching on the mountain of crab meat.</p><br/><p>Tomoe was enjoying the meal speaking out only few words, and there’s also the people that are participating in cooking the crab.</p><br/><p>With its size, even when it is only one, there was plenty enough for everyone.</p><br/><p>Everyone thought that it was worth the struggle against the heavy and tough shell.</p><br/><p>“T-Tomoe-sama!!”</p><br/><p>“What is it at such a time-ja?” (Tomoe)</p><br/><p>At that moment, a single Orc ran there with a message.</p><br/><p>Even when Tomoe ignored it by saying in thought transmission that it is bothering her meal, the Orc pushed on. It must be an emergency the Orc wanted to relay no matter what.</p><br/><p>“Hah…Hah… Ema told me to relay this to you as soon as possible!”</p><br/><p>He must have been running at full-speed. He hurried his report even while he was trying to catch his breath.</p><br/><p>“Now now, calm down. Eat this first—” (Tomoe)</p><br/><p>“Reporting! For a while now, Mio-sama has been sighted going around Tomoe-sama’s records in Waka-sama’s memory warehouse—”</p><br/><p>“W-Whaaaat?!” (Tomoe)</p><br/><p>Tomoe wastefully spurts out the crab meat in the middle of the report, and then, looks at a certain direction where the place that could be basically called a national treasury was lying, and instantly teleported.</p><br/><p>Waka-sama’s memory warehouse; Tomoe’s records…</p><br/><p>Those are the memories that Tomoe had scooped out from Misumi Makoto, and had carefully, reaaally carefully piled up, produced, and edited… It is the place where the period dramas and other memories of Makoto, as well as a variety of information, are stored.</p><br/><p>“I won’t let you, Mio!! That’s by no means food!!” (Tomoe)</p><br/><p>That’s right, Tomoe’s roar had resonated just a few seconds after the report.</p><br/>\n</div>"}