{"title": "Chapter 3", "id": 3, "volume": 1, "url": "http://boxnovel.org/game-loading-chapter-3", "volume_title": "Volume 1", "body": "<h1>Chapter 3</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Love Left or Right 3</p><hr/><br/><p>Xie Xi, “…”</p><br/><p>What was this mess? If he hadn’t been accustomed to controlling his expression then the disdain on the face of ‘Small Sein’ would surely piece the vampire’s heart like a cross.</p><br/><p>“Are you shy?” The silver-haired man’s brain circuits weren’t like a mortal’s. “Small Sein is really cute.”</p><br/><p>Xie Xi couldn’t help saying, “Put me down.”</p><br/><p>“Don’t be so cold.” The silver-haired man blinked his red eyes. “I haven’t seen you in half a month. Baby really doesn’t want me?”</p><br/><p>Xie Xi’s goose bumps must’ve missed him very much. They were so happy!</p><br/><p>“Are you angry?” The silver-haired man coaxed him. “Is it because I disappeared for half a month?”</p><br/><p>Xie Xi, “…” It was great. He didn’t have to talk and the other person helped fill in the setting.</p><br/><p>“Baby, don’t be angry.” He bent over as his spoke, crimson eyes overflowing with affection as he stared at Xie Xi. Words of love flowed out, “I will stay by your side every day and only watch you. I will only look at you and only love you.”</p><br/><p>Xie Xi’s heart tightened as he got a bad feeling. Sure enough, the silver-hair descended and the man wanted to kiss him…</p><br/><p>“Don’t.” Xie Xi reached out and pushed him away.</p><br/><p>Due to his refusal, there was a chill in the surrounding area. The heavy curtains blew despite there being no wind and the candlelight next to the bed started to shake. The originally warm room became like an ice cellar and the man in front of him was as cold as an ice sculpture.</p><br/><p>It was broken.</p><br/><p>Xie Xi knew he had done something wrong but how could he accept a man’s kiss? If he spat out these words then the consequences would be even worse.</p><br/><p>“I…” Xie Xi trembled with nervousness. His eyes shook as he bit his lips, unsure of what to say.</p><br/><p>This appearance entered the silver-haired man’s eyes and became cute.</p><br/><p>In an instant, the ice melted and the silver-haired man glowed with enthusiasm. “I missed you too much.” His fingers gently touched Xie Xi’s chin. “I forgot about the rules.”</p><br/><p>There were rules between them?</p><br/><p>Xie Xi made countless associations in this moment. This man was 80% the legendary vampire. His red eyes weren’t human, he appeared out of thin air and the cold from his body was very abnormal.</p><br/><p>Then was he the vampire who killed Gars’ brother in the newspaper? If so, this would be too complicated!</p><br/><p>Of course, whether he was or not, this vampire and Sein Hall were inextricably linked. Was he a lover? Prey? Or was Sein unable to resist? It was hard to say.</p><br/><p>Xie Xi didn’t want to anger this man. For the sake of living seven days, this silver-haired vampire was definitely the main variable and needed to be guarded against.</p><br/><p>Xie Xi nodded at his words with an awkward expression.</p><br/><p>The silver-haired vampire smiled. “Small Sein, don’t be afraid. I have been waiting for a long time. This short time isn’t so bad.”</p><br/><p>Xie Xi sighed with relief, knowing he barely fooled this person.</p><br/><p>Then there were gentle footsteps outside the door and the vampire reluctantly said, “I will go back first.”</p><br/><p>Xie Xi wanted him to leave immediately. “Okay.”</p><br/><p>The silver-haired vampire took his hand and kissed the back of it. “Baby, don’t forget our deal.”</p><br/><p>Deal? Xie Xi knew a ghost’s deal!</p><br/><p>“Yes.” Xie Xi nodded, trying to get rid of this person first.</p><br/><p>Childish joy appeared on the vampire’s face and his voice became more ambiguous. “Small Sein, I really want to take you now…” Then he seemed afraid of scaring Xie Xi and changed his words. “Well, I will wait for you.”</p><br/><p>Xie Xi, “…”</p><br/><p>He probably didn’t want to be seen. As soon as the footsteps neared the door, the silver-haired man disappeared as abruptly as he appeared.</p><br/><p>Xie Xie Xi sighed and his tight muscles relaxed when he saw Randy.</p><br/><p>Randy held a candlestick in his hand and saw that Xie Xi was still awake. “Young Master, can’t you sleep?”</p><br/><p>Xie Xi rubbed his eyes. “I had a dream.”</p><br/><p>Randy put down the candlestick and sat next to the bed in a distressed manner. “Don’t be afraid. The things in the dream are fake.”</p><br/><p>Dreams were fake but reality was real. Xie Xi was afraid that the vampire would come back and asked, “Randy, can you accompany me tonight?” If there was an outsider then they shouldn’t appear.</p><br/><p>The housekeeper was slightly startled. His blue eyes narrowed and his voice became much lower. “How can I stay in Young Master’s bedroom with my cheap identity…”</p><br/><p>Xie Xi persuaded him, “If you are here then I will feel safer.”</p><br/><p>The words ignited a flame in Randy’s eyes. His always neat demeanor seemed a bit messy as his tone of speech changed. “Young Master…” His voice was extremely tight. “You are a well-deserved angel.”</p><br/><p>Xie Xi who just wanted someone to accompany him in case of the vampire’s night attack, “?”</p><br/><p>The next second, the housekeeper returned to normal and sighed. “Young Master, go to sleep. I will be here to guard against all nightmares and troubles.”</p><br/><p>Xie Xi wanted to say that the bed was big and it would be good to sleep together. Then he thought of the housekeeper’s stunned appearance just now and didn’t say it.</p><br/><p>It was just… the class hierarchy was strict and he shouldn’t make another mistake.</p><br/><p>Xie Xi retreated under the covers and closed his eyes, but he didn’t immediately fall asleep.</p><br/><p>He used to lie in bed every day, recalling what happened during the day. In the past, he just remembered the game and how much income he earned. Today, he remembered too much.</p><br/><p>Xie Su was pregnant and he inexplicably entered such a realistic game. He had to achieve the mission of living for seven days.</p><br/><p>He didn’t think about Xie Su or why he came here. He was more focused on the present.</p><br/><p>The game’s name was Love to the Left or Right. The game summary was that it was a sweet love game. The person who had an emotional relationship with Sein Hall had appeared and it was the vampire.</p><br/><p>From the vampire’s words, they had known each other for a while and there were even rules. He could guess one of the rules. There would be nothing intimate until a certain moment. Then what was the deal? He didn’t know.</p><br/><p>Xie Xi analyzed it seriously and came up with a possibility Did he have to stick with the vampire for seven days to survive? If he refused, would he be killed? Was this a multiple choice problem for his survival?</p><br/><p>Xie Xi felt it was deeply malicious. In fact, he was still seriously underestimating it…</p><br/><p>Xie Xi thought seriously about how to complete the mission. He didn’t know that beside the bed, the housekeeper he had placed his trust in was staring at him with deep obsession.</p><br/><p>“Young Master, you are so noble and sacred.” The housekeeper leaned over and kissed him on the back of his white hand. “How fortunate am I to be favoured by you?”</p><br/><p>If Xie Xi hadn’t fallen asleep early then he would’ve definitely re-examined his ‘loyal’ housekeeper.</p><br/><p>The next day, Xie Xi opened his eyes and found that the small text in the lower right corner had become: [Mission Progress: the second day.</p><br/><p>Well… he managed to survive one day.</p><br/><p>Randy had stayed here overnight so he personally served Xie Xi in the morning to wash up and dress. Xie Xi wasn’t used to being exposed but if he tried to put on the clothes himself then he would probably be stuck here all day.</p><br/><p>Fortunately, Randy’s movements were light and there were no extra touches, so he quickly dressed.</p><br/><p>Today’s clothes were different from yesterday’s but the style was similar. It was a gorgeous white shirt with complicated ornaments and a lace hat. In addition, there was the slender boots and jewelry that other girls would like.</p><br/><p>Xie Xi had some deficits when it came to aesthetics. He didn’t distinguish between beauty and ugliness. He just found things pleasing to the eye or not pleasing to the eye. For his own appearance, the evaluation was 100% not pleasing.</p><br/><p>Randy sincerely praised him. “Young Master is a natural aristocrat and is born for these clothes.”</p><br/><p>Xie Xi, “…” Forget it, he was only here for seven days and didn’t need to care about the details.</p><br/><p>There was a music class in the morning. Xie Xi had been afraid of revealing himself when he saw the old piano but fortunately, the body still had its memories. His fingers were placed on the keys and he spontaneously played a beautiful song.</p><br/><p>The music teacher praised him for an hour and the class finally finished.</p><br/><p>After class, the housekeeper told him, “The Earl of Aix-en sent an invitation for you to dine together at noon.”</p><br/><p>Earl X? Who was this again?</p><br/><p>Xie Xi didn’t want to go but was worried there would be some surprises if he didn’t go.</p><br/><p>Randy saw his hesitation and suppressed the heat in his eyes as he asked, “You don’t want to go?”</p><br/><p>Xie Xi turned to look at him. “Can I not go?”</p><br/><p>He was asking his housekeeper for advice. To his surprise, Randy couldn’t hide his excitement. His thin lips trembled as he replied in a hoarse voice, “Young Master has the right to refuse anyone.”</p><br/><p>Xie Xi was aware of something strange and asked, “Really?”</p><br/><p>Randy solemnly told him, “If you don’t like anything then you don’t have to do it.”</p><br/><p>This was the case… Xie Xi seriously thought about it and finally decided not to go.</p><br/><p>He only wanted to stay in the cast for seven days and was unwilling to cross the boundaries.</p><br/><p>“Then I won’t go.” Xie Xi replied.</p><br/><p>Randy’s eyes lit up as he excitedly said, “Then I will go tell…”</p><br/><p>The housekeeper left and Xie Xi was alone in the huge garden. He unexpectedly felt a bit cold. It was early spring and he wore so much clothing. How could he feel cold?</p><br/><p>Was it an illusion? Xie Xi soon felt a piercingly cold wind.</p><br/><p>He looked up and found that the sky had changed. The midday sun was covered by thick clouds, an evil wind was blowing and the flowers in the garden lost their brilliance. Even the grass was frosted over.</p><br/><p>“Why refuse?” A gloomy voice was heard and the silver-haired man appeared out of thin air. He was wearing a dark cloak and his white face was bloodless. The only colour came from his red eyes and blood red mouth.</p><br/><p>“Don’t you want to be with me?” The vampire smiled sweetly. “How come? How can my small Sein not want to be with me?’</p><br/><p>His words finished and a silver bow appeared in his head.</p><br/><p>Xie Xi’s eyes widened as the arrow left the bow and pierced him in the heart.</p><br/><p>The silver-haired vampire held the blood-covered Xie Xi and whispered, “Small Sein, you can only be mine.”</p><br/><p>Xie Xi, “…”</p><br/><p>There was on pain at all. It was just too embarrassing!</p><br/><p>What was this situation? How could the vampire kill someone without letting them say anything? Refuse him? When was he refused? Was the silver-haired vampire the earl of Aix-en? Xie Xi just didn’t go to eat so why kill him?</p><br/><p>The privilege chosen by Xie Xi was that fatal wounds would be painless. Therefore, he couldn’t feel any pain despite his heart being pierced. Then another tip appeared in the lower right corner. [Please load the file as soon as possible. This body won’t be able to load the file after it has completely died.]</p><br/><p>Xie Xi couldn’t afford to delay and chose to load the file.</p><br/><p>[Do you want to read the file from the nearest point in time?]</p><br/><p>Xie Xi: Yes.</p><br/><p>Then Xie Xi returned to 20 minutes ago. The voice of the housekeeper Randy rang in his eyes. “The Earl of Aix-en sent an invitation for you to dine together at noon.”</p><br/><p>Xie Xi, “…” H-He would go!</p><br/><p>Randy stared at him and asked, “Are you going?”</p><br/><p>How could he not go? Xie Xi knew that this was an important clue to the game and nodded. “Help me arrange the carriage. I…”</p><br/><p>“You want to go?” The housekeeper asked again, his tone a bit tense.</p><br/><p>Xie Xi was keenly aware of the tightness in the air. He turned and found that the housekeeper’s blue eyes had become dark, like an abyss of despair was stirring.</p><br/><p>Xie Xi, “…”</p><br/><p>“You are going to see him.” The housekeeper Randy smiled bitterly. “You really love him.”</p><br/><p>Xie Xi, “!!!” What was this situation now?</p><br/><p>Randy approached him, his voice gentle but his expression extremely crazy. “Why is an angel lik you tempted by the devil?”</p><br/><p>Xie Xi opened his mouth only to feel the cold blade at his neck.</p><br/><p>The next moment, he saw his body.</p><br/><p>The housekeeper hugged his decapitated head and kissed his forehead affectionately. “If you are doomed to fall then this is better…”</p><br/>\n</div>"}