{"title": "Chapter 15", "id": 15, "volume": 1, "url": "http://boxnovel.org/game-loading-chapter-15", "volume_title": "Volume 1", "body": "<h1>Chapter 15</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Yunge</p><hr/><br/><p>The water curtain started to replay the world’s story.</p><br/><p>Xie Xi knew the actual situation and didn’t want to watch it.</p><br/><p>Zhong Jin told him, “Don’t waste this once in a lifetime opportunity. A world story is very important, especially the rare S-grade world!”</p><br/><p>Xie Xi wondered, “Why is it important?” Could someone else enter the clear the game?</p><br/><p>Zhong Jin’s eyes never moved from the water curtain but he still patiently explained to Xie Xi, “This type of world is impossible to enter again but if you look at the plot playback, you can speculate on the difficulty of a S-grade world and also figure out the designer’s preferences!”</p><br/><p>Xie Xi, “…” The designer’s preferences? There was no need to figure it out. He could easily sum it up—a neuropath.</p><br/><p>Zhong Jin exclaimed, “Oh my god, he died!”</p><br/><p>The teenager wearing a medieval outfit was pierced in the chest with an arrow!</p><br/><p>More and more people discussed it loudly, “Is this the first day? Dying from being pierced in the heart, how painful would it be?”</p><br/><p>Another person said, “Fortunately, there is no limit on the number of times the file can be loaded.”</p><br/><p>“Still, it is painful to die this way!”</p><br/><p>Sein on the water curtain was resurrected and returned to the moment before his death. He changed his words and said he would go to the appointment. Then he lost his head.</p><br/><p>As the person, Xie Xi felt no pain because of the fatal injury privilege. Thus, the loss of his head hadn’t been too deep. Now that he saw it from the perspective of a third party, it was really shocking.</p><br/><p>His head was separated from his body and blood flowed like a waterfall. It was such a bloody scene but the housekeeper was still elegant. He held Sein’s head extremely gently and spoke like he was whispering to a lover.</p><br/><p>The onlookers spat out Xie Xi’s heart, “A neuropath!”</p><br/><p>There were also some who had strange tastes. “Don’t you think the housekeeper is a bit handsome?”</p><br/><p>“Handsome? Why don’t you go and give your head to him?”</p><br/><p>“Excuse me, farewell!” Who would want to experience having their head cut off and being pierced in the heart?</p><br/><p>Zhong Jin exclaimed, “Sure enough, it is a S-grade difficulty. He died three times as soon as he entered.” The water curtain showed how Sein was killed by both the vampire and housekeeper.</p><br/><p>Xie Xi was silent but he was confused about why the world story didn’t show the privilege he chose.</p><br/><p>This game wasn’t difficult at all when the fatal injuries were painless. It was nothing more than a few deaths and he could always find the right route. There was nothing to be afraid of when death didn’t hurt.”</p><br/><p>“Damn, this newcomer is amazing. How can he stay calm after so many deaths?”</p><br/><p>“His mental power must be strengthened. How can he bear it?”</p><br/><p>Zhong Jin saw that Xie Xi was silent and thought he was dumbfounded. Zhong Jin whispered, “In fact, the plot of this game is very difficult. It is very painful to die. Don’t look at the fact that he can load the file. The knife and arrow killed him, how can it not hurt? Reading the file can get rid of the death but the pain is still imprinted on the mind. It is easy to cause a mental breakdown.”</p><br/><p>This was especially for newcomers. They were drawn to an unknown world and were already feeling some tension and fear. If they frequently experienced death then they would probably go crazy.</p><br/><p>“This newcomer died three times yet he could still be calm after reading the file. He also found other save points in such a short period of time…”</p><br/><p>Someone next to them said, “He is calm? After loading the file, he saw the vampire again and not only was he not afraid, he was also able to flirt with the vampire!”</p><br/><p>“This newcomer isn’t afraid to be an emotional master.”</p><br/><p>The ‘emotional master’, ‘calm and wise’ and ‘strong spirit’ Xie Xi, “…”</p><br/><p>Someone screamed, “My god, the vampire is so handsome! The silver hair is too exciting!”</p><br/><p>“I think the housekeeper is more handsome! The deep, calm and hidden madness is great!”</p><br/><p>“Why do I think that little maid… damn, it is a man!”</p><br/><p>“Isn’t the name of the game Love to the Left or Right? Why is there another one?”</p><br/><p>“He died again!”</p><br/><p>“…This is really a S-grade difficulty.”</p><br/><p>The plot eased until the four people were gathered together…</p><br/><p>The whole hall was buzzing. “It’s over, the boats are overturned!”</p><br/><p>“I bet the newcomer will experience a wave of deaths.”</p><br/><p>“I bet the newcomer can use all four boats!”</p><br/><p>“I bet the newcomer will smash the scum male!”</p><br/><p>Xie Xi, “…” If he wasn’t afraid that Zhong Jin would suspect him, he would really turn away!</p><br/><p>Sein Hall finally became a demon and couldn’t kill himself. The people watching the movie let out the same laugh.</p><br/><p>“Amazing, absolutely amazing! He was killed countless times but he finally can’t die!”</p><br/><p>“I really admire him. He died so many times yet didn’t hesitate to stab himself with the knife.”</p><br/><p>“Do you see the look on his face? It is real pain!”</p><br/><p>At the end, the suicide attempts didn’t work and they weren’t fatal injuries. Thus, Xie Xi really experienced the pain of his heart being stabbed. It was painful but also good. After all, Sein Hall’s body had become that of a devil and the pain was weakened significantly.</p><br/><p>Then the task ended, the water curtain returned to normal and everyone recovered their spirits.</p><br/><p>Zhong Jin opened his mouth. “It is a S-grade difficulty. There is both physical and mental torture.”</p><br/><p>His words were acknowledged by the people around him. “Dying so many times in seven days, it would really make a person collapse. Even if your mind is strong and different from ordinary people, you will lost some judgement because you are always wary of the death that can come at any time. The secret to clearing this game is to cleverly use the four people. If you make a mistake, you will die. Once you die, your mentality will collapse and you will continue to lose your judgment ability. This is a vicious cycle.”</p><br/><p>Their words made a lot of sense. If it wasn’t for the fatal injuries being painless, Xie Xi would’ve found it hard to complete the task.</p><br/><p>Not to mention, there was still a trap buried in the privileges. If he chose the privilege to not die from a fatal injury, it would be impossible to complete the task from the beginning. Imagine dying so many times in the seven days, trying his best to get to the end, only to not be able to complete the task anyway. How desperate would a person feel?</p><br/><p>Xie Xi couldn’t figure it out. If there wasn’t the painless fatal injuries privilege, this game would be really hard. He didn’t know the difficulty of other games for the moment but based on the reactions of people in the hall, he knew this story had a high difficulty. After all, it was a novice trial and could only be cleared by newcomers. Newcomers were ordinary people. It would be extremely hard in the face of such a plot.</p><br/><p>However, he had the painless fatal injuries privilege. His three views were broken but he didn’t receive any psychological damage.</p><br/><p>Then why was it S-grade difficulty?</p><br/><p>Yan Zhe, who came back from his quasi-world, quickly watched the story and pondered on it. “Old Xie is still capable. The infusion of his soul increased the original B-grade difficulty to S-grade.”</p><br/><p>If Xie Xi heard these words then his doubts would be resolved.</p><br/><p>The reason for the S-grade difficulty was purely because Jiang Xie injected his soul into it and his soul was extremely picky. There wasn’t a match for many years, leading to this game having extremely high trigger conditions.</p><br/><p>The biggest difficulty of this game wasn’t the privilege choice, the dog blood plot or the final reversal. It was the trigger conditions.</p><br/><p>Let’s give an example.</p><br/><p>A game might be difficult but it could accommodate 1,000 people at the same time. There must be one person among the 1,000 who could clear the instance. Then the instance clearance ratio was 1/1,000th.</p><br/><p>Another game was difficult but only one person could be selected from thousands of people to enter the instance. Even if this person cleared it, the clearance ratio was 1/10,000th.</p><br/><p>This made the game extremely difficult.</p><br/><p>This threshold was one of the criterias for judging the difficulty.</p><br/><p>Of course, Xie Xie Xi didn’t know this for the moment and the onlookers didn’t know the existence of the privilege. Thus, it became a smoke bomb that covered up Jiang Xie’s soul.</p><br/><p>The dark water curtain suddenly lit up again.</p><br/><p>Large characters appeared on the water curtain.</p><br/><p>[Inviting the person who cleared Love to the Left or Right to join Yunge.]</p><br/><p>The whole hall was quiet for three seconds before boiling over.</p><br/><p>“Yunge, Yunge invited a newcomer to join!”</p><br/><p>“The newcomer’s luck is too good! He cleared the S-grade world, got a special skill and can even join Yunge!”</p><br/><p>The area around them was extremely noisy. Zhong Jin was also stunned and eventually sighed. “Really… powerful.”</p><br/><p>Xie Xi asked curiously, “What is Yunge?”</p><br/><p>Zhong Jin’s expression was complicated. “Speaking of which, have you changed your job yet?”</p><br/><p>Xie Xi didn’t know anything.</p><br/><p>Zhong Jin sighed and explained, “The Central World has three professions: explorer, collector and recorder. Depending on the profession, the tasks accepted will be different, especially when a team clears an instance.</p><br/><p>Xie Xi captured a key point. It was possible to clear the instance in a team.</p><br/><p>Zhong Jin continued the explanation. “In general, you can change jobs after completing the novice trials. As the name suggests, explorers receive mainly exploration missions. Collectors have collection tasks while recorders need to record the story, characters, etc.”</p><br/><p>Xie Xi asked, “What about a designer?”</p><br/><p>“Ah, did you see Designer X? He also started from either an explorer, collector or recorder. He cleared many worlds and had t chance to design a world after passing a test.”</p><br/><p>“However, this is about talent and not everyone has the ability to design.”</p><br/><p>Xie Xi raised an eyebrow. “That X…”</p><br/><p>“God X is a legend and the current top designer. He is the only one who can design a SS-grade world at the moment.”</p><br/><p>Xie Xi, “…” It was a bit tricky.</p><br/><p>Zhong Jin sighed again with envy. “Yunge, a newcomer who hasn’t changed professions actually got an invitation from them. It is something I can’t even dream of.”</p><br/><p>Xie Xi wanted to ask more X related things but Zhong Jin obviously cared more about Yunge. Xie Xi asked about them.</p><br/><p>“Yunge is the largest organization in this world, with the most talents. They have the most resources and the latest exploration progress. If you join, you can share these resources and progress.”</p><br/><p>Xie Xi became even more curious. “Is X in Yunge?”</p><br/><p>Zhong Jin hadn’t managed to reply when another line of words appeared on the water curtain.</p><br/><p>[Inviting the person who cleared Love to the Left or Right to join Yunge.]</p><br/><p>The hall exploded again. “It was announced twice. This is the treatment towards God X!”</p><br/><p>“But God X rejected them.”</p><br/><p>“The newcomer shouldn’t refuse if he is smart.”</p><br/><p>Xie Xi, “…” He didn’t want to join any organization but if this organization was at odds with X…</p><br/><p>Zhong Jin said quietly, “God X is a legend. He is the only person to refuse Yunge’s invitation.”</p><br/><p>The Central Garden.</p><br/><p>The silver-haired elf burst in. “Haha, Old Xie, you are finished!”</p><br/><p>The man fiddling with the rose didn’t raise his head. “Be careful not to step on my flowers.”</p><br/><p>“Your little rose is being stared at by Yunge!”</p><br/><p>The man looked up with different coloured eyes. The left eye was a deep red while the right eye was blue, forming a sharp contrast, as if fire and ice were colliding together. The extreme heat and cold intertwining seemed incredibly lazy and evil.</p><br/><p>He spoke in a careless manner, “Did he join Yunge?”</p><br/><p>Yan Zhe gloated. “Yunge sent him an invitation.”</p><br/><p>“Oh.” The man continued to touch the blooming roses.</p><br/><p>Yan Zhe wasn’t happy. “Aren’t you afraid he will say yes?”</p><br/><p>Jiang Xie’s lips curved and he didn’t say anything.</p><br/><p>Yan Zhe spoke in a resentful voice. “I advise you, don’t reveal your identity. Your little rose probably wants to kill you, damned pervert.”</p><hr/><br/><p>The author has something to say:</p><br/><p>At this moment, Old Jiang Xie hasn’t realized his crime [doge face].</p><br/><p>Looking at Jiang Xie’s eyes, he doesn’t believe that he will be hated by his wife later on.</p><br/>\n</div>"}