{"title": "Chapter 19", "id": 19, "volume": 1, "url": "http://boxnovel.org/game-loading-chapter-19", "volume_title": "Volume 1", "body": "<h1>Chapter 19</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Fairytale Town 3</p><hr/><br/><p>The sentence was short but revealed many things. Song Qi was really talented.</p><br/><p>Due to the previous world, Xie Xi had a psychological shadow against the word ‘gay’ and moved far away from Song Qi.</p><br/><p>Song Qi was quick sensitive and thought it was disliked for his perverted task. “I also don’t want to do this. The system assigned me such a task. What can I do?”</p><br/><p>Xie Xi, “…” Thinking about it, he was quite pitiful.</p><br/><p>Song Qi asked him again, “What about you? What is your main mission?”</p><br/><p>Xie Xi paused. This crybaby gay person looked harmless and pitiful and his main task was terrible, but these were all based on his words. There was no way to judge if it was the truth or not.</p><br/><p>Xie Xi had been alone for a long time and had basic vigilance towards everyone.</p><br/><p>Song Qi looked stupid but he wasn’t that foolish. He tinkered with something and Xie Xi saw a line appear in his lower right corner: [Name: Song Qi, the main mission is to collect a town girl’s underwear, has sent you a friends application.]</p><br/><p>It turned out they could prove themselves like this. Xie Xi accepted the friends application.</p><br/><p>Song Qi exclaimed, “My god, your main task is to collect the dragon heart!”</p><br/><p>Xie Xi saw his expression and wondered, “What is it?” Song Qi seemed to know something, based on his expression.</p><br/><p>Song Qi quietly explained, “My side mission is to collect a dragon heart.”</p><br/><p>Xie Xi was confused but Song Qi was still talking. “This is the blue task that I refreshed.”</p><br/><p>The main task didn’t have a rating. Whether it was collecting a dragon heart or a girl’s underwear, everyone had to complete it before leaving the game. Thus, the rating wasn’t meaningful. However, the tasks associated with the world were similar. Often, the side mission of one person would be the main mission of another person, so the rating of the main mission could be inferred.</p><br/><p>This was a D-grade world and the highest task level was only blue. Song Qi worked hard to refresh his side mission yet it turned out to be Xie Xi’s main mission.</p><br/><p>If someone’s side mission was to collect underwear then Song Qi would be able to see the grade of his main mission. There was no need to think. It was 100% grey and probably wasn’t even the lowest level white colour!</p><br/><p>The one who was harmed by the comparison, Song Qi spoke in a grievous manner, “You are so lucky…”</p><br/><p>Xie Xi couldn’t open his mouth.</p><br/><p>Song Qi asked again, “What is your side mission? What is the rating? I’m telling you, I spent a full 30,000 silver coins in order to gain the task of collecting the dragon heart!”</p><br/><p>Originally, side quests could be repeatedly refreshed. Xie Xi didn’t know this because he got the highest blue grade in the first place. The best two tasks in the game were given to him. The system automatically determined that he didn’t need to refresh the side mission and didn’t give him the prompt.</p><br/><p>Xie Xi listened to Song Qi, who had kept talking. “My first quest was to collect the stinky socks of the second child of the Wang family, the second was to collect Aunty Sun’s mace, the third…”</p><br/><p>He babbled a whole bunch. Xie Xi sympathized with him while pondering on things. Why did he feel that the collector profession was full of stupid things?</p><br/><p>“It is 300 silver coins for one attempt. I refreshed it a full 100 times before gaining the task of collecting the dragon heart…” Song Qi wanted to cry again.</p><br/><p>Xie Xi, “…”</p><br/><p>Then Song Qi exclaimed, “The 30,000 coins were given to me by a slag man as the breakup fee!”</p><br/><p>Xie Xi, “……”</p><br/><p>Song Qi couldn’t help crying like a silly dog. “Why am I so miserable?!”</p><br/><p>Xie Xi’s mouth moved but he couldn’t comfort people. He had to stay silent.</p><br/><p>Song Qi took the initiative to be abused. “Brother Xi, what is your side mission? Come and comfort me!” The two of them added each other as friends and naturally knew the other person’s name.</p><br/><p>Xie Xi hesitated for a moment.</p><br/><p>Song Qi didn’t think too much. According to the law of conservation of luck, the main task was so explosive that the side task must be rotten.”</p><br/><p>The longer Xie Xi remained silent, the more curious Song Qi became. “Is it even worse than my task of collecting underwear?”</p><br/><p>Of course not… Xie Xi thought about it and realized he probably didn’t have to say the rating. He answered, “Track the tornado.”</p><br/><p>Song Qi, “…”</p><br/><p>The next second, the little gay Song exploded. “A blue task, it is another blue task”</p><br/><p>Xie Xi wondered, “…How do you know?”</p><br/><p>Song Qi had a dazed expression on his face. “I met a buddy before who got this task. He was so proud that his tail shot up into the sky.”</p><br/><p>Xie Xi’s eyes flashed. “Did he finish it?” This task was a bit mysterious.</p><br/><p>Song Qi replied, “I don’t know… I was locked up the day after I entered the game.”</p><br/><p>The day after? Xie Xi captured the key point. “How long have you been in the game?”</p><br/><p>“Three or four days? I have been locked up so long that I’m going crazy!”</p><br/><p>Xie Xi was stunned. He had just entered the game but Song Qi had been in the game for three or four days? What was going on?</p><br/><p>Weren’t they from the same group of players? Or had players come in at different time points?</p><br/><p>Song Qi still couldn’t accept it. He asked Xie Xi, “How many coins did you spend to get the blue task?”</p><br/><p>Xie Xi didn’t want to hit him again but couldn’t lie. Xie Xi was a newcomer and only cleared one game. It stood to reason that he should only have 10 silver coins left, not enough to refresh the task.</p><br/><p>“This is the second quasi-world I entered.” Xie Xi answered vaguely.</p><br/><p>Song Qi went crazy. “You got a blue side mission for free?”</p><br/><p>Xie Xi, “…”</p><br/><p>Crybaby Song went online and his tears almost flooded the cage. “Why… why did God give birth to an unlucky person like me and a lucky person like you…” People who are better than others should die QAQ!</p><br/><p>Xie Xi then saw a prompt in the lower right corner. [If you have a good friend then you can send a team application.]</p><br/><p>Team application? Xie Xi looked at the pathetic Song Qi and sent the team application.</p><br/><p>Song Qi instantly stopped crying. Teardrops stayed at the corner of his eyes as he made a startled expression. “Brother Xi… you want to…team up with me…”</p><br/><p>Xie Xi asked, “Is it inconvenient?”</p><br/><p>“Ahhh!” Song Qi screamed. “Brother Xi, ah Emperor Xi, this younger brother won’t hesitate to follow you everywhere!”</p><br/><p>At this moment, Xie Xi knew why Song Qi was so excited. It was because teammates would share tasks.</p><br/><p>There was the team information in the lower right corner.</p><br/><p>[Temporary Team: Xie Xi, Song Qi.</p><br/><p>Team Tasks: Collect the dragon heart, track the tornado, collect the female underwear.</p><br/><p>Xie Xi, “…” Was there still time to withdraw from the team?</p><br/><p>Song Qi was moved to death. “You are my parents’ reincarnation, my saviour… I really didn’t expect a living emperor of luck to be on my team. Ohh, life is worth it!”</p><br/><p>Xie Xi slightly frowned. “Your mission…”</p><br/><p>“You can rest assured!” Song Qi hurriedly said, “I will take care of my own mission. I can’t leave the team but I will never drag you down!”</p><br/><p>Xie Xi teamed up with this person because he felt Song Qi wasn’t dangerous. In addition, he had something to ask his teammate.</p><br/><p>“Did you see other players when you entered the game?”</p><br/><p>Song Qi replied, “Of course. We landed at the same time and spent a night in the forest…”</p><br/><p>He trailed off and then reacted, “I never saw you…”</p><br/><p>Were they really from different groups of players?</p><br/><p>Xie Xi told him, “I entered the game today.”</p><br/><p>Song Qi paled. “All of my group are dead?”</p><br/><p>Xie Xi glanced at him. “Why do you say that?”</p><br/><p>“A quasi-world will re-release the task if the players mortality rate is over 80%.”</p><br/><p>Xie Xi’s brow furrowed. “It has only been three or four days yet eight people died?”</p><br/><p>Song Qi was also stunned. “Isn’t this a D-grade world? A D-grade shouldn’t be so difficult!”</p><br/><p>Xie Xi asked him another question. “What did you get caught for?”</p><br/><p>Song Qi was embarrassed. “What else could it be? It is because of stealing…”</p><br/><p>Xie Xi understood. Song Qi wasn’t familiar with stealing underwear and was arrested. Song Qi cleared his throat. “What happened outside? I have been locked up for days and don’t know anything.”</p><br/><p>Perhaps it was due to being locked up that he survived. In a sense, this damn mission saved Song Qi’s life.</p><br/><p>Xie Xi told his story. “I just arrived here when someone attacked. A player I was with died on the spot.”</p><br/><p>Song Qi was stunned. “Died on the spot? Wasn’t he wearing a uniform?”</p><br/><p>“Maybe he was immune to the fatal injury but the villagers thought he died. I was arrested by them and locked up here.”</p><br/><p>Song Qi sighed. “He must’ve been afraid of occupying his items bar and didn’t wear the uniform. Then he is dead…” He was really dead.</p><br/><p>Multiplayer games generally didn’t have the option to load a file. They had to buy items that were immune to fatal injuries, have a medicine to survive or a resurrection skill… without any of this, they were really dead.</p><br/><p>This was a game but it wasn’t a game.</p><br/><p>The two of them had just finished speaking when they heard footsteps outside.</p><br/><p>Song Qi immediately whispered. “It is the person who brings food! Brother Qi, smile at him and he will let us out!”</p><br/><p>Xie Xi stared at him. “Smile?”</p><br/><p>“That’s right!” Song Qi exclaimed. “You are so beautiful that young people won’t be able to bear it!</p><br/><p>Xie Xi, “…”</p><br/><p>Song Qi spoke with a wronged expression again. “If I had 30% of your good looks, that scum male wouldn’t have dumped me…”</p><br/><p>Xie Xi didn’t think Song Qi was ugly and told him, “Don’t undervalue yourself.”</p><br/><p>Song Qi was moved. “Brother Xi, you are really beautiful. No wonder why your luck is so good!”</p><br/><p>Xie Xi didn’t think he was good looking. Secondly, he didn’t feel he was lucky. His luck was better than ordinary people but it was limited to game related things… His life in the past 20 years hadn’t been very lucky.</p><br/><p>At this time, a young man in his early 20s came over. He was very thin, like a bamboo pole, and the linen cloth was hanging from his body.</p><br/><p>He was startled when he saw Xie Xi and then revealed a ferocious light. “Kill… I’m going to kill you!” He was holding something in his hand.</p><br/><p>Song Qi was scared to death. “A gun!”</p><br/><p>***</p><br/><p>Jiang Xie didn’t go clear the land. Yan Zhe was too lazy to go and waste time with others. Thus, he dragged Qin Ge to the garden.</p><br/><p>“Old Xie really likes roses. The big garden was filled with all types of roses.</p><br/><p>Qin Ge stated, “It looks good.”</p><br/><p>“Yes, it is beautiful. That little rose is even more beautiful.” The person worthy of fitting with Old Xie’s soul was really beautiful.</p><br/><p>Yan Zhe saw Old Xie and quipped, “The little rose hasn’t summoned you?”</p><br/><p>Jiang Xie wondered, “What is so urgent?”</p><br/><p>Yan Zhe said, “I just feel that you are waiting for nothing. He won’t summon you.”</p><br/><p>Jiang Xie, “…” It was highly likely Yan Zhe had a crow’s mouth.</p><br/><p>Yan Zhe thought about how Xie Xi’s good feelings were at 170 points and had a thought. “Perhaps he is too embarrassed to bother you with such a low level task?”</p><br/><p>Jiang Xie thought that Xie Xi wasn’t embarrassed, he was disgusted. Of course, he had to maintain his face. Jiang Xie said, “He doesn’t have to summon me when it is dangerous. He could also miss me.”</p><br/>\n</div>"}