{"title": "Chapter 27", "id": 27, "volume": 1, "url": "http://boxnovel.org/game-loading-chapter-27", "volume_title": "Volume 1", "body": "<h1>Chapter 27</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Fairytale Town 11</p><hr/><br/><p>Xie Xi placed the dragon heart into the empty items bar and looked at Zhong Jin vigilantly.</p><br/><p>Zhong Jin didn’t care and took the initiative to show his back to them. “Come with me.”</p><br/><p>Song Qi glanced at Xie Xi, who paused before whispering, “Go and see.” He bent over and picked up the sleepy Xiao Feng.</p><br/><p>Zhong Jin didn’t turn his head but knew what Xie Xi had done. “You are so gentle.”</p><br/><p>Xie Xi didn’t say anything.</p><br/><p>Zhong Jin led them out of the cave. The bright light from the outside shone, giving him a layer of light. Unfortunately, this was just a waste.</p><br/><p>Zhong Jin walked ahead without any precautions and slowly told them, “This is the most successful world the Double Beheading Group has designed. It took three years of hard work before it was finally recognized by Zone and became a qualified quasi-world.”</p><br/><p>Xie Xi knew all of this but Zhong Jin gave more of an explanation now.</p><br/><p>“I participated in drawing the blueprint of the town. Aaron was responsible for the town’s residents and many people were responsible for the framework and details. Dozens of people worked hard for three years and finally made a F-grade world.”</p><br/><p>A self-deprecating smile appeared on Zhong Jin’s face. “X is a person who designs S or even SS-grade worlds.”</p><br/><p>This exaggerated contrast was directly experienced and was far more cruel for him than the listening audience members.</p><br/><p>The gap was too wide and made people feel despair.</p><br/><p>Xie Xi didn’t hear wrong. Zhong Jin said this was a F-grade world but this Fairytale Town was clearly D-grade.</p><br/><p>He didn’t have a chance to ask a question when Zhong Jin suddenly spoke.</p><br/><p>“The designer has no heart, because God doesn’t need a heart.”</p><br/><p>This seemed specifically aimed at Xie Xi.</p><br/><p>Xie Xi faintly understood why Zhong Jin’s attitude went through a 360 degree change, helping them instead of trying to kill them.</p><br/><p>Zhong Jin continued, “We weren’t mature and couldn’t become real designers, especially Aaron. He was responsible for the town’s residents but was too selfish.”</p><br/><p>This time Zhong Jin told the truth. “Aaron made his dead child into a resident of the town and gave him a new life.”</p><br/><p>Xie Xi was startled and looked down at Xiao Feng in his arms.” “Yes, it is the child in your arms.”</p><br/><p>Song Qi cried out incredulously, “If he is your friend’s child, why do you want to kill him?” At Aunty Sun’s house, Zhong Jin fired a arrow at Xiao Feng and it was Xie Xi who quickly saved the boy.</p><br/><p>“Aaron’s child?” Zhong Jin replied. “He is just a toy.”</p><br/><p>Xie Xi tightly gripped the boy’s hand.</p><br/><p>“This is why Aaron was doomed as a designer. He is as soft as you and poured countless feelings towards Xiao Feng, actually thinking of Xiao Feng as his own child.”</p><br/><p>Xie Xi’s lips thinned, unable to agree with this person’s view. How was the boy not a living person? He had blood, flesh and self-awareness. Wasn’t this being alive?</p><br/><p>Zhong Jin continued, “It is bad when you can’t control your heart. When it wasn’t recognized as a quasi-world, we can freely go in and out. Then once recognized by the Zone, even the designer can’t enter.” They could only enter if they had a task.</p><br/><p>Xie Xi frowned and guessed, “Xiao Feng encountered danger?”</p><br/><p>“You’re so clever.” Zhong Jin smiled at Xie Xi. Unfortunately, his smile didn’t reach his eyes and was cold. “Don’t blame the first batch of players. We were too incompetent. The town was designed to be very beautiful but it had no self-protection ability. The residents designed to be innocent and simple couldn’t see the beasts under the human faces.”</p><br/><p>As he spoke, Zhong Jin was still indifferent, showing no pain or regret. “These types of beautiful and fragile things will inspire people’s evil thoughts. Beautiful girls who will go to bed with them after a few words, the town’s most beautiful house that can be wantonly occupied, silly villagers who take the initiative to offer food and treasures… how can the game players suppress the desire to destroy it?”</p><br/><p>“The girls became whores, the beautiful house became an evil cave and the beautiful paradise became a hell on earth.”</p><br/><p>Zhong Jin’s eyes fell on the child. “This child got too much love from Aaron and was more attentive. He saw the players’ atrocities and tried to stop them. Then he was brutally abused by players several times more powerful than him.”</p><br/><p>“On the grounds of doing the task, Aaron came to visit the child and lost control when he saw this scene.” Zhong Jin’s eyes flashed. “He violently killed all the players.”</p><br/><p>Xie Xi’s heart stopped and he told the truth. “Then you discovered that the world’s rank improved.”</p><br/><p>Zhong Jin was shocked and exclaimed, “You really are different.” Admittedly, he left a lot of clues. However, normal players who heard this would be distressed about Aaron and Xiao Feng and angry at the players. They wouldn’t be thinking rationally.</p><br/><p>Xie Xi opened his mouth, “Initially, this world was F-grade. Thanks to Aaron losing control and killing the players, the world’s level improved the next time a task was released.”</p><br/><p>“Yes. It rose from F-grade to E-grade.”</p><br/><p>Xie Xi’s eyes narrowed. “Then you started to hunt players, preventing them from clearing the instance and inflaming the relationship between villagers and players, forcefully upgrading the world’s rank.”</p><br/><p>“Yes.” Zhong Jin laughed brightly. “As long as I kill you this time, the Fairytale Town would grow to C-grade.”</p><br/><p>The originally confused Song Qi finally understood!</p><br/><p>His eyes were wide because he never thought it would be like this.</p><br/><p>Fairytale Town was originally only F-grade. The world was designed by a group of people but they weren’t mature, resulting in many loopholes. Aaron selfishly placed his dead child in the world and came to see him from time to time.</p><br/><p>The first players had evil intentions towards this undefended town and did many bad things. The funny thing was that if they didn’t harm Xiao Feng, they wouldn’t be punished at all. It was because the villagers had no thoughts of rebelling.</p><br/><p>Xiao Feng was abused and Aaron saw his ‘resurrected’ child being hurt like this. He angrily slaughtered all the players.</p><br/><p>He thought it was over. Unexpectedly, the Fairytale Town that hadn’t been cleared once again released an assembly task.</p><br/><p>This time, the town’s rating changed from F to E.</p><br/><p>The dozens of people involved in the design exhausted their efforts and only made an immature F-grade world. Now they just had to slaughter a group of newcomers to make the world’s rating rise.</p><br/><p>They got greedy. If they kept going, what would the Fairytale Town grow into?</p><br/><p>F, E, D, C, B, A, S…</p><br/><p>There was too much of a difference! Even if they only managed to upgrade Fairytale Town to a B-grade, the rewards for clearing the world would be incalculable!</p><br/><p>If they were more ambitious and waited for the world to evolve to S-grade…</p><br/><p>Looking at the whole Central World…</p><br/><p>Among the endless quasi-worlds, the S-grade was rare, let alone a S-grade team task!</p><br/><p>Originally it was for Aaron’s revenge and gradually it developed into something more deliberate.</p><br/><p>Zhong Jin intentionally introduced newcomers into the game. The newcomers had no experience and their efficiency when doing tasks was very low. The death rate was extremely high.</p><br/><p>His group had only one purpose: to constantly upgrade the rating of the world. They would do whatever it took.</p><br/><p>As the difficulty of the Fairytale Town continued to increase, the appearance of the town changed. The fairytale appearance faded away and became overshadowed by darkness and horror.</p><br/><p>The residents of the town were also forcibly grown. They became made and learned to kill under the threat of their life and resources constantly being deprived.</p><br/><p>Zhong Jin saw the disgust in Xie Xi’s eyes.</p><br/><p>He didn’t care and just smiled. “Do you feel sick? Who knows how X made a S-grade world.”</p><br/><p>Xie Xi declared, “It will never be like you.”</p><br/><p>Zhong Jin didn’t speak.</p><br/><p>Xie Xi stared at the boy in his arms and asked in a low voice, “Aren’t you afraid of me clearing this quasi-world?”</p><br/><p>Zhong Jin could continue to upgrade the level of this Fairytale Town as long as no one cleared the world. If someone cleared the instance, the Zone wouldn’t release any more tasks and the players wouldn’t be able to enter. Naturally, the rating could no longer be increased.</p><br/><p>Before Xie Xi, Zhong Jin brought in newcomers who knew nothing. Even if they were fortunate enough to gain the core task, they couldn’t gain the core side task. If they did, there were Zhong Jin and the others waiting to kill them.</p><br/><p>This cycle created a higher ranked world built with blood and madness!</p><br/><p>Zhong Jin replied, “There is no way. If I don’t help you, won’t you call X to kill me?”</p><br/><p>“You really saw it.” The only reason why Zhong Jin would become so honest was if he saw X’s body. He knew he couldn’t kill Xie Xi and Song Qi and wanted to send them out of this world.”</p><br/><p>“I didn’t dare look or else I would be dead.” He was joking, but how could he actually get close to X? Zhong Jin continued, “Of course, I am a person involved in the design and have special channels to feel such things.” He turned and stared at Xie Xi, asking, “Can you really clear this instance?”</p><br/><p>Xie Xi stated, “I will definitely clear it.” It was only by clearing it that this town could be freed from the infinite loop!</p><br/><p>“You are too kind.” Zhong Jin smiled. “Let’s go. I will take you to see Aaron.”</p><br/><p>Xie Xi froze once he saw Aaron.</p><br/><p>Zhong Jin showed a sincere smile that had never been seen before, as if he was seeing an old friend. He touched the figure perched on half of the mountain and said, “Get up, old dragon.”</p><br/><p>“Aaron…” Song Qi was stunned. “He isn’t a player!”</p><br/><p>Zhong Jin explained, “In order to protect that child, this fool willingly fell. This ridiculous world’s level was too low and Aaron had too much power. He was forced to change back to his original form.”</p><br/><p>Xie Xi’s heart received a short shock.</p><br/><p>At this moment, the unconscious Xiao Feng woke up, his golden eyes daze. Then he saw the golden dragon in front of him and burst into tears. “Dragon god!”</p><br/><p>The dragon had the same golden eyes but couldn’t say anything.</p><br/><p>The boy trotted over, one small hand holding the golden dragon’s paws and the other rubbing the delicate head. “I thought I would never see you again, dragon god.” He looked up at the dragon. “I know you have always been here!”</p><br/><p>The dragon stared at him, not saying anything and his expression not even changing. He was a dragon, just a dragon.</p><br/><p>Zhong Jin stared at this sight and the corners of his mouth straightened.</p><br/><p>Xie Xi stared at him. “You want to upgrade the world, is it really for…”</p><br/><p>“What else?” Zhong Jin laughed. “Of course it is for the reward of clearing the world. Unfortunately, it was taken away by you.”</p><br/><p>Xie Xi’s brow furrowed.</p><br/><p>Zhong Jin urged him, “Hurry and give the stone to this dragon.”</p><br/><p>Xie Xi asked, “Will it harm the dragon?”</p><br/><p>“How can he be hurt? He is willing.”</p><br/><p>Xie Xi took out the white stone and placed it in front of the dragon.</p><br/><p>The dragon’s eyes shook before smoothing out. The dragon claws carefully touched the top of the boy’s head before a ray of light burst out. Countless gold rays streamed from the dragon’s body and gathered together, rushing into the white stone.</p><br/><p>The originally white stone turned gold, like the sun in the sky.</p><br/><p>At the same time, a prompt appeared in the lower right corner of Xie Xi’s vision. [Congratulations, you have completed the main mission: collect the dragon heart.]</p><br/><p>At the last moment, Xie Xi threw the golden stone.</p><br/><p>Collecting it didn’t mean possession. No matter what the dragon’s heart stood for, it belonged here.</p><br/><p>Xie Xi failed to see that the golden stone he threw became the sun that illuminated the whole tone.</p><br/><p>[Congratulations, you have cleared the D-grade quasi-world, Fairytale Town.]</p><br/><p>Xie Xi’s eyes fell on the words ‘quasi-world.’ For the first time, he felt that this wasn’t a game but a real world. It was a pity that he left and couldn’t know what happened to the town.</p><br/><p>Xie Xi sighed and placed his hand in the water curtain to check the task rewards.</p><br/><p>It was just a D-grade world and gave ordinary rewards: 10,000 silver coins and a white stone.</p><br/><p>This stone was similar to the one fished out of the blood pool, but it was much smaller.</p><br/><p>Xie Xi placed it in his backpack and saw the detailed description.</p><br/><p>Name: Energy Storage Stone.</p><br/><p>Purpose: Accumulate energy.</p><br/><p>Description: Too weak. It is better to have an energy-filled stone. Please note that the energy must be willingly given by the other person, or it will be countered.</p><br/><p>Xie Xi was startled. The so-called dragon’s heart meant collecting Aaron’s power?</p><br/><p>How was this energy stone placed in the blood pool and what happened after the golden dragon’s power was collected?</p><br/><p>He always felt there were many mysteries that hadn’t been solved.</p><br/><p>Xie Xi looked at the communications list. Song Qi’s name was followed by the words ‘In the game.’</p><br/><p>He completed the main core task and was sent back to the Central World, but Song Qi hadn’t collected the underwear. He couldn’t come back and was still in the Fairytale Town.</p><br/><p>Clearing the game meant that the Zone would no longer release tasks for the Fairytale Town and no more players could enter. Players who previously accepted a task and entered the quasi-world needed to complete it before they could leave.</p><br/><p>Once Song Qi came out, he should know more information.</p><br/><p>Xie Xi calmed his mind and prepared to search for the next quasi-world.</p><br/><p>He clicked on the Quasi-world column. The first line was still Love to the Left or Right. The second line had Fairytale Town, following by the quasi-world level and the fact that it had been cleared. The third line stated: Search for a new world.</p><br/><p>Very good… he could get rid of that damn Atlantis!</p><br/><p>Xie Xi sighed with relief and clicked the search button.</p><br/><p>-New task, please give him a normal one!</p><br/><p>The small funnel finished loading and a subpage popped up.</p><br/><p>[Quasi-world: Lost Atlantis, the difficulty is unknown, designer X, not challenged.]</p><br/><p>It was exactly the same words and punctuation!</p><br/><p>Xie Xi, “…” He was haunted!</p><br/>\n</div>"}