{"title": "Chapter 31", "id": 31, "volume": 1, "url": "http://boxnovel.org/game-loading-chapter-31", "volume_title": "Volume 1", "body": "<h1>Chapter 31</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Lost Atlantis 2</p><hr/><br/><p>The naked Xiao Xie was shaking his head.</p><br/><p>He had experience so he wasn’t so flustered the second time. Now that he wasn’t nervous about turning into a shark, he had plenty of time to observe and experience it carefully.</p><br/><p>This test was very powerful and the holographic simulation was perfect. He didn’t feel that this was a game and he was completely integrated into it. He really seemed to have become a shark. Of course, Xie Xi had never been a shark and didn’t know what it felt like.</p><br/><p>He shook his tail and struggled towards the sea. The shark’s hunger and thirst were too real, making him breathless and dizzy, also reducing his physical strength.</p><br/><p>He was hungry so the pedestrians on the street became fragrant…</p><br/><p>Hold on! It was just a game, a game!</p><br/><p>Xie Xi tried to avoid the pedestrians and jumped into the sea at the fastest speed.</p><br/><p>There was another pulling sensation. Xie Xi opened his eyes and saw the young mermaid.</p><br/><p>The mermaid didn’t hide her sarcasm. “40 points. At this level, you are still delusional enough to join the royal guards? You are insulting the dignity of the royal family!”</p><br/><p>Xie Xi, “…”</p><br/><p>“Come out, don’t waste everyone’s time!” The mermaid’s eyes were full of contempt and she was too lazy to look at this salted fish.</p><br/><p>Xie Xi came out and number 862 lay in it.</p><br/><p>This time Xie Xi wasn’t in a hurry to read the file. He watched for a while and found his problem…</p><br/><p>The contents of this test were very simple. He just needed to find the sea in this strange map. However, it was said that this contained a number of important tests that were crucial for a mermaid. For example, the mermaid’s fear of land, their ability to adapt to harsh environments and their sense of the sea…</p><br/><p>There were many test items listed. Unfortunately, as a human, Xie Xi didn’t have any of these things and was powerless.</p><br/><p>Everyone’s map was different so it wasn’t helpful even if they saw how other people passed the test.</p><br/><p>For example, number 862. This mermaid brother was in a seaside town with different terrain.He ran rampant, eating people instead of avoiding them and finally scored 78 points. This was much higher than Xie Xi but he didn’t qualify.</p><br/><p>Xie Xi heard the person next to him whispering, “We have to eat more people. Eating people adds a lot of points.”</p><br/><p>Xie Xi, “…” Sure enough, his problem was that he didn’t eat people?</p><br/><p>It might be a game and Xie Xi knew they weren’t real people, but he couldn’t open his mouth. The game feeling was too real and he couldn’t imagine the feeling of eating people.</p><br/><p>Xie Xi watched for a moment before the bottom right hand corner prompted him: [Please note that the save point will disappear after one minute.]</p><br/><p>Xie Xi, “!” Damn, he knew it wasn’t that simple. This save point actually had a time limit!</p><br/><p>In other words, he had to quickly read the file and complete the test, joining the royal guards, or he had to give up on this route and approach the sixth prince using a different approach.</p><br/><p>He couldn’t give up so easily. Ghost knows what other deep pits were waiting!</p><br/><p>Xie Xi chose to load the file and try again. Since the save point was given, it showed that this path was relatively correct and shouldn’t be abandoned.</p><br/><p>The great white shark fell on the land again. This time, Xie Xi didn’t delay for a second. He remembered the road and swam towards the sea. He had this ‘cheat’ of loading the file and could keep refreshing the same map. Sooner or later, he would achieve the shortest route!</p><br/><p>He came out of the cabin and the female mermaid had a complicated expression. “83 points.”</p><br/><p>Sure enough, he just had to choose the right path and it would make up for the scores lost because he didn’t eat people.”</p><br/><p>The female mermaid didn’t show a disdainful expression this time. She felt regret. “You only needed to eat two people along the road and your score would be sufficient.’ 90 points was required to pass the test.</p><br/><p>Xie Xi didn’t say anything.</p><br/><p>He could read the file again but the people present didn’t know he had already done the test three times. They thought he had such an amazing result the first time and whispered among themselves.</p><br/><p>“It’s amazing. His sense of smell is too sharp and he headed straight for the sea!”</p><br/><p>“He is too calm. This is a 100% simulated reality test. Once I saw the shore scene, I was a stupid fish!”</p><br/><p>“His speed and explosiveness were also great. The big white shark is a bulky form but he moved like he was in the water.”</p><br/><p>“It is too bad. He just needed to eat two people and he could pass the test!”</p><br/><p>“Why doesn’t he eat people?”</p><br/><p>“He isn’t… pro-land faction…”</p><br/><p>The pro-land faction? Xie Xi noticed these words.</p><br/><p>As soon as they emerged, it was like throwing some hot news on the Internet. The room was boiling over.</p><br/><p>“I hate the Holy Mother pro-land faction!”</p><br/><p>“Yes, the human race did this to us. Why should we live in peace with them?”</p><br/><p>“Yes! Humans are scum. We should eat them and purify the earth!”</p><br/><p>There were different reasons for the heated atmosphere.</p><br/><p>“Shut up, you militant faction! Do you have any brains. There are six or seven billion humans. How can we eat them all?”</p><br/><p>“Stupid fish who only know how to kill, do you understand humans at all? Do you know the extent of their technological development?”</p><br/><p>“What about it? The ocean is much more vast than the land. This planet belongs to the ocean!”</p><br/><p>“I don’t care. I will eat humans. They eat fish and prawns all day, why can’t we eat people?”</p><br/><p>Xie Xi, “…”</p><br/><p>Then a fish said something fair. “Humans don’t eat mermaids!”</p><br/><p>Another fish disagreed. “Aren’t they harming us badly? Based on the ocean pollution in the last two years, all our offspring will be wiped out…”</p><br/><p>The save point countdown appeared again. Xie Xi didn’t dare delay and hurriedly loaded the file.</p><br/><p>He became a shark and after many experiences, he saved more time and rushed into the sea via the shortest path.</p><br/><p>After he left the cabin, the female mermaid’s face was filled with shock and admiration. “91 points, number 861 is amazing!” Xie Xi was number 861.</p><br/><p>Xie Xi was relieved. He had tried so many times. If he didn’t succeed, he would be really stupid.</p><br/><p>“Congratulations.” The female mermaid smiled sweetly. “You have passed the test!”</p><br/><p>Her words caused a burst of cheers from outside.</p><br/><p>“So amazing. All aspects are against the sky!”</p><br/><p>“He passed without eating anyone!”</p><br/><p>“It is enough to prove how powerful he really is.</p><br/><p>A group of mermaids praised him, causing the cheating fish to feel awkward.</p><br/><p>This time, there was no fight between the ‘pro-land’ and ‘militant’ factions. Thanks to Xie Xi’s perfect performance, eating people to gain points became a humiliating action…</p><br/><p>Xie Xi finally passed the test and wasn’t upset when he saw the save point was going to disappear.</p><br/><p>This route should be correct. He could get close to the sixth prince by entering the royal guards!</p><br/><p>Xie Xi was led away by a mermaid dressed in a uniform. He walked outside and was stunned by the scene.</p><br/><p>He guessed that he was at the bottom of the sea but he hadn’t expected it to be so beautiful.</p><br/><p>Jellyfish fluttered in the water, the colourful coral were the most beautiful embellishments of the sea floor and the buildings rising from the ground had the grandeur and majesty of the land.</p><br/><p>Xie Xi could barely feel the presence of water. It was like air on land. They wrapped around him and merged with him.</p><br/><p>Mermaids in water had more freedom than humans on land.</p><br/><p>Humans couldn’t fly in the wind but mermaids could fly freely in water.</p><br/><p>The male mermaid walking in front of him asked Xie Xi, “What’s your name?”</p><br/><p>Xie Xi froze before saying, “Sein Hall.” This was the only English name he could remember at the moment.</p><br/><p>The male mermaid introduced himself. “My name is Thomas Monroe. You can just call me Thomas.”</p><br/><p>Thomas… Xie Xi was silent as he remembered the train Thomas.</p><br/><p>Thomas seemed to appreciate him. “You are very capable. You must perform well when you enter the royal guards.”</p><br/><p>Xie Xi cried out, “I will train well and do my duty.”</p><br/><p>Thomas earnestly told him, “However, I will give you a few words of advice. Don’t hurry to stand in a team.”</p><br/><p>Xie Xi captured the key point and asked humbly, “What do you mean?”</p><br/><p>Thomas probably saw his excellent performance in the test and thought he had a great future. Thomas wanted to have a good relationship with him in advance and told him, “Right now, six princes and two princesses of the royal family are adults. His Majesty’s body isn’t good and the heir is still undecided. Everything is uncertain!”</p><br/><p>Xie Xi had thought the mermaid king was very good when he saw the main task. He didn’t expect for the king to actually have 12 children and each child’s mother was different! (Note: 12 children, but only 8 of them are adults) In addition, the difference between the eldest prince and youngest princess was only six years. The mermaid king sired two children in one year.</p><br/><p>The children were okay when they were young. All of them were cute and lovable, making the old king proud of them.</p><br/><p>Time flew, the children grew up and the old king started to worry. The eldest was calm, the second child got the hearts of the people, the third child could lead the army to fight…the others all had their own merits. Who should he pass the throne to?</p><br/><p>By all accounts, it should be passed to his eldest son. However, the eldest son wasn’t born to the queen. Then it should be passed to the legitimate son, but the legitimate son was the least suitable to inherit the throne…</p><br/><p>The old king hesitated and gave the princes many ideas.</p><br/><p>By the time the old king realized the situation wasn’t good and wanted to establish an heir, he was riding a tiger and couldn’t open his mouth.</p><br/><p>Thomas advised, “The royal guards protects the entire royal family. You must be careful not to get involved in these things.”</p><br/><p>Xie Xi thought, ‘It is impossible to not get involved. I have to collect the love of the sixth prince, meaning I must be close to the sixth prince.’</p><br/><p>It seemed like the main task was helping the sixth prince seize the throne?</p><br/><p>This was a more serious task. What was collect the love of the sixth prince?</p><br/><p>Xie Xi was temporarily settled with the guards. The palace on the seabed had a huge blue dome that seemed to recreate the sky on the seabed. The white buildings were made from unknown and durable jade. They could withstand the long-term soaking of sea water.</p><br/><p>Xie Xi joined the guards, becoming familiar with the environment and participating in the training. He took it seriously, wanting to take this opportunity to improve his combat effectiveness. Maybe he could use the ‘hero saves the day’ strategy to get the love of the sixth prince.</p><br/><p>He wanted to inquire more about the sixth prince but due to the disputes, the guards kept quiet about the princes. They were cautious and never dared speak indiscriminately.</p><br/><p>Xie Xi also didn’t ask in an obvious manner in order to avoid trouble.</p><br/><p>After five days, the incubation time of the elf egg was more than halfway and Xie Xi finally left the training came.</p><br/><p>His assigned job was to stay outside the hall of official business.</p><br/><p>This job wasn’t risky. The only requirement was to stand upright. After all, it was a place where nobles and the royal family travelling. He couldn’t disgrace the royal family.</p><br/><p>Xie Xi’s face was up to standard and he was placed here.</p><br/><p>He was quite satisfied with this job. The adult princes would enter and leave the hall every day. He just needed to look at the sixth prince and find a chance to approach.</p><br/><p>Who knew that this first day would make him want to go on strike!</p><br/><p>The guards weren’t shrimps. They didn’t have to bow down. They had to hold a one-handed spear and stand straight up, their eyes following the pedestrians.</p><br/><p>The shrimp soldiers called out, “The eldest prince is coming!”Xie Xi saw a tall man in black clothing.</p><br/><p>He had rare black hair, handsome facial features and a calm face. Every step emitted an aura that was incomparable to the surrounding mermaids.</p><br/><p>He had legs… that wasn’t the point. The point was that he had the face of the housekeeper Randy!</p><br/><p>Yes… the eldest prince of the underwater kingdom looked like Randy from Love to the Left or Right!</p><br/><p>Xie Xi, “???”</p><br/><p>Perhaps it was because his gaze was too abrupt but the eldest prince looked over at him. Xie Xi quickly shifted his gaze away.</p><br/><p>The eldest prince paused before acting like he saw nothing.</p><br/><p>If Xie Xi was surprised by the housekeeper Randy, he was really scared when the shrimp soldiers called out, “The second prince!”</p><br/><p>The man had dazzling silver hair and pure white clothing that made his facial features look like they were carved in a dream. His manners were elegant and his eyebrows made him look like he was smiling. It was enough to hook his way into the hearts and souls of the people around him.</p><br/><p>It was the vampire Aix-en…</p><br/><p>Xie Xi was expressionless while the hand holding the spear was extremely white.</p><br/><p>The shrimp soldiers shouted again, “The third prince!”</p><br/><p>It was a person wearing a red military uniform, with a sabre hanging from his waist and short hair. His eyes were big but deep and his lips beautiful. This was the maid Gars.</p><br/><p>The eldest prince was the housekeeper Randy.</p><br/><p>The second prince was the vampire Aix-en.</p><br/><p>The third prince was the maid Gars.</p><br/><p>……</p><br/><p>Xie Xi: ^_^</p><br/>\n</div>"}