{"title": "Chapter 33", "id": 33, "volume": 1, "url": "http://boxnovel.org/game-loading-chapter-33", "volume_title": "Volume 1", "body": "<h1>Chapter 33</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Lost Atlantis 4</p><hr/><br/><p>Xie Xi was confused by this progress bar and he couldn’t help feeling a bit dazed.</p><br/><p>At this point, he was still looking at the fifth prince and his appearance took on another layer of meaning.</p><br/><p>Xie Xi was born exquisite and his eyes were a relatively rare black. They were dark, like obsidian covered with dew. His foggy eyes caused a strange feeling to wriggle in the fifth prince’s heart, as if he had been waiting for something for a long time and finally met it.</p><br/><p>“I haven’t seen him before.” The fifth prince finally managed to say.</p><br/><p>The fourth prince named. “The Hall family is widespread and big. It is natural not to know him if you haven’t talked directly.”</p><br/><p>Xie Xi was still staring at the fifth prince because the writing in the lower left corner became: [Task progress: 2%.]</p><br/><p>Damn! Xie Xi’s soul finally returned.</p><br/><p>Was the fifth prince actually the sixth prince? Or was the fourth prince the sixth prince? What was wrong?</p><br/><p>The fifth prince’s slender fingers stroked the harp and he smirked, “Do I look good?”</p><br/><p>Xie Xi, “!”</p><br/><p>The fifth prince got up and the originally loose clothes fell to the ground. The V-neck collar was almost open to the waist. His smooth chest could be en and when he walked, Xie Xi could vaguely see…</p><br/><p>The only thought that crossed Xie Xi’s mind—too garish!</p><br/><p>This was truly the soul of the X Persian cat!</p><br/><p>“Small Sein.” He didn’t know when but the fifth prince had leaned over and placed his mouth against Xie Xi’s ears. “It is impolite to keep staring at people like this.”</p><br/><p>Xie Xi was stunned to find that the mission progress had risen by 1%.</p><br/><p>What was going on? Was there a bug in the system or was he blind?</p><br/><p>In fact, there was another possibility. However, Xie Xi was a simple 19 year old young man and couldn’t think of such a terrible thing.</p><br/><p>The fourth prince coughed and told the fifth prince, “Mr. Hall is a guard of the palace. Don’t tease him.”</p><br/><p>The fifth prince seemed to have a good relationship with the fourth prince. His thin lips curved as he said, “Brother, your words are wrong. It is obvious that this little guy is provoking me. Look at his eyes that are staring at all of me.”</p><br/><p>Xie Xi finally recovered from his shock and found there was a layer of goosebumps on his arm.</p><br/><p>He instinctively took three steps back and quickly pulled away from the fifth prince!</p><br/><p>Unfortunately, this move was too hasty and seemed to imply something.</p><br/><p>The fifth prince’s smile deepened. “Why don’t I go and discuss it with you later…”</p><br/><p>He hadn’t finished when a shrimp soldier cried out from outside, “His Highness, Prince Randy, Prince Aix-en and Prince Gars!” The eldest prince, the second prince and the third prince came together…</p><br/><p>Five souls were gathered together and Xie Xi really wanted to run!</p><br/><p>It was a pity that the princes were faster than him and had already arrived.</p><br/><p>The fourth prince greeted them. “Older brothers.”</p><br/><p>The mermaid who came with the princes put down the gifts they brought and the fourth prince thanked them again.</p><br/><p>The eldest prince asked, “Is your body better in recent days?”</p><br/><p>The fourth prince covered his mouth and lightly coughed, his voice slightly hoarse. “I am much better.”</p><br/><p>The second prince also spoke, “Father has been worried about you. He wanted to come several times to see you but was persuaded by us.”</p><br/><p>The fourth prince was anxious and coughed again, his pale cheeks slightly flushed. “I am an unfilial son, letting my father worry…”</p><br/><p>The second prince comforted him. “Don’t worry. Just look after your body and father will be relieved.”</p><br/><p>The fourth prince nodded and looked at the third prince.</p><br/><p>The third prince seemed to have a bad relationship with everyone. His eyes were slightly drooping and his words were shady. “Fourth Brother, you have wonderful music and a beautiful person by your side. It is better than the gods.”</p><br/><p>The fourth prince wasn’t given a chance to speak as the fifth prince raised his eyebrows. “Third Brother, if you want to listen to a song then you should tell me. Why act so sour?”</p><br/><p>The third prince glanced at him. “Fifth Brother only players for the people you like. Do I deserve it?”</p><br/><p>The fifth prince was pierced by the thorny words but unexpectedly only smile. He didn’t answer in words, his posture saying that his brother had self-awareness.</p><br/><p>Xie Xi’s scalp was numb as he stayed in the middle of the five brothers. He wanted to shrink back and slip out.</p><br/><p>Some people refused to let him go. The second prince asked in a surprised manner, “Isn’t this the little guard from the hall?”</p><br/><p>Xie Xi suppressed his curse.</p><br/><p>The third prince’s gaze burned like soldering iron.</p><br/><p>Xie Xi received the gaze but he was swearing in his heart. ‘We don’t have a relationship. Why are you looking at me like that?”</p><br/><p>The fourth prince opened his mouth. “Guard Sein received father’s orders and came to deliver medicine.”</p><br/><p>The fifth prince glanced between Xie Xi and the second prince. “Second Brother, do you know him?”</p><br/><p>The second prince looked at the third prince and smiled. “This is the heart of Third Brother. How can I not know?”</p><br/><p>The fifth prince stared at the third prince.</p><br/><p>The third prince didn’t stay still. “Second Brother, weren’t you going to take him into your palace?”</p><br/><p>The second prince kept smiling. “He refused to come with me. I didn’t see him the next day so I thought Third Brother took him.”</p><br/><p>The third prince glanced at Xie Xi standing next to the fifth prince and sneered. “People have their own hearts. Why should I make it difficult for them?”</p><br/><p>Xie Xi heard all of this and thought they were all crazy!</p><br/><p>Who did he provoke to stand in the middle of this drama?</p><br/><p>Xie Xi wanted to leave when he heard the eldest prince open his mouth. “Little Six, come in. Why are you standing outside?”</p><br/><p>The fourth prince was slightly surprised. “Little Six is here? Why didn’t he come in?”</p><br/><p>The second prince replied, “He was standing there when we came. I don’t know what he was looking at.”</p><br/><p>The fourth prince coughed and went out to greet him. “Come in, what are you doing outside?”</p><br/><p>The curtain opened and a tall man walked in.</p><br/><p>Xie Xi wanted to leave but he couldn’t move.</p><br/><p>It turned out that the sixth prince came early! He had been outside the whole time!</p><br/><p>Then… the progress of the task just now was because of him!</p><br/><p>Xie Xi sighed with relief and looked at the mysterious sixth prince.</p><br/><p>He was dressed in blue and white clothes, in the tight fitting style of the underwater kingdom. Flowing robes like the fifth prince were unusual. After all, flowing clothes of ordinary material would become a mess in the water and wouldn’t float.</p><br/><p>Under normal circumstances, the princes and nobles would wear clothing corresponding to their status. It wasn’t cumbersome but there were be more material at the shoulder, chest or waist.</p><br/><p>The sixth prince was in good shape, no less than his older brothers. However, his temperament was completely different.</p><br/><p>The eldest prince was calm, the second prince was elegant and charming, the third prince was domineering, the fourth prince was quiet, the fifth prince was sexy and romantic while the sixth prince gave off a loneliness that was as deep as the sea. He had a handsome face but the different coloured eyes showed a gloomy look.</p><br/><p>Xie Xi only glanced at him and felt a deep-sea phobia.</p><br/><p>The sixth prince didn’t look at him or speak. He just slightly nodded at his brothers.</p><br/><p>The other princes seemed accustomed to this and weren’t surprised.</p><br/><p>Xie Xi felt his heart drumming. The sixth prince didn’t look too good.</p><br/><p>The fourth prince coughed from time to time but he seemed to be in a good mood as he suggested, “We haven’t gathered together for a long time. It is better to have a light meal together.”</p><br/><p>The eldest prince nodded, “Okay.”</p><br/><p>After all, he was the eldest brother. Everyone else had to give him so face and stay.</p><br/><p>The second prince bent down to look at Xie Xi. “Small Sein should also stay.”</p><br/><p>Xie Xi spat in his heart, ‘It is your business!’</p><br/><p>The fourth prince invited Xie Xi, “If Guard Sein doesn’t mind, you might as well stay for the meal.”</p><br/><p>If the sixth prince wasn’t here, Xie Xi would 100% run. But…</p><br/><p>He bowed. “This subordinate’s status is humble, how can I…”</p><br/><p>The fifth prince interrupted him. “My mother is from the Hall family and you are both surnamed Hall. We are cousins. What is there to be humble about?”</p><br/><p>Xie Xi didn’t want to go and daringly said, “Then.. I will accept your request.”</p><br/><p>The fifth prince laughed. “Rightly so!”</p><br/><p>Xie Xi found that the task progress had risen to 4%. He couldn’t help glancing at the sixth prince. Did the sixth prince also want him to stay?</p><br/><p>It seemed that this task wasn’t too difficult!</p><br/><p>Xie Xi was confident and didn’t realize he was almost surrounded by five princes.</p><br/><p>The first, second and third princes sat on the left while the fourth, fifth and sixth sat on the right.</p><br/><p>Xie Xi was placed next to the fifth prince and the sixth prince was on his other side.</p><br/><p>This arrangement was very good and Xie Xi was satisfied.</p><br/><p>After the meal began, the fifth prince took special care of Xie Xi. Xie Xi thought that the fifth prince was good. He might be abnormal but he didn’t seem as sick. If it wasn’t for him, Xie Xi wouldn’t have a chance to approach the sixth prince.</p><br/><p>Xie Xi smiled at the fifth prince. “Thank you.”</p><br/><p>The fifth prince was slightly startled. The corners of his eyes curved as he said, “Try this. It is delicious.”</p><br/><p>Xie Xi nodded. He peeked at the sixth prince and was surprised to find that the task progress had risen to 5%.</p><br/><p>Interesting, could he collect the love of the sixth prince without doing anything?</p><br/><p>Then if he spoke to the sixth prince and was attentive, could he leave this damn world at once?</p><br/><p>Xie Xi felt warm.</p><br/><p>He wasn’t good at socializing with people. Before he entered the game, he had a limited number of friends and he wouldn’t say a word to the cashier when going downstairs to the convenience store.</p><br/><p>After the baptism of Love to the Left or Right, he had become much better. At the very least, he had the skill of speaking nonsense to people.</p><br/><p>“This is delicious.” Xie Xi whispered.</p><br/><p>The fifth prince smiled and was about to say, ‘If it is delicious, eat more…’</p><br/><p>However, Xie Xi had selected a piece and carefully placed it on the sixth prince’s plate. “Your Highness, taste it and see if it is delicious.”</p><br/><p>Then he smiled shyly at the sixth prince.</p><br/><p>The sixth prince was startled.</p><br/><p>Xie Xi was very embarrassed about doing such a thing. Still, this embarrassment was worth it if he could leave the room.</p><br/><p>He looked at the lower right corner and thought there would be a qualitative leap in the progress of the task. Unexpectedly, the 5% progress actually fell a bit and became 4%!</p><br/><p>Xie Xi, “???”</p><br/><p>What happened? He could collect the prince’s love when he wasn’t paying attention but once he did, he couldn’t collect it?</p><br/><p>Xie Xi didn’t believe in such an evil thing and asked the sixth prince, “Your Highness, don’t you want to eat?”</p><br/><p>The sixth prince asked him, “What’s your name?”</p><br/><p>Xie Xi was surprised.</p><br/><p>The sixth prince quickly withdrew his gaze and said, “If you don’t want to say it, you don’t have to.”</p><br/><p>Xie Xi didn’t want to but the task progress had fallen to 3%! Why? What was the problem?</p><br/><p>Xie Xie Xi replied cautiously, “Sein Hall.”</p><br/><p>The sixth prince nodded. “Thank you.”</p><br/><p>Xie Xi watched the task progress plummet to 1%…</p><br/>\n</div>"}