{"title": "Chapter 39", "id": 39, "volume": 1, "url": "http://boxnovel.org/game-loading-chapter-39", "volume_title": "Volume 1", "body": "<h1>Chapter 39</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Lost Atlantis 10</p><hr/><br/><p>Fortunately, Xie Xi placed Roast Pork Bun in stealth in the quasi-world. If people heard what he said…</p><br/><p>Xie Xi would really be his father and killed by him.</p><br/><p>The sixth prince was still watching him. Xie Xi finally reacted and bowed. “I have seen Your Highness.”</p><br/><p>He had previously used Sein Hall on the sixth prince so he had to carry it through to the end without being exposed.</p><br/><p>“I’ve only recently arrived and don’t know many people. I don’t know who Sein Hall is.” Xie Xi kept his head down and tried not to look at the sixth prince.</p><br/><p>The sixth prince lived in a simple manner and had little contact with people. He didn’t want to alarm many people and said, “He is also a guard here. If you see him, help me give him a message. Tell him to come see me if he has time.”</p><br/><p>Xie Xi replied, “Yes, Your Highness.”</p><br/><p>The sixth prince left and Xie Xi was relieved. He had enough trouble dealing with the sixth prince alone and now he had to use three identities to face six people…</p><br/><p>It was like walking a tightrope. It wasn’t easy for a person to walk on a wire. Now he had to walk back and forth on six steel wires!</p><br/><p>Xie Xi went back to his place, locked the door and turned off the Camouflage technique.</p><br/><p>He didn’t panic and lightly stroked his face.</p><br/><p>His real skin: Sein Hall, corresponding to the fifth prince and sixth prince.</p><br/><p>The second face: Colin Hall, corresponding to the second prince and third prince.</p><br/><p>The first face: Jesse Hall, temporarily assigned to the eldest prince and fourth prince.</p><br/><p>Xie Xi repeated it several times to ensure he would remember. Then he recorded the progress of the task.</p><br/><p>A 100% progress bar meant the task was completed. There were six people at the moment. On average, each person was 16.6666%… why couldn’t it be a constant number?</p><br/><p>Xie Xi thought about it. Perhaps it might be a good thing that it wasn’t constant? If it wasn’t evenly divided, perhaps he could focus on one person and collect as much love as possible? Then he would collect the rest from the remaining people. This seemed much simpler.</p><br/><p>For example, the fifth prince was easy and he could coax 60% love from him. Then the remaining 40% would be the other princes since the task was collecting the love of the six princes. The difficulty between 1% and 60% was quite different.</p><br/><p>For the crazy second prince, getting 1% instead of 60% was much simpler.</p><br/><p>Could he really do this? Xie Xi was deeply skeptical.</p><br/><p>Jiang Xie watched Xie Xi, who was biting the pen while seriously thinking, and felt worried. He was worried that his goodwill would drop after Xie Xi knew the truth.</p><br/><p>The number was already terrible. If Yan Zhe knew then he would most probably say that there was no chance in heaven and earth.</p><br/><p>This task certainly wasn’t that simple. It was 16.6666% for each colour. This represented the love of a single soul because love was endless, so the number was endless.</p><br/><p>Since all love couldn’t exceed this percentage, there was no way to collect 60% from a single prince.</p><br/><p>Xie Xi put away the small book and decided to go to the sixth prince first.</p><br/><p>The sixth prince came to him specifically so there might be something urgent.</p><br/><p>This was also a preference. Compared to the slag third prince and temperamental second prince, the ‘simple’ fifth and sixth prince were much lovelier.</p><br/><p>Time was life. Xie Xi immediately went to the palace of the sixth prince.</p><br/><p>Once the sixth prince saw him, the dark eyes lit up.</p><br/><p>Roast Pork Bun sang his praises. “Ahhh, the second most handsome person under the sea!” Don’t ask who the first one was. There were only two beings with different coloured eyes under the sea.</p><br/><p>Xie Xi bowed and the sixth prince helped him up.</p><br/><p>“Is there anything I can do for Your Highness?”</p><br/><p>The sixth prince paused and said, “There is something I wanted to tell you.”</p><br/><p>Xie Xi glanced at the active progress bar and was happy to spend time with the sixth prince. “Your Highness, please speak.”</p><br/><p>The sixth prince hesitated before finally saying, “Tomorrow, I’m going up to the land.”</p><br/><p>Xie Xi was startled. The land?</p><br/><p>The sixth prince continued, “Thus, I wanted to have a word with you.”</p><br/><p>Xie Xi was tense and he asked, “How long will you be gone?” If he was gone for a few months, wouldn’t it be impossible to complete the task?</p><br/><p>His nervous appearance made the sixth prince relax, saying gently, “It isn’t too long. Three or four days at the most.”</p><br/><p>Xie Xie Xi spoke in a relieved manner, “I thought you would be gone for a long time.”</p><br/><p>The sixth prince’s eyes flashed. “No.”</p><br/><p>Xie Xi was somewhat puzzled. If it was just three or four days, why specifically tell Xie Xi? Of course, he couldn’t ask this. The sixth prince was pitiful and probably had no friends. Was this why he paid extra attention to a person who was good to him?</p><br/><p>Xie Xi felt a bit ashamed when he had this thought.</p><br/><p>“This subordinate…” He wanted to say something about when the prince came back, only to suddenly stop.</p><br/><p>There was a green light flashing on the jade table next to him. If Xie Xi wasn’t mistaken, this was a save point.</p><br/><p>The sixth prince noticed his pause. “What’s wrong?”</p><br/><p>“It’s nothing.”</p><br/><p>The sixth prince felt doubtful but didn’t ask.</p><br/><p>Xie Xi moved quickly and chose to save. His heart was beating quickly and he had a bad feeling. Why was there a save point? Was there going to be an important event next?</p><br/><p>The last save point helped get him into the palace. What was it this time?</p><br/><p>Xie Xi couldn’t figure it out for the moment and it wasn’t good to snub the sixth prince. He pushed away the thoughts and asked, “When will Your Highness leave?”</p><br/><p>The sixth prince answered, “Tomorrow morning.”</p><br/><p>Xie Xi sincerely told him, “This subordinate will be waiting for you to come back.”</p><br/><p>The sixth prince laughed in a light manner that inexplicably made a person feel sad. “Yes.”</p><br/><p>Xie Xi was comforted as he looked at the 7% progress bar.</p><br/><p>The sixth prince asked, “Do you still have errands to run? Go ahead.”</p><br/><p>Xie Xi hadn’t finished giving out the gifts and didn’t dare delay. He left with a bow.</p><br/><p>Xie Xi’s heart wasn’t comfortable. This save point made him uneasy. A save point wouldn’t appear unless there was an important decision.</p><br/><p>Did he make the right choice? He didn’t know.</p><br/><p>Xie Xi changed his face and went to give the gift to the elder prince. However, he didn’t see anyone. The eldest prince was busy and working overtime. Xie Xi turned and went to the palace of the fourth prince. The fourth prince was the only one with a legitimate reason to not see any guests.</p><br/><p>He was ill. He could say no if the king’s personal attendant came, let along a small guard.</p><br/><p>Xie Xi was slightly sorry but he wasn’t in a hurry. There was no need to test anything. The six people had already been assigned to the three faces. Now it was just creating opportunities to approach them.</p><br/><p>He was really tired from this day and fell asleep.</p><br/><p>He had a dream. In this dream, he became a small fish and was chased by six big sharks. He swam desperately and was finally torn into six servings for the sharks.</p><br/><p>Xie Xi woke up and smiled bitterly. How was it a dream? This was reality!</p><br/><p>Today he wasn’t very busy. He didn’t try to pick up a fish and instead perfected the information of the other two faces. Camouflage was a big bug and he could do many things. He naturally had to make good use of it.</p><br/><p>First of all, he used it to become the steward of the palace and recorded the first and second faces into the register of palace guards.</p><br/><p>Fortunately, this was a technologically advanced underwater world. The authority was verified with fingerprints and the iris and Xie Xi could easily pass.</p><br/><p>After changing the register, he arranged a proper family background for his three faces by entering the household registration management department. Xie Xi also used this opportunity to find out a lot of prince-related information and was ready to go back and study it slowly.</p><br/><p>This was a squandered day but Xie Xi felt it was worthwhile. After all, he needed to hone the blade to cut the wood.</p><br/><p>The next day, a maid came to find him. “Mr. Hall, there is a request from His Highness.”</p><br/><p>Xie Xi, “…”</p><br/><p>For a moment, he couldn’t tell which face he had on. Miss Mermaid, couldn’t she call his name and mention which prince?</p><br/><p>Fortunately, Roast Pork Bun was taught and knew some things. He shouted, “Sein, Daddy is now Sein Hall!”</p><br/><p>Xie Xi was relieved to know which prince sent the maid.</p><br/><p>The sixth prince didn’t have a maid, not to mention that he had gone up to land. This could only be the maid of the fifth prince.</p><br/><p>Xie Xi followed after the maid.</p><br/><p>The fifth prince was waiting and greeted him. “Sein, come here.”</p><br/><p>Xie Xi was pulled by the fifth prince before he could react.</p><br/><p>The fifth prince was wearing rare formal attire. The uniform outlined his figure very well and his long legs could make a mermaid die from envy. After being a fish for a long time, Xie Xi really missed the taste of Earth.</p><br/><p>The fifth prince noticed his gaze and asked, “Do you like my legs?”</p><br/><p>Xie Xi, “…”</p><br/><p>The fifth prince bent over and whispered, “In fact, my tail is also beautiful. If there is a chance, I will show you.”</p><br/><p>Xie Xi, “!” Why did he feel so weird?</p><br/><p>The fifth prince laughed. “Small Sein, you are so cute.”</p><br/><p>Xie Xi glanced at the rising orange bar and said, “Your Highness, please don’t… tease this subordinate.”</p><br/><p>The fifth prince held his hand. “I’m not teasing you, I’m looking at you.”</p><br/><p>Xie Xi felt the heat from his palm and felt… wasn’t this progress a bit too fast after a few days? He would be even more surprised if he knew that 16.6666…% was the fullest possible value.</p><br/><p>The fifth prince’s progress bar had already reached 13%. This was also after some progress had been lost!</p><br/><p>Xie Xi didn’t say anything. The fifth prince thought he was shy and stopped teasing him. “Let’s go, I will take you to a concert.”</p><br/><p>Xie Xi was surprised. “A concert?”</p><br/><p>“Yes. It is a song I wrote. I’m sure you will like it.”</p><br/><p>Xie Xi didn’t hate it. The fifth prince was versatile and just casually fiddling with the strings created a heavenly sound. The song that the prince wrote… Xie Xi was looking forward to it a bit.</p><br/><p>The underwater kingdom also had ‘cars’. Of course, they were called airships instead of cars.</p><br/><p>After all, there was no need for a highway under the sea. The vehicle shot out with a loud sound. A mermaid’s speed wasn’t slow, certainly not slower than an airship. However, a fast speed would consume physical strength. This was an enjoyable means of transportation so who would willingly swim?</p><br/><p>There was no need to mention the grandeur of the fifth prince. Xie Xi might not understand the technology but he could see how luxurious his transportation vehicle was. It was estimated to be superior to two Rolls-Royce on land.</p><br/><p>The fifth prince treated Xie Xi so well that he was slightly ashamed. He might be forced by the task and wasn’t doing this willingly, but he was still deceiving the fifth prince.</p><br/><p>If the soul was like the second prince then he wouldn’t care. However, the silly fifth prince was really…</p><br/><p>The fifth prince asked him, “Is it delicious?”</p><br/><p>Xie Xi swallowed the pastry in his mouth and nodded. “It is delicious.”</p><br/><p>“I will ask them to prepare more for you.”</p><br/><p>“No, I have…”</p><br/><p>The fifth prince told him, “You are too small. You should move out and come to my palace.”</p><br/><p>How could Xie Xi dare do that? He frowned. “Your Highness, please give me some time. I can arrange my own life.”</p><br/><p>The fifth prince didn’t force him. “Okay, don’t be angry. I will leave it to you.”</p><br/><p>Xie Xi felt more and more guilty.</p><br/><p>They had just arrived at the concert hall and hadn’t walked in yet when the fifth prince’s communicator rang.</p><br/><p>It was very sharp and especially shrill, like it was some type of alarm. The fifth prince frowned and quickly pulled out the communicator. He glanced at it and froze.</p><br/><p>At the same time, a huge screen was projected in the screen, the square clearly visible.</p><br/><p>The third prince dressed in military attire appeared. His posture was majestic and there was a deep look in his eyes. The words from his mouth blasted the entire sea bed.</p><br/><p>“Sixth Prince Sirius Atlantis went up to the land and was brutally killed! How can we so back when the land people are so cruel and insolent?”</p><br/><p>Xie Xi was stunned. What? The sixth prince was dead?</p><br/>\n</div>"}