{"title": "Chapter 47", "id": 47, "volume": 1, "url": "http://boxnovel.org/game-loading-chapter-47", "volume_title": "Volume 1", "body": "<h1>Chapter 47</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Lost Atlantis 18</p><hr/><br/><p>Even Xie Xi could see that the situation wasn’t right. The others had many experiences on the battlefield and it was impossible for them to not understand. The third prince gave a command and the people present were busy with their respective roles.</p><br/><p>Xie Xi certainly wouldn’t stay here. He sped up and swam to catch up with the third prince.</p><br/><p>The third prince had two legs but he was much faster at swimming than other people with a fish tail. It was probably because he borrowed some type of power that pushed away the surrounding water, allowing him to go faster.</p><br/><p>Xie Xi caught up and the third prince frowned. “Go back and wait.”</p><br/><p>He was covered with blood and it seemed he didn’t want Xie Xi to see him like this, in case Xie Xi became frightened.</p><br/><p>Xie Xi didn’t agree. “Your Highness is looking down on me.” He didn’t have to be humble.</p><br/><p>The third prince glanced at him and didn’t try to drive him away again. He just said, “Help me call.”</p><br/><p>The prince held the injured mermaid with both hands and couldn’t use the communicator.</p><br/><p>Xie Xi quickly stepped forward with a slightly surprised expression. The mermaid was badly hurt. His fish tail was bloodied and looked like it had been peeled, making a person’s scalp feel numb.</p><br/><p>Fortunately, Xie Xi had a lot of ‘insight’ and could withstand it. He clicked on the wrist of the third prince and a black screen unexpectedly popped out.</p><br/><p>The third prince said, “I turned on the anti-peeping setting. Turn it off at the bottom right corner.”</p><br/><p>Xie Xi had studied this and knew how to use it. He turned it off and happened to see that in their dialogue box, the third prince had given him the nickname: Little Cutie.</p><br/><p>Xie Xi, “???”</p><br/><p>If it wasn’t for this injured fish, he would ask Old Three what this nickname meant!</p><br/><p>Xie Xi followed the prince’s instructions and dialed a number.</p><br/><p>Once the other side picked up, the third prince quickly said, “Block off the whole district. The person shouldn’t have escaped yet. Saul, if you don’t catch the culprit, I will cut off your fish tail and replace it with Mars’ tail!” Saul was his lieutenant and Mars was the injured mermaid in his arms.</p><br/><p>The mermaid was clearly a little soldier yet the third prince remembered his name…</p><br/><p>Xie Xi had some understanding of why the soldiers revered the third prince.</p><br/><p>Along the way, the third prince moved quickly and his mouth didn’t stop. The remote commands he gave were very reliable.</p><br/><p>Xie Xi’s heart was obedient and he just followed. The third prince was holding a person but he walked smoothly, looking in every direction while listening to the people he talked to. His mind clearly analyzed the situation and he was truly powerful!</p><br/><p>Once he got to the medical centre, the people were already ready. The third prince put Mars down and said to the doctors, ”He was hit by the aftermath of the SX623 shock cannon. The main injury site is the fish tail and his left arm is also broken. There is shrapnel…”</p><br/><p>He described the mermaid’s injuries in detail and the doctors nodded before injecting Mars with medicine.</p><br/><p>At this time, Xie Xi stared at the trident on the third prince’s shoulder, which represented the highest military power and felt complicated.</p><br/><p>This young commander was worthy of bearing the highest glory.</p><br/><p>After putting Mars down and explaining the basic situation, the third prince took Xie Xi and left. Xie Xi was still worried about the mermaid but the third prince was focused on investigating the spy.</p><br/><p>This quality was really strong. He didn’t what should be done while handing the other jobs over to the professionals. He didn’t waste time and this precision was as fast as a bullet!</p><br/><p>Half an hour later, the spy was caught and the third prince personally interrogated him. Xie Xi was left outside.</p><br/><p>It didn’t take long before the third prince came out and shouted, “The bastard king of the Haiqiu Kingdom, he dared to do this!”</p><br/><p>He left like the wind and headed straight back to the palace. Xie Xi followed and received a sign stating he was the third prince’s guard…</p><br/><p>It was fine since he had to stay with the third prince a bit longer anyway.</p><br/><p>On the way here, they talked and smiled. On the way back, the atmosphere was tense.</p><br/><p>Xie Xi couldn’t say any words and after returning to the palace, the third prince didn’t let Xie Xi go. Instead, they headed to the hall of official business.</p><br/><p>Xie Xi had the sign and no one could stop him from entering.</p><br/><p>Previously, Xie Xi was assigned here but hadn’t seen what was inside. Today was the first day he walked in and was quite surprised.</p><br/><p>It didn’t have a magnificent atmosphere, not was it extravagant and gorgeous. The royal family’s extravagance also couldn’t be felt. There was a strong sense of simplicity in the hall… or should it be called old?</p><br/><p>Xie Xi saw the eldest prince, the second prince and several old ministers, but he didn’t see the king.</p><br/><p>The third prince saluted before immediately scolding the second prince. “Haiqiu inserted a spy in the northern camp! You cut military expenses for your own desires. Let’s see how happy you will be when they break the northern defense line and kill the king!”</p><br/><p>Xie Xi was shocked. He knew the third prince was angry but hadn’t expected him to be so direct. In front of so many people, he didn’t give his brother any face.</p><br/><p>It seemed that the contradiction between the two brothers had become too deep and irreconcilable.</p><br/><p>Haiqiu was a neighbouring underground kingdom. They were the deadly enemies of Atlantis in the early years and often ate people.</p><br/><p>Atlantis always felt that the kingdom falling was a conspiracy of the Haiqiu Kingdom.</p><br/><p>Given this premise, the two countries had struggled for thousands of years and never stopped fighting.</p><br/><p>The mermaids of Haiqiu were cruel and had a tradition of eating people. From time to time, they would poach mermaids from the underwater kingdom and especially loved those from the royal family.</p><br/><p>In the early years, many young princes and princess were shredded and eaten by them. Thus, the whole Atlantis hated the Haiqiu Kingdom and wanted to annihilate it!</p><br/><p>It was a pity that the topography of the seabed was complex and Haiqiu could always find shelters. They were like endless weeds. Give them a bit of time and they would be back to hunt mermaids.</p><br/><p>The third prince fought on the battlefield all year round and hated these people. Now that they acted again, he would naturally be angry.</p><br/><p>The second prince didn’t stay still. The moment the third prince attacked, he got up and opened his mouth to refute.</p><br/><p>The two brothers were soon quarreling.</p><br/><p>The third prince said, “You only care about money, regardless of the overall situation!”</p><br/><p>The second prince retorted, “I don’t care about the overall situation? It’s your head that is foolish. Do you only have Haiqiu in your eyes?”</p><br/><p>The third prince’s eyes narrowed. “Internal worries are uncertain. Do you also want to create foreign troubles?”</p><br/><p>The second prince said, “You are really naive. The land is like a tiger, waiting to benefit from us. This rascal, you should open your eyes!”</p><br/><p>“Okay.” An elderly man’s voice was heard.</p><br/><p>Xie Xi turned his head and saw the old king surrounded by people at the door. The king was old and clearly lost most of his strength. He maintained the appearance of his legs but couldn’t walk. He could only sit in the chair.</p><br/><p>The two princes stopped arguing as soon as he came. Then Xie Xi saw Sirius behind the old king.</p><br/><p>The people in the hall got up and saluted. The king waved his hand but everyone stood on the sidelines instead of sitting back down.</p><br/><p>The old king sat down, looked at the people present and slowly opened his mouth. “The matter of the northern prince, tell me about it.” The third prince came forward, his tone of speech different from when he was talking to the second prince. He was methodical and finished off with, “…The Haiqiu Kingdom is so arrogant. It won’t take long before they invade the northern border. However, Older Brother cut the military funding at this time. It is nonsense!”</p><br/><p>The second prince sneered.</p><br/><p>The old king said, “Your brother’s actions are also a last resort. The land people have been acting foolishly recently and we have enemies on all sides.”</p><br/><p>The third prince immediately volunteered. “Father, make a decree. Let me lead the army to destroy the momentum of the Haiqiu Kingdom. Then we can deal with the land people!”</p><br/><p>The second prince said, “Third Brother really thinks highly of himself.” The third prince’s eyes narrowed.</p><br/><p>The old king opened his mouth. “The two of you, don’t talk so much. Look at the noisy scene you are making!”</p><br/><p>The third prince didn’t speak again.</p><br/><p>The king paused and looked at the sixth prince. The sixth prince saluted and gave his opinion. “The land people are stupid but we need Third Brother in the capital to guard the royal family. It is better to let me go and figure out the unrest of the Haiqiu Kingdom.”</p><br/><p>After he spoke, the hall fell into a strange silence. Nobody expected that the silent sixth prince who hardly ever left his palace would say such things.</p><br/><p>The third prince immediately protested. “How ridiculous. You leading a battle is a joke!”</p><br/><p>The sixth prince told him, “I know I’m not as good as Third Brother. That’s why I won’t use just one soldier.”</p><br/><p>Everyone present was stunned.</p><br/><p>The old king asked, “Are you sure about this?”</p><br/><p>“If I don’t repel the Haiqiu Kingdom hundreds of miles away, I vow not to return home.”</p><br/><p>The third prince looked anxious while the second prince also frowned. The eldest prince opened his mouth, “No, you have never been to the battlefield. How can…”</p><br/><p>The sixth prince said, “Third Brother was one year younger than me when he overpowered the Haiqiu army.”</p><br/><p>The third prince cried out, “I grew up in the barracks since I was young. You…”</p><br/><p>The sixth prince raised his eyes and stared at the third prince. “Third Brother, do you think I am inferior to you?”</p><br/><p>This was quite provocative but the third prince didn’t become angry. Instead, he came forward and said, “Father, please think twice. Sixth Brother has never been in contact with the Haiqiu Kingdom and doesn’t know their danger. I’m afraid he will…”</p><br/><p>The sixth prince interrupted him. “Children born into the royal family should hold the same responsibilities. What about fighting on the battlefield? I have to do it in the name of Atlantis.”</p><br/><p>He stated it calmly but the people present were shocked. The ministers who had always ignored the sixth prince now looked at him with amazement.</p><br/><p>Xie Xi’s heart was beating like a drum. He was unsure of what the sixth prince wanted to do.</p><br/><p>Didn’t he want to live? No, this… was he really certain that he could repel the invasion of the Haiqiu Country?</p><br/><p>Poor Xie Xi didn’t have the qualifications to speak and could only feel anxious.</p><br/><p>In the end, the old king clapped and matters were settled. The third prince would stay in the capital while the sixth prince would go to repel the Haiqiu Kingdom.</p><br/><p>After leaving the hall of official business, the third prince’s brow was wrinkled and he didn’t say anything.</p><br/><p>Xie Xi followed him. Then the third prince shouted, “Idiot!”</p><br/><p>Xie Xi, “…”</p><br/><p>The third prince turned to catch up with the sixth prince. “If you don’t want to live, I will give you a ride now.”</p><br/><p>Sirius’ face was calm as he saluted his brother. “Third Brother.”</p><br/><p>The third prince was most annoyed by this type of stuffy thing and had a sullen air about him. “Follow me!”</p><br/><p>Sirius glanced at Xie Xi. Xie Xi bowed his head and didn’t dare look at the prince. He shouldn’t be able to recognize Xie Xi… their faces were a bit similar but Sein Hall had died in front of him. Sirius shouldn’t be suspicious.</p><br/><p>Sirius removed his gaze. Xie Xi sighed with relief.</p><br/><p>The third prince took Sirius to the training hall. Xie Xi watched from the side and felt the third prince’s intentions.</p><br/><p>The third prince might look like he was beating up the sixth prince but he was actually tempering the sixth prince with the highest efficiency in the shortest possible time.</p><br/><p>The power of the sixth prince was there and he wasn’t weaker than the third prince. He just had too little experience against the enemy and wasn’t sophisticated enough.</p><br/><p>Such a short period of ‘special training’ wasn’t as good as a real battle but it was better than nothing.</p><br/><p>Xie Xi’s heart warmed. This silly hot-blooded fish gave a few drops of warmth to his brother.</p><br/><p>After they returned to the third prince’s palace, Xie Xi put medicine on the third prince’s arm. He had to keep bowing and his hair fell into his eyes. Therefore, he requested, “Your Highness, can you do me a favour?”</p><br/><p>“Eh?”</p><br/><p>Xie Xi held medicine in his hands and gestured with his arms. The third prince understood and raised a hand to help place Xie’s hair behind his ears.</p><br/><p>Xie Xi’s eyes were wide as he continued to carefully apply the medicine. From the perspective of the third prince, he saw the beautiful side face, the white ear that was like a shell and the earlobe that was like a beautiful pearl.</p><br/><p>The third prince’s eyes widened and his heart was hot. ‘He is young but his ability to hook people isn’t small.’</p><br/><p>Xie Xi applied the medicine and smiled, “Your Highness is so kind. The sixth prince must’ve benefited greatly from today.”</p><br/><p>The third prince was stunned. Xie Xi looked at him and smiled.</p><br/><p>The third prince hid his eyes and replied in a hard manner, “What a mess. I’m just waking him up. He is a boy who doesn’t know the immensity of heaven and earth.”</p><br/><p>Xie Xi didn’t pierce the prince’s cover. His eyes just curved into crescents, especially after seeing that the task progress rose by 3%.</p><br/><p>The third prince looked like he didn’t know who he was. “I didn’t use my full force today. Wait for tomorrow and I will beat him out the door!”</p><br/><p>Xie Xi understood. “Oh, tomorrow is also…” the special training.</p><br/><p>The third prince raised his eyebrow.</p><br/><p>Xie Xi had to change his words. “Poor Sixth Prince, I’m afraid he will be beaten up by Your Highness.”</p><br/><p>With this, the red bar went up by 3% again at a silly pace.</p><br/><p>Roast Pork Bun helped his daddy sum it up. “The third prince is a bit cute, wow.”</p><br/><p>Xie Xi almost laughed loudly.</p><br/><p>***</p><br/><p>Yan Zhe struck his leg while laughing. “Old Jiang, the third prince is really your soul. He has completely learned to consider a loss of face unthinkable.”</p><br/><p>Jiang Xie disagreed. “Am I so stupid?”</p><br/><p>How could a person who couldn’t distinguish between negative and positive numbers open his mouth to talk about face?</p><br/><p>Yan Zhe laughed. “It’s so fun. You are so cute with your Little Rose.”</p><br/><p>Jiang Xie didn’t need to see it to know. It was because green was overflowing from the goodwill bar.</p><br/><p>Yan Zhe was given an opportunity to reenter the team and watch the live broadcast because he healed Jiang Xie. Jiang Xie thought there was nothing wrong with letting him watch for a while.</p><br/><p>Yan Zhe caught the key part. “Isn’t Little Rose’s task to collect the love of the sixth prince? Why is he around the third prince?” He didn’t yet know that the real task was to collect the love of all six princes.</p><br/><p>Jiang Xie paused before calmly replying, “It’s my soul. It is natural for him to be close.”</p><br/><p>After all, the goodwill was high. Yan Zhe couldn’t help feeling envy. “You aren’t a tribal chief. How are you so lucky in love?”</p><br/><p>Jiang Xie looked at his -250 luck in love and still remained calm. “It’s okay.”</p><br/><p>He was worthy of being a god. He would go to hell to keep up appearance so he would never be defeated by something like this!</p><br/>\n</div>"}