{"title": "Chapter 44", "id": 44, "volume": 1, "url": "http://boxnovel.org/game-loading-chapter-44", "volume_title": "Volume 1", "body": "<h1>Chapter 44</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Lost Atlantis 15</p><hr/><br/><p>The two people only just knew each other yet the fifth prince dreamt of marrying him. This speed was really… like a rocket!</p><br/><p>Roast Pork Bun also reacted. “Married? This prince is shameless. He wants to be my father when he hasn’t talked about love?”</p><br/><p>Xie Xi glared.</p><br/><p>Roast Pork Bun helped translate. “Hmm, I know this much.”</p><br/><p>Xie Xi, “…” This little brat needed a spanking!</p><br/><p>The maids were waiting for Xie Xi to dress and he could only act like a puppet. He didn’t dare mess around. One of the rules was that he couldn’t wake up the target of the dream.</p><br/><p>Xie Xi had seriously considered this rule. It shouldn’t be simple to wake up. It implied that the person dreaming shouldn’t be disturbed in his dream. It should be carried out according to his wishes, so that he didn’t ‘wake up’. After this rule was broken, the person dreaming might wake up immediately.</p><br/><p>Xie Xi was in his room and it would be too embarrassing. Therefore, Xie Xi wasn’t grateful for this gorgeous and sparkling outfit. He could only stiffly wear it</p><br/><p>Fortunately, his stiffness was interpreted by the maids as nerves. “Master Hall doesn’t need to feel nervous. You are beautiful and the person in His Highness’ heart. Even if you don’t wear this outfit, you are still the most beautiful person under the sea.”</p><br/><p>Xie Xi, “…” How could a man feel happy being praised like this?</p><br/><p>Roast Pork Bun said, “This is the dream of the fifth prince. Doesn’t this mean that in the heart of the fifth prince, Daddy is the most beautiful person under the sea?”</p><br/><p>Well, he still couldn’t be happy.</p><br/><p>The maids were enthusiastic. They praised Xie Xi while quickly dressing him. After all, this was the prince’s wedding and they were very fastidious. Jewelry was placed one after another and the auspicious words were endless. Xie Xi was a young man who never talked about love. This was the first time he realized how cumbersome and exhausting a wedding was!</p><br/><p>Fifth prince, you can really dream!</p><br/><p>The maids finally finished and Xie Xi saw himself in the mirror. He wore a pure white outfit in the unique style of the Atlantis royal family. It was gorgeous, extravagant and dreamy.</p><br/><p>Xie Xi saw his face and felt that it was more tender in the dream than in reality? He also seemed to be shorter.</p><br/><p>Everything that appeared in the dream was affected by the subjective thoughts of the dreamer. Then in the eyes of the fifth prince, he was this short?</p><br/><p>Xie Xi really didn’t want to get married!</p><br/><p>Then the maids cried out happily, “The wedding car is here! His Highness is coming in!”</p><br/><p>Xie Xi didn’t turn around. He used the mirror to see the fifth prince entering through the door.</p><br/><p>The prince wore the same outfit as Xie Xi but the shoulder lines were straighter and his body was taller. The handsome face was full of tenderness as he looked at Xie Xi.</p><br/><p>The maids were blushing with envy as they tried to suppress their screams.</p><br/><p>Xie Xi wanted to change positions with them…</p><br/><p>“Small Sein.” The charming voice of the fifth prince rang in Xie Xi’s ears. “I have been waiting for this day for a long time.”</p><br/><p>Xie Xi thought, ‘We have known each other for a total of three days. How long have you been waiting?’</p><br/><p>Unfortunately, he had to follow the dream. Xie Xi smiled, showing the right amount of embarrassment.</p><br/><p>The fifth prince trembled and kissed him on the tip of the ear. “It was the greatest luck in my life that I met you.”</p><br/><p>Xie Xi was very uncomfortable and looked at him through the mirror. “…Me too.”</p><br/><p>He was glad that his outfit had long sleeves and that his arm was covered. Otherwise, the goosebumps would reveal his lame acting.</p><br/><p>The fifth prince was very happy, his eyes shining like stars. He took Xie Xi’s hand and said, “Let’s go, my lover.”</p><br/><p>Xie Xi’s palms were sweaty but he didn’t dare say anything for fear of waking up the crazy prince!</p><br/><p>Once he left the room, Xie Xi discovered that he was in a large manor.</p><br/><p>The corridors in the castle were extremely long, covered with clear portraits and landscapes.</p><br/><p>This was the first time Xie Xi used Dreaming but he knew it wasn’t this simple. Who had never had a dream? It wasn’t easy to recreate all of this, even if it was a familiar place. The fifth prince had very high attainment in art and this could be seen from these details.</p><br/><p>Xie Xi allowed him to lead and walked to the spacious spiral staircase. The staircase was wide and could accommodate three or four people standing side by side. It was only from the second floor to the main hall but it had already reached an amazing height.</p><br/><p>They walked down the stairs and saw a huge shark statue in the main hall.</p><br/><p>The statue was carved realistically and it was unknown how it was fixed there, but there was a sense that it was swimming in the water.</p><br/><p>Xie Xi was gobsmacked. The prince’s dream was really detailed.</p><br/><p>Outside the castle, there was an endless garden, the coral sea more beautiful than fireworks in the sky. Beautiful fluorescent fish danced and created an unparalleled dream spectacle.</p><br/><p>Roast Pork Bun was excited and he ran to catch the fish. “It’s so beautiful! This dream is really amazing! This is a really good dream!”</p><br/><p>Xie Xi thought, ‘It is worthy of the soul of a big designer. His imagination is really rich.’</p><br/><p>He didn’t think much about it. This was X’s dream. It was impossible for someone else to make something so realistic. The wedding car was stopped in the middle of the garden and they strolled through the colourful scenery towards the car.</p><br/><p>There were quite a few people around but Xie Xi didn’t know any of them. They should be the fifth prince’s friends. It was worth noting that none of the other princes appeared, even the fourth prince.</p><br/><p>The fifth prince and fourth prince had a good relationship. Why didn’t he let the fourth prince appear at the wedding?</p><br/><p>Xie Xi couldn’t understand it for the moment.</p><br/><p>After the wedding car, the dream became even more amazing.</p><br/><p>The location of the manor was some distance away from the palace. Their wedding car drove very slowly. It was almost the speed of a turtle crawling forward.</p><br/><p>Xie Xi understood. This was the fifth prince’s grand gesture to show their ‘marriage’ to the world!</p><br/><p>Roast Pork Bun exclaimed, “Amazing! The mermaids outside all have different faces!”</p><br/><p>Xie Xi also felt admiration in his heart. Inside the big wedding car, Xie Xi vaguely felt that the person around him was a bit nervous.</p><br/><p>Xie Xi stared at him. “Your Highness?” Randall’s palms were sweaty.</p><br/><p>The fifth prince kept holding his hand tightly. “There is always a feeling that this isn’t real.”</p><br/><p>Xie Xi was shocked.</p><br/><p>The fifth prince turned to look at him, eyes shining like starlight. “I am so happy that it feels like a dream.”</p><br/><p>The problem was… he really was dreaming! Xie Xi was afraid of the prince waking up and quickly changed the topic. “Your Highness, I am also very happy.”</p><br/><p>This worked so well that the fifth prince approached him and whispered, “Don’t call me Your Highness after today.”</p><br/><p>Xie Xi, “…” What was this setting?</p><br/><p>“You are my partner and we are equals. Call me by my name later, okay?”</p><br/><p>Xie Xi sighed with relief. Ah, it was just his name. Xie Xi thought it would be some strange term of endearment.</p><br/><p>Then the fifth prince said, “…Or call me Dear.”</p><br/><p>Xie Xi, “!”</p><br/><p>For the sake of the dream, endure it!</p><br/><p>The fifth prince laughed. “Small Sein is shy again.”</p><br/><p>Xie Xi was 100% embarrassed. He gritted his teeth and said, “Your Highness, don’t tease me.”</p><br/><p>Xie Xi’s true feelings made him grit his teeth but under the fifth prince’s dream filter, he became angry.</p><br/><p>“Okay.” The prince raised his hand. “I won’t tease you.”</p><br/><p>Xie Xi pretended to be angry and fell silent. The fifth prince thought he was cute and couldn’t help whispering, “Call me.”</p><br/><p>“Hrmm?”</p><br/><p>The fifth prince pinched his white fingers and demanded, “Call me by my name.’</p><br/><p>Xie Xi couldn’t provoke him and had to say, “Randall.”</p><br/><p>The fifth prince let out a low laugh. “My name spoken from your mouth is the true voice of heaven.”</p><br/><p>Xie Xi froze as he remembered the sixth prince saying that it was the first time his name felt so nice.</p><br/><p>These two brothers… well, it was true that this group of souls had the same ‘origin.’</p><br/><p>His heart softened as he recalled the poor sixth prince.</p><br/><p>The wedding car finally reached the palace after crossing half of the capital.</p><br/><p>The fifth prince was faintly uneasy. Not only did he hold Xie Xi’s hand tighter, his eyes also flashed.</p><br/><p>Xie Xi thought to himself, ‘Is there premarital phobia in a dream?’ It was really a foreign trend.</p><br/><p>However, he soon discovered what Randall was nervous about. The wedding car just entered the palace when the atmosphere changed. If the outside contained jubilant gongs and drums, the palace was cold and solemn.</p><br/><p>Xie Xi was somewhat confused.</p><br/><p>The wedding car stopped. The fifth prince’s lips thinned as he stared straight ahead. “Let’s get off.” It felt like there were enemies around them.</p><br/><p>Xie Xie Xi glanced at the bottom right corner. The orange progress was 14%.</p><br/><p>He suspected that it would become full from this dream. The fifth prince’s goodness’ made him feel really unbearable.</p><br/><p>This was just accompanying him to have a good dream!</p><br/><p>Xie Xi followed the prince out of the car. The previously smiling maids who gave their blessings now bowed silently.</p><br/><p>The fifth prince took Xie Xi’s head and stood tall, as if he was a general about to embark onto a battlefield.</p><br/><p>Xie Xi vaguely understood after seeing the guards in front of him.</p><br/><p>The snow white sails were the symbol of the queen.</p><br/><p>They walked past the solemn ceremonial guards to the end of the road.</p><br/><p>The fifth prince walked with Xie Xi and saw they saw the fifth prince’s mother. The queen was wearing magnificent clothing and her face was as cold as ice.</p><br/><p>The fifth prince’s eyes gradually became darker as he saluted his mother. Xie Xi naturally followed suit. He was a commoner meeting such a big person.</p><br/><p>The queen didn’t look at Xie Xi and shouted at Randall, “Ridiculous!”</p><br/><p>Xie Xi understood that this was the problem.</p><br/><p>The fifth prince said, “Mother, please fulfill your son’s heart!”</p><br/><p>The queen was furious. “Randall, are you out of your mind? Have you become obsessed with a sly ghost? You are the prince of Atlantis. How can you marry an ordinary guard?”</p><br/><p>“He is Sein Hall, the love of my life.”</p><br/><p>“Ridiculous!” The scepter in the queen’s hand hit the ground, making a loud sound. “You have the noblest blood of the royal family and you are an honourable prince of this undersea kingdom. How can your marriage be like this?”</p><br/><p>Randall looked up at his mother with a look of contempt. “The noblest blood? An honourable prince? I never cared about that!”</p><br/><p>The queen’s lips trembled. “You are just messing around. Don’t make a fool of yourself! You can’t marry him. Your father won’t allow you…”</p><br/><p>“Father will allow it.” The fifth prince interrupted the queen’s words. “I will give up my right to the throne and will marry whoever I want.”</p><br/><p>This was tantamount to a deep-water torpedo hitting the queen.</p><br/><p>She stared at the fifth prince in a dumbfounded manner. This was her only son, the last hope of her life…</p><br/><p>There were no tears at the bottom of the sea but the queen’s eyes were red and her voice sounded like she was crying. “Silly boy, silly child!”</p><br/><p>The prince’s eyes flashed but he was determined. He held Xie Xi’s hand and refused to let go.</p><br/><p>The queen cried out, “Do you really think that they will let you go, even if you don’t want the throne?”</p><br/><p>The fifth prince was distressed by his mother but he was persistent. “Mother, I know your concerns but I have never wanted to inherit the throne. I just want to live freely and be with the person I love.”</p><br/><p>“How can you think so simply?” The queen was heartbroken. “You are my son, the only legitimate heir to the throne. As long as you live, you will be a thorn in the eye of the new king!”</p><br/><p>The fifth prince was obstinate. “I have no power and have never touched the government. The new king won’t kill his brother.”</p><br/><p>“This is my fault, my fault! I let you become so naive!”</p><br/><p>The fifth prince no longer spoke, resisting with his silence.</p><br/><p>Xie Xi listened to all of this, his heart quite complicated.</p><br/><p>This was the fifth prince’s dream. The fact that he dreamt it showed that he had these things in his heart. He wasn’t innocent. He knew everything but didn’t want to succumb to a life he hated.</p><br/><p>The mother and son fell apart. The queen stood there motionless and declared, “I won’t accept your marriage. Don’t return to the palace if you want to make a fool of yourself!”</p><br/><p>The fifth prince had enough and turned to leave with Xie Xi. “Let’s go.”</p><br/><p>The queen angrily slammed the scepter against the ground. “Randall, you coward, you deserter, you are bound to be defeated by the storm!”</p><br/><p>The fifth prince’s back was straight as he strode forward, never turning back.</p><br/><p>Xie Xi actually felt that Randall was a bit handsome.</p><br/><p>Not everyone had such courage to resist fate and resist the shackles, seeking out their ideal life.</p><br/><p>The wedding seemed impossible. Xie Xi didn’t know how this dream would continue.</p><br/><p>The fifth prince took him out of the palace and walked towards a secluded street.</p><br/><p>He was silent and Xie Xi couldn’t open his mouth. The two people were dressed in magnificent clothing, causing the depressed atmosphere to be particularly glaring.</p><br/><p>Then the fifth prince whispered, “I’m sorry.”</p><br/><p>“No.” Xie Xi looked up at him. “Your Highness is very brave.”</p><br/><p>The fifth prince stared into his eyes and asked, “Sein, if I wasn’t me, would you still love me?”</p><br/><p>Xie Xi, “…”</p><br/><p>This topic…</p><br/><p>Randall’s eyes were bright and filled with the warmth of the noon sun. “If I wasn’t a prince, would you still love me?”</p><br/><p>Xie Xi’s eyes narrowed as the orange progress bar in the lower right corner suddenly reached 16%.</p><br/><p>If he said love, it would be full.</p><br/><p>Comrade Jiang Xie, who was seriously watering the dried roses, heard this and couldn’t hold onto his kettle.</p><br/><p>What would Xie Xi say?</p><br/><p>Once Randall’s soul returned to Jiang Xie, he would have such a wonderful experience.</p><br/><p>It was just… his mood was very complicated.</p><br/><p>Who would understand this mood of wanting to hear but not daring to listen?</p><br/>\n</div>"}