{"title": "Chapter 45", "id": 45, "volume": 1, "url": "http://boxnovel.org/game-loading-chapter-45", "volume_title": "Volume 1", "body": "<h1>Chapter 45</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Lost Atlantis 16</p><hr/><br/><p>The fifth prince stared at Xie Xi without blinking. His pupils contained the passion of fire, as well as some uneasiness and tension.</p><br/><p>This was fascinating.</p><br/><p>It was purely charming.</p><br/><p>Xie Xi smiled and whispered, “Aren’t you Randall? If so, my mind will never change.”</p><br/><p>Randall held his upper arm in an excited manner. “Really?”</p><br/><p>Xie Xi nodded.</p><br/><p>Randall hugged him hard, as if holding a world famous treasure. He was filled with joy and a desire to take care of something precious.</p><br/><p>This fervent emotion infected Xie Xi, so that he couldn’t help smiling.</p><br/><p>He didn’t hate Randall.</p><br/><p>Jiang Xie continued to take care of the dry roses, thinking of Xie Xi’s words.</p><br/><p>—Aren’t you Randall?</p><br/><p>No.</p><br/><p>—If so, my mind will never change.</p><br/><p>Fortunately, he wasn’t Randall or he would never be liked by Xie Xi? Jiang Xie felt more comfortable after hearing these words and looked at the water curtain. He touched Xie Xi’s forehead and said, “It is a bit clever.”</p><br/><p>Xie Xi thought the dream was almost over. Who would’ve expected it to continue? The task progress had risen to 16.5% and there was only a short distance left to the full amount.</p><br/><p>Xie Xi felt that if he directly said ‘I love you’, it would probably be full already.</p><br/><p>However, he couldn’t say this. It wasn’t just because of himself. He just felt that it would be too cruel to the fifth prince.</p><br/><p>Randall released him and said, “Let’s go. Leave the palace, leave the capital!”</p><br/><p>Xie Xi asked him, “What about the queen?”</p><br/><p>Randall showed toughness during his confrontation with the queen, but Xie Xi felt that Randall cared about his mother.</p><br/><p>Randall shook his head. Mother will be fine. Once I leave, she will close off her heart and no longer think about the person who had nothing.</p><br/><p>His mother loved the prince Randall, not the independent Randall. He was destined to be unable to fulfill her wish so it was easy to break it off now.</p><br/><p>This was good for everyone.</p><br/><p>Xie Xi stared at him. “Your Highness, won’t you regret it?”</p><br/><p>Randall was startled but he soon smiled. His smile was as pure as golden sand flowing down. “No regrets. If you and I can be together, I absolutely won’t regret it.”</p><br/><p>Xie Xi smiled and linked their fingers. “Let’s go. I’ll go wherever Randall goes!”</p><br/><p>This was really sweet. The fifth prince smiled, his handsome face looking like a landscape painting that was so dazzling that people couldn’t open their eyes.</p><br/><p>He whispered softly, “I’m so happy. Sein, am I really not dreaming?”</p><br/><p>Xie Xi tensed up.</p><br/><p>He had to say some roundabout words, “If it is a dream, we would’ve received everyone’s blessing.”</p><br/><p>Randall smiled. “Yes, if it is a dream then I would have Mother accept you and make all the sea mermaids sing for us!”</p><br/><p>Xie Xi only hoped that Randall wouldn’t remember these words when he woke up.</p><br/><p>Otherwise… it was too ironic.</p><br/><p>He just said it wasn’t a dream when there was a scene change that only appeared in a dream.</p><br/><p>Fortunately, Randall didn’t feel that something was wrong. He thought that he left the kingdom with Xie Xi, left the centre of power and headed to the beautiful countryside.</p><br/><p>They settled down in a remote down.</p><br/><p>The fifth prince still had some savings. He bought a small house and told Xie Xi, “I have temporarily wronged you. Later, I will personally design our love nest.”</p><br/><p>Xie Xi could design it. After all, a big designer… In any case, he didn’t believe the dream would last that long so he replied, “I’m looking forward to it.”</p><br/><p>The fifth prince was spoiled. Even if he was the favourite among the princes and princesses, his mother was strong and the old king didn’t want to give him the position of this. This was psychologically good for him.</p><br/><p>The prince was born with a golden spoon yet he did all types of rough work in the dream.</p><br/><p>He cleaned the house, washed the clothes and even cooked.</p><br/><p>Xie Xi was surprised. “Your Highness… this is amazing.”</p><br/><p>The fifth prince glanced at him. “I told you, don’t call me that.”</p><br/><p>Xie Xi corrected himself. “Randall, how do you know all this?”</p><br/><p>The fifth prince’s smugness was cute. “I’m not impulsive. Since I wanted to elope with you, I naturally had to be prepared!”</p><br/><p>E-Elopement.</p><br/><p>Xie Xi felt it funny, strange and distressing.</p><br/><p>The fifth prince really wasn’t joking. He seriously considered the future and prepared for it.</p><br/><p>Xie Xi rolled up his sleeves. “I’ll help.”</p><br/><p>The fifth prince pushed him out. “Give me a chance to perform. I have to let you know that you didn’t choose the wrong person.”</p><br/><p>Xie Xi was forced to retreat to the door. “Okay, I will watch from here.”</p><br/><p>The fifth prince was quite skilled and his knife movements were excellent.</p><br/><p>The food in the underwater world had a wide variety. Of course, there was no fire and the undersea creatures didn’t like to eat cooked food. It was basically sashimi as well as edible coral and fruits that were unique to the sea.</p><br/><p>Xie Xi initially wasn’t used to it. After a while, he found that he kinda liked the food.</p><br/><p>The fifth prince told him, “There are fruit sacs outside. Go and pick a few.”</p><br/><p>This was similar to a drink. There was a special straw at the top that they could use to drink delicious fruit pulp.</p><br/><p>Xie Xi nodded. “Okay.”</p><br/><p>He went outside and felt a different atmosphere as soon as he reached the fruit sac tree.</p><br/><p>A wave of killing intent brushed against his cheeks.</p><br/><p>Xie Xi tensed up and a hint appeared in the lower right corner.</p><br/><p>[The dream is coming to an end. Please feel free to leave.] This was followed by a countdown.</p><br/><p>Randall’s dream was over?</p><br/><p>This thought had just flashed through Xie Xi’s mind when Randall’s scream was heard, “Sein!”</p><br/><p>Xie Xi saw the uniform of the underwater army.</p><br/><p>Randall hugged him and screamed at the soldiers holding the weapons, “What are you going to do?”</p><br/><p>Xie Xi vaguely guessed what would happen next.</p><br/><p>He didn’t expect the fifth prince’s dream to end in such tragedy.</p><br/><p>He felt sorry but it couldn’t be helped.</p><br/><p>Xie Xi looked at the countdown and chose to leave the dream towards the end. The moment his mind was being pulled away, he heard the fifth prince’s angry voice, “Sein, no!”</p><br/><p>Xie Xi returned to reality.</p><br/><p>He quickly left the bed and hid behind a screen.</p><br/><p>The fifth prince suddenly woke up. The movement of sitting up was too big and the whole bed trembled.</p><br/><p>Most undersea people were suspended on the bed. The fact that he made such a big movement was enough to show how shocked the prince was.</p><br/><p>After a long time, the fifth prince whispered, “It’s a dream… it is just a dream.”</p><br/><p>Xie Xi hadn’t seen the last scene but guessed what had happened. It was a dream where he had been killed.</p><br/><p>He didn’t know who sent the soldiers but their goal was clear: Kill Sein Hall.</p><br/><p>The orange bar stopped at 16.66% and didn’t turn green. It indicated it wasn’t full but the difference of 0.0066..% was very small.</p><br/><p>Unfortunately, Sein Hall was dead.</p><br/><p>Once the fifth prince learnt about this…</p><br/><p>Xie Xi didn’t dare think about it.</p><br/><p>It was still the early hours of the morning and there was some time left until dawn.</p><br/><p>However, Randall wasn’t sleepy. He got out of bed and put on a coat.</p><br/><p>He didn’t sleep and Xie Xi didn’t dare go out. He could only hide behind the screen, fearing that he would be discovered.</p><br/><p>He didn’t know what Randall was thinking but there was the rustling sound of him dressing.</p><br/><p>Roast Pork Bun reported, “The fifth prince is wearing fur… ah, he is wearing clothes!”</p><br/><p>Xie Xi couldn’t make any noise and Roast Pork Bun guessed, “It looks like he is going out.”</p><br/><p>This was the middle of the night. Where was he going?</p><br/><p>Randall got dressed and went out of the room. Xie Xi waited a while before following.</p><br/><p>He had a faint guess but he really felt complicated when he saw Randall go to the guards’ quarters.</p><br/><p>Randall had this dream and his heart wasn’t stable. He wanted to see Sein Hall.</p><br/><p>It was a pity…</p><br/><p>Xie Xi hid around the corner and secretly watched.</p><br/><p>Randall stood outside the guards’ quarters, hesitating for a while before eventually deciding not to go in. It was as if he didn’t want to disturb Xie Xi’s sleep.</p><br/><p>Still, he didn’t leave. He stood there, as if waiting for dawn.</p><br/><p>Xie Xi’s heart was like a bitter gourd cut into pieces.</p><br/><p>Half an hour passed and a figure staggered from the darkness. Xie Xi saw it instantly from the outline. This was the sixth prince.</p><br/><p>Roast Pork Bun spoke on behalf of his father. “A cold heart!”</p><br/><p>Xie Xi could barely handle staying any longer.</p><br/><p>The fifth prince saw the sixth prince and felt a sense of crisis. “Sixth Brother, what are you doing here so early?”</p><br/><p>The sixth prince was in a trance and didn’t hear the fifth prince’s voice at all.</p><br/><p>The fifth prince saw him go straight to Sein Hall’s bedroom and spoke in a disgruntled manner, “He is sleeping. Don’t wake up him!”</p><br/><p>The sixth prince didn’t react. He was pale and his different-coloured eyes were lost. There was no light in them.</p><br/><p>The fifth prince’s heart beat faster as he asked, “What happened to you?”</p><br/><p>The sixth prince didn’t look at him and went to open the door.</p><br/><p>The fifth prince grasped his wrist. “Sein is still sleeping. Why are you coming to bother him so early?”</p><br/><p>The name was like a blunt knife that grinded at Sirius’ heart. His hands trembled and his voice was hoarse, “Sein…”</p><br/><p>Randall frowned. “What the hell is wrong with you? What happened?”</p><br/><p>Sirius turned in a dazed manner towards Randall. “Sein…”</p><br/><p>Randall’s five viscera and six bowels (from traditional Chinese medicine) seized up, the fear from his dream growing wings and flying into reality. “What happened to Sein?!”</p><br/><p>“He is dead.” Sirius spoke in a soulless voice.</p><br/><p>Randall’s pupils shrank, the veins in the hand holding Sirius’s wrist bulging violently. “What are you talking about?!”</p><br/><p>Sirius’ eyes were wide, his lips pale enough to be transparent. “Sein is dead, Sein Hall…”</p><br/><p>“Shut up!” Randall was furious. “Sein is kind and showed care towards you. How can you curse him like this?”</p><br/><p>Sirius heard these words and stiffened as he thought about the warmth he received from Sein Hall.</p><br/><p>Randall said this but there was a great uneasiness in his heart. His voice trembled, “He must be sleeping…” Then he opened the door and saw the empty sleeping quarters.</p><br/><p>Sirius stood motionless and didn’t look.</p><br/><p>Randall’s face was white as he kept denying it. “He… he must be on night shift and isn’t back yet.”</p><br/><p>Sirius whispered, “He isn’t coming back. He will never come back.”</p><br/><p>The angry and anxious Randall punched Sirius.</p><br/><p>Sirius didn’t move and received the punch, blood overflowing from the corners of his mouth.</p><br/><p>“Don’t be an alarmist! Sein, how can Sein… impossible!” Randall couldn’t believe it. Yesterday it was still good and he planned to invite Sein to a concert. He also dreamt about their wedding. How, how could…</p><br/><p>Sirius spoke in a voice that didn’t fluctuate. “He went to the shore with me and went to the back warehouse to find something… the ship exploded and he died.”</p><br/><p>He was talking to Randall but also telling himself.</p><br/><p>Randall was stunned and stared straight ahead, his mind in chaos.</p><br/><p>Sirius’ eyes were hollow. “I’m sorry.”</p><br/><p>Randall grabbed him by the collar. “What are you talking about? He went to the shore with you? Why did you take him ashore? He is just a little mermaid. How can he stand the air on the shore?”</p><br/><p>Sirius was lifeless and let himself be grabbed.</p><br/><p>Randall released him. “No, it is impossible. You’re lying to me. Sein isn’t dead. He can never die, I… I didn’t have time to tell him…”</p><br/><p>Randall staggered away. Sirius was frozen for a long time before finally walking towards Sein Hall’s bed.</p><br/><p>He sat on the bed, quietly looking at everything in front of him.</p><br/><p>Roast Pork Bun cried like a silly cat as he flew around the sixth prince. “He is so pitiful, really pitiful.”</p><br/><p>Xie Xi also felt pained.</p><br/><p>Whether it was the sixth prince or fifth prince, he was very distressed when looking at them.</p><br/><p>It wasn’t that type of feeling. He just saw a friend in pain and his heart felt uncomfortable.</p><br/><p>He couldn’t help feeling angry towards X. If X hadn’t designed such a broken world, how could these two people suffer so much?</p><br/><p>Then again, they were wisps of X’s consciousness. He didn’t know if he should be sad about this stupid Fork.</p><br/><p>Jiang Xie was seeing what could be described as red and green. One moment it was +1 and the next moment it was -1. They rose and fell, like the ups and downs of life.</p><br/><p>Xie Xi felt guilty and accompanied the sixth prince for a while.</p><br/><p>The sixth prince had come back at night and swam all that way. He must be extremely tired.</p><br/><p>He slowly fell onto Sein Hall’s bed and closed his eyes.</p><br/><p>There were no tears at the bottom of the sea but the trembling eyelashes were more distressing than any crying.</p><br/><p>Xie Xi sighed and used Dreaming.</p><br/><p>The task progress was already full. He just wanted to comfort Sirius.</p><br/><p>[You have successfully used Dreaming and entered the dream of Sirius Atlantis.]</p><br/><p>Xie Xi opened his eyes and felt a heat wave.</p><br/><p>Sirius dreamt about what happened on the shore.</p><br/><p>Xie Xi’s mood was complicated. He didn’t want Sirius to fall into this unresolved nightmare forever.</p><br/><p>“Sirius.” He called out the sixth prince’s name.</p><br/><p>In the dream, Sirius didn’t smile. He just looked at Xie Xi with a calm that was frightening.</p><br/><p>Xie Xi came forward to hold him. “Don’t be like this. I hope that you can live happily.”</p><br/><p>His words were the last straw that crushed the camel.</p><br/><p>Sirius’ tears flowed down and he hugged Xie Xi tightly, as if trying to pull Xie Xi into his bone marrow.</p><br/><p>Xie Xi sighed. “Promise me. Live well…”</p><br/><p>“I’m sorry.” Sirius’ voice was hoarse and difficult to hear.</p><br/><p>Xie Xi was stunned.</p><br/><p>Sirius’ tears that fell on his neck were as piercing as ice, his voice like the cold wind of winter. “It was my incompetence that killed you. I failed to protect you and I don’t deserve you.”</p><br/><p>“Sein.” Sirius’ cold lips touched Xie Xi’s ears, his voice extremely gentle. “I will make them pay the price they deserve.”</p><br/>\n</div>"}