{"title": "Chapter 61", "id": 61, "volume": 1, "url": "http://boxnovel.org/game-loading-chapter-61", "volume_title": "Volume 1", "body": "<h1>Chapter 61</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Lost Atlantis 32</p><hr/><br/><p>The progress bar of the main task had five colours. The green represented the finished fifth and sixth princes while the almost full red and purple were the third and second princes. Now there was the small white and black colours.</p><br/><p>The information bar panel was transparent so the white colour was also conspicuous and could be seen clearly.</p><br/><p>White was the fourth prince so black could only be the eldest prince.</p><br/><p>It was easy to understand but why did the eldest prince’s progress suddenly rise by nearly half? 8% was equivalent to 50% love. Xie Xi didn’t do anything and didn’t even see the other person. How was it halfway to love already?</p><br/><p>Xie Xi stared at the progress bar for a while and changed his train of thought. Perhaps the white bar was the eldest prince? The eldest prince might’ve been there when he cleaned up the rubbish and the progress went up first. Then the fourth prince came out and Xie Xi mistook it for the fourth prince?</p><br/><p>Then this sudden 8% rise in black was the fourth prince?</p><br/><p>Even if it was the fourth prince, this increase was inexplicable. Previously, he was indifferent and then it surged after applying the medicine?</p><br/><p>Xie Xi couldn’t figure it out and he couldn’t understand their thoughts.</p><br/><p>Unfortunately, Roast Pork Bun couldn’t be too far away from him or he would have Roast Pork Bun go and investigate the eldest prince.</p><br/><p>Xie Xi couldn’t think too much. The medicine also affected his head and he fell asleep after closing his eyes.</p><br/><p>It was evening when he woke up. Xie Xi didn’t panic. He had already prepared and made it so Colin went home to visit for two days. He had been really afraid of the crazy second and third princes and hadn’t wanted to see them for a while.</p><br/><p>Xie Xi was surprised to find that his injuries were all healed. There were still some traces on the tail and it was estimated that the scales recovered more slowly.</p><br/><p>This medicine was amazing and Xie Xi felt that the technology on the seabed was much more powerful than land.</p><br/><p>He had just left the room when he saw a mermaid waiting outside. “His Highness said that you can leave if you wake up. His Highness has something to do and can’t send you.”</p><br/><p>Xie Xi hurriedly said, “I have been a bother to His Highness and don’t dare trouble him any longer.”</p><br/><p>Then Xie Xi left the fourth prince’s palace.</p><br/><p>He was concerned about the black progress bar. He secretly went to the palace of the eldest prince and found that the diligent prince hadn’t come back and was working overtime.</p><br/><p>Was the black progress bar really his? Xie Xi waited for a while but the prince didn’t come back. He could only leave first.</p><br/><p>His ‘leave’ time wasn’t long and he had to complete the side mission!</p><br/><p>Yesterday, Xie Xi had collected 330,000 tons of garbage with the fourth prince’s help and the progress of the side task reached 33%. He thought this would be a difficult task to complete but unexpectedly it wasn’t that difficult. It could easily be completed with a little suffering of his flesh!</p><br/><p>Xie Xi left to go find rubbish. He was just passing the original town when he remembered the little mermaid and wanted to see her…</p><br/><p>He had just swam to the edge when he felt the tingling sensation again.</p><br/><p>Xie Xi looked over and his heart sank.</p><br/><p>He had disposed of the garbage yesterday and collected 10,000 tons. At this moment, the same place had once again become a sea of garbage.</p><br/><p>Roast Pork Bun wondered, “What’s going on? Daddy, are we in the wrong place?”</p><br/><p>There was no mistake. This was the town.</p><br/><p>The words of the fourth prince rang in his head. ‘The garbage can be cleaned up but as long as the land people are there, new rubbish will soon be born.’</p><br/><p>Thus, this was the new rubbish.</p><br/><p>So much garbage was made overnight?</p><br/><p>Xie Xi’s head buzzed as he thought about the billions of people on land and their huge base. Even if someone only made a bit of garbage in one day, this would be terrified when multiplied by billions.</p><br/><p>Just getting rid of garbage would really make the land people worse.</p><br/><p>They would continue to keep breaking through the bottom line.</p><br/><p>Xie Xi collected the garbage here and went to a few places he had been to yesterday. He didn’t have the fourth prince so his speed was very slow. He was breathless when swimming but it was good that he remembered the road. Otherwise, there would be more trouble.</p><br/><p>Xie Xi got the chills. The more he saw, the more he understood the mood of the fierce militant faction.</p><br/><p>The garbage was cleared only to pop up again overnight.</p><br/><p>Xie Xi could clear it up with one button. What could the underwater people use to clean it up?</p><br/><p>He was just cleaning up the third pile of garbage when the fourth prince’s cold voice was heard behind him. “Didn’t I tell you to stop using this ability?”</p><br/><p>Xie Xi turned and looked at the fourth prince. “Your Highness has cleared up the garbage before right?</p><br/><p>How could Xie Xi not understand? The fourth prince said this because he must’ve experienced it a long time ago.</p><br/><p>How could the royal family idly sit by and ignore the garbage hurting so many people?</p><br/><p>They must’ve organized to clean up the garbage but as the fourth prince said, it was useless to clean up. Soon, new garbage would appear. On the contrary, the land people became more fearless because the garbage was cleaned up.</p><br/><p>The fourth prince sneered, scorn in his eyes.</p><br/><p>Xie Xi stated, “You have been sick because you used this medicine.”</p><br/><p>The fourth prince wasn’t sick but he was really injured. Xie Xi was hurt despite getting rid of the garbage with one button. The fourth prince had to use ordinary methods to clean up the garbage and the damage must be greater. The medicine could treat the wounds but it had the side effect of fatigue. The fourth prince…</p><br/><p>Xie Xi didn’t think about how much the seabed people paid in order to clean up the garbage, only for it to pile up again. How desperate would they feel?</p><br/><p>The fourth prince had no expression on his face. “Thus, don’t do this useless work anymore.”</p><br/><p>Xie Xi’s throat was tight and his mouth full of bitterness.</p><br/><p>The fourth prince glanced at Xie Xi and whispered, “There is a flaw in your ability.”</p><br/><p>Xie Xi couldn’t react. He didn’t quite understand the meaning of this sentence.</p><br/><p>The fourth prince’s lips curved, smiling in a fierce and paranoid manner. “The land people are the biggest garbage. Why not let them all disappear!”</p><br/><p>Xie Xi was violently shocked and sweat dripped down his back.</p><br/><p>“Let’s go.” The fourth prince took Xie Xi’s hand. “I will send you back. Don’t use this ability anymore. It can’t help anyone and will bring you trouble.”</p><br/><p>Xie Xi heard these words and his chest heated up as he held onto the fourth prince’s hands. “Your Highness, can you take me to the land?”</p><br/><p>The fourth prince was slightly startled.</p><br/><p>Xie Xi told him, “I have never been to the land. Can you take me to see it?”</p><br/><p>The fourth prince raised an eyebrow. “What are you going to do?”</p><br/><p>“I have my own way of paying them back.”</p><br/><p>The fourth prince’s pupils shrank.</p><br/><p>He didn’t ask again. He just held Xie Xi’s hand and stated, “The shore is very hot. If you can’t bear it, stay close to me.”</p><br/><p>Then he rushed off at a very fast speed, taking Xie Xi up to the sea.</p><br/><p>Xie Xi knew what it was like on the shore but he wouldn’t stay on the shore for long. It was just a temporary thing.</p><br/><p>After a while, they left the see. Thanks to the hot air, his whole chest was hot. He sent Roast Pork Bun a look.</p><br/><p>Roast Pork Bun didn’t know what Roast Pork Bun was planning but he understood this look was to have him search around.</p><br/><p>Roast Pork Bun flew up and watched for a while. Then he came back and reported, “There is no one on the beach!”</p><br/><p>Xie Xi blinked and Roast Pork Bun hung onto his collar again.</p><br/><p>The fourth prince asked him, “What are you going to do?”</p><br/><p>Xie Xi explained, “In fact, I lied to Your Highness before. My ability isn’t to eliminate garbage but to collect it.”</p><br/><p>The fourth prince frowned. “Collect? What do you mean?”</p><br/><p>Xie Xi opened the items bar, looked at the 550,000 tons of rubbish and spoke lightly, “It’s like this…” Then he poured the rubbish back onto the land.</p><br/><p>This scene was amazing. Countless rubbish poured out of Pandora’s Box, madly pilling up on the beach and along the entire coast.</p><br/><p>This garbage piled up and became a shocking garbage mountain!</p><br/><p>The fourth prince looked stunned and couldn’t recover his spirit for a while.</p><br/><p>Xie Xi glanced at his side task progress bar. Sure enough, he took out the garbage and the progress fell from 55% to 0%.</p><br/><p>His work yesterday and today were in vain but he felt no regrets.</p><br/><p>Xie Xi suggested, “It is useless to clean up the garbage. Then shouldn’t we give them back the garbage they discarded?”</p><br/><p>Pampering would only give birth to greater evil. Appropriate punishment was to let them see what they had done!</p><br/><p>A flame of hope was ignored in the fourth prince’s grey eyes that still seemed like a tomb. “You…”</p><br/><p>His voice trembled and he couldn’t speak.</p><br/><p>Xie Xi whispered, “I understand Your Highness’ mind. You hate the land people and want to kill them but war is the worst way to solve the problem. In the end, both sides will lose. You love your people and don’t want them to jump from one fire pit to another fire pit.”</p><br/><p>The fourth prince was shocked and his thin lips became a straight line.</p><br/><p>Xie Xi looked up at him. “Can I help you? We will return the garbage and use it to drive public opinion on land. They will think they have angered the gods and spontaneously think about their own behaviour.”</p><br/><p>This was the best solution that Xie Xi could think of.</p><br/><p>War wasn’t going to solve the problem.</p><br/><p>It would intensify the contradiction between the people of the land and the sea and cause both sides to fall into a disaster.</p><br/><p>The underwater people must’ve thought of this method but they couldn’t do it like Xie Xi. He easily collected garbage and easily returned ti.</p><br/><p>This type of instantaneous behaviour was the most incomprehensible and inspiring thing.</p><br/><p>The fourth prince’s spirit finally returned. His brow furrowed as he whispered, “This is… just a cure for the symptoms and not the root cause.”</p><br/><p>He said this but the white progress bar on Xie Xi’s side rose to 13% in one breath.</p><br/><p>Xie Xi smiled.</p><br/><p>The fourth prince couldn’t look away. “Let’s go, your skin will be hurt soon.” The air on the shore was really deadly to merpeople and Xie Xi was indeed uncomfortable.</p><br/><p>The fourth prince held Xie Xi’s hand and took him back to the sea.</p><br/><p>Xie Xi was comfortably wrapped in the sea when he heard the fourth prince’s voice, “You aren’t allowed to collect garbage alone.”</p><br/><p>Xie Xi looked up at him.</p><br/><p>“This is our secret. Don’t tell anyone, do you understand?”</p><br/><p>Xie Xi smiled. “Is Your Highness protecting me?”</p><br/><p>The fourth prince trembled, “You don’t know the land people. If you let them know your ability, you will be imprisoned for life.”</p><br/><p>Xie Xi was a land person and definitely knew them.</p><br/><p>He found that this prince fish was very cute and said, “Yes, I’ll listen to Your Highness.”</p><br/><p>The white progress bar whizzed to 16%.</p><br/><p>Xie Xi found it funny but didn’t dare to laugh. Wasn’t this person too pure? Or was the big designer actually pure?</p><br/><p>Um…</p><br/><p>Xie Xi retracted this idea and refused to believe it. X was an extreme pervert, there was no mistake!</p><br/>\n</div>"}