{"title": "Chapter 73", "id": 73, "volume": 1, "url": "http://boxnovel.org/game-loading-chapter-73", "volume_title": "Volume 1", "body": "<h1>Chapter 73</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Homology</p><hr/><br/><p>Xie Xi received the invitation and once he accepted, he instantly changed his location.</p><br/><p>He had gone to a few quasi-worlds so the sudden change didn’t fluster him.</p><br/><p>Xie Xi calmed down and looked up.</p><br/><p>The scenery was completely different from his imagination. There wasn’t even a house here. It was just an endless sea of flowers. The white rose flowers were like clouds of heaven, a cluster of dreams…</p><br/><p>He had to admit that it was beautiful.</p><br/><p>Xie Xi didn’t have too much of a concept about beauty and ugliness but he had a normal aesthetic regarding other affairs.</p><br/><p>He liked the feeling of standing here, his mind clear and refreshed. It was as if all his tiredness and troubles had gone with the swaying white roses.</p><br/><p>He felt less annoyed when he saw the man with different coloured eyes not far away.</p><br/><p>Oh, this sentiment lasted for three seconds. After that… it really ruined all these beautiful roses!</p><br/><p>Xie Xi’s spirit returned and the dislike in his heart quickly turned into numbers flying out. How could X plant so many white roses?</p><br/><p>White roses represented pure love. How could this crazy pervert know what was pure?</p><br/><p>No! He didn’t understand love!</p><br/><p>Xie Xi smiled, his voice polite and courteous. “Hello God X.”</p><br/><p>Jiang Xie’s heart trembled as a red rain poured towards him. The taste of ice and fire were proportionate in his eyes.</p><br/><p>Jiang Xie spoke his name.</p><br/><p>Xie Xi stared blankly. “Zombie?” (TL: Xie Xi uses the characters Jiant Xie that mean zombie instead of the characters that actually make up his name.)</p><br/><p>They were the two worst homonyms that Xie Xi thought of.</p><br/><p>It was hard to hear and worse than the stupid Fork.</p><br/><p>Jiang Xie didn’t need to read Xie Xi’s mind to know what he was thinking and explained, “The river bearing spring will pass away, the moon declining over the pool will slant west.” (Jiang = river. The character used in this poem and Xie= slant)</p><br/><p>This poem was familiar. It was Zhang Ruoxu’s A Moonlit Night on the Spring River.</p><br/><p>Xie Xi finally knew it was river slant, not zombie but so what? He was still a silly fork anyway.</p><br/><p>Jiang Xie had long known Xie Xi’s name and there was no need to introduce it. Xie Xi was more curious about something else. “God X, are you a human?”</p><br/><p>Ever since experiencing the Fairy Tale Town world, Xie Xi knew that players who were selected by the Central Committee weren’t all humans. For example, Aaron was a dragon. Zhong Jin looked human but since he was Aaron’s friend, who knew what species he actually was.</p><br/><p>This wasn’t difficult to understand. If all the games were new worlds about to become independent, the selected people must come from thousands of world. Forget other worlds, the universe where Xie Xi existed might not only contain humans. It might have other intelligent creatures.</p><br/><p>Jiang Xie deliberately circumvented the topic because he was a bit distant from the child. The good feelings kept falling and he was afraid that this goodwill value would become a hatred value.</p><br/><p>Although the current -444 was very similar to a hatred value.</p><br/><p>“Come this way.” Jiang Xie moved sideways and Xie Xi saw a little pavilion in the garden. Xie Xi couldn’t help thinking about Love to the Left or Right. Randy often took him to the pavilion for afternoon tea.</p><br/><p>The style wasn’t the same. The pavilion in the quasi-world was more grounded while the one here was airy like clouds.</p><br/><p>Xie Xi followed and sat in a soft wide-back chair.</p><br/><p>Jiang Xie leaned over and poured tea for him.</p><br/><p>Xie Xi instantly saw the shadow of the housekeeper Randy…</p><br/><p>Jiang Xie glanced at him and suddenly said, “Young Master, please drink the tea.”</p><br/><p>Xie Xi instantly stiffened and his eyes slightly widened. The result was that -1, -1, -1, -1… flew towards the -444.</p><br/><p>Well…</p><br/><p>Jiang Xie honestly changed the topic. “I am human. In theory, we are homologous.”</p><br/><p>These words really diverted Jiang Xie’s attention. Xie Xi was really scared but he soon remembered the matter regarding the world plot. Jiang Xie must’ve seen it and knew what Xie Xi experienced.</p><br/><p>The young master was playing a trick on him. Xie Xi was in a fit of rage and Jiang Xie had a wave of negative numbers.</p><br/><p>Poor Old Jiang his ‘world shaken’ countless times and was now a true iron plate!</p><br/><p>“We might have the same origin,” Jiang Xie hastened to save the precarious goodwill. “But it is a parallel world.”</p><br/><p>Xie Xi still wanted to know things and temporarily closed his prejudice. He asked, “Does it mean our worlds aren’t the same?”</p><br/><p>“You don’t need to use honorifics.” Jiang Xie continued. “In fact, as long as the timeline is different, it can be understood as a different world. Your world and mine belong in the same framework and are homologous worlds but the designer is different. There are difference clearance tasks and after the world became independent, it went in a different path. Thus, they became different worlds.</p><br/><p>Xie Xi was startled and couldn’t help taking a breath. “The designer is different?” The ‘real’ world where he lived was also designed!</p><br/><p>Jiang Xie continued, “After a world is cleared, all independent worlds are real. You don’t have to doubt this.”</p><br/><p>Xie Xi’s spirit returned and he asked, “All the worlds are designed? After they are cleared, the Central Government selects players from the independent world to clear new quasi-worlds?”</p><br/><p>It sounded like a loop.</p><br/><p>Designers created a quasi-world where collectors, explorers and recorders entered to complete tasks. They either discovered, collected, recorded or even tested quasi-world problems. Once the clearance task was complete, it would become a new world.</p><br/><p>In the process, a large number of players was bound to be eliminated. Then the Central Government would select new players from the worlds and things would be repeated.</p><br/><p>Xie Xi couldn’t imagine that his own world was designed. Who designed such a huge, logical and sophisticated world?</p><br/><p>Oh… Lost Atlantis was also magnificent and logical.</p><br/><p>Thanks to this, Xie Xi instantly lost his curiosity about the ‘creator god’ of his own world.</p><br/><p>Xie Xi’s mind moved and he asked, “The Central Government is also designed?”</p><br/><p>Jiang Xie praised him and guided him, “Who knows? Maybe we are in a quasi-world and an existence we don’t understand is trying to complete the clearance task here.”</p><br/><p>Xie Xi was shaken.</p><br/><p>It was quite possible, like a Russian doll. This might seem like the whole world but it was actually covered with layers and layers…</p><br/><p>It was ridiculous and very small, so small that the meaning of their own existence couldn’t be found.</p><br/><p>Jiang Xie told him, “This question can be considered but don’t question your own existence.”</p><br/><p>What if he questioned it?</p><br/><p>Xie Xi couldn’t help looking at him and wondered earnestly, “If you deny your existence, will you disappear?”</p><br/><p>Jiang Xie replied very firmly. “No.”</p><br/><p>Xie Xi was sensitive and referred to the first half of his words. “You mean, no one will deny their existence?”</p><br/><p>Jiang Xie smiled. “Right.” This child was really smart.</p><br/><p>No one could really deny their existence because once negated, their existence itself became a paradox.</p><br/><p>Negation didn’t exist because once it existed, it couldn’t be denied.</p><br/><p>The truth of oneself couldn’t be denied so there was no need to ask questions about disappearing.</p><br/><p>Jiang Xie spoke again, “You can’t deny it but you can question. The doubts will blur many things. What you need to do is to firmly believe in yourself.”</p><br/><p>Xie Xi felt thoughtful.</p><br/><p>He spoke these questions but they were difficult to see through. He needed more experience and time to gather to his own truth.</p><br/><p>Xie Xi still had doubts in his heart. “Why was I chosen?”</p><br/><p>It was estimated that everyone who came to the Central World would be curious about this.</p><br/><p>Why did he become a player, why did he leave the original world and why come to the Central World which was the upper layer of the Russian doll?</p><br/><p>Jiang Xie’s eyes flashed and there was some distress in his voice. “It is because in your world, no one needed you…”</p><br/><p>Xie Xi froze as cold moved from the soles of his feet straight up to his chest cavity.</p><br/><p>In his world, no one needed him anymore.</p><br/><p>Yes, his mother Xie Su was pregnant. She had a new child and a new family. He was just a burden.</p><br/><p>Jiang Xie’s low voice continued. “…And you aren’t tied to the world.”</p><br/><p>Xie Xi understood.</p><br/><p>His only tie in that world was Xie Su.</p><br/><p>He hated her and complained about her but he still loved her.</p><br/><p>This was his mother, his only relative.</p><br/><p>Xie Su was pregnant and gave up on him completely. He knew that his mother had a new life and finally let go.</p><br/><p>The only tie was broken so he came here.</p><br/><p>He was stunned but there weren’t many emotions on his face. This quiet appearance was extra painful.</p><br/><p>Jiang Xie didn’t know what Xie Xi had experienced in his own world but he could see the soft heart under Xie Xi’s lonely appearance.</p><br/><p>Even if he was abandoned, even if he only had himself, he was still strong.</p><br/><p>“Very good.” Xie Xi sighed with relief. “It is good that I came here.”</p><br/><p>He wasn’t depressed for too long.</p><br/><p>He wasn’t surprised that Xie Su gave up on him. He also gave up on her and they didn’t owe each other anything.</p><br/><p>There were no ties so it was good that he came to the Central World to start a new life.</p><br/><p>Well, it would be better if he didn’t encounter X!</p><br/><p>Jiang. life teacher. Xie found it wasn’t easy to rely on his mouth to add some goodwill as he lost points again…</p><br/><p>It definitely must be broken. What a trash skill.</p><br/><p>Xie Xi cheered up and had a new question. “God X, what happened to the princes after I cleared the world?”</p><br/><p>He wanted to know but after thinking about the last scene, he felt he wasn’t qualified to ask.</p><br/><p>Jiang Xie pondered a bit before saying good things. “You don’t have to worry about it. It won’t happen again.”</p><br/><p>Xie Xi wasn’t worried. Such a thing happened because of X’s perverted design!</p><br/><p>Xie Xi didn’t say this but Jiang Xie could guess from the falling goodwill.</p><br/><p>He cleared his throat and explained himself. “The quasi-world might be my design but I don’t know what the clearance task it. Even without the Quasi-World Protection Law, it is impossible to know because the clearance task isn’t fixed. It will change depending on the world situation.”</p><br/><p>Xie Xi inwardly sneered but there was a smile on his face. “Then I got this task because of my own reasons?”</p><br/><p>Jiang Xie naturally didn’t dare say it was because of Xie Xi and took the initiative to reveal the truth. “It is my reason.”</p><br/><p>Xie Xi’s teeth itched. “The designer is able to interfere with the clearance task?” This big liar!</p><br/><p>Jiang Xie coughed. “If my soul still remains in the quasi-world, they will affect the clearance task.”</p><br/><p>Xie Xi didn’t understand this. Why did the six princes want him to pedal six boats? None of them looked like fish who wanted to be cheated on!</p><br/><p>Jiang Xie explained in detail. “You can understand it as after entering the quasi-world, my souls woke up. They are essentially the creator and one of the factors in the quasi-world that isn’t independent. The clearance task is affected by them. Once they are satisfied, the world can become independent.”</p><br/><p>Xie Xi still didn’t understand. “They are satisfied by me pedalling six boats?</p><br/><p>Jiang Xie replied, “What if all of them want to become close to you?”</p><br/><p>Xie Xi, “???”</p><br/><p>Jiang Xie was cautious. “They see you and want to become close to you. Everyone’s will is very strong and joined together to become…” Collect the love of six princes.</p><br/><p>Jiang Xie emphasized it. “If someone else entered the world, the task they would receive definitely wouldn’t be like this.”</p><br/><p>In fact, no one else could answer but he worked hard to clarify this. “The essence of Lost Atlantis is a quasi-world that explores the themes of racial integration, sea and land co-existence, environmental protection and art without borders.”</p><br/><p>The tasks were all profound and serious but became love obsessed since Xie Xi arrived.</p><br/><p>Xie Xi, “……………………………………”</p><br/><p>So it was really his own reason?</p><br/><p>Xie Xi’s fake smile became tense and he asked, “Why do your souls want to be close to me?”</p><br/><p>Jiang Xie replied calmly, “It was probably love at first sight.”</p><br/>\n</div>"}