{"title": "Chapter 86", "id": 86, "volume": 1, "url": "http://boxnovel.org/game-loading-chapter-86", "volume_title": "Volume 1", "body": "<h1>Chapter 86</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Open World 11</p><hr/><br/><p>Xie Xi also thought about the privilege. This was actually very troublesome because the people who opened the game field were given a privilege. Players could inherit this privilege by killing them.</p><br/><p>Xie Xi told Jiang Xie, “It doesn’t matter if they take Repair as a privilege. What’s the point of grabbing a skill that could be used on others but not yourself?”</p><br/><p>He gave a lot of excuses but he actually had a soft heart.</p><br/><p>Jiang Xie’s heart was also soft. “You are doing very well.”</p><br/><p>Xie Xi’s face inexplicably became hot. “I don’t want to save them.”</p><br/><p>He immediately regretted saying this. It wasn’t a cover up!</p><br/><p>Jiang Xie’s heart melted. He said, “Of course you didn’t mean it. It was just like picking up a plastic bottle on the side of the road and throwing it into the bin.”</p><br/><p>Xie Xi, “…”</p><br/><p>Jiang Xie continued, “You just coincidentally saw that there were many arms and legs. You have such a skill and it is easy to help them…”</p><br/><p>Xie Xi couldn’t listen anymore and stared up at him. “Are you trying to coax me?”</p><br/><p>The child was angry and Jiang Xie couldn’t help smiling. “I’m just praising my apprentice.”</p><br/><p>He didn’t mention that Xie Xi had forgotten to act as an apprentice.</p><br/><p>The game was too thrilling and Xie Xi used all his brain to think about business. There wasn’t room to think about anything else.</p><br/><p>Xie Xi suddenly couldn’t call this person ‘Master’ and simply turned to stride away.</p><br/><p>Jiang Xie didn’t say anything else. After all, the goodwill was -365 and he had to steady it.</p><br/><p>They emerged and found that they were in the playground. Standing here, the scenery was quite beautiful.</p><br/><p>The ferris wheel, the roller coaster, the big pendulum, the pirate ship etc, all of them were gorgeous and exquisite with dazzling lights. It was no different from an amusement park at night.</p><br/><p>Xie Xi gazed at it in a slightly stunned manner.</p><br/><p>Jiang Xie noticed. “Do you like amusement parks?”</p><br/><p>Xie Xi shook his head and replied, “I don’t like them.”</p><br/><p>“Speaking of which,” Jiang Xie said. “This is my first time entering an amusement park.”</p><br/><p>Xie Xi turned to him. “First time?”</p><br/><p>“In my own words, it was too boring to come to such a place.”</p><br/><p>The words hit Xie Xi’s heart and he frowned. “You…” Were you alone for a while? Xie Xi didn’t ask this question because he felt it was offensive.</p><br/><p>Jiang Xie continued, “I’ve never been but this first time is very interesting.”</p><br/><p>Xie Xi thought about the cut off arms and legs game and was speechless. “…It is quite interesting.”</p><br/><p>Jiang Xie wanted to give himself a few points. “It is interesting because…” You and I are together.</p><br/><p>Before he could finish, two oversized light bulbs came over. “Benefactor!”</p><br/><p>Jiang Xie choked back his words and thought, ‘The side task is right. These two goods should’ve been killed.’</p><br/><p>The people who came were the big idiot Kong Rongliang and the half zombie Chen Qing.</p><br/><p>Chen Qing got a pair of pants from somewhere and looked pretty good after wearing them. The zombie legs couldn’t be seen at all. His face was also washed clean, revealing a pair of phoenix eyes, a high nose and thin lips.</p><br/><p>Xie Xi felt he was pleasing to the eye, not because he was handsome but simply because he was washed clean.</p><br/><p>Kong Rongliang saw them and was excited. “I looked from afar and thought it was Benefactor. It’s great that you are fine.”</p><br/><p>Chen Qing wondered, “How many projects have you done? We just got out of the second one. It was so terrible!”</p><br/><p>Xie Xi asked, “You finished two projects?”</p><br/><p>Kong Rongliang became excited again and the tears in his eyes were really unbearable to look at. “It is thanks to Benefactor! We really have to thank Benefactor!”</p><br/><p>Xie Xi was startled.</p><br/><p>Chen Qing slapped him before solemnly bowing to Xie Xi. “Fortunately I have these zombie legs or we wouldn’t have survived the game just now.”</p><br/><p>Xie Xi and Jiang Xie were about to play the next game and it was good to know more information. Chen Qing understood this very well and didn’t wait for Xie Xi’s questions as he spoke about their experiences.</p><br/><p>It was probably because of the side task. Kong Rongliang picked the carousel and they were in team mode so they entered together.</p><br/><p>This carousel wasn’t the childlike game of an ordinary amusement park. In the words of Chen Qing, there was nothing similar apart from the name.</p><br/><p>As soon as they entered, they were on a zombie horse that was rotted and rancid. It was like riding a piece of shit. Those with weak tolerance instantly vomited.</p><br/><p>Once the game started, the zombie horses started to spin but it wasn’t the spinning of the carousel. The hoses spun in place and got closer to each other. The horses bumped into each other but kept spinning. They were extremely crazy and horse eyeballs were thrown all over the ground…</p><br/><p>Xie Xi felt disgusted when he heard this and prayed that he would never draw this game.</p><br/><p>Chen Qing continued, “The speed of the zombie horses kept increasing and fire appeared on their backs, just like a fire wheel.”</p><br/><p>Xie Xi wondered, “Then how is the game cleared?”</p><br/><p>Kong Rongliang replied, “Hold on for 10 minutes.”</p><br/><p>Xie Xi imagined the scene and felt that these 10 minutes would probably feel like 10 years.</p><br/><p>Chen Qing said, “One of the rules of the game is not to fall off the hose. Once you fall, you will be trampled on by the zombie horse.”</p><br/><p>Kong Rongliang added, “The second rule is that the zombie horse can’t stop. If it stops, even the person on the horse will be crushed with it.”</p><br/><p>Xie Xi’s scalp became numb. “The zombie horses can be killed?” Stopping was impossible then they could only be killed.</p><br/><p>Chen Qing replied, “Yes, the venue is very small. 20 horses are standing together and it is a mess once they start spinning.”</p><br/><p>Kong Rongliang continued, “If your horse dies, you can grab someone else’s horse.”</p><br/><p>It was easy to imagine how fierce this 10 minute game was.</p><br/><p>The zombie horse itself was disgusting and it kept spinning faster and faster. A person with poor psychological quality would probably fall off early and be trampled on.</p><br/><p>Even if a person was steady, they had to be careful about their horse dying. If someone took the initiative to steal the horse, the chaos produced would be indescribable.</p><br/><p>“In our game, there were two groups of people who were enemies. They took the opportunity to retaliate against each other and finally…” Chen Qing sighed. “Four people survived in the end.”</p><br/><p>The carousel was limited to 20 people and 16 people died in 10 minutes.</p><br/><p>Kong Rongliang said, “My position was very good. In addition, my father has a horse pedigree and I can ride well. Thus, I managed to survive.”</p><br/><p>Chen Qing was emotional. “I really have to thank Benefactor. I definitely wouldn’t have survived without this pair of zombie legs.”</p><br/><p>Xie Xi paused for a moment. “Are the legs convenient?”</p><br/><p>“They aren’t convenient but…” Kong Rongliang was thrilled. “Ah Qing has an undead body.”</p><br/><p>Xie Xi thought he misheard. “Undead body?”</p><br/><p>Chen Qing was extremely grateful. “Yes! I seem to be a zombie. No matter what happens to my body, I can always recover.”</p><br/><p>Xie Xi was surprised. “But I just…” He used the Repair skill. Jiang Xie said, “It seems to be a blessing in disguise.”</p><br/><p>Xie Xi finally reacted. “It should be that you were previously bitten by a zombie. You were infected but survived…”</p><br/><p>“I wouldn’t have survived if Benefactor hadn’t given me these legs!” Chen Qing spoke sincerely…</p><br/><p>This was really a mistake…</p><br/><p>Then Xie Xi remembered his side tasks and thought about how many times ‘kill them’ appeared.</p><br/><p>If he had really chosen to kill them…</p><br/><p>Chen Qing had an undead body? How could he be killed? If he couldn’t be killed then Xie Xi would’ve offended the ‘zombie with a brain’ and things would’ve become very troublesome.</p><br/><p>Xie Xi said, “Or you are very blessed.”</p><br/><p>Chen Qing was very emotional. He was the typical person who died and was born again.</p><br/><p>The carousel took very little time. They passed and played the next game. This time it was according to Chen Qing’s quest and he picked I love you VS shameless.</p><br/><p>Of course, they weren’t in the same venue as Xie Xi, They met a zombie boy, not a zombie girl.</p><br/><p>The rules of the game were the same but they had the bug called Chen Qing. Chen Qing voluntarily took the punishment three times and once the Opposite Card was released, everyone understood what was going on. They quickly used it and two sides confessed to each other, smoothly ending the game.</p><br/><p>Chen Qing asked Xie Xi about their game. Xie Xi told them.</p><br/><p>Kong Rongliang sighed with relief. “Our game was still quite simple.”</p><br/><p>Xie Xi was sad. Compared with these two, he felt that he wasn’t worthy of being called the emperor of luck.</p><br/><p>Chen Qing spoke again, “Unfortunately, all those who emerged from here cleared the I love you VS shameless game. There isn’t too much information about other games.”</p><br/><p>Only a handful of people completed two projects. Most completed one or died in the project.</p><br/><p>Xie Xi didn’t expect to get too much information. If those who cleared the games could gather together then the difficulty of the game field would be greatly reduced.</p><br/><p>Kong Rongliang paused before saying, “Unfortunately, there is no way to form a team in this open world or we could be together.” It really would be much easier with Chen Qing’s bug.</p><br/><p>Xie Xi told them, “It’s fine. I don’t have any big problems on my side.”</p><br/><p>The two of them were reassured. Xie Xi had such a skill and they had also seen Jiang Xie’s abilities. If they entered the carousel game then Jiang Xie could probably kick everyone off the horses.</p><br/><p>Due to the time limit, they didn’t speak anymore and split up to select the next project.</p><br/><p>Xie Xi and Jiang Xie arrived at the place to draw a card and Xie Xi told him, “This time you pick.”</p><br/><p>They were a small team. If one person picked then the other would follow.</p><br/><p>Jiang Xie immediately said, “You do it.”</p><br/><p>“What if I pick a bad one?”</p><br/><p>Jiang Xie told him seriously, “If I pick, I will most definitely draw the hardest project in this game.”</p><br/><p>Xie Xi was startled. “Do you have bad luck?”</p><br/><p>“True me. My history is full of blood and tears.”</p><br/><p>Xie Xi was strangely curious. “Have you encountered similar worlds before?”</p><br/><p>“I’ve encountered them many times.”</p><br/><p>“How did you live?”</p><br/><p>For example, the I love you VS shameless game might not be all about luck but a person with bad luck would be very miserable.</p><br/><p>Jiang Xie replied quietly, “If it was me, I would probably go directly through the forest towards the underground labyrinth.” He would rather go through the zombies then come here and rely on luck.</p><br/><p>Xie Xi, “…”</p><br/><p>His luck was bad to this extent? It was too bad that he had to avoid ht usual path?</p><br/><p>Over the years, Jiang Xie had become deeply aware of his bad luck. He never relied on luck for anything and resolved everything with strength. In a situation where 99% of people could live, he was only 1%.</p><br/><p>Xie Xi felt a bit distressed and praised him, “Master is so strong. You don’t need luck.” Jiang Xie answered, “I still want good luck.”</p><br/><p>He was so pitiful that Xie Xi didn’t know what to say.</p><br/><p>“However, I have become much luckier after meeting you.” Jiang Xie blinked. “Perhaps I saved all my years of good luck for meeting you.”</p><br/><p>Xie Xi, “………………”</p><br/><p>Who would be distressed over this damn guy? Luck wasn’t given to him!</p><br/><p>Xie Xi took a deep breath and picked a card. The name of the next project appeared— chicken mobilization.</p><br/><p>“It sounds good.” Jiang Xie stated.</p><br/><p>Xie Xi wondered, “Is there such a game in an amusement park?”</p><br/><p>“The I love you game isn’t present in a normal amusement park.”</p><br/><p>He said ‘I love you’ slowly and Xie Xi unexpectedly felt his ears become itchy.</p><br/><p>“It can’t be taken lightly.” Xie Xi told him. “Just like the carousel, this chicken mobilization is probably no better.”</p><br/><p>The zombie boy responsible for the cards told them, “The multi-person project supports a team entry. The current number is full and the game is about to begin.”</p><br/><p>Then Xie Xi and Jiang Xie were transmitted to the game area for chicken mobilization.</p><br/><p>Xie Xi was startled. The scene in front of him was too normal. It was the ordinary waiting area for an amusement park. Five people were standing in front of them, as if waiting.</p><br/><p>Were they players or…</p><br/><p>Xie Xi was still thinking with a long-haired woman among the five people opened her mouth. “What is your name?” She asked Jiang Xie.</p><br/><p>Jiang Xie slightly raised an eyebrow.</p><br/><p>A man next to the long-haired woman cried out, “Miss Yun asked you a question. Quickly answer!”</p><br/><p>Jiang Xie told them his name.</p><br/><p>The woman known as Miss Yun was very disdainful. “This is a group confrontation game. I have enough information about it. There will be two cars after entering and they are each limited to six people. We are still lacking a person so come over.”</p><br/><p>Jiang Xie replied, “No, I’m with him.”</p><br/><p>Miss Yun glanced at Xie Xi before telling Jiang Xie, “Don’t say that I didn’t remind you. This game is very cruel. You will definitely die here if you don’t enter my team.”</p><br/><p>“It is better to die than to enter your team.”</p><br/><p>Xie Xi, “…”</p><br/><p>He often got angry at Jiang Xie but it was quite refreshing to see others become angry at him.</p><br/><p>Miss Yun froze. She didn’t expect someone to be so ignorant. The people around her were heated up. “You don’t know anything! Do you think we would take you if your body wasn’t intact?”</p><br/><p>Another man added, “You have an exaggerated opinion of your own abilities. Do you think this is really an amusement park?”</p><br/><p>Miss Yun looked at Jiang Xie and couldn’t help saying, “I will give you another chance. It is very dangerous here. No matter how strong you are, you can only die if your teammates aren’t sufficient.”</p><br/><p>Jiang Xie told her, “My teammates are very strong.”</p><br/><p>A man scoffed. “Once you see them, you will know what type of teammates you have!”</p><br/><p>Miss Yun still wasn’t giving up.</p><br/><p>The man next to her said, “Miss, it is about to begin. Let’s not waste time. The person before was fine…”</p><br/><p>Miss Yun stared at Jiang Xie before giving up. “Stupid!”</p><br/><p>They stepped aside and Xie Xi discovered that there were still people behind them…</p><br/><p>The chicken mobilization game had 12 people with six people to a car. Things were still unclear but it was necessary for the six people to work together.</p><br/><p>Miss Yun had gathered a group of powerful people while the rest were ‘repulsive.’</p><br/><p>Xie Xi stared intently and realized why Miss Yun’s group had been waiting for someone.</p><br/><p>Of the five people who fell there, two had no arms, two had no legs while one person was in a better state and was missing a hand. Thanks to Jiang Xie’s refusal, Miss Yun had to fill up the numbers in her team and took him.</p><br/><p>The young man with no hand was moved to tears and excitedly joined Miss Yun.</p><br/><p>Miss Yun was disgusted. “You are lucky.”</p><br/><p>The four people left behind were ashen-faced.</p><br/>\n</div>"}