{"title": "Chapter 99", "id": 99, "volume": 1, "url": "http://boxnovel.org/game-loading-chapter-99", "volume_title": "Volume 1", "body": "<h1>Chapter 99</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Open World 24</p><hr/><br/><p>For a person who was alone, the loneliest time was during the holidays.</p><br/><p>Xie Xi understood this and Jiang Xie also understood.</p><br/><p>Now that they were together, this year would be quite different from before.</p><br/><p>One person plus one person equaled two people but it could fill a house with happiness and satisfaction.</p><br/><p>At the end of the year, Xie Xi started to clean up but Jiang Xie said this time should be for rest.</p><br/><p>His argument was justified. “You should take a vacation on New Year’s Day!”</p><br/><p>Xie Xi told him, “It doesn’t matter.”</p><br/><p>“No, if I am on holiday then you should also have a holiday.”</p><br/><p>Xie Xi’s eyes curved. “I clean up my house even if it is a holiday.”</p><br/><p>The word ‘house’ sweetened Jiang Xie. Forget, sweeping, if Xie Xi wanted to clean the whole Earth then Jiang Xie would accompany him!</p><br/><p>“Cough…” It was dangerous but Jiang Xie hadn’t lost his head yet. “I should also clean up our house.” He couldn’t help saying ‘our house’ with a beautiful heart.</p><br/><p>Xie Xi also heard it. In fact, he had been slightly embarrassed when he said it and was afraid he was being too much.</p><br/><p>However, Jiang Xie replied to him using the same words. The warmth in Xie Xi’s heart was something that even he couldn’t understand.</p><br/><p>What was a family like? His mother Xie Su wasn’t family. Jiang Xie must be.</p><br/><p>Xie Xi no longer insisted and cleaned up with Jiang Xie. Old Jiang was proficient in all types of things and started making a disturbance.</p><br/><p>Xie Xi picked up the vacuum cleaning and Jiang Xie took it. Apart from spending a while in his room, he spent a maximum of three minutes on the other rooms. Xie Xi picked up a mop and he grabbed it, going directly to Xie Xi’s room, cleaning even the bottom of the bed. Xie Xi picked up a rag and Jiang Xie took the basin and directed, “There are a few books from your last place. Go find a place to put them.”</p><br/><p>As soon as Xie Xi returned to his room, he was almost blinded by the shiny floor! Amazing, this floor… he was reluctant to step on it!</p><br/><p>However, only his room was so bright. Compared to the outside, the floors of the other rooms in the house would probably cry out, ‘It is the same floor. Why are you so good?!’</p><br/><p>On the 26th of the 12 lunar month, Jiang Xie told him, “Let’s write the blessings.”</p><br/><p>Xie Xi blinked. “Shouldn’t it be written on the 30th?”</p><br/><p>Jiang Xie hadn’t spent the new year seriously but he knew this very well. “After a small year, we need to do auspicious things on even days.” This would definitely herald that they would be paired in the coming year!</p><br/><p>Xie Xi laughed. “The 30th is also an even day.”</p><br/><p>Jiang Xie arranged a clear picture. “We will write blessings today, buy new year’s goods on the 28th and not go anywhere on the 30th as we enjoy a New Year’s dinner!”</p><br/><p>Xie Xi particularly liked the feeling of a ritual and solemnly nodded. “I will listen to Teacher!”</p><br/><p>Very good. Jiang Xie didn’t dare say it but love was overflowing from his eyes. The red paper was bought a long time ago. Jiang Xie brought them to his study and rolled up his sleeves to grind the ink.</p><br/><p>Xie Xi hurriedly said, “I’ll do it.”</p><br/><p>Jiang Xie told him, “I’ll prepare the ink and you write it first.”</p><br/><p>Xie Xi felt ashamed. “I haven’t done this before.”</p><br/><p>“It doesn’t matter. Write a blessing and then put up the blessing. Next year, the blessing will be fulfilled.”</p><br/><p>Xie Xi hadn’t used a calligraphy brush before but he liked Jiang Xie’s words. He picked up the brush and wrote the blessing like he was using a pen.</p><br/><p>He smiled. “So ugly!”</p><br/><p>Jiang Xie praised, “It’s very cute.”</p><br/><p>“It’s childish.”</p><br/><p>Jiang Xie was serious. “It’s really very cute.”</p><br/><p>Xie Xi’s heart was warm. He picked up the brush and wrote carefully before…</p><br/><p>“It’s really hard,” Xie Xi opened his mouth. “Teacher, you do it.”</p><br/><p>Jiang Xie picked up the brush and casually moved it. A big character that was a dragon flying and a phoenix dancing appeared on the red paper. Xie Xi’s eyes lit up and he praised, “Good-looking!”</p><br/><p>Jiang Xie’s mood was good and he changed the font. Xie Xi was gobsmacked. “Is this a thin gold body? So beautiful.” He knew the font since it was recognizable.</p><br/><p>Jiang Xie wondered, “Do you like this?”</p><br/><p>Xie Xi nodded. “I like it. It seems simpler.”</p><br/><p>Jiang Xie handed the brush to him. “I’ll teach you how to write it.”</p><br/><p>Xie Xi didn’t think too much as he said, “It will take time. Don’t teach…”</p><br/><p>He paused halfway through his words because Jiang Xie stood behind him and held his hand.</p><br/><p>“Relax your wrist and feel the gesture.” Jiang Xie’s voice entered his ears like a hot breeze and Xie Xi’s red ears trembled.</p><br/><p>Xie Xi held his breath. He tried to look at the red paper but he simply couldn’t concentrate.</p><br/><p>“It is like this.” Jiang Xie’s arms move and Xie Xi moved along with him over the red paper. A beautiful thin gold character appeared on the paper.</p><br/><p>Xie Xi was in a daze and could only feel that his back, ears, arms and harms that were being held was hot. Jiang Xie asked him, “How about it? Do you have the feeling?”</p><br/><p>Xie Xi’s face reddened and his voice shook. “T-Teacher!”</p><br/><p>“Hrmm?”</p><br/><p>Xie Xi bit his lower lip to calm himself down and stated, “I… I’ll try it myself.”</p><br/><p>Jiang Xie’s lips curved. “Okay, try writing it yourself.”</p><br/><p>Xie Xi kept his head down and lacked strength in the hand holding the brush. Jiang Xie said again, “Don’t worry. If you like it, I’ll find time to teach you later.”</p><br/><p>“No need!” Xie Xi put down the brush. “This is still too difficult. I won’t waste red paper!”</p><br/><p>Jiang Xie saw the child’s red ears and his heart itched, but he resisted. Take it easy… everything would come slowly… He was seeking eternity, not a momentary joy.</p><br/><p>Xie Xi needed to calm down. He moved away from the desk and said, “I’m going to the bathroom.”</p><br/><p>“As you come back, please get me a glass of water.”</p><br/><p>Originally, Xie Xi wanted to make an excuse to not return to the study. Not that Jiang Xie said this, he had to go back.</p><br/><p>Xie Xi went to the bathroom and washed his face. He stared at himself in the mirror for a long time before finally giving his brain a slap.</p><br/><p>‘What are you thinking? This is a teacher! He’s still a man!</p><br/><p>Don’t be confused about your emotions just because someone is good to you!’</p><br/><p>He gave himself a fierce scolding before finally calming down. Xie Xi sighed, dried his face and went to pour a glass of water.</p><br/><p>There were two cups on the table. They were identical porcelain cups with a half rose on them.</p><br/><p>Xie Xi had long known that Jiang Xie especially liked roses. When he first brought the cup, Xie Xi had frozen. “A couples cup?”</p><br/><p>Jiang Xie smiled. “If they are really couple cups, the flowers on these cups should be able to be joined together.</p><br/><p>Xie Xi worked hard for a long time before saying, “No, it is smooth…”</p><br/><p>The two cups weren’t a pair, they were just identical. Jiang Xie explained, “I think they look good so I brought two back.”</p><br/><p>Xie Xi raised an eyebrow. “How will we be able to tell which is our cup when drinking water?”</p><br/><p>Jiang Xie ‘suddenly realized. “Oh, I hadn’t paid attention.”</p><br/><p>As if he didn’t pay attention! He held back from buying a couples cup because of this!</p><br/><p>Xie Xi suggested, “It’s nothing. I’ll put a label on my cup.”</p><br/><p>“No, it’s such a nice cup to place such an ugly thing on it.”</p><br/><p>Xie Xi hesitated. “That… Teacher can leave one at home and bring one to school.”</p><br/><p>Jiang Xie answered, “The school has a whole set that is cheaper. This is quite expensive and I’m reluctant to take it there.”</p><br/><p>Xie Xi heard it was expensive and also felt reluctant.</p><br/><p>Jiang Xie suggested, “Let’s use it like this. I’ll place it on the left and you place it on the right.”</p><br/><p>Xie Xi also liked this cup and nodded. “Yes! I’ll try not to put it in the wrong spot.”</p><br/><p>He was attentive and didn’t make any mistakes, but Jiang Xie was sloppy and always misplaced it.</p><br/><p>Xie Xi corrected him, “Teacher, my cup is on the right and you have to put it on the left.”</p><br/><p>Jiang Xie blinked. “I have to put it on the left? How do I remember it as you putting it on the left?”</p><br/><p>This was originally a minor matter and Xie Xi didn’t remember clearly.</p><br/><p>He wondered suspiciously, “Did I remember it wrong?”</p><br/><p>Jiang Xie smiled. “You remembered wrong. I always put it on the right.”</p><br/><p>Xie Xi frowned. “It’s like this…” It turned out that he was mistaken.</p><br/><p>“Don’t worry. From today, you put it on the right and I’ll put it on the left.” Xie Xi doubled checked. “I am the right and you are the left?”</p><br/><p>Jiang Xie nodded. “Yes.”</p><br/><p>The next day, Jiang Xie picked up the right cup to drink water. Xie Xi cried out, “Teacher, you got it wrong!”</p><br/><p>Jiang Xie hit his forehead. “Look at my brain. How could I forget?”</p><br/><p>Xie Xi, “…”</p><br/><p>Today, Xie Xi went to pour water for Jiang Xie only to find that he couldn’t tell who the cups belonged to.</p><br/>\n</div>"}