{"title": "Chapter 96", "id": 96, "volume": 1, "url": "http://boxnovel.org/game-loading-chapter-96", "volume_title": "Volume 1", "body": "<h1>Chapter 96</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Open World 21</p><hr/><br/><p>Snail… what?</p><br/><p>Jiang Xie explained, “You saw the situation at my place. It really needs your help. My contract with my previous housekeeper expired and I didn’t like her 60 minutes blind date routine. I wanted to change…”</p><br/><p>What lies! No domestic housekeeper would introduce herself to her employer so unprofessionally! It was a pity that Xie Xi was inexperienced and fooled by Jiang Xie.</p><br/><p>“If you come to help, I won’t have to bother finding someone else.” Jiang Xie asked, “You won’t introduce yourself with your preferences, right?”</p><br/><p>The topic shifted and Xie Xi was completely taken in. “Of course not.”</p><br/><p>Jiang Xie smiled. “That’s great.”</p><br/><p>Xie Xi saw the teasing in his eyes and finally recovered. “I’m not a professional and haven’t done this type of work…”</p><br/><p>Jiang Xie interrupted him, “You have already satisfied me. That’s enough.”</p><br/><p>Xie Xi paused. Jiang Xie added, “You need work and I need you to work. We hit it off so why not?”</p><br/><p>Xie Xi was still hesitating.</p><br/><p>Jiang Xie started to talk nonsense again. “You are still young and don’t know the pains of a single and handsome man. I am busy with work and don’t have time to clean up. I have to use a housekeeper but they’re mostly women. I don’t dare use anyone too young but it isn’t easy to use the old. You have to work anyway. Why not work for me?”</p><br/><p>He started fooling people again. “They saw that one day as a teacher is a father for life. Shouldn’t you help your poor, lonely and helpless old father?”</p><br/><p>Xie Xi, “………………”</p><br/><p>This wasn’t a teacher for a day, a father for life. It was a teacher for a day and fall into a pit for life!</p><br/><p>Jiang Xie saw the child’s face finally loosening up and asked, “How about it, my snail boy?”</p><br/><p>It was probably because he practiced talking as a teacher. Jiang Xie’s voice was particularly good and made people’s ears numb.</p><br/><p>Xie Xi’s ears trembled and he finally opened his mouth. “No.”</p><br/><p>Jiang Xie was stunned and thought that his fooling around plan had failed. The next minute, the child said, “I’m not a snail but I will accept the job.”</p><br/><p>Old Jiang was as happy as a few billion yuan falling from the sky. Xie Xi bowed to Jiang Xie. “Mr. Jiang, thank you.”</p><br/><p>He was aware of Jiang Xie’s kindness. The reason he hesitated wasn’t because of the job but because he felt the debt owed to Jiang Xie was too big.</p><br/><p>Still, this was really tempting. He didn’t have to go to the bar to work and wouldn’t have to see many people. It was great. Moreover, Jiang Xie really needed a housekeeper. If the contract with his previous housekeeper had expired then Xie Xi wouldn’t be stealing someone’s job.</p><br/><p>He didn’t want to miss such a good thing. Jiang Xie was in a good mood and he slightly showed off. “It is decided. Then how about 200 an hour for the salary?”</p><br/><p>Xie Xi looked up and blinked.</p><br/><p>Jiang Xie, “…”</p><br/><p>Was 200 too low? How much was the tuition fee? He previously asked an assistant to buy a computer and seemed to spend 50,000 yuan? Well… he had too many inheritances and didn’t have much concept about money.</p><br/><p>Xie Xi wondered, “How can it be so much? Teacher, which housekeeping company did you find before? They swindled you.”</p><br/><p>Too high? Jiang Xie continued speaking without hesitation, “Is 200 a day a lot? You have to clean up and can also prepare breakfast and dinner.” So what if he didn’t eat breakfast? It wasn’t bad to get up early when he was in good shape.</p><br/><p>Xie Xi was obviously relieved. “I heard you say 200 an hour.”</p><br/><p>Jiang Xie was calm. “You heard it wrong.”</p><br/><p>“Good. 200 a day is also very high. I…”</p><br/><p>“Don’t underestimate the job. I help you can take the time to help me source documents and also act as a small assistant.” Teacher Jiang racked his brains to rationalize the money.</p><br/><p>In fact, 200 a day wasn’t high for full-time housekeeping but Jiang Xie wasn’t aware of the supermarket and kept watching Xie Xi’s eyes.</p><br/><p>Xie Xi’s eyes also lit up. “I-I can also be your assistant!” It was so surprising that he used honorifics.</p><br/><p>Jiang Xie corrected him. “It is a small assistant.” He said this while thinking the child was cute.</p><br/><p>Xie Xi thought of his lacking experience and nodded solemnly. “Good, I will live up to your expectations!”</p><br/><p>Jiang Xie was full of: cute, cute, too cute!</p><br/><p>At Jiang Xie’s insistence, Xie Xi called the bar in the afternoon and resigned from his job.</p><br/><p>The boss already knew about what happened last night and felt very guilty towards Xie Xi. He knew Xie Xi had some circumstances and said, “That’s fine, you a temporary worker and you can quit if you don’t want to continue. You can rest assured that I will have the finances department send you the remaining wages tomorrow.”</p><br/><p>Xie Xi was very grateful and thanked him.</p><br/><p>The boss also appreciated this child. The child might have a face that was easy to get into trouble but he was diligent, low-key and followed the rules. It was impossible to not like the young man who worked diligently.</p><br/><p>Xie Xi let go of his worries and Jiang Xie told him, “Let’s add each other on WeChat.”</p><br/><p>“Yes.” Xie Xi scanned Jiang Xie’s QR code and added him as a friend.</p><br/><p>Jiang Xie looked at the second-hand domestic mobile phone and felt pained, but there wasn’t much he could do.</p><br/><p>After adding each other as friends, Xie Xi received a message from Jiang Xie. He opened it and was startled.</p><br/><p>Jiang Xie had transferred him 6,000 yuan! Xie Xi didn’t have a chance to open his mouth before Jiang Xie told him, “It is a one month advance of your salary.”</p><br/><p>Xie Xi exclaimed, “No! I haven’t done anything yet!”</p><br/><p>“You aren’t going to listen to your teacher?”</p><br/><p>Xie Xi, “…” What was this?</p><br/><p>Jiang Xie took his phone and accepted the money. “What’s wrong with giving you the money first? You won’t run away.”</p><br/><p>Xie Xi watched the 6,000 yuan and his soul flew away. “You didn’t need to do this. The bar would pay me tomorrow. I…” He was lacking money but he would have enough once the bar settled his wages.</p><br/><p>Jiang Xie was absentminded. “Oh, there is almost money to buy food.”</p><br/><p>He held the two mobile phones directly, using his phone to transfer to Xie Xi and accepting it on Xie Xi’s phone.</p><br/><p>Xie Xi watched this operation and was dumbfounded as his account received 10,000 yuan more!</p><br/><p>Classmate Xie who had never seen such a huge sum in his life, “!!!”</p><br/><p>Jiang Xie returned the phone., “Okay, I’ll give myself to you for the next month.”</p><br/><p>Xie Xi was too shocked that he was oblivious to the problems in the words. “This is food money for one month? There were only two meals a day. What did he eat?!</p><br/><p>Jiang Xie answered, “How can it be one month?”</p><br/><p>Xie Xi sighed with relief and was about to say, “You don’t have to give me so many months…”</p><br/><p>Jiang Xie continued, “How can 10,000 yuan last one month? It is a week.”</p><br/><p>Xie Xi, “……………………”</p><br/><p>Jiang Xie spoke again, “Try it first. If it isn’t enough then tell me.”</p><br/><p>Xie Xi couldn’t endure it anymore. “1,000 is enough for one week, let alone 10,000. Teacher, what have you been eating?”</p><br/><p>In addition… the teacher’s salary was so high! Xie Xi wanted to be a teacher as well!</p><br/><p>Jiang Xie leaned down. “In short, don’t worry about saving my money. If you want something expensive then eat it.” It wouldn’t run out anyway.</p><br/><p>Xie Xi’s spirit returned after a long time and he said, “I’ll keep the books otherwise I shouldn’t use it…”</p><br/><p>Jiang Xie thought about the child’s careful bookkeeping…</p><br/><p>“Let’s go to the supermarket.” He would buy a bookkeeping book!</p><br/><p>Xie Xi thought it was buying the evening ingredients and said, “I’ll go on my own.”</p><br/><p>“No, I’ll drive you.”</p><br/><p>Xie Xi thought about it and didn’t refuse. He just started working and it was natural for the boss to review his purchasing ability.</p><br/><p>The two of them went out and appeared in the parking lot together. They got into the car and Jiang Xie said, “Fasten your seatbelt. We’ll be going to a supermarket far away.”</p><br/><p>Xie Xi asked dutifully, “Do you always go there?” He would have to keep buying ingredients later.</p><br/><p>How could Jiang Xie often go to supermarket? The number of times he had been to a supermarket could be counted on one hand.</p><br/><p>Jiang Xie smiled. “Far away is good since it will avoid suspicion.”</p><br/><p>There were supermarkets around the school that were large and very lively.</p><br/><p>However, there were so many students at these supermarkets. If they went…</p><br/><p>Xie Xi felt warm. “It’s fine.” He thought that Jiang Xie wasn’t willing to let the students know Xie Xi was his housekeeper.</p><br/><p>Jiang Xie let Xie Xi keep this idea and opened his mouth. “I’m too handsome and if we go to the supermarket to buy food together, I’m afraid they will misunderstand us.”</p><br/><p>Xie Xi, “!”</p><br/><p>Jiang Xie felt a bit nervous but he thought it was worth it when he saw the child’s red ears.</p><br/><p>Xie Xi stuttered, “No, no that won’t happen.”</p><br/><p>“It won’t?” Jiang Xie wondered. “Fine, we won’t detour and will go straight there.”</p><br/><p>Xie Xi was anxious!</p><br/><p>Jiang Xie understood and his lips curved. “I’m just joking. In fact, I don’t want to go there.”</p><br/><p>Xie Xi’s nerves were still tight as he asked, “What?”</p><br/><p>Jiang Xie explained, “I’m a big celebrity and will certainly be mobbed by little girls if I go to the surrounding supermarkets.”</p><br/><p>Xie Xi, “…”</p><br/><p>Jiang Xie was serious. “You saw it before. The girls from the class next door blocked me.”</p><br/><p>Xie Xi didn’t want to talk. He turned to look out the window while inwardly thinking, ‘Teacher Jiang can never be serious!’</p><br/><p>Jiang Xie drove for half an hour before finding a good supermarket. The two of them got off together since they didn’t have to be afraid of meeting acquaintances.</p><br/><p>Coming out so far, how could they meet anyone? Xie Xi pushed a small cart and carefully selected ingredients. Along the way, he asked for Jiang Xie’s preferences. Jiang Xie couldn’t say anything and just replied, “Let’s see it first.”</p><br/><p>Xie Xi asked him, “Do you like to eat fish?”</p><br/><p>“I don’t like freshwater fish.”</p><br/><p>Xie Xi nodded and went to the seafood area. Jiang Xie seemed particularly fond of seafood and asked, “Can you make takoyaki?”</p><br/><p>Xie Xi blinked.</p><br/><p>Jiang Xie told him, “I used to eat it when I was very young but I didn’t eat it later.”</p><br/><p>Xie Xi thought about it. “It isn’t very difficult. It just needs a special machine.”</p><br/><p>“Does the supermarket sell it? Hurry and buy it. We’ll eat takoyaki at night.”</p><br/><p>Xie Xi didn’t know if he should laugh or cry. “This place doesn’t have it. I need to search on the Internet and it will arrive in a few days.”</p><br/><p>Jiang Xie felt slight regret. “Okay.”</p><br/><p>Xie Xi’s heart was moved. “Do you want to eat it?”</p><br/><p>“There’s no hurry. I can wait a few days.” Xie Xi suggested, “It is generally sold in malls. If you want to eat it…”</p><br/><p>Jiang Xie told him, “I want to eat the things you make.”</p><br/>\n</div>"}