{"title": "Chapter 106", "id": 106, "volume": 2, "url": "http://boxnovel.org/game-loading-chapter-106", "volume_title": "Volume 2", "body": "<h1>Chapter 106</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Open World 31</p><hr/><br/><p>The people who came to Central were all abandoned and had regrets from their previous lives. It might be irrelevant to their original world but putting down these feelings, how could they be willing</p><br/><p>Dream come true was a game that combined the player’s real experiences to give them a dream they wanted most and couldn’t refuse.</p><br/><p>How could they wake up? Even if the player saw that it was a dream, how could they raise the courage to wake up?</p><br/><p>In the face of disasters and adversity, most people could endure it. However, who could refuse beauty?</p><br/><p>Living as much as possible, what was this image? It might be a dream but what was the meaning in waking up?</p><br/><p>Cruelty and beauty were placed next to each other. A player might maintain a cool head but it was still likely they would choose the latter.</p><br/><p>Xie Xi knew that Jiang Xie was next to him but didn’t dare look at the person.</p><br/><p>This dream was too real. It was rooted in his soul for more than 60 years and grew up.</p><br/><p>This man was confident and enthusiastic, loving Xie Xi so deeply that all his nonsense was still full of tenderness and affection. His love, his goodness and his heart, Xie Xi clearly saw all of it.</p><br/><p>In the dream, he often felt that everything was beautiful enough to be unreal.</p><br/><p>Now that he returned to reality, there was a strong sense that things weren’t real.</p><br/><p>It was too beautiful, so beautiful that he wasn’t worthy of owning it.</p><br/><p>“From birth to death…” Jiang Xie whispered. He was talking to himself but the gentleness in his tone was like a sugar gourd wrapped in syrup. It was very sweet with a slight acidity.</p><br/><p>Xie Xi finally couldn’t hold back and glanced at the person.</p><br/><p>Jiang Xie was watching him with the same expression as the dream. His straightforward love and affection wrapped the whole person in his heart.</p><br/><p>Xie Xi’s heart jumped and he looked away.</p><br/><p>His chest was warm and his fingers were twitching. He didn’t know how to face reality after waking up.</p><br/><p>He even had a ridiculous thought, ‘It wouldn’t be bad if I didn’t have the fatal injury immunity.’</p><br/><p>A real death meant he couldn’t question reality.</p><br/><p>Jiang Xie got out of the sleeping pod and asked Xie Xi, “Did you drop out of school before you came to Central?”</p><br/><p>Old Jiang was an old hand at this. He didn’t forget the beautiful dream and precisely chose the best point to bring up.</p><br/><p>It was an entry point that allowed Xie Xi to wake up from the dream and face reality.</p><br/><p>Naturally, it eased Xie Xi’s discomfort. Xie Xi was obviously dazed and his brain was a mess. He whispered, “Yes, I met the same thing as the bar. At that time, the boss came to let me go home early and saved me. I got the idea to resign and Sun Muqing asked me for help with a job so I went…”</p><br/><p>This was a past without Jiang Xie.</p><br/><p>Xie Xi also encountered Wang Qingshu’s harassment and even drank half a glass of wine. However, he managed to yell out and the boss of the bar arrived. After finding out what happened, the boss unceremoniously drove Wang Qingshu away and appeased Xie Xi.</p><br/><p>He was afraid of Xie Xi so the boss gave Xie Xi a certain amount of compensation and settled the salary.</p><br/><p>Xie Xi also couldn’t stand to be there anymore and quit. He was afraid of places like the bar and afraid of showing his face, so he was more cautious about jobs. Then Sun Muqing asked him for help and he went right away.</p><br/><p>At that time, Xie Xi’s ability in the profession was very weak. He could only do simple data collection and didn’t know the core framework.</p><br/><p>Sun Muqing probably earned a high amount of money and gave Xie Xi a lot. Xie Xi had been short of money so he was really grateful to Sun Muqing.</p><br/><p>Later…</p><br/><p>Jiang Xie was very distressed. “That scum pushed everything on you?”</p><br/><p>Xie Xi shook his head. “I found out what he was doing and reported him.”</p><br/><p>Jiang Xie was stunned before immediately thinking, ‘Yes, this is indeed what the child would do.’ Xie Xi might not understand the work but after a long time, he found out something was wrong. He initially didn’t believe his senior would commit a crime but the evidence collected was as dense as snowflakes and Xie Xi couldn’t deny it.</p><br/><p>At the time, a few months had passed and Sun Muqing confessed to pulling Xie Xi into the water with him.</p><br/><p>Xie Xi was shocked and the more he looked, the more disappointed he became. He finally confirmed what Sun Muqing was doing and reported him with no hesitation.</p><br/><p>Yes, in the real world, it was Xie Xi who reported Sun Muqing.</p><br/><p>Sun Muqing was arrested and Xie Xi was saved from punishment because he was the one who reported it. Nevertheless, he couldn’t avoid dropping out of school.</p><br/><p>At the time, the matter was very big and Xie Xi had no friends. A person who lived alone, it was inevitable that there would be some speculation.</p><br/><p>Many people didn’t believe that he was ignorant. They just thought that his and Sun Muqing’s interests parted, which was why Xie Xi reported him.</p><br/><p>Xie Xi was powerless to explain, not to mention he was indeed an accomplice, albeit a stupid accomplice.</p><br/><p>From then on, Xie Xi never left his house and relied on gaming to make ends meet.</p><br/><p>This lasted until Xie Su became pregnant and mother and son gave up on each other. Then he came to the Central World.</p><br/><p>This was reality. It was short and cruel compared to the beautiful dream.</p><br/><p>In fact, Xie Xi thought he would never be able to mention this matter again in his life. Whether he was in the Central World or not, no matter how many worlds he went through, the scars caused by this incident couldn’t be erased.</p><br/><p>Now he was actually saying it. It was probably due to the dream.</p><br/><p>Despite knowing it was a dream, the dream was still capable of minimizing the scars in his heart so that he could face the past.</p><br/><p>In particular, Jiang Xie… gave him too much unspeakable warmth that cruel reality was diluted.</p><br/><p>Xie Xi suddenly felt that his body and heart were much lighter. He came out of the sleeping pod and whispered, “This game was really hard. There were no clues.”</p><br/><p>He glanced at Jiang Xie and asked, “Teacher, have you encountered this type of game before?”</p><br/><p>He naturally used the term. There was no other way. He had used it for more than 60 years and his brain didn’t give him the opportunity to react.</p><br/><p>Jiang Xie’s heart was sweet and he used his words to calm himself, “It isn’t without clues. For this type of game, we can wake up as long as we realize it is a dream.”</p><br/><p>“What if you know it is a dream but don’t want to wake up?”</p><br/><p>Nothing was gone and all their desires were embraced. Even if they knew it was a dream, who was willing to believe it?</p><br/><p>They discussed the topic of the dream in terms of the game but both avoided the contents. They didn’t want to believe that it wasn’t reality.</p><br/><p>Jiang Xie replied, “I have encountered this type of game many times and quickly woke up.”</p><br/><p>Xie Xi stared at him with a stunned expression. “But this time…”</p><br/><p>Jiang Xie smiled slowly. “If a person in the dream does something fake, you will find it is a dream and your heart will also feel empty.” This disappointment would only add to the loneliness.</p><br/><p>Xie Xi understood.</p><br/><p>If he entered the game by himself, perhaps he wouldn’t have dreamt of Jiang Xie and he wouldn’t have met all the things Jiang Xie gave him. He might’ve gotten rid of Wang Qingshu and Sun Muqing or even gained Xie Su’s love. However, this was his own imagination and would feel unreal.</p><br/><p>This type of unreality made it easy for a clear-headed person to break out of. Once broken, they were free from the game.</p><br/><p>Jiang Xie had woken up countless times in the past but this time he couldn’t wake up. Xie Xi didn’t dare to ask but Jiang Xie took the initiative to say, “This time, I really didn’t feel it.”</p><br/><p>He was completely immersed and as a result, he fell. Xie Xi was no different.</p><br/><p>Jiang Xie asked him, “What do you think is true?”</p><br/><p>Xie Xi was asked this by him. “How to calculate…”</p><br/><p>Jiang Xie’s lips curved and his voice was extremely gentle. “This was indeed a dream but the two of us are real.”</p><br/><p>Xie Xi was shocked and trembled like he was electrocuted. It was a dream but the two people were the truth.</p><br/><p>Everything that happened in the dream didn’t exist but the two of them were truly involved.</p><br/><p>They got along with each other and their love and desire for each other were incredibly real. It was because for both of them, from beginning to end, whether it was in the dream or reality…</p><br/><p>Xie Xi’s Jiang Xie and Jiang Xie’s Xie Xi were real existences. They woke up from the dream but the reality was still the two of them.</p><br/><p>Jiang Xie wasn’t in a hurry. He didn’t know what happened between him and the child for him to get -365 goodwill but he was sure that they were a natural pair and each other’s only redemption.</p><br/><p>He was patient enough to wait for this young man, who had experienced a cruel reality, to come back to him.</p><br/>\n</div>"}