{"title": "Chapter 117", "id": 117, "volume": 2, "url": "http://boxnovel.org/game-loading-chapter-117", "volume_title": "Volume 2", "body": "<h1>Chapter 117</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Bonus ko-fi chapter.</p><hr/><br/><p>Sirius</p><hr/><br/><p>Did he have no shame?</p><br/><p>Yan Zhe really regretted treating this person. He shouldn’t let Jiang Xie keep lying down, save him from opening his eyes and break his legs! Jiang Xie kept sighing, “You haven’t experienced it so you don’t know. I watched the goodwill go from -365… cough, -315 to 999 and my heart was about to explode.”</p><br/><p>Yan Zhe caught his words. “You old dog, this isn’t in accordance with your previous number?” He couldn’t believe it. How did it go up by 1,314?</p><br/><p>Jiang Xie didn’t change paths. “What is this goodwill number? What is a lifetime? Xiao Xi and I promised to be reborn and love again.”</p><br/><p>Yan Zhe, “…”</p><br/><p>He shouldn’t have asked. He now had a mouthful of sourness!</p><br/><p>Jiang Xie didn’t want to let them go. “There was an illusion in the world and we spent 60 years in it. Not only did we get married and go on a honeymoon, once we died… hey, don’t go…”</p><br/><p>Yan Zhe would go crazy if he stayed!</p><br/><p>Jiang Xie cried out, “I haven’t finished yet. We met on a beautiful night. He wore a nice suit with a white bow tie. He looked at me with eyes full of…”</p><br/><p>Yan Zhe disappeared from the garden.</p><br/><p>Jiang Xie muttered, “He is so impatient despite being so old. No wonder why he hasn’t found a partner.”</p><br/><p>Qin Ge staggered at the words. The oldest single person and the one who never talked about love the longest was Jiang Xie!</p><br/><p>Jiang Xie saw that Qin Ge hadn’t gone and told him, “Come here Old Qin. I will tell you how I turned the minus hundreds of points into a positive 999…”</p><br/><p>Qin Ge waited for the gold coins to transfer and directly teleported away! The people had disappeared and Jiang Xie couldn’t help staring at the goodwill…</p><br/><p>He watered the roses while confiding in them the method he used to chase his lover. Unfortunately, the roses didn’t have legs or they would’ve directly escaped the garden.</p><br/><p>Finally, the garden was restored to its original form to ensure the child wouldn’t be aware of anything strange after Jiang Xie contacted him.</p><br/><p>Jiang Xie knew the child’s soft heart and Xie Xi would definitely be distressed if he knew Jiang Xie had been unwell.</p><br/><p>This garden was his spiritual image. How could he let the child come over if it wasn’t bright?</p><br/><p>Xie Xi stared at the friends bar for a long time and was about to bore a hole into Jiang Xie’s name.</p><br/><p>Did Jiang Xie really forget him? After thinking about the 60 years that almost took up most of his soul, Xie Xi felt the pain of cramping and breaking bones.</p><br/><p>No! Xie Xi bit his lower lip and thought, ‘So what if he forgot? I can go find him! Even if he doesn’t remember what happened before, we still have an endless future.’</p><br/><p>The current Jiang Xie might be much higher than him as Designer X but Xie Xi would fight for Jiang Xie.</p><br/><p>He would be stupid if he gave up without doing anything! Xie Xi was just clicking on Jiang Xie’s name when an invitation popped up.</p><br/><p>[X is inviting you to his garden. Do you accept?]</p><br/><p>Xie Xi jerked and his finger rubbed across it.</p><br/><p>Xie Xi, “!”</p><br/><p>Jiang Xie, “?”</p><br/><p>Xie Xi rejected the invitation.</p><br/><p>Xie Xi was anxious and wanted to say that he had made a mistake when Jiang Xie sent another invitation, accompanied by a message.</p><br/><p>[If it is temporarily inconvenient, the invitation can be suspended. I will wait for you once it is convenient.]</p><br/><p>After seeing this sentence, Xie Xi’s heart felt like it had been stuffed with marshmallows, a sweet silkiness rising.</p><br/><p>He didn’t hesitate to transfer to the garden.</p><br/><p>The tall man was particularly eye-catching among the white roses. He stood in a dazzling palce and the smile on his face was softer and more affectionate than the breeze blowing the petals.</p><br/><p>Xie Xi was stunned and his spirit didn’t return for a while. The picturesque scene made it easy to understand the word ‘beauty.’ Love was the most direct beauty. Xie Xi felt it.</p><br/><p>Jiang Xie leaned over and whispered, “I remember all of it.”</p><br/><p>Xie Xi sighed with relief. Then Old Jiang’s next sentence caused Xie Xi to wake up from the ‘beauty.’</p><br/><p>Jiang Xie whispered, “I don’t dare to move if you frown.”</p><br/><p>Xie Xi, “……..” O-Old rascal!</p><br/><p>Xie Xi’s face reddened and he forcibly changed the topic. “Why was it Sirius?”</p><br/><p>He was asking about the last illusion used by the moon. Xie Xi couldn’t understand why it would be Sirius.</p><br/><p>He could guess that because Jiang Xie was on the scene, the illusion transformed into a soul. However, there were six souls. Why was it Sirius?</p><br/><p>Jiang Xie felt itchy after seeing the red cheeks but he had to be steady and not frighten the child.</p><br/><p>“It is because of the eyes.”</p><br/><p>Old Jiang started a class and Student Xiao Xie listened attentively.</p><br/><p>“The eyes?”</p><br/><p>Jiang Xie nodded. “Among the souls, Sirius is the one most like me.”</p><br/><p>Xie Xi thought about it and replied, “No… Randall is more like you.” Randall was the fifth prince.</p><br/><p>Jiang Xie asked, “You think Randall is more like me?”</p><br/><p>The child didn’t know there was a pit in front of him and nodded. “The face is very similar. The slender eyebrows, the high nose, the special smile when laughing…” It was good-looking.</p><br/><p>Xie Xi stopped!</p><br/><p>Jiang Xie listened with a beautiful heart. “What is special?”</p><br/><p>Xie Xi had no expression on his face. “It is ugly.”</p><br/><p>Jiang Xie didn’t believe it. “Ugly?”</p><br/><p>Xie Xi didn’t have a good atmosphere. “I’m telling you the truth!”</p><br/><p>Jiang Xie stopped and coughed lightly. “I’m not talking about similar facial features. The focus is the temperament.”</p><br/><p>Xie Xi, “???”</p><br/><p>Sirius and Jiang Xie shared a temperament? Don’t mention Xie Xi. It was estimated that anyone who knew Jiang Xie would laugh!</p><br/><p>In Lost Atlantis, Sixth Prince Sirius was a bit pitiful.</p><br/><p>He didn’t have his father’s love and grew up alone because he was believed to be cursed. However, he was still simple and sincere. Finally, he learnt that he was sacrificed by his father and decided to choose death. This made it more heart-wrenching.</p><br/><p>Xie Xi’s first change in feelings towards X was due to the pitiful sixth prince.</p><br/><p>Now Jiang Xie said that Sirius was most like him? Where the hell were they similar?</p><br/><p>Oh, only the eyes. Jiang Xie explained quietly, “In fact, there is a pitiful self living under my strong outer shell.”</p><br/><p>Xie Xi stared at him blankly and spoke without any politeness. “Teacher, can you speak like a person?”</p><br/><p>Jiang Xie couldn’t help pulling the person into his arms and carefully touched him on the forehead. “Really, I was Sirius before I met you.”</p><br/><p>Xie Xi felt the atmosphere was very familiar and felt a bit uncomfortable, but he said, “I will leave if you don’t talk well.”</p><br/><p>Jiang Xie was afraid of him running and became serious. “Every soul is me from a certain period of time. Sirius is indeed the most like me, the me that was eager to meet you.”</p><br/><p>Xie Xi was stunned.</p><br/><p>Sirius was most like the one who was eager to meet him. Sirius, the cursed sixth prince, was from the period in time when Jiang Xie most needed to be accompanied.</p><br/><p>Was that why?</p><br/><p>Xie Xi still felt some confusion.</p><br/><p>Jiang Xie finally explained seriously, “In fact, the moon’s illusion is very strong. The moon hoped to succeed and this willpower shook the illusion. It analyzed your heart but couldn’t handle the complex situation. I was in front of you and it judged that my image couldn’t be released. However, you remembered that I shouldn’t know you and it presented Sirius.</p><br/><p>Xie Xi reacted for a while before figuring it out.</p><br/><p>He liked Jiang Xie in the dream but felt greedy after leaving the dream. He wanted to know Jiang Xie better and the only soul that showed Jiang Xie’s past was Sixth Prince Sirius.</p><br/><p>Thus, the illusion transformed into Jiang Xie’s past.</p><br/><p>It wasn’t Sirius. It was the more complete Jiang Xie that Xie Xi was eager to understand.</p><br/><p>It wasn’t Teacher Jiang Xie, Designer X or the souls. It was the complete Jiang Xie.</p><br/><p>Xie Xi’s face turned red!</p><br/><p>Jiang Xie was drifting in heaven. He understood what was going on once he woke up and the moment was extremely sweet.</p><br/><p>His body might be in pain and his fingers couldn’t move, but even if his whole spiritual garden became withered, the sugar at the bottom his heart became his source of life, sending him endless power.</p><br/><p>Xie Xi liked him more than Jiang Xie expected.</p><br/><p>The child who woke up from the dream wanted to know more about him.</p><br/><p>Jiang Xie couldn’t help holding him. “I’m very happy.”</p><br/><p>Xie Xi was about to explode from embarrassment. “You… you’re thinking too much!” This wasn’t the case!</p><br/><p>Jiang Xie nodded. “That’s right, I’m thinking too much. In fact, it isn’t complicated. It is just because Sirius and I are similar in looks, personality and temperament.”</p><br/><p>Xie Xi, “………………”</p><br/><p>They weren’t similar at all! The only thing similar was the eyes but this bastard deliberately didn’t mention it!</p><br/>\n</div>"}