{"title": "Chapter 138", "id": 138, "volume": 2, "url": "http://boxnovel.org/game-loading-chapter-138", "volume_title": "Volume 2", "body": "<h1>Chapter 138</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Wonderful Painting of the Mountains and Seas 18</p><hr/><br/><p>Xie Xi told him with a blank expression, “Roll!” (TL: Can also mean get lost)</p><br/><p>Jiang Xie was obedient and one dragon and bird approached again. Xie Xi didn’t push them away this time. “I said to roll!”</p><br/><p>Jiang Xie told him, “This is rolling over.”</p><br/><p>“I mean… get out!”</p><br/><p>“There is no way. My legs have their own ideas.”</p><br/><p>Xie Xi angrily cried out, “Shall I help you cut them off?”</p><br/><p>Jiang Xie cleared his throat. “I have many legs and I’m afraid you can’t cut all of them.”</p><br/><p>Xie Xi, “………………” He wanted a divorce!</p><br/><p>Jiang Xie wasn’t inclined to keep teasing him. After all, the red goodwill showed him that even if there was a high of 999, it could also fall again to -999.</p><br/><p>Jiang Xie temporarily placed Vermilion Bird away and spoke with Azure Dragon’s body. “Okay, don’t be angry. I won’t make trouble.”</p><br/><p>Xie Xi stared at him. This bastard knew that he was fooling around!</p><br/><p>Jiang Xie told him, “I want to show my mental strength to you.”</p><br/><p>Xie Xi sneered. “You showed your mental illness.”</p><br/><p>Jiang Xie gave a low laugh. “Child, those words aren’t right.”</p><br/><p>Could a psychotic person have his self-esteem hurt? Xie Xi didn’t think so.</p><br/><p>Sure enough, this guy spoke the following sentence, “You know that your husband is sick so you should quickly kiss…” What was love?</p><br/><p>Xie Xi couldn’t listen and got up. “I’m going!”</p><br/><p>Jiang Xie surrendered. “Let’s speak about business!”</p><br/><p>Xie Xi couldn’t believe in this person’s evil!</p><br/><p>Jiang Xie quickly continued, “I can only erase some of their memories. I can’t create memories.”</p><br/><p>Xie Xi became tense. “What do I do?” If this bastard failed, wasn’t Xie Xi going to die badly?</p><br/><p>Jiang Xie couldn’t bear to scare him and replied seriously, “It is easy. Act out a corresponding memory for them.”</p><br/><p>Xie Xi understood. “It is necessary for me to say the words?”</p><br/><p>“Yes, say it and I will erase all the extra parts.”</p><br/><p>Xie Xi, “…”</p><br/><p>It was really time to test his acting skills.</p><br/><p>“Come.” Jiang Xie told him. “Azure Dragon, play, action.”</p><br/><p>Xie Xi couldn’t act and laughed directly. “Shut up.”</p><br/><p>His tone was full of laughter, causing Jiang Xie to feel itchy and kiss Xie Xi on the cheek.</p><br/><p>Xie Xi gave him a look. “Is this part of the script?”</p><br/><p>Director Jiang smiled shamelessly. “This is the unspoken rule.”</p><br/><p>Damn unspoken rule! Xie Xi’s eyes curved. “Don’t delay me or…”</p><br/><p>Jiang Xie couldn’t stand it. He grabbed the person for a kiss but Xie Xi pushed him away. Jiang Xie demanded, “Kiss me.”</p><br/><p>Xie Xi’s cheeks turned red. “No:</p><br/><p>Jiang Xie looked very wronged. “We haven’t kissed for a while.”</p><br/><p>Xie Xi glanced at Vermilion Bird sitting on the bed and his face became redder. “What is he looking at?!”</p><br/><p>“It’s nothing. I’m the one watching, no one else.”</p><br/><p>Xie Xi naturally knew this but… it was weird!</p><br/><p>“I will let Vermilion Bird go outside.”</p><br/><p>“This is Vermilion Bird’s room.” “Then I’ll let Azure Dragon go outside.”</p><br/><p>This wasn’t the point! Xie Xi wondered, “If you let them go out, won’t they angrily kill each other?” As long as there were people outside, they would ‘wake up.’</p><br/><p>Jiang Xie became even more wronged. “What should I do?”</p><br/><p>“What to do? Just… wait until later.” In any case, he couldn’t kiss in front of a person, even if the person was Jiang Xie.</p><br/><p>Jiang Xie regretted it. “If I had known earlier, I wouldn’t have these two bodies together.”</p><br/><p>Xie Xi’s eyes widened. “What did you say?”</p><br/><p>“I mean, there must be no confusion between the two bodies.”</p><br/><p>“Do you think I’m deaf? How are these two sentences the same?”</p><br/><p>Jiang Xie’s calculations were invincible. “The word count is the same.” (TL: In Chinese).</p><br/><p>Xie Xi, “……………………”</p><br/><p>After staying with this person for so long, he refined the ability to rest pressure. Xie Xi’s expression didn’t change even if a mountain collapsed in front of him.</p><br/><p>Xie Xi refused to be intimate in front of another body!</p><br/><p>No matter what tricks Jiang Xie attempted, Xie Xi refused.</p><br/><p>The perverted thoughts in Jiang Xie’s head were purified. “It is hard to have so many bodies…”</p><br/><p>Xie Xi glared at him. Jiang Xie corrected himself. “I mean, I love you with five hearts and I’m just resting in other places.”</p><br/><p>That…</p><br/><p>Xie Xi took a while to respond. “You…”</p><br/><p>“I love you.”</p><br/><p>Xie Xi didn’t fall for this. “Get lost!”</p><br/><p>The two of them went in a big circle before returning to business.</p><br/><p>Xie Xi tried not to laugh and seriously told Vermilion Bird in front of Azure Dragon, “I’m sorry, the words I told you before were a lie. I only love Lord Azure Dragon and don’t want to dissolve my engagement with him. I hope you can understand. Feelings can’t be forced. Who likes who…”</p><br/><p>Jiang Xie nodded. “Yes, just like I will always like you.”</p><br/><p>Xie Xi scolded him. “Don’t speak!”</p><br/><p>Jiang Xie spoke pitifully, “You used to listen to me before.”</p><br/><p>“You were giving a lecture!”</p><br/><p>“I’m giving a lecture now about our sweet love.”</p><br/><p>Xie Xi exclaimed, “We’re still recording!” Then he realized that he was taken in by this guy. What was recording?</p><br/><p>After doing it again, he finally passed.</p><br/><p>Jiang Xie told him, “Come on, next.”</p><br/><p>Xie Xi was too lazy to correct him. In any case, this was almost the same as filming. Once he finished, Jiang Xie would also ‘cut’ it.</p><br/><p>Xie Xi told Azure Dragon in front of Vermilion Bird, “I’m sorry. My mind has been decided. I want to be with Sage Vermilion Bird. Our engagement…”</p><br/><p>This time it was better. Jiang Xie didn’t interrupt and waited for Xie Xi to finish. Xie Xi asked, “How about it?”</p><br/><p>Jiang Xie was also into the play. “If you really regret the marriage…”</p><br/><p>Xie Xi wanted to shake his head and shouted, ‘Wake up a bit! The ants have been moving for 10 years!’</p><br/><p>Jiang Xie’s eyes brightened. “There is still some time. Shall we take the opportunity to do something?”</p><br/><p>Xie Xi hit him blankly but his heart was tugged.</p><br/><p>The brain circuits of the souls were basically a map of Jiang Xie. Two of them almost died and Xie Xi was actually worried.</p><br/><p>He always felt that the previous X was world-weary. This was despite standing at the peak of Central, becoming the greatest designer and creating countless myths.</p><br/><p>Jiang Xie was pessimistic and even despised himself. The more he understood, the more Xie Xi had to admit it. A distressed Sirius was actually hiding in this man’s heart.</p><br/><p>The trio couldn’t be alone for too long. Once things finished, it was time to withdraw.</p><br/><p>Think about it. They came for a tense showdown so how could they have tea and chat?</p><br/><p>The time had dragged on long enough and Jiang Xie guaranteed something. “These old beasts have lived for too long. Their concept of time is poor and I can adjust it slightly.</p><br/><p>Xie Xi was silent.</p><br/><p>A thousand year old dragon… a thousand year old bird… they were really old beasts.</p><br/><p>However, how could this person say it!</p><br/><p>For this Jiang Xie, Xie Xi really had a heart of stone.</p><br/><p>This guy was criticizing himself? How could Xie Xi not believe it?</p><br/><p>Jiang Xie finally asked Xie Xi to make up the contents.</p><br/><p>Xie Xi told Azure Dragon, “I want to go back to the rose family and cultivate in the nursery for a while, so I will have the strength to repair your scales.”</p><br/><p>He also mentioned the marriage. “We should wait regarding marriage. On the one hand, I don’t want to stimulate Vermilion Bird again. On the other hand, I want to concentrate on repairing your scales. Can we hold the wedding once you are perfectly healthy?”</p><br/><p>Jiang nodded while holding his hand. “Marriage isn’t urgent. Can we hold the bridal chamber first?”</p><br/><p>Xie Xi, “…Get lost!”</p><br/><p>Then he said to Vermilion Bird, “I have to go back to the rose family and inform the elders. After all, cancelling a marriage contract isn’t a trivial matter. Many things have to be carefully handled. Can we first conceal our relationship and then reveal it once the marriage contract is cancelled?”</p><br/><p>After all, it was the Holy Mountain. If he was together with Vermilion Bird before the marriage was cancelled, it would be embarrassing. It was better to have a time buffer.</p><br/><p>Jiang Xie agreed and then said, “It doesn’t matter about a public relationship. A private tryst…”</p><br/><p>Before he finished speaking, Xie Xi covered his mouth. “I won’t see you again next time.”</p><br/><p>Jiang Xie blinked. Xie Xi sneered. “I think your souls are lovelier than you.”</p><br/><p>Jiang Xie, “!”</p><br/><p>This was really a broken leg!</p><br/><p>Once out the door, Azure Dragon and Vermilion Bird were restored to their original states. They were inscrutable and stared at each other with generous eyes, letting bygones be bygones.</p><br/><p>Xie Xi stood between them and realized what it was like to suffocate on the atmosphere.</p><br/><p>He was in a hurry to withdraw because he was afraid to stay any longer.</p><br/><p>Azure Dragon earnestly told Vermilion Bird, “Recuperate. The most important thing is your body.” Losing love wasn’t so terrible. If he was alive, he would always meet someone else.</p><br/><p>Vermilion Bird told Azure Dragon, “You too. Keeping a good body is the biggest capital.” Falling out of love was good. He could continue his cultivation path of no desires.</p><br/><p>Xie Xi had a toothache!</p><br/><p>Fortunately, Director Jiang’s editing technique was excellent. Both of them felt like they were the final winner and felt respect and compassion for the loser, not adding insult to injury.</p><br/><p>The three people came outside and Azure Dragon and Vermilion Bird spoke at the same time, “I will send you back to Rose Mountain.”</p><br/><p>Xie Xi, “!”</p><br/><p>Azure Dragon stared at Vermilion Bird and Vermilion Bird stared at Azure Dragon. The two people raised their eyebrows at the same time.</p><br/><p>Xie Xi was caught in the middle and felt a bitter chill.</p><br/><p>Director Jiang, I just praised you on your skills. How could it go wrong?</p><br/>\n</div>"}