{"title": "Chapter 134", "id": 134, "volume": 2, "url": "http://boxnovel.org/game-loading-chapter-134", "volume_title": "Volume 2", "body": "<h1>Chapter 134</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Last ko-fi chapter owed from last week</p><hr/><br/><p>Wonderful Painting of the Mountains and Seas 14</p><hr/><br/><p>He was calling Houqing’s name? Xie Xi was dazed and wasn’t too clear about the situation.</p><br/><p>Azure Dragon wore a moonlight garment with a dragon pattern flashing on the sleeves. His body was slender and his facial features were cold. In the beautiful sunshine, he was as fresh as the first snow.</p><br/><p>Xie Xi was slightly startled and stared blankly.</p><br/><p>Azure Dragon whispered, “You are a little rose. How can you know Houqing of the Demon Sea?”</p><br/><p>Xie Xi couldn’t answer and he was still curious about his situation.</p><br/><p>Azure Dragon in front of him was unscathed and wasn’t in the half-dead state. This wasn’t Azure Dragon Palace. Flowers were blooming in the distance and the sky was full of sunshine. Was this the flower festival? Did he accidentally enter the painting?</p><br/><p>Xie Xi didn’t understand and slightly frowned while thinking.</p><br/><p>Azure Dragon leaned over and said, “You are badly hurt. I’ll take you to heal your wounds.”</p><br/><p>Xie Xi moved and the pain caused him to frown.</p><br/><p>Azure Dragon picked him up and wondered, “Why don’t you change back to your original form first?”</p><br/><p>Xie Xi was a good person who didn’t want to be a rose. He was afraid that once he became a flower, he wouldn’t be able to turn back. He wasn’t very skillful with this transformation!</p><br/><p>Xie Xi shook his head. Azure Dragon reassured him, “It doesn’t matter as long as you are comfortable.”</p><br/><p>His temperament was warm and his voice was very nice. His body had a fresh scent like jungle bamboo and inexplicable reassured people.</p><br/><p>Xie Xi whispered, “Sage, thank you for saving me.”</p><br/><p>Azure Dragon was slightly surprised. “You recognize me?”</p><br/><p>Xie Xi explained, “Our Rose Mountain has been blessed by the sage for many years. Of course I recognize you.”</p><br/><p>Azure Dragon smiled. “I have never seen a little rose like you.”</p><br/><p>Xie Xi didn’t like being called this by people because he always felt it was a joke. However, Azure Dragon’s tone was gentle and Xie Xi couldn’t refute that he was a rose. “I’m not little. I have long become an adult.”</p><br/><p>Azure Dragon was startle. “How old are you?”</p><br/><p>“…19 years old.”</p><br/><p>Azure Dragon’s eyes were full of laughter. “You are really an adult but you are still a little rose.”</p><br/><p>Xie Xi, “…” Fine, who made him a real rose flower!</p><br/><p>The teasing from Azure Dragon was actually to distract Xie Xi from his pain. Xie Xi also felt this and his heart warmed.</p><br/><p>The doctor arrived and Azure Dragon carefully put Xie Xi down.</p><br/><p>Xie Xi didn’t know his own situation and only felt that his lower body was numb. The doctor frowned as he examined Xie Xi for a long time. “This injury…”</p><br/><p>Azure Dragon interrupted. “Say it outside.”</p><br/><p>The doctor bowed and followed him out. Xie Xi became even less aware of what was wrong with him. After a while, Azure Dragon came back. There was a shadow on his face but he smiled. “You are fortunate. If it was delayed any longer, no one could save you.”</p><br/><p>Xie Xi thanked him.</p><br/><p>Azure Dragon smiled. “It’s nothing.”</p><br/><p>He spoke easily but the doctor came in with a white pill in his hand. The doctor’s posture was dignified and tense, as if he was reluctant.</p><br/><p>Azure Dragon didn’t care. He took the medicinal pill and placed it against Xie Xi’s mouth. “Eat it.”</p><br/><p>Xie Xi was very sensitive and realized that things might not be simple. “Your Excellency, this medicine…”</p><br/><p>“It’s just the usual blood staunching pill. You eat it.”</p><br/><p>He said this and the doctor looked like he was going to cough up blood. If this was a blood staunching pill, the doctor would probably have to take it first to stop his internal bleeding.</p><br/><p>Xie Xi felt that this was something that happened a long time ago and no longer thought about it as he ate the pill.</p><br/><p>This ‘blood staunching pill’ was very strong. After eating it, Xie Xi felt itchy, sore and painful. It was indescribable.</p><br/><p>Azure Dragon held his hand. “It will be a bit uncomfortable. Please endure it.”</p><br/><p>Xie Xi was somewhat unable to maintain his mind. He gritted his teeth but couldn’t prevent himself from crying out.</p><br/><p>He vaguely heard Azure Dragon’s low reprimand, “What is happening?”</p><br/><p>The doctor was terrified. “This Qing Pill is a world treasure and has the effect of resurrection. This small rose’s foundation is too shallow and it is normal that he can’t withstand it.”</p><br/><p>Azure Dragon cried out, “It’s been too long!”</p><br/><p>The doctor replied, “I have a bottle of analgesia here. If used, he will surely sleep well and will be fully recovered when he wakes up. Just…”</p><br/><p>“Just what?” “This analgesic has some side-effects.”</p><br/><p>“What side effects?”</p><br/><p>The doctor explained, “He might forget some of the past.”</p><br/><p>Azure Dragon, “…”</p><br/><p>Xie Xi felt he would die from the pain and vaguely heard Azure Dragon’s gentle yet pained voice. “Don’t cry, it will stop hurting soon.”</p><br/><p>At his gentle whisper, Xie Xi stopped feeling pain and he seemed to fall asleep. He woke up refreshed without any more discomfort.</p><br/><p>Azure Dragon watched over him for one night and saw him wake up. “How do you feel?”</p><br/><p>Xie Xi smiled. “Thank you for your help, Sage Azure Dragon!”</p><br/><p>Azure Dragon saw him smiling happily and was relieved. “It’s nothing. There’s no need to thank me.”</p><br/><p>“That can’t be. If it wasn’t for the sage saving me in time, I would’ve died on that mountain.” Azure Dragon asked him, “How can you be so badly hurt?”</p><br/><p>How could Xie Xi know? This was originally a setting of the painting and he came in halfway. There was no way for him to know.</p><br/><p>Azure Dragon was still staring at him. Xie Xi hesitated before replying, “I was probably bitten by a worm monster… us roses are most afraid of the worms.”</p><br/><p>This injury definitely wasn’t a bite. Azure Dragon watched him and asked, “Have you been to the Demon Sea?”</p><br/><p>Xie Xi replied like it was natural, “No.”</p><br/><p>If he hadn’t been to the Demon Sea, how could he call out the name of Ancestor Houqing in such a helpless and sentimental voice while he was in danger?</p><br/><p>It was the side effect of the analgesic. This little rose had forgotten some past events.</p><br/><p>Azure Dragon just wanted to save him but now he was selfish and didn’t want the rose to think about the past.</p><br/><p>“Say it…” Azure Dragon asked in a low voice, “How would you like to thank me?”</p><br/><p>Xie Xi didn’t respond.</p><br/><p>Azure Dragon stared at him and his thin lips curved in a smile. “Didn’t you say you wanted to thank me?”</p><br/><p>“Of course!”</p><br/><p>“How will you thank me?”</p><br/><p>Xie Xi blinked. “How do you want me to thank you?”</p><br/><p>Azure Dragon was truly a certain someone’s soul. “Then how about giving your heart to me?”</p><br/>\n</div>"}