{"title": "Chapter 139", "id": 139, "volume": 2, "url": "http://boxnovel.org/game-loading-chapter-139", "volume_title": "Volume 2", "body": "<h1>Chapter 139</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Wonderful Painting of the Mountains and Seas 19</p><hr/><br/><p>What should he do now? Both of them had a legitimate reason to send him back to Rose Mountain.</p><br/><p>Azure Dragon was sending his fiance back to his family, which was reasonable. It was able reasonable for Vermilion Bird to send his sweetheart back to break off the engagement.</p><br/><p>And… Azure Dragon (Vermilion Bird), why are you buzzing around your former fiance (failed target of seduction)?!</p><br/><p>The cold air they were radiating aimed at each other.</p><br/><p>However, Xie Xi was between them and had a guilty conscience. It was inevitable that he would be frozen by their cold air!</p><br/><p>The dragon and bird were about to speak…</p><br/><p>Xie Xi was a man who had walked through a mountain of daggers and a sea of flames. His response time was fast enough. “Your body isn’t recovered. You don’t have to send me.”</p><br/><p>What double wordplay was this?</p><br/><p>The speechless Jiang Xie silently praised his wife, cough…he felt a touch of sadness…</p><br/><p>Azure Dragon broke his cultivation, his tail was bloody and his body was quite bad. Vermilion Bird had almost died. His self-healing ability might be strong but he hadn’t recovered enough.</p><br/><p>Therefore, Xie Xi hadn’t mentioned a name but both of them could accept it.</p><br/><p>Azure Dragon (Vermilion Bird), ‘He is definitely speaking to me. Otherwise, how can he be concerned about the man he dumped?’</p><br/><p>Xie Xi’s back was sweaty but his face was surprisingly calm. “I will trouble Lord Azure Dragon so that Brother Black Dragon will send me back to Rose Mountain.”</p><br/><p>Black Dragon was a follower of Azure Dragon and one of the silent black men.</p><br/><p>Vermilion Bird frowned and was about to talk when Xie Xi spoke again, “After returning to Rose Mountain, I need Brother Black Dragon to help me deal with matters.”</p><br/><p>These words were even more subtle.</p><br/><p>For Azure Dragon, Xie Xi’s meaning was that since they were going to change the wedding date, Azure Dragon Palace needed to send someone to speak in person. Azure Dragon should’ve gone but since his current situation was too bad, Xie Xi refused to let him go and called Black Dragon.</p><br/><p>The words were also reasonable for Vermilion Bird. Xie Xi and Azure Dragon were breaking off their engagement and there were too many things to deal with. Azure Dragon was too ashamed to do it himself so it was appropriate to send a subordinate.</p><br/><p>Xie Xi continued, “This way, you don’t have to travel back and forth. Once things are done, I’ll come back.”</p><br/><p>He spoke very calmly but his heart was panicked. As long as Azure Dragon or Vermilion Bird spoke a few words, he would be finished!</p><br/><p>Fortunately, Azure Dragon and Vermilion Bird’s own minds made them happy and they didn’t think much about it. “Then be careful on the way.”</p><br/><p>Their words were exactly the same!</p><br/><p>Xie Xi relaxed and his heart slightly warmed. It was estimated that Jiang Xie had affected them in the darkness. Otherwise, Xie Xi’s words were a thin piece of paper and could easily be broken to reveal he was a slag.</p><br/><p>He had to leave this place as soon as possible! Xie Xi said goodbye to Vermilion Bird and Vermilion Bird told him, “Be careful.”</p><br/><p>Fortunately, he didn’t tell Xie Xi to come back early.</p><br/><p>Xie Xi didn’t dare to let Azure Dragon and Vermilion Bird stay together alone and asked, “Lord Azure Dragon, aren’t you going?”</p><br/><p>“I…” Azure Dragon was going to say, “I’m going back to Azure Dragon Palace to wait for you,” only to change it to “There are still some things back at Azure Dragon Palace. Goodbye.”</p><br/><p>What was going on? Azure Dragon was a bit confused and didn’t understand why he suddenly changed his words.</p><br/><p>However, it didn’t matter. He had already promised Xie Xi that he wouldn’t stimulate Vermilion Bird and these words were indeed more secure.</p><br/><p>Xie Xi didn’t know that he almost fell off the wire rope! Still, swaying on the rope was much better than falling…</p><br/><p>After escaping unharmed, Xie Xi and Black Dragon returned to Rose Mountain.</p><br/><p>Black Dragon was silent the whole way and didn’t say a word. Xie Xi’s mind was full of thoughts and it was best not to talk.</p><br/><p>He didn’t forget that there was a white tiger cub back home. If the little guy rushed out and called him ‘Daddy’, Black Dragon would immediately fly back to the Holy Mountain to call Azure Dragon over.</p><br/><p>After all, Azure Dragon was a real dragon and Xie Xi was a real flower. How could they give birth to a white tiger?</p><br/><p>If it was a normal tiger, Xie Xi could say this was his pet and there was no family relationship with him.</p><br/><p>However, the white tiger was too distinctive and was almost a copy of Sage White Tiger. Any fool would suspect Xie Xi.</p><br/><p>Brother Black Dragon obviously wasn’t a fool. Rather, he looked shrewd.</p><br/><p>Xie Xi racked his brains to find ways to deal with the tiger but he couldn’t think of a good method.</p><br/><p>Xie Xi had just entered Rose Mountain when a teenager in purple greeted him. “Brother 99! Go to the Chief’s Hall. Sister Purple Nine is looking everywhere for you.”</p><br/><p>Xie Xi became cold as he thought something had happened. “Is it another attack by the worms?”</p><br/><p>“No, no.” The rose teenager replied, “It looks like something happened at your home.”</p><br/><p>Xie Xi, “…” He had an ominous feeling. Surely another soul hadn’t come looking for him?</p><br/><p>He looked over at Black Dragon and was going to send him away when Black Dragon spoke, “There is an emergency at your home. Go and see.”</p><br/><p>Xie Xi’s mouth was dry. “Good…”</p><br/><p>He had no choice but to go see the situation. He entered his house and Purple Nine looked over at him uneasily. “99, it is my bad. I didn’t see him!”</p><br/><p>“Purple Nine, don’t worry. What happened?”</p><br/><p>“The little tiger disappeared!”</p><br/><p>Xie Xi, “!”</p><br/><p>This brainless tiger was really helping him!</p><br/><p>Purple Nine saw Xie Xi and was even more annoyed. “I just went out for a meal and came back to find he was gone.</p><br/><p>Black Dragon asked, “Tiger?”</p><br/><p>Xie Xi was probably the only parent elated about losing his son. He calmly replied, “A lost little cub who was looking for his mother. I helped him and wanted to find his relatives. Unexpected, something happened with Lord Azure Dragon and I hurried to the Holy Mountain, entrusting him to the family.”</p><br/><p>Purple Nine was ashamed. “I really…”</p><br/><p>Xie Xi told her, “I don’t blame you. The little tiger is very unusual. If he wants to go then you can’t stop him.”</p><br/><p>Purple Nine felt regret. “But he is so small.”</p><br/><p>“He is very powerful and the worms couldn’t stop him.</p><br/><p>Purple Nine heard this and calmed down. Previous, the white tiger cub smashed all the worms when arriving at Rose Mountain. After all, he was the child of Sage White Tiger and presumably nothing bad would happen to him.</p><br/><p>Xie Xi added, “Maybe he went back to his father. This is also a good thing.”</p><br/><p>Purple Nine was finally comforted.</p><br/><p>The conversation wasn’t hidden from Black Dragon and Black Dragon didn’t recognize anything wrong.</p><br/><p>A little tiger running around, Xie Xi cared for it for a little bit. Then he came back and found the white tiger was gone…</p><br/><p>Black Dragon would never think that another big white tiger was the father and Xie Xi was the mother. It was unknown when and how they had a baby together.</p><br/><p>Purple Nine saw Black Dragon and asked, “Did something happen for Lord Black Dragon to appear on Rose Mountain?”</p><br/><p>Xie Xi told her about the wedding postponement. Purple Nine glanced uneasily at Xie Xi.</p><br/><p>Xie Xi appeased her, “My relationship with the sage is fine. We just want more time to prepare.”</p><br/><p>Purple Nine sighed with relief.</p><br/><p>Black Dragon bowed and wondered, “Can I meet with the chief?”</p><br/><p>Purple Nine replied, “Of course, please come with me.”</p><br/><p>Thus, Xie Xi smoothly delayed the wedding.</p><br/><p>The old chief was very excited to see Black Dragon. Once the formalities were finished, he asked, “Stay for a meal?”</p><br/><p>Xie Xi’s lips curved downwards and he desperately wanted to fight this old man.</p><br/><p>Fortunately, Black Dragon had integrity and refused to be ‘bribed.’ “I have to go back. There can’t be any delays.”</p><br/><p>Xie Xi was relieved and refused to give the old chief a chance to speak. “In that case, I will send Brother Black Dragon back!”</p><br/><p>He sent away Black Dragon and Xie Xi rushed towards the next game.</p><br/><p>The Rose family agreed with Houqing’s servant about returning the betrothal gift within three days. On the third day, Xie Xi left for the Demon Sea.</p><br/><p>The old chief was worried. “We have rummaged through all of Rose Mountain in the past few days and haven’t found this white rose.</p><br/><p>Red Three agreed. “It is strange. There might be many white roses with nine in their names but it shouldn’t be impossible to find!”</p><br/><p>Blue Four sneered. “After causing this disaster, how could he stay in Rose Mountain? He probably ran away.”</p><br/><p>Xie Xi’s knees hurt. After all, they were shot full of arrows.</p><br/><p>The easily swayed yellow rose said, “They are the same white rose with a nine in their name but they are really different. 88 revitalized Rose Mountain, saving lives with the name of the flower god, while the other is a dissolute flirt. It is better not knowing because it is really scary!”</p><br/><p>Xie Xi, “………………”</p><br/><p>He didn’t know how much the yellow rose would hate his own mouth if he later found out the truth.</p><br/><p>Xie Xi told them, “Then I’ll go to the Demon Sea first.”</p><br/><p>The old chief replied, “Good! I’ll arrange for someone to bring the betrothal gifts with you!”</p><br/><p>There were so many gifts that it was uncertain with Xie Xi alone. He had to bring some big roses with him.</p><br/><p>Purple Nine and Red Three volunteered to go to Demon Sea.</p><br/><p>Xie Xi still had some face left. It might be stripped bare sooner or later but he didn’t want it to happen in front of acquaintances. In short, by delaying it for a while, wasn’t there a one in ten-millionth chance that it wasn’t revealed?</p><br/><p>There was hope as long as they were alive. Little rose, be strong!</p><br/><p>In the end, the people who would go were all strangers. Among them was the red rose who said to ‘let Houqing and Nine Tails fight each other.’</p><br/><p>Rose Two told Xie Xi, “Rest assured, we will drop the betrothal gifts and run!”</p><br/><p>The problem was that the monk could run away butt he temple wouldn’t run with him!</p><br/><p>Red Two really wanted to run with the temple. “We will move our family to Azure Dragon Palace’s back garden!”</p><br/><p>Don’t say it… this was really good. What was good? Xie Xi was pedalling five boats. Once exposed, Azure Dragon would hatefully go to the back garden and cut down all the flowers!</p><br/><p>Xie Xi had to say, “It isn’t so serious. The Demon Sea advocates freedom and they shouldn’t be unreasonable.”</p><br/><p>He was so stable that the roses were reassured and their trust in him increased.</p><br/><p>Rose Mountain was very far from the Demon Sea. The roses had to walk several days and nights.</p><br/><p>Fortunately, Nine Tails’ betrothal gifts were placed on a sturdy mount and it wasn’t long before they reached Nine Tailed Fox Palace.</p><br/><p>On the road, a rose asked curiously, “Why did Ancestor Nine Tails arrange such a mount?”</p><br/><p>Rose Two was really understand. “Of course, it is for our convenience to return the betrothal gifts.”</p><br/><p>Xie Xi, “……..” Fortunately, he was sitting in the middle. If he lost his grip and fell down, this whole play would be over!</p><br/><p>The roses were very curious about the Nine Tailed Fox Palace and were dazzled once they arrived.</p><br/><p>“The Demon Sea is like this.”</p><br/><p>“What a beautiful palace! It is like it is made of snow, an ice sculpture!”</p><br/><p>“What do you mean by like? It actually is made out of thousands of years of ice!”</p><br/><p>The roses liked the cold and were afraid of heat. Thus, they were overjoyed. “Isn’t this very suitable for our growth?”</p><br/><p>“Are you a snow plum flower?” Cool and cold were two different concepts.</p><br/><p>Xie Xi didn’t say anything because he was stunned by the sight of the ice palace.</p><br/><p>It was very familiar. This was clearly a replica of his castle in the first quasi-world!</p><br/><p>Nine Tails was the second prince and the vampire in the first world. He built the palace into this appearance, making Xie Xi have mixed feelings.</p><br/><p>In Atlantis, Randy had the memories of the first world. Could it be that Nine Tails also had memories of the first two worlds?</p><br/><p>This was too deadly! His past lives were simply increasing the difficulty of clearing the world! Xie Xi was so disturbed that he wasn’t in the mood to appreciate this beautiful ice palace.</p><br/><p>The mount stopped and people from the fox family immediately greeted them. The fox family were enchanted and the female and males wearing red clothes were indescribable.</p><br/><p>Red Two was also in red but their temperaments were completely different. One was an enchanting demon and the other was a fool with a tiger’s head.</p><br/><p>A red fox asked, “Lord White Rose?”</p><br/><p>Xie Xi had to reply, “Yes.”</p><br/><p>The fox was overjoyed. “You personally came to deliver the betrothal gifts?”</p><br/><p>Those wearing red clothes had the same brain circuits!</p><br/><p>Red Two immediately said, “No, we are…”</p><br/><p>Before he could finish, the fox actually shed tears. “It is fortunate that you are here. Our ancestor abandoned his eight tails and practiced his inner alchemy to save you from the brink of death.”</p><br/><p>Xie Xi’s heart thumped as he realized that the silver fox before only had one tail…</p><br/><p>The red fox continued, “Outsiders might say that us foxes have a yin nature but once we are the most dedicated to our lovers. As long as we are determined, we will die unswervingly for them.”</p><br/><p>Forget Xie Xi, even Red Two didn’t dare say that they were returning the betrothal gifts!</p><br/><p>The red fox cried in a touched manner. “Fortunately, you aren’t a fickle person or us foxes will try our best to tear apart the abandoned heart.”</p><br/><p>Crying while saying such murderous words, the fox really had talent.</p><br/><p>Xie Xi was stable on the surface but his heart was panicked. It was true that he wasn’t fickle. The problem was that others didn’t see it this way!</p><br/>\n</div>"}