{"title": "Chapter 132", "id": 132, "volume": 2, "url": "http://boxnovel.org/game-loading-chapter-132", "volume_title": "Volume 2", "body": "<h1>Chapter 132</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Wonderful Painting of the Mountains and Seas 11</p><hr/><br/><p>Across the red flames, Xie Xi and Azure Dragon gazed at each other.</p><br/><p>Even through the fire, Xie Xi could see the shock in Azure Dragon’s indigo eyes before they became dead.</p><br/><p>It felt like the hot Vermilion Bird Palace had dropped several degrees.</p><br/><p>One phrase could be used to describe Azure Dragon’s mood: fallinnnnnng to the end.</p><br/><p>Originally, he knew that Xie Xi was escaping from the marriage and suspected that he ‘cheated.’ Azure Dragon doubted the people around him but Xie Xi’s original cheating partner was Vermilion Bird of the Holy Mountain.</p><br/><p>It was only Vermilion Bird who could freely take Xie Xi across the mountains and rivers.</p><br/><p>Azure Dragon’s heart was being torn apart. He was clearly standing in a place where fire was burning but his hands and feet were cold as ice.</p><br/><p>Xie Xi didn’t need to ask what this guy was thinking! The damn thing was… he couldn’t explain it.</p><br/><p>He hadn’t seen Vermilion Bird yet and Vermilion Bird was dying. If he told Azure Dragon it was a misunderstanding in Vermilion Bird’s presence…</p><br/><p>Vermilion Bird would surely show him a death performance on the spot!</p><br/><p>The phoenix could be reborn after dying but Vermilion Bird… it didn’t seem possible?</p><br/><p>How could Xie Xi dare take this risk?</p><br/><p>The man with the colourful tail feathers knew the inside story. His mood was complicated when he saw that Azure Dragon had also come. He was annoyed by this greedy scum flower but if the scum flower left now, their sage would die. He had to stabilize this situation.</p><br/><p>“Lord Azure Dragon.” The man with the colourful tail feathers greeted him. “Our sage doesn’t have any major problems. He just needs to rest. I’m really ashamed about bothering you.”</p><br/><p>He wanted to take the Azure Dragon away to give Xie Xi a chance.</p><br/><p>It was a pity that this trick was too low level. Azure Dragon wasn’t a fool and he opened his mouth, “In that case, Xiao Xie will go back with me.”</p><br/><p>His words were clear and calm. There was nothing unusual but everyone present got a chill that soaked their bones. In particular, Xiao Xie was frozen and trembling in the fire.</p><br/><p>The man with the colourful tail feathers made an ugly face. “Lord Xie Xi still has something to do…”</p><br/><p>Azure Dragon didn’t wait for him to finish. “Then I will wait for him and also take a look at Vermilion Bird’s situation. I won’t feel assured until I see him awake.”</p><br/><p>He wouldn’t go! Xie Xi wasn’t surprised at all. It would be strange if Azure Dragon left. What to do?</p><br/><p>Could he speak sweet words to Vermilion Bird in front of Azure Dragon? What if Azure Dragon hacked them to death in a fit of rage?</p><br/><p>Should he go out first with Azure Dragon to have a good talk? Could Azure Dragon be coaxed to wait?</p><br/><p>Don’t mention coaxing since it wasn’t even certain it would work. Based on Vermilion Bird’s current situation, Xie Xi believed that taking even one step away meant Vermilion Bird wouldn’t hesitate to die!</p><br/><p>The fifth prince was a real artist and artists were naturally sensitive. If Xie Xi slightly revealed his intention of coaxing Vermillion Bird to live, it was estimated that Vermillion Bird would rise to heaven.</p><br/><p>The man with the colourful feather tails was also very clear about this point and looked anxiously at Xie Xi, his voice full of pleading. “Lord Xie Xi, you… you…”</p><br/><p>Xie Xi definitely wouldn’t leave Vermilion Bird no matter what. The important thing was to save this person!</p><br/><p>Xie Xi cruelly turned his head and entered the blazing red light.</p><br/><p>He couldn’t see behind him but Azure Dragon’s gaze seemed to be ice that penetrated his clothes and stabbed him in the back.</p><br/><p>Xie Xi gritted his teeth and put all his mind on Vermilion Bird. “Sage…”</p><br/><p>Vermilion Bird lay on the bed with his eyes closed. His facial features were the same as Jiang Xie and they looked almost identical when Vermilion Bird’s eyes were closed.</p><br/><p>Vermillion Bird was pale and haggard, his life obviously at risk.</p><br/><p>How could Xie Xi not be emotional after seeing such a Jiang Xie? His eyes were red and his voice choked. “Sage, please wake up. Open your eyes and look at me, okay?”</p><br/><p>Vermilion Bird seemed to hear his voice and his thin lips moved as he called out lightly, “Xiao Xie.”</p><br/><p>Xie Xi nodded and held his hand. “I’m here.”</p><br/><p>Vermilion Bird weakly held him, voice as low as a whisper. “I’m sorry, I can’t bear to see you with other people.”</p><br/><p>Xie Xi prepared himself. “I won’t be with anyone else.”</p><br/><p>In fact, Azure Dragon, Vermilion Bird, White Tail and Nine Tails added together weren’t anyone else to Xie Xi!</p><br/><p>These words were very powerful, piercing the heart of the person behind him while giving hope to the person in front of him.</p><br/><p>Vermilion Bird was weak and dying. Now he could open his eyes and the fire burning the palace disappeared, showing the exquisite jade outline.</p><br/><p>The birds present were ecstatic. “The sage woke up!”</p><br/><p>Vermilion Bird held Xie Xi and asked while staring at him, “You really won’t be with anyone else?”</p><br/><p>Xie Xi had already said this and wasn’t afraid to say a few more words. “Yes.”</p><br/><p>“But your engagement…”</p><br/><p>Xie Xi told him, “I won’t marry someone else.” This was true. His marriage object had always been one person.</p><br/><p>Vermilion Bird sat up, his red clothes hanging down and lining his skin like a painting. “You…”</p><br/><p>Xie Xi knew what he wanted to hear and sent a message to his heart. “I like you. How can I be with other people?”</p><br/><p>Vermilion Bird’s pupils shrank and he grabbed Xie Xi’s shoulder. “Don’t lie to me.” Xie Xi wasn’t lying but this situation…</p><br/><p>“If I lie to you, thunder will…” Xie Xi’s vow hadn’t finished when Vermilion Bird interrupted. “Don’t say it. I am happy as long as you have me in your heart.”</p><br/><p>He finished speaking and all the fire in the Vermilion Bird Palace disappeared while the birdsong became exhilarated and jubilant.</p><br/><p>Vermilion Bird held Xie Xi’s hand and got out of bed, only to see Azure Dragon in the main hall. Vermilion Bird was startled and his grip on Xie Xi’s hand increased.</p><br/><p>Xie Xi inevitably looked at Azure Dragon. Azure Dragon’s lips were tight and there was no blood on his face. He stared at Xie Xi without blinking… Finally, he coughed lightly and there was a trace of blood at the corners of his mouth.</p><br/><p>Xie Xi’s heart was pierced!</p><br/><p>Vermilion Bird didn’t say a word but pulled Xie Xi into his arms, fearing that Xie Xi would be taken away.</p><br/><p>Azure Dragon stared from a distance before turning away without saying anything. His back was desolate and lonely, as if he had been abandoned by the whole world.</p><br/><p>Xie Xi’s heart was a hornet’s nest. If Vermilion Bird wasn’t holding him, he would definitely chase after Azure Dragon.</p><br/><p>Steady, steady… Xie Xi told himself. He worked hard to save Vermilion Bird and it couldn’t be undone.</p><br/><p>It was imperative to be alone with Vermilion Bird and discover the situation from Jiang Xie.</p><br/><p>He understood it and it was reasonable but the emotional Xie Xi couldn’t let it go. The thought of Azure Dragon truly experiencing betrayal…</p><br/><p>He felt pained and angry but didn’t know who to feel pained for and who to be angry at!</p><br/><p>Jiang Xie couldn’t fulfil the designer’s responsibilities without separating his soul. The separation of the soul led to worlds that only Xie Xi could enter. As soon as Xie Xi entered, the group of souls would scramble for his attention.</p><br/><p>How could he feel angry? What was he angry about?</p><br/><p>Jiang Xie loved him so much that every strand of hair would die for him?</p><br/><p>Xie Xi’s heart was pained, sweet and also bitter. He experienced thousands of gestures of love every minute!</p><br/><p>Xie Xi was distracted and Vermilion Bird’s voice was full of uneasiness. “Xiao Xie, did you say those words because you saw that I was seriously hurt?”</p><br/><p>Xie Xi’s heart was stunned. “What are you saying? Would I say those words to coax you?”</p><br/><p>Vermilion Bird whispered, “Azure Dragon heard all of it.”</p><br/><p>Xie Xi, “…”</p><br/><p>“I’m not good and didn’t meet you earlier.”</p><br/><p>In fact, their encounter was very early, early than the fourth prince (Azure Dragon). However, in Atlantis, Xie Xi had agreed to the fourth prince’s proposal while the fifth prince (Vermilion Bird) was busy resurrecting Sein and didn’t have a chance to propose. The dream didn’t count.</p><br/><p>Xie Xi’s heart wasn’t steady and he glanced at Vermilion Bird. “Your Excellency, you just woke up and should rest well.”</p><br/><p>Vermilion Bird wasn’t in a hurry. “Do you want to go?”</p><br/><p>Xie Xi’s heart was a mess. “I won’t go. I’ll be here with you.”</p><br/><p>Vermilion Bird’s eyes were bright and the joy was palpable.</p><br/><p>He hadn’t recovered yet and it wasn’t easy to control the fire. He lost his natural fire and if it was someone else, they would’ve died thousands of times.</p><br/><p>Xie Xi’s words made him cheer up and he seemed to be okay, but just standing required strong support.</p><br/><p>The man with the colourful tail feathers saw this and quickly said, “The sage needs to rest. We will go first!”</p><br/><p>Vermilion Bird nodded. “I worried all of you.”</p><br/><p>The group of birds cried out, “The sage is safe, it is a great blessing for the bird family!”</p><br/><p>The birds left and only Vermilion Bird and Xie Xi were left in the huge temple.</p><br/><p>Xie Xi helped Vermilion Bird back to bed. He lay down and the eyes stared at him without blinking. “I always afraid that I’m dreaming…”</p><br/><p>He hadn’t finished these words when the different coloured eyes emerged.</p><br/><p>Xie Xi was so angry that he pulled away his hand.</p><br/><p>Jiang Xie unexpectedly didn’t try to hold him and spoke weakly, “This Vermilion Bird can really perform. He is actually half dead.”</p><br/><p>Xie Xi felt a strange heartache and returned his hand. “What the hell is going on?”</p><br/><p>Jiang Xie rubbed his soft hand and coughed. “You should hurry to Azure Dragon.”</p><br/><p>Xie Xi had a terrible thought in his heart…</p><br/><p>Azure Dragon and Vermilion Bird were together and Jiang Xie shared their memories. Thus, he knew what Azure Dragon was thinking.</p><br/><p>Jiang Xie explained, “Before Azure Dragon met you, his cultivation contained no desire. In order to be with you, he broke his core and devoured his body. However, he didn’t mind since you won’t have a long life, even with the name of the flower god. He only wanted to live with you.”</p><br/><p>Xie Xi’s heart was tense. “This… everything…” What the hell was this setup?</p><br/><p>Jiang Xie replied quietly, “There is no other way. I love you so much that I am a desperate man.”</p><br/><p>He was still in the mood to speak like this! Xie Xi couldn’t be angry. “What is Azure Dragon’s situation now?”</p><br/><p>“He will be able to survive if you quickly coax him.”</p><br/><p>It was that serious! Xie Xi asked anxiously, “If the soul dies, you…”</p><br/><p>“Objectively speaking, the souls and I exist at the same time. If one disappears, I will cease to exist.”</p><br/><p>It was worse than Xie Xi thought but it was also logical. Existence was existence, there was no separating it.</p><br/><p>Xie Xi couldn’t sit still. “I’ll go after him.”</p><br/><p>Jiang Xie nodded. However, Xie Xi wasn’t reassured. “What about Vermilion Bird?”</p><br/><p>Jiang Xie replied, “There is no one here and I will stay awake for a short time. It will be fine.”</p><br/><p>Now it was Jiang Xie, not Vermilion Bird present. As long as no one came, the problem wasn’t big.</p><br/><p>Xie Xi didn’t dare delay the time. Jiang Xie pulled him over and handed him something. “This is a stealth charm so the other birds won’t see you.”</p><br/><p>It was a good thing. If the other birds discovered he left, they would enter the palace to check Vermilion Bird’s condition.</p><br/><p>Xie Xi used the stealth charm and immediately left.</p><br/><p>At this moment, he was personally aware of what it meant by solving one problem only for another to crop up!</p><br/>\n</div>"}