{"title": "Chapter 169 - Collapsed God 3", "id": 169, "volume": 2, "url": "http://boxnovel.org/game-loading-chapter-169-collapsed-god-3", "volume_title": "Volume 2", "body": "<h1>Chapter 169 - Collapsed God 3</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Collapsed God 3</p><br/><p>Jiang Xie removed his gaze, his mind repeating, ‘Don’t be bewitched, don’t be bewitched, don’t be…’</p><br/><p>Xie Xi added, “If you kill me then you won’t be able to leave here. I am dead and the United States will soon gain another president. What about you?” The rebels would be a mess without a leader.</p><br/><p>Jiang Xie turned his head and stared at this person. “I am just a nobody. If I die then I die.”</p><br/><p>“You are so good. How are you a nobody? Then your organization really isn’t easy.”</p><br/><p>The previous sentence was warm but the last sentence had a steep drop in tone, causing a stinging chill. Was this a carrot and a whip? Jiang Xie sneered. A rational person was so good at grasping people’s hearts?</p><br/><p>He suddenly got close to Xie Xi and whispered almost in his ear, “You are hiding your real gender.”</p><br/><p>Xie Xi jerked and the tip of his ears was a bit red. After all, there was no way. The two people had done so many close actions and there was a bit of a ‘stressed’ reaction.</p><br/><p>Jiang Xie saw it and was… stunned.</p><br/><p>Xie Xi whispered, “Is it necessary for me to hide my gender?”</p><br/><p>Jiang Xie’s throat was dry. “If you are emotional then how can you become the president of the United States?”</p><br/><p>“The United States has never been discriminatory about gender. Don’t misinterpret the political meaning.”</p><br/><p>Jiang Xie’s thin lips pursed but he couldn’t stand such a close distance. He loosened his hand and moved a bit further away. “Why aren’t you killing me?”</p><br/><p>Xie Xi replied, “You are still a minor.”</p><br/><p>“You have killed minors before!”</p><br/><p>“The situation was uncontrollable and there were priority decisions.”</p><br/><p>Jiang Xie sneered. “It seems you have determined that I won’t kill you.”</p><br/><p>Xie Xi smiled brightly. “I knew you were a smart child.”</p><br/><p>Jiang Xie grasped his wrist. Xie Xi was as calm as ever, as if they were drinking afternoon tea instead of discussing life and death. There was certainty, calmness and confidence. It was impossible for Jiang Xie to beat him.</p><br/><p>A sense of humiliation sprang up and Jiang Xie released him, declaring coldly, “I will tear off your hypocritical face sooner or later.” He would let the world know how such a delicate face was cold and ruthless!</p><br/><p>Xie Xi was troubled. It seemed his coaxing had become twisted. Sure enough, a teenager thought too much? Poor Xie Xi had little experience with children and it was hard for him to understand this teenager.</p><br/><p>He could only say, “I sincerely hope you put away your prejudices against me.”</p><br/><p>Jiang Xie sneered, thinking this person was even more hypocritical. A rational person could have such a personality, it was really unthinkable!</p><br/><p>The conversation wasn’t pleasant but Xie Xi managed to steady Little Jiang Xie and let him agree to get along with each other.</p><br/><p>It was also unknown what Big Jiang’s mood was like. He dreamt of spending all his life with this child and now that the child was sent to his door, he used all types of excuses to push him away. He really didn’t have a brain.</p><br/><p>Xie Xi left first and told Secretary Li his decision. Secretary Li was shocked. “How can this be done? How can he stay with you? Mr. President, your safety is the most important thing!”</p><br/><p>Xie Xi wondered, “Do you have a better way?”</p><br/><p>Secretary Li, “…”</p><br/><p>“The e981 rebels are extremely tenacious. If we can take this opportunity to recruit them, we can save more energy.”</p><br/><p>Secretary Li heard these words and unexpectedly showed a sad demeanour, choking out, “Mr. President, you are so dedicated to the people. One day, they will fully realize it.”</p><br/><p>Xie Xi keenly captured this special situation. What was this? Were there any difficulties in the United States or did he make a sacrifice?</p><br/><p>Secretary Li cheered up. “We will always support the president. I believe that under your light, the United States will usher in a radiant glow!”</p><br/><p>Xie Xi didn’t ask too much and only nodded calmly.</p><br/><p>He had thought of many excuses but they didn’t need to be used at all. It was unknown what Secretary Li’s brain had made up but he started to sing Xie Xi’s praises.</p><br/><p>Well, who cared if he could save trouble?</p><br/><p>He said this but Xie Xi’s identity was a very busy person. After leaving the prison, there was a lot of government affairs to deal with.</p><br/><p>Xie Xi wasn’t nervous about this. After strengthening his qualifications, his memory and judgment were greatly enhanced. He was incomparable to ordinary humans.</p><br/><p>He just took this opportunity to learn more about the situation. He didn’t know if it was his illusion but after connecting with this world’s light brain, he felt that his mind was several times faster than usual.</p><br/><p>After strengthening, he was comparable to the top computer on Earth. Now he was even faster?</p><br/><p>Xie Xi thought it was a bit strange but told himself he was still in the adaptation stage. He probably wasn’t used to it.</p><br/><p>As he was dealing with government affairs, Jiang Xie was also in his office. Of course, there were special people to look after him.</p><br/><p>Xie Xi didn’t dare do it himself. He wasn’t afraid of being hurt but was afraid that Jiang Xie would run away.</p><br/><p>It was too hard to catch this person. It would be a loss if Jiang Xie slipped away before Xie Xi figured out the situation.</p><br/><p>Xie Xi was so busy that he missed lunch and direction worked into the afternoon.</p><br/><p>He basically figured out the situation and was a bit worried. This world wasn’t simple and as the president, he was struggling on a cliff.</p><br/><p>He cut off his connection with the light brain and saw Young Master Jiang fiddling with a shadow on his leg. He was so busy while this guy was idle. Unfortunately, he couldn’t bring Jiang Xie over to help.</p><br/><p>Xie Xi got up and walked to him. “Sorry, I took a little long.”</p><br/><p>Jiang Xie didn’t raise his head. “Don’t care about me.”</p><br/><p>How did such a thorny person grow into that Old Jiang? Xie Xi was curious! He reached out and was about to touch Jiang Xie. Jiang Xie tensed but Xie Xi grabbed the shadow.</p><br/><p>This thing was a small toy, a bit like the Rubik’s Cube in Xie Xi’s world. However, it was a hundred times more complex than the hardest Rubik’s Cube and required a certain amount of effort. A person with weak hands couldn’t beat this thing.</p><br/><p>Xie Xi had just ended his link with the light brain and his head was currently in the fastest thinking mood. He had been through the battlefield and had strong physical fitness. After taking the shadow, he only gently bounced it and it emitted a colourful light. This only happened when the shadow was restored.</p><br/><p>Jiang Xie was obviously startled but immediately scoffed. “A little trick.”</p><br/><p>Xie Xi’s lips curved. “It is really what children like.” Then he threw the shadow back at Jiang Xie.</p><br/><p>Jiang Xie was angry. “I’m not too young!”</p><br/><p>Xie Xi glanced at him. “How old are you?”</p><br/><p>Jiang Xie shut up immediately.</p><br/><p>Xie Xi smiled and flicked his forehead. “Child, go to dinner.”</p><br/><p>Jiang Xie, “…”</p><br/><p>He saw the speechless Little Jiang and there was no need to mention how happy Xie Xi was.</p><br/><p>He was fond of this heavenly reincarnation. Who would expect this detour? Xiao Xie unexpectedly could call Old Jiang a ‘child’ one day.</p><br/><p>Dinner wasn’t rich. It was dry food that made people have no appetite.</p><br/><p>This was a weakness of this era. The longer people lived and the more vast the exploration, the lower the requirements for food, clothing, housing and transportation became.</p><br/><p>In particular, the situation of food was finally separated from survival. A large number of anorexia genes were selected from the gene pool and then propagated.</p><br/><p>People were no longer reliant on food and the food of food was reduced accordingly. There weren’t many considerations about the deliciousness of food.</p><br/><p>Xie Xi found it was boring to eat but he didn’t cook. He asked Jiang Xie, “Is it tasty?”</p><br/><p>“It is terrible.”</p><br/><p>Xie Xi glanced at him. “That’s rude.”</p><br/><p>Jiang Xie, “…”</p><br/><p>He didn’t overdo it and sped up the meditation of his ‘Clear Heart Mantra.’</p><br/><p>Xie Xi decided to look for a chance to cook on his own. He wasn’t a ‘future’ person and there was still a demand for tasty food.</p><br/><p>After the meal, Xie Xi opened a remote meeting and dealt with some things until 10 o’clock in the evening.”</p><br/><p>Secretary Li told him, “Mr. President, if there is a situation then please call me.”</p><br/><p>Xie Xi waved his hand. “It’s fine.”</p><br/><p>Secretary Li was reassured by Xie Xi’s fighting power and replied, “Okay.”</p><br/><p>He turned off the screen and asked Jiang Xie, “Do you like to sleep on the left or the right?”</p><br/><p>Jiang Xie’s eyes widened. “What?”</p><br/><p>Xie Xi repeated, “Do you like to sleep on the left or the right?” In fact, Xie Xi knew that this person preferred the left side.</p><br/><p>Jiang Xie’s eyebrows twisted. “I can sleep on the sofa.”</p><br/><p>Xie Xi smiled. “You agreed to eat and live together.”</p><br/><p>Jiang Xie still had principles. “I won’t go to your bed!”</p><br/><p>Xie Xi really wanted to record this and after going back, play it for 24 hours a day for 360 days.</p><br/><p>“Don’t speak such ambiguous words.” Xie Xi told him. “We are just sleeping together.”</p><br/><p>“No need, I won’t leave.”</p><br/><p>Xie Xi suddenly wondered, “What are you so nervous about?”</p><br/><p>Jiang Xie, “…”</p><br/><p>Sure enough, he had to use the most radical method to deal with this body. Xie Xi sat on the bed and smiled. “We are both rational and not emotional. So what if we sleep on the bed?”</p><br/><p>“Unless…” He deliberately said, “Are you interested in me?”</p><br/><p>Jiang Xie stood up. “I’m not like you, a false rational.”</p><br/><p>Xie Xi once again wanted to record this. “Then what are you afraid of?”</p><br/><p>“I’m not.”</p><br/><p>Xie Xi patted the side of the bed. “Come and sleep.”</p><br/><p>Jiang Xie, “…” His heart beat wildly.</p><br/><p>Finally, the teenager’s self-esteem was defeated and he got on the bed. It was just that Xie Xi reached out his hand.</p><br/><p>Jiang Xie’s voice was tense. “What are you doing?”</p><br/><p>Xie Xi took his hand. “This way I can feel at ease.” Then he closed his eyes.</p><br/><p>Jiang Xie knew the meaning of these words. This person wanted to hold his hand so that if Jiang Xie moved, the man would immediately detect it and respond accordingly.</p><br/><p>Still, he couldn’t help having the words echo in his head.</p><br/><p>This way I can feel at ease… It was as if this person would only feel at ease by holding hands with Jiang Xie. Xie Xi was just afraid that he would run!</p><br/><p>Jiang Xie lay stiffly for a full two hours. The person next to him breathed evenly while sleeping but he couldn’t sleep at all.</p><br/><p>Just as he thought he was going to stay awake until dawn, drowsiness struck him and Jiang Xie fell asleep.</p><br/><p>Xie Xi was awakened by a kiss. He pushed away the man on top of his body in an annoyed manner. “Let people sleep.”</p><br/><p>The man’s clear teenage voice contained a laugh. “It is a kindness to eat and sleep with Mr. President.”</p><br/><p>The playful voice made Xie Xi instantly awaken. He opened his eyes and sat up. “What the hell is going?”</p><br/><p>There was no doubt that this was Jiang Xie. There was still the appearance of the teenager but the eyes had changed.</p><br/><p>Jiang Xie unexpectedly didn’t take advantage of the situation and quickly said, “I don’t have much time. I can only say that my task is to act. I am completely immersed in the act and need your cooperation…”</p><br/><p>Then Jiang Xie closed his eyes and fell down. Xie Xi was speechless. This was the legendary scam? What act? It was very messy!</p><br/><p>At this time, the sky was brightening. Xie Xi didn’t have much time to think. He went to the bathroom first and when he came back, the other person had woken up.</p><br/><p>There was some confusion in Jiang Xie’s indigo eyes but it was as if nothing had happened.</p><br/><p>Xie Xi wasn’t used to the high-tech products here. He tried for a long time but the effect of the hair dryer seemed to be 50%? Thus, his hair was still wet. He grabbed it as he looked at Jiang Xie. “Good morning.”</p><br/><p>Jiang Xie turned his head and saw the man loosely dressed in the morning dark. His black hair was wet and somewhat messy. White fingers moved through the hair and the sharp contrast caused palpitations.</p><br/><p>He only wore a bathrobe and the waist was loosely fastened. This was completely different from his strict rational appearance in the daytime.</p><br/><p>Jiang Xie’s throat was moving when he saw the kiss mark on this person’s neck.</p><br/>\n</div>"}