{"title": "Chapter 178 - Collapsed God 12", "id": 178, "volume": 2, "url": "http://boxnovel.org/game-loading-chapter-178-collapsed-god-12", "volume_title": "Volume 2", "body": "<h1>Chapter 178 - Collapsed God 12</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Collapsed God 12</p><br/><p>In this second, the slag president really thought a lot.</p><br/><p>For example, was Jiang Xie trying to worm something out? Was he digging a hole for Xie Xi to jump into and test if he had a partner.</p><br/><p>Or perhaps Jiang Xie knew about Little Jiang and just like Old Li, he thought Xie Xi was raising a ‘child bride.’</p><br/><p>Or… or…</p><br/><p>Whether it was the heart and soul or a needle under the sea, he couldn’t guess at all!</p><br/><p>Xie Xi didn’t say anything and Jiang Xie spoke again, “It isn’t convenient for you if I live in the presidential palace.”</p><br/><p>Xie Xi hurriedly opened his mouth. “No.”</p><br/><p>Silly Xie Xi! He wanted to say this wasn’t true. Why did he say ‘no’?</p><br/><p>No one? Did it mean that Jiang Xie wasn’t an inconvenience? Wasn’t this admitting to his previous question?</p><br/><p>Xie Xi had a sense of experiencing retribution. Sure enough, he had been a slag for so long that his mouth had its own conscience.</p><br/><p>Once this word mistakenly came out, Jiang Xie frowned and his attitude wasn’t as calm as before.</p><br/><p>“If it is just a bed partner, can you break up?” His voice was very strict like he was declaring a decree. However, the contents gave it a different flavour, especially when combined with the following words. “…If it is just solving physical needs then I can help you.”</p><br/><p>Xie Xi finally took control of his mouth and said, “No.” OH, this was the answer last time. Saying it here… well…</p><br/><p>Jiang Xie looked down at himself in a deprecating manner. “Yes, young people are better.”</p><br/><p>Xie Xi, “!!!”</p><br/><p>It wasn’t like that! He wasn’t such a rascal!</p><br/><p>Xie Xi’s confused head was restored because of his shock and he grabbed the key point. “I don’t have a partner!”</p><br/><p>Jiang Xie’s demeanour wasn’t soothed. “This is a normal thing. You don’t have to hide it.”</p><br/><p>Xie Xi stated firmly, “I’m not hiding it. I really don’t have a partner.”</p><br/><p>Jiang Xie smiled. “Your life assistant has always been earrings. What is with that bracelet?”</p><br/><p>Xie Xi, “…” He was a bit confused about the high-tech matters but should he translate it to mean there were clothing of different sizes and styles in the closet?</p><br/><p>Jiang Xie added, “Even if it is a spare, you wouldn’t use a bracelet. The president’s light brain link only supports earrings.”</p><br/><p>It was just like how Jiang Xie had a black earring on his left ear.</p><br/><p>Xie Xi’s brain translated it: The president’s uniform is set and you can’t casually wear t-shirts or jeans to work.</p><br/><p>Jiang Xie continued, “There are two bathroom records. You never take a cold shower and you don’t like shiso toothpaste. The temperature of the hair dryer won’t be lower than 30 degrees and you don’t need the self-drying function. The constant temperature on the left and right sides of the bed is different…”</p><br/><p>They lived together and it was understandable… but what were these details?</p><br/><p>How was he a former president? This was Sherlock Holmes!</p><br/><p>Jiang Holmes kept speaking. “Based on the style and size of the clothes stored in the bracelet, as well as his eating habits and tastes, it can be inferred that he is a young man under the age of 20…”</p><br/><p>Xie Xi was afraid. Fortunately, he didn’t cheat in life or he would be caught by this guy!</p><br/><p>“It is true that someone was living in the presidential palace previously but he isn’t my partner.” Xie Xi quickly threw out.</p><br/><p>Jiang Xie’s expression was unchanged. “If he isn’t a partner, why did you sleep in the same bed?”</p><br/><p>Xie Xi was dumbfounded for a moment but fortunately, he had a legitimate reason and he spoke the truth. “It is like this…”</p><br/><p>The leader of the e981 rebels was also familiar to Jiang Xie.</p><br/><p>He didn’t have much entanglement with them during his time in office, After all, he was an immortal cockroach.</p><br/><p>Xie Xi talked about how the rebels were caught, how they suspected this person was X and how they couldn’t imprison him because he was a minor. They also wanted to take the opportunity to capture a powerful force to help with the universe collapsing…</p><br/><p>Xie Xi spoke the truth and didn’t tell any lies, but he still had a guilty conscience.</p><br/><p>This was probably… the instincts of a slag. A guilty conscience was the norm, regardless of whether it was true or false.</p><br/><p>Jiang Xie listened quietly and then frowned. “He is X?”</p><br/><p>“It is highly likely. He also has a rare SSS-grade physique.”</p><br/><p>Jiang Xie wondered, “You sent him to the pole?” Jiang Xie had long known that someone was sent to carry out the task but he didn’t know who.</p><br/><p>Xie Xi nodded. “There was no way to reach you and I can’t leave the capital. We could only let him go.”</p><br/><p>Jiang Xie paused and stared at him. “Nothing really happened between you?”</p><br/><p>Xie Xi didn’t know if he should laugh or cry. “Really. He is only 15 or 16 and is a half-child. What can I do?”</p><br/><p>Well, this half-child gave him many strawberries.</p><br/><p>“It is possible for a 15 or 16 year old.” Jiang Xie spoke quietly. “You climbed into my bed at that time.”</p><br/><p>Xie Xi’s face was shocked. What the hell!</p><br/><p>Jiang Xie smiled again. “Of course, I didn’t do anything to you.” Then he gently scratched the tip of his nose.</p><br/><p>The sound of his low voice was particularly nice and Xie Xi’s ears trembled and his waist became numb.</p><br/><p>Xie Xi stood firmly and tried not to be led by this person. “Since separating from you, I have never slept with anyone. I haven’t been with anyone else.”</p><br/><p>This was the truth and Xie Xi spoke confidently!</p><br/><p>Jiang Xie was startled before nodding. “The work of a president is truly busy.” A rational person was satisfied with work.</p><br/><p>Xie Xi was about to explain when main Jiang Xie’s words emerged in his head. He had to let them believe in his gender.</p><br/><p>A rational person who didn’t love work wasn’t qualified to be rational. Xie Xi couldn’t refute Jiang Xie’s sentences.</p><br/><p>In any case… he didn’t mess around and loved working. Wasn’t this better than flirting?</p><br/><p>Jiang Xie relaxed and he asked Xie Xi, “I really don’t have to move out?”</p><br/><p>Xie Xi nodded solemnly. “No!”</p><br/><p>Jiang Xie’s lips curved. “You really need my help?”</p><br/><p>His gaze moved downwards and Xie Xi understood, crying out, “Work is important!” He was very rational.</p><br/><p>The next day, Little Jiang came back. The starship landed and the Third Institute’s president was ecstatic after receiving the data. “Perfect! Perfect!”</p><br/><p>A rational didn’t understand love but other emotions weren’t bad. The cabinet immediately held a meeting while Xie Xi quickly glanced at Little Jiang.</p><br/><p>The teenage Jiang Xie was staring at him greedily with an undisguised, fiery look.</p><br/><p>This month had been spent sleeping and having countless dreams, all of which were about Xie Xi. The even more wonderful thing was that when flying back to the Capital Stare, he suddenly entered a pure white space with Xie Xi.</p><br/><p>Xie Xi was there but he was very different from the president. He seemed to be frightened as he shrunk into Jiang Xie’s arms. Jiang Xie couldn’t remember what Xie Xi said in the dream. He just felt that his chest was very sweet and the heat warmed his entire soul.</p><br/><p>Once he woke up, he had only one thought in his heart, ‘Protect this person and guard him. Give him everything.’</p><br/><p>Little Jiang had always looked down on emotional people. He felt they were suffering from invisible discrimination in this society and were being treated as pets by the rationals. Thus, Jiang Xie hid his gender, pretended to be rational and even became the leader of the rebel army.</p><br/><p>Jiang Xie always felt that he wasn’t emotional. He was more rational than an actual rational person. Until now…</p><br/><p>After one month of these thoughts, he saw Xie Xi and his heart jumped and he couldn’t look away. Everything clearly told him that he was an emotional, a thorough emotional.</p><br/><p>The emotional people had a saying: The stupidest thing an emotional person can do is fall in love with a rational person.</p><br/><p>There was another saying: The even stupider thing is an emotional disguising as a rational.</p><br/><p>This was tantamount to a moth throwing themselves at the flames to kill themselves.</p><br/><p>However, if a moth didn’t throw itself into the flames, how would it know that this warm and bright light filled with infinite beauty would burn it?</p><br/><p>Little Jiang’s task was completed exceptionally well. The cabinet gave him unceremonious praise and even hoped to give him a position he deserved.</p><br/><p>Xie Xi looked at the teenager and spoke warmly, “Don’t be anxious. He is still young.”</p><br/><p>Jiang Xie’s gaze moved back towards the burning flame. Xie Xi received it and had no doubt that this boy would kiss him if no one else was present.</p><br/><p>Cough… Xie Xi’s head was full of thoughts about what to do after returning to the presidential palace.</p><br/><p>The collision of Big Jiang and Little Jiang, he was afraid this universe would collapse early!</p><br/><p>Xie Xi tried to concentrate as he listened to the data that the Third Institute’s president reported from the pole.</p><br/><p>“I’ll need a few days to calculate it. If there are no accidents, the pole will be the only sanctuary of the universe!”</p><br/><p>The meeting ended and Xie Xi and Jiang sat in the aircraft.</p><br/><p>Jiang Xie’s head was full of the words before his departure but Xie Xi didn’t mention it and he didn’t ask.</p><br/><p>‘Why are you so good to me?’</p><br/><p>Xie Xi said he would answer when Jiang Xie came back. He was back.</p><br/><p>Xie Xi praised, “You have done a very good job on this mission.”</p><br/><p>“It wasn’t difficult.”</p><br/><p>“However, it is very important.”</p><br/><p>Jiang Xie’s thin lips moved before he changed his words. “Can I move out?”</p><br/><p>Xie Xi was stunned. Why did the two of them want to move out? He might wish for them to move out but he wasn’t at ease when they weren’t under his eyes.</p><br/><p>Jiang Xie continued, “I used to live in the presidential palace for supervision. Now you shouldn’t be worried about me anymore.”</p><br/><p>He completed such an important task. Regardless of Jiang Xie’s identity, he was now the hero of the entire United States!</p><br/><p>Xie Xi considered it. It seemed possible? The two people would be temporarily separated until the institute got results. Then maybe Xie Xi could repair the broken god. If he completed the task then he didn’t need to worry!</p><br/><p>Xie Xi felt he was thinking too beautifully. Since being with Jiang Xie, he was full of doubts about his luck in this area.</p><br/><p>“Why do you want to move out?” Xie Xi asked.</p><br/><p>Little Jiang replied, “There is no reasonable identity and it is strange to live in the presidential palace.”</p><br/><p>Xie Xi, “…” This person wasn’t very old but his ability to dig a pit wasn’t small. This was telling Xie Xi to give him an identity!</p><br/><p>Xie Xi didn’t mind giving him the status of ‘child bride’ but he was afraid it wasn’t possible!</p><br/><p>He thought about it before stating, “You are still young. I don’t feel at ease when you live outside.”</p><br/><p>This was also a wordplay. Jiang Xie was still young and an identity couldn’t be given.</p><br/><p>Jiang Xie declared, “I can take care of myself.”</p><br/><p>Xie Xi imagined the scene of Little Jiang and Big Jiang living under the same roof and said, “Also…”</p><br/><p>He hadn’t finished his words when Big Jiang’s voice was heard. “You’re not back yet?”</p><br/><p>The low and mature voice of a man filled the aircraft.</p><br/><p>Xie Xi, “…”</p><br/><p>Even worse, the aircraft stopped and they arrived at the presidential palace. The teenage Jiang Xie stared at Xie Xi with cold eyes. “Who is he?”</p><br/><p>He is you!</p><br/><p>This was the feeling of being caught in bed!</p><br/><p>Xie Xi calmly answered, “A friend.”</p><br/><p>LIttle Jiang made a sound. “Oh.”</p><br/><p>The monosyllabic word almost froze the entire aircraft. The aircraft door opened and Xie Xi didn’t dare say anything else about the matter. He could only act hard-headed. “We are here.”</p><br/><p>“Yes.”</p><br/><p>It turned out that these single syllables could be so terrible! Xie Xi had a tough choice between ‘get off and die’ or ‘stay on and die.’</p><br/><p>Then Big Jiang appeared, a gentle smile on the mature man’s face. “The data of the pole was sent back? This is good news.”</p><br/><p>Xie Xi rushed to the door of the aircraft, blocking the sight of the two sides in a final struggle. Unfortunately, the aircraft door was so big that the lone president couldn’t stop it.</p><br/><p>Xie Xi faced Big Jiang and saw this person’s gaze pass over him, while at the same time, Xie Xi felt a low pressure coming from behind him.</p><br/><p>The teenager’s voice was as cold as a knife. “Who are you?”</p><br/><p>Jiang Xie’s lips thinned and he looked calm. “Who are you?”</p><br/><p>Xie Xi, “…”</p><br/>\n</div>"}