{"title": "Chapter 197 - A Good Man at Home", "id": 197, "volume": 2, "url": "http://boxnovel.org/game-loading-chapter-197-a-good-man-at-home", "volume_title": "Volume 2", "body": "<h1>Chapter 197 - A Good Man at Home</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>A Good Man at Home</strong></p><br/><p>Xie Xi’s senses didn’t return for a long time.</p><br/><p>He seemed to still be in the United States, organizing the ‘immigration’ activities of all citizens and keeping an eye on the progress…</p><br/><p>His tight nerves loosened and there was inevitably some sadness.</p><br/><p>This world had touched him and he had the feeling of touching something that couldn’t be completely seen but would inspire people’s thirst for knowledge. He wanted to explore, to study and to get the final answer.</p><br/><p>Xie Xi sighed and found himself standing in the Hall. He froze as he felt that something wasn’t quite right.</p><br/><p>He habitually went to the water curtain and took a look at his task rewards. After all, it was his first repair task and he was very curious about the completion and rewards.</p><br/><p>There was an orange-yellow line in the quasi-world column of the system panel.</p><br/><p>[Congratulations on repairing the S-grade quasi-world Collapsed God. The repair is 100% complete and the repair level is SS.]</p><br/><p>This message conveyed a lot of information and Xie Xi carefully read it.</p><br/><p>The quasi-world Collapsed God had an S-grade rating. This wasn’t surprising since there were three souls, which was similar to Love to the Left or Right.</p><br/><p>Of course, the integrity of the whole world was much higher than Love to the Left or Right. However, Love to the Left or Right was a novice trial and the so-called S-grade wasn’t up to the standards.</p><br/><p>The repair completion rate of 100% made Xie Xi feel very pleased. At least he didn’t do anything half-baked.</p><br/><p>The repair level of SS, Xie Xi didn’t quite understand. What did this mean? Was it his task difficulty level?</p><br/><p>After all, he entered this quasi-world and there wasn’t a clearance mission. Then the task level wasn’t linked to the quasi-world but the repair level?</p><br/><p>Then how was this repair level assessed?</p><br/><p>In fact, Xie Xi felt that this world was still very easy. He was in a high position and his actions were very convenient. He was never in danger and Big, Medium and Little Jiang didn’t do anything, instead completing the task together…</p><br/><p>This was SS level? It wasn’t easy to assess the standard. Xie Xi was bewildered by the authorities. Forget the fact that he was the only Repairer, it was infinitely dangerous to be in the world alone.</p><br/><p>If he didn’t have the identity of the Repairer and if the souls weren’t like that to him, it was estimated that he wouldn’t know about the collapse of the universe and would look for the collapsed god in the United States. Then the universe would be destroyed and blow him up. In order to fix it, he had to be buried inside it.</p><br/><p>Xie Xi went to see the task rewards and there was a clatter as gold coins landed. Xie Xi counted the 0s and was surprised. “Six zeros?”</p><br/><p>Well… he somehow felt a bit pleased. It was such an easy task yet he got so much money…</p><br/><p>Xie Xi cleared his throat and felt he was thinking too much. He might not be short of money but who would hate money?</p><br/><p>Xie Xi was going to check the special rewards when he suddenly found that his experience value had reached 50%!</p><br/><p>He had just been promoted to the intermediate level and this experience bar was empty. Now it was halfway filled? Was the repair task so powerful? He could be promoted to the advanced level with two tasks?</p><br/><p>Compared to gold coins, Xie Xi preferred the experience value. He couldn’t help smiling as he went to see the special rewards.</p><br/><p>There were special rewards for S-grade and above tasks. Xie Xi’s rewards so far were good so he looked curiously…</p><br/><p>Item: Sketch Pen.</p><br/><p>Grade: Purple (Lifetime Binding).</p><br/><p>Item Description: With this pen, you are the greatest sketcher. Go to the roadside and put up a booth to draw portraits. You will surely get gold!</p><br/><p>Xie Xi was stunned. This special reward wasn’t that great. A sketch pen that allowed people to draw was really useless to players in Central. What was the use of drawing? It was better to get a purple weapon?</p><br/><p>Yet this pen fell into Xie Xi’s hands and he had a powerful item to match it, the god’s wisdom. Previously, Xie Xi was too bad at drawing and the things he drew were twisted and not recognized. Now with this pen, couldn’t he easily use the god’s wisdom?</p><br/><p>Xie Xi felt like he was suffocating because he couldn’t take the god’s wisdom out in the Hall.</p><br/><p>There were too many people here. If he drew something and it appeared in the air, it would be too eye-catching. It wasn’t good to expose this so-called wealth and it was better to be cautious.</p><br/><p>Xie Xi went to his skills column to see what he took from the world.</p><br/><p>His passive skill was to randomly take away one thing from the world but every time, the things he brought out were very scary.</p><br/><p>Xie Xi was mentally prepared but once he saw what he actually brought out…</p><br/><p>!!!!!!!</p><br/><p>10,000 exclamation points couldn’t describe Xie Xi’s mood at this moment. He immediately sent a message to Jiang Xie with shaking hands. My god, how did he bring this back?</p><br/><p>His hand was shaking so much that he couldn’t write a message for a long time. Then Xie Xi remembered he had authority to the garden and went straight to Jiang Xie.</p><br/><p>As he clicked into the garden, he finally realized the strange feeling he got after leaving the quasi-world.</p><br/><p>Why wasn’t he in the garden after leaving the quasi-world? Why did he show up in the Hall despite being bound to the garden? Previously, Xie Xi was used to landing in the hall so he didn’t think about it. Now…</p><br/><p>It must’ve been Jiang Xie who deliberately refused to let him into the garden. This guy…</p><br/><p>Xie Xi felt anxious and hurriedly entered the garden. Fortunately, Jiang Xie didn’t dare shut off his access.</p><br/><p>Xie Xi had a faint guess but his hands and feet were cold when he actually saw it.</p><br/><p>The breezy garden in the past had no more wind. Instead, there was a bone-chilling cold that made people’s teeth tremble.</p><br/><p>Xie Xi saw the large number of withered roses that had lost their beautiful colours and lay on the ground with no life. This was Jiang Xie’s spiritual garden and reflected his state.</p><br/><p>Xie Xi trembled as he screamed, “Jiang Xie!” He called out the name with all his heart.</p><br/><p>“It’s fine…” Jiang Xie’s weak voice was heard from the pavilion. Xie Xi quickly ran over and saw the man sitting in the chair. The black clothes on his body were completely wet and it was only when looking closely that he realized it was blood.</p><br/><p>Xie Xi’s heart buzzed and his heart hurt. “Is it because of that white space?”</p><br/><p>Jiang Xie smiled. “You must not cry. The pain of my body is nothing. I am most afraid of your distress.”</p><br/><p>Xie Xi cried, his heart feeling like hot magma. Xie Xi was pained and angry at this person who didn’t cherish himself. “Didn’t you say that you were okay?!” He actually believed this!</p><br/><p>How could something that clearly violated the rules of the quasi-world be allowed to be used?</p><br/><p>Jiang Xie told him, “I’m fine, it just looks scary. Wait for God Yan to use his healing techniques.</p><br/><p>Xie Xi anxiously asked, “Where is God Yan?” Unfortunately, his Repair was unable to repair this type of injury.</p><br/><p>He said God Yan and God Yan would arrive.</p><br/><p>The moment he entered the garden, he saw this person’s miserable appearance and snarled, “Old Jiang, do you fucking have a grudge against yourself? Do you want to die? I don’t think I need to heal you but there is Little Rose. If you are dead, he will be widowed…”</p><br/><p>God Yan’s mouth was fierce but he walked quickly to the pavilion. Then he was stunned when he saw the Little Rose who would be widowed.</p><br/><p>He didn’t expect Xie Xi to be here.</p><br/><p>Xie Xi was concerned and didn’t notice God Yan’s collapse or the name ‘Little Rose.’ He didn’t even notice the mention of being a ‘widow.’ He only heard God Yan’s lecture.</p><br/><p>“No, God Yan.” Xie Xi carefully explained. “There was a moment when I was mentally in danger and he opened a white space to wake me up. I was wrong and it wasn’t his fault. Please make sure…”</p><br/><p>He hadn’t finished when the pained Jiang Xie laughed. “Xiao Xie, cough, he is joking.”</p><br/><p>Xie Xi froze.</p><br/><p>Yan Zhe, “………”</p><br/><p>Fuck, he really didn’t want to heal this guy! How could such a good child be eaten by this old animal?”</p><br/><p>“Don’t worry.” Yan Zhe was afraid of Xie Xi’s worry and told him, “The injury isn’t serious. It just looks frightening.”</p><br/><p>He didn’t waste much time and used the divine healing.</p><br/><p>Xie Xi watched with his heart in his throat, not daring to open his mouth to disturb the healing. Yet he was also afraid that Jiang Xie was in pain and wanted to help distract him.</p><br/><p>Jiang Xie saw this and felt sweet. If he wasn’t unable to move, he really wanted to take Xie Xi into his arms and kiss this person. His strong friend would only show such a fragile and lovely appearance to him.</p><br/><p>Yan Zhe felt like he really was a fucking dog.</p><br/><p>He didn’t get paid a doctor’s fee and he also ate dog food. It was so much dog food that he didn’t have to eat for three days and three nights!</p><br/><p>In fact, Jiang Xie’s injury was very heavy. If it was someone else, they would’ve probably be dead by now.</p><br/><p>Jiang Xie’s skin was thick and his unlucky experiences over the years made him accustomed to all types of serious injuries. 60~70% of Yan Zhe’s superb healing was due to helping this guy!</p><br/><p>Around 30 minutes later, the wounds were all healed and Jiang Xie had returned to his original state.</p><br/><p>Xie Xi was relieved and sincerely told Yan Zhe, “Thank you!”</p><br/><p>Yan Zhe didn’t often hear people thanking him. The dogs in his group treated his healing as routine and they also judged his ‘milk’ volume.</p><br/><p>“Cough…” Yan Zhe replied, “You don’t have to be polite with me. I don’t know how many times I would’ve died if it wasn’t for him so healing him is paying off my debts.”</p><br/><p>Jiang Xie spoke lazily, “That can’t be. Xiao Xie, you have to thank God Yan. He was terrified all day that you would accidentally become a widow.”</p><br/><p>Yan Zhe, “…” This old beast!</p><br/><p>Xie Xi was startled and finally remembered what Yan Zhe said when he entered.</p><br/><p>Yan Zhe’s thick-skin couldn’t endure it and he cleared his throat. “If there is nothing then I’ll leave.” Once he finished speaking, he ran.</p><br/><p>Xie Xi glared at Jiang Xie. “That’s rude.” He knew that Jiang Xie deliberately sent Yan Zhe away.</p><br/><p>Jiang Xie pulled Xie Xi over. “Who told him to be a lightbulb…”</p><br/><p>Xie Xi stopped his hand and said, “Your body has just recovered. Don’t mess around.”</p><br/><p>Jiang Xie wasn’t inclined to listen.</p><br/><p>Xie Xi seriously told him, “IF you don’t cherish yourself, I will never take you to the next world.”</p><br/><p>Jiang Xie, “…” He was well-behaved.</p><br/><p>Xie Xi got up and grabbed a small kettle to take care of the withered roses. Jiang Xie told him, “Don’t worry about them…”</p><br/><p>‘Don’t move, rest there.”</p><br/><p>Jiang.henpecked.Xie could only sit there and heal. He watched the small flowers growing and spoke in the group chat, “Don’t call me to the training field anymore. I quit.”</p><br/><p>Everyone, “????”</p><br/><p>What was this situation? Old Jiang changed and didn’t want to fight and kill? Who would believe it?</p><br/><p>Old Qin was an honest person and he knew Yan Zhe went to treat Jiang Xie. Thus, he asked, “Are your injuries very serious?”</p><br/><p>He spoke so seriously that the others were a bit worried. Nan Yi also wondered, “What is the situation? Didn’t you go with your wife? Can you be seriously injured in an S-grade world?”</p><br/><p>Jiang Xie poked at him. “My injuries are fine but I have to cherish myself later. If I go to the training field and get injured, my family will be distressed.”</p><br/><p>The group of male gods, “……”</p><br/><p>Jiang Xie recovered from his bad mood. “A man needs to have a family to be stable.”</p><br/><p>Then everyone found that the group name was changed from ‘Lonely Male God Online Chat ‘to ‘Good Man at Home.’</p><br/><p>There was half a second of silence before the group exploded.</p><br/><p>“Old Jiang, do you have any shame!!!!”</p><br/><p>Jiang Xie’s mood was good as he watched his wife.</p><br/><p>At this moment, Xie Xi remembered something. “By the way, I brought back something quite terrible.”</p><br/><p>Jiang Xie asked, “What is it?” The souls had returned and he knew everything.</p><br/><p>Xie Xi replied, “I brought back the hard drive…”</p><br/>\n</div>"}