{"title": "Chapter 215 - Collapsing 11 Boundaries 3", "id": 215, "volume": 3, "url": "http://boxnovel.org/game-loading-chapter-215-collapsing-11-boundaries-3", "volume_title": "Volume 3", "body": "<h1>Chapter 215 - Collapsing 11 Boundaries 3</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Collapsing 11 Boundaries 3</p><hr/><br/><p>Outside the memories, Xie Xi’s frowned. It was obvious that this Miss Jiang was the younger brother.</p><br/><p>A 17 year old with a double degree would really paint gold on his face. Why did such a genius fall to the point of wearing women’s clothing?</p><br/><p>In addition, did Jiang Xie have a sister? He never heard Jiang Xie mention it but even if he did have a sister, it would be the past.</p><br/><p>Xie Xi was startled and couldn’t help wondering about Jiang Xie’s past. Wasn’t this a broken world that had been blended with others by the Central Government? Maybe… the past and the collapsing worlds were combined?</p><br/><p>It didn’t matter. Xie Xi remembered the hint that was given when he entered the world. He didn’t believe in it because it was true. It was true because he believed in it.</p><br/><p>Whether it was the past or not, Jiang Xie was real.</p><br/><p>This memory was clearly their first encounter.</p><br/><p>Xie Xi looked 26 years year and wore a suit in an elegant style. Jiang Xie was only 17 and wasn’t fully grown. Through the magic of the dress and makeup, he was barely able to play a female.</p><br/><p>Still, it was estimated that Xie Xi had already seen through it.</p><br/><p>By the end of the party, Xie Xi had drunk too much. His face was covered with a thin red colour and his eyes were moist. A few hairs fell on his face, adding a touch of beauty to his delicate facial features.</p><br/><p>‘Miss Jiang’ was far away from him but his gaze couldn’t help drifting over to Xie Xi.</p><br/><p>It was love at first sight. Whether this was reality or a dream, it always happened 100%.</p><br/><p>Coincidentally, Xie Xi’s car got a flat tire as he was leaving. His driver and assistant were busy calling people to pick him up. The cold wind blew towards Xie Xi and his brow lightly wrinkled.</p><br/><p>Then a black car parked in front of him and the rear window slid down. Miss Jiang looked at him and asked with a hand pressed against her throat. “Do you need help?”</p><br/><p>Xie Xi stopped frowning and showed a warm smile. “No, someone will come in a while to pick me up.”</p><br/><p>‘Miss Jiang’ said, “It is half an hour from the city…”</p><br/><p>Xie Xi replied, “It’s fine. I can go to the lounge and wait.”</p><br/><p>Miss Jiang was like a fish that took the initiative to bite the hook. “If you don’t mind, I will send you back?”</p><br/><p>Xie Xi smiled. “It is too much trouble for you.”</p><br/><p>“It is on the way.”</p><br/><p>“Okay, thank you.”</p><br/><p>Xie Xi saw these memories and didn’t know what to say.</p><br/><p>The memories weren’t his own but he clearly deliberately approached Jiang Xie, deliberately showed a good appearance, deliberately pretended to be drunk and even ruined his tyre…</p><br/><p>This was to get close to Jiang Xie. Jiang Xie in women’s clothing was easy to deceive and catching him on the hook was almost effortless.</p><br/><p>Xie Xi got on the car and Jiang Xie didn’t speak much. After all, his throat hadn’t recovered yet and it took a lot of effort to speak those few words.</p><br/><p>Xie Xi was very gentlemanly. His attitude and speech were generous and measured just right, making people feel a spring breeze.</p><br/><p>The tense Jiang Xie obviously relaxed. He didn’t dare to answer with words but he was happy based on his demeanour.</p><br/><p>Half an hour later, the car parked in a villa area. Xie Xi got off the car and thanked this person. “I really troubled Miss Jiang tonight.</p><br/><p>Jiang Xie smiled and suppressed his voice. “It’s nothing.”</p><br/><p>A youthful tone was still very different from a woman’s voice. Jiang Xie might cover it up with an illness but speaking more would expose it.</p><br/><p>Xie Xi smiled again and said goodbye in a warm voice.</p><br/><p>He left and Jiang Xie stared at his back for a while until the driver asked, “Young Master, are we going back?”</p><br/><p>Jiang Xie no longer covered up his voice and restored his original low tone. “Yes.”</p><br/><p>He leaned back and gently closed his eyes. It was Jiang Xie’s memory so Xie Xi could see what Jiang Xie was thinking. His head was full of the talking and smiling Xie Xi, the drunk Xie Xi with red cheeks, the warm and gentle voice…</p><br/><p>Xie Xi was speechless. “Can’t you be a bit more grown up?”</p><br/><p>He said this but there was some sweetness in his heart. He was always loved by his lover at first sight. It was natural to have sugar in his heart.</p><br/><p>The angle of view was fixed on Jiang Xie.</p><br/><p>Jiang Xie returned home, took off his clothes and jewellery in a tired manner, removed the makeup on his face and restored the handsome appearance of a young man.</p><br/><p>Xie Xi was curious about the situation on Jiang Xie’s side. Why did he dress up as a woman?</p><br/><p>His perspective followed Jiang Xie and he soon saw the truth. Jiang Xie went to the south room on the third floor and knocked on the door.</p><br/><p>A gentle female voice was heard from inside. “Little Jiang? Come in.”</p><br/><p>Jiang Xie pushed open the door and Xie Xi saw the pale woman sleeping on the bed. She had the same facial features as Jiang Xie but was more feminine and soft.</p><br/><p>Jiang Xie asked, “How are you feeling today?”</p><br/><p>Originally, Jiang Xie’s sister was indeed sick and she replied weakly, “I’m much better.”</p><br/><p>Slight distress flashed across Jiang Xie’s face as he said, “There was nothing tonight. You can sleep well and I will help you attend tomorrow’s meeting.”</p><br/><p>Sister Jiang sat up. “it is hard on you.”</p><br/><p>“It’s nothing. You’ve been working hard all these years.”</p><br/><p>Sister Jiang wanted to say something but it seemed to touch the nerves in her chest, causing a serious of earth-shattering coughs.</p><br/><p>Jiang Xie hurriedly told her, “I will go and call Dr. Li.”</p><br/><p>Sister Jiang grabbed him with a skinny hand. “No…”</p><br/><p>Jiang Xie frowned tightly. “Sister, don’t worry about the company and go abroad to recuperate.”</p><br/><p>Sister Jiang’s shook her head. “No, Lance’s project is at a critical junction and must be completed.”</p><br/><p>Jiang Xie’s lips thinned slightly.</p><br/><p>Sister Jiang lightly gasped. “As long as we get this project, Sister will rest with peace of mind and hand over the rest to you.”</p><br/><p>Jiang Xie could only help her lie down and carefully covered her tightly with a quilt.</p><br/><p>Xie Xi had a general understanding of Jiang Xie’s situation.</p><br/><p>Jiang Xie’s parents died early and his sister, Jiang Hong propped up the family company, becoming a solid and strong woman.</p><br/><p>Jiang Xie didn’t disappoint his sister and had always been excellent. By the age of 17, he had achievements that ordinary people couldn’t match.</p><br/><p>Now Jiang Hong had a problem with her body and her life was in danger.</p><br/><p>The Jiang Company had worked hard to gain a foothold and it was reaching the next level. If Jiang Hong’s illness was exposed then a storm would occur.</p><br/><p>As a last resort, the similar looking brother and sister came up with such a move.</p><br/><p>Jiang Xie took on his sister’s appearance while Jiang Hong worked at home, trying to get the project she had worked on for more than a year.</p><br/><p>As long as the project was stabilized, there would be no major problems in the next five or six years. After five or six years, Jiang Xie would be enough to support this industry.</p><br/><p>In fact, Jiang Xie wanted his sister to let go of these things and safely recuperate.</p><br/><p>However, Jiang Hong had a strong personality and he was afraid that making her give up would only aggravate her illness. Therefore, Jiang Xie had to cooperate with her to complete this project as soon as possible to make her more comfortable.</p><br/><p>The secret of the brother and sister was quite stable. They were really similar, Jiang Hong was tall enough and Jiang Xie’s attention to detail meant he could perfectly dress like her. Secondly, there were confidants who knew the secrets of the siblings. They were more afraid of the company being ruined than the siblings and helped to maintain them in a comprehensive manner.</p><br/><p>There was only one variable and that was Xie Xi. Jiang Xie didn’t tell Jiang Hong about Xie Xi because there wasn’t anything worth mentioning. He only gave this person a ride home.</p><br/><p>The next memories had no important information and Xie Xi skipped until they met for the second time.</p><br/><p>It was another party and it looked like a charity party. Jiang Xie was still wearing a long-sleeved evening gown with a collar and gloves of the same colour, so that it covered his Adam’s apple and fingers.</p><br/><p>He took advantage of how he grew up well and looked good. However, it was difficult to cover up the voice. A young man of 17 was out of the awkward growing stage and it was difficult to make a woman’s soft voice.</p><br/><p>Fortunately, there was the excuse of his voice discomfort.</p><br/><p>At the party, a middle-aged man was talking with Jiang Xie. He seemed interested in cooperating on a project.</p><br/><p>Jiang Xie had been dressed as his sister for a while and his practical experience and vigilance were present. He wasn’t fooled but it wasn’t convenient to speak, making him annoyed.</p><br/><p>At this time, Xie Xi gave him an excuse, “Chief Jiang’s voice is still recovering and she can’t speak loudly. Why don’t you go to an interview at the company tomorrow?”</p><br/><p>The middle-aged man was stunned after seeing Xie Xi and smiled. “Hey, I was just talking about things.”</p><br/><p>Xie Xi smiled but it didn’t reach his eyes.</p><br/><p>The middle-aged man left and Jiang Xie whispered, “Thank you.”</p><br/><p>“What is there to thank? I am thankful for you sending me home last time.”</p><br/><p>In front of outsiders, it was Chief Jiang while it was Miss Jiang in private. This name was still polite but gave off a different feeling.</p><br/><p>Jiang Xie replied, “It was nothing.”</p><br/><p>Xie Xi seemed to think it was slightly noisy and leaned forward slightly. “Why hasn’t your voice recovered after so long. There is a doctor I am familiar with and I can ask him to examine it again.”</p><br/><p>Jiang Xie’s back was tense and his eyes flashed a bit as he lowered his voice. “I just need to speak less and it will slowly recover.’</p><br/><p>Xie Xi sighed. “It is no wonder. Miss Jiang has to speak all the time at meetings and you can’t speak less.”</p><br/><p>Jiang Xie smiled uncomfortably.</p><br/><p>Xie Xi added, “There is no way at the company but you should try to talk less when going out.”</p><br/><p>Jiang Xie nodded.</p><br/><p>Xie Xi no longer said anything but spent all night intentionally protecting him.</p><br/><p>Rationally, Xie Xi didn’t need to do anything and someone else would guide this person. Yet Xie Xi gently and thoughtfully helped and how could Miss Jiang endure it? He lost his soul in minutes.</p><br/><p>Xie Xi could basically guess the development afterwards.</p><br/><p>At another private party, Xie Xi drank too much and happened to have an encounter with Miss Jiang by the pool.</p><br/><p>Xie Xi greeted this person with a smile. The joy in Jiang Xie’s eyes couldn’t be concealed.</p><br/><p>Xie Xi held a cigarette in his hand and he saw Jiang Xie’s slight frown. He quickly put out the cigarette and said, “I’m sorry.”</p><br/><p>Jiang Xie told him, “It’s fine.”</p><br/><p>Xie Xi threw the cigarette into the trash can and swayed as he came over. Jiang Xie was startled. “Be careful.”</p><br/><p>Unfortunately, Xie Xi still accidentally fell into the pool. It was a deep water area and he didn’t seem able to swim. He moved further and further away from the edge.</p><br/><p>It was reasonable to say that at this time, Jiang Xie could pull Xie Xi back with the rescue pole next to him or shout and a professional would come over.</p><br/><p>However, Jiang Xie saw Xie Xi’s panicked experience and didn’t think as he jumped down. He held Xie Xi and said, “Don’t be afraid. I will take you back to the edge.”</p><br/><p>Xie Xi originally planned this and didn’t make a fuss. He let Jiang Xie drag him back.</p><br/><p>The two of them emerged from the water. Xie Xi had swallowed a few mouthfuls of water and his coughing was very fierce.</p><br/><p>Jiang Xie patted him on the back and asked, “Are you okay?”</p><br/><p>“I-It’s fine…” He looked at this person. “Miss Jiang, I made a fool of myself…”</p><br/><p>As he spoke, he looked up at Jiang Xie.</p><br/><p>Jiang Xie’s face was anxious and he didn’t know that his clothes had been torn open at the neck.</p><br/><p>Xie Xi stared at this person’s neck in a stunned manner. Jiang Xie felt strange and reached out, only to find that the tight collar had been ripped loose and slid down.</p><br/><p>The ‘gobsmacked’ Xie Xi. “Miss Jiang, you…”</p><br/><p>Jiang Xie knew it couldn’t be hidden anymore and his impression of Xie Xi was very good. Thus, he smiled wryly and said, “Sorry, I have been deceiving you. In fact, I am Jiang Xie.”</p><br/><p>He didn’t lower his voice and completely exposed himself in front of Xie Xi.</p><br/><p>Xie Xi pretended to be shocked and asked, “What is going on?”</p><br/><p>Jiang Xie didn’t explain it and only extended his hand. “Let’s go and change clothes first. The weather is cold and Mr. XIe drank wine. You are soaked and it is easy to get sick.”</p><br/><p>Xie Xi still seemed to be in chaos. He took Jiang Xie’s hand and as he got up, he slipped again.</p><br/><p>Jiang Xie wasn’t paying attention and was pulled hard against this person.</p><br/>\n</div>"}