{"title": "Chapter 218 - Collapsing 11 Boundaries 6", "id": 218, "volume": 3, "url": "http://boxnovel.org/game-loading-chapter-218-collapsing-11-boundaries-6", "volume_title": "Volume 3", "body": "<h1>Chapter 218 - Collapsing 11 Boundaries 6</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Collapsing 11 Boundaries 6</strong></p><br/><p>At noon, Jiang Xie went out early. Jiang Hong was in a particularly good mood and her face was full of blood as she said, “Don’t play too late. There is a party at night.” She thought Jiang Xie was going to meet friends of the same age and didn’t think too much.</p><br/><p>In the evening, many celebrities would be invited and it wasn’t a private birthday party for Jiang Xie. It was more like the Jiang family’s announcement to the outside world that there was a new successor.</p><br/><p>Therefore, Jiang Hong would’ve forced him to stay home at night. She just ordered him not to drink lest he be affected at night.</p><br/><p>Jiang Xie hadn’t left but his heart had already flown first. He said, “I won’t drink.” However, he wouldn’t come back too early.</p><br/><p>Jiang Hong smiled. “Go ahead.”</p><br/><p>Today wasn’t only Jiang Xie’s birthday. It was also the final day for the Lance project.</p><br/><p>The bidding materials had been handed in. If there were no accidents, the Jiang family had a high chance of winning the bid.</p><br/><p>As long as it was accepted, all his efforts wouldn’t be in vain. The project would allow the Jiang family to rise to the next level and Jiang Hong could safely recuperate her body.</p><br/><p>Jiang Xie wasn’t very worried. He had been concentrating on this matter for the past six months and knew more about it than Jiang Hong.</p><br/><p>There were no problems. His sister’s wish could be reached. Then he would take her job and let her rest.</p><br/><p>He was flushed with success. Jiang Xie’s work was progressing smoothly, his older sister was looking better and at noon, he would celebrate his birthday with the person he liked. He walked in a relaxed and happy manner, full of expectations.</p><br/><p>The place to eat was set by Xie Xi. Jiang Xie walked out of the elevator and sat the man sitting by the window in the elegant Western restaurant.</p><br/><p>The restaurant was booked and there was no one else. However, even if it was full of people, Jiang Xie would see this person at first glance.</p><br/><p>Xie Xi was born with a spotlight that shone in front of Jiang Xie, dominating all his attention.</p><br/><p>Xie Xi got up after becoming aware of Jiang Xie’s presence and smiled. “Happy birthday.”</p><br/><p>Jiang Xie also smiled, an undisguised strong love on his young and handsome face. “Thank you.”</p><br/><p>Xie Xi spoke softly. “Why are you being so polite?”</p><br/><p>The soft and intimate tone sweetened Jiang Xie’s heart. He sat down and Xie Xi took out a box. “I know you aren’t lacking anything but I still wanted to give you a gift.”</p><br/><p>Jiang Xie opened it and saw the watch lying inside. It was a Vacheron Constantin Metiers d’Art series and cost more than two million yuan.</p><br/><p>This sounded exaggerated but in fact, Jiang Xie had collected more expensive gifts. He just liked this watch because Xie Xi sent it to him.</p><br/><p>Jiang Xie carefully put away the box. “I like it.”</p><br/><p>Xie Xi told him, “It’s good that you like it. I don’t understand your people’s taste.”</p><br/><p>Jiang Xie frowned lightly. “You are only in your 20s.”</p><br/><p>Xie Xi laughed. “Then are you only in your teens?”</p><br/><p>Jiang Xie paused before saying, “Don’t care about age. You are currently in your best time.”</p><br/><p>Xie Xi sighed. “What is so good about it? I will be in the afterlife while you are photographed on the beach.”</p><br/><p>Even so, the corners of his mouth were raised and he seemed to be in a good mood.</p><br/><p>Jiang Xie didn’t dwell on this topic. If he could, he would’ve liked to be born 11 years early so he didn’t miss a single moment of this person’s life.</p><br/><p>The meal arrived and the two people chatted well.</p><br/><p>Over the past year, they had become very familiar with each other. Jiang Xie liked this person and cared about what this person liked and didn’t like, his little habits and even his small quirks. Jiang Xie remembered it all clearly.</p><br/><p>Xie Xi was the same. He ordered dishes that Jiang Xie loved to eat.</p><br/><p>Dessert ended and Xie Xi said, “I know you don’t like cake but it is better to have a cake for your birthday.”</p><br/><p>The waiter brought out a fancy cake with 18 candles on it.</p><br/><p>Xie Xi said, “I will sing you a birthday song. Make a wish.”</p><br/><p>Jiang Xie was stunned. “You will sing for me?”</p><br/><p>“I can’t sing anything else but this should be no problem.”</p><br/><p>That wasn’t the question. It was just that Xie Xi had such an identity and temperament, yet he would unexpectedly sing Jiang Xie a birthday song…</p><br/><p>Xie Xi sang the song. His voice was warm and it was a simple song, but it was a hundred times sweeter than the cake in front of them.</p><br/><p>Jiang Xie closed his eyes and made a wish. He wished for his sister to recover and to be with Xie Xi.</p><br/><p>Perhaps he was too greedy. Could these little candles really carry his heavy wish? Even so, he sincerely hoped that the two people he deeply loved would be safe and peaceful.</p><br/><p>Jiang Xie really didn’t like cakes but he ate a while piece. After he ate it, he lowered his head and asked, “Why are you so good to me?”</p><br/><p>This tone was calm and his expression normal. It was as if the two people were just chatting and there was nothing special about the question. Even so, the contents were highly suggestive.</p><br/><p>Xie Xi held the fork in his hand and whispered, “Why do you think?”</p><br/><p>Jiang Xie’s heart thumped.</p><br/><p>Xie Xi looked up and smiled. “There might be an age difference but you are the person I have hit it off with the most in my life.”</p><br/><p>Jiang Xie’s heart beat faster and he couldn’t even refute the age difference.</p><br/><p>“Well…” Xie Xi got up. “It isn’t too early and you have to go back and prepare for the party tonight.”</p><br/><p>Jiang Xie stood up and called out to him. “Xie Xi.”</p><br/><p>Xie Xi turned around. “Hmm?”</p><br/><p>“I…” The words that Jiang Xie were about to speak were stuck in his mouth.</p><br/><p>Xie Xi told him, “Let’s go. Today you have become an adult.”</p><br/><p>The words calmed Jiang Xie. Yes, he wasn’t yet an adult. There was no guarantee that a brat’s confession would be accepted. He had to keep calm and spend time keeping this person by his side.</p><br/><p>Jiang Xie didn’t say anything and just held the other person’s hand tightly. Xie Xi was shocked. Jiang Xie’s palms were slightly sweaty but he didn’t release his grip as no one spoke.</p><br/><p>Xie Xi smiled but incredibly didn’t say anything. He just let Jiang Xie link their 10 fingers.</p><br/><p>Xie Xi saw the memories up to here and felt bad. Sure enough, Jiang Xie was cruel to himself.</p><br/><p>He parted with Xie Xi and returned home to meet his sister.</p><br/><p>Jiang Hong was happy. Today, her younger brother was an adult and could shoulder the company’s affairs.</p><br/><p>The Lance project was stable and her physical condition was better recently. The doctor stated that as long as she paid attention, she would still have 10 or 20 years left. Medical technology would definitely have new breakthroughs and perhaps the currently incurable disease could be treated at that time.</p><br/><p>Her mood was good. Jiang Hong saw Jiang Xie return and greeted him happily. “You are early.”</p><br/><p>Jiang Xie was worried. “How did you come downstairs? Be careful not to catch a cold.”</p><br/><p>Jiang Hong told him, “It’s okay. I’m in an excellent state today!” She was going to participate in tonight’s party. This was a new beginning for the siblings, a new beginning for the Jiang family!</p><br/><p>Jiang Xie was still worried about her body. “It is still early and the party hasn’t started yet. Why are you in a hurry?”</p><br/><p>Jiang Hong smiled. “I have to clean up.”</p><br/><p>Jiang Xie knew that his sister loved beauty and no longer advised her. He just stared carefully, afraid that her body would be uncomfortable.</p><br/><p>At four in the afternoon, the siblings packed up and prepared to go out.</p><br/><p>Just then, a call arrived. Jiang Hong saw the number and smiled. “It must be the result of the bidding.”</p><br/><p>Jiang Xie grinned. He knew that his sister was looking forward to this and definitely wanted to know the news first.</p><br/><p>Jiang Hong answered the phone. She had only spoken a few words when Jiang Hong’s face underwent a big change. Her exquisite makeup couldn’t cover up the grey defeat on her face.</p><br/><p>Jiang Hong’s heart sank. He picked up his phone, questions buzzing in his brain.</p><br/><p>The bid was lost. It was lost to Chengyu. This was the group Xie Xi was the master of.</p><br/><p>The Jiang family worked hard for a long time and invested a huge sum of money in this project, only to unexpectedly get such a message.</p><br/><p>In the end, Jiang Hong wasn’t an ordinary person and her psychological quality was extremely high. “What happened? How can Chengyu participate in this project?”</p><br/><p>The assistant’s voice trembled. “All the indicators they gave were 10% lower than ours and all the partners we previously contacted joined with them…”</p><br/><p>Jiang Hong was cold all over. “How could Xie Xi…”</p><br/><p>She jerked her head to look at Jiang Xie. “Have you been in contact with him?”</p><br/><p>Jiang Xie didn’t answer but his expression showed everything. Jiang Xie’s chaos was much larger than Jiang Hong. He lost more than just this project. It was… even more…</p><br/><p>“Impossible.” Jiang Xie knew the answer but he still didn’t believe it. “Xie Xi couldn’t…”</p><br/><p>“You…” Jiang Hong cried out, “You were tricked!”</p><br/><p>How could she not understand? Xie Xi could only get such information if someone inside the Jiang Company leaked it.</p><br/><p>She couldn’t imagine that Xie Xi had actually got his hands into her brother.</p><br/><p>Jiang Xie was only 17 and just turned 18. How could he be the opponent of that old fox?</p><br/><p>She was careless!</p><br/><p>The painstaking effort of a long time was stolen like this. Jiang Hong felt severe pain in her chest and after serious coughing, blood spilled from the corners of her mouth.</p><br/><p>Jiang Xie’s eyes narrowed. “Sister!”</p><br/><p>Jiang Hong fainted. Jiang Xie leaned over his pale sister, looking like he had been hit again.</p><br/><p>Xie Xi looked on from outside the memory and couldn’t help taking a breath.</p><br/><p>Too painful…</p><br/><p>He knew that it was someone’s brain supplement but he still felt pained. He had to take slow breaths before he could continue watching.</p><br/><p>The birthday party was ruined. Jiang Xie accompanied his sister overnight. Jiang Hong barely escaped from danger and on this night, Jiang Xie understood everything.</p><br/><p>From the beginning, Xie Xi deliberately approached him. All their casual encounters and coincidences were made by him. Including the photo…</p><br/><p>There was no doubt that Xie Xi had someone shoot it and then sent it out. The funny thing was that he was also the cause behind the photo being withdrawn!</p><br/><p>One ring after another, Xie Xi easily played Jiang Xie.</p><br/><p>Jiang Xie thought of his heart, thought of his own wishes and thought of his planning for the future…</p><br/><p>Darkness filled his eyes. It was all fake, all hypocrisy, all a deception. The man’s actions contained no affection at all. It was just a dirty means of chasing his own interests.</p><br/><p>The year they spent together played frame by frame like a movie in Jiang Xie’s mind. Finally, he settled on Xie Xi’s smile at noon.</p><br/><p>It was a particularly beautiful face and when he smiled, he seemed to gather thousands of clouds. It was so beautiful that people couldn’t open their eyes.</p><br/><p>Now Jiang Xie finally saw the cold depths in his eyes. A sharp tingling spread from his chest cavity to his brain. Jiang Xie pressed a hand against his temple.</p><br/><p>Jiang Hong woke up. She lay weakly in bed and touched him with cold and feeble hands.</p><br/><p>Jiang Xie’s heart was mourning as he spoke hoarsely, “I’m sorry.”</p><br/><p>Everything was over and it was too late to say anything. Jiang Hong told him weakly, “Forget it. Our skills aren’t as good as some people.”</p><br/><p>No… Jiang Xie rose, his young face no longer immature and naive. His dark eyes were full of surging hate. ‘It isn’t over. Everything that belongs to me, I will certainly get back.’</p><br/>\n</div>"}