{"title": "Chapter 217 - Collapsing 11 Boundaries 5", "id": 217, "volume": 3, "url": "http://boxnovel.org/game-loading-chapter-217-collapsing-11-boundaries-5", "volume_title": "Volume 3", "body": "<h1>Chapter 217 - Collapsing 11 Boundaries 5</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Collapsing 11 Boundaries 5</p><br/><p>Jiang Xie’s senses returned and there was some tension in his eyes. Fortunately, Xie Xi didn’t wake up. He just changed directions and continued sleeping.</p><br/><p>Jiang Xie struggled to calm his heartbeat. Once it completely calmed down, he whispered, “Mr. Xie.”</p><br/><p>Xie Xi slept soundly.</p><br/><p>Jiang Xie’s voice became slightly hoarser as he called out, “Xie Xi.”</p><br/><p>He didn’t know why but just calling this person’s name filled him with an inexplicable trembling that started from his back to the tip of his hair.</p><br/><p>The wonderful thing was that Xie Xi opened his eyes. Jiang Xie’s heart hardened.</p><br/><p>Xie Xi’s eyes were blurry. Once he saw Jiang Xie, he spoke with some chagrin. “Oh, look at me. I only drank that much and actually fell asleep.”</p><br/><p>Jiang Xie steadied himself with effort. “You are too tired.”</p><br/><p>Xie Xi pinched his brow. “I’ve been very busy recently.”</p><br/><p>Jiang Xie’s heart moved. “If you are busy, why did you come out to watch the game?”</p><br/><p>Xie Xi laughed. “After socializing for a week, I have to find a way to reward myself.”</p><br/><p>It was a reward to watch the ball game with Jiang Xie? He wasn’t a social engagement but a way to relax?</p><br/><p>These casual words were more exciting than any sweet talk. This was the defenseless Jiang Xie. How could his heart not be warm?</p><br/><p>Xie Xi untied the seat belt and got out of the car. “It is late. I’ll have someone send you back.”</p><br/><p>Jiang Xie also got off the car, trying to let his eyes always remain on this person. “Okay.”</p><br/><p>On the way back, the corners of Jiang Xie’s mouth couldn’t be suppressed. He thought about the kiss just now and his heart was soft.</p><br/><p>An unimaginable beauty. In addition, this beauty was only the tip of the iceberg.</p><br/><p>Jiang Xie closed his eyes and couldn’t escape. He liked Xie Xi. Not as a friend but in a love-related way that went against secular ethics.</p><br/><p>He was calm after coming to this conclusion. He wanted to be with Xie Xi and wanted to have this person.</p><br/><p>Xie Xi watched this memory of the firm and loving teenage Jiang Xie and couldn’t help playing it again.</p><br/><p>Sure enough, no matter how young and naive, this man was like this. Once he recognized the goal, he would go all out. He wasn’t timid but was confident and determined.</p><br/><p>After watching it three times, Xie Xi shook his head and laughed. He still thought that Jiang Xie was too silly.</p><br/><p>In the memories, the two people had more frequent contact. In the past, Jiang Xie was very resistant to a variety of entertainment since he would have to wear women’s clothing. Now he was looking forward to it.</p><br/><p>He didn’t know if Xie Xi would go but he couldn’t hide his happiness if they met.</p><br/><p>Xie Xi also protected him everywhere, trying to let him talk less and not become too tangled up with someone else. He was very diligent as the ‘flower protector.’</p><br/><p>Occasionally, they would sneak out to talk on the balcony. They chatted for a while in this empty place, in the night where they couldn’t see the stars.</p><br/><p>Xie Xi didn’t make any moves but he never refused Jiang Xie’s invitation. They talked happily every time, feeling a moment of ease and comfort in this hypocritical entertainment.</p><br/><p>Nearly one month later, Jiang Xie raised the courage to invite Xie Xi. He didn’t send a message because he felt it wasn’t formal enough. Therefore, he made a phone call.</p><br/><p>Xie Xi accepted the call after a while. He lowered his voice and wondered, “Xiao Xie?”</p><br/><p>Jiang Xie vaguely heard voices on the other end of the line. “Is it inconvenient right now?”</p><br/><p>Xie Xi gradually moved away from the other voices and his own volume increased. “I’m in a meeting. There has been no result for an hour.”</p><br/><p>Jiang Xie felt chagrin. “I disturbed your work.”</p><br/><p>“No.” Xie Xi’s tone was relaxed. “I’ve heard enough.”</p><br/><p>Jiang Xie’s lips slightly curved and his heart was filled with sweetness. “Then do you want to go out for some air?”</p><br/><p>“Okay, eat together at noon? I will arrange the place.”</p><br/><p>“No,” Jiang Xie refused. “I have booked a table. You can come over directly.”</p><br/><p>He really wanted to pick up Xie Xi but this was too eye-catching.</p><br/><p>Xie Xi requested, “Where is the reservation? I will go now.”</p><br/><p>Jiang Xie laughed. “It is only 10 in the morning. Wait another hour.”</p><br/><p>Xie Xi also laughed. “Look at me being this anxious. It must be because you think too little of me.”</p><br/><p>Jiang Xie’s heart jumped wildly and his throat was dry. “I will take note of Mr. Xie’s words and regularly meet you in the future.”</p><br/><p>Xie Xi’s voice through the microphone seemed to carry an electric current. “That would be good.”</p><br/><p>This routine was too deep…</p><br/><p>Xie Xi watched the memories and thought, ‘I don’t have this ability. Jiang Xie’s script writing ability is really excellent!’</p><br/><p>Then Xie Xi recalled what happened in Dream Come True and found that he really had been caught a bit easily. The good thing was that Mr Jiang in Dream Come True wasn’t a slag. He was just a little beast.</p><br/><p>In contrast, the collapsed world was full of malice.</p><br/><p>It couldn’t be helped. In the face of being abandoned, the souls were forced to think in bad ways.</p><br/><p>In the normal quasi-worlds, the tasks might be too pitted and Xie Xi had to pedal N number of boats but the souls always did their best to find reasons for Xie Xi. They strove to cast him as a pure-hearted octopus with difficulties. There was no way, he stepped on so many boats because he had too many feet.</p><br/><p>It wasn’t the same in the collapsed world. The previous summary was basically that he was a pure slag…</p><br/><p>It was up to Xie Xi to turn the tide. Repairer Xie Xi had to carefully repair it!</p><br/><p>Xie Xi buried a time bomb and waited for when it almost detonated.</p><br/><p>A photo of Xie Xi and ‘Miss Jiang’ holding hands was sent online.</p><br/><p>The headline was shocking: The Chengyu Group and Jiang family’s upcoming marriage? Chengyu’s Xie Xi and Jiang Hong are secretly engaged.</p><br/><p>Jiang Xie’s pupils shrank the moment he saw the photo.</p><br/><p>It was by the pool after Xie Xi fell into the pool and Jiang Xie rescued him. Thanks to the fall, it was inconvenient for Xie Xi to walk and they held hands as support.</p><br/><p>This photo was taken very cleverly. The dim lighting made it impossible to see that the two people were wet. It only showed the intimate posture of the two people holding hands.</p><br/><p>This was too much like a couple in love.</p><br/><p>If Jiang Xie was really Jiang Hong then he would only be happy to see such news.</p><br/><p>However, he wasn’t. Xie Xi was the person he liked and Jiang Hong was his sister. He didn’t want anyone to misunderstand their relationship.</p><br/><p>He was thinking about how to suppress this news. He had just refreshed the page when it was deleted.</p><br/><p>Jiang Xie searched for relevant information but the previous page was like an illusion. It didn’t exist at all.</p><br/><p>At this time, Jiang Xie’s phone rang. He just had to listen to the ringtone to know it was Xie Xi. Jiang Xie picked up the phone. “Hello.”</p><br/><p>Xie Xi told him, “I was careless and didn’t expect to be photographed. Rest assured, I have arranged for people to suppress the news.”</p><br/><p>Jiang Xie was very grateful after hearing the words. “Thank you.”</p><br/><p>This type of gossip didn’t harm Xie Xi at all. It only damaged Jiang Xie’s side. After all, Jiang Xie wasn’t Jiang Hong. If this was revealed then it would be troublesome.</p><br/><p>Xie Xi said, “I didn’t think they would directly publish it. The withdrawal was fast but it is estimated that someone still saw it. Your sister…”</p><br/><p>“I’ll explain it to her clearly.”</p><br/><p>Xie Xi reassured him, “You can rest assured that I won’t let things get bigger.”</p><br/><p>Jiang Xie’s heart was hot.</p><br/><p>There was a slight pause before Xie Xi continued, “Just in case, we should avoid suspicion. I might not be able to get near you at parties anymore.”</p><br/><p>“I understand.”</p><br/><p>Xie Xi spoke again. “In private, we…”</p><br/><p>Jiang Xie was very sad but he knew the seriousness of the situation. “We will see each other less.”</p><br/><p>Xie Xi sighed. “We will still keep in touch.”</p><br/><p>Jiang Xie hung up and his heart was empty.</p><br/><p>He told himself that once he fully adapted to the company’s affairs, he could justifiably approach this person with his own identity.</p><br/><p>This matter was known to Jiang Hong. The news might’ve disappeared in a flash on the Internet but it was enough to cause a sensation. Jiang Hong directly called Jiang Xie to ask about the photo.</p><br/><p>Jiang Xie explained the drowning incident.</p><br/><p>Jiang Hong lay on the bed and coughed lightly. She was pale but her eyes were calm. “Xie Xi, this person is an extremely deep river. You should stay far away from him.”</p><br/><p>These words caused Jiang Xie to frown slightly.</p><br/><p>Jiang Hong could reach her current position because she was very good at observation. She instantly captured Jiang Xie’s emotion and asked, “Did he deliberately approach you?”</p><br/><p>“No, it was just an accident.”</p><br/><p>Jiang Hong gave him a deep look. “Xiao Xie, I will never interfere with your friends but Xie Xi is too completely. He isn’t someone the current you is capable of going against.”</p><br/><p>Jiang Xie didn’t say anything.</p><br/><p>Jiang Hong wondered again, “Are you sure he didn’t recognize you?”</p><br/><p>About the drowning incident, Jiang Xie only said that he used the rescue pole to save Xie Xi and didn’t say he jumped down.</p><br/><p>Jiang Xie replied, “No.”</p><br/><p>Jiang Hong smiled. “Good.” It seemed his tricks of seducing women were aimed at the wrong place.</p><br/><p>Jiang Xie frowned again.</p><br/><p>Jiang Hong looked up at him and told him, “Don’t look at his young age. When he was your age, he was more ruthless than anyone else in the financial circle.”</p><br/><p>Jiang Xie wanted to defend Xie Xi but he thought of his sister’s temper and said he was the one in the wrong.</p><br/><p>Jiang Hong patted Jiang Xie’s hand. “Remember, no matter what he does, don’t pay attention to him.”</p><br/><p>Jiang Xie nodded.</p><br/><p>Xie Xi saw this and thought, ‘Thank you for the support.’</p><br/><p>This was a flag and Jiang Xie was a veteran general used to carrying the flag on his back.</p><br/><p>The words of Jiang Xie’s sister were counterproductive. Xie Xi behaved too naturally and wasn’t deliberate at all. It was quite different from the man Jiang Hong spoke about.</p><br/><p>The 17 year old boy was too smart and always thought he had enough experience. He was also single-minded about Xie Xi. How could he listen to his sister’s advice?</p><br/><p>After that, Xie Xi’s performance perfectly represented the ‘deep river.’</p><br/><p>In order to avoid suspicion, he and Jiang Xie maintained a distance at the parties.</p><br/><p>This was a type of torture for Jiang Xie. He had been defended too well before and now when he tried to disguise himself, the contrast was great. He also wanted to speak to Xie Xi but couldn’t say a few words. It was hard to bear.</p><br/><p>His line of sight kept drifting towards Xie Xi’s body.</p><br/><p>The parties were full of shrewd people. The photo might be hidden from ordinary netizens but it couldn’t be hidden from these people.</p><br/><p>It might’ve been deleted from the Internet but the people kept it in mind.</p><br/><p>Before they didn’t feel it but now that they saw these two people deliberately avoiding each other while gazing at each other, how could they not know?</p><br/><p>This was the effect that Despicable Xie wanted. The whole layer was perfectly intertwined.</p><br/><p>The outside Xie Xi waited for the final event to erupt and for him to be revealed as not a person.</p><br/><p>Once the storm subsided, Jiang Xie’s stimulation was great.</p><br/><p>On the one hand, he became clearer about his mind. On the other hand, he was aware that he had to speed up the progress if he wanted to pursue Xie Xi. The sooner he took over the family business, the faster he could do what he wanted.</p><br/><p>Jiang Hong was relieved by his positive attitude.</p><br/><p>No matter how shrewd, Jiang Hong was sick and tired. She wasn’t comfortable placing it all on his younger brother but he was the only successor. She could only hand as much as possible over to him before her fall.</p><br/><p>This was all part of Xie Xi’s plan as he resumed his private meetings with Jiang Xie.</p><br/><p>In the past, the two people never talked about work. However, as they became more familiar with each other, Jiang Xie inevitably chatted about his work.</p><br/><p>This was Xie Xi’s strength. He only needed to speak a few words for Jiang Xie to benefit a lot.</p><br/><p>The teenager was strong-minded and the wisdom that Xie Xi showed made him feel even more admiration.</p><br/><p>At this time, Xie Xi gradually discovered the internal situation of the Jiang family through Jiang Xie, including the progress of the Lance project…</p><br/><p>Taurus’ birthday was on May 1st, which happened to be Labor Day.</p><br/><p>This was a national holiday and even Jiang Xie and Xie Xi were no exception. Of course, this didn’t mean they rested completely like normal employees. They were just more leisurely than usual.</p><br/><p>Jiang Xie had steadily taken over the company’s affairs and the person who attended several meetings in place of his older sister was more mature and stable.</p><br/><p>In just one year, Jiang Xie had grown and was already taller than Xie Xi.</p><br/><p>Today was his birthday and Jiang Xie would celebrate in the evening. However, Xie Xi agreed to meet him at noon.</p><br/><p>This was the sweetest day for the 18 year old Jiang Xie and also the day when he awakened from the dream.</p><br/>\n</div>"}