{"title": "Chapter 236 - Collapsing 10 Boundaries 12", "id": 236, "volume": 3, "url": "http://boxnovel.org/game-loading-chapter-236-collapsing-10-boundaries-12", "volume_title": "Volume 3", "body": "<h1>Chapter 236 - Collapsing 10 Boundaries 12</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Collapsing 10 Boundaries 12</strong></p><br/><p>In the Demon World, there was a grand celebration every 100 years.</p><br/><p>It was a good time for Xie Xi and Jiang Xie to come. They arrived just in time for this celebration.</p><br/><p>September 9th was known as the god’s birthday. The god here was naturally the Demon God.</p><br/><p>In order for Xie Xi to be a qualified demon, he carefully studied the history of the Demon World.</p><br/><p>In general, it was different from the angels and demons in the Bible that Xie Xi knew. They were basically Jiang Xie’s secondary creations.</p><br/><p>The ruler of Heaven and the Demon World were basically equal. In the early years, they fought a lot. Later, they discovered this didn’t help anyway and made peace with each other.</p><br/><p>Not fighting meant they developed. Ordinary angels and demons even married each other. It was very comfortable. Of course, the higher ranked angels and demons still feared and mutually restrained each other.</p><br/><p>This was also very good. Restraint meant competition and this caused the two worlds to develop further and more rapidly.</p><br/><p>The god on this side was the Demon God and this festival was to celebrate his birthday.</p><br/><p>Of course, it wasn’t the day when the Demon God was born. The so-called birthday was the day he created the Demon World.</p><br/><p>In any case, this festival was similar to New Year’s Eve. Not only was it a festival, it was also a holiday. Jiang Xie and Xie Xi got a whole half a month of leave.</p><br/><p>It was so long that they could return to Heaven. However, it was hard to catch the centennial celebration and it was a pity to leave. Thus, Jiang Xie stayed in the Demon World and wanted to spend the holiday with Xie Xi.</p><br/><p>Taking into consideration that this was a world created by Jiang Xie, Xie Xi was very concerned about the two gods and carefully checked.</p><br/><p>Unfortunately, the information on them was very thin. There were only myths and legends and basically no details.</p><br/><p>He would probably have to go to the Sixth or Seventh Domain to learn more information. However, Xie Xi couldn’t go with Jiang Xie next to him. Still, he wasn’t in a hurry. This Demon God might just be a background setting.</p><br/><p>After all, Gemini was an angel.</p><br/><p>Xie Xi checked the information and put on an act of knowing everything. “Tomorrow, there will be fireworks and we shouldn’t miss it.”</p><br/><p>“Yes.”</p><br/><p>“We will go early and grab a clean place.”</p><br/><p>Since Xie Xi’s resources were lost, there were no more demons around him and Jiang Xie’s recent mood could be described as beautiful as Heaven. Naturally, he was very compliant with Xie Xi.</p><br/><p>Xie Xi added, “The fireworks of the Demon World are very beautiful. You definitely haven’t seen it before!” Heaven admired white and gold and weren’t interested in other colours. The occasional fireworks were also monotonous and were like a light in the evening, making a person feel sleepy and safe.</p><br/><p>Jiang Xie smiled. “Have you seen it?”</p><br/><p>“I’m 105 years old. I’ve naturally seen it.” After returning to the Demon World, Xie Xi finally knew his age.</p><br/><p>Jiang Xie’s lips curved. “A five year old little succubus.” The festival occurred once every 100 years. The last time it happened, Xie Xi was five years old.</p><br/><p>Xie Xi stared at him. “You are one year older than me.”</p><br/><p>Jiang Xie was in a good mood. “Older is still older. Call me Brother Jiang in the future.”</p><br/><p>If the lonely male gods group was here, they would shout, “Can this old cow have any dignity? You can be Little Rose’s great, great, great grandfather!”</p><br/><p>Xie Xi didn’t call him Brother. This name was called too much in bed and was no longer simple!</p><br/><p>The two people laughed and talked as they waited for the fireworks display.</p><br/><p>They took their place with high spirits. They found a legendary couple’s holy place and had a good view.</p><br/><p>Jiang Xie was well prepared, with all types of delicious foods and drinks…</p><br/><p>Xie Xi saw the tent and was stunned. “What is this?”</p><br/><p>Jiang Xie explained, “If it is too late then we can sleep here.”</p><br/><p>Xie Xi couldn’t help thinking about the lesson they attended a few days ago. “A wilderness battle?”</p><br/><p>Jiang Xie, “…”</p><br/><p>Xie Xi blinked and the smelly Jiang Xie had no face. “If you want…”</p><br/><p>What damn thing? Xie Xi bit him and said, “Watch the fireworks!”</p><br/><p>“Yes, I’ll listen to you.”</p><br/><p>The fireworks of the Demon World were truly beautiful. It was estimated there was magic in them as beautiful patterns filled the night sky like a curtain, staging a colourful light show.</p><br/><p>The fireworks show was divided into seven themes, which was the seven majors of the Demon World. The envy demons were competitive and it unknown how long they had been preparing this.</p><br/><p>The most boring one was the gluttony department and Xie Xi couldn’t help looking down at the ground.</p><br/><p>The strangest one was the sloth department. There were 10 fireworks but these slowly people drew it out for an hour before finishing. It was said they prepared 10 but the rhythm was so bad they were ordered to stop!</p><br/><p>The penultimate one was the lust department. Xie Xi rushed to Jiang Xie and cried out, “It is ours!”</p><br/><p>After saying this, he couldn’t wait to change majors.</p><br/><p>It was really about sex and the fireworks showed this!</p><br/><p>The males and females weren’t tempted to be vegetarians and ate…</p><br/><p>Jiang Xie held Xie Xi’s hand and Xie Xi glanced over at him. As for watching the fireworks… oh…</p><br/><p>He was kissed.</p><br/><p>The finale was the pride department. Not much was known about this department because there were almost no students in it at school. Most demons wouldn’t choose it. It was said that graduation was extremely difficult but as long as they graduated, the mark was very high and they could directly stay in the Seventh Domain.</p><br/><p>This was a major with few people but monopolized power.</p><br/><p>Xie Xi urged Jiang Xie, “Look at the fireworks. This is the best one.”</p><br/><p>Jiang Xie kissed Xie Xi’s neck. “Looking at you is the best.”</p><br/><p>Xie Xi listened to the words of love and his lips curved. “Look, it is said that the Demon God is part of the pride…”</p><br/><p>He hadn’t finished speaking when fireworks exploded in the sky. The purple fireworks exploded and became layers that stacked on top of each other, becoming…</p><br/><p>Jiang Xie whispered, “A rose?”</p><br/><p>Xie Xi also recognized it and his heart was stunned.</p><br/><p>It stood to reason that purple shouldn’t be obvious against the black sky but these fireworks seemed to have a magical halo. Every single one blossomed and withered like waves, an inexplicable and magnificent gesture that touched everyone’s heart.</p><br/><p>Once the fireworks dissipated, Xie Xi saw the last ‘rose’, which was pure white. It shone like a twinkling star in the dark night sky.</p><br/><p>Then the star fell, dragging its white tail like a meteor falling in Xie Xi’s direction.</p><br/><p>Xie Xi’s heart thumped violently.</p><br/><p>Jiang Xie also noticed and protected Xie Xi. “Be careful.”</p><br/><p>It was impossible to dodge. The strong white light fell on Jiang Xie’s back.</p><br/><p>Xie Xi’s eyes narrowed. “Jiang Xie!”</p><br/><p>He didn’t expect there to be such a change. It was just normal fireworks. Why did it suddenly become a white meteor and what was going on with it?</p><br/><p>Was it okay for Jiang Xie to be hit by it?</p><br/><p>There should be nothing wrong. If an accident occurred with Jiang Xie then the world wouldn’t be as stable as it was now.</p><br/><p>Xie Xi sighed and leaned down towards the unconscious Jiang Xie, anxiously calling out to him, “Are you okay?”</p><br/><p>He resisted the urge to draw a healing device with the god’s wisdom.</p><br/><p>He had simple medical knowledge and there was no problem in the general inspection. The white light was like an illusion, going as quickly as it came and leaving no trace.</p><br/><p>It was just that Jiang Xie was sleeping. He didn’t seem hurt, he had just fallen asleep.</p><br/><p>What was going on?</p><br/><p>The fireworks party was over and no one was here. It was now silent.</p><br/><p>Xie Xi wasn’t afraid. He was just worried about Jiang Xie.</p><br/><p>If Jiang Xie didn’t wake up, should they sleep here?</p><br/><p>It didn’t matter since there was a tent.</p><br/><p>Xie Xi moved Jiang Xie to the tent and wanted to lie down beside him.</p><br/><p>At this time, the sleeping Jiang Xie suddenly opened his eyes.</p><br/><p>Xie Xi was startled by him. “Are you okay?”</p><br/><p>The tent was very wide and there was a double mattress. It also had some small lights and the yellow light shone brightly.</p><br/><p>Jiang Xie squinted. Then he turned to see Xie Xi and his dark pupils sharply shrank.</p><br/><p>At this moment, Xie Xi saw a cluster of purple flames in the eyes.</p><br/><p>Gemini’s eyes were black. How could there be a purple halo?</p><br/><p>As Xie Xi was puzzled, Jiang Xie pulled him over and pressed him under Jiang Xie’s body.</p><br/><p>Xie Xi’s eyes widened. “What…”</p><br/><p>He hadn’t finished his words when Jiang Xie leaned over and kiss him.</p><br/><p>“Um…” Xie Xi was caught off guard. “W…What…”</p><br/><p>He really hadn’t wanted to do anything in public but Jiang Xie was like a gust of wind and even got Xie Xi’s succubus magic to move.</p><br/><p>The confused Xie Xi heard Jiang Xie’s hoarse voice. “Do you like him?”</p><br/><p>Who was him? Xie Xi couldn’t think and struggling to maintain his spirit. “I like you.”</p><br/><p>The usual Jiang Xie would be happy but his voice sounded more lost. “Is Heaven so good?”</p><br/><p>Eh? What did this mean?</p><br/><p>Xie Xi replied, “As long as you are there, anywhere is good.” This wasn’t empty words. He always thought this way.</p><br/><p>Jiang Xie smiled and gave him an infinitely sweet kiss after what could be called rough sex. “That’s good. Then I don’t need to exist.”</p><br/><p>This shocked Xie Xi and he tried hard to open his eyes. However, his body seemed exhausted to the extreme and he couldn’t control it. He wanted to say something but he found that even the strength to talk was gone.</p><br/><p>Jiang Xie kissed him, carefully pulled Xie Xi into his arms and fell asleep.</p><br/><p>By the time Xie Xi opened his eyes again, he was back in the bedroom. He sat up and called out, “Jiang Xie!”</p><br/><p>Jiang Xie wasn’t…</p><br/><p>Xie Xi got out of bed and wanted to find him. At this time, the dormitory door open and Jiang Xie stood outside with breakfast.</p><br/><p>He closed the door and lowered the bag in his hand. “How can you get out of bed with bare feet?”</p><br/><p>Xie Xi was led back to bed by him. Then Jiang Xie bent over and put on shoes for him. “You should wear shoes even if you don’t want to wear clothes. The floor is very good.”</p><br/><p>Xie Xi wrapped himself tightly in the quilt. “You…” He found that his voice was hoarse the moment he spoke.</p><br/><p>Jiang Xie had a hint of chagrin in his eyes. “I don’t know what happened last night….”</p><br/><p>The confused Xie Xi…</p><br/><p>He remembered last night’s business and quickly asked, “You, last night…” He suddenly didn’t know how to ask.</p><br/><p>Rather, Jiang Xie asked him, “Is there any discomfort?”</p><br/><p>Xie Xi was fine so he questioned Jiang Xie, “What about you? I saw the light hit you.”</p><br/><p>Jiang Xie frowned. “It’s nothing. Just…”</p><br/><p>The things he did yesterday were too much.</p><br/><p>He couldn’t describe what happened. The complicated emotions still lingered in his heart, as if he had lost Xie Xi forever and last night was the last embrace. He woke up and Xie Xi no longer belonged to him.</p><br/><p>Xie Xi couldn’t figure out what was going on and his heart was a bit uneasy.</p><br/><p>Jiang Xie told him, “I brought breakfast. Eat it since you didn’t eat anything last night.</p><br/><p>Xie Xi absent-mindedly got up and was still thinking about what happened last night as he got dressed.</p><br/><p>Was it an illusion?</p><br/><p>But why would there be such an illusion?</p><br/><p>Xie Xi drank soy milk and stared into Jiang Xie’s eyes. They were black but last night, they were purple.</p><br/><p>What was going on?</p><br/><p>After breakfast, Jiang Xie suggested, “Don’t go to the garden today. If you are tired then take a break.”</p><br/><p>Xie Xi had a succubus’ body and really wasn’t tired. He said, “It’s fine. The garden is interesting so let’s go and see it together.”</p><br/><p>They just packed up and went out when they heard an enormous noise.</p><br/><p>This was followed by a university professor flying out with black wings.</p><br/><p>“All students, take refuge in the first auditorium!”</p><br/><p>“What’s going on?” The students glanced at each other and didn’t know what happened.</p><br/><p>Xie Xi was also baffled. He vaguely felt it was related to what he heard last night.</p><br/><p>At this time, he heard a whisper between the professors where fear couldn’t be suppressed. “…The Demon God fell.”</p><br/>\n</div>"}