{"title": "Chapter 231 - Collapsing 10 Boundaries 7", "id": 231, "volume": 3, "url": "http://boxnovel.org/game-loading-chapter-231-collapsing-10-boundaries-7", "volume_title": "Volume 3", "body": "<h1>Chapter 231 - Collapsing 10 Boundaries 7</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Collapsing 10 Boundaries 7</strong></p><br/><p>Seeing that the sky was becoming dark, Jiang Xie strode out and stood in front of Xie Xi.</p><br/><p>He took a kettle out of his backpack and opened the lid to give to the stunned student.</p><br/><p>The crazy senior looked dumbfounded.</p><br/><p>Jiang Xie was expressionless. “Senior brother, please respect yourself.”</p><br/><p>The increased distance between him and Xie Xi caused the classmate to suddenly wake up.</p><br/><p>This looked really evil!</p><br/><p>Xie Xi hid obediently, not stimulating the student anymore.</p><br/><p>It was really strange to be asked to X in broad daylight and he needed to be quiet.</p><br/><p>The classmate who sobered up was ashamed. His face was shy and red as he said, “I was… I was crazy… I’m sorry, sorry…” He apologized before running away under Jiang Xie’s icy gaze.</p><br/><p>He always felt that he would be beaten up if he didn’t run.</p><br/><p>Jiang Xie leaned back and looked at Xie Xi.</p><br/><p>Xie Xi’s eyes were full of surprise. “You have come back. Weren’t you supposed to be gone seven days?” It was only the sixth night.</p><br/><p>Jiang Xie’s attitude suddenly softened. “I finished early and came back.” He had been so worried that he couldn’t sleep He was afraid that when he came back, the little succubus would’ve already run off with others.</p><br/><p>Xie Xi asked, “How did you do? What was the result of the competition?”</p><br/><p>Jiang Xie spoke vague words. “I didn’t shame the school.”</p><br/><p>Xie Xi asked, “First prize?”</p><br/><p>Jiang Xie’s lips curved and he raised his head. “The top quality prize.”</p><br/><p>Xie Xi, “…” Okay, this was the world he designed and it was natural to be king.</p><br/><p>“It’s amazing,” Xie Xi sand this person’s praises.</p><br/><p>Jiang Xie told him, “You are also very good.”</p><br/><p>Xie Xi wondered, “I didn’t take part in the competition. How am I good?”</p><br/><p>“Your answer just now is very good.”</p><br/><p>It was regarding this matter. Xie Xi smirked in his heart. How could he be called good just for refusing sex?</p><br/><p>Xie Xi cooperated with him. “You have taught me well. I naturally won’t break the rules of Heaven.”</p><br/><p>Jiang Xie’s smile was wider than when he won the prize. “Have you eaten yet? I bought a specialty of the Fourth Heaven.”</p><br/><p>Xie Xi replied, “I have eaten.” He didn’t dare let himself be hungry.</p><br/><p>“Then tomorrow…”</p><br/><p>Before the words were finished, Xie Xi interrupted, “What is the specialty? I will taste it. I still have some space in my stomach.”</p><br/><p>He was curious about the delicious food. The Fourth Heaven would definitely have more different things than the FIrst Heaven.</p><br/><p>Xie Xi had the god’s wisdom so he wouldn’t be harmed by anything he came in contact with.</p><br/><p>Jiang Xie told him, “It is Snow Cloud Cake. Let’s go back to the dormitory first.”</p><br/><p>Xie Xi nodded and naturally held his hand.</p><br/><p>Jiang Xie’s ears turned slightly red. He wanted to say that he couldn’t be seduced outside but he couldn’t help holding the other person’s hand.</p><br/><p>It was okay… there was no one here…</p><br/><p>Once back in the dormitory, Xie Xi was afraid his clothes would disappear and quickly took them off.</p><br/><p>Jiang Xie, “…”</p><br/><p>Xie Xi really wanted to save money. It was a waste of time and money to buy clothes. It was also very troublesome.</p><br/><p>He asked hurriedly, “Where is the Snow Cloud Cake?”</p><br/><p>Jiang Xie didn’t need the Snow Cloud Cake but a large basin of ice water formed by snow to cool himself down.</p><br/><p>“Cough.” Jiang Xie hadn’t seen this person for six days and returned to the pre-training stage. He didn’t dare look. “The weather is cold. You should wrap yourself in a quilt first.”</p><br/><p>Xie Xi was very considerate and wrapped himself up in the thin quilt.</p><br/><p>The white quilt wrapped around the snow-white body, the beautiful and delicate small head exposed…</p><br/><p>Jiang Xie felt heat flowing through him and covered his nose while heading to the bathroom.</p><br/><p>Xie Xi, “………………”</p><br/><p>It felt that the gradual steps from before were all in vain. Jiang Xie left for six days and came back more useless than before.</p><br/><p>Jiang Xie sorted himself out and took out the Snow Cloud Cake from his backpack. “It is a bit sweet. I don’t know if you should eat too much.”</p><br/><p>Xie Xi saw the cake placed in a black box, looking as light as the clouds in the sky.</p><br/><p>Xie Xi couldn’t help saying, “It’s so beautiful.”</p><br/><p>It was really beautiful. The name Snow Cloud Cake didn’t look good at first but after seeing it, he found that this name was really appropriate.</p><br/><p>It was a round and small cake the size of a palm. It looked like clouds but had the crystal clearness of snowflakes. It was truly beautiful.</p><br/><p>Jiang Xie told him, “Taste it.”</p><br/><p>Xie Xi nodded and grabbed one. This Snow Cloud Cake looked like clouds in a dog but it was easy to pinch. The touch wasn’t sticky and it was very refreshing.</p><br/><p>Xie Xi took a bite and found that the cloud-like skin was crisp and wrapped around a cream filling. The taste was indescribable.</p><br/><p>“It’s delicious!” Xie Xi didn’t hesitate to exclaim.</p><br/><p>Jiang Xie seemed to sigh with relief. “You like it.”</p><br/><p>Xie Xi ate three in a row. He wanted to eat the fourth one when Jiang Xie stopped him. “You shouldn’t eat too much at night or you will feel uncomfortable. Leave it for tomorrow.”</p><br/><p>Xie Xi only just discovered something. “You aren’t eating any?”</p><br/><p>“I don’t like sweet things.”</p><br/><p>“It isn’t sweet. It is very delicious.”</p><br/><p>Jiang Xie whispered softly, “I’ll leave it for you to eat.”</p><br/><p>It wasn’t easy to go to the Fourth Heaven. If Jiang Xie wasn’t going to participate in the competition then it wouldn’t be easy for him to enter. Therefore, this Snow Cloud Cake was very difficult to buy. He was reluctant to eat it and wanted to leave it all for Xie Xi.</p><br/><p>How could Xie Xi not understand?</p><br/><p>For a time, he also felt it was too sweet. It wasn’t from the Snow Cloud Cake but sweetness that came from the bottom of his heart.</p><br/><p>It was the so-called small changes in newlyweds caused victory… In any case, Xie Xi felt like this and Jiang Xie had his own thoughts. The two people were very sticky and unknowingly, it was time to sleep.</p><br/><p>Before Jiang Xie went to participate in the competition, the gradual progress of the two people had developed to the point of sleeping together.</p><br/><p>For this progress, Xie Xi felt that Jiang Xie was very selfish.</p><br/><p>If it was just sleeping together, Examinee Jiang would probably have to practice for a lifetime.</p><br/><p>Once Jiang Xie finished washing, Xie Xi wrapped himself in a quilt and climbed into his bed.</p><br/><p>Jiang Xie just finished washing and felt he needed another cold shower.</p><br/><p>Xie Xi glanced at him. “It has been delayed for seven days. We should continue to practice.”</p><br/><p>If it was just acting shameless, who couldn’t do it?</p><br/><p>Jiang Xie got into bed and his action of holding people in his arms was nimble.</p><br/><p>Xie Xi lowered his head and smirked, deliberately leaning into this person’s arms.</p><br/><p>Jiang Xie suffered a lot. It was a bit of the taste of a person taking the university entrance exam.</p><br/><p>Xie Xi’s mind moved and he whispered, “Is this falling in love with you?”</p><br/><p>The sudden words threw Student Jiang Xie to the sky.</p><br/><p>His head was blank like a flash bomb had been thrown.</p><br/><p>He felt the strength in the other person’s arms and Xie Xi dropped him down to the ground again. “It doesn’t seem like it? We are just practicing for you to come to the Demon World.”</p><br/><p>Xie Xi felt there was no problem with this brain circuit.</p><br/><p>Jiang Xie was stunned for half a minute before a reaction came. “You…”</p><br/><p>Xie Xi helped him by saying, “Only two people in love with each other will be so intimate. If we are like this, is it love in Heaven?”</p><br/><p>Jiang Xie’s heart trembled.</p><br/><p>Xie Xi woke him up. “Of course, we are different. We are mainly practicing.” He would let this person dig a hole for himself that he couldn’t climb out of!</p><br/><p>Gemini’s mind was very good. Not only did he find a benefit for himself, he was also able to pick some sugar from the cracks.</p><br/><p>“Why are you practicing with me?”</p><br/><p>Xie Xi answered, “In order to let you pass the assessment.”</p><br/><p>Jiang Xie wondered, “Why should I pass the assessment?”</p><br/><p>“If you pass the assessment, you can go to the Demon World!”</p><br/><p>Jiang Xie gulped and asked another question, “Why do you want me to go to the Demon World?”</p><br/><p>Xie Xi knew what this person wanted to hear and was willing to tell him. “It is because I don’t want to be separated from you…”</p><br/><p>His mouth was blocked before his words finished.</p><br/><p>The step by step Candidate Jiang challenged the super-hard question, wanting to go beyond the university entrance examination and go straight to the university course!</p><br/><p>This night was quiet and the two males lay in bed, yet managed to stop…</p><br/><p>Gemini really wasn’t an average person, Xie Xi thought.</p><br/><p>Jiang Xie gasped out. “Remember, don’t say such things to me during the assessment.”</p><br/><p>Xie Xi was also gasping and didn’t understand his words for a moment.</p><br/><p>Jiang Xie continued, “If you say these things, I really can’t go to the Demon World with you.”</p><br/><p>Xie Xi, “…”</p><br/><p>All the other seductions were less than these words?</p><br/><p>He wanted to say he had no interest but thought he was promising too much.</p><br/><p>Xie Xi didn’t dare to tease this person and obediently huddled in the quilt. “Okay.”</p><br/><p>Jiang Xie was itchy and asked, “Why don’t you want to separate from me?”</p><br/><p>Xie Xi asked back, “Does this need a reason? I don’t want to separate from you.”</p><br/><p>Jiang Xie held this person and felt he was finished, completely finished.</p><br/><p>It was nothing to be bewitched by a succubus. He could calm down with a bottle of cold water.</p><br/><p>However, falling in love with a succubus was really the end…</p><br/><p>Jiang Xie could control his body but he really couldn’t control his heart.</p><br/><p>He liked this succubus. Perhaps he had been ruined the first time he saw Xie Xi.</p><br/><p>Xie Xi felt that Jiang Xie couldn’t pass the exchange student examination.</p><br/><p>He specifically looked at situations in the past. The exchange program had been going on for a long time. Basically, every four years, there was always an exchange student at the school.</p><br/><p>There wasn’t always a succubus as an exchange student. Many of the previous sessions never had a succubus exchange student.</p><br/><p>Of course, the other big demons were no better. For example, the big demon who majored in greed. In that year, the graduation rate of the Economic Department plummeted. One by one, they didn’t go to class and went to earn money!</p><br/><p>There was also the big demon who majored in wrath. When he was at school, the Physical Education department became like a gang and would go to other schools to fight. All of them became confused!</p><br/><p>The demon majoring in sloth was even more fascinating. Before entering the classroom, only 10% of the students were sleeping in the back. Once he entered, 100% of them would sleep, including the lecturer at the podium.</p><br/><p>The big demon who majored in gluttony made the school cafeteria miserable. Three meals a day turned into six meals and the students became starving ghosts. It made the workers really tired and bald!</p><br/><p>Xie Xi saw it with great interest. Compared to his predecessors, the succubus was really a small witch.</p><br/><p>He turned to the school forum and found that there were many posts discussing himself when he first entered school.</p><br/><p>The posts were as followed—</p><br/><p>“According to the experience of the predecessors, will our Law Department become a brothel?”</p><br/><p>The following post was also funny. “What brother? It is a green building.” (TL: High-end brothel in Ancient China)</p><br/><p>“No wonder why the dormitory building of the Law Department is green…”</p><br/><p>Many roles started to be played.</p><br/><p>After a few hundred posts, many people closed it and scattered. There was the powerful Master Jiang who caught the succubus in a sack. They could forget the dream of a brothel.</p><br/><p>Xie Xi saw this and laughed until tears emerged.</p><br/><p>A year passed quite quickly and in the blink of an eye, it was almost over.</p><br/><p>There was one month to the assessment and they had to see if Master Jiang could pass!</p><br/>\n</div>"}