{"title": "Chapter 239 - Collapsing 10 Boundaries 15", "id": 239, "volume": 3, "url": "http://boxnovel.org/game-loading-chapter-239-collapsing-10-boundaries-15", "volume_title": "Volume 3", "body": "<h1>Chapter 239 - Collapsing 10 Boundaries 15</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Collapsing 10 Boundaries 15</strong></p><br/><p>It was a very charming pair of eyes, the deep lustre seeming to cross the torrents of time and was immersed in eternity. This alone made Xie Xi think this person was a serious and restrained man with a long life.</p><br/><p>The grey-haired demon let go of Xie Xi and ran out in a panicked manner.</p><br/><p>Xie Xi’s location was somewhat isolated. Once the grey-haired demon left, only Xie Xi and the strange man was were left behind.</p><br/><p>Xie Xi knew that all the adult demons in the Sixth Domain had a high status, so he cautiously bowed.</p><br/><p>The man smiled. “Do you know me?”</p><br/><p>Xie Shi shook his head. “I don’t know who you are.”</p><br/><p>The man gazed at him for a while before speaking slowly, “Just call me Jiang Xie.”</p><br/><p>“Lord Jiang Xie.”</p><br/><p>The smile on Jiang Xie’s face deepened and he sat next to Xie Xi. ”It is just Jiang Xie, not Lord.”</p><br/><p>Xie Xi, “…”</p><br/><p>Suddenly, he felt that his first impression was an illusion. In fact, this gentleman wasn’t restrained or serious!</p><br/><p>“What’s your name?” Jiang Xie asked him.</p><br/><p>Xie Xi gave his name and added the following to prevent any misunderstandings. “I came here with my teacher. My teacher has a seminar on.”</p><br/><p>Jiang Xie was surprised. “A student?”</p><br/><p>Xie Xi didn’t want to be looked down upon and straightened. “Now I am a student. I will apply to the Seventh Domain after graduation.”</p><br/><p>Jiang Xie’s eyes narrowed. “What will you do in the Seventh Domain?”</p><br/><p>Xie Xi replied, “Every demon’s dream is to be loyal to the Demon God, I am no exception.”</p><br/><p>Jiang Xie asked with interest, “Have you ever seen the Demon God?”</p><br/><p>Xie Xi cast a disapproving gaze towards him. “Would the Demon God go to the First Domain? Naturally, I haven’t seen him.” He didn’t want to seem righteous and restrained so Xie Xi added, “…I’ll see him later.”</p><br/><p>Jiang Xie spoke slowly. “How can you be loyal to a person you have never met?”</p><br/><p>His demeanour wasn’t pious and Xie Xi watched him vigilantly. “Are you a spy sent from Heaven?”</p><br/><p>Jiang Xie was amused by him and raised his eyebrows. “If I am a spy, I would tie you up and bring you to Heaven right now.”</p><br/><p>Xie Xi rarely had physical contact with others. He usually became cold but now he felt heat spreading through his body…</p><br/><p>Jiang Xie sensed it and his smile deepened. “Why, does the little succubus want me?”</p><br/><p>His slow tone would have others think negatively of him but it was normal for a succubus. Xie Xi might not indulge in desire but he was a real succubus. He knew the life of a succubus very well and wasn’t angry.</p><br/><p>He hesitated. The man in front of him felt different from the first impression but Xie Xi didn’t hate him. If Xie Xi had to find a person, uh…</p><br/><p>Unexpected, Jiang Xie told him, “Go find someone else. I’m not free tonight.”</p><br/><p>Xie Xi, “………………”</p><br/><p>This man was really annoying!</p><br/><p>Xie Xi got up and stated coldly, “You are thinking too much, I’m not interested in you.” He might be angry but he didn’t want to offend this person and used honorifics.</p><br/><p>Jiang Xie noticed his anger. “Tonight really isn’t possible. If you are willing to wait then can you come back tomorrow?”</p><br/><p>Xie Xi shouted, “No!” Then he turned and left.</p><br/><p>Such a casual big demon, Xie Xi didn’t want to have anything to do with him! Outside the bar, the cold wind blew at Xie Xi and calmed him down. He saw his reflection in the window. It was a very standard succubus’ face and others could recognize it at one glance.</p><br/><p>Xie Xi didn’t hate his lineage, he just hated that he couldn’t adapt to his lineage. Why couldn’t he find someone? Wasn’t it just sex?</p><br/><p>This was a problem that even Xie Xi didn’t know the answer to. All he knew was that he would rather face death than find just anyone.</p><br/><p>Xie Xi laughed at himself and thought in his heart, ‘I said I would go to the Seventh Domain to be loyal to the demon god but I can’t even go through the adulthood ceremony.’</p><br/><p>The next day, Xie Xi didn’t go to the bar but he didn’t dare stay at the reception thanks to his professor. He could only go outside into the cold wind until midnight, when he dared to go back and sleep.</p><br/><p>This happened for three days in a row. There were only a few days left until they returned to the First Domain and the professor was furious. “What type of demon do you want to pick?”</p><br/><p>Jiang Xie flashed through Xie Xi’s brain for a moment… he didn’t want that bastard!</p><br/><p>Xie Xi angrily cried out, “I won’t become an adult!”</p><br/><p>The professor seemed like a mother and father who regretted marrying off their daughter. “You don’t want to live!”</p><br/><p>Xie Xi stepped forward. “If I won’t live then I won’t live!”</p><br/><p>The professor was angry but he also knew Xie Xi’s stubbornness. 10 hell dogs wouldn’t be able to move him!</p><br/><p>“What nonsense are you saying?” The professor decided to compromise. Tell me the type of person you want. With the exception of the Demon God, I will help you find a way to contact them.”</p><br/><p>It wasn’t that he was being arrogant. His student was so excellent that even the domain masters wouldn’t refuse to help this promising little succubus.</p><br/><p>The only one Xie Xi could think about was Jiang Xie. However, that person wasn’t available!</p><br/><p>Xie Xi made a gamble. “I want the Demon God. Apart from the Demon God, I don’t want anyone else!”</p><br/><p>“You… you… you stinky boy!” The professor was so angry that he almost died on the spot!</p><br/><p>They would be leaving the Sixth Domain tomorrow. During this period, Xie Xi never went out again.</p><br/><p>The professor couldn’t control his student anymore and didn’t bother looking. He just went out to drink.</p><br/><p>Xie Xi sat in his room until 9 o’clock. He couldn’t go to sleep so he went out. He didn’t know how but he went to the bar again. In fact, he didn’t have any thoughts. He just went in and looked around. Naturally, he didn’t see the man with purple eyes…</p><br/><p>This was normal. So many days had passed. Xie Xi relaxed and let out a breath. He sat at the bar and sipped his wine slowly. It was the last night. Tomorrow he would go back…</p><br/><p>This was it. He would go back and tell everyone that he only wanted to sleep with the Demon God. Then he would wait to die. His life might be short but he somehow wasn’t upset.</p><br/><p>Xie Xi finished his glass of wine and was ready to go back. Then a voice was heard behind him. “I thought I’d never see you again.”</p><br/><p>Xie Xi turned around and saw the purple-eyed man who made him itch with dislike.</p><br/><p>Jiang Xie’s eyes flashed with surprise and he spoke somewhat helplessly, “This little succubus is really…”</p><br/><p>Xie Xi had just drunk a glass of wine and thought about those things. His eyes were covered with a layer of moisture and his cheeks were faintly red, which made his skin more stunning. He was already very good-looking and this appearance could simply take away the soul of a person.</p><br/><p>Xie Xi hadn’t expected to see Jiang Xie and didn’t react for a while. He just stared at the other person.</p><br/><p>Jiang Xie’s voice lowered and was warm. “I am free tonight. You…”</p><br/><p>“I’m not free!” Xie Xi’s senses returned along with an unknown anger and he refused.</p><br/><p>He was inexplicably uncomfortable when he heard Jiang Xie’s words. He didn’t want to see Jiang Xie or have anything to do with him. So what if Xie Xi died? In any case, he should live happily!</p><br/><p>Jiang Xie was slightly shocked.</p><br/><p>Xie Xi got up and said, “Sorry, I’ve already made an appointment.”</p><br/><p>Then he left. Jiang Xie naturally didn’t follow. He sat down for a while, the light fading from his eyes.</p><br/><p>Xie Xi returned to the First Domain. On the way, the professor sighed and kept glancing bitterly at Xie Xi.</p><br/><p>Xie Xi’s face didn’t change colour. “It is either the Demon God or death!”</p><br/><p>The professor poked him. “I haven’t raised a naughty student like you for so many years!” On the contrary, Xie Xi was too excellent. If he could graduate then he could be assigned to the Sixth Domain. Then if he worked hard for several years, he might get a great prospect.</p><br/><p>This stinky student had a great future but the problem was if the student could live to next year?</p><br/><p>The thing that led Xie Xi to compromise later was that he saw a piece of information.</p><br/><p>The Demon World had a long history and the succubus race was one of the original races, they were very old.</p><br/><p>Xie Xi found a predecessor who also suffered from anorexia like him. Before the adulthood ceremony, the predecessor refused to do anything with others. Later, he held the ceremony and it went completely out of control. The people around him…</p><br/><p>Xie Xi saw up to here.</p><br/><p>The one holding the ceremony for him was his own professor. If he became a beast and forced his teacher then…</p><br/><p>No, this image was too terrible, more terrible than death!</p><br/><p>However, committing suicide would be too cowardly. This would make the professor who always cared for him feel sad and lose his dignity.</p><br/><p>What should he do?</p><br/><p>As the day drew nearer, Xie Xi compromised. He could ignore himself but he couldn’t implicate others.</p><br/><p>Finally, Xie Xi plucked up the courage to go to a famous bar in the First Domain while wearing a special outfit.</p><br/><p>It didn’t matter the identity of the person. The first one to talk to him was fine. He just needed to complete the task!</p><br/><p>Unexpectedly, he just entered the door when he bumped into a person. Xie Xi looked up and saw Jiang Xie.</p><br/><p>Jiang Xie frowned as he took off his coat and wrapped it around Xie Xi. “Dressing like this, do you want to cause chaos?”</p><br/><p>Xie Xi didn’t hear what he said and asked, “What are you… why are you here?”</p><br/><p>Why was a big demon from the Sixth Domain in the First Domain? How could Jiang Xie explain that he was fascinated by the little succubus and came to find him?</p><br/><p>“There is a job,” Jiang Xie replied.</p><br/><p>Xie Xi’s heart heated up as he thought about his set goal: have sex with the first person to talk to him. This was Jiang Xie.</p><br/><p>The awkwardness from a few works ago had long scattered and Xie Xi watched this person.</p><br/><p>Jiang Xie’s voice became slightly hoarse. “It seems you don’t have an appointment tonight?”</p><br/><p>Xie Xi told him, “I just arrived here.”</p><br/><p>“Can I make an appointment with you then?”</p><br/><p>Xie Xi’s thin lips quivered but he remained strong. “If you are free…”</p><br/><p>Jiang Xie picked him up and directly teleported to a large room. Xie Xi was thrown on the bed and his body was a bit squished. “This is…”</p><br/><p>Jiang Xie covered his mouth and kissed him into a daze. At the last moment, Jiang Xie stopped. Xie Xi stared up at him with moist eyes.</p><br/><p>Jiang Xie told him, “Promise me something or I won’t continue.”</p><br/><p>Xie Xi was going crazy. “What is it?”</p><br/><p>Jiang Xie leaned towards his ear and whispered, “After tonight, you will only be with me and not look for anyone else.”</p><br/><p>Xie Xi’s eyes widened.</p><br/><p>Jiang Xie kissed his small earlobe. “I will give you the best sex but you can only belong to me from now on.”</p><br/><p>At this moment, Xie Xi could only hear his own heartbeat that violently engulfed his entire body.</p><br/><p>He circled Jiang Xie’s neck with his arms and whispered, “Okay…”</p><br/><p>Xie Xi felt unparalleled joy the moment he uttered these words.</p><br/>\n</div>"}