{"title": "Chapter 230 - Collapsing 10 Boundaries 6", "id": 230, "volume": 3, "url": "http://boxnovel.org/game-loading-chapter-230-collapsing-10-boundaries-6", "volume_title": "Volume 3", "body": "<h1>Chapter 230 - Collapsing 10 Boundaries 6</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Collapsing 10 Boundaries 6</strong></p><br/><p>He spoke so naturally that Xie Xi couldn’t respond.</p><br/><p>Half a second later…</p><br/><p>Xie Xi sent fireworks in his heart to the sky. ‘Teacher, can you have some dignity? How can you say such a thing?’</p><br/><p>Teacher Jiang was really serious. “There are more than 10 months left. If I do it gradually, I feel I can pass the final assessment.”</p><br/><p>Xie Xi, “……………………”</p><br/><p>Jiang Xie was very subtle. “Of course, this is just a suggestion. You don’t have to do it if you think it is troublesome.”</p><br/><p>It was reasonable that if Xie Xi really was a succubus, why wouldn’t he accept this proposal? This was as normal for him as eating and drinking. How could it be troublesome?</p><br/><p>Xie Xi vowed that he wouldn’t forget this world. Once he returned to Central, he had to discuss it with Mr Jiang. If Mr Jiang’s face wasn’t there then he could draw another one. Don’t be shameless!</p><br/><p>Thus, the pre-assessment training was set.</p><br/><p>Jiang Xie had a plan. “Don’t go outside. I can endure it but I’m afraid the other angels can’t endure it.”</p><br/><p>In other words, other angels weren’t shameless like Jiang Xie.</p><br/><p>Jiang Xie spoke again, “…Leave it to after dinner. We will do it once a day and gradually increase it.”</p><br/><p>It was even dividing the course of treatment?</p><br/><p>Jiang Xie stared at Xie Xi and asked seriously, “Is it okay? If you have any suggestions then we will discuss it.”</p><br/><p>Xie Xi inwardly rolled his eyes. ‘You have arranged it clearly. What suggestions can I put forward and what is there to discuss?’</p><br/><p>Of course, Xie Xi on the surface coaxed him. “Well, I have no suggestions. How will we gradually increase it?”</p><br/><p>He deliberately asked to see how Jiang Xie ‘arranged’ it.</p><br/><p>Jiang Xie cleared his throat. “I will say it at night.”</p><br/><p>Xie Xi should say, “Yes, I will cooperate will and strive to let you pass the assessment in a year.”</p><br/><p>Seduction for one year, wasn’t this self-torture?</p><br/><p>At the end of the daytime class, a friend came over to ask, “Do you want to eat together?” His eyes fell on Jiang Xie before glancing at Xie Xi.</p><br/><p>He had been in school for a month and his classmates had become more familiar with him. Their class had been strengthened with the meditation course and one by one, they could become monks without any desire. Oh, they were angels so they couldn’t be monks.</p><br/><p>In short, the little friends were determined enough. They weren’t red-faced when they saw Xie Xi and even wanted to get close.</p><br/><p>Jiang Xie squinted at Xie Xi. “Do you want to go?”</p><br/><p>Xie Xi inwardly thought, ‘Insincere.’</p><br/><p>His clothes would disappear once it got dark. How could he dare go to dinner with people?</p><br/><p>Jiang Xie asked knowing this.</p><br/><p>Xie Xi shook his head. “I don’t want to go out for dinner.”</p><br/><p>Jiang Xie told him that he must wear clothes when going out at night, otherwise, he couldn’t go out. The succubi regarded clothes as the enemy and naturally chose not to go out.</p><br/><p>Jiang Xie looked at the classmate. “If Xie Xi doesn’t go then I won’t go.”</p><br/><p>The classmate was slightly disappointed but didn’t force them. He only said, “Then next time.”</p><br/><p>Jiang Xie smiled.</p><br/><p>Xie Xi said in his heart, ‘There will be no next time, not in this life.’</p><br/><p>Xie Xi had used this time to study the world carefully and tried to find signs of the collapse, but there were no clues.</p><br/><p>There weren’t too many Gemini traits with this Jiang Xie.</p><br/><p>Of course, Xie Xi wasn’t too fussed about this. Aries and Taurus didn’t have too many of their horoscope traits either. Besides, the so-called horoscope traits were one-sided things and too much truth would make things go awry.</p><br/><p>As for why the light groups were named after the horoscopes, Xie Xi had no clue.</p><br/><p>In fact, this didn’t matter. He was at Jiang Xie’s side and as long as he didn’t separate from Jiang Xie, the clues would surface sooner or later.</p><br/><p>They rejected the classmate’s invitation and ate dinner alone. Then Xie Xi asked, “Are we going to start practice?”</p><br/><p>Jiang Xie’s eyelashes shook and his body was visibly tight.</p><br/><p>Xie Xi perceived this and was amused. This person knew he wouldn’t be able to endure it yet still wanted to practice. This was bearing fault!</p><br/><p>Jiang Xie nodded and said, “Okay.”</p><br/><p>Xie Xi’s eyes curved as he glanced at the other person. “What should I do?”</p><br/><p>Jiang Xie’s eyes narrowed as he watched Xie Xi’s clothes disappearing. His head was also buzzing. “First… hold hands.”</p><br/><p>Xie Xi almost burst out laughing. After thinking about it for so long, the first step was holding hands?</p><br/><p>This was an evil person who didn’t have an evil person’s guts!</p><br/><p>“Is holding hands a seduction?” Xie Xi asked in a charming manner.</p><br/><p>Jiang Xie probably wanted to say, “You being in front of me is a great temptation.”</p><br/><p>Of course, he didn’t say this but maintained his face. “Follow a gradual process and start with this contact first.”</p><br/><p>Xie Xi wanted to see what type of medicine that Gemini was selling. “Okay, like this?”</p><br/><p>He held out his little finger and hooked it on Jiang Xie’s finger.</p><br/><p>Jiang Xie, “!”</p><br/><p>Xie Xi felt the tension in the other person’s body and was delighted. “Then like this.” He placed his palm against the other person’s palm and interlocked their fingers.</p><br/><p>Among the many ways of holding hands, interlocking the 10 fingers was absolutely the most romantic.</p><br/><p>‘Your fingers are between my fingers, my fingers are between your fingers, our two palms are inseparable as if two hearts have collided.’</p><br/><p>Xie Xi was stable. After all, he was used to it.</p><br/><p>Jiang Xie… he seemed like a steam train that didn’t know where it was going.</p><br/><p>Xie Xi deliberately asked him, “Is this okay?”</p><br/><p>Jiang Xie held Xie Xi’s hand firmly and his voice was hoarse. “Yes.”</p><br/><p>Xie Xi was about to laugh to death. This person was shaking just holding hands. It seemed it was necessary to follow the gradual practice.</p><br/><p>Three days later, Jiang Xie had adapted to holding hands and his face didn’t change when their fingers interlocked. As for his heart, it was unknown how fast it was jumping.</p><br/><p>Seeing that the next step could be taken, the succubus didn’t need the teacher to help and took the initiative to touch Jiang Xie’s body.</p><br/><p>It was touching through clothes but Jiang Xie immediately grabbed his hand. “T-Today, we will end it here.”</p><br/><p>Then he went to the bathroom and there was the loud sound of water.</p><br/><p>Jiang Xie came out again, his hair wet with cold moisture. It was already October and a cold shower was terrible.</p><br/><p>Xie Xi felt a strange heartache and couldn’t help saying, “If you are having a hard time…”</p><br/><p>“I have to train well if I want to go with you to the Demon World in one year.”</p><br/><p>Xie Xi asked, “Why set such an assessment?”</p><br/><p>Jiang Xie stared at him. “You want to ask why Heaven forbids lust?”</p><br/><p>This question was generally understood by Xie Xi but a succubus wouldn’t understand. Teacher Jiang wanted to start a class so Xie Xi would let him.</p><br/><p>He asked again, “Sex is an instinct. Why suppress it?”</p><br/><p>Jiang Xie seemed to like that Xie Xi asked this question. He picked up the quilt and wrapped it around Xie Xi, letting Xie Xi lean on the bedside. “In fact, Heaven can’t stop people from being in relationships with others.”</p><br/><p>Xie Xi listened carefully.</p><br/><p>Jiang Xie’s gaze was very gentle and his low voice was also pleasant. “if you have a relationship with someone you like, based on love, it is absolutely much happier than pure indulgence.”</p><br/><p>Xie Xi’s heart was filled with sweetness when he saw such a Jiang Xie and heard his words.</p><br/><p>He might always scold Jiang Xie as a rouge but to Jiang Xie, love was indeed greater than sex.</p><br/><p>In the Central World, he was a mess but it was also based on his love for Xie Xi. His love was so full that he endlessly wanted to express it.</p><br/><p>Xie Xi didn’t say anything. Jiang Xie thought he was thinking and said, “Plain sex can be resisted but love is an irresistible existence.”</p><br/><p>Physical desires could be resisted but not the flying heart. Xie Xi couldn’t help smiling.</p><br/><p>Jiang Xie also smiled. “Do you understand?”</p><br/><p>Xie Xi said, “Love in the Demon World is different from that of Heaven.”</p><br/><p>Jiang Xie sighed. “In fact, once you fall in love with a person, you can’t help wanting to monopolize them.”</p><br/><p>“It makes sense.” Xie Xi nodded. “I understand a bit.”</p><br/><p>“Take your time. You will learn more during the year in Heaven.”</p><br/><p>Xie Xi said, “I will also try to help you pass the assessment.”</p><br/><p>Jiang Xie made a complicated expression that was a mixture between pain and happiness.</p><br/><p>By the time they reached Xie Xi sitting on Jiang Xie’s thigh, Jiang Xie received an invitation to a competition and had to go to Fourth Heaven.</p><br/><p>Xie Xi thought he could follow. Who knew…</p><br/><p>“The holy light in the Fourth Heaven is relatively strong and you might be uncomfortable if you go.”</p><br/><p>The Demon World and Heaven might live in harmony but their races were different after all. They had different ways of survival.</p><br/><p>Xie Xi questioned, “How long will you be gone?”</p><br/><p>Jiang Xie replied, “Up to one week.”</p><br/><p>Seven days… Xie Xi frowned.</p><br/><p>Jiang Xie comforted him. “You can rest assured that while I’m not here, the class monitor will help you prepare three meals.”</p><br/><p>Eating was a big problem. A succubus couldn’t be too hungry or they would cause chaos.</p><br/><p>Xie Xi nodded and said, “Then go early and you can come back early.”</p><br/><p>“Yes.”</p><br/><p>The two people had lived together for so long that they couldn’t adapt to separating.</p><br/><p>As he left, Jiang Xie told Xie Xi, “Don’t go out at night.”</p><br/><p>A succubus didn’t wear clothes at night and Jiang Xie was afraid that Xie Xi would go out when he wasn’t present.</p><br/><p>Xie Xi knew what this person was worried about. “I won’t go out.” His clothes disappeared when it was dark. If he went out, wouldn’t people think he was crazy?</p><br/><p>Jiang Xie was slightly relieved and spoke again, “Then I’m leaving.”</p><br/><p>Xie Xi nodded. “Yes.”</p><br/><p>Xie Xi had really thought he could follow when Jiang Xie left. However, it was only for seven days. Xie Xi lived his life according to a schedule.</p><br/><p>The monitor in charge of his three meals was a calm angel who recited mantras when he saw Xie Xi.</p><br/><p>Xie Xi didn’t dare talk to him in fear he would break the concentration.</p><br/><p>The days passed in a flash and there were two days left until Jiang Xie came back. Xie Xi was still thinking about him.</p><br/><p>The background of the world was rather mysterious so Xie Xi didn’t dare use the god’s wisdom to draw things in case it would be difficult to explain if discovered.</p><br/><p>In the face of an unknown setting, he should try to be more conservative.</p><br/><p>On the sixth day, Xie Xi’s afternoon class ended and he planned to return to the dormitory.</p><br/><p>The switch between night and day here was very punctual. Basically, it was night at 7 o’clock and Xie Xi’s passive skills would vanish his clothes.</p><br/><p>In order to not buy more clothes, Xie Xi would generally return to the dormitory in advance to take off his clothes.</p><br/><p>At 6:40, Xie Xi arrived at the dormitory building and was about to go upstairs when he was pulled by someone.</p><br/><p>Xie Xi reacted the moment he was pulled down the stairs.</p><br/><p>Fortunately, Xie Xi’s physical quality was good and his posture was very stable. He didn’t fall down.</p><br/><p>It was just that he didn’t feel good and he frowned. Anyone would be angry if they were pulled so suddenly.</p><br/><p>The gasping person was nervous and uneasy. “Xie, Xie Xi, you… can you sleep with me once, just once. I can do it, I can do anything you want.”</p><br/><p>Xie Xi was stunned and gazed at the person in front of him.</p><br/><p>Based on the school uniform, he should be a senior student but his face was completely strange. Xie Xi didn’t have any impression of him.</p><br/><p>Of course, Xie Xi had been protected by Jiang Xie and basically didn’t touch other angels. It was normal not to have an impression.</p><br/><p>The angel was pale with nervousness but his eyes were full of a hot mania. “I know you don’t care about me and it doesn’t matter. You can treat me as someone to vent your…”</p><br/><p>Xie Xi’s ears trembled and he could smell Jiang Xie. Was this person back?</p><br/><p>Was he peeking?</p><br/><p>Of course, Xie Xi would refuse even if he wasn’t present. Since Jiang Xie was here, he would speak even louder.</p><br/><p>Xie Xi removed the hand of the strange student and spoke seriously, “This is Heaven. I will obey the rules of the angels and not do anything with a person I don’t love.”</p><br/><p>The student was obviously stunned.</p><br/><p>“Brother, please calm down. This type of sex has no meaning.”</p><br/><p>The contest had been completed ahead of time and Jiang Xie rushed back only to see Xie Xi being pulled by a person.</p><br/><p>At that moment, ice chilled his bones and completely froze him.</p><br/><p>He had been worried for seven days and nights, not eating or sleeping…</p><br/><p>Then Jiang Xie heard Xie Xi’s words.</p><br/><p>Xie Xi refused, a succubus who fed on sex refused such an invitation. A strange heat filled Jiang Xie’s chest and there was an indescribable throbbing.</p><br/>\n</div>"}