{"title": "Chapter 247 - Collapsing 9 Boundaries 6", "id": 247, "volume": 3, "url": "http://boxnovel.org/game-loading-chapter-247-collapsing-9-boundaries-6", "volume_title": "Volume 3", "body": "<h1>Chapter 247 - Collapsing 9 Boundaries 6</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p></p><h3>Chapter 247: Collapsing 9 Boundaries 6</h3><br/><p>Jiang Xie asked earnestly, “Acknowledge the master?”</p><br/><p>Yan Zhe wondered, “You haven’t been to the city since the earthquake?”</p><br/><p>Jiang Xie was afraid of Little Chirp being found and hid on this farm.</p><br/><p>Yan Zhe explained to him, “It is possible for a beast to go crazy if they don’t recognize a master. You should help Little Chirp acknowledge a master as soon as possible.”</p><br/><p>Xie Xi didn’t think he would go crazy but acknowledging a master was nothing and it could make Jiang Xie feel reassured.</p><br/><p>Jiang Xie found the important parts. “How to make him acknowledge a master? Is there anything special to pay attention to?”</p><br/><p>Yan Zhe explained, “The transformed beast has a human nature. It must want to acknowledge you as the master for it to succeed.”</p><br/><p>Jiang Xie frowned.</p><br/><p>Yan Zhe continued, “If he agrees, you just need to give him a drop of your own blood.”</p><br/><p>Jiang Xie questioned, “Once a master is acknowledged, apart from him not going crazy, will there be any harm to him?”</p><br/><p>This caused Yan Zhe to raise his eyebrows. His goodwill towards Xie Xi was obviously hundred of times higher than his goodwill to Jiang Xie. The fact that Jiang Xie was so concerned for Xie Xi resonated with him.</p><br/><p>“Apart from not being able to defy your orders, everything else is fine. He will share your lifespan… a tit doesn’t have a long life, right? If he acknowledges you as his master then he will die when you do.”</p><br/><p>Speaking such a long passage was obviously a burden for Yan Zhe. He took and breath and said, “There is a certain chance it will stimulate the ability of the transformed beast and he will become a powerful assistant.”</p><br/><p>This sounded really good. Xie Xi was determined!</p><br/><p>Jiang Xie frowned and it was unknown what he was worried about.</p><br/><p>Yan Zhe added, “After the master is acknowledged, you can generally understand what he is saying.”</p><br/><p>This was great! Xie Xi was emotionally affected!</p><br/><p>Xie Xi stared at Jiang Xie. He had been suffocated from chirping all day and immediately wanted to recognize Jiang Xie as his master.</p><br/><p>Jiang Xie perceived the gaze and his heart warmed, but he didn’t immediately agree.</p><br/><p>Yan Zhe ‘s eyes were full of envy. He also wanted to have such a Little Chirp that fully trusted him.</p><br/><p>Then he clenched his fists. So what if he had such a little one?</p><br/><p>He couldn’t even protect himself.</p><br/><p>The youth in front of him might be gloomy and violent but he had enough ability and courage to protect himself and Little Chirp.</p><br/><p>Yan Zhe knew they needed time and didn’t say anything else.</p><br/><p>Jiang Xie entered the bedroom with Xie Xi. It was very interesting when entering the house because the big hairball was squeezed by the door. After entering, he burst out and this could only be described as cute.</p><br/><p>Jiang Xie’s tense brow loosened and he helped Little Chirp smooth his hair.</p><br/><p>Xie Xi told him, “I will recognize you as my master.”</p><br/><p>This wasn’t yet acknowledged but Jiang Xie seemed to know what he was saying and declared, “I don’t want to be your master.”</p><br/><p>Xie Xi, “???”</p><br/><p>What was this situation? Wasn’t the bird good? Or was he still a cat slave?</p><br/><p>Aries Jiang was Aries Jiang while Cancer Jiang was Cancer Jiang. Their bones were the same.</p><br/><p>Jiang Xie spoke again, “I think of you as family and also hope that you will take me as family.”</p><br/><p>Acknowledging a master meant that Jiang Xie would be the master.</p><br/><p>Xie Xi didn’t consider these things at all. They weren’t simple but how could Xie Xi and Jiang Xie pay attention to this?</p><br/><p>However, Cancer knew nothing and was very concerned.</p><br/><p>It was true that there were many benefits but Jiang Xie told this to Xie Xi to let him understand the hidden dangers. He wasn’t willing to let Xie Xi suffer any grievances.</p><br/><p>He added, “You will lose your freedom if you acknowledge me as a master and can only stay with me.” This didn’t sound upsetting but it was still a confinement.</p><br/><p>Xie Xi’s heart softened and he whispered, “I won’t lose my freedom, you are my freedom.” Living with this person and being by his side forever was true freedom.</p><br/><p>It was because he knew he would chirp that Xie Xi could say this. Otherwise, how could Xie Xi say it with his thin skin?</p><br/><p>Jiang Xie really didn’t understand but he felt Little Chirp’s trust.</p><br/><p>“I’m sorry, I don’t want you to be in any danger. ”</p><br/><p>Without mentioning the benefits of acknowledging a master, he was worried about Little Chirp going mad.</p><br/><p>Xie Xi bowed his head to the palm below him. “Don’t think about it. It’ll be fine.”</p><br/><p>It wasn’t troublesome to acknowledge a master. If Xie Xi didn’t want to acknowledge a master then he wouldn’t drink the blood.</p><br/><p>One drop was enough to acknowledge a master.</p><br/><p>It was easy for the parties involved to judge the success. The immediately felt something different.</p><br/><p>It was as if there was an invisible rope tying the two people. Once one person moved further away, the rope would be stretched and there would be pain.</p><br/><p>It was necessary for them to always be together?</p><br/><p>Xie Xi felt quite good.</p><br/><p>He was too concerned about this person and wouldn’t need to be distressed about this person going far away.</p><br/><p>After acknowledging a master, the two people could finally communicate. Xie Xi’s words were still chirping but Jiang Xie could understand them, although the pronunciation was mixed with some chirping.</p><br/><p>For example, Xie Xi said, “I seem to have an ability.”</p><br/><p>Jiang Xie heard, “Chirp, there is an ability!”</p><br/><p>This soft voice entered the depths of his heart and Jiang Xie’s blood gauge emptied!</p><br/><p>Jiang Xie’s voice was infinitely soft. “What is it?”</p><br/><p>Xie Xi actually wanted to use the creation power as his ability but he felt that this fat body really had an ability and wanted to test it.</p><br/><p>It wasn’t pressing bodies under him. Who would think this was an ability?</p><br/><p>Xie Xi told him, “Stand a bit further away. I will use it.”</p><br/><p>He didn’t know he was chirping so once he saw the red tips of Jiang Xie’s ears, he wondered, ‘Is he so excited that we can communicate?’</p><br/><p>Xie Xi felt power surge inside him and tried to release it.</p><br/><p>Then…</p><br/><p>Jiang Xie laughed wildly.</p><br/><p>Xie Xi’s hairs stood up. What damn ability was this?!</p><br/><p>Once one person and one bird emerged, Yan Zhe knew that the acknowledgement of a master was successful.</p><br/><p>He was also curious. “Did Little Chirp gain an ability?”</p><br/><p>Jiang Xie’s lips curved gently as he nodded. “Yes.”</p><br/><p>Yan Zhe looked up at Xie Xi and asked, “What is the ability?”</p><br/><p>Xie Xi closed his eyes and pretended to be dead.</p><br/><p>Yan Zhe blinked.</p><br/><p>Jiang Xie comforted the small hairball. “It is a very interesting ability.”</p><br/><p>Yan Zhe was even more curious and coaxed the little tit. “What is it? Can you show me?”</p><br/><p>Xie Xi opened his eyes, gazed at the face of the future Milk God and used it again.</p><br/><p>Xie Xi’s hair shook and flashed with stars. The next moment, these stars turned into white roses and fell on Yan Zhe’s body.</p><br/><p>The silver-haired elf was beautiful and once the rose petals fell on his long hair, there was an amazing beauty.</p><br/><p>Yan Zhe was stunned for a while. “Just… just…”</p><br/><p>Jiang Xie picked up a rose flower that had fallen on Xie Xi. “Yes, just this.”’</p><br/><p>Xie Xi’s ability after acknowledging a master was to create rose flowers. There was no attack power or other effects apart from the beauty of the white roses.</p><br/><p>Yan Zhe also smiled. It was unknown how long it had been since he smiled bit the smile this time seemed to shine. “It is very good.”</p><br/><p>Only such a simple and clean little guy would activate such a gentle and cute ability.</p><br/><p>There was no lethality and would only bring joy and beauty to people.</p><br/><p>It was such a trash ability but these two seemed very happy?</p><br/><p>What was the use of this ability?</p><br/><p>Could he threw a handful of roses and give the enemy a beautiful death?</p><br/><p>Xie Xi was unhappy!</p><br/><p>This was clearly the skill that the unlucky Jiang Xie had obtained!</p><br/><p>It was just that everything he touched turned into roses while Xie Xi could create roses by shaking his feathers…</p><br/><p>There was no fighting power but Jiang Xie and Yan Zhe were very happy.</p><br/><p>He saw the two of them cheer up and Xie Xi reluctantly accepted it.</p><br/><p>In any case, he didn’t have to rely on this ability. He could use the god’s wisdom and sketch pen in critical moments.</p><br/><p>Yan Zhe really liked this little tit. He picked up the roses on the ground and carefully counted them. Then he reported to Xie Xi, “There are a total of 33. Little Chirp is really good.”</p><br/><p>Xie Xi endured the tone that was coaxing a child. After all, this was the future milk god and he had to maintain a good relationship!</p><br/><p>Xie Xi chirped steadily.</p><br/><p>Yan Zhe quickly glanced at Jiang Xie. “What did Little Chirp say?”</p><br/><p>Jiang Xie only heard chirping but he wanted to show that he knew more about Little Chirp so he translated, “He said there will be more next time.”</p><br/><p>Xie Shi: “???” This fake translator!</p><br/><p>Yan Zhe immediately blew up. “The ability becomes more powerful the more it is used. Little Chirp will be able to make more roses in the future!”</p><br/><p>Xie Xi wasn’t comforted. He had no interest in growing this ability.</p><br/><p>God Yan spoke again. “Since he creates roses, we can call him Little Rose!”</p><br/><p>Xie Xi, “………………”</p><br/><p>Sorry, he wasn’t interested in both names!</p><br/><p>The matter of acknowledging the master was finalized. Little Chirp’s cuteness went to a higher level and Yan Zhe’s spirit was refreshed.</p><br/><p>He gave a detailed account of the outside world and the current dangers.</p><br/><p>The disaster didn’t end after the earthquake. It was just the beginning.</p><br/><p>The entire Earth was like a game that was knocked down. It was messed up and had to be started again.</p><br/><p>The rise of the transformed people and variant beasts re-divided the strong and weak.</p><br/><p>At present, shelters were established in cities. The first batch of the transformed people explored the new rules of the world in the shortest possible time.</p><br/><p>The transformation was random and the ability obtained was all about luck.</p><br/><p>Some abilities were strong, some were weak, but strength wasn’t the only thing important.</p><br/><p>Those with a strong ability but no brains would die.</p><br/><p>Those with a weak ability but some brains were strong.</p><br/><p>Even if there were no changes, people could tame variant beasts. Most of the owners of variant beasts weren’t transformed but this didn’t affect their ability to communicate with the beasts and they gained a strong power.</p><br/><p>The reason why Yan Zhe hoped that Jiang Xie would quickly have Little Chirp acknowledge a master wasn’t just for the prevention of madness. He was also afraid that Little Chirp would be taken away by others.</p><br/><p>One of the rules was the beast’s will but the beasts were mostly simply. How could they resist the deception of humans?</p><br/><p>If they fell into the hands of a bad person then they would be tortured.</p><br/><p>There were dangers that stemmed from humanity itself and the external dangers never stopped.</p><br/><p>Yan Zhe said, “You must leave the farm in three days at the latest or you’ll be swallowed up by the black fog.”</p><br/><p>Jiang Xie’s eyes narrowed. “Black fog?”</p><br/><p>“Yes, after the earthquake, there is a black fog that constantly consumes everything. Anything swallowed up by it hasn’t come out. No one knows what is inside but death is inevitable.”</p><br/><p>Jiang Xie and Xie Xi really hadn’t known about this.</p><br/><p>Yan Zhe continued, “The black fog devours everything. It isn’t just the ground but the sky and the universe being swallowed up.”</p><br/><p>Jiang Xie’s pupils shrank. “Where can we go?”</p><br/><p>“Someone has guessed the spread of the black fog and the only destination is the last central point, which they call the Zone.”</p><br/><p>The Zone?</p><br/><p>Xie Xi was stunned.</p><br/><p>Central’s will?</p><br/>\n</div>"}