{"title": "Chapter 241 - Collapsing 10 Boundaries End", "id": 241, "volume": 3, "url": "http://boxnovel.org/game-loading-chapter-241-collapsing-10-boundaries-end", "volume_title": "Volume 3", "body": "<h1>Chapter 241 - Collapsing 10 Boundaries End</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Collapsing 10 Boundaries End</strong></p><br/><p>Jiang Xie’s eyes clouded over when he heard this and his voice was even colder. “Love?”</p><br/><p>Seeing his demeanour and hearing his tone, Xie Xi’s desperately swelling courage was like a broken balloon, popped in an instant.</p><br/><p>Jiang Xie leaned down and stared at him. “You are a succubus and the domain master of Lust. What do you know about love?”</p><br/><p>These questions completely extinguished the faint cluster of flames in Xie Xi’s heart.</p><br/><p>What was he expecting? What was he dreaming of?</p><br/><p>The man in front of him was the supreme god.</p><br/><p>Xie Xi didn’t make a sound and only bit his lips.</p><br/><p>Hundreds of years had passed and his appearance had long lost its tenderness and youthfulness. However, the enthusiasm in his bones hadn’t changed in the slightest. He was still the Xie Xi who didn’t want to be embarrassed and would prefer to face death if he didn’t meet the right person.</p><br/><p>The usual Jiang Xie couldn’t bear to see him like this. As long as Xie Xi could be happy, everything was fine. But today…</p><br/><p>Jiang Xie closed his eyes and whispered, “Don’t forget, you made a god’s oath.” He might’ve tricked Xie Xi to keep Xie Xi by his side but a god’s oath was still a god’s oath. Xie Xi couldn’t repent.</p><br/><p>A god’s oath, it was an oath to a god.</p><br/><p>Was Xie Xi afraid of this oath?</p><br/><p>He suddenly looked up, eyes full of rebellion. “So what?”</p><br/><p>Jiang Xie was dumbfounded and his face was completely blank.</p><br/><p>Xie Xi’s lips were pale but there was an angry blush on his face. “So what if I violate the oath?”</p><br/><p>“You don’t want to live?”</p><br/><p>Don’t want to live… don’t want to live… he shouldn’t have lived a few hundred years ago!</p><br/><p>Xie Xi finally understood what he had been waiting for, what he had been tangled up in and what he had clung to.</p><br/><p>He didn’t want to grow up because he wanted a faithful love!</p><br/><p>However, he couldn’t find it. If he couldn’t find it in the Demon World then he wouldn’t have hesitated to give up his life.</p><br/><p>Xie Xi hoarsely told Jiang Xie, “What is the meaning of living like this?”</p><br/><p>Jiang Xie’s eyes shrank but he only saw Xie Xi’s back as Xie Xi disappeared.</p><br/><p>The great hall was empty and Jiang Xie sat on the throne of the Demon God, nails digging into his palms.</p><br/><p>Sure enough, he shouldn’t be near this succubus.</p><br/><p>Just a few hundred years, it was only a few hundred years but those hundred years scattered in the blink of an eye. He…</p><br/><p>Xie Xi was disheartened. He not only refused to see Jiang Xie but also left behind all domain master matters.</p><br/><p>Lord Sloth, who had a good relationship with him, came to ask what was going on.</p><br/><p>Xie Xi directly quit his responsibilities.</p><br/><p>Sloth had never talked a lot. This time, he probably talked a year’s worth. “Why do you look like this? Is it that you don’t want to do anything without the Demon God’s favour. Is the Demon World in your eyes…”</p><br/><p>Xie Xi listened and his heart became more and more defeated.</p><br/><p>Other people could see his mind. Was it so obvious?</p><br/><p>Xie Xi shook his head and told Sloth, “I was busy as well. It is enough for the Demon World to have him. He never needed me.”</p><br/><p>Sloth couldn’t refute his words.</p><br/><p>Indeed… no matter the domain masters, the Demon World would thrive as long as there was the Demon God.</p><br/><p>Sloth sighed. “Why are you like this?”</p><br/><p>Xie Xi also wanted to know the reason why. Why was he dissatisfied with the status quo, why did he want to think about love?</p><br/><p>But he…</p><br/><p>Xie Xi told Sloth, “You will have to work hard in the future. I want to settle in the First Domain.”</p><br/><p>Sloth couldn’t persuade him. After all, Xie Xi wanted the Demon God but the Demon God was the entire Demon World. How could the noble god give him such private feelings?</p><br/><p>Xie Xi went to the First Domain, settled at the border and gazed at the distant Heaven.</p><br/><p>He fantasized about a life in Heaven. He imaged that Jiang Xie was an angel and he was also an angel. They didn’t have the shackles of identity and desire. They simply met and fell in love.</p><br/><p>So what if there wasn’t a long life? A short burst of love was enough for a lifetime.</p><br/><p>Xie Xi gazed at Heaven and immersed himself in his aimless fantasies.</p><br/><p>Meanwhile, Jiang Xie went to Heaven to investigate all the people Xie Xi had met during his visit.</p><br/><p>He didn’t know which angel Xie Xi had fallen in long with. He thought that everyone he saw was impossible and couldn’t think of who it might be.</p><br/><p>For a moment, he wanted to destroy all the angels who had seen Xie Xi to keep him under control.</p><br/><p>Nevertheless, it was useless. Xie Xi would only hate him.</p><br/><p>Jiang Xie left Heaven and saw the soulless Xie Xi in the First Domain.</p><br/><p>He hid his body and stood there, watching Xie Xi gaze at Heaven with a pair of beautiful eyes.</p><br/><p>Jiang Xie wasn’t surprised. If it wasn’t for the oath, Xie Xi would’ve already gone to Heaven.</p><br/><p>It was because he expected such a day that Jiang Xie spoke such conditions, thinking of at least tying this little succubus’ body to him.</p><br/><p>However, what was the use of this?</p><br/><p>Xie Xi didn’t look for anyone but he was no longer looking for Jiang Xie.</p><br/><p>They were so close but Xie Xi would never look at Jiang Xie again.</p><br/><p>Day after day passed and Xie Xi finally couldn’t stand it.</p><br/><p>The more beautiful the fantasy, the crueler the reality.</p><br/><p>He had left the Seventh Domain for so long but Jiang Xie hadn’t looked for him once.</p><br/><p>Jiang Xie was angry because Xie Xi overstepped.</p><br/><p>Xie Xi had worked had for many things and knew more than most demons, such as the reincarnation ceremony.</p><br/><p>He would use this to break free of all constraints and start a new life.</p><br/><p>He wasn’t willing to die timidly. He wanted to break away from the oath and let the Demon God know that not everything was as he thought and not everything was in his control. Xie Xi could resist him!</p><br/><p>Jiang Xie could stop Xie Xi’s reincarnation ceremony but what was the use?</p><br/><p>This was Xie Xi’s decision and Jiang Xie could never control him.</p><br/><p>Once Xie Xi started the ceremony, Jiang Xie stood beside him and watched him sleep, watching his body shrink as he changed from an adult succubus to a young child with a small tail.</p><br/><p>Xie Xi curled up in the formation and closed his eyes.</p><br/><p>Jiang Xie leaned over and picked him up, whispering, “Do you hate the Demon World that much?” The Demon World was Jiang Xie. If Xie Xi hated it so much then what was the meaning of Jiang Xie’s existence?</p><br/><p>Jiang Xie handed over the sleeping succubus and a white ball of light to Sloth.</p><br/><p>Sloth was surprised. “Lord Demon God, Xie Xi…”</p><br/><p>“Let him start a new life,” Jiang Xie stated. “I am tired and will hand over the Demon World to you.”</p><br/><p>Then Jiang Xie fell into the darkness.</p><br/><p>Since then, the Demon God never appeared and at the same time, a small angel called Jiang Xie appeared in the First Heaven.</p><br/><p>After his reincarnation, Xie Xi forgot everything, including his love.</p><br/><p>He became the Xie Xi who went to Heaven and found love.</p><br/><p>The memories came to an abrupt end.</p><br/><p>Xie Xi confirmed his own thoughts. Sure enough, Angel Jiang and the Demon God were the same person, making him breathe a sigh of relief. Then he thought about this dog blood misunderstanding and wanted to smash Jiang Xie!</p><br/><p>What a trash plot! What type of barren imagination?</p><br/><p>Was Xie Xi a half talker? Was he a man who couldn’t even confess? Why didn’t he straightforwardly say that he loved Jiang Xie? How many times did the ball fall on the racket?</p><br/><p>It seemed that the next ball would have to hit Jiang’s face, hard and ruthless. Let him have a bruised nose and face and see if he dared think about it!</p><br/><p>The memories of before the reincarnation could only be seen by Xie Xi. This time Jiang Xie saw it because he was with Xie Xi.</p><br/><p>At that time, Xie Xi had just been reborn and a little succubus in the shape of a child couldn’t accept the memories. Thus, the Demon God couldn’t see them.</p><br/><p>If he saw them then how could there be these crooked things?</p><br/><p>Of course… this was a ‘former setting’ and it only existed after Xie Xi entered the world.</p><br/><p>The angel who didn’t want to be the Demon God was still in a daze.</p><br/><p>Xie Xi glanced at him.</p><br/><p>Jiang Xie’s senses returned. “You always loved me…”</p><br/><p>He saw all this and understood the great misunderstanding. Xie Xi loved him and only him.</p><br/><p>Years ago, he would rather die than be casually with people, yet he was together with Jiang Xie.</p><br/><p>He went to Heaven where he didn’t meet someone he loved. He just watched a public welfare movie and understood his own heart, understanding that he always loved Jiang Xie.</p><br/><p>Then Jiang Xie said something like that to him…</p><br/><p>Jiang Xie was flustered. “I thought you fell in love with another person. I thought you wanted to leave me, I…”</p><br/><p>He explained, hated his own misunderstanding of Xie Xi and hating himself for making a mess of things.</p><br/><p>Xie Xi was angry but let it when he thought that these bad setting was due to the negative feelings caused by the collapsing world.</p><br/><p>“I also wasn’t good…” Xie Xi told the other person. “I didn’t make things clear.”</p><br/><p>“You worked hard, you…”</p><br/><p>A succubus and the domain master of lust, how much courage did it take to speak about love to the Demon God? Not only was this opening up his own heart, it was overthrowing faith and subverting the nature of a succubus. He must’ve felt completely desperate.</p><br/><p>Yet Jiang Xie thought Xie Xi said those things because of another person…</p><br/><p>Xie Xi sighed. “I didn’t expect you to love me.”</p><br/><p>Jiang Xie hated himself even more. “Compared with your courage, I am really weak.</p><br/><p>He liked his little succubus since the first moment they met. However, he hesitated for so long and tied Xie Xi to him with a vile oath, giving their supposedly pure love a bad start.</p><br/><p>Xie Xi gave up on blaming Jiang Xie. After all, this wasn’t Jiang Xie’s fault but the fault of the collapsed world.</p><br/><p>Anyone left behind will feel despair.</p><br/><p>Xie Xi was once a person who was left behind and could understand.</p><br/><p>Xie Xi looked up at him and asked, “I loved in the last love and I still love you in this life. Then… do you love me?”</p><br/><p>Jiang Xie stared at him and spoke the long-hidden feelings. “I love you.”</p><br/><p>Xie Xi kissed him and the two people left this world with the sweet kiss.</p><br/><p>Back in the rose garden, Xie Xi saw the sleeping Gemini.</p><br/><p>He sat for a moment and calmed down.</p><br/><p>This world was actually really simple.</p><br/><p>The previous summary might be very dog blood but the result was excellent. As long as it was watched to the end, Xie Xi didn’t have to do anything and the misunderstanding would be lifted.</p><br/><p>Xie Xi carefully reviewed it and found that this was actually Jiang Xie helping himself.</p><br/><p>When Xie Xi first entered, he met Angel Jiang and Angel Jiang was the Demon God whose memory was sealed.</p><br/><p>Xie Xi fell in love with the angel and afterwards, the two people went to the Demon World. The Demon God thought that Xie Xi really loved Heaven so he didn’t want to be the Demon God. He just wanted to be a real angel and be together with Xie Xi.</p><br/><p>This led to the collapse of the Demon World.</p><br/><p>At the same time, the Demon God also left a back door for himself, which were the memories before reincarnation.</p><br/><p>As long as Xie Xi watched them with Jiang Xie, Jiang Xie would no longer disregard the identity of the Demon God and the Demon World naturally wouldn’t collapse.</p><br/><p>Rather than say that Xie Xi repaired the world, it was better to say that Jiang Xie was trying to save himself.</p><br/><p>Was this the consciousness of the soul or was Jiang Xie finally able to interfere in the small worlds?</p><br/><p>Xie Xi didn’t know but he was happy either way!</p><br/>\n</div>"}