{"title": "chapter 249 - Collapsing 9 Boundaries 8", "id": 249, "volume": 3, "url": "http://boxnovel.org/game-loading-chapter-249-collapsing-9-boundaries-8", "volume_title": "Volume 3", "body": "<h1>chapter 249 - Collapsing 9 Boundaries 8</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p></p><h3>Chapter 249: Collapsing 9 Boundaries 8</h3><br/><p>What was this devil physique?</p><br/><p>Xie Xi was shocked.</p><br/><p>Yan Zhe’s next demonstration was even more terrible. He poured a glass of water onto soil and wiped the soil on his face.</p><br/><p>The contrast between skin and mud was so clear that people couldn’t help stopping to look.</p><br/><p>However, it wasn’t necessary.</p><br/><p>Whether it was digging up mud or painting it on his face, it was like there was a film. The slimy mud didn’t leave any traces on his hands and face.</p><br/><p>The hand could pick up the mud but the face was more exaggerated. It would slip down just after application, the mud falling to the ground and unceremoniously printing a large face on the ground.</p><br/><p>Xie Xi’s eyes widened and he couldn’t help letting out an exclamation that entered the ears of others as a chirp.</p><br/><p>Jiang Xie didn’t expect there to be such a physique.</p><br/><p>Yan Zhe explained, “My hair can’t be cut and my body won’t be stained by any dirt.”</p><br/><p>He had been tortured for so long, hated his situation and thought about resisting and running away. It was just that his constitution was too poisonous and he couldn’t change his appearance. Everyone could recognize him with one glance.</p><br/><p>Don’t mention the long silver hair and snow-like skin, his face alone was unforgettable.</p><br/><p>It was too easy to recognize him.</p><br/><p>It was reasonable that Yan Zhe’s physique was so powerful. It was probably the principle of full healing. His blood could not only heal others but also himself. Therefore, his hair could be recovered and his skin protected from infestation. Perhaps the circulation of blood allowed him to recover from any dirt instantly and he couldn’t be dirty in the eyes of others.</p><br/><p>It was highly likely that the Central Yan Zhe also had such a physique. It was precisely because of this physique that he could become a god-level player with the class of healer.</p><br/><p>It was true that God Yan in the Central Government was strong enough to protect himself but what about the initial stages?</p><br/><p>What about Yan Zhe who had this physique but was still weak?</p><br/><p>He must’ve suffered as well.</p><br/><p>After seeing this, Jiang Xie was keenly aware of something strange. “Didn’t Little Chirp’s roses fall on your hair?”</p><br/><p>How did the white roses get stuck in the hair?</p><br/><p>Yan Zhe felt even more helpless and embarrassed. “Good things can…”</p><br/><p>Jiang Xie, “…”</p><br/><p>Yan Zhe glanced at Xie Xi and continued, “Little Chirp’s roses look very good and they are like jewellery on the hair…”</p><br/><p>It could be seen that the physique was like Mary Sue but the essence of God Yan was a pure man. Thus, he was dying of embarrassment when he described it.</p><br/><p>Xie Xi was also speechless.</p><br/><p>What was this toxic power?</p><br/><p>Wasn’t it only the legendary fairy women who were like this?</p><br/><p>There were too many things that Xie Xi didn’t know where to start from!</p><br/><p>Jiang Xie was also speechless. If this was the icing on the cake…</p><br/><p>Yan Zhe was already eye-catching. If Little Chirp’s beautiful rose was added…</p><br/><p>Even if his blood couldn’t save people, Yan Zhe would still face many setbacks.</p><br/><p>In view of his real tragedy, Jiang Xie’s attitude towards him changed greatly. Yan Zhe’s situation was even more helpless for Xie Xi. There were many ways to make people act politely…</p><br/><p>It wasn’t that the god’s wisdom couldn’t do it. Xie Xi hadn’t been exposed to this type of product and couldn’t create it.</p><br/><p>It was no wonder why Yan Zhe wanted to give up. Walking into the Zone full of people was like walking into the black fog.</p><br/><p>However, after the battle, the surviving Yan Zhe’s mental state changed a lot. He picked up the weapon he previously used and asked Xie Xi, “Is this done by Little Chirp?”</p><br/><p>Jiang Xie also wanted to know this. His long knife had been damaged as early as when he killed the first monster. Fortunately, Little Chirp gave him new weapons or they would’ve died a long time ago.</p><br/><p>Xie Xi nodded. “Yes.”</p><br/><p>Yan Zhe heard him say, “Chirp meow.”</p><br/><p>Jiang Xie heard, “Chirp.”</p><br/><p>Both men were stunned and the complicated mood they were felling was swept away.</p><br/><p>Yan Zhe was really reluctant to separate from this big hairball and asked again, “It seems that Little Chirp can’t only create roses but also other things?”</p><br/><p>This was a good reason!</p><br/><p>He had only created roses previously but this didn’t mean it could only be roses. Other miscellaneous things were also okay.</p><br/><p>Xie Xi patched up his ability. “I was worried about you and wanted to help.”</p><br/><p>Jiang Xie translated for Yan Zhe and Yan Zhe was so moved he wanted to touch the round hairball.</p><br/><p>Jiang Xie separated them and his eyes told Yan Zhe, ‘Please have some self-respect.’</p><br/><p>Yan Zhe wanted to sneak a touch but he couldn’t. Who let Little Chirp not belong to him?</p><br/><p>Jiang Xie asked Xie Xi, “Do you have any special feelings when using your ability?” It was a bit unsettling to create things out of thin air. He was afraid that Xie Xi would have to pay something for it according to the law of conservation of energy.</p><br/><p>Xie Xi replied, “I’m fine, only my wings are tired.” He couldn’t lift them up!</p><br/><p>Jiang Xie gently massaged the large wings.</p><br/><p>Xie Xi spoke again, “I drank Yan Zhe’s blood and feel much better.”</p><br/><p>Jiang Xie heard Yan Zhe’s name and wasn’t happy. This tone felt a bit intimate…</p><br/><p>Jiang Xie’s heart was moved. If Little Chirp called out his name, what would it be like?</p><br/><p>However, Yan Zhe was in front of him and he didn’t dare ask. He could only endure it first.</p><br/><p>Yan Zhe wasn’t able to understand these words but he felt Xie Xi’s eyes on him and asked, “What did Little Chirp say?”</p><br/><p>Jiang Xie started to mix private words into his translation. “He said he is tired and wants to sleep.”</p><br/><p>Yan Zhe was surprised. “He is still tired after drinking my blood? Maybe he is too big and needs to drink more…” He cut his wrist as he spoke.</p><br/><p>Xie Xi was shocked!</p><br/><p>Jiang Xie stopped him by saying, “It’s fine, he just needs to sleep. Don’t use your blood.”</p><br/><p>Xie Xi hurriedly shook his head and explained, “I was just thanking you!”</p><br/><p>Yan Zhe stared at the lying Jiang Xie.</p><br/><p>Jiang Xie frowned but didn’t dare fool the idiot. “Little Chirp said thank you.”</p><br/><p>Yan Zhe realized something and cast a suspicious look at Jiang Xie. “Are you messing around with the translation?”</p><br/><p>God Yan managed to find the essence of this guy!</p><br/><p>Xie Xi nodded violently like a chicken pecking at rice. Sorry, it was a giant chicken!</p><br/><p>It seemed that Jiang Xie was born with this thick-skinned nature and his expression didn’t change. “Sometimes there are mistakes.” There were at least three chirps in a sentence, causing his ears to chirp. It was understandable that he would get some things wrong.</p><br/><p>Xie Shi and Yan Zhe: “…”</p><br/><p>Yes, this young Cancer had the prototype of the stinky Old Jiang in Central!</p><br/><p>It was the middle of the night and they definitely needed a good rest.</p><br/><p>Jiang Xie didn’t mention the matter of going to the Zone again. Xie Xi was still a bit worried and afraid that Yan Zhe would run away in the middle of the night.</p><br/><p>One person and one bird returned to the bedroom and Jiang Xie stared at him. “Do you care that much about him?”</p><br/><p>Why was there the taste of a husband going home, only for the wife to ask about the perfume smell?</p><br/><p>Xie Xi was speechless. Was Cancer’s sense of possession that strong?</p><br/><p>Besides, he was a little… big bird and acknowledged Jiang Xie as his master. What was this damn person so worried about?</p><br/><p>Xie Xi opened his mouth. “Dad said that many friends will lead to more roads.”</p><br/><p>Jiang Xie’s eyes drooped gently.</p><br/><p>Xie Xi felt a bit of regret. It was true that these words could appease Jiang Xie but it would also remind him of the grief in his heart.</p><br/><p>Father Jiang had mentioned such a thing. Jiang Xie had gone to school and he talked to himself and Xie Xi.</p><br/><p>Jiang Xie leaned close to the huge hairball. “It is enough if I have you.”</p><br/><p>He couldn’t be greedy. He just wanted to protect his last family member.</p><br/><p>Friends were too fragile.</p><br/><p>Xie Xi sighed and patted the other person with his big wings. “However, he is already our friend.”</p><br/><p>They were in the same boat and suffering together. Wasn’t this friendship?</p><br/><p>There was no talking about friendship but it was already there.</p><br/><p>Jiang Xie’s back was stiff and he whispered, “Don’t worry, he won’t give up on you.” His tone seemed a bit sour.</p><br/><p>It was convenient that they could communicate with each other.</p><br/><p>Jiang Xie expressed the doubts in his heart. “Those knives and guns… did you make something else?”</p><br/><p>In fact, Xie Xi wanted to pretend that this was Jiang Xie’s power. Since they would always be together, it wasn’t a problem to pretend that the shield was Jiang Xie’s power.</p><br/><p>It was just that Jiang Xie was clever and wasn’t easy to fool.</p><br/><p>Xie Xi nodded. “Yes.”</p><br/><p>Jiang Xie stared at him with narrowed eyes. “Did you do it before acknowledging me as a master?”</p><br/><p>Xie Xi saw this person wanted to debunk the reason for helping Yan Zhe and could only say, “At the time, I was afraid you would have an accident. I wanted something to protect you and there was a transparent eggshell.</p><br/><p>The space shield was very much like an eggshell.</p><br/><p>Jiang Xie’s eyes slightly curved and he said thank you before continuing, “It seems that this ability was gained before acknowledging the master.”</p><br/><p>Xie Xi nodded.</p><br/><p>Jiang Xie wondered, “After acknowledging the master, did you gain an ability other than creating roses?”</p><br/><p>Xie Xi, “…”</p><br/><p>He was too lazy to mention this ability. It was useless and full of a non-lucky person’s characteristics. Xie Xi suspected this was the welfare that came from acknowledging Jiang Xie as a master!</p><br/><p>Jiang Xie told him, “Don’t tell anyone about this, including Yan Zhe.”</p><br/><p>Xie Xi understood that it wasn’t about not trusting someone. It just wasn’t necessary.</p><br/><p>Many times, saying things that shouldn’t be said harmed not only themselves but also others.</p><br/><p>Xie Xi should say, “I understand.”</p><br/><p>Jiang Xie heard, “I chirp” and couldn’t help laughing. It was good to hear this lovely voice.</p><br/><p>Xie Xi didn’t know about this and asked, “Why are you laughing?”</p><br/><p>Jiang Xie’s lips were still curved. “It’s nothing.”</p><br/><p>Xie Xi cared about him. “What about your ability?”</p><br/><p>There were two battles and Jiang Xie didn’t show any special ability. He just had a good physique and high strength.</p><br/><p>As for fighting skills, Xie Xi thought it likely came from the main soul. After all , Cancer was only a high school student.</p><br/><p>An ability was just an ability and experience was irrelevant.</p><br/><p>Jiang Xie replied, “I don’t know either.”</p><br/><p>Xie Xi asked, “Do you feel any force surging in your chest?” It felt like this when he created roses.</p><br/><p>Jiang Xie shook his head. “No, I feel no different from before.”</p><br/><p>Xie Xi was silent. This senior unlucky person, was there no change?</p><br/><p>Xie Xi felt he had poked at the truth.</p><br/><p>He cried out, “It’s okay. You’re strong now!”</p><br/><p>Jiang Xie wasn’t worried. Perhaps it was due to Yan Zhe’s physique but Jiang Xie felt it was good that he hadn’t completely changed. He never had good luck and if he really changed then it might be more pitted than Yan Zhe’s ability.</p><br/><p>Based on the sky, it wasn’t too early. They should rest and start on the road tomorrow.</p><br/><p>Before going to bed, Jiang Xie couldn’t help telling Xie Xi, “Call out my name.”</p><br/><p>Xie Xi, “…” What was this for?</p><br/><p>Jiang Xie leaned against the wings so Xie Xi couldn’t see him. “You know, my name.”</p><br/><p>Xie Xi certainly knew it. “Jiang Xie.”</p><br/><p>Jiang Xie, “…”</p><br/><p>Chirp Xie was indeed a hundred times better than Chirp Zhe.</p><br/>\n</div>"}