{"title": "chapter 248 - Collapsing 9 Boundaries 7", "id": 248, "volume": 3, "url": "http://boxnovel.org/game-loading-chapter-248-collapsing-9-boundaries-7", "volume_title": "Volume 3", "body": "<h1>chapter 248 - Collapsing 9 Boundaries 7</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 248: Collapsing 9 Boundaries 7</p><br/><p>In a sense, the Central Government was also a sanctuary. It was a sanctuary for homeless ‘players’ abandoned by their original world.</p><br/><p>Players called the will of the Central World by the name ‘Zone.’ It was the same for god-class players like God Yan, even calling it Old Z.</p><br/><p>Xie Xi hadn’t spent much time in Central but he understood a lot about it. After all, Jiang Xie could be called the man closest to the Central Government.</p><br/><p>Jiang Xie told him things and Xie Xi also had his own understanding of the Central Government.</p><br/><p>However, there was no need to think too much. The last shelter of humanity was called the Zone. There was nothing wrong with this since this world was designed by Jiang Xie. From his point of view, it was normal to set this up.</p><br/><p>Fortunately, Xie Xi’s expression was dull no matter what he was thinking. This meant Jiang Xie and Yan Zhe were still ignorant as they talked about the status quo.</p><br/><p>Jiang Xie asked, “Is the Zone safe?”</p><br/><p>Yan Zhe shook his head. “No one knows but it is the furthest place from the black fog.”</p><br/><p>Even if the entire world was engulfed by the black fog, it was the last space.</p><br/><p>Jiang Xie was a person accustomed to facing disasters. “The black fog really can’t…”</p><br/><p>Yan Zhe interrupted him. “Don’t rush to try it. It is like death. No one knows what the world is like afterwards because the dead can’t speak.”</p><br/><p>Jiang Xie was silent.</p><br/><p>These words were very appropriate. There was probably no one alive who wasn’t curious about death, but this curiosity had no solution because death was a road of no return.</p><br/><p>Yan Zhe looked back at Xie Xi, reaching out to touch his soft hair. “Take Little Chirp to the Zone. You should be able to protect yourself.”</p><br/><p>Xie Xi stared at him. “What about you?”</p><br/><p>Jiang Xie helped Xie Xi translate this chirp.</p><br/><p>A faint smile appeared on Yan Zhe’s pale face. “I don’t want to see anybody.”</p><br/><p>Yan Zhe explained his experiences in a calm tone.</p><br/><p>He was also a transformed person. Before the earthquake, he was just a normal human. It was the transformation that made him look like he did now and his blood had the terrible power to return people from the dead.</p><br/><p>Don’t talk about a world of disaster. Even in a normal world, his ability could stir up the cruellest desires in the heart.</p><br/><p>What seriously injured person would want to die? Who would let a seriously injured relative die?</p><br/><p>There were so many such people but Yan Zhe’s blood was limited.</p><br/><p>Just as everyone was suffering in a dark and cold night, Yan Zhe was a weak flame. People knew that the flames didn’t shine all over the world but they still went crazy over it.</p><br/><p>Yan Zhe faced such a situation from the earthquake to the present. It was a short period of time but the humanity he witnessed was so ugly that he lost hope for everything.</p><br/><p>He didn’t want to see anyone and couldn’t believe in anyone. However, the only shelter had countless people gathered. For Yan Zhe, this final refuge was more terrible than the black fog approaching. Thus, he wanted to stay.</p><br/><p>How could Xie Xi leave him? He moved his body and placed the silver-haired elf under his big wings.</p><br/><p>Yan Zhe was stunned.</p><br/><p>Xie Xi cried out, “Go together, I’ll protect you!”</p><br/><p>How could he let God Yan suffer such grievances when he had the god’s wisdom?</p><br/><p>Jiang Xie frowned.</p><br/><p>This time no translation was needed as Yan Zhe understood himself. He glanced at Jiang Xie and asked, “Little Chirp… he…”</p><br/><p>Jiang Xie reluctantly explained the chirp, “He wants to protect you.”</p><br/><p>Yan Zhe froze before smiling with red eyes. He looked up at Xie Xi and spoke in a hoarse voice, “Silly Little Chirp.”</p><br/><p>Xie Xi, “………………”</p><br/><p>He was very serious. How could anyone touch Yan Zhe when he had his space shield?</p><br/><p>Jiang Xie became even unhappier. His frown deepened as he lifted the fat wings and pulled out the silver-haired elf.</p><br/><p>Yan Zhe wasn’t angry. if he had such a big baby then he would also keep everyone away.</p><br/><p>Xie Xi’s current appearance wasn’t convincing so he gazed at Jiang Xie with small, black eyes, waiting for Jiang Xie’s position.</p><br/><p>Jiang Xie asked, “Do you like him that much?”</p><br/><p>Hey? What was this smell of vinegar?</p><br/><p>Xie Xi was alert. ‘Professor Jiang, aren’t you bring vinegar into every world in a bag?’</p><br/><p>Xie Xi replied, “Yan Zhe is very strong.”</p><br/><p>The words that entered Jiang Xie’s ears were, “Chirp Zhe is very powerful!”</p><br/><p>What was Chirp Zhe? Are they so close?</p><br/><p>Of course, Jiang Xie wasn’t an unreasonable person. He wasn’t happy but he wouldn’t abandon Yan Zhe.</p><br/><p>He was wondering if Yan Zhe could cut his hair…</p><br/><p>Then Yan Zhe suddenly stood up. “There are monsters!”</p><br/><p>He just finished speaking these words when there was a whistling sound from outside.</p><br/><p>It was too loud, like a tornado had struck. Xie Xi quickly summoned the god’s wisdom and sketch pen.</p><br/><p>After getting bigger, he could draw things with the ketch pen. The pen’s requirements were very low. When he was a cat, he could draw things with his mouth, let alone when he had the big wings.</p><br/><p>Xie Xi was fast but the outside monsters were faster!</p><br/><p>In the blink of an eye, the door had been broken into pieces and the awakened livestock screamed. They struggled to get out of the fence and stay away from this huge danger.</p><br/><p>However, the screams soon disappeared, as if the pause button had been pressed.</p><br/><p>It was bizarre and an even bigger shock to the people staying in the room.</p><br/><p>Xie Xi couldn’t care too much. He hastily drew three space shields and placed them around the three of them.</p><br/><p>In fact, this wasn’t wise. The space shield had a time limit and the monsters hadn’t been seen yet. What if they couldn’t kill the monsters in such a short period of time?</p><br/><p>Still, this couldn’t be helped. Xie Xi had a hunch that the monsters entering were fatal!</p><br/><p>Sure enough, once the black fog appeared in front of them, sharp and poisonous thorns came towards them.</p><br/><p>It was absolutely impossible to hide from it. Yan Zhe’s face was pale and Jiang Xie threw the knife without hesitation.</p><br/><p>He might not be able to keep his own life but he could drag the enemy down to hell.</p><br/><p>Xie Xi was very lucky. His space shields perfectly blocked this first wave of attacks.</p><br/><p>Yan Zhe and Jiang Xie obviously didn’t understand what was going on. Why was it blocked?</p><br/><p>Was there something invisible in front of them?</p><br/><p>Jiang Xie’s reaction was extremely fast. He remembered the situation where he was about to die only for something in front of him to block the deadly bullet.</p><br/><p>He couldn’t think about what was happening right now.</p><br/><p>Jiang Xie picked up the long knife that had fallen and leapt.</p><br/><p>He was a transformed person. Although he might not know his ability, the most important thing right now was survival. He was totally dependent on the instinct to survive and attacked this terrible monster with fierceness.</p><br/><p>Xie Xi saw what the monster looked like.</p><br/><p>He recognized it instantly. It was a monster that had appeared in Wonderful Painting of the Mountains and Seas.</p><br/><p>Before the flower god drew the world, the world was a mess and in the chaos, these monsters devoured countless creatures.</p><br/><p>White Tiger’s mother had died from this monster.</p><br/><p>Now they appeared in Cancer’s world.</p><br/><p>It was true that this was Jiang Xie’s quasi-world and he might design the same monster, but…</p><br/><p>Xie Xi couldn’t help thinking that this monster had given Jiang Xie major trauma, which was why he had such an obsession.</p><br/><p>He didn’t think that there was more than one of this monster. The momentum was continuous and they kept trying to kill the trio!</p><br/><p>It wasn’t the first time Yan Zhe had seen this monster. He exclaimed, “Attack its mouth. That is its only weakness!”</p><br/><p>This group of black things had no body but there was a big mouth with white teeth in the middle. The previous thorns had shot from this place.</p><br/><p>Jiang Xie heard this just as a monster with a mouth full of white teeth tried to bite him…</p><br/><p>Xie Xi knew that the effect of the space shield was present but he still felt shocked when he saw that Jiang Xie was going to be eaten in one bite.</p><br/><p>The next second, Jiang Xie’s long knife pierced the monster’s mouth.</p><br/><p>There was a sharp sound like sandpaper grinding and the monster disappeared into black fog.</p><br/><p>However, this wasn’t the end. It was just the beginning…</p><br/><p>There was a cloud of darkness outside. It was unknown how many monsters were present!</p><br/><p>Xie Xi had his experience as a president and drew many hot weapons that even the weak Yan Zhe could use.</p><br/><p>Yan Zhe choked when he saw the weapons that fell to the ground.</p><br/><p>Xie Xi shouted, “Use this!”</p><br/><p>Yan Zhe didn’t think too much. He picked one up and started crazily shooting the black monsters.</p><br/><p>He wasn’t used to it and wasn’t sure if he could use it. Yet in such a critical moment, he would never give up as long as there was hope!</p><br/><p>Jiang Xie understood Xie Xi’s words. He doubted the origins of these weapons but he couldn’t pause too much. He quickly picked one up and started shooting.</p><br/><p>This was a war. Once all the black monsters were gone, the three people were exhausted… oh, it was two people and one bird.</p><br/><p>The space shield wasn’t continuous so the last part was particularly dangerous. They were all stabbed by the thorns.</p><br/><p>Fortunately, it wasn’t that much and the effect was very weak. There were no problems.</p><br/><p>Xie Xi couldn’t move at all. There was no limit to the use of the god’s wisdom but his body had limits.</p><br/><p>His fat physique meant his constant movement of the wings exhausted him.</p><br/><p>He was still a small tit in essence and his strength hadn’t increased much.</p><br/><p>Yan Zhe’s physique was also wonderful. He was stabbed and his body bled, but his blood healed the wounds and he was unscathed.</p><br/><p>He was also very tired but he insisted on walking to Xie Xi and raising his wrist to Xie Xi’s mouth.</p><br/><p>Xie Xi couldn’t move. A cool and fragrant blood flowed into his mouth. In an instant, he felt no pain from his wounds and even recovered some physical strength.</p><br/><p>Yan Zhe’s blood… it was amazing!</p><br/><p>He saw that Xie Xi was fine and came to Jiang Xie.</p><br/><p>Jiang Xie refused. “It’s fine.”</p><br/><p>Yan Zhe was astonished.</p><br/><p>There was no need to talk about Jiang Xie’s physique. Xie had become a waste while Jiang Xie was the main fighting force yet he could still stand up.</p><br/><p>He went to check Xie Xi’s situation first and then gave his own wounds simple treatment.</p><br/><p>Yan Zhe spoke in a tired manner, “My blood can help you recover…”</p><br/><p>Jiang Xie squinted at him. “If you don’t save anyone, no one will know you have this ability.”</p><br/><p>Yan Zhe was stunned.</p><br/><p>Jiang Xie patted the dust off Xie Xi’s body and told Fat Chirp, “Don’t be foolish in the future. I can avoid it myself.” The thorn that pierced Xie Xi’s body had been for Jiang Xie.</p><br/><p>Xie Xi told him, “I’m fine.”</p><br/><p>Jiang Xie heard, ‘It’s nothing chirp.’</p><br/><p>Jiang Xie’s heart was soft and his eyes were full of gentleness. “You must protect yourself. This is an order.”</p><br/><p>Xie Xi sighed and protected this person under his wings.</p><br/><p>Jiang Xie was warmed by the fluff and his heart also became hot.</p><br/><p>Yan Zhe got up and said, “Drink it. If there is any more danger, we need to be able to last.”</p><br/><p>Jiang Xie stared at him. “If you don’t use your ability on anyone, cut your hair, cover your face with a bit of dust and hide your ears with a hat…”</p><br/><p>Jiang Xie wanted to speak but his words were interrupted by a monster.</p><br/><p>Yan Zhe was afraid of humans and didn’t want to see anyone, but he would inevitably see people if he kept living.</p><br/><p>Rather than dying timidly, it was better to live in a different way.</p><br/><p>What if he didn’t show the ability? It was enough to get a makeover and start over.</p><br/><p>Jiang Xie’s idea was right but Yan Zhe’s smile was bitter. “No, I’ve tried.”</p><br/><p>He picked up the long knife from the ground and cut off his long, silver hair.</p><br/><p>Xie Xi watched curiously and found that the cut off long hair quickly returned to its original appearance, as if it had never been cut off.</p><br/><p>Yan Zhe went to touch the dirty ground. Miraculously, his white fingers didn’t show even a trace of dust…</p><br/>\n</div>"}