{"title": "Chapter 256 - Collapsing 9 Boundaries End", "id": 256, "volume": 3, "url": "http://boxnovel.org/game-loading-chapter-256-collapsing-9-boundaries-end", "volume_title": "Volume 3", "body": "<h1>Chapter 256 - Collapsing 9 Boundaries End</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Collapsing 9 Boundaries End</strong></p><br/><p>Resistance? Why did he have to resist? What was he fighting against? Was it because he thought of leaving?</p><br/><p>Xie Xi seemed to capture something but before he could think about it, he heard the conversation between Jiang Xie and Yan Zhe.</p><br/><p>Yan Zhe whispered, “Is Little Chirp sleeping?”</p><br/><p>Xie Xi was staying in Jiang Xie’s chest pocket and just woke up. Of course, Jiang Xie didn’t know he had woken up since he would normally poke out his head or look at the scenery from Jiang Xie’s head.</p><br/><p>Jiang Xie nodded and said, “He is still sleeping.”</p><br/><p>It was still early and Little Chirp usually wasn’t awake at this time.</p><br/><p>Yan Zhe obviously wanted to talk to Jiang Xie. Xie Xi pricked his ears and wanted to hear what they were talking about.</p><br/><p>He heard Yan Zhe say, “What are you thinking?”</p><br/><p>Jiang Xie froze.</p><br/><p>Yan Zhe opened his mouth, “I know that you like Little Chirp but he is..”</p><br/><p>Xie Xi didn’t expect them to be talking about this.</p><br/><p>Jiang Xie replied, “I think he is good.”</p><br/><p>Yan Zhe felt that their feelings were extraordinary and he naturally didn’t want to see them sad. He said, “Little Chirp definitely doesn’t understand your heart.”</p><br/><p>“It doesn’t matter if he doesn’t understand. I’ll always be with him.”</p><br/><p>Yan Zhe sighed. “That is all you want to do?”</p><br/><p>Jiang Xie’s eyes narrowed. “He is still small.”</p><br/><p>“He is a bird. Such an adult bird can have children.”</p><br/><p>Jiang Xie frowned. “He has just adapted to his human form…”</p><br/><p>Yan Zhe told him, “That’s why I hope you will think clearly.”</p><br/><p>Jiang Xie was silent.</p><br/><p>Yan Zhe continued, “Little Chirp can’t leave you even if he becomes a person. The master’s contract is acknowledged but he doesn’t understand. Do you know?”</p><br/><p>Yan Zhe’s intentions were good. He hoped that Jiang Xie would understand his own heart and teach Xie Xi these things. He hoped Jiang Xie could be together with the beauty instead of dragging things out like this.</p><br/><p>However, Xie Xi also understood Jiang Xie. ‘God Yan, your words are too ambiguous and a certain someone won’t understand!’</p><br/><p>Sure enough, Jiang Xie turned slightly pale. “There is no need to say anymore. I understand.”</p><br/><p>Xie Xi inwardly cried out, ‘What do you understand?’</p><br/><p>Yan Zhe apparently overestimated Jiang Xie as he said, “I’m glad you understand.”</p><br/><p>Xie Xi once again directed to Yan Zhe, ‘What damn thing does he understand?’</p><br/><p>It was a pity that no one could hear Xie Xi’s voice.</p><br/><p>Did this world require falling in love? He had to be in love with Jiang Xie or even marry to form a family?</p><br/><p>Due to their conversation, the inexplicable emotion that Xie Xi felt faded away and it was very difficult to capture it again.</p><br/><p>Xie Xi had talked about love many times and was experienced.</p><br/><p>It wasn’t easy to get married? He could do it in minutes!</p><br/><p>Xie Xi soon found a natural and excellent opportunity.</p><br/><p>People had been rebuilding homes for so long that their interpersonal relationships eased.</p><br/><p>Jiang Xie and Yan Zhe also had neighbours.</p><br/><p>They helped each other a lot so after building the house, the neighbours invited them to visit.</p><br/><p>It was difficult to find such kindness so they got along with each other.</p><br/><p>The neighbours were a young couple on a picnic in the park when the earthquake occurred. They were lucky to survive but unfortunately, there were no other family members.</p><br/><p>They were both transformed people but they weren’t very strong. The man could simply separate the air while the woman’s hands heated up enough to fry fish.</p><br/><p>There were many transformed people like this and they were doomed to be ordinary people in the post-disaster world.</p><br/><p>Still, ordinary people had the happiness of ordinary people. They didn’t ask for much apart from a home and a stable life.</p><br/><p>The female, Li Qianyi’s palms could heat up but the male was the chef.</p><br/><p>Jiang Xie and Yan Zhe sat together while Xie Xi also had a small seat.</p><br/><p>Li Qianyi liked Xie Xi and prepared various types of nuts for him. Little Chirp was very happy.</p><br/><p>They took care of Xie Xi so Jiang Xie and Yan Zhe were in a good mood. They happily ate the meal.</p><br/><p>The male host opened a bottle of wine and Jiang Xie and Yan Zhe followed him in drinking.</p><br/><p>After drinking, their relationship became closer. Li Qianyi was a lively person and her gaze turned to Jiang Xie and Yan Zhe. She asked with the courage from the wine, “Are you lovers?”</p><br/><p>Her husband knew that his wife was drunk and rushed to stop her.</p><br/><p>Her question frightened the bird opposite her.</p><br/><p>Xie Xi jerked. What the hell?</p><br/><p>On the other hand, the two parties involved were very calm. Yan Zhe’s lips thinned and he tilted slightly away from Jiang Xie. “I don’t like men.”</p><br/><p>Jiang Xie was more poisonous as he pointed to Little Chirp, “I like him.”</p><br/><p>The young couple, “???”</p><br/><p>The straight Yan Zhe added, “Yes, he likes Little Chirp.”</p><br/><p>Li Qianyi was grabbed by her husband and she sobered up, speaking with some embarrassment, “Ha, haha, I drank too much and talked nonsense.”</p><br/><p>Xie Xi’s senses returned and he felt distressed for Li Qianyi. It was estimated that normal people couldn’t imagine the fairy-like God Yan to be straight or think that the promising Jiang Xie was a pervert who liked birds!</p><br/><p>Thanks to this meal, Xie Xi found an opportunity.</p><br/><p>Back in their room, Xie Xi became a person and asked Jiang Xie, “What are lovers?”</p><br/><p>Jiang Xie’s hands on the clothes halted.</p><br/><p>Xie Xi glanced at him and asked, “Why does Li Qianyi say that you and God Yan are lovers?”</p><br/><p>Jiang Xie’s senses returned as he found the clothes and carefully helped Xie Xi wear them.</p><br/><p>Xie Xi stared at him in a motionless manner.</p><br/><p>Jiang Xie’s throat was dry as he said, “Lovers are… two people who are together forever.”</p><br/><p>Xie Xi put on a lost expression. “Do you want to be with Yan Zhe forever?” God Yan, sorry for using your name!</p><br/><p>Jiang Xie replied, “Of course not.”</p><br/><p>Xie Xi smiled. “Then we will be together forever, right?”</p><br/><p>Jiang Xie quivered as he said, “Yes.”</p><br/><p>Xie Xi hit him in the face with a straight ball. “Are we lovers?”</p><br/><p>Jiang Xie, “!”</p><br/><p>Xie Xi spoke again, “We will be together forever and lovers are always together. Thus, we are lovers!”</p><br/><p>This question was dealt and let’s see how he hid!</p><br/><p>The thing he didn’t know was that there were several chirps in his long sentence.</p><br/><p>Such wonderful contents and tone caused Jiang Xie to be breathless.</p><br/><p>“It isn’t that simple…” Jiang Xie gasped as he tried to speak.</p><br/><p>Xie Xi cocked his head. “What is that?”</p><br/><p>The action along with the intonation meant Jiang Xie heard, ‘What is chirp?’ and he couldn’t figure out what Xie Xi said.</p><br/><p>Then Xie Xi repeated it again.</p><br/><p>Jiang Xie stated, “Lovers, lovers also like each other.”</p><br/><p>Xie Xi was surprised. “Then we must be lovers. I like you the most!”</p><br/><p>Jiang Xie, “……..”</p><br/><p>Xie Xi didn’t give him a chance to back down. “Don’t you like me too? I heard you say that you liked me?”</p><br/><p>Jiang Xie had spoken these words while eating.</p><br/><p>Jiang Xie couldn’t explain and was almost sweetened by the warm words.</p><br/><p>The faint sense of alcohol rushed up and Jiang Xie’s voice was low, “If we are lovers then we will do something special.”</p><br/><p>“What is it?”</p><br/><p>Jiang Xie leaned towards him, eyes falling on the clean lips.</p><br/><p>He seemed to be bewildered as he clasped Xie Xi’s waist and kissed the lips.</p><br/><p>Xie Xi’s heart was funny and sweet but he was also embarrassed by this innocent kiss.</p><br/><p>Jiang Xie’s kissing was very undisciplined, messy and had no skills.</p><br/><p>Still… Xie Xi’s heart thumped.</p><br/><p>Jiang Xie released him and questioned in a low voice, “It is like this. Do you hate it?”</p><br/><p>Xie Xi’s voice became light and his cheeks red. “I don’t hate it… very comfortable…”</p><br/><p>Then he licked his lower lips. This made Jiang Xie’s head buzz. By the time he realized his reaction, he had already pressed the other person against the wall.</p><br/><p>“Little Chirp…” Jiang Xie leaned towards him and called out.</p><br/><p>Xie Xi heard that name in this situation and was embarrassed. “Yes?”</p><br/><p>“Be with me always? Forever and never apart.”</p><br/><p>This was also what Xie Xi hoped for. “Yes, we will never separate.”</p><br/><p>Jiang Xie couldn’t suppress the joy in his heart and said, “I always feel like I’m dreaming.”</p><br/><p>At first glance, Xie Xi didn’t think too much. Anyone who got what they wanted would have such thoughts.</p><br/><p>Jiang Xie’s low voice continued. “Once I left the black fog, everything was too smooth. Everything is going too well and I feel that something will happen.”</p><br/><p>These words poured cold water on Xie Xi.</p><br/><p>After coming out of the black fog… everything was going too well…</p><br/><p>Why did Jiang Xie think there would be something?</p><br/><p>A chill went down Xie Xi’s spine as his heart sank.</p><br/><p>It turned out to be an illusion but this time it wasn’t his, it was Jiang Xie’s illusion.</p><br/><p>Jiang Xie was aware of his anomaly. “What’s the matter?”</p><br/><p>Xie Xi opened his mouth but didn’t know what to say.</p><br/><p>He had been very calm when he broke his own illusion because he knew that as long as he passed the 12 boundaries, he would return to Central and the complete Jiang Xie.</p><br/><p>For the Jiang Xie in front of him, breaking the illusion was too cruel.</p><br/><p>Jiang Xie seemed to realize something. He held Xie Xi’s arm and spoke with a big smile, “No… isn’t it good to be together forever? Here… we’re together forever.”</p><br/><p>After hearing his trembling voice and his self-deceptive words, Xie Xi felt like he swallowed a flint as his heart was burned.</p><br/><p>Jiang Xie’s spiritual power meant it was impossible not to see through the illusion.</p><br/><p>The moment they left Dream Come True, he had asked Jiang Xie, “Have you ever encountered such illusions?”</p><br/><p>Jiang Xie had told him, “Many times.”</p><br/><p>Yes, Jiang Xie encountered many illusions but he had never been addicted. It was because he was aware it was a fantasy and he could easily leave.</p><br/><p>Yet in Dream Come True, Jiang Xie ‘died’ once.</p><br/><p>The choice of the Jiang Xie here was the same.</p><br/><p>Once Xie Xi was present, the illusion became a reality worth sticking to.</p><br/><p>Xie Xi was very distressed but he had to pull this person out.</p><br/><p>It was because beyond the illusion, they had a better truth.</p><br/><p>“Jiang Xie…” Xie Xi wondered, “We’re still in the black fog, right?”</p><br/><p>Jiang Xie’s pupils shrank and there were resistance and defeat in them.</p><br/><p>Xie Xi held this person’s face and stared into his eyes, stating in a very firm tone, “Believe me, we will still be together forever after leaving the dark fog!”</p><br/><p>Jiang Xie held him as if afraid he would disappear into smoke. “Isn’t it good to stay here? We will be happy here.”</p><br/><p>Xie Xi hugged him back, his voice like he was coaxing a helpless child, “We will be very happy once we leave here.”</p><br/><p>“No!” Jiang Xie cried out. “It is chaotic outside and very dangerous. I…”</p><br/><p>In fact, he said such things because he already recognized that he was in the black fog. Once he woke up, the illusion would be broken.</p><br/><p>Xie Xi whispered to him, “Why did you go into the black fog?”</p><br/><p>Jiang Xie was stunned.</p><br/><p>Xie Xi sighed. “It was because you didn’t want to escape. You wanted to know what it was and you would rather face death than stay still, right?”</p><br/><p>Needless to say, this was the principle of life that Jiang Xie had always believed in.</p><br/><p>He believed in himself and wanted to face everything, no matter the suffering.</p><br/><p>He worked hard to come to the Zone and heard the words of the guard captain. Once he knew that the people in the Zone were also organizing an exploration of the black fog, Jiang Xie strengthened his determination to explore the black fog.</p><br/><p>To put it mildly, he only believed in himself. He believed that if he couldn’t solve the problem then no one could.</p><br/><p>Thus, he entered the black fog.</p><br/><p>“You are like this…” Xie Xi spoke to him. “Why do you want to escape?”</p><br/><p>Staying in the black fog and the illusion with Xie Xi meant escaping.</p><br/><p>Jiang Xie buried himself in Xie Xi’s neck and said nothing.</p><br/><p>Xie Xi asked him, “Would you like to leave with me? Believe me, we will be better off than in this place.”</p><br/><p>After a long time, Jiang Xie’s voice rang in his ears. “Like in the rose garden?”</p><br/><p>Xie Xi was shocked.</p><br/><p>The illusion of the garden was his but Jiang Xie was also in it and saw the scene of Central.</p><br/><p>At this moment, Xie Xi felt that they weren’t talking about the black fog but about the collapsed world.</p><br/><p>…There seemed to be nothing wrong.</p><br/><p>Xie Xi promised him, “Yes, I will love you no matter where I am. We will always be together.”</p><br/><p>Once he finished speaking, Xie Xi felt a pulling sensation. He really had left the world of Cancer.</p><br/>\n</div>"}