{"title": "Chapter 262 - Collapsing 8 Boundaries 6", "id": 262, "volume": 3, "url": "http://boxnovel.org/game-loading-chapter-262-collapsing-8-boundaries-6", "volume_title": "Volume 3", "body": "<h1>Chapter 262 - Collapsing 8 Boundaries 6</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Collapsing 8 Boundaries 6</strong></p><br/><p>Xie Xi had inquired a lot about the estrus period.</p><br/><p>Most beastmen became adults in two or three years. One month after reaching adulthood, they would enter the estrus period.</p><br/><p>The so-called estrus period literally meant their sexual desires would soar and they would be restless for seven days.</p><br/><p>According to the parenting expert, Huer’s mother said, “This is a golden seven day period. It is guaranteed to give birth to the next chubby boy!”</p><br/><p>Xie Xi’s scalp was numb when he heard this.</p><br/><p>In particular, Huer’s mother told her son for a long time, “You can rest assured that you don’t have to go out in those seven days. I will give you the best tonic soup, make the best good and ensure you keep up your strength!”</p><br/><p>Xie Xi, “…” If he wasn’t trying to inquire about the situation then he wouldn’t be able to listen to half a word!</p><br/><p>The end result was that the estrus period might come later but it would never be absent.</p><br/><p>Thus, Jiang Xie was bound to usher in seven days of estrus!</p><br/><p>Xie Xi was more worried about what would happen if he didn’t do it in the seven days.</p><br/><p>Without him asking, Huer’s mother took the initiative to remind him, “Mr Xie must hurry up with Little Xie. If he doesn’t have a wife then the child can’t stand it.”</p><br/><p>Xie Xi really wanted to ask what would happen! However, he couldn’t speak the words.</p><br/><p>Fortunately, Huer’s mother was enthusiastic and it was unknown if she was trying to solve Xie Xi’s confusion or frighten him, “Even if you are skilled in medicine, Little Jiang’s madness won’t be able to be cured.”</p><br/><p>Xie Xi, “!” He would become crazy? What type of crazy? A murderous beast?</p><br/><p>Xie Xi couldn’t help thinking of his own physique in Gemini’s world.</p><br/><p>…Old Jiang, how much desires did he have to be so dissatisfied?</p><br/><p>Xie Xi didn’t dare rely on luck. After all, this was a broken world. Who knew how the souls would pit themselves?</p><br/><p>What if Xie Xi really ‘died?’ How would he cope for seven days? Don’t talk about seven days. Xie Xi felt like he would die in bed after only once.</p><br/><p>…Would the lion go crazy? This image was too ferocious and Xie Xi didn’t dare think about it.</p><br/><p>Was he really going to give the lion a wife? Xie Xi thought, ‘Oh, it is better to die.’</p><br/><p>A veteran of 100 battles, he had danced on the tip of a knife and passed through a rain of needles, yet Xie Xi felt an unprecedented sorrow.</p><br/><p>What the hell was he going to do?</p><br/><p>For most of the year, he had tried to restore his body but it wasn’t possible.</p><br/><p>If Jiang Xie hadn’t been with him all the time, he would’ve drawn a portable CT machine to see what was going on with his heart!</p><br/><p>The medicine he drew was enough to bring someone back to life yet he couldn’t cure his broken body.</p><br/><p>“What are you thinking about?” Jiang Xie’s question brought Xie Xi’s mind back.</p><br/><p>Xie Xi gazed at the young person in front of him and his mood became more complicated.</p><br/><p>As Huer’s mother said, Jiang Xie was really handsome after growing up.</p><br/><p>He had blonde hair, slender brows, a tall nose, sexy thin lips and his body was very strong. His abs were perfect and he had a pair of long legs. One of his steps was equivalent to two of Xie Xi’s steps.</p><br/><p>It had only been half a year…</p><br/><p>His child had grown into a big adult. Old Father Xie’s mood was very complicated. ‘Asking me about my thoughts? How can I dare tell you those things?’</p><br/><p>The ‘old father’ picked up the cup next to him and wanted to drink something to slow down.</p><br/><p>Jiang Xie took the cup away first. “This tea is too cold. Don’t drink it.”</p><br/><p>Three or four months ago, the paws had turned into slender fingers that fit the youth’s thin beauty.</p><br/><p>Xie Xi had to sip the soy milk he handed over.</p><br/><p>Jiang Xie spoke again, “This is a bit sweet. Don’t drink too much.”</p><br/><p>Xie Xi nodded and put down the cup.</p><br/><p>They were at Huer’s wedding and many acquaintances were sitting next to them. One quipped, “Little Xie really takes care of people. Whoever he marries in the future will be really blessed!”</p><br/><p>Jiang Xie was grabbing some fish for Xie Xi and didn’t answer.</p><br/><p>Xie Xi heard this and wasn’t in the mood to eat!</p><br/><p>The tigers weren’t malicious. They were speaking kindly and playfully.</p><br/><p>Then he heard a female say, “If I was a few years younger then I would definitely marry him!”</p><br/><p>Her husband wasn’t happy. “Your oldest child is older than Little Xie!”</p><br/><p>The female hit her husband. “Can’t you have some consideration when speaking? I will burn incense!”</p><br/><p>Her husband let her hit him. “That isn’t the same. Little Xie is filial to his father. Do you want me to be filial to you?”</p><br/><p>The female smiled. “Look at this messy person!”</p><br/><p>The people on the table laughed and Xie Xi’s lips thinned.</p><br/><p>Yes, he was still Jiang Xie’s ‘father’ and this made him more worried.</p><br/><p>From beginning to end, Jiang Xie didn’t say anything. He picked out the fish bones and gave Xie Xi a cut of meat, carefully looking after him.</p><br/><p>Xie Xi told him, “Don’t get me too much. I can’t eat it all.”</p><br/><p>Jiang Xie stared at him with narrowed eyes. “You didn’t eat much in the morning.”</p><br/><p>Xie Xi was very worried about the estrus period these days and how could he have the appetite to eat. He stated, “I don’t like to eat these fishy…’</p><br/><p>Jiang Xie interrupted before he finished. “I will go see the cook and ask if there is a bowl of porridge.”</p><br/><p>Xie Xi was just casually finding an excuse and didn’t want to trouble this person. Thus, he pulled at Jiang Xie’s hand. “Don’t trouble the people. I will wait and eat some green vegetables.”</p><br/><p>Jiang Xie stared at the thin hand and frowned. “If you aren’t feeling well, we will go back first.”</p><br/><p>Xie Xi patted him on the back of the hand. “Rest assured, it doesn’t matter. Today is Huer’s happy day. How can we go back first?”</p><br/><p>The Wang Family took great care of them. How could they miss such an important day?</p><br/><p>The people at the table heard the conversation and were worried, “If Mr Xie isn’t feeling well…”</p><br/><p>Xie Xi hurriedly waved his hand. “Don’t listen to this child. He is always making a fuss. How can I be so delicate?”</p><br/><p>The big guys looked at his white porcelain-like face and slender neck. ‘You don’t look delicate, you might really be delicate!’</p><br/><p>In order to appease Jiang Xie, Xie Xi ate a few green vegetables and only then did the little lion’s tense eyebrows relax.</p><br/><p>Then a handsome girl from the next table came over.</p><br/><p>The tigers poking fun at each other on the table closed their mouths and winked at her.</p><br/><p>The little girl’s face was red and she must be very nervous as she stuttered, “L-L-Little Xie!”</p><br/><p>Jiang Xie glanced at her. “Hmm?”</p><br/><p>The little girl was afraid to look at him. She left an envelope and fled.</p><br/><p>Xie Xi, “……..” A love letter???</p><br/><p>Jiang Xie glanced down at the letter in his hand and didn’t know what to do. He looked at Xie Xi and Xie Xi’s liver ached.</p><br/><p>The tigers at the table smiled “Oh, Susu likes Little Xie!”</p><br/><p>“Isn’t it more than Susu? The little flower of Old Li also likes him!”</p><br/><p>“Isn’t it Old Sun’s Nini?”</p><br/><p>“Old Lily as well!”</p><br/><p>The tigers mentioned almost all the school-age girls in the village.</p><br/><p>Finally, someone concluded, “It seems that our village is going to usher in a lion and tiger beast!”</p><br/><p>Xie Xi couldn’t interfere in the conversation and could only bear it…</p><br/><p>What could he do? If he had a slightly better body then he would seduce Jiang Xie and help him solve the estrus period. However, Xie Xi’s current body really wasn’t enough!</p><br/><p>The people on the table started to discuss the issue of lions and tigers.</p><br/><p>The village was relatively small and none of them had combined with a lion before.</p><br/><p>Still, there were many cases in the big cities. “Don’t be prejudiced. Lion and tiger beasts are very powerful. As long as their parents are strong, the child won’t go wrong.”</p><br/><p>“My second aunt’s classmate is a half lion and tiger.”</p><br/><p>“What is a half lion and tiger?”</p><br/><p>“His mother is a lion and his father is a tiger. Thus, he is half.”</p><br/><p>“What is half a lion and tiger? That is called a lion tiger!”</p><br/><p>The group burst out laughing.</p><br/><p>Xie Xi’s guess was right. There was no reproductive segregation in the world. When Huer’s mother mentioned a lion and tiger beast, Xie Xi thought that if a lion and tiger couldn’t produce offspring together, it wouldn’t be acknowledged and mentioned so happily.</p><br/><p>Thinking about it, beasts could become humans so perhaps they all had the same ancestor.</p><br/><p>The customs here were very interesting. The bride was holding flowers in her hand to throw towards the party members.</p><br/><p>It couldn’t be deliberately grabbed and had to be left to fall into a person’s arm. arms.</p><br/><p>The married tigers stated, “Rest assured, I will avoid it.”</p><br/><p>Their wives sneered. “What avoidance? If you marry someone else then it has nothing to do with me.”</p><br/><p>The tigers weren’t afraid and sweet talked the women. It was very interesting.</p><br/><p>Xie Xi didn’t take it seriously. What should he do if he wanted to marry Jiang Xie?</p><br/><p>He couldn’t marry this person. Instead, he would kill this idiot!</p><br/><p>Then a shadow flew over and fell steadily into his arms.</p><br/><p>The people on the table laughed. “It is Mr Xie, Mr Xie lost!”</p><br/><p>The new wife came over and toasted Xie Xi, speaking many auspicious words. Xie Xi reluctantly laughed but he was actually in pain from the flowers.</p><br/><p>Huer’s mother suggested, “Speaking of which, Mr Xie is still young. Why don’t you find a partner to live with?” They all thought Xie Xi was a widower.</p><br/><p>Xie Xi was stunned. What was today? First it was Jiang Xie and now it was him.</p><br/><p>The words of Huer’s mother woke up the group and they started discussing it again.</p><br/><p>“Mr Xie is a good man and a master of medicine. The little girls in the village really like him.”</p><br/><p>“It can’t be a little girl. She should be mature and steady…”</p><br/><p>They spoke in a similar way and Jiang Xie’s heart inexplicably fell.</p><br/><p>Xie Xi interrupted. “I can’t drag others down with my body.”</p><br/><p>He struggled to raise the flowers in his hand. “These bunch of flowers alone made me sore when they hit my back. How can…”</p><br/><p>He hadn’t finished when Jiang Xie leaned forward to grab the flowers. “Where did it hit you? Was it hard?”</p><br/><p>Xie Xi’s body was fine now. It was actually his brain that hurt. He gazed at the worried Jiang Xie.</p><br/><p>Everyone knew the situation. To tell the truth, the reason why no one gave Xie Xi a love letter in the past six months was because his body was a big problem.</p><br/><p>Otherwise, with his talent and appearance, it was unknown how many girls would be following him.</p><br/><p>Huer’s mother was worried. “Mr Xie, this body…”</p><br/><p>The people on the table sighed. Xie Xi had healed so many people in the village but unfortunately couldn’t heal himself. It was really regrettable.</p><br/><p>Xie Xi didn’t want to ruin such a happy day. He got up and said, “It isn’t early. I’ll go back first.”</p><br/><p>Looking at his pale face, the tigers didn’t dare keep him for long.</p><br/><p>Regarding the love letter, Jiang Xie told Xie Xi when the left the banquet, “I have returned it.”</p><br/><p>“Oh.”</p><br/><p>What could he say? He could only give a light response.</p><br/><p>Jiang Xie glanced at him. “I don’t want to marry someone.”</p><br/><p>Xie Xi, “…” He didn’t want Jiang Xie to marry anyone else!</p><br/><p>Jiang Xie spoke again, “You don’t have to worry about me and should look after your body well.”</p><br/><p>Xie Xi also wanted to keep his body well but he couldn’t!</p><br/><p>The thing he was worried about was coming.</p><br/><p>Jiang Xie completely became an adult and couldn’t hide from the estrus period.</p><br/><p>Xie Xi had kept an eye on Jiang Xie and could feel it when Jiang Xie’s eyes kept sticking to him.</p><br/><p>However, he had to pretend not to know.</p><br/><p>Adulthood was fine and so was the estrus period. Jiang Xie wasn’t too concerned.</p><br/><p>He wasn’t interested in these love matters. He just wanted to take care of Xie Xi.</p><br/><p>After that, he would travel all over the countries to become stronger before going home to get revenge!</p><br/><p>With this idea, Jiang Xie ushered in the instincts of life.</p><br/><p>It was very abrupt but it seemed natural. When he saw the outside sun resting on Xie Xi and illuminating his transparent skin, Jiang Xie’s heart seemed to burst.</p><br/><p>He always knew Xie Xi was good-looking but had never looked at him like this.</p><br/><p>After all, he was adopted by Xie Xi…</p><br/>\n</div>"}