{"title": "Chapter 277 - Collapsing 8 Boundaries 21", "id": 277, "volume": 3, "url": "http://boxnovel.org/game-loading-chapter-277-collapsing-8-boundaries-21", "volume_title": "Volume 3", "body": "<h1>Chapter 277 - Collapsing 8 Boundaries 21</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Collapsing 8 Boundaries 21</strong></p><br/><p>This undoubtedly crushed Houqing’s tight nerves.</p><br/><p>He walked over with a blank expression and hugged the wounded Xie Xi, eyes full of pain.</p><br/><p>It was as if Xie Xi wasn’t the one injured but himself. It was as if the wounds were on Xie Xi but on his heart.</p><br/><p>He carefully held Xie Xi, the fear in his heart like a giant root under a big tree, tangling around his entire body.</p><br/><p>Why… was this person always hurt? Why… couldn’t he protect this person? Why, why…</p><br/><p>The questions, blame and powerlessness glued together, almost collapsing his spirit.</p><br/><p>He healed Xie Xi day and night without sleep. He didn’t dare to blink, as if a moment of darkness would cause him to lose this person forever.</p><br/><p>No, he must never lose Xie Xi.</p><br/><p>Once Xie Xi woke up, he saw the pale and tired Houqing who seemed like he hadn’t been sleeping for days.</p><br/><p>Xie Xi complained about this person’s nonsense but he still felt bad for Houqing. “You…”</p><br/><p>Houqing touched his hand, tested Xie’s forehead with the back of his head before speaking in a near begging voice. “Please don’t leave.”</p><br/><p>He was humble to the extreme, as if standing on the edge of a cliff and eager for a last way to live.</p><br/><p>Xie Xi frowned and asked in a weak voice, “Houqing, what do you want?”</p><br/><p>“I only want you.”</p><br/><p>Xie XI sneered. “What you want is the throne under me.”</p><br/><p>Houqing suddenly looked up. “No, everything I do is for you.”’</p><br/><p>This was probably the funniest thing Xie Xi had ever heard. “For me?”</p><br/><p>Making him a figurehead, putting him under house arrest and letting him suffer humiliation, this was all for him?</p><br/><p>Xie Xi was cold. “If you still care about our previous relationship even a little bit, let me go.”</p><br/><p>Houqing trembled and asked, “Where will you go?”</p><br/><p>Xie Xi was expressionless. “A place without you.”</p><br/><p>Hearing these words, the mud in Houqing’s heart started churning.</p><br/><p>His fear and uneasiness reached the extreme. His eyes became red and his face was as pale as a demon who couldn’t see the sun. He declared, “You aren’t going anywhere.”</p><br/><p>He imprisoned Xie Xi. He no longer let Xie Xi see anyone, no longer let him leave the room and even chained him up.</p><br/><p>Xie Xi thoroughly exploded. “You are mad!”</p><br/><p>Houqing whispered nervously, “You don’t know how scared I have been all these years. You don’t know how scared I was every time you went to the battlefield. You don’t know that every time I saw the dead soldiers, I would think they have your face. You don’t know… you don’t know…”</p><br/><p>His words reminded Xie Xi’s voice of the memories and his voice softened, “Those things are all gone.”</p><br/><p>Houqing stared at him, the smile making people’s back cold. “I thought it was over. I thought that once you ascended to the throne and became the world’s most noble person, you wouldn’t be in danger again. However, I was wrong… I was wrong…”</p><br/><p>Xie Xi frowned. “No one is completely safe.”</p><br/><p>“No…” Houqing shook his head, the white hair looking cold and making him seem paler and sickly. “Too many people want to hurt you. The more I look, the more afraid I am. The more I can’t find them, the more they are like ants. There are too many to be killed. Why… why do they hurt you…”</p><br/><p>The words made Xie Xi tense. “What have you done?!” The empire was just established and everything was on the right track. If killing was used to suppress the rebels then it would end everything!</p><br/><p>The kingdom they worked hard to build was to bring peace and happiness to the people, not to use dictatorship to exert terror and suffering!</p><br/><p>Houqing didn’t seem to hear his voice as he kissed the back of Xie Xi’s hand. “Be obedient, Brother Xie. Stay with me, okay? No matter what you want, I will support you in everything.”</p><br/><p>Xie Xi blew up. “Houqing! What the fuck is wrong with you!”</p><br/><p>Houqing kissed his lips, making him speechless. Then Xie Xi bit the tip of his tongue. Houqing’s mouth overflowed with blood but he smiled like it wasn’t painful. “Please rest. Your wounds haven’t completely recovered.”</p><br/><p>Xie Xi smelt something and then fell asleep.</p><br/><p>It wasn’t only Xie Xi who couldn’t leave this room. Houqing didn’t go out and abandoned everything. He no longer cared about political matters and only stared at Xie Xi.</p><br/><p>He couldn’t trust anyone. The guards were all rubbish and couldn’t protect Xie Xi. No one could protect Xie Xi apart from him. He would protect this person with life and soul, not letting Xie Xi suffer any damage.</p><br/><p>Once Xie Xi’s injuries healed, Xie Xi couldn’t stand it anymore.</p><br/><p>He didn’t know the man in front of him. This was obviously the little white tiger he saved but Houqing was already a stranger. Xie Xi started a hunger strike and didn’t eat or drink to resist Houqing.</p><br/><p>Houqing asked him, “Isn’t it appetizing? Tell me what you want to eat.”</p><br/><p>Xie Xi stared at him. “Let me go.”</p><br/><p>Houqing’s thin lips trembled. “It is dangerous, really dangerous.”</p><br/><p>Xie Xi sneered. “Houqing, this is enough. What do you fucking take me as? I’m not a flower in a greenhouse. I lived in a swamp and walked over mountains while you were still being chased by beasts!”</p><br/><p>Houqing was silent.</p><br/><p>Xie Xi ordered, “Undo the chains or I won’t eat!”</p><br/><p>Finally, Houqing was forced to remove the chains. However, the doors and windows were still closed and he didn’t leave.</p><br/><p>Xie Xi was tired of this person. He couldn’t imagine how his closest person could turn into this! Even the white hair he usually liked had become a disgusting existing.</p><br/><p>Xie Xi couldn’t imagine what was going on outside. Both him and Houqing were absent. He was afraid that the entire empire was torn apart!</p><br/><p>He was increasingly unable to understand Houqing and didn’t know what this person wanted.</p><br/><p>Xie Xi couldn’t find a way to escape and was going crazy. He asked Houqing, “For how long are you going to torture me? What did I do to make you hate me so much?”</p><br/><p>“You are too good to me. No one has ever been so good to me. How can I hate you? I… love you too much.”</p><br/><p>This was Houqing’s so-called confession.</p><br/><p>In such a situation, Xie Xi only heard the irony and absurdity in the words. Xie Xi smiled sarcastically. “You love me? Do you love me?”</p><br/><p>Houqing seemed a bit nervous. “I have always… all the time…”</p><br/><p>“You must be kidding!” Xie Xi shouted. “This is what you call love? Let this love go to hell!”</p><br/><p>Houqing was shocked.</p><br/><p>Xie Xi told him, “I don’t want to be entangled with you. Let me go.”</p><br/><p>Houqing’s throat moved. “Don’t say that…”</p><br/><p>Xie Xi stared at him coldly. “If you love me then sorry, I don’t love you.”</p><br/><p>This made Houqing fall into an ice cave. He smiled with as much strength as possible. “How is that possible? You are so good to me. How could you…”</p><br/><p>“You disgust me.” Xie Xi interrupted. “How can I full in love with someone like you?”</p><br/><p>Houqing was stunned and there was no lustre in his eyes.</p><br/><p>Xie Xi’s spirit was on the verge of collapse. He had been strong all his life. Why did he have to suffer such humiliation now? What’s more, the humiliation was given to him by his loved one. He was extremely angry and thought he was blind for giving his trust to such a madman!</p><br/><p>Houqing spoke sadly. “No, it is impossible. You don’t hate me. You said that you only have me in his life…” This was what Xie Xi told him during the time they were dependent on each other.</p><br/><p>Without warning, Xie Xi’s fingers turned into claws and he stabbed at his own chest cavity.</p><br/><p>Houqing was shocked.</p><br/><p>Xie Xi took out his bloody heart and told Houqing, “This heart absolutely doesn’t belong to you.”</p><br/><p>Houqing saw the bloody heart in front of him and this became his life’s nightmare.</p><br/><p>Xie Xi told him viciously, “Let me leave or I will crush it.” Due to his physical strength, it was hard to die as long as his heart was still beating. However, once the heart was injured, it was difficult to recover.”</p><br/><p>Houqing’s pupils shrank. “No, don’t!”</p><br/><p>Xie Xi was pale but his eyes were as dark as an abyss. “Let me go or I will die in front of you…”</p><br/><p>Xie Xi woke up sweating from this dream. Too exciting! Both of them were neurotic!</p><br/><p>Xie Xi finally discovered the cause of this injury… It wasn’t anyone else who did it. It was committed by his own hand. His heart was dug out but he didn’t die. He wasn’t a normal beast!</p><br/><p>Still, this obviously left a huge hidden danger that led to his body’s decline. It took so many medicines to treat this heart.</p><br/><p>Xie XI had been soaking in the medicinal bath and the scar on his chest had faded a lot. After knowing the situation, he looked at the outline of the scar and could see the traces.</p><br/><p>Xie Xi shook as he worried about Virgo’s state of mind? How could he collapse so badly? The souls of the other worlds were disheartened at best. Virgo was paranoid to the point of madness.</p><br/><p>Then thinking about it… Jiang Xie’s souls weren’t lacking in neuroticism.</p><br/><p>In Love was a Dead End, all three of them were sick. Atlantis wasn’t much better and he was also frightened by Randy who tried to resurrect him. After all, the quasi-worlds were completed by Jiang Xie and the souls were much better off.</p><br/><p>In this world, Jiang Xie was fused with Leo and there was no chance with Virgo? Was this what blackened Virgo?</p><br/><p>From the perspective of a bystander, Xie Xi could understand Virgo.</p><br/><p>The war left Virgo with too much psychological trauma. It wasn’t resolved and became more and more intense. He slowly changed from over protection to putting Xie Xi under house arrest. Finally, Xie Xi’s near death completely maddened him.</p><br/><p>After all, Xie Xi’s setting was a founding emperor who fought in a war. How could he understand Houqing’s feelings? How could he feel Houqing’s tension and anxiety? His blind desire to leave completely intensified the contradiction until his act of almost suicide awakened Houqing.</p><br/><p>It was just that this behaviour was too fierce. Houqing let him go but didn’t let himself go.</p><br/><p>Houqing stayed in the Rose Palace and thought of the distant Xie Xi. He was a walking mass of pain, guilt, despair and restlessly.</p><br/><p>Xie Xi sat on the bed for a while and sighed once his heart no longer hurt.</p><br/><p>Then he soon became nervous again.</p><br/><p>It was broken… in this state of mind, wouldn’t Houqing’s old disease reoccur after watching Xie Xi and Leo day and night?</p><br/><p>Xie Xi knew there was a previous setting and Houqing wouldn’t dare anger him but Leo…</p><br/><p>The souls were always sly and ruthless to themselves, never merciful.</p><br/>\n</div>"}