{"title": "Chapter 279 - Collapsing 8 Boundaries 23", "id": 279, "volume": 3, "url": "http://boxnovel.org/game-loading-chapter-279-collapsing-8-boundaries-23", "volume_title": "Volume 3", "body": "<h1>Chapter 279 - Collapsing 8 Boundaries 23</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Collapsing 8 Boundaries 23</strong></p><br/><p>This was too much!</p><br/><p>Xie Xi wanted to have eight legs to hurry to the scene and interrupt their conversation!</p><br/><p>He didn’t have to look to know what expression the little lion would be making.</p><br/><p>The little lion’s voice was truly tense. “No, he isn’t like this…”</p><br/><p>Houqing’s words pierced his heart. “You have never been to Rose Palace or this garden. Why dream of this place?”</p><br/><p>This was something the little lion also wanted to understand. The first time he came to the palace and saw the garden, he couldn’t figure out why he dreamt of it when he had never seen this place before.</p><br/><p>Now he had an answer.</p><br/><p>Houqing watched the garden and sighed. “He likes this place the most. He entered my dreams a long time ago and showed me this garden.”</p><br/><p>Leo’s head was buzzing. “He entered your dreams?”</p><br/><p>Houqing directly asked him, “I met him when I was as old as you. How did you think we spent our estrus?”</p><br/><p>There was no doubt that Leo thought about this issue. He even vaguely knew that Xie Xi and Houqing…</p><br/><p>Still, it was difficult to accept when he actually heard it.</p><br/><p>Houqing knew the art of attacking the heart. His experience meant it was easy to clean up the little lion. “This garden was what I recreated from the dream. I don’t know what type of dreams he gave you but presumably with his love for the garden…”</p><br/><p>Leo couldn’t listen anymore. “Enough!”</p><br/><p>Houqing saw the fire was almost stoked and intended to end it. “I told you these things to wake you up. Xie Xi doesn’t love you and is just using you.”</p><br/><p>“Shut up!”</p><br/><p>His anger wasn’t able to calm Houqing, who was still calm and slow. “I’m said all this but you are still obsessed…”</p><br/><p>Leo didn’t believe it. “I don’t believe you. I’m going to ask him!”</p><br/><p>REPORT THIS AD</p><br/><p>On the way, Xie Xi thought, ‘Little lion, you are good. Listening to others isn’t as good as listening to me!’</p><br/><p>Houqing had expected this and sneered. “Do you want him to coax you to be his puppet for all your life?”</p><br/><p>Leo was stunned.</p><br/><p>Houqing told you, “You can ask him and continue to be blind and deaf. In any case, you have nothing.”</p><br/><p>These words struck the heart, suggesting that his home was broken. The little lion’s eyes widened.</p><br/><p>Xie Xi rushed over and once he saw the garden in the distance, he saw the two Jiang Xies standing among the flowers.</p><br/><p>The two men didn’t look similar but their figures were equally slender.</p><br/><p>The little lion’s ears and tail had completely faded and he didn’t have a juvenile appearance. The blond hair and golden eyes shone in the midday sun, making it impossible for people to look straight.</p><br/><p>The national teacher wore a white cloak. His temperament was cool but not weak. He stood in front of the little lion, who was shining like the sun, and still had an outstanding air.</p><br/><p>Xie Xi was stunned for a moment. It wasn’t because of praise for his lover but because he suddenly thought of something.</p><br/><p>This wasn’t the same as the collapsed god…</p><br/><p>If the national teacher and Leo weren’t souls of the same world then…</p><br/><p>Xie Xi thought about it and decided it was worth a try!</p><br/><p>The situation was already like this and it couldn’t be worse!</p><br/><p>Xie Xi no longer paused and strode towards them.</p><br/><p>With their five senses, they didn’t notice his arrival. This was deliberately done by Xie Xi.</p><br/><p>He wanted to hit them directly so they had no chance to cover up.</p><br/><p>Houqing froze when he saw Xie Xi.</p><br/><p>Leo wasn’t much better. He was emotionally complex and his honest love was like a dusty jewel, making people feel bad.</p><br/><p>Xie Xi looked at this and then at that.</p><br/><p>Leo opened his mouth first. If Xie Xi hadn’t arrived then he would’ve been convinced by Houqing’s words and not have the courage to ask separately. Now Xie Xi was in front of him and he didn’t have time to think about it. Thus he directly asked!</p><br/><p>REPORT THIS AD</p><br/><p>“Is he telling the truth? My father was a rebel and tried to kill ou. You have the ability to manipulate my dreams. You… you…”</p><br/><p>He asked intermittently, standing beside Houqing who was an ice sculpture in the cold wind.</p><br/><p>The bone-chilling cold passed from the tip of his finger to his heart. His blood solidified and his brain was very active. Xie Xi knew. It was over. Xie Xi would never forgive him.</p><br/><p>Houqing stood in the beloved garden while his soul was in physical hell. The overwhelming despair and craziness tore at his mind.</p><br/><p>He lost Xie Xi, he would lose Xie Xi forever…</p><br/><p>Just as he was feeling desperate, he heard Xie Xi’s quiet voice. “I’m sorry.”</p><br/><p>He was apologizing to the lion beastman.</p><br/><p>Houqing felt like he had been pulled from the water. Air filled his chest cavity as he turned to look at Xie Xi.</p><br/><p>Xie Xi lowered his eyes and was cruel under his calm. “Houqing’s words are true.”</p><br/><p>Houqing was shocked.</p><br/><p>Leo’s eyes turned scarlet and he cried out, “Why? Why are you teasing me like this?”</p><br/><p>Xie Xi had long been eavesdropping and naturally knew the script. “You are the only member of the Lion Country’s royal family left. As long as you listen to me, the entire Lion Country…”</p><br/><p>Leo swung his fist and Houqing caught it.</p><br/><p>Leo was mad. This moment was really filled with ups and downs for him.</p><br/><p>Yesterday was full of affection and he slept happily because of Xie Xi’s promise. Today, he fell from Heaven to Hell. He went from being wrapped in clouds to burning in his heart. Leo felt an indescribable pain.</p><br/><p>Not only did he lost love, he lost his life.</p><br/><p>His close person, the person he trusted, the person he loved most, had been deceiving him from beginning to end.</p><br/><p>The warmth that supported his growth turned out to be false.</p><br/><p>In front of the person who felt longing and attachment, Xie Xi was actually so hard-hearted.</p><br/><p>Leo was really blind and deaf. He had been deceived like a clown.</p><br/><p>Leo thought he was already in Hell and didn’t expect to experience more cruelty.</p><br/><p>The familiar yet unfamiliar man in front of him declared, “Now that you know this, I can’t let you go.”</p><br/><p>REPORT THIS AD</p><br/><p>Leo stared at Xie Xi with shock. “You… you’re going to kill me?”</p><br/><p>Xie Xi looked up, his eyes still. “You should know where this is. You can’t escape.”</p><br/><p>The posturing Xie felt fortunate. He didn’t have the heart to be emperor and quietly drew some robots to pretend to be guards.</p><br/><p>He came along this path and knocked unconscious many of Houqing’s confidants. It was his robots who came to chase the lion beastman.</p><br/><p>The robots naturally listened to his signals. He just had to stop Houqing from doing anything. Then the robots would make the scene look tragic while leading Leo along a certain path and it should be fine!</p><br/><p>Fortunately, there was the god’s wisdom!</p><br/><p>Leo was filled with grief and anger, all the love transforming into a deep hate in an instant. “Xie Xi, I hate you!”</p><br/><p>He jumped up and smashed the guards surrounding him.</p><br/><p>Xie Xi didn’t need to distract Houqing since this person had already collapsed.</p><br/><p>How could this be?</p><br/><p>Xie Xi… was really just using the lion? He wanted to borrow the lion to settle the Lion Country? Really…</p><br/><p>He felt it was wrong but…</p><br/><p>The guards stabbed at the lion and Xie Xi’s heart thumped. ‘Fuck, be careful. If you poke a hole in him then I will smash all of you!’</p><br/><p>The ‘guards’ were very stable. After all, they were robots. There would be zero errors.</p><br/><p>Then Houqing’s senses returned and he ordered, “He must be caught!”</p><br/><p>The guards obeyed the orders but the person really controlling them was Xie Xi. Xie Xi ordered them to drive him to the border.</p><br/><p>Leo’s training during this time wasn’t in vain and his skills were amazing.</p><br/><p>Xie Xi saw that Houqing wanted to act and hurriedly pulled at him. “Leave it to them. If they can’t even catch a young lion then what is the use of the guards?”</p><br/><p>Houqing was surprised and turned to look at him.</p><br/><p>Xie Xi put on a tired expression. “I’m a bit hungry. Let’s go back.</p><br/><p>Xie Xi intentionally took Houqing’s hand because he was afraid that Houqing would ask, ‘How did you come here?’</p><br/><p>REPORT THIS AD</p><br/><p>Regarding this question, Xie Xi hadn’t thought of a proper answer yet. He could only take advantage of Houqing’s confused state to take him away from the scene.</p><br/><p>Fortunately, Houqing suffered a much larger impact than he imagined.</p><br/><p>He couldn’t remember to ask the reason that Xie Xi came here. His brain was full of the changes that occurred just now.</p><br/><p>For Leo, it was a moment of ups and downs. For Houqing, wasn’t it escaping death?</p><br/><p>It wasn’t until after breakfast, the medicinal bath and the guards reporting that the lion was seriously injured and fled into the Beast Forest, with no possibility of survival, that Houqing slowly recovered.</p><br/><p>The lion beastman died…</p><br/><p>He turned to watch Xie Xi.</p><br/><p>Xie Xi sighed and looked a bit uncomfortable.</p><br/><p>Houqing finally spoke to him, “Your Majesty, you…”</p><br/><p>Xie Xi looked at him and smiled. “Don’t you know everything?”</p><br/><p>Houqing’s heart humped and he kneeled down.</p><br/><p>Xie Xi got up and put on a cloak before saying, “You are really becoming more and more confused. Jiang Yuan attacked us so many times. How can I have any feelings for his child?”</p><br/><p>Houqing’s body tensed.</p><br/><p>Xie Xi told him, “It was an accident to pick out the little lion. Since I discovered his past, I decided it would be a good thing to train him into the lion king.”</p><br/><p>Houqing’s brain was a mess. He heard everything Xie Xi said but the words were incomprehensible.</p><br/><p>Indeed, once he returned to the palace, Xie Xi had Houqing check the background of the lion beastman.</p><br/><p>Xie Xi added, “I have no intention of unifying the eight countries again. I just want to do something within my power. If I could train this little lion into a good king then it is also very good.” The reason was far-fetched but he was asking for Houqing’s filter to fill in the loopholes himself!</p><br/><p>Houqing was intelligent and at this moment, he understood everything.</p><br/><p>“I..”</p><br/><p>Xie Xi sighed. “I don’t blame you. It is my fault. The feelings that started out of deception will collapse sooner or later.</p><br/><p>Houqing didn’t know what to think. His chaotic mood reached the peak and in the end, he could only squeeze out a sentence. “I thought you returned to the palace for him…”</p><br/><p>Xie Xi stared at him.</p><br/><p>Houqing bowed his head and asked in a quivering voice, “Your Majesty, why did you come back?”</p><br/><p>If it wasn’t for the lion beastman then why?</p><br/><p>Why return to a palace that he abhorred? Why meet Houqing?</p><br/><p>Why— this thought might be too good and Houqing didn’t have the courage to think it.</p><br/><p>Xie Xi bent over to help him up and spoke in a helpless voice, “I miss you… Houqing, I missed you very much.”</p><br/>\n</div>"}