{"title": "Chapter 276 - Collapsing 8 Boundaries 20", "id": 276, "volume": 3, "url": "http://boxnovel.org/game-loading-chapter-276-collapsing-8-boundaries-20", "volume_title": "Volume 3", "body": "<h1>Chapter 276 - Collapsing 8 Boundaries 20</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Collapsing 8 Boundaries 20</strong></p><br/><p>Xie Xi’s life wasn’t in danger. If it wasn’t a poison arrow then he would’ve been able to recover on his own in a few days.</p><br/><p>Even if there was poison, it wasn’t a problem with Houqing present.</p><br/><p>Xie XI lay in bed and joked while looking at the frowning white-haired youth. “It isn’t the first time I’ve been injured. Stop panicking.”</p><br/><p>Houqing gazed at him, eyes somewhat strange.</p><br/><p>Then Houqing lowered his eyelashes and carefully treated the wounds. “I will catch the person who hurt you.”</p><br/><p>Xie Xi told him, “Don’t be so nervous. I don’t know how many people whose interests I touched after ascending to the throne.” There were countless people who wanted to kill him.</p><br/><p>Houqing replied, “No matter how they are, I will make them pay in blood.”</p><br/><p>“Okay.” Xie Xi felt that this person was a bit too stressed. “It is nothing to me.”</p><br/><p>Houqing no longer spoke and only carefully treated the wounds.</p><br/><p>Xie Xi woke up.</p><br/><p>He opened his eyes and found that Houqing was gone. Was it because he left that the dream ended?</p><br/><p>It was strange since entering the little lion’s dream didn’t need two people to be present.</p><br/><p>However, it wasn’t the same. The little lion slept and they saw dreams. Here, he saw Houqing’s real memories.</p><br/><p>This was probably the two directions of his ability?</p><br/><p>Xie Xi guessed like this.</p><br/><p>He recalled the dream. From the perspective of an onlooker, he knew this was an important node.</p><br/><p>During the war, Xie Xi was injured many times. Houqing was pained but he was able to endure it.</p><br/><p>However, Xie Xi was still in danger once the war was over and this touched his nerves.</p><br/><p>It could be understood that the war might be dangerous but as long as it ended, there was peace and always hope. Yet the eight countries were unified and Xie Xi was still fatally wounded under his nose. This was very unacceptable for Houqing.</p><br/><p>There was no way that the heart wouldn’t fall and it wasn’t strange to fell panic all day.</p><br/><p>Houqing’s experiences and encounters meant he was destined not to be a normal person. His psychological quality was extremely strong but also extremely fragile if the right string in his heart was touched.</p><br/><p>Obviously, this string was touched.</p><br/><p>Xie Xi sighed, turned around and went to sleep.</p><br/><p>By the time the lion’s estrus was over, Xie Xi had watched the complete emotional summary.</p><br/><p>As he thought, since Xie Xi was attacked, Houqing’s status wasn’t right.</p><br/><p>Xie Xi was ill for a month, during which he gave most of his affairs to Houqing.</p><br/><p>This wasn’t a problem. He was most reliant on Houqing and believed in this person’s ability. The things he couldn’t handle could only be entrusted to Houqing.</p><br/><p>Houqing did a good job and everything was carried out in accordance with Xie Xi’s ideas. There were no mistakes at all.</p><br/><p>After his recovery, Xie Xi exclaimed, “If I die, this country will be handed to you. I…”</p><br/><p>He hadn’t finished when Houqing interrupted. “You can’t die.”</p><br/><p>Xie Xi didn’t take it too seriously. “I just giving an example.”</p><br/><p>Houqing looked up, a faint halo of red light in his eyes. “That example can’t be given.”</p><br/><p>Xie Xi laughed. “Don’t be overly nervous.”</p><br/><p>Houqing didn’t say anything and continued carefully dressing Xie Xi.</p><br/><p>Xie Xi glanced at this person through the mirror. “You are now the national teacher. You shouldn’t do this type of work.”</p><br/><p>Houqing replied, “I don’t trust them.”</p><br/><p>Xie Xi thought he meant the maids couldn’t do these things well and said, “In these matters, they are the professionals.”</p><br/><p>Houqing didn’t refute or admit it. He insisted on everyone leaving as he kept taking care of Xie Xi.</p><br/><p>Xie Xi only thought that because he was injured, Houqing’s concern was chaotic and somewhat neurotic. Xie Xi didn’t take it too seriously.</p><br/><p>It wasn’t until half a month later that Xie Xi discovered Houqing wasn’t normal.</p><br/><p>It was difficult to use this term to describe the person living with him.</p><br/><p>However, he had to admit that Houqing was very normal.</p><br/><p>First, he sent away the personal maid. Then he handed Xie Xi the dishes and bathed him. Eventually, Houqing didn’t allow any other person to serve Xie Xi.</p><br/><p>At this time, Xie Xi could still joke, “Don’t you like to be clean? Don’t to this type of dirty work.”</p><br/><p>“They can’t do it well.”</p><br/><p>Xie Xi saw that Houqing didn’t intend to back down and had to scold him. “Houqing, you are the national teacher and the spiritual symbol of the Rose Empire. You can’t treat yourself like this!”</p><br/><p>Yes, the things that Houqing did were simply self-abuse.</p><br/><p>Houqing told him, “The entire Rose Empire is yours. It is natural for me to serve you.”</p><br/><p>Xie Xi held his hand. “Don’t talk to me like this.”</p><br/><p>Houqing’s eyelashes trembled but his voice was soothing. “Your Majesty, please let me do these things. I can only feel at ease by doing them personally.”</p><br/><p>Xie Xi frowned. “Are you still afraid?”</p><br/><p>Houqing pursed his lips.</p><br/><p>Xie Xi sighed. “How long has it been since the assassination attempt? Why haven’t you let it go?”</p><br/><p>“I haven’t caught the perpetrators yet.”</p><br/><p>Xie Xi stated, “You know, I have countless enemies. Even if you catch them, there will be another one.”</p><br/><p>Houqing suddenly raised his head. “That’s why I can’t give anyone a chance to hurt you!”</p><br/><p>Xie Xi wondered, “You can’t trust anyone in the palace?”</p><br/><p>Houqing didn’t open his eyes. “I can’t trust anyone.”</p><br/><p>At this moment, Xie Xi understood the true meaning of Houqing’s words.</p><br/><p>He said helplessly, “Don’t think like this. The people here have all been personally screened by us and are the most loyal.”</p><br/><p>Houqing sneered. “What about their loyalty? I can’t trust their abilities!”</p><br/><p>Xie Xi was shaken.</p><br/><p>Houqing looked up at him. “There were so many guards at that time. Why were you still injured?” At that time, only Houqing wasn’t around Xie Xi. He was in the rank of ministers.</p><br/><p>Xie Xi smiled bitterly. “Well, I was careless. I lost my wartime vigilance but after this, I will certainly tighten my nerves and not let myself get hurt.”</p><br/><p>Houqing blamed himself. “You have to worry about so many things every day, how do you have the energy to focus on yourself? Leave it to me.”</p><br/><p>Xie Xi tried to comfort him. “Don’t take it on. You are busier than me.”</p><br/><p>However, Xie Xi was defeated by Houqing who almost begged. “Your Majesty, please let me stay close to you. I am scared and it is nothing to be tired. I just want you to be safe.”</p><br/><p>Xie Xi couldn’t help giving in to this person’s heart.</p><br/><p>If it was just this, the two of them wouldn’t be in such a mess.</p><br/><p>Facts proved that a psychological problem shouldn’t be dragged out. Once signs of it were discovered, it should be uprooted and completely eradicated.</p><br/><p>Indulging in it would only make it more intense and it would eventually spiral out of control.</p><br/><p>Xie Xi’s indulgence didn’t make Houqing reassured but only contributed to his uneasiness.</p><br/><p>He was completely entangled in fear and self-blame, constantly reflected on what he had done and what he was doing.</p><br/><p>He became more and more clear that he only had Xie Xi in his heart and Xie Xi was the only thing he thought about.</p><br/><p>This made him more aware of Xie Xi’s tiredness and couldn’t be to let Xie Xi worry about these trivial things…</p><br/><p>He started to help Xie Xi do more things and to deal with government affairs. Slowly, he pushed Xie Xi out.</p><br/><p>It was true that the ministers were their confidants and knew that the relationship between Xie Xi and Houqing was extraordinary. However, in the face of power, even the closest people could turn against each other.</p><br/><p>Houqing’s actions caused a lot of speculations. Could it be that the two top people had started fighting for power?</p><br/><p>Once the news reached Xie Xi’s ears, he immediately dragged the people to him for a scolding.</p><br/><p>However, this rumour was like a dandelion seed blowing in the wind. Once it was let go, it couldn’t be stopped.</p><br/><p>Xie Xi slowly found out that Houqing was making him a mere figurehead.</p><br/><p>He didn’t believe that Houqing would be blinded by rights but the facts before him didn’t allow him to think too much.</p><br/><p>He was wounded for a while and it was natural for Houqing to take things on. However, he was now recovered but there were many things hidden from him. This…</p><br/><p>There was a ripple in Xie Xi’s heart but this wasn’t something that could be solved casually.</p><br/><p>Once he tried to limit Houqing’s rights, he found that many things were already out of his reach.</p><br/><p>It was true that he was the emperor but when the courtiers asked a question, Houqing’s decision was fast and stable. Even if he asked for Xie Xi’s opinion, Xie Xi couldn’t give a better answer.</p><br/><p>In this way, everyone was more convinced by Houqing.</p><br/><p>Xie Xi’s close companions were all military commanders. They couldn’t interject in matters of the court and Xie Xi couldn’t rely on them.</p><br/><p>In this case, he finally planned to talk to Houqing.</p><br/><p>With their relationship, if Houqing wanted the throne then Xie Xi would give it to him.</p><br/><p>Originally, he didn’t want to ascend the throne. It was only when Houqing said it was easier to implement decrees that he became the emperor.</p><br/><p>If Houqing could do it better then he could step down.</p><br/><p>Xie Xi thought this and some of the problems in his heart seemed to be resolved.</p><br/><p>He found Houqing and explained his decision.</p><br/><p>Houqing was stunned. “You…”</p><br/><p>Xie Xi spoke sincerely. “This position is more suitable for you. I am better at leading wars and I believe in you when it comes to political matters.”</p><br/><p>He spoke sincerely but Houqing’s expression sank. “This country is yours.” If it wasn’t for Xie Xi, why would he have worked so hard?</p><br/><p>“The country is the people and the leader should be able to let them live. I will go to the border and punish the rebels.”</p><br/><p>Xie Xi thought his decision was more and more right. Houqing would stay in the city while he went to clean up the gang of thieves who weren’t dead. Wasn’t this just right?</p><br/><p>They really fit together!</p><br/><p>Who would’ve expected Houqing’s voice to be as cold as ice? “You want to leave the palace?”</p><br/><p>Xie Xi thought Houqing didn’t believe him and replied, “I really don’t care about the throne! I would rather lead the soldiers to fight!”</p><br/><p>Houqing didn’t seem to hear him and asked, “You are leaving the palace?”</p><br/><p>Xie Xi noticed this person wasn’t right. “Houqing?”</p><br/><p>Houqing’s uneasiness that he suppressed for a long time completely broke out and he whispered, “You can’t go anywhere. You can only stay here!”</p><br/><p>Going to the border? Taking the soldiers to fight?</p><br/><p>Didn’t this person suffer enough injuries? Didn’t he experience enough danger? Didn’t he know how much Houqing worried about him?</p><br/><p>Xie Xi didn’t respond to the meaning of this sentence for a while.</p><br/><p>It wasn’t until there was no one around him and he couldn’t even leave the palace that Xie Xi discovered he was under house arrest.</p><br/><p>The little white tiger he saved, his close comrade-in-arms, the person he trusted with his body and mind, actually put him under house arrest.</p><br/><p>Why? Xie Xi couldn’t understand it. Was it power… was the charm of power so great?</p><br/><p>However, he already said he wanted to give up everything. Didn’t Houqing believe him?</p><br/><p>The knots in his heart, which had been unlocked for the most part, were tied together again. Once he saw Houqing, he felt extremely strange.</p><br/><p>Such eyes stung at Houqing.</p><br/><p>Xie Xi asked him, “What do you want to do? I already said I would give you the throne. Why don’t you let me go?”</p><br/><p>The words about leaving became Houqing’s nightmare. He couldn’t hear them and his tight nerves seemed to break.</p><br/><p>He declared in a hoarse voice, “You are the beast king. You can’t go anywhere.”</p><br/><p>Xie Xi was fired up and punched him. “Houqing, what the hell do you want to do?”</p><br/><p>Houqing didn’t evade and blood flowed from his mouth. He ignored it as he said, “I can’t let you go.”</p><br/><p>Xie Xi was crazy. After all, he was the beast king who was brave and militant. Once he really moved, no one could stop him.</p><br/><p>At this time, there was an accident. It was unknown how long the rebels were lurking but they found an assassinating opportunity. They hated Xie Xi, they hated the man who took away their power.</p><br/><p>Xie Xi was exhausted from handling the guards when he met these people.</p><br/><p>By the time Houqing came, Xie Xi was standing there holding a pike. The attackers were killed by him and he was shaking.</p><br/>\n</div>"}