{"title": "Chapter 285 - Can’t Be Erased 2", "id": 285, "volume": 3, "url": "http://boxnovel.org/game-loading-chapter-285-can%E2%80%99t-be-erased-2", "volume_title": "Volume 3", "body": "<h1>Chapter 285 - Can’t Be Erased 2</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Can’t Be Erased 2</strong></p><hr/><br/><p>This had been a problem. Xie Xi had been worrying about where he would get six hands to press against the six light groups at the same time.</p><br/><p>It was convenient for the light groups to be merged into one!</p><br/><p>Xie Xi exclaimed, “It shouldn’t be too late. Let’s go!”</p><br/><p>Jiang Xie pulled at him.</p><br/><p>Xie Xi turned to look at this person and Jiang Xie smiled. “I’m not too useful.”</p><br/><p>Xie Xi was startled.</p><br/><p>Jiang Xie exposed an extremely rare look. The man who wasn’t afraid of anything in the world actually showed such self-confidence. “You are always working hard and I can do almost nothing.”</p><br/><p>Xie Xi passing the quasi-world was to recognize the value of Jiang Xie’s existence.</p><br/><p>Xie Xi repairing his broken quasi-world was continuing Jiang Xie’s life.</p><br/><p>From beginning to end, Xie Xi had always been the one paying and he…</p><br/><p>Xie Xi smiled. Sure enough, under the appearance of an old rogue was a sensitive heart.</p><br/><p>He approached Jiang Xie and seriously gazed at this person. “What are you talking about? While other people are facing danger in the quasi-worlds, I am falling in love in your worlds.”</p><br/><p>Jiang Xie was stunned.</p><br/><p>Xie Xi continued, “In the first world, you gave me immunity to fatal injuries and pain relief. In the second world, you gave me an ability to assist me. Every soul was reluctant to hurt me. No matter how bad the situation, they chose to trust me and guard me, just like you.”</p><br/><p>It was true that every world Xie Xi travelled through seemed to be Jiang Xie’s redemption.</p><br/><p>Conversely, these worlds saved Xie Xi.</p><br/><p>From the teenager who was disappointed in everything at the beginning to the current brave Xie Xi, he experienced the best path of growth.</p><br/><p>Xie Xi was only for Jiang Xie. Jiang Xie was only for Xie Xi.</p><br/><p>Jiang Xie’s lips curved in a smile. “Little Xi.”</p><br/><p>Xie Xi glanced at him. “Hrmm?”</p><br/><p>“I love you.”</p><br/><p>Xie Xi also smiled. He held this person’s cheek and kissed his lips. “If you love me then live!”</p><br/><p>Jiang Xie was bright as he kissed back. “You as well.”</p><br/><p>The best protection for your lover was to protect yourself.</p><br/><p>It was because losing a loved one was crueller than death.</p><br/><p>Xie Xi touched the black light group while Aries went to sleep.</p><br/><p>Six fuzzy figures appeared in the black light group. Xie Xi couldn’t see them but he knew they were Jiang Xie.</p><br/><p>The low voice seemed to break through the endless darkness and arrive here with great hardships.</p><br/><p>They asked, “Is it me?”</p><br/><p>Xie Xi nodded. “Yes.”</p><br/><p>In entering this world that would be erased, Xie Xi had already prepared himself.</p><br/><p>Jiang Xie told him that Central didn’t have any personal feelings and wouldn’t understand strangeness. Its will was all for the maintenance of balance.</p><br/><p>It wasn’t about maintaining a central balance but maintaining the balance of resources in thoughts of worlds.</p><br/><p>It was true that Xie Xi could repair collapsed worlds and once repaired, such high level worlds would bring a virtuous cycle to Central. Unfortunately, this was the limit.</p><br/><p>The collapsed worlds were like parasitic tumours to the Central Government. It was likely that Central couldn’t wait for the doctor to cure the tumour and was being eroded by the tumour.</p><br/><p>Thus, it needed to remove the cancer that had deteriorated.</p><br/><p>The Central Government didn’t care about Jiang Xie’s life or death. It only saw thousands of worlds.</p><br/><p>It released the repair task and erasure task. This wasn’t contradictory because they were both means of treatment.</p><br/><p>It was true that the former was milder and the treatment worked better, but in an emergency, the latter could also prevent excessive deterioration.</p><br/><p>Xie Xi knew all of this and was well prepared.</p><br/><p>He knew it would be a tough battle and he had to win!</p><br/><p>The moment he opened his eyes, Xie Xi seemed to hear Jiang Xie’s voice. “—I am here.”</p><br/><p>Xie Xi smiled. Of course, he knew that Jiang Xie was here and there was a lot of him!</p><br/><p>It was wonderful. Xie Xi was alone but he didn’t feel lonely.</p><br/><p>He opened his eyes and was a bit surprised.</p><br/><p>This was an extremely empty place surrounded by darkness. It was like a clouded wilderness without any smoke.</p><br/><p>Xie Xi moved and was surprised to find that he didn’t have a body.</p><br/><p>He couldn’t feel his limbs or the feeling of being on the ground. He was floating in the air.</p><br/><p>He tried to bow his head and found he was shrouded in black fog. Or should he say that he was the black fog?</p><br/><p>He didn’t know.</p><br/><p>Xie Xi tried to move. He wore that this movement was just a small step in his consciousness but his body seemed to have leapt for thousands of miles.</p><br/><p>It stood to reason that with the dark surroundings, he shouldn’t be able to know how far he had gone. However, Xie Xi, could clearly feel that he had moved at least three times around China!</p><br/><p>What was this situation?</p><br/><p>Xie Xi had experienced all sorts of strange identities but never a situation like this…</p><br/><p>Was a world that would be erased really unusual?</p><br/><p>In addition, there were still six worlds that would be erased. Xie Xi must be cautious!</p><br/><p>Xie Xi looked around and found it was still empty and dark.</p><br/><p>The surrounding black fog wasn’t the same as the black fog of his body.</p><br/><p>The surrounding area was lighter while the black fog of his body should be heavier, just like an ink painting.</p><br/><p>Xie Xi felt his body was a cloud of black fog and this place… who knew where this was!</p><br/><p>Xie Xi continued to move forward. His every movement was the equivalent of teleporting and he didn’t know where he was.</p><br/><p>This dark area was endless and filled the entire space.</p><br/><p>Xie Xi wasn’t in a hurry. He continued to move patiently, thinking he would go out sooner or later.</p><br/><p>He didn’t know how long he had travelled or how far he had gone when Xie Xi heard an intermittent noise.</p><br/><p>“…God… please… willingly… look…”</p><br/><p>What was this mess?</p><br/><p>First of all, the language was very strange. Xie Xi could only understand a bit of the pronunciation. The others were too vague or he didn’t understand.</p><br/><p>It was weird. Most players in Central had learnt the common language and as long as it was a language of the quasi-world, they would be able to understand it.</p><br/><p>Xie Xi went towards the source of the sound, wanting to know what was being said and the identity of this person.</p><br/><p>After approximately two steps, Xie Xi saw a slightly flashing point that exuded a weak brown light.</p><br/><p>Such a colour could easily be hidden in the darkness but Xie Xi could see it clearly. It was as insignificant as a grain of dust in the universe but Xie Xi saw it accurately.</p><br/><p>Brown?</p><br/><p>Xie Xi’s brain worked and he remembered the colours of the remaining six star signs.</p><br/><p>Libra seemed to be the brown light group. Was this Libra?’</p><br/><p>Xie Xi thought this while approaching the brown spot of light.</p><br/><p>The closer he got, the more clearly he could see.</p><br/><p>This small spot was very small, as small as a drop of water. However, through his little waterdrop, Xie Xi could see the world outside the darkness.</p><br/><p>It was an interesting perspective, like watching a movie in a movie theatre. It was dark but the vast world was seen on the screen.</p><br/><p>Xie Xi saw a young child with black hair and black eyes.</p><br/><p>He was born white and lovely, but his clothes were ragged and his hair of messy. The pair of dark eyes was great but didn’t contain a child’s innocence. Instead, endless hatred and resentment were swirling.</p><br/><p>Xie Xi became cold at the sight and stared blankly.</p><br/><p>The boy opened his mouth and the clear voice spoke words that Xie Xi couldn’t understand. “You are…”</p><br/><p>Xie Xi couldn’t understand the words afterwards but he was a bit surprised. The boy could see him?</p><br/><p>Xie Xi tried to make a sound but found that it only echoed in the darkness and didn’t enter the ‘waterdrop.’</p><br/><p>Thus, the boy couldn’t hear it at all.</p><br/><p>Xie Xi felt like a moviegoer trying to talk to someone in the movie. How could it be done?</p><br/><p>He stopped trying to speak.</p><br/><p>The boy went down on one knee, hair falling over his forehead and his voice full of piety and unabashed resentment.</p><br/><p>Xie Xi didn’t understand the words and could only vaguely distinguish ‘strength.’</p><br/><p>Was this boy begging for strength?</p><br/><p>Xie Xi felt this dark-haired teenager was a young Libra but they were separated by the ‘waterdrop’ and the feeling wasn’t that real.</p><br/><p>If this boy wanted strength… how could Xie Xi give strength?</p><br/><p>At this thought, a very fine black fog rushed to the water drop and like in drops, quickly polluted the clear water.</p><br/><p>Xie Xi saw the drop of water lingering in the black fog and saw more things.</p><br/><p>The place where the boy was located was actually a sea of corpses.</p><br/><p>At his feet lay horrible corpses. The purple-red blood was filled with unknown things and the white children looked strange and frightening.</p><br/><p>Xie Xi had seen many big scenes but was still shocked.</p><br/><p>What was going on?</p><br/><p>The boy stood in such a place and didn’t show the slightest bit of fear at this hellish scene. He wasn’t disgusted by the rancid smell or the blood. He wasn’t afraid of the darkness and coldness. He stood there, eyes staring straight at Xie Xi.</p><br/><p>Xie Xi couldn’t see any reflection from his eyes. It was all black and the eyes only contained endless darkness.</p><br/><p>The boy reached out to Xie Xi.</p><br/><p>For a moment, Xie Xi thought the boy was going to grab his heart.</p><br/><p>However, the boy just grabbed the black fog. The moment his palm touched the black fog, it was half corroded and blooded.</p><br/><p>This was a child’s palm but at this moment, it seemed like all the blood would drain from the boy’s body.</p><br/><p>Xie Xi was distressed but couldn’t do anything.</p><br/><p>The boy gritted his teeth. The bulging blue veins on his face showed he was obviously suffering great pain but he didn’t intend to let go. He held the black fog that almost swallowed him, grabbing it like it was the last piece of driftwood.</p><br/><p>A long time passed before the black fog was completely integrated into the boy’s body. He stood up straight and there was a black pattern on his wrist.</p><br/><p>It was a complex rose with distinct petals and a lifelike feeling. However, the pure black colour made it seem unknown.</p><br/><p>The boy bowed his head and kissed the black rose. He whispered, “…willing to be your loyal servant.”</p><br/><p>Xie Xi finally understood the words. The next moment, he felt that he had left the darkness and come to the place of the ‘waterdrop.’</p><br/><p>Xie Xi finally saw the entire scene.</p><br/><p>This seemed to be a magnificent hall but at this time, a river of blood was flowing.</p><br/><p>The main hall became a tomb that contained countless bodies.</p><br/><p>Xie Xi saw the boy leap up and turn into a black dragon in the sky.</p><br/><p>This was indeed Jiang Xie and perhaps it was Libra Jiang. Then there was the main problem. What was going on in this world?</p><br/><p>What was Xie Xi’s own situation?</p><br/><p>Why did he feel like he was a great villain?</p><br/>\n</div>"}