{"title": "Chapter 282 - Collapsing 7 Boundaries 23 (2)", "id": 282, "volume": 3, "url": "http://boxnovel.org/game-loading-chapter-282-collapsing-7-boundaries-23-2", "volume_title": "Volume 3", "body": "<h1>Chapter 282 - Collapsing 7 Boundaries 23 (2)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Collapsing 7 Boundaries 23 (2)</strong></p><br/><p>Jiang Xie released him and sneered. “I don’t know how many times I’ve dreamt of you. Every time, I would slash you with a thousand knives!”</p><br/><p>Xie Xi was pale. Something seemed to be extinguished from his eyes as his voice lowered. “Once I am dead, you won’t have such dreams again.”</p><br/><p>This sentence seemed to empty all his strength and his weak appearance evoked an old memory in Jiang Xie. He recalled the humble cave and the weak man who smiled so tenderly.</p><br/><p>A sharp sting covered his entire heart and Jiang Xie turned away.</p><br/><p>He came suddenly and stopped even more suddenly.</p><br/><p>Xie Xi fell to the ground, the chain hitting the ground and the clear sound ringing in the entire dungeon.</p><br/><p>The dazed Jiang Xie actually thought this was the cave and Xie Xi had accidentally dropped a bowl.</p><br/><p>It seemed that if he turned back, he could see the beautiful black eyes full of love, as if he was the only one in the world.</p><br/><p>Fake, all fake!</p><br/><p>He was bewitched by those eyes!</p><br/><p>Anger swallowed up his sense of reason. By the time his senses returned, he found that he had broken the chains binding Xie Xi.</p><br/><p>Xie Xi looked up at him blankly. “Little Xie?”</p><br/><p>Jiang Xie looked into the black eyes that were like a summer night, bringing infinite coolness and comfort to people on a hot day.</p><br/><p>This person used these eyes to keep saying, ‘Jiang Xie, I love you.’</p><br/><p>How ridiculous. To this day, his heart was still beating for his hypocritical man.</p><br/><p>Jiang Xie smiled with cold eyes. He grabbed Xie Xi’s chin and asked, “Beast King Rose, do you only seduce men?”</p><br/><p>Xie Xi’s eyes widened and his eyes dimmed, becoming grey.</p><br/><p>Jiang Xie kissed him in revenge. It was rough and imperious, with no gentleness.</p><br/><p>Xie Xi started to struggle, desperately trying to push him away.</p><br/><p>Jiang Xie placed him against a wall and spoke viciously, “Do you believe that I am here for you?”</p><br/><p>Xie Xi was motionless. His entire body looked frightened and he was as pale as a dead man who stopped breathing. “Little Jiang… kill me… kill me, okay?”</p><br/><p>Jiang Xie’s heart was dripping blood. It was absurd that looking at this person’s current appearance, he felt more pain then when this person tried to kill him.</p><br/><p>This man being in pain was worse than the despair of betrayal.</p><br/><p>Jiang Xie hated himself after realizing he was so mean and weak.</p><br/><p>He hated Xie Xi nad hated his incompetent self even more. He opened his mouth and spoke with no expression “It is just a kiss yet you want to die?”</p><br/><p>Xie Xi’s expression became even uglier.</p><br/><p>Jiang Xie smiled. “Is it shameful? Do you feel really bad? I want you to taste what I tasted!”</p><br/><p>He picked up Xie Xi and took him out of the dungeon.</p><br/><p>Xie Xi’s body was shaking but his heart thought… he could finally eat and drink!</p><br/><p>He was very steady throughout the whole process and every expression was controlled.</p><br/><p>The little lion could work hard. Once the ‘truth’ was exposed, this would be his crematorium!</p><br/><p>Jiang Xie took him out of the dungeon and all the guards were stunned. They wanted to come up to him and speak but the lion king’s pressure meant not one of them could move.</p><br/><p>There was a personal servant outside the dungeon and the servant was also shocked by the sight.</p><br/><p>Jiang Xie ordered in a low voice, “Go and prepare the bath.”</p><br/><p>The servant didn’t dare to ask and could only bow his head. “Yes.”</p><br/><p>Xie Xi wanted to have a bath. He might have the cleaning ball to keep himself clean but it was comfortable to soak in a hot bath.</p><br/><p>His heart was beautiful but his face was still nervous. He asked Jiang Xie in a trembling voice, “What are you going to do….”</p><br/><p>Jiang Xie took him back to the palace. Before placing Xie Xi in the bath, he grabbed a bottle of medicine and opened Xie Xi’s mouth to pour it in.</p><br/><p>Xie Xi was shocked but couldn’t break free at all.</p><br/><p>Jiang Xie was extremely fierce but there wasn’t much force in his hand. Half the medicine spilled out of the bottle.</p><br/><p>However, a few drops of this medicine was enough to make Xie Xi exhausted.</p><br/><p>After taking the medicine, Jiang Xie carried him to the bath. He was expressionless as he tore off Xie Xi’s clothes and threw him into the water.</p><br/><p>Xie Xi had no strength. His back was facing Jiang Xie and his black hair scattered. It was stained with water and became darker, the contrast very sharp.</p><br/><p>Jiang Xie entered the water and kissed Xie Xi.</p><br/><p>Xie Xi couldn’t move at all. In addition, the position was narrow and there wasn’t room to move.</p><br/><p>Jiang Xie didn’t say anything but under the water…</p><br/><p>He did the things like in the dream but Jiang Xie didn’t feel the slightest bit of happiness.</p><br/><p>Great sorrow and despair captured him. He retaliated and got revenge but his heart seemed to be placed on a cutting board and was cut to pieces.</p><br/><p>In the past nine years, Jiang Xie had countless dreams related to Xie Xi.</p><br/><p>The dreams had nothing to do with the Rose Palace. They were in the cave, the village, the endless wilderness…</p><br/><p>Xie Xi occasionally slept under the sun and occasionally held the tree trunk while waiting for him to collect the honey. Sometimes in the village, he would look over as if he noticed Jiang Xie’s gaze. Then Xie Xi would give a smile that only belonged to Jiang Xie.</p><br/><p>Jiang Xie felt that he wasn’t tempted by those dreams, it was the smile.</p><br/><p>Jiang Xie had observed that Xie Xi never looked at others with such a gaze and never gaze such a smile to others.</p><br/><p>This was his own, a gentleness that Xie Xi only gave him.</p><br/><p>It was full of endless indulgence and bone-deep love.</p><br/><p>Jiang Xie was captured by this love and indulged in Xie Xi’s deep feelings.</p><br/><p>However… this love was fake.</p><br/><p>Every time he woke up, Jiang Xie thought of Xie Xi’s last cold expression and his cruel words. “Since you know this, I can’t let you go.”</p><br/><p>Xie Xi wanted to kill him.</p><br/><p>Xie Xi was going to kill him…</p><br/><p>His Xie Xi was going to kill him…</p><br/><p>The despair that rose at that moment was more unbearable than the death of his family.</p><br/><p>For his family, Jiang Xie’s memories were limited to his father and his sister. He had no impression of the others.</p><br/><p>He was only one month old and his mother died giving birth to him. What could he remember?’</p><br/><p>There were only the fire and the screams for fear. His desire for revenge was bred from his desire for survival.</p><br/><p>Living was to get revenge.</p><br/><p>He fled the Lion Country and met Xie Xi.</p><br/><p>This was the real beginning of his life. Xie Xi was the person who gave him life.</p><br/><p>Yet the person who recognized his existence wanted to wipe him out.</p><br/><p>Leo didn’t shed any tears but his chest was always cold.</p><br/><p>In the end, Xie Xi fell asleep.</p><br/><p>Jiang Xie’s strength collapsed. He clung to Xie Xi as if he wanted to be embedded in the body. “Why…”</p><br/><p>Why…</p><br/><p>If time could be reversed, he wanted to stay in that small village forever and indulge in the unreal dream.</p><br/><p>Xie Xi actually experienced what it meant to be unable to get out of bed.</p><br/><p>Cough…</p><br/><p>In fact, it was quite fun.</p><br/><p>In any case, Jiang Xie didn’t dare to be really rough. Xie Xi pretended to faint and this guy held him with a tearful expression.</p><br/><p>If it wasn’t for Xie Xi being afraid to wake up then he would be roaring with laughter.</p><br/><p>A few days later, Xie Xi wasn’t afraid of the lion king dying. He was afraid that there would be holes in his heart and lungs.</p><br/><p>It was estimated that the fire was almost out and Xie Xi manipulated the robot.</p><br/><p>Jiang Xie didn’t allow anyone to get close to this section of the palace. He drove out all the servants and looked after Xie Xi alone.</p><br/><p>Xie Xi was similar to a plaything used to release energy. In any case, he couldn’t use the strength in his body and had to ‘stay in bed’, making him weaker.</p><br/><p>Jiang Xie didn’t show a good face to him and spoke words that were hard to hear, but his behaviour was extremely gentle and he didn’t allow Xie Xi to feel any discomfort.</p><br/><p>At first, Xie Xi asked Jiang Xie what he waned.</p><br/><p>Jiang Xie was expressionless. “To torture you.”</p><br/><p>Xie Xi stopped asking.</p><br/><p>In some ways, the high frequency of sex was quite torturous.</p><br/><p>The robot came to his place under the risk of death.</p><br/><p>The guards naturally didn’t dare to stop him. He was the saviour of the lion king and the teacher respected by the lion king.</p><br/><p>At this time, Jiang Xie was looking at a memorial to the throne (TL: an official communication to the emperor of China, generally careful essays in classical Chinese). Xie Xi slept on the soft couch beside him where Jiang Xie could see him. His explanation for himself was that he was afraid of Xie Xi’s tricks. As far as his heart was concerned… in any case, Xie Xi understood.</p><br/><p>The robot fell to the ground. “Your Majesty!”</p><br/><p>Jiang Xie put down the memorial with a cold expression. “Teacher, what are you doing?”</p><br/><p>“Your Majesty should be careful. Beast King Rose’s name might be ruined but he was once the god of war. You should behead him but actually humiliating him like this…”</p><br/><p>Jiang Xie read all the things in the memorial and threw it down. He got out and exclaimed, “This is my lone feud and how I handle him is up to me alone! You can’t talk about him!”</p><br/><p>“But you took him out of the dungeon and placed him in your bedroom. This is…”</p><br/><p>Jiang Xie was angry. “If Teacher only wants to talk about this then please leave!”</p><br/><p>The robot lay on the ground. “Your Majesty, you are getting married soon, but with a man like this… it will hurt the nation’s luck!”</p><br/><p>Xie Xi woke up just to hear this sentence and he cast a shocked look at Jiang Xie.</p><br/><p>Jiang Xie felt it but couldn’t turn his head.</p><br/><p>Xie Xi whispered, “You are going to be married?”</p><br/><p>The room was so quiet that the sound of breathing was clear and audible.</p><br/><p>Jiang Xie turned to look at him. “Why? DO you think that I still remember you and refused to get married?”</p><br/><p>The colour that Xie Xi gained over the past few days disappeared. “No…I… I’m happy for you.”</p><br/><p>Jiang Xie’s heart became a ball as he sneered. “You aren’t qualified to be happy for me.”</p><br/><p>Xie Xi lowered his eyes, his hands tightly holding onto the bed.</p><br/><p>The robot spoke again, “Your Majesty, the rolls of names contains the daughters of important ministers. You can’t be so cold to their hearts!”</p><br/><p>Jiang Xie was unable to restrain his anger. “These matters, there is no need for you to criticize or give orders!”</p><br/><p>The robot didn’t say anything. He inexplicably looked up at Xie Xi.</p><br/><p>Xie Xi lowered his eyes.</p><br/><p>Jiang Xie was aware of it and a strange feeling entered his heart. Even so, he didn’t think too much. He only thought that the teacher wanted to kill Xie Xi in his heart.</p><br/><p>That night, Jiang Xie didn’t do anything with Xie Xi and Xie Xi sat on the bed in a daze.</p><br/><p>Jiang Xie gazed at this person and felt that he was suffocating. He knew he should kill Xie Xi and that he shouldn’t be so ridiculous.</p><br/><p>However, if reason could kill emotions then there wouldn’t be so many helpless things in life!</p><br/><p>He couldn’t stay here any longer. He left the room and stood under the moonlight.</p><br/><p>Jiang Xie knew that Xie Xi couldn’t run. Xie Xi’s hands and feet were in a powerless state and he couldn’t escape over the palace walls.</p><br/><p>Just then, a dark shadow flashed.</p><br/><p>Jiang Xie’s sharp senses instantly discovered it.</p><br/><p>He quickly rushed back to the palace and discovered a man in black kneeling in front of Xie Xi.</p><br/><p>The man in black whispered, “Your Majesty, please go back with this old slave.”</p><br/><p>Xie Xi didn’t say anything but Jiang Xie was already furious. He immediately shot at the man.</p><br/><p>Fine! Xie Xi had a back hand and really wanted to escape!</p><br/><p>After several rounds of confrontation with the man in black, Jiang Xie felt a strong sense of familiarity.</p><br/><p>He tore off the masked man’s disguise.</p><br/><p>Once the old face appeared, Jiang Xie was stunned. “Teacher?”</p><br/><p>How could this be?</p><br/><p>This man rescued him from the Beast Forest and taught him martial arts. He was the teacher of the lion king? How could he be Xie Xi’s person?</p><br/><p>Xie Xi had been paving the way for so long for this trick.</p><br/><p>The robot fell to the ground and kowtowed three times with his head bumping against the ground. “I’m sorry Your Majesties, this old slave isn’t good, I can only…”</p><br/><p>Seeing that he was going to commit suicide, Jiang Xie aimed at his weapon with a short knife.</p><br/><p>Jiang Xie’s brain was in chaos as he approached and asked forcefully, “Tell me, what the hell is going on?!”</p><br/>\n</div>"}