{"title": "Chapter 284 - Can’t Be Erased 1", "id": 284, "volume": 3, "url": "http://boxnovel.org/game-loading-chapter-284-can%E2%80%99t-be-erased-1", "volume_title": "Volume 3", "body": "<h1>Chapter 284 - Can’t Be Erased 1</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Can’t Be Erased 1</strong></p><br/><p>Xie Xi pushed him away and asked, “What the hell is going on?”</p><br/><p>“Put on the cat ears and tail first and I will tell you.”</p><br/><p>Xie Xi, “…” He suddenly missed the souls!</p><br/><p>Jiang Xie told him, “I’ll just look and won’t do anything.”</p><br/><p>“You aren’t Aries. You are a grey wolf!”</p><br/><p>Jiang Xie had thick skin. “I am your grey wolf and only eat this kitten.”</p><br/><p>Xie Xi had thin skin and how could he compare with this old hooligan. He became angry. “Stop talking nonsense! I am furious.”</p><br/><p>Jiang Xie’s mouth was like a train but he had a sense of proportion. “Okay, I was just making a joke. You look good.”</p><br/><p>Xie Xi, “…” He really missed the honest souls!</p><br/><p>Jiang Xie still had a countdown above his head so Xie Xi didn’t dare speak nonsense. He quickly asked about business. “You woke up because you have recovered six souls?”</p><br/><p>Jiang Xie explained, “It should be that after the recovery of most of my souls, I have enough mental strength to break through the prohibition set by the Central Government.”</p><br/><p>Xie Xi was nervous when he heard the word ‘prohibition’ and asked, “Should you wake up like this?” He was afraid of a backlash.</p><br/><p>Looking at Xie Xi this way, Jiang Xie’s heart became as sweet as honey. “Rest assured, this is within the rules. As long as you are strong enough…”</p><br/><p>He paused and stopped.</p><br/><p>Xie Xi waited for the follow up. “What?”</p><br/><p>Jiang Xie acted cheap. “As long as you are strong enough, you can marry such a beautiful and charming baby…”</p><br/><p>Xie Xi was expressionless. “Get lost!”</p><br/><p>“Isn’t it correct? I am a living example?”</p><br/><p>Xie Xi knew Jiang Xie too well. This man could talk nonsense day and night without being tired but once it came to something dangerous, his mouth was as tight as a river and couldn’t be pried open!</p><br/><p>Xie Xi sneered. “If you don’t say it then rest. I am going to the next world.”</p><br/><p>After packing up so many souls, Xie Xi already moved from being bronze to a king. How could he not handle this bad thing?</p><br/><p>Jiang Xie spoke quickly. “I’ll say it, I’ll say it…”</p><br/><p>Xie Xi glanced at him.</p><br/><p>Jiang Xie’s thin lips were slightly raised and the rogue smile on Aries’ clean face made a sharp contrast, causing a person’s heart to miss a beat.</p><br/><p>Xie Xi didn’t want to see him!</p><br/><p>Jiang Xie explained, “I was afraid that you would dislike me for talking too big.”</p><br/><p>Xie Xi unceremoniously poked up. “When do you never speak big?”</p><br/><p>His credibility was low and Jiang Xie didn’t care. After so many worlds, Xie Xi even knew his underwear. What was so awkward?</p><br/><p>Jiang Xie told him, “Maybe we are strong enough to surpass even the Central Government.”</p><br/><p>Xie Xi’s eyes widened.</p><br/><p>Jiang Xie shook his index finger in front of the beautiful eyes. “Child, please return.”</p><br/><p>Xie Xi frowned and asked, “How can we go beyond Central?’</p><br/><p>“Who knows? That’s why I set a small goal for myself before meeting you.”</p><br/><p>Xie Xi stared at him blankly.</p><br/><p>Jiang Xie’s ability to talk about love was excellent. “Now that I found you, my only purpose is to be with you.”</p><br/><p>It sounded false but it was actually full of sincerity.</p><br/><p>The more contact Xie Xi had with the souls, the more he understood Jiang Xie and the more he knew the sad heart his person had hidden.</p><br/><p>People always needed a goal to love.</p><br/><p>Before Xie Xi came to Central, Jiang Xie found many goals for himself. For example, he didn’t hesitate to cute himself to pieces to design quasi-worlds and maintain the balance of the Central Government. He also guarded his friends living in Central while exploring the secrets of the Central Government. Perhaps by surpassing Central, he would find the value of his existence.</p><br/><p>Life was loss. In particular, if the heart was empty then it was most at a loss.</p><br/><p>Xie Xi was lucky enough to encounter Jiang Xie early but Jiang Xie had been lonely for many years.</p><br/><p>Xie Xi’s heart softened when he thought of this and he snuggled into the other person’s arms. “I don’t want to stay with a man who is lacking.”</p><br/><p>Jiang Xie laughed. “Lacking?”</p><br/><p>Xie Xi glanced at the six light groups. “Lacking a lot!”</p><br/><p>Jiang Xie was dissatisfied and moved Xie Xi’s hand. How can I be lacking? You try it. It is so big…”</p><br/><p>Xie Xi, “…” This guy’s brain was full of trash!</p><br/><p>Jiang Xie couldn’t help pressing the hand to his body. “Come, feel it…”</p><br/><p>“Don’t mess around. There is only an hour and a half.”</p><br/><p>Jiang Xie pointed above his head. “Do you see it moving?”</p><br/><p>Xie Xi looked up and found… the countdown was still!</p><br/><p>They had been talking for five or six minutes. How could it stay on the same time?</p><br/><p>Jiang Xie told him, “Rest assured, while I am awake, the countdown won’t change.”</p><br/><p>Xie Xi wondered, “What does this countdown really mean?”</p><br/><p>“You will know once you bring the souls back.”</p><br/><p>There were too few clues. Blindly guessing would only mislead themselves.</p><br/><p>Since the countdown didn’t change… Xie Xi couldn’t push this guy away.</p><br/><p>The two people were intimate and Xie Xi was so tired he couldn’t raise his arms. He had to draw a bath using the god’s wisdom.</p><br/><p>Jiang Xie opened his mouth. “This is the bath of the Lion Palace.”</p><br/><p>Xie Shi glanced at him.</p><br/><p>“Sir, you deceived me so badly.” He spoke using Leo’s voice.</p><br/><p>“You still have the face to say this!”</p><br/><p>Jiang Xie also pretended to be Houqing. “Your Majesty, do you truly love me?”</p><br/><p>Xie Xi glared at him. “Shall I take out my heart and show you?”</p><br/><p>Jiang Xie hugged him tightly. “Baby, I was wrong.”</p><br/><p>These previous emotional summaries… looking back, they were as thick as a wall and a bit unbearable.</p><br/><p>Too broken, what were these messy things!</p><br/><p>Xie Xi was angry but was afraid Jiang Xie was really bothered. He quickly said, “These things are all because of you.”’</p><br/><p>Jiang Xie’s response was immediate. “Yes, they are the fault of the brain-dead souls!</p><br/><p>Xie Xi’s mouth twitched. He was scolding himself? Oh, this was a guy who could kill himself.</p><br/><p>Xie Xi said, “It has nothing to do with the souls. If my world was collapsing, I would also think more pessimistically.”</p><br/><p>On Earth, Xie Xi lived alone in a dilapidated building for months without going outside. If his emotions could affect the world, it would probably be darker and more pessimistic.</p><br/><p>Jiang Xie’s heart was sweet but his hands weren’t obedient.</p><br/><p>Xie Xi was angry again. “You are finished!”</p><br/><p>Speaking of which, he thought many times in the small worlds that he should make this guy suffer abstinence!</p><br/><p>Jiang Xie said, “I won’t do anything. I just want to hold you.”</p><br/><p>Hugging wasn’t enough. He had to hold Xie Xi close to feel the heart.</p><br/><p>This was Jiang Xie’s rich vocabulary.</p><br/><p>It was probably only by hugging the person you love that you could realize it.</p><br/><p>The two men were tired for a while and also exchanged information about these worlds.</p><br/><p>Xie Xi told him, “I was too careless and met two souls at once.”</p><br/><p>The two together was really terrible. It gave the souls fertile soul to abuse themselves and they swallowed a knife.</p><br/><p>Jiang Xie replied, “Maybe it wasn’t that you were careless…”</p><br/><p>“What do you mean?”</p><br/><p>Jiang Xie indicated to the light groups. “There is a certain connection between the quasi-worlds and this place. Perhaps Virgo couldn’t wait and deliberately made you fall to meet him.”</p><br/><p>Xie Xi’s eyes widened. “This is possible?”</p><br/><p>“Why not? Houqing’s state…”</p><br/><p>He paused and didn’t say anything else.</p><br/><p>Xie Xi understood. Houqing’s state was too serious and the quasi-world was collapsing too much, so he hoped that Xie Xi would bring him out first?</p><br/><p>Xie Xi couldn’t help his heart tensing. “There are still six light groups. Will there be another quasi-world in a serious state?”</p><br/><p>Jiang Xie’s eyes flashed.</p><br/><p>Previously, Xie Xi might’ve ignored it but he had experienced too much. The character of this person when his life was threatened was clear.</p><br/><p>Xie Xi asked, “What you said before… that the Central Government won’t release the tasks of erasing your collapsed worlds. That is false!”</p><br/><p>Jiang Xie noticeably stopped.</p><br/><p>Xie Xi was anxious. “Will it be released?”</p><br/><p>Jiang Xie sighed. “The Central Government probably won’t take care of me because I am your husband…”</p><br/><p>Xie Xi, “…” He was still shameless!</p><br/><p>Xie Xi opened his mouth. “If any collapsed worlds have an erasure task released then…”</p><br/><p>Erasing meant completely obliterating the quasi-world. If the souls didn’t survive then… what would Jiang Xie do?</p><br/><p>A chill went down his neck and Xie Xi couldn’t help shivering.</p><br/><p>If Jiang Xie died then he didn’t have the courage to live alone.</p><br/><p>Jiang Xie felt heartache and hugged Xie Xi. “Don’t worry, even if someone receives the erasure task, they won’t be able to complete it.”</p><br/><p>Xie Xi was startled.</p><br/><p>“The lowest level of the quasi-world I designed is S grade. The level of the quasi-world grows with the erasure tasks and it might grow to super god level. There are few people in Central capable of it.”</p><br/><p>Xie Xi didn’t believe it. “It doesn’t need many people. One person is enough!”</p><br/><p>He knew the N of Yunge was a god level player like X!</p><br/><p>Jiang Xie cleared his throat. “That old N, he rarely courts disaster.”</p><br/><p>Xie Xi wasn’t fooled by him. “Even if it is the only super god mission in Central, a mission that even X hasn’t cleared?”</p><br/><p>Jiang Xie, “…” The child was really becoming more difficult to fool.</p><br/><p>There was nothing wrong with Xie Xi’s thoughts.</p><br/><p>The higher the task level, the higher the rewards.</p><br/><p>The master of Yunge didn’t lack anything but X was always standing in front of him.</p><br/><p>Whoever won the position was good? Who was willing to be crushed?</p><br/><p>No to mention that Jiang Xie was arrogant. The master of Yunge would want to win against him once.</p><br/><p>If the Central Government released the erasure task, the master of Yunge wouldn’t know that this was the quasi-world designed by Jiang Xie but he would be certain that Jiang Xie hadn’t completed such a high level task…</p><br/><p>He would see it was worth a try!</p><br/><p>Xie Xi thought of this and Jiang Xie naturally already knew it.</p><br/><p>Jiang Xie comforted him. “Even if Old N really went, it is impossible to kill the souls. Don’t forget, the souls are me. If the quasi-world is upgraded to a super difficult level, the souls will break free of their restrictions and this is equivalent to the peak me.” Jiang Xie blinked. “In a fight, N has never once won against me.”</p><br/><p>Xie Xi sneered. “Do the souls have skills and items equivalent to several lives?”</p><br/><p>Jiang Xie, “…”</p><br/><p>In Central, Jiang Xie and N fought one on one but there was no fairness in a collapsed world.</p><br/><p>It was like a full level player fighting the highest level boss. Even if the player was much weaker than the boss, the final winner was the player!</p><br/><p>Xie Xi was panicked. He wanted to hurry into the quasi-world and bring the souls out!</p><br/><p>The so-called fear of what was coming…</p><br/><p>Xie Xi was feeling uneasy when the remaining six light groups suddenly changed colours.</p><br/><p>The light groups that originally represented the colour of their respective constellations became black.</p><br/><p>The mirror-like light groups became spiral shaped and the deepening darkness gave an unknown feeling.</p><br/><p>Xie Xi grabbed Jiang Xie’s hand.</p><br/><p>Jiang Xie held him and his voice was still calm. “Don’t be afraid.”</p><br/><p>Xie Xi’s voice trembled. “Has the erasure mission been released for them?”</p><br/><p>“Yes.”</p><br/><p>In such a dangerous moment, Jiang Xie’s psychological quality was fully revealed. He had experienced too many life and death situations and wandered on the edge of a cliff countless times. The more violent the situation and the more danger he was in, the calmer his mind became.</p><br/><p>This infected Xie Xi. His panicked heart calmed down and he gently breathed out. “We still have the repair task. We must take the souls ahead of them!”</p><br/><p>Jiang Xie replied, “No problem.”</p><br/><p>As if listening to Xie Xi’s voice, the six black light groups fused into a single huge vortex.</p><br/>\n</div>"}