{"title": "Chapter 288 - Can’t Be Erased 5", "id": 288, "volume": 3, "url": "http://boxnovel.org/game-loading-chapter-288-can%E2%80%99t-be-erased-5", "volume_title": "Volume 3", "body": "<h1>Chapter 288 - Can’t Be Erased 5</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Can’t Be Erased 5</strong></p><br/><p>What damned killing? This translation couldn’t even match the number of words!</p><br/><p>Wasn’t God omnipotent? What was he? Why did he say such unfavourable things?</p><br/><p>Libra, what trash thing did you summon?</p><br/><p>Xie Xi had been with Jiang Xie for so long that he was inevitably infected. He learnt how to scold himself!</p><br/><p>Hearing the ‘sacred words’, the handsome young man knelt down, black hair hanging over his ears. “Your most loyal servant will fulfill your command.”</p><br/><p>Xie Xi, “…” He didn’t want to train his sweetheart into a killing machine!</p><br/><p>Xie Xi still wanted to communicate and tried to open his mouth. “You…”</p><br/><p>Then he heard a voice come from the sky. “Very good.”</p><br/><p>Xie Xi dropped the script. How did this make people act?!</p><br/><p>Libra kissed the black rose, his attitude sincere and his beliefs firm. It seemed he was about to go kill and set fires.</p><br/><p>Xie Xi gave up on communicating. If he spoke more then it would be really wrong. He would obediently shut up!</p><br/><p>Xie Xi was still limited by this black fog and couldn’t be too far from Libra. Once he was half a metre away, he felt a barrier he couldn’t get through.</p><br/><p>According to this progress, Libra needed to kill more people before Xie Xi could have a real body?</p><br/><p>Xie Xi wanted to be a person!</p><br/><p>The black fog could only use words to communicate while as a person, there were many other ways to communicate his feelings!</p><br/><p>Let’s do this first…</p><br/><p>Xie Xi comforted himself, ‘This is a collapsing world. There is essentially no life or death.’</p><br/><p>What’s more, Libra tried to avoid hurting innocent people.</p><br/><p>Xie Xi felt the constraints on Libra and returned to the black fog.</p><br/><p>This type of black fog wasn’t suitable to follow Libra. There was no benefit apart from giving him psychological pressure.</p><br/><p>The little black dragon’s situation was already bad enough and Xie Xi didn’t want to give him more pressure.</p><br/><p>The black fog dispersed and Libra obviously relaxed.</p><br/><p>He looked at the black rose on his wrist and there were no waves in his calmness. Just.. his lips curved slightly.</p><br/><p>Libra didn’t hide his actions and soon became the most horrible existence that the human kingdom was eager to annihilate.</p><br/><p>This place was called the kingdom of Fare. it was rick and power and one of the six great powers of the humans. It was known for its fire magic.</p><br/><p>There were paladins who once participated in the battle of the gods and received the reward of the dragon god. This had long become a legend.</p><br/><p>Its peak might’ve passed but the glory was still there. Libra was so aggressive that the Fare Kingdom definitely couldn’t ignore it. At first, only a border city issued a reward but it soon spread all over the country.</p><br/><p>The strength of the people who came to kill Libra obviously improved but Libra’s progress was faster.</p><br/><p>The little black dragon became a giant. If this was a game, he would have 100% physical resistance and 100% magic resistance.</p><br/><p>The slightly regretful thing was that Libra found it almost impossible to use magic. He was incapable of it in dragon form and could only use the flames.</p><br/><p>These flames could burn ordinary people to ash but they could be blocked by some special equipment.</p><br/><p>His real attacks came in human form. His speed was as fast as lightning and his melee attacks were almost unstoppable. The only drawback was that he had no physical weapons.</p><br/><p>Once his human form was injured, Libra was slow to recover and he didn’t dare change back into his dragon form.</p><br/><p>It was because the wounds would enlarge with his body shape and change. It would recover even more slowly.</p><br/><p>Libra couldn’t completely eliminate everyone and sooner or later, there would be escaped people who summed up their experience.</p><br/><p>Xie Xi was worried in his hurt.</p><br/><p>He wasn’t worried that the indigenous people would hurt Libra, he was afraid of a player.</p><br/><p>The erasure task had been released and perhaps players had entered…</p><br/><p>Xie Xi was nervous and feared missing an opportunity to identify them.</p><br/><p>If he could use the god’s wisdom then he would look at Jiang Xie’s most commonly used weapons and draw then for him!</p><br/><p>What was Yunge? What leader wouldn’t want to complete the task?</p><br/><p>There was another wave of attacks. Libra moved from morning to night and it was unknown how many people he killed.</p><br/><p>By the time the moon hung in the air, his feet were already covered in corpses.</p><br/><p>Libra sighed and looked pale.</p><br/><p>These waves of battles meant that Libra’s consumption wasn’t small. He might’ve deliberately attracted more people but this time there was a bit too much.</p><br/><p>His physical strength was capped and it was fortunate that the other side had been so frightened they escaped and didn’t dare come again.</p><br/><p>Libra calmed down his breathing and tore open his bloody clothes, revealing his white wrist.</p><br/><p>The black room bloomed in the middle of his wrist. The petals swayed and show a strange lustre in the darkness.</p><br/><p>Libra chanted the long prayer in a low voice. Countless blood and an unknown white gas rose from the sea of corpses, flowing into Libra’s wrist like a hundred rivers.</p><br/><p>There was no doubt that this offering was of an unprecedented quantity and quality.</p><br/><p>The rose was almost dyed a bright red.</p><br/><p>Once all the corpses became dry leaves, the mirror appeared again.</p><br/><p>This seemed to present Libra’s experience. Why was there such a step? It was true that this was very good for Xie Xi so he could understand Libra, but what good was it for Libra?</p><br/><p>Wasn’t looking at such painful experiences equivalent to opening up an injury and sprinkling salt on them.</p><br/><p>Perhaps it was because if he wanted to grow up, he would have to face the heaviest pain in her heart?</p><br/><p>Xie Xi looked into the mirror and saw the juvenile Libra.</p><br/><p>Xie Xi stared blankly…</p><br/><p>Libra had just been a young boy when Xie Xi first met him and grew up using Xie XI’s power. Then why was there a teenage Libra in the mirror?</p><br/><p>Did the mirror show the future?</p><br/><p>Xie Xi looked at Libra and saw the hatred ingrained in his bones.</p><br/><p>He wasn’t looking at the future. This was clearly the past.</p><br/><p>Inside the mirror was a magnificent hall with huge stone pillars soaring into the sky. The architecture was magnificent and grand beyond the capabilities of humans.</p><br/><p>Xie Xi saw the dragon passing by at a low altitude and understood that this was dragon territory!</p><br/><p>The youthful looking Libra was gently received by a dragon elder.</p><br/><p>“I was deeply saddened to hear that your mother died. She was an excellent follower of the dragon god. She will be buried and I will pray for her, wishing for her happiness in the next life.”</p><br/><p>It could be imagined what the teenager experienced after his mother passed away. Now he met his own people and there was such a kind-hearted elder. His hard heart would soon melt.</p><br/><p>The elder told him, “The black dragons are responsible for disciplinary punishment of crimes. It is easy to be mistaken for a demonic dragon by ignorant humans but in fact, you are an indispensable fighter for us dragons.</p><br/><p>The young man’s black eyes lit up like a person walking in the darkness and finally seeing the dawn.</p><br/><p>The elder patted him on the shoulder. “Train well, the dragons need such a good young man like yourself.”</p><br/><p>The teenager couldn’t speak very well. “G-Good.”</p><br/><p>His voice was very good but was filled with nervousness that had never been seen before.</p><br/><p>The elder was smiling but there was a trace of contempt in his eyes.</p><br/><p>It could clearly be seen that Libra believed it.</p><br/><p>He became the knife of the dragons. Under the name of punishing crimes, he became the dragon’s killing machine.</p><br/><p>The dragons trained him into a first-class assassin but didn’t allow him to touch the dragon’s most important exercises.</p><br/><p>The dragon elder told Libra, “Us dragons have special physiques and weak affinity for elements. It isn’t recommended to practice magic. You just need to train in close combat.”</p><br/><p>If Libra hadn’t been in the form of a black dragon, it would be unknown how many times he would’ve died because of the elder’s words.</p><br/><p>The black dragon might’ve become a sharp knife but the dragon elders were still very afraid of him.</p><br/><p>The dragons definitely had the strongest physique on the continent but Libra was obviously too strong.</p><br/><p>The black dragon form, which defended against almost all attacks, couldn’t be compared to the golden dragon.</p><br/><p>The elder told Libra, “You are truly the strongest warrior of the dragon clan!”</p><br/><p>The teenager smiled for the first time since his mother died and he saluted. “I am proud to be part of the dragon clan!”</p><br/><p>The elder smiled and didn’t express the bad thoughts in his heart.</p><br/><p>Seeing the end, Xie Xi probably understood Libra’s wish.</p><br/><p>As time went by, Libra became stronger and stronger. No matter how dangerous the tasks assigned to him, he could complete them.</p><br/><p>This didn’t reassure the dragons but made them more vigilant.</p><br/><p>Then Libra killed the elf king who had been secretly fighting with the dragons.</p><br/><p>The dragon’s enemy was gone and the knife should be hidden.</p><br/><p>Libra had been with the dragons for hundreds of years but he had no friends. Every day involved training and missions. He was a person living in the shadows.</p><br/><p>Even so, his people refused to give him the last way to live.</p><br/><p>Once the dragon elites attacked him, the black dragon fully understood.</p><br/><p>He knew that he had been exploited for hundreds of years, knew that he hadn’t been accepted by anyone from beginning to end and knew he hadn’t been needed since birth.</p><br/><p>This was the last straw that crushed the camel and Libra rebelled.</p><br/><p>The dragon elites weren’t weak humans. They not only attacked his body, they also destroyed his spirit.</p><br/><p>“The dragons never had a black dragon! You are the product of the devil!”</p><br/><p>“In charge of discipline and punishment? This devil deserves it!”</p><br/><p>“Go to hell, your dirty black monster!”</p><br/><p>The thoroughly disappointed and desperate Libra summoned the true evil god.</p><br/><p>He emptied his blood that was filled with infinite resentment and hatred. He used his whole soul and body as a sacrifice to sign a contract with the evilest existence in heaven and earth.</p><br/><p>Xie Xi finally figured out who he was…</p><br/><p>The evil god???</p><br/><p>He just wanted to mix with the gods, not be an evil god!</p><br/><p>This sounded really brain damaged with the strong taste of poop!</p><br/><p>If this wasn’t Jiang Xie’s quasi-world, Xie Xi was 100% certain that he would’ve been dealt with early by the protagonist and then eaten in a lunchbox!</p><br/><p>The mirror disappeared and Libra was covered in the black fog. The growth that looked painful began.</p><br/><p>Once the black fog faded, Libra was already an adult. His naked, solid body was full of strength and his smooth skin was covered with muscles, demonstrating the full charm of a mature male.</p><br/><p>This time, Xie Xi finally got a sense of a body.</p><br/><p>The black fog emerged from the rose and quickly condensed. A tall man in a black cloak appeared out of thin air.</p><br/><p>Libra was surprised and got down onto one knee.</p><br/><p>His startled glanced noticed the long black hair under the cloak falling on smooth white skin.</p><br/><p>Xie Xi could become a person. The problem was… where were his clothes?</p><br/>\n</div>"}