{"title": "Chapter 298 - Can’t Be Erased 15", "id": 298, "volume": 3, "url": "http://boxnovel.org/game-loading-chapter-298-can%E2%80%99t-be-erased-15", "volume_title": "Volume 3", "body": "<h1>Chapter 298 - Can’t Be Erased 15</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Can’t Be Erased 15</strong></p><br/><p>Xie Xi’s expression sank as he ordered, “Let go.”</p><br/><p>Sagittarius told him, “I will let go if you come back to my room with me.”</p><br/><p>Xie Xi, “…”</p><br/><p>Sagittarius was in a good mood. “You haven’t even erased the traces. Isn’t this inviting me?”</p><br/><p>Previously in Libra’s room, Sagittarius drank his blood. Xie Xi had angrily scolded him and he disappeared without a trace.</p><br/><p>Xie Xi still felt regret and was afraid he was really angry…</p><br/><p>Then many things happened. Xie Xi had no experience with his blood being sucked. How did he know that he had to erase the tooth marks?</p><br/><p>Although this evil god body did have the ability.</p><br/><p>Sagittarius deliberately pulled down Xie Xi’s collar, the tip of his tongue touching the two red dots.</p><br/><p>This was definitely for Scorpio to see but there were others at the scene.</p><br/><p>Zong Xia was following Sagittarius while Yan Zhe was following Scorpio. They both quietly bowed their heads.</p><br/><p>But their shoulders were shaking violently!</p><br/><p>Xie Xi was mad and yelled at Sagittarius. “I said, release me!”</p><br/><p>Sagittarius was even happier. “If you really want me to leave, why not use your pressure?”</p><br/><p>What pressure?</p><br/><p>Xie Xi was just dabbling as a god, how could he know so much?</p><br/><p>Sagittarius glanced at Scorpio. “Are you worried about other people? It’s nothing. You are our master and anything you want is fine.”</p><br/><p>He was clearly implying that Xie Xi wanted to go with Sagittarius but he had to push Sagittarius away because he promised Scorpio. He was actually reluctant and hoped that Scorpio would take the initiative to leave.</p><br/><p>After all, Xie Xi just needed to release his pressure that Sagittarius couldn’t approach him at all.</p><br/><p>In the area channel, Gong Rui asked: What is your situation?</p><br/><p>Yan Zhe: ……</p><br/><p>Zong Xia: ……</p><br/><p>Based on the ellipsis, Nan Yi and Gong Rui knew there was a good play: What are you doing? Live broadcast it!</p><br/><p>Yan Zhe scolded: Fuck, Old Jiang used a lifetime of good luck to meet Little Rose!</p><br/><p>Hearing this, Nan Yi became more excited!</p><br/><p>It was reasonable to be so excited. He was just afraid that he had to eat quick-acting heart-saving pills afterwards.</p><br/><p>Xie Xi was worried about how to stabilize Sagittarius and Scorpio.</p><br/><p>Sagittarius was worthy of being an archer. His archery skill was really good and the arrow didn’t miss. The heart was red.</p><br/><p>Scorpio stood silently but unfortunately, his heart was poked into a honeycomb.</p><br/><p>Xie Xi was really innocent. How could he know that there were traces on his neck? How could he know that he could use pressure to break away from Sagittarius’ arms?</p><br/><p>He didn’t know but who could believe this?</p><br/><p>Oh, Zong Xia and Yan Zhe would believe it but what was the use of that?</p><br/><p>At the critical point when Yan Zhe was worried for Xie Xi, Scorpio leaned over in a bow. “Since Master has other arrangements, I will go first.”</p><br/><p>Everyone present was stunned, including Sagittarius.</p><br/><p>The cold face of the undead looked calm and his deep purple hair slid down his cheeks to outline his perfect side profile.</p><br/><p>Xie Xi’s heart thumped.</p><br/><p>Scorpio turned to leave without hesitation, heading straight to his room. The surprised Yan Zhe followed.</p><br/><p>Zong Xia also stared blankly and asked in the area channel: Scorpio just left?</p><br/><p>Yan Zhe felt doubts: His temper is so good? Is this really Old Jiang?</p><br/><p>This showed how inexperienced they were.</p><br/><p>Seeing this scene, Xie Xi didn’t feel any relief. He only felt that his back was cold and he could faintly see a trick brewing!</p><br/><p>So many quasi-worlds and so many souls, not one of them had given up.</p><br/><p>Some just gave up on the surface while doing big things in the back!</p><br/><p>Poor Xie Xi was tangled up on Sagittarius and he couldn’t use the communicator to contact Yan Zhe to tell him not to take things lightly!</p><br/><p>Sagittarius was in a good mood after getting rid of Scorpio. He leaned towards Xie Xi, deep voice ambiguous. “They all ate at dinner, only I have been waiting. Won’t you please satisfy me? I will also satisfy you.”</p><br/><p>Xie Xi, “………………”</p><br/><p>Zong Xia stared at his toes without blinking, as if he was superfluous. Oh, he was already superfluous…</p><br/><p>Scorpio had already gone and if Xie Xi caught up know, it was estimated that Sagittarius would explode on the spot.</p><br/><p>There were no tricks yet. He might feel uneasy but he could only beware of Scorpio while seizing the time to stabilize this person.</p><br/><p>Xie Xi told Sagittarius, “Only blood is allowed.” There were people present and Xie Xi was really embarrassed to say the other thing.</p><br/><p>Sagittarius didn’t care about these things and opened the door. “In the bloodkin family, it is very rude to suck blood without sex!”</p><br/><p>Zong Xia, “…” His knowledge increased.</p><br/><p>Xie Xi’s cheeks were hot but he didn’t dare send Zong Xia away. Having one person here was better than having no one.</p><br/><p>If Sagittarius really messed with him, he was afraid he wouldn’t be able to control himself.</p><br/><p>In any case, Xie Xi believed that Jiang Xie wouldn’t let anyone see him… like that.</p><br/><p>Sagittarius leaned back and said, “During the day, I was already very nervous. You are my most respected person. How could I do that to you?”</p><br/><p>Xie Xi had long been used to this person’s nonsense but it was clearly the first time for the others.</p><br/><p>Zong Xia spoke in the area channel: Is there a question?</p><br/><p>Everyone pricked their ears.</p><br/><p>Nan Yi: Quickly say it!</p><br/><p>Gong Rui: Please enjoy it alone if it is dog food.</p><br/><p>Zong Xia explained the etiquette of the bloodkin species.</p><br/><p>This made Nan Yi very happy: Seconds!</p><br/><p>Yan Zhe: Really shameless.</p><br/><p>Gong Rui spoke lazily: I refuse to accept dog food.</p><br/><p>The serious Qin Ge was worried about something: In this case, Sagittarius did it with many people before…</p><br/><p>Zong Xia also wondered this and at this time…</p><br/><p>He directly copied Sagittarius’ exact words.</p><br/><p>Sagittarius told Xie Xi, “I didn’t drink any blood before I met you. At that time, you promised me that you would never let me go hungry afterwards.”</p><br/><p>Old Qin was silent. It could still be like this?</p><br/><p>Sagittarius’ eyes flashed. “Please meet me? My master.”</p><br/><p>Gong Rui: It seems that Little Rose will be with the lucky Sagittarius tonight?</p><br/><p>Zong Xia: Should I withdraw?</p><br/><p>Nan Yi: Hurry away! You shouldn’t see what you shouldn’t see or something big will happen when we return to Central!</p><br/><p>Then Yan Zhe suddenly said: Scorpio is gone!</p><br/><p>He didn’t say it on the area channel but through the communicator Xie Xi had arranged for them.</p><br/><p>Gong Rui and the others hadn’t responded yet but Xie Xi thought in his heart, ‘Sure enough, something happened!’</p><br/><p>Sagittarius blocked Xie Xi’s retreat.</p><br/><p>He said that he wouldn’t let Xie Xi go tonight.</p><br/><p>Sagittarius brought Xie Xi towards his room while kissing Xie Xi on the neck. He whispered, “Please, I’ve never really eaten enough. Can you bear to see your most loyal follower hungry?”</p><br/><p>“My god…” Sagittarius dragged Xie Xi to his room. “Please have mercy on your shoulder.”</p><br/><p>His words had just ended when an ancient voice was heard. “Master trusts you so much. Is this how you pay him back?”</p><br/><p>Sagittarius saw Capricorn standing coldly at the door.</p><br/><p>Xie Xi still remembered Scorpio’s sudden disappearance.</p><br/><p>Behind Capricorn, scattered black feathers floated. Xie Xi could see clearly that these feathers formed a transparent barrier, blocking the sound.</p><br/><p>It was in order to not let Qin Ge hear them.</p><br/><p>He told Sagittarius, “Pisces is sleeping and his servant is under my supervision. Aquarius is injured and his servant will be handed over to you.”</p><br/><p>Sagittarius’ eyes squinted. “Where is Scorpio?”</p><br/><p>Capricorn replied, “He went to catch the escaped intruders.”</p><br/><p>Xie Xi, “!”</p><br/>\n</div>"}