{"title": "Chapter 295 - Can’t Be Erased 12", "id": 295, "volume": 3, "url": "http://boxnovel.org/game-loading-chapter-295-can%E2%80%99t-be-erased-12", "volume_title": "Volume 3", "body": "<h1>Chapter 295 - Can’t Be Erased 12</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Can’t Be Erased 12</strong></p><hr/><br/><p>Sure enough, the Jiang Xies were worthy of being protagonists. None of them were inferior to the other and they had their own characteristics.</p><br/><p>Xie Xi couldn’t tell which one was Aquarius and which one was Pisces but it didn’t matter. They were all Jiang Xies.</p><br/><p>The dark elf and sea demon bowed to Xie Xi. Their respectful appearance fell into Yan Zhe’s eyes and it was really strange.</p><br/><p>Who had seen this? The person known as Old Jiang of Central would actually fall his knees and so skillfully as well.</p><br/><p>Nan Yi yelled in the area channel, “Old Jiang has a strict wife!”</p><br/><p>Gong Rui told him off. “Don’t take up resources. I’m recording!” What was the fuss about such an obvious thing?</p><br/><p>Yan Zhe spoke slightly, “Shouldn’t you use the resources to disclose information?”</p><br/><p>In the quasi-world, there were limits to the transmission of information. If they wanted to record a ‘video’ then they couldn’t communicate with their teammates over along distance.</p><br/><p>Gong Rui replied, “It doesn’t matter. They’ve bee caught anyway.”</p><br/><p>They could meet and chat. Why waste memory space?</p><br/><p>Yan Zhe couldn’t say anything to refute this. After all…</p><br/><p>Compared to disclosing information, it was funnier to record the wonderful memories of Old Jiang’s shame.</p><br/><p>Poor Xie Xi wasn’t in their team and couldn’t see their ‘private chat.’</p><br/><p>Of course, it didn’t matter if he couldn’t see it. He could guess 70-80% of it.</p><br/><p>After getting up, the sea demon moved the hem of his clothing and Qin Ge and Zong Xia, who were tied up by flowers, fell from the sky like dogs.</p><br/><p>The two people didn’t know that the script had changed from a survival adventure to a melon-eating drama and were still on alert.</p><br/><p>At least, until they saw Xie Xi.</p><br/><p>Qin Ge stared blankly.</p><br/><p>Zong Xia blinked his eyes. He had been suffering from illusions and was trying to determine if this was true or false.</p><br/><p>The dark elf pressed them to the ground with a cold voice. “Looking directly at the evil god is an inexcusable sin.”</p><br/><p>Qin Ge and Zong Xia were forced to bow their heads and their appearance was dismal.</p><br/><p>His teammates…</p><br/><p>“Hahahahaha.”</p><br/><p>“Old Jiang is expressing his heart. He wishes for all the people who stare at Little Rose to die!”</p><br/><p>Gong Rui concluded, “Be careful in the future. Maybe we will all be written down in this vinegar jar’s notebook.”</p><br/><p>Thanks to the ‘area channel’, Qin Ge and Zong Xia also saw the foolish dialogue of their teammates that kept rising from the lower right corner of their line of sight.</p><br/><p>Qin Ge looked confused. “Is this really Xie Xi? Jiang Xie as well?”</p><br/><p>No one answered him. The trio were enjoying unprecedented pleasure.</p><br/><p>Zong Xia removed his gaze and said, “It really is Xie Xi but I didn’t see Jiang Xie.”</p><br/><p>Yan Zhe was kind and gave him a slight explanation. Because he was too kind, he got straight to the point. “There are a total of six Jiang Xies and Little Rose has to fall in love with six of them at the same time!”</p><br/><p>Qin Ge and Zong Xia, “…………..”</p><br/><p>Nan Yi burst out laughing. “We can play and balance the account with our captain!”</p><br/><p>He would only call Jiang Xie captain when he was gloating over Jiang Xie’s misfortune and that happened perhaps once every one thousand worlds.</p><br/><p>Xie Xi didn’t know this and fortunately, he didn’t know it or he would want to quit!</p><br/><p>What was this play? Minutes of laughter?</p><br/><p>The dark elf subdued the two intruders and asked Xie Xi, “What should I do with them? Should I just kill them?”</p><br/><p>Xie Xi, “!” What killing? They were his brothers!</p><br/><p>Xie Xi was anxious but his face had to be steady. Too much experience told him that if he was too concerned about someone, he was just giving them a death buff!</p><br/><p>Xie Xi calmly said, “Keep them. They can still be useful.”</p><br/><p>The dark elf bowed. “Yes.”</p><br/><p>Xie Xi was eager to settle the five teammates and needed to send the Jiang Xies away first.</p><br/><p>He spoke again. “You worked hard. Go to rest and hand it over to me.”</p><br/><p>How could Xie Xi think he would casually open a wonderful prelude?</p><br/><p>Capricorn stated, “I will wait for you here.”</p><br/><p>Xie Xi didn’t think too much and told the dark elf and sea demon, “The people have been caught and you must be tired. Go first.”</p><br/><p>The dark ef raised his narrow eyebrows. “Let me stay. This big man has a very special ability and I want to report it to you.”</p><br/><p>Xie Xi paused.</p><br/><p>At this time, the sea demon also opened his mouth. His voice was very special and contained a magnetic feeling. “Master, Capricorn has been waiting for you all day and Aquarius was injured subduing the invaders. Let them rest and I will serve you.”</p><br/><p>Xie Xi, “………………”</p><br/><p>Did the performance start?</p><br/><p>Capricorn spoke up, “Aquarius, since you are injured, go and recuperate. Pisces, you’ve also used a lot of illusions and are injured. How can you serve the master?”</p><br/><p>The dark elf wasn’t willing to show weakness. “It is a slight wound and has recovered a long time ago.”</p><br/><p>Sea Demon Pisces also found it impossible to take the first step. “I don’t need illusions to clean up the intruders.”</p><br/><p>Hearing their words, Qin Ge and Zong Xia spoke in unison in the area channel, “It truly is Jiang Xie.”</p><br/><p>The other three filled the screen with ‘hahahahaha.’</p><br/><p>Xie Xi regretted it. He regretted giving himself a chance to be humiliated on the spot!</p><br/><p>Fortunately, the business ability of a slag was quite strong and the ability to coax Jiang Xie was embedded deep into his bone marrow. At the same time, he developed extremely superb techniques to handle Jiang Xie.</p><br/><p>He was able to cope in such awkward moments.</p><br/><p>Xie Xi glanced at the dark elf. “Are you hurt?”</p><br/><p>Aquarius immediately replied, “It isn’t a hindrance.”</p><br/><p>Xie Xi demanded, “Show me.”</p><br/><p>The nigh elf paused.</p><br/><p>Xie Xi approached and saw a wound that tore from his shoulder to the back of his waist.</p><br/><p>Blood was already flowing but it wasn’t conspicuous because the clothes were black.</p><br/><p>Xie Xi frowned. “If you are injured then don’t endure so much.”</p><br/><p>The dark elf bowed and the beautiful flower earring hanging from his pointed ear swayed. Xie Xi saw it closely and there was no doubt that it was a black rose.</p><br/><p>It looked pretty good… Xie Xi’s mind floated like this…</p><br/><p>Cough…</p><br/><p>Xie Xi’s senses returned and he drew something in the void. A faint dark mist appeared around his fingertips and he told Pisces, “Don’t move.”</p><br/><p>Aquarius wanted to say something but felt the cool fingertips and was silent.</p><br/><p>The pain from the wound instantly disappeared and he could even feel a slight itching. Whether it was due to Xie Xi’s fingertip or the wound healing was unclear.</p><br/><p>Xie Xi used the customary technique of drawing a medicine with the god’s wisdom and then blocking people’s gaze to make it look like a strange healing technique.</p><br/><p>After his wound was healed, the dark elf gave a handsome bow. “Thank you, my god.”</p><br/><p>Xie Xi was afraid the wound would be torn open again and said sincerely, “Get up, your wounds are still recovering. Go back to your room and rest as soon as possible.”</p><br/><p>Aquarius wasn’t good enough to insist but he stood in place, not wanting to go.</p><br/><p>Xie Xi could only say to him, “I will see you later.”</p><br/><p>These words made the dark elf’s eyes brighten. “You…”</p><br/><p>Xie Xi added, “I hope by then, your wound would be restored.”</p><br/><p>The dark elf immediately replied, “It’s fine, I won’t let you worry!”</p><br/><p>Xie Xi told him, “Go back and lie down. You will recover faster.”</p><br/><p>This could be regarded as Aquarius being coaxed away. Xie Xi didn’t dare look back to see the expression Yan Zhe was making!</p><br/><p>In addition, there were still two more Jiang Xies in place.</p><br/><p>Xie Xi glanced at Pisces. The sea demon had a pair of beautiful eyes that seemed like they could speak.</p><br/><p>He stared straight at Pisces and there were ripples in the deep blue, giving Xie Xi the feeling of being wrapped in sea water.</p><br/><p>Gentle, sturdy but not tight.</p><br/><p>Xie Xi knew this was an illusion and didn’t dare take it lightly. He said, “The intruder is very special and can see through your illusions.”</p><br/><p>Xie Xi used his knowledge of Zong Xia to show off his ‘omniscience.’</p><br/><p>Pisces’ eyes flashed. “I don’t need my illusions to subdue him.”</p><br/><p>“Why did it take so long?”</p><br/><p>Pisces paused.</p><br/><p>Xie Xi ordered, “Don’t endure it. If you are tired then go back and rest.”</p><br/><p>Pisces replied, “I’m not tired.”</p><br/><p>“I can see that you’re tired.”</p><br/><p>Pisces paused.</p><br/><p>Xie Xi told him, “I want to see their specific situation later. Can you use your illusions in this state?”</p><br/><p>Pisces’ reply was immediate. “Yes, no problem.”</p><br/><p>Xie Xi lowered his voice and spoke softly, “…Don’t worry me.’</p><br/><p>In the area channel</p><br/><p>Nan Yi was shocked. “My god, how did he do this?”</p><br/><p>Yan Zhe wondered, “…What did that old animal do to Little Rose?”</p><br/><p>Gong Rui, “Hahahahaha.”</p><br/><p>It was really more fucking wonderful and powerful than he imagined!</p><br/>\n</div>"}