{"title": "Chapter 4 - Im a Hero!? (4)", "id": 4, "volume": 1, "url": "http://boxnovel.org/i-reincarnated-for-nothing-chapter-4-im-a-hero-4", "volume_title": "Volume 1", "body": "<h1>Chapter 4 - Im a Hero!? (4)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 4 - I’m a Hero!? (4)</p><br/><p><span style=\"\">“Stay still, Artpe.”</span></p><br/><p><span style=\"\">“Hey.  Stop right there.  Don’t come over here.  Hey, hey!”</span></p><br/><p><span style=\"\">Artpe was facing the biggest threat of his lifetime.  The identity of this threat was a paste made from a handful of grass.  She held it in her hand.</span></p><br/><p><span style=\"\">“You’ll get better soon if I can put this on you.”</span></p><br/><p><span style=\"\">“Stop lying!  There is no way I’ll get better by applying such a dirty….  Ah.”</span></p><br/><p><span style=\"\">[Maetel]</span></p><br/><p><span style=\"\">[Level - 2]</span></p><br/><p><span style=\"\">[Medicine Lv4]</span></p><br/><p><span style=\"\">[Care Grass]</span></p><br/><p><span style=\"\">[The grass works against all types of wounds, but its effects are weak.  If the grass is made into a paste by combining liquid, its recuperative power is increased slightly.]</span></p><br/><p><span style=\"\">Maybe it could really heal his wound.</span></p><br/><p><span style=\"\">When that thought ran through his mind, Artpe immediately calmed down.  This was his mistake.  Unlike the previous incarnation of herself, the current hero had learned how to attack an opening.  In a flash, she darted in, and she put the grass paste on his knee!</span></p><br/><p><span style=\"\">“Ooh-ahhhhhhhk!”</span></p><br/><p><span style=\"\">“Just be still and get treated by me!”</span></p><br/><p><span style=\"\">“Ooh-ahhhh…  It really is getting better!”</span></p><br/><p><span style=\"\">She hadn’t put much effort into searching through the thicket.  After she pulled out the grass, she spat on it before mushing it.  </span></p><br/><p><span style=\"\">The pain disappeared in a flash after the paste was applied!</span></p><br/><p><span style=\"\">Artpe was taken aback by this unexpected aptitude the hero possessed.  She preened as she stuck out her still flat chest.</span></p><br/><p><span style=\"\">“My dad taught me about the different types of grasses. There are grasses you can eat, and of course, there are the ones that can treat wounds.  There are even a grass that can recover your energy.  He also taught me about which grasses are dangerous to eat.”</span></p><br/><p><span style=\"\">“I ignored you when you said you ate grass before, but now it sounds as if your words were predictive....”</span></p><br/><p><span style=\"\">“Let’s rest for a little bit until the medicine soaks in.  Ah.  Before we do that....”</span></p><br/><p><span style=\"\">Maetel found a patch of grass nearby, and she pulled out the wide leaved grasses.  She wiped it off on her sleeve.  Then she wrapped the wide leaves around the wound administered with the paste.  She tied it loosely.</span></p><br/><p><span style=\"\">She had looked fiendish when fighting the goblins, but in this light, she showed her feminine side.  If he was a normal boy, he would have fallen for her at this point in time.  Of course, Artpe was able to sidestep this issue.  The number one cause of death for the Four Heavenly Kings had been honey traps.  He was well-informed regarding this issue, so his heart didn't beat faster at all.</span></p><br/><p><span style=\"\">“Oopsy daisy.  It’s all done.”</span></p><br/><p><span style=\"\">“......thank you.”</span></p><br/><p><span style=\"\">“This is nothing compared to what Artpe has done for me!”</span></p><br/><p><span style=\"\">Maetel had a big smile on her face as she sat next to Artpe.  After the battle with the goblins had ended, they had decided to recover from the fatigue caused by their first battle.  They rested on top of a big boulder that was nearby.</span></p><br/><p><span style=\"\">“What I did for you…..”</span></p><br/><p><span style=\"\">Artpe felt guilty at Maetel’s words, so he let out a bitter laugh.</span></p><br/><p><span style=\"\">Truthfully, he had mixed feelings about all of this.  Was he really the same person as the version of himself, who had grown up with Maetel?  Why did Artpe have no memory of the time before he regained his memories?</span></p><br/><p><span style=\"\">“Are you tired, Artpe?  I’ll let you use my lap as a pillow.  Why don’t you sleep even if it is for a brief time?”</span></p><br/><p><span style=\"\">“...no.”</span></p><br/><p><span style=\"\">Artpe faced the angelic and kind face of Maetel.   He felt awkward facing her, so he surreptitiously turned his gaze towards the sky.  The glow of the setting sun was slowly spreading across the sky.</span></p><br/><p><span style=\"\">They didn’t have any time to waste.</span></p><br/><p><span style=\"\">“My wound is fine.  Let’s get up now.  It’ll be extremely cold and dark once the night comes.”</span></p><br/><p><span style=\"\">“What should we do?”</span></p><br/><p><span style=\"\">The two heroes were still too young and weak.  It was risky for them to spend the whole night within the forest.   Be that as it may, they couldn’t just blindly go back to the town.</span></p><br/><p><span style=\"\">What would be their best option right now?</span></p><br/><p><span style=\"\">Artpe let out a gentle laugh as he revealed the answer.</span></p><br/><p><span style=\"\">“We can go into a Dungeon.”</span></p><br/><p><span style=\"\">“...what?”</span></p><br/><p><span style=\"\">Maetel answered back with a question.</span></p><br/><p><span style=\"\">For the first time, since he was reincarnated, Artpe spoke words worthy of a hero.</span></p><br/><p><span style=\"\">“I’m saying we should go clear a Dungeon!”</span></p><br/><p><span style=\"\">Dungeons were a scary place where it was teeming with monsters and traps.  However, at the end of the Dungeons, there was always the prospect of acquiring sweet rewards.  This was why adventurers were lured into the Dungeons.  Some called the Dungeons as being a gift from the gods.  Others called it the temptation from the devil.   There were even some, who called it was a prank pulled off by the Demon King.</span></p><br/><p><span style=\"\">“I like to refer to Dungeons as being rich mines.”</span></p><br/><p><span style=\"\">“Artpe is amazing!”</span></p><br/><p><span style=\"\">It was unbelievably hard to find rewards within the Dungeons.</span></p><br/><p><span style=\"\">There were cases where one was able to avoid all the traps, but when one reached the last room, it was revealed that the treasure was hidden in one of the traps one had already passed. There were times when the last boss was killed, but it was revealed that the last boss was the treasure.  Then there were cases where the last boss didn’t turn out to be the actual boss.  The adventurer was awakened, in the course of fight monster, to become the last boss by being inflicted by poisons and curses.  The world was overflowing with such stories!</span></p><br/><p><span style=\"\">At this point, it was clear that a god’s nature could be as twisted as the Demon King.</span></p><br/><p><span style=\"\">Or were they the two sides of the same coin?</span></p><br/><p><span style=\"\">On the other hand, Artpe possessed the Read All Creation ability.  He could pierce through all lies to see the truths.  Nothing could deceive Artpe’s eyes.  Artpe’s possessed an ability that would allow him to find all the hidden Dungeons, and it wouldn’t be difficult for him to acquire the hidden treasures within the Dungeons! </span></p><br/><p><span style=\"\">‘Of course, in my previous life, I used this amazing ability for the benefit of the Demon King….’</span></p><br/><p><span style=\"\">Just the thought of that point made Artpe grind his teeth. If he had been able to take just a 20 percent cut of what he earned from those countless Dungeons, he would have been able to take care of 30 generations of his descendants!</span></p><br/><p><span style=\"\">“It’ll be different this time around.   All right.  I’m going to work a little bit harder, so I can enjoy a peaceful life as a dairy farmer.”</span></p><br/><p><span style=\"\">“I’m not sure what you are talking about, but let’s both work harder!”</span></p><br/><p><span style=\"\">Artpe knew about a Dungeon near the village where the hero was born.  To be precise, there was exactly one Dungeon inside the forest near the country village.  It was fitting, since that village had nothing.</span></p><br/><p><span style=\"\">From the start, he had thought about visiting this Dungeon, while they were running away.  This was why they had been heading in this direction from the moment they came out of the village.  It was going as planned.  The Dungeon appeared not much later.</span></p><br/><p><span style=\"\">“...is it here?”</span></p><br/><p><span style=\"\">“Yes.”</span></p><br/><p><span style=\"\">When Maetel saw the entrance to the Dungeon, she had an odd expression on her face.</span></p><br/><p><span style=\"\">“Do we have to go into such a strange place?  Isn’t this a burial ground?”</span></p><br/><p><span style=\"\">“All Dungeon entrances are like this.  It was as if all the makers of Dungeons made a friendly agreement by losing their collective minds.”</span></p><br/><p><span style=\"\">Aside from burial grounds, there were several thousand year old trees, natural lakes formed within a cave and a ruined house inside a town.  These were the popular spots for Dungeons.</span></p><br/><p><span style=\"\">These were very obvious and suspicious locations.  However, these spots weren’t investigated unless the hero or Artpe discovered it.  He had always wondered why it was like that.  However, that issue didn’t matter now.</span></p><br/><p><span style=\"\">“I don’t want to go in there....  My dad said we shouldn’t disturb the rest of the dead.”</span></p><br/><p><span style=\"\">“Your father did a very good job in educating you.”</span></p><br/><p><span style=\"\">Up until now, Maetel had meekly followed Artpe’s words.  This was the first time she had pushed back.  Well, it was true that the hero from his past life never visited this Dungeon either.</span></p><br/><p><span style=\"\">After being chosen as a hero, she had been dragged immediately into the palace.  She might have always had an aversion to burial grounds, but that didn’t matter any more.  There was only one important fact right now.  She ‘must’ go into this Dungeon.</span></p><br/><p><span style=\"\">This was why Artpe spoke with a stern voice.</span></p><br/><p><span style=\"\">“If we don’t go in here, we’ll be dragged back into the palace.”</span></p><br/><p><span style=\"\">“I like tasteless food even less!  I also don’t like the cold.  Woo, woo….”</span></p><br/><p><span style=\"\">“Well, are you going to go in?”</span></p><br/><p><span style=\"\">“·...yes.”</span></p><br/><p><span style=\"\">The sun had set all the way, and their surrounding was getting colder.  They didn’t have the time to dawdle.  Maetel looked as if she was about to cry, but she followed Arpte.  She had no choice, but to enter the Dungeon.</span></p><br/><p><span style=\"\">“Huh?”</span></p><br/><p><span style=\"\">However, when he actually entered the Dungeon, Maetel tilted her head in confusion.</span></p><br/><p><span style=\"\">“This isn’t a grave?”</span></p><br/><p><span style=\"\">Maetel had expected to see a coffin with a dead body within.  She had expected cold brick walls with hidden bats and long spiderwebs.  The sight that greeted them was a square room, and the floor was covered with brown soil.</span></p><br/><p><span style=\"\">When she turned around, she saw the stairway heading outside.  Maetel was sure she had descended stone steps, yet unbeknownst to her, it had changed into stairs made out of dirt!</span></p><br/><p><span style=\"\">“Artpe, Artpe!”</span></p><br/><p><span style=\"\">Maetel’s eyes turned round, and she grabbed Artpe’s dirty sleeve.   He had somewhat expected such a reaction from Maetel.  Artpe smirked.</span></p><br/><p><span style=\"\">“Dungeons are all like this.  So what do you think?  Are you still cold?”</span></p><br/><p><span style=\"\">“No, I’m not cold at all….  Huh?  Why is that?”</span></p><br/><p><span style=\"\">When the hero realized the abnormal condition around her, she became slightly confused! </span></p><br/><p><span style=\"\">Artpe gave a short explanation to her.</span></p><br/><p><span style=\"\">“Dungeons are a form of pocket dimensions.  You should think of it as a space disengaged from the outside world.”</span></p><br/><p><span style=\"\">“What is a pocket dimension?”</span></p><br/><p><span style=\"\">“The concept of a pocket dimension was first introduced in the year 728 according to the Continent Calendar.  A demon named ‘Nanarai Bodra’ set up an experiment where the density of Mana within a limited space was pushed past the maximum permissible amount….”</span></p><br/><p><span style=\"\">“It’s over my head!”</span></p><br/><p><span style=\"\">Maetel raised one hand, and she yelled out in a spirited manner.  Artpe had already expected such a reaction from her.  He let out a benevolent smile as he asked her a question.</span></p><br/><p><span style=\"\">“Which part don’t you understand?”</span></p><br/><p><span style=\"\">“There’s too much… You should explain what the Continent Calendar is first.”</span></p><br/><p><span style=\"\">“All right.  Let’s lay that aside for now.”</span></p><br/><p><span style=\"\">Artpe gave up on giving her an explanation.  He was the one at fault for trying to explain a concept of magic to an idiot.</span></p><br/><p><span style=\"\">“Just accept that such places exists, and the Dungeons occupies that space.”</span></p><br/><p><span style=\"\">“Yes.  All right!”</span></p><br/><p><span style=\"\">If she was going to gloss over everything, she shouldn’t have asked for an explanation!</span></p><br/><p><span style=\"\">“We’ll sleep here today.  Since we are at the Dungeon entrance, the monsters won’t come near here.  Moreover, no one will able to find and enter this Dungeon.  We can relax and sleep.”</span></p><br/><p><span style=\"\">“Yes.  All right.”</span></p><br/><p><span style=\"\">He had said those words, but he prepared for the unexpected.  He used his fingers to spread several threads of Mana over the Dungeon’s entrance, stairway and the doorway located on the other side of the room.  It would allow him to be aware of external threats beforehand, and it would give him some time to prepare for it.  This was supposed to be an impossible task for a normal level 2 hero, but Artpe was able to pull it off.</span></p><br/><p><span style=\"\">Maetel watched Artpe work.  Her eyes were shining relentlessly.</span></p><br/><p><span style=\"\">“Artpe is really incredible.  There isn’t a thing you don’t know.  You are great at everything except exercise.  You are kind….  Moreover, you are a  hero!”</span></p><br/><p><span style=\"\">“You are a hero too.”</span></p><br/><p><span style=\"\">“I...  I like being a hero, but in truth, I wouldn’t have minded if I hadn’t become a hero.”</span></p><br/><p><span style=\"\">Artpe finally remembered the words spoken by Maetel in the morning.  She most definitely said there was something she wanted to be more than being a hero.</span></p><br/><p><span style=\"\">She had role played at being a hero everyday.  He knew she loved being a hero.   So what was she referring to when she said there was something she wanted more than being a hero?</span></p><br/><p><span style=\"\">Artpe mused over it when he turned to look at Maetel in alarm.</span></p><br/><p><span style=\"\">“Did you perhaps want to become the Demon King instead of a hero!?”</span></p><br/><p><span style=\"\">“No way!”</span></p><br/><p><span style=\"\">“You should most definitely not become one of the </span><span style=\"\">Four Heavenly Kings.  It isn’t worth it.</span><span style=\"\">”</span></p><br/><p><span style=\"\">“I’m not talking about that!”</span></p><br/><p><span style=\"\">Maetel’s face had turned red as she fumed.  Her anger pretty much wiped away the fear she felt for the Dungeon and the future.  Artpe smiled for the first time, and he gently patted her head.</span></p><br/><p><span style=\"\">“I already know, you dummy.  Whatever you want to be, you should keep it safe within your heart.  When the Demon King is dead, you’ll be free.”</span></p><br/><p><span style=\"\">“Free….?”</span></p><br/><p><span style=\"\">A hero only existed, because there was a Demon King in existence.  When the Demon King disappears, the Hero Class would vanish too. </span></p><br/><p><span style=\"\">Then the hero would be able to acquire a new Class.</span></p><br/><p><span style=\"\">“That day will come, so you should safeguard your dream.  You shouldn’t forget about it.  I will help you achieve it.”</span></p><br/><p><span style=\"\">“Dream... Do you really think I’ll be able to fulfil my dream?”</span></p><br/><p><span style=\"\">“Of course.”</span></p><br/><p><span style=\"\">He didn’t know what her dreams was.  However, the dream was probably something she can realize after the death of the Demon King.  Artpe nodded his head vigorously, and Maetel’s face visibly brightened.</span></p><br/><p><span style=\"\">“All right. I’ll try harder from now on!  I’ll do whatever it takes!”</span></p><br/><p><span style=\"\">“Yes.  Anyways, it is time for us to sleep.”</span></p><br/><p><span style=\"\">“Yes! Sleep well, Artpe!”</span></p><br/><p><span style=\"\">“You sleep well too.”</span></p><br/><p><span style=\"\">He had succeeded in motivating the hero.  </span></p><br/><p><span style=\"\">Now she would be an active participant in moving forward!</span></p><br/><p><span style=\"\">Artpe let out a pleased smile.  He was able to turn the tide of Maetel reluctance, and his plan was on track now.</span></p><br/><p><span style=\"\">His expression was akin to a farmer waiting for his harvest.</span></p><br/><p><span style=\"\">If he knew what Maetel was dreaming about, Artpe wouldn’t have been able to make such a contented expression.   He had always been the lowest ranked of the Four Heavenly Kings, because he had a habit of not catching the important developments.</span></p><br/><p><span style=\"\">This was how the two heroes slept safely within the Dungeon on their first night out.</span></p><br/>\n</div>"}