{"title": "Chapter 0 Prologue", "id": 0, "volume": 0, "url": "http://boxnovel.org/i-reincarnated-for-nothing-chapter-0-prologue", "volume_title": "Volume 0", "body": "<h1>Chapter 0 Prologue</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><span style=\"\">Chapter 0 - Prologue. </span></p><br/><p><span style=\"\">He was the weakest of the Four Heavenly Kings, and he was the leader of the Rebirth Demon King's Enforcement army.  His name was Artpe Hirtana Kelduke. </span></p><br/><p><span style=\"\">His name was spread across the human world as being one of the Four Heavenly Kings.</span></p><br/><p><span style=\"\">If one mentioned the Four Heavenly Kings of the Demon King's army, the humans would think about the monsters that could cause the mountains to fall.  They were seen as beings that could cause earthquakes and the seas to dry.  However, Artpe was different.</span></p><br/><p><span style=\"\">He was someone, who had been recognized by the Demon King, through polishing his strange ability.  He was named to the prestigious title of being one of the Four Heavenly Kings thanks to his strange ability</span></p><br/><p><span style=\"\">However, he was weak.</span></p><br/><p><span style=\"\">He would make an entrance with an awesome aura wrapped around him, but in the end, he would die by the hands of the hero's party.  Then a being with a more awesome aura would show up and say, 'Hoo hoo hoo.  In truth, he was the weakest of the Four Heavenly Kings!'  In this story, he was casted as being the weakest of the Four Heavenly Kings.</span></p><br/><p><span style=\"\">“The hero is really coming, commander.  Don't we have to run away before that happens?”</span></p><br/><p><span style=\"\">As expected of the subordinates under the weakest of the Four Heavenly Kings, all the demons under his direct command were lacking in firepower.  On top of it all, their temperament was lacking too.</span></p><br/><p><span style=\"\">“If you want to run away, you should try running away.”</span></p><br/><p><span style=\"\">“I'm sorry!”</span></p><br/><p><span style=\"\">His subordinate was thinking about running away even before the fight.  He hit his subordinate in the back of the head, and he climbed to the top of the Demon King's castle.  When he did, he could clearly see the hero's party coming through a doghole created to bypass the castle wall.  It seemed this was their attempt at secretly infiltrating the castle.</span></p><br/><p><span style=\"\">Whenever a Demon King was born to conquer the world, a hero always appeared to put a spoke in the wheel. The hero was the Demon King army's ultimate enemy.</span></p><br/><p><span style=\"\">“She really is here.  The Demon King on borrowed time now.”</span></p><br/><p><span style=\"\">The hero had appeared around three years ago, yet she was already here.  Who would have expected that?</span></p><br/><p><span style=\"\">Artpe couldn't smack himself in the back of the head for having such a thought.</span></p><br/><p><span style=\"\">Still, he was a bit relieved.  She was here much earlier than expected.  There was no way the hero would be able to win against the Demon king.</span></p><br/><p><span style=\"\">“The problem is my troops will be the first to face them.”</span></p><br/><p><span style=\"\">Maybe a Demon King's mind was reshaped when the successor puts on the crown.  The crazy Demon King had a terrible personality, and he always sent the weakest amongst the Demon race to fight the hero first.</span></p><br/><p><span style=\"\">This strong-willed hero was able to rapidly grow for the past 3 years, because the weakest demons were sent first.  Then the degree of difficulty was slowly increased as the troops failed.  If the Demon King wasn't a lord, Artpe would have smacked him in the back of the head.</span></p><br/><p><span style=\"\">Currently, Artpe was moving, and the reason behind his action was obvious.  The weakest force in the Demon King's castle was his force, and he was their commander. No one from the Demon King's castle would lift a finger until every single one of them were killed.</span></p><br/><p><span style=\"\">Artpe decided to look on the bright side.  He was one of the Four Heavenly Kings.  Would he really be killed by a new hero?  The last time he checked on her level was about an year ago, and the hero had been level 200.  She might have grown a little bit, but she wouldn't even be able to scratch the Demon King's castle.</span></p><br/><p><span style=\"\">“Let's check her out first.”</span></p><br/><p><span style=\"\">This was the ability that allowed Artpe to reach his command post.  He activated the Read All Creation'.  It was as the words implied.  It was an ability that allowed him to find out information about anything that exists in this world.  His innate ability was one of the reason why the Demon King kept Artpe by his side.</span></p><br/><p><span style=\"\">He had trained his ability through the years, so he was able to successfully activate his ability from a long distance.</span></p><br/><p><span style=\"\">Several lines appeared in front of his eyes.  It was written in the language of the Demon Clan.</span></p><br/><p><span style=\"\">[Name - Maetel]</span></p><br/><p><span style=\"\">[Race : Human Female]</span></p><br/><p><span style=\"\">[Title : Hero]</span></p><br/><p><span style=\"\">Artpe was at a loss for words.  He had known the female hero was a commoner, and her name was Maetel.  However, he lost the ability to speak when he read the last line.</span></p><br/><p><span style=\"\">[Level : 374]</span></p><br/><p><span style=\"\">“······.”</span></p><br/><p><span style=\"\">“What should we do, commander?”</span></p><br/><p><span style=\"\">He couldn't even hear the question asked by his subordinate, who stood by his side.  Artpe's mind was in a confused state.</span></p><br/><p><span style=\"\">What?  374? </span></p><br/><p><span style=\"\">When he checked up on her only a year ago, he was sure she was only level 200!  The Demon King had just reached level 400!</span></p><br/><p><span style=\"\">“Hey.  Did we do something to the humans recently?”</span></p><br/><p><span style=\"\">What caused the worm to become a dragon?</span></p><br/><p><span style=\"\">“The Demon King wanted spice things up a little bit, so he personally dispatched several armies to where the hero lived.  Now that I think about it, I heard no news of their return.”</span></p><br/><p><span style=\"\">“Ah-ha.  He wanted to spice things up a little bit?  Kyah.  I didn't know about that!”</span></p><br/><p><span style=\"\">He marinated her so perfectly that a hero appeared as a full course meal!  That son of a bitch!  I should just call him a chef instead of a Demon King!</span></p><br/><p><span style=\"\">Artpe's subordinate looked at Artpe's stormy expression, and he immediately grasped the situation. His subordinate made a sour face as he asked Artpe a question.</span></p><br/><p><span style=\"\">“Should we run away, commander?”</span></p><br/><p><span style=\"\">“Yeah. Now I want to run away too.”</span></p><br/><p><span style=\"\">This was beating a dead horse, but Artpe was the weak.   However, in the end, he was still one of the Four Heavenly Kings.  He was level 350, and he had considerable amount of skills.  However, this was also why he knew what the disparity between him and the hero meant.</span></p><br/><p><span style=\"\">Even a single level difference meant one's soul was outclassed.  It was impossible to beat the other unless one had a really good Skill.</span></p><br/><p><span style=\"\">What would happen if there was a difference of 24 levels?  Even if he gathered all his soul to oppose the hero, he would be destroyed by a single move.</span></p><br/><p><span style=\"\">Artpe really wanted to run away.  He wanted to crawl through the doghole made by the hero.  How great would it be if he could run away to a place where a being from the Demon race wouldn't be recognized?  He wanted to go to a peaceful place where fighting and war didn't exist.  How great would it be if he could just live as he raised some cows!</span></p><br/><p><span style=\"\">“Koo-ooh-ooh.”</span></p><br/><p><span style=\"\">When he had that thought, a red choker appeared on his smooth neck, and it ruthlessly tightened around his neck.  It put pressure on his body and mind.  He was owned by another.  The Demon King's Innate Ability called Absolute Control was activated.</span></p><br/><p><span style=\"\">When one was defeated by the Demon King, the Demon King’s Innate Ability activated to control his opponent.  Once his innate ability took hold, it was impossible to escape from it.  One had to follow all his orders, and if one held thoughts that ran contrary to his orders, one’s neck would be choked.</span></p><br/><p><span style=\"\">When that happens, death was the final outcome.  One had to turn back into a docile sheep to follow his order, or one could just choose to die.  Artpe had to select one of the two choices right now.</span></p><br/><p><span style=\"\">Artpe wanted to live a little bit more, so he chose the former option.  The choking sensation around his neck quickly disappeared.</span></p><br/><p><span style=\"\">“Commander.....”</span></p><br/><p><span style=\"\">“It's all right.  Don't say anything.”</span></p><br/><p><span style=\"\">There were several times in the past when he felt the sensation of being choked to death.  It was akin to what happened a moment ago.  On such occasions, Artpe struggled to live by not resisting against the orders of the Demon King.  This was why he was able to stay alive until now.</span></p><br/><p><span style=\"\">He had experienced scenes of violence until he was fed of with it.  He wouldn't be broken by a mere hero.</span></p><br/><p><span style=\"\">However, it was also clear that he would lose for sure if events continued along down this path.  Artpe thought hard on how he'll be able to survive this.  In the end, he chose the last resort.  He hadn't wanted to choose this option.</span></p><br/><p><span style=\"\">“······please go contact Etna-nim.”</span></p><br/><p><span style=\"\">She was the only woman amongst the Four Heavenly Kings.  She was the leader of the Army of Thieves.  Her name was Etna Carlyfate Mirecard.  She was ranked second in Four Heavenly King’s ranking.  However, the most important part was that she was in love with Artpe.</span></p><br/><p><span style=\"\">“Tell her I'll agree to the Soul Pact if she helps me.  She'll come here after she gets permission from the Demon King.”</span></p><br/><p><span style=\"\">The Soul Pact was the absolute contract of amity that could be made amongst two Demons.  Basically, it signified marriage.</span></p><br/><p><span style=\"\">“....do you really want to marry her?  You still won't be able to die a natural death.”</span></p><br/><p><span style=\"\">“Can't you see I'm about to die right now?  You really want to argue about this right now?  Are you trying to pick a fight with me?  Do you want to die before me?”</span></p><br/><p><span style=\"\">When Artpe browbeat him, his underling quickly ran into the castle.  He let out a sigh at this sight.</span></p><br/><p><span style=\"\">Etna was a beautiful and powerful woman. Even amongst the Demon race, who was famous for being ill tempered, she clearly possessed a pure nature.  This was why she was popular amongst her subordinates.  A woman of such caliber liked him.  This was a big blessing for him even if she wasn't his type.</span></p><br/><p><span style=\"\">So why did Artpe turn down her proposal until now?  The man, who was ranked 1st amongst the Four Heavenly Kings, was in love with Etna.  Artpe didn't want to make enemy of this man, so he had turned down her offer.</span></p><br/><p><span style=\"\">However, he couldn't worry about making a future enemy right now.  The hero’s party was coming towards him, and they were too scary for him to worry about the implications of his action.</span></p><br/><p><span style=\"\">Ah, they were already running amuck.</span></p><br/><p><span style=\"\">His two eyes clearly saw the sight of his Enforcement army being crushed in a distressing manner.  It was true.  He was really afraid.</span></p><br/><p><span style=\"\">Please come before it is too late! </span></p><br/><p><span style=\"\">Please allow Etna to participate in the battle, Demon King!  If you leave them be like this, you will also be in danger!  Please allow her to participate in this, Sheff!</span></p><br/><p><span style=\"\">“Please don't cause any trouble, and surrender to us, Four Heavenly King Artpe Hirtana Kelduke.  There is no need for us to fight each other any longer.”</span></p><br/><p><span style=\"\">It was all too late. </span></p><br/><p><span style=\"\">Fuck this demonic life of his...</span></p><br/><p><span style=\"\">Artpe looked at the innocent looking girl, who was the hero.  She had her sword pointed towards his neck, and she had a slightly sorrowful expression on her face.  He let out a hollow laugh.</span></p><br/><p><span style=\"\">“You make it sound as the Demon King's army isn’t on a campaign to bring about world peace.”</span></p><br/><p><span style=\"\">She probably didn't know about the existence of the shackles that bound all demons under the Demon King's service.  Even if he didn't want to fight, he had to force himself to fight.  He didn't like killing humans, yet he had to force himself to kill them.  She probably didn't even know such a demon existed within the Demon race.</span></p><br/><p><span style=\"\">If she found out about the truth, this kind girl would probably be unable to swing her sword against them.  However, Artpe decided not to tell her anything.  Since things had progressed this far, he thought it might be better if she was able to kill the Demon King once and for all.</span></p><br/><p><span style=\"\">“Still, the others around you seems better equipped for this.”</span></p><br/><p><span style=\"\">There was a magician, a warrior equipped with a shield and a sharp-eyed thief with a dagger.  If Artpe said or did anything funny, they would kill him without giving him any quarter.</span></p><br/><p><span style=\"\">They knew the truth behind the Demon race, yet they still decided to walk the road of carnage.  They were true heroes, and Artpe admired them.  They were qualified to be by the side of this heroine.</span></p><br/><p><span style=\"\">“Hero. I'm pretty sure a very good looking noonim will be coming here soon, and she'll be very angry when she sees my corpse.  I want you to give her this message.”</span></p><br/><p><span style=\"\">Artpe's weird and offbeat words were taken as being a start of some kind of ploy by the thief.  The thief moved immediately. He was incredibly fast.  He might be faster than the hero.</span></p><br/><p><span style=\"\">It was understandable.  There was no burning animosity shown towards the hero by Artpe, and it seemed she would need a good amount of time before she could bring herself to apply the final blow to him.  Her impatient comrade had stepped forward to try to kill him in her stead.  Artpe had expected such a move.</span></p><br/><p><span style=\"\">“In truth, I....  Kuh-huhk!”</span></p><br/><p><span style=\"\">The thief's dagger pierced through Artpe's heart. The blade was sharper and deadlier than the ugly past of his childhood. It had shredded his heart, but Artpe didn't die immediately.</span></p><br/><p><span style=\"\">“In truth, I'm not too fond of older women...  Kahk.  Please tell her...!”</span></p><br/><p><span style=\"\">“W...what the hell are you talking about?  Why are you saying such strange words!  This makes you...  It makes you seem like a normal person....!”</span></p><br/><p><span style=\"\">The hero had a sad expression on her face.  It was as if she was about to cry.  When Artpe faced her pure sadness, he felt better.  He grinned. </span></p><br/><p><span style=\"\">In the end, he would die, but his tedious life would come to an end.</span></p><br/><p><span style=\"\">If he was born again, he wanted to be born in a place where he was free of that damn Demon King.</span></p><br/><p><span style=\"\">Artpe gave a heartfelt prayer as he closed his eyes.</span></p><br/><p><span style=\"\">Before he died, he heard the angry shout of a woman, but he didn't care.  He was about to die, so it was none of his business.</span></p><br/><p><span style=\"\">This was how Artpe Hirtana Kelduke died. </span></p><br/><p><span style=\"\">He was one of the Four Heavenly Kings in the Demon King army, but his death was miserable.  It held no weight.  </span></p><br/><p><span style=\"\">In his last moments, he could see two lines of words etched into his retina.  However, his consciousness was already fading into death.</span></p><br/><p><span style=\"\">[Innate Ability Read All Creation has evolved.]</span></p><br/><p><span style=\"\">[Secret Option Rewrite is Activated.]</span></p><br/><p><span style=\"\">When he opened his eyes again, he was in the form of a small male child.</span></p><br/><p><span style=\"\">“Huh?”</span></p><br/><p><span style=\"\">Didn't a thief ruthlessly stab a dagger into his heart a moment ago?  Artpe was having a hard time getting used to his rapidly changed situation.  He looked around his surrounding.</span></p><br/><p><span style=\"\">It was a very small and worn down hut.  The window up top was letting in sunlight, and the light illuminated a cloud of dust. This looked like a place where humans would live.  Now that he thought about it, it seemed he had taken the form of a male human child!</span></p><br/><p><span style=\"\">‘Is this Illusion Magic?’</span></p><br/><p><span style=\"\">However, this thought lasted only for a brief moment.  His soul held his Innate Ability called Read All Creation.  It allowed him to pierce through all lies.  It showed him only the truth.  This was why he was sure he wasn’t under any Illusion magic.</span></p><br/><p><span style=\"\">‘Mirror.  I have to find a mirror.  I have to assess what kind of situation I am in.’</span></p><br/><p><span style=\"\">His ability, Read All Creation, was an incredible power.  However, if he wanted to Read himself, he needed a reflective surface to see himself.  It didn’t matter if the reflection came in form of a puddle, mirror or even a person’s eyes.</span></p><br/><p><span style=\"\">He searched the small and dirty hut, but he couldn't find a mirror.  In the end, he was successfully in finding a bowl on top of the kitchen table.  </span></p><br/><p><span style=\"\">He poured enough water into the bowl, and he could see a  blurred image of himself.</span></p><br/><p><span style=\"\">“······it is me.”</span></p><br/><p><span style=\"\">He had black hair and purple colored eyes.  He had white enough skin to be called pale.  It had been a long time ago, but his face was identical to the face he had when he was a very young Demon.  It was indisputable.  Artpe was himself, but at the same time, it was indisputable that he was a human.</span></p><br/><p><span style=\"\">Artpe was still in the midst of despairing when his Innate Ability Read All Creation delivered the final blow.</span></p><br/><p><span style=\"\">[Name - Artpe]</span></p><br/><p><span style=\"\">[Race : Human Male]</span></p><br/><p><span style=\"\">[Level : 1]</span></p><br/><p><span style=\"\">[Strength : 3, Agility : 2, Stamina : 2, Magic Energy : 19]</span></p><br/><p><span style=\"\">[Innate Ability : Read All Creation(Step 2)]</span></p><br/><p><span style=\"\">His name, race and level were all too shocking!  If there was a god, he wanted to kill the bastard!  He’ll kill the god alongside the Demon King!</span></p><br/><p><span style=\"\">“······huh?”</span></p><br/><p><span style=\"\">Soon, Artpe realized the most shocking part was still left for him to be discovered.</span></p><br/><p><span style=\"\">[Innate Ability : Read All Creation(Step 2)]</span></p><br/><p><span style=\"\">His Read All Creation was now on Step 2?</span></p><br/><p><span style=\"\">‘When did the Innate Ability develop stages?</span></p><br/><p><span style=\"\">It happened when Artpe was thinking over this question.</span></p><br/><p><span style=\"\">The door to the hut opened, and a human ran in from outside.</span></p><br/><p><span style=\"\">“Let's play, Artpe!”</span></p><br/><p><span style=\"\">The one, who spoke, was a beautiful human girl.</span></p><br/><p><span style=\"\">She had such beautiful golden hair that it was almost unbelievable that a commoner had such hair.</span></p><br/><p><span style=\"\">Her emerald colored eyes were bright and passionate.  </span></p><br/><p><span style=\"\">Instead of the rag she was wearing, a silk dress would have gone better with her white skin and well-formed feature.</span></p><br/><p><span style=\"\">“Hero?”</span></p><br/><p><span style=\"\">Artpe was so taken aback that he mumbled to himself.</span></p><br/><p><span style=\"\">Somehow, the hero heard his words.   Maetel let out a bright laugh as she replied.</span></p><br/><p><span style=\"\">“Yes.  Let's go play being heroes!”</span></p><br/><p><span style=\"\">This was the day when Artpe died as a demon.</span></p><br/><p><span style=\"\">He was reborn as a 12 year old male human, who was the childhood friend of the hero.</span></p><br/>\n</div>"}