{"title": "Chapter 10 - Growth of the Heroes (2)", "id": 10, "volume": 1, "url": "http://boxnovel.org/i-reincarnated-for-nothing-chapter-10-growth-of-the-heroes-2", "volume_title": "Volume 1", "body": "<h1>Chapter 10 - Growth of the Heroes (2)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 10 - Growth of the Heroes (2)</p><br/><p><span style=\"\">Maetel had been the one to finish off the Skeleton Warrior, but in reality, Artpe had basically killed it on his own.  Of course, the act of running from the 6th floor to the 1st floor counted towards the Battle Contribution, but there was no doubt that Artpe would be getting the higher portion of the EXP.</span></p><br/><p><span style=\"\">Artpe’s level went up by 6 thanks to the EXP.  He climbed to level 30.  Maetel’s level rose by 3, so she was now level 32.  The large level gap between them had closed somewhat</span></p><br/><p><span style=\"\">“How’s your wound, Maetel?”</span></p><br/><p><span style=\"\">“My wound has gotten better after I leveled up.  If we don’t get into a fierce battle, I’m confident it won’t overtax me.”</span></p><br/><p><span style=\"\">“What about the grass you used before?”</span></p><br/><p><span style=\"\">“I still have some.”</span></p><br/><p><span style=\"\">Artpe created an emergency medicine with the help of Maetel.  After taking off her armor, he treated her remaining wounds.  When Maetel exposed her bare skin, her cheeks had turned red.  However, Artpe didn’t say anything as he had a serious light in his eyes.</span></p><br/><p><span style=\"\">“All right.  Let’s put on some bandages then you can put your clothes back on.”</span></p><br/><p><span style=\"\">“Those bandages been left inside the wooden chest for a very long time, so why is it new?”</span></p><br/><p><span style=\"\">“This is just the way of the universe.  Just accept it.”</span></p><br/><p><span style=\"\">“Yes!”</span></p><br/><p><span style=\"\">The first aid was done, and the only thing left was the most enjoyable part of a battle.  It was time for him to check the loot.  Artpe cautiously reached out towards the red bone gauntlet.  He read it with his Read All Creation ability, and words started to take shape.</span></p><br/><p><span style=\"\">[Crimson Rage Bone Gauntlet]</span></p><br/><p><span style=\"\">[The Undead had been in existence for numerous years, and a good amount of magical energy had been distilled into the bones of the Undead.  A powerful rage felt right before its death formed differentiated an artifact.  The item is very hard, and when the wearer is able to control one’s emotions, one’s power will be boosted by 20%.  As a price, a fixed portion of one’s magical energy will be consumed.]</span></p><br/><p><span style=\"\">“Mmmmm.”</span></p><br/><p><span style=\"\">“What’s wrong, Artpe?”</span></p><br/><p><span style=\"\">This drop item pretty much held the essence of the Skeleton Warrior.  Artpe let out a sigh of regret as he looked at it.  It had the basic requirements of a defensive gear.  It had sheer solidity, and while it did consume magical energy, it could increase one’s strength by 20%.  It was a hard to acquire artifact of this quality when one considered their level.</span></p><br/><p><span style=\"\">However….</span></p><br/><p><span style=\"\">‘I hoped an artifact that would be of help to me would show up.  However, this was a warrior type Elite, so it can’t be helped.’</span></p><br/><p><span style=\"\">Maetel had already acquired the bastard sword used by the Skeleton Warrior.  He checked it with his Read All ability, but the bastard sword didn't have a special option.  Still, it was able to absorb magical energy pretty well.  It’s strength, durability and energy was that of a unique artifact.  At the very least, one wouldn’t need to change this equipment until level 100.</span></p><br/><p><span style=\"\">In this context, the gauntlet would now be in the possession of Maetel.  It was hard to do such simplistic comparisons, but it wouldn’t be an exaggeration to say that she would become twice as strong with this item equipped.</span></p><br/><p><span style=\"\">It was good news for him that she would become more powerful.  On the other hand, he couldn’t help, but feel like crap.  The curse he had possessed in his previous profession as one of the Four Heavenly King had followed him here!  It stubbornly stuck to him!</span></p><br/><p><span style=\"\">“Tsk.  It can't be helped.  You should wear this, Maetel.”</span></p><br/><p><span style=\"\">“What about Artpe….?”</span></p><br/><p><span style=\"\">“If something I need appears, it won’t matter if you beg or cry.  I’ll ruthlessly push you away to keep that item.  So don’t worry about taking this item.”</span></p><br/><p><span style=\"\">“Yes!”</span></p><br/><p><span style=\"\">Maetel equipped the bone gauntlet. It was made out of bones, but it was an artifact infused with power magical energy.  It reduced in size to fit her limbs.  It wrapped tightly around her wrists and fingers.</span></p><br/><p><span style=\"\">Of course, if Maetel was unable to handle Mana, she wouldn’t have been able to equip this artifact. However, she was a character, who had been able to bring out fire from the wooden branch at level 1.  The worries about such a requirement could be omitted.</span></p><br/><p><span style=\"\">“Wow.  This feels incredibly sturdy!  I can feel it protecting me!”</span></p><br/><p><span style=\"\">“In truth, the bones are filled with resentment.  However, if you feel such a sentiment coming from it, who am I to say otherwise?”</span></p><br/><p><span style=\"\">It looked a bit terrifying, but it was something befitting a warrior.  Artpe smirked when he saw the animated Maetel, who was excited to have a new equipment.  Then he gathered the other red bone fragments.  There were a lot of magical energy stored within the bone fragments, so he could probably create something with them.</span></p><br/><p><span style=\"\">“Next is…  Ah.  It’s the shield.”</span></p><br/><p><span style=\"\">When the Skeleton Warrior held it in its hand, it looked like a one handed bastard sword.  However, when the 12 year old Maetel held it up, it looked like a claymore.  The sword looked enormous in her hands.  Naturally, she couldn’t afford to hold the shield alongside the sword.</span></p><br/><p><span style=\"\">“I don’t want a shield!”</span></p><br/><p><span style=\"\">“This is an artifact too.  If you attack an enemy with the corner edge of the shield, it inflicts a weakening curse….”</span></p><br/><p><span style=\"\">The Skeleton Warrior hadn’t had the chance to use its shield, but this artifact was much better than the bastard sword!  The Skeleton Warrior probably blew a fuse when it wasn't able to use the shield.  On top of that, a crack had even formed on the shield.  Of course, that wasn’t Artpe’s problem.</span></p><br/><p><span style=\"\">Since she couldn’t carry it around with her hands, he proposed an idea where he would strap the shield to her back.  However, Maetel hated that idea.  It would slow her down if the heavy shield was strapped to her back.  It would be better for her to preserve her speed, so she could evade the enemy’s attack.  Still, it was a waste to just throw away the shield….</span></p><br/><p><span style=\"\">“Tsk.  It can’t be helped.  It’ll be a worse option than you using it, but….  I’ll use it.”</span></p><br/><p><span style=\"\">In the end, Artpe equipped the shield on his back.  He had gathered strips of leather as he went through the Dungeon, and he had infused Mana to strengthen them.  He created a hole on each side of the shield, and he threaded the strip of leather through the holes.  One end of the strap was brought over his left shoulder and the other end was brought underneath his right armpit.  He tied it off.  Artpe looked like a turtle.</span></p><br/><p><span style=\"\">Maetel gently screwed up her eyes as she looked at Artpe move around.</span></p><br/><p><span style=\"\">“You are usually slow, but now you became much slower.”</span></p><br/><p><span style=\"\">“There is a reason why I’m carrying it like this.  I’ll move around slowly, but at the most crucial moment, I’ll unravel the straps.  Boom!  The heavy shield will let out a loud sound as it falls to the floor.  It will startle our opponent.”</span></p><br/><p><span style=\"\">“Aht!  That’s amazing!  It’ll look very cool!”</span></p><br/><p><span style=\"\">“If I drop it on a surface that breaks into fragments like marble slabs, the visual effect would be twice as more effective.  You should remember this.”</span></p><br/><p><span style=\"\">“Yes!”</span></p><br/><p><span style=\"\">He had gathered everything that needed to be gathered.  They had to once again travel from the 1st floor to the 6th floor.  On the way down, they had to defeat the losers, who had given up on chasing them.  These were the Skeletons, who broke away from the Skeleton Warrior.  It would be easy to crush them, and the two of them tried to do just that.</span></p><br/><p><span style=\"\">They tried.</span></p><br/><p><span style=\"\">“Huh.”</span></p><br/><p><span style=\"\">“Something has changed, Artpe.”</span></p><br/><p><span style=\"\">“You are right.  Something has clearly changed.”</span></p><br/><p><span style=\"\">Everything was the same until the 5th floor.  It was the Dungeon they remembered.  The staircases were still broken, and the Skeletons were heaped up in a pile like pieces of trash to bridge the floors.  The poor Skeletons were barely alive.</span></p><br/><p><span style=\"\">As an act of mercy and a way to increase the party’s level, they killed all the Skeletons in the pile as they descended each floor.  However, when they stood in front of the staircase leading towards the 6th floor, the two heroes finally realized something was wrong.</span></p><br/><p><span style=\"\">“This….   It is made out of marble.”</span></p><br/><p><span style=\"\">Artpe mumbled in an agitated manner.  Artpe took in the sight of a long and wide staircase.  He was sure he had destroyed this staircase before when he went up to the 5th floor.  Moreover, the staircase had evolved!?  It was now made out of marble.  Then there was the large hallway that was absent from his memories!</span></p><br/><p><span style=\"\">“Marble?  So Artpe is going to drop your shield here?”</span></p><br/><p><span style=\"\">“I’ve only been carrying this for an hour.”</span></p><br/><p><span style=\"\">The Skeleton Warrior, who was basically the ruler of the 6th floor, had been killed.  It seemed the Dungeon had gone through a fundamental change.  He regretted the fact that he hadn’t been able to use his Read All Creation ability on the Skeleton Warrior before it died.</span></p><br/><p><span style=\"\">“I’m looking at it with my Read All Creation ability, but….  That’s to be expected.”</span></p><br/><p><span style=\"\">His Read All Creation ability was able to reveal all secrets, but he was just observing the marbles that made up the Dungeon.  He couldn’t gain all information regarding the Dungeon through this method.  It might be possible if he went into the deepest part of the Dungeon to observe the Dungeon's Core.  Maetel carefully asked a question as she looked at Artpe’s dismayed expression.</span></p><br/><p><span style=\"\">“What shall we do, Artpe?”</span></p><br/><p><span style=\"\">“We’ve already decided what we’ll do.  We are moving forward.”</span></p><br/><p><span style=\"\">“......yes!”</span></p><br/><p><span style=\"\">“However, you shouldn’t relax too much.  The traps are now gone, but that might actually mean….”</span></p><br/><p><span style=\"\">He was now afraid of the monsters that’ll appear inside the Dungeon from now on.  The traps weren’t being deployed to whittle down the adventurers anymore.  It meant that there would be numerous monsters powerful enough to take down the adventurers without the help of traps.</span></p><br/><p><span style=\"\">“I don't care what comes out.  I’ll most definitely protect Artpe.”</span></p><br/><p><span style=\"\">“You don’t need to put on such a grim expression...  Whatever.”</span></p><br/><p><span style=\"\">They hardened their resolves as they descended down the marble staircase.  They entered a completely different 6th floor, and there weren’t any monsters in the front.  It was the same in the middle part.  They kept checking their surrounding as they nervously went down the hallway.  After an indeterminate amount of time, they had reached the location where they had met the Elite Skeleton Warrior.</span></p><br/><p><span style=\"\">Up until now, the marble floor held nothing.  However, four white skulled Skeletons popped up from the floor.  They were colored the same as the marble floor.</span></p><br/><p><span style=\"\">[Do you want to go forward?]</span></p><br/><p><span style=\"\">[Do you want to retreat?]</span></p><br/><p><span style=\"\">[Do you want to protect?]</span></p><br/><p><span style=\"\">[Do you want to cut?]</span></p><br/><p><span style=\"\">“Step back, Artpe!”</span></p><br/><p><span style=\"\">“I’m already doing that, so you don’t have to say it!”</span></p><br/><p><span style=\"\">They were mere Skeletons, yet they were wearing pretty good leather armor.  They also carried gleaming longswords.  They moved as if they had coordinated a plan beforehand.  They approached Maetel from both sides.  Artpe used his Read All Creation ability, and he moaned when he realized the monsters were all close to being level 50.</span></p><br/><p><span style=\"\">“The difficulty of the Dungeon rose sharply…..!”</span></p><br/><p><span style=\"\">“It’s all right…  I can do this now!”</span></p><br/><p><span style=\"\">Maetel used her ridiculously fast reflexes and her good eyesight.  She was doing it at a very slim margin, but she deflected all four longswords in order.  Then she retreated a little bit, and she hardened her expression.</span></p><br/><p><span style=\"\">“Hmmph!”</span></p><br/><p><span style=\"\">In the next moment, the Bone Gauntlet let out a faint red light, and it added strength to Maetel’s slim arms.  Artpe had explained to her that a boost in her emotions could bring out the ability of the artifact.  However, he had never expected her to be able to control her emotions so freely!</span></p><br/><p><span style=\"\">He was well aware of her talent, yet even he was overwhelmed by this sight.</span></p><br/><p><span style=\"\">“You…..”</span></p><br/><p><span style=\"\">“I’m going!”</span></p><br/><p><span style=\"\">[You move forward.]</span></p><br/><p><span style=\"\">[You try to protect someone.]</span></p><br/><p><span style=\"\">[Your mental vision is still narrow.]</span></p><br/><p><span style=\"\">[You have enough courage to be recognized.]</span></p><br/><p><span style=\"\">“Shuuuuuuuut upppppppp!”</span></p><br/><p><span style=\"\">Maetel bravely swung her bastard sword, and it impacted on the longsword of the Skeleton nearest her.  The bastard sword easily broke the longsword in half.</span></p><br/><p><span style=\"\">She used her momentum to plant her right foot into the ground as she spun.  She struck the Skeleton’s body with her forearm.  When the Skeleton felt the weight of its longsword disappear, it lost its balance.  The strike sent the Skeleton towards its comrades, who was also swinging their longswords.  The longswords impacted on the body of the first Skeleton.</span></p><br/><p><span style=\"\">However, unlike the Elite Skeleton Warrior from before, these Skeletons gave praise even as they suffered under her attack.</span></p><br/><p><span style=\"\">[You have the wisdom to use the enemy’s power against them.]</span></p><br/><p><span style=\"\">[Your ability to make quick judgement is admirable.]</span></p><br/><p><span style=\"\">“Eh-eet.”</span></p><br/><p><span style=\"\">Artpe wouldn’t just standby as the bastards gave their monologue!  When the Skeletons got in each other’s way, Artpe didn’t miss the opportunity.  He attacked them.</span></p><br/><p><span style=\"\">He was overflowing with weapons he could throw!  He had used all the Mana he had gained when he reached level 30.  He had reinforced the daggers and bone fragments.  He threw them towards the Skeletons, who were attacking Maetel.  He stopped them in their tracks.</span></p><br/><p><span style=\"\">[Kooh-ahk!?]</span></p><br/><p><span style=\"\">[However, you don’t play fair.  You hide in safety as you stick out your tongue!]</span></p><br/><p><span style=\"\">“The four of you are attacking her, yet you are talking about fairness?  Are you trying to test the hero or are you trying to scout for the Demon King’s army?  Huh?”</span></p><br/><p><span style=\"\">In his previous life, he had been exceptionally skilled.  After entering this Dungeon, he had only done one thing.  His ability to throw items were on a whole different level now.</span></p><br/><p><span style=\"\">His thrown weapons all embedded themselves in their weak points.  His timing was exquisite.  He was able to stop the movements of his enemies.  In terms of throwing skills, he was so skilled that a thief might not be needed for this party.  </span></p><br/><p><span style=\"\">His main job was supposed to be a magician!</span></p><br/><p><span style=\"\">‘When I became a hero, it seems I unnecessarily picked up abilities of other disciplines….’</span></p><br/><p><span style=\"\">It was a good thing, so why was he sighing?</span></p><br/><p><span style=\"\">He was sure of this, but if he checked his Read All Creation ability, his throw skill probably exceeded level 8.  It was something very incredible, since Maetel’s Swordsmanship skill remained at level 6!</span></p><br/><p><span style=\"\">[I accept my loss, but before you defeat the others….  Kook]</span></p><br/><p><span style=\"\">“One down!”</span></p><br/><p><span style=\"\">While Artpe became confused about his own identity, Maetel had finally taken down a Skeleton.  One was defeated, yet the EXP of the two heroes didn’t rise.</span></p><br/><p><span style=\"\">“All right.  Let’s take care of the rest….”</span></p><br/><p><span style=\"\">[Your tribulation will start now.]</span></p><br/><p><span style=\"\">“They are speaking some bullshit, Maetel…   Huh?”</span></p><br/><p><span style=\"\">At that moment, Artpe’s Read All Creation ability was activated.</span></p><br/><p><span style=\"\">It was as if the fallen Skeleton hadn’t existed in the first place.  The fallen Skeleton melted into the void, and the energy from it was split threeways.  It flowed into the three remaining Skeletons.  As this occurred, Artpe was seeing a live update on what was occuring.</span></p><br/><p><span style=\"\">[Experience Record Strength Mana Transfer]</span></p><br/><p><span style=\"\">[Evolution Test Task Status]</span></p><br/><p><span style=\"\">At a glance, the words looked to have nothing to do with each other.  It looked to be a list of words.  However, it was enough of a clue for Artpe to realize what was going on!</span></p><br/><p><span style=\"\">“Shit….!  Step aside for a little bit, Maetel!  The stone and nature proceeds to return to stone and nature!  It will be beyond one’s reach!”</span></p><br/><p><span style=\"\">He desperately chanted his magic spell.  The three Skeletons were attacking a bit faster than before when the marble floor turned slippery.  They fell to the floor.  Artpe didn’t stop there.  He started unraveling the leather strap tying the shield to his back.</span></p><br/><p><span style=\"\">“Artpe!?”</span></p><br/><p><span style=\"\">“Didn’t I tell you how I’ll use this earlier, Maetel?”</span></p><br/><p><span style=\"\">“Yes.”</span></p><br/><p><span style=\"\">“I lied!”</span></p><br/><p><span style=\"\">Artpe grabbed the end of the strap and he swung it.  High quality Mana was emitted from his heart, and it flowed down through the strap.  The Mana flowed into the shield.  This task was arduous for him even if he was using both hands.  In a flash, he sent the shield flying forward.</span></p><br/><p><span style=\"\">The shield flew in an exquisite trajectory.  Artpe’s Mana within the shield was letting out a ominous light.  the Skeletons were getting up when the shield hit them.</span></p><br/><p><span style=\"\">[Koo-ahhhhhhhk!]</span></p><br/><p><span style=\"\">[You are cheap!  You are a coward!]</span></p><br/><p><span style=\"\">“I’m less cheap than you guys, you assholes!”</span></p><br/><p><span style=\"\">Artpe had reinforced the shield with his magical energy, and it had brilliantly caused a curse to be afflicted on the Skeletons.  It was a simple curse that slowed down the movement of the enemies, but it was like a blessing that allowed them to turn the table of the battle!  This was especially true when one considered Maetel’s quick movements.</span></p><br/><p><span style=\"\">Maetel’s eyes shone as she tried to finish them off.  Artpe became frightened as he stopped her.</span></p><br/><p><span style=\"\">“Don’t kill them!”</span></p><br/><p><span style=\"\">“Why?”</span></p><br/><p><span style=\"\">“If we kill them, the other monsters will become strengthened.  A Record Link was placed on all the monsters within this Dungeon!”</span></p><br/><p><span style=\"\">“Huh…...?”</span></p><br/><p><span style=\"\">Maetel didn’t understand Artpe’s words.  She didn’t comprehend how serious of a situation this was.  The ‘Record Link’ was a sophisticated trap that would unfold from now on.  The thought it made him grind his teeth!</span></p><br/><p><span style=\"\">“Anyways, the curse was strengthened, and I was able to lay it on them.  You should charge in and beat them within an inch of their lives!”</span></p><br/><p><span style=\"\">“All right!”</span></p><br/><p><span style=\"\">[Kook, cowards.  You should attempt this trial in a fair and square….]</span></p><br/><p><span style=\"\">“Shut up!”</span></p><br/><p><span style=\"\">While Maetel beat them to half death, Artpe turned around to look at the hallway.  A steel door had appeared behind them, and the hallway behind them was hidden.  When he confirmed the existence of this enormous door, he grinded his teeth.</span></p><br/><p><span style=\"\">It was as he had expected.  It was impossible to back out now once they had started this.</span></p><br/><p><span style=\"\">‘I did make a resolve to break and steal whatever is in front of us…..’</span></p><br/><p><span style=\"\">Artpe looked forward, and he saw five new Skeletons appear down the hallway.  They were all close to being level 50.</span></p><br/><p><span style=\"\">“Son of a bitch!  At the very least, give us EXP!”</span></p><br/><p><span style=\"\">The heroes had fallen into a trial that was like a swamp.  They wouldn’t be able to finish this easily.</span></p><br/>\n</div>"}