{"title": "Chapter 16 - The Link Between You and I (4)", "id": 16, "volume": 1, "url": "http://boxnovel.org/i-reincarnated-for-nothing-chapter-16-the-link-between-you-and-i-4", "volume_title": "Volume 1", "body": "<h1>Chapter 16 - The Link Between You and I (4)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 16 - The Link Between You and I (4)</p><br/><p><span style=\"\">Mycenae tried her best to look pitiful as her eyes watered.  She gave a request to Artpe.  In truth, her main objective hadn’t been the </span><span style=\"\">Basilisk Venom Powder.  She was here for the treasure box.</span></p><br/><p><span style=\"\">“W...will you sell the content of this box to me?”</span></p><br/><p><span style=\"\">“I’ll make the decision after seeing what’s in it.”</span></p><br/><p><span style=\"\">Artpe gave a cold reply.  Moreover, his gaze was cold too.  He was silently pressuring her.  It was as if he was trying to tell her to quickly move her heavy body to the side!  Mycenae’s stunning beauty was on the same level as a pebble rolling around in the streets.  It held no meaning to him!</span></p><br/><p><span style=\"\">“Kook…..  This is the first time I’ve suffered such humiliations since I started working for the Anywhere company…..”</span></p><br/><p><span style=\"\">“Wow!  It’s a treasure chest!”</span></p><br/><p><span style=\"\">An old pair of wood framed glasses and a pair of black leather boots appeared from within the treasure box.  Mycenae's eyes once again shone with a fierce light!</span></p><br/><p><span style=\"\">“Are you going to sell it to me!?”</span></p><br/><p><span style=\"\">“I’ll sell you only one of the two.”</span></p><br/><p><span style=\"\">As he spoke those words, Artpe pushed the wood framed glasses towards her.  Mycenae was able to confirm a suspicion she had.</span></p><br/><p><span style=\"\">“You must possess a tremendous observation magic.”</span></p><br/><p><span style=\"\">“Didn’t I tell you not to pry?  Well, it is obvious at this point in time, but….   Well, since I’ve been pretty heavy handed up until now, I’ll sell it to you at a price where I won’t see much profit.  I want 45 gold.”</span></p><br/><p><span style=\"\">“F….forty f…...!”</span></p><br/><p><span style=\"\">“I’ll buy it.  Thank you very much.”</span></p><br/><p><span style=\"\">The magnitude of money being exchanged had suddenly changed, and Maetel was taken aback.  However, Mycenae willingly paid the price!  Maetel’s eyes were spinning.</span></p><br/><p><span style=\"\">Artpe had a grin on his face.</span></p><br/><p><span style=\"\">“As expected, Dungeons are honey pots.  We just have to avoid being trapped and killed by the honey.”</span></p><br/><p><span style=\"\">“Customer.  At the Anywhere company, we offer services ranging from providing support to escorting parties.  If you need such services….”</span></p><br/><p><span style=\"\">“By doing so, you plan on taking half my loot as recompense?  Dream on.  Just give me my money.”</span></p><br/><p><span style=\"\">“Tsk.”</span></p><br/><p><span style=\"\">The wood framed glasses allowed one to probe the surroundings when the magic infused within the lenses was consumed.  As the holder of the Read All Creation ability, Artpe had no need of this item.  However, it was something all adventurers wanted when entering a Dungeon!  Since the demand was high, the price was also high.</span></p><br/><p><span style=\"\">The most unfortunate aspect of this item was the fact that it could only be used a limited number of times.  It disappeared after several uses.  This was why consumable items were priced depending on their number of uses, and this was one of the reasons why this particular item was given a high price.</span></p><br/><p><span style=\"\">Mycenae had estimated the amount of Mana within the wood framed glasses, and she knew she could easily sell it for 50 to 60 golds at the minimum.  She had a satisfied expression on her face as she put away the item into her cart.  Her eyes were sparkling once again.  Then her gaze landed on the black leather boots.  They were letting out a sheen of a high grade item.</span></p><br/><p><span style=\"\">“Customer.  I really want to purchase the boots…....”</span></p><br/><p><span style=\"\">“I’m not selling you this.”</span></p><br/><p><span style=\"\">Artpe answered flatly.  He took off his worn-out shoes, and he put on the leather boots.  Maetel clapped her hands.  She said it looked good on him, but Artpe didn’t care if it looked good or not.  The only thing important to him was its performance.</span></p><br/><p><span style=\"\">“I never expected to find a pair of Blink Boots in this Dungeon.”</span></p><br/><p><span style=\"\">“?”</span></p><br/><p><span style=\"\">She had known it was a rare item, but she never expected it to be the Blink Boots!  Mycenae grinded her teeth.  Maetel didn’t know much about magic, so she innocently tilted her head in confusion.</span></p><br/><p><span style=\"\">Blink was a magic that allowed one to instantly travel a short distance.  Magicians used this magic to get out of danger.  Since it was a magic spell, it had the downside of needing a long cast time.</span></p><br/><p><span style=\"\">However, it was a completely different story if the magic spell was contained within an artifact.  It only needed an infusion of Mana or a fulfillment of a specific condition to activate.  This was why the effectiveness of this magic increased in a single stroke!</span></p><br/><p><span style=\"\">“This is why boots containing Blink Magic are worth 100 gold at the very least!  It doesn’t matter if  the Mana efficiency of the item is low!”</span></p><br/><p><span style=\"\">“Amazing, Artpe!”</span></p><br/><p><span style=\"\">“Ooh-ahhhhhhhh!”</span></p><br/><p><span style=\"\">On top of it all, this pair of boots had an option of activating on its own during a moment of crisis.  It could be used once a day without it consuming Mana .  It was also possible to use it again by adding in more Mana.  Amongst the boots with the Blink option, it wasn’t an exaggeration to say that these ones were ranked in the highest class.</span></p><br/><p><span style=\"\">As a cherry on top, it had a low level requirement, so Artpe could equip it.  For Artpe, good things came in threes.  If he was to estimate the price of this pair of boots….   It would be too annoying to come up with an estimate.</span></p><br/><p><span style=\"\">“Artpe will be safe now.  I’m so happy.”</span></p><br/><p><span style=\"\">“What is up with this customer….?”</span></p><br/><p><span style=\"\">“What do you think?  She’s so innocent that she would never be able to become a merchant even after she grows up.  So….”</span></p><br/><p><span style=\"\">Artpe returned the entirety of the 45 golds he received from Mycenae.</span></p><br/><p><span style=\"\">“I want one Mana potion and I want the rest to be Stamina potions.”</span></p><br/><p><span style=\"\">“Artpe!  Are you using all of the money right now!?  We could have lived off of that money!  It would have lasted for our entire lifetime!”</span></p><br/><p><span style=\"\">“You have the ability to earn money whenever you want.  Moreover…  It is a good idea to buy items that might spare our lives”</span></p><br/><p><span style=\"\">Artpe spoke in a calm manner.  Mycenae, who was facing him, smirked.</span></p><br/><p><span style=\"\">“In many ways, I have misjudged you.  Please forgive my rudeness.  I can give you 1 mid-grade Mana potion, and 8 Stamina potions.  Will that be ok?”</span></p><br/><p><span style=\"\">“I’ll be thankful if you added an additional Stamina potion on top of that.”</span></p><br/><p><span style=\"\">“I’ll give you an additional Mana potion too.”</span></p><br/><p><span style=\"\">“Mmm?”</span></p><br/><p><span style=\"\">Artpe’s eyebrows furrowed.</span></p><br/><p><span style=\"\">“Aren’t you being a bit too generous?”</span></p><br/><p><span style=\"\">“She is being generous!?”</span></p><br/><p><span style=\"\">“I believe you will become famous in the future.  I’m just trying to gain a little bit of favor in your eyes.  Please look kindly on the Anywhere company in the future.  Thank you in advance.”</span></p><br/><p><span style=\"\">“Tsk······.”</span></p><br/><p><span style=\"\">Mycenae laughed with unreadable eyes.  She finally regained her composure as a middleman.  Artpe didn’t like being in debt, but he was in a tight spot.  He couldn’t punt her good intentions just because he wanted to.</span></p><br/><p><span style=\"\">In the end, Artpe accepted the potions without hesitation.  He took two Mana potion and one Stamina potion for himself.  After he put them away inside his robe, he put the rest in a pouch before giving it to Maetel.</span></p><br/><p><span style=\"\">“You should drink it when you are extremely tired, or you can spray it on your wounds.”</span></p><br/><p><span style=\"\">“Ah-ooooooh.  These are too expensive for me to use.”</span></p><br/><p><span style=\"\">“The most expensive thing in this world is your life.  Will you be able to use it if I frame it that way?”</span></p><br/><p><span style=\"\">“Y…yes…..”</span></p><br/><p><span style=\"\">When Maetel heard Artpe’s manly words, her cheeks turned slightly red as she meekly accepted the pouch with the potions.  Mycenae was still watching them as she smirked.  She bowed her head as a farewell.</span></p><br/><p><span style=\"\">“I am Anywhere company's Mycenae.  I’ll wait for the day when we’ll meet again.”</span></p><br/><p><span style=\"\">“Be my guest.”</span></p><br/><p><span style=\"\">“Goodbye for now.”</span></p><br/><p><span style=\"\">Mycenae disappeared alongside the same light that had appeared in the beginning.  Maetel wondered if this was all a dream, so she pinched her own cheeks.  When she realized she still had on a completely different set of items, she knew this was real.  She shook her head.</span></p><br/><p><span style=\"\">“There are too many things I still don’t know.”</span></p><br/><p><span style=\"\">“That is to be expected.  As recompense, your talent for battle is outstanding.”</span></p><br/><p><span style=\"\">“But I want to have conversations with Artpe about a lot of different subjects….”</span></p><br/><p><span style=\"\">“You want to talk more than this?”</span></p><br/><p><span style=\"\">Matel was already not listening to Artpe’s words. Instead, she was making a firm resolve as she clenched her fists.</span></p><br/><p><span style=\"\">“I’m going to do my best to read a lot of books from now on.  I’ll become smart, so I can be of help to Artpe.  I want to have many more conversations with Artpe….”</span></p><br/><p><span style=\"\">“Uh.  Mmmm.  All right.  You do your best.”</span></p><br/><p><span style=\"\">He didn’t think it was a problem that could be solved by reading more books.  Still, Artpe decided to cheer her on.</span></p><br/><p><span style=\"\">“Still, you should delay your plans on reading books.  We’ll be entering the 7th floor of the Dungeon soon.  The Skeletons will probably be stronger.  If we don’t prepare our heart for what is to come, we’ll suffer defeat.”</span></p><br/><p><span style=\"\">“I can win against anyone.  I’ll protect Artpe.”</span></p><br/><p><span style=\"\">“I like the fact that you are brave.”</span></p><br/><p><span style=\"\">He smirked as he stroked Maetel’s head.  Then he plopped down on the floor.  She tilted her head in confusion as she looked down at him.  He announced his words in a solemn manner.</span></p><br/><p><span style=\"\">“We have to sleep first before we proceed.”</span></p><br/><p><span style=\"\">“Yes!”</span></p><br/><p><span style=\"\">They roughly rolled up a straw mat.  They used it as a pillow as they laid down.</span></p><br/><p><span style=\"\">Even if a Record Link was placed over this location, a Dungeon was a Dungeon.  After a certain amount of time, new monsters would appear once again on the 6th floor.  Of course, these monsters would be under the influence of the Record Link since the spell was still over the entire Dungeon.  If the act of killing it once could break the Record Link, Artpe wouldn’t have had so much trouble manipulating it in the first place.  </span></p><br/><p><span style=\"\">Still, he was pretty sure the new monsters wouldn’t show up on the 6th floor while they slept through the night.  As a precaution, he pushed his hand forward to place Mana Threads in various locations around them.  Maetel waited for his work to be done, then she pulled herself slightly closer to Artpe.  She lay next to him.  Artpe frowned.</span></p><br/><p><span style=\"\">“You are too close.”</span></p><br/><p><span style=\"\">“I like this better, since it is warmer.”</span></p><br/><p><span style=\"\">“What happened to your shyness?”</span></p><br/><p><span style=\"\">“I buried it in my house’s backyard before I came here.”</span></p><br/><p><span style=\"\">“Your house doesn’t have a backyard.”</span></p><br/><p><span style=\"\">Maetel didn’t say any more words.  She just snuggled closer to him.  Since he couldn’t just push her away, he let her be.   </span></p><br/><p><span style=\"\">“Heh heh.”</span></p><br/><p><span style=\"\">“You have a long way to go.  A long way…..”</span></p><br/><p><span style=\"\">“Artpe~”</span></p><br/><p><span style=\"\">Maetel acted in a coquettish manner.  It was hard to imagine that this girl had annihilated the Skeletons using the bastard sword. Her voice was that sweet.  Artpe had made a resolve not to fall for her tricks, yet he found himself stroking her head.</span></p><br/><p><span style=\"\">She had been in battle all day, and she hadn’t had the chance to wash herself.  He couldn’t understand how she smelled so good.  Artpe wondered if it was because she was still young.  Artpe mused about such nonsensical thoughts as he closed his eyes.</span></p><br/><p><span style=\"\">The Dungeon’s 7th floor turned out to be more difficult rather than being easier than the 6th floor.  The monsters of the Dungeon had realized that Artpe had messed up the Dungeon’s test, and its rules.  They no longer acted as if they were testing the two of them.  The monsters were filled with the desire to punish them for sullying the holy testing ground.  This was why the monsters were more vicious in their attacks.</span></p><br/><p><span style=\"\">On top of that, the monsters on this floor was higher in level than the ones on the 6th floor.  They had an average level of 52, and there were about 600 Skeletons in total.  These monsters mainly targeted Artpe, so Artpe didn’t have the chance to build up his Mana.</span></p><br/><p><span style=\"\">[Your existence is an insult to all the heroes, who existed before you!]</span></p><br/><p><span style=\"\">[I cannot forgive you!]</span></p><br/><p><span style=\"\">“You won’t lay a hand on Artpe-ehhhhhhhhhhhhhhhh!”</span></p><br/><p><span style=\"\">They had smashed the Skeletons for a whole day, yet they weren’t able to clear the floor.  Fortunately, their levels had increased, so they could hold out for two to four days.</span></p><br/><p><span style=\"\">If possible, Artpe didn't want Maetel to use Berserk.  He didn’t want to use the Mana Link either.  However, these weren’t foes they could beat by holding their powers back.</span></p><br/><p><span style=\"\">Maetel relied on her Berserk Skill to repel the Skeletons coming at them from all sides.  Artpe had no choice, but to provide her with Mana.  At the same time, he was using his shield.  He was getting better at using it as time passed.  He used the shield boomerang to weaken his enemies.</span></p><br/><p><span style=\"\">[Koo-hahhhhhhhhhhk!]</span></p><br/><p><span style=\"\">“Artpe!  These gloves and boots are really good!  The Skeletons are easy to break using these items!”</span></p><br/><p><span style=\"\">“Yes, yes.”</span></p><br/><p><span style=\"\">[Maetel]</span></p><br/><p><span style=\"\">[Level - 43]</span></p><br/><p><span style=\"\">[Unarmed Combat Lv1]</span></p><br/><p><span style=\"\">[Strike Lv3]</span></p><br/><p><span style=\"\">[Monsters!  They are cruel monsters!  They are demons!]</span></p><br/><p><span style=\"\">[Give me death!  I will become one with my comrades to punish you all!]</span></p><br/><p><span style=\"\">“I’ll make all your comrades like you.  Then I’ll break all of you at once.  Wait a little bit!”</span></p><br/><p><span style=\"\">[Koo-ahhhhhhhhh!]</span></p><br/><p><span style=\"\">How much time had passed?  Maetel and Artpe were entirely reliant on the Berserk skill and the Mana Link.  They were barely able to beat all of the Skeletons.</span></p><br/><p><span style=\"\">Artpe felt the burden of knowing that he was probably weakening Maetel by sharing her talent.  However, unlike his worries, all of Maetel’s skills continued to evolve at a ridiculous pace.  This was also true for Artpe.</span></p><br/><p><span style=\"\">Of course, it was impossible to last a couple of days using nothing.  They had to use most of the potions they had purchased.  Fortunately, they would once again encounter a Dungeon Merchant at the end of the 7th floor.</span></p><br/><p><span style=\"\">“Oh my.  It has been only couple days, but we meet again.”</span></p><br/><p><span style=\"\">“It’s this ajumma again?”</span></p><br/><p><span style=\"\">“I’m not an ajumma!  ….huhk.  Isn’t that the Golden Lizard’s Tailbone Great Sword!?”</span></p><br/><p><span style=\"\">“97 gold.”</span></p><br/><p><span style=\"\">“Ggoo-ahhhhhhhhk!”</span></p><br/><p><span style=\"\">This was how the heroes were able to safely retool before they entered the 8th floor.  Still, the Dungeon remained very difficult.  Artpe wasn’t the creator of this Dungeon, so he had no idea how many floors had been separated using the Record Link.</span></p><br/><p><span style=\"\">They moved through the Dungeon’s 8th floor, 9th floor, 10th floor, 11th floor, 13th floor, 15th floor….   The Dungeon continued to go on and on.  The average level of the Skeletons continued to go up by a marginal amount, and at a certain point, Artpe and Maetel surpassed the level of the Skeletons.</span></p><br/><p><span style=\"\">Since they held the advantage in level, they thought they would be able to win easily from that point forward.  Right when they had this thought, powerful monsters over level 100 started to appear.  The monsters were called ghouls.  The level difference between the party and the monsters widened in the favor of the monsters, so they were put in a difficult spot once again.  </span></p><br/><p><span style=\"\">However, there weren’t any mountains they couldn’t overcome.  Before they even engaged in a fight, Artpe was able to find all the weaknesses of his enemies.  Then there was the the crazy talented Maetel, who could bring anything he ordered into reality!</span></p><br/><p><span style=\"\">This was how a period of one year had passed, and the party reached the Dungeon’s 34th floor.</span></p><br/><p><span style=\"\">“How long is this Dungeon!”</span></p><br/><p><span style=\"\">“Group fights are fun, Artpe!  Isn’t it about time for a different type of monsters to come out?”</span></p><br/><p><span style=\"\">“Customer!  Please sell this to me for 200 gold just this one time!  Please!”</span></p><br/><p><span style=\"\">At that point, Maetel had reached level 124.  Artpe had reached level 115.</span></p><br/>\n</div>"}