{"title": "Chapter 22 - Yesterday's Enemy (1)", "id": 22, "volume": 1, "url": "http://boxnovel.org/i-reincarnated-for-nothing-chapter-22-yesterdays-enemy-1", "volume_title": "Volume 1", "body": "<h1>Chapter 22 - Yesterday's Enemy (1)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 22 - Yesterday's Enemy (1)</p><br/><p><span style=\"\">The two heroes enjoyed a fun journey as they rode down the rough waters before they plummeted down the waterfall.  They fell down an unknown distance towards the bottom of the ravine, and they were barely able to pick themselves out of the water.</span></p><br/><p><span style=\"\">His entire body ached, and his stomach was writhing.  There was a long abrasive injury on his back, and his entire body was soaked.  It was the worst feeling.  He never wanted to experience it again.</span></p><br/><p><span style=\"\">“Ooh-ehhhhhk.  Kol-ruhk, kol-ruhk.”</span></p><br/><p><span style=\"\">Artpe was making a bizarre sound as he threw up water.  The sound was horrible enough to cool even a thousand year love.  However, Maetel stood next to Artpe, and her expression remained normal.   She looked worried as she patted Artpe’s back.</span></p><br/><p><span style=\"\">“Are you ok, Artpe?”</span></p><br/><p><span style=\"\">“I’m not ok!  Unlike you, I can’t maintain balance while being swept away by the waterfall!”</span></p><br/><p><span style=\"\">“Why not?  After I realized what was happening,  I just had to wiggle my body a little bit…...”</span></p><br/><p><span style=\"\">At that moment, Artpe didn’t find himself to be endearing, since he was having malicious thoughts towards Maetel.  The feeling was so intense that it made him wonder if he could have won miraculous battles as one of the Four Heavenly Kings if he had been full of malice like this!</span></p><br/><p><span style=\"\">“I wish I was hurting instead of Artpe…..”</span></p><br/><p><span style=\"\">However, he was confronted with the sincerely worried face of Maetel, so such feelings melted away.  Artpe became needlessly embarrassed, so he turned his gaze away from her as he replied in a small voice.</span></p><br/><p><span style=\"\">“It’s nothing.  It doesn’t hurt that much, so it’s fine.”</span></p><br/><p><span style=\"\">“Really?  What a relief.”</span></p><br/><p><span style=\"\">Artpe had worried his belongings might have been lost, while he was being swept away by the waterfall.  He checked his belongings, and everything was still there.  He still had the two money pouches and the black egg.</span></p><br/><p><span style=\"\">Maetel still had the potion pouch within her armor, and she had held on tightly to her bastard sword and longsword. She was slowly becoming acclimatized to the fact that there were some things that were more important than one’s life as an adventurer.</span></p><br/><p><span style=\"\">It was also a fact that the two heroes were equally soaked.  To make things worse, it was closer to winter than fall.  The chilly winds were lowering their body temperature.</span></p><br/><p><span style=\"\">“Should I make a fire?”</span></p><br/><p><span style=\"\">“Yes, I’m cold.”</span></p><br/><p><span style=\"\">Maetel had a shy smile on her face as she nodded her head.  Artpe looked up at the violet sky.  It was slowly getting darker.  A year had passed, so he wondered if it was possible that the soldiers of the kingdom was still searching for them near here.</span></p><br/><p><span style=\"\">“Mmm.  Even if they are still searching for us, It doesn’t matter anymore.”</span></p><br/><p><span style=\"\">Even if one discounted their levels, the skills they possessed were formidable.  They would be able to face down even a level 200 being possessing a high rank Class.  There was also no way anyone above that level would be looking for them.  They had better things to do. </span></p><br/><p><span style=\"\">“Here.”</span></p><br/><p><span style=\"\">“Wow!”</span></p><br/><p><span style=\"\">Artpe extended several strands of Mana String, and he cut down a nearby tree.  His actions were so natural that Maetel started clapping.  However, Artpe’s performance was just starting.</span></p><br/><p><span style=\"\">He created edges on the five black Mana Strings, and he rotated them to cut the tree into small pieces.  He only moved a small portion of the wood pile.  As a finishing touch, Artpe used Hyper Rubbing to cause intense friction amongst the wood.  It caused it to ignite.</span></p><br/><p><span style=\"\">It burst into flame.  The whole process took only 25 seconds.</span></p><br/><p><span style=\"\">“As expected, Artpe is amazing!”</span></p><br/><p><span style=\"\">“If I had a fire magic spell, I could do this in two seconds…..”</span></p><br/><p><span style=\"\">He now had a lot of money, so he wondered if he should have bought simple magic spells when he had the chance.  Artpe thought about visiting the Tower of Mages in the future as he basked in the fire.  Maetel stuck close to him, and she started rubbing her cheek against his cheek.</span></p><br/><p><span style=\"\">He was now used to this level of skinship, so Artpe could only let out small sighs.  On the other hand, Maetel had a secret smile of triumph on her face.</span></p><br/><p><span style=\"\">“Hooo.  This is comfortable and great  The fact that we aren’t doing anything is pretty good, Artpe.”</span></p><br/><p><span style=\"\">“I don’t want you to get infatuated with that feeling.  You have to be careful or else you won’t want to do anything else later.  The moment you think that work is a losing proposition, your life is at an end.”</span></p><br/><p><span style=\"\">In his life as a demon, he had seen those, who hit the jackpot through creating a book or a related item….  There were those, who dreamed about not working their entire lives by living off the royalties.  However, these people failed to pull it off, because they were lacking in experience and common sense.</span></p><br/><p><span style=\"\">“Eh-ee.  It is good to do something like this occasionally.  If we do it every day, it won’t be as good!”</span></p><br/><p><span style=\"\">“....sometimes you say smart things.”</span></p><br/><p><span style=\"\">The two small heroes rested quietly against each other.</span></p><br/><p><span style=\"\">It had been a long time since they were able to spend such carefree time.  They had been continuously tormented by the internal agents of the Dungeon.  Their current situation was tranquil and peaceful.</span></p><br/><p><span style=\"\">He didn’t feel the need to speak.  The sounds of the water flowing in the ravine and the crackling sound of the wood burning drowned out the silence.</span></p><br/><p><span style=\"\">When a little bit of time had passed, Maetel opened her mouth to ask a question.</span></p><br/><p><span style=\"\">“.....Artpe, what are we going to do from now on?”</span></p><br/><p><span style=\"\">“What do you want to do?”</span></p><br/><p><span style=\"\">“I want to become stronger.  I want to help the unfortunate.  Moreover, Artpe and I…...”</span></p><br/><p><span style=\"\">“Yes, you should stop there.  Everything you said you’ll be able to do to your heart’s content.”</span></p><br/><p><span style=\"\">“Really!?”</span></p><br/><p><span style=\"\">Maetel’s eyes had an odd shine to it.  He was sure she had misunderstood something again.  It was a hassle to set her straight, so he just kept his mouth shut.  However, at that moment, a loud sound could be heard without any warning.</span></p><br/><p><span style=\"\">[Crown Prince….   Kill….!]</span></p><br/><p><span style=\"\">[Knights….   Your highness…...]</span></p><br/><p><span style=\"\">The sound of weapons hitting each other could be heard, and he felt the surrounding Mana being consumed to activate a magic spell.  Then there was a stern voice and a desperate voice mixed in with those sounds.  It was a scenario that might occur at the beginning of a novel about a knight.  It was such a formulaic pattern!</span></p><br/><p><span style=\"\">When Artpe assessed the commotion, his face crumpled as he mumbled to himself.</span></p><br/><p><span style=\"\">“Shit. An incident immediately occurred when you said something unnecessary.  I thought I would be able to rest for at least two pages more.”</span></p><br/><p><span style=\"\">“Do you think I have some ability I don’t know about!?”</span></p><br/><p><span style=\"\">“No, I think this is just part of our karma.”</span></p><br/><p><span style=\"\">At that moment, a fight was going on somewhere close by.  If Artpe and Maetel hadn’t heard it, it wouldn’t be a problem.  However, once they heard the sound of the fight, Artpe knew they will get involved one way or another.</span></p><br/><p><span style=\"\">“Why?”</span></p><br/><p><span style=\"\">“This is how the world works.”</span></p><br/><p><span style=\"\">He wanted to say she was always like that in his previous life.  However, he pushed down on those words firmly.</span></p><br/><p><span style=\"\">Yes, this was the destiny of a hero.   It was strange, but wherever the hero went, an incident that might or might not occur in a hundred years happened.  The hero inevitably got sucked into the mess, and the hero becomes the main player of the crisis.  The hero would solve the problem in a dashing manner, and his or her name value would increase!</span></p><br/><p><span style=\"\">Anyways, this wasn’t something that happened just once or twice.   Wherever a hero went, the hero was always involved in something.  There could be an awakening of a legendary ruin, a visitation by an Arch Mage, the awakening of an ancient monster or an assassination attempt of the royal family!</span></p><br/><p><span style=\"\">It made one wonder if a hero would die from stress even before he or she got a chance to fight the Demon King.  The accidental events that occurred around heroes was frequent and annoying!</span></p><br/><p><span style=\"\">“I wonder if such tumult would happen in the first place if the hero hadn’t existed.  Wherever the hero goes, the unrest follows the hero.  This is why we have to kill the god.”</span></p><br/><p><span style=\"\">It was such an incoherent explanation.  It was like saying an apple farmer had to behead the king, because there was a good harvest.  However, Maetel nodded her head in a serious manner.</span></p><br/><p><span style=\"\">“I’ll kill a god for Artpe!”</span></p><br/><p><span style=\"\">“All right.  How commendable.”</span></p><br/><p><span style=\"\">While Artpe and Maetel was having an idiotic conversation, the sound was getting closer.  Screams were interspersed with the sounds of steel clashing.  Maetel’s body flinched as if she was bothered by it.  Artpe could easily read her inner thoughts, so he let out a bitter laugh as he spoke.</span></p><br/><p><span style=\"\">“We’ll eventually be swept up into whatever is going on over there, Maetel. If it bothers you, you should go on ahead.  I’ll just stay here a little bit longer to warm my body.”</span></p><br/><p><span style=\"\">“Ah.  No.”</span></p><br/><p><span style=\"\">Unexpectedly, Maetel shook her head from side to side.</span></p><br/><p><span style=\"\">“It does bother me and I want to rescue them, but….  The person I have to protect is Artpe.  If I head out carelessly, Artpe might get drawn in.  If you were hurt, I would feel like killing myself.”</span></p><br/><p><span style=\"\">“What…..?”</span></p><br/><p><span style=\"\">It was such an unexpected answer that Artpe was at a loss for words.</span></p><br/><p><span style=\"\">Maetel’s love for him was heavy.  It was so heavy that he wondered if he’ll be crushed to death by it.  On a side note, he was afraid his presence was having a weird influence on the pure hero.</span></p><br/><p><span style=\"\">If it was the hero from his past life, she would have immediately ran towards those in trouble, and she would have saved them.  It wouldn’t matter if the place held traps or a strong foe.</span></p><br/><p><span style=\"\">However, she now had Artpe.  She had someone she had to protect.  This was why she was hesitating as she mulled over the various consequences of her actions.</span></p><br/><p><span style=\"\">Of course, he couldn’t blame her for it.  Most people avoided getting involved in another's trouble.  They protected what was important to them.  Artpe was merely a former member of the Four Heavenly Kings, so he was a bit happy to find out that Maetel treasured him so much.</span></p><br/><p><span style=\"\">Still, he felt as if something was off.</span></p><br/><p><span style=\"\">‘When I awoke as a human boy, I surmised that I would become the biggest variable that would cause the biggest change between my past life and this current life….  Yes, I was right.  I’m the biggest variable.  She’s suppose to be the brightest beacon of light, yet this variable was able to bring her down to the level of a regular human….’</span></p><br/><p><span style=\"\">He suddenly felt fear, but he didn’t show it.  He calmly organized the situation inside his head.  He camly spoke towards the blond-haired girl, who was looking at him.</span></p><br/><p><span style=\"\">“That sounds idiotic.  We'll become involved anyways.  That is why you should just do whatever you feel like doing.”</span></p><br/><p><span style=\"\">“I want to be by Artpe’s side……forever.”</span></p><br/><p><span style=\"\">“....yes.  All right.”</span></p><br/><p><span style=\"\">It felt as if he had received an excessively heavy confession of love, but he dismissed it as him imagining things.  Artpe let out a big sigh as he got up.</span></p><br/><p><span style=\"\">“Ah.  Artpe?”</span></p><br/><p><span style=\"\">“Hmmph.”</span></p><br/><p><span style=\"\">He had made the fire, because he wanted to create a suitable atmosphere.  However, he just need a small amount of Mana to dry their clothes.  He emitted a small amount of Mana to try his underwear and robe.  Then he extended his hand to make her body moisture-less.</span></p><br/><p><span style=\"\">“Since our clothes are dry now, let’s go.  If I’m going, will you go?”</span></p><br/><p><span style=\"\">“.....yes!”</span></p><br/><p><span style=\"\">The two heroes kept talking in a manner unfitting heroes, yet they were finally able to take on work that heroes would undertake.  A hero was a violent force that butted into other’s fights.  The hero attempted to solve problems in a manner to their liking.  Heroes were the ultimate busybody.  This was what a hero was!</span></p><br/><p><span style=\"\">“Since we are about to intrude on someone else’s business, I’ll tell you about the basic stance we’ll take.”</span></p><br/><p><span style=\"\">“Yes!”</span></p><br/><p><span style=\"\">Artpe ran through the forest with Maetel as he spoke to her.  Artpe’s stamina was very poor compared to Maetel.  However, he had gone past level 140, so he had enough physical prowess to overpower most mercenaries.  He wasn't just a simple magician.  He possessed the Hero Class and it had influence on him.</span></p><br/><p><span style=\"\">“The most difficult part is deciding, which side is the aggressor.  We have no idea about the circumstances behind the fight.  We have no idea who is good and who is bad.  This kind of stuff isn’t as clear cut as one would like it to be.”</span></p><br/><p><span style=\"\">“Ooh-mmmm.  This is too difficult.”</span></p><br/><p><span style=\"\">“Well, let’s say we decided which person we want to kill.”</span></p><br/><p><span style=\"\">“Heeeek!”</span></p><br/><p><span style=\"\">Up until now, she had only slaughtered monsters.  Maetel freaked out at the idea of killing a human.  As expected, she was immature regarding this type of stuff.  Artpe let out a bitter laugh as he continued his explanation.</span></p><br/><p><span style=\"\">“What if we find out later that we killed the good guys?  What if we helped the bad guys?  There are times when such a thing occurs.”</span></p><br/><p><span style=\"\">“You can’t kill good people!”</span></p><br/><p><span style=\"\">“However, there could be misunderstandings.  The good guys might think we are the bad guys too, and they might fight us.”</span></p><br/><p><span style=\"\">“No way…...”</span></p><br/><p><span style=\"\">Unshed tears glistened in the innocent hero’s eyes.  She was confronted with an explanation that couldn’t be accepted by the simplistic values she possessed.  This was why her mind was in a state of confusion.</span></p><br/><p><span style=\"\">Truthfully, Maetel was incredibly cute right now.  How could she be so righteous and innocent! Every time he cause a black stain on her pure white heart it was the sweetest….   Crap.  A bad habit he picked up during his days as the Four Heavenly King had almost appeared.  Artpe calmed himself as he continued to speak his words.</span></p><br/><p><span style=\"\">“That is why our standard of judgment can’t be absolute good or evil.”</span></p><br/><p><span style=\"\">“Huh…..?”</span></p><br/><p><span style=\"\">“No one can determine what is absolutely good or evil.  This is the province of the gods.  This isn’t something dem….  This isn’t something should be decided by humans.  If we make such judgments, it would be a form of arrogance and delusion.”</span></p><br/><p><span style=\"\">“Huuuuuuh······?”</span></p><br/><p><span style=\"\">They were getting closer to the commotion.  This was why Artpe had to make this simple.  He had to speak with a firm voice, so she would never forget it.</span></p><br/><p><span style=\"\">“This is why you should think of anyone that hates you as being evil.”</span></p><br/><p><span style=\"\">“······.”</span></p><br/><p><span style=\"\">It was a way of thinking more befitting a Demon King than a hero.</span></p><br/><p><span style=\"\">“If someone tries to kill you, harm you, use you or have indecent desires….  They are all evil.  You put yourself on the side of the good, and the others on the side of evil.”</span></p><br/><p><span style=\"\">“However, Artpe, you just said we shouldn’t decide what is good or evil…..”</span></p><br/><p><span style=\"\">“We aren’t determining absolute good and evil.  It is a relative form of of good and evil.  You accept that you won’t always be right, then you do what you want.”</span></p><br/><p><span style=\"\">It was such an absurd, ridiculous and fraudulent way of thinking.  Even if Maetel was young and naive, she knew Artpe’s words were wrong.  A single slip would make one fall into the pit of evil.  It was an absurdly selfish and arrogant way of thinking.</span></p><br/><p><span style=\"\">However, he had lived with such a philosophy as a demon for several hundred years.  He had been the weakest amongst the Four Heavenly Kings, and he always suffered under irrational violence.  This was why he had developed such a mindset.</span></p><br/><p><span style=\"\">Nevertheless…...</span></p><br/><p><span style=\"\">“Artpe....”</span></p><br/><p><span style=\"\">Maetel raised her still shaking eyes to look at Artpe.  She knew they had entered into the site of the fight, yet she still asked the question.</span></p><br/><p><span style=\"\">“How do you judge me, Artpe?”</span></p><br/><p><span style=\"\">“You dummy.  You don’t even have to ask me that question. ”</span></p><br/><p><span style=\"\">Artpe lifted the corner of his mouth.  He laughed as he made a statement.</span></p><br/><p><span style=\"\">“You are ‘always’ in the category of absolute good for me, hero-nim.”</span></p><br/><p><span style=\"\">“......all right, Artpe.”</span></p><br/><p><span style=\"\">Maetel firmly nodded her head.  Across the thicket, weapons were clashing noisily.  She answered him as she threw herself towards the site of the battle.</span></p><br/><p><span style=\"\">“Then I’ll do whatever what I want to do!”</span></p><br/>\n</div>"}