{"title": "Chapter 31 - Dungeon, Evolution and Success (5)", "id": 31, "volume": 1, "url": "http://boxnovel.org/i-reincarnated-for-nothing-chapter-31-dungeon-evolution-and-success-5", "volume_title": "Volume 1", "body": "<h1>Chapter 31 - Dungeon, Evolution and Success (5)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 31 - Dungeon, Evolution and Success (5)</p><br/><p><span style=\"\">[Silpennon (Le Diaz)]</span></p><br/><p><span style=\"\">[Thief]</span></p><br/><p><span style=\"\">[Level : 49]</span></p><br/><p><span style=\"\">Silpennon purchased the Crystal Ball of Blessing for 300 gold, and he was able to safely choose his new class.  There was no funny business like a third hero making an appearance.  It was the same as what Artpe had seen in his past life.  The path to being a thief was opened to Silpennon.</span></p><br/><p><span style=\"\">The Crystal Ball of Blessing was a very expensive and rare artifact.  After registering its owner, it could be used several more times.  Silpennon could use it to open the path to his high rank Class in the future.</span></p><br/><p><span style=\"\">“Ho-ooh.  I’m a thief.”</span></p><br/><p><span style=\"\">“Koohk.  He really is a thief…...”</span></p><br/><p><span style=\"\">Inwardly, Artpe had worried another change would occur, but he could relax now.  </span></p><br/><p><span style=\"\">When the crown prince she had served was turned into a thief, Leseti became forlorn.</span></p><br/><p><span style=\"\">“Maybe I should give up on everything.  Maybe I should go live in the countryside, and feed cows…...”</span></p><br/><p><span style=\"\">“Do you think running a dairy farm is easy?  The Demon King may overlook such arrogance, but I won’t overlook it!”</span></p><br/><p><span style=\"\">“What do you think running a dairy farm involves!  What type of fantasy are you caught up in!?”</span></p><br/><p><span style=\"\">Silpennon was the only one in a peaceful state amongst all of them.</span></p><br/><p><span style=\"\">“What is wrong with being a thief?  I don’t feel too bad about it.”</span></p><br/><p><span style=\"\">Crown prince was a position that allowed him to possess absolute authority, but at the same time, it was a shackle that he couldn’t escape from.  When his father the king was killed, he had run away from his uncle’s evil influence, and he had reached this point.   Silpennon kind of liked the view of the world from where he stood right now.</span></p><br/><p><span style=\"\">“I’m not in a position where I’m completely happy with the situation, but…..  Yes, I’m Silpennon the thief now.  Hoo.  It isn’t too bad.  Moreover, I had always yearned to get out of my birdcage.  It feels as if I’ve grabbed freedom by the hand.”</span></p><br/><p><span style=\"\">Silpennon kept smiling as he observed good manners towards Artpe again.</span></p><br/><p><span style=\"\">“If it wasn’t for you, I don’t know what would have happened to me.  The fact that I followed after you might be the best decision I’ve made in my life.  Thank you, Artpe.”</span></p><br/><p><span style=\"\">“The hard part will start from now on.  If you thank me so early, I’ll feel guilty.”</span></p><br/><p><span style=\"\">“You really are the type of person that can’t accept a thanks without making a fuss..”</span></p><br/><p><span style=\"\">All Four Heavenly Kings of the Demon King’s army were like that.  If they were transparent about their feelings, they would meet their end before they could even start.  Ah, this also made it hard for them to return the feelings of others.</span></p><br/><p><span style=\"\">“Huh? Silpennon, Silpennon……”</span></p><br/><p><span style=\"\">At that moment, Mycenae suddenly tilted her head in puzzlement as she looked at them.  The name made her think of a hot issue right now.  It happened when she was having this thought.</span></p><br/><p><span style=\"\">Silpennon didn’t hesitate.  He nodded his head.</span></p><br/><p><span style=\"\">“That’s right.  I used to be the crown prince of Diaz.”</span></p><br/><p><span style=\"\">“Your highness, you shouldn’t tell her that!”</span></p><br/><p><span style=\"\">Did he decide it was information that he didn’t need to hide?  Or was he just too young?  Of course, a Dungeon Merchant didn’t go around blabbing about information regarding a customer.  Still, it wasn’t wise to reveal such information unnecessarily.</span></p><br/><p><span style=\"\">However, Silpennon was already well aware of this fact.  He wasn’t an idiot.  </span></p><br/><p><span style=\"\">“However, I’m not anymore.”</span></p><br/><p><span style=\"\">Silpennon looked back with a refreshed expression on his face.  He wanted to accept his current self, so he planned on making a clean break from his past.</span></p><br/><p><span style=\"\">“So stop call me by that title, Leseti.  I’m only a level 49 thief Silpennon now.  I plan on burying my position as the crown prince in the darkness until we defeat the Demon King.  That is why I don't care, who finds out about it.  No one will be able to find the crown prince Silpennon.”</span></p><br/><p><span style=\"\">Mycenae’s eyes became round.</span></p><br/><p><span style=\"\">“Oh my.  So that’s how it is.  Somehow, I did feel an air of nobility coming from you.  Wait a second.  Did my little customers already have a connection to the throne…..”</span></p><br/><p><span style=\"\">As her imaginations started to stretch far and wide, Artpe extended his finger to wrap the end of the Mana String into a ball.  He tapped it against Mycenae's smooth forehead.</span></p><br/><p><span style=\"\">“Ah-yaht!”</span></p><br/><p><span style=\"\">“If you act so clingy, you won’t be popular with men, ajumma.”</span></p><br/><p><span style=\"\">“Kooh….   Whatever  you may take me for, before I became a merchant, men lined up just to be able to catch my eyes!  There were enough of them to encircle the central square ten times!  Customer, you are the only one that doesn’t recognize my charm!  This is the problem with kids!”</span></p><br/><p><span style=\"\">Artpe completely ignored Mycenae's grumblings as he gathered all the loot.</span></p><br/><p><span style=\"\">It was hard to express this in words.  It was merely a Slime Dungeon, yet the items and rewards gathered there was too amazing.  Of course, a part of the reason was the fact that they were the first to discover this Dungeon.  Moreover, all the secret locations had been revealed.  On top of that, the artifacts were all gathered in a single place by the Huge Slime.  It all came out from its body.</span></p><br/><p><span style=\"\">The items that possessed weak magical energy were dissolved into pure magical energy within the Huge Slime.  The magical energy either strengthened the Huge Slime or it strengthened the other items.</span></p><br/><p><span style=\"\">Of course, the remaining items would go up in value.</span></p><br/><p><span style=\"\">“There’s a lot this time around.  Did you completely clean out the whole Dungeon?”</span></p><br/><p><span style=\"\">“Yes.  It is as you say.  Let’s see……  I want 653 gold for all the minor items. Call?”</span></p><br/><p><span style=\"\">“Mmm…  Call.”</span></p><br/><p><span style=\"\">“All right.”</span></p><br/><p><span style=\"\">Both sides already knew that the other was a master.  This was why the transaction between Artpe and Mycenae didn’t take long.</span></p><br/><p><span style=\"\">Of course, the worth of the items was assessed and the transaction ended.  It happened way too fast.  The rest of the party looked on in disbelief.  They looked at Artpe and Mycanae as if they were some kind of monsters.</span></p><br/><p><span style=\"\">Artpe handed over all the loot to Mycenae, but he held back several artifacts.  It was time for them to earnestly evaluate the worth of the artifacts.  Mycenae gulped.</span></p><br/><p><span style=\"\">“In truth, the items I really want you to sell me are those…...”</span></p><br/><p><span style=\"\">“Let me think about it.”</span></p><br/><p><span style=\"\">In truth, Artpe had wished for more Skill Books to come out, but it ended at the Mana Control.  Even the common Fire Magic Spell Book hadn’t dropped.  Instead, there were rare items that were as rare as the Huge Slime.</span></p><br/><p><span style=\"\">“Let’s talk about this potion first.”</span></p><br/><p><span style=\"\">[Slime Potion]</span></p><br/><p><span style=\"\">[All forms of liquid will be made into slime.  If someone with low resistance to Mana drinks it, one will die immediately as one’s blood would be turned into slime.  It is a very rare and foul substance.  It doesn’t emit hostile Mana, so it is perfect to use for assassination.  Only a Slime that has evolved to the extreme may produce it at a low probability.  This item has almost never been seen before within history.]</span></p><br/><p><span style=\"\">“······mmmm?”</span></p><br/><p><span style=\"\">“What is that potion, customer?  What is it?  It is bothering me!”</span></p><br/><p><span style=\"\">“This….  I’ll keep it for now.”</span></p><br/><p><span style=\"\">He had no idea where he should use this.  However, strange and useless items like this usually helped out at crucial moments.</span></p><br/><p><span style=\"\">“Aht.  You should give me an explanation on what it is….   Ooh-eeeee”</span></p><br/><p><span style=\"\">Mycenae's cheeks puffed out when Artpe put away the potion without giving an explanation.  Of course, he wasn’t into older women, so he ignored the rest of her words.  He took out the second loot.</span></p><br/><p><span style=\"\">It looked as if it was an item that was crafted by using a part of the Huge Slime’s body.  It was a longbow that didn’t look too sturdy.</span></p><br/><p><span style=\"\">[Flexible Hunter’s Bow]</span></p><br/><p><span style=\"\">[The shape will change depending on the user’s objective.  It can change from a short bow to a ballista.  Mana will be consumed to make a Mana Arrow.  Its power will depend on the user’s Archery level.  Users without Archery level of 100 cannot use it.  It is possible to increase durability of the item by injecting Mana.]</span></p><br/><p><span style=\"\">After he checked the information regarding the Artifact, Artpe couldn’t hold back his words.  He tackled the issue that was bothering him.</span></p><br/><p><span style=\"\">“Ballista should not be classified as a bow!?”</span></p><br/><p><span style=\"\">“Pull yourself together, customer!  That isn’t a ballista.  It is a longbow!?”</span></p><br/><p><span style=\"\">Artpe activated his Read All Creation ability again, and he checked each component of the bow.  He injected some of his power to check if the bow could change into a short bow and a ballista.</span></p><br/><p><span style=\"\">Of course, the requirement to use the bow was to be an archer of high rank Class, but Artpe was a hero.  He could easily brush aside such restrictions.</span></p><br/><p><span style=\"\">“Huhk.  It really is a ballista!?”</span></p><br/><p><span style=\"\">“This is better than expected…....”</span></p><br/><p><span style=\"\">Artpe ignored the shocked Mycenae.  He calmly retreated.  He turned around to look at Maetel, and he asked her a question.</span></p><br/><p><span style=\"\">“Do you have any thoughts about using a bow, Maetel?”</span></p><br/><p><span style=\"\">“It looks fun to use, but I’m not confident that I can handle anything that isn’t a club or a sword.  That is why I don’t want it.”</span></p><br/><p><span style=\"\">“You made a good decision.”</span></p><br/><p><span style=\"\">She was talented enough to pick up any weapon, and she would be able to use it well enough to be comparable to the people of the same Class.  However, if she learned too many things, she might regret it someday.  She was most suited to close combat.  She should focus on what she was best at.</span></p><br/><p><span style=\"\">“Customer, I will…..”</span></p><br/><p><span style=\"\">“I want 1,650 gold.  Do you want to buy it?”</span></p><br/><p><span style=\"\">“Ooh-mmmmm.   If I can find the proper owner, I’m confident I can charge twice that price, but…..”</span></p><br/><p><span style=\"\">“You do know there is a scarce supply of this type of artifacts in the world, right?”</span></p><br/><p><span style=\"\">Artpe had a fair point.  It was a bow that could change form to fit the situation!</span></p><br/><p><span style=\"\">It can be used from short range to very long distance.  Moreover, there was no need to carry around arrows, and the durability could be recovered.  If Artpe was an archer, he would have kept it.  It would have been a no brainer.</span></p><br/><p><span style=\"\">“A right owner….  A right owner….”</span></p><br/><p><span style=\"\">Mycenae thought over it for a very long time.  This was a huge transaction, so she would have to invest a lot into this venture.  This was why she was a bit hesitant.  Artpe coaxed her to allay her concerns.</span></p><br/><p><span style=\"\">“I have to buy a lot from you this time around.”</span></p><br/><p><span style=\"\">“······hoo-ooh.  I’ll buy it for 1650 gold.”</span></p><br/><p><span style=\"\">This was how over 1,500 gold was exchanged in a single transaction.  Silpennon was a crown prince of a nation, yet even his mouth fell open at the sight.</span></p><br/><p><span style=\"\">“Are adventurers the type of occupation where one makes a lucrative amount of money?”</span></p><br/><p><span style=\"\">“Of course, if all adventurers could find a jackpot of a Dungeon like these little customers, they could earn as much.  Unfortunately, 70% of all adventurers fail to find anything.  Then about 20% of the adventurers covet the treasures, but they retreat when faced with danger.  Nine percent of the adventurers bravely charge forward and they are killed.”</span></p><br/><p><span style=\"\">“So that means only 1% of them are able to get what they want?”</span></p><br/><p><span style=\"\">“Moreover, if the 1% challenges another Dungeon, they’ll be back in the roulette with 1% chance of succeeding.”</span></p><br/><p><span style=\"\">Opportunity always come hand in hand with risk.  However, one shouldn’t be delusional about the order in which it was faced.  If opportunity exists within danger, the idiots always died first.</span></p><br/><p><span style=\"\">“... I will take those words to heart.”</span></p><br/><p><span style=\"\">“Well, if one observe these customers, it does make one wonder if those statistics are wrong!”</span></p><br/><p><span style=\"\">After Mycenae delivered the warning with a serious voice, she undercut her own words as she turned around.  She looked at the last loot left behind by the Huge Slime..</span></p><br/><p><span style=\"\">“The last thing left is the chest plate.  Its durability and Mana reaction seems to be uncommon…..”</span></p><br/><p><span style=\"\">However, before the sensor for Mycenae's worldly desires could activate, Artpe handed the armor to Maetel.</span></p><br/><p><span style=\"\">“Maetel.”</span></p><br/><p><span style=\"\">“Yes, thank you!”</span></p><br/><p><span style=\"\">“Why don’t you two just hurry up and marry?!”</span></p><br/><p><span style=\"\">It was called a Blast Plate.  It was an armor that only protected the body from the front.</span></p><br/><p><span style=\"\">It had a red sheen, and at a glance, one could tell it was something extraordinary.  It had the option of protecting its owner from a critical blow, and a fixed amount of Mana was consumed to blunt the effects of an attack.  The options were perfect for a defensive gear.</span></p><br/><p><span style=\"\">The cherry on top was that it had a similar option to the Bone Gauntlet.  It could raise the user’s strength by detecting its owner’s emotions.  It was the perfect armor for Maetel, who used Berserk.  Since it had an emotion type buff on it, it was the emotion felt by the Huge Slime right before it perished.  However, such information could be omitted.</span></p><br/><p><span style=\"\">“Hue hue.  The red light is too pretty.”</span></p><br/><p><span style=\"\">“Ah.  I think there are more customers that will look for that instead of the bow…..”</span></p><br/><p><span style=\"\">Maetel was happy, and Mycenae was wistful.  Leseti, who didn’t have any claims to the artifact, could only look on as she smacked her lips.</span></p><br/><p><span style=\"\">It was as if he didn’t care what they were feeling.  Artpe suddenly sat on the floor, and his eyes let out a harsh light.  It was as if the main fight was yet to come!  That was what his expression indicated.</span></p><br/><p><span style=\"\">“Sit next to me, Maetel.”</span></p><br/><p><span style=\"\">“Yes!”</span></p><br/><p><span style=\"\">Maetel, who didn’t know what was going on, sat next to Artpe, and her eyes shone too.  The bizarreness of the situation doubled.</span></p><br/><p><span style=\"\">Artpe spoke in a solemn manner towards the puzzled Mycenae.</span></p><br/><p><span style=\"\">“I told you I have a lot to buy this time around, ajumma.”</span></p><br/><p><span style=\"\">“I’m not an ajumma.  However, you clearly did say that.”</span></p><br/><p><span style=\"\">“Hoo…..”</span></p><br/><p><span style=\"\">Artpe shut his eyes tight.  There were a lot of thoughts going through his head as he was about to spend an enormous amount of money.</span></p><br/><p><span style=\"\">Should he do it right now?  Should he?  He needed money for many things in the future, so should he make such an expenditure at this point in time?</span></p><br/><p><span style=\"\">However, he didn’t know when he’ll be able to see the Dungeon Merchant again.  It would be hard to find a suitable location such as this…..</span></p><br/><p><span style=\"\">“All right.”</span></p><br/><p><span style=\"\">“I’ll be embarrassing if you suddenly confess to me.”</span></p><br/><p><span style=\"\">Artpe replied to Mycenae's remark, which had been made in humor.</span></p><br/><p><span style=\"\">“I want you to give me all the Skill Books that can be learned by a level 150 Warrior and a level 150 Magician.”</span></p><br/><p><span style=\"\">“······.”</span></p><br/><p><span style=\"\">Artpe did the only thing that the palace did right in developing the hero.  Basically, he started on the task of turning money into ability. </span></p><br/>\n</div>"}