{"title": "Chapter 35 - Come to Think of It, I'm a Hero (3)", "id": 35, "volume": 1, "url": "http://boxnovel.org/i-reincarnated-for-nothing-chapter-35-come-to-think-of-it-im-a-hero-3", "volume_title": "Volume 1", "body": "<h1>Chapter 35 - Come to Think of It, I'm a Hero (3)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 35 - Come to Think of It, I'm a Hero (3)</p><br/><p><span style=\"\">The Obsidian of Greed was originally an item used to gather power of curses.  It was an ingredient used when making a more powerful curse.</span></p><br/><p><span style=\"\">This was an item for magicians who dealt in curses, and it was something they desperately wanted.  It was representative of magic stones that couldn’t be made artificially.</span></p><br/><p><span style=\"\">‘Moreover, this one is Rank A.  It means it can store a lot of curses.’</span></p><br/><p><span style=\"\">On the other hand, there was an obvious limitation to this item. If an item or a Mana had the property of a curse, it would all be absorbed into the stone.  However, it was hard to do anything significant when the curse was already active.</span></p><br/><p><span style=\"\">A curse wasn’t like placing a load on a person’s shoulder.  A portion of a person’s skin, bones, muscles, brain and heart went through subtle changes.  These changes permeated into one’s entire being, and the change would become inextricably linked to one’s body.</span></p><br/><p><span style=\"\">This was why if one was rash in extracting the cursed Mana, the innate Mana within the subject would go on a rampage before killing the subject.</span></p><br/><p><span style=\"\">“If so….  Come, Aena.  I’ll deal with you first.”</span></p><br/><p><span style=\"\">“Y... yes!”</span></p><br/><p><span style=\"\">Of course, such limitations didn’t apply to Artpe, because he possessed a rare cheat ability called the Read All Creation ability!</span></p><br/><p><span style=\"\">If he concentrated, he could get a detailed information on the composition of plants or creatures.  So how could extracting cursed Mana from affected regions be difficult for him!</span></p><br/><p><span style=\"\">“This might hurt a little bit.  Endure it.”</span></p><br/><p><span style=\"\">“W...what?  What did I do······.”</span></p><br/><p><span style=\"\">“Endure it.”</span></p><br/><p><span style=\"\">“Ah, hoohk!?”</span></p><br/><p><span style=\"\">Artpe abruptly placed the Obsidian on Aena’s forehead.  Afterwards, Aena’s body started to shake.  The townspeople who had been watching this sight immediately stepped back in fright.  Of course, Artpe didn’t pay any attention to them.</span></p><br/><p><span style=\"\">“I caught it.”</span></p><br/><p><span style=\"\">He was able to pinpoint the part of her weak innate magical energy that was being dyed black with the energy of the curse.  After a precise extraction, he spoke to her.</span></p><br/><p><span style=\"\">“Still, your erodibility was very low, so you didn’t suffer as much.”</span></p><br/><p><span style=\"\">“E...erodibility······?”</span></p><br/><p><span style=\"\">Aena was shaking from the pain as she asked him a question.  She could immediately guess at what had happened, so her eyes opened wide.</span></p><br/><p><span style=\"\">Yes, she was sure her body hadn’t felt normal.  </span></p><br/><p><span style=\"\">If one felt fine when one was being changed into a monster through a curse, that person would be the incredible one.</span></p><br/><p><span style=\"\">“Monster...Modification Curse….?  Then my dongsaeng and the other children of the town…..”</span></p><br/><p><span style=\"\">“The children were rounded up by them, because of that reason.  Of course, they are also the ones who placed the curse on you.”</span></p><br/><p><span style=\"\">“Eeeeeeeek.”</span></p><br/><p><span style=\"\">The girl bit her lips in anger.  A small smile appeared on Artpe’s lips when he saw this.  Pain usually transferred into emotion.  The curse had progressed to a mere 1%, yet for a brief moment when she raged…...</span></p><br/><p><span style=\"\">“All right.  You did very well.”</span></p><br/><p><span style=\"\">“Ah.”</span></p><br/><p><span style=\"\">Artpe stepped back when he saw a slightly darker light within the Obsidian.  He checked her with his Read All Creation ability, and not an ounce of curse energy was left behind.  Aena blinked her eyes in wonder.</span></p><br/><p><span style=\"\">“My body feels light.  I thought I had merely been tired and hungry…..”</span></p><br/><p><span style=\"\">“Did the unrest in your emotions lessen?”</span></p><br/><p><span style=\"\">“······yes.”</span></p><br/><p><span style=\"\">Artpe impishly asked the question when it seemed he already knew the answer.  Aena slightly nodded her head in confirmation.  The townspeople who had been behind her started to crowd forward.</span></p><br/><p><span style=\"\">“W...will we change into monsters too, magician-nim?”</span></p><br/><p><span style=\"\">“I’m sorry, but could you perhaps heal us too…..”</span></p><br/><p><span style=\"\">When it came to their own well-being, they were quick to step forward.  Artpe let out a bitter laugh as he shook his head.</span></p><br/><p><span style=\"\">“You guys are fine.  It seems the curse was placed on children, who hadn’t matured completely yet.  So the problem is with your offsprings.”</span></p><br/><p><span style=\"\">“T...then my daughter….!?”</span></p><br/><p><span style=\"\">“Curse…..  A curse!”</span></p><br/><p><span style=\"\">“It’ll be fine if I’m able to find them quickly.  You shouldn’t worry about them this early in the process.”</span></p><br/><p><span style=\"\">They had thought this was a simple matter of the soldiers capturing their sons and daughters.  However, a Modification Curse had been placed on them!  The complexion of the townspeople immediately darkened.</span></p><br/><p><span style=\"\">They were afraid of the sword carrying soldiers.  However, they were more afraid of magic and curses.  These were mysterious powers of unknown origin.</span></p><br/><p><span style=\"\">“What shall we do, magician-nim?  We’ll do anything.  If my child turns into a monster, I…….!”</span></p><br/><p><span style=\"\">“I beg of you!  Please save my son!”</span></p><br/><p><span style=\"\">They were already very worried about their offsprings, but they found out there was a time limit to their rescue.  The townspeople were agitated, and they went wild.  If the soldiers were in front of them, they would have tried to rip them into pieces.  Moreover, Maetel was also in a similar state of agitation.</span></p><br/><p><span style=\"\">“Let’s go right now, Artpe!  I don’t know where the children of this tow is right now, but I’m sure the bad guys will do the same thing at different locations!”</span></p><br/><p><span style=\"\">“It is as you say.  We don’t know where they are, so do you really want to search the entire region?”</span></p><br/><p><span style=\"\">“Still, we have to do something!”</span></p><br/><p><span style=\"\">In truth, old stories and legends about heroes were rife with such scenarios.</span></p><br/><p><span style=\"\">Some town would fall into crisis, and the hero would try to solve a problem with the help of the townspeople.  However, a tragedy occurred when time ran out, and the hero would receive a big emotional burden.  However, the pain of this event would allow the hero to mature mentally.</span></p><br/><p><span style=\"\">“However, we don’t need to mature mentally, so we can skip that step.”</span></p><br/><p><span style=\"\">Heroes who busily ran around deserts and jungles, while crying or laughing, were old news to him.  Artpe couldn’t afford to waste his mental and physical energy like that.</span></p><br/><p><span style=\"\">What was so fun about searching everywhere, because one didn’t know location where the Quest had to be carried out!  He was a new breed of hero where he would finish the Quest as soon as he received it!</span></p><br/><p><span style=\"\">“Everyone get out of my way.”</span></p><br/><p><span style=\"\">“Yes.  Yes, sir!”</span></p><br/><p><span style=\"\">Several dozen Mana Threads turned into several hundred as they extended out from Artpe.  In a flash, they exited the town to spread into the region.</span></p><br/><p><span style=\"\">“Hoo-oooh······.”</span></p><br/><p><span style=\"\">Artpe looked as if he was standing still while he had his eyes closed.  However, even those that didn’t know anything about Mana could feel a pressure coming from this strange energy, and the townspeople were unable to move.  Maetel, who had a decent idea on what was going on, let out a sigh of relief.</span></p><br/><p><span style=\"\">“If you had such a simple solution, you should have told me in the first place.”</span></p><br/><p><span style=\"\">“Who said this was simple?”</span></p><br/><p><span style=\"\">He took out a Mana potion bottle, and he drank it.  He focused on his control as he grumbled to himself..  The several hundred Mana Threads were spreading in all directions, and the radius of the search increased steadily.  It increase to 500 meters, 1 kilometers, 2 kilometers and so on.</span></p><br/><p><span style=\"\">In his past life, he was level 350, so this would have been easy.  However, it wasn’t easy at all right now!  If it wasn’t for the Mana String spell that strengthened the Mana Thread to the extreme, it would have been impossible to attempt this move.  He briefly had this thought when he learned it, but it was a very cheat-like spell.</span></p><br/><p><span style=\"\">‘Wait a moment.  I could probably overlay my spell similarly to what Maetel did last time with her techniques…...’</span></p><br/><p><span style=\"\">He wondered if his spell could be used in a more effective manner if he overlaid his perception skill on top of the Mana String.</span></p><br/><p><span style=\"\">Artpe immediately put his theory into action, and of course, it came back as a resounding success.  He wondered if he was stealing and using Maetel’s talent for such a trivial matter.  He had been afraid….  However, if he was to be truthful about it, he was thankful for it.</span></p><br/><p><span style=\"\">“Five kilometer.  Ten kilometer...”</span></p><br/><p><span style=\"\">“Shall I lend you my Mana, Artpe?”</span></p><br/><p><span style=\"\">“You only have a modicum of Mana, so how.…..I found them.”</span></p><br/><p><span style=\"\">He was about to grumble towards Maetel when Artpe’s eyes opened wide.</span></p><br/><p><span style=\"\">The townspeople looked at him with nervous eyes.  Aena looked at him with trust, since he had freed her body from the curse.  Maetel was ready to charge any opponents waiting for them…..</span></p><br/><p><span style=\"\">Artpe spoke to them in a solemn manner.</span></p><br/><p><span style=\"\">“Let’s go create an epilogue.”</span></p><br/><p><span style=\"\">The place was located at a hill that was pretty far from the town.  In other words, it was a great place to run into a Dungeon in the wild.</span></p><br/><p><span style=\"\">In this world, there were exactly two types of Dungeons.  The first type was the sleeping Dungeons that waited for a hero to find it.  The other type were Dungeons made by being that opposed the heroes.  These Dungeons contained dangerous traps, super secret information or secret tests.  These were Dungeons that had to be hidden away.</span></p><br/><p><span style=\"\">The common point of the two types of Dungeons was the fact that heroes eventually found it to loot their contents.  The Dungeon in this hill would suffer the same fate.</span></p><br/><p><span style=\"\">“You guys don’t have to follow me.”</span></p><br/><p><span style=\"\">“You are helping us despite the dangers, so how can we stay behind…..”</span></p><br/><p><span style=\"\">“You guys will get in the way, so just hide somewhere nearby.  Of course, it isn’t my responsibility if you die in the process.”</span></p><br/><p><span style=\"\">He was an ex-Four Heavenly King turned hero, so he was remorseless.  He firmly got rid of nuisances that would get in the way of the Quest beforehand!</span></p><br/><p><span style=\"\">The townspeople became afraid when they realized there might be other dangers nearby.  However, they couldn’t run away while leaving their children behind.  They firmly held to their edged tools they had brought from their homes.  They stood their ground.</span></p><br/><p><span style=\"\">“W...we will wait for you here.  At the very least, we will greet our children from here!”</span></p><br/><p><span style=\"\">“Really?  Aren’t you guys just scared by the fact that soldiers might attack your town again?”</span></p><br/><p><span style=\"\">“I...it isn’t like that!”</span></p><br/><p><span style=\"\">It seemed he hit the mark.  Artpe smirked as he tried to enter into the cave located at the middle of the hill…..</span></p><br/><p><span style=\"\">“I want to go with you.”</span></p><br/><p><span style=\"\">“Ah.  You again?”</span></p><br/><p><span style=\"\">Aena blocked their way.  She held a branch in one hand.  It was a weapon that even a goblin would have an easy time breaking.</span></p><br/><p><span style=\"\">“The children will be afraid if only magician-nim’s party enters. The children need at least one familiar face.”</span></p><br/><p><span style=\"\">“It isn’t as if your words don’t have merit, but you…...”</span></p><br/><p><span style=\"\">She would be perfect for the part of a supporting cast who died midway in the story.  Usually, the hero would rage at her death, and the boost provided by the emotion would lead the hero into victory.</span></p><br/><p><span style=\"\">In truth, the girl’s words were raising so many death flags that the stench coming from the death energy was unbearable.  It wouldn’t be strange if she fell dead right now!  At the same time, it was also likely that she would come back out unharmed, since the circumstances was a bit suspicious.</span></p><br/><p><span style=\"\">“I beg of you, magician-nim.  I know these children the best.  They are already afraid from being kidnapped by the soldiers.  If the magician-nim’s party encounter the children in such a state, a large mistake may occur…….!”</span></p><br/><p><span style=\"\">She had put a lot of thought into this. At this point, he couldn’t turn turn her down.  From that moment on, Artpe decided to give up on Aena’s life.  Yes, if she’s meant to die, she would find a way to die eventually!</span></p><br/><p><span style=\"\">“All right.  Your sacrifice will make it more likely that the children would be unharmed.”</span></p><br/><p><span style=\"\">“Why is my sacrifice the premise of the children being safe!?”</span></p><br/><p><span style=\"\">“Let’s go, Maetel.  I’ll leave the fighting to you.  When I tell you to stop, you have to stop.”</span></p><br/><p><span style=\"\">“I understand!”</span></p><br/><p><span style=\"\">The party consisting of the two heroes and the Village Girl A left behind the townspeople.  They charged into the cave.  There was a very dark and dreary energy circulating within the cave.  A curse was mixed into the Dungeon’s air.  To be precise,  it was curse meant to propagate a different spell.</span></p><br/><p><span style=\"\">“You must be enjoying it since there are a lot to eat, right?”</span></p><br/><p><span style=\"\">Artpe took out the Obsidian, and it sucked in all the curses.  He never expected to find such a treasure within the normal town A at this point in time.  This was a loss for the Demon King’s army!</span></p><br/><p><span style=\"\">“Yes.  As expected, I think Artpe would become a good father.  Ooh-hue-hue.”</span></p><br/><p><span style=\"\">Maetel watched Artpe fill the Obsidian with the curse.  She looked on with satisfaction as she mumbled to herself.  Aena wondered if she could trust these heroes that acted very strangely starting from the Dungeon’s entrance. She had these thoughts, but she also didn’t have much choice.  She followed behind them.</span></p><br/><p><span style=\"\">When they entered a little bit deeper into the cave, the enemies soon appeared.  The soldiers they had seen from the town was mixed in with a batch of soldiers they had never seen before.</span></p><br/><p><span style=\"\">The most important fact was that there was a magician wearing a hooded robe standing within their midst.</span></p><br/><p><span style=\"\">“Huht!?  They are intruders.  Intruders!”</span></p><br/><p><span style=\"\">“Be careful.  He’s the mage I saw in town…..!”</span></p><br/><p><span style=\"\">“Magician?  That brat is one?”</span></p><br/><p><span style=\"\">It seemed the soldiers didn’t feel any shame at being found out.  They immediately got ready to attack.  It meant they were fully aware of what they were doing, and they were prepared to kill to fulfill their goals.</span></p><br/><p><span style=\"\">At this point, he was sure that there was a connection between the archduke, the black magician and the Demon King’s army.  Artpe was about to step forward as he grinded his teeth, but Maetel took one step forward before he was able to.</span></p><br/><p><span style=\"\">“You are making children into monsters…..  It’s bad.”</span></p><br/><p><span style=\"\">Maetel’s emerald colored eyes flashed from anger.  Artpe realized she had already finished judging who was good and evil.</span></p><br/><p><span style=\"\">“Anyways, we……..”</span></p><br/><p><span style=\"\">This was the part where the hero and the villains confronted each other.  The villains would lay out their twisted logic behind their actions as they mocked the hero.</span></p><br/><p><span style=\"\">The hero would become enraged, and they would fight.  The bad guys liked to talk while fighting, so they would prattle on about the righteousness of their actions.  They would try to justify their cause.  The hero would get angry once again at their words.  The Death Knight within the Dungeon meant to foster the heroes was a great example of this.</span></p><br/><p><span style=\"\">“Be quiet!  Shut the hell up!”</span></p><br/><p><span style=\"\">However, the current situation was different.  Maetel swung her bastard sword once before her enemies could pull their swords out or activate a spell.  They all fell to the floor.</span></p><br/><p><span style=\"\">She hadn’t activated her Berserk.  She wasn’t even using her Strike skill.  It was a light attack that possessed not a single ounce of Mana.</span></p><br/><p><span style=\"\">“Hoo-oooooh.”</span></p><br/><p><span style=\"\">They were completely wiped out.  They didn’t even have the time to give their lines.  The mage wasn’t able to call out the Black Flame Dragon sealed within its right arm!</span></p><br/><p><span style=\"\">“Heeeek······.”</span></p><br/><p><span style=\"\">Aena had depended on them, because she had seen the power of Artpe as a magician.  However, when she saw the terrible sight created by Maetel, her face turned pale.</span></p><br/><p><span style=\"\">On the other hand, Maetel was the one who had created this terrible sight, yet it didn’t feel real to her.  She tilted her head in confusion as she turned to speak to Artpe.</span></p><br/><p><span style=\"\">“They are too weak, Artpe.”</span></p><br/><p><span style=\"\">Artpe did a double take when he heard her words, but a smile soon broke out on his face.  He nodded his head at her.</span></p><br/><p><span style=\"\">“It’s all right.”</span></p><br/><p><span style=\"\">Usually, a normal hero’s first quest was accompanied by failure and hardships.  However, they had unintentionally leveled up as much as they could in the kingdom of Diaz.  In other words….</span></p><br/><p><span style=\"\">“Since we are progressing towards part 2, this is normal.”</span></p><br/><p><span style=\"\">“Part 2?”</span></p><br/><p><span style=\"\">Maetel titled her head in puzzlement, but Artpe just smiled at her.  While Aena was still in an utter state of confusion, the heroes went through the entire Dungeon.</span></p><br/><p><span style=\"\">No one could get in their way.</span></p><br/>\n</div>"}