{"title": "Chapter 120 - Double Crisis (1)", "id": 120, "volume": 2, "url": "http://boxnovel.org/i-reincarnated-for-nothing-chapter-120-double-crisis-1", "volume_title": "Volume 2", "body": "<h1>Chapter 120 - Double Crisis (1)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 120 - Double Crisis (1)</p><br/><p>“Artpe!?”</p><br/><p>“Artpe-nim!”</p><br/><p>If one was awake, one wouldn’t be able to ignore the chaos that was sweeping through the entire city.  It was that chaotic.  The holy priestess and the hero had been immersed in a war that could only be waged between women.  However, they saw the images outside, and they heard the voices accompanying the footage.  They immediately stood up, and they ran out of the room.  Their eyes turned round when they discovered Artpe outside of the room.</p><br/><p>“Artpe-nim, do you know what is happening right now!?”</p><br/><p>“I have a rough idea, but I don’t have time to explain it to you….  Just follow me!”</p><br/><p>Silpennon had shown him his map today, and there was only one region that hadn’t been explored completely.  Artpe was successful in narrowing down the location that would be most suitable for what was going on right now.  Artpe took the two girls, and he abruptly started running.</p><br/><p>“Aht!  Holy priestess-nim-kahk!”</p><br/><p>A priest had caught sight of them, and he started running towards them.  The priest’s head was sent flying when Artpe swung his Mana String.</p><br/><p>“Act now, ask questions later.”</p><br/><p>“Artpe-nim!?”</p><br/><p>“It’s all right.  I won’t kill anyone that doesn’t possess Demonic energy.”</p><br/><p>“Demonic energy….   As expected, hero-nim…..!”</p><br/><p>“I'll tell you everything later.  We have to move right now.”</p><br/><p>Artpe let out a light laughter as he tossed the corpse into his Dimensional Pouch.  Vadinet was at a loss for words when she saw this.</p><br/><p>Artpe seemed to know everything that was going on inside the temple.  However, that fact was secondary to what he was showing her.  Until now, Vadinet had strictly known him to be a magician, yet he was showing her feats that was unimaginable.  It ran counter to what he had shown everyone on the surface.</p><br/><p>“Let’s hurry before more priests gather here.  We have to save our friends.”</p><br/><p>“Who’s Aria?  Who is that girl?  How come she is taking on the main role of a misfortunate heroine?”</p><br/><p>“She is Silpennon’s ally.  She also possess an Innate ability, and her magical energy beyond her Record.  She is the ideal candidate to use as a sacrifice for a spell.”</p><br/><p>Artpe grinded his teeth as he spoke.  They were very unlucky.  If Silpennon and Aria weren’t discovered by the pope, he would have be able to leisurely move the pieces on the board to his liking…. </p><br/><p>At least, Silpennon was able to activate the Artifact, and he was able to expose the true identity of their opponent with truly exquisite timing.  Fortunately, their true identity was being spread across the city.  Artpe was within the Zero Class, yet he could feel the city become red hot.  He could feel the anger, shock and suspicion of the people.  He could vividly hear the shouts coming from them.</p><br/><p>“The masquerade is at an end.  Even if we resolve this as soon as possible, it will take a very long time for this city’s faith to recover…..”</p><br/><p>“It seems Artpe-nim had made preparations for all of this.  While you laughed and conversed with me, you ordered your underlings to expose the dark underbelly of the temple to the whole world…..  I cannot begin to fathom the new Artifact and the type of magic being used right now.”</p><br/><p>“Hue hue.  Isn’t Artpe too cool?”</p><br/><p>“Yes, he really is….   He is too amazing.”</p><br/><p>It wasn’t as if friendship blossomed after their fight.  The two women were showing off their affections for Artpe, and in the end, they had made a connection.</p><br/><p>Artpe started not liking the idea of being connected to these women.  </p><br/><p>No.  Didn’t he have hope yet?</p><br/><p>Silpennon will encounter Vadinet at the site, and she’ll miraculously awaken to her true love towards Silpennon….  </p><br/><p>Was he expecting too much?</p><br/><p>“Koohk!?  Hero-nim······.”</p><br/><p>“Ok.  Bye!”</p><br/><p>There were two types of priests that were running around the Zero Class.  There were the priests that were a bit slow in the head.  These priests still didn’t know what was going on.  Then there were the priests, who were jittery.  They were anxious at the prospect of being found out.</p><br/><p>The former group would never cross paths with Artpe’s party.  The latter group was immediately killed when encountered.  Roa growled every time a priest was killed, but he wouldn’t let her drain the Demonc energy from the dead bodies.</p><br/><p>“Later.  I’m pretty sure a more appetizing prey will show up soon.”</p><br/><p>[Nyaa-ahhhhhhh.]</p><br/><p>Maetel had a good idea as to who that prey was.  Maetel steadily went into her battle mode as she confirmed something with Artpe.</p><br/><p>“Artpe, what level is the pope?”</p><br/><p>“He’s around 340.”</p><br/><p>“340!?”</p><br/><p>“For your information, he is also one of the Four Heavenly King in the Demon king’s army.”</p><br/><p>Maetel and Vadinet felt like they had turned stupid when he dropped this enormous bombshell.   He smirked as he continued to speak.</p><br/><p>“The Demon King’s army always enjoys hitting humanity on the back of the head.  By taking the temple, the hero will despair even if they aren’t able to kill the hero.  That is the way of the Demon King’s army.”</p><br/><p>Moreover, there were two heroes this time around.  This was also the reason why they were insistent on killing one of the heroes.  This plan was the height of inefficiency, so it definitely had the touch of the Chef’s hands!</p><br/><p>Moreover, the one overseeing this whole plan was…..</p><br/><p>“His name is Jeriet, and he possesses an Innate ability of Transformation.  He is…..   He is the weakest amongst the Four Heavenly Kings.”</p><br/><p>In his past life, Jeriet had been one seat above Artpe in the Demon King’s army.  It was fair to assume that he was probably the weakest now.</p><br/><p>He was like Artpe.  His abilities weren’t focused solely on the martial aspects.  If the hero’s party had to fight a higher level opponent, he was probably the most fair opponent.</p><br/><p>“I sense something was wrong with the pope, but I never expected him to be a Demon…..”</p><br/><p>“That bastard eats his chosen prey.  The consumption of his preys allows him to duplicate all the special characteristics of his preys.  He is able to transform into their form.  At some point, he took the place of the real pope.”</p><br/><p>“My god…..”</p><br/><p>She knew their current situation was urgent, but Vadinet couldn’t help it.  She asked another question.</p><br/><p>“How do you know all of this, Artpe-nim!?”</p><br/><p>“It is the nature of my Innate ability.  You cannot hide anything from my eyes.  Like right now….”</p><br/><p>Several Mana Strings extended from his hand, and the strands swiped at empty air.</p><br/><p>In the next moment, a part of the hallway naturally crumbled, and a staircase leading downward was revealed.</p><br/><p>“My god…..   Your powers really gives me the chills.  As expected of hero-nim….!”</p><br/><p>“So, Artpe….”</p><br/><p>Vadinet’s eyes were full of love and admiration.  On the other hand, Maetel was somewhat used to his abilities, so she unsheathed her sword as she asked him a question.</p><br/><p>“Is there a way we can win against a level 340 enemy?  We were able to win against the Kraken and the Ancient Kraken thanks to extremely favorable circumstances.  The current situation…..”</p><br/><p>“It really is the perfect situation for us.  You don’t know this yet, but there is a reason why Demons don’t directly confront a hero in the human realm.”</p><br/><p>“Huh?”</p><br/><p>Maetel tilted her head in confusion, but Artpe wasn’t the one to explain the situation.  The explanation was given by none other than the holy priestess.</p><br/><p>“A Demon’s ability is weakened in the human realm.  There is also a difference in Mana depending on the realm.  Demons are weakened up to a certain point here, and they aren’t able to manifest their power given to them by their level.”</p><br/><p>She continued to speak as the party descended the staircase.</p><br/><p>“I’m embarrassed to say this, but…...  It is possible to weaken them further with the power I possess.  It is the significance of being a holy priestess.”</p><br/><p>“As their first act, this was why the Demon King’s army decided to render the temple powerless.  It is also why one of the Four Heavenly King transformed into the pope to infiltrate this place.  He did it despite knowing the danger.”</p><br/><p>In truth, the plan had been very successful in his previous life.  A Four Heavenly King died in that venture, but he had expertly razed the temple to the ground.  The holy priestess’ tragic end was just a bonus.</p><br/><p>“However, even if I’m capable of weakening them, I’m merely a holy priestess with no battle capabilities.  That is why I acted ignorant until Artpe-nim arrived.  I had no choice.”</p><br/><p>“The fact that you became aware of their intentions is amazing in itself.  Even a normal hero won’t be able to see through that bastard’s transformation ability.”</p><br/><p>Unfortunately for their enemies, Artpe and Maetel weren’t normal heroes.  It was as if they were heroes that had experienced killing a Demon King before.  On the other hand, Vadinet was only a holy priestess.  It was quite the feat that she was able to notice the seditious energy crawling through the inner temple.</p><br/><p>“I guess we are just going to rush him.  He is level 340, but he is weakened since he is in the human realm.  If this woman casts an additional weakening spell…..  Yes, I think it’ll be possible.”</p><br/><p>“However, the biggest variable that could sway the outcome of this situation is the magic circle.”</p><br/><p>She had used the magic circle in her past life to transmogrify herself into a Demon.  As expected, the holy priestess made an astute observation.</p><br/><p>“You said the Demon has a transformation ability, and he ate the pope.  In turn, this gives him everything possessed by the pope, so he probably gained the ability to use the magic circle….   However, it doesn’t seem he was able to activate 100% of its power.  Anyways, there is a high probability that he’ll use the magic circle to amplify his power.”</p><br/><p>“No.  If he did that, he’ll be tied to the magic circle.  He isn’t just aiming for Silpennon and Aria.  He wants to eliminate either Maetel or me.  Instead of amplifying his power, there is a high chance that he’ll use it for a summoning magic.”</p><br/><p>“Summon magic….  I see.  I didn’t realize there was that possibility…..”</p><br/><p>In truth, similar words were written inside the exchange diary found within the Zero Class by Silpennon and Aria.</p><br/><p>At the time, it said they wanted to summon a level 250 magical beast.  However, they had a sacrifice now, so they would probably attempt to bring out a much higher level magical beast.  It might not be a one-off.  They might attempt multiple summons.  </p><br/><p>The price of this magic was Aria….. </p><br/><p>Artpe bit his lips.</p><br/><p>“She said she wanted an active role, but she keeps acting like a heroine in a knight’s tale.”</p><br/><p>“Artpe….  That girl too….?”</p><br/><p>“No, she isn’t mine.  She’s with Silpennon.”</p><br/><p>After descending the staircase, they ran through a dark hallway.  The voice and the image being projected above the city no longer reached them.  However, one thing was for sure.  Aria’s situation would not get better.  In fact, her situation was turning graver by the minute.  Even if one factored in the fact that the Four Heavenly King Jeriet was weakened, Silpennon hadn’t reached level 220 yet.  Jeriet wasn’t a foe that could be overcome by Silpennon.</p><br/><p>‘If he is like the one I knew, he’ll act big.  He’ll try to show off.  He’ll give the hero’s party the time to make preparations.  He’s supposed to be the prototypical Four Heavenly King of the Demon King’s army….  If he finds out about the footage that is being sent out through Silpennon’s magical tool, the situation will get worse.  Then Silpennon will try to save Aria even if it is unreasonable for him to do so.  He might get hurt…..  Shit!’</p><br/><p>That was why it would have been better if they weren’t found out in the first place!</p><br/><p>If so, the reformed holy priestess would have worked with the two heroes to gratifyingly fuck over the pope and his core allies.  Artpe would have been able to induce a classic scenario.  However, he was about to lose two precious talents if things continued along this path!  On top of that, the temple was going to be destroyed in its entirety!</p><br/><p>“Artpe!  Over there!”</p><br/><p>“Kill them all!”</p><br/><p>“Understood!”</p><br/><p>The secret hallways reached all corners of the Zero Class.  The priests, who had thrown away their god to worship the Demonic god, were using the secret hallways to converge on the magic circle!</p><br/><p>Artpe and Maetel were merciless as they cut down anyone in their path.  Vadinet was very flustered as she watched them.  Then she finally realized she could do something to help them.</p><br/><p>“O...oh, my god!  The heroes are fighting against evil as you’ve ordered. Please imbue them with power suitable for this situation!  Hero Bless!”</p><br/><p>This was something only a holy priestess could use on a hero.  It was a buff spell.  This was obvious, but this was the first time Artpe and Maetel had received it.</p><br/><p>There wasn’t a clear amplification of their power, but it felt as if their bodies were light as feather.  The feeling was temporary, but it felt as if they had leveled up multiple times at once.</p><br/><p>“It is a buff that increases the quality of your soul!  I thought it might be something that both of you must have when facing an opponent with a higher level…..”</p><br/><p>“Ah, yes.  This is the first time I’ve received a buff.  It’s something new.”</p><br/><p>Fortunately, this blessing wasn’t headed only towards Artpe.  It would have been a lie if he said he hadn’t been worried.  However, even Vadinet was able to discern what was most important right now.</p><br/><p>When Artpe saw this, he carelessly smiled towards Vadient.  At his gaze, Vadinet felt embarrassment and happiness.  She lowered her head.</p><br/><p>‘Does Artpe-nim know about what I did back then…..? Ah.  Ah-ooh-ooh.  Artpe-nim is so advanced in the path of magic that he might have noticed it.  I see.  He acted completely innocent during the Blessing…..  I can’t believe how truly great he is.’</p><br/><p>It didn’t matter what Artpe did.  In the end, she felt herself liking him more.  Her feelings surged.  In that aspect, she was similar to Maetel.  Artpe, who was unaware of her feelings, just continued to move forward.</p><br/><p>After several more priests(There were only 20 priests residing within the Zero Class.  They had killed a lot of them.) were killed, they were finally able to reach the scene.</p><br/><p>“Silpennon, are you somehow holding out…..   Huh?”</p><br/><p>He was ready to overturn everything as he poured his magic into his Magic String.  He forcefully kicked the door open, and he saw the underground square.  Artpe was having a hard time believing his eyes.</p><br/><p>He didn’t want it to happen, but he had been ready for the worst case scenario of Aria being sacrificed.  He had been prepared to face a level 300 three-headed monster······.</p><br/><p>“Aria!”</p><br/><p>“Ooht.  Ooh-ahhhhhhhh!”</p><br/><p>“Koohk.  Y...you bitch!”</p><br/><p>The center of the magic circle was still letting out an uncontrollable amount of light.</p><br/><p>However, the magic wasn’t completed for the duration.  The Mana of the magic circle was pouring into the sacrifice, who had been placed in the middle of the magic circle.</p><br/><p>“What the······?”</p><br/><p>Artpe rubbed at his eyes as he looked at the scene again.  He used his Read All ability, but the information he received wasn’t different from what he already knew.</p><br/><p>Aria was using her Innate ability.</p><br/><p>She was assimilating with the magic circle.</p><br/>\n</div>"}