{"title": "Chapter 199 - Final Chapter (2)", "id": 199, "volume": 2, "url": "http://boxnovel.org/i-reincarnated-for-nothing-chapter-199-final-chapter-2", "volume_title": "Volume 2", "body": "<h1>Chapter 199 - Final Chapter (2)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 199 - Final Chapter (2)</p><br/><p><span>The surrounding was deadly quiet. In an instant, a level 400 plus high ranked Demon was killed.   Of course, the reaction to such an event wouldn’t be minor.  The Demons, who were under the command of the dead Demon, came to a halt in fright.  In the end, they were turned into humans by the power of the magic circle.</span></p><br/><p><span>[My power is decreasing.]</span></p><br/><p><span>[It isn’t just our power.  The aggression that we use to violently attack our enemies can’t be felt. That bastard is trying to shackle us by turning us into humans!]</span></p><br/><p><span>“Shackle?  You guys have been wearing a mask up until now.  Why can’t you see that I’m just taking that mask off?”</span></p><br/><p><span>When a firm idea took root within him, Artpe no longer hesitated over his actions.  He didn’t agonize over what he had to do.   The Reclamation magic existed to turn everything back into its original form.  This wasn’t Artpe’s will.  It was the will of the world, so there was no way this spell would be defeated!</span></p><br/><p><span>[Can it be…..]</span></p><br/><p><span>The low voice of an old man could be heard.</span></p><br/><p><span>[I never expected someone to complete that spell…..]</span></p><br/><p><span>“He has overwhelming Demonic energy.  Regina!  Etna!”</span></p><br/><p><span>“We are ready.”</span></p><br/><p><span>“This Demonic energy…..?”</span></p><br/><p><span>He let the staff use the Reclamation magic.  He had done this before when he fought against the arm of the Demonic god.  This allowed Artpe to participate in the battle.  Of course, the Reclamation magic expanded at a slower rate as a result!   This was why he wanted his party to take care of the fighting, but….</span></p><br/><p><span>“Wait a moment.”</span></p><br/><p><span>As he induced the staff and the magic tome to resonate, he was able to gain momentary freedom.  He put his Mana into the hand of destruction, and in a flash, it grew in size.  It regained its original size.  When Artpe relayed his will to it, it spread its fingers, and it created an enormous barrier.  </span></p><br/><p><span>Afterwards, the Baptism of the Demonic Spear impacted on the middle of the barrier!</span></p><br/><p><span>The hand did well in blocking it, and it destroyed the spear.  In the process, Artpe was able to assess his opponent.  He scrunched up his face.</span></p><br/><p><span>“I knew it didn’t make sense.  I should have known it would turn out like this.”</span></p><br/><p><span>[What is that hand?  A life form such as this exists in this world?  No.  I asked the wrong question.  It is type of golem made through magic!  Interesting.   A mere golem was able to block my attack.  How is that possible?  However, it won’t be able withstand my next attack.  I already figured out the golem’s special characteristic!]</span></p><br/><p><span>“Artpe, he’s annoying.”</span></p><br/><p><span>“Don't worry.  I feel the same way.”</span></p><br/><p><span>The second attack came flying in.  First, the enemy manifested a magical net to restrict the movement of the hand of destruction.  Then he followed up with a barrage of powerful magic bombs.  It was supposed to destroy the hand, but of course, the hand of destruction completely extinguished the attack.</span></p><br/><p><span>[What······!?]</span></p><br/><p><span>“This is odd.  It is the first time I’ve heard this voice, but his manner of speech is quite familiar…...”</span></p><br/><p><span>“It is also annoying.”</span></p><br/><p><span>Artpe’s party members felt a weird sense of de ja vu as they raised their weapons.  Artpe knew they were in a desperate situation, yet the couldn’t suppress his laughter.  His Read All Creation ability had already picked up on the presence of his enemy.</span></p><br/><p><span>Maybe, the Demon was confident no one could pierce through his stealth magic.  He continued to be in a defenseless position.  Of course, his stealth magic was so great that it couldn’t be penetrated unless one had the Read All Creation ability…..</span></p><br/><p><span>[Etna.]</span></p><br/><p><span>[Yes, he really is annoying in my opinion.]</span></p><br/><p><span>Etna was sharing his Read All Creation ability, so she caught sight of the enemy.  He was making every effort to destroy the hand of destruction with his magic, but the hand was blocking all his attempts.  She could see that he was growing angry.</span></p><br/><p><span>[We have to give up on the idea that we can kill him outright.  Before he picks up on it, we have to focus on dealing as much damage to his body.  He is a master that knows our magic better than anyone else.]</span></p><br/><p><span>[How do you know this….?  Never mind.  I understand.  I have to minimize my use of my magic, and I have to deal a fatal blow?]</span></p><br/><p><span>However, their foe was too far for him to leave the battle to the close range fighters of his party.  Unfortunately, Mycenae was still lacking in terms of damage when it came to single burst attacks.</span></p><br/><p><span>This was why the task fell onto Etna.  Etna was the only one in the party that dealt with magic that wasn’t truly magic.</span></p><br/><p><span>[Alright.  I’ll show you how it is done.]</span></p><br/><p><span>Etna activated her Innate ability.  If it was a simple spell, it would have been detected by her opponent.  However, her Innate ability was Spirit Transformation.  It was an ability that hadn’t existed hundreds of years ago when the previous Demon King and the previous hero had run amok.</span></p><br/><p><span>“At the very least, I’ll take one arm!”</span></p><br/><p><span>[Koo-huhk?]</span></p><br/><p><span>This was why the Demon Nanarai Bodra couldn’t respond to the suddenly surging white flame.  Etna had transformed into a Fire Spirit.  As soon as he saw her, he immediately created a barrier.  However, Etna had kept her words.  She had already burned away his entire arm!</span></p><br/><p><span>[Koohk, koo-ha-ahhhhhhhhhhhhh!]</span></p><br/><p><span>He hadn’t felt pain for a very long time.  The Demon screamed as he grabbed his shoulder.  Artpe spoke as he watched the face, which had been distorted by pain.  There was a cold smile on his lips.</span></p><br/><p><span>“I believe this is the first time we’ve met directly, sunbae-nim.”</span></p><br/><p><span>“Sunbae-nim······?  Huh?”</span></p><br/><p><span>The rest of the party finally realized what had caused that sense of incongruity.  From the moment he had appeared, the Demon had spoken like a know it all asshole.  He was Nanarai Bodra.  He was the previous hero that had periodically helped Artpe’s party by leaving behind vestiges of his legacy.</span></p><br/><p><span>There was distinct pattern to his Demonic energy, and he had overwhelming power.  He also possessed an overwhelming presence and level.  He had reached an absurdly high level of 403. </span></p><br/><p><span>Finally, the name that was being shown through Artpe’s eyes proved his identity.</span></p><br/><p><span>“Why······?”</span></p><br/><p><span>“Why is he attacking us?  Does he have dementia?  Does he not know that we are heroes?”</span></p><br/><p><span>“No, he knows it. ”</span></p><br/><p><span>Artpe looked at the enraged Demon, who was pointing his remaining arm towards them.</span></p><br/><p><span>“However, everything else within his head might have rotted away.”</span></p><br/><p><span>[A party of two heroes….  It is quite the familiar sight.  It also makes me yearn for the good old days.  I also fought for the humans once.]</span></p><br/><p><span>Artpe let out a bitter laughter as he spoke.</span></p><br/><p><span>“It isn’t too late to return to our side.”</span></p><br/><p><span>[It is too late, young hero.  My juniors….   Do you know about the weight of time?  Do you know about the weight of death? I’ve spent too long a time as a Demon, and I am too used to it now.  The Demonic energy stole many things from me, but as a price, it breathed in new desires within me.]</span></p><br/><p><span>At the old former hero’s words, Artpe snorted.</span></p><br/><p><span>“You and your party had enough power to kill the previous Demon King.  Despite that fact, you chose to seal the previous Demon King.  Am I wrong?”</span></p><br/><p><span>[No.  At the time, our party didn’t have the power to kill the Demon King.  We could only seal the Demon King.]</span></p><br/><p><span>“You might have been able to convince your party members, but your lies won’t work on me.  I know that your ability is more geared towards attacking rather than sealing.  Why did you do it?  You don’t like using your sealing ability since it is mundane.  You prefer to use flashy attacks.  Am I right?”</span></p><br/><p><span>Artpe approached it from an angle that was unimaginable to a normal person.  Nanaria Bodra flinched at Artpe’s words, and he took a step backwards.</span></p><br/><p><span>[H….how did you know….]</span></p><br/><p><span>“Ah.  This asshole is an idiot.”</span></p><br/><p><span>“I see.  He really is an idiot.”</span></p><br/><p><span>Artpe didn’t give him time to respond.  He pushed ahead.</span></p><br/><p><span>[I wondered why you sealed the Demon King instead of killing him.  The reason was quite simple.  At that point, you were already drawn towards the Demonic energy.  You were drawn towards becoming a Demon.  You said you turned yourself into a Demon, and that it was for research.  You planned on searching for a way to turn the Demonic energy back into Mana.  However, you were merely trying to make an excuse.  You tricked yourself into accepting your true nature.”</span></p><br/><p><span>[······.]</span></p><br/><p><span>He was silent for a brief moment before he opened his mouth.</span></p><br/><p><span>[It is truly a great deductive reasoning.  Unfortunately, you are wrong, my junior.]</span></p><br/><p><span>“I’m wrong?”</span></p><br/><p><span>His eyes let out a bright light.  Demonic energy overflowed as it strengthened his old body.  If Etna hadn’t destroyed one arm, he might have been able to push the hero’s party.  That was how fierce his power was!  As he raised his fighting spirit, he yelled out!</span></p><br/><p><span>[The reason why I sealed her is simple.  I was in love with her!  I sealed her, and I dedicated my whole life in finding a way to revert her back into being a human.  I was able to meet her again when the world was rewound.  My way of thinking had been wrong from the start.  The ones that were in the right were the Demons!]</span></p><br/><p><span>“······.”</span></p><br/><p><span>Artpe was struck dumb.  He quietly nodded his head.  The previous Demon King was a woman.  It was a good information to know.</span></p><br/><p><span>The story he had heard from the Elven elders from the Forest of Eternity came to mind.  The previous hero had hit on many Elven women, so this explanation was very direct.  Maybe, that story was foreshadowing this moment.  It was an entirely believable explanation.</span></p><br/><p><span>“He’s an idiot that can’t be cured.”</span></p><br/><p><span>“Yes, let’s kill him.”</span></p><br/><p><span>Everyone was in agreement.  Nanarai Bodra was Maetel’s ancestor, and at the same time, he had a big influence in allowing Artpe’s party to grow so much.  This was why they had decided to listen to his story a little bit more.  However, they had found out that Nanarai Bodra didn’t know his ass from his forehead.</span></p><br/><p><span>Moreover, Artpe suspected this when Nanarai Bodra had shown up as an ally to the previous Demon King.  It seemed he had lost a significant portion of his memories throughout the long years.  If he hadn’t, he would have know about the power of the ruins he had created.  He would have recovered the three Evil Hearts that he had put in safekeeping.</span></p><br/><p><span>‘He is unstable.’</span></p><br/><p><span>The magic that turned humans into Demons wasn’t complete.  This was quite evident.  If it was complete, the previous Demon King’s faction wouldn’t be having such a difficult time turning humans into Demon after being released from their seal.  This also applied to Nanarai Bodra.</span></p><br/><p><span>[I realized what the correct path was.  Demonic energy isn't a twisted form of Mana.  It is an evolved form of Mana, and it is the future we should strive for.  I’ve been rejecting the existence of Demons all my life.  She fixed my way of thinking.  The existence of the Demonic god gives legitimacy to the Demonic energy.  It is superior to Mana!]</span></p><br/><p><span>The bastard was completely twisted in the mind.  At the very least, he had wanted to pay his respects to his sunbae, who had walked a much higher road in magic.  However, that ship had sailed.  Nanarai Bodra didn’t care about the Demonic energy or Mana.  He only cared about power and fear.  Once he started worshipping the Demonic god, his career as a mage had come to an end.</span></p><br/><p><span>Artpe was cold as he gave his orders.</span></p><br/><p><span>“Etna, you’ll be the main one to attack.  I’ll focus on weakening them.”</span></p><br/><p><span>“What about me, Artpe?”</span></p><br/><p><span>“You can take on the remaining group. Regina, may you protect the party?”</span></p><br/><p><span>Artpe didn’t need to say anything further.  They knew what to do.  The party’s expression hardened all at once.  Sine Nanarai Bodra had come out, there was only one person left that had yet to make an appearance!</span></p><br/><p><span>[You are a quite the sensible kid.  You are different from the previous hero.  Moreover, you are cute.]</span></p><br/><p><span>A slightly sweet voice could be heard from somewhere.  Nanarai Bodra’s face glowed as he looked up.  Artpe gritted his teeth.</span></p><br/><p><span>“······if you lay your hands on Artpe, I’ll kill you.”</span></p><br/><p><span>“No, she just threw those words out there instead of greeting us.  Don’t be baited by her, Maetel”</span></p><br/><p><span>[Hoo hoo.  As expected, this is fun.  The twisted hero and the two heroes….  This is the best stage that I can offer him.]</span></p><br/><p><span>Artpe let lout a low sigh as he raised his head.</span></p><br/><p><span>He saw a blindingly beautiful woman with black hair.  The previous Demon King made her appearance.</span></p><br/>\n</div>"}