{"title": "Chapter 195 - Fragment of the Demonic God (3)", "id": 195, "volume": 2, "url": "http://boxnovel.org/i-reincarnated-for-nothing-chapter-195-fragment-of-the-demonic-god-3", "volume_title": "Volume 2", "body": "<h1>Chapter 195 - Fragment of the Demonic God (3)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 195 - Fragment of the Demonic God (3)</p><br/><p><span>It was like watching a god create something.</span></p><br/><p><span>The Mana was gathered in the air, and a bright light covered it.  It slowly started to take on a concrete form.  The Demonic god’s hand could feel the holy power within it, so it let out a scream.  Its fingers clawed at the air, but it couldn’t reach the light.  To be precise, the light became ridiculously intense when the hand got close to the light.  It burned the fingers of the Demonic god’s hand.</span></p><br/><p><span>“Artpe!?”</span></p><br/><p><span>“Arm······ Hurry up and get rid of it!”</span></p><br/><p><span>Artpe had to concentrate on his spell, so he couldn’t give detailed orders to his party.  Sienna and Maetel did as he said.  They frantically swung their bastard sword and hammer as they attacked the fallen arm of the Demonic god.</span></p><br/><p><span>The Demonic god’s hand twitched every time the arm was attacked.  However, it must have decided that stopping Artpe from creating the light was a more urgent matter.  At this point, Regina and Etna could guess at the identity of Artpe’s magic.  They just stood there as they stared at him in a dumbfounded manner.</span></p><br/><p><span>“Artpe, you….  How….?”</span></p><br/><p><span>“Etna, give me your Mana!”</span></p><br/><p><span>“Y...yes!”</span></p><br/><p><span>There was an urgency in his voice.  Etna forgot that she had to provide her Mana through Maetel.  She let out out her Mana as is, but it was enough.  In the past, Artpe and Maetel was able to use an Innate ability called Mana Link to share each other’s Mana.  The underlying reason for being able to do this was the fact that they were both heroes.  For some reason, the same Mana Link had appeared between Artpe and Etna.</span></p><br/><p><span>In the end, the pool of light exploded.</span></p><br/><p><span>“Kyahhhhhhhhhhk!”</span></p><br/><p><span>“W...was it a failure?”</span></p><br/><p><span>“No.”</span></p><br/><p><span>The space around them was filled will light.  The Demonic god’s hand and arm froze in place.  Of course, Artpe’s party also stopped moving for a brief moment.  Etna knew that Artpe had been attempting something outrageous, so she let out a gasp of distress.  However, Artpe was firm as he shook his head from side to side.</span></p><br/><p><span>“It was a success.”</span></p><br/><p><span>[Kyaa-ha-ahhhhhhhhhhhhhhhhhh!]</span></p><br/><p><span>The Demonic god’s hand let out a roar.  It was in rage, and it was about to charge towards Artpe.  In the next moment, something suddenly grabbed the hand.</span></p><br/><p><span>An enormous white hand had emerged from the exploding pool of light.</span></p><br/><p><span>“You really made it······.”</span></p><br/><p><span>“Cheat.  Artpe is a cheat.”</span></p><br/><p><span>“Hoo-ooh······  Hoohp.”</span></p><br/><p><span>Etna and Regina looked on with wide eyes as they mumbled to themselves.  Artpe had depleted all his energy, and he was about to fall over.  He was barely able to keep himself upright.  Etna instantly recognized this fact.  She quickly moved up to his side, and she helped him stay upright.</span></p><br/><p><span>“Are you able to control it?”</span></p><br/><p><span>“Just hold onto me like this.”</span></p><br/><p><span>“Y..yes.”</span></p><br/><p><span>Etna heard the tired voice of Artpe, and she instantly felt her heart quicken.  She inwardly asked for forgiveness for having such wayward thoughts, and she continued to support Artpe. Artpe was oblivious to the fact that Etna was having such shameful thoughts about him.  He started to control the white hand in earnest.</span></p><br/><p><span>He was controlling it, yet he was no longer consuming any Mana.  The spell was already complete.  The only thing left was to deliver his will to the hand.  He had to order it as its rightful owner.</span></p><br/><p><span>[Koo-goo-ga-ga-ga-ga-ahhhhhhhhh!]</span></p><br/><p><span>He ordered it to drive out the rotten Demonic energy!</span></p><br/><p><span>The white hand started to push back against the hand of the Demonic god.  The hand of the Demonic god tried to use its Innate ability to destroy the white hand, but the power possessed by white hand neutralized the power of destruction.</span></p><br/><p><span>In fact, the hand of the Demonic god was being pushed backwards as time passed.  This was happening, because Maetel and Sienna was destroying the arm of the Demonic god.  They were destroying the source of the Demonic energy.</span></p><br/><p><span>“You really copied its Innate ability······.”</span></p><br/><p><span>“I learned a concept, and I materialized it.  I was dubious as to whether it would work.”</span></p><br/><p><span>Artpe’s explanation was simple, but it sounded preposterous to those that heard it.  He was able to see an Innate ability as a concept, and he was able to learn it.  First, one needed the Read All Creation ability to do this.  Even if Artpe was able to learn it, there was the problem of Materializing it.  Basically, this was something only Artpe could do.</span></p><br/><p><span>“As expected, I think I’m the main character.”</span></p><br/><p><span>“Don’t say such nonsense with a straight face.”</span></p><br/><p><span>“I think I understand what the Demon King was talking about…....”</span></p><br/><p><span>The Demon King was well acquainted with Artpe’s Read All Creation ability.  In Artpe’s lifetime, the Demon King had been most jealous of his ability.  This was why the Demon King wanted Artpe to experience facing a part of the Demonic god.  The Demon King had a hunch that such an incident would help raise up Artpe.</span></p><br/><p><span>‘That damned chef······.’</span></p><br/><p><span>It really was frustrating, but in the end, the Demon King had finished his recipe.  It was perfect He had to acknowledge that fact.</span></p><br/><p><span>“Nyaa-ah!”</span></p><br/><p><span>Roa had been sucking up the Demonic energy up until now.  She finally stepped forward after it was confirmed that the Demonic god’s hand was being held in place by the hand made by Artpe.  She quickly closed the distance.  She bit the end of the Demonic god’s arm, which was being assaulted by Maetel and Sienna.</span></p><br/><p><span>“Nyaa-ah-ah-ahhhh!”</span></p><br/><p><span>She started to absorb its power with all her might!</span></p><br/><p><span>[Kyahhhhhhhh!  Koo-ga-ga-ga-ga-koo-koo-koo-koo-ka-ga-ga-gahk!]</span></p><br/><p><span>Its scream suddenly became ragged.  This wasn’t a simple attack where it was being destroyed.  It was being eaten!  The sensation was entirely different!  However, the arm didn’t have any offensive capability.  It could do nothing.</span></p><br/><p><span>“Maetel!  Sienna!  You can attack the hand now!”</span></p><br/><p><span>“Nyaa-ah!  I can eat all of this, nyaa-ah-ah!”</span></p><br/><p><span>Roa kept biting into the arm.  Roa looked the happiest when she was eating.  Maetel and Sienna attacked the hand of the Demonic god.  All of its attack and ability was focused on the white hand, so it was easier for them to attack the hand.</span></p><br/><p><span>[Kyaa-ha!  Kyah-goo-goo-ga-ga-ga!  Kee-heeeeee!]</span></p><br/><p><span>“Keep pushing!  We can’t give it any time to do something else!”</span></p><br/><p><span>He was giving those orders to Maetel and Sienna, but he was also making assurances to himself.  It was as if the white hand had a consciousness.  At Artpe’s words, it grew in size, and it started to attack the other hand more fiercely.  It started to push the Demonic god’s hand with its own perfected destructive ability.  It looked as if the god of the heavens was directly punishing the Demonic god.</span></p><br/><p><span>“It should feel familiar.  I added Sienna’s Mana and the power of the Hero’s Flash on top of the holy energy.”</span></p><br/><p><span>“You are able to tie all of those power into one······?”</span></p><br/><p><span>At this point, she gave up on being surprised.  The god’s hand was born through a miracle.  Etna made a fervent wish that it wouldn’t disappear before it defeated the Demonic god’s hand.</span></p><br/><p><span>How long did this persist?</span></p><br/><p><span>At some point, the Demonic god’s hand noticeably started to move slower.   The Demonic god’s arm was no longer in existence.  The black arm with the stump had been around 10 meters long, yet Roa had eaten it all.</span></p><br/><p><span>“Nyaa-ah.  Main dish.”</span></p><br/><p><span>Roa disregarded her swollen up stomach as she balled up her fists.</span></p><br/><p><span>“I can’t fall over before I eat that thing  Nyaa-ah.”</span></p><br/><p><span>“Go, cat-piggy!  Eat it all!”</span></p><br/><p><span>“Nyaa-ahhhhhhhh!”</span></p><br/><p><span>[Koo-ga-ga-ga-ga-gahk-ga-ga-ga-ga-gahk!]</span></p><br/><p><span>As the predator got nearer, the Demonic god’s hand used up its remaining reservoir of power for its last struggle.  Artpe firmly nodded his head as he used another spell.  The Demonic god’s power, which had spread into the surrounding, started to thin out.  Etna was by his side, so she immediately realized what he was doing.</span></p><br/><p><span>“You added the power of the Reclamation magic to it.”</span></p><br/><p><span>“Correct.”</span></p><br/><p><span>The staff had finished its task.  It slowly descended from the air, and it returned to Artpe’s possession.  The resonance between the staff and Artpe had ended.  The magic tome was still letting out a faint light, and he had focused its power into the white hand.</span></p><br/><p><span>[Koo-ha······  Kee-goo-goohk······  Goo-goo-ga-ga-gahk······!]</span></p><br/><p><span>“Nyaa······  Nyaa-ahhhhhhhhhh!”</span></p><br/><p><span>Roa bit the finger of the Demonic god.  The large finger let out an enormous amount of Demonic energy as it tried to dislodge Roa.  However, Roa remained unaffected.  Roa was trying to eat as much Demonic energy before the hand’s Demonic energy was converted to Mana through the Reclamation magic.  She ramped up her attack</span></p><br/><p><span>“This is the end!”</span></p><br/><p><span>“Hoo-ahhhhhhhhhhp!”</span></p><br/><p><span>Maetel brought down her bastard sword, and she severed two fingers.  Roa immediately swallowed up the fingers.  Sienna brought down fierce hammer strikes, so the hand couldn’t resist any further.</span></p><br/><p><span>“Nyaa-ah, nyaa-ahhhhhhhhh!”</span></p><br/><p><span>Roa opened her mouth wide.  An incredible amount of suction pulled the entire hand into her.  She swallowed everything.</span></p><br/><p><span>“Ggoo-oohk.  I ate it all.  Nyaa-ah-ah.”</span></p><br/><p><span>She had an extremely satisfied expression on her face as she stretched out on the floor of the cave.  Afterwards, every member of Artpe’s party felt an extreme headache.  They had defeated a Record from a foreign dimension that shouldn’t have been here in the first place.  After they received the Achievement from defeating the foreign entity, Artpe’s party was able to grow.  As always, the process was painful.</span></p><br/><p><span>“Ggoo-ooooooh······  Shit!   We don’t have the luxury of being able to sit here and work through this pain!  The cave is collapsing!”</span></p><br/><p><span>“End the link!  This will be painful, but everyone has to get up!”</span></p><br/><p><span>“Artpe!  Gather around Artpe!  Hurry!”</span></p><br/><p><span>Artpe was in a desperate situation, yet he continued to move his hands as he gathered all the loot.  There were some items left behind by the Demon King, but he didn’t have the time to examine them!  He just gathered everything!</span></p><br/><p><span>“Everyone is gathered.  Let’s go!  Blink!”</span></p><br/><p><span>They were quite fortunate in the fact that none of them had died after the hard fought battles.  After defeating the Demon King, they had to fight the fragment of the Demonic god.  The fights had pretty much wrecked the cave, and it was collapsing on itself.  At this point, the party was spent physically and mentally.  The enormous level ups couldn’t heal their tired souls.</span></p><br/><p><span>Anyways, they had somehow won.</span></p><br/><p><span>They had survived.</span></p><br/><p><span>When the party recovered their senses, they were in the middle of the Demon realm.  The nearby region was packed with Demons.</span></p><br/><p><span>“W...what the hell is this?”</span></p><br/><p><span>“Ah.  I see.  The Demon King had used his full power, and the fragment of the Demonic god had appeared in this place.  Of course, the Demons would react to such an event.”</span></p><br/><p><span>It had been the mother of all aggro.  Pretty much all the Demons left in the Demon realm had gathered at this location.  If given a little more time, the Demonic beasts and even some of the Demons that were in the human realm might be drawn to this place.</span></p><br/><p><span>The most important thing right now was the previous Demon King.  The previous Demon King probably felt the death of the current Demon King.  It would be obvious as to who the culprits were.  The previous Demon King would probably stop his conquest of the human realm.  It was obvious as to who would be the biggest stumbling block to his Demonification of the human realm would be.</span></p><br/><p><span>Suddenly, Sienna tilted her head in puzzlement.  There were countless Demons around them, but they weren’t acknowledging the presence of Artpe’s party.</span></p><br/><p><span>“Huh? Why can’t they see us?”</span></p><br/><p><span>“I’m using Assimilation right now.”</span></p><br/><p><span>The one to answer Sienna was Aria.  She was still suffering under the aftereffects of the level ups.  Despite her pain, she had protected her party members with her Innate ability.  She had been able to increase the range of her Assimilation ability.  She was able to include her party members now.   It really brought home the fact that she had developed into a fantastic party member.</span></p><br/><p><span>“Aria, amazing….”</span></p><br/><p><span>“Let’s move to a safe place.  We have to carry out our plan in haste, but we desperately need to rest right now.”</span></p><br/><p><span>Everyone nodded their heads at Artpe’s words.  He inwardly nodded his head as he observed his party members.</span></p><br/><p><span>He thought it was time for him to tell his party members everything about himself.</span></p><br/>\n</div>"}