{"title": "010 – I Came To Understand Various Things", "id": 16, "volume": 1, "url": "http://boxnovel.org/i-have-been-reincarnated-010-%E2%80%93-i-came-to-understand-various-things", "volume_title": "Volume 1", "body": "<h1>010 – I Came To Understand Various Things</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>010 – I Came To Understand Various Things</p><br/><p>Posted on June 26, 2016 by crazypumkin</p><br/><p>Editor: Poor_Hero kun and Lazaruz22</p><br/><p>TN: YAY. I finally reached 10 chapters! Oh yes, as many were commenting about wanting to see how Shou looks like, I created a character file at the end of the chapters page. Images are all from the manga, have fun looking~</p><br/><p>AN: Will is turning 1 soon. Right now he is at the stage of standing and grabbing.</p><br/><p>A few months had passed since I could lift my head up. Just a little more to go before I turned 1 year old. I learned to stand and could now use my hands to grab stuff. I also came to know more about this world. For example, this world did not have a name. Thinking about it, it was not all that weird. My previous world was named ‘Earth’ but that was actually the name of a planet, and not the actual name of the world.</p><br/><p>Meh, all that I learned were all from the books I could read anyway.</p><br/><p>For one, there was magic in this world!</p><br/><p>Yep. I had thought the story in the Picture Book was ridiculous but it turned out to be a rather famous fairy tale. In short, magic existed in this world and everyone could use it! Although talent was another thing.</p><br/><p>My excitement just soared through the roof when I learned about it. I was sure anyone would agree with me feeling like shouting ‘HERE IT IS!!! ‘.</p><br/><p>And so, from today, I would be experimenting. Even though the maids were going to run around looking for me, who had escaped from the crib [TN: Original text is futon], but I didn’t care! I had a huge task ahead of me now!</p><br/><p>” Alrighty! ”</p><br/><p>Sitting in the library alone, I felt my excitement rising as I held a book in my hand. [TN: Counteraction raising! We say WOW WOW WOW WOOOW.]</p><br/><p>『Magic That Even Monkeys Understand Elementary』</p><br/><p>What a title. You didn’t know if the author was trying to make a pun or not. It was really amazing that this book, with a title that treated people like idiots, was the compression of the eternal dreams Earthlings ever had. Excited, I opened the book and began to slowly, carefully read it.</p><br/><p>” Yep,yeup. ”</p><br/><p>That was not me fumbling with my words.</p><br/><p>『 The basics of Magic</p><br/><p>1. Let’s Sense Magic : Mana is all around you and in you.</p><br/><p>2. Let’s Manipulate Magic : If you can feel the mana, imagine it flowing. After getting used to it, try gathering it in your hand.</p><br/><p>3. Let’s try Using Magic : Mana and Incantations are needed. To know more about Incantations, please go to the next page ‘Chapter 2 : Incantations’! 』</p><br/><p>Yep, yep. How orthodox!</p><br/><p>This was really fantasy! I mean, it was word for word from the web novel I read!</p><br/><p>…The imagination of Earthlings was incredible.</p><br/><p>And so, I started to practice according to the book. As I had my previous memories, I had already grasped the meaning of point 1. This warm feeling inside and outside must be ‘Mana’.</p><br/><p>And erm…Next was to imagine the flow…</p><br/><p>It was like I grew a new organ. Kinda like ‘I grew a 6th toe!’. Anyway, even if the mana was drifting about, a part of me could still recognize it.</p><br/><p>Hm…hm..hmmmm…</p><br/><p>As I was having trouble with it, suddenly I felt like a nerve had been unlock and the Mana started moving.</p><br/><p>Yes, here it comes!</p><br/><p>This must be what they mean by feeling the flow. I felt like ClaXX from HeiXX, GiXX Of The Alps. This must be the same feeling as how XXare first being able to walk.</p><br/><p>[TN: Classic Japanese Anime, Hedi, Girl of the Alps.]</p><br/><p>” Mumumu… ”</p><br/><p>For the first time, I gathered Mana, which felt ticklish yet soft – a very unusual sensation, into my hand. The temperature of it was not hot, yet it felt warm. Was Mana something like life force? The warmth it produced felt like the life force, or part of it.</p><br/><p>I scattered the gathered Mana and turned to the next page.</p><br/><p>『 ~Chapter 2 : Incantations~</p><br/><p>To activate magic, either incantations or Magic formation is needed. Chantless incantation exists but that needs a freaking amount of Mana!</p><br/><p>And now, you would need to know your attribute. It’s important!</p><br/><p>As not to dry up your Mana, let’s remember the incantations.</p><br/><p>Magic formations is also written in this book, try it if you are free.</p><br/><p>But they are difficult to draw, and if you have the time to draw, saying them will be loads faster so incantations is recommended ☆ 』</p><br/><p>What was with this introduction? What a flippant attitude. I mean, ‘..recommended ☆’… My sight shifted down the page.</p><br/><p>…Eh?</p><br/><p>[]…?</p><br/><p>I started to doubt my eyes. The formation and incantation that were written was in Japanese no matter how you saw it. No, it could not be. I looked at the explanation.</p><br/><p>『 [ (Fire)] : Pronunciation ヒ (He) [TN: Japanese, Hi]</p><br/><p>To create fire. Depending on the amount of mana you use, the output will be different. Beginner = This! Let’s try doing it immediately! 』</p><br/><p>[TN: Harry Potter spells book this is not.]</p><br/><p>Yep, it was not my eyes. LOL Japanese. LOL Kanji.</p><br/><p>What was this double standards.</p><br/><p>I was stunned for a few seconds but bouncing back quick was one of the few good traits I possessed.</p><br/><p>I pulled myself together and started reading the detailed explanation.</p><br/><p>『 First, things to note before chanting! Everybody’s attribute is different. The basis is 1 attribute per person, if you have 2, let’s go, court’s level! For magic outside your attribute, if you find yourself unable to activate it even with incantations or it ends up shabby, don’t be disappointed! There is always the next time! Don’t go bluffing yourself that you got the incantation wrong. 』</p><br/><p>What was it with this tone? It was really annoying.</p><br/><p>Ooh, the basic attributes were Fire, Water, Earth, Wind…, and Light, Shadow, Air etc. There was even unidentified attributes. The research being done on that was freaking difficult so that was unrelated to monkeys.</p><br/><p>…Oi, author, what the heck were you doing. It was horrible how you treated readers like monkeys. Yes, I knew the title of your book was ‘Magic Even Monkeys Can Understand’. Even so!</p><br/><p>…Whatever. Let’s pull myself together and try doing it!</p><br/><p>Pretending to be cool, I did a meaningless cough. I then stretched out my hand and started to gather mana the size of a ping-pong ball.</p><br/><p>” [Fire] ”</p><br/><p>I chanted, looking at the ball of mana. With a ‘Pong!’, a fireball the size of a ping-pong ball appeared in the air.</p><br/><p>Here it is!!!!!!!!</p><br/><p>Congratulations!! Thank you!!</p><br/><p>I could use magic!</p><br/><p>In my excitement, the fireball began to fall. …Oops, how dangerous…</p><br/><p>Calming myself, I began analyzing. First of all, it looked like my attribute was Fire. I was relieved. I did think about me failing to use magic. Come to think of it, all of the novels I read talked about the importance of imagination.</p><br/><p>” [Fire] ”</p><br/><p>Once again, I gathered mana the size of a ping-pong ball in my hands, using imagination as I chanted. Then, a loud ‘poof!’ and a fireball the size of a volley ball appeared!</p><br/><p>” Wah! ”</p><br/><p>Shocked, I extinguished the fire ball. Because, this body of mine was still at the level of a 1 year old! Holding a fireball the size of a volley ball was too close to my face!</p><br/><p>But as I thought, imagination was important. Coming to understand that, I gathered mana in the air instead of my hand this time round. Which reminded me, if I added oxygen carefully, would the flame turn blue? Let’s try. I imagined a gas burner as I chanted and as I thought, a blue flamed fireball appeared.</p><br/><p>” Awesome! ”</p><br/><p>I exclaimed unintentionally. Yep, I did not fumble with my words. I began to wonder if the fireball could be moved and I tried moving it.</p><br/><p>It looked like the haunted houses in a theme park ♪</p><br/><p>As I was having fun experimenting, time was ticking away. It was about time to return to my room or people were really going to get worried. I looked outside the window and checked the position of the sun. It was time for lunch~ Lunch~♪</p><br/><p>But I got caught up in the moment and made a dragon shaped fireball. Please don’t say anything chuunibyo like a fire dragon!</p><br/><p>I opened the door a little to check if anyone was in the corridor before I went out of the library. Ah, even if I called it a library, it was just one of the rooms in the house. Mah, it did have bookshelves that reached all the way to the ceiling.</p><br/><p>After this I would not need to sneak out of my room for a while. I could just train in my room!</p><br/><p>◆</p><br/><p>” My, Will! Where so you keep disappearing off to~! ”</p><br/><p>Mother was there when I returned. In the room next to the bedroom.</p><br/><p>” Really…Being so alike to that person in places you really do not need to. ”</p><br/><p>Mother said, sighing while sporting a happy look. That pierced deep into my heart. I knew…I had this plain-looking face…but to say that to a 1 year old…</p><br/><p>” Mather. ”</p><br/><p>I said, trying to lift myself up.</p><br/><p>” Yes, Will? ”</p><br/><p>” Can chu use machic? ”</p><br/><p>I sounded awkward and like an idiot but I was trying! Seeing that I was 1 year old please give some leeway!</p><br/><p>” Oh my, why all of a sudden? ”</p><br/><p>Mother was a little shocked at the question.</p><br/><p>” Becasue, it is witten in the pictchu book. ”</p><br/><p>Whatever worked.</p><br/><p>” Arara, it is because of that you went out? ”</p><br/><p>Mother crouched down, looking amused.</p><br/><p>….Damn it, my mother was gorgeous. Trying to hide my feelings, I nodded.</p><br/><p>” Is that so? That is my Will! ”</p><br/><p>Mother stroked my head delightfully. Even though this inner me was a high schooler who felt a little embarrassed, it felt really pleasant so I had a silly smile on.</p><br/><p>” Haha. ”</p><br/><p>Laughing to hide my embarrassment, Mother lifted her hand that stroked me.</p><br/><p>” [Water]! ”</p><br/><p>She chanted. Why all of a sudden?!</p><br/><p>” Wahhhhh! ”</p><br/><p>I cried, emotional. Let’s move aside the fact that Mother always did things suddenly.</p><br/><p>Rather than that, it was beautiful. The water produced from magic, was floating in the air.</p><br/><p>” It is too soon to be surprised. ”</p><br/><p>Mother laughed as she looked at me.</p><br/><p>” Your father is so much better. ”</p><br/><p>Eh…for real?</p><br/><p>◆◆◆</p><br/><p>AN: It is difficult to not make it cheat-like… Ganbarimasu.</p><br/><p>TN: And now sleep. Otherwise I can’t get up for work tomorrow.</p><br/>\n</div>"}