{"title": "023 – It’s Good I’m Betrayed (First Part – John POV)", "id": 29, "volume": 1, "url": "http://boxnovel.org/i-have-been-reincarnated-023-%E2%80%93-it%E2%80%99s-good-i%E2%80%99m-betrayed-first-part-%E2%80%93-john-pov", "volume_title": "Volume 1", "body": "<h1>023 – It’s Good I’m Betrayed (First Part – John POV)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>023 – It’s Good I’m Betrayed (First Part – John POV)</p><br/><p>Posted on July 25, 2016 by crazypumkin</p><br/><p>Editor : Poor_Hero and Lazaruz22</p><br/><p>AN: John San is a person who cannot be frank but he is still an honest fellow.</p><br/><p>As I walked into William-sama’s room, apart from the thick table that exuded a composed and dignified aura, the whole room felt bright and airy.</p><br/><p>” Ah, Mary-san, thank you. ”</p><br/><p>William-sama gave his thanks for the tea brought by a woman who seemed to be a maid. For the time being, he was as expected, a polite and level-headed person.</p><br/><p>” ……. ”</p><br/><p>” ………. ”</p><br/><p>But I was troubled.</p><br/><p>Even if this was my wish, I could not seem to find any word to start a conversation. Besides, I found myself much more nervous than I thought I would be that I froze.</p><br/><p>It should be me, the elder, to break the ice. And even if I had thought of various things, my mind went blank ever since I came in.</p><br/><p>” …Erm… ”</p><br/><p>William-sama said, timidly.</p><br/><p>What a disgrace, showing such a (frozen) face. Perhaps, I might be seen as glaring at him.</p><br/><p>” Ah, I am sorry. ”</p><br/><p>Embarrassed, I coughed.</p><br/><p>This time, I made sure to focus on William-sama before I opened my mouth.</p><br/><p>….Relax, relax.</p><br/><p>” I unknowingly got nervous. As you know, I am John Veltor, and I will be working as your tutor from today onward. ”</p><br/><p>Trying to avoid a scary impression, I carefully paid attention to my words as I introduced myself. And then, William-sama returned with a graceful greeting.</p><br/><p>” Yes, I will be in your care. I am Williams Beryl, please call me Will. ”</p><br/><p>At the birthday debut, I did think about the possibility that he had memorized that speech. I still found it difficult to believe that a 3 years old kid could talk like that.</p><br/><p>But, once I came here, I was convinced.</p><br/><p>Yes, it was William-sama who prepared that speech. It was too shocking.</p><br/><p>” Erm, what should I call Veltor-sama? ”</p><br/><p>As I was called out, my attention snapped back.</p><br/><p>This was getting interesting, I could not help but give in to my mischievous side.</p><br/><p>” You can call me however you prefer. Only… ”</p><br/><p>Well then, how would this young genius react to this? As I was thinking about that, I instinctively smiled.</p><br/><p>” ..not Veltor please. ”</p><br/><p>I had thrown my family name away.</p><br/><p>Since I, who was born into the problematic Veltor house, was to undertake the position of an educator role, I wanted to, at least relay this to Williams-sama and of course, Gion-sama.</p><br/><p>And above all, how he would react upon understanding my words. I did feel sorry for testing him but most of all, I was amused.</p><br/><p>William-sama immediately gave a smile and replied.</p><br/><p>” Then, John-sensei! Would that be all right? ”</p><br/><p>The reply, that was more than what I expected, was slightly jaw-dropping.’</p><br/><p>…..I could only say that he was indeed a genius.</p><br/><p>It was a reply that he understood that I was uninterested in power, house name or currying favor just by my words alone.</p><br/><p>” Yes please, I look forward to working with you. ”</p><br/><p>With no relations to with my family, he narrowed the relation down to a personal level by simply using my name and attaching ‘Sensei’ to it. Wonderful. It was wonderful how he exceeded my expectations.</p><br/><p>To be able to teach this person, I was glad I left my house. I might be a fortunate person.</p><br/><p>Unconsciously, I began talking, being in a good mood.</p><br/><p>” By the way, Will-sama. ”</p><br/><p>With that, Will showed a displeased face.</p><br/><p>” John-sensei, please stop with the ‘Sama’. ”</p><br/><p>What a humble attitude.</p><br/><p>To tell the truth, although Beryl and Veltor family sounded alike, they could not even be compared against.</p><br/><p>Veltor being a Viscount house, Beryl being a Duke house.</p><br/><p>In addition, the name of Veltor house was at the bottom. In comparison, Beryl house, in addition to Gion-sama’s activities and his good ruling with, had the reputation of being the best in the country. They were also a family that had a long standing history. Really, towards that person….I only had admiration.</p><br/><p>In the end, the relationship with me was not of noble standing but instead, a pure student and teacher one.</p><br/><p>” Then… Will-san ”</p><br/><p>” Will alone is fine. ”</p><br/><p>” …Eh…That is a bit… ”</p><br/><p>” It’s okay because you are my Sensei! ”</p><br/><p>As I thought.</p><br/><p>It was difficult to suppress my instinct to smile. Even if I tried to resist, he had insisted to call him Will with a compelling attitude. This made it very clear that we were a teacher and student.</p><br/><p>” Ah yes Sensei, what is the matter? ”</p><br/><p>Will said, as he remembered that I wanted to say something.</p><br/><p>” Ah. It’s just..If you don’t mind me asking, it is a little early for a 3 years old kid to have a tutor. I was wondering if you made this request or was it Sir Gion’s idea? ”</p><br/><p>Really, how did Gion-sama educate? I really could not imagine.</p><br/><p>But, Will smiled bitterly and answered.</p><br/><p>” No, it was me who requested. ”</p><br/><p>Ah, really, today, no matter how many hearts I had, they would not be enough.</p><br/><p>” It’s Will’s…? But why? I don’t mean to be rude but boys at your age usually only think about having fun. ”</p><br/><p>” I don’t know anything. I am proud seeing Father so needed (busy) but as for me, I can’t help with anything… ”</p><br/><p>I remembered that I was shocked by the mischievous tone Will had used.</p><br/><p>” …And I am frustrated with that. ”</p><br/><p>Really…..This person.</p><br/><p>Was a genius to the extent that you would be amazed.</p><br/><p>And I wondered if this was fate. I kept feeling that it was.</p><br/><p>” So that is why.. ”</p><br/><p>I had become the tutor of this person.</p><br/><p>With the ability I had, I wondered if it would be enough.</p><br/><p>” Well then, let’s study hard as soon as possible, shall we, Will? ”</p><br/>\n</div>"}