{"title": "016 – The Son of Beryl House (14 POV)", "id": 22, "volume": 1, "url": "http://boxnovel.org/i-have-been-reincarnated-016-%E2%80%93-the-son-of-beryl-house-14-pov", "volume_title": "Volume 1", "body": "<h1>016 – The Son of Beryl House (14 POV)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>016 – The Son of Beryl House (14 POV)</p><br/><p>Posted on July 4, 2016 by crazypumkin</p><br/><p>Editor : Poor_Hero and Lazaruz22</p><br/><p>TN: 4 more to go.</p><br/><p>Oh yes, the author uses 14 (jyu-yon) to call John as they sounded alike in Japanese. I find it amusing so I’m keeping it.</p><br/><p>AN: Introduction of a new character. As promised, a scholar.</p><br/><p>However, 85 likes!?</p><br/><p>The moment I saw that my eyes dropped onto the floor…</p><br/><p>I am too happy!</p><br/><p>Thank you!</p><br/><p>It will still be slow-tempo from now on so youroshiku onegaishimasu.</p><br/><p>Tonight, I was invited to the birthday party for the son of the famous Beryl’s house.</p><br/><p>The head of a distinguished family as well as the leader of the knights, Gion Sama. Well known of his intellect and also his strength, as was seen by the military. A person I greatly respected.</p><br/><p>My name is John Veltor.</p><br/><p>I was born in a mid-class noble house and was currently a scholar. Even if I said so myself, I thought I could be considered as clever. But my house could be said as rotten.</p><br/><p>My father was deplorable and my foolish brothers followed his footsteps. They squeezed tax money out of their subjects and spent it on pleasure. How shameless.</p><br/><p>As the 2nd son, I could do nothing. It was frustrating so to become someone who could stand up to that, I abandoned my house. Now, I was working hard as a scholar.</p><br/><p>Gion Sama, whom I respected. As rumors went, he imposed good governance across his territory and when I met him in person, I trembled at his wiseness. How could such a perfect person exist?</p><br/><p>……But….</p><br/><p>I often heard rumors about Beryl’s house’s child.</p><br/><p>That he was a genius.</p><br/><p>That he was a prodigy.</p><br/><p>Gion Sama said that too…It was unimaginable.</p><br/><p>He was a strict person for better or worst.</p><br/><p>But he was a parent after all.</p><br/><p>This was disappointing. I felt like going home.</p><br/><p>Possessing great intellect, was very reliable, that was why…</p><br/><p>The person standing on the stage talking, was that really Gion Sama?</p><br/><p>Certainly, standing in front of a crowd at only 3 years old was a little impressive but at most that meant his growth was faster then other children. [TN: You have no IDEA.]</p><br/><p>In the end, this was just fond parents showing off their child, I thought as I looked up at the stage.</p><br/><p>“”””” OOH! “”””</p><br/><p>The young child walked out from the curtains. And the event hall was filled with commotion.</p><br/><p>I too, unintentionally held my breath.</p><br/><p>…..It was like an angel had appeared. Soft silky silver hair, that ended a little below his ears, swayed along the wind, green transparent pupils that stared gently yet with focus, he walked out with an air of composure. All of his well-featured parts were perfectly arranged on his face, like a miracle.</p><br/><p>And most of all, the aura surrounding him.</p><br/><p>You would not think he was just 3 years old.</p><br/><p>His eyes, shining with intellect, faced the front.</p><br/><p>” As introduced, I am Williams-Beryl. Today is my birthday party for celebrating me becoming 3 years old and I am really grateful to all of you for accepting the invitation. I hope you can enjoy yourselves and hope you have a great chime. ”</p><br/><p>What in the world this was.</p><br/><p>That speech with no hesitation, you would not believe a 3 years old child said it. He was a genius…no, a prodigy. Now I finally understood what Gion Sama said.</p><br/><p>And then, he smiled gently.</p><br/><p>An ANGEL!!!!!!!!!!!!!!!</p><br/><p>A commotion stirred up again, Gion Sama said something but I could take nothing in now.</p><br/><p>Lighting had struck me.</p><br/><p>I wanted to talk to the child, Williams Sama, so badly that I could not stand it.</p><br/><p>◆◆◆</p><br/><p>AN: Well well, what will happen to him I wonder.</p><br/><p>It is about time for Will’s [cheat] to be seen by someone.</p><br/>\n</div>"}