{"title": "015 – Birthday! Debut! (Last Part)", "id": 21, "volume": 1, "url": "http://boxnovel.org/i-have-been-reincarnated-015-%E2%80%93-birthday-debut-last-part", "volume_title": "Volume 1", "body": "<h1>015 – Birthday! Debut! (Last Part)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>015 – Birthday! Debut! (Last Part)</p><br/><p>Posted on July 3, 2016 by crazypumkin</p><br/><p>Editor: Poor_Hero and Lazaruz22</p><br/><p>AN : Thanks for all your likes!</p><br/><p>I am hesitating if I should introduce a new character or not…</p><br/><p>And the slide in illustration for this…</p><br/><p>I’ll be very happy to receive any feedback.</p><br/><p>After the speech, my 3 years old body started to yearn for sleep so I was led by Mary San, as she held my hand, back into the bedroom. And I had totally no memory of getting changed…</p><br/><p>It was bright outside the window before I realized it. I must have slept through the entire night just like that.</p><br/><p>…What a disgrace…</p><br/><p>…How embarrassing…</p><br/><p>…It must be because the party was held at night. It could not be helped because I was only 3 years old! Yep, that’s right! I also did not fumble with my words yesterday because I was 3 years old. [TN: …You are really using your age to the fullest aren’t you?]</p><br/><p>I crawled to the edge of the bed, being careful not to wake my parents, who were sleeping besides me. Climbing down from the bed without making a sound was almost impossible for me at this point.</p><br/><p>Why? Wasn’t it obvious that it was because this bed was ridiculously big and high? I really felt like asking how many people it was planned for.</p><br/><p>After much effort, I finally got down from the bed and put on my shoes, which was beautifully lined up along with the others.</p><br/><p>…Man, it was really small…Every time I looked at my feet I would always be amazed by the smallness of it.</p><br/><p>Slowly, slowly.</p><br/><p>With stealthy steps, I headed towards the door connecting to the room next door. Turning the knob without making a sound, I opened the door.</p><br/><p>Yep, let’s change.</p><br/><p>I got out of my pajamas casually and took out from the closet a white shirt, black vest and black pants. I was worried that I would hate my clothes if they ended up being very noble-ish but it was unfounded. Their sense was actually quite good. Aside from the medieval style.</p><br/><p>The material, as expected as a Noble, was quite good. At first, I was really nervous about wearing it. What if I dirtied it? …But I got used to it now…</p><br/><p>” Yawn.. ”</p><br/><p>I sat on the sofa, yawning. As my legs could not reach the ground, I just swung them aimlessly.</p><br/><p>” Funfunfunfunfunfu~m ♪ ”</p><br/><p>It was not because I was looking forward to family party later on. The humming was because of… that. It was because I had nothing to do.</p><br/><p>This period where my parents were still asleep and the maids were busy with the housework was always my free time. I often used it to practice my magic.</p><br/><p>Chantlessly, I casted magic of all attributes and moved them about. It was really fun recently as my control got better. Let’s try hitting them like a game of billiards.</p><br/><p>Come to think of it…..</p><br/><p>And suddenly I thought of the blue Tanuki. That darkness attribute…looked like that. The novels I read had the same thing as well…</p><br/><p>Struck with an idea, I executed it immediately.</p><br/><p>First of all, I made a figure-like thing from earth magic.</p><br/><p>” [Subspace]~! ”</p><br/><p>With the blue Tanuki in mind, I tried chanting it slow as well as dragging the sound out…</p><br/><p>” Did it work…? ”</p><br/><p>For now, a black-like stuff appeared in front of my eyes. All right, let’s experiment with it.</p><br/><p>I placed the clay figure into it. The subspace disappeared. I cast it again.</p><br/><p>” I did it…! ”</p><br/><p>It worked! It seemed like I could put 1 clay figure into it. This time round, I made 10 figures at once and tried putting it in.</p><br/><p>It went it.</p><br/><p>YEAHHHHHHHH!!!</p><br/><p>I did it!!!!!!</p><br/><p>Overjoyed, I wiggled on the sofa. I continued like that for a while.</p><br/><p>….I got tired. So I relaxed myself on the sofa.</p><br/><p>With this, my Blue Tanuki plan took a step forward. As I sat there, bathing in my satisfaction, someone knocked on the door.</p><br/><p>” Come in. ”</p><br/><p>The door opened with a swish and Mary San entered. In her hands was her usual equipment for the morning, a broom, pail and a dust cloth.</p><br/><p>” Mary San, good morning. ”</p><br/><p>” Good morning, Young Master. ….Please call me if you are awake. Please let the maids dress you up. ”</p><br/><p>I was told by the other maids as well but honestly, with my previous memories this was too embarrassing.</p><br/><p>It was torture.</p><br/><p>” Eh…But you are all so busy in the morning, it just does not feel right. ”</p><br/><p>I said, using thoughtfulness as an excuse but…</p><br/><p>” This is our job or rather we are working because of Young Master so please do not worry about it. Please do not take our job away! ”</p><br/><p>And I was petitioned against.</p><br/><p>” Okay, then, from the next time onwards. ”</p><br/><p>I would not call though.</p><br/><p>I smiled, trying to push Mary San to agree. I was sly?</p><br/><p>Not at all! This was self-defense!</p><br/><p>The maids were scary! Plus, it was embarrassing!</p><br/><p>Smiling, Mary San began to clean the room. Actually, it was supposed to be done before I woke up but I woke up early today.</p><br/><p>….It’s not like I woke up because I was excited…</p><br/><p>Watching Mary San’s movement from the sofa, I started to feel drowsy and began to doze off.</p><br/><p>◆</p><br/><p>” …ster, Young Master. Preparations are ready. Let us go, Young Master. ”</p><br/><p>In the end, I fell asleep…</p><br/><p>Mary San woke me up, standing from across the sofa. I put on the shoes I didn’t remember kicking off, took Mary San’s hand and went out of the room.</p><br/><p>It was a secret that I was fidgety as I walked along the corridor.</p><br/><p>Like usual, Mary San opened the huge door leading to the dining room.</p><br/><p>“””” Happy Birthday! (Young Master) “”””</p><br/><p>Who were waiting there, were Father, Mother and the rest of the maids. They congratulated me all at once.</p><br/><p>” Thank you! ”</p><br/><p>I then decided, that today, to be the 3 years old I was, and leaped into my parents’ arms.</p><br/><p>I could feel the warmth of a family.</p><br/><p>◆◆◆</p><br/><p>Father : What Present would you like?</p><br/><p>Will : …Hmm…A book.</p><br/><p>Father : I see, a picture book! What kind do you like?</p><br/><p>Will : Not a picture book, a book. I want a dictionary.</p><br/><p>Father : ……</p><br/><p>Mother : ……I wonder what should I give.</p><br/><p>Will : I want to play with Mother!</p><br/><p>Mother : Ah ra, Will♪</p><br/><p>Father : ……</p><br/><p>TN : Sorry for this slightly late release, things have been hectic.</p><br/>\n</div>"}