{"title": "019 – It’s Good I’m Betrayed (Last Part)", "id": 25, "volume": 1, "url": "http://boxnovel.org/i-have-been-reincarnated-019-%E2%80%93-it%E2%80%99s-good-i%E2%80%99m-betrayed-last-part", "volume_title": "Volume 1", "body": "<h1>019 – It’s Good I’m Betrayed (Last Part)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>019 – It’s Good I’m Betrayed (Last Part)</p><br/><p>Posted on July 8, 2016 by crazypumkin</p><br/><p>Editor: Poor_Hero and Lazaruz22</p><br/><p>TN: 1 more. Do you guys want the author’s note? I am getting tired of it. Most of it is about how high her web novel is ranked at and how she cannot believe and how she thanks her readers.</p><br/><p>I think I’ll only translate it if there’s anything interest. So there.</p><br/><p>Right in the middle, a thick, huge table stood.</p><br/><p>On the wall across, a huge window.</p><br/><p>It gave the entire room a bright impression.</p><br/><p>This was the room I had just received.</p><br/><p>John and I were sitting opposite, facing each other at the table.</p><br/><p>” Ah, Mary San, thank you. ”</p><br/><p>Mary San made tea and as it was, left the room.</p><br/><p>” ……. ”</p><br/><p>” ……. ”</p><br/><p>How awkward.</p><br/><p>Somehow, John was making a stiff face as he looked at me, coupled that with his upturned eyes, he looked scary.</p><br/><p>” …Erm… ”</p><br/><p>When I spoke, he jumped and softened his nervous expression.</p><br/><p>” Ah, I am sorry. ”</p><br/><p>He smiled, embarrassed and looked straight at me.</p><br/><p>” I unknowingly got nervous. As you know, I am John Veltor, and I will be working as your tutor from today onward. ”</p><br/><p>Oh…A gentleman…</p><br/><p>Till now, he had defied all of my expectations. His soft manner, polite tone of speaking, none of it said ‘prideful wicked noble’.</p><br/><p>I put down my guard and relaxed my tensed body.</p><br/><p>….I was sorry for misunderstanding you.</p><br/><p>With that meaning in mind, I bowed my head.</p><br/><p>” Yes, I will be in your care. I am Williams Beryl, please call me Will. ”</p><br/><p>When I said that, John looked shocked.</p><br/><p>…Hm? Did I do anything weird?</p><br/><p>For the time being, I could not think of anything so I just continued.</p><br/><p>” Erm, what should I call Veltor Sama? ”</p><br/><p>And John’s shocked expression changed into a good humored smile.</p><br/><p>” You can call me however you prefer. Only… ”</p><br/><p>With that, he had a seemingly wry smile and a mischievous expression.</p><br/><p>” ..not Veltor please. ”</p><br/><p>Ah, I see.</p><br/><p>I finally believed that, indeed, this man, as rumors said, had abandoned his family name. Right now, he seemed like an honest and gentlemanly fellow and I could not sense any bad vibes from him nor did he seem like the type who used flattery.</p><br/><p>In fact, he felt a bit like a puppy…</p><br/><p>Ah…I couldn’t deny the possibility that he might be a sly fox…</p><br/><p>According to my instinct, he was not a bad guy.</p><br/><p>Happy by this fact, my face was full of smiles.</p><br/><p>” Then, John Sensei! Would that be all right? ”</p><br/><p>Hey, if it’s a tutor, then it could not be anything other than Sensei right!</p><br/><p>Once I said that, John Sensei beamed at me.</p><br/><p>…What was this sense of defeat? Hm.</p><br/><p>He was beautiful. He was handsome. He was a bespectacled Ikemen prodigy.</p><br/><p>…And also a gentleman.</p><br/><p>It might had been he was nervous before. Now that I looked at him again, the first impression was not wrong. He was really an Ikemen. This was the first time I felt an intimacy with a black pupil, black haired person ever since I arrived in this world.</p><br/><p>Grrr…. I was jealous.</p><br/><p>It’s okay! In the future even with an average face I would be popular!</p><br/><p>” By the way, Will Sama. ”</p><br/><p>I nearly drowned in the tears of my thoughts before John Sensei’s voice pulled me back to reality.</p><br/><p>” John Sensei, please stop with the ‘Sama’. ”</p><br/><p>Again with the formal tone! As a tutor we were going to be together for a long time to come and if we were to be this formal, my upper lip was going to go stiff! [TN: In original text : My shoulder was going to go stiff. ] Ah, this was not a pun…you there, don’t say that it’s cold! [TN: Cold jokes = pun…get it?] It was an accident, just an accident.</p><br/><p>” Then… Will San ”</p><br/><p>” Will alone is fine. ”</p><br/><p>” …Eh…That is a bit… ”</p><br/><p>” It’s okay because you are my Sensei! ”</p><br/><p>I was getting slightly impatient. With a slightly troubled face, Sensei finally agreed to call me Will.</p><br/><p>” Ah yes Sensei, what is the matter? ”</p><br/><p>I remembered he wanted to say something. John Sensei’s expression turned serious.</p><br/><p>” Ah. It’s just..If you don’t mind me asking, it is a little early for a 3 years old to have a tutor. I was wondering if you made this request or was it Sir Gion’s idea? ”</p><br/><p>This person’s eyes sparkled whenever the topic was about Father. He really seemed to admire Father. Me too, apart from his face, aimed to be like Father.</p><br/><p>Sorry for dashing your hope…</p><br/><p>I gave a small bitter smile.</p><br/><p>” No, it was me who requested. ”</p><br/><p>John Sensei looked very shocked.</p><br/><p>…Yep, I was sorry for betraying your expectations…</p><br/><p>But Sensei too, betrayed my expectations so I was not in the wrong!</p><br/><p>” It’s Will’s…? But why? I don’t mean to be rude but boys at your age usually only think about having fun. ”</p><br/><p>” I don’t know anything. I am proud seeing Father so needed (busy) but as for me, I can’t help with anything… ”</p><br/><p>I looked at Sensei with a mischievous glint in my eyes.</p><br/><p>” …And I am frustrated with that. ”</p><br/><p>With a shocked expression, Sensei sat there, stunned.</p><br/><p>…Sorry.</p><br/><p>I said something outrageous, didn’t I? But there was no choice, it’s true! I could never understand the conversations carried on over my head and it was so vexing.</p><br/><p>” So that is why.. ”</p><br/><p>After a while, a happy smile floated up on Sensei’s face.</p><br/><p>” Well then, let’s study hard as soon as possible, shall we, Will? ”</p><br/><p>What a good smile you had there, John Sensei.</p><br/><p>…Eh….is this person possible…a Spartan ‘S’….?</p><br/><p>I, whose expectations were splendidly betrayed.</p><br/><p>◆◆◆</p><br/><p>AN: John Sensei, a sparta…is he?</p><br/><p>Next chapter, all will be revealed…maybe.</p><br/><p>TN: Muhahaha, what an easy chapter. Most of it is copy and paste from the digest chapter 003. Enjoy!</p><br/>\n</div>"}