{"title": "022 – John Sensei And The Boy", "id": 28, "volume": 1, "url": "http://boxnovel.org/i-have-been-reincarnated-022-%E2%80%93-john-sensei-and-the-boy", "volume_title": "Volume 1", "body": "<h1>022 – John Sensei And The Boy</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>022 – John Sensei And The Boy</p><br/><p>Posted on July 23, 2016 by crazypumkin</p><br/><p>Editor: Poor_Hero and Lazaruz22</p><br/><p>TN: I actually planned to write 2 chapters yesterday since it’s my off day but…I got too wrapped up in Gyakuten Saiban / Ace Attorney 6 to care… It’s too addicting!</p><br/><p>The boy was in a single-mother family.</p><br/><p>The boy was in a single-mother family.</p><br/><p>His mother worked overtime everyday. The difficulties of raising a child single-handedly and doing her job was proving to be more difficult then she thought causing her spirit to wear away everyday.</p><br/><p>The boy’s mother was beautiful.</p><br/><p>But ………</p><br/><p>That day, the boy’s mother returned home late after her overtime.</p><br/><p>” Welcome home. ”</p><br/><p>The boy who turned 8 years old honestly waited for his mother to come home every night.</p><br/><p>Just so to give his mother warm food after working hard everyday for his sake.</p><br/><p>” ….. I’m home. ”</p><br/><p>The dinner prepared by the boy was splendid. So good that he could open a restaurant.</p><br/><p>The boy, since young, had been trying his best with the housework.</p><br/><p>In order to lessen his mother’s burden.</p><br/><p>In order to get a smile from her.</p><br/><p>In order to get praised by her.</p><br/><p>In order to get approval from her.</p><br/><p>But no matter how he tried his best, his mother never smiled at him. Never ever praised him. She even treated him like he was not even there.</p><br/><p>Today was the same. His mother did not smile, did not say that the food was delicious and simply went to bed with a darkened face.</p><br/><p>Even so, the boy never did once blame his mother.</p><br/><p>Because the boy knew how many difficulties his mother had faced.</p><br/><p>The boy had a thought.</p><br/><p>Anyone could do housework. It was the boy himself who had not tried his best.</p><br/><p>And so the boy tried harder.</p><br/><p>His studies. Sports.</p><br/><p>He tried hard as like in the past. He got full marks every time. Before he realized, he had already studied all the way till university level.</p><br/><p>Without slacking at housework.</p><br/><p>He would fold the clothes neatly, clean every nook and corner, cook delicious dinner every night, get full marks in every test.</p><br/><p>And all he got was a ” Right. “</p><br/><p>It was a wearisome, short reply.</p><br/><p>A reply that did not recognize the effort the boy put in.</p><br/><p>And even so, the boy did never once blame his mother.</p><br/><p>It happened on a certain day.</p><br/><p>The boy’s mother fainted.</p><br/><p>She was admitted into the hospital but no cause could be found. She was already skinny and yet she got skinnier day by day.</p><br/><p>The boy devoted his time in taking care of her.</p><br/><p>And even so never once had his mother looked at him.</p><br/><p>The final day came.</p><br/><p>It was a rare day where his mother was smiling self-deprecatingly which caused the boy to involuntarily ask.</p><br/><p>” Mum, why do you hate me? ”</p><br/><p>The boy knew it in his heart.</p><br/><p>Why his mother never once looked at him no matter how hard he tried.</p><br/><p>The boy’s mother smiled a gentle self-deprecating smile.</p><br/><p>” I hate that face of yours. ”</p><br/><p>The boy’s mother knew in her heart that the boy was not in the wrong.</p><br/><p>In fact she was even thankful towards him. If she ever managed to be frank to him.</p><br/><p>In the end, anger took over her.</p><br/><p>Every time she looked at his face she would remember her divorced husband.</p><br/><p>And now she was looking at that person’s eyes.</p><br/><p>” I’m sorry. ”</p><br/><p>The hoarse mumble of the boy’s mother did not reach him. For he had left the hospital room.</p><br/><p>The next day, it was the first time the boy was not in the hospital room.</p><br/><p>Then, as if it was at her own choice, the boy’s mother breathed her last.</p><br/><p>With a graceful smile that not even the boy had even seen on her face.</p><br/><p>” So it was because of this face. ”</p><br/><p>The boy clenched his fist.</p><br/><p>” This face….. ”</p><br/><p>And he decided.</p><br/><p>To live strongly.</p><br/><p>That even with his face there wouldn’t be a problem.</p><br/><p>◆</p><br/><p>” …..It’s a dream.”</p><br/><p>He awakened by his rough breathing.</p><br/><p>Looking outside the window, the sky was still somewhat dark, looking like it’s a little before dawn.</p><br/><p>But it had been some time since he had that dream.</p><br/><p>…..He thought he managed to forget about it.</p><br/><p>Laughing self-mockingly, he got up.</p><br/><p>Careful not to wake his parents who were sleeping on either side of him, he got out of the bed and walked down the corridor.</p><br/><p>” Fuwaaaa ”</p><br/><p>He let out a huge yawn as he headed towards his own room.</p><br/><p>It must have been because of the conversation yesterday that he had that dream.</p><br/><p>In a rare low spirited moment, Will turned the door knob.</p><br/><p>◆</p><br/><p>” Are you not going to ask? ”</p><br/><p>With a happy face as he laughed, John-sensei asked. With just that sentence, I immediately understood what he was trying to ask.</p><br/><p>When I first said that I wanted to learn more about Sensei, he had shown a troubled expression that I now understood.</p><br/><p>To tell the truth, I was interested.</p><br/><p>As I was thinking about it, John-sensei thought I was stunned by the question and began to speak.</p><br/><p>” …Will would know about my family situation. You should be interested to know more. ”</p><br/><p>John-sensei, who had always given off a fun aura, began to exude deep pressure. With his sharp stare and his serious expression, he looked straight at me.</p><br/><p>My instinct told me not to turn away from this.</p><br/><p>” There is no need to ask, is it? John-sensei is John-sensei. ”</p><br/><p>Suppressing my trembling voice, I stared back.</p><br/><p>And John-sensei exchanged his sharp stare for a self-deprecating smile.</p><br/><p>” I can teach, but only that I cannot do. ”</p><br/><p>[TN: I think he meant answering questions about his family.]</p><br/><p>With just that, I understood.</p><br/><p>No, I might have somehow predicted this.</p><br/><p>No matter how close our age might be, or the somewhat closeness I felt, to a person he just met…</p><br/><p>John-sensei continued.</p><br/><p>” I am the 2nd son, which is why I cannot succeed my Father as the Duke. And Will should know this as well, my father is a foolish man. ”</p><br/><p>With that, for a moment, John-sensei’s spinning eyes showed a familiar pain-like expression.</p><br/><p>” When I was young, I tried too hard to attract my indifferent parent’s attention. Calligraphy, mathematics, magic, sword. ”</p><br/><p>He laughed, his shoulders raised.</p><br/><p>” But, no matter how I tried, Father never showed his affections. In the end, it backfired instead. ”</p><br/><p>Giving a deep sign, Sensei, for some reason, smiled.</p><br/><p>” …And so, as I learned, I came to understand. What a foolish, stupid family I have. To continue clinging onto such a thing, I, myself would turn into an idiot. ”</p><br/><p>Sensei smiled, evident pain in his face.</p><br/><p>” But, even if I wanted to change things, I could not. I am too powerless. Now, all I can do, is gain more power. ”</p><br/><p>Power ―― Status.</p><br/><p>So that was why he left his house and served the Royal Court.</p><br/><p>” I realized that, to leave unsightly extravagance, to protect the citizens, the same status is needed. ”</p><br/><p>And the self-deprecating John-sensei, was smiling brilliantly now.</p><br/><p>” Which is why, Will, let us study strictly from now on. ”</p><br/><p>◆</p><br/><p>With that, he passed me a thick book.</p><br/><p>It seemed to be a book on the connections of the Nobles in this country. Family name, territory, and who it was, were all written in detail.</p><br/><p>…….Was I to memorize everything in it?……..</p><br/><p>He was definitely a super ‘S’!!!!</p><br/><p>As I cried out, I continued to advance on reading it. Having this person as my Sensei, it might be my good fortune. I gave a small smile at that.</p><br/><p>Mother, it might be for the best that I was reincarnated.</p><br/><p>◆◆◆</p><br/><p>AN: The reason why Will cannot acknowledge his looks stems from here.</p><br/><p>…It is difficult writing in 3rd person.</p><br/><p>Thank you for reading.</p><br/><p>TN: Hm..I should have done this yesterday. Half of it is copy and paste!</p><br/>\n</div>"}