{"title": "028 – What Should I do?", "id": 34, "volume": 1, "url": "http://boxnovel.org/i-have-been-reincarnated-028-%E2%80%93-what-should-i-do", "volume_title": "Volume 1", "body": "<h1>028 – What Should I do?</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>028 – What Should I do?</p><br/><p>Posted on August 10, 2016 by crazypumkin</p><br/><p>Editor : Poor_Hero and Lazaruz22 (*applause please!)</p><br/><p>TN: And we are back to Will’s POV for those who prefer him.</p><br/><p>With folded arms and a meek face, there was a child looking at the 3 collapsed men on the floor.</p><br/><p>Yes, me.</p><br/><p>And so… What should I do with them?</p><br/><p>I let out a deep sigh.</p><br/><p>The part where I discovered intruders, returned fire and bound them up was all good. But now, no matter how I waited, Father was still not back yet.</p><br/><p>There seemed to be trouble at work so Father might not come home tonight. Mother too, while attending her cousin’s tea party, had decided to stay overnight. Day trips were normally difficult here since cars and trains did not exist.</p><br/><p>… What a convenient world we lived in…</p><br/><p>How awesome it was, to be able to do it without magic.</p><br/><p>… Maybe next time I shall create a car run by magic…</p><br/><p>Oops, I digressed.</p><br/><p>Anyway, the possibility of Father returning today was extremely low. And I had no idea when John-sensei would return… I wanted to ask about how we should deal with them but now it looked like I was trapped in this extremely troublesome situation.</p><br/><p>What was this coincidence that all 3 of them were out! God’s idea of a prank?</p><br/><p>” ………..? ”</p><br/><p>Suddenly, I felt uneasy.</p><br/><p>This felt like too much of a coincidence…. No, it couldn’t be.</p><br/><p>I shook my head, but my suspicions refused to go away, and with that, escalating unease.</p><br/><p>What if it was not a coincidence…?</p><br/><p>I might just be thinking too much. It might be because of the confusion about this troublesome situation.</p><br/><p>But… what if it was not a coincidence?</p><br/><p>People came for Father in his office.</p><br/><p>But in this house we had Father, the strongest in the country, my unpredictable Mother and John-sensei, who was employed by the royal court.</p><br/><p>No one in their right mind would lift a hand against them. Which was why they would fake an incident to lure out Father, arranged it to meet with Mother’s day out. And John-sensei……what about John-sensei?</p><br/><p>I stared at the 3 people, bound and passed out. When I first saw them, I had thought about how ninja-like they were. And that was because they were fishing around for documents.</p><br/><p>Which meant, someone wanted the information Father had gathered.</p><br/><p>I thought my suspicions were stupid and wanted to shake them off but the facts seemed to be fitting together perfectly, just like pieces of a puzzle.</p><br/><p>…. The one who called John-sensei out was the Veltor House.</p><br/><p>It’s no good, this was the only piece that did not fit…</p><br/><p>……What was inside Father’s documents? The other day, in the middle of a lesson, John-sensei said.</p><br/><p>” The current Emperor is the one with an outstanding ability even among history. He is currently looking for a way to clean out all rotten garbage lurking in this system. I really hope he can get it done soon. ”</p><br/><p>And Father had been gathering information about the Veltor’s. Which meant, Veltor House was the part of the anti-kingdom faction and concluded that the information Father had gathered was detrimental to them.</p><br/><p>In other words, the ringleader for this incident, was the Veltor House………..?</p><br/><p>No, it could not be.</p><br/><p>I shook my head, denying it.</p><br/><p>But, no matter how I tried to deny it, deep down I knew. And I was slowly getting sure of it.</p><br/><p>If it was really Veltor’s, then John-sensei might be in danger. It was not a situation I wished to think about.</p><br/><p>This was so obvious but subconsciously, I might be avoiding thinking about it.</p><br/><p>Let’s make sure.</p><br/><p>I had a method.</p><br/><p>But… I was terrified of the outcome. Until now, I was still racking my brains for an explanation on how I caught those 3. How about I just pretended to not know anything?</p><br/><p>I was very happy with my life right now.</p><br/><p>And I didn’t want to wreck it.</p><br/><p>That was why I was frantically thinking of an explanation right now. Even though people important to me might be in danger…</p><br/><p>But, all would be lost if they were gone.</p><br/><p>If I destroyed this happiness but all of us were alive, then I might still be able to do something.</p><br/><p>Making up my mind, I teleported over, making my move immediately.</p><br/><p>It was all still a guess on my part, but even so, with a small percentage of it happening, it would not hurt to check it out.</p><br/><p>Firstly, I drew out all the mana from the 3. So even if they came to, they could do nothing to escape from the bindings… for at least another 2 days.</p><br/><p>Ah, no worries, I withdrew all I could without killing them. Though they would feel extremely tired.</p><br/><p>After which, I manipulated the gravity on the bindings, did an intricate weaving of the barrier magic with the bindings and coiled it around their bodies for an extra measure.</p><br/><p>…Snicker… 3 Silkworms in the room…</p><br/><p>What impudence! I did not laugh at all</p><br/><p>I did not say a word to the maids. If they were Ninjas, the maids might be targeted if their faces were seen by them. The maids were also an important part of my family. I ate a simple dinner and told them I was heading to bed before returning to my room.</p><br/><p>” My aim is… John-sensei.. ”</p><br/><p>I murmured, deep in thought.</p><br/><p>Yep, I should head to his side first…</p><br/><p>After trying all sorts of ways, I at last decided to trace his mana. I hid my presence with magic and opened the window which I then slowly closed from the outside.</p><br/><p>Well then, let’s go.</p><br/><p>I erected a barrier around me and soared up into the sky. Sensei’s mana points… southwest. In a single breath, I cut through the sky in that direction.</p><br/><p>It was difficult to think that they would raise a hand to their own son… I felt extremely irritated that this happened just because he became my home tutor.</p><br/><p>Ah, I kinda felt like I just broke through an air wall but… I must be imagining things. The reason why I could hear nothing must be because I was flying in the sky late at night~</p><br/><p>….Please be safe?</p><br/><p>I was worried because through and through, Sensei was my friend.</p><br/><p>◆</p><br/><p>” …..Nnn…. ”</p><br/><p>When I came to, all I saw was darkness. And the air that I breathed in was dusty.</p><br/><p>Where was I?</p><br/><p>I promptly tried moving my body but I couldn’t.</p><br/><p>…I seemed to be wrapped in something…?</p><br/><p>Confused for a moment, I remembered.</p><br/><p>That’s right, I was hit by someone on the back of my head. Which meant I must be confined and bound right now.</p><br/><p>” ……..Damn it… ”</p><br/><p>To think they were rotten to this extent…!</p><br/><p>I ground my teeth, angry at myself for letting my guard down, thinking that they would not raise a hand to their own son.</p><br/><p>I wondered what was their aim? Use me to call Gion-sama out? No, it could not be, I was not that important to be used as a threat. No matter how stupid they were, they should at least know this much. But I was bound and left here. Which meant I would be trouble for them if I stayed in Beryl’s house. What were they planning?</p><br/><p>….It was useless, I did not have enough information to know what was going on. But it was better than not doing anything. If I used all of my brain power to…</p><br/><p>” Long time no see, John. ”</p><br/><p>The footsteps rang out across the dark room. And its owner appeared in front of me.</p><br/><p>” …..Brother. ”</p><br/><p>” Well then, let’s make you spit it out, shall we? ”</p><br/><p>Smirking, Brother took a knife out of his chest pocket.</p><br/><p>….Ah, now I got it.</p><br/><p>Unconsciously, I laughed.</p><br/><p>” John, spit out everything you know about the Beryl’s. ”</p><br/><p>◆◆◆</p><br/><p>AN: What will happen to John?!</p><br/><p>Father Jin ジン</p><br/><p>Brother Jean ジャン</p><br/><p>John ジョーン</p><br/><p>The simple naming made even me laugh.</p><br/><p>TN: ….And somehow John POV got in again. I apologized for my fast mouth… words at the top of this chapter.</p><br/><p>On the other hand, this had to be the fun-est chapter to translate yet!</p><br/>\n</div>"}