{"title": "024 – First Lesson (John’s POV)", "id": 30, "volume": 1, "url": "http://boxnovel.org/i-have-been-reincarnated-024-%E2%80%93-first-lesson-john%E2%80%99s-pov", "volume_title": "Volume 1", "body": "<h1>024 – First Lesson (John’s POV)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>024 – First Lesson (John’s POV)</p><br/><p>Posted on July 26, 2016 by crazypumkin</p><br/><p>Editor : Poor_Hero and Lazaruz22</p><br/><p>TN: This is the POV of chapter 20. So you’re going to have read some of it. I’m not reposting, by the way.</p><br/><p>AN: It ended up being a short chapter but it’s a good place to end it so…sorry.</p><br/><p>But, 2000 and more likes!?</p><br/><p>It’s like living in a dream everyday.</p><br/><p>Would the next chapter be a break from the slow-tempo and finally have something exciting happening? Please look forward to it.</p><br/><p>” Well then, shall we begin the lesson? ”</p><br/><p>I took out the textbooks I prepared from my bag.</p><br/><p>” Yes! ”</p><br/><p>I was really looking forward to teaching that I unconsciously had a grin on my face. It was as if Will sensed it, he gave an energetic answer back. This person was really interesting. I nodded, feeling a sense of duty.</p><br/><p>” And so, to begin with, the necessity for any form of learning, let us start with learning how to read and write. ”</p><br/><p>” Oh, there is no need to. ”</p><br/><p>I was just about to take out the sheet of alphabets from the book when Will gave an inappropriate laugh. It could not be.. By no means.. Even if you entered the academy, they would start with learning the alphabets..</p><br/><p>” …I see. Then let us start with mathematics, addition and subtraction. ”</p><br/><p>” I probably could do that too. ”</p><br/><p>Will said instantly.</p><br/><p>He must be kidding?!</p><br/><p>Even if he entered the academy, he would have nothing to learn! ….I wondered what the methods of teaching Gion-sama were using..</p><br/><p>[TN: None. It’s all Will.]</p><br/><p>It seemed like my doubt had shown up on my face.</p><br/><p>” I can really do it. ”</p><br/><p>Will murmured, feeling a little disgruntled.</p><br/><p>I wondered if Will had a haughty side too…Just in case..</p><br/><p>If he saw how high this wall was, maybe he would have the motivation to study. I smiled, having thought of a good idea.</p><br/><p>” Well then, please solve these for me. ”</p><br/><p>Having said that, I took out the paper that the scholars went through when they sat for the Royal Court examinations.</p><br/><p>” Yes, Sensei. ”</p><br/><p>Will took out a pen from his breast pocket and looked at the questions. But he immediately looked up and our eyes met. He smiled and turned away, beginning to work the paper.</p><br/><p>I watched the skill of the 3 years old kid tackling the questions silently.</p><br/><p>….He was solving it.</p><br/><p>….No, no, but these mathematical questions…</p><br/><p>As I tried my best to get my slow-processing brain to accept this fact, Will was advancing on the questions.</p><br/><p>…Was there no question that stumped him…?</p><br/><p>He just casually solved the graphic math questions that took me a long and hard time to understand.</p><br/><p>….What a person.</p><br/><p>I was shaking. Was he really 3 years old…?</p><br/><p>It was impossible, this had already exceeded my ability to understand.</p><br/><p>” ….You are done? ”</p><br/><p>But that cute neck-tilting look.</p><br/><p>Instantly, my shoulders relaxed.</p><br/><p>” …You have..done it. …Well done, Will. ”</p><br/><p>I just accepted an outrageous person as a student. How troubling, I would soon have nothing to teach him. But even with my troubled face, I could not help but feel happy.</p><br/><p>” But…What am I going to do? I thought I would be teaching reading and writing and now, I do not have enough materials to continue. ”</p><br/><p>I murmured.</p><br/><p>It was then. Will who heard it gave me a face full of smiles and said.</p><br/><p>” In that case, I want to know more about John-sensei! ”</p><br/><p>Ahh…Even him…</p><br/><p>In the end, it was still all about my House… Instantly, my mood dampened as I got ready for the incoming questions.</p><br/><p>But, all Will asked was questions related to [Me].</p><br/><p>I cannot helped but laughed.</p><br/><p>Really…honestly, this person…….. Was more then what I had ever expected. My expectations were betrayed in the best possible way.</p><br/><p>I wondered why, that this 3 years old child could understand my words and feelings.</p><br/><p>At the end of the day, I had a feeling that I somehow just made a small friendship.</p><br/><p>◆◆◆</p><br/><p>AN: John Sensei, it seemed that he had unconsciously became an ‘S’ to Will.</p><br/><p>To everyone who read this, thank you!</p><br/><p>Any missing or wrong words, please point it all out to this incompetent author!</p><br/><p>From now on too, Youroshiku Onegaishimasu.</p><br/>\n</div>"}