{"title": "027 – Premonition", "id": 33, "volume": 1, "url": "http://boxnovel.org/i-have-been-reincarnated-027-%E2%80%93-premonition", "volume_title": "Volume 1", "body": "<h1>027 – Premonition</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>027 – Premonition</p><br/><p>Posted on August 7, 2016 by crazypumkin</p><br/><p>Editor: Poor_Hero and Lazaruz22</p><br/><p>TN: This is a weird little chapter. We get Gion’s POV first, then 3rd person, then John’s POV.</p><br/><p>Don’t worry, they’re not all repeats, just stuff that happened when Will is busy being a superhero.</p><br/><p>Have fun reading!</p><br/><p>Today, from the moment I woke up, I had a bad feeling.</p><br/><p>With that feeling hanging over me, I headed towards the dining room and saw my son, who just turned 4 years old, bashfully holding hands with Mary-san.</p><br/><p>….I was healed.</p><br/><p>My son was definitely the cutest thing ever.</p><br/><p>He had my hair color with Lily’s eyes. Just that alone made him plenty cute but his short limbs and soft cheeks were a huge plus. I could understand why he was so popular among the maids. Even the straight-laced Mary turned all gooey around him.</p><br/><p>…I feared for his future.</p><br/><p>But, Will was scarily clever. John had joked that they reached ‘Court Examination Levels’ but even with that exaggeration I could accept it. Just a few days ago, I was shocked at how he could read and understand what was written in the documents. At only that age, his table manners was perfect, could read and write, and had such high understanding of mathematics that even John could not help but praise him.</p><br/><p>My heart softened as I watched him chewing with that small mouth of his and just at this time, the maids came over with an apologetic face for disturbing our meal.</p><br/><p>It seemed that a messenger from the Veltor’s house had arrived, bearing the news about the critical condition of John’s mother.</p><br/><p>And with that, I saw the apologetic and restrained John out.</p><br/><p>…Was the bad feeling I had referring to this?</p><br/><p>But, it did not go away.</p><br/><p>Hmm… So it seemed that Will’s lesson for today was cancelled.</p><br/><p>Recently, I had been training Will. I called it training, but it was really just me looking over as Will, who was unable to hold a sword yet, learned the stances of swordplay.</p><br/><p>Even so, I was happy and glad to watch Will, whose eyes sparkled as he focused on his training.</p><br/><p>I wondered if it was about time to make a sword for children so Will could learn how to hold it. Thinking about it, I made my way to the office and saw my subordinates there.</p><br/><p>” G..Gion-sama! ”</p><br/><p>” What is the matter? ”</p><br/><p>From their stressed faces, I would see that something bad had cropped up.</p><br/><p>” Y..Yes! ‘They‘ have begun moving within the capital! ”</p><br/><p>The capital…?</p><br/><p>‘They‘ should be keeping a low profile recently yet all of a sudden they were exposing themselves out in the open in the capital?</p><br/><p>Even with so many questions, I knew I had to do something. I started preparing in haste.</p><br/><p>Without thinking, I clicked my tongue.</p><br/><p>The ominous feeling from this morning must be this. The scale of this news matched my premonition but something still tugged at me…</p><br/><p>What should I do…</p><br/><p>I told Will not to leave the house in case anything happened before I left in my carriage.</p><br/><p>At full speed, I managed to reach the capital in 4 hours. I had just barely made it.</p><br/><p>‘They‘ – were how my circle referred to a portion of the Nobles.</p><br/><p>I was currently working as the leader of the knights… on the surface. In reality, I was directly under the King’s orders, working behind the scenes to flush out all the rotten nobles.</p><br/><p>The current king of Elzmu was Kizmu Mira Oio Lenarus De Elzmu. King Kizmu happened to be my friend. With his good governance, he had received the support from his citizens. And right now, he was unsatisfied with these old corrupted nobles.</p><br/><p>I would gather information undercover and prevent any unrest that would happen. This was a favor to my friend, as well as the citizens. Since then, I had identified various improprieties going on and recorded them down.</p><br/><p>This time, I had information that they had reached out towards the strictly prohibited ‘Slave Trading’. It seemed like they would stop at nothing for money.</p><br/><p>With reports of their ‘movements’, they might either be ‘trading’, or ‘exporting’ to the merchant ship loading in.</p><br/><p>Of the 2, I rather estimated it to be the former. I predicted that they would most likely move from around the evening till early morning.</p><br/><p>But, looking at my subordinates’ faces, the situation was grave. Which meant that it might not go the way I predicted.</p><br/><p>A river was facing the Capital and opposite of it, Hattuo. They would load slaves onto the merchant boats and sail off to where our jurisdiction could not reach.</p><br/><p>And…. their head was Jin Veltor.</p><br/><p>Yes, the father of our home tutor, John. It worked out nicely with his wish to work as Will’s tutor as I was able to observe if he had any connections with his family, as per request from the court. If things went well, I aimed to obtain important information but it turned out to be a misfire.</p><br/><p>Not only did John not have any connections, it seemed that he had completely abandoned the Veltor’s. Just by saying that name alone caused the usually mild-mannered John to fly into a bad mood (as heard from Will).</p><br/><p>As the sun hung overhead, I wondered if the ship had set sail….</p><br/><p>No, this was not what I was worried about. The ominous feeling from this morning had swelled up despite me being here.</p><br/><p>I stretched my neck and stared outside the carriage.</p><br/><p>◆</p><br/><p>” Have you lured out Gion? ”</p><br/><p>” Yes, it was easier than expected. ”</p><br/><p>In a gaudily ornamented room 2 fat men sat. One of them was middle-aged, in his fifties. His drooping stomach was held in place by his white shirt and it shook as he laughed.</p><br/><p>The other man was in his thirties. Although he was not as fat as Mr.Fifties, he too, had a plump figure with went well with his young rounded face.</p><br/><p>” And John? ”</p><br/><p>” On his way after being summoned. ”</p><br/><p>The younger one smirked, looking every bit a villain.</p><br/><p>Yes, the 2 who were sitting on the sofa in this gaudy room were the head of anti-kingdom, the head of the Veltor house and his son.</p><br/><p>Jin Veltor. The only redeeming feature was his pride as a noble but other than that, a rotten man. Bribes, property seizure, squandering. His only skill as the head was to cause suffering to his citizens.</p><br/><p>And his eldest son, Jean Veltor, his reputation was as rotten as his father, squandering money away by immersing in the red-light district or gambling. And an even worst governor.</p><br/><p>Under these circumstances, it could be said to be a miracle that a man such as John existed.</p><br/><p>” And? Everything will go smoothly? ”</p><br/><p>Jin asked, lowering his voice.</p><br/><p>” I hired the best, the [Shadow], Father. If nothing out of the ordinary happens, it would be impossible to fail. ”</p><br/><p>As if going along, Jean leaned over and lowered his voice as well.</p><br/><p>[Shadow] — People living in the underworld. An organization with a wide range of skill set that once hired, moved like a shadow to complete your ‘request’. You could say that they were something like a Ninja or Spy.</p><br/><p>As long as you were their client, they would do anything, even assassination. As the danger level of ‘requests’ were usually high, they, on average, possessed high combat abilities. It was said that no one alive had ever seen them when they used 《》[TN: Shadow], the magic passed down within the organization.</p><br/><p>What did Veltor hire them for?</p><br/><p>This might be the real cause of Gion’s ominous feeling.</p><br/><p>Firstly, to retrieve the discriminating evidence Gion had compiled against them.</p><br/><p>Second, the abduction of Will.</p><br/><p>They wanted to force Gion to join the Anti-kingdom using Will.</p><br/><p>◆</p><br/><p>” Are we not there yet…?! ”</p><br/><p>My displeasure leaked out unintentionally. Even so, in the rocking carriage, irritation was pilling up.</p><br/><p>” John-sama, we will be there very soon. ”</p><br/><p>The coachman said, trying to flatter me. I wonder what he was thinking behind that smiling facade.</p><br/><p>This felt way too suspicious. Like the sudden summons. Even without that, with Mother in critical condition, why was the carriage taking its own sweet time? It was hard to believe if you told me it was just a coincidence.</p><br/><p>I just had an unpleasant idea.</p><br/><p>Were they planning anything again?</p><br/><p>…It could not be… But…</p><br/><p>This was Father we were talking about.</p><br/><p>But even if anything happened, Gion-sama would be in that house. He was the strongest in this country.</p><br/><p>[TN: Not anymore.]</p><br/><p>I shook my head, trying to clear all my doubts away although that uncomfortable feeling continued.</p><br/><p>It took 4 hours and finally, I saw the mansion coming into view. Just that alone made my hair stand on end. The scale of residence could not be compared to Beryl’s house but just looking at this house I felt revolted. I guessed this all boiled down to personal preferences.</p><br/><p>The white solid building is inlaid with gold flacks here and there and ornamented with gorgeous sculptures and at the front, roses. Just by listening to the description it sounded like a castle somewhere but how do I say it… It did not look classy at all.</p><br/><p>Mother too, was one of them but she did give birth to me so I could only return to this house when I heard about her critical condition.</p><br/><p>And so, I was greeted by my father and elder brother with a smile the moment I entered the house.</p><br/><p>……….Shit. I had been tricked!</p><br/><p>At the moment I glared at them, I felt a strong impact from behind and the next thing I saw was the floor.</p><br/><p>Will…… Please be safe………!</p><br/>\n</div>"}