{"title": "034 – The Future", "id": 40, "volume": 1, "url": "http://boxnovel.org/i-have-been-reincarnated-034-%E2%80%93-the-future", "volume_title": "Volume 1", "body": "<h1>034 – The Future</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>034 – The Future</p><br/><p>Posted on August 30, 2016 by crazypumkin</p><br/><p>Editor: Poor_Hero and Lazaruz22</p><br/><p>TN: I panicked a bit, sorry about that.</p><br/><p>And I have no idea how to backup the raw content apart from copy and pasting everything… somewhere. And I am too lazy for that. Job(@b4lmung), Jedi of Patience, did a back up so no more scares!</p><br/><p>PS: Updated the character sheet with John Sensei. Finally.</p><br/><p>At a very good timing right after Onee-san, the other 2 woke up as well. Once they took off their head cloth, it was known that they were both Beastmen as well.</p><br/><p>Ah, I was sure you were questioning about why we left the head cloth on. That was simple. The cloth was connected to the rest of the outfit as a 1-piece. It would be impossible to remove without exposing the chest area a little. Plus there was a possibility the other 2 were female too, just like Onee-san.</p><br/><p>I was very bad with women.</p><br/><p>I had zero experience in dealing with women.</p><br/><p>A naive child would not be bothered about this but sadly, I was 21 years old on the inside. I could not pretend to not be aware of them and in the first place, I did not have the courage to do something as bold as this. It was okay to call me a coward.</p><br/><p>But leaving them fully clothed for these few days were unhygienic. Even though they were assassins, they were still patients. No problem. Although I had zero experience with women, I did still have common sense. It was not confirmed the other 2 ‘Shadows’ were female or not but no matter as I casted 《》and《》on them both!</p><br/><p>[TN: Sakkin Shodoku, Sterilize and Senjyo, Cleanse]</p><br/><p>Ah, magic sure was convenient. Once again, I was reminded this was reality.</p><br/><p>And so, the other 2 ‘Shadows’.</p><br/><p>Mr Tall was Buhual, male, a Bear Beastman. This made me feel like giving him a nickname. The urge was strong with this one. I ended up giving him one anyway but as there was a lot of ridicule on that name, I kept it my secret. It was easy to guess what it was though. The only hint was that I gave him a red shirt as a present. …Ah, would it be better if I gave him a pot of honey instead..?</p><br/><p>[TN: Bu-surarilru, bad at names, part 10000444221. As for the nickname, I am sure you detectives can figure it out.]</p><br/><p>He was born in Dyuvu, and to trade magic tools, he came to Elzmu and was caught. As he had a family in Dyuvu, I gave him enough money to get back. As he was poised to work as a slave here, when he heard that we were letting him go, he laughed out loud, grabbing his stomach. It was like I hit the funny bone of his or something as he laughed till tears came out. To tell the truth, seeing his giant frame shaking to and fro as he laughed was quite a sight.</p><br/><p>As he was a merchant, I made a deal with him to repay this favor in the future. I would definitely cash in on this favor in the future!</p><br/><p>And when I said that, he laughed again. Why?</p><br/><p>Next was Mr Average, Bibinyaru, a Cat Beastman.</p><br/><p>As my prediction that the other 2 would be female was overturned, I was feeling kinda down.</p><br/><p>…Oh, I was not really hoping for another beautiful Onee-san.</p><br/><p>His nickname would be Nyanru. You would feel like retorting why did I only choose the bottom half of his name but wasn’t it obvious? He was a cat beastman.</p><br/><p>He too, was a merchant like Buhual, and got caught on the way to Elzmu. He too, was given money to get back. And he promised to return the money. As expected of a merchant.</p><br/><p>As to prevent this from happening again, all I could do was to cast an anti-slavery barrier on them but it would not help them in the future. 2 grown men being protected by a 4 year old child was…</p><br/><p>Anyway, that idea was turned down by them.</p><br/><p>And as we were dealing with this, it had already been a week. Beastmen’s recovery abilities were amazing.</p><br/><p>And so, a problem arose. Those with good observation might already know what I was talking about.</p><br/><p>Yes, Onee-san.</p><br/><p>Onee-san, for some reason, loved to cling onto me. As happy as I was about that, it was troubling. It might be because I was only 4 years old but getting cling on to was a bother.</p><br/><p>Yep.</p><br/><p>Because she had those soft things…. I could not say it so let’s leave it aside. I was an innocent and pure child.</p><br/><p>Most of all, the thing I was really troubled by was the lonely expression she had from time to time. To that silent Onee-san, there was her tail. A chestnut-colored fluffy tail. They often said a person’s eyes could convey as much as the mouth but in this case, a tail could express as much too.</p><br/><p>Her tail wagged to and fro when she was interacting with Buhual and Bibinyaru and when you thought she was having fun, the very next instance, her ears and tail would flatten themselves like she was lonely.</p><br/><p>As the other 2 set off, I finally had the time for her.</p><br/><p>” Onee-san. ”</p><br/><p>The standard place to find her at was her bed. The room was one of the less conspicuous rooms, situated deep in the house and it was where the former ‘Shadows’ had stayed. 3 beds lined side by side and on the innermost bed, Onee-san sat, her ears and tail jerking from the surprise. I took a seat on the plain-looking sofa placed across the beds and looked at her.</p><br/><p>Seemingly afraid, she had curled herself up and gave fleeting glances at me.</p><br/><p>I had introduced her as a gorgeous Onee-san but she was perhaps only around 15-16 years old. She gave off an impression of someone who was still a child, with fluffy chestnut ears and tail and was, of course, beautiful. And her long chestnut hair, as fluffy, spread out on the bed.</p><br/><p>She looked like those healing characters but now, she was looking at me, afraid. How did I say it…. that hurt.</p><br/><p>I meant, I was only a cute 4 years old child, you know? What was so scary about me?</p><br/><p>…Ah, it was true I defeated the ‘Shadows’ and removed the collar but… 4 years old, you know? To think she was still hugging me yesterday, what was with this situation?</p><br/><p>” Onee-san? ”</p><br/><p>I called out to her once again. She might not had heard me the first time…right?</p><br/><p>” …Y..Yes. ”</p><br/><p>She managed to reply, her voice trembling. Her upturned eyes were cute. Cute, but please stop, this was really hurtful.</p><br/><p>” Onee-san, what do you want to do from now on? ”</p><br/><p>” … From now on…? ”</p><br/><p>She managed to force her voice out, with a face that was about to cry. I was sorry too, for asking straight out like that. From her response, it seemed like she had nowhere to return to. But she was still young. It was not right to force her to go along with the flow with my half-hearted pity. She had to think for herself.</p><br/><p>” Onee-san, where do you live? ”</p><br/><p>” ….None. ”</p><br/><p>” …Can you tell me about it? ”</p><br/><p>Silence.</p><br/><p>I slowly approached the bed where Onee-san had curled herself up on. I then sat on the side of the bed and lifted Onee-san’s face up.</p><br/><p>And from that, she slowly recounted her story in bits and pieces.</p><br/><p>Onee-san was an orphan.</p><br/><p>And this orphan was an irregularity. So she was abused.</p><br/><p>And then, she was sold. And undertook the shadow’s training.</p><br/><p>And somehow gave up in resisting the collar.</p><br/><p>And killed many.</p><br/><p>Onee-san’s slender body trembled from the start till end but even so, I knew she was trying hard not to cry. At the end, I could not stand watching her like this.</p><br/><p>” …I have murdered many people. I cannot be allowed to live… I.. want to die. ”</p><br/><p>I hit Onee-san’s forehead, taking care of my strength. The sound reverberated around the room.</p><br/><p>” Onee-san, baka? ”</p><br/><p>[TN: Chose to leave it as it is. Baka.]</p><br/><p>I then hugged her tightly.</p><br/><p>” Would any of those people Onee-san killed come back to life if Onee-san was dead? They can’t, can they? ”</p><br/><p>I held the surprised Onee-san’s face in my hands.</p><br/><p>” Do you really want to die? ”</p><br/><p>Her body trembled.</p><br/><p>” Anyone can make up for their sins by dying because it is the easiest way out. Nee, Onee-san, do you really want to die? ”</p><br/><p>Her eyes started swaying.</p><br/><p>Ah, no. Tears started gathering at her eyes. The drop right under her eye got bigger and when it got heavy, it rolled down her face. Her face twisted up in sadness and she suddenly moved.</p><br/><p>” I… don’t wish to die! But I have nowhere else to go.. I already have nothing! ”</p><br/><p>At this, I smiled inappropriately.</p><br/><p>” Then, stay here? ”</p><br/><p>Onee-san froze with a ‘Eh?’ look. I stroked her ears.</p><br/><p>[TN: Envious…]</p><br/><p>That’s great. She did not wish to die. I was feeling bad about having said some harsh things but now that Onee-san was going to be staying, I could not help but smile.</p><br/><p>After a short while, Onee-san jumped at me and we ended up in a position where I was pushed down on the bed with her above me. Her tail was going crazy.</p><br/><p>That’s great, she looked like she was delighted about it.</p><br/><p>What I did not know was, the fact that stroking her head and ears multiple times made me smile, was used by John-sensei to mock me and made me regret doing it.</p><br/><p>Really. Onee-san was too cute.</p><br/><p>◆◆◆</p><br/><p>TN: ENVIOUS. I WANT PUPPY EARS TO STROKE.</p><br/><p>ED: XD Onee-san no baka XD (insert Mitsuki Saiga’s voice)</p><br/>\n</div>"}