{"title": "051 – Maria’s Father", "id": 58, "volume": 1, "url": "http://boxnovel.org/i-have-been-reincarnated-051-%E2%80%93-maria%E2%80%99s-father", "volume_title": "Volume 1", "body": "<h1>051 – Maria’s Father</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>051 – Maria’s Father</p><br/><p>Posted on October 31, 2016 by crazypumkin</p><br/><p>Editor : Poor_Hero</p><br/><p>TN: Ahhhh. What a nice break. Just in time too, since I got hooked on something and don’t really feel like translating. LOL.</p><br/><p>Happy Halloween guys.</p><br/><p>Selphy’s roommate was no other than the girl Will had christened ‘Holy Mother’ ―――― Maria, the committee chairman who belongs to the gentle and absentminded type of character.</p><br/><p>Plus, Selphy was in a terrible mood at that time for room assignment and the only one who was willing to be with her was Maria. To put it another way, she saved Selphy by just being there.</p><br/><p>Thanks to Will, Selphy, who was freed from the noise, grew closer to her roommate and now, they became best friends.</p><br/><p>You might think that Will had no friends but that was not the case. Selphy too, had quite a bit of female friends apart from Maria.</p><br/><p>The magic lessons went smoothly and Will’s class was leading in terms of magic perception. And now, it was finally the time to learn some magic spells.</p><br/><p>Will did it easily but the rest of the 10 year old class, including Selphy and Zen, were having trouble with the pronunciation. Zelda-sensei had grumbled about being irritated with the excessive vowel sounds and was supported by the entire class. (Apart from 1 person)</p><br/><p>[TN: If you heard Japlish, you’ll understand.]</p><br/><p>And so, the end of April came.</p><br/><p>Although they were only on the level of learning simple spells and magic circles, not yet even learning how to activate nor had confirmed what their attribute were, Selphy, Zen and Will were busily studying for the sake of skipping grades and the time just flew pass.</p><br/><p>‘But Will most likely had already finished his studies.’ Selphy said, smiling bitterly as she sat up on the lower bunk, having just woke up from her sleep. Maria had already been up for some time but that was usual so there was nothing to be surprised about.</p><br/><p>Today was Saturday.</p><br/><p>Even so, Maria was wearing her uniform. Rubbing her half-awoken eyes as she climbed out of her bed, Selphy looked at her, curious. Maria then tilted her head slightly, like how she always does, and laughed gently.</p><br/><p>” The May Festival is coming soon right! ”</p><br/><p>” …Eh, ah, yea. ”</p><br/><p>With the rug pulled out under her by that, Selphy could only mumble a few sounds with her half-awoken brain.</p><br/><p>Even so, Maria was not bothered by that and was instead in a really good mood. It was rare to see her humming as she braided her hair at the washbasin. By the way, Maria usually wears her hair in a twin braid.</p><br/><p>And I am ready ~♪</p><br/><p>Now she was even making up her own lyrics. Unable to ignore, Selphy stood, fully awake, her mouth opened.</p><br/><p>” You have something on today? ”</p><br/><p>Hearing that, Maria began advancing towards Selphy with such a force that cause her to stumble back onto her bed.</p><br/><p>” Do you want to know~? ”</p><br/><p>Looking at the excited Maria, Selphy nodded, smiling wryly. Most likely she will be forced to listen even if she said no. Selphy then sat down on the chair by her table.</p><br/><p>” You see, today I will be having lunch with my father somewhere near the castle! ”</p><br/><p>” Eh! How nice, to be near the castle! Not to mention meeting with your father! Does he live nearby? ”</p><br/><p>The unexpected answer made Selphy leaned forward. Of course, Maria’s family must be living far away since she was currently living in the dormitory, which was why Selphy asked. The both of them are 10 years old currently and haven’t entered the I-hate-my-father phrase of their life. Therefore, they were purely happy that Maria was about to meet with her father whom she hasn’t seen since a month ago.</p><br/><p>” Hmmm~ We decided before I entered the Academy. My father is a merchant you see. ”</p><br/><p>The plan was for her father to reach the capital yesterday and he really did, Maria said happily to Selphy.</p><br/><p>” Ah, so you will be heading off now? ”</p><br/><p>” Yep~! What about Selphy? ”</p><br/><p>” Hahaha….. I would be studying with Will. ”</p><br/><p>Selphy smiled bitterly at the no-rest day off ahead of her and Maria grinned.</p><br/><p>” That’s good, isn’t it? Will is cool and cute. He will definitely become a hunk when he grows up! Just like Gion-sama! ”</p><br/><p>Maria insisted, standing up excitedly.</p><br/><p>Will called her ‘Holy Mother’, but she was just a maiden. She loves these kinds of topics. Selphy forcefully cut off Maria and sent her off, giving the excuse that she was going to be late for her meeting.</p><br/><p>” I am going now~! ”</p><br/><p>” Have fun~! ”</p><br/><p>Waving her hands till she was the only one in the room, Selphy coughed.</p><br/><p>” Today too…. study. ”</p><br/><p>At this late hour, Selphy finally feels like punching her past self. But it was true that she doesn’t want to separate from Will. In the end, Saturday became the ‘Study Day’.</p><br/><p>◆</p><br/><p>” Ah, Father! ”</p><br/><p>Once she left the school gates, she could see her father standing there, waiting.</p><br/><p>” Oh, Maria. It has been a long time. ”</p><br/><p>Maria ran towards her smiling father and jumped into his arms.</p><br/><p>” Yes it has! How has it been going, Father? ”</p><br/><p>” Good and healthy. Financially as well. Father is always energetic, Maria. ”</p><br/><p>Maria’s father held her hand and they walked down the street together, her braids bouncing.</p><br/><p>It was early morning where the refreshing air still lingered around.</p><br/><p>◆</p><br/><p>” Ah…..That was fun! Streets near the castle are something else, aren’t they, Father! ”</p><br/><p>Maria said as she laid her upper body on top of the thick wooden table. Seeing his daughter’s position, Father smiled wryly. Then, the food they ordered came. The attitude and services received was so good that the both of them can’t help but gushed about it.</p><br/><p>” Hm, so you haven’t been to the lower streets. ”</p><br/><p>” Sigh….School is busier then you thought. The daughter of Caralsdoni Trading Company is going to be a disgrace… ”</p><br/><p>At her father’s, Caralsdoni’s words, Maria sighed, feeling dejected. Maria’s family runs a trading company, started up by her father and with his efforts alone, he managed to build it up to a medium-small sized company. The name, Caralsdoni Trading Company.</p><br/><p>His very own name. It could be that he doesn’t have a nickname or he was in love with his own name.</p><br/><p>” Hahaha, no you won’t. So, how’s school life? ”</p><br/><p>Twirling his mustache, he looked at Maria, laughing.</p><br/><p>” Of course! It goes without saying! Please listen, Father, I have a roommate, Selphy….. ”</p><br/><p>◆</p><br/><p>Waiting was such a simple job. Everything just came without him doing anything, the guy smiled bitterly.</p><br/><p>As it was already evening, the room was slightly dark.</p><br/><p>Hehehehe, the guy laughed, as the orange streaks of light got nearer to the window. As the guy ―――― the black hooded man took his hood off, his mouth, when revealed was shown to be distorted. Plunging his hand into his robe, ga-chunk, a small sound could be heard as he pulled something out.</p><br/><p>Then, his mustache mouth changed. At a glimpse, it seemed like the hair retreated back into his skin and his body structure changed too.</p><br/><p>” ――――How easy. ”</p><br/><p>That cute girl had told him many things. She might had meant to tell it to her father. The man, who once again grinned, had reverted back to his thin frame.</p><br/><p>” Selphy is really~~ close with him. I am envious! ”</p><br/><p>He would have to give his thanks to the girl. He grinned again, looking like he was having fun, his eyes sparkling.</p><br/><p>” Well then….. May Festival, is it. The timing is just nice. ”</p><br/><p>With that, he melted into the shadows of the room.</p><br/><p>◆</p><br/><p>” The May Festival is coming~! ”</p><br/><p>Was the first thing that popped out of Selphy’s mouth as I approached the lobby. Her excitement was high and I think I am seeing an illusion of flowers dancing around her.</p><br/><p>I then understood her excitement with her words.</p><br/><p>Yep.</p><br/><p>So this is what they call ‘Festival Mood’.</p><br/><p>But.</p><br/><p>” May festival? ”</p><br/><p>It was a festival I had never heard before. And when I asked, both Selphy and Zen were surprised.</p><br/><p>” Will…. has some missing bits, doesn’t he? ”</p><br/><p>” Yep. So knowledgeable yet missing out on some common sense… ”</p><br/><p>Selphy and Zen said, one after another. What rude fellows. The real question was why you guys even knew about it in the first place.</p><br/><p>Perhaps I had a disgruntled face on, Zen panicked and began to explain.</p><br/><p>Hmm. Am I that easy to see through?</p><br/><p>….I really had a feeling recently that my mentality was being messed around by my body’s age. Let’s be careful. Even though I kept saying that.</p><br/><p>” It’s a festival where each class has to bring something out! It seems that the middle and high academy can even set up shops. ”</p><br/><p>I see.</p><br/><p>Something like a Bunkasai. [TN: School festival]</p><br/><p>” Hmm…. Sounds fun. ”</p><br/><p>I broke out in a smile and the 2 looked at each other before laughing.</p><br/><p>” Doesn’t it! ”</p><br/><p>” Right? ”</p><br/><p>It’s the long-awaited school event~! My heart was thumping. What should we do? Bring something out… bring something out… A play? Shall we do a horror house?</p><br/><p>And as we were excitedly chatting, a voice rang out.</p><br/><p>” Hm? I just heard the word ‘festival’! ”</p><br/><p>It was the hot-blooded Kiro.</p><br/><p>” Ah, Kiro-san, good afternoon. ”</p><br/><p>Having suddenly appeared, Zen greeted him in a broken voice.</p><br/><p>” Yo, Zen. ….Your note is open…Uwah…are you guys studying? It’s unbelievable… ”</p><br/><p>Peeking at the table, Kiro made a disgusted face. Wha, what a rude youngster.</p><br/><p>Ah, but it was true. If it was the previous me, this kind of thing will never happened.</p><br/><p>” I am not studying~ I am teaching~ ”</p><br/><p>If he looked disgusted and I don’t reply to it, we can’t do stand-up comedy.</p><br/><p>Hm? Why do I want to do stand-up comedy? Ah, just going along with the flow.</p><br/><p>I grinned and looked at Kiro.</p><br/><p>” If you like I can teach you too. ”</p><br/><p>” No thanks. ”</p><br/><p>He replied immediately.</p><br/><p>This guy, he sure didn’t betray my expectation. Having guys that know how to go along with the flow sure was fun. Kiro then retorted back, saying that I wouldn’t know the subjects from Low 3. Low 3 was the short-form for lower academy 3rd year. To think the culture of shortening names existed here as well.</p><br/><p>As I began to feel nostalgic, Kiro, Selphy and Zen began chatting about school fest-, no, May Festival excitedly.</p><br/><p>” That’s right. Then, my class had decided to set up a shop ー A cafe. ”</p><br/><p>I got lured by the words.</p><br/><p>C A F E.</p><br/><p>This could be the part where my ears suddenly grew big and someone would yell ‘ Wah, his ears grew in size! ‘. Then’ Wah, how cold. ‘ would follow up. Then I would be hurt, he would be hurt. Hm. Nothing good will happen. Yep.</p><br/><p>[TN: If you don’t understand, he’s still talking about the stand-up comedy in a cartoon like scenario.]</p><br/><p>But a cafe. I wondered what kind of cafe it would be. I perked my ears, trying to listen to their conversation.</p><br/><p>” So now we are fighting about if we should use our uniform or to make some costumes. ”</p><br/><p>At that, Zen muttered.</p><br/><p>” Ehー Isn’t it fine with just our school uniform? Since it’s a school event anyway. ”</p><br/><p>What was he talking about.</p><br/><p>” DEFINITELY COSTUMES! ”</p><br/><p>Before I realized it, I had shouted.</p><br/><p>Before I realized it, Saturday passed with us discussing about the design for the costumes. It must be my imagination that everything ended up connected.</p><br/><p>Thanks to Selphy’s laughing fit, I got infected by it as well, hahaha.</p><br/><p>” ….haha. ”</p><br/><p>But, the product for my entire day of work was lying on top of my table right now. There was no need to say but it was a splendidly hand-made maid uniform.</p><br/><p>……He~♪ I went and made it.</p><br/><p>Because, wasn’t school festival cafe all about this?</p><br/><p>◆◆◆</p><br/><p>Zen [What is this (The stitching is exquisite )?!]</p><br/><p>Selphy […What is this really (Where do I stand if he can study and even sew perfectly)?]</p><br/><p>Kiro [WHAT THE HECK IS THIS! (It’s too perfect! It’s too cute!)]</p><br/><p>Will [Ah no…Sorry.]</p><br/><p>TN: Hahahahahaha. Sorry, that was too fun to translate.</p><br/>\n</div>"}