{"title": "057 – Oops, I Summoned It", "id": 64, "volume": 1, "url": "http://boxnovel.org/i-have-been-reincarnated-057-%E2%80%93-oops-i-summoned-it", "volume_title": "Volume 1", "body": "<h1>057 – Oops, I Summoned It</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>057 – Oops, I Summoned It</p><br/><p>Posted on November 19, 2016 by crazypumkin</p><br/><p>Editor: Poor_Hero</p><br/><p>TN: It was fun reading all those guesses. Well, since everyone is looking forward to this, here you go!</p><br/><p>I also made a mistake for the last chapter. Varino-Sensei was the one staying in class while Zelda-Sensei do the measurement test.</p><br/><p>I left the classroom like I was avoiding Varino-sensei’s gaze and walked down the corridor with Selphy trailing behind me.</p><br/><p>” Come to think of it, Zelda-sensei, what is the difference between Sacred Beasts and Magical Beasts? ”</p><br/><p>I asked Zelda-sensei, who was walking in front of me. According to Zelda-sensei’s script for the play, I faintly remembered that Ochyon was written as a Sacred Beast.</p><br/><p>” Nn, ah… Magical beasts attack humans while Scared Beasts don’t, that’s about it. In general, they often have high intelligence and mana power so you can think of them as beasts that even high-ranking magical beasts dare not attack. ”</p><br/><p>Sensei turned and faced us as he answered, all the while walking backwards.</p><br/><p>” I see… ”</p><br/><p>Something like the difference between Inari-san and Youkai.</p><br/><p>….Eh? Wrong? Then…Zashikiwarashi or ghosts then? Anyway, in short, we need to run upon seeing one.</p><br/><p>While I was thinking about that, we reached the venue.</p><br/><p>Crap.</p><br/><p>My heart was beating way too fast. I had no mental preparation whatsoever since this came all of a sudden. I really wished they would think about us a little more.</p><br/><p>Sensei opened the door, which had a huge ‘Special Mana Measurement Test Hall’ paper sticking onto it, and urged me inside. Th, there was no choice, I can only enter. My heart rate rose as I felt a deep sinking feeling in my stomach as I entered the hall….or rather, the classroom.</p><br/><p>Ah… my heart is racing. Was it broken? I would not possibly break a tool that even the large-scaled guilds used…right? Somehow, I felt like I just raised a flag but I shook that feeling off as I went forward.</p><br/><p>When I entered the hall, all eyes were on me as expected. It might be because Zelda-sensei was with me but I could hear ” Ah…..so that’s the rumored Will… ” in the chatter. I wondered if it was just me being self-conscious.</p><br/><p>Since there had only been Elves here before, I was the only human around. Maybe that was why I was attracting so much attention. But even my name was known so the incident before must had traveled around.</p><br/><p>The special measurement test was for both the lower and middle Academy but somehow everyone knew. Things like nicknames….or that so-called 2nd name was being attached to me.</p><br/><p>Hey, I can hear you, you know. Uwah, I feel like puking.</p><br/><p>…..Please stop with the ‘Umbrella Prince’ thing.</p><br/><p>Because it’s embarrassing.</p><br/><p>Because it’s embarrassing!</p><br/><p>Important things are meant to be said twice.</p><br/><p>Th-that time was because someone who was holding an umbrella was just standing right by the window! I had no choice! Please stop with the sarcasm.</p><br/><p>Anyway, it seemed like we will be called up for the test one by one. Those who had the test left the hall and the number in the hall began decreasing. In that case I wished I could be the last.</p><br/><p>…..Since I raised the flag and all.</p><br/><p>In the end, my wish was granted. Only Selphy and I was left in the hall.</p><br/><p>” Well, Selphy, come over here. ”</p><br/><p>Zelda-sensei beckoned towards her. Looking nervous, Selphy stepped forward. I understand. My heart was beating furiously too. If my heart stopped, I would definitely sue Zelda-sensei.</p><br/><p>The measurement tool looked to be the same as before, a crystal ball, but with a capacity of 1000. As a normal human usually possesses around 100~150, this was an amazing tool.</p><br/><p>Selphy touched the crystal ball.</p><br/><p>” !! ”</p><br/><p>Zelda-sensei, who was looking at something like a panel that showed the power level, stood up in surprise.</p><br/><p>” Wh, wha, what happened? ”</p><br/><p>Selphy asked, anxious. The stunned Zelda-sensei looked at Selphy.</p><br/><p>” ……Nothing …..what amazing power, 450. ”</p><br/><p>” ….. Eh!? ”</p><br/><p>This time, it was Selphy who screamed. Wow, amazing. I had predicted that it would be high and I was right. Even if Elves are a race that have higher mana power than humans, Selphy was only 10. At 10 years old, the range was usually half of an adult human. Even adult Elves have around 300~500 as an average so Selphy’s future can be said to be unknown.</p><br/><p>” As expected of Selphy. ”</p><br/><p>I said, involuntarily and Selphy, even Zelda-sensei, turned and stared at me.</p><br/><p>….W, why?….</p><br/><p>The 2 of them stared at me and tilted their heads. Then with a laugh that was mixed with a bit of a sigh, Zelda-sensei said.</p><br/><p>” Yosh, Will, you’re the last one. ”</p><br/><p>Nodding, I reached out towards the crystal ball. The shorter the distance towards the ball was, the higher my heartbeat rose. My fingers touched the hanging crystal ball.</p><br/><p>BANG.</p><br/><p>A short sound.</p><br/><p>Ah, deja vu, deja vu……</p><br/><p>Zelda-sensei stood up, stunned.</p><br/><p>” Wait, wait for a bit, I feel like puking my organs out. ”</p><br/><p>That was a new joke. As my mind began thinking of ways to retort to that, my body was more honest as it could not stop sweating.</p><br/><p>Yes, in front of my eyes was the shattered measurement tool…..</p><br/><p>” …..Tehe♪ ”</p><br/><p>In this kind of situation, laughter was needed.</p><br/><p>The one who said I was disgusting, come out now.</p><br/><p>…..Was compensation needed?</p><br/><p>◆</p><br/><p>In the classroom now.</p><br/><p>Eh, why? The aftermath was left to the adults (Zelda-sensei) and being the children that we were, we went back to class. Adults have their adult things to do. I am an adult too? What are you talking about? No matter how you see it I am only 8 years old, am not I? Which part of me do I look like an adult to you?</p><br/><p>Everyone seemed to have succeeded in summoning and contracting so the classroom was crawling with magical beasts. One by one, they were called up to the blackboard and using the magical circle, they summoned beasts. As it was going to troublesome if anyone failed, Varino-sensei was there to ensure nothing happened. Under his watchful eyes, one classmate finished his summoning.</p><br/><p>The summoned beast was none other than [Slime].</p><br/><p>……So squishy and cute. I am going to try asking if I can touch it the next time. Looking around at all the different beasts, the next one seemed to be Zen. Standing in front of the blackboard, with a tense face was Zen and a smiling Varino-sensei.</p><br/><p>” Use this to summon. ”</p><br/><p>Varino-sensei handed Zen a piece of paper with the summoning magical circle drawn on it. Nodding, Zen took the paper, looked at it and began to enter mana into it.</p><br/><p>” 《》! ” [TN: Sho Kan, summon]</p><br/><p>At his chant, the paper on his hand resounded with a ‘Pon!’ and its shape started changing. Wow, just like magic. Or rather, it was magic!</p><br/><p>Then, the shape that appeared was……..</p><br/><p>” Arf! ”</p><br/><p>A dog.</p><br/><p>” 《しましょう》 ” [TN: Keiyaku Shimashou, Let’s make a contract]</p><br/><p>” Arf! ”</p><br/><p>At Zen’s chant, the dog wagged its tail happily. Around them, something glowed and the contract was formed without any accident.</p><br/><p>The dog had brown fur. Cute. I had doubted for a moment if it was really a magical beast but it had one part that confirmed it. It’s tail. It had 2 tails.</p><br/><p>Magical Beast Dogg. I had heard that it was like a stray dog that lived in the mountains. When summoned, it would befriend its owner immediately, just like a dog. What a cute beast. That weird cuteness was somehow like Zen.</p><br/><p>” Okay, next. Will. ”</p><br/><p>I was the next in line.</p><br/><p>But I just destroyed the measurement tool…. Should I be summoning?</p><br/><p>Was what I thought but I can’t hide my excitement. Nervous, I walked towards the blackboard.</p><br/><p>” Go ahead. ”</p><br/><p>Varino-sensei handed me a paper. Looking at it, I slightly entered mana into it as I murmured.</p><br/><p>” 《》 ” [TN: ….]</p><br/><p>The paper glowed and with a ‘Pon!’ sound, a figure was seen on the paper.</p><br/><p>” Did you call, my Master? ”</p><br/><p>It was something big, something white.</p><br/><p>” Ke, 《しましょう》 ” [TN: Refer to Zen]</p><br/><p>The reason for stumbling here was definitely because of my past memories. [TN: Too Chyuuni for him] The surrounding then got wrapped in light.</p><br/><p>◆</p><br/><p>” Wahahahaha, sorry about that, Master. To think I destroyed the classroom! ”</p><br/><p>A man standing next to me was laughing heartily.</p><br/><p>Silky white hair, straight and beautiful nose. Slight upturned eyes that will melt girls if they were being glanced at by them. Men’s enemy, the so-called Ikemen. And he was also my summoned beast ―――― A dragon.</p><br/><p>At the summoning and contracting, the classroom was destroyed. His real form was of a white dragon. And now, he turned into a human form.</p><br/><p>Yep.</p><br/><p>Just for today’s compensation I was going bankrupt.</p><br/><p>◆◆◆</p><br/>\n</div>"}