{"title": "D007 -My Son Went To The Academy (Gion’s POV)", "id": 77, "volume": 1, "url": "http://boxnovel.org/i-have-been-reincarnated-d007-my-son-went-to-the-academy-gion%E2%80%99s-pov", "volume_title": "Volume 1", "body": "<h1>D007 -My Son Went To The Academy (Gion’s POV)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>D007 -My Son Went To The Academy (Gion’s POV)</p><br/><p>Posted on December 30, 2016 by crazypumkin</p><br/><p>Editor: Poor_Hero</p><br/><p>TN: Happy New Year!</p><br/><p>It was a bolt out of the blue.</p><br/><p>Yes, it was a magnificent and delightful surprise. My son, was going to attend the Academy! Not to mention he got in by skipping grades!</p><br/><p>Normally, the starting age for the compulsory education for the Lower Academy was set at 10. But Will was only 8! Plus, according to John-dono, Will’s ability was more than enough to take on the court-scholar examinations! No matter how much of it was just flattery, it just proved how amazing my son was.</p><br/><p>Ah, I might have to take back my previous words of ‘magnificent and delightful’.</p><br/><p>………It would be so lonely!</p><br/><p>I was hardly at home these few days in order to handle the Anti-Kingdom revolts plus to deal with the aftermath of the incident a while ago. Thanks to that, I hardly met with Will. It was hell. It was so painful that I wanted to fire an attack on the Demon Forest with my sword.</p><br/><p>Well then, that incident.</p><br/><p>The ringleader turned out to be Jin Veltor, John-dono’s father. It was immediately proven that John-dono was not part of it. The reason was because he was a victim of the incident as well. He was confined in Veltor’s house basement by his own brother and father and tortured till he was bleeding all over and even had fractures all over his body. The one who got him out was Will…..</p><br/><p>During that time, I was rushing over to the Capital due to a tip about a ship smuggling the prohibited [Slave Collar]. And Lily was at a Tea Party she had promised to attend for some time. As for John-dono, after receiving the news that his mother was in critical condition, he was rushed home.</p><br/><p>Him being rushed home and me going to the capital was all a set up to lure us out of the house. The moment I realized it was when I inspected the ship and only found chickens. By then it was already too late.</p><br/><p>The objective of the enemy was the documents in the house and the abduction of Will.</p><br/><p>Apart from my position, I was also in a very close relationship with Kesamu. My strength could also be said to be the best in the entire nation. Above all, I am a Duke and I lead the Knights, especially the White Knights that maintain the public order, is directly under my orders. The abduction of Will was them betting against the stakes.</p><br/><p>Under our undercover activities, the power of the Anti-Kingdom faction waned. Especially Veltor, who had committed many offences, such as importing slaves. He was really a picture-perfect example of a [Noble-sama] and to Kesamu (King), who was thinking more about the commoners, he was a thorn by his side. Because of that, Veltor must be thinking there was no other way out. And to think his son was working under the Beryl’s house. He might have thought he could learn about Beryl’s weakness from John-dono.</p><br/><p>Being the tutor for Will was totally unrelated to the workings of Beryl’s house. I would not have hired someone who did not know that difference. It greatly puzzled me why Jin Veltor would even think that.</p><br/><p>In the end, the [Shadows] they hired was defeated by their target, Will, who even rescued their information source (John) they were relying on and ended everything before anything happened but of course they were caught and stripped of their power and possessions.</p><br/><p>And then there were the trouble of having to settle the land that Veltor ruled over…. In the end, it was placed under the Beryl’s. As citizens had been running over from heavy-tax and badly-governed Veltor’s state, it did not make much of a difference and Veltor’s son, John-dono had been in the talks of handing it over as well.</p><br/><p>And when I went to Veltor to ask how he came to hire the [Shadows], the information was of a black-robed man. To think they would actually use such a suspicious person.</p><br/><p>That was not all. The problematic part was the Shadow-slaves were all bound with a [Slavery Collar]. It was a magical tool that had been prohibited throughout the world since a few hundred years ago.</p><br/><p>I thought it was obsolete. But even if a few of it were left over, the technique to make it was rather difficult. Could just a organization handle it? My head hurt just by thinking about the circumstances. The only organization big enough to control the [Shadow Group] could only be a [Country].</p><br/><p>Which was why I was running around dealing with many things and when it all had finally started to settle down, I had then realized it. It was an electric shock.</p><br/><p>I did not get to play with Will at all! To think I even went through the trouble to order a child-use sword!</p><br/><p>…..But the reason Will skipped grades to enter the Academy was ‘I wanted to be able to help Father as soon as I can’. Hehehehe. This is my son, everyone. He could even skip grades. He had a good head.</p><br/><p>” But still…. it’s lonely.. ”</p><br/><p>As I complained in front of the wash basin, Lily entered the room.</p><br/><p>” Dear….. please stop with the grumbling. How about hugging Will when we see him off? ”</p><br/><p>” That’s….that’s right! ”</p><br/><p>My mood lifted a little with Lily’s words. Yes, just a little!</p><br/><p>” Will once complained that your beard hurt, didn’t he? How about shaving it properly? ”</p><br/><p>” That’s right! I am going to shave it till it’s smooth! ”</p><br/><p>At my words, Lily laughed. She was as beautiful as ever. Gently, I hugged her and whispered.</p><br/><p>” Let’s go somewhere when it’s our day off. I found a good place in the capital. ”</p><br/><p>” Oh my. ”</p><br/><p>This time Lily burst out laughing. Oh well. Hm? The Academy and dorm Will entered were situated in the Capital? That’s totally unrelated.</p><br/><p>◆◆◆</p><br/><p>TN: I love translating Gion’s POV. He’s my fav after Will’s POV.</p><br/>\n</div>"}