{"title": "073 – Retaliation Against Grousil (Last 01)", "id": 85, "volume": 1, "url": "http://boxnovel.org/i-have-been-reincarnated-073-%E2%80%93-retaliation-against-grousil-last-01", "volume_title": "Volume 1", "body": "<h1>073 – Retaliation Against Grousil (Last 01)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>073 – Retaliation Against Grousil (Last 01)</p><br/><p>Posted on January 27, 2017 by crazypumkin</p><br/><p>Editor: Poor_Hero</p><br/><p>” Then I’ll be going! ”</p><br/><p>Leaving that, Shiro disappeared. In the end, as he couldn’t teleport, he went via other methods. Something like erasing his presence with Wind magic and making use of (water) reflection to make himself disappear.</p><br/><p>Yep. What can I say? Shiro’s invincible.</p><br/><p>Since if I was to praise him, he would rampage and destroy the town so I kept it to myself.</p><br/><p>” Have a safe trip~ ”</p><br/><p>And I was back to being all alone in the dark cell. Since I had nothing to do here, shall I do some spying?</p><br/><p>《》</p><br/><p>[TN: Choryoku Kyoka, Strengthen Listening ability]</p><br/><p>◆</p><br/><p>” And, are all the stuff gathered? ”</p><br/><p>Matilda asked the guys who came back.</p><br/><p>” Ah, yea. Once it’s winter, it’s going to immediately diminish though. ”</p><br/><p>” The master’s wasteful as well. ”</p><br/><p>” Oi you guys! You’re too loud! ”</p><br/><p>Even as they were saying it, smiles appeared on 3 of their faces. Today’s market would start in the evening. Although their owner was said to be picky, the product this time round was of the best grade. The master was in a good mood recently so they were relieved about that.</p><br/><p>That was because they had a horrible master. He was often in a bad mood and if anyone were to get on his bad side during it, it was certain that someone’s head would definitely roll. He seemed not to even know the rule of the underground market and it had some strict rules. The only reason why they were listening to him was because of the money. If it was anyone else, they would had already cut them off.</p><br/><p>Winter was approaching and they were panicking as it was around this time where the people who came to Hattuo decreased. During winter, this town out to be empty of travelers. ‘The view without those beasts(men) are beautiful.’ The only ones capable of making that joke were Nobles.</p><br/><p>To them, they would lose their lifeline of there were none of those beastmen. Because then, they wouldn’t had any products. Beastmen who came to Flowason to stay for a night for trading was the best prey. Even though many Beastmen merchants visited this town, discrimination from the citizen of this country still ran deep. Truth was, there were many inns in Flowason who rejected them or charged them sky high for a worn-put room. Thanks to that, Matilda’s inn, despite the attitude, charged them the same amount so there were many who stayed and placed their goods with them.</p><br/><p>The 3 then began chatting merrily about what they did with the goods and the fate of the customers who stayed with them while a metal scrapping sound was heard from the carriage house, approaching.</p><br/><p>The door was slammed open. His fat body shook as the man entered the room, dressed in armor. He grinned as he approached the 3 who hung their heads.</p><br/><p>” Matilda. ”</p><br/><p>A raspy voice as though broken, sounded out.</p><br/><p>” Yes! ”</p><br/><p>She lifted her head up.</p><br/><p>” What about the products? ”</p><br/><p>” We gathered fantastic goods this time round, Master. Within those, there was a beautiful young girl who stayed at my inn as well. ”</p><br/><p>” …..Hoh, a beautiful young girl. ”</p><br/><p>His eyes narrowed. Matilda deemed that was to urge her to continue and she did. It was the best to take this chance since he looked like he was in a good mood.</p><br/><p>” Yes. She came along with her father and a beastman guard on their travels. Her father is a gentle man while a beast is a beast. They were nothing compared to her. The mysterious moon-like eternal\u007f beauty, flowers bloom when she smiles and that sweet, cute and precious-looking face, just like an angel. ”</p><br/><p>The man nodded, satisfied at Matilda’s words.</p><br/><p>” Grousil-sama, other products of high quality had also been gathered. I await your presence. ”</p><br/><p>He grinned broadly at that. This man was \u007fFet Ale Grousil, a man who listened to no one.</p><br/><p>” Someone, bring me to the goods! ”</p><br/><p>At the back of Grousil, who was walking along happily, were his followers in armor. He was unusually in a good mood as opposed to his always bad one. It was an atmosphere where it wouldn’t be strange if he started humming.</p><br/><p>But this had always been his personality.</p><br/><p>If the goods were good, so was his mood. That’s it. You can say he was straight-forward in a good way or simple, in a bad way. He was a guy who could only think of omelet if you told him eggs. You can say he was not a chick, yet not a chicken either. This kind of man was managing the black market at the moment when he used to have a very high-ranking job.</p><br/><p>” Here, I can get money and woman. This is way better than being a general! ”</p><br/><p>This man was Fet Ale Grousil. He was the former-general who was sacked by Guta the other day.</p><br/><p>◆</p><br/><p>” ……What’s the meaning of this? ”</p><br/><p>The conversations I picked up using my enhanced hearing was painting a very obvious picture. So obvious that it was rather anticlimactic. As suspected, it’s a slave dealing store here. And, the man who entered just now ―――― the owner maybe ―――― had said general. And Matilda-san had called him Grousil-sama.</p><br/><p>If my memory served me right, at the top of Hattuo’s military was a general named Fet Ale Grousil. Even for ‘sparta’ John-sensei, he did not go into details about inner workings of other countries so I only knew and could confirm his name. I could only blame my bad luck in meeting him here.</p><br/><p>….Yea, his character was as taught. As expected of John-sensei.</p><br/><p>I thought there were only Beastmen here but it seemed like there were other humans here apart from me. A beautiful young girl. A bishojo. It’s a chance in a lifetime for them to meet someone like that here in this town. And the coincidence that the people she was traveling with were a slender man with gentle manners and a beastman guard.</p><br/><p>…..But seriously.</p><br/><p>What was going on? From the servants to the conversations they had, wasn’t it all irrelevant to the [Shadows]? Was I just a poor girl (boy in disguise) that got dragged into this mess? I had nothing to say if they were setting up a fake conversation for me but at the moment, I could see no connections to the [Shadows].</p><br/><p>It was just a normal slave dealer shop.</p><br/><p>They said everything had been gathered so there might be other children here, like me. No, it might not be limited to children only. Ah, at the very least there won’t be other cross-dresser here.</p><br/><p>…..About that, if I was stripped then the fact that I was cross-dressing will be exposed. No. Heck, definitely not! That’s right, if that ever happens, I will cast illusion on them.</p><br/><p>Hattuo Empire was a country that still acknowledged the presence of slaves. But the legal ones were only those who were forced into slavery as a punishment for their crimes. Which meant the one who kidnapped me was running an illegal business. Which meant if I were to crush it, I would be doing the right thing legally.</p><br/><p>As for slavery, I was still being pulled by the values of my previous world so there was nothing I could comment on but it did make sense when it was told to be a punishment for criminals. On the contrary, even if I were to crush one here, there would still many more of these slave merchants in the underground world.</p><br/><p>You could say it’s just hypocrisy. But it was also the truth to say the lives of the people here would be saved. Since I came to know about it, there was no way I could leave it alone. The guilt would be unbearable.</p><br/><p>I have [Cheat] but society is not something that can be changed just by a person’s strength alone. The underground world wouldn’t disappear if one kept on repressing it. It would swell up instead. The one way to counter that was to let the country economic state go up. But it’s Hattuo Empire here. I do not possess the strength and power to interfere with the affairs of another country.</p><br/><p>But, since this place had nothing to do with [Shadows], let’s crush it, since I wanted to save the people captured here. Let’s get the soldiers in here.</p><br/><p>The border soldier had a face like a bandit but he was polite and took great care of this gross cross-dressing me. I liked to believe that even the criminals wouldn’t lay a hand to foreigners.</p><br/><p>Ah, but the opponent was the Fet Ale Grousil. There was a possibility that such an influential person would turn the tables on me and accuse me of being the criminal. He would most likely be using his status when the time came.</p><br/><p>The leading general VS the Duke’s son. I wonder if status in other countries would be of any use here. I didn’t know the details but if I were to mess this up and it ended up creating any diplomatic issue that I might need to pay with my head.</p><br/><p>But if that happened, everyone would know that I cross-dressed. It’s a poor move. I can’t say that it was because I wanted to crush the [Shadows] that I came spying into Hattuo ☆ so I might be labeled with having a fetish of cross-dressing. That’s the worst. I will absolutely not let it happen!!</p><br/><p>Everything was fine as long as I am not caught. There should be no young silver-haired girl with the name Willia so there won’t be any problems. Yep, the plan was confirmed. I shall investigate his background first! If there was no connection with [Shadows], I would crush him here.</p><br/><p>And when I made up my mind, footsteps were heard at where the door, and stairs, were located. Well well well, Grousil-san. I am going to make you regret making an enemy out of me. Guhahahahahahaha!</p><br/><p>…..Sorry, I got carried away.</p><br/><p>It must be my imagination that I heard grumbling.</p><br/><p>The lock on the door opened with a loud clank. The thick wooden door was pushed open by people in amour and they kept it open. They then proceeded to line up in a row, as if waiting for someone.</p><br/><p>Then, something huge appeared. Grousil-san appeared, his body wobbling with every step. He was a splendid and magnificent…</p><br/><p>” 《》….. ” [TN: Buta. Pig. You should learn this kanji, it comes out in almost every menu in Japan.]</p><br/><p>The word instinctively tumbled out of my mouth.</p><br/><p>” Hoh, this one here? ”</p><br/><p>Ignoring my word, the pig opened its mouth and a smiled appeared. Its disgusting eyes went over my entire body as he looked at me.</p><br/><p>A chill went down my back. Goosebumps appeared all over my body. How disgustingdisgustingdisgusting! Shall I kick this pig bastard?!</p><br/><p>….I could not help it when that cold joke appeared in my mind! I am not xxshioka Sumiko! I won’t say I will whip you but your name shall say be Pig Bastard, this pig bastard.</p><br/><p>[TN: にしおかすみこ. A comedian whose whole shtick revolves around her being a ‘SM’ queen. Google it.]</p><br/><p>Me, whose hair on my entire body were standing up, must be glaring at Pig Bastard. Of course, my killing aura was mixed in as well. Although I called him a Pig Bastard, he was still a general so he should be able to stand it. If he gets it then he should know better than to lay a hand on me.</p><br/><p>” Arhhh! ”</p><br/><p>A small gasp leaked out as Grousil-san fell on his back just like that. Panicking, his guards rushed over to him.</p><br/><p>” Grousil-sama! ”</p><br/><p>They yelled, shaking him. His tummy shook as they shook but no reaction came. It seemed like he had passed out.</p><br/><p>” Grousil-sama?! ”</p><br/><p>” Wha, what happened?! ”</p><br/><p>In the mist of the armor’s chaos, a young girl locked inside a jail cell was stunned.</p><br/><p>” …..Really?…… ”</p><br/><p>Or rather, me.</p><br/><p>◆◆◆</p><br/><p>TN: Happy Lunar New Year, everyone! It’s the year of the rooster, cockle doodle doo!</p><br/>\n</div>"}