{"title": "082 – The House Of Shadows And The Battle Mania", "id": 94, "volume": 1, "url": "http://boxnovel.org/i-have-been-reincarnated-082-%E2%80%93-the-house-of-shadows-and-the-battle-mania", "volume_title": "Volume 1", "body": "<h1>082 – The House Of Shadows And The Battle Mania</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>082 – The House Of Shadows And The Battle Mania</p><br/><p>Posted on March 1, 2017 by crazypumkin</p><br/><p>Editor: Poor_Hero</p><br/><p>I broke through the darkness of the night.</p><br/><p>It was regrettable that even with my enhanced vision, I could hardly see more than a short distance ahead.</p><br/><p>I had enough.</p><br/><p>I had enough of losing people without doing anything.</p><br/><p>I had enough of losing even if I did anything.</p><br/><p>” ……I will crush them. ”</p><br/><p>The wind around prevented my voice from leaking out but at least my desire was conveyed.</p><br/><p>I finally arrived right on top of where the 3 dots on the map were shining. But only thing I saw there was an unlivable broken-down house. There were countless holes in the roof and it was in a condition where only the bare bones of the house was left standing. No one could be seen.</p><br/><p>Why?</p><br/><p>No matter how I doubted my eyes, what I cannot see would still remain unseen. It was just an empty whirl of nothingness there. It had completely turned dark. On the other side of the blue blue sky, the reddish glow at the edge of the horizon flickered gloomily as it died down.</p><br/><p>[TN: Okay, I have no idea why the author keeps alt between total darkness and still seeing the light and blue sky. I reckon she’s hanging out with Alcohol-san.]</p><br/><p>Was my magic wrong?</p><br/><p>No, it cannot be. Nothing could be done if that’s the case. I had a solid image in my mind as I chanted the spell perfectly. It would be to the degree of denying the laws of this world itself if the magic was wrong despite it activating.</p><br/><p>In that case, why was there nothing here?</p><br/><p>No, it was not that there was no one here…. but that I can’t see anyone. Yes, [Shadows] were known to control the darkness. When I first met Chiffon and Buu-san, Buu-san was using《》. Like me right now.</p><br/><p>It was written ‘my hall’ on the paper left behind. There was no way it would be this broken-down house.</p><br/><p>Which meant.</p><br/><p>The hall was hidden. There was nothing else I could do even if I was wrong about this.</p><br/><p>“《》”</p><br/><p>[TN: Mahou Kouka Toushi, See-through all magic effects]</p><br/><p>I chanted and it unexpectedly appeared instantly. It was quite.. anticlimactic.</p><br/><p>In a word, it was a masterpiece.</p><br/><p>The [Shadow’s Hall] looked very shadowish. It was made out of grey stone with simple, yet dignified engraving around the windows. Beyond the window was shrouded in darkness so unfortunately, the interior cannot be seen. The roof was painted in a dim dark green color and somehow, at the edge, gargoyles were placed there, looking like a western horror house that was rather out-of-place.</p><br/><p>And at the top, instead of an arc, a stupidly huge onion-like gate could be seen. 3 lines were engraved along the shape and at the very top, at the opening, Japanese were minutely craved.</p><br/><p>A magic circle.</p><br/><p>It seemed to be written in a clerical script-style font. It shouldn’t match with a Gothic-style house but somehow, it strangely fit. An ominous yet grandeur kind of feeling?</p><br/><p>Plus, dimwitted phrase like ‘Hide this Hall of Shadows’, ‘Look like a broken-down house’ and ‘Just a framework for the roof’ was written on it.</p><br/><p>Above everything else, right in the middle of the damn huge ass door,《Say Open Sesame! to open this door》was written.</p><br/><p>How surreal was this? But I don’t have the time to laugh and enjoy. I do not have the time to hold back.</p><br/><p>Taking a deep breath, I stood in front of the door with hands on my hip and shouted.</p><br/><p>“《けゴマ》! ”</p><br/><p>[TN: Yeah, you guys should know what this mean]</p><br/><p>Yep. I said that straight out.</p><br/><p>I did feel a little foolish.</p><br/><p>I mean, think about it. You are about to face a villainous assassination group of [Shadows] while shouting《Open Sesame》 at the top of your lungs!</p><br/><p>Don’t you think that was the meaning of foolish?</p><br/><p>When I was thinking about all that, the door opened smoothly, surprising silent as the mouth I used to eat dropped open.</p><br/><p>Hm.</p><br/><p>In that case, aren’t I Issun-Boshi? So be it. I touched the wall and created a thin sword before spreading my mana into it, strengthening it.</p><br/><p>[TN: One-inch boy folk tale. Wiki it.]</p><br/><p>Going along with the flow, I swung the sword and yelled.</p><br/><p>” THANK YOU FOR YOUR INVITATION! I HAD COME AS YOU REQUESTED, YOU BASTARD!! ”</p><br/><p>Then, a gigantic stairway appeared in front of me and, standing at the doorway, a large man that was playing with a wasp was standing there.</p><br/><p>” Wah! That was fast! ”</p><br/><p>….And he looked extremely shocked.</p><br/><p>” To think you would come before the preparations are complete! Hm, you are stronger than I thought. I am truly happy about this! ”</p><br/><p>‘In an instant, he drew close with a smiling face――――――!?’ was what I was thinking when he suddenly slashed at me.</p><br/><p>” uWah. ”</p><br/><p>Right away, I jumped away from that man and slid around to his back.</p><br/><p>” Yes, it has to be like this! ”</p><br/><p>The man laughed with ferocity as though satisfied as he turned around. His grin got wider on his reddish-dark skin as he declared to me.</p><br/><p>” You, the one I had been waiting for, the one with strength! ”</p><br/><p>With a look of ecstasy, the large man looked at me with conviction.</p><br/><p>……..I see, this guy was a battle mania.</p><br/><p>” Is it you bastard who send me the invitation? ”</p><br/><p>As a grin surfaced on my face, I enhanced my thinking speed, my strength, and my speed and hardened my defenses. At the same time as I was staring at Mr.Large, my brain was sectioning the place and creating a map.</p><br/><p>” It’s showtime! For my lord! ”</p><br/><p>” Sh…Showtime… ”</p><br/><p>I should not be bothered about that crazy pace of his.</p><br/><p>….I see.</p><br/><p>I slashed at the floor with all my strength.</p><br/><p>Crash, a huge noise rang out as a hole was created and the falling rubble showed that there was a space underneath.</p><br/><p>And, when I realized it, Mr.Large lifted his hand and moved it to his back, drawing something out.</p><br/><p>Slow-motion time. As the floor fragments fell, piece by piece, Mr.Large moved fluidly toward me, drawing near.</p><br/><p>” Try this! ”</p><br/><p>His swordsmanship was as if it was enchanting me.</p><br/><p>No, that was not a Katana…The thing Mr.Large pulled out in an instant was a large broadsword. Although I did strengthen myself, I cannot over-stress my body. And it was when I wanted to face his attack, I was attacked with a vicious chill down my back. Immediately, I did a huge jump back.</p><br/><p>” Your lord. Ah, your lord. You are a summoned beast. ”</p><br/><p>I just barely managed to respond slowly. I cannot show my anxiety.</p><br/><p>The floor I was standing on was beautifully and splendidly cut. There was no noise, as though he was slicing through the floor like tofu.</p><br/><p>It would be dangerous to not avoid that sharp-freaky slash.</p><br/><p>Unknown to Mr.Large, a huge amount of sweat was dripping down my back.</p><br/><p>What was this? Really, what was thiiisss?!</p><br/><p>” Hm. You avoided it. ”</p><br/><p>Please don’t say it as if you were saying ‘Ah, good morning. ‘. And don’t brandish your sword about in a gleeful manner! The body of Mr.Large who was swinging that large broadsword around was impressive. In addition, the floor was being cut like a swiss cheese.</p><br/><p>” What if I did not avoid that sharp sword? Don’t you think that’s unfair? ”</p><br/><p>I tried saying that with a casually smiling face but that was really dangerous.</p><br/><p>I really think that was a foul.</p><br/><p>As Mr.Large chased after me while attacking, one part of my multi-tasking brain caught a figure jumping out from underneath the cracked floor.</p><br/><p>“《ジャンプ》! ”</p><br/><p>[TN: Nidan Jump, 2 step jump]</p><br/><p>As I jumped to avoid the broadsword attack, I furthermore kicked the sky to propel myself higher as so to also avoid that shadow. I then stood at that height as I turned and faced the 2 of them.</p><br/><p>” It might be a foul. Why? Because he is the legendary disaster, high-ranking magical beast, Demon. ”</p><br/><p>The person who flew out, said, as he grinned at me. As though he was sneering and ridiculing me.</p><br/><p>” Welcome to my Hall of Shadows, William Beryl. Tonight, you shall have all the hospitality I can give. Since I had been in your care. ”</p><br/><p>And with that, 3 more shadows jumped out.</p><br/><p>” I would like you not to underestimate us [Shadows]. ”</p><br/><p>It was Zirco-san, Buu-san and Ivan-san, who lost the shine in their eyes.</p><br/><p>――――I do know how to deal with it though!</p><br/><p>” 《ジルコさんのの》《プースさんとイワンさんのも》！で、《３にをかけたげて》! ”</p><br/><p>[TN: 《Zirco-san no Reizoku no kubiwa kaijo》, Release Zirco’s collar of slavery. 《Buu-san to Ivan-san no mo kaijo》, Release Buu and Ivan’s too. De, and. 《Sannin ni kekkai wo kaketagete》Expand a barrier around the 3 of them. Phew.]</p><br/><p>Therefore, I activated my magic with a long chant that I hadn’t been using for so long. If I were to explain in terms of temperature, it was like the warmth of the sun as mana spread and wrapped around the 3.</p><br/><p>At the very same time as I activated my magic, the 3, whom leaped up towards me, lost their strength and started losing speed. They then fell towards the floor but no worries, my barrier was there to protect~ them!</p><br/><p>” Wh, what?! ”</p><br/><p>I ignored the [Shadow] standing in front of me as he muttered a line that those 3rd-rated villain part usually says. Rather, Mr.Large, the Demon, who sneaked up on me behind without a sound, was far scarier.</p><br/><p>Kyaaaaaaaaaaaaa!</p><br/><p>As I screamed in my heart while I flew forward in a bid to escape. Then did a somersault.</p><br/><p>No time to joke around.</p><br/><p>This time, the attack came from the Shadow-Guy, who was aiming for his opportunity all these while. Furthermore, I could see that his sword was smeared with poison. Unscrupulous! How unscrupulous! Poison on top of a pincer attack?!! What was this, how scary! Really scary!</p><br/><p>《》</p><br/><p>[TN: Kamaitachi, Razor wind, not the yokai. This time.]</p><br/><p>I activated it chantlessly towards the one I was facing. I released the invisible blades of wind towards the ‘Dangerous Target’, ah no, I mean the Demon.</p><br/><p>But.</p><br/><p>” Break! ”</p><br/><p>You got to be kidd~ing.</p><br/><p>The wind was slashed apart from the Demon’s swing of his broadsword. Don’t you find that weird? Stuff like air and wind was like the representative for stuff that can’t be cut!</p><br/><p>I had enough.</p><br/><p>But I will try my best and shoot another one in desperation.</p><br/><p>《の》</p><br/><p>[TN: Kyomu no Yaiba. The blade of void]</p><br/><p>I hated this magic because it was bathed in Chyuunibyo. The attribute-less crescent-shaped pitch-black blade that did not produce any light but instead simply, very eerily absorbed, strike at Demon.</p><br/><p>Attribute-less.</p><br/><p>This was a blade that totally ignored the laws of physics. A blade that doesn’t exist cannot be cut!</p><br/><p>” Break! ”</p><br/><p>Yep, it happened.</p><br/><p>This person cut it easily just liked that. Plus he did that by simply thrusting his sword at it.</p><br/><p>Trying to escape from the large broadsword, I sidestepped to the left, only for the sword, that was swung down half-way, to change its direction towards me.</p><br/><p>Thanks to that, I got stuck at doing a weird loopy-somersault-like jump in order to avoid it. Furthermore, in the midst of jumping, the Shadow-guy flicked his wrist at me and a dozen of small daggers flew towards me. I wondered if I should call those flying weapons or hidden weapons? It’s kind of those where assassins in fantasy often used. I was very sure those were all smeared with poison.</p><br/><p>Desperate, I deflected all the daggers with my sword. You know, the me right now was enhanced with accelerated thinking speed. What was with these people? Unbelievable.</p><br/><p>” Zirco-san! Really, that! What’s?! That?! ”</p><br/><p>I slashed and deflected the fluid attacks at me by the broadsword before managing to barely avoid the slash by Shadow-guy after noticing his attack through a gap. I knew the attack would come sooner or later but to really see it happening was a little surreal.</p><br/><p>Then, Zirco-san, who was laying flat on the ground, raised his voice.</p><br/><p>” High ranking magical beast – Demon. It was known to be the origin of disaster and its existence was said to be sealed a long time ago, even before Hattuo was founded and all details are unknown! ”</p><br/><p>《の》[TN: Mizu no Yaiba, Blade of Water]</p><br/><p>《》[TN: Kasen, Fire Arrow]</p><br/><p>《ぬーりーかーべー》[TN: Nurikabe, Invisible wall, another yokai, google it]</p><br/><p>Che, it was useless.</p><br/><p>I shot magic after magic but as expected, it was all cut down.</p><br/><p>” But that sword though. A sword that could cut through anything, even god. It likens as a [God Slaying Sword]. There was a legend about how it was really used to slay a god. ”</p><br/><p>The Shadow-guy then interrupted Zirco-san,</p><br/><p>” Destruction Devil, was what it is called. ”</p><br/><p>He shrugged with a face that found it all amusing before pointing to my back.</p><br/><p>” Demon, cut ‘that’ down. ”</p><br/><p>The finger was pointed at, it went without saying, the 3 of them.</p><br/><p>………What a really freaking unscrupulous bastard.</p><br/><p>◆◆◆</p><br/><p>TN: Hmm. Now we kinda got an idea who spidey thinks when he is battling someone.</p><br/>\n</div>"}