{"title": "090 – The Shadow’s Magic Tools & The Magic Language", "id": 102, "volume": 2, "url": "http://boxnovel.org/i-have-been-reincarnated-090-%E2%80%93-the-shadow%E2%80%99s-magic-tools-the-magic-language", "volume_title": "Volume 2", "body": "<h1>090 – The Shadow’s Magic Tools & The Magic Language</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>090 – The Shadow’s Magic Tools &amp; The Magic Language</p><br/><p>Posted on March 26, 2017 by crazypumkin</p><br/><p>Editor: Poor_Hero</p><br/><p>” …..Please show me the tools from the Hall of Shadows. ”</p><br/><p>I said to John-sensei nervously but he gave a consenting look at me.</p><br/><p>” ….True, you might know something since you’re Will. ”</p><br/><p>John-sensei then injected mana into a lock on top of a chest. Click, cluck noises sounded as it sprang open. John-sensei then thrust his arm deep into it.</p><br/><p>” There. Though it’s not supposed to be shown to others. ”</p><br/><p>Say that, John-sensei looked at me with eyes like I was his master, holding a bowl.</p><br/><p>A bowl of ‘food’.</p><br/><p>I stared at him with slightly reproachful eyes but thinking about it, of course he would show that kind of eyes. It was because even for all the researchers working in Elzmu’s castle, they might not even come up with 1 new spell in this lifetime. Which was why these kind of new magical tools were valuable to them.</p><br/><p>The tool handed over was shaped like a birdcage and had a magic stone embedded in the place where the bird was supposed to be. I opened the cage door and took out the stone, revealing the magic circle underneath.</p><br/><p>” …..eh? ”</p><br/><p>Simulating mana increase…?</p><br/><p>Looking at the dumbfounded me, John-sensei asked with a serious look on his face.</p><br/><p>” Will, do you know the meaning of this circle? ”</p><br/><p>Usually he would hide his interest well but regarding this, oh how John-sensei had fallen.</p><br/><p>” Yes. The carved circle had a magic to mimic an increase in mana. ”</p><br/><p>” I see….. The reason why the chief of Shadows had summoned beasts of higher mana than him following him was…. ”</p><br/><p>” Because of this tool, which gathered mana from the surroundings and forcefully pushed it into the user. ”</p><br/><p>Silence.</p><br/><p>Unintentionally, both of us looked at each other in silence. This was the only way one could increase their mana pool. It was not impossible, but very very very difficult to do.</p><br/><p>” This…. ”</p><br/><p>John-sensei groaned, stunned.</p><br/><p>” I think Spinel’s death was caused by this… ”</p><br/><p>As the truth was too shocking, I went into a daze. I rushed over, worrying if Spinel’s death was because of me but it was not so.</p><br/><p>To summon Demon, Spinel’s body was being used/eaten up. Even I did nothing, he would die anyway. Rather, it could be said that thanks to me draining his mana, he managed to live a little while longer.</p><br/><p>” ……ha.. ”</p><br/><p>A small sigh of relief leaked out.</p><br/><p>I was quite heartless, wasn’t I?</p><br/><p>I would never know what pushed him to do this, even disregarding his life, but knowing that he did it, gave me the chills.</p><br/><p>Even though everyone would die sooner or later.</p><br/><p>I was relieved. I didn’t know if it’s a good or a bad thing, but I was not a kid, overflowing with a sense of ‘justice’, who thought that all evil must be defeated as I knew that the world was not as simple. People didn’t usually produce a bright smile when they killed off an enemy like those of a superhero show.</p><br/><p>…But I wondered if I was as cold-hearted for feeling relief.</p><br/><p>” I am relieved. ”</p><br/><p>As all of that was going through my mind, John-sensei said that, folding his arms.</p><br/><p>” Relieved….? ”</p><br/><p>I mumbled reflexively and was directed a gentle smile.</p><br/><p>” Yes. As there is no need to worry about the threat [Shadows] posed any longer. ….Actually, I was worried if that [Shadow] was feigning death. ”</p><br/><p>John-sensei’s words struck straight through me. The complex and complicated feelings melted away.</p><br/><p>I see.</p><br/><p>Rather than being angry at the [Shadows], I was in fear of them. I did not see the body itself, that was why I had a lingering fear inside me.</p><br/><p>Even so, what tenacity.</p><br/><p>In this case, it might be easier to understand if I were to compare it to salt. It is already in our bodies ―――― let’s ignore the fact that different people have different mana pool ―――― it is alright to consume an appropriate amount but, using this tool, it was like drinking the entire bottle of soy sauce. When salt was overconsumption, salt levels for places other than the cells were raised, and in order to maintain the equilibrium, water would be extracted from the cells and dehydration would happen. Well, it was a bit different for mana but this comparison, to me, seemed to be the closest.</p><br/><p>To have a huge amount of mana forced into one’s body, the existing mana inside the body would be turned into a mess, causing the body to break down. The mana needed to summon Demon was forced into the body all at once so the body could not even resist.</p><br/><p>With this, I finally understood Spinel’s death.</p><br/><p>So that was why Spinel looked tired and his movements were a little sluggish during our fight at the Hall of Shadows. Rather, I felt admiration for him, for being able to move till that extent despite everything. But for the body to be eaten to that extent… was pretty disgusting.</p><br/><p>Instinctively, I shivered and hugged my shoulders as my eyes met with John-sensei, who had a frown on.</p><br/><p>” ……John-sensei, what is the matter? ”</p><br/><p>Sensei snapped his head up when he heard my question. Then, as though having made a decision, he turned and faced me.</p><br/><p>” Will, can I ask something? ”</p><br/><p>” Yes? ”</p><br/><p>” Chants and circles, they are a language, aren’t they? ”</p><br/><p>To the nervous me, the question was a simple one. Since that day I came clean about my magic to John-sensei, I had been dodging this question. And now, I had a feeling I could no longer avoid it.</p><br/><p>” ……. ”</p><br/><p>To the me who lapsed into silence, John-sensei said nothing as he continued to look at me. I could just say no. There were no doubt or suspicion in that pair of eyes that were looking at me, John-sensei must have already known it.</p><br/><p>If he were to know about it…</p><br/><p>Was I only worrying about myself? If you were to ask me if I trust John-sensei, I would say that he was the one I trusted the most, so there was no way he would use it to abuse that information right?</p><br/><p>The most he would use it for the sake of the country, but even I knew that was just me looking for an excuse.</p><br/><p>Right now, facing that question straight on, all I felt was an obscure sense of fear. No matter how I mocked myself for being stupid, I still felt it. I knew that I could just change, or admit my weakness, but even if I knew it in my head, I couldn’t help how I felt.</p><br/><p>How stupid.</p><br/><p>To think I even preached at Chiffon.</p><br/><p>In the end, I ran. I continued to avoid my eyes.</p><br/><p>Even if I have to accept it even if I cannot overcome it.</p><br/><p>I started laughing softly at the ridiculousness. I had asked to retain my former memories for the experience I had as so not to be hated in this life, and yet now I was attempting to avoid these experiences..Wasn’t I stupid?</p><br/><p>Now, I couldn’t help but started thinking. About the reason why I was reborn into this world.</p><br/><p>Questions started arising. I knew there were no meaning to it by now and I did sometimes think that gramps was a fool…..</p><br/><p>But still.</p><br/><p>The reason I was reborn into this world was of god’s (gramps) will. Even if it was because a vase fell accidentally, and I was here because this just so happened to be the world gramps was in-charge of.</p><br/><p>Yet such a trivial incident gave me a sense of relief every time I thought back to it. It gave me a strong and definite significance of why I existed.</p><br/><p>It was sometime I did not have in my previous life.</p><br/><p>The parents that accepted me.</p><br/><p>Not for what I can do, but for me.</p><br/><p>I came to know that there were a boundary line between others and me because I was keeping a secret. I was finally able to recognize it.</p><br/><p>” That’s right, John-sensei. ”</p><br/><p>But I can’t help but think.</p><br/><p>Why was it this world.</p><br/><p>Why was it this world where all chants and circles were in Japanese, and even the First Founder was a Japanese.</p><br/><p>There was way too much coincidence.</p><br/><p>I had to wonder if I was secretly blessed by that invisible gramps.</p><br/><p>And in that manner, my thoughts flew to a different place.</p><br/><p>” I thought so, Will. ”</p><br/><p>” Eh?! ”</p><br/><p>The moment John-sensei spoke, I landed back in reality in a snap.</p><br/><p>” What’s the matter? ”</p><br/><p>My heart thumped as I stared in amazement at him. But, it too, blew all of my complex thoughts away.</p><br/><p>” Not, nothing. …..Why did you think that? ”</p><br/><p>Pulling myself together, I faced Sensei.</p><br/><p>” The reason not being able to produce a new magic tool was because we had no idea if magic was a language or not. ”</p><br/><p>At this, I finally understood why John-sensei asked me that question now.</p><br/><p>” But, more than that. ”</p><br/><p>John-Sensei face grew serious.</p><br/><p>” If magic were to invoke without even knowing the effect, an extremely large amount of mana was required. Usually it wouldn’t even activate, and if forcefully activated, it would totally drained the caster’s mana and killed them. ”</p><br/><p>With a snap, John-sensei’s sharp eyes looked at me.</p><br/><p>” We have no way of knowing if these tools were passed down from generations to generations within the [Shadows] or if it was created just for this incident’s summoning. ”</p><br/><p>Sensei took a breather, before continuing.</p><br/><p>” If it was newly created, the number of victims (guinea pigs) will be unfathomable. ….A one-man team will not be able to do it. ”</p><br/><p>◆◆◆</p><br/>\n</div>"}