{"title": "101 – Ivan’s New Life (First)", "id": 113, "volume": 2, "url": "http://boxnovel.org/i-have-been-reincarnated-101-%E2%80%93-ivan%E2%80%99s-new-life-first", "volume_title": "Volume 2", "body": "<h1>101 – Ivan’s New Life (First)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>101 – Ivan’s New Life (First)</p><br/><p>Posted on May 6, 2017 by crazypumkin</p><br/><p>Edited by Poor Hero</p><br/><p>In the dark and humid weather that even flattery cannot save it for what it was, a man was glaring at the sky with a complicated expression. He was not planning to glare, but his face just made it seemed like so. And at that moment, he was trying to give up on feeling sad.</p><br/><p>However, simply the sight of him was screaming with a tragic aura. A man used his aura to speak.</p><br/><p>” My Willia-chan…..does not exist… ”</p><br/><p>The man, who spoke like tears were going to spring from his eyes any moment, was none other than Ivan. The man whom Will had mistaken to be filled with justice and truth, the former thug-like Hattuo soldier, Ivan. And that the moment where Ivan was glaring at the sky, Will was in Phyllis Academy having a meeting for the Swimming Tournament.</p><br/><p>How empty.</p><br/><p>The angel (Willia-chan) who saved him from the sluggish-life was a sham.</p><br/><p>…..This loss had sunk Ivan’s heart to the very bottom. Even though moving south from the freezing Hattuo had warmed his body, the surprising situation had not been warm to his heart.</p><br/><p>He had lost one of the most important things in his life….!</p><br/><p>Ivan lifted his downcast eyes up towards the sky again, glaring at it. The important thing in his life had slipped out from under his fingers while he was not paying attention.</p><br/><p>” We are reaching the Beryl’s territory. ”</p><br/><p>” …….Yea. ”</p><br/><p>The person driving the carriage spoke to Ivan. Towards Buu, Ivan gave an empty response, as if life was draining out of him. As Ivan was looking at the sky, all that can be seen was the white of his eyes.</p><br/><p>Scary.</p><br/><p>Luckily, no one was around to see this expression of his, otherwise he would lose another important part of his life.</p><br/><p>Beryl’s Territory.</p><br/><p>Ivan’s lifeless brain was turning. If he remembered correctly, Willia’s real appearance, Will, had said that he was someone from the Beryl’s family. So even Willia was a fake name. In the end, he was tricked into allowing her/him to enter Hattuo illegally. But even so, Ivan was not angry at that.</p><br/><p>Only sadness as it swirled around in his heart.</p><br/><p>She was so cute. Even when he quit cross-dressing and cut his hair short, he was still cute! Damn itー.</p><br/><p>Thinking till this point, Ivan fell onto his back. His trail of thoughts went all over the place. Although ‘really remarkable’ and ‘duke’ flashed in his brain for an instant, but before he knew it, it became the problem of how cute Will was.</p><br/><p>And now, he was like the last time when he was rotting in despair. He had to change before he met up with his angel the next time.</p><br/><p>Although now, he was rotting in another way…. he can’t. Ivan’s guts that hardly ever worked was warning him. Plus, to chase after Will as the fake Willia’s shadow was rude to Will.</p><br/><p>And Ivan reached a conclusion.</p><br/><p>Every crisis was a chance. He was fortunate to be given a chance to change. Was what Ivan thought but it was rather difficult to change his thinking after thinking about his angel (Willia-chan).</p><br/><p>It can’t be helped. Laying in the carriage, Ivan closed his eyes.</p><br/><p>◆</p><br/><p>Clip and clop and the horse carriage stopped. Ivan, who was nodding off to that sound, woke up. Shaking his head lightly, he stretched his body.</p><br/><p>” Ugah. ”</p><br/><p>Of course, the one who said that was Ivan. It seemed like he had slept in an awkward position and his neck was locked in a weird position. Buu, who saw Ivan, was stunned. Was he going to be all right? Although he was feeling unease, in a certain sense, ignorance was the strongest of them all. Even if they were on their way to meet the only Duke in Elzmu, he can’t see any nervousness from Ivan and he was even groaning from the pain in his neck.</p><br/><p>Plus, all those who received training from the Beryl’s house, no matter how rowdy or incompetent they were, they would emerge quite ‘usable’ to others. Although the reason was unknown. Luckily, Buu-san was very ‘usable’ from the start so he did not have to undergo ‘training’ but…..</p><br/><p>That was 1 year ago.</p><br/><p>A brat, with his rude attitude that ought to be locked up in jail, had attended the examination to become Beryl’s family vessel serving directly under Gion….. The word brat was said but he was quite old……. That violent guy who went ” What strongest Knight in the country! He must have bribed his way in anyway! In 2 years, this would be under my control! ” as he went around yelling, was speaking politely while smiling refreshingly as a newbie knight just after 1 month when Buu-san went back to discuss business with the Beryl’s.</p><br/><p>” ……It is to be feared…. ”</p><br/><p>Buu had said his thoughts out aloud. Ivan was, as usual, happy-go-lucky, worrying about his neck instead.</p><br/><p>” …..Mah, I’ll just leave it to fate… ”</p><br/><p>Buu was only thinking of escaping from this situation as soon as he could.</p><br/><p>◆</p><br/><p>Buu, walking unusually fast, was followed by Ivan, who was looking around restlessly. He was wondering about it when the carriage was stopped at the gate but the scene in front of Ivan made him understood.</p><br/><p>There were stalls lining up on the left and the right of the street, merchants were calling out as they tried to attracted customers. Multicolored items lined on the shelves and they were all items Ivan had never seen before.</p><br/><p>And on this street that they were walking on, children were holding hands with each other when they ran about, laughing, aunt… wives were standing around as they gossiped. There were a lot of people walking to and fro.</p><br/><p>Ivan, who had his mouth wide opened as his eyes darted around, was looking just like a country bumpkin who had visited a city for the first time. At times, voices shouting ‘Welcome!’ to him could be heard from the stalls.</p><br/><p>Ivan jumped when it happened. No one seemed bothered about him, who was always seen as a thug, with his face. When he was in Flowason, everyone would hide the moment his eyes met theirs. But.</p><br/><p>” O, oi, Buu-san! ”</p><br/><p>Ivan called out to Buu without thinking.</p><br/><p>” Hmー? What’s upー? ”</p><br/><p>As the slow response that dragged out every word came, Ivan panicky pointed to a place.</p><br/><p>” That is a menu right?! And the thing underneath is the price I think…? ”</p><br/><p>On the counter of a food stall, several notes were seen. It was the money paid by children for the order they made but the owner did not seem like he was giving any change back.</p><br/><p>” …..Such young brats can already read and calculate? ”</p><br/><p>” Of courseー. ”</p><br/><p>Although he had expected it, but when Buu said that answer, Ivan was overcome with astonishment.</p><br/><p>” Shit….. I, I can’t even win against brats… ”</p><br/><p>The small mumble by Ivan who was looking at the sky again was left seemingly unheard by Buu. With a smile, Buu continued talking.</p><br/><p>” It’s not only reading and mathー. Almost everyone here knows how to use magic. ”</p><br/><p>Another critical hit.</p><br/><p>Ivan’s shoulders slumped as his soul was left half floating out of his mouth. Thanks to that additional damaged by Buu, they had reached a door before he realized it.</p><br/><p>” This hereー is the Beryl’s residence. ”</p><br/><p>Without hearing everything, Ivan’s jaw dropped opened.</p><br/><p>What was this place.</p><br/><p>What was this?</p><br/><p>Wasn’t this bigger than the border gates of Flowason?</p><br/><p>There was already no more space in Ivan’s head for new information. A huge amount of ‘WTF’ was taking up the space there.</p><br/><p>” Today, Ivan-dono would be working here under Will-dono’s recommendation so we will be meeting Gion-sama for your greetings first. ”</p><br/><p>That was why, Buu’s words were all in the left and out the other. As Ivan was totally overwhelmed by the imposing aura of the 3-stories high gate, Buu started walking.</p><br/><p>Reaching the side, Buu was saying something to the gatekeeper. Immediately, a side door opened. Ivan, who was in a trance, was half-dragged by Buu through the gate as the gatekeeper saluted them.</p><br/><p>◆◆◆</p><br/>\n</div>"}