{"title": "102 – Ivan’s New Life (Last)", "id": 114, "volume": 2, "url": "http://boxnovel.org/i-have-been-reincarnated-102-%E2%80%93-ivan%E2%80%99s-new-life-last", "volume_title": "Volume 2", "body": "<h1>102 – Ivan’s New Life (Last)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>102 – Ivan’s New Life (Last)</p><br/><p>Posted on May 6, 2017 by crazypumkin</p><br/><p>Edited by Poor_Hero</p><br/><p>TN: Here’s another one! I’ve fulfilled 2 chapters per week. Phew. Off to bed!</p><br/><p>” Thank you for coming all the way here, Buu-sama, Ivan-sama. ”</p><br/><p>A beautiful aunt…. lady was standing in front of the door. As there was quite a distance from the gate till the front door of the mansion, Ivan had enough time to regain his footing. When he thought to himself that he would not be surprised by anything anymore, a beautiful lady such as her, standing in front of him was shaking his resolve.</p><br/><p>Or rather, it was within his expectation. It was not possible for the place where the very cute Willia-chan lived in to not have any beautiful people inside.</p><br/><p>A very ridiculous way of reasoning, but luckily, it was not wrong.</p><br/><p>” Mary-dono, I have brought Ivan-dono along. ”</p><br/><p>” Yes, thank you very much, Buu-sama. I have heard it from Master. It seems to be a personal recommendation from Will-sama. I was ordered by Master to lead Ivan-sama to his office when he arrives but… Does Buu-sama have any arrangements after this? ”</p><br/><p>The lady’s name seemed to be Mary. Buu, asked politely and gracefully by Mary, shook his head.</p><br/><p>” People from the company will start to look for me so I would most like be heading back. ”</p><br/><p>” I understand. Once again, I thank you for today. We have troubled you to come all the way here. ”</p><br/><p>As Ivan’s head was filled wondering what the word ‘office’ meant, Buu was seen off by Mary with a graceful bow.</p><br/><p>It was too late when he finally realized it.</p><br/><p>When Ivan snapped his head up, only a smiling Mary and him were left.</p><br/><p>” Well Ivan-sama, please come in. ”</p><br/><p>Mary opened the door with a smile for the dazed Ivan.</p><br/><p>” Uwah……!? Ye! Yes! ”</p><br/><p>Producing a weird sound at how ‘sama’ was attached to his name, he somehow had goosebumps appearing all over when he saw Mary’s beautiful smile and immediately gave a response that he thought he had to do.</p><br/><p>And on the other side of the door, laid the softest carpet Ivan had ever saw in his life. As his heartbeat broke the highest record, Ivan stepped timidly inside.</p><br/><p>Squish.</p><br/><p>” …….!? ”</p><br/><p>His shoes sank in. Ivan swallowed the weird sound he was about to make into his stomach. He was suddenly very self-conscious about the dirt on his shoes. The sound of a door closing behind him was heard. Ivan thought that was a roar of a magical beast.</p><br/><p>But, the smiling Mary had rapidly proceeded ahead. He could only give it up. Mustering his courage, Ivan took a step forward.</p><br/><p>Paintings were hung on the walls of the long corridor. Every few meters, there would be a hole in the wall where plates and flowers were decorated.</p><br/><p>How much do all these cost?</p><br/><p>That thought flashed passed Ivan’s brain but his instinct told him it was something he should never think about. He then tried his best to only stare at Mary’s back as they advanced forward.</p><br/><p>After following Mary for a while, she stopped. It was just about a minute or so but to Ivan, hours had passed. He felt like he had sweated quite a bit. When he looked up, he saw Mary knocking on a door in front of them.</p><br/><p>” Master, I have brought Ivan-sama. ”</p><br/><p>” Enter. ”</p><br/><p>From the thick, black, solid wooden door, a refreshing voice was heard. Ivan’s shoulders jumped. When he looked at Mary, asking for what he should do, she opened the door without any hesitation and stood outside.</p><br/><p>” ……Eh? ”</p><br/><p>When a small voice was leaked out by Ivan, Mary spread her arm through the door. Was she telling him to enter by himself? The world sure was heartless. Till now, Ivan had somehow maintained his calmness by only focusing on Mary’s back.</p><br/><p>But he could only obey. With a face that could burst into tears any moment, Ivan passed through the door.</p><br/><p>The first thing Ivan saw after he entered the room was the tall mountains made of papers. Or rather, it was filled with the mountains of papers. No, although when he calmed down, he could see the red carpet and the flat table but the main thing was still the papers. Question marks started appearing in a row on top of Ivan’s head.</p><br/><p>” Please stand just there. ”</p><br/><p>When he entered when Mary told him to, he slowly and carefully walked forward, resisting the urge to kick the mountains of papers, a voice then called out to him beyond the mountains.</p><br/><p>” Ye, yes. ”</p><br/><p>Although it was a youthful and gentle voice, Ivan felt like he needed to obey the voice, as he spurted out a response. Let’s just think the stuttering to be the respect for the voice.</p><br/><p>Ivan, who panicky stopped moving, suddenly recalled the conversation between Buu and Mary.</p><br/><p>” I was ordered by Master to lead Ivan-sama to his office when he arrives…. ”</p><br/><p>Was what Mary said. So it meant that the Master of the house was in here somewhere. It was the Master of this wonderful mansion. It must be a very distinguished person.</p><br/><p>Ivan corrected his posture hurriedly. And then, the voice just now. It was from beyond the mountains of papers. It had directed him to this spot where he was standing at this very moment.</p><br/><p>” Yes yes! ”</p><br/><p>In a smooth and fluid movement, he prostrated himself. He was sure the voice from beyond the mountains of papers was the one and only [Master]. Unfortunately, Ivan, who came from a country that discriminated beastman, had not even considered the personality of [Master], and had already deemed him to be a very big-wig.</p><br/><p>That was the aura he felt the moment he entered the room. An aura even the vulgar Ivan would feel. All these went through Ivan’s mind as he lay there, forehead touching the ground.</p><br/><p>” ……Huh? ”</p><br/><p>In this chaos, Gion’s troubled voice would be heard.</p><br/><p>◆</p><br/><p>” Ha ha ha ha ha…. ”</p><br/><p>Gion wiped the tears from the corner of his eyes as he hugged his stomach. He laughed too hard. The lack of oxygen had caused his fingers to shake a little.</p><br/><p>On the other hand, standing in front of the laughing Gion, was Ivan, with his head hanging down, face totally red.</p><br/><p>” …..I thought this was what you need to do here…. ”</p><br/><p>Hearing the words Ivan mumbled, Gion’s shoulders shook even harder. Unable to stand it, Ivan covered his face with his hands.</p><br/><p>Ivan, who was beginning his new life in Beryl’s territory, looked like it was going to be smooth sailing ahead.</p><br/><p>◆◆◆</p><br/><p>TN: I typed ‘mountains of papers’ 5 times. Could it more if I haven’t controlled it.</p><br/>\n</div>"}