{"title": "133 – Beryl’s Street", "id": 145, "volume": 2, "url": "http://boxnovel.org/i-have-been-reincarnated-133-%E2%80%93-beryl%E2%80%99s-street", "volume_title": "Volume 2", "body": "<h1>133 – Beryl’s Street</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>133 – Beryl’s Street (Ivan’s POV – Second Half)</p><br/><p>Posted on October 1, 2017 by crazypumkin</p><br/><p>*Unedited</p><br/><p>After knowing their schedules and groups, all the novice knights took the extra time and care to go over the area where they were going to patrol on that day.</p><br/><p>All this enthusiasm stemed from how this was their first big mission that was tasked to them. Although this mission won’t let them shot to fame overnight, they were all youngsters who had a strong sense of justice which resulted in them becoming a knight.</p><br/><p>They were not taking this lightly and instead, viewed it as a way to offered their help to the citizens. Ivan too, was fully into it as well.</p><br/><p>Although he used to be such a thug-like soldier in Hattuo, the reason he became one was due to his childhood dream of being a help to others. Overwhelmed by the sense of helplessness and despair when he realized the true face of what a soldier meant in Hattuo made him spiraled into the wrong path.</p><br/><p>Anyone would grow if given the chance to start over. Thanks to having this regret in his heart and knowing how helpless he once was, Ivan had the strength to give it his all right now. That was because he knew how easily it was to fall since he experienced it before.</p><br/><p>Anyway, in simpler words, Ivan had been stalk…. patrolling the Icris street where the food cart would be at, everyday after his training. Let the matter where he was almost brought in for questioning by his sempais be kept a secret.</p><br/><p>Because, in the dimly lit evening, wasn’t it very suspicious for a man to simply be walking to and fro along the street everyday? It was really not because his actions looked creepy or his looks was so astonishingly villainous. Ivan thought, persuading himself strongly.</p><br/><p>He had a thought about why was he singled out when the rest of the novice knights were doing the same thing but the answer came almost immediately.</p><br/><p>Yes, it’s the difference in age.</p><br/><p>Ivan was a lot older than the rest of the novice knights. Imagine a youth hanging at the street as compared to a middle-aged man. If one were to ask if who would looked suspicious, everyone would mostly likely point towards the latter. Yep, that’s it.</p><br/><p>And so, the day before the festival arrived. Carts were already lined up along the Icris street. People were coming and going. Among them, there were many who were merchants but the beastmen numbered quite many too. Ivan used to look down upon them before but not now. Because he came to know that what Hattuo had taught them were all bullshit.</p><br/><p>Why, in the first place, was beastmen being looked as being inferior when they could traveled through the [Demon Forest] by themselves while pulling their goods along?</p><br/><p>Even he marveled at how ignorance could turned him into an idiot. Nothing in the world sure is more dangerous than ignorance. It was almost a crime.</p><br/><p>The citizen in Hattuo can’t even compared as they can’t calculate, nor use magic, nor had strength worthy of a beastmen. What made them think they were superior?</p><br/><p>Once Ivan went out and saw the world, he knew it was simply them being jealous. Earlier, he told Will-Sama about what he thought and Will-Sama had smiled wryly as he told him things. That how everyone had this kind of thinking and that was why education was so important. And when Ivan asked Will-Sama what did he meant by that, he said that humans were beings that felt happy when they placed others below them.</p><br/><p>If it was the old Ivan, he would not understand it meant but now, he knew. It was like the case where slums were placed as so to let the normal citizens feel fear from revolting against the authorities while keeping them satisfied that they were slightly on the higher level.</p><br/><p>Hattuo was a place where it was bitterly cold during winter that no crops could grow, came with high taxes, and where the nobles who did nothing acted all high and mighty. In a word, the worst place to lived in. But still they did not think they were at the bottom rung as that was where the beastmen were.</p><br/><p>And it was because the citizens can’t used magic, that’s why they thought that the nobles were amazing. They can’t calculate, that’s why they do not realized just how much taxes they were paying. They did not know the strength of beastmen, that’s why they looked down upon them. They did not know the correct usage of money, that’s why they did not know the greatness or the difficultly of being a merchant. All of it was thanks to ignorance.</p><br/><p>That was why, to Ivan, ignorance was a crime.</p><br/><p>The entire world and truth were all blocked from their eyes. Ivan never wanted to returned to being someone like that again.</p><br/><p>After his shift, he returned to the Icris street, full of zeal. One of his hand was tightly gripping onto his wallet. There was rumors that, in turn for the knights who were unable to enjoy the festival on the day itself, the street would be opened exclusively for them the day before the festival.</p><br/><p>Ivan wiggled his nose as drool was threatening to dripped down his mouth as he looked at all the carts. He was determined not to lose to his appetite for food.</p><br/><p>◆</p><br/><p>And finally, it was the day of the festival.</p><br/><p>As a knight, Ivan had done his best. He had conquered the food cart. Everything was delicious. It was so addicting that he went for seconds over and over again. That was dangerous. Now he knew why there would be chaos over the food cart.</p><br/><p>As the B-grade gourmet food cart had long snaking queues everyday, he hadn’t had the chance to tried their food and simply can’t understand why everyone was rushing over to get a taste.</p><br/><p>But, thanks to his ‘investigation’ beforehand, his outlook changed. Doing prior investigation was important. He would definitely visit the next time he had the time. He swore on the organ below his heart. No, he’s not going to say ‘stomach’ because it was just so uncool.</p><br/><p>The patrolling of the street was unusual to say the least. One hour before and after the fireworks show was all spend on directing the crowds.</p><br/><p>Ivan had a suspicion and he was right. During the entire time from the start of the fireworks show to during the show, people kept coming that the entire street was almost overflowing. As the waves of people kept coming, knights stood at the side of the street as they directed the flow of the crowd, building a small stage at the crossroad as so to stand out from the crowd and let people see their directing. They even used voice-enlarging magic tools to make sure everyone heard them. The area they build for lost kids played an extremely active role as well.</p><br/><p>Although this was the first festival, everything went so smoothly that it looked like this was how it should be. Ivan wondered what would happened if Will-Sama did not came up with all these ideas.</p><br/><p>The small stage at the crossroad, the area for lost kids, as well as the ‘loudspeaker’ magic tool, were all suggested by Will-Sama before the start of the festival. Gion-Sama had a doubtful look when it was first suggested and so did Ivan. But it ended up being the correct way.</p><br/><p>As expected of Will-Sama.</p><br/><p>In Hattuo, ‘festival’ meant people from the same village would cooked food that they got from their harvest so this was a surprise to Ivan. But when he asked Scott, who was working with him at the home for lost kids, it was different.</p><br/><p>” A festival is where everyone enjoy good food, wine and dance together, idiot! ”</p><br/><p>” Ah… So it was really different.. ”</p><br/><p>Elzmu brilliance once again broke Ivan’s common sense.</p><br/><p>” Even so, is ‘Fireworks’ that amazing? ”</p><br/><p>Ivan asked again. ‘Fireworks’ was something that did not existed in Hattuo so he could not even began to imagine what it was. So many people came just to watch and it was even said to be the ‘traditional arts’ handed down by the Elzmu’s First Founder. His anticipation grew bigger.</p><br/><p>” Ah, I have never seen it before so… But those who had seen it before are the rare ones, you know? It’s just a little something at some noble’s parties. ”</p><br/><p>” Eh, is that so? Then why is there such a crowd… ”</p><br/><p>” It’s the event where the recently famous for their unique toys [Toys Love] company, the huge and old fashion brand [Unislo] and all the big and famous shops, not to mention the fiercely in-the-trend-now B-grade gourmet food [Kuma Neko Private Limited] are in! It is not only about the fireworks you know! Rumors said that all these companies owed a favor to someone who was doing something new so they all came in and join this event! ”</p><br/><p>Scott bellowed. Ah, Ivan finally gotten it. As expected of Will-Sama. Toy, clothing, even food. A person who will bring about a revolution was trying something new so they all came.</p><br/><p>And right now was just nicely…</p><br/><p>” And now is just right in the middle of the summer holidays. ”</p><br/><p>Ivan mumbled. This was that person’s attraction. His first try had resulted in this polished finishing and even people flocked over to helped. Plus Will-Sama handmade fireworks were gorgeous. Everyone that came are going to come again the next year and it was rumored that the scale of the festival next year was going to be bigger too.</p><br/><p>Will-Sama was Will-Sama. He had planned that far into the future.</p><br/><p>” Maybe it’s because it’s Will-Sama….. ”</p><br/><p>Ivan was completely exhausted after jostling with the crowd for an entire day. But there was no helping it because this was an event planned by Will-Sama.</p><br/><p>And today was the day where Ivan’s feelings was finally in synced with all the rest of the knights.</p><br/>\n</div>"}