{"title": "128 – Our Savior (First – Gurus POV)", "id": 140, "volume": 2, "url": "http://boxnovel.org/i-have-been-reincarnated-128-%E2%80%93-our-savior-first-%E2%80%93-gurus-pov", "volume_title": "Volume 2", "body": "<h1>128 – Our Savior (First – Gurus POV)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>128 – Our Savior (First – Gurus POV)</p><br/><p>Posted on September 3, 2017 by crazypumkin</p><br/><p>*Unedited</p><br/><p>It had been 10 years since Gurus entered this company. It was just like yesterday when the 15 year old him had decided to work in this company, thought a tired and weary Gurus as he clothed his tired and weary body.</p><br/><p>” Sigh….. ”</p><br/><p>He let out a deep sigh. The company chair he sat onto made a weird creaking sound as if accompanying him. He had thought that he gotten used to it but still, it strike him deeply. In this small company where he was the only one working in the sales department, there was no one he could shared his troubles with.</p><br/><p>The company Gurus was working at was a company that creates [Fireworks].</p><br/><p>After seeing the fireworks at a Noble’s dinner party, the young him then decided that he would enter into this industry. But unknown to him, the fireworks industry was a really tiny place that was about to head into extinction.</p><br/><p>After he found out about that fact, he vowed that he would spread the beauty of fireworks all over the place and bring this industry back to life. But real life had not been that easy.</p><br/><p>And today too, had another party organizer that went ” I had never used fireworks nor do I know what’s the reason for it. Besides, what exactly is fireworks? “. And when Gurus answered that it was something akin to seeing brightly lit flowers blooming in the sky, he got back a response about why can’t they use magic instead and was directed a rude look. Plus, fireworks were not exactly cheap just to try to see how it would go.</p><br/><p>He was about to give up.</p><br/><p>The only reason why the company was still holding on was because this was the company that the First Founder himself passed the technique onto. It had a feeling of being a traditional art form.</p><br/><p>It was not like the company was in debts, nor was it heading for a decline. But even so, to be existing on such a thin and fine thread was not something Gurus would like.</p><br/><p>He wanted to convey the beauty to every citizen and let them know the how splendid fireworks would be.</p><br/><p>” I’m really at my end…. ”</p><br/><p>He said weakly. And at this exact moment. Jingle Jingle. Sounds were heard coming from the metal bell hanging outside the door. And there was only 1 person who would ring it.</p><br/><p>” A customer….?! ”</p><br/><p>Jumping onto his feet, an unbelievable Gurus rushed to answer the door.</p><br/><p>◆</p><br/><p>Disappointment enveloped him when Gurus first opened the door.</p><br/><p>Yes, because the one standing in front of the door was a very young boy. Ah, he must had either got the wrong door or was simply playing a prank…. But even as he thought that, Gurus put on a professional smile and started his [Sales] attitude.</p><br/><p>As not to give a bad impression by being angry, Gurus tried hard at suppressing his sigh and directed a huge smile at the boy.</p><br/><p>” Hello, is there anything I can help you? This is a fireworks company so… ”</p><br/><p>” Ah, so I was right! Thank god. I saw no one being around so I was worried if I got the wrong place. ”</p><br/><p>But words that came out of the boy’s mouth overturned all of Gurus’s assumptions. The boy spoke in a clear and polite tone so it did not look to be a prank. Plus, he said he was looking for this place.</p><br/><p>Did he came over for an errand from his parents? Realizing that, he looked closely and found out that the boy was wearing clothes of fine quality and his attitude was calm and steady.</p><br/><p>Maybe he was not running an errand but was instead an apprentice from another company. After all, he did not looked to be of school age so maybe he was learning something in advance to prepare for his future.</p><br/><p>” So, so you had been looking for our company! I apologize, I went out for a moment. Please, please enter. ”</p><br/><p>Suddenly, Gurus throat felt parched. This could be something big. For the sake of the company’s future, he need to at least sell something. This might be a big company that could even afford to let such a young boy to deal with something like fireworks. It was his duty to give a good impression.</p><br/><p>Leading the boy into the parlor deep inside the office, Gurus took a deep breath.</p><br/><p>◆</p><br/><p>Gurus was stunned. He had decided to lay down a good impression as so to form a connection with the company in prepare for further collaboration.</p><br/><p>………. What was happening instead?</p><br/><p>” So, how much would it cost if I am planning on firing about a million shots of fireworks? ”</p><br/><p>After some small talk with the boy, he headed into ‘business talk’ and that was the very first sentence that came out.</p><br/><p>” ……Huh? ”</p><br/><p>That just came straight out from Gurus’s mouth as he froze but he was pretty sure anyone would had the same reaction as him. This was a world where double digits would be considered big.</p><br/><p>And what did this boy said?</p><br/><p>A million.</p><br/><p>He said a million.</p><br/><p>Gurus immediately came to his senses and as he began to ask for details, his heart was pounding frantically.</p><br/><p>Staring at the boy in front of him, Gurus found out that he looked to be about 6, with soft and silky sliver hair and facial features that looked like an angel. A very very cute boy.</p><br/><p>Why had such a boy… came here specially to carry out such a fraud!?</p><br/><p>Gurus did not care if anyone laughed at him for being serious with a kid but he was indeed furious. He had hope. And it turned out to be a prank.</p><br/><p>I mean, a million shots. It was not a number a company could come out with, normally. Even if it was real, it would most definitely not be handled by a kid.</p><br/><p>But, all the way up till now, the prank had been quite well done. After all, this was a prank thought out by a kid. Gurus stood up, trying his best in suppressing his anger. This was where he had to show the solemnity of an adult.</p><br/><p>” Boy, I know playing pranks is a kid’s job but there are some things you can’t do no matter what. ”</p><br/><p>” Wh, what? ”</p><br/><p>He said something cool. Gurus stood up straight, waiting to be praised. Look, the boy was bewildered. He must be thinking that he was exposed.</p><br/><p>” There are some pranks that are not funny. Not everyone could laugh can let you off the hook. ”</p><br/><p>Gurus said amiably.</p><br/><p>” …..Huh? ”</p><br/><p>This time, it was the boy who was flabbergasted. Will can’t helped by smiled wryly.</p><br/><p>Getting angry at a kid would do nothing in teaching him what’s wrong and right. The correct way was to let a kid know what he was doing and how was it going to affect people.</p><br/><p>One had to correctly lead and guide a kid to what he should do.</p><br/><p>―――――――― Was what Gurus had read in [Essential Points For Good Communication!] book.</p><br/><p>I am so cool.</p><br/><p>And Gurus suddenly realized it. The stunned boy had since changed expression and was looking at him. And that expression… was it resignation, or comprehension? It was a subtle expression that a normal 6 year old kid can’t pulled off.</p><br/><p>” Ah, that was thoughtless of me. Of course you would think this is fraud or a prank. What to do… ”</p><br/><p>The boy guessed correctly what Gurus’s had been thinking and seemed to be blaming himself for a mistake he had done. The adult-like way of talking threw Gurus into another loop.</p><br/><p>” It would take a long time to explain till you would believed me so I shall stop it here. I would be coming back on another day then. ”</p><br/><p>The boy said with a smile. Dazed, Gurus led the boy outside before slumping onto his chair.</p><br/><p>Come to think of it, do a kid used such polite language? No matter how Gurus thought, it was not normal. Plus that adult-like expression and speech.</p><br/><p>He did thought that it was just an excuse to ran away but he was not convinced. Because that boy had no look of embarrassment but instead, confidence.</p><br/><p>” Another day…. ”</p><br/><p>Gurus muttered to himself. If that was real, the boy would most likely bring some form of prove along. A prove that the order of a million shots… however unbelievable it was, Gurus was starting to believed it.</p><br/><p>Could this be the start of something big, Gurus thought as a smile crept onto his face.</p><br/><p>◆◆◆</p><br/><p>TN: I’m on a roll with this despite wanting to do other stuff instead. These random inserts of POV refresh me. I got it done in about an hour. Enjoy. I’m off to studying then.</p><br/>\n</div>"}