{"title": "132 – Beryl’s Street", "id": 144, "volume": 2, "url": "http://boxnovel.org/i-have-been-reincarnated-132-%E2%80%93-beryl%E2%80%99s-street", "volume_title": "Volume 2", "body": "<h1>132 – Beryl’s Street</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>132 – Beryl’s Street (Ivan’s POV – First Half)</p><br/><p>Posted on September 24, 2017 by crazypumkin</p><br/><p>*Unedited</p><br/><p>Those who attended the Fireworks Festival had said this.</p><br/><p>Instead of the expected bouquet of flowers, they saw a field of flowers blooming in the sky instead.</p><br/><p>◆</p><br/><p>Ivan, a former Hattuo soldier whom Will had brought back to the Beryl’s territory, underwent a series of strict and intense training, and finally became a part of the White Knights. ‘Finally’ was used, but it had only been about a month. From that, one could see how much effort Ivan had put in.</p><br/><p>Here, the feudal lord and Duke was Gion, who was the leader of the White Knights as well. And although the White Knights were situated all over the country, the main subdivision was here and was personally lead by Gion.</p><br/><p>Ivan had aimed to became someone who would proved useful so he was really thankful towards Will who gave him the chance to honed his skills in such a good environment. Truthfully told, this sort of thing was highly impossible if not for Will as what Gion hated the most was flaunting of one’s status to get into the Knights.</p><br/><p>Which was why Ivan, a thug-like soldier from Hattuo, gave his all in undergoing training in order to raised his level to match the elites of the elites of the Knights as well as manners that would not embarrassed the status given, all the while using the memories of Willia-Chan (Angel) or Will as his driving force. And thus, due to the intense training, Ivan had lost a little of his feelings as he graduated and rolled out as a novice knight, surrounded by youths younger than him.</p><br/><p>―――――――― And, as he went on his rounds as a novice, summer came and that happened.</p><br/><p>For some reason, Ivan and the rest of the novice knights were called into attention by Gion. They were to assembled in the evening, when their training just ended. Ivan, who was scheduled to do patrolling, headed towards the training grounds after his shift.</p><br/><p>At the training grounds, those who finished their training were already gathered there. And it was a tragic sight. There were those with deathly pale faces, those who could hardly stand, some who had drool dripping from their mouth as their eyes rolled up, and some who, with blood-shot eyes, were practicing their swinging. It was pitiful, looking like a picture of a certain level in hell. But above all, it stunk of sweat. Miserable to the end.</p><br/><p>But Ivan took did not take any notice at that scene but instead had a pondering look on his face. He was fine because he was arranged to go on patrol after the morning training session but on the days where he too, had an afternoon training session, he would most likely be one of the zombies in the crowd.</p><br/><p>The job the White Knights were in-charged of were as follows, guarding of the gates, patrolling the streets, arresting criminals that were involved in whatever incident that were being investigated. They were just like the organization Will had talked about, the police.</p><br/><p>And because Elzmu was a country surrounded by the [Demon Forest], the Knights needed to undergo intense training in order to be able to guard and defeat any demon beasts should they come attacking. Of course, this not only applied to the Beryl’s territory but throughout the country.</p><br/><p>Even so, the training at Beryl’s grounds were famous for being tough. As Ivan had totally gotten used to this, he was able to stare at the new trainees with a calm expression. Ahh, growing accustomed sure was scary.</p><br/><p>A shadow approached Ivan. He was a novice knight like Ivan called Scott.</p><br/><p>” I wonder what’s going on. ”</p><br/><p>Scott said, looking at the noisy training grounds. Ivan too, was thinking about the same thing as the both of them tilted their head in puzzlement.</p><br/><p>” Maybe something happened? ”</p><br/><p>Ivan guessed but Scott shook his head.</p><br/><p>” Can’t be. If it was to the extend that they needed us novice, the streets would be in a panic as well. ”</p><br/><p>” Hmm, if that’s the case, we won’t be of any help anyway. ”</p><br/><p>Ivan laughed bitterly. Novice knights like them, as compared to their senpais, were like putting snake against a dragon. They would totally be of no help at all if even the Senpais can’t handled it. Plus, the streets were too quiet.</p><br/><p>So it looked like nothing serious. But knowing that put them at ease. Looking at each other, they laughed and relax, standing at ease as they waited for the announcement.</p><br/><p>After waiting for a bit, Gion appeared in front of them. His usual stern expression somehow looked a little weird today. It was an expression that he rarely show in front of the novices and trainees so it stood out. But the reason for that was quickly known.</p><br/><p>That was because a small shadow was seen behind Gion. Yes, that person was none other than Will. The cough that threaten to burst out was suppressed by Ivan as he disregard the sour sensation that welled up in his nose.</p><br/><p>To the Ivan now, Will was a part of his black history that he wished to forget, as well as the one who could heal him, also as someone he admired. Which meant, Will was a very complicated existence to him. But, as Will’s appearance was too sudden, the first memory that rushed out was the black history that he wanted to erased.</p><br/><p>The stunned Ivan than perked up his ears when Gion said that there was an important announcement to make. In order not to be shaken by Will’s presence, he emptied his mind and thoughts. It was rude to show such a sight towards a noble. Yes, Ivan had learned a lot during his days here.</p><br/><p>” Everyone, thank you for assembling. ”</p><br/><p>[TN: Shokun, sokurou gokuro.]</p><br/><p>At the moment Gion opened his mouth, the quiet grounds went into total silence. Everyone pretended to be ignorant of what happened and also of how Gion looked proud as he glanced at Will. No matter how their hearts were thinking ” It’s a pun….! ” or ” That’s sad…. “, there was no way they could say that out loud or show it in their attitude in front of their superior. Because everyone here was a knight. Although being a knight had nothing to do with it.</p><br/><p>Or it might be that they do not wish to acknowledge how their stern and cool leader had such a moment, or how Gion was actually an idiot parent.</p><br/><p>Maybe Gion wanted to show off to his Son, Will, had he had said something amusing, but backfired. They could only pretended that it did not happened. The clever knights kept their silence.</p><br/><p>” ….. I gathered you here because of an upcoming event! ”</p><br/><p>It seemed like Gion pretended nothing happened. He reverted to this stern expression as he raised his voice.</p><br/><p>” XX months later, a [Fireworks Festival] event will be held! On that day, the B-Grade Gourmet food cart is going there as well! I imagine there is going to be some disorder so all novice are to patrol and control the crowds! ”</p><br/><p>Saying that in a single breath, Gion looked at everyone.</p><br/><p>” What is your response? ”</p><br/><p>” Understood! ”</p><br/><p>Ivan and the rest saluted as they raised their voices. Scott than raised his hand.</p><br/><p>” Scott. ”</p><br/><p>” Thank you very much! What exactly is [Fireworks Festival]? ”</p><br/><p>” That I would let my son explain. He would be explaining the about the food cart as well. Any other questions? ….No? Alright. The arrangements of groups would be by your sempais would be after the lecture! Then I would be leaving the rest to my son! ”</p><br/><p>Gion then took his leave. He seemed to be leaving in a haste, did he had any important matters to handle? Ivan wondered about that but after seeing Will’s stunned face, he understood.</p><br/><p>Ahh, Gion was escaping after leaving that bad pun behind. He even avoided Will’s eyes.</p><br/><p>But then Ivan was surprised. Usually it would be strange to leave a kid whose age was not even in the double digits to give a lecture but no one was questioning that fact at all. They all had an expression that read ‘Because it’s Will.’. As expected of Will. Was it okay to named that adaptability as such?</p><br/><p>Then, questions started to appear.</p><br/><p>” When is the [Fireworks Festival]? ”</p><br/><p>” Looking at the statics, the lowest possibility of rainfall would be on this day so it would be this day. ”</p><br/><p>” Where will the food cart be located at? ”</p><br/><p>” It will be at the street lined with Icris trees that stretches from the gate till the Beryl’s mansion. Apart from the food cart, there would be games stores setting up along that street too. ”</p><br/><p>” What do you mean by games stores? Shops that sells games? ”</p><br/><p>” My plan was to have games like ring toss and depends on the points earned, different prizes could be won. ”</p><br/><p>” Gion-Sama said that there is most likely to have disorder so can I know how messy it will get? ”</p><br/><p>” As the Kuma Neko company had helped with the publicity of this event, people from other territory would most likely be coming….. ”</p><br/><p>The knights started throwing questions without holding back and Will smoothly answered everyone of them. This was as weird as it could get. Ivan started getting a far-away look in his eyes from witnessing his strange sight. As a newcomer, he would still need a long time before he could get used to this lack of common sense.</p><br/><p>◆◆◆</p><br/><p>TN: All behold the breaker of common sense.</p><br/>\n</div>"}