{"title": "143 – What Would Happen To Hattuo? (Part 2)", "id": 155, "volume": 2, "url": "http://boxnovel.org/i-have-been-reincarnated-143-%E2%80%93-what-would-happen-to-hattuo-part-2", "volume_title": "Volume 2", "body": "<h1>143 – What Would Happen To Hattuo? (Part 2)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>143 – What Would Happen To Hattuo? (Part 2)</p><br/><p>Posted on December 10, 2017 by crazypumkin</p><br/><p>*Unedited</p><br/><p>And the former Hattuo Emperor continued his crazy laughing for a while. I really wondered what was it that was so amusing to him. Or was he shocked into turning crazy?</p><br/><p>In any case, I did heard how people would go crazily laughing if they were to be exposed to something too shocking that pushed it out of their boundary of acceptance.</p><br/><p>As for me, I simply waited in silence until the former Emperor stopped that crazy laughter of his. No matter how I looked, he just didn’t look sane at the moment. It was better to leave him be, than to make the matter worst by interfering.</p><br/><p>No, not that I was running away from it or anything!</p><br/><p>And finally his laughter ceased. I resolved myself and opened my mouth. I already had the King’s permission to do whatever I wanted so I was not going hold back. I did had a lot of things I wanted to tell him, as well as many questions for him. Although I was a bit worried if his brain was still working normally or not.</p><br/><p>” Er, erm. ”</p><br/><p>Please keep the matter about me stumbling over my words a secret, yeah? Despite just crazily laughing a few moments ago, none of that previous expression could be seen as he looked at me with an expressionless face.</p><br/><p>Somehow, it was really vexing. I don’t really want to say it but that change in expression was frightening. To think I was afraid of someone whom was caught and locked up in this room. Though caught, as expected of an Emperor.</p><br/><p>” Why did you lifted your hands against the forest? ”</p><br/><p>But I was not one to be deterred. As an adult, a noble, my resolution was strong. I was actually quite furious at him for doing that but to prevent losing myself to my emotions, I gave my all in maintaining the poker face I had on. Making use of the advantage a child had, I had on a harmlessly smiling face. And this expression was my default expression (poker face). My aim was to look like a normal-average-always smiling child who was actually awesome and sly.</p><br/><p>Hey, I had an average face so I had to used it to it’s fullest, right? Ta-dah, behold the new me. It was so new that I wanted to add a ‘star’ mark next to my name. Te-heh.</p><br/><p>At my direct line of questioning, the former Emperor grinned, just like how those villains grinned when they saw chests of gold they stole / bribe from others.</p><br/><p>” For the expansion of my nation as well as reinforcing it. I believe any ruler who ruled over a nation would want that, don’t you? ”</p><br/><p>He said confidently as I continued staring at him. It shouldn’t be just this. I was pretty sure he had a deeper reason for doing it.</p><br/><p>” You should be clear that there will be divine punishment should you ever lift a hand against the forest, don’t you? ”</p><br/><p>With that smiling face, I threw the question back at the former Emperor, who faltered for a moment.</p><br/><p>” …..I did know beforehand that demon beasts would pour out once the trees are touched. But I too, know that the ones who would be in trouble would be Elzmu.</p><br/><p>In that case, I thought there was no need to hesitate. ”</p><br/><p>” Just that? In that case, why did you not execute this plan from the start? ”</p><br/><p>” That was because I need time to gather information about Elzmu’s strength. ”</p><br/><p>” So you knew all about about our war strength? ”</p><br/><p>” Yes, which is why we started advancing, ”</p><br/><p>My smiling face and the former Emperor’s expressionless one. I cannot read anything from it. His answers were all plausible and there weren’t any thing wrong with it. But I caught onto that small moment of silence he had before he started answering.</p><br/><p>If that was really the reason why he invaded, there was no need to falter. Father had told me that the fury he had for this former Emperor was so great that he could just reached out and killed him so there was very little chance that he could live. As a noble of Elzmu, as well as all the political history I learned, I knew we do not had that kind of leniency nor can we afforded it.</p><br/><p>But because there seemed to be a hidden agenda, I was tasked as a special exception to deal with this. As for what the hidden agenda was, I did had an idea. Besides, I was the one who destroyed the [Shadows] Hattuo thrown at me.</p><br/><p>I knew I was investigated as a new threat to them but above all, since I destroyed the [Shadows], Hattuo did not get as much information as they would had preferred. And now, they moved despite the lack in intelligence gathered. Which meant there was a strong reason that pushed them to moved as soon as they did.</p><br/><p>As I continued smiling as I stayed silent, and the fearless smile from the Former Emperor gradually disappeared. Then, a voice full of regret was heard.</p><br/><p>” It’s the food supply. By this winter, all of my national treasury is used up and I would have no means to feed my citizens. And since Hattuo freeze up during winter, they wouldn’t even have the means to support themselves. ”</p><br/><p>At last, he began to talk about Hattuo’s situation.</p><br/><p>Due to the harsh winter weather in Hattuo, they had been importing food from over Dyuvu, the [Beastmen Nation] whom they scorned, and even the Federal political Hadazerl since forever, even before Elzmu was founded.</p><br/><p>But as this lifeline (weakness) was held by the other countries, they couldn’t raised up a strong and unstoppable army as they liked but since they had an industry of creating magical tools and mana stones, they had no problems with their finances.</p><br/><p>However, during this recent century, the sales for their magical tools and mana stones had been on the declining.</p><br/><p>The reason for that was clear. Because Elzmu had began brunching out in this line as well. In other words, it can be said that the effort the First Founder had placed in compulsory education had shown it’s effect.</p><br/><p>Although Elzmu started out small, their magical tools had produced better results with better pricing as well. Plus, thanks to everyone knowing how to use magic, the technology for the magical tools just kept on getting better and better. A complete opposite to Hattuo, which magic were being monopolized by the nobles.</p><br/><p>Thanks to that, Hattuo began experiencing problems with their sales.</p><br/><p>Furthermore, the citizens of Elzmu, whom all had a degree of knowledge, learned not to rely blindly on magical tools. Magical tools were produced for peasants who could not used magic in order to improved their daily life. But for the citizens of Elzmu, they learned how to used their knowledge to improved upon the tools and even invented new ones. This brought a huge setback to Hattuo.</p><br/><p>As the trades increase in Elzmu, Hattuo was facing a deficit. And this situation continued for about a 100 years.</p><br/><p>To add on to that was the spending of the nobles. Having lived that way since, it was difficult for them to changed their ways and when Guta inherited the throne, there was nothing left in the treasury.</p><br/><p>Even more so when the previous Emperor was a extravagant idiot. And in this dreadful situation, they could only loaned from others. But, they still faced a huge problem with the importing of food. Once winter came, everywhere would freeze and it would be checkmate.</p><br/><p>Listening up to this point, I sighed.</p><br/><p>” I know we are getting our own just deserts from our previous actions but there was no other way to save my people. ”</p><br/><p>It must had been a difficult choice to make, which explained that expression he had earlier on. I finally realized the reason for the weird feeling I had when I saw the former Emperor’s expression when I first stepped into the room. I was decieved by that horrible reputation of his as well as his appearance but he was actually quite a good Emperor.</p><br/><p>I thought that it was a waste. Was there no other way?</p><br/><p>Ah, this was that. That thing teachers always said. ‘ I had expectations for you, therefore the scolding. If I expect nothing from you, I could have kept quiet and do everything myself. But that is the same as giving up on you ‘. Yes, I finally get that now.</p><br/><p>” I think it is splendid how you think about helping the citizens. What was that again? Nobleness oblige? ”</p><br/><p>I continued.</p><br/><p>” But the citizens themselves have their own will, their own thinking as well. To treat them like children where you have to spoon-fed them every way is just a condescending way of thinking, and the worst example an adult should behave. ”</p><br/><p>I said some strong words that even I was surprised as the Emperor-in-question was staring at me with wide opened eyes. Ah, true, this must be quite surprising for an 8 year old to say. But he really shouldn’t be that surprised when he knew I could keep up and understand what he just said earlier.</p><br/><p>” Without having any expectation from the children and simply doing things your way, of course you would go into deficit. If you really wanted to protect your citizens, you should have use the strength they have. ”</p><br/><p>” The citizen’s strength? ”</p><br/><p>” The measures Hattuo have right now was even if you wanted to farm, all you are doing is only giving out the spades and hoes. Haven’t you ever thought about it? The opposite side of Flowason’s bridge, where Elzmu national border is, agriculture is aplenty. Do you really think that just by crossing a bridge the climate would change? ”</p><br/><p>” That, that is… that’s because it’s land that God had blessed upon… ”</p><br/><p>” Is that what was taught in Hattuo? If you have investigate the land when you are investigating me, you would have realize. All god had done was to allow humans to lived in a land that was used to be occupied by monsters. That’s it. ”</p><br/><p>” Then…. why? ”</p><br/><p>” It’s the strength of the citizens. In Elzmu, apart from passing them shovels and hoes, we imparted magic, magical tools and even knowledge to them. ”</p><br/><p>” Magic?! ”</p><br/><p>” Not only magic. You said it yourself, didn’t you? That Elzmu technology had risen… ”</p><br/><p>” What I meant is the skills of the magical tools craftsmen. ”</p><br/><p>” You’re wrong. It’s national education. Everyone is equally educated and we have a system where anyone can learn as long as they wanted to. Right now, around the border and villages, the fields had frozen over. Which is why the farmers are using fire magic to warm up the place, and even set down anti-freezing tools around to deal with the problem. As for the tools, as long as they have the qualifications, any one of them can built it so it’s cheaper. And if it is to be used on agriculture, the country will also subsidies a part of the cost. And that is why none of the farms here is frozen over. ”</p><br/><p>” So all you did is education and subsidiary…. But in that case, don’t you have any control then? It will be easy for them to revolt! No one would respect the nobles without the advantage of magic! ”</p><br/><p>” That in a sense is correct, yet not so. All I can say is, when the citizens gain knowledge, their patriotism grow stronger as well as their respect for nobles. ”</p><br/><p>” Why is that so? Impossible… ”</p><br/><p>The former Emperor seemed to be in disbelieve. Rather, had this guy really investigated about us? He must had focused on the army strength and finances but forgotten about the citizens.</p><br/><p>I felt like sighing, but I managed to held it in. Come to think of it, I was personally ordered by the King to managed Hattuo, which had became our vassal. I would be in contact with this former Emperor for a long time to come since this can’t be solved immediately. And this was why we need to have the same understanding and ideals. Now was too early to be frustrated.</p><br/><p>” If you learn, you would understand. The government did many for the sake of the citizens. From the Knights who protect them from the demon beasts, magical tools which cook, to the patrol of the streets. They felt gratitude, admiration, and some even set their aim to become a Knight or a magical tool craftsman. Meanwhile others had provide food as a thanks. Learn, and you would understand how your ‘providing for everyone’ is wrong. …..That is also because the governing here is magnificent. ”</p><br/><p>” The nobles in my country is rotten. ”</p><br/><p>” Ah, well, that is also why I said your meaning is correct and yet no so. ”</p><br/><p>” Can it be done? ”</p><br/><p>At my words, the former Emperor looked at me worriedly.</p><br/><p>” Not ‘can it be done’. But ‘it had to be done’. ”</p><br/><p>I felt slightly down from thinking about all the troubles that would be ahead. But letting none of it shown on my face, I proclaimed it with a smile.</p><br/>\n</div>"}