{"title": "Chapter 9. The World Becomes a Dungeon (2)", "id": 9, "volume": 1, "url": "http://boxnovel.org/infinite-competitive-dungeon-society-chapter-9-the-world-becomes-a-dungeon-2", "volume_title": "Volume 1", "body": "<h1>Chapter 9. The World Becomes a Dungeon (2)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 9. The World Becomes a Dungeon (2)</p><br/><p>“Orc Lord! Fight me!”</p><br/><p>“Chwiiiik!”</p><br/><p>The spawn locations of the fourteen orc minions were limited. The moment I entered the room, I realized which spawn pattern the orcs were in, and charged towards the orc closest to me.</p><br/><p>Because of Warcry, it was impossible to kill the Orc Lord while ignoring the orc minions. As such, you had to quickly take care of the minions. The Orc Lord’s attacks hurt no matter what, but when he used Warcry alone, his defense also decreased by 50 percent. As such, it was necessary to kill all the minions.</p><br/><p>“Kuwaaak!”</p><br/><p>“Chwiik!”</p><br/><p>“Human!”</p><br/><p>“Fast!”</p><br/><p>Now, I could send the trash mob orcs’ heads flying by just slashing with my weapon. It was one of the pros of using a glaive. It could stab, but it was more powerful when used to slash. Plus, the Orc Lord’s Glaive was a rare-grade item. It was different than a wooden spear.</p><br/><p>“Kuaaa!”</p><br/><p>Seeing his minions drop like flies, the Orc Lord stretched his back and roared. He was using Warcry! However, I had already cut down more than half the orcs.</p><br/><p>“You won’t have a chance to!”</p><br/><p>One more, one more! My body moved exactly like I had calculated. Like a farmer harvesting his crops, I quickly cut down the orcs’ heads. With the slight speed bonus from the Orc Lord’s Boots, it seemed even easier. When the Orc Lord finally finished his Warcry, there were no orc minions left in the room.</p><br/><p>[Orc Lord used Warcry! It cleanses itself of all negative status effects. Because there are no orc minions in range, the Orc Lord’s attack power increases by 100% and defense lowers by 50%. It temporarily becomes super-armored.]</p><br/><p>“Kuaaaa! You dare!”</p><br/><p>“I’ve heard that line over a thousand times already!”</p><br/><p>I charged toward the super-armored Orc Lord without hesitation. I knew the Orc Lord’s attack patterns in and out. I had already experienced it to near boredom. In truth, the fight was already over when I cut down all the orc minions.</p><br/><p>A super-armored monster ignored incoming attacks and focused on its own attacks. However, it had its disadvantages. Because you did not stop at all, you sometimes ended up taking more damage.</p><br/><p>As a result, it was much easier to land a critical hit, which dealt more than double the usual damage and sometimes even damaged the target permanently. Of course, it was easier for the Orc Lord to deal critical damage to others under the super-armor effect, but you just had to not get hit.</p><br/><p>Like now!</p><br/><p>“Haaap!”</p><br/><p>“Kuaaak!”</p><br/><p>[Critical Hit! You dealt a deadly blow!]</p><br/><p>As I rolled on the ground to dodge his attack, I swung my glaive and cut his Achille tendon. Because he was in his super-armor state, he kept charging forward regardless. As a result, his wound only became worse. When its super-armor state ended, it would face an unimaginable pain.</p><br/><p>“HUMAAAAN!”</p><br/><p>“Even if you don’t tell me, both the heavens and my cute sister know I’m human!”</p><br/><p>At the Orc Lord charging forward due to super-armor, I continuously attacked with my glaive from the back. When it hit the wall and stopped, I slashed down on his back and jumped back.</p><br/><p>“You will not escape alive!”</p><br/><p>Here it comes! The Orc Lord raised his glaive and black mana began to gather around it with a ringing sound. It was the skill that drove me mad with jealousy every time I saw it! Sword Blast! I had already figured out the time it took to charge, and all the angle and direction patterns. I slid to the side, dodging the Sword Blast with ease. Using the small opening it had after using Sword Blast, I stabbed my glaive through his belly.</p><br/><p>“Kuaaak!”</p><br/><p>“Whoops, that was close.”</p><br/><p>I distanced myself from the Orc Lord thrashing about randomly. At least 10 minutes had passed since the battle began, but the Orc Lord still seemed healthy as it roared incessantly. If there was a difference between games and the dungeon, it was the HP bar. No matter how much I wished for it, I couldn’t see how much HP the enemy monsters had left.</p><br/><p>“DIE, HUMAAAAN!”</p><br/><p>After the Sword Blast was the random thrashing. It swung its arms and legs everywhere and made a complete mess of the surroundings. This skill gave off powerful vibrations and powerful blows, which easily disrupted even the most well-organized parties. I couldn’t find a good solution to this attack even after fighting it close to a thousand times. If I approached it now trying to attack, I could die with a single misstep. When the Orc Lord was also under the super-armor effect, the damage done couldn’t be described with words. That was exactly the case now.</p><br/><p>“DIEEE!”</p><br/><p>“Would you jump into a charging bulldozer because someone told you to?”</p><br/><p>“DIEEE!”</p><br/><p>“Alright, alright, I’ll kill you, just wait a little.”</p><br/><p>Thankfully, it wasn’t so difficult to dodge it. I just had to keep running back when it started thrashing around. If it chased after me, I just had to draw circles around it as I retreated. Because the room was rather large, it wasn’t so hard to do. Additionally, after this phase ended, it stood in place and drew its breath for a little while.</p><br/><p>This was the best chance to counterattack.</p><br/><p>“DIEEE!”</p><br/><p>Ignoring the fact that I was making fun of its speech earlier, I charged toward the Orc Lord shouting the same thing it had been shouting. In my hands were the Orc Lord’s Glaive. My target was… its thigh!</p><br/><p>Crack!</p><br/><p>“Kuaaaak!”</p><br/><p>“Alright, it went in!”</p><br/><p>The super-armor state had already ended. The Orc Lord dropped its weapon in pain and wrapped its arms around its thigh. When the Orc Lord received damage surpassing a certain threshold, it dropped its weapon. This was another great chance to attack. Excited, I stabbed my glaive through the other thigh.</p><br/><p>[Critical Hit!]</p><br/><p>With luck, I even got a critical hit! When the Orc Lord received huge damage while it had its weapon dropped, it would just fall in place. It would then faint and stay unconscious for a period of time. I won. This battle was mine!</p><br/><p>“Haaaaap!”</p><br/><p>I aimed my glaive at the Orc Lord’s throat, which was at a perfect height for me to do so. Although I couldn’t pierce through it, I had dealt the damage. Of course, I wouldn’t be satisfied with just one attack. I stabbed with my glaive a couple more times. Then, a thick stream of blood exploded out.</p><br/><p>Did I get too excited? I forgot to control myself and stabbed its throat one more time. It was then that the Orc Lord opened its eyes.</p><br/><p>“Kuaaaaa!”</p><br/><p>[Orc Lord used Warcry! It cleanses itself of all negative status effects. Because there are no orc minions in range, the Orc Lord’s attack power increases by 100% and defense lowers by 50%. It temporarily becomes super-armored.]</p><br/><p>“Damn! Kuk!”</p><br/><p>He swung his fist and hit me. With just that, I flew back as my HP dropped tremendously. Thankfully, I did not hit the wall and just fell on the ground.</p><br/><p>[Your HP fell below 30 percent. You are in need of urgent treatment.]</p><br/><p>“Agh, damn it…!”</p><br/><p>Losing too much blood too quickly, I couldn’t move my body for a moment. Setting aside the pain I was feeling, I would definitely have died without the Orc Lord’s defensive equipment set.</p><br/><p>“DIEEEEE!”</p><br/><p>It’s charging! I put strength into my knees and got up. My legs were shaking. It wasn’t easy to digest the damage from its fist.</p><br/><p>“HUMAN, THIS IS THE END!”</p><br/><p>“Kuk!”</p><br/><p>I hurriedly took out a potion from my inventory and drank it. Once my HP recovered a little, it would become easier to move. However, the message I received was not the one I was expecting.</p><br/><p>[You used a Power Potion. For 15 seconds, your strength is increased by 10.]</p><br/><p>“Damn!”</p><br/><p>It seemed like I would have to face him directly. I didn’t have the time to drink an HP potion anymore, and my legs weren’t fully recovered. They could only manage standing their ground.</p><br/><p>‘Although this isn’t what I had planned…’</p><br/><p>I tightly gripped my glaive and looked forward. The Orc Lord was charging toward me in a straight line, its eyes glowing red. Its eyes were burning with love and the glaive in its hands were full of passion. It was truly the worst love confession.</p><br/><p>“Whew… let’s do this.”</p><br/><p>Don’t look down on my spearmanship because it’s only mid-rank. What I learned could not be described by ranks like low and mid. It was a technique passed down from my ancestors. Their breath still lived on in it! Faster than lightning, stronger than a dragon, grander than Mt. Tai, and more delicate than the ocean! This was…</p><br/><p>“DIE!”</p><br/><p>“DIE!”</p><br/><p>Well, it didn’t have anything embarrassing like name! Thinking rather useless things as the Orc Lord neared me, I thrusted my glaive toward the Orc Lord’s chest. If it could survive this, then I would be the one to die!</p><br/><p>Puk!</p><br/><p>I heard a sound. My attack had definitely hit its mark. The question was whether it died or not. Because my eyes were shut, I couldn’t see if it was dead or if I was about to die. In an instant, everything became quiet as if all sounds in the world had disappeared. It like when you turned off the TV in the middle of the night.</p><br/><p>Slowly, I opened my eyes.</p><br/><p>“Hiik!”</p><br/><p>The Orc Lord’s face was right in front of mine. When I pulled out my glaive and stepped back, the Orc Lord fell with a thud. I blinked. This… could this be?</p><br/><p>… Did I succeed?</p><br/><p>[A Grand Accomplishment! You have defeated the Floor Master, Orc Lord, alone! Amazing!]</p><br/><p>[You obtained the title ‘Orc Lord Slayer.’ All stats permanently increase by 1. This effect will apply even if the title is not equipped.]</p><br/><p>[You have become Bronze Rank 6. Congratulations.]</p><br/><p>[You defeated the Orc Lord alone. You have obtained the special reward, Orc Lord’s Pauldron.]</p><br/><p>[You obtained 1,000 gold.]</p><br/><p>[Choose your reward.]</p><br/>\n</div>"}