{"title": "Chapter 4. Boy Becomes a Dungeon Explorer (4)", "id": 4, "volume": 1, "url": "http://boxnovel.org/infinite-competitive-dungeon-society-chapter-4-boy-becomes-a-dungeon-explorer-4", "volume_title": "Volume 1", "body": "<h1>Chapter 4. Boy Becomes a Dungeon Explorer (4)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 4. Boy Becomes a Dungeon Explorer (4)</p><br/><p>I had no pride to save, nor did I need to. The next week, I stood in front of the same door and obediently shouted that I would enter a party. Then, a translucent window appeared.</p><br/><p>[This is the party recruitment board. Click on the one you want and enter a party.]</p><br/><p>“Let’s see. Hunting the Orc Lord, looking for healer. Must be above level 5. How stupid, isn’t everyone on the 5th floor level 5?”</p><br/><p>Thinking that there were people even more stupid than me, I slowly scrolled through the window and found one that was looking for a front-line damage dealer. Because I started playing games, I knew what a front-line damage dealer was. They were people who attacked in melee range using close-range weapons.</p><br/><p>The moment I clicked on that post, I felt stunned briefly and soon found myself among nine other people.</p><br/><p>“Welcome. You’re a front-line damage dealer, right?”</p><br/><p>A handsome western-style man began talking to me. Thinking it was English, I was about to yell out ‘I cannot speak English.’ Fortunately, I found that I could understand what he was saying without problem.</p><br/><p>“Y-Yes, I use a spear.”</p><br/><p>“Oh, a spearman! Are you from the Edias continent?”</p><br/><p>“N-No, I’m from Seoul.”</p><br/><p>“Seoul? It’s the first time I’ve heard of it. Anyone else?”</p><br/><p>“It’s not from the Luka continent.”</p><br/><p>“It’s not from Pilos either.”</p><br/><p>The people around me murmured as they shook their heads. When I glanced at them, I noticed that most of them had white or dark skin, and had blonde, red, or brown hair. They were all foreigners! As I cowered slightly, the man who first talked to me approached. He was wearing a small shield on his arm and had a short sword attached to it. With a sigh, he reached his hand out to me.</p><br/><p>“You must be from a minor place. Nice to meet you. I’m the party leader Ellos Von Kasina. Paul, Celtine, and I are from the Edias continent.”</p><br/><p>“Gasina[1.Gasina means b*tch in Korean.]?”</p><br/><p>“It’s Kasina.”</p><br/><p>I grabbed the hand of the party leader, who looked slightly disappointed. Having played games for a while, I knew what a party was. It was just that I never thought I would be in a party with people from other worlds…</p><br/><p>“I’m Kang Shin. Nice to meet you.”</p><br/><p>After a brief introduction with the other party members, I thought we would immediately fight the Orc Lord. I was mistaken.</p><br/><p>“Hold on.”</p><br/><p>It was a small girl from a place called the Luka continent. Besides this small girl, three other members, a woman carrying a rapier, a long-eared beauty with a quiver on her back, and a weak framed girl barely holding onto her wooden shield came from this continent. The small girl was a blonde, twin-tailed beauty, whose hair shone like gold and whose wooden staff matched well. However, the way she talked wasn’t cute in the slightest.</p><br/><p>“Wait, look at his clothes. Aren’t those the beginner’s clothes?”</p><br/><p>“Beginner’s clothes?”</p><br/><p>What was wrong with my clothes? I looked down at the clothes I was wearing. Because I wanted to be in clothes suited for moving around, I always came into the dungeon wearing my training clothes. Even if they were ripped, they were restored once I got out of the dungeon.</p><br/><p>“… You haven’t gone to the Floor Shop?”</p><br/><p>“I did.”</p><br/><p>Because the other side was talking informally, I did the same. The girl asked again, surprised. “They sell defensive equipment there. Why didn’t you buy them?”</p><br/><p>“Ah.”</p><br/><p>I did remember the Floor Shop selling defensive equipment. However, my goal was to reach the 10th floor and buy a mana cultivation method. I couldn’t thoughtlessly spend gold before then. It was the same for my weapon. I continued to use the Sharp Wooden Spear given to me at the beginning. Of course, it wasn’t so sharp anymore.</p><br/><p>“I have to save money to buy a mana cultivation method.”</p><br/><p>“What? You don’t have a mana cultivation method? What family are you from?”</p><br/><p>“Family? The Kang family I guess?”</p><br/><p>“Doesn’t that family have a mana cultivation method?”</p><br/><p>“Nope.”</p><br/><p>“What? Oh no, we got the wrong party member. Kick him out!”</p><br/><p>“Mm, it’s going to be difficult if you don’t have a mana cultivation method.”</p><br/><p>“He doesn’t have a mana cultivation method?”</p><br/><p>The other party members began to whisper to each other. Realizing that something was going wrong, I talked to Ellos, who seemed to be the most understanding.</p><br/><p>“Does everyone else have a mana cultivation method?”</p><br/><p>“Of course. Wait, I don’t know about the other dungeons, but it’s known to be impossible to climb to the 5th floor of the First Dungeon without a mana cultivation method. How did you get this far?”</p><br/><p>“Oh, I raised my skill level. I mastered my mid-rank spear technique…”</p><br/><p>“Mid-rank master!?” This time, another person in the back yelled out in surprise. It was a brown-haired man carrying a large shield and wearing a thick leather armor.</p><br/><p>“Don’t lie. I practiced my shield technique for 10 years and it’s only just gotten to mid-rank level 2. You said you mastered the mid-rank spear technique!?”</p><br/><p>“I did… is that weird?”</p><br/><p>“It is! Mastering a mid-rank weapon skill without even a mana cultivation method, I don’t believe it! Don’t tell me, you have the high-rank spear technique?”</p><br/><p>“No, it said I couldn’t learn it because I don’t have mana.”</p><br/><p>“…”</p><br/><p>All the party members fell silent. Then, Ellos spoke out. “Let’s bring him in.”</p><br/><p>“But Ellos...”</p><br/><p>“We barely climbed to the 5th floor with the three of us. With the rule, [all players below the 10th floor can only be partied with people from their own continent], he must have climbed to the 5th floor on his own. If he had his own party, he wouldn’t need to enter ours. Am I right?”</p><br/><p>“Yes.”</p><br/><p>When I nodded, Ellos seemed to gain more confidence and talked louder.</p><br/><p>“See. Kang Shin alone has the ability of all three of us combined. I can’t speak for the future, but at least on this 5th floor, he has more than enough qualification to fulfill the damage dealer role. He’s a mid-rank spear technique master!”</p><br/><p>“But look at his armor…”</p><br/><p>“I don’t like him…”</p><br/><p>“Kick him!”</p><br/><p>The twin-tail kept on saying to kick me. I held myself back from glaring at her, but she got more arrogant and glared at me.</p><br/><p>“Kick him!”</p><br/><p>“Miss Palludia, please calm down. We haven’t seen his skills yet.”</p><br/><p>“We don’t need to! Look at him, he’s using a half-broken wooden spear!”</p><br/><p>“Hmm…”</p><br/><p>“It’ll be too late if we take the time to see it. I don’t know how your continent is, but mine is in a fierce war against the demon race. If I lose the opportunity to get stronger for a whole week, we’ll fall behind in the war!”</p><br/><p>“My continent is also at war with invaders. Hu, fine. Just give us some time. Mister Kang Shin, I apologize, but you’ll need to show us your power. There should be an orc further back, so show us your abilities by defeating it.”</p><br/><p>“Sure, it’s not a hard request.”</p><br/><p>“Kuk…”</p><br/><p>The brat named Palludia stepped back from the negotiation with Ellos, but still bit down on her lips in displeasure.</p><br/><p>“You’re an orc yourself…”</p><br/><p>“I’m not an orc!”</p><br/><p>I couldn’t help but yell out when she picked on my weak spot. When I faced her and glared, she seemed to be intimidated as she turned away.</p><br/><p>“Hmph!”</p><br/><p>“Hmph.”</p><br/><p>I also snorted. Then I sauntered off. Because there were no orcs near the door, I had to walk for 5 minutes.</p><br/><p>“Chwiik, human!”</p><br/><p>Found one. It was wearing a worn-down leather armor and carrying a fearsome glaive. Confirming that the others were watching, I ran toward it. My spear spun in my hand, and I soon snapped my hand, grabbing onto it tightly. Now!</p><br/><p>“Haap!”</p><br/><p>I lightly dodged the orc’s glaive attack, and the spear I struck out like lightning pierced its target. The orc that was running toward me stopped in its track, let out a burping sound, and began to fall with blood foaming at its mouth. As he fell, I quickly pulled back my spear to prevent it from breaking. Without anything to lean on, the orc fell with a thud.</p><br/><p>At first, I fought with monsters with brute strength, blocking their attacks with the spear. But because the durability of my spear wore off and fell below 10, these days I was doing my best to kill the orcs in a single blow. Because of my mastery of the mid-rank spear technique, it wasn’t too difficult to do.</p><br/><p>“W-With just one hit…!”</p><br/><p>“No way, did you see that? I didn’t even feel a hint of mana!”</p><br/><p>“I did! Mana aside, that’s not even a skill!”</p><br/><p>“Amazing…”</p><br/><p>Ellos and the other party members seemed to be awed by my technique. Hm, I guess these days, I’m evenly matched with father just with pure spearmanship. Unfortunately, there was always that one person who likes to rain on your parade.</p><br/><p>“Hmph, that was just a coincidence! If he tried again, there’s no way he can draw such a clean and beautiful trajectory!”</p><br/><p>“M-Miss Palludia, even if it was a coincidence, he is undoubtedly skilled. He is more than suited to become our party member.”</p><br/><p>“Eeek, if you can’t agree with me, I’ll just leave! It’s either my party or him! Your choice!”</p><br/><p>“T-That’s…”</p><br/><p>“Then I’ll just defeat another one.”</p><br/><p>Because Ellos looked troubled, I spoke out. Ellos looked at me with teary eyes. Disgusting. Palludia, on the other hand, snorted and said, “Try it!”</p><br/><p>“How convenient, there’s one right there.”</p><br/><p>An orc archer. They were an annoying bunch that shot arrows from afar. Thankfully, they didn’t appear often. When they appeared with other orcs, I had to be prepared to receive injuries as I charged in. But now, there was only one orc archer. For me who could avoid even bullets, avoiding arrows wasn’t much of a problem.</p><br/><p>“Chwiik! Orc shoot arrow!”</p><br/><p>“Human stab orc!”</p><br/><p>Having hunted alone for a year, it became my hobby of sorts to talk back to monsters like them.</p><br/><p>With ease, I tilted my head and dodged the orc archer’s arrow. I took a step forward and shot towards the orc archer. Just like before, my spear beautifully pierced through orc archer’s neck.</p><br/><p>“How is it?”</p><br/><p>“Ee… Eeeek….”</p><br/><p>Although Palludia’s eyes were glaring, she clenched her fists and looked down. She had accepted her loss. I didn’t know just what part of me she didn’t like, but I could think of quite a few possibilities by myself. As such, I decided to not care.</p><br/><p>What was important was not the outside, but the inside! I am Kang Shin, the son of the world’s strongest spearman. I’ll show you the strength I gained by giving up my ordinary life!</p><br/>\n</div>"}