{"title": "Chapter 5. Boy Becomes a Dungeon Explorer (5)", "id": 5, "volume": 1, "url": "http://boxnovel.org/infinite-competitive-dungeon-society-chapter-5-boy-becomes-a-dungeon-explorer-5", "volume_title": "Volume 1", "body": "<h1>Chapter 5. Boy Becomes a Dungeon Explorer (5)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 5. Boy Becomes a Dungeon Explorer (5)</p><br/><p>I felt much better knowing that I forced her off her high horse. Ellos seemed to be at a loss as the comrades from Palludia’s continent went to console her, but he soon clapped his hands and livened up the mood.</p><br/><p>“Then I’ll take it that no one has any problems with Mister Kang Shin joining the party. Once Mister Kang Shin is rested from his fight with the orcs, we will go right away.”</p><br/><p>“Roger.”</p><br/><p>“Got it.”</p><br/><p>“Take good care of me, mate.”</p><br/><p>“Take good care of me too.”</p><br/><p>I greeted the other party members, then glanced at Palludia. My eyes met hers when she had briefly raised her head, but because she glared at me so intently, I hurriedly looked away. Because I had no contact with girls other than my sister and my mother, I felt awkward making eye contact with girls for more than 2 seconds.</p><br/><p>“Then we’ll enter.”</p><br/><p>“Haa, I hope we succeed this time.”</p><br/><p>“Not being able to come back here for a week… it’s too cruel.”</p><br/><p>As the party members murmured and prepared themselves, Ellos slowly pushed open the door. A familiar sight filled my eyes. There were fourteen orcs and the Orc Lord was at the deepest part, biting off on a piece of meat.</p><br/><p>You bastard, you’re going to become a pig at this rate. Ah wait, you already are.</p><br/><p>“Commence battle! We’re going to kill the other orcs first! Paul, hold off the Orc Lord!”</p><br/><p>“Roger!”</p><br/><p>“Miss Palludia, focus your healing on Paul! Miss Esis, support Paul! Everyone else, we’re going after the orcs one by one, starting from the left!”</p><br/><p>I ran out. Although the orcs attacked me, unlike last week, I had comrades. In this party, we had two archers. One aimed at the Orc Lord and the other aimed at the orcs attacking me. I made use of the time he earned me, shooting out with my spear and quickly killing an orc.</p><br/><p>“Next!”</p><br/><p>“Wow, you’re doing great, mate!”</p><br/><p>“Haaaap!”</p><br/><p>“Guooooo!”</p><br/><p>As the party members and I fiercely fought off the attacking orcs, the Orc Lord’s cry resounded throughout the room. To even consider fighting against him alone… how foolish I was.</p><br/><p>I could hear Paul, the warrior who was fighting the Orc Lord, letting out several grunts.</p><br/><p>“My HP is going down fast! Miss Palludia!”</p><br/><p>“I know! Healing!”</p><br/><p>No way, that healing is THE healing from games? I was just about to turn and see with my own eyes when I realized it might trouble other people. I turned back to the orc I was facing. Like hell I’d leave myself open for attack!</p><br/><p>“Hap!”</p><br/><p>“Another one-hit kill. I’ve never seen anything like it!”</p><br/><p>“You can do it too!”</p><br/><p>“I can’t. Ah, here comes another one!”</p><br/><p>“Haaaaap!”</p><br/><p>“Kuhahahaha! Orcs, RISE!”</p><br/><p>[Orc Lord used ‘Warcry’! All orcs have been cleared of any negative status effects! All orcs temporarily become super-armored. Their attack power increases by 50%!]</p><br/><p>“Bullshit! A mere orc is able to use Warcry?”</p><br/><p>A female swordsman who was swinging her sword next to me yelled out and cursed. She was one of the women from Palludia’s Luka continent. She was using a rapier and had an elegant appearance. Realizing that you really can’t judge a book by its cover, I silently attacked with my spear.</p><br/><p>I didn’t know what a super-armor was, but I could still kill orcs with a single blow. When I diligently killed my sixth orc, I suddenly heard Ellos’ shout.</p><br/><p>“Paul!”</p><br/><p>“Cough! I’ll go on ahead, see you at the palace.”</p><br/><p>[Party member Paul Von Cravis has died.]</p><br/><p>Seeing the message use an ominous word like death, I complained to the message noona. As this was the first time I was doing a party play, it was something I did not want to experience. It seemed Ellos was more shocked than me, which made sense considering they seemed to from the same continent and had even climbed to the 5th floor together.</p><br/><p>“Kuk, super-armor it says. Damn it… I’ll tank! Miss Shuna, help me! It’ll be difficult with just me alone!”</p><br/><p>“G-Got it!”</p><br/><p>A delicate girl, who was using her wooden shield to barely block the orcs’ attacks, answered with a weak voice. Then, as she ran towards Ellos, she tripped on a dead orc’s glaive and fell.</p><br/><p>“Ow! Hueee…”</p><br/><p>“Miss Shuna!”</p><br/><p>“Hueee!”</p><br/><p>How did a girl like her end up with a shield…? As I pierced my spear through the eighth orc, I made an expression of disbelief as I looked at Shuna running to Ellos while crying. As if she had read my expression, the rapier-using woman looked at me and said with a bitter smile.</p><br/><p>“Shuna is a princess of a small kingdom. According to her, everyone in her lineage is blessed by their guardian god to have an abnormally strong constitution. But because she had no talent with any weapons, she was left with no other choice than to wield a shield.”</p><br/><p>“Wow, a blessing?”</p><br/><p>It really was like a fantasy world. Well, I guess my life wasn’t that different.</p><br/><p>“Don’t look away!”</p><br/><p>“Ah, sorry!”</p><br/><p>There was only one orc left other than the Orc Lord. Because of this super-armor, it seemed unfazed by incoming attacks as it charged forward. As such, another party member got kicked out. It was Palludia’s job to heal him, but she was preoccupied with healing Ellos and Shuna.</p><br/><p>“Kuaaa! Die!”</p><br/><p>“Kuk! Miss Palludia!”</p><br/><p>“Hiing, Ludiaaaa!”</p><br/><p>“I’m doing my best! Healing!”</p><br/><p>“We should take care of him quickly and go help!”</p><br/><p>“Kuk, this coming from someone who killed more than half the orcs… it sounds like a taunt…”</p><br/><p>I defeated the last orc with the other party members. Now, only the Orc Lord was left. However, the situation didn’t call for any peace of mind. Unsurprisingly, Shuna had been unable to handle the Orc Lord’s attacks and was kicked out.</p><br/><p>“Shunaaa!”</p><br/><p>“Kuaaaaa!”</p><br/><p>When Shuna’s body turned to small particles and scattered, Palludia’s eyes rolled back and she charged toward the Orc Lord as she swung her staff. She almost looked like Jeanne d’Arc. In other words, it seemed like she would be whisked away with fire.</p><br/><p>“T-This mad princess!”</p><br/><p>“No, why is our healer charging forward!?”</p><br/><p>Now, I was beginning to understand how similar this dungeon was with a game. I knew fully well what would happen if our healer got kicked out. As such, I charged toward the crazy girl. Thankfully, it seemed like the super-armor had ended as Ellos managed to hold off the Orc Lord’s attacks. Even so, Palludia would be in danger if she entered the Orc Lord’s attack range.</p><br/><p>“You pig!!!!”</p><br/><p>“Kuoooo!”</p><br/><p>Palludia charged forward swinging her staff. The Orc Lord seemed to respond, as it raised its fists up.</p><br/><p>‘Damn it, I’m going to be late!’</p><br/><p>I ran forward as fast as I could.</p><br/><p>“Diiiieeee!”</p><br/><p>“Kuooo!”</p><br/><p>“You crazy…!”</p><br/><p>Right before the Orc Lord’s fist fell on Palludia, I managed to reach her. I quickly pushed her to the side, and as I saw the Orc Lord’s fist about to pour down on me, I could only think of one thing. ‘Gee, that’s one big fist.’</p><br/><p>Kwang!</p><br/><p>I died.</p><br/><p>Of course, I couldn’t re-enter the dungeon for a week.</p><br/><p>The week where I couldn’t enter the dungeon always went by in a breeze. Sweating blood as I traded blows, sword against spear with monsters, was vastly different than spending my days going to school and talking with friends.</p><br/><p>If being a dungeon explorer was casting forth my life, then my school life was like dreaming of peace and happiness.</p><br/><p>Dreams were nice. They were happy, were not painful, and were fun. But it wasn’t fun when it continued for a whole week. There was no meaning to such a life. It felt suffocating and irritating. For me who was used to living the intense life of fighting monsters, a life of no danger and pain was… terrifying.</p><br/><p>Although my father now entered the dungeon to earn money as the head of a household, his initial goal must have been different. Just like me, it must have been with an excited mind that he charged into the dungeon to show off his strength.</p><br/><p>I had devoted my entire life to my spear technique. It was powerful enough to send any slime, honey bee, goblin, or orc flying. It was a sense of pleasure hard to describe with words. It was almost like… a drug.</p><br/><p>“I wonder if they succeeded.”</p><br/><p>A week later, I once again stood in front of the boss room. I had thrown away any thought of trying to kill it by myself. I let out a sigh. Just as I was about to open the party recruitment window, a voice itched in my ears. In the corner of my eyes, a small window had appeared.</p><br/><p>[Ellos Von Kasina invited you to a party. Would you like to accept?]</p><br/><p>“Eh…?”</p><br/><p>What’s this? Don’t tell me they couldn’t finish it off? I tilted my head and accepted the invite. Just like before, I felt a tinge of dizziness engulf me. Before I knew it, I was surrounded by all the members of the previous party.</p><br/><p>“Ah, you accepted, Mister Kang Shin.”</p><br/><p>“Mister Ellos…”</p><br/><p>I stared at him with a look of bewilderment. He reached out with his hand and I met it with my own hand. I looked around and once more reaffirmed that everyone from the previous party was here. Although I would have preferred otherwise, Palludia and the others of the Luka continent were also here. However, unlike her past confident self, she was looking down, dejected. It wasn’t hard to understand why.</p><br/><p>“Did you guys… fail?”</p><br/><p>“Mm, it’s embarrassing to admit, but yes. We were wiped out.”</p><br/><p>“Wiped out…”</p><br/><p>“Hahaha, floor masters are said to be extremely strong. It would be weird if we succeeded on our first or second try.”</p><br/><p>Although Ellos was trying to laugh it off, Palludia wasn’t buying it. This time, however, the target of her resentment was different.</p><br/><p>“It’s my fault…”</p><br/><p>“Haha, it’s not just Palludia-nim’s fault.”</p><br/><p>“It’s my fault. I got too heated and let Orc die…”</p><br/><p>“If by Orc, you’re talking about me, it looks like you haven’t learned your lesson yet.”</p><br/><p>“Eeek! … huu.”</p><br/><p>Palludia seemed like she would burst after what I said, but she calmed herself back down when the rapier-woman poked her side. When I looked at Ellos, he made a bitter smile as he shook his head. I knew she wasn’t really feeling apologetic, but it would be enough if she wouldn’t repeat the same mistake as last time. I let out a sigh.</p><br/><p>“I don’t have to kill two orcs again before I enter, right?”</p><br/><p>“Haha, of course not. We know fully well how capable you are. If you perform like last time, we’ll do our best to fulfill our roles.”</p><br/><p>“Kuk…”</p><br/><p>“Please, mate. We all believe in you!”</p><br/><p>“You were amazing last time.”</p><br/><p>“T-Take care of us.”</p><br/><p>“Mm, you’re reliable[1. In Korean, the word for reliable is also used to describe someone with a heavy frame.] just like your looks. Oppa, you would be just my style if you lost some weight. Your face is handsome too…”</p><br/><p>The last one was from the rapier-carrying woman. No matter who looked, I was the younger one! Also, this wasn’t fat, it’s muscle!</p><br/>\n</div>"}