{"title": "Chapter 19. Fall's New Students (1)", "id": 19, "volume": 1, "url": "http://boxnovel.org/infinite-competitive-dungeon-society-chapter-19-falls-new-students-1", "volume_title": "Volume 1", "body": "<h1>Chapter 19. Fall's New Students (1)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 19. Fall's New Students (1)</p><br/><p>“Kyaa! Mom, oppa’s looking like his soul’s been sucked out!”</p><br/><p>“He’s been like that for a while. He seems depressed. Go console him, you guys get along.”</p><br/><p>“Haha, I defeated the Wraith Queen alone… Mm, yup. That won’t change. But the Dark Ratman…”</p><br/><p>“Oppa, oppa! Snap out of it!” An angel from above… no, Yua shook my shoulders and I flopped about with no resistance.</p><br/><p>Yua had a cute voice. She was the support that prevented me from falling. If Yua ever got a boyfriend, what should I do? Should I tear his limbs apart or should I kidnap… huk!</p><br/><p>“Oppa!”</p><br/><p>“Y-Yua.”</p><br/><p>“Are you okay? Haa.”</p><br/><p>When her scream woke me up from my daze, Yua let out a sigh of relief. Was she really worried that something was wrong with me? Kuk, how cute.</p><br/><p>“Haha, no need to worry, Yua. Oppa is fine.”</p><br/><p>“But you looked so soulless. You were murmuring something to yourself too.”</p><br/><p>“You’re right… well, oppa just experienced some failure, is all.”</p><br/><p>“Failure?”</p><br/><p>“Yep. It looks like I was too arrogant.”</p><br/><p>I remembered what happened just a moment ago. After saying goodbye to Loretta on the 10th floor, I rushed to the 15th floor boss room. I entered a random party and challenged the Dark Ratman.</p><br/><p>“Alright, let’s get this over with and move up!”</p><br/><p>The party leader was a middle-aged swordsman. That was perhaps why he was talking down to the party members. It was then that I started to feel apprehensive.</p><br/><p>Including me, the party consisted of dungeon explorers from five different continents. No party could be successful without harmony among its members. However, with the party leader being so oppressive, it was hard to do. Sure enough, my apprehensive feeling came true.</p><br/><p>“Come on, kill the ratmen!”</p><br/><p>“You’re just charging straight at the ratmen! We should have discussed beforehand who would tank and who would lure the ratmen!”</p><br/><p>First, the party leader and our damage dealer began to argue, while I silently hunted ratmen on the side. If not, the boss fight would have ended much quicker.</p><br/><p>There were two healers, both from different continents than the party leader. As such, they made unsightly expressions at party leader’s oppressive tone. At the same time, our tanker, who was from the party leader’s continent, got along well with him.</p><br/><p>“Kikikiki! Don’t look down on me just because I’m a rat!”</p><br/><p>“Kill that rat bastard!”</p><br/><p>The Dark Ratman was 2 meter tall, comparatively smaller than the other Floor Masters. As such, I thought that our tanker would be able to handle him. Of course, I was wrong.</p><br/><p>“Kikik! Kikik!”</p><br/><p>“Kuk, this rat’s attacks are too heavy! Heal!”</p><br/><p>“Fuck…”</p><br/><p>The tanker had the same personality as the party leader. The healers seemed almost reluctant to heal. As a result, there were times where their timings were off. The party leader was clearly focused on attacking the Dark Ratman to collect contribution points. Our damage dealer, who had argued with the party leader, ended up missing some ratmen, which headed towards our tanker.</p><br/><p>“What? Hey, what are you doing!? Get these off of me!”</p><br/><p>“Fuck, just focus on the Dark Ratman!”</p><br/><p>“Ah!”</p><br/><p>As the tanker and party leader yelled irritably, the Dark Ratman became free to do as he wanted. I was hunting the ratmen one by one, but when I heard this, I rushed toward the Dark Ratman.</p><br/><p>Although our smart magician instantly changed his target to the Dark Ratmen and cast an attack magic at it, the Dark Ratman was unfortunately too fast.</p><br/><p>“Kikikik! I’ll burn you all up!”</p><br/><p>[Dark Ratman uses Dark Thunder Explosion!]</p><br/><p>What followed was an unforgettable sight. In an instant, a dark light burst out from the Dark Ratman’s body and struck the party leader and tanker who were closest to it. The two of them burnt up in an instant and kneeled. I thought it would end there, but I was wrong. It was only the start.</p><br/><p>“Kikikik! It’s a lightning party! Kikik!”</p><br/><p>BOOM!</p><br/><p>Just like the name suggested, black lightning exploded out. Both the party leader and tanker died in an instant, and I, who ran after the Dark Ratman, was no exception.</p><br/><p>Neither my high HP nor my Orc Lord equipment were of any help. They only made the pain last longer. I lost consciousness, and when I woke up, I was outside the dungeon.</p><br/><p>It was my fault. Or at least, I thought it was.</p><br/><p>I had thought I could defeat the Dark Ratman no matter what these idiots did. For that reason, I didn’t try to stop their arguments nor did I say anything against the party leader’s foolish commands.</p><br/><p>Now that I thought about it, I shouldn’t have stayed in that party in the first place. The moment I realized how dysfunctional it was, I should have left and looked for another one.</p><br/><p>Finally, I should have attacked the Dark Ratman myself instead of relying on my party members. At the time, I was playing around too much. So much so that I was done in while I was hunting the ratmen minions. It was inexcusable.</p><br/><p>I was too excited from defeating the Wraith Queen alone. Even though I clearly knew there were 100,000 people above me! On Earth, not to mention the SS-rank, even the A-rank were stronger than me! No, perhaps even the B-rank were stronger. The dungeon was a place where one had to be alert at all times. Since I was fooling around with my guard down, it was only obvious that I died.</p><br/><p>As I was reproaching myself, Yua suddenly placed her hand on top of my head.</p><br/><p>“You can do it, oppa.”</p><br/><p>“Yua…”</p><br/><p>“I believe in oppa. You can definitely do it.”</p><br/><p>“But…”</p><br/><p>“Everyone makes mistakes, oppa.”</p><br/><p>Yua slowly rubbed my head. I closed my eyes and waited for her words. At the same time, I became more relaxed.</p><br/><p>“Oppa, someone who learns from his mistakes can do anything. So it will be the same for you, oppa.”</p><br/><p>“… You’re right. Thanks, Yua. I promise you, I won’t make another mistake. I won’t be kicked out of the dungeon ever again.”</p><br/><p>Yua’s words gently healed my broken self-esteem. If I stayed depressed after hearing that, I wouldn’t be a man. I resolved myself to never let my guard down, to never make such mistakes, to never be kicked out of the dungeon again!</p><br/><p>I patted my admirable sister’s head. Yua squealed with her cute voice and twisted her body in delight without letting go of me. It was the sibling relationship I had wanted for such a long time.</p><br/><p>Knowing how to comfort her brother… Yua had all grown up! Oppa swears he will make you happy! Hm, that doesn’t sound right. Right, I will protect this angel’s smile!</p><br/><p>Having regained my energy from Yua’s magical words, I clenched my fists. Suddenly, a crashing sound rang out. When I looked, mother was trembling as she stared at us from the kitchen. On the ground was a frozen pork neck. She should really buy pork belly with how much father makes.</p><br/><p>“N-No, you can’t! You guys are blood related! Don’t you dare think about it!”</p><br/><p>“I said that’s not it! Is that all you think about, Mom?”</p><br/><p>“But it’s too suspicious! Why else would two grown-ups be all over each other on the couch!?”</p><br/><p>Damn, being too awkward was a problem, but being too close is a problem too…!? With no one to complain to, I could only hold in my anger at the unfairness.</p><br/><p>A week later, I challenged the Dark Ratman to a revenge match. This time, the party I was in gave off a good vibe. That said, I had planned to continue until I could defeat the Dark Ratman alone. It was best if I did not rely too much on my party. It would be fine as long as they didn’t hinder me.</p><br/><p>“Could it be…? Crown Prince-nim?”</p><br/><p>However, the female party leader seemed to know me. Who was she? She was a beauty with pearl white skin, a blonde ponytail, and a sparkling green iris.</p><br/><p>I had no recollection of meeting such a pretty girl. I asked if she heard of me from rumors, but she shook her head.</p><br/><p>“Thanks to Crown Prince-nim, I broke through the 5th floor two years ago. I’m still grateful for it. Back then, I couldn’t fulfill my role no matter what party I was in, so I became depressed, thinking I wasn’t suited for the dungeon. I challenged the Orc Lord as a final challenge, and that was when I entered your party.”</p><br/><p>“Ah… I see.”</p><br/><p>“You were really cool that day… Following Crown Prince-nim’s commands, I gained confidence in myself. I was able to defeat my fear and stab my sword through the Orc Lord. After we defeated it, my confidence grew and I arrived here, partying with my comrades from the Luka continent.”</p><br/><p>10 floors in 2 years. Although it was slightly slower than Ellos or Palludia, they were among the top in both talent and effort. A girl who was stuck on the 5th floor climbing this far in two years was undoubtedly praiseworthy.</p><br/><p>I didn’t hesitate to reveal my thoughts.</p><br/><p>“That’s incredible. You must have put in a lot of effort.”</p><br/><p>“Ah, you were less informal then… can you talk casually like in the past? It would be too awkward otherwise…”</p><br/><p>“No, how could I?”</p><br/><p>Casual? I talked like that to a grown-up woman like her? Where were my manners?</p><br/><p>Seeing me act flustered, she shook her hand as she giggled.</p><br/><p>“No, you did. Because two years ago, I was a little kid who wasn’t even 130 sihai.”</p><br/><p>“… Yes?”</p><br/><p>Sihai. It was Luka continent’s unit of measurement, equivalent to about 1.1 centimeter. In other words, she would have been about 143cm two years ago. But how was that possible? She looked well over 160cm now. How could anyone grow so much in two years? Now to mention, her amazing chest size… kuhum.</p><br/><p>“Huhu, you’re cute when you’re flustered.”</p><br/><p>“No, that’s…”</p><br/><p>“You don’t have to be so surprised. People from the Luka continent experience a huge growth spurt at a certain age. It’s a little more than people from other continents, so I suspect it’s our people’s special trait.”</p><br/><p>“Ah, I see.”</p><br/><p>It made sense. Even though we all looked like humans, we were from different worlds. Our growth periods being different wasn’t so hard to accept. But for some reason, the word Luka continent seemed to remind me of someone.</p><br/><p>‘Well, it’s probably nothing.’ With that, I put away the thought.</p><br/>\n</div>"}