{"title": "Chapter 15. Dungeon Explorers Can Awaken Too? (1)", "id": 15, "volume": 1, "url": "http://boxnovel.org/infinite-competitive-dungeon-society-chapter-15-dungeon-explorers-can-awaken-too-1", "volume_title": "Volume 1", "body": "<h1>Chapter 15. Dungeon Explorers Can Awaken Too? (1)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 15. Dungeon Explorers Can Awaken Too? (1)</p><br/><p>What did I do after that? I, of course, went straight to the 11th floor. My situation was different than before. Three years ago, I had to remain on the 5th floor hunting the Orc Lord because I couldn’t advance through the 6th floor. Now, I could do things a little smarter.</p><br/><p>Dungeon explorers became unable to challenge Floor Masters once they defeated the next one. In other words, as long as they did not defeat the next Floor Master, they could always go back and challenge the previous Floor Master. In short, before I defeat the 15th Floor Master, I could always re-challenge the Wraith Queen.</p><br/><p>Between level 11 and level 15, there was at least a 500 mana difference. There was no need to take the hard path when the easy one was so readily available. As such, I decided to explore the 11th floor. When Loretta saw me heading up from the 10th floor, she trembled and said, “T-That method is… unfair.”</p><br/><p>“Unfair?”</p><br/><p>“What I wanted was for customer to challenge the boss at level 10…”</p><br/><p>“But you didn’t say that yesterday.”</p><br/><p>“…”</p><br/><p>“Haa. I understand, noona. I agree that leveling up to level 15 and challenging the Wraith Queen is slightly unfair.”</p><br/><p>“Customer! Then…”</p><br/><p>“But the world of competition is cruel.”</p><br/><p>Loretta made a sulking expression. Because it was too cute, I couldn’t help but laugh.</p><br/><p>“Hahahaha! Even so, as far as I know, defeating the Wraith Queen alone should be hard even at level 15.”</p><br/><p>“Of course, it is. I have only seen it happen twice.”</p><br/><p>“Hm, so there is precedent.”</p><br/><p>“Of course. If you think you will be the first in everything you do, you are mistaken. Though, you are the first in the past 200 years…”</p><br/><p>“What was that at the end?”</p><br/><p>“No, it’s nothing. Well, customer, it looks like you discovered a loophole in my quest. Then, try your best.”</p><br/><p>“I sense great malicious intent in what you said…”</p><br/><p>“What was that? Ah yes, the item you need for the 11th floor is this! The Rat Trap! This great item is now selling for a mere 100 gold.”</p><br/><p>“I didn’t ask!”</p><br/><p>I had more or less expected it when Loretta talked about Rat Traps, but the monsters on the 11th floor were the infamous ratmen. You could simply think of them as 1 meter tall rats walking around on their hind legs. They had long, sharp tails that swung around like whips and were difficult to attack due to their quick movements.</p><br/><p>Moreover, they did not travel alone. When you spotted one, there would undoubtedly be five more behind it. Their reproductive capabilities were like that of cockroaches. That said, I already had experience stabbing flying cockroaches to death. It wasn’t so hard for me to follow some rats’ movements.</p><br/><p>“Ugh, I get goosebumps every time I see them!”</p><br/><p>“Kiaak! Human kill rat!”</p><br/><p>“That’s right, today will be an extermination day!”</p><br/><p>Fighting against ratmen who always ambushed in groups, my battle sense grew significantly. As I always stayed alert, predicting where they would come from next, I began to acquire the ability to grasp my surroundings. Because I was not on a timer this time, I spent about a week to slowly grow my battle sense.</p><br/><p>All the ratmen on 12th and 13th floor would also be stronger, I knew their movements couldn’t be too different. As such, I decided to grasp all their movement patterns on the 11th floor. This took an additional week.</p><br/><p>“Huhu, it’s not so easy anymore, is it?”</p><br/><p>After seeing me for the first time in two weeks, Loretta asked with a satisfied expression. It seemed she thought I wanted to give up on the Wraith Queen quest, so I smirked and answered her.</p><br/><p>“Hey, do you want to make an additional bet?”</p><br/><p>“… No, I don’t,” said Loretta making a triangle mouth. I couldn’t help but laugh again.</p><br/><p>“You shouldn’t make fun of this noona!”</p><br/><p>“You can’t be that much older than me.”</p><br/><p>“You’d be surprised. I’m much older than you could ever imagine!”</p><br/><p>“Really? Can I still call you noona?”</p><br/><p>“Hmph, only a pervert like customer would call a strange shop owner noona.”</p><br/><p>“I’m looking forward to continue working with you, Loretta noona.”</p><br/><p>“Kuu…”</p><br/><p>In truth, I had no experience interacting with women. Besides my angelic younger sister Yua, there was no one of the opposite sex that I talked to regularly. Although I had quite a few close female friends when I was in elementary school, things changed when my muscles began to grow.</p><br/><p>As a result, Loretta was the first girl outside of my family that I talked with for such a long time. I couldn’t help but feel that I was pitiful. How did things come to this…?</p><br/><p>“Whew, I know I’m beautiful, but I’ll be troubled if you approach me.”</p><br/><p>“No, I’m not really interested as a man.”</p><br/><p>When I told her flat out, Loretta smacked me.</p><br/><p>“How rude! Apologize! Apologize and buy this Rat Trap!”</p><br/><p>“What does the Rat Trap have to do with this?”</p><br/><p>“Come on, hurry up!”</p><br/><p>“Sigh. Then I’ll buy five for now.”</p><br/><p>“That will be 500 gold, customer. Since you didn’t apologize, you should buy five more.”</p><br/><p>“Sorry, five is fine.”</p><br/><p>Just like always, my conversation with Loretta ended with gold. Seeing her undying professionalism, I pledged to never judge a woman by her looks.</p><br/><p>With five Rat Traps in hand, I walked up to the 12th floor. As I did, I thought, ‘I seem to be forgetting about something… well, whatever. It can’t be anything important. Yep.’</p><br/><p>One month from then, on the 14th floor, I was running from a hailstorm of lightning.</p><br/><p>“Come on, what kind of rats shoots out lightning!?”</p><br/><p>“Pika… pika pika!”</p><br/><p>“Shut it, you fakes!”</p><br/><p>‘Pika my ass!’ I silently complained as I ran away from the five-for-one Electric Ratmen.</p><br/><p>I had wondered why the 13th Floor Shop was selling Lightning Resistant Robes. Because it cost 10,000 gold, I left without turning back, but now I was regretting it.</p><br/><p>“Pika!!”</p><br/><p>“Agh, shut up! Tempest!”</p><br/><p>My Orc Lord’s Glaive trembled and shot out a gale in a straight line. Tempest tore apart the ratmen’s lightning along with their bodies.</p><br/><p>“Pikaaaaaaa!”</p><br/><p>“Just die already!”</p><br/><p>I shuddered and stopped in place. Gasping for breath, I checked and saw that I had about half my mana left. Adjusting my breath calmly, I initiated Peruta Circuit. Of course, even as I circulated mana, I didn’t forget to use my ears.</p><br/><p>Ratmen were fundamentally different than orcs and wraiths. They knew all too well exactly when and how to annoy explorers. They popped up from the most unexpected places at the most unexpected time. They were driving me crazy.</p><br/><p>If I wanted to rest, I had to throw down a few Rat Traps in the area. I was only using the Peruta Circuit because I had some strength left.</p><br/><p>KaTalk!</p><br/><p>At that moment, my phone buzzed. What was that? You didn’t think phones worked in the dungeon? Nope, they worked perfectly fine. How else would I communicate with the outside? I needed to run to Yua if she ever needed me!</p><br/><p>I picked up my phone. It was a message from father.</p><br/><p>[I awakened.]</p><br/><p>“…. What?”</p><br/><p>I couldn’t help but speak my thoughts out loud. He uh… what? Awakened?</p><br/><p>“…”</p><br/><p>I calmly thought about what he meant. Because I had been too focused in fighting the ratmen, I couldn’t think critically.</p><br/><p>‘I see…’ I knew what it meant when someone ‘awakened’.</p><br/><p>KaTalk!</p><br/><p>[You might find it hard to believe, so come see it for yourself.]</p><br/><p>“Father awakened!?”</p><br/><p>That meant father had become an ability user!</p><br/><p>I quickly left the dungeon. As long as I wasn’t in battle, I could exit the dungeon at any time through my phone. The moment I came out, I saw father waiting for me on the couch.</p><br/><p>“Father, you became an ability user?”</p><br/><p>“Yes. I didn’t think it was possible. You jealous?”</p><br/><p>“What ability is it?”</p><br/><p>“Mm, I’ll show you. Here.”</p><br/><p>Father’s eyes turned serious. He pulled his fist back, then pushed it forward. Suddenly, I felt like his fist was flying toward me. He had clearly not moved his fist, but I trusted in my instincts honed by experience and quickly ducked. Surprisingly, something passed over my head in an instant and hit the wall, leaving a crack.</p><br/><p>“A shockwave.”</p><br/><p>“Yep.”</p><br/><p>“Freaking awesome.”</p><br/><p>“Freaking awesome indeed.”</p><br/><p>Father nodded his head in agreement. He was already strong, but to think he would obtain a shockwave ability! I was dying from jealousy. I was recently thinking that I had gotten stronger, but just like this, the scale had been flipped.</p><br/><p>“How did you awaken, father?”</p><br/><p>“You see, I saw a dream.”</p><br/><p>“A dream? What dream?”</p><br/><p>“Dungeons.”</p><br/><p>“… Dungeons?”</p><br/><p>“Countless dungeons appeared on Earth. They were not like the First Dungeon we are familiar with. From them, countless monsters began pouring out, and us humans did our best to stop them. Some had swords clad in auras, some shot out flames from their hands, and some used telekinetic power. Various abilities were being used to stop the monsters’ onslaught.”</p><br/><p>“I was among them. I held a spear in my hands and was beating down monsters one by one. Then, I used shockwaves to kill a knight wearing strange armor. When I woke up, I could use shockwaves just like in my dream.”</p><br/><p>No ability users had revealed how they had obtained their abilities. As such, I had no way of knowing whether father’s method was normal. Assuming that everyone obtained their abilities in the same way, were these precognitive dreams or triggers for obtaining abilities? Perhaps they were both true.</p><br/><p>Regardless, I was still extremely jealous.</p><br/><p>“Huhu, son, guess what? In the process, I even gained some mana. Jealous?”</p><br/><p>“Eh? Then what about the Orc Lord?”</p><br/><p>“… cough.”</p><br/><p>“Okay, never mind.”</p><br/><p>It seemed repeatedly hunting the Orc Lord was hard even for father. To maintain father’s honor, I decided not to ask about it.</p><br/><p>Just like that, father became an ability user. He quit the Orc Lord raid and advanced to the next floor.</p><br/><p>Two months after Two Moon, two weeks after father had awakened, I reached the 15th floor.</p><br/><p>[You became level 15. You have obtained the qualifications to challenge the Floor Master.]</p><br/><p>[You obtained 5 bonus stats.]</p><br/><p>[Name: Kang Shin     Race: Human     Sex: Male</p><br/><p>Class: None     Title: Orc Lord Slayer     Rank: Bronze 4</p><br/><p>Level: 15</p><br/><p>HP – 4,540/4,540     MP – 1,840/1,840</p><br/><p>Strength – 45(+8)     Dexterity – 42(+1)     Constitution – 51(+6)</p><br/><p>Intelligence – 20(+1)     Magic – 28(+1)     Charm – 17(+1)     Luck – 10(+1)</p><br/><p>Skill – Low-rank Martial Arts (Master), Low-rank Spear Technique (Master), Mid-rank Spear Technique (Master), High-rank Spear Technique (Lv 3), Peruta Circuit (Lv 2), Deific Manifestation]</p><br/><p>My current self could easily handle three of my level 10 selves. I felt confident that I could even deal with the 15th Floor Master. Of course, I didn’t have the leisure to play around with Dark Ratman. I immediately turned back. 14th Floor Shop’s Loretta was already glaring at me.</p><br/><p>“Customer, you really went all the way to level 15. That is not adult-like.”</p><br/><p>“What do you mean, this is exactly what an adult would do.”</p><br/><p>“Meanie…!”</p><br/><p>“Take good care of me. After all, we are in a relationship of mutual dependence.”</p><br/><p>I taunted her with a wink, and as expected, Loretta became angry.</p><br/><p>“I won’t give you any discounts, customer!”</p><br/><p>“Yeah, yeah. You’re very cute.”</p><br/><p>“Kuaaa! This is the first time a human called me cute! How humiliating!”</p><br/><p>“Then see you later!”</p><br/><p>“Go die!”</p><br/><p>I rushed down to the 10th floor. Of course, climbing down posed no problem whatsoever. This was where it began!</p><br/><p>‘The Wraith Queen grind starts now! I swear, I’ll hunt one of you every day!’</p><br/>\n</div>"}