{"title": "Chapter 25. I Can Hear Your Voice (2)", "id": 25, "volume": 1, "url": "http://boxnovel.org/infinite-competitive-dungeon-society-chapter-25-i-can-hear-your-voice-2", "volume_title": "Volume 1", "body": "<h1>Chapter 25. I Can Hear Your Voice (2)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 25. I Can Hear Your Voice (2)</p><br/><p>The Dark Ratman was fundamentally different from the Wraith Queen or the Orc Lord. The Orc Lord had nothing but brute strength and the Wraith Queen had a clear weakness. However, the Dark Ratman was fierce, possessing a strong attack power and a powerful skill. His minions were also nothing to scoff at.</p><br/><p>I led a party of ten to challenge the Dark Ratman. Although we succeeded, three of us had died.</p><br/><p>“Thank you! Thanks to Crown Prince-nim, we can finally challenge the 16th floor!”</p><br/><p>“As expected of the One Who Leads the Path!”</p><br/><p>“Crown Prince! Crown Prince!”</p><br/><p>Just like the explorers from the 10th floor, the six surviving members bowed and thanked me, or chanted my name. At this rate, they might even pick me up and toss me into the air. I knew it wasn’t my place to say, but if they continued climbing up by relying on others and not on their own strength, they would eventually be brought to their knees.</p><br/><p>After saying my goodbyes, I left the boss room. Then I fell on my butt and murmured, “Whew, strong. Too strong.”</p><br/><p>When my level was low, a small difference in stats made a big difference. However, the Dark Ratman was the Floor Master of the 15th floor, and I was level 20. Now, it seemed a difference of 5 levels was only a mere difference of 5 levels. Even though my stats were abnormally high from the Compressing Elixirs and Soul Tempering Pills, it was still not enough to make a decisive difference.</p><br/><p>Since my stats could not overwhelm it, I could only do so by experience. I needed to read all the ratmen minions’ movements and prevent the Dark Ratman from attacking me while I took care of them. I also needed the ability to escape from the Dark Ratman’s fearsome skill without failure.</p><br/><p>Of course, the goal was to let all the party members avoid it, not just me. From my experience, it was rather simple. As long as the ratmen minions were taken care of that is.</p><br/><p>“Now! Get back!”</p><br/><p>“Kugagagak! It’s a festival of lightning!”</p><br/><p>That bastard’s way of talking was the same as ever! At my shout, the party members backed off, and the Dark Ratman’s lightning only burnt through empty air. I disregarded the burning smell and charged at his body. Shining out with radiant white light, my Heroic Strike penetrated his abdomen. Now that it had become a skill, it had a wonderfully short charging time.</p><br/><p>[Critical Hit!]</p><br/><p>“Kugagagagak!”</p><br/><p>As Dark Ratman cried out in its death throes, I let out a sigh of relief and looked around. One, two, three… eight, nine. Perfect. Everyone was alive.</p><br/><p>“Oh, Crown Prince!”</p><br/><p>“All hail Crown Prince!”</p><br/><p>“To defeat the Dark Ratman without any casualties!”</p><br/><p>“This is the first time I’ve heard of such a thing happening. To think I’d become the witness of history. Crown Prince…”</p><br/><p>It took 3 days until I succeeded in defeating the Dark Ratman with all party members surviving. In other words, it had taken me 9 boss fights. Of course, with me taking the top contribution for all of them, I was able to take the Thunder Crystal 8 times and the Dark Ratman’s Leather Vest for the other.</p><br/><p>It seemed I was getting the hang of it now. Thinking about slowly lowering the number of party members and completely destroying the Dark Ratman, I could not help but get excited like a child. As I was immersed in my thoughts, the party members suddenly pounced toward me.</p><br/><p>“Crown Prince, Crown Prince!”</p><br/><p>“Hey, prepare to pick him up!”</p><br/><p>“Whooooo!”</p><br/><p>Stop! Just go up already!</p><br/><p>Then one day, just as I finished eating breakfast and prepared to go the dungeon, my mother stopped me.</p><br/><p>“Shin, school starts today, right?”</p><br/><p>“… Yes?”</p><br/><p>“It’s September 2nd, the first day of school.”</p><br/><p>“Ah.”</p><br/><p>I sometimes wondered if my intelligence stat was really 20. Perhaps the dungeon was lying to me. Today was another one of those days.</p><br/><p>When I asked Loretta about it, she said, “How can someone born with the intelligence stat of 20 be the same as someone who raised their intelligence stat to 20?” I was speechless.</p><br/><p>It seemed this applied to not just intelligence, but also strength, dexterity, constitution, magic, and other stats. When I thought about it, it made sense. I was originally adept in using my strength and moving my body, but when I saw other explorers, I wondered why they couldn’t move as well. Loretta’s words had solved this mystery.</p><br/><p>In short, raising one’s stats did not immediately make one stronger. There needed to be some time to adjust. Loretta jokingly called this ‘updating.’</p><br/><p>But how could I forget the first day of school!? It had been years since I raised my intelligence stat, how could it still be updating? Was it because I didn’t use my brain enough?</p><br/><p>With mother giving me the ‘don’t tell me you forgot’ face, I smiled bashfully.</p><br/><p>“I’ve been busy with the dungeon lately.”</p><br/><p>“Dungeon this, dungeon that. Your father’s been saying the thing. Do you have gold hidden in there?”</p><br/><p>“Doesn’t father bring you some every day?”</p><br/><p>“What about you?”</p><br/><p>“Eh? Well, I…”</p><br/><p>I turned away from her gaze. Sorry mother, with all the gold I’m spending to meet a friend, I don’t have any to bring home. But if I told her this, I got the feeling she would cut our tie of kinship. That would be troublesome. It meant I would not be Yua’s brother anymore.</p><br/><p>“How can I be the same as father? I don’t make as much. In fact, I spend more than I make.”</p><br/><p>“Well, that’s what I thought. Your father, though. Why isn’t he registering as an ability user?”</p><br/><p>Currently, father was frantically breaking through a dungeon floor. He should be on the 14th floor. As expected of the self-proclaimed Strongest on Earth, he swept through so many floors in just a few months.</p><br/><p>I knew exactly what father was thinking.</p><br/><p>“He’s a bit too weak right now.”</p><br/><p>When I told her that he was raising his level and Shockwave’s skill level, she tilted her head. It seemed there was something even mother did not know.</p><br/><p>I had no idea how an ability user developed their ability. I could only suspect that they grew with frequent use. It was also possible that abilities could not grow. After all, if it was so easily doable, there wouldn’t be so many F-rank ability users complaining on internet forums.</p><br/><p>However, it was simple for an awakened dungeon explorer to develop his skills. He just had to repeatedly use the skill and raise its skill level. As a bonus, he could also raise his mana stat with the level up stats points, making it all the more easy for skills to develop. All in all, there was no other bug like a dungeon explorer awakening as an ability user.</p><br/><p>When ability users awakened, they visited the government owned Ability Appraisal Center, and determined what category their ability fell into, as well as the amount of mana they held and their rank. Of course, since father did not have any plans to register as an ability user, he could only guess his rank from the power of ability users shown on TV worldwide. The result was D-rank.</p><br/><p>F and E-rank ability users were not deployed to fights against monsters. If they were, it was only as supports. Only at the D-rank did one have the power to fight against monsters. Of course, with father’s spearmanship and strength as a dungeon explorer, his real strength was well over D-rank. However, his ability itself was D-rank.</p><br/><p>Father, who thinks he should be the strongest on Earth, jumped at the prospect of his ability being labeled D-rank, and rushed into the dungeon.</p><br/><p>As a result of leveling up Shockwave’s skill level along with his own, he now had the strength of an upper C-rank ability user. Of course, he would continue to get stronger. Yup, I was jealous.</p><br/><p>However, father gave up on everything like Compressing Elixirs, Soul Tempering Pills, Orc Lord Set, and titles. He focused solely on climbing higher and raising his skill levels.</p><br/><p>Although it was a decision he made to quickly increase his strength and earn more money, I did not think it was wise. Complete conquering of the dungeon. I believed that this path I was taking was the way to infinitely grow stronger.</p><br/><p>“So… Shouldn’t you go to school?”</p><br/><p>“Yes, I will, Mom.”</p><br/><p>As I regretted scheduling my first class to be at 9 A.M. in the morning, I had to walk up the school’s annoying hillside road. Seeing the ginkgo trees[1. https://en.wikipedia.org/wiki/Ginkgo_biloba] lined up along the path, I smiled.</p><br/><p>“In a while, they’ll be extremely beautiful.”</p><br/><p>Ginkgo nuts fell and exploded, their pungent odor spreading out into the air.</p><br/><p>[Let’s do our best so more will grow next year!]</p><br/><p>[Ehew, I’m annoyed by all these old women picking up the nuts. We have to give them to the Queen.]</p><br/><p>Fall, a season wrought with the smell of ginkgos, was now coming to an end. There was less than two weeks before winter began. When the time came, I vowed to take the shuttle bus, instead of treading uphill in the cold.</p><br/><p>The lectures happened on the 2nd floor of the business management building. It was a class with over 100 people. Somehow the students had already gotten to know each other, as they chatted like they’d known each other for years. I, on the other hand, was standing outside the door, staring at them like I was from a different country. I had the feeling that campus life I dreamed of would not be happening.</p><br/><p>It was then that I felt a hand pulling on my sleeve. I turned around.</p><br/><p>“Gek, hoody girl.”</p><br/><p>“Su Ye-Eun!”</p><br/><p>“Right, Su Ye-Eun. It was nice seeing you again.”</p><br/><p>As I made a 180 degree turn and began to head towards a corner seat, Su Ye-Eun grabbed onto my sleeve again.</p><br/><p>“You…”</p><br/><p>“I still don’t know your name yet.”</p><br/><p>Su Ye-Eun was again covering up her head with a hoody. Even so, at a close distance, her face was in full view. Round eyes, aquiline nose, and full pink lips. She had all the qualities of a beauty. Of course, even if her beauty could topple Cleopatra off her throne, I wanted nothing to do with her!</p><br/>\n</div>"}