{"title": "Chapter 22. Fall's New Students (4)", "id": 22, "volume": 1, "url": "http://boxnovel.org/infinite-competitive-dungeon-society-chapter-22-falls-new-students-4", "volume_title": "Volume 1", "body": "<h1>Chapter 22. Fall's New Students (4)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 22. Fall's New Students (4)</p><br/><p>Since the Two Moon incident occurred around the school entrance season, all schools had to delay their opening by at least half a year. The teachers, who were on paid vacation, were the only ones happy about the situation. When things settled down and society returned to normal operations, schools began their semester-late opening.</p><br/><p>“School starting in the fall, huh.”</p><br/><p>I, who was hard at work to break through the 19th floor, received a notice from my college. It was now the start of September, a time when cool winds washed away the heat of summer.</p><br/><p>Thinking how the graduation would be messed up, I headed towards the school opening ceremony. With all the freshmen gathering with their puffed up cheeks, one would think it was a toad reunion. As I laughed to myself silently, someone silently brushed past me.</p><br/><p>“Whoa.”</p><br/><p>“…”</p><br/><p>Who I thought was a guy turned out to be a girl. She was covering herself with a grey hoodie, but her clear eyes and full lips strongly suggested her sexual identity. She seemed surprised by my shout as she stared at me fixedly, then tilted her head and walked away.</p><br/><p>I noticed something strange. She was clearly brushing past people, but no one seemed to notice. Although it could have been a coincidence, I knew the more likely answer.</p><br/><p>“Damn, she was an ability user.”</p><br/><p>I almost revealed my identity. Ability users were not required to join Guardian or Freedom Wing and fight monsters. I told myself to act more unmoved by strange happenings as I continued on my way.</p><br/><p>“Everyone must know by now how fortunate it is to enter college at such a tumultuous time and be taught by professors equipped with new found knowledge and passion! Before we send you off into society as a proud alumni of our school…”</p><br/><p>The university president’s speech was similar to my high school principal’s in that they both seemed to have strong sleep-inducing skills. As I pinched my thighs to keep myself awake, I suddenly felt a strange gaze.</p><br/><p>It was not a gaze filled with killing intent, but rather one of curiosity. Was it the ability user from before? As I promised to act more placid a moment ago, I ignored the gaze that was growing sharper. Although it seemed to contain a hint of killing intent, I continued to ignore it.</p><br/><p>The opening ceremony was a very long and boring event. Thinking I would rather fight two Dark Ratman at once, I endured through the ceremony.</p><br/><p>After the opening ceremony, the tradition was for new students to attend an introductory party, but as I had the important mission of going to the dungeon, I chose to skip it. As I secretly snuck out of the auditorium, I felt a presence approaching me.</p><br/><p>“Haa.”</p><br/><p>With a sigh, I started walking away, trying to ignore the presence. However, the presence continued to follow, approaching from the right side. Should I ignore it? Or should I avoid it? After a short contemplation, I decided to ignore it. However, the presence immediately clung to me. As expected, it was the hoody girl from before.</p><br/><p>“Who are you?”</p><br/><p>“Ah, you surprised me!”</p><br/><p>I acted surprised and brushed her aside. I was truthfully surprised. I did not expect her to jump on me like that. As I glared at her, she glared back at me.</p><br/><p>“Who are you? How did you see through my stealth?”</p><br/><p>“What about you? At first, you brush past me, now you suddenly jump on me.”</p><br/><p>“I’m an ability user.”</p><br/><p>“Ah…”</p><br/><p>Well, I knew that. I should have thought the question through more.</p><br/><p>“I’m not affiliated with any group. You came after me on purpose, right? To take me to Guardian or Freedom Wing?”</p><br/><p>“No, sorry to inform your ego, but I’m just an ordinary person. Guardian or Gardevoir, Freedom Wing or Gundam Wing, I don’t care. Are we good? I’m off then.”</p><br/><p>“W-Wait!”</p><br/><p>“Adios!”</p><br/><p>‘If you’re an ability user and you want to avoid people’s attention, you’ll have to do more research!’</p><br/><p>Everyone was lined up along the parking lot, seemingly waiting for rides to the freshman opening party. I would have escaped without anyone knowing had it not been for that hoody girl.</p><br/><p>However, I was not afraid. A man had to bold! I ignored the several gazes falling on me and continued onward. You had to be bolder in situations like this. Unfortunately, the hoody girl kept following me.</p><br/><p>“Are you really an ordinary person?”</p><br/><p>“Yep.”</p><br/><p>“You’re lying.”</p><br/><p>“I’m not.”</p><br/><p>“Then how did you see through my stealth? That was the first time it happened.”</p><br/><p>“Stealth is walking through people with your head down? I didn’t know.”</p><br/><p>“Kuk, my stealth is like that. As long as I didn’t release it or attack something, I wasn’t discovered. At least, until now.”</p><br/><p>“Then you can modify your data with what happened today. Good? I’m off then.”</p><br/><p>“Uuu, you said that just to make me reveal details about my ability, right?”</p><br/><p>My blood pressure was rising. I thought Palludia was the most annoying girl in the world, but it seemed there was someone else. Too lazy to even reply, I walked out of the plaza, but the hoody girl ran toward me in a hurry and clung to my arm.</p><br/><p>“What are you doing!?”</p><br/><p>“What?”</p><br/><p>“Aren’t you going to the freshman opening party?”</p><br/><p>“… You’re asking about that?”</p><br/><p>Thinking that this hoody girl might be an idiot, I replied, “No, I’m not.”</p><br/><p>“Aren’t you a freshman?”</p><br/><p>“I am.”</p><br/><p>“Your name?”</p><br/><p>I felt like I was getting investigated. Since I was already at it, I decided to continue acting twisted.</p><br/><p>“I won’t tell you.”</p><br/><p>“You can’t say it because you’re not a freshman, right?”</p><br/><p>“I’m not saying it because I don’t want to. And if you want to ask for someone’s name, you should give your own first.”</p><br/><p>“I’m Su Ye-Eun from the business department.”</p><br/><p>“Got it. Take care, Su Ye-Eun.”</p><br/><p>“Your name!”</p><br/><p>“I said to give your name if you wanted to ask mine. I never said I’d tell you my name.”</p><br/><p>“Eeeek! You’re dodging the question!”</p><br/><p>Su Ye-Eun continued to cling to my arm. I was beginning to grow angry from the hoody girl’s incessant behavior. Should I make her let go of me using my power? Wouldn’t it get annoying afterwards? … I’m going to have to continue my act. Agh, I got bit by the worst kind of dog.</p><br/><p>“Can you let go of me, please? I’m telling you, I’m not an ability user. Ah, the bus is leaving.”</p><br/><p>“Ah.”</p><br/><p>Su Ye-Eun made a blank expression. Buses holding students from their respective departments were leaving. It did not take long for all the freshman to find their way onto their bus. It was rather surprising. Regardless, Su Ye-Eun who seemed to want to go to the freshman opening party was now left alone.</p><br/><p>“Alright, I’m off. Good luck, abandoned Su Ye-Eun.”</p><br/><p>“Hey, who’s abandoned!?”</p><br/><p>“No, I didn’t say that at all.”</p><br/><p>“You totally did!”</p><br/><p>Su Ye-Eun frowned and continued pulling on me. The bus was already gone so I don’t know why she was pulling on me for. Regardless, I continued walking forward. Su Ye-Eun naturally was dragged with me. Sadly, I was also in the business department. What if I saw her in my classes?</p><br/><p>“It’s all your fault! I missed the opening party!”</p><br/><p>“It’s because you kept clinging onto me.”</p><br/><p>“Delinquent, liar, crook!”</p><br/><p>“Shut it hoody girl!”</p><br/><p>“H-Hoody girl…”</p><br/><p>My university had a clear separation between the engineering and liberal arts campus. The engineering campus was a little ways away from Seoul. The opening ceremony was held at the engineering campus, while the graduation was held at liberal arts campus. That is, we were now the only ones left in the countryside.</p><br/><p>After I completely left the campus, Su Ye-Eun seemed to have grown tired of being dragged around as she let go of my arm and was walking by me silently. Inside her hoody, her expression was all frowns.</p><br/><p>“Haa, because of this guy… this is the worst…”</p><br/><p>“Stop murmuring. It’s all your fault.”</p><br/><p>“Are you really not an ability user?”</p><br/><p>“Stop asking will you? I’m going to report you otherwise.”</p><br/><p>“… Then buy me food.”</p><br/><p>“Why!?”</p><br/><p>This woman’s way of thinking was definitely out of the ordinary. My head began to hurt. Before I noticed it, we were at near the station. With all the people and cars around, I was thinking about making a run for it. It was then that Su Ye-Eun murmured quietly.</p><br/><p>“I have no money… I’m hungry…”</p><br/><p>“…”</p><br/><p>For the first time since Palludia, I felt like hitting a girl.</p><br/><p>I brought Su Ye-Eun to a nearby McDonald’s. I watched her order a Big Mac with large fries plus extra, then ordered whatever for myself.</p><br/><p>“You don’t need more fries?”</p><br/><p>She looked at me strangely, almost like ordering more fries was the norm. I ignored her completely, took my plate from the employee and walked to a seat by the window. Su Ye-Eun asked why we were going there when there were better seats open, then she stole the plate out of my hands and walked to a seat at the center. She then murmured, “Is he really stupid?”</p><br/><p>“Ah… Ah….!”</p><br/><p>It wasn’t too late. I’ll first put in a hook to her stomach, then…! However, she was currently holding on our food. Since I couldn’t waste it, I decided to hold back. Feeling pitiful, I followed her and sat down.</p><br/><p>“Thanks for the food.”</p><br/><p>“You’re welcome.”</p><br/><p>Su Ye-Eun unwrapped her Big Mac then took a big bite. Then, with her eyes sparkling even from inside the hoody, she took a handful of fries and ate it. Then, she took another handful. Seeing her cheeks puffed up like a hamster, I couldn’t help but laugh.</p><br/><p>“You must have been really hungry.”</p><br/><p>“Nom nom… nom…”</p><br/><p>She sounded like she was chanting some black magic, but she was probably saying she starved since the morning. I gave her my share of fries. Then, she looked surprised, staring between me and the fries.</p><br/><p>“… Angel?”</p><br/><p>“That’s a quick change.”</p><br/><p>“You bestowed fries upon me.”</p><br/><p>“Don’t talk like that, it creeps me out.”</p><br/><p>I also unwrapped my burger and bit down. It was delicious. Since mother never let me eat like this at home, it had been a long time since I had junk food. Mm, maybe Yua would like it too. She might even give me a kiss on the cheek!</p><br/><p>In the end, while Su Ye-Eun was in the restroom, I secretly ordered another burger set, entered the restroom, and stored it in my inventory. It was the perfect crime. Time was frozen inside the inventory, so it would be hot and crunchy no matter when I took it out.</p><br/><p>When we left McDonald’s, she seemed to remember what situation she was in, as she separated herself from me and stood guard. She looked completely different from the one who just called me an angel. Was she simply an idiot? Yep, she must be.</p><br/><p>“Are we good? Go home now.”</p><br/><p>“You… You really aren’t an ability user?”</p><br/><p>“I’m not, and you’re an ability user that begged an ordinary person for food after bugging and annoying him.”</p><br/><p>“…”</p><br/><p>“So can we just go home now… Eh?”</p><br/><p>Su Ye-Eun looked strange. It wasn’t an expression of anger. Rather, it seemed to be frozen completely. Sensing that something was off, I turned around.</p><br/><p>In front of us was a 2 meter tall pigeon, seemingly having appeared out of nowhere.</p><br/>\n</div>"}