{"title": "Chapter 20. Fall's New Students (2)", "id": 20, "volume": 1, "url": "http://boxnovel.org/infinite-competitive-dungeon-society-chapter-20-falls-new-students-2", "volume_title": "Volume 1", "body": "<h1>Chapter 20. Fall's New Students (2)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 20. Fall's New Students (2)</p><br/><p>“So? You’ll talk more casually, right?”</p><br/><p>“Mm… Okay, yeah.”</p><br/><p>“Then can you call me by my name? I’m Shina, Shina Gren Ehuir.”</p><br/><p>“Okay, Shina. I’m looking forward to working with you. I’m Kang Shin. Call me Shin instead of an embarrassing name like Crown Prince.”</p><br/><p>“Yes, Shin-nim!”</p><br/><p>As Shina and I were exchanging our names, the other explorers from Luka continent looked flustered.</p><br/><p>“Hold on…”</p><br/><p>“You can’t…”</p><br/><p>“K-Kuhum.”</p><br/><p>“… Eh? Did I do something wrong?”</p><br/><p>When I tilted my head and asked, their mouths twitched. However, they soon shut their mouths, and only one person replied with a strange voice.</p><br/><p>“It… It’s nothing.”</p><br/><p>“That’s good to hear. Shina, I didn’t do anything wrong, did I?”</p><br/><p>“You’re fine! Huhu, I was nervous after hearing how strong the Dark Ratman was, but with Shin-nim, I’m not afraid of anything!”</p><br/><p>Shina quickly retorted and changed the topic immediately. She was right. We had to focus on fighting the Dark Ratman, not reminiscing about the past. It also wasn’t important that Shina seemed to remind me of Palludia, or that I completely forgot to contact her a week ago.</p><br/><p>… I should really start begging Palludia for forgiveness. No, that’s absurd. We are only close enough to contact each other occasionally. Well, I should focus on the Dark Ratman first.</p><br/><p>Although Shina might have been a little kid 2 years ago, she was now a brilliant party leader. She used all the information available about the Dark Ratman and formulated a solid battle plan. She calculated each party member’s abilities, and made sure each of them knew what they should do at any given moment. It wasn’t something anyone could do.</p><br/><p>“Are we good to go? Shin-nim, everyone?”</p><br/><p>“Yeah, I’m ready.”</p><br/><p>“Yes!”</p><br/><p>“Let’s go!”</p><br/><p>‘Sorry to be a downer everyone, but I have no plans to focus on party play. Because I plan to conquer the Dark Ratman quicker than I conquered the 10th floor’s Wraith Queen.’</p><br/><p>I gave myself one month. Of course, this excluded the time it would take me to get to the 20th floor. I knew that it was impossible to defeat the Dark Ratman alone at level 16.</p><br/><p>Just like I always did, I planned to slowly lower the amount of people in my party. Of course, this was assuming that the Dark Ratman didn’t drop a stat increasing item like the Compressing Elixir or the Soul Tempering Elixir.</p><br/><p>That said, I wouldn’t do something like deliberately offending or hindering other party members. I would follow the party leader’s plan. However… I would not take things slow like in Shina’s plan.</p><br/><p>“Alright… let’s go!’</p><br/><p>The moment the door to the boss room opened, I ran in. Although priests were casting elementary buffs to other party members, I did not receive then. I had to practice for when I would defeat the boss alone. I could not rely on buffs.</p><br/><p>“Kikik, Human… Kugagak!”</p><br/><p>I stabbed my glaive through the first ratman I saw. The Orc Lord’s Glaive I had been using since the 6th floor was still effective. Although ratmen had high attack and maneuverability, they had low defense to compensate. As such, I could kill the ratman in one blow. Mana really was amazing. Just by coating my spear with it lightly, it had such effect.</p><br/><p>“Wow, Crown Prince-nim.”</p><br/><p>“You didn’t receive a buff… right? You killed a ratman in one blow without receiving a buff?”</p><br/><p>“Ah, Shin-nim, so cool…!”</p><br/><p>“L-Leader! Snap out of it!”</p><br/><p>The party members began to make their move. They were a beat slower than me, and that was enough. I had only fought the Dark Ratman once. I did not yet know how the raid flowed or how the Dark Ratman fought. Before I could completely grasp the flow of battle, I still needed their help.</p><br/><p>What I had to do now was clear. My job was to kill the 40 ratmen scattered through the boss room as quickly as possible.</p><br/><p>“Everyone focus on the Dark Ratman! Don’t commit on the attacking ratmen. Just send them flying back, I will take care of them!”</p><br/><p>“Crown Prince-nim’s hunting them so fast, it doesn’t look like we’ll need to.”</p><br/><p>“Free damage dealers, stick to the Dark Ratman! I heard it uses a strong skill if left open!”</p><br/><p>‘You’ve done your research! My last party was massacred because no one knew about it.’ Remembering what happened in the last raid, I vented my anger on the ratmen.</p><br/><p>“Kikik, kill that human!”</p><br/><p>“Strong human! Too strong!”</p><br/><p>“Steal his spear!”</p><br/><p>Compared to the wraiths or the orcs, the ratmen were much more intelligent. They were the first to try to steal my glaive. However, ratmen began appearing from the 11th floor, and of course, it wasn’t the first time I faced ratmen trying to steal my spear. They had never succeeded once. They were always killed before they could.</p><br/><p>“Haaaap!”</p><br/><p>I pushed mana into my spear and thrust it forward. In an instant, the mana surged to the spear tip, forming a blade of mana and crushing the incoming ratmen. Although I could only maintain this state for less than a second, it was able to extend my spear for an instant. I called this Extending Spear, though I never said it out loud since it was such a senseless name.</p><br/><p>“A-Aura!”</p><br/><p>“No, rather than aura, it’s… pure mana?”</p><br/><p>“Healers, don’t just watch. Use your heals! The boss is incredibly strong!”</p><br/><p>The tank cried out as he endlessly repeated between being attacked by the Dark Ratman and kiting it. The healers then apologized profusely and began to pour their heals on him.</p><br/><p>Suddenly, the Dark Ratman let out a strange cry.</p><br/><p>“Kagugagak! I’ll burn you all up!”</p><br/><p>“Someone stop him!”</p><br/><p>“He’s trying to use Dark Thunder Explosion!”</p><br/><p>The tank who understood my urgent call quickly raised his shield and bashed the Dark Ratman’s head with it.</p><br/><p>“Kugagak! Don’t disturb me!”</p><br/><p>“Die!”</p><br/><p>The Dark Ratman continued to try to use Dark Thunder Explosion. In response, the tank, Shina, and other damage dealers all bombarded the Dark Ratman when they saw a chance. However, it was only enough to slow down the skill activation, not stop it. How absurd!</p><br/><p>Feeling rushed, I took care of the rest of the ratmen with Tempest. A maelstrom of mana rose up, creating countless cuts on the ratmen and sending them flying to a single space. Just Tempest was not strong enough to kill them, so I clad my spear with mana and attacked the ratmen who were gathered together.</p><br/><p>“DIE!”</p><br/><p>The spear I thrust out with a spirited cry sent several ratmen’s heads flying. I then cut down the remaining ratmen one by one. Suddenly, message windows popped up in front of me.</p><br/><p>[Dark Ratmen uses Dark Thunder Explosion!]</p><br/><p>[Party member Kart Von Jinas-nim died.]</p><br/><p>[Party member Dezihard-nim died.]</p><br/><p>[Party member Jieria-nim died.]</p><br/><p>B-B-BOOM!</p><br/><p>A small explosion followed by a large explosion instantly took out three party members. I quickly turned to the Dark Ratman. Its hair was standing, flashing out with black lightning. However, that was not a skill, just the aftermath of one. Dark Thunder Explosion had already ended, taking out all the damage dealers. The tank was alive due to using a life-saving skill in the last moment.</p><br/><p>“Heal! Heal!”</p><br/><p>“Don’t die!”</p><br/><p>The tank was trembling in place. Was it a reaction from enduring such a powerful skill? Or did the skill inflict some status effect on him? Then, I noticed Shina, who was a damage dealer, was still alive.</p><br/><p>“I ran back when I got a strange feeling. Before it activated Dark Thunder Explosion, it used another skill that froze nearby enemies. The other damage dealers who were hit by it couldn’t dodge in time.”</p><br/><p>“As I thought…”</p><br/><p>It seemed Shina was alive due to being outside Dark Thunder Explosion’s area of effect. To escape in time, you needed to dodge the paralysis skill that came before. Alright, I remembered it. It seemed Dark Thunder Explosion was a skill you could not block.</p><br/><p>There was only one way to survive it. That was to not get hit, like Shina had just done.</p><br/><p>That said, now wasn’t the time to leisurely think about its skill area of effect. The tank was unable to protect himself as he was hit by the Dark Ratman, and the heals couldn’t keep up with the damage being taken.</p><br/><p>As if we had planned it out before, Shina and I ran toward the Dark Ratman, our weapons in hand.</p><br/><p>“Hornet Pierce!”</p><br/><p>Shina’s attack was the first to hit the Dark Ratman. Her sword was dyed purple, and when it penetrated the Dark Ratman’s abdomen, the Dark Ratman’s face was also dyed purple. Its claws attacking the tank stopped midair. Then, as if it was drunk, it began to spin in place. Could that be?</p><br/><p>“It’s poison! It will stay like that for a moment!”</p><br/><p>I didn’t know how long a moment was, but I stopped Tempest I was in the middle of using and stood tall. Then, I held my spear up high and began to focus on energy on it.</p><br/><p>“Kuk, such a huge mana pool… is he really level 15!?”</p><br/><p>‘Well, the Soul Tempering Elixir and Peruta Circuit helped a lot.’ Answering him in my mind, I poured all the mana I had into the spear in my hand. It wasn’t just mana. To burst out with as much strength as possible, I concentrated my entire strength into the tip of the spear.</p><br/><p>Father always said to thrust out with the resolve to collapse the world. My ancestors called it the Heaven Collapsing Strike. I called it the Heroic Strike.</p><br/><p>From the spear tip, white light exploded out, dyeing the entire boss room.</p><br/><p>“Ahhh!”</p><br/><p>“So the rumors are true. He really is a Hero.”</p><br/><p>I would eventually come to know what this white light signified. For now, I was focused solely on concentrating my energy in one place.</p><br/><p>“Prepare to die!”</p><br/><p>“Kugagak!”</p><br/><p>The Dark Ratman seemed to be somewhat recovered from Shina’s poison as it sensed danger and tried to distance itself from me. Unfortunately for the Dark Ratman, it was too late.</p><br/><p>I smirked and launched my spear forward. That is, I threw it. A spear imbued with energy did not lose that energy just because it was separated from the body. If anything, the forward momentum made it stronger.</p><br/><p>“Kugaga, kugagagak!”</p><br/><p>The spear stabbed into the Dark Ratman’s chest. Perhaps sensing its death, the Dark Ratman let out a final laugh. Thinking it was annoying even until the end, I raised my body, which had bent down after throwing the spear, up. Immediately afterwards, the light on the spear tip exploded.</p><br/><p>BOOM!</p><br/>\n</div>"}