{"title": "Chapter 31. From Today, I'm an Official Explorer (1)", "id": 31, "volume": 1, "url": "http://boxnovel.org/infinite-competitive-dungeon-society-chapter-31-from-today-im-an-official-explorer-1", "volume_title": "Volume 1", "body": "<h1>Chapter 31. From Today, I'm an Official Explorer (1)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 31. From Today, I'm an Official Explorer (1)</p><br/><p>Since I had already gotten the Elementalist class, I had forgotten about it. I left the pocket watch stuffed into my inventory and never looked at it. But to think it would turn out like this. As always, the best feeling came from unexpected gains.</p><br/><p>More importantly, it was a subclass. Unlike the Elementalist class, it did not grant me any amazing abilities that changed the way I fought. That said, it would have been weird if my class changed from Elementalist to something else. Being able to use Orc Lord’s Warcry, Vengeful Spirit’s Wail, and other equipment set skills without having to equip them was certainly beneficial.</p><br/><p>Not to mention, the class passive skill ‘Spirit of the Collector!’ Although this skill seemed to rely on luck for the most part, it was clear that the skill would not be harmful in any way. As a passive skill, it would help me for a long time.</p><br/><p>After organizing my thoughts, I hurriedly took out the pocket watch. The pocket watch was shining with dazzling light from the jewels on the lid. It was as if a switch had been turned on.</p><br/><p>The moment I opened the lid, the minute hand, which was between 11 and 12 o’clock positions, suddenly began spinning. At the same time, I heard a voice in my ear.</p><br/><p>[You used the skill, ‘Endow Skill.’ You currently possess 3 skill equipment. Which of them would you like to endow?]</p><br/><p>[1. Orc Lord’s Warcry</p><br/><p>2. Vengeful Spirit’s Wail</p><br/><p>3. Dark Thunder Explosion]</p><br/><p>“Wow.”</p><br/><p>Although it wasn’t like I had doubted it, but I could not help but smile seeing it with my own eyes. Without erasing the smile from my face, I spoke out.</p><br/><p>“Orc Lord’s Warcry.”</p><br/><p>[Designate the hour.]</p><br/><p>“Hour? Ah, it’s asking where. Then 1 o’clock.”</p><br/><p>As soon as the word left my word, the Orc Lord Set flew out of my inventory and fell on the ground. Then, the Orc Lord Set began to shine with red light. Soon, a red jewel flew up amidst the red light and went into the pocket watch.</p><br/><p>Thinking I was being attacked, I almost let go of the pocket watch. But seeing that I was unhurt, I turned my gaze toward the pocket watch. The spinning minute hand had stopped and was now fixed on the 1 o’clock position. A red jewel was embedded there, replacing the number 1.</p><br/><p>I now realized that these holes weren’t actual holes where something came off. They were empty sockets where skills would be embedded.</p><br/><p>“Vengeful Spirit’s Wail.”</p><br/><p>Like before, the Wraith Queen Set shone with a gloomy grey light and spit out a grey jewel. It then entered the 2 o’clock socket. I continued with the Dark Ratman Set, which went into the 3 o’clock socket. For some reason, however, the jewel was yellow. Was it because lighting was yellow? But it’s called dark thunder… how mysterious.</p><br/><p>“Hu, so this means I don’t need to wear the full set anymore. Though, since the Dark Ratman Set is the best, I’ll continue wearing it.”</p><br/><p>It increased my strength and dexterity by 10 points each. That was a stat bonus equivalent to 4 whole levels! The Dark Ratman was comparatively difficult to solo, but I had also gained a lot from doing so. Feeling all around happy, I smiled from ear to ear as I patted Peika’s head.</p><br/><p>[Stop, my hair will get tangled.]</p><br/><p>Since Peika said it while flushing her cheeks and twisting her body, I continued to pat her.</p><br/><p>Hm? Why did I feel like I was forgetting something?</p><br/><p>“Oh yeah, the reward.”</p><br/><p>The reward from defeating the Floor Master alone. I had almost forgotten about it. When I checked, it was a Return Magic Book. Return? Tilting my head, I used it immediately.</p><br/><p>[You learned the Return skill. Using 80 percent of your remaining mana, you can teleport to any predetermined location. You can bring up to two people. You can only choose two locations at any given time, and you must have visited these locations before. You can only use this skill twice a day. You can change these locations every two weeks. The number of locations and the number of times Return can be used will increase with levels.]</p><br/><p>[You cannot bring non-dungeon explorers to the dungeon.]</p><br/><p>[You cannot bring those belonging to other worlds into your own.]</p><br/><p>‘Geez, why is there so many twos!? It’s easy to memorize at least. Wait, now that I think about it, this skill…’</p><br/><p>“It’s… amazing.”</p><br/><p>There was no better skill for going to and from school! Imagining myself teleporting to the school and teleporting back as soon as classes ended, I could not hide my excitement.</p><br/><p>‘Ah, going from school to home should be easy since I can just go into the restroom, but the other way would be hard… I’ll need to look for a secluded area at school. Well, I’ll think about this later.’</p><br/><p>[Name: Kang Shin Race: Human Sex: Male</p><br/><p>Class: Elementalist (Sub – Skill Collector) Title: Dark Ratman Slayer Rank: Bronze 1</p><br/><p>Level: 20</p><br/><p>HP – 5,870/5,870 MP – 3,860/3,860</p><br/><p>Strength – 55(+15) Dexterity – 49(+13) Constitution – 59(+3)</p><br/><p>Intelligence – 20(+3) Magic – 74(+3) Charm – 43(+3) Luck – 20(+3)</p><br/><p>Normal Skill – Mid-rank Martial Arts (Lv 9), High-rank Spear Technique (Lv 4), Peruta Circuit (Lv 3), Mid-rank Heroic Strike (Lv 2), Low-rank Provoke (Lv 7), Return (Lv 1), Deific Manifestation.</p><br/><p>Class Skill – Low-rank Spirit Mastery (Lv 5), Low-rank Spirit Aura (Lv 1), Low-rank Elemental Control (Lv 1), Low-rank Elemental Contract (Lv 2), Low-rank Elemental Tempest (Lv 5)</p><br/><p>Subclass Skill – Endow Skill, Spirit of the Collector]</p><br/><p>Huu. Now that I looked at my status, one thing stood out in particular. It was that my highest stat was magic. It was because I received bonus magic stats when I became an Elementalist and a Skill Collector.</p><br/><p>Of course, since magic could strengthen spear techniques, it was not a bad thing. Other close-combat classes most likely received bonus strength, dexterity, or constitution stats. But the compressing elixirs I consumed easily covered that difference. Not to mention, the bonus from the Dark Ratman Set should have made me surpass them. I knew for certain that equipment that raised strength and dexterity by 10 were rare.</p><br/><p>When I visited the Floor Shop afterwards, Loretta was smiling without saying anything. Even when I showed her my sparkling pocket watch, she seemed to have expected it as she maintained her tranquil smile. Her leisure irritated me for no apparent reason.</p><br/><p>“So you’ll be challenging the 20th Floor Master next.”</p><br/><p>“Yes, although I won’t go for a complete conquer until I’m level 25.”</p><br/><p>At my words, Loretta seemed to ponder over something, then said, “Customer, the 20th Floor Master, Lizard Knight, is a monster that separates the Bronze rank and the Silver rank. It is a cruel and formidable monster that slaughters explorers who do not meet the qualifications to rise to the Silver rank.”</p><br/><p>“Is that so? But why are you telling me this?”</p><br/><p>“For customer, it might be easier to defeat the Lizard Knight than the Dark Ratman.”</p><br/><p>“Why is that?”</p><br/><p>Loreta stayed silent for a moment before she opened her mouth again.</p><br/><p>“Customer, if the Dark Ratman appeared with a stronger defense, but without its ratmen minions, what would you have done?”</p><br/><p>“I probably could have defeated it at level 15. I would just have to dodge its skill.”</p><br/><p>There was only one reason the Dark Ratman fight was so hard. It was because of how difficult it was to fight the fierce ratmen minions while dodging the Dark Ratman’s lightning. But if there were no ratmen minions to worry about, defeating the Dark Ratman would have been easy. In fact, it might have been easier than the Wraith Queen fight. No matter how much its defense increased, it would not stand a chance against my skills. I just had to use it a couple more times.</p><br/><p>But at my answer, Loretta became speechless and stared at me fixedly. When I gave her the ‘why are you looking at me’ face, she cleared her throat and continued.</p><br/><p>“That’s exactly how the Lizard Knight is. He does not have any minions that fight for him. However, he is strong, fast, and robust. With these qualities, he has forced countless explorers to kneel and despair. But if customer is confident, it would be fun to challenge him alone.”</p><br/><p>“Dare to adventure. That’s what you’re saying, right?”</p><br/><p>“Do you remember what I told you? That the fruit of adventure is always sweet.”</p><br/><p>Loretta was giving me a hint. But what did she mean by the fruit of adventure being sweet? The title of Lizard Knight Slayer should be the same no matter when I earned it. What difference was there in getting it now or later?</p><br/><p>Ah.</p><br/><p>“Don’t tell me, there’s a difference if I succeed in a solo raid in my challenge?”</p><br/><p>“Who knows? Hwi hwi~!”</p><br/><p>Loretta avoided my gaze as she whistled. It was obvious to the point it was doubtful, but Loretta had never said anything to put me at a disadvantage. She did try to con me into buying more items though.</p><br/><p>… Could I trust her?</p><br/><p>“One more thing, customer.”</p><br/><p>As I was wondering whether a mere level 20 adventurer like me should try to do something that doesn’t seem particularly appealing, Loretta added, as if to put the nail on the coffin.</p><br/><p>“The ‘first’ is always special.”</p><br/><p>The first. I felt a strong attraction to that word. It also implied that I had never truly been the first. Being the idiot that I am, I felt my pride being provoked. Even her eyes seemed to be saying ‘you can’t even do this?’</p><br/><p>“Alright, I’ll do it. The first.”</p><br/><p>Loretta stared into my eyes for a moment before flushing her cheeks and turning away. Then, she shouted as she took something out of her pocket.</p><br/><p>“Then here’s an offer from the Floor Shop, customer! This here is a magical item that holds down the enemy’s movement for 5 seconds! Now it’s only 10,000 gold!”</p><br/><p>“I’m not buying it.”</p><br/><p>“Why!?”</p><br/><p>I’ll challenge it. At level 20, I will solo the 20th Floor Master! Without that magical item, of course!</p><br/><p>Author's note: Mastered lower-ranked skills have been removed from that status to avoid cluttering!</p><br/>\n</div>"}