{"title": "Chapter 36. From Today, I'm an Official Explorer (6)", "id": 36, "volume": 1, "url": "http://boxnovel.org/infinite-competitive-dungeon-society-chapter-36-from-today-im-an-official-explorer-6", "volume_title": "Volume 1", "body": "<h1>Chapter 36. From Today, I'm an Official Explorer (6)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 36. From Today, I'm an Official Explorer (6)</p><br/><p>The Lizard Knight roared and thrust his spear toward me. Before his spear could touch my body, I parried it with my glaive. His spear shot up into the air, and as he was unable to withstand my strength, it separated from his grip. I used my glaive and quickly pushed it away.</p><br/><p>All of this takes some time to describe, but actually happened in the space of a second. Although I wasn’t weak, I was no match for the Lizard Knight in a direct exchange of strength. I had to rely on my techniques.</p><br/><p>“No way, the Floor Master let go of his weapon!”</p><br/><p>“I saw it too, so stop shaking me by my neck!”</p><br/><p>I took my stance and pulled my spear back. The Lizard Knight let out a rage filled roar and swung his tail. It was exactly at the same time when the second attack team made their move.</p><br/><p>“Whoa, dodge his tail first!”</p><br/><p>“Hmph, Lion Strike!”</p><br/><p>While the other damage dealers were running back, Ren shouted out and swung his claymore down at the Lizard Knight’s tail. Since he said Lion Strike, it was likely a skill.</p><br/><p>His claymore, dyed gold, collided with the tail with a boom. Along with the explosive sound, I heard the Lizard Knight’s scream. I did not wait to find out what happened. I was certain Ren had crushed him.</p><br/><p>“Enun, amplify me!”</p><br/><p>“Got it! Amplification!”</p><br/><p>The moment Enun used Amplification, I felt an instant surge of strength. I could certainly feel the amplification. It felt like the mana around me was flooding toward me. At the same time, I instinctively felt that this state would not last long.</p><br/><p>“Everyone get back! Heroic Strike, Divine Speed!”</p><br/><p>This was my first time using the Divine Speed skill, which quintupled my speed for 0.5 seconds. With faster speed, it was obvious that the attack power would increase. Although I could also use it to dodge attacks, the Lizard Knight’s attacks weren’t so fast that I needed to use Divine Speed to dodge them.</p><br/><p>Divine Speed was truly powerful. When I thrust out with my spear as I normally did, I heard the sound of my spear cutting wind as it entered the Lizard Knight’s stomach. White light enveloped my glaive as it flickered with lightning from Spirit Aura. With the incredible boost from Divine Speed on top of everything else, my spear was no different from Zeus’ lightning.</p><br/><p>“Kuak!”</p><br/><p>The Lizard Knight’s armor, as well as the scales protecting him, broke in an instant. With a shrill cry, the Lizard Knight coughed out a mouthful of blood. It seemed the amplification did its job.</p><br/><p>Of course, I wasn’t doing so well either. Heroic Strike normally had a strong recoil. With the momentum from Divine Speed added, my arm throbbed like it was going to be ripped off.</p><br/><p>“Is Ren okay!?”</p><br/><p>“He’s alive! I’m healing him at the moment!”</p><br/><p>“Kuk… I’m… fine!”</p><br/><p>It seemed he received a huge recoil from his attack. As I was worrying about Ren, the Lizard Knight threw away his broken armor and became bare-skinned. It seemed that’s when he realized he did not have his spear as he rushed to where the spear went flying. Even I had no plans to block his charge head on. As such, I stepped back and shouted to the archers.</p><br/><p>“Archers, attack!”</p><br/><p>“Yes!”</p><br/><p>To stop the Lizard Knight’s movements, the two archers endlessly shot out their arrows. Meanwhile, the priest and priestesses managed to restore Ren to fighting condition. Spitting out some blood, Ren held up his claymore and asked, “What happened to his tail?”</p><br/><p>“Ah, it’s dangling, half-severed.”</p><br/><p>“Ah, I see…”</p><br/><p>I answered Ren as I watched the Lizard Knight happily picking up his spear. Although Ren seemed depressed that he was unable to completely sever the Lizard Knight’s tail, I was surprised on the inside.</p><br/><p>It was extremely difficult to cut the limbs or tail of a Floor Master. Their bodies were built completely different from normal monsters. Rather than cutting their limbs, it was much more efficient to continuously attack their pressure points.</p><br/><p>However, Ren managed to crush a Floor Master’s tail with a single use of a skill. It was a questionable attack from a warrior’s point of view since he destroyed his body in the process, but that was why healers existed.</p><br/><p>In truth, although the way he used his strength seemed foolish, I had to at least acknowledge the force it carried. Frankly, he was stronger than the current me. As his claymore suggested, his class likely put great emphasis on his strength.</p><br/><p>As I was thinking about Ren, the Lizard Knight, who managed to retrieve his spear, raised it up high. I, of course, would not miss this opening. Just as I pulled my spear back slightly to use Tempest…</p><br/><p>“Haaap!”</p><br/><p>Ren cut in with his stupidly large claymore.</p><br/><p>“Lion Upper!”</p><br/><p>Unlike his large body suggested, he moved rather nimbly. Having approached the Lizard Knight, Ren swung his claymore from the bottom to the top toward the Lizard Knight’s spear. It wasn’t a bad approach. However, unless he had a technique to make use of the enemy’s strength to maximize the counteractive force, it was better to just strike from top to bottom to mess up the enemy’s breathing!</p><br/><p>“Kyaha! Human!”</p><br/><p>“Die! Ugh, uwoaah!”</p><br/><p>It was just as I expected. Ren was unable to win against the downward force of the Lizard Knight’s spear. His claymore was sent flying and the Lizard Knight’s spear ended up hitting the ground like he wanted.</p><br/><p>Me? Because Ren made me miss my timing to use Tempest, I used Divine Speed to approach the Lizard Knight the moment his spear struck the ground.</p><br/><p>“Cough!”</p><br/><p>“Uwaaak!”</p><br/><p>“Kuk, damn it!”</p><br/><p>[Party member Sherbitz died.]</p><br/><p>[Party member Enun Von Karbia died.]</p><br/><p>[Party member Rodlin Von Ionard died.]</p><br/><p>[Party member Deruin died.]</p><br/><p>Damn, just a single earthquake attack had killed four party members. They were the three healers and the magician, Enun. It seemed all he did was use Amplification once. At least the priest and priestesses healed Ren…</p><br/><p>Me? I had leapt forward with Divine Speed’s 0.5 second boost and was flying toward the Lizard Knight.</p><br/><p>“Kuaaak!”</p><br/><p>“Kuk, hang on! Use your potions!”</p><br/><p>“Crown Prince-nim!”</p><br/><p>I was going to take care of it even if you didn’t call me!</p><br/><p>I was near the Lizard Knight before I knew it. At a spear’s thrust distance away, I first attacked the Lizard Knight’s eye. Although he tried to intercept me, I was faster. My spear hit its eye perfectly, causing blood to explode out.</p><br/><p>[Critical Hit!]</p><br/><p>“Kuak!”</p><br/><p>“Tempest!”</p><br/><p>I first stunned the Lizard Knight from holding his spear up. In the instant when his body lost its tension, I once again made him lose his spear. After the earthquake ended, the Lizard Knight swung his half-severed tail at me with fury.</p><br/><p>I was waiting for this moment.</p><br/><p>“Elemental Tempest!”</p><br/><p>[Whoooo!]</p><br/><p>[Everyone gather up! Prince-nim is going to scold us otherwise!]</p><br/><p>[Hurry, hurry! We’re going to be late!]</p><br/><p>[That looks delicious! Someone fry it up!]</p><br/><p>[There are no fire elementals here!]</p><br/><p>I couldn’t believe it. Even the process in which the elementals gathered was shortening. Seeing the usually lax elementals rush to my spear, I shot my spear directly at the cut on the Lizard Knight’s tail.</p><br/><p>With the swooshing sound of air being cut, a storm ripped the Lizard Knight’s tail apart.</p><br/><p>“Kuaaak!”</p><br/><p>“The tail got cut!”</p><br/><p>“Please, does that look like it got cut? It got shredded!”</p><br/><p>As expected, a skill that used half of my MP was indescribably strong. Heroic Strike, Divine Speed, and Elemental Tempest. Thanks to these skills, my MP was completely drained. As a result, I felt nauseous and my head throbbed.</p><br/><p>Gulping down a lowest-grade Mana Potion, I landed. As it only restored 100 mana, it only helped to slightly alleviate the symptoms.</p><br/><p>Lizard Knight was now using Dragon Skin.</p><br/><p>“Kukuku, humans, you are strong, I admit! But that won’t matter now!”</p><br/><p>“Yeah, the one I met yesterday said something similar.”</p><br/><p>“Kuk, I’ll finish him off!”</p><br/><p>Ren the eager warrior said as he got up with his claymore. He was exactly the type of person who kept getting up after he was knocked down. However, if things were left to Ren, he would undoubtedly mess up like before. As such, I silently waved my hand at Ren.</p><br/><p>“Just stand there and watch.”</p><br/><p>“But!”</p><br/><p>“Because you couldn’t block his attack, four people lost a week of their time.”</p><br/><p>“Kuk!”</p><br/><p>I deactivated Spirit Aura. I put my glaive aside and charged toward the Lizard Knight bare handed. He had to be severely damaged from Heroic Strike, Lion Strike, Elemental Tempest, and the archer’s focused atta… well maybe not that. In any case, his condition was obvious from his shaking legs. It was almost like he was begging for me to use my techniques!</p><br/><p>“Here’s a two handed grip shoulder throw!”</p><br/><p>“Uwuuk!”</p><br/><p>“N-No way!”</p><br/><p>“C-Crown Prince picked up and threw the Lizard Knight!”</p><br/><p>“I can’t stop myself. I’m falling in love with him. I must marry him now!”</p><br/><p>“But you’re a guy!”</p><br/><p>Before I noticed it, the damage dealers from the second attack team had gotten up and were now spectating with popcorn in hand. However, as I was focused on the fight, I could not hear what they were murmuring about. I did not want to either!</p><br/><p>I threw the Lizard Knight over and over again without stop. Because I had no mana left, I knew my body wouldn’t last the moment I missed a technique. I was in a more dangerous situation than yesterday. This was all Ren’s fault.</p><br/><p>“Human! A mere human!”</p><br/><p>“It happens, and sometimes you die before you know it!”</p><br/><p>“Humaaaaaan!”</p><br/><p>“What, Lizard Kniiiight! This is the end! Floating drop!”</p><br/><p>This was the power of level 9 mid-rank martial arts technique and body strengthened with mana! As I threw the 2.3m giant down on the ground, the Lizard Knight coughed out blood.</p><br/><p>“Kuk, human… Hero…!”</p><br/><p>“That wasn’t even Heroic Strike, you fool!”</p><br/><p>In case it was still alive after spitting out a mouthful of blood, I made sure it was dead with my spear. He soon disappeared and we finally heard the system message we were all used to hearing.</p><br/><p>[You defeated the Floor Master!]</p><br/>\n</div>"}