{"title": "Chapter 33. From Today, I'm an Official Explorer (3)", "id": 33, "volume": 1, "url": "http://boxnovel.org/infinite-competitive-dungeon-society-chapter-33-from-today-im-an-official-explorer-3", "volume_title": "Volume 1", "body": "<h1>Chapter 33. From Today, I'm an Official Explorer (3)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 33. From Today, I'm an Official Explorer (3)</p><br/><p>There was a technique developed around the principle of using an attacker’s energy against him. It was jujitsu. Spearmanship was a martial art that hurt the opponent regardless of whether the spearhead had a blade or not. As such, my family also passed down a jujitsu technique to neutralize opponents without hurting them.</p><br/><p>In truth, it was a modified version of Japanese judo, and thus shared many similarities. Although it also took from several other close-quarter martial arts, judo was the main martial art.</p><br/><p>Of course, even though jujitsu could neutralize opponents without hurting them, that was on top of gymnastic mats. If someone inexperienced received a hip or shoulder throw on concrete, his back and spine would undoubtedly break along with the rest of his life. Thankfully, I didn’t need to worry about that now.</p><br/><p>“Hap!”</p><br/><p>“Hmph, what are you trying to do by grabbing me? Don’t tell me, you’re trying to throw me…!?”</p><br/><p>You thought I couldn’t? If you thought I couldn’t pick you up with 9 levels of mid-rank martial arts, you’re mistaken! I grabbed the arm he tried to strike out with and proceeded to do a hip throw. With his awful stance, I did not need to work hard to ruin his balance. The only slightly hard part came from the fact that he was much taller than me.</p><br/><p>When his heavy body hit the ground, it was as if a meteorite had struck and a thundering roar boomed out. Seeing the ground crack, I realized this guy had potential as a weapon. Maybe I should carry him around instead of my spear!</p><br/><p>“Kuk!”</p><br/><p>“Your head’s going to ring! Especially with that hard head of yours!”</p><br/><p>Dragon Skin was most likely a skill that maximized the outer skin’s defense. However, that did not mean it protected the internal organs. Rather, if enough force struck the hard outer layer, the impact would travel inside and hurt the internal system. It was the same concept as when one got hit by a bullet while wearing a bulletproof vest. The bullet wouldn’t penetrate the skin, but the force from it would break one’s ribs.</p><br/><p>By picking him up and throwing him down on the ground, I essentially pitted the Lizard Knight and the hard ground against each other. Although I would have preferred to continue with a joint lock, I knew it wouldn’t work on the Lizard Knight whose entirely body has been hardened by Dragon Skin. If he wanted to continue lying on ground, I could only leave him be.</p><br/><p>Of course, being the idiot that he was, the Lizard Knight got up and sent a kick toward me. Unwavering courage, undying vigor! I didn’t hate him for that. In fact, I liked it.</p><br/><p>“Hook kick!”</p><br/><p>“Kuhuk!”</p><br/><p>“Shoulder throw!”</p><br/><p>“Kuaaak!”</p><br/><p>For the entire 5 minutes when his body was hardened, the Lizard Knight became a testing object for my jujitsu techniques. Every time he fell, he got up, without knowing to stop. Eventually, after taking a two-handed grip shoulder throw, he coughed out black blood and collapsed.</p><br/><p>“Kaaaaak!”</p><br/><p>At the same time, his reddened skin turned back to its normal color. It seemed that Dragon Skin had run out. I once again picked up my spear. His once fierce gaze was now blankly chasing the tip of my spear. It seemed the effect of Dragon Skin ending overlapped with the effect of the intense date he had with the ground.</p><br/><p>“I’ll show you what real spearmanship looks like.”</p><br/><p>I was truly too kind. The skill Heroic Strike was so fast that no enemy could see through how it worked. As such, I did not use the skill, but manually concentrated my body’s energy and mana on the tip of my spear. With this, I was positive that even this idiot could see ‘real spearmanship.’ Real spearmanship wasn’t some cheat like hitting the ground with large amount of mana and strength.</p><br/><p>“T-That’s…!”</p><br/><p>“Well, you’re going to die soon anyways!”</p><br/><p>With glaring eyes, I shot my spear toward his face. With a rather unpleasant sound, the light in his eyes dimmed. Like Loretta said, the Lizard Knight really was easier than the Dark Ratman. Though, my Dark Thunder Explosion did play a big part.</p><br/><p>Immediately afterwards.</p><br/><p>[Amazing! You are the first in First Dungeon’s history to succeed in soloing the Lizard Knight on the first try! The dungeon will remember you as a Great Explorer. You obtained 2 skill points as a reward. You obtained a Special Mansion Free Purchase Ticket. Remaining skill points: 6]</p><br/><p>[You obtained the title, ‘Lizard Knight Master.’ All stats increase by 2. This effect will apply even if the title is not equipped.]</p><br/><p>[You defeated the Lizard Knight alone. You obtained the special reward, ‘Lizard Knight’s Scale Armor.]</p><br/><p>[You obtained 10,000 gold.]</p><br/><p>[You received the only reward left hidden for the First Explorer. Congratulations! Your luck stat increases by 1.]</p><br/><p>[Secret. Divine Speed Magic Book]</p><br/><p>Looking over the reward from defeating the Lizard Knight, I found it hard to calm myself.</p><br/><p>First. So this was the ‘first’ that Loretta was referring to. 2 skill points. It was the amount equivalent to creating two skills or completing two quests. There was also the Special Mansion Free Purchase Ticket, not that I knew what it was.</p><br/><p>The title was also different. Lizard Knight Master. It gave 2 points to all stats instead of 1. If I had defeated the Orc Lord, Wraith Queen, and Dark Ratman in the same way, then… No, let’s not think about meaningless things. I needed to focus on now and the future.</p><br/><p>I would have received the gold and the scale armor regardless, so what interested me next was what came after. The only reward left hidden, Divine Speed Magic Book. Just the word ‘secret’ made it seem extraordinary. Just when I was about to learn it, a fanfare rang out.</p><br/><p>[You became level 21. You obtained the qualification to climb to the 21st floor.]</p><br/><p>[You became Silver Rank 9. You are no longer an apprentice explorer, but an official explorer.]</p><br/><p>[You can appoint one person as a First Dungeon Explorer. This is a right given only to Bronze Rank explorers who explored the dungeon for 20 years, or to explorers who have been promoted to the Silver Rank. When you become a Gold Rank explorer, you can appoint an additional person as a dungeon explorer.]</p><br/><p>[As a Silver Rank explorer, you obtained the right to enter Event Dungeons. You can enter Event Dungeons by hunting monsters or finding hidden areas while exploring.]</p><br/><p>[You obtained the right to participate in Event Raids! Event Raids are created when specific Event Dungeons are cleared, or when the necessary conditions are met. The Event Raid’s creator becomes the host and can invite others to participate. One can join a raid by accepting the host’s invite. One’s levels or qualifications may prevent him or her from participating, and the host maintains the right to enter and exit raids.]</p><br/><p>[You can buy a residence in the dungeon by going to the dungeon’s Residential Area. The residences of explorers from various worlds are located here, and support and recreational facilities exist to ensure explorer’s can make the best use of their time of leisure. Explorers can privately meet with other explorers, and a market exists where various foods are sold. However, to enter the Residential Area, one must use a Residential Area Entrance Ticket, dropped by monsters above the 21st floor. Other dungeons’ explorers cannot enter the First Dungeon Residential Area.]</p><br/><p>… Eh? I was an apprentice until now? I suddenly felt irritated. So all this time when I was gloating in self-satisfaction, it was like a baby being proud after learning how to walk! The pride I felt from being the First to defeat the Lizard Knight suddenly shrunk.</p><br/><p>“No, this is where it begins!”</p><br/><p>Let’s not be so hard on myself. I’ve only been a dungeon explorer for 5 years. Not to mention, I spent 3 years of that period stuck on the 5th floor unwillingly. I was doing well! I can continue to do well! It’s not like I didn’t know how much I had left to travel. There was no need to be down. I just had to keep running and keep getting stronger. More so than the superheroes I dreamed of being when I was young!</p><br/><p>Perhaps because I was now an official explorer, I found out many things about the dungeon that I did not know before. The first was the Event Dungeon. I already knew about it since I had heard from Ellos. I could explore a unique dungeon using an Event Dungeon Entrance Ticket that monsters dropped with an extremely low chance. And of course, I could expect a hefty reward when it was cleared.</p><br/><p>There was also the Event Raid, which happened at a fixed rate when an Event Dungeon was cleared. A minimum of 50 explorers could gather to fight a boss monster incomparable to the Floor Masters. Just thinking about it made my heart beat. I wanted to quickly participate in an Event Raid. Of course, not that anyone would include me with my low level.</p><br/><p>This was the first time I had heard about the Residential Area. I never expected something like that to exist in the dungeon either. It seemed I could just stay there without ever going back to my own world. Although, I would never do so as a college student and Yua’s older brother. The Residential Area also seemed like the place where I could use the Special Mansion Free Purchase Ticket. Special Mansion… I was curious, but I had no way of going there as of yet.</p><br/><p>In summary, there were four benefits I gained from becoming an official explorer.</p><br/><p>1. Authority to appoint one person to be a First Dungeon Explorer.</p><br/><p>2. Ability to find and join Event Dungeons.</p><br/><p>3. Ability to participate in Event Raids.</p><br/><p>4. Right to enter the Residential Area.</p><br/><p>After I organized the info, it did not seem so complicated anymore. With that, I finally checked the Divine Speed skill I received.</p><br/><p>[You learned the active skill, ‘Divine Speed.’ By using 20 percent of your mana, you can quintuple your speed for 0.5 seconds. The skill duration and speed increase goes up with increased skill levels, and the required mana decreases with increased skill levels.]</p><br/><p>“Huu.”</p><br/><p>I let out a deep breathe. I focused on the fact that this skill was a growth type skill. Although it only increased my speed for 0.5 seconds for using 20 percent of my mana, 400 percent speed increase was amazing. Since every aspect of the skill increased with increased skill level, I eagerly anticipated its growth.</p><br/><p>[Master?]</p><br/><p>“No, Peika. It was thanks to you that I could beat the Floor Master. Thanks.”</p><br/><p>[Hu, Huhu! Now you realize my true worth!]</p><br/><p>Busy looking over all the information, I randomly replied to Peika’s murmur. Thankfully, she seemed extremely satisfied with whatever I said as she crossed her arms and puffed out her chest. Seeing her cute reaction, I couldn’t help but pat her on the head, and ended up being scolded again.</p><br/><p>Translator's Note: Divine Speed quintuples (x5) your speed, which is a 400% increase.</p><br/>\n</div>"}