{"title": "Chapter 56. What It Means to Climb the First Dungeon (3)", "id": 56, "volume": 1, "url": "http://boxnovel.org/infinite-competitive-dungeon-society-chapter-56-what-it-means-to-climb-the-first-dungeon-3", "volume_title": "Volume 1", "body": "<h1>Chapter 56. What It Means to Climb the First Dungeon (3)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 56. What It Means to Climb the First Dungeon (3)</p><br/><p>I didn’t expect an overwhelming victory, but I at least expected them to be strong enough to be considered elites. In truth, they were only slightly better than ordinary explorers. Ellos was the only one strong enough to be called an elite. Shuna had high defense and was passionate, but she was lacking in all other aspects, and Palludia… Well, I didn’t really know how to judge a priestess’ ability.</p><br/><p>However, the explorers from Pilos continent, Luka continent’s rapier warrior, and Paul, who had died, were extremely lacking. They acted like they were playing a game, waiting for the right time to strike, and backing out right after to avoid danger.</p><br/><p>It might have been necessary to survive until now, but with over 30 percent of the party members acting that way, it was only obvious that the Floor Master would make use of the openings they created. As a result, they all died.</p><br/><p>If I remembered correctly, didn’t they say they were fighting the demon race that invaded their continent? How could they be so full of leisure? Why weren’t they more desperate to survive? Not to mention, they were explorers of the First Dungeon, not the Third or Fourth. They should be their continent’s best in terms of potential! I really could not understand.</p><br/><p>It was one thing to be lacking in ability, but they were also lacking in their mindset. At least Paul was a bit more fierce. Although he died right away from being overzealous, he was much better than the ones attacking occasionally, or the ones only using skills when their mana allowed it.</p><br/><p>Another thing I didn’t like was that everyone expected defeat before we even challenged the Floor Master. However, I let that one slide. What was important was that it annoyed me and made me want to vent this frustration with action.</p><br/><p>This is what a real warrior would do!</p><br/><p>“Peika, make a path for me!”</p><br/><p>[Okay, Master! Eit!]</p><br/><p>Over 20 percent of my mana drained out of me in an instant, as Peika put her hands out and let out a cute shout. Immediately afterwards, a laser-like lightning thicker than her own body shot out toward the ghoul, destroying all zombies in its path. Numerous messages of me receiving gold rang out, but I ignored them.</p><br/><p>“I made the path, so everyone take care. Peika, you come to me!”</p><br/><p>[Okay!]</p><br/><p>“We’ll follow Shin’s orders. Miss Shuna, let’s go.”</p><br/><p>“B-But, if we just leave everything to Crown Prince-nim, it won’t be a raid!”</p><br/><p>“This isn’t a raid, Miss Shuna.”</p><br/><p>Ellos said with a hint of bitterness.</p><br/><p>“It’s a fight for our continents’ survival.”</p><br/><p>After absorbing Peika, my Black Earthen Spear flickered with threatening sparks. I ignored the zombies running towards me. I knew they wouldn’t hinder me in the slightest.</p><br/><p>“Guooo…”</p><br/><p>“Hey, Giant Ghoul. It’s a great day to die, isn’t it?”</p><br/><p>When I stopped the Giant Ghoul from chasing after Ellos and the others, who were running back, he glared at me as if he was extremely annoyed. However, he wasn’t scary in the slightest. While taking care of the zombies, I had already learned its movement patterns.</p><br/><p>“I’m starting.”</p><br/><p>I didn’t plan on using Talaria. I didn’t need to use it. The spear in my hand and Peika. Just the two of them would be enough.</p><br/><p>“Guoooooo!”</p><br/><p>“Haat!”</p><br/><p>I jumped to the side and dodged his claws easily. At the same time, I stabbed my spear into the back of his hand. He was certainly different from the ordinary ghouls, as his defense was overwhelmingly stronger. My spear could only stab into his skin lightly. It was within my expectations. I stabbed with my spear a few more times. As a result, the spear broke through his skin and blood spurted out.</p><br/><p>“Kuaaaaaaa!”</p><br/><p>“Haa! It’s going to sting a little!”</p><br/><p>In truth, stabbing consecutively was hard to do with a spear, and would have been hard even if I had a sword. I didn’t know about others, but my stabbing movement concentrated my body’s energy into one point and thrust out. If an ordinary person did such movements consecutively, their muscles and bones would shatter.</p><br/><p>However, it was a different story for explorers like myself, whose bodies could grow endlessly. We could protect and strengthen our bodies with the power of mana. Even among dungeon explorers, I, who compressed my bones, muscles, and skin, could easily perform consecutive stabs. I could even do it as I cooked myself some pork belly to eat.</p><br/><p>This was what it meant to truly become strong. It was not using the same techniques as always, just with increased strength and dexterity. It was using techniques that could only be done with increased strength and dexterity!</p><br/><p>“Kuaaaa!”</p><br/><p>The enraged Giant Ghoul failed in trying to kick me. Then, he swung his claws at me. The attack swiped up from below and even had a wide range, making it hard to avoid. However, it also served as a good chance. A good chance for me to dig into his chest.</p><br/><p>Because of his swiping movement, his face and chest were both lowered to the point where they were within my reach without me having to jump.</p><br/><p>“Haaaap!”</p><br/><p>Another consecutive stabbing. Using the time it would take for his claws to reach me, I stabbed my spear into his face multiple times. Every time my spear collided with his face, it burned with a frightening sound from my Spirit Aura. After receiving a huge injury, the Giant Ghoul became startled and stepped backwards, trying to stomp on me.</p><br/><p>“Kuaaaaa!”</p><br/><p>“I’m not done yet!”</p><br/><p>I concentrated my energy on the Black Earthen Spear. Mana flowed into it following Peruta Circuit’s pathway. In addition, the body’s pure strength that I could control also flowed into it. Gathering in the tip of Black Earthen Spear, they both became concentrated at a single point. This process, which would have taken a longer time without the blessing of a skill, only took an instant to complete, as if a god’s power had guided it.</p><br/><p>As always, a radiant white light spiraled out. Together with Spirit Aura, it became a spiral of white lightning. My Black Earthen Spear took the form of Zeus’ lightning, as it radiated out with a brilliant white light. The Giant Ghoul was clearly uncomfortable. Undead monsters were naturally weak to light. It wanted to stomp and kill me, but Heroic Strike only took a moment to complete.</p><br/><p>“Heroic Strike!”</p><br/><p>“Kuaaaaaa!”</p><br/><p>I shot my spear out with all my strength. It pierced the same area on his face that I had attacked before. At the same time, his wild thrashing stopped. All the zombies stopped their movements as well. In that instant, a cold silence hung in the graveyard.</p><br/><p>“Is he dead?”</p><br/><p>Ellos whispered quietly. I believed he was dead, but Ellos’ words made me raise my guard. As if to answer my suspicion, the Giant Ghoul got up after a bit of struggle. “Ba-Dum.” The sound of a heartbeat rang out from a place I couldn’t point out. In the next moment, the injuries he received on his face and in other places were disappearing. It was as if time was flowing backwards.</p><br/><p>[Giant Ghoul uses ‘Diehard’! He completely recovers from all injuries, and regains 50 percent of his max HP!]</p><br/><p>“Guooooo!”</p><br/><p>“You sure sound excited!”</p><br/><p>“Damn it, I thought we won!”</p><br/><p>“So even with Crown Prince, this is how far we go…”</p><br/><p>“Kuk, but it was still a good experience. Who knew we’d go so far on our first try?”</p><br/><p>“Just knowing that skill exists is a great help. We’ll have to find a way to stop it from being used next time.”</p><br/><p>The party members started talking helplessly again. It made me depressed just listening to them. However, I still had some moves left in me. I didn’t plan on giving up in the slightest.</p><br/><p>“Palludia, do you have attack chants, too?”</p><br/><p>“I-I do! Orc… Are you going for it?”</p><br/><p>“Don’t call me Orc.”</p><br/><p>Lightly answering her, I tapped on my chest where my pocket watch was always hanging.</p><br/><p>“Have you seen an orc this strong and cool?”</p><br/><p>Although it was embarrassing, I had to exaggerate a bit to lighten up this depressing mood of death and defeat. Confirming that the cooldown time on my Double Potion had ended, I gulped down another Double Potion. The Black Earthen Spear had pierced through his head and flown to some unknown area of the graveyard, but I didn’t necessarily need Black Earthen Spear right now.</p><br/><p>“Palludia, attack him however you can! This goes for the archers too! Close-range damage dealers, stay back and protect them!”</p><br/><p>At my command, Palludia nodded her head and began to chant. Baruela and the elf archer both seemed to be using a skill as they mumbled something and aimed their bows at the Giant Ghoul. Meanwhile, the fully recovered Giant Ghoul charged towards me as he glared angrily. How annoying. If he was smaller, I would have smacked him away. It was truly a shame.</p><br/><p>“Don’t think you’re the only one with skills.”</p><br/><p>‘I was going to end it with a bang, but you ruined my plan with that cheaty skill! I won’t forgive you for that!’ I could use my spear again like an adult, but I wanted to let this ghoul understand the depressing feeling I had. With a deep breath, I shouted.</p><br/><p>“Uwaaaaaak!”</p><br/><p>[You used Orc Lord’s Warcry! All party members are cleansed of negative status effects. All party members’ attack power increases by 50 percent for the duration. All party members become super-armored, unfazed by enemy attacks.]</p><br/><p>“W-What!?”</p><br/><p>“This is Orc Lord’s Warcry!”</p><br/><p>“I, I’ve heard of it before. That Crown Prince uses Floor Masters’ skills…”</p><br/><p>“GUOOOOOOO!”</p><br/><p>The Giant Ghoul roared as it faced me, then swung his claws at me. I shouted before he could reach me.</p><br/><p>“Dragon Skin!”</p><br/><p>“Kak!”</p><br/><p>The Giant Ghoul howled. His claws had hit my chest and shattered. As expected, Dragon Skin worked even against Floor Masters! I lifted my hand, which was slower because of Dragon Skin, and tightly gripped the Giant Ghoul’s arm. Now that it was within my grasp, I would not let go.</p><br/><p>“Kuooooo!”</p><br/><p>“You’re dead. You ever hear of pay to win? This is skill to win! Everyone, he can’t move, so attack!”</p><br/><p>“O, O Mitarus! Use your subject’s body and bring down the iron mace on thy enemy who disrupts the world’s justice!”</p><br/><p>“Sniping Shot!”</p><br/><p>“Arrow Bomb!”</p><br/><p>The three girls’ attacks bombarded the Giant Ghoul. Although he shook his body in an attempt to dodge them, his resistance subsided when I grabbed another one of his claws and broke it. Immediately afterwards, a silver mace appeared in the air. A sharp arrow and an arrow imbued with black aura flew toward the Giant Ghoul, and all three weapons struck the Giant Ghoul. The black aura arrow even exploded upon contact, leaving behind a black trace on his face.</p><br/><p>The Giant Ghoul screamed and used his free hand to scour the ground below. I realized he was looking for zombies to eat. Ellos seemed to have noticed it as well.</p><br/><p>“Kill the zombies near his hands!”</p><br/><p>“Understood!”</p><br/><p>The elf archer and Baruela crazily shot their arrows the moment Ellos’ words left his mouth. The zombies rising from the ground fell and crumbled. Unable to recover his wounds, the Giant Ghoul let out an angry roar.</p><br/><p>“KIAAAAAA!”</p><br/><p>“As always, the final blow should be done by the main character!”</p><br/><p>I jumped on his arm. “Uwoah.” I was extremely slow from Dragon Skin’s effect. Even so, I focused and tightly gripped on his body, crawling slowly toward his face. Although I thought it looked a bit unsightly, I didn’t pay any attention to it.</p><br/><p>After the short, yet long, climb, I stood on the Giant Ghoul’s shoulder. Although it struggled, trying to make me fall, I tightly grabbed onto his ear. Then, I shouted.</p><br/><p>“Dark Thunder Explosion!”</p><br/>\n</div>"}