{"title": "Chapter 63. Draconian Lin (1)", "id": 63, "volume": 1, "url": "http://boxnovel.org/infinite-competitive-dungeon-society-chapter-63-draconian-lin-1", "volume_title": "Volume 1", "body": "<h1>Chapter 63. Draconian Lin (1)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 63. Draconian Lin (1)</p><br/><p>The Giant Ghoul was big even among Floor Masters. His claws were imbued with a mana of death, and when he rampaged, you took mild damage just from being in contact with the ground. Not to mention, he endlessly spawned hordes of zombies, forcing you to stay wary at all times.</p><br/><p>However, I could already easily dodge its attacks, had immense attack power, and had defensive power that mere zombies could not break through. When I obtained a certain skill on top of all that, the Giant Ghoul raid simply became too easy.</p><br/><p>It was the reward I received from solo clearing the Giant Ghoul raid.</p><br/><p>[Death Counter (passive) – You will not get intimidated against the undead. Against the undead, all attack skills become 50 percent stronger and you cannot become an undead. This skill has no skill level.]</p><br/><p>I found it quite ironic that a skill perfect for fighting against the undead only appeared after defeating the Giant Ghoul solo, but there wasn’t much I could do about it.</p><br/><p>The part about not being intimidated by the undead was a strong effect. It was only after I obtained the skill that I realized my attacks were unnatural when fighting the undead compared to when I was fighting other monsters. Not only were my attacks unnatural, my defensive or evasive maneuvers all had strange, unnecessary movements mixed into them.</p><br/><p>When I asked Loretta about it, she said living beings instinctively became weaker in face of the undead, who defied death and desired the living. I felt that skills really were amazing, being able to defy something instinctive.</p><br/><p>Plus, the 50 percent attack boost when using attack skills was the main charm.</p><br/><p>“GUOOOO!”</p><br/><p>“I’ll return you to hell soon!”</p><br/><p>I slowly disabled the Giant Ghoul. When a target was this big, it was best to gradually make parts of its body incapable of fighting. First, I worked on the Giant Ghoul’s left arm. Starting from the back of the hand to the wrist, forearm, and shoulder, I precisely pierced target locations with my spear. The Giant Ghoul then became unable to move his arm.</p><br/><p>“Haaaap!”</p><br/><p>I then continued to his left leg. It only took about 10 minutes to completely render half of his body useless. At this point, the Giant Ghoul began to look for zombies to consume in order to recover his injuries. The problem was that since he could only use half of his body, only his right hand could help him in this task. The Giant Ghoul was truly too predictable!</p><br/><p>The Giant Ghoul quickly dragged his body to where the zombies were. Before he could grab any, I shot a Tempest forward.</p><br/><p>“Kuooooo!”</p><br/><p>“And take this!”</p><br/><p>When the Giant Ghoul missed his targets and let out an annoyed roar, I shot forward and stabbed my Black Earthen Spear into its right forearm. Then, I exploded my Spirit Aura.</p><br/><p>[Critical Hit!]</p><br/><p>“KUAAAAAA!”</p><br/><p>“Perfect.”</p><br/><p>The Giant Ghoul screamed and tried to shake me off of his right arm. Before I could fall on the ground, I pulled out my Black Earthen Spear and jumped off. I had grown too used to fighting large monsters lately. I found myself getting on and off their bodies with familiarity.</p><br/><p>“What are you going to do now without your arms? Want to try using your mouth directly?”</p><br/><p>“KIAAAAAA!”</p><br/><p>It went without saying that he tried to do exactly that. However, his target was no longer the zombies, but me. As if to devour me along with all the zombies slowly approaching me, the Giant Ghoul opened his mouth wide and shot forward. This was also the moment I was waiting for.</p><br/><p>“Eat this! Heroic Strike!”</p><br/><p>I threw my Black Earthen Spear imbued with a generous amount of Spirit Aura. It shot forward like lightning and accurately hit the Giant Ghoul’s face, piercing through his skull. The Giant Ghoul’s head exploded, scattering rotten blood and other substances into the air. With his defense being so easily broken, I didn’t understand all the complaining other explorers did about it having impenetrable skin.</p><br/><p>The Giant Ghoul eked out a cry with its possibly broken vocal cords as it thrashed about. His health was likely reaching its bottom. He would soon use Diehard and try to recover his health and restore his injuries.</p><br/><p>Of course, I wouldn’t just sit still and let it happen! I took out my Silver Spear and aimed at his heart.</p><br/><p>“Here’s another one! Divine Speed, Heroic Strike!”</p><br/><p>The Silver Spear combined with Spirit Aura and let out a dazzling light. In truth, I thought that the Silver Spear looked cooler than the Black Earthen Spear. Thinking rather useless things while Divine Speed’s time was ticking, I shot the Silver Spear toward the heart of the Giant Ghoul, who had just used Diehard and was in the process of recovering.</p><br/><p>[Critical Hit!]</p><br/><p>“Gu…ooooooooo….!”</p><br/><p>Of course, my attack hit its target perfectly. The Silver Spear pierced the Giant Ghoul’s heart, which was strangely pumping out cold, rotten blood, and exploded it. After finding out Diehard activated using the heart as its basis, I always killed the Giant Ghoul without giving it time to complete Diehard.</p><br/><p>[You obtained 30,000 gold.]</p><br/><p>[Rewards will be distributed in order of contribution.]</p><br/><p>[Kang Shin-nim’s contribution is the highest. Choose your reward.]</p><br/><p>[1. Skin Strengthening Elixir</p><br/><p>2. Giant Ghoul’s Shirt]</p><br/><p>Seeing the Giant Ghoul’s Shirt on the reward list, I let out a sigh of relief. When I used a Party Member Scarecrow, the dungeon didn’t consider the fight as a solo raid. As such, neither the special equipment piece nor the ‘Death Counter Magic Book’ dropped. There were two normal rewards to choose from, one of which was the Giant Ghoul’s Shirt I had been waiting for.</p><br/><p>In truth, I didn’t know what material the Giant Ghoul Set was made out of, and I didn’t want to wear them because they felt dirty. Even so, I had to equip them once to confirm the set skill. With a frown, I equipped the Giant Ghoul Set.</p><br/><p>[You equipped the Giant Ghoul Set. Your strength and dexterity increase by 12. When the Giant Ghoul Set is equipped, you can use ‘Diehard’ once per day.]</p><br/><p>As expected, Diehard was the skill I received. I quickly stored it in my pocket watch’s 5 o’clock position and threw off the Giant Ghoul Set. Then, I closely examined Diehard’s skill description.</p><br/><p>[Diehard: usable once per day. Automatically activates when HP falls below 3 percent, restoring all injuries and filling up your HP to 50 percent of its maximum.]</p><br/><p>“Ama…”</p><br/><p>Amazing! This skill! What a cheat! As long as I didn’t die in a single hit, I could recover up to 50 percent of my max HP even from 1 percent HP. Realizing once again that all Floor Masters’ skills were cheats, I rubbed the pocket watch on my cheek. I couldn’t be reckless just because I got this skill, but I could at least be more daring in the way I moved. Just that fact made this skill valuable!</p><br/><p>Just like that, I obtained the skill that would later give me the name ‘Undying Crown Prince.’</p><br/><p>[Name: Kang Shin Race: Human Sex: Male</p><br/><p>Class: Elementalist (Sub – Skill Collector) Title: Giant Ghoul Slayer Rank: Silver 7</p><br/><p>Level: 26</p><br/><p>HP – 10,120/10,120 MP – 6,230/6,230</p><br/><p>Strength – 80(+35) Dexterity – 74(+21) Constitution – 78(+28)</p><br/><p>Intelligence – 20(+11) Magic – 79(+11) Charm – 57(+11) Luck – 21(+11)</p><br/><p>Normal Skill – High-rank Martial Arts (Lv 2), High-rank Spear Technique (Lv 5), Mid-rank Heroic Strike (Lv 4), Mid-rank Provoke (Lv 3), Divine Speed (Lv 3), Return (Lv 1), Low-rank Dash (Lv 9), Peruta Circuit (Lv 4), Deific Manifestation, Death Counter</p><br/><p>Class Skill – Mid-rank Spirit Mastery (Lv 1), Low-rank Spirit Aura (Lv 8), Low-rank Elemental Control (Lv 8), Low-rank Elemental Contract (Lv 8), Low-rank Elemental Tempest (Lv 9), Thunder Beast (Lv 2)</p><br/><p>Subclass Skill – Endow Skill, Spirit of the Collector]</p><br/><p>[Equipment:</p><br/><p>Power Earrings (Strength +2)</p><br/><p>Flesh Golem’s Second Finger (Strength +7, Constitution +7)</p><br/><p>Lizard Knight Set (Strength +10, Dexterity +10)</p><br/><p>Arachne’s Black Earthen Spear (Strength +5, Dexterity +10, Poison damage on all basic attacks, inflicts poison status effect.)]</p><br/><p>[Collector’s Pocket Watch:</p><br/><p>1 o’clock: Orc Lord’s Warcry</p><br/><p>2 o’clock: Vengeful Spirit’s Wail</p><br/><p>3 o’clock: Dark Thunder Explosion</p><br/><p>4 o’clock: Dragon Skin</p><br/><p>5 o’clock: Diehard]</p><br/><p>[2 Event Dungeon clears, 1 Event Raid clear, accumulated bonus stats: 3]</p><br/><p>[Current skill points: 10]</p><br/><p>[Six title-effects: (Orc Lord Slayer, Wraith Queen Slayer, Dark Ratman Slayer, Giant Ghoul Slayer, Lizard Knight Master, Hermes). Accumulated effects: All stats +11, 15% speed increase, increased affinity to all elements, affinity to wind element greatly increased, can summon Talaria once per day.]</p><br/><p>With an extremely satisfied expression, I headed towards Loretta, who greeted me with a smile.</p><br/><p>“Looks like you got it, Shin-nim.”</p><br/><p>“Yep. It was a much better skill than I expected… I’m looking forward to the future.”</p><br/><p>“Huhu, seeing you get stronger makes me all happy. Good luck going forward as well.”</p><br/><p>“M-Mmm, thanks.”</p><br/><p>Eh…? Didn’t she seem closer just now? When I tilted my head and pondered, Loretta interrupted like a thunderbolt from a clear sky.</p><br/><p>“It looks like we won’t meet at the Floor Shop for a while.”</p><br/><p>“What!? Why?”</p><br/><p>“It’s my resting period, one that lasts for 1 year every 100 years. I’m operating countless Floor Shops with my consciousness split into puppets. I sometimes need rest too, don’t you think?”</p><br/><p>“Ah, yes. Mm, I’ll miss you.”</p><br/><p>“… You really will miss me?”</p><br/><p>Loretta suddenly put her face close to mine and blinked. Although I was a little flustered, I answered her honestly.</p><br/><p>“Of course, I’ve always been with Loretta. I had fun these past 5 years and even received a lot of help.”</p><br/><p>“Will you miss me that much?”</p><br/><p>“Well, of course… uuu, how embarrassing.”</p><br/><p>“Don’t worry, Shin-nim… I’m embarrassed too.”</p><br/><p>With that, Loretta smiled bashfully. For an instant, I fell into a trance at her beautiful expression, and had to make an active effort to snap myself out of my daze. Then, Loretta put her hands in her shop apron pocket and took something out after rummaging through.</p><br/><p>“Since you say that, this here is perfect for customer!”</p><br/><p>“Ek! Are you selling something again in this timing?”</p><br/><p>“Ah! Erm, well… I-It’s not being sold.”</p><br/><p>Loretta shrunk back after shouting out full of spirit. She wasn’t selling it? I looked at the object in her hand. It was a light blue crystal shaped like a small key. It was a truly elaborate and beautiful key.</p><br/><p>“What’s this?”</p><br/><p>“Um, you know, Shin-nim. Shin-nim will become the owner of a mansion called Marianne’s Garden.”</p><br/><p>“Ah, I remember from last time. You said Marianne’s Garden was the only Special Mansion without an owner.”</p><br/><p>Loretta nodded her head silently and seriously.</p><br/><p>“Special Mansions aren’t something you can buy with money. They’re a sort of special reward given out to explorers who made important achievements in the dungeon. When people realize Shin-nim is the owner of Marianne’s Garden, all other dungeon explorers will come to look at Shin-nim with admiration. Ah, not that I think someone would go out of their way make trouble, but it’s best that you don’t go around telling everyone you meet that you’re an owner of a Special Mansion. Claim it silently and enter it silently. The Residential Area has marketplaces and even adult entertainment districts, but residents have to use a special method to enter their houses. Unless they reveal where they live and lead others to it, no one can find out.”</p><br/><p>“That makes me even more curious.”</p><br/><p>“You’ll receive something that looks like this key. You can use it to enter Marianne’s Garden.”</p><br/><p>“I see. Then what about this key?”</p><br/><p>Loretta became silent. Her cheeks flushed red.</p><br/><p>“J-Just like its name suggests, Marianne’s Garden comes with a beautiful garden. In the center of that garden, there is a spring called Fairy Spring. It’s not only Marianne’s Garden. Other Special Mansions also have special devices like the Fairy Spring. This key reacts to those devices and operates.”</p><br/><p>“Operates?”</p><br/><p>“You’ll find out when you bring this key to Fairy Spring. T-Take it as a goodbye present!”</p><br/><p>Loretta handed the crystal key to me. As I accepted it, I tilted my head. Operates? Will a giant robot pop out from the spring or something? Or will a door to a new world open? Although I wanted to ask Loretta, it didn’t look like she would answer.</p><br/><p>“M-Make sure you do it. Okay, Shin-nim?”</p><br/><p>“I, I got it. I got it so don’t look at me with those teary eyes.”</p><br/><p>Loretta was a bit strange today. When I looked at her, I felt stuffy and my heart pounded faster. I felt a bit hot, but I didn’t think anything was different than usual. Did I catch a cold?</p><br/><p>“T-Then you should head up. I also have to get ready and scrap the puppets.”</p><br/><p>“I understand. Thank you for everything until now, Loretta. I’ll see you in a year.”</p><br/><p>“… It… might not take a full year.”</p><br/><p>“Really? That’d be great!”</p><br/><p>When I gave her my wholehearted smile, Loretta smiled wholeheartedly in return. It was a beautiful smile without a single blemish. She then said.</p><br/><p>“How about you buy 100 bottles of Holy Water to say goodbye? If you buy all 100 bottles now, I’ll give you a one-time 15% discount! That’s only 1,275 gold!”</p><br/><p>“The 26th floor is undead too, huh…”</p><br/><p>With that, I parted with Loretta. Because I felt like I lost a friend of 5 years, I felt extremely sad. Of course, at this point, I did not know where and how I would come to reunite with her.</p><br/>\n</div>"}