{"title": "Chapter 79. Under the Two Moons (2)", "id": 79, "volume": 1, "url": "http://boxnovel.org/infinite-competitive-dungeon-society-chapter-79-under-the-two-moons-2", "volume_title": "Volume 1", "body": "<h1>Chapter 79. Under the Two Moons (2)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 79. Under the Two Moons (2)</p><br/><p>From the 1st through 5th floors of the dungeon, each floor had different monsters. However, from the 6th floor and above, the monsters that appeared had a set pattern to them. The second floor was the same as the first floor, only there were more of them. The monsters on the third floor were slightly different, like a new type of monster being added or the same monsters using different skills. Regardless, once the first floor was cleared with ease, the second floor would also be easy.</p><br/><p>The living armors on the 32nd floor weren’t much different from the living armors on the 31st floor, other than the fact that their attacks were stronger and that there were more of them. However, because the pathway had become longer, it took me 5 hours to pass through the 32nd floor, even though I was already used to dealing with them.</p><br/><p>It was already midnight at this point, but after my constitution broke through a certain point, I only needed 3 hours of sleep to wipe away the fatigue I had built up during the day. Plus, I could go for about 4 days without sleep and be perfectly fine. Although mother kept saying I wouldn’t get taller if I didn’t sleep, I would be troubled if I grew taller.</p><br/><p>I had to be at school by 3, and it took me about an hour to get there. Because mother believed I would collapse from hunger if I skipped breakfast, I had to be in the kitchen at 9 in the morning. After that, I planned to wash up, get three hours of sleep, wake up, and do Floor Master battles before leaving for school around 2. The only problem was that I would have to clear the 33rd, 34th, and 35th floor and fight the Floor Master at least once in 9 hours.</p><br/><p>“Ruyue, let’s hurry up a bit more.”</p><br/><p>[Okay! I’m feeling great!]</p><br/><p>Of course. This oppa was drinking a Mana Potion worth 10 million won per bottle for you.</p><br/><p>After emptying a mid-high-grade Mana Potion, which had a 10 minute cooldown time and filled up 3,000 mana, I adjusted my posture on Ruyue’s back and pointed my spear forward, just like I had done when I broke through the 32nd floor. When Ruyue noticed that I was ready, she began to run. The living armors on the 33rd floor did not attempt to hide themselves and actively attacked me from all directions. Spinning the spear in my hand, I continuously smashed them.</p><br/><p>“Haaaap!”</p><br/><p>Although my aim was more to stop them from approaching me than to kill them, I struck down with my spear and destroyed them whenever I saw an opening. Just by being on Ruyue, I was naturally above the living armors. The destructive power from striking down with my spear clad with Spirit Aura was nothing to scoff at. The living armors did not die until their armors were completely shattered, meaning half-baked stabs were not effective. It was why I came to enjoy striking down from above.</p><br/><p>However, after I broke the fifth armor and was about to keep going, something smacked me.</p><br/><p>“Cough!”</p><br/><p>[Aooooooo!]</p><br/><p>Clang Clang!</p><br/><p>After realizing that I had been hit, Ruyue hurriedly created a wall of ice around us, blocking the follow up attacks and giving me a chance to regain my composure. After looking at my shoulder where I had been hit, I confirmed that it wasn’t a serious injury and let out a sigh of relief. Then, I checked my HP. With just one hit, my HP had decreased by 10%.</p><br/><p>What was it? I saw an iron mace for a second, but I definitely destroyed the living armor carrying an iron mace. I saw it disappear into particles, so I couldn’t have been mistaken. In that case, the answer was obvious.</p><br/><p>Whoosh! Whoosh!</p><br/><p>“The iron mace moved by itself and attacked me!”</p><br/><p>Seeing the iron mace fly above the ice wall and strike down at me, I fiercely struck it down with my spear. As expected, no one was holding the iron mace. My Spirit Aura exploded for an instant and shattered the iron mace.</p><br/><p>Of course, I had known its identity. Flying weapon! Just like the living armors that moved by themselves, flying weapons also moved by themselves, as if they were possessed by ghosts. I should have expected it the moment I saw living armors, but I didn’t think living armors would attack me with flying weapons. They had tricked me well.</p><br/><p>[Does it hurt? Sorry, I didn’t think it would move.]</p><br/><p>[Master got hurt! You stupid!]</p><br/><p>“It’s fine, I didn’t know either. Everyone makes mistakes. We just have to not make the same mistake again.”</p><br/><p>After comforting Ruyue, who was apologizing, and Peika, who growled at Ruyue, I fixed my posture. Although my shoulder still throbbed from the iron mace’s heavy impact, my HP had only gone down by 10%. I wasn’t a dungeon explorer for 5 years for looks. I had long since grown used to pain.</p><br/><p>“From now, let’s break the weapons as we go too.”</p><br/><p>[I’ll be better this time!]</p><br/><p>“Ruyue can keep doing the same thing.”</p><br/><p>I picked up my spear again. The moment Ruyue’s ice wall crumbled under the continued attacks from the living armors, I lightly kicked Ruyue’s thigh. With a howl, Ruyue started running forward.</p><br/><p>[Auuuuuuu!]</p><br/><p>“Stop hiding and come fight me, you empty rice-cakes!”</p><br/><p>[You used Provoke, drawing all nearby enemies’ attentions!]</p><br/><p>The living armors that were scattered here and there ran toward me with creaking sounds. Running around on Ruyue’s back, I went to gather them up in one spot. While running, when living armors blocked Ruyue’s path, she skillfully jumped over them, changing direction and gathering them all together.</p><br/><p>Although I would end up facing a large number of living armors if I continued, I stopped after a certain point and ran circles with Ruyue in a wide area of the pathway. There, the living armors became confused and even accidentally attacked each other. I then went around to the outside, hitting away the living armors and flying weapons on my way, then aimed my spear at the gathered living armors and shouted.</p><br/><p>“Elemental Tempest!”</p><br/><p>[We were waiting!]</p><br/><p>[Whoo, it’s the spin spin!]</p><br/><p>[Hey! I’m first!]</p><br/><p>… For some reason, it seemed my name had begun to spread amongst the elementals. It felt strange. Regardless, thanks to the elementals overflowing motivation, I could activate Elemental Tempest with a shorter charge up time than normal. As a skill that used half of my mana, its effect was clear. A storm of elementals created by the combined effort of all types of elementals. I had never regretted using this skill.</p><br/><p>As elemental storm swept over the living armors and shattered them, the combined creaking noise seemed to make an orchestral symphony.</p><br/><p>[You obtained 500 gold.]</p><br/><p>[You obtained 450 gold.]</p><br/><p>[You obtained a Fragment of Flying Weapon.]</p><br/><p>[You obtained a Fragment of Living Armor.]</p><br/><p>…</p><br/><p>I waved my hand and shooed away the flurry of messages. With so many monsters disappearing at once, the pathway was now wide open, making it pleasing to look at.</p><br/><p>I opened another 10 million won Mana Potion. Although it was possible to hunt without using Mana Potions, once someone used one, it was impossible to continue without using them. After finding out the incoming money exceeded the expenditure, there was no reason to hold back.</p><br/><p>Just like that, I became a man that used 10 million won every 10 minutes. However, every two or so living armors dropped around 500 gold, meaning just 20 of them would be enough to make up for it. Dungeon explorers rocked!</p><br/><p>“Ku, that felt great. Ruyue, let’s go!”</p><br/><p>[Auuuuuuuuu!]</p><br/><p>The 33rd floor was thus cleared by the combined effort of me and other elementals in just 3 hours.</p><br/><p>Starting from the 34th floor however, there were mummies mixed in with living armors and flying weapons. Mummies were monsters wrapped in bandages, who shot out their bandages to shackle their enemies. The living armors and flying weapons would then easily crush the shackled enemies. It was easy to understand why so many people would be troubled by their combined attack. I could understand the smile Lin had on his face, watching me advance to the 34th floor without buying anything at the 33rd Floor Shop.</p><br/><p>Of course, the mummies were of no danger to me whatsoever.</p><br/><p>[Human! A living human!]</p><br/><p>[I want his body!]</p><br/><p>[Take this!]</p><br/><p>When I ran into three mummies while running through the 34th floor, they each shot three streams of bandages toward me. Although they looked like frail pieces of cloth, their defense was quite tough, so much so that I could not cut them with my spear in one swing. The moment the nine strands of cloth flew over me, I held up my spear in their path. The bandages wrapped around my spear, connecting the mummies to my weapon. Holding on to my spear tightly, I began to spin it around.</p><br/><p>[Eh, I can’t pull it away!]</p><br/><p>[He’s too strong!]</p><br/><p>[My precious bandages!]</p><br/><p>You shouldn’t have sent them all out in the same attack! I strongly pulled on my spear wrapped by 9 strands of cloth, and the mummies closed in on me as if they couldn’t elongate their bandages further. Watching this, I realized how strong I had gotten. I could win against three monsters my level in pure strength. I wasn’t even a beastman!</p><br/><p>“Peika!”</p><br/><p>[Chain Lightning!]</p><br/><p>When I poured mana into my spear and shouted Peika’s name, Peika swiftly used the elemental magic I was thinking of. The lightning energy that started to flow into my spear traveled through the cloth and cooked the three mummies to crisp.</p><br/><p>[The heaven… has been enraged!]</p><br/><p>[I shall go back to heaven...!]</p><br/><p>[And I shall say it was beautiful…!]</p><br/><p>“How do you guys know that poem!?”[1. Lines from the poem Back to Heaven by Cheon Sang-Byeong]</p><br/><p>No, maybe there was a similar poem in the world they came from. I murmured as I took off the burnt bandages from my spear. Then, I looked at the living armors and flying weapons that were happily flying toward me thinking I was captured, and grinned. What happened next was obvious.</p><br/><p>[You became level 35. You obtained the qualification to challenge the Floor Master.]</p><br/><p>[You obtained 5 bonus stats.]</p><br/><p>“Crazy. You really are a crazy bastard. How do you do in a few hours what takes other people in parties two or three months to do?”</p><br/><p>“Lin, I’ve been having similar thoughts recently. Though, at first, I thought other explorers were weird for being so slow and even dying while going through these easy floors.”</p><br/><p>When I checked the time after reaching the 34th Floor Shop, it was 6 in the morning. It took me exactly 6 hours to climb two floors from the 32nd Floor Shop. However, I didn’t understand how others took two or three months to do the same thing. Even if I took out all the buffs from strengthening and compressing elixirs, took out the effects from various titles, took out elemental magic, and lowered my skill levels to what other explorers my level would have… I still didn’t think it would take me that long. Though, of course, having the Riding skill and Ruyue also helped boost my clearing time.</p><br/><p>In any case, someone who was skilled enough to climb to the 30th floor on his own would undoubtedly have collected some titles and self-defining skills on his way. As such, my supposition was useless.</p><br/><p>“Lin, what did you say you would do if I broke through the 35th floor in 1 year?”</p><br/><p>“You haven’t broken through the 35th floor, nor have you defeated its Floor Master. You might lose to the Floor Master, have you thought of that?”</p><br/><p>Lin chewed on his cigarette as he retorted with an unhappy expression. I grinned and lightly stretched my body after distributing my level up bonus stats. Because I rode Ruyue nonstop for six hours and wrestled with mummies, fatigue had built up in my body. I bought a 100 gold Fatigue Recovery Juice and proclaimed to Lin after I was done with it.</p><br/><p>“I’ll see you in three hours.”</p><br/><p>“I think you mean one week.”</p><br/><p>“Beh. We’ll see how it goes.”</p><br/><p>[Beh!]</p><br/><p>[Beh! Beh!]</p><br/><p>I stuck my tongue out at Lin and turned away. Peika and Ruyue also stuck their tongues out at Lin. How cute. Unfortunately, because Peika wasn’t in her material form, Lin wouldn’t be able to see her cute appearance.</p><br/><p>“Hey, that dog… I mean, elemental. Did it just stick its tongue out at me?”</p><br/><p>I didn’t answer him. My head was already filled with thoughts of the 35th Floor Master, who would be waiting for me in the next floor.</p><br/><p>“Hey, I asked if it just made fun of me! Hey, hey!”</p><br/><p>I didn’t hear Lin’s voice. Nope, not at all. I raised my hand above my head to say goodbye, and headed past the Floor Shop. My heart beat at the thought of battle against the Floor Master I knew nothing about.</p><br/><p>“Hey, hey! A mere elemental should not ignore a draconian!”</p><br/>\n</div>"}