{"title": "Chapter 75. The Elementalist That Sealed, The Elementalist That Saves (2)", "id": 75, "volume": 1, "url": "http://boxnovel.org/infinite-competitive-dungeon-society-chapter-75-the-elementalist-that-sealed-the-elementalist-that-saves-2", "volume_title": "Volume 1", "body": "<h1>Chapter 75. The Elementalist That Sealed, The Elementalist That Saves (2)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 75. The Elementalist That Sealed, The Elementalist That Saves (2)</p><br/><p>“Kuhuuuung!”</p><br/><p>“Haaap!”</p><br/><p>About 20 minutes after that. While walking through this harsh Event Dungeon, there was one important thing I learned. It was that rather than using 5 minutes to fight with the yetis, it was better to use Heroic Strike to kill it in one blow, then recover my mana while walking with Peruta Circuit.</p><br/><p>As strong as the yetis were, they didn’t appear all too often. However, when they did, they would never appear alone. Regardless, if I used Heroic Strike to kill the yetis I encountered, I found that I would not encounter more until my mana was already filled up.</p><br/><p>In addition, as Peruta Circuit took in mana from the atmosphere and circulated it inside me, I was less affected by the surrounding temperature. In order to block the cold that even the Cold Protection Robe could not fully guard against, I desperately circulated Peruta Circuit.</p><br/><p>[Peruita Circuit became level 5! Circulating Peruta Circuit will collect more mana, and its speed of circulation increases!]</p><br/><p>“Ooooooh.”</p><br/><p>My theory that training was best done in desperate situations was proven to be true. Slightly frustrated, but happy, I continued to frantically circulate Peruta Circuit. In my hand was a crossbow. Since Peika wasn’t around to deal long-ranged attacks, I had to use the crossbow to fill her role. At the same time, I saw a yeti standing in the distance.</p><br/><p>“Kiaaaaa!”</p><br/><p>“Alright, I might as well train my Crossbow Marksmanship skill.”</p><br/><p>I was practically overflowing with skeleton bones, and the yeti’s large body was the perfect practice target. I held the crossbow up and aimed it at its eye. The crossbolt reloaded automatically and shot out, emanating a red aura. It hit the yeti’s arm and exploded. My aim had been off.</p><br/><p>“This is hard. I’ll have to learn how to aim better.”</p><br/><p>That said, as the weapon, dropped by a 30th floor named monster, and the Flame Bolt Cartridge were both the highest ranked items I owned, the damage they dealt was certainly higher than the swing of my spears. Although the damage couldn’t compare to when I focused and stabbed with my spear, the yeti would undoubtedly hit me if I tried.</p><br/><p>After finding out that the bolt worked on the yetis, I opened my inventory and counted the number of bolts in the cartridge. It seemed the cartridge had a space expansion magic as it fit all 1,577 of the bone bolts.</p><br/><p>“Eat this and die!”</p><br/><p>I instantly started to infinitely shoot with my Silver Bone Crossbow. The bone bolts flew out with close to no delay in between each shot, and exploded on the yeti, who was unable to dodge them. Feeling the continuous recoil as the bolts flew out, I felt like I was using a machine gun. This weapon was even better than I thought!</p><br/><p>[Low-rank Crossbow Marksmanship became level 2. Your precision and critical hit chance increase.]</p><br/><p>“Ooh, skill level rose too.”</p><br/><p>Dangerous. I was about to forget about my original goal and just keep shooting arrows! The yeti, whose fur was scorched and bled profusely, let out an enraged roar as it charged at me. On its way, it woke up two more yetis. These yetis really were never alone.</p><br/><p>“I don’t think I can kill you with just the crossbow yet… but your friends can take some bolts too!”</p><br/><p>I held up my crossbow. No matter how strong they were or how they had the power to freeze their opponents, that didn’t change the fact that they were still living creatures. It seemed easy to take care of the one bleeding profusely, especially since the bolts’ fire attribute scorched its leather, making it easy for arrows to pierce through. This must have been why Loretta sold me the Flame Bolt Cartridge.</p><br/><p>[You obtained Yeti’s Horn.]</p><br/><p>[You obtained 5,800 gold.]</p><br/><p>“These guys sure drop various items.”</p><br/><p>Yeti’s Blood, Yeti’s Leather, Yeti’s Horn. These were the three items the yetis dropped after they were killed. Thinking they couldn’t be just trash items, I checked their descriptions, which only labeled them as [material]s. For now, I decided to hold onto them.</p><br/><p>[Master, it’s getting colder. I feel like something is getting closer.]</p><br/><p>“I’m almost there, Peika. Wait just a bit more.”</p><br/><p>I quickened my pace. With my crossbow in hand, I stayed ready to attack. Not to brag, but I was a quick learner when it came to things that used my body. After a few battles with the crossbow, I was beginning to understand how to aim to properly hit my targets. The skill level also easily rose to low-rank level 3.</p><br/><p>“Kuu, it really is getting colder… Damn, and this strange feeling is getting stronger too…!”</p><br/><p>Something was calling me, looking for me desperately. But almost as if something was blocking our communication, the link between us was cut. Even I was getting more and more annoyed.</p><br/><p>“Guaaaang!”</p><br/><p>“Shut it!”</p><br/><p>[Critical Hit!]</p><br/><p>Just when I wanted to cry, a yeti popped up and attacked me with its claws. I shot two bolts, hitting its left eye and mouth perfectly. The yeti fell and twitched in pain. I didn’t understand. My attacks with level 3 low-rank Crossbow Marksmanship were this strong, but why were the archers I met all so weak? Was it the difference in the quality of our weapons?</p><br/><p>Silver Bone Crossbow. It was a much better weapon than I initially thought. The fact that it reloaded automatically made it no different than an automatic rifle.</p><br/><p>[… Go… back…!]</p><br/><p>“I hear it.”</p><br/><p>It was the voice of an elemental! I quickened my pace. The wind got harsher, and less and less yetis appeared. Before I noticed, two hours had passed since I entered the dungeon. I wanted to find Peika and quickly go home.</p><br/><p>[Master, it’s an elemental! An elemental appeared!]</p><br/><p>“Damn it! Talaria!”</p><br/><p>[You summoned Talaria. For the next 10 minutes, you can freely fly or walk on air. If flying, you will receive an additional 100 percent increase to your movement speed. Remaining time: 09:59:99]</p><br/><p>Although I didn’t want to use it because it might freeze me to death, I had no choice now that Peika was in danger. After using Talaria and flying into the air, I flew as fast as possible in the direction of Peika.</p><br/><p>The wind blew against my face and tried to pick apart my nose and ears, but I withstood it and went on. I had the Cold Protection Robe and was embracing the Black Earthen Spear. With the added warmth from Queen Elf’s Blessing, I could somewhat manage.</p><br/><p>[Shaaaaa!]</p><br/><p>[Not only elementals, but even a human has come in!]</p><br/><p>[This place is the Frozen Elementals’ Prison. It’s not a place a human can enter!]</p><br/><p>How far did I fly? Crystals of ice that had started appearing in the air talked to me as they crashed into me. Although my HP didn’t go down by much, the places in my Cold Protection Robe where the ice crystals crashed became white and frozen. Elementals, these crystals were elementals!</p><br/><p>“Listen to me. I have to save my elemental!”</p><br/><p>[Elementalist?]</p><br/><p>[Don’t listen to him. His words are too sweet!]</p><br/><p>[Don’t listen, don’t listen!]</p><br/><p>“Don’t attack me! I have no intention of attacking elementals!”</p><br/><p>[Don’t listen, don’t listen!]</p><br/><p>[I like him.]</p><br/><p>[I said don’t listen!]</p><br/><p>Thankfully, Loretta’s blessing helped one of the elementals quickly come to my side. I carefully touched the ice crystal that came near my hand. Perhaps because it was no longer hostile towards me, I didn’t feel cold from touching it.</p><br/><p>[He’s warm. I feel like I’m melting.]</p><br/><p>[He’s from the outside! The traitor’s bloodline!]</p><br/><p>“I don’t know what you mean by traitor, but I’m not him! Please, everyone, stop attacking!”</p><br/><p>[If I don’t attack you, will you get me out of here?]</p><br/><p>“Yes, I will. As long as you don’t hurt others.”</p><br/><p>[I won’t! I won’t hurt anyone!]</p><br/><p>[He’s going to betray us. Just like everyone else has in the past.]</p><br/><p>[But he isn’t them.]</p><br/><p>I didn’t really care. Even as they talked amongst themselves, I was flying through the air as fast as I could. Before I noticed, another ice crystal came next to me. Although more ice crystals appeared in my surroundings, none of them blindly attacked me like before.</p><br/><p>[This person is an Elementalist, a person who cares for elementals.]</p><br/><p>[The person who trapped that child was also an Elementalist.]</p><br/><p>[He had no qualification.]</p><br/><p>[He had no qualification!]</p><br/><p>[He was the one at fault, but he trapped that child here with the rest of us.]</p><br/><p>[He locked the door so no one can come in.]</p><br/><p>[But why did the door open?]</p><br/><p>I found her.</p><br/><p>“Peika!”</p><br/><p>[Master! Master!]</p><br/><p>After seeing me, Peika let out shouts of joy. However, I couldn’t be entirely happy. Although Peika was unhurt, there were fairies and elementals hiding behind her, who were shaking because of the harsh environment.</p><br/><p>Not to mention, Peika was currently fighting something. Because my mana wasn’t being drained, it had taken me awhile to notice. So that was it. This place was the Spirit Realm, a place where Peika could freely use mana without having to rely on my own.</p><br/><p>Although Peika’s lightning ripped apart the freezing winds, a breath mixed with ice equally blocked her lightning from continuing. The enemy was strong.</p><br/><p>[I can’t do it alone, Master!]</p><br/><p>“Wait!”</p><br/><p>I instantly descended to her location. At the same time, the thing that was attacking Peika with its breath looked back at me. My heart dropped for a moment. A body bigger than human’s, mane that let out silver light, a face that frowned as if it was in pain, and crimson madness that ruled its eyes.</p><br/><p>“A crazed elemental…!”</p><br/><p>That silver wolf was the owner of this space and the core of the sealing, a crazed elemental. It was an elemental that had developed enough to materialize! Even Peika couldn’t materialize yet!</p><br/><p>“Peika, come here!”</p><br/><p>[No, I have to protect these children!]</p><br/><p>“Guys, can you help me? They’re elementals just like you, and fairies who are also of the same race. Can you protect them?”</p><br/><p>[The fairies only watched us as we were sealed.]</p><br/><p>[The elementals thoughtlessly flew around the Fairy Garden.]</p><br/><p>[But they’re still our kind. I don’t like you, but I will help them.]</p><br/><p>While a few of the ice crystals sparkled and flew toward the fairies and elementals, I landed next to Peika. As Talaria was still active, my feet weren’t buried under the snow. Rather, they were standing on the air above the snow.</p><br/><p>[Krrrrr…]</p><br/><p>“I see, you’re a special elemental. Just like Peika…”</p><br/><p>There were elementals with special powers, elementals who were acknowledged as unique, permitted eternal life, and given the ability to grow. Although Elementalists wanted to form contracts with such elementals, the rule that they could only form contracts with elementals their souls were connected to was always valid. Just because they discovered a special elemental, it didn’t mean they could form contracts with them.</p><br/><p>Even so, there were Elementalists that employed all sorts of different methods to try and form contracts with them. Not one of them managed to succeed throughout long history of Elementalists, and everyone knew what would happen to the elementals when they failed. They would always go mad.</p><br/><p>Although it was the Elementalists that were at fault, the elementals paid the price. It was unfair.</p><br/><p>[Krrr….]</p><br/><p>Looking at the wolf crouching as it revealed its silver teeth, I pulled out my spear. The ice crystals then flew toward me.</p><br/><p>[Will you kill this poor child?]</p><br/><p>[Don’t! You can’t kill this child!]</p><br/><p>[It’s dangerous. I’ll protect you.]</p><br/><p>“Don’t worry. I’m just going to play with it until it regains its sanity.”</p><br/><p>I confidently proclaimed my intention to the ice crystals and aimed my spear at the wolf. I didn’t like punishment. It was the same for my father. Although he had thrown me into all sorts of dangerous situations, he had never beaten in mercilessly. Although he had almost killed me during our spars, he had never beaten me because I did something wrong. As such, I never forgot father’s teaching method, because I vowed to get my revenge on him the same way.</p><br/><p>That said, it was true that beating was the best medicine for the crazy.</p><br/><p>[Krrrr….. Kuaaaang!]</p><br/><p>“Alright, come! I’ll play with you until you’re satisfied! Peika, assist me! Ice elementals, you guys help me too!”</p><br/><p>[Okay, Master!]</p><br/><p>[I’m going to trust him.]</p><br/><p>[If you kill that child, I will kill you.]</p><br/><p>At the same time the elementals gathered around me, Peika floated into the air and shot out lightning with her body. She opened her folding fan and covered her mouth. Her black hair fluttering in the wind was incredibly beautiful.</p><br/><p>[You better get ready, you mutt!]</p><br/><p>[What should we do?]</p><br/><p>“Simple. Just protect me from the freezing energy.”</p><br/><p>[We aren’t strong enough.]</p><br/><p>“I’ll give you strength.”</p><br/><p>I popped open a Mana Potion. Because the liquid inside started to freeze, I quickly gulped it down. I ended up drinking a slushy; It was actually quite tasty.</p><br/><p>I closed my eyes and shared my mana with the elementals around me. Elemental Control. It was the skill necessary for me to use Elemental Tempest, and also allowed an Elementalist without his contracted elemental to use an Elementalist’s abilities. It allowed me to employ free elementals that existed in the world in exchange for my mana!</p><br/><p>[I’m getting stronger.]</p><br/><p>[How mystical, he’s an amazing Elementalist.]</p><br/><p>[He’s a Hero.]</p><br/><p>[He’s a Hero!]</p><br/><p>[Guoooooo!]</p><br/><p>[Master, it’s coming!]</p><br/><p>“I’m ready.”</p><br/><p>I gripped my spear tightly. Thanks to Flame Enchant, the flame energy coming from the Black Earthen Spear seemed to be heating up my entire body. I continued with this vigor, and shouted out.</p><br/><p>“Let’s start by beating you once!”</p><br/>\n</div>"}