{"title": "Chapter 81. Under the Two Moons (4)", "id": 81, "volume": 1, "url": "http://boxnovel.org/infinite-competitive-dungeon-society-chapter-81-under-the-two-moons-4", "volume_title": "Volume 1", "body": "<h1>Chapter 81. Under the Two Moons (4)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 81. Under the Two Moons (4)</p><br/><p>Translator's Note: Changed cleaver to axe. I was thinking of Black Cleaver from League of Legends. So yeah, imagine it looks like Black Cleaver from LoL!</p><br/><p>[Dullahan uses Outburst!]</p><br/><p>D-D-D-D-D-D-Du!</p><br/><p>“Kuk!”</p><br/><p>Without kidding, I felt like I would die of pain. There was no way to dodge this. Shards of rocks completely surrounded me. Just because Dullahan struck his axe into the ground, the rock shards had begun to fly towards me like bombshells. If I hadn’t used Dragon Skin on time, I would have died on the spot. Enduring the rock shards, I moved my body slowed from Dragon Skin, took out a Health Potion and gulped it down.</p><br/><p>[Master, recover mana!]</p><br/><p>[I can’t use Ice Wall!]</p><br/><p>“I can’t recover my mana right now. I’ll just have to endure it.”</p><br/><p>Although I resolved myself to hold on until his skill ended, it lasted for quite some time. Gritting my teeth, I slowly moved my body. There was only one way to escape from this situation.</p><br/><p>“I found it, damn it!”</p><br/><p>Even as I was getting beaten with the rock shards, I found Dullahan’s head that was littered on the ground. His terrifying skill seemed to be a defense mechanism, to prevent someone from taking his head when it separated from his body. Although I gritted my teeth at the actions that resulted in such an atrocity, I was certain breaking his head would end this situation!</p><br/><p>“Just. Die!”</p><br/><p>Putting what little mana I had left into my spear, I thrust my spear forward. However, as if the head was made out of steel, the spear only made a small hole. Instead, my hand went numb. I checked my HP and MP. Thanks to Dragon Skin, I had about 50% of my HP, and I only had about 10% MP left. 10%... If that was the case, then…!</p><br/><p>“Ruyue, I’m going to unsummon you for a bit. Peika, come into my gauntlet!”</p><br/><p>[Master!]</p><br/><p>“This might be better using my spear!”</p><br/><p>Stabbing focused on one point. However, stabbing with just 10% of my mana, I would not be able to pierce Dullahan’s head. In that case, it could be better to expand that hole by punching it for 11 seconds. Since my spear didn’t work, I would be using my fists. Plus, stabbing required me to concentrate, but all the rock shards flying at me disrupted my concentration.</p><br/><p>Ruyue’s body became faint, then disappeared. Peika also came out of my spear and infused herself into my gauntlet. Striking down at Dullahan’s head, I shouted.</p><br/><p>“Thunder Beast!”</p><br/><p>[Kiaaaaak!]</p><br/><p>Dullahan’s screaming became louder, and the number of rock shards flying at me also increased. My HP began to fall at a scary rate. Clenching my fists tightly, I crazily struck down at its head.</p><br/><p>“Uaaaaaaaaaah!”</p><br/><p>[You used Orc Lord’s Warcry! All party members are cleansed of negative status effects. All party members’ attack power increases by 50 percent for the duration. All party members become super-armored, unfazed by enemy attacks.]</p><br/><p>‘I’ll give my all during this 11 seconds of attack!’</p><br/><p>As I was in a super-armored state, being hit by the rock shards did not affect my movements in the slightest. Right now, I didn’t need any fancy skills. I just focused the lightning energy in my fists and struck down again and again. My HP fell below 20%.</p><br/><p>[Master, we’re almost out of time!]</p><br/><p>“Just a bit more! Uaaaaaaah!”</p><br/><p>I struck down again and again. Before I noticed, Thunder Beast was canceled and Peika was unsummoned as well. However, Orc Lord’s Warcry and Dragon Skin were still in effect. Resolved to use Diehard, I continued bashing Dullahan’s head.</p><br/><p>Then, as if it were a joke, his head exploded.</p><br/><p>[Kiaaaaaaaaak!]</p><br/><p>[A Grand Achievement! You defeated the Floor Master, Dullahan, alone! Amazing!]</p><br/><p>[You became level 36. You obtained the qualification to advance to the 36th floor.]</p><br/><p>[You obtained 5 bonus stats.]</p><br/><p>[You obtained the title, ‘Dullahan Slayer.’ All stats permanently increase by 1. This effect will apply even if the title is not equipped.]</p><br/><p>[You became Silver Rank 5. Congratulations.]</p><br/><p>[You defeated Dullahan alone. You obtained the special reward, ‘Dullahan’s Helm.’]</p><br/><p>[You obtained 100,000 gold.]</p><br/><p>[Choose your reward.]</p><br/><p>[1. Heavy Armor Mastery Magic Book]</p><br/><p>As soon as Dullahan’s death throes ended, the barrage of rock shards also ended. I turned around. His body was scattering into the air. In the end, I managed to win without using Diehard.</p><br/><p>“Ah, what a disaster…”</p><br/><p>Sprawled on the ground, I muttered. Until the middle, I had felt great, as if we were both exchanging pointers. Of course, as we were both using our skills, it was hard to say it was a pure fight of techniques. Even so, I was having fun. I had even thought I could defeat his axe technique and make him drop his weapon.</p><br/><p>But just because I separated his head from his body, everything had changed. No matter how I thought about it, that skill was a cheat. I could see what would happen to normal parties. They’d think his head was his weakness and try their best to get it separated from the body. Then, they’d be showered by his rock shards. I then became worried for Ren, but was slightly relieved when I remembered he could endure it with Dragon Skin.</p><br/><p>“Really, none of the Floor Masters are normal.”</p><br/><p>Although I wanted to stay sprawled on the ground to rest, I couldn’t. I had to review my battle with him and think of a strategy that didn’t use Warcry or Dragon Skin. Then, I needed to try it once to make sure it worked. Otherwise, I wouldn’t be able to go to the MT in peace!</p><br/><p>*</p><br/><p>“So you ended up using Diehard?”</p><br/><p>“Yes, damn it.”</p><br/><p>It was one thirty in the afternoon. After eating breakfast and sleeping for three hours, I finally finished my third battle with Dullahan.</p><br/><p>In the second battle, I crushed his hand holding the axe first. I then attacked his head, successfully preventing him from using Outburst. In the third battle, however, I accidentally hit his head with Heroic Strike. Enraged, Dullahan promptly used Outburst.</p><br/><p>Because I didn’t have Dragon Skin, I used Talaria to try to crush his head while avoiding the rock shards, but my HP fell below 3%, and Diehard activated.</p><br/><p>The moment Diehard activated, I hugged Dullahan’s head and used Dark Thunder Explosion, exploding his head and the rock shards before my vitality reached zero. If I didn’t save Dark Thunder Explosion, I might have been able to end it before he used Diehard. It was my fault for failing to realize I could use Dark Thunder Explosion the moment I caught his head.</p><br/><p>However, Lin seemed to be thinking differently.</p><br/><p>“I’m more surprised you managed to defeat the Dullahan alone. Are you really human? Tell me honestly. You’re some other race I don’t know about, right?”</p><br/><p>“Enough with the nonsense. By the way, Lin…”</p><br/><p>“What?”</p><br/><p>“You should stop playing dumb and start making that gauntlet. Within the 2 months I have left, I’ll finish grinding the 35th floor and conquer the 40th floor too.”</p><br/><p>“…”</p><br/><p>The bet between Lin and me said that he would take back my pocket watch and subclass if I couldn’t break through the 35th floor in half a year. If I could, he would make me a gauntlet, and if I even broke through the 40th floor, he said he’d make me a weapon and defensive equipment set. If I managed to do it in 3 months, he would even add a dragon leather cape!</p><br/><p>In other words, I had already won the bet. I just had to work towards the bonuses. Looking deathly pale, Lin took out a portable anvil.</p><br/><p>“Eit, damn it. Because of my damn guild master, I had to meet this damn rookie and do damn blacksmithing damn work. Damn it.”</p><br/><p>“See you tomorrow then, Lin.”</p><br/><p>“Screw off!”</p><br/><p>While Lin said his goodbye by sticking his middle finger out at me, I said mine with a smile. Then, I left the dungeon.</p><br/><p>MTs were considered as highlights of any college student’s college life. As I would finally be experiencing one after a semester, I was looking forward to it quite a bit. Though, I had a strong suspicion that I would be together with Su Ye-Eun even at the MT…!</p><br/><p>“He’s here!”</p><br/><p>“Where’s Su Ye-Eun?”</p><br/><p>“Huh? She was just here a second ago.”</p><br/><p>Ooh, it seemed this MT was supported by the professors. Right, since over 400 students were going to this MT, it wouldn’t make sense if the professors weren’t involved. There were probably sunbaes going too[1. Sunbae = senpai = senior at school/workplace/etc.]. Looking at the tour buses lined up against the school’s hillside road, I blanked out. Before I noticed, Su Ye-Eun had appeared and was glued to my side.</p><br/><p>“Shin, you’re late!”</p><br/><p>“I came just on time. You were in stealth again, weren’t you?”</p><br/><p>“… I, I want to get closer, but I’m scared.”</p><br/><p>I’m surprised you thought about going to the freshman opening party then. I suspected that she was the same in high school and wanted to try for a fresh start at college. Unfortunately, habits were hard to kill, and one’s nature was even harder to change. In the end, she ended up as a loner without a single friend…</p><br/><p>“I’m your friend, Su Ye-Eun.”</p><br/><p>“What, so suddenly!? Like we aren’t close…!”</p><br/><p>I teased Su Ye-Eun as I waited. Suddenly, the surrounding people’s murmuring became more severe. I asked Su Ye-Eun.</p><br/><p>“What’s up with them?”</p><br/><p>“There’s apparently a goddess in our department.”</p><br/><p>“Really? I wonder what items a goddess would drop…?”</p><br/><p>“…”</p><br/><p>‘It’s probably not possible at my current level…’ My eyes had a distant look, and Su Ye-Eun was looking at me with an even more distant look. Kuhum. With a dry cough, I asked her again.</p><br/><p>“So that goddess just appeared?”</p><br/><p>“Yeah. She’s apparently an international student from France.”</p><br/><p>“Really. There are so many international students at our college. Though, most of them are Chinese.”</p><br/><p>More than 20% of our department was Chinese. When doing group projects, there was at least 1 Chinese international student in each group. Most of them weren’t enthusiastic. There were, of course, ones that were, but because of the language barrier, it was better to think of the international students in group projects as nonexistent. Though, since I didn’t participate in group projects, I didn’t have the qualifications to say anything about them.</p><br/><p>Other than China, there were quite a few American, Japanese, British, and French international students. For a school that bragged about cultural pride, it accepted way too many international students!</p><br/><p>“We’re going! Get on the buses!”</p><br/><p>As expected, I could see the sunbaes leading the MT. With Su Ye-Eun who grabbed onto me in order to not get lost, I got on a bus.</p><br/><p>“Can I take the window seat?”</p><br/><p>“Sure.”</p><br/><p>After leaving Su Ye-Eun to take the window seat, I sat up straight, circulated Peruta Circuit, and summoned Peika and Ruyue.</p><br/><p>[There are lots of people. Master, what are they doing? Are we hunting them?]</p><br/><p>[Whoo hoo!]</p><br/><p>“Please don’t, Peika. Ruyue, come here.”</p><br/><p>I talked so only my elementals could hear me, then hugged them. Although they struggled for a little bit, they seemed to have found their comfortable spots as they sat still and looked around.</p><br/><p>“We’re going to rest today.”</p><br/><p>[It’s warm. I like it.]</p><br/><p>[I like it too.]</p><br/><p>Holding the calmed elementals in my embrace, I quietly closed my eyes and focused on Peruta Circuit. I had withdrawn my focus to my inner self to only concentrate on my mana traveling through the pathway engraved in my body. Since I usually circulated Peruta Circuit while I was running the dungeon, it wasn’t bad to devote my time to circulating Peruta Circuit like this. Soon, I fell into a trance observing and concentrating on my mana, to the point that I no longer heard the sounds around me.</p><br/><p>“Auu, he looks like a painting even while he’s asleep.”</p><br/><p>“Take a picture, hurry.”</p><br/><p>“I want to hug him.”</p><br/><p>“Mm? D-Don’t take a picture of Shin!”</p><br/><p>When we arrived at the pension[2. Pension is not meant to be mansion or a retirement plan, it’s a large boarding house you can rent out.] where the MT was held, it was about 5:30. When I opened my eyes realizing that the bus had stopped, Su Ye-Eun’s face was hovering in front of my own. Because of her well-defined facial features, I sometimes thought she was a foreigner. Close up, it was even more obvious. It was especially the case for her sharp nose bridge and big, manhwa character-like eyes.</p><br/><p>“What are you doing?”</p><br/><p>“I was trying to wake you up.”</p><br/><p>“I wasn’t even sleeping… Whatever, let’s go.”</p><br/><p>With my two elementals on my shoulders, I went outside with Su Ye-Eun, still circulating Peruta Circuit. The surrounding environment was clean, and there were no signs of civilization besides the pension in front of us. For a pension in the vicinity of Seoul, I was quite surprised by how nice it was.</p><br/><p>First, I looked around. We were far from the city and there was a mountain nearby. After Two Moon, the environment to watch out for the most was the mountains, followed by areas near mountains. By that standard, the place we were in was quite dangerous.</p><br/><p>“This place… a monster might appear here.”</p><br/><p>“Not funny! Even if something happens, we can just alert Guardian, so don’t worry.”</p><br/><p>A female student that had approached me without me noticing laughed and answered my monologue. I nodded my head with an evasive ‘mmm.’ Next to me, Su Ye-Eun pulled on my sleeve.</p><br/><p>“Let’s go together, Shin.”</p><br/><p>“Tsk.”</p><br/><p>The female student clicked her tongue. I tilted my head, wondering why, and at the same time, caught sight of a female student stepping out of another bus. Blonde hair and blue eyes, she possessed a dazzling beauty that made those around her look a league below her. She was undoubtedly the international student called goddess or whatnot.</p><br/><p>She also saw me, and winked. I winked back, thinking I should respond the same way. She seemed startled for a moment, but soon laughed and lightly waved her hand at me before going into the pension first. The male students that had gathered around her glared at me with scary expressions. It was truly laughable.</p><br/><p>Although Su Ye-Eun kept pulling on my sleeve with an uneasy expression, I only shook my head, unable to understand why. The way she was shaking was making me uneasy as well. Just what was she uneasy about? I pulled Su Ye-Eun toward me.</p><br/><p>“Let’s go. Even if a monster appears, I’ll protect you.”</p><br/><p>“Kyaak!”</p><br/><p>… Unable to understand why other girls were happy with what I said, the curtains were raised to my first MT.</p><br/><p>Translator's Note: Membership Training (MT) is an event held among university students in South Korea. These events last roughly two days and are considered a free-form training session, where students spend time socializing with peers in the same academic majors or clubs, often at a remote location.</p><br/><p>(read more here: https://en.wikipedia.org/wiki/Membership_Training_in_Korea)</p><br/>\n</div>"}