{"title": "Chapter 97. Granting Freedom (4)", "id": 97, "volume": 1, "url": "http://boxnovel.org/infinite-competitive-dungeon-society-chapter-97-granting-freedom-4", "volume_title": "Volume 1", "body": "<h1>Chapter 97. Granting Freedom (4)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 97. Granting Freedom (4)</p><br/><p>The dungeon’s Residential Area was packed with people today, as always. However, I headed straight to my mansion. I wasn’t going there to rest, but to visit the Fairy Garden through the Fairy Spring. In the pavilion on the way to Loretta’s log cabin, I saw someone I had not seen on my last visit.</p><br/><p>“Lin!”</p><br/><p>“Oh, if it isn’t Kang Shin, the Crown Prince who died on the 40th floor?”</p><br/><p>“Kuk!”</p><br/><p>I knew he would make fun of me! But why was he here? I gave him an inquisitive glance. At the same time, I noticed someone next to him. It was a cute girl with cat ears on her head, who was shaking her long tail slowly. It was Lokanyan.</p><br/><p>“Hello, nyan.”</p><br/><p>“Hello, Lokanyan!”</p><br/><p>“My name isn’t Lokanyan, it’s Loka, nyan!”</p><br/><p>“I see, Lokanyan.”</p><br/><p>“Kyaaaaa!”</p><br/><p>After making fun of Lokanyan, I turned my attention to Lin. Just like always, he had a cigarette in his mouth.</p><br/><p>“Thanks to your vitality hitting zero, I became free for a weak, so I’m enjoying my sweet vacation.”</p><br/><p>“I see. Well, you must be tired from making all that equipment for me. Thanks again, Lin.”</p><br/><p>“You really hate losing, don’t you…!?”</p><br/><p>“Lin nyan, Loka nyan made cookies, nyan. Eat some, nyan! Everyone liked it, nyan!”</p><br/><p>As Lin’s hand holding his cigarette shook, Lokanyan pushed a plate in front of him, which had cookie-like things piled on top of it. Were they items? I mean, they looked just like poison items!</p><br/><p>“Ah, I was wondering where everyone went… Loka, you sent them away, I see.”</p><br/><p>“That’s rude, nyan! Everyone shook because it was so delicious, nyan! Everyone said they’d bring them home to eat them, nyan!”</p><br/><p>“There’s this much left after that…? Damn, they should’ve taken a bit more for me…!”</p><br/><p>“Don’t say that, nyan! Try them, nyan! I put in lots of love for Lin, nyan!”</p><br/><p>“I don’t need them… Ah, I know.”</p><br/><p>“Alright, Lin, have a nice day. Lokanyan, I’m cheering for you!”</p><br/><p>“Hey, wait! Kang Shin!”</p><br/><p>“Oooh! You’re a good guy, nyan! Goodbye, nyan!”</p><br/><p>I had no intention of trying out cookies that would make even a draconian tremble in fear. Putting an end to Lin’s attempt to get me to try those cookies, I wished him luck and headed to Loretta. I ignored Lin’s scream that I vaguely heard behind me and spat on the ground. A girl was trying to give him handmade cookies! It was a situation straight out of a manhwa. Not to mention, the girl was a cat-eared beauty that embodied the word ‘cute!’</p><br/><p>I hoped he would eat them and explode.</p><br/><p>When Loretta first saw me, she welcomed me as she flapped her long ears. However, her ears drooped more and more as I explained the reason I was here.</p><br/><p>“You want to learn a sword technique? To slice monsters for sashimi?”</p><br/><p>My long and sad tale that no one could listen to without crying was cut off in the middle by Loretta. Then, she looked at me like she was looking at an idiot.</p><br/><p>“You’re an idiot.”</p><br/><p>She said it!</p><br/><p>“Why don’t you make a hand knife and imbue mana into it?”</p><br/><p>“I don’t have the confidence to control it carefully. Not to mention, it’s illogical to fillet a fish with your hand.”</p><br/><p>“Why can’t you put mana into your spear?”</p><br/><p>“I’m trying to hide the fact that I use spears.”</p><br/><p>“You’re okay revealing that you can suddenly use swords?”</p><br/><p>“I’m just learning it today, so it shouldn’t matter.”</p><br/><p>“There’s a better method than that sweaty and brutish method, Shin-nim.”</p><br/><p>When I heard Loretta’s words, I became slightly uneasy. Sure enough, she took out a glowing blue kitchen knife from her pocket.</p><br/><p>“A kitchen knife forged by a master craftsman, able to slice all food ingredients, even if they are monsters, without having to know even the basic of sword techniques! Its name is ‘All Crusher!’”</p><br/><p>“It’s not allowed to crush everything!”</p><br/><p>“If you buy it now, I’ll throw in ‘Burnt to White Ashes,’ a magical pot that can heat all food ingredients to the perfect temperature!”</p><br/><p>“Both the kitchen knife and the pot have weird names… Also, it’s not allowed to burn things to white ashes!”</p><br/><p>“Don’t be surprised, there’s more! ‘Drug,’ a magical seasoning that can sublimate the taste of any food with just a single sprinkle! If you eat it once, you might get addicted and never be able to escape it!”</p><br/><p>“Drug? Is that a narcotic? It isn’t, right?”</p><br/><p>“This mind-blowing combination of items is only 99,900 gold! They’re only 99,900 gold!”</p><br/><p>“Just say 100,000 gold.”</p><br/><p>“From my heart for Shin-nim, the 100 gold is… a service!”</p><br/><p>Seeing Loretta make a heart with her two hands, I really considered flicking her forehead, but held myself back. Instead, I took out 100,000 gold and gave it to her.</p><br/><p>“No, I just need 99,900 gold.”</p><br/><p>“Then I’ll give 100 gold more as a service from my heart for Loretta.”</p><br/><p>“O-Oh.”</p><br/><p>Loretta’s ears flapped wildly. I only gave back the gold she discounted, but she was incredibly happy. This elf really liked money. Then, Loretta spoke as she gave me the items with a blooming smile.</p><br/><p>“Okay, I’ll serve you some tea, so stay for a while. Huhu, Shin-nim is quite skilled at bargaining.”</p><br/><p>“Hm? Ah, tea time with Loretta is good too, but there’s something I want to ask.”</p><br/><p>I put the kitchen knife, pot, and seasoning into my inventory, and tried to make a serious expression to explain what had happened today. That I had met another explorer as an enemy and that he was currently restrained.</p><br/><p>Although Walker had agreed to betray Brightman, I had just beat him up severely, and it wasn’t so easy to trust Walker, who had spent his entire life under Brightman’s orders. I needed a way to ensure he wouldn’t change his mind.</p><br/><p>After listening to my story, Loretta made a thinking ‘hmmm,’ then rummaged through her pocket with a small exclamation.</p><br/><p>“Something perfect for Shin-nim is right… here. Soul Contract.”</p><br/><p>It had a very dangerous sounding name.</p><br/><p>“Let’s see, since you’ve made more than two achievements, you can buy this too. It’s pretty easy to use. You write the content both sides of the contract should keep with your blood. It doesn’t matter what language you write it in. After that, say that you’ll form a soul contract, and the contract will activate.”</p><br/><p>“That’s it? It’s that simple?”</p><br/><p>“Ah, if either person violates the contract, the other person will take his soul, so be careful.”</p><br/><p>“This is a really dangerous contract!”</p><br/><p>“But you need something like this, right?”</p><br/><p>Loretta rolled the Soul Contract and gave it to me.</p><br/><p>“It’s 1,000,000 gold, but since no one’s bought it for 500 years, I’ll give it to you for 500,000 gold. That’s the manufacture cost.”</p><br/><p>“A 50% discount, wow. It’s still expensive though… Alright, here.”</p><br/><p>Dullahan gave me 100,000 gold each time I defeated him, and as I had defeated him over 80 times, I wasn’t short on money. Even with the price I paid for Party Member Scarecrows, Floor Master Battle Vouchers, potions, equipment repair costs, and the equipment crafting cost I paid to Lin, I still had about 7,000,000 gold left. That is, I could spare 500,000 gold with only a light burden.</p><br/><p>“Thanks for your purchase, customer!”</p><br/><p>“Thanks, Loretta. I knew coming to you was a good idea.”</p><br/><p>“I, I’m… glad to be of help. I-If you there’s anything troubling you, you can always look for me! As long as you pay for it, I can even make something I don’t have!”</p><br/><p>“No, I’ll try to get Lin to take care of most of my needs. I’m here because my vitality hit zero. I did meet Lin, but I couldn’t bother him during his date.”</p><br/><p>“… So you won’t come over anymore?”</p><br/><p>Loretta’s ears drooped down. It was cute in a way, so I wanted to keep watching her, but Loretta’s depressed appearance startled me, and I was making an excuse before I noticed it.</p><br/><p>“N-No! I meant I won’t visit Loretta only when I have something I need. I’ll come over often, as long as it doesn’t bother Loretta.”</p><br/><p>“It doesn’t bother me at all. In fact, I’m almost bored to death! So please come over a lot!”</p><br/><p>No, if you’re that bored, do work… Aren’t you the guild master…?</p><br/><p>*</p><br/><p>When I came back after some tea, Walker was crawling on the ground with his body and mouth wrapped in boxing tape.</p><br/><p>“Walker, caterpillar suits you well too…”</p><br/><p>“Mmmm!”</p><br/><p>“His talking annoyed me, so I shut him up.”</p><br/><p>Hwaya was glaring at Walker with a reddened face. I first took the boxing tape off of Walker’s mouth. Puha! He coughed out a mouthful of breath and complained.</p><br/><p>“Damn it, I was only curious if Mastiford and you- kuaaak!”</p><br/><p>“Walker, are you perhaps just stupid?”</p><br/><p>Walker became a burning caterpillar and was wriggling violently, but I decided to leave him be until Hwaya calmed down. When Walker was letting out a slightly smoked smell, I showed him the contract.</p><br/><p>“Alright, let’s organize the content of the contract between us.”</p><br/><p>“You really are thorough. You even prepared something like this… What meaning is there to a contract? Don’t tell me you think you could restrain me with the law?”</p><br/><p>“No, and I’m not trying to restrain you. This is a Soul Contract, just something that gives me your soul if you break the contract. Don’t worry about it too much.”</p><br/><p>“How can I not worry about it!? I’d rather be restrained by the law!”</p><br/><p>“But you have no choice!”</p><br/><p>“Damn it, no! I’m not doing it!”</p><br/><p>“What, so you were planning on breaking your promise…?”</p><br/><p>Hwaya spoke with a low voice and made a flame in her hand. A white flame. It was an incredibly hot flame. Walker seemed to have noticed how dangerous it was, as he swallowed his saliva. Then he silently pulled the contract toward him.</p><br/><p>Clause one. Edward Walker (it was his real name) will not be able to directly or indirectly harm Hwaya Eleni Mastiford or Kang Shin, and this applies to their family, relatives, and friends.</p><br/><p>“Well, of course, but I’m a bit worried just what ‘direct’ and ‘indirect’ encompasses.”</p><br/><p>“Simply put, you’re not allowed to curse. Also, if you try to peek on me again, your soul might go flying from the mental stress I might take.”</p><br/><p>“I won’t do it!”</p><br/><p>Clause two. Kang Shin will safely take Edward Walker to Korea, and help him live a free life given that he does not violate the first clause.</p><br/><p>“But what’s your plan? It won’t be easy to avoid Brightman’s eyes.”</p><br/><p>“Don’t worry, I have my ways.”</p><br/><p>Clause three. Edward Walker will carry out the following missions in exchange for not revealing his perverted actions publicly and privately.</p><br/><p>First. Destroy all information about Hwaya Eleni Mastiford in Brightman’s possession, and use his ability as a dungeon explorer to assist her to the greatest extent possible. Also, before Hwaya Eleni Mastiford gives her permission, do not appoint anyone as a dungeon explorer.</p><br/><p>Second. Guard Kang Shin’s younger sister, Kang Yua, perfectly.</p><br/><p>“What’s this?”</p><br/><p>“It’s exactly what it says. Brightman that bastard has a picture of me taking a ba, bath… I hate it! Get rid of it all! Also, when I make my dungeon explorer organization later, you have to help. I’ll need your authority to appoint a dungeon explorer then too… That’s my condition.”</p><br/><p>“No, I expected the first mission… Yeon Hwawoo, or rather, Kang Shin. What do you mean guarding your younger sister?”</p><br/><p>“What are you talking about? I’m only accepting you to our side because of it.”</p><br/><p>I said as I glared at Walker.</p><br/><p>“You see, my young sister is dangerously cute. Although I installed some safety devices, we live in a dangerous world. When something happens to my young sister and she’s in trouble, I need someone to protect her until I get there. Your stealth ability and physical ability is perfect for a guard!”</p><br/><p>“You… just for something like that…”</p><br/><p>“Something like that?”</p><br/><p>The fist I raised up flickered with lightning. Should I kill this bastard? Hwaya sighed and stopped me.</p><br/><p>“You only need to guard Shin’s younger sister from morning to afternoon, so you’ll be free after that. You can be in the dungeon or whatever then. What dungeon did you say you were from again?”</p><br/><p>“The Third Dungeon… damn it, my daily life is going to be completely gone.”</p><br/><p>“Ah, you’re so noisy! You’ll be free on the weekends! Just think of it as a job!”</p><br/><p>“Kuk, a job of secretly guarding some young chick… I’d rather stay in the dungeon for the rest of my life.”</p><br/><p>“Shin, don’t kill him.”</p><br/><p>I was already punching Walker’s face, but thankfully, he didn’t die.</p><br/><p>“Hmph, you’ll understand when you see my sister. In fact, you’ll be thankful that I gave you the opportunity to guard such a pretty and cute reincarnation of an archangel.”</p><br/><p>“Kuuk… She’s that pretty?”</p><br/><p>“If you lay a single finger on her, you’re dead. I’ll rip you to shreds and burn you to cinders. I’ll bring you back to life, kill you again, find you in hell, and turn you into powder.”</p><br/><p>“I-It’s in the contract! I know even if you don’t threaten me!”</p><br/><p>Clause four. When requested by Hwaya Eleni Mastiford or Kang Shin, Edward Walker will participate in Event Raids and Event Dungeons. This clause takes priority over the second and third clause.</p><br/><p>“That’s it.”</p><br/><p>“You sure ask a lot of me…”</p><br/><p>“You don’t like it? Want me to give you a salary too?”</p><br/><p>“I don’t need it. I don’t need you bossing me around even more.”</p><br/><p>“Alright then, repeat after me. I form a soul contract.”</p><br/><p>“Huu…. Damn it. I form a soul contract.”</p><br/><p>The moment we made our announcements, the Soul Contract floated up into the air and burned splendidly. Walker felt pain immediately afterwards and rolled on the ground.</p><br/><p>“Kuuuuuuak!”</p><br/><p>“Ah, maybe you can’t curse us inwardly either. I heard your heart starts to hurt when the contract is about to be breached. If you continue, your soul will fly out, so be careful.”</p><br/><p>“Take it back, damn it, take it back! Kuaaaaaak!”</p><br/><p>I wasn’t sure how long it would take for Walker to calm down, but it was none of my business. After finishing my business with him, I got up from my seat with a refreshed mind. Hwaya looked up at me with curious eyes.</p><br/><p>“Where are you going? After dealing with Walker and even going to the dungeon to get items, we didn’t even have time to eat dinner yet.”</p><br/><p>“Huu, Hwaya, there’s something I have to do. Something really important that I have to do right now.”</p><br/><p>“I don’t know what it is… but do you need help?”</p><br/><p>“No, it’s something I have to do myself. Alright… I’m off then. I might be late, so you can eat first.”</p><br/><p>“O-Okay. Good luck…?”</p><br/><p>Even as she waved me goodbye, Hwaya tilted her head curiously. I left her lodgings. The town and lake were both completely dark. There was no one in sight, and far in the lake, a melting tuna was breaching over the water…! Checking again that no one was around, I equipped my Crimson Dragon Scale Armor. In my hand was the All Crusher.</p><br/><p>“Melting tuna sashimi… Wait for me, I’m coming!”</p><br/><p>The next morning, there was a report of a strange monster running above the lake waters (borrowing Ruyue’s power), screaming to attract monsters (Provoke), and calling down storms to slaughter them (Elemental Tempest). Thankfully, they hadn’t seen me slice the melting tuna for sashimi…!</p><br/><p>Author’s Notes:</p><br/><p>Can that be called freedom…? (Author’s thinking)</p><br/><p>Walker has joined the party with Soul Contract! Bambadabam! You obtained a good assassin to put to work!</p><br/><p>PS – 1. The hard-to-describe cookies: ‘Nyaruko: Crawling With Love’ reference</p><br/><p>2. The pot’s name ‘Burnt to White Ashes’: Referenced from Ashita no Joe’s famous scene</p><br/>\n</div>"}