{"title": "Chapter 108. Requirements of a Dimensional Mercenary (1)", "id": 108, "volume": 2, "url": "http://boxnovel.org/infinite-competitive-dungeon-society-chapter-108-requirements-of-a-dimensional-mercenary-1", "volume_title": "Volume 2", "body": "<h1>Chapter 108. Requirements of a Dimensional Mercenary (1)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 108. Requirements of a Dimensional Mercenary (1)</p><br/><p>I was right in trying to use the Giant Wolf to develop a battle strategy against giant monsters. Although the Giant Wolf’s movement patterns were almost too simple, he certainly had disaster level speed and strength. With its size, it had boundless life force, and I had to train my patience and holding my focus for dozens of minutes to fight against it. Although fighting the Giant Wolf could not give me a heart-pounding thrill, I shouldn’t just be seeking thrill in fights for my growth. I considered it a chance to steadily grow my abilities.</p><br/><p>Another ability I have to improve was my communication with Ruyue. I had to strengthen my bond with her by being more intimate. Although Peika complained that I only materialized Ruyue and was more intimate with her, I couldn’t help it as Peika was much stronger when she was infused into my spear with Spirit Aura than when she was materialized. To make it up to her, when I was training and not having a real battle, I had Peika materialized. Calling the elementals, materializing them, and making contact with them more often to increase our closeness were the easiest way of letting them grow.</p><br/><p>[Shin! I love Shin!]</p><br/><p>[That’s enough! You’re always sticking close to Master. You need to learn to share from time to time!]</p><br/><p>Ruyue stuck to me excessively, and although Peika tried to stop Ruyue, Peika wasn’t too different from Ruyue. Since how much the elementals liked me would only help their growth, I simply made a bitter smile and hugged them both, but I did find it a bit strange. They liked me more than what my Elementalist skill levels would suggest… Though, I knew emotions couldn’t be reflected by skill levels. I also couldn’t understand why Ruyue, who I only met recently, seemed to like me more than Peika. Perhaps it was because of the circumstances of how we met.</p><br/><p>Coming back to the subject of the Giant Wolf, his unexpected partial gigantification attack was undoubtedly dangerous. Although I didn’t feel threatened due to my excellent senses, ordinary explorers without sufficient detection abilities would find the attack fatal.</p><br/><p>Even in the boss fight I had with explorers who were stuck on the 45th floor, two explorers died from the gigantification attack even though they were on their guard. The other explorers who survived also thought it was strange how I could dodge the Giant Wolf’s attack so perfectly. Because it was frustrating, I tried to explain simply.</p><br/><p>“There are signs. You can see how his muscles move, right? When muscles that have nothing to do with his current movement suddenly expand, you know that part will gigantify. Easy, right?”</p><br/><p>“Crown Prince sucks.”</p><br/><p>“Damn it, I want to kill him.”</p><br/><p>I had gotten haters for the first time. Damn, they hated me even though I explained so simply…!</p><br/><p>In truth, I wasn’t really looking forward to the strengthening elixir that the Giant Wolf would drop. Strengthening elixirs raised two stats up to 10 times, totaling 12 points into each stat, equivalent to about 5 levels worth of stat points. Skin Strengthening Elixirs and Soul Strengthening Elixirs both increased my charm stat, which didn’t have much impact in direct fights. However, I recently found out that the charm stat played an important role, so I wasn’t that dissatisfied about it increasing. I suspected that the Giant Wolf’s strengthening elixir would be something similar.</p><br/><p>However, I was surprised by a completely unexpected outcome. Even the elixir’s name was different.</p><br/><p>[1. Wolf’s Tattoo Invigoration Elixir]</p><br/><p>The moment I saw it, I smacked my knees. Tattoo Invigoration Elixir! It wasn’t worth anything to people who couldn’t defeat the Giant Wolf alone! It was absurd. I felt strongly that the dungeon was changing the higher I went.</p><br/><p>The dungeon was expecting something from the explorers and encouraged them to perform certain actions. Was I meeting its expectations? I felt happy every time I was assured that the path I was walking on was the correct one, but I also felt bad that I was playing in the hands of someone I didn’t know. If I could attach a name to that someone, it would be the ‘Lord’ that members of the Fairy Garden talked about. Would he know everything about this dungeon? Will I be able to meet him one day? Of course, I didn’t have any answers now.</p><br/><p>In any case, since the secret reward was the Giant Wolf’s Tattoo, it seemed the normal solo reward was just the Wolf’s Tattoo. I felt a sense of pride, then shame from doing so as I ate the elixir.</p><br/><p>[Your Giant Wolf’s Tattoo becomes more invigorated. Your speed increases by 0.5% and dexterity increases by 1. Additionally, since you have the Giant Wolf’s Tattoo, your speed increases by 0.5% and dexterity by 1.]</p><br/><p>I wish it didn’t use another sentence to say the same thing. It could have just said my speed increased by 1% and dexterity by 2. It seemed the ordinary Wolf’s Tattoo only increased speed 0.5% and dexterity by 1. Thus Tattoo Invigoration Elixir could only have its full effect on me.</p><br/><p>I despaired slightly at the fact that my speed increased by another 1%, when I had just gotten used to the 15% boost. Feeling that I would be fighting myself for a while, I sighed. My premonition came true, as every time I got used to the speed increase the Tattoo Invigoration Elixir gave me, eating dozens of Tattoo Invigoration Elixirs in the process, the elixir gave another 1% increase. Not to mention, the light the tattoo gave off increased every time to the point it stuck out like a sore thumb if I didn’t cover it with my pants. Although it was fine during the winter, it seemed I wouldn’t be able to wear shorts during the summer. Though, my body’s temperature no longer fluctuated because of the length of my pants.</p><br/><p>One month had passed since then. March was right around the corner, and I had to go back to school for the second semester. As I made the extreme decision of taking four online classes, I only had to go to school for four days! Heh, being a college student was really only to disguise my real identity. What was important to me was not at the college. Ye-Eun, I chose to abandon my grades!</p><br/><p>During that time, the Field Dungeons were taken care of one by one, and only America and Japan were having trouble with theirs. Japan seemed to have made some progress, but Antelope Valley’s Field Dungeon, Wyvern’s Nest, was expanding its territory, just like people feared. The U.S. government gave up several benefits and requested every country for help. As ability users were now the greatest resources a country could possess, it was doubtful that any of them would accept their request so easily. Of course, a country didn’t function with only ability users, and some countries had negotiated to send their SS rankers with the condition that they escape when a dangerous situation occurred.</p><br/><p>If the matter with Brightman had not happened, Britain with their two SS rankers would have been able to trade with America more easily, but because they covered for Brightman’s indiscretions, they had completely lost Hwaya’s trust and were most likely panicking, trying to regain her assistance. It served them right.</p><br/><p>That aside, I did want to try hunting wyverns… Since I had several escape tools in my arsenal, I thought about going there someday.</p><br/><p>In any case, no matter how much everyone was having trouble with the Field Dungeons, I was focusing on the 45th Floor Master, Giant Wolf. Today was the day the grind would end.</p><br/><p>[Krrrruuuaang!]</p><br/><p>“Crown Prince-nim, be careful!”</p><br/><p>“This much is nothing!”</p><br/><p>The Giant Wolf could gigantify any part of his body. When it gigantified just a single claw and sent it flying, I was almost shocked to death. Today, it even gigantified its head and tried to swallow me whole. As Ruyue had leapt right in front of him, she couldn’t evade the attack unless she could freely fly.</p><br/><p>Without a shred of hesitation, I leapt up on Ruyue’s back and dematerialized Ruyue. The Giant Wolf’s mouth chomped down on the area Ruyue and I had been in, and I landed on the Giant Wolf’s nose bridge. After gigantification, its eyes were bigger than my own body. Being stared down by his eyes sent a chill down my back, but I used Ruyue’s power to fix my feet onto the nose bridge and grinned.</p><br/><p>Ruyue’s power froze my boots completely and prevented me from falling off the Giant Wolf no matter how much he shook his head. That said, staying like this would get dizzy, so I had to end it fast!</p><br/><p>“It’s time for firework! Uaaaaak!”</p><br/><p>[You used Crimson Roar. Everything blazes as flames.]</p><br/><p>In an instant, everything within my sight became flames and burned violently. Even knowing that the flames would not hurt me, I could not help but close my eyes shut. Naturally, attacked by the large flames directly, the Giant Wolf’s two eyes also received irrecoverable damage, burning completely.</p><br/><p>“Uwah, I heard about it already, but it really is a vicious skill!”</p><br/><p>“The barrier is going to get broken through! Reinforce it!”</p><br/><p>As I had already warned them, my party members had dug a hole for themselves in the distance and were hiding under a barrier. Even so, the flames were affecting them. Wasn’t that the army’s gas chamber training? With the rather useless thought, I raised my spear and aimed it at the Giant Wolf, who was in pain from having lost his eyes.</p><br/><p>“Alright, let’s end this!”</p><br/><p>[Kruaaaaang!]</p><br/><p>You can cry all you want! I won’t stop hitting you because of it!</p><br/><p>[You consumed Wolf’s Tattoo Invigoration Elixir to the limit. The Giant Wolf’s Tattoo has been invigorated to its peak. Your speed increases by 6%. You dexterity increases by 6.]</p><br/><p>[You learned the skill, ‘Gale Track,’ from invigorating the Giant Wolf’s Tattoo to its peak! It is a charge type skill, using extreme speed and seeking only destruction! When used, you will become super-armored for the duration, pushing away every in your path. Every time an enemy is pushed away, your attack power increases by 5% up to 100%. The skill’s power will increase with speed. If you have a riding skill, you can use it while riding. When attacking the enemy at your destination, wind attribute will be imbued to your weapon, amplifying its power. The charging speed and power will increase with skill level.]</p><br/><p>“Oh.”</p><br/><p>I was wondering where the charge skill was hiding, but to think it was in my tattoo! Plus, it even dealt a final blow after the reckless charge! It was just my taste. I waved my hand and sent my party members off, then went to report what happened to Loretta.</p><br/><p>“Really? Well, Shin-nim is the first one to obtain the Giant Wolf Tattoo, and I haven’t seen anyone other than Shin-nim consume Tattoo Invigoration Elixir to the limit… So, what was the skill that the Giant Wolf Set had?”</p><br/><p>“That’s…”</p><br/><p>At Loretta’s question, I could only make a strange smile. I was secretly hoping for Blood Howl, which converted all defense to attack power, but…</p><br/><p>[You equipped the Giant Wolf Set. Your dexterity and magic increase by 20. When the Giant Wolf Set is equipped, you can use ‘Gigantic’ once per day. Gigantic is a strong skill that enables you to enlarge and wield a body part, or weapon or equipment connected to your body. However, without the strength to wield the enlarged target, this skill may be catastrophic to you.]</p><br/><p>“You don’t have to make that face, Loretta. I already know.”</p><br/><p>“Ahaha, well not all Floor Master skill can be to your liking. Um… Do your best.”</p><br/><p>“Who knows, maybe a day will come when I will use this skill.”</p><br/><p>For reference, I tested it out by gigantifying my spear, but as it became dozens of meters long, I couldn’t even grab and swing it. Although my strength was enhanced by the elixirs I had eaten, I would need at least twice my current strength to wield it properly. Since I had received an unexpected gift from the tattoo, I would have to deal with the lackluster set equipment skill.</p><br/><p>“Then are you going to the 46th floor now? Before you go, play with me for a bit. Please?”</p><br/><p>“Loretta should be cheering on the warrior, not being spoiled by him … is what I want to say, but…”</p><br/><p>When I lengthened my words, Loretta’s eyes sparkled and she held my hands tightly.</p><br/><p>“You’ll play with me?”</p><br/><p>“School starts today.”</p><br/><p>“… Tsk.”</p><br/><p>Loretta’s eyes quickly lost their light. She clicked her tongue and let go of my hands. I laughed helplessly and left the dungeon. Since it was only the first lecture, I probably didn’t need to go, but I felt it was wrong to miss even a single day of lessons.</p><br/><p>But when I went down to the 1st floor, an unexpected sight entered my eyes. Mother was serving tea to Walker, who had his real face showing. Yua was also eating a toast with jam, getting ready to go to school.</p><br/><p>“Walker, why are you here?”</p><br/><p>“Your mother invited me. Your family really knows what manner is.”</p><br/><p>“That sounds like you’re saying I don’t have any manners.”</p><br/><p>“There’s a letter for you. I didn’t think you had any overseas friend other than Mastiford.”</p><br/><p>Huh? What? I tilted my head and accepted the letter from Walker. It was from America, and the sender’s name was also in English. Ciara Kenex…? On the other hand, the receiver’s name, Kang Shin, was properly written in Korean. I ripped open the envelope, and read the small, pink letter.</p><br/><p>This was the first line.</p><br/><p>‘Dear Earth’s Hero.’</p><br/><p>Author’s Note: N/A</p><br/>\n</div>"}