{"title": "Chapter 117. Avarice Devours Everything (4)", "id": 117, "volume": 2, "url": "http://boxnovel.org/infinite-competitive-dungeon-society-chapter-117-avarice-devours-everything-4", "volume_title": "Volume 2", "body": "<h1>Chapter 117. Avarice Devours Everything (4)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 117. Avarice Devours Everything (4)</p><br/><p>Among the members of the expedition, Ludia had the lowest level, and everyone else including me were explorers that were at least level 50. Other than the magicians, who had a low constitution stat, we had no problem going without sleep for a few days. As such, even though we stopped to rest and eat, we did not set aside time to sleep.</p><br/><p>Taking care of the chimeras that the demons had left behind, chasing them, resting, and chasing them again… After two days, Ludia didn’t look so well.</p><br/><p>“Ludia, are you okay?”</p><br/><p>We were currently taking a 2-hour rest. We were told that we would catch up to the Demon Army in just a day, so the Dimensional Mercenaries were relieving their fatigue in their own ways and preparing themselves for battle. As I wasn’t fatigued in the slightest, I worried about Ludia instead, who looked to be in a serious state.</p><br/><p>“I’m okay. It’s nothing compared to what Shina must be experiencing right now.”</p><br/><p>Ludia drank a Health Potion and replied with a frown.</p><br/><p>“Who knows what Shina is going through right now… I can’t complain with just this much.”</p><br/><p>“Let me see that.”</p><br/><p>“Ah!”</p><br/><p>I snatched the potion Ludia was holding, and her eyebrows shot up. She really was fierce when angry. However, Ludia soon made a curious expression watching what I was doing.</p><br/><p>“What are you doing?”</p><br/><p>“I’m making a potion slushy.”</p><br/><p>“Slushy…?”</p><br/><p>I froze the potion with Ruyue’s freezing energy, then shook it! With just that, I made a slushy in just a few seconds. When I gave it to Ludia, she tilted her head. After eating it, she exclaimed in surprise.</p><br/><p>“It’s cool and crunchy. It’s good!”</p><br/><p>“Right?”</p><br/><p>“Yeah!”</p><br/><p>While I was happy watching Ludia whose expression had gotten brighter, I heard a voice that I had grown familiar to in the past few days.</p><br/><p>“I’ll kill you…”</p><br/><p>“This stalker….”</p><br/><p>The violet-haired woman on her hoverboard glared at me like I had killed her parents. With a sigh, I spoke.</p><br/><p>“I told you not to come near Ludia.”</p><br/><p>“Ah, she’s one of the mercenaries…”</p><br/><p>Ludia noticed her too, bowing her head slightly to greet her. The woman started breathing roughly just from that. It was truly disgusting.</p><br/><p>“T-The disheveled priestess robe is… kuk, unbearable.”</p><br/><p>“If it’s unbearable, please go back to your planet and stop giving me goosebumps.”</p><br/><p>“I need to greet her too.”</p><br/><p>“Just go!”</p><br/><p>While I was arguing with her, Ludia’s voice became low for some reason.</p><br/><p>“Do you know her? Are you close? … Are you guys in a man-woman relationship?”</p><br/><p>“I’ve never seen her until I came here. Don’t say something so horrible.”</p><br/><p>“No! Why would I, with a man…!”</p><br/><p>The woman exclaimed in a loud voice, then sat upright on the hoverboard and beat her chest.</p><br/><p>“I’m Syrmia Bamirtuno. I’m Xenon realm’s first-class warrior.”</p><br/><p>“And she’s homosexual.”</p><br/><p>I added to her introduction, and Ludia instantly moved back. Syrmia Bamirtuno gave me a deathly glare.</p><br/><p>“I wanted to slowly let her know!”</p><br/><p>“Sorry, but I have no plans to give you my friend.”</p><br/><p>“I-I’m normal. I, I have a fiancé too!”</p><br/><p>“Fiance!? Who’s that? I’ll kill him!”</p><br/><p>At her words, Ludia’s cheeks reddened as she pointed at me. You’re using me as a shield? You coward! Pretending to be shy won’t work!</p><br/><p>Then, Syrmia Bamirtuno quietly took out a steel whip. I flinched for a second and took out my Gluttony Spear as well.</p><br/><p>“S-Shin? Are you really fighting?”</p><br/><p>“Ludia, duck.”</p><br/><p>“Duc…!?”</p><br/><p>The next moment, I embraced her and rolled on the ground. Boom! Above us, Bamirtuno’s whip had collided with something.</p><br/><p>“It’s an ambush! Everyone prepare for battle!”</p><br/><p>“Ho, you blocked that? You aren’t so bad!”</p><br/><p>Along with Bellode’s ringing voice, an unpleasant screeching voice also rang out. Holding Ludia with one arm, I retreated to where others were and raised my head. We had noticed their presence too late! We were already surrounded my demons. Not to mention, these guys… they were extremely strong!</p><br/><p>“Warm… This isn’t fair.”</p><br/><p>“Ludia, did you say something?”</p><br/><p>“No, nothing. I’m okay, so you can let me go now.”</p><br/><p>“Not yet. Even if you hate it, wait just a bit more.”</p><br/><p>“Stupid, I don’t hate it, so…!”</p><br/><p>“Protect her, newbie! If she gets even a scratch, I’ll kill you!”</p><br/><p>“Don’t look this way and fight, Bamirtuno!”</p><br/><p>There were 16 demons, but four times as many chimeras. While I was retreating with Ludia, a few of the magicians’ heads had already been severed. A few of the mercenaries had also used Return or ran to the dungeon. Damn it, they really cared for their safety the most!</p><br/><p>“Wyvern, burn them!”</p><br/><p>[Guaaaaaa!]</p><br/><p>“Fight! Magicians, calm down and chant your spells! Although they’re demons, we can kill them!”</p><br/><p>“You want to use magic in front of us? How cute!”</p><br/><p>The fight had become chaotic quickly. I sent the chimeras attacking us flying with Tempest and tried to ensure Ludia’s safety. Meanwhile, Bamirtuno was fighting the demon that had attacked us. The demon had a human-like appearance, dark blue skin, and a single horn shooting out of his forehead. His completely black eyes made me feel a natural aversion to him. However, this demon was strong, stronger than any of the ones that had attacked us.</p><br/><p>“You, you’re aiming for the princess!”</p><br/><p>“Was I? She’s the princess?”</p><br/><p>“Kuk!’</p><br/><p>He was using a whip like Bamirtuno, but his long and thin whip was clearly stronger than Bamirtuno’s steel whip. Bamirtuno shouted with tendons showing on her forehead.</p><br/><p>“Iron Rain!”</p><br/><p>Her whip disassembled and the lumps of steel shot toward the demon. The demon raised his whip, striking them down quickly, and laughed.</p><br/><p>“Hahaha, not bad! You didn’t learn whip technique, but were born with the power to wield steel!”</p><br/><p>You should have realized that earlier by seeing her hoverboard!</p><br/><p>I couldn’t watch their battle any longer. Although I was retreating deeper into our camp, more and more chimeras were approaching us.</p><br/><p>“The target is there.”</p><br/><p>“It’s not the man, but the woman he’s holding!”</p><br/><p>“Take her! If not, kill her!”</p><br/><p>Kuk! These damned bastards! With Ludia in my arm, I couldn’t fight freely.</p><br/><p>“Ludia, run to the dungeon for a bit! They’re aiming for you!”</p><br/><p>“I can’t run by myself while everyone is fighting!”</p><br/><p>“I’ll call you when the fight is over, so go to the dungeon! You’re in the way!”</p><br/><p>“The target is trying to run to the dungeon!”</p><br/><p>“Stop her! Sever her limbs!”</p><br/><p>Ugh, these god damned bastards! You want to cut off her limbs to stop her from going to the dungeon!? Even I only broke them!</p><br/><p>“Ruyue!”</p><br/><p>[Kuaaaaaang!]</p><br/><p>In an instant, everything in sight became dyed in white. Ruyue made an ice wall completely protecting Ludia and me.</p><br/><p>“It won’t last long. Hurry and go to the dungeon!’</p><br/><p>“Uuuut!”</p><br/><p>“I told you, I’ll call you when the fight is over, so please.”</p><br/><p>“You…!”</p><br/><p>“Also, Ludia. When you’re back, only trust my words.”</p><br/><p>“What?”</p><br/><p>Hearing cracking sounds from the chimeras trying to break in, I let Ludia go. Then, I gripped my spear tightly and told her.</p><br/><p>“I’ve been thinking that it was strange that they’re specifically picking our rest periods to attack. Something doesn’t feel right. They know about us too well. There’s most likely a spy.”</p><br/><p>“O-Okay… Don’t let me wait too long… Don’t die. If you think you will, you have to run.”</p><br/><p>Ludia raised her arms and opened the door to the dungeon. With a smile, I nodded my head, watching her leave.</p><br/><p>Immediately afterwards, the ice wall shattered.</p><br/><p>“The target escaped!”</p><br/><p>“Take hostages! That man is in a relationship with the target!”</p><br/><p>Hey, you guys have something wrong! Confirming the sheer number of chimeras charging toward me, I hurriedly materialized Ruyue and jumped on her back. Then, I put a highest-grade Mana Potion (30,000 gold each) in my mouth.</p><br/><p>“Come at me!”</p><br/><p>[You used Provoke! Enemies from all sides attack you with hostility!]</p><br/><p>“Where are all the mercenaries!? You guys need work harder!’</p><br/><p>“We don’t have time to deal with small fries like the chimeras, rookie!”</p><br/><p>“These damned demons! They’re so strong!”</p><br/><p>I realized that the mercenaries were fighting the demons. The knights had finally arranged themselves in a formation. As for the magicians, half of them had already died. Damn, they really should have put some points into their constitution…!</p><br/><p>“Gale Track!”</p><br/><p>[Dodge!]</p><br/><p>[Don’t get it by that, run!]</p><br/><p>“Like I’d let you! Get over here!”</p><br/><p>Now that they were affected by the Provoke skill, only the tip of my spear awaited them! I stabbed and slashed the chimeras without hesitation. After sending several chimeras flying with the final blow, I could finally secure a clear view.</p><br/><p>[Low-ranked Gale Track became level 7! The AoE (Area of Effect) of the skill has increased, letting you damage enemies not in your path!]</p><br/><p>“This is…”</p><br/><p>Many demons were dead, as were most of the chimeras. Only half of the knights remained. If the ones that ambushed us were elites within the Demon Army, then after winning this battle, it wouldn’t be impossible to complete the request successfully.</p><br/><p>However, most of the Dimensional Mercenaries had already run away. In other words, they had decided that the mission would not be successful. Of course, they must have realized that there was a spy in our midst. If there were enemies on the inside, the difficulty would shoot up.</p><br/><p>Even so, it might be possible if the Dimensional Mercenaries worked together, but to think they’d give up so easily… Although there were around six mercenaries still fighting the demons, looking at their ugly complexions, it seemed they would give up soon.</p><br/><p>Then, something rolled toward my feet. Looking at it, my eyes opened wide.</p><br/><p>It was Syrmia Bamirtuno’s head.</p><br/><p>“That was a fun fight. So, will you let me enjoy more, ‘Earth’s Hero?’”</p><br/><p>When I raised my head, I caught sight of the demon that was fighting Bamirtuno. The blood on his whip was extremely clear and fresh.</p><br/><p>“Probably not. I’m strong, you see… Haat!”</p><br/><p>Heroic Strike together with Divine Speed. The Heroic Strike I was using for the first time since I came here was blocked by the demon. Although it busted his hand, it healed up in an instant. What was that regeneration? Don’t tell me he could continue regenerating forever?</p><br/><p>“Hero, is this the first time you’ve seen rapid regeneration? What’s with that surprised face?”</p><br/><p>“I quietly thrust my spear at him. Although I used Divine Speed again, he blocked it. This time, his entire arm blew up, but he easily regenerated it.</p><br/><p>But seeing him protect his heart, it meant his regenerative ability would not work easily if his heart was blown up. That said, it didn’t mean anything if I could not pierce his heart even with Divine Speed!</p><br/><p>“I can see your trajectory. If you’re just stabbing in a straight line, I can block your attack the moment I grasp your trajectory, regardless of your speed. Hero, you’re quite weak, aren’t you? Even weaker than that steel bitch.”</p><br/><p>He threw Bamirtuno’s body at me. Startled, I received her body and fell back, setting it down carefully. Then, I asked.</p><br/><p>“I didn’t show any evidence of being a Hero after I arrived here. How did you know?”</p><br/><p>“Is that so? Didn’t all the knights know?”</p><br/><p>“So it’s as I thought.”</p><br/><p>Although I already knew, I was now certain. Who was it? Who was the spy? I didn’t know. What was important now was to survive.</p><br/><p>“Who are you?”</p><br/><p>“How nice of you to ask. I’m His Highness Demon Lord’s right arm, the Demon Army’s Commander Shatuno.”</p><br/><p>“So you mean you’re currently the strongest in the Demon Army.”</p><br/><p>“Indeed.”</p><br/><p>Although I couldn’t trust him, it was probably true. There was no reason for him to lie, and it made sense for the strongest demons to attack us if they wanted to prevent us from reaching the Demon Lord. It also made sense why the strong Dimensional Mercenaries couldn’t defeat the demons so easily.</p><br/><p>In that case…</p><br/><p>“I wanted to save it… but there’s no other choice.”</p><br/><p>“Hm?”</p><br/><p>“Deific Manifestation!”</p><br/><p>If I wasn’t strong enough, I would leave it to master to teach me!</p><br/><p>Author’s note: N/A</p><br/>\n</div>"}