{"title": "Chapter 118. Avarice Devours Everything (5)", "id": 118, "volume": 2, "url": "http://boxnovel.org/infinite-competitive-dungeon-society-chapter-118-avarice-devours-everything-5", "volume_title": "Volume 2", "body": "<h1>Chapter 118. Avarice Devours Everything (5)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 118. Avarice Devours Everything (5)</p><br/><p>The change was dramatic. I felt someone else’s presence in my head and my body felt like it was floating up slowly. In the next moment, I gave the right to control my body to someone else and entered spectator mode.</p><br/><p>Unfortunately, Peruta did not have the ability to wield elementals, so they were unsummoned. Peruta couldn’t use my class or subclass-specific skills, nor could he use Heroic Strike. He could use skills other than them.</p><br/><p>[All of your MP has been used.]</p><br/><p>[Half of your HP has been used.]</p><br/><p>[Using 18,790 MP and 12,545 HP, you manifest the Mythological Heroic Spirit, ‘Peruta Rello Vatifoa,’ for 26 minutes and 57 seconds.]</p><br/><p>“It hasn’t been 29 days. Plus, this environment…”</p><br/><p>[Peruta, I’ll leave it to you. I can’t handle them with my strength.]</p><br/><p>Peruta looked around. He confirmed the single-horned demon and the bladed whip in his hand. Then, he examined his body and grinned.</p><br/><p>“This isn’t Earth… Plus, you’ve grown a lot in such a short amount of time. That’s good.”</p><br/><p>Shatuno seemed to have realized something had changed from Peruta’s murmuring, as he pointed his whip at him.</p><br/><p>“The smell of your mana is different. Who are you?”</p><br/><p>“Demon. There were once demons in Edias, too… Words aren’t important in a life-or-death battle… Are you ready?”</p><br/><p>Without using Divine Speed, Peruta charged at Shatuno with an incredible speed. His whip hastily blocked Peruta’s spear, but it could not withstand the impact and flew back.</p><br/><p>“You’re different from before!”</p><br/><p>“He will soon become as strong as me!”</p><br/><p>Peruta thrust the Gluttony Spear quickly. The blue maelstrom spiraling around his spear was undoubtedly from the Peruta Circuit that was circulating inside of him.</p><br/><p>So this is the Unique Spear Technique that lies beyond the high-rank Spear Technique! Even knowing that now wasn’t the appropriate situation, I became immersed in the overwhelming prestige that Peruta’s movements created. Not to mention, I even thought his Peruta Circuit was completely different than the one I had been using.</p><br/><p>“Kuhat, right! Now I feel like I’m fighting! Snake Touch!”</p><br/><p>“A weak attack like that won’t be enough!”</p><br/><p>Shatuno’s whip transformed in an instant, flying toward Peruta’s neck to bite it like a living snake. However, Peruta instantly pulled his feet back and vertically struck his spear down, hitting the whip away. The blue whirlwind endlessly spiraling around his spear shattered the snake’s head into pieces.</p><br/><p>“Dead Steam!”</p><br/><p>That was what Shatuno was aiming for. The shards of the whip inflated and exploded. The whip had been a one-time use weapon from the start. I felt bad about Bamirtuno who had lost her life from such a weapon.</p><br/><p>No matter how strong Peruta was, he was using my body. As such, he instantly imbued mana into his feet, then jumped back, creating a storm in his path. The explosion was undoubtedly</p><br/><p>grand and powerful, but it was easily erased by the storm Peruta created.</p><br/><p>At the same time, I was busy trying to understand the manifestation and transformation of mana. His attainment in spearmanship was undoubtedly higher than mine, but what was even more shocking was the way he wielded mana. I was confident that I could catch up to his spearmanship, but the natural application of mana on his spear techniques was something far beyond what I could see.</p><br/><p>From the use that did not match its level of attainment, I felt my Peruta Circuit creaking, but Peruta naturally softened it with his rotational power. It was truly shocking. In the next moment, he held Gluttony Spear up again. Peruta Circuit’s strong current was gathering mana, not just from the body, but from the world itself. A dazzling blue light enveloped the spear. It was as if I was looking at the completed version of Tempest, which only took 300 MP for me to use.</p><br/><p>“Try this!”</p><br/><p>“Huhu, as if!”</p><br/><p>Despite Peruta’s quick charge and spear attack, Shatuno took out a shield out of thin air and defended. However, after colliding and grinding against each other for a moment, the shield quickly gave in, being crushed and sent flying away. With a crack, Shatuno’s arm was also severed from his body. It was the perfect attack while Shatuno’s guard was down.</p><br/><p>“Kahak!”</p><br/><p>“You’re surprisingly weak. What military rank do you have? A private?”</p><br/><p>“Private? Ha… I’ll show you the power of a private!’</p><br/><p>Shatuno’s arm that had fallen to the ground flew up. In an instant, it inflated, becoming large and black, and its tip became hard. It had transformed to a strange weapon similar to a club. Shatuno grabbed the ‘weapon’ with his remaining hand. Why wasn’t he regenerating it? Was there a limit to his regenerative ability?</p><br/><p>Wounds from Peruta’s attacks could not be regenerated. Rather than his attainment in spearmanship, I had the feeling that there was a secret behind the power created from combining Peruta Circuit and his spearmanship. The desire to learn his techniques drove me crazy.</p><br/><p>“Devil Buster!”</p><br/><p>“Kuu, did you think of that name? How childish!”</p><br/><p>Perhaps because he had turned his arm into a weapon, it was moving on its own and it was powerful. After blocking his attack once with the Gluttony Spear, Peruta dodged his attack. His weapon struck down on the ground, and a part of the earth turned into metallic sludge and shot up.</p><br/><p>The metallic sludge let out a black miasma and attacked me. Peruta kicked the ground again and created another storm. He seemed quite surprised by the attack.</p><br/><p>[That weapon is dangerous. It will be fine for this weapon enveloped with my aura, but your body won’t be so lucky. If it hit you, you’ll turn into that metallic sludge.]</p><br/><p>[Can’t my armor block it?]</p><br/><p>[It can, but once or twice only.]</p><br/><p>Peruta looked nonchalant as he exchanged blows with Shatuno’s weapon, but he whispered in a worried voice that only I could hear. If Peruta allowed himself to get hit, I would receive an irrecoverable injury. Even though Peruta was hiding it, Shatuno seemed to have realized his hesitation, as he attacked more boldly and aggressively.</p><br/><p>“Stop running away!”</p><br/><p>Shatuno dodged the spear left and right and attacked my body with his weapon. Peruta read the trajectories of his attacks and struck them away with his spear imbued with his mana’s rotational power. While their exchange continued, Shatuno’s aura continued to grow bigger.</p><br/><p>The ground became like a furnace of metallic sludge, and the sludge occasionally attacked Peruta and annoyed him. Although Peruta was striking them down without much difficulty, it was hard to say that it would continue forever. If this continued, Peruta would be at a disadvantage.</p><br/><p>“What happened to your confidence!? Try harder, Hero!”</p><br/><p>“The Hero is my disciple, not me! I’ll express my respect for your strength, but I don’t want to deal with such dirty attacks much longer!”</p><br/><p>As I had the Regeneration skill on Flesh Golem’s Second Finger, I wasn’t so worried about losing parts of my body. Even so, I advised Peruta so he could utilize my body more easily.</p><br/><p>[Peruta, you can use Heavy Armor Mastery, Divine Speed, Dash, and Gale Track.]</p><br/><p>[I don’t care about the armor skill, but can you explain what the other skills do?]</p><br/><p>I gave an as detailed an explanation as possible for the skills. Shooting out a Tempest, Peruta distanced himself from Shatuno and nodded. Then, he boldly looked around the battlefield. Most of the demons were on the brinks of death, and the remaining mercenaries were working together. It was the same for the surviving knights and magicians.</p><br/><p>Peruta restarted the fight.</p><br/><p>“Here I go. Gale Track!”</p><br/><p>“You!”</p><br/><p>Peruta, who had been on the defense, charged at Shatuno. Dash, which let me run faster, was a passive skill and automatically applied to Gale Track. As Peruta also received my tattoo and equipment’s effects, Gluttony Spear was enveloped with a strong rotational force shook off the wave of metallic sludge shooting toward him and struck Shatuno upward.</p><br/><p>“Kuaaak!”</p><br/><p>Shatuno flew dozens of meters into the air! Although charge type skills were strengthened, sending a Demon Army Commander flying with a spear showed how powerful Peruta was. At the same time, a tornado connecting the earth and sky appeared, binding Shatuno completely. Of course, he wouldn’t stay bound for long!</p><br/><p>“Hey, wyvern! Hold him back for a bit!’</p><br/><p>“Ha, how arrogant, newbie!”</p><br/><p>Peruta ignored the wyvern-riding mercenary’s answer and shot toward the other demons. Gale Track did not have to be used in a straight line. Of course, it would be stronger and faster if it was used in a straight line, but using Peruta Circuit, Peruta changed the trajectory of Gale Track so naturally. In fact, Peruta Circuit’s rotational force was increasing Gale Track’s destructive force.</p><br/><p>“Kuk, it’s an ambush!”</p><br/><p>“Block him!”</p><br/><p>“Ek, what’s that!”</p><br/><p>The demons that were fighting the mercenaries became flustered at Peruta’s charge and tried to block him. However, Gale Track was slightly different than when I used it. Peruta Circuit’s rotational force swallowed Gale Track, and the boundless current of destruction gathered on the tip of Gluttony Spear, exploding out continuously. Simply put, the demons could not block Peruta’s power, which had even devoured Shatuna’s abilities. Since I was confident in beating them without Peruta’s help, it was easy for Peruta to do the same.</p><br/><p>The surviving demons thus began to float into the air one by one, each trapped in a tornado similar to the one Shatuno was in. Interestingly, they flew toward Shatuno, who was trying to break out of his own tornado, and smashed into him.</p><br/><p>Shatuno was ignoring the wyvern’s flames and was close to escaping the tornado. But when he collided with his allies, the tornadoes binding them combined into one, pushing them up even further into the air. As more and more demons collided, they were pushed further up into the air. It was like watching tornadoes combining to form a greater disaster.</p><br/><p>“What, is he really a newbie?”</p><br/><p>“Stupid, can’t you see the difference in the destructive force?”</p><br/><p>“It looks like he manifested someone into him. Was there a skill that could do that?”</p><br/><p>“That bastard! He took my prey!”</p><br/><p>“Don’t lie. I know you were contemplating about running away with Return.”</p><br/><p>“Lads, attack him while they’re grouped up!”</p><br/><p>After shooting all the enemies into the air, he encouraged the mercenaries, knights, and magicians with an expression like he just made a game-winning home run. Then, he bent his knees. Feeling the powerful current of wind gathering around Peruta, I trembled. This guys! He turned Gale Track into a completely different skill!</p><br/><p>“Whatever! Let’s attack!”</p><br/><p>“Rising Fire!”</p><br/><p>“Die demon bastards!”</p><br/><p>Dozens of auras and magic shot up from the ground. At their levels, even melee range explorers had at least one long-ranged attack. The wyvern’s owner seemed to have strengthened the wyvern with his power as it breathed out white flames like Hwaya’s. Consecutive explosions rang out in the air like fireworks.</p><br/><p>It was then that Peruta jumped.</p><br/><p>“Divine Speed”</p><br/><p>[Using 10% of your mana, your speed is multiplied by 1000% for 3 seconds!]</p><br/><p>I didn’t know how, but Peruta transferred the power of wind from Gale Track’s final blow underneath his feet, and used Peruta Circuit’s strong rotational force to let it explode. Immediately afterwards, he used Divine Speed to make himself faster, and the result was hard to described with words.</p><br/><p>“Huaaaaaaa!”</p><br/><p>My body shot up so quickly that I was surprised it was breaking from the shock. I felt like fainting from the sensation, but Peruta seemed fine and he even pulled his spear back. Kuk, I thought I wouldn’t lose to anyone in willpower, but to think I was about to faint from this much shock.</p><br/><p>Even while I was self-reflecting and gathering my focus, Peruta continued to shoot up and up.</p><br/><p>At the end of Peruta’s path were the demons that were gathered up helplessly. Shatuno, whose feet were tied from the the demons stuck to him, saw Peruta approaching him. Flashing his eyes, he swung his weapon. The other demons were in its trajectory.</p><br/><p>“Kuak!”</p><br/><p>“Sacrifice yourselves for the Demon Army’s future!’</p><br/><p>To think he’d sacrifice his subordinates in this situation. While Peruta opened his eyes widely, one of the demons turned to wet tar and swept over Peruta from the sky. This time, I was ready to lose one of my limbs. While I was preparing myself to use regeneration, Peruta revealed his final move.</p><br/><p>“Sacrificing your on subordinates! In front of the War God, there is no greater disrespect!”</p><br/><p>With a thunderous roar, Peruta shot his spear. The power that had pushed Peruta to the current height directly flowed to the tip of this spear and caused an explosion. Like shooting a shotgun, the explosion that happened on the spear tip annihilated the tar instantly and continued to the grouped up demons. Although the demons tried to squeeze out their magic and create barriers, they were unable to block Peruta’s power.</p><br/><p>A great explosion erupted.</p><br/><p>[Critical Hit!]</p><br/><p>[Demons should have bones right?]</p><br/><p>“Probably.”</p><br/><p>Exchanging rather stupid conversation with Peruta, we began to fall. Did Peruta know we would fall? He must have, right? Peruta then let me down with his murmur.</p><br/><p>“Shoot, I forgot how to get down.”</p><br/><p>[Peruta!?]</p><br/><p>“When I focus too much on battle, my blood rises… It’s been awhile since I’ve had a real fight, so I can’t help having a side-effect like this. But thanks to you, I enjoyed fighting. Now, I have no regrets.”</p><br/><p>[Don’t say it like I’m going to die, Peruta!]</p><br/><p>“I’m kidding, of course. Dying now would be troublesome. Don’t worry, we’ll land with only a single broken limb.”</p><br/><p>[So one limb is going to be broken for sure…]</p><br/><p>When I sighed, someone caught me from the air. The middle-aged mercenary’s wyvern had grabbed my head with its claws.</p><br/><p>“Newbie, I don’t know who possessed you, but well done. To be honest, that demon commander was the most dangerous.”</p><br/><p>“Well, thanks.”</p><br/><p>The wyvern descended quickly and safely put me down on the ground. The mercenaries and knights were gathered, healing their injuries.</p><br/><p>“Well done, newbie!”</p><br/><p>“That skill won’t continue forever, right?”</p><br/><p>“The feeling is already a bit different than before. It looks like he’s maintaining it with mana.”</p><br/><p>“Hey, if you have time to analyze newbie’s skill, heal my damned leg.”</p><br/><p>“Stop complaining. Oi, the paladin over there!”</p><br/><p>The mercenaries talked loudly, showing themselves off. As we could take care of the demons with their help, I could look at them happily. As the knights were all paladins under the Order of Mitarus, they were healing each other and the mercenaries.</p><br/><p>[We’ll have to call Ludia again.]</p><br/><p>“I don’t know who Ludia is, but you shouldn’t.”</p><br/><p>[Why?]</p><br/><p>“Isn’t it obvious? It’s not over yet.”</p><br/><p>Just when the battle seemed to be over, the atmosphere froze. Immediately afterwards, as if to prove that Peruta was right, a disturbing whish rang out from the sky.</p><br/><p>[Ku… To think I’d need to show my real body. I looked down on humans too much…!]</p><br/><p>We all turned to the direction of the voice. In the sky, we saw a winged, large-bodied, single-armed monster.</p><br/><p>[I’ll swallow you all! Be glad, you can become the blood and flesh of I, Commander Shatuno!]</p><br/><p>It was the start of the second battle.</p><br/><p>Author’s note:</p><br/><p>I wanted to end it in this chapter, but I couldn’t. As you can see, this chapter is 160% of the normal chapter length, so I really tried hard! But it wasn’t possible. I had to show the strength of a Demon Lord Commander and Peruta fight against him. Hope you enjoyed it! We’ll wrap it up in the next chapter and go attack the Demon Army!</p><br/><p>Translator’s note:</p><br/><p>160%... The next chapter is the same length as this one. KILL ME</p><br/>\n</div>"}