{"title": "Chapter 121. Avarice Devours Everything (8)", "id": 121, "volume": 2, "url": "http://boxnovel.org/infinite-competitive-dungeon-society-chapter-121-avarice-devours-everything-8", "volume_title": "Volume 2", "body": "<h1>Chapter 121. Avarice Devours Everything (8)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 121. Avarice Devours Everything (8)</p><br/><p>My cape’s effect, ambush defense, could not be used in Ludia’s appearance. Although I retained all my abilities, it did not include my equipment’s effects. As such, I could only let the sword stab into me helplessly.</p><br/><p>[You have been stabbed with the legendary weapon, Soul Sucker, crafted with the Demon Lord’s power. If you do not receive peak-grade treatment, you will soon be killed! All party members fall in ‘shameful obedience’ status effect. Orc Lord’s Warcry attempts to resist it. Without enough resistance left, it fails!]</p><br/><p>So Orc Lord’s Warcry could fail too!? The reason it didn’t have enough resistance had to be because it canceled all the petrification. Since the petrification was a status effect casted by the Demon Lord, it was understandable. In fact, it would have been more surprising if Orc Lord’s Warcry could have resisted the status effect again.</p><br/><p>“I didn’t think you would grit your teeth and come save me… But I’m happy I got to use this sword, unni.”</p><br/><p>“Cough.”</p><br/><p>“But still, I’m surprised. I thought you’d get caught before it became my turn. We planted quite a lot of spies among the knights, you see. Ah, by now, the Demon Army should have invaded the Imperial Palace too. The demons that usually only stay in the Demon Lord’s territory have been sent out, knowing that this is the best opportunity. Elite forces sent to save me. Without them, what would have happened to the Imperial Palace… to father and mother? I don’t think the ruler of an empire would run away to the dungeon, so do you think he got captured?”</p><br/><p>I coughed up blood. Excruciating pain swept over me. It was as if my soul was being sucked in by the sword. The party members tried to approach me, but I shook my head once and gave them a glance. It was the signal to execute the plan we made for the ‘what if’ we talked about. Bellode shook his head in pain, but the magician and the summoner were different. They immediately sprung into action. Although they seemed to be in pain from the status effect, the order I gave them was extremely simple.</p><br/><p>Thinking that victory was in her grasp, Shina continued.</p><br/><p>“What don’t you say something, unni? Like since when or why I went to the Demon Lord’s side. Or if the Demon Lord brainwashed me. Don’t you have a lot to say?”</p><br/><p>“What is it that you want?”</p><br/><p>Shina seemed to be surprised by my straightforward question. She curled one corner of her mouth up and responded.</p><br/><p>“It’s the seat next to the Demon Lord, unni. A seat where I can obtain everything in the world… He allowed me to be beside him. Of course, with one additional condition. The power of Kang Shin, the other world’s Hero. You know how greedy I am, right, unni? The Demon Lord took my offer of the power of another world’s Hero. He also saw me in high regard. You see, we suit each other rather well.”</p><br/><p>“So... because of your avarice, you cooperated with him in destroying the Ehuir Empire, killing me, and offering Shin to the Demon Lord? Leaving his own world to end?”</p><br/><p>“Yep. What, are you trying to contact him? Give up, unni. This sword’s power is amazing. The only thing unni is allowed to do is to curse at me to make the short time you have left worth it. You probably can’t open your inventory either.”</p><br/><p>It really didn’t open. I let her know that there were others with my eyes, but Shina was still full of leisure.</p><br/><p>“Didn’t I tell you, unni? This is a weapon imbued with the Demon Lord’s power. Everyone here is no longer allowed any freedom. At the very least, everything they could do as explorers has been sealed. Plus, the ones unni saved are also…!”</p><br/><p>Shina talked as she turned her head, and was shocked. Other than Bellode, who was gritting his teeth and closing his eyes, the summoner and the magician’s actions had shocked her.</p><br/><p>Seven explorers, who were tied so well that they couldn’t even open the door to the dungeon, had fallen from the wyvern’s back. Currently in free fall, they were screaming.</p><br/><p>“Kuaaaaaak!”</p><br/><p>“Y-Your Highness!”</p><br/><p>Since both their hands and feet were tied, they were fated to hit the ground without doing anything. Of course, they couldn’t escape to the dungeon.</p><br/><p>The moment I realized Shina was hit by the Demon Lord’s magic on purpose, the chances that other petrified explorers were also traitors became extremely high. The moment Shina’s words confirmed it, the party members had thrown them off the wyvern. Having to kill the people we came to save… It was a truly unpleasant feeling.</p><br/><p>“You guys!”</p><br/><p>“They’ll probably die.”</p><br/><p>At my short words, Shina gave a flustered look, but soon swept aside her bangs and sighed.</p><br/><p>“Hu… I don’t care what happens to them. They were only there to make it more believable that I was captured by the Demon Lord. What’s important is that you and the others can’t do anything to me.”</p><br/><p>She seemed to be telling the truth. Even after dropping the seven explorers, the summoner and the magician couldn’t approach me. It seemed like the sword in my stomach was preventing them somehow. If they forced themselves, they might be the ones to fall off the wyvern instead. It must be the ‘shameful obedience’ status effect they got when the sword stabbed through me. Just by attacking one person, the whole party was suppressed! I knew it was imbued with the Demon Lord’s power, but what was this weapon!? At that moment, while I was feeling my vitality reaching its limit, a message rang out in ear, surprising me.</p><br/><p>[Diehard activates. All injuries have been restored and your vitality is restored to 50% of its maximum.]</p><br/><p>[Soul Sucker’s power prevents healing! If you do not receive peak-grade holy recovery in the next 2 minutes, you will die!]</p><br/><p>Without even knowing that Diehard had activated, Shina smiled confidently and spoke.</p><br/><p>“Huhu, this sword is also the proof of contract between us. It is the power that he bestowed upon me. Be glad, unni. Unni loves Kang Shin, right? He will be stabbed with the same sword. With this sword, I will rob the world of its power. How is it? Are you happy that you will die in the same way as your lover?”</p><br/><p>“Kuu, this hurts… There’s one thing I want to say.”</p><br/><p>With this, I probably heard everything I could with Ludia’s appearance. I immediately canceled Sky God’s Play.</p><br/><p>In an instant, my height grew taller, my hair got shorter, and my voice became thicker. My two arms, which were still holding onto Shina, changed from the slender arms of a frail girl to healthy, muscled arms. Likely because of Soul Sucker, I wasn’t wearing my equipment and was only wearing my underwear. Because of the sword stuck in my stomach, my underwear got dyed in red. Without joking, it was an intense pain.</p><br/><p>“I’m not your unni, Shina.”</p><br/><p>Shina’s eyes opened widely.</p><br/><p>“Oppa!?”</p><br/><p>“Bellode, the request has been complete. Do you accept it?”</p><br/><p>“… Kuuk, the request… Sorry, but even so, I can’t do it…!”</p><br/><p>“Really? But I don’t think it’s up to you anymore.”</p><br/><p>The moment I said that, a fanfare rang in my ear.</p><br/><p>[Request complete! Although the requester did not lie, the target of the request has become the world’s enemy. As of this moment, all Dimensional Mercenaries that have carried out the request will be treated as if the request has been completed. It is recommended that you return to your dimension as soon as possible.]</p><br/><p>[You obtained 8 stats points as the request’s reward!]</p><br/><p>8 points. It was quite a lot. However, I couldn’t open my status window at the moment, so I couldn’t use the points that I had obtained with difficulty.</p><br/><p>Shina was visibly surprised by the fact that I had changed from Ludia’s appearance, but after realizing that the sword was still stuck in my stomach, she regained her composure.</p><br/><p>“Oppa, you already became a Dimensional Mercenary? I never even imagined it. Plus, you were disguising yourself as unni too… It’s quite unfortunate that I couldn’t kill unni here, but at least you made it easy for me. I can fulfill my side of the contract with the Demon Lord now.”</p><br/><p>“As I thought, I wasn’t your fated partner.”</p><br/><p>“Geez, oppa. My fated partner isn’t a childish rookie like you. It’s the Demon Lord.”</p><br/><p>Didn’t Ludia say her clan’s eyes allowed them to find partners that would let the empire flourish? It seemed there was a mistake. For example, instead of a flourishing empire, it could be flourishing descendants. With her fated partner being the Demon Lord, it was understandable that she’d be excited. Especially since she even suppressed me with such a powerful weapon.</p><br/><p>At this point, I was completely certain. I wanted to believe that the Demon Lord had brainwashed her, but all the negative status effects on her should have disappeared when I used Orc Lord’s Warcry. Since she lied about her fated partner being me… she must have been conspiring with the Demon Lord for a long time.</p><br/><p>“So Shina, do you hate me so much that you want to kill me?”</p><br/><p>“Hm… To be honest, I thought you’d be a good boyfriend. You’re handsome, strong, and kind.”</p><br/><p>“Thanks for the compliment. By the way, Shina, I came here to save you. Although I was in Ludia’s appearance, I hoped that you were fine.”</p><br/><p>This was the truth. If possible, I wanted to save Shina and go back. I wanted to complete my first mission without much problem, and I didn’t want to see Shina rebelling against Ludia and the imperial family. I didn’t want to see Ludia’s crying face, and I didn’t want her to hate me. But…</p><br/><p>“But oppa is a Hero, right? Setting aside whether you like it or not, you have to sacrifice yourself for my future. Please just take this as your fate.”</p><br/><p>“I see, so everything is ‘fate’… In truth, Shina, our conversation until now has been insignificant.”</p><br/><p>“What?”</p><br/><p>Sorry, Ludia.</p><br/><p>But I have no intention of letting someone who tried to kill me live.</p><br/><p>“Caduceus.”</p><br/><p>The snake spiraling around my arm opened its eyes. It was scorched black, then it scattered into pieces.</p><br/><p>[As your target has a lower level than you, you reflect all injuries inflicted by the target.]</p><br/><p>“Kuhuk!?”</p><br/><p>Shina grabbed her stomach and groaned. I touched my stomach, and confirmed that the sword was no longer stuck in it. My health was back to normal as well. The state of my body was so perfect that even I found it strange.</p><br/><p>Putting mana into my bracelet, I put on my armor. Then, I checked how my allies were doing. As expected, they had escaped the status effect and were making confused expressions. Seeing Shina’ state, Bellode ran toward me, but the summoner smacked his head first with his bow imbued with aura.</p><br/><p>“This guy really is stupid. Even with what she did to him…”</p><br/><p>“Kuk….”</p><br/><p>“Kahak!”</p><br/><p>Shina coughed out black blood and raised her head to look at me. The sword stuck to her stomach was giving off a black aura. Just watching it made me shiver in fear, especially when I thought that it was inside of me until just now.</p><br/><p>“This, what did… you…”</p><br/><p>“Shina. In my country, we call it the retribution of karma.”</p><br/><p>I explained to her coldly.</p><br/><p>“I simply returned what you did to me.”</p><br/><p>“How? The Demon Lord’s power… And Unni…”</p><br/><p>“You justified murder for your avarice, right?”</p><br/><p>‘As for me, I will kill you for my justice.’</p><br/><p>“Kuhuk… o-oppa, save me. Plea…”</p><br/><p>It went without saying that I had never killed a human being. I had killed monsters like eating rice. I had even killed demons after coming here. Right, I had even killed chimeras, who were made using humans.</p><br/><p>However, I had never killed a human being. Set aside the question of whether humans and other lives have different values. It wasn’t a matter of value. There was an inherent resistance to murdering humans, who were the same existences as me. It was the resistance that humans naturally had.</p><br/><p>However, I surprisingly accepted myself trying to kill Shina naturally. She tried to kill her older sister. She wanted to betray her continent and embrace the Demon Lord. She agreed to the plan of killing her own parents.</p><br/><p>No, that wasn’t the reason. I wasn’t trying to kill her for such a complicated reason. It was simpler.</p><br/><p>It was because she was my enemy and she tried to kill me.</p><br/><p>To kill her, I didn’t need any other reason.</p><br/><p>“Kuk… Kuhuk!”</p><br/><p>“Huu.”</p><br/><p>Once I had organized my thoughts, I was quick to move. I took my spear out of my inventory and brought it to the demonic sword stuck in her stomach. Although the demonic sword must have belonged to Shina, that was no longer the case as it had dealt critical damage to Shina. In fact, it was likely that it was now mine.</p><br/><p>As expected, my spear easily absorbed the demonic sword, which was happily sucking away her soul.</p><br/><p>[Crimson Gluttony Spear absorbed Soul Sucker. Growth: 87%]</p><br/><p>It had a lower grade than the holysword. How amazing was the holysword when it was at its full strength? While pondering, I stared at Shina, who was gasping for breath.</p><br/><p>“O-Oppa.”</p><br/><p>“You’re trying to open the dungeon.”</p><br/><p>The moment I felt her resistance, I summoned my elementals. Peika and Ruyue appeared on my shoulders the moment I called them. With a grunt, Ruyue was holding up the egg with her small body, but I pretended not to see it and order her.</p><br/><p>“Tie her.”</p><br/><p>[Okay!]</p><br/><p>In an instant, Shina’s hands and feet were frozen. With the demonic sword gone, she was no longer my opponent. Having lost her way to resist and escape, she only looked at me with blank eyes.</p><br/><p>“O-Oppa. W-What did you do with the sword?”</p><br/><p>Without answering her, I held my spear up. Peika and I also didn’t need to exchange words. She naturally infused herself into the Gluttony Spear, giving it golden flickers of lightning. Shina put on an urgent expression.</p><br/><p>“Oppa, you took away the sword to save me, right?”</p><br/><p>“Wrong.”</p><br/><p>Without even a shred of hesitation, I struck down with my spear.</p><br/><p>“I got rid of the sword, so I won’t make disgraceful excuses later that I didn’t personally kill you.”</p><br/><p>I will bear the weight of my crimes. I won’t make excuses that I only returned the injuries she gave me. I labeled her as my enemy, and thus I cut her. I will continue to do so.</p><br/><p>My spear cut Shina in half and the lightning energy in my spear burned the two halve of her corpse to crisp. I destroyed Shina completely, so that she cannot be revived as undead.</p><br/><p>With my own hands, I killed Ludia’s sister.</p><br/><p>The fact that it felt the same as killing a monster was sad and scary.</p><br/><p>Author’s note:</p><br/><p>You can’t effectively deal with the Demon Lord with Floor Masters’ powers? Then use God’s powers!</p><br/><p>By taking on Ludia’s appearance, Shin was able to hear everything from Shina. If he was in his own appearance, it would have been hard. Things would have gotten much more complicated.</p><br/><p>This is the highlight of this arc. Shin has killed a person for the first time. I thought a lot to write this part, but there was no reason for Shin, who was resolute and clear on distinguishing between friend and foe, to let Shina live. Shina was his acquaintance and Shin had even come for her. Because of the effort he put in, he couldn’t forgive her for what she did to him.</p><br/><p>Retrieving foreshadowing and making new ones. You will see how it all ends in the next chapter.</p><br/>\n</div>"}