{"title": "Chapter 120. Avarice Devours Everything (7)", "id": 120, "volume": 2, "url": "http://boxnovel.org/infinite-competitive-dungeon-society-chapter-120-avarice-devours-everything-7", "volume_title": "Volume 2", "body": "<h1>Chapter 120. Avarice Devours Everything (7)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 120. Avarice Devours Everything (7)</p><br/><p>After fighting the Demon Army’s elites, we had lost many people. Including me, there were 9 Dimensional Mercenaries left, but 21 knights had died and 7 of the surviving ones had received grave injuries preventing them from continuing. There were also only 4 magicians left. With 12 knights, 4 magicians, Bellode, and Ludia, there were 27 people left. If there was anything to be relieved about, it was that most of the knights and magicians were First Dungeon explorers.</p><br/><p>That said, we still had a chance. In fact, with the Army Commander defeated, we would be able to rescue Shina before the Demon Army could reorganize themselves. As such, there was still some fighting spirit left in everyone.</p><br/><p>However, the fact that the Demon Lord couldn’t move got on my mind. Could he really not move? In that case, couldn’t we kill him with our strength? Was the Demon Lord really heavily injured from the Hero?</p><br/><p>“There’s no choice but to go on.”</p><br/><p>Ludia nodded her head at my words. Right, we had no other choice but to go on. Even though we knew there was a spy within the knights or the magicians, we couldn’t say we would separate, as that would only split up our strengths. As I could at least trust the Dimensional Mercenaries, I wanted to complete the mission with their cooperation. However, it wouldn’t be so easy.</p><br/><p>Something had to be done. I couldn’t ignore Peruta’s words.</p><br/><p>“But Ludia, we can’t just keep going like this.”</p><br/><p>“What do you mean? Didn’t you just say it was okay?”</p><br/><p>“I just want to get an insurance. Will you hear me out?”</p><br/><p>“… Yeah?”</p><br/><p>Around dinner time, Bellode’s words made us tense up.</p><br/><p>“We’ll arrive soon. They must be planning on staying here for the night. They set up a temporary camp and are resting. Tonight’s our chance… We won’t be able to stop clashing. We will make a feint operation.”</p><br/><p>“That sounds interesting.”</p><br/><p>One team to sneak into their camp and save Shina and the explorers that turned into stone. One team to attack from the front and draw attention to themselves. There was also a team to pretend to be sneaky to disperse the demons’ suspicions.</p><br/><p>Bellode, me, the summoner, and a magician from Shina’s team, who had the ability to detect her party members’ locations, joined the rescue team. Three knights, two magicians, and two mercenaries joined the secondary covert team, and the rest joined the frontal assault team.</p><br/><p>“Demon bastards, we’ve come to take your heads!”</p><br/><p>“Demon Soldiers, stop running away like cowards and come fight!”</p><br/><p>Burning the monsters on guard magnificently, we set our plan into motion. The magician first cast stealth magic on all of the covert teams.</p><br/><p>“Be careful. Although the magic erases your presence, smell, and appearance, if demons and monsters lay their eyes on you, they will soon discover you.”</p><br/><p>“So you mean we have to kill them quickly.”</p><br/><p>I pushed back my hair and nodded. For the record, the metallic egg was in Fairy Garden with Ruyue. For some reason, it wouldn’t go into my inventory!</p><br/><p>It could be because it was alive, but at first, when it didn’t go into the inventory, I was afraid I might need to hold onto it the entire time. Thankfully, Ruyue was able to take it to Fairy Garden. Although Peika said it was better for me to hold onto it, I couldn’t do so in the middle of such a dangerous operation, so I left it to Ruyue’s care.</p><br/><p>“We’ll be starting now.”</p><br/><p>The secondary covert team went in a bit earlier than us, the main covert team. Soon, we also sneaked in. Dozens of tents and monsters passed by us. Putting our trust in the magician’s ability, we walked forward. The magician in question was on Bellode’s back. She was continuously detecting Shina’s location and whispering her position to Bellode. However, her cheeks were red. Was she flirting in the middle of the operation!?</p><br/><p>“Can you feel the Demon Lord’s presence?”</p><br/><p>“He’s in the center-most area. He’s tightly guarded too, but even in all the ruckus, he’s not moving.”</p><br/><p>“What about Shina?”</p><br/><p>“It seems that the explorers that turned to stone didn’t need to be placed near the Demon Lord. Although there are quite a lot of personnel on guard, we should be able to save them without much trouble.”</p><br/><p>“When we’re escaping, we can let them ride on my wyvern. But there’s still one problem.”</p><br/><p>The summoner spoke.</p><br/><p>“Is there a way to turn them back from stone?”</p><br/><p>“We can think about that later. We have to save them first.”</p><br/><p>Bellode save with a stiff voice. The summoner seemed to be convinced by the urgency in his voice as he shrugged.</p><br/><p>Although I had a plan in mind, I didn’t say anything. If things didn’t work out, I would feel bad. After finishing our discussion, we quickly walked forward. Although my clothes were uncomfortable, I endured it and followed behind Bellode.</p><br/><p>“Kyaaa.”</p><br/><p>“Human… smell?”</p><br/><p>“When is the Army Commander-nim coming back?”</p><br/><p>More and more monsters and demons were in the pathway. My body shook from the tension during battle. Although we could kill these guys as we advanced… For now, I had to hold myself back as saving Shina was our priority. Of course, fights did break out from time to time.</p><br/><p>“Eh, here!”</p><br/><p>“Die!’</p><br/><p>When we met demons or monsters in narrows pathways, we had to hastily take care of them and move on. The summoner was of great help, as his main class was archer. He consecutively shot out arrows with bountiful aura, which killed the demons quickly. It seemed to be a skill of his. It was truly quick and precise.</p><br/><p>“Looks like the other teams are doing well.”</p><br/><p>We heard explosions and screams from parts of the military camp. Hoping for the other team’s safety, we hastened our steps. Soon, we reached the tent where Shina and the other explorers were imprisoned. As expected, there were dozens of demons guarding the place. It seemed they planned to use them as hostages in their fight against the empire.</p><br/><p>“What do we do?”</p><br/><p>“As we planned, I’ll go.”</p><br/><p>“K-Kuhum… Gladly.”</p><br/><p>I walked up confidently. My appearance changed with each step. My white skin turned into black, tough and muscled skin, while horns shot out from my head and my hair was dyed black. Seeing me walk up so confidently, the demons became flustered.</p><br/><p>“A-Army Commander-nim!?”</p><br/><p>“Army Commander-nim, do you need something? We haven’t received any word that you’d be visiting.”</p><br/><p>“What? I definitely sent a message.”</p><br/><p>“But…! We haven’t heard that you’ve come back yet. Did you bring the crown princess back?”</p><br/><p>“That bitch hid. We’ll need to use the hostages more aggressively.”</p><br/><p>“Army Commander-nim, that’s…”</p><br/><p>I reached out and grabbed the head of the demon that talked back to me.</p><br/><p>“… Do you want to taste the honor of becoming my blood and flesh?”</p><br/><p>“N-No, sir!”</p><br/><p>“I, Shatuno, am the absolute ruler under His Highness, the Demon Lord. You dare to talk back to me? You’ve gotten bolder!”</p><br/><p>“No, sir!”</p><br/><p>“You must have heard that we have intruders! I will take care of the hostages from now. You guys focus on guarding His Highness!”</p><br/><p>“Yes, sir!”</p><br/><p>The demons all bowed and disappeared beyond the pathway. I snorted and thought.</p><br/><p>‘This skill, it can even alter my way of talking!’</p><br/><p>It said I would absolutely not get discovered, but to think it would have such effect! I thought I could call my plan a success if I could just trick them for this one moment, but I didn’t think it would work so well. God bless Zeus!</p><br/><p>“Amazing.”</p><br/><p>“I thought that damned demon came back to life.”</p><br/><p>After confirming that the demons’ presence disappeared completely, I returned to my allies. Giving them a grin, I went back to the appearance I had before. Right. I had been using Sky God’s Play.</p><br/><p>“But, the next part worries me a bit…”</p><br/><p>“Why?”</p><br/><p>At my question, Bellode couldn’t continue and shut his mouth. However, his eyes clearly showed unhappiness. As it was none of my business, I ignored it and entered the tent with them.</p><br/><p>She was there. Shina, who had been petrified, was there! Happily yelling inwardly, I urged everyone on.</p><br/><p>“We don’t have a lot of time. We’re going to confirm that everyone’s here and escape!”</p><br/><p>“Right! Eight people, including Shina-nim. They’re all here!”</p><br/><p>“They will notice us leaving, right?”</p><br/><p>“Let’s just keep going! It won’t be possible to secretly leave with them anyways! Hurry up and put them on!”</p><br/><p>Although we tricked the demons away, it won’t be long until they found out. The summoner summoned his wyvern and fixed the petrified explorers on. As they were alive, they wouldn’t enter the inventory.</p><br/><p>As such, we had to sweat to get them out of here. It would be nice if I could just use Return and bring them to Earth with me, but as they belonged to the Luka continent, that wasn’t possible. It was quite irritating.</p><br/><p>But… in my dream, I remembered that I returned to Earth with Ludia. How did my dream self do that…?</p><br/><p>While we were putting the petrified explorers on the wyvern, the magician calmly shot up a flare. It tore the tent and rose up high into the sky, signifying that we had successfully rescued the explorers.</p><br/><p>“Get on! You too, newbie!”</p><br/><p>“I’m coming even if you don’t urge me!”</p><br/><p>I held Shina in my embrace and got on the wyvern last. The wyvern breathed out fire, burning everything in its path as it flapped its huge wings.</p><br/><p>“Wvyern!”</p><br/><p>“A wyvern appeared inside the camp!”</p><br/><p>“Damn it, there were intruders here too!”</p><br/><p>Uproar began to ring out from all sides. We could see demons running toward us, holding their weapons or tails.</p><br/><p>“Kuk, they took the hostages!”</p><br/><p>“Shoot them down!”</p><br/><p>“Fools, be careful when you shoot!’</p><br/><p>The wyvern soared into the sky. However, the wyvern was hit by two of the demons’ magic attacks, causing it to scream.</p><br/><p>“Those sons of bitches!”</p><br/><p>“Crown princess! The crown princess is on it!”</p><br/><p>It seemed they were focusing on us more than we thought. In an instant, dozens of demons flocked toward us, confusing us. The summoner took out his bow, while the magician shot magic and Bellode shot aura blades with his sword. Even so, it was not enough to deal with all the demons.</p><br/><p>“Wyvern, quicker!”</p><br/><p>“Damn, they put up a barrier of mana! It’s going to take time to break through it!”</p><br/><p>“We need to buy time…!”</p><br/><p>The summoner could not help, as he was busy putting in mana into his wyvern to break through the barrier. The magician was also focused on breaking the barrier. Damn, a magical device like this wasn’t there when we sneaked in!</p><br/><p>“It looks like a barrier that you can activate once you know there are intruders. It’s not that it’s out of our expectations, but…”</p><br/><p>“It’s too strong! Demons usually don’t cast barriers like this… At this rate, we’ll be shot down!”</p><br/><p>“Huu, damned spies. I have to take care of this too?”</p><br/><p>I sighed and took out Gluttony Spear from my inventory. Then, I looked at Shina in my embrace and spoke.</p><br/><p>“Summon Caduceus. Sky God’s Rage!”</p><br/><p>[You summoned Caduceus. All physical abilities have been enhanced. Two snakes have opened their eyes. You may only use the power of one of them.]</p><br/><p>[Sky God’s Rage has been imbued into the weapon in your hand. You can deliver a single powerful blow, or distribute the power in multiple attacks.]</p><br/><p>In my hand not holding the spear, particles of light began to gather. Like a snake crawling up a tree, two rays of light crawled up my arm in a spiral and a pair of wings grew on my back. At the same time, the Gluttony Spear let out a radiant light and transformed to a golden lightning bolt. My allies looking at me opened their eyes widely.</p><br/><p>“Newbie, you…!”</p><br/><p>“If you tell anyone, I’ll kill you.”</p><br/><p>With words that even I found arrogant, I tightened my grip on the lightning bolt and thrust it towards the barrier blocking us.</p><br/><p>BOOM!</p><br/><p>“Again!”</p><br/><p>CRACK!</p><br/><p>With just two hits, an explosive crack rang out. With a satisfied smile, I shot out the lightning bolt again. The sound I was expecting was released. The sound of hundreds of windows shattering rang out. Seeing the demons’ shocked faces below satisfied me even more.</p><br/><p>“Wvyern, go!”</p><br/><p>[Guaaaaaaa!]</p><br/><p>“Eh, why is he listening to her… him!”</p><br/><p>“Don’t let them escape!”</p><br/><p>“Someone report to the Demon Lord-nim!”</p><br/><p>“Capture the other intruders!”</p><br/><p>While still sending magic toward us, demons were scattering. I shot my lightning bolt, which still had some power remaining, at them. Although I wanted to throw the spear, retrieving it would be difficult, so I simply sent the lightning energy in my spear flying. A few of the demons turned into ash and disappeared. At the same time, the energy imbued by Sky God’s Rage had completely disappeared from the spear. Feeling refreshed, I put the spear back into my inventory.</p><br/><p>“Alright, let’s run now!”</p><br/><p>“You sure are scary…”</p><br/><p>The wyvern soared through the sky. Although many of the Demon Army’s monsters flew in the sky, the others were more than capable of dealing with them. After all, they were all First Dungeon explorers that were at least level 70.</p><br/><p>“What about the other teams? Have you tried messaging them?”</p><br/><p>“Two of the Dimensional Mercenaries escaped to the dungeon. Four knights and two magicians died. The rest managed to escape the camp.”</p><br/><p>The summoner replied, looking more relaxed as he controlled his wyvern. The wyvern continued to breathe out fire at the flying monsters. No matter how I thought about it, his wyvern was unusually strong.</p><br/><p>Meanwhile, I stretched my neck.</p><br/><p>“The petrified people are all tied well, right?”</p><br/><p>“Other than the princess in your hand, then yeah.”</p><br/><p>“Good. Then should we do it now?”</p><br/><p>“Do what?”</p><br/><p>“You’ll see.” With that, I stretched my neck again. Then, I shouted.</p><br/><p>“Uwaaaaaaak!”</p><br/><p>[You used Orc Lord’s Warcry! All party members are cleansed of negative status effects. All party members’ attack power increases by 50 percent for the duration. All party members become super-armored, unfazed by enemy attacks.]</p><br/><p>Startled by my shouting, the wyvern screamed and flapped its wings violently. The others were also surprised by my shouting and turned my way to say something, only to get shocked.</p><br/><p>“Mm? Mmm…”</p><br/><p>Shina, who was in my arms, regained her normal complexion. Not only her, but all the petrified explorers tied to the wyvern snapped out of their status effects.</p><br/><p>“W-What did you… No, nevermind. Excuse me.”</p><br/><p>“Huhuhu.”</p><br/><p>‘Even if I told you guys, there’s nothing you can do.’ I murmured inwardly. The petrification was a type of status effect. It could be canceled with Orc Lord’s Warcry. I was now fully ready to agree that Orc Lord’s Warcry was the world’s most cheaty skill.</p><br/><p>Smiling brightly, I checked Shina’s state. She was still wearing the armor she wore during the battle. With her eyes open, she was looking at me with surprised eyes.</p><br/><p>“Shina, are you okay?”</p><br/><p>“… Unni? You came to save me? Really?”</p><br/><p>“Yeah.”</p><br/><p>Shina’s eyes opened widely. Then, looking at me, who was taking Ludia’s appearance, she laughed.</p><br/><p>“So unni really… Huhu. Thanks, unni.”</p><br/><p>I was lost for words at her incredibly beautiful smile. Drawn by her smile, I also smiled. Shina’s next action was like flowing water.</p><br/><p>“And… good bye.”</p><br/><p>She took out a sword. The sword’s body, the sword’s guard, and the sword’s pommel were all emanating an eerie black aura. Then, she stabbed it in my stomach.</p><br/><p>Author’s note:</p><br/><p>1. I wonder if there are any readers who didn’t realize that Shin was disguising himself as Ludia. Probably not, right? With all the hints I gave…</p><br/><p>2. It seems like not a lot of people thought Shina was a traitor. Someone actually guessed it from what Peruta said in the last chapter. I got frightened and replied mysteriously. I don’t know if it worked…</p><br/><p>By the way, there were many hints. Like the emperor telling him not to trust anyone besides Ludia and Bellode; the fact that Shina, who should’ve been faster than Ludia, stood still and got petrified while Ludia escaped (though Ludia thought that it was because she was just faster T.T); or as the last chapter said, Peruta telling Shin not to trust anyone…</p><br/><p>Stupid Shina, you got tricked… does she still look like your sister…?</p><br/><p>Now, why was Shin taking Ludia’s appearance!? Why did he hold Shina in his embrace, fully knowing that something was wrong with Shina? Did he want to embrace a girl even if it cost him his life!? The answer will come out in the next chapter.</p><br/><p>PS – Shin’s cape has the effect of blocking ambush attacks three times per day. It will be explained in the beginning of next chapter, but he cannot use his equipment skills when he’s using Sky God’s Play, so that’s why he couldn’t block her attack. Of course, even if he could use the effect, the difference in the equipment’s power wouldn’t make that possible.</p><br/><p>Translator’s note:</p><br/><p>Sure, give me longer chapters Toika, I love it… (tears)</p><br/><p>On the other hand, if Shin’s changed to Ludia, can he feel the… you know…</p><br/>\n</div>"}