{"title": "Chapter 124. You in the World of Sunset (2)", "id": 124, "volume": 2, "url": "http://boxnovel.org/infinite-competitive-dungeon-society-chapter-124-you-in-the-world-of-sunset-2", "volume_title": "Volume 2", "body": "<h1>Chapter 124. You in the World of Sunset (2)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 124. You in the World of Sunset (2)</p><br/><p>Hunting the Wendigo by myself was extremely easy, but I could still get Frozen Crystals even if I added a few more people to my party. As such, I decided to hunt the Wendigo in parties. When the explorers stuck on 50th floor saw me, they immediately recognized me as Crown Prince.</p><br/><p>“Crown Prince is already on the 50th floor.”</p><br/><p>“A miracle. 50th floor already…”</p><br/><p>“But even Crown Prince should have hard time breaking through the 50th floor. He’ll be stuck here too.”</p><br/><p>“If you’re done talking nonsense, we’re going in.”</p><br/><p>In the fight against Wendigo, everyone else had only one job to do. It was to stay as far away from Wendigo as possible. I didn’t know because Ruyue’s power was protecting me, but the freezing energy that the Wendigo emitted was no joke. Even if priests casted protection magic with all their strength, veteran warriors, who had climbed all the way to the 50th floor, still had difficulties.</p><br/><p>[Guaaaaaa!]</p><br/><p>[Shin, that’s a cold attack!]</p><br/><p>“Yeah, yeah.”</p><br/><p>Of course, the 50th Floor Master Wendigo also had a special attack skill. With its hand dyed white, it drew a large trace. If one even glazed it, he would be frozen for a moment regardless of his resistance. I did not experience it in my first raid, so I ended up being caught by surprise in my second raid. Thankfully, Ruyue protected me with a barrier while I was frozen.</p><br/><p>Moreover, because of my high resistance, I became unfrozen in 5 seconds. It seemed the Wendigo could not use it consecutively. With a bewildered face, it tried to kick me, which simply led me to beating it up. In truth, this was the first time I wasn’t looking forward to the Floor Master skill.</p><br/><p>However, there were three slots left in the pocket watch to store skills in. Since I felt that the subclass would transform once the skills were filled, I planned to take whatever skills I could get. If getting to the 60th floor would take longer than I expected, I considered putting Crimson Scale Armor’s Crimson Roar into the pocket watch too.</p><br/><p>“Haat.”</p><br/><p>When the Wendigo tried to swipe at me with its whitened arm, I created a plate of ice in the air with Ruyue’s power and leapt up. As the Wendigo looked up in vain, I grinned and shouted, “Thunder Spear!”</p><br/><p>[Choose your reward.]</p><br/><p>[1. Wendigo’s Fur Coat</p><br/><p>2. High-grade Health Potion</p><br/><p>3. Frozen Crystal</p><br/><p>4. Frozen Dart]</p><br/><p>Eh? Didn’t I come in with 6 people? When I turned around while swallowing the Frozen Crystal, I saw three explorers hugging each other while shaking.</p><br/><p>“C-C-Crown Prince, h-h-h-how are you completely fine?”</p><br/><p>“H-H-H-H-He said h-he had an ele-elemental.”</p><br/><p>“I-It’s s-so cold! I-I’m going t-to die!”</p><br/><p>“… The other two?”</p><br/><p>“F-Froze to d-death.”</p><br/><p>“….”</p><br/><p>My Wendigo party raids generally ended like this. In truth, I wanted to screw grinding and just get it over with.</p><br/><p>Ludia was completely fine when she was next to me. But when I tried to separate from her, she showed signs of mental instability. Thinking that she had gone back to her normal self was only my wishful thinking.</p><br/><p>Whether we were eating, reading books, listening to music, knitting, drinking tea, or whatnot, the moment I tried to go out of her sight, she tried to scream in protest. Of course, I considered it my punishment for killing her sister and accepted it. I was just glad that I could serve as her emotional pillar.</p><br/><p>However, I couldn’t let it stay like this. Right now, it was fine since I had a lot of free time with only hunting the Wendigo three times a day. But once I finished grinding, I planned to go to America. I couldn’t bring Ludia along.</p><br/><p>When I told her, her reaction was extremely concerning.</p><br/><p>“Y-You’re abandoning me?”</p><br/><p>“No, I’m coming back.”</p><br/><p>“Liar.”</p><br/><p>“Are you the only one living here? My parents and Yua are here too.”</p><br/><p>“Liar, liar. When I wake up one day, everything will be gone. I’ll be the only one left in this world.”</p><br/><p>“Ludia.”</p><br/><p>“Ah, it’s that. You’re going to leave me and go fight someone again. the D-Demon Lord chased after us.”</p><br/><p>“No, that’s not it.”</p><br/><p>“T-Take me with you. Take me with you, please. I don’t want to be left by myself like a fool again.”</p><br/><p>She didn’t look like she’d listen no matter what I said, so I shut my mouth and held Ludia’s hands. Ludia took the opportunity to throw herself into my embrace and didn’t let go. When I raised my head, not knowing what to do, mother opened the door in the perfect time with a plate full of fruits. Then, she smiled kindly and closed the door. Damn it, I didn’t like that needlessly kind consideration!</p><br/><p>“Don’t go. If you’re going, take me with you. Please?”</p><br/><p>“It’s dangerous if you come.”</p><br/><p>“Shin, take me with you. Let me go too.”</p><br/><p>She really didn’t listen! It seemed she wouldn’t let go until I agreed to take her. In the end, I sighed and replied.</p><br/><p>“There are two conditions.”</p><br/><p>“Un.”</p><br/><p>“First, you have to hide your identity. This is easy since you can buy an item called Otus’ Secret from the Floor Shop.”</p><br/><p>“Un.”</p><br/><p>“Second, you have to get stronger. I can’t take you if you don’t break through the 40th floor at least.”</p><br/><p>“… 40th floor?”</p><br/><p>Ludia’s eyes trembled slightly.</p><br/><p>“I’m only in the entrance of the 36th floor.”</p><br/><p>“There are still 3 weeks until I finish grinding the 50th floor. I’m sure you can do it.”</p><br/><p>“T-Then I’d have to be away from you.”</p><br/><p>“Right, since I can’t go back to the 36th floor.”</p><br/><p>“I, I can’t. No. I don’t want to.”</p><br/><p>“Then I’m going to leave you behind.”</p><br/><p>“Ah, aah.”</p><br/><p>Ludia looked at me like the world just crumbled down. The next moment, she suddenly looked brighter as she spoke.</p><br/><p>“I don’t have anyone to party with me now. Shuna still can’t take a foot out of the Residential Area.”</p><br/><p>I had forgotten about Shuna until now,. Ludia had known about Shuna, but didn’t go back to the dungeon even once, and was only now using her as an excuse. I thought for a moment which of us were worse, but I didn’t say anything, concluding that we were both bad.</p><br/><p>“But Ellos’ party is waiting for you.”</p><br/><p>“K-Kasina is…?”</p><br/><p>Ludia retorted as if she’d never imagined it. ‘So she’s not that close to Ellos…’ Thinking to myself, I nodded. Ellos had actually messaged me recently.</p><br/><p>“Yeah. He’s waiting for your return on the 36th floor.”</p><br/><p>“N-No. I can’t anymore. I lost my confidence.”</p><br/><p>“But if you can’t clear the 40th floor, I won’t take you with me. I’m not lying.”</p><br/><p>“N-No… R-Right, I can’t go back to them alone.”</p><br/><p>“Miss Shuna will be there too.”</p><br/><p>“Shuna can’t climb the dungeon anymore.”</p><br/><p>Shuna had no house nor guild. It was unlikely that other guilds would take her in. That’s what Ludia said.</p><br/><p>Since it came to this, I decided to tell Ludia the truth.</p><br/><p>“Ludia, you see…”</p><br/><p>Looking around my Special Mansion, Ludia made a blank expression. She saw more than one hundred rooms, swimming pool and grand bath, basement training room and personal training room, grand dining hall and basement storage room, and finally the Giant Iron Boar ruining the garden’s look. Speaking of the Giant Iron Boar, it was now reduced to 20 meters from 60 meters in size. Ludia shouted.</p><br/><p>“I’m going to live here with you!”</p><br/><p>“I’m going to found a guild.”</p><br/><p>“…”</p><br/><p>Ludia made an expression like she just stepped on dung, and spoke.</p><br/><p>“Can’t we just make it our home?”</p><br/><p>“No, we can’t. Weren’t you Miss Shuna’s best friend? What about Miss Shuna?”</p><br/><p>“I’ll give my house to Shuna. It’s easy to transfer ownership. That way, Shuna can become an independent explorer too!”</p><br/><p>“What about you?”</p><br/><p>“W-Well, I’m… of course…”</p><br/><p>Ludia’s faced turned red, as she looked down and pulled on my sleeve. I lightly pulled my sleeve back and spoke.</p><br/><p>“See, out of words, right? I’m going to make a guild.”</p><br/><p>“… I hate you. I hate you so much.”</p><br/><p>“Yeah, you can hate me as much as you want. Though, I won’t hate you.”</p><br/><p>“You big insensitive idiot! I really want to kill you…!”</p><br/><p>“Yeah, yeah.”</p><br/><p>Making a guild was easier than I thought. I just had to visit the Residential Area’s administrator and submit the necessary documents. But when I went to see Meladel, he opened his mouth after seeing Ludia linking her arms with me.</p><br/><p>“Y-You. Who is that lady?”</p><br/><p>“A friend.”</p><br/><p>“Oh, dear lord. Is this the fate of a Hero…? My poor Master…!”</p><br/><p>“Stop speaking nonsense and take my guild creation application.”</p><br/><p>As Meladel accepted my application, he continued to say incomprehensible things like, ‘Do you like boats?’ or ‘I suggest you wear an abdominal belt.’ Then, messages popped up in front of my eyes.</p><br/><p>[You created a guild! You became the guild master of the F rank guild, ‘Revival’!]</p><br/><p>[Guild member: Kang Shin (Guild Master, Gold), Palludia Gren Ehuir (Guild Member, Silver). Total: 2]</p><br/><p>[You can raise the guild rank by increasing the number of guild members or by making achievements by clearing Event Dungeons or Event Raids. With higher guild rank, your guild will become more well-known in the dungeon, giving you better rewards in Event Raids and giving you more freedom in the dungeon.]</p><br/><p>It wasn’t much. It didn’t increase my strength. As I didn’t expect anything, I didn’t feel disappointed either.</p><br/><p>“You can request a guild emblem when you become D rank. People from famous guilds usually wear brooches or capes engraved with their guild emblem to show their status.”</p><br/><p>“Like a uniform?”</p><br/><p>“More like empty show.”</p><br/><p>Even while I was talking with Meladel, Ludia stayed still. She must have heard the messages too. Then, she murmured silently.</p><br/><p>“Revival…”</p><br/><p>“Um… It’s a word from Earth’s language called English. It means resurrection, recovery, or resurgence. I wanted to use the Korean word for it, but it said there’s already a guild by that name.”</p><br/><p>“BhuWhal[1. 부활 (Bhu Whal) = Revival in Korean]. It means ‘toy’ in Syrnor continent’s language.”</p><br/><p>“Why would they make a guild with that meaning!? Are the guild members the guild master’s toy? Ek.”</p><br/><p>Suddenly, I felt weight on my back. I turned around and saw Ludia who had her face buried in my back. I couldn’t see her face. Flustered, I talked to her.</p><br/><p>“L-Ludia?”</p><br/><p>“…”</p><br/><p>“Ludia… Ludia?”</p><br/><p>“… I’ll try.”</p><br/><p>Ludia said in a small voice.</p><br/><p>“You…”</p><br/><p>“I’ll try… climbing the dungeon. I’ll contact Shuna… and Kasina too. I’ll try.”</p><br/><p>I didn’t know why she was suddenly so willing. Perhaps, she felt a sense of security at the fact that she belonged to a guild with me. Perhaps, she had been strengthening her determination this entire time. Perhaps…</p><br/><p>I could think of many possibilities, but I didn’t ask her. It was fine the way it was now.</p><br/><p>“Yeah. Thanks for taking a step forward, Ludia.”</p><br/><p>“Un… Un.”</p><br/><p>*</p><br/><p>I had a dream.</p><br/><p>The sky burned and dark smoke shot up.</p><br/><p>Morning didn’t wake and night didn’t sleep.</p><br/><p>Fairies that remained in fantasies were chased out to reality. Holding their torn wings, they cursed humans.</p><br/><p>“XXX, I always think why I always go through such hardships when I involve myself with you.”</p><br/><p>“X, that’s wrong. Those that can say they went through hardships after involving themselves with X are those that survive. It’s usually hard to survive after involving oneself with X.”</p><br/><p>Under a bloodstained sunset, a giant and a handsome young man were exchanging jokes. One held an enormous claymore and the other held a longsword, which were both suitably big for their masters size.</p><br/><p>“You’re all noisy. Go out and kill the monsters. Be careful so blood doesn’t splatter onto me. Also, if you curse X, I’ll kill you.”</p><br/><p>“Witch, shut up and prepare your flames. Because of your laid-back attitude, I thought I’d see the afterlife today.”</p><br/><p>“Guys[2. ‘Guys’ was in English.], I just thought up an extremely funny joke. Don’t fight and calm down! Lizard King is the king of the lizardmen, right? But if you look, there are 5 Lizard Kings running at us! What do you think this is? The small kingdoms have joined!”</p><br/><p>A red witch, black assassin, cheerful gunner, and several others. Although there weren’t many, each of them were incredibly strong allies.</p><br/><p>“Xa, are you ready?”</p><br/><p>“XX, your armor is really cool!”</p><br/><p>“Haha, it really is. At least it’ll garner full attention. I praise thy courage.”</p><br/><p>Someone wearing an armor radiating five-colored brilliance stepped forward, setting them all side. Even though it was my first time seeing him, my heart dropped a beat. I had the same reaction every time. From the first time I saw him to even now.</p><br/><p>“I have the strongest body here anyways. Really, there are probably no other guilds where the guild master is treated like a punching bag. Alright… Revival, we’re going.”</p><br/><p>“X!”</p><br/><p>“Ah, right. XXX… Can I leave it to you?”</p><br/><p>Standing tall in a world of sunset alone, he turned and smiled at me. I held myself back from mixing up business and private affairs, and shouted confidently, ‘Of course!’ Along with a prayer in my heart, hoping to be of help to the one I love.</p><br/><p>“O Power, O Blessing vested in the Earth! We will fight to protect thee, let us borrow thy power! O Mitarus, bless and sublimate this power!”</p><br/><p>Author’s note:</p><br/><p>Just because I kept the narration in first person POV, it doesn’t mean it will always be that way!</p><br/><p>Also, I already warned that you’d regret it if you read the last chapter half-heartedly!</p><br/><p>Translator’s note:</p><br/><p>It’s hard to show it in English, but each of the Xs is one syllable. Xa = Yua (I think); just mentioning that one because X is English, making Xa look weird…</p><br/><p>You guys can do the detective work for the other ones if you’d like :P</p><br/><p>There are enough clues to figure out all the names and whose POV the dream was in.</p><br/>\n</div>"}