{"title": "Chapter 122. Avarice Devours Everything (9)", "id": 122, "volume": 2, "url": "http://boxnovel.org/infinite-competitive-dungeon-society-chapter-122-avarice-devours-everything-9", "volume_title": "Volume 2", "body": "<h1>Chapter 122. Avarice Devours Everything (9)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 122. Avarice Devours Everything (9)</p><br/><p>The wyvern did not return to the palace, but stopped half-way and dropped us off. It was the rendezvous point we set beforehand.</p><br/><p>Ludia, who had gone to hide in the dungeon at my request, returned and was already waiting there. Others who had safely escaped the demons’ camp were also gathered. As my team was escaping, the ruckus we caused by breaking the barrier had drawn much attention away from the others, letting them escape more easily.</p><br/><p>“What was that message about world’s enemy?”</p><br/><p>“Didn’t you go rescue them? Why are you alone?”</p><br/><p>The Dimensional Mercenaries approached me and asked questions. However, I raised my hand and stopped them.</p><br/><p>“Ludia, first, get away from the knights.”</p><br/><p>“What? Kyak!”</p><br/><p>The moment I said so, the knights made their move. It wasn’t to protect Ludia, but to capture her. Come on! All the surviving knights were traitors!? Even the magicians…!</p><br/><p>“They’re all traitors!”</p><br/><p>I shouted sharply and used Divine Speed. I stabbed my spear into the knight trying to restrain Ludia and held her in one arm. Then I jumped back, all of which only happened in 3 seconds.</p><br/><p>“What just happened!?”</p><br/><p>“Newbie, you’re really fast…!”</p><br/><p>“Kuk!”</p><br/><p>They were quick to understand the situation. The moment I rescued Ludia, they tried to escape to the dungeon. When I tried to capture them with Ruyue’s power…</p><br/><p>[Explorers that betrayed their world and joined the world’s enemy have been kicked out of the dungeon.]</p><br/><p>[Their abilities as explorers have been recollected.]</p><br/><p>What? I narrowed my eyes. What was this message saying? Why was the dungeon doing this now?</p><br/><p>The knights and magicians, who were trying to open the dungeon, suddenly collapsed. It was likely because they had lost their strength. The Dimensional Mercenaries didn’t miss this opportunity. Without a shred of hesitation, they attacked the traitors’ vital points and killed them.</p><br/><p>“Why did the dungeon figure out they were the world’s enemies now?”</p><br/><p>[The dungeon’s system automatically provides experience calculation, inventory, and item drops to all explorers, but it cannot focus on specific explorers all the time. Moreover, finding explorers that joined the world’s enemy in a world where their forces are strong is close to impossible. As such, Dimensional Mercenaries serve as eyes of the dungeon to find explorers that betrayed their own worlds.]</p><br/><p>“You’re smart, message noona…”</p><br/><p>Message noona who satisfied my curiosity did not reply to my words of astonishment. It seemed the other Dimensional Mercenaries already knew about this. Since they killed the traitors so resolutely, there must be rewards for killing the traitors too…</p><br/><p>[All traitors have been killed. Rewards will be distributed appropriately.]</p><br/><p>[The lover of the Demon Lord was killed. You obtained 5 stat points and 2 skill points as reward. Stats point gained: 13. Skill points gained: 2]</p><br/><p>Tsk, I didn’t want such a bittersweet reward. Seeing my complexion turn dark at the message, Ludia, who was watching me, became startled and separated from me. She then asked.</p><br/><p>“Shina, where’s Shina?”</p><br/><p>“… Ludia.”</p><br/><p>“Shin, where’s Shina?”</p><br/><p>I pointed at the wyvern. On its back was the burnt up corpse of Shina. When Ludia saw the corpse, she didn’t say anything.</p><br/><p>“We confirmed it. Shina was… an enemy.”</p><br/><p>“That’s… a lie.”</p><br/><p>“Newbie’s telling the truth. If it wasn’t for him, we would have all died. Damn, that demonic sword still makes me shiver.”</p><br/><p>“Shina had… a demonic sword?”</p><br/><p>“Yeah.”</p><br/><p>I nodded my head. Ludia slowly approached the wyvern and pulled the corpse down. Seeing the corpse cut into two halves, she became speechless. I couldn’t help but talk to her.</p><br/><p>“… Ludia.”</p><br/><p>“Who… Who killed her?”</p><br/><p>“I did.”</p><br/><p>I told her the truth. She shut her eyes tightly then opened them.</p><br/><p>“Don’t lie and tell me the truth.”</p><br/><p>“I killed her. Shina tried to kill me, who had transformed into you.”</p><br/><p>“Please… Don’t lie!”</p><br/><p>“… Sorry, but I’m not lying to you. I killed her, Ludia.”</p><br/><p>Ludia’s lips trembled. She opened her mouth then closed it again, as if to say something. Then, she glared at me.</p><br/><p>“What is this?”</p><br/><p>“Ludia.”</p><br/><p>“What is this!?”</p><br/><p>Ludia shouted louder than I had ever heard her before.</p><br/><p>“Is this what you wanted? Making me escape to the dungeon because it was dangerous, taking my appearance, almost dying to Shina, then killing her? I was waiting for you in the dungeon without knowing anything. Like a clueless idiot! What am I supposed to do after hearing this? What is this!?”</p><br/><p>“I didn’t want this either. I didn’t want it to be true!”</p><br/><p>“I should’ve gone with you. Like I first thought, I should have gone with you! Even if Shina killed me, I should have gone! I had to see it with my own eyes and experience it for myself!”</p><br/><p>“You would have died!”</p><br/><p>“I’d rather die! Because you protected me, I became the world’s biggest idiot, fool, and blockhead! Is this what you wanted? Did you want me to obediently stay in the dungeon because you said it was dangerous, then crawl out when everything was over, see my sister’s corpse, and nod my head and say it couldn’t be helped since she was a traitor!?”</p><br/><p>“I did!”</p><br/><p>I also shouted.</p><br/><p>“It’s better than you dying! I didn’t want to lose my friend. Is that bad?”</p><br/><p>“Because you tried to protect me, I lost my authority as a member of the Imperial family, my pride as an explorer, and even my qualification to be your friend! Because I was afraid of my sister being a traitor, I became a coward, who left my friend to go save my sister and hid in the dungeon!”</p><br/><p>“And what’s wrong with that!? You don’t understand your priorities!”</p><br/><p>“You’re the one who can’t understand! Look at me! Both mother and father were killed, but hiding in that small house in the dungeon, I couldn’t even see Shina die with my own eyes. And I had to hear that my sister’s killer was none other than you!”</p><br/><p>“What…?”</p><br/><p>“I don’t have anything anymore! I have nothing at all! There’s nothing to protect, there’s no reason to live! I would have rather died to Shina. I would have rather protected you and died! That way, I could have at least protected my friend!”</p><br/><p>The emperor and the empress died? I wanted to say something, but I was lost for words. I remembered what Shina said, that the highest ranking demons had gone to attack the Imperial Palace…</p><br/><p>Did the emperor and empress leave behind a will for her? Did they meet an honorable end? I didn’t know whether to be sad or happy at the fact that they at least didn’t experience torture without being able to die like in my dreams.</p><br/><p>Leaving my speechless self behind, Ludia fell on the ground helplessly. Then, with a barely audible voice, she murmured.</p><br/><p>“Sorry, Shin. Sorry… Sorry for only sending you… I’m the one that made you kill Shina with your hands, I’m the one…”</p><br/><p>Seeing her suddenly change from condemning me, I became flustered. She wasn’t mentally stable at the moment. After thinking about what to say, I replied in a quiet voice.</p><br/><p>“… It’s what I wanted.”</p><br/><p>“I’m the worst. I’m worthless. I’m a clueless fool, who gets scared at the most critical moments and can only let others do my job. I don’t have the qualification to be royalty, to be an explorer, or even to live…”</p><br/><p>“Ludia, don’t say that!”</p><br/><p>“I hate you. I can’t help but hate you. I hate myself. I hate myself for hating you…”</p><br/><p>“Ludia, you need rest. I beg you, don’t think about anything and just rest. If you hate me, I can disappear. I understand why you would hate me, so I’ll go away so that you won’t see me anymore.”</p><br/><p>“No!”</p><br/><p>Ludia suddenly shouted. Her eyes were full of fear.</p><br/><p>“You stole my sister from me, and you even want to take away what I have left?”</p><br/><p>“Ludia…”</p><br/><p>Was Ludia talking about me? Startled by her words, I stood still without knowing what to say. She staggered up and approached me. Holding on to my arms, she looked up. Her blue eyes were glistening with tears.</p><br/><p>“No, Shin. Don’t. Please… You’re the only one I have left. I lost mother, father, and Shina. I don’t want to lose you too… Sorry. I won’t hate you, so please don’t leave. Please…”</p><br/><p>Ludia had gotten weak. That’s what I thought. She was mentally pushed to the point she would cling to me, who had killed her sister. Since the day Shina was captured by the Demon Lord, or at least thought to be captured, she was broken. The wound she had patched under the goal of rescuing Shina had burst, leaving her helpless.</p><br/><p>“No, don’t go. Don’t leave me alone…”</p><br/><p>“She’s having a mental panic attack. Thinking that the world would collapse leaving her alone or that she is now worthless… It’s common among explorers that lost their worlds. At least, she still has you… Newbie, you better think carefully before you act.”</p><br/><p>The summoner mercenary spoke bitterly. Then, he disappeared using Return. The other mercenaries disappeared one by one. I couldn’t blame them. Once the demons occupied the Imperial Palace, they would be coming for us next. It was the correct choice to go back as quickly as possible.</p><br/><p>In the end, only Ludia and I were left in the field. Our surrounding was strangely quiet, almost as if something would suddenly pop out.</p><br/><p>“Alright… In that case, I’ll stay by your side. Even if you hate me, I’ll stay with you. I won’t hate you.”</p><br/><p>“I hate you, but… thank you… hic.”</p><br/><p>Ludia held me and cried silently. I patted her back, feeling a sense of unease. What would happen to the two of us? Would we be able to stay as friends? This dangerous relationship, will it be able to hold on without crumbling down?</p><br/><p>Embracing her, that was all I could think about as she cried.</p><br/><p>“Shina’s corpse. Burn it.”</p><br/><p>Once she stopped crying, that was the first thing Ludia said. She was still clinging to my arm. I couldn’t joke around like I usually would.</p><br/><p>“Please, get rid of the traces of Shina.”</p><br/><p>“… I’ll do it.”</p><br/><p>When I was about to burn her corpse, a voice rang out behind me. Now that I thought about it, there was someone here. It was Bellode. I was wondering where he was, but he had been collapsed on the ground the entire time after being hit by the summoner. Did he just wake up and realize what happened…? I suddenly felt sorry for him.</p><br/><p>“I want to send her off… Please, Your Highness.”</p><br/><p>“Bellode… Fine. You can do as you’d like.”</p><br/><p>Ludia made a surprised expression, but soon nodded her head with a bitter expression. Bellode nodded respectfully, then slowly took out his sword. Fire then enveloped his sword. Just like how Peruta Circuit manifested whirlwinds, he could turn his mana into flames that burned everything.</p><br/><p>“Your Highness… May you rest well.”</p><br/><p>The flame he sent flying landed on Shina’s split corpse. As her corpse was burning, we silently watched, while Bellode cried.</p><br/><p>Once Shina’s corpse had burned to ashes, Bellode turned around and respectfully bowed to us… No, he bowed to Ludia.</p><br/><p>“I’m glad you’re safe, Your Highness. I should have asked for your safety first. I apologize for stepping out of line.”</p><br/><p>“I forgive you, Bellode… And I’m no longer the Crown Princess. I will throw away my status as royalty.”</p><br/><p>“Your Highness!”</p><br/><p>“Bellode, there’s no time… You should abandon the Luka continent.”</p><br/><p>She was concise.</p><br/><p>“There’s no hope left here. If you don’t want to die with Shina, immediately run away to the dungeon. You’re in a guild.”</p><br/><p>“But, Your Highness…!”</p><br/><p>“Bellode, go. Next time you see me, don’t call me Your Highness. This continent… is over.”</p><br/><p>[Party member Palludia Gren Ehuir has been changed to an independent explorer. With her consent, you can Return to Earth with her.]</p><br/><p>With trembling eyes, Bellode looked at Ludia, then turned to look at Shina’s ashes, which began to scatter into the wind. He bit his lips, turning back around and bowing deeply to Ludia. Then, he disappeared. He had gone to the dungeon. Seeing him disappear, Ludia leaned in my embrace without strength.</p><br/><p>“I’m tired… I want to rest.”</p><br/><p>I could feel the weight of her entire body leaning on me, making me realize to my bones how weak she had gotten.</p><br/><p>I couldn’t let her leave to the Residential Area like this.</p><br/><p>“Ludia, do you want to… come to Earth?”</p><br/><p>At my question, Ludia opened her eyes widely in shock. Then, she nodded her head. Her complexion was brighter than before. I was worried that she might not like it, but I felt relieved. Even if she returned to the Residential Area now, it would be bad for her.</p><br/><p>However, Luka continent would not let us leave so easily.</p><br/><p>[Savior, Hero. For what reason have you arrived at this fallen world?]</p><br/><p>I knew instinctively. This showy voice belonged to the Demon Lord. Just by hearing the voice, Ludia shook uncontrollably and clung to me. As I turned around, I also trembled from the presence I could feel with my entire body.</p><br/><p>In the sky, there was a bat.</p><br/><p>[Do forgive me for being rude and not seeing a guest with my real body. But my real body is currently in deep sleep to accept the world’s power.]</p><br/><p>“You’re talking about the power you obtained by killing this world’s Hero?”</p><br/><p>[That’s right, Hero. Did you enjoy the game? My concubine should have entertained you.]</p><br/><p>“It was distasteful. You aren’t very good at greeting your guests, Demon Lord.”</p><br/><p>[Huhuhu… You say rather interesting things, other world’s Hero.]</p><br/><p>The bat continued.</p><br/><p>[Last surviving Princess, come to me. You were the one I wanted from the beginning. If you become mine, everything you ever wanted will be yours.]</p><br/><p>“In the name of Mitarus, go kill yourself.”</p><br/><p>Ludia spat. Looking at the Demon Lord’s familiar, her eyes were burning with fear and rage. I decided that it would be the best to stop Ludia from seeing the Demon Lord.</p><br/><p>[Oh, how unfortunate. But even the Hero holding you so reliably will soon die. In the end, Heroes are only scapegoats. With a few petty blessings, they are forced to fight against us.]</p><br/><p>“Return!”</p><br/><p>I used Return. Immediately, the surrounding scenery became distorted and melted down.</p><br/><p>Before we realized, Ludia and I were in my house on Earth. As Ludia was staring at me blankly, I smile softly and spoke.</p><br/><p>“Demon Lord that son of a bitch, do you think we made him mad by leaving in the middle of him talking?”</p><br/><p>“… Yeah.”</p><br/><p>Still with blank eyes, Ludia nodded. Suddenly, she laughed. Looking at her, I also bursted out into laughter.</p><br/><p>Demon Lord 0, Kang Shin 1. I had gotten my first victory over him.</p><br/><p>Author’s note:</p><br/><p>Shin: Demon Lord, I don’t want any information from the likes of you! Stay in Luka continent!</p><br/><p>Ludia: Living together… I accepted it without much thinking, but we’re living together…!</p><br/><p>Shuna, who just woke up from the 2nd floor of Ludia’s house: Eh…? Why do I feel like everyone forgot about me…? Ludia, hurry up and come back T.T</p><br/><p>If Ludia looked mentally shaken throughout this entire arc, yes, that’s what I was going for. She’s in a light mental illness. I tried hard to convey it properly; this chapter was even harder than the last. Breaking things is easy, but portraying emotion is really hard… T.T I hope the readers liked it.</p><br/>\n</div>"}