{"title": "Chapter 137. The Third Explorer (1)", "id": 137, "volume": 2, "url": "http://boxnovel.org/infinite-competitive-dungeon-society-chapter-137-the-third-explorer-1", "volume_title": "Volume 2", "body": "<h1>Chapter 137. The Third Explorer (1)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 137. The Third Explorer (1)</p><br/><p>Using Return, we left the Antelope Canyon without anyone knowing. With what happened in Britain, people surmised that Thunder Knight and the Flame Witch had an ally that could use mass teleportation.</p><br/><p>What was more troubling was that even in all the chaos, someone filmed us fighting the Flame Drake and spread it for the world to see. Perhaps… No, I was certain. It had to be Ciara Kenex’s work.</p><br/><p>All I did was to fight the drake on a black winged wyvern, so why were alll the channels on TV talking about Thunder Knight? In fact, because I defeated the drake on a wyvern, my name had changed from Thunder Knight to Dragon Knight.</p><br/><p>All countries focused on Dragon Knight’s identity and were shocked by Dragon Knight’s strength. The fact that I was the strongest ability user seemed to be going around like an undeniable truth.</p><br/><p>To be honest, it was very troubling. It really felt like it wouldn’t be weird if an organization was made. Thinking about how more troubling things would become if my identity became known, I vowed to hide myself more thoroughly.</p><br/><p>My father, of course, looked at me with envy. He was the world’s greatest in terms of being unable to act his age.</p><br/><p>“Kuu, I’m going to obtain a god’s true name too, son!”</p><br/><p>“Go ahead. Do you want a hint? I told you before, right?”</p><br/><p>“I could have missed something! Repeat it for me!”</p><br/><p>I doubted hearing it for the second or third time would help, but when I explained all the circumstances where I obtained a god’s true name, father let out air through his nose and ran to the dungeon. Didn’t you say you were trying to make a breakthrough in your spearmanship? What happened to that, father?</p><br/><p>In addition, with this incident, mother had found out about Ye-Eun and Hwaya as well. Although Yua already knew about Ye-Eun and Hwaya, when she saw them on TV, she seemed even angrier.</p><br/><p>As Ludia lived a disciplined life, she fell asleep at 10, and at the latest, 11. After she started climbing the dungeon, she stopped clinging onto me 24/7. Now, she only held me until she fell asleep and shouted my name when she woke up, so I was quite free from… Eh? Why did I feel like nothing changed?</p><br/><p>In any case, with Ludia asleep, I was being interrogated by mother and Yua.</p><br/><p>“So son, of the three of them, who’s the real one?”</p><br/><p>“None. They’re all friends. Just friends.”</p><br/><p>“Don’t they smack you every time you say that?”</p><br/><p>How did she know!? When I opened my eyes widely, Yua let out a deep sigh, while mother laughed hysterically.</p><br/><p>“Ahaha, that’s so funny! I thought my son would die without ever dating a girl. When did he get so skilled? Not to mention, they’re all so beautiful. Ehew, you’re going to make my mouth rip from smiling too much.”</p><br/><p>“Why is Mom so happy? I won’t give oppa to women like them. Never!”</p><br/><p>Yua shouted, then stomped up the stairs to her room. I was confused, but mother chuckled and spoke.</p><br/><p>“It’s about time Yua graduated from her oppa too. I’m happy that you guys have such good relationship, but it’s too much to be honest. You should really settle on one quickly. I won’t say anything if you get married to Ludia now. To be honest, she’s the most fair. Her personality too… Other than the fact that she relies on you a bit too much, she’s kind. Although she can’t cook yet, she’s good at cleaning and doing the laundry.”</p><br/><p>It felt weird hearing someone say that Ludia was kind. Well, since mother only met Ludia recently, it wasn’t… Wait, what? Marrying Ludia? I sweated and explained to her.</p><br/><p>“Mom, I’m only 21 now. What do you mean settle down… And Ludia? Not Palludia?”</p><br/><p>“That’s what she asked me to call her. Isn’t it nice? It’s more friendly! Ah, that’s not what’s important! You shouldn’t feign ignorance when a girl is openly telling you her feelings. That’s the best way of getting hated!”</p><br/><p>“I properly declined them!”</p><br/><p>“What? Declined? Ehew, you don’t know how lucky you are. Ah, wait!”</p><br/><p>I forcefully ended the interrogation.</p><br/><p>If Dark Wing Lotte was living anywhere near our house, my identity would be revealed to the whole world in a moment. As such, I moved her to the dungeon. Instead of the cramped mansion (there was a new resident in the garden named Flame Drake), she was in a better place. It was Resting Place of the Angels.</p><br/><p>[Wow, it’s Shin!]</p><br/><p>The moment I arrived, Plene noticed me instantly and ran to my embrace. As it happened every time I met Plene, I had somewhat gotten used to her the softness of her body. Though, it was a lie… I mean, Plene’s attire was too light!</p><br/><p>[Are you sleeping? What do you want to eat? Should I catch you a fish?]</p><br/><p>Like her name suggested, Plene[1. Her name comes from Planetarium!! I finally found out this chapter. That said, I’ll still stick with Plene since that sounds like (P-Leh-Neh), while Plane (sounds like plane as in airplane).] shaped her eyes like stars and looked at me, making it hard for me to decline. However, I first asked her about the new resident.</p><br/><p>“Where’s Lotte?”</p><br/><p>[I don’t know. She hates me. She keeps flying around.]</p><br/><p>“Hmm.”</p><br/><p>Plene took the chance to complain about Lotte as she clung to me. Thinking the way Plene liked to cling was exactly the reason why Lotte didn’t like her, I waited for Lotte to come. As I thought, it seemed Lotte could sense my presence too, as she soon flew down and landed with her wings folded. She was big no matter how many times I saw her.</p><br/><p>[Are we going somewhere to fight, Hero?]</p><br/><p>“No, you can rest a bit more. You too, Plene. When dungeons start appearing on Earth, you’ll both get busy.”</p><br/><p>[I’ve been expecting it ever since I joined Hero’s side. Once we killed that drake, it became too late to turn back. I will follow Hero.]</p><br/><p>[Mmm, I like Shin, so I’ll protect the people Shin likes! Monsters are bad, so I’ll beat them up!]</p><br/><p>Lotte then looked down at Plene and snorted.</p><br/><p>[You are also a monster. I can’t believe what you’re saying, just because you fell heads over heels for a man.]</p><br/><p>[Eeeek! But you like Shin too!]</p><br/><p>[I only kneeled at the difference in our strength. Since I swore I would follow him, I would continue to do so, but that is it.]</p><br/><p>[Liar, liar! You like Shin too! Loretta said Taming won’t work if you don’t like Shin!]</p><br/><p>[You biiiiitch!]</p><br/><p>If they really fought, Plene would easily lose, so I had to protect her as I calmed Lotte down.</p><br/><p>“Guys, don’t fight and train your abilities. Please.”</p><br/><p>[Okay! Got it!]</p><br/><p>[Tsk… If it’s Hero’s request, there’s no choice.]</p><br/><p>When I patted their heads, Plene was openly happy, while Lotte smacked her tail on the ground strangely. At least, it seemed she didn’t hate it.</p><br/><p>Now that I was done with checking out how things were in the Resting Place of the Angels, I had to return to my everyday schedule. Of course, that only meant one thing for me.</p><br/><p>It was dungeon exploring!</p><br/><p>… For the record, there was a very simple reason that I didn’t bring Lotte and Plene along to explore the dungeon. For Plene, monsters on the ordinary floors weren’t strong enough for me to need her, and monsters that were strong could resist Plene’s ability easily.</p><br/><p>Simply put, Plene was still too weak. Thankfully, it seemed she was content with just singing in Resting Place of the Angels. Although she was continuously growing her ability, she was still too weak to bring to real fights. That said, I suspected that I’d need to borrow her ability soon on Earth.</p><br/><p>As for Lotte, I tried to bring her along once, but she was too big to freely fly in the dungeon. It was quite unfortunate. As such, I had to break through the 51st floor on Ruyue’s back.</p><br/><p>Before then, however, I wanted an answer from Loretta.</p><br/><p>“Yes, Shin-nim. There’s… 20 years left.”</p><br/><p>“For what?”</p><br/><p>At Loretta’s response, I asked her again naturally. With a face on the verge of crying, she answered.</p><br/><p>“Until Earth’s protective barrier disappears and all monsters realize that Shin-nim is the monster.”</p><br/><p>“There’s 20 years… until then?”</p><br/><p>“Yes.”</p><br/><p>‘Wait… Hold on.’ I put my hand on my forehead.</p><br/><p>Wait, what? 20 years? When I asked Loretta about it before, why did she use an expression like ‘a little while longer’? Don’t tell me she’s joking right now? No, but she looks like she’s about to cry!</p><br/><p>“Is it really 20 years?”</p><br/><p>“Yes. There’s only 20 years left… I’m sorry. This is why I didn’t want to tell you…”</p><br/><p>“Loretta, how old are you this year?”</p><br/><p>“Yes, I’m two thou… Kyak! Rude, how rude! Why are you asking me that so naturally? I almost answered you!”</p><br/><p>“Huk!”</p><br/><p>Loretta screamed. The punch she sent out glazed past my nose. What? Two thousand…!? This elf that looked younger than me was at least two thousand years old!? Of course, I couldn’t ignore the digits that followed. But, I see… With that, I understood.</p><br/><p>No matter how much medical science had advanced, humans currently could not live past the age of 150. Although 20 years were long for humans, for Loretta who lived for over 2 thousand years, 20 years could be relatively short.</p><br/><p>In any case, now that I knew, strength left my body. I fell on the ground in panic, and Loretta sat down next to me. She sobbed for a bit, and after seeing that I had fallen down, she blinked her eyes and looked at me.</p><br/><p>‘Sh, Shin-nim? Did my punch hit you? Oh no, it must have hurt a lot!”</p><br/><p>“If you think it’ll hurt a lot, don’t swing your fist around… And don’t worry, I wasn’t hit. I was just… relieved.”</p><br/><p>“Eh? Relieved?”</p><br/><p>Loretta tilted her head adorably.</p><br/><p>“How can you be relieved, hearing that there’s only 20 years left?”</p><br/><p>“Well, if I have 20 years, I should be able to reach the end of this dungeon. No, I will do so for sure.”</p><br/><p>“…”</p><br/><p>Finding Loretta’s stupefied expression cute, I laughed again. However, hearing my laughter, Loretta let out a dry cough and spoke with a stern expression.</p><br/><p>“Shin-nim, this dungeon was here before I was even born. Back then, although the method of climbing was a bit different, the difficulty wasn’t too different.”</p><br/><p>“You mean two thou…”</p><br/><p>Something flashed before my eyes and a deep hole appeared in the dungeon’s wall. Even my Heroic Strike could only leave a tiny gap in the wall!</p><br/><p>Loretta smiled sweetly, and I forced myself to smile back.</p><br/><p>“What did you say, Shin-nim?”</p><br/><p>“1, 17 years ago maybe? Was that when the dungeon was created?”</p><br/><p>I answered as I sweated. Loretta looked satisfied at my answer.</p><br/><p>“Huhu, the dungeon was created long before I was born. In any case, many people challenged the dungeon during this time, but only three people managed to reach its end.”</p><br/><p>“But Ellos said no one had succeeded… Though, Loretta would know more about it.”</p><br/><p>“Huhu, he’s also right. After the dungeon changed to the method it now has, no one has managed to conquer the dungeon. To be honest, the past method was much easier and lax. Because of that, there were errors between achievements and the blessings given out, causing more worlds to… No, never mind. There’s no need to think about it.”</p><br/><p>‘I can hear you perfectly, though…’ I grinned, and Loretta also grinned. However, she was back to her stern expression in the next moment.</p><br/><p>“The dungeon is strict. It is not a place that wantonly gives out strength to people. Shin-nim, are you saying you will conquer the dungeon in only 20 years?”</p><br/><p>“yes.”</p><br/><p>“In that case, there’s something else Shin-nim should know.”</p><br/><p>‘What is it?’ When I tilted my head and asked, Loretta spoke with a stiff voice.</p><br/><p>“Does Shin-nim… still think that First Dungeon is the most difficult dungeon?”</p><br/><p>Author’s note:</p><br/><p>ICDS will continue for the next 20 years! (Lies)</p><br/><p>If things will be peaceful for 20 years, I wouldn’t have brought up the Hero so early on, right? ^^</p><br/><p>Look forward to the future development, everyone!</p><br/>\n</div>"}