{"title": "Chapter 154. Crimson Chaotic Spear (4)", "id": 154, "volume": 2, "url": "http://boxnovel.org/infinite-competitive-dungeon-society-chapter-154-crimson-chaotic-spear-4", "volume_title": "Volume 2", "body": "<h1>Chapter 154. Crimson Chaotic Spear (4)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 154. Crimson Chaotic Spear (4)</p><br/><p>For a month, Hwaya led the other guild members to clear Event Dungeons, and 20 days passed since I joined in. There were now only 48 Event Dungeons left in the world.</p><br/><p>“Just my bonus stats are over 150. I have a lot of skill points saved up, too.”</p><br/><p>Sitting in a New York hotel, I looked at my status.</p><br/><p>[Name: Kang Shin Race: Human Sex: Male</p><br/><p>Class: Elementalist (Sub – Skill Collector, Tamer) Title: Zeus Rank: Gold 9</p><br/><p>Level: 54</p><br/><p>HP – 43,820/43,820 MP – 35,460/35,460</p><br/><p>Strength – 215(+111) Dexterity – 205(+79) Constitution – 194(+66)</p><br/><p>Intelligence – 32(+59) Magic – 200(+109) Charm – 87(+99) Luck – 39(+49)</p><br/><p>Normal Skills – High-rank Martial Arts (Lv 6), Peruta – Mad Typhoon (Lv 1), Mid-rank Crossbow Marksmanship (Lv 9), Mid-rank Gale Track (Lv 2), Mid-rank White Lightning Consecutive Strike (Lv 4), High-rank Heroic Strike (Lv 2), High-rank Provoke (Lv 5), Divine Speed (Master), Return (Lv 4), Heavy Armor Mastery (Lv 5), Mid-rank Dash (Lv 7), Peruta Circuit (Lv 8), Soul Guard (Lv 8), Dimensional Travel (Lv 1), Overwhelm (Lv 2), Deific Manifestation, Death Counter, Riding</p><br/><p>Class Skills – High-rank Spirit Mastery (Lv 2), High-rank Spirit Aura (Lv 9), Mid-rank Elemental Control (Lv 9), Mid-rank Elemental Contract (Lv 9), Mid-rank Thunder Tempest (Lv 2), Mid-rank Elemental Blade (Lv 8), Mid-rank Elemental Tempest (Lv 8), Thunder Beast (Lv 3).</p><br/><p>Subclass Skill – Endow Skill, Taming (Lv 3), Spirit of the Collector, Spirit of the Tamer (Lv 3)]</p><br/><p>[Speed +45%, Strength +40%, Charm +15%]</p><br/><p>[148 Event Dungeon clears, 9 Event Raid clear. Accumulated bonus stats: 195]</p><br/><p>[Current skill points: 21]</p><br/><p>No matter how generous I was, these were not the stats a level 54 explorer should have. Walker, who had cleared Event Dungeons with me for the past 3 weeks, only had half of my total stats. In addition, I currently could not bring out the full potential of my stats. After all, my stats had gone up by over 150 in the past few weeks. I could constantly feel my body getting stronger and adjusting itself, but I did not know when it would end.</p><br/><p>“Did you sleep well, T.K.?”</p><br/><p>“Hey, Pepper.”</p><br/><p>I put my mask on just in time and replied to Pepper with a sigh. Then, I got up from my bed. Pepper was standing in front of the opened hotel room door.</p><br/><p>“Don’t be so bland! It’s our reunion! Then again, it’s been too soon.”</p><br/><p>“I didn’t think I’d see you again so soon either.”</p><br/><p>I retorted unenthusiastically and drank some water. Pepper looked around the door and blurted out in surprise.</p><br/><p>“What, the blonde miss isn’t here?”</p><br/><p>“Don’t think Ludia is always sleeping with me. She’s calmed down a lot. Plus… Wouldn’t it be more of a problem if she was here? You would have just walked into the two of us.”</p><br/><p>“You’re right! I was just too excited for today! It’s today, right?”</p><br/><p>“Yeah, it’s today. I don’t know who, but you sure have a good informant.”</p><br/><p>After finishing my water, I slammed down the cup on the table and twisted the corner of my mouth up.</p><br/><p>Right, today was the day we entered the SS ranked dungeon in Lower Eastern Manhattan.</p><br/><p>“T.K., as you already know, America suffered a lot from Antelope Canyon’s dungeonification. Because of it, they’ve thought a lot more about gates than other countries. This time, when the gates appeared in mass, they already decided to destroy all gates, even the lower-ranked ones.”</p><br/><p>Pepper explained as the two of us went on the hotel’s elevator.</p><br/><p>“The fact that Team Revival was working to destroy gates also influenced them. You know about it, right? That day… we owed a huge debt to all of you.”</p><br/><p>“Debt, you say…”</p><br/><p>I naturally thought about Ciara, but that wasn’t what was currently important. I let Pepper continue.</p><br/><p>“You see, America actually has this amazing ability user. She’s a daughter of an esteemed family, and she can tell if a large monster will appear when a gate disappears.”</p><br/><p>He began to talk about her.</p><br/><p>“With her help, we began destroying the gates where giant monsters wouldn’t appear. Guardian, Freedom Wing, and rogues all worked with the same goal in mind. Of course, we didn’t have the time to destroy all of them. We really have to thank you for helping us destroy them.”</p><br/><p>“For such a large country, America didn’t have that many gates. Plus, monsters appeared from two of them.”</p><br/><p>Thankfully, America’s Guardian had already told us about it. As thanks, we sold them monster corpses for a cheap price. This way, it would be a fair give and take.</p><br/><p>When they told us that they knew where boss monsters appear, I already suspected Ciara had a hand in it, but I didn’t think she was so deeply involved. It seemed she was doing her best for her country as well.</p><br/><p>… If only she would continue to do so.</p><br/><p>“Good morning. Eh, Pepper’s here too? Don’t tell me, he really is…”</p><br/><p>“I was surprised seeing his face so early in the morning too.”</p><br/><p>“Glad to see you’re healthy, Flame Witch! Anyways, T.K., to cut to the chase, America is very supportive of you guys. We empathize with your cause and we want to help you! Many Americans are touched by your bravery to go into an SS ranked dungeon, too! So, as an SS ranker, I can’t miss out, can I? If I did, I would be losing my honor as a Guardian! That’s why I’m here!”</p><br/><p>“We’re just doing what we can.”</p><br/><p>“Ku, how cool, T.K.!”</p><br/><p>Listening to Pepper’s somewhat sarcastic praise, I joined the others. As we didn’t want to go into an SS ranked dungeon when we were tired, we each took some time to rest and check over our equipment and potions. We also cleanly used up the bonus stats we got. After a day, we were in our peak condition.</p><br/><p>Even Shuna, who was the weakest among us, could just barely be considered an SS ranker in terms of physical ability. On the other hand, Hwaya and I, who were the strongest, could… probably only be described as SSS rank.</p><br/><p>“Is everyone ready?”</p><br/><p>“Yes!”</p><br/><p>“I got changed and I’m all ready to go!”</p><br/><p>“Well, I feel like I won’t die anytime soon.”</p><br/><p>“I’m looking forward to it.”</p><br/><p>Everyone seemed to have done maintenance on their equipment, as they were shining. As for me, I looked incredibly suspicious with Otus’ Secret, ordinary shorts, and a t-shirt. However, I had several rings on my fingers and a bracelet that changed into a sturdy set of armor whenever I injected mana into it. On my ears were fancy earrings, and two chokers on my neck. It was then that I realized something…</p><br/><p>“… Don’t I look like a delinquent?”</p><br/><p>“No, thanks to your mask, you only look like a weirdo.”</p><br/><p>“Damn it!”</p><br/><p>“But with your handsome face and good body, you look okay.”</p><br/><p>“That’s not a compliment!”</p><br/><p>The SS ranked dungeon was located in a park in Lower Eastern Manhattan. Because the gate appeared right at the entrance of the park, the entire area became off limits and the most elite Guardians were protecting it. Although Guardian and Freedom Wing rankers planned to enter it initially, they gave up after we stepped in.</p><br/><p>To be honest, even if we didn’t come, it was uncertain whether they would actually get organized enough to go in. After all, they were still having trouble clearing S ranked dungeons. Only two S+ ranked dungeons had been cleared by groups other than Revival. It went without saying that the other SS ranked dungeon in Russia was also left alone.</p><br/><p>“The dungeons’ difficulty is growing faster than ability users.”</p><br/><p>Hwaya said bluntly.</p><br/><p>“I don’t know when another wave of Event Dungeons will come, but at that time, an SS+ ranked dungeon might appear. One day, even an SSS ranked dungeon might appear.”</p><br/><p>To prevent that from happening, we had to let ability users grow. The easiest way to do that was… I glanced at Pepper. If it was him, I felt like I could trust him.</p><br/><p>I asked Hwaya for her opinion through eye contact, and she shrugged in response. It meant it wouldn’t hurt to try. I immediately asked Pepper.</p><br/><p>“Hey, Pepper. Do you want to join our team?”</p><br/><p>“Oh? You guys are recruiting? Sorry, T.K. America would be in danger without me, hahaha! But I like you and your friends, so we can talk about it again when another SS ranker appears in America!”</p><br/><p>“Yeah, take your time.”</p><br/><p>As I expected, Pepper refused my offer. I didn’t blame him. He should prioritize his country. However, if he didn’t become our ally completely, we couldn’t appoint him as a dungeon explorer… Mmm, how troublesome. At that moment, Sumire stepped up.</p><br/><p>[If you’re hesitant to appoint him to the First Dungeon, how about the Second, Shin-nim?]</p><br/><p>[No, Sumire, that’s…]</p><br/><p>[I feel like he’s trustworthy. Shin-nim thinks so too, right?]</p><br/><p>[I do… but…]</p><br/><p>There weren’t many ability users like Pepper, who was pure and strong. He had a good personality. Even so, we didn’t watch over him for a long time, and if he decides to say anything about it…</p><br/><p>Hwaya then spoke.</p><br/><p>[Soul Contract.]</p><br/><p>[Ah!]</p><br/><p>[Uuuk… You cruel bastards, kuk! I remembered it again, kuuk!]</p><br/><p>Soul Contract cost 500,000 gold. Although it originally cost 1,000,000 gold, neither were prices I couldn’t afford. I couldn’t say it was a small amount, but with the First Dungeon and Beyond, it would be easy to make that much.</p><br/><p>“Pepper, I want to make an offer.”</p><br/><p>“Man, thank you for thinking so highly of me, but persistent men are hated!”</p><br/><p>“I want to give you something as a temporary member.”</p><br/><p>“… Temporary member?”</p><br/><p>“Yeah, we can talk again after the dungeon. How about it?”</p><br/><p>Pepper looked to be in thought. Soon, he nodded.</p><br/><p>“Alright, since my friend is thinking about me so much, I can do that much.”</p><br/><p>“Good. Then let’s focus on the dungeon from now.”</p><br/><p>I smiled and led the crew to the dungeon. However, my mood soon plummeted. The met the one person I didn’t want to meet.</p><br/><p>[Hero-nim, I wanted to see you!]</p><br/><p>This person that called me Hero. Plus, she was the only one on Earth who could randomly contact people with telepathy. Ciara Kenex. Wearing a see-through dress and surrounded by countless guards, she was waiting for us near the SS rank gate. I wanted to go back home immediately, but I held myself back.</p><br/><p>“I didn’t really want to see you.”</p><br/><p>[Can you make some time for me? We can talk over a cup of tea.]</p><br/><p>“No.”</p><br/><p>[Then I’ll be rude and steal a bit of Hero-nim’s time here. Please forgive me.]</p><br/><p>“I won’t.”</p><br/><p>Even at my blunt rejection, Ciara didn’t even blink. No, she had her eyes closed anyway. Her voice didn’t shake at all. No, it was telepathy. Mm. She used telepathy as if she wasn’t fazed at all.</p><br/><p>[You became more reliable and imposing since the last time I saw you. You also became extremely strong. In such a short time… Although I can’t see with my eyes, I can tell.]</p><br/><p>“How sad.”</p><br/><p>[I heard about Hero-nim’s accomplishments. They were truly hero-like. My eyes weren’t wrong. You really are perfect!]</p><br/><p>“Knowing that what I did is to your liking makes my stomach churn.”</p><br/><p>It was hard to refute what she was saying. I had to use the influence my name had in America. Even though I told Ciara I wouldn’t do as she wanted, I ended up using the fame she helped create.</p><br/><p>However, I also couldn’t deny that it was the best choice. At the very least, I was confident that the method I chose produced the least amount of sacrifice.</p><br/><p>[Hero-nim created conflict within Guardian and is becoming renowned throughout the whole world. Even without my help, Hero-nim could create a worldwide organization of ability users!]</p><br/><p>“Their conflict has nothing to do with me. In addition, I’ll refuse anyone who asks to work for me.”</p><br/><p>[I was too insolent. I acted as if Hero-nim needed my help when Hero-nim is already outstanding… I finally understand. I just want to do what I can by Hero-nim’s side. I only want to protect Earth against the danger it faces, and unite ability users to a single organization. That is all I want. Though, if Hero-nim would let me give birth to a child, I would be extremely happy…]</p><br/><p>This girl was insane. Completely insane. She wasn’t even listening to me.</p><br/><p>“I’m going to say it again. I have no plans to accept such heavy responsibilities. I’m going to continue doing what I can, protecting myself, my family, and friends. I can’t confidently say I’ve been doing that, but at least from now, that’s what I’ll do.”</p><br/><p>‘Though, the number of friends I have to protect have been increasing recently…’</p><br/><p>When I was done talking, it seemed Ciara had paid attention to me this time, as she smiled. Even though she couldn’t see, she looked at me accurately. It was kind of frightening.</p><br/><p>[Huhu, I can’t wait. The world will be saved by Hero-nim, and dirty humans’ conflicts will disappear under Hero-nim’s rule. And I… Yes, I would like to think of our child’s name beforehand!]</p><br/><p>It seemed world domination was the goal she had in mind for me. I was sincerely disgusted by Ciara’s ecstatic expression and shouted.</p><br/><p>“I will never, ever, never, ever, never get in a relationship with you, not even if the world ends and we’re the only two people left in the world. If you want me to be more straightforward, I will. Nothing will happen between us even if I have to die!”</p><br/><p>At my shout, people began to clap. Other than Pepper, all of the members of Revival were clapping.</p><br/><p>“Yep, I recorded it. I’ll make Ludia listen to it while she’s sleeping.”</p><br/><p>“Don’t even think about it!”</p><br/><p>I took the recorder from Hwaya and also shouted at Ciara.</p><br/><p>“If you’re done, screw off!”</p><br/><p>[C-Can I have your contact information?]</p><br/><p>“Never.”</p><br/><p>[But sometimes, I want to hear Hero-nim’s voice…]</p><br/><p>“Don’t talk like a kidnapper and screw off!”</p><br/><p>[T-Then, can I call you next time? Thank you! You really are kind!]</p><br/><p>Now that I thought about it, she already knew my address! This girl only asked me to get my permission, and she was pretending that I did when I didn’t! For a moment, I got curious as to how she’d call me since she wouldn’t be able to use her telepathy over the phone, but I felt like asking her would only make the situation worse. As such, I chased her and her guards out with a little show of force.</p><br/><p>[Ah, if you destroy this gate, a giant monster will appear! Be careful, Hero-nim!]</p><br/><p>“I’m not thankful at all!”</p><br/><p>Just like that, the nine of us (with the addition of Leon Pepper) came to challenge the SS ranked dungeon. Although my physical condition was best, my mental condition was… This was all Ciara’s fault!</p><br/>\n</div>"}