{"title": "Chapter 151. Crimson Chaotic Spear (1)", "id": 151, "volume": 2, "url": "http://boxnovel.org/infinite-competitive-dungeon-society-chapter-151-crimson-chaotic-spear-1", "volume_title": "Volume 2", "body": "<h1>Chapter 151. Crimson Chaotic Spear (1)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 151. Crimson Chaotic Spear (1)</p><br/><p>When we finished cleaning up the remaining dungeons in Korea, it was 11 A.M. Event Raids did not occur once. According to Hwaya, the chance of an Event Raid happening wasn’t that high. Although it was best for everyone’s safety that they didn’t occur, but I would have liked one so we could clearly show our skills to the masses.</p><br/><p>We were currently in Hwaya’s private plane. Although it would have been overwhelmingly faster to travel on Lotte, we all needed rest after clearing 4 S and S+ ranked Event Dungeons. Right when I was about to get some sleep, a thought crossed my mind.</p><br/><p>“Let’s go over the rewards.”</p><br/><p>We promised to sell monster remains we got from A ranked or below dungeons to Korea for a cheap price. It was the same for monsters from S ranked or above dungeons, though we would selectively sell only a portion of them. I had no business with the corpses that were taking most of my inventory space. I did, however, have business with the rewards from the two S ranked dungeons and S+ ranked dungeons.</p><br/><p>The first was the Deathblood Ring. Although the stats it gave wasn’t bad, what was more important were its effects. A 2% chance to steal 10% of the enemy’s mana, and a 1% chance to use 5% of my HP to put blood contamination status effect on the enemy. While I was clearing the other three dungeons, I felt elated every time the mana steal effect activated, but unfortunately, the blood contamination effect never activated. I was curious what it would do.</p><br/><p>The second reward was a Half Elixir I got from an S rank dungeon. I considered choosing a weapon to feed to Gluttony Spear, but since its growth was at 99.9%, I decided to just go with the consumable. Even if I was on the brink of death, the Half Elixir would restore 50% of my HP and MP and cure me of all status effects. I already had a few emergency life ropes, but it wasn’t bad to have another one.</p><br/><p>The third reward was a battle sword I got from the second S rank dungeon. There was no need to describe it. It was Gluttony Spear’s food.</p><br/><p>Since none of us obtained much from this dungeon, we cleared the S+ rank dungeon with our cheeks puffed. This dungeon was amazing. Humanoid monsters appeared in this dungeon, and its boss was actually a group of 10 hunters. They each used different weapons as well. In other words, the rewards had variety to them! As it was an S+ rank dungeon, they were also extremely valuable.</p><br/><p>The reward I got was…</p><br/><p>[Perfect Hunter (Epic)</p><br/><p>Durability – 360/360</p><br/><p>Equipment Requirement – Strength +150, Dexterity +150, Magic +150, Mid-rank Crossbow Marksmanship</p><br/><p>Options – Strength +15, Dexterity +15, Magic +15, Adds wind attribute to attacks using bolts, Attack Speed +20%, Automatic Reloading, Can create Mana Bolts with 10 MP</p><br/><p>Skill – Invisible Shooter: Your bolts become invisible, and their sound and presence disappear. Added 30% bonus to speed and attack power.]</p><br/><p>It was a crossbow that drew the jealousy of all party members. It was the only Epic-grade item that dropped from this dungeon. Though it was an Epic item, it wasn’t showy. It was made out of some black metal and looked rather coarse, but it still could not hide its luxurious aura.</p><br/><p>I realized it with Hwaya equipping her Orb. It seemed this crossbow was being treated as a sub-weapon. Just by having it hanging by my waist, it raised my stats. The precious strength, dexterity, and magic stats had all gone up by 15. I really wanted to give this crossbow a kiss.</p><br/><p>“I’m done with going over the items, so what should I do now…?”</p><br/><p>‘I feel like I was forgetting something… What was it?’ I tilted my head and looked around. It was rather quiet, as everyone was resting in their own way. I then caught sight of Walker.</p><br/><p>He had just woken up from sleep and was busy cutting and rearranging the rag he obtained from the Forest of Rage. I blinked and looked at Walker, trying to figure out why he had caught my attention. Then, I realized.</p><br/><p>“Walker, what about Yua?”</p><br/><p>“Today’s a school vacation.”</p><br/><p>Walker looked somewhat happy.</p><br/><p>“I got a phone call saying that I didn’t need to guard her today.”</p><br/><p>“… Phone call?”</p><br/><p>“From your mother! Don’t point your spear against someone’s neck!”</p><br/><p>“Sorry. You made an easily misunderstood expression, so I overreacted, haha.”</p><br/><p>“Just how much do you like your sister…!”</p><br/><p>“What are you talking about, all oppas love their younger sisters.”</p><br/><p>I puffed out my chest and declared proudly. Walker glared at me with the expression of a dead frog that was hit by BB gun pellets.</p><br/><p>“I should show you an example. Go see how Brightman treats his younger sister…”</p><br/><p>“He has a younger sister? I’d rather not meet her.”</p><br/><p>“I know what you’re worried about, but she’s different than what you think.”</p><br/><p>“No, I understand. Unlike her oppa, she’s extremely kind, right? That’s how it usually is in novels. Unfortunately…”</p><br/><p>“Sorry, but you’re completely wrong. What I meant was, she isn’t as childish as Brightman.”</p><br/><p>Walker snorted and said. His voice had become slightly higher.</p><br/><p>“Sophie doesn’t try to act cool like Brightman. She understands her position extremely well and is quite reasonable for her age. Plus, her entrepreneurial talent is much higher than her older brothers. Most everyone in the Brightman conglomerate agrees that the one who should lead the group should be Sophie, not Joshua.”</p><br/><p>“… Oh?”</p><br/><p>Why was I so quick-witted about these things? I grinned and asked.</p><br/><p>“You like her, right?”</p><br/><p>“… Don’t joke. I already told you, I grew up with Brightman. She naturally became a younger sister to me. Unlike Brightman, she didn’t consider me a servant… No, maybe she knew but didn’t treat me that way on purpose. After all, she hates the way Brightman orders people around.”</p><br/><p>Walker still had a serene expression. Was I wrong? I became uncertain, but it seemed Walker didn’t want to tell me the answer, as he turned away and went back to working on his rag. I felt like there was something more, but since he wouldn’t tell me, I reluctantly gave up.</p><br/><p>After becoming bored again, I opened my inventory to put Gluttony Spear awa… wait. What I was forgetting about was evolving Gluttony Spear!</p><br/><p>My mana was completely full, and we would arrive at Japan in 20 minutes. Since it would take time to fly to the Event Dungeons, I should have enough time to restore my mana!</p><br/><p>Good. I put Gluttony Spear down on the plane’s aisle. Because of its length, people might get hurt if I didn’t.</p><br/><p>“Let’s go.”</p><br/><p>I roused my mana and injected it into Gluttony Spear. Soon, it began to give off a crimson glow, which got more and more brighter as I injected more mana into it. Eventually, when most of my mana was injected, it gave off a similar brilliance as it did in the Forest of Rage!</p><br/><p>“W-What’s happening!?”</p><br/><p>“Wow…”</p><br/><p>I closed my eyes, then opened them back up. My spear had changed its appearance. The shaft became… slightly thicker? The spear blade was longer and sharper. It was completely red from the tip of the spear blade to the edge of the spear shaft, while strange engravings were inscribed onto it.</p><br/><p>[Crimson Gluttony Spear evolved to Crimson Chaotic Spear. A weapon that wasn’t completely absorbed has been accumulated as growth. Crimson Chaotic Spear’s growth: 47%]</p><br/><p>[Crimson Chaotic Spear (Legend)</p><br/><p>Durability – 450/450</p><br/><p>Attack – 7,000</p><br/><p>Equipment Requirement – Strength +150, Dexterity +150, High-rank Spear Technique</p><br/><p>Options – All stats + 10, Strength +25%. Adds ‘Chaos Flame’ attribute to basic attacks. Evolves by absorbing weapons. By injecting mana and chanting ‘Transform,’ it can be changed to its choker form. To transform it back into a spear, you can inject mana and pull it back.]</p><br/><p>Legendary. I see, so that’s the grade that came after Epic. Plus, its growth was already at 47% since it was unable to completely absorb a weapon before. It seemed like the Holysword was more amazing than I thought. Not to mention, even with these crazy stats, it could still evolve.</p><br/><p>I tensed and grabbed the spear. Instantly, my body was overflowing with strength. All stats increased, and my strength increased by 25%. It felt like the first time I obtained Zeus’ true name. I murmured, trying to quell the sense of omnipotence.</p><br/><p>“Do people on the higher floors all have weapons like this?”</p><br/><p>No, probably not all of them. I could tell instinctively that this wasn’t a weapon people can get just by climbing the dungeon for a long time. Even so, explorers on the highest floors should have Legendary weapons and maybe even Legendary equipment.</p><br/><p>Without a weapon like this, it must be impossible to break through the levels of the dungeon they were in.</p><br/><p>All in order to beat their world’s enemy, which might not be possible, even with such weapons.</p><br/><p>“Good. I’m calm now…”</p><br/><p>I planned on picking up my spear, but I changed my mind. It would be more convenient if I put it back in my inventory, but I would lose the strength I temporarily gained. Although there wouldn’t be a huge problem since it wasn’t too different from when it was Gluttony Spear, I couldn’t handle a weapon that would change my physical ability in such a way.</p><br/><p>I had to carry it around as much as possible to get used to it. I looked at Chaotic Spear’s option again. Transform… I already had a choker (translator). I hoped people didn’t think I had a strange hobby…</p><br/><p>I was quick to take action. I injected mana into the spear and quietly murmured, “transform.” The spear immediately transformed to a reddish-black choker, which I promptly equipped. As it was still treated as being equipped, my strength was the same. Looking at the mirror, I found that the two chokers didn’t look so bad together.</p><br/><p>At that time, Hwaya peeked her head out into the aisle. After seeing me, she asked.</p><br/><p>“Shin, what’s that choker?”</p><br/><p>“Something more important than my entire fortune.”</p><br/><p>“… What?”</p><br/><p>Hwaya’s face was full of question marks. However, she didn’t ask anything else. An in-flight announcement had flown out.</p><br/><p>[We will soon arrive at Japan’s Kansai Airport. Please make sure your seat belts are fastened.]</p><br/><p>Once we landed, I would be able to show Hwaya what it does. With a grin, I sat back down on my seat. After being emptied, my mana was slowly filling back up. I could feel that my body was itching for a fight.</p><br/><p>What kind of dungeons would Japan have? While drinking a Mana Potion, I thought of the dungeons that were waiting for us.</p><br/>\n</div>"}