{"title": "Chapter 156. Crimson Chaotic Spear (6)", "id": 156, "volume": 2, "url": "http://boxnovel.org/infinite-competitive-dungeon-society-chapter-156-crimson-chaotic-spear-6", "volume_title": "Volume 2", "body": "<h1>Chapter 156. Crimson Chaotic Spear (6)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 156. Crimson Chaotic Spear (6)</p><br/><p>Chapter 156. Crimson Chaotic Spear (6)</p><br/><p>“Hwaya, take care of them!”</p><br/><p>“B-Bees!? H-Hornets! … Huuua.”</p><br/><p>I heard something collapsing. Walker quickly reported.</p><br/><p>“Oi… Mastiford stopped moving.”</p><br/><p>“That’s not good!”</p><br/><p>I wanted to make Hwaya snap out of it, but the Asian giant hornets were too quick for me to afford to look away. I had to block the hornets while Hwaya was recovering.</p><br/><p>“Ruyue, please!”</p><br/><p>[Un! Crystal Cloud!]</p><br/><p>Ruyue’s elemental magic created countless crystals of ice in the air. Invisible particles formed a foggy cloud and continued to expand.</p><br/><p>“T.K., is this your ability? How amazing!”</p><br/><p>“It’s the ability of the wolf I’m riding. Her name is Ruyue. Keep watching, it’s only the beginning.”</p><br/><p>The swarm of hornets flying toward us entered the cloud. Immediately, they slowed down. The ice crystals had stuck to their bodies and wings, slowing them greatly. But that was only the beginning!</p><br/><p>“Peika, materialize!”</p><br/><p>[I’ve been waiting!]</p><br/><p>Spirit Aura was canceled, and a beauty wearing a black dress appeared in midair. She knew exactly what she had to do. With a smile on her face, she held a whip of lightning. I put a Mana Potion in my mouth and shouted.</p><br/><p>“Cook them all!”</p><br/><p>[Chain Lightning!]</p><br/><p>The crystal cloud covering the hornets turned into a storm cloud in an instant. The wave of lightning raged in the vast sky and burned the hornets. However, there were still many hornets, and there were still insects crawling out of the hole the centipede created. Even though they were all SS ranked monsters, they really had no manners, popping out in groups instead of one by one.</p><br/><p>Waiting for the Mana Potion’s cooldown time to end, I swung my spear. Father, Walker, and Ye-Eun also decreased their numbers. I was glad that I brought Pepper along. He had a handgun in each hand. Other than when he reloaded, he constantly shot out bullets. His attack was magnificently stopping the advance of the insects. It was then that Hwaya snapped out of it.</p><br/><p>“Hwaya, help!”</p><br/><p>“Sob, I hate this place so much…!”</p><br/><p>It seemed she was feeling better now that she had woken up after fainting. Even as she sobbed, she held up her staff. Her staff became heated red, and her mana instantly surged up. The mana then traveled back into her body and flowed to her Orb. The golden eye constantly blinked and radiated light. Then, I felt that the insect army all turned their attention toward Hwaya.</p><br/><p>“Everyone, get ready to attack!”</p><br/><p>Hwaya shouted and threw the Orb up. I realized then that it wasn’t Hwaya that drew their attention, but the Orb. The Orb repeatedly flickered with golden light before the light burst out into all directions.</p><br/><p>[Kyaaaaaaa!]</p><br/><p>[Kigigigigi!]</p><br/><p>Both the insects that crawled out of the ground and the insects that flew in the sky stopped in place. I thought it was some sort of a restraint magic, but Hwaya then said something absurd.</p><br/><p>“I tied them all together. The ones exposed to light will all take 10% shared damage for the next 10 seconds!”</p><br/><p>“That’s a cheat skill!’</p><br/><p>“It’s the Orb’s ability!”</p><br/><p>“That’s a cheat item!”</p><br/><p>In any case, I couldn’t waste the 10 seconds she gave us. I poured my aura into Chaotic Spear. A reddish black chaos flame began to burn above the spear. I gave the rest of my mana to Peika and shouted.</p><br/><p>“Peika, attack just one of them with full strength!”</p><br/><p>[Thunder Bolt!]</p><br/><p>The lightning Peika shot out then burned a nearby beetle until not even its ashes remained. The bugs that were exposed to the orb’s light really screamed and began to burn. The other members also used this opportunity to each attack one target with full force.</p><br/><p>[Kiaaaaaaaaa!]</p><br/><p>[Kaaaaaa!]</p><br/><p>The effect was astounding! They didn’t just stop moving, they were dropping dead! Watching the Asian giant hornets die was especially enjoyable. I then focused my energy in my spear. Before the 10 second period passed…</p><br/><p>“This is the final blow…!”</p><br/><p>In front of me was an especially large ladybug. Because of Peika’s powerful lightning, it still couldn’t move properly. I aimed my spear, which was burning with a black flame, at it, and thrust it right on top of its carapace!</p><br/><p>[Kiaaaaaaaa!]</p><br/><p>The strongest move I could do was Heroic Strike! With my entire strength concentrated on the Chaotic Spear, the spear easily pierced through the ladybug’s carapace and completely burned its body. With this, my mana was completely empty. However, I could deal a powerful blow to it within the 10 second Hwaya gave us. Other bugs should have received heavy damage as well.</p><br/><p>I would never have thought that the ‘chaos flame’ effect, which I only thought was an attribute, could turn into black flames when I put in my pure aura. I had only just noticed because I had always used Spirit Aura before. As I thought, it wasn’t a Legendary grade weapon for nothing! Since the ladybug was burnt up in an instant, it was clearly extremely powerful.</p><br/><p>“Whew, I’m exhausted.”</p><br/><p>After taking my spear back, I immediately struck down on the ground and held myself up. The Mana Potion was still on cooldown, but the Health Potion had a different cooldown. However, before I could take it out and drink it, I felt myself feeling invigorated. Ludia had healed me. I raised my head to thank Ludia.</p><br/><p>And I froze.</p><br/><p>“My god…”</p><br/><p>“Shin, what did you do?”</p><br/><p>“What is this, son?”</p><br/><p>“… T.K., you’re amazing!”</p><br/><p>Everyone looked dumbfounded as they added their remarks. Since I was just as dumbfounded, I couldn’t really say anything. It was only now that I realized… the effect of chaos flame when used without Spirit Aura and with pure aura!</p><br/><p>[Kiaaaaaaaa…!]</p><br/><p>[Kigigigigigi!]</p><br/><p>[Kugagagagaga!]</p><br/><p>All the bugs that had been exposed to the Orb’s light were burning with black flames. No matter how much they screamed or hit their bodies against the ground, the flames weren’t extinguished.</p><br/><p>They screamed endlessly and struggled against the flames, but with the damage they took from the other party members, they didn’t last long and collapsed. The countless army of insects had all died.</p><br/><p>Only then did the black flames recede and disappear.</p><br/><p>Hwaya shouted.</p><br/><p>“That’s a cheat skill!”</p><br/><p>“N-No! It’s Chaotic Spear’s ability!”</p><br/><p>“That’s a cheat item!”</p><br/><p>Damn, she returned the words right to me…! It wasn’t that I didn’t know Chaotic Spear added chaos flame attribute to my basic attacks. I just thought it was an ordinary attribute bonus. I never even imagined that it would be stronger than Peika’s Spirit Aura. I had only just realized this attribute’s strength.</p><br/><p>A flame that couldn’t be extinguished until the targets’ death. Wasn’t that Amate… No, any more was dangerous!</p><br/><p>“Kyak!”</p><br/><p>“Damn!”</p><br/><p>Suddenly, the ground began to shake and fissure. The SS ranked monsters corpses were falling into the crevices. Although these precious items were falling into nothingness, we couldn’t grab them. The ground under us was fissuring too!</p><br/><p>“Kuk, O Earth!”</p><br/><p>Ludia’s staff let out a radiant light. The splitting earth subsided and the crumbling earth rose back up and supported us. It seemed it was not an easy feat even for Ludia who could control the earth, as she was sweating profusely. Ludia bit her lips and shouted as she struck her staff on the ground.</p><br/><p>“T-There’s something underneath…!”</p><br/><p>“Since all the bugs are dead, it’s probably the boss.”</p><br/><p>“Please don’t be a spider, please, please, please don’t be a spider…!”</p><br/><p>At Ludia’s words, Hwaya also began to sweat and murmur. Her prayer seemed to have worked as a long and giant horn popped up. Then, a second horn popped up.</p><br/><p>Its imposing head appeared, covered by a helm, and it stood tall with its armored body that was dozens of meters tall. Almost like a god of death from hell, ominous black flames were covering its body, making it look all the more horrifying.</p><br/><p>He let out a low and long roar.</p><br/><p>[Uoooooooong…!]</p><br/><p>Its voice was full of dignity and instilled terror in its listeners. Although I wasn’t affected thanks to my Overwhelm skill effect, I shook and shouted.</p><br/><p>“Hercules Rhinoceros Beetle…!”</p><br/><p>“I-Is that something to be so surprised about?”</p><br/><p>Leaving behind the somewhat serious Ye-Eun, I tightened my grip on my spear and swallowed a mouthful of saliva. It didn’t look simple at all. Not only was it ginormous, but the black flames burning around it added additional pressure. Could it be that it’s... No, how could that be!?</p><br/><p>Because of its size, it took a while for it to completely leave the ground. However, we stood around in a daze, waiting for it to make its appearance. No one thought to attack it. We experienced facing an overwhelming enemy during our fight against the Flame Drake. The reason we were staying still wasn’t because of that. We… We…</p><br/><p>Then, it finally finished coming out of the ground. It felt like the ground had heated up. It raised its head and observed us. Almost like an emperor of the sky, it looked down at the ground. The black flames covering its body raged as if to burn us for just looking at it. Because of the flames’ increasing pressure, we had to fall back a bit. Thinking that we were afraid, it let out a satisfied roar.</p><br/><p>[Uoooooong…]</p><br/><p>Then, it collapsed.</p><br/><p>[You defeated the Event Dungeon’s boss monster, ‘Evil Rhinoceros Beetle Lord!’]</p><br/><p>[4,000,000 gold is distributed evenly amongst party members. You received 500,000 gold.]</p><br/><p>[Kang Shin-nim’s contribution is the highest. Choose your reward.]</p><br/><p>Just like that, we cleared America’s SS ranked dungeon. Cyclops Lord’s Golden Eye really was amazing!</p><br/>\n</div>"}