{"title": "Chapter 163. The Rondo of Scarlet Flame and Silver Ice (6)", "id": 163, "volume": 2, "url": "http://boxnovel.org/infinite-competitive-dungeon-society-chapter-163-the-rondo-of-scarlet-flame-and-silver-ice-6", "volume_title": "Volume 2", "body": "<h1>Chapter 163. The Rondo of Scarlet Flame and Silver Ice (6)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 163. The Rondo of Scarlet Flame and Silver Ice (6)</p><br/><p>Chapter 163. The Rondo of Scarlet Flame and Silver Ice (6)</p><br/><p>Although I wanted to wait until Illina fully calmed down, I was also anxious to save the surviving ability user. As such, as soon as Illina’s crying subsided, I patted her head and told her, “Illina, I’m sorry, but there’s someone I need to save. Stay with Hwaya for a bit.”</p><br/><p>“Ina.”</p><br/><p>“Ina?”</p><br/><p>“That’s what Mommy and Daddy calls me.”</p><br/><p>“… Okay, Ina. Wait a bit.”</p><br/><p>“Un.”</p><br/><p>After hearing me call her Ina, she let me go. Worrying that there was possibly no way out of this situation, I approached the ability user with worry. Although everyone else turned into ice zombies and shattered, he was still alive. However, he was in a much worse situation than before, as he was frozen up to his eyes. Thankfully, Ruyue’s ability had gotten stronger at just the right time, and the freezing had stopped.</p><br/><p>When I approached the others, Walker was the first to speak to me teasingly.</p><br/><p>“Oh, here comes the father.”</p><br/><p>“Walker, if you want to fight, come. I’ll be happy to crush you.”</p><br/><p>“Sorry, but I’m not cruel enough to injure a man with a daughter. Protect your home, Kang Shin.”</p><br/><p>“Walkeeeeeeer…!”</p><br/><p>On the other hand, Ludia shook her hand and denied what Walker said.</p><br/><p>“I won’t accept it. She isn’t my daughter.”</p><br/><p>“Sorry, but you’re not my wife either.”</p><br/><p>“I want to pat Illina, too… Can I?”</p><br/><p>“You’ll probably freeze instantly.”</p><br/><p>“Why is it only Shin and Hwaya unni…”</p><br/><p>Well, I could understand where Ye-Eun was coming from. Ina was small and cute and looked just like a princess from a fairy tale. Although people with albinism were suffering from a pain that people without albinism couldn’t understand, with how pretty Ina was, it might be considered a blessing than a curse.</p><br/><p>Plus, with the amount of mana that rivaled an SSS rank’s, she couldn’t be feeling the pain ordinary people with albinism had. Although she had lost a lot in return, it would be different from now. I wanted to make sure that it would be.</p><br/><p>In any case, I had to treat this ability user that was on the verge of death.</p><br/><p>“Ruyue, can you bring him back to normal with your ability?”</p><br/><p>[Un! But that yellow-head needs to help me.]</p><br/><p>Ruyue answered energetically and pointed at Ludia. To use her beautiful blonde hair to call her yellow-head… How bold, Ruyue!</p><br/><p>“Ludia, help. We need to save him.”</p><br/><p>“…”</p><br/><p>Because of my previous clear-cut refusal, Ludia’s cheeks were puffed up. Even though she didn’t answer me, she approached us, then pointed her staff at the ability user.</p><br/><p>“What should I do, Wolf?”</p><br/><p>[I’m Ruyue! I’m not Wolf!]</p><br/><p>“Yeah, Wolf. So what do I do?”</p><br/><p>[Shin, this yellow-head is calling me Wolf!]</p><br/><p>“Can we just hurry up? If he really dies, it won’t be funny…!”</p><br/><p>Although Ludia and Ruyue kept bickering, they still cooperated to heal the ability user. As Ruyue slowly thawed him, Ludia invigorated his mana and healed his injuries. Surprisingly, after a while, he began to operate his mana to help them, while his eyes were still closed. I wasn’t sure when he was frozen, but he really was…</p><br/><p>About 10 minutes afterward, the man slowly opened his eyes after regaining his appearance. He was a handsome middle-aged man with blonde hair mixed with white streaks and grey eyes. This must be what people mean when they say that people ‘aged well.’</p><br/><p>“Thank you for helping me. I thought I’d die here.”</p><br/><p>“I’m Revival’s Yeon Hwawoo.”</p><br/><p>“Ah, the greatest hero of this century. You’re even better looking in person. Your eyes look soft but show strong will. It’s an honor to meet you. I’m Laz Michel, France’s SS ranker.”</p><br/><p>He reached his hand out to me. When I held his hand, I instantly realized. He was a physical reinforcement type ability user!</p><br/><p>“Was everyone in here your comrades?”</p><br/><p>“There were others, but most of them were killed by the ice monsters.”</p><br/><p>As he said that, he stealthily stole a glance at Ina. Anyone other than me wouldn’t have noticed. Although he didn’t say anything aloud, I knew what he was hinting. I couldn’t help but thank him for being considerate.</p><br/><p>Although he was being frozen to death, he had seen everything that happened. He knew Ina didn’t want to kill people, and probably wouldn’t touch the subject if we could control her ability.</p><br/><p>“I’d like to express my gratitude again. Really, thank you. I thought I’d end my short life in this place. I still have many things I want to enjoy!”</p><br/><p>“It’s great that we could save you before it was too late. I’m sorry to say this to someone who just came back from the verge of death, but can you help us clear the gate? Having a powerful and reliable ability user such as yourself would be of great help to us.”</p><br/><p>“Of course. In fact, I’d like to ask if I could help. I’m not the type of person who can sit still after being hit. I won’t be satisfied if I don’t get my revenge.”</p><br/><p>He grinned and held up his sword, which he had been holding even whilst he was frozen. For a one-handed sword, the sword’s body was wide and thick. It was a bastard sword.</p><br/><p>“I’m confident in my ability to fight with my body.”</p><br/><p>“Good to have you on board.”</p><br/><p>Once our introduction was over, Hwaya approached us with Ina in her arms. To be exact, Ina wouldn’t let go of her. Now that she was done crying, Ina was practically in siege mode. Hwaya spoke with a voice mixed with happiness and distress.</p><br/><p>“Get her off me!”</p><br/><p>“Why? You guys look nice together. Better than her clinging on me.”</p><br/><p>“Mommy’s warm.”</p><br/><p>“Well, she is a fire ability user…”</p><br/><p>Seeing Hwaya and Ina together really put a smile on my face, but there was something I had to tell Ina.</p><br/><p>“Ina.”</p><br/><p>“Un.”</p><br/><p>When I called her, she seemed to have noticed that my tone was serious, as she looked up and stared at me.</p><br/><p>“The guy that ran away. Have you talked to him before?”</p><br/><p>“Un. He talked in an ice caterpillar form.”</p><br/><p>As I thought, he could forcefully possess living creatures. It was something only mad elementals were capable of. Of course, once a mad elemental successfully possessed a creature, non-Elementalists would be able to talk to them too.</p><br/><p>“He lost someone important to him and hurt others because of it. I want to catch him before he makes any bigger mistakes.”</p><br/><p>“Is he like me?”</p><br/><p>“No, even if he’s gone mad, he hurt and killed many people. He’s not like Ina, who ran away because you didn’t want to kill anyone.”</p><br/><p>“But I killed lots of people, too. Everyone said that Ina is a bad kid. That the dead Mommy and Daddy would hate me, too.”</p><br/><p>Damn, everything she said was making me cry. What bastard said that to Ina? I tightened my grip on the spear and contemplated about what to say to Ina. However, I couldn’t come up with anything. Hwaya hugged Ina in my stead and stroked her gently.</p><br/><p>“Ina isn’t a bad kid. No one is bad. You just couldn’t control the power entrusted to you. I’m sure that Mommy and Daddy who passed away wouldn’t hate Ina.”</p><br/><p>“Really?”</p><br/><p>“Of course. I’m Ina’s Mommy now. Don’t you believe Mommy?”</p><br/><p>“I do… Daddy, too?”</p><br/><p>She was acting like Ina’s mom like it was natural. How funny. But since she consoled her perfectly, I let it slide. I also stroked Ina’s head.</p><br/><p>“Of course, Ina. No parent could ever hate their child.”</p><br/><p>When I turned around, father silently gave me a thumbs up. It was a bit embarrassing to say this in front of father, but… I was right, no parent could ever hate their child. A parent would love even a hateful child. That was just how parents were. I was sure that parents had committed a huge crime against their children in their past lives. Otherwise, their unconditional love couldn’t be explained.</p><br/><p>Eit, this is too cheesy and embarrassing!</p><br/><p>“Ina doesn’t have to kill anyone now. We’ll help you. Ina, I want to help him, too. Humans were the ones who made him turn mad. Since I’m a human, I have to bring him back.”</p><br/><p>All elementals were born with blank slates. When they met their contractors, they would gain deeper emotions, but when their contractors died, or more specifically when their contractors met a tragic death like that boy’s, the shock would easily turn them mad. It wasn’t easy for elementals to go mad, but when they faced humans’ desires, it would happen more easily. Perhaps that’s why the number of human elementalists had decreased.</p><br/><p>Once an elemental turned mad, it was incredibly hard to bring it back to normal. Unless one could perfectly suppress it and drain it of all of its energy, there were only two ways to bring an elemental back to normal. That was to kill the elemental or to find a new contractor.</p><br/><p>When I first met Ruyue, I had planned to drain her energy and beat her until she snapped out, but after realizing that my soul was connected to hers, I contracted her. When I saw the boy, I realized that I was connected to him as well. After all, he wasn’t materialized at the time.</p><br/><p>To maintain a materialized form without a contractor, an elemental had to use his own elemental power. That was fine if the elemental was in a place full of elemental power like Fairy Garden, but that wasn’t the case now. As such, he did not materialize and used the environment to its fullest to attack us. His true strength should be much stronger.</p><br/><p>That said, I couldn’t understand why unique elementals I met after Peika were all mad elementals. Not to mention, they were all connected to me. Perhaps… Ei, let’s think about that later, too.</p><br/><p>“To do that, Ina, we need your strength.”</p><br/><p>“My strength?”</p><br/><p>“Yeah. I haven’t told Ina yet, but this dungeon will soon appear on Earth.”</p><br/><p>“Really? What should I do? I don’t want to kill people anymore.”</p><br/><p>“You just have to stay with us. I told you, right? I’ll help you so that you don’t hurt anyone else.”</p><br/><p>“Ah.”</p><br/><p>Ina’s expression became bright. Did she not believe me before? It seemed I would need to say things to her multiple times. With a bitter smile, I continued.</p><br/><p>“When this dungeon moves to Earth, we probably won’t be able to meet him anymore. When more people die, it will be too late to go back. He’s running away from me right now. He must have really loved his previous contractor, but if we don’t capture him, he will hurt more people. I want to stop that from happening.”</p><br/><p>“We have to catch him?”</p><br/><p>“Yeah, Ina. Can you help?”</p><br/><p>“Un.”</p><br/><p>… Perhaps, she didn’t need long explanations. Now that I thought about it, she probably wasn’t mature enough to understand everything I was saying. I didn’t know why I was explaining so seriously to a little girl. Ina suddenly raised her hand. I tilted my head and called her, as I couldn’t understand what she was doing.</p><br/><p>“Ina?”</p><br/><p>“I caught him.”</p><br/><p>What? I looked at Hwaya. Then, I realized that the place we were in wasn’t the same as the previous place. We were undoubtedly in a giant hall in the castle’s 2nd floor, but the place we were in had windows to the castle’s outside. Seeing the height we were in and the ceiling that looked like a dome, I thought…</p><br/><p>“Could this place be… the highest floor!?”</p><br/><p>Everyone, including Hwaya, Guild Revival’s members, and France’s SS ranker Laz Michel, had all been teleported. Wait, does that mean…!? I looked around. Then, I was dumbfounded.</p><br/><p>[You’re already here… Kuk!]</p><br/><p>[Girl, you changed your mind…?]</p><br/><p>I saw the elemental making a shocked expression and an army of ice armors filling up the area. What was most shocking was the throne on the innermost part of the room, and a giant ice armor sitting on it like a king.</p><br/><p>For an armor made out of ice, it was adorned with intricate engravings, which were glowing with red light. As I expected, this dungeon’s boss wasn’t the elemental!</p><br/><p>The giant armor looked at us and slowly got up. On his hand was a truly giant ice hammer.</p><br/><p>[Come. The Eternal Army will not fear thee.]</p><br/><p>Seeing it full of spirit, I turned around and looked back at Ina. Couldn’t you have said something!? Without knowing how I was feeling, she puffed out her chest proudly.</p><br/><p>“I can go anywhere I want inside here.”</p><br/><p>“Yeah, good job…”</p><br/><p>Of course, I couldn’t blame her. I planned to raise my child with nothing but compliments!</p><br/><p>“If anyone’s not prepared, tell me. Ina should be able to teleport us again.”</p><br/><p>“I’m good.”</p><br/><p>“Same!”</p><br/><p>“O power of the earth, bless us! Lend us your power! O Mitarus, bless us!”</p><br/><p>“Haha, my targets are all here!”</p><br/><p>It seemed everyone was fully prepared. That was also the case for our enemies.</p><br/><p>[Good, I will kill you here and now. All of you humans!]</p><br/><p>[Don’t act wildly on your own. Maintain your elegance. Soldiers, open your eyes.]</p><br/><p>The ice armors slowly got up. As they stood tall with their weapons, it was easy to tell they were much more orderly, completely different than the ones we saw before. They were undoubtedly much stronger, too. I’m sure that Ice Castle’s environment had something to do with it, but each ice armor was overwhelmingly stronger than any of the bugs we met in Insect World. Now, there were about 200 of them. Even I couldn’t stay lax in such a situation.</p><br/><p>“It’s going to get wild.”</p><br/><p>“Daddy, catch him. I’ll catch the rest.”</p><br/><p>“What, Ina?”</p><br/><p>“Eit.”</p><br/><p>Ina widened her eyes in Hwaya’s arms and grasped her hands in mid-air. Then, all 200 ice armors suddenly stopped. Could it… be?”</p><br/><p>“Go back!”</p><br/><p>Even if you command them like they’re your pets… What? All 200 ice armors crumbled together!</p><br/><p>[You really are strong, Ice Witch! But I won’t lose!]</p><br/><p>The giant armor gritted its teeth and shouted. Shockingly, the armors began to rise again. I could feel a frightening amount of mana moving. However, Ina pushed it back easily. As I thought, Ina was incredibly strong in this place…!</p><br/><p>“I’ll take care of them, Daddy.”</p><br/><p>“Yeah, thanks!”</p><br/><p>“We’ll handle the boss. You stop the elemental!”</p><br/><p>“Leave it to me!”</p><br/><p>I left the armors to Ina and Ina to Hwaya. Then, I stared at the elemental floating above and glaring at me.</p><br/><p>“You should be feeling it, too. Stop running away!”</p><br/><p>[I told you… Pesina is my only contractor!]</p><br/><p>He shouted in anger and emanated pressure in all directions. Kuk, I somewhat considered it with what happened in the previous room, but he really was a wind elemental! In any case, it was best to stop an elemental with another elemental. I called my partners.</p><br/><p>“Peika, Ruyue!”</p><br/><p>[You called?]</p><br/><p>[Un!]</p><br/><p>I turned around. Once unsealed, it seemed they could maintain their appearance while they were in their spiritual form, as a miniature-sized wolf-eared girl and a dragon with beautiful scales were staring at me.</p><br/><p>… Dragon!?</p><br/><p>Author’s note:</p><br/><p>Let me explain! This chapter had a lot of explanations, so the author put in 160% of the normal chapter length to make up for it!</p><br/><p>Also, remember what Peika said when she and Shin first met? About Shin’s soul being similar to hers!?</p><br/><p>This arc will end next chapter. Will a new elemental contract Shin!?</p><br/>\n</div>"}