{"title": "Chapter 161. The Rondo of Scarlet Flame and Silver Ice (4)", "id": 161, "volume": 2, "url": "http://boxnovel.org/infinite-competitive-dungeon-society-chapter-161-the-rondo-of-scarlet-flame-and-silver-ice-4", "volume_title": "Volume 2", "body": "<h1>Chapter 161. The Rondo of Scarlet Flame and Silver Ice (4)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 161. The Rondo of Scarlet Flame and Silver Ice (4)</p><br/><p>After we finished eating and resting, we climbed the stairs. What awaited us was a large hall and giant chandeliers hanging from the ceiling. Of course, it was also made out of ice. In addition, there were thousands of ice bats hanging on the chandeliers. Although we took care of them easily, we became slightly worried, realizing that the castle might be much bigger than we anticipated.</p><br/><p>“How long do we have left until uncleared Event Dungeons turn into Field Dungeons?”</p><br/><p>“I don’t know the exact time, but it shouldn’t be long. Last time, they turned into Field Dungeons on the 61st day exactly.”</p><br/><p>“And today is the 59th… No, 60th, right?”</p><br/><p>In other words, if we assumed that it was the same as last time, we had less than 24 hours until the Event Dungeon turned into a Field Dungeon. I didn’t want to rush, but it was true that we had been taking it a bit leisurely.</p><br/><p>“Should we split up?”</p><br/><p>“No, we should prioritize our safety. We don’t know what’s going to come out, so we should stick together.”</p><br/><p>Even if we were late and the dungeon turned into a Field Dungeon, it didn’t mean that we would die. It was just that humanity would continually be afflicted with a hell hole. Mm, maybe the situation was serious after all.</p><br/><p>Personally, I thought we could more easily clear the Ice Castle if we had Illina by our side. After all, her ability was practically made for this place. She didn’t know that Event Dungeons could turn into Field Dungeons. If she did, she wouldn’t have ignored me just now and would have lent her help. If we didn’t clear the dungeon, the Field Dungeon might take countless people’s lives.</p><br/><p>With a glimmer of hope, I tried to detect Illina’s mana with Mana Detection. Of course, I couldn’t do something like that suddenly.</p><br/><p>“In that case…”</p><br/><p>“Can I burn the entire castle down with my flames…?”</p><br/><p>“No, before we use such a brute force method, we need to see if there are any survivors. At the very least, France’s SS ranker might be alive.”</p><br/><p>“You don’t think he got done in by Illina?”</p><br/><p>“I hope that SS ranker didn’t have an aggressive personality…”</p><br/><p>Considering Illina’s temperament, it was unlikely that she attacked people first. It was probably her overly sensitive self-defense mechanism that poured in boundless mana of ice into whoever touched her. In other words, if France’s SS ranker didn’t try to touch her, he might still be alive.</p><br/><p>However, if he tried to capture her, seeing as how Illina was fine, he probably froze to death somewhere in this castle. Thawing someone and bringing them back to life was something only possible in science fiction novels. It wasn’t something we could do. Once someone froze, they were dead. If a ranker died in a place like this, that would be troublesome. Though, I wouldn’t mind if it was Brightman or Bruno.</p><br/><p>“Let’s hurry up from now.”</p><br/><p>“Walking faster makes it colder…”</p><br/><p>“Sorry, but bear with it.”</p><br/><p>High stats were made to last in situations like this. For a month for me and two months for the others, we cleared hundreds of Event Dungeons without rest and obtained over 200 bonus stat points.</p><br/><p>We obtained the maximum amount of bonus stats from Event Dungeons ranked A+ or below, a feat that I would have thought was impossible. HP and MP. According to what I heard from Loretta some time ago, there were some things one gained just by leveling up, depending on what dungeon he was in. Even without taking that into consideration, 200 bonus stats equaled 40 levels worth of stats. Although we each had our own strengths, we all had at least S ranked abilities. After gaining 200 bonus stats, it was safe to say that we had far surpassed the realm of human beings.</p><br/><p>Ordinary people would have instantly frozen to death just by stepping in this place, but we only complained that it was cold. After Ye-Eun became an ability user and a dungeon explorer, leveling up and increasing her stats, she probably never felt too ‘hot’ or ‘cold.’ When she came to this castle and felt the coldness she hasn’t felt for a long time, she probably exaggerated it a little.</p><br/><p>“So bear with it.”</p><br/><p>“So? You can’t say, ‘so bear with it,’ when you didn’t say anything beforehand!”</p><br/><p>“…”</p><br/><p>Damn, I was connecting my internal monologue with what I was saying aloud! But I thought everyone would still understand… Realizing that reality was different than my ideals, I despaired. Then, I explained to Ye-Eun about the reality of the ‘cold’ she was feeling.</p><br/><p>On the castle’s 1st floor, we ran into what Illina casually mentioned. The armor made out of ice. I couldn’t understand. Living armors were supposed to pretend like normal armors, then attack unsuspecting adventurers. But what was it disguising itself for when this castle was only full of traps!?</p><br/><p>In any case, there wasn’t any time for questions. As spacious as the 1st floor was, it was filled with enemies, and had numerous ambushes set up.</p><br/><p>“Eiit!”</p><br/><p>“There are more coming to your left!”</p><br/><p>“The chandelier is alive!”</p><br/><p>“Uwoah, the wall is moving too!”</p><br/><p>This better not end like, ‘Hey, the entire castle was a monster, too!’ If it did, I’m going to tear the castle apart!</p><br/><p>Thankfully, the chandelier and the wall were both disguised ice mimics. There really wasn’t anything we could trust in this castle.</p><br/><p>At the same time, with us destroying every enemy in our path, the castle was getting noticeably cleaner. We ended up clearing the 1st floor in just 2 hours, much quicker than we took to clear the basement. Immediately afterward, we climbed up to the 2nd floor using the staircase we found on the west side of the castle’s 1st floor.</p><br/><p>The 2nd floor didn’t have a hall but had a long corridor with many rooms. Surprisingly, I could feel the presence of humans from them. It didn’t belong to Illina! I urged the others on.</p><br/><p>“There are survivors, let’s hurry!”</p><br/><p>“Shin, I’ll just burn the 2nd floor! I’m going to run out of mana, so make sure to catch me!”</p><br/><p>“Yeah, thanks!”</p><br/><p>Hwaya’s white flames spread out in all directions, and we ran toward the presence. The enemies we faced on the way were quickly taken care of by Hwaya’s Army of Flames. In exchange for our extremely quick advance, Hwaya was turning pale and was looking like she was about to faint.</p><br/><p>[Guaaaaaang!]</p><br/><p>After some time, bats, rats, paintings, chandeliers, and armors were all melted away by Hwaya’s flames. We thus ran to the presence without hindrance, and soon arrived in front of a large door.</p><br/><p>[Uooooooooooh!]</p><br/><p>A giant golem standing in front of the door like a gatekeeper roared. It raised its giant ice mace but was melted by several white flame beasts before it could swing it even once. It must have been pretty strong as it took a majority of the beasts with him.</p><br/><p>“Shin, I’m about to—”</p><br/><p>“Hwaya!”</p><br/><p>As I thought, it seemed the Army of Flames, especially one with her white flames, took a heavy toll on her body and mana. The moment the Army of Flames disappeared, Hwaya fell backward powerlessly. I hurriedly ran behind her and caught her. Her body was cold. It was the symptom of one being completely out of mana.</p><br/><p>“You can’t move at all?”</p><br/><p>“No…”</p><br/><p>“I guess there’s no choice. It might be a bit uncomfortable, but I’ll—”</p><br/><p>“I’ll carry you, unni! You must be more comfortable with a girl than a guy, too!”</p><br/><p>“Ye-Eun, you…!”</p><br/><p>When Hwaya responded to Ye-Eun touched, she silently smiled. Ye-Eun then made me get back and carried Hwaya on her back. To think they had developed such a close bond! I was touched. Next to me, however, Walker whispered to me seriously.</p><br/><p>“Kang Shin, I think you should go die, kuuk!”</p><br/><p>“Hm? What?”</p><br/><p>“I feel complicated. I should cheer on unni, but…”</p><br/><p>“N-No, it has to be Ludia. That way, there will be some hope for me…!”</p><br/><p>“Eh…? What’s happening?”</p><br/><p>When we opened the gate, the tragic scene in front of us was more than enough to shut out such trivial thoughts.</p><br/><p>“My god.”</p><br/><p>“So many people are…”</p><br/><p>Frozen corpses were everywhere. It wouldn’t be surprising if someone mistook them as ice sculptures. There were at least 40 of them, each with different faces, but the same miserable expressions. Was this Illina’s doing? In front of the absurd horror, we couldn’t hide our shock.</p><br/><p>“Shin!”</p><br/><p>“Yeah, I know.”</p><br/><p>As I thought, there was a survivor. He was in a miserable state, as he was frozen from his feet to his right under his nose. He noticed us and opened his eyes widely. He seemed to want to say something, but his mouth wouldn’t open. In truth, I was shocked that he was still alive in such a state. I first made sure that there were no monsters nearby, then asked Ludia.</p><br/><p>“Ludia, can you save him?”</p><br/><p>“Not as he is now. We have to thaw him.”</p><br/><p>To think we’d actually have to do it! In any case, it was probably better to move him to a safe area before we…</p><br/><p>KRRRRRR.</p><br/><p>A loud sound rang out. When we turned around, the door we opened was shut tightly. Plus, the surrounding had gotten even colder, so much so that even I could feel it. Was I mistaken? When I was about to move the man, father called out.</p><br/><p>“Son, something’s not right.”</p><br/><p>“What do you mean, father?”</p><br/><p>“My fingertips are freezing.”</p><br/><p>“That’s serious…!”</p><br/><p>I immediately turned around and checked on father’s status. Although he spoke nonchalantly, it wasn’t just father’s problem. Aside from me and Hwaya, everyone’s hands and feet were slowly freezing. In other words, the frozen corpses weren’t caused by Illina, but by some other existence in this space!</p><br/><p>[Guuuuuuuu….!]</p><br/><p>[Kuhaa…]</p><br/><p>The corpses I thought were dead began to move while making strange noises. The Awakened’s corpses were being used!</p><br/><p>“Hwaya, how’s your mana!?”</p><br/><p>“I still need more time before it’ll fill up!”</p><br/><p>“Mana Elixir! Ludia!”</p><br/><p>“I can’t open… my inventory…!”</p><br/><p>Damn! If I could, I would open Ludia’s inventory for her. However, inventories could only be opened by their owners. Could this be considered a status effect? If it was, I could dispel it with Orc Lord’s Warcry! However, after I thought about it, I realized that although Orc Lord’s Warcry could cancel frostbite or paralysis from the cold, it could not prevent someone from being frozen. Plus, if I super-armored them haphazardly and forced them to move their frozen bodies, it could have devastating effect afterward. I didn’t want to imagine such a thing happening.</p><br/><p>In that case, I could only do something about it myself! Frozen corpses. Seeing the ice zombies closing in, I bit my lips and dispersed my mana outward. No matter who or what was freezing us, something had to be caught!</p><br/><p>Then…</p><br/><p>[Humans… Humans always worry about their own lives in critical situations, so why do they all pretend to care about others?]</p><br/><p>A voice rang out. It was the voice of a boy that hadn’t passed his puberty. It was a cold, frozen voice. I raised my head.</p><br/><p>[What do you think, human’s Hero?]</p><br/><p>A pretty boy, who could be mistaken as a girl, was right in front of me. With a sour expression, he sometimes pulled on his shirt with his hands, as if he didn’t like anything.</p><br/><p>[Well, you probably can’t hear or see.]</p><br/><p>When I was about to say something, the closed door suddenly opened. Illina, who had disappeared three hours ago, was standing there.</p><br/><p>“Don’t… kill him.”</p><br/><p>[You…?]</p><br/><p>When the door opened, the boy became flustered and turned around. When I saw her, a relieved smile appeared on my face. I could feel her sincerity. Seeing her step up for someone who only gave her a bowl of ramen, I became certain that we didn’t think wrong.</p><br/><p>I could feel the victory in the air. To make that victory more certain and to turn it into something happy, I took action.</p><br/><p>I decided to use the skill points I had been saving up.</p><br/><p>Author’s note:</p><br/><p>The answer has already been given!</p><br/>\n</div>"}