{"title": "Chapter 165. Double Crisis (1)", "id": 165, "volume": 2, "url": "http://boxnovel.org/infinite-competitive-dungeon-society-chapter-165-double-crisis-1", "volume_title": "Volume 2", "body": "<h1>Chapter 165. Double Crisis (1)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 165. Double Crisis (1)</p><br/><p>When we came out of the dungeon, the Guardians’ cheer was truly breaking through the heaven. This time, I felt like it was a true welcome. Russia’s prime minister also ran over as soon as he heard that the dungeon disappeared.</p><br/><p>Of course, as soon as he saw Ina in Hwaya’s arms, he froze. Seeing him shaking, I winked and spoke.</p><br/><p>“In exchange for taking care of Russia’s SS ranked gate, Revival requests Russia to officially accept Illina Alexandrovna Mikhalova’s citizenship renunciation. She has already asked to be naturalized to Korea.”</p><br/><p>There was only one acceptable answer. I put so much effort into memorizing Illina’s name that I would have smacked him if he didn’t accept my request.</p><br/><p>We then split ways with Michel on a good note. Although Sharana wasn’t at fault, she materialized and apologized sincerely. Before he got on his flight to France, he told me, “It was a truly astonishing experience. A giant armor that can talk, an elemental, and a different world… You know more about it, right?”</p><br/><p>“Yes, I do. In the coming days, I suspect that I will have to tell you about it and seek your help.”</p><br/><p>“I’ve seen with my own eyes why your organization exists, so I won’t doubt you. I hope the day comes soon. It seems it’s much more serious than anyone could anticipate.”</p><br/><p>“Thank you for your thoughts.”</p><br/><p>After saying our goodbye to Michel, we went back home immediately. Sumire returned to Japan, Shuna went back to the guild house, Ye-Eun went back to her home (though she kept turning around and looking at me), and Walker went back to his new house, which was right next to ours.</p><br/><p>Then, a problem arose.</p><br/><p>“Daddy, don’t you live with Mommy?”</p><br/><p>“Uh, mm…”</p><br/><p>Right, we weren’t sure what to do with Ina.</p><br/><p>At first, I thought it would be easy since Hwaya said she’d take care of her.</p><br/><p>“I’ll take her. My place is pretty big for just me and my mom. I think Mom would like Ina, too.”</p><br/><p>“Will you be okay? Isn’t your mother an ordinary person?”</p><br/><p>“M-Mother… Kuhum. O-Of course, I promised Ina, too.”</p><br/><p>“That’s… true.”</p><br/><p>This was the promise.</p><br/><p>First, I would appoint Ina to become a First Dungeon explorer. This had already been done. She was now a First Dungeon explorer.</p><br/><p>Second, Ina would quickly climb the dungeon and reach the 21st floor, when she would be able to enter the Residential Area.</p><br/><p>Third, we’d invite her to the guild house. She’d stay with Mommy (Hwaya) or Daddy (me) when she was on Earth, and stay in the dungeon or the guild house when we were both away.</p><br/><p>The third clause was especially important. Without Hwaya or me, Ina would be treated as a dangerous ability user again. To help her live as a regular child, the third clause was necessary. Though she couldn’t really live as a regular child from the moment she was made a dungeon explorer.</p><br/><p>“Plus, even if anything happens, I can quickly come back, so it’s okay. With my power, I can save people as long as not much time has passed.”</p><br/><p>Hwaya spoke with a reddened face and hugged Ina again. Then, Ina tilted her head and reached out and grabbed my sleeve. As I wasn’t wearing my armor, it was my actual sleeve.</p><br/><p>“What about Daddy?”</p><br/><p>“…. Hm?”</p><br/><p>“Daddy’s coming too, right?”</p><br/><p>We became speechless for a moment. I wasn’t sure how to explain this to her. However, Ina skillfully read the awkward air between Hwaya and me and asked.</p><br/><p>“Are you having a divorce?”</p><br/><p>“We never married in the first place, Ina!”</p><br/><p>As much as Ina was hungry for affection, she was indulging herself and having us spoil her. Because of it, she felt younger than her actual age, but she wasn’t a girl that couldn’t understand reason. She should know that Hwaya and I aren’t really husband and wife, nor that we were dating.</p><br/><p>Even so, I explained to Ina again to drive the point home. Ina then puffed her cheeks and said, “But the two of you are a match made in heaven.”</p><br/><p>“Where did you learn that phrase?”</p><br/><p>“Mommy taught—”</p><br/><p>When Ina was about to reply, Hwaya blocked her mouth naturally and pulled her into her embrace.</p><br/><p>“Ina, Mommy told you about the guild house, right? You can see Daddy there.”</p><br/><p>“You don’t live together?”</p><br/><p>“Ina, you can’t be stubborn about this.”</p><br/><p>“… Okay.”</p><br/><p>Ina helplessly nodded. Then, she gave me a peck on the cheek and made me promise.</p><br/><p>“You have to come see me every day!”</p><br/><p>“Mm, I’ll try, Ina. Every day might be hard though.”</p><br/><p>Beyond wasn’t a place I could clear so quickly. Even when I explained that to her, Ina sulked. Kids really were difficult.</p><br/><p>Before we all returned to our daily lives, I called the guild members together. We then held a funeral for Pesina in the guild’s resort, Resting Place of the Angels. The funeral was a special ceremony for elementalists, and Sharana watched in her materialized form.</p><br/><p>It was something only possible when a fellow elementalist was present. In this funeral, elementals would gather in the corpse of the elementalist and they would sublimate the mana left in the corpse. The body would then naturally dissipate. The myth was that an elementalist that went through this funeral would reincarnate as an elemental.</p><br/><p>As it used up a lot of the helping elementalist’s mana, it wasn’t viable during battle. It was rare for there to even be an elementalist to help. In addition, most elementalists hated to this funeral ceremony to be seen by others. Thus, it was a rare sight.</p><br/><p>That said, the elementalist funeral ceremony was probably one of the most beautiful forms of funerals for humans.</p><br/><p>“Elementals, light up the path forward for your friend.”</p><br/><p>[An elf elementalist!]</p><br/><p>[Poor girl, she couldn’t die all this time.]</p><br/><p>[Prince said to help.]</p><br/><p>[This is my first time doing this!]</p><br/><p>Countless colorful elementals gathered in Pesina’s corpse. In the process of naturally taking out her mana, the elementals shone with a light that even those who couldn’t see elementals could see. It was almost as if a rainbow was being drawn above Pesina’s corpse.</p><br/><p>“Beautiful…!”</p><br/><p>“My.”</p><br/><p>“Hm.”</p><br/><p>“Unbelievable, to think Kang Shin could show such a beautiful sight.”</p><br/><p>Except for Walker, the rest of Revival’s members watched silently. It would have been nice if we could have held funerals for the rankers that died in the Event Dungeon, but their corpses became lost when the Event Dungeon disappeared.</p><br/><p>As time passed, the light became stronger. Eventually, the light began to diminish around a focal point. By the time the elementals stopped giving off light, Pesina’s corpse became particles of light and scattered into the air. All mana left in her body had been used up.</p><br/><p>[Goodbye, Pesina. It was really fun being with you.]</p><br/><p>Sharana spoke with a cheerful voice and created a breeze to send the particles away. I couldn’t help but ask Sharana.</p><br/><p>“Will Pesina be reborn as an elemental?”</p><br/><p>[Yes. Since we even held an elemental funeral ceremony, I’m sure of it. I’d like to meet her again one day…]</p><br/><p>She murmured in a whisper, then bowed.</p><br/><p>[Thank you, Master. I didn’t think you even knew about the elemental funeral ceremony.]</p><br/><p>“It comes with being an elementalist. Though, I don’t really know how I know.”</p><br/><p>I smiled bitterly and turned to look at the party members, who were still standing around with blank expressions.</p><br/><p>“Thank you for coming over, everyone. Let’s enjoy a good tuna sashimi at the mansion and go back to exploring the dungeon!”</p><br/><p>I wanted to finish it soon. The melting tuna… no matter how much I ate, it wouldn’t disappear! Hwaya and I were eating it whenever we could, but there was no end in sight. Perhaps I had to give some of it away to Fairy Garden.</p><br/><p>While everyone began to move, there was one person that continued to stand still. It was Ludia. When I approached her, she stood in place and asked.</p><br/><p>“Shin, what did you say was the name of the elf elementalist?”</p><br/><p>“I told you, it’s Pesina. Why?”</p><br/><p>I tilted my head and put my hand on her shoulder. She flinched as if she was slightly surprised, then became pale and asked.</p><br/><p>“Shin, Pesina is the name of the legendary elf Hero who fought against the Demon Race in Luka continent 50 years ago…”</p><br/><p>I immediately ran to Loretta. Because I told her I would be away for a while, she had temporarily gone back to Fairy Garden. Thus, I had to run to Fairy Garden to meet her.</p><br/><p>“Loretta!”</p><br/><p>When I opened the door to the log cabin, I saw Loretta and Lin drinking tea, and also a beautiful woman sitting right next to Lin. When Loretta saw me, she threw the teacup she was holding (the woman on the opposite side of her caught it with magic), and jumped toward me.</p><br/><p>“Kyak, Shin-nim! I wanted to see you so mu… I, I mean! You took too long, stupid!”</p><br/><p>“I wanted to see Loretta a lot too, but there’s something more important right now.”</p><br/><p>“You treated it like an unimportant matter again! Treating my feelings like tha… Wait, you said you wanted to see me a lot? Ehehe…”</p><br/><p>Loretta’s expression quickly changed from a look of injustice to a blooming smile. Though it looked stupid, it was also quite cute. However, I didn’t have the time right now.</p><br/><p>“Wow… So this is Loretta’s boyfriend?”</p><br/><p>“Well, yeah. He’s a bit of an idiot, but he strangely attracts women. You be careful, too.”</p><br/><p>“So he’s like you, Lin.”</p><br/><p>“You dare to make fun of a draconian? How bold. Good, follow me, I’ll show you my rage.”</p><br/><p>I could hear Lin and the woman’s chatter, but I ignored them and pulled off Loretta, who was rubbing her face on my chest as if to poke a hole through it.</p><br/><p>“Loretta, you know I left to destroy Event Dungeons, right?”</p><br/><p>“Yes, Shin-nim told me about it. You became so strong, but you shouldn’t trust your status too much. What’s important is your level. No matter how overwhelming your stats are compared to an enemy, if your level is too low, the league of your soul will fundamentally pale in comparison.”</p><br/><p>“You can tell me about that later in more detail. There’s something I wanted to ask Loretta about that.”</p><br/><p>“What is it, Shin-nim?”</p><br/><p>It seemed she realized that I was being serious. Loretta’s eyes had also become serious. I calmly explained to her what happened. Meeting the elf elementalist Pesina and my new partner Sharana in the dungeon, and that they were both from the Luka continent.</p><br/><p>“Is the Demon Army that attacked Luka continent also attacking Earth? Loretta, how can that be possible? The Demon Army only just conquered the Luka continent. How could they have been invading Earth since 2 years ago? Did they operate 2 separate armies? Or is there a warp in time that I’m not aware of?”</p><br/><p>“N-No, neither of them are true.”</p><br/><p>Loretta shook her head. Her lips were trembling.</p><br/><p>“Oh, please, I can’t…”</p><br/><p>“Loretta.”</p><br/><p>“They aren’t Earth’s enemy. I’m sure of this because only worlds that have lost their power can invade other worlds…”</p><br/><p>“…”</p><br/><p>I heard an absurd secret. Wait, did that mean that the world’s enemy was also residents of other worlds like us? Were they invading other worlds to steal their power? How did they lose their power in the first place!?</p><br/><p>No, I could solve that mystery later. The important thing now was…!</p><br/><p>“Then why did an Earth’s dungeon have a boss who served the Demon Lord?”</p><br/><p>“Isn’t it obvious, kid? They can’t pave a pathway themselves, but they can use the pathway that’s already been drilled.”</p><br/><p>Lin responded in place of Loretta, who was lost for words. His eyes flashed with coldness.</p><br/><p>“Your world is currently being attacked by two forces. Although it’s rare, it’s not like it hasn’t happened before. Ones that got a taste of the world’s power could easily turn their attention to other worlds’ powers. Even after they achieved the continual existence of their world, they aren’t satisfied and seek to obtain even greater powers. That’s who you’re dealing with.”</p><br/><p>He continued with a slightly trembling voice.</p><br/><p>“We call that a Double Crisis. Simply put, you’re fucked.”</p><br/><p>Author’s note:</p><br/><p>I googled Double Crisis just in case and I got Pokemon… WHY!?</p><br/><p>Hello, this is Toika. The secret behind the world is being slowly revealed. A new administrative guild master has been revealed, though she hasn’t been introduced yet! ICDS’s setting is starting to be revealed!</p><br/><p>Double Crisis will be explained more in detail next chapter! Then, after that will be more dungeon conquering. Next chapter is pretty important so pay attention!</p><br/><p>Translator’s note:</p><br/><p>FYI, Korean authors put in asterisks for curse words because laws… But I didn’t put f*ckers, because let’s be real, we’re all adults here.</p><br/>\n</div>"}