{"title": "Chapter 162. The Rondo of Scarlet Flame and Silver Ice (5)", "id": 162, "volume": 2, "url": "http://boxnovel.org/infinite-competitive-dungeon-society-chapter-162-the-rondo-of-scarlet-flame-and-silver-ice-5", "volume_title": "Volume 2", "body": "<h1>Chapter 162. The Rondo of Scarlet Flame and Silver Ice (5)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 162. The Rondo of Scarlet Flame and Silver Ice (5)</p><br/><p>[Why did you come, Ice Girl?]</p><br/><p>“That person… don’t kill him.”</p><br/><p>[To achieve your goal of not hurting humans with your ability, everyone here has to die!]</p><br/><p>The boy spread out his arms and encompassed all members of Revival. Surprisingly, even though Illina couldn’t have heard the boy, she instantly frowned.</p><br/><p>“Don’t… kill them…”</p><br/><p>[I see, I thought you were different, but in the end, you are also a human. A weak human, a human that can’t keep her vows, a human that blames others for their lack of ability!]</p><br/><p>“Don’t… kill them!”</p><br/><p>Along with Illina’s shout, a freezing wind blew inside the room. The first ones to get affected were the zombies running toward us. Though they were already frozen, they got stuck to the floor, then became cut to pieces by blade-like ice crystals that appeared in mid-air. Her ability was truly powerful and unstable. That is, it was affecting us as well.</p><br/><p>“Ruyue!”</p><br/><p>[Un!]</p><br/><p>The moment the boy’s power wavered, I summoned Ruyue. She seemed to instantly realize what she had to do, as she protected everyone with her ability.</p><br/><p>“Can you thaw them?”</p><br/><p>[It’s hard. We need to do something about that guy first!]</p><br/><p>“Alright… leave it to me!”</p><br/><p>While Ruyue’s elemental power surged up to protect all party members, the boy, who was fighting Illina, opened his eyes widely after seeing Ruyue.</p><br/><p>[An Elementalist!? Kuk… So you could hear me! I hate you even more now, die!]</p><br/><p>The boy’s shout almost seemed like a shriek, as the room itself trembled. The freezing energy inside the room became stronger, clashing with Illina’s power and making it hard for me to see anything. Both Illina’s and the boy’s energy was immense, and Ruyue was busy trying to block their energies.</p><br/><p>It would be harder to hold out for long with just Ruyue’ power. If I didn’t do it now, it would be too late.</p><br/><p>I immediately took action. It was simple, as I just had to distribute 3 skill points to each skill.</p><br/><p>[You mastered mid-rank Spirit Aura! In addition to weapons and defensive equipment, you can now infuse elementals into your own body, amplifying your physical abilities!]</p><br/><p>[You learned high-rank Spirit Aura! While active, you can freely use mid-rank elemental magic. As the skill level increases, the amount of mana needed to infuse and maintain elementals in your body decreases and your ability amplification increases.]</p><br/><p>I somewhat expected it, but with high-rank Spirit Aura, it was really possible to infuse elementals into my own body. Although it would be good to have my weapon use Spirit Aura, I could now use chaos flame-attribute aura. As such, bar for a few special occasions, I didn’t need to use Spirit Aura. It was good that I could now use Spirit Aura with my body.</p><br/><p>[You mastered mid-rank Elemental Control! Elementals not connected to your soul will listen to you attentively and will follow your orders if they do not have a master.]</p><br/><p>[You learned high-rank Elemental Control! You can draw out the potential of your contracted elementals to their maximum. You can command free elementals as if they are your own.]</p><br/><p>Finally…</p><br/><p>[You mastered mid-rank Elemental Contract! You can perfectly draw out the true power of your contracted elementals!]</p><br/><p>[You learned high-rank Elemental Contract! Your contracted elementals’ are released from high-ranked seals, and all elemental-related techniques are greatly strengthened. The number of elementals you can contract increases by one.]</p><br/><p>Then, the wind blowing inside halted. When the wind disappeared, only Illina’s ability remained, but soon, it was stopped.</p><br/><p>The boy looked back at me with a flustered expression. I grinned at him.</p><br/><p>[E….Eh?]</p><br/><p>“Did you just notice?”</p><br/><p>[You… You can see me.]</p><br/><p>“Yeah.”</p><br/><p>[Im… Impossible.]</p><br/><p>The boy took a few steps back. I then heard relieved voices from behind me.</p><br/><p>“W-Whew, I’m alive.”</p><br/><p>“I don’t know what you did, but thanks, son.”</p><br/><p>My companions, who were slowly freezing, were now thawing. Someone who could calm Illina’s ability and bring about this change… I glanced at Ruyue. Ruyue, who had materialized without my knowledge, was not in her wolf-form. Rather, she had the form of a girl, who had wolf ears and wolf tails… Huh?</p><br/><p>With a small face and delicate features, she looked just like a 17 year old girl. Perhaps because she was originally a wolf, she was incredibly well-developed. Her beautiful silver hair that looked like a wolf’s manes was exuding a unique charm. Did beast-type elementals take human form when their high-ranked seals are undone?</p><br/><p>Thankfully, she was wearing a dress that was seemingly made out of leather. Seeing me tilt my head curiously, Ruyue widened her eyes, which were just as blue as when she was a wolf.</p><br/><p>[Shin, I became weird!]</p><br/><p>“Yeah, I thought you’d say that. You’re the one who thawed the others, right?”</p><br/><p>[Yeah! I suddenly became stronger!]</p><br/><p>“Good job.”</p><br/><p>[Hehehe. Praise me more!]</p><br/><p>Ruyue’s ears fluttered happily as she ran into my embrace. Without thinking, I hugged her back and patted her head. Then, after realizing what had just happened, I became flustered. Although I had done it without much thought when she was a wolf, now that she had turned into a girl, the softness of her body and the stares I was getting were completely different.</p><br/><p>Hwaya Mastiford, you’re looking at me like I’m some criminal! I’m only being intimate with my elemental as her master!</p><br/><p>The one that seemed to be most in shock was the boy.</p><br/><p>[She… evolved!]</p><br/><p>“Yeah, in a way, just for you.”</p><br/><p>[A-As I thought, you’re… but…!]</p><br/><p>The boy shouted.</p><br/><p>[My contractor is already dead!]</p><br/><p>Damn! I see, if that wasn’t the case, it wouldn’t make sense that an elemental like him would be cooperating with monsters! Perhaps his contractor was… Wait, no. Something’s strange… Ei! I can solve that later! That wasn’t the important thing right now!</p><br/><p>“Just because you lost your contracted master, it doesn’t mean you can’t contract another one.”</p><br/><p>[My master will only be Pesina! Other than her, no one can touch me… Plus, you’re a human! Throughout the long history, human Elementalist has never…]</p><br/><p>“Don’t worry. I’m definitely an Elementalist, and you’re definitely connected to me.”</p><br/><p>My very existence confused him, and at the same time, charmed him. That was what soul connection was. Just like how the maddened Ruyue returned to being a pure elemental when we met, now that this free elemental realized he was connected to me, he couldn’t go back to how it was before.</p><br/><p>[No… I hate you!]</p><br/><p>“It’s fine. I’ll listen to everything you want to say.”</p><br/><p>[No! Go away, I hate humans! Humans, who took Pesina away from me, should all die with monsters! Someone like you isn’t my contractor!]</p><br/><p>As I thought, some bastards had harmed his contractor! It was then that he did something completely unexpected.</p><br/><p>“Shit, Illina!”</p><br/><p>“Ah!”</p><br/><p>The free elemental had charged toward Illina, who was standing in front of the door. Damn, was he trying to forcefully possess her!? Although Illina couldn’t see or hear the free elemental, considering how she noticed that there was someone else here the moment she came in the room, it seemed she could feel his mana. Of course, that was an amazing feat.. Regardless, if she couldn’t detect his body, it would be hard to block him.</p><br/><p>I instantly activated Divine Speed and ran forward. Since my companions had already thawed, they should be able to protect themselves against the zombies. What I had to do now was to protect Illina, who had come to save me and my friends.</p><br/><p>[Kuk! I will not contract a human! I will kill you soon, just you watch!]</p><br/><p>“Shin!’</p><br/><p>“N-No!”</p><br/><p>“Yes!”</p><br/><p>Several shouts filled the room. The result was quickly shown.</p><br/><p>I reached Illina first, embracing her and rolling on the ground. As such, the elemental left the room without being able to reach his target. As the zombies had been swiftly taken care of, the only hostile thing left in the room was the freezing energy being emitted endlessly. Of course, Ruyue was easily controlling the freezing energy, preventing it from affecting everyone, and Ludia was hurriedly healing everyone who had almost become frozen.</p><br/><p>Illina, who was in my embrace, opened her eyes widely.</p><br/><p>As we were sprawled on the ground, I quickly got up and dusted her off. Meanwhile, Illina simply stared at me in shock.</p><br/><p>Once I got done dusting her off and stood up straight, she checked that I was fine, then tapped my arms like she couldn’t believe it. She opened her trembling lips.</p><br/><p>“Y-You won’t freeze…”</p><br/><p>“I told you I won’t.”</p><br/><p>“You really won’t freeze…?”</p><br/><p>“Of course.”</p><br/><p>Her mana was unnaturally enormous. It could be that staying in this dungeon for over a month had increased her ability, but regardless, the amount of mana she had neared the amount Hwaya and I had. She was comparable to me, even after I cleared so many Event Dungeons and completed Event Raids! The energy she was emitting was undoubtedly not something ordinary people could endure. It was easy to see that it was hard for her to live a normal life.</p><br/><p>“It’ll be fine if you’re with me.”</p><br/><p>“Really…?”</p><br/><p>“Shin, can you not leave me out of it?”</p><br/><p>For someone who just recovered, Hwaya strut toward us. Illina became startled and tried to back away, but Hwaya quickly placed her hand on her head.</p><br/><p>“Huhu, huhuhu! See, Shin! I won’t freeze either! It’s not just you!”</p><br/><p>“Yeah, I can’t really win against your competitiveness.”</p><br/><p>“Excuse you, it’s not because of competitiveness. I’ve been wanting to pat her the moment I saw her! Remember, the first one to pat her was none other than… Mm? D-Don’t cry! Sorry, did you not like it?”</p><br/><p>“Hic, Hic…”</p><br/><p>Oh, no. Illina’s red eyes were tearing up. I jokingly said to Hwaya.</p><br/><p>“How can you make a little girl cry?”</p><br/><p>“Y-You…!”</p><br/><p>“Uu, uuaang…”</p><br/><p>Illina began to cry with a muffled voice. From it, I could feel her built up pain. She must have been crying like this all this time. Without anyone knowing, she must have cried inwardly to herself. Ever since the day she lost her parents…</p><br/><p>I made eye contact with Hwaya. She gestured with her chin, but I shook my head and gestured with my chin. After all, a girl should be better than a guy at consoling a child.</p><br/><p>Hwaya smiled as if she couldn’t help it, and held Illina with both arms.</p><br/><p>“There, there.”</p><br/><p>“Uuuu… Hic…!”</p><br/><p>“Let it all out. Illina, thank you for saving us. You’re a good girl.”</p><br/><p>“Uuu… uuuuang!”</p><br/><p>“Good, good…”</p><br/><p>Well, she’s all ready to be a mom! Seeing Hwaya perform better than I expected, I turned around to check how others were doing. Then, Illina held my sleeve. For the record, ‘held’ was just the way I put it. To be exact, a stream of ice had reached out from her hands to my shoulder part of my armor and pulled it.</p><br/><p>“I-Illina…?”</p><br/><p>“Hic, hic…”</p><br/><p>“She’s asking where you’re running away.”</p><br/><p>“Is that what your ears heard?”</p><br/><p>With no other choice, I approached her. Illina, who was hugging Hwaya, reached out with one arm and embraced me. Although I stuck to Hwaya’s body unintentionally, it seemed she didn’t mind. Instead, the people watching us did. I, of course, ignored them. Illina was the top priority, right now.</p><br/><p>I reached out and patted Illina’s back. Her tears seemed to have subsided as well. Because of how much she cried, her red eyes and turned even redder. Then, she murmured.</p><br/><p>“Daddy.”</p><br/><p>“Hm?”</p><br/><p>“Daddy.”</p><br/><p>“Uh, mm… Illina? Sorry, but I’m still—”</p><br/><p>While I wore a dumbfounded expression, Illina turned to Hwaya and murmured.</p><br/><p>“Mommy.”</p><br/><p>“M-Mommy!? Kuk, no, mmm…!”</p><br/><p>“Mommy.”</p><br/><p>“… Are you calling us twice to assure yourself?”</p><br/><p>“Daddy and Mommy…”</p><br/><p>Illina murmured and buried her face between us. My eyes met Hwaya’s, and we dropped our shoulders and gave up. I had a suspicion that we would need to carry this title for a while.</p><br/><p>Early autumn, I, Kang Shin, 21 years old, had gotten a daughter. A foreigner at that!</p><br/><p>Author’s note:</p><br/><p>Someone’s going to say, “Another harem member!?” But I will say, “No, elementals aren’t harem members!” Since their souls are connected, they’re already one without needing to hit the bases…</p><br/><p>After being unsealed, Ruyue went from a wolf to a human. Here’s a question. What about Peika…?</p><br/><p>Hint – Remember the moment of their contract.</p><br/><p>By the way, after this part, we will have the popularity contest I talked about! We’ll also be going back to the dungeon.</p><br/>\n</div>"}