{"title": "Chapter 189. Absolute Soul (1)", "id": 189, "volume": 2, "url": "http://boxnovel.org/infinite-competitive-dungeon-society-chapter-189-absolute-soul-1", "volume_title": "Volume 2", "body": "<h1>Chapter 189. Absolute Soul (1)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 189. Absolute Soul (1)</p><br/><p>Before we left the forest, Ren reminded the children.</p><br/><p>“Just close your eyes, and we’ll take care of everything.”</p><br/><p>“Ren oppa.”</p><br/><p>“If Oppa gets hurt, I’ll hate you!”</p><br/><p>“Hyung, protect Ren!”</p><br/><p>“Don’t worry, I’m not so weak that I need someone’s protection.”</p><br/><p>“Guys, get on Lotte first.”</p><br/><p>I made the children switch to Lotte. She was, of course, back in her wyvern form. Ren and Lebuik also got on her back. To protect them, I flew up using Sharana’s power and Talaria. Lotte flapped her wings and complained.</p><br/><p>[I hate having people other than Hero ride me…]</p><br/><p>“Sorry for making you do this all the time, Lotte.”</p><br/><p>[Hero must pay the price for hurting this Dark Wing Lotte’s pride. Be prepared, Hero.]</p><br/><p>“Sure, I’ll do anything you want if it’s within my power.”</p><br/><p>[Kuhum… Then I’ll let it slide this time.]</p><br/><p>I patted Lotte’s head and appeased her. The children stayed still watching Lotte and I talk, but Ren and Lebuik strangely looked at Lotte’s body jealously.</p><br/><p>“I wish I had a wyvern like this too.”</p><br/><p>“She really was a wyvern… I’ve never seen such a large and powerful wyvern before. I can’t believe she’s the frail looking woman from before… Do Crown Prince’s pets and elementals all have female human forms?”</p><br/><p>“I don’t really know.. Maybe, it’s the will of the universe.”</p><br/><p>I replied with a shrug. Then, I transformed my choker into its spear form. We would soon leave the forest. Knowing that this was the last chance to catch us, the hungry forest monsters were closing in on us from all sides.</p><br/><p>“Everyone, get ready! We’re going to leave the forest with a final bang! Ruyue!”</p><br/><p>[Freezing Air!]</p><br/><p>The energy emitted by the materialized Ruyue froze everything in our vicinity. At the same time, I shot out the energy gathered at the tip of my spear. Monsters that tried to make us their food became frozen food themselves. Then, unable to withstand the aura I shot out, they shattered along with dozens of trees behind them. Morning sunlight shone down from above. We were now out of the forest.</p><br/><p>At the same time, countless number of monsters in the air caught sight of us. They were the monsters being controlled by the brain worms. It was hard to describe just how many there were. They probably could not even be counted by the thousands. The sky was practically filled with them.</p><br/><p>“There are too many of them!”</p><br/><p>“I’ll take care of it!”</p><br/><p>I soared up and activated my Evil Eyes. With the sheer number of them, my eyes began to hurt and mana continuously drained. However, the result was more than I imagined. Almost 80 percent of the aerial army petrified and fell. It was almost as if there was a meteor shower going on. I finally began to understand why Evil Eye holders were so feared.</p><br/><p>The Evil Eyes of Petrification were specialized for fighting large armies. It was a weapon of mass murder capable of decimating all who could not withstand its power! My Evil Eyes continued to shine, and the enemy forces continued to dwindle.</p><br/><p>“Crown Prince…!”</p><br/><p>“Wow, Shin oppa is so cool…”</p><br/><p>“I want to marry Shin oppa!”</p><br/><p>“I want to learn how to do that, Hyung! Teach me!”</p><br/><p>“T-Teach me too!”</p><br/><p>I cleaned up some of the monsters that survived because they were blind and charged through the air. Lotte followed me with a speed that wouldn’t lose out in the slightest and killed the approaching monsters with her black flames.</p><br/><p>A short while later, the monsters’ movements became strange. Behind one large flying monster, dozens of smaller monsters lined up like train compartments. I somewhat understood their intentions. After realizing that looking at my eyes would petrify them, they hid themselves behind a scapegoat. It was something humans would think of, not monsters.</p><br/><p>[Kiaaaaaaaaak!]</p><br/><p>[Kugaaaaaaaaak!]</p><br/><p>They screamed joyfully thinking that they found the solution. I smirked and shot out a whirlpool from my spear. The monster in the front, which had already turned to stone, were covering the dozens of monsters behind it. However, the whirlpool easily tore through the petrified monster. The monsters hiding behind it immediately turned to stone and fell.</p><br/><p>Just like that, thousands of monsters died once again. If I were a character in a RPG game, my level would have risen explosively.</p><br/><p>“This rocky mountain is too tall! When will we see the Forest of Tranquility?”</p><br/><p>“Forest of Tranquility is located at the highest region of Panan continent! Naturally, this mountain range is also the highest!”</p><br/><p>Still, we couldn’t see the peak after flying for 5 minutes. That was just too high! I heard that Earth’s mountains were still growing. I was afraid they’d become like Panan continent’s mountains.</p><br/><p>[Kiaaaaa!]</p><br/><p>The higher we went, the more violently the monsters attacked. It was undoubtedly because they knew they would not be able to touch us once we reached the Forest of Tranquility. Hundreds of monsters were turning into stone every second, but more and more monsters flocked from god knows where. Perhaps, they wanted to kill us by drowning us in stone!</p><br/><p>I clicked my tongue and took out a Mana Potion. I put the potion in my mouth and called elementals to my spear.</p><br/><p>[Ah, a different world!]</p><br/><p>[Ek, bugs!]</p><br/><p>[We’re scolding bugs today?]</p><br/><p>[There are so many!]</p><br/><p>[Prince-nim became even cooler!]</p><br/><p>[Spin spin~]</p><br/><p>“Ah, that technique is…”</p><br/><p>“So many elementals…”</p><br/><p>Mad Typhoon’s powerful rotational force seemed to have excited the elementals, as they shone even brighter than usual. I heightened the rotational force and led the elementals. Petrifying the monsters coming to stop it, I very slightly pulled back the spear enveloped by the elemental whirlpool.</p><br/><p>“Elemental…”</p><br/><p>“A-Amazing…”</p><br/><p>Tempest!”</p><br/><p>A gale of elementals stormed through the air. Meanwhile, I gulped down the Mana Potion in my mouth. Looking at the gaping hole in the sky, I smiled with satisfaction.</p><br/><p>“Alright, let’s hurry! Hold on tightly, guys! Lotte, full speed!”</p><br/><p>[Understood, Hero!]</p><br/><p>After sweeping away a large number of enemies with Elemental Tempest, I cleaned up the rest with my Evil Eyes. We were then able to climb to the peak without much trouble. After about 5 minutes, we finally entered the Forest of Tranquility.</p><br/><p>The inside of the forest was extremely beautiful. Countless beautiful flowers and tall trees filled the lush forest. Even in this world, where everything was being controlled by the brain worms, this place maintained its natural beauty. However, just like its name suggested, it was unnaturally quiet. There were no signs of animals. It was as if we were the only ones breathing in this place.</p><br/><p>“Cough, cough.”</p><br/><p>“Huu…”</p><br/><p>The highland’s thin oxygen level made it hard for the children to breathe. Even the ones who had mana found breathing difficult.</p><br/><p>“It’s hard to breathe. I’m tired.”</p><br/><p>“Use the mana breathing method, Elfa. You learned it, right?”</p><br/><p>“Un, Daddy taught me.”</p><br/><p>There were many different mana cultivation methods, but the most common were mana breathing methods, which took in mana by a special method of breathing. Ren used this method as well as the children that followed him. The children seemed to have remembered about the mana breathing method after I mentioned it, as they all started to use it. I patted their heads and looked around.</p><br/><p>“How can there be such a lush forest so high?”</p><br/><p>“That is something only God knows. But as Crown Prince can probably feel, mana is bountiful in this area. If the greenery here sprouted with the power of mana, it’s understandable.”</p><br/><p>He was right. Using common sense from Earth to evaluate Panan continent was foolish. In fact, it wouldn’t be long until Earth’s common sense would change.</p><br/><p>“Let’s hurry. You said we can’t stay here for more than a day.”</p><br/><p>“Yes, no one could stay here for over a day.”</p><br/><p>“Guys, it might be tiring, but endure it.”</p><br/><p>“Un.”</p><br/><p>“It’s okay since Shin oppa is here.”</p><br/><p>“Elfa… You seem to like Crown Prince more than me…”</p><br/><p>Don’t make that face like you were just thrown away by your wife, Ren! I almost called the police! Be thankful there are no police here!</p><br/><p>However, not long afterwards, I tilted my head.</p><br/><p>“Ren, you might feel wronged, but can you not glare at me?”</p><br/><p>“No, I’m not looking at Crown Prince.”</p><br/><p>“Is it Lebuik then?”</p><br/><p>“Why would I be looking at you? I’m too busy inscribing Ren-nim’s visage in my retina.”</p><br/><p>She sure talked well for someone who abandoned Ren… I guess, she proved her love for him by coming back.</p><br/><p>Then who was it? I looked at the children sitting on top of Ruyue and tilted my head. A few of them also tilted their heads after seeing me. They really were too cute.</p><br/><p>Soon after, however, they began to writhe in pain.</p><br/><p>“I can’t… breathe.”</p><br/><p>“Elfa?”</p><br/><p>“Hyung, I can’t either…”</p><br/><p>“Demi!”</p><br/><p>Ren and I became flustered and checked on the children. They looked like they were suffocating. I expanded my mana outwards and scanned the children. Then, I realized that the children’s mana… were leaving them.</p><br/><p>“Crown Prince!”</p><br/><p>“Damn… Ren, mana is leaving everyone’s bodies!”</p><br/><p>I quickly circulated Peruta Circuit at its limit. The mana leaving my body flowed backwards and back into me, but the others couldn’t do the same thing with their mana breathing method. Damn, Ren, Lebuik, and I would be fine, but if the children’s mana all left…!</p><br/><p>Then, the forest shook violently.</p><br/><p>[Arrogant human! You dare disturb my meal!]</p><br/><p>“Ren, didn’t you say it was fine to stay for a day!”</p><br/><p>“The last person who crossed this forest did it 130 years ago! The forest’s grim reaper must have changed his mind!”</p><br/><p>“Or, maybe he doesn’t like it that Rookie took back his mana. He said Rookie disturbed his meal.”</p><br/><p>“How can you say that so calmly!?”</p><br/><p>“Well…”</p><br/><p>Lebuik pointed at the two large eyes staring at us from beyond the dense trees.</p><br/><p>“I got feared, so actually, it’s hard to even talk.”</p><br/><p>At that moment, a shocking message rang out to everyone.</p><br/><p>[An Event Raid has broken out! SSS+-rank 50-man, ‘Mana Eater.’ Because you were at the location of the raid boss, you will be forced to participate!]</p><br/><p>Author’s note:</p><br/><p>Shin’s first SSS rank Event Raid! Can he do it!?</p><br/>\n</div>"}