{"title": "Chapter 193. Absolute Soul (5)", "id": 193, "volume": 2, "url": "http://boxnovel.org/infinite-competitive-dungeon-society-chapter-193-absolute-soul-5", "volume_title": "Volume 2", "body": "<h1>Chapter 193. Absolute Soul (5)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 193. Absolute Soul (5)</p><br/><p>When we defeated the aerial army and entered another forest to escape the reinforcements pursuit, Daisy let out a sigh.</p><br/><p>She was riding on Iana, the Iron Boar. She had somehow modified it to have a steel body, and it even crackled with lightning as he bulldozed through everything. Rather than an undead, it was a futuristic cyborg.</p><br/><p>She looked incredibly relaxed for someone riding on a vigorously moving boar, as she asked me a question.</p><br/><p>“Annoying. The whole world, those bugs?”</p><br/><p>“Yes. Almost all monsters in this world became like that tens of years ago…. Crown Prince, who is this dazzling beauty!?”</p><br/><p>Mesmerized by Daisy’s figure, Ren answered instead, then whispered in my ear with a flushed face. If you want to say something secretly, just message me! Are you doing this on purpose to get Daisy to notice you!?</p><br/><p>“Why is Crown Prince so popular with beautiful women!?”</p><br/><p>It seemed that was what he really wanted to ask. But wasn’t there a beautiful woman who loved you too!? She’s right next to you! Think about where Tyltyl and Mytyl found their bluebird!</p><br/><p>Ah, now that I think about it, that means that my bluebird is in my house too. I couldn’t help but be shocked at the fact that even the world-famous fairy tale was pointing to Yua being my bluebird of happiness. But that was beside the point. There was something I had to tell Ren.</p><br/><p>“Ren, Daisy is my guild member. We aren’t in a man-woman relationship. We’re just friends.”</p><br/><p>“Don’t say that, Crown Prince. What kind of idiot would come to a ruined world because she was worried about a friend!? Don’t make excuses!”</p><br/><p>“Are you calling me an idiot? Didn’t I come to help you? Do you want to die?”</p><br/><p>“Ah, y-you’re right. I’m not calling Crown Prince an idiot. I’m not doubting our friendship either…”</p><br/><p>When I formed my aura around my gauntlet and glared at Ren, he waved his hands in denial as he sweated. He was brave when he fought, but I didn’t know why he became so pathetic whenever we talked about something like this.</p><br/><p>“Crown Prince and I are both men, but a pure friendship between a man and a woman is harder to find.”</p><br/><p>“You’re too old-fashioned…”</p><br/><p>However, as I had once thought the relationship I had with Hwaya and Ye-Eun were of pure friendship, I couldn’t deny him directly. Though I believed that pure friendship between members of the opposite sex existed, I couldn’t be bothered to argue with Ren at the moment. As such, I simply smiled bitterly.</p><br/><p>At that moment, Daisy’s boar slowed down and Daisy spoke nonchalantly.</p><br/><p>“Kang Shin promised me. To save my world.”</p><br/><p>“Yeah, I did.”</p><br/><p>“Meeting Kang Shin, I felt… strength and hope. I resolved… to rise, once again. Can’t let him die here. So I came to save him.”</p><br/><p>She was talking about why she came to help! It was more or less what I was expecting. More importantly, look! What a pure and wholesome reason! It felt more genuine than saying we had some deep friendship, as we had not known each other for long. In a way, it made me happy. I stuck my tongue out at Ren, then answered Daisy.</p><br/><p>“Thanks, Daisy. You saved us.”</p><br/><p>“Beyond’s 13th floor cleared, then came. That’s why I was late.”</p><br/><p>“You weren’t that late. It was the perfect timing.”</p><br/><p>“Un… I also obtained a good weapon.”</p><br/><p>Daisy held up a silver chain whip, which didn’t look that different from what she had before, with a satisfied expression. If I remembered correctly, she said it was a unique enchanting method from her continent or perhaps from her race. No matter what weapons she had, she could fuse their functions into a single weapon. It was slightly different than how the Chaotic Spear worked, but it was still an infinitely growing weapon.</p><br/><p>Of course, the weapon she enchanted to her chain whip was the Million Tentacle. I didn’t really want to see what Million Tentacle looked like, and it seemed Daisy had thought the same way, as she immediately used the weapon as material to strengthen the chain whip.</p><br/><p>“What was the reward Crown Prince got? I got the Epic-grade hood.”</p><br/><p>“I won’t tell you.”</p><br/><p>As I had the highest contribution, the others couldn’t tell what item I chose. However, as there were two Epic-grade items left after I made my choice, Ren seemed to be extremely curious about the reward I got. On the other hand, Lebuik, who got the Elixirs, didn’t look all that curious.</p><br/><p>“Could it be a Legend-grade item? Is it truly the Legend-grade I only heard about it stories?”</p><br/><p>“Legend-grade can’t be that easy.”</p><br/><p>“Of course not. I’ve never seen one before.”</p><br/><p>“Legend… Very few owners. I only have one.”</p><br/><p>She was probably born with her Evil Eyes, so she was probably talking about something else. I couldn’t help but be curious about her Legend-grade item, but I kept my silence. Then, I told the two of them.</p><br/><p>“It wasn’t Legend-grade. Maybe you guys will find out later.”</p><br/><p>Of course, the reward I got was the Mana Absorption Magic Book. The skill was registered the moment I obtained it. With this skill, my plan became flawless. I even thought that meeting the Mana Eater was a blessing. Now, if I just had time to use Skill Synthesis, everything would be perfect.</p><br/><p>“How long do we have left, Ren?”</p><br/><p>“We’ll reach the plains in just 70 kilometers… If possible, I’d like to rest once before.”</p><br/><p>“That’s a good idea. The children must be tired too.”</p><br/><p>The children riding on Ruyue, regardless of whether they were beastman or human, were all dozing off. Beastmen only differed from humans in that they had animal ears and tails. Now that they were sleeping, they were folded down and made them look even cuter. If it wasn’t for Ruyue’s carefulness, they would have fallen off of her a long time ago.</p><br/><p>Daisy looked at the children and spoke apathetically.</p><br/><p>“Cooperation is good. Acknowledging other race, also good.”</p><br/><p>“Daisy…?”</p><br/><p>“… Let’s hurry. I want to go back quickly.”</p><br/><p>Daisy turned away. Iana kicked the ground and began to march forward quickly. I looked at her back blankly and forgot to run for a moment.</p><br/><p>“She’s powerful and truly beautiful… Crown Prince, I might have fallen in love with her. Miss Silver Wolf is also beautiful, but she lacks the elegance that lady has.”</p><br/><p>“Don’t, Ren. Take my advice, if you don't people around you will only end up hurt.”</p><br/><p>Namely, you and Lebuik. Just look for your bluebird already!</p><br/><p>As Ren suggested, we stopped to take a rest before we reached the plain. Perhaps knowing that they’ll reach the plain soon, the children seemed to be feeling anxious. It was understandable, as it wouldn’t end with us just running across the plain to the coast. I had already consulted the others about this matter.</p><br/><p>“Guys, make sure you get some sleep for tomorrow.”</p><br/><p>“Oppa… I’m scared.”</p><br/><p>“Me too.”</p><br/><p>“Many people died.”</p><br/><p>“Will we die too? What happens when you die?”</p><br/><p>“I don’t like bugs…”</p><br/><p>Elfa and the other kids barraged me with questions. I wryly smiled and consoled them until they fell asleep. Ren and Lebuik helped me as well.</p><br/><p>After the children all fell asleep, I put down Elfa, who was leaning against me, and put a blanket over her. Then, I stood up.</p><br/><p>“Ren, I’ll be off for a bit.”</p><br/><p>“Got it. Um… Thank Miss Ectradion for today.”</p><br/><p>“Sure.”</p><br/><p>As undead monsters never fell asleep, never felt tired, and carried out their master’s commands faithfully, they were practically born for night watch. Daisy’s undead minions were guarding the area around the tent. This didn’t mean that Daisy had to be awake. However, she seemed to have found it cumbersome to stay in the tent with others, as she said she’d stay outside.</p><br/><p>Seeing me leave the tent, Lotte, who was only in a light sleep, woke up and rose.</p><br/><p>“Hero, I’ll go too.”</p><br/><p>“No, Lotte. I’ll be back in a bit, so sleep. You did well today.”</p><br/><p>“Mm… If that’s what Hero says…”</p><br/><p>I then met eyes with Daisy, who was resting on Iana’s hard back.</p><br/><p>“Where are you going?”</p><br/><p>“To do some business.”</p><br/><p>“Un.”</p><br/><p>“Ren says thank you.”</p><br/><p>“Lion beastman?”</p><br/><p>“Yeah.”</p><br/><p>“I don’t like men. The feelings they have for me, even more uncomfortable. If they put them into action… Disgusting.”</p><br/><p>She thoroughly stomped on the seed that barely sprouted. I smiled bitterly as I spoke.</p><br/><p>“It’s out of respect for your overwhelming power. In his mind, he might be a bit forward, so forgive him.”</p><br/><p>“You respect me, too?”</p><br/><p>“Not really? I do think you’re a reliable ally that I can trust to protect my back.”</p><br/><p>“I see.”</p><br/><p>Even though she was the one who asked, she nodded her head somewhat apathetically. Then, she looked at me and asked.</p><br/><p>“Is it really okay, like this?”</p><br/><p>“Yeah, it’s fine.”</p><br/><p>“… Okay. About battles, you’re genius. I trust you.”</p><br/><p>“Tomorrow, protect the children.”</p><br/><p>“Existences with potential, I like.”</p><br/><p>“Just call them children, really.”</p><br/><p>Daisy shook her head resolutely and added.</p><br/><p>“Children aren’t, only ones with potential. Others have potential too, like you.”</p><br/><p>“Thanks for the compliment. For the record, you have it too. Potential.”</p><br/><p>“Yes, I know. Now, I like me too.”</p><br/><p>“Y-Yeah, that’s good.”</p><br/><p>The corner of Daisy’s lips curled up in a smile. Caught off guard by her mesmerizing smile, I fell in a daze for a brief moment. I then let out a dry cough and walked off after saying goodbye. Daisy sent me off by weakly waving her hand.</p><br/><p>Monsters were active even deep into the night. In this short period of time, I felt like I crushed at least 30 of them.</p><br/><p>“I’m finally alone… Skill Synthesis.”</p><br/><p>‘I’ve been using it quite a lot in this world.’ I thought as a circular stone slab was summoned in front of me. I then opened my skill window and took out the skills I needed. In the supplement skill slots, I placed Heavy Armor Mastery, Death Counter, then Mana Absorption.</p><br/><p>In the base skill slot, I placed Soul Guard.</p><br/><p>“Huu… That’s it, right? Good. Skill Synthesis!”</p><br/><p>The materials were there, and the circular stone slab began to spin as it shone with a golden radiance. I looked at the slab in a daze, forgetting to even breathe. It didn’t take long. A transparent, dazzling symbol appeared, then jumped into my face as if it couldn’t wait any longer.</p><br/><p>[You obtained the unique skill, ‘Absolute Soul’!]</p><br/><p>When I read the skill description, my eyes widened. It was even more perfect than what I had imagined! Not only would it affect my future dungeon progress and monster subjugation, but it would also deliver me a sure victory in tomorrow’s battle.</p><br/><p>I smiled. My final night in the Panan continent was passing by quickly.</p><br/><p>Author’s note:</p><br/><p>Eh? You thought I’d tell you!? It’s a secret until the crucial moment! (Bang!)</p><br/>\n</div>"}