{"title": "Chapter 210. The Third Taming (1)", "id": 210, "volume": 3, "url": "http://boxnovel.org/infinite-competitive-dungeon-society-chapter-210-the-third-taming-1", "volume_title": "Volume 3", "body": "<h1>Chapter 210. The Third Taming (1)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 210. The Third Taming (1)</p><br/><p>The surrounding scenery began to melt like when entering gates. Before I noticed, I found myself on a sunset hill. In front of me was a Gothic style castle that seemed to pierce the heavens.</p><br/><p>The castle’s gate then creaked open even though no outside force had touched it. In an instant, the atmosphere changed as the castle seemed to have gotten closer to me. A sweet scent emanated from inside, which seemed capable of enchanting all men. I found that Absolute Soul was already fully activated.</p><br/><p>“My mind… seems fine.”</p><br/><p>Peruta Circuit was also circulating at its maximum speed. As I was closing in on mastering it, as long as I willed it, Peruta Circuit would activate. Mana raged through my body and solidified my mental defense. At the same time, it covered my body thoroughly, protecting me like a shell. Now, I could imitate Peruta to a certain extent.</p><br/><p>“Succubus’ Castle… It looks like I need to go in with a firm resolve.”</p><br/><p>I prepared myself to use the power of god’s true name. With Zeus’ power, I could break through most obstacles. Unfortunately, I couldn’t use Caduceus yet.</p><br/><p>“Sharana, come inside my crossbow. Peika, you come inside me. Ruyue, come into my armor.”</p><br/><p>[Got it!]</p><br/><p>[Hu, huhuhu.]</p><br/><p>[Un!]</p><br/><p>Even though I was sucking in the surrounding mana with Peruta Circuit, having all three elementals active still slowly used my mana. However, there was no problem. I could just steal some from the enemies waiting for me inside the castle.</p><br/><p>“Let’s go.”</p><br/><p>After murmuring to myself, I lightly kicked off the ground and jumped into the castle. A large, luxurious hall entered my sight. There were succubi in formations everywhere I looked.</p><br/><p>They all had unique appearances, but were still absolute beauties that could topple kingdoms. Just by glancing at them once, most men would undoubtedly have been enchanted. They were completely different than the succubi I’d seen in the dungeon. However, I couldn’t quite tell what the exact difference was.</p><br/><p>The succubi in front of me seemed to have been waiting for me. Their eyes were looking at me like women in love, and their hands were cusped on top of each other politely. Most importantly, they all seemed to be bowing.</p><br/><p>… Strange. They weren’t in a battle stance.</p><br/><p>“We were waiting.”</p><br/><p>The doubt in my heart was crushed in an instant.</p><br/><p>“Waiting? For who? Me?”</p><br/><p>I asked the girl… the succubus. Unlike the other succubi here that were dressed in rather revealing clothing, the one greeted me just now showed little skin. She was wearing a luxurious leather jacket and leather pants. Her bat wings also looked slightly different than the others’.</p><br/><p>I instinctively knew that she at least had the strength to make me draw my weapon. When I raised my crossbow and asked, she realized the battle spirit I was emitting and once again lowered her head.</p><br/><p>“Please retrieve your hostility. We have no intention or ability to fight you.”</p><br/><p>“Yeah, that’s what I thought. This place should be an SSS rank dungeon, but you guys are… too weak.”</p><br/><p>“Huhu, so you really were the one she was waiting for. Please follow me. You will be able to enjoy a battle befitting your dignity.”</p><br/><p>“She’s the boss of this place?”</p><br/><p>“This way.”</p><br/><p>I followed the succubus and left the hall. The other succubi lined up against in parallel and… right, they were bowing to me. But why? What was up with these succubi’s ingrained politeness!?</p><br/><p>Everything I knew about succubi seemed to escape my head. Did I already fall for their trap? Or was this entire castle an illusion…? No, that didn’t make sense.</p><br/><p>“Come inside. The queen is waiting.”</p><br/><p>When I snapped out of my thoughts, I was in front of a large door that resembled the Floor Master door. I couldn’t help but ask the succubus that led me here.</p><br/><p>“You want me to start with the boss? Do I fight the rest of you after I take care of her?”</p><br/><p>“Whatever you wish.”</p><br/><p>I couldn’t understand what she was planning. With a hint of doubt, I kicked open the door. Boom! With an explosive sound, the door crumbled down and the scene beyond the door was revealed.</p><br/><p>As the castle and door were something out of a movie, I expected to see a red carpet that led to a throne, but that wasn’t it. Inside was another large hall and a young girl that was standing with her eyes closed.</p><br/><p>Though she had the frail appearance of a young girl, her flowing pink hair glowed, seemingly revealing that she wasn’t human. She also had two horns that protruded out to the side and curved like lamb horns. Furthermore, she was wearing a thin see-through dress. Thankfully, I didn’t need to look away as she was also wearing silver armor that covered her like a swimsuit.</p><br/><p>In terms of appearance, she looked like she was Yua’s age. However, as expected of the queen of succubi, she had a pair of voluptuous breasts. It’s okay! I believe Yua will grow one day! One day!</p><br/><p>She opened her eyes. Starlight gathered in her pink pupils. Seeing her eyes flashing wildly, my mouth twisted into a smile and I resisted her gaze with my own eyes.</p><br/><p>This girl had Evil Eyes.</p><br/><p>“Truly… a perfect warrior. Is the only thing you want from me a battle?”</p><br/><p>As expected, her voice was also young. However, her voice contained a firm authority and strength. As a show of respect for her strength, I answered honestly.</p><br/><p>“No, my goal is the reward I’ll get after I defeat you.”</p><br/><p>“Then raise your weapon. We can talk afterwards.”</p><br/><p>The Succubus Queen spread out her arms. Her silver fingernails elongated and glistened. The moment I saw her provocative smile, I shot dozens of bolts and charged at her with Divine Speed. Through Weapon Swap, the weapon in my hand had already become the Chaotic Spear. Sharana also switched to the spear and strengthened its power.</p><br/><p>“Ut!”</p><br/><p>“Let’s see if you can continue to act cool!”</p><br/><p>While the Succubus Queen created a magical shield to protect herself from the bolts, I ducked under and dug into her defense. I then shot my spear upwards, aiming for her chest area. She seemed to be specialized in magical abilities, as even while blocked the bolts, she summoned dozens of bats to block my path.</p><br/><p>As I had expected some form of resistance, I wasn’t caught off guard. My armor shone brilliantly and all the bats dropped down, frozen to chunks of ice. My spear then clashed with the Succubus Queen’s nails, which she hurriedly moved in front of her chest. Although my goal was to pierce through her body, I was surprisingly blocked by her physical resistance.</p><br/><p>This was the level of a Floor Master? She was much stronger than even the monsters in Beyond! Even while I couldn’t hide my surprise, I reacted quickly. I instantly took back my spear and thrust forward.</p><br/><p>“Heroic Strike!”</p><br/><p>“Kuk! You barbaric man!”</p><br/><p>What shocked me even more was that the Succubus Queen could follow my movements to a certain extent. This was when I was under the effect of Divine Speed! She created another magical barrier. When it was pierced through by my Heroic Strike, she spread out her wings and blocked the attack with a wave of silver aura.</p><br/><p>However, Heroic Strike could not be stopped with just that. My spear perfectly hit her stomach, and the force she couldn’t completely block sent her flying back.</p><br/><p>“You’re strong, but you have no manners… You must not be popular with women.”</p><br/><p>“Sorry, but I am.”</p><br/><p>I grinned as I retorted. Then, I shot a whirlpool of chaos flames toward her. Frightened, the Succubus Queen flew up. I used Talaria and followed after her.</p><br/><p>“You’re a Hero!”</p><br/><p>“Yep, I am.”</p><br/><p>“The blessing on your body! And that recklessness! Truly the role model of Heroes!”</p><br/><p>With that, the Succubus Queen drew a magic circle in the air. No, it was not a physical magic circle. It was a magic circle that maximized the power of her Evil Eyes of Charming. I also drew my Evil Eyes’ power to the peak and pulled up the power of Absolute Soul and Overwhelm.</p><br/><p>Pzzt! The magic circle crackled with sparks, but soon disappeared. For the first time, the Succubus Queen made a shocked expression.</p><br/><p>“You resisted my charm!?”</p><br/><p>“You didn’t fall for my petrification, so we’re even!”</p><br/><p>I used Divine Speed once again. As I could steal mana when I hit her, I didn’t need to conserve mana. I arrived in front of her in 0.2 seconds, shook off her broken magic circle’s attempt to restrain me in 0.3 seconds, and deal another blow to her leg. By the 1 second mark, I was thrusting my spear consecutively with Lightning Spear Storm.</p><br/><p>“Die!”</p><br/><p>“You’re an impatient one, aren’t you!?”</p><br/><p>The Succubus Queen’s body shone in multiple areas. Magic circles appeared in every spot my spear targeted and made great efforts to block the spear attacks. Even so, my mana was filling up slowly. It meant she was properly taking damage.</p><br/><p>“I was waiting for a warrior of this caliber, but I cannot dishonor the name of Succubus Queen!”</p><br/><p>In the next moment, she reached out and grabbed my spear. While the aura emanating from her fingernails and the lightning aura enveloping my spear clashed and dyed the room in a brilliant light, her face pushed up against mine. When we were close enough that I could count the number of her eyelash strands, she pushed her full lips against mine.</p><br/><p>Realizing what she was about to do, I used Divine Speed for the third time and headbutted her. I then raised my foot and quickly kicked her away.</p><br/><p>“Kyak!”</p><br/><p>The Succubus Queen teared up. Rather than physical pain, she seemed to have received great psychological shock. She shouted at me.</p><br/><p>“You refused my kiss! Are you really a man!? How can you kick a girl like that!?”</p><br/><p>“Fight with your strength!”</p><br/><p>“This is a Succubus’ strength!”</p><br/><p>“Charms don’t work on me!”</p><br/><p>I shouted back annoyed as I crashed down on the ground. I had activated Gaia Buster. I had even used Sacrifice as well. The hall crumbled, and the countless number of rock shards that shot up was enveloped with a black aura. With an expression of utter shock, the Succubus Queen created several barriers.</p><br/><p>“You!”</p><br/><p>“Since you invited me, defeat me with your strength!”</p><br/><p>Instead of the crumbled ground, I kicked off the air with Talaria’s power and charged toward her. The brilliant power of Hero filled my spear and mixed with chaos flames, forming a whirlpool that was hard to describe. Facing me, the Succubus Queen spread out her wings. Pink aura enveloped her hands.</p><br/><p>“You’re truly manly! But if you don’t differentiate between your targets, you’ll be hated!”</p><br/><p>“I prefer being cursed by targets that’ll soon die!”</p><br/><p>“I won’t die!”</p><br/><p>My spear clashed with the Succubus Queen’s aura, and an explosion broke out. Though we both received damage, I attacked her once again. Her raw strength was similar to mine! However, in terms of technique and skill…!</p><br/><p>Peruta Circuit vibrated fiercely, speeding up the rate the whirlpool of aura rotated. As I poured more mana into my attacks, the Succubus Queen received more injuries and more mana flowed back into me. The Succubus Queen widened her eyes in surprise.</p><br/><p>“My mana…? We were the same kin?”</p><br/><p>“Sorry, but do I look like someone that can seduce women wherever I go? I simply obtained the Mana Eater’s power!”</p><br/><p>I shouted and poured more strength into my spear. I used Heroic Strike once more and activated Sacrifice at the same time. If she didn’t die with this, I would be in trouble. However, her intelligence was high and her magical barriers were extremely annoying. The solution was to push through when I saw an opening! Although this wasn’t the strongest attack I could muster, I put enough strength to destroy Seoul in a single blow.</p><br/><p>Just when I was about to thrust forward, she smiled and spoke.</p><br/><p>“You pass, Dear Husband. In every regard!”</p><br/><p>Two words I’d never heard in my lifetime made me lose strength. I couldn’t believe my mentality was so weak that I’d be shaken by words. Thinking that I needed to train myself when I got back, I tried to thrust forward once again. This time, she spoke more clearly.</p><br/><p>“Since we worked off good sweat, why don’t we take some rest and talk, Dear Husband?”</p><br/><p>“Don’t say something that would make other people misunderstand!”</p><br/><p>I couldn’t help but interrupt her.</p><br/><p>Author’s note:</p><br/><p>The title says everything! There’s nothing to doubt! Yep!</p><br/><p>No, she’s not a heroine! There are only four heroines, and it will stay that way! I also have four tamed beings planned just like four elementals, but I’m still deciding whether the last one is going to be male or female…</p><br/><p>Translator’s note:</p><br/><p>I already like her.</p><br/>\n</div>"}