{"title": "Chapter 216. What's a Hero Anyways? (2)", "id": 216, "volume": 3, "url": "http://boxnovel.org/infinite-competitive-dungeon-society-chapter-216-whats-a-hero-anyways-2", "volume_title": "Volume 3", "body": "<h1>Chapter 216. What's a Hero Anyways? (2)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 216. What's a Hero Anyways? (2)</p><br/><p>“I don’t even know where to begin.”</p><br/><p>With how huge the Dragon Zombie was, it didn’t feel real. As a test, I aimed my crossbow at its eye… No, they had already rotted away into oblivion! That meant the effect of my Evil Eyes would be halved. Furthermore, since it was an undead, charm wouldn’t work on it either. There was no chance to use all the weapons I honed through grinding the 65th floor.</p><br/><p>[Guooooooooo!]</p><br/><p>“Kuk, it’s coming!”</p><br/><p>For a zombie so big, the Dragon Zombie charged towards me with an incredible speed. I hurriedly soared into the air and dodged its charge. However, when it smashed into the wall, a countless number of bone spears shot out of the walls toward me.</p><br/><p>“What!?”</p><br/><p>Shocked, I twisted my body in the air. However, with how many there were, it was impossible to dodge them all.</p><br/><p>“Ruyue!”</p><br/><p>[Un!]</p><br/><p>Thousands of ice crystals formed around my armor, blocking the bone spears. Even so, a few managed to break through the ice, damaging me. I could feel a considerable amount of mana flowing into me. it meant that although this Dragon Zombie was an undead, it possessed an enormous amount of mana.</p><br/><p>“Eat this!”</p><br/><p>I consecutively fired dozens of bolts brimming with lightning. Thanks to its huge body, the bolts hit their mark without any resistance and crackled with lightning. Even so, they didn’t seem to affect the Dragon Zombie too much.</p><br/><p>“Kuk, there goes my bolt spamming plan.”</p><br/><p>Without hesitation, I swapped my weapon. At that moment, the Dragon Zombie roared. ‘Your roars won’t work!’ was what I wanted to shout, but contrary to my expectations, terrifying bone spears pierced through its rotted skin and shot out of its body similar to when it hit the wall before.</p><br/><p>[Guooooooooooo!]</p><br/><p>“This bastard…!’</p><br/><p>It was like a machine gun endlessly firing bullets. With how many bone spears it was shooting out, it was difficult to even get near it. However, the crossbow bolts had little to no effect, and it was impossible to tell how long it would take to kill it with just the power of my elementals. Just like always, I had to take part in this fight by close combat.</p><br/><p>I grabbed one of the thick bone spears that shot towards me. With Chaotic Spear in one hand and the bone spear in the other, I charged forward. Of course, I didn’t forget to activate Divine Speed.</p><br/><p>[Guooooooo!]</p><br/><p>“Uraaaaaaaaaaah!”</p><br/><p>All the bone spears seemed to be traveling slowly. Using the spears in my hands, I hit them away like a headless chicken. What was a mere 3 second period felt like 30 seconds as I closed the distance between me and the Dragon Zombie.</p><br/><p>“Eat this. Heroic Strike!”</p><br/><p>By sending the aura-filled bone spear in my hand flying, I obliterated the clump of bone spears in my path. Then, holding onto the Chaotic Spear with both hands, I shot towards the Dragon Zombie’s neck. Even though it didn’t have any eyes, it managed to detect me, as it opened its mouth to swallow me whole. Hmph! I stabbed my spear into its nose bridge and let the gathered energy detonate.</p><br/><p>[Critical Hit!]</p><br/><p>“Come on, even a critical hit can’t cut off a bit of its flesh!?”</p><br/><p>[Kuaaaaang!]</p><br/><p>“Ruyue!”</p><br/><p>As I was expecting, it shot out a large bone spear from the attacked area. Honestly, it looked like a dragon, but it really was a damn cactus! I quickly pulled my spear out and drew forth Ruyue’s power. When the bone spear was close to piercing my chest, the freezing energy made it flinch, and I safely escaped using this opportunity. A moment later, the giant bone spear passed by my head and shredded through the air.</p><br/><p>[Guoooooooooooooo!]</p><br/><p>Immediately afterwards, the Dragon Zombie charged! Though I knew what would happen when it hit a wall, I had no choice but to get out of its way. After all, I couldn’t take a charge from its 200 meter long body!</p><br/><p>“Ruyue, barrier! Sharana, strengthen it!’</p><br/><p>[Got it!]</p><br/><p>[Yes, Master!]</p><br/><p>I distanced myself from the walls as much as possible and ordered my elementals to create a barrier around me. Then, I troubled over what to do. Should I continue?</p><br/><p>“No, I’ll die if I do.”</p><br/><p>The Heroic Strike just now had a good amount of my mana, and was even a critical hit. Ordinary Floor Masters would have lost half of their health with that attack. However, that bastard didn’t even flinch! Damn! Plus, I would be in trouble the moment I was hit by even a single bone spear. Could this battle get any more unfair?</p><br/><p>“Everyone would have taken out their god’s true names here and still died.”</p><br/><p>However, I wouldn’t die. I had two god’s true names! Plus, I had…</p><br/><p>“Alright, I’ll show you my full strength, you goddamned lizard!”</p><br/><p>I frantically dodged the bone spears that broke through the ice barrier as I shot my body upward. Soon, this huge space’s ceiling was in my view. Though I didn’t know what material it was made of, there wasn’t even a scratch even with all the bone spears that struck it.</p><br/><p>“Found it.”</p><br/><p>The special large sized bone spear it shot out when I attacked it before! I flew up and grabbed it. Then, I moved Peika, who was inside the Chaotic Spear, to the bone spear. The Dragon Zombie was watching me with its hollow eyes. It then flapped its rotting wings. It was trying to fly!</p><br/><p>“Huu… Gigant Time!”</p><br/><p>The already big bone spear became a hundred meters long. The weight in my hand caused me to groan, but it was still acceptable.</p><br/><p>“Ruyue, materialize into human form! Hold that guy!’</p><br/><p>[Un!]</p><br/><p>After leaving my armor and materializing into the form of a beast girl, Ruyue drew a silver trajectory as she shot toward the Dragon Zombie. Human-form materialization had granted her a terrifying upgrade in power, as she grabbed the bone spears the Dragon Zombie shot out one by one, froze them, and shot them back.</p><br/><p>Meanwhile, I activated the skill I received from the 60th Floor Master Superior Doppelganger.</p><br/><p>“Powered Form!”</p><br/><p>In that instant, a thicker and sharper armor appeared over my armor. The Superior Doppelganger possessed the ability to copy the powerful genes of its enemies to strengthen itself. The skill I received somewhat reflected this characteristic.</p><br/><p>[You activated Powered Form. Your defense and attack power increases by 30% for 5 minutes.]</p><br/><p>“Sacrifice!”</p><br/><p>A black aura enshrouded my spear. With this, the spear had doubled in power. If I used Heroic Strike, it would undoubtedly hurt. However, I wasn’t done yet.</p><br/><p>“Sky God’s Rage!”</p><br/><p>[Good, Master! I’ll maximize its power!]</p><br/><p>Zeus’ lightning descended on the 100 meter long spear. Any impurities left in the bone spear was completely washed clean, as it overflowed with pure golden divine power. It was almost as if it was a completely different weapon. Seemingly understanding the power behind it, the Dragon Zombie desperately shot out bone spears.</p><br/><p>[Careful!]</p><br/><p>“It’s over!”</p><br/><p>Now that I’d used Sacrifice, if it didn’t die after this, I would likely die. However, a real man didn’t hesitate! I threw the 100 meter long lightning. One could imagine how large this space was with how long the spear flew. Right, such an enormous spear could fly for 2 seconds, even when it was so fast that I could barely discern it with my eyes!</p><br/><p>[I can’t hold it back anymore!]</p><br/><p>“Let go! Now!”</p><br/><p>The moment I gave the order, Ruyue let go and flew back to me. At the same time, the lightning spear flew by her side and pierced through Dragon Zombie’s neck, skewering it perfectly.</p><br/><p>[Critical Hit!]</p><br/><p>“Kuhuk!”</p><br/><p>I immediately coughed out a mouthful of blood. It also hurt like hell. My head felt blank. Because of how much life force I lost in an instant, I felt my body go limp. However, I grit my teeth and raised my head.</p><br/><p>“Did it die?”</p><br/><p>[It didn’t die!]</p><br/><p>Peika exclaimed as she left the bone spear and flew back.</p><br/><p>I barely steadied myself in the air and examined the Dragon Zombie. The bone spear was still skewering it and erupting out with Zeus’ divine power. With how the spear was sticking out from its mouth, it really did look like a kabob skewer.</p><br/><p>[Guoooooooooo!]</p><br/><p>However, even with a giant spear penetrating it, the Giant Zombie Dragon only let out pained screams as it flapped its wings to fly up. To think it was still alive… it really did have a zombie-like life force. Wait, it really was a zombie! Damn!</p><br/><p>“Haa, haa… Kuk, this feeling.”</p><br/><p>[Devourer activates! Choose a target!]</p><br/><p>With my HP hitting 10%, Devourer activated. I was thankful Sacrifice left 10% of my HP. Otherwise, Diehard would have undoubtedly aviated.</p><br/><p>That said, I didn’t think this Dragon Zombie could withstand the attack that crushed the Power Basilisk. Not to mention, it was even stronger than before. Though there were other explorers attacking the Power Basilisk, even taking that into account, this bastard was stronger than the Power Basilisk! How is that fair!?</p><br/><p>[Guooooo!]</p><br/><p>“Well, it’s not completely absurd, I guess.”</p><br/><p>Dozens of dark spheres rose up in the air. Seeing as how strength was leaving the Dragon Zombie’s body, these dark spheres seemed to be the demonic energy forming its body. Even if it couldn’t use magic, it looked like it could still utilize this energy.</p><br/><p>For getting rid of disgusting things, burning it was the best.</p><br/><p>“Peika, it’s your turn. Materialize.”</p><br/><p>[But Master, Master’s mana is…!]</p><br/><p>“It’s fine.”</p><br/><p>Now, it was time for my tattoo to shine. I immediately activated the Succubus Queen’s Tattoo. My mana, which had fallen to the bottom of my reserves with Ruyue’s materialization and the Heroic Strikes, skyrocketed, only stopping when it reached double the usual amount. My body was still worn-out from Sacrifice, and with mana suddenly filling up, I felt short of breath. Peika seemed to have realized how I was feeling, as she hurriedly materialized.</p><br/><p>[I’ll protect Master from that evil energy!]</p><br/><p>“Thanks.”</p><br/><p>My HP was at 10%. Although I gulped down a Health Potion, my HP only went up slowly. It seemed the recovery was being hindered by Devourer’s effect. It was as if it was telling me not to play any tricks. I clicked my tongue and held up the Chaotic Spear. Then, gathering up the overflowing mana within me, I formed a whirlpool of chaos flames.</p><br/><p>“Desire Thorn, Sacrifice.”</p><br/><p>I activated the other two skills my armor, Pure Black Desire, had. The former increased the power of charge type attacks by 50% and helped me regain HP, while the latter doubled a skill’s power in exchanging for making me take 25% of the damage. Since Devourer was also active, Pure Black Desire’s abilities were in full effect.</p><br/><p>[Guoooooo!]</p><br/><p>[Hmph!]</p><br/><p>The demonic energy balls flew toward me. Peika harrumphed and burned them up with her lightning. I also charged as I shouted.</p><br/><p>“Kuaaaaaaa!”</p><br/><p>[You activated Frozen Roar! All enemies in the battlefield freezes in place. All allies temporarily become super-armored and all abilities are increased by 50%. Your chance of landing a critical hit doubles when fighting enemies affected by Frozen Roar.]</p><br/><p>“If you’re alive after this, then I’ll call you Hyung-nim!”</p><br/><p>The Twin-headed Ogre’s Tattoos on my arms let out a bright red glow as if they were on fire. Once per day, increasing close-ranged attack skill’s damage by 50%! It went without saying that charge type skills were close-ranged skills.</p><br/><p>“Eat this! Wind King’s Rage!”</p><br/><p>I shot down towards the Dragon Zombie. As there were no trash monsters between us, I charged in full throttle. Focusing the enormous wind and lightning energy at the tip of my spear, I thrust forward.</p><br/><p>“Haaaaa… Kuk!”</p><br/><p>Immediately before my spear stabbed it, a bone spear struck my chest. Although it didn’t penetrate my armor, the enormous shock devoured what little HP I had left. I couldn’t believe it still had bones to shoot out!</p><br/><p>[Guoooo!]</p><br/><p>“I’m not dead yet, fucker!”</p><br/><p>Although I thought I would die for a second, Diehard activated soundly and raised my HP back up. With how low my HP was, there was no way I would’ve charged head on without an insurance.</p><br/><p>Although Devourer tried to hinder Diehard’s recovery, my HP was thankfully going up. Although my charge’s momentum was cut short, I continued forward and stabbed my spear in the Dragon Zombie’s head. At the same time, Desire Thorn and Devourer’s effect activated. Black energy left the screaming Dragon Zombie’s body to become absorbed by me, but dissipated due to Sacrifice’s penalty.</p><br/><p>As I gasped for breath, I examined the Dragon Zombie, hoping it would scatter into particles of light.</p><br/><p>[Kuooo, kuooooooooo!]</p><br/><p>“What, you’re still not dead!?”</p><br/><p>It roared. Lumps of flesh sprung up from its body like boiling water. It was trying to spit something out. In panic, I shouted.</p><br/><p>“Just die already! Crimson Roar!”</p><br/><p>In the next moment, everything within my sight turned red. The Dragon Zombie’s roar and my shout both became flames. In this space, only flames existed.</p><br/><p>With that, it was over.</p><br/><p>[Congratulations! A first in Beyond’s history! You defeated the Floor Master, Dragon Zombie, on your first try!]</p><br/><p>Author’s note:</p><br/><p>Kang Shin didn’t want to serve the Dragon Zombie as his hyung.</p><br/>\n</div>"}