{"title": "Chapter 221. Overlord (1)", "id": 221, "volume": 3, "url": "http://boxnovel.org/infinite-competitive-dungeon-society-chapter-221-overlord-1", "volume_title": "Volume 3", "body": "<h1>Chapter 221. Overlord (1)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 221. Overlord (1)</p><br/><p>The 17 members of Revival along with Plene, Lotte, and Licorice, totaling 20, got on Hwaya’s private plane. As the succubi battle units were already in the Philippines, only we needed to go. For the record, Walker was the pilot, being unexpectedly skilled in many areas.</p><br/><p>Among these members, not everyone was harmonious. In particular, although I hadn’t been paying much attention, the monster members didn’t get along.</p><br/><p>“You vulgar bat, get off of Hero’s lap.”</p><br/><p>“Are you stupid because you’re bird-brained? This is where I belong, Dear Husband’s lap. Stop squawking noisily and go away, wyvern. Your scales are getting in the way.”</p><br/><p>“I want to be next to Shin too…”</p><br/><p>As Plene was weaker in both magical and physical abilities, she had the least say, while Lotte and Licorice fought fierce psychological battles. Strictly speaking, Lotte was weaker than Licorice. However, Lotte was still above Licorice in physical abilities.</p><br/><p>Of course, I wasn’t too happy with this arrangement. The fact that they were fighting over me was even more troublesome. The other girls already gave me a headache, but now even the monsters were joining in!</p><br/><p>When I was just about to say something, a thin layer of ice spread over Licorice who was sitting on my laps.</p><br/><p>“Kyaaak! What’s this!?”</p><br/><p>“Daddy’s lap is mine.”</p><br/><p>Ina pushed off the slightly frozen Licorice and plumped down on my laps. I widened my eyes and shouted.</p><br/><p>“Ina! You can control your ice magic now!”</p><br/><p>“A little bit. Did I do well, Daddy?”</p><br/><p>“Yep, yep. Good job.”</p><br/><p>“Kuk, Dear Husband abandoned me…”</p><br/><p>“Serves you right, bat.”</p><br/><p>“You go away. And you too, sparkly eyes.”</p><br/><p>My daughter… My daughter was establishing order! Touched by Ina’s power to shoo the monsters away, I hugged Ina, who made cute noises.</p><br/><p>Ah, of course, Yua was sitting in the window seat next to me.</p><br/><p>“I wonder if my kids will be safe in the Philippines…”</p><br/><p>Yua murmured in worry and looked out the window, though there were only clouds in sight.</p><br/><p>“Are you talking about your mantises?”</p><br/><p>“Yes, they’re still young… so I’m a bit worried.”</p><br/><p>Although a few of them had died as they climbed the dungeon, most of the mantises survived and grew stronger with Yua. With the buffs Yua could cast as a Tamer, each mantis had power on par with an S rank monster. I couldn’t help but shiver thinking about how strong they would be when they fully grew up. Even now, they certainly weren’t weak.</p><br/><p>“Don’t worry. They look all grown up to me.”</p><br/><p>“They only got bigger in size. They’re still kids at heart.”</p><br/><p>“It’ll be fine. Guys grow up by being apart from their mothers.”</p><br/><p>“But there are more girls…”</p><br/><p>“Really?”</p><br/><p>I didn’t know. Sorry, mantis girls.</p><br/><p>In any case, they were live monsters and couldn’t enter the inventory like Daisy’s undead monsters. For when we needed to travel, we temporarily put them in the guild’s resort, Resting Place of the Angels. Yua would then go back to the dungeon and bring them out when she needed them. Looking back, obtaining Resting Place of the Angels was god’s work.</p><br/><p>“We’ll be there in thirty minutes. The succubi units cleared space for us to land, but with so many monsters are popping up from the ocean, they’re apparently having trouble holding on. Get ready. Yua, make sure you bring out your mantises when you see an opportunity.”</p><br/><p>“Yes, Unni.”</p><br/><p>“Shin, are you ready?”</p><br/><p>“Leave it to me.”</p><br/><p>Seeing the effect of my Evil Eyes strengthened by charm, I was sure everyone would be stunned. With a grin, I initiated Peruta Circuit. The time to release the power I had been hiding was getting closer.</p><br/><p>Twenty minutes afterwards, while the plane was still soaring through the sky, Hwaya shouted sharply.</p><br/><p>“Attack incoming!”</p><br/><p>The outside suddenly got noisier. At the same time, Hwaya did something, making the plane’s walls transparent as if we were floating in air. I mused, ‘Technology sure advances fast…’ However, now wasn’t the time for that. There were already monsters all around the plane.</p><br/><p>Of the flying monsters in the Philippines, there were harpies, giant eagles and hawks, dinosaur-like monsters, flying insects, and even wyverns. I immediately thought of capturing a strong male to introduce him to Lotte, but I rejected the idea when I turned around and saw Lotte’s cold and terrifying gaze. Damn, could my tamed beasts read my mind!?</p><br/><p>“An ambush by flying monsters. Daisy, can you take care of it?”</p><br/><p>“Kana, already on it.”</p><br/><p>Daisy answered confidently. Immediately afterwards, a ginormous tuna… like monster appeared in the air. I was wondering what monster Kana was. It was none other than Aikan, one of Daisy’s strongest undead monsters!</p><br/><p>“Kana, learned transparency. Grew up well.”</p><br/><p>Daisy strutted out chest and made a proud expression. I thought undead monsters couldn’t grow…? Regardless, it was amazing that it learned a new skill. Unlike what I thought before, it seemed undead monsters could grow.</p><br/><p>[Ooooooong!]</p><br/><p>Aikan cried reliantly. Just from that, some of the weaker monsters exploded. What a monster… Daisy’s obtaining it in the Panan continent couldn’t have been better.</p><br/><p>“Kana, send them flying. Beam!”</p><br/><p>The moment Daisy shouted, Aikan… no, Kana, opened its giant mouth and sucked in the surrounding air. Naturally, the nearby monsters couldn’t overcome the suction force and was pulled into Kana’s mouth. Most of the attacks towards Kana dissipated when they hit the light shooting out from Kana’s body, and even the attacks that managed to get through the light couldn’t penetrate Kana’s skin. It seemed flying monsters could be just left to Kana.</p><br/><p>[Guoooooooooo!]</p><br/><p>Finally, Kana shot out a giant pillar of light. Everything in its path was wiped clean, and as surrounding monsters moved to fill up the now empty space, it could clearly be seen that their numbers of thinning.</p><br/><p>“I’ve heard the description, but that thing is too overpowered!”</p><br/><p>“Kang Shin, almost won against Kana.”</p><br/><p>“What do you mean ‘almost’? I did win!”</p><br/><p>“Kang Shin fought, El Patiz. Can’t win against Kana.”</p><br/><p>“You…”</p><br/><p>While we quarreled, Kana leisurely took care of the rest of the monsters. With Kana guarding us, we safely landed on the coast.</p><br/><p>“Dear Husband!”</p><br/><p>“Dear Husband is here!”</p><br/><p>When we got off the plane, the succubi fighting the monsters all turned to face me. I could feel the other girls poking me with narrowed eyes. I’m telling you, it’s not my fault!</p><br/><p>“Is everyone off? Walker?”</p><br/><p>“I’m here.”</p><br/><p>After confirming that everyone had gotten off the plane, Hwaya stored the plane in her inventory. The monsters hurtling towards the plane changed their direction towards us, but were immediately shot down by the succubi’s magic.</p><br/><p>“Dear Husband, we’re extremely sorry to say this, but can you participate in the battle? Many kids are lacking in mana, so they can’t handle the monsters properly!”</p><br/><p>“Yeah, I’m going now!”</p><br/><p>I immediately summoned Sharana and infused her into my body. Although I also summoned Ruyue and Peika, I didn’t infuse them in my weapons. Spirit Aura was only needed against monsters I needed to put in effort to defeat. Against a large number of enemies, I only needed Sharana, and the other elementals were better off in their materialized forms.</p><br/><p>I soared into the air and shouted.</p><br/><p>“Fight me!”</p><br/><p>[You used Provoke! All enemies in the area charge in to kill you!]</p><br/><p>This feeling, I had felt it before. It was probably in the Panan continent. The feeling when all beings in the world were staring at me and attacking me. It was the moment when my heart tightened the most.</p><br/><p>“Die!”</p><br/><p>In one go, I fully released all the charm I had been holding back. At that moment, even I felt an electrifying scent. While I was rather annoyed, my Evil Eyes, strengthened to the extreme by my charm, radiated a powerful golden light and shone down on everything in my sight. In this regard, I couldn’t be happier with my high charm. Furthermore…</p><br/><p>Everything in the world became stone.</p><br/><p>“My god…”</p><br/><p>Hwaya murmured in a stiff voice. Everyone else also only stared at me speechless. I waved my hand and spoke.</p><br/><p>“Sorry, I fully released my charm, so you shouldn’t look at me for too long.”</p><br/><p>“Un, right… but well, it’s too late to try to ignore your charm, so don’t worry.”</p><br/><p>“Kuhum…”</p><br/><p>Hwaya, striking at this moment… I blushed and looked away.</p><br/><p>“Amazing! All monsters in this area was… Aaah, as expected of Dear Husband!”</p><br/><p>Other than me, Revival’s members, tamed monsters and the succubi battle units, all else had petrified with nothing spared.</p><br/><p>Rocks rained down on the ocean, making fountains spout up everywhere. Likewise on the earth, loud noises rang out as rocks hailed down.</p><br/><p>“Peika, can you destroy all the rocks that just fell down?”</p><br/><p>[I don’t want to go in the ocean… but okay, I got it.]</p><br/><p>“Ruyue, you know what to do, right?”</p><br/><p>[Leave it to me! Ice Rain!]</p><br/><p>The two elementals each charged to their designated area and started to break the petrified monsters. Then, the others finally snapped out and started to work on breaking the monsters. They didn’t forget to comment on what just happened.</p><br/><p>“At this rate, can’t we be done with the Philippines in just a day?”</p><br/><p>“I won’t be surprised if I get a Stone Breaker title. I’ve never experienced such boring monster hunting.”</p><br/><p>“Hey you! Make sure you get everything on camera! We have to record Dear Husband’s magnificent glory!”</p><br/><p>“Yes, Queen!”</p><br/><p>First, I stole the camera from the succubus taking Licorice’s orders. Then, feeling the presence of monsters in the distance, I calculated the amount of time we had until they came to a threatening range and confined my charm again. The scent that was emanating from me died down noticeably. Wait, didn’t that mean this scent could even be seen visually…!?</p><br/><p>“You’re not even human anymore, Son. Did you eat an air freshener?”</p><br/><p>“Shut it, Dad.”</p><br/><p>I retorted curtly at the snickering Father, as I held my spear back up. At that moment, Daisy murmured in regret.</p><br/><p>“Petrified monsters… can’t make undead.”</p><br/><p>“Oh…”</p><br/><p>That wasn’t it. Yua also made a vague smile and spoke.</p><br/><p>“Oppa, I can’t tame monsters when they’re petrified…”</p><br/><p>“Oh, mm… right…”</p><br/><p>I worked my brain helplessly. Then, I finally came up with an answer to solve this crisis.</p><br/><p>“Let’s find a monster that’s strong enough to withstand my petrification!”</p><br/><p>“Will there be one…?”</p><br/><p>“I don’t know…”</p><br/><p>Almost as if I used my Evil Eyes again, a somewhat unwelcome silence descended once again. Wanting to shake it off, I shouted energetically.</p><br/><p>“Now, let’s do this! I’m sure there will be a monster willing to be Yua’s friend!”</p><br/><p>“How irresponsible.”</p><br/><p>“Undead… my undead.”</p><br/><p>“Friend… will I find one…?”</p><br/><p>What, you’re unhappy with my performance!? You’re not being honest!</p><br/>\n</div>"}