{"title": "Chapter 225. Overlord (5)", "id": 225, "volume": 3, "url": "http://boxnovel.org/infinite-competitive-dungeon-society-chapter-225-overlord-5", "volume_title": "Volume 3", "body": "<h1>Chapter 225. Overlord (5)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 225. Overlord (5)</p><br/><p>[Sorry, Oppa. If I hadn't of made such an unreasonable request…]</p><br/><p>“No, rather, it’s good that you did. We can fight them before they’re fully prepared to take us on.”</p><br/><p>Although Yua had a large army, to the SSS+ rank Destroyers, mantises were nothing more than easily flammable bugs. They felt short in rank and were disadvantaged in attributes. Although Yua wanted to stay, saying that this expedition was planned partly because of her, when Father stepped in and gave her a stern talk, she had no choice but to go back to the guild house.</p><br/><p>[I’m sorry that I couldn’t help more…]</p><br/><p>“It’s fine. Yua will get stronger, you can help me then. For now… just pray for Oppa’s victory!”</p><br/><p>At the same time I replied to Yua, I shot my spear forward and blew up the Destroyer’s head. The lava that its head was composed of jumped up at me as if to melt my head, but with Flame Sucker’s power, it dissipated without having achieved any damage.</p><br/><p>[Un…! Oppa, good luck!]</p><br/><p>“For now, that’s enough!”</p><br/><p>I could really feel myself brimming with energy! My younger sister was an angel who always thought about me and cared for me. For her, I had to go back safely! I looked for the next target and charged. I charged, and charged again.</p><br/><p>[Uooooooo!]</p><br/><p>The Destroyers’ earthshaking roar rumbled in my ear. The heat from the lava also made my sight hazy. Thundering sounds rang out from all sides, as the magic of the succubi and the aura attacks of the other guild members cut through the air and faced the Destroyers.</p><br/><p>“Eat this and die!”</p><br/><p>I drew on Peika’s power to the limit, shooting down several Destroyers and absorbing as much mana as I could. Although I had to make contact with the enemies to do so, as long as I fought in close-range, Absolute Soul could absorb about the same amount of mana as I used in my attack.</p><br/><p>Considering the fact that I was also using Peruta Circuit, my mana didn’t have a chance to go down. Of course, now that I had Ruyue materialized and fighting by herself, that wasn’t the case.</p><br/><p>[Hero!]</p><br/><p>“Speed up!”</p><br/><p>[Understood!]</p><br/><p>Few of those in the guild could fight and come out victorious against a Destroyer in a one on one fight. So, as to lessen the danger they would face, I had to defeat as many as I could. With Wind King’s Rage, even if I didn’t kill them in one blow, I could at least neutralize them! I used Provoke to draw the enemies toward me once again as I charged through the air with Lotte.</p><br/><p>[Crown Prince, if you push yourself too much and get hurt, it’ll be the end! My father also…]</p><br/><p>[I’m not pushing myself, don’t worry!]</p><br/><p>All this time, I had worked hard to get stronger for this moment! Compared to climbing the dungeon day and night, challenging my limits in Beyond, and fighting the Floor Masters ten times a day, this much was nothing!</p><br/><p>“Haaaaaap!”</p><br/><p>Lotte’s wings wrapped around one of the scarlet flames flying toward us and returned it. Although it couldn’t damage the Destroyers, it could at least help stop its movements. Immediately afterwards, we charged towards a Destroyer and hammered it with a spear wrapped in a whirlpool of lightning.</p><br/><p>[Guaaaaa!]</p><br/><p>“Lotte, how many have we killed so far?”</p><br/><p>[178!]</p><br/><p>Lotte and I had already bathed in the Destroyer’s flames. Although I wasn’t hurt thanks to Flame Sucker, which nullified flames, Lotte’s body was already fairly burned. However, Lotte didn’t stop and continued to charge. Her injuries soon caught my attention.</p><br/><p>[Hero! Don’t think about useless things and attack, burns like these only take me a day to recover from!]</p><br/><p>“… Alright. Let’s go.”</p><br/><p>Wind King’s Rage did not end unless I stopped it. In other words, I could continuously deal wind, lightning, and charge damage. Thanks to the Giant Wolf’s Tattoo, I could also deal an additional 50% in damage.</p><br/><p>One thing that was somewhat regretful was that 60% bonus damage to charge type skills disappeared when I upgraded my armor to the Pure Black Desire. Instead, I had gotten Desire Thorn, which could steal the life force of others. This, however, was limited to once per day. In any case, I didn’t have the time to be listing out regretful things. Right now, I had to focus on using the abilities I had to kill the Destroyers in one blow.</p><br/><p>“Huaaaaap!”</p><br/><p>Even if Wind King’s Rage could be continued indefinitely, as it was a charge type skill, I had to keep charging for it to stay in effect. In other words, Lotte also had to charge without stopping.</p><br/><p>I opened my eyes widely and continuously thrust out with my spear. If I let my guard down even for a second, I would be charging into a Destroyer unprepared. I had to maintain my focus. If I had no experience fighting such battles, if I had not had those battles in the Luka continent and the Panan continent, maintaining a skill like this would have been unimaginable.</p><br/><p>[Critical Hit!]</p><br/><p>[Guaaaaa!]</p><br/><p>“Die!”</p><br/><p>[Master, I can feel the presence of a powerful existence!]</p><br/><p>Sharana, who was infused into my body, reported to me as we killed the 26th destroyer. Even as I continued to charge, I looked up and scanned the horizon. There, I saw a line of monsters marching, swinging whips made of lava.</p><br/><p>[They’re here! The Sweepers!]</p><br/><p>“Cleaners?”</p><br/><p>I didn’t know what they were trying to clean, but it was inevitable that I would have to fight them. I had to eliminate the Destroyers before that! I grit my teeth and shouted.</p><br/><p>“Lotte, charge! We can’t end this with just Wind King’s Rage!”</p><br/><p>[Gryaaaaaa!]</p><br/><p>Lotte roared and flapped her wings in response. The spear I shot out towards the Destroyers gathered wind and lightning and tore them to shreds.</p><br/><p>[Master, the wind energy is getting stronger! I can still control it, but I’m not sure if Master will be fine in the center of it all!]</p><br/><p>[It’s the same for me, Master. But since Master can even wield a God’s lightning, I think it will be okay!]</p><br/><p>“Right, I’ll be fine! This much is nothing!”</p><br/><p>Indeed, with just a single misstep, the wind and lightning gathered at the tip of my spear could easily explode and cause me to let go of my spear. However, my clan’s unique technique, which Heroic Strike was derived from, already required learning how to control such chaotic destructive power. Otherwise, it would have been impossible to squeeze out every ounce of power in my body to focus it in one point. The more I thought about it, the more I came to understand that my ancestors trained in rather perverted methods. Of course, since I was benefiting from that, I wasn’t complaining!</p><br/><p>“Ice Age!”</p><br/><p>In the distance, someone shouted. In an instant, a bone-chilling freezing energy reached where Lotte and I were located. I glanced toward the direction the freezing energy came from and saw Ina who was destroying dozens of Destroyers with lotus-like ice. Her truly incredible destructive power was fitting that of an SSS ranker.</p><br/><p>It seemed Ina had exerted a great amount effort to use that skill as she staggered. Although I wanted to go give her a hug, I couldn’t do so at the moment. I grit my teeth and continued to charge. Once I had taken care of everything, I would hug her as much as I wanted!</p><br/><p>“Uoooooo!”</p><br/><p>[They’re coming!]</p><br/><p>As the succubi battle units and the other members were all doing fantastic, over half of the Destroyers had fallen. Before I noticed, the atmosphere of the battlefield had changed, and the Sweepers were charging closer.</p><br/><p>[Their whips are dangerous! They’re hotter than the Destroyers’ swords and have the ability to elongate!]</p><br/><p>“That doesn’t sound like much!”</p><br/><p>I shouted spiritedly on purpose and drove Lotte towards them. If the Wind King’s Rage at peak power could not penetrate them, nothing could!</p><br/><p>[A living human!]</p><br/><p>[We love humans. They’re delicious!]</p><br/><p>[Human flesh is so tender, it just melts in your mouth!]</p><br/><p>When they noticed me, they sent their whips flying towards me as they blabbered incomprehensible things. I pushed the oncoming whips away with the wind energy around my spear and charged towards them.</p><br/><p>“Taste this delicious human flesh!”</p><br/><p>[Kuhuk!]</p><br/><p>When I stabbed the Sweeper with my spear powered by Wind King’s Rage, its powerful rotational power drilled a huge hole through the Sweeper’s chest. The Sweepers that witnessed their kin’s death widened their eyes and swung their whips, but I continued to charge forward without paying them any mind.</p><br/><p>Even if I were hit by the whips, with my cape’s ability to nullify flames, I barely received any damage. Not to mention, unlike Daisy’s whip, their whips’ movements were completely readable. There was no way I would be afraid of attacks I could read!</p><br/><p>[Kugyagyak!]</p><br/><p>[Human… Human, Human!!]</p><br/><p>“You guys are pretty tender yourselves!”</p><br/><p>After fighting a few of them, I could instantly tell their special characteristics. They certainly possessed flames more powerful than the Destroyer’s, but their constitution was weaker and hence had weaker defense! For me, they were much easier to deal with.</p><br/><p>“Lotte, dodge!”</p><br/><p>[Understood!]</p><br/><p>Lotte’s movements continued to get faster. Now that I thought about it, her abilities seemed to have doubled since the first time we met. She had also gotten bigger and more lustrous. This change could be easily seen by the fact that she was charging through SSS+ rank monsters when she was only an S+ rank monster at first.</p><br/><p>[Hero, there are more coming!]</p><br/><p>“I know! Keep charging!”</p><br/><p>I gripped the spear in my hands tighter. With a bold smile, I concentrated my energy into my spear. One’s martial path had to be honed through real combat. Charging forward with my life on the line, through infinite repetitions, I was coming to better understand the profoundness behind thrusting.</p><br/><p>The moment I mastered the high-rank Spear Technique, I thought I saw the end of manaless spearmanship. However, I was only 21. There was no way I could have mastered a lofty martial path in just 13 years. Now I understood that. At the same time, I understood that the skill system wasn’t perfect, and that simply relying on skill levels was the same as drawing a line to my limit.</p><br/><p>Furthermore, normal spearmanship couldn’t be the same as spearmanship while riding. The spear technique I displayed on Lotte’s back was certainly not the same as when I was on my own. The more I became attuned to Lotte, the more I read her movements and modified my own, my spear attacks would display greater prowess as it matched the limits of her speed!</p><br/><p>[Critical Hit!]</p><br/><p>After thrusting out again, the leftover force of the attack exploded the shoulder of a Sweeper standing next to the intended target. I immediately swung my spear to the side and struck his whip away. Lotte, who seemed to have read my mind, changed her trajectory and charged towards that Sweeper. Then, with a simple attack, I was able to take its life.</p><br/><p>As time went on, my attacks were becoming more destructive, though it still contained the same amount of power as before. It meant that my spearmanship was advancing in a realm where mana didn’t matter. I couldn’t help but smile knowing what was happening.</p><br/><p>Becoming stronger was this enjoyable! No matter how much at risk my life was, no matter how many enemies I had to face!</p><br/><p>“Good… Good!”</p><br/><p>[Hero, were you hit by a status effect!?]</p><br/><p>“I’m immune you mental status effects! Lotte, speed up!”</p><br/><p>[Hero!?]</p><br/><p>Wind King’s Rage didn’t stop. Until all the wind and lightning in the world gathered to the tip of my spear, my charge would not stop!</p><br/><p>[Guoooooo!]</p><br/><p>Just when I was thinking that, something blocked our advance. Although we tried to charge right through, my spear couldn’t penetrate it! I controlled the energy trying to run berserk, as I reluctantly took my stance for the final blow. I raised my head. I wanted to know just what my spear couldn’t penetrate.</p><br/><p>A giant over dozens of meters tall was glaring down at me. It wore a thick armor of fire and held a spear of fire that somewhat made me desire it.</p><br/><p>I asked Lotte.</p><br/><p>“Is this the Lava King?”</p><br/><p>[Sorry Hero, but no.]</p><br/><p>After hearing that, I sighed in relief. Not using Overlord the moment I saw him was truly a heaven’s fortune.</p><br/><p>It was the start of a middle boss battle.</p><br/>\n</div>"}