{"title": "Chapter 234. Guardian (4)", "id": 234, "volume": 3, "url": "http://boxnovel.org/infinite-competitive-dungeon-society-chapter-234-guardian-4", "volume_title": "Volume 3", "body": "<h1>Chapter 234. Guardian (4)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 234. Guardian (4)</p><br/><p>[I repeat, the dungeon will temporarily shut down due to one of the guild masters going missing. Only the Residential Area will be functioning until the guild master returns. Guild masters of guilds B ranked or above should immediately gather in the Residential Area’s plaza.]</p><br/><p>Message noona didn’t answer my question. I hastened to the Residential Area, while the guild communication channel became noisy.</p><br/><p>[Son, the dungeon’s monsters suddenly disappeared.]</p><br/><p>[Shin, have you heard?]</p><br/><p>[Shin-nim, where are you?]</p><br/><p>[Shin!]</p><br/><p>Agh, annoying! I told them I didn’t know anything as I ran to the plaza. When I arrived, the plaza was bustling with people. Soon, a familiar voice maintained the order.</p><br/><p>“If you are not a B rank or higher guild master, please step back! You do not have the qualifications!”</p><br/><p>The voice was telling the truth, yet was rather harsh. This person… no, elf was Loretta! I ran inside the plaza as I regained my composure. When Loretta saw me, she flapped her wings in greeting.</p><br/><p>“Shin-nim, you’re here!”</p><br/><p>“Loretta! I was worried because you weren’t at the Floor Shop!”</p><br/><p>“Huhu, were you worried that I went missing? There’s no way I would run away leaving my beloved Shin-nim behind!”</p><br/><p>Hearing Loretta’s words, I couldn’t help but smile. Seeing Loretta’s bright smile, I sighed in relief and looked around. Within the plaza, other than those related to the administrative guilds, there weren’t many outsiders. According to Loretta, there were only eleven including me. It seemed there really weren’t that many guilds above B rank.</p><br/><p>Loretta and three other administrative guild masters were present. I remembered what Loretta had once said. The First Dungeon has five administrative guilds with Fairy Garden being one of them. Since there were four administrative guild masters here, the remaining one should be the one that’s gone missing…</p><br/><p>Other than Loretta, I knew two administrative guild masters, and I couldn’t see one of them here. The woman helping Desert Scorpion from the back, Sipua.</p><br/><p>“Loretta…”</p><br/><p>“It’s as you think.”</p><br/><p>Loretta nodded with a slightly disheartened expression. She then looked at all the gathered guild masters and spoke in a louder voice.</p><br/><p>“Since everyone’s here, each administrative guild should take three guilds to explain the situation to. Then, start searching for Sipua. I will handle Phantom’s and Revival’s guild masters.”</p><br/><p>It seemed guilds that could grow to B rank was friendly with at least one administrative guild master. Seeing the guild masters walking towards administrative guild masters on their own, I also headed towards Loretta. At the same time, I caught sight of another guild master. A handsome man with a well-built body, clear features, long hair…</p><br/><p>“Hi! I’m Phantom’s guild master, Philoen!”</p><br/><p>“I’m… Kang Shin.”</p><br/><p>And small! No, tiny! He was practically palm-sized!</p><br/><p>“Philoen is a pixie. Are you surprised?”</p><br/><p>“It’s my first time seeing a pixie explorer…”</p><br/><p>“My continent had more pixies than humans! Though, it got captured by monsters over 300 years ago!”</p><br/><p>This was the first time I saw anyone talk about a continent’s ruin so lightheartedly. I stared at him dumbfounded. Loretta explained with a wry smile.</p><br/><p>“Pixies get power from emotions. Sad emotions lead to their death. That’s why he’s…”</p><br/><p>“I see.”</p><br/><p>“Hahaha, it’s fine, it’s fine. One day, I’ll save my continent!”</p><br/><p>“I believe you will.”</p><br/><p>300 years. If he’s stayed in the dungeon for that long, he must have gotten much stronger. When I asked Loretta by giving her a glance, she nodded her head.</p><br/><p>“Philoen is on the dungeon’s 91st floor.”</p><br/><p>“Hahahaha, I heard that no one’s gotten past the dungeon’s 92nd floor in the past 200 years!”</p><br/><p>“Anyways, follow me to Fairy Garden. I’ll explain the situation there.”</p><br/><p>When I looked around, the other administrative guild masters were also leaving with their respective guild masters. Only ordinary explorers left nearby were speaking noisily. As there was no reason for us to stay, Philoen and I also headed to Fairy Garden through the gate Loretta opened.</p><br/><p>“The dungeon’s operations are on hold!”</p><br/><p>“How’s the Second Dungeon? They stopped too? Damn it!”</p><br/><p>“The Fourth Dungeon contacted us? There is no new dungeon! There won’t be any Event Dungeons for a while too!”</p><br/><p>When I arrived at Fairy Garden, the usually relaxed atmosphere was nowhere to be seen as everyone was busily running around. With the playful elementals laughing brightly and imitating the people around them, the scene looked even more hectic. Few of the faeries caught sight of Loretta and rejoiced.</p><br/><p>“Master, you’re here!”</p><br/><p>“Sikatra and Lin are almost ready!”</p><br/><p>“Are the two of them…?”</p><br/><p>“Yep. You two, follow me.”</p><br/><p>The place Loretta led us was the pavilion I had seen a few times. Although it was usually crowded with people, it was currently silent. When I sat down on a chair, Philoen sat on the table. Loretta then sat across from me and let out a sigh.</p><br/><p>“I feel like dying. I didn’t want to do anything not related to Shin-nim, but something like this happened again.”</p><br/><p>“Does this happen often?”</p><br/><p>“This is the second time since the dungeon’s founding! During this long, long period… Kuhum, it’s not really that long, but still! This is the second!”</p><br/><p>Loretta emphasized another word to drive the attention away from the word ‘long’. Her ears were flapping particularly quickly.</p><br/><p>“Sipua that bitch finally did it. She tricked all members of her administrative guild and disappeared completely!”</p><br/><p>“Um… Can administrative guild masters leave their positions?”</p><br/><p>“They shouldn’t. That’s why the dungeon’s operations stopped.”</p><br/><p>Loretta paused for a moment, then continued in a slightly exhausted tone.</p><br/><p>“For the dungeon to function properly, all administrative guild masters have to in their appropriate positions. Even with one of them missing, everything becomes a mess. If two of them leaves the dungeon… then the dungeon will disappear, unable to maintain itself. The reason we called the two of you here is to help us find Sipua and bring her back.”</p><br/><p>Surprised by the weight of her words, I widened my eyes. Why did administrative guild masters disappearing affect the dungeon so much?</p><br/><p>“Loretta… What kind of an existence are the administrative guild masters?”</p><br/><p>“Heroes.”</p><br/><p>I short reply sounded out from behind me. When I turned around, I saw the elf Sikatra and Lin. Lin’s current appearance surprised me greatly. Though he had always worn light loose-fitting clothing, he was now wearing tight-fitting leather clothes with a handgun by his waist… Wait, gun?</p><br/><p>“Lin… Is that…?”</p><br/><p>“It’s my weapon. What, got a problem?”</p><br/><p>“Yes! Isn’t that a handgun!?”</p><br/><p>“What, did you think guns only existed in your world?”</p><br/><p>“But you can’t kill monsters with guns! Or is that “gun” a magical tool that only looks like a gun?”</p><br/><p>“My world was advanced civilization with science. Your world’s and my world’s guns probably aren’t that different in structure. The people in my world couldn’t kill monsters with guns too, but I’m different. I can strengthen guns and bullets with mana.”</p><br/><p>Lin spoke as if it was nothing. Leon naturally surfaced in my mind. Right, in a multiverse, it was unlikely that Leon’s ability was unique. It was undoubtedly an extremely rare ability, but to think that Lin also had it… A sword was more suitable for Lin than a gun. After all, he was a blacksmith!</p><br/><p>Not to mention, a long black gun hung on his back.</p><br/><p>“Isn’t that… a sniper rifle?”</p><br/><p>“It’s for the worst case scenario.”</p><br/><p>Lin spoke as if it was nothing, but I couldn’t help but feel uneasy. However, I refrained from voicing my concerns. There was something more important for me to ask.</p><br/><p>“Lin, you just said that Loretta is… a Hero?”</p><br/><p>“Yes, Shin-nim… I was a Hero. A Hero that couldn’t save her world, but had continued to hold the world’s power.”</p><br/><p>Loretta spoke instead of Lin. A faint regret could be seen on her face.</p><br/><p>“Shin-nim, do you remember what I told you before? About a time when the dungeon wasn’t what it was today, when the dungeon wasn’t even called the dungeon, a time when power was given to ability users differently.”</p><br/><p>“I think you said that the power was given away too easily…”</p><br/><p>“Too easily and also too much. In the end, it became so bad that the system would be destroyed if the power wasn’t retrieved. Simply put, Oldie did a terrible job… Kuhum, to be honest, the world’s enemy was so powerful that we couldn’t fight him unless we did that.”</p><br/><p>Loretta was also a Hero like me? It wasn’t that the thought had never crossed my mind, but it was strange hearing it from her mouth. Though I had come to know more about her, it felt like I had gotten more distant.</p><br/><p>“But Loretta is…”</p><br/><p>“Right. The First Dungeon’s five administrative guild masters were all Heroes who had once received the dungeon’s support. Some were defeated and some escaped, but in the end, all of us had lost to the world’s enemy.”</p><br/><p>“…”</p><br/><p>“Although I lost to him, I refused to die and give him the world’s power. I felt vexed, and I wanted to get revenge. I wanted to tear apart all who invaded my peaceful world. Even if they had their reasons, even if they were reluctant and forced into their spot, none of that mattered to me. The others felt the same, Sipua included. We wanted to help Heroes. We wanted to help those who helped Heroes.”</p><br/><p>“That’s why…”</p><br/><p>“After losing everything, we decided to join the Lord’s cause. We didn’t want other Heroes, other Guardians to face the same end we faced. Shin-nim wondered why the dungeon existed for side of the defenders, right? This is the reason.”</p><br/><p>Loretta looked straight into my eyes.</p><br/><p>“The dungeon was created by Guardians who had failed. To teach other Guardians, to test their potential, and to help them reach new heights. By giving blessings to raise their leagues, they would come to better protect their worlds.”</p><br/><p>I finally realized.</p><br/><p>The dungeon wasn’t a place of absolute virtue, nor was it a place of eccentrics with hidden secrets. It was a training school created by seniors who were powerlessly defeated in the same situation as us. All in order to help us not face the same defeat they had.</p><br/><p>“The dungeon is a practically a world maintained by the Lord’s and the administrative guild masters’ power. That’s why a single guild master running away can cause all this.”</p><br/><p>Lin slammed his fist down on the table as he spoke unhappily. Philoen’s body shot up from the force. Although he glared at Lin, Lin didn’t react in the slightest.</p><br/><p>“Kang Shin, there is a reason we summoned guild masters above B rank. Under the clause that all guilds should help the administrative guild maintain the dungeon’s function and existence, they are to help us in this time of crisis.”</p><br/><p>“I thought it was a meaningless filler clause, but it actually was useful.”</p><br/><p>I did remember such a clause being there when I signed up to create a guild. I had always thought it was for show, as I never imagined something like this would happen.</p><br/><p>“It would be nice if just us administrative guilds could resolve the problem without involving the explorers, but even there is a huge restriction on administrative guild members leaving for another world. Most importantly, they have to be accompanied by dungeon explorers. It has to do with maintaining the dungeon’s power. In truth, if the dungeon didn’t stop its operations, none of the administrative guild masters or the administrative guild members for that matter would be able to take even a single foot outside the dungeon.”</p><br/><p>“To be honest, I wanted to involve Shin-nim in this matter. Even if it was for the sake of the dungeon, putting a world’s Hero in danger wasn’t ideal. But there were just too few powerful explorers who we could call on for help. Other than Shin-nim, there are three other Heroes participating this time. I couldn’t leave Shin-nim out even if I wanted to.”</p><br/><p>“If it’s something I have to do as a guild master, I have no intention of being left out.”</p><br/><p>I spoke clearly. Then, I added.</p><br/><p>“But, I will run away if it’s dangerous!”</p><br/><p>“That’s only obvious. I’ll be with you, but if things look dangerous, just think about your life. Of course, not that it will happen.”</p><br/><p>“Am I going with Lin?”</p><br/><p>“What, you expect me to go with that midget instead?”</p><br/><p>“Who are you calling a midget, you stinking draconian!?”</p><br/><p>Philoen finally exploded. While the elf Sikatra who seemed naturally close to pixies consoled him, Lin continued to ignore Philoen as he spoke to me.</p><br/><p>“I’m personally expecting a lot from you, so cooperate.”</p><br/><p>“If I can be of help, of course I will. But there’s something I haven’t heard yet. Why did she escape and to where?”</p><br/><p>“Isn’t that obvious!?”</p><br/><p>‘I know, I just wanted to check…’ I glared at Lin and conveyed my intentions. Lin didn’t pick up on my sign at all and growled at me. Seeing the two of us, Loretta smiled and spoke.</p><br/><p>“Sipua headed to the world conquered by the Book Walkers, the Sylon continent. She went to meet her love, Lodert Hydelcyon, a former guild master of the massive Desert Scorpion guild. Though, that’s if he’s alive.”</p><br/><p>Yep, that’s what I thought.</p><br/><p>If I had to choose a dungeon explorer to help me in this mission, there really was only one choice.</p><br/><p>Thinking that I would have to once again ask Daisy for her help, a small sigh left my mouth.</p><br/><p>Author’s note:</p><br/><p>Shin and Lin’s joyful isekai travel starts now! Will Daisy go to? The answer is… No, no, no! If Daisy goes to the Sylon continent, she’ll arrive in a dangerous place far away from the place Shin and Lin arrives… T.T</p><br/>\n</div>"}