{"title": "Chapter 237. Guardian (7)", "id": 237, "volume": 3, "url": "http://boxnovel.org/infinite-competitive-dungeon-society-chapter-237-guardian-7", "volume_title": "Volume 3", "body": "<h1>Chapter 237. Guardian (7)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 237. Guardian (7)</p><br/><p>Chapter 237. Guardian (7)</p><br/><p>Even as I was perplexed by the sudden change in scenery, I immediately spread my mana out to detect the surrounding terrain and potential enemies. By the time I understood what had happened, Daisy pulled my arm down and explained.</p><br/><p>“Underground base, safe… close to safe.”</p><br/><p>“What about the Book Walkers?”</p><br/><p>“Magic underground, maintains darkness.”</p><br/><p>“What does darkness have to do with anything?”</p><br/><p>“Dragon Horn, ignite fire.”</p><br/><p>“You bastard, don’t call me Dragon Horn… Ho.”</p><br/><p>Lin barked at Daisy and opened his palm as if to ignite a fireball. Then, he exclaimed in surprise.</p><br/><p>“I’ll admit, I’m impressed. Putting this much restriction on me…”</p><br/><p>“Under the assumption we couldn’t win, the base was created. Here, very hard to ignite fire.”</p><br/><p>“So what does being unable to ignite fire have to do with Book Walkers?”</p><br/><p>“If dark, can’t read books.”</p><br/><p>I instantly remembered sneaking a spearmanship training manual into my bed to read it at night. When Mother discovered it, she smacked my back. Good times… Wait!</p><br/><p>“Book Walkers aren’t ordinary humans! How does darkness stop them from reading books!?”</p><br/><p>“Can you, see me?”</p><br/><p>“I can’t, but considering your level, I can clearly feel your presence and even the outline of your body… Eh?”</p><br/><p>This was strange. I was now level 71. Physical darkness should pose no hindrance to my sight. Wait, what did Daisy say at first?</p><br/><p>“A magic that maintains darkness…”</p><br/><p>“Here, Book Walkers can’t read books. Book Walkers that can’t read books, resistances disappear. Also, cannot be recorded.”</p><br/><p>Daisy nodded as if she had been waiting for me to come to this conclusion. I realized that the magic in this place wasn’t simple and voiced another question.</p><br/><p>“That’s why a perpetually dark base was created?”</p><br/><p>“To leave behind, Resistance Army. If Hydelcyon didn’t die, he must be here.”</p><br/><p>“So that’s why those Book Walkers aren’t coming in here.”</p><br/><p>“Creating fire through darkness magic, weakens Book Walkers extremely. Resistance Army wins easily. Their mission of first priority, annihilating invaders.”</p><br/><p>With that, Daisy pointed to the side. It was at this point that I realized we were surrounded. It was partly because they were concealing themselves so thoroughly without exerting any signs of their presence, but also because Daisy had interrupted me before I could spread my mana out that far.</p><br/><p>Furthermore, a magic that dulled one’s senses seemed to be included in the darkness magic.</p><br/><p>“There are so many, much more than I thought. Surprising.”</p><br/><p>“This voice… Daisy Ectradion!?”</p><br/><p>A deep voice of a man cut through the darkness. Daisy lightly nodded.</p><br/><p>“Fourth Dungeon explorer, race of long lived fools, a grunt, Sinan Kingdom’s knight.”</p><br/><p>It seemed the voice belonged to a Fourth Dungeon explorer who was the knight of a ruined kingdom and a member of a race with high life expectancy.</p><br/><p>“Can’t you just say my name!? I am… I was Sinan Kingdom’s knight, Beren Matiz. And you are?”</p><br/><p>“My allies. Any more, secret. We require information.”</p><br/><p>“What, both you and Hydelcyon come to visit after a long time and that’s all you guys can say? You’re making me cry…”</p><br/><p>“Right, Hydelcyon, information.”</p><br/><p>Daisy threw something to him. The knight received it and shouted in a shocked voice.</p><br/><p>“This is… gold!?”</p><br/><p>“Grunt, now, what floor?”</p><br/><p>“21st. I can barely enter the Residential Area now. Don’t tell me, you’re still climbing the dungeon?”</p><br/><p>“As I thought, still a beggar. In exchange for gold, Hydelcyon.”</p><br/><p>The grunt… Beren Matiz audibly gulped.</p><br/><p>“You… Are you still on bad terms with him?”</p><br/><p>“Information.”</p><br/><p>Daisy filled a leather pouch with gold coins and shook it flamboyantly.</p><br/><p>“Hydelcyon, a kite with string detached. Lost his explorer qualification. But me, promising future. Fat guild… Choose wisely.”</p><br/><p>“You’re straightforward as always… Everyone, put your weapons down. They aren’t our enemies.”</p><br/><p>In truth, I had already realized why I hadn’t felt their presence before. There were the reasons I mentioned before, but it was also because they simply didn’t have the skills to make me wary. Most of them were as good as that Beren Matiz, if not slightly weaker. Simply put, even a melting tuna could send them all to hell.</p><br/><p>“Ectradion, I don’t know what happened, but don’t hate him too much. He didn’t look good. He’s even spending his days quietly here.”</p><br/><p>“A woman, came to find him.”</p><br/><p>“Yeah. She seemed extremely beautiful, but it was almost as if she was bewitched by something. I don’t know why she’s so obsessed to that Hydelcyon who lost everything…”</p><br/><p>“… What are they, scheming?”</p><br/><p>“Scheming? Please.”</p><br/><p>He replied with a smirk.</p><br/><p>“Everyone here is barely living on buried in darkness. How can someone be scheming anything here?”</p><br/><p>“… That’s fine. Location.”</p><br/><p>“I’ll tell you.”</p><br/><p>The underground base seemed to be bigger than I initially thought. After listening to the information Beren Matiz told for a long time, Daisy nodded and sent me a message.</p><br/><p>[They are, not lying.]</p><br/><p>[Couldn’t you have just read everything with your Evil Eyes to begin with?]</p><br/><p>[Few people know, about my Evil Eyes. Only Hydelcyon and maybe couple others. Process of obtaining information, more natural to exist… Also, money, I wanted to give regardless.]</p><br/><p>Right, since Hydelcyon and Daisy have fought together in the front line, Hydelcyon undoubtedly knew about Daisy’s Evil Eyes. However, grunts like Beren Matiz and the others likely didn’t even know Daisy’s abilities.</p><br/><p>Furthermore, as Daisy said, her intention was to give gold to any explorers who could enter the Residential Area. That way, he would be able to buy food for everyone else… I nodded silently and watched Daisy and Beren Matiz’s exchange.</p><br/><p>“With this much… Everyone at the base will be able to eat fully for a few years.”</p><br/><p>“Explorers, how many are left?’</p><br/><p>“We have two in the Third Dungeon, three in the Fourth. We’re all in the lower levels and barely make enough silver to feed everyone. Ectradion, you saved us. We were in a pinch because we can’t even fight monsters in the dungeon right now.”</p><br/><p>“We came, to solve that… Sorry we couldn’t come earlier. One day, we’ll come back. Everyone will be saved… by this person.”</p><br/><p>As Daisy calmly apologized calmly, she pointed towards me. Beren Matiz asked with a curious voice.</p><br/><p>“Him? Why?”</p><br/><p>“That’s all you need, to know. We’ll leave, now. Soon, you’ll be able, to enter the dungeon.”</p><br/><p>“Y-Yeah. Since you said you’ll take care of it, thanks. This place might be dark and gloomy, but I hope you have a nice time… Please, don’t fight here.”</p><br/><p>The underground base was huge, but quiet. There was no one walking around, and we could only hear faint moans occasionally. Daisy spoke without even blushing slightly.</p><br/><p>“Here, dark and quiet. No matter how many times you do it, you can’t make babies. The only thing they can do, is that. For a long time, it’s been like this.”</p><br/><p>“I get it, you don’t have to comment on everything…”</p><br/><p>I despaired, wanting to shut my ears. At that moment, Daisy grabbed my arm and asked as she shook it meekly.</p><br/><p>“Kang Shin, is that fun? Why do men and women, when alone, always do that? The goal, is it not to reproduce? The reason sex slaves are expensive, is that. Why are men so crazy about that? Why do women love it so much?”</p><br/><p>“I said you don’t have to comment on everything. Do you think I’ll comment on everything instead!? Unfortunately, I don’t know either! Unfortunately!”</p><br/><p>“Oi, can you stop being such a virgin and shut up?”</p><br/><p>Kuuuuu! I knew it, I shouldn’t have come with these two! I clenched my fists and followed them. The desolate stillness and occasional moans seemed to drive me insane. At that moment, thankfully, Lin, who was leading the way after hearing the approximate location from Daisy, came to a stop.</p><br/><p>“So you really were here, Sipua…”</p><br/><p>“Lin…?”</p><br/><p>Although we were still enshrouded in darkness, we had gotten close a person’s presence. This powerful presence was telling me that she wasn’t an ordinary person.</p><br/><p>“Lin, did you come to take me back?”</p><br/><p>“What, you thought we’d just leave you be?”</p><br/><p>To be honest, as the aura she was giving off was similar to my level, it made me question whether she really was an administrative guild master. However, it was probably that Lin and other members of Fairy Garden were strange. After all, Loretta mentioned before that I would be able to defeat the administrative guild Lost Valley’s guild master, Eleine, when I became level 80.</p><br/><p>Although I felt a bit sorry saying this, I somewhat understood why they couldn’t beat their worlds’ enemies even after receiving great powers from the dungeon. Although I thought all administrative guild masters were monsters like Loretta, now that I thought about it more carefully, rather than their personal strengths, the share of the dungeon’s power they received when they became an administrative guild master seemed to be more important.</p><br/><p>“Sipua, you should know what situation the dungeon is in right now.”</p><br/><p>“Did the dungeon fall, Lin?”</p><br/><p>“Everything stopped. A place that must help train the Heroes and Guardians of countless worlds stopped just because of you.”</p><br/><p>“Hmph, that’s it? I was bound to the dungeon for over 2,500 years. Compared to that, the dungeon only had a day’s worth of damages.”</p><br/><p>Sipua’s cold tone pierced Lin. Then, she turned her sharp gaze towards me.</p><br/><p>“You came too, Earth’s Hero. I thought you would come. Loretta, that wicked bitch! I apologize, but it had the opposite effect. I can’t forgive everything that’s happened because of you!”</p><br/><p>The reason Loretta sent me? She had done so simply because there weren’t enough people, but it seemed Sipua was gravely mistaken. Not to mention, she sure was shameless. Only a short time had passed since the incident, but the positions of the victim and the assailant was completely flipped in her mind. To her, it seemed everything she had done for Hydelcyon was justified.</p><br/><p>Even if I explained, she would interpret it as she wanted, and it would only be counterproductive. As such, I stayed silent. However, Lin snorted and rebutted.</p><br/><p>“They say if you save a stranger, he’ll turn into your enemy. You sure are audacious, Sipua. He’s a Hero, someone you should support… And that Lodert Hydelcyon is a brainless fool who tried to bully a Hero for his own benefits.”</p><br/><p>“Lin…!”</p><br/><p>“We don’t have time to spare, so I won’t be giving you any time to say goodbye. We’re leaving. Now.”</p><br/><p>“Lin! Please!”</p><br/><p>Lin gritted his teeth. His handgun was firmly grasped in his hand.</p><br/><p>“You should know my personality. You should have been satisfied that Lodert Hydelcyon got off by just being kicked out to his continent… Our patience ends here. Sipua, this is it.”</p><br/><p>A volatile tension filled the atmosphere. Lin’s change in demeanor was so intimidating that I was even having trouble breathing. Daisy buried her face behind my back to avoid his killing intent.</p><br/><p>Sipua was also affected. Lin’s killing intent caused her to freeze completely. When his killing intent diminished slightly from its peak, she barely managed to mutter some words.</p><br/><p>“Please… Lin. Look at me. I love him…!”</p><br/><p>“Is your determination to annihilate all worlds’ enemies so weak that it’ll crumble because of a single fool?”</p><br/><p>“In the first place, I was pressured by the other four into forming an oath to the Lord! I’ve already done so much. Lin, please…!”</p><br/><p>“I’ll give you one day.”</p><br/><p>Lin gave a cut-throat answer as if to say it was his last bit of kindness.</p><br/><p>“Wrap everything up within a day. You can strengthen him with the power you have left too. As long as he’s alive, a day will come when he’s freed. Again, you have one day.”</p><br/><p>“Lin…!”</p><br/><p>“In 24 hours, you’ll be going back with us. I won’t agree to any other requests, and the moment you protest, I’ll drag you back myself.”</p><br/><p>“… Uk!”</p><br/><p>Sipua immediately ran back as if she didn’t want to spend even a single more second with us. At first, I thought she was going back to spend what little time she had left with Lodert Hydelcyon. However, that wasn’t it. Not long after Sipua disappeared, he appeared in her place. His entrance was so smooth that I thought they were playing some tag battle!</p><br/><p>“Daisy Ectradion…!”</p><br/><p>He shouldn’t have been able to see her face, but it seemed he realized who she was from her presence as he muttered Daisy’s name emotionally.</p><br/><p>“Lodert, Hydelcyon.”</p><br/><p>Daisy spoke. As always, she was calm to the extreme.</p><br/><p>“Your mind, it clear up?”</p><br/><p>“You refused me so adamantly, and the one you chose is him? That Hero? You chose a reckless fool who can’t makes heads nor tails of the situation?”</p><br/><p>“Un. You're not, my type. Your face is, dirty. Your actions are, dirty. Your personality is, dirty. Your mind is, dirty. Though strangely, your mind is better now.”</p><br/><p>It seemed he didn’t have much to say in response as he simply glared in our direction. Although I couldn’t read his expression in the darkness, I could tell from his voice that he was glaring at me with killing intent.</p><br/><p>“You, didn’t I tell you not to involve yourself with Daisy Ectradion…!?”</p><br/><p>“Ah, thanks to your advice, I got myself an excellent guild member. That’s the only thing I’m thankful to you for. Also, I’m sorry, but I don’t want to breathe the same air as you, so can you screw off, please?”</p><br/><p>“Kuuk!”</p><br/><p>As I felt sorry just telling him off, I also kicked casually. Seeing him flying back through the darkness, I asked Daisy.</p><br/><p>“How was it?”</p><br/><p>“12, out of 10.”</p><br/><p>“I’m not talking about my shot. Thanks though.”</p><br/><p>“His mind, quite clear… Power of love?”</p><br/><p>“Do you even know what love is?”</p><br/><p>“Un. In darkness, what man and woman do.”</p><br/><p>“Wrong!”</p><br/><p>I burned with a sense of duty to fix Daisy’s distorted knowledge. Lin then stopped me with a head smack.</p><br/><p>“We should go rest too. I’m tired.”</p><br/><p>“Why did you give her a day, Lin?”</p><br/><p>“It’s sad not having a single day off in 2,500 years… Also, if we bring her back as she is now, she’ll remain a lit ember ready to burst into flames. But if we give her more than a day, the dungeon and many of its explorers will receive critical blows. That was the best I could do for her.”</p><br/><p>Words that were completely unexpected from the way he talked to her earlier was coming out of Lin’s mouth. I was so surprised that I imagined Lin’s current expression and murmured.</p><br/><p>“… Lin.”</p><br/><p>“It’s just my whim. Noonim will beat me to death if she found out… but I couldn’t help it because I remembered Loka’s face.”</p><br/><p>“I’m curious about what happened between Lin and Lokanyan. There’s also something I want to talk about with Lin… Since we have time, why don’t we go drink together? I secretly snagged a whiskey that Father had been saving.”</p><br/><p>“That’s the best offer you've made since we met. Good.”</p><br/><p>Daisy shook my arms fiercely and asked.</p><br/><p>“As I thought, Kang Shin likes men…”</p><br/><p>“NO!”</p><br/><p>“For the two of you, I will leave… I want to check, those that I knew, alive or dead.”</p><br/><p>“Come back before it’s too late.”</p><br/><p>“Un.”</p><br/><p>Daisy hopped away into the darkness and her presence eventually disappeared. Lin and I also began to wander in search of a nice place to drink. In this dark space, where one couldn’t tell day apart from night, only time was passing steadily.</p><br/><p>Author’s note:</p><br/><p>What happened between Lin and Lokanyan? This author is curious too!</p><br/><p>Even if you (the readers) discovered something in this chapter, please be patient for the other readers!!</p><br/><p>Author’s note:</p><br/><p>What happened between Lin and Lokanyan? This author is curious too!</p><br/><p>Even if you (the readers) discovered something in this chapter, please be patient for the other readers!!</p><br/>\n</div>"}