{"title": "Chapter 243. What Happened Twice Will... (3)", "id": 243, "volume": 3, "url": "http://boxnovel.org/infinite-competitive-dungeon-society-chapter-243-what-happened-twice-will-3", "volume_title": "Volume 3", "body": "<h1>Chapter 243. What Happened Twice Will... (3)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 243. What Happened Twice Will... (3)</p><br/><p>[Your strength, constitution, and magic increases by 20%. All stats increase by 5. Your affinity to all elements increases, and your affinity to the light element increases greatly. Your resistance to poison increases greatly.]</p><br/><p>[Once per day, you can summon Shiva’s trident, ‘Trishula’, for 30 minutes. The summoned Trishula will become infused into your weapon and will increase your spear technique’s rank by one level. When attacking, you have a 10% chance of attacking the enemy thrice, dealing 3 times the normal damage.]</p><br/><p>[Once per month, you can summon Shiva’s gana[1. https://en.wikipedia.org/wiki/Gana], ‘Nandi’, for 5 minutes. Nandi is a giant bull, and will go berserk upon summoning without caring for its body. It possesses power befitting of a gana of the Destruction God, charging forward with the sole purpose of destroying your target.]</p><br/><p>[Once per year, you can use ‘Eye of the Destruction God.’ A third eye said to exist on Shiva’s forehead opens, shooting a powerful beam of light forward. As it flies in the speed of light, it is said to be unavoidable and said to be able to destroy anything. Its attack power increases based on your stats.]</p><br/><p>[You obtained three gods’ true names with the body of a human! This is a miraculous event never before seen in the history of the dungeon. Although there are countless other gods who wish to bestow their names to you, it is extremely difficult to carry four gods’ true names with the body of a human. However, if you advance from your current realm, it might be possible to obtain a fourth god’s true name!]</p><br/><p>Although I thought I had gotten stronger, the shock I received this time was enormous. When I obtained Hermes’ true name, my speed had increased by 15%, and when I obtained Zeus’ true name, my strength and charm had increased by 15%. This time, however, my strength, constitution, and magic had all increased by 20%! Without decreasing other stats!</p><br/><p>15% to 30%, 30% to 60%. Rather than the shock from the doubled percentages, the shock from the change in strength, constitution, and magic had greater impact on my body. It was so great that my body, which had conquered 20 Beyond Floors and was at level 71, felt like it was breaking.</p><br/><p>The pain couldn’t even be compared to when I obtained Zeus’ true name. A boundless divine power was surging through my entire body, amplifying my mana and strengthening my muscles and bones. My body was evolving to become more god-like. I gritted my teeth to not fall unconscious.</p><br/><p>“Damn it… I don’t even get a choice of gods’ true names this time…!?”</p><br/><p>Even Zeus and Thor had offered their names together. It seemed the strongest deity in Hinduism didn’t want to be compared with another god and put in a place where he had to wait for my decision. His method of bestowing his true name was too violent.</p><br/><p>For 10 minutes, I writhed in pain as I endured the transformation my body was undergoing. When I got up after the pain subsided, I could feel the change. When I checked my status, my HP had gone past 100,000 and my MP had gone past 180,000. 180,000! The amount of mana flowing through my body had become this monstrous!</p><br/><p>“Mmm…”</p><br/><p>However, the world’s enemy I faced in the Sylon continent had even mightier mana. Not just mana, but his pure physical abilities had surpassed every bit of my imagination. Even if I had gotten stronger, there could be others who were stronger. There was no guarantee that the unknown world’s enemy Earth was facing was weaker than the Book Walker’s leader, and the Demon Lord was undoubtedly stronger. Even with a third god’s true name, I wasn’t confident in being able to take the Demon Lord’s life.</p><br/><p>Of course, that didn’t mean that I was weak. It was just that the target of comparison was bad. If I utilized the power I obtained this time well, I could probably fight evenly with a world’s enemy on the Lava King’s level.</p><br/><p>Trishula, which raised my spear technique rank and increased my attack power, was perfect for me, and although it could only be used once per month, Nandi was also a wide area weapon with immense destructive power.</p><br/><p>Finally, there was Shiva’s third eye, which could destroy anything. Since it could only be used one per year, its destructive power was guaranteed. Even the Demon Lord wouldn’t be able to ignore this attack. Thinking about all these, I felt full of spirit. With this, I had obtained another potent way of attacking!</p><br/><p>“Good. I can still become much stronger!”</p><br/><p>I had only just cleared the 70th floor. Including Beyond and the First Dungeon, there were still 60 floors to go. I could definitely grow stronger by several times.</p><br/><p>“The reward…”</p><br/><p>The message window kept bugging me to pick my reward. I only had one choice, so I didn’t know why it wouldn’t just give it to me! I picked the Shadow-Hidden Blade as I grumbled. I expected it to be a weapon, but it was unexpectedly an earring.</p><br/><p>[Shadow-Hidden Blade (Epic)</p><br/><p>Durability – 850/850</p><br/><p>Equipment Requirement – Elder Reaper’s Master, Strength 300+, Magic 300+</p><br/><p>Option – Strength +30, Magic +30. When you attack or are attacked, and the attack lands as a critical hit, a large reaper’s scythe appears and attacks the enemy. The attack power of the reaper’s scythe increases based on your strength and magic stats.]</p><br/><p>“Ah, this is…!”</p><br/><p>The item description was short, but the effect was nothing to scoff at. The fact that it also activated when I was hit by a critical hit was a great advantage. Although I would need to use it once to make solid judgment, the word ‘reaper’s scythe’ was strangely enticing.</p><br/><p>After thinking about my choices for a long time, I took off the Blood Succubus’ Earring and put on the Shadow-Hidden Blade. The dark red color of the Blood Succubus’s Earring looked good with the Golden Teardrop which had a beautiful golden gem, but the Shadow-Hidden Blade’s black metallic was more masculine and didn’t go well with the Golden Teardrop.</p><br/><p>Looking at my face reflected on my spear blade, I hesitated. Was this okay?</p><br/><p>“Well, it’s my stats that matter the most, let’s ignore this. It feels like I’m emitting less scent too.”</p><br/><p>Blood Succubus’ Earring had an effect of amplifying my charm and emitting a scent that made it easier for the opposite sex to like me. Although the Blood Succubus’ Earring’s effect became unnoticeable with my overly high charm, I still felt like taking the earring off made the scent diminish. I was certain.</p><br/><p>As I stepped out to the Floor Shop, I decided to give the Blood Succubus’ Earring to Yua, who regularly utilized the charm stat. When Loretta saw me, she flinched.</p><br/><p>“Ah! Did Shin-nim obtain another true name!?”</p><br/><p>“Yep, it was Shiva’s.”</p><br/><p>“Shiva… The Destruction God!? Shin-nim’s body could contain Shiva’s power? I was just thinking how Shin-nim’s body seemed different… I’ll have to examine it.”</p><br/><p>With a surprised face, Loretta was feeling my body here and there…</p><br/><p>“I can clearly see your other thoughts.”</p><br/><p>“I’m just trying to check whether something’s wrong with Shin-nim’s body…”</p><br/><p>“Eit.”</p><br/><p>When I forcefully dragged Loretta off, she pouted and grumbled. I ignored her complaints and asked.</p><br/><p>“So, is anything off?”</p><br/><p>“Yes? … Ah.”</p><br/><p>“… You completely forgot about it with your evil intentions…”</p><br/><p>“Uhu.”</p><br/><p>“Don’t think smiling cutely will change anything.”</p><br/><p>Next, Loretta thoroughly checked my body without any ulterior motives. She then told me that my body was tense with a third god’s power clashing with the first two gods’ powers. I’d been thinking the same thing.</p><br/><p>“So make sure you rest!”</p><br/><p>“Do I really need to? The 71st floor won’t be hard.”</p><br/><p>“Accepting three gods’ powers in one body is already shocking. Before they can find their balance, Shin-nim needs to rest. If possible, don’t use their powers and rest thoroughly.”</p><br/><p>“But I already got ample rest from yesterday. Do I have to rest more?”</p><br/><p>When I asked with a sigh, Loretta clapped and shoved her face towards me. Her golden pupils were staring at me fixedly.</p><br/><p>“In that case, play with me! I want to treat Shin-nim to something! Let’s go to Fairy Garden together, hurry!”</p><br/><p>“No, Loretta’s eyes look too dangerous.”</p><br/><p>“I have no evil intentions, really! Not even a bit!”</p><br/><p>I would rather believe my mother’s words that she’d return the New Year’s pocket money I entrusted her with than believe Loretta’s words with her beast-like eyes.</p><br/><p>“I’ll be back, Loretta.”</p><br/><p>“Ah, aaaaah! Shin-nim, Shin-niiiiim!”</p><br/><p>I waved my hand at Loretta who desperately cried out my name, and came out to Earth. I certainly felt a bit off from the shock of receiving Shiva’s true name, and I could somewhat feel the uncontrollable powers clashing against each other within my body. However, ever since I learned mana, I had a cure-all way for when the state of my body was weird. It was Peruta Circuit.</p><br/><p>Yua had gone to school, Father and Ludia were in the dungeon, and Mother had gone to work. As a result, I found myself alone at home. In the serene stillness, I began to circulate Peruta Circuit.</p><br/><p>I gathered the roiling mana in one place and forcefully pulled the stubborn powers with Peruta Circuit’s rotational power. Once incorporated into Peruta Circuit’s flow, the circulation speed accelerated. Pulling outside mana into my body while controlling the mana within me, I refined my mana with endless circulations.</p><br/><p>“Gods’ powers are really hard to control… No, focus, focus.”</p><br/><p>To become more used to a god’s true name and to better draw forth its power, one needed to identify and wield divine power. I recognized Hermes’ power, Zeus’ power, and Shiva’s power as separate entities, and worked to control them.</p><br/><p>To fight against worlds’ enemies, I needed to be able to wield powers outside the dungeon’s system. It was easy to overlook the fact that gods’ true names were also being controlled through the dungeon’s power. Although it was nice having a supporter that helped me wield a god’s power, in the end, I needed to make the powers I had into my own without relying on the dungeon. Only then could I say that I had the qualification to be a holder of a god’s true name.</p><br/><p>I heard that even in the past when the dungeon didn’t exist, gods bestowed deserving people with their names. Just like how I wielded Peruta Circuit, spear technique, and elemental techniques without the system’s help, in the past, gods’ true names must have also been given to people as unique abilities.</p><br/><p>As such, I needed to be able to use gods’ true names like they were my own, not just by shouting skill names. Once I could do that, I would be able to call myself god’s true name holder. When that became possible, my league…!</p><br/><p>“Mm? Didn’t something just flash?”</p><br/><p>Just when I thought I had come to grasp something important, my heart thumped. However, no matter how much I tried to recall my thoughts, I couldn’t do so. Since wrenching my head didn’t result in a solution, I decided to go back to focusing on Peruta Circuit. No matter the case, it was certain that I was walking towards the right path!</p><br/><p>Peruta Circuit had the ability to make one focus. Almost as if I was half-asleep, I circulated Peruta Circuit peacefully. Suddenly, I was ambushed by message noona.</p><br/><p>[Event Dungeons have been mass-created on Earth! There are too many dungeons beyond past dungeons’ difficulty. Please clear them before it’s too late!]</p><br/><p>Right.</p><br/><p>What happened twice happened thrice. The sudden attack of Event Dungeons also arrived at the most unexpected time!</p><br/>\n</div>"}