{"title": "Chapter 242. What Happened Twice Will... (2)", "id": 242, "volume": 3, "url": "http://boxnovel.org/infinite-competitive-dungeon-society-chapter-242-what-happened-twice-will-2", "volume_title": "Volume 3", "body": "<h1>Chapter 242. What Happened Twice Will... (2)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 242. What Happened Twice Will... (2)</p><br/><p>“Good morning, Oppa.”</p><br/><p>The next morning, after sleeping with a nice break from the dungeon, I came face to face with a strange scene. Yua was, of course, as angelic as always, but the problem was…</p><br/><p>“What are you holding?”</p><br/><p>“It’s the egg, Oppa!”</p><br/><p>A large ruby-like egg was sitting in Yua’s embrace, glowing with a red light. I asked just to be sure, but it really was an egg. Yua stroked the egg gently as she spoke.</p><br/><p>“If I hold it like this, the baby will hatch earlier, hehe.”</p><br/><p>“Er, mmm, good luck…?”</p><br/><p>“Yes!”</p><br/><p>I didn’t know whether Yua’s nesting would work, but it probably didn’t matter with how cute she looked. However, looking at her with an egg reminded me of the metallic egg Ruyue was caring for in the Fairy Garden. As I headed to the dungeon, I summoned Ruyue and asked.</p><br/><p>“Did that egg hatch yet?”</p><br/><p>[No, it’s still sleeping. I think it’s waiting for Shin to get stronger!]</p><br/><p>“Quite cheeky for an egg…”</p><br/><p>By getting stronger, she probably meant my elementalist related skills. A connection of sort had already been established between me and the egg, and it undoubtedly knew I couldn’t command a fourth elemental. It was truly cheeky. I wondered how amazing it would be.</p><br/><p>“I’ll find out naturally when my skills level up. Ruyue, we’re going to go fight a strong one today.”</p><br/><p>[Un!]</p><br/><p>To be honest, I wasn’t really worried. There wouldn’t be any Floor Masters for a while that I wouldn’t be able to defeat with Overlord. Now, I had my sights higher and farther. Breaking through the highest floor in the dungeon, which no one is said to have done, and conquering all of Beyond. These goals weren’t enough anymore. I needed to grow past what the dungeon could give me.</p><br/><p>[It’s been a long time since anyone has come here. You’re the third challenger since I’ve been trapped in this prison.]</p><br/><p>“Third? You’re…”</p><br/><p>Both Dullahans and Grim Reapers only knew how to charge at me like idiots, so I expected Beyond’s 20th Floor Master to be the same. However, the voice was calm, and the scythe in his hand wasn’t as big as the reapers’ scythes. It seemed he had more characteristics of the reapers as his head wasn’t detached like Dullahans either.</p><br/><p>Only, unlike the reapers who were clad with rags, he was wearing a thick armor, and was riding on a chariot tied to headless horses.</p><br/><p>[I won’t reveal the names of the defeated, as they’re only numbers to me. Hero, hold up your sword and spear. I am the one who tests, one who eternally dies, a collector of false deaths. All who faced me here have experienced more than one death. Will you be able to defeat me?]</p><br/><p>He raised his head. He had Long hair and a pale yet beautiful face. That face did not belong to a ‘he’! I was slightly shaken by the unexpected discovery, but I soon calmed down and asked.</p><br/><p>“Are you a woman?”</p><br/><p>[Indeed. Although I’ve fallen to a lowly status where I cannot die, I am certainly a woman. But if this causes Hero’s spear edge to become dull, I will be severely disappointed.]</p><br/><p>“Do I look like it would ?”</p><br/><p>[I am glad that you don’t.]</p><br/><p>She took a stance on her chariot. The headless horses neighed and began to prepare themselves to charge forward. I could instantly see the force that they would carry in their charge. I grinned and shouted as I fully released my charm.</p><br/><p>“Lilith’s Temptation!”</p><br/><p>It had only been a day since I declared that I would never use it, but I knew when to use my advantage!</p><br/><p>[You used Lilith’s Temptation! You steal 50% of your target’s health and magic power!]</p><br/><p>[The target falls under ‘awakened one’s rage’ status effect. In exchange for 50% of her current health, she doubles all her abilities!]</p><br/><p>[Kuaaaaa! You dare insult me with this pitiful technique!]</p><br/><p>[The Elder Reaper’s rage skyrockets, activating ‘Curse of the Reaper’! For 5 minutes, the chance of receiving a critical hit from the Elder Reaper is multiplied by 10 times! The Elder Reaper’s attack power and speed will increase the more she attacks!]</p><br/><p>To think awakened one’s rage would activate! The Elder Reaper halted from shock the moment she was struck by Lilith’s Temptation, and soon howled in rage as she raised her scythe. My armor already made it easier for me to receive critical hits, but having it multiplied by ten times? Every hit would practically be a critical hit! Really, nothing was easy!</p><br/><p>[You’ll pay for this! I will reap your life!]</p><br/><p>An enormous amount of mana became concentrated on the scythe, creating an ominous grey aura above the scythe. As expected of Beyond’s 20th Floor Master, my body tensed up in response to the powerful aura.</p><br/><p>“I only used my skill!”</p><br/><p>I used Divine Speed and shot up to the sky. At the same time, Sharana’s power within me surged up and accelerated me further. The dozens of aura blades she shot out blew past me and exploded with a thunderous roar when they hit the ceiling.</p><br/><p>This was only the beginning. The headless horses were stomping on air and charging towards me! The chariot was flying!</p><br/><p>[If you’re a Hero, fight me with your strength!]</p><br/><p>“Strength? Sure!”</p><br/><p>Indeed, the Elder Reaper’s speed and strength were both terrifying. With all her abilities doubled and her special skill used, the force of her spirit was overwhelming.</p><br/><p>However, she currently only had half of her mana and a fourth of her health! She was a glass cannon. In that case, things were simple. I just had to hit her before she hit me!</p><br/><p>“Kuaaaaang!”</p><br/><p>[You used Frozen Roar! All enemies in the battlefield freezes in place. All allies temporarily become super-armored and has all abilities increased by 50%. Your chance of landing a critical hit doubles when fighting enemies affected by Frozen Roar.]</p><br/><p>[Kuuk!?]</p><br/><p>Although Frozen Roar didn’t show its full effect against all the powerful enemies I’ve fought recently, it was originally a terrifying skill that froze all enemies in place! As it couldn’t even freeze the Dragon Zombie on the 15th floor, there was no way it could freeze the Elder Reaper.</p><br/><p>However, it could still thoroughly freeze the chariot and the headless horses!</p><br/><p>[All you have are petty tricks!]</p><br/><p>“Powerful abilities you mean!”</p><br/><p>The chariot fell effortlessly. The Elder Reaper jumped out of the chariot without hesitation, while I was already charging towards her after using Overlord. Enveloped by Enigma, I used Divine Speed. To her, I probably looked like a beam of black light.</p><br/><p>The Elder Reaper realized my position only after I appeared in front her. She quickly raised her scythe, but I was already thrusting my spear towards her.</p><br/><p>[Kuk, coward! And that power!]</p><br/><p>“If there’s one thing I’ve learned from all the fights I’ve experienced, it’s that winning trumps all!”</p><br/><p>[Kuhuk!]</p><br/><p>The Chaotic Spear penetrated her breastplate. Heroic Strike empowered by Enigma had easily ignored the armor’s defensive power. As I said before, she was only left with a fourth of her health. Although she didn’t instantly die, she was left on the brink of death, most likely with less than 5% of her health left.</p><br/><p>[Kuuk, so easily… Even if I’m destined to forever be harassed, I will not make way for someone who humiliates women!]</p><br/><p>“I never said you should. I’ll find it and walk through it myself!”</p><br/><p>She told me to fight her without paying attention to her sex, but she was saying I humiliated her just because I used a skill. How absurd was that? I was even hurt by her words!</p><br/><p>I used Divine Speed once again and roughly pulled out the spear from her body. With Overlord active, I didn’t need to worry about mana. Perhaps thanks to having her abilities doubled, she barely responded to my movements and shot a grey aura blade towards me.</p><br/><p>[I will steal a month from you! I will see you afterwards!]</p><br/><p>“Sorry, but I’m going to have to decline your offer for a date!”</p><br/><p>Powerful aura could damage the surroundings without ever making contact. With Divine Speed, I shot back and enlarged the Chaotic Spear’s length and thickness to penetrate her body once more.</p><br/><p>[Kahaak! You bastard!]</p><br/><p>“Let’s end this!”</p><br/><p>[I’ll end you, Hero!]</p><br/><p>In that instant, the Elder Reaper’s aura exploded from all sides. Her aura contained in her scythe was shrinking rapidly and teleporting to random places to explode!</p><br/><p>I didn’t think such a refined aura technique could exist and gawked at the scene. Soon, I realized that it wasn’t the time to admire her skill, as my HP was falling even as I was being protected by Enigma.</p><br/><p>[Kuuuuk! You think I will kneel!?]</p><br/><p>“Elemental Blade!”</p><br/><p>A layer made of elementals was added to the spear blade. In an instant, the hole in the Elder Reaper’s body became bigger. In the next moment, the Elder Reaper dropped her head with widened eyes.</p><br/><p>[I-Impossible…!]</p><br/><p>The spear I was holding suddenly lost its weight. The Elder Reaper’s body was scattering into particles of light.</p><br/><p>[Amazing! You are the first in Beyond’s history to succeed in soloing the Elder Reaper on your first try! You obtained 3 skill point as reward. Remaining skill points: 39]</p><br/><p>[You obtained the title, ‘Elder Reaper Master.’ All stats increase by 2. This effect will apply even if the title is not equipped.]</p><br/><p>[You cleared Beyond’s 20th floor. You obtained the qualification to challenge the dungeon’s 71st floor.]</p><br/><p>[Your maximum HP and MP increase by 2%. You obtained 5 bonus stats.]</p><br/><p>[Experience has been added to skills you frequently used to progress through Beyond’s 20th floor.]</p><br/><p>[You received the only reward left hidden for the First Explorer. Congratulations! Your luck stat increases by 10.]</p><br/><p>[Secret. Shadow-Hidden Blade (Epic)]</p><br/><p>“That was easy… too easy.”</p><br/><p>Although I defeated her easily, the Elder Reaper was undoubtedly powerful. The chariot driven by the headless horses were extremely quick ( though I got rid of them with Frozen Roar ), the Curse of the Reaper sent chills down my back ( though I was never hit by the Elder Reaper ), and her instant acceleration and terrifying aura couldn’t be described with words. If it wasn’t for Lilith’s Temptation, it might have been difficult to subdue her even with Overlord.</p><br/><p>However, in the end, she was a woman and I was a man, a weak man. My vow to never use Lilith’s Temptation again had been broken so quickly…</p><br/><p>“People say what happened twice will happen thrice… Damn, from now on, I’ll only use it on enemies that I know I will kill!”</p><br/><p>With that meaningless vow, I deactivated Overlord. Immediately afterwards…</p><br/><p>[Congratulations! You obtained the god of destruction Shiva’s true name!]</p><br/><p>What happened twice in the past had happened a third time.</p><br/><p>Author’s note:</p><br/><p>As you can see, the dungeon will be easy for a while. Considering Shin’s abilities, it would be weird otherwise. So what happens in the dungeon will be shown in quickly and the dangers Shin is facing in reality will be shown more. However, the dungeon will strike back one day. I already have all the characters prepared!</p><br/>\n</div>"}