{"title": "Chapter 262. You Cannot Escape from the Saintess (2)", "id": 262, "volume": 3, "url": "http://boxnovel.org/infinite-competitive-dungeon-society-chapter-262-you-cannot-escape-from-the-saintess-2", "volume_title": "Volume 3", "body": "<h1>Chapter 262. You Cannot Escape from the Saintess (2)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 262. You Cannot Escape from the Saintess (2)</p><br/><p>[I’ve faced countless challengers, and only a handful are allowed to pass through. Most tried to defeat me in groups, and less than 10% were brave enough to challenge me alone. Among them, those who eventually defeated me with their powers alone could be counted on my fingers. Of course, none managed to break my sword in our first fight.]</p><br/><p>He pointed towards me with his black greatsword and spoke with a deep voice.</p><br/><p>[I wonder which type you are.]</p><br/><p>“You’re quite cooperative to the dungeon, aren’t you?”</p><br/><p>I held my spear up and asked. The Death Knight then laughed in a dreary voice.</p><br/><p>[Cooperative? Young warrior, let’s say I rebel against the dungeon. Is there anything I can do?]</p><br/><p>“There isn’t?”</p><br/><p>[No. There is no future for those who have become undead. There is no path to walk, no stairs to climb, what am I to do against someone I can’t reach with my sword!? The only thing I can do is enjoy battle and sink dreaming warriors into despair! Come before I lose interest. You will become one of the countless fools who despair in the face of my sword!]</p><br/><p>All Floor Masters were powerful. No matter how high one’s stats were or how many skills one had, it was hard to ignore a Floor Master’s move. The Death Knight was in a different league than even them.</p><br/><p>[If you are not careful, you will die in an instant.]</p><br/><p>Black aura rose ominously from the greatsword the Death Knight held up. Just like chaos flames, it seemed to be a different power and not pure aura. To face it, I also ignited my chaos flames.</p><br/><p>“I’m coming.”</p><br/><p>[Ha!]</p><br/><p>Shooting forth like lightning, I thrust my spear to pierce straight through the Death Knight’s helmet. However, the Death Knight’s greatsword received my spear just before. My stats had unknowingly even surpassed Floor Masters’ stats, but this wasn’t the case against the Death Knight. My spear was being pushed back little by little. However, the Death Knight seemed to be the one who was more surprised.</p><br/><p>[You’re strong. Abnormally strong.]</p><br/><p>“Are you… making fun of me!?”</p><br/><p>I pulled my spear back, used Divine Speed, and stabbed his great sword consecutively. It seemed even he couldn’t follow Divine Speed, as he faltered back. Continuing with this momentum, I continued to attack him.</p><br/><p>“Huaaaap!”</p><br/><p>[Hmph!]</p><br/><p>The Death Knight, who was continually pushed back, suddenly changed his stance and struck down with his greatsword. He was aiming precisely for the tip of my spear. In other words, he had read my spear’s movements. However, I didn’t stop and continued. When his great sword and my spear clashed, he opened his mouth.</p><br/><p>[Breath of Death!]</p><br/><p>“Ruyue!”</p><br/><p>[Freeze!]</p><br/><p>The black mist coming out of his mouth froze in the air. At the same time, I kicked him away.</p><br/><p>“That’s dirty, you son of a bitch!”</p><br/><p>[Kuk!]</p><br/><p>The Death Knight soon regained his posture and swung his greatsword, shooting out an aura wave. I stopped charging towards him and jumped back, borrowing Ruyue’s power once more. The Death Knight’s aura struck the ice barrier Ruyue created and dyed the ice black. As the ice barrier melted, the black water let out a horrid stench. Seeing it, I nodded.</p><br/><p>“How simple.”</p><br/><p>Anything touched by that aura rotted. Seeing how Ruyue hid behind my back frightened, it seemed it could even damage spiritual bodies. It was truly a deadly breath.</p><br/><p>[You shouldn’t have time to dawdle!]</p><br/><p>“Ha!”</p><br/><p>He was quick and powerful. His techniques were in the realm of experts, so fighting him was harder than fighting enemies who only had large bodies. Perhaps, those with a shallow understanding of martial arts might think that the Death Knight is an easier opponent than the Dragon Zombie. After all, people who couldn’t understand the depth of the Death Knight’s techniques would be more fearful of an opponent possessing larger and tougher bodies and bountiful mana! Only someone like me, who had the ability to exchange attacks with the Death Knight, would understand the Death Knight’s real capabilities.</p><br/><p>Just like he did before, I swung my spear in a wide arc and shot a horizontal wave of chaos flames. Just like how I was wary of his aura, he was also wary of mine. He immediately jumped up and easily dodged my attack. Then, with the addition of his falling weight, he flew towards me swinging his great sword.</p><br/><p>[Is this it!?]</p><br/><p>“Of course not!”</p><br/><p>Just like what he did before, I also stabbed my spear precisely where his sword blade was. As the Death Knight’s eyes slightly widened, chaos flames danced and scorched his aura, climbing up to his arm. The Death Knight immediately noticed what was happening. His eyes glowed ominously, and a chilling aura shot out from his body.</p><br/><p>[Arrogant!]</p><br/><p>“Show me everything you’ve got! Don’t tell me you’ve got nothing left!”</p><br/><p>Even if I didn’t plan on grinding elixirs, I still needed to obtain his equipment. Floor Master skills were still valuable. Overlord, which was one of my most important powers, was a result of synthesizing skills. Who said another skill like it couldn’t come out?</p><br/><p>In that case, I needed to defeat him ten times a day for just one day, or two days at most. If I discovered all of his attack patterns in our first fight, I would have an easier time afterward. I didn’t know what the Death Knight felt from my words, but he released thick aura from his entire body and spoke in a displeased tone.</p><br/><p>[You underestimate me…!]</p><br/><p>The aura emanating from his body shot up as if it exploded. Sticky black aura rose up from his great sword and blazed like chaos flames. Without me saying anything, Ruyue shrieked and shot out ice spears, and the Death Knight blocked them without even moving. The aura staying in his sword rose and split automatically and devoured all ice spears coming his way. In an instant, all ice spears melted and became absorbed into his aura.</p><br/><p>[I’ll show you the power of curse I gained in exchange for becoming an undead!]</p><br/><p>“Curse, you say.”</p><br/><p>I circulated Peruta Circuit strongly. A platinum aura swirled above Pure Black Desire, and a whirlpool containing chaos flames separately swirled above my spear. In response, the few streaks of aura dancing on the Death Knight’s greatsword halted momentarily.</p><br/><p>My Peruta Circuit was still level 9. How would it be when I mastered it? Hundreds and thousands of times a day, I was tempted to put in my skill points to master it. However, I instinctively knew that the result wouldn’t be pretty if I didn’t master it with my own power, so I barely held on. Peruta had also given me a similar advice.</p><br/><p>Next, I infused Sharana into my body and strengthened the whirlpools as I charged towards him.</p><br/><p>“Give me that power!”</p><br/><p>[You… A Hero, you’re a Hero!]</p><br/><p>When he saw the platinum aura around my body, the Death Knight’s glowing eyes became a level fiercer.</p><br/><p>[Death Cross!]</p><br/><p>“Divine Speed!”</p><br/><p>A cross-shaped aura brimming with curse swept towards me. I immediately concluded that Ruyue’s barrier wasn’t enough to block it, and using Divine Speed, I jumped into the air. However, his aura was also flying towards me there.</p><br/><p>[Is that it!?]</p><br/><p>Without answering him, I utilized the duration of Divine Speed to dodge his attack. Then, I shot the aura in my spear towards him like a bullet. It seemed he didn’t expect me to dodge his aura, as he let his guard down and was struck by my aura. The Death Knight’s helmet partially broke, and his rotting head appeared through the cracks.</p><br/><p>[You moved in the air!? Are you a magician!?]</p><br/><p>“I’m an Elementalist, you idiot!”</p><br/><p>[Kuk, I’ll dye your elementals in curses, too!]</p><br/><p>“Try it if you can!”</p><br/><p>With chaos flames burning his helmet, he looked even more ominous. Even so, since he wasn’t a dullahan, he shouldn’t be able to move if I send his head flying!</p><br/><p>I swung my spear with the sole purpose of swallowing his head with chaos flames. As expected, his great sword met my spear, creating a resounding metallic ringing. With ordinary spearmanship, I couldn’t find an opening in his defense. His swordsmanship was the greatest of all monsters I’ve met so far! After exchanging sword for spear once more, I made some distance and murmured.</p><br/><p>“But with just that…”</p><br/><p>[Kuooooo! Dark Needle Arrow!”</p><br/><p>At that moment, a countless number of black needles shot up from the ground underneath me. Ruyue, who noticed it earlier, created a bed of ice under me, but some needles managed to break through the ice and even my platinum whirlpool, stabbing into my armor. Even though I wasn’t hurt, I felt heavier. It seemed his curse also worked on items.</p><br/><p>[Will you be able to defeat me with that heavy body, Hero?]</p><br/><p>“You talk too much.”</p><br/><p>Without moving from that place, I pulled my spear back and took my stance. I mostly finished analyzing him. His swordsmanship was certainly excellent, but his fighting style put more emphasis on utilizing his aura and curse. He most likely had at least one more hidden card. However…</p><br/><p>“I’ll end this before you have the chance to use it.”</p><br/><p>[Despair, and despair again! This is the greatest revenge I can exact in the dungeon!]</p><br/><p>“You’re a Death Knight… Why do you have to be so petty!?”</p><br/><p>The whirlpool swirling around my spear lessened. It didn’t get weaker, just that it became compressed to a single point. The platinum aura enveloping my armor had also moved to Chaotic Spear.</p><br/><p>“Take this!”</p><br/><p>Although it couldn’t be called a proper Heroic Strike, if complete, it should be able to easily blow away a single the Death Knight! A partially incomplete spear attack hurled towards the Death Knight. He quickly rolled his body, dodging it, but I simply grinned in response.</p><br/><p>[Don’t think you can run away!]</p><br/><p>Peika, who was on standby, shot up into the air and spread her arms out. A chain of golden lightning crackled out, binding together his four limbs.</p><br/><p>[Kuk!?]</p><br/><p>[Master!]</p><br/><p>“I know!”</p><br/><p>Without a single moment of hesitation, I thrust my spear and shouted.</p><br/><p>“Sacrifice!”</p><br/><p>His helmet burst into pieces. The rotting skin and bones of a corpse appeared underneath. As dead blood shot up into the air, he let out a strange howl.</p><br/><p>[Kiaaaaaaaak!]</p><br/><p>“Kuk!”</p><br/><p>So he really did have something left! In an instant, black mist surrounded his body. From it, large double-edged axes, razor-sharp scimitars, and other curse-ridden weapons shot out. Each of them was enough to threaten my life! Because of the effect of Sacrifice, I could only dodge them by the skin of my teeth.</p><br/><p>[These are the grudge-filled weapons of all the warriors I defeated thus far! Your spear will soon become a part of it!]</p><br/><p>“Funny. Too bad your weapon collecting hobby will end today!”</p><br/><p>Even as I dodged the weapons with death just inches away, I had something else in mind. Is this… not copyright infringement?(E/N: Open! Gates of Babyl- sorry)</p><br/><p>“Whatever, let’s just kill him first!”</p><br/><p>[You sure can talk for someone who’s about to die!]</p><br/><p>Peruta Circuit became fiercer. As it healed my internal organs, which were damaged from Sacrifice, I leaped up. Weapons continued to shoot out, signifying the sheer number of warriors he killed. Dodging them skillfully, I shouted.</p><br/><p>“You look like you’re about to die too! Stop resisting!”</p><br/><p>[You will die first!]</p><br/><p>I broke out into laughter. Because I had to defeat him multiple times today, I didn’t use my pocket watch’s skills or any other once-a-day skills. It seemed he was gravely underestimating me because of it. At this point, exhausting my power was a waste. Now that I understood his capabilities, all I had left to do was finishing him swiftly and cleanly.</p><br/><p>At first, I wanted to hold out for a little longer to see how long this skill of his would last, but I decided to do that next time.</p><br/><p>“Alright, I’m coming… Try to dodge this!”</p><br/><p>[Come!]</p><br/><p>I twisted my body in the air and shot towards him. Dodging all the weapons hurling towards me with Divine Speed, I focused my eyes on his ugly face. With my sole goal being to destroy it, I thrust my spear!</p><br/><p>“Dieeeeeee!”</p><br/><p>I gave up trying to fix my habit of shouting. Since it inadvertently became the guild’s official rallying cry, I might as well keep pushing it!</p><br/>\n</div>"}