{"title": "Chapter 273. Kahar (7)", "id": 273, "volume": 3, "url": "http://boxnovel.org/infinite-competitive-dungeon-society-chapter-273-kahar-7", "volume_title": "Volume 3", "body": "<h1>Chapter 273. Kahar (7)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 273. Kahar (7)</p><br/><p>[Hu, Huhu… It’s been awhile since I felt like I broke through my limit.]</p><br/><p>After realizing that she no longer needed to fly at a breakneck speed, Lotte spoke in relief. But seeing as how her tail was still standing straight, she still seemed tense. I stroked her head.</p><br/><p>“Thanks. Are you tired?”</p><br/><p>[Hmph, this much is a piece of cake for a Blaze Queen! In fact, I’d like to thank Hero for letting me realize my own abilities!]</p><br/><p>“Yeah, yeah. Thanks.”</p><br/><p>[Like I said, Hero doesn’t need to thank me!]</p><br/><p>On the other hand, the wyvern Lotte dragged along was half dead. I thought about letting the pitiful creature go, but when I imagined Lotte carrying Ellos and Edias’ Hero with her claws, I stopped in my tracks.</p><br/><p>“Anyways, this is where Peruta Mountain Range begins? It’s already pretty rough.”</p><br/><p>The atmospheric mana I felt before was even thicker in this mountain range. Here, even the ground was affected by the high mana density. This meant that the cause of Edias continent’s strange atmospheric mana was here. It was truly absurd. The size of Seoul was nothing compared to Edias continent, but there was something in this mountain range that could affect the entire continent?</p><br/><p>I became certain. It was Peruta. It had to Peruta. Why else would this mountain range have his name? This also explained why this mana felt so familiar to me. After all, my mana was trained using Peruta Circuit.</p><br/><p>Besides me, however, everyone else was struggling with Peruta Mountain Range’s high mana density.</p><br/><p>“Kuk, it’s really not easy.”</p><br/><p>“It’s like something’s choking me whenever I breathe. Uuu, to think it could affect me so much, how amazing.”</p><br/><p>“… Hup.”</p><br/><p>[I really don’t like this place.]</p><br/><p>‘I see, so the environmental penalty raises the mountain range’s difficulty.’ I could understand why it was called the continent’s most dangerous place.</p><br/><p>Of course, that wasn’t it. I didn’t know whether it was because it really was Peruta’s mana or some other reason, but there was something only I could feel as I was unaffected.</p><br/><p>“The dungeon’s power is being suppressed even more.”</p><br/><p>“What?”</p><br/><p>Ellos looked back at me with a shocked face.</p><br/><p>“Ellos, something’s here, something harmful to explorers.”</p><br/><p>“There’s no way… No one can last long in this mountain range.”</p><br/><p>“That means it’s the best place to set up a scheme.”</p><br/><p>Invaders were apt in magical tools. What was suppressing the dungeon’s power was more likely to be a magical tool than an individual’s ability. Everything made sense in that case. Otherwise, the suppressive force wouldn’t be so strong in this mountain range.</p><br/><p>At the same time that I was confident the answer lies here, I became uneasy.</p><br/><p>“You said you could feel it, right? The Hero’s energy.”</p><br/><p>“Your paper magical tool is proving that, right?”</p><br/><p>“Right.”</p><br/><p>I crumpled the paper. The air felt bitter. I hoped that this wasn’t the case, but it seemed things wouldn’t go as I wanted.</p><br/><p>“The Hero might really be here…”</p><br/><p>In that case, there was a high chance that I…</p><br/><p>“Shin, if what you’re saying is true…”</p><br/><p>“I won’t go back now. Let’s go, Ellos.”</p><br/><p>“Yeah.”</p><br/><p>Ellos nodded. Lotte and the wyvern flew up after resting for a bit, and undead suddenly ambushed us in the air.</p><br/><p>“What!?”</p><br/><p>“Griffins! They’re undead griffins!”</p><br/><p>Ellos shouted. I didn’t recognize them because they were all bones! I looked down below. Undead monsters made of bones were also flocking towards us. This entire mountain range was full of undead creatures, each carrying a great density of mana!</p><br/><p>“They’re naturally created, Dear Husband. Giant mana brought them together.”</p><br/><p>“We don’t need to waste time killing them. Just break through!”</p><br/><p>[Kuaaaaa!]</p><br/><p>For monsters only made of bones, the undead creatures screamed and chased after us. I smacked my lips. This was a great opportunity for me to display my Skull Breaker title, but the title’s effect was also halved by the damned suppressive force.</p><br/><p>The Hero was somewhere in this mountain range, somewhere where the magical tool was pointing to. No matter what was waiting for me there, I couldn’t stop. I couldn’t help but think how fortunate I was to have received Radiance from Lin before I came.</p><br/><p>[This half-dead trash!]</p><br/><p>“Rather than half-dead, aren’t they half-alive?”</p><br/><p>[Shut it, bat! Just get rid of them!]</p><br/><p>“Hmph!”</p><br/><p>Lotte’s flames and Licorice flame and light magic scorched the undead. Although they were also affected by the mountain range, with their leagues, they had no problem dealing with the undead. It was the same for me.</p><br/><p>Although my power as an explorer was being suppressed, Peruta’s mana and Radiance both supported me. As such, I could attack them without hesitation. I threw lightning bolts full of Lightning God’s power at the undead far away and stabbed the ones that managed to close in with my spear.</p><br/><p>Ellos also fought the undead, but it was clear how much he was struggling with his power suppressed. Even so, his eyes were burning passionately.</p><br/><p>“Like I’d lose… to these guys!”</p><br/><p>“Good, Ellos.”</p><br/><p>I replied calmly and stabbed the air with my spear. A shockwave shot out, exploding dozens of undead. At that moment, Lotte roared and breathed out a fire, opening a path in front of us.</p><br/><p>[I’m breaking through!]</p><br/><p>“Go, Lotte!”</p><br/><p>[Screw off, all of you!]</p><br/><p>Lotte roared and charged forward. When I looked around after breaking through the encirclement, I could sense the mountain range’s entire undead creatures running towards us. However, they were no longer in my sight.</p><br/><p>The ground rumbled, and a volcanic crater far off in the distance began to smoke. I held up the paper I crumpled. Shining particles of light floated up and made an arrow. It was clear where it was pointing to. He was waiting for us there.</p><br/><p>[Hero, you’re all fired up!]</p><br/><p>“I know. I realized I can’t fight with my previous mindset.”</p><br/><p>I closed my eyes and checked my condition. Everything was perfect.</p><br/><p>“Let’s go. Our goal is that volcano!”</p><br/><p>I couldn’t remember how many undead were blocking our path, but I knew that we crushed countless undead on our way. When we arrived in front of a cave on the side of the volcano, I was practically covered in crushed bones. I had to ask Ruyue to clean me.</p><br/><p>The undead creatures stopped charging. For some strange reason, they didn’t dare to approach the volcano. In truth, I felt like I knew why. A meek wind was covering the volcano. It was a gentle, yet powerful wind of mana.</p><br/><p>“Let’s enter.”</p><br/><p>“Yeah.”</p><br/><p>Ellos nodded solemnly. Together, we entered the cave. Lotte had transformed into her human and stood next to me, while the pitiful wyvern was tied in front of the cave where enemies didn’t approach. At the very least, it would be safe.</p><br/><p>“The Hero likely didn’t hide here by his own will.”</p><br/><p>I spoke as we walked through the cave. Ellos flinched, then nodded.</p><br/><p>“If there really is a device in here that obstructs the dungeon’s power, the invaders might have something to do with it.”</p><br/><p>“That means there’s something even more important to them than killing the Hero.”</p><br/><p>“Shin, do you have something in mind?”</p><br/><p>I didn’t say anything. I didn’t know whether I should. In the end, I just stared at the paper in my hand.</p><br/><p>“It’s probably nothing much…”</p><br/><p>I gave the paper to Licorice and asked a question.</p><br/><p>“Licorice, does this thing point to the Hero’s energy? Or is it pointing to his unique mana?”</p><br/><p>“The latter, Dear Husband. If it was pointing to the Hero’s energy, it would have responded to Dear Husband too.”</p><br/><p>Licorice answered without hesitation. As that was what I was expecting, I nodded and took a step forward. Ellos looked at me, curious as to what my question meant.</p><br/><p>“Shin…?”</p><br/><p>“It’s nothing. I was just curious.”</p><br/><p>“…”</p><br/><p>We walked onward. Seemingly because we were getting closer to the center of the volcano, the heat was getting stronger. Although the heat couldn’t affect me, that wasn’t the case for my companions. Licorice wiped off the sweat from her forehead and complained.</p><br/><p>“A mere volcano’s heat is making me sweat…”</p><br/><p>“Probably because it’s being compressed by high-density mana. Come here.”</p><br/><p>I borrowed Ruyue’s power to cool my hand and wiped off Licorice’s sweat. Licorice blushed and didn’t know what to do. Though she was a Succubus Queen, she had never experienced the real thing. Because of this, she was weak when I was the one being intimate.</p><br/><p>“W-W-What, Dear Husband!? What’s up with the excellent service!?”</p><br/><p>“I brought you all the way here, so I’m sorry. Ruyue, make the others feel cool too.”</p><br/><p>[Un!]</p><br/><p>Ruyue’s mana immediately covered the rest of the crew. I straightened Licorice’s tangled hair and whispered in her ear.</p><br/><p>“… Got it?”</p><br/><p>“Un.”</p><br/><p>She blushed once again and nodded. I smiled and marched onward.</p><br/><p>As the heat became more intense, the density of surrounding mana also increased. It was the same for the power suppressing the dungeon’s power. We were close. Something had to appear soon. I was proven to be correct, as we soon encountered people.</p><br/><p>“Humans really came all the way here.”</p><br/><p>“Huhu, look, Hero… Kak!?”</p><br/><p>I immediately charged towards them and swung my spear. My ridiculously fast spear, containing the concentrated power of my body, easily slashed through my target’s powered suit and decapitated him. My speed was no different than when I used Divine Speed. However, Divine Speed belonged to the dungeon. In this place where half of my power as an explorer was suppressed, using it was meaningless.</p><br/><p>How was I still so fast? It was simple. During the countless days spent climbing the dungeon and countless battles against my enemies, I learned how Divine Speed used my mana and nature’s mana. Knowing how mana moved meant that I could imitate it. I didn’t need to activate it as a skill.</p><br/><p>Of course, this was the first time I used it in a real battle. Still, my intuition told me to try it rather than using Divine Speed, and my intuition was correct. In fact, I learned quite a lot from the feeling of my body accelerating and the flow of mana. It still couldn’t be compared to Divine Speed at full strength, but once I got used to it and improved upon it, I had the feeling it could surpass Divine Speed, which was already mastered and had no room to evolve.</p><br/><p>“You bas—”</p><br/><p>Before he could finish his sentence, I decapitated him too. My lightning-fast attack ripped apart his powered suit and instantly ended his life. With the two sentries taken care of, I dusted off the blood from my spear.</p><br/><p>“Let’s go. They should be waiting for us inside.”</p><br/><p>“Shin, you…”</p><br/><p>“Ellos, let’s go.”</p><br/><p>I continued on without hesitation. As expected, many invaders were waiting for us there. They were all strong. By the dungeon’s standard, they would have all passed the 75th floor.</p><br/><p>“How come he’s unaffected?”</p><br/><p>“Who cares? Just crush him and question him later!”</p><br/><p>Currently, I was weaker than them. If it wasn’t for Radiance, I might have been gravely injured already. However, I’ve experienced fighting against stronger enemies countless times before. Each time, my limit of my techniques reached new realms.</p><br/><p>So what did I need to fear?</p><br/><p>“Kuk, this Hero is quick!”</p><br/><p>“You can’t even neutralize a weakened Hero!?”</p><br/><p>“You, why don’t you help… Kuhuk!”</p><br/><p>I roused Mad Typhoon’s power. Whether it was magical attacks or physical attacks, their attacks only worked if they touched me. Mad Typhoon’s fierce whirlpool twisted their attacks’ trajectories, and even if they hit me, they only glazed me. Meanwhile, I continued to thrust my spear using the principle of Divine Speed. With my spearmanship, my attacks already came from angles that were hard to dodge. With its lightning-like speed, there was no way for them to dodge my spear.</p><br/><p>“You won’t touch my Hero!”</p><br/><p>“Argh, you guys are annoying! You’re wearing ugly clothes, too!”</p><br/><p>On the other hand, Lotte and Licorice were practically unaffected besides having their mana oppressed. Since the enemies were also affected by the mountain range’s characteristic, they could easily fend them off. In an instant, dozens of invaders died, and they finally faltered back.</p><br/><p>“A-Anymore would be wasting our strength.”</p><br/><p>“We’re not strong enough.”</p><br/><p>“They have to come inside anyway.”</p><br/><p>They were right. No matter how many enemies were waiting for me, I planned to go in. I knew who was waiting for me there.</p><br/><p>“Everyone, let’s go.”</p><br/><p>“Shin, how!? No, why!?”</p><br/><p>“Shouldn’t you know the answer without asking me?”</p><br/><p>Ellos fell silent.</p><br/><p>Even if we turned back now, we wouldn’t gain anything. What I wanted, what the enemy waiting for me inside wanted, and what Ellos wanted, we had to decide it now. I walked onward. The pathway soon came to an end, and a giant space opened up. Considering the heat, we were likely close to the crater. No, this place was the crater. I could see the sky from the gigantic hole in the ceiling.</p><br/><p>Furthermore…</p><br/><p>“I’ve been waiting for you, Earth’s Hero.”</p><br/><p>There was a man standing in the center. It was a middle-aged man wearing a thin black powered suit clearly different than rest of the invaders. The terrifying energy he was releasing made me doubt my chances of victory even if I got back all of the dungeon’s power.</p><br/><p>“Oh, young and handsome. You even have two beautiful gals with you. My, my. My eyes are quite happy.”</p><br/><p>He looked at my companions and smiled in satisfaction. Behind him, I could see a giant crystal. A crystal releasing a mystical, yet ominous light. Near it was the Hero we were looking for.</p><br/><p>With only his head.</p><br/><p>“Sir Kasina, well done. You really succeeded.”</p><br/><p>“It was bound to succeed.”</p><br/><p>Ellos replied calmly. I shouted.</p><br/><p>“Ruyue!”</p><br/>\n</div>"}