{"title": "Chapter 295. Coming Closer, Going Farther (1)", "id": 295, "volume": 3, "url": "http://boxnovel.org/infinite-competitive-dungeon-society-chapter-295-coming-closer-going-farther-1", "volume_title": "Volume 3", "body": "<h1>Chapter 295. Coming Closer, Going Farther (1)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 295. Coming Closer, Going Farther (1)</p><br/><p>The change was quick to happen. The devil doll controlled by the Death King suddenly slumped down as if its strings were cut. As a lich sensitive to mana, the Death King immediately noticed this change and shook his stick in wonder. But it was too late. The devil doll only made creaking noises in response.</p><br/><p>[Hm, it’s not moving, even though this doll is like a clone of mine.]</p><br/><p>Of course, it didn’t move. The devil doll should have turned metallic. Seeing as how it was making creaking noises, it was most likely struggling in its own way. Unfortunately, the Death King no longer had control of the devil doll.</p><br/><p>With the doll unable to move, it let go of Mother. Daisy’s magic was quicker than the Death King, and I was even faster.</p><br/><p>[Oh my! Hero, you are quite fast!]</p><br/><p>The Death King put the devil doll away and used magic to secure Mother, but Daisy’s magic countered his and I safely took Mother in my arms. But when I received her, I frowned.</p><br/><p>“She’s perfectly fine?”</p><br/><p>[Hahaha, as long as you promise to cooperate with me, she’ll be fine! Now, if you know what situation you are in, we should have a nice conver…!?]</p><br/><p>The finger he was sticking out towards me turned silver.</p><br/><p>[I am Dortu. Pointing at Master is rude.]</p><br/><p>[Something’s here.]</p><br/><p>He whispered. He immediately looked around, but he couldn’t see Dortu. Naturally, someone who controlled undead couldn’t perceive Dortu. Dortu wasn’t born like any other elementals. It was possible that even elves couldn’t perceive Dortu.</p><br/><p>[But this won’t change anything. I made sure to put extra care into her, you see. I’m the only one that can cure her.]</p><br/><p>There was nothing more foolish than putting in effort to control an unperceivable situation. At least in this aspect, the Death King seemed to be better than the other kings. Rather than looking for Dortu, he was threatening me, who controlled Dortu.</p><br/><p>[If you don’t return her to me soon, my mana inside her will go… BOOM! I assume you won’t like that.]</p><br/><p>He laughed mischievously.</p><br/><p>[Come on, Hero. Think about it. There’s no need for us to fight. Aren’t you curious about the things I know?]</p><br/><p>“Question, do you only have one devil doll?]</p><br/><p>[Hahaha, you’re asking if I took other hostages? A precious magical tool like this, even I only have one. So turn it back, Hero. Otherwise, your mother will be in a pickle.]</p><br/><p>He shook his wooden stick. As the strings danced, the devil doll creaked creepily.</p><br/><p>I didn’t dare believe him easily, but he certainly only had one wooden stick, and even if he didn’t, I just had to take care of him before he could do anything else. As such, I immediately took action.</p><br/><p>“Dortu.”</p><br/><p>[I am Dortu. Assaulting the enemy.]</p><br/><p>In that instant, the lich’s abdominal bones shattered. The metallicised devil doll had penetrated his stomach. It seemed he didn’t expect me to steal control over his doll. His momentary lapse in judgement had dealt him a huge blow.</p><br/><p>[Kuhuk!]</p><br/><p>“Looks like you’re physically weakest out of all the kings.”</p><br/><p>Though I said it half-jokingly, the devil doll strengthened by Dortu’s ability was probably strong enough to deal critical damage to even the Beast King. Of course, that didn’t mean Dortu was always that powerful. It was just that the previous attack carried a world-shaking amount of mana.</p><br/><p>Dortu took the mana within the devil doll and attacked the Death King. This doll had the ability to hide its presence and was powerful enough to slaughter dozens of succubi. It could even instantly come back to the Death King while carrying Mother. Since such a doll was being used as a one-time assault weapon, its power was imaginable.</p><br/><p>The doll’s attacks didn’t just end with breaking the Death King’s bones. As the doll slowly broke down, the Death King’s lich body began to turn silver starting from his stomach. The silver color also spread from his previously metallised finger, spreading to his fingers joints, hand, wrist, and so on. It was as if the power of metal controlling the doll was devouring the lich.</p><br/><p>[You’re mutating the body of a king!? What power is this!?]</p><br/><p>“Didn’t you say you placed your life force in a container? I’m just changing one lifeless object to another. It’s no different than transforming the devil doll into metal.”</p><br/><p>[Impossible!]</p><br/><p>That’s what I also thought, but after taking 300,000 mana from me, Dortu made it possible. Perhaps, the elementalist skills I finally mastered was also helping.</p><br/><p>Seeing his body turning into a piece of metal, the Death King glared at me and shouted.</p><br/><p>[Hero, I enjoy talking things out rather than resorting to force. But if you go any farther, I will blow up your mother. I am not kidding!]</p><br/><p>“You won’t be able to now.”</p><br/><p>I also glared back at him. Now that Dortu made his move, there was nothing the Death King could do. If I had to point out the reason for his loss, it would be that he was a lich, as Dortu didn’t have the ability turn living beings into metal.</p><br/><p>[I’m the king of the dead. Don’t think you can win against me with something like this…!]</p><br/><p>From the unmetallised part of his body, his mana began to boil. The Death King gave up on trying to control the curse on Mother and concentrated all his mana into his body. But this was exactly what Dortu was waiting for. He greedily devoured the Death King’s mana and sped up the metallisation process with it. Against Dortu, the Death King was nothing but prey.</p><br/><p>Not long afterwards, the Death King realized there was nothing he could do. Blood red light shone from his eye sockets as he roared.</p><br/><p>[You’re the one who made this decision. Without me, you won’t be able to resolve that curse. The moment I lose my body, the countdown will start, and in less than five minutes, your mother will lose her life. Not to mention, you won’t be able to find my life vessel. When I return, you will have another decision to make. I won’t be so nice next time around.]</p><br/><p>With that, he turned into a metallic doll. Daisy scrutinized his body and looked at me with her eyes shining.</p><br/><p>“He’s not, dead. Turning him into metal, can’t kill him. I have to… kill him.”</p><br/><p>“I know. You can finish him off. I hope Licorice and Lotte will come back soon with his life vessel.”</p><br/><p>“But, Kang Shin’s mother.”</p><br/><p>Hearing Daisy’s worry-ridden voice, I smiled. Even now, the curse located in Mother’s heart was beating threateningly, but I coincidentally learned how to deal with curses like this today. When, you ask?</p><br/><p>“Sumire, take Mother!”</p><br/><p>“Y-Yes! Eh? S-Shin-nim!?”</p><br/><p>After handing off Mother to Sumire, I used World Trickery. It would have been perfect if I could use Sky God’s Play, but I had already used it in my fight with the Beast King. Fortunately, it wasn’t absolutely necessary to have it for my plan.</p><br/><p>The method I thought of was simple. Among the monsters I’ve fought, there was one called the Superior Doppelganger. These monsters had the ability to get bigger or smaller. Thus, I transformed into a Superior Doppelganger and made myself undetectably tiny. Though it was a rather roundabout way, this way, I could still make myself tiny using World Trickery.</p><br/><p>After transforming, I flew into Mother’s nostrils and continued through her esophagus. Though the Death King had said she had five minutes, it wouldn’t be strange if there was even less time.</p><br/><p>As I flew towards Mother’s heart, I suppressed the feeling of urgency and tried my best to stay calm. Thankfully, I had experienced something similar before and could easily find her heart. Immediately, I noticed a black tumor-like curse growing on her beating heart. I held myself back from cursing aloud and reached my hand out towards it.</p><br/><p>“Huu, let’s do this.”</p><br/><p>I initiated Peruta Circuit.</p><br/><p>While maintaining a small enough size to not harm Mother, I sucked the curse in using Peruta Circuit’s power. If I hadn’t fought the Beast King, I would have never imagined being able to do this.</p><br/><p>“Come and fight me!”</p><br/><p>The black curse resisted fiercely, but it couldn’t hold out against Peruta Circuit’s pull. Soon, the curse reluctantly hopped off Mother’s heart and charged towards me. In exchange for receiving it directly, I drew the curse into Peruta Circuit’s spin. Naturally, it was safer to take it with my hand than my heart.</p><br/><p>“Come, come!”</p><br/><p>With my mind focused entirely on Peruta Circuit, I began to drip with sweat. The curse felt acrid and stuffy, and it was constantly trying to devour me whole. But I concentrated my mana onto the hand I had reaching out. The mana whirlpool carrying the curse moved towards my hand and it began to turn black. It seemed it was impossible to defend against it completely.</p><br/><p>“Just hold out a little longer…!”</p><br/><p>A few seconds afterwards, the curse staying in Mother’s heart was pulled away completely, focusing on my hand, which had a much more appetizing mana.</p><br/><p>“Done! … I’ll see you in a bit, Mother!”</p><br/><p>With a black curse-filled pearl in hand, I quickly used Return. The transfer point, of course, was Rome, where Hwaya and I arrived before. It was still overflowing with zombies.</p><br/><p>[Guooooooooo!]</p><br/><p>“Thank you for being here!”</p><br/><p>Almost like it was waiting for me, a zombie pushed its head towards me. I wanted to give him a big bear hug if possible, but I was in a rush. I touched him with my hand and shouted.</p><br/><p>“Cadeceus!”</p><br/><p>Exactly 10 seconds later, one zombie carrying a death curse exploded.</p><br/>\n</div>"}