{"title": "Chapter 294. The Last Member (11)", "id": 294, "volume": 3, "url": "http://boxnovel.org/infinite-competitive-dungeon-society-chapter-294-the-last-member-11", "volume_title": "Volume 3", "body": "<h1>Chapter 294. The Last Member (11)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 294. The Last Member (11)</p><br/><p>[The kings. You really erased them all? Hahahaha!]</p><br/><p>“This guy’s too punky.”</p><br/><p>He had a skeletal body. Was he a lich? The robe he was wearing was oozing with dreary aura, suggesting it was a peak grade artifact.</p><br/><p>“That robe must cost a fortune.”</p><br/><p>[I really wanted to see you!]</p><br/><p>He abandoned the enemies he was fighting just a moment ago and completely turned his attention towards me. Daisy and Sumire’s seemingly devastating attacks poured down on him and shaved off his mana, but he was ignoring them completely.</p><br/><p>I looked around. I couldn’t see Licorice or Lotte.</p><br/><p>“Where’s Licorice?”</p><br/><p>“Licorice and Lotte, both in Event Dungeon… Looking for his, life vessel.”</p><br/><p>A life vessel, I had heard about it before. A lich is said to store his life energy in a container, making him immortal unless the container was broken. A lich’s body was real, yet unreal. As long as his life vessel was fine, a lich could always create a body for himself with atmospheric mana.</p><br/><p>Daisy must have brought him all the way here to get him as far away from his life vessel as possible.</p><br/><p>[Hahaha, it’ll be hard to find! You should value your life. I made sure to hide it thoroughly!]</p><br/><p>“You’re different than the kings I’ve met so far.”</p><br/><p>[Indeeeeeed! I’m very different!]</p><br/><p>I was already starting to hate him.</p><br/><p>[Those guys are brainless! Not to mention, they’re headstrong.]</p><br/><p>Before Sumire’s spear stabbed him, the Death King swung the staff in his hand and created a barrier.</p><br/><p>[‘Earth’s Hero? I won’t lose to someone only half-complete. If it’s me, I can devour him and conquer Earth.’ That’s what those stupid kings were thinking even after finding out about the Lava King’s death. This is the result! Of the four fools, that ray who escaped to Earth was probably the wisest. Though, he probably got killed by you anyways! Kahahaha!]</p><br/><p>With that, he raised his free hand into the sky. In his hand was a stick used to control puppets. There were strings coming out of the stick, but I couldn’t tell what they were connected to.</p><br/><p>[And what I dislike the most is that everything is happening as he intended!]</p><br/><p>“As he intended? You mean the one above your head?”</p><br/><p>“Oh, that’s it! That’s an excellent way to put it! Yes, he’s always above our heads!]</p><br/><p>Daisy seemed to mutter something and the energy he was releasing decreased significantly. Sumire stood in the sky, either with Daisy’s help or with her armor’s ability, and lowered her body. It looked like she was preparing to attack with a lance, even though the spear in her hand wasn’t for charging.</p><br/><p>The Death King, however, didn’t pay attention to what they were doing.</p><br/><p>[You see, I hate this arrangement. I’m the type who’s not satisfied until everything is in my control. Having to take someone else’s orders couldn’t be more unpleasant!]</p><br/><p>“Orders, huh.”</p><br/><p>[To him, us Five Kings were nothing but chess pieces. He must have thought he instigated us cleverly, but I could see through him. Our fate was already sealed — to be sacrifices!]</p><br/><p>“Sacrifices? For what?”</p><br/><p>He raised his staff. It had a clear luster like it was made out of platinum. The crystal ball on its tip shone in a five-colored light.</p><br/><p>[Obviously, it’s for you, Hero!]</p><br/><p>“Sacrifices… for me…?”</p><br/><p>[Curious?]</p><br/><p>A twisted smile appeared on the lich’s skull head. I asked.</p><br/><p>“And why do you want to tell me these things?”</p><br/><p>[An excellent question! It’s because I want to get rid of him! Hero, I assume you don’t enjoy dancing on his palm either. Listen to me, and join me!]</p><br/><p>He swung his wooden stick around. I could see its strings stretching and relaxing.</p><br/><p>[There’s not much time left, Hero. I won’t be able to avoid his eyes for much longer. So hear me out and tell me the answer.]</p><br/><p>“Shin, don’t listen to him.”</p><br/><p>Daisy interrupted him. Her eyes were shining in a scarlet light.</p><br/><p>“He wants to use you.”</p><br/><p>[Isn’t that obvious!? I will use the Hero, and the Hero will use me! This is a true trade… Ei, you’re being annoying, little girl!]</p><br/><p>“We won’t just be annoying!”</p><br/><p>Sumire made a ringing shout, and immediately afterward, the staff the Death King pushed out randomly clashed with Sumire’s spear. Not only did his staff disappear without a trace, but the energy he was emitting was also cut down immensely. In exchange, Sumire had to fall back like she lost most of her armament.</p><br/><p>[You bitch, my staff!]</p><br/><p>“Shin-nim, I’ll leave the rest to you!”</p><br/><p>I slowly raised my spear in response to Sumire’s shout, igniting chaos flames above it.</p><br/><p>To be completely honest, I still had many questions I wanted to ask him. About the mastermind behind them and the meaning behind them being a sacrifice. I didn’t have enough information to solve this puzzle on my own. Still, I decided to be content with where I was. It was clear he wanted to use me for his benefits. Furthermore…</p><br/><p>“You, if all you wanted to do was talk to me, why did you turn Vatican City and Rome into a land of death?”</p><br/><p>[I’m the king of the dead. Everywhere I go must be filled with death. Hero, those that face death once are granted eternal life in exchange! Think about it! If I came alone, do you think anyone would have listened to me? No! You would have tried to kill me immediately!]</p><br/><p>Well, he was right.</p><br/><p>“Looks like I’ll need to beat you up before you can think properly.”[1. A little pun. The word for “to be right/correct” is the same as the word for “to be hit/struck/etc”.]</p><br/><p>[No, Hero. We still have something to talk about!]</p><br/><p>He pulled on the stick he held. It had to be an artifact of some sort! In the middle of charging towards him, I was forced to a stop.</p><br/><p>Even though nothing was tied to its strings just a moment ago, now, there was a peculiar doll resembling a devil dangling on it. The doll was about 3 meters tall, which seemed physically too big for the Death King’s tiny stick to control.</p><br/><p>Rather than the doll, however, I was more concerned with what the doll was holding in its hands. It was a person.</p><br/><p>“… Who’s that?”</p><br/><p>[Good question. This is your parent! Your mother!]</p><br/><p>It felt like the world was turning white. I wanted to charge towards him, but I couldn’t move. No matter how quick I was with Divine Speed, it wouldn’t be enough to retrieve mother from that devil doll. So for now, I had to stay still.</p><br/><p>I clenched my teeth and caught my breath. Then, I asked calmly. So calmly that even I was surprised with myself.</p><br/><p>“My mother is in the safest place in this world. How could that be her?”</p><br/><p>Mother was always guarded by the succubi, and knowing my importance, Guardian and Freedom Wing also assisted in protecting her. With Licorice always being by my side, I should know as soon as something happened to Mother…</p><br/><p>But Licorice wasn’t here right now. She was in an isolated space looking for a way to kill this lich.</p><br/><p>[Did you really think the monsters here were all I had? How could that be! Think about it, Hero. There are only two people I’m afraid of in this world!]</p><br/><p>He put up two fingers with his hand.</p><br/><p>[One is him and the other is you! No one else can stop me. Right, not even this doll! Unlike a Hero, you were a bit foolish. If she was so important to you, you should have protected her better!]</p><br/><p>“You killed them all…?”</p><br/><p>[Of course! I’m facing the Hero who killed four of the Five Kings. I had to have some sort of an insurance plan, don’t you think?]</p><br/><p>I tried to message Licorice, but the Death King’s mana filling up this area prevented me. But if he was telling the truth, Licorice had to be furious right now. There a lot of succubi were in charge of protecting Mother, especially when we had something like this going on.</p><br/><p>[There’s no need to be mad, Hero! Look, your mother is perfectly fine! Like I said before, I want your cooperation. I’m just using this… tool, yes, a tool to make our talk go smoother!]</p><br/><p>He waved his wooden stick and the devil doll opened its mouth. That thing was undoubtedly an artifact rivaling or surpassing his staff. After all, it must have slaughtered dozens of SS ranked succubi.</p><br/><p>I closed my eyes. Was it a mistake to have all Revival members fight? If I left just a couple of them to protect Mother… No, that was stupid. How were we supposed to do anything if we had to split up our members to protect everyone’s family? How were we supposed to fight against the monsters and demons invading Earth if we had to divert our attention so much?</p><br/><p>Until now, I believed monsters or demons couldn’t do anything to my mother. I believed my mother was completely safe.</p><br/><p>But I was wrong. Completely wrong. They might have been safe for a long time, but that didn’t mean they would continue to be safe. I should have known that, but I let my guard down and got smacked in the back at the most critical moment.</p><br/><p>[Now, now, don’t move. If you move even a little bit, this little stick will shake. When this stick shakes, the doll attached to it will also shake. When the doll shakes… Heh. So, Hero, are you ready to talk now?]</p><br/><p>Mother seemed to be sleeping. I didn’t know whether she was originally sleeping or she was put to sleep, but after seeing Mother’s face, I looked at Daisy and Sumire.</p><br/><p>“…”</p><br/><p>“Shin-nim.”</p><br/><p>[Let’s form a plan together! A plan to give that guy a blow! Exciting, isn’t it?]</p><br/><p>The Death King rambled on excitedly. His modus operandi was twisted. It wasn’t what normal people could come up with. Taking a hostage just to talk? To him, that was obvious. A fool like him laughed at the other four kings, saying that they were defeated because they challenged me without knowing anything about me.</p><br/><p>Really, none of the Five Kings knew anything about me.</p><br/><p>“Fine, let’s talk.”</p><br/><p>[Ooooh! Good, that’s excellent, Hero! I knew you would understand!]</p><br/><p>His skull head cackled as he laughed. At the same time, something in embrace twitched. Something that was alive, yet without a life. It moved in a way that no one else could comprehend, a way that only I could accept.</p><br/><p>[I am Dortu. Executing Master’s command.]</p><br/><p>My fourth elemental thus made its move.</p><br/>\n</div>"}