{"title": "Chapter 296. Coming Closer, Going Farther (2)", "id": 296, "volume": 3, "url": "http://boxnovel.org/infinite-competitive-dungeon-society-chapter-296-coming-closer-going-farther-2", "volume_title": "Volume 3", "body": "<h1>Chapter 296. Coming Closer, Going Farther (2)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 296. Coming Closer, Going Farther (2)</p><br/><p>“Thank goodness.”</p><br/><p>Seeing the zombie explode into pieces, I sighed in relief. That curse was just too dangerous. If I didn’t push it to something else using the black snake’s power, it might have been difficult to use other regeneration abilities.</p><br/><p>“Daisy, Sumire… Ah, the messaging system doesn’t work right now.”</p><br/><p>The Death King wasn’t dead yet. His influence was still spread out across Vatican City and Rome. I had to destroy this life vessel thing as quickly as possible.</p><br/><p>Using Peruta Circuit, I began to fill up my drained mana. After blowing away a tiny wisp of the curse left on my hand and cleaning up some of the nearby zombies, I shot up into the sky.</p><br/><p>“The monsters in the sky are… mostly taken care of.”</p><br/><p>I could still hear Laki’s heartful roar. Laki was truly powerful, as he was still beaming with strength after dyeing the death-filled sky with lava. It looked like I didn’t need to worry about Father or Ye-Eun.</p><br/><p>I wanted to go help Hwaya and Ina… But it looked like this domain of death would only disappear once the Death King died. In that case, it was more efficient to join Licorice and Lotte to search for the life vessel. Daisy and Sumire would likely do the same.</p><br/><p>“Alright, let’s go.”</p><br/><p>The whirlpool shrouding my body alleviated the fatigue I suffered from the curse and continued battles. At the same time, it filled me up with a new power. Reinforced with the Beast King’s mana, my body full of energy once again. It was a different feeling than when I used the dungeon’s power. This power completely followed my command and seemed to have its own will. I was in my peak condition.</p><br/><p>“Dear Husband!”</p><br/><p>When I was flying towards the presence of Licorice and Lotte, Licorice found me first and headbutted into my embrace. I received her gently and patted her back with a bitter smile. Soon, Lotte who was in her wyvern form came next to me too.</p><br/><p>[I knew Hero was safe.]</p><br/><p>“Yeah, I’m happy you’re safe too, Lotte.”</p><br/><p>[But… I failed.]</p><br/><p>Lotte who was happily greeting me slumped her tail. I had an idea what she meant. I gave Licorice, who was sniffing my neck, a smack on the head, and asked.</p><br/><p>“You didn’t find his life vessel?”</p><br/><p>“Owie, that hurt… But no, we didn’t. It’s too hard. If I knew beforehand, I would have gone looking for it we killed him. Daisy said he had a magic that could forcefully sever the contract Lotte and I had with Dear Husband and told us to get back.”</p><br/><p>“I see.”</p><br/><p>“But even without the contract, Dear Husband is the only one for me! She’s so rude!”</p><br/><p>“There might have been more to it than just having our contract severed. Regardless, it’s good that nothing happened.”</p><br/><p>While necromancers could command a large number of undead, they also had numerous curses in their arsenal. Daisy probably knew what the Death King was capable of based on what she could do herself.</p><br/><p>“It’s good that Daisy was here.”</p><br/><p>What he had done to Vatican City didn’t seem so simple. As a necromancer herself with knowledge in this field, Daisy had taken the appropriate action to minimize the damage.</p><br/><p>“There’s a lot we have to talk about, but that’ll have to wait until we finish up the Death King.”</p><br/><p>“Un. He should be nearby, but I can’t find him no matter what magic I use.”</p><br/><p>Even if his life force was contained in a separate container, it was impossible to move if the container was too far. Consequently, a lich had to hide his life vessel on himself or nearby. It was natural for a lich to be weaker the farther he was from his life vessel. The Death King I faced just now most likely couldn’t show his full power. Otherwise, no matter how amazing Dortu’s attack was, it would have been impossible to metallicize him that fast.</p><br/><p>“Eh?”</p><br/><p>A thought suddenly flashed through my mind. To put this thought into action, I whispered.</p><br/><p>“Dortu, you here?”</p><br/><p>[I am Dortu. Always by Master’s side.]</p><br/><p>Dortu immediately replied. He talked succinctly without any fluff. A more important characteristic he had was being invisible. At first, I didn’t even know Dortu was born. Only when I got a message asking if I wanted to form a contract with a new elemental did I realize the metal egg I carried around no longer existed. This had happened only a few days ago.</p><br/><p>Well, perhaps it was wrong to say he was invisible. Dortu had the ability to turn inanimate objects into metal and could infest all metals. At the moment, he was likely staying in my armor, spear, or even my earring or necklace.</p><br/><p>“Dortu, you said you could turn any inanimate object into metal, right?”</p><br/><p>[I am Dortu. Affirmative.]</p><br/><p>“Then can you turn this entire area into metal?”</p><br/><p>[I am Dortu. Requires lots of mana.]</p><br/><p>I grinned and immediately activated Succubus Queen’s Tattoo. Previously, using Dortu’s power to metallicize the Death King took most of my mana. Even after some time had passed, I had only recovered to about 50%. But with that amount doubling instantly, I was once again overflowing with mana. Just in case, I gulped down a mana potion and ordered Dortu.</p><br/><p>“You can take as much mana as you want. Dortu, go wild!”</p><br/><p>[I am Dortu. Executing Master’s order.]</p><br/><p>Dortu’s reply was relaxed yet full of energy. Immediately afterward, the ground below me began to metallicize. The black earth filled with an aura of death started to turn silver.</p><br/><p>“Wow, he’s amazing! But Dear Husband, what happens to the organisms living underground?”</p><br/><p>“I’m a liberal art major so I don’t know.”</p><br/><p>I replied with a serious face. Presumably, organisms living underground would die as everything around them turned into metal, but since I wasn’t sure, I didn’t say anything. Meanwhile, the silver color spread farther and deeper.</p><br/><p>“He sure buried it deep.”</p><br/><p>“… Shiny.”</p><br/><p>Daisy and Sumire arrived. There was also a silver lich shining brightly.</p><br/><p>“Hey.”</p><br/><p>“I understand Kang Shin’s feeling. But dead undead, good undead.”</p><br/><p>“An undead is dead anyway…”</p><br/><p>I made a groaning noise but didn’t say anything more. I knew Daisy was far more knowledgeable than me when it came to the undead. If she said it was safe, it was. But I couldn’t see Mother, who Sumire should be protecting.</p><br/><p>“Where’s Mother?”</p><br/><p>“Yungoong-nim took her and left. Most of the monsters in the air were cleaned up, so Laki and Ye-Eun are enough to deal with the rest. Since there might be traces of the curse left on Shin-nim’s mother, he took her to see Ludia-nim.”</p><br/><p>“That’s a good idea. It’s not like having more people would help in finding the life vessel.”</p><br/><p>Daisy came up next to me.</p><br/><p>“A life vessel is, a lump of life force. Impossible to metallicize. Good plan.”</p><br/><p>“Yeah, but what if it isn’t here? I can’t do this that often you know.”</p><br/><p>Everywhere I looked was filled with silver light. By now, it stopped expanding outward and was digging deeper into the earth. Daisy stared down at the ground and soon nodded.</p><br/><p>“It’s okay. Found it.”</p><br/><p>[I am Dortu. Mission complete.]</p><br/><p>Their voices overlapped. Immediately afterward, Daisy put her hand on the metal ground and closed her eyes.</p><br/><p>“There’s a big resistance. Prepare to defend.”</p><br/><p>Sumire raised her shield and stepped forward in front of Licorice and me. Daisy then started to mumble words I couldn’t understand, and the ground began to shine brightly.</p><br/><p>“Reason he said we won’t find it, I understand.”</p><br/><p>Daisy spoke calmly. The earth rumbled and the vibration spread out into the air.</p><br/><p>“He made, thorough preparations. He divided, his life force.”</p><br/><p>“Isn’t that a Horcrux… No, nevermind.”</p><br/><p>Soon, something resembling a grain of sand popped up above the metal ground. When Licorice reached her hand out, a rainbow-colored fog sucked it in and trapped it. Daisy nodded her head and continued her work. More and more grains of sand appeared above the ground and Licorice promptly retrieved them with her fog.</p><br/><p>Thanks to Licorice helping out with her powerful magic, their working speed slowly increased. The grains of sand flying around the rainbow fog resembled a starry sky. Seeing these brightly shining dots, Licorice gritted her teeth.</p><br/><p>“Without Dear Husband, we wouldn’t have made it in time.”</p><br/><p>“Dortu, hax.”</p><br/><p>[I am Dortu. Not hax.]</p><br/><p>“It’s reacting! Get ready!”</p><br/><p>After collecting some portion of the life vessel, the metallicized ground began to turn black. It was as if the Death King was making a final struggle, preventing us from taking more of his life force. However, Dortu wasn’t slacking off.</p><br/><p>[I am Dortu. I execute Master’s command. I transform everything into metal.]</p><br/><p>Silver light began to cover the ground once again. Soon, the ground began to turn gold. I asked Dortu just in case.</p><br/><p>“Is that pure gold?”</p><br/><p>[I am Dortu. Pure gold can’t change. Once something changes to gold, even Dortu can’t change it. Pure gold is the metal with highest mana resistance. It also has a high magical ability. It requires lots of mana.]</p><br/><p>So he didn’t need to turn the ground into gold before, but he had to now to stomp the lich’s final struggle. At this moment, I realized something. If I understood him correctly, as long as I gave Dortu mana, he could change even a simple stone into gold!</p><br/><p>“Sorry Dear Husband, but if this elemental can really change stone into gold, he can’t be ordinary.”</p><br/><p>Gold wasn’t just valuable on Earth. Even in other worlds, it was at the apex of precious metals. It was also why the dungeon used gold as its currency. Although I had uncountably many gold in my inventory, there was a difference between having a large amount of gold and being able to make an infinite amount of gold.</p><br/><p>Just like Dortu said, gold was a magical metal. Although it couldn’t compare to Lukadion, which made up the Luka continent’s holysword, or the famous mithril, just the fact that gold was used a universal currency across countless worlds showed how valuable it was. Now, I could simply make gold through my elemental’s power.</p><br/><p>Where did I get Dortu’s egg from again? If I remember correctly, it was from Luka continent, during Syrmia Bamirtuno’s funeral. She said she was from a world called Xenon. Were there more elementals like Dortu in that world? … Impossible. If that were the case, the value of gold in the dungeon should have fallen when they connected with Xenon. In any case, it seemed I needed to visit this Xenon world one day.</p><br/><p>While I was thinking about all this, the ground had completely transformed into pure gold. Past a certain point, the land remained in its black color of death, but within a certain radius of us, no speck of black color could be seen. It was quite ironic considering that the Death King’s life force was sleeping underground.</p><br/><p>“There. This is the end!”</p><br/><p>Daisy raised her foot and stomped down. The metallic ground sunk in and rolled like a wave. From underneath her foot, something began to charge towards her.</p><br/><p>“Just die obediently, give it to me.”</p><br/><p>When Daisy spread her arms open, silver light gathered on her hands. I instinctively knew that this was Hecate’s power. Daisy had saved her power to thoroughly end the Death King’s life.</p><br/><p>[KAAAAAAAAAAAAK!]</p><br/><p>A loud death throe shook the earth. The most tenacious and nerve-wrecking king was finally dying.</p><br/><p>The pieces of the life vessel trying to assault her burnt up under her silver light, and the same happened to the sparkly grains of sand in Licorice’s rainbow fog. When Daisy cusped her hands together, the fog moved towards her hands and shone periodically.</p><br/><p>Some time later, Daisy opened her hands. There was an octagonal translucent silver object floating inside. Daisy spoke contently.</p><br/><p>“Remote controller. Meli’s remote.”</p><br/><p>“… Is that short for Metal Lich?”</p><br/><p>Daisy jumped in shock and looked away with a flushed face.</p><br/><p>“Kang Shin, you know me too well… Do you like me, that much?”</p><br/><p>Silence descended. If Licorice didn’t try to give Daisy a Hectopascal Kick, we would have all stayed frozen for a bit longer.</p><br/><p>Regardless, we managed to finish off the last remaining king.</p><br/>\n</div>"}