{"title": "Chapter 293. The Last Member (10)", "id": 293, "volume": 3, "url": "http://boxnovel.org/infinite-competitive-dungeon-society-chapter-293-the-last-member-10", "volume_title": "Volume 3", "body": "<h1>Chapter 293. The Last Member (10)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 293. The Last Member (10)</p><br/><p>The moment the Fear King died, I flew next to Hwaya. But when I noticed what state she was in, I stopped. She was taking deep, slow breaths. Every time she breathed in, a vast amount of mana rushed into her. It was her mana that scorched the Fear King. No… To be precise, it was mana that once belonged to the Fear King, having its impurities removed by Hwaya’s flames.</p><br/><p>“Looks like Hwaya found her path.”</p><br/><p>Just like how I accepted the Beast King’s mana without the dungeon’s help, Hwaya was accepting the Fear King’s mana as her own. I didn’t want to bother her as she was going through this process, so I decided to just watch her from afar.</p><br/><p>In just five minutes, Hwaya sucked in all the mana and opened her eyes. When she realized I staring at her, she made an expression that seemed to say, ‘oops.’</p><br/><p>“S-Sorry, Shin. I got too excited and took everything… C-Come here. I’ll give you half.”</p><br/><p>She smiled and gestured me to come over. I knew what she planned to do, but I asked her out of politeness anyways.</p><br/><p>“And how do you plan on sharing it?”</p><br/><p>“You already know. Uhuhu, uhuhuhu. Now, now, come here.”</p><br/><p>Hwaya pucked her lips like a duck and stretched her arms out towards me. I didn’t even need to listen.</p><br/><p>“You can take it all.”</p><br/><p>Hwaya shouted disappointedly at my cold reply.</p><br/><p>“Why!? Come here and take you hard-earned share! Hurry!”</p><br/><p>“I experienced the same thing when I killed the Beast King. I haven’t even finished processing his mana yet.”</p><br/><p>“Tsk.”</p><br/><p>Hearing what I said, Hwaya clicked her tongue noticeably. I grinned and spoke.</p><br/><p>“Let’s go out now. There’s still one king left.”</p><br/><p>“Ah, right. We should.”</p><br/><p>Even as she said that, she stole glances at me as if it was a shame we had to leave so soon. Really, what am I going to do with her? I sighed and approached her.</p><br/><p>“Don’t give me any mana though, alright?”</p><br/><p>“Yeah!”</p><br/><p>Hwaya replied with a full smile. Since she looked cute, I decided to forgive her.</p><br/><p>Soon afterwards, when Hwaya and I came outside, we couldn’t feel anyone’s presence… except one. Kain was the only one remaining. He was sitting on empty air, and stood up when he saw us.</p><br/><p>“Not bad.”</p><br/><p>“You saw us?”</p><br/><p>“Sleipnir was holding on.”</p><br/><p>Hwaya whispered in my ear.</p><br/><p>“Who’s that?”</p><br/><p>“He’s the one who helped me enter the dungeon. He’ll be Revival’s newest member.”</p><br/><p>“Ah, so you really couldn’t enter using normal methods.”</p><br/><p>Hwaya muttered with a bitter smile and asked me worriedly.</p><br/><p>“I don’t know how you roped him in, Shin, but if the price you had to pay was helping his world…”</p><br/><p>“That’s not it. Besides, I had to meet him eventually, so don’t worry about it.”</p><br/><p>“Mm… It feels like you’re getting farther away.”</p><br/><p>Hwaya seemed to have felt uneasy as she carefully took my hand and held it tightly. I didn’t stop her as it was a pleasant feeling anyways. On the other hand, Kain’s eyebrows twitched.</p><br/><p>“You’re quite a man.”</p><br/><p>“I am. So? Where is everyone?”</p><br/><p>“A dungeon shattered and the one you call King appeared.”</p><br/><p>“Now!?”</p><br/><p>I somewhat expected it when no one was here, but I was still shocked. Not only did they use the dungeon’s power for themselves, they even broke the dungeon and appeared on Earth!? What shocked me the most was the timing when the dungeon shattered. It was almost like they knew what was happening elsewhere!</p><br/><p>I wiped the thought off my head for now. It was more important to go help my friends.</p><br/><p>“Are you going now?”</p><br/><p>Kain asked me in a relaxed voice. I could tell by his attitude that he wanted to maintain the distance between us for a little longer. I couldn’t blame him.</p><br/><p>“Of course. I trust them, but you never what’s going to happen.”</p><br/><p>“I already did my job today, which was using Gungnir and Sleipnir. I won’t help you any more than this.”</p><br/><p>“I know… But you can’t do the same tomorrow.”</p><br/><p>The promise between us was a mutual contract. I needed his help, and he also seemed to need mine. At my words, which carried this sentiment, Kain slowly nodded.</p><br/><p>“Of course, I promise. Once today passes, I will join your guild and become a member of Revival.”</p><br/><p>“Good. Hwaya, let’s go.”</p><br/><p>Hwaya glared at Kain unhappily, but she seemed to have decided to leave things to me as she shut her eyes and answered.</p><br/><p>“Un.”</p><br/><p>The King of the Dead must have appeared in Vatican City. When I imagined countless undead breaking historical monument at the headquarter of the Catholic Church, I couldn’t help but find it ironic. As I flew around the world previously, I set Return’s transfer points here and there, and thankfully, Rome happened to be one of them.</p><br/><p>“Return.”</p><br/><p>I closed my eyes and opened them back up. For a moment, I was worried I traveled to the wrong place, but we were indeed in Rome. Rome was close to Vatican City, and because Yua once told me she wanted to visit Vatican City, I had remembered to set Rome as a transfer point.</p><br/><p>But the Rome I was looking at looked nothing like the Rome I knew. This place had already become hell.</p><br/><p>“What’s going on…?”</p><br/><p>“Shin, over there!”</p><br/><p>Hwaya seemed to have sensed something, as she pointed to the distance. I soon understood how she found out so quickly. A giant flame dragon was flying in the sky.</p><br/><p>[KUAAAAAAAA!]</p><br/><p>The hell breaking out under us caught our feet, but my friends’ lives had greater priority. We shot towards the direction of Laki’s roar. As we flew, we could clearly see the Vatican Walls, which no longer stood as they once did.</p><br/><p>There wasn’t even a single building left intact, and it was even harder to find any survivors. Even Rome was broken apart to such extent. It wouldn’t make sense if Vatican City was fine.</p><br/><p>All we saw was grey smoke, dust, and undeads. The Death King had turned the entire city into death.</p><br/><p>“Son!”</p><br/><p>“Father!”</p><br/><p>Father, who was riding on Laki’s back, shouted in rejoice when he saw us. He didn’t look hurt, but his rough breathing made me worry.</p><br/><p>“Did you save my daughter!?”</p><br/><p>“I’m here, Aju… Father!”</p><br/><p>“Good! Hurry, go help the other kids!”</p><br/><p>Other kids? I looked around in hurry. I couldn’t see Daisy or anyone else. Considering how the Death King was also missing, it seemed they were fighting in a different place. But then why did Daisy leave Laki here? Was she fine without Laki? A sense of uneasiness swept across my head, which I immediately shook off. Thankfully, Father appeased my worry.</p><br/><p>“Daisy left Laki for us. She must be having a hard time so go help her!”</p><br/><p>There were countless monsters other than Laki in the air. Each of them were grotesque and unsightly. They looked similar to the Fear King’s clones, but unlike the clones who received the Fear King’s power, these monsters looked lifeless. They were all undead.</p><br/><p>“Why did you split up?”</p><br/><p>“When he appeared, he brought an enormous army. Just the power he had alone was terrifying! … He’s dangerous, probably the most dangerous out of the Five Kings. Daisy must have known that.”</p><br/><p>Father gritted his teeth and thrust his spear in front of him. Vibration energy converged onto a single point before shooting out in a straight line. Monsters flying near it, aiming for Laki’s flesh, disappeared without leaving a single drop of blood.</p><br/><p>“His power of death is contagious. It’s a vicious curse that only the Elixir can cure! Don’t underestimate him and get yourself hurt. Got it!?”</p><br/><p>“I’ve heard more than enough!”</p><br/><p>Father wasn’t the only one on Laki’s back. Ye-Eun was also here, scrunching down and carrying two black daggers. No, this wasn’t Ye-Eun, but Duca.</p><br/><p>“Hurry up and go help Hecate’s disciple! The Lava King is enough to hold out here!”</p><br/><p>In the midst of Laki clashing with countless monsters, I felt an ominous death energy from the distance. The moment Daisy realized how dangerous the Death King was, she must have left Laki behind to deal with his army while she left to fight him directly. When I was about to charge towards her direction, Hwaya spoke up.</p><br/><p>“Shin, it looks like I’ll have to stay and help Ina.”</p><br/><p>“Ina? Shoot!”</p><br/><p>I only just realized. My daughter was standing alone on the ground dominated by death. The freezing energy shooting out from her hands were destroying the monsters approaching her.</p><br/><p>In terms of raw power, the monsters on ground were far more damaging than the monsters in the sky. This was because they had devoured all living beings and turned them into one of their own. To further strengthen themselves, they had even broken out of Vatican Walls and were trying to reach out towards other parts of Italy. Currently, Ina was stopping them all by herself. Though she possessed a boundless mana, she was still a child who was less than ten years old. But she was still facing so many undead by herself!</p><br/><p>To stop the destruction from spreading, to protect even one more life, Ina was standing her ground while dripping with sweat. Seeing her tragic fate, I bit my lips. It seemed Ina was the only thing Hwaya could think about, as she let go of my hand, shouting out as she flew off.</p><br/><p>“Take care of Daisy, Shin!”</p><br/><p>“Yeah. You take care of our daughter, Hwaya!”</p><br/><p>With that, we split up. I flew up, while Hwaya flew down.</p><br/><p>“Mommy!”</p><br/><p>“Yeah, Mommy’s here, so don’t worry!”</p><br/><p>Hearing their heartfelt shouts with my keen hearing, I smiled as I soared up. After breaking through the clouds, I felt chills from Daisy’s power. Just how far did she bring the Death King!? Thankfully, I could feel the presence of death and the power of a god facing it!</p><br/><p>“Daisy, Sumire!”</p><br/><p>“Kang Shin, here… Now, we won. Huhu.”</p><br/><p>“You came, Shin-nim!”</p><br/><p>Seeing their unrelenting faith in my strength, I smiled bitterly. She had to be using a god’s power, but she was still dripping with sweat. Controlling Laki and facing a king couldn’t be that easy!</p><br/><p>On the other hand, Sumire who was protecting her looked unfamiliar. She wore a shining silver armor with a spear in one hand and the Aegis in the other. A full-body armament?</p><br/><p>“I got stronger too, Shin-nim!”</p><br/><p>I was about to say something, but decided against it. Now wasn’t the time to ask questions. All I needed to know was that Sumire had become more reliable. Not to mention…</p><br/><p>[The Hero is here. He came to defeat me. The Hero really defeated the others and came here. Haha, hahahaha!]</p><br/><p>An existence far more fearful than someone like the Fear King was looking straight into me.</p><br/>\n</div>"}