{"title": "Chapter 317. The Clash Approaches (4)", "id": 317, "volume": 4, "url": "http://boxnovel.org/infinite-competitive-dungeon-society-chapter-317-the-clash-approaches-4", "volume_title": "Volume 4", "body": "<h1>Chapter 317. The Clash Approaches (4)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Once we left Alaska and entered Canada, the desolate atmosphere I felt in Alaska diminished slightly, as most of Canada was still populated with humans.</p><br/><p>We traveled to Vancouver, taking care of monsters on our way, and planned to continue down to the States before coming back up. In less than an hour, we passed through the border after cleaning up monsters.</p><br/><p>As America had one of the highest numbers of ability users, the regions taken over by monsters weren’t as bad as Alaska. If everything went as planned, we would be able to reach Greenland by the end of the night.</p><br/><p>However, the people who welcomed us in Seattle were a bit strange.</p><br/><p>“That’s him…”</p><br/><p>“Kang Shin.”</p><br/><p>“It’s really Kang Shin.”</p><br/><p>For some reason, even the Guardian members would not talk to me and talked to Yua instead. Why were they talking to Yua when I was right in front of them!?</p><br/><p>“… Why do I feel like a monkey in a zoo?”</p><br/><p>“I can’t believe it sometimes either. Be understanding, Oppa.”</p><br/><p>Yua made a rare bitter smile as she looked around.</p><br/><p>“Oppa’s power is just too unrealistic. Almost to the point that all the other crazy things happening around the world seem irrelevant. Your outer appearance changed so much too.”</p><br/><p>“Ah.”</p><br/><p>I remembered what Daisy said yesterday and shut up. What seemed like an exaggeration by Daisy now seemed to carry a hint of realism. … No, everyone already knew I was the strongest person on Earth.</p><br/><p>“Well, I guess I’m not completely human anymore.”</p><br/><p>I murmured bitterly and rubbed my forehead. I could feel he reddish black horn protruding out of my forehead shining while carrying heat.</p><br/><p>In truth, I considered hiding my horn in front of the masses, but I didn’t want to hide something after I’d come this far. I decided to bear the looks people would give me, but things seemed to be going a bit differently than I had imagined.</p><br/><p>Of course, I had long since passed the point where I would be affected by how people looked at me. I grinned. It was a bit shocking that other people found it hard to talk to me, but that was it. It was true that I was different from them, and I didn’t plan to go back to how I was either.</p><br/><p>“So, Yua. What did they say?”</p><br/><p>“They said we’re close. Seattle is fine, but apparently, the coast of Portland right below Seattle is full of monsters.”</p><br/><p>“Portland? That should only take a few minutes on Aikan. Alright, let’s go!”</p><br/><p>Our hunting method was just as simple in America as it was in Alaska. I used Dortu’s power to create hundreds of thousands of mirrors and released my Evil Eyes’ power to petrify all monsters. Then, Daisy’s undead and Yua’s tamed beasts shattered them and ate them.</p><br/><p>I spread my mana out to check for any monster that might have been unaffected by my Evil Eyes, and once I concluded that everything was fine, we moved to the next area. With this method, it took less than 10 minutes to clear an area the size of Seoul.</p><br/><p>“Everything turned to stone.”</p><br/><p>“He’s not human.”</p><br/><p>“He has a horn. Of course, he’s not human.”</p><br/><p>The ones saying these stupid things were obviously the Guardian members traveling with us. I hopped on Aikan’s back with a sigh.</p><br/><p>[I am Dortu. Master, is enough mana stored?]</p><br/><p>“If we don’t, we can always get more.”</p><br/><p>I lightly retorted to Dortu’s question and took a breath. As I had absorbed the death energy of all the monsters I massacred, I had to clean the chaotically stuffed energies inside me. Once that was done, I took in new mana into my cleaned body. Seeing me gather mana with Peruta Circuit and Absolute Soul, Daisy said I was like a vacuum cleaner.</p><br/><p>“My mana, don’t suck it in.”</p><br/><p>“I know.”</p><br/><p>“How long will it take until my Peruta Circuit reaches Oppa’s level?”</p><br/><p>“Mm, if it’s Yua, I’m sure it won’t take too long.”</p><br/><p>Though, no matter how talented Yua was, it would be impossible before Earth was completely reclaimed.</p><br/><p>“Let’s hurry. I don’t think the one Ciara talked about is in America.”</p><br/><p>“Yes!”</p><br/><p>“Ignoring dungeon’s power, more and more appear. At this rate, dungeon’s business expansion will fail?”</p><br/><p>I flicked Daisy’s forehead, but because what she said was partly true, I smacked my lips. Setting aside the business expansion nonsense, there was no guarantee that the worlds’ enemies I’d meet from now wouldn’t be like the Demon Lord or the one I met in Edias continent. If worlds’ enemies like them increased, worlds became conquered, and more began to desire other worlds’ powers…</p><br/><p>If the ability to ignore the dungeon’s power spread to ordinary monsters, most dungeon explorers might fare worse than if they hadn’t climbed the dungeon.</p><br/><p>“No, that won’t happen.”</p><br/><p>“Why?”</p><br/><p>“Because I’ll take care of everything.”</p><br/><p>I answered half-jokingly and smirked. Daisy then covered her mouth and spoke quietly.</p><br/><p>“Confidence erupting, like puberty. You’ll kick your bedsheets later.”</p><br/><p>“You watch out. I’ll make you kick your bedsheets.”</p><br/><p>Thanks to America’s Guardian and the succubi that gathered all the necessary data, we swept through America extremely quickly.</p><br/><p>Reporters fearlessly followed us around wherever we went, and the broadcasting stations that received the footage aired out the content. Because of our unbelievable speed, the media was even thinking I had clones.</p><br/><p>The method we used was the same wherever we went, but the public opinion of us soared with each footage. Although I didn’t really care for it, the public’s awe was beginning to reach worship. As this wasn’t the first time I was experiencing something like this, I wasn’t shocked in the slightest.</p><br/><p>“It looks like I shouldn’t even dream about mixing in with people and living an ordinary life.”</p><br/><p>When I murmured self-mockingly, Ye-Eun consoled me with a cheery voice.</p><br/><p>“I went to apply for a leave of absence before and people treated me like an alien. They were taking pictures of me and everything!”</p><br/><p>“You took off your hoodie?”</p><br/><p>“I had to for the Unni working at the office. That’s when people started taking pictures.”</p><br/><p>“I think that’s when they realized your presence.”</p><br/><p>“Ah…”</p><br/><p>Realizing what really happened, Ye-Eun drooped her head sullenly. Although I didn’t want to tell her, I couldn’t let her forget about her stealth ability!</p><br/><p>“Also, you could have applied for the leave of absence from home.”</p><br/><p>“I tried… I went to school because I couldn’t do it at home.”</p><br/><p>Sometimes, I wonder how you got into our college.</p><br/><p>America, then Canada. We went around every area that might have monsters, but we didn’t find anything special. One would think my suspicion would start to lessen, but it was the opposite.</p><br/><p>Currently, it was night time. As it seemed this trip would take over two days, we gave up our sleep and flew to Greenland immediately. We made a campfire on Aikan’s back.</p><br/><p>“As I thought, it was Greenland.”</p><br/><p>“Greenland? What’s there?”</p><br/><p>“Ice.”</p><br/><p>“And?”</p><br/><p>“Stone.”</p><br/><p>Daisy dropped her jaws at my replies. I didn’t lie. Most of Greenland was ice or stone. Only 1% of it was grassland.</p><br/><p>“What about, people?”</p><br/><p>“There used to be around 60,000, but apparently they all died. Compared to how big the land is, there might not be many monsters. They won’t have much to eat.”</p><br/><p>Some probably died of hunger, I thought, as I placed a sweet potato over the campfire. They didn’t have anyone to blame. It was their fault for crossing over to Earth and killing people.</p><br/><p>“Kang Shin, that’s 1%?”</p><br/><p>“Hm?”</p><br/><p>Daisy’s sudden question made me drop my sweet potato and glanced over. Just like the succubi reported, I saw a land covered in ice. Upon closer inspection, however, the land seemed murky. My Evil Eyes were responding.</p><br/><p>“That’s not 1%, but 84%…”</p><br/><p>For a moment, I saw something other than ice. If not for my Evil Eyes, I wouldn’t have seen through it.</p><br/><p>That was fake.</p><br/><p>The moment I became certain, a translucent barrier appeared in the air. The sheer size of it made it hard to describe with words and seeing how it curved in the higher it got, it seemed it was some kind of a dome covering Greenland. It was like the magical barrier said to protect the mythical underwater city of Atlantis.</p><br/><p>“Wow.”</p><br/><p>I exclaimed. I could now see why Daisy asked if that was the 1%. With the ominous thought that 1% might have turned into 100%, I picked up the half-cooked sweet potato and glared at the giant barrier blocking Aikan.</p><br/><p>“Shin, that’s a sweet potato.”</p><br/><p>“You’re right, it is. But look closely. This is what it means to concentrate your power.”</p><br/><p>“Kang Shin, use something else, if possible. If done in by a sweet potato, even I would feel, embarrassed.”</p><br/><p>While Ye-Eun and Yua tilted their heads, Daisy advised me calmly. But I simply grinned at them and held the sweet potato with two hands. Then, I spoke as I poured all my mana into it.</p><br/><p>“Dortu.”</p><br/><p>[I am Dortu. Dortu would have liked it more if it was something other than a sweet potato.]</p><br/><p>Dortu complained as he turned the sweet potato into metal. Although its size and shape were still that of a sweet potato, its material was changing into something else. When I was looking at the sweet potato shining with a five-colored light, Dortu spoke in a bragging manner.</p><br/><p>[I am Dortu. This is orichalcos. Directional explosive. Dortu’s specially constructed metal.]</p><br/><p>“A sweet potato is, orichalcos… Kang Shin, plus one to bedsheet kicking.”</p><br/><p>In less than a few seconds, over a million mana poured into the tiny sweet potato. Of course, it was only possible because Dortu changed it to orichalcos, but with this tiny sweet potato carrying an absurd of mana, the light it was giving off was too bright for one to look at directly.</p><br/><p>I then focused Peruta Circuit’s energy in it. The sweet potato then became a sweet potato whirlpool, spinning endlessly and giving off radiant light.</p><br/><p>With this much light, the enemy must have noticed. Across the translucent dome, I could feel dozens of magic power reacting.</p><br/><p>However, it was too late.</p><br/><p>“Your roasted sweet potato is here!”</p><br/><p>I shouted at the top of my lungs and threw the sweet potato. When it touched the gigantic barrier that even made Aikan look like a pebble…</p><br/><p>The dome disappeared as if it never existed.</p><br/><p>“The barrier disappeared!”</p><br/><p>“The barrier created by the duke!”</p><br/><p>Greenland’s vast land disguising itself as a land of ice revealed itself.</p><br/><p>Dumbfounded, I let out a sigh. The swarm of demons gathering on the ground made me recall the time I killed hundreds of thousands of demons in Oceania. However, the bigger problem was that Greenland was no longer Greenland.</p><br/><p>“These bastards… They moved Luka continent here.”</p><br/><p>The plants I saw in Luka continent were growing on the blood-colored land, and freakishly tall trees were soaring up to the sky. Moreover, the atmosphere was filled with ominous demonic energy.</p><br/><p>Greenland had already transformed into the demons’ land. Ciara was right. What she foresaw wasn’t another Lespina, but a much bigger problem.</p><br/><p>“Kang Shin, can I go wild now?”</p><br/><p>“What do you mean go wild. Stay put.”</p><br/><p>I snorted at Daisy.</p><br/><p>“You have to wait until the bomb goes off.”</p><br/><p>“Sweet potato, already broke the barrier.”</p><br/><p>“That was a warm-up.”</p><br/><p>As the party members were looking at me blankly, I explained kindly.</p><br/><p>“A lump carrying 1,000,000 mana is causing a highly dense whirlpool of mana. What would happen when it met a widely spread current of mana?”</p><br/><p>“It would be sucked in?”</p><br/><p>“Right.”</p><br/><p>“Instantly?”</p><br/><p>“Instantly. Then…”</p><br/><p>The sound that rang out at that moment was not a boom, nor a BOOM…</p><br/><p>But a satisfying SWIIIISH.</p><br/><p>It was the sound of Greenland and 60% of demons flying away.</p><br/>\n</div>"}