{"title": "Chapter 319. The Clash Approaches (6)", "id": 319, "volume": 4, "url": "http://boxnovel.org/infinite-competitive-dungeon-society-chapter-319-the-clash-approaches-6", "volume_title": "Volume 4", "body": "<h1>Chapter 319. The Clash Approaches (6)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>“Kuk!?”</p><br/><p>“Stop him! Those metals are dangerous!”</p><br/><p>It seemed demons liked to pretend to be dragonknights, as they all wore dull suits of armor. However, the metallic fragments Dortu shot out dug through even the tiniest gaps in their armor to injure them. The death energy that invaded their bodies then weakened them.</p><br/><p>“He can use death energy!”</p><br/><p>“Attack him together!”</p><br/><p>The monster birds charged towards me. It seemed they realized they couldn’t dodge Dortu’s attack as they endured the barrage of metallic fragments in their path. At that moment, Ye-Eun leaped up above me.</p><br/><p>“If the enemies are demons…”</p><br/><p>When Ye-Eun’s form disappeared from my sight, the head of the closest demon from us flew off. The monster bird he was riding on also began to fall with a vast amount of blood spurting out of his neck.</p><br/><p>“She sure is fast.”</p><br/><p>Her speed even made me think she had Divine Speed. If I remember correctly, I think she said she moves through shadows? Regardless, her speed was shocking. The demons also stopped in place, seeing one of their comrades suddenly die. Meanwhile, another head of a demon flew up. With how powerful these demons were, I could see how formidable Ye-Eun has gotten.</p><br/><p>“I can’t lose!”</p><br/><p>I also didn’t plan on receiving their attacks for free! I aimed my spear at the opposite direction of Ye-Eun and began to charge forward. A fierce gale blew around me.</p><br/><p>“I’ll show you Wind King’s Rage!”</p><br/><p>“Under His Highness Demon Lord’s name, we will subdue you!”</p><br/><p>“For His Excellency Duke!”</p><br/><p>The demons shouted valiantly and held up their weapons carrying chilling magic power. At the same time, the strange aura emanating from them seemed to choke me.</p><br/><p>However, I brushed it off as though I’d experienced this restraint hundreds of times. In fact, their restraint of the dungeon’s power helped me sense it more clearly, and I pushed this power off to the side separate from my other powers. Since I couldn’t use this power, it was better to separate it to minimize the demons’ effect on me than to worry about it.</p><br/><p>Moreover, I was no longer weak without the dungeon’s power!</p><br/><p>“Hold onto your weapons tightly! Try not to die before you can use it!”</p><br/><p>I thrusted my spear at the demons in front of me. Dark blue skin and red eyes, a demon attempted to hold up her shield but stopped when she met my eyes. The trembling voice she let out helped me affirm she was female.</p><br/><p>“H-Hero, I…!”</p><br/><p>“Loving an enemy commander is not allowed!”</p><br/><p>I mercilessly pierced her head. Then, I shot up high using the monster bird as a stepping stone and used the wind energy following me to gain momentum for my next attack.</p><br/><p>The next target wasn’t female, and this one shot out a thick lightning bolt from his hands. When the red lightning struck my body, it disappeared without leaving behind a trace. In the next instant, I was close enough to the demon to see his hair follicles. His shocked eyes were quite funny.</p><br/><p>“How…!”</p><br/><p>“Unlucky.”</p><br/><p>I also pierced his head, and blue blood spurted out, drenching me.</p><br/><p>“So, this is it!? Come on then!”</p><br/><p>“Kuk, he’s a monster!”</p><br/><p>“Where is His Excellency!?”</p><br/><p>“Our duty is to complete our mission! Attack!”</p><br/><p>The moment the demons came together to guard against me, one of the demons was beheaded and Ye-Eun showed herself for an instant. In her hands were two daggers shining with a faint light. I immediately wondered.</p><br/><p>‘She already learned to compress her energy to that extent?’</p><br/><p>“Kuhuk!”</p><br/><p>“A woman!”</p><br/><p>“You won’t catch me with that speed.”</p><br/><p>A monster bird spat out a breath mixed with fire and acid, but Ye-Eun was already gone. Freely running across the ice footholds Ruyue created, Ye-Eun moved like she was in a pinball game. The demons’ formation became disorderly, and I charged straight into them.</p><br/><p>“Kuaaaaaaaak!”</p><br/><p>When my spear struck a demon, countless number of bone spears shot out around me and attacked nearby demons. However, the bone spears weren’t enough to deal fatal blows.</p><br/><p>“Haaaaap!”</p><br/><p>“Taste the wrath of demons!”</p><br/><p>“His Excellency will claim your life!”</p><br/><p>“For victory!”</p><br/><p>Even with Wind King’s Rage continuing, demons charged toward me the moment they saw me. They were shining with threatening demonic energy, but I snorted and cut them down easily. Dortu then gave me a warning.</p><br/><p>[I am Dortu. The armor’s state is becoming strange.]</p><br/><p>“Armor?”</p><br/><p>I furrowed my brows. He wasn’t wrong. The surface of Pure Black Desire, which was now coated with the blood of demons, was faintly shining. As if it was pulsating, the light became weaker then stronger periodically. I couldn’t remove it with Sharana’s power, and not even Peika’s power could burn it off.</p><br/><p>“Looks like you don’t know about our ancient spell.”</p><br/><p>One of the demons spoke arrogantly. Ancient spell? I barely knew anything about the current demons. There was no way I would know anything about their ancient time. I first beheaded that demon and converged wind energy around me.</p><br/><p>I tried to take on Pure Black Desire, but that wasn’t possible. Without the dungeon’s help, I couldn’t tell what this spell did. At the very least, I knew that it prevented me from taking off the armor.</p><br/><p>“Dortu!”</p><br/><p>[I am Dortu. I am working on it. A formidable power is hindering me, but for now, it is not doing anything.]</p><br/><p>It’s even warding off Dortu who can dominate metal? Why were they hiding such a powerful spell until now? Trace of blood, concentrated energy, and the times when the light shone… Could it be?</p><br/><p>“It is a spell formulated with our lives! Will you drench yourself in our blood knowing that!?”</p><br/><p>It was as I thought. They were prepared to die from the beginning solely to cast this spell on me. I began to sense danger.</p><br/><p>A spell capable of affecting a Legend grade armor that I couldn’t do anything about. When I became flustered, the demons began to grin as though they’d gained the upper hand. It was extremely unpleasant.</p><br/><p>“Hmph.”</p><br/><p>I guided the lightning and wind energy of Wind King’s Rage’s final attack and concentrated them around my spear. The demons noticed it and tried to escape, but I released the energy before the could do so.</p><br/><p>“You guys can all die!”</p><br/><p>“Kuaaaak!”</p><br/><p>Dozens of monster birds were swept away by the lightning storm and disappeared without leaving behind a trace. The demons riding on them also shared the same fate except a few that managed to escape the range of the attack in time. I took a deep breath and shouted at Ye-Eun.</p><br/><p>“Don’t let their blood get on you!”</p><br/><p>“Don’t worry, Shin. I’m clean.”</p><br/><p>I turned around as Ye-Eun’s voice seemed to have come from behind me, but Ye-Eun wasn’t there. Instead, blood spurted out from one of the demons charging toward me from the left.</p><br/><p>“Kaaaak! We were all waiting for you, Hero! You will die here!”</p><br/><p>“Shut it, die.”</p><br/><p>Just thinking about being tricked annoyed me greatly, but when their voices fanned the flames, I shot balls of aura and exploded them to death. At the same time, I was angry at myself for not noticing their spell when I thought I mastered mana.</p><br/><p>It was most likely because I was only focused on the fact that they weakened the dungeon’s power. Foolish! Though I’ve fought countless number of demons until now, I shouldn’t have thought they were all the same.</p><br/><p>“His Excellency will arrive soon!”</p><br/><p>“Let us offer our lives until his arrival! Ensnare the Hero!”</p><br/><p>“If you want to dream, do it when you’re asleep!”</p><br/><p>But there was nothing I could do to change what had already happened. I didn’t think being showered by their blood would cast a curse. In any case, this was a good lesson for the future. From now on, I would kill them without letting anything touch me!</p><br/><p>[I am Dortu. The energy is activating. Careful, Master.]</p><br/><p>Dortu’s sharp voice warned me. I nodded inwardly and moved even quicker. At the same time, I felt a mass of energy flying toward me from the north. Even without confirming it with my eyes, I knew it was the duke the demons were talking about. Since their spell was activating now, it seemed the duke’s existence served as a trigger to start the spell.</p><br/><p>I drew up Absolute Soul and Peruta Circuit to the peak. I asked Dortu to place a thin layer of barrier between my armor and skin. With Sky God’s Play and World Trickery, everything was perfect. Anything else wouldn’t pose a problem.</p><br/><p>“Guys, get ready!”</p><br/><p>“Aikan, defense mode.”</p><br/><p>“Luna, protect us!”</p><br/><p>Daisy and Yua seemed to have felt the duke’s energy too,a s they immediately began to make preparations.</p><br/><p>Brining the two of them was truly a wise decision. In front of enemies who suppressed the dungeon’s power, tamers and necromancers, who wielded other monsters’ power rather than their own, were the least affected. As long as the link connecting them to their monsters were secure, they would be able to show their full power.</p><br/><p>I was worried about Ye-Eun the most, but since she hasn’t called Duca yet, it seemed I didn’t need to worry much.</p><br/><p>In truth, I was shocked by her speed that could match Divine Speed and destructive power that could behead a demon in one blow. This was especially so considering the dungeon’s power was being suppressed. It seemed what I felt a couple days ago wasn’t wrong. What was left now was for her to… Uk!</p><br/><p>[I am Dortu! The curse is activating, Master!]</p><br/><p>I could see the so-called demon duke approaching. With a huge pair of bat-like wings and a set of long, curved horns, a man carrying himself proudly flew over. I did not see him in the Luka continent, so he had to be one of the high ranking demons that didn’t appear.</p><br/><p>I was also certain that he wasn’t born with the ability to suppress the dungeon’s power like Lespina. The depth of time I could feel from him was too great for that to be the case. Then how was he suppressing the dungeon’s power? The answer was simple.</p><br/><p>He was powerful enough to crush an average world’s enemy. Just like how worlds’ enemies nullified the dungeon’s power with their leagues, this demon duke was also defying Sherafina’s power with his league. Furthermore, the demon elites that attacked us previously had covered this area with their energy. Part of the reason was to place this curse on me, but their main role was to construct a battlefield! A space where the dungeon’s power couldn’t be used properly!</p><br/><p>“Nice to meet you, Hero!”</p><br/><p>The demon duke shouted excitedly. Though he didn’t have anything in his hands, he was reaching his hands towards me in a claw-like manner as if to wrench something out of me.</p><br/><p>“I am truly thankful that I got to meet you. Of course, I’ll have to ask you to pay the price for blowing away our new base!”</p><br/><p>[Master, now! Now!]</p><br/><p>“Have a taste of what you did!”</p><br/><p>I widened my eyes. I understood what he was doing. I was all too familiar with this flow of energy.</p><br/><p>Pure Black Desire exploded. In this moment, this armor, which carried the unbreakable option, was separated from the dungeon’s power completely. Then, it split into hundreds of thousands of fragments and swept through all demons around me. Of course, someone who was wearing it couldn’t be safe.</p><br/><p>“Shiiiiiin!”</p><br/><p>Ye-Eun shouted. Now that I think about it, if our genders were swapped, isn’t this the perfect moment for a main character of a novel to awaken a new power? While facing an unimaginable pain, such stupid thought crossed my mind.</p><br/><p>However, at that moment, Ye-Eun began to shine with a dark blue light.</p><br/><p>“Uwaaaaaaaaah!”</p><br/><p>Ye-Eun’s stretched out her hands covered in black aura. Seeing three pairs of arms sprout up from her shoulder joints, I thought in a daze.</p><br/><p>I can’t even crack a joke.</p><br/>\n</div>"}