{"title": "Chapter 325. With Your Own Power (5)", "id": 325, "volume": 4, "url": "http://boxnovel.org/infinite-competitive-dungeon-society-chapter-325-with-your-own-power-5", "volume_title": "Volume 4", "body": "<h1>Chapter 325. With Your Own Power (5)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>“See you, Loretta.”</p><br/><p>“Shin-nim, you haven’t slept for two weeks.”</p><br/><p>When I met Loretta, I gave my goodbye as always and tried to head to the next floor. However, Loretta held me back.</p><br/><p>“Shin-nim has superhuman powers, and I know Shin-nim is growing even now. Soon, Shin-nim might even reach my level. But you still need to rest.”</p><br/><p>“There’s no way I’ll be a match for…”</p><br/><p>As I turned around, I laughed at what Loretta said. Then, I stopped.</p><br/><p>“…”</p><br/><p>“Can you see it now?”</p><br/><p>Loretta spoke with a faint smile. It was as she said. Looking at her directly, I felt as though I could take her on. This didn’t come from a simple estimate of her mana. It came from the intuition of a warrior comparing his League against his opponent’s.</p><br/><p>“But Loretta was far away not too long ago… What happened?”</p><br/><p>“That’s how fast Shin-nim is growing. For others, it becomes harder to take the next step the further they go, but it’s the opposite of Shin-nim. Shin-nim was slow to grow at first, but now, Shin-nim’s mana, League, and body are all growing by the day. Do you think that’s because of the dungeon?”</p><br/><p>“… No.”</p><br/><p>I slowly shook my head. Absolute Soul, Peruta Circuit. Beast King and the others kings I absorbed mana from. The most recent Extort. All of these didn’t just end after I obtained them. Even now, they were slowly yet explosively growing.</p><br/><p>My body grew sturdier by the day, while my muscles grew stronger, the charm in my horn grew more powerful, and my mana multiplied. Even if I was facing a million of myself from a year ago, I had the confidence to crush them with a single punch.</p><br/><p>“If even a little more external power flows into Shin-nim, Shin-nim will explode. For now, you need to make the power you have yours.”</p><br/><p>“I have time.”</p><br/><p>“You need time. I originally planned to just watch until Shin-nim reached the 90th floor, but I didn’t think Shin-nim would get stronger while crossing the 89th floor.”</p><br/><p>“Ah…”</p><br/><p>I did think I got stronger when I almost completely destroyed the Eliminator. It would be silly if I didn’t gain anything after experiencing such a torrential storm of mana and reflecting it back.</p><br/><p>Loretta reached her hand out. Immediately, the gate to Fairy Garden appeared. I thought one needed the key Loretta gave me before to enter Fairy Garden, but seeing Loretta and Fairy Garden’s other members, it seemed they could enter and leave Fairy Garden freely.</p><br/><p>Most likely, the key was only needed by an outsider like me.</p><br/><p>Loretta gestured at me.</p><br/><p>“Come, let’s take a lesson. … With Shin-nim’s current mana, ‘that’ might be possible.”</p><br/><p>“Alright, fine.”</p><br/><p>I knew what she was talking about. Dimensional Travel! Since she was going this far, there was no reason for me to refuse. With a bitter smile, I grabbed Loretta’s hand. She made a satisfied smile and stepped into the gate. In the next moment, I found myself in front of Loretta’s log cabin.</p><br/><p>I let out a deep sigh. Since I was the one who wanted this, I had no plans to go back.</p><br/><p>“But Loretta, how long do I need to rest for?”</p><br/><p>“Not too long. A month or two should be enough!”</p><br/><p>“… Hah?”</p><br/><p>I rebutted. Loretta laughed, and I did too. I asked.</p><br/><p>“You’re kidding, right?”</p><br/><p>“Should we start?”</p><br/><p>It seemed she wasn’t. I attempted to back away, but Loretta grabbed my arm at lightning speed. It was still too early for me to be a match for her strength.</p><br/><p>“You’re only teaching Dimensional Travel, right?”</p><br/><p>“Of course, Shin-nim! Of course!”</p><br/><p>“Why did you say that twice!?”</p><br/><p>There was no point in resisting any further. The door to the log cabin opened, then closed.</p><br/><p>Only after two full months later did Loretta give me the okay to climb the dungeon.</p><br/><p>“It’s perfect now. How is it, Shin-nim?”</p><br/><p>“I think I understand Dimensional Travel better now.”</p><br/><p>“Geez, not that! Though, that’s amazing too!”</p><br/><p>I had Petasos, a cheat ability that tripled the speed of my thoughts. Without this ability, it would have taken longer to establish the foundation for Dimensional Travel. Of course, this wasn’t the only thing Loretta was talking about. She was also talking about the immense energy filling me up.</p><br/><p>“Now, I can call everything mine, except Steel.”</p><br/><p>“It’s already unbelievable that you managed to perfectly control such a huge energy in such a short time. Anyone else would have taken at least 20 years. Shin-nim’s talent isn’t just extraordinary anymore, it’s freaky.”</p><br/><p>I simply smiled at what Loretta said. Things that came easily to me were hard for others to do. But that wasn’t anything uncommon. There were many that I couldn’t do that others could do easily.</p><br/><p>In the past, I didn’t understand why that was the case, but since this was just how I was born, I had no plans to throw my weight around and act superior. But of course, that didn’t mean I would allow the opposite to happen. I simply thought I was lucky to have been born with the potential to get stronger.</p><br/><p>“I’m leaving then. I have to take care of some things and climb the dungeon.”</p><br/><p>“Yes, have a safe trip.”</p><br/><p>With that, Loretta pushed her lips towards me. I honed myself during the past two months, but I still couldn’t do anything against Loretta’s charm. It was simply too strong for me to reject.</p><br/><p>As soon as Loretta let me go, I returned to the guild house and found Father drinking alone.</p><br/><p>“It sure is hard to see my son’s face. Did you visit another world again?”</p><br/><p>“I told you, I had to spend some time to clean up the energy within me. I learned something new too. Come to think of it, didn’t I come visit from time to time? It’s not like I was imprisoned.”</p><br/><p>“You change so much each time that it feels like it’s been a while.”</p><br/><p>I smiled and scanned the room. As expected, there was no one else.</p><br/><p>“Where’s Walker? Doesn’t he usually drink with you?”</p><br/><p>“He’s in the First Dungeon now. He’s been working himself tirelessly recently to climb even a single floor more. With Sophie, of course.”</p><br/><p>“Kuk.”</p><br/><p>What Father said made me realize how much time had passed. Although I came to visit once every few days, I didn’t have the time to meet with each guild member. I see, now that Walker was in the First Dungeon, Revival’s members were now all climbing the First Dungeon.</p><br/><p>Wait. Then why was Father drinking here alone?</p><br/><p>When I gave Father a curious look, he let out a hearty laugh and closed his mouth. I asked with a grin.</p><br/><p>“You died?”</p><br/><p>“You shouldn’t poke your father’s weakness like that, Son.”</p><br/><p>“I should when I can.”</p><br/><p>“It seems I thought you well.’</p><br/><p>“I learned from the best.”</p><br/><p>As I replied to Father, I sat down across him and handed him an empty cup. He then made a pleased smile and filled the cup.</p><br/><p>“You died too?”</p><br/><p>“You know I can’t go around dying now.”</p><br/><p>“Then did you suddenly learn to take things slower? You’re always in a rush.”</p><br/><p>“There’s a good reason I’m in a rush… It’s not like I can ask someone else to do my job.”</p><br/><p>Father didn’t say anything. Although Father had also gotten stronger in the past two months, the two of us were now too far apart in strength to even compare. Father put down his drink with a bitter smile.</p><br/><p>“I’m sorry to hear that. I wanted to always stand by your side as a reliable father, but what I can do? I just have too good of a son.”</p><br/><p>“It’s fine, Father. We don’t have much time left anyways. I can handle it.”</p><br/><p>With that, I emptied my cup. Was what I said unexpected? Father also took a sip with a bitter look.</p><br/><p>“… My son’s going too far, too fast. I wanted to raise him strong, but I didn’t want to raise him an old man.”</p><br/><p>I smacked my lips. I didn’t expect to get such a reaction just by saying I’ll fulfill my responsibility. Since I didn’t know what to say, I stayed silent. Father also seemed to felt awkward, as he scratched his head and filled my cup back up.</p><br/><p>“Why don’t we have a spar after this. Your father’s gotten stronger recently, so it should be helpful.”</p><br/><p>“Of course, Father. Ah, by the way, where’s Paul?”</p><br/><p>“He’s spending all his time doing the training regime you assigned him. Do you want to see him?”</p><br/><p>“Yes. I need to pass him the rest of his power. A Hero shouldn’t be away from his world for too long.”</p><br/><p>When I thought about Paul, my body shot up automatically.</p><br/><p>“I’ll have another drink here alone.”</p><br/><p>“Call Sumire too.”</p><br/><p>“Got it.”</p><br/><p>I immediately looked for Paul. Like Father said, he was fully concentrated in his training without even thinking to climb the dungeon.</p><br/><p>“I thought you forgot!”</p><br/><p>“I did, once. Has it been a week?”</p><br/><p>“You…”</p><br/><p>I blocked Paul’s shield and calmed him down.</p><br/><p>“Sorry for being late. It took a while to settle everything.”</p><br/><p>“Mm… No, it’s more important that you train yourself. I can’t really complain..”</p><br/><p>As expected, Paul quickly understood my position. If anything, his character was great.</p><br/><p>“I didn’t just play around. I can give you the rest of your power now.”</p><br/><p>“Rest? Isn’t there over a half of it left?”</p><br/><p>“Yeah. Come here.”</p><br/><p>Paul approached me half in doubt and slowly sat down with his back towards me. I placed my hand on his back and pushed the rest of Edias continent’s power into him. Paul flinched, and soon became immersed in properly receiving the energy. Without being able to speak a word, he struggled to control the energy I passed him. I stood by his side and prevented Edias continent’s energy from going berserk by injecting him with my massive mana.</p><br/><p>An unknown amount of time later, Paul opened his eyes in shock.</p><br/><p>“This is what it feels to be a Hero? … It doesn’t feel like anything changed at all.”</p><br/><p>“You’ll feel it soon. Your shoulders will start getting heavy.”</p><br/><p>“… What about you? Isn’t it heavy?”</p><br/><p>“If it was, I would throw it away. That’s just how I am.”</p><br/><p>“So you’re saying you don’t feel burdened at all now?”</p><br/><p>“No, but to do what I want to do, I have to protect Earth first. So my responsibility as a Hero doesn’t burden me at all.”</p><br/><p>With that, I stayed silent for a moment. Then, I told Paul.</p><br/><p>“Go back to Edias now. You have something to do there.”</p><br/><p>“… Yeah.”</p><br/><p>Paul answered after a moment of silence. Now, Paul’s connection with Earth was gone. He wasn’t from Earth, and the Edias continent was still warring with its invaders.</p><br/><p>Plus, Edias continent also had the Peruta Mountain Range. Or was that different?</p><br/><p>Suddenly, Paul began to roll his feet.</p><br/><p>“I can’t… Let me join you too.”</p><br/><p>“Don’t be crazy and go back to Edias. You have a job to do there.”</p><br/><p>“It’s fine, it’s not like I’ll be fighting the Demon Lord here. I won’t be in danger. And with my power, I can help protect Earth from other monsters.”</p><br/><p>“Like I said, don’t be crazy and go back. What if you die?”</p><br/><p>“I have to protect Edias with my own power alone. If I die here, I would have had no hope in Edias anyways!”</p><br/><p>I smiled.</p><br/><p>“Paul, go back.”</p><br/><p>“Kang Shin! I’m not someone who doesn’t know how to pay back his debt!”</p><br/><p>“No, Paul. Go back.”</p><br/><p>I turned around and continued.</p><br/><p>“Like I said, there’s something you need to do there.”</p><br/><p>Paul widened his eyes. I shrugged and smiled.</p><br/><p>Anyone who saw it would agree that it was a terrifyingly evil smile.</p><br/>\n</div>"}