{"title": "Chapter 326. With Your Own Power (6)", "id": 326, "volume": 4, "url": "http://boxnovel.org/infinite-competitive-dungeon-society-chapter-326-with-your-own-power-6", "volume_title": "Volume 4", "body": "<h1>Chapter 326. With Your Own Power (6)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Paul went back to Edias immediately. As he had gotten stronger while toiling with Revival’s members, I knew he would do just fine.</p><br/><p>After sending Paul off, I went down to the training room. As expected, Father and Sumire were sparring. I waited until their spar ended to reveal my presence.</p><br/><p>Sumire stabbed her spear into the ground and leaned against it to catch her breath. When she saw me, she jumped up in surprise.</p><br/><p>“S-Shin-nim! You were here!?”</p><br/><p>“Yeah. You sure are improving fast. I’m happy to see you’re trying hard.”</p><br/><p>“Hehehe.”</p><br/><p>While embarrassed, Sumire couldn’t hide her happiness. But Father, who was standing next to her, clicked his tongue.</p><br/><p>“That’s no way to woo a woman. Instead of exchanging your spears, you should take her out for tea or something.”</p><br/><p>“Sumire’s my disciple…”</p><br/><p>I retorted back at his nonsense, as I immediately went up to spar with Father. Leaving mana and skills aside, we fought purely with our physical strength and spear technique. As Father was also high up in the dungeon, his physical strength was suitably great. As he was the one who taught me spearmanship, his spear technique didn’t need to be explained either.</p><br/><p>But of course, I was now much stronger than him.</p><br/><p>“Monster… I gave birth to a monster.”</p><br/><p>“You didn’t give birth to anyone, Father. It was Mother.”</p><br/><p>Although we only sparred for a short five minutes, Father fell to the ground covered in sweat. I then turned towards Sumire, whose eyes were sparkling with excitement.</p><br/><p>“Alright, let’s see how much you improved.”</p><br/><p>“Yes, Shin-nim!”</p><br/><p>As Sumire’s style was different than Father’s, sparring with her was more fun. Attacking with her spear and defending with her shield. However, her offense and defense weren’t limited to these obvious methods. If the chance arrived, she freely attacked with her shield and defended with her spear.</p><br/><p>Her shield technique was in a realm I couldn’t offer any advice on, and she was firmly establishing her one-handed spear technique style. Thankfully, I could still help her in this aspect, and I helped her fix several problems throughout our spar.</p><br/><p>“Thank you for this match! Shin-nim really is amazing!”</p><br/><p>“Why didn’t you say that to me?”</p><br/><p>“Ah, Second Master is amazing too!”</p><br/><p>“Thanks… So Son, when are you going to the dungeon?”</p><br/><p>“After swinging my spear a couple times, and if possible, after seeing Hwaya and Ina. I’m planning on clearing Beyond’s 39th floor, First Dungeon’s 90th floor, and Beyond’s 40th floor in one go.”</p><br/><p>Father nodded, then spoke firmly.</p><br/><p>“My new daughter has been busy with Ciara recently. You should go to Earth if you can.”</p><br/><p>“… Got it.”</p><br/><p>When I gave Sumire a glance, she nodded without hesitation.</p><br/><p>“It seems Unni is trying to predict the next wave of Event Dungeons.”</p><br/><p>“Ah.”</p><br/><p>Indeed, that was one of the most important tasks. I wanted to head to Earth immediately, but because what I said about swinging my spear a couple times made Sumire look at me with eyes full of expectation, I had to carry it out with a bitter smile. It was the purely physical technique that I had gotten fairly used to by now.</p><br/><p>Of course, if I really concentrated all of my power, the guild house would crumble, so I had to hold back.</p><br/><p>Sumire began to call me Takemikazuchi and seemed ready to ask me to show it one more time until the end of the night. Thankfully, I managed to get away from her and return to Earth after showing her a few more times.</p><br/><p>When I entered the guild house on Earth, I heard a clacking sound in the kitchen and a smelled a sweet aroma. When I entered the kitchen thinking someone else other than Hwaya and Ciara was here, I found a rather unexpected sight.</p><br/><p>“Ina, don’t eat that yet.”</p><br/><p>“Are we waiting for Daddy?”</p><br/><p>“We’re going to put it on the cake. Wash it clean and chop it. You can do it, right?”</p><br/><p>“Un!”</p><br/><p>Hwaya was moving around busily in an apron. The source of the sweet aroma was a cake batter full of sugar, which Hwaya was swirling.</p><br/><p>I rubbed my eyes.</p><br/><p>“Mommy, when is Daddy coming?”</p><br/><p>“Sumire said she’d hold him back. If we fail, we have to make it again, so hopefully Sumire will do a good job…”</p><br/><p>“Does Daddy like cakes?”</p><br/><p>“Shin eats everything. Apparently, he likes sweet things the most. Yungoong Ajusshi… Father said so, so it must be true.”</p><br/><p>Hwaya had an extremely bright expression. She looked especially cute when she smiled.</p><br/><p>“Huhu, I’ll show him I can do it too! Since it’ll be a joint attack with Ina, he won’t be able to withstand it.”</p><br/><p>“Ina’s attacking Daddy with Mommy?”</p><br/><p>“We’re going to attack his heart with this cake. Ina likes it too when Father’s happy, right?”</p><br/><p>“Un!”</p><br/><p>“Ah, don’t cut grape seeds! How did you even cut it!?”</p><br/><p>“I froze it and split it in half. I’m good, right?”</p><br/><p>After watching until this part, I silently left. The past me might have barged in to see Hwaya’s flustered face, but now, the first thing I thought of was to let myself be surprised. But will I be able to act naturally? That was the only thing in my mind.</p><br/><p>“Well, looks like I’ll have to take Hwaya failing into account and go to the dungeon.”</p><br/><p>I could also feel Ciara’s presence in the guild house. Sumire probably wasn’t lying when she said Ciara was trying to predict the next wave of dungeons. Once I came back, I would be able to hear about the result.</p><br/><p>Humming happily, I headed to the dungeon. Even while breaking through Beyond’s 39th floor filled with Death Knights and Vampire Lords, I couldn’t be more light-hearted.</p><br/><p>[A challenger.]</p><br/><p>[A challenger really appeared.]</p><br/><p>Past a certain point, monsters in Beyond were all shocked when they saw me. It wasn’t because I was strong, it was just because I made it here.</p><br/><p>[He’s trying to go higher.]</p><br/><p>[Envy is driving me on. Let’s make that man kneel down in despair.]</p><br/><p>[Our swords hold our resentment from being left without a choice. Are you strong enough to accept them?]</p><br/><p>“Stop being so noisy and just come.”</p><br/><p>I pointed my spear towards them and ignited chaos flames on its tip. Beyond was long. If I walked through it as though it was a park, I would need several days to go through it. I had to use Divine Speed constantly to break through in a day.</p><br/><p>“You guys can’t give me what I want anymore.”</p><br/><p>[This magic power…!]</p><br/><p>[H-How can a human possess such an overwhelming magic power!]</p><br/><p>I kicked off the ground. Chaos flames rose up after sucking in my magic power and shot towards the Vampire Lords and Death Knights. Chaos flames scorched everything it touched. Although a few lucky Death Knights managed to dodge the flames, when they tried to attack me with their swords carrying death aura, Steel simply sucked in their auras.</p><br/><p>[What!?]</p><br/><p>“Thanks for the death energy.”</p><br/><p>The powers I had all worked well together. Absolute Soul and Crimson Hell’s power, and now Steel’s Extort. They stole mana from anything and anyone that attacked me and made it mine in the blink of an eye.</p><br/><p>“You can have it back.”</p><br/><p>[Back? Kuaaaaaak!]</p><br/><p>Without integrating the absorbed mana, I directed it to my spear and stuck it inside the monsters in front of me. Attacking all enemies with fast consecutive stabs, it was Lightning Spear Storm.</p><br/><p>As expected of monsters in Beyond’s 39th floor, the Death Knights and Vampire Lords had high magic power and defense. However, there simply wasn’t anything they could do against me. Any monster that appeared in front of me turned into particles of light and disappeared thereafter.</p><br/><p>[You dare insult the knights who rule over death!? I will show you the true power of death!]</p><br/><p>“Please, go ahead!”</p><br/><p>Death Knights began to form a magic circle using their death energy.</p><br/><p>[Come, Swords of Death!]</p><br/><p>“Lame!”</p><br/><p>Though that was what I said, the swords they summoned were quite good. It seemed they had to consume their death energy permanently to make them, but they attacked their enemy without having to be held by the Death Knights.</p><br/><p>As there were many Death Knights, the number of swords flying around numbered several hundred! As they also used their special skill, Death Collection, I couldn’t tell whether these guys were knights or sword collectors!</p><br/><p>“But that’s still nowhere close to being enough! Show me more! Don’t tell me this is all you can do with death energy?”</p><br/><p>[Kuaaaaa, fine, we will!]</p><br/><p>When I mocked the Death Knights’ power, they became enraged and began to pour one black magic after the other.</p><br/><p>[Curse of Death!]</p><br/><p>[Curse of Madness!]</p><br/><p>[Curse of Pestilence!]</p><br/><p>As expected of death energy, it could form many different kinds of curses. I looked intently at the magic circles they drew and asked.</p><br/><p>“Any other curses?”</p><br/><p>[How can you be fine after taking all these curses!?]</p><br/><p>A Death Knight asked in shock. I nodded and replied.</p><br/><p>“That’s because I’m immune to curses.”</p><br/><p>[Bastard!]</p><br/><p>“Well, that was a good lesson. Thanks!”</p><br/><p>When dense death energy flowed into my spear, the Death Knights flinched and stepped backwards. Using my spear, I drew a giant magic circle in the air.</p><br/><p>[No way…!]</p><br/><p>“Yes way.”</p><br/><p>[He can wield death energy!]</p><br/><p>From the black magic circle I drew, many greatswords began to pop out. Although the Death Knights lacked the death energy to summon more than a couple swords at once, I was different. I possessed so much death energy that I had to compress it multiple times.</p><br/><p>As I was generous with the death energy I used, several hundred greatswords popped out of the magic circle and hovered above the air. I then added Dortu’s power into the swords. Be it Death Knights or Vampire Lords, they couldn’t shut their mouths watching this scene.</p><br/><p>[This… crazy…!]</p><br/><p>[Didn’t you guys teach him!?]</p><br/><p>[Shut it, you annoying mosquitos!]</p><br/><p>In the end, they began to fight among themselves. I leisurely shot my greatswords at them with a smile.</p><br/><p>“Now, now, if you have anything else you haven’t shown, please do so now!”</p><br/><p>Two hours afterwards, after learning all the ways that Death Knights used death energy in, I freed them for eternity. I then left Beyond’s 39th floor. It was now time to eat cake!</p><br/>\n</div>"}