{"title": "Chapter 332. Final Wave (2)", "id": 332, "volume": 4, "url": "http://boxnovel.org/infinite-competitive-dungeon-society-chapter-332-final-wave-2", "volume_title": "Volume 4", "body": "<h1>Chapter 332. Final Wave (2)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>When I climbed up to the 91st floor, I was met with an open world. The sky was high and blue and a vast sea was before my eyes. Under my feet were white sands.</p><br/><p>“Did I come to the wrong place?”</p><br/><p>I couldn’t be blamed for thinking this. Suspecting that I was under an illusion, I raised my mana, but nothing changed. Even a god would find it difficult to trick me. That could only mean that the scene before me was real.</p><br/><p>When I turned around, I saw an unnaturally placed stairway that proved that this was the 91st floor. I had arrived beyond the 90th floor, which few people have ever seen.</p><br/><p>“I don’t know what this means but I’ll know once I start walking.”</p><br/><p>After preparing myself to deal with whatever might come my way, I shouted.</p><br/><p>“Commence exploration!”</p><br/><p>Plump! The moment my voice thundered out, I heard the sound of something falling in the sea. The sound didn’t end with just the one time. Almost as if someone was throwing giant boulders into the sea, the sound rang out continuously.</p><br/><p>“What’s going on in the sea…?”</p><br/><p>Curious, I turned towards the sea, then met a building-sized leg filled with suction cups rising up from the water. If the leg was that big, how big was its head?</p><br/><p>“… You’re kidding, right?”</p><br/><p>I murmured with a frown.</p><br/><p>[No.]</p><br/><p>Though unnecessary, Sherafina quickly replied. I cursed inwardly and was about to step forward when I realized that I was sinking down.</p><br/><p>When I turned around, the sand behind me was falling as though a hole had opened up in the middle of the beach. From the pit, a giant monster with thousands of tentacles peeked its head out!</p><br/><p>“An antlion!”</p><br/><p>The tentacles simultaneously hurled towards me. Not only was this antlion making me slide down to its pit, but it was also attacking me with its tentacles! It was truly the final form of antlion evolution!</p><br/><p>The sand had a suction power as though the sands themselves carried mana, and the tentacles were flying about everywhere. Any other explorers might have been in grave danger, but unfortunately for the antlion, I had few methods I could use to fly.</p><br/><p>First, I summoned Sharana and infused her inside me before soaring up to the sky. Then, I summoned Dortu.</p><br/><p>[I am Dortu. Creating bombs.]</p><br/><p>Immediately after Dortu relayed his intention, several explosions erupted from the antlion’s pit. Thankfully, I was continuing up into the sky. Otherwise, the giant explosions might have affected me too!</p><br/><p>Amidst the explosions, the antlion’s body revealed itself. Just like I thought, the antlion was incredibly big that it was hard to find the right words to describe it. From what seemed to be its mouth hole, the antlion created few spherical mana balls and shot them towards me.</p><br/><p>“Hmph!”</p><br/><p>No matter how large it was or how much mana it carried, in the end, it was a low-class organism that couldn’t wield mana at my level. As a human, I had to teach this insect where it belonged.</p><br/><p>I reached out to the air. A platinum spear popped out of nowhere, and I drew a trajectory that pierced all of the mana spheres the antlion shot. Then, I drew up the power of the Lightning God. In an instant, the spear crackled with sparks, and I compressed the lightning into one point. Once enough energy came together, I shot the lightning without a moment of delay.</p><br/><p>“It really does go well with lightning.”</p><br/><p>At first, I was unsatisfied with it evolving into an unknown spear, but if Chaotic Spear was troublesome because it had too strong of an individuality, this spear matched me well as though it was made for me.</p><br/><p>Even just now when I shot out lightning or concentrated my energy, it was easy and simple as though there was another me helping. Its ability to amplify lightning energy was especially noteworthy. Even without mana, just having this spear would let me shoot lightning any time I wanted.</p><br/><p>The bolt of lightning that dropped from the sky tore through the antlion’s mana balls. From afar, the lightning bolt would look like a skewer. Without missing this opportunity, I used Steel’s power through the lightning I shot out and made the mana balls mine.</p><br/><p>“Haap!”</p><br/><p>The moment I raised my arm, the bolt of lightning transformed into a whip and flew up along with my arm’s movement. The skewered mana balls rolled towards the end and formed a single sphere. Eventually, it was as though I was swinging around a flail connected by chains.</p><br/><p>[Guooooooo!]</p><br/><p>The antlion bellowed. Though I was now certain that it wasn’t an actual antlion, that didn’t matter much.</p><br/><p>I raised the flail and struck down at it. With a thundering crack, it tore through the antlion’s giant jaws and broke down parts of its carapace. Then, lightning poured into the antlion’s body, making it convulse.</p><br/><p>“Die!”</p><br/><p>I swung the flail continuously without stop. Because of the sheer size of the creature, just one or two whips wasn’t enough to end it, but when I repeatedly struck its injuries with the mana ball, the antlion finally became silent.</p><br/><p>[I am Dortu. Finishing the job.]</p><br/><p>In an instant, Dortu transformed the grains of sand into bombs. When they exploded, the flesh revealed underneath the carapace I broke shot up into the air. A disgusting bodily fluid erupted like a volcano before the twitching body of the antlion disappeared into particles of light.</p><br/><p>After confirming that the antlion died, I raised my head and looked around.</p><br/><p>“I think I know what the concept of the 91st floor is…”</p><br/><p>On the ground, I could see more antlion-like heads peeking out, and at sea, I could see the roiling tentacles of an octopus confirming that what I saw before was right. In that case, there had to be something in the sky as well.</p><br/><p>Found it.</p><br/><p>Not one, but more than ten dragons were circling around each other. Each of them was at least a hundred times bigger than Lotte. It seemed they noticed my existence, as a few of them turned to glare my way.</p><br/><p>[Gruoooooooooo!]</p><br/><p>Their roars caused the earth to shake. For a moment, I couldn’t help but think I was better off jumping into the sea and fighting the building-sized tentacles than fighting those monstrosities. </p><br/><p>However, I had already provoked those dragons to the fullest. With a deep sigh, I kicked off the air.</p><br/><p>“Alright, come at me, you damned lizards!”</p><br/><p>Along with a spirited shout, I swung my spear. Then, I saw the lightning flail from before shoot up from the ground along the trajectory I drew. I immediately tilted my head.</p><br/><p>“Why is it still here?”</p><br/><p>Of course, Loretta had already taught me how to solidify and control the mana I shot out. Just like how I easily killed the antlion just now, this technique was convenient and perfect for anyone who hated wasting mana.</p><br/><p>The only downside was that it was hard to maintain for more than a few minutes.</p><br/><p>That was the reason for my surprise.</p><br/><p>[Gruooooooo!]</p><br/><p>The dragon that was closest to me breathed out fire. I hurriedly swung my spear, and the giant ball of mana at the head of the lightning flail received the dragon’s breath. As it was connected to me by my spear, Steel could convert the dragon’s flames into the ball of mana.</p><br/><p>Then, the power stayed without dissipating.</p><br/><p>“I get it…”</p><br/><p>I murmured in a daze and looked down. The platinum spear was still shining mystically. Clearly, this spear had the ability to preserve and even amplify the power I imbued into the spear.</p><br/><p>When the spear evolved, I immediately asked Dortu to analyze it, but all he could tell me was that it was a metal of a form that couldn’t exist. Now, I understood what he meant. If there was another spear like it, that would be a disaster.</p><br/><p>“Well then, let’s test it out a bit.”</p><br/><p>It was possible that the spear had abilities I didn’t know about. First, I pulled the ball of mana, which had absorbed all of the dragon’s flames, back before thrusting it forward fiercely. Enraged by the fact that I was unfazed by its flame, the dragon was charging towards me when it was hit by the ball of mana and sent flying back.</p><br/><p>“Haha, I’m not very skilled at using flails! So I’ll show you what I am skilled in!”</p><br/><p>I tensed up my arms and poured all the lightning and mana I could wield into the spear. The ball of mana hanging at the head of the lightning flail slowly melted down into lightning, and the flail transformed into a single thick and long lightning bolt. Its width had room to grow, but its length had now reached the height of a skyscraper. Immediately, I held and swung this giant spear.</p><br/><p>“Now get over here!”</p><br/><p>[Gruoooooo!]</p><br/><p>The roars of the dragons resounded through the sky. As if to harmonize with the dragons’ roars, the monsters at sea howled.</p><br/><p>The monsters I had to face on the 91st floor were these massive creatures! Each of their strengths didn’t lose to any of the monsters I’ve fought in the past. In that case, I had to play at their level!</p><br/><p>“It’s a super-sized Elemental Tempest just for you! Here!”</p><br/><p>On the thick and long spear blade made of lightning, a countless number of elementals gathered together. A number of elementals I had never wielded before responded to my call and joined the storm brewing around my spear.</p><br/><p>[Whoo, call all your friends! There’s more than enough room today!] </p><br/><p>[Yay, I can finally join Prince-nim’s ride!] </p><br/><p>[It’s Peika-nim.] </p><br/><p>[Stupid, don’t say the name!]</p><br/><p>Feeling their impending doom, the dragons breathed out fire once again as they charged towards me. I immediately called Dortu.</p><br/><p>“Dortu, block those however you want and send them towards Elemental Tempest’s path!”</p><br/><p>[I am Dortu. Accepting Master’s unreasonable demand.]</p><br/><p>The dragons couldn’t break the metallic barrier Dortu created. That was enough. Holding the several dozen meters long spear of lightning that had become a huge storm, I thrust it forward.</p><br/><p>“ELEMENTAL TEMPEST!!!”</p><br/><p>In a single moment, close to a million mana exploded. The monsters glaring at me, the monsters running away from me, and the monsters eager to break through Dortu’s barrier were all swept away by the storm of elementals. Seeing all those dragons disappearing at once was truly a refreshing sight.</p><br/><p>[Kuaaaaaaaaaa!]</p><br/><p>[Kiiiiiiii!]</p><br/><p>However, many monsters still remained, both on the ground and in the sea. I looked around the endless sky. In the far distance, beyond the point Elemental Tempest could have reached, I confirmed the existence of more flying monsters. Immediately, I asked Sherafina.</p><br/><p>“Sherafina… Just how big is this place?”</p><br/><p>[It is three times the size of Earth.]</p><br/><p>I was given a mission to destroy an entire world of monster</p><br/>\n</div>"}