{"title": "Chapter 347. The End (1)", "id": 347, "volume": 4, "url": "http://boxnovel.org/infinite-competitive-dungeon-society-chapter-347-the-end-1", "volume_title": "Volume 4", "body": "<h1>Chapter 347. The End (1)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Immediately, blood burst out from the Demon Lord’s body.</p><br/><p>[Kuhak!]</p><br/><p>The demonic energy he was emitting was cut in half, flowing smoothly into my body. Twirling dthe demonic energy around my hand, I laughed.</p><br/><p>“How is it, Demon Lord? Is your heart beating?”</p><br/><p>[Kuuuk!]</p><br/><p>In truth, I had never planned to use Lilith’s Temptation on the Demon Lord. He was one of the most powerful among all worlds’ enemies. He was already strong when he had the dungeon’s power, but he got even stronger when he cast it aside.</p><br/><p>At the same time, the possibility of Lilith’s Temptation working kept increasing. Countless injuries from the prolonged fight made him weary, and most importantly, the curse from his subordinate demon lowered his charm to the point I could influence him with my own.</p><br/><p>It was only possible because I learned to quantify a target’s abilities in my fight with the dragon.</p><br/><p>I could double the power of my charm against someone of the opposite sex, and after I absorbed the dragon’s power, I learned to change my appearance without having to borrow a god’s power. With the right conditions laid out, there was no need for me to hesitate.</p><br/><p>Licorice asked in shock.</p><br/><p>“Didn’t Zeus’ power disappear!? How?”</p><br/><p>“This is my ability. Zeus isn’t the only one who can transform into whatever he wants.”</p><br/><p>For example, the dragon I fought could change his appearance too. As I had the dragon’s power and had Zeus’ power until just recently, it wasn’t hard for me to transform into a woman.</p><br/><p>[Kuhuk, this… this is the dungeon’s power!?]</p><br/><p>“It’s the power of my pocket watch and charm.”</p><br/><p>Skills stored in the Collector’s Pocket Watch could be used even when the dungeon’s power was restricted. Although they didn’t work against Lespina, that wasn’t because the pocket watch was the dungeon’s power, but rather…</p><br/><p>“Anyways, what’s important is that this fight is over.”</p><br/><p>With a grin, I held my spear up. Then, I frowned. My arm had gotten caught.</p><br/><p>“These are so cumbersome. How do girls fight with these things?”</p><br/><p>“Dear Husband… Most people’s aren’t that big!”</p><br/><p>“…”</p><br/><p>Was Kain disappointed? For some reason, he turned away without a word. I snorted.</p><br/><p>“You should be ready to do anything to win! It might be embarrassing, but isn’t it better than losing your comrade because you were holding back!?”</p><br/><p>“… Indeed, how you win is none of my business.”</p><br/><p>Kain murmured. Then, the Demon Lord shouted as he staggered up.</p><br/><p>[My, my demonic energy… my demonic energy will devour you!]</p><br/><p>“Sorry, but that won’t happen.”</p><br/><p>The demonic energy twirling around my hand streamed into my body along Peruta Circuit’s flow and smoothly mixed with other mana. Not only was my mana replenished, but my mana pool also continued to grow to an unprecedented level.</p><br/><p>[How can you use demonic energy so easily…!?]</p><br/><p>“What nonsense are you blabbering? Demonic energy is mana too.”</p><br/><p>Seeing Licorice shake her head from the side, it seemed that wasn’t completely true, but it didn’t matter since it didn’t make a difference for me. I pointed my spear towards the half-dead Demon Lord. The aura coursing into the spear became compressed to the limit.</p><br/><p>[I see, your true ability… So that’s why all worlds…!]</p><br/><p>“Are those your last words?”</p><br/><p>[Hmph, I can still… Kuk!]</p><br/><p>The moment demonic energy rose up from his body, I reached my free hand towards the Demon Lord. Grabbing him by the neck, I strangled him to prevent him from escaping. It wasn’t just a physical restraint, but an absolute restraint that used Enigma.</p><br/><p>“I won’t let you escape.”</p><br/><p>[I, I… am someone who will become the ruler of all worlds…!]</p><br/><p>No matter how strong he could become, he stood no chance after Lilith’s Temptation and additionally effects cut his power to a fourth. He attempted an attack by throwing the remaining demonic energy he had, but I simply took his attack with my body with a smile. At this point, I didn’t feel a thing from such meager demonic energy.</p><br/><p>Then, I cut him in half with the spear in my hand.</p><br/><p>While his body was powerful, it was tattered by Kain’s divine spear, fighter jets’ explosions, and Lilith’s Temptation. It simply couldn’t withstand my spear which was strengthened to the limit by Enigma.</p><br/><p>[Kuaaaaaaak!]</p><br/><p>As expected of the Demon Lord, he didn’t die simply by having his body cut in half. Hearing his bloodcurdling shriek, I stuffed my spear back into my extradimensional space, then grabbed the two halves of his body in each of my hands.</p><br/><p>“Like I said, I won’t let you escape.”</p><br/><p>[Kuk…!]</p><br/><p>I drew my power up. It didn’t matter whether the power was Extort, Crimson Hell, or Absolute Soul. It wasn’t necessary to distinguish them when they shared a common purpose. All I needed was for them to carry out my will.</p><br/><p>[Ku, kuuuuuuuuua!]</p><br/><p>“Whew… Looks like this will be the final test.”</p><br/><p>[Kuaaaaa!]</p><br/><p>The Demon Lord’s severed halves seemed to be shriveling up. Soon, they began to scatter away as particles. After letting out a sigh, I roused Peruta Circuit and collected the particles together onto my hand.</p><br/><p>“Stop trying to run, will you?”</p><br/><p>[…]</p><br/><p>The black particles glowed as if to respond to my words, but that was it. Immediately afterwards, I absorbed all of the particles. The last handful of demonic energy and the power of the Luka continent rushed into me.</p><br/><p>“Good, now it’s over.”</p><br/><p>Feeling the Demon Lord’s energy fusing into my body, I stretched in satisfaction. The moment I felt the numerous attributes and energies in my body merge into one, I became certain that I had obtained something special.</p><br/><p>Immediately, I suspected that this was what Sherafina wanted.</p><br/><p>“D-Dear Husband.”</p><br/><p>“Hm? What?”</p><br/><p>When I turned towards Licorice, she flung her body at me at full speed.</p><br/><p>“Whoa, what!?”</p><br/><p>When I received her in shock, Licorice rubbed her face on my chest and shouted.</p><br/><p>“Dear Husband, I think it’s fine if you stay that way!”</p><br/><p>“Stay? Ah, I’m still a woman!”</p><br/><p>“I’m okay as long as it’s Dear Husband! Kiss, do you want to kiss?”</p><br/><p>“I’m not okay!”</p><br/><p>I quickly transformed back. Licorice got off as she made a noticeably disappointed expression.</p><br/><p>“What a shame…”</p><br/><p>“I only transformed to take down the Demon Lord.”</p><br/><p>I smacked her head.</p><br/><p>“Kain, it’s over. Let’s go take care of the monsters on Earth.”</p><br/><p>“…”</p><br/><p>“Kain?”</p><br/><p>Kain didn’t speak. When I called his name a few times, he finally looked back at me and spoke.</p><br/><p>“My world’s power disappeared.”</p><br/><p>At that moment, Sherafina’s voice rang out.</p><br/><p>[‘Kain Zerahard’ Grand Raid commences! You encountered one of the enemies aiming for the world’s power! The dungeon’s power is not fully effective against worlds’ enemies. The Grand Raid system exists to give what little support it can to explorers who are fighting against the worlds’ enemies. The enemy can ignore up to 5% of you and your party members’ skills and levels!]</p><br/><p>[‘Daisy Ectradion’ Grand Raid commences! You encountered one of the enemies aiming for the world’s power! The dungeon’s power is not fully effective against worlds’ enemies. The Grand Raid system exists to give what little support it can to explorers who are fighting against the worlds’ enemies. The enemy can ignore up to 5% of you and your party members’ skills and levels!]</p><br/><p>[‘Ren Verotude Goldion’ Grand Raid commences! You encountered one of the enemies aiming for the world’s power! The dungeon’s power is not fully effective against worlds’ enemies. The Grand Raid system exists to give what little support it can to explorers who are fighting against the worlds’ enemies. The enemy can ignore up to 5% of you and your party members’ skills and levels!]</p><br/><p>After hearing the messages, I exclaimed.</p><br/><p>“Wow.”</p><br/><p>Kain continued.</p><br/><p>“You should be feeling it, right? The worlds’ powers of all the Heroes on Earth are going towards you.”</p><br/><p>It was as he said. Before I noticed, three worlds’ powers were flowing into me. This feeling was similar to the increase in League I experienced when I leveled up in the dungeon. Kain seemed to have realized it too as he shouted in a hurry.</p><br/><p>“Kang Shin, hurry. Once the pathway opens, there is no turning back!”</p><br/><p>“Damn it, what a mess! I’m on it!”</p><br/><p>Sherafina finally made her move! I quickly twisted open the door to the dungeon. Pzzzt! After fixing the door rejecting me with Enigma’s power, I shouted at Kain.</p><br/><p>“Kain, you remember, right!? Do as we talked about before! That’s more important!”</p><br/><p>“I know. I obtained this god’s power just for that.”</p><br/><p>“God’s power? What god’s power?”</p><br/><p>I recalled back to my first encounter with Kain. I had heard Kain had Odin’s power, but the power I first felt from him was a different god’s power. I had noticed it because I had Zeus and Hermes’ power.</p><br/><p>“From now on, all explorers will gather in one place.”</p><br/><p>The moment I stepped into the dungeon, Kain activated the power he had been waiting to use. The biggest reason I took him into our guild was now in effect.</p><br/><p>“From now on, all members of Revival except Kang Shin will disappear from Earth.”</p><br/><p>“Dear Husband, at least explain what he’s are you doing before you go! … Thanks! Revival members, gather! Ignore the monsters you’re fighting and get over here!”</p><br/><p>Immediately after I shared my consciousness with the flustered Licorice, she flew about in a hurry to bring people together. In a way, it was quite cute. Still, I had to acknowledge its effectiveness, as more succubi and members of Revival showed up as she moved about.</p><br/><p>While most were confused as to what was going on, there was no time to explain things in detail. I already had my hands full with deflecting Sherafina’s power that began to pour over us.</p><br/><p>“Is everyone here!?”</p><br/><p>“Everyone’s here! Except Ciara!”</p><br/><p>“She’s not an explorer, so she should be fine!”</p><br/><p>Before the dungeon’s door closed, Kain shouted sonorously. The space around him already became his personal space that Sherafina couldn’t invade.</p><br/><p>“Kuneē!”</p><br/><p>The golden helmet of Hades, which had the power to hide from any entity, covered all members of Revival. Hwaya who caught a glimpse of me reached towards me, while I waved my hand at her.</p><br/><p>“I’ll be back soon, dear.”</p><br/><p>Then, I entered the dungeon.</p><br/><p>In this place, Loretta was nowhere to be seen.</p><br/>\n</div>"}