{"title": "Chapter 345. Demon Lord (8)", "id": 345, "volume": 4, "url": "http://boxnovel.org/infinite-competitive-dungeon-society-chapter-345-demon-lord-8", "volume_title": "Volume 4", "body": "<h1>Chapter 345. Demon Lord (8)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>“The power you’re using isn’t something you came up with by analyzing the dungeon’s power.”</p><br/><p>Because of the size of the Demon Lord’s body, I didn’t know where to aim my spear. For now, I aimed at his gigantic neck and spoke.</p><br/><p>“That’s just the dungeon’s power.”</p><br/><p>[…]</p><br/><p>The Demon Lord didn’t say anything. Or perhaps I couldn’t hear him.</p><br/><p>However, the dungeon was steadily creeping towards us to claim our lives. The earth shot up and the air froze. The river of blood I got rid of before reappeared. The fragments of the moon I destroyed with Shiva’s and Zeus’ power were falling as countless meteorites.</p><br/><p>[Do you expect me to believe you? That I am being controlled by her?]</p><br/><p>“I don’t see a reason you shouldn’t believe me.”</p><br/><p>[She controlled me and put the dungeon’s power into me without my knowledge?]</p><br/><p>“Yep.”</p><br/><p>[To claim you through me?]</p><br/><p>“I don’t know about that. Could be, or…”</p><br/><p>I thought back to the first time I became a dungeon explorer. At the time, I was just an ordinary yet not so ordinary boy.</p><br/><p>I climbed the dungeon and grew stronger through Sherafina’s help. And within a year, I was able to meet with her face to face.</p><br/><p>She was powerful beyond my imagination. She also favored me greatly. If she ever wanted something from me, she could have taken it whenever she wanted.</p><br/><p>If the person the Demon Lord was talking about was indeed Sherafina, things just didn’t add up. I couldn’t understand why she needed to take such a roundabout way.</p><br/><p>Except, if what she wanted couldn’t be obtained from my weak self and could have been obtained only when I had gotten strong to this point, then things made sense.</p><br/><p>I also had a guess as to what that was. An ability that no one else has. Not the ability to wield elementals, not Absolute Soul nor Peruta Circuit, but an ability that belonged only to me. An ability that I honed throughout all these years.</p><br/><p>An ability that I had yet to see the end of.</p><br/><p>If my thought was correct, even the Demon Lord could be a sacrifice for my growth. Of course, it was unlikely that the Demon Lord would believe me even if I told him.</p><br/><p>Putting these thoughts together, I asked the Demon Lord lightly.</p><br/><p>“What are you going to do?”</p><br/><p>[…. Haha, hahahahaha!]</p><br/><p>Suddenly, the Demon Lord burst into laughter. Because of how big he was, his laugh resonated through the entire dungeon and even injured our ears. Parts of the dungeon flying towards us suddenly halted in midair.</p><br/><p>[Good, now I understand. I’ll acknowledge that I was played by her!]</p><br/><p>The Demon Lord raised his hand, where crimson mana began to gather.</p><br/><p>[But both you and she are too arrogant! You shouldn’t have told me about this!]</p><br/><p>The Demon Lord shrunk slightly. On the other hand, the mana gathering on his palm became larger. I was very familiar with this mana. It was none other than the dungeon’s, Sherafina’s mana!</p><br/><p>[Now I know. I believed it to be mine, but it really wasn’t!]</p><br/><p>His voice was getting smaller, but the power I was feeling from it was increasing.</p><br/><p>Eventually, the energy on his palm shone with a brilliant light and tried to envelop him, but the Demon Lord released a black demonic energy with his body and cast the light aside.</p><br/><p>[No one can control me!]</p><br/><p>This crazy guy!</p><br/><p>Immediately afterward, the dungeon shattered.</p><br/><p>We came back out to Earth. Beneath the still dark sky and blood red clouds, screams of despair rang out. A countless number of massive monsters were running amok. As I expected, the monster continent had started their final attack!</p><br/><p>[I am the king of all things demonic, reigning supreme over all things evil! None may err me and none may stand above me!]</p><br/><p>The Demon Lord spread his arms open. The ground was full of death energy, and he was clearly trying to absorb them! I quickly opened up an extradimensional space and sent a flurry of metallic fragments towards him.</p><br/><p>At the same time, I tried to absorb the death energy before he could, but it was almost as if he got stronger by casting aside the dungeon’s power, as he began to absorb all negative energy on Earth.</p><br/><p>It wasn’t just death energy. He was using a power I hadn’t experienced before. Demon Lord, this title surely didn’t come from simply being the leader of the demon race.</p><br/><p>[As such, I will obtain you and rule over all worlds!]</p><br/><p>“It’s about time you stop dreaming!”</p><br/><p>His body had shrunken to about half its original size. Seeing the mana in his hand being compressed, I clicked my tongue.</p><br/><p>“To think just some words affected him this much. He’s more talented than I thought.”</p><br/><p>“You were too careless, Son.”</p><br/><p>“Huh?”</p><br/><p>I shrugged.</p><br/><p>“What do you mean? I was purposely stalling for time to come up with a way to take the dungeon’s power out of him. I troubled Father, Sumire, and Ye-Eun because of it.”</p><br/><p>“… You mean you made him do this on purpose?”</p><br/><p>“Shin-nim, are you saying you controlled the Demon Lord? You finally entered the realm of gods!”</p><br/><p>“No, it’s nothing amazing, so don’t be so exaggerating.”</p><br/><p>While Father and Sumire couldn’t close their mouths in shock, Ye-Eun, who was ready to restrain the Demon Lord with her golden chains if given the chance, turned her head slightly and asked.</p><br/><p>“Why did you click your tongue, Shin?”</p><br/><p>“Well, if you see a talented person, a demon, in this case, you naturally get jealous. That’s why I clicked my tongue. The situation itself is very favorable for us.”</p><br/><p>“It is?”</p><br/><p>“Of course.”</p><br/><p>I said that and raised my spear. The Demon Lord’s killing intent also became focused on me. It didn’t take a genius to figure out he wanted to kill me and take my power.</p><br/><p>“First, the dungeon is now our enemy. So what good would it be to stay in that dungeon?”</p><br/><p>“You’re saying you provoked him to destroy the Event Dungeon?”</p><br/><p>“There’s another reason too.”</p><br/><p>While the Demon Lord brought Earth’s demonic energy together to a single point, his right arm was cut off. The severed arm bloated up for a moment before losing all its power and disappearing. In the nearby airspace, ‘he’ appeared.</p><br/><p>Kain.</p><br/><p>“Indeed, with this much power, he should be one of the strongest among worlds’ enemies.”</p><br/><p>[Kuaaaaaaaaaa!?]</p><br/><p>“Give up on that arm. I won’t be able to use any divine power in exchange for that attack, so it’ll be hard to recover your arm.”</p><br/><p>With a truly lighthearted tone, Kain twirled a spear that was beginning to lose its light. Riding Odin’s famous steed, Sleipnir, he prepared himself to charge forward at any time.</p><br/><p>[Ku, kukukukuku! How painful!]</p><br/><p>The Demon Lord screamed in pain at first, but soon he broke out into laughter. Rather than blood, black demonic energy shot out of his wounds. Putting his uninjured left hand on the wounded area, he continued to laugh.</p><br/><p>[Right, this is it! This pain and hostility from many! This is what I felt when I conquered the Luka continent! Aah, how foolish was I, relying on a power that wasn’t my own!? After conquering the Luka continent, I believed I had gotten stronger, but no! I had just blinded myself with a power I couldn’t control!]</p><br/><p>“So what, you’re going to give up on taking my power?”</p><br/><p>[Of course not, Hero. You should know the answer to the question. Your power is different than the dungeon’s mishmash power! It is an authority! Eternity is granted to those who strive for power! Come! I will step over everything, including that arrogant fool above the Tower of Babel!]</p><br/><p>Without even a single warning, demonic energy detonated around the Demon Lord. It was powerful enough to critically wound even me! As I now continually maintained Divine Speed inBattle, I could thankfully react quickly.</p><br/><p>To be exact, I controlled the metallic fragments I previously took out from my extradimensional space and blocked the explosion of demonic energy. The metallic fragments flooded forward, enveloping the demonic energy and obliterating them.</p><br/><p>However, the Demon Lord’s attack didn’t diminish.</p><br/><p>[Is that all!? Show me that power once more! The power that will become mine!]</p><br/><p>Spears of demonic energy began to hurl towards everyone. In addition, magic spells that made me recall my fight with the dragon filled the air.</p><br/><p>The only difference was that the Demon Lord’s magic belonged to demons. As they were different from the magic of dragons, I couldn’t analyze them at all. Seeing small wounds beginning to appear on my companions, I asked worriedly.</p><br/><p>“Sumire, can you block them!?”</p><br/><p>“Yes, Shin-nim!”</p><br/><p>“Huhuhu, it just got more exciting!”</p><br/><p>While Sumire replied nervously, Ye-Eun’s battle hunger seemed to be triggered. In an instant, the golden aura she had transformed into a bluish black aura.</p><br/><p>“Play with me! Use more of that magic!”</p><br/><p>[Kuk, I’m not interested in you!]</p><br/><p>Ye-Eun charged at the Demon Lord and began to push him back with the weapons on her aura arms. However, she was exerting much more energy than before. Even if she could injure the Demon Lord, I couldn’t leave her be.</p><br/><p>“Leon!”</p><br/><p>My voice rang out, spreading across the sky. The reply came just as quickly.</p><br/><p>[The preparations are done, friend.]</p><br/><p>“Then start!”</p><br/><p>In that instant, a deafening sound capable of burying the numerous explosions of demonic energy resounded. Thousands of fighter jets shot up into the air. It was truly a sight to behold. I could imagine how difficult it was to protect all these fighter planes with so many monsters running amok.</p><br/><p>[Mm!? Scraps of metal that can fly!? Is this Earth’s power!?]</p><br/><p>“Normally, it wouldn’t be effective against you.”</p><br/><p>But Leon was controlling them.</p><br/><p>Leon, and nobody else.</p><br/><p>[I can’t do any elaborate maneuvers! I can’t even have them all at full power!]</p><br/><p>It was as he said. No matter how amazing his mana control has become, it was impossible to control several thousand fighter jets to attack a single target. It was already surprising that he could pull up thousands of fighter jets carrying explosives.</p><br/><p>“Don’t worry, this is good enough. It’s dangerous, so stay back and send Licorice.”</p><br/><p>“I’m already here, Dear Husband.”</p><br/><p>As though she learned teleportation or blink, Licorice appeared behind me before I noticed.</p><br/><p>After evolving into an empress, Licorice looked more beautiful than ever. She could easily claim the title for the most beautiful woman in the myriad worlds. The two horns growing from the forehead were like accessories that adorned her beauty.</p><br/><p>For the first time, the Demon Lord examined Licorice’s body and my body closely.</p><br/><p>[Hero… Did you become a mare!?]</p><br/><p>“I stopped trying to distinguish that long ago.”</p><br/><p>I replied with a snort. The Demon Lord’s follow up was rather surprising.</p><br/><p>[It does not matter. To think I’d meet another woman that is to my taste. When the Hero dies, his power will become mine. Beautiful mare, come to me. I am the king of all things demonic, king of all things evil! I will become the sovereign of all!]</p><br/><p>Licorice made a dumbfounded face and whispered to me in a daze.</p><br/><p>“Dear Husband, is he crazy?”</p><br/><p>“Didn’t you realize it when you saw him?”</p><br/><p>At that moment, one of the fighter jets suddenly exploded. It was the Demon Lord’s doing.</p><br/><p>[Hero, why haven’t you made your move? Are you afraid of me? Or did you really plan on these scrap metals to be your trump card?]</p><br/><p>His demonic energy began to spread out in tentacles. At the same time, Licorice leaned against my back with a soft smile, and the boundless mana in her body began to flood into me.</p><br/><p>It wasn’t just her mana. She served as a medium to transfer the mana of all surviving succubi.</p><br/><p>Using their mana, I activated my power. The power of the Eliminator that I perfectly molded into my power. The power to reinforce and control all weapons.</p><br/><p>Thousands of fighter jets charged towards the Demon Lord, each carrying my mana and using Divine Speed.</p><br/><p>An enormous explosion erupted.</p><br/>\n</div>"}