{"title": "Chapter 3: Tutorial (2)", "id": 3, "volume": 1, "url": "http://boxnovel.org/reincarnator-chapter-3-tutorial-2", "volume_title": "Volume 1", "body": "<h1>Chapter 3: Tutorial (2)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>(The previous Nagamaki will be changed to Podao)</p><br/><p>The whole body’s muscles started squirming around at a miniscule level.</p><br/><p>His body, which he wasn’t accustomed to due to it being from many decades ago, quickly moved according to Hansoo’s will.</p><br/><p>Hansoo, who had prepared his body, slowly walked towards the goblins who were running towards him in a crazy manner.</p><br/><p>Those are trying so hard to get here so what’s the point of him running?</p><br/><p>Every bit of stamina to swing the dagger was important.</p><br/><p>Hansoo deflected a goblin’s arm while it was swinging the sword</p><br/><p>Keeik?</p><br/><p>Hansoo’s body, which seemed to be out on a stroll to watch a mountain, suddenly changed fiercely while the goblin was flustered.</p><br/><p>As if he released all the strength he gathered up.</p><br/><p>All the runes were gone.</p><br/><p>All the skills were also gone.</p><br/><p>But the same strength, the same stamina or the same perception had a huge difference depending on how it was used.</p><br/><p>The body was basically a tool of battle and depending on the way the tool is used, the final outcome will have a difference between heaven and earth.</p><br/><p>Hansoo rushed between the goblins just like that and started slashing madly in all directions.</p><br/><p>Kiiieeek!</p><br/><p>The goblins, who were running, screamed in a beastly manner and rolled about on the floor.</p><br/><p>And in the spot the goblins dropped, two things were left.</p><br/><p>A Podao, which was crude but much more threatening than a dagger.</p><br/><p>A much tinier rune.</p><br/><p>Hansoo spread out his right hand, grabbed the Podao and swinged it hard as he grabbed the rune with his left hand at the time same.</p><br/><p>And at that moment a part of Hansoo’s body changed slightly.</p><br/><p>‘My luck is good’</p><br/><p>[Kang Hansoo]</p><br/><p>Strength: 11</p><br/><p>Agility: 10.1</p><br/><p>Stamina: 9</p><br/><p>As a rune that rose agility by 0.1, Hansoo’s status menu changed.</p><br/><p>Agility, which wasn’t needed to be shown, appeared.</p><br/><p>In a sense, one’s strength is what made one faster, but agility was a little different.</p><br/><p>The user’s time twists and it becomes 0.1 times faster and their reaction speed becomes faster as well as the same movement being slightly faster.</p><br/><p>As agility rises, the user started to live in a different dimension.</p><br/><p>Every rune stat other than strength and stamina, which was already given to humans, all start at 10 due to them not existing prior to that.</p><br/><p>Hansoo moved his now faster body without hesitation towards the goblins who were rushing towards them and started to cut them into blocks.</p><br/><p>Sometimes it didn’t come out, and only small ones came out when it did, but since numbers were numbers, Hansoo’s rune stats rose slowly but surely.</p><br/><p>Of course with his current status, no matter how weak goblins are killing 200 alone was a bit far fetched.</p><br/><p>The Podao was so feeble that two or three swings broke it and Hansoo kept changing his weapons as he fought the goblins.</p><br/><p>Injuries rose by one and two as well.</p><br/><p>And the people who saw that stopped and stared at each other.</p><br/><p>At this rate, they will all die.</p><br/><p>Not from goblins, but from human’s hands.</p><br/><p>And they also started to have greed.</p><br/><p>It seemed like runes were very important.</p><br/><p>But as one person ate it all they felt anxious.</p><br/><p>And as they gained courage as they saw Hansoo, who only seemed to be a college student, fight so well.</p><br/><p>From afar, his actions looked very sloppy.</p><br/><p>The actions were not flashy but rather only created due to him protecting himself but as they saw the goblins falling to those slashes, the goblins seemed very weak.</p><br/><p>“Fuck…eyy shit I don’t know anymore!”</p><br/><p>“Uwahhh!”</p><br/><p>The people grinded their teeth, but carefully approached Hansoo’s back and started fighting.</p><br/><p>Kiiiiek!</p><br/><p>The goblins stared at the humans who were charging towards them with a panicked look but then started fighting with a roar.</p><br/><p>And then chaos started.</p><br/><p>“Ahhhhk!”</p><br/><p>“Goddamit! Help me!”</p><br/><p>They held one dagger.</p><br/><p>They knew they had to fight.</p><br/><p>They knew they would get stronger if they fought.</p><br/><p>The opponent wasn’t that strong.</p><br/><p>But even then, they were just commoners.</p><br/><p>And the enemies were armed with a weapon, despite it being feeble, as well as having a large amount of killing intent.</p><br/><p>A lot of injuries were occurring from all directions.</p><br/><p>But even in that situation, Hansoo continued to kill goblins as he absorbed runes and slowly walked forward.</p><br/><p>Honestly there was no need to rush while receiving a lot of injuries.</p><br/><p>He could hide between the people and fight slowly as if he was peeling an apple and kill more leisurely.</p><br/><p>But there was a reason why he rushed despite receiving injuries.</p><br/><p>‘There is no time to dilly dally.’</p><br/><p>Including this location there were countless amounts of adventurers.</p><br/><p>‘There are probably over 10,000.’</p><br/><p>The 100 people here was not everybody.</p><br/><p>There are probably a few hundred of these just for Korea.</p><br/><p>If we include the world there are many more.</p><br/><p>But everyone was new 1st years.</p><br/><p>There were no adventurers from previous years.</p><br/><p>They probably didn’t come here from kindness because of the newbies.</p><br/><p>This location will be protected for three months as the tutorial area.</p><br/><p>If things like this didn’t exist all the upper years would come, kill everyone and take their runes.</p><br/><p>With only 1 year of experience one can kill 100 of them very easily.</p><br/><p>From a point of view it seemed like the benevolence of the fairy but Hansoo’s thoughts were different.</p><br/><p>‘How to say it? Created to enjoy the chaotic fight between weaklings?’</p><br/><p>It seemed like it was made because it would be boring if a strong person came and wiped out everybody.</p><br/><p>Whatever the reason this was a chance.</p><br/><p>In 3 months they will have to collide against people who’ve been here for 2 or 3 years.</p><br/><p>With that in mind they must become strong fast.</p><br/><p>Due to Hansoo flying about quickly in the front, the fight ended rather quickly.</p><br/><p>As the battle ended and the tension was released, the people couldn’t bear the fatigue and fell onto the floor.</p><br/><p>‘About 16 people died.’</p><br/><p>A much better loss than in the past.</p><br/><p>If Hansoo wasn’t here, at least 30 would’ve died.</p><br/><p>While the 100 fought 200, the number of goblins Hansoo killed by himself was at least 70.</p><br/><p>And the surrounding people stared at him tiredly.</p><br/><p>As the people thought of Hansoo’s mad actions of slashing in every direction with his Podao and Dagger and slowly moved their distance away from him, the fairy appeared.</p><br/><p>“Wow. The grade is really good here. Well from now you should know how to survive from this point.”</p><br/><p>‘Fucking son of a mayfly.’</p><br/><p>The people couldn’t curse out loud so they did it inwardly.</p><br/><p>It was rather easy to realize who put up the goddamn wall.</p><br/><p>“I will get rid of the wall now. From now, do it just like this. Fighting!”</p><br/><p>As the fairy disappeared, people started mumbling.</p><br/><p>Hansoo shook his head and then checked his stat.</p><br/><p>[Kang Hansoo]</p><br/><p>Strength: 14.3</p><br/><p>Agility: 10.9</p><br/><p>Stamina: 10.1</p><br/><p>Perception 11.2</p><br/><p>‘It’s not bad’</p><br/><p>Hansoo nodded his head.</p><br/><p>As he expected, agility runes don’t come out easily.</p><br/><p>And maybe due to it being a tutorial, skills didn’t come out.</p><br/><p>But compared to the three he killed when he started off in the past it was not that bad.</p><br/><p>As he also got perception runes which increases his overall perception, the start was pretty good.</p><br/><p>‘I even got something like this.’</p><br/><p>Hansoo laughed as he saw the sword with a sharp edge.</p><br/><p>This well balanced and sharp Podao was one of the more useful items out of the ones you can get in the beginning.</p><br/><p>It wasn’t a great weapon but compared to the ones that lost their edge with a few swings, it was much better.</p><br/><p>With the dagger attached inside and the Podao attached by his waist, his whole body had multiple scars.</p><br/><p>Since he rushed in order to end it fast.</p><br/><p>Hansoo, who had finished his basic preparations, thought of the things he needed to do at this moment.</p><br/><p>‘Firstly… I won’t be able to meet them.’</p><br/><p>He was a 1st year adventurer.</p><br/><p>On the other hand, Keldian, Kangtae and Eres were 19 to 20 years adventurers.</p><br/><p>Since they started 20 years ahead, they were probably running way ahead of him.</p><br/><p>So Hansoo thought of the next thing.</p><br/><p>‘Well telling them about the Abyss is rejected.’</p><br/><p>The dimensional corrosion of the Abyss was sped up depending on how much the corroded dimension knew about the strength, intel and skill of the Abyss.</p><br/><p>Like ink spreading in the water.</p><br/><p>If intel about the Abyss were to spread, the invasion of the Abyss will start earlier.</p><br/><p>‘First, strengthening myself is of utmost importance.’</p><br/><p>He was here to change the flow of water.</p><br/><p>But the strength to change that flow of water was the start and of utmost importance.</p><br/><p>And with that Hansoo thought of his friends.</p><br/><p>Eres, Kangtae and Keldian.</p><br/><p>It was planned that they were to all return together with him.</p><br/><p>Unlike him, who had become strong by struggling intensively, their every action was close to a guidebook.</p><br/><p>And their survival was because of their strength.</p><br/><p>‘How did they say they did it?’</p><br/><p>They told him in the past.</p><br/><p>How they got strong in the beginning.</p><br/><p>Eres told him.</p><br/><p>‘Rejected.’</p><br/><p>It didn’t fit his personality and more than anything one needed to be at the level of Eres to do that.</p><br/><p>Next is Keldian.</p><br/><p>And Keldian ate all the runes as he quickly rushed out.</p><br/><p>‘In my view Keldian might have stimulated them a little.’</p><br/><p>But Hansoo shook his head.</p><br/><p>There was the words of Eres and him, who had come to save the humankind, doing that sort of thing is absurd.</p><br/><p>And there was more bad than good on the long term if that were to happen.</p><br/><p>If you kill somebody a rune will appear but it didn’t mean that the person who took the rune will become as strong as the dead person combined with them.</p><br/><p>Since runes didn’t drop in large numbers.</p><br/><p>In reality, the man who died earlier had more than 20 together if you combined his strength and stamina but the only thing that was dropped was a strength rune.</p><br/><p>If you see from the point of a society, coexistence was the answer. That was the reason why Eres, who had included everyone, was able to stay as a leader until the end.</p><br/><p>More than anything else if he were to think of his plans, killing a person to get a rune is forbidden.</p><br/><p>It might be different if they were to kill though.</p><br/><p>‘How did Kangtae say he did it?’</p><br/><p>‘….this doesn’t help either.’</p><br/><p>His luck was too good.</p><br/><p>Agility was one of the most useful stats out of the beginning stats.</p><br/><p>The increase of reaction speed allowed one to easily dominate over others.</p><br/><p>And there should be a limit to how lucky one can be, killing a tutorial goblin and getting a regeneration rune.</p><br/><p>The methods of those 3 did not fit him.</p><br/><p>Actually, their methods were a bit lacking.</p><br/><p>He needed a way to leap over their standards and rush forward with dominance.</p><br/><p>And Hansoo knew about that.</p><br/><p>‘Something like this existed.’</p><br/><p>A long time ago, one of his comrades from the Final Brigade told him.</p><br/><p>The tutorial area where 10,000 people were trapped for 3 months.</p><br/><p>In this place, there was a hidden dungeon.</p><br/><p>For a beginner, the difficulty was out of the question. So getting to the end was a failure. But just getting to that point will allow one to have an immense headstart that cannot be compared to others.</p><br/><p>He, who had only gotten to the halfway mark after a long struggle, got strong enough to the point of becoming one of the Final Brigade.</p><br/><p>Becoming one of the Final Brigade meant that one was within the top 100 strongest people of mankind.</p><br/><p>And for that, it was one of the most important location for the tutorial area.</p><br/><p>This world was not fit for mankind to survive but one thing was clear.</p><br/><p>Something that was harder, seemed close to impossible will grant a larger reward when completed.</p><br/><p>‘First, I must gain that.’</p><br/><p>Hansoo made his primary goal.</p><br/><p>KobatoChan’s note</p><br/><p>Changed Nagamaki to Podao (Bakdo in Korean)</p><br/>\n</div>"}