{"title": "Chapter 9: Gangnam Station (5)", "id": 9, "volume": 1, "url": "http://boxnovel.org/reincarnator-chapter-9-gangnam-station-5", "volume_title": "Volume 1", "body": "<h1>Chapter 9: Gangnam Station (5)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Hansoo who had entered the the third floor nodded at the light in the distance.</p><br/><p>A corridor that stretched far.</p><br/><p>In the space there darkness was best suited for, a stationary train made hissing sounds as it shone its lights in the distance.</p><br/><p>And because of that Hansoo didn’t need to search in order to find out what lived in this place.</p><br/><p>There was a snake that shined silver in front of the train sleeping in a curled up position.</p><br/><p>‘Barb snake’</p><br/><p>Being soft and squishy, its main diet was normal animals but it also ate Juterium metals as a secondary source of food.</p><br/><p>The Juterium metal that is digested within its stomach gets fused with the special liquid released inside its body and gets excreted between the scales.</p><br/><p>And this mixture dries in the air to cover the scales on its body.</p><br/><p>‘This guy is pretty fast.’</p><br/><p>The slippery and hard scales combined with its speed makes it hard to catch.</p><br/><p>Hansoo looked at his Podao that had its edge almost dulled out.</p><br/><p>It was a good Podao out of the ones that came out of goblins and that was the reason why it survived until now but it was quite lacking to go against those.</p><br/><p>‘It might be a little hard with this.’</p><br/><p>Paralysis poison is only effective if the blade gets through.</p><br/><p>The weight and hardness are important but first you need a sharp edge.</p><br/><p>Taesoon, who had a kitchen knife on his waist, backed off after seeing Hansoo’s look along with Sangjin who also had them.</p><br/><p>Hansoo clicked his tongue as he watched Taesoon and Sangjin.</p><br/><p>‘These guys need to go through some more socialization process.’</p><br/><p>“Try giving them to me.”</p><br/><p>One isn’t enough.</p><br/><p>They will likely break during the fight.</p><br/><p>At Hansoo’s words Sanjin looked at him with a slightly dissatisfied expression.</p><br/><p>“… You have yours.”</p><br/><p>At those words Hansoo looked at Sangjin with an amused look.</p><br/><p>‘It seems like this guy has the same idea.’</p><br/><p>Hansoo looked at Sangjin and Taesoon and spoke:</p><br/><p>“Are you guys trying to fight that?”</p><br/><p>If they were to fight he had no intention of asking them for their knives.</p><br/><p>He wasn’t in a hurry and there were probably a few left in the convenience store, he could just go back and get some.</p><br/><p>But unexpectedly they wanted to fight even though he thought that they would say they wouldn’t want to.</p><br/><p>At that moment Hansoo looked at what they could see and knew what these 3 were thinking.</p><br/><p>‘Are they looking down on that thing?’</p><br/><p>The Barb Snake was not really a large snake.</p><br/><p>Its length was only about 3 meters.</p><br/><p>The length was long but its body was smaller than the Land Mermaid.</p><br/><p>The Land Mermaid’s length was about 2 meters but it had a lower body that resembled a grub and these looked more agile.</p><br/><p>From a point of view they don’t really look formidable.</p><br/><p>But you can’t assume things like that.</p><br/><p>This guy was more dangerous than all of the Land Mermaids above combined.</p><br/><p>Hard scales and fast speed. Along with the strong muscles that can crush the Land Mermaid as well as sharp fangs and grip strength that do not fit snakes.</p><br/><p>The barb snake was a predator that chewed upon Land Mermaids.</p><br/><p>And it was also smart so it went for the weaker ones first.</p><br/><p>If these guys were to attack then they would get murdered.</p><br/><p>It won’t be a case where they will cry after getting hit once then absorb their gathered runes, instead their limbs will fall off.</p><br/><p>‘How do I handle these guys. There should be a different situation where you should have greed for runes.’</p><br/><p>He had seen these types a lot.</p><br/><p>Something that always happened during group hunts.</p><br/><p>They will forcibly join the hunt and try to receive some of the distributed goods.</p><br/><p>‘Eres was really good at persuading’</p><br/><p>But he wasn’t really interested in persuasion.</p><br/><p>It was annoying too.</p><br/><p>Normally Eres would persuade, Keldian would threaten and control them with carrots and whips, if a negotiation failed to bloom then Kangtae would walk out to force them off.</p><br/><p>And if that failed to clean things up he went out.</p><br/><p>There was no need to see blood for these.</p><br/><p>Fun was fun and work was work.</p><br/><p>He was annoyed with dealing with kids that were a fourth of his age so he gave them two options.</p><br/><p>“I will give you options. First, I will get out and you fight them yourselves. Second, you guys get out and watch me fight alone.”</p><br/><p>“…”</p><br/><p>“How do you want to do it?”</p><br/><p>Taesoon got angry at the suddenly different attitude from Hansoo.</p><br/><p>‘This bitch, we were hunting well together so far but why is he suddenly like this?’</p><br/><p>What his psychic powers were couldn’t be grasped by him but his reaction told him that what the snakes dropped was rather good.</p><br/><p>If they fought together and shared the drops it would be good but why did he need to get greedy to the point of excluding them.</p><br/><p>When Taesoon was about to say something somebody quickly made their decision and spoke.</p><br/><p>“I’ll get out.”</p><br/><p>“What?”</p><br/><p>The one who had made the decision was not Mihee but Sangjin.</p><br/><p>Taesoon, who had been looking at Sangjin with a flustered expression, scowled as he spoke.</p><br/><p>“Hey! He’s being petty and leave us friends out to eat them all by himself!”</p><br/><p>‘Friend. It’s a good word.’</p><br/><p>He didn’t decide to bicker over it although his idea was that good things were shared together and hardships were gone through together but it seemed like Taesoon was using it in a slightly different way.</p><br/><p>“I told you to follow me. I never said I was going to take you.”</p><br/><p>“…”</p><br/><p>At those words Taesoon looked at Hansoo with a dissatisfied expression.</p><br/><p>And Mihee, who had been listening, spoke as she nodded.</p><br/><p>“Let’s stop. If Hansoo is talking like that then it means it’s really dangerous.”</p><br/><p>If he wanted to take everything then he would’ve beaten them down then taken all the runes.</p><br/><p>Even when Taesoon was in danger after he got shot by the paralysis poison from the Land mermaids Hansoo didn’t talk like that.</p><br/><p>From the way Hansoo was acting right now meant that those scrubby looking snakes were actually very dangerous.</p><br/><p>No, since there was only one monster on the whole third floor, there was no way that thing was not strong.</p><br/><p>They had forgotten that for a moment due to greed.</p><br/><p>Taesoon, who had started to come to his senses, calmed down then started to take out the knives by in waist while clenching his teeth.</p><br/><p>‘Six of them’</p><br/><p>Hansoo started to apply the poison from the Land Mermaid on the edge of the kitchen knives from Taesoon and Sangjin.</p><br/><p>Though that thing ate Land Mermaids it was only because it was all digested within its stomach that could even digest Juterium. The land mermaid’s poison, which was almost like a neurotoxin, had to get into its muscles to work.</p><br/><p>Hansoo, who had numerous knives dangling from his waist, spoke as he looked at the three.</p><br/><p>“Hunt the land mermaids above. Hunting should be done constantly.”</p><br/><p>Taesoon looked at that Hansoo and answered expressionlessly.</p><br/><p>“Didn’t you bring us along to take us all the way?”</p><br/><p>Taesoon grinded his teeth because he felt like they were used.</p><br/><p>Hansoo smirked at those words.</p><br/><p>‘How did I not remember these amusing friends.’</p><br/><p>He remembered clearly that they followed him in here but it had changed to him bringing them here.</p><br/><p>‘You should really be lucky that Keldian didn’t come here. Ah, Keldian didn’t start here anyway.’</p><br/><p>Hansoo thought of Keldian who was probably wandering around the purple region and laughed.</p><br/><p>If it was Keldian, he would’ve made everyone above fall into a trap and take all their then started.</p><br/><p>And because of that he was pushed out of returning here.</p><br/><p>‘He’s always progressing forward but the results aren’t the best.’</p><br/><p>Hansoo looked at Taesoon and spoke as he thought of Keldian.</p><br/><p>“Go stay above. If you aren’t lucky then your eardrums will pop.”</p><br/><p>And then Hansoo charged at the Barb snake.</p><br/><p>Keeeeeeeeeeek!</p><br/><p>And then a frightening scream was heard and the three who had been going back up realized at once why Hansoo told them to stay out.</p><br/><p>…………………………………</p><br/><p>Kyaaaak!</p><br/><p>The Barb snake’s whole body squirmed as it expanded out then compressed in an instant.</p><br/><p>And the air that was expanded and compressed exploded out of the Barb snake’s mouth with an incredible speed.</p><br/><p>Paaaaaang</p><br/><p>An attack that had slight amounts of Magic.</p><br/><p>The power wasn’t that great but it was a shockwave that had an impact that shook the opponent’s balance by destroying their eardrums and cochlea.</p><br/><p>“Uuuk…”</p><br/><p>The body of the three, who had been standing by the stairs, swayed for a moment by the impact force that rang throughout the third floor.</p><br/><p>But Hansoo already expected that attack after seeing its stomach and neck area.</p><br/><p>‘Good’</p><br/><p>The impact came through the hands that had been covering the ears.</p><br/><p>But the magic resistance came into play and reduced the damage.</p><br/><p>Hansoo, who had succeeded in not losing his balance, quickly moved his hands from his ears and quickly attacked its momentarily defenseless body.</p><br/><p>Body, to be precise the scales were hard but in between the scales there had to exist a gap from which the melted Juterium mixture came out.</p><br/><p>The knife with paralysis poison applied to it went in between the scales.</p><br/><p>Kyaaak!</p><br/><p>‘Good. Three have been inserted.’</p><br/><p>There were 5 major spinal nerves throughout its body that controlled its body.</p><br/><p>Hansoo, who had touched the nerve after getting between the scales and its ribs, quickly backed off.</p><br/><p>Kyaak…</p><br/><p>The Barb snake, who was decorated with three knives within its body, twisted its body while making clattering sounds with its scales as if its body was harder to move than before.</p><br/><p>‘As expected, poison is the best in the beginning.’</p><br/><p>The beasts and clans in the later stages had incredible amounts of resistance and regeneration so most poisons basically had no effect on them.</p><br/><p>And if they also use skills it gets even harder.</p><br/><p>But poison was one of the extremely effective methods against the monsters in the beginning whose body were smaller and had less resistance.</p><br/><p>Even him, if he didn’t have the paralysis poison, would have struggled a lot.</p><br/><p>‘Well. It’s easy now.’</p><br/><p>He was bitten on his arm when he first inserted the knife but due to him raising his vitality the wound would heal.</p><br/><p>Hansoo charged again to insert two more knives into its body then finished it off by stabbing deeply within the roof of its mouth with the last remaining knife.</p><br/><p>“mmm?”</p><br/><p>Hansoo made a weird sound as he looked at the skill rune dropped by it.</p><br/><p>The skill rune which shone next to a few stat runes.</p><br/><p>[Barb snake’s shockwave]</p><br/><p>To use this thing he needed mana so he couldn’t use it yet.</p><br/><p>But in the case where he gained a mana rune during the tutorial, it would be an effective tactic in the beginning.</p><br/><p>Well the visualization of it coming out of the body was not great but as long as it was effective.</p><br/><p>‘As I expected. Due to it being a rather strong mob the rewards are…’</p><br/><p>And the three who had been standing afar off slowly crawled up and spoke out after seeing the skill rune on the ground.</p><br/><p>“…Are you going to use this Hansoo?”</p><br/><p>Taesoon mumbled with a jealous filled expression while looking at Hansoo.</p><br/><p>Because the already strong guy would get a skill rune so now he would start flying around.</p><br/><p>‘Damnit’</p><br/><p>At those words Hansoo shook his head</p><br/><p>“I’m not going to use it.”</p><br/><p>He could only use seven so why would he use something like that.</p><br/><p>“What?”</p><br/><p>Sangjin stood up and shouted:</p><br/><p>“Then can I use this?”</p><br/><p>If he wasn’t going to sell it didn’t it mean he would give it to them?</p><br/><p>Taesoon scowled at Sangjin’s shout and spoke.</p><br/><p>“What would you do with it. It’d be better if I…”</p><br/><p>“What are you guys talking about. I’m going to sell it”</p><br/><p>“Huh?”</p><br/><p>“I’m selling it. To the person who brings the most runes.”</p><br/><p>“…”</p><br/><p>“If you buy it now I will give a discount. 5%”</p><br/><p>Hansoo shook the runes within his wrist and laughed.</p><br/><p>“…Can’t we do an installment plan?”</p><br/><p>“If you guarantee it. Stand together.”</p><br/><p>“…”</p><br/><p>From his expression, if one person were to ditch then the guarantees would have to sell all their gear to pay him back.</p><br/><p>The three made an expression as if they had chewed on crap.</p><br/>\n</div>"}