{"title": "Chapter 11: Otherworld’s Moon (1)", "id": 11, "volume": 1, "url": "http://boxnovel.org/reincarnator-chapter-11-otherworld%E2%80%99s-moon-1", "volume_title": "Volume 1", "body": "<h1>Chapter 11: Otherworld’s Moon (1)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Rattle. Rattle.</p><br/><p>The train moved to the next station swiftly.</p><br/><p>‘Let’s see… he did say there were multiple stations.’</p><br/><p>Hansoo thought of the stories of the four who had acquired the hidden piece.</p><br/><p>If you were to organize the conclusion was like this.</p><br/><p>Firstly. As you take the train you will go through 20 stations.</p><br/><p>Secondly. The artifact on each station was random.</p><br/><p>Thirdly. A station that you’ve passed cannot be returned to and going further did not mean better artifacts came out.</p><br/><p>‘It’s a structure designed to give people mental conflicts’</p><br/><p>Hansoo took a glance above.</p><br/><p>A map of the train route with 20 stations.</p><br/><p>He had to choose well here.</p><br/><p>Chiiiiik</p><br/><p>There was a platform laid on the center of the empty station with an artifact above it.</p><br/><p>‘Let’s see’</p><br/><p>There was plenty of time. Since the train won’t move until you get back on.</p><br/><p>Hansoo walked up to the platform and checked out the artifact</p><br/><p>‘Raroon’s Circlet.’</p><br/><p>Hansoo showed a conspicuous color.</p><br/><p>It raised the perception stat of the user by almost 10 and it showed the weak point of the beast on your first encounter with it.</p><br/><p>With this the chance that you will struggle against beasts in the beginning will decrease.</p><br/><p>The requirements was that you needed 25 or higher perception but it was well worth it.</p><br/><p>‘The standards are clearly higher.’</p><br/><p>Since it was a hidden piece there was an artifact that would help greatly in the beginning.</p><br/><p>But Hansoo shook his head.</p><br/><p>This one is dismissed.</p><br/><p>To Hansoo who knew every beast’s weak points it was a rather disappointing item.</p><br/><p>The perception stat was appealing but finding something else was better.</p><br/><p>Hansoo laid the circlet down and got on the train again to get to the next station.</p><br/><p>……………………………………</p><br/><p>‘This is the twelfth station.’</p><br/><p>Hansoo sighed softly.</p><br/><p>‘Eight weapons huh…’</p><br/><p>Maybe due to the fact that it was a hidden piece weapon, the quality was good even though it was a newbie weapon.</p><br/><p>There were ones with lightning damage and even a gauntlet that raised the number of runes.</p><br/><p>Since they were of higher quality than the needle he was holding there was nothing much to say.</p><br/><p>But that was the problem.</p><br/><p>The fact that they were better than his needle.</p><br/><p>In other words the choice was rather disappointing to Hansoo who was holding the needle already.</p><br/><p>‘Will weapons continue to come out.’</p><br/><p>Honestly since a good weapon in the start had abilities that were beyond simply raising stats and skills it wasn’t weird that there were many around.</p><br/><p>‘Won’t something like a stepping stone come out.’</p><br/><p>Shoes that allowed you to momentarily step on the air .</p><br/><p>With this you could have a much more three dimensional battle.</p><br/><p>It was a weapon that was hard to obtain even in the second tutorial stage or out of that, the red stage, so finding it around here would be nice. He had a slight hope that this would come out but it had yet to do so unfortunately.</p><br/><p>Hansoo slowly walked up to the platform and checked the item on it.</p><br/><p>A small cigarette pack.</p><br/><p>But Hansoo’s eyes bulged out as he saw it.</p><br/><p>“Huh? Maniac’s Cloud Snack?”</p><br/><p>‘Even something like this comes out?’</p><br/><p>The stepping stone instantly disappeared from Hansoo’s thoughts.</p><br/><p>This item was that rare.</p><br/><p>A cigarette pack with 20 cigarettes.</p><br/><p>But these were not ordinary cigarettes.</p><br/><p>As soon as you take a puff your rune stats will start to increase and it will continue to increase as you keep smoking it.</p><br/><p>And when you inhale all the smoke after you finish the cigarette all the rune stats will increase by around 20% and it will stay like that for around 10 minutes.</p><br/><p>It was only 20% on paper, if all your stats were to increase by 20% then it meant your battle power basically doubled.</p><br/><p>And it rose by percentage. This was very tempting.</p><br/><p>It meant that as your stats got higher and higher the effects increased more and more.</p><br/><p>And whilst smoking it there were moderate amounts of painkiller effects as well as increase of adrenaline so even without the stat increase your basic combat abilities rose.</p><br/><p>An item that raised your battle power by a large amount for about 15 minutes after you start smoking it.</p><br/><p>‘huhh’</p><br/><p>Hansoo rejoiced.</p><br/><p>Although you couldn’t use it outside the tutorial area but it was a small artifact that was one of the best within the tutorial area.</p><br/><p>‘This is it’</p><br/><p>Hansoo chose instantly.</p><br/><p>He didn’t know what kind of artifacts would come out further along but there won’t be much difference to the earlier ones.</p><br/><p>Which meant there was no better choice than this.</p><br/><p>Hansoo inserted within the side of his upper body then smiled as he walked towards the exit.</p><br/><p>‘Wait, but I don’t smoke…’</p><br/><p>Hansoo made a slightly perplexed expression due to the unexpected problem.</p><br/><p>‘Well. That guy will understand.’</p><br/><p>He promised to stop but wouldn’t he allow such a thing like this.</p><br/><p>As Hansoo got on the train whilst humming, the train started to move slowly towards where Hansoo started.</p><br/><p>…………………………….</p><br/><p>‘Did they all exit’</p><br/><p>As Hansoo got off from the train, the train rattled as it stopped its operation and even turned its lights off.</p><br/><p>A silence space with nobody else, Hansoo picked up the nearby cookwares and then got lost in thought as he started to proceed upwards from the third floor.</p><br/><p>‘Let’s see’</p><br/><p>Hansoo thought of the second hidden piece.</p><br/><p>The first day ended in a satisfactory manner.</p><br/><p>Since the first hidden piece was completed, as long as he completes the second one then he will have gotten all the hidden pieces he could acquire in the first tutorial area.</p><br/><p>But he couldn’t do it right now.</p><br/><p>The second hidden piece could only be obtained after the fourth day.</p><br/><p>Hansoo started to ponder for a moment.</p><br/><p>There were two things Hansoo could do before the second hidden piece made its entrance.</p><br/><p>Hunt and collect runes diligently.</p><br/><p>Challenge the remaining missions.</p><br/><p>‘There’s not much to decide.’</p><br/><p>You will naturally kill beasts as you do missions.</p><br/><p>He had to aim one of the missions of the 119, no, 118 due to him clearing one.</p><br/><p>‘No. A few of them were done on the way to here.’</p><br/><p>First beast kill, First one to gain a new rune type and so on… such things were done on the way to here.</p><br/><p>But these weren’t the missions that were officially decided.</p><br/><p>The remaining missions were around 110.</p><br/><p>Well he had no way of knowing which missions were decided.</p><br/><p>There were probably two or three more.</p><br/><p>An extremely low chance.</p><br/><p>But that wasn’t something to worry about.</p><br/><p>‘Do the ones with better rewards first.’</p><br/><p>If he did the easy missions then he could do around 30 of them in two days.</p><br/><p>Statistically, clearing thirty missions meant there was a high chance that one would hit.</p><br/><p>But that didn’t really mean anything.</p><br/><p>The lower missions didn’t give more than a few runes if you cleared them.</p><br/><p>So it’s better to do the missions with the best rewards one by one instead.</p><br/><p>If you hit then it was a jackpot and if you didn’t then it was part of the hunt so there wasn’t much to lose.</p><br/><p>‘Let’s see… the mission with the best reward.’</p><br/><p>And then Hansoo frowned at the reward he thought of.</p><br/><p>The reward itself was amazing.</p><br/><p>As soon as you eat it then every stat will increase and not just the ones you have but every rune in existence including luck by 10 and even heal injuries that could kill.</p><br/><p>It was not an object that could be gained in the tutorial stage.</p><br/><p>No, this item was hard to obtain even outside the tutorial stage. The red area.</p><br/><p>But the requirements was the problem.</p><br/><p>‘Who completed a maniac mission like this’</p><br/><p>The information in his head was basically things people experienced.</p><br/><p>It meant somebody had succeeded.</p><br/><p>‘Oh..was it that person.’</p><br/><p>Hansoo thought of one of the people from the Final Brigade.</p><br/><p>Enbi Arin.</p><br/><p>A member of the Final Brigade who went to a prison as a volunteer and got dragged to this place along with the criminals.</p><br/><p>A person who got humiliated as soon as things started and acquired rage as a specialty. It was a mission she found out after the seven days where she proceeded to rip apart every single criminal who hurt her, eat their hearts and even tried to commit suicide.</p><br/><p>‘…This is dismissed.’</p><br/><p>Hansoo clicked his tongue.</p><br/><p>He didn’t feel like doing it and to do this he needed to kill everybody which meant the many missions that required people to live will become useless.</p><br/><p>Though he didn’t know if this mission was one of the decided ones but there was no reason to try.</p><br/><p>Hansoo thought of the second best reward.</p><br/><p>‘Kill 100 people within one day.’</p><br/><p>As a side note, it was Keldian who completed this.</p><br/><p>‘Dismissed as well.’</p><br/><p>It gave a good skill as a reward but it wasn’t good enough for him to learn and it was also too late.</p><br/><p>He spent quite a while selecting an artifact so the day was almost over.</p><br/><p>When he gets out it would probably be nighttime.</p><br/><p>Nighttime, something flashed by this thoughts.</p><br/><p>In Hansoo’s thoughts it was a mission with a rather good reward.</p><br/><p>‘I almost forgot about that. .’</p><br/><p>When the first night is over that chance also disappears.</p><br/><p>It was better to do this first than the other missions with better rewards.</p><br/><p>‘This is first for now. I should fill up my stamina quite a bit though’</p><br/><p>Since while the is up, he would become very busy in order to acquire that.</p><br/><p>Hansoo felt hungry and headed towards the convenience store.</p><br/><p>Humans could definitely become transcendentally strong as they acquire runes.</p><br/><p>The best part was that the number was basically being twisted so the efficiency rose explosively.</p><br/><p>It would make sense that one would require twice as much food if your strength is doubled but the amount of strength increased by runes didn’t need extra food.</p><br/><p>The Otherworld’s adventurers could eat and sleep at a similar pace that they were at in their own world and still maintain their battle powers.</p><br/><p>Even if you have the strength that could smash apart mountains.</p><br/><p>But in other words if you couldn’t even maintain that much then your battle powers will sink down tremendously.</p><br/><p>In order to maintain the top condition, food, sleep and rest was needed.</p><br/><p>And sudden exercise would make one even hungrier faster.</p><br/><p>‘Let’s seat first and…hmm?’</p><br/><p>Something came into Hansoo’s eyes as he walked towards the store.</p><br/><p>The entrance was very different from before.</p><br/><p>A completely empty convenience store.</p><br/><p>Everything including food was completely gone.</p><br/><p>Nothing was left behind.</p><br/><p>And the ground was all dug up everywhere.</p><br/><p>No, it wasn’t everywhere.</p><br/><p>The spots where the food was buried were dug up accurately.</p><br/><p>“Huh. Look at these kids.”</p><br/><p>They did something this courageous despite the fact that the moon would come up soon.</p><br/><p>Hansoo looked at the scene in front of him as if it was amusing and laughed.</p><br/><p>……………………………</p><br/><p>“Ah… Can’t I stop that.”</p><br/><p>Mihee looked at the crowd that was moving the goods from the convenience store with a sad expression.</p><br/><p>The seven had gathered together and came back up.</p><br/><p>But somehow the rest knew and rushed the store and started to take everything.</p><br/><p>‘We’re definitely stronger but…’</p><br/><p>Mihee gulped.</p><br/><p>The first thing she checked was the status of the other group as soon as they came up.</p><br/><p>And she knew.</p><br/><p>‘It’s doable’</p><br/><p>The ones above weren’t that strong because they were focused on organizing people.</p><br/><p>They were of course weaker than the three below and even weaker than the four above.</p><br/><p>The problem was numbers.</p><br/><p>They couldn’t get near them easily but as 10 times the amount of people rushed the store they couldn’t do anything.</p><br/><p>They brought the backpack as they came up but they could only feel sad as the items they wanted to bring one by one were all taken.</p><br/><p>‘ah…’</p><br/><p>Whilst Mihee was making a sad expression, Taesoon was laughing inwardly.</p><br/><p>‘They’re doing good.’</p><br/><p>Taesoon only gave them 1 intel.</p><br/><p>There was a convenience store below.</p><br/><p>And like magic, despite them being cautious of him, they all rushed the store, took everything and moved it somewhere else.</p><br/><p>He decided to keep it a secret from his other friends. Since they were friends it would be troublesome if they get in the way.</p><br/><p>Since they had taken everything on the ground, Hansoo had no choice.</p><br/><p>Since he would have no food.</p><br/><p>And he could use the items within the store very well.</p><br/><p>He would probably need the items in the store the most.</p><br/><p>And since he couldn’t fight against everyone else he could only join them.</p><br/><p>And then he would take the leadership position and ask to share the thing he obtained in the station.</p><br/><p>And after that they would get rid of the group together and take back everything from the store.</p><br/><p>‘You don’t live alone in the world.’</p><br/><p>Taesoon had hoped that Hansoo would bring something back fast.</p><br/>\n</div>"}