{"title": "Chapter 15: Otherworld’s Moon (5)", "id": 15, "volume": 1, "url": "http://boxnovel.org/reincarnator-chapter-15-otherworld%E2%80%99s-moon-5", "volume_title": "Volume 1", "body": "<h1>Chapter 15: Otherworld’s Moon (5)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Eres and Keldian often bickered with each other even when they started working together due to differences in opinion.</p><br/><p>Eres always said this.</p><br/><p>Keldian said this.</p><br/><p>And because of that their thoughts were unified.</p><br/><p>And Hansoo agreed with this.</p><br/><p>……………………………</p><br/><p>Thukunk</p><br/><p>“…huh?”</p><br/><p>Taesoon made a confused expression as the foot he had set forward slanted on an angle.</p><br/><p>And he knew instantly.</p><br/><p>That the foot he had set over the line had been cut off.</p><br/><p>Taesoon fell and screamed as he saw the kitchen knife that seemed to have cut off his ankles being stuck on the ground in front of his eyes.</p><br/><p>“Uahhhhhhk!”</p><br/><p>Everyone felt the horror in their hairs and bones as they saw Taesoon roll about on the floor without an ankle.</p><br/><p>The enraged voices quieted down and only silence was left.</p><br/><p>The fact that he was strong enough to the point where he cut an ankle off by throwing a kitchen knife was a problem but it wasn’t the root of the silence.</p><br/><p>It was the fact that he had cut off his leg because he had crossed the line.</p><br/><p>And that look.</p><br/><p>‘Fuck. What kind of college student has an expression like that… what kind of work did he do?’</p><br/><p>Giltae grinded his teeth as he saw his eyes from afar.</p><br/><p>As Taesoon saw everyone hesitating, he grinded his teeth.</p><br/><p>‘These bitches who were so confident… these sons of bitches!”</p><br/><p>He went out believing in these people.</p><br/><p>But were acting in such a way!</p><br/><p>Taesoon, who was looking at the people with tails between their legs, shouted out while squirming in agony.</p><br/><p>“Guuuaa… Guaa.. You dirty bastard! You do this much to a friend just because you don’t want to give a piece of meat!”</p><br/><p>Truthfully it didn’t seem like that was the root of the problem.</p><br/><p>But that wasn’t important.</p><br/><p>The important fact was that that guy needed to die right now.</p><br/><p>And to do that he needed to stimulate the ones over there who were cowering like dogs with their tail between their legs.</p><br/><p>Taesoon spat out an evil shout.</p><br/><p>“You guys! Think well! Do you think that the guy who does this to me because he didn’t want to give out a piece of meat would let you live once he gets stronger?”</p><br/><p>And then everyone felt the horror in their hairs and bones.</p><br/><p>Those words were right.</p><br/><p>The already strong guy had risen up this much in just a day.</p><br/><p>And he had obtained a strange weapon as well.</p><br/><p>What would happen if he increases the gap in a few days?</p><br/><p>And if that happened would a guy who carelessly sent his friend’s leg flying leave them alive?</p><br/><p>“Hit him now! You guys are watching like this because you have no confidence in winning!”</p><br/><p>Giltae grinded his teeth.</p><br/><p>They didn’t know if those words were correct.</p><br/><p>But they couldn’t give up the chance right now.</p><br/><p>Even if he didn’t have such thoughts, if he becomes strong enough to easily push them down with his hands, and if he needs extra runes in order become stronger then it will become a disaster.</p><br/><p>If he were to attack them in surprise during the day, then they would just become a vending machine that is giving out all their runes.</p><br/><p>They had to kill him while everyone was excited, had their weapon and escape was impossible due to the light coming out of their bodies.</p><br/><p>“Prepare yourselves.”</p><br/><p>Hansoo shrugged his shoulders at the atmosphere that was becoming sinister.</p><br/><p>There was a bit of misunderstanding but the conclusion was the same.</p><br/><p>There was no point in persuading the guys who were charging at him with a death wish.</p><br/><p>And there was no reason to take care of them all.</p><br/><p>Since an easily set fire is easy to extinguish.</p><br/><p>‘One step at the time staring from the ones who crossed over the mountain’</p><br/><p>He had to finish in a overwhelming fashion. Since only then the other guys who charge at him thoughtlessly disappear.</p><br/><p>And it seemed that there were some people with skills in that crowd.</p><br/><p>They hadn’t hunted much but their body was good from the start so their basic stats were good.</p><br/><p>And to crush those guys his current battle powers were a bit lacking.</p><br/><p>‘Cloud snack is a bit wasteful’</p><br/><p>He couldn’t use such a thing which he had 20 of.</p><br/><p>He needed it to fight the guy blocking the second hidden piece at the .</p><br/><p>Hansoo absorbed all the runes in his wrist.</p><br/><p>Since there was no need to trade runes for the moment.</p><br/><p>All his stats like his strength shot up instantly.</p><br/><p>[Kang Hansoo]</p><br/><p>Strength: 40.3</p><br/><p>Stamina: 39.8</p><br/><p>Agility: 26.1</p><br/><p>Perception: 27.2</p><br/><p>Magic resistance: 13</p><br/><p>Hansoo stood up from his seat after absorbing all the runes and walked forward after pulling out the needle.</p><br/><p>‘This is going to hurt a little.’</p><br/><p>Since it started already.</p><br/><p>Before the night ends he will try out every mission with people as subjects.</p><br/><p>The fairies were so evil natured that most missions weren’t suited for teenagers to watch.</p><br/><p>But since they started the fight they should at least be punished that much</p><br/><p>‘First …it seems Enbi Arin did this too. Anyway, it seems I’ll be busy in order to try out all 37 missions with people as subjects.’</p><br/><p>Hansoo looked at the people rushing towards him coldly.</p><br/><p>………………………………</p><br/><p>Eventually the Moon that was hanging in the sky started to blink as it closed its eyes.</p><br/><p>Which meant that it was past 6 o’clock.</p><br/><p>As the moon closed its eyes the lights that were stuck on the people’s body started to disappear.</p><br/><p>It had closed its eyes but the moon kept on giving out light as it shone the disastrous scene below.</p><br/><p>“uuk…”</p><br/><p>“Guuuk…”</p><br/><p>Almost twenty or so people were stuck on the floor with holes in their limbs and were barely breathing.</p><br/><p>Everybody here were people who followed that man called Giltae.</p><br/><p>And Taesoon was part of this group as well.</p><br/><p>It has already been a while since the others ran away from here in every direction.</p><br/><p>And Mihee was watching Hansoo from the side with a disgusted expression.</p><br/><p>‘uue…’</p><br/><p>The fight ended rather easily.</p><br/><p>The people who rushed him were of no match to Hansoo.</p><br/><p>Their experience itself were different.</p><br/><p>He knew exactly where to stab and had no hesitation in doing so.</p><br/><p>No, even if they had similar experiences and skills, their stats were different.</p><br/><p>Hansoo, who had absorbed all his runes, flew around like a flying tiger and gave the people rushing towards him holes in their limbs one by one.</p><br/><p>Hansoo had injuries on his body but compared to those of lying below, it was basically nothing.</p><br/><p>As the people in their front fell down with holes in their body, the people who were stimulated from the food problem realized that the current problem was receiving holes in their body and not the food and had all ran away.</p><br/><p>And Hansoo, who had been eating food next to the fallen people, stopped eating as the moon set.</p><br/><p>Because he simply ate too much.</p><br/><p>‘I think I’ve almost eaten around 3 days worth…’</p><br/><p>One would get bored of beef if they eat a lot but since he ate about 3 days worth his stomach was about to burst.</p><br/><p>As Hansoo looked into the air, the air split apart as a fairy came out.</p><br/><p>As soon as the fairy came out, it looked around and then smiled.</p><br/><p>“You are doing very well. To even take the second mission.”</p><br/><p>And then the fairy handed over a small pouch and explained it.</p><br/><p>“This is a pouch that can hide the food from the moonlight. Let’s see… it seems you will be able to store around 2 weeks worth of food. Heehee. If you leave them in here then they won’t go bad so use it efficiently.”</p><br/><p>The fairy, who had spoken what it wanted to say, disappeared through the air to somewhere else.</p><br/><p>‘As I expected.’</p><br/><p>He was expecting a lot because this mission had a high chance of being chosen but his expectations weren’t wrong.</p><br/><p>In the future there will be places such a dungeons where you will starve for a month because you cannot find food.</p><br/><p>This would be of great help in places like that.</p><br/><p>Hansoo tied the pouch around the waist and then started to walk somewhere as he passed between the people lying on the ground.</p><br/><p>‘Well. There shouldn’t be a reason to see them now.’</p><br/><p>He had experimented with missions with humans as a subject all throughout the night.</p><br/><p>It was almost like torture but since they were the ones who started it there was no reason to hold back.</p><br/><p>The conclusion was that they were all fails.</p><br/><p>Two missions, since the 50 stats and the Jar mission were completed then it meant only one or two were remaining.</p><br/><p>Since there were over 100 missions and the chances were that one or two missions remained so it wasn’t that weird.</p><br/><p>‘But since I’ve attained the it’s all good.’</p><br/><p>Mihee carefully followed Hansoo, who had completed his meal, and asked in such a situation:</p><br/><p>“…Aren’t you going to kill them?”</p><br/><p>Those guys will undoubtedly heal even though the process may be slow.</p><br/><p>Since they had lead the group for a while, and had the already high vitality along with the few runes they had already obtained.</p><br/><p>And then Hansoo chuckled at those words.</p><br/><p>“What a scary woman you are.”</p><br/><p>“That’s not it. I’m saying this because I’m worried about…”</p><br/><p>Mihee realized how funny her words were as she finished her talk.</p><br/><p>They weren’t his problem already.</p><br/><p>Whilst they were healing and laying on the ground, Hansoo will become much more stronger.</p><br/><p>And that gap will become larger as they go on.</p><br/><p>No, from the beginning these guys couldn’t breathe when Hansoo walked past them.</p><br/><p>It will probably remain as a trauma that lasts a lifetime.</p><br/><p>‘Yeah. It’s not the time to worry about others’</p><br/><p>But there still remained a question.</p><br/><p>“But… what if you kill them and take the runes that are dropped?”</p><br/><p>Hansoo shook his head at those words.</p><br/><p>If his objectives were just to come back to the past in order to become stronger then he probably could’ve done that.</p><br/><p>But this was just part of his plans.</p><br/><p>And another set of plans included him settling the rules of when the humans roamed around the Abyss in the Otherworld.</p><br/><p>After they were merged with the Abyss, in order to get rid of internal disputes and to combine their strengths, they created rules of unity.</p><br/><p>And the most powerful one of those.</p><br/><p>A rule that needed to be abided by in order to save humanity.</p><br/><p>He had followed this rule for a long time.</p><br/><p>Killing a man and taking the few runes that dropped never replace the things that one person could do.</p><br/><p>One of the reasons why the humans had been pushed around by the inhabitants of the Abyss was because during the five years after he came a large number of people were integrated and naturally the strong started to see the weak people as runes and not people.</p><br/><p>And if he, who had to set up this rule, had killed someone because it was the start then that would bring a lot of troubles towards the goal he wanted to reach once the rumors of it spread far and wide.</p><br/><p>And it wasn’t that they only left runes behind when they died.</p><br/><p>‘There are too many eyes watching.’</p><br/><p>Since he had cleared all the missions with humans as the subjects, now it was time to try missions that were against monsters.</p><br/><p>‘Complete as much as I can before the 4th day when the Altar opens.’</p><br/><p>When the Altar opens then the requirements for the second hidden piece will come into play and fill up his time.</p><br/><p>And he needed to complete as much as he can before that.</p><br/><p>‘Well. Some lucky guys will get to eat them.’</p><br/><p>Hansoo left the bodies as he slowly walked towards the beast habitat on one of the corner of the Gangnam Station.</p><br/><p>To a place that looked dangerous at glance.</p><br/><p>Mihee clenched her teeth as she followed Hansoo’s footsteps.</p><br/><p>Hansoo saw Mihee as he spoke.</p><br/><p>“Aren’t I scary?”</p><br/><p>Mihee had watched his actions throughout the night without blinking an eye.</p><br/><p>And she still followed him.</p><br/><p>And at those words Mihee clenched her teeth.</p><br/><p>He was scary. How could he not be scary.</p><br/><p>She had seen what Hansoo had done clearly.</p><br/><p>But that’s how she realized.</p><br/><p>‘I just need to not cross the line’</p><br/><p>Then she and Hansoo would remain in a mutual relationship where they can talk and walk like this.</p><br/><p>‘Though he is indeed a little scary’</p><br/><p>Hansoo chuckled at Mihee whose body was slightly shaking and moved towards the hunting grounds and Mihee disappeared behind him.</p><br/><p>And in the location where they had disappeared, Taesoon was throwing all sorts of curses whilst lying on the ground.</p><br/><p>“Guuu… Kim Gangtae. Park Jisun. Kim Sunmi. Lee Heeji… you bitches. I will seriously kill you. Seriously. And especially you Mihee!”</p><br/><p>Those who had been sucking up to him in the real world had ran away as soon as they fell into danger without looking back.</p><br/><p>‘Bitches… I will have my revenge.’</p><br/><p>While Taesoon was grinding his teeth on the ground, somebody appeared above Taesoon and the others who were laid out.</p><br/><p>Taesoon looked up with an inferior expression but then smiled as he saw who it was.</p><br/><p>“Sangjin! This is good! Help me out! And kill everybody around here!”</p><br/><p>And at those words Giltae, who was laid next to him, grinded his teeth.</p><br/><p>“This fucking bitch…”</p><br/><p>Giltae made an expression of despair.</p><br/><p>Everyone had holes in their limbs. No. It was more like they were all in a very sorry state due to the torture that went throughout the night.</p><br/><p>If that one guy came at them then they had no way but to die like that.</p><br/><p>But Sangjin performed a much different action than they expected.</p><br/><p>Puuk</p><br/><p>“Ghuuk… Sangjin… This bitch. Why me…”</p><br/><p>Then Sangjin spoke out as he clenched his teeth and looked towards Giltae.</p><br/><p>“You still don’t know? This is a place where you must take everyone when given the chance. Did you have fun ruling me around upon your daddy’s back? You bitch.”</p><br/><p>“Ghuuuu…”</p><br/><p>And soon when Taesoon died, a few runes came out of his body.</p><br/><p>It was a sorry amount in comparison to what Taesoon had eaten.</p><br/><p>But it wasn’t an amount to ignore.</p><br/><p>‘There’s even a skill rune.’</p><br/><p>Sangjin, who believed his luck was good, took it in glee.</p><br/><p>And then he breathed in and out as he strengthened his grip on the Podao in his hand.</p><br/><p>Though there was a grudge. Though the situation was special, it was still murder.</p><br/><p>His hands were trembling but he clenched his teeth.</p><br/><p>He could not let this chance escape by.</p><br/><p>There is definitely somebody within the people who ran away who had similar ideas as him and would come back.</p><br/><p>He had to eat up everything before then.</p><br/><p>‘I’m just cleaning up the trash.’</p><br/><p>“This bitch…”</p><br/><p>Sangjin bit down onto his teeth as he walked slowly towards the gangsters who were watching him with despair.</p><br/><p>‘Kang Hansoo. I realized now. Why you abandoned me.’</p><br/><p>A perfect predator.</p><br/><p>The Hansoo that was shining into his eyes looked as such.</p><br/><p>And to those eyes how lame would he have seemed.</p><br/><p>He was thrown aside because he was weak.</p><br/><p>If he was as strong as Hansoo, no, even if he wasn’t strong as him, if he just just strong enough so that he satisfied the eyes then Hansoo wouldn’t have driven him out like that.</p><br/><p>And to do that he needed to gain.</p><br/><p>‘Just watch. I will become strong. Just like you…’</p><br/><p>And when that happens, Hansoo will only be able to look at him differently.</p><br/><p>And if he even leaps over Hansoo…</p><br/><p>‘First I will take the place of this guy.’</p><br/><p>Sangjin, after looking at the place where Hansoo disappeared, walked towards where Sunmi and the other friends would be.</p><br/>\n</div>"}