{"title": "Chapter 17: Altar (2)", "id": 17, "volume": 1, "url": "http://boxnovel.org/reincarnator-chapter-17-altar-2", "volume_title": "Volume 1", "body": "<h1>Chapter 17: Altar (2)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>‘I’m different from that Taesoon guy.’</p><br/><p>Sangjin thought inwardly.</p><br/><p>Taesoon had met a cruel fate due to him being hostile towards Hansoo due to his stupid ego.</p><br/><p>But he had no plans of becoming enemies with Hansoo.</p><br/><p>‘Definitely… don’t want to become enemies’</p><br/><p>Sangjin gulped as he thought of Hansoo’s actions throughout the night on Taesoon and the gangsters.</p><br/><p>Instead he wanted to on extremely close terms with Hansoo.</p><br/><p>Why would he become enemy with such a useful and powerful friend?</p><br/><p>‘I’ve grown this much. How Am I?’</p><br/><p>Sangjin was very happy with his current image.</p><br/><p>A completely different situation than when he was getting pushed down without being able to say anything under Taesoon.</p><br/><p>His friends who had been looking at Taesoon were now looking at him and everybody gathered here, and even those older than him, were focusing on him.</p><br/><p>And even Sunmi, who he had a crush on all along, was looking at him with a mysterious expression.</p><br/><p>He was not trying to show it in his thoughts but he could feel all the eyes on him.</p><br/><p>‘This world is about to become better and better’</p><br/><p>As long as you have strength you can stand in the center of this world.</p><br/><p>Like a main character inside a fantasy world.</p><br/><p>‘Hansoo, with your powers you could probably let somebody around Mihee go’</p><br/><p>There are probably celebrities in this world.</p><br/><p>If you become stronger then you can take women who are much prettier than Mihee.</p><br/><p>If Hansoo was with him then it would become easier.</p><br/><p>Sangjin looked at Hansoo with an anxious expression.</p><br/><p>This suggestion was perfect in this thoughts.</p><br/><p>And if everything went according to his plan Hansoo would probably agree.</p><br/><p>Since the Hansoo he knew was a guy who wanted to see results without getting swept by with sympathy and emotions.</p><br/><p>At those words, Hansoo spoke after pondering for a moment.</p><br/><p>“Can I give a suggestion? If you follow my suggestion than you guys can all live. Without sacrificing anything.”</p><br/><p>“…What did you say?”</p><br/><p>Everyone made a blank face at Hansoo words that sounded like a election strategy full of hope.</p><br/><p>But one person shouted in a hurry.</p><br/><p>“Are you trying to say to combine our powers to fight with that thing!? That’s just too much!”</p><br/><p>Everyone nodded at those words.</p><br/><p>It wasn’t that the sword didn’t go through.</p><br/><p>Since during the beginning of the clip the 70 of them pushed it back a little.</p><br/><p>But the problem was after that.</p><br/><p>That thing healed as it ate more and more people.</p><br/><p>Even if you push it back with numbers, the monster did not get tired whilst the people were getting chewed up one by one.</p><br/><p>Hansoo just shook his heads.</p><br/><p>“Did anybody told you to fight? You guys will just get in the way.”</p><br/><p>“…Goddamit! Then what do you want to do!? Are you trying to fight it alone?”</p><br/><p>As one person shouted in rebellion Hansoo nodded.</p><br/><p>“That’s it.”</p><br/><p>Everybody was shocked at those words.</p><br/><p>‘Did you really get strong enough to the point to fight against that?’</p><br/><p>Sangjin bit down onto his teeth inwardly.</p><br/><p>He did not have any confidence in fighting that monster.</p><br/><p>Even if everyone combined their strength.</p><br/><p>But that guy was saying that he will beat that thing up alone.</p><br/><p>‘Damnit… Damnit…’</p><br/><p>Whilst his inferiority complex, which was hidden away from his recent earnings of confidence, started to rise up again Hansoo spoke again.</p><br/><p>“I will fight it but it’s hard currently”</p><br/><p>While everybody was disappointed at Hansoo’s words, Sangjin actually felt better</p><br/><p>‘Yeah. Even if it was you it would be too much’</p><br/><p>If Hansoo were to ask him for help then he had the intentions to help.</p><br/><p>Of course it wouldn’t be free.</p><br/><p>Sangjin spoke with a happy expression.</p><br/><p>“Then are you saying we should fight with a small number of elites?”</p><br/><p>And then Hansoo spoke whilst making an expression that was asking what he meant.</p><br/><p>“I said you will only get in the way”</p><br/><p>It might be different on a normal situation but the opponent wasn’t good.</p><br/><p>They will all become a potion for the monster.</p><br/><p>Crunch</p><br/><p>Sangjin clenched onto his teeth inwardly.</p><br/><p>Basically he was still not qualified to be part of the hunt.</p><br/><p>‘Yeah. It’s possible that I still lack the qualifications’</p><br/><p>Since it has only been a short time since he started.</p><br/><p>But since he was working diligently, he would probably catch up fast.</p><br/><p>Sangjin settled down his anger and asked again.</p><br/><p>“Then how are you trying to do it?”</p><br/><p>Hansoo replied to those words.</p><br/><p>“Simple. If my strength and stamina rose by 30 from this point I can fight him one on one”</p><br/><p>30 of Strength and Stamina.</p><br/><p>It was a bit overbearing currently but if he raised his strength and stamina by 30 and used the cloud snack then he could fight that thing one on one.</p><br/><p>Strength and Stamina at 100, Perception and Agility needed to be around 50.</p><br/><p>This was the bare minimum line Hansoo chose.</p><br/><p>If the strength was lower than that then it was hard to penetrate the armor and if you lacked the stamina then you wouldn’t be able to hold on until it died.</p><br/><p>Your agility and perception needed to be around that in order to sense and dodge its attacks.</p><br/><p>Since it was a estimate that came from a long time of battle experience so it wasn’t wrong.</p><br/><p>A number that calculated the cloud snack into it.</p><br/><p>If it were other people then it wouldn’t be close to enough but if it was him then it was possible.</p><br/><p>And there were people who had actually done it.</p><br/><p>‘Kwang Goonju’</p><br/><p>In reality the only person who found out about this was Kwang Goonju.</p><br/><p>And he wouldn’t have known about this hidden piece if Kwang Goonju didn’t tell him about it teasingly.</p><br/><p>‘Well Kwang Goonju’s trait was rather good for these things’</p><br/><p>But even this Kwang Goonju barely beat this while he become half a corpse.</p><br/><p>It was not something that was there to be killed.</p><br/><p>It just wanted them to fight with each other and offer sacrifices.</p><br/><p>That was why it was a hidden piece. No one had the thoughts of killing it and that was the reason why it was hidden.</p><br/><p>Even him would have to invest around two to three days in order to reach that point.</p><br/><p>But that meant for two to three days, 10 to 15 people would need to be sacrificed in order to buy time.</p><br/><p>But if everyone gathered runes and helped him fill up the runes, he had the confidence to jump in the altar where that dumb looking beast was in.</p><br/><p>“So I have a suggestions. If you guys can push all the stats onto me, I will take responsibility and kill that thing”</p><br/><p>‘And if I do that then the requirements to gain the second hidden piece will be complete’</p><br/><p>Whilst Hansoo was thinking, somebody asked.</p><br/><p>“Do the 15 people who will be selected to become the sacrifice need to give that rune? 60 runes?”</p><br/><p>Hansoo shook his head as he answered.</p><br/><p>“No way. I don’t care who gives it to me. As long as that number is satisfied I will go into that altar right away.”</p><br/><p>Everyone frowned at those words.</p><br/><p>It had already been 4 days since they came here.</p><br/><p>Everyone felt the usefulness of the runes but the runes each person needed differed slightly.</p><br/><p>The weaker ones focused on Strength or Stamina and the stronger ones wanted to raise Perception or Agility.</p><br/><p>And within this weird balance, the rune was used as a form of currency in some way.</p><br/><p>Since one perception or agility rune meant they could trade it for two of strength or stamina.</p><br/><p>But not everyone had gathered runes.</p><br/><p>The weak ones needed to use runes as they gained even just to raise their stamina a little bit.</p><br/><p>So the weak ones who would’ve been chosen as sacrifices didn’t have any runes to spare.</p><br/><p>But the stronger ones had some strength to spare so they could collect a little bit.</p><br/><p>Since they could fight whilst having some runes collected.</p><br/><p>But even the stronger ones didn’t have a large amount of them stored.</p><br/><p>In order to fulfill Hansoo’s requirements they had to empty their pockets of runes.</p><br/><p>Everyone made a reluctant expression.</p><br/><p>It wasn’t ok to not give the runes.</p><br/><p>Because if they didn’t hand in the runes then it meant they basically wanted to sacrifice 15 weak people.</p><br/><p>But it wasn’t ok to give the runes either.</p><br/><p>If the people who would be chosen as sacrifices gave the runes then it would be ok but the situation wasn’t that clear</p><br/><p>The one who were weak enough to become a sacrifice had no runes. But then there was no time for these weak people to go hunt for the runes either.</p><br/><p>The limit was 1 hour and the sound of the altar being crushed was getting louder and louder at this moment.</p><br/><p>Which meant that the people who could spare strength, who wouldn’t have had become sacrificed in accordance to Sangjin’s suggestion, would have to pay the runes instead.</p><br/><p>And then one of those weaker people shouted loudly.</p><br/><p>A person who would be chosen first as a sacrifice because he was weak due to him hating fights.</p><br/><p>“Shit! Somebody please gather the runes and hand it to him! Damnit! Or pick names out of a hat!”</p><br/><p>Sneers were heard from one side at those words.</p><br/><p>“What a selfish bastard”</p><br/><p>“What did you say?”</p><br/><p>The man glared into the corner swiftly.</p><br/><p>But the woman didn’t get startled at those sharp eyes and spoke.</p><br/><p>Though it was a male against a female, such a man who only had his height going for him wasn’t a match for her.</p><br/><p>She had confidence to go into the high ranks if they started choosing.</p><br/><p>Since she tried harder because she was a female and had an unfair disadvantageous start.</p><br/><p>“Isn’t it obvious? Why should I give runes because of you? When there is such a huge difference in one or two of these? And somebody like you could die anytime so why what would I trust and lend it to him”</p><br/><p>“Euuuu…”</p><br/><p>The man couldn’t rebute.</p><br/><p>The reason why he was weak was because he was frightened of fights and had hid in the back.</p><br/><p>Four runes meant 40 goblins.</p><br/><p>He didn’t have the confidence to hunt that much.</p><br/><p>If he were to repay the runes, he didn’t know how long it would take</p><br/><p>“And what do you mean picking out of a hat. You might get thrown in there with broken limbs so don’t act out.”</p><br/><p>“Fuck…”</p><br/><p>The male grinded his teeth but he could only shrivel up because the Podao in the woman’s hand was too frightening.</p><br/><p>But backing off here meant he was basically being sent into that altar.</p><br/><p>So the man shouted once again.</p><br/><p>“But then are you saying the weaker ones should just go die? What is this nonsense! Damnit! Weren’t you all raised in a democratic society?”</p><br/><p>And the woman who spoke before spoke again.</p><br/><p>“Democracy is good. Then let’s vote for majority”</p><br/><p>“What?”</p><br/><p>“Majority rules. We will vote. Between those to want to block it by giving runes and the side that wants to sacrifice. Of cause it will be a secret vote like the democracy you like so much”</p><br/><p>“Kuue…”</p><br/><p>“Doing this much means I’ve given you a lot of face. In actuality could you guys do anything if I break your limbs and shove five of you in there?”</p><br/><p>Most people nodded at those words.</p><br/><p>They couldn’t say it out loud because of a guilty conscious but that nod meant that they agreed.</p><br/><p>“Ahh…”</p><br/><p>The man made a dejected expression at those words.</p><br/><p>Since the result was very clear if they went for majority rule.</p><br/><p>The order of weakness couldn’t be seen clearly but one could guess somewhat.</p><br/><p>Around twenty would know they’re weak and would go against it but the remaining forty or so would agree.</p><br/><p>And since it was a secret vote there was no situation where their guilty conscious would haunt them.</p><br/><p>The man hurriedly looked at Hansoo and shouted anxiously.</p><br/><p>“You! Can’t you take the runes from those guys?”</p><br/><p>Then Hansoo shook his head.</p><br/><p>He did not steal runes. Since it was the result of one’s hard work.</p><br/><p>This was one of the rules of the great unification.</p><br/><p>Because that was the same as taking the salary of somebody in the streets because you had strength.</p><br/><p>“If not.. then can’t you kill a few people and then gain the runes like that! If you kill around five to ten strong people then the amount of runes you set would probably come out!”</p><br/><p>Hansoo nodded at those words.</p><br/><p>Killing stronger people gave more runes then weaker people.</p><br/><p>For weaker people, he would need to kill around over fifteen but only about ten or less of the stronger people in order to fulfill the sixty he set as the goal.</p><br/><p>“Well. That is true.”</p><br/><p>Then the man shouted in a hopeful voice.</p><br/><p>“But then can’t you kill those guys then fight with the runes they drop? It’s better for ten to die then 15 to di… ahhhhk!”</p><br/><p>“This fucking bitch!”</p><br/><p>One of the other men who were listening to this got pissed and had kicked the man who was talking.</p><br/><p>That guy was definitely one of the ten strongest people.</p><br/><p>He felt anxious whilst he was listening so he rushed out.</p><br/><p>He had seen clearly how Hansoo had fought on the first day.</p><br/><p>If Hansoo decided to chop down head by head from the top, eat the runes and then went into the altar, there was nobody to stop him</p><br/><p>They had gotten strong as well but this wasn’t something that could be compared with just the amount of runes.</p><br/><p>Their breed was different from the start.</p><br/><p>A pig who had gotten a bit of muscle and speed couldn’t fight against a tiger of a similar size.</p><br/><p>And that tiger was probably much larger and much faster. Since it had eaten more runes since then.</p><br/><p>If that Hansoo decided with a lame counting method of then all of them would die.</p><br/><p>He was listening in leisure because the talks seem to be leaning towards the female but if it were to go this way then he would be perished.</p><br/><p>And when he looked around he felt that everybody was mumbling around.</p><br/><p>And then everybody started to shout.</p><br/><p>“Damnit! Just throw in fifteen weaker guys!”</p><br/><p>“Are you telling us to die! It’s better for ten stronger people to die!”</p><br/><p>“What nonsense! Then just kill the people in the middle and take their runes! We are going to be of help when we get out of here! It wouldn’t account to fifteen if you kill the ones in the middle!”</p><br/><p>Hansoo sighed as he saw the chaos.</p><br/><p>Because he knew this would happen</p><br/><p>The Moon. Then the Altar.</p><br/><p>There was no time to get used to things because the environment was constantly changing.</p><br/><p>And since they weren’t familiar with it they couldn’t back off a single step.</p><br/><p>It might’ve been different if they knew that there were flat land behind them but in this situation where they couldn’t see behind them, they could fall down a cliff and die if they backed off a single step.</p><br/><p>‘I need to do some traffic control’</p><br/><p>Hansoo, who had expectations that it would be solved by self control, spoke out.</p><br/><p>“Be quiet”</p><br/><p>Everybody stood up straight and stared at Hansoo’s lips at those words.</p><br/>\n</div>"}