{"title": "Chapter 26: Ticket (1)", "id": 26, "volume": 1, "url": "http://boxnovel.org/reincarnator-chapter-26-ticket-1", "volume_title": "Volume 1", "body": "<h1>Chapter 26: Ticket (1)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Hansoo chuckled at those words as he shook his head.</p><br/><p>“I’ll refuse. Go ahead first”</p><br/><p>Gyucheol couldn’t hold it in as he raged.</p><br/><p>“Aren’t you being too much young friend? And this isn’t just my thoughts. We need to move together as nine but what do you want us to do if you enter a dangerous place like this”</p><br/><p>Gyucheol’s face was on fire as he spat out the words.</p><br/><p>Since he knew that it wasn’t something he should be saying.</p><br/><p>But he held it in.</p><br/><p>The thing he had realized as he gained age and as he became a man of the family was that embarrassment was just for that moment and being loud was rather effective.</p><br/><p>Who would protect his family if he lets Hansoo go because of his ego and then die afterwards.</p><br/><p>His wife and his daughters could not even threaten a fish.</p><br/><p>They will probably die as soon as he dies.</p><br/><p>Or something even worse.</p><br/><p>‘It’s better to get cursed at’</p><br/><p>And there was still a problem if he beat the snake.</p><br/><p>Since it can only take a long time for him to fight the snake.</p><br/><p>Since then the destruction line that they had created a gap from would catch up them.</p><br/><p>And if that happened they had to fight more anxiously.</p><br/><p>‘You..as long as you come with us and fight then won’t be any problem’</p><br/><p>Didn’t they do good until now.</p><br/><p>This wasn’t a game, this wasn’t the time to worry about killing a strong monster for items or runes but why was he going crazy just because he couldn’t fight that powerful looking snake.</p><br/><p>They were already busy trying to push ahead.</p><br/><p>‘Damn. It’s not because he’s young. He’s just crazy’.</p><br/><p>Hansoo clicking his tongue as he looked at that Gyucheol.</p><br/><p>There were times like this where they opinions crossed.</p><br/><p>And he understood as well.</p><br/><p>If a man wasn’t selfish during times of danger then when would he be selfish.</p><br/><p>‘But there’s no other way’</p><br/><p>Since their goals were different there was no other way.</p><br/><p>Hansoo shook his head as he walked towards the snake.</p><br/><p>“Goddamit! If you were going to act selfishly like that then why are you traveling with us in the first place!”</p><br/><p>Hansoo shrugged his shoulders at Gyucheol’s words as he spoke.</p><br/><p>“I never traveled with you. The way we were going was the same”</p><br/><p>“…”</p><br/><p>“…dammit”</p><br/><p>At that moment everybody realized that even though Hansoo had been fighting in the front, he had never traded anything with them.</p><br/><p>Though he had taught them a few things discreetly.</p><br/><p>Gyucheol, who couldn’t hold it anymore, cursed out loud while his wife and daughter looked at Gyucheol with a pitiful expression and him took him away after looking at Hansoo with a resentful face.</p><br/><p>They knew that they were alive because of Hansoo but they were sad because of Hansoo acting the way he wanted.</p><br/><p>While they were leaving, somebody was watching Hansoo with a regrettable face.</p><br/><p>The one who actually stimulated Gyucheol was Hanchul.</p><br/><p>He was going to try recruiting him after watching for a little bit longer but he was shocked because Hansoo had said he was going to fight the snake.</p><br/><p>It did indeed seem like something amazing will come out if that snake was killed.</p><br/><p>But that was only important while they were alive.</p><br/><p>They had no thoughts of fighting with that anaconda-like 15m long snake.</p><br/><p>If Hansoo had miraculous powers to the point where he could slice it in half then they might’ve followed him meticulously to gain a little bit of anything.</p><br/><p>But they had eyes too.</p><br/><p>The snake which was sliding between the trees was quite nimble despite its size and its size broke the branches that were as big as normal tree trunks which showed his strength.</p><br/><p>That was not something where they can gain anything out of while Hansoo was fighting it alone.</p><br/><p>And they wanted to get away as fast as possible because of these thoughts.</p><br/><p>Since it will be bad if they received collateral damage whilst watching Hansoo fight.</p><br/><p>They had no thoughts of getting dragged in.</p><br/><p>‘Well. There’s nothing that can be done’</p><br/><p>If somebody couldn’t keep their lives in tact then that was all they were worth.</p><br/><p>The eight others quickly left Hansoo and took off as Hansoo bit onto a cloud snack while chucking at this view.</p><br/><p>Then he charged at the Rune Eater Snake.</p><br/><p>……………………………………</p><br/><p>Kudududk</p><br/><p>“Hoo.”</p><br/><p>Hansoo took out the cloud snack he was biting on and then grasped the rune eater’s snake with both hands.</p><br/><p>And behind him a giant rune eater snake was laid out dead with its brain pierced through.</p><br/><p>‘Now there’s only five cloud snacks left’</p><br/><p>Rune eater snake was indeed strong.</p><br/><p>But it was much weaker than the Carnivorous Beast.</p><br/><p>And his stats were much more different from then.</p><br/><p>He had used colorless energy and used the cloud snack because of limited time but only one was needed</p><br/><p>Kachak</p><br/><p>And soon the egg cracked open as a small snake that couldn’t be imagined to be a baby of that giant snake came out and crawled above Hansoo’s wrist.</p><br/><p>‘Good’</p><br/><p>There were quite a bit of Strength, Stamina, Agility and Perception runes gathered on his wrist.</p><br/><p>These were stats that Hansoo judged to be not necessary for the moment.</p><br/><p>Hansoo started to feed the baby rune eater snake with all the runes he had gathered up.</p><br/><p>The rune eater snake didn’t realize it’s parent was dead as it greedily gulped down the runes on Hansoo’s wrist.</p><br/><p>The four types of runes on his wrist quickly disappeared as a different type of rune replaced their spots.</p><br/><p>‘First, raise magic, physical and magic resistances.</p><br/><p>His Mana wasn’t really lacking.</p><br/><p>He had in instead raise these other three stats in order to raise his ability battle powers which were lacking.</p><br/><p>Since soon things with abilities will pop out one by one.</p><br/><p>[Kang Hansoo]</p><br/><p>Strength(Colorless): 0.02%</p><br/><p>Stamina: 88.8</p><br/><p>Agility: 84.0</p><br/><p>Perception: 85.1</p><br/><p>Mana: 58.4</p><br/><p>Magic: 30</p><br/><p>Physical resistance: 25</p><br/><p>Magic resistance: 25.3</p><br/><p>‘Finally I’ve gained the eight great stats’</p><br/><p>The most basic and the stat that impacted the battle powers the most, the eight great stats.</p><br/><p>From now he had to keep raising these stats in balance.</p><br/><p>Keiiik!</p><br/><p>The rune eater snake which seemed to be content from eating its fill cried out in content as it fell asleep on his wrist</p><br/><p>It was indeed the offspring of that giant rune eater snake no matter how you looked at it.</p><br/><p>He wouldn’t bat an eye during normal battles.</p><br/><p>‘You just stay asleep’</p><br/><p>Hansoo, who had been looking at it cutely, started to walk fast as he saw the destruction line closing in.</p><br/><p>………………………………</p><br/><p>“Dad. What do we do…”</p><br/><p>“Be quiet please”</p><br/><p>While Gyucheol and his Family were left behind on a fork on a road and were struggling, somebody started to appear afar.</p><br/><p>Gyucheol nodded after seeing this.</p><br/><p>‘I knew this would happen’</p><br/><p>He was covered in blood but it was Hansoo.</p><br/><p>Gyucheol, who had been looking at Hansoo, spoke out.</p><br/><p>“Did you perhaps run while fighting?”</p><br/><p>It didn’t seem like his strength, agility or stamina changed much from before.</p><br/><p>If the giant snake had given him runes then a his runes should have increased by a large amount.</p><br/><p>And the snake did indeed look stronger than Hansoo so the time that he took was too fast for killing it.</p><br/><p>Since the time it took for Hansoo to come back only took around the time it took to smoke one cigarette.</p><br/><p>“I killed it”</p><br/><p>‘Lies’</p><br/><p>If he wasn’t going to gain anything then why did he fight?</p><br/><p>No he did gain something.</p><br/><p>Only injuries all over the body.</p><br/><p>But it was to his expectations anyway.</p><br/><p>Since he guessed that he would at least run before he died.</p><br/><p>Hansoo asked the three as he asked.</p><br/><p>“The other people?”</p><br/><p>The others excluding Gyucheol and the two could not be seen.</p><br/><p>Gyucheol grinded his teeth at those words.</p><br/><p>“…they went that way.”</p><br/><p>‘and leaving us behind’</p><br/><p>He thought of Hancheol’s words before he departed.</p><br/><p>‘That bitch… both this guy and him’</p><br/><p>Gyucheol had to choose.</p><br/><p>Either to fight in the front.</p><br/><p>Or wait until Hansoo came back and then charge through the path with Hansoo in the front.</p><br/><p>But he had no confidence to fight in the front.</p><br/><p>‘Damnit… I should’ve fought in the front from the beginning’</p><br/><p>While the others were constantly fighting, he had been left behind without being able to eat any runes.</p><br/><p>And now he could only support from the back, he was not at the level to fight in the front anymore.</p><br/><p>And the beasts in front of them would be even stronger.</p><br/><p>They at least had Hansoo before, if he had fought in between the others then he would’ve died rather quickly.</p><br/><p>So he decided to wait for just 5 minutes.</p><br/><p>Just in case Hansoo would run away from the fight.</p><br/><p>‘It’s a relief’</p><br/><p>If he hadn’t come then he would’ve probably had to fight in the front while listening to their hateful words but thankfully Hansoo had come back.</p><br/><p>While Gyucheol was thinking about this and that, Hansoo had chosen a different direction than the others.</p><br/><p>If that path had been cleared already then the amount of runes he would be able to gain will be significantly lower.</p><br/><p>It was better to go somewhere where there was still a lot of things to hunt.</p><br/><p>And this path was more compatible with him.</p><br/><p>Gyucheol only looked at Hansoo pass by him but did not move.</p><br/><p>Hansoo looked at Gyucheol with an amused expression.</p><br/><p>“Aren’t you moving?”</p><br/><p>And Gyucheol relied at those words.</p><br/><p>“Didn’t you say you were never part of us already. Go ahead first”</p><br/><p>“Huh”</p><br/><p>These words were correct.</p><br/><p>‘I can clearly see his intentions but a guy being this straightforward is a first.’</p><br/><p>It didn’t really matter if there was somebody to fight with or not.</p><br/><p>Hansoo laughed as he started to move towards the other path quickly.</p><br/><p>And Gyucheol and his family slowly followed Hansoo whilst leaving a gap.</p><br/><p>‘There… aren’t any options left’</p><br/><p>He was not at the level of fighting in the front anymore.</p><br/><p>He had to push ahead by sticking to someone.</p><br/><p>‘Surely such an environment like this wouldn’t continue’</p><br/><p>As long as a similar environment like the first tutorial area came out then they can catch their breath.</p><br/><p>Gyucheol started to gaze at Hansoo’s back with a feeling of being on a tightrope.</p><br/><p>Hoping that he wouldn’t get mad and turn his blades at them.</p><br/><p>And hoping that he would clear the road well in the front.</p><br/><p>………………………………</p><br/><p>Udududk</p><br/><p>“Hooo”</p><br/><p>Hansoo made a dull expression as he killed the last Kerudal.</p><br/><p>This place’s difficulty was where nine people had to fight.</p><br/><p>It was hard because he had to fight alone.</p><br/><p>Since he couldn’t use cloud snacks in places like this</p><br/><p>‘But it’s still very good’</p><br/><p>[Kang Hansoo]</p><br/><p>Strength(Colorless): 0.03%</p><br/><p>Stamina: 88.8</p><br/><p>Agility: 84.0</p><br/><p>Perception: 85.1</p><br/><p>Mana: 58.4</p><br/><p>Magic: 35</p><br/><p>Physical resistance: 32</p><br/><p>Magic resistance: 32.7</p><br/><p>He had been monopolizing the runes because he was fighting alone.</p><br/><p>And the fights had been getting easier because his resistances were increasing due to his monopolization.</p><br/><p>And Gyucheol was looking at Hansoo with a fed up expression from the back.</p><br/><p>‘…he’s getting stronger and stronger’</p><br/><p>It didn’t seem like his movements were getting faster or his strength was increasing.</p><br/><p>But he was gaining a lot less injuries than before.</p><br/><p>And because of that he was fighting faster and more aggressively.</p><br/><p>He just took an attack that he would usually dodge and then sliced off their necks like that.</p><br/><p>And because of this his speed was slower than when he fought together with the other group but he had long recovered the speed back.</p><br/><p>‘This kinda bugs me…’</p><br/><p>He was traveling safely and comfortably.</p><br/><p>He just had to pick up a few bloody monsters that Hansoo had leaked.</p><br/><p>And Gyucheol was sufficient enough for these.</p><br/><p>But the fact that Hansoo has been getting more and more leisurely had been bugging him.</p><br/><p>The perfect situation in his head was that Hansoo was so busy fighting in the front and becoming a mess that he couldn’t spare any effort to care about Gyucheol himself.</p><br/><p>But if this happened he had no solution to when Hansoo became enraged..</p><br/><p>‘Do I have to run away in the next fork on the road…’</p><br/><p>But it was hard for him to clear the road alone.</p><br/><p>But the thing that had appeared in front of Gyucheol wasn’t a fork on the road.</p><br/><p>‘…Tunnel?’</p><br/><p>A giant tunnel located near the bottom of the mountain.</p><br/><p>And in front of it a very familiar existence was located there.</p><br/><p>“Are you not on good terms? You traveled whilst leaving some distance between you two. Well whatever, congratulations on reaching the goal.”</p><br/><p>And then the fairy pointed towards the inner parts of the tunnel.</p><br/><p>There was a dormant volcano’s crater that could be seen along with few tens of people who had already reached this place next to many weird-looking boats.</p><br/><p>Gyucheol cried out in joy after seeing this.</p><br/><p>“Uwahaha! Arrived! We’ve Arrived!”</p><br/><p>“Daddy! Thank you for your hard work!”</p><br/><p>As if Hansoo and Gyucheol were the last ones, as soon as they entered the tunnel closed with a thunk sound and the fairy which was at the entrance flew in.</p><br/><p>“Hello everyone. Welcome to the goal line. Heehee. Let’s see… there’s 75 alive right now? It’s good that not many died. You guys worked hard.”</p><br/><p>“…”</p><br/><p>Whilst everyone was grinding their teeth, the fairy smiled as it spoke again.</p><br/><p>“Since there’s 75 people, 75 tickets should be prepared right?”</p><br/><p>And then a ticket with strange patterns started to appear on the hands of the people.</p><br/><p>While the people were mumbling about the ticket, the fairy continued to talk.</p><br/><p>“If you get on that then you can get on the boat that leads you to the island above. You’ve done well. I will now tell you how to use the ticket.”</p><br/><p>“…?”</p><br/><p>Wasn’t it just that they had to get on the boat after handing it over.</p><br/><p>“Basically the boats you guys will get on is for three people”</p><br/><p>“…”</p><br/><p>“And of course three tickets must be gathered in order for it to work. Isn’t it so peaceful? Since its three tickets per three people, there’s no need to fight”</p><br/><p>Everyone sighed in relief at these words.</p><br/><p>Since that meant that all 75 people could go up.</p><br/><p>But Hansoo shook his head.</p><br/><p>There was no way that this would be it.</p><br/><p>And as he expected, the fairy continued to talk.</p><br/><p>“But it will be unfair if one person or two people pay three tickets and get treated like three people right? So we prepared something special”</p><br/><p>‘Goddamit, of course it won’t just let us go that easily…’</p><br/><p>The fairy made an amused expression as it looked at the people and spoke.</p><br/><p>“Firstly, if you hand in three tickets then you can go to any island you want. By the way, if you think that all the islands above are the same then that’s a huge misconception. Check the islands map in your pockets.”</p><br/><p>The fairy laughed and spoke as it saw a few people’s eyes shining.</p><br/><p>“If you hand in three tickets with two people then you can go together but you cannot decide where it goes. The boat will move randomly”</p><br/><p>At the fairy’s words, the eyes of the people who were comrades or partners changed.</p><br/><p>If they wanted to act together then they had to gather an extra ticket.</p><br/><p>“Lastly if you hand in three tickets as three people then you will get off separately. You can go up but you cannot be together. A situation like a family would be very very sad right? I hope if you are in a family of three that you can gather nine tickets to go to the island you want.”</p><br/><p>“This bitch…”</p><br/><p>Gyucheol spat out curses without control.</p><br/><p>Nine tickets for three people?</p><br/><p>What was this nonsense?</p><br/><p>It was hard to even protect one at this moment.</p><br/><p>He could see Hancheol and others watching with a fierce look from afar.</p><br/><p>And the fairy spoke in amusements without caring for such matters.</p><br/><p>“There should be about… 30 minutes left until the island collapses completely? Heehee. I guess only 25 boats are needed. I will separate the boats all around the crater. It won’t be fun if you just protect the area of the boat right? Ticket. You just need to gather three tickets with whichever method and then depart! Good luck!”</p><br/><p>The fairy disappeared after those words.</p><br/><p>And everybody’s faces started to stiffen.</p><br/><p>It was better to go together and even better if you could go where you wanted.</p><br/><p>So it was better the more tickets you had.</p><br/><p>If there were 6 in a party then 18 was optimal, 9 was ok and six was a worst case scenario.</p><br/><p>The people who had laid their decisions looked around for weak people.</p><br/><p>And Hancheol and the others who had been separated earlier looked at Gyucheol’s family with a smile.</p><br/><p>The other didn’t know but they did.</p><br/><p>A way to gain three free tickets.</p><br/><p>“Goddamnit…”</p><br/><p>Gyucheol cursed out.</p><br/><p>The boat was next to them.</p><br/><p>If they wanted to live then the three of them had to get on the boat at this instant.</p><br/><p>But if they get on the boat like that then they would be separated.</p><br/><p>Which meant his wife and daughter will die or face an even worse situation.</p><br/><p>‘Damn..what do I do?’</p><br/><p>The fact that they had come this far proved that they were strong.</p><br/><p>So there was nobody who could get their tickets stolen by him.</p><br/><p>And then Hansoo came into Gyucheol’s eyes.</p><br/><p>“Hansoo! Please give me your ticket!”</p><br/><p>“Hmm?”</p><br/><p>As Hansoo looked at Gyucheol, Gyucheol hurriedly smiled.</p><br/><p>“If we have your ticket then my wife and I can go together! And then please take my daughter. If you do so then our whole family can live!”</p><br/><p>Gyucheol shouted in despair.</p><br/><p>Since then he could take his wife with him and protect her a bit more.</p><br/><p>And their daughter will be protected by Hansoo so she will be able to live a bit longer despite being separated.</p><br/><p>If there are four people with six tickets then they can live a bit longer.</p><br/><p>“Please… You can save lives this way! You are strong so isn’t a piece of cake to gather two more tickets? You’re so strong! Please save our family!”</p><br/><p>‘Wow…he’s not a joke’</p><br/><p>Hansoo swirled his tongue at Gyucheol’s words.</p><br/><p>He had thought that he was very blunt but this was beyond imagination.</p><br/><p>‘He probably isn’t a fool that would grant that right?’</p><br/><p>But Hanchul was still worried so he started to run faster.</p><br/><p>Since if he did grant that then those tickets would be gone.</p><br/><p>“Hurry! Please!”</p><br/><p>Gyucheol, who saw Hanchul and the others charge at them,</p><br/><p>He had pleaded something that wouldn’t even come out because of his ego.</p><br/><p>And Hansoo’s eyes calmed down in a cold manner as he looked at Gyucheol.</p><br/>\n</div>"}