{"title": "Chapter 22: Sky Road (1)", "id": 22, "volume": 1, "url": "http://boxnovel.org/reincarnator-chapter-22-sky-road-1", "volume_title": "Volume 1", "body": "<h1>Chapter 22: Sky Road (1)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>The level of artifacts all differed.</p><br/><p>There were a lot of different bases to judge but the most important one was color.</p><br/><p>What kind of energy it can absorb.</p><br/><p>It could be an artifact that shows its full potential only if it uses the colorless energy in the colorless are or it could be an artifact that only shows its full potential if it uses the red area or energy of the blue area which came after the red area.</p><br/><p>Of course an artifact using a higher quality energy would be of a higher level so the level of the artifact changed with the color as the base.</p><br/><p>Colorless artifact, Red artifact and so on…</p><br/><p>Once you separate them into these levels they are further split up into different levels.</p><br/><p>Unless it’s an amazing artifact there was no way for it to be worth more than the artifact of a higher color.</p><br/><p>The high quality colorless artifacts were inferior to the low quality red artifacts.</p><br/><p>So even if you were somebody who flew around the area you were at you needed to slowly increase the standards of your artifact in the middle area and then go over.</p><br/><p>Since the weapons from the previous stage didn’t really work very well in the next stage.</p><br/><p>But sometimes, very unique artifacts came out.</p><br/><p>Growing Artifact.</p><br/><p>Their uniqueness was that they went through growth.</p><br/><p>Just like an adventurer absorbing runes and changing their tune from colorless to red and to orange, the artifact also absorbed something and improved its color.</p><br/><p>Not every Growing Artifact was expensive</p><br/><p>If it wasn’t as good as other artifacts despite you investing a lot into and growing it than it was better to just find a decent weapon the middle stage before going to the next stage</p><br/><p>But of cause Growing Artifacts also had different levels.</p><br/><p>The child of a dragon would be stronger than others at the age of one and be stronger than others at the age of ten, this gap would only get larger as they grew up.</p><br/><p>The Growing artifacts that improved like this and always stayed at the top were called </p><br/><p>It was sometimes called because it grew like a dragon, these were the strongest artifacts that even surpassed artifacts on higher levels of color.</p><br/><p>From number 1 to 999.</p><br/><p>999 items that the Manoros Clan, which were one of the nine pillars, had judged and chosen out with strictly, the strongest items of the ones found so far.</p><br/><p>It didn’t care whether it was a ring, an armor or a weapon.</p><br/><p>You put them in a line and then give them a number.</p><br/><p>From rank 1 to 9 were solo numbering.</p><br/><p>10 to 99 was double numbering.</p><br/><p>100 to 999 was triple numbering.</p><br/><p>These artifacts were usually famous by themselves but they would get even more famous depending on who used them.</p><br/><p>Because even if a weakling got lucky and obtained these, these would eventually fall into the hands of the strong.</p><br/><p>It was harder and more important to keep the artifacts of the otherworld than obtaining them.</p><br/><p>If you carry around an artifact too good for you than you lose both your life and the artifact.</p><br/><p>And solo numbering , was one of the strongest artifacts that got famous because of Kwang Goonju and something that had made him famous.</p><br/><p>Nicknamed [Absolute Ring].</p><br/><p>‘Kwang Goonju this guy. I wondered where he had obtained this…’</p><br/><p>It was extremely hard to obtain but it wasn’t that only one existed because it was a Numbering series</p><br/><p>Like how despite the strength of a dragon, there wasn’t only one of them.</p><br/><p>And that was the reason when the people saw Kwang Goonju cause a massacre they tried to find the ring in a manner that would’ve flipped the Otherworld upside down.</p><br/><p>Since the eight powers of the ring that came out when people were merely sketched by it turned them into rags</p><br/><p>And the high ranker’s weren’t an exception to this</p><br/><p>But this thing that could not be found anywhere was actually found here.</p><br/><p>‘Well yeah. If only Kwang Goonju had cleared this mission it’s correct that it’s something that cannot be obtained anywhere else’</p><br/><p>The tutorial area couldn’t be entered unless it was at this moment. There was a reason why the adventurers could not find it even if they wanted to.</p><br/><p>‘Very good’</p><br/><p>This place did not reward people because you cleared a hard objective.</p><br/><p>Since something that is hard to a weak person is easier than anything to somebody who is strong.</p><br/><p>The best rewards come out when a weak person clears an objective that seems impossible at that level.</p><br/><p>Just like the hidden piece where Hansoo killed the Carnivorous Beast.</p><br/><p>He had expected something like this to an extent. That the artifact he gained here was not something that could be easily thrown out in any of the colored regions.</p><br/><p>But who would’ve expected a Solo Numbering to come out.</p><br/><p>As soon as Hansoo put on the ring the ring shrunk to fit the size of Hansoo’s finger.</p><br/><p>A Growing Artifact that contained eight powers.</p><br/><p>It absorbed runes and growed, and every time it rose a level in color it would unlock another power.</p><br/><p>The current Nurmaha’s ring was a colorless artifact</p><br/><p>And because of that there was only one power unlocked.</p><br/><p>But Hansoo made a satisfied smile.</p><br/><p>‘This is it’</p><br/><p>The first power. </p><br/><p>It wasn’t simply a dispel magic that got rid of skills.</p><br/><p>It was an ability that could nullify anything from passive skills to even an individual’s trait.</p><br/><p>Of course it wasn’t that the person who got smacked would become a traitless person and lose tons of mana.</p><br/><p>The Otherworld wasn’t such a easy place.</p><br/><p>Just because you obtained a godly sword did not mean that you could become a sword master and just because of an artifact a rabbit could not become a dragon nor a pig become a dragon.</p><br/><p>And even if such things existed, these things won’t land in the lands of a rabbit or a pig.</p><br/><p>And even if it did land in their lands they won’t be able to use it because of limitations</p><br/><p>And even if they could use it, they won’t be able to protect it.</p><br/><p>To use it one needed to match the other person’s trait or when they use the trait and every time you used it it will cost mana, also the destroyed power will eventually come back.</p><br/><p>But the fact that you could cancel the enemy’s powers at the right time and in the right place was a huge advantage.</p><br/><p>Since by the the time their powers come back, they would’ve become a corpse.</p><br/><p>It wasn’t just a Draconic Series.</p><br/><p>It was called so because it was already amazing at the colorless stage.</p><br/><p>And this was a Growing Artifact, this was just the start.</p><br/><p>‘It seems like I will need a lot of runes from now on. Though I cannot use it properly yet’</p><br/><p>Hansoo touched his ears.</p><br/><p>[Kang Hansoo]</p><br/><p>Strength: 92.3</p><br/><p>Stamina: 88.8</p><br/><p>Agility: 47.1</p><br/><p>Perception: 50.2</p><br/><p>Mana: 22</p><br/><p>Magic Resistance: 13</p><br/><p>Though it was in its weakest state it was still a colorless artifact</p><br/><p>To use this thing properly, one’s runes needed to be at the colorless stage.</p><br/><p>You needed at least one colorless rune and it was better if they were all colorless.</p><br/><p>But the current him did not have any colorless rune.</p><br/><p>Hansoo pondered for a moment.</p><br/><p>To either make a colorless rune first or focus on achieving balance.</p><br/><p>There was eight cloud snacks left.</p><br/><p>Cloud snack did not work at the colorless rune stage.</p><br/><p>Hansoo, who was pondering, made a decision.</p><br/><p>‘Make one colorless rune first and then achieve balance’</p><br/><p>If it’s an enemy where he needed to use the colorless rune as well as the Nurmaha’s ring, it would be hard to beat him while his balance was off.</p><br/><p>And on the other hand if the enemy did not require him to use the Nurmaha’s ring then the colorless rune wouldn’t be needed as well.</p><br/><p>Hansoo, who had made his decision, started to walk out of the Altar slowly.</p><br/><p>………………………</p><br/><p>‘Not Bad’</p><br/><p>Hansoo mumbled as he looked at his stat screen on the seventh day.</p><br/><p>[Kang Hansoo]</p><br/><p>Strength (Colorless): 0.01%</p><br/><p>Stamina: 88.8</p><br/><p>Agility: 84.0</p><br/><p>Perception: 85.1</p><br/><p>Mana: 58.4</p><br/><p>Magic resistance: 13</p><br/><p>The strength had remained stationary at 0.01%</p><br/><p>He had decided that it was good to make one colorless rune in case of an emergency and made it but he could not raise it any further.</p><br/><p>Once it turned into a colorless rune then it would only increase after taking colorless runes.</p><br/><p>This was the same for Nurmaha’s ring.</p><br/><p>Since the colorless rune did not come out on the 1st tutorial area, he needed to obtain them from the second tutorial area from now on.</p><br/><p>Since in the colorless area, which was the basis for the second tutorial area, both colorless rune and normal runes came out in a good mix.</p><br/><p>Since both Strength and Stamina were in demand, hansoo invested by trading all his remaining strength and stamina runes into agility, perception and mana runes.</p><br/><p>Mana wasn’t needed for Hansoo who did not have a single skill but in order to use the Power Destruction freely it was better to have more mana.</p><br/><p>It was a win-win for everybody.</p><br/><p>Since agility, perception or mana runes could be traded for a higher price than strength or stamina so people who luckily found these runes quickly brought them to Hansoo and then raised their strength and stamina at a very fast rate.</p><br/><p>If Hansoo hunted alone then he would’ve never been able to make this balance in time.</p><br/><p>‘Well. I couldn’t finish all the missions’</p><br/><p>Because he had focused his time on hunting he could not finish all the missions but this did not matter much.</p><br/><p>Since he had obtained something more valuable than that.</p><br/><p>Taking everything wasn’t the important part.</p><br/><p>You just needed to take the core factors that will keep you above everyone else as you go up.</p><br/><p>Most people thought runes were important but runes weren’t always the core factors of strength.</p><br/><p>Beasts were everywhere so runes could be attained anywhere and since runes were fair to everybody it was hard to make a difference between others.</p><br/><p>Runes were important but the quality trait, skills and artifacts whose strength got multiplied by runes were more important.</p><br/><p>Runes would get stacked even if you just kill beasts weaker than you.</p><br/><p>But the three factors above wasn’t like that. Rare things were limited and because of that gaps would be created.</p><br/><p>‘Six cloud snacks are left… I filled the food pouch with Goblin Jerky. The Needle has been sharpened well too.’</p><br/><p>Hansoo checked the people afar as he checked his belongings.</p><br/><p>Though they had gone through a lot in a week, it felt short to some people and long to some people to the point their eyes have changed while some others were still struggling about.</p><br/><p>And in the middle of those people he could see Mihee and Sangjin but he did not make any gestures to get their attention.</p><br/><p>Since they will get separated soon.</p><br/><p>‘Well. Let’s greet each other with smiles when he meet again’</p><br/><p>A fairy appeared through the rip in the air above Hansoo who was checking this and that.</p><br/><p>“Everyone! You’ve worked hard for a week! You’ve probably guess it by now but there are many people like you outside!”</p><br/><p>“…”</p><br/><p>“You will now start the second tutorial! The place you guys will live on from now is .”</p><br/><p>‘…A way up towards the sky huh’</p><br/><p>It didn’t matter where they went.</p><br/><p>The thing they were curious about was something else.</p><br/><p>“How many will live there?”</p><br/><p>The fairy smiled at this.</p><br/><p>“A little bit over ten thousand I think. You will be there for three months”</p><br/><p>“…”</p><br/><p>“It will be much more fun when you get there. It was hard until now playing with only a hundred people right? How fun would it be playing with ten thousand people. You will make a lot of friends too. Isn’t it fun just thinking about it?”</p><br/><p>Everyone’s face crumpled at the fairy’s words.</p><br/><p>Even a hundred was this tiring, but ten thousand at least.</p><br/><p>And there was a lot of unprecedented things in this one week.</p><br/><p>They couldn’t even imagine how many things the fairy would do in that three months.</p><br/><p>The fairy spoke after watching that scene happily.</p><br/><p>“There’s exactly 10842… you will start with around 10 to 11 people”</p><br/><p>Everyone started mumbling about and then quickly started to group with close friends.</p><br/><p>Of course 11 was better than 10.</p><br/><p>And the stronger the people, the better it was.</p><br/><p>The strongest and most trustworthy ten had to group.</p><br/><p>“Miss Mihee! Take me please!”</p><br/><p>“Sangjin! I’m pretty useful man! Take me!”</p><br/><p>“This bitch! You ignored us until now! Get Lost!”</p><br/><p>The fairy laughed at the chaos below.</p><br/><p>“Ahahahaha! You don’t need to be like that.”</p><br/><p>“…?”</p><br/><p>“It’ll be random. Work hard everyone!”</p><br/><p>And as soon as those words ended, the remaining 47 were all warped from the first tutorial area.</p><br/><p>To one of the random starting areas of the 2nd tutorial area, Sky Road.</p><br/><p>Translator’s Note</p><br/><p>As everybody can see 47 does not divide evenly in 10s and 11s, this is because the group of 10 and 11 are pulled from multiple tutorial areas and not just theirs. So 10 and 11 out of 10842… there are a lot of combinations of 10s and 11s but I guess the easiest is having 2 groups of 11 and 1082 groups of 10s right? Math Major’s thoughts at its finest</p><br/><p>KobatoChan’s Note</p><br/><p>Instead of doing some Maths, you should translate more.</p><br/><p>By the way guys, starting with this chapter, there’s no need to try asking us for raws as you have to go through a paywall in the original site (Munpia).</p><br/><p>And also, you can’t MTL as Munpia upload text under flash form, so you can’t copy the text at all.</p><br/><p>A donation would be truly grateful also for the hard-working staff. Thank you.</p><br/><p>PS : sorry for the mess, got the order of the chapters crossed xD</p><br/>\n</div>"}