{"title": "Chapter 36: Demon Lord’s Castle (3)", "id": 36, "volume": 1, "url": "http://boxnovel.org/reincarnator-chapter-36-demon-lord%E2%80%99s-castle-3", "volume_title": "Volume 1", "body": "<h1>Chapter 36: Demon Lord’s Castle (3)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Hyunwoo gulped his saliva as he looked between Hansoo next to him and the giant door made of bones in the distance.</p><br/><p>“Hansoo. You at least feel good. Since you can escape during times of crisis because you have the crystal.”</p><br/><p>And then Hansoo chuckled at Hyunwoo who was looking at him enviably.</p><br/><p>“Don’t worry. I’m not going.”</p><br/><p>“Yeah? Well. Logically speaking, you’re probably here because you have something to gain.”</p><br/><p>Hansoo chucked as he looked at Hyunwoo who was mumbling ‘Because you’d gone up if that wasn’t the case.’</p><br/><p>‘Well. Those words are right.’</p><br/><p>It was better for him to go up then to stay down here since he wasn’t a Clan Lord who logically had to save everybody.</p><br/><p>Since the hunting efficiency here was rather low.</p><br/><p>The only runes that came out were from killing the Demons but the amount they dropped wasn’t really satisfying it if you take into account their strength.</p><br/><p>Some people who have already fulfilled the requirements of other islands rather quickly were probably already roaming around the most attractive area out of the islands above, The .</p><br/><p>Since this fact was already on the Island Maps.</p><br/><p>But he hadn’t come here for such things from the start.</p><br/><p>‘Demonic Jade Crystal.’</p><br/><p>If he didn’t obtain the from the end of the Demon Lord’s Castle then there was no point even if he got to the end of the final dungeon.</p><br/><p>He wouldn’t have known its existence without Eres.</p><br/><p>Eres wasn’t in the condition to utilize it properly but he could pull out all the power from the Demonic Jade Crystal.</p><br/><p>He had come here for the Demonic Jade Crystal, the Judgement and Justice of Dekrados were merely part of the process.</p><br/><p>‘About 21 crystals collected.’</p><br/><p>Also, if he were to hunt with ease then he could probably obtain the Justice of Dekrados also.</p><br/><p>“It kind of seems like the Clan Lords don’t like you much. Is it because you’re strong?”</p><br/><p>There was no reason to hate Hansoo in Hyunwoo’s eyes.</p><br/><p>He helped others well, was diligent in his own part of the work and felt very secure because he was strong.</p><br/><p>There were basic rules and he was very diligent in following them.</p><br/><p>The reason why the non-clansmen had followed him at the start was because of this.</p><br/><p>Though they had all split up now.</p><br/><p>Hansoo chuckled as he spoke.</p><br/><p>“Well there’s that but…it’s as you say. They just don’t like me.”</p><br/><p>The road was long and they didn’t know when an enemy will appear.</p><br/><p>If they thought logically then they had to combine their strength in order to defeat the enemy.</p><br/><p>But Lords were a little different.</p><br/><p>Historically speaking, it wasn’t that the kings did not slash off the necks of capable generals because there was an enemy.</p><br/><p>Lords instinctively hated people who didn’t work in their way.</p><br/><p>Lord of a Clan.</p><br/><p>As soon as you awake the trait , you realize it instinctively.</p><br/><p>That your words became the law and the rules within this household.</p><br/><p>He didn’t know himself but according to the words of Eres, it was a very addictive and amazing feeling where you are living in the modern society and then getting into a situation where others had to listen to your words.</p><br/><p>And they tried to increase the number of their clan because of this.</p><br/><p>To increase their influence inside and outwards as well as to apply the rules they created.</p><br/><p>The reason why the Lords increased their power wasn’t just for survival.</p><br/><p>But who would like it when somebody else were to come and then tell them to follow different rules.</p><br/><p>It was a different problem from their own rules being right or wrong, he, who was an , couldn’t have a good relation with Lords from the start.</p><br/><p>‘Well they might not be able to judge things reasonably.’</p><br/><p>The Lords who had been around for tens of decades were growing impatient because they couldn’t kill him.</p><br/><p>The fact that the ones who just became Lords were around him and were suppressing themselves was even more amazing.</p><br/><p>Since reason and emotion are different from the start.</p><br/><p>And when somebody sets their mind on something, they’re bound to create some reason for it in their head.</p><br/><p>‘They still need to grow a lot.’</p><br/><p>A new ability.</p><br/><p>And a new world where they can use it freely.</p><br/><p>It was obvious that they wanted to swing around the fascinating new sword that they had obtained.</p><br/><p>And getting angry was normal since they met somebody which their sword, which usually worked well, didn’t work against.</p><br/><p>But they needed to see more and hear more.</p><br/><p>And they had to realize that this was just the start.</p><br/><p>And that was why they needed to escape the tutorial area in order to survive.</p><br/><p>The most important quality of a Lord wasn’t suppressing the other Lord.</p><br/><p>Suppressing oneself and knowing how to work with other Lords was the most important thing.</p><br/><p>Even Kwang Goonju and the Lord of Dark Angler weren’t self-assertive.</p><br/><p>‘Well. It’s a little early for them to know of it. Anyways, I should try a little bit harder.’</p><br/><p>What would he do by showing off his strength against baby Lords in the tutorial area.</p><br/><p>The people here were people who came from living in the real world and had only been here for about a month.</p><br/><p>They might look at him in a marvelous way but if Hansoo wasn’t able to do at least this much then Kangtae would’ve probably went overboard.</p><br/><p>His real rivals were people who have been here for a few years or even 20 years while going through all sorts of hardships from square one.</p><br/><p>People who had broken through a tutorial like this over 10 or so years ago and had been roaming around the Otherworld for a long time.</p><br/><p>His goal wasn’t to be ahead of others by 1 to 2 years.</p><br/><p>He had to catch up to 20 years between him and them.</p><br/><p>Hansoo loosened up the tension in his body as he approached the first gateway, the Door of Bones.</p><br/><p>‘The time it will take to eat up the rest of the members will be about 3 days… it seems it’ll take a while.’</p><br/><p>The non-clansmen couldn’t follow him.</p><br/><p>They will receive more damage than usual as the environment gets harsher if they did not have the commands of a Lord.</p><br/><p>And that was why he induced the Clan Lords to absorb them back in.</p><br/><p>Since it seemed like most members had been absorbed into the clans, things were doable.</p><br/><p>‘Let’s have a look here.’</p><br/><p>They’ll have some sort of an image as they see how he deals with the Gatekeeper.</p><br/><p>Hansoo smiled at Hyunwoo then slowly walked forward.</p><br/><p>…………………………………</p><br/><p>Guktae frowned as he looked at the giant door in front of him.</p><br/><p>A giant door that seemed like it was made of hundreds of thousands if not millions of bones.</p><br/><p>One could see that from the door that reminded of France’s Arc de Triomphe, a fearful aura was coming off from it.</p><br/><p>‘Let’s see… the remaining number is 1200.’</p><br/><p>100 died in 3 days.</p><br/><p>From one’s view it was merely a trivial loss.</p><br/><p>This was a result that came off from Hansoo and the Special forces fighting the Demons competitively.</p><br/><p>If both of them were slugging about then the damage would have skyrocketed.</p><br/><p>‘Well. Since they have almost absorbed them all.’</p><br/><p>As people saw that Hansoo didn’t care about keeping them safe and was focused on hunting the Demons, they all ran and joined the clans.</p><br/><p>They had all realized.</p><br/><p>Though Hansoo can hunt all the Demons with his body alone, that he could not defend them from the attacks of countless mages</p><br/><p>If they didn’t go into the clans then the special forces wouldn’t defend them and then they’ll be wide open against the attacks of the mages.</p><br/><p>Though the people who had survived from Hansoo hunting the Demons were hundreds, being safer was the better option.</p><br/><p>While Guktae was making a satisfied expression, a familiar existence appeared in front of the Giant Door.</p><br/><p>“Hello everyone. Welcome to the first of the three doors, the Door of Bones.”</p><br/><p>There wasn’t any other name that more befitting.</p><br/><p>The fairy who had seen the people’s expressions nodded.</p><br/><p>“It’s very simple. Do you see the giant door over there? You just need to get past it.”</p><br/><p>“…It’s closed.”</p><br/><p>The giant door that the fairy pointed to was firmly closed.</p><br/><p>But then climbing the walls that stretched tens of meters next to it seemed impossible.</p><br/><p>No, if they were meant to be climbed then why would the door exist.</p><br/><p>‘We don’t even know if the fairy might kill us as an example on the way up.’</p><br/><p>Their lives were too precious to test climbing up the wall when they could just talk it out.</p><br/><p>The fairy laughed as it spoke.</p><br/><p>“Eehee. You need to pay a passing fee.”</p><br/><p>Everyone made a bitter expression at those words.</p><br/><p>“What do we need to pay with?”</p><br/><p>The fairy shrugged as it spoke.</p><br/><p>“What else. The crystals on you guys. Crystals. Just pay 30. Then it’ll be a free pass.”</p><br/><p>“…”</p><br/><p>Curses almost exploded out from their mouths.</p><br/><p>The sum total they had hunted in the past 3 days was 50.</p><br/><p>And there were only about 30 in their possession.</p><br/><p>But for them to pay 30 crystals in order to open a door.</p><br/><p>Which meant they had to hand over their lives too.</p><br/><p>The reason why they were able to plan things about while trying so hard was because they had a backup plan which came from the crystals.</p><br/><p>The , which was right above the Central Island, was shown on the Islands Map and was told to have even more opportunities than now.</p><br/><p>The reason why the name Central Island was given was because it was an island right below the Tower.</p><br/><p>And they, who had already gained a lot in the central island, could still look out for opportunities even if they go up with heavy losses.</p><br/><p>But if they lose the crystals then they would have to give up on all of those opportunities.</p><br/><p>And the fairy had told them clearly.</p><br/><p>That there were 3 doors.</p><br/><p>Which means there was a chance that they will get robbed 2 more times like this from now.</p><br/><p>Guktae struggled to maintain his expression and then spoke.</p><br/><p>“Is there a way to pass without paying?”</p><br/><p>The fairy nodded at those words.</p><br/><p>“Simple. You need to kill the Gatekeeper.”</p><br/><p>“…Gatekeeper.”</p><br/><p>“Yes. Gatekeeper.”</p><br/><p>As soon as the fairy’s words ended, a fearful vibration started to ring throughout the ground.</p><br/><p>The origin of the vibration was the door in front of them.</p><br/><p>Kadududuk.</p><br/><p>Udududuk.</p><br/><p>The hundreds of thousand if not millions of bones that had made up the door mixed and intertwined as it turned into something giant.</p><br/><p>“…Wolf?”</p><br/><p>Somebody spoke out in dismay as they saw the giant wolf that stretched 50m long from head to its tail.</p><br/><p>Grrrrrrrr.</p><br/><p>Though it was made of bones, there were blue flames burning from its eyes.</p><br/><p>And this was from 30m above them.</p><br/><p>It was only 30m on paper, it felt like a building was standing up and growling at them.</p><br/><p>It didn’t even squeak like the weak skeletons.</p><br/><p>Since the number of bones that its body consisted of was too many to do so.</p><br/><p>The people made fearful expressions as they saw the giant black wolf made of bones that were polluted black.</p><br/><p>The fairy laughed as it saw those people.</p><br/><p>“Here. There isn’t a moon anymore right? If you aren’t going to pay then you just need to walk beneath it.”</p><br/><p>Grrrrrr</p><br/><p>The people gulped their saliva as they gazed at the giant Wolf.</p><br/><p>“…How about giving 30 crystals?”</p><br/><p>“Yeah. How are we going to…”</p><br/><p>30 crystals.</p><br/><p>A number that could only be gained if they killed 30 demons.</p><br/><p>It actually looked as strong as 30 demons.</p><br/><p>And that was the problem.</p><br/><p>They had hunted 50 of them by killing them 8 or 9 at a time but 30 of them charging at them at once was of a different dimension.</p><br/><p>The Clan Lords made bitter expressions as they looked at each other.</p><br/><p>There weren’t any crystals on the few remaining non-clansmen.</p><br/><p>Which meant that they had to pay 30 crystals.</p><br/><p>No, another person did exist.</p><br/><p>He didn’t have as much as them but someone in possession of a lot of crystals.</p><br/><p>They looked at Hansoo as they spoke.</p><br/><p>“Let’s pay the crystals together.”</p><br/><p>That thing was too burdensome no matter what.</p><br/><p>Hansoo shook his head.</p><br/><p>“We need to fight it.”</p><br/><p>“…what?”</p><br/><p>Everyone’s expressions froze.</p><br/><p>‘Damn… does he mean it’s not worth it.’</p><br/><p>Guktae frowned inwardly.</p><br/><p>But it made sense that it wasn’t worth it.</p><br/><p>They were 1200.</p><br/><p>On the other hand, he was alone.</p><br/><p>It was possible that he would feel wronged if he had to burden part of the 30.</p><br/><p>But they couldn’t act recklessly.</p><br/><p>The situation would become very complicated if he decides to go up when they try to force him with strength.</p><br/><p>“We aren’t telling you to pay all 30. Just a part of it…”</p><br/><p>Hansoo thought quietly inwardly while listen to those words.</p><br/><p>‘Eres. I really think you are extremely amazing.’</p><br/><p>Eres had saved 600 out of 1000 people and ascended.</p><br/><p>Surprisingly, Eres managed to have less than 30 deaths before they reached the Door of Bones.</p><br/><p>The thousand people Eres had numbered a little less but were much more formidable than the ones here.</p><br/><p>Like steel which got stronger as you hammered it, people who were strengthened from 20 days of fighting without rest.</p><br/><p>They had good synergy, kept on fighting against the demons and continuously reinforced their Battle Power from crystals.</p><br/><p>And the only action that Eres had regretted in the central island.</p><br/><p>Eres was scared of people dying while fighting that giant thing so she had paid the crystals she had gathered to pass it.</p><br/><p>And because of this, she had to pay crystals on the next gateway too.</p><br/><p>Since she had already given the crystals once and could not reinforce their battle powers with those crystals.</p><br/><p>And the same with the next gateway as well.</p><br/><p>And after she had arrived at the Giant Crystal at the Demon Lord’s Castle at that pace, she had lost 400 out of 1000 people during the final battle.</p><br/><p>No, It ended with 400 because of luck.</p><br/><p>If they pass through something sweetly once in this world, then it’ll just come back with interest and Eres had felt this through pain in her bones.</p><br/><p>‘It seems like I’ll need to make some extra explanations.’</p><br/><p>Hansoo mumbled inwardly as he saw everyone’s frozen expressions.</p><br/><p>KobatoChan’s Note</p><br/><p>The Reincarnator’s “Regular” chapters are scheduled for the Wednesday, Friday, Sunday and/or Saturday. Otherwise, sponsored chapters (if there are)</p><br/><p>Thank you.</p><br/>\n</div>"}