{"title": "Chapter 41: Demon Lord’s Castle (8)", "id": 41, "volume": 1, "url": "http://boxnovel.org/reincarnator-chapter-41-demon-lord%E2%80%99s-castle-8", "volume_title": "Volume 1", "body": "<h1>Chapter 41: Demon Lord’s Castle (8)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Sangjin laughed as he thought of the conversation he had with Hansoo before they got separated in the first tutorial area.</p><br/><p>. You need to do … And then get to the Island of the Tower fast and wait at the … for me. If some people say my name then let them live and if they don’t then kill them. If nothing comes out by the 32nd day then just move out.&gt;</p><br/><p>Sangjin made an astonished expression as he swung his sword.</p><br/><p>At first he wasn’t sure.</p><br/><p>Since nothing had happened despite it being 3 days since he started waiting here while hunting.</p><br/><p>But they had really come.</p><br/><p>And in a very weird way too.</p><br/><p>‘Is it teleportation?’</p><br/><p>Sangjin didn’t really know about that but he believed in the words of Hansoo.</p><br/><p>‘It’s probably that psychic power again. And it seems like I won’t have to worry about whether I should kill them from the way they’re talking.’</p><br/><p>He didn’t know their identities but everyone here had to die with one order from that guy over there.</p><br/><p>Sangjin started to hack crazily at the clansmen who had appeared in front of him in a mess.</p><br/><p>Ssssgggk</p><br/><p>“Kuaaaak!”</p><br/><p>“Ahhk!”</p><br/><p>‘Well… though there’s a lot of them, they’re a total mess.’</p><br/><p>And the might of the skill that he obtained from the location Hansoo had told him was amazing.</p><br/><p>‘It might’ve been a little hard without this.’</p><br/><p>A large amount of runes, skills and artifacts dropped every time he slashed.</p><br/><p>These were people of the strongest special forces and Lords with expensive artifacts.</p><br/><p>It was reasonable for them to drop a lot.</p><br/><p>Sangjin used a moment of carelessness to slash one and then stole the weapon of another only to swing it around crazily.</p><br/><p>“This crazy bastard! Who are… kuuk!”</p><br/><p>“Talk too much.”</p><br/><p>Guktae tried to run backwards but his head was cut off in the end.</p><br/><p>‘It seems like a few things these guys drop seem more valuable than the others.’</p><br/><p>Sangjin shrugged his shoulders as he looked at them.</p><br/><p>He wasn’t really tempted.</p><br/><p>Since the Shadow Technique was a great gift by itself.</p><br/><p>‘But he had told me to keep these things. Let’s see. Since they came before the he had told me to get, the next is…’</p><br/><p>Sangjin smiled at the shadows swaying around him and then disappeared into the dark forest after picking up all the artifacts and runes.</p><br/><p>……………………………</p><br/><p>Kudududk</p><br/><p>“Dammit! Keep the formation!”</p><br/><p>“Fuckers! If you want to live then hold on more! Hold onto another 5 minutes!”</p><br/><p>The people had cleared up and were chopping apart the undead crazily.</p><br/><p>And the two clans were throwing attacks ruthlessly around Hansoo.</p><br/><p>Their numbers had decreased rapidly in a short time and only 600 were left.</p><br/><p>‘Dammit… Is it almost done now?’</p><br/><p>Taejin took a deep breath as he thought of what happened earlier while grinding his teeth.</p><br/><p>Right after Guktae went up.</p><br/><p>People’s symbols disappeared and the control over them had disappeared.</p><br/><p>And the chaos that had come after.</p><br/><p>It wasn’t that the people turned into emotionless puppets after receiving the symbol.</p><br/><p>It’s just that they would act normally and only when they receive an order from the Lords would they move to follow the orders the best they could.</p><br/><p>They had known the current situation clearly and had realized what they needed to do in order to survive as soon as the symbol disappeared.</p><br/><p>They started to struggle in order to buy time while creating distance between them and the Demon Lord.</p><br/><p>Taejin had wondered what this scene was at first.</p><br/><p>‘Did Guktae kill them all? Then… Why did he take them up?’</p><br/><p>There were tons of things that were unclear but this wasn’t the important part.</p><br/><p>Hansoo, Yerin and Taejin started to repair the formations quickly.</p><br/><p>And they had reached the current situation.</p><br/><p>About 400 people were chopping apart the undead crazily and Yerin and Taejin’s clans were assaulting the Demon Lord whom Hansoo had tied up.</p><br/><p>The two clans were fighting much better than he expected.</p><br/><p>The two clans were made of special forces who had filled up the spots after they had sent out part of the normal clansmen.</p><br/><p>A decision which was made due to the dire situation.</p><br/><p>If the special forces didn’t participate in the fight then they would all die.</p><br/><p>They had slowly increased to number around 130 but Guktae’s special forces had left and a few had died so the remaining 100 had been absorbed into Yerin and Taejin’s clans.</p><br/><p>In a normal situation they had to receive the symbol with an agreement from both sides.</p><br/><p>And the special forces were actually reluctant to join the clans.</p><br/><p>Since they will be ordered around by others and will have to fight against the Demon Lord.</p><br/><p>If only Hansoo didn’t speak to them:</p><br/><p>&lt;…&gt;</p><br/><p>15 minutes was enough time for that thing to smash apart the remaining 600 people.</p><br/><p>So the special forces received the symbols almost by forcing themselves.</p><br/><p>Since they realized that there was no other way.</p><br/><p>And as Hansoo and the two clan Lords blocked off the Demon Lord completely, the remaining non-clansmen started to fight against the undeads.</p><br/><p>They couldn’t run away anyway and fighting undeads was much less of a burden.</p><br/><p>With the two thoughts of it being doable and there being no other choice, the people started to fight much more actively in the front.</p><br/><p>Kududuk.</p><br/><p>Udududk.</p><br/><p>“Hold the line for a little longer!”</p><br/><p>Taejin shouted urgently as he looked at the almost-killed Demon Lord.</p><br/><p>It was much easier to fight since the Clan Lords saving their own bodies had disappeared and their special forces were now under them.</p><br/><p>While Hansoo was pulling the Demon Lord’s aggro and suppressing it, the 100 special forces controlled by the Clan Lords were assaulting it with attacks.</p><br/><p>If they continue at this pace for 10 more minutes then they could kill it without problems.</p><br/><p>But Taejin’s mind was urgent.</p><br/><p>Since 10 minutes was too long of a time.</p><br/><p>‘Dammit… the Crystal will open up soon.’</p><br/><p>The only reason why they were able to focus on the fight with the Demon Lord was because the non-clansmen were blocking off the undead that the Demon Lord summoned.</p><br/><p>What would the non-clansmen do when the crystal opened up?</p><br/><p>Would they simply go ?</p><br/><p>They will all run away while they are fighting against the Demon Lord.</p><br/><p>They couldn’t back off before they could kill the Demon Lord anyway.</p><br/><p>Hansoo and the two special forces were in a balance with the Demon Lord so if one of them were to back off then the remaining two will suffer greatly.</p><br/><p>They would get picked off one at a time then.</p><br/><p>And the others will all escape during that time.</p><br/><p>At this moment a giant ray of light shone in the distance.</p><br/><p>‘Fuck. If it’s going to open at least open quietly.’</p><br/><p>A light had come out from the Crystal which was so large that wherever one was in the island they could see it and know the portal opened.</p><br/><p>And at the same time the Crystal that was embedded on the ground floated up as a black hole, which could be identified as a portal with a glance, opened up in the center of the Crystal.</p><br/><p>The people who had seen the hole stopped.</p><br/><p>They glanced at each other and then started to madly charge towards the Crystal.</p><br/><p>“Fuck! Don’t Block it!”</p><br/><p>“Daaammitt! I’m going up!”</p><br/><p>Chaos.</p><br/><p>Casualties were occurring during this time but the people were heading towards the Crystal fervently anyway.</p><br/><p>‘Dammit…’</p><br/><p>As the non-clansmen stopped focusing on the undead, the remaining undead started to slowly gather around the Demon Lord.</p><br/><p>“Dammit… do we really have to kill that thing? Let’s get out!”</p><br/><p>Hansoo shook his head at Taejin’s words.</p><br/><p>If they leave recklessly in such a situation then they would receive a huge amount of casualties.</p><br/><p>If they run towards the Crystal then the Demon Lord would chase them and kill off everyone who was focused on running away.</p><br/><p>It needed to be finished off now.</p><br/><p>Hansoo chuckled as he saw them.</p><br/><p>Taejin sighed roughly as he saw this.</p><br/><p>“Dammit… Then take the Demon Lord in front of the crystal! Wouldn’t the non-clansmen have to fight against the Undead then?”</p><br/><p>If their escape route was blocked then they would come to their senses and attack the undead again.</p><br/><p>But Taejin soon realized that such a thing would be hard to accomplish.</p><br/><p>It would take too long to drag the Demon Lord in front of the Crystal in the distance with no casualties.</p><br/><p>And on the other hand if they were to bring the Demon Lord in front of the Crystal before the non-clansmen left then the amount of casualties would become huge.</p><br/><p>If too many of the Special Forces die then the Demon Lord would become too hard to kill even if the undead problem was gone.</p><br/><p>Hansoo laughed at these words.</p><br/><p>Since he never thought such a thing wouldn’t happen.</p><br/><p>It isn’t possible to bring the Demon Lord in front of the Crystal.</p><br/><p>But the opposite was possible.</p><br/><p>“Wait for a moment.”</p><br/><p>Hansoo, who had thought of the words of Eres, grabbed onto the scythe part of which was tied onto the Demon Lord and then started to run towards the Crystal at an extreme speed.</p><br/><p>Papapapak.</p><br/><p>Endless amounts of daggers were thrown out of Hansoo’s hands and Hansoo jumped from dagger to dagger as he charged towards the Crystal.</p><br/><p>The undead tried to attack from below but the height at which Hansoo was running was too high.</p><br/><p>And soon he arrived at the Crystal and then started to tie up the Crystal with the chain after laughing at the people running towards it.</p><br/><p>“Uhh….Uhhhh? What are you doing!”</p><br/><p>“Hey!!”</p><br/><p>Hansoo spoke as he looked at them:</p><br/><p>“Let’s combine our strengths guys.”</p><br/><p>As soon as his words ended the Demon Lord shook his body with an enraged scream.</p><br/><p>Kuuaaaangg!</p><br/><p>And then the Crystal, which was floating in the air, started to get pulled by the immeasurable amount of force and started to fly off.</p><br/><p>If the Crystal was embedded on the ground then the chain would’ve snapped.</p><br/><p>Since the Demon Lord’s strength was that fearsome.</p><br/><p>But the chains didn’t snap because the Crystal was floating in the air and the Crystal, which could not resist the strength of the Demon Lord, flew towards it.</p><br/><p>Kuuuung</p><br/><p>‘It’s hard. It won’t break with this much then. I wonder if I can take it closer.’</p><br/><p>Maybe it was due to the fact that it could transport more people, the Crystal in the Demon Lord’s Castle was much sturdier than the Crystal at the Castle.</p><br/><p>Hansoo followed behind it as he pushed it.</p><br/><p>And when the Crystal neared the battlefield he untied the chain around the Crystal.</p><br/><p>Hansoo laughed because if you take into account the Crystal’s hardness then it was safe from destruction from the Demon Lord but it was in a location where one could not recklessly run into the portal.</p><br/><p>“No free rides. Work your worth.”</p><br/><p>Hansoo ended his words and then charged towards the Demon Lord again and the faces of the non-clansmen who were heading towards the Crystal turned dark.</p><br/><p>Since it looked like they would get swept up if they tried to go for the Crystal.</p><br/><p>No, the people fighting there wouldn’t allow them to do so in the first place.</p><br/><p>Taejin sighed as he looked at this scene.</p><br/><p>Since now it looked like they could kill the Demon Lord.</p><br/><p>‘We’re finally going up. Did Hansoo say he was going to the Island of the Tower?’</p><br/><p>Wherever they went they were able to leave this damnable Central Island.</p><br/><p>Taejin stared at Hansoo but then threw away unnecessary thoughts as he focused at the Demon Lord in front of him.</p><br/><p>…………………………………………</p><br/><p>“Hmm… Guktae died.”</p><br/><p>As one guy muttered while sitting on top of a giant beast, the woman next to him smirked as she spoke:</p><br/><p>“I told you already. Don’t place your trust in such half-wits.”</p><br/><p>Why would they sent a guy like him when they had plenty of people with ability?</p><br/><p>“No. He did a good job. Far beyond what I had told him.”</p><br/><p>Guktae had done more than he asked.</p><br/><p>Only an unexpected event occurred at the last second.</p><br/><p>“Heh?”</p><br/><p>While the woman made an expression of curiosity, the guy, Wongyung, laughed as he shook his head.</p><br/><p>“It’s nothing. We’ll meet eventually. Let’s not worry about it and focus on what we were doing.”</p><br/><p>‘Are Hansoo and that masked guy related in some way?’</p><br/><p>Lord Wongyung mumbled inwardly but then shook his head.</p><br/><p>Guktae did tell him that the location which one arrived at using the Mini Crystal was fixed.</p><br/><p>But how would Hansoo know the location of such a place and send somebody of his own there.</p><br/><p>There was no possibility of such a thing.</p><br/><p>If Wongyung had such an information then he would also have done that.</p><br/><p>‘Well. It doesn’t matter.’</p><br/><p>He didn’t know about the guy with the strange mask but he would soon meet that Hansoo guy.</p><br/><p>“Let’s prepare ourselves.”</p><br/><p>The woman who was standing next to Wongyung nodded and then shouted loudly:</p><br/><p>“Surround this area and prepare your skills! And then hide! Until they all cross over!”</p><br/><p>Wongyung’s clan which was made of 100 people.</p><br/><p>They only had 85 currently because 15 were somewhere else but their battle power was much greater than normal clans.</p><br/><p>Since while the others were killing beasts in a fair manner, these guys were killing people and had stolen their artifacts and runes.</p><br/><p>And the people who come up from below would be a huge mess.</p><br/><p>They couldn’t lose such a great opportunity.</p><br/><p>‘I wasn’t like this originally… it seems like I’ve changed after I’ve gotten the Symbol.’</p><br/><p>The woman finished her thoughts as she asked Wongyung:</p><br/><p>“Anyway, did you say that they would come this way if you wait here?”</p><br/><p>“At least the people coming up from the Central Island will?”</p><br/><p>It seemed like the Warp gates to the Tower was different for every island below and were spread around the Tower Island.</p><br/><p>But if his calculations were correct then the Warp gate which connected with the Central Island below was this one.</p><br/><p>Since it looked like the Warp gates were set up so the path was a straight line from the Island of the Tower to the other island.</p><br/><p>Others were like that too.</p><br/><p>Not everyone will come here but there’ll be quite a number who will.</p><br/><p>Since going through the Island of the Tower was the most efficient according to the Islands Map.</p><br/><p>‘Tsk. If he had taken care of everything below then I wouldn’t have to do such a thing…’</p><br/><p>He wanted to kill them off one by one by waiting in front of the portal but then if a clansman came up the others below would know of it and everyone would stop coming up.</p><br/><p>It had become much more tedious because two Lords had survived.</p><br/><p>They had to wait as much as they could and then kill them off when enough people grouped up.</p><br/><p>‘Well… I can’t kill them all but…’</p><br/><p>It wasn’t bad for something you could gain by waiting a little bit.</p><br/><p>They just needed to kill as many as they can and then go into the Tower.</p><br/><p>Since there will be plenty of chances.</p><br/><p>‘I’m not sure how many will come up but… hurry and come. It’ll be nice if that Hansoo guy is there too.’</p><br/><p>Wongyung laughed coldly.</p><br/><p>KobatoChan’s Note</p><br/><p>The Reincarnator’s “Regular” chapters are scheduled for the Wednesday, Friday, Sunday and/or Saturday. Otherwise, sponsored chapters (if there are)</p><br/>\n</div>"}