{"title": "Chapter 56: Calamity Fish Hunting (1)", "id": 56, "volume": 1, "url": "http://boxnovel.org/reincarnator-chapter-56-calamity-fish-hunting-1", "volume_title": "Volume 1", "body": "<h1>Chapter 56: Calamity Fish Hunting (1)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Kuuuuuuuu.</p><br/><p>Camille Rowe mumbled quietly as she looked at something gigantic in the distance.</p><br/><p>‘It’s coming this time too.’</p><br/><p>The newcomers wouldn’t be able to see yet but her skill that was fitted for the perception stat at the Red Rune level 50% allowed her vision to see things extremely far away.</p><br/><p>Camille, who had been shaking her head, looked at the things she had prepared so far.</p><br/><p>‘Arukal’s Poison and Ketelan’s Sword. Miron Dagger and Waterproof sheet. And…’</p><br/><p>Camille Rowe, who had been looking over the things she had prepared while grinding her teeth, sighed as she looked at the fins that could be seen in the distance.</p><br/><p>‘…Could I really avenge them?’</p><br/><p>She had been holding onto her life with the sheer determination to kill that thing for over 3 years.</p><br/><p>But there only one thing she had gained from this.</p><br/><p>Endless fatigue.</p><br/><p>‘It’s tiring.’</p><br/><p>It was basically larger than a mountain.</p><br/><p>There was probably no other organism that fit the name of Fish of Calamity better than that.</p><br/><p>She had went into and returned back alive from within its body over 13 times but this wasn’t because she got used to it.</p><br/><p>It was because she had gotten blocked at a line which she could not cross.</p><br/><p>It would be easier to break a rock using an egg.</p><br/><p>It felt like she was digging a mountain with just a spoon.</p><br/><p>And as she continued, the loneliness just amplified.</p><br/><p>Since there wasn’t anyone who wanted to help her in her plan of hunting down the Calamity Fish.</p><br/><p>‘If a really strong guy, or someone who actually wanted to do it together existed…’</p><br/><p>Camille, who had been making a tired expression, shook her head.</p><br/><p>‘No. Nonono.’</p><br/><p>If it was something that could be caught just like that then she would’ve done so already.</p><br/><p>While Camille was shaking her head while clenching down onto her teeth, a voice calling her name could be heard.</p><br/><p>“Camille Rowe. Right?”</p><br/><p>“…!”</p><br/><p>At those words Camille made a cold expression as she surrounded her body with Reinforcement and activated skill which protected her from sudden attacks.</p><br/><p>With this, she could defend her body against existences of the Trunk.</p><br/><p>People who purposely searched her out are more dangerous than people whom you meet by chance.</p><br/><p>Camille Rowe, who had held up the short dagger from her waist, held up spear up towards her back where the voice came from but then sighed instead.</p><br/><p>‘It’s a newly-hatched chick.’</p><br/><p>She felt stupid for getting tense from getting her name called.</p><br/><p>She couldn’t figure it out from his looks but she still knew from one look.</p><br/><p>Not having any artifacts was secondary, he didn’t have the which one needed in order to not starve in the .</p><br/><p>Even if he lost it, if you take into account that the Helper clan always supplied you with it meant that this guy was a Chick that hadn’t even finished the helper’s instructions.</p><br/><p>‘Anyways, how did he figure out my name?’</p><br/><p>But Camille’s tension exploded again with the following sentence.</p><br/><p>“There’s a few things I need to talk to you about the Calamity Fish. Let’s have a talk.”</p><br/><p>Calamity Fish. And herself.</p><br/><p>There was only one kind of people who would come find her if you take into accountthese two things.</p><br/><p>“Are you perhaps a Quadratus?”</p><br/><p>‘Damned guys… are they trying to disturb me again?’</p><br/><p>People who worshipped the four dirty beasts that gnawed upon the World Tree along with the Calamity fish.</p><br/><p>Of course they didn’t have a good relationship with her who tried to kill the Calamity Fish.</p><br/><p>Hansoo mumbled inwardly at Camille’s words.</p><br/><p>‘I remember… They thought there were only four of these.’</p><br/><p>He would have thought so as well if he hadn’t heard the stories from the original inhabitants of this place, the Elvenheims.</p><br/><p>Hansoo shook his head.</p><br/><p>“I’m here because I have an interest in hunting the Calamity Fish. So I need your help.”</p><br/><p>“…”</p><br/><p>Camille was flustered.</p><br/><p>‘Does that thing really look that easy?’</p><br/><p>The fact that he knew about the Calamity Fish meant that he had seen it on the way here.</p><br/><p>There was nothing surprising about it.</p><br/><p>Since it wasn’t hard to see it as long as you don’t get crushed by it.</p><br/><p>Actually it was hard to miss something so big.</p><br/><p>But to think of hunting it down after seeing it.</p><br/><p>Camille started to get slightly pissed.</p><br/><p>She had tried and tried and only increased her despair.</p><br/><p>But this newly arrived Chick was talking about the Calamity fish as if it was going to the lake to fish.</p><br/><p>And even asking her to help.</p><br/><p>Camille breathed in and out deeply.</p><br/><p>‘Yeah. Why am I trying to argue with a 1st year.’</p><br/><p>Getting angry here was actually laughable.</p><br/><p>“Leave.”</p><br/><p>The moment Camille spat out a word and turned around, Hansoo opened his mouth.</p><br/><p>“Don’t you have to save your sibling? If you hunt that thing then the chances of your sibling, who might come anytime, surviving increases by a large amount.”</p><br/><p>“….This bastard. Where did you hear about that?”</p><br/><p>“Mmm…”</p><br/><p>‘Did I make a mistake?’</p><br/><p>Hansoo scratched the back of head while watching Camille warming up her body.</p><br/><p>‘I failed the Rapport. Kangtae this bastard…’</p><br/><p>“Wait. Let’s talk about it. Talk.”</p><br/><p>“Shut up!”</p><br/><p>Booooom!</p><br/><p>…………………………………………</p><br/><p>Booooom!</p><br/><p>Camille’s short spear sliced their air.</p><br/><p>Something which Camille had attained two months ago at the Base Root.</p><br/><p>The hardness and sharpness had saved Camille from dangerous situations multiple times now.</p><br/><p>Camille’s short spear, which was filled up with swung down at Hansoo.</p><br/><p>She didn’t really have thoughts of reinforcing the edge either.</p><br/><p>Since she just wanted to beat him down despite being quite infuriated.</p><br/><p>But her thoughts were completely different now.</p><br/><p>Kududududuk.</p><br/><p>‘…This bastard. He’s a beginner?’</p><br/><p>The flying spear met with his fist and got deflected to the side.</p><br/><p>Camille looked at that scene with disbelief.</p><br/><p>‘With a guy who doesn’t have anything on i just… dammit. This is really embarrassing.’</p><br/><p>A guy who didn’t have anything on his body.</p><br/><p>There was no beggar like this.</p><br/><p>But she could guess to as why he didn’t have any artifacts left.</p><br/><p>‘…I can’t even imagine what you need to go through in order to gain something like that.’</p><br/><p>This guy was not a normal guy if you just take into account of the fact that he had attained that dark golden reinforcement without anything else.</p><br/><p>You couldn’t gain anything for free in the tutorial stage which meant that in order to attain something like that, he had gone into an equally tricky place.</p><br/><p>All the artifacts that he had previously would’ve all been smashed apart.</p><br/><p>Kugugugung.</p><br/><p>‘Dammit. He blocked it again.’</p><br/><p>Camille grinded her teeth as she looked at her short spear which was just about to lose it’s edge.</p><br/><p>That Reinforcement’s defense was so high to the point that he was blocking her spear’s attacks with his bare skin and even dulling the edges of it.</p><br/><p>‘Dammit… the density of the Magic Force’</p><br/><p>One of the three factors that determined the value of the Reinforcement.</p><br/><p>It amplified the durability of the weapon or armor that was covered with the reinforcement and as well as the destructive power.</p><br/><p>For it to have such an amplification even when it was over bare skin.</p><br/><p>She wouldn’t really say anything if it was just that.</p><br/><p>‘How high is the amplification of the runes.’ (*PR Note: How much stats are improved by the reinforcement)</p><br/><p>The second factor in determining the quality of the Reinforcement.</p><br/><p>With just these two she could tell the quality of the Reinforcement this guy has is high beyond reason.</p><br/><p>Since she had never even seen something like before.</p><br/><p>Camille, who had been fiercely fighting with him, bit her lips.</p><br/><p>She felt like dying from embarrassment due to the fact that she was fighting on par with a 1st year who didn’t even have any artifacts but she had to acknowledge what she had to.</p><br/><p>She could not win at this rate.</p><br/><p>But she had a hidden card which could turn the situation.</p><br/><p>‘With this much… if I use the special skill of my …’</p><br/><p>Camille thought up to this point and then pulled back her body instantly.</p><br/><p>‘Hmm.’</p><br/><p>Hansoo spoke to Camille who had made distance from him and was glaring at him.</p><br/><p>“Are you done? You aren’t gonna keep going? Don’t you have more things to show me?”</p><br/><p>Camille clenched her teeth as she spoke.</p><br/><p>“You think I’m stupid? You didn’t even use the special skill.”</p><br/><p>Three factors that determined the quality of the Reinforcement.</p><br/><p>First. Amplification of Runes.</p><br/><p>Second. Magic Force’s efficiency and power.</p><br/><p>And third.</p><br/><p>Something which every Reinforcement had.</p><br/><p>If you say that the true worth of a Reinforcement was determined by the third factor, the Special Skill, that you probably wouldn’t be wrong.</p><br/><p>The Blood Jade Reinforcement had the ability to use blood to create a very hard Magic Force and Beast Reinforcement could change parts of the user’s body into that of a beast.</p><br/><p>With such a Reinforcement, she didn’t know what the special skill was but it was sure to be incredible, and he had yet to take it out.</p><br/><p>‘I feel like I’ll die of embarrassment. Damn it.’</p><br/><p>She acknowledged the fact that her battle strength was a bit weaker than the other 3rd years.</p><br/><p>Since she focused on hunting the Calamity Fish while others were getting stronger.</p><br/><p>But for her to lose to somebody who came from the tutorial area.</p><br/><p>‘Okay. I accept the fact that you have a good hand.’</p><br/><p>Actually her mind was more at ease after accepting it.</p><br/><p>Since she just needed to think while ignoring the fact that he was a 1st year.</p><br/><p>But that was that and this was this.</p><br/><p>Camille, who had calmed down, looked at Hansoo as she spoke.</p><br/><p>“You aren’t thinking of beating down the Calamity Fish with just that right?”</p><br/><p>‘With just that trifling ability?’</p><br/><p>She had thought that he didn’t really have anything but nothing changed even after she found out that he had something.</p><br/><p>No, this was actually more infuriating.</p><br/><p>Since the fact that he had come here to hunt the Calamity fish with just that battle power alone was quite absurd.</p><br/><p>If you could beat that down with battle power then everyone would’ve charged at it and beaten it down already.</p><br/><p>The amount of people who had been eaten by the Calamity fish over the past 20 years had reached tens of thousands.</p><br/><p>But nobody had the thoughts of getting revenge against the Calamity Fish.</p><br/><p>Since they saw what happened to those who challenged the Calamity Fish.</p><br/><p>And those who had experienced it were just unlucky.</p><br/><p>“If it was easy then why would I have come to you. I came because it’s hard. Help me. I have a plan anyways.”</p><br/><p>He wouldn’t have come to Camille if that was something he could beat down with strength.</p><br/><p>“…”</p><br/><p>Camille’s expression turned colder and colder.</p><br/><p>“You really talk with ease. If you came to me thinking that I’ll be of help to you then you have a huge misconception. You think I have something great?”</p><br/><p>It seems like he had heard something about her and come to find her but that was a huge misconception.</p><br/><p>A person who tried hard to hunt the Calamity Fish.</p><br/><p>Those were nice words.</p><br/><p>But reality was that she was just a retard.</p><br/><p>But Hansoo just shook his head.</p><br/><p>“You have gone in and come out from the Calamity fish before. I just need that experience and the preparations you have made.”</p><br/><p>Camille smirked at those words.</p><br/><p>“Ha! I have indeed gone in and come out before. But I have done just that!”</p><br/><p>Camille, who had taken a breather, opened her mouth with a cold expression.</p><br/><p>‘I hope he gets lost after hearing this.’</p><br/><p>It was tiring to go against him.</p><br/><p>Camille opened her mouth resolutely.</p><br/><p>“Listen well. You bastard. On the first challenge we left behind 27 people inside that thing. Only I came out. The only thing we gained was how the scales felt like.”</p><br/><p>That thing had gulped down the tree root that her parents were on.</p><br/><p>While she was away for just a moment the Root where her parents, whom had come with her and had lost an arm to save her and crossed the tutorial together with her, were had been devoured whole.</p><br/><p>If Camille herself was a bit unluckier then she would’ve been eaten just like that too.</p><br/><p>Of course Camille was filled up with rage and gathered 27 comrades in similar situations as her and proceeded with her plan.</p><br/><p>The result was misery in itself.</p><br/><p>But people in the Red zone weren’t really surprised.</p><br/><p>Since this was the estimated result.</p><br/><p>They didn’t even laugh at her.</p><br/><p>Since nobody would laugh at a kid who lost after going against an adult.</p><br/><p>Since it was an obvious thing.</p><br/><p>“And then?”</p><br/><p>“On the second attempt, I gathered 118 people who were filled up with greed and then went in. Though we did go in a bit deeper this time. And since two people had survived back it was a huge progress right?”</p><br/><p>“…”</p><br/><p>“From the third attempt nobody helped me so I climbed up and down as I prepared for it and attempted it 10 more times by myself. And I failed them all. What kind of help do you want from somebody like me? The only thing you have seen is the outer part of that thing. You presumptuous bastard? Huh? What do you know!”</p><br/><p>She started out calmly but by the time she finished she was close to crying.</p><br/><p>13 attempts.</p><br/><p>She had searched the method to deal with it by researching its weakness and climbing up and down the Red zone endlessly.</p><br/><p>And the only thing she had gained from this.</p><br/><p>Defeat and despair.</p><br/><p>And the method to run away.</p><br/><p>She wasn’t attempting for her parent’s sake at this point.</p><br/><p>She was lying to herself in her head but she already knew.</p><br/><p>That it was impossible.</p><br/><p>There was only one reason why she was still trying.</p><br/><p>Since she thought that this was the most significant way to die in this damnable place.</p><br/><p>Wouldn’t dying here while avenging be better than getting killed by someone’s blade or getting ripped apart by a beast on the way up.</p><br/><p>‘No. It’s not even that.’</p><br/><p>Camille wasn’t even doing that properly.</p><br/><p>If she really wanted to die while avenging her parents then she would’ve gone in much deeper and into more dangerous places.</p><br/><p>But she was just a retard who couldn’t even do that due to fear and was using her brother, who nobody knew of his arrival in this place, as an excuse and stayed alive.</p><br/><p>And in result, she was spending her time while stuck in between her ambition to stay alive and her impossible revenge.</p><br/><p>‘Goddamnit.’</p><br/><p>Camille felt into a state of lethargy and lost her rage.</p><br/><p>Since the words she had spat out in order to stimulate that guy had twisted her chest.</p><br/><p>But Hansoo shrugged his shoulders as he looked at that Camille.</p><br/><p>“You failed that because I wasn’t here. Don’t worry. I need you and I can kill the Calamity Fish if you help me.”</p><br/><p>“…”</p><br/><p>Camille made an expression of disbelief at his attitude of just saying what he wanted to say.</p><br/><p>At the same time she felt like she was crazy.</p><br/><p>Because she felt like she wanted to trust this crazy guy once.</p><br/><p>Camille made a complicated expression as she looked at the guy who told her he needed her when everyone was ignoring her for doing such absurd things and was even telling her that he will fulfill her wish.</p><br/><p>‘Dammit… I must’ve been really lonely. To get attracted by such random words.’</p><br/><p>At this point she was getting quite curious.</p><br/><p>To see what was his basis for his confidence.</p><br/><p>No, there was something she was more curious of before that.</p><br/><p>“Let me ask you one thing. Why are you trying to kill that?’</p><br/><p>The artifact that would come out once you killed that thing.</p><br/><p>Or revenge like herself.</p><br/><p>Camille was curious about that.</p><br/><p>As to why he wanted to kill the Calamity Fish.</p><br/><p>When Camille, who had turned lethargic after pouring out her feelings, asked with a tired expression, Hansoo pondered for a moment and then spoke out.</p><br/><p>“Just… I want try saving about 1 billion people.”</p><br/><p>“What?”</p><br/><p>“No. Is it about 1.5 billion? The chances of your brother surviving will increase by a lot as well. Good right?”</p><br/><p>“…”</p><br/><p>‘This guy isn’t some normal maniac.’</p><br/><p>Camille made an expression of fear.</p><br/><p>“If you agree then let’s start.”</p><br/><p>Hansoo smiled.</p><br/><p>…………………………………………..</p><br/><p>“Huh…”</p><br/><p>The Helper clansman, who had been making an astonished expression at the fight with Camille Rowe, looked at Yohan and asked.</p><br/><p>“He really came on the same boat as you? He’s really a newcomer?”</p><br/><p>“Yes”</p><br/><p>“Seriously …”</p><br/><p>The Helper Clansman made a expression of disbelief and then looked at the 150 people as he spoke.</p><br/><p>“Never ever piss somebody off by trying to copy something like that. That’s an outlier.”</p><br/><p>“…He can but we can’t? Though we are 150 people?”</p><br/><p>The Helper Clansman smirked at Yohan’s words as he spoke.</p><br/><p>“I wouldn’t stop you but I don’t really recommend it.”</p><br/><p>‘Dammit…’</p><br/><p>Yohan clenched his teeth at the clansman’s words and then glared at Hansoo with an expression full of annoyance.</p><br/><p>Proofreader’s note</p><br/><p>This is a sponsored chapter.</p><br/><p>Some edits were just made on chapter 55, including the name of one of the Seven Departed Souls – Baek Jongsang.</p><br/>\n</div>"}