{"title": "Chapter 76: Plant (2)", "id": 76, "volume": 1, "url": "http://boxnovel.org/reincarnator-chapter-76-plant-2", "volume_title": "Volume 1", "body": "<h1>Chapter 76: Plant (2)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Kwagagagagaga.</p><br/><p>A bit over a hundred people clenched their teeth within the aggressively rushing toxic waters.</p><br/><p>‘Damnit. It’s really rough.’</p><br/><p>Though the inner tunnel that they were moving in was large but the outer tunnel that was sucking in the toxic waters was even larger.</p><br/><p>The people, who felt like they would get swept off from the rapid waters of the river, held onto their hands tight in order to not lose each other.</p><br/><p>‘We might just die if we lose each other!’</p><br/><p>These people activated all sorts of skills to survive and used the strength that had reached the red stage to hold onto each other tight.</p><br/><p>And in between them the 7 marbles were constantly roaming around, held them in place and prevented them from crashing into the walls by slightly changing the directions.</p><br/><p>‘Damnit. I’m not sure if we are going to all die or not.’</p><br/><p>While Michael was cursing out in his mind, a light could be seen in the distance.</p><br/><p>A light that started from the end point of the giant tunnel.</p><br/><p>‘We’ve arrived.’</p><br/><p>Hansoo controlled the marbles, Ekidrang’s Relic, to burst out and quickly approached the wall.</p><br/><p>If they were to get swept into the Plant then they would just all melt from the Plant’s processes.</p><br/><p>He had to make a hole to escape before then.</p><br/><p>Keeeeiing.</p><br/><p>The golden blade in Hansoo’s hand exploded aggressively.</p><br/><p>Hansoo stabbed the blade that had been extended into tens of meters into the wall.</p><br/><p>Kagagagagak.</p><br/><p>‘Ho-oop.’</p><br/><p>It felt like the flesh in his hands was about to explode.</p><br/><p>The blade that was created from Galadriang’s Relic was strong but the tunnel near the Main Body was much thicker and tougher than in the beginning and the current was extremely strong.</p><br/><p>Hansoo tightly clenched onto Galadriang’s Relic in order to not lose it due to the current as he activated Ekidrang’s Relic to hold himself in place.</p><br/><p>Kiiigigigigik.</p><br/><p>Hansoo’s efforts weren’t in vain as his velocity quickly slowed down despite being in the water.</p><br/><p>And in the spot that Hansoo had gone past, a cut of tens of meters had been left behind.</p><br/><p>&lt;!!!!!!!!!!!!!!!!!!!!!&gt;</p><br/><p>The that had gained quite a large injury screamed out in pain.</p><br/><p>Since it would be impossible for even something like it to not feel any pain once the root that acted as a vein had been scratched like that.</p><br/><p>At that moment an enormously large explosion occurred behind him.</p><br/><p>Michael and his clansmen, who had been behind Hansoo, had used all their strength to send out skills.</p><br/><p>Though it was hard for over a hundred people to activate skills at the same time but they did it in a single try as they sent out a powerful attack towards a direction.</p><br/><p>They used the reaction force from that to push themselves out of the toxic waters as they were driven towards the outside of the Root.</p><br/><p>Kwaaaa.</p><br/><p>“Kuhuh….Cough.”</p><br/><p>“Huaa… Huaaaa.”</p><br/><p>Though the Root circulating the toxic waters had been floating tens of meters in the sky, there wasn’t anybody who would die by falling from such a height.</p><br/><p>The people who came out from the toxic waters landed on the ground and then grinded their teeth as they caught their breath.</p><br/><p>“Goddamit. Never again.”</p><br/><p>But unlike those clansmen, Michael instead quickly looked at his surroundings</p><br/><p>A wide open area.</p><br/><p>Two different kinds of roots could be seen above them.</p><br/><p>The giant root of the World Tree that they were familiar with.</p><br/><p>And the root they came out from, that was stuck beneath the World Tree Root like a parasite.</p><br/><p>Their gazes naturally fell towards the location where the root extended to.</p><br/><p>And the thing that was located at the end.</p><br/><p>“It’s huge…”</p><br/><p>Beneath the location of the World Tree Root, a gigantic structure was located.</p><br/><p>Though they had checked it with a skill previously, seeing it in front of their eyes like this was much much different.</p><br/><p>“For something like this to be under the World Tree…”</p><br/><p>At the same time the other thing could only come into their eyes.</p><br/><p>A giant lifeform that was surrounding that giant structure.</p><br/><p>Beasts were slowly crawling out from all around that lifeform that seemed like the main body of the root they were on until now.</p><br/><p>Hansoo started to prepare the mana inside his body after seeing this.</p><br/><p>The objective was the same as before.</p><br/><p>He had to pull out the Divine Stone Fragment before the Plant fully recovered.</p><br/><p>“Get through it quickly. Stick behind me well.”</p><br/><p>“Goddamnit. Even if you say it…”</p><br/><p>Michael grinded his teeth as he saw the beasts swarming towards them from the distance.</p><br/><p>At that time the relics that were around Hansoo flew up like a storm and smashed the life form’s head.</p><br/><p>Boom!</p><br/><p>The Relic which had devoured a large amount of energy from the Divine Stone Fragments smashed apart the life form’s head and then returned next to Hansoo.</p><br/><p>“It’s not that bad. I told you I’ll fulfill your wishes for you. To kill this thing.”</p><br/><p>“…I shouldn’t make wishes so quickly from now on.”</p><br/><p>The atheist Michael found God who he hasn’t searched for in 2 years again in his mind as he prepared the formation of his troops while looking at the charging beasts.</p><br/><p>……………………………………..</p><br/><p>Kudududuk.</p><br/><p>The man who had raised himself out from the Cultivation Liquid looked at his surroundings.</p><br/><p>A man who had the form of an Elvenheim.</p><br/><p>But unlike a normal Elvenheim, he had a strange aura coming off of him.</p><br/><p>&lt;!!!!!…!&gt;</p><br/><p>At that exact moment a voice was transferred into his head from above.</p><br/><p>To go out and get rid of the intruders.</p><br/><p>The man looked upwards.</p><br/><p>The thing that was extending huge roots in all directions.</p><br/><p>That thing was definitely within his memories.</p><br/><p>‘Devouring and Vomiting Root… that was something I gave power too.’</p><br/><p>And because of this the man started to feel angry.</p><br/><p>How dare such a thing give him orders.</p><br/><p>The main body of blinked its eyes as if the man’s actions made it uncomfortable.</p><br/><p>&lt;…&gt;</p><br/><p>Even that guy was a clone that was created with the Creator’s cells as the basis, its abilities couldn’t even compare to him.</p><br/><p>But for such a thing to act with such insolence.</p><br/><p>The thing that made it worse was that he couldn’t give orders to it because it was created with the Creator’s cells as the basis.</p><br/><p>The Devouring and Vomitting Root had created the clone in time but it didn’t know how he would act since he wasn’t bound to its orders.</p><br/><p>There was a reason why it hadn’t made it until now.</p><br/><p>&lt;…..&gt;</p><br/><p>“…”</p><br/><p>While the two were getting on each other’s nerves, the one who spoke first was the man.</p><br/><p>“You have… the key to the here right? Give it to me.”</p><br/><p>One of the two treasures of Elvenheim. </p><br/><p>According to the cloned man’s memory he had given it to this guy to store.</p><br/><p>&lt;….&gt;</p><br/><p>“I gave the position to control the plant to you back then. I know it’s here.”</p><br/><p>&lt;….&gt;</p><br/><p>As the Devouring and Vomiting Root kept giving off dissatisfied feelings the man grinded his teeth.</p><br/><p>“This dumbass. I need that thing to block the guy outside. Hurry and give it to me.”</p><br/><p>The man was realizing the fact that the outside situation wasn’t great.</p><br/><p>It seems like the plant wasn’t working properly because it received some kind of damage..</p><br/><p>It meant the situation was bad enough to the point where it couldn’t focus on healing back the Plant and had to constantly squeeze beasts out.</p><br/><p>And the beasts created didn’t seem like they had the upper hand either.</p><br/><p>Since large screams of beasts were being heard outside along with loud booms.</p><br/><p>‘How could this be… These guys are danger level 12. They came to kill it?’</p><br/><p>The most dangerous beast created from the Plant was level 7.</p><br/><p>But on the other hand the others including the Calamity Fish were level 12.</p><br/><p>Level 12 was dangerous enough to threaten a whole race to extinction.</p><br/><p>And had done so already.</p><br/><p>The man frowned as if he was flustered.</p><br/><p>Then the main body, which was constantly detecting the outside information with a root that acted as an antenna, started to open its octopus-like beak from within its body as if it couldn’t hold it back anymore.</p><br/><p>Kugugugugugu.</p><br/><p>As the giant mouth that was hundreds of meters in diameter opened, hundreds of tentacle-like roots reached down.</p><br/><p>And in the spots where the two roots had extended from, two objects were located there.</p><br/><p>One was the Divine Stone Fragment that shone brightly as it supplied the main body with the energy it needed.</p><br/><p>The other was a strange looking key the size of a finger.</p><br/><p>The main body used one of the hundreds of roots as a hand as it pulled the silvery key up.</p><br/><p>Then it stretched it down to the man below and gave it to him.</p><br/><p>“Hmm. Good. Anyways, this insolent bastard…”</p><br/><p>The man spun the key on his hand and then coldly laughed as he looked at the Divine Stone Fragment above him.</p><br/><p>&lt;….&gt;</p><br/><p>While the made a strange noise as if it didn’t feel good after seeing the man’s smile, the man stabbed the key into the air above him and then spun it leftward.</p><br/><p>…………………………………………………</p><br/><p>Boom!</p><br/><p>Hansoo blocked one of the countless roots flying towards him with Ekidrang’s Relic.</p><br/><p>Charararak.</p><br/><p>Though tens of roots were flying towards him, he could estimate the movements of some.</p><br/><p>Hansoo blocked off the root as he thought inwardly.</p><br/><p>‘As I thought. The defensive system is weaker than the Calamity Fish.’</p><br/><p>The thin roots of the Devouring and Vomiting Root looked like the tentacles inside the Calamity Fish at a simple glance but the difference in power was great.</p><br/><p>Though there was still a very big problem left.</p><br/><p>There was a reason why the defensive system was so weak.</p><br/><p>It was weak because it wasn’t needed.</p><br/><p>Guuoooo!</p><br/><p>An ogre that was the size of a three story building smashed down onto the ground with a bludgeon that reached tens of meters.</p><br/><p>Booooom!</p><br/><p>A huge vibration ran out in all directions as the ground wavered up and down.</p><br/><p>The seven marbles were busy blocking off the roots reaching down from the sky.</p><br/><p>He had to face it directly.</p><br/><p>A golden light reached out long from Hansoo’s blade.</p><br/><p>Booom!</p><br/><p>Hansoo attacked the bludgeon that was flying around in all directions.</p><br/><p>Shukunk.</p><br/><p>The bludgeon was cut off and landed at a different location.</p><br/><p>Kuuuuuu</p><br/><p>The giant ogre made a flustered expression and then made a vicious expression and tried to swing its bludgeon again as if it was trying to smash the ants in front of its eyes.</p><br/><p>Though it didn’t really matter much.</p><br/><p>Churrrrk</p><br/><p>By the time Hansoo finished swinging his sword, the bludgeon and the ogre’s neck, which were in the area of the swing of the sword, had long been cut off.</p><br/><p>Kuwuhh…</p><br/><p>It then fell down to the ground.</p><br/><p>MIchael, who was fighting in the distance, saw that beast, focused and then shouted out loud.</p><br/><p>“We can win! We’re almost there!”</p><br/><p>Then they looked towards the thing that was shining brightly in the distance.</p><br/><p>A bright light that was guiding them like a lighthouse.</p><br/><p>The same thing as what Hansoo was holding onto.</p><br/><p>‘We win if we pull that thing out huh.’</p><br/><p>Hansoo had told them.</p><br/><p>The thing that was supplying the giant body with energy was that thing.</p><br/><p>Everything will be solved if they get there and pull it out.</p><br/><p>At that moment Michael flinched.</p><br/><p>‘Then the Plant will stop working?’</p><br/><p>Then what would the other adventures hunt to get stronger with.</p><br/><p>But at that moment a change occurred.</p><br/><p>Kuwaaaaa!</p><br/><p>“Huh?”</p><br/><p>A huge shockwave was created from somewhere inside where the Divine Stone Fragment was shining along with a loud exploding noise.</p><br/><p>And not long after that sound was heard, the lights of the Plant started to turn off.</p><br/><p>At the same time the hundreds of thin roots that were attacking them constantly shrugged down as they lost their strength.</p><br/><p>‘This…’</p><br/><p>Hansoo frowned.</p><br/><p>He had seen this before.</p><br/><p>At the Calamity Fish’s heart.</p><br/><p>It meant that somebody had pulled the Divine Stone Fragment from inside the Devouring and Vomiting Root.</p><br/><p>‘Who?’</p><br/><p>At that moment a voice was transferred into his mind.</p><br/><p>‘Key? He knows the name?’</p><br/><p>To call the relic the key.</p><br/><p>Of course the original name of the relic was The Five Keys, so was correct.</p><br/><p>But there shouldn’t be anyone but him who knew this here.</p><br/><p>Since the only people who called it that were the Elvenheim, and only the high rankers at that.</p><br/><p>“Stay here.”</p><br/><p>“Huh? Hey?”</p><br/><p>Hansoo left Michael’s shouts behind him as he moved forward.</p><br/>\n</div>"}