{"title": "Chapter 77: Plant (3)", "id": 77, "volume": 1, "url": "http://boxnovel.org/reincarnator-chapter-77-plant-3", "volume_title": "Volume 1", "body": "<h1>Chapter 77: Plant (3)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>‘First time seeing these guys. How are their skills?’</p><br/><p>The Clone, Alpha, mumbled as he looked at the people in the distance.</p><br/><p>There were around 150 people.</p><br/><p>Though it was the first time he saw that race, it didn’t really matter much.</p><br/><p>The important part was their power.</p><br/><p>Alpha laid down a conclusion after looking at the mana wave and the fight.</p><br/><p>That the strongest person over there was around level 6.</p><br/><p>But they were probably at around level 6.5 due to the leaked weapons from , the Arsenal.</p><br/><p>Others were distributed around level 4 and 5.</p><br/><p>‘They’re just bugs.’</p><br/><p>Alpha stopped caring about them.</p><br/><p>Then his gaze turned to the guy he had called.</p><br/><p>‘That guy that’s running to me… He should be around danger level 9?’</p><br/><p>He would probably be around level 6 without the relics.</p><br/><p>But he had the relics of Galadriang, Ekidrang and Fabien of the Five Great Tiger Generals.</p><br/><p>He would be around level 9 since he was efficiently supplying and using the Divine Stone Fragments.</p><br/><p>The might of the relics was that great.</p><br/><p>‘He’s really fascinating.’</p><br/><p>Not everyone could use it like that.</p><br/><p>Even if one was to obtain both the relic and the divine stone fragment, they needed a huge amount of minute mana control in order for their bodies to not blow up.</p><br/><p>‘As if he had been using mana for decades.’</p><br/><p>Just from the mana control he seemed equal to himself.</p><br/><p>If you take into account who the original of the clone is then the fact that the guy over there was similar to him was something amazing.</p><br/><p>But Alpha shook his head.</p><br/><p>‘…Something’s missing. He has more.’</p><br/><p>To kill the Calamity Fish with just that.</p><br/><p>Impossible.</p><br/><p>Killing the Calamity Fish from the outside was of course impossible and even if someone were to act inside its body like this it would still not be possible.</p><br/><p>Since the inner defenses of the Calamity Fish were at least at level 10.</p><br/><p>And somehow he had fried the Plant as well.</p><br/><p>‘Shall we see his hidden cards then.’</p><br/><p>The king’s treasure that acted as the Arsenal that would arm his soldiers, the .</p><br/><p>There wouldn’t any problems though he could only use one of the five different kinds of weapons.</p><br/><p>Since there were enough gears in there to to arm millions of soldiers.</p><br/><p>‘I guess I’ll need to borrow the powers of the Divine Stone Fragment.’</p><br/><p>Alpha raised the key in his hand, Thousand Soldier Armors, and made a motion of stabbing it in the air and turning it right.</p><br/><p>……………………………………….</p><br/><p>Hansoo moved quickly as he went towards the center of the where the Divine Stone Fragment should be.</p><br/><p>At that moment a large amount of things started to pour down on Hansoo.</p><br/><p>‘This bastard… Playing around after telling me he wanted to see me.’</p><br/><p>Even if that guy had set up a plan, he still had to advance if he didn’t want to miss the Divine Stone Fragment.</p><br/><p>Hansoo poured all the energy from the surrounding Divine Stone Fragments into Fabien’s relic.</p><br/><p>Ooooong</p><br/><p>A tremendous amount of marbles started to smash at the formless armor created around his body.</p><br/><p>Huge in numbers but, smaller in size than Ekidrang’s, the marbles surrounded Hansoo and madly started to tear him apart.</p><br/><p>Hansoo urgently checked his surroundings while Fabien’s formless armor was getting shredded.</p><br/><p>‘Main body. I need to find the main body.’</p><br/><p>At that moment something came into Hansoo’s view.</p><br/><p>A blurry image could be seen among the silvery clouds.</p><br/><p>Hansoo aggressively swung Galadriang’s blade towards the distant location.</p><br/><p>Craack</p><br/><p>The Divine Stone Fragment supplied a huge amount of energy.</p><br/><p>The moment the golden light extended away from the sword, the marbles in the air moved and started to block the blade.</p><br/><p>Kigigigigik</p><br/><p>Though as each individual marble was weaker than Ekidrang’s they were crushed the moment they made contact, but as tens of thousands of these blocked the path of the golden light, the light eventually lost its strength and disappeared.</p><br/><p>‘Tsk.’</p><br/><p>He had expected this.</p><br/><p>Hansoo, who had foreseen that it wouldn’t end simply like this, increased the mana in his body and tried to quickly charge through.</p><br/><p>Since he needed to crush his opponent before his body would get shredded apart by the silvery cloud’s attacks.</p><br/><p>‘If all fails… Use the Mana Code!’</p><br/><p>But the cloud that seemed like it was about to attack Hansoo any moment, just calmly floated around the air after attacking and defending once.</p><br/><p>As if it saw everything it needed to see.</p><br/><p>‘Was it a test or something?’</p><br/><p>As Hansoo walked past the silvery marble cloud, a single Elvenheim was waiting for Hansoo.</p><br/><p>The man greeted him as soon as he saw Hansoo.</p><br/><p>“Hello. It wasn’t much, I just called you over because I got interested.”</p><br/><p>The man was looking at him with a laid back expression as if he had gotten relaxed even further than before.</p><br/><p>Hansoo realized the man’s identity as soon as he saw him.</p><br/><p>He had heard a lot of things from the Elvenheims he had met in the Abyss.</p><br/><p>Of course he had also heard about the who caused the Calamities to appear in this world.</p><br/><p>It was clear that he was a clone since there was no way that guy would be here.</p><br/><p>‘Devouring and Vomiting Root… It seems that it was surprised.’</p><br/><p>It would of course have the genetic information of their creator, the Fallen One.</p><br/><p>But to clone that kind of guy even if it could have guessed more or less things would turn like this.</p><br/><p>‘That’s why you get cleaned out.’</p><br/><p>Hansoo coldly gazed at the Clone who was spinning the key around.</p><br/><p>The Clone had a giant Divine Stone Fragment on his right hand and a small key on his left hand.</p><br/><p>Hansoo mumbled inwardly after looking at that.</p><br/><p>‘To control the Divine Stone Fragment to that extent without the relics…’</p><br/><p>He knew because he was also using the Divine Stone Fragment and the relics.</p><br/><p>He understood how well that guy was controlling the Divine Stone Fragment.</p><br/><p>Of course that guy wasn’t pulling out all the energy from the Divine Stone Fragment but if you take into account the amount of energy the fragment has then that much was still fearsome.</p><br/><p>That guy was expertly pulling out a large amount of energy and pouring it towards a certain location.</p><br/><p>And Hansoo knew where that large amount of energy was being poured into.</p><br/><p>The huge number of marbles floating behind him.</p><br/><p>Though they were smaller than the Ekidrang’s Relic Hansoo had, they numbered in tens of thousands.</p><br/><p>Hansoo frowned as he saw the floating marbles and the Divine Stone Fragment in the Clone’s hands.</p><br/><p>‘…Is that the Arsenal I have heard about?’</p><br/><p>Marbles like Ekidrang’s Relics were constantly being released from the open space behind the Clone.</p><br/><p>That’s the that armed ordinary soldiers.</p><br/><p>Since it was an amount that could arm millions of people, the number was tremendous.</p><br/><p>‘And as I remember… The Arsenal was seized before they could even arm the soldiers.’</p><br/><p>The that Galadriang, Fabien and Ekidrang’s army had were distributed to everyone but things like or were all stored within the Arsenal if it was not during a time of war.</p><br/><p>The reason why the Elvenheim had lost against the war against Calamity Fish was that their Arsenal had been seized before the soldiers could get armed with the other four gears in exception to the sword.</p><br/><p>‘I don’t even know what he has has belief in.’</p><br/><p>Hansoo finished his thoughts as he looked at the Clone.</p><br/><p>“What are you thinking?”</p><br/><p>Why would the guy who had attained the Divine Stone Fragment call him over.</p><br/><p>The Clone smiled as he spoke.</p><br/><p>“What else. I need to now finish what I was doing. Though you won’t know about it.”</p><br/><p>The Alpha looked at the relics floating around Hansoo after he finished speaking.</p><br/><p>He was not stupid.</p><br/><p>He knew that he was just a clone.</p><br/><p>But that did not matter.</p><br/><p>His objective could be completed as long as his ability and memory was the same.</p><br/><p>‘And I need that thing for this.’</p><br/><p>He would be able to create a foundation with those things, the second Divine Stone Fragment he had and the key, , in his hand.</p><br/><p>“I’m just wondering if you could just give me the things you have? I was just born so I don’t really want to fight.”</p><br/><p>Hansoo didn’t even reply as he started to rotate the mana within his body.</p><br/><p>And Alpha smirked after seeing this as if he had expected this outcome already and flicked the key in his hand which caused a larger amount of marbles than before to start pouring towards Hansoo’s body.</p><br/><p>Kudududududu</p><br/><p>‘It’s a power that could even crush level 10s.’</p><br/><p>The strength he had seen earlier was level 9.</p><br/><p>This much was enough to erase him without a trace.</p><br/><p>Alpha, while pouring in the mana wave created from the Divine Stone Fragment towards the countless marbles, sent in the special mana code ordering to attack Hansoo using the key in his hand.</p><br/><p>The reason why was the king’s treasure.</p><br/><p>Normal soldiers could use the five different kinds of gears like the Formless Armor and the Seven Star Marbles from the Arsenal only when the King allows them to.</p><br/><p>If the five keys that the Five Great Generals had, the , signified the might of the World Tree then the key that the king had, , had powers over the miniature versions of the Five Relics.</p><br/><p>If the Thousand Soldier Armors didn’t allow the five gears to work then they would all stop working.</p><br/><p>The reason why he didn’t care about the bugs in the distance with the relics was because of this.</p><br/><p>Since he could stop them at his will.</p><br/><p>At that moment the Clone freaked out.</p><br/><p>Kiriririrk.</p><br/><p>“Uuk?”</p><br/><p>Something was quickly invading through the Seven Star Marbles that were being controlled with his Mana Wave..</p><br/><p>To be precise the marbles that were controlled by his mana waves were lost from his command and started to tilt as soon as they entered the mana wave created from the Relic and the fragments.</p><br/><p>And of course once the silvery marbles got weaker, Hansoo swung the golden sword light as he charged at him.</p><br/><p>The Clone spat out loudly unintentionally because he was so flustered.</p><br/><p>“What the hell! How do you know the Mana Code!”</p><br/><p>The Mana Code that was only inscribed on the Thousand Soldier Armors that ruled over the Five Gears was flowing from Hansoo’s mana wave as it was destroying the mana flow within the Seven Star Mables.</p><br/><p>And because of his he could not control them properly.</p><br/><p>Hansoo, who had heard the scream-like shout, thought of the conversation he had with the Elvenheims he had met at the Abyss.</p><br/><p>‘Didn’t know that I’ll get to use it like this.’</p><br/><p>He didn’t really expect much since the Elvenheims didn’t know about the location of the Arsenal either.</p><br/><p>But to find it like this.</p><br/><p>‘So all of this comes into my possession if I cut off your neck right?’</p><br/><p>Then his future plans would become much easier.</p><br/><p>He would’ve been smashed apart if he didn’t know the code but it wasn’t hard to approach him once he knew the code.</p><br/><p>Hansoo, who had been smiling coldly, looked at the clone who had entered his range and slashed down the golden sword.</p><br/><p>Kwararararak</p><br/><p>The golden blade cut through the air as it accelerated towards the Clone.</p><br/><p>At this moment the Clone gnashed his teeth, stabbed the key onto the air again and then spun it the other way.</p><br/><p>If one spun it rightwards then the Arsenal’s space will get opened and a large amount of gears will pour out.</p><br/><p>But when he turned it leftwards, something different happened.</p><br/><p>Charururuk</p><br/><p>The moment the key spun in mid-air, all the surrounding air was flipped inside out as it created a silvery ripple.</p><br/><p>This ripple started from the Clone’s hand which held onto the key, started to climb up the clone’s arm and then covered his whole body.</p><br/><p>Boooom!</p><br/><p>The golden blade smashed down onto the silver armor but it was so tough to the point where not even a scratch was created.</p><br/><p>Hansoo freaked out once he saw the extremely familiar form of the armor.</p><br/><p>“Uk! Weapon Eater!”</p><br/><p>Weapon Eater.</p><br/><p>Solo Numbering 6.</p><br/><p>An invincible armor that grew by eating up gears.</p><br/><p>Hansoo was shocked from the appearance of an armor that could be found in the upper zones.</p><br/><p>‘The complete piece was here! The complete piece of Weapon Eater!’</p><br/><p>Artifacts were mostly just copies of things that existed somewhere in some world.</p><br/><p>Since it was just something that was resupplied as a reward from the fairy.</p><br/><p>The reason why numerous items of the same kind could exist was this.</p><br/><p>And since the location where the copy of Weapon Eater was found was not here, this meant that the thing over there is the original.</p><br/><p>Though he had heard about the key form of the Arsenal and the fact that a special armor of the King was hidden in it but he didn’t know that the armor was the Weapon Eater’s original version.</p><br/><p>‘Another reason came up for me to kill him.’</p><br/><p>Hansoo’s eyes shone at the unexpected find.</p><br/><p>Proofreader’s note</p><br/><p>Regular chapter 2/3.</p><br/><p>‘Mana Code’ is like a Mana Instruction, there is a parallel with programming.</p><br/>\n</div>"}