{"title": "Chapter 85: Ouroboros (1)", "id": 85, "volume": 1, "url": "http://boxnovel.org/reincarnator-chapter-85-ouroboros-1", "volume_title": "Volume 1", "body": "<h1>Chapter 85: Ouroboros (1)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Sangjin saw some clansmen moving about busily in the distance while going up.</p><br/><p>‘…What is that?’</p><br/><p>Sangjin tapped Mihee standing next to him.</p><br/><p>“What is it?”</p><br/><p>“I’ll go look around for a bit.”</p><br/><p>Sangjin then pointed towards the clansmen roaming around in the distance.</p><br/><p>Imugi symbols that were on the backs.</p><br/><p>A symbol which symbolized the Hecarim that had the strength which wasn’t even comparable to theirs.</p><br/><p>But those people were moving around as if they were searching for something.</p><br/><p>‘I need to grasp suspicious movements.’</p><br/><p>The weak always had to know the actions and whereabouts of the strong.</p><br/><p>Mihee looked at Sangjin with a worried expression at those words.</p><br/><p>“You’re going alone?”</p><br/><p>Sangjin nodded.</p><br/><p>‘Humans are more dangerous than beasts.’</p><br/><p>Even if he were to get caught, he had to prevent Mihee from getting involved.</p><br/><p>Moving alone was easier too.</p><br/><p>Sangjin left the worrying Mihee, made some distance, and then activated his skill, .</p><br/><p>A skill which he had obtained in the beginning of the Red Zone.</p><br/><p>A skill which caught the vibration in the air and the ground from the opponent’s conversation and turned them back into voices.</p><br/><p>It’s strong point was that it could spy on conversations quite a distance away and that it wouldn’t be caught by others since it didn’t use mana to check over the people.</p><br/><p>Sangjin configured all his skills like this in the first place.</p><br/><p>‘I won’t be able to do anything if I try to do everything half-heartedly.’</p><br/><p>Skills for going against humans and going against beasts were completely different.</p><br/><p>One needed to focus on a few selective skills in order to raise their mastery.</p><br/><p>‘I shouldn’t get caught… With this.’</p><br/><p>Sangjin, who was located quite a distance away, hid as much presence as possible and started to listen in on the conversation.</p><br/><p>&lt;…Let’s see.&gt;</p><br/><p>‘…’</p><br/><p>Sangjin’s expression froze.</p><br/><p>‘Why are they looking for us?’</p><br/><p>He didn’t know what Hansoo was thinking of but he knew what he was trying to do.</p><br/><p>Since the thing he had done was so surprising that the messages went back and forth and spread out extremely fast.</p><br/><p>He had killed 2 of the 4 Great Calamities.</p><br/><p>‘He will try to kill the next one.’</p><br/><p>Sangjin raised his head and then looked at the pillars in the distance.</p><br/><p>A huge snake that struck fear into one just from its sheer size.</p><br/><p>Sangjin’s mentality became chaotic as soon as he saw the snake.</p><br/><p>Hansoo was busily running around in order to kill such a thing.</p><br/><p>But he was afraid of a few clansmen to the point where he was just cautiously eavesdropping on them.</p><br/><p>The gap has been increased too much.</p><br/><p>But Sangjin shook his head.</p><br/><p>‘He probably has a plan. Why would he have accepted me if he wasn’t going to take me along?’</p><br/><p>Sangjin set his mind straight and then analyzed the current situation.</p><br/><p>Hansoo tried to kill the Ouroboros.</p><br/><p>At the same time the Six Pillars were looking for people who were related to Hansoo.</p><br/><p>‘This doesn’t feel good.’</p><br/><p>If this was something Hansoo had asked the Six Pillars to do then they wouldn’t search around like that.</p><br/><p>Hansoo would have told them the name and their characteristics and told them to bring them.</p><br/><p>Which meant that those guys were searching for them without Hansoo’s knowledge.</p><br/><p>‘Damnit. They don’t have good intentions.’</p><br/><p>Sangjin cautiously turned his body and headed towards the direction that was away from them.</p><br/><p>He then quickly ran towards Mihee.</p><br/><p>But Sangjin frowned after returning.</p><br/><p>“Oh really? So you guys are well acquainted with Kang Hansoo! Uahaha! Amazing, you’re friends with that famous guy.”</p><br/><p>‘Goddamnit.’</p><br/><p>It seems they found out after a few words.</p><br/><p>Sangjin frowned as he saw Hecarim’s Clansmen surrounding Mihee and people.</p><br/><p>They didn’t have a lot of people as if they came out with patrolling as the objective so they could probably win if he joined in but that was a crazy act.</p><br/><p>Since one of the Six Pillars wouldn’t stand by idly and let them attack.</p><br/><p>‘…We aren’t going to all get dragged along at this rate right?’</p><br/><p>They might take them all if they were going to use them as Hansoo’s weakness.</p><br/><p>While Sangjin was looking at this scene with anxiousness the clansmen of Hecarim shrugged their shoulders as they spoke.</p><br/><p>“Well then hurry and go up. The battle is fierce up there. To the point where we need to borrow your strength.”</p><br/><p>‘…Mmm?’</p><br/><p>Sangjin and the others squinted their eyes as they saw the Hecarim clansmen laughing and moving and waving their hands.</p><br/><p>The clansman chuckled at the people dazing at them and then spoke.</p><br/><p>“What are you doing. Go up quickly. Do you think we need to keep protecting you while you go up? Just don’t go astray and follow this path. It’s really urgent.”</p><br/><p>“…Understood.”</p><br/><p>The Hecarim clansmen disappeared with those words and Sangjin squinted his eyes.</p><br/><p>‘What is he thinking?’</p><br/><p>……………………………………………</p><br/><p>Jukma nodded and laughed as he saw the message which had flown towards him.</p><br/><p>‘We’ve found them right on time.’</p><br/><p>The lake will open in 1 day.</p><br/><p>He didn’t know who was significant to Hansoo but he would gather everyone who had seen him and gather them all into one location.</p><br/><p>But Jukma wasn’t going to interrogate them or not.</p><br/><p>‘Since the most important thing hasn’t been confirmed yet.’</p><br/><p>As to whether the hostages were meaningful in any way.</p><br/><p>He needed to know this.</p><br/><p>Since he might just piss him off if the hostages were useless in a decisive moment so this was necessary.</p><br/><p>And because of this he needed to poke him around before using him.</p><br/><p>Check by seeing if Hansoo will help them in times of danger or need.</p><br/><p>‘It’s a bit too risky for me to do it personally.’</p><br/><p>It would be a problem if the hostages didn’t have an effect but also a problem if it did.</p><br/><p>Since he would be pissing off Hansoo before the lake opened.</p><br/><p>‘There’s no way Miyamoto will help either.’</p><br/><p>He would probably be wanting Jukma to do that for him.</p><br/><p>But why did he need to do it himself?</p><br/><p>Thankfully he knew the perfect candidates for such things.</p><br/><p>The newcomers who had been forcibly recruited just a while ago.</p><br/><p>Unlike the upper level clansman who were well known already, these guys wouldn’t be a problem since they were caught in secret.</p><br/><p>‘There are a lot of talented people in that tutorial group. Though Hansoo is like that too…’</p><br/><p>There were people who shone brighter than others in that group.</p><br/><p>Like that Wongyung guy who was coming up with the Clan Unions.</p><br/><p>Jukma applauded after seeing his talent.</p><br/><p>Since that guy was amazing just by seeing his Lord trait.</p><br/><p>‘But then what does that matter. There’s nothing about a Lord if their soldiers are weak.’</p><br/><p>Exactly as he said.</p><br/><p>The reason why that guy was unlucky was that he had shown himself too much within the Clan Union.</p><br/><p>A white tiger will get stronger than anything else once it matures.</p><br/><p>But it will be hunted for the fur.</p><br/><p>It was suitable for them to hide their claws as a baby but they had too much confidence in the fact that 10 clan lords had allied.</p><br/><p>Since they had tried too hard to clash with other newcomers on the End Root in order to recruit strong people.</p><br/><p>And because of this they had been caught in the eyes of the Quadratus who had been searching around to recruit newcomers under their orders and eventually had been caught in their own eyes.</p><br/><p>‘If you aren’t going to hide it then grow to the point where no one else can catch up to you.’</p><br/><p>Jukma, who had a bitter taste in his mouth from thoughts of Hansoo, sent a message downwards.</p><br/><p>If Hansoo reacts after they threaten then the answer is simple.</p><br/><p>Throw the newly recruited guys away as used cards and take them into hostage once the chance arrives.</p><br/><p>Since Miyamoto told them that he will keep Hansoo’s eyes off.</p><br/><p>How could a guy who wanted to kill the Ouroboros protect a hostage by their side for the whole day.</p><br/><p>There are plenty of chances.</p><br/><p>Of course Hansoo might not react at all after they threaten them.</p><br/><p>A situation which would be extremely infuriating to Jukma.</p><br/><p>‘Then… Those guys will just have to act as stress relievers.’</p><br/><p>This had to be done after him, who was one of the Six Pillars, went out and failed at selling a product.</p><br/><p>‘Since I’ve done up to this point at least he should attract sightseers.’</p><br/><p>Jukma sent a message towards Miyamoto after finishing his thoughts.</p><br/><p>…………………………………………….</p><br/><p>Hansoo looked at the five shining relics in front of him.</p><br/><p>Spear.</p><br/><p>Sword.</p><br/><p>Marbles.</p><br/><p>Chains.</p><br/><p>Bracelet.</p><br/><p>‘With this much… It’s possible to almost control half of the energy a single Divine Stone Fragment emits.’</p><br/><p>If one took account of the fact that the Divine Stone kept the World Tree alive and supplied hundreds of billions of Elvenheims then even half of a fragment of a Divine Stone which had been split into fives was still a formidable amount.</p><br/><p>And another thing.</p><br/><p>A small cross symbol which had appeared on Hansoo’s head as soon as he gathered all five Relics.</p><br/><p>It was a sign of the which had the rights to the powers on the World Tree along with the King.</p><br/><p>Hansoo loosened up after receiving countless amounts of information that poured in through the World Tree.</p><br/><p>Since the huge amounts of information that felt like they were splitting his head was too burdensome.</p><br/><p>Unlike an Elvenheim, there was a limit for him to use all the powers of an Administrator as a human.</p><br/><p>And even more so if the World Tree’s status wasn’t normal.</p><br/><p>‘But this is still a great help.’</p><br/><p>He had gained the power of an Administrator and five relics.</p><br/><p>He had geared up quite a bit.</p><br/><p>But Ouroboros, who still had a Divine Stone Fragment and could play around with its giant body was still dangerous.</p><br/><p>Though he wanted to just smash its head or heart, and his original plan was approaching it from the inside and ripping out the DIvine Stone Fragment and destroying the heart but the the invasion from within was blocked off.</p><br/><p>Getting through its thoracic bones or its skull which was hundreds of meters in thickness and killing it like that was impossible.</p><br/><p>‘Plan around its weakness.’</p><br/><p>It’s weakness was its spine that was on its back.</p><br/><p>Unlike the intestines deep within, the Spine on its back protruded out here and there.</p><br/><p>He needed to cut the nerves in between every spine, which was a size of a small hill, and seal its movements.</p><br/><p>‘The poison should be spreading throughout its body.’</p><br/><p>The thing that was spreading throughout his body was a neurotoxin.</p><br/><p>Which meant that he just needed to blow up the heart and kill it off.</p><br/><p>‘I need to aim for when it drops its guard.’</p><br/><p>There’s a reason why it was always focused on drinking the Toxic Waters from the start.</p><br/><p>Why did it need to care about other things when it had no natural predator.</p><br/><p>And because of this it wouldn’t react to most things.</p><br/><p>He needed to utilize the time when it wasn’t on guard and cut off its nerves in a single sweep.</p><br/><p>‘The people who have the ability to get through the Scales and cut off the thick nerves in an instant are only the Seven Departed Souls.’</p><br/><p>The rest were not at the level where they can even get through the scale of the Ouroboros.</p><br/><p>Which meant that while the people below were distracting the parasites, him and the Seven Departed Souls had to attack together, cut off 8 nerves and then dodge the thrashing Ouroboros to cut off four more.</p><br/><p>Because of this the Seven Departed Souls had to do their part very well.</p><br/><p>‘Continue as soon as the injury from the battle with the Akuma heals. Anyways, they should be planning something out by now.’</p><br/><p>Miyamoto’s 1st goal was getting out of this place.</p><br/><p>Hansoo, who had been looking at the five relics floating around him, looked at Miyamoto who was suddenly approaching him with a strange expression.</p><br/><p>“Are the preparations going well?’</p><br/><p>“What’s the problem?”</p><br/><p>Miyamoto laughed as he spoke.</p><br/><p>“Why do I need a problem to come see you when we are going to be fighting together from now on. I just came to take a stroll for a bit. We should go outside for a bit and have a look at the Ouroboros. I know a location with a good scene.”</p><br/><p>Hansoo nodded at those words.</p><br/><p>“Then let’s. I also have something to tell you.”</p><br/><p>The two of them then left the large area the where the Akuma was.</p><br/>\n</div>"}