{"title": "Chapter 91: Wasp Legion (2)", "id": 91, "volume": 1, "url": "http://boxnovel.org/reincarnator-chapter-91-wasp-legion-2", "volume_title": "Volume 1", "body": "<h1>Chapter 91: Wasp Legion (2)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Kuuuuuu</p><br/><p>Jukma sighed in relief as he saw the movements of the Ouroboros stopping from below.</p><br/><p>‘Thank god. He succeeded.’</p><br/><p>He didn’t like that Hansoo guy but then all of them would die they if they couldn’t kill that thing.</p><br/><p>‘It’s a mess. The tracker teams aren’t in contact as well… Did they get killed by the parasites?’</p><br/><p>Jukma clicked his tongue.</p><br/><p>Since he couldn’t prevent the chances of such things happening because it was such a mess.</p><br/><p>At that moment he could see people crawling up the World Tree’s trunk.</p><br/><p>There were a few individual adventurers but the clansmen of the other Five Pillars or the Twelve Roots could be seen as well.</p><br/><p>‘Are those guys trying to crawl into the body of the Ouroboros?’</p><br/><p>The people who had been fighting all around were cautiously crawling into the body of the Ouroboros through the trunk.</p><br/><p>Since it wasn’t that hard to crawl into the body of the dead Ouroboros.</p><br/><p>Jukma grinded his teeth while looking at that scene.</p><br/><p>‘Oh yeah. Relics.’</p><br/><p>Jukma looked at the five gears hanging around his body.</p><br/><p>Such objects had come out when they had only killed two.</p><br/><p>There wasn’t any guarantee that there won’t be anything inside the Ouroboros.</p><br/><p>Hadn’t they obtained the Forgotten Sword in the stomach of the Calamity Fish?</p><br/><p>‘…I made a blunder. I should’ve moved before those guys went up first.’</p><br/><p>No one knew what was inside it.</p><br/><p>Whoever took it first was the owner.</p><br/><p>There was nothing to lose even if nothing was there.</p><br/><p>Since it was a no-risk.</p><br/><p>The parasites died out as the Ouroboros stopped moving and the Ouroboros was now just a huge decor.</p><br/><p>‘I have to move before the Wasp Legion moves out.’</p><br/><p>The Queen of the Wasp Legion would become frantic in order to increase its power and search around for food.</p><br/><p>Since there were more than a few people who had seen the people who had gone up to the Branches and flying around after becoming one of the Wasps.</p><br/><p>Why would such things miss such a food source like the Ouroboros?</p><br/><p>They haven’t sent the larvae yet because they were checking out the situation but once they do then they’ll send swarms of larvae.</p><br/><p>Then the insides of the Ouroboros will get filled up with those vicious things.</p><br/><p>‘I need to move quickly.’</p><br/><p>Jukma hurriedly started to send his clansmen inside the Ouroboros.</p><br/><p>……………………………………</p><br/><p>‘Hmm… He managed the situation well.’</p><br/><p>Hansoo nodded after reading the carrier pigeon which had come from Sangjin.</p><br/><p>There were things that had happened to Sangjin so far until now inside it.</p><br/><p>‘He got much stronger. Though he’s not at the level of a Departed Soul…’</p><br/><p>With the role Sangjin has, his runes will increase extremely fast.</p><br/><p>‘The stronger the comrade the better.’</p><br/><p>Hansoo stopped walking due to a strange sensation while descending down upon the Ouroboros.</p><br/><p>A strange movement inside the Ouroboros.</p><br/><p>‘Wasp Soldier’s larvae.’</p><br/><p>Hansoo frowned slightly</p><br/><p>‘It’s faster than I expected.’</p><br/><p>He expected the Clone to go to the Wasp Legion.</p><br/><p>But from the speed of how fast the larvae were spread, it seems like he had given up on the Ouroboros quite quickly.</p><br/><p>‘And… With that many larvae.’</p><br/><p>That guy would need to suppress his greed if he wanted to control it.</p><br/><p>If he tried to control the guy who was focused on breeding then there was no way that many larvae would come out.</p><br/><p>Which meant that he had completely given up on controlling it.</p><br/><p>But Hansoo still nodded.</p><br/><p>‘It’s alright so far.’</p><br/><p>Since the battle depended on whether he was able to cut off the Queen’s neck or not.</p><br/><p>Actually it was better to go up and kill off the Queen while those things, who couldn’t come down due to the Ouroboros, were focused on the corpse of the Ouroboros and not humans.</p><br/><p>‘It’s better to win with the least amount of casualties.’</p><br/><p>But Hansoo squinted his eyes at the people crawling into the body of the Ouroboros</p><br/><p>………………………………………</p><br/><p>Voices resonated throughout the giant corpse of the Ouroboros.</p><br/><p>“Hey. Look closer. How would there not be any rewards when such a big thing like this died?”</p><br/><p>“Ugh. Hansoo and the others would’ve taken them all. Those Departed Souls.”</p><br/><p>Einkel shook his head as he looked at Ren who was pushing him.</p><br/><p>He understood that guy’s intentions but logically speaking there won’t be any useful things left behind.</p><br/><p>The eight who had killed this thing would’ve shared it with each other.</p><br/><p>Ren shouted out abruptly.</p><br/><p>“You bastard. There’s going to be the artifacts of the ones whom this guy had swallowed. As well as the Relics.’</p><br/><p>“Ugh.”</p><br/><p>Einkel shook his head.’</p><br/><p>‘Well. There’s a possibility of that being true.’</p><br/><p>Which was the reason why they were searching throughout the stomach of the Ouroboros.</p><br/><p>If those of Large clans find this first then there won’t even be a drop left.</p><br/><p>While Einkel was about to proceed forward, a noise resonated from deep within the flesh of the Ouroboros.</p><br/><p>Kurururk</p><br/><p>“Huh?”</p><br/><p>Einkel put his ear up to the petrified flesh of the Ouroboros as soon as he heard a strange sound.</p><br/><p>He then frowned.</p><br/><p>Sagak Sagak</p><br/><p>A sound of something being gnawed.</p><br/><p>Einkel activated a skill.</p><br/><p>Kiiing</p><br/><p>The vibration which went through the flesh turned into a shape and then created a virtual image inside Einkel’s head.</p><br/><p>He then freaked out.</p><br/><p>‘Wasp?’</p><br/><p>A larvae of a familiar form was gnawing upon the corpse of the Ouroboros.</p><br/><p>‘Damnit. Why are these guys here!’</p><br/><p>Why were the things that were at the Branch over here.</p><br/><p>Einkel focused everything onto the larvae over the flesh wall and then quickly shouted behind him.</p><br/><p>“Ren! We have to get out!”</p><br/><p>They needed to get out and spread this news.</p><br/><p>There was one Ouroboros but there were hundreds of thousands of these things.</p><br/><p>Even if Hansoo and the Seven Departed Souls fought in the front there was no way for them to charge through.</p><br/><p>And eating a few humans made them much stronger than normal Wasp Soldiers.</p><br/><p>They couldn’t even imagine what they would become once they grew by eating up the Ouroboros.</p><br/><p>“Ren! Ren! Why aren’t you responding!”</p><br/><p>Eiken’s body froze as he turned around while shouting.</p><br/><p>Since Ren, who was proceeding in the front, was being eaten by something.</p><br/><p>Udududk. Kudududk.</p><br/><p>“Goddamnit…”</p><br/><p>Einkel spat out curses as he looked at Ren who was having his neck pulled off.</p><br/><p>And around Einkel, something with a lower body of a snake and an upper body of a Wasp Soldier was approaching him.</p><br/><p>‘Goddamnit…’</p><br/><p>Einkel’s consciousness was cut off with that.</p><br/><p>&lt;….&gt;</p><br/><p>And the Wasps just quietly ate up that corpse.</p><br/><p>They hadn’t completed their growth yet.</p><br/><p>As they ate the human corpse, their body which still had room for change started to slowly change while making noises.</p><br/><p>Two human-like arms popped out from the upper part of the bee.</p><br/><p>At the same time there was a change at its head which was a strange combination of a snake and bee.</p><br/><p>Kiiik</p><br/><p>The Wasp Soldier, which had absorbed the human body, started to ponder.</p><br/><p>The body of the predator it had eaten was amazing.</p><br/><p>But two were better than one and three were better than two.</p><br/><p>Since a wide variety of collections gave them the possibility.</p><br/><p>Mixing the genes of their predator to theirs was amazing by itself but when they added another it gave a much better result.</p><br/><p>The Wasp Soldier sent a message and asked the Queen.</p><br/><p>As to whether it should keep eating what it had.</p><br/><p>Or leave the corpse and eat the living ones below for more possibilities.</p><br/><p>The Queen then gave the order.</p><br/><p>…………………………………….</p><br/><p>‘…We poked a wasp’s hive.’</p><br/><p>The people of the Six Pillars who were gathered all frowned.</p><br/><p>Reports were being made to them constantly.</p><br/><p>That the ones who had been eating the corpse of the Ouroboros were now preparing to go down.</p><br/><p>Once they collect enough numbers then they’ll probably rush down.</p><br/><p>But there were things they wanted to say.</p><br/><p>‘Damnit. It doesn’t make sense.’</p><br/><p>It was too fast.</p><br/><p>Even if it was the Wasp Legion it wouldn’t try to increase its power this fast.</p><br/><p>Hansoo shook his head while looking at these guys.</p><br/><p>These guys would see even more casualties now.</p><br/><p>It was a well-deserved punishment but they couldn’t just watch and take it.</p><br/><p>Hansoo spoke as he looked at them.</p><br/><p>“I need to kill off the Queen before they increase their powers even more. Defend here with your lives on the line.”</p><br/><p>Hansoo then looked at the giant chain system set up between the Roots.</p><br/><p>Six Pillars and the Six entrances in between them.</p><br/><p>People were using the five relics to set up the chain system.</p><br/><p>Raise the Seven Star Marbles and then connect it with the chains.</p><br/><p>When millions of relics were used like that, a ginormous chain system which surrounded this area was created.</p><br/><p>‘Let’s see.’</p><br/><p>Hansoo pulled out the energy of the Divine Fragment.</p><br/><p>Chijijijik</p><br/><p>As a large amount of energy started to flow through, the relics and the chains made clanking noises and moved back and forth.</p><br/><p>Set up the formation and then fight from the inside with the relics.</p><br/><p>‘They can’t hold on for long.’</p><br/><p>He needed to kill the Queen before they get run over.</p><br/><p>Jongsang asked Hansoo while looking at the formation they had created.</p><br/><p>“…How are you going to get up?”</p><br/><p>That formation was quite useful but they couldn’t get near the Queen at the top with this.</p><br/><p>The Wasp Soldiers on the way up can be dealt with but the new Wasps being created from within the Ouroboros will constantly pour out.</p><br/><p>At that time a cross shone on Hansoo’s head.</p><br/><p>At that time the Pillars of the World Tree that they were standing on made creaking noises as they started to twist.</p><br/><p>Kududuk. Udududuk.</p><br/><p>“This is…”</p><br/><p>The people were shocked as they saw the tunnel filled with light.</p><br/><p>Since they had never seen such a thing when they’ve been living in these Pillars for years.</p><br/><p>Hansoo mumbled as he looked at that tunnel.</p><br/><p>‘Go up by creating the Vassal’s Tunnel.’</p><br/><p>At this rate he would need to deal with countless newly evolved Wasp Soldiers if he were to go up climbing the World Tree’s Trunk in order to get to the Queen.</p><br/><p>And they would pour down like water even while he is fighting.</p><br/><p>That was too dangerous.</p><br/><p>But there was a tunnel which lead straight up to the top of the World Tree.</p><br/><p>A tunnel which only the Five Great Tiger Generals who had the ability to ask for an audience with the King could use, a tunnel which lead straight to the which was the King’s residency.</p><br/><p>If he uses this then he can get to the Queen, which was located close to the Flower, quite quickly.</p><br/><p>“If we go up using this tunnel then we can get to the Queen with the shortest route possible.”</p><br/><p>“Hmm…”</p><br/><p>The people’s expressions brightened up as they heard this.</p><br/><p>The reason why the Wasp Legion was dangerous was partly because the Queen was strong but mainly because of the viciousness of the Wasp Soldiers surrounding it.</p><br/><p>If they could get to the Queen directly then a huge amount of pressure will be lifted off.</p><br/><p>“Then we will create an elite force and go up.”</p><br/><p>Hansoo shook his head at those words.</p><br/><p>“Five.”</p><br/><p>“What?”</p><br/><p>Only five people can go through this tunnel.</p><br/><p>This path was something only allowed to the Five Great Tiger Generals.</p><br/><p>Which meant that only the five who had the keys that symbolized those five could go up.</p><br/><p>There wasn’t a need to distribute the keys but it was a tunnel for five people from the start.</p><br/><p>“Goddamnit…”</p><br/><p>Jongsang got flustered and then looked at the others.</p><br/><p>Of course the strongest five had to go.</p><br/><p>So if Hansoo took a spot it meant that only four of the remaining Six Departed Souls could go.</p><br/><p>While Jongsang’s expression was turning worse, Hansoo’s expression wasn’t very well off either.</p><br/><p>‘Hooh… I didn’t want to open it.’</p><br/><p>If the situation wasn’t dire then he wouldn’t have gone up through this tunnel.</p><br/><p>The Vassal’s tunnel was a tunnel which opened to get to the king.</p><br/><p>Of course the King will know it once it opened.</p><br/><p>Not the clone.</p><br/><p>The Fallen King himself who had succeeded in killing or exiling all the Elvenheims as well as completely drying up the World Tree.</p><br/><p>The Elvenheims he had met at the Abyss were all exiled so they didn’t know the events of the Fallen King after they were exiled.</p><br/><p>He might’ve died or went somewhere else.</p><br/><p>Hansoo needed to take into account the worst situation possible so he didn’t want to open the Vassal’s Tunnel but he did.</p><br/><p>The King’s power was dimensions apart from that of the Clone.</p><br/><p>And their memories were different so it was impossible to calculate his actions unlike for the clone which acted blindly.</p><br/><p>‘I won’t even be able to do anything if he exists…’</p><br/><p>He can’t abandon the best solution because of unsure variables and take risks.</p><br/><p>But not having any risk was of course the best.</p><br/><p>Ooooong</p><br/><p>At that time the World Tree trembled slightly.</p><br/><p>Without Hansoo doing anything.</p><br/><p>‘Goddamit.’</p><br/><p>Hansoo turned around his sight towards the top of the World Tree and then clenched his teeth.</p><br/><p>………………………………….</p><br/><p>The giant flower which had denied access to the clone.</p><br/><p>A man who had been lying inside the flower got up.</p><br/><p>“…”</p><br/><p>The Elvenheim frowned as he got warned by the World Tree that somebody was coming to him.</p><br/>\n</div>"}