{"title": "Chapter 96: Orange Zone (2)", "id": 96, "volume": 1, "url": "http://boxnovel.org/reincarnator-chapter-96-orange-zone-2", "volume_title": "Volume 1", "body": "<h1>Chapter 96: Orange Zone (2)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>“Hooh…”</p><br/><p>Hansoo pondered for a moment.</p><br/><p>Since the things he did were dangerous, the Immortal Soul wasn’t that bad.</p><br/><p>No, the Elemental Outfit was good in terms of balance between attack and defense.</p><br/><p>But he knew how to obtain these up above.</p><br/><p>A skill like a Demonic Dragon’s Reinforcement was hard to get within the Otherworld.</p><br/><p>“Let’s go random. Can you give it to someone else other than me?”</p><br/><p>‘…I must calculate the possibility of getting a Lord-like skill of an already dead person.’</p><br/><p>Skills with limits couldn’t match up to solo numberings.</p><br/><p>He couldn’t fill up one of the seven spots with such things.</p><br/><p>It was better to give it away to Sangjin or somebody else who was capable.</p><br/><p>Because the affinity of the skill with the user can’t be ignored.</p><br/><p>The fairy nodded at those words.</p><br/><p>“Don’t worry. I will give it to you in a rune form. Wherever you want to use it is up to you.”</p><br/><p>Then the fairy pulled out a small pouch.</p><br/><p>“Here! Pick one from the bag.”</p><br/><p>“…”</p><br/><p>It was an act of hospitality.</p><br/><p>Then a shining skill rune which was letting off a reddish purple light popped out and the fairy exclaimed in surprise as it saw this.</p><br/><p>“Woah. It’s the Pandemic Blade.”</p><br/><p>“Pandemic Blade?”</p><br/><p>A skill which he had never heard of.</p><br/><p>The fairy smiled as it spoke:</p><br/><p>“It’s a skill of somebody who had destroyed a whole world. Heehee. That person had really entertained us well. Well. I’m not sure if it’s to your liking. Are you going to use it?”</p><br/><p>Hansoo squinted his eyes after checking the skill’s options after hearing the fairy’s words.</p><br/><p>…………………………..</p><br/><p>Kuooooooo!</p><br/><p>Beasts were charging in from all directions.</p><br/><p>They had started to create the beasts again as the World Tree revived.</p><br/><p>‘They’re doing good.’</p><br/><p>Hansoo looked at those beasts and then nodded.</p><br/><p>He had given a soul fragment to the young King, Tekilon, as well as all of the powers.</p><br/><p>And after observing how he was doing, he was raising up the humans very well.</p><br/><p>Overwhelming them but at the same time not enough to kill them.</p><br/><p>Thanks to this the newcomers were endlessly hunting beasts without a break and were getting stronger.</p><br/><p>Which was the same for him.</p><br/><p>‘It will take another… 3 more days for the lake to open.’</p><br/><p>Only when the World Tree collects more mana will the dimensional door to the orange zone opens.</p><br/><p>There was only one thing he needed to do.</p><br/><p>To get the qualifications to go up by gathering runes.</p><br/><p>‘Ah, some rest finally.’</p><br/><p>This could only be called rest.</p><br/><p>Though he didn’t have any relics, Hansoo had advanced too far for the beasts of the red zone to threaten Hansoo.</p><br/><p>Hansoo lightly swung the Forked Lightning in his right hand.</p><br/><p>Chwaaaak</p><br/><p>As the spear which was over 3 meters long swung in the air, the 5m tall gorilla-shaped beast instinctively raised its right arm and blocked the attack.</p><br/><p>Due to its quick reaction it was able to run away with just a light wound.</p><br/><p>But at that time something happened.</p><br/><p>Bubble bubble</p><br/><p>Something started to grow madly from the Gorilla’s arms.</p><br/><p>Sofía, who had been watching Hansoo from afar, made an expression full of fear.</p><br/><p>‘It’s… It’s that again.’</p><br/><p>The yellowish fungi that had covered the wound grew out and then soon exploded.</p><br/><p>Chiiiiiik</p><br/><p>Kuuuuuuuhh!</p><br/><p>The bright yellow spores that exploded out from the fungi covered the entire body of the gorilla in an instant.</p><br/><p>Infinite repetition.</p><br/><p>The spores grew out again as it melted down the gorilla’s body and from that location new fungi grew out.</p><br/><p>The newly grown fungi exploded again as it spread more spores in all directions as those spores created more fungi.</p><br/><p>Kuuuuhh!</p><br/><p>Kyaaaah!</p><br/><p>Soon the hundreds of beasts around Hansoo had been covered by the spore cloud.</p><br/><p>Their body melted down as they rolled over the ground from the pain and slowly died while becoming a new source of fungi.</p><br/><p>Hansoo nodded as he looked at the scene which looked like yellow fireworks exploding out in all directions.</p><br/><p>‘Amazing.’</p><br/><p>A blade of viruses and fungi.</p><br/><p>The name was a blade but it was actually a skill which added a special effect to attacks.</p><br/><p>The effect was very simple.</p><br/><p>Creating fungi that infinitely spread out and infected everything.</p><br/><p>It was extremely harmful and was hard to kill off since it was in such large numbers.</p><br/><p>One could only persevere and hold on until the mana within the fungi ran out.</p><br/><p>Of course there was a condition to this.</p><br/><p>That mana needed to be supplied.</p><br/><p>It would only grow and spread out from the mana it started off from.</p><br/><p>‘On the other hand, as long as mana is supplied… Wow. I can only trust the fairy’s word huh.’</p><br/><p>Hansoo clicked his tongue.</p><br/><p>He had thought that the words of it being a skill that someone who had destroyed a whole world had used was a bluff.</p><br/><p>Since it wasn’t easy for one to go against a whole world unless they took control of a being that protected a whole civilization like the World Tree.</p><br/><p>But he could only believe it after seeing the effects.</p><br/><p>If this was to continue to spread infinitely then it could erase a whole world.</p><br/><p>If Hansoo was to use the relics and the divine stone fragments to imbue it with mana and spread the Pandemic Blade then he would probably kill over half the people in the red zone with just a single slash.</p><br/><p>The amount of mana that the guy who had destroyed the whole world had wouldn’t even be comparable to that which he possessed.</p><br/><p>There was a limit to Hansoo’s mana and there was a limit to how much he could do but it was indeed a skill that was frightening enough to be comparable to Demonic Dragon’s Reinforcement.</p><br/><p>‘…But it does indeed take up a huge amount of mana. I need to find out a few different uses for this later.’</p><br/><p>He could feel his mana emptying out despite him only slashing a few times.</p><br/><p>It was a skill that had clear pros and cons unlike the Demonic Dragon’s Reinforcement which had amazing balance.</p><br/><p>But Hansoo didn’t change his expression while his mana was emptying out, he remained normal and slashed a few more times to cause a massacre.</p><br/><p>‘I should warn them just in case.’</p><br/><p>………………………………..</p><br/><p>Sofía made an awkward expression while looking at Hansoo from afar.</p><br/><p>‘I worried for no reason.’</p><br/><p>The one who had been the most shocked when Hansoo threw away the relics was Sofía.</p><br/><p>Since though he was almost invincible with the relics, he wasn’t unbeatable without them.</p><br/><p>Since she had way more skills with higher masteries and had a stronger trait.</p><br/><p>His ring and armor were extremely powerful but she had more artifacts herself.</p><br/><p>She could only worry.</p><br/><p>Since she being able to barely contend with him meant that he was on equal ground with the other Departed Souls.</p><br/><p>He might’ve created some friction between those from the Six Pillars since they didn’t really like him.</p><br/><p>Jongsang looked at Hansoo with a slightly disliking expression as well.</p><br/><p>But that was a story of a few days ago.</p><br/><p>After seeing the strange golden spear and the suspicious skill, they were making an expression which told that they didn’t want to go against him.</p><br/><p>And the people who were watching from the distance were making expressions full of fear as well.</p><br/><p>Sofía looked at Hansoo, who had gathered up all the runes and was walking towards her, and asked:</p><br/><p>“How would we fare if we go up?”</p><br/><p>They were strong.</p><br/><p>But they had been stuck up against a wall for 5 to 6 years now.</p><br/><p>Since it had been years since they gathered the best skills that could come out from this place and had raised their masteries to the brim.</p><br/><p>And their battle experience could not increase since they didn’t have any more opponents.</p><br/><p>But those people who had gained better skills and artifacts in the upper zone and had fought with stronger foes will be stronger than them.</p><br/><p>Since there will also be people who had been there for 4 to 6 years and had not left like the Departed Souls here due to some circumstances.</p><br/><p>The artifacts they had were close to invincible here but could not be used above and the orange artifacts they gained from the Branch weren’t that high of a quality.</p><br/><p>‘Well. How would he know?’</p><br/><p>She had asked because of the difference in strength between herself and him but there was no way for him to know.</p><br/><p>But unlike Sofía’s thoughts, Hansoo was calculating things meticulously within his mind.</p><br/><p>‘Though she isn’t weak… Sofía is a strong 5th year. Departed souls are between weak 6th and normal 6th years. I should be around 7th year.’</p><br/><p>The artifacts they had were merely those of the lower level in the Orange Zone.</p><br/><p>The usual duration for people to go up from the Red to the Orange zone was 4 years.</p><br/><p>They wouldn’t be like 4th years who had just gone up due to their skill masteries but it would be hard for them to fight against those of the Orange Zone who were armed with better artifacts and runes.</p><br/><p>‘Well that’ll be solved when we go up.’</p><br/><p>Hansoo finished his thoughts and then looked at the giant lake, Mirror, which was filling up in the distance.</p><br/><p>He would leave as soon as the mana of the lake filled up since his runes were almost filled up.</p><br/><p>Sofía, who had been watching Hansoo until now, asked something that she had been curious about:</p><br/><p>“How did you know all of that by the way?”</p><br/><p>“What do you mean?”</p><br/><p>“That giant tree and the relics.”</p><br/><p>Sofía’s actual personality was quite competitive and full of curiosity.</p><br/><p>But there weren’t many things that drove either of these aspects of her personality lately.</p><br/><p>She had gotten as strong as she could so there wasn’t anyone to feel competitive against.</p><br/><p>Though the other six departed souls were stronger than her, they had been here for 7 to 8 years longer.</p><br/><p>According to talent, she was much better.</p><br/><p>There wasn’t much to be curious about.</p><br/><p>Since there wasn’t anywhere in the Red Zone that she hadn’t been to.</p><br/><p>And the places she hadn’t been to were too dangerous for her to go in just from curiosity alone.</p><br/><p>But the recently met Hansoo was constantly driving these two facets of her personality in a crazy manner.</p><br/><p>Hansoo shrugged his shoulders as he spoke.</p><br/><p>“Psychic powers.”</p><br/><p>“Don’t speak nonsense. Your trait isn’t that.”</p><br/><p>Hansoo had hunted in order to fill up his runes but Sofía didn’t really have much to do for the past few days.</p><br/><p>Playing with Camille was getting boring.</p><br/><p>Sofía had invested the rest of the leftover time in observing Hansoo and made a conclusion from her trait, Library.</p><br/><p>‘He isn’t a omniscient type like me.’</p><br/><p>Omniscient type.</p><br/><p>A word to call traits which helped the user know things that they couldn’t possibly know with their current knowledge.</p><br/><p>But as Hansoo laughed and refused to answer, Sofía’s eyes squinted down.</p><br/><p>‘It’s a secret huh.’</p><br/><p>There was something more to it but she could not figure out what.</p><br/><p>‘Hmm…Hmmmm.’</p><br/><p>Sofía pondered inwardly for a moment and then made her decision.</p><br/><p>…………………………………….</p><br/><p>Forked Lightning in the right hand.</p><br/><p>Nurmaha’s Ring on the left hand.</p><br/><p>Thousand Soldiers Armors over the whole body.</p><br/><p>Hansoo, who had filled up his runes, now looked at the filled up lake.</p><br/><p>It wouldn’t only open once a month anymore.</p><br/><p>Since energy was overflowing throughout the World Tree.</p><br/><p>‘It’s time to go up.’</p><br/><p>Hansoo, who had been looking at the Mirror which was ready to accept anybody at any time, thought of Sangjin who he would meet up soon and then spoke towards Sofía standing next to him.</p><br/><p>“You want to go with me?”</p><br/><p>Sofía nodded at his words.</p><br/><p>“I know that your trait isn’t that of the Omniscient type. Let’s have a win-win. You won’t know what’s above, it’ll be good for us to help each other.”</p><br/><p>Though following him was due to her curiously, she couldn’t say this out aloud due to her pride so she made an excuse of survival and waited for a reply with a nervous mind.</p><br/><p>‘Is he going to refuse?’</p><br/><p>This could happen.</p><br/><p>‘No. It felt like he was treating me well, no way.’</p><br/><p>Observing for a few days, she found out that he was rather kind to her.</p><br/><p>He kindly answered everything she had asked.</p><br/><p>‘I guess beauty works again.’</p><br/><p>Though strength was the main part in the Otherworld so most people didn’t approach her with ease but in the real world there was a truckload of boys who had followed her around while she was attending college.</p><br/><p>Hansoo chuckled while looking at Sofía who was praising herself inside.</p><br/><p>Because of old memories.</p><br/><p>Sofía Vargera.</p><br/><p>Member of the Final Brigade which consisted of the 100 most powerful people.</p><br/><p>His comrade.</p><br/><p>And a woman who had led him around like a teacher when he was roaming around the Otherworld.</p><br/><p>These were the words Sofía told him when they first met.</p><br/><p>Of course the situation had changed a bit now.</p><br/><p>Sofía, the person who had found his and Miyamoto’s treasure while they were barely holding onto their lives while going up against the Six Pillars and the Twelve Roots of the Red Zone and had gone up due to not having any people to contend against.</p><br/><p>This was something that should happen 2 years from now.</p><br/><p>‘It’s nice to meet you again.’</p><br/><p>“Sure. Let’s go together.”</p><br/><p>Hansoo laughed as he looked at Sofía.</p><br/><p>Proofreader’s note</p><br/><p>This is a sponsored chapter.</p><br/><p>Hansoo finally got to rest for a few days!</p><br/><p>Preemptively corrected a though/but situation…</p><br/>\n</div>"}