{"title": "Chapter 93: Wasp Legion (4)", "id": 93, "volume": 1, "url": "http://boxnovel.org/reincarnator-chapter-93-wasp-legion-4", "volume_title": "Volume 1", "body": "<h1>Chapter 93: Wasp Legion (4)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Kugugugugu</p><br/><p>Hansoo clenched his teeth while looking at the spear that was constantly pushing him back.</p><br/><p>Despite him blocking it with all the power with his relics, the spear was constantly thrashing about in order to penetrate his heart.</p><br/><p>‘Damnit. Is this the Forked Lightning I heard about?’</p><br/><p>He had heard about it.</p><br/><p>The ultimate spear which was created to crush down those who opposed the King.</p><br/><p>Like how the relics got their energy from the Divine Stone Fragment, the Forked Lightning also received energy from the Divine Stone Fragments and showed as much power as the god’s punishment would within the area where the World Tree’s power reached out to.</p><br/><p>There were two remaining fragments.</p><br/><p>One in the heart of the Wasp Legion’s Queen.</p><br/><p>And one in the Flower which had the palace within it.</p><br/><p>From the might of it, it seemed like it flew at him with the power of the Divine Stone from the Flower.</p><br/><p>‘Did the King decide to help the clone? Or did the King himself set out?’</p><br/><p>Many different thoughts replaced each other in the short moment while he was flung out from the Vassal’s tunnel.</p><br/><p>But a conclusion wasn’t made.</p><br/><p>‘There’s not enough information.’</p><br/><p>Hansoo clenched his teeth and then balanced himself in position.</p><br/><p>He had to now fight two things.</p><br/><p>The Wasp Legion and Forked Lightning.</p><br/><p>The Wasp Soldiers were charging much more viciously.</p><br/><p>‘First… Seal this Spear.’</p><br/><p>Hansoo then grasped onto the Spear that was trying to penetrate him.</p><br/><p>So that it wouldn’t be able to get out.</p><br/><p>If the clone felt threatened then it will retrieve the Forked Lightning and instead smash down upon the Departed Souls.</p><br/><p>That’ll be troublesome.</p><br/><p>‘You, play with me.’</p><br/><p>Kududududk</p><br/><p>Soon Hansoo and the golden spear’s strength battle begun.</p><br/><p>Kwagagagak</p><br/><p>The golden spear continuously pushed Hansoo back and slammed him onto the Pillars of the World Tree.</p><br/><p>Because of this Hansoo smashed the Pillar of the World Tree with his whole body and then fell downwards…</p><br/><p>‘Kuuuu.’</p><br/><p>A pain which felt like his whole body was being crushed.</p><br/><p>Hansoo looked at the spear, which was constantly adjusting its own angle in order to penetrate his heart, and then poured out strength from all over his body.</p><br/><p>He was barely holding on with his strength before becoming a skewer.</p><br/><p>‘I heard that it wouldn’t stop until it penetrated the heart of the target once it was released but…’</p><br/><p>Kiiing</p><br/><p>Hansoo’s relics madly resonated as they poured out the Divine Stone Fragment energy.</p><br/><p>The energy that came out from the Divine Stone Fragment stuck onto the Relics and then stormed around in order to suppress the golden spear.</p><br/><p>Kiriririk</p><br/><p>The golden spear was shocked.</p><br/><p>The golden spear also used the Divine Stone’s energy but if they were to continue to fall down like this then it will get further away from it’s energy supplier.</p><br/><p>The spear that was plummeting downwards trying to pierce Hansoo suddenly started to thrash around.</p><br/><p>Then it tried to fly off in a different direction with Hansoo still on it.</p><br/><p>‘A bit troublesome.’</p><br/><p>Hansoo got one of the five relics around his body, the chains, and started to wrap it around the spear.</p><br/><p>Once the chains that were connected to the seven marbles were wrapped around the golden spear, Hansoo used his mana to pull Ekidrang’s Relic, the seven marbles, onto the ground.</p><br/><p>Kugugugu</p><br/><p>‘Damnit. It’s still not enough?’</p><br/><p>Hansoo was shocked at the golden spear that did not get pulled down to the ground easily.</p><br/><p>‘But… This is enough for me to move it.’</p><br/><p>Hansoo glared coldly at the golden spear that was trying to go up the World Tree through his body and then slammed his hand onto the World Tree’s surface.</p><br/><p>Kududududk</p><br/><p>He then started to slam his hands and feet inside the World Tree as he slowly moved down.</p><br/><p>The golden spear had now even given up trying to penetrate Hansoo’s heart and was trying to go back to the location it had been shot from.</p><br/><p>‘It’ll be a bit troublesome if that happens.’</p><br/><p>Once it goes back and they shoot it with this power a few more times, even Hansoo will have holes all over his body.</p><br/><p>He needed to get rid of it at this moment when he got ahold of it.</p><br/><p>Kuduk. Kudududk.</p><br/><p>The golden spear’s strength was so strong that the chains wrapped around it got so tight to the point where they seemed like they would snap and the marbles latched onto it also trembled but the golden spear slowly got pulled downwards from Hansoo’s strength combined with the relics as if it was an eagle that was caught within a net.</p><br/><p>The people who were watching this scene from below made a confused expression.</p><br/><p>“Huh? Why is it coming back down?”</p><br/><p>“What is that?”</p><br/><p>While people were making confused expressions as they saw Hansoo, who had gone up at a extreme speed, slowly crawl down, Hansoo shouted loudly.</p><br/><p>“You need to bring all the chains and the Seven Star Marbles that made up the formation over here! Hurry!”</p><br/><p>‘If it isn’t enough with one person’s strength then… I just need to stack tens of thousands of them.’</p><br/><p>If he had his ankles caught here then the above situation couldn’t be solved with just the departed souls.</p><br/><p>Since he didn’t know how the Wasp Legion or the King would act.</p><br/><p>Kiriririrk</p><br/><p>The golden spear that had been caught felt that the situation was dangerous as it started to thrash around madly and stabbed at Hansoo.</p><br/><p>Kwaduk</p><br/><p>Kudududk</p><br/><p>“Quickly! Hurry up!”</p><br/><p>The people finally realized something was wrong after seeing Hansoo falling towards the ground while fighting against the Golden Spear, quickly brought the chains and marbles that set up the formation and ran up to Hansoo.</p><br/><p>Then they placed the marbles onto the chains and threw them towards the spear that was trying to penetrate Hansoo in a mad manner.</p><br/><p>Chwarurung</p><br/><p>Kuduk</p><br/><p>‘Kuhuk!’</p><br/><p>Hansoo, who had his left arm grazed by the thrashing spear, bit onto his teeth, grabbed onto the chains that were flying up from all around him and started to wrap them around the golden spear.</p><br/><p>One, two.</p><br/><p>Soon thousands of giant chains wrapped around the golden spear.</p><br/><p>‘This should be…’</p><br/><p>Hansoo retrieved his relic that was wrapped around the Golden Spear.</p><br/><p>He couldn’t stay here forever.</p><br/><p>He had to tie down this spear as fast as possible and then go back up.</p><br/><p>Kararararang</p><br/><p>As soon as Hansoo backed off a bit the golden spear started to madly thrash around again.</p><br/><p>Tototong</p><br/><p>At the same time thousands of chains and the marbles that were attached onto it made noises as they started to get dragged up into the air.</p><br/><p>The people freaked out.</p><br/><p>“What the hell is that!”</p><br/><p>“Damnit! Throw more! Tie it with more!”</p><br/><p>Tititing</p><br/><p>The chains that had been supplied with the Divine Stone Fragment’s energy started to blow apart.</p><br/><p>The people who had been maintaining the formation and watching the scene up until now all freaked out as they ran towards the golden spear with their relics.</p><br/><p>They didn’t know what it was but from the way it thrashed around it seemed like they would become skewers once it was released.</p><br/><p>Soon almost ten thousand chains were tied onto it along with the marbles and only then did the golden spear’s strength and the people’s strength were equalized.</p><br/><p>Kudududk</p><br/><p>“Hoooh… Damnit. Throw some more!”</p><br/><p>“Damnit! If we take out more then the formation will be unstable!”</p><br/><p>Hansoo, who had barely tied down the Forked Lightning, looked at the status of the chains and then shook his head.</p><br/><p>‘It won’t hold it for long.’</p><br/><p>Chiiiik</p><br/><p>Despite having been completely tied down its speed and penetration, the chains were slowly melting down from the mana lightning imbued within the spear.</p><br/><p>At this rate he didn’t know when it will come out to threaten him again.</p><br/><p>‘I need to quickly go back up.’</p><br/><p>Hansoo clenched onto his teeth and the started to climb up at a quicker pace.</p><br/><p>……………………………….</p><br/><p>Ooooong</p><br/><p>Tekilon frowned as he felt the spear wasn’t moving the way he wanted.</p><br/><p>Which meant that the Forked Lightning had been tied down somewhere.</p><br/><p>Tekilon quickly looked below with his mana.</p><br/><p>And then frowned as he saw the spear completely tied down.</p><br/><p>‘The Thousand Soldiers Armors played a role huh.’</p><br/><p>With that method it could indeed temporarily suppress down the golden spear.</p><br/><p>‘Damnit.’</p><br/><p>Tekilon glanced at the old Tekilon behind him.</p><br/><p>Himself of the past was much more powerful but did not have any thoughts of acting despite that.</p><br/><p>‘Damnit. There won’t be a need to struggle like this if he helped.’</p><br/><p>The young Tekilon clenched onto his teeth and then shouted.</p><br/><p>“Why aren’t you helping! Don’t you feel sorry for the clansmen! We need to try even if there is a slight amount of possibiloty!”</p><br/><p>The old Tekilon looked at the young Tekilon for a bit and then spoke out.</p><br/><p>“I had many thoughts after the Dimensional portal failed. Because of that I was able to think back about a lot of things.”</p><br/><p>“…”</p><br/><p>“The time when our world was destroyed. Do you remember?”</p><br/><p>The young Tekilon grinded his teeth at those words.</p><br/><p>The disease which had sent their entire world into destruction.</p><br/><p>No, a Calamity which had the form of a disease.</p><br/><p>The disease of unknown origin sent all of them close into extinction not long after it was spread.</p><br/><p>“Do you remember around when that disease started to spread out?”</p><br/><p>The young Tekilon pondered for a while and then spoke out.</p><br/><p>“…It was around when our body reconstruction surgery was being used perfectly and had been commercialized.”</p><br/><p>Thanks to this their race had been able to have a much stronger body than ever before.</p><br/><p>Before this they could only fight with limited supplies because they lacked everything.</p><br/><p>Since dangers constantly stormed from the outside and they were always short on food.</p><br/><p>But the body reconstruction surgery solved all their problems in an instant.</p><br/><p>Their stamina got strengthened, they needed to eat much less in order to survive, their longevity lengthened and their battle powers increased by a huge amount.</p><br/><p>Actually their tribe’s original body wasn’t that different from those things below.</p><br/><p>But their body which had gone through the surgery had changed close to a beasts and soon after their body reconstruction surgery had been perfected and commercialized, their whole race had finally united all together.</p><br/><p>For the first time in history.</p><br/><p>Then the Calamity of Death enveloped that specific race who were filled to the brim with hopes and dreams.</p><br/><p>Their race screamed out in despair after falling into depravity.</p><br/><p>That they had received a befitting punishment after invading god’s territory of reconstructing the body.</p><br/><p>‘Damnit…’</p><br/><p>While the young Tekilon was frowning while thinking of those times, the old Tekilon spoke again.</p><br/><p>“Yes. And do you remember when we had come over here in the soul form?”</p><br/><p>“…When the World Tree was created.”</p><br/><p>“Yes. When this side had been all united together from the World Tree’s power.”</p><br/><p>Their growth was slow, they were always threatened by the toxic waters and they always lacked food.</p><br/><p>The Elvenheims, who had been constantly fighting after being divided into hundreds of different tribes, met a grand unification not long after the World Tree was created.</p><br/><p>And then they face total annihilation due to Tekilon who had come over with his soul.</p><br/><p>“No way…”</p><br/><p>Games were only fun when there were competition and enemies.</p><br/><p>As soon as they gained a grand unification and had peace, both the races treaded the path of total destruction.</p><br/><p>As if somebody threw over the game board that had gotten boring.</p><br/><p>“What would we do even if we save our race at this point. We will need to keep fighting and fighting even if we save them.”</p><br/><p>“…Isn’t that just an estimate?”</p><br/><p>The old Tekilon shook his head.</p><br/><p>“It’s not. Look at the beasts below. That’s not something we created right?”</p><br/><p>“…Then?”</p><br/><p>“Something came to me one day.”</p><br/><p> (*TL: NOOOOOOOO THEY’RE BACK)</p><br/><p>Tekilon, who had been exhausted beyond what he could endure, nodded at the fairy shaped existence and then fell into slumber.</p><br/><p>“It’ll… be okay to unify now. But we will just get swept over by the war with the other races in the place called the Abyss.”</p><br/><p>The young Tekilon just grinded his teeth.</p><br/><p>“Nonsense. How did I become like this?”</p><br/><p>“What?”</p><br/><p>“So what if we become a chess piece for somebody else? We can keep living if we continue to fight.”</p><br/><p>“…”</p><br/><p>“It was a history of battles anyway. To not want to fight after tasting the short amount of peace.”</p><br/><p>Before the unification.</p><br/><p>They had fought and fought in order to survive.</p><br/><p>It was set up so their race, the Elvenheims and all other races below had to fight in order to survive.</p><br/><p>‘The fact that we have to continue to fight in order to survive is the same as saying that there is no absolute existence.’</p><br/><p>If the only way to live was to fight then they just needed to do what they had always done.</p><br/><p>Even if there was an absolute existence they won’t butt in randomly in order to enjoy the fun.</p><br/><p>Since a game where one can change the rules won’t be fun.</p><br/><p>“Don’t say meaningless things. Saving them is the first priority. Give me the power to control the Wasp Legion. I will finish it off.”</p><br/><p>“…”</p><br/><p>The Old Tekilon sighed as he transferred the shining star symbol on his head.</p><br/><p>……………………………………..</p><br/><p>Ooooong</p><br/><p>The Queen had lost all its power to something which had invaded its head.</p><br/><p>Tekilon who had become the new king gave an order as soon as he got control of the Queen.</p><br/><p>For the Wasp Legion to attack the people hiding around the strange pillars.</p><br/><p>To smash apart the formation and to release the Forked Lightning.</p><br/><p>Soon the giant wasps that weren’t moving in order to protect the Queen started to rush downwards.</p><br/><p>At the same time he gave a different order to the newly evolved bees.</p><br/><p>To buy time against the invaders who were coming up through the Pillar.</p><br/><p>Hansoo, who had been climbing back up through the Vassal’s Tunnel, grinded his teeth at the info that was coming in through the World Tree.</p><br/><p>‘He had received the power. Or the King himself has moved out.’</p><br/><p>It was now time to fight.</p><br/><p>Whether the time for the tied down Forked Lightning to get released from the Wasp Legion was faster.</p><br/><p>Or him smashing through the Wasp Legion and getting rid of the Queen and the Clone was faster.</p><br/><p>‘…The quicker I finish this off the more people will stay alive.’</p><br/><p>Hansoo breathed in deeply and then started to madly run in order to catch up to the Departed Souls who would have already gone up.</p><br/><p>Proofreader’s note</p><br/><p>This is a sponsored chapter.</p><br/><p>So actually some people are clever (the one throwing chains and not trying to kill Hansoo who’s in a difficult position). If Hansoo transforms, would the lightning spear stop after going through one of his three hearts?</p><br/><p>Also, please check the God of Cooking series, a chapter just got posted! (shameless advertising)</p><br/>\n</div>"}