{"title": "Chapter 90: Wasp Legion (1)", "id": 90, "volume": 1, "url": "http://boxnovel.org/reincarnator-chapter-90-wasp-legion-1", "volume_title": "Volume 1", "body": "<h1>Chapter 90: Wasp Legion (1)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>“…Uh?”</p><br/><p>One of the Departed Souls, Baek Jongsang, freaked out as the countless amounts of skills on his body stopped working.</p><br/><p>‘What? Did something happen?’</p><br/><p>There was no way Miyamoto had died.</p><br/><p>Jongsang quickly looked towards Miyamoto who would be at the nerve in the distance.</p><br/><p>And then squinted his eyes.</p><br/><p>‘…Not there? Did he really die? Huk!’</p><br/><p>Jongsang clenched his teeth and dodged the tail which rushed towards him while he was thinking about other things.</p><br/><p>‘It’s harder without the skills!’</p><br/><p>The skills they had were also amazing.</p><br/><p>But it was a system where all the core skills were owned and shared by Miyamoto.</p><br/><p>And once all those skills disappeared the intensity of the battle suddenly multiplied by several fold.</p><br/><p>‘Damnit… We might die when the situation is like this.’</p><br/><p>Jongsang clenched his teeth.</p><br/><p>Since the situation was so dangerous even Miyamoto could die.</p><br/><p>Since the strongest person after Miyamoto, himself, had been struggling like this.</p><br/><p>But for a person who had been surviving for 20 years to disappear like this.</p><br/><p>‘…Something’s amiss.’</p><br/><p>The others didn’t know but Jongsang, who had been the longest with Miyamoto, knew about him a bit more.</p><br/><p>Miyamoto was a person who usually cared for his image but then would throw all of them as sacrifice in order to survive.</p><br/><p>Only such a dangerous situation didn’t exist and they were only on the same boat because he gave them strength but he was definitely not a good ally to have.</p><br/><p>But for the person who was so focused on living to die this easily and quietly?</p><br/><p>This was important.</p><br/><p>Since if Miyamoto was killed by someone with evil intentions then they won’t be able to get exempt from it either.</p><br/><p>Since it couldn’t be part of them so there was only 1 suspect.</p><br/><p>Jongsang, who had been making a wondering expression, realized that this wasn’t the time for that.</p><br/><p>Since it looked like he would die at this moment if they didn’t finish off the Ouroboros.</p><br/><p>‘Let’s focus.’</p><br/><p>They just needed to burn one more nerve after this.</p><br/><p>It wasn’t impossible even without Miyamoto.</p><br/><p>‘I’ll find out… After.’</p><br/><p>Jonsang madly rushed towards the Ouroboros after finishing his thoughts.</p><br/><p>…………………………………….</p><br/><p>Kududududu</p><br/><p>Hansoo pulled out the Divine Stone Fragment from the heart of the Ouroboros.</p><br/><p>Ooooong</p><br/><p>‘Three fragments now. The clone ran away huh.’</p><br/><p>He ran towards the head as soon as he paralyzed the movements of the Ouroboros.</p><br/><p>Just in case the clone was there.</p><br/><p>But it had been a while since it had left.</p><br/><p>‘Did it go to the Wasp Legion?’</p><br/><p>Wasp Legion.</p><br/><p>The last of the Four Great Calamities.</p><br/><p>Unlike the other calamities who showed off a humongous body along with a inner defensive system, this thing had a Queen and hundreds of thousands of soldier wasps protecting it.</p><br/><p>It was a meager number in comparison to the parasites but each one’s strength couldn’t even be compared.</p><br/><p>Since even the Ouroboros couldn’t climb up because it feared that swarm.</p><br/><p>‘They’re quite befitting as the gateway.’</p><br/><p>There weren’t any tricks that would work against the Wasp Legion’s Queen.</p><br/><p>Since it would instantly get rid of things that would become a threat to the Queen because of its cautiousness.</p><br/><p>‘This time it’s really a face to face.’</p><br/><p>He couldn’t be bothered to fight hundreds of thousands of the Wasp Soldiers.</p><br/><p>He had to aim for the Queen while others were busy fighting off the Wasps and kill it off instantly.</p><br/><p>The battle power of the Queen was the same as Akuma and maybe even beyond that.</p><br/><p>‘At least this guy didn’t fall off.’</p><br/><p>The thrashing Ouroboros just froze up while tightly coiling around the World Tree as all its nerves were disconnected.</p><br/><p>Though he had sent in the neurotoxin in order to prevent this from the start but he was scared that it would fall because the movements of it had been so vicious but thankfully such a thing didn’t happen.</p><br/><p>If this thing was left alone then it will slowly get absorbed by the World Tree and become the nutrients for it.</p><br/><p>‘Good.’</p><br/><p>At that moment somebody walked towards Hansoo.</p><br/><p>Baek Jongsang asked Hansoo immediately as soon as he barely caught his breath,.</p><br/><p>“Anyways what are you going to do now? Are you… Trying to kill the final one too?”</p><br/><p>Jongsang then looked into the army above in the sky.</p><br/><p>The high branches couldn’t be seen because they were covered by the clouds but people around the level of Departed souls and high levels within the Six Pillars knew.</p><br/><p>As to what was hidden within the cloud.</p><br/><p>‘Since it wasn’t just one or two who had been eaten after setting foot in there…’</p><br/><p>The Wasps nibbled up the Branches and then brought it to the Queen.</p><br/><p>The Queen would then swallow those sturdy branches and give birth to a new Wasp larvae.</p><br/><p>The larvae created like this would be transferred to a nearby World Tree leaf nearby by a grown Wasp.</p><br/><p>From that spot the larvae will receive the protection of the grown Wasp as it nibbled upon the World Tree leaf and grew up to become a new Wasp.</p><br/><p>Of course the condensed area around the Queen and the larvae was a prohibited zone but there were always some people who were blinded by greed and ventured deep within.</p><br/><p>If they get caught by a Wasp on the way in then they would instantly become food for the larvae.</p><br/><p>These things didn’t eat the leaves because they liked it.</p><br/><p>They just couldn’t come down because the other Calamities were down there.</p><br/><p>They were only so because they grew up from leaves but if they absorb a human’s traits then they would become a stronger Wasp.</p><br/><p>‘…That’s even more dangerous.’</p><br/><p>Jongsang mumbled quietly.</p><br/><p>Since the Ouroboros was scary but that thing was even more so.</p><br/><p>Unlike the Ouroboros who waited for them while it sucked on the toxic waters, that thing was extremely direct in trying to multiply the swarm and was very offensive.</p><br/><p>Since it was more befitting to call them a race if the calamities until now could be called single organisms.</p><br/><p>But thankfully they didn’t come down from the branches.</p><br/><p>Since they were the favorite snacks of the Ouroboros even though they were dangerous.</p><br/><p>If they fly up then the Ouroboros would just simply stretch its long body and chew them up.</p><br/><p>‘Wait…’</p><br/><p>Jongsang thought up to that point and quickly looked into the sky.</p><br/><p>Then what would the Wasp Legion who hadn’t come down until now do?</p><br/><p>Jongsang realized that his worry was a foreshadowing after watching the sky for a while.</p><br/><p>‘It’s too quiet.’</p><br/><p>Hansoo laughed as he looked at that Jongsang.</p><br/><p>“There’s no way those guys would act that rashly when they need to protect the Queen.”</p><br/><p>From the Queen’s perspective it was good that her enemies had died off one by one but on the other hand it could’ve been dangerous for it too.</p><br/><p>There was no way the Wasp Legion would act rashly when they needed to protect the Queen in such a situation.</p><br/><p>‘I should still hurry the preparations.’</p><br/><p>He didn’t know what tricks the clone had up his sleeves but he needed to do what he had to.</p><br/><p>When Hansoo tried to quickly run down the World Tree in order to organize the situation below, Jongsang opened up and spoke the question that’s been stuck in his mouth after some pondering.</p><br/><p>“Did Miyamoto die? What happened?”</p><br/><p>They were too busy because they were trying to keep themselves alive so they couldn’t pay attention to Miyamoto in the distance but Hansoo had the whole battlefield within his sight.</p><br/><p>He would know exactly what had happened.</p><br/><p>Hansoo shrugged his shoulders at those words.</p><br/><p>“He went somewhere with the Feather.”</p><br/><p>“…”</p><br/><p>“It seems like he fell in danger while I was saving Sofía and wasn’t paying attention but… Don’t worry. Since it looked like he ran away safely using the Feather he will probably rejoin us soon. Anyways is the reason for all of you losing all your skills while fighting related to this?”</p><br/><p>“…”</p><br/><p>‘It’s quite logical…’</p><br/><p>Jongsang himself didn’t know all the functions of the Fragment of a Soul which he had received.</p><br/><p>There was a possibility of the skill’s sharing being disconnected when a teleportation occurred or they got too far from each other.</p><br/><p>He might even send them a message with his life intact.</p><br/><p>And according to Sofía’s words Hansoo had actually saved her from dying.</p><br/><p>Since there was no reason for him to save Sofía if he was going to clean them all up.</p><br/><p>There weren’t any faults with Hansoo’s words but the back of the head of Jongsang, who had been living in Red Zone for over 15 years, itched.</p><br/><p>Jonsang backed off after completing his thoughts.</p><br/><p>“Okay. let’s go down first.”</p><br/><p>‘…I need to talk to the other guys. Including the Six Pillars.’</p><br/><p>Jongsang looked at Hansoo with a slight uncertainty and then followed behind him downwards.</p><br/><p>…………………………………………….</p><br/><p>Tekilon made a bitter expression as he saw the giant body of the Ouroboros which could be seen from between the branches.</p><br/><p>He knew as soon as the poison-like foreign object came into the body of the Ouroboros.</p><br/><p>That he would soon invade.</p><br/><p>But there wasn’t anything he could do.</p><br/><p>Since he hadn’t gained the power of the king yet.</p><br/><p>It had already been a long time since Tekilon finished his pondering and came up.</p><br/><p>Instead of sticking by the thing he couldn’t control, it was better to gain control of the thing that lived in the branches.</p><br/><p>It would be good if that guy died whilst fighting the Ouroboros and he could just finish him off if he didn’t.</p><br/><p>And that work wasn’t working out very well.</p><br/><p>Bzzzzzzz</p><br/><p>Tekilon looked at the giant hornet-shaped Queen in front of him.</p><br/><p>Larvae that would become Wasp Soldiers were constantly being created from the lower abdomen of the Queen.</p><br/><p>Even more so than usual.</p><br/><p>‘Hooh. Nothing is easy.’</p><br/><p>It was very frustrating to have his ankles caught up in such a place when he didn’t even know the status of his Race.</p><br/><p>Tekilon thought of an event of the past while focusing on his work and sighing.</p><br/><p>The dried up trunk of the World Tree.</p><br/><p>Skeletal Branches.</p><br/><p>Destroyed Roots.</p><br/><p>It wasn’t like this when the Elvenheims existed and the World Tree was normal.</p><br/><p>The branches and the leaves which covered the sky supplied all Elvenheims with teleportations.</p><br/><p>The fruit of the World Tree which stimulated the growth hormone surprisingly shortened the 100 years of time it required an Elvenheim to reach adulthood to 5 years.</p><br/><p>The tree had sucked up the Toxic Waters and created the land for the Elvenheim to live and supplied the endless Nutritional Fluid to eat.</p><br/><p>The population which always stayed low due to the extremely long growth period and the low fertility rate even with the Magical Engineering Technology exploded within the 100 years after the World Tree was created.</p><br/><p>‘This is why… I have to obtain this World Tree.’</p><br/><p>Then he needed to call his race to this side.</p><br/><p>If his race, which was close to extinction, wanted to return to the days of the past then the World Tree was a necessity.</p><br/><p>Since the basis of the strength of a race was their numbers in the end.</p><br/><p>This is why he hadn’t killed the World Tree after he created the Calamities.</p><br/><p>Since he had to revive it again.</p><br/><p>‘I need the relics you have.’</p><br/><p>At the same time he needed to kill the other races beneath.</p><br/><p>‘There’s only one race that can receive the protection of the World Tree.’</p><br/><p>Living together was impossible.</p><br/><p>Once a race started receiving the protection of the World Tree then all other races will be treated as foreign objects and get thrown out into the void by the World Tree.</p><br/><p>This is the reason why he had wiped off the Elvenheims.</p><br/><p>Since their race could not receive the protection if the Elvenheims existed.</p><br/><p>And it was the same for the ones below.</p><br/><p>‘Thinking about it. The thing I tried to completely suppress was greed.’</p><br/><p>His goal was the relics.</p><br/><p>Which meant that he didn’t really need to completely control the Calamities.</p><br/><p>Since he just needed to kill that guy and get the race below extinct.</p><br/><p>And because of this Tekilon was not currently trying to suppress his greed of wanting to rule.</p><br/><p>Rather he was stimulating his greed even more and was focusing on fanning it.</p><br/><p>If the Ouroboros was an organism that focused on eating, this one was for breeding.</p><br/><p>The huge amounts of larvae that constantly popped out proved this.</p><br/><p>‘Good.’</p><br/><p>In normal circumstances he would’ve never created this many larvae no matter how greedy he was.</p><br/><p>Since the World Tree’s leaves were way too scarce to feed all these larvae.</p><br/><p>But wasn’t there an amazing source of food?</p><br/><p>‘Ouroboros. I need you to help me in a slightly different way now.’</p><br/><p>The larvae followed the Queen’s orders and burrowed into the Branches.</p><br/><p>And then got onto the Exterior which supplied the Nutritional Fluid and started to swim somewhere.</p><br/><p>Chururururk</p><br/><p>The harsh flow of the Nutritional fluid rushed towards the larvae but it was still the larvae of a Wasp Soldier.</p><br/><p>There was nothing to say about its sturdiness and strength.</p><br/><p>But the larvae that were heading towards the Pillar immediately stuck onto the walls of the Exterior as a strange scent could be detected.</p><br/><p>The scent of a predator.</p><br/><p>But it was now a dead predator.</p><br/><p>It would now just be meat that would become nutrition for them.</p><br/><p>The larvae dug out of the Exterior and then landed on the corpse of the giant snake coiled around the World Tree.</p><br/><p>And the tens of thousands of larvae that had arrived started to devour the giant body of the Ouroboros.</p><br/><p>The Larvae were thrilled.</p><br/><p>The genes of an extremely strong and vicious existence that couldn’t even be compared to the soft leaves.</p><br/><p>The larvae prepared to become a new existence as they ate up the meat that was filled with those genes and the nutrition.</p><br/><p>Proofreader’s note</p><br/><p>This is a sponsored chapter.</p><br/><p>Is it just me or the less calamities there are the more dangerous the situation is?</p><br/><p>Changed Sophia Vargera to Sofía Vargera and Royal Bees to Wasp Legion. Will edit previous chapters.</p><br/>\n</div>"}