{"title": "Chapter 108: Akaron (3)", "id": 108, "volume": 2, "url": "http://boxnovel.org/reincarnator-chapter-108-akaron-3", "volume_title": "Volume 2", "body": "<h1>Chapter 108: Akaron (3)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Hoooong</p><br/><p>Hansoo pushed Sofía away as he saw the fist flying towards her and took her spot instead.</p><br/><p>Kudududuk</p><br/><p>Hansoo raised his spear, plunged it into the ground in front of him and then made a defensive posture as he poured the energy from the Demonic Dragon’s Reinforcement onto the Thousand Soldiers Armor.</p><br/><p>The fist of the Garde-barong, who had turned a color of oxidized bronze and reached a height of 6m, smashed onto the top of the spear.</p><br/><p>Boom!</p><br/><p>The Forked Lightning bent to the point where it almost broke just from one smash.</p><br/><p>The mana reinforcement surrounding the Thousand Soldiers Armor dissipated as Hansoo got pushed back.</p><br/><p>A result from a single fist.</p><br/><p>Hansoo frowned at the oppressive amount of force as he shouted from that spot.</p><br/><p>“Priestess, Elkadion’s Crown of Thorns!”</p><br/><p>The Garde-barong flinched while he was pulling back his fist and looked at Hansoo in a different way.</p><br/><p>But not only did the Garde-barong stop, the Priestess who had turned around, Oteon, also flinched and looked at Hansoo with an expression of disbelief.</p><br/><p>‘…He knows about the Crown of Thorns?’</p><br/><p>Everybody knew about Elkadion, the priestess who had become a seed and departed.</p><br/><p>She was a symbol of victory of the 2nd Great War who had united the tribal and priestly sides of the race as well as helping Mekido to create the Body Enhancement Surgery.</p><br/><p>A promising candidate for the next Great Priestess, no, a person who had more influence than the Great Priestess of that time, Karbana.</p><br/><p>Elkadion.</p><br/><p>This wasn’t just from the amount of fame she had.</p><br/><p>Her holy powers had long surpassed those of the Great Priestess, Karbana.</p><br/><p>To the point where she had departed as a seed in order to prevent her and Karbana’s followers from clashing.</p><br/><p>‘If she had stayed… It might’ve been a bit different.’</p><br/><p>And the treasure in which she had poured all of her remaining strength and knowledge and created before she departed.</p><br/><p>.</p><br/><p>If they had this then they could reverse this tragic situation which had driven the Akaron almost into extinction.</p><br/><p>How could she not get tempted.</p><br/><p>But Oteon shook her head off.</p><br/><p>Humans could not be trusted.</p><br/><p>The reason why they had hid in this deep place and the reason why the Tube had reached black was all because of humans.</p><br/><p>Those guys will promise them things and then aim for their backs after.</p><br/><p>It was more dangerous the sweeter it was and that proposition was extremely sweet.</p><br/><p>Oteon clenched her teeth and then shouted towards the Garde-barongs.</p><br/><p>“He must’ve heard it somewhere… Just kill him!”</p><br/><p>But the Garde-barongs didn’t move a single step at her shouts.</p><br/><p>She was flustered at Garde-barong’s movements as she looked at the great warriors who protected the temple and then shouted.</p><br/><p>“Why aren’t you acting? You can’t possibly believe his words right?”</p><br/><p>At those words the first pillar, one of the Garde-barongs, shook his head as he spoke.</p><br/><p>“It’s not that but… Our job is to protect you.”</p><br/><p>The priestess was too important for their race.</p><br/><p>The job of protecting the priestess had higher priority over everything.</p><br/><p>Oteon made a dumbfounded expression at those words.</p><br/><p>“What?”</p><br/><p>What did that matter in this current situation?</p><br/><p>The first pillar alone could crush all of those guys.</p><br/><p>Why would she get in danger?</p><br/><p>The first pillar looked at the expression on Oteon’s face as he pointed towards the one whom he had smashed earlier with his eyes.</p><br/><p>And Oteon felt a chill run down her back as she looked at that direction.</p><br/><p>A man who held a spear towards their direction with extremely calm eyes.</p><br/><p>Something was clustered upon the tip of the Golden Spear that could not be identified.</p><br/><p>And the tip of the spear was pointing right at her.</p><br/><p>Only 1 thing came up in her head as she saw the spear.</p><br/><p>Margos Du Tiradus.</p><br/><p>A top tier predator which ate apart the Margoths and had a strong venom.</p><br/><p>Surprisingly, that aura and the sensation of those sharp teeth were radiating out from the tiny spear in the human’s hands.</p><br/><p>The first pillar shrugged his shoulder as he saw Oteon shrug her shoulders.</p><br/><p>“You see it right? Though blocking that spear isn’t hard… The moment that thing at the tip of the spear explodes out, half of the people here who are weak will die along with you.</p><br/><p>“…Damnit.”</p><br/><p>Their saplings were too important in a situation where they had a very low amount of individuals in their population.</p><br/><p>A sweet carrot along with a deadly whip.</p><br/><p>Oteon realized that she had been caught in a trap.</p><br/><p>“It might’ve been different if you had not been let in here in the first place but… Since you’re here let’s hear your story. Anyway you saved Ailen as well.”</p><br/><p>“…”</p><br/><p>It seemed like the first pillar quite liked this person.</p><br/><p>Oteon looked at the people in front of her with a disgusting frown on her face.</p><br/><p>………………………………………………….</p><br/><p>“First, I thank you for saving Ailen.”</p><br/><p>“Damn. Hearing a single thanks is damned hard.”</p><br/><p>Tares complained quietly from the side.</p><br/><p>This was reasonable.</p><br/><p>How could he feel good if he had almost become a grinded up fish cake when they had brought a person which they had saved?</p><br/><p>Oteon decided to ignore Tares, who was still mumbling, after giving him a cold look and then started to focus on the man in front of him.</p><br/><p>“Where did you hear about the Crown of Thorns?”</p><br/><p>Hansoo laughed as he spoke.</p><br/><p>“Well that’s not the important thing right now. We should solve the Gragos problem first.”</p><br/><p>“That’s something that you humans should be worried about. We just need to leave.”</p><br/><p>And their preparations were actually going well.</p><br/><p>Hansoo shook his head.</p><br/><p>‘No way.’</p><br/><p>A move would only have a high success chance when they prepared from the red warning.</p><br/><p>It wouldn’t be weird for the Gragos to roll whenever when it was in the black.</p><br/><p>But for them to start the move in such a situation.</p><br/><p>‘Well. They probably don’t have another way.’</p><br/><p>They didn’t know the reason and since it was hard to scout outside the temple due to the humans, the solution not being simple was obvious.</p><br/><p>Hansoo straightforwardly told them his situation.</p><br/><p>“I’ll speak truthfully. I have received the memory crystal of Elkadion in the Red Zone below.”</p><br/><p>Of course he had obtained it in the Abyss but there was no need to reveal this.</p><br/><p>‘With this much… The invasion of the Abyss wouldn’t get affected that much.’</p><br/><p>It was good to at least tell the origin of the intel if they wanted to have a good conversation.</p><br/><p>Oteon made a helpless expression as she heard the few pieces of information which came out from Hansoo’s mouth and could only verify them to be true.</p><br/><p>These things were things one couldn’t know unless they were Elkadion herself.</p><br/><p>‘Why did the relic the first seed left behind get to him?’</p><br/><p>Oteon looked at Hansoo with an expression of resentment but then spoke.</p><br/><p>“If you hand over that memory crystal then I’ll think about our alliance.”</p><br/><p>“Sorry to tell you but I memorized it all you see.”</p><br/><p>“…”</p><br/><p>Oteon sighed.</p><br/><p>Though she had expected it, not even a single gesture went through.</p><br/><p>Hansoo then looked at that Oteon as he continued to explain this plan.</p><br/><p>The cure for the other Gragos.</p><br/><p>And even the plan after that.</p><br/><p>‘…O Elkadion.’</p><br/><p>Oteon made a regrettable expression after saluting to Elkadion’s compassion which had found help for her race despite her death as she spoke towards Hansoo.</p><br/><p>“If we do things according to what you say then there’s nothing bad for us, it’s actually rather good. But there is a problem.”</p><br/><p>“What is it?”</p><br/><p>“Credibility.”</p><br/><p>She didn’t know how much was the truth and how much were lies.</p><br/><p>The thing he had brought was sweet beyond reason.</p><br/><p>Which means they had to be even more careful.</p><br/><p>Since if that sweet thing was a fatal poison and they swallowed it, they will have to suffer the</p><br/><p>consequences.</p><br/><p>Hansoo shrugged his shoulders.</p><br/><p>“What do you want?”</p><br/><p>Oteon spoke as if she was waiting for this moment.</p><br/><p>“This problem was probably caused by the humans again. Since it’s only normal for there to be some room according to calculations. So solve this problem and fix the black warning. Then we will help you. We won’t butt in on this current incident.”</p><br/><p>The problems created by humans had to be ended by the humans.</p><br/><p>Only then would they get the basic rights to an alliance.</p><br/><p>The Akaron had no thoughts of joining and bleeding because of the problem the humans had created.</p><br/><p>‘And… Watch over this guy during that time.’</p><br/><p>Words were light and the only thing that can actually determine a human being are their actions.</p><br/><p>An idea would be grasped as they see how he deals with this.</p><br/><p>Hansoo nodded.</p><br/><p>‘I should at least do this much.’</p><br/><p>Actually it will be quite a bit troublesome for him as well if the Gragos decided to roll.</p><br/><p>Since he needed to get to the White Tiger Gragos, , and meet the great patriarch.</p><br/><p>Hansoo thought of a moment about Sangjin and then spoke.</p><br/><p>“Let’s receive something ahead before we start.”</p><br/><p>Oteon pondered for a moment while looking at Hansoo and then nodded.</p><br/><p>“Okay. You and two people will receive the body enhancement surgery. The girl behind you. Mr. Tekilon. You should receive it as well. Though it would only take a bit if you were a part of our race… Since your bodies are of a different race it will take about 2 days. You cannot come out during the surgery.”</p><br/><p>The 3 males and 3 females, including Tares, frowned at those words.</p><br/><p>“What about us?”</p><br/><p>Tekilon spoke instead of Ailen.</p><br/><p>“It’s not something anyone can receive. This is only possible if you have a physical basis that can support it. If you undergo it with the current level of your physique then your bodies will blow up.”</p><br/><p>“…”</p><br/><p>The expressions of Tares and the others instantly got filled with dejection.</p><br/><p>It didn’t seem like a lie from the sorry expression of Ailen.</p><br/><p>Since there was no need to lie just to fool a few of them.</p><br/><p>They just needed to say they didn’t want to if they didn’t.</p><br/><p>Since they couldn’t do anything to them anyways.</p><br/><p>Tares made a dejected expression as he dragged himself towards the place they would stay at following Ailen’s guidance.</p><br/><p>…………………………………….</p><br/><p>The 3 males and 3 females looked at each other in the cave and whispered quietly at each other.</p><br/><p>“Damnit. Is it the end like this?”</p><br/><p>Takuya, one of the 2 males other than Tares mumbled with a depressed expression.</p><br/><p>For them to only receive a good sight after coming in here through hardships.</p><br/><p>Of course the Temple was not something anybody could see but their expectations had become too big because of this.</p><br/><p>‘…How did it turn like this?’</p><br/><p>Tares sighed.</p><br/><p>Helping Ailen in the beginning was actually very innocent.</p><br/><p>He had no form of greed.</p><br/><p>But the idea of a reward started to come up the harder it got to help out Ailen.</p><br/><p>From then the reward became a focus.</p><br/><p>They hadn’t stayed by Ailen to help her but more so because the amount of help they had given her was too regretful to leave behind.</p><br/><p>The reason why they had stuck around despite Ailen telling them that it’ll get dangerous and that she’ll go alone was because of this.</p><br/><p>While they were lost in silence, the female in the corner, Mirian, clenched onto the teeth and shouted.</p><br/><p>“So are we done like this? Without being able to get anything?”</p><br/><p>“…”</p><br/><p>“Tares. I keep saying this. You’re too soft. It’s not weird for us to die at any moment if we continue like this!”</p><br/><p>The fact that they were soft had gotten the six of them together.</p><br/><p>But then it won’t be weird for the six of them to die at any time if they continued to give free volunteer work.</p><br/><p>Tares sighed at Mirian’s words as she spoke.</p><br/><p>“What do you want to do?”</p><br/><p>Mirian pondered for a moment, cut her pants and then showed her thighs.</p><br/><p>And then she dug around her flesh for a bit and then pulled something wrapped in leather.</p><br/><p>Tares flinched after seeing this.</p><br/><p>“That… We denied that deal before.”</p><br/><p>A secret deal that they had gotten ahold of while following around AIlen.</p><br/><p>Tares cut them off on the spot.</p><br/><p>He didn’t know their objectives but why would they keep it so secretive if it was something that could be told to the world.</p><br/><p>He had thought that he denied them completely but it seems Mirian met them separately.</p><br/><p>Mirian clenched her teeth and then spoke towards Tares.</p><br/><p>“Tares. Decide. I understand you want to be kind to everyone but we can’t do that. We need to grab ahold of this deal.”</p><br/><p>Why would such a big chance like this come to them who were ordinary 5th years?</p><br/><p>They will really receive a big reward if they take this deal at this moment.</p><br/><p>Enough to get ahead in this Otherworld quite a bit.</p><br/><p>“Choose. Is it us? Or is it Ailen?”</p><br/><p>Tares made a complicated expression at the leather pouch which had red light shining off from it.</p><br/><p>………………………</p><br/><p>Kiiiing</p><br/><p>A man laughed coldy as he looked at the gem that was suddenly shining red.</p><br/><p>“I won right? I told you they’ll contact me.”</p><br/><p>The girl next to the man frowned at this.</p><br/><p>“Damnit. That Tares. I thought he was a good guy but he was just this much.”</p><br/><p>“There’s a limit to being good. You can’t ignore the opinions of others around you. Let’s go.”</p><br/><p>The man who had won received something from the woman in glee as he looked towards the location the gem was pointing at and slashed beneath his feet happily.</p><br/><p>“Let’s go quickly. We need to go with all our strength since they won’t be pushovers.”</p><br/><p>Though there was worry in the details there wasn’t any uneasiness in the voice.</p><br/><p>Kuuuuuunngg!</p><br/><p>Chuguk</p><br/><p>The man who had split the giant neck of the Margoth beneath his feet in two started to send carrier pigeons towards his clan in the distance.</p><br/>\n</div>"}