{"title": "Chapter 113: Gragos (3)", "id": 113, "volume": 2, "url": "http://boxnovel.org/reincarnator-chapter-113-gragos-3", "volume_title": "Volume 2", "body": "<h1>Chapter 113: Gragos (3)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Cracklecrack</p><br/><p>A large amount of body fluids, that resembled a small sea, was quickly being filled up.</p><br/><p>By the green stone, Graphite, that the Rerorerore clan was throwing.</p><br/><p>“Throw more!”</p><br/><p>“You’ll get caught in it if you get close! Use skills to pour them in!”</p><br/><p>Crack</p><br/><p>The moment one of the four materials that could affect the Gragos touched the bodily fluids it sucked in the fluids like a sponge as it started to increase in size over hundreds of times.</p><br/><p>Thanks to this the sea-like body fluid lake was getting slowly emptied at a visible pace.</p><br/><p>Jongsang, who had been watching this next to Gwanje, swirled his tongue around as he looked at the viscera deep within the Gragos.</p><br/><p>“Wow. Amazing. How did you manage to find such a place?”</p><br/><p>It wasn’t an easy place to locate since it wasn’t within the sphere of influence of humans.</p><br/><p>Gwanje smiled.</p><br/><p>“Well. I struggled a bit. It should at least be this much mister.”</p><br/><p>Jongsang nodded.</p><br/><p>But there was something he was worried about.</p><br/><p>“But what if it suddenly goes on a rampage while we take over it?”</p><br/><p>Gwanje shook his head at that.</p><br/><p>“Don’t worry about that, we’re taking care of it somewhere else. If it goes to plan then an amazing pet will be created.”</p><br/><p>Only four of the Ursa Major were here including Gwanje and Gordon who had gone to catch the little flies, the other three were nowhere to be seen.</p><br/><p>They were doing something somewhere else.</p><br/><p>‘Hmm. Then we can take over the Gragos and even find the Temple…Huh.’</p><br/><p>Jongsang freaked out in the past because he thought that Gwanje was going to kill this thing.</p><br/><p>Since two problems will rise up from that.</p><br/><p>First, if this guy fell then everyone above it will die.</p><br/><p>Second, if this guy died then the location to acquire the body fluids will disappear so they will starve.</p><br/><p>But Gwanje meant that he was going to take control of it.</p><br/><p>‘Well yeah. But how are you going to find the location of the Temple like this?’</p><br/><p>Jongsang looked at Gwanje with an amazed expression.</p><br/><p>There were a few things that Gwanje hadn’t told him, an outsider.</p><br/><p>In what way the thing they were doing was part of controlling the Gragos?</p><br/><p>And how he can find the hidden Akarons and find the location of the temple?</p><br/><p>‘He has a lot of secrets.’</p><br/><p>He had a few awkward spots and was a bit humane in the past but the current Gwanje had become a man who Jongsang couldn’t see through easily.</p><br/><p>Jongsang suddenly thought of something he had forgotten about when he had first met Gwanje.</p><br/><p>“Anyways, what happened to your wife and your daughter?”</p><br/><p>This guy wasn’t alone when he saved him.</p><br/><p>He had a 13 years old daughter because he had married early despite being 30 years old.</p><br/><p>He thought that Gwanje had placed them in a safe spot but he had never heard of him talk about his family.</p><br/><p>Gwanje shrugged his shoulders.</p><br/><p>“My daughter died and my wife is next to another man.”</p><br/><p>Though he was talking lightly, Jongsang felt a chill run down his back.</p><br/><p>‘…He’s not thinking of doing something crazy right.’</p><br/><p>Though others might not know but Gwanje was a guy who had given up everything in the Red Zone due to his family possibly being endangered by the Calamities and had gone up.</p><br/><p>If his family had gone through that then a corner of his mind might be seriously twisted.</p><br/><p>‘It’ll be a relief if his actual goal is just taking the Gragos over.’</p><br/><p>If this guy were to let off those twisted emotions then it won’t end in a small scale.</p><br/><p>Gwanje laughed towards Jongsang who was making an uneasy expression as he spoke.</p><br/><p>“I said don’t worry. Why would I do something weird when my wife would be in this Gragos somewhere? Anyways, do you want to eat this? It was created by petrifying the body fluids on the Graphite so it’s quite good. We named it Greenlight… they say sweet things help out in stress relief.</p><br/><p>Gwanje then handed over a small green candy with a stick stuck onto it.</p><br/><p>Jongsang frowned as he tasted the strange taste that he could not discern.</p><br/><p>Though it was sweet it was like adding sugar to waste water.</p><br/><p>“You damned bastard. This would definitely help out in stress relief… Anyways, why are you putting such lame names on these things?”</p><br/><p>Gwanje shrugged his shoulders.</p><br/><p>“To not get attached to it.”</p><br/><p>“What?”</p><br/><p>“It’ll be annoying if I put an awesome name on something I hate and get attached to it.”</p><br/><p>“…”</p><br/><p>While Jongsang was making a strange expression, a carrier pigeon flew towards Gwanje.</p><br/><p>Gwanje sighed as he looked at that carrier pigeon.</p><br/><p>‘Look. There’s no way I can like these guys.’</p><br/><p>…………………………</p><br/><p>‘Damnit! Why are there no reinforcements!’</p><br/><p>Booom!</p><br/><p>Gordon freaked out at the sudden change.</p><br/><p>Squirm squirm</p><br/><p>The situation changed the moment it turned into night.</p><br/><p>Endless amounts of soldiers were climbing out from beneath his shadow.</p><br/><p>Of course that wasn’t enough to beat him.</p><br/><p>Though the skill was extremely strong, it was still a bit lacking to close in the gap between a Baladi and a Margoth level.</p><br/><p>If only there weren’t suicide soldiers who constantly charged in.</p><br/><p>Booom!</p><br/><p>“Fuck!”</p><br/><p>The black creature which had crawled out from the shadow of the suicide soldier, which had turned into powder by his skill, madly rushed towards him.</p><br/><p>Gordon let go of the reinforcement while gathering it in his hands.</p><br/><p>Boooom!</p><br/><p>An explosion that far exceeded what a reinforcement could have created swept the area.</p><br/><p>The shadow soldier who had its upper body blown off fell backwards towards the ground.</p><br/><p>Then it disappeared as if it had melted and then absorbed back into the other shadows.</p><br/><p>Though his attack had destroyed the shadow perfectly, Gordon had no time for leisure.</p><br/><p>Since that guy will rejuvenate from the shadows, heal up and then climb back up.</p><br/><p>They only looked a bit black after that. The human-shaped creatures constantly coming back after healing back up no matter what kind of damage they received was tiring even for Gordon who had gone through a lot of things.</p><br/><p>‘Damnit! I have to get the main source!’</p><br/><p>They were obviously being recreated by mana.</p><br/><p>He had to kill the guy who was just throwing daggers at him from the distance.</p><br/><p>But there were too many things charging at him.</p><br/><p>‘Is he crazy or something? How many have you killed in that short amount of time?’</p><br/><p>The moment he thought that he had cleared quite an amount of shadow soldiers, suicide soldiers with the Limit Breaker expressionlessly charged towards him.</p><br/><p>And when he had taken care of those the shadow soldiers who had gone back to the shadows climbed up again.</p><br/><p>‘But… I can win!’</p><br/><p>Gordon grinded his teeth.</p><br/><p>This much was clearly winnable.</p><br/><p>Since his mana wasn’t endless and there was a limit to the number of suicide soldiers.</p><br/><p>Once his mana and the suicide soldiers ran out first then it would be his win.</p><br/><p>And Gordon was confident.</p><br/><p>Killing the Margoth alone wasn’t child’s play.</p><br/><p>Margoth hunting was something only possible after polishing one’s skills, artifacts and battle skills to the extremes.</p><br/><p>But the problem laid somewhere else.</p><br/><p>“You retards! Get back! Get the fuck back!”</p><br/><p>Gordon grinded his teeth as he shouted.</p><br/><p>The guy who had held him down with the shadow soldiers and the suicide soldiers was killing off the Rerorerore clansmen as they were approaching him.</p><br/><p>Weaker ones would get killed and supplement to the shadow soldiers.</p><br/><p>The dropped runes would be eaten up and increase the amount of mana.</p><br/><p>Decent ones would get suppressed, forced in the Lord symbol and then be recreated into a suicide soldier.</p><br/><p>The clan Lord who was acting as a slave below was about to fall down from exhaustion.</p><br/><p>He could only.</p><br/><p>He had to constantly give suicide orders, recreate symbols and accept new clansmen while others died, even the greatest Lords would get exhausted by this.</p><br/><p>No, the fact that he could do this much was already amazing.</p><br/><p>Gordon suddenly felt fear.</p><br/><p>Since he had killed almost a hundreds suicide soldiers the remaining amount should be less than 30 but there were still at least 80 left.</p><br/><p>Though the shadow soldiers had gotten weaker as if his mana was getting drained but the problem was Gordon himself.</p><br/><p>At this pace his stamina and mana would run out first.</p><br/><p>Then he would really die.</p><br/><p>‘Damnit! Where are they! It’s been a long while since I sent the carrier pigeons.’</p><br/><p>This was the first time he had missed the Ursa Majors and that lame name.</p><br/><p>If one of them came then they would be able to rip apart everyone here.</p><br/><p>But even after a long while nobody came.</p><br/><p>“Gwanje you crazy bastard! Come! Am I a hand which could be thrown away somewhere like here?! I’m not! Uwaaa! If you took me in then take responsibility!”</p><br/><p>Gordon shouted out in rage.</p><br/><p>…………………………………..</p><br/><p>“Mister let’s go. Since we finished everything we needed to here, let’s go to the next stage.”</p><br/><p>Gwanje, who had been receiving the carrier pigeons that were constantly flying in from all around, sent a few to two of the Ursa Majors who would be protecting other directions as he prepared to leave.</p><br/><p>Jongsang frowned as he saw this.</p><br/><p>“You said that there was another Ursa Major right? Aren’t you going to take him?”</p><br/><p>He said four total including himself.</p><br/><p>But Gwanje was going to leave while leaving one behind.</p><br/><p>‘Damnit. I can’t figure out what’s going on.’</p><br/><p>He had no way of knowing since he could only listen to what Gwanje was saying.</p><br/><p>Gwanje nodded.</p><br/><p>“Well. He’ll figure it out on his own. Getting to the Forest of Horns next is more important. Anyways, there is a large amount of graphites left.”</p><br/><p>The moment Gwanje mumbled ‘We were going to leave before it completely froze up anyway… Collected too much for nothing.’ and read the final carrier pigeon, he suddenly stopped as he read it.</p><br/><p>And then muttered towards Jongsang.</p><br/><p>“It seems like the ones Gordon chased before were baits. Formidable.”</p><br/><p>“Bait?”</p><br/><p>“It seems the Crown clan is invading this place.”</p><br/><p>It was clearly written on the carrier pigeon.</p><br/><p>That four Margoth levels of the Crown clan were invading this place.</p><br/><p>Others might’ve been different but how could the scouts mistake the faces of the Margoth levels?</p><br/><p>Normally he would ignore them.</p><br/><p>Since he had done everything he needed to here even if they had sniffed something.</p><br/><p>‘But… If it’s the Crown clan then the story changes a bit.’</p><br/><p>“You know them?”</p><br/><p>Jongsang asked.</p><br/><p>It was quite a stupid question really.</p><br/><p>Since the Crown clan was a humongous clan which had four Margoth level adventurers other than the clan patriarch himself.</p><br/><p>Reroreore clan, one of the top 2 strongest clans.</p><br/><p>And the Crown clan, one of the 3 strongest.</p><br/><p>How could Gwanje not know them?</p><br/><p>But the reason why Jongsang asked was because a clear emotion started to well up on Gwanje’s face.</p><br/><p>Gwanje laughed.</p><br/><p>“Of course, I told you that my daughter died earlier.”</p><br/><p>“…”</p><br/><p>“It’s a bit rude to go like this. We should leave them a gift.”</p><br/><p>Gwanje spat the Graphite candy in his mouth, the Greenlight, and then sent a carrier pigeon somewhere.</p><br/><p>…………………………………</p><br/><p>‘Tsk. They were pouring in Graphite. This is why the body fluid was drying up. Anyway, how did they find the reflux organ?’</p><br/><p>Hansoo clicked his tongue as he looked at the scene in the distance.</p><br/><p>Reflux Organ.</p><br/><p>It reorganized the bodily fluids that ran around the Gragos body once, sent the usable ones around the body again and the ones which ran out of nutriments were sent outside the body.</p><br/><p>Of course it was a place in the Gragos with the most body fluids since it was an organ created to decrease the waste of body fluid as much as possible.</p><br/><p>‘They’re falling back though. Was killing the Gragos not their objective?’</p><br/><p>If killing the Gragos was their objective then they had to pour more.</p><br/><p>But these guys were hurriedly packing up and quickly heading somewhere else.</p><br/><p>‘Then I shouldn’t have needed to come here… Why did the flip incident happen in the past?’</p><br/><p>If more wasn’t poured in then the graphites would get swept up by the body fluids and slowly get crushed apart.</p><br/><p>Bali Roper, the Margoth level expert of the Crown Clan, shouted as he saw the ones running away.</p><br/><p>“What are you doing? Let’s go ahead and wipe them out.”</p><br/><p>Their clan received tremendous amounts of stress since that crazy guy over there trying to assimilate them.</p><br/><p>If there wasn’t a power balance between the two strongest clans then a full frontal war would’ve happened already.</p><br/><p>So Bali Roper actually liked the current situation.</p><br/><p>‘Though I became a slave… It’s good as long as the result is good.’</p><br/><p>This guy had clearly said.</p><br/><p>That he would release them if everything went well.</p><br/><p>And if this guy helped then sweeping the main headquarters of the Rerorerore clan wouldn’t be that hard.</p><br/><p>Since the clan patriach, Gwanje, always liked to separate the Ursa Major and use them efficiently.</p><br/><p>‘There’s no way all of them would be here.’</p><br/><p>The four of them here and Hansoo could deal a serious amount of damage.</p><br/><p>Kuuuuuuuungg!</p><br/><p>While Bali Roper was laughing , a rough cry ran throughout in all directions.</p><br/><p>‘Margoth?’</p><br/><p>It wasn’t just one or two from the cries he could hear.</p><br/><p>‘Damnit.’</p><br/><p>Bali Roper made a frightened expression.</p><br/><p>They were called Margoth level because they could win a one versus one against the Margoths.</p><br/><p>But the cries told them that there were at least 20 of them incoming.</p><br/><p>Hansoo clicked his tongue as he looked at the Margoths charging from the distance.</p><br/><p>‘It seems like they are leaving after completing everything they needed to here but for them to go the extra mile and throw the Margoths here…Huh.’</p><br/><p>It seems like they weren’t even luring them to this location in order to prevent the Crown clansmen being able to chase them.</p><br/><p>Hansoo spoke towards Bali Roper next to him.</p><br/><p>“There’s no way that I’m the reason… Did you cause some sins against that guy?’”</p><br/><p>“…”</p><br/>\n</div>"}