{"title": "Chapter 134: Infection (3)", "id": 134, "volume": 2, "url": "http://boxnovel.org/reincarnator-chapter-134-infection-3", "volume_title": "Volume 2", "body": "<h1>Chapter 134: Infection (3)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 134: Infection (3)</p><br/><p>At the moment Epitros and Karen turned around and were about to head towards the hunting grounds.</p><br/><p>A voice called them out.</p><br/><p>“Hey. Over there. Come here for a bit.”</p><br/><p>“Mmm?”</p><br/><p>Epitros’s guard skyrocketed at the sudden voice that called him out.</p><br/><p>And even more so after checking the number of those who had walked out from the bushes.</p><br/><p>‘…There are hundreds of them, why were these guys hiding?’</p><br/><p>The man standing in the front saw Epitros being on guard on them as he spoke out.</p><br/><p>“Don’t be so guarded. We’re just here for a proposition.”</p><br/><p>“…Proposition?”</p><br/><p>“Yeah, I want to give you guys a chance as well.”</p><br/><p>Then the man standing in the front stared at the headquarters of .</p><br/><p>With an expression that wasn’t quite friendly.</p><br/><p>‘Hmm…’</p><br/><p>Epitros took a glance at the hundreds of people behind the man.</p><br/><p>Everyone was on guard against each other.</p><br/><p>Which meant that it hadn’t been long since they had met.</p><br/><p>Which also meant that these people also had received the proposition and gathered.</p><br/><p>‘What kind of proposition does he have…’</p><br/><p>Epitros focused and approached the man.</p><br/><p>………………………….</p><br/><p>“…So this is what you were counting on.”</p><br/><p>Gwanje muttered as he looked at the countless amount of people swarming in.</p><br/><p>With this many people they would not need to worry about manpower anymore.</p><br/><p>And even more so if these guys could be controlled this easily.</p><br/><p>The woman standing at the very front spoke out as she laughed.</p><br/><p>“It’s been a while Hansoo. You’re…Hansoo right?”</p><br/><p>Mihee, a college acquaintance whom Hansoo had spent the 1st tutorial stage with, looked at Hansoo with a strange expression.</p><br/><p>Though she had said this, there was no way that she could’ve forgotten about his face.</p><br/><p>It was just that his current physique was extremely different from that of her memories.</p><br/><p>Hansoo’s physique which had been like the one of a normal college student had turned into that of an American football player.</p><br/><p>‘Well, this looks much better.’</p><br/><p>She didn’t say it out loud but Mihee’s preferences were men who were like beasts.</p><br/><p>Hansoo nodded as he looked at the slightly blushing Mihee.</p><br/><p>“I had some things to do. Are you leading the first team?”</p><br/><p>Mihee nodded.</p><br/><p>“It seems I was quite talented in management. And the other people are the ones who use their strength. I’ve even brought the 1.”</p><br/><p>Hansoo nodded at those words.</p><br/><p>Since the manpower had come up, the process of stabilization will be quickened greatly.</p><br/><p>Though they were much weaker than the people of the Orange Zone, this wasn’t that much of a problem.</p><br/><p>Since the Akadus are the ones using the strength and these people only needed to be on the lookout properly.</p><br/><p>And once the Temple is fully recovered then the people who had come up from below would receive the Body Enhancement Surgery first so it wouldn’t be too problematic.</p><br/><p>The gap between them and the people of the Orange Zone would get shortened in just a bit.</p><br/><p>Mihee tapped the silver Akadus as if it was very fascinating.</p><br/><p>“These guys will be the ones helping us? Quite a strange thing you’ve got here.”</p><br/><p>The World Tree was fascinating as well but this was just as fascinating as the World Tree.</p><br/><p>A battle lifeform that moved on its own.</p><br/><p>‘I don’t know who made it but it’s really intriguing.’</p><br/><p>At that moment the three silver Akadus which had been standing still made kiiing noises as they looked at Mihee.</p><br/><p>Mihee flinched at the sudden movements and backed off.</p><br/><p>And then asked Hansoo.</p><br/><p>“This is safe right?”</p><br/><p>Gwanje answered instead.</p><br/><p>“It probably is miss. Since the Akarons left after leaving a bit of authority to Hansoo.”</p><br/><p>Taruhol, who had the Crown of Thorns, had something else to do so they had left behind an order which said to follow Hansoo and then departed.</p><br/><p>As long as Hansoo doesn’t go crazy, nothing would happen.</p><br/><p>The moment Mihee sighed in relief.</p><br/><p>Pududududk</p><br/><p>A carrier pigeon flew to Gwanje.</p><br/><p>And Gwanje’s expression turned ugly for a moment but then returned back to normal.</p><br/><p>“I’ll be right back after I take care of something.”</p><br/><p>Then Gwanje quickly disappeared.</p><br/><p>……………………………….</p><br/><p>“Come out.”</p><br/><p>Gwanje, who had arrived at the newly dug ant tunnels within the Lazar, searched for the one who had called him out.</p><br/><p>Suppressing the rage which made him want to charge at them this instant.</p><br/><p>At that moment somebody slowly walked out from the darkness.</p><br/><p>A man who was walking towards him with a mask on.</p><br/><p>‘Which bastard is he?’</p><br/><p>It was hard to even see the insides through the eye gaps as if he had done something to the mask.</p><br/><p>And he wasn’t alone.</p><br/><p>One of the people who had the mask laughed as they looked at Gwanje.</p><br/><p>“Woah. Don’t come too close. Your wife is held hostage. You didn’t get found out right? As we told you?”</p><br/><p>Gwanje grinded his teeth as he looked at his wife who was being held by the man while being unconscious.</p><br/><p>“I seemed quite easy to you huh?”</p><br/><p>“No not really. Who would find Margoth levels to be easy?”</p><br/><p>“…”</p><br/><p>“It was just that you were the only one nearby that we could hold someone hostage against. You know as well that there aren’t many people who still have something they hold dear more than their life right?”</p><br/><p>“…How did you get through the defenses?”</p><br/><p>The man laughed out loudly at those words.</p><br/><p>“Uwahahaha! Do you think that there is only a few people who hate the crazy plan that Hansoo guy you’re following has?”</p><br/><p>There would be people who would lose out and those who gain things once rules are created.</p><br/><p>The weaker people who had been suffering would receive great benefits.</p><br/><p>And the predators would lose out a huge amount since they wouldn’t be able to use their strength the way they wanted.</p><br/><p>And people who Gwanje would trust to guard his wife were of course on the level of the predators.</p><br/><p>“…What do you want. Do you think that you can flip the whole situation with me alone?”</p><br/><p>The masked man laughed.</p><br/><p>“No way, I know as well. How could we beat the Akadus.”</p><br/><p>The Akadus were the reason why they couldn’t go out and fight.</p><br/><p>Since the memory of the Akadus which had almost massacred the entire Orange Zone’s adventurers was still fresh in their head.</p><br/><p>“Then what do you want?”</p><br/><p>“Information.”</p><br/><p>“…What?”</p><br/><p>“Don’t play around.</p><br/><p>The man moved his blade against the neck of his wife, Mihyang, a bit closer.</p><br/><p>And then mumbled.</p><br/><p>“You think we’re stupid? Those Akadus things. What is controlling those things.”</p><br/><p>The man had been quite keen of the situation up until this point.</p><br/><p>The crazy Akadus had been calmed down the moment Hansoo and the Akarons arrived somewhere and did something.</p><br/><p>They didn’t just stop and instead followed the orders of the Akarons well and were acting voluntarily.</p><br/><p>‘I don’t know what it is but once I can acquire that then I would be able to get enough power.’</p><br/><p>Power to smash apart Hansoo who was trying to repress them with a huge amount of power that seemed very unfair.</p><br/><p>No, it would be much more than that.</p><br/><p>The person with that strength would become a new king.</p><br/><p>Gwanje quietly looked at the man and then replied.</p><br/><p>“Why are you doing this? Suddenly?”</p><br/><p>The man laughed coldly as he spoke.</p><br/><p>“You don’t know? Look at what that crazy bastard is doing. We were living very well. New rules are needed in the new world. We had been living in the Otherworld for over 5 years. This is what is normal and this is the way we should be living. But a bastard who hasn’t even been here for a year is trying to train us.”</p><br/><p>Gwanje grinded his teeth as he spoke.</p><br/><p>“We never told you to join us forcibly.”</p><br/><p>“He has the good stuff and is saying that he will only give it to those who follow him, isn’t that trying to train us? Don’t people usually do that when they’re training dogs? To follow their words since they have something tasty?”</p><br/><p>“…”</p><br/><p>“He’s trying to tame a wolf which had been living very well on its own into a dog, don’t we have the right to bite back once at least? Are we in the wrong?”</p><br/><p>“…Crazy bastard.”</p><br/><p>“Woah, your words are too harsh.”</p><br/><p>The man brought the blade right up to the neck of Gwanje’s wife.</p><br/><p>Gwanje made a cold expression as he looked at the man.</p><br/><p>Since that guy was going past the point of no return.</p><br/><p>“…I don’t know the details either. Only Hansoo knows the answer.”</p><br/><p>“Kang Hansoo?”</p><br/><p>“He doesn’t tell me everything either. How would I know, I didn’t follow him during the battle.”</p><br/><p>The man nodded.</p><br/><p>“But it’s clear that he has the method. Why would the Akarons ally with Hansoo? They would have no reason to fear Hansoo if they had the Akadus.”</p><br/><p>“…Hmmm. It seems like we need to catch him then.”</p><br/><p>Gwanje looked at the man who spoke of this with ease and smirked.</p><br/><p>“Do you think you will be able to accomplish that? He has a new army. The ones who came up from below. He also has the Akadus.”</p><br/><p>The man laughed coldly.</p><br/><p>Why would he fear the newcomers who had just come up?</p><br/><p>Though they would be able to work as lookouts, they were just chicks who had just come up from the Red Zone.</p><br/><p>“We will deal with the Akadus so… You just do what we ask of you.”</p><br/><p>The Akadus were scary.</p><br/><p>But once they catch the King called Hansoo then it wouldn’t be scary anymore.</p><br/><p>Hansoo would’ve made his army in the Red Zone since he wasn’t invincible himself.</p><br/><p>“Don’t worry that much mister Gwanje. There are… quite a lot who agree with us. You just need to help us.”</p><br/><p>The people who opposed the change.</p><br/><p>From the people who had refused to come into the clan to those who were hiding in the clan and were looking for a chance.</p><br/><p>All of them will participate this time.</p><br/><p>‘It’ll be an amazing firework show.’</p><br/><p>The man laughed beneath the mask.</p><br/><p>Gwanje clenched his teeth but then shook his head.</p><br/><p>“Get lost you crazy bastard. You think I’m retarded?”</p><br/><p>He didn’t even know how many would die if everything went according to the man’s plan.</p><br/><p>And there was no guarantee that his wife would get released.</p><br/><p>Since they know that they will get killed by Gwanje once she was released.</p><br/><p>And betraying Hansoo after this long was a very despicable action.</p><br/><p>The man just shrugged his shoulders.</p><br/><p>“Too bad… I guess we should just do this our way.”</p><br/><p>………………………………..</p><br/><p>Hansoo nodded as he looked at the clan that was being organized step by step.</p><br/><p>‘I should be able to shorten the time for me to go up quite a lot at this rate.’</p><br/><p>He would be able to filter those who were against him if everything continued at this pace.</p><br/><p>‘But it’s still slow.’</p><br/><p>It would still take quite a lot of time at this pace.</p><br/><p>At that moment Gwanje’s carrier pigeon flew into Hansoo.</p><br/><p>Pudududuk</p><br/><p>“Hmm.”</p><br/><p>Hansoo nodded at Gwanje’s message as he flew towards the direction the carrier pigeon came from.</p><br/><p>Hansoo flew his body to the outskirts of the outskirts of the Lazar and then went into the area where quite a lot of people had been stationed.</p><br/><p>Quite a few people who used to be in the Rerorerore clan and had moved to the Unity clan could be seen.</p><br/><p>Hansoo went past them as he went into a very deep location where Gwanje had sent the carrier pigeon from.</p><br/><p>The moment he stepped into the promised location.</p><br/><p>Kiiiiiing</p><br/><p>Hansoo’s surrounding space started to crazily distort and twist.</p><br/><p>Formation.</p><br/><p>A special orange skill that was hard to acquire.</p><br/><p>Tens of formations surrounded Hansoo.</p><br/><p>Multiple layers of walls were created as air started to get isolated.</p><br/><p>Chwararaak</p><br/><p>The surrounding environment changed instantly.</p><br/><p>From the back of the Lazar to somewhere very familiar.</p><br/><p>‘This place is…’</p><br/><p>Hansoo frowned.</p><br/><p>“How is it? A new sensation? We have someone very good at formations on our side. We changed the scene to the most impressive thing you’ve seen until now.”</p><br/><p>A man looked around as he spoke.</p><br/><p>‘Anyways… Was there a place like this in the Red Zone or the Tutorial?’</p><br/><p>The man frowned slightly.</p><br/><p>Hansoo chuckled as he looked at the man.</p><br/><p>“It does feel a bit sensational.”</p><br/><p>The Gold Dragon Tribe’s treasure that had allowed him to return to the past.</p><br/><p>Hansoo looked around at the Dragon Temple where the treasure was located.</p><br/><p>And at the people who had walked in from all around.</p><br/><p>Quite a lot for a single person to kill by himself.</p><br/><p>The man laughed as he looked at Hansoo who was looking around his surroundings.</p><br/><p>“You didn’t know we were hiding right? Hiding one’s presence completely is possible if you use formations properly. Try calling the Akadus, it’ll only be fun when we have an equal number of people.”</p><br/><p>Hansoo took a glance at the formation and then read the mana waves.</p><br/><p>A formation that clearly showed that they had no intentions of letting him go.</p><br/><p>‘They set it up quite well.’</p><br/><p>This wasn’t something possible with just a large amount of formations.</p><br/><p>There was somebody who was very good at controlling the core.</p><br/><p>He then looked around.</p><br/><p>Bloodthirst.</p><br/><p>Hate and rage.</p><br/><p>Greed.</p><br/><p>He could understand what their rage and greed was about.</p><br/><p>‘I don’t think the thing I’m doing is this hateful.’</p><br/><p>Hansoo laughed inwardly.</p><br/><p>The time these guys had been in here was at most 7 years.</p><br/><p>But they had lived in the real world for at least 20 years.</p><br/><p>It seems like they had changed quite a lot within those 7 years.</p><br/><p>“Well. It’s not that bad. There isn’t as many as I thought there would be.”</p><br/><p>“…What?”</p><br/><p>“I thought there would be many more people who hated me than this.”</p><br/><p>“I don’t think you understand what kind of a situation you’re in. The outside should be in a chaotic situation.”</p><br/><p>One of the women who had been standing next to the man walked out and smirked.</p><br/><p>“But mister is it true that you don’t kill anyone? Is that for real? After researching for a bit it seems that you hadn’t killed anyone. Why did you come alone then?”</p><br/><p>Hansoo spoke towards the woman.</p><br/><p>“I trust in myself. And that policy changed a bit.”</p><br/><p>“What?”</p><br/><p>“I changed my policy a few days ago you see. I feel like I should be a bit more direct.”</p><br/><p>…………………………….</p><br/><p>Boooom!</p><br/><p>“Uwaaah!”</p><br/><p>“It’s a sneak attack!”</p><br/><p>The moment Hansoo was caught in the formation, countless explosions occurred from all around.</p><br/><p>Boooooom!</p><br/><p>Booom!</p><br/><p>The adventurers who had trusted the Akadus were swept off at the sudden attack of the high-level adventurers.</p><br/><p>The Akadus would’ve acted if the adventurers tried to attack the Akaron but they didn’t when they attacked other humans.</p><br/><p>Since Hansoo had locked them in case of excessive repression on the people.</p><br/><p>The man who had the mask on him made an extremely content expression as he saw this scene from above.</p><br/><p>‘I see my orders aren’t transmitted that well inside the formation.’</p><br/><p>“Heheh. Play with them for a bit in there.”</p><br/><p>The man who had abducted Gwanje’s wife laughed as he looked at the black marble who was made of tens of formation layers in the distance.</p><br/><p>‘Quite greedy fellows.’</p><br/><p>People rushed and fought each other and got into the formation after finding out that Hansoo had the king’s power.</p><br/><p>It wasn’t that weird since the one who finished Hansoo off would likely receive it.</p><br/><p>‘Well. It doesn’t matter who wins.’</p><br/><p>The masked man looked next to him and spoke.</p><br/><p>“Everything going according to plan right?”</p><br/><p>The tens of formation users all nodded.</p><br/><p>No matter what happened inside, he couldn’t come out.</p><br/><p>The man spoke with relief.</p><br/><p>“Good, good. Then we will now kill all those pretty ones who came up from below. Resistance means death.”</p><br/><p>Cut off the arms and legs after trapping the head.</p><br/><p>Since they trapped the one who could order the Akadus, the Akadus would be useless for quite a while.</p><br/><p>The man sent a message to the formation users.</p><br/><p>The formation users all nodded.</p><br/><p>The power of the formation wasn’t doubled just because two formations were layered.</p><br/><p>Only when the formations are mixed well and synergize would the power increase by numerous times.</p><br/><p>They had tens of these people.</p><br/><p>They could trap anybody they wanted.</p><br/><p>‘Good.’</p><br/><p>As everything went to his plan, the man made a very content expression.</p><br/><p>At that moment.</p><br/><p>Dudududuk</p><br/><p>The core of the formation the man was looking at, the black marble, suddenly vibrated while making trembling noises.</p><br/><p>The man frowned as he saw this.</p><br/><p>“I said not to activate it yet. Use it when he weakens a bit more.”</p><br/><p>If it’s activated too early then the people inside might all resist together.</p><br/><p>At that moment the formation users made confused expressions.</p><br/><p>“We didn’t do it.”</p><br/><p>“What?”</p><br/><p>Kudududk. Uududuk.</p><br/><p>During the moment the man was shocked, the vibration of the black marble intensified.</p><br/><p>“Motherfucker! Just blow it apart!”</p><br/><p>The moment the man shouted.</p><br/><p>Crack</p><br/><p>A crack appeared on the surface of the madly trembling marble.</p><br/><p>And a golden light came out from the cracks.</p><br/><p>And then a huge explosion.</p><br/><p>Booooom!</p><br/><p>“Goddamnit!”</p><br/><p>The man covered his head with his arms as he cursed out.</p><br/><p>And Hansoo walked out from the exploded marble.</p><br/><p>No, he wasn’t the only one who had come out from the marble.</p><br/><p>“Uwaaaaak!”</p><br/><p>One of the formation users screamed as he looked at the thousands of pieces of body parts.</p><br/><p>The man grinded his teeth as he looked at that.</p><br/><p>“You crazy bastard… Did you really kill that many people…”</p><br/><p>The man mumbled as he looked at Hansoo walking out.</p><br/><p>“I didn’t come unprepared you see.”</p><br/><p>Hansoo calmed down as he looked around.</p><br/><p>A sea of flames.</p><br/><p>The casualties were increasing due to the sudden attacks.</p><br/><p>Hansoo stared at the man in front of him who was looking at him in confusion.</p><br/><p>A fly.</p><br/><p>Just a fly.</p><br/><p>These guys were just flies as Gwanje said and worried about.</p><br/><p>Things which would land upon a normal piece of meat, lay eggs and make it rot so others wouldn’t be able to eat it.</p><br/><p>‘Infinite possibilities of humans. I don’t know about that shit.’</p><br/><p>The important thing was that he would be able to unify everyone much faster once he dealt with these guys.</p><br/><p>And the fact that the people for which he would have needed to spend a huge amount of time to filter out had all come out like this.</p><br/><p>‘Everything will be done very quickly huh.’</p><br/><p>The man looked at Hansoo with a fearful expression but then laughed confidently as if he had thought of something.</p><br/><p>“There are quite a bit of your friends who we have caught while you were in there. You should think of your friends. Can I kill them all then?”</p><br/><p>Hansoo had raised them carefully below.</p><br/><p>And he was quite friendly with the woman in front of him.</p><br/><p>He should at least have a bit of feelings about them.</p><br/><p>‘Can you really throw away that many people’s lives?’</p><br/><p>Hansoo laughed maniacally as he looked at the man.</p><br/><p>“Don’t decide things too quickly.”</p><br/><p>“What?”</p><br/><p>“You can decide after you see what happened to the others.”</p><br/><p>Kwadududuk</p><br/><p>“Uwaaaaak!”</p><br/><p>“Look carefully and decide.”</p><br/><p>Hansoo grasped the neck of one of the formation users next to the man in an instant, looked at the man and mumbled.</p><br/><p>1. This is the first time the are mentioned in the novel.</p><br/>\n</div>"}