{"title": "Chapter 152 : 1st Area (2)", "id": 152, "volume": 2, "url": "http://boxnovel.org/reincarnator-chapter-152-1st-area-2", "volume_title": "Volume 2", "body": "<h1>Chapter 152 : 1st Area (2)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 152 : 1st Area (2)</p><br/><p>Sebastienne grinded her teeth as she looked towards the darkness which Hansoo jumped into.</p><br/><p>‘Why? Why did he go down? Does he know something?’</p><br/><p>But she didn’t have any time to ponder about it.</p><br/><p>Since Karhal and the other teammates had come from afar.</p><br/><p>“What happened?”</p><br/><p>“Well…”</p><br/><p>Karhal nodded as he heard the situation from Sebastie.</p><br/><p>‘I guess I can’t stop him anyway.’</p><br/><p>There were two choices for him, who was the team leader.</p><br/><p>Wait here until the guy comes out and punish him.</p><br/><p>‘Or follow him.’</p><br/><p>Sebastienne asked with a slightly worried expression.</p><br/><p>“Team leader? Are you going in? Going in there is against the rules for us as well.”</p><br/><p>No, even without the rules going in there was still a bit irksome.</p><br/><p>A complete darkness where nothing worked including the detection skills.</p><br/><p>They didn’t even know what could be in there, why would they go in?</p><br/><p>They had clearly learnt something from their time in the Otherworld.</p><br/><p>That curiosity increased the chances of one’s death.</p><br/><p>Only moving around within the known parameters was the best way to live a long time.</p><br/><p>Etianon, one of the 1st Area team member who was listening from the side, muttered quietly.</p><br/><p>“Do we really have to go in? No one we shoved in there came out alive.”</p><br/><p>“…What?”</p><br/><p>Sebastienne made a confused expression.</p><br/><p>There were others who had gone in here?</p><br/><p>Keron and Karhal clicked their tongues as they looked at Etianon.</p><br/><p>‘Tsk. He shouldn’t have said those useless words.’</p><br/><p>40 team members.</p><br/><p>But not everyone shared the same amount of information.</p><br/><p>And Sebastienne, who had only recently become a part of the 1st Area team, did not know about the traditional game which Karhal, Keron and Etianon enjoyed.</p><br/><p>‘Whatever.’</p><br/><p>Their traditional game was not something that could be found out by the village leader.</p><br/><p>Karhal checked with Keron and Sebastienne again.</p><br/><p>“I understand that he is much stronger than us. But is the gap tremendously different?”</p><br/><p>Keron and Sebastienne pondered for a moment but then shook their heads.</p><br/><p>Hansoo was definitely strong.</p><br/><p>That alone was illogical.</p><br/><p>Since a newcomer was able to beat Keron who had been here for almost a year.</p><br/><p>But he was clearly not at the level where he could go up against all of the members.</p><br/><p>“No, he isn’t at that level leader. We know that for sure.”</p><br/><p>‘He shouldn’t have any leisure to hide his skills or anything…Probably.’</p><br/><p>Karhal nodded at Keron’s words.</p><br/><p>“Well our scout for the day is over anyway. So now…We’re all going to go catch the criminal who broke the rules.”</p><br/><p>“…Is it really okay?”</p><br/><p>Sebastienne asked with a worried expression.</p><br/><p>The thing she was worried about was not just the rules.</p><br/><p>There were still traces of the being which almost destroyed the village within the center of the village.</p><br/><p>The traces that were fearsome and was constantly reminding them.</p><br/><p>Something that was preventing them from going over the line while scouting around the 1st Area.</p><br/><p>Sebastienne’s worries were not really unjustified as she saw those traces every day.</p><br/><p>But Karhal merely shook his head.</p><br/><p>“It’ll be the same if one guy goes in and screw things up anyway. It might be safer for us to go in and prevent it.”</p><br/><p>One person screwing things up or 40 people screwing things up were the same.</p><br/><p>And Karhal didn’t really think that there would be a mysterious creature lurking below.</p><br/><p>‘If something was down there already then it should’ve come out already.’</p><br/><p>But Karhal was worrying about something different.</p><br/><p>‘What if he goes down there… And sees that?’</p><br/><p>If that guy went down and saw the remnants of the traditional game they played?</p><br/><p>And told the village leader after exiting through a different tunnel?</p><br/><p>That would become a much larger problem.</p><br/><p>Karhal organized his thoughts and shouted to people around him.</p><br/><p>“We’re going down! If he touches something wrong then a disaster might fall upon the village! We need to prevent that from happening!”</p><br/><p>At those words Sebastienne and a few others made dirty expressions while Karon and other veterans nodded and prepared to go down with heavy expressions.</p><br/><p>……………………………………</p><br/><p>Rumbleee</p><br/><p>Hansoo, who had been free falling, smashed the Forked Lightning into the wall.</p><br/><p>Forked Lightning entered the wall which seemed to have been melted down from something’s attack.</p><br/><p>Kadududududuuk</p><br/><p>Hansoo, who was falling down along with the sparks which were created from the friction, had to fall down for a lot longer in order to finally touch the ground.</p><br/><p>Hooooooog.</p><br/><p>The golden light exerted from Hansoo’s Demonic Dragon’s Reinforcement brightened up the darkness.</p><br/><p>And an underground scene started to slowly appear before him.</p><br/><p>There were buildings which looked like they were destroyed by something along with rubbles.</p><br/><p>The size of the darkness was as large as a normal lake but the underground was a lot larger than that.</p><br/><p>Like how the entrance to a basement was much smaller than the actual basement.</p><br/><p>‘Though this is a ruined basement.’</p><br/><p>Hansoo muttered as he touched the wall of a destroyed building.</p><br/><p>Hansoo only heard stories about this place.</p><br/><p>This was his first time coming here.</p><br/><p>The research facilities of the which had been destroyed after receiving attacks of the higher race.</p><br/><p>Hansoo breathed quietly for a while and lifted his hand up to his right ear for the first time after a very long time.</p><br/><p>[Kang Hansoo] Strength (Yellow) : 1.1%</p><br/><p>Stamina (Yellow) : 1.0%</p><br/><p>Agility (Yellow) : 1.2%</p><br/><p>Perception (Yellow) : 1.1%</p><br/><p>Mana (Yellow) : 1.1%</p><br/><p>Magic (Yellow) 1.2%</p><br/><p>Physical Resistance (Yellow) : 1.0%</p><br/><p>Magical Resistance (Yellow) : 1.2%</p><br/><p>-Demonic Dragon’s Reinforcement : 43.5%</p><br/><p>-Pandemic Blade : 21.5%</p><br/><p>-Forked Lightning (Yellow) 1.2%</p><br/><p>-Nurmaha’s Ring (Yellow): 1.1%</p><br/><p>-Thousand Soldiers Armor (Yellow) : 0.7%</p><br/><p>-Dark Cloud (Yellow) : 0.1%</p><br/><p>-Dragon Essence Blade: 1.7%</p><br/><p>-Fragments of Seven Souls (2/7)</p><br/><p>-Seven Stars (2/7)</p><br/><p>‘Nice.’</p><br/><p>Hansoo nodded at his status screen that he hadn’t opened in a long time.</p><br/><p>The runes were increasing at a balanced rate.</p><br/><p>And mastery levels of his skills was increasing quite fast as well.</p><br/><p>It had taken Hansoo about four months to get to the Yellow Zone ,after finishing the Tutorial stage.</p><br/><p>Raising a skill’s mastery level by 40% in just 4 months was something completely illogical in the Red Zone’s standards.</p><br/><p>Since mastering a skill completely usually took at least 3 years.</p><br/><p>And this skill was even harder because a higher leveled skill was harder to master.</p><br/><p>This would be something impossible without his trait, Seven Stars.</p><br/><p>‘I’ll need to focus a bit more on the mastery levels of the Dark Cloud and Thousand Soldiers Armor.’</p><br/><p>The Dragon Essence Blade, which grew every time one enhanced their body using it, was growing quite quickly in comparison to the other Artifacts.</p><br/><p>Forked Lightning and Nurmaha’s ring, which grew when one inserted runes into them, were also growing at a similar rate as the runes.</p><br/><p>But the Dark Cloud, which grew faster the more organisms one had infected with it, or the Thousand Soldiers Armor, which grew as it ate more and more weapons and armor, had not really increased that much.</p><br/><p>‘Well I’ll solve those problems after I get out of here. Anyways…It’s much larger than I expected’</p><br/><p>Tong Tong</p><br/><p>Hansoo tapped the walls with Forked Lightning and then frowned as he roughly figured out the directions.</p><br/><p>It wasn’t that it was just dug down deeply.</p><br/><p>This darkness was something created by the attacks of the higher races who were trying to destroy this place entirely.</p><br/><p>Thankfully the size of this underground area was much larger than the dark hole.</p><br/><p>‘It might take a while.’</p><br/><p>Hansoo pushed away the rubble that had melted and fused them each other as he walked forward.</p><br/><p>But only for a moment.</p><br/><p>Hansoo sensed creatures within his range and then frowned.</p><br/><p>Existences that should not be here.</p><br/><p>‘…What? People?’</p><br/><p>This wasn’t part of this plans.</p><br/><p>Hansoo’s frown deepened.</p><br/><p>‘It’s an unknown variable.’</p><br/><p>He needed to verify what it was.</p><br/><p>Crunch.</p><br/><p>The moment Hansoo’s foot stepped onto the ground.</p><br/><p>The melted ground made cracking sounds as it broke apart.</p><br/><p>And soon.</p><br/><p>Boooooom!</p><br/><p>Hansoo’s body disappeared along with the large soundwave, appeared somewhere else and attacked the person in front of him.</p><br/><p>Smack!</p><br/><p>“Aaaak!”</p><br/><p>“Mmm?”</p><br/><p>Hansoo frowned as he looked at the teenage-looking boy who was flying away from the shockwave.</p><br/><p>He wasn’t going to go easy on him.</p><br/><p>Since he wanted to suppress him first before anything.</p><br/><p>But even before he could attack again.</p><br/><p>A blue light came out from the child’s necklace and it weakened most of his attacks.</p><br/><p>And Hansoo knew the identity of that object.</p><br/><p>‘It’s something from the research labs.’</p><br/><p>But Hansoo shook his head.</p><br/><p>The objects of the research lab did not activate for free.</p><br/><p>And the proof was this was the child who was repositioning himself after jumping away some distance away.</p><br/><p>“Haaaaa….Huaa.”</p><br/><p>A teenage girl who was panting with an out-of-breath expression.</p><br/><p>She could only.</p><br/><p>Since those items needed a tremendous amount of mana to activate.</p><br/><p>And the girl’s reaction was something that would happen to somebody when all the mana in one’s body run out instant.</p><br/><p>‘I’ll need to hear her out.’</p><br/><p>The moment Hansoo was about to charge again.</p><br/><p>The girl suddenly shouted out loudly.</p><br/><p>“Emergency! Some bastard of a Hunter finally came down below!”</p><br/><p>“Hmm?”</p><br/><p>The moment the girl’s shout resonated throughout the giant underground cavern.</p><br/><p>The wide vast darkness.</p><br/><p>From that darkness, tens of bright blue lights appeared from all directions.</p><br/><p>‘That is…’</p><br/><p>That specific wavelength of light.</p><br/><p>It was the light of an object which symbolized the research facilities.</p><br/><p>The moment Hansoo frowned.</p><br/><p>Chuuuuuungg!</p><br/><p>Tens of laser beams which came from the lights smashed into Hansoo.</p><br/><p>Chijijijijijijik.</p><br/><p>Tens of blue lasers that were gnawing away at the Demonic Dragon’s Reinforcement and slowly making their way in.</p><br/><p>‘Heh. Look at this.’</p><br/><p>Hansoo laughed coldly as he looked at the mysterious people who attacked him out of the blue for no reason.</p><br/><p>‘I guess I’ll be able to find the research facilities much quicker now.’</p><br/><p>The next moment.</p><br/><p>Boooooom!</p><br/><p>The Forked Lightning in Hansoo’s hands flew through the air.</p><br/><p>………………………………………………………….</p><br/><p>Rumble.</p><br/><p>“Mmm?”</p><br/><p>Quite rumbles could be heard coming up from below.</p><br/><p>Karhal and the team members, who were carefully going down towards the darkness, suddenly all frowned.</p><br/><p>‘Fucking hell. What’s going on below.’</p><br/><p>Karhal, who was stabbing the walls while slowly going down, deepened his frown.</p><br/><p>He had never gone down himself either.</p><br/><p>He had only thrown people in there before.</p><br/><p>Of course the sudden rumble that rang throughout the darkness was unpleasant.</p><br/><p>Sebastienne, who was descending next to Karhal, carefully spoke out.</p><br/><p>“Damn. Leader. Do we need to ask for reinforcements from the village or something?”</p><br/><p>Karhal pondered for a moment.</p><br/><p>As if he really had to.</p><br/><p>‘This is really annoying. Damnit. Why did such a thing like this happen when I’ll be leaving in just a week.’</p><br/><p>Village.</p><br/><p>He was thankful.</p><br/><p>Since he had been able to raise his strength in safety and had quite joyous moments.</p><br/><p>But he could only get pissed off when something like this happened in an area he was in charge of.</p><br/><p>Since it’ll be a huge catastrophe if he received some damage while dealing with this problem.</p><br/><p>Sebastienne’s suggestion was quite attractive because of this.</p><br/><p>But Karon shook his head.</p><br/><p>‘Then…The things we have done will be found out.’</p><br/><p>If the village leader, Ekidu, and the other Hunters helped them out then it’ll become much easier.</p><br/><p>But then he wouldn’t be able to hide the people below.</p><br/><p>If he got caught after kidnapping the Farmers, who were properties of the village, and playing with them however they wanted then it would not end lightly.</p><br/><p>‘We didn’t really play with them nicely either. Fuck. If I knew this would happen then I would’ve killed them all. This is really annoying.’</p><br/><p>For their game, where they had thrown them in alive for more fun,for it to come back and bite them in the ass like this.</p><br/><p>“If we do then it might be too late. Quickly move down we need solve this on our own.”</p><br/><p>Karhal spoke to Sebastienne, turned around and grinded his teeth.</p><br/><p>‘This is all because of that dumb Ekidu and the guards.’</p><br/><p>They, the Hunters, were doing such dangerous jobs.</p><br/><p>And they were much stronger than the Farmers who weren’t even comparable in strength.</p><br/><p>But why couldn’t they play with the Farmers any way the wanted?</p><br/><p>They were kidnapping and forcibly playing with them because their desires had been suppressed due to those dumb rules and regulations.</p><br/><p>If things were a bit loose then they wouldn’t have done such things behind the shadows either.</p><br/><p>‘Yeah. This is the fault of the whole village.’</p><br/><p>Karhal muttered to himself.</p><br/><p>But even if the village was at fault, there was nothing beneficial to him from clashing with them.</p><br/><p>There was no point in doing so since he would be leaving in a week too.</p><br/><p>He would just need to get rid of Hansoo discreetly this time as well.</p><br/><p>Like how he had done so far.</p><br/><p>Then he’ll be able to get through all of this quietly.</p><br/><p>Since nobody will question the newcomer falling into an accident and dying in this dangerous 1st Area.</p><br/><p>The tradition of the 1st Area team that only they knew had to be kept within themselves.</p><br/><p>“Let’s hurry and go down.”</p><br/><p>Karhal finished his thoughts and then looked downwards.</p><br/><p>An extremely deep dark hole.</p><br/><p>The words of Hansoo suddenly appeared within his head while staring into this giant hole that seemed like a huge monster’s open mouth.</p><br/><p>That they would regret it if they entered.</p><br/><p>‘Doesn’t even make sense.’</p><br/><p>What would he be able to do?</p><br/><p>Plunk Plunk Plunk Plunk</p><br/><p>Karhal shook off the thoughts in his head as he increased his pace.</p><br/>\n</div>"}