{"title": "Chapter 169 : Test (4)", "id": 169, "volume": 2, "url": "http://boxnovel.org/reincarnator-chapter-169-test-4", "volume_title": "Volume 2", "body": "<h1>Chapter 169 : Test (4)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 169 : Test (4)</p><br/><p>Booooom!</p><br/><p>Booom!</p><br/><p>Right before Hansoo was about to take control of the Atillan.</p><br/><p>A fight had broken up between the villagers far away from where Hansoo was.</p><br/><p>Not just a verbal fight but a fight where they held blades against each other.</p><br/><p>A fight between those who tried to kill Dakidus and those who wanted to maintain the current situation.</p><br/><p>“Damnit! We have to go!”</p><br/><p>“You may not!”</p><br/><p>“These bastards…”</p><br/><p>Karhal grinded his teeth.</p><br/><p>Even a neutral ground would be annoying but for them to be like this.</p><br/><p>“We won’t ask you to help so get lost!”</p><br/><p>Boooom!</p><br/><p>Then one of the guards who had swung their sword against Karhal shouted out.</p><br/><p>“No way. Kang Hansoo. Blame that guy.”</p><br/><p>“What?”</p><br/><p>“This is all because of that bastard, Kang Hansoo! That damned bastard… If he hadn’t caused a problem then everything would’ve continued the way it was!”</p><br/><p>And with this as the start, a few others started to shout out as well.</p><br/><p>“Why did that bitch start all this!”</p><br/><p>“He should’ve just lived the way he was!”</p><br/><p>Mackill grinded her teeth as she saw this.</p><br/><p>Including the guard who was shouting right now, about 10% of the people here were attacking in all directions.</p><br/><p>Though the number was only 10%, the power was closer to 50% of what they had.</p><br/><p>Since most of the attackers were Hunters and Guards.</p><br/><p>Even without mana, they were still much stronger than the Farmers.</p><br/><p>High rankers who had been stomping all over the Farmers from a safe location while gaining benefits from the village during the peace the village had been maintaining.</p><br/><p>‘Damned bastards. You were safe.’</p><br/><p>Mackill barely dodged an attack of a Hunter who was charging at her and then grinded her teeth.</p><br/><p>There was a reason for her anger.</p><br/><p>Even if the village continued the way it was, there weren’t that many negative points for those higher up.</p><br/><p>They wouldn’t be picked for the offerings even if they stayed still and even if Dakidus’ words were right, they had a high chance of just passing through the numerous tests Clementine had set up and going up to the next zone.</p><br/><p>It was very possible for those around the level of a guard.</p><br/><p>But due to the recent events, they didn’t know what would happen from now on.</p><br/><p>Of course the Farmers couldn’t really relate.</p><br/><p>‘Bastards. Was the peace you had made by selling us that good?’</p><br/><p>No, it wasn’t peace that was created just by selling them.</p><br/><p>It was peace created by selling everyone who hadn’t been able to pass the test created by Clementine.</p><br/><p>Peace only for those who have passed.</p><br/><p>But the minds of the guards swinging their blades against Mackill weren’t easy either.</p><br/><p>It wasn’t from fighting against other humans.</p><br/><p>‘Damn…Fucking damnit. For things to twist and turn like this.’</p><br/><p>Though they were leisurely fighting against the Farmers, they were feeling quite anxious.</p><br/><p>Even if they sided with Dakidus, there was no guarantee that he would let them live.</p><br/><p>The final state of Dakidus’ body was a mess.</p><br/><p>His skin had been shredded apart by Hansoo and his attacks, the glossing fur had all been burnt off, bones were broken and muscles were destroyed.</p><br/><p>If they were in Dakidus’ shoes?</p><br/><p>And if the things he usually treated as bugs were the ones who attacked him?</p><br/><p>He would not let them go.</p><br/><p>Though he would forgive them for now, it would eternally be in his memories.</p><br/><p>The scene he saw today.</p><br/><p>And if this memory ticked his brain and made him feel discomfort?</p><br/><p>It wouldn’t be weird for them to suddenly get dragged away and get killed while they are on the Green Road.</p><br/><p>The fact that in this already dangerous world, an accident caused by somebody else had made them facing great risks was the reason why they were so enraged.</p><br/><p>‘This is why… We have to be on the good side.’</p><br/><p>It was now war.</p><br/><p>And there was no middle ground to this war.</p><br/><p>Everybody was their enemy if they weren’t on their side.</p><br/><p>They had to choose one side.</p><br/><p>And they had been the winners until now.</p><br/><p>They would be winners this time as well.</p><br/><p>‘Dumbasses, surviving is the highest priority.’</p><br/><p>They had struggled.</p><br/><p>For survival.</p><br/><p>Who cared if this was all a trick or a test existed.</p><br/><p>They just needed to win.</p><br/><p>And Dakidus needed to live for this.</p><br/><p>So this was why these guys cannot go attack Dakidus.</p><br/><p>Karhal grinded his teeth as he attacked a Hunter in front of him.</p><br/><p>“You bastards! Fuck off!”</p><br/><p>Dakidus had lost his strength.</p><br/><p>But humans were fighting with each other instead.</p><br/><p>‘I’m slowly feeling shittier…’</p><br/><p>Karhal thought of a memory from the past.</p><br/><p>When he had first come up here.</p><br/><p>When he had been attacked by the hunting dogs that those guys had set up for fun.</p><br/><p>Karhal couldn’t handle the tremendous amount of mana supplied by the blue jade and had to run away.</p><br/><p>While watching his sibling, whom he had spend a tremendous effort in finding and was treating very well, get transmitted by the blue light.</p><br/><p>If those things had come out from the beginning and had swept them apart then he wouldn’t have been angry anyway.</p><br/><p>But they had instead played around with them with their superior strength.</p><br/><p>Making the humans fight with each other and watching that scene.</p><br/><p>‘Damned bastards. I cannot miss this opportunity no matter what.’</p><br/><p>The time for revenge had finally come.</p><br/><p>Karhal then thought of Hansoo.</p><br/><p>He still couldn’t understand quite a lot about him.</p><br/><p>He didn’t know what Hansoo was thinking about.</p><br/><p>But one thing was clear.</p><br/><p>That there aren’t many people who did things that didn’t make sense.</p><br/><p>He needed to follow those who did things that didn’t make sense.</p><br/><p>People whose actions did not make sense at all in this damned world where saving one’s own life and raising their strength was of utmost importance.</p><br/><p>This was why he had helped Ekidu and was why he was helping Hansoo now.</p><br/><p>Karhal and the others who had decided to go against Dakidus were having similar thoughts as they fought.</p><br/><p>They weren’t fighting just from high spirits and belief in Hansoo.</p><br/><p>‘…At this rate, we’ll get killed even if we go up.’</p><br/><p>From the previous event, the balance that had controlled the village had been smashed apart.</p><br/><p>They had despised Hansoo at first but the words of Dakidus had helped them resolute their minds.</p><br/><p>The rules set up for the Higher Races and the traitors of mankind deserved to be destroyed.</p><br/><p>‘The ones who are blocking the destruction of this are the same kind.’</p><br/><p>“Kill them! These bastards!”</p><br/><p>If they couldn’t see any hope it might’ve been different but as Dakidus had almost been killed, the ones appearing in front of them to block their path had enraged them greatly.</p><br/><p>But the moment the enraged Karhal was about to smash the hunter in front of him.</p><br/><p>Booooooooooom!</p><br/><p>“…Huh?”</p><br/><p>From the distance.</p><br/><p>A pillar of light exploded out from where Hansoo and Dakidus had been fighting.</p><br/><p>A blue, holy pillar of light.</p><br/><p>And the moment the saw it.</p><br/><p>“Oh no…”</p><br/><p>Karhal and the others fell into despair.</p><br/><p>Since that pillar of light, which came down from the Atillan, only meant one thing.</p><br/><p>The guard who was attacking Karhal laughed out loudly.</p><br/><p>“Uaahahahaha! See!? What could that guy do! You guys are now all dead!”</p><br/><p>But at that moment.</p><br/><p>Roooooaaaaarrr!</p><br/><p>A pain filled roar rang throughout the entire vicinity.</p><br/><p>So loud that everyone could hear clearly.</p><br/><p>“Roooooaaaar! Get a hostage! A hostage!”</p><br/><p>“What?”</p><br/><p>Everyone made confused expressions at the pain-filled screams of Dakidus.</p><br/><p>……………………………………….</p><br/><p>“Heheheh….Did you really think that things would go your way?”</p><br/><p>Dakidus laughed weakly towards Hansoo even whilst gasping for air.</p><br/><p>And there was a huge hole on the belly of Dakidus.</p><br/><p>A single strike.</p><br/><p>His right arm had been blown apart by Hansoo, who had regained his mana, and a hole had been created in his belly.</p><br/><p>But Dakidus had been able to barely avoid getting hit in the vital parts because Hansoo’s condition wasn’t at its peak.</p><br/><p>Since the body wouldn’t magically regenerate instantly even if one’s mana came back.</p><br/><p>If Hansoo was in peak condition then he would’ve definitely died from the previous attack.</p><br/><p>Since Hansoo’s body was overflowing with a tremendous about of mana.</p><br/><p>‘But…It’s too late.’</p><br/><p>Since Dakidus, whose body was numerous times stronger than Hansoo’s, still knew about the situations of the villagers in the distance even without mana.</p><br/><p>‘Since they have chosen to follow me…they should know what to do.’</p><br/><p>And as he expected.</p><br/><p>They instantly realized the situation and started to follow his orders.</p><br/><p>The other side had a lot more in number but the ones following Dakidus had higher individual strength.</p><br/><p>They instantly figured out the situation and followed Dakidus’s orders by suppressing the others one by one and grouping up.</p><br/><p>‘Good. Good.’</p><br/><p>“Heheh. What are you going to do now? Are you going to throw them all away? What about the ones caught as hostages? No, the hostages might not matter but are you even going to kill all those who follow me?”</p><br/><p>Dakidus blocked the slowly regenerating hole in his belly and started to laugh as if he had gained some leisure.</p><br/><p>“Those guys are those who would’ve gotten to the next stage without any problems without you. But because of your deeds they have chosen such extreme measures. They are just struggling to survive but…Are you going to kill them all? Just because they didn’t side with you? Hahaha! Ekidu is much better than this! What a tyrant!”</p><br/><p>If the hostages were important then Hansoo wouldn’t be able to kill him.</p><br/><p>But Hansoo didn’t really react to Dakidus’s words.</p><br/><p>He didn’t get angry or feel flustered.</p><br/><p>Since there was no reason to.</p><br/><p>Hansoo spoke towards Dakidus without any expression.</p><br/><p>“What are you saying?”</p><br/><p>“Hmm?”</p><br/><p>“Are you playing around or something?”</p><br/><p>Hansoo wouldn’t kill them if they had stayed in the middle grounds at least.</p><br/><p>Since Hansoo also agreed with Dakidus’s words to some extent.</p><br/><p>Since struggling to survive wasn’t wrong.</p><br/><p>Even he had struggled and fought against others in order to survive and beat his competitors in the Yellow Zone back in the past.</p><br/><p>If he didn’t have his trait, which started to show its might from around the Yellow Zone, he would’ve definitely died.</p><br/><p>But Hansoo didn’t have the leisure to care about everyone over there.</p><br/><p>Since it would be war from now on.</p><br/><p>‘I have to pick them out. Those who I will go with and those who I won’t go with.’</p><br/><p>Hansoo understood Clementine’s opinions to an extent.</p><br/><p>People that can’t be trusted will only hold him down.</p><br/><p>There was a reason why the Emperors of the past purged dangerous generals and lieges as well as killing off traitors.</p><br/><p>The stronger they were, the more dangerous they were.</p><br/><p>Letting everyone in was like bringing up a bomb onto the boat.</p><br/><p>If Hansoo had some leisure and could guarantee his win at any given moment then he would’ve definitely persuaded everyone there to take them.</p><br/><p>Since just letting them die in such a situation is a waste of their lives.</p><br/><p>But he wasn’t fighting with a complete assurance and confidence that he would be able to win.</p><br/><p>The reason for him killing Dakidus and starting the fight against the Higher Races was not because he could win.</p><br/><p>He did it because he had to.</p><br/><p>Him coming to the past was not because he always had the confidence to twist every event and win at every situation.</p><br/><p>The thing he had brought back was just a possibility.</p><br/><p>Even with the knowledge of the future, not everything was solved.</p><br/><p>Since even the Alchemists were worried while setting up the plan.</p><br/><p>They didn’t know what Hansoo would gain.</p><br/><p>He might be able to get something even better and he might not even be able to gain anything.</p><br/><p>They didn’t know who will come into the plan and what kind of change would occur.</p><br/><p>Of course there wasn’t any guaranteed plan.</p><br/><p>Set up the best suited plan for every situation with the knowledge of the future as the base.</p><br/><p>It was like dangerous tightroping.</p><br/><p>Since the enemy was that powerful.</p><br/><p>Even if the situation was dire for others, he couldn’t allow this.</p><br/><p>This was just the start and more extreme situations would continue to occur.</p><br/><p>Crossroads would continue to appear.</p><br/><p>What Hansoo needed right now was people who could follow him even in a situation like this.</p><br/><p>‘Choice is free but you should take responsibility.’</p><br/><p>He might win and the ones who followed him might face glory.</p><br/><p>But on the other hand, the ones who chose Dakidus and the Higher races might win and laugh instead.</p><br/><p>They weren’t in the wrong.</p><br/><p>This was war and the ones who died in war didn’t die because they were in the wrong.</p><br/><p>It was just the one who they chose to side with, in this case Dakidus, had lost.</p><br/><p>That was it.</p><br/><p>Hansoo clenched onto the Forked Lightning in his hands and looked at Dakidus.</p><br/><p>“Don’t throw all the blame onto me. Do you even know the amount who have died because of you?”</p><br/><p>The casualties caused by Clementine and the Higher Races amount to tens of millions.</p><br/><p>If he didn’t smash apart the current situation and destroy them, the amount of people who would come up to get sacrificed would be needed to counted by the hundreds of millions.</p><br/><p>This was why he was going to do his best.</p><br/><p>In order to destroy them.</p><br/><p>Along with everyone who sides with them.</p><br/><p>Everyone was clearly identified from Hansoo’s enhanced perceptions.</p><br/><p>Those who would side with him and those who would go against him.</p><br/><p>‘The test ends now.’</p><br/><p>In an instant.</p><br/><p>Rummblee~</p><br/><p>The mana that had been rotating around Hansoo’s body roared as it all started to get sucked in somewhere.</p><br/><p>Towards his skill, the Pandemic blade.</p><br/><p>Rumblee</p><br/><p>The spores of the Pandemic blade greedily devoured the mana and started to increase in size.</p><br/><p>As if they were trying their best to mimic the scene they had caused in order to bring ruin to an entire world.</p><br/><p>To the point of even making the Demonic Dragon’s Reinforcement disappear.</p><br/><p>At this time Hansoo’s trait activated.</p><br/><p>Seven Stars.</p><br/><p>The spores who had been supplied with mana to the brim started to change and get reconstructed from Hansoo’s trait.</p><br/><p>More powerful.</p><br/><p>More vicious.</p><br/><p>Whooosh</p><br/><p>The yellow spores around Hansoo’s body twisted and turned as even their color changed.</p><br/><p>To a bloody red color.</p><br/><p>And soon.</p><br/><p>Booooom!</p><br/><p>The bloody storm which had exploded out with Hansoo as the center started to rush towards where the villagers were in the distance.</p><br/>\n</div>"}