{"title": "Chapter 163 : Fallen God (1)", "id": 163, "volume": 2, "url": "http://boxnovel.org/reincarnator-chapter-163-fallen-god-1", "volume_title": "Volume 2", "body": "<h1>Chapter 163 : Fallen God (1)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 163 : Fallen God (1)</p><br/><p>“Hmmm?”</p><br/><p>Dakidus frowned.</p><br/><p>For Hansoo to speak in such a rude way.</p><br/><p>He was being quite nice to him but for him to cross the line.</p><br/><p>‘I should cut off his limbs then.’</p><br/><p>The moment Dakidus willed it.</p><br/><p>Booooooom!</p><br/><p>A blue laser fell down from the skies in a straight line.</p><br/><p>Towards where Hansoo had been standing.</p><br/><p>But Dakidus was a step too late.</p><br/><p>Hoooooong!</p><br/><p>Right before the blue laser could land from the skies.</p><br/><p>The sleeping Sealing Jade within Hansoo’s pocket started to vibrate aggressively.</p><br/><p>And soon.</p><br/><p>Hoooooooooong</p><br/><p>The Sealing Jade’s shockwave swept through the entire village.</p><br/><p>And the blue laser that was coming down from the skies just disappeared in mid air.</p><br/><p>As if a blue line had melted down.</p><br/><p>And that wasn’t the only thing that had disappeared.</p><br/><p>“Huh? Uuuuhhhh!”</p><br/><p>The blue barrier around Hellum, who had been charging in towards the fight between Ekidu and Hansoo, disappeared as a whole.</p><br/><p>“Uaaaaak!”</p><br/><p>Hellum freaked out, reversed the position of him charging in and then ran backwards.</p><br/><p>This scene was extremely humiliating to him but it was a clear judgement in Hellum’s situation.</p><br/><p>The clash between Hansoo and Ekidu that was overwhelming just from hearing the sounds.</p><br/><p>He would become minced meat and then die miserably without the strength of Dakidus.</p><br/><p>Hellum grinded his teeth while running away.</p><br/><p>‘Damn. I’m the retarded one. For me to trust that crazy bastard of a dog.’</p><br/><p>Hellum could only think of one possibility.</p><br/><p>That Dakidus had played with him.</p><br/><p>The mysterious vibration that rang out from Hansoo weighed his mind down but he shook off his head at that possibility.</p><br/><p>‘No way.’</p><br/><p>For a human to be able to insolently harm the higher race.</p><br/><p>He had never even heard of such a thing.</p><br/><p>‘Damn! Damn!’</p><br/><p>Anyways, the important thing right now was running away.</p><br/><p>Hellum, who hadn’t even cared about his surroundings and was running away in a hurry, suddenly stopped.</p><br/><p>‘Why are there no sounds of explosions?’</p><br/><p>The clash between Ekidu and Hansoo, who were fighting as if they were trying to rip each other’s hearts out, had suddenly stopped.</p><br/><p>At the same time a strange sound was heard from somewhere up above.</p><br/><p>‘What happened…’</p><br/><p>Hellum, who was about to turn around, got more curious at the noise above and then took a glance above instead.</p><br/><p>At that instant.</p><br/><p>Hellum stopped right in place while running away.</p><br/><p>‘Holy god….’</p><br/><p>……………………………..</p><br/><p>‘…Why am I fine?’</p><br/><p>Ekidu checked her body buried in a corner of a building and made a confused expression.</p><br/><p>There was quite a large quantity of traces of battle but her body was still very well.</p><br/><p>And her consciousness had come back to normal as well.</p><br/><p>When Ekidu used the White River Demonic Arts, she calculated for the worst outcome possible and then used it.</p><br/><p>Only two cases would cause the White River Demonic Arts to stop.</p><br/><p>Either when all the criminals who caused chaos to the village had died.</p><br/><p>Or she herself had died.</p><br/><p>Even she couldn’t handle the countless amounts of Hunters and Guards by herself.</p><br/><p>But the current situation was too different from what she had expected.</p><br/><p>No, something that she couldn’t even dream of was happening.</p><br/><p>‘Higher race…Dakidus is…’</p><br/><p>Rumble</p><br/><p>Dakidus was falling from quite an altitude.</p><br/><p>Like a god who had lost his wings.</p><br/><p>From the sky and to the ground.</p><br/><p>The mighty looking blue crown on his head had long lost its luster.</p><br/><p>And that wasn’t all.</p><br/><p>Ruuummmblleee</p><br/><p>The giant castle that was floating above.</p><br/><p>The golden castle, which used to shine blue like the crown, was falling.</p><br/><p>“Uuuhuuuukk!”</p><br/><p>“Shit! Run away!”</p><br/><p>‘It’s a mess.’</p><br/><p>Unlike Ekidu who has yet to figure out the current situation completely, the Guards, Hunters and Farmers were all running away in every direction.</p><br/><p>And they had to.</p><br/><p>No matter how powerful their body was, if that much mass landed on the village, nobody could guarantee their own safety.</p><br/><p>At that moment.</p><br/><p>“Instead of blanking out, stand up. This is just the start.”</p><br/><p>Rumble.</p><br/><p>“…Hansoo?”</p><br/><p>Ekidu muttered as she looked at Hansoo who had pulled her out from the rubble.</p><br/><p>The person looked quite similar to the Hansoo she knew but a lot of things were different.</p><br/><p>The scales that had covered his entire body.</p><br/><p>‘…He really stands out.’</p><br/><p>The fact that he didn’t really look human wasn’t the reason why she thought of this.</p><br/><p>It was rather this attitude towards the situation.</p><br/><p>In the midst of the chaos created by the Satellite Fortress falling down, Hansoo being able to</p><br/><p>maintain his calm demeanor helped him stand out even more.</p><br/><p>But Ekidu realized right away.</p><br/><p>“Is that…Did you cause that?’</p><br/><p>She couldn’t even imagine how he had done it from seeing his attitude, there was no other possibility.</p><br/><p>Well the fact of the god-like Dakidus falling from the skies alone was beyond her imaginations.</p><br/><p>And Hansoo nodded towards Ekidu.</p><br/><p>Ekidu’s expression turned complex at Hansoo’s attitude.</p><br/><p>‘…Will this be okay?’</p><br/><p>In the corner of Ekidu’s mind, instead of being angry at the falling Dakidus, there was worry forming.</p><br/><p>Dakidus fell and the Atillan sunk.</p><br/><p>A change that was too big for her that had never happened before and should not have happened ever.</p><br/><p>And this change filled her mind full of worry from the changes that it will bring to the village, the villagers of the village and herself.</p><br/><p>Since one thing was clear.</p><br/><p>That Dakidus’ rage will skyrocket.</p><br/><p>And as if it was proving that her expectations weren’t wrong.</p><br/><p>Booooooooom!</p><br/><p>“Roooooooaaaarrr!”</p><br/><p>A roar of rage came from the distance which resonated all the way throughout to the Armory near them.</p><br/><p>The roar of Dakidus after he had fallen.</p><br/><p>The howling which contained the confusion and rage rang throughout the entire village.</p><br/><p>‘Damn.’</p><br/><p>A shockwave made from sound that shook one’s entire body.</p><br/><p>Ekidu stumbled back and forth to maintain her balance.</p><br/><p>Usually something like this wouldn’t happen.</p><br/><p>Only then was Ekidu able to figure out why she had been able to become lucid and why Dakidus had fallen from the skies.</p><br/><p>Since the White River Demonic Arts that had protected her entire body had disappeared.</p><br/><p>No, even putting the White River Demonic Arts aside, none of her skills could be used at all.</p><br/><p>‘Mana… It’s all frozen.’</p><br/><p>As Ekidu’s expression stiffened up from this discovery.</p><br/><p>Booooom!</p><br/><p>Hansoo stomped forward and then kicked away the already half collapsed Armory.</p><br/><p>And inside of the feeble but well organized storage, numerous shiny armors and weapons could be seen.</p><br/><p>“Hey! Hey! That’s for the village…”</p><br/><p>“I’m using it for the village.”</p><br/><p>Hansoo walked in and then started to equip the useful things onto his body.</p><br/><p>They were a bit inferior to the items he had on but they were still very nice.</p><br/><p>Hansoo clicked his tongue towards Ekidu who was watching him in bewilderment and then broke open another wall.</p><br/><p>Boooooom!</p><br/><p>There was an item that was a bit different from the items until now in this part of the storage.</p><br/><p>An item that was clearly a tier higher than the others from just a glance.</p><br/><p>‘This was here too huh.’</p><br/><p>Numbering 779. Scarlett Yang Armor.</p><br/><p>This armor, which stimulated the user’s viciousness, wasn’t quite compatible with Ekidu, who already goes crazy by herself, so it was kept in the corner of this storage but it was an item that was originally prepared for the village leader.</p><br/><p>Chuck!</p><br/><p>Hansoo pulled out the Scarlett Yang Armor and threw it to Ekidu was he spoke.</p><br/><p>“Hurry and put it on. Since the mana froze you shouldn’t have to worry about the side effects.”</p><br/><p>Ekidu’s expression stiffened up as she stared at Hansoo.</p><br/><p>Since what Hansoo was planning to was quite obvious.</p><br/><p>But that’s not what he should be worrying about.</p><br/><p>“Hey! Aren’t you going to run away? What are you going to do about that…”</p><br/><p>As Ekidu pointed towards the Atillan that was falling from the sky.</p><br/><p>Kiiiriiririiing</p><br/><p>Suddenly the Atillan’s speed drastically lowered.</p><br/><p>And a small, faint blue light appeared at the bottom of the golden castle.</p><br/><p>“Hmm.”</p><br/><p>‘Even if it was enhanced…The distance from here to the Atillan was too far.’</p><br/><p>Hansoo gazed at the sky and then touched the Sealing Jade in his hands.</p><br/><p>If he had been able to directly shoot it onto the mana engine then he would’ve been able to shoot it right down.</p><br/><p>But since he couldn’t, the castle will recover and start up again after a while.</p><br/><p>He needed to kill Dakidus before that happened.</p><br/><p>‘Well, it’s not bad.’</p><br/><p>Since he wouldn’t need to worry about getting smashed by the castle anymore.</p><br/><p>The moment hansoo was about to get up from the Armory.</p><br/><p>Boooooooom!</p><br/><p>Something smashed through the Armory walls and came in.</p><br/><p>Clatter clatter.</p><br/><p>The thing that ran past Hansoo smashed right in the midst of the armors and the weapons.</p><br/><p>And the thing suddenly groaned after the crash.</p><br/><p>“Ugh…”</p><br/><p>“…Hellum.”</p><br/><p>Ekidu’s expression froze as she looked at Hellum who had smashed onto the Armory with broken limbs.</p><br/><p>There was only one reason for him to have become like this.</p><br/><p>At that moment.</p><br/><p>A tremendous shout was heard from the distance.</p><br/><p>“Hahahahaha! What are you guys going to do? You’re going to try swinging that piece of toy sword at me?”</p><br/><p>After that confident shout was heard.</p><br/><p>Booooooom!</p><br/><p>As if something caused a huge impact onto the ground.</p><br/><p>A tremendous shockwave rang throughout the ground.</p><br/><p>Like a huge earthquake.</p><br/><p>Rumble!</p><br/><p>From this tremendous earthquake, the building that were barely holding on started to all break down.</p><br/><p>And Ekidu realized what had caused that earthquake.</p><br/><p>‘Holy…Just from a single step…’</p><br/><p>The walls and buildings broke down as the shape of Dakidus, who had fallen from the sky, could be seen in the distance.</p><br/><p>The blue light that covered his body had disappeared.</p><br/><p>And this made him stand out even more.</p><br/><p>A huge 4m tall body that one couldn’t quite size up in the skies.</p><br/><p>Steel-like muscles.</p><br/><p>Claws that were the size of a human that seemed to be able to rip apart any armor.</p><br/><p>Dark, glossy skin that seemed like no normal weapons could even leave a dent.</p><br/><p>And that Dakidus was swinging his claws around and causing a massacre.</p><br/><p>Boooooom!</p><br/><p>Booooooom!</p><br/><p>“This scum like bastards! Make a trap?! Insolent! Come at me! You bugs! This Harvester shall rip you all apart!”</p><br/><p>“Uuuaaaaak!”</p><br/><p>Adventurers who had charged in after seeing Dakidus fall and judging that this was a chance.</p><br/><p>And all those adventurers were getting crushed.</p><br/><p>Rooooarrr!</p><br/><p>Every time Dakidus swung his claws or crunched with his mouth, a body was cut in half and heads fell off.</p><br/><p>They couldn’t tell when he was surrounded by the blue light.</p><br/><p>But as the image of the god disappeared, Dakidus who had fallen onto the ground was a demon in itself.</p><br/><p>‘Damn…Damn.’</p><br/><p>Ekidu made an expression of despair as she saw this.</p><br/><p>They had pulled him down from the skies and broke his wings.</p><br/><p>But this was not enough.</p><br/><p>No, Dakidus felt as if his authority had been challenged as he was causing a tremendous massacre in a frenzied state.</p><br/><p>This scene was like a crazed beast that they usually went up against.</p><br/><p>Except the problem was that the skills and artifacts that they usually armed themselves with had all been turned useless.</p><br/><p>This was why they were getting massacred.</p><br/><p>Hansoo spoke towards Ekidu.</p><br/><p>“Wake up. It’s just livestock anyway. A thief coming to this point is far enough.”</p><br/><p>‘A thief?’</p><br/><p>Enkidu made a confused expression and then shouted out urgently.</p><br/><p>“…You’re going to kill that? How!?”</p><br/><p>Hansoo stared at Ekidu.</p><br/><p>“We should do our parts.”</p><br/><p>If Dakidus was left like that then casualties would only rise.</p><br/><p>He needed to deal with him first.</p><br/><p>Hansoo, who had completely prepared to go fight, spoke towards Ekidu:</p><br/><p>“I’ll go deal with this. You gather the people, arm them with the items from the Armory and bring them.”</p><br/><p>Him alone was a bit hard.</p><br/><p>Since Dakidus still had a body of a beast even if he was going up against him.</p><br/><p>At that moment.</p><br/><p>Hellum, who had been stuck in the corner, smirked as he spat out.</p><br/><p>“Ke…heheh. You think the people will help you?”</p><br/><p>That thing was that strong even without mana.</p><br/><p>He knew since he had felt that strength.</p><br/><p>Who would be willing to go into that fight after seeing that scene?</p><br/><p>Hansoo stomped up to Hellum, raised him up by the collar and then spoke.</p><br/><p>Rumble</p><br/><p>“Who said help?’</p><br/><p>“What?’</p><br/><p>He couldn’t say anything to those guys who couldn’t do what they couldn’t.</p><br/><p>Since Dakidus who got supplied with mana was basically a god to them.</p><br/><p>But not now.</p><br/><p>He was just a beast who had come down onto the ground.</p><br/><p>If they couldn’t do the job when he gave them the chance then they had no qualifications.</p><br/><p>“I’m giving you guys a chance. A chance to stab a blade into its body.”</p><br/><p>‘This is the final test I’m giving you guys.’</p><br/><p>Hansoo spoke towards Ekidu.</p><br/>\n</div>"}