{"title": "Chapter 167 : Test (2)", "id": 167, "volume": 2, "url": "http://boxnovel.org/reincarnator-chapter-167-test-2", "volume_title": "Volume 2", "body": "<h1>Chapter 167 : Test (2)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 167 : Test (2)</p><br/><p>The representatives of the three races asked Clementine.</p><br/><p>This Clementine was very impudent but her proposition itself was quite alluring.</p><br/><p>For her to be able get rid of the human problem for them.</p><br/><p>In a full frontal clash the Higher races would beat the humans no matter what.</p><br/><p>But if the humans used other tactics then the story would change.</p><br/><p>Since the ones from before had shown them already.</p><br/><p>By giving the Makrons a fatal blow.</p><br/><p>And so the three representatives listened in on what Clementine had to say.</p><br/><p>Create a village.</p><br/><p>And make everyone who came up from here gather to this point.</p><br/><p>Then they would educate and threaten them with the system and the rules of the village and give them an idea that they would die if they left the villages.</p><br/><p>This would allow them to create a hierarchy system as well as allowing the Higher Races to receive Offerings.</p><br/><p>Many many birds with a single stone.</p><br/><p>Since they would be able to implant the seed of fear from the Higher races into the humans with ease and divide them so they won’t be able to trust each other.</p><br/><p>But if they only give them fear than the humans might work up.</p><br/><p>What else would they think about except escaping from the village which the Higher Races controlled who treated them as bugs?</p><br/><p>So they would add the hope factor.</p><br/><p>.</p><br/><p>By creating a path ahead called the Green Road.</p><br/><p>They created a path between the territorial boundaries and made all the humans head towards that way.</p><br/><p>So that these guys won’t run away into the jungle in fear.</p><br/><p>And Clementine’s plans were extremely successful.</p><br/><p>After all this had been set up.</p><br/><p>The three higher races had been able to control every single humans who came up with just a single Satellite Fortress.</p><br/><p>Since they just needed to go around the hope-filled villages and manage them.</p><br/><p>And even the villages were controlled by Clementine’s followers.</p><br/><p>And they just needed to go around the villages from time to time and have some fun.</p><br/><p>Humans filled with thoughts of retaliation were danger factors for them.</p><br/><p>But the trained humans were not dangerous to them at all.</p><br/><p>A very satisfying result.</p><br/><p>So the three races had asked.</p><br/><p>This Clementine wasn’t really that different from the three humans from before who had shaken them.</p><br/><p>No, she might even be greater.</p><br/><p>If Clementine had lead the humans then the three races would’ve had to struggle much more.</p><br/><p>Clementine laughed coldly at those words.</p><br/><p>And and spoke out her terms.</p><br/><p>……………………………………………</p><br/><p>‘Damn…But why has it turned like this?’</p><br/><p>Dakidus thought of the terms with Clementine and then made an expression of disbelief.</p><br/><p>Booooom!</p><br/><p>Boom!</p><br/><p>Ekidu, Karhal and everybody else had encircled Dakidus and were attacking him without end.</p><br/><p>Right before Dakidus had been able to kill the bug in front of him.</p><br/><p>That Ekidu girl had lead every human around here and had ran over here in order to hunt him down.</p><br/><p>“You bastard! Die!”</p><br/><p>“Fucking bitch! Anton died because of you!”</p><br/><p>Enraged people attacked Dakidus from all directions.</p><br/><p>Every throwable weapons in the Armory had been sent towards Dakidus.</p><br/><p>“Kuuuaaaaahhh!”</p><br/><p>The Enraged Dakidus tried to rush up and rip the humans apart but he couldn’t.</p><br/><p>“Where are you going.”</p><br/><p>Boooom!</p><br/><p>Since Hansoo held him down every time he tried to.</p><br/><p>And thanks to this Dakidus had been receiving the assault of tens of bugs that he could destroy with just a single swipe.</p><br/><p>A few wasn’t really a problem but the story changed when the number increased to thousands.</p><br/><p>There was no way he could hold on receiving these attacks that were coming down at him like rain.</p><br/><p>Dakidus got desperate and shouted out.</p><br/><p>“Roooaaaar! You damned Humans! Karim! What is that Karim guy doing!”</p><br/><p>This was not a scene he had expected to happen, ever.</p><br/><p>Since this shouldn’t have happened.</p><br/><p>“Daaammmniitt! You dumb humans! Do you even know what you guys are doing right now? Have you heard nothing from Karim!”</p><br/><p>The people stopped at those words.</p><br/><p>They were already quite nervous.</p><br/><p>As to what the final words Karim had tried to say were.</p><br/><p>Though the remaining guards were followers of Karim, there was no intel from them as if they didn’t know much.</p><br/><p>Dakidus made a bright expression after seeing this.</p><br/><p>“Hahahahaha! Dumbasses! That’s what I thought! You shouldn’t be doing this if you heard the story! It seems that worthless Karim had died even before he was able to say this!”</p><br/><p>There was a chance.</p><br/><p>If they were doing this even after hearing the story of Karim then there was no hope left for him.</p><br/><p>But if they hadn’t heard Karim yet?</p><br/><p>There was a chance for his survival.</p><br/><p>Booooom!</p><br/><p>Dakidus smashed away the incoming golden spear of Hansoo as he shouted out loudly towards the surrounding people.</p><br/><p>“You dumb bastards! Shall I tell you a fun story? It’s about that Clementine person!”</p><br/><p>‘Damn!’</p><br/><p>Ekidu tried to shut him up but Dakidus was much more stronger than Karim who had lost his arms.</p><br/><p>Truth started to come out from the Dakidus’s mouth while he was jumping around like a wounded beast.</p><br/><p>Loud enough to the point that everyone in the village could hear.</p><br/><p>……………………………….</p><br/><p>Dakidus who had been appointed as the Harvester, and managed the humans, and Clementine, the Executor of the plan, had shared quite a large amount of stories while creating the Green Road.</p><br/><p>Though Dakidus treated the humans as bugs, Clementine stimulated one’s curiosity quite a lot.</p><br/><p>Clementine always spoke out, as if it was a habit, even while creating the village.</p><br/><p>Clementine made a mysterious smile at those words and then mumbled.</p><br/><p>Though the strength of individuals were important but numbers were also an important factor in determining the strength of a group.</p><br/><p>But there was a problem.</p><br/><p>The battle never ended and there was always competition.</p><br/><p>The clash with outside forces was harsh but the bigger problem was the internal dispute between the humans.</p><br/><p>The fact that they didn’t have any knowledge as to who to target was an even larger problem.</p><br/><p>Since they didn’t know when the people, whom they had entrusted their lives to, would backstab them.</p><br/><p>At least if they hadn’t been comrades for numerous years.</p><br/><p>And this problem will continue even after they gone up.</p><br/><p>And an environment which changed all the time made it so there was no trust between the people.</p><br/><p>As danger and responsibility each person needed to bear increased and there were less resources, only more fights would occur.</p><br/><p>Clementine had continued to think this way but it was not enough.</p><br/><p>Since the power of the Helper clan or the Cross clan that had been set up by her enemies were too large.</p><br/><p>But the moment she saw the Yellow Zone.</p><br/><p>And as she saw the three races that didn’t really like the humans.</p><br/><p>Clementine judged that it was the right time to begin her plans.</p><br/><p>If if was a world controlled by the humans then controlling everything wouldn’t be that hard with just their own strength but this Yellow Zone was not the same.</p><br/><p>The Green Road beginning from the villages were a test.</p><br/><p>Something that tested the entire human race that the Higher races and Clementine’s followers had set up.</p><br/><p>The ones who passed would be sent up and the failures… would get turned into an Offering.</p><br/><p>There wasn’t a need to send up anybody who would possibly become a threat to her.</p><br/><p>Dakidus continued to speak.</p><br/><p>“Well. Usually you will continue to get tested as you go through the Green Road. But since this had happened. Let’s start the test even faster.”</p><br/><p>“That crazy bitch…”</p><br/><p>Everyone swirled their tongue around.</p><br/><p>These weren’t words aimed towards Dakidus.</p><br/><p>They were just shocked at the insane plan that Clementine had set up.</p><br/><p>Dakidus laughed coldly as he looked at the adventurers.</p><br/><p>“Is it too hard? Let’s make it simple. Stick by the Higher Races and decide to go up or side with the humans by playing around with that Ekidu and Hansoo. It’s easy right?”</p><br/><p>“Ugh…”</p><br/><p>Everyone started to mumble.</p><br/><p>It was clear which side they should side on.</p><br/><p>Since they were humans.</p><br/><p>Except the problem was that the winner and what would happen to the loser was too clear.</p><br/><p>If they side with the humans…then they will all get massacred.</p><br/><p>How would they be able to survive if the Higher races got serious?</p><br/><p>‘Kuuheheheh. Good, good.’</p><br/><p>Dakidus made a content smile as he saw their reactions.</p><br/><p>The attacks pouring towards him had been cut by half.</p><br/><p>Which means that they were pondering.</p><br/><p>‘Dumb Karim. If you said this earlier then things wouldn’t have come this far.’</p><br/><p>If Larim had said this earlier then they would’ve been divided already and had ran away towards the Green Road and the great jungle.</p><br/><p>There was only one reason why some were still attacking.</p><br/><p>They were attacking because they thought that they crossed a line they should not have and that they wouldn’t be forgiven anymore.</p><br/><p>Since they crossed the line, they wanted to see the end of it.</p><br/><p>‘Since I am mighty. I shall forgive you.’</p><br/><p>Since the attacks had reduced, his body felt much better.</p><br/><p>Dakidus shouted out even louder.</p><br/><p>“Since Hansoo and that bitch had did these stupid things, this village will get erased as a whole. Since there are a lot of other villages. Even if I die it’ll be the same. But there is still a final choice for you guys! Stick with me! Then I will follow the agreement I made with Clementine when we created the village and treat you as allies! I will forgive every attack you have made until now!”</p><br/><p>Dakidus then smiled</p><br/><p>“I know that you guys are easily swept up by the mood you see. You aren’t in the wrong. The ones who caused you to sway are the ones in the wrong.”</p><br/><p>Dakidus made a vicious smile towards Hansoo and Ekidu and then spoke out again.</p><br/><p>“I will count to ten! Those who will stick by me! Stop the attacks! I won’t even tell you to fight with me! As long as you stop…You will be forgiven. If I die…It’ll become troublesome right?”</p><br/><p>The people were split from those words.</p><br/><p>The storm-like attacks suddenly decreased in number drastically.</p><br/><p>And the battlefield suddenly got very quiet.</p><br/><p>As one person stopped and pondered, everything else happened in an instant.</p><br/><p>Like a wave, the silence ran throughout the entire village.</p><br/><p>Of course there were still a few who were still attacking.</p><br/><p>“Aarrrrk!”</p><br/><p>People who had lost their precious friends and family to him.</p><br/><p>And the people who hadn’t thrown their pride of humans away were attacking in a rage.</p><br/><p>“You dumb bastards! This is an amazing chance! A chance to kill that guy! What are you going to do if you miss this chance!”</p><br/><p>One of the people who had stopped attacking spat back.</p><br/><p>“We didn’t say we’ll join yet! You bastard! We’re just thinking about it!”</p><br/><p>“What? This fucking bitch!”</p><br/><p>“And if you aren’t going to guarantee our lives then how about shutting up?”</p><br/><p>The already nervous and anxious battlefield’s emotions swayed from Dakidus and ontop each other.</p><br/><p>And soon chaos occurred.</p><br/><p>Ekidu grinded her teeth as she saw this.</p><br/><p>‘This is what…Karim trusted.’</p><br/><p>Ekidu fell into despair.</p><br/><p>She had lived with hope.</p><br/><p>That the village wasn’t perfect but was needed.</p><br/><p>That it was an oasis that gave strength for them to be able to go through the road of hope, the Green Road.</p><br/><p>But for that road to be just a test arena used for testing humans.</p><br/><p>‘It’s a real shitty world.’</p><br/><p>What had she fought for until now?</p><br/><p>At that moment.</p><br/><p>Boooooom!</p><br/><p>Hansoo got smashed by Dakidus’s attack, flew past Ekidu and smashed into the ground.</p><br/><p>Kuududududk</p><br/><p>Dakidus laughed as he spoke after smashing away Hansoo.</p><br/><p>“You brat. You shouldn’t play around like that with just random information you picked up. What are you going to do now?”</p><br/><p>Dakidus admitted that Hansoo was amazing.</p><br/><p>But there was nowhere enough support from his surroundings.</p><br/><p>‘For him to dream about treason with just these guys.’</p><br/><p>The humans were, in the end, just livestock they grew.</p><br/><p>Since this entire world was under their control.</p><br/><p>It was a bit vague before but thanks to Clementine, they had been able to gain the complete control.</p><br/><p>“Random huh…”</p><br/><p>Hansoo spat out some blood and then grasped onto the Forked Lightning tightly after landing with a boom.</p><br/><p>He had told Ekidu.</p><br/><p>That this is the last test that he is giving them.</p><br/><p>Would it be a test if the student received help from the tester?</p><br/><p>Ooooooong</p><br/><p>Hansoo looked towards the golden castle up in the skies, the Atillan.</p><br/>\n</div>"}