{"title": "Chapter 177 : Maze (1)", "id": 177, "volume": 2, "url": "http://boxnovel.org/reincarnator-chapter-177-maze-1", "volume_title": "Volume 2", "body": "<h1>Chapter 177 : Maze (1)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 177 : Maze (1)</p><br/><p>“Hey friend! Wait up for a bit!”</p><br/><p>“…”</p><br/><p>Ekidu was dumbfounded at the sudden change in tone after climbing out from the Triple Fusion Beast’s body.</p><br/><p>‘Heh, look how he changes.’</p><br/><p>But Marun didn’t even take a glance at Ekidu as he walked towards Hansoo.</p><br/><p>‘It seems this guy is the boss here.’</p><br/><p>He had thought that Ekidu was the leader at the beginning.</p><br/><p>There were times when a smart person or a kind person became a leader.</p><br/><p>But it wouldn’t last long.</p><br/><p>Since a ruthless person who can deal with the problems in times of danger was the one who made decisions instead of the person who can talk around the problem.</p><br/><p>And he had never seen someone as strong as Ekidu even after moving to another village.</p><br/><p>But as they say the world is large, for him to be able to meet someone even stronger.</p><br/><p>The one who had killed the beast was Ekidu but if that guy wasn’t there to block that unstoppable beam, it wouldn’t even have been possible.</p><br/><p>That was why he was trying to talk to Hansoo instead.</p><br/><p>‘Yeah. Just stand still behind me.’</p><br/><p>Marun looked back at the Hunters who were all staring at him from behind, walked up to Hansoo and spoke.</p><br/><p>“Since it looks like there isn’t much time, let’s get to the point right away. I don’t know why you three are traveling as only three but let’s go together.”</p><br/><p>Kiiiiing!</p><br/><p>Constant screams of the Triple Fusion Beasts were heard from all around.</p><br/><p>‘Where the hell did these things pop out from anyway?’</p><br/><p>Marun frowned as he heard the screams and roars that rang throughout the entire forest.</p><br/><p>Karhal’s condensed Quintuple Beam had barely been able to leave a hole in its body.</p><br/><p>If he had tried to make the hole a bit larger then he might’ve even failed.</p><br/><p>These things had a monstrous amount of defense.</p><br/><p>Even him, who had the unique item Snake’s Path, would have a hard time trying to create a hole like the one Karhal had made.</p><br/><p>But for these things to suddenly pop out.</p><br/><p>Marun looked calm on the outside but he was urgent on the inside.</p><br/><p>There was no time to leave a good impression.</p><br/><p>Faster.</p><br/><p>He needed to show him that the two groups needed each other.</p><br/><p>“As you can see, we have a lot of people and every one of us are veteran Hunters. We were ambushed just now but we can be quite a formidable force if we combine our strength. I don’t know what kind of goals or thoughts you have but i think it would be better to head towards a single direction together instead of being enemies.”</p><br/><p>Though 30 had died, they still had around 470 people.</p><br/><p>There wouldn’t be a group larger than them in this forest.</p><br/><p>Maybe a hundred people more at most.</p><br/><p>If there weren’t beasts like that then he had the confidence to smash apart everything else until the end of the Green Road.</p><br/><p>Hansoo chuckled at Marun’s words which contained a trace of a threat.</p><br/><p>“You don’t know what kind of thoughts I have or where I’m headed to but for you to want to come with me.”</p><br/><p>“…?”</p><br/><p>Marun made a confused expression.</p><br/><p>He didn’t know what kind of thoughts Hansoo had but it shouldn’t be that much out of the box.</p><br/><p>Since the goals of everyone traversing through this damned world was one.</p><br/><p>Survival.</p><br/><p>Hansoo then motioned towards the Triple Beast’s Corpse with the tip of his chin while looking at Marun.</p><br/><p>“I’m now going to the nest of these things.”</p><br/><p>“…These things?’</p><br/><p>Karhal was the one who had actually freaked out from Hansoo’s words.</p><br/><p>A nest meant that it was where these things lived and that there were swarms of these things around.</p><br/><p>Hansoo nodded at Karhal’s reaction.</p><br/><p>Triple Fusion Beast, a beast that the Sages had created.</p><br/><p>The desperate Sages had combined the three Races and had created this but these large things couldn’t be kept under control and they couldn’t handle their own instincts as they prioritized the weak.</p><br/><p>The beasts, after judging that the Sages were weaker than them, had gone on a rampage to rip apart the Sages and so the Sages could only trap them in the underground Maze.</p><br/><p>.</p><br/><p>A key part of the last line of defense of the Sages.</p><br/><p>And now it was the base of Mount Liang, the ones who were in charge of the funnel.</p><br/><p>‘It’s now time to get to the headquarters.’</p><br/><p>He needed to get in before the doors closed.</p><br/><p>Into the maze where the Triple Fusion Beasts came out from.</p><br/><p>And he needed to get the item inside that place, the .</p><br/><p>“Having a lot of people isn’t quite useful in the maze you see.”</p><br/><p>The maze was a complex structure created to go up against the Higher Races that were invading them.</p><br/><p>It was created for a small number of people for a reason.</p><br/><p>Nothing will be gained if a group tried to swarm through the narrow passages.</p><br/><p>Since the best place to show off the might of numbers is the wide plains.</p><br/><p>Swarming into such a narrow place would only hinder each other’s attacks.</p><br/><p>Hansoo then pointed behind Marun and started to pick people out.</p><br/><p>“Him. Him. Him. Him… A total of eight. The rest would only get in the way.”</p><br/><p>“…”</p><br/><p>Marun frowned at Hansoo’s words.</p><br/><p>‘…This bastard. He has some amazing sense or is it something else?’</p><br/><p>The ones Hansoo had picked just now were the strongest of the 470 here.</p><br/><p>They were the Guards of the village.</p><br/><p>Of course they were much stronger and had better equipment than the Hunters.</p><br/><p>But Marun had purposely made their attires similar to the Hunter’s.</p><br/><p>Since the enemy would be more wary of a special-looking opponent.</p><br/><p>There shouldn’t be that many differences from a glance but for him to pick them out so meticulously.</p><br/><p>‘And… He’s going to go into their nest?’</p><br/><p>Marun pondered.</p><br/><p>In order find out what the hell this crazy guy was thinking about.</p><br/><p>‘Shall I threaten him a bit?’</p><br/><p>There was a reason why people did crazy things.</p><br/><p>There are always rewards that suited the crazy and risky things people do.</p><br/><p>‘Well…It’s just a threat.’</p><br/><p>Hansoo wouldn’t try to fight their group or anything due to their numbers.</p><br/><p>Marun thought about this and then flinched after seeing Hansoo’s eyes.</p><br/><p>‘Fucking hell…’</p><br/><p>There was a beast in the past which had similar eyes to Hansoo right now.</p><br/><p>2nd level Beast, Erona.</p><br/><p>A 4m large beast which looked like a red lion and marked its territory by smashing trees down with its front leg.</p><br/><p>And unlike how it looked, it was a herbivore as it ignored other beasts and only ate the trees within its territory.</p><br/><p>If you don’t cross over to its territory then it wouldn’t do anything to you no matter what you do even if you were right in front of it.</p><br/><p>And the newbies often make the mistake.</p><br/><p>That it’s a timid beast.</p><br/><p>And in order to gain the egg of an Erona, which was said to be extremely precious and rare, they often cross over the clearly marked territorial line.</p><br/><p>Nobody knew what happened to them.</p><br/><p>Since none of them had come back to the village.</p><br/><p>The current situation felt just like that.</p><br/><p>Like he had come right up to the boundary of Hansoo’s territory.</p><br/><p>The moment he tried to work around it he would lose his head.</p><br/><p>He had cold sweat running down his back because the twitching spearhead felt like it would pierce through his neck at any moment.</p><br/><p>His group might be able to win if they fight but what would it matter if his head was cut off already.</p><br/><p>At that moment.</p><br/><p>Roooaarr!</p><br/><p>A desolate cry was heard.</p><br/><p>From very nearby.</p><br/><p>“If you have nothing to say then we’ll head off first.”</p><br/><p>Hansoo left with those words.</p><br/><p>The Triple Fusion Beasts would come here if they remained.</p><br/><p>‘We’ll only get dragged down dealing with those guys.’</p><br/><p>There was a time limit for how long the entrance to the Maze stayed open.</p><br/><p>He needed to hurry up and get in before more of them swarmed to him.</p><br/><p>Since there was another reason to go into the maze other than the Defeated King’s Crown.</p><br/><p>Tadadak!</p><br/><p>“Phew…”</p><br/><p>Marun finally relaxed after Hansoo, Ekidu and Karhal disappeared and sighed as he balanced himself with Snake’s Path.</p><br/><p>And Mekill, one of the ex-guards, asked Marun while looking at him.</p><br/><p>“Shall we chase? What should we do? It smells a bit fishy.”</p><br/><p>They would be able to catch them if they chased.</p><br/><p>Since their specialties were more for hunting rather than a clash.</p><br/><p>‘Mmm….’</p><br/><p>Marun started to ponder after hearing Mekill’s words.</p><br/><p>…………………………………………</p><br/><p>Booooom!</p><br/><p>“Get behind me!”</p><br/><p>The moment Hansoo shouted.</p><br/><p>Karhal and Ekidu quickly made their bodies smaller as they hid behind Hansoo.</p><br/><p>And then.</p><br/><p>Booooooom!</p><br/><p>A beam of laser flew in from the distance and smashed into Hansoo.</p><br/><p>Jiiijijijik</p><br/><p>A hot wave of heat radiated into all directions.</p><br/><p>But Hansoo continued to run.</p><br/><p>He was now ignoring the Triple Fusion Beasts and was just running.</p><br/><p>And thanks to this the Triple Fusion Beast who was chasing was able to continue to send out it’s Destruction Beams without being attacked back.</p><br/><p>‘Fucking hell…’</p><br/><p>Karhal clenched his teeth while feeling the intense heat all over his body.</p><br/><p>Just the heat itself was this much.</p><br/><p>‘We have to dive into the place where it’s swarming with these things?’</p><br/><p>Karhal made a desperate expression from the situation which was much more dangerous than he had expected.</p><br/><p>It wasn’t like he volunteered because he wanted to help out.</p><br/><p>He had just stuck with him in case he would be able to find his long lost younger sibling if he followed him.</p><br/><p>If this guy really beat up all the Higher Races then finding his sibling who had been taken away by the Blue Jade being found wasn’t a dream.</p><br/><p>But for things to be like this.</p><br/><p>While Karhal was applying every skill he had onto Hansoo.</p><br/><p>Booooom!</p><br/><p>Another beam of light smashed onto Hansoo.</p><br/><p>It might’ve been easy if they dealt with one at a time while advancing but due to them just continuing to run, another one had caught up to them.</p><br/><p>Hansoo’s body got pushed back as it got hit by two Destruction Beams.</p><br/><p>Paaaaang!</p><br/><p>Ekidu saw this scene and then covered her entire body with the White River Demonic Art and jumped in front of Hansoo.</p><br/><p>Chiijijijik</p><br/><p>“Kuhuk!”</p><br/><p>A tremendous amount of pain.</p><br/><p>It melted down the White River Demonic Art and heated up the Scarlet Yang Armor.</p><br/><p>‘Damnit. It’s just one beam!’</p><br/><p>She had taken one of the two beams that was smashing into Hansoo but it was this painful.</p><br/><p>Ekidu shouted out urgently.</p><br/><p>“Now!”</p><br/><p>At that moment.</p><br/><p>Boooom!</p><br/><p>Karhal had condensed the Quintuple Beam while Hansoo and Ekidu bought him time and then shot it towards the Triple Fusion Beast.</p><br/><p>Booooom!</p><br/><p>Grrrrr!</p><br/><p>The Triple Fusion’s Beast swayed as a single beam stopped as Hansoo, Ekidu and Karhal started to run away from them.</p><br/><p>“Damnit man! Why are we hurrying so much! We can just deal with them one by one on the way! Or go in the next time!”</p><br/><p>Karhal shouted towards Hansoo who was running towards the entrance of the Maze like a mad bull.</p><br/><p>Even if those beasts called for help, they still had a lot of time until they reached the Maze.</p><br/><p>They could just deal with them one by one but why was he running in such a hurry.</p><br/><p>It was the same for the one back there.</p><br/><p>A full frontal battle would be hard but they could deal with it if they used their tactics.</p><br/><p>Why were they leaving those things behind?</p><br/><p>But Hansoo shook his head.</p><br/><p>Those things weren’t the issue right now.</p><br/><p>“There’s no time. We have to get into the maze when the door opens this time no matter what!”</p><br/><p>“What?”</p><br/><p>Booooom!</p><br/><p>Hansoo blocked another beam of laser which had flown into him and then looked into the distance where he had self-destructed Dakidus’s Satellite Fortress.</p><br/><p>He had stopped the interference of the Satellite Fortresses.</p><br/><p>But those Higher Races weren’t stupid.</p><br/><p>They should’ve figured it out by now.</p><br/><p>That the current situation would be impossible without somebody else’s interference.</p><br/><p>‘I know… Something will definitely come.’</p><br/><p>This was why they needed to hide within the Maze.</p><br/><p>The Maze was a place the Sages had built with the Higher Races in mind.</p><br/><p>It was a very useful structure to buy time from the ones chasing them.</p><br/><p>‘And… Gain the King’s Crown during that time. It’ll be good if a suspicious guy came.’</p><br/><p>Hansoo continued to think as he saw the entrance of the Maze that had started to appear in the distance.</p><br/><p>……………………………………….</p><br/><p>“Let’s go and try to catch them.”</p><br/><p>No matter how much he thought, trying to go in despite the huge amount of possible danger was strange.</p><br/><p>‘Taking that wouldn’t be bad either.’</p><br/><p>As Marun made his decision and spoke to Mekill.</p><br/><p>Boooooooom!</p><br/><p>Something giant fell down from the skies.</p><br/><p>And from this Mekill’s entire body had been smashed apart right next to Marun.</p><br/><p>“Huuk!”</p><br/><p>Marun freaked out as the person who he was talking to next to him had gotten smashed apart and then quickly shot out the Snake’s Path.</p><br/><p>‘It’ll work even if it’s the Triple Fusion beast.’</p><br/><p>But Marun’s hope had been smashed apart.</p><br/><p>Tuudududuk</p><br/><p>The arrow which had flown away with a vicious red aura had turned into a pile of powder near the opponent’s body.</p><br/><p>From the strange barrier around the opponent’s body.</p><br/><p>And Marun fell into despair after he saw this.</p><br/><p>Not because his attacks hadn’t worked but because he checked the identity of the opponent.</p><br/><p>‘Why…Why is the Arukon here.’</p><br/><p>A wolfman who had their entire body covered with the powerful mana of the Blue Jade.</p><br/><p>This place wasn’t the ceasefire zone.</p><br/><p>And this one didn’t look simple either.</p><br/><p>It was a full head taller than Dakidus whom he had seen in the past, a 5m tall wolf.</p><br/><p>And it even had some special gear.</p><br/><p>It was just a meter difference but the bulky muscles and the rough-looking furs radiated a fearsome aura which couldn’t even be compared to that of Dakidus.</p><br/><p>Sssssk</p><br/><p>The Judge, Akitrus, who was looking around while ignoring Marun who had fallen onto the ground and then picked up the terrified bug in front of his eyes.</p><br/><p>Humans whom he had found while tracking the traces from the village Dakidus was supposed to visit last.</p><br/><p>They might be of help.</p><br/><p>“Tell me everything you know. Is there a special human who has gone past this place?”</p><br/><p>There wasn’t much detail he needed to ask.</p><br/><p>Since someone like him shouldn’t be normal.</p><br/><p>Grrrrr.</p><br/><p>“Ahh….”</p><br/><p>Marun made a terrified expression at the intense amounts of deadly aura he felt but then suddenly shouted out in glee as if he had remembered something.</p><br/><p>“Yes! There is! Yes! He said he was going to the Underground Maze!”</p><br/><p>Akitrus raised his brows at those words and then smiled contently after thinking for a moment.</p><br/><p>And then smashed an arm of Marun.</p><br/><p>Crack.</p><br/><p>“Uaaaaaak!”</p><br/><p>“The ones running away kindly told you their destination?”</p><br/><p>Akitrus erased the smile on his face and then mumbled coldly.</p><br/><p>“You are making me really angry. Thanks to you it’s now even more confusing&gt;’</p><br/><p>“No! It’s real..Uaaaaaak!”</p><br/><p>Screams of despair rang throughout the Jungle.</p><br/>\n</div>"}