{"title": "Chapter 170 : Embers (1)", "id": 170, "volume": 2, "url": "http://boxnovel.org/reincarnator-chapter-170-embers-1", "volume_title": "Volume 2", "body": "<h1>Chapter 170 : Embers (1)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 170 : Embers (1)</p><br/><p>“Huff…Huff.”</p><br/><p>The Hunters and the Guards who had captured hostages and had grouped up in a circle were all breathing roughly.</p><br/><p>They had pushed themselves in order to capture the hostages in the midst of a fierce clash so they had all received a large injury.</p><br/><p>‘Damn. How did we turn out like this?’</p><br/><p>The guard, Carlton, who had captured a hostage suddenly grinded his teeth.</p><br/><p>They had been filled with the glory of victory as the Atillan had started back up.</p><br/><p>But Dakidus wouldn’t have made them do this if he had won and the Atillan was the way it was supposed to be.</p><br/><p>Dakidus had lost.</p><br/><p>Badly enough to the point he needed hostages.</p><br/><p>‘Damn.’</p><br/><p>The others around them slowly started to surround them en masse.</p><br/><p>From the vicious aura of those people, Carlton’s hand unconsciously tightened the grip on the neck of his hostage.</p><br/><p>They weren’t attacking him as if they were mindful of the hostage but the result was clear at this rate.</p><br/><p>‘Damn! At this rate…’</p><br/><p>The injuries he had gotten when he had pushed himself to acquire a hostage during the battle suddenly throbbed.</p><br/><p>Danger and pain mixed with each other as it brought urgency and rage.</p><br/><p>Carlton raised the broken blade in his right hand onto the hostage’s neck and the shouted.</p><br/><p>“You bastards! If you don’t want to see this bitch losing her head then move out of the way!”</p><br/><p>“Oh no, Mackill! You bastard let go of her!”</p><br/><p>Carlton, who was about to already go crazy from one of the Farmers surrounding him cursing at him, was enraged.</p><br/><p>“Bastard? You want me to show what a true bastard is you bitch?”</p><br/><p>There were a lot of hostages anyway.</p><br/><p>As long as they had the hostages, the surrounding people won’t be attack them easily.</p><br/><p>He had to show them now.</p><br/><p>As to what would happen if they didn’t move out of the way.</p><br/><p>“Look well! To what happens to this bitch! If you don’t move then from now on…”</p><br/><p>But as Carlton shouted and was about to cut off the head of the girl called Mackill.</p><br/><p>Boooooom!</p><br/><p>A tremendously loud sound roared in from the distance.</p><br/><p>“…!”</p><br/><p>Carlton flinched after sending the tremendously vicious aura and looked towards there the sound was coming from.</p><br/><p>And then freaked out.</p><br/><p>“Uuuhkk!”</p><br/><p>A tremendous bloody tsunami was rushing from from across the horizon where Hansoo and Dakidus were fighting.</p><br/><p>“Uaaa…”</p><br/><p>Everyone freaked out as they saw the giant red storm charging towards them across the ruins from the distance.</p><br/><p>A bloody storm that made one feel fear from just a glance.</p><br/><p>Carlton saw the tremendous amount of mana stored within that storm and almost released the neck of the hostage and backed away.</p><br/><p>That was how much the tsunami-like storm had freaked him out.</p><br/><p>An aura that made him feel like it would even shred his bones apart if it just grazed him.</p><br/><p>But Carlton forcibly suppressed his instinct which was screaming at him to run away.</p><br/><p>What would he do by running away?</p><br/><p>He didn’t know what Hansoo had done but Hansoo had won and Dakidus had lost.</p><br/><p>Hansoo would not let them go.</p><br/><p>Hostages were the only way for them to live.</p><br/><p>And Carlton believed.</p><br/><p>That Hansoo wouldn’t kill off every villager here including the hostages.</p><br/><p>The size of the red storm which didn’t distinguish from friend or foe was just tremendous.</p><br/><p>‘That’s all a fluke. A fluke.’</p><br/><p>There was no way that Hansoo would massacre everyone here.</p><br/><p>They were like this because they had no mana but once their mana came back, everyone here would be a tremendous force to be reckoned with.</p><br/><p>It might be different for those who went against him but to kill off the huge amount of people who had decided to follow him just to gain a few more runes?</p><br/><p>There’s no way Hansoo would do such a thing if his brain was functioning properly.</p><br/><p>‘Damn…That would be the logical case.’</p><br/><p>But the storm had made him want to ignore his logic and run away, the aura of the storm was that vicious.</p><br/><p>But it was too late.</p><br/><p>He couldn’t run away anymore.</p><br/><p>“Uuuaaaaaaak!”</p><br/><p>As Carlton saw the red tsunami which had rushed all the way up to his face and crouched down while screaming.</p><br/><p>Whooooosh.</p><br/><p>The bloody storm just swept past them.</p><br/><p>Past Carlton who was still holding onto the neck of Mackill despite crouching.</p><br/><p>As well as Mackill who had been made unconscious by Carlton.</p><br/><p>Actually, everyone had instinctively crouched their bodies down into a ball or had laid down onto the ground.</p><br/><p>In order to defend themselves from the sudden, mysterious storm.</p><br/><p>Whoooosh!</p><br/><p>The red tsunami just swept past everyone’s body.</p><br/><p>And then a change occurred.</p><br/><p>The red storm, which had ignored the ruins and was continuing to rush through, suddenly started to target lifeforms as it gathered itself.</p><br/><p>Like fireflies being attracted to a light in the darkness.</p><br/><p>Woooosh</p><br/><p>It was like a storm when it was rushing through but as it sensed life, the small pieces of the storm swayed like smoke from the wind as they slowly but carefully started to shroud the people of the village.</p><br/><p>And soon everyone’s body, including Carlton’s, had been shrouded by a red cloud.</p><br/><p>‘Ugh…’</p><br/><p>Carlton really didn’t like the red cloud that was swaying up and down surrounding his body but he sighed in relief for now.</p><br/><p>Since it didn’t really look like it was harming him for now.</p><br/><p>And looking at it more closely, the powder-like red pieces that were floating around were actually quite beautiful.</p><br/><p>‘Yeah. If it’s a trick then…’</p><br/><p>As Carlton clenched his fist tightly while looking at the red cloud shrouding him and Mackill.</p><br/><p>The small red pieces Carlton praised, the spores, were constantly communicating.</p><br/><p>…………………………………………..</p><br/><p>‘Good.’</p><br/><p>Hansoo spread out his arms from the sensations coming into his body and then looked up into the skies.</p><br/><p>They couldn’t even be called spores anymore.</p><br/><p>The small red pieces which had become small lifeforms of their own, integrals, were constantly communicating with electrical signals.</p><br/><p>The trillions of spores swept throughout the entire vicinity, touched, sensed and checked over every corner of the world as they relayed and sent back the information they had gathered.</p><br/><p>And the signals that were sent out relayed through the other spores as they were sent back to Hansoo at the speed of lightning.</p><br/><p>And these signals that were coming in were being reconstructed within Hansoo’s head.</p><br/><p>The area the red cloud had swept past could be felt vividly, as if it was a part of his body.</p><br/><p>A feeling of his body being extended by a huge amount.</p><br/><p>He could feel the unconscious Mackill as well as the nervousness of the guard who was looking around in confusion while holding onto her.</p><br/><p>He could feel the rage of the barely alive Dakidus and Ekidu who was looking around in shock.</p><br/><p>He could feel the anxiousness and enmity the thousands of people had against each other and could clearly determine who were his allies.</p><br/><p>But Hansoo, who had been standing with his arms open out wide, grasped onto his throbbing head as he fell onto his knees.</p><br/><p>‘…Can’t handle it anymore.’</p><br/><p>This was well past the information any human being could handle.</p><br/><p>No, the amount of integrals was not something he could handle with his current abilities.</p><br/><p>He had forcibly evolved the pandemic blade with the amount of mana that would’ve easily melted his body down if not for the body enhancement given to him by the Atillan.</p><br/><p>He couldn’t even create these integrals with his original mana.</p><br/><p>Well, he may be able to use them but he wouldn’t be able to cover such a vast area.</p><br/><p>An effect that he couldn’t handle which was created from a tremendous amount of mana.</p><br/><p>‘End it.’</p><br/><p>He already had distinguished between his allies and enemies.</p><br/><p>Clench</p><br/><p>The moment Hansoo, who was kneeling, clenched.</p><br/><p>Hansoo’s will spread through the red cloud and spread in every direction.</p><br/><p>………………………………………….</p><br/><p>Whoooosh.</p><br/><p>“Huh? Huhhh?”</p><br/><p>Carlton unconsciously screamed out loud as he saw the red clouds that were suddenly going hectic.</p><br/><p>The red clouds that were shrouding Mackill just ignored her and were instead all rushing into him.</p><br/><p>No, not just the cloud around Mackill but every bit of red pieces around him were all rushing to him.</p><br/><p>Like fire ants charging onto a prety.</p><br/><p>‘Hostage…’</p><br/><p>Carlton, who had unconsciously clenched the hand which was holding onto the neck of Mackill, stopped suddenly.</p><br/><p>Because the idea was so stupid.</p><br/><p>‘What would I do with the hostage.’</p><br/><p>Was he going to threaten the red cloud or something?</p><br/><p>That he would twist the neck of the hostage if it didn’t get off him?</p><br/><p>“Fucking hell!”</p><br/><p>Hostages weren’t important anymore.</p><br/><p>Carlton felt anxious at the red clouds surrounding his body and then subconsciously tried to escape out from them.</p><br/><p>But it was already too late.</p><br/><p>Whoooosh</p><br/><p>The surrounding integrals floating around Carlton madly rushed towards Carlton.</p><br/><p>Like dust being attracted by static.</p><br/><p>In just a moment Carlton had been surrounded from head to toe by them as if he was covered by a red burlap bag.</p><br/><p>At the same time.</p><br/><p>“Uuaaaaaak! Aaaak!”</p><br/><p>Carlton started to scream.</p><br/><p>Not jut Carlton but everyone else around him who had sided with Dakidus.</p><br/><p>There wasn’t one person who was excluded.</p><br/><p>Everybody who had fought for Dakidus and hurt or held the Farmers hostage all screamed out like Carlton as they rolled around on the ground.</p><br/><p>And everyone who had come out from the red cloud just watched this scene in daze.</p><br/><p>“Aaaaaak!”</p><br/><p>“Damn! Why isn’t it coming off!”</p><br/><p>The people screamed out in agony as they rolled around on the ground.</p><br/><p>As if they were trying to shake off any bit of the red powder they can.</p><br/><p>But their efforts were futile.</p><br/><p>The red powder covering their entire body had no intentions of dropping off.</p><br/><p>And everyone who was watching this made an expression which had a hint of fear within.</p><br/><p>“Uaaaa….”</p><br/><p>A human was being gnawed upon whole.</p><br/><p>By the red powders.</p><br/><p>Well, it might not necessarily be eating them up.</p><br/><p>Since such small powders wouldn’t have any mouth.</p><br/><p>But no other words but eat or devouring fit what was going on.</p><br/><p>The people weren’t rolling from some random pain.</p><br/><p>They were actually being erased.</p><br/><p>Very slowly from the outside.</p><br/><p>Skin disappeared as muscles were shown.</p><br/><p>Veins disappeared as the bones beneath came out.</p><br/><p>An entire person was being melted down from the outside.</p><br/><p>It would be normal if blood came out but even that blood was getting devoured.</p><br/><p>Actually, even if it came out they wouldn’t notice.</p><br/><p>Since the red powder that was eating up the human was red like blood anyway.</p><br/><p>“Kuhuuh….Uhhhuh.”</p><br/><p>The screams coming out from all around slowly reduced in number.</p><br/><p>Since even the vocal chords to scream had been eaten.</p><br/><p>And as the disaster-like change had stopped.</p><br/><p>Swooosh</p><br/><p>The red powders which had devoured thousands of people all got sucked into the ground…</p><br/><p>And the area where the people had been rolling was empty like a ballroom after a party.</p><br/><p>There were traces of people but no actual people.</p><br/><p>The ownerless artifacts and dropped runes were the only things proving that the recent incident wasn’t a dream.</p><br/><p>“…”</p><br/><p>The people who had been held as hostages felt those artifacts as they reminded them of the guards who existed right next to them just a while ago.</p><br/><p>And then washed away the chill they felt running down their body.</p><br/><p>This was a good thing.</p><br/><p>All the traitors had been dealt with and everyone who was held captive had been released safely.</p><br/><p>Dakidus should’ve died and since they’ve even gained the Atillan, they just needed to get to the next level.</p><br/><p>Nothing could be better.</p><br/><p>But despite this, another emotion sprang up from the deepest parts of their mind and swept past them.</p><br/><p>As rage disappeared, fear filled the empty space.</p><br/><p>Karhal made a complex expression as he looked at Hansoo who was walking through the silent ruins as he tried to wash away the fear he felt.</p><br/>\n</div>"}