{"title": "Chapter 186 : The King’s Tomb (4)", "id": 186, "volume": 2, "url": "http://boxnovel.org/reincarnator-chapter-186-the-king%E2%80%99s-tomb-4", "volume_title": "Volume 2", "body": "<h1>Chapter 186 : The King’s Tomb (4)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 186 : The King’s Tomb (4)</p><br/><p>Then.</p><br/><p>Kwaddudududk!</p><br/><p>Akitrus stared right at the spear flying towards him but then quickly twisted his head to the side.</p><br/><p>‘I can dodge it!’</p><br/><p>The human was quite powerful but he was the strongest warrior of the Akarons.</p><br/><p>Even whilst he was moaning in pain from the fist, Akitrus’s body instinctively tried to dodge the attack.</p><br/><p>Kudududuk!</p><br/><p>Akitrus’s powerful body and sharp senses didn’t let him down as he succeeded in barely dodging the spear.</p><br/><p>Only the spear though.</p><br/><p>Sadly for Akitrus, the mana reinforcement coating the spear grazed past his left cheek and burnt it on the way past.</p><br/><p>Chwaaaak!</p><br/><p>“Aaaaaaak!”</p><br/><p>Akitrus freaked out at the pain which he hadn’t felt in a very long time as he backed off while clutching onto the Akion.</p><br/><p>The skin and flesh of his left cheek had all burnt up and his sharp fangs and his bottom jaw could be seen.</p><br/><p>But even in the midst of this Akitrus suppressed his rage and controlled his mind.</p><br/><p>‘I’ll die if I back off!’</p><br/><p>Attack.</p><br/><p>He could only attack.</p><br/><p>Akitrus had never heard of a case where somebody won against a beast charging at them to rip them apart by backing away from them.</p><br/><p>“Kuaaaaap!”</p><br/><p>A shout came out from Akitrus’s mouth which had bones partially showing.</p><br/><p>At the same time the blue light of the Akion cut across the skies again and headed towards Hansoo.</p><br/><p>But Hansoo shook his head.</p><br/><p>Since he had achieved his goal the moment he grazed Akitrus.</p><br/><p>The sense destruction, one of Nurmaha’s ring power that he gained at the Orange Zone in the past, was starting to burn through Akitrus.</p><br/><p>‘It’s the end.’</p><br/><p>The sense destruction required a lot of mana to use but it was like a fatal poison to warriors who were very proficient in using their bodies.</p><br/><p>No, it might even be more fatal than a poison which stopped their hearts.</p><br/><p>And as he expected.</p><br/><p>Whooosh</p><br/><p>“Huuk!”</p><br/><p>Akitrus yelled out in shock.</p><br/><p>Since the end of his spear had landed at a completely wrong place.</p><br/><p>Sway</p><br/><p>His five senses were disrupted as his balance was lost.</p><br/><p>It was as if his muscles, nerves and mind were acting separately.</p><br/><p>‘Fuck…’</p><br/><p>Akitrus made an expression of despair.</p><br/><p>He had lost the balance of his body in a one on one fight and had swayed.</p><br/><p>He knew instinctively.</p><br/><p>That he would definitely die here.</p><br/><p>And the spear that was flying towards his face proved his thought.</p><br/><p>Even during when the strange energy inside of him was disrupting his senses, the end of the spear heading towards his head could be seen very clearly.</p><br/><p>They say time flows slower when one’s about to die.</p><br/><p>Akitrus could see many other things other than the spear coming to smash apart his head.</p><br/><p>The mysterious black armor that did not look simple at all.</p><br/><p>Injuries to the armor caused by the Akion could be seen.</p><br/><p>But surprisingly, the black armor opened its mouth and started to eat up the metal armor around his own body while healing itself.</p><br/><p>And Akitrus was able to solve one of the questions before he died.</p><br/><p>‘That’s the thing that stopped the Akion huh.’</p><br/><p>The strange armor was constantly eating metals while enhancing its own body.</p><br/><p>Since it had eaten special metals and had condensed numerous tens of times over, resisting the Akion wasn’t an insurmountable task.</p><br/><p>No, it wouldn’t stop at the Akion.</p><br/><p>If that armor continued to eat the liquid metal and evolve then that armor would easily resist the attacks of the Satellite Fortress as well.</p><br/><p>‘But still…You will still die. My king. Please avenge me.’</p><br/><p>It wouldn’t matter.</p><br/><p>No one could win over quantity.</p><br/><p>There was a limit to how much a single person can accomplish.</p><br/><p>Even killing himself who had fallen into a trap was this hard for him.</p><br/><p>He would not be able to contend against a king who ruled over a world and his huge army.</p><br/><p>Akitrus suppressed his nervousness and then looked at Hansoo again.</p><br/><p>The thing that came into his eyes after the armor was the ring on his hand.</p><br/><p>The object which had killed him.</p><br/><p>Not only did it smash apart his mana barrier, it pushed its mysterious aura inside him and was still shining.</p><br/><p>At that moment.</p><br/><p>Akitrus remembered that he had seen that ring before.</p><br/><p>So distinct that he could remember even right as he was about to die.</p><br/><p>‘…Where did I see it?’</p><br/><p>As the spear reached right up to his nose, Akitrus’s brain went through his entire memory at lightning fast speed.</p><br/><p>As the spear cut through his fur as was proceeding to enter his flesh.</p><br/><p>Akitrus finally rummaged through his memories and remembered where he had seen it before.</p><br/><p>The three Higher races.</p><br/><p>And the three kings who ruled over those races.</p><br/><p>There was a time when the three kings, who weren’t really on friendly terms with each other, had gathered together.</p><br/><p>To meet a single human being.</p><br/><p>It was an unprecedented event.</p><br/><p>Almost a hundred Satellite Fortresses were on guard against each other and had gathered in the center of the Green Road and hundreds of warriors also gathered at that location in order to guard their king.</p><br/><p>Of course Akitrus, the judge and the strongest warrior of his entire race, had been there too.</p><br/><p>He had seen it then.</p><br/><p>The arrogant human who had called the three kings.</p><br/><p>And the ring that was on her hand.</p><br/><p>‘Yes. That’s it! I remember it!’</p><br/><p>He remembered clearly.</p><br/><p>Since the king of the Rebeloongs asked the human because he wanted that ring.</p><br/><p>A king granting somebody a wish.</p><br/><p>There was no wish that a king who ruled a third of this entire world could not grant.</p><br/><p>A tremendous opportunity.</p><br/><p>Even Akitrus and Dakidus’s mouths had gaped open.</p><br/><p>They knew the king of the Rebeloongs loved jewelry and precious objects so much but for him to grant a wish for one.</p><br/><p>But the human, Clementine, kicked away that opportunity in an instant.</p><br/><p>A one of a kind of a ring.</p><br/><p>As he saw this.</p><br/><p>Akitrus grinded his teeth.</p><br/><p>A strange noise came out from the half blown away mouth of Akitrus.</p><br/><p>‘I knew this would happen. These fucking bugs.’</p><br/><p>The story changes.</p><br/><p>If the ones who have the Destruction Jade obtain these strange liquid metals?</p><br/><p>And if they start to plan things out?</p><br/><p>Akitrus’s expression turned grim.</p><br/><p>He could not dodge his death anymore.</p><br/><p>The spear which had gotten through his fur and entered his flesh was slowly, very slowly entering into the space between his eyes.</p><br/><p>But he could not die like this.</p><br/><p>He needed to let this be known before he died.</p><br/><p>As the spear pierced through his skull and was heading into the brain.</p><br/><p>Akitrus didn’t even shake one bit as he glared at the one piercing through his head.</p><br/><p>He focused on the face and the ring.</p><br/><p>And everything he saw was recorded and sent by the helmet on his head.</p><br/><p>‘O king. These bugs have betrayed us. Look at this guy. Look at the ring in his hands.’</p><br/><p>This should be enough.</p><br/><p>The rest would be solved by his comrades who receive the information.</p><br/><p>And as he thought that his job was done, his mouth slightly curled up to a smile.</p><br/><p>‘Yeah. I didn’t like them in the first place. For them to stand on equal grounds with us.’</p><br/><p>They would be able to kill Metiron and the others hiding in the Green Road.</p><br/><p>No, it wouldn’t just end there.</p><br/><p>They will kill every single human being in the village, Bird Cade and the Green Road as well.</p><br/><p>Since the humans were just being raised from Clementine’s demands anyway.</p><br/><p>‘They’ll be able to kill. Since they’re all gathered in one place.’</p><br/><p>As Akitrus was about to laugh coldly.</p><br/><p>Whooosh</p><br/><p>The spearhead penetrated through his brain.</p><br/><p>And Akitrus’s consciousness disappeared along with it.</p><br/><p>“Phew…”</p><br/><p>Rumble</p><br/><p>The moment Akitrus died.</p><br/><p>The Maze rumbled as it spread out.</p><br/><p>At the same time the liquid metal that was surrounding Hansoo’s body got sucked into the maze walls.</p><br/><p>Hansoo didn’t release them.</p><br/><p>Something more powerful than the dark cloud had forcibly taken it.</p><br/><p>The metal the Thousand Soldiers Armor had eaten had remained but the metal armor surrounding Hansoo’s body got spread out as the metal returned to the maze walls.</p><br/><p>And Hansoo frowned as he picked up the Akion.</p><br/><p>This strange effect meant that the complete owner of the of the maze had appeared.</p><br/><p>‘…Karhal and Ekidu failed huh’</p><br/><p>While he had been blocking Akitrus here, Karhal and Ekidu had run through the wall Hansoo had broken and headed towards the one with the crown.</p><br/><p>Since it would be too dangerous to deal with Akitrus and the one who controlled the maze from the same location.</p><br/><p>‘They should’ve been able to succeed according to my calculations.’</p><br/><p>The metal spears were fast and strong but Karhal and Ekidu’s bodies were more than enough to dodge them.</p><br/><p>And for the person to not attack him after completely taking over the maze.</p><br/><p>At that moment.</p><br/><p>Rumble</p><br/><p>A wall of the maze crumbled as a path leading somewhere appeared.</p><br/><p>As if it was welcoming Hansoo who had slain Akitrus.</p><br/><p>As if it was welcoming a general coming back from the war, the liquid metals protruded out from the walls in a shape of trumpets as they rang out.</p><br/><p>Pah-pa-rah!</p><br/><p>‘…He’s not that talented in music it seems.’</p><br/><p>Anyways, it didn’t seem like there was much enmity.</p><br/><p>Hansoo listened to the music which was off tone and off beat as he ran through the tunnel and headed into the center of the maze.</p><br/><p>………………………………..</p><br/><p>After a long run a huge area could be seen.</p><br/><p>There were only two people within the huge cave filled with thousands of skeletons.</p><br/><p>“…You came?’</p><br/><p>“You’re here?”</p><br/><p>Karhal and Ekidu were staring at the center of the throne with perplex expressions.</p><br/><p>And a single corpse was laying on the throne powerlessly.</p><br/><p>‘…He was called Junghwan I believe.’</p><br/><p>Hansoo frowned as he looked at Junghwan with his right hand missing.</p><br/><p>And the crown on his head had disappeared as well.</p><br/><p>Ekidu looked between Hansoo and the corpse as she spoke.</p><br/><p>“The moment we arrived he collapsed. And the crown…The liquid metal came out and took it up.”</p><br/><p>There was something shining red at the top of the cave.</p><br/><p>At that moment.</p><br/><p>Gurgle gurgle.</p><br/><p>Something came out from the ground.</p><br/><p>Some liquid metal.</p><br/><p>Flinch.</p><br/><p>Ekidu and Karhal guarded against it nervously.</p><br/><p>Since they remembered how they had suffered from the liquid metals from before.</p><br/><p>They had thought the attacks had stopped as Junghwan died but for them to return.</p><br/><p>But the liquid metals did not turn into the sharp spears.</p><br/><p>Actually they just gurgled around like oil and then turned into a familiar look.</p><br/><p>Gurgle Gurgle.</p><br/><p>Junghwan, who still had his hand missing, smiled as he appeared before the three.</p><br/><p>‘…This bastard. What’s he thinking?’</p><br/><p>Karhal frowned as he looked at Junghwan.</p><br/>\n</div>"}