{"title": "Chapter 197 : Experiment (2)", "id": 197, "volume": 2, "url": "http://boxnovel.org/reincarnator-chapter-197-experiment-2", "volume_title": "Volume 2", "body": "<h1>Chapter 197 : Experiment (2)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 197 : Experiment (2)</p><br/><p>Kuoooooooo</p><br/><p>Karioram, one of the Akalachias walking through the long tunnel, wondered for a bit and then spoke towards Pektoril.</p><br/><p>“What is this place?”</p><br/><p>They had enjoyed their time for quite a while above but they had never heard of a place like this before.</p><br/><p>Light didn’t come through but the tunnel was filled with the strange and intricate machinery similar to the insides of the Satellite Fortress.</p><br/><p>And the Rebeloong’s teeth marks and claw marks of the Akalachias and Arukons.</p><br/><p>‘There’s no traces of weapons… This is not recent.’</p><br/><p>Karioram mumbled quietly.</p><br/><p>Their claws and bodies were strong but it wasn’t comparable to their weapons.</p><br/><p>Which meant that they didn’t have anything else to use.</p><br/><p>Traces of war where desperation could be felt from.</p><br/><p>It was something that was hard to imagine since they were the Higher Race.</p><br/><p>Karioram made a confused expression and mumbled quietly.</p><br/><p>‘Did the war against the Sages not proceed peacefully?’</p><br/><p>The way Karioram had learnt their history.</p><br/><p>That the four races had revolted against the Sages.</p><br/><p>And they had used their powerful bodies against the Sages to kill them off.</p><br/><p>But it seemed like that wasn’t the case.</p><br/><p>Pektoril frowned at Karioram’s question and then spoke out.</p><br/><p>“This was a place where we were experimented on in the past.”</p><br/><p>“…Pardon?”</p><br/><p>Pektoril cut him off.</p><br/><p>“Don’t ask. Just look over here.”</p><br/><p>And Karioram cursed out loud as he saw where Pektoril was pointing towards.</p><br/><p>“…Fuck.”</p><br/><p>Countless rooms were connected to the tunnel in front of them.</p><br/><p>The countless rooms with transparent walls seemed to have been disconnected from power as they were dark but the Akalachia’s enhanced vision allowed them to see through the darkness.</p><br/><p>Bubble.</p><br/><p>Glass containers filled with liquids.</p><br/><p>In the 28 glass containers, there were numerous types of animals in there.</p><br/><p>There was a monster-shaped one like the black leopards of the jungle as well as beasts which resembled gorillas.</p><br/><p>Tens of these glass containers were in each room and in every container there were different animals in it surrounded by the strange liquid.</p><br/><p>But there were a few glass containers that caught their eyes specifically.</p><br/><p>‘Parrot…’</p><br/><p>Karioram freaked out as he saw the glass container.</p><br/><p>A bird that was 10m large, had golden feathers and huge wings.</p><br/><p>Of course this bird was completely different from the Akalachias.</p><br/><p>They didn’t have the thick arms or thighs, they didn’t even have the pectoral muscles that resembled humans.</p><br/><p>It looked exactly liked the birds that lived in the jungles.</p><br/><p>They were much more different than the Akalachias who had a humanoid shape.</p><br/><p>But Karioram couldn’t stop staring.</p><br/><p>When he was finally able to look away, other glass containers came into his view.</p><br/><p>Monkey, mouse and dog.</p><br/><p>These guys also looked much more different than the Arukons or Rebeloongs.</p><br/><p>Karioram made a discontent expression as he looked at Pektoril.</p><br/><p>“What the hell are these? Why aren’t we breaking them and leaving them?”</p><br/><p>Pektoril replied softly as he looked at Karioram who was growling in anger while pointing towards the glass containers.</p><br/><p>“How could we, they’re still our ancestors.”</p><br/><p>The animals who were in those containers were what they had come from.</p><br/><p>Since only 4 animals who had passed the experiments out of the 1489 different kinds which lived in the jungle.</p><br/><p>Only four of them had been able to withstand the mana furnace the Sages had within their bodies to create the pond which created the mana crystals, the .</p><br/><p>And it was impossible to do so with the original method so they had to go through a lot of bodily experiments and surgeries to become similar to the sages first.</p><br/><p>And Karioram shouted out in rage at Pektoril’s mumbles.</p><br/><p>“…Are you saying we were mere experimental beasts?”</p><br/><p>They had always been in awe about their majestic civilization and the Satellite Fortresses.</p><br/><p>A power that even their powerful bodies could not have.</p><br/><p>A single beam could twist rivers and turn mountains into lakes overnight, this kind of power left everyone in awe.</p><br/><p>But at the same time this power was a symbol of their pride.</p><br/><p>Since it proved that they were the victors.</p><br/><p>The symbol of them winning against the Higher Races who used these Satellite Fortresses.</p><br/><p>These were mere loots.</p><br/><p>So shouldn’t they have been existences standing even higher than the ones who created such things?</p><br/><p>But for them to just be experiments.</p><br/><p>‘That… We are even lower than pets…’</p><br/><p>It was a treatment worse than pets and bugs.</p><br/><p>Pektoril chuckled towards Karioram.</p><br/><p>“Let me ask you one thing. Do you think we beat the Sages with a normal method? The Sages who had the spear of wrath, Akion, and rode on Satellite Fortresses?”</p><br/><p>“…”</p><br/><p>“The Sages had technology that could erase the earth and split the heavens, do you think our muscles, golden spears and golden armors worked against them? Do you really think we can win against them in a fight with our strength?”</p><br/><p>Karioram fell into silence.</p><br/><p>It was all true.</p><br/><p>No matter how many of them there were, no matter how they had ambushed them, it was logically impossible for them to win against the people with such technology.</p><br/><p>A single Satellite Fortress was enough to erase tens of thousands of them.</p><br/><p>Even if they could fly up in the skies or a sixth sense or destruction beams, they were mere fireflies against a lamp.</p><br/><p>And even more so if their strength was something the Sages had given them in the first place.</p><br/><p>“Then how did we win? Aren’t we the ones standing on our two legs in the end?”</p><br/><p>Pektoril mumbled as he looked at Karioram who was on the verge of tears with anger.</p><br/><p>“Well. We were lucky.”</p><br/><p>‘Very fucking lucky.’</p><br/><p>Pektoril thought of the days when he first gained a consciousness.</p><br/><p>…………………………………………..</p><br/><p>Exactly 790 years ago.</p><br/><p>Pektoril remembered this moment perfectly.</p><br/><p>Since this was the moment Pektoril gained his consciousness and started to remember everything else upto this date.</p><br/><p>So he had gained his consciousness.</p><br/><p>Within the glass containers of the research labs and by the hands of the Sages.</p><br/><p>And there were already other organisms which had been successful next to him.</p><br/><p>Mouse, wolf and monkey.</p><br/><p>The beasts, whom still remembered of their days in the jungle, were walking around the research labs under the guidance of the Sages with humanoid bodies.</p><br/><p>And after they got used to their new body and consciousness, they had been released to the current Birdcage and had been able to live.</p><br/><p>Maybe it was to stop them from escaping but the Birdcage, which was made of a strange material, limited their flight, Rebeloong’s communication abilities and the Arukon’s sixth sense but he remembered freely roaming around this place.</p><br/><p>And he remembered the conversations of the Sages who was observing him and the others.</p><br/><p>Anyways, the Akalachias weren’t really discontent from this lifestyle.</p><br/><p>Though they went through a few experiments, it was pain they could handle with their powerful bodies and experimenting around with their the newly gained strength was exciting.</p><br/><p>Pektoril, who had struggled for survival day by day in the jungle and longed for strength, a power like this and the ability to control mana was too good.</p><br/><p>Days flew past extremely fast as he practiced controlling mana day by day and thought of things he couldn’t when he had been living in the Jungle.</p><br/><p>And he knew instinctively.</p><br/><p>That no matter how strong they were, they would still get massacred themoment they go against the Sages.</p><br/><p>They had been able to live with a clearer mind because they had become smarter.</p><br/><p>They knew that they couldn’t challenge the ones who had given them their strength.</p><br/><p>Sometimes the memories of his time in the jungles swept by his head.</p><br/><p>The giant metal mountain that blazed the mountains and the fields along with the sun-like energy that came out from those mountains, the Sages who controlled all of this.</p><br/><p>Memories of running away from such Sages.</p><br/><p>If the Sages were a mysterious fear when they had been living in the jungle then the sages were closer to gods now.</p><br/><p>Of course the Rebeloongs and Arukons had different thoughts.</p><br/><p>Strangely, the Sages were rougher with the Rebeloongs and the Arukons than with them, the Akalachias, and the race created from monkeys, the Makrons.</p><br/><p>And the Rebeloongs, who were large in number and the weakest of them all, went through all sorts of experiments and suffering.</p><br/><p>Of course the Akalachias and Makrons also felt bad while watching this.</p><br/><p>Even though they weren’t receiving such treatment, they were all the same.</p><br/><p>Though the Rebeloongs grouped up and planned and constantly looked for an opportunity against the Sages, it was virtually an impossible feat.</p><br/><p>Since a chance the Rebeloongs wanted would never occur in this place where hundreds of thousands of Sages went in turns to manage them.</p><br/><p>But as the Rebeloongs and Arukons got tired and the Akalachias and Makrons trembled in fear.</p><br/><p>A miraculous event occurred.</p><br/><p>The Sages all disappeared.</p><br/><p>All hundreds of thousands of them.</p><br/><p>Only a few had been left behind.</p><br/><p>…………………………………………..</p><br/><p>“Disappeared?”</p><br/><p>Pektoril nodded at the words of the warrior, Karioram.</p><br/><p>The hundreds of thousands of them had all disappeared.</p><br/><p>And a few people were left behind to manage over their research labs and the four races.</p><br/><p>Of course these guys weren’t able to defend against the Rebeloongs who had prepared for so long.</p><br/><p>The Rebeloongs, who were transferring intel against each other, persuaded the other three races and the three races, who were trembling in fear already, followed Rebeloong’s words as they revolted and escaped the Birdcage.</p><br/><p>And they had been able to win against the remaining small numbers of Sages with their tremendous numbers.</p><br/><p>‘…Of course we received a lot more damage because we fought in that maze place.’</p><br/><p>Pektoril frowned as he thought of the past.</p><br/><p>Only 500.</p><br/><p>Hundreds of thousands of the Higher Races had died against 500 Sages.</p><br/><p>And even this would’ve been impossible if the Satellite Fortresses were working.</p><br/><p>Karioram made a wretched expression from Pektoril’s words.</p><br/><p>This was not a revolution or a glorious battle.</p><br/><p>It was merely pets, who were trapped, escaping when the cage got loosened and biting apart their owner.</p><br/><p>When the owner had been extremely ill with a disease.</p><br/><p>Karioram suddenly asked Pektoril.</p><br/><p>“Why did they disappear?”</p><br/><p>If they were going to disappear then they all should’ve.</p><br/><p>Why did the small number remain?</p><br/><p>Pektoril shrugged his shoulders.</p><br/><p>“I don’t know why. It was too sudden. There was no corpse but… We have no way of knowing. The ones who lived didn’t speak either.”</p><br/><p>Karioram asked a final question towards Pektoril then.</p><br/><p>“Then why did we leave these damned machineries intact? We should’ve destroyed them.”</p><br/><p>Pektoril pointed towards the front as he spoke.</p><br/><p>“Because there’s something important.”</p><br/><p>“What?”</p><br/><p>“You’ll figure it out after we get there.”</p><br/><p>But Pektoril suddenly stopped as he pointed towards the end of the tunnel.</p><br/><p>‘Smell of blood.’</p><br/><p>Pektoril hurriedly approached the entrance and entered the area.</p><br/><p>And could not speak from the scene.</p><br/><p>‘…Arukons.’</p><br/><p>Countless corpses of Arukons.</p><br/><p>And a giant wolf was lying against the wall of this giant area.</p><br/><p>“Dakemeia…”</p><br/><p>Pektoril exclaimed out heavily as he saw this.</p><br/><p>The Arukon’s king who had fought the most valiantly out of everyone when they escaped this place.</p><br/><p>Pektoril frowned as he looked at Dakemeia lying on the ground with a dull expression.</p><br/><p>Since large words were written on the wall behind where Dakemeia was lying.</p><br/><p>[It’s a present. I hope you treat it well.] ‘It’s that Metiron’s handwriting. And what does he mean treat it well.’</p><br/><p>Pektoril carefully approached Dakemeia and then made a confused expression after finding something glinting inside his mouth.</p><br/><p>“This is…?”</p><br/><p>Pektoril lifted up the extremely small black ring that was within Dakemeia’s mouth.</p><br/><p>……………………………………………….</p><br/><p>‘Found it.’</p><br/><p>Hansoo, who had followed Pektoril in underground, went to a different room and found a small red orb as he mumbled.</p><br/><p>And the small red orb in his hand started to vibrate toward the direction of its paired item, the Destruction Jade.</p><br/>\n</div>"}