{"title": "Chapter 195 : Pektoril (4)", "id": 195, "volume": 2, "url": "http://boxnovel.org/reincarnator-chapter-195-pektoril-4", "volume_title": "Volume 2", "body": "<h1>Chapter 195 : Pektoril (4)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 195 : Pektoril (4)</p><br/><p>“Come at me!”</p><br/><p>Kwadududuk!</p><br/><p>Kalipso blinked his eyes as if he couldn’t believe the sight of a human massacring the members of his race.</p><br/><p>There was no other nightmare like this.</p><br/><p>The bugs with weak bodies and trash-like consciousness.</p><br/><p>The only strong point they had was having more numbers than the Rebeloongs.</p><br/><p>They didn’t have a civilization and they roamed around the world with their bodies alone.</p><br/><p>This was the humans he knew.</p><br/><p>‘Is he a mutant that only looks similar?’</p><br/><p>Kalipso muttered inwardly.</p><br/><p>Boom!</p><br/><p>Kwaddduduk!</p><br/><p>Crunch!</p><br/><p>He knew it made no sense but seeing the crazy bastard in the distance, it actually felt quite reasonable.</p><br/><p>That guy wasn’t tiring out and he was actually killing and chasing the members of his race even faster now.</p><br/><p>And once they felt danger, their habits of communal lifestyles surfaced as they were slowly gathering around him as if they weren’t embarrassed about this at all.</p><br/><p>He had to decide quickly.</p><br/><p>As to how to deal with that nightmare.</p><br/><p>‘Shall we kill him by charging at him all together? Or… Split up and stall for time until the Satellite Fortress comes back?’</p><br/><p>Kalipso stopped as he thought of these two things.</p><br/><p>What the hell was he thinking?</p><br/><p>His pride will get damaged and the Akalachias were watching him as well.</p><br/><p>That little demon wasn’t the only issue.</p><br/><p>Once they split up then the giant Akalachias will hunt his race down one by one.</p><br/><p>Kalipso woke up.</p><br/><p>He could not let that happen.</p><br/><p>‘I need to reduce the damage as much as I can.’</p><br/><p>And he still had a very useful card to play.</p><br/><p>Kalipso finished his thoughts and shouted.</p><br/><p>“Humans! Hear me! Kill that guy!”</p><br/><p>At those words everyone including the ones fighting and the ones who had run away flinched.</p><br/><p>To jump in there?</p><br/><p>That was a person who was massacring the Rebeloongs that they couldn’t even handle.</p><br/><p>A person who massacred the Higher Race the way the Higher Race massacred them.</p><br/><p>How the hell would they go up against such a monster?</p><br/><p>Actually, they didn’t even understand why they had to attack such a person.</p><br/><p>To attack a person who was fighting for them, fighting instead of them.</p><br/><p>And they could clearly see the massacre in front of their eyes.</p><br/><p>Boom! Boooom!</p><br/><p>The fear of the Higher Races that had rooted deep within their minds were trying to make their footsteps move but the reality in front of their eyes stopped them.</p><br/><p>As the people only fumbled around and refused to go out Kalipso was enraged as he started to grind his teeth.</p><br/><p>‘These cheeky bastards.’</p><br/><p>The fear that they felt towards him and the other Higher Races that they had implanted over decades were pushing them.</p><br/><p>Usually they would tremble in fear and run out but now they were fumbling about and could not walk out.</p><br/><p>This is all because the Rebeloong’s pride and might had been crushed apart.</p><br/><p>This was why he needed to kill that demon as soon as possible.</p><br/><p>It made sense that the humans should deal with this since a human was causing all of this.</p><br/><p>Kalipso finished his thoughts as he shouted towards the humans who were fumbling around.</p><br/><p>“Look at these bugs! Move! You think that guy will win in the end? Hahaha! Wake up!”</p><br/><p>“Ugh…”</p><br/><p>The people looked between Kalipso and the guy fighting in the distance as they clenched their teeth.</p><br/><p>Those words were right.</p><br/><p>That guy was extremely strong.</p><br/><p>To the point where him being a human sounded wrong.</p><br/><p>But that was it.</p><br/><p>His strength was respectable and his might had reached the pinnacle but the Rebeloongs and the Higher Races were a mountain that they could not cross.</p><br/><p>‘Fucking bastard…’</p><br/><p>The people were lost in thought with an expression of utter despair.</p><br/><p>For the Rebeloongs to try to make them go out in front despite their strength.</p><br/><p>In order to live a day longer they needed follow the words of their enemy to attack the one fighting for them.</p><br/><p>The words of the guys who were killing them with their fingers just because they felt a little annoyed just then.</p><br/><p>At that moment.</p><br/><p>Crunch.</p><br/><p>Hansoo smashed another Rebeloong’s head and then glared at Kalipso in the distance.</p><br/><p>At the same time.</p><br/><p>Kwaddddddddkkkkdkdk.</p><br/><p>The muscles on his entire body twisted and turned and made strange noises.</p><br/><p>All the way from the tip of his toes, up his thigh and up to his abs.</p><br/><p>And the moment the tension built up to the brim.</p><br/><p>Booooom!</p><br/><p>Hansoo flew into the air like a bolt of lightning.</p><br/><p>Towards Kalipso in the distance.</p><br/><p>A lot of scenes entered Hansoo’s eyes.</p><br/><p>Pektoril, staring at him expressionlessly, and Kalipso who was backing away.</p><br/><p>The Rebeloongs gathering around that Kalipso.</p><br/><p>And the adventurers who were confused as to what they should actually do.</p><br/><p>Hansoo thought of the conversation he had with Eres in the past.</p><br/><p>Eres added another sentence after that.</p><br/><p>‘Fucking Eres, what a bitch. It’s a dark part of my history.’</p><br/><p>Hansoo chuckled.</p><br/><p>The past, a long time ago.</p><br/><p>Decades and decades ago.</p><br/><p>A story from when the Otherworld got entangled with the Abyss and the whole world was collapsing.</p><br/><p>‘Save these guys?’</p><br/><p>Hansoo shook his head and then started to fall down onto the ground.</p><br/><p>Towards Kalipso.</p><br/><p>Booooom!</p><br/><p>‘Fuck!’</p><br/><p>Kalipso, who was extremely tense and focused, lifted up his front teeth and the golden spear from the Akalachia he had killed, formed an X in front of him and blocked the attack of Hansoo.</p><br/><p>Kwaaaadddduduk</p><br/><p>The front teeth and the golden spear collided with the Forked Lightning and created a huge noise.</p><br/><p>Kududududuk</p><br/><p>“Ugh…”</p><br/><p>Kalipso barely blocked the Forked Lightning from Hansoo and shouted towards the Rebeloongs around him.</p><br/><p>“What the hell are you doing! Charge!”</p><br/><p>The nearby Rebeloongs made fierce expressions from those words.</p><br/><p>They were originally a race who moved in swarms.</p><br/><p>As long as he was in here, only death awaited him.</p><br/><p>“Roaaarrr!”</p><br/><p>Tens of Rebeloongs charged towards Hansoo with their front teeths held up high.</p><br/><p>Booom! Booom! Booom! Booom!</p><br/><p>In the middle of the 4m tall black walls closing in.</p><br/><p>Hansoo’s Forked Lightning and fist, covered by the Thousand Soldiers Armor, flew around the air toward these Rebeloongs.</p><br/><p>Crunch</p><br/><p>Smash!</p><br/><p>Hansoo smashed apart the tide of rats charging towards as he looked around.</p><br/><p>Those who had been oppressed by the Higher Race for decades.</p><br/><p>And those who still wouldn’t be able to escape the shadows of the Higher Race.</p><br/><p>He had no intentions to save these people.</p><br/><p>Why should he help?</p><br/><p>If one doesn’t help oneself and doesn’t struggle to survive then nobody would save them.</p><br/><p>They can’t fight because the Higher Races look like gods?</p><br/><p>The thing he needed were humans who can even go against those gods.</p><br/><p>‘Save yourselves.’</p><br/><p>Crunch!</p><br/><p>Hansoo shouted out loudly after smashing Kalipso with his fist.</p><br/><p>Booooom!</p><br/><p>“Look at the ones in front of your eyes! Do they look like gods to you!?”</p><br/><p>Whoooosh.</p><br/><p>Everyone looked towards the Rebeloongs in front of their eyes from those words.</p><br/><p>The giant rat people who had yet to gather around Kalipso because they had been spread out.</p><br/><p>The people made vicious and enraged expressions towards the Rebeloongs but still flinched as the Rebeloongs stared back.</p><br/><p>Expressions of rage.</p><br/><p>The fear that had rooted deep within their bones made the adventurers flinch.</p><br/><p>But at the same time.</p><br/><p>They realized something.</p><br/><p>‘I’ve never…Seen such an expression before.’</p><br/><p>Chen mumbled quietly.</p><br/><p>Those guys always laughed at them and made fun of them.</p><br/><p>So they had only seen the Higher Races laughing.</p><br/><p>What an expression.</p><br/><p>It looked like…</p><br/><p>‘They’re feeling fear.’</p><br/><p>As the expressions of the people turned strange.</p><br/><p>Booooom!</p><br/><p>A huge noise exploded out from the distance.</p><br/><p>At the same time.</p><br/><p>Puushuk!</p><br/><p>Something rose high up into the skies.</p><br/><p>The eyes that were glaring at the Rebeloongs moved towards the object.</p><br/><p>A head of a familiar lifeform.</p><br/><p>“Kalipso…”</p><br/><p>The godlike existence was looking down at them.</p><br/><p>With only its head.</p><br/><p>The moment the loud sound of a collision and a strange quietness afterwards swept past the adventurers and the Rebeloongs.</p><br/><p>The reality started to slowly enter the people’s eyes.</p><br/><p>Rebeloong’s bodies which had been damaged by the fight against Akalachias and their mentality that had been smashed apart by Hansoo’s massacre.</p><br/><p>A Rebeloong kicked angrily after seeing the people mumbling and whispering to each other.</p><br/><p>“These bastards are insane huh?!’</p><br/><p>Booom!</p><br/><p>“Kuuhuk!”</p><br/><p>Two people’s bones got smashed apart as they flew into the skies.</p><br/><p>“No! Rebecca! Fucking hell!”</p><br/><p>Angelina looked at a comrade from her area flying away with broken bones and then turned to glare at the Rebeloong with rage.</p><br/><p>‘This fucking rat.’</p><br/><p>Actually, everyone else started to glare at the Rebeloong.</p><br/><p>And the Rebeloong’s body came into their eyes.</p><br/><p>They could see the reality.</p><br/><p>A giant damaged beast that only believed in its size and strength.</p><br/><p>They didn’t have any skills compared to the man who was fighting crazily in the distance and their movements were dull.</p><br/><p>The people’s expressions froze as another emotion replaced the fear in their eyes.</p><br/><p>‘This fucking rat.’</p><br/><p>Angelina looked at the short sword in her hand.</p><br/><p>The blade which she had swung against other humans.</p><br/><p>She clenched the handle.</p><br/><p>At the same time she looked towards the man who was causing a storm of a massacre in the distance.</p><br/><p>A man who had fell from the skies onto this hell like Birdcage and had flipped everything upside down.</p><br/><p>The one who was massacring the Rebeloongs was a human.</p><br/><p>And they were humans as well.</p><br/><p>Humans who had been blessed by runes and had been armed with Artifacts.</p><br/><p>Then.</p><br/><p>Boooom!</p><br/><p>Angelina clenched the handle in her hands tightly as she exploded out from her spot.</p><br/><p>Towards the Rebeloong who had kicked her comrade.</p><br/><p>“You fucking rat! Let’s go!”</p><br/><p>The moment the leader of the 23rd area, Angelina, jumped in.</p><br/><p>Booooom!</p><br/><p>“Fucking bastards! Try killing us!”</p><br/><p>“Fucking cunts!”</p><br/><p>As if an ember had fallen onto a pile of gunpowder, the adventurers started to charge towards the Rebeloongs from all around.</p><br/><p>With Angelina as the start, everyone surrounding the Rebeloongs started to gather in like hails and slashed away at the Rebeloong.</p><br/><p>Like iron dust flying towards a magnet.</p><br/><p>“Kyaaaaaak! Damned bugs!”</p><br/><p>The Rebeloongs flinched but then started to swing their front teeth.</p><br/><p>Soon a giant collision between the humans and the Rebeloongs occurred.</p><br/><p>Boooom!</p><br/><p>Boom!</p><br/><p>Kuuududuk!</p><br/><p>The sounds of skin being ripped and bones breaking filled the air and rang throughout the ground.</p><br/><p>Sounds of humans being smashed apart and flying away.</p><br/><p>But the humans charged towards the Rebeloongs even more viciously.</p><br/><p>As if they were trying to relieve all the enmity and pain they had felt until now.</p><br/><p>“Kuuhuk!”</p><br/><p>“Fuck!”</p><br/><p>The roars of confusion and pain started to ring out from the Rebeloongs due to the attacks of the adventurers.</p><br/><p>There were simply too many.</p><br/><p>The humans numbered at least hundreds of times more than them.</p><br/><p>“Uaaaaa!”</p><br/><p>“Fucking bastard! Die!”</p><br/><p>Everyone climbed up and slashed down.</p><br/><p>If they didn’t have weapons then they used their body weight to drag them down as the people below cut through the skin and stabbed their muscles.</p><br/><p>‘Oh my god…’</p><br/><p>The Rebeloong’s 2nd in command, Kallum, was shocked at this scene.</p><br/><p>There was a maniac in the middle causing a massacre and terrifying bugs were charging towards them from all around.</p><br/><p>‘Is this a dream.’</p><br/><p>Kallum shook his head and then focused on the reality.</p><br/><p>Kallum shouted towards the leader of the Akalachias, Pektoril, in the distance.</p><br/><p>“Pektoril! Help us! We need to combine our forces!”</p><br/><p>“Hmmm.”</p><br/><p>Pektoril just shrugged his shoulders at those words.</p><br/><p>Actually the Akalachias were feeling quite laid back.</p><br/><p>Though the humans were going crazy, their targets were focused on the Rebeloongs who were large in number and were still quite strong.</p><br/><p>They wouldn’t die right away just because a few people charged in.</p><br/><p>Kallum clenched his teeth at Pektoril’s attitude and then shouted out again.</p><br/><p>“There’s a word you like right?! Repay your debts! Have you forgotten that you have escaped the fate of the Sage’s experiments thanks to our ancestors? Have you forgotten that us the Rebeloongs had planned it all out?”</p><br/><p>“…”</p><br/><p>Pektoril stopped.</p><br/><p>Kallum shouted towards Pektoril again.</p><br/><p>“Wasn’t the reason why we left behind his giant fucking research lab because we didn’t want to forget about those times! Do you want to go back to those days? Help us! And kill these bastards!”</p><br/><p>A story from hundreds of years ago.</p><br/><p>A dark history.</p><br/><p>Pektoril’s expression turned grim from those words.</p><br/>\n</div>"}