{"title": "Chapter 199 : The Plan (1)", "id": 199, "volume": 2, "url": "http://boxnovel.org/reincarnator-chapter-199-the-plan-1", "volume_title": "Volume 2", "body": "<h1>Chapter 199 : The Plan (1)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 199 : The Plan (1)</p><br/><p>“What the…Why are these guys here.”</p><br/><p>Pektoril made an expression of despair while looking around.</p><br/><p>He had always been curious even after winning.</p><br/><p>As to where the Sages, who had ruled over the world, had gone to.</p><br/><p>They had even left behind their advanced technology and powerful Satellite Fortresses behind.</p><br/><p>Except a few.</p><br/><p>This was why he and the others always felt a bit off even after the victory.</p><br/><p>Since they, who wouldn’t have been able to win normally, had won because of an abnormal reason.</p><br/><p>And because of this they continuously followed the traces of the Sages.</p><br/><p>Since they might be in danger as well if the Sages had left because this world had an issue.</p><br/><p>The Sages in their heads were an existence like that.</p><br/><p>God-like existences who didn’t act without a reason and always succeeded if they had a goal.</p><br/><p>They were afraid as to when the Sages would come back so they continuously chased after their path but for them to have been this close to them.</p><br/><p>‘This was why the ones who survived didn’t speak.’</p><br/><p>Pektoril mumbled as he thought of the small amount of Sages whom they had interrogated in order to find out what happened to the rest.</p><br/><p>This was why those guys hadn’t spoken.</p><br/><p>Since these guys were the survivor’s family and comrades.</p><br/><p>They were probably afraid of the fact that if the Higher Races knew that the Sages were this close then they would do anything they needed to in order to find and destroy this place.</p><br/><p>‘But why are these guys in hibernation… Was there an epidemic? There weren’t any traces of such things on the survivors back then.’</p><br/><p>Pektoril made a confused expression while walking through the giant room where hundreds of thousands of people were asleep as if they were dead.</p><br/><p>This wasn’t the only thing he was curious about.</p><br/><p>Since he needed to figure out what Metiron had done after he entered this place.</p><br/><p>He might’ve escaped with something incredibly precious.</p><br/><p>At that moment something was caught in Pektoril’s eyes.</p><br/><p>A gem that was shining bright red.</p><br/><p>At the end of the collider where hundreds of thousands of containers were laid on, a bright gem was embedded on the wall.</p><br/><p>‘What is that?’</p><br/><p>The size of the gem was small but the size of the machine that the gem was embedded in was actually very big.</p><br/><p>As if it was devouring the light coming out from the bright gem, the complex circuits that extended away from the gem as the center were sending the bright light towards the hundreds of thousands of containers where the Sages were hibernating in.</p><br/><p>Like an energy of life that was supporting the ones who had fallen into slumber.</p><br/><p>The moment Pektoril started to head towards the gem with a curious expression.</p><br/><p>Booooom!</p><br/><p>A loud sound was heard behind him.</p><br/><p>‘….?’</p><br/><p>Pektoril turned around to see if his comrades had followed him but a smirk appeared on his face instead.</p><br/><p>Pektoril spoke towards the human who has jumped down.</p><br/><p>“How resilient. For what do you struggle this much for?”</p><br/><p>This guy was dead anyway.</p><br/><p>The story might’ve been different if the Destruction Jade was still activated but as long as the jade was in his hands and it stopped working, this puny human wouldn’t be able to do anything to him who had the protection of the Satellite Fortress.</p><br/><p>‘Well, maybe not…’</p><br/><p>Pektoril frowned as he looked at the tremendous amount of mana flowing through the guy in the distance.</p><br/><p>Something with that much battle strength, that much mana and that much power to generate such a force was not something that could be ignored.</p><br/><p>It might’ve been different for others but for the Akalachias, who often hunted the humans in order to keep their battle instincts sharp, knew.</p><br/><p>That the thing making that guy being hard to deal with was not his physical abilities but a trick with a skill.</p><br/><p>And since someone of his caliber wouldn’t have some random skill, it would actually be quite threatening.</p><br/><p>‘Well. I’ll still win anyway.’</p><br/><p>It was good.</p><br/><p>Since it would’ve become much more tiring if that guy ran away with the Red Jade.</p><br/><p>‘I shall kill you here.’</p><br/><p>The moment Pektoril made up this decision.</p><br/><p>Booooom!</p><br/><p>Hansoo flew across the distance and closed in on Pektoril.</p><br/><p>Whoooosh!</p><br/><p>A giant spear that was over 10m long and shining brightly flew towards Hansoo.</p><br/><p>At that moment.</p><br/><p>Boooom!</p><br/><p>The golden spear in Hansoo’s hand, the Forked Lightning, and Pektoril’s spear clashed with each other as the room they were in trembled from the aftershock.</p><br/><p>But the result was clear.</p><br/><p>Booooom!</p><br/><p>Hansoo’s body couldn’t withstand the tremendous amount of force behind the giant spear and was flung into the air.</p><br/><p>Even before the force of the two sides, this was actually a difference in mass.</p><br/><p>Even the tip of Pektoril’s spearhead was heavier than Hansoo.</p><br/><p>Pektoril, who had smashed away Hansoo with a mass hundreds of times heavier, frowned as he felt the tingling sensation on the tip of his fingers.</p><br/><p>Hansoo being flung away was quite normal but the amount of force he felt in his fingers was too underwhelming.</p><br/><p>This was too weak for Hansoo.</p><br/><p>‘Did he fling his body backwards or something.’</p><br/><p>Chwaaaak!</p><br/><p>Hansoo, who had been flung into the air, looked at his cracked armor, the Thousand Soldiers Armor.</p><br/><p>Despite having eaten the spear of a dead Akalachia on the way and having been protected by Hansoo’s Demonic Dragon’s Reinforcement it still received quite a large amount of damage.</p><br/><p>It was a destructive force that came from strength and mass combined.</p><br/><p>Booooom!</p><br/><p>Pektoril’s attacks, which didn’t seem like it wanted to give any break to Hansoo, had a qualitative differences from the Rebeloongs or other Akalachias who focused on brute strength.</p><br/><p>Hansoo judged that the golden spear would be hard to dodge from its trajectory as he chucked the Forked Lighting as the same time he took on Pektoril’s spear with his body.</p><br/><p>Kwadududuk!</p><br/><p>The pillar-like spear that was surrounded by the mana barrier from the Satellite Fortress cut through Hansoo’s Demonic Dragon’s Reinforcement as it smashed onto Hansoo’s Thousand Soldeirs Armor and Dragon Essence Blade.</p><br/><p>At the same time.</p><br/><p>Crunch!</p><br/><p>The Forked Lightning that shot out from Hansoo’s hand assaulted the area near Pektoril’s heart.</p><br/><p>Kudududuk</p><br/><p>The Forked Lightning, which had the mana nullification applied on it, penetrated through the mana barrier around Pektoril and dug into his golden feathers.</p><br/><p>As it had penetrated through the Judge’s armor in the past.</p><br/><p>Sway.</p><br/><p>‘Hmm.’</p><br/><p>Pektoril frowned as he felt the strange mana digging into his body and disrupting his five senses.</p><br/><p>But if he was going to get dealt with with just this much then it would’ve been better for him to just commit suicide.</p><br/><p>‘And…I’ve gone through things like this plenty of times when I was being experimented on by the Sages in the past!’</p><br/><p>Booooom!</p><br/><p>Pektoril spun his foot around, stomped down onto the ground with it and then swung his spear in a wide arc.</p><br/><p>Whoooosh!</p><br/><p>The 5m large Judge and Pektoril in front of Hansoo’s eyes were vastly different in size.</p><br/><p>The 10m spear being swung was more than enough to prevent him from getting near Pektoril.</p><br/><p>Crunch! Crunch! Clang!</p><br/><p>Tens of the glass containers got destroyed by the swing of the spear.</p><br/><p>The bodies of the Sages that had been protected by the blue light had been swept by the afters wing and had been turned into meat pastes.</p><br/><p>A very tragic death after having been carefully protected for hundreds of years.</p><br/><p>Hansoo, who had been charging in, suddenly backed off as he mumbled.</p><br/><p>‘So, he lived for hundreds of years huh.’</p><br/><p>Pektoril had only swung his spear once, quickly adapted to the sudden changes of his senses and recovered himself.</p><br/><p>He was different from the others from before.</p><br/><p>Someone who had lived in the jungle and had constantly polished and sharpened themselves after their fight with the Sages.</p><br/><p>Pektoril laughed out loud towards Hansoo.</p><br/><p>“Hahahaha! Don’t you feel sad? Aren’t these the ones who have given you the power?”</p><br/><p>He was understanding that guy’s identity bit by bit.</p><br/><p>He knew too much for a bug.</p><br/><p>That guy had definitely received some legacy or inheritance from the Sages who had ran away.</p><br/><p>Pektoril’s feathers rang as he looked at the Red Jade in his hands.</p><br/><p>‘You… Don’t have the rights to use that. Only us, the Higher Races, have the right to.’</p><br/><p>Pektoril then looked around his surroundings with his somewhat adapted vision.</p><br/><p>Corpses which had been smashed apart into meat pastes.</p><br/><p>‘Keheh. Kehehehehehe.’</p><br/><p>This stimulated the sadistic nature deep within Pektoril’s mind.</p><br/><p>The fact that the Sages had disappeared without reason had always pressured him.</p><br/><p>But look at this!</p><br/><p>For them to have been here all along living the life of frozen foods.</p><br/><p>Tens of Sages, whom could threaten his entire race with only 500 of them, had been killed by his single swing.</p><br/><p>‘Isn’t this a bit too sad for someone who wielded such a tremendous amount of power?! Haha!’</p><br/><p>Pektoril smiled.</p><br/><p>Even if one had a tremendous amount of mana and technology, there was a limit to the weak bodies.</p><br/><p>Just like the Akion.</p><br/><p>A vastly different amount of strength was shown because they were using it and not the Sages.</p><br/><p>‘This is just the beginning.’</p><br/><p>Pektoril mumbled in happiness from his vision of the future.</p><br/><p>If this world got united under his feet then there wouldn’t be useless fights and struggles anymore.</p><br/><p>The Higher Races who had powerful bodies would be able to use the Sage’s technologies more efficiently.</p><br/><p>They wouldn’t be using the leftover technology of the Sages but improve it and create a new civilization for themselves.</p><br/><p>Pektoril smiled as he looked at the ring in his hand and then put it back on his hand.</p><br/><p>“You probably want this but…Keke. It seems you don’t have the powers to take it from me. It seems like a set pair anyway, how about giving it to me now? I’ll let you live at elast.”</p><br/><p>Pektoril’s words weren’t empty words actually.</p><br/><p>He was willing to let the bug live since today was a historically celebratory date.</p><br/><p>Though he would have to live as his personal pet inside the Birdcage for all eternity.</p><br/><p>‘And…I will slowly figure out why the Sages have decided to go into cryo-sleep in his location.’</p><br/><p>He wanted to ask the bug but it seemed like he didn’t know either.</p><br/><p>Which meant that there was nothing else he was curious about.</p><br/><p>“Sure”</p><br/><p>“What?”</p><br/><p>Pektoril flinched at the unexpected answer.</p><br/><p>Though he had thrown the words at him, he had never expected Hansoo to agree so he was actually preparing to smash him apart.</p><br/><p>But for such a reply to come back.</p><br/><p>The moment Pektoril flinched.</p><br/><p>Kuurururuk</p><br/><p>Something started to intensely grow out from where the Forked Lightning had penetrated into.</p><br/><p>Crunch</p><br/><p>Kwadduk.</p><br/><p>“What the…!”</p><br/><p>Pektoril was shocked at the strange things growing all over his body and tying him down as he tried to snap them with brute force.</p><br/><p>‘Just this?!’</p><br/><p>With his strength, this amount of sludge could easily be broken apart.</p><br/><p>But unlike Pektoril’s expectations, his body hadn’t fully calibrated yet.</p><br/><p>In the short moment where Pektoril stopped due to his muscles and nerves acting separately from each other, the Pandemic Blade which had eaten up Hansoo’s entire mana pool grew and covered Pektoril’s entire body.</p><br/><p>The moment Pektoril’s movements stopped completely from these two things.</p><br/><p>“Catch it. Well.”</p><br/><p>Whooosh!</p><br/><p>Hansoo chucked the Red Jade in his hand.</p><br/><p>Towards the black jade in his hand, the Destruction jade.</p><br/><p>“Arrrgh!”</p><br/><p>Pektoril sensed something amiss and tried to move his hand away but the speed of the Red Jade Hansoo threw was like a beam of light.</p><br/><p>The moment Pektoril tried to move, the Red Jade had already moved up to the Destruction jade.</p><br/><p>Then</p><br/><p>Clang!</p><br/><p>Powerful tools which showed their true prowess when together but had to be split in two because of their tremendous power.</p><br/><p>The Red Jade and the Destruction Jade smashed with each other with a clang and started to swirl and combine with each other.</p><br/><p>While making a extremely ominous dark and bloody yin yang symbol.</p><br/><p>……………………………………….</p><br/><p>“Oh. Has it started.”</p><br/><p>Metiron, who had been running away, suddenly smiled.</p><br/>\n</div>"}