{"title": "Chapter 202 : Transference (2)", "id": 202, "volume": 3, "url": "http://boxnovel.org/reincarnator-chapter-202-transference-2", "volume_title": "Volume 3", "body": "<h1>Chapter 202 : Transference (2)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 202 : Transference (2)</p><br/><p>The giant basin near the Birdcage, the Akran.</p><br/><p>Hundreds of thousands of people had been gathered in the giant basin.</p><br/><p>But this was just the beginning.</p><br/><p>The people who were in the villages were gathering here constantly.</p><br/><p>To the location which will become the new city of the humans.</p><br/><p>Because it was at the center of the Green Road, it was the best place to be in terms of location and because there were a variety of beasts around this location it was also a great place to hunt.</p><br/><p>The Satellite Fortresses that threatened the humans had disappeared and this land should’ve become the humans’.</p><br/><p>Well, it what was supposed to happen.</p><br/><p>“Damn…”</p><br/><p>Kulkin, one of the adventurers who had gathered at the Akran along with others, grinded his teeth at the Higher Race he could see in the distance.</p><br/><p>The humans had won.</p><br/><p>The Satellite Fortresses had fallenfell due to unknown reasons and the Higher Races weren’t invincible existences since there wasn’t any mana.</p><br/><p>Since a god who has fallen to the ground wasn’t fit to be called a god anymore.</p><br/><p>No, they had to kill them while they were on the ground.</p><br/><p>This current situation was all because there was no mana.</p><br/><p>Why were they just watching this situation?</p><br/><p>‘And even with such people like this.’</p><br/><p>If they didn’t have strength the story would be different but it wasn’t like that they didn’t have any strength.</p><br/><p>Since the newcomers weren’t like newbies at all.</p><br/><p>They all had monstrous bodies, unfitting to be called humans like himself.</p><br/><p>The ones who were here before were stronger right now because there was still a gap due to the runes but it wouldn’t take long to catch up.</p><br/><p>Since it wouldn’t take that long to fill up their runes by hunting with such bodies.</p><br/><p>‘I don’t know how he brought such guys here but if we fight alongside them… We might be able to win.’</p><br/><p>Kulkin looked at the tremendous amount of forces behind him and made a sad expression.</p><br/><p>‘Morris… I need to avenge you…’</p><br/><p>The image of his friend being ripped apart in front of his eyes was still vivid in his head.</p><br/><p>Kulkin clenched his teeth as he remembered his friend’s expression which was staring at him desperately until the end.</p><br/><p>……………………………………………</p><br/><p>“It’s been a while Hansoo”.</p><br/><p>“Mmm.”</p><br/><p>Hansoo made a smile as he looked at the faces he hadn’t seen in awhile.</p><br/><p>It was nice seeing these faces after such a long time.</p><br/><p>Enbi Arin, Sofia, Mihee and other familiar faces that he had left behind in the zone below could be seen.</p><br/><p>The owner of the new Crown of Thorns and the second soul fragment, Gwanje, couldn’t come up because he had to control the people below but the others had gotten Hansoo’s signal through Gwanje and had come up.</p><br/><p>And countless people had split up and were constructing the city.</p><br/><p>The villages were now a dark part of their history.</p><br/><p>They needed a new city befitting of this new zone.</p><br/><p>Though they were only building one, they would build more as time went on.</p><br/><p>‘It wouldn’t take long.’</p><br/><p>Hansoo mumbled as he watched the process from afar.</p><br/><p>Though they didn’t have any tools it didn’t matter.</p><br/><p>Since their bodies were much more different.</p><br/><p>Kwadudududuk!</p><br/><p>Ududududuk!</p><br/><p>Snapping trees and cutting rocks.</p><br/><p>With strength that didn’t seem like that of a human.</p><br/><p>Even without mana, these people didn’t lose out to the original Yellow Zone’s people and actually were doing even better.</p><br/><p>A tremendously powerful body.</p><br/><p>This was all because of the Body Enhancement Surgery they received in the second zone.</p><br/><p>These people didn’t lose out to Hansoo in terms of their body.</p><br/><p>There were tens of thousands of such people.</p><br/><p>And Mihee, who had brought these people up, made a proud expression.</p><br/><p>If this was the real world then she was at a level she couldn’t even have imagined.</p><br/><p>The amount of burden and responsibilities on her shoulders was much larger but seeing such powerful adventurers, she could feel her past struggles and hardships being washed away.</p><br/><p>‘I’ve seen Hansoo after so long as well. Anyways, it’s so hard to see his damn face.’</p><br/><p>Mihee looked at Hansoo with an upset expression.</p><br/><p>She had imagined that they would always be together because they were with each other during the Tutorial.</p><br/><p>But Hansoo was busy beyond her imagination.</p><br/><p>To the point of being hard to chase him.</p><br/><p>‘Well, I didn’t even think things would happen like this.’</p><br/><p>Thinking of her college days of the past, she started to giggle.</p><br/><p>And Hansoo laughed while looking at Mihee.</p><br/><p>Though he had become a person who was quite unresponsive to most things while fighting in the Abyss, he was still human.</p><br/><p>Since the hard work of the Yellow Zone had been completed well, he naturally felt good.</p><br/><p>A rare smile appeared on Hansoo’s usually expressionless face.</p><br/><p>‘It seems Karhal found his sibling.’</p><br/><p>Hansoo looked at Ekidu and Karhal who started to walk towards this location after controlling the people.</p><br/><p>Karhal, Ekidu and a few others were working hard to control the people of the Yellow Zone but Karhal looked as if such work was nothing and was continually smiling and laughing.</p><br/><p>To the point of making Hansoo feel content as well.</p><br/><p>‘Let’s work a bit harder. Everything’s going well.’</p><br/><p>Hansoo mumbled inwardly.</p><br/><p>He just needed to continue like this.</p><br/><p>If he continued like this and there weren’t any more problems from now on then humanity would gain a tremendous amount of power and wouldn’t get massacred once they entered the Abyss right away like they had in the past.</p><br/><p>Which means he would be able to prevent people precious to him from dying off.</p><br/><p>And him struggling and working a bit harder to achieve this would be fine.</p><br/><p>Since he had struggled for 50 years already anyway.</p><br/><p>Compared to his friends getting killed and ripped apart next to him, this was nothing.</p><br/><p>Though bodily injuries healed, the memories inside one’s head lasted.</p><br/><p>Hansoo thought up to this point and refocused.</p><br/><p>‘Not yet.’</p><br/><p>The Smile on Hansoo’s face disappeared.</p><br/><p>It wasn’t time to drop his guard yet.</p><br/><p>Though he had solved the problem, something unexpected happened.</p><br/><p>Suppress the Higher Races, who have gone berserk, one by one.</p><br/><p>A frontal clash would be hard but it wouldn’t be hard to kill them off while they fought each other.</p><br/><p>Then he would receive the method of creating the Mana Pool inside the human’s bodies and perform the surgery on all humans.</p><br/><p>But since the Sages had received the bodies of the Higher Races, things have become much more complex.</p><br/><p>They were smart, rational and knew how to work together.</p><br/><p>The Sages, who had been spread apart, understood the situation almost instantly even after sleeping for hundreds of years and had gathered into groups they had planned previously.</p><br/><p>The people with Rebeloong’s body conversed with each other and the Arukons surveyed the surroundings.</p><br/><p>And the Akalachias stood above them all and controlled them.</p><br/><p>If they fought then it would just be a huge disaster.</p><br/><p>There were hundreds of thousands of Higher Races who could handle hundreds of humans per member.</p><br/><p>Though they would win because the ones with Body Enhancement Surgeries had come with them as well but they would still gain a huge amount of casualties.</p><br/><p>He hadn’t raised them to lose them in a place like this.</p><br/><p>At that moment.</p><br/><p>A giant flag could be seen in the distance.</p><br/><p>‘It seems they want to speak now.’</p><br/><p>Hansoo spoke while looking at the Akalachia who was awkwardly swinging a piece of cloth tied to a huge log tens of meters long.</p><br/><p>“I’ll be back. Take care of this place.”</p><br/><p>“Uh… Huh?”</p><br/><p>Even before anybody could say anything, Hansoo quickly disappeared.</p><br/><p>And the place where Hansoo left was then filled with awkwardness where people started to slowly speak one by one.</p><br/><p>Since they would be together for a while anyway.</p><br/><p>The mingling of the previous members and newcomers was important.</p><br/><p>“Uh… Nice to meet you. I’m called Ekidu. Welcome to the Yellow Zone.”</p><br/><p>“…I’m Karhal. I hope things go well.”</p><br/><p>Karhal turned around and looked towards the location Hansoo had gone off to with a worried expression.</p><br/><p>The job he was assigned was actually much more important than just control.</p><br/><p>Though he was controlling them, their rage was slowly building up.</p><br/><p>Since the pain and struggle they had gone through for over a decade wouldn’t easily go away.</p><br/><p>There was no way their rage would disappear just because the ones who had killed their friends and family and even themselves started to laugh and make strange noises.</p><br/><p>Though they were barely suppressing their rage, it wouldn’t be weird for it to explode at any moment.</p><br/><p>‘Anyways, does he have no sense of fear? To jump into the enemy territory alone.’</p><br/><p>He pondered if he should follow Hansoo but shook his head.</p><br/><p>There’s nothing he’d be able to do anyway even if the situation blew up.</p><br/><p>It was better to just stay here and do his job.</p><br/><p>Karhal clenched his hands at his powerlessness as he looked towards the Higher Race’s camp Hansoo went towards.</p><br/><p>‘Fucking bird heads. Just try touching him.’</p><br/><p>Then there wouldn’t be any controlling or anything.</p><br/><p>He would just rile up the people behind him and attack first.</p><br/><p>This was why he needed to control them even more now.</p><br/><p>Before these people, who were roaring out in rage, caused something.</p><br/><p>‘Well, at least it’s much more easier now since these guys are helping us.’</p><br/><p>Karhal shook his head and then spoke towards the woman who had introduced herself as Mihee.</p><br/><p>“At least your side is better than us right? You should’ve prepared a bit before coming up.”</p><br/><p>But Mihee shook her head at those words.</p><br/><p>“It doesn’t seem like there’s much difference for us either.”</p><br/><p>“…?”</p><br/><p>“We just have hundreds of thousands of people.”</p><br/><p>‘And the power that suppressed them is now gone.’</p><br/><p>Karhal nervously looked at the countless newcomers behind Mihee at those words.</p><br/><p>…………………………………………..</p><br/><p>Boooom!</p><br/><p>Hansoo flew in from afar and landed in front of the Akalachias.</p><br/><p>Kel-Durin, the acting leader of the Sages, spoke towards Hansoo.</p><br/><p>“Greetings. To make things easier we shall call you humans as you have told us. Are you the king of those humans?”</p><br/><p>Hansoo shook his head.</p><br/><p>“We don’t really have such a system.”</p><br/><p>“Well. After hearing your story, those things weren’t something a king would do.”</p><br/><p>Kel-Durin, who had been busily gathering information, nodded.</p><br/><p>A king reigned from the back and stood above the others.</p><br/><p>But the man in front of his eyes was acting at the exact opposite location of where a king should be.</p><br/><p>He fought at the frontmost locations, the roughest and the lowest places.</p><br/><p>The most vicious and dangerous places.</p><br/><p>There was a reason why this man was worthy of his respect.</p><br/><p>‘If it were the days back when we were Sages then I would’ve used him very well.’</p><br/><p>Kel-Durin looked at the human in front of him with a regrettable expression.</p><br/><p>A good king was important during times of peace but during times of war, the most important things were good generals and soldiers.</p><br/><p>And the man in front of his eyes had more than enough qualifications.</p><br/><p>If he had been born as a Sage, no even if he wasn’t a sage, he would’ve risen to the highest point.</p><br/><p>Up to the position of the Great General who stood next to the king.</p><br/><p>Hansoo ignored the Sage’s words and then spoke expressionlessly.</p><br/><p>“Let’s get to the main point. Let’s talk about what we shall do from now on.”</p><br/><p>“…Yes, the introductions were a bit too long. Let’s get to the point indeed. The thing you want from us the Mana Pool Surgery right?”</p><br/><p>Hansoo nodded at those words.</p><br/><p>Since it was the final objective he needed to accomplish in this world.</p><br/><p>Something that allowed them to use mana non-stop like monsters all day.</p><br/><p>Mana pool.</p><br/><p>Once it was planted inside the human’s bodies, then they would be able to have a much larger amount of mana and gain the upper hand.</p><br/><p>It was a bit too much to have as much mana as a Satellite Fortress but they would be able to utilize a much larger amount of mana, at least a few times more.</p><br/><p>Kel-Durin shrugged his shoulders at Hansoo’s words.</p><br/><p>“Not hard. There’s actually a system to plant the Mana Pool inside the body on every Satellite Fortress. Though there’s a lot of you…About three of them would be able to change your entire race. It would be even faster if we don’t use the Satellite Fortresses for anything else.”</p><br/><p>Hansoo made a surprised expression.</p><br/><p>Because it was faster than he had expected.</p><br/><p>“It seems it’s quite simple.”</p><br/><p>“It’s because we invested a lot of time and resources in order to shorten the surgery time after we invented it.”</p><br/><p>Hansoo then spoke the next thing on his mind while staring at Kel-Durin.</p><br/><p>“What do you want from now on?”</p><br/><p>There was no way he would say such things with no reason.</p><br/><p>He was doing his because there was something he wanted.</p><br/><p>Kel-Durin smiled towards Hansoo.</p><br/><p>“There’s something you must do for our plan. If you do this for us then we will provide you with the Satellite Fortresses and even tell you the Mana Pool Surgery method. If you accept our offer then we would become allies, though temporary.”</p><br/><p>Hansoo nodded and stared at Kel-Durin.</p><br/><p>Telling him to hurry and speak.</p><br/><p>But the thing that came out of Kel-Durin’s mouth was not something Hansoo had to do but more information.</p><br/><p>“Let me say something before that. You need to hear this if you want to gain the Mana Pool. Why we tried to gain stronger bodies.”</p><br/><p>“Wasn’t it because you just needed stronger bodies?”</p><br/><p>Kel-Durin scoffed and then pointed towards the fallen Satellite Fortresses.</p><br/><p>“With something like that? You think we’d need powerful bodies?”</p><br/><p>“Hmm.”</p><br/><p>“Strength was just a byproduct, we just made it well since we were going to anyway.”</p><br/><p>Hansoo nodded.</p><br/><p>A short thought was all he needed.</p><br/><p>A powerful body was not something necessary to them.</p><br/><p>Even more so not a reason for them to all go into cryo-sleep at the same time.</p><br/><p>‘It shouldn’t be something like a contagious disease or anything.’</p><br/><p>Kel-Durin spoke towards Hansoo.</p><br/>\n</div>"}