{"title": "Chapter 205 : Garmeia (3)", "id": 205, "volume": 3, "url": "http://boxnovel.org/reincarnator-chapter-205-garmeia-3", "volume_title": "Volume 3", "body": "<h1>Chapter 205 : Garmeia (3)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 205 : Garmeia (3)</p><br/><p>Kel-Durin sighed.</p><br/><p>‘Damned bastard. His goal was the Satellite Fortresses from the beginning. He was aiming for a chance to gain the method to control them. In the Zone below…There was probably a method similar to that.’</p><br/><p>A simple look was enough.</p><br/><p>The race over there was faithful to their emotions and were greedy so a vicious method was needed to control them.</p><br/><p>They couldn’t see.</p><br/><p>There was indeed an underlying system of hierarchy but it was not enough to control such a massive amount of people.</p><br/><p>Maybe in the real world but this place was like a battlefield to them.</p><br/><p>It was like the army to them.</p><br/><p>It was impossible to send an army to their death with some connections or charisma.</p><br/><p>They needed a method to control them but the fact that such an army like that came up here meant only one thing.</p><br/><p>That there was a powerful method of control below.</p><br/><p>Kel-Durin frowned as he looked at the humans in the distance.</p><br/><p>‘…He’s showing me this on purpose huh.’</p><br/><p>And he couldn’t not hand the Satellite Fortresses over.</p><br/><p>Since they were in a deadlock.</p><br/><p>Kel-Durin carefully asked just in case.</p><br/><p>“What if we cannot? The Satellite Fortresses are too precious to hand over. Especially half of them.”</p><br/><p>Hansoo smiled as he spoke.</p><br/><p>“I thought we were going to do our best to keep the alliance. I’m doing my best my holding them back. Even though an internal fight might occur. Since I am doing my best, you should as well.”</p><br/><p>Hansoo then pointed towards the human’s side.</p><br/><p>He knew that the anger of the people wouldn’t go away.</p><br/><p>As well as the fact that the ones who came up will cause trouble with this chance.</p><br/><p>It’s fine for now but internal fights would occur sooner or later.</p><br/><p>Kel-Durin sighed as he looked at Hansoo.</p><br/><p>‘No can do. It’s not like we can all die or anything…’</p><br/><p>Kel-Durin gulped at the sensation of a blade being under his chin.</p><br/><p>If they didn’t hand over the Satellite Fortress and hold on until the end?</p><br/><p>He will prepare another method to control the humans and kill all the Sages in order to erase every possible unexpected outcome.</p><br/><p>Even if he had to receive tremendous casualties.</p><br/><p>It wouldn’t be hard either.</p><br/><p>Since he would just need to release the enraged humans.</p><br/><p>He could just wipe the Sages off, take over the Satellite Fortresses and recover the mana.</p><br/><p>‘No can do. We need to compromise here.’</p><br/><p>Kel-Durin shook his head.</p><br/><p>Actually, handing over half the Satellite Fortresses was a good thing.</p><br/><p>They would definitely lose if they fought here.</p><br/><p>But splitting the Satellite Fortresses in half and returning the mana would create a deterrent for war.</p><br/><p>A best case scenario for the humans and Sages.</p><br/><p>Kel-Durin frowned for a bit and then spoke.</p><br/><p>“Okay fine. The remaining Satellite Fortresses, not counting the ones that haven’t been secured yet, total 212. We will give you 106, exactly half. Send 106 of your people and send them to us. I will tell you the methods.”</p><br/><p>“What about Garmeia?”</p><br/><p>Kel-Durin shook his head at Hansoo’s question.</p><br/><p>“We don’t know the whereabouts of Garmeia yet anyway. Since the King’s Fortress moves where it wants to anyway. It won’t take long to find it due to its size. We will talk about it after we finish up here.”</p><br/><p>“Sure.”</p><br/><p>Hansoo nodded as he laughed.</p><br/><p>…………………………………..</p><br/><p>‘Good. Good.’</p><br/><p>Kaltus smiled as he looked at the scene that was working out perfectly for him.</p><br/><p>The people of the Yellow Zone, who were filled with rage, were gathering around him as the center along with others who already had disagreements with the system as a whole.</p><br/><p>‘It’s working out better than I expected.’</p><br/><p>Though there are always people who were not content with the system, there aren’t many of them usually.</p><br/><p>Since it wasn’t like Gwanje or the others were stomping them beneath their feet, they were just holding them back.</p><br/><p>No, it was the best kind of environment to live in as long they abided by the rules.</p><br/><p>Hunting monsters was so easy to the point of it being weird and incidents like their lives being in danger by factors such as the Four Calamities, which they had no control over as humans, disappeared.</p><br/><p>The Red and Orange zone where the World Tree and the strange mechanisms controlled the world, there wasn’t a need to be wary of other humans anymore.</p><br/><p>An unbelievable outcome if one took into account that the Red and Orange Zones were like disasters for humans to be in.</p><br/><p>Of course it wasn’t like Kaltus didn’t like such an environment.</p><br/><p>It was just that he wasn’t content with it.</p><br/><p>To Kaltus, who had a decent amount of skill, it was just his influence becoming smaller.</p><br/><p>He was a leader of a clan before but he was merely a normal clansman in a land ruled over by .</p><br/><p>But this place, the Yellow Zone, was different.</p><br/><p>‘The ones who were in control…Are finally gone. Though I still can’t imagine it. This place was even a harsher place to live?’</p><br/><p>Kaltus clicked his tongue as he looked at the original people of the Yellow Zone who were roaring in anger in the distance.</p><br/><p>It seems like this place was an even harsher place to be in than the Red and Orange Zones.</p><br/><p>Of course such a thing didn’t affect Kaltus who had come up late.</p><br/><p>He has only heard about the Satellite Fortresses so he could not easily figure out what it was like.</p><br/><p>Kaltus then mumbled as he thought of the person who had brought all of this up.</p><br/><p>Kang Hansoo.</p><br/><p>A person who was said to have done all this in an extremely short amount of time.</p><br/><p>Of course Kaltus did not believe this.</p><br/><p>‘There are too many weaklings in this world. Well. Maybe it was because they had been suppressed by the Higher Race with such a large amount of people and strength.’</p><br/><p>Flap.</p><br/><p>Kaltus mumbled as he walked out of the temporary tent.</p><br/><p>People who liked to rely on others always prayed that a supernatural being that would solve their issues would appear.</p><br/><p>They never thought to take care of themselves.</p><br/><p>A hero was created by these people.</p><br/><p>An existence created by need.</p><br/><p>And he had no thoughts of relying on such a guy.</p><br/><p>He would’ve retaliated against the Higher Race no matter what if he was in the same situation.</p><br/><p>‘Retards. You should be able to take care of yourself at least.’</p><br/><p>Kaltus finished his thoughts and moved out.</p><br/><p>Booooooom!</p><br/><p>At that moment.</p><br/><p>The people around Kaltus reacted to his movements and the surroundings got loud.</p><br/><p>And soon.</p><br/><p>Boom! Boom! Boom! Boom!</p><br/><p>Thousands of people followed Kaltus from behind.</p><br/><p>People who had grouped up due to Kaltus.</p><br/><p>Not all of them had to go either.</p><br/><p>Since this was more than enough to pressure their opponents.</p><br/><p>Kaltus smiled as he looked at Mihee and Enbi Arin’s tents.</p><br/><p>‘Let’s see, since their clan is Unity… Shall I call my clan Taiji?’</p><br/><p>Boom! Boom! Boom! Boom!</p><br/><p>Kaltus smiled as he looked at the thousands of people following him.</p><br/><p>Once he got a position of leadership he would be able to distribute the power system among this world.</p><br/><p>Booomo</p><br/><p>Kaltus approached all the way up to Mihee’s tent and then shouted out.</p><br/><p>“Hey! Come out! We should finish our talk! How long are you going to hold us back?”</p><br/><p>Kaltus smiled with a content expression.</p><br/><p>These guys were buying time for now but this wouldn’t last forever.</p><br/><p>It would be war soon.</p><br/><p>The Sages over there would be used as stepping stones to strengthen his own power.</p><br/><p>At that moment.</p><br/><p>“You’ve gathered quite a lot in this short amount of time.”</p><br/><p>Boooom.</p><br/><p>‘…’</p><br/><p>Kaltus flinched at the man, who was even larger than him, who had come out of the tent.</p><br/><p>And behind that man Mihee, Enbi Arin, Karhal, Ekidu and the others stood.</p><br/><p>As if they would leave everything to this man.</p><br/><p>And there would be only one person who was above the people who stood at the top of the clan Unity and had more authority.</p><br/><p>“So you’re Kang Hansoo. Greetings. How lucky for me to be able to see you, I heard you were someone quite hard to see.”</p><br/><p>Kaltus smiled.</p><br/><p>He had heard countless rumors and stories.</p><br/><p>But there was a problem in this world, where there was no media, where they had to communicate through numerous people.</p><br/><p>‘And this guy seems so busy that he doesn’t even care about ruling over the clan.’</p><br/><p>Kaltus made a content smile anyway.</p><br/><p>If they were easy to deal with, would this guy have stepped out?</p><br/><p>He had stepped out because he wasn’t able to hold back anymore.</p><br/><p>“Since your ‘Mighty general’ has come, let’s talk for a bit.”</p><br/><p>Almost half of the people here were with him.</p><br/><p>Even Hansoo wouldn’t be able to ignore this.</p><br/><p>The moment Kaltus was about to speak.</p><br/><p>Hansoo looked around Kaltus’s behind and then spoke expressionlessly.</p><br/><p>“I don’t really like you guys.”</p><br/><p>“What?”</p><br/><p>“Well, it’s more closer to dislike than not liking really.”</p><br/><p>Hansoo spat these words at Kaltus and thought of the past.</p><br/><p>Back when he hated the humankind.</p><br/><p>He was a weakling until he had reached the Yellow Zone.</p><br/><p>And though it was obvious, the weak ones didn’t even have a good opinion against other humans.</p><br/><p>Since humans were even scarier than beasts to the weak.</p><br/><p>Hansoo thought up to this point and spoke to Kaltus.</p><br/><p>“You might not believe it but… My friend says this. Humans will show their instincts if you don’t control them. So before controlling and asking them what they did wrong, you need to set up the rules.”</p><br/><p>“What the hell are you talking about?”</p><br/><p>Then.</p><br/><p>Hansoo smiled as he brought something out from his pocket.</p><br/><p>“I’m saying I’ll forgive you, once.”</p><br/><p>Kaltus flinched as he saw this.</p><br/><p>A strange marble where red and black was swirling and mixing onto each other.</p><br/><p>“What…”</p><br/><p>Even before Kaltus could react.</p><br/><p>Ooooooooong!</p><br/><p>The marble started to vibrate and shake the entire surrounding.</p><br/><p>At the same time.</p><br/><p>“Huh?”</p><br/><p>“Uhh! The mana?”</p><br/><p>Surprised shouts were heard from all around.</p><br/><p>Kaltus freaked out as he shouted back.</p><br/><p>“What the hell are you doing! If you reverse the mana now…”</p><br/><p>At that moment.</p><br/><p>Kuuuuugugugugugunnngg</p><br/><p>A tremendous earthquake could be felt.</p><br/><p>Something that was clearly different than the vibration created from the dark red marble.</p><br/><p>At that moment.</p><br/><p>Kiiiiiiing!</p><br/><p>From all over the Akran, bright blue lights started to fly up.</p><br/><p>Giant Satellite Fortresses that were shining blue to be exact.</p><br/><p>Rumbleee.</p><br/><p>“Uhhh…”</p><br/><p>The newcomers were dazed out at this marvelous scene but the original inhabitants of this place were different.</p><br/><p>“Aaaaah!”</p><br/><p>“Ugh…”</p><br/><p>The original members of the Yellow Zone screamed out in fear.</p><br/><p>Since the fact that the Satellite Fortresses, which had caused a massacre over their heads in the past, was back up was enough to bring back their fears.</p><br/><p>Kaltus’s tightly packed groups instantly divided up.</p><br/><p>At the same time.</p><br/><p>Zzzzoomm!</p><br/><p>A single beam of light came out from the Satellite Fortress and smashed into the mountains in the distance.</p><br/><p>Booooom!</p><br/><p>A mountain in front of the great basin, the Akran, turned into dust in an instant.</p><br/><p>The giant mountain that hundreds of thousands of people were digging up in order to build their city.</p><br/><p>“Uhh…”</p><br/><p>A clear threat.</p><br/><p>And the newcomer’s expressions turned the same as the previous residents of this place.</p><br/><p>Since they realized why these people couldn’t even think of retaliating against the Higher Race with this many people.</p><br/><p>A ginormous metal castle that split mountains.</p><br/><p>And tens of these.</p><br/><p>This was not something humans can go up against.</p><br/><p>‘Fucking hell….’</p><br/><p>Keltus grinded his teeth as he watched this scene.</p><br/><p>Since he realized right away.</p><br/><p>That this moment.</p><br/><p>The Yellow Zone has become the same as the Red and Orange Zone.</p><br/><p>Hansoo spoke few words as he looked at Kaltus.</p><br/><p>“You know the rules right? I’m sure you’ll follow them. I’ll forgive you this one time since you haven’t caused any trouble yet.”</p><br/><p>“…Fuck you, you fucking dictator bastard.”</p><br/><p>Hansoo chuckled as he looked at Kaltus.</p><br/><p>If he could win then he could do anything, much less becoming a dictator.</p><br/><p>He had no leisure to listen to everyone’s wishes and dreams.</p><br/><p>‘There’s… Not much time before the Abyss opens.’</p><br/><p>Hansoo finished his thoughts and then spoke.</p><br/><p>“Don’t be so discontent with it, I’m doing this all for the benefit of you anyway. Now since we’re in a much more comfortable situation, let’s talk for a bit.”</p><br/><p>“…Fuck. What do you want to talk about now?”</p><br/><p>Kaltus replied lethargically.</p><br/><p>Everything has ended.</p><br/><p>What was there to talk about.</p><br/><p>“Tell me who supported you from the back.”</p><br/><p>Hansoo spoke towards Kaltus in a cold manner.</p><br/><p>The clansmen, who were controlling the Satellite Fortress, were constantly sending messages to their Lord and the Soul Fragment within that Lord was being used to send Hansoo the intel.</p><br/><p>The first thing Hansoo had to do was finding the suspicious people.</p><br/><p>‘It’s too fast. There’s definitely a guy who caused all this.’</p><br/><p>But he had no way of finding this.</p><br/><p>This place, the entire Akran, was under his control and vision but he could not find anyone special.</p><br/><p>As if that person had finished what he had to do here.</p><br/><p>‘Where could he have gone?’</p><br/><p>It would’ve been nice if they had run away but it didn’t seem that way.</p><br/><p>Crackle.</p><br/><p>Hansoo’s fists clenched tightly and made threatening noises.</p><br/>\n</div>"}