{"title": "Chapter 213 : Gael-Tara (6)", "id": 213, "volume": 3, "url": "http://boxnovel.org/reincarnator-chapter-213-gael-tara-6", "volume_title": "Volume 3", "body": "<h1>Chapter 213 : Gael-Tara (6)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 213 : Gael-Tara (6)</p><br/><p>‘Until the end huh.’</p><br/><p>Hansoo clicked his tongue towards Metiron who had let go of all the controls and then placed his hand upon the heart of Metiron.</p><br/><p>Kiiiiing</p><br/><p>The thing that had remained as a symbol inside Metiron’s heart slowly got pulled out.</p><br/><p>A shining crystal-shaped object.</p><br/><p>This was the epitome of Karmen, the king who had been betrayed, that was a tier higher than the Mana Pools.</p><br/><p>Mana Jade.</p><br/><p>‘Instead of a higher tier Mana Pool… It’s like a lower tier Mana Engine.’</p><br/><p>Hansoo mumbled as he stared at the Mana Jade that was letting off a tremendous amount of mana while floating above his hand.</p><br/><p>This was created for the Sages.</p><br/><p>Since it was an artifact that fit their superior bodies.</p><br/><p>This could easily fill up the small amount of needed mana from the Mana Pool.</p><br/><p>It would’ve been a gift that would’ve been sent to the Sages if he hadn’t been hit in the back.</p><br/><p>If the Sages had waited patiently a bit more then they would’ve received the method of mass creating the Mana Jade and would have been able to have an even more powerful race.</p><br/><p>Hansoo placed the Mana Jade above his heart.</p><br/><p>The moment the Mana Jade, which was comprised of four jewels tied up in a strange path, got close to Hansoo’s heart.</p><br/><p>The single remaining heart split up in sync with its own beat into four parts.</p><br/><p>And the four blue jewels that were slowly rotating around the flesh around the heart slowly started to bore down into Hansoo's body.</p><br/><p>Crunch. Udddudk.</p><br/><p>The moment the Mana Jade entered his heart.</p><br/><p>Cwhaaaak!</p><br/><p>A tremendous amount of mana started to sweep over Hansoo’s body.</p><br/><p>The mana that came out from the Mana Jade started to follow Hansoo’s mana circuits in his body and started to bore into the deepest parts of his body.</p><br/><p>Ooooong.</p><br/><p>The dried up mana circuits were flooded as the Demonic Dragon’s Reinforcement started up again.</p><br/><p>Then.</p><br/><p>Kulug Kulug.</p><br/><p>The regeneration from the Racial Metamorphosis, the Dragon Essence Blade, the Body Enhancement Surgery and even the Demonic Dragon’s Reinforcement started to heal up Hansoo very at an extremely rapid rate.</p><br/><p>Broken bones were mended and skin was healed.</p><br/><p>Severed muscles got connected and the messed up arteries, veins and the nerves regenerated.</p><br/><p>And Hansoo made a content expression as he saw this.</p><br/><p>He felt like a fish in water.</p><br/><p>How much had be suffered due to lack of mana after coming back to the past?</p><br/><p>His body grew quickly and his skills got stronger but due to the lack of mana, he could not utilize them properly.</p><br/><p>But since he had gained the Mana Jade, the story would change.</p><br/><p>After the injuries healed and regained his senses, he walked towards the control room of the Gael-Tara behind Metiron.</p><br/><p>The blue marble was still floating in its original shape despite all the chaos.</p><br/><p>Of course Hansoo and Metiron both tried to reduce as much damage that came this way.</p><br/><p>‘Anyway… How shall I do this?’</p><br/><p>He hadn’t told others but he was quite worried.</p><br/><p>Since he wasn’t really interested in technology or science.</p><br/><p>The reason why the Sages could affect this guy was because they had risen to a certain level in their technology and intelligence.</p><br/><p>‘I guess I should try as much as I can first.’</p><br/><p>The moment Hansoo walked into the control room.</p><br/><p>Metiron coughed out blood and laughed from outside.</p><br/><p>“Haha...Hahahaha! I’ve won! Kang Hansoo! The humans...They’ll all die now.”</p><br/><p>The Sages would definitely not let the humans alive once they obtain this.</p><br/><p>This place will become a much more vicious and dangerous place than when the Higher Races ruled.</p><br/><p>Though it’s a shame he wouldn’t be able to pick out and send people up, this wasn’t bad.</p><br/><p>‘Clementine… Climb well. I’ll… deal with the problem here.’</p><br/><p>He barely had the strength to move his fingers after becoming such a mess but a victorious sentiment swept through him.</p><br/><p>As Metiron smiled while reminiscing about the times when the nine of them roamed around the Otherworld.</p><br/><p>Hansoo mumbled.</p><br/><p>“We’l.. We’ll see.”</p><br/><p>The controls were all intact and the possibility existed.</p><br/><p>‘If it doesn’t work then… I can at least temporarily stop it.’</p><br/><p>As long as he could stop the movements of this thing then he would be able to deal with it from the outside.</p><br/><p>Since according to the soul fragment, both sides still had Satellite Fortresses and the human forces still remained.</p><br/><p>Though a frontal clash would result in a large amount of casualties, it was much better than this thing going on a rampage.</p><br/><p>Hansoo finished his thoughts and then put his hand upon the blue marble.</p><br/><p>Oooooong</p><br/><p>The minds of the thing inside and Hansoo resonated.</p><br/><p>Then.</p><br/><p>Whooosh</p><br/><p>Hansoo’s consciousness started to rush towards a certain location quickly.</p><br/><p>…………………………..</p><br/><p>Hansoo made a surprised expression while he looked at the white space that had suddenly appeared.</p><br/><p>“Hmm. This is…”</p><br/><p>An all-white space.</p><br/><p>As Hansoo looked around this white space where the beginnings and ends could not be determined.</p><br/><p>Glug.</p><br/><p>The ground in front of him moved around and something shot up.</p><br/><p>White like the white space he was in but an existence that resembled a human.</p><br/><p>Hansoo spoke towards the muscular figure.</p><br/><p>“So you’re Karmen huh.”</p><br/><p>Hansoo then mumbled.</p><br/><p>It wasn’t a soul.</p><br/><p>It was more like a agglomeration of memories and evil intentions.</p><br/><p>It seems that Karmen had reached an even higher level.</p><br/><p>The white figure nodded and then spoke.</p><br/><p>“Well. It’s… more of a leftover to be exact.”</p><br/><p>It wasn’t an existence that had all of Karmen’s intelligence, mentality, memories and emotions.</p><br/><p>It was just an existence that had a few random abilities to control this thing.</p><br/><p>An existence that was only created for revenge.</p><br/><p>Hansoo didn’t know why but Karmen was making quite a calm expression, maybe it was due to the interception of the Sages from outside or he still had some sanity left.</p><br/><p>Karmen then spoke.</p><br/><p>“Well, I tried to be nice to them while I was alive. Since they were a pitiful race. To have such a great amount of abilities and intelligence but for their lifespans to be that limited. How sad would it have been for them?”</p><br/><p>“...?”</p><br/><p>Hansoo frowned at Karmen who was speaking as if he was of a different race but Karmen didn’t falter as he continued to speak.</p><br/><p>“Well, they were a race who was going to die off even without my hands. Their lifespans were getting shorter and their fertility rates were also going down. It is the result of the higher level of technology and more exposure to mana.”</p><br/><p>The main reason for the Sage’s low fertility rates and short lifespans were because of the overbearing mana that their bodies could not handle.</p><br/><p>And ironically the situation had turned worse as they tried to fix it with science and mana.</p><br/><p>Destruction of the entire race was something that was bound to happen.</p><br/><p>Since no matter how great of a technology they had, if their lifespans and fertility rates were bad then they would all perish.</p><br/><p>As Hansoo nodded.</p><br/><p>Karmen spoke.</p><br/><p>“So I was going to use the technology of the World Tree, Body Enhancement Surgery and even the Soul transmigration to prepare a new body for them but...I guess this was their limit.”</p><br/><p>“What?”</p><br/><p>As Hansoo was shocked from these answers.</p><br/><p>Karmen replied.</p><br/><p>“Don’t be so shocked. There are a lot of strange things in the world. Anyways...I’ve prepared two things for them.”</p><br/><p>The first was a present that would lead them to glory.</p><br/><p>The second was a present that would drag them down to destruction.</p><br/><p>Maybe if the present box hadn’t been opened.</p><br/><p>Once it was opened, they couldn’t return or deny it.</p><br/><p>“Since it seems like they’ve received the good part...They need to receive the second present as well. I guess this is why they say you need to hear the bad news first.”</p><br/><p>Karmen spoke towards Hansoo.</p><br/><p>“Shall I ask you a question? Why did I set this up so it ate the Satellite Fortress first instead of killing the Sages? If I was going to get revenge then I should've just killed them first.”</p><br/><p>Though it got stronger the more mana it ate, the Gael-Tara was more than enough with just the Garmeia’s engine.</p><br/><p>There wasn’t a need to eat up the Satellite Fortresses.</p><br/><p>As Hansoo made a confused expression.</p><br/><p>Karmen laughed as he whispered into Hansoo’s ear.</p><br/><p>“...”</p><br/><p>“What!?”</p><br/><p>As Hansoo shouted out in shock.</p><br/><p>Karmen smiled and then spoke.</p><br/><p>“This is the last gift I present to you guys. Since you guys haven’t sinned against me yet. Do your best”.</p><br/><p>As Karmen’s words ended.</p><br/><p>Ooooong</p><br/><p>The large white space started to tremble and fall apart.</p><br/><p>Karmen laughed out loudly in the midst of the crumbling space and spoke.</p><br/><p>“It was fun to converse after so long! Hahaha! Farewell!”</p><br/><p>Then</p><br/><p>Whooosh!</p><br/><p>Hansoo’s conscious started to fly back to its original location.</p><br/><p>………………………….</p><br/><p>“Huup!”</p><br/><p>Hansoo hurriedly looked around after returning from the white space that had fallen apart.</p><br/><p>Kuuugugugugu</p><br/><p>Surprisingly, the white space was not hte only thing falling apart.</p><br/><p>The Gael-Tara that had eaten up the countless Satellite Fortresses and their mana engines was bubbling.</p><br/><p>And Hansoo could also see the shocked expression of Metiron.</p><br/><p>“What...What is this? What’s going on?”</p><br/><p>Metiron mumbled with a confused expression.</p><br/><p>Everything was going so well.</p><br/><p>The control for this giant thing had been passed over and they just needed to destroy the humans.</p><br/><p>Though he would die by Hansoo’s hands, this was more than enough.</p><br/><p>But this thing stopped completely as soon as Hansoo touched the control marble.</p><br/><p>And strange things were even occurring.</p><br/><p>Metiron shouted towards Hansoo who had taken his hands off from the marble.</p><br/><p>“You..You fucking bastard! What the hell have you done! How did you do this!”</p><br/><p>Hansoo shook his head as he replied.</p><br/><p>“I didn’t do it. Anyways, this Karmen guy...He was quite vengeful.”</p><br/><p>“What?”</p><br/><p>Hansoo didn’t reply to Metiron’s words as he quickly placed his hands back on the control marble.</p><br/><p>The act of the Sages trying to take over the control was merely some child play to Karmen.</p><br/><p>The control for this thing had been only for a moment, all the souls that had entered to control this had been destroyed and this giant thing was ready to act on its instincts again.</p><br/><p>‘I have to hurry.’</p><br/><p>Within the trembling environment.</p><br/><p>Hansoo started to focus on the control marble in front of his eyes.</p><br/>\n</div>"}