{"title": "Chapter 216 : Reward (2)", "id": 216, "volume": 3, "url": "http://boxnovel.org/reincarnator-chapter-216-reward-2", "volume_title": "Volume 3", "body": "<h1>Chapter 216 : Reward (2)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 216 : Reward (2)</p><br/><p>Hansoo frowned at this organism.</p><br/><p>‘Creepy bastard.’</p><br/><p>It didn’t come through the void.</p><br/><p>It was just silently watching while it was hidden.</p><br/><p>Well, this wasn’t the important part.</p><br/><p>Hansoo took a glance at the control room which was bubbling intensely and then spoke to the fairy.</p><br/><p>“I request a reward. I killed this.”</p><br/><p>The fairy laughed.</p><br/><p>“You didn’t kill it yet? It seems to still be alive?”</p><br/><p>Hansoo replied expressionlessly.</p><br/><p>“I killed it. Don’t joke around.”</p><br/><p>Actually, if the fairy stayed true to those words then he couldn’t really do anything.</p><br/><p>Since it was indeed still alive.</p><br/><p>But the fairies weren’t things that would play around like that.</p><br/><p>The fairy made a bored expression at Hansoo’s words and then spoke while shrugging its shoulders.</p><br/><p>“Fine. I admit it but… It’ll be a monopoly this time around. Only you would get the benefit but… I’ll give you a special treatment. Since you’re our Hansoo. Hehe. Are you going to share it this time as well?”</p><br/><p>Monopolizing a reward that would be given to hundreds of thousands of people didn’t necessarily make the reward that much better.</p><br/><p>Of course a tremendous reward will still be given but it was obvious what Hansoo should choose because of his objective.</p><br/><p>Since a reward given to hundreds of thousands of people will be of a great help to him when he fights with the Abyss in the future.</p><br/><p>But Hansoo shook his head.</p><br/><p>“No, I need to live as well.”</p><br/><p>If he shared such a thing in this situation then he wouldn’t have a way to live.</p><br/><p>He only needed one thing.</p><br/><p>A powerful skill that could escape this current situation.</p><br/><p>“Fine. Shall we gamble like last time or do you want something fixed? A defense skill? Movement skill?”</p><br/><p>Hansoo shook his head.</p><br/><p>A defense skill would be useless.</p><br/><p>Since no defense skill would be able to withstand the energy that would explode out from this thing.</p><br/><p>His body would get destroyed in an instant.</p><br/><p>The same for movement skills as well.</p><br/><p>Skills that could move through the void were extremely rare and for the distance he needed to travel, it would require a lot of mastery.</p><br/><p>He had no way of raising the mastery of the skill within those short moments before the explosion.</p><br/><p>So the answer was fixed.</p><br/><p>Hansoo spoke towards the Fairy.</p><br/><p>“Give me the higher skill of the Seven Strands Spear.”</p><br/><p>Solo numbering 5, Seven Strands Spear.</p><br/><p>A destructive weapon with the highest power.</p><br/><p>According to what he knew, there was no attack skill that had a higher destructive force than the Seven Strands Sper.</p><br/><p>A finishing move that gathered a tremendous amount of mana, that even Metiron had a struggle controlling despite the Mana Jade, compressed it into seven beams of light to fire.</p><br/><p>But this wasn’t enough.</p><br/><p>He needed something stronger.</p><br/><p>He needed an ultimate skill that could destroy this Gael-Tara surrounding him and create a hole in it.</p><br/><p>Something that was beyond a solo numbering, something that people didn’t know about yet.</p><br/><p>The fairy didn’t even falter as it smiled and spoke.</p><br/><p>“Hmm...So you want a skill that could allow you to escape this situation right? A skill with that much destructive power?”</p><br/><p>Hansoo nodded but made a slightly nervous expression.</p><br/><p>The liquid metal surrounding him was numerous tens of times stronger than the Satellite Fortresses.</p><br/><p>So much that it could withstand the ridiculous amount of pressure applied by the depths of the mercury-like Silver Sea without even breaking a bit.</p><br/><p>He needed to penetrate hundreds of meters of this in an instant.</p><br/><p>‘Would there really be a skill like this?’</p><br/><p>Maybe within the Abyss but there wasn’t anything that his body could withstand using as of now within Hansoo’s experience and memories that fit that description.</p><br/><p>But the Fairy surprisingly gave a positive answer.</p><br/><p>“Oh. Nice. There’s something just right for you. The thing I will give you is...The Nine Dragons Spear.”</p><br/><p>“Nine Dragons Spear?”</p><br/><p>Nine Dragons Spear.</p><br/><p>He had never heard of such a skill before.</p><br/><p>Even before Hansoo’s confusion dissipated.</p><br/><p>The fairy spoke.</p><br/><p>“A skill created from compiling things a martial artist in a certain Zone had comprehended right before death.”</p><br/><p>“A martial artist…”</p><br/><p>The fairy smiled at Hansoo’s mumbles and then spoke.</p><br/><p>“He was really an amazing person. Since I’ve given it to you, do well with it ok? If it’s you Hansoo then… You’ll be fine. Well we’ll see each other soon if you survive anyway heheh! Be strong!”</p><br/><p>The Fairy disappeared into the void leaving behind those words.</p><br/><p>And Hansoo just laughed at the Fairy’s words.</p><br/><p>‘Well. Giving it to me was indeed enough. Anyway it’s a bit suspicious.’</p><br/><p>You’ll be fine…</p><br/><p>It was suspicious that the fairy just left without many explanations but there was nothing he could do.</p><br/><p>Since he couldn’t really do anything about it or anything.</p><br/><p>And since the fairies didn’t scam anybody or anything, the effect of the skill would be quite marvelous.</p><br/><p>Rumble</p><br/><p>Hansoo looked over his body for a moment, nodded and then walked out from the control room which was now boiling even on the inside.</p><br/><p>The other locations had long been liquified from the heat.</p><br/><p>‘I don’t have much time.’</p><br/><p>He needed to get out of this place.</p><br/><p>Whooosh</p><br/><p>Hansoo readied the skill that had appeared within his body.</p><br/><p>Nine Dragons Spear.</p><br/><p>If the Quintuple Beam gathered five energies to attack and the Seven Strands Spear gathered the seven colored lights to attack then the Nine Dragons Spear went a step further.</p><br/><p>Gather nine dragons onto the tip of the spear.</p><br/><p>Then pierce the enemy.</p><br/><p>An ultimate one- shot-one-kill-type skill.</p><br/><p>As soon as the skill was activated.</p><br/><p>Boooooooom!</p><br/><p>The Mana Jade went berserk and the mana started to get burned.</p><br/><p>The mana resembled a dragon as it swept past his heart and rolled around his entire body, got sent out through his hand and then coiled up the Forked Lightning by following the skill’s lead.</p><br/><p>And.</p><br/><p>The skill started to forcibly squeeze out the mana from Hansoo’s body.</p><br/><p>No, it wasn’t just the mana.</p><br/><p>‘Damn.’</p><br/><p>The skill got activated and dragons coiled around his body causing a change.</p><br/><p>The whole structure of his body creaked as it started to bend.</p><br/><p>Just to perform a single skill,</p><br/><p>Crunch.</p><br/><p>Squeak.</p><br/><p>Uududuk.</p><br/><p>Hansoo exclaimed as he felt the dragon rolling through the insides of his body and causing his entire body to change by twisting and breaking the structures forcibly.</p><br/><p>‘...This is a skill that puts both the body and one’s mana under strain.’</p><br/><p>The Mana Jade felt pressured as a tremendous amount of mana was drained for every dragon and it started to pour out an even larger amount of mana by spinning insanely.</p><br/><p>The silver liquid from the Body Enhancement Surgery and the Dragon Essence Blade tried their best to maintain the body that was creaking and twisting from breaking apart.</p><br/><p>In order to support the vitality needed for the skill, the three hearts started to beat crazily and pumped.</p><br/><p>All this energy, for just a single attack, got sucked into the dragon that was sweeping through his body.</p><br/><p>He suddenly felt pain that was comparable to when the liquid metal inside his body hadn’t settled after he received the Body Enhancement Surgery in the past.</p><br/><p>‘Kuhuk.’</p><br/><p>Kiiiiiing.</p><br/><p>Two.</p><br/><p>Three.</p><br/><p>Every time a dragon appeared on Hansoo’s spear the pressure being exerted on Hansoo’s body multiplied.</p><br/><p>Like being squeezed in from pressure from all around deep under the sea.</p><br/><p>But the number of dragons on the Forked Lightning still continued to rise.</p><br/><p>Uududududuk.</p><br/><p>Surprisingly, the Forked Lightning started to crack and scream as if it couldn’t handle the force.</p><br/><p>‘Eight…’</p><br/><p>Hansoo clenched his teeth so hard that they almost cracked.</p><br/><p>He could actually hear sounds of his body blowing apart and breaking.</p><br/><p>Tuduk!</p><br/><p>Craack!</p><br/><p>Hansoo finally realized what the fairy had told him.</p><br/><p>‘Maybe instead of being enlightened before death… That guy might’ve died while using it.’</p><br/><p>A vicious skill that would kill the user if they couldn’t fulfill its strict requirements.</p><br/><p>In an instant.</p><br/><p>The final dragon grew out from the Mana Jade and headed towards the heart.</p><br/><p>Claaangg!</p><br/><p>The Mana Jade’s light was turned off.</p><br/><p>It had been burnt out from overuse.</p><br/><p>It might not even work for a while.</p><br/><p>One of the three hearts, where the dragon had passed through, blew up.</p><br/><p>Muscles ripped, veins blew up, bones cracked and joints were twisted.</p><br/><p>The moment that final dragon flew out of his hand, which had swollen from the veins exploding, and climbed up the spear.</p><br/><p>The nine dragons which had gathered at the tip chomped on each other, twisted and turned as they started to gather into one point.</p><br/><p>Koooouuuuuuuuu!</p><br/><p>The dragons, which all had different colors, got sucked into one point and condensed.</p><br/><p>Booooooooom!</p><br/><p>Hansoo’s body exploded forward without his consent.</p><br/><p>The body that was created and prepared for this single skill sent the spear forward.</p><br/><p>Then.</p><br/><p>Kooooouuuuuu!</p><br/><p>The black marble that had gathered upon the tip of the spear started to reach out forward.</p><br/><p>Despite the attack flying at the speed of light, Metiron smirked as he looked at the tiny black dot that didn’t make any noise.</p><br/><p>‘What the hell is that kid doing.’</p><br/><p>So much work for just that.</p><br/><p>The moment the corner of Metiron’s mouth rose up as he watched from the back.</p><br/><p>The black dot touched the inner wall of the Gael-Tara that was bubbling up.</p><br/><p>Then.</p><br/><p>Boooooooooooom!</p><br/><p>“Kuhuuk!”</p><br/><p>A sound that rang throughout the heavens and earth rang out.</p><br/><p>No matter how strong that attack was, realistically it should only have made a hole the size of the black dot.</p><br/><p>Along with the vibrations that caused the already hurt Metiron to cough out blood.</p><br/><p>If it was explosive than only the area should’ve blown up.</p><br/><p>But surprisingly, the black dot destroyed everything in its path and continued forward.</p><br/><p>Like the air wall in front of a jet plane, leaving behind tens of meters of tunnel behind it.</p><br/><p>Kwaaagagagagaak!</p><br/><p>The liquid metal of the Gael-Tara, which was much tougher than the defense of the Satellite Fortresses, got smashed aparttens of meters wide and created a path.</p><br/><p>Soon.</p><br/><p>Claaang!</p><br/><p>A long tunnel was created and the silvery liquid metal started to rush in.</p><br/><p>With a tremendous amount of force.</p><br/><p>‘He really did it…’</p><br/><p>And he didn’t do it in a simple manner.</p><br/><p>He smashed it apart as if it was tofu.</p><br/><p>‘...If he had that then he would’ve been able to kill the Gael-Tara even from the outside.’</p><br/><p>Metiron made a shocked expression and then sighed as he looked at the silver liquid that was rushing towards him.</p><br/><p>This was the end of him.</p><br/><p>This was kilometers under the sea.</p><br/><p>The pressure of the liquid metals would be insane.</p><br/><p>That guy would be able to live through the pressure and go onto the next Zone since his body was insanely strong but his already broken body wouldn’t be able to.</p><br/><p>By the time he got to the next Zone, he would’ve long become a corpse.</p><br/><p>Metiron sighed as he looked at the silver liquid that was rushing towards him after taking his eyes off Hansoo and left behind his final words by activating the Fragment of Seven Souls.</p><br/><p>Soon.</p><br/><p>Boooooom!</p><br/><p>The Gael-Tara blew up as the energy from the explosion devoured Metiron’s body which was already breaking apart from the silver liquids.</p><br/><p>……………………………………..</p><br/><p>Indigo Zone.</p><br/><p>Eres made a smile as she looked at the female standing next to her.</p><br/><p>Long, straight hair and muscular body were her distinct features.</p><br/><p>Kangtae was drooling from behind while looking at her butt.</p><br/><p>Eres took a glance at Kangtae as she asked the woman:</p><br/><p>“This is it for the Indigo Zone as well. Anyways, why do you look so sad?”</p><br/><p>The female made a weak smile as he replied.</p><br/><p>“No it’s nothing, I just feel a bit down today. What is there to enjoy in this world?”</p><br/><p>Eres made a sad expression and then comforted the woman.</p><br/><p>“Stay strong miss Taehee. We are here for you. We’re almost there.”</p><br/><p>“...Thank you.”</p><br/><p>“Heheh. Isn’t it because of that Clementine?”</p><br/><p>The female, Shin Taehee, smiled as she looked at Eres next to her and Kangtae shouting from behind.</p><br/>\n</div>"}