{"title": "Chapter 229 : God’s Destruction Maul (4)", "id": 229, "volume": 3, "url": "http://boxnovel.org/reincarnator-chapter-229-god%E2%80%99s-destruction-maul-4", "volume_title": "Volume 3", "body": "<h1>Chapter 229 : God’s Destruction Maul (4)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 229 : God’s Destruction Maul (4)</p><br/><p>The War Fortress.</p><br/><p>A location that had become one of the hottest places after the 5th patch.</p><br/><p>Countless players rode on the warp gate to come to this place and hunted on the Spirit Land located near the Bellum War Fortress and completed the quests prepared for them by Exodus.</p><br/><p>The difficulty was high and it hadn’t been long since it came out so there was a lack of information about it but this actually encouraged the players even more.</p><br/><p>Since the game Exodus wasn’t petty in rewarding pioneers.</p><br/><p>Well, it was more being extravagant than not being petty.</p><br/><p>To the point of Bellum War Fortress and even other kingdoms giving out quests for those rewards.</p><br/><p>And if someone received enough honors then they could even own land.</p><br/><p>A location which had plenty reasons to attract players.</p><br/><p>Exodus showed off a tremendously large world and had plenty of places where high level players over 200 could play other than this.</p><br/><p>The in the Imperial Capital and the outside the kingdom were part of those locations as well.</p><br/><p>Famous hunting grounds for the level 200s to level up and for the few max level 250 master players.</p><br/><p>Of course these locations which had decades of struggle and hard work invested in by players with clear information and guides were much more attractive than some mysterious land such as the Spirit Land.</p><br/><p>But there was a specific reason why this place, the Spirit Land, attracted so many people.</p><br/><p>This stone, which only dropped in the Spirit Land at a very low drop rate was very sought after amongst players.</p><br/><p>It had the ability to enchant gear and even enhance skills.</p><br/><p>The S grade Spirit Stones that could enhance master artifacts for level 250s were so expensive that the people who wanted to sell them could basically say any price they wanted and people would still buy them.</p><br/><p>In order to find the Spirit Stones from the two , the players crawled into them over and over again.</p><br/><p>To the damned lands that they could only enter after using the Protection Elixir from the of the 5th patch.</p><br/><p>It was extremely dangerous but the danger was worth it.</p><br/><p>And it didn’t only apply to players.</p><br/><p>‘This is what is causing the problem.’</p><br/><p>Hansoo thought of the Spirit Stones and mumbled.</p><br/><p>The Kingdoms which were inhabited by NPCs wanted these as well.</p><br/><p>Even more than players.</p><br/><p>Unlike the players who were just trying to enhance their personal strength, the Kingdoms could use various magical techniques without limits so it was very useful for them.</p><br/><p>The problem was that the Keil Kingdom was basically in control of most of these Spirit Stones.</p><br/><p>Since the Spirit Lands were large, multiple Kingdoms were involved but the Protection Elixirs that allowed one to get in these could only be gotten from the Keil Kingdom.</p><br/><p>Of course the seven other Kingdoms wouldn’t like this system.</p><br/><p>And because of this, the Korin and Keil Kingdoms who were at peace for over a hundred years started to get antsy with each other and countless war-related quests appeared in the Bellum War Fortress.</p><br/><p>And war-related quests were very sought after by players because it gave achievement points and were related to owning land.</p><br/><p>Because of the two Kingdom’s relations, war-related quests appeared which further caused countless players to swarm around the first castle wall in order to receive these quests.</p><br/><p>War could blow out any given moment.</p><br/><p>Since the price of Spirit Stones was too high for a single country to monopolize them.</p><br/><p>Of course the war had already begun.</p><br/><p>With the terror incident of the maze.</p><br/><p>‘Well. It did indeed blow up a year earlier but it’s not that bad.’</p><br/><p>Chaos could cause danger but it could also be an opportunity.</p><br/><p>If he could achieve his goals from this chaos then what Clementine’s forces had done would’ve just helped him.</p><br/><p>Hansoo finished his thoughts and then shouted while looking at the 5m-wide azure marble.</p><br/><p>“Be careful with your words just in case after you jump in!”</p><br/><p>“Hmm?”</p><br/><p>The people made confused expressions but even before they could ask, Hansoo jumped in.</p><br/><p>Towards the entrance down to the 2nd floor.</p><br/><p>And the people who were watching this grinded their teeth as they followed Hansoo in one by one.</p><br/><p>Whoooosh!</p><br/><p>Whoosh!</p><br/><p>And soon.</p><br/><p>The azure marble absorbed all those people and these tens of people disappeared from the 1st floor of the maze without a single trace.</p><br/><p>The infected soldiers only screamed at the disappearance of these people, they didn’t have any thoughts of chasing them.</p><br/><p>Then they started to split up to oversee other parts of the maze and silence filled the area around the marble.</p><br/><p>…………………………………</p><br/><p>Whooooosh!</p><br/><p>‘Ugh...This doesn’t really feel that great.’</p><br/><p>As Christopher frowned at the sensation of sticky liquids swirling around his body.</p><br/><p>Whooooosh!</p><br/><p>“Huupp!”</p><br/><p>Christopher’s body popped out from the marble and floated up into the air.</p><br/><p>‘I’m out!’</p><br/><p>Christopher found his balance in mid air as he lightly landed onto the ground.</p><br/><p>Then the words of Hansoo came into Christopher’s ears.</p><br/><p>“There are my comrades.”</p><br/><p>Christopher tensed up at Hansoo’s words.</p><br/><p>‘...Others?’</p><br/><p>And as he looked around he saw hundreds of people watching him.</p><br/><p>He was shocked.</p><br/><p>‘So this is what he meant by being careful with our words…’</p><br/><p>The players who had been hunting in the 2nd floor started to throw questions at Hansoo.</p><br/><p>“What is this? What happened above?”</p><br/><p>“Fuck! I can’t communicate with my friend who went up!”</p><br/><p>“I heard the infected soldiers revived?”</p><br/><p>Hansoo shook his head at these questions.</p><br/><p>“I’m sorry, I don’t know very well as well. I hurriedly ran down here with my friends. We were resupplying in the supply zone and this had happened.”</p><br/><p>“Ugh…”</p><br/><p>The people then started to talk between themselves.</p><br/><p>“Shit...Did the gem recover?”</p><br/><p>“I hope somebody can just smash it apart.”</p><br/><p>“Yo? Do you wanna try it out? We might get a ton of rewards for breaking it. The ones who broke it first got a lot too.”</p><br/><p>“Ha. You want to get killed huh.”</p><br/><p>Christopher felt the difference between him and these players once again as he listened to them.</p><br/><p>For him and others, it was a deathly crisis.</p><br/><p>But for them it was a chance that they might take.</p><br/><p>The people then spoke to Hansoo again.</p><br/><p>“We’re going to join hands and go up, how about you?”</p><br/><p>Hansoo replied instantly.</p><br/><p>“I have friends below. We had split up to resupply.”</p><br/><p>“Oh then…”</p><br/><p>“We’ll have to go down. Well… We didn’t have the time to get our bags because of the chaos but we still have to go help them.”</p><br/><p>The players who had been looking at Hansoo’s group suspiciously then started to look away.</p><br/><p>They were wondering why these guys were moving around in a small group but such cases were possible.</p><br/><p>Actually, it was common for a small group to rejoin after resupplying with potions and other necessities while the larger group held a spot below.</p><br/><p>This was because the damned game didn’t provide inventory and made everyone carry bags.</p><br/><p>The players started to lose interest and said their goodbyes.</p><br/><p>“Well. Stay strong. We’ll just do a quest or two if we get the chance to on the way then!”</p><br/><p>“Ugh. This is annoying. I used all my extra revival scrolls below.”</p><br/><p>“There’s nothing bad about it. There’ll be more quests above so come on.”</p><br/><p>The players started to head towards the marble leading back up casually one by one.</p><br/><p>And Christopher’s underlings started to fall down one by one as if they finally started to relax.</p><br/><p>They had been too tensed up from all that had happened.</p><br/><p>‘Fucking hell. A mafia game* where we die if we get caught.’</p><br/><p>Ellenoia, Christopher’s right hand, breathed in and out and asked Hansoo while she calmed herself down.</p><br/><p>“Why do we even have to go down while doing all this? What’s below…”</p><br/><p>Though Christopher’s group was following Hansoo, Ellenoia still didn’t understand why Hansoo was going down like this.</p><br/><p>She had gathered a large amount of information when she had first come to this world.</p><br/><p>Since that was what she had done before anyway.</p><br/><p>People found the hidden race and could receive Protection Elixirs from them.</p><br/><p>It was a small but huge change.</p><br/><p>Since this gave people the chance to acquire the godly item, .</p><br/><p>But there were not many reasons for them to go down.</p><br/><p>Since they could just accomplish quests from other places and buy the Protection Elixirs with gold.</p><br/><p>As Hansoo heard Ellenoia’s words, he decided to let these people understand to a degree.</p><br/><p>To a degree.</p><br/><p>“My trait is for something like this. I can feel it.”</p><br/><p>“...”</p><br/><p>“Don’t worry. I’ve never been wrong until now.”</p><br/><p>A strange expression appeared on Ellenoia’s face but then soon disappeared.</p><br/><p>“Phew…”</p><br/><p>Ellenoia sighed out loud.</p><br/><p>If somebody else told her such things and tried to take her down to the depths of hell then she might’ve smashed their face in.</p><br/><p>But she had already heard the crazy things that man had said and had accomplished after them.</p><br/><p>‘Well, we don’t really have a choice anyway….Well, he really has a lot of fascinating things about him.’</p><br/><p>As Ellenoia watched Hansoo with a strange expression.</p><br/><p>Ooooong!</p><br/><p>The marble trembled and the people who had gone in came back out.</p><br/><p>While cursing with nervous expressions.</p><br/><p>“Fucking hell!”</p><br/><p>“Damn!”</p><br/><p>Ellenoia made a shocked expression as she saw the hundreds of people coming back out from the marble.</p><br/><p>‘Why did they come back like this? With such shocked expressions? Did something happen other than what we know about?’</p><br/><p>It wasn’t that strange for something else to happen.</p><br/><p>Since the moment the infected soldiers appeared, the land above had turned into a mysterious land.</p><br/><p>Ellenoia asked the group who had jumped out.</p><br/><p>“What happened?”</p><br/><p>“Well you see…”</p><br/><p>But before the player could even answer.</p><br/><p>Crunch!</p><br/><p>A spear flew out from Hansoo’s hand and pierced the player’s head.</p><br/><p>Ellenoia shouted at Hansoo’s actions from shock.</p><br/><p>“What…”</p><br/><p>‘Why the hell did he attack first!’</p><br/><p>Though they had been found out already, the time for the information to propagate was another story.</p><br/><p>Like how they had been successful at hiding their identities just now.</p><br/><p>Collisions were better the less there were but for Hansoo to suddenly attack like that.</p><br/><p>Hansoo tsked and replied at Ellenoia’s words.</p><br/><p>“We’ve been caught already.”</p><br/><p>“Huh?”</p><br/><p>As Ellenoia looked around.</p><br/><p>The hundreds of players who had come back down cursed out loud.</p><br/><p>“Heh, fucking bastard’s quite quick isn’t he.”</p><br/><p>“Damned bug players. Isn’t this a hack as well? We really need to get rid of them.”</p><br/><p>As Christopher and Ellenoia were shocked at the news.</p><br/><p>Hansoo mumbled inwardly.</p><br/><p>‘...They acted faster than I expected huh. On the blacklist already.’</p><br/><p>Blacklist.</p><br/><p>A kill list managed by the bug killer clan, .</p><br/><p>Then.</p><br/><p>Oooooong.</p><br/><p>Bright red powder started to gather around Hansoo’s body.</p><br/><p>*For those who don’t know what the mafia game is : https://en.wikipedia.org/wiki/Mafia_(party_game)</p><br/>\n</div>"}