{"title": "Chapter 220 : The Great Maze of the Ains (1)", "id": 220, "volume": 3, "url": "http://boxnovel.org/reincarnator-chapter-220-the-great-maze-of-the-ains-1", "volume_title": "Volume 3", "body": "<h1>Chapter 220 : The Great Maze of the Ains (1)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 220 : The Great Maze of the Ains (1)</p><br/><p>“Hmm.”</p><br/><p>As Hikikomaria’s expression changed from the look of the symbol, the female also raised her wrist while scoffing at the man.</p><br/><p>Showing a symbol that had an even deeper in color.</p><br/><p>“Does this actually mean anything? The thing that is important is after we get into the 5th floor. Also there have been a lot of fakers recently. Getting into a party with their stamps and then becoming baggage. And how do we know that you haven’t been abandoned by the bug killers because you were trash?”</p><br/><p>“... Aren’t your words a bit too harsh?”</p><br/><p>As the man growled the female only shrugged her shoulders and continued to speak.</p><br/><p>“I’m just saying because my last party got massacred because of it and we actually were at a loss. I wish to check the skill levels, if not then I’ll just leave instead.”</p><br/><p>Meaning that she wouldn’t join a party where they don’t even check one’s powers.</p><br/><p>If a random weakling triggered a trap in the maze then things could get really tiresome.</p><br/><p>Hikikomaria pondered at the female’s words for a moment and then spoke.</p><br/><p>“No, no. Let’s get this show on the road.”</p><br/><p>“Fucking hell…”</p><br/><p>The man grumbled as he pulled out his sword.</p><br/><p>A basic item with a level requirement of 205.</p><br/><p>He felt despair while looking at the shining weapons of those around him but there was nothing he could do.</p><br/><p>Since he had used all his gold due to the expensive cost of the warp gates.</p><br/><p>Normally one would need to upgrade their items in order to go to a higher level zone but he had no money for such a thing.</p><br/><p>‘Fuck. I need to earn money quickly and change my items. That bitch is just too meticulous.’</p><br/><p>He didn’t even have enough time to hunt but these guys were holding him down.</p><br/><p>But he couldn’t make a ruckus here.</p><br/><p>Since he could waste even more time.</p><br/><p>A player would be treated very well in areas where they were lacking but the War Fortress was one of the hottest places.</p><br/><p>A region where there were swarms of players.</p><br/><p>Of course they would only prefer those who had better personalities and were stronger.</p><br/><p>‘Let’s calm down for now.’</p><br/><p>The man hardened his expression and mumbled.</p><br/><p>The Great Maze of the Ains was a place worthy of him to back off like this.</p><br/><p>Since he would be able to gain plenty of money for him items if he gained a large amount of the level 5 Protection Elixirs.</p><br/><p>And in reality, he had been lucky enough to participate in the maze once which allowed him to change his armor to a better one.</p><br/><p>‘It’s a real jackpot.’</p><br/><p>He needed to calm down.</p><br/><p>As the man changed his armor and nodded, Hikikomaria spoke towards the three.</p><br/><p>“Let’s start then.”</p><br/><p>Then 12 party members surrounded the three.</p><br/><p>With their individual weapons and skills.</p><br/><p>The moment the people formed a circle.</p><br/><p>Hikikomaria shouted.</p><br/><p>“The time limit is 45 seconds. Quickly. We will take two people, excluding the first one to be taken out.”</p><br/><p>Then.</p><br/><p>Papapapapak.</p><br/><p>The surrounding 12 people started to pour out their assaults.</p><br/><p>Artifacts, skills and levels were all important.</p><br/><p>But these were all secondary.</p><br/><p>Since a bit of luck or connections can improve all of this.</p><br/><p>Which meant that there was only one thing that was truly important.</p><br/><p>It was how much one could squeeze this out and convert it into battle strength.</p><br/><p>Tototototoong!</p><br/><p>Boooboom!</p><br/><p>Of course since it was a test, they didn’t attack to kill.</p><br/><p>But even then, one might be taken out if they dropped their guards.</p><br/><p>How fast and well one could react to the skills that were flying towards them.</p><br/><p>This was very important in Exodus where surprise attacks constantly flew towards them.</p><br/><p>Since there were a lot of cases where people died to surprise attacks from the beasts in a short amount of time.</p><br/><p>Hikikomaria looked towards the three in the middle who were dealing with the attacks with a cold expression.</p><br/><p>‘Hmm.’</p><br/><p>Hikikomaria raised his hands after about 10 seconds.</p><br/><p>“Stop.”</p><br/><p>The man who had been blocking attacks madly looked around.</p><br/><p>‘Did I succeed?’</p><br/><p>The man, [EclipticMania], smiled towards the two who had been hurt quite a lot.</p><br/><p>Since he had a lot less injuries compared to the two.</p><br/><p>But an unexpected answer came out from Hikikomaria’s mouth.</p><br/><p>“The two over there will come with us. EclipticMania, sorry but maybe next time.”</p><br/><p>“Huh? Why?”</p><br/><p>The man asked in shock.</p><br/><p>He had been in a Circle Formation a few times already and knew the standards changed a bit depending on the hunting ground but most of them were based on how well one could block the attacks.</p><br/><p>And he, who had a good reaction speed, always passed the test.</p><br/><p>As the man who had done the best out of the three asked Hikikomaria, he just shook his head and answered.</p><br/><p>“You waste too much. You should trust in the healers, take the damage that you can and filter what you can dodge and block. If you continue like that then you would die off on the first floor.”</p><br/><p>Blocking it all wasn’t the important part.</p><br/><p>Since that was impossible.</p><br/><p>One needed to save mana from blocking useless attacks and only focus on the fatal ones.</p><br/><p>Which meant that one needed experience to determine all of this in addition to just reaction speed.</p><br/><p>‘That guy… Seems to have come from a laid back place. For even such weaklings to have come here…’</p><br/><p>Hikikomaria shook his head while he looked at EclipticMania.</p><br/><p>Though one could raise one’s level and set up their artifacts in weaker areas, they wouldn't be able to be part of the most important things.</p><br/><p>Like this.</p><br/><p>That guy probably heard about this place and came here through the warp gate but soon he will find out the cruel reality.</p><br/><p>On the other hand, the two others were amazing.</p><br/><p>‘Especially that Hansoo guy. His skills are…’</p><br/><p>Hikikomaria mumbled with a shocked expression.</p><br/><p>It was not easy to judge every single skill flying towards them from all directions.</p><br/><p>Since there were just too many of them.</p><br/><p>But that man had sorted through all those and even filtered them in mid-air with the spear, which was a weapon many regarded as being difficult to use.</p><br/><p>‘He wouldn’t hold us back with that level at least. Hmm, should I try recruiting him into Spair?’</p><br/><p>He didn’t know for sure since they hadn’t faced real battles together but the possibility still existed.</p><br/><p>Hikikomaria whistled and then spoke with a happy expression while pointing at the entrance of the giant mountain in the distance.</p><br/><p>“Let’s start right away. We will head in. We’ll resupply at the village on the 1st floor.”</p><br/><p>……………………………………………..</p><br/><p>Rumble</p><br/><p>A giant mountain.</p><br/><p>A large stone door around 5m diameter made strange grinding noises as it opened up.</p><br/><p>Hansoo mumbled as he looked at the door, which had many symbols engraved upon it, that seemed like it had been created to trap something.</p><br/><p>‘This is the start.’</p><br/><p>The 1st floor was the most important.</p><br/><p>Since the hidden piece was on the first floor.</p><br/><p>Everything would start from here.</p><br/><p>Hikikomaria chuckled at Hansoo who had been gazing at the hole and then spoke to him.</p><br/><p>“Don’t worry so much. The first floor isn’t much. It doesn’t seem like you have a symbol on your wrist, is it your first time at the maze then? Where did you play around mainly?”</p><br/><p>With this much strength, he should’ve been quite famous in that area.</p><br/><p>Though he himself didn’t know the tens of thousands of areas.</p><br/><p>Hansoo pondered for a moment and then spoke.</p><br/><p>“I was mainly around the Arrancar Zone.”</p><br/><p>“Oh?”</p><br/><p>Hikokomaria was shocked.</p><br/><p>Arrancar Zone.</p><br/><p>He knew.</p><br/><p>It wasn’t far away from here and was quite famous.</p><br/><p>‘One of the few places that a player became a suzerain of.’</p><br/><p>While one continued along their quests, they would sometimes receive a quest related to a kingdom or a country.</p><br/><p>And when they perform these quests they are able to gain achievement points.</p><br/><p>Depending on achievement points these individuals can receive the rights over a certain amount of land within that country and become a suzerain.</p><br/><p>‘I heard that it was quite a quiet place. He came from such a boring place huh.’</p><br/><p>Normally the people in their 20s would search for areas with harsh quests.</p><br/><p>But the Arrancar Zone was filled with only decent quests and there were no secrets to be found so it was a place famous for people like him who were in their 30s and 40s to hunt leisurely.</p><br/><p>Which meant that it was a place with low popularity.</p><br/><p>And though the Arrancar Zone was close by, it was over the border and in the Korin Kingdom.</p><br/><p>‘He should be penniless if he just came over then.’</p><br/><p>Though they didn’t take money even if you moved between countries, you couldn’t use money from the previous country in the new one.</p><br/><p>And since they didn’t exchange currencies, it was really maddening.</p><br/><p>This meant that one would need to earn money from the beginning if they changed countries, this was why there weren’t many who moved between countries.</p><br/><p>Most played around in that kingdom or that country.</p><br/><p>This was something the separate powers had set up in order to prevent the players of their side becoming part of the strength of their enemy.</p><br/><p>‘Well. There are a lot of people like this. There’s a lot to earn here.’</p><br/><p>If you were confident in your skills then it wasn’t a bad choice to come over to this place either.</p><br/><p>Since this place, the War Fortress, was the hottest place in the game currently.</p><br/><p>Hikikomaria shrugged and asked while smiling.</p><br/><p>“Why did you play around there? I thought you’d come from a more intense place.”</p><br/><p>They had plenty of time to talk until they reached the village on the 1st level anyway.</p><br/><p>Hikikomaria thought that he had come from an area filled with military quests due to his skills.</p><br/><p>Hansoo replied while laughing.</p><br/><p>“It’s just a place I have fond memories of.”</p><br/><p>‘I indeed have fond memories.’</p><br/><p>He mumbled as he thought back to the past.</p><br/><p>……………………………..</p><br/><p>A giant city where millions of people came and left.</p><br/><p>The War Fortress showed off its tremendous amount of people as well as its humongous size.</p><br/><p>Of course there were places that were not repaired yet and places that nobody inhabited.</p><br/><p>And a few people were gathered in the rundown ruins at the corner of this War Fortress.</p><br/><p>These 15 or so people’s expressions were filled with fatigue.</p><br/><p>No, it wasn’t just their faces that was the problem.</p><br/><p>They sighed in exhaustion as they healed the numerous injuries on each other’s bodies.</p><br/><p>At that moment.</p><br/><p>Rustle.</p><br/><p>A noise came from the outside of the destroyed ruins which they had covered with the straws.</p><br/><p>The people inside flinched.</p><br/><p>‘Fucking bastards. Did they come here already...No. How did they figure us out.!’</p><br/><p>The leader, Christopher, spat out and tensed up as he thought of the guy who attacked him for no reason.</p><br/><p>As Christopher tightly clenched the sword in his hand.</p><br/><p>A familiar voice could be heard.</p><br/><p>“It’s me! Me! I’m coming in!”</p><br/><p>“Phew…”</p><br/><p>The others sighed in relief and an agile female rushed inside.</p><br/><p>Christopher frowned as he looked at the female.</p><br/><p>“...Why are you alone? Where’s Gahee?”</p><br/><p>The female clenched her teeth and spoke through them.</p><br/><p>“I think he got caught.”</p><br/><p>“Fucking bastards!”</p><br/><p>Christopher forgot that he was hiding and cursed out.</p><br/><p>Though it was a game for those guys, this was a problem of survival for them.</p><br/><p>For them to die to people who were charging at them because it was just a game!</p><br/><p>He at least understood those he had fought against until now, this was even worse than a useless death.</p><br/><p>The female who had gone out for scouting, Ellenoia, made a depressed expression while looking at Christopher.</p><br/><p>Since she didn’t feel any better than him.</p><br/><p>But Ellenoia suddenly made an excited expression as she spoke towards Christopher.</p><br/><p>“I still have good news though.”</p><br/><p>“...What is it?”</p><br/><p>“While I was looking at the plaza...I saw him. Kang Hansoo.”</p><br/><p>“What? Are you sure?”</p><br/><p>Ellenoia nodded.</p><br/><p>“How could I forgot his physique and his artifacts. After all, we all saw him. I’m sure.”</p><br/><p>She wouldn't be able to forget even if she wanted to.</p><br/><p>The look of the man who had jumped into the Gael-Tara’s body while swinging his spear.</p><br/><p>Christopher made a shocked expression at Ellenoia’s words.</p><br/><p>‘Did he kill that thing and come up? Or did he also run away?’</p><br/><p>Christopher pondered as he thought of Hansoo who had gone into the giant body of the Gael-Tara.</p><br/><p>He then spoke.</p><br/><p>“Let’s join up with him.”</p><br/><p>“Would it be different for him?”</p><br/><p>This wasn’t a problem of strength.</p><br/><p>Since their enemies didn’t die.</p><br/><p>Hansoo might be able to kill the bug-killers but what about afterwards?</p><br/><p>More would charge at them like a swarm of bees.</p><br/><p>Towards Hansoo.</p><br/><p>As Ellenoia asked worryingly, Christopher just shook his head.</p><br/><p>“I feel as if this guy can even survive in hell.”</p><br/><p>Ellenoia subconsciously nodded at Christopher’s words but then asked with a worried expression.</p><br/><p>“What if… He denies us?”</p><br/><p>How great would it be if he accepted them because they went to him.</p><br/><p>Christopher shook his head at Ellenoia’s worries and then spoke.</p><br/><p>“Forget about freeloading. I heard that he was lacking in terms of searching and movement skills. There would be something we can help him out with.”</p><br/><p>‘And...We don’t have much of a choice.’</p><br/><p>At this rate they would slowly get driven into a corner and die.</p><br/><p>This wasn’t the best choice but a choice made in order to escape from the worst situation.</p><br/><p>‘Fuck. How is that guy planning to deal with this.’</p><br/><p>Even ten of them could barely hide here.</p><br/><p>If hundreds of thousands of adventurers came here then a great massacre would begin.</p><br/><p>Since the players didn’t die and there were many more of them than themselves.</p><br/><p>Christopher realized that this was not something he should be worried about right now and prepared to go out.</p><br/><p>In order to find traces of Hansoo.</p><br/>\n</div>"}