{"title": "Chapter 227 : God’s Destruction Maul (2)", "id": 227, "volume": 3, "url": "http://boxnovel.org/reincarnator-chapter-227-god%E2%80%99s-destruction-maul-2", "volume_title": "Volume 3", "body": "<h1>Chapter 227 : God’s Destruction Maul (2)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 227 : God’s Destruction Maul (2)</p><br/><p>As Hansoo was thinking of his objective.</p><br/><p>Christopher carefully approached him from the distance.</p><br/><p>He was actually watching from a distance in case something happened to Hansoo while the others ran away and had approached Hansoo after the situation ended.</p><br/><p>Christopher exclaimed out loud while watching Hansoo.</p><br/><p>‘...He’s unbelievably strong. Seriously.’</p><br/><p>“Thank you. But is this okay? You will be in danger too. You should hurry and…”</p><br/><p>Hansoo hasn’t been confirmed as a bug player yet.</p><br/><p>As Christopher was about to tell Hansoo to split up from him and his group.</p><br/><p>Hansoo spoke towards Christopher.</p><br/><p>“I would’ve been caught eventually anyway.”</p><br/><p>‘Not everything can go according to my plans.’</p><br/><p>Things that should’ve happened a year from now had happened now.</p><br/><p>So it was quite clear who had done it.</p><br/><p>Clementine’s forces.</p><br/><p>Those guys had probably done it.</p><br/><p>‘Though they weren’t specifically aiming for me...I’m probably related to it.’</p><br/><p>What those guys were afraid of was him bringing his forces up.</p><br/><p>And how he would prepare here.</p><br/><p>Since the Exodus was very limited in order to set up to billions of people despite being so huge.</p><br/><p>The reason why Clementine’s forces weren’t targeting him was because they didn’t know where he would choose to expand from.</p><br/><p>If they knew he would pop out from here then they would’ve used all their forces to stop him.</p><br/><p>‘I need to finish the 6th Great Change before they realize.’</p><br/><p>And he needed to get to the location on the 4th floor where laid.</p><br/><p>To the space within the maze of the 4th floor before heading down to the 5th floor.</p><br/><p>A secret land nobody had found yet.</p><br/><p>And he needed the skull in his hands to get to that place.</p><br/><p>Like how the player who had initiated the 6th Great Change in the past had done.</p><br/><p>‘Since things have turned out like this, I’ll just make things bigger and smash all the way down to the 4th floor quickly.’</p><br/><p>According to his calculations, he didn’t have much time.</p><br/><p>Hansoo looked towards where the War Fortress should be above the maze.</p><br/><p>……………………………………….</p><br/><p>Oooooooong.</p><br/><p>Central plaza.</p><br/><p>Players were reviving with Revival Talismans at the default revival area.</p><br/><p>Bug killers who had been killed by Hansoo.</p><br/><p>The ones who revived cursed out loud and spat out.</p><br/><p>“Fuck...That guy is too much.”</p><br/><p>“Hey! You revived as well?”</p><br/><p>Arirangcar grinded his teeth as he looked at his comrades who were reviving back at the plaza.</p><br/><p>Then.</p><br/><p>Oooooong.</p><br/><p>Flame Warrior-V logged back in and popped out next to Arirangcar.</p><br/><p>And Flame Warrior-V asked Arirangcar as soon as he came out.</p><br/><p>“...How many used the Immortality Stones?”</p><br/><p>“...23 including myself.”</p><br/><p>“You died right away again?”</p><br/><p>“Yeap.”</p><br/><p>“Fucking bastard…”</p><br/><p>Flame Warrior-V grinded his teeth.</p><br/><p>They were indeed the ones who attacked first but this was too much.</p><br/><p>23 Immortality Stones evaporated into thin air for no reason.</p><br/><p>Arirangcar spoke towards Flame Warrior-V.</p><br/><p>“Anyways, this is it for today.”</p><br/><p>“Huh? Why?”</p><br/><p>Arirangcar frowned at Flame Warrior-V’s reply.</p><br/><p>“Come on dude. We...We aren’t even sure if he was a bug player or not and do you even know how big the losses are? There are even some who aren’t logging back in because the Revival Talisman are so expensive and they are taking a break today. They told me they’re going to hunt around for a while as well.”</p><br/><p>Flame Warrior-V grinded his teeth at Arirangcar’s words.</p><br/><p>‘These unloyal bastards...Fuck. How did we get pushed into a corner like this.’</p><br/><p>Sighs came out from Kang Joonho’s mouth in real life.</p><br/><p>It was amazing when they, the bug killers, were roaming around in the past.</p><br/><p>No matter how much money they used, they could just buy it back by hunting inside Exodus.</p><br/><p>But the number of bug players dwindled for some reason as time went on as Anteater group’s income also dropped.</p><br/><p>Of course they still earned much more than normal players but it was not enough for Flame Warrior-V.</p><br/><p>He needed to succeed in his hunts due to having gotten used to the extravagant lifestyle.</p><br/><p>But because of one bastard it seems he was in for a huge trouble.</p><br/><p>He was going to suffer a lot for a while.</p><br/><p>He would need to grind without sleep for quite a while.</p><br/><p>Flame Warrior-V grinded his teeth after thinking up to this point.</p><br/><p>‘You bastard. You think I’m going to leave you alone? I remember your face. You are now… On the Blacklist.’</p><br/><p>Blacklist.</p><br/><p>As Flame Warrior-V spoke what was on his mind.</p><br/><p>“Yo. Let’s put him on the blacklist.”</p><br/><p>Arirangcar frowned again.</p><br/><p>‘This guy’s gotten crazy again. Ugh.’</p><br/><p>He was a bug killer because he liked the legal PK aspect of it but his friend, who was in it for money, rarely let things pass with just a simple laugh.</p><br/><p>Anybody that made his life harder was somebody he needed to kill.</p><br/><p>Arirangcar thought of the guy from before.</p><br/><p>‘You’re going to suffer for a while.’</p><br/><p>That guy was seriously strong.</p><br/><p>But once he got onto the Blacklist, only the road of suffering would be remaining.</p><br/><p>Even more so if he was stronger.</p><br/><p>The stronger he was and the less he died, the more suspicions will stack up.</p><br/><p>Since he would need to die in order to get rid of the suspicions.</p><br/><p>‘Well. He really is a bit suspicious. To be so strong.’</p><br/><p>He wasn’t sure but that guy was indeed suspicious.</p><br/><p>There’s a limit to how good one’s control could be.</p><br/><p>Arirangcar spoke towards Flame Warrior-V.</p><br/><p>“Putting somebody on the Blacklist is your choice but… The situation doesn’t seem that good right now.”</p><br/><p>“Huh? Why?”</p><br/><p>“Look over there.”</p><br/><p>Flame Warrior-V looked around the War Fortress.</p><br/><p>And finally he could see things that he couldn’t before due to being to angry.</p><br/><p>Countless soldiers and knights clad in steel were walking around.</p><br/><p>They were clearly different from players who each had their individual outfits, they were all wearing uniform sets of armors.</p><br/><p>Flame Warrior-V gulped down his saliva as he looked at the thousands of soldiers marching through the War Fortress.</p><br/><p>Though they looked like a large group of crappy soldiers, they knew exactly what those soldiers were after playing this game for so long.</p><br/><p>“Fuck...I wondered what the ruckus from before was, did a guy accept a war related quest and blow it up?”</p><br/><p>Flame Warrior-V realized what had happened in the underground maze and frowned.</p><br/><p>……………………………..</p><br/><p>“Heheheheheh.”</p><br/><p>A player was crossing through the players and was heading towards the western castle gate.</p><br/><p>Ecliptic Mania, who had blown up the bomb, revived on the saved spot and was heading out of the War Fortress.</p><br/><p>If one left through the west gate and followed the path then they would arrive at the Korin Kingdom.</p><br/><p>‘They told me that a large amount of rewards was prepared for me right?’</p><br/><p>Ecliptic Mania thought of the words of the female who had given him the quest and then smiled.</p><br/><p>He was poor from spending all the money he had to get to this place anyway.</p><br/><p>After finding out that he didn’t belong here, there was no other reason to stay.</p><br/><p>He didn’t know why he needed to blow up that bomb and what that did but one thing was clear.</p><br/><p>That he would’ve died from that explosion.</p><br/><p>‘I hope those guys melted down well. I wonder if the guards got cooked well. Pity I couldn’t see it with my own eyes.’</p><br/><p>Ecliptic Mania felt good as he thought of Kameira, Hansoo and the NPC guards who annoyed him melting away and started to hum.</p><br/><p>It didn’t matter what had been caused by what he had done.</p><br/><p>Since he just needed to move on and start his second game life.</p><br/><p>He didn’t want to have a complicated life in game.</p><br/><p>What he wanted to do was adventuring not politics.</p><br/><p>‘Goodbye. Damned War Fortress.’</p><br/><p>As Ecliptic Mania spat and was about to move towards the city gates in the distance.</p><br/><p>Phooosh!</p><br/><p>A spear penetrated into Ecliptic Mania’s heart.</p><br/><p>“...Huh?”</p><br/><p>This was not something that should happen the moment he revived in the village.</p><br/><p>Ecliptic Mania cursed out loud at his body that was slowly becoming transparent as he turned around.</p><br/><p>To curse the person off before he logged out.</p><br/><p>“Which bastard is it! Do you know what the penalties are for PKing in town…”</p><br/><p>But Ecliptic Mania was shocked as he turned around.</p><br/><p>Since somebody extremely famous was standing there.</p><br/><p>“Uh….Huh…?”</p><br/><p>Ecliptic Mania was shocked as he looked at the general who was armored from top to bottom.</p><br/><p>It wasn’t a player.</p><br/><p>It was an NPC in charge of the War Fortress.</p><br/><p>The person who stood at the apex of this place.</p><br/><p>Great General, </p><br/><p>Estimated level 400.</p><br/><p>This man was the one who was in charge of everything in the War Fortress and the one who protected the kingdom at the very frontlines of war.</p><br/><p>As Ecliptic Mania was shocked to silence by the aura of the great general.</p><br/><p>Cykrus sniffled a bit and then spat towards Ecliptic Mania who was disappearing in golden light.</p><br/><p>“Scent of the Demon...You were the one who caused the trouble below.”</p><br/><p>‘Fucking immortal bastard. Does he even know what’s below that place.’</p><br/><p>Cykrus grinded his teeth as he looked at the man disappearing in front of him with a cold expression.</p><br/><p>…………………………..</p><br/><p>Rumble.</p><br/><p>“Ugh…”</p><br/><p>Christopher looked around his surroundings.</p><br/><p>He could only see zombies now.</p><br/><p>All the decent players had escaped and the weaker ones had been logged out.</p><br/><p>He had realized on the way here but these things were no pushovers.</p><br/><p>That was why the bug killer’s formation had been broken apart.</p><br/><p>He wasn’t sure about how many of these guys he would need to deal with on the way down.</p><br/><p>As Christopher stared at the wave of zombies filling in the space cleaned up by the bug killers in a daze.</p><br/><p>Hansoo spoke towards Christopher.</p><br/><p>“We’re going down now. You have a skill to find the path right? Go. Find the road to the 2nd floor.”</p><br/><p>This place was a maze.</p><br/><p>He would find it eventually but it would be faster for somebody who had a tracker type skill.</p><br/><p>Hansoo finished his words and headed forward.</p><br/><p>Towards the hundreds of infected soldiers.</p><br/><p>‘What is he going to do…’</p><br/><p>As Christopher and the others were making confused expressions.</p><br/><p>Kyaaaaak!</p><br/><p>“Shit!”</p><br/><p>The people, who had been focused onto Hansoo, freaked out at the screams from their surroundings and then looked around.</p><br/><p>This was not the time to be in a daze.</p><br/><p>They needed to carry their own weight if they didn’t want to become baggage.</p><br/><p>Then.</p><br/><p>Booooom!</p><br/><p>“Huh?”</p><br/><p>Everyone turned around subconsciously at the huge explosive sound.</p><br/><p>And then freaked out.</p><br/><p>Hundreds of soldiers had been blown apart.</p><br/><p>A tunnel of corpses created by dead zombie soldiers.</p><br/><p>And Hansoo who was letting off steam from his entire body.</p><br/><p>‘He didn’t use this before...He was holding back his strength huh…’</p><br/><p>Christopher stuttered at the tremendous change that had occurred in such a short moment and asked.</p><br/><p>“Wha..What..What is that?”</p><br/><p>“I tried altering it a bit.”</p><br/><p>Kiiiiiiiiing!</p><br/><p>Everyone flinched as they saw the two dragons which had started to swirl around the tip of the spear with a strange noise.</p><br/>\n</div>"}