{"title": "Chapter 233 : The Great Seal (3)", "id": 233, "volume": 3, "url": "http://boxnovel.org/reincarnator-chapter-233-the-great-seal-3", "volume_title": "Volume 3", "body": "<h1>Chapter 233 : The Great Seal (3)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 233 : The Great Seal (3)</p><br/><p>Tadadadak.</p><br/><p>‘It’s really complex huh.’</p><br/><p>Christopher was shocked as he followed the man named Abanoph.</p><br/><p>Left, right, left, left, right.</p><br/><p>The Great Maze was a indeed a maze, it branched out in all directions and was extremely complex.</p><br/><p>Christopher’s brain was about to explode as he tried to remember the path.</p><br/><p>‘This...This is why the people couldn’t adventure the entire maze.’</p><br/><p>This complexity and the vastness of this place.</p><br/><p>According to one user’s estimations, the 3rd floor of the Great Maze was about ten thousand square kilometers.</p><br/><p>How long would it take to go through all this?</p><br/><p>Of course if there wasn’t any Protection Elixirs or the Ains below, the 3rd floor might’ve been completely searched.</p><br/><p>The human’s curiosity was limitless and there were countless amounts of players.</p><br/><p>But why would they search around this vast useless land here when the valuable things were below.</p><br/><p>It would be much more profitable to go down into the 4th and 5th floor of the maze and earn the Protection Elixirs from the Ains.</p><br/><p>Thanks to all these factors, many parts of the maze were left as a mystery.</p><br/><p>As if Abanoph had read Christopher’s mind, he started to laugh and speak out.“Well. This complexity is the reason why we can stay hidden. And… Because we still feel uneasy, there are like us.”</p><br/><p>“Watchmen?”Abanoph replied with an expression full of pride.</p><br/><p>“Yes. We are in charge of roaming around the maze and looking out for players.”</p><br/><p>People who roamed around the Ant Tunnel within this maze, hide amongst the players to accomplish their goals.</p><br/><p>Of course it consisted of people who can very adapt fooling others into thinking they are a player and run away quickly in times of danger.</p><br/><p>The Watchmen, like Abanoph, had 2 main roles.</p><br/><p>First.</p><br/><p>Lead players, who might go astray and accidentally reach their village, somewhere else.</p><br/><p>Second.</p><br/><p>Find Adventurers within the maze, look them over and pull them into the village.</p><br/><p>“We need to help each other when we’re all being chased. At least here.”</p><br/><p>“...”Christopher looked at Abanoph with a new look.</p><br/><p>He didn’t have a great impression of him because they had met in very suspicious and hostile circumstances but for him to be doing such good deeds.</p><br/><p>If everything that guy had said was true then they were basically acting as a sanctuary for the surviving adventurers.</p><br/><p>Abanoph spoke to Christopher with a heavy expression.“I’m not actually not sure if I’m doing the right thing. For me to bring you guys, who are on the blacklist, into this place…”</p><br/><p>It might’ve been different for unknown adventurers but those who were on the blacklist usually got chased down quite meticulously.</p><br/><p>There was another huge problem.</p><br/><p>If they find out that this person did not leave the maze then there are those who would search every nook of this maze.</p><br/><p>Those who would search this humongous place in order to find that one person.</p><br/><p>‘Scarlet Demons… Damned bastards.’</p><br/><p>Abanoph grinded his teeth as he remembered his clan of the past which had been killed off after being chased to the end of the world.</p><br/><p>His clan leader was at level 250 in this world’s standards.</p><br/><p>He was much stronger than himself but couldn’t escape the Scarlet Demon’s chase and had died before he reached the Ant Tunnels.</p><br/><p>A group created to just keep their pride.</p><br/><p>That was the main reason why they were even more careful and even more meticulous than others.</p><br/><p>‘I have no idea what the leader wants to do.’</p><br/><p>Abanoph started to quickly move out as he shook his head.</p><br/><p>He was curious but he did not question the leader.</p><br/><p>Since he would’ve long been ripped apart by the players if the leader hadn’t pulled him into the Ant Tunnels.</p><br/><p>The reason why he had become a Watchman was to repay what little he could.</p><br/><p>As well as saving those who are in similar situations as him.</p><br/><p>Toong Tootoong.</p><br/><p>Abanoph suddenly made a strange noise inside the maze.</p><br/><p>And from afar a similar noise echoed.</p><br/><p>Similar but a bit different.</p><br/><p>“We’re almost here. Come on.”</p><br/><p>Hansoo, as he watched Abanoph’s actions, figured out how these people had been able to survive inside the Maze for so long.</p><br/><p>‘So they don’t stay in one place huh.’</p><br/><p>Because then there wouldn’t be a need to alter their routes by sending signals every so often.</p><br/><p>At the same time he felt very sad.</p><br/><p>About the people here.</p><br/><p>They had to constantly move around in case they got caught.</p><br/><p>They were living in a constant state of danger.</p><br/><p>But even before Hasnoo could finish his thoughts.</p><br/><p>A faint light appeared in the distance and lit up the paths of the maze.</p><br/><p>At the same time.</p><br/><p>Something that looked like a trailer could be seen in the distance.</p><br/><p>Trailers that resembled camping cars.</p><br/><p>“Huh…”As Christopher and the others exclaimed out loud at the presence of other people.</p><br/><p>Abanoph sighed and spoke.“We’re here. There’s space for you guys too so… Take a break.”Abanaoph looked at the empty trailers out of the hundreds and spoke with a bitter expression.</p><br/><p>……………………………………………..</p><br/><p>“Ugh… Be a bit more gentle.”“Shut up. You can regenerate the injuries on your leg if you use regeneration skills anyway. Just wait a bit more.”“Fucking hell. Just because it’s not your own leg…”Christopher and the others felt relieved as they started to heal their injuries.</p><br/><p>Well, they hadn’t really dropped their guard yet.</p><br/><p>Though they had followed Hansoo, they didn’t know if the people here would be friendly or hostile to them.</p><br/><p>Even more so as they saw the eyes of hundreds of others who were looking at them with uncomfortable gazes.</p><br/><p>But the reason why they had felt so relieved was because of the scenery inside the trailers.</p><br/><p>Extremely familiar looks.</p><br/><p>“So it’s not just the exterior that looks like camping cars huh.”“The interior is the important part.”</p><br/><p>Abanoph replied to the people who had been looking at the camping cars with shocked expressions.</p><br/><p>TVs, sinks, beds and even simple drawers.</p><br/><p>There was actually a picture which seemed to have been made from dyes.</p><br/><p>‘...A couple?’</p><br/><p>As Christopher frowned at the portrait with a man and a woman, Abanoph kindly answered him from beside him.</p><br/><p>“These are people who had lived here previously. They were both Watchmen. They both got chased and became a couple after coming into the Ant Tunnels.”“...”</p><br/><p>Christopher asked carefully after realizing what Abanoph’s words meant.</p><br/><p>“...So it’s not completely safe huh?”“Ha.”</p><br/><p>Abanoph scoffed at those words.</p><br/><p>Complete safety.</p><br/><p>There was no place where a cockroach would be safe where humans lived.</p><br/><p>Since the cockroaches were just .</p><br/><p>It was the same in this world.</p><br/><p>No matter how well they hid, there would be traces and tails sticking out.</p><br/><p>There were about 900 people here.</p><br/><p>And about 50 to 100 people came in every year.</p><br/><p>People who had been chased into the end and came into the Great Maze in case there was a hiding place here and had gotten rescued by Watchmen like himself.</p><br/><p>But this number did not change from year to year.</p><br/><p>Since a similar amount got killed by bug killers and players.</p><br/><p>They couldn’t just sit idle here hidden, they had to find things to eat and hunt as well.</p><br/><p>They needed to raise their strengths like this and prepare to head towards the logout zone.</p><br/><p>Of course there was no way to not get caught in the eyes of players and a large amount of people being sacrificed was normal.</p><br/><p>‘But living in this much luxury is not bad.’</p><br/><p>The interiors which resembled the modern days was to just allow them to remember the place where they had lived in peace.</p><br/><p>Of course there were no mechanical tools but they, with their monstrous strengths, could easily twist around metal boards to make things which resembled items such as TVs.</p><br/><p>This was the reason why pulling these things around wasn’t hard for them.</p><br/><p>Abanoph looked at the traces of the dead and then spoke towards Christopher.</p><br/><p>“Well. It’s just replicas but you can alter the interiors any way you like. Since these things were all custom made to one’s own likings. There are some things stacked over there so you can bring some from there. Return the ones here back there too.”“...”</p><br/><p>“Well we need to recycle or something right? Hurry and go.”“It doesn’t seem like there’s much of a reason to. There’s no guarantee we’ll be staying here.”“...Ah.”</p><br/><p>Abanoph stopped.</p><br/><p>These guys were indeed irregulars.</p><br/><p>He didn’t know what would happen to these guys.</p><br/><p>He had forgotten because there had been nobody else before who had come here and had left.</p><br/><p>And this pissed him off.</p><br/><p>‘Fuck. They really display the fact that they just came up.’</p><br/><p>Those who had been chased for a long time were afraid of leaving this place.</p><br/><p>But for him to think about leaving.</p><br/><p>‘You guys need to know you are lucky. To meet such a powerful person.’</p><br/><p>Abanoph made an annoyed expression and then spoke towards Hansoo.“Oh, right. Let’s get to the main point then. If you healed enough then let’s go. The leader’s on the inside.”</p><br/><p>“...”</p><br/><p>The adventurers walked out from their camping cars at Abanoph’s words, walked through the eyes of those who were on guard against them and headed towards the camping car at the center of the entire place.</p><br/><p>………………………………………….</p><br/><p>“Welcome. I am the leader of this place. Kamiyou.”</p><br/><p>Christopher and Hansoo looked at the man who had an artificial leg in front of them.</p><br/><p>They knew what this man had gone through from just looking at this leg.</p><br/><p>Hansoo spoke towards the man.</p><br/><p>“Why did you call us?”Kamiyou laughed at Hansoo’s question and replied.</p><br/><p>“Befoore that, let me ask you a question. Why are you trying to go down?”Everybody else looked at Hansoo as well.</p><br/><p>They were curious as well.</p><br/><p>But before Hansoo could reply.</p><br/><p>Kamiyou laughed as he replied.</p><br/><p>“Are you perhaps trying to rip out the God’s Destruction Maul and destroy the Great Seal that is placed upon this place?”Then.</p><br/><p>The surrounding people made confused expressions.And Hansoo frowned.</p><br/><p>Kamiyou laughed as he looked at Hansoo.</p><br/><p>“I’ve gone through a lot of things here. And I’ve met a lot of people while living here. And out of those… I’ve even met those who weren’t human.”“...You met the Ains huh.”Kamiyou nodded.</p><br/><p>“Yes. Well...meeting the Ains is not really special. I’ve actually met a special Ain. I’ve met the one who was leading the Ains who had been sealed below. He seemed to have a lot of special tricks.”</p><br/><p>Hansoo realized what this man had heard after hearing up to this point.</p><br/><p>And how he knew about his own plan.</p><br/><p>‘He met the Prophet huh.’</p><br/><p>Ain.</p><br/><p>The race who had the protection of the Spirits.</p><br/><p>The one who had the protection from the Great Spirit, could see the future and had received the role to lead the race.</p><br/><p>Prophet.</p><br/><p>Hansoo looked at the man who had met the Prophet with an amused expression.</p><br/><p>**Please read the post notes for details. Thank you</p><br/>\n</div>"}