{"title": "Chapter 243 : Unsealing (5)", "id": 243, "volume": 3, "url": "http://boxnovel.org/reincarnator-chapter-243-unsealing-5", "volume_title": "Volume 3", "body": "<h1>Chapter 243 : Unsealing (5)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 243 :Unsealing (5)</p><br/><p>Hansoo scoffed.</p><br/><p>‘This is why the players who found this previously couldn’t use the flail huh.’</p><br/><p>He had thought something was amiss when he heard about it in the past.</p><br/><p>Because the flail wasn’t in the hands of the person who had found it.</p><br/><p>Back then, he had thought that there might’ve been a specific reason but he knew now.</p><br/><p>‘He wasn’t good enough probably.’</p><br/><p>Hansoo mumbled.</p><br/><p>Those players probably didn’t have the ability to withstand the test of the physical body nor had the ability to accept their deal.</p><br/><p>That’s probably the reason why they went to find that man.</p><br/><p>‘Jang Oh.’</p><br/><p>Hansoo laughed in a cold manner as he thought of the previous owner of the flail.</p><br/><p>Jang Oh didn’t declare a war against the empires.</p><br/><p>But the seal itself had been broken properly and the 6h Great Change had still occurred.</p><br/><p>Jang Oh had used the weapon and pissed many people off and was able to use the strength..</p><br/><p>Which meant that they had some form of deal.</p><br/><p>Which meant one thing.</p><br/><p>‘That this isn’t a necessity.’</p><br/><p>Hansoo laughed coldly as he spoke.</p><br/><p>“Yeah? Then let’s not do this.”</p><br/><p>Hansoo nodded as he looked at the spirit which had a shocked expression.</p><br/><p>‘Heh, pretending to be calm.’</p><br/><p>They had said it themselves.</p><br/><p>That it’s been 800 years since somebody came in.</p><br/><p>Well, there had been a reason to it.</p><br/><p>The powerhouses of the kingdoms and empires who exceeded well over the limit of level 250 never even had the thought of obtaining the flail for themselves.</p><br/><p>They wouldn’t dare breaking the seal they set up themselves.</p><br/><p>And the players, who had a level limit, couldn’t pass this test.</p><br/><p>Even if they could pass the test of the physical body, they would never be able to pass the test of the soul.</p><br/><p>Which meant one thing.</p><br/><p>‘Could you guys really reject me? A ray of hope that finally came after 800 years?’</p><br/><p>Even if it wasn’t him, the seal here would break in about a year anyway.</p><br/><p>Since he wasn’t the only person in this world who could pass this test.</p><br/><p>But in these spirit’s point of view, the story is a bit different.</p><br/><p>Since they wouldn’t know about such a thing.</p><br/><p>Hansoo continued to speak.</p><br/><p>“I understand that the strength you guys can give me is enticing. But have some conscience. You know how powerful the kingdoms and empires are for yourself but you want me to destroy all of them with just this?”</p><br/><p>“Making an enemy out of all the kingdoms and empires, it’s better to just give up this strength. It’s not like I’ll fall behind anybody in terms of strength anyway.”</p><br/><p>Actually, he couldn’t give up the flail.</p><br/><p>Since he had to release the seal on the Ains no matter what.</p><br/><p>But these guys didn’t know that.</p><br/><p>Logically, someone like him wanting to break the seal on the Ains is a pretty stupid thing to do.</p><br/><p>As he expected.</p><br/><p>Unlike the expression of the leader, the faces of those behind him started to turn dark.</p><br/><p>The expression of the leader turned grim as well but he soon sighed.</p><br/><p>Since all of Hansoo’s words were correct.</p><br/><p>&lt;...Fuck off then. Bastard.&gt;</p><br/><p>They were trapped here so they knew.</p><br/><p>Though they had the strength from the mana node, the magic brigade of the kingdoms could easily suppress them.</p><br/><p>It was indeed one of the 3 godly treasures but this also meant that there were two other objects in the empire just like it.</p><br/><p>They had a tremendous amount of hatred held inside them but they were still losers.</p><br/><p>They would only burn in rage while being trapped in here.</p><br/><p>That man wouldn’t be able to smash apart the kingdoms and empires with just this flail.</p><br/><p>‘Maybe if it was the legacy of that person who almost destroyed the world.’</p><br/><p>Then.</p><br/><p>Hansoo continued to speak.</p><br/><p>“Well, it’s not like I’m not interested in this strength either. It’s really tempting. Having more strength is always a good thing as you know.”</p><br/><p>&lt;...What are you trying to say?&gt;</p><br/><p>The leader spat out as if he was trying to hold onto a last bit of hope.</p><br/><p>Though the man was saying such words, there was no greed within his eyes.</p><br/><p>He had the eyes of someone who had nothing much to lose.</p><br/><p>Hansoo laughed as he spoke.</p><br/><p>“Let’s have another deal. Something you and I can both agree on.”</p><br/><p>&lt;...Say it then.&gt;</p><br/><p>The leader didn’t like this situation but it wasn’t like he could do anything else.</p><br/><p>He couldn’t give up this chance that had finally come after 800 years when he didn’t know when the next one would be.</p><br/><p>Hansoo laughed as he looked at the man.</p><br/><p>………………………………………..</p><br/><p>Boooooooom!</p><br/><p>A blade covered in flames flew towards Kamiyou.</p><br/><p>An attack which burnt all the surrounding atmosphere.</p><br/><p>The flame held within the spirit stone, .</p><br/><p>A head on fight was not possible.</p><br/><p>The war fortress wasn’t a famed location for no reason.</p><br/><p>The spirit stone was something that distinguished people even at the master player level.</p><br/><p>Then.</p><br/><p>Whooosh!</p><br/><p>Seven different skills exploded out from Kamiyou’s body at the same time.</p><br/><p>The skills which exploded out worked together with each other to twist the space and push back the air and pulled Kamiyou’s body back.</p><br/><p>Zwoooosh!</p><br/><p>Sharon Stiller frowned as she looked at Kamiyou backing off with an amazing amount of control.</p><br/><p>‘Not bad…’</p><br/><p>Sharon Stiller made an annoyed expression as she looked at Kamiyou in front of her, who was buying time.</p><br/><p>At first she was quite happy.</p><br/><p>The one she was the most worried about was nowhere to be seen and the bug players who might’ve ran away were all gathered here and were prepared to fight her.</p><br/><p>Dealing with everyone here and then receiving a reward from Arthus Krancheska above would be the perfect outcome of course.</p><br/><p>If the Scarlet Demons helped her to push them back then it would be easy to swipe them all off.</p><br/><p>But this damned bastard was holding on with all his might.</p><br/><p>The bug players having great control was an obvious thing but the attitude of these guys was the issue.</p><br/><p>They were working with each other and blocking the Scarlet Demon’s attacks even by giving up a leg and an arm for their comrade as they slowly reduced the numbers of the Gold Demons.</p><br/><p>‘Though we would still win at this rate…’</p><br/><p>Sharon Stiller frowned as she looked at Kamiyou spinning around her at an extremely fast speed and looking for an opening.</p><br/><p>She would still win at this rate.</p><br/><p>Though these guys were fighting back pretty well, the dead Gold Demons could just rejoin them with the Stone of Immortality.</p><br/><p>Since their numbers were slowly decreasing.</p><br/><p>But one thing was on her mind.</p><br/><p>Chiiiiiiik.</p><br/><p>‘That. What the fuck is that thing.’</p><br/><p>Sharon Stiller stopped fighting and then looked at an object in the center of the crosses.</p><br/><p>A red, egg shaped object that was surrounded by something stood in the center of the crosses and was radiating heat in all directions.</p><br/><p>Not just heat but steam and smoke as well.</p><br/><p>The heat was so intense that it was burning up everything around it and was even covering the entire space with smoke.</p><br/><p>And this smoke was also interfering with the fight.</p><br/><p>Unlike themselves, who were quite dependent on vision, the bug players were not.</p><br/><p>They were much more advantaged in a place like this, filled with smoke.</p><br/><p>Well, the smoke itself wasn’t that much of an issue.</p><br/><p>Sharon Stiller was actually feeling something off from that mysterious object.</p><br/><p>The person who she was the most afraid of was nowhere to be seen.</p><br/><p>And instead there was a strange ball of red veins.</p><br/><p>‘I thought we were going to end it quickly but...They’re holding on quite well.’</p><br/><p>Sharon Stiller frowned as he looked at Kamiyou who was making strange sounds and gestures and giving people orders.</p><br/><p>Because of this man’s leadership, the bug players were being even more annoying.</p><br/><p>‘Just a traitor...Pretending to be a leader. Annoying.’</p><br/><p>Then.</p><br/><p>Sharon Stiller smiled faintly.</p><br/><p>‘Heheh. Just a traitor indeed. ’</p><br/><p>Don’t the ones whose accounts were getting erased over there have any right to know?</p><br/><p>Sharon Stiller surrounded her body in flames and shouted.</p><br/><p>“Hahaha! Aren’t you guys curious? How we found you guys so easily?”</p><br/><p>‘Fuck.’</p><br/><p>Kamiyou used a few more skills to block Sharon Stiller’s mouth but it was all futile.</p><br/><p>The thick wall that had been born from the flames melted all of Kamiyou’s mana.</p><br/><p>And Sharon Stiller stared at Kamiyou’s actions and smiled as she spoke.</p><br/><p>And as she expected.</p><br/><p>A look of curiosity appeared in the faces of the adventurers.</p><br/><p>‘No way. Kamiyou?’</p><br/><p>‘Our leader betrayed us?’</p><br/><p>There’s no other reason but this.</p><br/><p>Since they were all suppressed by Kamiyou’s trait, .</p><br/><p>If a traitor existed then Kamiyou was the only suspect.</p><br/><p>Then.</p><br/><p>“Bastards! Trying all sorts of methods because it’s not going your way! Get lost!”</p><br/><p>Einchel suppressed her uneasy mind and shouted.</p><br/><p>Even if that bitch’s words were right, she couldn’t accept them now.</p><br/><p>In a situation where every bit of strength of mattered, even a bit of doubt could be extremely fatal.</p><br/><p>If they found out that their leader was a traitor, who would listen then?</p><br/><p>‘It’s not too late to ask… After we finish.’</p><br/><p>The most important thing right now was surviving through this situation.</p><br/><p>Then.</p><br/><p>Sharon chuckled and signaled Olsen.</p><br/><p>Whooosh!</p><br/><p>A tremendous amount of chill exploded out from Olsen’s body and rushed towards Kamiyou.</p><br/><p>‘Ugh.’</p><br/><p>The moment Kamiyou was about to dodge the wave of frost by jumping up.</p><br/><p>Whooosh!</p><br/><p>Large amounts of flames exploded out from Sharon Stiller’s body and stopped Kamiyou’s movements.</p><br/><p>‘Fuck!’</p><br/><p>In the small moment Kamiyou was stopped from both of their attacks.</p><br/><p>Crackle!</p><br/><p>Kamiyou’s artificial leg was frozen from the ice spell.</p><br/><p>And then the storm of flames rushed over his body.</p><br/><p>And Kamiyou clenched his teeth as he smashed his artificial leg.</p><br/><p>Boom!</p><br/><p>The fake leg broke from Kamiyou’s hand and he jumped into the air after he was set free from Olsen’s ice.</p><br/><p>Tatak!</p><br/><p>Olsen and Sharon Stiller failed their attacks and Kamiyou escaped but their expressions reflected the opposite.</p><br/><p>Sharon Stiller laughed towards Kamiyou who had a grim expression as she pulled out Kamiyou’s artificial leg and started to melt it with her flames.</p><br/><p>Drooop.</p><br/><p>Soon.</p><br/><p>The artificial leg couldn’t handle the expansion and deflation from the heat and the chill and broke apart.</p><br/><p>And something fell out from it.</p><br/><p>A strange-looking artifact.</p><br/><p>Sharon Stiller showcased the artifact in the air a few times and then spoke with a smile.</p><br/><p>“Isn’t having such an amazing tracker like this within one’s body a fantastic proof of him being on our side?”</p><br/><p>Mumble mumble.</p><br/><p>In an instant.</p><br/><p>The mumbles of the surrounding people got louder and Kamiyou clenched his teeth.</p><br/><p>‘Fuck.’</p><br/><p>The last shackle that those guys had put on him.</p><br/><p>Kamiyou made an expression of despair as he thought of Himura’s laugh in the past.</p><br/>\n</div>"}