{"title": "Chapter 245 : Unsealing (7)", "id": 245, "volume": 3, "url": "http://boxnovel.org/reincarnator-chapter-245-unsealing-7", "volume_title": "Volume 3", "body": "<h1>Chapter 245 : Unsealing (7)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 245 :Unsealing (7)</p><br/><p>The curse of the Ains.</p><br/><p>This was a curse that one would receive once they killed Ains below the 5th floor.</p><br/><p>The moment the Ains were killed, a strange aura came out from their body and surrounded those who assisted in killing them.</p><br/><p>Then a strangely shaped symbol would remain in their body. The players called this the Curse of the Ains due to it being the final trace they left behind.</p><br/><p>Of course the players didn’t give a single damn.</p><br/><p>Maybe if this caused some form of penalty but there were none.</p><br/><p>The protection elixir that dropped from killing them was more important than some lousy curse so they continued to climb down to the 5th floor and killed off Ains.</p><br/><p>But BKamiyou heard something else.</p><br/><p>That was how he got the blessing.</p><br/><p>And this blessing had one purpose.</p><br/><p>‘Being able to partly control the ability of the Ains… Who were born with the right to control the spirits and elements.’</p><br/><p>Well, this had no meaning.</p><br/><p>They only had the right to use the strength, they had no spirits to control.</p><br/><p>It was more like a license.</p><br/><p>A license given to those who were allowed to control the tremendous amount of strength the spirits contained.</p><br/><p>But the story was different now.</p><br/><p>Since that strength was in front of his eyes.</p><br/><p>Whoooosh!</p><br/><p>The symbol in Kamiyou’s body started to devour the flames.</p><br/><p>The fragment of the strength created from the that was created from the congregation of a spirit during its destruction.</p><br/><p>“Uh? Huhh?”</p><br/><p>He could see Sharon Stiller staggering with a shocked expression in the distance.</p><br/><p>‘She probably never even saw such a thing happening.’</p><br/><p>Kamiyou mumbled as he looked at Sharon Stiller.</p><br/><p>Of course she hadn’t.</p><br/><p>All the players here had lost their rights to receive the blessing the moment they killed the Ains.</p><br/><p>It was obvious they haven’t heard about somebody being able to absorb the power of the Spirit Stones.</p><br/><p>But Kamiyou couldn’t laugh in victory.</p><br/><p>He realized.</p><br/><p>Why the prophet had warned him against borrowing the strength of the Spirit Stones before going into the Spirit Land.</p><br/><p>‘Kuhuk!’</p><br/><p>Kamiyou coughed out blood as he felt something breaking apart in a corner of his body.</p><br/><p>License, the blessing of the Ains protected one from their bodies getting destroyed and melting down from the powers of the spirits.</p><br/><p>But handling this strength was a whole another matter.</p><br/><p>A power birthed from the essence of nature.</p><br/><p>It was not something the humans could handle.</p><br/><p>He needed something to control this power.</p><br/><p>And outside the spirit stone, there were no such kind beings that would help Kamiyou.</p><br/><p>At least there was a bit of thought existing within the Spirit Stones so it helped people in controlling their power but Kamiyou didn’t even have such a thing.</p><br/><p>And he had forcibly stolen that strength and stored it within his body, there was no way his body would remain intact.</p><br/><p>The powerful scarlet energy that raged inside his body like a crazed bull.</p><br/><p>The effects of that energy.</p><br/><p>His insides were getting destroyed at a rapid pace.</p><br/><p>‘Well...I sealed one at least.’</p><br/><p>Kamiyou mumbled as he coughed up blood.</p><br/><p>He could see Sharon Stiller freaking out as she saw her Spirit Stone slowly turning dim.</p><br/><p>Of course his body was breaking down.</p><br/><p>The story might’ve been different if it was a tiny spirit stone but he had absorbed the power of a S-level Spirit Stone that had reached the peak of its power.</p><br/><p>Even if it was him, this was far beyond the limits of his body.</p><br/><p>And his body was already about to break down.</p><br/><p>His body slowly turned red as if he had swallowed lava and was creating smoke.</p><br/><p>Even if he could let out all this energy, his body would still slowly melt and break down.</p><br/><p>To the point of him not being able to recover.</p><br/><p>But there was a method to actually use the tremendous amount of energy in his body.</p><br/><p>‘I’m going to die anyway.’</p><br/><p>Kamiyou gazed at the Scarlet and Gold Demons who were staring at him in a daze and then signalled Einchel who was looking at him in shock.</p><br/><p>He could still trust Einchel.</p><br/><p>Since she had helped him for so long, there wouldn’t be much of an issue.</p><br/><p>“Wait…!”</p><br/><p>Even before Einchel could reply.</p><br/><p>Boooom!</p><br/><p>Kamiyou gathered the overflowing energy into his one remaining foot, blew it up and then jumped into the air.</p><br/><p>Towards the center of the Scarlet Demons who were staring at him in a daze.</p><br/><p>Kamiyou closed his eyes while watching the Scarlet Demons who were trying to cut him down even in the midst of all this.</p><br/><p>It didn’t matter anymore.</p><br/><p>‘Finally, I can rest in peace. It’s been a while since I saw them.’</p><br/><p>Things had been way too hard both mentally and physically up until now.</p><br/><p>The guilt from betraying the other adventurers and the uneasiness of not knowing when Himura’s Ant Eater clan would crash in.</p><br/><p>The thing that filled his day was not the comfort of surviving another day but anxiety about what would happen tomorrow.</p><br/><p>He was holding on day by day because of the adventurers who had gathered while believing in him and his friends who were captured by Himura but he wanted to rest now.</p><br/><p>Since all the hostages would’ve been dead by now.</p><br/><p>‘I’m going Hansoo. And Einchel, please treat her well.’</p><br/><p>As he finished his thoughts.</p><br/><p>Kamiyou followed his urge and released the Ain’s blessing that suppressed the intense amount of energy that was holed up inside his body.</p><br/><p>Towards the Scarlet and Gold Demons in front of him.</p><br/><p>Kamiyou smiled as he felt that energy exploding out from his body.</p><br/><p>Then.</p><br/><p>Boooooooooooom!</p><br/><p>A tremendous amount of heat exploded out from Kamiyou’s body and into the Gold and Scarlet Demons.</p><br/><p>……………………………………………….</p><br/><p>Chiiiiiiiiiiiiik.</p><br/><p>A large amount of steam and smoke filled the entire area.</p><br/><p>And Einchel stood within that smoke looking towards the location where the explosion took place.</p><br/><p>The explosion was so powerful that she and the other adventurers couldn’t escape it but that flame didn’t hurt their bodies even a bit.</p><br/><p>No, the flame instead covered their body and warmed them up.</p><br/><p>As if it could distinguish between enemy and friends.</p><br/><p>Christopher was shocked at this.</p><br/><p>‘The attacks of the spirits...I heard they could target specific people.’</p><br/><p>It was different from their skills that didn’t discriminate and caused damage to everything.</p><br/><p>The power was secondary, this was a strength that could distinguish between friends and foe in detail.</p><br/><p>That was why it shone in a fight like this where the opposing sides were scrambled.</p><br/><p>‘...But it seems there was a limit in discerning the foe huh. At least to him.’</p><br/><p>Christopher thought of Kamiyou with a pitiful expression.</p><br/><p>He didn’t know about the effects of the symbol but it was clear that there was a limit to it.</p><br/><p>Since if there wasn’t such a limit, he wouldn’t have decided to go to such an extreme length as self-destruction.</p><br/><p>Christopher sensed the meager amount of heat and then sighed in relief.</p><br/><p>‘Well… We can at least hold on now.’</p><br/><p>Though they still had the Stone of Immortality, those guys over there would’ve probably used the stone once already from the explosion.</p><br/><p>They could handle this much.</p><br/><p>‘And… It seems their suspicions died out now.’</p><br/><p>Everyone’s expressions were frozen from Kamiyou’s sacrifice.</p><br/><p>But it was clear that the suspicions and the uneasiness had been wiped away.</p><br/><p>As Christopher made an expression of relief.</p><br/><p>Whoooosh.</p><br/><p>A chill ran up Christopher’s body.</p><br/><p>And he stopped.</p><br/><p>‘...A chill?’</p><br/><p>Even if the heat didn’t have any effect on them, there was no reason for them to feel chilly.</p><br/><p>As Christopher made an uneasy face.</p><br/><p>Crackle crackle.</p><br/><p>The sounds of something freezing could be heard over the smoke in the distance.</p><br/><p>And as everyone put their guard up and clenched their weapons.</p><br/><p>Whoooosh.</p><br/><p>The smoke dispersed and everyone could see the new scene.</p><br/><p>The entire area was frozen.</p><br/><p>Thousands of icicles and ice walls.</p><br/><p>This frozen land was the reason why they felt the chill.</p><br/><p>‘Fuck. No way…’</p><br/><p>Crackle.</p><br/><p>“Fucking hell. Is anyone in their right minds? Who the hell is this?”</p><br/><p>Somebody broke out from the ice in the distance while cursing out loud.</p><br/><p>As if proving that this chill was the power of a spirit, he came out spotless.</p><br/><p>Crack Crack.</p><br/><p>‘Fuck.’</p><br/><p>Christopher grinded his teeth as he watched the players coming out from the ice.</p><br/><p>…………………………………………..</p><br/><p>Cracccckk!</p><br/><p>Along with the sound of something breaking, the blue lights of the gauntlets in the man’s hand disappeared.</p><br/><p>As if something that provided it with strength had broken.</p><br/><p>The man, Olsen, looked at his glove and got pissed.</p><br/><p>“You bastards. Do you even know how expensive this is? It’s an entire house. An entire fucking house.”</p><br/><p>That Spirit Stone’s price was as expensive as a house in the center of the capital.</p><br/><p>No, the price wasn’t the issue but rather the supply.</p><br/><p>But just a bit ago the Spirit Stone had broken from him using .</p><br/><p>The final card the Spirit Stones had which allowed them to exert a power numerous times more powerful.</p><br/><p>‘...It’s not like I couldn’t use it either.’</p><br/><p>Olsen grinded his teeth.</p><br/><p>The attack he had to withstand just now was most of the energy from Sharon’s spirit stone.</p><br/><p>If they faced it head on then most of the people here would’ve been logged out.</p><br/><p>And the ones in front of their eyes would’ve ran away using that small time frame.</p><br/><p>And that wasn’t something he could afford for just a single spirit stone.</p><br/><p>‘Well. The clan leader will probably buy it back for us.’</p><br/><p>Olsen blew out the remaining bits of smoke and then shouted.</p><br/><p>“Yo! Come out! Continue what you were doing up until now!”</p><br/><p>The Gold and Scarlet Demons behind him gritted their teeth as they walked out from the ice.</p><br/><p>They were a bit rattled from the previous explosion.</p><br/><p>‘Well, this is the end at least.’</p><br/><p>As Olsen walked forward.</p><br/><p>Tak.</p><br/><p>Something got in the way of his right foot and Olsen frowned as he looked at what it was.</p><br/><p>Kamiyou, whose body was bubbling all over and looked like he was about to die, was laying on the ground half dead.</p><br/><p>‘He’s alive?’</p><br/><p>Since he hadn’t actually turned himself into a bomb and instead had overheated, he could actually survive if he was lucky.</p><br/><p>It was more than possible if the chill from his spirit stone chilled his heated body.</p><br/><p>‘Well. It’s not like this guy should be happy or anything.’</p><br/><p>Although he had survived thanks to the chill, everybody else here would die.</p><br/><p>The same thing would happen to the guy by his foot.</p><br/><p>Kuduk.</p><br/><p>Olsen smiled as he kicked away Kamiyou laying on the ground like a piece of rag and then spoke to the bug players watching him with terrified expressions.</p><br/><p>“You bastards. Let’s not meet each other again. And don’t be so sad over it. Just think of it this way, you guys will stay with us.”</p><br/><p>“This fucking bastard…”</p><br/><p>Olsen laughed coldly towards Christopher who had cursed out loud.</p><br/><p>At least it wouldn’t be a worthless death.</p><br/><p>They would disappear into artifacts and experience.</p><br/><p>‘See how far we go. This is just the beginning.’</p><br/><p>As Olsen mumbled.</p><br/><p>Words came out from the clouds of smoke that filled the area which was created from the collision of heat and frost.</p><br/><p>“Staying with you guys...Not bad.”</p><br/><p>“What…”</p><br/><p>Even before Olsen could finish his reply.</p><br/><p>Kwadddddk!</p><br/><p>A hand appeared from the smoke.</p><br/><p>‘What the…! How did he get so close!’</p><br/><p>Olsen freaked out and tried to swing his gauntlet.</p><br/><p>Crunch!</p><br/><p>A tremendous amount of force flicked away Olsen’s fist and grabbed his neck.</p><br/><p>Kwaaadddddduk!</p><br/><p>“Uggghhh….”</p><br/><p>Chiiiiiii....</p><br/><p>The thick arm which had grabbed Olsen’s neck lifted him high up and the scarlet hand started to burn the area around his neck and face.</p><br/><p>Hansoo, who walked out with his scorching hot body, laughed in a cold manner.</p><br/><p>“It’s just beginning, now.”</p><br/><p>‘Become fertilizer.’</p><br/><p>Crunch.</p><br/><p>As Hansoo poured strength into his hands.</p><br/><p>The scorching hot hand smashed Olsen’s head.</p><br/><p>He wasn’t pleased with just this.</p><br/><p>A voice could be heard inside his head.</p><br/><p>Hansoo made a content expression at the loud voice in his head.</p><br/><p>He had completed his 1st task.</p><br/><p>He needed to raise his strength as much as possible before he started the 2nd task.</p><br/><p>‘I’m going to kill you all.’</p><br/><p>Hansoo, whose entire body was colored blood-red like the colors of the souls, looked at the entire maze greedily.</p><br/><p>………………………………………………..</p><br/><p>Great Maze, deep underground.</p><br/><p>Though their bodies were translucent like a lingering smoke, the existences which would have a look of a human if their bodies became clear looked towards the trembling ceiling.</p><br/><p>The damned ceiling that stopped them from heading up into the sky.</p><br/><p>The woman who was standing at the deepest part mumbled.</p><br/>\n</div>"}