{"title": "Chapter 252 : Power (3)", "id": 252, "volume": 3, "url": "http://boxnovel.org/reincarnator-chapter-252-power-3", "volume_title": "Volume 3", "body": "<h1>Chapter 252 : Power (3)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 252 : Power (3)</p><br/><p>It was one of the three godly treasures.</p><br/><p>And each one had a power.</p><br/><p>The power of the flail had been activated.</p><br/><p>Shrrrrrk.</p><br/><p>The flail started to greedily devour energy.</p><br/><p>The energy flowed through the strange mechanisms of the flail and reached a location deep inside it.</p><br/><p>At the same time the space in front of the flail started to twist.</p><br/><p>The surrounding area folded and collapsed on itself and condensed into a single point.</p><br/><p>And as the numerous colors combined, the original color changed as well.</p><br/><p>Black.</p><br/><p>An extremely dark and deep color.</p><br/><p>Soon.</p><br/><p>Ooooooong.</p><br/><p>A small hole which even devoured light appeared about 10 cm in front of the edge of the flail.</p><br/><p>‘...Ten thousand to use it just once?’</p><br/><p>The amount of energy expanded to create this tiny sphere seemed over the top.</p><br/><p>Hansoo made a shocked expression at that tremendous amount of energy as he shook the flail around.</p><br/><p>He wanted to know if the sphere was held in place.</p><br/><p>If it was then it would be a problem.</p><br/><p>But thankfully the black sphere on the top of the flail moved as Hansoo moved the flail around.</p><br/><p>As if it was connected by an invisible pillar.</p><br/><p>Krancheska frowned, seeing Hansoo playing around.</p><br/><p>“No way… How can you control it?”</p><br/><p>But Krancheska soon calmed down and gathered himself.</p><br/><p>There was no point talking about it.</p><br/><p>Since the power had been activated already.</p><br/><p>It was now time to check something else.</p><br/><p>It was time to see how powerful the God’s Flail which he had only heard about in rumors was.</p><br/><p>And if Hansoo was controlling it properly.</p><br/><p>As if Hansoo read Krancheska’s mind.</p><br/><p>Boom! Boom! Boom! Boom!</p><br/><p>Hansoo started to charge towards him.</p><br/><p>In order to smash his head apart.</p><br/><p>At the same time.</p><br/><p>Whoooosh!</p><br/><p>The Ain dispersed her body again, turned into flames and started to attack Krancheska from all around as well.</p><br/><p>‘Annoying.’</p><br/><p>Krancheska frowned.</p><br/><p>The Ain was high level and it even absorbed energy, truly an annoying thing to deal with.</p><br/><p>Whoosh!</p><br/><p>The Flame of Destruction mixed around with the mana again and its shape started to change.</p><br/><p>The flame condensed itself and soon resembled a smooth sheet of cloth and surrounded Krancheska’s body.</p><br/><p>Krancheska’s signature move which needed a flame so powerful that it could solidify, a large mana reserve to sustain it and a tremendous amount of mana control.</p><br/><p>‘I’ll gladly kill you off.’</p><br/><p>Krancheska, covered by the Red Dragon Robe, started to dance vigorously.</p><br/><p>Then.</p><br/><p>Boom!</p><br/><p>Boom! Boom!</p><br/><p>He started to counter the flames flying towards him from all around.</p><br/><p>‘Shit! Battle skills!’</p><br/><p>The Ain was dumbfounded.</p><br/><p>That robe wasn’t easy to absorb because it was extremely condensed.</p><br/><p>And despite that, Arthus showed such skills controlling it.</p><br/><p>Being the captain of the Magic Brigade, his skills were no joke.</p><br/><p>And it didn’t end there.</p><br/><p>Whoooosh!</p><br/><p>Despite already fighting so intensely, a long spear of flames appeared in the air next to Krancheska.</p><br/><p>.</p><br/><p>Unlike the robe, this was a weapon created for Krancheska to hold and swing.</p><br/><p>Krancheska grabbed the spear and swung it.</p><br/><p>Whoosh!</p><br/><p>‘Huup!’</p><br/><p>The Ain hurriedly moved away from the trajectory of the spear which was flying towards her.</p><br/><p>She was in a flame-like form, but she would still receive a fatal injury if she got hit by that spear.</p><br/><p>Krancheska smirked at the Ain running away from a single swing of his spear and then raised his spear again.</p><br/><p>Then the muscles on his entire body started to squirm.</p><br/><p>Then.</p><br/><p>Booooom!</p><br/><p>The Red Dragon Spear flew across the air while emitting a huge noise.</p><br/><p>At Hansoo who was running towards him with the God’s Flail.</p><br/><p>Kuoooooo!</p><br/><p>Hansoo tensed up as he saw the spear flying towards him.</p><br/><p>Its might was dimensions apart from a casual arrow.</p><br/><p>This is not something he could block by swinging the flail at it.</p><br/><p>Hansoo didn’t swing the flail and instead raised it like a shield in front of him.</p><br/><p>With the black orb in front.</p><br/><p>‘I’m going to trust it.’</p><br/><p>As Hansoo breathed in and out.</p><br/><p>Kuooooo!</p><br/><p>The Red Dragon Spear, which had flown in while breaking the ground underneath, collided with the black sphere.</p><br/><p>And Hansoo surrounded his ears with mana in case another huge noise was created.</p><br/><p>But there was no need.</p><br/><p>Swoosh!</p><br/><p>The moment the black sphere touched the Red Dragon Spear.</p><br/><p>The sphere started to devour the spear.</p><br/><p>The existence of the spear itself.</p><br/><p>And in a blink of an eye, the entire spear had been sucked into the sphere.</p><br/><p>And Krancheska frowned as he smacked the Ain around with his robe.</p><br/><p>‘What the. He’s using it properly. It’s just like what I heard…’</p><br/><p>The moment he saw that Hansoo was using the power properly.</p><br/><p>Whoosh!</p><br/><p>Krancheska swung his robe with a wide move and flung the Ain away.</p><br/><p>He then started to ruthlessly squeeze out mana from the prison holding the Flame of Destruction.</p><br/><p>The flames which shot out from his hands criss-crossed and folded onto each other as they shaped into an object.</p><br/><p>A shiny red shield.</p><br/><p>Krancheska raised the shield, , in front of him and then surrounded his entire body with the robe.</p><br/><p>According to what he knew, that power wasn’t just about devouring.</p><br/><p>And as he expected.</p><br/><p>The thing Krancheska was worrying about had become a reality.</p><br/><p>Boooooooom!</p><br/><p>Something started to come out from the black sphere which had eaten up the Red Dragon Spear.</p><br/><p>A red spear wreathed in flames.</p><br/><p>Krancheska’s expression turned nasty as he saw the Red Dragon Spear flying straight back at him.</p><br/><p>It didn’t feel good to be attacked by his own attack.</p><br/><p>‘What a stupid power. Fuck!’</p><br/><p>Even before he could finish his thoughts.</p><br/><p>Boooooom!</p><br/><p>The Red Dragon Spear and the Red Dragon Shield collided and caused a huge noise.</p><br/><p>A noise which was incomparable to the one created when Hansoo had smashed the arrow.</p><br/><p>“Ugh!”</p><br/><p>The Red Dragon Shield took around the same amount of mana as the Red Dragon Spear.</p><br/><p>So the shield being able to block the spear was an obvious thing but the shock wave from the collision still existed.</p><br/><p>And Krancheska groaned as he received the brunt of the shock wave.</p><br/><p>If he hadn’t dispersed most of the force using the robe then he might have broken some bones.</p><br/><p>Krancheska frowned as he stood up.</p><br/><p>If he was just trying to test if that power was real or not then there wasn’t really a need to use the Red Dragon Spear.</p><br/><p>Just an arrow would’ve been enough.</p><br/><p>He would’ve been able to block the arrow with his robe and there wouldn’t have been a need to send out the spear.</p><br/><p>But there was a reason.</p><br/><p>‘I need to hurry and exhaust that power.’</p><br/><p>That ability would cause Hansoo to be invincible.</p><br/><p>Nobody would be able to handle a power so overwhelmingly strong which could absorb and send back whatever was flown at it.</p><br/><p>If he left that alone then he would just get beaten down to death.</p><br/><p>No matter how much weaker his opponents were, he wouldn’t be able to handle being struck at non-stop.</p><br/><p>There was nothing infinite or invincible in the world.</p><br/><p>According to what he knew, that ability ate up a tremendous amount of energy to activate once and it wasn’t something that could be sustained by pouring in more energy.</p><br/><p>And it overheated after a huge load so it would take a bit of time until he would be able to use it again.</p><br/><p>Which meant that he needed to pour more energy than the amount that had been used to create it and exhaust it.</p><br/><p>Even if he had to be hit back by all those spears.</p><br/><p>‘Let’s see...Who wins. You bug-like bastard.’</p><br/><p>“Kuaaaaap!”</p><br/><p>Krancheska screamed out, created three more Red Dragon Spears and then started to swing them at Hansoo in a crazed manner.</p><br/><p>Then.</p><br/><p>Boooom! </p><br/><p>Boobooooom!</p><br/><p>An existence which controlled flames, an existence which became flames and an existence which sent back flames started to turn the entire maze into a sea of flames.</p><br/><p>………………………………………..</p><br/><p>Boooooom!</p><br/><p>Boom!</p><br/><p>Krancheska’s current situation was a mess as he fought Hansoo and the Ain.</p><br/><p>His attacks weren’t working properly in the first place and he could only use his battle skills and the robe.</p><br/><p>One of his arms had been broken and the silk-like Red Dragon Robe had been turned into tatters.</p><br/><p>Plus there were countless cuts and bruises all over his body.</p><br/><p>But despite this, the expressions of Hansoo and the Ain weren’t that great.</p><br/><p>‘A fucking monster.’</p><br/><p>The Ain mumbled in annoyance.</p><br/><p>All his main attacks had been blocked.</p><br/><p>The only thing he had was the Red Dragon Robe surrounding him and the battle skill which made use of his robe.</p><br/><p>But he was still standing.</p><br/><p>And with herself, who had eaten the flames, and a human who surpassed all humans as his opponents.</p><br/><p>Without the power of the flail, they would’ve long been shredded apart.</p><br/><p>And as if Krancheska read the Ain’s mind.</p><br/><p>“Kuaap!”</p><br/><p>Kiiiiiiiiiing!</p><br/><p>Three more Red Dragon Spears started to fly towards Hansoo.</p><br/><p>Something which Hansoo wouldn’t be able to block at his level.</p><br/><p>Hansoo dodged away from Krancheska’s fist, jumped backwards and lifted the flail in his hands.</p><br/><p>Swooosh!</p><br/><p>Three spears at the same time wouldn’t change anything.</p><br/><p>The black sphere ate up the three spears and sent them flying back.</p><br/><p>Towards Krancheska who was attacking the Ain in the distance.</p><br/><p>“Kuaaaaap!”</p><br/><p>Krancheska shouted out, lifted up the shield with his still functioning right arm and blocked the spears.</p><br/><p>Boom!</p><br/><p>One.</p><br/><p>Booooom!</p><br/><p>Two.</p><br/><p>Krancheska’s entire body shook as he blocked the spears one by one.</p><br/><p>But something changed.</p><br/><p>Craaacck!</p><br/><p>A crack appeared on the black sphere.</p><br/><p>Then.</p><br/><p>Clang!</p><br/><p>Booooooooooooooom!</p><br/><p>The black sphere broke and the Red Dragon Spear which was being prepared to shoot back blew up and swept the surrounding area.</p><br/><p>“Kuuuuuuuk!”</p><br/><p>“Aaaaaak!”</p><br/><p>“Kuuuhup!”</p><br/><p>The energy from the Red Dragon Spear didn’t discern between ally and foe as it spread out in every direction.</p><br/><p>And thanks to this, the three of them were blown away by the explosion and got separated from each other.</p><br/><p>Tat!</p><br/><p>Tatat!</p><br/><p>Tat!</p><br/><p>The three caught their balance and then glared at each other again.</p><br/><p>But their expressions were different.</p><br/><p>“Keke...Kuaaahahahaha!”</p><br/><p>‘Finally the power broke!’</p><br/><p>Though he had been turned into a mess, there was still a huge difference in power.</p><br/><p>Krancheska stole a glance at the Ain and then laughed towards Hansoo.</p><br/><p>“Try using all your tricks now. I know you have hidden a lot of things. Go on, use them.”</p><br/><p>He knew that Hansoo had been waiting until he had become weak.</p><br/><p>But that didn’t matter.</p><br/><p>He was going to stomp all over Hansoo.</p><br/><p>Kiiiiing.</p><br/><p>Krancheska smiled as his right eye let out a strange blue light and scanned Hansoo’s body.</p><br/>\n</div>"}