{"title": "Chapter 260 : Golden Dragon Formation (3)", "id": 260, "volume": 3, "url": "http://boxnovel.org/reincarnator-chapter-260-golden-dragon-formation-3", "volume_title": "Volume 3", "body": "<h1>Chapter 260 : Golden Dragon Formation (3)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 260 : Golden Dragon Formation (3)</p><br/><p>Booooom!</p><br/><p>Eloa frowned as she looked at the man who had smashed her shield.</p><br/><p>It wasn’t any simple shield.</p><br/><p>There was only a single objective for her who was the 3rd in command in the Magic Brigade.</p><br/><p>Defending the others.</p><br/><p>When the mages were preparing large spells, she would get the support of a few other mages to create the defenses and Arthus Krancheska would go outside that defense to fight their opponents.</p><br/><p>Her other magics may not be top notch but she was extremely confident in her defensive spell, .</p><br/><p>But her opponent was actually shaking the bronze barrier surrounding her quite well.</p><br/><p>‘...Not bad.’</p><br/><p>But that was it.</p><br/><p>He wasn’t bad.</p><br/><p>For somebody who had the level limit of 250.</p><br/><p>But this was nowhere enough to defeat their captain, Arthus Krancheska.</p><br/><p>Even with the Ain behind him.</p><br/><p>Though Krancheska’s personality was quite bad, his skills were the real deal.</p><br/><p>Even if he used the power of the flail, it shouldn’t be enough.</p><br/><p>‘Fuck. How did he lose! Say something Krancheska!’</p><br/><p>Then.</p><br/><p>Tatak.</p><br/><p>The ain that was covered in flames knocked out Krancheska that she was holding and threw him off.</p><br/><p>Then.</p><br/><p>Whoooosh!</p><br/><p>The Ain, in her flame form, closed in the gap to appear right in front of Eloa and started to send out a barrage of attacks.</p><br/><p>Booboobooom!</p><br/><p>Booooom!</p><br/><p>The blazing cloud kept changing forms as it attacked her shield.</p><br/><p>And from the side the human attacked her with the flail and a mysterious golden spear.</p><br/><p>The flail was one thing, but she didn’t know what the hell the spear and the ring was andbut every time the ring shone and the spear cut across the void she felt her shield tremble vigorously.</p><br/><p>‘Ughh! He’s 50 levels lower...What the hell!’</p><br/><p>Eloa clenched her teeth.</p><br/><p>If there was only one person like him, she would be able to handle him.</p><br/><p>Since her goal wasn’t winning but buying time until the formation activated properly.</p><br/><p>But two was a different story.</p><br/><p>Her level was 300.</p><br/><p>But the Ain in front of her was at least at that level as well.</p><br/><p>Meaning that it wasn’t an easy opponent.</p><br/><p>Eloa figured out that the situation wasn’t good as she clenched her teeth.</p><br/><p>‘No! I cannot get pushed back!’</p><br/><p>A brilliant future waited for her.</p><br/><p>In a situation like this where even the captain, Arthus Krancheska, had been captured, if she dealt with this situation properly then everything would come back to her as rewards.</p><br/><p>But if she got pushed back?</p><br/><p>She would have to shoulder all responsibility.</p><br/><p>Since the one who should’ve beared the most, Arthus, was captured by the other side already.</p><br/><p>‘Dumbass. You were so confident but you dare get captured as a hostage?’</p><br/><p>Eloa looked at the unconscious Krancheska in the distance with a dumbfounded expression.</p><br/><p>Their king, the Little Dragon King Constantine, was not an easy-going person who lets slip-ups like this unpunished.</p><br/><p>He believed that everyone useless should be disposed of.</p><br/><p>“Damnit!”</p><br/><p>Boooooom!</p><br/><p>From the bronze sphere, a spear looking like a spike shot out.</p><br/><p>And then 17 spears dozens of meters long all shot out and aimed for the vital spots of her enemies but it was all useless.</p><br/><p>Booom!</p><br/><p>Claaaanggg!</p><br/><p>The Ain and the human both used their weapons to smash apart incoming attacked and dodged the rest.</p><br/><p>‘Damn...This is only useful to stop them for a short while.’</p><br/><p>Eloa grinded her teeth.</p><br/><p>The Bronze Armor was for defense anyway.</p><br/><p>The situation wasn’t that bad since her opponent’s levels were lower and they were being wary of her.</p><br/><p>But sooner or later her Bronze Armor will get smashed apart by their attacks.</p><br/><p>‘At this rate…’</p><br/><p>Eloa thought of the final card she had.</p><br/><p>The power those crazed dogs in the distance were using.</p><br/><p>Mana node.</p><br/><p>Eloa gulped and looked behind her.</p><br/><p>Her mana sensitive eyes could see it.</p><br/><p>The immense amount of mana that flowed below the barrier.</p><br/><p>Her body was much stronger than the immortals who were barely at level 250 and was also much more resilient.</p><br/><p>It was much more suitable to use the power.</p><br/><p>Though she wouldn’t die...Such a tremendous amount of energy would still mess her up.</p><br/><p>She would become a mess if she was lucky.</p><br/><p>If she wasn’t lucky then she might get disabled.</p><br/><p>Then.</p><br/><p>Booooooooooom!</p><br/><p>Craaaaack!</p><br/><p>Cracks started to appear on the Bronze Armor from the countless attacks that pummeled it.</p><br/><p>‘Damn…’</p><br/><p>Swhoooosh!</p><br/><p>Eloa pushed them back with the spikes and then breathed in deeply.</p><br/><p>It had only been a minute since they clashed.</p><br/><p>But cracks had already appeared on the Bronze Armor.</p><br/><p>It should at least last 3 minutes.</p><br/><p>Eloa stopped thinking and clenched her teeth.</p><br/><p>There was no time to think.</p><br/><p>They were only staying here and not charging into the formation because they were wary of her, if she lost to them they would charge straight in.</p><br/><p>And if she was gone, the thin shield that covered the formation would get smashed apart while the other people from the Magic Brigade, who were focused preventing the mana node from going berserk, would just get massacred.</p><br/><p>Eloa sighed.</p><br/><p>‘Little Dragon King, Constantine. Please acknowledge my actions.’</p><br/><p>If she was lucky, she might take over Arthus Krancheska’s spot and even receive a new .</p><br/><p>Which meant she would become even more powerful than she was now.</p><br/><p>Eloa lit up the small flare of hope in her mind, resolved her mind and then twisted the control spell of the formation.</p><br/><p>Boooooooom!</p><br/><p>The Golden Dragon Formation let out a huge amount of bright light into the air again.</p><br/><p>Swooooooosh!</p><br/><p>That tremendous amount of mana got sucked into Eloa’s body.</p><br/><p>And a change occurred to Eloa and the surrounding areas of the formation.</p><br/><p>Kududududududu!</p><br/><p>The giant stones and the granite floor that constituted the Great Barrier started to grind against each other and rise into the air.</p><br/><p>No, they weren’t just rising.</p><br/><p>The greyish granite started to turn bright blue.</p><br/><p>And it wasn’t just the color that changed, its composition started to change as well.</p><br/><p>The stone ground rose up as it started to turn metallic.</p><br/><p>And as the metal which had the color of blue bronze rose up, it started to cover up Eloa and the surrounding areas of the formation.</p><br/><p>Like a giant turtle.</p><br/><p>“Tsk.”</p><br/><p>Booooooooom!</p><br/><p>Hansoo raised his spear and smashed the formation but the bronze blue shield deflected away Hansoo’s attack with ease.</p><br/><p>Then.</p><br/><p>Kuududududooong.</p><br/><p>The giant formation as well as the Great Barrier that surrounded it started to get covered in bronze blue scales.</p><br/><p>As if a giant azure dragon had twisted onto itself and had fallen into slumber.</p><br/><p>‘Success!’</p><br/><p>Eloa felt like her mana circuits were burning up but glee filled up a corner of her mind.</p><br/><p>The best defense spell she knew which she didn’t even have close to enough mana to perform before.</p><br/><p>A skill which she would’ve only been able to cast at the level of Arthus Krancheska, a skill which she had never tried before for this reason.</p><br/><p>.</p><br/><p>A location where an azure dragon had settled down.</p><br/><p>Nobody would be able to penetrate it since an azure dragon was defending it.</p><br/><p>As long as the energy was supplied from the mana node, this would not get penetrated no matter what.</p><br/><p>‘Now...I just need to wait.’</p><br/><p>Wait until the formation stabilized and the spell they were working on was completed.</p><br/><p>Or until the players outside dealt with all of the people from the golden army.</p><br/><p>Whichever happened, it’ll be their victory anyhow.</p><br/><p>‘I like the latter thought more though. Kekekeke.’</p><br/><p>Of course the first one wasn’t bad either.</p><br/><p>Since then...They would be able to finish everything off, no matter if it were the Ain or the golden army.</p><br/><p>Eloa laughed coldly from the dark insides behind the wall of the Azure Dragon’s Seat which even blocked light.</p><br/><p>……………………………………</p><br/><p>Kuooooooo!</p><br/><p>Crrunnch! Crunch!</p><br/><p>From the distance.</p><br/><p>Because of the great changes that occurred at the Great Barrier.</p><br/><p>The golden army and the players who were fighting across various locations of the War Fortress could all see it.</p><br/><p>The scene of a giant azure dragon twisting around itself and setting down.</p><br/><p>From the tremendous force of mana that radiated from this, it caused the people to fall into despair and jump in glee.</p><br/><p>“Fuck!”</p><br/><p>Karhal cursed out while running away in madness.</p><br/><p>If that was something which Hansoo had done it would’ve been nice but that aura felt too familiar.</p><br/><p>It was similar to the bright blue energies that surrounded the crazed players who were charging at them.</p><br/><p>“Hahahaha! Bingo~. Apocalypto! I’ll have a taste first!”</p><br/><p>“Block him!”</p><br/><p>The moment a player with an axe came up to their face.</p><br/><p>Karhal and the players realized that buying anymore time would be useless and started to form defenses with their shields in an instant.</p><br/><p>Then.</p><br/><p>Boooom!</p><br/><p>A collision occurred between the axe the player swung and the defense created by dozens of layers shields of the adventurers.</p><br/><p>And the side which had been pushed back were the dozens of players who all had full plate armor and were holding onto shields.</p><br/><p>“Kuuuuuuk!”</p><br/><p>“Kuhuk!”</p><br/><p>T.R.O.P screamed in ecstasy as he saw the bug players get flung apart as if they had been bit by a bowling ball.</p><br/><p>“Hahahahaha! Finish them off! Jackpot!”</p><br/><p>He felt power overflowing through this body.</p><br/><p>Chwaaaarrrrrk!</p><br/><p>The dozens of chains which had killed countless master players latched onto him but he wasn’t afraid at all.</p><br/><p>Titititing!</p><br/><p>Kwaadududuk!</p><br/><p>The spears broke after he ran into them.</p><br/><p>He snapped the chains and pulled them back.</p><br/><p>“Uhhh?!”</p><br/><p>“Release the chains! We’re getting pulled in!”</p><br/><p>“Aaaaahh!”</p><br/><p>Karhal roared in rage as he saw the players charging into them with monstrous amounts of strength.</p><br/><p>‘Fuck! They would be nothing without that boost! We are waiting for you, Hansoo!’</p><br/><p>Karhal grinded his teeth while thinking of Hansoo who had flown towards the Great Barrier and started to slash at the players.</p><br/><p>………………………………………….</p><br/><p>Kuuududududooong!</p><br/><p>Doooong!</p><br/><p>The Ain asked with a worried expression as she heard the noises of battle which came from the area around the War Fortress.</p><br/><p>“...What are you going to do? It doesn’t seem easy to break through.”</p><br/><p>Booom! Booom!</p><br/><p>The Ain looked at Hansoo with a grim expression as she striked at the barrier in front of her.</p><br/><p>It would eventually break if they continued to attack it, or the body of the user holding this up would break down, but they didn’t have that much time.</p><br/><p>Hansoo inhaled deeply and spoke towards the Ain.</p><br/><p>“Protect me.”</p><br/><p>“Huh?”</p><br/><p>As the Ain was confused.</p><br/><p>Udududududuk.</p><br/><p>Starting from Hansoo’s heart.</p><br/><p>The veins and arteries, muscles and bones all started to twist around.</p><br/><p>Kadddddduk!</p><br/><p>Aduduk.</p><br/><p>‘What the fuck…’</p><br/><p>The Ain freaked out at the sounds coming out from Hansoo’s body and asked.</p><br/><p>“You...What the hell is that?”</p><br/><p>She didn’t know what it was but she could feel it.</p><br/><p>The great changes that were occurring inside his body.</p><br/><p>Hansoo laughed as he spoke.</p><br/><p>“I should at least have a trump card right?”</p><br/><p>Kuuuoooooo!</p><br/><p>‘Continue hiding inside this shell. Heh.’</p><br/><p>The goal was nine of them.</p><br/><p>Dragons started to climb onto Hansoo’s spear as he smiled coldly.</p><br/>\n</div>"}