{"title": "Chapter 269 : Underground (3)", "id": 269, "volume": 3, "url": "http://boxnovel.org/reincarnator-chapter-269-underground-3", "volume_title": "Volume 3", "body": "<h1>Chapter 269 : Underground (3)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 269 : Underground (3)</p><br/><p>“Fucking hell. There’s nothing to see.”</p><br/><p>The players started to leave one by one after a long period of curiously staring at the mysterious letters.</p><br/><p>This damned thing didn’t have an entrance anywhere.</p><br/><p>Even if it did, they would have to melt all the ice surrounding this thing at this rate.</p><br/><p>Which was not possible.</p><br/><p>“Let’s go up!”</p><br/><p>“Ugh. What a waste of time.”</p><br/><p>The players complained but started to climb up one by one with weights lifted off their minds.</p><br/><p>They still gained something from this.</p><br/><p>‘Even if the guys from the Empire are crazy they wouldn’t fault us when we have come this far.’</p><br/><p>If they really wanted to go through it then they probably could by gathering every player here including the ones above.</p><br/><p>But why did they need to?</p><br/><p>This was more than enough.</p><br/><p>They had even given up their hunts to come all the way north to find this guy, what can they do about him escaping into some mysterious piece of metal?</p><br/><p>‘There. Nothing we can do.’</p><br/><p>As they came up from the hole, they could see countless others having climbed out from the snow and were checking their gear.</p><br/><p>And one of the players who came out from the hole shouted towards them.</p><br/><p>“Yo! Let’s go! It’s a dud.”</p><br/><p>But nobody moved.</p><br/><p>‘What? Do they not trust me?’</p><br/><p>Well, his words did lack some explanation.</p><br/><p>But as the player was about to shout again.</p><br/><p>One of his clansmen spoke with a frown on his face.</p><br/><p>“...We can’t man.”</p><br/><p>“Huh? Why?”</p><br/><p>The clansman showed the player the message that had come.</p><br/><p>Though there were a lot of words in it, the summary was simple.</p><br/><p>And the player frowned as he saw the message.</p><br/><p>‘Damned Empire...Stressing me even inside the game. What the hell is the 4th Brigade anyway.’</p><br/><p>According to what he knew, there was only 3 Brigades in the Empire.</p><br/><p>The player shouted while frowning at the news of the Brigade he had never heard of.</p><br/><p>“What about it! If they just started then it’ll take forever for them to get here. How long are we supposed to wait!”</p><br/><p>These players had taken two days despite running at full speed to get here.</p><br/><p>Of course it would take longer if one calculated the time it took to kill beasts on the way.</p><br/><p>Then.</p><br/><p>Whooosh.</p><br/><p>“Don’t worry. We’re here already.”</p><br/><p>“...Huh?”</p><br/><p>His vision darkened for a second and then the shadow below his feet stood up.</p><br/><p>‘What the…’</p><br/><p>The player was shocked at the sight of his own shadow getting up and moving around.</p><br/><p>Then.</p><br/><p>The shadow turned into a man.</p><br/><p>‘Hmm…’</p><br/><p>A powerful aura that radiated from his entire body.</p><br/><p>He didn’t know what the 4th Brigade was but this was more than enough to tell him that they weren’t simple.</p><br/><p>And there was another problem.</p><br/><p>‘What is that.’</p><br/><p>A small shield in the man’s right hand.</p><br/><p>As the players made fearful expressions at the shield that let out a suspicious but powerful aura.</p><br/><p>The man who had used the spirit and his own skills to travel thousands of kilometers at a tremendous speed, Jang Oh, spoke.</p><br/><p>“How’s the situation?”</p><br/><p>A few of the players were irritated at the arrogant NPC but it was still a NPC from the Empire.</p><br/><p>They explained the situation.</p><br/><p>Which made Jang Oh shocked.</p><br/><p>‘...There’s energy flowing? Wasn’t it a ruin?’</p><br/><p>The place he obtained the Spirit wasn’t as strong as this.</p><br/><p>Since they barely maintained their existence deep inside the ice or in the middle of a swamp somewhere.</p><br/><p>‘I guess it’s a bit different’</p><br/><p>But this didn’t matter.</p><br/><p>Since all he needed to do was accomplish his objective.</p><br/><p>‘This is the end of jumping around.’</p><br/><p>Jang oh muttered to himself as he jumped into the hole Hansoo had made.</p><br/><p>With the shield raised.</p><br/><p>………………………………………</p><br/><p>Whooosh!</p><br/><p>Hansoo looked around as he fell.</p><br/><p>A vast space.</p><br/><p>A lake and a forest.</p><br/><p>The lake was so clear and blue that it seemed like fishes would jump up at any moment and the green color of the forest made it look extremely healthy.</p><br/><p>And the best part was the sky he was falling through.</p><br/><p>Ooooong.</p><br/><p>A giant object was floating in the air and lighting up this entire space.</p><br/><p>Bright but warm.</p><br/><p>Like...</p><br/><p>‘It’s like a sun. A miniature sun?’</p><br/><p>It seemed like it contained a tremendous amount of energy but seeing it was radiating very soft light he could only think of the sun.</p><br/><p>And something else came into his eyes as he fell more.</p><br/><p>If everything he had seen so far was beauty of nature then this was something quite opposite.</p><br/><p>Cylindrical buildings that rose high into the sky.</p><br/><p>Oooong.</p><br/><p>Hansoo used a bit of mana to intensify his vision.</p><br/><p>He then saw the identity of these buildings.</p><br/><p>Starting at the outer parts, and at the inside through the windows.</p><br/><p>And a conclusion quickly came.</p><br/><p>‘It’s a residential building.’</p><br/><p>Though there were a lot of strange objects, there were basic living conditions set such as tables, seats, beds and others.</p><br/><p>It was a building created for residents.</p><br/><p>And looking at this giant cylinder, a thought came up in Hansoo’s head.</p><br/><p>‘Colony.’</p><br/><p>A colony created for survival which one could see in Sci-Fi movies.</p><br/><p>Tatatatak.</p><br/><p>Hansoo landed onto the trees in an area which seemed to have been created as a orchard.</p><br/><p>‘...Why is such a thing below the Northern Tundra?’</p><br/><p>Hansoo made a confused expression.</p><br/><p>Even Jang Oh, who had gained the powers of the Spirit, didn’t tell him about this.</p><br/><p>‘Did he not tell me...Or was it different from this.’</p><br/><p>He didn’t know when and why this was created but he knew one thing for clear.</p><br/><p>That there were Spirits here.</p><br/><p>Shrrrng.</p><br/><p>Hansoo touched the branches of the tree next to him.</p><br/><p>Then a joyous and familiar aura seeped out.</p><br/><p>An aura full of life and vigor unlike the destructive auras of the Spirit Stones.</p><br/><p>‘Aura of the Tree Spirit.’</p><br/><p>A type of Spirit Stone which was sold much cheaper than ice or fire types because of its lack of usage in battles.</p><br/><p>But it was doing its job perfectly here.</p><br/><p>Maintaining the best state for the trees that were living here.</p><br/><p>‘The Lake… And the Land as well.’</p><br/><p>Hansoo started to walk as he sensed the nearby auras of the lake and the land below his feet.</p><br/><p>He didn’t have time to waste.</p><br/><p>There was one objective he had right now.</p><br/><p>Getting the Spirit and going across the mountain.</p><br/><p>And for this, he had to move.</p><br/><p>Hansoo pondered for a moment and then picked a direction.</p><br/><p>‘To the Power Room.’</p><br/><p>Though this place was being managed by a Spirit, the Spirit did not live here.</p><br/><p>To be exact, the energy of the spirit was keeping every corner of this place alive.</p><br/><p>This place which was isolated from light, air and water from the outside.</p><br/><p>‘And also check on the way. See whether there are living creatures here…’</p><br/><p>It was made for living creatures.</p><br/><p>It was a low probability but there might be traces of living things.</p><br/><p>There might even be somebody who had the answer to the question of what Mudusella wanted him to bring.</p><br/><p>Tatatatak!</p><br/><p>Hansoo started to head towards the central area with the buildings while following the aura of the Spirits below his feet.</p><br/><p>Then.</p><br/><p>Shhshshshhhh.</p><br/><p>The surrounding trees that were being protected by the Spirit started to tremble.</p><br/><p>As if they were communicating.</p><br/><p>…………………………………</p><br/><p>Tatatatatak.</p><br/><p>After a bit, he got to a giant structure after passing through many others.</p><br/><p>‘It’s here huh.’</p><br/><p>A giant structure of which the entire outside was reinforced by a metal spirit.</p><br/><p>He could feel a tremendous amount of energy and vigor from inside it.</p><br/><p>‘There must be something in here.’</p><br/><p>Hansoo nodded.</p><br/><p>Even if something was inside there, it didn’t matter.</p><br/><p>Since he just needed to get the Spirit’s power and go across the mountain.</p><br/><p>Then.</p><br/><p>Rummblee.</p><br/><p>A rumbling noise was heard from where he had come in from.</p><br/><p>And Hansoo nodded at this sound.</p><br/><p>‘He came fast.’</p><br/><p>Though Tiamet couldn’t come, there was no way he would just sit and watch.</p><br/><p>And Clementine’s forces wouldn’t sit around either.</p><br/><p>Hansoo thought of the man who had come to meet him.</p><br/><p>‘...I didn’t want to meet you like this but I guess I’ll have to turn a blind eye this time around right?’</p><br/><p>His previous mentor.</p><br/><p>At the same time his protector.</p><br/><p>And his friend.</p><br/><p>Hansoo composed himself as he saw Jang Oh who was creating a hole through the wall he had come through far off in the distance.</p><br/><p>While gripping the Forked Lightning tightly.</p><br/><p>………………………………………………….</p><br/><p>“Damn. Are you seeing this right now?”</p><br/><p>“What is it?”</p><br/><p>“It’s live right now. Is it like the hint for the next big update? Damn, I’m jealous of these guys.”</p><br/><p>A rumor filled with curiosity circulated between the players outside the War Fortress.</p><br/><p>Usually a live broadcast would only be used in battles as a tactical usage but that wasn’t the case this time.</p><br/><p>The players have envious expressions as they saw the live broadcasts of the players who were looking at this entire thing all the way up at the Northern Wall.</p><br/><p>They were jealous because the rewards the first party that succeeded after the 5th update came and the Maze had opened were quite substancial.</p><br/><p>Rummmblee!</p><br/><p>“Woah….What the. Is that a NPC? Jesus christ.”</p><br/><p>“What is that?”</p><br/><p> Rumble!</p><br/><p>The people started to mumble in shock from the NPC who was smashing a hole into the alloy wall with a tiny shield in his hand.</p><br/><p>Usually they would be attracted at the sight of a powerful NPC but their eyes turned to something else.</p><br/><p>Not the NPC but rather the alloy wall he was creating a hole in.</p><br/><p>Specifically the things that would be inside.</p><br/><p>Then.</p><br/><p>Chiiijijijik!</p><br/><p>The moment the NPC male created a hole with this powerful attacks.</p><br/><p>The players who were watching cheered.</p><br/><p>“Woah! Is he going in!?”</p><br/><p>“Damn...Shall I go over there as well?’</p><br/><p>Due to the yells of the nearby players, the others who had been encircling the War Fortress started to turn on the broadcast one by one.</p><br/><p>Soon.</p><br/><p>The entire surroundings of the War Fortress were filled with tiny floating screens.</p><br/>\n</div>"}