{"title": "Chapter 262 : Golden Dragon Formation (5)", "id": 262, "volume": 3, "url": "http://boxnovel.org/reincarnator-chapter-262-golden-dragon-formation-5", "volume_title": "Volume 3", "body": "<h1>Chapter 262 : Golden Dragon Formation (5)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Reincarnator - Chapter 262 : Golden Dragon Formation (5)</p><br/><p>Kuuuuooooong.</p><br/><p>As an explosion which shook the heavens and earth rang out.</p><br/><p>“What the fuck! What happened!”</p><br/><p>“Uuuuuuk!”</p><br/><p>The blue light that surrounded the players disappeared into thin air.</p><br/><p>Sway.</p><br/><p>“What the...Did that level 300 girlguy die?”</p><br/><p>Apocalypto almost tripped from the strength which had disappeared into thin air and cursed out.</p><br/><p>He was curious but he didn’t go back.</p><br/><p>Since a level 300 falling was something impossible.</p><br/><p>And they were people who controlledhad the power which had been gifted to themselves to hunt the bug players.</p><br/><p>He thought they’d be able to defend themselves but for them to get destroyed!</p><br/><p>‘Fucking hell! After all those cocky words!’</p><br/><p>Apocalypto looked at his current status and cursed out again.</p><br/><p>The overwhelming amount of mana turned his innards into a mess and the buff was gone.</p><br/><p>Apocalypto looked at the Bug Players who he had been playing with up until now and were now glaring at him with vicious eyes.</p><br/><p>“...Ah fuck.”</p><br/><p>With those words.</p><br/><p>Crunch!</p><br/><p>Boom!</p><br/><p>A massacre occurred.</p><br/><p>“These fuckers!”</p><br/><p>“Uwaaaak!”</p><br/><p>Kwadududk!</p><br/><p>Clang!</p><br/><p>Countless chains and spears flew across the air and turned the players into golden lights.</p><br/><p>‘Good! Good! It’s all over!’</p><br/><p>Karhal applied the Quintuple beam onto his arrow and shot it out with a relieved expression.</p><br/><p>It ended.</p><br/><p>The huge explosion would’ve been created by Hansoo.</p><br/><p>Seeing the buff had been released, he had either caused a large amount of damage to the formation or took over the area.</p><br/><p>Which meant that the their job here was basically completed.</p><br/><p>“Phew…”</p><br/><p>As Karhal sighed out in relief.</p><br/><p>Whooooooosh!</p><br/><p>A tremendously vicious aura spread out from the Great Barrier.</p><br/><p>An aura which caused him to be unable to breath and barely stand.</p><br/><p>“Huuuuukk!”</p><br/><p>“Ugh...What the fuck!”</p><br/><p>The aura was so powerful even the fighting adventurers lost their balance and were tripping.</p><br/><p>Shiver.</p><br/><p>‘What the fuck happened now.’</p><br/><p>Karhal stroked the chills that appeared all over his body and looked towards the Great Barrier.</p><br/><p>………………………………………</p><br/><p>“...Was I a bit too late?”</p><br/><p>Because the mastery level of his Nine Dragons Spear had risen, he didn’t fall unconscious or get down to a heavily injured state.</p><br/><p>He still had a bit of strength and was recovering very quickly.</p><br/><p>But even so, the situation wasn’t very bright.</p><br/><p>Kudududuk.</p><br/><p>Ududuk.</p><br/><p>Hansoo calmy recoveredreclaimed his balance and stared at the monster who was slowly enlarging the dimensional crack in the distance.</p><br/><p>Tiamet Kratus.</p><br/><p>There wasn’t really a big difference between the Kingdoms and the Empire.</p><br/><p>But there was a reason why they were called differently so.</p><br/><p>There wasn’t a Tiamet Kratus in the Kingdoms.</p><br/><p>And there was one in the Empire.</p><br/><p>This was why they were different.</p><br/><p>A man who had lived over a thousand years and protected the Empire, a living fossil and a historical relic.</p><br/><p>But that man did not move rashly.</p><br/><p>No, he couldn’t move.</p><br/><p>‘To control Rangkom’s Stake...He wouldn’t be able to stay away from the White Dragon Arena for that long. Is he really willing to come here despite that?’</p><br/><p>Tiamet held one of the three godly weapons of the Empire, Rangkom’s Stake, and stabbed away at the dimensional crack so it would stay open.</p><br/><p>And that wasn’t all.</p><br/><p>Ooooooooong!</p><br/><p>The Golden Dragon Formation, that hundreds of mages could barely control, forcibly acted up and was handing over the energy to Tiamet just so he could create a passage.</p><br/><p>Hansoo frowned as he looked at Tiamet who used Rangkom’s Stake as a medium to swallow the formation whole.</p><br/><p>‘...He’s still a monstrosity after this long huh.’</p><br/><p>He had admired his strength in his past life as well.</p><br/><p>A thousand years in a single world.</p><br/><p>The strength that he had gained through the countless years of countries rising and falling and the lands changing was not something a passing adventurer could handle.</p><br/><p>And since he was an enemy, his might was even more oppressive.</p><br/><p>All of the hairs in his body stood up and his heart started to beat crazily.</p><br/><p>A natural reaction of the body’s survival instincts as one met a tremendously powerful opponent.</p><br/><p>Kuuuuooooooo!</p><br/><p>The dimensional portal was continuing to become larger and larger.</p><br/><p>‘Ugh.’</p><br/><p>Hansoo frowned.</p><br/><p>He had thought that everything was concluded but for that man to pop out.</p><br/><p>But Hansoo soon realized why such a man had appeared after a brief moment of thought.</p><br/><p>‘So they interfered huh.’</p><br/><p>Hansoo, after figuring out the reason, rapidly tried to organize the current situation in his head.</p><br/><p>Being late is late and not being able to stop that man is his fault.</p><br/><p>The hole had been created already and Tiamet was smashing it open.</p><br/><p>So he could open it completely and come onto this side.</p><br/><p>And the oppressive might radiating from him was increasing at a continuous rate.</p><br/><p>Kuoooooooo!</p><br/><p>“Ugh….”</p><br/><p>“Cough…”</p><br/><p>The might that spread out from such a tiny crack was so powerful that it even caused the mages laid out on the floor to cough out blood.</p><br/><p>“Ahh….”</p><br/><p>Hansoo looked over at the mages for a bit and then clenched onto the flail.</p><br/><p>Ududuk.</p><br/><p>‘Block him before he comes out.’</p><br/><p>That man was not something he could handle right now.</p><br/><p>So he had to prevent him from coming here no matter what.</p><br/><p>‘...It won’t be easy but I’ll have to try anyways.’</p><br/><p>Push back the stake as much as he could and retake the control over the formation.</p><br/><p>Hansoo started to walk towards the center of the formation with the flail while pushing back the aura that was flooding out from the small crack.</p><br/><p>Right in the center.</p><br/><p>Towards the dimensional crack that was now the size of an eye.</p><br/><p>Kuduk.</p><br/><p>Crunnch.</p><br/><p>Though it was only the aura of the man, the ground broke under his feet with every step he took.</p><br/><p>“Heeuup!’</p><br/><p>Hansoo raised his arms to block the area in front of his body as he advanced and then smashed the God’s Flail onto the center of the formation.</p><br/><p>Then.</p><br/><p>Roaaaaarrr!</p><br/><p>The tremendous flow of energy that was being sucked into the Rangkom’s Stake started to disperse.</p><br/><p>Towards the flail which was closer and was placed in a better location.</p><br/><p>And the flail started to heat up bright red again.</p><br/><p>Like how it had been when it was sealed in the past.</p><br/><p>The souls within the flail started to scream from the intense amount of energy that started to flow through them.</p><br/><p>But of course this energy didn’t only go to the flail.</p><br/><p>“Ugh…”</p><br/><p>Hansoo grunted as he felt the tremendous amount of energy that flew through the flail.</p><br/><p>But he had to hold onto it.</p><br/><p>Though there was a medium, it needed someone’s consciousness to use the energy towards the objective they needed to do.</p><br/><p>Energy without a purpose that continued to build up would only cause a havoc.</p><br/><p>Hansoo only had one objective.</p><br/><p>‘Close...The gate!’</p><br/><p>Boooooom!</p><br/><p>The energy of the mana node, which turned the flail bright red, started to flow onto a specific point.</p><br/><p>Towards the hole in the air, towards Rangkom’s Stake which was piercing through it.</p><br/><p>Soon.</p><br/><p>Kwaaazzzzzzzzzkkk!</p><br/><p>The hole that had been opening up stopped expanding and started to convulse in mid air.</p><br/><p>It seems Hansoo had taken the upper hand on the mana node’s energy.</p><br/><p>At that moment.</p><br/><p>“Not bad.”</p><br/><p>Tiamet smiled while looking at Hansoo through the eye sized hole.</p><br/><p>………………………………………………….</p><br/><p>Craaaccckk!</p><br/><p>The black robed man looked towards the hole where Tiamet was looking through the broken space.</p><br/><p>‘Monster…’</p><br/><p>Though the hole created by the white stake was indeed tiny, a powerhouse like Tiamet didn’t simply look with their eyes alone.</p><br/><p>‘Well. It’s a bit opaque but it’s not bad.’</p><br/><p>Tiamet felt the situation across the hole with his senses and then mumbled.</p><br/><p>“Saw somebody who isn’t half bad...And somebody familiar thanks to him. Not bad, not bad at all.”</p><br/><p>“A familiar face…?”</p><br/><p>‘What the hell is he spurting…’</p><br/><p>The man muttered in disbelief.</p><br/><p>A familiar face.</p><br/><p>Since there was countless people across that hole, seeing one or two people they knew wasn’t something strange.</p><br/><p>If Tiamet was an ordinary person in an ordinary situation.</p><br/><p>‘Wait. You haven’t gone out from here in a hundred years…’</p><br/><p>And from what he knew, not many people lived past being a hundred years old.</p><br/><p>As the black robed man looked at Tiamet in confusion.</p><br/><p>Tiamet slowly started to spread his hand out.</p><br/><p>“Then...Shall we go see our cowardly friends? It seems the friends are out to escort me anyway.”</p><br/><p>Tiamet looked towards the Ain who was staring at him in a daze and started to shove his left hand into the hole.</p><br/><p>Soon.</p><br/><p>Oooooooonggg!</p><br/><p>The dimensional portal that was barely holding on in the air started to tremble intensely.</p><br/><p>The power of destruction within Tiamet’s left hand started to move through the portal.</p><br/><p>From the capital of the empire.</p><br/><p>Towards the center of the War Fortress thousands of kilometers away.</p><br/><p>…………………………………………</p><br/><p>Kududududuk!</p><br/><p>The hand which ripped apart space as it advanced stopped right before the eyehole sized hole.</p><br/><p>The space was barely large enough for a single pointer finger to come through.</p><br/><p>And this pointer finger that was pointing towards Hansoo, a 2m tall giant muscular man, was almost pitiful.</p><br/><p>But the moment Hansoo saw the finger.</p><br/><p>Whoosh!</p><br/><p>Hansoo quickly moved his head away.</p><br/><p>No, he even abandoned the flail in his hand and dodged away.</p><br/><p>As the instinctive dodge had been performed.</p><br/><p>Boooooom!</p><br/><p>A giant laser erased everything in its path and passed where Hansoo had been standing just before.</p><br/><p>Erasing the Great Barrier and destroying a part of the War Fortress.</p><br/><p>“Uwaaaaaaaak!”</p><br/><p>“Kuhuuk!”</p><br/><p>The screams of the adventurers and the players who were fighting in the distance couldn’t dodge.</p><br/><p>A simple gesture which led to destruction.</p><br/><p>“Ha…”</p><br/><p>The mages saw the concentration and the usage of mana from the finger and trembled in fear.</p><br/><p>With just a simple thought the surrounding atmosphere trembled and the mana went into a havoc.</p><br/><p>They talked about the thousand year warrior but none of them had actually seen Tiamet before.</p><br/><p>No, only legends and stories were told because of this.</p><br/><p>And the mages scoffed at these legends and stories.</p><br/><p>Since these tales made no sense.</p><br/><p>But the supernatural being that had appeared in front of them was far past what they had heard.</p><br/><p>At the same time a ray of hope appeared in their minds.</p><br/><p>‘...We can live! We won’t have to become hostages!’</p><br/><p>Having their lives in the hands of others was the same was not being alive at all.</p><br/><p>They would need to constantly show that they had a use and the moment they weren’t be of use, they would just get removed.</p><br/><p>Such a treatment was not something they would like.</p><br/><p>But the empire, whom they were in an alliance with, had stepped up.</p><br/><p>Hope had appeared.</p><br/><p>‘Kekeke...You’ll all die now.’</p><br/><p>As the mages chuckled at the golden army in the distance.</p><br/><p>Flick.</p><br/><p>The finger in the air swirled around and pointed towards a different direction.</p><br/><p>Towards Hansoo who was about to grab onto the flail again.</p><br/><p>Then.</p><br/><p>Boooooom!</p><br/><p>Another beam came out and swept past the upper areas of the formation.</p><br/><p>Nothing could stand in the path of this finger.</p><br/><p>The barrier and the ruins.</p><br/><p>The War Fortress.</p><br/><p>Even the mages.</p><br/><p>“Kuwaaaaak!”</p><br/><p>“Uaaak! Why..!?”</p><br/><p>The mages whose limbs had been erased by the beam screamed in pain.</p><br/><p>At that moment.</p><br/><p>The Ain dodged away and muttered.</p><br/><p>In a slightly different tone from before.</p><br/><p>“Dumbasses. You think they will care about you?”</p><br/><p>That man had lived a thousand years.</p><br/><p>By himself.</p><br/><p>Alliances and human interactions. Nothing mattered to that man.</p><br/><p>Since nobody could tie him down.</p><br/><p>He removed things he didn’t like and moved according to what he wanted.</p><br/><p>The strength which had been refined over a thousand years had become even more perfect and his personality had become more and more like what it was today.</p><br/><p>‘...He has become a true monster now huh.’</p><br/><p>The Ain mumbled as he looked at the existence who would be over across the hole.</p><br/><p>The eyes that had trembled in fear and shock had disappeared and only a pair of cold heartless eyes appeared.</p><br/><p>As if she had become a different person.</p><br/><p>‘It seems...You need to become a bit stronger. It’s a bit too early to let you loose.’</p><br/><p>This is the reason why she had awoken.</p><br/><p>The Ain looked between Tiamet in the distance and Hansoo as she flew towards the formation.</p><br/>\n</div>"}