{"title": "Chapter 273 : Berserk (3)", "id": 273, "volume": 3, "url": "http://boxnovel.org/reincarnator-chapter-273-berserk-3", "volume_title": "Volume 3", "body": "<h1>Chapter 273 : Berserk (3)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 273 : Berserk (3)</p><br/><p>Oooooong.</p><br/><p>&lt;...It was taken huh.&gt;</p><br/><p>Jang Oh mumbled as he looked at his body from a dark location within his mind.</p><br/><p>He had failed.</p><br/><p>And now the only thing he could do was hope that the person who took over his body, Taehee, did better.</p><br/><p>For the contract.</p><br/><p>Jang Oh thought of the past.</p><br/><p>The words Tiamet had said casually while walking past him.</p><br/><p>He didn’t know the exact reason why but Tiamet didn’t want anyone to go past the mountain range and to the forgotten lands beyond.</p><br/><p>Neither the citizens of this world.</p><br/><p>The Ains.</p><br/><p>Nor the players.</p><br/><p>So he had sealed the Ains and suppressed the citizens by creating the Empire and the Kingdoms.</p><br/><p>And there was no need to worry about the immortal players since their limitations prevented them from doing so.</p><br/><p>But a variable appeared.</p><br/><p>Themselves, the adventurers.</p><br/><p>Apparently Tiamet realized something the moment he saw them.</p><br/><p>That they could go across.</p><br/><p>But at the same time he realized something else.</p><br/><p>That he couldn’t kill them all by himself.</p><br/><p>Because the adventurers would continue to climb up endlessly.</p><br/><p>He, who was rooted in the White Dragon Arena, couldn’t kill everyone of these guys who appeared all over the entire world and eventually somebody who could go across the range would appear and slip by him.</p><br/><p>So he had decided to do his best in order to get rid of every adventurer and captured Jang Oh’s group to use them as a lure for others.</p><br/><p>But then Clementine made a deal with him.</p><br/><p>Tiamet wanted to control the adventurers and Clementine needed to handle those who passed by his eyes and came through the Green Road from below.</p><br/><p>Since both sides needed the same thing, the deal was made swiftly and with ease.</p><br/><p>And there was no need for the citizens of this world to step out either.</p><br/><p>Since there was a group who was easy to manipulate and could not die.</p><br/><p>With the support of the Empire and the Kingdoms as well as the rewards and the hatred towards the Bug Players, a humongous clan that didn’t lose out to other clans had been created.</p><br/><p>And Jang Oh received the help of the Empire and had become the clan leader.</p><br/><p>To look over the Spirit Land and capture the other adventurers.</p><br/><p>And for this price, Clementine’s comrades from below had been guaranteed safety.</p><br/><p>For the Login area, Arrancar Zone and the Logout Area, the village next to the Capital.</p><br/><p>This is how the clan had been created.</p><br/><p>‘Sigh…’</p><br/><p>Jang Oh was dispirited as he watched his own body’s controls having been taken from him.</p><br/><p>Jang Oh didn’t want others to know about what he and Clementine were doing.</p><br/><p>It was better the less people knew about this.</p><br/><p>And to not let others shoulder this weight with him, he had decided to shoulder it all by himself and had decided to stay behind in this world.</p><br/><p>He had gained the power of a Spirit and had raised the mastery level of his skills to the apex.</p><br/><p>For 20 years without rest.</p><br/><p>And he had dealt with the issues within the Spirit Land all by himself because the adventurers were too weak for this place and because the citizens could not come into this place.</p><br/><p>But for him to lose like this.</p><br/><p>Jang Oh mumbled bitterly while being trapped within the darkness after having lost.</p><br/><p>‘Clementine… Is this alright?’</p><br/><p>He had never doubted Clementine so far.</p><br/><p>The Fragments of Seven Souls, the Contract Trait and the Lord Trait.</p><br/><p>There was a limit to how many people one could control with these.</p><br/><p>Though the Lord Trait could control a lot more people, the Contract Trait was rarer and more useful and something like the Fragments of Seven Souls only existed with Taehee.</p><br/><p>Though they had gained safety within this world, they were still weak within this world and people who couldn’t become their allies were more dangerous than monsters.</p><br/><p>He had thought that Clementine’s orders was the best and had always followed them.</p><br/><p>Though he was swimming in a sea of guilt, he withstood the clashing waves thanks to the smiles of those who passed through safely due to him.</p><br/><p>Since the second he gave up, Tiamet would set out to destroy them all due to them not having any more use for him.</p><br/><p>But then an strange person appeared.</p><br/><p>Some crazy maniac who told him that he would take everyone here.</p><br/><p>‘...Was killing them all the best choice? Did we have to kill them? Clementine?’</p><br/><p>Someone said once.</p><br/><p>That once you are held back by the chains of reality, the past comes back to you.</p><br/><p>Jang Oh thought back to the things he had done and fell into sadness.</p><br/><p>…………………………………..</p><br/><p>Booooooom!</p><br/><p>Hansoo frowned as he looked at Jang Oh who was attacking him.</p><br/><p>He, who was armed with countless Zero-umbering skills, was extremely powerful.</p><br/><p>But between himself, who had only trained for a year, and Jang Oh who had 20 years to increase the mastery of his skills, there was indeed a huge difference.</p><br/><p>And even more so since people like Taehee and Jang Oh were the elites of the elites.</p><br/><p>Chwaaaak!</p><br/><p>The moment the red powder spread out into the air.</p><br/><p>Black shadows spread out to block the red powder and reduced the damage.</p><br/><p>Then.</p><br/><p>Boooboboooom!</p><br/><p>Countless skills whose their original identities could not be made out because of the shadows smashed Hansoo’s body, his reinforcement and his armor.</p><br/><p>Though he was superior in terms of physical strength and artifacts, that one shield neutralized it all.</p><br/><p>Kiiiiiiing!</p><br/><p>‘...I guess he trusts this guy. For them to lend him a Divine Weapon.’</p><br/><p>Hansoo mumbled as he looked at the shield that was slowly gnawing away at his mana with the the yellow lights.</p><br/><p>Arham’s Shield.</p><br/><p>A shield which dispersed all forms of energy that were malicious towards it.</p><br/><p>Though it didn’t have a uniquely powerful attack like the God’s Flail, this single passive skill’s effect in a battle was tremendous on its own.</p><br/><p>Though it was a bit inferior to the Power Destruction of Nurmaha’s Ring, it still worked as a form of dispelling.</p><br/><p>If he didn’t have enough mana or the Mana Jade, then his mana would long have dried out.</p><br/><p>Hansoo started to worry.</p><br/><p>‘At this rate… I indeed would win.’</p><br/><p>Boooooom!</p><br/><p>Hansoo mumbled while looking at Jang Oh who had turned pale.</p><br/><p>Though it was better than the situation with Metiron, Taehee, who should be roaming around the indigo or even the violet zone, was much stronger than Jang Oh.</p><br/><p>Even if it was a fragment, the body could not withstand it.</p><br/><p>But the real issue was behind him.</p><br/><p>Ooooooooongg!</p><br/><p>The sounds that were coming from the large structure behind him were getting louder and louder.</p><br/><p>No, the aura that was being released from that place was the issue.</p><br/><p>Rummmmblee!</p><br/><p>A huge amount of mana that could even shake the lands below was seeping out.</p><br/><p>Oooooooong!</p><br/><p>If one could color the auras that were seeping out then there would be numerous dozens of different colors.</p><br/><p>Countless types of Spirit’s Auras.</p><br/><p>And the pressure that was being radiated was so intense that it caused both he and Jang Oh’s skins to tremble but the surrounding trees were just becoming more invigorated.</p><br/><p>The reason why Hansoo was so sure of his victory was because of this.</p><br/><p>Oooooong!</p><br/><p>Unlike Jang Oh who already had something inside him, Hansoo’s symbol was trembling intensely as it absorbing all the surrounding auras of the Spirits.</p><br/><p>And thanks to this Hansoo’s entire body was glowing with lights as well.</p><br/><p>Whoooosh!</p><br/><p>Flames appeared every time he swung his arms and lightning appeared where his spear smashed onto the ground.</p><br/><p>Originally, the Arham’s Shield should be gnawing away at his reinforcement and making it harder to battle but the energy from the Spirits was filling the gaps.</p><br/><p>‘Did she give me the symbol after having expected all of this?’</p><br/><p>Hansoo thought of Mudusella and started to recapitulate the current situation.</p><br/><p>He had the upper hand in the fight.</p><br/><p>But even though the situation behind him allowed him to have the upper hand in this battle, leaving it alone didn’t really make him feel any better.</p><br/><p>Though it was all within his expectations, if this amount of energy exploded in the wrong direction then that itself was more than enough to become a catastrophe.</p><br/><p>‘...I need to deal with that first.’</p><br/><p>Then.</p><br/><p>Boooooom!</p><br/><p>Hansoo raised the Forked Lightning and then attacked Jang Oh.</p><br/><p>The Shield let out rays of yellow light to disperse his reinforcement but countless colors filled the gap where the reinforcement had been.</p><br/><p>Craaack!</p><br/><p>Wind, Lightning and Flames stormed the location where the shield and the spear collided.</p><br/><p>To the point of even causing the darkness surrounding Jang Oh’s body to retreat.</p><br/><p>Boooom!</p><br/><p>As Jang Oh couldn’t handle the power behind Hansoo’s attack and took numerous steps backwards.</p><br/><p>Whoooosh!</p><br/><p>Hansoo moved his body and charged towards the structure.</p><br/><p>Ignoring Jang Oh completely.</p><br/><p>“Hmm.”</p><br/><p>Jang Oh, no, Taehee looked towards Hansoo’s back and shrugged his shoulders.</p><br/><p>‘Can’t follow that. Anyways...He’s really strong.’</p><br/><p>The auras that Hansoo was absorbing had come out from that structure.</p><br/><p>The closer Hansoo got to that building, the faster he would absorb the auras and the stronger he would get.</p><br/><p>Fighting against Hansoo in a situation like this where they were already in the losing situation was basically suicide.</p><br/><p>Taehee decided to give up and turned around depressedly.</p><br/><p>‘I had a lot to talk about...I guess I need to look for another chance.’</p><br/><p>There hadn’t been a chance to say a word but she had come here with a lot to talk about.</p><br/><p>But eventually another chance would arise.</p><br/><p>Since that guy didn’t seem to like her which meant that they would eventually meet again.</p><br/><p>Whoooosh!</p><br/><p>Jang Oh’s body that was surrounded in darkness disappeared.</p><br/><p>…………………………………..</p><br/><p>Ooooooooooong!</p><br/><p>Hansoo quickly ran past the glass orbs and headed deeper.</p><br/><p>He could still see the footprints that had been left behind within this place.</p><br/><p>Hansoo eventually arrived at a place.</p><br/><p>‘This is…’</p><br/><p>Hansoo frowned as he looked at the mysterious object in front of him.</p><br/><p>Rummmblee!</p><br/><p>A giant sphere that had taken position inside the giant structure.</p><br/><p>The giant sphere, which had the radius of a hundred meters was floating in mid air as it devoured the energy that had flowed out from the spheres he had run past.</p><br/><p>Hansoo was curious about the identity of the sphere but he had something else he had to worry about.</p><br/><p>‘....Where did he go?’</p><br/><p>Hansoo was confused as he looked at the panels beside the sphere.</p><br/><p>Since this giant structure wouldn’t move on its own, the player definitely activated this himself.</p><br/><p>But there was no trace of the player who activated this.</p><br/><p>Not even the trace of battle.</p><br/><p>‘...Did he logout or something?’</p><br/><p>As Hansoo frowned thinking about the player who suddenly disappeared.</p><br/><p>Rummmblee!</p><br/><p>A tremendous earthquake could be felt.</p><br/><p>‘This….?’</p><br/><p>It wasn’t really an earthquake.</p><br/><p>Hansoo was slightly worried about the whole space collapsing.</p><br/><p>Booooom!</p><br/><p>As if it finally started acting up, the sphere in front of him began to let out a blinding amount of light.</p><br/><p>At the same time.</p><br/><p>Rummmblee.</p><br/><p>Hansoo finally realized why the earthquake had occurred and what the giant sphere in front of his eyes was.</p><br/><p>Hansoo’s body and the room he was located in started to slowly rise up.</p><br/><p>Smashing through the countless layers of ice above.</p><br/><p>‘... It was an engine...?’</p><br/>\n</div>"}