{"title": "Chapter 312 : Clash (1)", "id": 312, "volume": 4, "url": "http://boxnovel.org/reincarnator-chapter-312-clash-1", "volume_title": "Volume 4", "body": "<h1>Chapter 312 : Clash (1)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 312 : Clash (1)</p><br/><p>In this hell.</p><br/><p>For what must they live for?</p><br/><p>We need someone to lead us.</p><br/><p>………………………………………….</p><br/><p>‘Sign...I envy the previous generations.’</p><br/><p>—cough— </p><br/><p>The adventurer, Niclouse, looked into the sky above the crumbling war fortress and puked out blood.</p><br/><p>Although the previous generation needed to go through difficult situations without any knowledge, at least they’d had a leader.</p><br/><p>To him, there was no Kang Hansoo.</p><br/><p>Only an evil Dark King who pretended to be him.</p><br/><p>Niclouse thought back to the words the Dark King had always mumbled in the past.</p><br/><p>‘F***ing maniac.’</p><br/><p>Niclouse cursed that man as he forcibly raised his body up.</p><br/><p>At this rate, he would get squashed to death by the rubble.</p><br/><p>He started to slowly climb up.</p><br/><p>Away from the battlefield.</p><br/><p>………………………………………</p><br/><p>—boooom!— </p><br/><p>“Hahahaha!”</p><br/><p>The Dark King laughed as he felt the overflowing power inside him.</p><br/><p>He didn’t feel the same glee and joy of the past when he’d become a transcendent; another feeling now filled him.</p><br/><p>When he’d first become a transcendent, it was as if he’d become a brand new bowl.</p><br/><p>A weak sauce tray being broken apart and being born anew as a large, strong bowl.</p><br/><p>And how it felt as if that exact bowl had been filled to the brim.</p><br/><p>To the point that the water inside it could overflow at any moment.</p><br/><p>Tens of thousands of crystals exploded, giving him strength.</p><br/><p>It changed his body and gave him enough power to smash apart the world.</p><br/><p>“Hahaha! Try catching this!”</p><br/><p>A bright orb appeared in the hands of the Dark King.</p><br/><p>[Triple Demonic Bullets]</p><br/><p>A regular skill which could be acquired with ease, even in the old Red Zone.</p><br/><p>It had a speedy reload time and was easy to fire, but it could only fire in a straight line and didn’t do much damage.</p><br/><p>It was good enough to use as a probe, but not to deal fatal damage to a person.</p><br/><p>Usually, at least.</p><br/><p>If a normal person used it, that is.</p><br/><p>—rumble!— </p><br/><p>Thunder and lightning exploded out from the orb.</p><br/><p>Then— </p><br/><p>—booom!— </p><br/><p>The orb shot out from the Dark King’s hands, the ruins of the fortress were lifted into the air, and the space around them trembled.</p><br/><p>Dust flew apart in all directions as if a bomb had exploded.</p><br/><p>And through the dust— </p><br/><p>—boom! boom! boom! boom!— </p><br/><p>The bright orb smashed apart everything in its path as it continued to rush towards Hansoo.</p><br/><p>It created gales in its wake and turned the stone below it into a river of lava.</p><br/><p>And as the orb made contact with Hansoo’s spear— </p><br/><p>—booom!— </p><br/><p>A blinding light exploded outwards.</p><br/><p>The surrounding ruins of the War Fortress turned into dust from the shock wave, and the ground nearby began to sizzle.</p><br/><p>And the Dark King laughed coldly at this scene.</p><br/><p>‘Mmm. That spear definitely suits me.’</p><br/><p>He could clearly see it during the explosion.</p><br/><p>The golden spear that was trying its best to disperse the energy.</p><br/><p>Although it had met the wrong owner—in his opinion, anyway—the fact that it could withstand his overflowing energy was something to compliment.</p><br/><p>The Dark King stared at the golden spear in Hansoo’s hands and then looked at the imitation in his own hands with a dissatisfied expression.</p><br/><p>Then— </p><br/><p>—crunch— </p><br/><p>He split the spear into two.</p><br/><p>Though it was a good spear, it was a spear that could be found anywhere and then merely covered in gold.</p><br/><p>It was too weak to withstand the strength of a transcendent like himself.</p><br/><p>Though he had broken his own weapon during battle, his expression was still bright.</p><br/><p>Since a spear like that wouldn’t help him much in a fight anyway.</p><br/><p>And soon he would be able to gain the real thing.</p><br/><p>‘Strength really is the best.’</p><br/><p>In the past.</p><br/><p>He had revered Hansoo.</p><br/><p>The man who had succeeded in terraforming the previous zones into a livable space.</p><br/><p>Though he hadn’t seen Hansoo’s actions in person, he was part of the group that followed right behind Hansoo and Mihee.</p><br/><p>Though he hadn’t seen them personally, Hansoo’s footprints could be felt all over his body as he climbed his way up.</p><br/><p>He felt the might of the World Tree Hansoo had revived in the Red Zone.</p><br/><p>The giant Gragos that Hansoo had succeeded in taming in the Orange Zone.</p><br/><p>Countless Satellite Fortresses that covered the skies in the Yellow Zone.</p><br/><p>And in the Green Zone, he had fought to help Hansoo during the Battle of the War Fortress.</p><br/><p>He had personally seen the hole appear in the sky as the elevators descended and the world transformed.</p><br/><p>He reveled in the footprints of this giant and respected them.</p><br/><p>Respect towards the being that had done things he could not.</p><br/><p>He remembered the stories of those who had seen Hansoo up close, and remembered them during the hard times to keep himself going.</p><br/><p>He’d kept going until the day he could meet the man in his dreams.</p><br/><p>But now.</p><br/><p>With his strength.</p><br/><p>His thoughts had changed.</p><br/><p>‘If I had strength, I could’ve done that as well.’</p><br/><p>Kang Hansoo.</p><br/><p>He was stronger than anyone else and had succeeded against any enemy.</p><br/><p>There were some who’d helped him, and those beside him were also quite strong, but in the end, his individual strength had played the biggest role.</p><br/><p>If Hansoo had done it. </p><br/><p>Couldn’t he, who was now even stronger than Hansoo, do it as well?</p><br/><p>‘Just wait. I will be the one to lead you guys now.’</p><br/><p>There was a reason why he had spared a group of people, despite having been able to turn them into crystals as well.</p><br/><p>How could a king be a king by himself?</p><br/><p>He needed subjects.</p><br/><p>And the people at his side would now serve the strongest king in history.</p><br/><p>Even stronger than this living legend.</p><br/><p>“Hahaha!”</p><br/><p>The Dark King laughed maniacally and jumped down.</p><br/><p>He could only win.</p><br/><p>There was a clear difference in power.</p><br/><p>The energy absorbed from the sacrifice of tens of thousands of Kang-Kions transformed into skills.</p><br/><p>A skill useful in dealing with small fry, but not really those of similar levels—an immolation type of skill—exploded out from his body.</p><br/><p>[Dark Sun].</p><br/><p>—rumble— </p><br/><p>A dark sun which set everything nearby ablaze rose up from the Dark King’s body.</p><br/><p>“F***!”</p><br/><p>“Run!”</p><br/><p>The screams of countless adventurers were heard by the Dark King, but he merely ignored them.</p><br/><p>Since those who ran away didn’t have the qualifications anyway.</p><br/><p>Then— </p><br/><p>Hansoo, surrounded by golden light, walked out from the dust clouds.</p><br/><p>Though he was covered in dust and minor injuries, he was mostly fine.</p><br/><p>And the Dark King’s expression darkened at this unexpected turn.</p><br/><p>‘Though it was just a probe…’</p><br/><p>As the Dark King frowned.</p><br/><p>Hansoo also frowned as he spat out— </p><br/><p>“I’ve waited two years, you guys can’t only be at this level right?”</p><br/><p>The Dark King almost cried at Hansoo’s look of contempt, as if he was not worthy.</p><br/><p>It was similar to those eyes he had seen in the past.</p><br/><p>The eyes of the being that had given him this strength.</p><br/><p>Hansoo was showing him the exact same expression.</p><br/><p>But even before the tears could come out from the Dark King’s eyes— </p><br/><p>Hansoo moved first.</p><br/><p>He needed to teach a lesson to the Dark King who had fearlessly approached him.</p><br/><p>‘You should’ve kept your distance…’</p><br/><p>Then— </p><br/><p>—boom!— </p><br/><p>The sound of a huge explosion blasted out from Hansoo’s position as the entire area around him crashed down.</p><br/><p>Using the tremendous earthquake-like shockwaves as momentum, Hansoo’s body shot out like lightning.</p><br/><p>And now dark-gold energy surrounded Hansoo’s body.</p><br/><p>The Reinforcement skill covering Hansoo’s body was no longer translucent.</p><br/><p>It had been compressed to the point of resembling silk.</p><br/><p>Hansoo, covered in the Demonic Dragon Reinforcement, dashed towards the Dark King.</p><br/><p>‘...I can block it!’</p><br/><p>The Dark King was shocked for a moment, but then relaxed.</p><br/><p>Since he could clearly see his movements.</p><br/><p>It wasn’t at a level where he couldn’t catch up.</p><br/><p>Not at a level he couldn’t react to.</p><br/><p>Actually, he could even move faster.</p><br/><p>‘I shall show you my strength.’</p><br/><p>He wanted to show off.</p><br/><p>The strength he had gained.</p><br/><p>He wanted to smash his opponent apart.</p><br/><p>The Dark King started to burn the Dark Sun around his body with even more fervour.</p><br/><p>Then— </p><br/><p>—whoosh— </p><br/><p>The Dark King swung his fist with all his might— </p><br/><p>Towards the tip of Hansoo’s spear.</p><br/><p>‘I will show you the difference in our strength!’</p><br/><p>And as his fist swung out— </p><br/><p>—booooooom!— </p><br/><p>A fist covered in black flames, and a spear covered in dark-gold silk collided.</p><br/><p>And the Dark King smiled at this scene.</p><br/><p>‘I...I can win!’</p><br/><p>His Dark Sun was burning the silk-like reinforcement on the spear.</p><br/><p>Though his opponent’s reinforcement was more compressed than his own, his endless flames still managed to burn through it.</p><br/><p>But as the Dark King’s smile broadened at the sight of the spear bending more and more.</p><br/><p>A change occurred.</p><br/><p>—swoosh!— </p><br/><p>The silk covering Hansoo’s entire body started to sway and move about.</p><br/><p>Then— </p><br/><p>—whoosh!— </p><br/><p>The Demonic Dragon Reinforcement covering Hansoo’s entire body started to condense into a single point.</p><br/><p>Towards the the tip of his spear.</p><br/><p>And as the thin silk-like reinforcement focused onto a single point— </p><br/><p>The Reinforcement started to let out a blinding light in all directions.</p><br/><p>Then— </p><br/><p>—booom!— </p><br/><p>“Uwaaaa!”</p><br/><p>The Dark King freaked out at the scene of his Dark Sun being instantly shredded apart, and quickly retreated.</p><br/><p>Blood gushed out from the fist that had collided with the spear.</p><br/><p>‘No...NO! NO WAY’</p><br/><p>The Dark King was extremely confused.</p><br/><p>His opponent was merely a relic of the past.</p><br/><p>He had clearly been lazing around.</p><br/><p>Since the man should’ve been far above in the upper zones.</p><br/><p>With the amount of work he himself had gone through, he couldn’t lose like this.</p><br/><p>Then— </p><br/><p>—boom!— </p><br/><p>A tremendous amount of energy exploded out from the Dark King’s body.</p><br/><p>He had a dream.</p><br/><p>He couldn’t fall here.</p><br/><p>Though it was a person he’d revered, he could not allow Hansoo to block his path.</p><br/><p>‘I...WILL...NOT...LOSE!’</p><br/><p>—rumble— </p><br/><p>The still-burning remains of the Dark Sun disappeared. </p><br/><p>As well as every other skill in his body.</p><br/><p>Every ounce of power in his body turned into a single skill.</p><br/><p>A skill that the man who had given him this strength had left behind.</p><br/><p>…………………………………………………………..</p><br/><p>Ten thousand mediocre skills could not defeat a single mastered skill.</p><br/><p>That was why the transcended needed to know how to focus on a single skill.</p><br/>\n</div>"}