{"title": "Chapter 319 : Darkness (1)", "id": 319, "volume": 4, "url": "http://boxnovel.org/reincarnator-chapter-319-darkness-1", "volume_title": "Volume 4", "body": "<h1>Chapter 319 : Darkness (1)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 319 : Darkness (1)</p><br/><p>The Dark King pondered as he looked at the scene in front of him.</p><br/><p>As to which side was the correct one to take.</p><br/><p>If he took Zeus’s side and suppressed Hansoo, he would gain a chance to escape from this pain.</p><br/><p>After all, life was the most important thing everyone had, and he would just need to threaten Hansoo to release his suffering.</p><br/><p>But something bugged his mind.</p><br/><p>If he helped Zeus and they still lost?</p><br/><p>What would that man do then?</p><br/><p>…</p><br/><p>‘...That would be terrifying.’</p><br/><p>But the Dark King soon decided.</p><br/><p>He could not live in eternal pain like this.</p><br/><p>He wanted to eat delicacies, sleep with beautiful woman, and enjoy everything a powerhouse like him deserved.</p><br/><p>Claws started extending out from the Dark King’s hand.</p><br/><p>‘Kill.’</p><br/><p>One could still get used to pain after a while.</p><br/><p>Though he couldn’t withstand the pain in his body, he’d gotten used to one thing during the past few days.</p><br/><p>Fighting amidst the pain.</p><br/><p>‘Good.’</p><br/><p>Zeus smiled as he saw the Dark King bring out his claws.</p><br/><p>He didn’t like being injured, he prefered to completely dominate the other party.</p><br/><p>And of course, having another person to fight with was always a plus.</p><br/><p>—rumble!— </p><br/><p>The Silveril lengthened once again.</p><br/><p>—then— </p><br/><p>—booooom!— </p><br/><p>Zeus pounced off the ground and swung his blade against Hansoo.</p><br/><p>—crackle!— </p><br/><p>Lightning followed the path of the blade as it smashed into the nearby area. </p><br/><p>The sword clashed with the shield, creating sparks, and Hansoo saw the Dark King charging towards him past the shield.</p><br/><p>Hansoo chuckled.</p><br/><p>Of course anyone would want to escape such eternal pain.</p><br/><p>But they should also use their brains.</p><br/><p>Hansoo flicked his fingers and mumbled.</p><br/><p>“Maybe you can’t think properly because you’re in pain. Shall I help you?’</p><br/><p>Then— </p><br/><p>—kwadddddddk!— </p><br/><p>“Ah...Ahh...AHHHHHH!”</p><br/><p>The Dark King fell mid-dash, and started to scream as all his skills dispersed.</p><br/><p>—ssssssh— </p><br/><p>Zeus grit his teeth as he looked at the Dark King rolling around the floor.</p><br/><p>‘F***… I thought as much, but still.’</p><br/><p>Of course the person who’d put on such a suppression method wouldn’t allow any forms of retaliation.</p><br/><p>He’d tried to convince the Dark King just in case, but it seemed it wasn’t very useful.</p><br/><p>Well, the one in pain was the Dark King anyway, and not him.</p><br/><p>‘This is good, at least I created an opening.’</p><br/><p>The slight opening that was caused by the finger flick.</p><br/><p>Normal adventurers wouldn’t be able to notice and utilize this, but he could.</p><br/><p>A tiny, tiny opening.</p><br/><p>—crackle!— </p><br/><p>His Silveril slid past the shield and charged towards Hansoo’s right arm.</p><br/><p>—crack!— </p><br/><p>A satisfying sound could be heard from his right shoulder, and Zeus smiled at this.</p><br/><p>‘This should be good enough.’</p><br/><p>—chzzzchchzchz!— </p><br/><p>The tremendous flow of current surged through the Silveril.</p><br/><p>Even though Hansoo was a transcendent, he was still a human.</p><br/><p>If his nerves burned up and his heart stopped, he would still die.</p><br/><p>‘I’ll make you suffer a bit more.’</p><br/><p>Zeus didn’t focus on his heart, but rather on the nerves all over Hansoo’s body.</p><br/><p>This would cause the pain to intensify several times more, and could even cause paralysis.</p><br/><p>But at that moment— </p><br/><p>‘What the…what is this?!’</p><br/><p>The lightning that he had poured into the other party’s body was no longer in his control.</p><br/><p>Instead it was moving according to Hansoo’s will.</p><br/><p>‘What the fuck?... Is this a Spirit?’</p><br/><p>He had heard many stories about Spirits before.</p><br/><p>But he had never heard of a Spirit that could suck out the energy of the opponent however one willed.</p><br/><p>‘Damn… no!’</p><br/><p>In the opening that was created when he lost control over his lightning, Hansoo smashed his spear towards his body.</p><br/><p>Right above his heart.</p><br/><p>—kuddduduk— </p><br/><p>“Kuhuk!”</p><br/><p>They were too close to each other.</p><br/><p>The spear that penetrated through the lightning armor and his ribs continued to dig into his body.</p><br/><p>Right into his heart.</p><br/><p>“Huaaa….”</p><br/><p>Zeus breathed out; somehow he was still alive, but only just barely.</p><br/><p>—zzchchczhzz— </p><br/><p>Hansoo, who had been electrocuted, spoke with a cold expression.</p><br/><p>“Release this before things turn nastier.”</p><br/><p>“…”</p><br/><p>Even he would die if his heart were penetrated.</p><br/><p>Zeus slowly nodded and sat on the ground.</p><br/><p>…………………………………………………</p><br/><p>‘What is this bastard?’</p><br/><p>Zeus frowned as he looked at the man who was rapidly healing in front of him.</p><br/><p>This man had been hit by an attack that could have easily burned any normal transcendent countless times over.</p><br/><p>Even if he had a Spirit, the body should not be able to heal back this quickly.</p><br/><p>The healing rate was so fast that it was visible to the eye, and his right shoulder was basically completed mended already.</p><br/><p>‘…Is he a lizard or something?’</p><br/><p>Zeus looked at the man that had defeated him.</p><br/><p>He’d assumed that he was pushing that man back, but as he thought about it, that didn’t seem to be the case.</p><br/><p>That man’s expression hadn’t changed a single time during the whole fight, and he still seemed to have many things hidden up his sleeves.</p><br/><p>Though the man had received a lot more injuries, it now seemed that this was just his style of fighting.</p><br/><p>Since even he would use his shield to fight if he had a cheat-like healing ability as this man’s.</p><br/><p>‘And it even seems like he grew stronger during our fight…’</p><br/><p>Zeus shook his head.</p><br/><p>That wasn’t the important part.</p><br/><p>‘What do I do now? The situation is really bad.’</p><br/><p>At first, he’d been really worried.</p><br/><p>Of being turned like the Dark King.</p><br/><p>But thankfully, the man had only suppressed his mana, and hadn’t turned him like the Dark King.</p><br/><p>Well, the spear was placed right outside his heart too.</p><br/><p>‘Thankfully…wait, why am I thankful…?’</p><br/><p>Zeus mocked himself for having such thoughts.</p><br/><p>Even if one dodged the worst case scenario, they would still be in deep shit.</p><br/><p>Like now.</p><br/><p>Then— </p><br/><p>After almost healing up, the man stood and spoke to him.</p><br/><p>“So, how many of you guys were out there again?”</p><br/><p>Zeus pondered for a moment.</p><br/><p>‘How should I answer so it’s in my favor?...’</p><br/><p>A very short moment of thought.</p><br/><p>But Hansoo didn’t miss this.</p><br/><p>“Yeah...things kept inside don’t really come out on their own, do they?’</p><br/><p>‘Gotta squeeze them out as always.’</p><br/><p>Hansoo smiled coldly as he started to gather a dark-red-colored energy in his hand.</p><br/><p>The sight immediately caused Zeus to panic.</p><br/><p>Since that was the same vicious energy currently inside the Dark King’s body.</p><br/><p>“Ahh! No!”</p><br/><p>“Don’t worry, it’s slightly different.”</p><br/><p>Even before Zeus could react, the dark-red energy had penetrated into his body.</p><br/><p>But soon Zeus realized that it wasn’t doing anything, and was now confused.</p><br/><p>‘Huh?’</p><br/><p>Hansoo continued to smile coldly.</p><br/><p>“I need to use you. How will I be able to use you if I turn you into that thing over there? Don’t worry. This is just… well, let’s just say that if I die, you’ll die, too.”</p><br/><p>“What!? You crazy bastard!”</p><br/><p>Zeus flew into a rage.</p><br/><p>He’d thought that he was already in one of the worst possible situations, but apparently that wasn’t the case.</p><br/><p>And he knew that what the man had said was true.</p><br/><p>The dark-red energy squirming around his heart and his brain proved it.</p><br/><p>Hansoo laughed at Zeus.</p><br/><p>“How about it? Have your thoughts changed since we’re now in the same boat?”</p><br/><p>“F***ing hell…”</p><br/><p>Zeus sighed.</p><br/><p>‘Crazy bastard… I don’t know what he’s thinking, but I hope he lives a calm life…’</p><br/><p>“What are your goals? I need to know your goals to answer your question. I should at least know what you want since we’re in the same boat, right?’</p><br/><p>Hansoo nodded at these words.</p><br/><p>“Simple. I need a lot of people like you. As many as possible.”</p><br/><p>Hansoo was planning to fish out every last one of them.</p><br/><p>And if this guy told him their locations, things would become even easier.</p><br/><p>And the moment Zeus heard this, he grit his teeth.</p><br/><p>‘F***, this one is going to be trouble.’</p><br/><p>Out of the eleven out there, none of them were easy targets.</p><br/><p>He grit his teeth as he predicted a future of himself becoming a meat shield for this bastard.</p><br/><p>He would need to do his best in that case.</p><br/><p>Since his comrades, no, they were his enemies now, weren’t easy to deal with.</p><br/><p>‘What the hell is this guy’s identity?’</p><br/><p>Then— </p><br/><p>Something flashed through his mind.</p><br/><p>The mumbles of the being that had given him and his allies their strength.</p><br/><p>‘...Their sizes are completely different. Were they the same person?’</p><br/><p>But for some reason he felt suspicious.</p><br/><p>Someone who had appeared out of nowhere.</p><br/><p>A similar outfit.</p><br/><p>And the golden spear in his hand did not look simple.</p><br/><p>Zeus cautiously asked just in case.</p><br/><p>“...Are you perhaps that Kang Hansoo?”</p><br/><p>Hansoo didn’t reply to his question, but Zeus knew.</p><br/><p>That he was Kang Hansoo.</p><br/><p>And the moment he realized this— </p><br/><p>‘F***ing hell…’</p><br/><p>The one who had turned him into a transcendent seemed to be half crazy, but one thing was clear.</p><br/><p>They felt an Intense amount of rage towards Hansoo.</p><br/><p>And he was sure that the being had ways of finding out if Hansoo had come back or not.</p><br/><p>Then— </p><br/><p>Zeus’s eyes turned to the War Fortress.</p><br/><p>‘...Was that the reason why he put the Dark King around this area?’</p><br/><p>Zeus grit his teeth.</p><br/><p>…………………………………….</p><br/><p>The normal adventurers in the War Fortress were gossiping amongst themselves.</p><br/><p>They couldn’t handle this intense feeling of unease.</p><br/><p>“F***...What exploded this time?”</p><br/><p>“...Why are those guys not climbing up if they’re that strong already? Why are they causing chaos around this area?”</p><br/><p>They thought that everything would end after the Dark King had finally been dealt with, but something else had occurred just a few days after.</p><br/><p>Though they were quite a long distance apart from the battle, the shockwaves from the thunderstorm could be felt in their area.</p><br/><p>Though the man had won again, there were no guarantees that the man would continue to win.</p><br/><p>Of course they couldn’t bear this constant lingering sense of danger.</p><br/><p>One of the people asked Akran.</p><br/><p>“...Can’t we just go up or something? Damn it all.”</p><br/><p>Akran scoffed.</p><br/><p>“Does anything change if we go up?”</p><br/><p>“...”</p><br/><p>The man fell into silence.</p><br/><p>It was true.</p><br/><p>No matter where you go, if you yourself weren’t strong, nothing would change.</p><br/><p>Akran spoke to the man who had fallen silent.</p><br/><p>“This is a chance for us to raise our strength, remember? That man is not our enemy.”</p><br/><p>The man turned around with a grim expression.</p><br/><p>‘Though he’s not a enemy…’</p><br/><p>That man was not like the Dark King.</p><br/><p>He had given them a chance to become stronger.</p><br/><p>But that didn’t help his fears from going away.</p><br/><p>‘...That man is actually more fearsome.’</p><br/><p>Though the transcendents, who they could not handle, were terrifying.</p><br/><p>That man was even more so, since he was hunting those very transcendents.</p><br/><p>Any power that wasn’t under one’s control was a symbol of fear.</p><br/><p>Then— </p><br/><p>Somebody approached Akran and spoke.</p><br/><p>“Uh...I think you’ll need to come over for a bit.”</p><br/><p>“What’s up?”</p><br/><p>The adventurer spoke carefully.</p><br/><p>“...One of the captured underlings of the Dark King escaped.”</p><br/><p>“What? How?”</p><br/><p>Akran frowned.</p><br/>\n</div>"}