{"title": "Chapter 324 : Ark-Roa (3)", "id": 324, "volume": 4, "url": "http://boxnovel.org/reincarnator-chapter-324-ark-roa-3", "volume_title": "Volume 4", "body": "<h1>Chapter 324 : Ark-Roa (3)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 324 : Ark-Roa (3)</p><br/><p>Crunch.</p><br/><p>Crunch. Crunch.</p><br/><p>As it finished devouring another person, the Ark-Roa’s color and shape became more and more defined. </p><br/><p>Limbs sprouted out, and its body shrunk down in size.</p><br/><p>Though it was now smaller, it had become stronger overall and even its intelligence had risen.</p><br/><p>And slowly, the memories of the humans it had eaten started to appear inside its head.</p><br/><p>Well, it had the memories after consuming them actually.</p><br/><p>It just didn’t have the intelligence to decipher the meanings behind them up until now.</p><br/><p>It had solely been focused on instinctively hunting and finding nutrition.</p><br/><p>But not anymore.</p><br/><p>There were about thirteen nutritious ones left.</p><br/><p>Ten of which were comrades of the two it had eaten.</p><br/><p>Two were enemies with the ten.</p><br/><p>One was feared by all.</p><br/><p>Kirrrik.</p><br/><p>Ark-Roa pondered with its newfound intellect.</p><br/><p>It was not a match for the being that everyone feared.</p><br/><p>But it wasn’t hard to reach that level.</p><br/><p>It would just need to eat about four more to get to the next stage.</p><br/><p>Then everything would be over.</p><br/><p>It could then devour the world.</p><br/><p>Ark-Roa continued to think.</p><br/><p>It was time to choose.</p><br/><p>Either to eat the two who were separated from the others, and then head for the ten.</p><br/><p>Or head towards the ten.</p><br/><p>Of course, it didn’t have to think very long.</p><br/><p>Its hunger had continued to call out to it.</p><br/><p>And it was even worse because it had absorbed the greed of the humans it had eaten.</p><br/><p>Greed for power.</p><br/><p>Greed to crush everything beneath its feet.</p><br/><p>Though it wasn’t within the memories of the humans it had eaten, it had a feeling that it needed to get stronger as soon as possible.</p><br/><p>This newly enhanced greed and gluttony drove the Ark-Roa past the great tundra.</p><br/><p>…………………………………..</p><br/><p>‘F***...F***. F***. What do I do?’</p><br/><p>Hermes was at a loss.</p><br/><p>He knew instinctively that the monster standing below the tower was a level above them.</p><br/><p>But then— </p><br/><p>A familiar voice could be heard behind him.</p><br/><p>“You bastard, you just tried to run away, right?”</p><br/><p>Hermes shrugged his shoulders.</p><br/><p>“Don’t fuss over it that much, you would’ve done the same thing.”</p><br/><p>“...Ugh.”</p><br/><p>Zeus gave up.</p><br/><p>They were all like this.</p><br/><p>Since that man had deliberately picked people like this in the first place.</p><br/><p>‘What a shitshow.’</p><br/><p>One after another, their allies started to gather.</p><br/><p>—ssssss— </p><br/><p>“What’s up? Why did you call us to meet up?”</p><br/><p>“F***…Did you call us over to deal with him?”</p><br/><p>‘One…Two.Three.’</p><br/><p>Zeus frowned as he counted.</p><br/><p>Other than Hades, Hermes, and himself, there should be nine left.</p><br/><p>But only five had come.</p><br/><p>“Where’s Demeter?”</p><br/><p>Zeus asked in confusion.</p><br/><p>He never knew what that b**** Athena was ever up to, and the other two were arrogant so it made sense that they wouldn’t come.</p><br/><p>‘Athena is really hard to meet. I’ve seen her maybe…once? Twice?’</p><br/><p>But this Hermes kid always followed Demeter around while wagging his tail.</p><br/><p>For someone whose territories were so close to not come together…</p><br/><p>Hermes inwardly jolted at the question.</p><br/><p>‘Should I answer?’</p><br/><p>But the answer came from someone else.</p><br/><p>Kyle, also known as Hades, raised his hand.</p><br/><p>“She was eaten.”</p><br/><p>“What? Don’t joke around…What could even eat us?”</p><br/><p>One of the girls who had arrived after Zeus scoffed, but Zeus cursed out since he knew the identity of the Ark-Roa.</p><br/><p>“F***…it’s that fast already. Why did you just leave if you knew she was being eaten? Why didn’t you help?”</p><br/><p>“…Apparently, you haven’t seen it yet.”</p><br/><p>Hades replied with a heavy expression.</p><br/><p>They wouldn’t really help each other if they were dying anyway.</p><br/><p>Even if their own children were being eaten, they wouldn’t actually go and help them.</p><br/><p>Hades really didn’t want to approach the creepy creature that devoured Demeter. Afterwards it had gone through some sort of metamorphosis, making strange noises all the while.</p><br/><p>The other trancendents noticed the strange tension between Zeus and Hades, and grew uneasy as well.</p><br/><p>“Hey, what’s up? What really happened?”</p><br/><p>“Why did Demeter die?”</p><br/><p>Everybody was making confused expressions.</p><br/><p>And Hermes realized the gist of the situation.</p><br/><p>‘That bastard… I know why he made us now.’</p><br/><p>Hermes clenched his teeth.</p><br/><p>He realized why that man had made them and left them alone to roam freely.</p><br/><p>And why that man had reappeared the moment that black monster appeared.</p><br/><p>Why that powerful man was now just guarding the exit to go up.</p><br/><p>He realized it all.</p><br/><p>‘We…we were raised as livestock…’</p><br/><p>The only exit had been blocked and that horrifying monster now roamed this world.</p><br/><p>Then— </p><br/><p>A thought appeared in Hermes’s head.</p><br/><p>“Hey Zeus, you said you got caught by someone, right?”</p><br/><p>“…”</p><br/><p>Zeus frowned. </p><br/><p>Hermes ignored Zeus’s expression and continued to speak.</p><br/><p>“You said that he has a bad relationship with that man over there right? It looks like that man was the one who released the monster that ate Demeter.”</p><br/><p>Zeus nodded.</p><br/><p>Hermes’s guesses were mostly on point.</p><br/><p>“But…how did you know that Demeter died?”</p><br/><p>Hermes cut Zeus off as he continued to speak.</p><br/><p>“That’s not important. Anyway, that guy who caught you hasn’t run away yet since he’s confident, right?”</p><br/><p>“Right.”</p><br/><p>Hermes chuckled.</p><br/><p>“Let’s go to him.”</p><br/><p>“Huh?”</p><br/><p>“What else can we do? Let’s go help him. That’s the only path we can take at this point.”</p><br/><p>Help the mysterious man who they had no information about.</p><br/><p>But, then again, their choices were very, very limited.</p><br/><p>At this rate they would only become food for that monster.</p><br/><p>But seeing that the guy had called them over, it looked like he had something up his sleeve.</p><br/><p>Which meant that right now, no matter what, they had to help that man who had captured Zeus.</p><br/><p>Whether to stab him in the back or run away without fighting him, that would only matter if they survived from this fight.</p><br/><p>There was nothing for them to gain from just loitering around here anyway.</p><br/><p>Zeus frowned at Hermes’s words.</p><br/><p>‘...Dumbasses. You’ll all probably be his slaves if you go to Hansoo…’</p><br/><p>He hadn’t gathered them here to listen to Hansoo’s instructions.</p><br/><p>But rather to ask for help.</p><br/><p>To suppress Hansoo, and just leave him at the point of death.</p><br/><p>Once they pressed him down with their weapons, they could just leave him with a breath of life remaining, and keep him in a safe place. And then he would be free.</p><br/><p>But it looked like that wouldn’t work anymore.</p><br/><p>‘Damn…’</p><br/><p>As Zeus frowned.</p><br/><p>A voice rang out.</p><br/><p>“Retards. You go do that. I’m betting my luck on something with higher chances.”</p><br/><p>“Huh? What are you planning to do?”</p><br/><p>Hermes frowned at the curvaceous woman who had stepped out.</p><br/><p>The woman looked over her body, and then gulped.</p><br/><p>“If he’s also a man…something will happen, one way or another.”</p><br/><p>“Come on, Hera…”</p><br/><p>“You f***er, call me by my name. Grow up, did I say I was going to be his wife?”</p><br/><p>Hera—real name, Allison—cursed at Zeus.</p><br/><p>No matter what angle they looked at it from, the man who had created them held the absolute advantage.</p><br/><p>Shouldn’t they stick to the winning side? At least she was going to.</p><br/><p>‘Yeah… If you’re also a man, then…’</p><br/><p>She was useful, strong and beautiful.</p><br/><p>Usually, she would pull out the eyes of anyone who had such thoughts towards her, but with their current situation, she had to utilize everything she had at her disposal.</p><br/><p>Allison quickly headed towards the man standing below the tower.</p><br/><p>……………………………………….</p><br/><p>—rumble— </p><br/><p>The Dark King violently trembled.</p><br/><p>When this man had attacked, he felt as if the world had collapsed.</p><br/><p>‘Was there this much difference…?’</p><br/><p>If he knew the differences were this large than he wouldn’t have even tried to climb up.</p><br/><p>The Dark King trembled in fear as he stared at the man stepping on him.</p><br/><p>“Ughhh…”</p><br/><p>The man raised his eyebrows.</p><br/><p>“Why does this dumbass just keep screaming…?”</p><br/><p>The man put his hand on the Dark King’s back.</p><br/><p>Then— </p><br/><p>—swoooosh!— </p><br/><p>The dark red aura started to get sucked out from the Dark King’s brain and his heart.</p><br/><p>Into the hands of the man.</p><br/><p>“Ahhh…haa…”</p><br/><p>The Dark King even forgot the pain of his cut-off legs as he made a joyous expression.</p><br/><p>Since the pain of his severed leg was nothing compared to what Hansoo had given him.</p><br/><p>The man ignored the Dark King and focused solely on the dark red cloud in his hand, poking it with his finger.</p><br/><p>—chiiiiik— </p><br/><p>The dark red aura tried to savagely burn his finger, but it couldn’t withstand the aura surrounding the man’s body and it soon dispersed into the air.</p><br/><p>And the man smirked.</p><br/><p>‘...Was he only this strong?’</p><br/><p>The man sighed in relief.</p><br/><p>He had been uneasy the whole time he’d planned this.</p><br/><p>He had vowed for revenge, but he didn’t know how strong Hansoo had become in the past two years.</p><br/><p>This was why he had released the Ark-Roa, which even he was wary of.</p><br/><p>He felt like his own strength wouldn’t be enough.</p><br/><p>But it looked like there was no need for him to release the Ark-Roa.</p><br/><p>‘Well, let’s go beat up Hansoo first…’</p><br/><p>But the man soon shook his head.</p><br/><p>Since a girl had come to bother him.</p><br/><p>Unlike the other twelve, including the Dark King.</p><br/><p>The one who had escaped his watch as soon as she was made.</p><br/><p>‘If only everyone was this easy to read.’</p><br/><p>“Hello?”</p><br/><p>The man smiled coldly as he looked at the woman who was approaching him with a charming smile of her own.</p><br/><p>…………………………………..</p><br/><p>800 kilometers west of the War Fortress.</p><br/><p>—rumble— </p><br/><p>“Haa...Haa…”</p><br/><p>Taesang was gasping for air after having run for so long.</p><br/><p>‘…F***. I don’t know if I’m doing the right thing.’</p><br/><p>He had been running like a crazed person to find that man’s friends, who all apparently lived in the west.</p><br/><p>But he was scared out of his wits because of that Ark-Roa thing that was roaming the lands.</p><br/><p>‘No, it shouldn’t be interested in weaklings like me. He said it wasn’t interested in ants…’</p><br/><p>Though he was more of a dog than an ant.</p><br/><p>Of course, that wasn’t really reassuring.</p><br/><p>The fact that he had some strength was the reason why he’d been entrusted with this job anyway.</p><br/><p>Though he wasn’t the main target of the Ark-Roa, he was able to pass through the tundra which the others would have a hard time crossing.</p><br/><p>—boooom!— </p><br/><p>Kyaak!</p><br/><p>Taesang continued to run after turning four Kang-Kions into powder.</p><br/><p>Well, until something blocked his path.</p><br/><p>—OOooong— </p><br/><p>The space in front of him had split apart.</p><br/><p>Then— </p><br/><p>“Where are you going? I’ve never seen you before.”</p><br/><p>“Ahh!”</p><br/><p>—boom!— </p><br/><p>Taesang freaked out, and slashed out with his sword at the silhouette of the woman. But his blades, which could chop apart abyssal monsters with ease, were caught by the woman’s hands.</p><br/><p>‘What the hell…!?’</p><br/><p>—toong!— </p><br/><p>Taesang cursed, and backed off.</p><br/><p>“Hmm…”</p><br/><p>The woman figured out where Taesang was heading off to, and then smiled as if she realized something.</p><br/><p>“I don’t think you’ll need to go?”</p><br/><p>“Huh?”</p><br/><p>“It should be done by now.”</p><br/>\n</div>"}