{"title": "Chapter 337 : 5th area, Old Blue Zone (2)", "id": 337, "volume": 4, "url": "http://boxnovel.org/reincarnator-chapter-337-5th-area-old-blue-zone-2", "volume_title": "Volume 4", "body": "<h1>Chapter 337 : 5th area, Old Blue Zone (2)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 337 : 5th area, Old Blue Zone (2)</p><br/><p>—rummblee— </p><br/><p>‘Not bad.’</p><br/><p>Hansoo mumbled to himself as he looked around the elevator.</p><br/><p>“Raise the walls higher! It’ll be trouble if it collapses!”</p><br/><p>“Strengthen the formations as well! We need to block the Kang-Kion’s attacks!”</p><br/><p>“Keep the boundaries clear between each living area! It becomes difficult to check if they get mixed!”</p><br/><p>Countless adventurers had gathered near the elevator and were re-building the city.</p><br/><p>They raised walls, set up living areas, and treated the wounded.</p><br/><p>Though everybody was moving around non-stop due to the sheer amount of work that had to be done, there was a hint of vigor in each other’s expressions.</p><br/><p>This was because most of these people had been slaving under those twelve people who’d called themselves ‘Gods’.</p><br/><p>But now, that horrible life had ended.</p><br/><p>They had gained their freedom.</p><br/><p>But their joy was tinged with sadness and regret.</p><br/><p>Their present safety only reminded them of their dead comrades and family.</p><br/><p>Ekidu and Karhal both looked somber as they watched these people.</p><br/><p>‘...If we hurried just a bit more, we would’ve been able to save much more.’</p><br/><p>But they soon brushed those thoughts aside.</p><br/><p>It was good that everything had settled down.</p><br/><p>All they needed to do was set up the 4th zone, just like the 1st, 2nd, and 3rd zones below.</p><br/><p>There was still an issue, though.</p><br/><p>“What are you going to do about the transcendents?”</p><br/><p>Karhal asked.</p><br/><p>According to what he knew, the 1st ,2nd, and 3rd zones below were holding back from creating new transcendents.</p><br/><p>It was because the beasts in the lower zones gave a lower amount of crystals, so transcendents would take as many crystals as it would take to send hundreds of thousands of people up.</p><br/><p>Plus, they had no way to control those transcendents as well.</p><br/><p>It was better to keep on sending them up the moment the crystals were acquired.</p><br/><p>But in this zone, the story was a bit different.</p><br/><p>The Green Zone was a good place to create transcendents, plus they knew the higher zones were currently in bad situations.</p><br/><p>‘We’ll need their strength, but… they might all turn into power-hungry maniacs.’</p><br/><p>Karhal frowned after he spoke.</p><br/><p>But Hansoo chuckled.</p><br/><p>“Let’s check out the zone above first. You’ve all seen it already, right?”</p><br/><p>Kiriel, Ekidu, and Karhal nodded.</p><br/><p>Yes, Hansoo had guessed it right.</p><br/><p>‘… But back then, we were forced to go down.’</p><br/><p>Karhal breathed in and out, thinking back to the past when they’d run back down.</p><br/><p>“Let’s go.”</p><br/><p>……………………………………</p><br/><p>—boooom!— </p><br/><p>“Crazy bastards!”</p><br/><p>Kang Han, the man who had been residing on the 3rd floor of the 4th zone, screamed as he blocked the attacks flying at him.</p><br/><p>At first he was full of glee when he had seen the four men and two females who’d come up.</p><br/><p>Since four of them had looked familiar.</p><br/><p>Two were kids who had tried to devour the 2nd floor below, and the other two had been beaten down by him before.</p><br/><p>He remembered the two who he’d beaten.</p><br/><p>Karhal and Ekidu.</p><br/><p>Two people who he’d fought with and had sent back down.</p><br/><p>Though it had been a close victory, he had still won.</p><br/><p>The upper floor had more powerful beasts that gave more crystals, and the efficiency of the nursery was better here.</p><br/><p>The lazy kids of the lower floors were people he should be able to beat with ease.</p><br/><p>Or at least, he thought he would.</p><br/><p>—booom!— </p><br/><p>Kang Han clenched his teeth at the tremendous impact of Karhal’s attack.</p><br/><p>‘What the… this makes no sense! I should be stronger!’</p><br/><p>There were six of them as well, but the other five weren’t even doing anything.</p><br/><p>He’d won against the two back then, but now, even fighting against one was hard.</p><br/><p>‘Damn, I cannot lose!’</p><br/><p>How could he beat six when he couldn’t even beat one?</p><br/><p>But he couldn’t get captured like this.</p><br/><p>He realized it the moment he saw the two people who controlled the 2nd floor, both covered in some red aura.</p><br/><p>That he would become like them the second he was caught.</p><br/><p>And even worse.</p><br/><p>The eyes of the man at the very back.</p><br/><p>The eyes of the man who was surrounded by a strange red energy, and had a hammer in his hand.</p><br/><p>Those eyes that looked down on him.</p><br/><p>Those eyes terrified him.</p><br/><p>He could guess what his life would be like once he was completely under that man’s control.</p><br/><p>But he also realized that the man’s eyes became slightly softer when he looked at Karhal in front of him.</p><br/><p>‘Take him hostage!’</p><br/><p>—boom!— </p><br/><p>Kang Han realized that Karhal was the only hope he had, so he started to frenziedly push Karhal back.</p><br/><p>—crunch!— </p><br/><p>Karhal clenched his teeth when he saw Kang Han giving up his own left arm to strike at his heart.</p><br/><p>And Kiriel shouted towards Karhal from the back.</p><br/><p>“Shall I help?”</p><br/><p>But Karhal smashed Kang Han away as he shouted in reply.</p><br/><p>“Don’t interrupt! I’ll handle it!”</p><br/><p>—booom!— </p><br/><p>‘You bastard, I won’t lose to you a second time!’</p><br/><p>—booom!— </p><br/><p>Karhal thought back to when he’d come up to the 3rd floor in the past.</p><br/><p>Though one couldn’t go to and from between zones.</p><br/><p>If they had enough crystals, they could still move around the floors within the same zone.</p><br/><p>Karhal and Ekidu had come up in the past to search for traces of Hansoo back then.</p><br/><p>But it had been too late.</p><br/><p>While they were searching for Hansoo, the people above had already become transcendents, and were stronger than them.</p><br/><p>Though they were all 1 star transcendents, they had still lost.</p><br/><p>If they hadn’t had any spare crystals back then they might’ve died on the spot.</p><br/><p>‘Bastards!’</p><br/><p>—booom!— </p><br/><p>Kang Han gave up his left arm, while Karhal received the attack with his left shoulder.</p><br/><p>Kiriel frowned at the crazed battle that was occuring.</p><br/><p>They were basically killing themselves.</p><br/><p>If she or Hansoo stepped in, they wouldn’t even need to waste their time like this.</p><br/><p>It would just end in a single strike.</p><br/><p>…tsss…</p><br/><p>‘Thankfully, there’s only that one guy on the 3rd floor.’</p><br/><p>Kiriel looked at the traces around the elevator and then asked Hansoo:</p><br/><p>“Shouldn’t you step in?”</p><br/><p>Hansoo shook his head.</p><br/><p>“Leave him be, this zone needs a King, anyway.”</p><br/><p>—booom!— </p><br/><p>Hansoo silently watched Karhal, who was bleeding all over from his body, but still managed to push back the enemy.</p><br/><p>He knew the decision Karhal had made.</p><br/><p>‘You’ve chosen to remain here.’</p><br/><p>Karhal was now fighting to gain that approval.</p><br/><p>Power that was gained through another’s hand would only become a source of ridicule.</p><br/><p>Only those who fought and won the throne with their own power were fit to be kings.</p><br/><p>So Hansoo didn’t help.</p><br/><p>‘It doesn’t look like he’ll need my help, anyway.’</p><br/><p>He’d been worried at first.</p><br/><p>Worried that he might not be able to accomplish everything he needed to do because he had to help his old comrades.</p><br/><p>So he had reminded himself.</p><br/><p>To not underestimate his comrades.</p><br/><p>“Die, you bastard!”</p><br/><p>—boooom!— </p><br/><p>“Ahhh!”</p><br/><p>‘Good.’</p><br/><p>Hansoo smiled as he watched Karhal smash Kang Han onto the ground, his body still bleeding all over.</p><br/><p>………………………………………..</p><br/><p>—smack! smack!— </p><br/><p>“Bastards! Line up properly!”</p><br/><p>Karhal shouted as he smacked the heads of the guys from the 4th zone, all of whom he’d defeated after going through continued cycles of healing and fighting.</p><br/><p>From the 2nd floor to the 7th.</p><br/><p>There were a total of nine transcendents.</p><br/><p>And Ekidu was a bit shocked at this number.</p><br/><p>“...Much lower than I expected.”</p><br/><p>Even if it was the same 4th zone, everything became more efficient as one went up.</p><br/><p>Whether it was fighting or creating a nursery.</p><br/><p>Since the amount of crystals that came out were different.</p><br/><p>But Hansoo shook his head.</p><br/><p>“That’s because you’d normally want to climb up to the next zone once you become a 2 star.”</p><br/><p>“Hmm? Isn’t it better to remain here?”</p><br/><p>Ekidu asked in shock.</p><br/><p>Wasn’t it better to be a king within the 4th zone, rather than continuing to participate in the bloody massacre in the upper zones?</p><br/><p>It was why some transcendents set up the nursery.</p><br/><p>A safe pick in comparison to risking their lives above.</p><br/><p>It would be more fitting if such guys wanted to remain below.</p><br/><p>But Kiriel realized what Hansoo was saying.</p><br/><p>Since she was at a 2nd star already.</p><br/><p>“Oh…”</p><br/><p>The moment she rose up to the 2nd star, her entire body started to throb and she was filled with anxiety.</p><br/><p>As if her body was telling her that she didn’t belong here.</p><br/><p>It was such an intense feeling that if it weren’t for Hansoo, she would’ve long headed up already.</p><br/><p>It was too uncomfortable to just ignore.</p><br/><p>So much to the point that she felt like she wouldn’t be happy, no matter what happened.</p><br/><p>‘…So it wasn’t just me.’</p><br/><p>Other than Hansoo and the Ark-Roa, the only other 2 star she knew was that man called Kael. And she’d never even talked to him properly, so she’d known nothing about this.</p><br/><p>And Hansoo thought of the fairy as he looked at Kiriel’s expression.</p><br/><p>“It just means we should be where we belong.”</p><br/><p>So he would climb.</p><br/><p>Hansoo spoke to Karhal.</p><br/><p>“You…”</p><br/><p>“I will stay. I’m sick of it. I’m sick of being beaten down over and over again. Somebody has to stay behind, anyway.”</p><br/><p>Ekidu and Hansoo both nodded.</p><br/><p>Someone had to remain in the 4th zone to control those who came up.</p><br/><p>Like how they’d done in the 1st ,2nd, and 3rd zones.</p><br/><p>And Karhal wanted to remain.</p><br/><p>‘...I really wanted to follow you.’</p><br/><p>Karhal mumbled to himself as he looked at Hansoo.</p><br/><p>Why wouldn’t he want to?</p><br/><p>He wanted to become strong.</p><br/><p>He wanted to stand by Hansoo.</p><br/><p>That was why he’d searched for him.</p><br/><p>But during his search for Hansoo, he saw countless other adventurers being tortured by the transcendents.</p><br/><p>And realized.</p><br/><p>That somebody had to take care of them.</p><br/><p>‘This really doesn’t suit me. Damn. Have I hung out with Ekidu for too long?’</p><br/><p>At first, he had decided to remain because Ekidu had asked him for help.</p><br/><p>But now, it was his choice and his choice alone.</p><br/><p>Karhal spoke to Hansoo after finishing his thoughts.</p><br/><p>“Hurry and put it in. I shall be responsible for your power and wreck havoc in this place, hehe. Once you leave, then I’ll be the king of this place.”</p><br/><p>If he borrowed the strength of Hansoo’s soul fragment, then he’d even be able to use the Pandemic Blade to a degree.</p><br/><p>Alongside the control of the other transcendents who were filled to the brim with the Pandemic Blade’s spores.</p><br/><p>‘You are now my slaves, forever.’</p><br/><p>Hansoo smiled with a content expression.</p><br/><p>“Fine. You are now… the king of this world.”</p><br/><p>The king with the right to control every transcendent in the 4th zone.</p><br/><p>—kiiiiing— </p><br/><p>Hansoo pulled out a soul fragment and placed his hand on Karhal’s chest.</p><br/>\n</div>"}