{"title": "Chapter 342 : Refinement (1)", "id": 342, "volume": 4, "url": "http://boxnovel.org/reincarnator-chapter-342-refinement-1", "volume_title": "Volume 4", "body": "<h1>Chapter 342 : Refinement (1)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Reincarnator - Chapter 342 : Refinement (1)</p><br/><p>[Analyzing…complete]</p><br/><p>The research center.</p><br/><p>The giant central intelligence let out a line of words after researching the debris of the robots that had been destroyed by Hansoo’s attacks.</p><br/><p>The intelligence, which had been gently stroking the broken robot parts like a mother would do to a child, started to compile a list of results from the research.</p><br/><p>—kiriririririk— </p><br/><p>The traces of strength left behind on the remains of its creations.</p><br/><p>There was always a unique aura behind every attack.</p><br/><p>And this differed from the user’s strength, traits, and personality.</p><br/><p>If one could find that aura, then it was just a matter of time before they found the owner.</p><br/><p>The central intelligence started to send out commands to every single one of its underlings.</p><br/><p>Then— </p><br/><p>—kiriririk— </p><br/><p>The scanning modules of the robots closest to the intelligence started to change.</p><br/><p>And they were now programmed to search and identify that brand new and alluring aura that had destroyed its comrades.</p><br/><p>…………………………………….</p><br/><p>Samuel smiled as he continued to guide Hansoo and Kiriel.</p><br/><p>“This place we’re living in was also used to research the base as well.”</p><br/><p>The previous inhabitants had all disappeared for some reason.</p><br/><p>The only robots still in operation were those that had been ordered to dig.</p><br/><p>And the people who had run away after Melchizedek’s betrayal had found a ray of hope in this exact location.</p><br/><p>A ray of hope telling them that they might be able to beat those metal cans.</p><br/><p>But the most important thing right now was rescuing the females that had been captured and taken to the research center.</p><br/><p>‘This is turning me insane.’</p><br/><p>Samuel mumbled.</p><br/><p>Believe it or not, the lack of women in this already hell-like place made it even worse.</p><br/><p>He’d been thankful in the past when Melchizedek had ignored them and targeted only the females, but now he deeply regretted not saving those females after spending so many days with just men.</p><br/><p>Gulp.</p><br/><p>Samuel was embarrassed that Kiriel kept smirking at him; he’d been staring at her beauty, which had rarely been seen even in the shelter in the past.</p><br/><p>It had been so long since he had seen a woman, he had subconsciously gulped at the sight of her.</p><br/><p>‘Well… at least they don’t seem like the violent type.’</p><br/><p>Samuel sighed in relief when Kiriel started ignoring him as if she was used to it.</p><br/><p>If these guys were the violent type, then there was a high chance that his head would have flown off already.</p><br/><p>‘Well, if they were like that, then I wouldn’t even have made contact with them in the first place.’</p><br/><p>Jack had a trait that could read a person's emotions and their evil thoughts, and since he’d already checked them out, it was all good.</p><br/><p>It had been a dangerous mission, but he’d succeeded.</p><br/><p>The duo looked quite safe from afar, and he’d felt a sense of urgency.</p><br/><p>With the combination of his good looks and his trait, he had bewitched countless women in the past.</p><br/><p>And after seeing such a beauty, he could barely hold himself in check.</p><br/><p>“So, what’s actually below this place?”</p><br/><p>Kiriel asked curiously, looking back and forth between Jack and Samuel.</p><br/><p>She didn’t care that Samuel had stopped talking to think, but she was still curious.</p><br/><p>And Samuel merely replied with a blank expression.</p><br/><p>“We don’t know, but… it should be amazing.”</p><br/><p>‘...You don’t know?’</p><br/><p>Samuel blushed again as Kiriel’s brows rose up, and he quickly tried to explain. He didn’t want to embarrass himself in front of such a beauty.</p><br/><p>“Of course. Since such an advanced civilization was working this hard to dig it out, shouldn’t it be amazing?”</p><br/><p>He wasn't basing his confidence just on this assumption. </p><br/><p>The original inhabitants of this so-called ‘excavation center’ had actually left behind a record.</p><br/><p>A record stating that if one can excavate the hidden weapon below this base, , then they would have a chance to save their actual planet.</p><br/><p>‘Yeah.’</p><br/><p>Samuel smiled confidently.</p><br/><p>He didn’t know why these two were heading towards the research center, but only an insane maniac would approach that place because it had the tightest defenses of any structure in this entire floor.</p><br/><p>Which meant that they had a specific goal to achieve.</p><br/><p>The other transcendents had acted like that as well.</p><br/><p>Transcendents could not be born without desire.</p><br/><p>Samuel knew that these people would help them out.</p><br/><p>‘You guys need slaves as well, so we will gladly fill that role.’</p><br/><p>He’d never even dreamed of being able to control these two.</p><br/><p>Their levels of strength were dimensions apart.</p><br/><p>He only wished for one thing.</p><br/><p>And that was for these guys to take them in.</p><br/><p>He could guarantee that their group was quite useful.</p><br/><p>Since strength wasn’t the only thing that one needed to survive in this world.</p><br/><p>So he had called out to these two.</p><br/><p>To give them what they’d been searching for and gaining protection in return.</p><br/><p>And these two weren’t dangerous, at least according to Jack, so it was fine for now.</p><br/><p>Escaping this damned shelter was the most important thing.</p><br/><p>The robots were getting closer and closer to finding them, and being stuck in this underground shelter was becoming increasingly unbearable.</p><br/><p>It would be nice to monopolize the unknown weapon hidden below, but Samuel wasn’t confident enough in the weapon for him to go all out against those robots.</p><br/><p>They needed a shield.</p><br/><p>Like the ones they had in the past.</p><br/><p>Before Melchizedek betrayed them.</p><br/><p>‘It was nice when they protected us…’</p><br/><p>As Samuel grit his teeth at the thought of those transcendents who’d left them behind and gone up— </p><br/><p>—Hansoo organized his thoughts and asked a question.</p><br/><p>“Are there perhaps any abyssal beings living in the tunnels?”</p><br/><p>And Samuel smirked inwardly at this question.</p><br/><p>He clearly knew why Hansoo was asking such a question.</p><br/><p>‘Even a powerful person like him is trying to avoid fighting, huh?’</p><br/><p>Well, it would be weird if he was actively looking for a fight.</p><br/><p>Why would they bother fighting if they could actually retrieve that weapon?</p><br/><p>Samuel continued to explain.</p><br/><p>It hurt his pride, but he needed to make themselves look good.</p><br/><p>“Don’t worry. We are doing our best to keep ourselves hidden. Almost two hundred people are sustaining the barrier, and we’re even using artifacts to reinforce it. How could the abyssal beings find us when even Melchizedek cannot?”</p><br/><p>They had always been meticulous about staying hidden in case of the scouting machines.</p><br/><p>All so they could dig out that precious weapon buried below.</p><br/><p>‘And if they can help us… it would be faster.’</p><br/><p>Although they’d been digging at a good pace until now, they had started to encounter the harder, rocky layers, and could only dig out a few dozen meters in a day.</p><br/><p>But if these two could help them out, it would only take an instant to finish.</p><br/><p>Samuel smiled as he thought of the mutual benefits for both parties.</p><br/><p>But Hansoo seemed to have lost interest as he said:</p><br/><p>“We’re leaving.”</p><br/><p>“Yes.”</p><br/><p>“Huh?”</p><br/><p>Kiriel nodded, a bored expression already on her face, and Samuel was left flustered at what had just happened.</p><br/><p>‘Huh?...Why?’</p><br/><p>……………………………………………</p><br/><p>—rummmblee— </p><br/><p>‘Annoying.’</p><br/><p>Kiriel looked at the small group of males following her and Hansoo.</p><br/><p>“Are you coming with us?”</p><br/><p>And Jack, who’d been leading the group next to Kiriel, nodded.</p><br/><p>“Yes, we plan to.”</p><br/><p>“You aren’t expecting us to protect you, right?”</p><br/><p>Jack shook his head.</p><br/><p>“No, no. We’ll manage our own work ourselves. I’m sure we can be of help.”</p><br/><p>Jack looked back at the shelter that he’d once placed so much hope on. It was now far behind them.</p><br/><p>In the past, he had once thought of that shelter as their final ray of hope.</p><br/><p>He knew that as long as they could dig out whatever was below it, they would gain the chance to get back at the metal cans.</p><br/><p>But not anymore.</p><br/><p>‘From their reactions… there’s a chance that the thing hidden below won’t be as amazing as we expected.’</p><br/><p>Jack thought to himself as he looked at the duo.</p><br/><p>Those two people were moving around as if they already knew a lot about this place.</p><br/><p>And he had lost all interest after hearing their words.</p><br/><p>The thing hidden below might be something his group would find amazing.</p><br/><p>But it seemed like it wouldn’t be for these two transcendents.</p><br/><p>Logically speaking, shouldn’t they stick with the stronger side then?</p><br/><p>Samuel couldn't bear to give up the shelter, and so he had stayed behind. But Jack couldn’t let this opportunity go.</p><br/><p>But at least he’d stayed loyal.</p><br/><p>When Jack had been about to leave, Samuel had said:</p><br/><p>If he had voiced out his thoughts on the way out, there would be many more following the two of them.</p><br/><p>At least half of them would.</p><br/><p>Of course, he never planned to say anything, even without Samuel’s plea.</p><br/><p>Since it wouldn’t be good for him either if more competitors came along.</p><br/><p>‘I cannot let this woman go.’</p><br/><p>Jack stared at Kiriel.</p><br/><p>It was a chance of a lifetime.</p><br/><p>Blinding beauty and earth-shaking strength.</p><br/><p>If such a powerful and beautiful woman were to protect him?</p><br/><p>The probability of him surviving in the future would become much higher.</p><br/><p>And it wouldn’t be a bad choice for the woman as well.</p><br/><p>It was a bit too much for him to say with his own mouth, but he was one heck of a hunk.</p><br/><p>He had almost never failed at getting a girl in the past.</p><br/><p>His face was more than enough, but his trait, which allowed him to read a woman’s emotions, was basically made to bewitch women.</p><br/><p>Kiriel shrugged at Jack and looked to Hansoo.</p><br/><p>As if she was asking Hansoo if this was fine.</p><br/><p>Hansoo looked at Jack and said:</p><br/><p>“Go back. It’s not too late.”</p><br/><p>But Jack shook his head.</p><br/><p>He could not let this chance go, and he knew a small fact about the robots.</p><br/><p>“We can protect ourselves. Just leave us behind if we become a nuisance, we aren’t that selfish.”</p><br/><p>He wasn't sticking around for no reason.</p><br/><p>The artificial robots naturally aimed for stronger beings.</p><br/><p>Which meant that this was safer for them.</p><br/><p>While the two of them distracted the robots, their group could just fight the weaker ones or stay hidden.</p><br/><p>He just needed to hold on until he established a good relationship with that woman.</p><br/><p>‘Trust me… I won’t be in any danger.’</p><br/><p>But something came into Jack’s eyes, and he laughed to himself.</p><br/><p>‘...What is that?’</p><br/><p>Jack frowned at Hansoo, who was opening and closing his hands.</p><br/><p>It seemed like Hansoo was measuring something.</p><br/>\n</div>"}