{"title": "Chapter 346 : Inhabitants (1)", "id": 346, "volume": 4, "url": "http://boxnovel.org/reincarnator-chapter-346-inhabitants-1", "volume_title": "Volume 4", "body": "<h1>Chapter 346 : Inhabitants (1)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 346 : Inhabitants (1)</p><br/><p>“Are… are you really Kang Hansoo?”</p><br/><p>Hansoo shrugged his shoulders at the other’s expressions—they were staring at him in disbelief.</p><br/><p>“I told you my name earlier.”</p><br/><p>Jack thought to himself.</p><br/><p>‘...Who would believe that?’</p><br/><p>There were too many people pretending to be Kang Hansoo.</p><br/><p>Especially among those who were a bit stronger.</p><br/><p>And it was easier to treat the people calling themselves Hansoo as fakes when Hansoo had been missing for the past two years.</p><br/><p>But watching this man’s reckless actions, he seemed to be the real deal.</p><br/><p>There were a lot of people pretending to be him, but none like this one.</p><br/><p>Jack continued to mumble, delight filling up his face.</p><br/><p>—chiiiii— </p><br/><p>Kiriel muttered worriedly as she used her Psychometry on the demolished artificial transcendent.</p><br/><p>“It’s not going to be easy.”</p><br/><p>—boom! boom! boom!— </p><br/><p>Countless attacks rained down from the sky…</p><br/><p>Kiriel’s expression turned sour as she saw this scene with her Psychometry.</p><br/><p>‘This isn’t going to be easy at all.’</p><br/><p>She saw it in this thing’s memory.</p><br/><p>The clear recollection of its birthplace, the Main Research Center.</p><br/><p>Thanks to this, she had been able to figure out what guarded the research center.</p><br/><p>‘...At least twenty more like this have been made.’</p><br/><p>At least.</p><br/><p>‘...I knew the 5th zone received more high-quality abyssal crystals than the 4th, but still. I guess finding a 1-Star is quite easy.’</p><br/><p>Only twenty 1-Star transcendents had been found after combing the entire zone below, but here they were found with alarming ease.</p><br/><p>At least twenty in this floor alone…</p><br/><p>Thankfully, every single one of these things were only at the 1-Star level, but it still wasn’t a situation where they could relax.</p><br/><p>Since more of them might be made after this.</p><br/><p>And there was the issue of the environment as well.</p><br/><p>The enemy forces held the absolute advantage in this environment.</p><br/><p>They were all resistant to the flames falling down from the skies.</p><br/><p>She and Hansoo had to dodge those attacks while they fought—it was not a favorable situation at all.</p><br/><p>Normally, she could’ve easily crushed them, but instead she’d almost died in that last battle.</p><br/><p>In addition, their foes had thousands of foot soldiers.</p><br/><p>And despite being foot soldiers, they were also protected by the repulsion coating. This meant that the soldiers could freely attack them from behind while they were focused on fighting the artificial transcendents.</p><br/><p>‘This is suicidal.’</p><br/><p>—rumble— </p><br/><p>Kiriel mumbled as she watched the countless pillars of flames descending all around her.</p><br/><p>After using his trait to read her emotions, Jack asked carefully:</p><br/><p>“Isn’t it better to go up? Do we have to stay and…”</p><br/><p>‘Just die like that?’</p><br/><p>Jack looked towards Hansoo.</p><br/><p>Why would someone charge into the factory where these monstrous robots were being made?</p><br/><p>“Let’s just go up… Wouldn’t the 6th zone be better?”</p><br/><p>Of course, they didn’t know what the 6th zone was like.</p><br/><p>But would it be any worse than this place?</p><br/><p>They could just fill up the runes on the way up.</p><br/><p>‘It’s not like those guys are lacking in crystals anyway.’</p><br/><p>Jack mumbled to himself as he glanced at Kiriel and Hansoo.</p><br/><p>That would be perfect.</p><br/><p>But— </p><br/><p>Hansoo didn’t give Jack the answer he wanted.</p><br/><p>‘Damn it. If he was a girl, I could have charmed him away.’</p><br/><p>He didn’t want to deal with a male, nor did he feel like it would work.</p><br/><p>Jack looked at Hansoo, who seemed to be lost in thought after hearing his words, and continued to speak.</p><br/><p>He wanted to get out of this hell as fast as possible.</p><br/><p>“It’s not like there’s anyone to help you, right? The other transcendents have already gone up… and it’s not like us ordinary people could help out. Are you planning to charge into the research center with just the two of you?”</p><br/><p>But Hansoo smiled at these words.</p><br/><p>“What do you mean? There are people who are willing to help.”</p><br/><p>The expressions on Jack and the others turned grim.</p><br/><p>“…Us? F***.”</p><br/><p>Why were they trying to swing at a dragon’s scales with a butcher knife meant for killing chickens?</p><br/><p>Maybe they might have been able to do something if flames weren’t raining down their heads, but they were barely holding onto their own lives.</p><br/><p>To charge into a whole factory swarming with these things?</p><br/><p>Insane.</p><br/><p>Hansoo chuckled.</p><br/><p>“Don’t worry. I’m not asking you to fight.”</p><br/><p>“Then who?”</p><br/><p>Kiriel asked Hansoo as she was also curious.</p><br/><p>She didn’t know if there was anybody else of use around.</p><br/><p>‘...For real, though. We’re the only two around.’</p><br/><p>Hansoo replied.</p><br/><p>“I know someone that Melchizedek would hate even more than me.”</p><br/><p>And Jack cursed at these words.</p><br/><p>‘F***… Who the hell is this bastard?’</p><br/><p>He knew as well.</p><br/><p>There was a reason why he hadn’t mentioned them.</p><br/><p>This ‘Hansoo’ guy seemed like he’d charge straight into the factory as soon as his chances of winning rose by even a single percent.</p><br/><p>If he really did just come up, then he shouldn’t be able to know, but…</p><br/><p>Jack’s expression turned grim at Hansoo’s next words.</p><br/><p>“Wouldn’t the people protecting Melchizedek’s masters…be quite angry right now?”</p><br/><p>The ones who had brought Melchizedek to Nelkipa, but had lost their power due to Melchizedek’s revolt.</p><br/><p>‘And we have a guide to take us there as well.’</p><br/><p>Hansoo smiled as he looked at Jack, whose expression had darkened at the mention of the inhabitants from .</p><br/><p>…………………………………………</p><br/><p>“Why are you being like this? I swear, I don’t know. I’m serious…!”</p><br/><p>“Kiriel.”</p><br/><p>“Yes.”</p><br/><p>Kiriel started to walk over with a smile.</p><br/><p>“Please! That feels disgusting! Stop!”</p><br/><p>Jack shouted in anger as he backed away.</p><br/><p>He wouldn’t be able to move once she surrounded him with her ability.</p><br/><p>‘Damn… I’m going to die anyway!’</p><br/><p>His opponent was indeed strong, too strong for him to argue against, but he was being backed into a corner.</p><br/><p>If they read his memories and dragged him into being a guide, he would have to crawl into that hellhole.</p><br/><p>‘And… who knows?’</p><br/><p>Jack looked at Kiriel with hope.</p><br/><p>Previously, she’d stopped using her ability when he protested from embarassment.</p><br/><p>Which meant that she wasn’t unreasonable.</p><br/><p>And unlike men, women usually treated him better.</p><br/><p>Kiriel might even stop that crazy Hansoo as well.</p><br/><p>But sadly… </p><br/><p>—smack!— </p><br/><p>Instead of eyes filled with pity, a slap came at him instead.</p><br/><p>“Kuhuk…!”</p><br/><p>“Do you think we’re playing around here?”</p><br/><p>Kiriel eyed him coldly as she gripped his neck.</p><br/><p>Of course, they could just go up if they wanted.</p><br/><p>But then those who would die after they left would number in the tens of millions.</p><br/><p>Whether Melchizedek won.</p><br/><p>Or Clementine won.</p><br/><p>Or even if the inhabitants of Angkara won.</p><br/><p>The only thing waiting for the ones coming up after them was destruction.</p><br/><p>And Hansoo was trying to stop that from happening with his own body.</p><br/><p>‘Do you think just looking a little pretty is everything?’</p><br/><p>She’d been so shocked to see Hansoo’s body melting amidst his battles.</p><br/><p>It meant that this was dangerous, even for Hansoo.</p><br/><p>But he was still willing to go.</p><br/><p>‘Yeah... ‘</p><br/><p>Kiriel blushed as she glanced at Hansoo and then tightened her grip on Jack’s neck.</p><br/><p>“Ughhh…”</p><br/><p>Jack let out a groan of pain as his body rose up into the sky.</p><br/><p>It was a scene that defied gravity, but nobody thought it was weird.</p><br/><p>Since they realized something they’d forgotten about until now.</p><br/><p>This beautiful girl in front of them.</p><br/><p>And the difference in strength between them.</p><br/><p>—kiiiririring— </p><br/><p>Kiriel started to read the memories within Jack’s body.</p><br/><p>And Kiriel scoffed at these scenes.</p><br/><p>‘He lives up to his face, alright.’</p><br/><p>Girl after girl.</p><br/><p>There was not a single moment where he wasn’t with a girl.</p><br/><p>A different one in the morning, in the afternoon, and at night.</p><br/><p>Sometimes even two.</p><br/><p>Sometimes even more.</p><br/><p>If this guy had spent those times fighting and hunting, he would’ve long become a transcendent.</p><br/><p>‘Both this guy… and those girls.’</p><br/><p>Kiriel decided to leave his personal life alone and began to rewind through them at a faster speed.</p><br/><p>Then— </p><br/><p>—poof— </p><br/><p>“Ha…haaa.”</p><br/><p>Kiriel released Jack, who gasped for breath, and turned around.</p><br/><p>“Found it.”</p><br/><p>Kiriel smiled at Hansoo.</p><br/><p>……………………………………………….</p><br/><p>—rumble— </p><br/><p>The spikes rising up from Nelkipa’s body reached high into the sky.</p><br/><p>Below the giant Nelkipa’s structure that the inhabitants of Angkara had named the — </p><br/><p>—some sort of translucent object was squirming around.</p><br/><p>Then— </p><br/><p>—booom!— </p><br/><p>An attack from Angkara smashed into the space right above the squirming object.</p><br/><p>—chiizzt— </p><br/><p>The squirming object disappeared with a small sound, and something appeared below it.</p><br/><p>A giant armored vehicle that was at least 200 meters large.</p><br/><p>And from inside the strange-looking vehicle— </p><br/><p>—the voices from hundreds of people could heard.</p><br/><p>“Phew… If it weren’t for the repulsion coating, that photon strike would’ve turned us into powder.”</p><br/><p>“Is the shield working well?”</p><br/><p>From those words— </p><br/><p>—chijiiiiiik— </p><br/><p>—one of them nodded as they pointed towards the squirming translucent barrier.</p><br/><p>“There’s no issues! It should… be able to hold.”</p><br/><p>“Hahaha! We’re alive!”</p><br/><p>“That bastard Melchizedek! He thinks he can fight us?”</p><br/><p>The hundreds of people inside the armored vehicle shouted out in glee.</p><br/><p>These photon strikes may seem like a rain of fire to others, but in the eyes of these people, those very attacks were like fireworks celebrating their return.</p><br/><p>How long had they been on the run after Melchizedek had taken away their control?</p><br/><p>But it was different now.</p><br/><p>They would finally be able to return home.</p><br/><p>Their proud nation, the , would not let this rogue A.I be.</p><br/><p>But a few of them spoke with dark expressions.</p><br/><p>Especially the N-levels who had the most important jobs.</p><br/><p>One of them, , muttered as she looked at Nelkipa that had now turned bright.</p><br/><p>“...We will win, right?”</p><br/><p>“...”</p><br/><p>The five other N-levels stayed silent.</p><br/><p>They didn’t know as well.</p><br/><p>These shouts should only come out when their nation, the , actually won the war.</p><br/><p>They didn’t know anything about this giant creature as well.</p><br/><p>Despite all their research.</p><br/><p>At that moment— </p><br/><p>—beep! beep!— </p><br/><p>The sounds of an alarm were ringing out throughout the entire armored vehicle.</p><br/><p>“Huh? I can detect some strange energy outside!”</p><br/><p>“What the hell… How can lightning shoot up from the ground!”</p><br/><p>A magical sight.</p><br/><p>And at that moment— </p><br/><p>‘...Could it be those monkeys?’</p><br/><p>That extremely violent and empty-headed race.</p><br/><p>“That bastard!... Prepare to counter!”</p><br/><p>N-Maria clenched her teeth as she thought of those apes that called themselves ‘transcendents’.</p><br/>\n</div>"}