{"title": "Chapter 341 : Main Research Center (3)", "id": 341, "volume": 4, "url": "http://boxnovel.org/reincarnator-chapter-341-main-research-center-3", "volume_title": "Volume 4", "body": "<h1>Chapter 341 : Main Research Center (3)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 341 : Main Research Center (3)</p><br/><p>—rumble— </p><br/><p>“You live hidden down there?”</p><br/><p>Jack nodded at Kiriel who had been pointing towards the ruins in the distance.</p><br/><p>“We have about two hundred people managing the barrier to keep us hidden. It doesn’t look like those robots know how to use skills proficiently yet.”</p><br/><p>Well, they were borrowing the powers of the strange artifacts they had dug up from this place because their own skills weren’t enough.</p><br/><p>Like the personal equipment that had helped him find these two just now.</p><br/><p>‘This is already good enough.’</p><br/><p>Jack looked at the two people in front of him.</p><br/><p>If they could borrow their strength, who were both definitely transcendents, their situation would become much better.</p><br/><p>‘She doesn’t really leave his side though.’</p><br/><p>Jack made a dissatisfied expression as he looked at Kiriel.</p><br/><p>He hadn’t seen a woman in so long.</p><br/><p>Plus she was such a beauty, but she was always on her guard against him.</p><br/><p>‘What’s the point of being handsome anymore…’</p><br/><p>He knew he was good-looking, and he had lived a decent life up to this point.</p><br/><p>Until he reached the Blue Zone.</p><br/><p>Until Melchizedek betrayed them.</p><br/><p>It was mostly useless now.</p><br/><p>Since he couldn’t attract any males with his looks.[a][b]</p><br/><p>Kiriel threw a question at Jack, who’d been looking her up and down.</p><br/><p>“What happened? What about the alliance?”</p><br/><p>With a sad expression, Jack shrugged his shoulders and said:</p><br/><p>“This is what happens when you don’t have the strength. I’ll continue after we arrive. We’re almost there.”</p><br/><p>Jack then started to speed up.</p><br/><p>And Kiriel’s curiosity only increased.</p><br/><p>She was actually the type that could not hold back her curiosity very well.</p><br/><p>The reason why she had searched around for information on Hansoo was because of her curiosity as well.</p><br/><p>‘Whatever, I can just figure it out on my own.’</p><br/><p>But as Kiriel lifted her hands up to use her Psychometry.</p><br/><p>Jack raised both his hands and spoke out.</p><br/><p>“Woah, woah. Please don’t do that thing you did before. It feels a bit icky, so… We’re almost here anyway.”</p><br/><p>‘Oops.’</p><br/><p>Kiriel made an embarrassed expression.</p><br/><p>Jack then jumped towards a specific location within the ruins.</p><br/><p>Then— </p><br/><p>Several machines that were hidden within the ruins activated, and a blue light scanned all three of their bodies.</p><br/><p>—didididik!— </p><br/><p>But the moment the blue light scanned through Hansoo and Kiriel, it turned red and made warning noises. Something vibrated beneath them.</p><br/><p>‘The hell is this?’</p><br/><p>Kiriel frowned and looked at Hansoo to see what they should do.</p><br/><p>“Ah, these things are sensitive. Please relax.”</p><br/><p>Jack lifted his palms again to calm them down, and then put in a few commands which caused the red light to turn back to blue.</p><br/><p>Soon— </p><br/><p>—rumble— </p><br/><p>—a ten-meter-tall mechanical spider rose up from the ruins.</p><br/><p>[MR-4112]</p><br/><p>‘Ah, this is what vibrated under us just now, huh?’</p><br/><p>—chiiiiik— </p><br/><p>Kiriel mumbled as she looked at the giant machine spider, and as soon as it finished rising it then opened up its stomach for them to enter.</p><br/><p>There seemed to be weapons in the machine’s eight legs, and it was clear what this thing would’ve done if the light had remained red.</p><br/><p>“It’s a very rare thing you see. We were barely able to hack it so you guys won’t be able to break this. Come on, let’s get on.”</p><br/><p>—rummblee— </p><br/><p>The spider, after taking in the three of them, started to dig through the metal debris and into the ground.</p><br/><p>It soon disappeared without a trace as it headed deeper and deeper underground.</p><br/><p>…………………………………………….</p><br/><p>—rummble— </p><br/><p>The spider shot beams from its legs to melt down the path, and it only stopped after it melted down a thirteen-meter-tall metal wall to make an entrance.</p><br/><p>—rummblee— </p><br/><p>The stomach of the mechanical spider opened up, and light entered the space the trio were in.</p><br/><p>And Kiriel was shocked at the scene that unfolded before her eyes.</p><br/><p>‘It’s quite well-decorated.’</p><br/><p>The giant shelter clearly showed traces of humans having lived here.</p><br/><p>The giant shelter, which was the size of a few sports fields combined, had countless tunnels for things to enter and leave through.</p><br/><p>Some strange machines were digging out materials as they entered and left through these passages as well.</p><br/><p>‘...What is that? Dirt? Ore?’</p><br/><p>Kiriel grew curious as she looked at the construction machines moving in strange materials from the tunnels.</p><br/><p>Of course, it wouldn’t be weird if they were ore or dirt.</p><br/><p>Since this place wasn’t really a satellite, but rather a structure built on top of a moon from what she could see.</p><br/><p>But the important thing was why they were digging holes at a time like this.</p><br/><p>‘What the hell are they doing?’</p><br/><p>But as Kiriel was lost in confusion— </p><br/><p>—a small group of people quickly walked towards Hansoo and Kiriel.</p><br/><p>Twenty or so people who were also clad in strange artifacts like Jack.</p><br/><p>Once the group arrived in front of them, a large, blonde man standing in the front extended his hand and greeted them.</p><br/><p>“Greetings. I am called Samuel.”</p><br/><p>‘He seems to be the leader of their group.’</p><br/><p>Kiriel mumbled to herself.</p><br/><p>He hadn’t really said he was the leader, but it was clear after looking at the surrounding people.</p><br/><p>That he was the leader of this place.</p><br/><p>‘Well, he might not be as well.’</p><br/><p>Samuel continued to speak to Kiriel and Hansoo.</p><br/><p>“Thank you for accepting our invitation.”</p><br/><p>Samuel’s attitude was full of caution.</p><br/><p>He had to be, since he was dealing with transcendents.</p><br/><p>Monsters who had broken past the limits of humankind.</p><br/><p>‘If they could just help us out a bit…’</p><br/><p>It was too late to say these words.</p><br/><p>Hansoo spoke coldly to Samuel who had been looking at him with a perplexed gaze.</p><br/><p>“Let’s get to the main point—it doesn’t look like we have a lot of time.”</p><br/><p>Samuel nodded.</p><br/><p>“I’ve asked you guys to come here to make an alliance. You won’t lose out, I promise.”</p><br/><p>Hansoo continued to speak.</p><br/><p>“First, tell me your objective.”</p><br/><p>Kiriel nodded.</p><br/><p>She and Hansoo had come here because of their curiosity, but these people’s stories were different.</p><br/><p>For them to suggest an alliance like this, despite knowing how strong she and Hansoo were?</p><br/><p>What if they were insane like Zeus, and were thinking about turning all these people into slaves? Would they have dared to invite them here?</p><br/><p>Samuel smiled.</p><br/><p>“Is your goal the research center?”</p><br/><p>“…”</p><br/><p>Hansoo replied with silence.</p><br/><p>‘It seems they’ve been watching us longer than we expected.’</p><br/><p>Even transcendents couldn’t watch over someone from dozens of kilometers away.</p><br/><p>Which meant that they deduced that his goal was the research center from the direction he had taken.</p><br/><p>Samuel checked that his thoughts were correct from Hansoo’s expression, and then confidently continued.</p><br/><p>“And you guys should have come down from above, since that’s the only way for you guys to know the location.”</p><br/><p>“Eh…”</p><br/><p>‘Not really.’</p><br/><p>Kiriel made a strange expression.</p><br/><p>This Samuel guy was acting as if he knew everything, but it didn’t seem like that was the case.</p><br/><p>‘Well, with a strange trait like that… it’s easy to misunderstand.’</p><br/><p>Kiriel mumbled as she thought of Hansoo’s trait.</p><br/><p>They’d been running towards their objective without a break.</p><br/><p>A very important-sounding location.</p><br/><p>Nobody would suspect that they’d come from below like this.</p><br/><p>Since it was impossible for someone to go straight towards their objective if they didn’t even know where they were heading to.</p><br/><p>‘So the place we were heading to is called the research center, huh?’</p><br/><p>She hadn’t actually known the location since she was just following Hansoo’s trait.</p><br/><p>Kiriel pondered for a moment and decided just to stay quiet.</p><br/><p>A misunderstanding had its uses.</p><br/><p>But unlike Kiriel’s thoughts, Hansoo just replied bluntly:</p><br/><p>“You’re wrong. We came from below.”</p><br/><p>“…What? Aren’t you here to reclaim the research center after failing to do it last time?’</p><br/><p>But as Hansoo shook his head, Samuel’s expression turned into one of confusion.</p><br/><p>‘No way. How did they know how to get to the research center after coming from below…’</p><br/><p>The Main Research Center was continuously in motion.</p><br/><p>If one didn’t know its path, then it would be impossible to find it.</p><br/><p>Even if they were to pick up hints left behind another, it wouldn’t be possible to do such a thing.</p><br/><p>As Samuel was lost in confusion, Hansoo continued to speak.</p><br/><p>“But you’re half correct.”</p><br/><p>“Huh?”</p><br/><p>“I’ve never failed in reclaiming the research center, but I have indeed come for it this time.”</p><br/><p>“Uhh…”</p><br/><p>Samuel’s confusion grew.</p><br/><p>To come up from below to attack the research center?</p><br/><p>How did he know about this?</p><br/><p>It was too unbelievable to be a lie.</p><br/><p>‘What’s his objective…?’</p><br/><p>For them to have come from below.</p><br/><p>Then the story had changed a little.</p><br/><p>But Hansoo chuckled at Samuel’s perplexed expression.</p><br/><p>“We don’t really care much anyway. We can just leave if we want to. So show us what you’re hiding, because I don’t believe this is all you have to ask for an alliance.”</p><br/><p>Hansoo looked around.</p><br/><p>About a thousand people were scattered around this place.</p><br/><p>Though it was a large force, it was nowhere near enough people to attack the research center.</p><br/><p>But they hadn’t pleaded for help, but had asked for an alliance instead.</p><br/><p>Which meant that had something to back themselves up.</p><br/><p>‘If they don’t have anything that is worth our time, then… there’s no need to form an alliance.’</p><br/><p>Their objective also seemed to be the research center.</p><br/><p>He didn’t know why they wanted to take over that place, but if they had no cards to deal with, it was better for him to move as a duo with Kiriel for efficiency’s sake.</p><br/><p>After a short pause, Samuel nodded.</p><br/><p>‘Yeah, our objectives are the same…’</p><br/><p>Letting the two of them in without a detailed investigation had been a mistake.</p><br/><p>But this could also give them a chance.</p><br/><p>“This way. Jack, lead them well.”</p><br/><p>Samuel then walked away towards a tunnel. Hansoo and Kiriel shrugged at each other and followed suit.</p><br/><p>………………………………..</p><br/><p>—rumble— </p><br/><p>‘Are there no females here?’</p><br/><p>Everyone they had seen on the way were men.</p><br/><p>[Sec-141]</p><br/><p>As Kiriel was walking through the tunnels where the construction robots were digging things up, Samuel spoke up from the front. It was as if he was trying to make some small talk to get rid of the silence.</p><br/><p>“Do you know what this facility was made for?”</p><br/><p>“This shelter, you mean?”</p><br/><p>Samuel shook his head.</p><br/><p>“This giant base in general. The 5th zone, the Blue zone of the past. This entire moon is the 5th zone.”</p><br/><p>‘It was a moon base, huh?’</p><br/><p>But of course, she couldn’t figure out why this base had been made.</p><br/><p>Samuel smiled, then continued to speak.</p><br/><p>“This giant moon base was said to have been built in order to research sleeping beneath this place. It was all for that purpose.”</p><br/><p>Samuel mumbled as he thought of the giant base of the moon .</p><br/><p>*In Korean, the term 위성, (Pronounced Wee-Sung) can both mean a satellite and a moon (Or anything that really floats around a planet). The author seems to use them interchangeably, so I had to infer from the surrounding context.</p><br/><p>It seems to me that this giant body of mass in space is not a moon, but some form of asteroid. But since the author described it as the size of a moon (I assume it is the earth’s moon), I’ll just translate it as the moon.</p><br/><p>P.S. information may get changed with future context.</p><br/><p>[a]Or can he? ;)</p><br/><p>[b]hey. dont raise my hopes.</p><br/>\n</div>"}