{"title": "Chapter 359: Breeding City (2)", "id": 359, "volume": 4, "url": "http://boxnovel.org/reincarnator-chapter-359-breeding-city-2", "volume_title": "Volume 4", "body": "<h1>Chapter 359: Breeding City (2)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 359: Breeding City (2)</p><br/><p>“Hmm…mmm…”</p><br/><p>As they made their way to the third floor, Kiriel made a strange expression as she touched various parts of her armor.</p><br/><p>Noticing this, Hansoo asked:</p><br/><p>“Is there an issue?”</p><br/><p>“No… it’s just…”</p><br/><p>Kiriel smiled awkwardly at Hansoo.</p><br/><p>Dragon God Armor.</p><br/><p>A revolutionary gear that allowed a normal person to fight on the same level as a transcendent.</p><br/><p>She’d expected to become at least twice as strong once she equipped it.</p><br/><p>No, even stronger than that.</p><br/><p>Since she’d be able to use both her strength as well as the Dragon God Armor’s powers.</p><br/><p>But the result was a bit different.</p><br/><p>As a piece of armor, it was amazing.</p><br/><p>The material, its efficiency, as well as the special options inside.</p><br/><p>But the core thing was missing.</p><br/><p>The energy that controlled the Dragon God Armor.</p><br/><p>The ‘battery’ that powered the armor to the point that it could fight evenly against her—it wasn’t included inside.</p><br/><p>And it wasn’t like R-Korun Nell had a tremendous amount of energy hidden inside his body like herself—that’s what confused her.</p><br/><p>‘Well...I could just use my own energy to power it.’</p><br/><p>—ssssk— </p><br/><p>Kiriel stared at the armor that had started to glow as she poured energy into it.</p><br/><p>Hansoo shrugged his shoulders.</p><br/><p>“An internal battery is dangerous in such a dangerous weapon.”</p><br/><p>Dragon God Armor.</p><br/><p>A weapon that could turn the tide of a large-scale battle in an instant.</p><br/><p>The Dragon God Armor received its energy through a transmission.</p><br/><p>From the within Angkara.</p><br/><p>Then— </p><br/><p>—rumble— </p><br/><p>The elevator stopped moving.</p><br/><p>—boom!— </p><br/><p>And the sound of something exploding resonated from outside the still-closed elevator doors.</p><br/><p>Hansoo spoke to Kiriel:</p><br/><p>“Let’s go out.”</p><br/><p>‘Hold on for just a bit longer, Enbi Arin.’</p><br/><p>Hansoo thought as he glanced at Enbi Arin who was on Kiriel’s back.</p><br/><p>……………………………………………………</p><br/><p>—rumble— </p><br/><p>“Woah…”</p><br/><p>Kiriel whistled at the scene as the doors of the Elevator opened.</p><br/><p>She thought back to when the Fusion Reactor had gone through the Quantum Transmission.</p><br/><p>‘If that explosion… if it occurred before my eyes, then this would’ve been the result, huh?’</p><br/><p>Back then, she could only see a tiny, flashing star.</p><br/><p>But seeing it happen right before her eyes, it was like an apocalypse.</p><br/><p>—rumble— </p><br/><p>The machines that were apparently prepared to ambush them had all melted down from the Fusion Core explosion.</p><br/><p>Kiriel heard Hansoo’s voice as she stared at the sea of flames.</p><br/><p>“I’ll leave it to you.”</p><br/><p>“Yes.”</p><br/><p>Kiriel nodded.</p><br/><p>It didn’t seem like they’d bought enough time.</p><br/><p>Since she could already see the lights approaching from the distance.</p><br/><p>‘There’s no need to get mixed up in something like that.’</p><br/><p>The reason why they had blown up the Fusion Core was to buy this small bit of time anyway.</p><br/><p>And as Kiriel activated her skill— </p><br/><p>—kiiiiing— </p><br/><p>—the Dragon God Armor on Kiriel’s body activated with her skill, creating a transparent barrier around her and Hansoo.</p><br/><p>The stealth barrier had been useful in the lower floors but was even stronger now, and it quickly hid their presences.</p><br/><p>‘Nice. This is quite useful.’</p><br/><p>—kiiiiiing— </p><br/><p>Her spinal area released a strange current of energy that enhanced her skill.</p><br/><p>Kiriel smiled at this.</p><br/><p>It was like acquiring a very versatile supporter.</p><br/><p>Although she had to supply the energy herself, the result wasn’t half bad.</p><br/><p>—whooosh!— </p><br/><p>The second the barrier surrounded them, Kiriel and Hansoo dashed off the ground and headed towards the metal city in the distance.</p><br/><p>—swoosh!— </p><br/><p>Every step was hundreds of meters long, but Kiriel could only make an expression of discomfort.</p><br/><p>‘...What is that?’</p><br/><p>A strange fog surrounded the giant city.</p><br/><p>Kiriel looked at the scene in front of her with disgust.</p><br/><p>It didn’t look natural at all.</p><br/><p>The fog remained undisturbed from the wind created as they ran; there was no way it was natural.</p><br/><p>At that moment— </p><br/><p>—kiiiiing!— </p><br/><p>“...Huh?”</p><br/><p>—they felt a strange energy in the distance, above the fog.</p><br/><p>Kiriel quickly raised her head and saw the objects floating outside the atmosphere.</p><br/><p>‘…So that’s the fleet of flames. They’ve already arrived.’</p><br/><p>She hadn’t noticed them because it was so far away, plus the giant city in front of her had taken up her full attention.</p><br/><p>“Shouldn’t we dodge?”</p><br/><p>The concentration of energy from above was not something they could ignore.</p><br/><p>The direction of its attack was headed right for their location.</p><br/><p>Well, it was aiming for the city, but the strength of such sheer firepower could easily sweep them away too.</p><br/><p>Hansoo shook his head.</p><br/><p>“If it could get easily swept away from that, it would have long fallen by now.”</p><br/><p>Hansoo said leisurely, glancing between Aokan and the fleet above.</p><br/><p>……………………………………….</p><br/><p>In the distance.</p><br/><p>A massive amount of energy gathered in front of the flagship of the Kalkuroun Fleet.</p><br/><p>Then— </p><br/><p>&lt; - - - - &gt;</p><br/><p>—a laser beam cut across space and slammed down onto the planet below.</p><br/><p>Although it didn’t release a sound, its speed and aura allowed one to estimate the power behind the attack.</p><br/><p>The meteor-like strike of that beam was slower than the Photon Strike, but there was a vicious technology implemented onto this attack.</p><br/><p>R-Particle Reactive Artillery.</p><br/><p>A weapon filled with the R-Particle that reacted with all surrounding matter to quickly fold space.</p><br/><p>A tactical weapon used to blow apart giant fortresses or the cores of small moons.</p><br/><p>This weapon, which basically created a miniature black hole, turned everything within a 10 km radius into a singularity the moment it exploded.</p><br/><p>But the moment the artillery shell entered the white fog surrounding Aokan, something strange happened.</p><br/><p>…chiiiii…</p><br/><p>The artillery shell quickly lost its momentum.</p><br/><p>The attack, which should’ve turned everything within 10 km of the city into a tiny dot the moment it blew up, quickly fell to the ground.</p><br/><p>R-Koronaita Nell mumbled as he looked at the artillery shell, which had cost as much as the yearly income of a large city, turned into a piece of metal.</p><br/><p>“...It’s well-built. Whoever built it, they did a very good job.”</p><br/><p>The ultimate weapon of electronics—it reacted to anything electronics-related and controlled it.</p><br/><p>Neropa Union’s creation, .</p><br/><p>Resembling a white fog, it covered a range of several dozen kilometers around Aokan and was made up entirely of nanomachines.</p><br/><p>Unauthorized artificial weapons or systems would quickly lose their power and ability to function when they entered the fog.</p><br/><p>‘...It really prepared well. Damned brat. What’s really hidden underneath?’</p><br/><p>R-Koronaita Nell gritted his teeth as he looked at the giant city, now completely obscured as the fog thickened.</p><br/><p>…………………………………….</p><br/><p>“...”</p><br/><p>Kiriel frowned as she noticed that the giant fleet was unable to do anything.</p><br/><p>It felt good to thwart the ones above, but she realized that the city before their eyes was not a simple one at all.</p><br/><p>Kiriel asked Hansoo:</p><br/><p>“Are we going to charge straight in?”</p><br/><p>The giant metal walls of the city made it resemble a massive Pandora’s box.</p><br/><p>A box that hid countless sorrows, but still attracted many with hope.</p><br/><p>To gather crystals, they needed to deal with the Abyssal race inside the walls.</p><br/><p>As well as Melchizedek’s forces.</p><br/><p>Melchizedek knew their strengths.</p><br/><p>And it would have definitely prepared for their arrival.</p><br/><p>Hansoo nodded.</p><br/><p>“Let’s go.”</p><br/><p>“...”</p><br/><p>Kiriel nodded at Hansoo’s words.</p><br/><p>In order to attain the power to fight on the upper floors, they needed to raise their level in this place anyway.</p><br/><p>If they could survive this, both she and Hansoo would at least become a step stronger.</p><br/><p>‘Enbi Arin… If she could survive, then it would be a huge help.’</p><br/><p>Kiriel clenched her teeth as she felt her mind calming down at the thought of saving a life.</p><br/><p>She realized what she was truly feeling.</p><br/><p>‘...It’s hard.’</p><br/><p>There was no one who could help them.</p><br/><p>The world was large, and there were so many enemies.</p><br/><p>And there were only two of them.</p><br/><p>She’d never truly experienced hardship throughout the 1st, 2nd, and 3rd zones.</p><br/><p>Her abilities were quite good, and the rulers of each of those zones were human.</p><br/><p>The 4th zone was alright as well.</p><br/><p>Although there were many others stronger than herself, she had used her abilities to quickly rise up into a transcendent.</p><br/><p>She had no long-term enemies as well.</p><br/><p>But the moment she met Hansoo, everything changed.</p><br/><p>Of course, she had enemies.</p><br/><p>Except her enemies were spread around, preparing to flip the world upside down.</p><br/><p>She just didn’t know who they were.</p><br/><p>Hansoo and his comrades had been fighting them since a long time ago.</p><br/><p>And they probably still were.</p><br/><p>Melchizedek.</p><br/><p>Clementine.</p><br/><p>Beings that had the thoughts and the abilities to flip the world many times over.</p><br/><p>And as she thought up to this point, Kiriel unconsciously blurted something out.</p><br/><p>“If we keep fighting like this, will there ever come a day when we can smile with true happiness?”</p><br/><p>It sounded like a complaint, but she felt like she needed to hear how Hansoo would answer.</p><br/><p>If there was no light at the end of this tunnel filled with battles.</p><br/><p>This whole fight might lose all meaning.</p><br/><p>‘No… Does the tunnel even end?’</p><br/><p>Enemies after enemies after enemies.</p><br/><p>Go up, enemies.</p><br/><p>Look around, enemies.</p><br/><p>At this rate, she felt like her mind would end up exhausted even before her physical body could.</p><br/><p>Hansoo smiled at Kiriel and asked:</p><br/><p>“How were the lower floors?”</p><br/><p>Kiriel replied instantly:</p><br/><p>“Of course, they were much bett…”</p><br/><p>At that moment— </p><br/><p>—Kiriel came to a realization, and Hansoo continued:</p><br/><p>“If we win, this place will become like that. I hope you liked how they were.”</p><br/><p>And as she heard this— </p><br/><p>—Kiriel felt a spring of emotions burst out from inside her chest.</p><br/><p>‘...So that’s what they meant. When they told us that it was like hell.’</p><br/><p>She’d deluded herself.</p><br/><p>Things hadn’t gotten hard just because she went up.</p><br/><p>The 1st, 2nd, 3rd, and 4th zones were originally all like this.</p><br/><p>It was only that Hansoo and his old comrades had changed it.</p><br/><p>Hansoo chuckled at Kiriel, mumbling as he thought of his old comrades who’d had to shoulder these kinds of jobs because of him.</p><br/><p>“If you make bad friends, you will suffer. It’s not too late. There’s nothing really good… about having a friend like me, you see.”</p><br/><p>Hansoo looked at Enbi Arin with a bitter expression and then gazed upwards.</p><br/><p>‘I wonder… What are you guys doing now? Just wait a bit longer. There are a few things I need to smash apart before I get there.’</p><br/><p>Hansoo’s bitter expression soon turned ice-cold as he stared at Melchizedek’s metal box.</p><br/>\n</div>"}