{"title": "Chapter 363: Bomb (3)", "id": 363, "volume": 4, "url": "http://boxnovel.org/reincarnator-chapter-363-bomb-3", "volume_title": "Volume 4", "body": "<h1>Chapter 363: Bomb (3)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 363: Bomb (3)</p><br/><p>‘Dammit… Where is it heading to now?’</p><br/><p>R-Zairon Nell checked the coordinates of the Quantum Transmission and made a dumbfounded expression.</p><br/><p>382 places.</p><br/><p>382 coordinates, all located on Angkara.</p><br/><p>The metropolis.</p><br/><p>Large areas of inhabitants.</p><br/><p>Research cities.</p><br/><p>Military bases.</p><br/><p>Every single one of the densely-populated and important locations.</p><br/><p>Not caring whether it was from the Neropa Union or Pompeion.</p><br/><p>R-Zairon Nell freaked out as he looked at the fragments of bugs in front of his eyes.</p><br/><p>‘These… these things are going to fall on our planet?’</p><br/><p>Kyaaaaak!</p><br/><p>“These damned bastards! Why are their shells so hard?!”</p><br/><p>“Hey! If you’ve got time to speak, then kill more of them!”</p><br/><p>—booom!— </p><br/><p>He could hear the voices of his teammates fighting the half-insect, half-human creatures.</p><br/><p>They’d wasted their artillery before because they didn’t want to approach them, and it had worked back then.</p><br/><p>But they didn’t have the leisure to anymore.</p><br/><p>The artillery wasn’t effective anymore, and there was no energy to spare.</p><br/><p>—crunch!— </p><br/><p>—boom!— </p><br/><p>His subordinates were now ignoring the green liquid that they’d hated so much and were crazily swinging the plasma blades equipped on their Dragon God Armor.</p><br/><p>‘These things are going to fall…’</p><br/><p>Zairon continued to repeat this phrase over and over again.</p><br/><p>They’d managed to slice them apart because they were Dragon God Soldiers, but only just barely.</p><br/><p>But with a normal weapon or a normal soldier?</p><br/><p>They wouldn’t be able to leave a single scratch.</p><br/><p>These things that only Dragon God Soldiers could handle were going to land on their planet.</p><br/><p>Things that could multiply at this rate and become this powerful with just meat.</p><br/><p>If these things fell onto a city occupied by millions of people and used them all as food?</p><br/><p>And used that food to multiply?</p><br/><p>Zairon felt a chill run down his entire body as he thought of this point.</p><br/><p>‘No… It’ll be an apocalypse.’</p><br/><p>With their fleet of flames and the power of their ‘Flame’, they wouldn’t lose.</p><br/><p>But what should they do?</p><br/><p>Would they need to burn down entire cities and kill all the innocent people there?</p><br/><p>Combining the population of the people in those coordinates, it was a bit over four billion.</p><br/><p>“Melchizedek… YOU DAMNED TIN CAN!”</p><br/><p>—booom!— </p><br/><p>R-Zairon Nell roared in rage as he destroyed the bugs around him.</p><br/><p>—chiiiiik!— </p><br/><p>Something crawled out from beneath him, making mechanical sounds.</p><br/><p>‘...What is this?’</p><br/><p>A metal pillar with thin screens around it.</p><br/><p>It wasn’t that weird since this entire city was like a large machine.</p><br/><p>But the important thing was who had sent it to him, in this insect-filled city.</p><br/><p>As R-Zairon Nell made a confused expression— </p><br/><p>—chiijijik!— </p><br/><p>—the panels made a noise as words appeared on them.</p><br/><p>…………………………………</p><br/><p>—rumble!— </p><br/><p>‘...They’re getting stronger and stronger.’</p><br/><p>—crunch!— </p><br/><p>Kiriel groaned inwardly as she fought.</p><br/><p>Their strength kept increasing.</p><br/><p>This was the third type of monster.</p><br/><p>She’d initially fought on the outskirts of the city, but she soon realized that the quality of the monsters in the deeper parts was better and had gone there instead.</p><br/><p>But the ones deeper in were really powerful.</p><br/><p>‘These aren’t things I can deal with on a whim.’</p><br/><p>—crunch!— </p><br/><p>“Phew…”</p><br/><p>Kiriel frowned after barely managing to defeat one monster.</p><br/><p>The first type was an insect.</p><br/><p>The second type was half-insect and half-human.</p><br/><p>The third type wore armor, and they weren’t at all easy to defeat.</p><br/><p>Which meant that if she proceeded deeper, it would lessen her efficiency in gaining crystals.</p><br/><p>It was better if she stayed around the shelters with 2nd and 3rd-type monsters.</p><br/><p>‘I don’t know what to do.’</p><br/><p>A familiar wave radiated out from the center of the city.</p><br/><p>‘Melchizedek, that crazy bastard. Planning to send away the whole city…’</p><br/><p>If she wanted to help, then she needed to head towards Hansoo’s location right this instant.</p><br/><p>If she was going to continue growing, she needed to focus on hunting on the outskirts of the city.</p><br/><p>Looking at it from the long term, the second choice was a much better option.</p><br/><p>Since becoming a 3-Star Transcendent and then proceeding to help him was much better than going over right now.</p><br/><p>Kiriel made some calculations and then came to a decision.</p><br/><p>‘...No. I’ll have to go and help.’</p><br/><p>No matter how she thought about it, there was not enough time to rise to a 3-Star Transcendent within the allotted period.</p><br/><p>It was a good thing to have monsters swarm together like this.</p><br/><p>Since it would be hard to find monsters packed this densely.</p><br/><p>To find these many monsters, they’d need to comb through the wild for months.</p><br/><p>But the issue was, the numbers were too dense.</p><br/><p>It wasn’t as if they could kill off the enemy with a simple sweep of a broom.</p><br/><p>There was a limit to how much she could fight on her own.</p><br/><p>‘I need at least twice my current strength.’</p><br/><p>If she couldn’t rise to a 3-Star in time anyway, it was better to go help Hansoo to stop the transmission and then fight in leisure.</p><br/><p>—crack!— </p><br/><p>Kiriel finished off the monsters jumping at her and started to head towards the familiar aura.</p><br/><p>At that moment— </p><br/><p>—boooom!— </p><br/><p>—boom!— </p><br/><p>—from the location opposite to Kiriel’s destination, a large explosion had occurred at a wall.</p><br/><p>‘What the hell.’</p><br/><p>Kiriel frowned as she saw who was coming out from the newly-created hole.</p><br/><p>Nine Dragon God Soldiers.</p><br/><p>Rough breaths.</p><br/><p>Red eyes.</p><br/><p>Body postures that were ready to pounce on something at any moment.</p><br/><p>Being covered from head to toe in a green liquid, they still seemed enraged from their previous battle.</p><br/><p>‘...Ugh, this might get ugly. I don’t have time for this.’</p><br/><p>One soldier, she could deal with.</p><br/><p>No, since she’d gained the Dragon God Armor, it would be quite easy to handle one soldier.</p><br/><p>But nine?</p><br/><p>And if she had someone to protect behind her back?</p><br/><p>That was a different story.</p><br/><p>Especially since their individual abilities seemed to be higher than that R-Korun Nell that she’d previously dealt with.</p><br/><p>‘But… if I have to fight, then I will.’</p><br/><p>Kiriel tightly grasped the fang in her hand as her Dragon God Armor released a white steam.</p><br/><p>But then— </p><br/><p>“No! Please! We aren’t here to fight! Calm down!”</p><br/><p>“...?”</p><br/><p>—one man jumped out from behind the Dragon God Soldiers and shouted.</p><br/><p>‘...Who the hell is that?’</p><br/><p>Unlike the fully-armored nine, the man looked like he didn’t have any battle prowess whatsoever.</p><br/><p>Kiriel made a confused expression.</p><br/><p>………………………………</p><br/><p>“So… you want to make an alliance? Temporarily?”</p><br/><p>R-Zairon Nell barely managed to reply to Kiriel’s confused questioning.</p><br/><p>“Yes, According to him, we seem to have the same goals. We can work together until then.”</p><br/><p>After saying the words that hurt his pride, R-Zairon Nell looked at the researcher-like man standing next to him.</p><br/><p>No, he was an actual scientist of the Technorat branch.</p><br/><p>‘N-Aroel.’</p><br/><p>He’d heard of him before.</p><br/><p>The man with the same level of ability as N-Akuon, the leader of the Technorats.</p><br/><p>Being the leader of all technical-related things on the Kalkuroun fleet was an immensely high position.</p><br/><p>If he didn’t have that ability, then he would’ve long lost his life from the rage of a Nell family member.</p><br/><p>And being on the same level as that N-Akuon, that was not something so simple.</p><br/><p>‘I heard they sent him away due to some past incidents… It seems they sent him to be the leader of the Aokan.’</p><br/><p>Then it made sense.</p><br/><p>As to how he’d survived without any battle prowess while at Aokan, which had become as close as possible to a living hell.</p><br/><p>For the leader of all technology in Aokan, he would know all its mechanisms and structures.</p><br/><p>‘Well, it doesn’t seem as simple as that.’</p><br/><p>R-Zairon Nell was at a loss as he looked at N-Aroel, who looked like he’d crawled out of a sewer.</p><br/><p>Dirty, tattered robes and an overgrown beard.</p><br/><p>Strange-colored skin as well as various machines attached to his back.</p><br/><p>In comparison to N-Akuon, who was living an almost germophobic life on the Kalkuroun fleet, he looked well-prepared.</p><br/><p>N-Aroel looked embarrassed at R-Zairon Nell’s stare but soon focused on the task at hand.</p><br/><p>“It seems you also have a job to fulfill, right?”</p><br/><p>“...?”</p><br/><p>“You have come for the crystals, correct?”</p><br/><p>Kiriel frowned at this.</p><br/><p>‘Was he spying on me?’</p><br/><p>But she hadn’t felt anyone watching her.</p><br/><p>N-Aroel seemed to have read Kiriel’s thoughts and quickly shook his head.</p><br/><p>“No, I didn’t spy on you or anything. We’ve just studied you over a long period of time, so we kind of realized a few action patterns. All the strong members of your kind seem to be looking for crystals. And there’s no other reason for you to enter this dangerous city.”</p><br/><p>“Hmm.”</p><br/><p>Correct to a degree.</p><br/><p>N-Aroel continued to speak as he watched Kiriel.</p><br/><p>“The Quantum Transmission has been activated. And… I believe there will be many more things we can do if we form an alliance. And it wouldn’t be a waste of time, either. These crystals are important to you, correct? We have no use for them whatsoever.”</p><br/><p>N-Aroel looked at Kiriel and said:</p><br/><p>“You can take the crystals and help us stop the transmission. It’s not bad, right?”</p><br/><p>“Not bad, you guys really are trying hard.”</p><br/><p>N-Aroel made a bitter expression at Kiriel’s words.</p><br/><p>“It has been a very long time since I’ve been trapped in this place, living like a rat. I have… seen a lot of things. As to what kind of beings these things are.”</p><br/><p>Kiriel and all the Dragon God Soldiers all made similar expressions of understanding.</p><br/><p>It was only for a short while, but that was more than enough time to know what kind of creatures those things were.</p><br/><p>N-Aroel continued to speak with a heavy expression.</p><br/><p>“Look, imagine these things falling down onto a whole planet. To our planet. How could we not try hard?”</p><br/><p>R-Zairon Nell looked at N-Aroel with a respectful gaze.</p><br/><p>‘I must remember this kid.’</p><br/><p>N-Aroel glanced around and then continued to speak.</p><br/><p>“There… is a secret tunnel here. Of course, there’ll be a lot of Quirae along the way, but… We’ll be able to get to the center much faster. I will lead you there, and you may take all the crystals you find along the way…”</p><br/><p>“If you’re heading to the center, I didn’t come here alone, you see.”</p><br/><p>N-Aroel shook his head when he heard Kiriel speak about joining up with Hansoo.</p><br/><p>“No, we won’t go that way. We’ll go a different way.”</p><br/><p>“Huh? Why?”</p><br/><p>Instead of Kiriel, R-Zairon Nell was the one who asked.</p><br/><p>Logically, it was better to group up with the other man and head into the depths.</p><br/><p>N-Aroel screamed.</p><br/><p>“Dammit…! We cannot go there! No matter what!”</p><br/><p>“...”</p><br/><p>Everyone looked questioningly at N-Aroel’s reaction.</p><br/><p>………………………………………</p><br/><p>—boooom!— </p><br/><p>‘It’s really not easy.’</p><br/><p>Hansoo thought to himself.</p><br/><p>He thought it’d be easy to breach the center while wearing the blue armor, but it seems like he’d overestimated himself.</p><br/><p>‘4th-level. Hmm.’</p><br/><p>“Haha… kekeke.”</p><br/><p>Hansoo frowned as he looked at the 4th-level evolution of the Quirae before his eyes.</p><br/><p>Being a 4th-level wasn’t an issue.</p><br/><p>He’d thought the Quirae only devoured humans.</p><br/><p>Then there wouldn’t be much of an issue.</p><br/><p>Since their strength relied on what they ate.</p><br/><p>But the one that appeared before his eyes had definitely eaten something that wasn’t human.</p><br/><p>The spikes protruding out from the muscles on various parts of its body.</p><br/><p>It was not a trait of the Quirae nor that of a human.</p><br/><p>Nor was it a trait of the natives of Angkara.</p><br/><p>‘It… ate the original owners of the blue armor, huh? They were in there, I see.’</p><br/><p>“Keke…kehehehe…”</p><br/><p>The 4th-level Quirae screamed at Hansoo as they crawled out from a part of the city that was glowing brightly.</p><br/>\n</div>"}