{"title": "Chapter 360: Breeding City (3)", "id": 360, "volume": 4, "url": "http://boxnovel.org/reincarnator-chapter-360-breeding-city-3", "volume_title": "Volume 4", "body": "<h1>Chapter 360: Breeding City (3)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 360: Breeding City (3)</p><br/><p>“Are you really going to go in with me?”</p><br/><p>Kiriel chuckled at Hansoo’s question.</p><br/><p>“I want to leave my name in the history books as well. Are you trying to take all the glory?”</p><br/><p>Hansoo scoffed at Kiriel and then nodded.</p><br/><p>“Fine. We’ll tell them to write it all in detail.”</p><br/><p>Kiriel fastened Enbi Arin on her back even tighter after receiving Hansoo’s permission.</p><br/><p>—chaaarrrrk— </p><br/><p>Various skills from Kiriel’s body protected Enbi Arin and kept her in place.</p><br/><p>She’d even thought of hiding her somewhere, but leaving her behind in some random place in the middle of a battlefield wouldn’t be the best plan.</p><br/><p>Especially since a random patrol robot could destroy Enbi Arin with her current status.</p><br/><p>‘I’ll protect her for now.’</p><br/><p>Hansoo was stronger than her, but Hansoo was someone who fought in the frontlines like a madman. It didn’t suit him to take care of a patient.</p><br/><p>She, a support-type fighter who fought from the backlines, was a much better choice to carry Enbi Arin around.</p><br/><p>Kiriel asked Hansoo:</p><br/><p>“...Are we charging straight through the doors?”</p><br/><p>Kiriel glanced at the city surrounded by the white fog.</p><br/><p>Suppressing her fear.</p><br/><p>Hansoo nodded.</p><br/><p>“Yes. Don’t worry so much. We’re not the only ones going in.”</p><br/><p>“...Are there other allies?”</p><br/><p>Hansoo pointed towards the sky and said:</p><br/><p>“Well, they aren’t exactly allies.”</p><br/><p>The fleet of flames was within sight high above the sky.</p><br/><p>………………………………………..</p><br/><p>R-Koronaita Nell.</p><br/><p>A man whose abilities were acknowledged at the age of 8, thus gaining the right to control the Flame.</p><br/><p>He had earned military merits in the battle against Pompeion at the age of 20 and then became a Dragon God Soldier.</p><br/><p>He had risen to become the owner of a fleet at the age of 34, a powerful and high-ranked position even within the Neropa Union.</p><br/><p>It was an unbelievable rate of promotion, a rare sight even within the history books of Angkara’s long chronology.</p><br/><p>Although there were a few rivals during his younger days, there were no more rivals when he turned 52, his current age.</p><br/><p>Most had either died, come under his command, or replaced.</p><br/><p>R-Koronaita Nell looked down at Aokan with cold eyes.</p><br/><p>‘I have to win.’</p><br/><p>He could not lose.</p><br/><p>Although he had lost small battles in the past, he had won every single one of the more important ones.</p><br/><p>This was why he’d been able to rise to the position of the youngest fleet master as well as gain the rights to lead this giant fleet of flames.</p><br/><p>And this battle was definitely not a small one.</p><br/><p>“Melchizedek, you annoying metal brat.”</p><br/><p>R-Koronaita Nell mumbled.</p><br/><p>There was no more time to waste.</p><br/><p>At this rate, he didn’t know what that kid Melchizedek would do since it was already slowly devouring the Nelkipa.</p><br/><p>Although it was a brat, it wasn’t stupid.</p><br/><p>For some reason, it had brought the fight to their home planet.</p><br/><p>For that thing, who knew the power of Angkara more than anyone, to bring the fight to their home ground, it meant that something was backing it up and giving it the confidence to do so.</p><br/><p>‘And… that something is probably this.’</p><br/><p>R-Koronaita Nell frowned at the giant ray flying towards their home planet even while under attack from artillery fire.</p><br/><p>They could not land.</p><br/><p>Since even their ships would lose their abilities once they got within Mimir’s range.</p><br/><p>Although they wouldn’t completely stop due to their AI defensive systems, it would leave them in a weakened state.</p><br/><p>‘And if he attacked during that time, it would only make matters gruesome.’</p><br/><p>But they couldn’t watch forever.</p><br/><p>R-Koronaita Nell ordered N-Akuon below him.</p><br/><p>“Send out all the Dragon God Soldiers.”</p><br/><p>“All nine?”</p><br/><p>Nine was a huge amount, even within the Nell family.</p><br/><p>Looking annoyed at the shock in N-Akuon’s voice, R-Koronaita Nell replied:</p><br/><p>“Yes. All nine. We brought them with us in case of a situation like this. It’s time to use them.”</p><br/><p>‘Such a slow kid.’</p><br/><p>Although it was mechanical armor, half of it was biological anyway.</p><br/><p>Plus the Dragon God Armor could work inside the Mimir as long as it was under the control of the Dragon God Armor.</p><br/><p>The Dragon God Armor was actually the force they would’ve used in case the Aokan ever formed a rebellion.</p><br/><p>‘Although I didn’t expect to find things like that roaming around.’</p><br/><p>—kyaaaak!— </p><br/><p>R-Koronaita Nell frowned at seeing strange monsters shoving something inside the human’s stomachs and then shouted:</p><br/><p>“Descend! Find out what it’s hiding inside and stop the Mimir! That’s the only way the fleet can approach!”</p><br/><p>One of the Dragon God Soldiers, who was preparing to go down, asked:</p><br/><p>R-Koronaita Nell didn’t even flinch as he said:</p><br/><p>“Think of them as wild animals. You are now going through a jungle. Although there’s no need to kill them… there’s no point in overlooking the things that annoy us.”</p><br/><p>The Dragon God Soldier smiled as if he’d expected R-Koronaita Nell’s answer.</p><br/><p>Soon— </p><br/><p>—swooosh!— </p><br/><p>—nine beams of light descended downwards.</p><br/><p>And R-Koronaita Nell smiled as he looked at the nine descending meteors.</p><br/><p>‘Melchizedek, I wonder what your expression will look like when your head gets taken apart piece-by-piece?’</p><br/><p>Would it make a similar expression as the countless rivals that had lost to him?</p><br/><p>Or would it make an expression like those whose heads he’d taken off?</p><br/><p>Because of his status as a fleet master, he’d hidden this secret, but it was one of his greatest hobbies.</p><br/><p>R-Koronaita Nell looked forward to that moment and looked down at Aokan beneath him.</p><br/><p>…………………………………………………………..</p><br/><p>“Nine are coming down.”</p><br/><p>—kiririririk— </p><br/><p>Kiriel could see nine meteors with her enhanced vision.</p><br/><p>And her already skill-enhanced vision was further enhanced through the lens on the visor.</p><br/><p>‘They’re all strong.’</p><br/><p>At Kiriel’s level, observing their simple movements was enough to show their strength.</p><br/><p>Even while falling from the sky, they looked laid-back but were still very much on their guard.</p><br/><p>‘They don’t look simple.’</p><br/><p>And at that moment— </p><br/><p>—kiiiiiing!— </p><br/><p>—something started to shoot out from their bodies.</p><br/><p>And as the biomechanical grenades landed— </p><br/><p>—boomboooboomboooom!— </p><br/><p>—giant explosions occurred as they swept past their landing position.</p><br/><p>Looking at the scene, Hansoo said:</p><br/><p>“Let’s go in now.”</p><br/><p>“Yes.”</p><br/><p>With that much chaos, all attention would focus on them.</p><br/><p>And Hansoo reminded Kiriel before heading off:</p><br/><p>“You remember, right? We’ll separate once we go in.”</p><br/><p>Kiriel gulped at those words but nodded as she replied:</p><br/><p>“I know.”</p><br/><p>There were two types of enemies they had to fight inside.</p><br/><p>Melchizedek’s forces and the Abyssal beings.</p><br/><p>The best scenario would be to just kill the Abyssal beasts, gain crystals, raise herself and Enbi Arin to a 3-Star and then go up.</p><br/><p>Of course, Melchizedek wouldn’t just sit by and watch.</p><br/><p>But if they only focused on Melchizedek’s forces, Enbi Arin might die, or they might get swept away by something else.</p><br/><p>So they had chosen this:</p><br/><p>Hansoo would attract Melchizedek's attention, and while he dealt with its forces, Kiriel would roam the city and hunt the Abyssal beings.</p><br/><p>If they could end it fast and quickly get up to 3-Star, then that would be the best outcome.</p><br/><p>Of course in this life, not everything goes according to one’s wishes.</p><br/><p>‘Haa…’</p><br/><p>As Kiriel gulped, Hansoo started to cover himself in skills.</p><br/><p>In order to charge in first.</p><br/><p>‘Kiriel, I believe in you.’</p><br/><p>She would do well.</p><br/><p>She was a smart girl.</p><br/><p>He just needed to do one thing.</p><br/><p>Let Kiriel move freely.</p><br/><p>Then— </p><br/><p>—kiriririk!— </p><br/><p>—blue particles started to seep out from underneath Hansoo’s skin.</p><br/><p>The crystalline particles hidden between his bones, his veins, and his muscles, seeped out and covered his skin.</p><br/><p>And the Ark Roa’s crystal filled in the space between the pieces of armor.</p><br/><p>A blue armor quickly covered Hansoo’s body.</p><br/><p>And as the blue armor compressed aHansoo’s body, it made a gleeful sound by creating friction with the armor pieces.</p><br/><p>Then— </p><br/><p>—pushuk!— </p><br/><p>—shukshuk!— </p><br/><p>Hundreds of tiny spines shot out from various parts of its body and embedded themselves into Hansoo’s body.</p><br/><p>As if the Ark-Roa’s energy wasn’t enough, the blue armor started frenziedly sucking Hansoo’s energy out through the spines attached to his body.</p><br/><p>And as the extra energy around various parts of Hansoo’s body got sucked into the armor— </p><br/><p>—kiiiiing!— </p><br/><p>—the mana jade resting inside him acted up as it started to pour out mana.</p><br/><p>Activating the Immortal Soul, which started regenerating the sucked-out life force.</p><br/><p>Hansoo smiled as he felt what was currently happening inside his body.</p><br/><p>‘Good, very good.’</p><br/><p>A normal human being would probably die once their life force ran out but it was a nice stimulus for him.</p><br/><p>It tensed up his entire body and accelerated his movements.</p><br/><p>And as if his brain’s sleeping defense mechanisms had determined that the blue armor’s actions were life-threatening, it started hastily secreting adrenaline throughout his body.</p><br/><p>Hansoo’s body soon transformed into something that was ideal for smashing things apart.</p><br/><p>As if the armor was trying to prove that it wasn’t a thief, it started emitting a bright light as it sucked in Hansoo’s energy.</p><br/><p>—kiiiiing!— </p><br/><p>Explosive strength squirmed around his body.</p><br/><p>And his senses were elevated to the point where he couldn’t bear to stand still anymore.</p><br/><p>Hansoo spoke to Kiriel:</p><br/><p>“I’m… going ahead.”</p><br/><p>Then— </p><br/><p>—booooom!— </p><br/><p>—Hansoo’s bright body flew off into the fog like a meteor.</p><br/><p>And soon— </p><br/><p>—booooooom!— </p><br/><p>—a huge sound reverberated as a massive earthquake, much larger than the one from the previous explosions, shook the entire city.</p><br/><p>……………………………………………….</p><br/><p>—rumble!— </p><br/><p>A few females woke up from the tremendous earthquake.</p><br/><p>And this included Ariel, whose mouth had been defiled by that insectoid monster.</p><br/><p>‘Ugh…’</p><br/><p>Ariel woke up with a much thinner face than before, and she looked to where the vibration had originated from, but then soon let her head droop.</p><br/><p>‘I’m going to sleep. I just want to sleep.’</p><br/><p>She didn’t want to think.</p><br/><p>She didn’t want to do anything.</p><br/><p>Ariel lay back down with a soulless expression and started to sleep again.</p><br/><p>At that moment— </p><br/><p>—kirrrk— </p><br/><p>A strange noise resounded from inside Ariel’s stomach.</p><br/><p>No, from inside the hundreds of females lying near Ariel.</p><br/><p>‘You should sleep, too.’</p><br/><p>Ariel caressed the thing making the strange noise inside her stomach and then fell asleep again.</p><br/>\n</div>"}