{"title": "Chapter 366: The buried natives (3)", "id": 366, "volume": 4, "url": "http://boxnovel.org/reincarnator-chapter-366-the-buried-natives-3", "volume_title": "Volume 4", "body": "<h1>Chapter 366: The buried natives (3)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 366: The buried natives (3)</p><br/><p>—rumble— </p><br/><p>From within the swarm of Quirae.</p><br/><p>A small group was struggling.</p><br/><p>“Dammit… Even if we want to back out, we might not be able to survive!”</p><br/><p>“Shut up and maintain your position! Don’t move until N-Aroel finishes activating it!”</p><br/><p>—ssssk!— </p><br/><p>R-Zairon Nell shouted at his comrades and then sliced apart a Quirae with his nanoblade.</p><br/><p>“Haa…haa…”</p><br/><p>—tiktik— </p><br/><p>—titititik— </p><br/><p>One man ignored the countless Quirae jumping towards him and was pressing various buttons that were appearing in the air.</p><br/><p>R-Zairon Nell watched N-Aroel, who was deeply focused on the panel in front of him as if he couldn’t hear the loud noises around them. And he thought to himself:</p><br/><p>‘Hmm, I guess he does his job well. Anyway, for such a chance like this to appear within my life…’</p><br/><p>Although it was a life-threatening danger, it was also a tremendous opportunity.</p><br/><p>Pompeion was pushing their forces back.</p><br/><p>If he could smash all these things into Pompeion’s territory?</p><br/><p>If he unleashed these things on the countless cities unprepared for something like this?</p><br/><p>He didn’t even need to think about what would happen.</p><br/><p>‘Chaos.’</p><br/><p>If everything went according to his plan, they could easily push back the enemy’s forces.</p><br/><p>And he would gain the merits for this and increase his presence within his clan.</p><br/><p>—boom!— </p><br/><p>“Hahahaha!”</p><br/><p>R-Zairon Nell started to laugh as he smashed away another Quirae.</p><br/><p>He felt his mind brighten at the thought of his promising future.</p><br/><p>But he quickly regained his senses at the looks of the other Dragon God Soldiers.</p><br/><p>‘Right. It’s not the time to laugh right now.’</p><br/><p>He hadn’t succeeded in his plan yet.</p><br/><p>Even if he did succeed, it would be an issue.</p><br/><p>The biggest variable was themselves.</p><br/><p>And the aliens.</p><br/><p>It was pointless to use force to deal with them.</p><br/><p>They had clearly seen their prowess.</p><br/><p>—boom!— </p><br/><p>‘Yeah. Too strong.’</p><br/><p>R-Zairon Nell thought to himself as he watched Kiriel in the distance. Even as she massacred the Quirae, that girl managed to keep her guard up.</p><br/><p>Even if he could succeed in ambushing her from the back, a single mistake could kill off at least half of the nine.</p><br/><p>She may look tired, but so were they.</p><br/><p>But he had a hidden card up his sleeves.</p><br/><p>‘The Quantum Transmission. How can I use it in the most efficient manner?’</p><br/><p>R-Zairon Nell continued to think as he looked at Kiriel, who was slashing her dagger from side to side.</p><br/><p>……………………………………………………..</p><br/><p>—boom!— </p><br/><p>The Mjolnir smashed the 5th-level Quirae’s body.</p><br/><p>A loud sound occurred as cracks appeared on its crystalline exoskeleton.</p><br/><p>But they only existed for a moment.</p><br/><p>—ududuck!— </p><br/><p>The crystalline structure continuously changed and rebuilt itself as it absorbed and dispersed the force.</p><br/><p>It deflected away parts of Mjolnir’s lightning while absorbing other parts to strengthen its exoskeleton further.</p><br/><p>Of course, it couldn’t fully negate the shock.</p><br/><p>—crack!— </p><br/><p>—crackack!— </p><br/><p>Although the exoskeleton dispersed the majority of impact, the strike from the combination of five dragons smashed onto the Quirae’s body and pushed it back.</p><br/><p>And the sounds of something breaking rang out from beneath the armor.</p><br/><p>But it was only pushed back for a bit.</p><br/><p>—pushuk!— </p><br/><p>It smashed its feet into the ground and received the full shock with its body.</p><br/><p>It then made a fist.</p><br/><p>—booooom!— </p><br/><p>The right fist of the Quirae flew and struck at Hansoo’s blue armor.</p><br/><p>—crunch!— </p><br/><p>A strange sound occurred beneath the blue armor, a sound similar to what he’d heard when he attacked the Quirae.</p><br/><p>His bones broke, and his muscles exploded.</p><br/><p>The blue armor also turned crystalline and absorbed most of the impact, but the residual force still drove deep into his body.</p><br/><p>Of course, he didn’t get pushed back or anything.</p><br/><p>His response was quite similar to that of the Quirae’s.</p><br/><p>He raised his Demonic Dragon Reinforcement to the limits and protected his important intestines and muscles.</p><br/><p>His Immortal Soul connected his broken bones and healed his flesh.</p><br/><p>And after gathering all the strength in his body— </p><br/><p>—booooooom!— </p><br/><p>—he swung the hammer in his hand.</p><br/><p>Just like how the Quirae had done.</p><br/><p>Their actions were similar, and so was their strength.</p><br/><p>Withstanding attacks with their body and then counterattack.</p><br/><p>The battle between Hansoo and the evolved Quirae was a dogfight, nothing more.</p><br/><p>—boooom!— </p><br/><p>—boom!— </p><br/><p>Dozens of attacks were carried out with every second.</p><br/><p>Armors broke, and the flesh beneath crushed.</p><br/><p>And countless 4th-level Quirae continued to charge towards them.</p><br/><p>—crunch!— </p><br/><p>Even as he fought the blue creature in front of him, he didn’t forget to kill the others as well.</p><br/><p>Hansoo clenched his fist at the tremendous change taking place in the fragment inside his body.</p><br/><p>Changes were occurring at a rapid pace.</p><br/><p>At least until the moment he died, the damage he was receiving was causing his body to change at a crazy rate.</p><br/><p>The Immortal Soul frenziedly fixed and grew in order to keep him alive.</p><br/><p>‘Just a bit… just a bit more!’</p><br/><p>Hansoo’s insides continued to compress and explode as he glared at his opponent in front of him.</p><br/><p>His stamina continued to drain, and his body had turned into a mess.</p><br/><p>Although the Immortal Soul was working as hard as it could, his current opponent and the swarm of others around him continued to flood towards him.</p><br/><p>But thanks to this, his fragments had reached the very limits of their growth.</p><br/><p>The Quirae realized this instinctively and attacked him with even more fervor.</p><br/><p>To stop him and smash him apart before that change occurred.</p><br/><p>The actions of the 5th-level Quirae as it rushed forward, heedless of how much Hansoo smashed its whole body, proved it all.</p><br/><p>But Hansoo smiled as he continued to attack it.</p><br/><p>—booom!— </p><br/><p>The Immortal Soul had grown a lot.</p><br/><p>Its current level could no longer compare to its form of just a few moments ago.</p><br/><p>And thanks to this, his overall strength had risen.</p><br/><p>Even when the Quirae had smashed his body apart, and his bones were creaking, the increased strength of his skills proved it.</p><br/><p>“Kuhuk… Ahhh!”</p><br/><p>Hansoo, who’d endured its attacks until now with the blue armor, could no longer hold back the pain as he screamed and got pushed back.</p><br/><p>The expression of the 5th-level Quirae turned ugly.</p><br/><p>It realized instinctively— </p><br/><p>—that at this rate, the change would fully occur before the opponent tired out.</p><br/><p>—boom!— </p><br/><p>“Kaaaa!”</p><br/><p>But only the 5th-level Quirae, which had been able to stay sane, could detect this.</p><br/><p>As the other Quirae pounced at him with even more fervor— </p><br/><p>—kiiiiing!— </p><br/><p>—changes occurred among the surrounding Quirae.</p><br/><p>No, not on the bodies of the Quirae, but rather in the air surrounding them.</p><br/><p>Blue particles appeared around the Quirae’s bodies.</p><br/><p>A familiar aura.</p><br/><p>‘Quantum Transmission!!!’</p><br/><p>Hansoo realized what the people who’d gone to control the Quantum Transmission had chosen.</p><br/><p>They had decided to throw the Quirae onto the planet, Angkara.</p><br/><p>‘This isn’t good.’</p><br/><p>—booom!— </p><br/><p>Hansoo smashed away a few 4th-level Quirae, frowning as he looked at the smiling face of the 5th-level Quirae.</p><br/><p>This was not good at all.</p><br/><p>If he’d fought just a bit more, he would be able to move forward.</p><br/><p>And only with that strength would he be able to grasp Clementine’s underlings, as well as Melchizedek, and smash them all into the ground.</p><br/><p>Neither tactics nor technology mattered in the face of absolute strength.</p><br/><p>He needed to get to the level of a 3rd-Star to at least handle them.</p><br/><p>But if the transmission succeeded now and the ones in front of his eyes disappeared, things would take much, much longer.</p><br/><p>It would be hard to find a new hammer to temper him as efficiently as these creatures before him.</p><br/><p>But soon— </p><br/><p>—he realized that the transmission wasn’t only sending the Quirae away.</p><br/><p>—kiiiiing!— </p><br/><p>Blue particles started to appear around his body as well.</p><br/><p>………………………….</p><br/><p>—boooom!— </p><br/><p>“Just hold on a bit more.”</p><br/><p>“Ahhh! This beast!</p><br/><p>The Dragon God Soldiers screamed as they fought.</p><br/><p>Not the Quirae, but another being.</p><br/><p>“These kids… you dare trick me?”</p><br/><p>—crack!— </p><br/><p>As Kiriel swung her fang, cracks appeared in the air.</p><br/><p>The single line that she’d drawn flew forward towards the Dragon God Soldiers, threatening to slice them apart.</p><br/><p>‘Ahhhh!’</p><br/><p>One of the Dragon God Soldiers freaked out and tried to back away.</p><br/><p>Of course.</p><br/><p>He witnessed her slice one of his comrades down the center of his body.</p><br/><p>Even with the Dragon God Armor, that attack would kill him instantly.</p><br/><p>But Kiriel continued slashing with her dagger while receiving attacks from all around.</p><br/><p>‘Damn… it!’</p><br/><p>But as the Dragon God Soldier was about to scream out loud at the approaching dagger—</p><br/><p>“Dumbass.”</p><br/><p>—boom!— </p><br/><p>—R-Zairon Nell charged in from the distance and attacked her from behind.</p><br/><p>And Kiriel quickly backed off at seeing him, her teeth clenched with frustration.</p><br/><p>She could heal if she got hit, but Enbi Arin could not.</p><br/><p>‘You evil bastard.’</p><br/><p>—whoosh!— </p><br/><p>Kiriel couldn’t finish her goal, so she quickly jumped into the air.</p><br/><p>And as she landed, countless particles lingered around her body.</p><br/><p>R-Zairon Nell laughed at this scene.</p><br/><p>“Hahahaha! Think of it as an honor! You’ll be able to face the right before your eyes!”</p><br/><p>The location that the two—no, three, including the one on her back—aliens would be going to was the planet Angkara.</p><br/><p>To the center of the deep within the planet.</p><br/><p>Even they wouldn’t be able to survive if such a force were to sweep through them.</p><br/><p>No matter how strong they were.</p><br/><p>The insectoids would go to Pompeion.</p><br/><p>The aliens to the heart of the .</p><br/><p>And they, the Dragon God Soldiers, back to their headquarters.</p><br/><p>The Quantum Transmission continued running.</p><br/><p>Kiriel frowned at this.</p><br/><p>‘...Not good.’</p><br/><p>There were seven left.</p><br/><p>But it would be impossible for her to get through them in a short time while also protecting Enbi from harm.</p><br/><p>The Quantum Transmission was continuously analyzing her atoms in order to send her away.</p><br/><p>It was taking a long time simply because there were too many entities, but sooner or later it would send her off.</p><br/><p>Kiriel breathed in and said:</p><br/><p>“...You bastard. Just wait.”</p><br/><p>“Hahaha! Are you going to survive from the Flame? How delusional!”</p><br/><p>R-Zairon Nell laughed at her.</p><br/><p>It was only called a Flame in name, but in truth, it was like a small sun.</p><br/><p>The internal sun that provided a tremendous amount of energy and strength to the creatures of Angkara.</p><br/><p>There were no other plot twists.</p><br/><p>They would die, and he would become a hero.</p><br/><p>As R-Zairon Nell laughed— </p><br/><p>—whoooosh!— </p><br/><p>—something was flying towards them at a rapid pace.</p><br/><p>Tiny, but extremely fast.</p><br/><p>“...Huh?”</p><br/><p>‘Is that dangerous?’</p><br/><p>It was moving way too fast to figure out its identity.</p><br/><p>A mysterious object that was cutting through the air like a meteor.</p><br/><p>But even before they could fully react— </p><br/><p>—Kiriel jumped into the air and caught the object that almost flew past her.</p><br/><p>“...Huh?”</p><br/><p>As the Dragon God Soldiers looked at her in confusion— </p><br/><p>‘Hansoo…’</p><br/><p>—a smile soon replaced the gloomy expression on her face.</p><br/><p>“Never mind. Let’s not wait—I’ll deal with you now.”</p><br/><p>Kiriel smiled as she looked at the violet crystal in her hand— she could feel a condensed energy that was countless times denser than the ones she’d acquired.</p><br/>\n</div>"}