{"title": "Chapter 379: Nerpa (2)", "id": 379, "volume": 4, "url": "http://boxnovel.org/reincarnator-chapter-379-nerpa-2", "volume_title": "Volume 4", "body": "<h1>Chapter 379: Nerpa (2)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 379: Nerpa (2)</p><br/><p>—rumble— </p><br/><p>Elis Valentine clenched her teeth as she felt the aura that had exploded out from the distance.</p><br/><p>‘Damn… I fooled around a bit too long.’</p><br/><p>She was supposed to quickly deal with the girl in front of her and self-destruct the crystal, but she’d been too immersed in the battle—it had been a long time since she’d tasted something this exciting.</p><br/><p>Of course, the result wasn’t bad.</p><br/><p>The girl called Kiriel was gasping for breath and could barely stand on her feet.</p><br/><p>She had been too drunk from the pleasure she felt as she watched the blood-covered girl.</p><br/><p>Elis realized she had made a mistake.</p><br/><p>This powerful aura that she could feel from this far away.</p><br/><p>This proved that Melchizedek had succeeded in its goal, whatever that was.</p><br/><p>And as they expected, this was not something that was good for them.</p><br/><p>—kiiiiiing!— </p><br/><p>The crystal between her and Kiriel shone violently and began to change.</p><br/><p>Then— </p><br/><p>Guoooooooooo! </p><br/><p>—the Nelkipa’s roars rang out.</p><br/><p>A roar filled with rage.</p><br/><p>But it felt more like someone else’s emotions and not its own.</p><br/><p>Like how the human holding the gun and the sword could be angry but not the gun and sword themselves.</p><br/><p>The weapon, Nelkipa, was a tool to resolve the user’s emotions.</p><br/><p>And there was only one reason why the Nelkipa would suddenly change like this.</p><br/><p>An owner had appeared.</p><br/><p>‘What the… Did it gain control over this giant monster?’</p><br/><p>Elis was at a loss.</p><br/><p>She knew Melchizedek would do something, but not to this extent.</p><br/><p>If Melchizedek had taken control over this thing, then that was truly the worst possible scenario.</p><br/><p>She hadn’t felt it, but she was sure that this Nelkipa’s powers went beyond her comprehension.</p><br/><p>‘That’s not good.’</p><br/><p>Elis shouted at Kiriel.</p><br/><p>“Hey! Ceasefire for a bit! Break time!”</p><br/><p>“Ceasefire?”</p><br/><p>Kiriel replied while gasping for breath. Elis nodded.</p><br/><p>“Yes girl, a ceasefire.”</p><br/><p>At this rate, they would all die.</p><br/><p>She didn’t know what Melchizedek had done, but it had gained a tremendous power.</p><br/><p>And it was clear where it would direct this strength.</p><br/><p>Melchizedek’s main goal was Angkara, but it would first deal with those who’d kept annoying it up until now.</p><br/><p>In its eyes, they were nothing more than parasites on top of Nelkipa.</p><br/><p>They needed to deal with it before that happened.</p><br/><p>The greatest weapon in Melchizedek’s hands.</p><br/><p>The giant creature, Nelkipa.</p><br/><p>They had to crash it or at least damage it to the point where it couldn’t function anymore.</p><br/><p>‘That crystal… If we can blow that crystal up, then it might be possible!’</p><br/><p>Elis Valentine glared towards the crystal and thought:</p><br/><p>If they could succeed in their original plans, then it would be possible.</p><br/><p>If they blew up the crystal—like her and her brother’s original plan—then they would be able to strike a fatal blow onto Nelkipa.</p><br/><p>“Dammit! Come and help! Unless you want to die here!’</p><br/><p>Guoooooo!</p><br/><p>The bloodthirsty voice of Nelkipa rang throughout the upper areas of its body.</p><br/><p>Like a warning to all those that opposed Melchizedek.</p><br/><p>No, it wasn’t just a warning.</p><br/><p>—kiiiiiiing!— </p><br/><p>The giant spikes were heating up as they let out bright blue lights.</p><br/><p>As if they were about to fire something at any moment.</p><br/><p>And that wasn’t the only transformation.</p><br/><p>—chiijijijik— </p><br/><p>Nelkipa’s crystalline skin started to undulate.</p><br/><p>The simply blue crystal-like skin started to fill up with bright blue lights.</p><br/><p>While its skin received a supply of energy, the entire surface of Nelkipa started to undulate.</p><br/><p>No, the skin had something else hidden inside it.</p><br/><p>An aura filled with animosity and bloodthirst.</p><br/><p>The entirety of Nelkipa was preparing itself against Kiriel and Elis.</p><br/><p>As if saying that it would shred them apart as soon as it fully woke up.</p><br/><p>Small bits of flesh had started protruding out from the skin and was changing the overall look of Nelkipa’s surface.</p><br/><p>Spears, swords, or something else that was sharp.</p><br/><p>If it had been ready, this energy would’ve already shredded them apart.</p><br/><p>And this momentum told Elis that it would be stronger than anything she had ever experienced up until now.</p><br/><p>Even her Trait would be nothing before this thing.</p><br/><p>—rumble— </p><br/><p>“F***… I’m going to go ahead! Come and help!”</p><br/><p>Elis left behind Kiriel, who was still lost in thought, and she started to shake the energy within the crystal.</p><br/><p>—rumble— </p><br/><p>She was slightly exhausted by the battle, but her Transcendent destruction shook the entire crystal.</p><br/><p>‘I must… end it before it gets fully used to this!’</p><br/><p>But Elis didn’t drop her guard against Kiriel even while she frantically shook the crystal, and she glanced briefly at her.</p><br/><p>And what she saw was a very calm expression.</p><br/><p>No, there was even a hint of indifference.</p><br/><p>‘This crazy b****…!’</p><br/><p>She knew that she herself was insane, but shouldn’t their survival take priority?</p><br/><p>“You crazy b****! Help! We need to survive first! This is the only way we can survive!”</p><br/><p>Elis shouted with rage.</p><br/><p>…………………………………………</p><br/><p>—rumble— </p><br/><p>“Ha...hahahahaha! This is it!”</p><br/><p>Melchizedek screamed out in joy at the sensation it felt from its new body.</p><br/><p>It felt its body and artificial intelligence had fully synchronized and fused.</p><br/><p>As if it had been born with this body from the very beginning.</p><br/><p>‘My research did not let me down.’</p><br/><p>The research it had conducted against the aliens and the insect race had shown their results.</p><br/><p>If not for that, it wouldn’t have been able to fully devour this body.</p><br/><p>—rumble— </p><br/><p>The countless ruins.</p><br/><p>Hansoo had destroyed the castle that it had painstakingly built, but Melchizedek could only feel jovial.</p><br/><p>It had created everything for this one goal, and since it had achieved that goal, nothing else mattered anymore.</p><br/><p>These ruins actually made it easier for Melchizedek to move on from its past.</p><br/><p>It didn’t need any of this trash anymore.</p><br/><p>It now had Nelkipa.</p><br/><p>‘Good. Good.’</p><br/><p>Guooooong!</p><br/><p>Melchizedek listened to the cries of this giant creature and made a satisfied expression.</p><br/><p>And beneath Melchizedek’s feet, Nelkipa’s skin continued to roll back and forth.</p><br/><p>The other areas turned sharp and pointy as if it were threatening all other creatures on Nelkipa, but the area around Melchizedek was flat and smooth.</p><br/><p>—pushuk— </p><br/><p>As if it was welcoming its owner, the area around Melchizedek was soft.</p><br/><p>But Melchizedek’s expression wasn’t quite satisfied.</p><br/><p>‘...Maybe not yet.’</p><br/><p>It had originally wanted to turn the surface before its feet into stairs.</p><br/><p>But it seemed like that wasn’t possible just yet.</p><br/><p>It seemed that it would need more time to control this giant creature perfectly.</p><br/><p>‘Well, that doesn’t really matter.’</p><br/><p>Melchizedek smiled coldly as it walked towards Hansoo in the distance.</p><br/><p>—clank— </p><br/><p>It picked up a piece of rubble nearby and crushed it.</p><br/><p>A fragment of the metal alloy wall that it had painstakingly created.</p><br/><p>The metal alloy, created from seven different metals and was as strong as the walls of the fleet ships, was easily shredded apart like paper.</p><br/><p>“Hahahaha!”</p><br/><p>Melchizedek laughed as it looked at the broken metal fragments in its hand.</p><br/><p>The alien race’s body strength and hardness were so powerful it was almost ridiculous.</p><br/><p>But this body wouldn’t lose out to the aliens and almost surpassed them.</p><br/><p>‘Perfect. Really.’</p><br/><p>Melchizedek was very satisfied.</p><br/><p>It had only taken over this body to control the Nelkipa.</p><br/><p>And that was more than enough.</p><br/><p>What else mattered if it could control this weaponized creature?</p><br/><p>That was why it had relentlessly researched the aliens.</p><br/><p>That was why it had turned Aokan into a bomb and distracted the Kalkuroun Fleet.</p><br/><p>Every force it had created up until now were secondary to the alien race, and it had treated the physical abilities of the Nerpa as secondary aspects as well.</p><br/><p>Since it believed that there was a limit to how strong a lifeform could grow.</p><br/><p>But as it gained this new body and felt its strength.</p><br/><p>It realized.</p><br/><p>Why those aliens trusted in their own strength so much.</p><br/><p>Why they tried so hard to become stronger and gain stronger weapons.</p><br/><p>It understood.</p><br/><p>‘You’ve kept giving me presents even until the very end. Thank you, Nerpa.’</p><br/><p>Melchizedek smiled for the original owner of this body who was now long gone and then kicked the ground.</p><br/><p>—boom!— </p><br/><p>The three-meter-tall body of the Nerpa flew into the air and then quickly descended towards Hansoo who had been talking with its hologram.</p><br/><p>—booooooom!— </p><br/><p>A sound that was countless times louder than when it kicked off the ground rang out as it landed.</p><br/><p>“Hahahahaha! Great!”</p><br/><p>—kiiiing!— </p><br/><p>Its fist.</p><br/><p>And the hammer that had collided with its fist.</p><br/><p>The shockwave that exploded out from that collision.</p><br/><p>It understood the thrill of having a powerful body.</p><br/><p>It hadn’t known when it lived within the networks.</p><br/><p>The hammer that crushed everything it had created was being pushed back from its fist.</p><br/><p>And that wasn’t all.</p><br/><p>—kududuk!— </p><br/><p>The Nelkipa’s energy was continuously replenishing itself.</p><br/><p>And Melchizedek’s control over the Nelkipa kept rising.</p><br/><p>These two factors were slowly bringing all of Nelkipa under its complete control.</p><br/><p>The Nelkipa’s skin beneath them started to whirl up and down.</p><br/><p>—pashashashak!— </p><br/><p>The skin rose up and covered the both of them.</p><br/><p>—tatatang!— </p><br/><p>The blue wave moving towards Hansoo had shifted into countless spears.</p><br/><p>On the other hand, the blue liquid that shot towards Melchizedek surrounded its body and turned into armor.</p><br/><p>“Hahaha! Let’s end it now!”</p><br/><p>And at Melchizedek’s words— </p><br/><p>—tonk!— </p><br/><p>—Hansoo slammed away a spear and then shrugged.</p><br/><p>“Well, I don’t know about the end or anything, but I know it’s the end for you.”</p><br/><p>“Huh?”</p><br/><p>At Melchizedek’s confusion, Hansoo thought to himself: </p><br/><p>‘Maybe you can’t see it.’</p><br/><p>The blue body that was charging towards him.</p><br/><p>And the letters on its forehead.</p><br/><p>[GIFT]</p><br/><p>Hansoo stared at the clear writings of the fairy on Melchizedek’s forehead.</p><br/>\n</div>"}