{"title": "Chapter 376: Inheritance War (6)", "id": 376, "volume": 4, "url": "http://boxnovel.org/reincarnator-chapter-376-inheritance-war-6", "volume_title": "Volume 4", "body": "<h1>Chapter 376: Inheritance War (6)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 376: Inheritance War (6)</p><br/><p>—booooom!— </p><br/><p>“Hahaha! What’s up? Try a bit harder!”</p><br/><p>Elis Valentine laughed out loud as she charged towards Kiriel.</p><br/><p>Despite her laughter, she was bleeding from her entire body.</p><br/><p>Kiriel freaked out at the sight of Elis Valentine continuing to charge at her despite the countless wounds on her body.</p><br/><p>‘I knew she was crazy, but… she’s just straight up mental.’</p><br/><p>She realized that something was off with Elis’s head when she saw her stabbing herself with that spike.</p><br/><p>But she didn’t expect her to be this crazy.</p><br/><p>—kiiiiiiiiiing!— </p><br/><p>Kiriel activated the Dragon God Armor to its limits as she attacked Elis Valentine again.</p><br/><p>—clank!— </p><br/><p>Success.</p><br/><p>The fang in Kiriel’s hand had cut enough flesh to reveal Elis Valentine’s ribs.</p><br/><p>A wound that would cause people to freeze up in shock from the pain alone.</p><br/><p>But Kiriel didn’t rejoice with this and instead hardened her muscles.</p><br/><p>‘Damn it… Huup!’</p><br/><p>“Hahahaha!”</p><br/><p>—booom!— </p><br/><p>Elis Valentine’s partially cut-off right hand smashed into Kiriel’s stomach.</p><br/><p>‘Ugh!’</p><br/><p>Kiriel breathed in deeply at the powerful force slamming her stomach, quickly regaining her balance as the blow flung her back.</p><br/><p>—chiiiii— </p><br/><p>Kiriel dug her fingers into the ground, slowing herself from being flung backward.</p><br/><p>‘Tsk…’</p><br/><p>And she frowned as Elis Valentine approached her again with a smile.</p><br/><p>—ssss— </p><br/><p>The injuries on her body were healing at a visible pace.</p><br/><p>New skin grew, and her body reabsorbed the leaking blood.</p><br/><p>Broken bones mended and severed muscles healed.</p><br/><p>A monstrous healing ability.</p><br/><p>Even for a 3-Star Transcendent, it was abnormal.</p><br/><p>She wasn’t at that level, not even close.</p><br/><p>Elis’s spike had punctured her skin, and the wound was still bleeding.</p><br/><p>‘...Annoying.’</p><br/><p>Kiriel frowned as she looked at the completely healed Elis.</p><br/><p>Elis made a creepy smile as if Kiriel’s expression made her feel happy.</p><br/><p>“It seems you don’t have a Trait designed for battle? So how is it? Seeing a battle-specialized Trait?”</p><br/><p>Kiriel shrugged.</p><br/><p>“Eh, I’m not really envious or anything. I’m not insane like you.”</p><br/><p>Rising to the 3-Star level had strengthened her Trait as well.</p><br/><p>Unlike before, where she had to focus to read memories, she could now read memories just by touching someone briefly during a fight.</p><br/><p>Elis’s Trait was . </p><br/><p>She was resistant to pain.</p><br/><p>A human’s natural defense mechanism to feel pain did not exist inside her.</p><br/><p>Actually, one could say it was more of a disorder than a Trait at this point.</p><br/><p>But of course, her Trait allowed her to take this to another level.</p><br/><p>She could save the pain she would otherwise feel and convert it into her own strength or even heal herself.</p><br/><p>A very useful Trait in a battle.</p><br/><p>A battle involved collective actions that put one through pain.</p><br/><p>Of course, the healing rate wasn’t crazy to the point that she could heal everything.</p><br/><p>She was still losing out in the end.</p><br/><p>But since Elis was giving away a rib to cut a single piece of Kiriel’s flesh, Kiriel was the one truly losing out in this battle.</p><br/><p>And another.</p><br/><p>‘...Damn. She wasn’t poking her body around just for fun.’</p><br/><p>Normally, she shouldn’t be able to heal like that.</p><br/><p>Calculating the injuries Kiriel had given to Elis, there wasn’t enough damage to heal her to this degree.</p><br/><p>But Elis had completely recovered.</p><br/><p>There was only one reason for this.</p><br/><p>She had saved up the pain with her Trait and waited.</p><br/><p>‘She’s insanely efficient.’</p><br/><p>She had accumulated her painful actions and used it to heal.</p><br/><p>With her natural healing abilities, the injuries from her spikes were more than enough for her to mend her wounds. </p><br/><p>And this was the result.</p><br/><p>A near immortal body.</p><br/><p>Elis giggled as she looked at Kiriel.</p><br/><p>“Oh, don’t misunderstand. The thing I was doing before is my hobby. I’m not doing it because I need to.”</p><br/><p>“...?”</p><br/><p>Kiriel was at a loss.</p><br/><p>‘This girl. She’s really mental.’</p><br/><p>Elis continued to speak, enjoying Kiriel’s expression.</p><br/><p>“You see, I was in a lot of pain before I came here in the past. A lot of pain. So much pain that I’d faint from it. But then it’s funny because you wake up from the pain. Every day is a living nightmare.”</p><br/><p>Later on, the medication stopped working as well.</p><br/><p>Struggling from pain day by day.</p><br/><p>She wanted to die, but they wouldn’t let her.</p><br/><p>“But there was at least one good thing about it.”</p><br/><p>“...What is it?”</p><br/><p>Elis laughed as she replied:</p><br/><p>“When I used all my effort to pretend not to be in pain, people looked at me with admiration in their eyes.”</p><br/><p>This had made her feel special.</p><br/><p>It was something that others couldn’t do.</p><br/><p>Withstanding pain that others couldn’t even imagine.</p><br/><p>Her body felt full of pain, but that one thing was good.</p><br/><p>And the Trait she had earned as she came over to this world… </p><br/><p>Pain Nullification.</p><br/><p>“I really like this world. I don’t hurt anymore. But unlike before, the people don’t look at me the same anymore. So I started this.”</p><br/><p>—stab— </p><br/><p>Kiriel watched as Elis stabbed herself again in a daze.</p><br/><p>And Elis looked at her expression and smiled.</p><br/><p>“Yes, that expression.”</p><br/><p>“You crazy b****. These aren’t the eyes of admiration but eyes that think you’re f***ing insane.”</p><br/><p>Elis shrugged her shoulders.</p><br/><p>“Well, it’s all the same shit. They’re all surprised by me, right? Anyway, come at me. You have to stop me, right? I need to finish this up and go over to my brother too. Remember, this whole place will blow up if you don’t stop me.”</p><br/><p>Looking tired, Kiriel mumbled:</p><br/><p>“I’m coming, you crazy b****…”</p><br/><p>Her entire body was creaking with pain but thanks to their chat, she had healed to a certain degree.</p><br/><p>Kiriel stared at Elis and thought to herself:</p><br/><p>‘I don’t know what to do, Hansoo… she’s more insane than I imagined.’</p><br/><p>A crazy b**** could be dealt with if you beat them halfway to death, but she was also ridiculously strong.</p><br/><p>Kiriel looked at Elis with a bitter expression.</p><br/><p>……………………………………..</p><br/><p>—boom!— </p><br/><p>Hansoo frowned at the countless figures charging towards him.</p><br/><p>‘These aren’t at a 3-Star level, but… for them to become this strong…’</p><br/><p>The overflowing energy from the crystal.</p><br/><p>And the Dragon God Armor that used this energy.</p><br/><p>The modifications that pushed the body’s efficiency to its limits.</p><br/><p>Melchizedek seemed to have taken it as a challenge to see how far one can push a 2-Star Transcendent. It had invested everything it had onto these Artificial Transcendents.</p><br/><p>And they were showing him their might.</p><br/><p>—booom!— </p><br/><p>Hansoo’s Mjolnir and the blade from the Dragon God Armor collided as a huge sound reverberated.</p><br/><p>—tudududuk!— </p><br/><p>Of course, it couldn't withstand the strength of the 3-Star Transcendent Hansoo, so the blade had snapped.</p><br/><p>But the other Artificial Transcendents did not miss this chance.</p><br/><p>—whoosh!— </p><br/><p>Two more attacks rushed in from the small gap created by the first Artificial Transcendent’s collision with Hansoo.</p><br/><p>Including the one blocking his attacks, three Artificial Transcendents were raining attacks down on his body.</p><br/><p>Hansoo frowned at seeing these attacks closing in on him from all directions and then let down his guard.</p><br/><p>—pushuk!— </p><br/><p>Three blades embedded themselves between the gaps of the blue armor.</p><br/><p>And as if they felt ecstasy from the succession of their attacks, they all smirked a little.</p><br/><p>A deep wound.</p><br/><p>No matter how strong Hansoo was, this was still fatal.</p><br/><p>One blade had even approached his heart.</p><br/><p>Any small movement could rob Hansoo of his life.</p><br/><p>But while the Artificial Transcendents were rejoicing, Hansoo voice called out:</p><br/><p>“I’m sure Melchizedek erased your emotions because they might interfere in battle.”</p><br/><p>“...?”</p><br/><p>Hansoo continued to speak as he looked at their confused expressions.</p><br/><p>“I’m just saying, if you wish to rejoice then do it after everything’s over.”</p><br/><p>Then— </p><br/><p>—boooooooooom!— </p><br/><p>—the hammer in Hansoo’s hand swung through the air and smashed through their heads in quick succession.</p><br/><p>The Dragon God Armor and the overflowing energy of the crystal had tried to protect them, but it was all futile.</p><br/><p>The seven dragons that he’d gathered while they stabbed him had sent all three heads flying away, one at a time.</p><br/><p>‘“Haa...Haaa…”</p><br/><p>…ssssss…</p><br/><p>Hansoo healed his injury with his Immortal Soul as he looked around.</p><br/><p>‘There’s still a few more left?’</p><br/><p>Since he was trying to finish things quickly, he’d lost a significant amount of stamina.</p><br/><p>Even the Immortal Soul had a limit in healing wounds from the condensed mana—it took a considerable amount of effort for it to fully heal these wounds.</p><br/><p>In a situation where he didn’t know what Melchizedek was planning inside, he didn’t have the leisure to be wasting his energy and stamina like this.</p><br/><p>Hansoo passed by the corpses of the ones he’d killed off and quickly dashed further into the depths where he felt the crystal’s aura.</p><br/><p>The aura was continuously expanding.</p><br/><p>It didn’t look simple.</p><br/><p>‘Let’s see. Let’s see what you have hidden.’</p><br/><p>—boom!— </p><br/><p>Hansoo hastened towards the depths of Melchizedek’s machine castle.</p><br/><p>……………………………………………</p><br/><p>“Who made that? That creature? Isn’t it alive?”</p><br/><p>N-Aroel shook his head.</p><br/><p>“No way. Somebody created it.”</p><br/><p>“...It?”</p><br/><p>Roaaaaaar! </p><br/><p>R-Koronaita Nell freaked out as he looked at the giant creature, Nelkipa, as it flew through space.</p><br/><p>‘That… Somebody made that?’</p><br/><p>A body with defensive properties that was countless times more superior than their proud fleet of flames.</p><br/><p>Who had created that?</p><br/><p>For what reason?</p><br/><p>And as if N-Aroel had read R-Koronaita Nell’s mind, he answered his thoughts.</p><br/><p>“That is a warship. A warship created by a certain race.”</p><br/><p>“...That’s a warship?”</p><br/><p>“It’s not even active by the way. It’s… just waking up?’</p><br/><p>“What?”</p><br/><p>N-Aroel laughed at R-Koronaita Nell’s dumbfounded expression and said:</p><br/><p>“It’s a warship. A ship designed for war. It’s not supposed to float around like a jellyfish. If it started up properly… It’ll be amazing.”</p><br/><p>N-Aroel then made an amused expression as he looked at the countless spikes on the Nelkipa’s back.</p><br/><p>“But aren’t you curious? As to how I know all this?”</p><br/><p>R-Koronaita Nell’s expression froze.</p><br/>\n</div>"}