{"title": "Chapter 390: Flameless Land (4)", "id": 390, "volume": 4, "url": "http://boxnovel.org/reincarnator-chapter-390-flameless-land-4", "volume_title": "Volume 4", "body": "<h1>Chapter 390: Flameless Land (4)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 390: Flameless Land (4)</p><br/><p>“A betrayal.”</p><br/><p>John Stone chuckled at Hansoo’s words.</p><br/><p>“Yeah. He’s playing at being friends with the people of this place. Even though I’ve been trying to persuade him to work for our kind.”</p><br/><p>John Stone pointed to the area behind him.</p><br/><p>“Here are a few of my forces. I built them after everyone else left. Ah, they’re coming now.”</p><br/><p>From the direction that John Stone pointed at— </p><br/><p>—rumble— </p><br/><p>—a few armed vehicles, running on ancient fuel, were making loud noises and emitting black smoke as they approached Hansoo’s group.</p><br/><p>Despite using ancient fuels, the technology used to create them was very advanced, so they moved at swift speed. Soon, the vehicles had reached their party.</p><br/><p>…brrr… </p><br/><p>Dozens of vehicles stopped by Hansoo and John Stone as hundreds of people started to disembark from the vehicles.</p><br/><p>People with ancient weapons.</p><br/><p>And John Stone waved to them with a laugh.</p><br/><p>“Haha. You came?”</p><br/><p>“... I don’t even know how you found out.”</p><br/><p>John Stone chuckled at Erunheim’s words.</p><br/><p>“My own race came up, so how could I ignore them? I should be the first to greet them.”</p><br/><p>Although the word ‘race’ was a bit awkward… </p><br/><p>It was the correct term to use in the current situation since they were messing around with another race all while jumping around multiple dimensions.</p><br/><p>John Stone smiled.</p><br/><p>And Erunheim frowned at this sight.</p><br/><p>‘What a snake…’</p><br/><p>Despite their scouts’ extreme wariness of the alien’s territory, a few of them had been kidnapped from time to time.</p><br/><p>She had been wondering about these incidents, but it seems that her worries weren’t unprecedented.</p><br/><p>Otherwise, it would be impossible for John Stone and the other aliens to find this exact location in the vast territory of Reyunion.</p><br/><p>John Stone looked at Erunheim’s expression in contentment and then looked at Hansoo again.</p><br/><p>‘With him here… he’d be of great assistance.’</p><br/><p>Although he acted proudly before Erunheim’s forces, Sangjin was someone he couldn’t even dream of going against.</p><br/><p>As well as any others on the same level as Sangjin.</p><br/><p>Even if he got the crystal that could suppress the Flame, what good would that be against his own race?</p><br/><p>Yes, it would make it easier for him to go against the Neropa Union or the Pompeion Empire, but he needed a different kind of strength to go against another Transcendent.</p><br/><p>‘I can’t go up anyway, so… I need to make this place my own land.’</p><br/><p>Going up would be a stretch.</p><br/><p>He needed to figure out a way to make this place, the 6th Zone, his home.</p><br/><p>An unshakable home of this own.</p><br/><p>Of course, some might think of John Stone as weird.</p><br/><p>They could go up at any time through the elevator, but there was a reason that they were sticking around the Neropa Union and the Pompeion Empire.</p><br/><p>They could just hunt around here for a bit and then go up.</p><br/><p>But no.</p><br/><p>The road upwards had long been blocked.</p><br/><p>‘Damned bastards…’</p><br/><p>John Stone frowned as he thought of the final words of those who’d gone up to the 7th Zone.</p><br/><p>Although it annoyed him, their words were correct, and he did agree with them.</p><br/><p>He’d climbed up here wanting to become the best, but there was always a higher mountain.</p><br/><p>The people who had gone up had formed an alliance to crush anyone who tried to go up after them.</p><br/><p>It was too dangerous for him to go through them.</p><br/><p>Of course, why would he need to go?</p><br/><p>He could just get the crystal and take over the 6th Zone.</p><br/><p>It wouldn’t be impossible if he had the crystal—he could use it to deal with those weak to the crystal, and then use strength to deal with everyone else.</p><br/><p>‘And this person… would be of great help in dealing with them.’</p><br/><p>The more shields he had, the better.</p><br/><p>He had to drag Hansoo over to his side no matter what.</p><br/><p>John Stone thought of Sangjin as he spoke to Hansoo.</p><br/><p>“Sangjin gave up on going up and allied with another nation. Despite me telling him to stay here and help the people coming up after.”</p><br/><p>John Stone pointed to the people behind him.</p><br/><p>It wasn’t a lie.</p><br/><p>These people had barely succeeded in coming up from below.</p><br/><p>Although a lot of survivors were spread around the continent and throughout the entire 6th Zone, these were the people who had decided to stay and increase their strength.</p><br/><p>This was a safe place to raise their strength, and they also had the people of Reyunion working as their slaves.</p><br/><p>‘Not bad at all.’</p><br/><p>He was the leader here and could provide Hansoo with everything he wanted or desired.</p><br/><p>And this man was someone who struggled to save mankind.</p><br/><p>There would be no reason for him to collide against Reyunion, a place made to protect their kind.</p><br/><p>John Stone continued to speak.</p><br/><p>“But it’s really not easy. The people who originally lived here continue to crawl back out of curiosity… Everyone who had the strength to help left on their own. We need someone as strong as you. Stay with us.”</p><br/><p>Hansoo didn’t reply to that question, but rather asked another question:</p><br/><p>“I’m curious about something else. So he left for another nation?”</p><br/><p>John Stone nodded.</p><br/><p>“Yes, the Pompeion Nation.”</p><br/><p>“Hmm.”</p><br/><p>The expressions of Erunheim and the other people of Reyunion turned dark.</p><br/><p>John Stone continued to speak as he observed the looks on their faces.</p><br/><p>“I don’t know where he is or what he’s doing—we’re struggling this hard, but he ran off alone.”</p><br/><p>“Struggle?”</p><br/><p>John Stone nodded again.</p><br/><p>“Yeah, we’re trying to dig something up.”</p><br/><p>‘I can’t hide that thing anyway.’</p><br/><p>Even if he tried to hide it, the noisy people around him would spill the details in the end.</p><br/><p>About the powers of the crystal.</p><br/><p>If that was the case, it was better to drag this guy in and quickly finish the job.</p><br/><p>Since the job would become much easier with Hansoo’s help.</p><br/><p>‘He wouldn’t try to force things anyway.’</p><br/><p>John Stone thought of the stories he’d heard about the Hansoo of the past.</p><br/><p>And Hansoo only sighed inwardly as he looked at John Stone.</p><br/><p>‘...Are there only people like him left around here?</p><br/><p>He’d figured out that something had happened because of the lack of aggression up here.</p><br/><p>But this was too much of a disappointment.</p><br/><p>This was the limit of people surrounding the core location, the elevator.</p><br/><p>Of course, the man before him had gathered some forces.</p><br/><p>A few 3-Star Transcendents were present, and there were quite a lot of people from Reyunion as well.</p><br/><p>If he could absorb all this strength, it would be quite useful.</p><br/><p>But this was not what he expected.</p><br/><p>Hansoo looked around.</p><br/><p>‘What the hell have you done up until now?’</p><br/><p>This was nowhere close to what he’d anticipated.</p><br/><p>He had hoped that stronger people would’ve been around here.</p><br/><p>Even if they were fighting.</p><br/><p>But there was nothing here.</p><br/><p>Clementine’s forces had long left this place.</p><br/><p>And his old comrades had left too.</p><br/><p>But this place was a strategic point.</p><br/><p>If they hadn’t chosen to protect this location, there would be a reason for that.</p><br/><p>A reason that forced them to leave.</p><br/><p>‘It seems the place up there has truly become chaotic… I need to deal with these kids first.,’</p><br/><p>Hansoo looked at the man who was standing before him without a single shred of fear.</p><br/><p>It seemed that John thought his words had sounded enticing and was feeling confident about his offer, but that was not the case.</p><br/><p>Hansoo really wasn’t feeling so great right now.</p><br/><p>Then— </p><br/><p>‘What the hell?’</p><br/><p>—as he looked at Hansoo’s eyes… </p><br/><p>John Stone felt a sense of danger as he slowly backed away.</p><br/><p>…………………………………….</p><br/><p>—rumble— </p><br/><p>The top of a giant tower that rose up to the clouds.</p><br/><p>A beautiful terrace was located at the top of this tower.</p><br/><p>—chiiiing— </p><br/><p>Inside the translucent barrier that blocked the powerful winds from outside.</p><br/><p>A man sat as he looked at the scenery below.</p><br/><p>“A good sight.”</p><br/><p>—rumble— </p><br/><p>The man looked down as he mumbled.</p><br/><p>The hundreds of ships that covered the sky.</p><br/><p>The countless skyscrapers that filled the space between them.</p><br/><p>And the light of the that fueled all of these things, visible between the valleys of the continents.</p><br/><p>Within the entire planet of Angkara, there was only one man who could look down at all of this.</p><br/><p>The Emperor.</p><br/><p>The epitome of authority within the Pompeion Empire.</p><br/><p>The man who controlled the , the army of twelve fleets and countless Dragon God Soldiers, which shook half of the world.</p><br/><p>And inside the terrace where only the Emperor was permitted, a few others were standing.</p><br/><p>Three men and two women.</p><br/><p>But one man stood out.</p><br/><p>Because while two of the men and the two women radiated a violet aura, only one man radiated a natural color.</p><br/><p>Showing that he was truly alive.</p><br/><p>Emperor Pompeion spoke to that man.</p><br/><p>Towards the man who held a heavy atmosphere.</p><br/><p>“I thank you again for your efforts. And also… don’t you miss your old comrades?”</p><br/><p>At Pompeion’s curious words— </p><br/><p>—the man, Sangjin, spoke with a heavy tone:</p><br/><p>“...No. The situation has changed after all.”</p><br/><p>Pompeion nodded.</p><br/><p>“Right. You’re already quite burdened with your current duties. But… I hope you can try a bit harder. That is the only way for you to acquire what you desire. And what I desire.”</p><br/><p>Sangjin nodded.</p><br/>\n</div>"}