{"title": "Chapter 393: Owner of the crystal (1)", "id": 393, "volume": 4, "url": "http://boxnovel.org/reincarnator-chapter-393-owner-of-the-crystal-1", "volume_title": "Volume 4", "body": "<h1>Chapter 393: Owner of the crystal (1)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 393: Owner of the crystal (1)</p><br/><p>—whoooosh!— </p><br/><p>Just as Hansoo arrived— </p><br/><p>—chaos occurred beneath.</p><br/><p>“Who are you?”</p><br/><p>—tatatatak!— </p><br/><p>A few people quickly approached them and asked.</p><br/><p>And Hansoo replied:</p><br/><p>“John Stone sent us. To see the progress.”</p><br/><p>There was no need to fight unnecessary fights.</p><br/><p>He only needed to figure out the situation down here.</p><br/><p>And more than anything else… </p><br/><p>‘Feels like I shouldn’t fight in there.’</p><br/><p>—sssss— </p><br/><p>Hansoo thought as he looked at the strange darkness.</p><br/><p>He didn’t know if it was because of the controller or because of something else, but it was hard to see inside the darkness.</p><br/><p>He would be able to check after he went in there but causing a wreck here didn’t seem like the best option.</p><br/><p>Hansoo decided to trust in his instincts from his years in the Abyss and just scout things out.</p><br/><p>“Let’s hurry up and go down. We need to check on the crystal.”</p><br/><p>“...Sure?”</p><br/><p>The doubtful expressions on the other people remained as they started to move downwards.</p><br/><p>“Come.”</p><br/><p>—whoooosh!— </p><br/><p>Hansoo and a few other Transcendents started to make their way down.</p><br/><p>But they didn’t go all the way down.</p><br/><p>—tatatak!— </p><br/><p>The Transcendents stopped part way through to tie themselves onto their original posts, cutting away at the darkness again. They said:</p><br/><p>“We’ll remain here and finish up our job, so go down and speak to Ban Gipson. The crystal is under his jurisdiction.”</p><br/><p>And with those words— </p><br/><p>—whoooosh!— </p><br/><p>—Hansoo and Kiriel quickly descended away from the others.</p><br/><p>While dropping down, they passed by quite a large number of Transcendents.</p><br/><p>Every single one of them had tied themselves onto a part of the wall and were cutting away at the darkness.</p><br/><p>—clang!— </p><br/><p>—kacha!— </p><br/><p>Not a single normal adventurer was among them.</p><br/><p>All these Transcendents were using their respective reinforcements and skills to cut away the darkness.</p><br/><p>But the darkness was so durable and strong that they barely made a dent despite the countless attacks.</p><br/><p>“Damn…’</p><br/><p>One Transcendent gathered his strength and slammed down onto a long strand of darkness.</p><br/><p>—boom!— </p><br/><p>The thin strand of darkness snapped.</p><br/><p>—kuooooong!— </p><br/><p>The strand of darkness made a strange sound as it squirmed violently.</p><br/><p>Not only the snapped strand, but every single bit of darkness around it as well.</p><br/><p>And every time that strand moved, the darkness that squirmed along with it threatened the light around them.</p><br/><p>The expressions of the the Transcendents turned dark.</p><br/><p>It was a sight that was hard to get used to no matter how many times they witnessed it.</p><br/><p>These damned strands were already hard to cut off, but even after being cut, they still caused a scene like this.</p><br/><p>But they could not stop.</p><br/><p>Since they all knew how John Stone would treat them if they stopped.</p><br/><p>John Stone was a good leader, but once angered, it was very hard to restrain him.</p><br/><p>‘Ugh, I hope he doesn’t get angry.’</p><br/><p>A few people trembled at this thought and continued to cut away at the darkness.</p><br/><p>And Kiriel looked at these people with an uncomfortable expression.</p><br/><p>“This… This place feels a bit murky, right?”</p><br/><p>The darkness around them was crying out in alarm.</p><br/><p>The 1 and 2-Star Transcendents didn’t seem like they could feel it, but… </p><br/><p>She, a 3-Star Transcendent, could feel it clearly.</p><br/><p>Something that seeped out from the dark depths—something that made her feel uncomfortable.</p><br/><p>‘I don’t really want to touch any of this.’</p><br/><p>Kiriel debated whether to put her hand into the darkness, but realized that they were quickly approaching the floor and prepared to land.</p><br/><p>—tatak!— </p><br/><p>Hansoo and Kiriel landed lightly on the floor.</p><br/><p>And before their eyes— </p><br/><p>—booom!— </p><br/><p>—they saw a few people in the middle of working, all letting out an aura that was countless times stronger than that of the people they had seen on the way down.</p><br/><p>—tonk! tonk!— </p><br/><p>The strands of darkness that 1 and 2-Star Transcendents took countless hits to snap—the people were cutting them away with each swing of their weapons.</p><br/><p>Of course, they weren’t cutting away multiple strands per swing but thinking about how strong the strands were, they were significantly faster.</p><br/><p>But their eyes were clearly drawn to something else.</p><br/><p>A tiny crystal.</p><br/><p>The tiny crystal that was shining brightly amidst the darkness drew Kiriel’s attention.</p><br/><p>‘The strands… They’re all attracted to this place, right?’</p><br/><p>The strands of darkness were all gathering onto the crystal.</p><br/><p>And this is what Clementine and Sangjin had probably seen.</p><br/><p>The item that Hansoo was also looking for.</p><br/><p>‘Well, this was easier than I expected.’</p><br/><p>He looked around at the people working calmly and then started to walk in.</p><br/><p>He felt like he needed to check the crystal first before looking at the darkness around it.</p><br/><p>But at that moment— </p><br/><p>“A cockroach crawled in.”</p><br/><p>—a man chuckled as he looked at Kiriel and Hansoo.</p><br/><p>Hansoo looked at the man and said:</p><br/><p>“John Stone sent us. We’ve confirmed it above already.”</p><br/><p>The man continued to chuckle.</p><br/><p>“That’s so you guys won’t run away, you dumb bastards.”</p><br/><p>The ones above hadn’t sent them in because they were stupid.</p><br/><p>They already knew that these people were trespassers.</p><br/><p>But there was a reason why they had let these two pass.</p><br/><p>So that they wouldn’t run away.</p><br/><p>‘Heheheh.’</p><br/><p>He didn’t know everyone under John Stone.</p><br/><p>But he knew one thing.</p><br/><p>The people who could come down here were a limited few.</p><br/><p>John Stone made it hard for anyone he didn’t trust to even approach that precious item.</p><br/><p>This had caused this project to slow down quite a bit, but it did have a lot of advantages as well.</p><br/><p>Since they would know the moment someone tried to trespass.</p><br/><p>“There’s always people like you. Curious for what’s going on inside and crawling inside… Well, it’s good for us.”</p><br/><p>He was used to this.</p><br/><p>There were always countless cockroaches around.</p><br/><p>They actually liked those kinds of people.</p><br/><p>This was one of the few methods of stress relief for those who spent all day digging these mysterious strands of darkness.</p><br/><p>“Let's start by… beating you halfway to death first.”</p><br/><p>As the man mumbled— </p><br/><p>—boooom!— </p><br/><p>—countless skills started flying towards the two from the darkness.</p><br/><p>………………………………………</p><br/><p>—boooom!— </p><br/><p>—boom!— </p><br/><p>The darkness started to brighten up from the countless skills.</p><br/><p>And Kiriel frowned as she blocked away the attacks with her fang.</p><br/><p>‘Easy.’</p><br/><p>Every single one of them were Transcendents.</p><br/><p>Most were 1-Stars or 2-Stars, but there were some who stood out more than the others.</p><br/><p>They were either slightly weaker than her or even on the same level as her.</p><br/><p>Meaning that they were at the 3-Star level.</p><br/><p>—rumble!— </p><br/><p>Although they aimed most of their attacks at Hansoo, there were a few flying her way as well.</p><br/><p>‘Look at that bastard.’</p><br/><p>—tonk!— </p><br/><p>Kiriel deflected an attack that flung her back, grasping her injured wrist as she looked at the man sending skills flying her way.</p><br/><p>A man who smiled maniacally as he focused all his attacks on her.</p><br/><p>He was only aiming for her, all while scanning her face and body.</p><br/><p>Ignoring Hansoo completely.</p><br/><p>Kiriel frowned as she swung her fang.</p><br/><p>—whooosh!— </p><br/><p>Red clouds started pouring out from Hansoo’s body.</p><br/><p>‘End this quickly.’</p><br/><p>The red clouds covered the dark area and expanded at a tremendous speed.</p><br/><p>“Ahh… uaaaahhh! What is this?!”</p><br/><p>“Kuaaaap!”</p><br/><p>Screams echoed out from all directions.</p><br/><p>‘Wha—what the hell is this!?’</p><br/><p>The man, Ban Gipson, screamed inwardly as he looked at the red clouds that was gnawing away at his body.</p><br/><p>Reinforcement, mana, and weapon.</p><br/><p>The red smoke devoured everything.</p><br/><p>And the ones who rolled around the floor screaming only lasted for a bit before they fell silent.</p><br/><p>The only ones remaining were himself and four other 3-Star Transcendents.</p><br/><p>And towards them— </p><br/><p>—whoooosh!— </p><br/><p>—the terrifying sound of something approaching echoed forth.</p><br/><p>‘F***!’</p><br/><p>Even before Ban Gipson could fully respond— </p><br/><p>—boooom!— </p><br/><p>—a large hammer flew and slammed into Ban Gipson.</p><br/><p>“Kuaa…aaaap!”</p><br/><p>—boom!— </p><br/><p>The Transcendents looked at Ban Gipson who had been sent flying and flinched.</p><br/><p>Ban Gipson was their leader.</p><br/><p>Although there was only a tiny gap of difference in terms of strength, he was still the strongest out of all of them.</p><br/><p>And for such a person to be sent away from a single strike.</p><br/><p>‘Even John Stone isn’t that strong…’</p><br/><p>But one of the men looked at Hansoo as his expression turned into one of disbelief.</p><br/><p>A very familiar face was visible between the blue armor.</p><br/><p>“What the… Kang Hansoo!”</p><br/><p>And everyone else flinched as they heard the man’s shout.</p><br/><p>Why bring up that name here?</p><br/><p>Hansoo ignored them as he continued to walk forwards, saying to Kiriel.</p><br/><p>“This doesn’t feel quite right. I’ll deal with them so read the memories here.”</p><br/><p>Kiriel nodded.</p><br/><p>As they started fighting, the darkness started to tremble.</p><br/><p>As if something was trying to wake up from the external stimulus they were causing.</p><br/><p>“Dammit… Arrgh!”</p><br/><p>“Haa!”</p><br/><p>Leaving the three Transcendents and Hansoo behind, she quickly started to read the memories.</p><br/><p>And soon— </p><br/><p>—the memories of the area around the crystal swiftly entered her mind.</p><br/><p>From the moment Clementine’s forces found the crystal.</p><br/><p>To when Sangjin had entered here.</p><br/><p>And from when John Stone started to work on this place and reached this point.</p><br/><p>Soon— </p><br/><p>“Damn…”</p><br/><p>—Kiriel gulped as she looked around.</p><br/><p>At the darkness surrounding her.</p><br/><p>‘It’s not that they chose not to take it, it’s just that… they couldn’t.’</p><br/><p>It was weird indeed.</p><br/><p>If people like Sangjin and John Stone were to create their own forces.</p><br/><p>Then Clementine’s forces, who should’ve been waiting for such people, should be extremely busy instead.</p><br/><p>Since that was the only way for them to become stronger while being hidden from the eyes of Clementine.</p><br/><p>Which meant that there was something that could distract Clementine’s forces.</p><br/><p>She had been confused because the land above looked way too peaceful, but it seems the answer was here.</p><br/><p>‘They’re all… sleeping here.’</p><br/><p>The darkness around her.</p><br/><p>It was an Abyssal race.</p><br/><p>The real culprit that had forced Clementine’s forces to leave this place and go up.</p><br/><p>‘Crazy bastards… They’re waking up a monster that’s sleeping in peace.’</p><br/><p>Kiriel thought of John Stone’s forces that were cutting away the sleeping monster’s tentacles, her expression utterly horrified.</p><br/>\n</div>"}