{"title": "Chapter 408: Wall (2)", "id": 408, "volume": 5, "url": "http://boxnovel.org/reincarnator-chapter-408-wall-2", "volume_title": "Volume 5", "body": "<h1>Chapter 408: Wall (2)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 408: Wall (2)</p><br/><p>In the interior space of the boulder mountain in the Great Ravine.</p><br/><p>The Technorat, R-Kanoil Pael, gulped as she looked at the countless machines continuously being created from inside the bunker hidden deep within the ground.</p><br/><p>‘...Where did they find such a blueprint?’</p><br/><p>As a Technorat, she had climbed all the way up to R-Level.</p><br/><p>She had, of course, proven her abilities, and she had familiarized herself with every important project within the Family.</p><br/><p>After all, she was now in charge of directing the current top-priority project, the .</p><br/><p>But, there were two matters that even she couldn’t understand.</p><br/><p>The infinite growth of the aliens’ strength.</p><br/><p>And the technology handed down from the family’s main branch that far surpassed her imagination.</p><br/><p>Both these things existed before her eyes.</p><br/><p>—rumble!—</p><br/><p>An alien in the distance lifted up a giant spire.</p><br/><p>With just her hands.</p><br/><p>A giant hunk of metal that was 700 meters long with a 100-meter radius was being lifted up by a small being not even 2 meters in height.</p><br/><p>It was hard to believe, but it was the truth.</p><br/><p>‘And… it’s a woman.’</p><br/><p>The woman lifted the spire and then covered her body with a thin barrier to prevent breaking the nearby structures. She then touched the communications device by her ear.</p><br/><p>—chiijijik—</p><br/><p>Words entered R-Kanoil Pael’s ears.</p><br/><p>R-Kanoil Pael, who had been in a daze watching the woman singlehandedly lifting up that giant metal chunk, woke up from those words and replied:</p><br/><p>&lt;...Yes. That way. Take it to the coordinates N123131, H01689.&gt;</p><br/><p>The woman gave a short response and quickly flew off into the giant valley below.</p><br/><p>‘To go in there…’</p><br/><p>Due to the powerful force field, the giant valley was a place where the Flame’s power could not be used.</p><br/><p>The only ones who could move around with those giant hunks of metal were the aliens.</p><br/><p>It would’ve taken decades for their people to move those giant metal spires.</p><br/><p>Since they would have had to disassemble it first, then move it piece by piece before reassembling it again.</p><br/><p>‘Simply not burning up in the heat is a relief on its own.’</p><br/><p>R-Kanoil Pael shook her head at the powerful flames that seeped out from the depths of the valley and then moved to her next destination.</p><br/><p>Towards the seventeen remaining metal spires that the woman had just departed from.</p><br/><p>And as she drew closer and closer, she saw the metal spires becoming larger and larger.</p><br/><p>Each one was comparable in size with their ships.</p><br/><p>‘So she lifted this thing, huh…?’</p><br/><p>R-Kanoil Pael tried pushing the metal spire in disbelief and then woke up at her futile effort.</p><br/><p>The woman was one thing but these metal spires were strange too.</p><br/><p>A mysterious metal tower that had descended from above and were made up of many parts whose nature were unknown to them.</p><br/><p>Even the core parts built in Neoreim and then sent here had implemented an extremely high level of technology.</p><br/><p>Although the spires had been reassembled here under her own jurisdiction, she still couldn't fully grasp what they were.</p><br/><p>She only knew one thing.</p><br/><p>That they would be activated by the Relic that was hidden deep within the Neoreim.</p><br/><p>Although the Relic was still being held in the capital due to security reasons, once these remaining seventeen spires were all placed in the valley then they would transport it here.</p><br/><p>‘I wish we could finish this up quickly.’</p><br/><p>Overseeing a project in which the technology and its progress couldn’t be fully grasped wasn’t a good feeling.</p><br/><p>R-Kanoil Pael thought as she looked towards the capital in the distance.</p><br/><p>……………………………………………</p><br/><p>“You’re going to stay here?”</p><br/><p>Samuel shook his head at Hansoo’s question.</p><br/><p>“No need to go up.”</p><br/><p>It wasn’t like a better life was waiting for them even if they did go up.</p><br/><p>No, it was the complete opposite.</p><br/><p>There was no guarantee that they’d meet anything positive above but they were certain to encounter even stronger opponents.</p><br/><p>Why should they continue upwards?</p><br/><p>There was only one reason why the others were going up.</p><br/><p>So that they didn’t lose out to the others.</p><br/><p>But this was all based off the greed of wanting to climb higher.</p><br/><p>If one let go of this feeling, the fear of being left behind would naturally disappear as well.</p><br/><p>‘I just figured it out too late.’</p><br/><p>Samuel shook his head as he thought of this.</p><br/><p>It wasn’t that he’d been too late to realize this reality.</p><br/><p>But rather, he’d realized the fact that his abilities weren’t good enough to climb faster than the others.</p><br/><p>‘John Stone, I’m sorry. I promised that we’d climb up together, but…’</p><br/><p>But Samuel shook his head.</p><br/><p>It was too late.</p><br/><p>The plan was almost complete.</p><br/><p>There was no point in taking risks at this point.</p><br/><p>Samuel’s expression froze as he spoke to Hansoo.</p><br/><p>“The Relic is important to us. We cannot hand it over to you.”</p><br/><p>Hansoo pondered as he looked at Samuel before him.</p><br/><p>‘My words won’t get to him.’</p><br/><p>It wasn’t a bad choice.</p><br/><p>It wasn’t a greedy choice.</p><br/><p>But this was only viable if the Abyss didn’t exist.</p><br/><p>There was barely six months left until that happened and then this ‘Utopia’ that Samuel was building would turn into hell.</p><br/><p>‘Even if I explain about the Abyss… He wouldn’t believe me.’</p><br/><p>Hansoo shook his head as he looked at Samuel’s guarded expression.</p><br/><p>Explanations and excuses were basically the same thing.</p><br/><p>The same content could be an explanation in the hands of the strong and an excuse in the hands of the weaker party.</p><br/><p>‘And right now, he is stronger.’</p><br/><p>Hansoo continued to think.</p><br/><p>He wanted to advance to the 4th Star before he took action.</p><br/><p>Since he would be able to suppress most things with sheer strength at that point.</p><br/><p>But he didn’t have the time to do so.</p><br/><p>‘Well, I’ll ask a bit more.’</p><br/><p>Hansoo spoke.</p><br/><p>“So, what will you do?”</p><br/><p>Samuel pondered whether to answer or not.</p><br/><p>But in the end, he decided to.</p><br/><p>‘I… must take him with me anyways.’</p><br/><p>Samuel looked at Hansoo.</p><br/><p>At first he wanted to make Hansoo back off because he was worried.</p><br/><p>Because in his memories, Hansoo still remained as a threat.</p><br/><p>Although he tried hard to ignore it, the images from the past still remained in his head.</p><br/><p>And even after two years, those images were still as clear as day.</p><br/><p>So he had asked Hansoo to back off.</p><br/><p>Because if Hansoo really pulled out his hidden cards, it could cause an uproar.</p><br/><p>But from what he could see, Hansoo was trying to back off as well.</p><br/><p>‘It’s clear that he has no room to back off, but… he is?’</p><br/><p>If Hansoo had the strength to go through him then there was no reason for him to back off.</p><br/><p>But it was clear that Hansoo did not.</p><br/><p>But if Hansoo backed off here?</p><br/><p>He was a 3-Star.</p><br/><p>But what about after that?</p><br/><p>Hansoo would sooner or later become a 4th Star and at that point he would lose.</p><br/><p>‘...Annoying. I’ve had a two year head start and yet there's still only this small amount of difference between us.’</p><br/><p>A killing intent appeared inside Samuel’s mind for a moment, but he soon shook his head.</p><br/><p>He just needed to take Hansoo.</p><br/><p>It was clear that Hansoo could use teleportation as well so it would be bad if he was enraged.</p><br/><p>He needed to catch Hansoo before he ran away.</p><br/><p>Samuel carefully rotated mana around his body and spoke to distract Hansoo.</p><br/><p>“We’re going to create a giant barrier. A barrier to surround the entire Neropa Union.”</p><br/><p>“With the power of the Relic?”</p><br/><p>And as Samuel nodded, John Stone shouted in rage.</p><br/><p>“What the hell do you mean... Why?!”</p><br/><p>Samuel cut him off.</p><br/><p>“Because we need time.”</p><br/><p>The Neropa Union couldn’t use their strength properly.</p><br/><p>To be specific, they had gained a weapon that could turn the tides but hadn’t had enough time to use it properly.</p><br/><p>So they would create a barrier.</p><br/><p>Something that would buy them time.</p><br/><p>A barrier that the ships and even another Relic could not overcome.</p><br/><p>“Wh— Damn. How are we gaining a territory here then?”</p><br/><p>John Stone asked in confusion.</p><br/><p>Even if the Neropa Union won like this, what did it matter?</p><br/><p>A used hunting dog would be shot down.</p><br/><p>They’d be lucky not to get chased by them after all this.</p><br/><p>Samuel muttered coldly.</p><br/><p>“We will deal with that on our own. Kang Hansoo… You will now have to come with me.”</p><br/><p>—kakakakaka!—</p><br/><p>A metal wave rose up from below and exerted pressure on Hansoo.</p><br/><p>It was simple skill but a skill’s prowess was determined by the user after all.</p><br/><p>‘Does it even seal teleportation?’</p><br/><p>Hansoo sensed the skill suppressing him.</p><br/><p>It looked simple but it was actually three skills that were combined in a unique manner, enabling the user to seal off most skills.</p><br/><p>—kakakaka!—</p><br/><p>He tested whether he could break through it but soon shook his head at his futile effort.</p><br/><p>“I remember you saying you’d let me go if I backed off?”</p><br/><p>Samuel scoffed at Hansoo’s words.</p><br/><p>“Please understand, you’re too dangerous for us to let you go just like that. At least a few questions have been answered, right?”</p><br/><p>Hansoo nodded.</p><br/><p>“Right, it wasn’t a bad conversation… I guess I’ll have to meet the person backing you for more details.”</p><br/><p>“Huh?”</p><br/><p>Hansoo chuckled.</p><br/><p>“Not you. I need to talk to the one who planned all of this.”</p><br/><p>Do it properly if you’re going to.</p><br/><p>Just by listening to Samuel’s story, it was clear that Samuel was no more than a puppet.</p><br/><p>—kakaka!—</p><br/><p>The thirteen devils.</p><br/><p>Aroella of Delusion.</p><br/><p>Hansoo tightly grasped the Relic that was hidden within the veil.</p><br/><p>—booooom!—</p><br/><p>Energy exploded out from the Relic and broke through the suppression around him.</p><br/><p>“What the hell! I thought you couldn’t use it!?”</p><br/><p>“Well, that depends on the situation.”</p><br/><p>Hansoo grasped onto the crystal and raised his senses to the limits.</p><br/><p>And he locked onto something that was easily a thousand miles away.</p><br/><p>‘I don’t know who’s drawing up what, but… if I step all over your plans then you’ll pop out naturally.’</p><br/><p>Whatever it was hiding, as long as one shook the container hard enough it was bound to pop out.</p><br/><p>—roaaarrr!—</p><br/><p>A tremendous roar shook the atmosphere.</p><br/><p>Hansoo smiled as he heard the distant roar of the Haetara that had started to run towards a new source of food.</p><br/>\n</div>"}