{"title": "Chapter 403: The Fifth Seed (2)", "id": 403, "volume": 5, "url": "http://boxnovel.org/reincarnator-chapter-403-the-fifth-seed-2", "volume_title": "Volume 5", "body": "<h1>Chapter 403: The Fifth Seed (2)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 403: The Fifth Seed (2)</p><br/><p>“...What is that? I’ve never seen that before.”</p><br/><p>R-Eronia Nell, who had been looking at the alien man from her office, stared into the screen in a daze.</p><br/><p>Darkness covered the man’s body.</p><br/><p>And his battle prowess suddenly skyrocketed.</p><br/><p>So strong that even the seven Dragon God Soldiers, who had received the Flame’s Blessing, had been reduced to a pulp in an instant.</p><br/><p>The Technorat nearby was also watching the screen, and in confusion, N-Magaroan voiced her opinion.</p><br/><p>“It’s a brand new form he has never shown before. If you give me enough time I can analyze—”</p><br/><p>But even before she could finish her words—</p><br/><p>—booom!—</p><br/><p>—R-Eronia Nell slammed her fists onto the table and screamed.</p><br/><p>“More time?! He’s about to breach through our defenses!”</p><br/><p>The defensive line of the capital city, Neoreim.</p><br/><p>Every ship had gone out to the battlefield against Pompeion while many of the Dragon God Soldiers had been spread around the continent.</p><br/><p>The capital was very close to that man.</p><br/><p>If he got through that line of defense, he was basically at the capital already.</p><br/><p>“Damn! Dispatch everyone who received the Flame’s Blessing into that place!”</p><br/><p>“But… the side effects!”</p><br/><p>“You dumb b****!”</p><br/><p>—thud!—</p><br/><p>“Ahh!”</p><br/><p>N-Magaroan collapsed onto the floor after receiving R-Eronia Nell’s enraged kick.</p><br/><p>R-Eronia Nell then picked N-Magaroan up, brought her face close to her own and whispered:</p><br/><p>“I order you. Make… as many blessed ones as you can and dump them there. No matter what you do… He cannot come into the capital.”</p><br/><p>The fairytale stories of the prince who came to save the princess or the hero saving his comrades.</p><br/><p>If that man’s goal was that valiant then it would be good for both sides, but it was clear how far his true goals were from such fantasies.</p><br/><p>The Relic.</p><br/><p>An object that they and the Pompeion Empire had each taken.</p><br/><p>The treasure of all treasures that allowed their technology to soar so much.</p><br/><p>He wasn’t a man in love or a warrior who had lost his friends.</p><br/><p>He’d come here to steal their treasure.</p><br/><p>‘You bandit… This is as far as you go!’</p><br/><p>The family leaders shouldn’t bother themselves with such a job as this.</p><br/><p>Their true opponent was far away in the distance, the Emperor Pompeion.</p><br/><p>Not these bugs crawling around on the ground.</p><br/><p>‘Thief… I will bury you here.’</p><br/><p>At this moment, R-Eronia Nell thought of the ones receiving the Flame’s Blessings and smiled coldly.</p><br/><p>……………………………………</p><br/><p>—rumble—</p><br/><p>Kiriel looked at the Dragon God Soldiers continuing to fly their way and asked Hansoo:</p><br/><p>“Uh… Aren’t we going to use that Relic?”</p><br/><p>Although the power of that skill Hansoo had just used was powerful, the power of the Relic that their opponents were using was tempting as well.</p><br/><p>Even more so since they had a Relic as well.</p><br/><p>‘We’re terribly outnumbered…’</p><br/><p>As Kiriel made a bitter expression at the sheer number of people swarming towards them—</p><br/><p>—rumble—</p><br/><p>—Hansoo, who had rid himself of the dark light, shook his head and spoke:</p><br/><p>“We might end up luring those things.”</p><br/><p>—guoooo!—</p><br/><p>Hansoo looked towards the giant monsters in the far distance.</p><br/><p>The giant moving mountains that were ignoring the countless attacks from the ships and were searching for more Great Furnaces.</p><br/><p>He knew how to use this Relic and had the physical power to withstand it as well.</p><br/><p>But the moment he used this…</p><br/><p>All those mountains would converge onto him.</p><br/><p>The strength hidden inside this thing was far greater and purer than the Great Furnace.</p><br/><p>It was the origin of those giant mountain-sized monsters after all.</p><br/><p>If he used it now, then unlike the Neropa Union’s current indirect method, there would be a huge shockwave that would only serve to attract their attention.</p><br/><p>Those mountains were hard to deal with even for beings who had already reached the 4th Star.</p><br/><p>Since even the warship fleets couldn’t handle that thing.</p><br/><p>‘Too strong. And it’s getting more and more annoying.’</p><br/><p>Hansoo thought, looking at the Haetara in the distance.</p><br/><p>As it passed by a city, the Haetara seemed like it needed a snack and was now eating up the Great Furnace within.</p><br/><p>—crunch!—</p><br/><p>—crackle!—</p><br/><p>But strangely, the giant mountain was slowly decreasing in size as it ate the furnace.</p><br/><p>It was an extremely minute change so most people hadn't noticed it yet.</p><br/><p>But this wasn’t the right time to agitate it yet.</p><br/><p>If all seven of those monsters came here then they would easily crush apart the defensive line, causing the Pompeion Empire to rush over instantly.</p><br/><p>Hansoo did not want that to happen yet.</p><br/><p>Those things and the fleets needed to stay where they were.</p><br/><p>While he dealt with the issue here.</p><br/><p>—rumble!—</p><br/><p>—whoosh!—</p><br/><p>Hansoo laughed as he looked at the mass of Dragon God Soldiers coming his way.</p><br/><p>‘It seems they scrounged up every last bit they could.’</p><br/><p>Hansoo felt the squirming seed of the Nine Dragons Strike inside him and refocused his attention onto another seed.</p><br/><p>The skill he obtained after beating Melchizedek in the 5th Zone.</p><br/><p>Although it hadn’t been long since he planted it inside him, the seed that was glowing in a natural multicolored light was letting out an aura that didn’t lose out to the Nine Dragons Strike.</p><br/><p>Hansoo took a glance at the soldiers before his eyes and then probed the seed in the center of his chest.</p><br/><p>And at that moment—</p><br/><p>—rumble!—</p><br/><p>—a giant shockwave rang out inside his head.</p><br/><p>—booom!—</p><br/><p>His vision quickly darkened.</p><br/><p>Darkness covered the entire sky and not a single ray of light pierced through, causing the land to fall into shadow.</p><br/><p>Lightning strikes struck down from the dark clouds and his surroundings could no longer be seen.</p><br/><p>But Hansoo knew.</p><br/><p>That this was only occurring inside his mind.</p><br/><p>A phenomenon caused after he activated this skill and entered the other dimension.</p><br/><p>—rumble!—</p><br/><p>The land around Hansoo broke down and a giant hole appeared.</p><br/><p>—thud!—</p><br/><p>A giant hand rose up, grabbed Hansoo and dragged him down.</p><br/><p>A tremendous strength that no existence could resist.</p><br/><p>But Hansoo did not resist as he let it drag him down.</p><br/><p>And soon—</p><br/><p>—Hansoo arrived at a dark space.</p><br/><p>Like an underground cave but with a spacious area.</p><br/><p>It was clear.</p><br/><p>That this wasn’t Angkara’s underground area.</p><br/><p>No creature like this had lived under Angkara.</p><br/><p>—rumble—</p><br/><p>Behind the giant hand that dragged Hansoo down.</p><br/><p>The existence belonging to that hand could be seen.</p><br/><p>An existence so large that it treated those giant Haetaras as nothing more than bugs.</p><br/><p>A spider-like body with eight arms and eight legs.</p><br/><p>The thousands of eyes on its head glowed with a red light as it watched Hansoo in the darkness.</p><br/><p>And it wasn’t just one spider next to Hansoo.</p><br/><p>—whooosh!—</p><br/><p>It was dark but because there were flames emitting a little bit of light, it told Hansoo that there were many more of them.</p><br/><p>Thirteen existences that had completely different auras.</p><br/><p>Of course, they all had different appearances as well.</p><br/><p>Some were even larger than the spider and some were only as big as Hansoo.</p><br/><p>One glowing with a white light and one had a horn embedded in its forehead.</p><br/><p>But they all had some similarities as well.</p><br/><p>One had a terrifying amount of rage surrounding its body.</p><br/><p>While another was unfathomably powerful.</p><br/><p>As Hansoo descended from the spider’s hand.</p><br/><p>The thirteen existences started to argue with each other.</p><br/><p>The one who started it was the spider that had dragged Hansoo down.</p><br/><p>But even before the spider finished its words…</p><br/><p>Countless angry voices filled the area.</p><br/><p>Hansoo frowned at the arguments of the thirteen existences but then pointed towards one of them.</p><br/><p>Two horns and thirteen pairs of wings.</p><br/><p>Although its size was similar to Hansoo’s, its aura didn’t lose out to the giant creatures at all.</p><br/><p>“Shut up. You. You’re coming with me.”</p><br/><p>The existence that was covered from head to toe in darkness and was laying around in a lazy manner.</p><br/><p>It was the most useful one in this situation.</p><br/><p>The moment his words rang out—</p><br/><p>&lt;...&gt;</p><br/><p>&lt;...&gt;</p><br/><p>—the loud area suddenly turned deathly quiet.</p><br/><p>The one who broke it was the man who Hansoo had chosen.</p><br/><p>There were thirteen in all.</p><br/><p>All of them had the strength to rip the world apart but this kid before their eyes could not withstand such a strength.</p><br/><p>It only made sense for him to choose someone who was the most suitable for the situation outside.</p><br/><p>As Hansoo stayed silent, the man shrugged his shoulders and said:</p><br/><p>At the man’s words—</p><br/><p>—Hansoo replied.</p><br/><p>“I know too well. Don’t worry.”</p><br/><p>He knew way too well.</p><br/><p>As to what these things were.</p><br/><p>How much strength they had.</p><br/><p>What kind of ability and personality as well.</p><br/><p>How could he not?</p><br/><p>These were beings he had shed countless drops of tears and blood to defeat in his previous life.</p><br/><p>‘Allowing me to experience my old memories, that damned fairy.’</p><br/><p>.</p><br/><p>A skill that entrapped the most powerful thirteen demons within the Abyss.</p><br/><p>In his previous life, he had to put his life on the line multiple times to defeat these things despite being countless times stronger than he was right now.</p><br/><p>The difference between his strength and theirs was no joke.</p><br/><p>Although there were side effects…</p><br/><p>That meant the strength he received was just that great.</p><br/><p>—thud!—</p><br/><p>The demon who grabbed Hansoo’s hand, Barmamunt, quickly shot up into the sky with Hansoo.</p><br/><p>……………………………………</p><br/><p>—rumble—</p><br/><p>“...What the hell is that? It’s making me feel uneasy.”</p><br/><p>As the Dragon God Soldiers looked at the darkness-covered Hansoo—</p><br/><p>—crunch—</p><br/><p>“Kuhaa…”</p><br/><p>—Hansoo’s eyes, which had turned completely black including his whites, looked around with a cold gaze.</p><br/><p>And at that moment—</p><br/><p>‘What the f***… What?’</p><br/><p>—the Dragon God Soldiers flinched as they backed up.</p><br/><p>Those weren’t the eyes that looked at an enemy.</p><br/><p>He was looking at them with joy, with love.</p><br/><p>And as they looked at those eyes…</p><br/><p>Chills ran down the backs of every single Dragon God Soldier watching him.</p><br/>\n</div>"}