{"title": "Chapter 412 Metamorphosis 4", "id": 412, "volume": 5, "url": "http://boxnovel.org/reincarnator-chapter-412-metamorphosis-4", "volume_title": "Volume 5", "body": "<h1>Chapter 412 Metamorphosis 4</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Reincarnator - Chapter 413: Metamorphosis (4)\"What the... What is going on?\"The family heads, who had basically flipped the capital upside down, were all lost in confusion.Crack!Crunch!It was only for a brief moment, when the relic's energy was released, that the monsters went berserk.Now, the seven monsters were all fusing into each other, focusing on the one that had swallowed the person that caused all this.I didn't even look like a monster anymore.The flesh and bones of the seven monsters had long started fusing into each other, as if they had been one entity from the start, turning into a more simple, but much larger, form'It's… Like a mountain.'They had fused even though they were all individually humongous to start with. This caused the result to simply resemble a large mountain.As K-Merrow Nell looked at the giant mountain that was being formed in a daze, K-Ukatan Pael shouted in frustration, \"You stupid bastard! Why are you just standing there? Aren't we gonna drag that guy and the Relic out?\"Ukatan Pael's personality was like fire, but he wasn't stupid. No, his mind spun fast enough to accommodate his personality and still allow him to lead a giant clan.Why were those giant monsters fusing in the first place?Deducing from what those things had been chasing after all this time, it was easy to find the answer.Energy.What would happen if those gluttons, who were getting stronger and stronger as they devoured more energy, decided to suck the energy from the Relic?He couldn't even imagine how much stronger they would become.As he finished this dreadful thought, dark flames started to blaze around K-Ukatan Pael's body, a power that was a-whole-nother dimension stronger than the strength he had shown so far.'Ukatan Pael… What a fox! Has he been hiding his strength?'K-Merrow Nell frowned as he looked at the small sun-like energy.\"Haaaaaaa!\"Booom!With a long shout, K-Ukatan Pael launched the giant, dark red sun that he had formed toward the giant lifeform that was almost done fusing.K-Adelaia Ron and K-Merrow Ron shouted in shock as they watched this scene, \"You stupid bastard! You're going to destroy everything around here with that!\"\"Is there anything else to be destroyed?\"As Adelaia Ron and Merrow Nell tried to stopped Ukatan Pael...Booooom!… a huge explosion swept by the area next to Neoreim, ringing out loudly, the strongest and largest explosion so far.The residual energy of the explosion was more than enough to melt the second layer and evaporate metal.\"Ahhhh….\"\"Patriarch! Why…?\"The cloud of death that was caused by the giant explosion swallowed all the living creatures that had been within its range.Even the ones outside of the explosion's range died one by one from the poisonous vaporized metals and the heat.'... Damn.'As Adelaia Ron frowned at the sight, K-Merrow Nell swept away the clouds and shook his head toward Adelaia.\"They were those who had found out about the secret beneath the capital. They had to die anyway. The real problem is that thing.\"K-Merrow Nell's eyes had been locked onto one thing the whole time.Grrrrr.Despite the giant explosion, the giant monster remained alive. Only the surface of its being had been burned off. The other parts of its flesh squirmed around and quickly mended the areas that had been damaged.\"Haa… Haa… Seriously?\"K-Ukatan Pael seemed to have exhausted himself in that attack, but gritted his teeth at the sight.Only that much damage despite his attacks? K-Ukatan Pael felt annoyed as he touched his left wrist with his right hand.'If one isn't enough… I'll show you a shower of them'He, alone, might not be enough. Even the three clan heads might not be enough to do it, but what if they gathered all their ships and attacked it for three days and three nights nonstop? If they attacked with enough force to even drive a hole through the planet, would that monster still manage to withstand them?'Yeah, that sounds good.'If they pierced the entire continent and shoved that thing into the center of the planet, there was no way that thing would be able to survive.Chiiijiiijiiik.&lt;what is=\"\" the=\"\" issue=\"\" patriarch?=\"\"&gt;From the internal communications device that was embedded in his left hand, he heard the voice of the fleet's admiral, the admiral that Ukatan Pael trusted the most, R-Paotan Pael.Ukatan Pael kept his eyes glued to the giant mountain and said, \"There's something you guys need to do. Get over here immediately and…\"But Ukatan Pael's voice cut off.Adelia Ron had appeared beside him and had grabbed his wrist.&lt;patriarch? are=\"\" you=\"\" there?=\"\"&gt;\"... What is this?\"That was clearly overstepping the boundaries.As Ukatan Pael's face stiffened, Adelia Ron looked at him with a numb expression and said, \"Wake up, you bastard! What will happen to Pompeion if we bring them here?\"\"... Son of a.\"Ukatan Pael swore in a manner that was hard to determine whether it had been targeted at Pompeion or Adelaia Ron, but then, he took a step back.He agreed with Adelaia Ron.Ukatan Pael took a deep breath and said, \"Right. Let's say we don't have the freedom to destroy that thing. But, are we going to keep that thing alive like that?\"It was already that powerful before consuming the Relic's power. If it sucked the energy of the Relic and got even more powerful, there would truly be no more solutions then.&lt;don't worry=\"\" about=\"\" that.=\"\"&gt;\"Woah! I wondered where you had gone off to, but it seems you are still alive!\"&lt;it's not=\"\" time=\"\" for=\"\" me=\"\" to=\"\" act=\"\" yet.=\"\"&gt;\"Sure.\"K-Merrow Nell continued to speak sarcastically at the voice. He really disliked that fellow, but there was nothing he could do since they really needed the help.The three clan heads looked at each other with a frown as their eyes moved downward, toward the man who had spoken to them.From the distance, Kiriel, who had been watching the whole scene, bit her lips.'I mean, I managed to escape using the chaos, but…'&lt;leave first.=\"\" i'll=\"\" come=\"\" find=\"\" you.=\"\"&gt;She understood Hansoo's plan to gather power beneath them, which meant she needed to prepare as well, as much as she could.'Please, remember me.'Kiriel disappeared by use of her Cloudy Movements..............Rumble!Two different forces were acting upon Hansoo's body. One, from the massive Relic energy rising from within him, and the other was the dozens of tentacles from the Haetara, which had surrounded him in order to suck the energy away.The tentacles wanted to rip Hansoo's body apart and suck the energy directly from the Relic, but they realized it wouldn't be as easy as planned. It was too hard for them to simply break him apart.Despite having squeezed, pressed and crushed him in numerous ways, nothing happened. Actually, things had happened, but the bastard had held on the whole time. It was a battle of time now.The energy seeping out from him was too sweet for it to give up. How great would it be if it could suck the energy directly?GrrrrkThe Haetara continued to suck the energy and try to crush Hansoo's body, and to prevent that, all skills and even the seeds within Hansoo's body kept struggling.The Demonic Dragon's Reinforcement made a impregnable wall, while the Nine Dragons Strike's seed twisted Hansoo's body in the manner that would be most efficient in dealing with the tentacles' attacks.There was nothing to speak of the Immortal's soul as even the Pandemic Blade was working in order to help the body regenerate. Of course, the skill that was working the hardest was the Demon's Gate.&lt;no, no.=\"\" this=\"\" won't=\"\" do.=\"\" i=\"\" haven't=\"\" received=\"\" my=\"\" payment=\"\" yet.=\"\"&gt;&lt;you cannot=\"\" just=\"\" die=\"\" like=\"\" this.=\"\"&gt;&lt;... survival.=\"\" important.=\"\"&gt;Rumble!The Thirteen Shadows continuously struggled to regenerate Hansoo's body and resist the pressure. The dark and evil power from the Thirteen Demons was unfittingly working to keep a body alive.Kakakaka!&lt;damn, this=\"\" is=\"\" tiring.=\"\"&gt;&lt;should we=\"\" just=\"\" let=\"\" him=\"\" die?=\"\"&gt;As the shadows of the demons complained, one of them chuckled coldly and whispered in Hansoo's ear.&lt;isn't this=\"\" amazing?=\"\" for=\"\" us=\"\" to=\"\" be=\"\" doing=\"\" something=\"\" like=\"\" this.=\"\" if=\"\" you=\"\" truly=\"\" came=\"\" from=\"\" the=\"\" future,=\"\" you=\"\" would=\"\" know=\"\" what=\"\" we=\"\" are.=\"\"&gt;There was no response. Hansoo had basically reached near unconsciousness from all the different forces wreaking havoc within his body.Nonetheless, the demon Barmamunt continued to whisper.&lt;this is=\"\" how=\"\" much=\"\" hope=\"\" we=\"\" have=\"\" on=\"\" you.=\"\" we=\"\" don't=\"\" know=\"\" what=\"\" will=\"\" disappear=\"\" from=\"\" your=\"\" memories=\"\" but=\"\" we=\"\" really=\"\" expect=\"\" a=\"\" lot=\"\" from=\"\" you.=\"\" we=\"\" will=\"\" do=\"\" whatever=\"\" it=\"\" takes=\"\" to=\"\" keep=\"\" you=\"\" alive=\"\" and=\"\" get=\"\" you=\"\" out=\"\" of=\"\" here.=\"\"&gt;By the time the kid escaped, he would be a different existence, both in terms of his physical body and of his mind. He would be closer to them, an existence that would enjoy the screams of creatures getting their flesh ripped apart and their bones crushed.And when that happened, they would be able to have more fun than ever before.&lt;so, hold=\"\" on.=\"\"&gt;If not, all that effort would be a waste.Kadadak.Kuduk.Barmamunt frowned as he looked at Hansoo, who was going through a massive change.'I can't understand this boy… Why are you smiling?'Even while going through the change, even while unconscious, Hansoo was smiling.That made Barmamunt very uncomfortable.&lt;/so,&gt;&lt;/this&gt;&lt;/isn't&gt;&lt;/should&gt;&lt;/damn,&gt;&lt;/...&gt;&lt;/you&gt;&lt;/no,&gt;&lt;/leave&gt;&lt;/it's&gt;&lt;/don't&gt;&lt;/patriarch?&gt;&lt;/what&gt;</p><br/>\n</div>"}