{"title": "Chapter 429 Transition 6", "id": 429, "volume": 5, "url": "http://boxnovel.org/reincarnator-chapter-429-transition-6", "volume_title": "Volume 5", "body": "<h1>Chapter 429 Transition 6</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 426: Transition (6)</p><br/><p>Translator: Ares</p><br/><p>Editor Group: Liber Reverie</p><br/><p>Ruuuumble!</p><br/><p>Seeing the blue sphere continually being pushed downward, K-Merrow Nell coldly laughed.</p><br/><p>'Both of you die.'</p><br/><p>It was good if they died while fighting, or if both of them were both wedged down there as well.</p><br/><p>What was important was for the variables before him to disappear. If that occurred, then he wouldn't need the Relics since they could just use their remaining forces to deal with Pompeion, likewise to his remaining ships with constant raids.</p><br/><p>'I want to deal with the other two clan heads, but… Oh well.'</p><br/><p>K-Merrow Nell smacked his lips .</p><br/><p>For now, he needed to deal with the two men that were most threatening, and if he were able to deal with Pompeion afterward, he'd be more than satisfied.</p><br/><p>In the process, if the other two heads died, it would be the best outcome.</p><br/><p>However, they needed to temporarily uphold the alliance until then.</p><br/><p>As K-Merrow Nell and the other clan heads slowly conserved their strength…</p><br/><p>… Pompeion's cold voice rang out.</p><br/><p>However, the clan heads didn't even flinch that they were caught.</p><br/><p>No, rather the opposite.</p><br/><p>[I'm not sure what you're talking about. Stop annoying me! It's already hard enough!] Ukatan Pael's voice reverberated through the voice communicator.</p><br/><p>It was as if they were complaining why he was picking on them when they were doing so well.</p><br/><p>Soon, another voice echoed through the voice com.</p><br/><p>[I don't know about you, but we have already expended a lot of our energy to fight that dumb beast for the past few days. Though you were probably unaware since you were in the dark.]</p><br/><p>Adelaia Ron's sharp voice roared toward Pompeion.</p><br/><p>It was a good excuse.</p><br/><p>'Good. Good.'</p><br/><p>After hearing the other two clan heads reply through the voice com, K-Merrow Nell spoke, \"Damn… don't get everyone so agitated… we're not as strong as you… we are doing our best!\"</p><br/><p>Booooooooom!</p><br/><p>K-Merrow Nell, pretending to have expended all his strength, answered through the voice com in a fatigued voice. Of course, he was still slowly lowering his total output of energy.</p><br/><p>No, it was better to say that he was acting hard instead.</p><br/><p>'And what will you do even if you notice!?'</p><br/><p>Pompeion would be unable to act since he needed the clan heads' strength to push the man down.</p><br/><p>However, Pompeion's actions were even more shocking than theirs.</p><br/><p>[Is that so? Oh well. I understand.] Pompeion said in the voice comm…</p><br/><p>Then</p><br/><p>Kiiiiiiiiiiiiiing!</p><br/><p>'Pompeion stopped attacking immediately.</p><br/><p>[You crazy bastard! W-What are you doing!]</p><br/><p>[Are you out of your mind?]</p><br/><p>Pompeion scoffed at the shocked voices of the clan heads and continued to send out commands.</p><br/><p>[All ships stop your attacks. Be on standby and save your energy in case the Neropa Union attacks.]</p><br/><p>Though this sudden order was absurd, the whole fleet under Pompeion's command stopped attacking.</p><br/><p>Ooooooooooong.</p><br/><p>Suddenly, half of the attacks that had rushed into the hole stopped.</p><br/><p>\"You crazy bastard! You're out…\"</p><br/><p>Pompeion's actions were more than enough to make K-Merrow Nell snap, but before he could finish his words…</p><br/><p>Booooooooom!</p><br/><p>… A vicious aura rose up from below like an ascending dragon.</p><br/><p>From that enormous rush of momentum, K-Merrow Nell was taken aback as he dodged backward.</p><br/><p>Booooooooom!</p><br/><p>A giant beam of light scraped by K-Merrow Nell's body and shot upward. Though he was able to barely avoid the attack, the ships above him were not as lucky due to their immobility.</p><br/><p>[!!!]</p><br/><p>[!!!!]</p><br/><p>The shield that protected the first line of defense were all useless as the beam had more than enough power to shred K-Merrow Nell's shield apart just from scraping by.</p><br/><p>Boooooooooom!</p><br/><p>In that moment, three ships above K-Merrow Nell blew up just like that.</p><br/><p>[Bastard! He's attacking us now since you stopped!]</p><br/><p>[Give the order immediately to start the attack!]</p><br/><p>The clan heads shouted as they were at a loss.</p><br/><p>Even one of the ships that were swept away was one of Pompeion's.</p><br/><p>This was basically an action of a lunatic.</p><br/><p>'This…damn!'</p><br/><p>Booooooooom!</p><br/><p>Terrified from the fierce pillars of light that shot upward, the clan heads began to pour all the strength that they had conserved and began to fire down below.</p><br/><p>Otherwise, they were really going to lose everything from Pompeion's sudden ceasefire.</p><br/><p>If they were rational, they would not do this since it was no different from them giving up first.</p><br/><p>However, from Pompeion's sudden action as well as the threat of the soaring pillars of light beams from below, it was enough to force their hands.</p><br/><p>'Damn! Not like this!'</p><br/><p>At this rate, one of two things would happen.</p><br/><p>It was either Pompeion and the others would die in the man's hands, or they would be surgically removed by Pompeion from their energy-exhausted states.</p><br/><p>The plan that they had thoroughly schemed for themselves was being used against them.</p><br/><p>'You bastard! Let's see who dies first!'</p><br/><p>If the end result was their own death, then they had nothing to fear.</p><br/><p>K-Merrow Nell recovered his sanity and tried to stop attacking, but Pompeion was one step ahead once again.</p><br/><p>[Start firing! All ships except the eleventh and thirteenth fleet, use all of your force!]</p><br/><p>Boooooooooom!</p><br/><p>As Pompeion sent out his orders, the attacks from above resumed, and simultaneously, the tremendous amount of energy exploded from Pompeion's body and headed below.</p><br/><p>Booooooooooom!</p><br/><p>The situation returned to its original state once more, and K-Merrow Nell realized that he would be unable to halt his attacks anymore.</p><br/><p>'That bastard… he's only attacking at the same output as us!'</p><br/><p>The actions of Pompeion's and his ships were replicating their own.</p><br/><p>[Don't try anything foolish.]</p><br/><p>Pompeion's actions and words were enough to relay a warning to the three clan heads under the current circumstances, and while it didn't produce the optimal result, unfortunately, everyone was able to make rational judgments henceforth due to fear and anger.</p><br/><p>[Crazy bastard! You think you're the only one capable of doing that?] Ukatan Pael's rage reverberated through the voice comm.</p><br/><p>This was not the most optimal result, but that was not what was important.</p><br/><p>The important aspect was control.</p><br/><p>In such a strange situation, anyone who took the initiative to break this delicate balance could kill their opponents at any time like a fox.</p><br/><p>It was the reason why Ukatan Pael could do something irrational just like Pompeion had just done since he would get killed by him at any moment if he lost the upper hand.</p><br/><p>If he was the one who was going to die anyway, it would be better if everyone died.</p><br/><p>Ukatan Pael stopped attacking completely and began to prepare an attack on Pompeion. He was unable to live with the fact that Pompeion's actions decided their fates.</p><br/><p>'That…that crazy bastard!'</p><br/><p>K-Merrow Nell freaked out. He was angry as well, but at this rate, they would all perish if they fought in this situation. Their attacks against the man would stop, which would soon lead to them all being killed by the alien's attack.</p><br/><p>\"Ukatan Pael! Come to your senses…\"</p><br/><p>K-Merrow Nell was beaten to the punch once more.</p><br/><p>[Let me propose an offer that you cannot deny.]</p><br/><p>'…?'</p><br/><p>Ukatan Pael stopped at Pompeion's sudden words.</p><br/><p>Booooooooooooom!</p><br/><p>'A failure.'</p><br/><p>The man looked at the ever-powerful attacks descending from above and closed his eyes. He had anticipated that they would kill each other in internal strife, but it seemed that something had allowed them to be unified.</p><br/><p>The attacks became even stronger, causing him who was half focused on his defenses be shoved down toward the Red Jade.</p><br/><p>'How laughable. The last ray of hope will be destroyed by our own technology.'</p><br/><p>But, the man decided to accept his fate.</p><br/><p>He had truly done everything in his power. After all, he had woken up alone and struggled against two races by himself.</p><br/><p>'I was tired…so this is good.'</p><br/><p>In fact, it shouldn't be possible for a man to have such a cheerful look in this kind of predicament.</p><br/><p>His failure would mean the extinction of his race. But, it was all okay now.</p><br/><p>The seeds he sowed into the ground were still there, and even if those seeds failed to sprout, their savior remained.</p><br/><p>'I don't know where you are or what you're doing, but please take care of our race from now forth.'</p><br/><p>The man thought of the human bodies and closed his eyes.</p><br/><p>Kakaka!</p><br/><p>Crack!</p><br/><p>The powerful barrier was slowly cracking due to the attacks from above, and the heat from the Red Jade from below was becoming intense. Holding on for such a long time was a feat itself.</p><br/><p>Above his head…</p><br/><p>Boooooom!</p><br/><p>Hansoo's attacks continuously smashed against the blue sphere as if Hansoo was trying to reduce the man to nothingness.</p><br/><p>At that moment, he was enlightened.</p><br/><p>The man's closed eyes blinked.</p><br/><p>He thought of one last thing he needed to do.</p><br/><p>'I will help you.'</p><br/><p>The man glared into Hansoo full of anger.</p><br/><p>He had pushed himself to this stage. So, it was his duty to ensure that he died a hero on the battlefield.</p><br/><p>While he was muttering to himself internally...</p><br/><p>Booooooooom!</p><br/><p>All the energy used for defense was converted into an attack, sweeping away the dark red sphere around Hansoo.</p><br/><p>Though the attacks from above and the heat from below penetrated into his body, melting him away, he smiled. He had witnessed his own attack successfully destroying the red sphere.</p><br/><p>Hansoo would soon melt following him.</p><br/><p>But then…</p><br/><p>Craaaack!</p><br/><p>He was able to notice something cutting space appear behind Hansoo's body.</p><br/><p>'Dammi…'</p><br/><p>With that being his final thought…</p><br/><p>Ssssss….</p><br/><p>The man's body melted away.</p><br/>\n</div>"}