{"title": "Chapter 436 Desire Tree 1", "id": 436, "volume": 5, "url": "http://boxnovel.org/reincarnator-chapter-436-desire-tree-1", "volume_title": "Volume 5", "body": "<h1>Chapter 436 Desire Tree 1</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Translator: Ares</p><br/><p>Editor: Underclass Hero</p><br/><p>Ruuuuumble!</p><br/><p>The elevator began to slowly open as Hansoo walked out.</p><br/><p>The Seventh Zone of the OtherWorld.</p><br/><p>The Violet Zone.</p><br/><p>This was the last region where the surviving human race came face to face against the Abyss.</p><br/><p>The environment here was so beautiful that it did not match the name of the zone.</p><br/><p>It was like a resort one would go on vacation to.</p><br/><p>On a closer look, it seemed that he had thought the same in his previous life.</p><br/><p>There was no mistake that it was the last Utopia that was granted to those who had worked hard to ascend.</p><br/><p>This was maybe the reason why the survivors that had ascended up to this point fought amongst themselves harder under internal strife, for this was the place that they had to live in.</p><br/><p>It was clear that the ownership and authority of this heaven was priceless.</p><br/><p>'It was worth dying for.'</p><br/><p>It was careless enough to not be cautious, but for them to have even raised internal strife?</p><br/><p>It was a pity since even if they had united all of their strength, it might still be lacking against the Abyss. Seeing the event that swept them away, it might have just been karma.</p><br/><p>Recollecting that event, Hansoo clicked his tongue as he looked around his surroundings.</p><br/><p>'Well… At least I'm much better off than before.'</p><br/><p>Vaccines were definitely viruses, but they help develop immunity to diseases.</p><br/><p>The same goes for opening the Abyss as well.</p><br/><p>Though mankind had to face enemies they could never imagine of interacting, after facing them, they were able to succeed in managing some tricks and strategies to oppose these fiends.</p><br/><p>It was the same mankind that had boasted an overwhelming number of Transcendents, as well as strengthened Adventurers by eating away the crystals.</p><br/><p>Of course, they would not be beaten so easily and swept away as soon as the Abyss had opened.</p><br/><p>No, it was truer that the Abyss had allowed them to reach the stage where they were now.</p><br/><p>It now depended on the abilities of Mihee and Sangjin, who were coordinating the people below, but as long as they could unite the powerful Transcendents and Adventurers into one, and if they were fully prepared on the seventh floor, then it was possible that they could easily reach the third floor of the Abyss, unlike the past where they were all cut down mercilessly by those species of the first floor. </p><br/><p>'Well, that doesn't matter.'</p><br/><p>Hansoo sighed as he walked outside the elevator.</p><br/><p>Literally, it didn't mean anything.</p><br/><p>Even if they reached the third floor easily, the monsters of the 4th, 5th and 6th floor would eventually collide with them. The great size of the species of the Abyss meant that there were things that many other species desired.</p><br/><p>The devils loved the souls of humans, and insects covet the human bodies to become their hosts.</p><br/><p>The Dragon species loved cultivating them as their slaves, and the highly civilized species like the Neropa would surely use them for experimentation and refine themselves. </p><br/><p>Even if they were strong, they were just a new species that had appeared in the Abyss that had billions of species. </p><br/><p>It was clear that they would be nothing more than mouthwatering prey.</p><br/><p>Therefore, it was much nicer to work alone.</p><br/><p>It was easier to hide, and there were fewer enemies that rushed toward him as well.</p><br/><p>The advantages were that he was able to monopolize the goods and run away if needed.</p><br/><p>'Well… That would be kind of boring.'</p><br/><p>Hansoo suddenly smiled as he thought of the two people he had left behind.</p><br/><p>Boredom…</p><br/><p>Once the Abyss opened, he would never be bored.</p><br/><p>He would be busy busting the brains out of those that would bust his.</p><br/><p>It was a right to be bored.</p><br/><p>In order to enjoy this leisure, Hansoo looked at the bird flying away from his hand and smiled.</p><br/><p>Chiiiirp!</p><br/><p>A cute-looking, blue bird sat on Hansoo's head before crying and flying away. It soon sat on Hansoo's extended hand.</p><br/><p>Stroking the fearless bird in his hand, he whistled and looked around.</p><br/><p>'There's no one. I was wondering if there would be some that would attack me.'</p><br/><p>From what he knew, this place was the territory wholly controlled by Clementine.</p><br/><p>Though Sangjin and Mihee had succeeded in ascending to the Sixth Zone, they would eventually fail trying to reach the Seventh Zone.</p><br/><p>This was because all of the forces of Clementine had already passed through Zone 6 and ascended.</p><br/><p>'Well. It's one or the other.'</p><br/><p>From his thoughts, there were only two reasons why they would do so.</p><br/><p>First, it was burdensome to manage the Sixth Zone.</p><br/><p>Second, they wanted to put their whole attention onto the Seventh Zone.</p><br/><p>'Well, I'm not sure… But let's go find out.'</p><br/><p>Hansoo checked his body and mumbled. He had a lot of things to do.</p><br/><p>First, he had to become a fully 5-Star Transcendent, which was very close, and he needed to understand what kind of schemes were being plotted by the person that had caused all sorts of problems in the lower zones.</p><br/><p>He didn't have any clues, which made it all the more dangerous.</p><br/><p>'But, even though it's quiet, it is way too quiet. Could it be that they have no interest on this side?'</p><br/><p>It was then when he muttered internally.</p><br/><p>Boooooooooooom!</p><br/><p>Boom!</p><br/><p>From a distance far away, a large explosion began to tremble throughout the huge forest.</p><br/><p>It was a distance of about 100km, but Hansoo's hearing was too advanced to miss such a noise, not to mention it was very loud, to begin with.</p><br/><p>Hansoo couldn't help but be puzzled by that large collision against the trees.</p><br/><p>'If this place was Clementine's domain, there's no way such a sound could transpire.'</p><br/><p>There were signs of humans fighting in the air.</p><br/><p>These violent ripples of skills could not occur if a person was fighting the monsters of the Abyss.</p><br/><p>In other words, two different groups with different goals were fighting one another, and the skills that clashed each other caused these violent tremors. </p><br/><p>Therefore, if they were on the same side, such a battle could not happen.</p><br/><p>'I should go take a look and see how the situation is unfolding here in this zone.'</p><br/><p>He began to recollect the scene when the moment the elevator opened into the Seventh Zone, the beasts of the Abyss rushed toward the Transcendents.</p><br/><p>It was clear that it was different from the past.</p><br/><p>Hansoo quickly threw his body toward the source of the explosion.</p><br/><p>---</p><br/><p>In the vast forest of the cluster of huge trees that seemed to be over 100 meters tall, there was a huge tree that looked to be several hundred times larger than the others.</p><br/><p>No, it looked more like a mountain than a tree. From how the height reached into kilometers, it was fair to see it as a mountain. </p><br/><p>Though it was not as grand as the World Tree of the First Zone, the size was of grand magnitude.</p><br/><p>In the surroundings of that tree…</p><br/><p>Boooooooooooooom!</p><br/><p>Boom!</p><br/><p>Hundreds of humans were fighting on two fronts.</p><br/><p>They were separated into two sides: those fighting alongside the tree and those attacking it.</p><br/><p>Both sides were desperately defending and attacking, but it seemed that those fighting alongside the tree had the advantage.</p><br/><p>'This... You damn bastards!'</p><br/><p>\"You bastards! Let's use it together! Why are you the only ones that are monopolizing that?\"</p><br/><p>The Transcendent, Karl Akus, shouted toward them.</p><br/><p>From those words…</p><br/><p>Boooooooooooom!</p><br/><p>Hosang, who was one of the ones fighting alongside the trees, laughed and spoke, \"What can we do? There's a limit to how many can be made out of this.\"</p><br/><p>Then, he put his attention onto the tree.</p><br/><p>At that moment...</p><br/><p>Tremble!</p><br/><p>The surface of the tree trembled as if it was one with Hosang.</p><br/><p>Soon…</p><br/><p>Tremble!</p><br/><p>A seed the size of a palm fell from the sky into Hosang's hand who smiled and opened his mouth.</p><br/><p>\"This is it. What I desired came to me.\"</p><br/><p>Simultaneously…</p><br/><p>Agzac.</p><br/><p>Hosang sneered with a grin toward Karl Akus as he bit into the seed in his hand.</p><br/><p>Then, a strange thing began to happen.</p><br/><p>The wounds that were borne from fighting against Karl Akus began to suddenly heal.</p><br/><p>It wasn't just that.</p><br/><p>Ruuuuuuumble!</p><br/><p>Hosang's exhausted mana shot up and regenerated.</p><br/><p>This unknown energy that surrounded Hosang's body allowed him to wield strength that he normally could never wield.</p><br/><p>And seeing this for the first time, Karl Akus gnashed his teeth.</p><br/><p>'Damn…'</p><br/><p>The reason why they were losing in this fight was because of that.</p><br/><p>In truth, there wasn't that much of a gap in skill compared to them.</p><br/><p>No, it looked like they were better than the other side in skill and ability.</p><br/><p>However, there was no way for their attacks to pierce the incredible healing power and attack boost of those seeds. </p><br/><p>'Damn… I should have followed Eres.'</p><br/><p>Karl Akus gave a look of despair.</p><br/><p>---</p><br/><p>Ruuuuuuumble!</p><br/><p>Eres had a frustrated expression as she carefully looked for an entrance that would lead them below.</p><br/><p>'... Was it right to leave him?'</p><br/><p>No matter how much she respected free will, it still bothered her to leave them all behind since all of them had accompanied her… from the start.</p><br/><p>They were all soldiers that had been with her ever since she had entered the Abyss, and they have acted together ever since.</p><br/><p>Although many of them had died on the way up, the number was still quite significant since they united as a group.</p><br/><p>However, after reaching the final zone, that group had broken up.</p><br/><p>There were those that insisted on adventuring deep into the large forest, while there were others that emphasized on not entering the forest and remaining around the serene, green areas.</p><br/><p>It was then...</p><br/><p>\"You seem to be thinking a lot, Eres.\"</p><br/><p>\"Ah… Taehee.\"</p><br/><p>Eres greeted the woman that was walking toward her.</p><br/><p>'... Why is it so difficult to be friendly with this person?'</p><br/><p>Eres muttered internally, but as if Taehee knew what Eres was thinking about from her expression, she spoke, \"Are you thinking about the other survivors?\"</p><br/><p>\"...\"</p><br/><p>Eres slightly frowned, causing Taehee to reply to her with an expressionless face, \"They did not leave for peace. They had decided to leave because of their own desires, which was why they decided to remain behind. Don't bother with them.\"</p><br/><p>From Taehee's words, Eres nodded with a heavy heart.</p><br/><p>---</p><br/><p>'That's right. Besides Clementine's men… there were others.'</p><br/><p>Hansoo mumbled as he saw the group fighting for that tree.</p><br/><p>From the looks of it, he could guess who had attacked first.</p><br/><p>It was the first generation of the group that ascended with Eres.</p><br/><p>If Clementine was still pretending to be good in front of Eres, then even those couldn't be made into his own men.</p><br/><p>Although it might be possible to sift those below her and convert them into his own, it was impossible to attempt to make his own men that were ascending together with him.</p><br/><p>If that was the case, then he understood why those guys had split up and were fighting so arduously.</p><br/><p>One more thing…</p><br/><p>He knew why they were fighting.</p><br/><p>'That's right. There was that.'</p><br/><p>Hansoo muttered as he looked at the large tree far away.</p><br/><p>They were fighting so bloodily, all for 'Desire.'</p><br/><p>That was the name of the tree over there.</p><br/><p>It was the ultimate tree that could create whatever the user desired.</p><br/><p>It was a strange creature where heaven could literally be built around it because it could satisfy all desires. </p><br/><p>'Well, I think they are using it properly.'</p><br/><p>Hansoo mumbled as he dimly saw the silhouette of a woman in the tree far off.</p><br/>\n</div>"}