{"title": "Chapter 435 Final Zone 4", "id": 435, "volume": 5, "url": "http://boxnovel.org/reincarnator-chapter-435-final-zone-4", "volume_title": "Volume 5", "body": "<h1>Chapter 435 Final Zone 4</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Translator: Ares</p><br/><p>Editor: UnderClass Hero</p><br/><p>Kureeeeung!</p><br/><p>Zone 6.</p><br/><p>There were countless Adventureres wearing the Dragon God Armor all around him. </p><br/><p>Boooooooom!</p><br/><p>Whenever Mihee swung the spear in her heart, the Adventurers flinched and subconsciously stepped back.</p><br/><p>But, that was only temporary.</p><br/><p>Siiiiiiiiiiiij!</p><br/><p>The seed of Karakal that was prepared soon overcame their bodies, creating the Dragon God Armor.</p><br/><p>\"Ohhhhhhh…\"</p><br/><p>\"Wow.\"</p><br/><p>This was a process that was being carried out so straightforwardly.</p><br/><p>In fact, there was no reason for her to swing the spear like that.</p><br/><p>It was due to her lack of control and proficiency that she was doing it like this. If she were to wield the spear and gain more proficiency, she would be able to do thousands to tens of thousands at a time.</p><br/><p>That was the real power that the Relic held, the authority that it granted.</p><br/><p>Hansoo, who was looking at the Dragon God Armors in front of him, became lost in his thoughts.</p><br/><p>'... Someone had built this foundation, but I am not aware.'</p><br/><p>Despite being unaware, the method for the solution was simple.</p><br/><p>First, he needed to investigate.</p><br/><p>Hansoo himself hated being ignorant of something more than anything, for what could be worse than not knowing what could potentially threaten his life.</p><br/><p>Not only that, it would be strange if he were to ignore this blatant suspicion.</p><br/><p>This was the Abyss that he had to live in.</p><br/><p>And before this, he also needed to complete the duties he was responsible for in the Otherworld.</p><br/><p>Completing his thought, he spoke to Mihee, \"Like I previously mentioned, I'm going. Take care.\"</p><br/><p>\"...\"</p><br/><p>Mihee, who was busy working, suddenly clenched her teeth.</p><br/><p>She was not surprised since Hansoo had already told her through the voice com after opening the box that said 'Gift'.</p><br/><p>So, Hansoo shrugged his shoulders to Mihee.</p><br/><p>\"You go your own way. I will ascend. You need to do what you have to do here.\"</p><br/><p>Then, Mihee narrowed her eyes and spoke, \"Let's go together…\"</p><br/><p>\"Really?\"</p><br/><p>Mihee flinched at Hansoo's reply, causing him to chuckle.</p><br/><p>\"You know, I have to broadly arrange things here before ascending. There are a bunch ascending from below, you know?\"</p><br/><p>Hansoo pointed to Eliot, who was full of energy, as he spoke.</p><br/><p>The gap between the Transcendents and the Adventurers was monumental.</p><br/><p>However, even if they were Transcendents, if the Adventurers were as well equipped as this, then the story would be different. </p><br/><p>'... It would be massive if this kind of force were to gather.'</p><br/><p>Hansoo seemed to have partly understood his past sentiment of becoming stronger even after he breached the Abyss.</p><br/><p>Aside from the Transcendents, if there were millions or billions of people that followed, then the force would be monumental.</p><br/><p>Even more so considering the number of Transcendents that were being made from the Adventurers as well.</p><br/><p>In addition, it wouldn't take long to ascend up there.</p><br/><p>Currently, from Zone 1 to 4, 5 and 6, they would be able to quickly progress.</p><br/><p>Though it might take some time to be reborn as a Transcendent, since the path was cleared, there really was no reason for the Adventurers to take as long in ascending. </p><br/><p>Furthermore, if they were equipped with the tools and weapons like Eliot and be united, they would prove to become a powerful army.</p><br/><p>'Unite… Well, that one spear is more than enough.'</p><br/><p>That one spear was all they needed to unite Zone 6, including all of Karakal and Nelkipa.</p><br/><p>Then, the problem was simple.</p><br/><p>All they needed to deal with was Clementine's forces above.</p><br/><p>If they were able to wait a bit longer, they could bring an army that could challenge them, so there was no reason for them to rush their units.</p><br/><p>However, Kiriel was retorting to Hansoo's remarks on the side.</p><br/><p>\"... That's the same for you, Hansoo. Why are you going alone?\"</p><br/><p>It seemed like she was quite infuriated that he was going up without her.</p><br/><p>Hansoo grinned.</p><br/><p>\"It's comfortable by myself.\"</p><br/><p>\"...\"</p><br/><p>Before Kiriel was able to complain, Hansoo opened his mouth once more.</p><br/><p>\"It was the same as this time. To be honest, if I was alone, I wouldn't have even gone inside to begin with.\"</p><br/><p>When united, people couldn't help but overestimate their own power.</p><br/><p>It would be difficult to judge the situation at hand in a cool-headed manner.</p><br/><p>Though his life was rescued in the hands of these people, the reason why he had gone in there in the first place was because of them.</p><br/><p>So, before Kiriel was able to retort.</p><br/><p>Flash.</p><br/><p>Sangjin appeared in front of Kiriel while nodding.</p><br/><p>\"Just let him go.\"</p><br/><p>\"... Eek.\"</p><br/><p>Kiriel frowned after seeing Sangjin.</p><br/><p>After searching for him for so long, for him to be able to give him up so easily.</p><br/><p>Then, turning his back, he looked at Hansoo with heavy eyes and spoke, \"Goodbye.\"</p><br/><p>\"Alright. Well… Let's never see each other again.\"</p><br/><p>That being his final words, he stepped into the elevator.</p><br/><p>Soon...</p><br/><p>Ruuuuuuumble!</p><br/><p>The elevator roared as it began to ascend with Hansoo.</p><br/><p>Sangjin, who was monitoring this entire scene, mumbled quietly, \"No. We will see each other again.\"</p><br/><p>Sangjin, who had replied to Hansoo's words, watched the whole scene transpire with a heavy heart.</p><br/><p>---</p><br/><p>Kiiiiiiiing!</p><br/><p>'Tch.'</p><br/><p>Hanso clicked his tongue from this strange, awry feeling and shook his head.</p><br/><p>He was unaware who that guy was before he had lost his memories, but if he were to leave like this, it would be too unsatisfying.</p><br/><p>He was already feeling very salty from seeing someone who he wasn't close with die already.</p><br/><p>However, what would happen if he were to become somewhat attached with these people, just for them to die later?</p><br/><p>Hansoo had faith in his own actions.</p><br/><p>He believed that the way he had lived so far was the best way to survive.</p><br/><p>This could be because he was really good at fighting and being strong.</p><br/><p>On the other hand, these other guys could become baggage with the possibility of betrayal being high. If the Abyss was an environment where they could become friends and laugh and play, then maybe they could be together. However, through Hansoo's life of hardships, he was able to witness how cruel and weak humans could be. </p><br/><p>At least, that was what he remembered.</p><br/><p>Though meandering around the Abyss alone wouldn't bring him too much satisfaction, but regardless of joy, he had to first live on.</p><br/><p>Though he had survived up to now because of ability and luck, he had no intention of abandoning life, nor would he allow it to be threatened by taking steps to his demise.</p><br/><p>'Truly… This is truly funny. When he was on the verge of death, it seemed fine… And yet when he's alive, being alive also seems to be a viable option as well.'</p><br/><p>Hansoo smiled at his own selfishness before raising the shield in his hand.</p><br/><p>To be honest, they could have gone together since those guys were not at the standard of mere baggage.</p><br/><p>However, there was another reason which was more important.</p><br/><p>'Is this truly mine?'</p><br/><p>Hansoo looked at the skill and item he obtained as he mumbled.</p><br/><p>After this particularly difficult event, he had received two rewards as if it proved to confirm that this zone was at a much higher difficulty.</p><br/><p>Of course, having two rewards itself was not bad as long as the two did not decrease in quality.</p><br/><p>However, the reason why he had such an ambiguous expression was because he truly did not understood.</p><br/><p>'... This fairy bastard, did he give me the wrong one?'</p><br/><p>&lt;spiritual outburst=\"\"&gt;</p><br/><p>It was exactly as written. An explosion of the soul.</p><br/><p>However, the problem was separate. </p><br/><p>This did not mean that if he used this, it would destroy the soul of the opponent.</p><br/><p>If this skill was used… What would be destroyed would be his own soul in fact.</p><br/><p>Sacrifice.</p><br/><p>A self-sacrifice spell.</p><br/><p>It was a skill that gave immeasurable power to a person in exchange for making their soul explode.</p><br/><p>'I… Who would I use this in favor of someone?'</p><br/><p>Hansoo frowned.</p><br/><p>---</p><br/><p>Booooooom!</p><br/><p>The violet zone.</p><br/><p>It was a place more famous of its title, Zone Seven.</p><br/><p>Surprisingly, Zone 7 was not as desolate as the previous zones of 5 and 6.</p><br/><p>There was a spot where clear, dense sunlight rained upon.</p><br/><p>With brushes, lakes and green forests covering this large, grand continent, it looked like the garden of Eden, a great place to live in.</p><br/><p>However, as if it was to remind everyone that it was a zone of the Otherworld, a large roar reverberated through the lush, green forest.</p><br/><p>Roooooooooar!</p><br/><p>Inside the green forest, a woman with a cold smile raised her hand and smashed it straight into the ground.</p><br/><p>Simultaneously.</p><br/><p>Kuuuuuuuuung!</p><br/><p>Through the center of the struck ground, a tremble caused the whole place to begin to collapse, including the animals that were rushing in.</p><br/><p>Something in the ground began to surge up, struggling and fighting to devour the intruders that were causing a ruckus.</p><br/><p>This included all of the people hiding in this grand forest.</p><br/><p>Ruuuuuuumble!</p><br/><p>Hundreds of meters inside that radius began to disintegrate into ash.</p><br/><p>\"Eres. Don't force yourself alone since you are the weakest here. We are already ascending at a fast pace.\"</p><br/><p>\"... Keldian.\"</p><br/><p>Hearing a voice from behind, Eres paused before looking back.</p><br/><p>Eres smiled as he looked at Keldian and his group that was walking toward her before asking the man in the front.</p><br/><p>\"Whew. Since we have cleared the way… The people behind us should be able to come more comfortably I hope?\"</p><br/><p>From Eres's words, the man, Clementine, smiled and spoke, \"Well… We're not sure. We had come all the way here since we had the ability to do so.\"</p><br/><p>\"...\"</p><br/><p>From Clementine's words, Eres remained silent. </p><br/><p>As he said, it was truly difficult for themselves to reach this place. </p><br/><p>Seeing Eres without spirit, Clementine smiled and spoke, \"Cheer up. It seems like we have… finally reached our destination.\"</p><br/><p>In front of the ground that Eres had destroyed, they were able to see something brightly exposed.</p><br/><p>Whether it was the surface of some kind of structure or something else, they weren't sure, but what was a fact was that it was some part of an older civilization.</p><br/><p>'Ah… Finally,' Eres thought in admiration.</p><br/><p>They had finally reached the destination of their journey, and Eres was even able to realize one more thing.</p><br/><p>The white metal surface on top looked like it was the tip of an iceberg of something that was buried beneath the ground.</p><br/><p>With an elated expression, Eres looked back and spoke, \"It's all thanks to you.\"</p><br/><p>From those words…</p><br/><p>\"Well. It's not over… just yet.\"</p><br/><p>Clementine's lips raised into a grin.</p><br/><p>&lt;/spiritual&gt;</p><br/>\n</div>"}