{"title": "Chapter 443 Noah 5", "id": 443, "volume": 5, "url": "http://boxnovel.org/reincarnator-chapter-443-noah-5", "volume_title": "Volume 5", "body": "<h1>Chapter 443 Noah 5</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Translator: Ares</p><br/><p>Editor Group: Liber Reverie</p><br/><p>Ruuuuuumble!</p><br/><p>Rumble!</p><br/><p>\"... Okay. Let's go up now.\"</p><br/><p>Sangjin hesitated momentarily after seeing Mihee's worried expression before speaking.</p><br/><p>\"We will probably need an advance team to investigate the situation above.\"</p><br/><p>John Stone, Kiriel and Mihee both nodded. It was true that there wasn't a zone that was normal. It was common sense to at least investigate the situation above considering they had no information regarding the zone. Currently, they had one big weakness.</p><br/><p>\"Once we ascend, there's no guarantee that we can continue to unite these guys,\" Mihee mumbled seeing countless people lined up in the plains.</p><br/><p>Just as she said, the Adventurers were full of confidence after attaining their new strength.</p><br/><p>The problem was if they were to ascend with their newly found strength, they could run around and flee in excitement.</p><br/><p>If there was no problem, then they would be able to ascend and progress comfortably, but of the Otherworld they had experienced, that probability was very low. </p><br/><p>Uncontrolled forces were like double-edged swords, so it was not as good. In order to reduce this probability as much as possible, they needed to send out an advance force to start.</p><br/><p>'If Hansoo was able to properly do his job above, then maybe…'</p><br/><p>However, Mihee soon shook her head.</p><br/><p>Expectations usually lead to disappointment. If it was the Hansoo that she knew, then she would have no worries. Nevertheless, the Hansoo that ascended was a bit different. Then, Sangjin spoke briefly to Mihee, \"I will go up. I'll take some of the people.\"</p><br/><p>\"... But.\"</p><br/><p>Mihee soon lowered his head after recognizing Sangjin's heart.</p><br/><p>\"That is why I will go up.\"</p><br/><p>\"There is not much time left now,\" Sangjin muttered as he felt the fragments of Neropa's soul growing more and pulsating.</p><br/><p>---</p><br/><p>Kureeeeeeung!</p><br/><p>'Hmm. I'm a bit short.'</p><br/><p>Hansoo muttered as he destroyed the heads of these large beasts.</p><br/><p>He was relentlessly using the seeds as he continued to inject his mana into them.</p><br/><p>The ones that had the most development was definitely the Hongma Door. If he were to raise him just a bit more, he would be able to see its next stage.</p><br/><p>It was also necessary for him.</p><br/><p>\"How stiff,\" Hansoo muttered as he could feel the pulsing seed of Pandemic Blade in his heart.</p><br/><p>Pandemic Blade was by no means all-powerful. The more a person used the Pandemic Blade onto their opponents, the larger the pressure it would bring onto them.</p><br/><p>Not to mention controlling the elites, trying to control the other 4-Star Transcendents was causing him to reach his limit.</p><br/><p>Of course, there was value in that itself.</p><br/><p>'29 people.'</p><br/><p>Hansoo let out a satisfied expression seeing all of the Transcendents that were owners of the Desire Trees gathered up.</p><br/><p>If all of them were to attack him, then he would definitely lose. Though there was quite a large gap between 4-Star Transcendents, with these numbers, it was more than sufficient to overcome him.</p><br/><p>'By the way… It should be time for them to start coming up.'</p><br/><p>He was reminded of Mihee's group below after thinking about this group.</p><br/><p>Then, one of the Transcendents opened his mouth.</p><br/><p>\"... Why are we gathering these?\" The somewhat settled Dell Marcus asked Hansoo.</p><br/><p>A loss was a loss, and reality being real.</p><br/><p>Though he was infuriated of being beaten up and becoming his slave, he had to admit that the guy's ability was truly amazing.</p><br/><p>\"For him to be able to beat and capture all of them up this quickly,\" Dell Marcus murmured as he looked at his surroundings.</p><br/><p>There were some that were ambiguous in relationship with him like John Kael, and others that were supportive of him.</p><br/><p>However, all of them had something in common.</p><br/><p>They had wandered around this world in confusion for 20 years, and that they were all strong. Each one of them was a one-man army. </p><br/><p>Hansoo chuckled from those words.</p><br/><p>\"I had been thinking for a while on what to do.\"</p><br/><p>\"...?\"</p><br/><p>When everyone had questionable looks, Hansoo muttered internally, 'Ha… It is time to get rid of him.'</p><br/><p>Hansoo thought of Clementine. To be honest, there was no real reason for him to fight Clementine. The reason he had captured the people around him and made an army out of it was because he thought they would be useful, not to deal with Clementine.</p><br/><p>However, after hearing about the situation from Dell Marcus and the others, his thoughts changed a bit.</p><br/><p>After hearing that Clementine along with a few others had departed for the north from them, he was certain of one fact.</p><br/><p>Though he clearly didn't know where their destination was, they were heading toward a certain location, and in the end of that direction was where Noah was at. </p><br/><p>'You sly bastard.'</p><br/><p>Hansoo clicked his tongue.</p><br/><p>He was not sure where he had obtained that information from. He could have obtained the information from his subordinates or through hints of strangers to find the location of Noah.</p><br/><p>Nevertheless, one fact was clear.</p><br/><p>If Noah fell into the hands of Clementine and if he were to use that power to oppose him, it would cause him a large headache.</p><br/><p>On the other hand, if that power fell into his hands…?</p><br/><p>'There would be nothing to fear about. Nothing to be afraid of.'</p><br/><p>It would be much easier surviving through the Abyss, and he would be able to share that leisure with others.</p><br/><p>'Kiriel… Mihee and the others… Maybe I'll give them a ride.'</p><br/><p>For those that had saved his life, he could do that at least.</p><br/><p>If they were to ride Noah, they would be happy. After thinking all of this, Hansoo soon clicked his tongue internally once more. </p><br/><p>'... Useless thoughts again.'</p><br/><p>Hansoo swept the six seeds in his body while shaking his head before soon smiling.</p><br/><p>\"We will first head north.\"</p><br/><p>\"North?\"</p><br/><p>Everyone frowned from Hansoo's words.</p><br/><p>They instinctively knew what he was thinking after speaking such words.</p><br/><p>'Don't tell me… You're going to capture Eres, Clementine and the others?'</p><br/><p>Seeing how he had captured all of them, it could be that he had such greed, and it wasn't like they didn't understand either.</p><br/><p>King.</p><br/><p>What a sweet word it was.</p><br/><p>It was the sweet authority given to the winner who would put the losers below his feet. If one had such power, he would just go and fight with anyone.</p><br/><p>However, that itself was the problem.</p><br/><p>He had to defeat them.</p><br/><p>Hosang contemplated briefly before talking to Hansoo.</p><br/><p>\"Hey. Honestly, I know you're strong, and you definitely would have rampaged in the lower floors… However, those guys are absolute monsters.\"</p><br/><p>Even the weakest of them, Eres, was a 5-Star Transcendent.</p><br/><p>Not only that, Eres wasn't specialized in fighting as well. If all of them were able to attack Eres, they should be able to capture her eventually.</p><br/><p>That would be the extent though.</p><br/><p>There was no answer thinking of the splitting images of Kangtae and Keldian beside him.</p><br/><p>'Taehee is also one crazy bitch as well.'</p><br/><p>Hosang's body shivered with a gloomy expression.</p><br/><p>The rest also followed.</p><br/><p>\"Ugh....\"</p><br/><p>\"Ahem.\"</p><br/><p>Everyone started to cough in vain recollecting the other group members that had gone on ahead. Though everyone thought they were strong themselves, there were no answers to be made, thinking of them.</p><br/><p>In the first place, they had wanted to play the role of the King and had remained to monopolize the Desire Trees despite the large backlash. No matter how strong they were, they would always be below them. There was always some pressure trying to follow Eres's group no matter what the reasons were. </p><br/><p>Thinking up to this point, Hosang spoke at Hansoo once more, \"There's no reason to go there immediately, right? I think we can hunt here a bit more.\"</p><br/><p>\"Yes. That's right. There's no reason to go immediately. If we were to make those weird things out of your desire, we can hunt them much faster!\"</p><br/><p>The warriors around them began to raise their voices.</p><br/><p>That was right.</p><br/><p>Though they were unaware where Hansoo got the information to make those things, if he were to keep creating them, it would be too easy to hunt these unidentified species.</p><br/><p>Not only that, they would be able to gather more crystals as well. With this progress, it would only take them a month before they reached the next stage. Not only them, their subordinates would also become stronger. If that was so, everything would become simpler.</p><br/><p>Hansoo chuckled from their words.</p><br/><p>'Who will wait a month for us?'</p><br/><p>He wished that he had some more time too as well. It would be more convenient and less worrisome if he had entered the realm of 5-Star Transcendent before moving. However, no one would wait a month for him whether it was the guys pushing on ahead or the group ascending from below.</p><br/><p>It would be great if they had spent the month in futility and failed to reach their destination.</p><br/><p>Unfortunately, Hansoo always assumed the worst before he goes into action since he knew God had never lifted his hand before. </p><br/><p>In one month, it was more than enough time for Clementine to fully take out Noah and control this entire zone.</p><br/><p>\"I admit that I came here a bit late,\" Hansoo muttered.</p><br/><p>He admitted that he came up to this zone a bit late, but it wasn't over yet. He just had to work harder to compensate for being late.</p><br/><p>\"Stop saying nonsense and prepare to move. We're departing immediately.\"</p><br/><p>\"Damn… If we leave like this, we're all going to die!\"</p><br/><p>Hansoo smiled.</p><br/><p>\"I never said we're going like this.\"</p><br/><p>\"...?\"</p><br/><p>Seeing their questionable looks, he smiled as he left them, heading toward the trunk of the large Desire Tree.</p><br/><p>'I fully used up its essence… Good.'</p><br/><p>Not sure what had made it so angry, one of the Desire Tree trembled crazily as Hansoo began to gather energy from his palm.</p><br/><p>Booooooooooom!</p><br/><p>\"What… the hell?\"</p><br/><p>\"Ah, what the f*ck is happening now?!\"</p><br/><p>The huge amount of energy that suddenly began to gather in front of their eyes caused all of the Transcendents in the vicinity to jump up in horror.</p><br/><p>If they were to be struck properly, it felt like it would crush whatever touched it.</p><br/><p>'What the hell… We're the same 4-Star Transcendents, so why is the gap so large?'</p><br/><p>Even though he knew he was the weakest, he felt it was too much. When Hosang looked at Hansoo with an expression of annoyance, Hansoo raised his hammer into the sky before hitting the Desire Tree in front of him.</p><br/><p>Boooooooooooooooom!</p><br/><p>The Desire Tree trembled along with a large explosion.</p><br/><p>The blow had ripped apart the trunk of the Desire Tree, causing it to start falling.</p><br/><p>Booooooooom!</p><br/><p>However, being unsatisfied with his result, he gathered his energy once more to strike the Desire Tree causing the others to be taken aback in shock.</p><br/><p>\"Hey! HEEEEEEEY! Why are you doing that to something so precious!\"</p><br/><p>\"Ahhhhhhk! My tree! There are so many things I haven't done yet!\"</p><br/><p>\"Are you crazy?! What?!\"</p><br/><p>Their cries were somewhat natural since these nine trees themselves could create a utopia. They were probably wondering why he was destroying such precious trees. Even if he were to break this one, there were still eight left to break. Each one was precious, considering the regeneration of their essence.</p><br/><p>Unfortunately, Hansoo stepped on their expectations even more brutally.</p><br/><p>\"What are you doing. Hurry up and move.\"</p><br/><p>\"...?\"</p><br/><p>\"The other eight trees. Quickly destroy them and come.\"</p><br/><p>\"... Why?\"</p><br/><p>Hosang muttered with a despondent look.</p><br/><p>---</p><br/><p>Kurreeeeeeeeung</p><br/><p>The big elevator trembled before vomiting out dozens of men and women. It was the advance group consisting of Sangjin and the elite members.</p><br/><p>'We've arrived. I wonder what that guy is doing.'</p><br/><p>\"Well... Should we scour the surroundings to see if there is anything dangerous?\"</p><br/><p>At that moment…</p><br/><p>Ruuuuuuuuuuuuuuumble!</p><br/><p>\"Huhhh… Huh?!\"</p><br/><p>\"An earthquake?\"</p><br/><p>The large shockwaves from the ground caused everyone to be anxious. The advance team soon heard the low-key voice of Sangjin.</p><br/><p>\"Even if we don't scout… We know at least one thing.\"</p><br/><p>Rooooooooooooooooar!</p><br/><p>The magnitude was so great that they could feel it happening simply from standing up. Sangjin muttered seeing the large creature crawl up from the ground in anger.</p><br/>\n</div>"}