{"title": "Chapter 448 Desire Return 5", "id": 448, "volume": 5, "url": "http://boxnovel.org/reincarnator-chapter-448-desire-return-5", "volume_title": "Volume 5", "body": "<h1>Chapter 448 Desire Return 5</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Translator: Ares</p><br/><p>Editor Group: Liber Reverie</p><br/><p>Booooooooooooom!</p><br/><p>'Ah damn… what the hell is this the moment I came up?!'</p><br/><p>Ruuuuuumble!</p><br/><p>John Stone, who crushed something the form of an insect that rushed towards him, gnashed his teeth while looking around. It was sheer hell.</p><br/><p>\"Ahhhhhhhhhhhhhhhhhhhhhk! Die!\"</p><br/><p>\"These damned bastards! Hold your formations! Don't let your armor power get the best of you!\"</p><br/><p>Bobooooooooom!</p><br/><p>Ruruuuuumble!</p><br/><p>There were literally bodies, debris, the sound of chaos, and explosions all around. The unidentifiable beast army was crazily attacking them. Species of all varieties came at them. </p><br/><p>There was a beast whose body was covered in tentacles of 20m tall rushing towards them as well, and another giant over 100m tall who was holding a huge rugged club.</p><br/><p>Some of them flew in the sky and relentlessly fired acidic fluids which melted the bodies of Transcendents.</p><br/><p>There was a constant battle ongoing between these guys and the Adventurers.</p><br/><p>John Stone and Kiriel who had come up first continued to maintain their position and solidify their formations.</p><br/><p>Therefore, they were able to barely hold the beasts off to a standstill.</p><br/><p>While the Adventurers that already ascended were withstanding the attack, countless more Adventurers continued to flood out of the elevator.</p><br/><p>Downstairs, from the World Tree Zone to the zone that Mihee had controlled, they had done everything in their power to arm the Adventurers and send them up.</p><br/><p>Despite that, both John Stone and Kiriel were unable to repel the beast army.</p><br/><p>No, it could be said that there were signs of them being pushed back at the rate of their troops being replenished for their army was also being supplemented at an alarming rate.</p><br/><p>Booooooooooooooooooom!</p><br/><p>Something shot up from beneath the ground and devoured dozens of Adventurers. </p><br/><p>The monster looked like a giant worm with dozens of sharp teeth in its mouth.</p><br/><p>The Adventurers who saw the beast that was more than 20 meters in diameter gritted their teeth and shouted, \"What the hell… it's another new species!\"</p><br/><p>\"Everyone, be cautious of the ground!\"</p><br/><p>The moment the man finished speaking…</p><br/><p>Boooooooooom!</p><br/><p>Boooom!</p><br/><p>A new breed of the species shot out from beneath the ground and began to destroy their formation.</p><br/><p>Jiiiiiiiiiiiiiiik!</p><br/><p>John Stone swung his ax down on to their heads while gnashing his teeth. There were enemies in all directions, including the sky and the ground. </p><br/><p>Their forces were being added at a rate beyond the speed of their troops being supplemented from the elevator.</p><br/><p>Not only that, they had received a sudden attack so they were being swept away by the momentum of the battle, not giving them time to regain their formation.</p><br/><p>This was truly complicated.</p><br/><p>What was the purpose of them sending the scouts to begin with?</p><br/><p>It was because they were trying to determine the more secure time to bring the troops up. Of course, the scouts must have judged based on their own rationale as well, but if it was John Stone himself, he would not have brought themselves into such a mess for he at least thought of their own lives.</p><br/><p>\"Sangjin! Sangjin this bastard, what the hell happened!\"</p><br/><p>Seeing the countless Adventurers die off, John Stone screamed furiously.</p><br/><p>---</p><br/><p>\"Ahem… this should be good enough\"</p><br/><p>Boooooooooooom!</p><br/><p>Boooom!</p><br/><p>Agnus let out a sigh seeing the armies of various races rush at them. The beast army was doing much better than she had imagined. They had released a total of 263 species to begin within the southern jungle. Eleven of them were destroyed while fighting amongst themselves, while nine were discarded while watching them grow since they were deemed too dangerous. There was a total of 243 species left, and her men had captured 211 of them.</p><br/><p>Though she had brought over around 50 of the species immediately, there will continue to be more reinforcements.</p><br/><p>'They're quite useful.'</p><br/><p>Agnus nodded her head seeing the Jarokunan species that were breaking the formations from the ground up. They were a species that grew from eating minerals.</p><br/><p>Although all of them were weaker than the species led by the Queen, they were showing the might of 200 species at the moment along with their versatility. More than 50 species were pushing relentlessly. However, this was just the start.</p><br/><p>By using these 50 species as the core, she will bring the rest of the 200 or so species and show them the true might of the army. Once they capture the remaining 40 or so species, it would be perfect.</p><br/><p>They would be able to eliminate the rest of the Adventurers that came from the sudden ascension with ease. No, she was going to make sure they won't even think about sending anymore up by killing the ones currently alive as torturous as possible.</p><br/><p>If they were to value the life of a human being, they wouldn't even think of attempting to send up anymore.</p><br/><p>After satisfying thinking of the situation, Agnus smiled before rising from her seat.</p><br/><p>'Now… I should go.'</p><br/><p>It was alright for her to not be here. So, she will go help Magnus.</p><br/><p>Though it was quite refreshing thinking of Magnus who always moved alone without his men since he was so capable struggling, it didn't mean that she could let him die. No, if he were to die, it would be truly problematic.</p><br/><p>Agnus quickly loosened her body as she closed her thoughts.</p><br/><p>'You better bow to me later, Magnus.'</p><br/><p>Though Magnus may be struggling, he would definitely be holding out somehow alone. The moment she arrived there, the tide of the battle would shift in a split moment.</p><br/><p>Though she was not specialized in battle, she too was a 5-Star Transcendent.</p><br/><p>She was one of the top predators that reigned in the food chain.</p><br/><p>'Kang Hansoo. How unfortunate. Checkmate.'</p><br/><p>The moment Agnus smiled and was about to fly off…</p><br/><p>Jijiiiiiiiiiik!</p><br/><p>&lt;uhuh… it's=\"\" an=\"\" emergency!=\"\"&gt;</p><br/><p>An urgent voice rang in Agnus's head. It was an urgent message from one of her subordinates via the Monarch's authority. She had a questionable look hearing this message.</p><br/><p>'... These are the guys that went after the Desaneros.'</p><br/><p>The number of men from her Monarch's authority was close to a thousand, yet she knew all of the unique traits, personalities, and duties that each one possessed. </p><br/><p>If he was unable to do this job properly, he would no longer be in this position. It was the guy that had departed for the southern jungle to tame and capture the Salamander-type species, Desanero. </p><br/><p>No, in simpler terms, he was the one that had succeeded in capturing them.</p><br/><p>The troops that he brings over would become a truly admirable contribution to their current army to pressure the Adventurer army.</p><br/><p>But, for him to have such an urgent voice when she was about to leave, she had an ominous feeling. So, in a somewhat bad mood, she asked in a heavy tone.</p><br/><p>&lt;don't tell=\"\" me=\"\" you=\"\" failed=\"\" to=\"\" capture=\"\" the=\"\" monarch?=\"\"&gt;</p><br/><p>From those words, her subordinate, Alcanta Dell, shook his head.</p><br/><p>&lt;it's not=\"\" that!=\"\" some=\"\" strange=\"\" guy=\"\" is=\"\" interfering=\"\" with=\"\" us!=\"\" what=\"\" the=\"\" hell!=\"\"&gt;</p><br/><p>&lt;what?&gt;</p><br/><p>The moment she asked, she could hear Alcanta Dell's scream in her head.</p><br/><p>&lt;damn… there's=\"\" a=\"\" guy=\"\" carrying=\"\" a=\"\" corpse=\"\" around…!=\"\" ahhhhhhhhhk!=\"\"&gt;</p><br/><p>Corpse.</p><br/><p>The moment she heard that Agnus's expression hardened.</p><br/><p>She immediately knew who was the one that was interrupted in her operation.</p><br/><p>'... Sangjin. So you've come.'</p><br/><p>It was impossible for her not to know since he was in charge of the Indigo Zone. IT was the same guy that she had endlessly clashed against in the elevator and on the ground.</p><br/><p>Though she had left him and ascended, she couldn't speak of the level of defeat that she felt then.</p><br/><p>Of course, it didn't mean that she had lost, but it was true that she was basically forced out. </p><br/><p>After momentarily looking towards the distance where Magnus was, Agnus mumbled internally.</p><br/><p>'Magnus. Work a bit more.'</p><br/><p>It was unfortunate, but she could not go to where Magnus was currently.</p><br/><p>If Sangjin were to continue to attack from behind and cut off her men who were supposed to join her, the situation would become totally reversed.</p><br/><p>Then the cultivation of these species would be halted, and those who flock up from below will regain their stability and begin to push forward taking advantage of the weakened offense.</p><br/><p>If that were to happen, it would truly make things tiring.</p><br/><p>Agnus who finished her thoughts quickly flew to the South where Sangjin was last seen.</p><br/><p>'... it was quite a boiling battle on the lower floor. However, will it be the same now?'</p><br/><p>While he was fooling around on the lower floor, she was able to successfully overcome the barrier and move on to the next stage.</p><br/><p>Agnus coldly smiled recollecting Sangjin before beginning to run furiously towards the South. </p><br/><p>---</p><br/><p>'... Agnus. It seems she won't be coming.'</p><br/><p>Boooooooooom!</p><br/><p>Magnus muttered quietly seeing the Transcendents continue to relent against him.</p><br/><p>He really didn't have much to think about meaning that he was quite busy himself.</p><br/><p>As if to confirm his thoughts, the Soul Shard trembled before receiving her message.</p><br/><p>&lt;i don't=\"\" think=\"\" i=\"\" can=\"\" go=\"\" there.=\"\" a=\"\" problem=\"\" emerged.=\"\" resolve=\"\" it=\"\" yourself.=\"\" it=\"\" could=\"\" take=\"\" quite=\"\" a=\"\" while.=\"\"&gt;</p><br/><p>Magnus coldly laughed at the remark.</p><br/><p>&lt;of course.=\"\"&gt;</p><br/><p>From the beginning, this was a mission that was entrusted to him. It was natural that he should be the one to settle what was given to him.</p><br/><p>Ruuuuuuuuuuumble!</p><br/><p>Magnus looked at one of the Transcendents who hit his back harshly. </p><br/><p>These guys who normally wouldn't even be able to make eye contact with him were now attacking him.</p><br/><p>He had initially thought that they were fiercely attacking with the intention of opening up a path of escape, but they were attacking him relentlessly with no considerations of escaping.</p><br/><p>It was too short a time for Hansoo to impress them to the point where they would sacrifice their lives.</p><br/><p>In other words, it meant that there was something that forced them. </p><br/><p>If that was so, his mission would be impossible to carry out without killing all of the people here.</p><br/><p>'I was trying to take an easier road… it can't be helped.'</p><br/><p>Booooooom!</p><br/><p>Finishing his thoughts, he grabbed his cloak with his right hand.</p><br/><p>Jiiiiiiiiiiik</p><br/><p>With a small sound, the cape began to quickly unravel. His cape was an object woven from tens of thousands of special threads from the monsters of the Abyss.</p><br/><p>Each strand was extremely sharp and strong.</p><br/><p>After he unravelled the strand of thread long, he began to wrap it around the Queen's neck.</p><br/><p>Chiiiiiiiiing</p><br/><p>It was so sharp that it even caused the Queen's neck to slightly bleed.</p><br/><p>However, as if he was not satisfied with the result, he began to inject his unique trait and mana.</p><br/><p>In a split second due to his unique trait, he shot out his violet aura.</p><br/><p>Feeling pleased about the dog collar he had made for the Queen, he whispered in her ear.</p><br/><p>\"I didn't go this far since you might die, but it can't be helped. Make sure to do whatever you can to survive until I clean everything up.\"</p><br/><p>At the same time…</p><br/><p>Booooooooooooom!</p><br/><p>Having both hands free, Magnus was able to shoot out attacks incomparable to his previous ones.</p><br/><p>Seeing the baggage being gone, he began to build up his energy as if he was determined to rip every one of them that had attacked him earlier.</p><br/><p>However, Hansoo smile grew.</p><br/><p>Boooooooooooom!</p><br/><p>Every time his arm got numb from receiving the attack of Magnus, the Thirteen Shadows inside his body burned as if to resist that pressure, to welcome the opportunity to reveal a different side of his.</p><br/><p>Simultaneously…</p><br/><p>Jjiiiiiiiiiiiik!</p><br/><p>Something similar to a shell began to break open within Hansoo's chest.</p><br/><p>&lt;/of&gt;&lt;/i&gt;&lt;/damn…&gt;&lt;/what?&gt;&lt;/it's&gt;&lt;/don't&gt;&lt;/uhuh…&gt;</p><br/>\n</div>"}