{"title": "Chapter 466 Fateful Encounter 1", "id": 466, "volume": 5, "url": "http://boxnovel.org/reincarnator-chapter-466-fateful-encounter-1", "volume_title": "Volume 5", "body": "<h1>Chapter 466 Fateful Encounter 1</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Translator: Ares</p><br/><p>Editor Group: Liber Reverie</p><br/><p>Rooooooooooooooar!</p><br/><p>'This is…'</p><br/><p>Belphegor narrowed his brows as he watched the strange species lie in the coffins.</p><br/><p>The coffins boasted enormous numbers that could not be easily counted.</p><br/><p>This was what they could see with their own eyes, so the whole structure could boast even large numbers, and each body was locked in each of those large coffins.</p><br/><p>'Is that really a corpse?'</p><br/><p>Belphegor gazed at the sleeping bodies in the coffins.</p><br/><p>They had blue skin and were about three meters tall. </p><br/><p>Overall, they looked to have a human figure, but they were certainly not given their features and skin.</p><br/><p>They were at a perfectly still state with no heartbeat or energy response to be detected.</p><br/><p>It perfectly met the conditions of a normal corpse.</p><br/><p>'The problem is that these guys are of a different species.'</p><br/><p>The standard of death that they measure with might be different for these guys. </p><br/><p>Completing his thoughts, Belphegor looked around, shouting loudly.</p><br/><p>\"Hey! Everyone! Open the coffins and bring what's inside!\"</p><br/><p>There was nothing wrong with having a careful dissection of these bodies.</p><br/><p>Loudly shouting, Belphegor grabbed the translucent crystal tube in front of him and began to grip it tightly.</p><br/><p>It seemed to have been built to protect the users, but it wasn't enough to withstand the power of the 4-Star Belphegor. </p><br/><p>When Belphegor gave strength, the lid that was covering the front of the crystal tube was torn off, and purple liquid began to flow out.</p><br/><p>Belphegor, who held the body with his hand, took it out of the coffin and laid it on the floor.</p><br/><p>He had no hobbies regarding touching dead bodies, but he was also quite familiar with it as well.</p><br/><p>Belphegor began to scrutinize the blue-skin alien species in front of him.</p><br/><p>'Incredible.'</p><br/><p>Belphegor used his skill to look inside and outside.</p><br/><p>There was an enormous density of the skin with solid bone tissues with incredible rigidity and strong internal organs. They boasted strengths and durability dimensions apart from humans.</p><br/><p>Not only that, but the nervous system and energy flow systems consisting of certain structures also looked completely different from humans. Belphegor always regarded knowledge as a weapon, so he had never neglected his studies when the opportunity came to him. He especially had much interest in regards to medicine. </p><br/><p>Even if they had transcendent powers, they were still in a human body.</p><br/><p>Mana, Strength, Skill and Martial Arts.</p><br/><p>They were all dependent on the structures of their own bodies. </p><br/><p>This was why he knew that the bodies of the creatures in front of them were different from theirs. Looking at them, the blood, nervous system, and cerebral tissues that made up human beings almost looked like amoebas in comparison. </p><br/><p>'What kind of guys are they?'</p><br/><p>Full of curiosity and interest, Belphegor became more absorbed as he scrutinized the body.</p><br/><p>It was then…</p><br/><p>\"Here it is. I brought it out.\"</p><br/><p>\"I did too. But this…\"</p><br/><p>Belphegor began to hear murmurs from behind.</p><br/><p>Obstructed from his state of immersion, Belphegor frowned from the noise coming from behind and cried.</p><br/><p>\"Be quiet for a bit. I'll tell you the results once I analyze it.\"</p><br/><p>One of them uttered bluntly from Belphegor's words.</p><br/><p>\"You're going to look at these all by yourself?\"</p><br/><p>\"...?\"</p><br/><p>Belphegor had a puzzled look. This was strange.</p><br/><p>\"What do you mean?\"</p><br/><p>Frowning, Belphegor looked behind before rubbing is eyes.</p><br/><p>It was because of the scene that unfolded in front of him.</p><br/><p>'What in the world?'</p><br/><p>Belphegor looked dumbfounded.</p><br/><p>He naturally thought that the coffins would contain the same bodies. But, his prediction was completely wrong as dozens of corpses with different shapes, appearances and characteristics lay in front of them.</p><br/><p>'Shit. What the hell is this?'</p><br/><p>Belphegor frowned at all kinds of corpses his men had gathered in front of him.</p><br/><p>---------------------------------</p><br/><p>Booooooooooooom!</p><br/><p>Taehee's body flew hundreds of meters away before sinking into a corner of Florida's sky.</p><br/><p>The impact shattered the hologram, leaving the figure of the sky into a crumpled white wall.</p><br/><p>'What… the hell?!'</p><br/><p>Taehee, who rose herself from inside, gnashed her teeth as she watched Hansoo fly toward her with a kick.</p><br/><p>She didn't know that she would be pushed back even with Nargel's Watch…</p><br/><p>Booooooooooom!</p><br/><p>'Uhk.'</p><br/><p>Taehee, who barely managed to turn her head away and avoid the hammer, took a breath and kicked Hansoo away.</p><br/><p>Booooom!</p><br/><p>That accelerated time and body transformed into energy literally as it hit Hansoo, who bounced off far away and plunged into the dry sea.</p><br/><p>\"Huk… Huk.\"</p><br/><p>As she gasped for breath, she had a look of despair.</p><br/><p>Though she had kicked him away, she just bought a little bit of time.</p><br/><p>At this rate, she would definitely lose.</p><br/><p>She had already used 16 needles of the watch. </p><br/><p>The sixteen needles that span slowly had long since stopped moving, and the remaining one was not as busy as it was. </p><br/><p>As soon as that needle stopped, this bout would end.</p><br/><p>The 17 needles that had rewound the future would begin to faithfully calculate the time that they had stolen so far into their own time at random. </p><br/><p>Time would slow down with each needle turning.</p><br/><p>Even if she were to fight with all her might in her current condition, she would not win if any of the 17 needles took away her time.</p><br/><p>'Damn… I have all these skills, and I still can't beat him?'</p><br/><p>Taehee despaired while looking at Hansoo, rushing towards her wrapped in a red light.</p><br/><p>Despite rewinding time with the determination to destroy the whole world, she wasn't able to stand on par with the red light that was emanating out of his body.</p><br/><p>It was sheer brutal power.</p><br/><p>The skills that would wipe out warriors in the thousands were being broken and smashed by the red light that surrounded his body.</p><br/><p>'Damn…'</p><br/><p>High-risk, High Return.</p><br/><p>As if he was boasting about the existence of his skill, he was showing extreme efficiency as he clashed onto her once more.</p><br/><p>She was unable to escape like this. The moment she tried, his attack would penetrate through her back.</p><br/><p>While Taehee despaired and was about to close her eyes…</p><br/><p>Whiiiiiiiiiiiiiiiiiiiiing!</p><br/><p>A brilliant blue light began to wind up and cover Taehee's whole body.</p><br/><p>It was the sign of teleportation.</p><br/><p>The moment Taehee saw this, joy filled her face.</p><br/><p>'You… didn't abandon me!'</p><br/><p>At the same time, Taehee's body disappeared somewhere.</p><br/><p>Booooooooom!</p><br/><p>With Taehee's body disappearing, Hansoo suddenly looked around his surroundings to find her trace, but it was impossible for Taehee to be in the vicinity after being teleported away.</p><br/><p>After confirming that Taehee had disappeared, changes began to take place in Hansoo's body.</p><br/><p>Whooooooosh!</p><br/><p>The red light that filled his eyes were extinguished as the energy caused his muscles to swell as if they would burst.</p><br/><p>The seething blood cooled slowly and the steam from his whole body faded away.</p><br/><p>Before long…</p><br/><p>\"... It was almost over,\" Hansoo, who regained consciousness, looked around and muttered in disbelief.</p><br/><p>He had never guessed that she would retreat while fighting him.</p><br/><p>Though he had indeed abandoned his consciousness in order to repress the pain, but after the end of the battle, all of those memories returned to him vividly.</p><br/><p>'Well, there's nothing I can do about the girl that ran away.'</p><br/><p>It didn't matter if she escaped.</p><br/><p>With that body, she would definitely not be able to engage in battle for quite some time.</p><br/><p>Since she had exhausted all of her mana and abilities, her mana supply would be a complete mess, and it would take an extremely long time for her body to recover.</p><br/><p>With how she had used certain skills to avoid his attacks, it was certain that her soul was damaged as well. The key was Nargel's Watch. Now that the wristwatch's penalty would begin to apply, it would be up to the needles to decide when they want to take back their stolen time.</p><br/><p>If two needles decided to recover back their time during a battle, her time would be halved twice, and if she was unlucky, it could be tripled, which would cause her immediate death.</p><br/><p>'First, let's move.'</p><br/><p>It was meaningful that he had eliminated one of the opponent's important forces.</p><br/><p>Hansoo, who abandoned his lingering feelings after seeing Taehee's disappearance, quickly flew toward the entrance where he had entered.</p><br/><p>He didn't know where and how far Clementine had gone, but it was not really good for him if he were to give him a lot of time.</p><br/><p>Whoosh!</p><br/><p>Stepping on the air before flying, Hansoo checked his own body condition.</p><br/><p>'It seems I've exhausted myself more than I had originally thought.'</p><br/><p>To be exact, the skill of \"Mad Demon\" burned a considerable amount of blood and stamina instead of mana. </p><br/><p>'For you to release so many good skills.'</p><br/><p>Hansoo shrugged, recollecting the large myriad of skills that she had released in their fight despite them not being the same quality as his. </p><br/><p>But, some of it did help him.</p><br/><p>'I've gotten stronger.'</p><br/><p>It was like a furnace where a steel sword was pressed against an anvil.</p><br/><p>Though he himself did not grow since he abstained from using the Soul Exploding Seed, but with his extensive use of his other six skills, their proficiency had increased considerably.</p><br/><p>After concluding his condition check, he jumped on the ground even stronger, heading toward the black hallway.</p><br/><p>He had a rough estimate of where Clementine was.</p><br/><p>Though he was not able to tour Noah as much in his previous life, he understood the structure and design of it.</p><br/><p>Roooooooooooooooar.</p><br/><p>Hansoo, who went out of the black hallway, smiled at the metals that began to regenerate again.</p><br/><p>They were wiggling and moving around as if they had their own will. They were fully reflecting the intentions of someone. </p><br/><p>'So you've succeeded in obtaining Noah in your hands.'</p><br/><p>In the previous life, both he and them had failed.</p><br/><p>Clementine succeeded in destroying Noah. This time, however, it seemed that the opposite was true.</p><br/><p>\"But… it won't be perfect.'</p><br/><p>If he were fully using Noah's energy, the black metals would have already regenerated. This meant that he had not obtained full control.</p><br/><p>Booooooooooom!</p><br/><p>Hansoo, who smashed and smacked the approaching metals, quickly kicked into the air and flew toward where the guy might be.</p><br/><p>-----------------------</p><br/><p>\"Good work.\"</p><br/><p>\"Clementine…\"</p><br/><p>Those were her last words.</p><br/><p>Taehee, who was in Clementine's embrace, had fainted.</p><br/><p>Looking at Taehee with subdued eyes, Clementine flicked his fingers.</p><br/><p>At that moment…</p><br/><p>Whiiiiiing!</p><br/><p>Taehee's body began to be engulfed in the blue light once more before being teleported to a corner of Noah, a safe place. </p><br/><p>Keldian, who watched the scene from start to finish, asked calmly, \"What exactly are you thinking about?\"</p><br/><p>He knew that the guy was able to qualify to obtain Noah because of Nurmaha's Ring. This was proven from mere sight alone, seeing how teleportation was being used inside Noah, which was prohibited beforehand.</p><br/><p>Perhaps they, who had recently registered, had acquired rights that they were not aware of, but there were still some things he didn't understand.</p><br/><p>\"What are you plotting?\" Keldian looked at Clementine and muttered.</p><br/>\n</div>"}