{"title": "Chapter 481 Third Life 3", "id": 481, "volume": 5, "url": "http://boxnovel.org/reincarnator-chapter-481-third-life-3", "volume_title": "Volume 5", "body": "<h1>Chapter 481 Third Life 3</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Translator: Ares</p><br/><p>Editor Group: Liber Reverie</p><br/><p>Mormat, who didn't understand how the situation was unfolding above, muttered as he walked in circles.</p><br/><p>Not all of his anger had subsided yet, but his curiosity was greater.</p><br/><p>'... One guy was on the verge of being an Administrator.'</p><br/><p>This meant that there were two rare men with Transcendence fighting will all their power.</p><br/><p>One came from the future, and the other from the past.</p><br/><p>Regardless of which one had won, it would result in an exciting conclusion.</p><br/><p>However, Barmamunt spouted briefly at Mormat.</p><br/><p>Barmamunt, who looked at Mormat like he was a bug, shook his head and spat out.</p><br/><p>Mormat nodded at Barmamunt's words.</p><br/><p>It was certainly true.</p><br/><p>Neither of them were egoistic in the first place, and both of them were fighting for their own race.</p><br/><p>There was no reason to push ahead in a fight that may cause damage to each other.</p><br/><p>This meant that both have no real incentives to fight each other.</p><br/><p>Not only that, Noah had the Ark so moving across dimensions could be executed swiftly.</p><br/><p>This meant that such a battle won't occur.</p><br/><p>In the first place, Mormat himself speculated from the time he heard that God had given Noah a chance whether it was a plot to build up for a more intense, large fight.</p><br/><p>Normally, a battle would be extremely grand and pivotal the more each one has a lot at stake. </p><br/><p>Compared to two normal man fighting in comparison to hundreds of millions of species or animals fighting for their lives so as to not be destroyed by one another, could any intensity be possibly compared in such a fight?</p><br/><p>This was why he thought Noah was like God's favorite snack, for intense stimulation and entertainment when he was bored.</p><br/><p>However, when he heard Barmamunt's deduction, it seemed to end too calmly. </p><br/><p>It was then…</p><br/><p>Porororong!</p><br/><p>A face of something floated before their eyes.</p><br/><p>Seeing this face, the demons frowned.</p><br/><p>From those words, the fairy grinned and spoke.</p><br/><p>The demons, including Barmamunt, had looks of disbelief.</p><br/><p>---------------------</p><br/><p>Ruuuuuuuuumble!</p><br/><p>Noah frowned from the sudden rushes of energy.</p><br/><p>'This crazy bastard…'</p><br/><p>When Noah was shocked, Belphegor also looked at Noah in shock.</p><br/><p>\\\"... have I been caught on?\\\"</p><br/><p>From those words, Noah shook his head.</p><br/><p>\\\"It can't possibly be.\\\"</p><br/><p>In fact, they were planning something before they had left.</p><br/><p>It was one of the last hidden attack functions on Noah.</p><br/><p>Red Jade Explosion.</p><br/><p>It was a bomb made of the combination of the red jade, which would explode as soon as it reaches outside the dimensional space.</p><br/><p>In reality, they only need 12 of the 18 Red Jades to sufficiently use dimension leap.</p><br/><p>This was why they were prepared to blow this place up as a parting gift before departing.</p><br/><p>What better spectacle could there be than recording the face of a man who would have all of humanity he cherished wiped out before completing their mission and leap through dimensions? </p><br/><p>He would survive, but with all of the world destroyed, what could he possibly do to find them?</p><br/><p>Even if they were to somehow find them, with the authority of the Blue Sunlight Jade, Red Jades, and the privilege of the Administrator, they would have their civilization grow to an unprecedented level so they would welcome him with open arms then.</p><br/><p>His distorted and crying face will be recorded and be permanently engraved in their history as an example of a civilization that opposed the Neropas.</p><br/><p>However, he suddenly went crazy.</p><br/><p>'There's no way I got caught.'</p><br/><p>It was then he heard Clementine speaking in a belittling tone.</p><br/><p>From Clementine's words, Noah hesitated.</p><br/><p>Noah laughed.</p><br/><p>From those words, Clementine laughed loudly.</p><br/><p>&lt;... why=\"\" are=\"\" you=\"\" laughing?=\"\"&gt;</p><br/><p>Seeing Noah's confused look, Clementine coldly smiled.</p><br/><p>&lt;...&gt;</p><br/><p>From Clementine's words, Noah could not retort back.</p><br/><p>It was the truth.</p><br/><p>That ominous, chilling energy from before had changed the moment their treaty had ended. </p><br/><p>It was as if he had missed something.</p><br/><p>That change had rather caused the guy to be more unpredictable than when he had found his memories originally, and the warning in his mind had transformed to a raging storm telling him to kill him before he left.</p><br/><p>Clementine laughed at such a Noah.</p><br/><p>This was why he was able to control him.</p><br/><p>It was much too easy to deal with a person that had a clear goal and had many to protect.</p><br/><p>However, his leash was now loose.</p><br/><p>'He said that I had succeeded in my past life.'</p><br/><p>From what he inferred from him, he was successful since he had destroyed the ark.</p><br/><p>However, there would not have been a plan for him to have died in their hands.</p><br/><p>He would have rather chosen to commit suicide judging by his own personality.</p><br/><p>If he was truly more impressive than him in the previous life… then why did he lose his life to him?</p><br/><p>Clementine smiled coldly, feeling the ferocious, ominous energy being released mercilessly.</p><br/><p>----------------------</p><br/><p>Ruuuuuuuumble!</p><br/><p>\\\"You… what are you going to do?\\\"</p><br/><p>Taehee asked seeing Hansoo concentrating his energy.</p><br/><p>Hansoo replied briefly.</p><br/><p>\\\"Now it's time for me to deal with personal business. You should go out.\\\"</p><br/><p>\\\"...?\\\"</p><br/><p>Taehee frowned before soon nodding and rising from her seat.</p><br/><p>It seemed that there would be nothing good from staying here.</p><br/><p>'I should take… Eres and the others before leaving.'</p><br/><p>This was Clementine's last request.</p><br/><p>So, at the spot where Taehee disappeared from, Hansoo silently watched his inner self.</p><br/><p>The seven seeds began to break down one by one, blurring the boundaries and walls.</p><br/><p>Crack!</p><br/><p>As the space around his body crumpled little by little, the space underneath his feet also began to cave down.</p><br/><p>Looking at his body, which was slowly changing, Hansoo looked at the Blue Sunlight Jade, which looked like the eyes of God staring at him with fiery eyes.</p><br/><p>'Is it fun?'</p><br/><p>He would now be looking down from above and be entertained to death.</p><br/><p>The two saviors of the two tribes that he had raised so preciously would now clash against one another.</p><br/><p>'You damned bastard.'</p><br/><p>Hansoo took a deep breath.</p><br/><p>The treaty with Him was to become the Savior of mankind.</p><br/><p>However, that role was now over.</p><br/><p>The salvation fo humanity ended here.</p><br/><p>From now on, he was a human with a personal revenge to avenge for one's dead comrades and himself.</p><br/><p>'I'm sorry. Sangjin. Enbi Arin. And… Everyone.'</p><br/><p>Ruuuuuumble!</p><br/><p>Hansoo, who was watching his changing body, clenched his fist.</p><br/><p>He had ran nonstop for his old friends.</p><br/><p>For their requests, he had saved and carried old comrades, and had fought ceaselessly to save all of mankind.</p><br/><p>However, while he was running forward, his friends that aided him silently died.</p><br/><p>There was no turning back.</p><br/><p>However, he should be the one… to at least wrap things up at the end.</p><br/><p>Ring!</p><br/><p>Then, a window appeared before his eyes.</p><br/><p>Hansoo smiled coldly at those words.</p><br/><p>\\\"Don't worry about it and go. I'm just personally crazy.\\\"</p><br/><p>This was Noah's last card.</p><br/><p>The explosion of the Red Jades.</p><br/><p>Hansoo sneered seeing Noah like this.</p><br/><p>\\\"On second thought… even if I come out like this, there's no guarantee that it won't be the same from your side either?\\\"</p><br/><p>He put down the load on his shoulder and began to look at the situation from a different angle as anger filled his chest.</p><br/><p>If he were to think rationally, it was right for them to leave.</p><br/><p>But they're supposed to be rational creatures.</p><br/><p>If reason was God's gift for growth and prosperity, then emotions was the bomb planted by God to use that prosperity and strength to fight each other.</p><br/><p>He could clearly read the emotions from the eyes of the Neropas as they passed by.</p><br/><p>Anger.</p><br/><p>Fear.</p><br/><p>Caution.</p><br/><p>Hate.</p><br/><p>'Since they were beings that were close to godly… I had expected them to be somewhat different, but there's no difference. That's it.'</p><br/><p>Seeing Hansoo like this, Noah had a cold expression.</p><br/><p>Then, it wouldn't be bad to sweep half the humans out to start.</p><br/><p>It was then.</p><br/><p>Rumble!</p><br/><p>Hansoo put his hand on the Blue Sunlight Jade.</p><br/><p>Seeing his, Noah flinched but soon laughed loudly.</p><br/><p>From Noah's words, Hansoo laughed.</p><br/><p>\\\"I may not be able to use its power… but if it's a conversation…\\\"</p><br/><p>At that moment…</p><br/><p>Hansoo looked at the Blue Sunlight Jade and delivered his message.</p><br/><p>From Hansoo's words, the Blue Sunlight Jade trembled.</p><br/><p>Seeing the Blue Sunlight Jade like this, with a satisfied expression, he delivered his purpose once more.</p><br/><p>They were not light them.</p><br/><p>The opponent was Noah and the entire Neropa Race including the Red Jades and the Ark.</p><br/><p>The one that would contend was himself, the representative.</p><br/><p>At that moment…</p><br/><p>The jade that resembled the eye of God was trembling loudly as if it was delightful.</p><br/><p>At the same time…</p><br/><p>Ruuuuuuuuuuuuumble!</p><br/><p>The entire space centered around Noah's Ark was isolated before beginning to disappear somewhere else into a space of pure whiteness.</p><br/><p>It was a huge battleground designed for everyone to see.</p><br/><p>Hansoo, who smiled elatedly at such a change, smiled at Noah whose eyes were dyed in golden madness.</p><br/><p>\\\"This is my advantage. You know that right?\\\"</p><br/><p>AT the same time…</p><br/><p>Booooooooooooooooooooooooom!</p><br/><p>The large moon that was floating was devoured by the vast sky itself before disappearing somewhere.</p><br/><p>\\\"What…\\\"</p><br/><p>Like a lie, everything had disappeared.</p><br/><p>The people stared blankly at the sky with nothing left.</p><br/><p>And… three years have passed since.</p><br/><p>&lt;/...&gt;&lt;/...&gt;</p><br/>\n</div>"}