{"title": "Chapter 3: Promotion to the Outer Sect", "id": 3, "volume": 1, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-3-promotion-to-the-outer-sect", "volume_title": "Volume 1", "body": "<h1>Chapter 3: Promotion to the Outer Sect</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 3: Promotion to the Outer Sect</strong></p><br/><p>“You went to sleep early. Now it’s time to wake up for Grandpa Tiger!” The door shook as it opened, and a tall, strong man entered wearing servants’ robes. He glared fiercely at Meng Hao and the fat teenager.</p><br/><p>“Starting today,” he said angrily, “you two little bastards will chop ten trees per day for me, each. Otherwise, Grandpa Tiger will flay you alive.”</p><br/><p>“Greetings, Grandpa Tiger,” said Meng Hao, scrambling off the bed and standing there nervously. “Maybe you could quiet down a…” Before he could finish speaking, the large man fixed his eyes on him.</p><br/><p>“Quiet farts! You think I’m speaking too loud?”</p><br/><p>Looking at his fierce bearing and large stature, Meng Hao hesitated, then said, “But… the Elder Brother in charge of servants already assigned us to chop down ten trees per day.”</p><br/><p>“Then chop an extra ten for me,” he said with a cold harrumph.</p><br/><p>Though Meng Hao said nothing, his brain spun. He had just arrived in the Immortal’s Sect, and was already being bullied. He didn’t want to give in, but the man was so big and strong, and he himself was clearly too weak, unable to fight back. Then he glanced at the table, and noticed the bite marks. Thinking back to how strong the fat teenager had been in the clutches of his dream walking, he had a flash of inspiration. He suddenly yelled at the sleeping fat teenager.</p><br/><p>“Fatty! Someone’s stealing your mantou and your girl!”</p><br/><p>As soon as the words were out of his mouth, the fat teenager sat up, eyes closed, shouting, his face twisted with furious savagery.</p><br/><p>“Who’s stealing my mantou? Who’s stealing my wife?” he cried, leaping out of the bed. “I’ll beat you to death! I’ll bite you to death!” He began striking randomly around the room. The big man stared in shock, then took a step forward and made to slap the boy.</p><br/><p>“You dare to shout in front of Grandpa Tiger!” His slap landed on the boy’s face, but then the big man cried out. The fat teenager, eyes closed, had bitten down onto the man’s arm. No matter how the man shook his arm, the boy refused to let go.</p><br/><p>“Stop biting me, dammit. Stop biting.” This man was a servant, not a Cultivator. He had been a servant for a long time, and his body was strong, but the pain had caused him to break out in a cold sweat. He punched and kicked, but couldn’t make the fat teenager loosen his jaw even the slightest bit. The harder he hit, the deeper the boy bit. The man’s flesh was mangled, and it seemed as if a chunk were about to be ripped off.</p><br/><p>His screams drifted outside, such that others began to notice. A cold voice shouted out.</p><br/><p>“What’s the ruckus?”</p><br/><p>It was the voice of the horse-faced young man. As soon as the big man heard it, he began to tremble in fear. Despite the horrible pain which twisted his face, he ceased his screaming.</p><br/><p>“It’s not a good idea to upset the Elder Brother in charge of servants,” said the big man hurriedly. “There’s no benefit to continuing this. Quick, stop biting me! I don’t need the ten logs.”</p><br/><p>Meng Hao never imagined the fat teenager’s dream state would be so intense, and also wanted to stop the situation. He walked forward and lightly slapped the fat teenager, then whispered into his ear.</p><br/><p>“The mantou is back, and so is your girl.”</p><br/><p>The young man suddenly relaxed and released his jaw. Continuing to punch the air, he returned to his bed, his face covered in blood, then fell back to sleep.</p><br/><p>Giving another nervous glance toward the fat teenager, the big man left without saying another word.</p><br/><p>Meng Hao stood there for a while gaping, admiring the fat teenager, then returned to bed with the greatest of care and went back to sleep.</p><br/><p>The following morning at dawn.</p><br/><p>As the morning sun filled the sky, the sound of bells filled the air. It seemed to carry with it a strange power; as people heard it, they woke and began their work. The fat teenager woke up. He looked down dumbly at the marks on his body. He touched his face.</p><br/><p>“What happened last night? How come my whole body hurts? Did someone beat me up?”</p><br/><p>Meng Hao dressed silently for a while before speaking.</p><br/><p>“Nothing happened. Everything seemed normal.”</p><br/><p>“How come my face feels swollen?”</p><br/><p>“Maybe it’s mosquitos.”</p><br/><p>“Then how come my mouth has blood on it?”</p><br/><p>“You fell out of bed last night. Several times, in fact.” Meng Hao opened the door and stepped out, then stopped and looked back. “Look, fatty,” he said in a serious tone, “you need to grind your teeth more often, sharpen them up.”</p><br/><p>“Oh? My dad used to say the same thing,” he said in surprise, gingerly putting on his robes.</p><br/><p>Meng Hao and the fat teenager walked out into the sunlight and began their life as servants in the Reliance Sect, chopping down trees.</p><br/><p>Each of them was responsible for ten trees. Around the Northern Servants’ Quarter, the wild slopes were covered with trees. Although the trees were not big, they were very dense and spread like an ocean as far as the eye could see.</p><br/><p>Carrying his servant's axe, Meng Hao rubbed at his shoulder. His arm felt both numb and painful. The axe was heavy. Off to the side, the fat teenager panted as they climbed. Eventually, they found a suitable area, and the sound of chopping axes gradually rang out as they began to work.</p><br/><p>“My dad is super rich,” said the fat teenager with a long face. He raised his axe. “I’m gonna be super rich too. I don’t want to be a servant… These Immortals are strange, and they have magic. What do they need fire for? And why do they need us to chop down trees for them?”</p><br/><p>Unlike the garrulous fat teenager, Meng Hao was too tired to speak. Sweat showered off of him like rain. Because of his poverty in Yunjie County, he hadn’t been able to eat much meat and as such his body was weak. He didn’t have much energy. After the space of time it takes half an incense stick to burn, he leaned up against a tree, breathing heavily.</p><br/><p>He looked at the fat teenager, who, though he was so tired he trembled, he continued to curse under his breath and chop at the tree. He was younger than Meng Hao, but a lot stronger.</p><br/><p>Meng Hao shook his head bitterly and continued to rest. He pulled out the Qi Condensation Manual and examined it again. Following the description in the manual, he attempted to sense the spiritual energy of Heaven and Earth.</p><br/><p>Time passed, and soon it was dusk. In his day of work, Meng Hao had managed to cut down two trees. The fat teenager had managed to cut down eight. By pooling them together, it was enough for one of them to eat. They consulted for a bit, and then the fat teenager went to get some food which the two of them shared in their room. Then they fell to sleep, exhausted.</p><br/><p>Eventually, the fat teenager’s snores filled the room, and Meng Hao struggled to sit up, his eyes filled with determination. Ignoring his hunger and exhaustion, he picked up the Qi Condensation Manual and started reading it again.</p><br/><p>“When I used to study for the examinations, I would usually stay up reading until dawn. I’m used to being hungry. As for my life now, it may be tiring, but at least I have a goal. I can’t believe that after failing in the Imperial examinations, I will fail in Cultivation.” Stubborn persistence shone in his eyes. He lowered his head and began to study.</p><br/><p>He continued on until late in the night, until he finally fell asleep, although when exactly that was, he didn’t know. As he slept, his dreams were filled with thoughts of sensing the spiritual energy of heaven and earth. The bells woke him up in the morning. He opened his bloodshot eyes, yawned, and got out of bed. Then, along with the energetic fat teenager, went back to chopping wood.</p><br/><p>A day, two days, three days… time continued on until two months had passed. Meng Hao’s wood-felling ability slowly grew until he could chop down four trees in a day. But, most of his time was spent trying to grasp the meaning of spiritual energy. His eyes grew more and more bloodshot. Then one evening around dusk, as he sat panting in mediation, his body suddenly vibrated, and he felt a prickling numbness in his limbs. Then, it seemed as if tiny wisp of invisible Qi condensed within his flesh and blood, then seeped out of his body.</p><br/><p>After that, he felt a strand of spiritual energy appear inside him. It disappeared almost instantly, but Meng Hao opened his eyes excitedly. His exhaustion disappeared, and his bloodshot eyes grew whiter. His body trembling, he clutched at the Qi Condensation Manual. He hadn’t eaten or slept much in the past months. Other than chopping down trees, he spent almost all his time on spiritual energy, and now, at long last, he had some results. He felt as if he were filled with power.</p><br/><p>Time passed in a flash, two months, and now it was the eighth month of the year, summer. Broiling sunlight fell from the sky.</p><br/><p>“Condense the Qi into the body, fuse and disperse it, open the blood vessels and Qi passages, resonate with heaven and earth.” It was noontime in the deep mountains near the Reliance Sect. Meng Hao used one hand to stoke the bonfire in front of him, and the other to hold the Qi Condensation Manual, which he studied intently.</p><br/><p>He closed his eyes for the time it takes an incense stick to burn, sensing the delicate strand of Qi within his body. This was the Qi which had appeared two months ago, and Meng Hao regarded it as a treasure. The strand was clearly much thicker now. Using the mnemonics and circulation technique described in the manual, he sat in meditation, allowing the Qi strand to move about his body.</p><br/><p>After a short time, Meng Hao opened his eyes and caught sight of the fat teenager approaching quickly, carrying his axe.</p><br/><p>“Well, how is it?” panted the fat teenager as he ran up. Though fat, his body was strong.</p><br/><p>“I still can’t disseminate it throughout my entire body,” said Meng Hao with a laugh. “But I’m quite confident that within a month, I’ll be able to reach the first stage of Qi Condensation.” Belief filled his demeanor.</p><br/><p>“What I meant was, how is the chicken?” He licked his lips as he looked at the bonfire.</p><br/><p>“Oh, pretty much done,” said Meng Hao, also licking his lips and pulling back the branch he’d been using to stoke the fire. The fat teenager used his axe to dig through the soil and pull the chicken out. It was fully cooked now.</p><br/><p>A fragrant aroma filled the air. They split the chicken in half and began to wolf it down.</p><br/><p>“Ever since you were able to get some spiritual energy,” said the fat teenager, his lips covered in grease, “you’ve been able to catch wild chickens. Compared to now, the first two months here were like a nightmare…” This was his new practice, to flatter Meng Hao.</p><br/><p>“A lot of people get food out in the wild, you just don’t know about it, that’s all.” As Meng Hao spoke, he took a bite out of a chicken leg, making his speech a bit garbled.</p><br/><p>“Ai, if you really reach the first level of Qi Condensation next week and become an Outer Sect disciple,” said the fat teenager, his face bitter, “then what will I do? I don’t understand any of those mnemonics.” He looked at Meng Hao expectantly.</p><br/><p>“Look fatty, the only way you can get home is if you become an Outer Sect disciple,” said Meng Hao, dropping the chicken leg and looking him in the eye.</p><br/><p>The fat teenager sat quietly for a while before giving a determined nod.</p><br/><p>Six days flew by. It was night. The fat teenager was already asleep, and Meng Hao sat cross-legged in his room, meditating. He thought about how other than wood-chopping, he had spent all his time these past three months in sensing spiritual energy. He thought back to two months ago, when the strand of Qi had first stirred within him. He breathed deeply, closing his eyes and causing the strand of spiritual energy to circulate throughout his body. Then, a loud sound reverberated in his head. Up to now, he had been unable to disperse the Qi throughout his entire body. But just now, he had succeeded, diffusing the Qi to every corner of his body. He felt as if his body were floating.</p><br/><p>At the same moment in which Meng Hao achieved the first level of Qi Condensation, the horse-faced young man sitting on the big stone outside slowly opened his eyes. He looked in the direction of Meng Hao’s house, then closed his eyes again.</p><br/><p>At dawn, under the envious eyes of everyone in the Northern Servants’ quarter, Meng Hao walked out of the room that had been his home for the past four months. He stood in front of the horse-faced youth.</p><br/><p>The fat teenager didn’t come with him. He remained in the doorway watching Meng Hao, determination filling his eyes.</p><br/><p>“You reached the first level of Qi Condensation in four months. You’re not quite outstanding, but not stupid, either.” The horse-faced young man looked at him, his expression no longer cold. Calmly, he said, “Now that you are going to the Outer Sect, I must explain to you the rules there. Every month, Spirit Stones and medicinal pills will be distributed there, but it is not prohibited to take things by force from others, or to gang up. There is a Public Area there that some people call the Killing Zone. You … you will need to look out for yourself.” As he finished speaking, he lifted his right hand, whereupon a jade slip shot out and hovered in front of Meng Hao. He grabbed it.</p><br/><p>“Imbue spiritual energy into that jade slip and it will lead you to the Treasure Pavilion in the Outer Sect. That is where you will register your promotion.” The horse-faced young man closed his eyes.</p><br/><p>Meng Hao said nothing. Clasping his fist in salute, he turned and glanced at the fat teenager. They looked at each other for a moment, and Meng Hao felt emotion welling up in his heart. He chose not to dwell on it. He pinched the jade slip, which then began to glow with a green light, and gradually floated forward.</p><br/><p>Meng Hao followed it, slowly leaving the Servants’ Quarter.</p><br/><p>He trod a narrow road which led away from the main gate, walking further and further away, toward the foot of the mountain. Eventually he reached an area he had never stepped foot into during the past four months.</p><br/><p>The Reliance Sect was comprised of four main mountains, with east, west, north and south peaks, respectively. Surrounding them were vast mountain chains which seemed to never end. At the halfway point up each mountain was a Servants’ Quarter. Meng Hao had been assigned to the Northern Servant’s quarter on the Northern Mountain. The way further up was protected by defensive spells. Beyond them lived the Inner Sect disciples and elders.</p><br/><p>Each of the four mountains was like this. As for the flat area in-between them all, it was filled with countless houses inhabited by the Reliance Sect’s Outer Sect.</p><br/><p>In this respect, the Reliance Sect was slightly different that other Sects. The Outer Sect was located at the foot of the mountain, whereas the servants lived halfway up. This was a sect rule created for unknown reasons by Patriarch Reliance.</p><br/><p>From a distance, the entire area seemed to be filled with roiling fog. However, upon stepping foot into the fog, it disappeared. In front of him stretched a scene of carved balustrades and marble steps, of lofty buildings and roads paved with green stone. Outer Sect disciples bustled about wearing green robes. A few of them noticed Meng Hao as he walked past.</p><br/><p>Some of them shot him contemptuous glances which lacked even the slightest bit of good intent. He felt as if he were being stared at by wild beasts, which caused him to recall what Elder Brother Horse-face had said about the Outer Sect.</p><br/><p>Not long after that, he reached a black building in the southern section of the Outer Sect. It was three stories tall, and despite being black, appeared to have been carved from jade, and almost seemed to be transparent.</p><br/><p>As Meng Hao approached, the building’s main door opened noiselessly and out walked a wizened, middle-aged man. He wore a long robe of deep green, and a shrewd expression covered his face. He lifted his right hand in a grabbing motion, and the jade slip flew into his hand. He looked at it then began to speak languidly:</p><br/><p>“Meng Hao has been promoted to the Outer Sect. He shall be bestowed with a house, a green robe, a spirit tablet, and a bag of holding. The spirit tablet can be used to enter the Treasure Pavilion to retrieve a magic item.” He waved his right hand, and a gray bag appeared in Meng Hao’s hands.</p><br/><p>He looked at the gray bag for a moment, then thought back to one of the Outer Sect disciples he’d passed on the road. That man had a bag just like this hanging at his waist.</p><br/><p>The shrewd-looking man looked at Meng Hao, and could instantly tell that he was not familiar at all with the ways of the Outer Sect. Otherwise, how could he be unfamiliar with a bag of holding? Feeling a bit bad for him, he coolly said, “By imbuing the bag with spiritual energy, you can pack many things into it.”</p><br/><p>Having heard this, Meng Hao imbued the bag with a sizable amount of spiritual energy. It grew blurry, and then he caught a glimpse of a space inside about half the size of a person. There, he could see a green robe, a jade slip, and some other objects.</p><br/><p>At this point, his interest was quite piqued. This bag of holding must be worth at least a hundred gold. It clearly was the product of Immortal hands.</p><br/><p>He concentrated, and the jade slip suddenly appeared in his hand. He focused his attention even more and found that inside the bag was a map of the Outer Sect Quarter. In a remote corner was his house.</p><br/><p>“Go look at it later,” said the shrewd-looking man coldly. “The Treasure Pavilion is open and you haven’t entered it yet.”</p><br/><p>Meng Hao lifted his head and stuffed the bag of holding into his robe. Looking at the opened door of the Treasure Pavilion, he sucked in a deep breath and stepped in, filled with anticipation.</p><br/><p>As soon as he entered, his expression changed, and he sucked in a breath.</p><br/>\n</div>"}