{"title": "Chapter 6: The Delights of the Copper Mirror", "id": 6, "volume": 1, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-6-the-delights-of-the-copper-mirror", "volume_title": "Volume 1", "body": "<h1>Chapter 6: The Delights of the Copper Mirror</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 6: The Delights of the Copper Mirror</strong></p><br/><p>Elder Sister Xu was quite well known in the Reliance Sect. In fact, you could say that everyone knew her, because as of now, the Reliance Inner Sect only had two disciples.</p><br/><p>Other than Elder Sister Xu, the only other disciple was the man currently standing next to Shangguan Xiu.</p><br/><p>After Elder Sister Xu lent him her Immortal’s Cave, it had a fear-inspiring effect on everyone, allowing Meng Hao to leave the square with the Spirit Stone and Spirit Condensation pills. Everyone watched him as he left.</p><br/><p>As he walked off into the distance, his back soaked with sweat, he felt the glares behind him like invisible blades. They slowly dissipated as he walked quickly away.</p><br/><p>In the time it takes three incense sticks to burn, Meng Hao walked without stopping. He didn’t return to his room in the Outer Sect, but rather followed the white jade slip Elder Sister Xu had given him toward the Southern Mountain. At the foot of the mountain, he located the Immortal’s Cave.</p><br/><p>Outside of the cave, two large stone slabs towered up next to the mountain face. Everything was covered with green branches and vines; it appeared to be an entirely unordinary place, very different from Meng Hao’s previous two dwellings.</p><br/><p>The surroundings here were peaceful and lush. Not far away, a mountain spring flowed down, and the wind carried away the heat, replacing it with cool, fresh air.</p><br/><p>Meng Hao stood in front of the mouth of the Immortal’s Cave, looking completely content. Now he truly understood how precious such a cave could be, clearly much more than any other dwelling place. No wonder all the other Outer Sect disciples had looked so jealous and envious when Elder Sister Xu lent it to him.</p><br/><p>“This is a place for Immortals,” said Meng Hao. He waved his right hand, and the slip of white jade flew forward to the cave’s green stone door. It slapped onto the surface, and a buzzing sound filled the air as the door slowly opened.</p><br/><p>The Immortal’s Cave was not very big, and only had two rooms. One room was for practicing cultivation, the other was sealed shut with a stone door. Meng Hao entered, and the green stone door slowly closed behind him. When it sealed, the white jade slip flew out and into Meng Hao’s hand. Thereupon, a soft glow began to emanate from the craggy stone ceiling.</p><br/><p>The more he looked around, the more satisfied he felt. Finally, his gaze fell upon the sealed stone door. Muttering to himself, he placed the jade slip onto it, and the door slowly opened. At that moment, an odor of thick spiritual energy suddenly wafted out. Meng Hao looked into the stone room, his eyes wide with shock.</p><br/><p>“Sister Xu’s Immortal’s Cave, this… this gift is just too valuable.” It took a while for him to recover his composure. He stared blankly into the stone room, at something that appeared to be the mouth of a spring. Out of it gurgled pure spiritual energy, multicolored and glowing as it curled up into the air. Who knew how long it had been accumulating in the stone room. As soon as the door had opened, it began to pour out, its aroma sweet in the nose and mouth. Even just a whiff would fill you with energy.</p><br/><p>“So it’s a Spirit Spring,” Meng Hao murmured. It was something else he had never seen before, but had read about in the Qi Condensation Manual. Some springs in the world were Spirit Springs, which had no water. Instead, they flowed forth with spiritual energy. Not many existed, and most were occupied by Cultivators, considering how treasured was the spiritual energy they emitted.</p><br/><p>The Spirit Spring was relatively small. When all its spiritual energy came out, it was only slightly thicker than outside. To anyone above the third level of Qi Condensation, it would not be very helpful. After the third level, the spiritual energy required was just too much; thus, it was only moderately useful.</p><br/><p>Despite that, as far as Meng Hao was concerned, this gift was incomparably valuable, even much more so than a Dry Spirit pill. With this discovery, Meng Hao went nearly wild with joy.</p><br/><p>With no time to think, he sat down cross-legged, closed his eyes, and began his breathing exercises. After a few hours, the greater part of the spiritual energy that had accumulated here was gone. Meng Hao opened his eyes, and they flashed brilliantly.</p><br/><p>“These few hours of meditation here were worth about a month of Cultivation outside. This accumulation of spiritual energy took quite some time to build up, and probably won’t be like this again. Even still, practicing Cultivation in here, I will be able to achieve speed that’s impossible in the outside world.” He sighed. Looking around, he noticed that the walls were covered with strange markings that he didn’t understand.</p><br/><p>“The Spirit Spring can accumulate so much spiritual energy because of these markings. Elder Sister Xu must have used this method to build up energy then dispose of it all in one shot.” Meng Hao thought for another moment, then had an inspiration. He again sat down and began to do breathing exercises.</p><br/><p>The night passed quickly, and as the sun rose the next morning, Meng Hao opened his eyes. The spiritual energy in the stone room was very thin. But the Spirit Spring was still there. After some period of time passed, the spiritual energy would surely build up again.</p><br/><p>Meng Hao took a moment to sense his cultivation level. It seemed that he had made an advancement worth nearly two months.</p><br/><p>“If I can practice Cultivation in this fashion a few more times, I should be able to break through the first level of Qi Condensation and enter the second!” He sucked in a breath, excited. He very much wanted to break through the first level, because only by reaching the second level of Qi Condensation could one unlock the first Immortal Skill in the Qi Condensation Manual.</p><br/><p>Thinking of Immortal Skills, Meng Hao left the stone room, closing the stone door as if it were some type of jewel or treasure. He decided to use Elder Sister Xu’s method. He wouldn’t stand guard next to the Spirit Spring itself. He would just wait for some time to pass, then come back to collect the spiritual energy.</p><br/><p>Sitting there in the Immortal’s Cave, Meng Hao rubbed his stomach. Thinking over the recent days, and looking down at his skinny belly, he realized that he hadn’t eaten any wild animals recently. Not even wild fruits.</p><br/><p>After becoming an Outer Sect disciple, he thought to himself, he hadn’t been eating as much as when he was a servant. As long as you had enough Spirit Stones, you could take them to the Sect’s Pill Cultivation Workshop to exchange them for Fasting Pills or Appetite Control Pills. It was said that one drop of such a pill would prevent hunger for days. Without them, people would have to spend time worrying about finding food.</p><br/><p>After thinking about it for a while, Meng Hao decided to go out for a bit. The fresh wind blew past him into the surrounding jungle. As he walked, he pulled the copper mirror out of his bag of holding, as had become his custom.</p><br/><p>By now, he was thoroughly convinced that the Treasure Pavilion Brother had tricked him. There was nothing unusual at all about this mirror. In more than half a month of study, he hadn’t uncovered anything even slightly peculiar about it.</p><br/><p>“Sadly, I only have a half of a Spirit Stone in my bag of holding. I bet I’ll need to use it to bribe him to let me exchange it.” He stretched his hand into the bag to pull out the Spirit Stone, feeling a bit dejected.</p><br/><p>He suddenly froze in place, lifting his head up when he noticed a flash of color off in the distance in the jungle. It wasn’t moving very fast. Meng Hao’s eyes glittered. Based on his experience in the past months catching wild chickens, he knew exactly what it was. Wild chicken.</p><br/><p>Without time to think about shoving the copper mirror and Spirit Stone back into the bag of holding, he shoved them into a pocket and leaped forward. Ever since spiritual energy had appeared in his body, Meng Hao realized that he was much more nimble than before. Despite still being somewhat frail, he now could burst forth with explosive force.</p><br/><p>Especially nowadays, after reaching the first level of Qi Condensation, a leap like the one he just made propelled him forward very quickly. In the space of about ten breaths, he was able to snatch the alarmed wild chicken. He clasped it by the two wings so that it couldn’t move about.</p><br/><p>“I wonder how good old Fatty is doing recently,” he said, thinking about the fat teenager as he lifted up the chicken. Maybe he would go find him and share a meal of wild game. Just as he turned, he suddenly felt something inside his robe growing hot.</p><br/><p>Moments later, the previously quiet chicken in his hand started to struggle wildly and emit miserable squawking sounds. It moved around with such energy than Meng Hao almost couldn’t keep hold of it.</p><br/><p>The wild chicken struggled even fiercerly, squawking with incomparable shrillness. Then, a popping sound could be heard coming from its butt, which then suddenly exploded, sending blood and gore flying in all directions.</p><br/><p>Everything happened so suddenly. Meng Hao stood there gaping. Ever since arriving on the mountain, he had caught quite a few wild chickens. But this was the first time he had seen anything like this. He looked down with shock at the dead chicken and its exploded rear. Then he looked around. Everything was still and quiet. Not even a shadow moved.</p><br/><p>“What just happened?” Meng Hao shivered. The wild chicken’s death had been quite miserable. It must have experienced incredible pain for its butt exploded.</p><br/><p>Meng Hao took in a deep breath, suppressing the anxiety he felt. The wild chicken’s death had been too odd and horrific. He felt as if a cold wind was blowing down his back.</p><br/><p>“Something’s not right,” said Meng Hao. He tossed away the dead chicken, and then pulled out the mirror and the Spirit Stone. He remembered that just before the strange thing had happened with the chicken, something in his robe had started to grow hot.</p><br/><p>“Could it be the Spirit Stone…” Then his eyes fell onto the copper mirror. His heart began to beat faster and a powerful radiance shone forth in his eyes.</p><br/><p>“Don’t tell me…” The hand holding the mirror began to tremble. He had no time to go eat with the fat teenager. Gripping the mirror, he ran as fast as possible into the jungle, trying to find another wild animal. He needed to know if the wild chicken’s killer really was the mirror.</p><br/><p>He didn’t have to run for very long before a wild deer appeared right in front of him. It stood there looking at him stupidly, then angrily. Meng Hao immediately shined the mirror onto it.</p><br/><p>The deer’s expression changed immediately. It leaped to flee, calling out miserably, in a heart-rending fashion difficult to describe. Anyone who heard it could only imagine how miserable the creature must be. Meng Hao could clearly see the animal’s flank as it leaped into the air. Before it could land, its butt exploded with a bang, its body twitching as it fell.</p><br/><p>Looking at the dead deer, then back at the mirror, an unprecedented look of excitement appeared on Meng Hao’s face.</p><br/><p>“What a treasure! A real treasure!!</p><br/><p>“It’s so strange. A treasure that explodes the butts of wild animals…” Even though he didn’t understand it completely, he was still very excited. Regardless of why the treasure did this, he had an itching desire to go test it out on some more animals.</p><br/>\n</div>"}