{"title": "Chapter 10: Wang Tengfei", "id": 10, "volume": 1, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-10-wang-tengfei", "volume_title": "Volume 1", "body": "<h1>Chapter 10: Wang Tengfei</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 10: Wang Tengfei</strong></p><br/><p>Toward the end of September, it grew as hot as usual. The heat refused to dissipate, instead growing more and more intense. In the lands of South Heaven, things usually began to cool by around the eleventh month of the year in the Southern Domain in the State of Zhao. By the first month of the following year, the freezing grip of winter could be felt.</p><br/><p>One morning at dawn, Meng Hao left the Immortal’s Cave, eyes shining, full of hope regarding the future.</p><br/><p>“My Cultivation base is just a hairs breadth away from the peak of the third level of Qi Condensation,” he said, taking a deep breath. “Perhaps I can’t be considered powerful in the Outer Sect, but at least no one will pick on me.” He looked off into the distance. The mountain breeze lifted his hair up as it blew past, and he suddenly appeared quite elegant.</p><br/><p>Originally a down-and-out scholar, he had entered the world of Immortals. When he thought back to the events which had occurred in the preceding days, they seemed almost unreal.</p><br/><p>“It’s too bad I don’t have enough Spirit Stones. And the Spirit Condensation Pills aren’t strong enough to be of any use…” His excitement faded into disappointment when he thought about Spirit Stones.</p><br/><p>“Fatty, Wang Youcai, and that other headstrong young man,” Meng Hao muttered to himself. “The four of us came to the Reliance Sect together. I wonder how they are now.” His body moved forward in a flash. Circulating the spiritual energy in his body, he immediately headed toward the North Mountain.</p><br/><p>The East, South, West and North Mountains of the Reliance Sect towered mightily into the sky, covered with pavilions carved from jade. If you looked at the mountains closely, you could see rays of dawn light seeping over their peaks, just beginning to illuminate the surroundings.</p><br/><p>White clouds wound around the peaks, concealing parts of the mountains. It really did seem like a place of Immortals.</p><br/><p>If you wanted to go from the South Mountain to the North Mountain, but wanted to circumvent the Outer Sect, then you would have to pass along the East or West Mountain. Meng Hao walked along the path passing the East Mountain, two wild chickens in hand.</p><br/><p>“I haven’t seen Fatty in about two months, I wonder if he’s lost any weight.” Thinking about Fatty, Meng Hao smiled. Then, his eyes flickered and he stopped walking.</p><br/><p>He felt a gentle breeze from up ahead, which carried along with it a thin fog. Amidst the fog walked a young man wearing a luxurious white robe.</p><br/><p>He was clearly different than other Outer Sect disciples. His garment was as white as snow and his long hair flowed over his shoulders. Incredibly handsome, almost pretty, he gave off the sense of being perfect in every way, both physically and in temperament. It was as if he had been blessed by Heaven, Chosen by nature.</p><br/><p>His expression was cool and indifferent, as if nothing were worthy to cause him to change it. Even if the mountains crumbled in front of him, he would remain calm. The fog beneath him roiled and churned.</p><br/><p>Behind him walked two youths, who were also handsome, but when compared to the white-robed young man seemed like trash.</p><br/><p>“Elder Brother Wang, we’ve heard that in a few years, the Sect will have special training to promote disciples to the Inner Sect. We Junior Brothers would like to take this opportunity to congratulate you in advance.”</p><br/><p>“Yes. When Elder Brother Wang entered the Sect, he was already famous. He even aroused the interest of the other three great Sects. But in the end, you decided to stick with the Reliance Sect. What extraordinary magnanimity! Refusal to violate the etiquette of the Sect, ignoring the invitations of the outsiders, reaching the sixth level of Qi Condensation in these two years. I even heard one of the Patriarchs say that the promotion training was being held just for Elder Brother Wang.”</p><br/><p>“That’s right. Once Elder Brother Wang enters the Inner Sect, it won’t be long before he surpasses Elder Sister Xu and Elder Brother Chen. He’ll be the famous number one disciple of the Reliance Sect.”</p><br/><p>“Don’t speak foolishly,” said the man in the white robe, his voice gentle. “Elder Sister Xu is a Chosen, and Elder Brother Chen is wholeheartedly focused on the Dao. They are both fellow disciples whom I admire and respect.” His voice was light and warm, but also manly and pleasant to the ear. This was the number one disciple of the Outer Sect, Wang Tengfei.</p><br/><p>“Elder Brother has achieved outstanding mastery of Cultivation. With such latent talent and good nature, we Junior Brothers are happy to receive your instruction.”</p><br/><p>“Yes, Elder Brother Wang treats everyone kindly, even disciples of the first level of Qi Condensation. Everyone in the Sect knows this. I truly admire you.”</p><br/><p>The three of them talked, walking slowly toward Meng Hao. Elder Brother Wang, in his white robe, caught sight of the Meng Hao and nodded. He passed them, and the other two people didn’t even give him a single look. As they walked off, Meng Hao glanced back. It was then that he noticed the white-robed man’s feet were not on the ground. Instead, he floated along about seven inches off the ground. Meng Hao gaped in shock.</p><br/><p>He realized that he himself couldn’t even compare in any way. He was frail and swarthy, not attractive in any way. Furthermore, he carried two squirming chickens in his hands.</p><br/><p>“So that’s Elder Brother Wang Tengfei. He has the ability to float in the air, a skill which comes with the fifth level of Qi Condensation.” He had heard rumors about Elder Brother Wang, and knew a lot about him. When Wang Tengfei had entered the Sect, it had caused a big commotion in the Cultivation world in the State of Zhao. No one knew the true price paid by the Reliance Sect to calm the waves of commotion, or why he had decided to stay.</p><br/><p>“If I looked like him, I could have placed first in the Imperial examinations. I could have married the Emperor’s daughter.”</p><br/><p>Filled with admiration, Meng Hao turned and continued on toward the North Mountain.</p><br/><p>He didn’t stop the entire way, and by midday, had arrived in the wild mountains bordering the North Mountain. This was where he and Fatty had usually come to chop wood. As soon as he arrived, he heard the sounds of chopping. With a smile, he walked briskly forward, and soon caught sight of Fatty, chopping away at a tree.</p><br/><p>He was about to call out a greeting, then stopped and took a step back.</p><br/><p>“You stole my wife, and my mantou. I’m gonna chop you to death! I’m gonna bite you to death!” Fatty hadn’t lost any weight. In fact, he was a bit fatter. He looked like a round ball.</p><br/><p>His eyes were closed, and he stood there howling, surrounded by chopped up pieces of wood. He hacked at the trees, his body twisting. Then, he dropped the ax and fell to sleep.</p><br/><p>Deep bite marks could be seen on the long handle of the ax.</p><br/><p>Meng Hao was shocked. He had never imagined that in his two months away, Fatty’s sleepwalking behavior would become even more severe. Now it wasn’t just happening at night, but during the day as well.</p><br/><p>He was hesitating as to whether or not to awaken him, when suddenly Fatty’s nose twitched and he rubbed his eyes. He gazed about, eyes shining, looking as if he were about to drool.</p><br/><p>“I smell wild chicken! Yeah, two of them!” He jumped up and looked around, although he didn’t see Meng Hao standing there in the jungle. Then he saw the felled trees around him, a look of gratefulness filled his eyes.</p><br/><p>“Ah, Meng Hao, you’re so kind,” he said emotionally. “You’ve been gone so long, but you keep coming back secretly to help me chop wood. It’s been like this for almost two months. Meng Hao, I, Li Fugui [1. \"Fatty\" Li Fugui's name in Chinese is  (lǐ fù guì) – Li is a common family name. Fugui means “rich and influential”], have never had a better friend in my whole life.”</p><br/><p>Meng Hao, still standing off in the distance, heard all of this and was amazed. He looked strangely at Fatty, then coughed lightly and stepped forward.</p><br/><p>When he appeared, it seemed Fatty could sense him. He turned his head and caught sight of him, his face full of excitement.</p><br/><p>“Meng Hao, you finally show your face,” he said eagerly. “Every time I wake up, I call out for you, but you never appear… ah?” His gaze fell onto the two wild chickens, and his eyes grew wide.</p><br/><p>A bit later, fire surrounded the chickens, and a fragrant aroma filled the air. Meng Hao and Fatty sat together, just the same as when they had both been servants. They gobbled down the chicken.</p><br/><p>“I haven’t had wild chicken for two months,” said Fatty, his mouth full of chicken. “How come you haven’t shown your face all this time? Since you always come to help me chop wood, why don’t you bring chickens too?” The joy on his face was clearly apparent as he looked at Meng Hao. It seemed that in his time in the Reliance Sect, he had come to view Meng Hao as a relative.</p><br/><p>Meng Hao gave an enigmatic laugh and offered no explanation. Taking a bite of chicken, he looked at Fatty. It was then he noticed that Fatty’s teeth seemed to be longer than before.</p><br/><p>“How has your Cultivation training been going?” he asked. “Have you been able to sense spiritual energy?”</p><br/><p>“Don’t bring it up,” he said with a deep sigh. “I train every night, but the strange thing is, I haven’t been able to sense even a tiny bit of spiritual energy. The only thing that happens is that my teeth grow. I’m worried I might bite my tongue off.” He looked quite depressed.</p><br/><p>“Open your mouth,” Meng Hao said suddenly. “Let me see your teeth.” What Meng Hao saw shocked him.</p><br/><p>After swallowing a mouthful of chicken, Fatty opened his mouth to reveal a set of long teeth that glittered in the sunlight. As he examined them, Meng Hao’s expression grew even stranger. He almost couldn’t believe it. He could clearly sense spiritual energy fluctuating within Fatty’s teeth.</p><br/><p>“How is Fatty doing his training?” Meng Hao thought. “How could the spiritual energy be moving into his teeth? They’ve become Spirit Teeth? If he keeps training this way, they’ll transform into true treasures…” He shook his head in amazement.</p><br/><p>Time passed, and soon the sun was about to set. Meng Hao and Fatty chatted just as they used to in the old days. He told Fatty all about the things that had happened in the Outer Sect, with the exception of the copper mirror, of course.</p><br/><p>Fatty listened raptly, filled with the desire to reach the first level of Qi Condensation and get promoted.</p><br/><p>When it came time to leave, Meng Hao gave a Spirit Condensation Pill to Fatty. He swallowed it, and then they parted. Fatty watched Meng Hao disappear into the jungle, looking a bit melancholy, assuring himself that he would apply himself diligently to cultivation training.</p><br/><p>He had come by route of the East Mountain, so Meng Hao decided to return by the West Mountain. This was his first time traversing the entirety of the Reliance Sect. By the time dusk fell, he was walking next to a plateau which jutted out from the West Mountain. On the plateau was a massive stone tablet.</p><br/><p>The stone tablet was the color of blood, as if it had been painted with gore. Several characters were carved onto the cold stone.</p><br/><p>Low Level Public Zone.</p><br/><p>There were more characters off to the side, smaller. It explained that the Qi Condensation fourth level disciples were prohibited from entering. Only first through third levels could enter the Public Zone.</p><br/><p>Looking up, Meng Hao could see the multiple figures interlocked in combat. Many techniques were being used as they fought desperately. Blood sprayed in all directions, and miserable cries rang out. An arm was lopped off, a bag of holding snatched.</p><br/><p>As he watched, someone rushed down the mountain, screaming, followed by a huge man with a hideous grin.</p><br/><p>“Help me!”</p><br/><p>“Who can save you from Cao?!”</p><br/>\n</div>"}