{"title": "Chapter 23: An Ancient Beast!", "id": 23, "volume": 1, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-23-an-ancient-beast", "volume_title": "Volume 1", "body": "<h1>Chapter 23: An Ancient Beast!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 23: An Ancient Beast!</strong></p><br/><p>As Meng Hao sat in secluded meditation in the small mountain fissure, rumors about what had happened regarding the Dry Spirit Pill began to ripple out. This was especially true when Zhou and Yin returned. Many people saw them, but of course none dared to ask about who had ended up with the Dry Spirit Pill.</p><br/><p>Because Meng Hao didn’t appear, rumors began to spread that he had died.</p><br/><p>At that exact same moment, Wang Tengfei stood with hands clasped in his Immortal’s Cave on the East Mountain. The mountain breeze caused his hair to waft about and his long robe to rustle. He seemed exceedingly perfect in every way, especially his face, which was so beautiful and flawless that it could send women mad.</p><br/><p>As a matter of fact, a mere nod of his head could drive crazy not just the young female Cultivators of the Reliance Sect, but of the Cultivation World of the entire State of Zhao.</p><br/><p>His gentle eyes, amiable disposition, beautiful features, superb latent talent, refined Cultivation base, astonishing family background… all of it seemed to prove that Wang Tengfei deserved to be Chosen, which in turn caused people to respect him even more. He was blessed by heaven.</p><br/><p>He stood there, an enchanting smile on his face, his eyes seemingly filled with stars as he stared off into the distance. His gaze seemed to almost bore directly through the mountain ranges to fall directly onto the black mountain filled with Demonic beasts.</p><br/><p>He stared for a long time, his eyes flickering with an indiscernible excitement.</p><br/><p>“The time has come,” he said, his smile light but his heart afire. “I spent three years digging through the ancient records, then another year searching high and low throughout the State of Zhao. After that, I waited for two more years here in the Reliance Sect. Finally, today has arrived. Before the Winged Rain-Dragon died, it flew to this place.</p><br/><p>“I never imagined that the two most important things to me would relate to the Reliance Sect. Is my destiny really to be realized here? After the current matter is ended, I will enter the Inner Sect and being my plans regarding my Foundation Establishment.” His smile grew even more enchanting.</p><br/><p>“Elder Brother Wang, we are prepared,” said a man who stood behind Wang Tengfei. His Cultivation base was at the fifth level of Qi Condensation. He spoke with utmost respect. “Even the members of the other Sects are assembled according to your requirements. We shall certainly succeed. Unfortunately, Shangguan Song hasn’t returned, and we don’t know where he is. It’s not certain whether or not he was able to invite Master Uncle Shangguan.”</p><br/><p>“Very well,” said Wang Tengfei with a smile. “We’ve been preparing for this matter for a long time. According to my deductions, the Demonic python is almost at the end of its two-year shedding period. The moment it completes the process, it is at its weakest.” His eyes grew brighter. Not only had he spent years in preparation, he had been required to pay the price of four valuable treasures, as well as tens of thousands of Spirit Stones, to prepare the spell. Even for him, it was a price which could only be paid once. As of now, he had nothing left.</p><br/><p>“Don’t worry, Elder Brother Wang. We will definitely succeed. Allow Junior Brother to congratulate you in advance on acquiring the Core.”</p><br/><p>“Of course we will succeed. I, Wang Tengfei, have never failed.” He laughed, and his expression grew even more resplendent. If the ancient records were correct, he would return with a valuable treasure that would accompany him for the rest of his life, and also an ancient legacy which would allow him to control heaven and earth. As for the Demonic Core, it could have been considered a treasure when it was in its prime. But after all these years, it would have faded, and would not be as effective. However, it could still help him break through from the sixth level of Qi Condensation to the seventh.</p><br/><p>“Tomorrow at dawn, we shall go to the black mountain,” said Wang Tengfei mildly. With a smile, he rubbed his right arm. Hidden underneath the sleeve was a red mark. He rubbed it, and his eyes once again flashed with excitement.</p><br/><p>It was a mark left by a Blood Drop which had fallen onto him from the Heavens when he was six years old. After that day, he was surrounded by a dream in which he flew through the air and became a sovereign of the sky.</p><br/><p>With the Blood Drop had come knowledge of a legacy, as well as a special sense, which, when coupled with the information from the records of two-hundred years ago, had enabled him to find a thread of a clue which had led him here.</p><br/><p>“No one in the entire world except for me could do this. And that is because I am connected to the legacy, and have the Blood Drop, which is unique in the world.” He gazed off toward the black mountain, his smile even more entrancing, filled with anticipation.</p><br/><p>“If this was still the era of Patriarch Reliance, then he would definitely take control of the dragon. But he’s been missing for four hundred years. That is good fortune for me. According to the ancient records, as well as my own investigations, I know that when the dragon came here two hundred years ago, its aura had been suppressed by the treasure. Few people realized that. Even though this is Reliance Sect territory, the area has powerful restrictive spells. Not only was there no aura emanating out, even if there were, no one would have been able to sense it. And even if someone entered the area, their vision would have been blocked by the magic, and they would have been unable to see it.</p><br/><p>“As for the Demonic python, it has spent most of its time in slumber. It was only because of the shedding process that it began to roar and howl. Only when the Demonic python sheds its skin fully will the restrictions dissipate, and it will be safe to enter. Thanks to my Blood Drop legacy, I was able to deduce these matters. No one else understands even the half of it.</p><br/><p>“A valuable treasure, a complete legacy, all there, waiting for Wang Tengfei!” His smile growing wider, he flicked his sleeve and walked back into the Immortal’s Cave. Moonlight circled around him, unwilling to part from him. The mystical scene caused the other Cultivator's expression to be filled with even more veneration.</p><br/><p>The next day at dawn, atop the black mountain, in that virtually invisible fissure, Meng Hao’s entire body had grown crimson red. Sweat poured off him, and massive amounts of black filth oozed continuously out of his pores.</p><br/><p>He had been in mediation for several days, but now his eyes opened. Outside, the roars of the Demonic python grew more intense. It seemed it had reached a critical juncture of its own.</p><br/><p>Meng Hao was not distracted, though. He focused and rotated his Cultivation base. He pushed over and over again, but the fourth-level bottle neck was still there. His eyes red, he swallowed ten Dry Spirit Pills, whereupon his head began to buzz, and his body trembled violently. A loud ripping sound could be heard, and it seemed as if his body were floating like a piece of paper in the wind.</p><br/><p>Inside his body, his Qi and blood vessels sparkled like crystal, nearly transparent, like an otherworldly omen. The spiritual energy in his body whirled, forming a magnificent lake. It wasn’t a big lake, but it was a lake nonetheless.</p><br/><p>The lake, the Core lake, existed in Meng Hao’s dantian region, quite heavy.</p><br/><p>Meng Hao knew that he could control the power and enable it to erupt with the power of the fifth level of Qi Condensation. To a Cultivator who had reached Foundation Establishment, it was weak and insubstantial, but as far as Qi Condensation went, the fifth level was a watershed, the second watershed being the seventh level, followed by the ninth.</p><br/><p>His head buzzed for quite some time. Eventually, Meng Hao slowly opened his eyes, and they glittered like they had before. A burst of popping sounds rang out. He seemed to have grown a bit taller, and though his skin was still dark, a new air emanated from him.</p><br/><p>“The fifth level of Qi Condensation.” Meng Hao took a deep breath, then smiled. He had reached the fifth level of Qi Condensation. Now he could practice the Wind Walking technique. That, combined with flying swords, would give him much greater speed both in movement and attack. It was completely beyond the fourth level.</p><br/><p>“Dry Spirit Pills really are beyond ordinary,” said Meng Hao, looking down at the two Dry Spirit Pills in front of him. “But, they still have their limitations. Perhaps after consuming a lot of them, they will become less effective, just like the pills in the past. I wonder if I will be able to use them to get to the sixth level of Qi Condensation.” As he contemplated this, his expression suddenly changed. The roars of the Demonic python now carried a tone of misery. Booming sounds rang out. Meng Hao leaned forward, and he looked outside of the fissure.</p><br/><p>As he looked, his pupils constricted and his hands clenched into fists.</p><br/><p>Not far away on the mountaintop, was a white-robed youth, extraordinarily beautiful, as if his perfect body was a blessing from heaven. A golden flying sword rotated around him, and the wind blew furiously around as he battled with the Demonic python.</p><br/><p>It was none other than… Wang Tengfei.</p><br/><p>He smiled calmly, and his kind, amiable eyes made him seem like the sun. He seemed to glow, as if he could eliminate all the shadows around him.</p><br/><p>When he attacked, he seemed perfect, as if the Heavens approved his each and every movement.</p><br/><p>Around him were at least nine others, one of whom was Shangguan Xiu. He flicked his sleeves as he took the lead in battling the Demonic python. As for the others, all of them had Qi Condensation levels of the seventh level or higher. All were strangers whom Meng Hao had never seen before. They surrounded the Demonic python, preparing to kill it. Booming sounds rang out, and the python let out astonishing roars.</p><br/><p>Meng Hao stared at Wang Tengfei, not moving a muscle. But deep in his eyes was a dark look that slowly grew, replacing any mildness until it filled his eyes.</p><br/><p>After a short bit of time, the Demonic python’s roars grew more and more miserable, and wounds covered its body. Blood splattered everywhere. This truly was its weakest state. The surrounding Cultivators attacked even fiercerly. Wang Tengfei smiled, as perfect as ever, his eyes filled with an indiscernible excitement.</p><br/><p>He had waited for this day for a long time.</p><br/><p>Suddenly, from to peaks of nine surrounding mountains, shining silvery light coiled up and linked together to form a spell. The spell ever so slowly filled the air, then broke into countless silver threads which then turned into a silver fog that shot down toward the ground. It seemed that they were preparing to seal the Demonic python.</p><br/><p>But, just then, the python looked up toward the Heavens and let out a roar which resounded out over the black mountain, shaking everything. Suddenly, on top of the python’s head appeared the ghostly image of a beast.</p><br/><p>The creature was bright red, with enormous wings and a hideous-looking head. Its sharp claws glittered, and it had a long tail. The instant the phantom appeared, the swirling winds in the sky seemed to change colors, and astonished expressions appeared on the faces of everyone present. Only Wang Tengfei’s eyes appeared more excited. Fortunately, the ghostly image appeared for only a moment, then disappeared.</p><br/><p>When the ghostly image disappeared, the Demonic python shot out of the deep fissure, its body sleek and smooth. It let out a frightening roar and spit reddish mist out of its mouth, an attack which then shot out in all directions. The Cultivators couldn’t avoid it, not even Wang Tengfei, and they could only watch helplessly as it enveloped them, then shot out into the distance. Because of the attack, when the silver fog fell from the sky, it didn’t just fall down upon the Demonic python, but Wang Tengfei and the others as well.</p><br/><p>As the silver fog descended upon them, Meng Hao’s heart began to thump wildly. Before, he had seen a sword sticking out from the Demonic python’s body. But as of now, the sword was nowhere to be seen. Without the slightest hesitation, he leaped up and, moving faster than he ever had in his life, jumped onto a flying sword and shot toward the top of the mountain and the large fissure.</p><br/><p>“Go! Go! Go!” Meng Hao said under his breath. Without any regard for safety, he charged into the fissure-like cave, ignoring the strange odor which filled the air. As he moved deeper into the cave, he saw a massive snakeskin, stuck into which was the small, primitive-looking sword.</p><br/><p>Without even a pause, he grabbed the sword, his heart thumping, face flushed with excitement. Just as he was about to leave, his eyes widened. Despite his extreme level of excitement, he was still able to gasp in shock. The thing really was a python skin, but it was also something else, something shockingly frightening that Meng Hao had never before seen in his life.</p><br/><p>It was … the corpse of a creature. A massive, shriveled corpse, several hundreds of meters long. The black mountain seemed to be hollow inside, and the creature’s corpse filled more than half of it.</p><br/><p>Also visible were two gigantic, mostly disintegrated wings. Despite being dead, the creature’s massive, hideous head was incredibly frightening. This creature looked the same as the ghostly image which had just appeared, and now it was clear that the so-called Demonic python was actually the creature’s tail.</p><br/><p>“A tail that becomes a demon!” said Meng Hao, stupefied. “What Demonic beast is this?! If it’s a Demonic beast… it must have a Demonic Core!” He clenched his jaw. Based on his experience collecting Demonic Cores, it wouldn’t be located in the creature’s belly. Most Demonic Cores were located in the head. He dashed toward the horrific-looking head, and with a swipe of the primitive-looking sword, split it open. Sure enough, inside was a shriveled Demonic Core. He grabbed it, and was about to leave, when suddenly his heart began thumping even harder. From his current position, he could see that beneath the head of the creature’s corpse was a skeleton.</p><br/><p>Who knew how many years the skeleton had lay crushed under the head. Next to the skeleton was a golden-colored bag of holding.</p><br/><p>Blood boiling, Meng Hao suddenly had the feeling that his destiny was thick in this place. He had acquired the sword, the Demonic Core and now a golden bag of holding. He snatched it up, then shot out of the cave like the wind, and then down the mountain, filled with incredible excitement.</p><br/><p>“I’ve struck it rich! This time, I’ve really freaking struck it rich!”</p><br/><p>Meng Hao had only been inside the cave for the space of about ten breaths, and in ten more, he was gone from the mountain. The moment his shadow disappeared, a shape began to descend from the silver fog that hung in the sky. It was a person wearing a white robe; Wang Tengfei. With a flick of his sleeve, he floated down slowly. He looked around for a moment, then sped toward the cave.</p><br/>\n</div>"}