{"title": "Chapter 39: Patriarch Reliance!", "id": 39, "volume": 1, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-39-patriarch-reliance", "volume_title": "Volume 1", "body": "<h1>Chapter 39: Patriarch Reliance!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 39: Patriarch Reliance!</strong></p><br/><p>Meng Hao’s expression changed. He suddenly saw the fog roiling, and then about thirty meters away a shrieking man appeared. He wore a long tattered robe as he charged toward Meng Hao.</p><br/><p>He emanated a fierce heat, which transformed into a ruthless killing aura. Seeing him approach, Meng Hao retreated as fast as possible. This turn of events had happened too quickly. The figure advanced rapidly, and in the blink of an eye it was only nine meters away. Suddenly, it caught sight of the Vorpal Jade in his hand, and its eyes filled with dread and fear.</p><br/><p>Meng Hao’s heart churned. He poured the spiritual power from within his body into the Vorpal Jade, and suddenly it began to glow blood-red. It illuminated the man in the dilapidated robe, allowing Meng Hao to see him clearly. He was middle-aged, his body gaunt, like some sort of evil spirit.</p><br/><p>Blood-curdling screams shot out of his mouth as he retreated. Moving with incredible speed, he disappeared into the fog.</p><br/><p>Sweat broke out on Meng Hao’s forehead, and he took a deep breath. The feeling the middle-aged man gave him was the same feeling he got from Grand Elder Ouyang, boundless and majestic.</p><br/><p>“Don’t tell me he was a Cultivator of the Foundation Establishment stage?” Meng Hao hesitated, remaining on guard. He followed the direction of the blood-red light, moving forward carefully. After about half an hour, he stopped in shock. Several figures had appeared, and each of them seemed to have a Cultivation base equal to Grand Elder Ouyang’s. Some even seemed to be as powerful as Sect Leader He Luohua.</p><br/><p>“Could they be… automatons?” Upon closer inspection, the figures didn’t actually seem to be alive. They floated around him in circles, none of them approaching him, seemingly terrified of his Vorpal Jade.</p><br/><p>Time passed enough for an incense stick to burn, and they slowly disappeared. Meng Hao continued forward numbly, his breathing agitated, a blank look in his eyes.</p><br/><p>“This… this…” he murmured. Ahead of him was a mountain, approximately three hundred meters tall. An ordinary mountain would not cause Meng Hao to act in such away. This mountain was made… of Spirit Stones!</p><br/><p>Countless Spirit Stones piled together to form a Spirit Stone Mountain!</p><br/><p>Meng Hao had never seen so many Spirit Stones in his entire life. His head spun, and he unconsciously wanted to go take them, but after taking a single step forward, he stopped. The Spirit Stone Mountain was gray in color and seemed to be covered with a fine mist. It was a restrictive spell which prevented anything from touching it.</p><br/><p>He struggled for some time, not quite willing to give up. When he reached a position about sixty meters from the Spirit Stone Mountain, he suddenly felt a fierce sense of imminent danger. Looking at the mountain with a sigh, he stopped in place.</p><br/><p>He knew that if he got too close, his body and soul would be reduced to ashes.</p><br/><p>At a loss for a long moment, he turned his head and reluctantly left the Spirit Stone Mountain behind.</p><br/><p>More time passed as he followed the blood-red glow, enough for an incense stick to burn, and soon the hazy image of a building appeared in the fog ahead of him. It had a courtyard, filled with withered plants and weeds. A stone sat in the middle of the courtyard, about half the size of a person. It was the only thing in sight that was neither black nor white, nor was there any fog visible near it.</p><br/><p>The Vorpal Jade floated toward the large stone, then stopped above it. The blood-red glow began to fade.</p><br/><p>Meng Hao walked forward and inspected the area around the stone. This must be one of the areas for enlightenment. He sat down cross-legged onto the stone and looked at the Vorpal Jade floating in front of him. His eyes began to gleam.</p><br/><p>“Throughout all these years, many people have come here, and none have successfully achieved enlightenment. When the blood-red glow of the Vorpal Jade fades, it means the time to attempt enlightenment has arrived.” Meng Hao frowned. A strong desire burned in his heart to acquire the secrets of the Qi Condensation Manual. Originally, Wang Tengfei should have been given this opportunity. But Meng Hao knew that his latent talent was simply ordinary, and he had little chance of success.</p><br/><p>He didn’t allow the Vorpal Jade to fade, but instead looked up at it, a strange light shining in his eyes. After a bit of time passed, he clenched his jaw, then grabbed it stubbornly.</p><br/><p>“This time, I don’t care what happens; I will achieve the enlightenment of the Sublime Spirit Scripture!” Determination filled his voice as he slapped his bag of holding and produced the copper mirror. Grabbing a handful of Spirit Stones, he prepared to begin the duplication process.</p><br/><p>Meng Hao had been a member of the Inner Sect for a month. Inner Sect disciples received significantly more Spirit Stones than Outer Sect disciples. Combine that with his profits from the shop as well as the Outer Sect disciples who were trying to ingratiate themselves to him, it ensured that his bag of holding contained many Spirit Stones.</p><br/><p>But suddenly, his expression changed as he found that the Spirit Stones distributed by the Sect were incapable of duplicating the Vorpal Jade. It wasn’t that the copper mirror had lost its efficacy, but rather that there simply weren’t enough Spirit Stones. Even mid-grade Spirit Stones were useless.</p><br/><p>He stared at the Vorpal Jade for a while before suddenly pulling out seven or eight of the extraordinarily large Spirit Stones he had left. He hesitated for some time, then ground his teeth. Eyes growing red, he put one of the Spirit Stones down onto the mirror, and before he could even put down another piece, the Copper Mirror began to glow with a blinding light, and instantly, fifteen pieces of Vorpal Jade appeared. Meng Hao stared, dumbfounded. Originally, he had assumed he would need multiple Spirit Stones to make it work. But then he ended up with fifteen of the Blood Crystals.</p><br/><p>These were Blood Crystals, congealed from Patriarch Reliance’s own blood. Seeing fifteen of them appear left Meng Hao stupefied.</p><br/><p>“What… what kind of Spirit Stones are these?” He sat in a daze, thinking back to how he had used two thousand of them that time, and his heart ached.</p><br/><p>These large Spirit Stones were definitely some type of extraordinary object.</p><br/><p>For now, the most important thing to Meng Hao was the Sublime Spirit Scripture. He clenched his jaw and set aside the matter of the two thousand Spirit Stones. Extending a Blood Crystal, he caused it to fade. As it did so, the blood red glow settled around Meng Hao and an indistinct voice could be heard. He slipped into a dream-like trance, unaware of the passing of time.</p><br/><p>At this same moment, Xu Qing and Chen Fan, in their respective enlightenment areas, were also surrounded by the blood-red glow. Their latent talent was beyond ordinary, so their chances of achieving enlightenment were somewhat greater. In Patriarch Reliance’s meditation zone, everything was based on latent talent. So-called luck is the same.</p><br/><p>After an indeterminable period of time passed, the red glow around Meng Hao faded, and he began to regain his senses. He seemed to be somewhat at a loss. After some time passed, he had completely recovered, and yet his mind was blank. Not even a scrap of information from the Sublime Spirit Scripture was there.</p><br/><p>He sighed, having anticipated this all along. He took out another Blood Crystal and continued to seek enlightenment. Time passed, and even after having used up fourteen Blood Crystals, he still had not succeeded. His heart ached, and he wasn’t sure if he should continue. Gnashing his teeth, he pulled out another large Spirit Stone and duplicated more of the Vorpal Jade Blood Crystals. Once again, he activated the blood-red glow, which then covered his body as he began to seek enlightenment.</p><br/><p>By this time, the blood-red glow surrounding Xu Qing and Chen Fan had faded. However, they did not rise, instead choosing to remain seated in meditation, not sure when enlightenment might occur.</p><br/><p>As for Meng Hao, he seemed to have gone mad, continuously activating Blood Crystals, trying again and again to achieve enlightenment. Anyone who saw this scene would surely go crazy with jealousy.</p><br/><p>After activating the twenty-seventh Blood Crystal, Meng Hao suddenly heard what sounded like a voice murmuring next to his ear in the dream-like trance world. He could clearly hear two words.</p><br/><p>“Sublime… Spirit…”</p><br/><p>When Meng Hao opened his eyes, they were filled with determination. Without hesitation, he pulled out the twenty-eighth Vorpal Jade Blood Crystal, and once again sought enlightenment.</p><br/><p>By this time, Xu Qing and Chen Fan had returned to the altar to wait for Meng Hao. They were a bit surprised when they didn’t see Meng Hao, but they weren’t sure which direction he had headed in, so they couldn’t easily search for him. They decided to sit in front of the altar and wait for him.</p><br/><p>By the third day, they were beginning to grow impatient and also a bit worried. Of course, they did not even consider that he might have achieved enlightenment, but rather worried that some sort of accident had befallen him.</p><br/><p>“Did something happen to Junior Brother Meng?” said Chen Fan worriedly.</p><br/><p>Xu Qing didn’t respond, but she looked worried.</p><br/><p>After a bit of discussion, they decided to begin looking for him. Unfortunately, because of the frequent appearance of the automatons, their search went quite slowly.</p><br/><p>Meanwhile, Meng Hao sat, hair disheveled, eyes bloodshot, murmuring to himself. His words made no sense; they seemed to simply express his desire for the Sublime Spirit Scripture. He pulled out the forty-third Blood Crystal, and the thick, red glow again surrounded him. In fact, the area he was in never lacked the red glow. Meng Hao had gone all out in his search for enlightenment. If he ran low on Blood Crystals, he simply duplicated more.</p><br/><p>As of now, he could clearly hear the voice in his ear, but just couldn’t commit it to memory. He could only continue on in another attempt.</p><br/><p>There was something that nobody, not Chen Fan or Xu Qing, nor frenzied Meng Hao, had noticed. After the Blood Crystal ceased to glow, it would transform into a barely discernible blood-red light, which would then enter into the ground and pass into a secret chamber below the catacombs.</p><br/><p>There, a withered body sat cross-legged, seemingly lifeless. The room was filled with the feeling of death.</p><br/><p>Every time one of the blood-red lights entered the room, the body would assimilate it, and begin to change slightly. By the time the third light entered the body, there seemed to be some shred of life in it.</p><br/><p>The light of life was dim, though, and the body was unable to do anything except sit there.</p><br/><p>This was Patriarch Reliance. The Vorpal Jade Blood Crystals were congealed from his own blood, and contained his aura. After being activated, they would return to him, continuing his life. Without them, he would be thoroughly dead.</p><br/><p>Originally, he had planned to postpone his death in this fashion, until the very last spark of his ruthless and ambitious life was extinguished, where upon he would pass into death. He was already in a state of despair. He spent most of his time in deep sleep, awaking only occasionally, and briefly, whereupon he would sink back into slumber. He had no energy to waste on superfluous matters.</p><br/><p>As for the Vorpal Jade, this was an arrangement he had prepared many years ago. Were it not for them, he would have passed into death hundreds of years ago.</p><br/><p>“These are the last three pieces of Vorpal Jade…” Now that they had returned, he had regained consciousness. He sighed and went back to sleep, knowing that he would probably never wake up again.</p><br/><p>And yet suddenly, a fourth blood-red light entered the secret chamber and fused with his body. He woke again, shocked.</p><br/><p>“I am… already out of Vorpal Jade. Could I have remembered incorrectly… Hm?” Even as he talked to himself, a fifth blood-red light appeared, making its way into his body.</p><br/><p>He observed, dumbstruck, as a sixth, seventh, eighth blood-red light appeared… By the third day, countless blood-red lights had appeared, one after another, continuously fusing with his body. Patriarch Reliance’s heart surged with excitement, and his face filled with hope. Suddenly, his eyes opened.</p><br/><p>“These… holy hell, these are clearly not my blood, but they are definitely my Blood Crystals. What’s going on? What the hell is going on?”</p><br/>\n</div>"}