{"title": "Chapter 33: Is This Sword Yours Too?", "id": 33, "volume": 1, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-33-is-this-sword-yours-too", "volume_title": "Volume 1", "body": "<h1>Chapter 33: Is This Sword Yours Too?</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 33: Is This Sword Yours Too?</strong></p><br/><p>Wang Tengfei glared at Meng Hao with cold eyes, then took a step forward. He slapped his bag of holding, and two glittering beams of light shot out. Two magical treasures appeared, one a stone tiger, the other a stone aquatic dragon.</p><br/><p>They were accompanied by two sounds which reverberated across the square, one, the roaring of a tiger, the other, the howl of a aquatic dragon. The treasures immediately transformed. The first became a white tiger, a few dozen meters in length, the other, a magnificent aquatic dragon. They circled around Wang Tengfei, making him look even more imposing.</p><br/><p>“You can refuse to admit it, but that sword is mine,” said Wang Tengfei, his voice ghastly. “I never agreed to let you have it and you are not permitted to leave with it.” His fingers moved in an incantation pattern, and the white tiger roared and leaped toward Meng Hao. The aquatic dragon howled as it followed, its body becoming a streaking rainbow.</p><br/><p>Meng Hao moved backwards, waving his right hand. The wooden sword flashed forward, followed by a Wind Blade and a Flame Python.</p><br/><p>A boom reverberated out and Meng Hao coughed up a mouthful of blood. As he flew back, he saw Wang Tengfei walking out from the explosion, his snow-white robes and long hair floating in the wind, a look of murder on his beautiful features. His eyes shone forth with ridicule.</p><br/><p>“Absurd!” said Meng Hao. “You clearly see that the sword is extraordinary, so you want to use the Inner Sect training as an opportunity to rob it from me!”</p><br/><p>“It’s useless to keep talking. I will kill you today, and then you will know that you aren’t qualified to take things which belong to Wang Tengfei.” His eyes cold, he waved his hand again; roaring and howling, the white tiger and the aquatic dragon once again charged Meng Hao.</p><br/><p>“One-of-a-kind? The only one like it in the world?” Meng Hao laughed, his eyes sneering. He made no attempt to hide the cold ridicule. “Why don’t you take a look and see if the sword really is one of a kind like you say?” His left hand slapped his bag of holding, and a black beam shot out to circle around Meng Hao. A loud humming sound rang out, like that of a sword. It was his duplicate copy of the wooden sword!</p><br/><p>Now that it had appeared, two wooden swords swirled around him. They looked exactly the same in every aspect, their sword auras shining brightly and with immense power.</p><br/><p>When he laid eyes on the second wooden sword, Wang Tengfei’s body shook and his eyes went wide, filled with disbelief. His mind dissolved into chaos, and he felt as if he had just been crushed by an entire mountain. He immediately lost control of the white tiger and the aquatic dragon.</p><br/><p>“This… this…” His head spun. This unexpected turn of events had caught him completely off guard. He didn’t know what to think, and couldn’t even control his mind.</p><br/><p>“Is this sword yours too?” Meng Hao’s eyes flashed, and he stepped forward, suddenly radiating the power of his Cultivation base. “Is this your one-of-a-kind sword?” He took another step forward.</p><br/><p>Wang Tengfei couldn’t answer. Feeling the pressure of Meng Hao’s spirit, he involuntarily took two steps backwards.</p><br/><p>“Is this the only sword like it in the whole world?” Meng Hao’s eyes flickered as if with lightning. He continued moving forward, as if all the power he possessed were supporting him.</p><br/><p>Wang Tengfei’s face grew pale, and he continued to retreat.</p><br/><p>“Wang Tengfei, these two swords are Meng Hao’s! My swords of heaven and earth!” Eyes burning, Meng Hao leaped into the air, incantation patterns flashing in his hands. The two wooden swords glowed brightly, shooting toward the white tiger and the aquatic dragon.</p><br/><p>A boom rang out as the white tiger was broken to pieces and the aquatic dragon shattered. Filled with power that seemed capable of destroying anything in the world, the two wooden swords shot toward Wang Tengfei.</p><br/><p>Seeing them approach, Wang Tengfei suddenly lifted his head. He slammed his right hand down onto the ground, and a massive incense stick appeared. As it burned, tendrils of smoke curled up and then shot in Meng Hao’s direction. As they moved, they transformed into two figures which slammed into the two wooden swords. A thunderous boom sounded out.</p><br/><p>The incense stick was smashed, and the wooden swords retreated back to Meng Hao, who spat out a mouthful of blood. He watched as Wang Tengfei moved forward through the smoke. He didn’t walk on the platform, but rather flew through the air, carried forward by tendrils of smoke. He looked at Meng Hao with a strange expression, then eyed the two wooden swords. At the moment, he was still completely at a loss about them, and had begun to doubt himself.</p><br/><p>According to his research in the ancient records, the wooden sword really was unique in heaven and earth. There could not be a second one. Regardless of that, the sword was exactly the same one he had seen before, except now there were two…</p><br/><p>Meng Hao looked at Wang Tengfei soaring through the air and let out a cold snort. He slapped his bag of holding and two ordinary flying swords appeared. He stepped forward onto them, and they carried him flying into the air. This caused quite a stir amongst the observing Cultivators.</p><br/><p>“Only Cultivators who have reached Foundation Establishment can fly. But look, he’s flying…”</p><br/><p>“Brother Wang has some magical item that lets him fly temporarily, but Meng Hao… he’s not sparing any spiritual energy at all. He’s using the flying swords to fly.”</p><br/><p>Killing intent flickered in Wang Tengfei’s eyes as he stared at Meng Hao. He put the matter of the wooden swords out of mind. Regardless of whether or not these were the treasures he had sought, he would take them away.</p><br/><p>As the killing intent filled the air, Wang Tengfei slapped his bag of holding, and a strip of yellow paper appeared in front of him, a talisman. Its surface was inscribed with various mystical patterns, and it emitted a strong spiritual pressure. It shined with a golden light. This talisman appeared to be quite different than the one Han Zong had used.</p><br/><p>“If you allow me to take the treasure, you can feel some pride when you reach the yellow springs of the underworld,” said Wang Tengfei, glaring at Meng Hao. He felt somewhat distressed. This talisman was the last magical item in his bag of holding. He had spent everything else he possessed in his search for the wooden sword.</p><br/><p>He would not have used the talisman were it not necessary. Normally, it could be used three times. But with the level of his Cultivation base, he could only use it once. Even still, it was powerful, enough to slay a Cultivator of the eighth level of Qi condensation.</p><br/><p>Glaring coldly at Meng Hao, Wang Tengfei suddenly lifted his right hand and waved it in front of him. At the same time, his spat out some of his spiritual energy, transferring it to the talisman.</p><br/><p>The talisman glowed with immeasurable brightness; as Meng Hao flew through the air, he looked down at it, and suddenly felt a stabbing pain inside him.</p><br/><p>It was at this moment that Wang Tengfei’s face changed. He suddenly realized that he didn’t have enough spiritual energy… In fact, he now noticed that the spiritual energy in his body was continuously draining out through his wounded finger.</p><br/><p>Because he had been enraged upon seeing the first wooden sword, then shocked and confused by the second, he hadn’t sensed it until now. As of now, there was not enough spirit energy to fully activate the talisman, and not enough time to consume medicinal pills to replenish himself.</p><br/><p>“Even though the talisman can’t be fully utilized, it’s still strong enough to kill someone of the sixth level of Qi condensation. Killing you will be as easy as falling off a log!” With no hesitation, he flung the talisman out. It suddenly appeared to be a golden sun which shot toward Meng Hao.</p><br/><p>At this life-and-death juncture, a strange light appeared in Meng Hao’s eyes. Even as he flew through mid-air, he suddenly caught a glimpse of the dream he had experienced the day he consumed the Flying Rain-Dragon’s Demonic Core. In the dream, he had looked down into a lake and seen the reflection of the ancient Flying Rain-Dragon. Now, he could see the same thing again.</p><br/><p>“A sovereign of the sky…” Meng Hao felt as if he were filled with good fortune. He closed his eyes, and as the golden sun summoned by the talisman approached, the Demonic Core which rested in his Core lake began to shudder. Then, a massive force of spiritual power burst out, filling Meng Hao’s body and causing him to snap his hands out in front of him.</p><br/><p>All of the various swords laying around, which he had previously lost control off, suddenly began to shake, then lifted into the air and sped toward Meng Hao. At the same time, the rest of the flying swords in his bag of holding flew out, along with the rest of the various magical items he possessed. They began to merge together, glowing with an intense brightness. All of this was happening, not because of Meng Hao’s spiritual energy, but because of the Demonic Core’s!</p><br/><p>For some reason, the Demonic Core had suddenly been stirred into action, and its eruption had utilized some sort of underworldly power to control the nearly one hundred flying swords and magical items. In the blink of an eye, they had merged together to form… an ancient Flying Rain-Dragon!</p><br/><p>Its form was somewhat indistinct, perhaps indistinguishable to the onlookers. Even Wang Tengfei wasn’t aware of it, now that he had lost his Blood connection to the Legacy. Only Meng Hao could sense it.</p><br/><p>The two wooden swords were the Flying Rain-Dragon’s fangs. It let out a roar filled with the power of heaven and earth then charged toward the talisman. As soon as they met, a thunderous explosion rang out which shook the entirety of the Reliance Sect. The surrounding Outer Sect disciples retreated backward, nearly deafened. Some of the disciples with low-level Cultivation bases were nearly knocked senseless.</p><br/><p>Both the talisman and the Flying Rain-Dragon contained power far beyond the sixth level of Qi condensation. When they smashed into each other, even someone of the seventh level would be shaken. Only someone of the eighth level might possibly be able to withstand the power.</p><br/><p>As the reverberations from the explosion rang out, the golden sun faded rapidly, and the Flying Rain-Dragon began to fall apart. Layer by layer, one sword, ten swords, one hundred swords… they slowly fell, along with the other magical items which had merged together to form the dragon. They fell and transformed to ash, which drifted away in the wind.</p><br/><p>The talisman slowly faded away, and the magical items forming the Flying Rain-Dragon disappeared… but not the two wooden swords. Instead, they shot forward toward pale-faced Wang Tengfei.</p><br/><p>Wang Tengfei watched as the swords approached, stabbing toward his chest. Just as they were about to plunge into his heart, a light, sighing voice could be heard descending from the East Mountain.</p><br/><p>“Very well, there’s nothing left to do.” Along with the sigh came a gentle force which appeared next to Wang Tengfei, blocking the wooden swords. Wang Tengfei was lifted up and pulled back, off of the platform and down onto the square. He coughed up blood, his eyes blank and confused. He couldn’t believe it… he had lost.</p><br/><p>He Luohua had appeared on the platform. Grand Elder Ouyang immediately saluted him with clasped fists. “Greetings, Sect Leader.”</p><br/><p>A buzz arose among the surrounding Outer Sect disciples. Each and every one greeted the Sect Leader and saluted respectfully.</p><br/><p>Meng Hao looked pale. His spiritual energy was completely dried up. If the Flying Rain-Dragon’s Demonic Core had not exercised its power, he would not have been able to continue. His bags of holding were now completely empty of any magical items. As far as he was concerned, this battle had been a bitter one indeed.</p><br/><p>Although he wasn’t quite willing to let Wang Tengfei continue to live, with the Sect Leader here, he had no choice. He would not be able to kill Wang Tengfei this day.</p><br/><p>Without a word, he descended onto the platform, his stubborn personality forcing his body to remain upright. He took a few steps forward, then reached down to pick up the Wang Tengfei’s talisman, which had drifted to the ground, and placed it into his robe. Then he lifted his head and looked at He Luohua.</p><br/><p>“In this match, Meng Hao is the winner,” said He Luohua, looking at Meng Hao with a slight smile. “From this day forth, he is the third member of the Reliance Inner Sect.” His words rang out over the silent square. The minds of the onlookers were still reeling, the details of the battle replaying in their heads.</p><br/><p>Wang Tengfei looked confused, and when he heard He Luohua’s words, he let out a bitter laugh. He looked around at the crowd, who already seemed to have forgotten him, and his heart filled with regret. He laughed again, then coughed up some blood, and collapsed into unconsciousness.</p><br/><p>As he collapsed, Meng Hao bit down hard on his own tongue. He saluted He Luohua, then sat down cross-legged and began to meditate.</p><br/><p>Grand Elder Ouyang looked at him, his eyes filled with admiration. He slapped his own bag of holding and produced a medicinal pill, which flew forward toward Meng Hao. Meng Hao grabbed it and popped it into his mouth.</p><br/><p>He was exhausted to the extreme. Despite his eyes growing dim, he continued on with his breathing exercises, slowly attempting to recover.</p><br/>\n</div>"}