{"title": "Chapter 36: The Perks of the Inner Sect", "id": 36, "volume": 1, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-36-the-perks-of-the-inner-sect", "volume_title": "Volume 1", "body": "<h1>Chapter 36: The Perks of the Inner Sect</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 36: The Perks of the Inner Sect</strong></p><br/><p>Half a month passed, during which Meng Hao spent most of his time sitting cross-legged in the Sect’s Magic Pavilion, studying the ancient records. Now he had a much deeper understanding of the State of Zhao and the Southern Domain.</p><br/><p>He had even discovered a hand-drawn map of the sprawling lands of South Heaven, which showed the Great Tang in the Eastern Lands, the Northern Reaches with its Qiang Di flutes, the Barbarian Western Lands, and of course the Southern Domain, where he was currently located.</p><br/><p>The whole world was neatly displayed on the map, and its image was now burned into Meng Hao’s brain. The Southern Domain comprised a vast section of the lands of South Heaven, whereas the State of Zhao was just a tiny dot on its perimeter.</p><br/><p>“The Southern Domain is so big that it could hold thousands of the State of Zhao…” He looked out at the blue sky outside the Magic Pavilion, his eyes filled with a fascinated look.</p><br/><p>“So it turns out that traveling to the Great Tang in the Eastern Lands isn’t that simple. You have to cross the Milky Way Sea…” After a while, Meng Hao looked back down at the map, looking at all the four major regions of the lands of South Heaven. The Eastern Lands and the Northern Reaches formed a subcontinent, separated from which by a large ocean were the Western Barbarian Lands and the Southern Domain, which formed another subcontinent.</p><br/><p>When the sun began to fall behind the western mountains, and dusk approached, Meng Hao rubbed his eyes, returned the map to its place, and left the Magic Pavilion. He looked off into the distance toward the east for a while, then turned and headed back to his Inner Sect Immortal’s Cave.</p><br/><p>Inside the Immortal’s cave, the luminescent pearls inlaid into the ceiling emitted a soft light onto the light green walls. There were five stone rooms, and a gurgling Spirit Spring, filling the cave with dense Spiritual Energy. This was a perk available only to disciples of the Inner Sect. Meng Hao entered and sat cross-legged onto a slab of white jade. It was not made of Spirit Stone, but meditating upon it helped one’s mind to be clear, and was a relatively rare treasure.</p><br/><p>This also was something only for Inner Sect disciples.</p><br/><p>“Only Inner Sect disciples can truly be considered members of the Reliance Sect,” thought Meng Hao, quietly looking around. The light green stone walls were carved with various birds and beasts, each of which seemed to be filled with deep meaning. Even looking at them left one feeling refined.</p><br/><p>“These are very different perks from those in the Outer Sect. This is in order to emphasize the outstanding qualities of Inner Sect disciples. Just like in the mortal world, there is a division of layers. By struggling, one can surpass the Outer Sect. After that, if one wishes to become exalted, one must become stronger!</p><br/><p>Soon, dusk fell, and then Meng Hao heard a respectful voice from outside.</p><br/><p>“Elder Brother Meng, Li Fugui from the foot of the mountain requests an audience.” It was the voice of a boy, a servant. After Meng Hao had joined the Inner Set, this boy had been assigned to help him care for his daily affairs.</p><br/><p>This was yet another perk of life in the Inner Sect. At first, Meng Hao had a hard time getting used to it. He had never had someone waiting upon him before. But when he saw Elder Brother Chen’s servant helping him, it was easier to accept. However, he still held firm to his desire to grow stronger.</p><br/><p>Only the strong can have power over others, and prevent others from controlling them. The law of the Cultivation world and rules of the Reliance Sect were the same. It was not reasonable or fair, but it existed, and that was the way of life.</p><br/><p>Existence was truth. The world is fundamentally unreasonable, and naturally, there is no true fairness.</p><br/><p>“Send him in,” said Meng Hao coolly. Filled with reverence, the young servant complied. After being assigned to wait upon Meng Hao, his very life belonged to him.</p><br/><p>Shortly thereafter, Fatty entered, clicking his teeth and striding with long steps. This was not his first time to visit, but rather his third. Every time he came, he was filled with excitement. This was not a place Outer Sect disciples could visit without the consent of the person they called upon.</p><br/><p>The young servant led Fatty in respectfully. Fatty looked around, rubbing his hands along various items in wonder, even the white jade slab that Meng Hao sat on.</p><br/><p>“It’s not your first time here,” said Meng Hao with a laugh, watching him.</p><br/><p>“Meng Hao, this place is just too amazing. Every time I come, I just can’t control myself. The Immortal’s Cave of an Inner Sect disciple. It’s a place of legend! You know, after the last time I came here, a bunch of Outer Sect disciples crowded around me asking all sorts of questions. I’m important now!” His body trembled, and it took a moment for him to stop thinking about it. He sat down in front of Meng Hao.</p><br/><p>“If you’d like, I can request for Wang Tengfei’s Immortal’s cave to be given to you.”</p><br/><p>“That… that would be incredible,” said Fatty, looking excited, but at the same time a bit shy.</p><br/><p>“Zhao Hai,” said Meng Hao coolly. He waved his right hand, and the main door opened. The young servant rushed in and gave Meng Hao a deep salute.</p><br/><p>He looked to be about fourteen or fifteen, close to Fatty’s age. He had delicate features, and had only arrived on the mountain recently. It was said he was from the same village as Little Tiger, and that his family was rich.</p><br/><p>“Take my spirit tablet to the Cave Dispensing Pavilion and retrieve the jade slip to Wang Tengfei’s Immortal’s Cave.” He waved his hand, and a white jade slip flew out into the young servant’s hand.</p><br/><p>The young servant accepted the assignment, then left with a respectful expression on his face.</p><br/><p>“Meng Hao, when are you going to come down off the mountain?” asked Fatty eagerly. “I promised the Outer Sect disciples you would go to inspect them. You can’t go back on your word, I promised them.”</p><br/><p>“Grand Master Ouyang said that I would preside over the next Pill Distribution Day,” he said with a smile. “I believe that would be the day after tomorrow.” The two of them had entered the Sect together, three years ago. A deep friendship had long since grown between the two of them.</p><br/><p>“Great, the day after tomorrow it is. Oh, right, our business has been doing well in the past half month. I already separated out your 80%.” He handed a bag of holding to Meng Hao, looking pleased with himself. It seemed he too understood the meaning of the Reliance Sect. With Meng Hao to rely on, who in the Outer Sect would dare to even say one wrong word to him?</p><br/><p>Even better, the beautiful female disciples of the Outer Sect had begun to fawn over him until he fairly floated in the air. For the moment, Fatty was quite popular.</p><br/><p>“Has Shangguan Xiu caused you any problems recently?” asked Meng Hao suddenly, his eyes flashing.</p><br/><p>“Nobody has seen that bastard recently,” replied Fatty, his voice becoming grave. “I’ve assigned a disciple to do some spying for me, and he said that Shangguan Xiu sits in secluded meditation all day. He never comes out.”</p><br/><p>“Just be careful,” he warned, and not for the first time. “If anything happens, snap the message token I gave you.”</p><br/><p>Soon, the young servant Zhao Hai returned with the jade slip to Wang Tengfei’s Immortal’s Cave. Meng Hao gave it to Fatty. The two of them laughed and chatted deep into the night. It seemed Fatty didn’t want to leave. In fact, he seemed to be growing more excited.</p><br/><p>Meng Hao was surprised at this, but when he remembered what day it was, and laughed.</p><br/><p>“Today is the day Medicinal Fruits are distributed in the Inner Sect,” said Meng Hao.</p><br/><p>Fatty licked his lips and nodded, his heart filled with envy at the differences between the Inner and Outer Sect disciples. Every month Medicinal Fruits were distributed, a special type of Spiritual Fruit infused with Medicinal Pills. The fruit itself tasted like a Medicinal Pill, but was much more effective than ordinary Medicinal Pills.</p><br/><p>Inner Sect disciples received the fruits once per month.</p><br/><p>After the time it takes an incense stick to burn, the young servant Zhao Hai entered. He actually despised Fatty, but didn’t show even the slightest hint of it on his face. In his hands he carried the Medicinal Fruits, wrapped up in a large green leaf.</p><br/><p>A delicate aroma wafted out from it, causing Zhao Hai to swallow deeply. He put the fruits down and then left.</p><br/><p>When the large leaf was removed, the medicinal fragrance filled the air. Inside the leaf were two small, semi-transparent, light-red fruits. They seemed so delicate that they might break if you touched them. Inside each one could just barely be seen a medicinal pill.</p><br/><p>Fatty’s eyes went wide. He had never eaten Medicinal Fruit before, but had heard it mentioned recently by some Outer Sect disciples. After making some enquires, he had discovered the distribution date, and so had hurried eagerly to visit Meng Hao. He picked up one of the fruits and put it into his mouth. He bit down, then swallowed, and a delicious flavor filled his mouth. Then, a hot sensation filled his head and spread out through his whole body.</p><br/><p>“Amazing, amazing. I must be the first Outer Sect disciple to ever eat a Medicinal Fruit. When word gets out, the girls will be envious to death. Everyone will be envious of Master Fatty’s good fortune.” It suddenly seemed as if he had remembered something, and he snapped his mouth shut, not letting any of the fragrant aroma escape. Using his hands, he signaled to Meng Hao that he needed to leave, then ran off.</p><br/><p>“I have proof!” he thought. “I have to find some of those female disciples and let them smell it.” The more he thought about it, the more excited he got, and he raced down the mountain even faster.</p><br/><p>Fatty’s clever plan was obvious, causing Meng Hao to laugh. He slowly placed the remaining Medicinal Fruit into his mouth. It tasted delicious, filled with dense Medicinal flavor.</p><br/><p>“This is something else that Inner Sect disciples…” As he ate the Medicinal Fruit, he sighed. This life was not something that Outer Sect disciples could enjoy. If he wanted to, he could simply make a gesture, and any of the beautiful female disciples would instantly become devoted to him.</p><br/><p>Soon, two days had passed, and Pill Distribution Day arrived. Meng Hao walked out of his Immortal’s Cave, followed closely by the young servant Zhao Hai. In his hand he carried a purple bag of holding, which was filled with Spirit Stones and Medicinal Pills to be distributed.</p><br/><p>A mountain breeze welcomed the dawn as Meng Hao descended the mountain. Along the way, the Outer Sect disciples he ran into would look at him in surprise, then stop and give him a deep salute with clasped hands.</p><br/><p>“Greetings, Elder Brother Meng.”</p><br/><p>“Elder Brother Meng is as elegant as ever. I haven’t seen you in many days, Junior Sister has missed you.”</p><br/><p>“Greetings, Elder Brother Meng. Your latent talent is spectacular, your Cultivation base astonishing. You will definitely be a pillar of the Sect.”</p><br/><p>Amidst all the flattery Meng Hao walked along until he reached the square, which was already filled with a good number of disciples. Catching sight of him, they saluted, and then the air filled with their flattering words.</p><br/><p>He nodded, smiling, then leaped up, carrying Zhao Hai with him onto the platform. This was not his first time here, but it was his first time to distribute Medicinal Pills.</p><br/><p>His gaze swept across the crowd. Every single person’s face was filled with reverent devotion. Gradually, Meng Hao’s face grew distracted, and he thought back to his first Pill Distribution Day, and then to the time Wang Tengfei had humiliated him. Many memories flitted through his mind.</p><br/><p>Finally, he heaved a deep sigh, and said, “Sound the bells.”</p><br/>\n</div>"}