{"title": "Chapter 41: A Sensation in the State of Zhao!", "id": 41, "volume": 1, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-41-a-sensation-in-the-state-of-zhao", "volume_title": "Volume 1", "body": "<h1>Chapter 41: A Sensation in the State of Zhao!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 41: A Sensation in the State of Zhao!</strong></p><br/><p>When the sign appeared in the sky above the Reliance Sect, all of the disciples in the Outer Sect stared up in awe and shock, their minds buzzing. Their eyes filled with vacant looks, unable to comprehend what they were seeing.</p><br/><p>Looking at the golden characters filling the sky, their hearts trembled. Fatty, who was filing his teeth with the fish-scale sword, made choking sounds, narrowly avoiding stabbing himself in the tongue as he gaped at the scene.</p><br/><p>Shangguan Xiu, who sat in secluded meditation, suddenly lifted up his head. When he saw what was happening, his body began to tremble, and his eyes shined with disbelief. His face changed, as if he had suddenly just thought of something incredibly frightening. He stood in a flash, and suddenly, a teleportation spell appeared that he had prepared years before.</p><br/><p>As fast as possible, he stepped into the spell, then disappeared.</p><br/><p>In the main temple hall on the East Mountain, as Meng Hao and the others appeared, He Luohua’s face fell. Looking up into the sky, his face grew pale, and he staggered backwards a few paces.</p><br/><p>Grand Elder Ouyang raced out of the main temple, looking up into the sky, his face grim.</p><br/><p>“Did you touch anything in the Patriarch’s meditation zone?” he asked, turning to look back at them. His expression was very solemn, as was his tone of voice.</p><br/><p>“When we were just about to leave, a stone stele appeared,” said Chen Fan, sounding pained. “We were worried that if we brought it out with us, it could bring disaster to the Sect. So instead, we made copies of it.” He took out his jade slip, as did Meng Hao and Xu Qing. They handed them to Grand Elder Ouyang.</p><br/><p>“This is…” Grand Elder Ouyang’s brow furrowed, and then his eyes shone with disbelief.</p><br/><p>“There’s no need to study it, it’s fake,” said He Luohua with a long sigh. “The stone stele as well as the sign in the sky. They’re both fake.” He looked down at the ground, then shook his head.</p><br/><p>“Other Sects from the State of Zhao will be arriving soon. The Reliance Sect will not be able to evade this disaster. They’re here for the Patriarch.” He flicked his sleeve, and a rumbling could be heard throughout the entire Reliance Sect. A soft light arose, covering everything.</p><br/><p>“You three are Inner Sect disciples, go wait in the main temple hall.” Just as his voice sounded out, blurs of light whizzed through the sky from all directions, nearly twenty of them, accompanied by high-pitched whistling shrieks.</p><br/><p>The blurs approached the shield which surrounded the Reliance Sect, and as they did, heaven and earth shook. The four mountain peaks trembled as if they might collapse. Silence suddenly filled the surrounding wild mountains. The wild beasts all trembled in fear, not daring to make even a single sound.</p><br/><p>Of the twenty or so people in the sky, there were six who formed the nucleus of the group. Four were men and two were women, and they were all elderly. They wore luxurious gowns, and the power which emanated from their Cultivation bases was petrifying.</p><br/><p>Each of these six people had two or three Cultivators behind them, followers, each of whom had Cultivation bases on par with Grand Elder Ouyang. These nearly twenty people were the most powerful people in all the State of Zhao, and here they were at the Reliance Sect, bearing down on it like dark clouds.</p><br/><p>“Reliance Sect!” a voice boomed out, billowing like thunder. The buildings which comprised the Outer Sect seemed as if they would collapse at any moment. Large amounts of Outer Sect disciples coughed up blood, fear covering their faces.</p><br/><p>“The Cold Wind Sect is powerful,” said He Luohua with a harrumph. His voice rang out like a thunderclap as he stood there on the mountain’s peak, suppressing the voice which had just spoken. He raised his right hand, and a hum sounded out as an invisible wind sprang up. It shot toward the person who had just spoken, surrounding him, suddenly turning black and transforming into a massive shapeless mouth that seemed about to swallow up the Core Formation stage Cold Wind Sect eccentric. The man’s face changed, and he retreated quickly without hesitation.</p><br/><p>“Enough, enough,” said one of the powerful Core Formation experts, looking down at He Luohua. His voice was light but filled with suppressive power. He wore a long, purple robe embroidered with images of flutes. Frowning, he raised his hand, and the shapeless black wind dissipated. “Fellow Daoist He, the sign in the heavens came from your Reliance Sect. Please hand it over to us.”</p><br/><p>A deathly silence filled the Outer Sect, as the disciples felt the shadow of death looming over them. Within the main temple hall, Meng Hao, Chen Fan and Xu Qing sat silently. They knew that any one of the people outside had Cultivation bases so frightening they could annihilate all of them with the wave of a hand.</p><br/><p>Meng Hao’s heart thundered as he looked at them. It was his first time seeing people so powerful. His thoughts suddenly filled with an intense desire to become more powerful.</p><br/><p>He Luohua stood on the peak of the East Mountain, looking up at the group of people. After some time passed, he sighed.</p><br/><p>“What do you want me to hand over? I have no idea where that sign came from.”</p><br/><p>“Give in without a fight,” said the man in the purple robe grimly. “Disperse the Reliance Sect’s grand protective spell. Allow us to search freely. This is what we mean by handing it over. If you don’t, then despite the fact that we are fellow Cultivators of the State of Zhao, we will destroy your grand spell and then exterminate the Reliance Sect.”</p><br/><p>“Exterminate the Reliance Sect…” He Luohua suddenly laughed, louder and louder. It echoed out throughout the Reliance Sect. As he laughed, he saw Grand Elder Ouyang standing there next to him, looking as if he were ready to fight to the death. He also saw the three Inner Sect disciples sitting grimly in the main temple hall. Then he glanced at the crowds of Outer Sect disciples, covered in blood. He knew that they were without hope, helpless.</p><br/><p>How could he fight back? How could he ensure that the Outer Sect disciples lived to see another day? How could he avoid this disaster…</p><br/><p>“As long as I am the Sect Leader of the Reliance Sect, I will not allow outsiders to bully and humiliate us. But there’s really no way for me to protect everyone…” His laughter carried sorrow within it, but also a tiny shred of hope.</p><br/><p>“Even if you don’t exterminate the Reliance Sect, I fear that it cannot continue on for very long. Therefore… as of today, the Reliance Sect is disbanded. I have no further need of these trivial mountains!” He flicked his sleeve and flew up into the air. Looking shocked, Grand Elder Ouyang followed him. They floated in the air, looking down at the Reliance Sect, at what had been their home for so many sixty-year cycles. Their expressions were filled with grief.</p><br/><p>“Disciples, hear my order. The Reliance Sect is hereby disbanded! As of now, you are no longer its disciples. This world no longer contains any Reliance Sect!” Veins of blood appeared in his eyes. The twenty or so experts from the State of Zhao began to laugh coldly as they listened to He Luohua’s shocking words.</p><br/><p>“Are you satisfied?” he asked. “Any treasures or signs here have nothing to do with me, nor with these Sectless pups beneath me. If you dare to hurt anyone, I will detonate the grand protective spell, and then… we can all perish together.” His voice was resolute, and the bitterness in his words caused the State of Zhao experts’ hearts to quaver a bit.</p><br/><p>“Fellow Daoist He, since you have made this decision, of course we will not make things difficult for you,” said an old woman from among the six most powerful of the experts. “The Reliance Sect is disbanded. If you step aside, then we will not cause problems for any of the disciples. You can rest at ease.” Her gaze was like lightning. As she looked over the Reliance Sect, she could tell that the object from which the sign had originated was located here, but was not being held by any of the people.</p><br/><p>Meng Hao looked up into the sky, and as He Luohua’s words rang in his ears, he was reminded of the law of the jungle. Despite how powerful the Sect Leader was, he still had been forced to dissolve the Sect.</p><br/><p>Chen Fan said nothing, but staggered back a few paces on unsteady legs. Xu Qing lowered her head.</p><br/><p>“Hearing the words of the Fellow Daoist from Tianlao, I feel at ease.” He Luohua flicked his sleeve, and the grand protective spell dissipated. With that, he made to leave, followed by Grand Elder Ouyang.</p><br/><p>Some among the group of people floating in the sky watched He Luohua with glittering eyes, clearly unwilling to allow him to leave. And yet their attention was captured by the prospect of being able to search the Reliance Sect.</p><br/><p>Inside the main temple hall, Chen Fan’s face was pale. He took a few more steps back, until he was leaning up against the statue of Patriarch Reliance.</p><br/><p>At that exact moment, a booming sound filled the sky and a multitude of lightning bolts approaching. A cold laughter rolled out, shocking all the Cultivators to the core. Even the faces of the experts from the State of Zhao appeared shaken.</p><br/><p>“No one is permitted to leave,” the voice roared. A massive shield suddenly swept over the entire Reliance Sect, covering everything within countless kilometers in ever direction. No one could leave, even if they wanted to.</p><br/><p>He Luohua’s face changed. He looked up into the sky and caught sight of a massive Feng Shui compass, roughly three hundred meters in diameter. On top of it stood a beautiful woman wearing a luxurious, dark green robe. Her hair was bound by a phoenix hairpin. Dozens of Cultivators surrounded her, most of whom were female, and all of whom were extremely beautiful. Their expressions were arrogant and cold as they looked down.</p><br/><p>“Correct, no one is permitted to leave.” Suddenly, the air seemed to split, and a large, armored man appeared, laughing. He carried an enormous golden sword slung over his shoulder, and was followed by dozens of people, all of them big and tall, their faces filled with killing intent.</p><br/><p>“Zhao Shanling of the Golden Frost Sect, Dao Protector,” said the beautiful, middle-aged woman who stood in the center of the Feng Shui compass, her voice cold. “You certainly have a sensitive nose.” Her voice rippled out, filling the air.</p><br/><p>“If the ladies of the Black Sieve Sect can come,” replied Zhao Shanjun with a laugh, “then why can’t the men of the Golden Frost Sect?”</p><br/><p>Just then, a sigh rang out from outside the massive shield. A cold light shot down from the heavens, and as it approached, it pierced through the shining shield. In through the damaged section shot a flying sword nearly three hundred meters in length.</p><br/><p>The primitive-looking, blue-colored sword flew in, surrounding by swirling, intense coldness which caused snowflakes to begin to fall in all the area surrounding the Reliance Sect. Standing on top of the sword was a middle-aged man.</p><br/><p>He wore a long scholar’s robe, and held his hands clasped behind his back. He was the only person atop the massive sword, but he emanated the aura of a person who could stride among the heavens unhindered by anyone.</p><br/><p>“The Solitary Sword Sect!” said He Luohua, his face changing. He knew the identity of this scholar from the Solitary Sword Sect, the number one Sect in the Southern Domain. Their Sect had a saying: Only a solitary sword need leave the Sect, and the Heavens shall be rattled.</p><br/>\n</div>"}