{"title": "Chapter 49: Mountain of Trial by Fire", "id": 49, "volume": 1, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-49-mountain-of-trial-by-fire", "volume_title": "Volume 1", "body": "<h1>Chapter 49: Mountain of Trial by Fire</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 49: Mountain of Trial by Fire</strong></p><br/><p>“My Violet Fate Sect is one of the great sects of the Southern Domain. These may be just Outer Sect disciples, but even to enter the Sect, each and every one of them passed nine difficult tests. Every month, they immerse their bodies in a Spirit Spring. They possess inexhaustible amounts of precious materials. All of them have extraordinary latent talent, rarely seen in any Sect.</p><br/><p>“These disciples could flatten your crappy mountain with the wave of a hand. As for your Demonic creatures, they aren’t even fit to be eaten by my disciples. They’re not Mutated beasts they’re Mutt beasts!” Wu Dingqiu glared with wide eyes. The disciples behind him lowered their heads in embarrassment, glancing at Eccentric Song.</p><br/><p>Eccentric Song stared for a moment, surprised. He flicked his sleeve and was about to say something when Wu Dingqiu suddenly leaped up and turned to face his disciples.</p><br/><p>“Violet Fate Sect Disciples!” he roared. “This might be your first time to venture outside of the Sect, but this mountain, where life and death is predestined, is a promotion training ground for the Inner Sect. Anyone who steps onto the mountain and reaches the half-way point shall be remembered. Anyone who reaches the mountain top, even more so. And whoever manages to snap that crappy flagpole will be my personal apprentice, and receive immediate promotion into the Violet Fate Inner Sect! What are you gaping for?! Get moving!”</p><br/><p>Upon hearing this, the faces of the white-robed disciples filled with inspiration and their eyes shined. This was their first time outside of the Sect. Some thirsted to become a member of the Inner Sect, others desired to acquire treasures. According to the rumors they had heard in the Sect, vast amounts of Spirit Stones, medicinal pills, and magical items were hidden in this State of Zhao treasure mountain.</p><br/><p>Nearly a hundred bodies flashed toward the mountain, a shocking sight.</p><br/><p>The peak of the mountain was extremely high, and the mountain itself was surrounded by forest.</p><br/><p>Almost immediately, thunderous noises arose from within the trees. The roars of the wild beasts shattered the quietness of the still night.</p><br/><p>Two hours passed in which miserable shrieks continuously rang out from Demon Beast Forest, especially the border regions. Suddenly, seven or eight Violet Fate Sect disciples fled out from the forest, their faces filled with fear. They were being pursued by three mighty beasts who had the heads of dragons and the bodies of tigers. The ground shook beneath their feet as they charged forth.</p><br/><p>The life force of these three beasts seemed boundless, their might extraordinary. Their fur was long and thick, causing them to look completely different from the average Demonic beast, savage and fierce to the extreme. When they breathed, their auras transformed into Mist Serpents which coiled around their bodies, leaving the inexperienced, novice disciples frightened to death. Their faces paled, and they ran away at top speed.</p><br/><p>Once they stepped foot outside the trees, the Demonic beasts ceased their pursuit. They glared viciously at the seven or eight disciples, then turned and disappeared back into the forest.</p><br/><p>On the flat plateau, Eccentric Song laughed heartily. “Look, Wu Dingqiu, these are the Spirit beasts I have raised. What do you think? Even if your disciples grew up inside a Spirit Spring, it wouldn’t do any good. Forget about the even more powerful Spirit Beasts on the treasure mountain, your Violet Fate Sect disciples can’t even get past the Spirit Beast Forest!”</p><br/><p>Wu Dingqiu sat there in his white robe, an unpleasant look on his face. He stared angrily at the seven or eight Cultivators. And yet, his tone of voice was as arrogant as always as he calmly said: “Those disciples are merely at the fifth or sixth level of Qi Condensation. The truly Chosen in my Sect are all still in the forest. It won’t be long before they step foot onto your crappy mountain, then they will clear out all the junk you have hidden there!”</p><br/><p>Time passed by, another two hours…</p><br/><p>So far, no one had been able to get past the Demonic Beast Forest to step foot onto the mountain itself. Currently, miserable shrieks and wails drifted out from the trees, and before long, a commotion broke out at the edge of the forest as ten or more Violet Fate Sect disciples fled out in terror. Dread filled their faces, and some of them were injured. This was their first time outside of the Sect, and they were like flowers grown indoors who had never faced wind and rain. They were being pursued by a group of five howling Demonic beasts; one was a fierce, pitch-black tiger. Another was a giant peacock, nearly six meters tall. The rest were hard to identify, but were clearly out of the ordinary.</p><br/><p>On the plateau, Eccentric Song once again let out a complacent laugh. He appeared to be in very high spirits. He grew even happier when he saw Wu Dingqiu’s increasingly somber face.</p><br/><p>“Wu Dingqiu, are these really the most outstanding disciples in your Violet Fate Sect? It seems that being raised inside a Spirit Spring really doesn’t cut it. I’m afraid that even if they ate meals made from precious materials, it still wouldn’t do them any good. My treasure mountain is filled with unusual items rarely seen in the Southern Domain. I’ve spent all my energy in the past years on this project. After years of allowing my creatures to grow in strength, my mountain is ready. I’ve been waiting for quite some time for your Violet Fate Sect to come for this trial by fire.”</p><br/><p>Wu Dingqiu’s face grew so grim that it seemed it might explode at any moment, like a volcano. In a stiff voice, he said, “It’s just a crappy mountain, nothing worth bragging about. I could level the whole thing with the wave of a hand. All the disciples that have come back out are useless. The true Chosen ones are…” Even as the words came out of his mouth, his eyes suddenly widened. A handful of disciples had just come running out of the edge of the Demonic Forest. He leaped to his feet. With a roar, he said, “Get back in there! If anyone dares to run away, I shall expel you from the Sect!”</p><br/><p>His roar reverberated across the land, but not very far. He limited it to a radius of about fifty kilometers. When they heard it, the disciples who had just fled out of the forest grew pale and began to tremble. They didn’t dare to flee. Gritting their teeth, they turned and headed back. The Demonic beasts that had been pursuing them were also frightened, and dared not attack.</p><br/><p>As for the twenty or more disciples who had already fled the Demonic Forest, their faces grew even paler, and they hesitated. They weren’t sure if they should go back in or not.</p><br/><p>“Be it the Violet Fate Sect’s disciples, or another Sect’s disciple, during these seven days, anyone can enter my Spirit Beast Forest,” said Eccentric Song with a hearty laugh. “Anyone with the skill to step foot on my treasure mountain can have the chance to take away the treasures. I will neither stop them, nor even frown. Even the flag on the mountain peak is fair game. There I have placed a bag of the Cosmos, which can hold mountains and rivers inside.</p><br/><p>Upon hearing his laughter, Wu Dingqiu’s face grew more unsightly. He was beginning to feel that this Eccentric Song was too spiteful. He had filled the mountain with treasures, and seemed to have complete confidence that they wouldn’t be touched. Wu Dingqiu flicked his sleeve and made to leave. He had already suffered too much humiliation, and would not stand for any more. But before he could go, Eccentric Song stood and blocked his way.</p><br/><p>“Fellow Daoist Wu, we had an arrangement. Before we finish our game of Go, neither of us may leave. You’re an Elder from one of the Great Sects of the Southern Domain. You’re not going to go back on your word, are you?” As he laughed, his beard floated up a bit. His face was filled with utter pride, and it seemed he had no intention of letting Wu Dingqiu leave.</p><br/><p>At that moment, Meng Hao was several thousand kilometres away, flying quickly through the mountain forest. Around him, autumn leaves floated in the air, and behind him, Shangguan Xiu was in hot pursuit, killing intent radiating out from him.</p><br/><p>“This State Shield Mountain range goes on forever, Meng Hao,” said Shangguan Xiu, his voice sinister. “Its depths are filled with miasma! Going in this direction is the same as picking the road to death!”</p><br/><p>“Pipe down,” said Meng Hao coldly. He frowned. It was the first thing he had said this entire time. He was really getting annoyed with Shangguan Xiu. As far as he was concerned, it was fine if he wanted to chase him, but the ceaseless chatter was unnecessary.</p><br/><p>Shangguan Xiu’s eyes glittered and he lifted up his hands in front of him, then slapped them together.</p><br/><p>Meng Hao suddenly felt a stab of pain in his chest that coincided with the slapping sound. It felt as if a sharp sword were slicing through into his heart. His face filled with pain and he coughed up a spray of blood.</p><br/><p>“You finally speak, whelp! You fell for my trick! That was a special magic from my family that is designed to damage the heart and blood vessels.” With a sinister smile, he increased his speed. He lifted his right hand, and a five-colored pearl appeared. He flung it forward, and it shot toward Meng Hao. Before it reached him, it suddenly exploded, transforming into several five-colored streams of mist which then merged into the shape of a hideous evil spirit. It howled as it pounced toward Meng Hao.</p><br/><p>Meng Hao looked back with a grim expression. Having no time even to spit the blood from his mouth, his hands flickered in incantation gestures, and his body sped forward with increased speed. As the five-colored Mist Spirit approached, a head-sized Water Globe formed in his left hand. From his right had emerged a roaring Flame Python thirty meters in length. The Water Globe shot forth first, exploding to form a rain of Water Arrows.</p><br/><p>The Flame Python flew forward, then exploded in mid-air, sending scorching heat roiling out into the night air. This caused the water droplets to transform into a mist. Guided by the aura from Meng Hao’s Cultivation base, it surrounded the area, sending the five-colored Mist Spirit into confusion. It no longer could identify Meng Hao’s position.</p><br/><p>Even Shangguan Xiu’s vision was obscured, leaving him shocked. As soon as the mist appeared, before he had a chance to recover from his surprise, two cold, noiseless beams shot toward him.</p><br/><p>A booming sound rang out, and Meng Hao let out a light sigh. Without hesitation, he changed his direction and kept moving forward, swallowing a Demonic Core to replenish himself. Behind him, a furious roar could be heard, and the fog was instantly dispersed by a sweeping whirlwind. Shangguan Xiu moved forward, an angry look on his face, blood dripping from a wound on his right hand. The Mist Spirit was nowhere in sight.</p><br/><p>As he thought back to what had just happened, his eyes narrowed. Were it not for his quick reaction in detonating the Mist Spirit to block the two wooden swords, he would have lost his right hand. Even still, his hand had been cut open. Even more alarming, he felt the spiritual energy within his body slowly leaking out through the wound. Furthermore, the wound was not healing as fast as normal. He could stop the flow of blood, but not the leakage of spiritual energy.</p><br/><p>“This swine is just too crafty. He has some low-level techniques, but he uses them in a multitude of tricky ways. It’s really difficult to deal with!” Shangguan Xiu frowned, but he continued on with his dogged pursuit.</p><br/><p>The two of them moved on, and time passed. Before long, dawn had arrived. After a night of chasing and fleeing, both of them were exhausted. As for Meng Hao, he had it a bit better off. Even though he did not have any chance to rest, he had experienced this sort of pursuit in the black mountain. The only difference was that sadly, these wild mountains didn’t seem to contain any Demonic beasts. If they did, then it would have been a bit easier to deal with Shangguan Xiu.</p><br/><p>As for Shangguan Xiu, this was his first time dealing with a Cultivator like Meng Hao, who released an endless stream of tricky methods. The two wooden swords were especially astonishing; he had originally planned to chase Meng Hao until his spiritual energy ran out. Instead, he seemed to be as lively and full of energy as a dragon or tiger. Did he have an infinite supply of medicinal pills?</p><br/><p>“If he’s this difficult to deal with at the seventh level of Qi Condensation, how terrible would he be at a higher level?” Shangguan Xiu clenched his jaw, swallowed a medicinal pill, then continued in his pursuit. He was of the ninth level of the Qi Condensation stage, the same stage as Meng Hao. Despite his slightly superior speed, he could still do little more than chase.</p><br/><p>Of course, he didn’t know that even though Meng Hao was at the seventh level, his Cultivation method was not the ordinary method used in the Reliance Sect, but rather that of the Qi Condensation Manual of the Sublime Spirit Scripture. Even though Meng Hao had not studied any special texts related to attack techniques, in matters related to spiritual energy, he could persist for much longer periods of time than the average Cultivator.</p><br/><p>With the added help of some Demonic Cores, then there was no way that Shangguan Xiu could catch him in any short period of time.</p><br/><p>By the time dawn broke, the two of them had travelled a very long distance. In front of Meng Hao appeared an incredibly high mountain, its peak stretching up into the skies, its top half wreathed in snow. At a single glance, one could tell that this was not an ordinary place.</p><br/><p>-----</p><br/><p><em>This is a series of 5 special chapters sponsored by Jon Alle, Jingping Lai, Erik Gordon, Christian Dela Cruz, Sai Pakalapat, Marco Pacheco Dera, Chris Sherman, Sheela Mugan, Tjandra Johannes, Deep Bhattacharya, Allen Porter, Daniel Delaney, Steven Melendez, Abdul azim Nasyirah Diyana, and Austin Minett</em></p><br/>\n</div>"}