{"title": "Chapter 58: This is not its World", "id": 58, "volume": 1, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-58-this-is-not-its-world", "volume_title": "Volume 1", "body": "<h1>Chapter 58: This is not its World</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 58: This is not its World</strong></p><br/><p>Two months passed. Meng Hao sat cross-legged in the Immortal’s Cave in the deep mountains. Suddenly, a thunderous noise rang out, sending the nearby animals scattering. The large stone slab he had sliced out to seal the cave suddenly shattered into pieces.</p><br/><p>Stone fragments showered out in all directions as Meng Hao emerged from the Immortal’s Cave. His hair hung down like a cloak around his scholar’s robe. His eyes glittered like lightning, and a shocking aura emanated from him, as well as a pleasant, fragrant aroma.</p><br/><p>A look of joy filled his face. After having been in secluded meditation for such a long time, he let out a laugh which echoed out and sent the wild beasts running.</p><br/><p>“The eighth level of Qi Condensation!” he said, his fists clenched. His eyes shone, which would have been even more obvious were it nighttime.</p><br/><p>The two months of meditation had begun with a sense of nervousness and imminent danger. Those feeling disappeared slowly as he practiced Cultivation. He used over ten thousand Spirit Stones to duplicate medicinal pills, which he used in his meditation.</p><br/><p>He did not want to be in a position of danger ever again. He needed to become strong, so that he could surpass the people who threatened him.</p><br/><p>“I need to become powerful. There is no other reason. I must become powerful!”</p><br/><p>He stood outside of the Immortal’s cave, breathing the fresh mountain air, his eyes filled with resolve.</p><br/><p>He was a simple scholar, a student of Confucianism. But the past three years had caused him to become a bit more inwardly focused. After everything that he had experienced, his personality was very different than it had been. His stubborness was now much more obvious.</p><br/><p>He had been stubborn in his refusal to give up even after failing in the Imperial examinations. He had been stubborn in his struggles in the Reliance Sect. He had been stubborn when he stood up to Wang Tengfei. And now he was stubborn in his hopes for the future.</p><br/><p>Becoming powerful is much the same as becoming rich. It is a dream that does not require a reason. If a reason is required, perhaps it is fear of being poor or weak. That is what Meng Hao believed.</p><br/><p>“Life is an ever-burning flame, filled with exuberance. In life, one must be strong, and never lower one’s head.” He looked up into the sky, thinking about the Reliance Sect. He thought about the arrogant conceit of the experts from the State of Zhao. He thought of the coldness of the people who had tried to kill him. He thought of the gaze of that middle-aged Dao Protector who had stood next to Wang Tengfei that night.</p><br/><p>“My mother and father disappeared when I was young. If I hadn’t struggled to improve myself, I wouldn’t have lived down to this day. Instead, I would have resigned myself to the hopelessness. If I hadn’t struggled to grow stronger during my time in the Reliance Sect, I would never have become a member of the Inner Sect. Stubborn insistence on self-improvement. That is my path into the future.” He let out a very long breath. Then, he lifted his hand and flicked his sleeve. A black beam appeared which solidified into a black spike. Emanating a black glow, it shot toward a nearby boulder.</p><br/><p>A boom rang out, and the boulder, which was over eighteen meters tall, collapsed into chunks, interspersed with pieces of black ice. They fell to the ground, emanating an intense coldness.</p><br/><p>With a look of satisfaction, Meng Hao waved his hand, and the black spike flew back to him. He moved his hand again, and this time a multicolored beam swirled around him. The sixteen-feathered fan appeared, flying back and forth as it followed the movements of his fingers. Suddenly, there was bang as the feathers separated.</p><br/><p>Sixteen beams of light circled around. The sixteen feathers had become like flying swords, swift and fierce. They followed the movements of his hand, moving to spin rapidly around him, making an impenetrable shield, empowered by his spiritual power.</p><br/><p>Then the feathers re-formed into a fan and settled onto his hand.</p><br/><p>“It’s too bad I didn’t have enough Spirit Stones. The copper mirror really eats them up. Duplicating one Earthly Spirit Pill required one hundred Spirit Stones. Not a bad price. The Heavenly Spirit Pill, useful upon reaching the eighth level of Qi Condensation, required five hundred. Just a bit too expensive…” Thinking about Spirit Stones, he frowned. Of the ten thousand Spirit Stones he’d had, not many were left. During the two months he had spent breaking through from the seventh level to the eighth level, he had consumed over eighty Earthly Spirit Pills. That was nearly two per day before he had broken through to the eighth level of Qi Condensation.</p><br/><p>“In the future,” he muttered to himself. “I will require even more spiritual power to practice Cultivation.” A glance inside his bag of holding confirmed that he only had five Heavenly Spirit Pills. He had already consumed one, and had calculated that to reach the ninth level of Qi Condensation he would need roughly one hundred and fifty.</p><br/><p>“I know I need a lot of spiritual power. But could it be that my excessive consumption of Demonic Cores has caused my body to begin to reject medicinal pills?” He hesitated, unsure of how to confirm his theory. If he was right, then he might need even more Heavenly Spirit Pills, or perhaps other types of medicinal pills.</p><br/><p>“One hundred and fifty Heavenly Spirit Pills… that’s equal to seventy thousand Spirit Stones… Without them, it will take me a long time to accumulate that much spiritual energy. Plus, my latent talent is only ordinary, so that means it will take even longer….” He sighed as he thought about the emptiness of his bag of holding.</p><br/><p>He had three more of the extraordinarily large Spirit Stones, but he didn’t dare to use them. The more advanced he became in his cultivation, the more he realized how rash he had been to duplicate the wooden sword all those years ago. The large Spirit Stones were clearly extraordinarily special, otherwise he would not have been able to duplicate the Vorpal Jade Blood Crystals.</p><br/><p>“I won’t use these large Spirit Stones unless it’s absolutely necessary,” he said resolutely. “Maybe they will have some other use in the future.” The fan beneath his feet began to shine brightly, and his body transformed into a ray of light which shot off into the distance.</p><br/><p>He was quiet as he travelled, circulating his spiritual energy. Eventually, the treasured fan began to fade and take on a more ordinary appearance. As he moved farther and farther away, he began to grow more at ease.</p><br/><p>“After all these months, the Violet Fate Sect disciples will surely have moved on.” He was careful as he traveled, eventually emerging from the mountains. He looked off into the distance. If he was right, this area was close to the capital city of the State of Zhao.</p><br/><p>Once upon a time, he had yearned day and night to go to the capital city. This desire was second only to his dream of visiting the Great Tang in the Eastern Lands. He sighed emotionally as he thought of his three years of examinations, and three years of failures. He had never even made it to the final examinations in the capital city. Another three years had passed, and now he finally arrived, not as a scholar, but as a Cultivator.</p><br/><p>As he approached the capital city, he stopped gliding and began to walk along the public road. He tied up his hair and this, coupled with his scholar’s robe, made him look just like the old scholar that he used to be. Although, while he had then been somewhat short, after years of Cultivation, he was now tall and slender. His skin was still a bit dark, yet vigorous, emanating a strong air.</p><br/><p>He walked along absentmindedly. It was March now, which was often a time for snowfall in the State of Zhao. As Meng Hao walked, the darkness of evening began to settle around him, and snowflakes began to slowly fall.</p><br/><p>Soon, the ground was covered with whiteness, like a feathered quilt.</p><br/><p>The wind blew snow onto Meng Hao’s hair. It didn’t melt, but rather began to collect together.</p><br/><p>Everything was still and quiet. As he grew closer and closer to the capital city, a horse-drawn carriage approached from behind him, speeding forward at top speed. It seemed whoever was inside was afraid the city gates would be closing soon.</p><br/><p>It passed Meng Hao, kicking up billows of snowflakes in its wake. As it passed, the wind blew open the carriage’s curtain just a crack, revealing a young scholar reading some texts.</p><br/><p>Meng Hao looked at him calmly, recalling his own similar appearance years ago. As of now, Meng Hao was clearly about twenty years old. However, inside, he felt much older.</p><br/><p>He let out a light sigh. Up ahead, the carriage came to a stop, and the curtain lifted up. The young scholar looked back at him, then stepped down out of the carriage and saluted Meng Hao with clasped hands.</p><br/><p>“Brother, are you going to Capital City for the Imperial examinations?</p><br/><p>Meng Hao quickly returned the salute. “Years ago I dreamed of doing so, but those dreams have long since faded. I just want to go take a look at the Tower of Tang.”</p><br/><p>“That’s a pity, my Brother,” he said, looking regretful. “Your bearing seems very refined, I thought perhaps we were fellow candidates. Are you sure you wish to give up on your aspirations to become an official?” The young man appeared to be about the same age as Meng Hao.</p><br/><p>Meng Hao shook his head silently.</p><br/><p>“Well, never mind,” said the young scholar. He looked at Meng Hao’s scholarly appearance and smiled warmly. “It’s starting to snow harder, and it will only become more difficult to travel along the road. If it gets too late, you won’t be able to enter the city. Brother, why don’t you join me in the carriage? We should still have enough time to make it to the city.”</p><br/><p>Meng Hao looked up at the sky, then back at the scholar. He bowed respectfully, then stepped up into the carriage.</p><br/><p>A fire crackled in a small oven inside, dispelling the bitter cold. This, coupled with the fact that an old family retainer drove the carriage, made it clear that the scholar came from a rich family.</p><br/><p>The old driver wore a wide bamboo hat and the knuckles of his hands were large. It seemed he could do some kung fu.</p><br/><p>“I am Zheng Yong,” the scholar said with a smile, warming his hands. “Brother, there’s no need to be shy. We’re both scholars, and scholars should help each other whenever possible.”</p><br/><p>“I am Meng Hao,” he said with a humble smile. “Many thanks to you, Brother Zheng.” His gaze fell upon the book resting next to Zheng Yong. It was the Book of Rites. It looked very old, and was obviously not a copy, but rather an ancient original text.</p><br/><p>“You’re surnamed Meng?” said Zheng Yong, his expression brightening. It was somewhat cramped inside the carriage, but he still managed to stand and give Meng Hao a respectful salute. “Such an honorable family name. So you’re a descendant of Qingfu! I have been disrespectful; please forgive me, Brother Meng.”</p><br/><p>Meng Hao stood and returned the salute. “There’s no need to act like this, Brother Zheng. It’s just a surname. My ancestors were resplendent, but as for me, I failed repeatedly in the Imperial examinations, which has left me extremely ashamed.” The two of them sat back down.</p><br/><p>“Brother Meng, you spoke incorrectly just now,” said Zheng Yong solemnly. “Your surname will bring you good fortune. It has been passed down to you from ancient times. As a descendant of Qingfu, even if you didn’t pass the Imperial examinations, as long as you have kindness and virtue in your heart, you can still live by the values of Confucius.”</p><br/><p>Meng Hao thought silently for a moment, then lifted his head and looked at the scholar sitting in front of him. “Brother Zheng,” he said quietly, “what is the true meaning of Confucianism?”</p><br/><p>“Courtesy, benevolence, loyalty, and the golden mean,” he responded unhesitatingly. “This is Confucianism.”</p><br/><p>Meng Hao didn’t respond. He looked out through the curtain at the snowflakes filling the air. After a while, he spoke again in a cool voice: “What is the meaning of life?”</p><br/><p>“Life?” said Zheng Yong, looking surprised. He hesitated for a while, not saying anything.</p><br/><p>The inside the carriage grew quiet, filled only with the sound of falling snow, which drifted in through the window. Meng Hao lifted up his hand and reached outside. Snowflakes gradually accumulated on his hand.</p><br/><p>“Snow will only appear during winter,” he said quietly, “and can only exist in the cold wind. Therefore, its life exists only during the depths of winter.” He pulled his hand back into the carriage and held it next to the copper oven. The snow began to melt, turning into water, which flowed through the creases of his palm.</p><br/><p>“Snow can only live in the winter. When it nears a fire, it dies. That is its life. It may yearn for summer, but… it can only desire it. In my hand, the snow becomes water, because this is not its world….” He raised his hand back up and brushed the water off outside the window. There, beyond the vision of the young scholar, it once again became snow.</p><br/><p>Zheng Yong stared mutely, a deep look appearing in his eyes. Eventually, the carriage entered the city.</p><br/><p>“Thank you for allowing me to accompany you, Brother Zheng,” said Meng Hao coolly. “I shall take my leave.” He saluted politely, and stepped out of the carriage, then treaded across the snow-filled street.</p><br/><p>“Yearning for summer,” Zheng Yong murmured to himself, “but only able to exist in the cold of winter. Only able to look off into the distance… that is snow.” He watched Meng Hao disappearing into the distance. After a while, he got out of the cart and gave a deep bow in Meng Hao’s direction.</p><br/><p>Snow began to cover him, but he knew that as soon as he reentered the carriage, it would die. He would never forget what had just happened, and what he had just seen and heard. Years later, after he became a famous Confucian in the State of Zhao, he would think back to that windy, winter night when the snow slowly melted into water. And he would think of a scholar named Meng Hao.</p><br/>\n</div>"}