{"title": "Chapter 50: Iron Spear", "id": 50, "volume": 1, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-50-iron-spear", "volume_title": "Volume 1", "body": "<h1>Chapter 50: Iron Spear</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 50: Iron Spear</strong></p><br/><p>As soon as he caught sight of the mountain ahead of him, Meng Hao’s eyes began to shine. It was clearly beyond the ordinary, and perhaps even contained some Demonic beasts. In any case, he didn’t have much time to think about it. His body flashed as he shot directly toward the mountainous forest which lay at its foot.</p><br/><p>Behind him, Shangguan Xiu’s expression changed. His Cultivation base was higher than Meng Hao’s; he had tread the Cultivation world for many years, and had seen many things. He could tell that something was fishy about this mountain. But as he saw Meng Hao charge forward, he put aside his doubts, gritted his teeth, and followed.</p><br/><p>Meanwhile on the plateau, white-robed Wu Dingqiu and Eccentric Song sat, seemingly playing Go, but in reality focused on the fighting going on below them. From their vantage point, it was clear that the Violet Fate Sect disciples were stuck in the mountain forest, and after an entire night, could not step foot onto the mountain. One by one, they were rebuffed by the Demonic beasts.</p><br/><p>“The Violet Fate Sect disciples truly are beyond ordinary,” said Eccentric Song, laughing. “To be able to stay in the Spirit Beast forest for an entire night is excellent. Wu Dingqiu, you really should be proud.” He looked extremely complacent, and even happier when he saw the dark look on Wu Dingqiu’s face.</p><br/><p>Wu Dingqiu’s face sank even deeper as he saw the sorry state of his disciples within the forest. He let out a cold harrumph.</p><br/><p>“Wu Dingqiu, you should really proud. Last time the Golden Frost Sect came to me to engage in trial by fire, they were all defeated by my Spirit beasts. Not a single one could make it to my treasure mountain to see the truly powerful Spirit beasts. I felt really sad about that. I really hope that your Violet Fate Sect disciples can make a good showing. This Spirit forest is filled with Spirit beasts that I meticulously selected. For example, that one.” He proudly pointed a finger toward a white-colored ape.</p><br/><p>Its entire body, even its eyes, were as white as snow, and its appearance was incredibly fierce. With a single swipe of its claws, it slashed the arm of one of the Violet Fate Sect disciples, sending blood spraying everywhere. It moved with incredible speed, like a white wind. It had already injured about seven or eight surrounding Violet Fate Sect disciples.</p><br/><p>“That is a Snow Peak Mutated beast, rarely seen in the world. I got my hands on it about ten years ago. It’s extremely rare. Look at its fur, as pure white as snow and as smooth as silk. I should be able to sell it for a hefty price one day.” Eccentric Song laughed, pleased with himself. White-robed Wu Dingqiu looked even more grim. He’d never imaged that after all these years, Eccentric Song’s treasure mountain would have so many powerful Demonic beasts.</p><br/><p>Even as Eccentric Song spoke, a figure appeared near the edge of the forest near the white ape. It was Meng Hao, with Shangguan Xiu hot on his tail. Eccentric Song laughed.</p><br/><p>“So, some outsiders have decided to intrude. Wu Dingqiu, please observe what it means to keep one’s promise. I will not prevent any Cultivator of the Qi Condensation stage from entering this area. Anyone can enter. Although they will surely die, I will not block them.”</p><br/><p>Wu Dingqiu let out a cold snort, not paying the least bit of attention to Meng Hao and Shangguan Xiu. Instead, he stared at the white ape, which had just encountered another Violet Fate Sect disciple. He appeared to be about seventeen or eighteen years old. His hands flickered in incantation patterns, and suddenly the image of an ancient scroll unfurled behind him. An aura billowed out, pushing down onto the white ape. It shrieked.</p><br/><p>“A fine Mutated ape,” said Wu Dingqiu “Eccentric Song, no matter how incredible that beast is, it’s going to become my disciple’s pet! His name is Shi Yan. Upon entering the Sect, he acquired that ancient scroll, which at the seventh level of Qi Condensation, can capture Demonic beasts.” Inside, Wu Dingqiu’s heart pounded, but his expression was cool and indifferent, somewhat proud. Considering his status and Cultivation base, he shouldn’t allow such an expression onto his face. But Eccentric Song made it impossible for him to hold back, especially after the humiliation of the previous night.</p><br/><p>However, as soon as the words were out of his mouth, a piteous wail could be heard. Blood showered from Shi Yan’s chest, and his ancient scroll collapsed into pieces. He retreated backwards, fear in his eyes. The white ape’s body began to expand, until it was nearly eighteen meters tall. It beat its chest, seeming to brim with power.</p><br/><p>Eccentric Song laughed loudly. Wu Dingqiu stared at the white ape, his face twisted, fighting the impulse to charge forward and crush the thing to death.</p><br/><p>It was at that moment that Meng Hao shot out of the forest. As soon as he caught sight of the roaring ape, his eyes glittered brightly. He also saw the frightened young man off in the distance, but didn’t have time to consider the situation.</p><br/><p>With people present, Meng Hao wouldn’t reveal the copper mirror. His eyes flashed as the white ape took notice of him. The beast charged him, howling ferociously. Meng Hao lifted his right hand, and suddenly an iron spear appeared, the one Fatty’s father had created according to his specifications. The young Cultivator named Shi Yan watched as the spear appeared.</p><br/><p>Of course, in addition to the long spear, the copper mirror also emerged, concealed within Meng Hao’s sleeve. The sleeve was so wide that any observers would not be able to see it, especially considering how their eyes would be drawn to the long spear.</p><br/><p>The spear was made of common iron, but its surface was covered with various complicated designs, all of which Meng Hao had designed. At a glance, it appeared to be extraordinary in nature. Brandishing the spear, he moved forward, pointing it toward the charging ape.</p><br/><p>Suddenly, the white ape’s large mouth exploded violently, blood and flesh flying around. Wretched screams immediately sounded out. The ape fell down onto the ground, looking at Meng Hao in astonishment.</p><br/><p>“Perhaps when the mirror shines onto a beast with lots of fur, it causes some kind of disorder in the Qi within its body, making it swell. Demonic beasts are even bigger and stronger, so it will attempt to escape from any weak point in the body, not just the rear end, thus leading to these explosive injuries.” Of course, all of this was just speculation, but Meng Hao seemed to understand the mirror a bit better after seeing what happened to the white ape. After having the copper mirror for three years, he felt this was pretty close to the truth.</p><br/><p>Now was not the time for contemplation, however. Not giving the miserable white ape another glance, he shot off with the iron spear in hand. He was gone in an instant. Just then, Shangguan Xiu arrived. He looked at the white ape in shock.</p><br/><p>The white ape was also surprised. And then it noticed that Shangguan Xiu also happened to be carrying a spear, and its fury exploded. It pounced toward Shangguan Xiu.</p><br/><p>Back on the plateau, Eccentric Song’s laughter had ceased. Next to him, Wu Dingqiu also watched on in surprise. They stared at Meng Hao and his iron spear, their eyes filled with amazement.</p><br/><p>Meng Hao sped through the Demonic Beast forest, listening to the howls of the white ape and the roars of Shangguan Xiu. His eyes flickered, and he harrumphed coldly. Not too much time passed before he heard another commotion coming from up ahead. Soon, he saw four or five Cultivators wearing white robes, engaged in vicious combat with three Demonic beasts, each of them six meters tall.</p><br/><p>One was a large black tiger, the other was a peacock whose body emanated a glowing, violet light. The last was an enormous giant rat, fierce and cruel in appearance, seemingly unable to be killed.</p><br/><p>As soon as Meng Hao appeared in the midst of the fight, a vicious light appeared in the peacock’s eyes, and it charged like an insane gale, straight toward Meng Hao.</p><br/><p>Looking as calm as ever, Meng Hao kept moving forward, pointing the iron spear forward. Suddenly, the giant peacock’s body trembled, and it shrieked miserably. Then, its head exploded, and it fell to the ground, dead, surrounded by blood and gore. The black tiger and the giant rat were shocked. As they stared dumbly, Meng Hao’s body turned into a streak of light, and he shot off into the distance.</p><br/><p>As for the Violet Fate Sect disciples, they watched, dumbfounded, as Meng Hao disappeared. His iron spear had left them awestruck.</p><br/><p>Not pausing for even a moment, Meng Hao continued on. At this moment, Shangguan Xiu had resumed his furious pursuit.</p><br/><p>A grim smile appeared on Meng Hao’s face. He increased his speed, charging forward. Every time he encountered a Demonic beast, he would wave his spear at it, and it would retreat, crying out miserably. Not a single beast could block his path. In contrast, Shangguan Xiu was blocked at every turn. His enraged roars sounded further and further away from Meng Hao.</p><br/><p>Meng Hao also encountered more and more young, white-robed Cultivators along his way, all of them locked in deadly battles with Demonic beasts. As he passed, he would cause these seemingly unmatchable, fierce creatures to flinch back with blood-curdling screams. The Cultivators would look at Meng Hao’s retreating figure with awe.</p><br/><p>“Who was that?”</p><br/><p>“That long spear is some kind of magical item! It’s so powerful!”</p><br/><p>“How vicious! Dammit, if I had a spear like that, I could run amok through this Demonic Beast Forest.”</p><br/><p>Conversation buzzed among the Violet Fate Sect disciples, caused by Meng Hao’s shocking passage. On top of the plateau, Wu Dingqiu’s eyes glittered, and a smile tugged at the corners of his mouth. His laughter rang out, filled with joy as well as a pleased anger.</p><br/><p>“So these are Mutated beasts,” he said. “Excellent, excellent. They are all amazing beasts. Let me have a look. Hmm, some are missing eyes, others have had their heads ripped off. There are some whose entire bodies are covered with blood. One even had its butt exploded. Eccentric Song, didn’t you say that this Demonic Beast Forest was fertilized with soil from the East Sea? And didn’t you say that these Mutated beasts were all amazing? It seems they are having a bit of a rough time today.”</p><br/><p>An unsightly expression filled Eccentric Song’s face as he watched Meng Hao make his way through the Demonic Creature Forest. He watched all his precious Demonic beasts retreating with blood-curdling cries, covered with blood. When he saw the death of the peacock, his heart felt as if it had been stabbed with a knife. This type of peacock was called a Snow Phoenix and was extremely rare. He had paid quite an exorbitant price for it several years ago, and had cared for it like a treasured jewel. And yet the iron spear had exploded its head in an instant. Even though it was dead, its powerful life force caused the corpse to twitch and writhe. Eccentric Song felt extreme regret, but his eyes shone forth with an air of indifference.</p><br/><p>“Who cares?” he said. “There are a multitude of Spirit beasts in my Spirit Beast Forest. There’s no harm in it. In any case, this kid isn’t one of your Violet Fate Sect disciples, so what are you looking so happy for?!” He spoke in a light tone, but inside, his heart was beginning to pound.</p><br/><p>-----</p><br/><p><em>This is a series of 5 special chapters sponsored by Jon Alle, Jingping Lai, Erik Gordon, Christian Dela Cruz, Sai Pakalapat, Marco Pacheco Dera, Chris Sherman, Sheela Mugan, Tjandra Johannes, Deep Bhattacharya, Allen Porter, Daniel Delaney, Steven Melendez, Abdul azim Nasyirah Diyana, and Austin Minett</em></p><br/>\n</div>"}