{"title": "Chapter 52: Bumper Crop", "id": 52, "volume": 1, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-52-bumper-crop", "volume_title": "Volume 1", "body": "<h1>Chapter 52: Bumper Crop</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 52: Bumper Crop</strong></p><br/><p>Once, he could endure. Twice, three times, four times, even five times he could continue to endure. By the sixth time, however, he was shamed into a rage and could endure no longer. The Heaven Entangling Net was even more precious to him than the scroll painting. It could instantly entangle an opponent, and had been among his treasured items for years. The higher your Cultivation base, the more effective it became. He had placed it on the treasure mountain to show off its splendor, so that people would see it and covet it. He had assumed it would be safe, and had never imagined that anyone would actually be able to take it. As of now, he had already begun to go crazy, and wished nothing more than to beat Meng Hao to death and take back the oil painting and Heaven Entangling Net.</p><br/><p>But then, Wu Dingqiu, laughing smugly, flicked his wide sleeve and stood in front of Eccentric Song, blocking his way.</p><br/><p>“Fellow Daoist Song is an illustrious Cultivator from the Southern Domain. What are you doing, exactly? Earlier, you said that for seven days, anyone could come here, and that all of the treasures of the treasure mountain were available for the taking. Don’t tell me you’re going to go back on your word?</p><br/><p>“You carried the peak over here yourself from Mount Tian Shan. The land was fertilized with soil from the bottom of the East Sea which hadn’t seen the light of day for ten thousand years. I remember someone saying that any Cultivator of the Qi Condensation stage could prevail, as long as they were skilled enough. Eccentric Song, acting like this really shows a lack of demeanor. If word gets out, you’ll definitely lose face.” Wu Dingqiu continued to laugh, clearly having no intention of allowing Eccentric Song to go anywhere.</p><br/><p>Eccentric Song’s expression looked worse than ever, filled with bitter suffering. Before, he had spoken with utmost complacency, but now, everything he had said was being thrown back in his face. After a long moment, he slapped his bag of holding, pulled out two large Concentration Pills and swallowed them. Then he let out a long breath.</p><br/><p>Suddenly, his eyes flashed, and he cast his consciousness out toward Meng Hao, intending to get some information about his iron spear. At first, he hadn’t paid the slightest attention to Meng Hao, focused as he was on what the iron spear was doing. As soon as his consciousness emerged, Wu Dingqiu laughed and flicked his sleeve. A glowing shield immediately covered the entire plateau, blocking Eccentric Song’s consciousness.</p><br/><p>“Using your consciousness to inspect a lower generation Qi Condensation Cultivator? Eccentric Song, are you purposely trying to lose face?” Wu Dingqiu obviously was not willing to let Eccentric Song have his way in anything. He laughed. Eccentric Song, looking more put off than ever, could do nothing except flick his own sleeve. Another shield appeared just beyond the first shield.</p><br/><p>“That kid’s iron spear is extraordinary,” he said. “If you won’t allow me to inspect it with my consciousness, then I won’t let you do so either.”</p><br/><p>Four hours later, Meng Hao had reached the mountain’s peak, iron spear in hand. He walked up, look around, finally noticing the large flag stuck into the ground. Underneath the flag was a bag. Its surface was a mass of rioting colors; looking at it made you feel as if it could suck your mind out. Everything around it seemed to ripple and grow blurry. When Meng Hao laid eyes on it, he palpitated with eagerness and started panting. He grabbed the multicolored bag, and when he did, the flag fell to the ground.</p><br/><p>Conversations had buzzed among the onlookers in the Demonic Forest as they watched Meng Hao calmly walked up the mountain, collecting huge amounts of Spirit Stones and medicinal pills. When the flag toppled more conversations broke out.</p><br/><p>They gazed at Meng Hao with shock and envy, and then watched as he disappeared over the other side of the mountain.</p><br/><p>Shangguan Xiu glared at Meng Hao murderously as he vanished. He didn’t dare to pursue him; there were too many things about him he didn’t know. Even though Shangguan Xiu’s desire to kill him was stronger than ever, he also knew that it was almost too late to reach his medicinal plant. Gnashing his teeth, he stamped his foot onto the ground, looking very pitiful indeed. But anger pushed away his depression. He would have killed Meng Hao already, if he could only have thought of a way.</p><br/><p>As he watched Meng Hao disappear onto the other side of the mountain, Wu Dingqiu’s laughter rang out over the plateau. Eccentric Song stared with wide eyes as Meng Hao took his bag of the Cosmos. The blood drained from his face, and he seemed heartbroken. Now more than ever he regretted putting his bag of the Cosmos onto the mountain. He just couldn’t believe what had happened. This time, he really couldn’t endure any longer. He flicked his sleeve, and prepared to pursue the damnable Meng Hao. But, before he could leave, Wu Dingqiu once again blocked his way.</p><br/><p>“Wu Dingqiu, you still dare to block me!” shouted heartbroken Eccentric Song. “The flag is fallen. You didn’t win our bet, and I didn’t lose. The trial by fire is over. If you continue to obstruct my way, you can’t blame me for attacking you!”</p><br/><p>“Fellow Daoist Song, we agreed ahead of time that neither of us would leave before we finished this game of Go. You are a grand, illustrious Cultivator of the Southern Domain. Don’t tell me you’re going to go back on your word? When I made to leave earlier, you wouldn’t let me. Yet you wish to leave before finishing our game?” Wu Dingqiu laughed as he used Eccentric Song’s own words against him. Not a trace of a frown remained on his face, which was now filled with a wide smile. He clearly would not allow the other man to leave. Seeing the bag of the Cosmos taken away had filled his heart with joy. Eccentric Song had waved that bag in front of him mockingly for hundreds of years; to see him hoisted on his own petard was wondrous to the extreme.</p><br/><p>“You…” Eccentric Song glared murderously at Wu Dingqiu, and didn’t say anything for a long moment. Then, he gritted his teeth and stamped his foot down, shaking the mountain so hard it seemed it would collapse. But considering his status and prestige, he could do nothing more than sit back down and begin playing Go again.</p><br/><p>Of course, Wu Dingqiu wouldn’t let him have his way so simply. He stroked his beard as he looked at Eccentric Song’s unsightly expression. Laughing, he very slowly picked up a Go piece and then purposefully put a very thoughtful expression onto his face. After a very, very long time, he slowly put the piece onto the board, his face solemn, as if he intended to make this game last for months.</p><br/><p>“Leave the mountain,” said Wu Dingqiu, transmitting his voice to all of his white-robed disciples. “After I finish this game of Go, I will accompany you back to the Sect. In the meantime, the next stage of your trial by fire is to find the man you just saw on the mountain peak. I’ve taken a fancy to that treasured spear he has. Bring that spear back to me, and you will be promoted to the Inner Sect!” Each and every one of the disciples perked up at hearing this.</p><br/><p>“Is the dignified Violet Fate Sect of the Southern Domain really going to kill people to take treasures?” said Eccentric Song. He was incredibly depressed, stuck in place because of his own words. But even though he hated Meng Hao, he couldn’t pass up an opportunity to cause trouble for Wu Dingqiu.</p><br/><p>Glaring at Eccentric Song, Wu Dingqiu said, “Listen well. You must not cause problems for that person. You must trade with him, not rob him. Anyone who violates this command will be expelled from the Sect!” His next move in the Go game was even slower than the previous.</p><br/><p>The Violet Fate Sect disciples scattered in all directions. Some of them circled around the treasure mountain in pursuit of Meng Hao; others went as fast as possible in different directions, hoping to intercept him.</p><br/><p>Their trial by fire had been an utter defeat, something they were not reconciled to. However, they didn’t hold any ill will against Meng Hao, but rather admired him. After all, they had all witnessed the blood-soaked events of moments ago.</p><br/><p>All of them were determined to get the iron spear from Meng Hao. They would trade anything to get it, and if he was unwilling to trade, would have to think of some tricks to get it.</p><br/><p>In any case, they all had clearly heard Elder Wu’s words; they were to trade for the item, not rob it. Although… he had never said they couldn’t use force.</p><br/><p>As the white-robed disciples scattered, Meng Hao raced down the treasure mountain, collecting more Spirit Stones and medicinal pills as he went. Even though he never saw Eccentric Song and Wu Dingqiu, he had guessed that this place was most likely a trial by fire region set up by some Sect.</p><br/><p>Even though Shangguan Xiu was no longer chasing him, he knew that whosever’s trial by fire he had charged into might not be too happy about his interference. So, he maintained top speed, his heart pounding and his face filled with eagerness.</p><br/><p>His bags of holding were all full; he had acquired more this time than on any other occasion since entering the Cultivation world, with the exception of the cave of the Flying Rain-Dragon. He casually packed away the Spirit Stones and medicinal pills.</p><br/><p>Of course, the more things he picked up, the faster he tried to move. Gritting his teeth and continuously consuming Demonic Cores, he moved as fast as possible for three days, until he finally emerged from the mountain range. He looked both exhausted and energetic; in the past several days, he hadn’t had a chance to organize his treasures, and now all he wanted to do was find a place where he could safely examine everything. As he moved forward, he noticed that far in the distance was what appeared to be a walled city.</p><br/><p>He was in the east of the State of Zhao, and this city appeared to be magnificent and beyond ordinary. It was surrounded by a gentle glowing light, a shield which mortals wouldn’t be able to see, and only Cultivators could sense.</p><br/><p>“This place… it doesn’t seem like a city of mortals. Could it be a city of Cultivators?” He stared in surprise, recalling a map of the State of Zhao he had seen. The map had not shown any city in this place. At yet there at the gate of the city, people were coming in and out, almost all of them Cultivators of the Qi Condensation stage. His assumption had been correct.</p><br/><p>He decided not to enter the city. Instead, he found a cave in the nearby mountains. Concealing himself inside, he took a deep breath and then began to take everything out of his bags of holding and sort them.</p><br/><p>“What medicinal pill is this? It’s incredibly fragrant, even stronger than a Dry Spirit Pill… And this bottle, it has three pills inside, each one as transparent as crystal. They are definitely treasured pills.” Licking his lips, he emptied the contents of two bags of holding, and after counting everything, he found that he had seventy-eight pills. There were many different types, each one seemingly stronger than a Dry Spirit Pill. Meng Hao’s hands shook.</p><br/><p>It took a long time for him to collect himself. Stifling his excitement, he pulled out ten more bags of holding.</p><br/><p>“There were so many Spirit Stones on that treasure mountain. I just picked up the ones I noticed, and I wasn’t really even paying attention. Yet I acquired so many…” He began breathing hard again as he looked at all the Spirit Stones. When he put them together and counted, he found that he had eight thousand, seven hundred and sixty four!</p><br/><p>“I’m rich! Rich!” he murmured. He pulled out another bag of holding, inside of which were flying swords, pearls, two flags, a scroll painting, a black net. All of them were magical items.</p><br/><p>His smile nearly split his face as he took the items out. This was especially true when he took out the scroll painting and the black net. They emitted powerful spiritual power, causing his heart to beat rapidly. He slowly unrolled the scroll painting, and a bright light shined out, filling the cave with its brightness and illuminating Meng Hao’s face.</p><br/><p>Inside, he could see a depiction of mountains and waters, within which existed a multitude of fantastic creatures. They had been painted, and yet somehow also seemed alive. When he opened the scroll he seemed to hear the roars of tens of thousands of beasts echoing faintly in his ears. His heart shook, and he dropped the painting to the ground.</p><br/><p>After some time passed, he recovered from his shock. His eyes shining, he calmed his aura and picked up the painting again to examine it. It was clearly an incredibly valuable treasure. Meng Hao’s heart beat even faster.</p><br/><p>“A treasure! What a true treasure!” he said, breathing deeply. Then he pulled out the black net. Walking out of the cave, he poured some spiritual energy into it, then tossed it into the air.</p><br/><p>The black net instantly expanded, growing larger and larger, and flying up higher into the sky. It seemed big enough to be able to envelop the whole mountain, like some powerful black cloud. The mountain began to shake, and cracks appeared on its surface as if it were about to collapse. The suppressive power increased, causing Meng Hao’s heart to tremble. Astonished, he lifted his hand, sending out his spiritual energy, causing the black cloud to slowly shrink. It transformed into a black beam which shot back toward him and then became a small, black net.</p><br/><p>He grabbed the net, his mouth dry. He breathed for a while, composing himself. His eyes glowed.</p><br/><p>“This is better than even the best treasures from the Reliance Sect,” he thought, his heart pounding. Then, he pulled out the last item, the multicolored bag.</p><br/>\n</div>"}