{"title": "Chapter 51: My Treasure Mountain", "id": 51, "volume": 1, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-51-my-treasure-mountain", "volume_title": "Volume 1", "body": "<h1>Chapter 51: My Treasure Mountain</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 51: My Treasure Mountain…</strong></p><br/><p>“Even though this kid isn’t a disciple of my Violet Fate Sect, you said anyone could enter this area. Seeing him run wild in your crappy mountain forest makes me feel good. I’m happy, so what?” Wu Dingqiu laughed, obviously feeling quite pleased. He had been reigning himself in all night, and now he knew that even though Eccentric Song spoke casually, he was hiding his discomfiture. Feeling quite pleasant, Wu Dingqiu looked down below at Meng Hao.</p><br/><p>“That magic item of his can really dominate the Spirit Beasts,” said Eccentric Song. “His Cultivation base is low, though. He won’t be able to make it out of the Spirit Beast Forest. This forest is planted with trees I harvested from all the lands of South Heaven. It is watered with Spirit Water from the Milky Way Sea. Not only do the trees grow tall and strong, but they emit spiritual energy which the Spirit beasts can assimilate through breathing exercises. In my Spirit Beast Forest, there is also…” His voice came to a sudden, screeching stop.</p><br/><p>Meng Hao shot forward, attracting the attention of the surrounding Demonic beasts. He was nearing the foot of the Spirit mountain; it was several hundred meters away. He was about to enter the region that none of the Violet Fate disciples had made it to.</p><br/><p>Even though Meng Hao didn’t know why this area had so many white-robed disciples, he could sense that there was something odd going on. But with Shangguan Xiu on his tail, there wasn’t much time to think about it. He continued to move forward through the forest. Suddenly, an enormous Demonic beast, nearly twelve meters tall, burst out in front of him.</p><br/><p>It was a gigantic woolly mammoth, with red eyes and sharp, gleaming tusks. Its body was like a small mountain, and the earth shook as it charged with shocking power.</p><br/><p>“The kid is dead this time,” Eccentric Song said casually. “This is my Mutated mammoth, which I captured in the Life-wasting Cave, one of the most dangerous places in the Southern Domain. I raised it with medicinal pills, and it is one of the three most powerful Spirit beasts protecting this area. It has limitless power and incredibly thick skin. Ordinary flying swords can’t even scratch it. It is also proficient in a variety of magic techniques. Even someone of the ninth level of Qi Condensation would have trouble dealing with it. It can stop anyone under the Foundation Establishment stage.” Eccentric Song’s eyes had almost popped out of his head when he saw Meng Hao about to make it out of the Beast Forest. But now, he let out a sigh of relief.</p><br/><p>Wu Dingqiu stopped smiling for the moment. He could see that this mammoth was no ordinary creature. The Violet Fate Sect didn’t possess many Mutated beasts, but after hearing Eccentric Song blather on about it, he couldn’t help but frown and mutter to himself that the man really was strange. He didn’t care much at all for Cultivation, but loved seeking out Demonic beasts to raise, especially ones as strange as this.</p><br/><p>Then, Wu Dingqiu’s eyes began to shine. Eccentric Song’s expression suddenly changed, and he shot to his feet, a horrified expression on his face.</p><br/><p>Within the Demonic Forest, the Demonic mammoth charged at Meng Hao. Meng Hao took in a deep breath and retreated a bit, groaning inwardly about how many Demonic beasts were in this place. He raised the iron spear and pointed it. The charging Demonic mammoth stopped and began to quiver, then suddenly, its trunk exploded with a bang. Half of it flew through the air to land onto a nearby tree, which collapsed under its weight.</p><br/><p>Enraged with pain, the mammoth continued to charge. Meng Hao waved his spear, and a boom sounded out. The mammoth’s back exploded, then its mouth. Finally, its right front leg completely shattered, and it fell to the ground, skidding to a halt some distance away.</p><br/><p>Horrific shrieks filled the Beast Forest. Meng Hao looked a bit pale-faced. He glanced around, then charged forward, leaving the Demonic Forest behind and entering the treasure mountain.</p><br/><p>Some distance behind, Shangguan Xiu was in a tight spot, unable to free himself from the surrounding, red-eyed Demonic beasts. He could only watch as Meng Hao disappeared, his fury billowing up to the heavens.</p><br/><p>Meng Hao left the forest, leaving behind a long trail of blood, as well as the miserable cries of the various Demonic beasts. It looked like some kind of Judgement day had just passed. The white-robed disciples stared in shock, panting and murmuring about the viciousness.</p><br/><p>Meng Hao continued on up the treasure mountain, hoping that if he could pass over it, maybe he could finally shake off Shangguan Xiu. He moved forward at rapid speed, and soon reached the foot of the mountain. As soon as he stepped foot onto it, he suddenly stopped and stared in astonishment. Up ahead, lying beneath a boulder, was a pill bottle.</p><br/><p>Multicolored strands of light wafted about it; it was clearly not an ordinary item. Meng Hao picked it up and opened it. Immediately, a fragrant medicinal smell wafted out. Inside was a medicinal pill the size of a thumb!</p><br/><p>Looking shaken, Meng Hao placed the bottle into his bag of holding. Now he knew what all the white-robed disciples were doing in the area; they were trying to reach this mountain.</p><br/><p>“That’s a Universe Spirit Pill, extremely useful to anyone in the Qi Condensation stage.” Wu Dingqiu laughed as he looked at the trail Meng Hao had left through the Demonic Forest.</p><br/><p>Next to him, Eccentric Song had an extremely unsightly expression on his face. And yet, he let out a cold laugh. “My treasure mountain has many medicinal pills and Spirit Stones in it. This kid can grab a medicinal pill, but if he thinks he can reach the top, he’s dreaming. The Spirit Beasts on my treasure mountain are one in a million. Only the best of the best have the requisite latent talent to be placed on the mountain itself.” He spoke as lightly as ever, and yet the pain in his heart grew more and more intense.</p><br/><p>“Look there,” said Eccentric Song, pointing at a Demonic beast that rose up ahead of Meng Hao. “That is a fierce beast which I raised myself. It has the body of a deer and the head of a python. It is extremely fast, and if it’s injured, becomes even fiercer. It will never stop fighting until it dies, and once it catches the scent of blood, it goes crazy. A Qi Condensation Cultivator who faces it will surely perish.”</p><br/><p>After enough time passed for half an incense stick to burn, miserable shrieks drifted down the side of the mountain. Upon seeing all the blood, Eccentric Song appeared as if he might begin to go crazy. The Demonic beast which would never give up until dying gaped in astonishment, then fled at top speed. Its tail was destroyed and an eye was badly mangled. Worst of all, it only had two legs left. And yet, it still moved quickly, just as Eccentric Song had said. It fled at top speed.</p><br/><p>Meng Hao continued forward. Having passed through another Demonic beast’s territory, he now encountered a pile of several hundred Spirit Stones. Looking excited, he continued on up the mountain.</p><br/><p>Contented laughter rang out from Wu Dingqiu’s mouth. In fact, you could say that from Meng Hao’s appearance until now, he hadn’t stopped laughing.</p><br/><p>“Wow, it really could move fast. Wouldn’t give up until it died!”</p><br/><p>“No matter, no matter. There are many treasures on the mountain, this kid can grab some, but he won’t be able to leave with them. After all, he has to come back down the mountain to do that.” The words ‘no matter’ left his lips, and he looked calm, but he pulled out a Concentration Pill from his bag and put it into his mouth. A crazed look had appeared in his eyes, and he felt a dark premonition in his heart.</p><br/><p>An hour later …</p><br/><p>Meng Hao had already reached the half-way point up the mountain. The entire time, no matter what Demonic beast came his way, he would send it away screaming. There were a few dangerous situations, but with a wave and point of his iron spear, the danger would melt away. Then, heart beating, he would collect up Spirit Stones, medicinal pills, and magical items.</p><br/><p>To Meng Hao, this entire mountain was a treasure trove. Right now, he was retrieving a scroll painting from behind a big boulder. It emanated a gentle glow along with abundant spiritual energy. It was clearly extraordinary.</p><br/><p>Excited, he put it into his bag of holding.</p><br/><p>Below him in the Demonic forest, more than a few Violet Fate Sect disciples lifted their heads up and caught sight of him, leaving them shocked.</p><br/><p>As Eccentric Song watched all of this happening, his face grew darker and darker, and his body began to tremble. He stared at Meng Hao’s bag of holding, inside of which were his Spirit Stones, medicinal pills, and magical treasures; especially the scroll painting. His heart hurt.</p><br/><p>The scroll painting was a treasure he had acquired many years ago. Sealed within were the spirits of quite a few beasts. When his most beloved Demonic beast of all had died some years ago, he had sealed it within. And now, Meng Hao had taken it. Eccentric Song’s body shook even more violently, so he produced two more Concentration Pills and swallowed them down.</p><br/><p>He still struggled to maintain an unconcerned expression, but the ringing sound of Wu Dingqiu’s laughter continued to pierce his eardrums.</p><br/><p>“My treasure mountain has many treasures,” he forced himself to say. “So what if a few of them get taken? He will not be able to escape the mountain. I’ve carefully collected these Spirit beasts from everywhere in the world. There are too many, he won’t be able to escape them easily.”</p><br/><p>Two hours later…</p><br/><p>Meng Hao had almost reached the snowy area past the mountain’s halfway point. He wore an excited expression as he sped forward with even greater speed. Down in the Demonic forest, more than half of the Violet Fate Sect disciples engaged in this trial of fire could see him up there on the mountain. Expressions of surprise and envy covered their faces, especially when he stooped over to pick up things from the ground. Each and every one of them wished they could be in his place.</p><br/><p>Shangguan Xiu stood, fists clenched, jaw clenched, completely helpless. He did not dare to go up the mountain. He was already in enough danger in the Demonic forest. Furthermore, he had overheard some of the white-robed disciples’ conversations, and knew that this was a trial by fire for the disciples of the Violet Fate Sect from the Southern Domain. He felt conflict at heart, and seemed to have no other option than to give up. Only his intense hatred of Meng Hao caused him to reconsider.</p><br/><p>As Eccentric Song watched Meng Hao injure the head of yet another of his precious Demonic beasts, he took out three Concentration Pills and swallowed them, continuing to pretend that he didn’t care.</p><br/><p>“I carefully collected that snow from the tops of auspicious clouds,” he said slowly through his teeth. “It is the most suitable environment for my most treasured Spirit beasts. One of them, the Sky Rending Condor, is well known. Its talons can shatter metal and stone, its wings can kick up a violent wind. It is incredibly fierce, perhaps the most dangerous Spirit beast on the mountain. Even with that crappy spear, this kid is dead for sure when he enters its territory.”</p><br/><p>Three hours later…</p><br/><p>One talon was shattered, half a wing was gone, and the giant condor coughed up blood. Wailing mournfully, it hid itself in the snow, crying out endlessly.</p><br/><p>Meng Hao was almost at the peak of the mountain. All of the Violet Fate Set disciples were staring at him. They didn’t care any more about fighting with the Demonic beasts. They stared in awe at his glittering, shining iron spear, and their eyes burned.</p><br/><p>“Who is this person…”</p><br/><p>“He intruded into our trial by fire and took away our rewards… it’s too cruel.”</p><br/><p>“That iron spear is definitely a treasure from the Heavens! It’s so ferocious!”</p><br/><p>Eccentric Song trembled in distress. He watched as Meng Hao, approaching the mountain’s peak, snatched up a black net. He could no longer feign calm. His stood up and took a step forward, ready to go teach Meng Hao a lesson.</p><br/>\n</div>"}