{"title": "Chapter 75: An Ancient Path Appears Again!", "id": 75, "volume": 1, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-75-an-ancient-path-appears-again", "volume_title": "Volume 1", "body": "<h1>Chapter 75: An Ancient Path Appears Again!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 75: An Ancient Path Appears Again!</strong></p><br/><p>Meng Hao’s face was grim. He looked at the two wooden swords, which hovered three inches away from Shangguan Xiu. Those three inches were like a massive ravine that Meng Hao could not cross with his current Cultivation base.</p><br/><p>As for Shangguan Xiu, at the moment, he couldn’t really be considered a Qi Condensation Cultivator. Although he was still some distance from Foundation Establishment, a Dao pillar was forming within his Core Lake. As of this moment, despite the fact that Meng Hao was at the ninth level of Qi Condensation, he was so weak compared to Shangguan Xiu that he wouldn’t be able to withstand a single blow.</p><br/><p>The gap between the Foundation Establishment stage and the Qi Condensation stage is like that between the sky and the ground, and is something that will never change. With the exception of some unexpected event which goes against the will of the Heavens, it would be impossible for someone of the Qi Condensation stage to kill someone of the Foundation Establishment stage.</p><br/><p>A contest between the two would be like a fight between an infant and a strong man. Even if the strong man were weakened somehow, he could still slay the infant with the movement of a hand.</p><br/><p>Today, Meng Hao had little more than an hour before a Foundation Establishment Cultivator appeared in front of him. His chances were already small, but at that time, he would have no chance at all.</p><br/><p>Time slipped by, and the shadow of death grew closer. Even if he fled, in a very short time, it wouldn’t matter where he went, even if it were to the remotest corner of the Milky Way Sea, he would still be unable to evade death.</p><br/><p>“What should I do….” Meng Hao’s eyes were bloodshot. He wasn’t the only nervous one. Down at the bottom of the mountain, Little Tiger’s face was growing pale. Seeing the developments just now, he gritted his teeth.</p><br/><p>“Meng Hao!” he shouted. His fingers flickered with an incantation, and then he pushed down on his chest. He spat up a massive amount of blood, which flew out in front of him and then formed into a handful of red-colored clouds. “This pearl is my life, allow me to offer some assistance.”</p><br/><p>As soon as the words were out of his mouth, he collapsed into unconsciousness. The pearl sucked Little Tiger’s blood cloud into it and then began to shine with a red glow. It circulated a few more times around the Blood Globe, but then suddenly shot toward Meng Hao. When it reached him, the glow intensified, enveloping Meng Hao with its light.</p><br/><p>At that moment, a strange sensation filled Meng Hao’s heart. It felt as if is Cultivation base were suddenly climbing higher!</p><br/><p>His golden Core sea began to roar as it expanded. Within an instant, it had suddenly doubled in size. Its boundlessness increased so much so that it felt as if it would explode out of his body.</p><br/><p>Meng Hao body suddenly shined with a golden light, making him look completely extraordinary.</p><br/><p>The Demonic Core within him did not undulate, but instead began to spin rapidly. As it did, intense spiritual power flooded through Meng Hao’s body, filling his mind with a thunderous roar, and … a thread of Qi!</p><br/><p>The Qi was weak, just like the thread he had felt when he reached the first level of Qi Condensation.</p><br/><p>What Meng Hao didn’t know, was that this strand of Qi in his mind was actually something that only Foundation Establishment Cultivators should possess; Spiritual Sense!</p><br/><p>Even Shangguan Xiu couldn’t develop it, because he hadn’t completely passed into the Foundation Establishment stage.</p><br/><p>And yet, Meng Hao hadn’t passed into Foundation Establishment either. Instead, he had reached the tenth level of Qi Condensation! Popping sounds rang out through his body. Vast quantities of filth were pushed out through his pores as he experienced a sort of baptism into a higher level of Qi Condensation than anyone else in the world.</p><br/><p>The tenth level of Qi Condensation!</p><br/><p>Meng Hao’s head spun. In the blink of an eye, his body was much tougher and stronger. Not only had he developed Spiritual Sense, but his body has miraculously grown much more powerful.</p><br/><p>In the Cultivation world, the tenth level of Qi Condensation was something rarely seen. In fact, throughout the years, many of the most powerful members of a given generation had done research about the Qi Condensation stage… to determine whether there really even was a tenth level, an eleventh level and a twelfth level.</p><br/><p>Theoretically speaking it was possible; in some ancient text fragments these levels were mentioned. Supposedly, in ancient times, there were a total of thirteen levels in the Qi Condensation stage! According to the legends, even in ancient times, it was rare for someone to reach the tenth level, and even more rare the eleventh level. Any person who reached that level inevitably went on to rock the world.</p><br/><p>In the modern Cultivation world, the tenth level of Qi Condensation was nothing more than a legend.</p><br/><p>Over the years, generation after generation of Cultivators had researched it and eventually a consensus had been reached. In ancient times, there had been thirteen levels of Qi Condensation. But, the ninth level had been set as a limit. The tenth level and beyond had been crippled in accordance with the will of the Heavens. From that time on, there were only nine levels!</p><br/><p>There was another opinion, rejected by most as being absurd, that the ancient will of the Heavens was dead, and that a new will of the Heavens had arisen. The new will of the Heavens only approved of nine levels of Qi Condensation, and had thus broken the path of the tenth level. This was because following the path of the tenth level allowed one to fight against the Heavens, which was prohibited.</p><br/><p>If a Cultivator could accumulate enough spiritual energy of heaven and earth, then they could once again forge the path to reach the fabled tenth level of Qi Condensation of ancient times!</p><br/><p>The path was the focal point. Unfortunately, that path had been broken since ancient times, and though it still existed, was essentially broken beyond all repair.</p><br/><p>But today it appeared in Meng Hao’s body, visible not only to him, but also to a dumbfounded Shangguan Xiu. How could he possibly believe that right there in front of him, Meng Hao… had actually entered into the legendary tenth level of Qi condensation?</p><br/><p>“Impossible… the tenth level of Qi Condensation is just a legend.” Shangguan Xiu’s face was filled with disbelief. “According to the stories, the tenth level of Qi Condensation is a body-strengthening stage… It exists in theory, and even in ancient times, it was rare for it to be achieved…. Impossible!”</p><br/><p>Were Little Tiger not unconscious, he would also be shocked. Even though the pearl was his, and was composed of his life force, it had never had such a shocking effect on him. Whatever level he was at, it allowed him to wield a level of power equal to half of the following level. For example, now he was at the fifth level of Qi Condensation, but in terms of power, he was already half way through the sixth level.</p><br/><p>Meng Hao’s hair flew about wildly and his eyes glowed brightly. He took a deep breath, feeling the immense power that surged through him. He felt the thread of Qi in his mind, as well as the strength rippling through his muscles and blood. He knew that as of now, he wasn’t in the least bit weak.</p><br/><p>And yet, there was a side-effect. As soon as he reached the tenth level of Qi Condensation, it seemed as if the Heavens immediately severed any connection to him. He couldn’t sense any of the power of heaven and earth, as if he had been completely cut off. He felt a wild sucking feeling within him, as if he were a newborn child who needed nutrients… but was denied.</p><br/><p>At the moment, his body still appeared to be that of a weak scholar, but in reality, his flesh was filled with enough strength that he felt as if he could rip a city wall in half.</p><br/><p>Right now, there wasn’t time to consider all of this, though. His eyes flashed as he looked Shangguan Xiu and the disbelief written on the man’s face. Meng Hao took in a deep breath and then lifted up his right hand, pointing his finger toward the wooden swords.</p><br/><p>This finger strike contained all the power of Meng Hao’s tenth level of Qi Condensation, all of his Spiritual Sight, all of the strength of his physical body.</p><br/><p>This was Meng Hao’s most powerful attack. In fact, this was probably the most powerful attack than any Qi Condensation stage Cultivator in the State of Zhao could muster.</p><br/><p>A boom rang out as he tapped the wooden sword. It erupted with sword might, piercing through the three-inch gap and stabbing deeply into Shangguan Xiu’s chest. A bang sounded out as it stabbed completely through his chest, emerging from the other side in a shower of blood.</p><br/><p>Shangguan Xiu’s body shook, and yet he couldn’t move. His eyes filled with dread as he sensed massive amounts of spiritual energy flooding out from the wound. In the blink of an eye, the energy seepage had caught up with this Foundation Establishment. Now the time it would take to reach the Foundation Establishment stage was much, much longer.</p><br/><p>It was at this time that Meng Hao’s hand lifted up again, and tapped the other wooden sword. It hummed as it proceeded forward toward Shangguan Xiu’s neck.</p><br/><p>“Meng Hao, you don’t dare to kill me….” Shangguan Xiu was completely in a panic now. His previous cold arrogance and killing intent had vanished, replaced with a desperate struggle to evade death.</p><br/><p>Meng Hao said nothing. His eyes glowing darkly as the sword he had just tapped passed through the three-inch gap and stabbed into Shangguan Xiu’s neck. In the instant that it pierced into his neck, Shangguan Xiu suddenly twisted his head to the side in an impossible fashion. The wooden sword sliced open a massive wound which erupted with blood, and yet it didn’t kill him.</p><br/><p>Dread permeated Shangguan Xiu. He could feel his life force beginning to fade and his spiritual power dissipating. As the spiritual energy poured out of him, his body was beginning to grow a bit more responsive.</p><br/><p>“Meng Hao, there’s no hatred between us that can’t be resolved. If you let me go, I will give you the Sublime Spirit Scripture….” Shangguan Xiu couldn’t be any more terrified. Even before he finished speaking, the two wooden swords circled back, stabbing back through his chest, showering blood everywhere. Shangguan Xiu let out a blood-curdling scream filled with weakness and despair.</p><br/><p>Meng Hao didn’t care in the least bit when he mentioned the Sublime Spirit Scripture. His eyes were as hard as ever; it didn’t matter what Shangguan Xiu said, he wouldn’t stop until he was utterly and completely dead.</p><br/><p>This was Meng Hao. Once he made a decision, he wouldn’t change his mind easily.</p><br/><p>-----</p><br/><p><em>This chapter sponsored by Sai Pakalapati, Tjandra Johannes and Anand Manthripragada</em></p><br/>\n</div>"}