{"title": "Chapter 73: Fierce Fighting", "id": 73, "volume": 1, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-73-fierce-fighting", "volume_title": "Volume 1", "body": "<h1>Chapter 73: Fierce Fighting</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 73: Fierce Fighting</strong></p><br/><p>“Ninth level of Qi Condensation!” Eyeing Meng Hao, Shangguan Xiu took a deep breath. He had been maintaining the spell here for two months. The Cultivators from Milky Way City didn’t know the true reason he was here, and he didn’t want their top level experts around anyway. He was here for Meng Hao.</p><br/><p>Based on everything he had seen and heard recently, he had been sixty-percent certain that Meng Hao possessed some sort of unholy treasured item that could endlessly duplicate treasures.</p><br/><p>Otherwise, how could he have so many medicinal pills and flying swords? Also, how could Meng Hao have not noticed that ten of his flying swords went missing on the day of his battle with Wang Tengfei?</p><br/><p>They appeared to have been broken, but in fact, had been secretly taken away by Shangguan Xiu and carefully studied. He had discovered that all ten of the swords were composed of exactly the same materials.</p><br/><p>Even though all flying swords look the same in general, there will always be tiny differences left behind in the manufacturing process which can be spotted later. Except, among Meng Hao’s swords, the details were exactly the same. This, of course, aroused Shangguan Xiu’s suspicions.</p><br/><p>And yet, he wasn’t completely convinced because of that evidence. But now, seeing that Meng Hao’s Cultivation base had already reached the ninth level of Qi Condensation, he was even more sure. Eighty percent or more.</p><br/><p>“You may have reached the ninth level of Qi Condensation, but clearly you just broke through,” said Shangguan Xiu, his eyes shining coldly. “Should you try to run away again today, I will detonate that Blood Globe I just sent down the mountain. If that happens, then the people of the three counties will be reduced to ash and smoke in the blink of an eye.” He really was worried that Meng Hao would flee, so before attacking, had taken preparations to prevent him from doing so.</p><br/><p>“I won’t be running away today.” As Meng Hao looked at Shangguan Xiu, nearly five years of memories flooded into his mind. Their issues from before the Sect dissolved, the chase after the Sect disbanded, all of these things flashed before Meng Hao’s eyes. His killing intent flashed. He lifted his hand, and a massive Flame Python appeared, over thirty meters in length. Not only was its size impressive, but from its head protruded a large horn. Flames flickered off of its body as it shot toward Shangguan Xiu, radiating intense heat.</p><br/><p>The severed heads surrounding Shangguan Xiu crackled and burned from the heat, and some of them even began to roll in his direction. He laughed, slapping his bag of holding and producing a five-colored banner. The massive banner unfurled and a five-colored mist roiled out from within it. The mist then transformed into five mist spirits, each of them dozens of meters tall. With hideous grins, they charged toward the Flame Python.</p><br/><p>A massive explosion occurred, smashing nearby boulders into dust and reducing the surrounding trees and rattan vines of Mount Daqing into powder. Dust and ash swirled in the air, making the scene somewhat blurry.</p><br/><p>Amidst the haze, Meng Hao dashed forward at incredible speed. The remaining severed heads which had not been incinerated continued to tumble toward Shangguan Xiu. His eyes flashed, and his fingers flickered in an incantation sign. Then he shoved his hands out in front of him.</p><br/><p>“Five-colored Death!” he shouted, and a shrill shrieking sound suddenly rose up around him. Meng Hao smacked his bag of holding. The scroll painting appeared in his hand. He unrolled it, and six beasts leaped out, howling.</p><br/><p>A massive thunderous rumble surrounded them. Meng Hao charged toward Shangguan Xiu, whose cold eyes flickered radiantly. Shangguan Xiu moved forward as well. More severed heads were crushed into pulp.</p><br/><p>“Do you know what the Reliance Sect was called before Patriarch Reliance?” said Shangguan Xiu coolly. “It was called the Demon Sealing Sect!” He suddenly looked toward the peak of Mount Daqing and stamped his foot down. Mount Daqing began to rumble, and then suddenly, an impossible-to-describe aura erupted out from within the mountain. It was only a strand, yet that strand seemed to quiver with the very power of heaven and earth. It was not sentient, but rather, under the control of Shangguan Xiu. It roiled up from the ground beneath Meng Hao’s feet.</p><br/><p>Shangguan Xiu suddenly seemed to grow older, as if he had aged ten years. He looked almost like a corpse that had crawled its way out of the grave.</p><br/><p>Clearly the magical technique he had just used was extremely difficult to employ, and required a sacrifice of longevity. Originally, he would never have used it, but seeing the level of Meng Hao’s Cultivation base, he decided that he had no other choice. He wanted to bring about a swift end to the battle. After all, all the Cultivators in the State of Zhao were hunting Meng Hao right now.</p><br/><p>This battle would surely attract their attention. If he could end the fight quickly, then he would have plenty of time to get his hands on the treasure he sought.</p><br/><p>“The Demon Sealing Sect sought out the great Demons of the world, sealed them, released their spirit, and took their power to trample on the Heavens! You just entered the ninth level of Qi Condensation, what could you possibly use to fight me with? If I wanted, I could have reached Foundation Establishment fifty years ago!” As Shangguan Xiu spoke, Meng Hao waved the scroll painting, using it to resist the aura strand that had burst out around his feet.</p><br/><p>But as soon as the scroll painting touched the aura, an explosion rang out, and cracks appeared on its surface as it was thrown violently away. The aura strand shot toward Meng Hao.</p><br/><p>There was a bang, and Meng Hao coughed up a mouthful of blood. The feathered fan had appeared in front of him in the blink of an eye to shield him. Cracks split the feathers, as Meng Hao took advantage of the moment to evade. Evade he did, but he was still sent tumbling backward, coughing up three mouthfuls of blood.</p><br/><p>Only one move had been made, and Meng Hao was already injured. It was clear that Shangguan Xiu possessed unfathomable secrets. He laughed coldly. He had expended some of his longevity to make this attack. Even though it hadn’t killed Meng Hao outright, Shangguan Xiu was still determined to win. He walked forward, stepping over the smashed, bloody remains of the severed heads.</p><br/><p>Meng Hao’s mouth was filled with blood, but his eyes shone with viciousness. At the same moment that Shangguan Xiu began to walk forward, Meng Hao lifted his hand, and within the pulp of the severed head, a black aura arose. In an instant, the aura coalesced into a black scorpion. It moved like lightning, so quickly that Shangguan Xiu had no time to pull back his foot, nor to leap away. The scorpion’s stinger sank into the flesh of Shangguan Xiu’s foot.</p><br/><p>As the stinger sank in, the scorpion turned into strands of blackness which poured into Shangguan Xiu.</p><br/><p>His face twisted. This turn of events was too sudden and unpredictable. The scorpion, of course, was from the rare magical pill that he had acquired that day from Qian and Lu from the Violet Fate Sect. This magical scorpion was hyper toxic!</p><br/><p>The black aura entered Shangguan Xiu’s foot, and then merged into his Qi passageways, filling his entire body in an instant. His face turned black and he spit up a mouthful of black-colored blood, which stank like rotten fish.</p><br/><p>“What poison is this!?” said Shangguan Xiu, his expression shocked as he retreated. A feeling of weakness spread through him like floodwaters. Knowing he had little time to think, he slapped his bag of holding and produced a medicinal pill, which he swallowed.</p><br/><p>Meng Hao had planned things well to make a move in a moment just such as this. Even his three mouthfuls of blood had been coughed up intentionally, all to make Shangguan Xiu think that he had the upper hand. As soon as his opponent retreated and pulled out a medicinal pill, Meng Hao charged forward. He smacked his bag of holding, and the black net shot forth, threatening to envelop Shangguan Xiu.</p><br/><p>It takes longer to describe what was happening than the actual time it took to happen. Shangguan Xiu’s expression flickered as he downed the medicinal pill. His fingers began to flicker in an incantation, even as the net began to cover him. Meng Hao moved forward without pause. The black, wooden bow appeared in his hand, and he pulled back on the bowstring, then sent an arrow screaming toward Shangguan Xiu.</p><br/><p>Shangguan Xiu moved backward at high speed. A medicinal pill, a black net, an arrow and an incantation. He didn’t have time for all, he would have to pick two.</p><br/><p>A booming sound rang out. Shangguan Xiu downed the pill, but abandoned his incantation. He managed to evade the black net, but couldn’t avoid the arrow. It shot into his right shoulder, emerging from the other side in a shower of blackened blood.</p><br/><p>Intense pain flashed through him, but Shangguan Xiu let out a low snort. Meng Hao didn’t pause for even a moment. A second arrow whistled forth, followed by a third and a fourth. Meng Hao moved forward relentlessly. Every step he took, he shot an arrow; seven steps, seven arrows.</p><br/><p>The seven arrows shot forward, screaming through the air with shocking killing intent!</p><br/><p>Shangguan Xiu continued to retreat, struggling to control the spread of the black strands throughout his body. And yet, he also had to dodge the incoming arrows. But being at the ninth level of Qi Condensation, he could only do so much. He might be at the absolute peak of the ninth level of Qi Condensation, a hair away from the Foundation Establishment stage, but he was still not at the Foundation Establishment stage.</p><br/><p>No, he was still far from Foundation Establishment stage. Just like Meng Hao, he was still in the Qi Condensation stage. The difference in the level of power between the two was like the difference between the sky and the ground.</p><br/><p>He couldn’t do everything perfectly at the same time. A booming sound reverberated through the air as the seven arrows pierced his right arm, completely destroying it. This was the only thing he could do to defend against the arrows. He paid the price of a right arm in order to be able to focus on bringing the poison in his body under control temporarily.</p><br/><p>Even as he did so, an eighth arrow shot toward him from Meng Hao, then a ninth. He raised his head to the sky and howled.</p><br/><p>From the day he began to walk the path of Cultivation until today, he had never been in such a dangerous, tight situation. He had lost an arm! The price he had paid, the pain he felt, drove his desire to kill Meng Hao to a new, intense height.</p><br/><p>His eyes were bloodshot; the poison was under control, but could not easily be expelled. In fact, as of now, he could tell that it would be impossible to expel the poison while he was in the Qi Condensation stage. Only if he reached Foundation Establishment could he do so.</p><br/><p>“Milky Way Sea!” he shouted, his hair flying about him crazily. He bit the tip of his tongue and spit out a glob of blood. A violet pearl flew out from within the blood, within which could be seen what appeared to be a seething mass of wind. As soon as it appeared, a fierce gale arose, sending Meng Hao’s latest three arrows into a spin. Then, they simply collapsed into pieces.</p><br/>\n</div>"}