{"title": "Chapter 88: Lord Revelations True Self", "id": 88, "volume": 1, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-88-lord-revelations-true-self", "volume_title": "Volume 1", "body": "<h1>Chapter 88: Lord Revelations True Self</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 88: Lord Revelation’s True Self</strong></p><br/><p>Boom!</p><br/><p>The two wooden swords stabbed simultaneously through Meng Hao’s body, sending showers of blood flying out. The flame of Meng Hao’s life force was growing dimmer. However, the gravitational force within him had grown to an unprecedented height. It was so strong that it seemed as if it might be able to suck in everything around him. It was as if regardless of whatever obstacle faced him, regardless of whatever danger he was in, nothing could block his path to becoming a powerful expert.</p><br/><p>The gravitational force seemed to be affecting Meng Hao’s stupor. His mind expanded into boundlessness.</p><br/><p>Patriarch Reliance looked at him and murmured, “This is… stealing good fortune from the Heavens!”</p><br/><p>At the moment, Meng Hao’s desire to be powerful had fused with his Cultivation base, a stubborness which belonged to the thirteenth level of Qi Condensation; he would steal from the Heavens; he would defy the Heavens to change his life force.</p><br/><p>A thunderous boom sounded out as the full and complete spectrum of spiritual energy from the seven oil lamps poured into Meng Hao. As it entered his body, it became his blade with which to attack and break through the level gap.</p><br/><p>It was the combined power of six Core Formation Cultivators and one Nascent Soul Cultivator. But that was only part of it. The most important part of his attack, the truest part, was his stubborn desire to become powerful. This desire was completely in line with the thirteenth level of Qi Condensation, which had been rejected by the Heavens. This was what forged his thirteenth level of Qi Condensation!</p><br/><p>Amidst the roaring, the level gap disintegrated. The instant it did, Meng Hao, bathed as he was in inexhaustible spiritual energy, felt his Cultivation base soaring up from the twelfth level to the thirteenth level. He had now become the first Cultivator since ancient times to complete the great circle of Qi Condensation.</p><br/><p>In that instant, the latent talent in Meng Hao which enabled him to practice Cultivation, suddenly changed. There was no sound or any other indication that it had happened. Even Meng Hao was only vaguely aware of the change. However, if an outsider were to examine his current latent talent, they would see that it was no longer average, as it had been in the past. Although he couldn’t be considered Chosen, his latent talent was now much higher.</p><br/><p>From time immemorial, no one had ever been able to change their own latent talent. No heavenly material or earthly treasure had the power to change the destiny appointed by the Heavens. And yet today, Meng Hao had done just that!</p><br/><p>He was the first person since ancient times to complete the great circle of Qi Condensation, as well as the first person to change his latent talent. This was a new beginning, a fresh start on the path to becoming a powerful expert.</p><br/><p>The instant he completed the great circle of Qi Condensation, all of the wounds in his body healed instantly. Immersed in spiritual energy, his body had experienced another rebirth.</p><br/><p>You could even say that Meng Hao himself had been reborn anew.</p><br/><p>After the time it takes for an incense stick to burn, Meng Hao’s eyes flashed open. The surrounding spiritual energy once again began to surge down into the earth. Now that he had completed the great circle of Qi Condensation, the gravitational force within him was completely gone.</p><br/><p>Having witnessed Meng Hao’s transformation with his own eyes, Patriarch Reliance was left speechless.</p><br/><p>Even more astonishing was that after Meng Hao opened his eyes, he reached out with his right hand and picked up one of the seven oil lamps. This was the lamp which contained Lord Revelation’s Nascent Soul. After picking it up, he turned, and his body turned into a beam of light as he shot toward the vortex exit.</p><br/><p>“You, you, you… aren’t you afraid of getting burned to death!?” Patriarch Reliance sat in a daze for a moment, and then started cursing again as he watched Meng Hao disappear through the vortex.</p><br/><p>“You little bastard! You’re shameless!! You people from the Demon Sealing Sect are all bastards! Shameless to the extreme!!” He paced back and forth furiously, letting out a torrent of howls.</p><br/><p>As soon as Meng Hao left through the vortex, the Immortal’s Cave began to seal up behind him. Only a rapidly closing fissure remained, from which emanated the stench of death.</p><br/><p>Within the Southern Domain, outside of the State of Zhao, was a bordering nation called the State of Revelation. The land itself wasn’t much different from that of the State of Zhao, but its people were somewhat bizarre.</p><br/><p>Whereas the State of Zhao revered the Eastern Lands, the State of Revelation did not. They did not pay obeisance to the Great Tang, but rather, the mysteries of the Heavens. Therefore, all the Sects within the State of Revelation were branches of the Revelation Sect.</p><br/><p>In the mysterious eastern regions of the State of Revelation were three mountain ranges which wound back and forth like twisting dragons. One particular mountain peak had the appearance of two dragon heads locked in combat. This was the pinnacle of the State of Revelation. Mist curled around the peak, on top of which was a bell. Once per year, the bell would toll, and the echoes would reverberate out for three days.</p><br/><p>Beneath the bell was a forest of ornate buildings. This was none other than… the most powerful Sect in the nation, the Revelation Sect!</p><br/><p>Atop the main gate of the Revelation Sect sat a Cultivator who wore black robes. He was very old, and had the demeanor of a transcendent being. In the memories of the disciples of the Revelation Sect, it had been a very, very long time since he had sat down there in meditation. No matter how the wind and rain buffeted him, no matter how many years passed by, he sat there like a rock, eternally still.</p><br/><p>Many disciples didn’t even know who he was. Considering how he sat cross-legged in meditation underneath the Revelation Bell, he was clearly an Elder of the Sect. However, whenever the powerful experts of the Sect looked at him, their eyes would fill with intense looks of veneration.</p><br/><p>At the moment, the Revelation Sect was filled with the uninterrupted sound of disciples chanting scriptures. The sound formed an invisible force which drifted about, then slowly congealed at the top of the mountain, where there seemed to be some type of vortex. The vortex would slowly suck in the power of the chanting.</p><br/><p>This was something that only Cultivators could see. The chanting of the Revelation Sect disciples rose up and then merged into the Revelation Bell. In fact, the bell seemed to be sucking in, not just the chanting of the Cultivators, but the prayers of everyone in the entire nation.</p><br/><p>At this moment, the old man who had been sitting under the Revelation Bell for seemingly an eternity, began to tremble, and then coughed up a mouthful of blood. Suddenly, the bell tolled, its sound echoing into the sky and sounding out through the entire State of Revelation.</p><br/><p>The disciples within the Revelation Sect were shocked. The Sect Elders and powerful experts instantly opened their eyes from meditation. One by one, they turned into prismatic beams which shot toward the Revelation Bell.</p><br/><p>When they arrived, they saw the black-robed old man sitting there, his eyes wide open.</p><br/><p>“Greetings, Patriarch!”</p><br/><p>“Patriarch, are you in good health?” Dozens of Cultivators surrounded him, bowing respectfully with clasped hands.</p><br/><p>The black-robed old man’s eyes flashed as if with lightning. His left pupil blazed with an intense brightness and looked like the sun, whereas his right pupil exuded darkness and had the appearance of a crescent moon. The two pupils were completely different. One look at this man, and you would never be able to forget him.</p><br/><p>When he opened his eyes, it seemed as if his forehead had split, and another eye appeared. However, this was an eye invisible to others. The only thing an observer would see was a blood-red glow. Above him, storm clouds began to gather, and a fierce wind whipped about.</p><br/><p>“Patriarch Reliance! You destroyed my clone and refused my good intentions. You’re… You’re finished! I’m not the only one with a few tricks up my sleeve. What do you have to fall back on, your trifling Spirit Severing? You truly dare to arouse the wrath of the Dawn Immortal?!” The old man’s face was grim. He slapped his hand onto the ground, and the mountain peak trembled. Ripples shook the ground, sending the surrounding Cultivators retreating in shock.</p><br/><p>At the same time as the mountain began to shake, the Revelation Bell sounded out, then rose up into the air. Surrounding the bell were countless magical symbols which flew and twisted about, glowing brightly. The glow was nearly blinding, and spread out throughout the entire State of Revelation.</p><br/><p>“The Demonic forces are descending! It is exactly as our ancestors divined! This shall prove to be a calamity for Heaven and Earth, but also a chance for Revelation to rise! I shall take back my clone’s Nascent Soul, and then we will see if Patriarch Reliance still dares to be arrogant!”</p><br/><p>Of course, this black-robed man was none other than Lord Revelation. His clone had been consumed by Patriarch Reliance, and this was his true self. As he spoke, he stood and flew up into the sky. He snatched up the enormous Revelation Bell and then transformed into a multicolored rainbow and shot toward the State of Zhao, radiating killing intent.</p><br/><p>Meanwhile, within the state of Zhao, a buzzing sound could be heard within the ancestral hall of the Cold Wind Sect. With a strange look on his face, the disciple on duty pushed open the door. When he looked inside, his entire body began to shake, and a look of astonishment and intense dread appeared on his face.</p><br/><p>Within the ancestral hall, the life slips of various Sect Cultivators were neatly lined up on display. Suddenly, the life slips belonging to the Sect’s Core Formation Priest as well as Elder Taishang began to crack and crumble!</p><br/><p>This meant that the Core Formation Priest and Elder Taishang had died!</p><br/><p>Furthermore, the slips belonging to the Foundation Establishment Elders fell apart. When this happened, the disciple on ancestral hall guard duty shook. A look of disbelief filled his face.</p><br/><p>When the Core Formation Priest had departed with the others, he’d left behind a Foundation Establishment Elder to guard the Sect. When that man learned of the news, his face went pale, and he immediately ordered that no one be told. He knew that if something like this happened to a Sect, if its Core Formation experts were killed, it was nothing other than a catastrophe. It would likely lead to the downfall of the entire Sect. For almost all of the Foundation Establishment Cultivators to be wiped out would only hasten the fall.</p><br/><p>“What happened in Patriarch Reliance’s meditation zone?!” The Foundation Establishment Elder immediately gathered a group of Qi Condensation disciples and sent them in the direction of the Reliance Sect.</p><br/><p>Next, trying to calm his mind, he took hold of a special horn that hadn’t been sounded out for hundreds of years.</p><br/><p>This horn had a name: Horn of the Dao.</p><br/><p>Sounding the Horn of the Dao would awaken the Sect’s Dao Reserves!</p><br/><p>Every Clan and Sect had Dao Reserves, which would be passed down from generation to generation. For the three great Sects, their Dao Reserves would generally consist of a Sect Patriarch who had failed in reaching the Nascent Soul stage, but postponed death by resting in suspended animation in a Pseudo Nascent Soul condition. Only they would be able to suppress the panic that would arise because of the impending catastrophe.</p><br/><p>When the horn call sounded out in the Cold Wind Sect, it reached the ears of an old withered man sitting cross-legged in a top-secret Immortal’s Cave. He looked dead; his body was so emaciated it was little more than skin and bones. But when he heard the call of the horn, his eyes opened.</p><br/><p>His Spiritual Sense instantly roared out, enveloping the entire Cold Wind Sect. When it entered the body of the Foundation Establishment Cultivator, the man began to tremble, and a look of pain appeared on his face. He was filled with a powerful feeling that seemed as if it could obliterate him. This was Spiritual Sense, which was being used to rifle through his memories.</p><br/><p>After a while, the Spiritual Sense departed, and the Foundation Establishment Cultivator fell to the ground panting, his body limp and his face pale. He knew that if he wasn’t of the Foundation Establishment stage, the memory search that had just been performed on him would have killed him.</p><br/><p>A profound voice echoed out throughout the Cold Wind Sect. “Take my Freezing Jade and seal off all the mountains around the Reliance Sect. Do not let anyone out of the region. I will be awake in a few hours. In the meantime, you go search the area for any clues.” The Foundation Establishment Cultivator immediately struggled to his feet, then clasped his fists and bowed deeply.</p><br/><p>An ice-cold piece of blue jade flew into his hand.</p><br/><p>Similar scenes played out in the Winding Stream Sect and the Upright Evening Sect. When the life slips belonging to their Priests and Elders crumbled, they all used their Sects’ Dao Reserves.</p><br/><p>As of this moment, the Cultivation world of the State of Zhao had been thrown into an uproar.</p><br/>\n</div>"}