{"title": "Chapter 85: Ancient Demon Sealing Jade", "id": 85, "volume": 1, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-85-ancient-demon-sealing-jade", "volume_title": "Volume 1", "body": "<h1>Chapter 85: Ancient Demon Sealing Jade</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 85: Ancient Demon Sealing Jade</strong></p><br/><p>Greedy and stingy. A miser to the core, even in terms of Cultivation. This was his Dao. In his enlightenment, treasures were the most important thing. These were the things that led to his First Spirit Severing.</p><br/><p>This was why his meditation zone had so many areas protected by restrictive spells. It was his life savings. Accumulating all these items was not just a hobby, it was his version of the Dao.</p><br/><p>To see it all disappearing before his eyes filled him with grief and indignation.</p><br/><p>Within the space of ten breaths, the mountain of Spirit Stones was gone. There was even a random piece of jade underneath the mountain. It too was sucked into the bag of the Cosmos.</p><br/><p>“That was my good luck charm. Dammit, Meng Hao, leave my good luck charm behind. You….” Before he could finish speaking, his eyes went wide again. After taking all the Spirit Stones, Meng Hao looked around, his eyes gleaming. Patriarch Reliance began to tremble.</p><br/><p>The look in Meng Hao’s eyes was like that of a master thief.</p><br/><p>His gaze fell onto a small courtyard. Behind the cracked restrictive spell could be seen a variety of medicinal plants of many different colors. They were clearly beyond ordinary.</p><br/><p>Meng Hao recognized some of the plants as ones described in Shangguan Xiu’s treasured turtle shell. As he strode forward, his fingers flickered, and the two wooden swords appeared. They stabbed into a crack in the shield created by the restrictive spell. The crack slowly widened.</p><br/><p>“Meng Hao, are you really going to steal my treasured items too? I’m your Patriarch! I paid a heavy price to steal that medicinal courtyard all those years ago….” Patriarch Reliance was growing even more anxious. The rumbling noise from under the ground grew stronger, but Meng Hao didn’t even blink. He was happy to finally be able to vent his anger.</p><br/><p>“My divine spirit plants… you, you… you’re plucking them all out!” Patriarch Reliance’s anger soared to the heavens. “That’s my Outlander Tree. I cared for it for hundreds of years before it sprouted, you can’t take it….” Amidst Patriarch Reliance’s shrill protestations, Meng Hao cleared out the courtyard as cleanly as if he’d used a razor. He sucked everything into the bag of the Cosmos. By the time he withdrew the two wooden swords, the courtyard looked as if it had been swept by a massive gale.</p><br/><p>“Enough, enough,” said Patriarch hastily, looking over the emptiness. “Listen, little Patriarch, leave some things behind for old Patriarch here. Don’t take anything else…. You’re not allowed to touch any more of my things. Meng Hao, you listen to Patriarch, okay? As a member of the junior generation, you should have a bit of respect. You….”</p><br/><p>“I’ve been like this since I was young,” said Meng Hao with a cold snort, throwing Patriarch Reliance’s words back at him. Looking around, he caught sight of a lone restrictive spell shield. Beneath it were what appeared to be three withered little trees. However, on each tree was a leaf that occasionally sparkled with arcs of energy, making them appear extraordinary.</p><br/><p>Meng Hao had never seen anything like it, but considering this was Patriarch Reliance’s meditation zone, and it was protected with a restrictive spell, he figured it must be very valuable. His eyes glittering, he strode over and stabbed the wooden swords into a crack in the still-recovering restrictive spell.</p><br/><p>“Those are my Thunderclap Leaves. It’s a Lightning type medicinal plant that’s even rare in the Southern Domain!” Patriarch Reliance once again howled fiercely. Completely ignoring him, Meng Hao lifted the bag of the Cosmos up to the hole in the restrictive spell. The trees began to shake back and forth. Then, the three leaves ripped off of the trees, transforming into three arcs of black lightning which shot into the bag of the Cosmos.</p><br/><p>Even more infuriating to Patriarch Reliance was that after the leaves entered his bag, Meng Hao didn’t stop. The trees continued to sway back and forth until suddenly they flew up from the ground, roots and all, and were sucked into the bag of the Cosmos. Next to the trees was a little purple flag stuck into the ground, which was also sucked into the bag.</p><br/><p>“You even… you ripped the Thunderclap Trees up by the roots and took them too! You’re really pissing me off!! Meng Hao, you little bastard, you took the Lightning Flag as well? It’s not very strong; it can only defend against a Foundation Establishment attack. But it can absorb lightning bolts! You need it to grow the Thunderclap Leaves!! Patriarch Reliance’s heart dripped with blood as he howled and cursed in his subterranean chamber.</p><br/><p>“I’ve always had a good temper,” snorted Meng Hao, throwing more of Patriarch Reliance’s words back in his face. “You’re Patriarch of the Reliance Sect. At the moment, we’re the only people in the whole Sect! I of the junior generation am not going to get angry at you. Actually, a lot of people have cursed me over the years. It doesn’t really matter.” Once again, he looked around.</p><br/><p>This caused Patriarch Reliance’s heart to seize. When he saw Meng Hao’s gaze slide past another area with medicinal plants, he let out a small sigh of relief. His meditation zone contained his life’s accumulation of treasures, but even still, the treasures could be categorized into high and low quality items.</p><br/><p>“Just don’t touch my baby,” thought Patriarch Reliance. “Everything else… they’re just trifling worldly possessions. I can gather more together later if I want.” Patriarch Reliance’s teeth were clenched, but his heart still continued to drip blood. In actuality, the word “trifling” had been a bit forced.</p><br/><p>Within moments, Meng Hao had cleared out a few more courtyards of medicinal plants. Then he moved on to another area. Patriarch Reliance could only clench his jaw. He could do nothing more than let loose a torrent of abuse upon Meng Hao. He cursed and cursed, never repeating himself for more than half a sentence.</p><br/><p>As he cursed, Meng Hao started to hum a little tune. It was a happy little tune, and just so happened to be the one Patriarch Reliance had been humming earlier. When Patriarch Reliance heard it, it made him so mad that he almost coughed up blood. The feeling he experienced was impossible to describe, but suffice to say, he was now experiencing the full repercussions of incurring Meng Hao’s wrath.</p><br/><p>Patriarch Reliance watched as Meng Hao looked around. When his gaze came to fall on a stretch of short wall, Patriarch Reliance’s heart began to race, and he furiously said, “You little bastard, you’re too cruel! I didn’t dispel your poison, that’s all. I even gave you a reward. A low-grade Spirit Stone is still a Spirit Stone.”</p><br/><p>Meng Hao had inspected almost all of the restrictive spells for cracks. In this area, many of the restrictive spells were completely recovered.</p><br/><p>He circled the area, his eyes flashing back and forth. Suddenly, he realized that Patriarch Reliance had stopped speaking. He had only taken about thirty percent of the treasures in the area, and most were medicinal plants. He still wanted to vent some anger, so he decided to make one more circle to check for damaged restrictive spells.</p><br/><p>When he returned to the place he’d started from, he frowned. There didn’t seem to be anything special in there. He looked around and noticed a stretch of short wall. When he started to walk toward it, Patriarch Reliance suddenly began talking again.</p><br/><p>“Alright, alright. Meng Hao, you’re my only heir.” As Patriarch Reliance watched Meng Hao walking toward the short wall, he grew more and more anxious. But his anxiety couldn’t be detected in his voice. He sounded somewhat emotional as he said, “I’ll dispel your poison. Just wait three months. I’ll break out and take care of it for you. Then you can give me my treasures back. What do you say? Don’t worry, I always keep my word. This time, I’ll swear it in the name of the Sect. I definitely won’t deceive you.”</p><br/><p>Meng Hao stopped walking and looked down at the ground. His eyes flickered, and he didn’t say anything. He walked around, seemingly lost in thought; eventually he drawing close to the short wall.</p><br/><p>“I never said that I wasn’t going to dispel the poison,” said Patriarch Reliance. He let out a sigh. “It’s just that dispelling the poison would require quite a sacrifice of my Cultivation base. I would have to spend a lot of the energy I had just absorbed.” His voice seemed to be deep and profound, but in actuality, as he saw Meng Hao nearing the short wall, his heart was filled with acute nervousness.</p><br/><p>Meng Hao was silent. After the space of several breaths, he suddenly spoke.</p><br/><p>“Why did you start talking when I began walking toward this wall, Patriarch? And why did you suddenly mention dispelling my poison? Could it be that there is some special treasure hidden here?” As the words came out of his mouth, Patriarch Reliance’s eyes went wide. He realized he had said the wrong things. He secretly cursed Meng Hao for being so crafty.</p><br/><p>“I’m just trying to do the right thing,” said Patriarch Reliance with a cold harrumph. “Look kid, you…” Before he could finish speaking, Meng Hao jumped over the wall.</p><br/><p>This filled Patriarch Reliance with fear and trepidation. His heart began to pound and his face fell. After leaping over the wall, Meng Hao looked around. As it turned out, there was a restrictive spell here.</p><br/><p>It didn’t look very special. Sealed inside was a jade slip. As for the restrictive spell, it was not complete; it still had some cracks in it. Meng Hao had no idea what the jade slip was, but without hesitation, he flicked his sleeve, stabbing the two wooden swords into the spell. He pried open a hole, then used the bag of the Cosmos to retrieve the jade slip.</p><br/><p>Seeing the jade slip disappear into Meng Hao’s bag caused Patriarch Reliance to emit a shrill shriek. The ground shook so hard it seemed it might crack. Before, Patriarch Reliance had been upset to see Meng Hao taking his treasures, but this fury was much more intense.</p><br/><p>“Meng Hao, you cannot take that jade slip away! Even I don’t dare to go near it. It belongs to a friend who left it here for safe keeping. You do not have the latent talent or the destiny to touch it! Do not remove it!”</p><br/><p>Paying him no heed, he leaped onto a flying sword and flashed toward the vortex exit. At the same time, he slapped the bag of the Cosmos and pulled out the jade slip. Pressing it against his forehead, he cast some spiritual power into it. His expression changed as three characters appeared in his mind, filled with a Demonic aura.</p><br/><p>“Demon Sealing Sect….”</p><br/><p>“Meng Hao, you little bastard, get back here! You wait until I break through this seal. Then you’re finished!” Patriarch Reliance let out a furious howl.</p><br/><p>As the howl echoed out, Meng Hao’s eyes flashed. He stopped at the mouth of the vortex, and then looked back down.</p><br/><p>His eyes began to glitter. When Patriarch Reliance saw this, his heart began to thump again, and a strange premonition filled his heart. In his heart, in his mind, Meng Hao looked like nothing more than out-and-out thief.</p><br/><p>-----</p><br/><p><em>This chapter was sponsored by Randall Klatt</em></p><br/>\n</div>"}