{"title": "Chapter 94: You Really Want Me To Come Out?", "id": 94, "volume": 1, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-94-you-really-want-me-to-come-out", "volume_title": "Volume 1", "body": "<h1>Chapter 94: You Really Want Me To Come Out?</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 94: You Really Want Me To Come Out?</strong></p><br/><p>An incredible roaring boom sounded out from the massive hand as the glowing red beam sliced through it. Starting in the space between the middle and ring finger of the hand, a massive gash appeared, cutting it completely in half.</p><br/><p>One slash, and the hand was severed.</p><br/><p>“You!!!” cried Lord Revelation. His face flickered, and he lifted his head, his eyes flashing.</p><br/><p>A thunderous boom rolled across the land. The giant hand, tens of thousands of kilometers wide, had moments ago blotted out Meng Hao’s vision, covering the entire land. But in the blink of an eye, a gap appeared, and Meng Hao could suddenly see the sky.</p><br/><p>The hand split apart into two halves, each of which slammed into the ground on either side of Meng Hao.</p><br/><p>The ground trembled and began to sink down. The mountains were crushed. All the wild creatures in the area, unable to flee, were instantly transformed to ash.</p><br/><p>The Cold Wind Sect Foundation Establishment Cultivator, despite having spared no effort in his attempt to flee, could not possibly escape in such a short time. He was smashed to death into the ground.</p><br/><p>The Cultivation bases of the three Pseudo Nascent Soul Patriarchs were anything but ordinary. Furthermore, Lord Revelation was not targeting them with his attack. They also sacrificed elements of their Cultivation bases to flee. Coughing up seven or eight mouthfuls of blood each, they just managed to reach the edge of the giant hand. Behind them, the earth seemed to have turned into a violently churning sea. As the hand disappeared, they mutely looked back at the scene.</p><br/><p>Previously, the Reliance Sect had been surrounded by endless mountain chains. As of now, the only thing that remained was a massive recess in the ground. Its shape was that of a giant hand.</p><br/><p>However, the handprint was not complete. Splitting it down the middle was a jagged section of earth jutting up into the sky like a mountain!</p><br/><p>On top of the mountain stood Meng Hao. Beneath him was a stretch of earth about three hundred meters wide. It created a jagged path, on either side of which was a massive hole that sunk down deep into the earth.</p><br/><p>Originally, this mountain should not have been here, but there it was … the only thing left.</p><br/><p>A strange expression filled Meng Hao’s eyes as he looked up into the sky. He didn’t know who had saved him, and he didn’t stop to think about it. Immediately, a flying sword appeared under his feet, and he sped off into the distance, his body turning into a multicolored beam of light as he shot toward the edge of the massive handprint.</p><br/><p>“I never thought the illustrious Demon Lord of the Southern Domain would show up in the tiny State of Zhao.” Lord Revelation’s face was dark as he flicked his sleeve. His voice echoed out like thunder in all directions. “But you’re only a clone! Your true self is suppressed and incapable of coming here to stop me from exterminating Patriarch Reliance!”</p><br/><p>There was no response. It was almost as if the blood-red severing glow hadn’t appeared at all.</p><br/><p>“Patriarch Reliance, get the hell out here!”</p><br/><p>“Get the hell out here!”</p><br/><p>“Get the hell out here!!” As his voice boomed out, Lord Revelation lifted his right hand and slapped the Revelation Bell. Its booming filled the sky, echoing out across the land, sweeping Lord Revelation’s voice along with it.</p><br/><p>Countless tall mountains throughout the State of Zhao began to crack and crumble as a voice filled with profound ancientness filled the air. It was impossible to tell where the voice came from, but it filled the entire nation.</p><br/><p>“You… really want me to come out?” As soon as he heard the voice, Meng Hao’s eyes narrowed. It was Patriarch Reliance’s voice. And yet, something about it sounded different. It seemed less unreasonable and more dignified. More ancient.</p><br/><p>“So, you finally speak,” said Lord Revelation, his eyes glittering. “Patriarch Reliance, quit hiding. We have a score to settle from a thousand years ago. Even if you succeeded in your Spirit Severing, you should not have dared to take my clone’s Nascent Soul! Today, we battle, and in the end, I will remain, and you will not!” He flicked the Revelation Bell, and it sounded out with a boom and began to emit a blinding light. The light enveloped Lord Revelation, and he began to glow brightly.</p><br/><p>As for this battle, it must be won. He had already determined Patriarch Reliance’s true level. Lord Revelation had already completed the Second Spirit Severing, and with that power, he could exterminate Patriarch Reliance.</p><br/><p>As for this battle, he had complete confidence. He had thrown caution to the wind and come here as his true self. A Demon Lord had appeared and used a bit of remarkable magic, but that didn’t scare him in the least.</p><br/><p>As for this battle, there was not the slightest chance he could lose. He had brought the Revelation Bell, which had absorbed countless prayers and sacrifices from the State of Revelation. It was sentient already, his most valuable treasure. With this bell, even if he faced someone of the Third Severing, he would still be able to achieve victory. In addition to this, the Dawn Immortal had gifted him with a portion of his Spiritual Sense.</p><br/><p>Everything was quiet for a long moment. Then, Patriarch Reliance’s voice could be heard again, filled with profound ancientness.</p><br/><p>“Back then… I only cared about the Milky Way Sea.” The voice was filled with a strange tone. It echoed out, seemingly filled with the ability to last through the ages. It echoed out across the entirety of the State of Zhao. The land began to quake.</p><br/><p>This quaking filled the entire State of Zhao. Even the mortals could feel it. Meng Hao ducked his head and shot forward even faster.</p><br/><p>“I don’t know how many years passed, nor how many times I slumbered and awoke. Finally, a day arrived in which I woke up to find myself facing a through and through bastard who should have died a thousand, no, ten thousand deaths!” From his tone of voice, he seemed to be getting upset. The last few words were spoken as if through clenched teeth.</p><br/><p>As he spoke, the trembling across the State of Zhao grew more intense. Mountains and boulders trembled, tall buildings rocked back and forth. Within the three Great Sects, the remaining Cultivators looked around in shock.</p><br/><p>The situation was the same in Milky Way City.</p><br/><p>Meng Hao’s mind spun. He was wondering which bastard Patriarch Reliance was referring to.</p><br/><p>“That damned bastard couldn’t possibly defeat me. He brought a bunch of other bastards with him, and we fought back and forth for years. In the end, they deceived me. They made a lot of promises to me, convinced me to leave the Milky Way Sea and come to the Southern Domain….” Patriarch Reliance seemed to be growing angrier and angrier. As he spoke, the land of the State of Zhao shook even harder. In the northern part of the nation, a thunderous roar sounded up into the Heavens. A massive crack appeared in the land, millions of miles long, and growing longer!</p><br/><p>If you could stand far up in the sky and look down, you would be able to see that this massive crack was not a straight line, but a curving arc.</p><br/><p>“When I got to the Southern Domain, the bastards tricked me. They fed me a bunch of random things that ended up placing me underneath an invisible seal!! They promised me that a few years later, they would give me some kind of special blessing of good fortune. But later, the damned bastards all died or disappeared. Finally, there was only the original one left. When I was asleep, he sneaked off to another planet. He left me with a Demon Sealing Jade, which I was supposed to give to a successor. In reality, those bastards were just afraid of Heavenly tribulation, and wanted to use me to fight against it!” Patriarch Reliance seemed to be gnashing his teeth. The sound reverberated across the land. A huge crack appeared in the eastern region of the State of Zhao, accompanied by a thunderous roar. The shape of the crack was a massive semi-circle.</p><br/><p>Seeing all of this happen, Lord Revelation’s face changed. He appeared to be growing a bit apprehensive.</p><br/><p>Meng Hao took in a breath, thinking of the Demon Sealing Jade that he had.</p><br/><p>“The bastards didn’t keep their promise. They tricked me! I was enraged, and even though I slumbered, I still managed to squeeze out a bit of Spiritual will. It was weak, and constrained by the laws of the Dao of the Heavens, so it was incarnated into the body of a mortal. It started from scratch, practicing Cultivation. Because they tricked me, I decided to sever their legacy! I changed the name of the Demon Sealing Sect to the Reliance Sect. From then on, my Spiritual will called itself Patriarch Reliance!” As his voice boomed out, Meng Hao’s eyes suddenly grew wide. He looked back at the land of the State of Zhao behind him. It seethed like an ocean, under the echoes of Patriarch Reliance’s words.</p><br/><p>When Lord Revelation heard the words, his expression changed to one of shock. Without even thinking about it, he began to move backwards. Another crashing boom rolled out across the State of Zhao, and a massive crack appeared in the south. At the same time, in the east, a fourth arcing crack appeared, accompanied by a thunderous bang. The four massive cracks split out to meet each other, surrounding the entire State of Zhao in a massive circle.</p><br/><p>The entirety of the State of Zhao was contained in this enormous circle which suddenly… began to rise into the air. Black soil was revealed, and a fierce gale wind blew in all directions. Massive amounts of soil crumbled off the edges.</p><br/><p>As it rose up, the land quaked and clouds roiled in the sky. Lord Revelation’s face was pale, his eyes filled with shock.</p><br/><p>The ground rumbled as it rose higher and higher into the air. Three thousand meters, fifteen thousand, thirty thousand. It rose so high that it was impossible to describe.</p><br/><p>The land rose up, and Meng Hao was still on it. He felt as if he were approaching the Heavens.</p><br/><p>The land contained the cities of the mortals, the three great Sects, Milky Way city, and countless lives!</p><br/><p>The entire State of Zhao was being lifted up, rising away from the earth, away from the Southern Domain. Beneath it was a massive, enormous hole in the ground!</p><br/><p>The hole was, of course, the same size as the entire State of Zhao!</p><br/><p>Standing above the hole was a vicious-looking turtle, as large as the entire State of Zhao, its body covered with countless black spikes!! It looked just like the mythical Xuan Wu black turtle!!</p><br/><p>Earth covered the turtle’s massive shell, as if the shell were being held in place by the land. The earth was none other than… the State of Zhao.</p><br/><p>A colossal head slowly emerged from the turtle’s shell. The head was roughly one tenth the size of the entire State of Zhao. Its skin was black, and covered with creases. Earth crumbled off from the head as it raised up. Its massive eyes turned to look down on Lord Revelation who stood there panting, as tiny as an insect, his face pale, his body quivering, a look of disbelief on his face.</p><br/><p>“You called me out. Shall we fight?”</p><br/>\n</div>"}