{"title": "Chapter 112: Things Change", "id": 112, "volume": 2, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-112-things-change", "volume_title": "Volume 2", "body": "<h1>Chapter 112: Things Change</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 112: Things Change</strong></p><br/><p>\"That's... that's a roc!\" cried Chu Yuyan. \"In the lands of South Heaven, rocs can only emerge from the Milky Way Sea. Meng Hao, let me loose. Based on the death aura emanating from it, its obviously about to die, and is heading toward the Rebirth Cave. The wind it kicks up is going to sweep everything away!”</p><br/><p>\"You release me first,\" he said, coldly. He could feel the shaking of the Demonic Core within his Dao Pillar.</p><br/><p>\"You!\" said Chu Yuyan, gnashing her teeth. She was about to say something else when suddenly the wind's ferocity increased dramatically. In the blink of an eye, a roaring sound filled the earth. Countless mountain peaks were shattered and crumbled by the wind, sending fragments of rock flying about. All of a sudden, the roc changed directions. Having felt the power of the Demonic Core within Meng Hao, a mysterious light began to shine from its eyes. It screamed through the air in the direction of Chu Yuyan and Meng Hao.</p><br/><p>The sky grew dark as the gale-force wind blew over the land, threatening to sweep everything up. It was as if everything in this part of the world belonged to the roc, and it alone!</p><br/><p>A twisting whirlwind accompanied the roc's arrival. Mountains fell apart and trees were ripped up by the roots in a shocking display of power!</p><br/><p>The wind swept up Meng Hao and Chu Yuyan. The oil lamp hovering next to Chu Yuyan shook violently, and was extinguished. The instant it did, the threads of light that bound him disappeared.</p><br/><p>The power of the Demonic Core erupted once again within him, just as it had the day the Legacy had first appeared. Within Meng Hao's head appeared images from ancient times.</p><br/><p>Within these images, a Flying Rain-Dragon and a roc were locked in combat!</p><br/><p>Boom!</p><br/><p>Meng Hao felt as if a huge wave had just crashed onto his mind. He spun up toward the whirlwind, and he felt as if he were being crushed. Blood sprayed from his mouth. Like a kite whose string was cut, his body flopped over and over in the air as he was sucked up.</p><br/><p>In the last moments before he lost consciousness, he sent out his last bit of spiritual energy to drag the wooden swords and lightning flag back. Then he passed out.</p><br/><p>Chu Yuyan was in an even worse situation. As she began to be sucked upward, she coughed up a mouthful of blood. Her body was still wrapped up by the black net. She tumbled upward along with her oil lamp. Her face was pale, and filled with despair. Another gust of wind from the roc buffeted her, and she coughed up even more blood, then slipped into unconsciousness.</p><br/><p>Meng Hao and Chu Yuyan were both Foundation Establishment Cultivators. Despite that, when the screaming wind generated by the roc lifted them up, they were completely powerless to resist it. Thankfully, they were not like the mountains, which were connected firmly to the land. Their resistance to the wind left them shattered.</p><br/><p>The two of them were like plucked willow catkins, powerless to offer any resistance. They were hurt by the buffeting wind, and knocked unconscious, but were not ripped to pieces. The wind held them tight and carried them off into the distance.</p><br/><p>The wind continued to sweep across the State of Eastern Emergence for several days after the roc's passage, before finally dying down.</p><br/><p>Meng Hao opened his eyes.</p><br/><p>His entire body hurt, causing his eyes to flicker as they opened. An all encompassing pain filled him, causing him to tremble so badly he felt as if he would fall into pieces.</p><br/><p>Calm slowly filled his eyes. The pain was alarming, but it actually didn't compare to the times when the poison within him flared up. Thanks to that, he was used to this kind of pain.</p><br/><p>He slowly struggled into a sitting position, panting. He looked down at his body; his clothing was in shreds; bruises and abrasions covered his skin. There were countless wounds, some of which were deeper than other; there some areas where the skin had been removed entirely. If he bumped up against the nearby rocks, it sent piercing pain deep into his bones.</p><br/><p>He gasped for breath as he examined himself. As he did, his eyes grew wide. His body felt weak. In fact, it felt almost the same as it had six or seven years ago on Mount Daqing.</p><br/><p>\"My Cultivation base...\" Meng Hao immediately attempted to circulate his Cultivation base. He let out a sigh of relief when he found that it was still there. But then he frowned. He was completely incapable of accessing it, as if it were being blocked by some powerful force.</p><br/><p>It was at this moment, as he glanced over his destroyed clothing, that he realized that none of his bags of holding were on his person. It seemed they had all been blown away by the raging wind.</p><br/><p>His face fell. He lifted up his hand and reached deep into his robe. When he pulled it out, there was the bag of the Cosmos. This bag was different than a regular bag of holding, so Meng Hao always kept it tucked inside his robe. Therefore, the wind hadn't been able to touch it.</p><br/><p>It's a good thing I keep most of my things inside the bag of the Cosmos,\" muttered Meng Hao, \"including my wooden swords and the Lightning Flag. Otherwise this would have been a horrible loss.\" He tried to open it up, but no matter how he tried, was unable. Sighing, he looked around.</p><br/><p>Within the darkness, black mists wafted to and fro. Strange rocks covered the ground, as well as numerous bones of birds and beasts. Who knew how long they had rotted here before turning into their currently deathly white color? Meng Hao was beginning to grow even more surprised.</p><br/><p>Things were bad enough as it was, but then Meng Hao noticed that some of the bones were human...</p><br/><p>He looked up toward the sky, but all he could see was endless swirling mists.</p><br/><p>\"What is this place…?\" A grim, gloomy look appeared on his face as he sat there. A sense of imminent danger welled up within him.</p><br/><p>\"I wonder if the change to my Cultivation base was caused by the great wind... or by of this place.\" A long time passed before he gathered enough energy to grit his teeth and struggle to his feet. Supporting himself on a nearby rock, he slowly began to walk forward. Time passed enough for an incense stick to burn, whereupon Meng Hao came to a halt. In front of him was a wall of black rock. The wall disappeared up into the mists, making it impossible to see its top.</p><br/><p>Meng Hao looked behind him. At this point, he realized that he was most likely at the bottom of some deep abyss.</p><br/><p>\"So the wind kicked up by the roc carried me to the bottom of this precipice. Who knows what part of the State of Eastern Emergence I'm in? I need to restore my Cultivation base, then I'll be able to get out of here.\" He leaned up against the cliff wall and then sank to his feet to build up some more energy.</p><br/><p>Time passed. Being unable to see the sky, it was difficult for him to know how much. Slowly, the strength in his body built up. He once again tried to open the bag of the Cosmos, but was unsuccessful. Finally, he had no choice but to give up. He stood, looking around until he caught sight of a tree branch about as wide as his arm. Using it to support himself, he began to walk again.</p><br/><p>\"If this is a cliff, then it will have an end,\" he said, looking around. Everything around him was quiet, without the slightest bit of noise. The only thing he could hear was his own heartbeat. He took in a deep breath, deciding to explore the entire area until he found a way out.</p><br/><p>He walked slowly, caution on his face. The place had a ghastly feel, and he wasn't sure what danger might be lurking about. But he had to search around. If there was any danger, then so be it.</p><br/><p>About four hours passed, and Meng Hao felt himself slowly recovering. He had reached Foundation Establishment after completing the great circle of Qi Condensation, so his body was naturally much tougher than before. But his heart began to sink when after all this time, he still hadn't found any way out. In fact, the strange rocks which littered the ground seemed to be growing more dense.</p><br/><p>After about another hour, he suddenly stopped walking. His eyes gleamed with a strange light as he looked up ahead, and a cold smile twisting the corner of his mouth.</p><br/><p>Up ahead of him, a person was lying on one of the strange rocks. A dilapidated and torn white gown revealed great swaths of smooth skin. Long hair lay in disarray around... Chu Yuyan.</p><br/><p>She lay there unconscious. Next to her was a small black net.</p><br/><p>Meng Hao's eyes glittered as he slowly approached her. He placed his finger beneath her nose, then felt at a patch of exposed flesh on her abdomen. The skin was soft and pleasant-feeling. He pushed down hard onto her abdomen. Then, he stepped to the side, grabbing the black net and tucking it away.</p><br/><p>\"She's not dead. I could feel that her Cultivation base is still there, just suppressed. She has no way to access her spiritual energy.\" His eyes narrowed, and he looked at Chu Yuyan for a long moment. He laughed. \"I know you're awake. There's no need to pretend to be unconscious.\"</p><br/><p>Chu Yuyan still didn't move. Meng Hao let out a cold snort. Using the long branch in his hand, he poked at her.</p><br/><p>Her eyes snapped open and she glared coldly at him.</p><br/><p>Meng Hao gave her an empty smile. He suddenly realized that it was very boring in this abyss. His gaze passed over Chu Yuyan's body, her delicate curves, the skin revealed by her torn clothing, and the edges of her red ‘dudou’ undergarment. All of this made her extremely beautiful.</p><br/><p>Her face suddenly flushed, and anger filled her eyes as she stared murderously at him. She struggled to cover herself up, then gasped in pain. There was a strangeness to her gasp that was clearly audible in the silence of the abyss.</p><br/><p>Hearing it, Meng Hao laughed.</p><br/><p>\"What are you laughing at, you despicable, dirty, THING!\"</p><br/><p>Meng Hao lifted his hand up and slapped her directly across the face, his eyes cold. \"Shut up.\"</p><br/><p>\"You!!\" Her expression was livid as a palm print appeared on her beautiful face. Meng Hao had slapped her viciously, causing her body to tremble. In her entire life, no one had ever dared to strike her. Even Wang Tengfei treated her like an honored guest.</p><br/><p>Another slap rang out as Meng Hao smacked her again in exactly the same spot.</p><br/><p>\"I told you to shut up,\" he said calmly. \"Wang Tengfei might treat you like a precious gem. But to me, you're nothing.”</p><br/><p>She gritted her teeth and stared him dead in the eye. With her Cultivation base being suppressed, she was just like a mortal. Chu Yuyan suddenly felt a sense of danger well up inside her. Once, she had been a high and mighty Chosen, but now she had fallen far, far down. Now, she was simply a weak woman, at the mercy of Meng Hao.</p><br/>\n</div>"}