{"title": "Chapter 114: Many Thanks, Fellow Daoist Chu", "id": 114, "volume": 2, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-114-many-thanks-fellow-daoist-chu", "volume_title": "Volume 2", "body": "<h1>Chapter 114: Many Thanks, Fellow Daoist Chu</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 114: Many Thanks, Fellow Daoist Chu</strong></p><br/><p>Chu Yuyan slowly began to recite the secret method of the Violet Fate Sect. ”Violet Qi from the East, Cultivate the Nine Violet Qis of heaven and earth, use the method that comes from the East, understand the rise of the sun and moon, transform the will of your heart, observe the brilliance, taste the moonlight….”</p><br/><p>Seeing Meng Hao sitting there, apparently lost in thought, she spoke the words slowly. In her heart, she smiled coldly.</p><br/><p>\"He's surely guessed that I'm not simply after a set of clothing. But I've got him hooked. He wants to open his bag of holding as much as I do. He definitely won't take advantage of that brief moment just to take out some clothes for me. He’ll take out some magical item or some medicinal pills. However, whatever he dares to take out, as long as he learns the Violet Qi to the West technique, then he'll be crippled!\" A bit of hesitation flickered on her face as she slowly repeated the mnemonic.</p><br/><p>This, of course, was not Violet Qi from the East, but rather a top secret mnemonic developed later by the Violet Fate Sect, called Violet Qi to the West. Even Wang Tengfei didn't know about it. It was taught only to special members of the Sect, and its purpose was to be able to provide spiritual power and life force to Chosen!</p><br/><p>Every Chosen of the Violet Fate Sect would have an opportunity to select someone else to practice Violet Qi to the West. A Sect Elder would participate in order to prevent that person from resisting, as well as to keep them stable. After successfully performing the technique, that person would become a type of clone of the Chosen, whereupon the Chosen would be able to absorb their Cultivation base and life force with Violet Qi from the East.</p><br/><p>It was because of the combination of the two arts that the Violet Fate Sect occupied its current position in the Southern Domain.</p><br/><p>Chu Yuyan had not yet utilized the power of Violet Fate to the West on anyone. But there was no other option now, other than this technique.</p><br/><p>Despite its power, there were potentially dangerous side-effects. Usually Sect Elders would be standing by, ready to provide assistance against any such mishaps.</p><br/><p>\"If you have no problems with the first mnemonic, then I'll give you a bit of blood,\" said Chu Yuyan calmly. \"It's impossible to see the sun, and without either the sun or moon in sight, it's difficult to absorb Violet Qi. However, there is some in my blood, which will help you to use the technique.”</p><br/><p>Meng Hao looked up at Chu Yuyan, his eyes flickering in contemplation. Inside, he was laughing coldly; before she had even uttered the mnemonic, he had guessed that she had ill intentions. The only thing he wasn't sure of was the exact process she planned to use.</p><br/><p>Having heard the first mnemonic, he had a faint clue. The main reason she was teaching him this Cultivation method was because even if it enabled him to open his bag of holding, it would also eventually harm him in some way.</p><br/><p>He suddenly stood up, walked over and squatted down in front of her. He grabbed her hair and pulled her head close to him. She tried to struggle, but she just wasn't as strong as he was. Even more of her body was exposed as she tried to resist.</p><br/><p>\"Meng Hao, what are you doing?!\" she cried out, her expression changing. Suddenly, anxiety filled her heart, and her body began to shake. Her lips were only about one inch from his. She could smell his breath. His hand held the top of her head like an iron pincer; she was incapable of moving backward.</p><br/><p>“You don't need to give me any of your blood. I'll take it myself.\" He pulled her head to the side and then ruthlessly bit into her shoulder, chomping deep down into the flesh.</p><br/><p>Her body trembled, and fierce hatred erupted in her eyes.</p><br/><p>He was so close that she could feel his warmth. From a distance away, they almost looked like a couple embracing.</p><br/><p>A moment later, Meng Hao loosened his grip and rose again. Not giving her another glance, he returned to his spot and sat down in meditation. Her blood dripped down the side of his face. His eyes closed, he began to Cultivate according to the mnemonic Chu Yuyan had just taught him.</p><br/><p>It took a long moment for Chu Yuyan to settle her agitated breathing and recover her composure. She stared hatefully at Meng Hao.</p><br/><p>\"Just wait until you finish practicing this technique,” she thought. “I'll suck up your Cultivation base and then chop you to pieces. I'll use your own energy to activate the branding in my body. Then the Violet Fate Sect will be able to find me.\" She ground her teeth until it seemed like they might shatter, vowing to pay back ten times as much insult to Meng Hao as she had endured today. This was especially true of the pain in her shoulder, and the bite marks. It was something she simply couldn't accept.</p><br/><p>Time passed by, several hours. Meng Hao's eyes snapped open. Within his pupils, a bit of violet had appeared. When she saw this, Chu Yuyan felt a little bit better.</p><br/><p>\"The second mnemonic,\" said Meng Hao casually.</p><br/><p>Without hesitation, Chu Yuyan began to tell him the second mnemonic.\"Violet Qi returns to the lake, dyeing the banks of the Dao Pillar; Nine rotations in three layers, a branding of a Violet Dragon...\"</p><br/><p>More time passed, even longer than last time. Chu Yuyan was starting to feel a bit hesitant.</p><br/><p>\"Back in the Sect, the person selected to practice Violet Qi to the West by Elder Brother Li only needed two hours to finish under the watch of an Elder. Why is Meng Hao going so slow?\"</p><br/><p>Her hesitation continued on for another four hours. Finally, Meng Hao opened his eyes. The violet glow was even stronger. When she saw this, Chu Yuyan let out a sigh of relief.</p><br/><p>\"He must just have ordinary latent talent, so it takes longer for him to Cultivate.\" Next, she told him the third mnemonic.</p><br/><p>Meng Hao thought for a while in silence. Then he closed his eyes and began to meditate. This time took even longer. Two complete days passed before he finished. However, when his eyes opened, his pupils appeared to be completely violet, and his eyes glowed the same color.</p><br/><p>In fact, his whole body seemed to be emitting a faint violet glow.</p><br/><p>Chu Yuyan was originally a bit worried. But seeing the thick violet color within his eyes, her Cultivation base seemed to twitch vigorously. Her mind was now made up.</p><br/><p>\"Now there's only one more step,” she thought, “and when that's finished, he's doomed!\" Her eyes flickered slightly, and she said, ”Now, we practice Cultivation together. When we combine our power, the bag of holding will open. You need to pay very close attention when that happens: you cannot slack off. The moment will be fleeting, and if you don't get into the bag of holding then, there won't be a second chance.\" As she spoke, her loathing for him seemed to come out and settle onto his body. She lifted up her hands.</p><br/><p>\"Just hold on for a bit longer,\" she thought, laughing coldly to herself. \"And then everything will be over.”</p><br/><p>Meng Hao's face was expressionless. He looked coldly at Chu Yuyan, his violet pupils flickering. He took out the bag of the Cosmos and placed it next to him. He lifted his hands and placed his palms against hers. Suddenly, both of their Cultivation bases, which moments ago had been suppressed, began to boil.</p><br/><p>The reaction grew stronger, and white Qi began to rise up from their bodies. Beads of sweat ran down their faces. As this happened, Meng Hao could clearly sense the violet-colored spiritual power in his body being called by something. It began to race toward his hands, and Chu Yuyan. The violet glow in his eyes began to fade.</p><br/><p>At this moment, Meng Hao suddenly felt the suppressive force on his Cultivation base loosen a bit. A tiny sliver of spiritual power suddenly emerged. Without hesitation, Meng Hao sent it straight toward the bag of the Cosmos. It glowed, and something emerged.</p><br/><p>\"Violet Qi from the East and to the West, bind!\" cried Chu Yuyan, ignoring whatever had emerged from the bag of the Cosmos. Her eyes shined brightly.</p><br/><p>It was at this moment, when the power of Meng Hao's Cultivation base was rushing toward Chu Yuyan, that suddenly, she felt her own energy shake... In the space of two breaths, it was like Meng Hao's Cultivation base had disappeared completely. She wasn't able to absorb anything more of it.</p><br/><p>\"He has a Foundation Establishment Cultivation base, it's impossible that I could have only absorbed this little... This...\" Her expression changed as she looked up at Meng Hao. He looked back at her with a sneering smile. As of this moment, there wasn't the slightest trace of violet in his eyes.</p><br/><p>When she saw this, Chu Yuyan's heart flip-flopped, and her face twisted with an expression of disbelief. She scrambled backward.</p><br/><p>\"You...\"</p><br/><p>\"Many thanks, Fellow Daoist Chu,\" he said coolly. He lifted his hand up, and the object that had emerged from the bag of the Cosmos flew into it.</p><br/><p>It was a crystal stone. Not an ordinary crystal, but one of the three extra large Spirit Stones that remained in his bag!</p><br/><p>Her face went pale as she pressed herself up against the rocky wall. Her heart pounded, unable to figure out why Violet Qi to the West had failed. She had definitely sensed him practicing Cultivation using the technique. And the violet color in his eyes could not have been faked. If it had, her own Cultivation base could not have begun to boil, nor could she have absorbed the tiny bit of his that she had.</p><br/><p>Her body began to tremble. Her plan just now had been made up on the spot, and had its flaws. It was a gamble and she was sure she had hooked him. Once hooked, there was no way he should have been able to escape.</p><br/><p>Yet the facts remained. Chu Yuyan's heart trembled. As she looked at Meng Hao, she was suddenly struck with how unpredictable he was. The feeling only grew stronger and stronger.</p><br/><p>If that was all to the matter, then it wouldn't be a very big deal. But then she noticed the large spirit stone Meng Hao held in his hand. Her pupils constricted. She looked closer, and then began to pant, a look of disbelief covering her face.</p><br/><p>“That's... an ultra-high-grade Spirit Stone!”</p><br/>\n</div>"}