{"title": "Chapter 111: The Roc and the Flying Rain-Dragon", "id": 111, "volume": 2, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-111-the-roc-and-the-flying-rain-dragon", "volume_title": "Volume 2", "body": "<h1>Chapter 111: The Roc and the Flying Rain-Dragon</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 111: The Roc and the Flying Rain-Dragon</strong></p><br/><p>Chu Yuyan also had a Flawless Foundation. This was because she was the daughter of the Sect leader of the Violet Fate Sect, and also because of Grandmaster Pill Demon. Furthermore, her latent talent could be considered the third best in the entire Violet Fate Sect.</p><br/><p>It was for this reason that her father sent a special request to the Upright Clan in the Eastern Lands for a Flawless Foundation Pill, which was very rare in the Southern Domain. It was in this fashion that Chu Yuyan acquired her Flawless Foundation.</p><br/><p>Of course, the Violet Fate Sect had paid quite a price for this.</p><br/><p>As she raced in pursuit of Meng Hao, her eyes flashed. According to her judgement, there was no way Meng Hao could have a Flawless Foundation. In the current generation of Chosen in the entire Southern Domain, there were only eight Cultivators with a Flawless Foundation, one in each of the five Clans and three Sects.</p><br/><p>Even Wang Tengfei didn’t have a Flawless Foundation, only a Cracked one. The Wang Clan was large, and Wang Tengfei was one of many Chosen. Neither was he one of the most illustrious members of the clan. Most of the attention was actually focused on his older brother.</p><br/><p>“Meng Hao….” Her eyes flickered, and her mouth twisted into a cold smile. To see such a cold expression on her beautiful face was actually somewhat arousing. “A trifling Cracked Foundation! The only things you have are a few strange magical items!” She increased her speed, and the two of them transformed into beams of shining light as they screamed through the air above the State of Eastern Emergence.</p><br/><p>After reaching Foundation Establishment, flight is possible. But in terms of speed, Chu Yuyan, who was in the middle Foundation Establishment stage, was quite a bit faster than Meng Hao. In a relatively short time, she caught up to him.</p><br/><p>Boom!</p><br/><p>A massive explosion bellowed out. Chu Yuyan had flickered an incantation and sent a violet mist shooting toward Meng Hao. It had been blocked by the mist of the Lightning Flag, which subsequently fell apart.</p><br/><p>As the explosion rang out, Meng Hao continued to flee, looking back coldly at Chu Yuyan.</p><br/><p>“You might be fast, but you can’t catch me. I paid the highest price at the auction. The Spring and Autumn tree is mine, it’s just the will of the Heavens.”</p><br/><p>“I will capture you today, and not for the Spring and Autumn tree,” she said calmly, “but for Wang Tengfei’s finger! Furthermore, you shall explain clearly how you obtained Ding Xin’s black bow!” She was beautiful in both complexion and figure as she flew through the air, her clothes rippling in the wind. Somehow she had managed to change her dress. The skin which had previously been exposed was now covered.</p><br/><p>Meng Hao didn't reply, but a sneer appeared in his eyes. From their encounter moments ago, he had determined that Chu Yuyan was in the middle of the Foundation Establishment stage, and that he couldn’t defeat her. But, she wanted to capture him, and that wouldn’t be easy. He continued on forward.</p><br/><p>The two of them continued on for nearly two hours. She tried several times to get ahold of him, but the lightning mist protected him. Each time, a bang would ring out, and he would continue on. Chu Yuyan was starting to feel a bit helpless.</p><br/><p>Evening was falling, and as it did, Chu Yuyan’s frown deepened. She didn’t pay attention at all to Meng Hao’s Cultivation base, but rather the powerful lightning mist that protected him. It was extremely difficult to break through. She ground her teeth and then slapped her bag of holding. An ancient oil lamp appeared. This was one of her most valuable treasures; she had never even used it in battle before. But in order to capture Meng Hao, she couldn’t afford to hold it in reserve.</p><br/><p>The lamp was not lit when it appeared, but it already filled the air with an archaic noise. Chu Yuyan took a deep breath and then blew on the wick of the lamp. As she did, her face grew pale. But then a tongue of flame appeared.</p><br/><p>Once the lamp was lit, the entire area within a three hundred meter diameter was filled with a bright sheet composed of countless flames.</p><br/><p>It had no shape, and could not be touched, but could be seen. When it did, Meng Hao’s eyes narrowed.</p><br/><p>“Spotlight Threads, unite!” Her clear voice rang out, and the bright lights filling the area separated into multiple threads, which then blocked off Meng Hao’s path of escape to the left, right and ahead. They slowly began to surround him.</p><br/><p>Even as Meng Hao realized the dangerous situation he was in, the lightning mist began to shrink. It appeared that the enveloping threads of light were causing it to dissipate.</p><br/><p>Meng Hao’s eyes glittered as he stopped moving forward. Instead, he reversed his direction, the lightning mist swirling around his body as he shot toward Chu Yuyan.</p><br/><p>When she saw him charging her, her eyes narrowed. She pushed her palms together in front of her, whereupon a huge field of Violet Qi poured out of the top of her head and swirled about her. Then, she struck out with both hands, pointing toward Meng Hao. The Violet Qi coalesced into the form of a long, violet dragon. Roaring, it charged Meng Hao.</p><br/><p>Within the lightning mist, Meng Hao saw the violet dragon approaching. His right hand flashed an incantation gesture and then waved forward. The lightning mist roiled and then made a beeline for the approaching dragon. At the same time, his left hand slapped his bag of holding. One hundred flying swords emerged. Meng Hao took control of them with this Spiritual Sense, causing them to form a whirlwind of swords. When it, along with the lightning mist, collided with the violet dragon, a huge explosion ripped out. But the sword whirlwind continued on toward Chu Yuyan.</p><br/><p>Her oil lamp had prevented Meng Hao from fleeing. She knew that soon, the threads of light would close in on Meng Hao, and he would be unable to escape even if he had wings.</p><br/><p>Her face was calm as she slapped her bag of holding again. A red, white and black fan appeared in her hand, which she waved ahead of her three times.</p><br/><p>The first time she waved it, a red glow appeared, which turned into a large red horn.</p><br/><p>The second time she waved it, a white glow appeared, which transformed into a rhinoceros, to which the horn attached.</p><br/><p>The third time she waved, a black glow appeared which coalesced into a black coat of armor which covered the rhino. Waving its head wildly, the rhino charged toward Meng Hao’s sword whirlwind.</p><br/><p>Meng Hao let out a shout, and the sword whirlwind began to collapse. Suddenly, all of the swords exploded. Fragments flew about in all directions, and then fused together and shot toward the black-armored rhino.</p><br/><p>At the same time, the lightning mist suddenly expanded out with a roar, filling the area within three hundred meters.</p><br/><p>Meng Hao’s body flashed as he approached Chu Yuyan, his body covered with lightning mist. A Flame Python flew out from his right hand, causing her to let out a light snort. A string of bells appeared in her hand, which let out light tinkling sounds. The Flame Python began to wail mournfully.</p><br/><p>Disdain covering her face, Chu Yuyan lifted her hand up. The bells rang as she waved her hand toward Meng Hao.</p><br/><p>Violet Qi poured out from the fingers of her hand, speeding straight toward Meng Hao.</p><br/><p>At this point, the shining threads of light had reached a position several meters away from Meng Hao. The multiple interlocking layers of light seemed to be completely under the control of Chu Yuyan’s will.</p><br/><p>An almost imperceptible gleam appeared in Meng Hao’s eyes as the Violet Qi neared him. A variety of expressions flickered across his face, and he retreated, seeming to almost fumble as he slapped his bag of holding. A wooden sword appeared, and even as it slammed into the Violet Qi, a second wood sword shot out, followed by a small, black net. To Chu Yuyan it appeared as if she had caused Meng Hao to rush in his attack. Otherwise, why would he suddenly use so many treasures? It was really beyond the proper limits of reason.</p><br/><p>“You’re a backwater Cultivator from a backwater nation,” said Chu Yuyan coolly, raising her hand. “Even if you're at Foundation Establishment, you only have a Cracked Foundation. You don’t even deserve to show your face!” The power of her middle Foundation Establishment Cultivation base flared. The four Dao pillars within her body surged, and a gale force wind blew out from her right hand. Meng Hao’s wooden swords twisted in the air, and then black net rocked back and forth.</p><br/><p>But at this moment, Meng Hao’s eyes gleamed brightly. The black net suddenly grew larger. Even as the threads of light contracted around him like iron bands, the net shot directly in Chu Yuyan’s direction. Its speed and growth were too sudden, giving her no time to react. In the blink of an eye, she was enveloped by the net, which shrank around her and pinned her tight within its confines.</p><br/><p>As it contracted around her, her white dress was once again shredded, revealing more of her graceful and elegant curves. It was enough to send any man panting. She was both angry and nervous. Hate filled her eyes as she glared murderously at Meng Hao, killing intent radiating out from her eyes.</p><br/><p>“I don’t need to show my face anywhere,” he said coolly, looking back and Chu Yuyan. “Being able to catch you while I’m tied up is good enough for me.” The threads of light had securely tightened around him.</p><br/><p>The two of them were both momentarily incapacitated. Neither of them dared to use any spiritual energy against the other. They were in a deadlock.</p><br/><p>Chu Yuyan’s murderous intentions grew stronger, causing even Meng Hao to show a bit of killing intent.</p><br/><p>Everything grew quiet. Chu Yuyan didn’t move, and neither did Meng Hao. They both circulated their Cultivation bases, attempting to free themselves from their constraints. Whoever got free first would be the victor.</p><br/><p>Time slowly passed. Soon, it was dusk. Meng Hao rotated his Cultivation base rapidly, and as he did, he felt the threads of light growing looser. Chu Yuyan was doing the same thing. Under the power of her Cultivation base, the black net was beginning to show weaknesses.</p><br/><p>As this was happening, far in the distance, the sound of wind could be heard. At first it wasn’t very strong. It caused Chu Yuyan’s hair to drift about, and Meng Hao’s eyes to grow dry. It didn’t take long for the wind to grow stronger, though. Soon it was whipping about wildly.</p><br/><p>A black shadow appeared off in the distance. Despite being very far away, it was obviously a colossal flying bird. It was… the roc from the Milky Way Sea, flying toward the Rebirth Cave!</p><br/><p>Like a sovereign of the sky, every flying thing in the sky must bow to this roc. As its sovereignly will of the heavens exuded out, the Demonic Core within Meng Hao’s Dao Pillar began to shake. It wished to battle with this sovereign of the sky.</p><br/><p>Because the Flying Rain-Dragon is also a sovereign of the sky!</p><br/><p>The wind grew even more violent. Meng Hao’s body began to be pulled backward. Chu Yuyan’s expression changed as she too began to be pulled up. Meng Hao’s lightning mist, Chu Yuyan’s oil lamp flame, and even the wooden swords, were all pulled into motion by the wind. It seemed as if they would all be blown away.</p><br/><p>-----</p><br/><p><em>This chapter was sponsored by Hein Haugeberg</em></p><br/>\n</div>"}