{"title": "Chapter 122: Reaching an Agreement", "id": 122, "volume": 2, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-122-reaching-an-agreement", "volume_title": "Volume 2", "body": "<h1>Chapter 122: Reaching an Agreement</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 122: Reaching an Agreement</strong></p><br/><p>Time slipped by. Soon, three days had passed. Meng Hao frowned. He found that no matter how far or where he flew, this place seemed to have no end. It apparently had no borders. Furthermore, as time passed, there seemed to be less and less spiritual energy.</p><br/><p>“How do I break through the first spell matrix….?” His brow furrowed, Meng Hao sat down cross-legged on a mountain peak. His eyes flashed as he looked around.</p><br/><p>Meanwhile, outside the Legacy zone, the Cultivators surrounding the seven altars throughout the Southern Domain were all watching the scene on the blood screens. They could clearly see that seven of the blurry figures, upon entering the first matrix, immediately sat down cross-legged and began to meditate. However, the eighth and last person to enter starting flying around in seemingly random directions. A long time passed before he sat down and began to meditate.</p><br/><p>“What Sect is that last person from? Doesn’t he understand how the first matrix works? Oh I know. He must be a rogue Cultivator. He somehow accidentally opened the Eighth Blood Immortal altar and started the tournament!”</p><br/><p>“The first matrix is very simple. It’s a trial of latent talent. Basically, the first matrix will cause the Blood Divinity to grow. The Cultivators must snatch up as much spiritual energy as possible. That’s the key to breaking through the rest of the matrixes.” Conversations like this broke out among the Cultivators, who discussed things in hushed tones. Within the Legacy zone, Meng Hao lifted his head.</p><br/><p>“This is weird. The spiritual energy in this place seems to be divided into eight… Including me, eight people entered.” Meng Hao’s eyes gleamed. He took in a deep breath and began to absorb as much spiritual energy as possible.</p><br/><p>Although he didn’t quite know how to break through the first matrix, he was beginning to form a guess. The spiritual energy quickly began to disappear. Meng Hao closed his eyes, and five days passed.</p><br/><p>On the fifth day, he continued to suck in as much spiritual energy as he could. His golden Dao Pillar gleamed brightly. In fact, it seemed as if the beginnings of a second Dao Pillar were forming.</p><br/><p>As for the puppy, during these five days it had also been absorbing energy, much like Meng Hao. Its body was larger now. It was about the size of Meng Hao’s hand. Soon, all of the spiritual energy in the place was completely gone. A roaring sound filled the air, and the surrounding Immortal mountains and buildings began to collapse, crumbling down to form a large platform. Meng Hao opened his eyes to find himself sitting cross-legged on the platform.</p><br/><p>Around him, the seven other people opened their eyes. Their respective Blood Divinities had all experienced changes. They were larger and seemingly more intelligent.</p><br/><p>As for the blood-colored sprite, its size had not changed, but it had begun to grow tentacles, which writhed about slowly, giving it a very bizarre appearance.</p><br/><p>Meng Hao’s puppy had experienced the least change of all. It was the size of a hand, and was covered with fluffy fur. It appeared to be very frightened of the other Blood Divinities; it shrank up against Meng Hao, trembling, rubbing its head against his leg and licking his robe. Its large, glistening eyes looked extremely cute.</p><br/><p>A glowing door existed on this platform, emitting a slight gravitational force. Obviously, this was the exit of the Legacy zone. The seven people surrounding Meng Hao stood up one by one. Obviously having no intention of leaving, they transformed into prismatic beams as they and their Blood Divinities shot on toward the second matrix.</p><br/><p>Meng Hao was silent. He could sense that most of the seven other peoples’ Blood Divinities were emitting auras of the seventh or eighth level of Qi Condensation. The Blood Dragon and Blood Phoenix, as well as the person-shaped Blood Divinity, were all at the ninth level. His puppy was the only one that was at the third or fourth level.</p><br/><p>“My lack of understanding about this place has put me in a bad position….” Meng Hao’s brow furrowed, and his eyes flickered. “But my advantage is that I am the only one who can leave the Legacy zone. If they leave, then countless others would try to enter. Therefore, they have no option of leaving.” Meng Hao was silent for the space of a few breaths. Then he stood up. He didn’t fly toward the second matrix, but instead vanished into the glowing door.</p><br/><p>When he emerged, he was in the mouth of the gigantic stone face in the lake of blood. As soon as he flew out, he found that, as he suspected, his Cultivation base was indeed fully recovered. The suppressive force from before now had no effect on him.</p><br/><p>“The Blood Divinity didn’t come out with me… It seems that it can only appear within the Legacy zone.” Meng Hao looked back at the altar within the lake of blood, and suddenly frowned. He saw the glowing blood screen, as well as everything that was going on inside the Legacy zone.</p><br/><p>“So, outsiders can see what’s happening….” His calm gaze flashed over the screen, and he could see seven blurry figures within the second matrix. As he looked closer, he calmed down a bit.</p><br/><p>The images on the screen did not reveal anything about where he was; furthermore, the doorway which had led him back to the volcano was still there.</p><br/><p>His eyes shining, he flew into the air. In the space of a few breaths, he had arrived at where Chu Yuyan was concocting the pills.</p><br/><p>She sat there cross-legged, her face pale. As Meng Hao approached, she lifted her head and saw him flying through the air toward her. A complex expression filled her face.</p><br/><p>“How many more days do you need before you can finish concocting the fifth pill?” said Meng Hao coolly, landing softly onto the ground. He looked at her with cold eyes.</p><br/><p>She was silent for a long moment. Finally, she replied in a soft voice. “I will succeed within half a month.”</p><br/><p>“Considering our situation,” said Meng Hao, “there’s no need for us to keep fighting with each other.” He looked around at the mists, which he could now see through easily.</p><br/><p>Chu Yuyan was silent for a while. She lowered her head. “I want to get out of here, but I don’t trust you.”</p><br/><p>“If you concoct my pill, and help me understand the Blood Immortal Legacy tournament, then I swear by my Cultivation base that I will get you out of here safely.” He looked at her.</p><br/><p>“The oaths of Cultivators cannot be trusted,” she replied, looking up at him.</p><br/><p>“If you want to get out of here, then you have no choice but to trust me,” said Meng Hao, his voice cool. “My benevolence has a limit. First, you went after my Cultivation base. Second, you tried to trick me regarding the Blood Immortal Legacy. If there is a third, then I will just give up my medicinal pill and simply kill you.”</p><br/><p>Chu Yuyan sat there silently, apparently having no words to speak. Meng Hao sat down cross-legged next to her. He didn’t say anything more to try to persuade her. An entire day passed, until finally, she sighed in her heart. She was out of tricks and schemes. All of her attempts to outwit Meng Hao had failed. It was exactly as he had said… if she wanted to get out of this place, she had no choice but to trust him. Furthermore, Chu Yuyan had experienced Meng Hao’s ruthlessness and she could sense the cold killing intent within the words he had spoken.</p><br/><p>“The nine matrixes of the Blood Immortal Legacy tournament are all different,” she began quietly. “However, the various Sects have thoroughly researched them throughout the seven past Legacy tournaments. The path you will tread, is one of seizure!</p><br/><p>“What must be seized is the spiritual energy of heaven and earth. Not only will it help you to grow your Cultivation base, but in accordance with your latent talent, it will also facilitate the growth of your Blood Divinity.</p><br/><p>“The growth of your Blood Divinity is very important in the nine matrixes. Over the years, the Violet Fate Sect has come to the conclusion that if you can break through the ninth matrix, then the Blood Divinity should be able to achieve a level of power equivalent to an expert halfway to the Spirit Severing stage. It can enter the Blood Immortal Legacy treasure as its owner, and become the Weapon Spirit of the treasure!</p><br/><p>“Whoever is the master of the Weapon Spirit will have acquired the Legacy of the Blood Immortal, and will be the first person since ancient times to carry out the treasure. After that, he will be able to release the incomparable power of a half-Spirit Severing stage Blood Divinity! This half-Spirit Severing stage Blood Divinity is in fact a Dao Protector left behind by the Blood Immortal of the Ancient Temple of Doom.</p><br/><p>“With the exception of the first matrix, the Blood Immortal’s nine matrixes all have different essences. The various Sects have gathered a variety of details regarding this.</p><br/><p>“Through mutual cooperation, it was eventually determined that each spell matrix changes. Over the course of many races, the heart of each one has evolved. Therefore, it is difficult to determine the exact essence of each matrix.</p><br/><p>“Whoever is first to understand the essence of any given matrix, will be the first to begin absorbing spiritual energy; furthermore, that person’s Blood Divinity will be the first to begin to grow. The spiritual energy within each matrix is limited. The more you absorb, the less others can absorb.” Chu Yuyan looked up at Meng Hao. “Regarding the details of the essences of the various matrixes of the Blood Immortal Legacy tournament, I scanned over them back in the Sect. However, I don’t remember too much. The main thing I remember is that some of the matrixes are illusions.” Having said this, she closed her eyes.</p><br/><p>Meng Hao seemed lost in thought as Chu Yuyan’s words continued to echo in his ears. After analyzing the matter for a while, he turned and shot back toward the Blood Immortal’s sacrificial altar. Looking up at the blood screen, he saw that the seven others were still within the second matrix. He strode forward and entered the giant mouth. His eyes grew blurry, then clear again, and he was standing on the platform he’d arrived at after passing the first matrix.</p><br/><p>As soon as he emerged, the hand-sized puppy materialized in front of him. It jumped up and down happily, then ran around him a few times, wagging its tail furiously. It seemed incredibly excited to see Meng Hao. Finally, it came to rest on Meng Hao’s feet, laying down on top of them and licking his pant leg, looking up at him with adoring eyes.</p><br/><p>Meng Hao’s reappearance did not cause much stir in the outside world. Based on his setback in the first matrix, he was now far behind everyone else. He was clearly in eighth place.</p><br/><p>He took in a deep breath, then turned into a beam of light as he shot into the second matrix. From the outside, this spell matrix had the appearance of a whirlpool of stars, slowly rotating. However, as soon as he entered it, the stars’ positions all seemed to change. The world warped, heaven and earth twisted bizarrely. Then everything became clear. In front of Meng Hao was a vast blood-colored ocean.</p><br/><p>The ocean seemed limitless, its color deep crimson. Off in the distance, the sun was setting. The evening wind carried a fishy stench, and caused waves to ripple across the ocean’s gleaming surface.</p><br/><p>The spiritual energy was thin here, not enough to absorb. It would not become thick enough to do so until the spell matrix was broken through.</p><br/><p>Suddenly, the blood-colored puppy ran forward a few paces, then let out a few threatening yips toward the ocean. The sound carried nervousness with it, and a sense of danger. The little puppy’s fur stood up on end and quivered.</p><br/><p>A rumbling could be heard, and the ocean began to seethe. A booming sound echoed out as an arching, dark green wooden bridge slowly rose up out of the ocean of blood. It dripped blood as it stretched up. Lightning and thunder fell from the sky.</p><br/><p>Atop the arching wooden bridge stood a young boy with long hair. His eyes glittered coldly as he stared at Meng Hao with a vicious expression.</p><br/><p>“One attack,” said the young boy coldly. His eyes shined with killing intent. His voice sounded old and archaic, quite in contrast with his appearance. “If you live, the second bridge shall rise. If you pass three bridges, then you can break through this matrix.”</p><br/>\n</div>"}