{"title": "Chapter 137: 10th Patriarch of the Wang Clan", "id": 137, "volume": 2, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-137-10th-patriarch-of-the-wang-clan", "volume_title": "Volume 2", "body": "<h1>Chapter 137: 10th Patriarch of the Wang Clan</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 137: 10th Patriarch of the Wang Clan</strong></p><br/><p>A few days earlier….</p><br/><p>The Southern Domain. The State of Cloudy Skies.</p><br/><p>This nation existed in the centre of the Southern Domain. It encompassed a huge territory, vastly larger than the State of Zhao. Even in the Southern Domain, nations like this could be counted on one hand.</p><br/><p>Within the State of Cloudy Skies, there were no Sects whatsoever. It was one of those uncommon nations that didn’t have Sects. Instead, in this nation, there was a Clan. This Clan was named Wang. And this nation… was also named Wang!</p><br/><p>Male members of the Wang Clan who were mortal and could not practice Cultivation became part of the royal family of the State of Cloudy Skies. Those who could practice Cultivation entered the Wang Ancestral Mansion.</p><br/><p>As for Cultivators without the surname Wang, they formed auxiliary branches of the Wang Clan. It had been this way for generation after generation.</p><br/><p>After Meng Hao consumed the Perfect Foundation Pill and emerged from the Blood Immortal Legacy zone, a sound could be heard. This sound came from the tenth mountain amongst the Three Thousand Forbidden Mountains within the State of Cloudy Skies. It was the sound of breathing.</p><br/><p>The Three Thousand Forbidden Mountains of the Wang Clan were not connected. They were dispersed throughout the State of Cloudy Skies. Underneath each mountain was a wooden coffin. Only the most powerful members of the Wang Clan could, upon death, be buried underneath one of the Forbidden Mountains.</p><br/><p>According to the legends, one of the Wang Clan Patriarchs from tens of thousands of years ago was buried in one of the Forbidden Mountains, although no one knew which one.</p><br/><p>There were many deep secrets within the Wang Clan, many of which the five great Sects only had general information about. Clues could be found in the ancient records, but the Wang Clan secrets were just endless, and their history too deep. According to the legends, they came from the stars….</p><br/><p>Right now, within the tenth mountain, was a world of crimson light, the glow of blood and of fire. Here was a boiling sea that it seemed could never be extinguished within ten thousand years. Deep within the recesses of this volcano was a red coffin.</p><br/><p>The coffin had no cover. Resting inside was an old man. His face was covered with wrinkles, and his body was skinny and shrivelled, as if he had been dead for a very, very long time. And yet, no death aura whatsoever emanated off of the corpse.</p><br/><p>In fact, his eyes eyes slowly opened, and when they did, the peaceful sea of fire… suddenly began to move. It was not burning higher; in fact, the broiling heat seemed to reduce a bit.</p><br/><p>“I feel…. A Perfect aura….” murmured the old man. His voice was extremely hoarse, as if he hadn’t spoken for a very long time. When he did speak, the entire tenth mountain began to rumble.</p><br/><p>This rumbling immediately drew the attention of the elder members of the Wang Clan. Multiple figures suddenly emerged from within the Wang Ancestral Mansion.</p><br/><p>These old Clan members’ faces were filled with excitement; based on their understanding, within the tenth mountain was one of their Patriarchs!</p><br/><p>“Perfection….” said the person inside the coffin, his eyes flashing with a mysterious light.</p><br/><p>When his eyes flashed, the roaring of the tenth mountain grew more intense. The group that had come from the Wang Ancestral Mansion all saluted respectfully.</p><br/><p>“Prepare three thousand Rebirth Stones!” said the old man in the coffin, his voice echoing out of the tenth mountain. “The time has come for me to reincarnate!” When they heard this, the group of old Clan members’ faces grew even more excited.</p><br/><p>“At the peak of the Dao Seeking stage, I sealed my Cultivation base. At first, I thought that like members of the elder generation, I could only struggle on death’s door, gazing at Immortality and sighing, ignorant and unable to take those final steps. I couldn’t step into the stars, and return to my Clan members….” A slight smiled appeared on the shrivelled face of the old man. The smile seemed to be filled with an intense, ghastly strangeness.</p><br/><p>“But now… I have hope….” His smile grew wider, and his eyes shone even more powerfully.</p><br/><p>“The legendary Founder of the Wang Clan passed down a truth of the Dao from generation to generation. He was born mediocre. But one year, he was able to wrest away someone’s Foundation Establishment, and thus tread the path of a powerful expert…. Then he became a legend.</p><br/><p>“Now, a Perfect Foundation has appeared. I too shall tread the path of the legendary Founder. I shall wrest away Perfection, and then take the next step, Immortal Ascension!</p><br/><p>“Except… this person’s Cultivation base is too weak. It’s not sufficient to sustain my Immortal Ascension. I must wait a bit longer, just wait a bit, wait….” Within the coffin, the old man’s smile grew more vigorous. Then, after a while, he closed his eyes. The sea of fire within the tenth mountain once again dared to rekindle its inextinguishable flames.</p><br/><p>Several days later, underneath a seemingly endless, cloudless sky.</p><br/><p>A bright, greenish beam of light shot through the air. This was Meng Hao, slicing through the sky. As for Zhou Daya, Meng Hao had known all along that the young man was following him, but let him go anyway. Of course, there were some things that he shouldn’t have heard, which Meng Hao prevented him from hearing. In any case, he was connected to Fatty somehow, so he’d let him go.</p><br/><p>“It took a lot of Spirit Stones to concoct the Perfect Foundation Pill. I still have some left, but not many….” Meng Hao frowned, examining his bag of the Cosmos and letting out a sigh.</p><br/><p>“Before I entered the Cultivation world, I was running low on silver. After I became a Qi Condensation Cultivator, I was always running low on Spirit Stones. Now I’ve reached Foundation Establishment, but… I’m still running low on Spirit Stones.” His brow furrowed as his longing for Spirit Stones was once again kindled. Now that his Cultivation practice had reached this level, his need for Spirit Stones was even greater.</p><br/><p>“And then there’s the poison of the three-colored Resurrection Lily. If I can’t dispel it, it’s going to be a real problem.” His frown deepened.</p><br/><p>“Furthermore,” he muttered to himself, “even though I’m much more powerful now that I have a Perfect Foundation, I’m cut off from heaven and earth. I have no way to absorb spiritual energy… the only way to get it is by consuming pills. I can’t keep doing that forever….” But, he had been prepared for that. Given a second chance, he would definitely chose to consume the Perfect Foundation Pill.</p><br/><p>“You win some, you lose some. It’s fair.” Meng Hao lifted his head. Smacking the bag of the Cosmos, he retrieved the blood-colored mask. A warm feeling filled his heart.</p><br/><p>“Despite my current situation, at least I acquired the Blood Immortal Legacy. Now I just have to wait for the mastiff to wake up. Then everything will be a bit better.” His eyes shone with anticipation. He cast his Spiritual Sense deep into the blood-colored mask. He could sense the mastiff’s slumbering form. Though he had no idea when it might awaken, he could sense a powerful pressure emanating from it, a pressure which was continuing to grow more powerful.</p><br/><p>“And then there’s this flag.” Meng Hao’s eyes flashed. His Spiritual Sense fell onto the dilapidated flag of three streamers. His Spiritual Sense entered it, only to find that it was like an ocean. Compared to it, Meng Hao’s Spiritual Sense was incredibly small. He had no way whatsoever to do anything with it.</p><br/><p>However, he was able to sense an incredibly might within it like that of the Heavens; it seemed mighty enough to lay waste to heaven and earth.</p><br/><p>“My Cultivation base isn’t sufficient…. Even though this treasure is somewhat broken down, it was still inside the Blood Immortal’s Legacy zone. It must be extremely valuable. When my Cultivation base is strong enough, I’ll be able to use it, and I’m sure it will be powerful enough to shock the Heavens.” Palpitating with anticipation, he withdrew his Spiritual Sense. It was then that he caught sight of the character written on the third streamer, Ji .</p><br/><p>“Why does it have the character Ji on it? Is it a family name?” He thought about it for a bit, then focused his attention on the Scroll of the Blood Immortal Legacy. The instant he looked at it, he felt as if his head were about to be split in half.</p><br/><p>To the average person, this pain would be excruciating, and difficult to bear. But to Meng Hao, it was nothing compared to the anguish he suffered during his poison flare-ups. His expression flickered somewhat, but as he focused on the splitting pain in his head, he caught sight of a special technique.</p><br/><p>“Spirit Devouring Scripture!” Meng Hao’s heart trembled as the three blood-colored characters appeared in front of him and branded themselves indelibly onto his mind.</p><br/><p>Meng Hao’s head began to thrum as it was filled with an ancient voice. It was impossible to say whether the voice was male or female. “If you Cultivate according to my scripture, you can wrest control of Spirit and blood and fuse them into your body. Refine them into a body of blood, Spirit of blood, a Blood Immortal, a Blood Dao!</p><br/><p>“There are countless Cultivation methods in heaven and earth. The bloodline of my Legacy stretches back to the powerful first Founder. The bloodline contains his will, and can be passed on to tens of thousands of generations. When the bloodline is awakened in the descendants, they shall possess latent talent!</p><br/><p>“My technique can be used to wrest away latent talent, and then sense the almighty will of the Founder. Refine the body, make the latent talent yours. Some have even tried to bring the ghost of the Founder into the world, to destroy Immortals and devils!</p><br/><p>“Practicing Cultivation according to the technique of my Legacy is an insult to the Heavens. But fear not ghosts and divinities; overturn the vault of the Heavens with the flip of a hand, lower your head to cause heaven and earth to mourn!” Slowly a scripture came to be branded onto Meng Hao’s mind. Then a vast amount of miscellaneous information about the mask poured into his head.</p><br/><p>“I am the Blood Immortal. My whole life was spent battling the Heavens. I met defeat only thrice! I wrested Spirits away from heaven and earth. Because I desired to wrest away the bloodline of Ji, the Heavens shunned me and longed for my destruction. My body could be destroyed, but not my will!</p><br/><p>“I was not willing to give in because of three defeats. Therefore, I created three techniques: the Blood Finger, the Blood Palm, and the Blood Death World!</p><br/><p>“Descendants of the Legacy of my Dao, do not forget that you must wrest away the bloodline of Ji! Make the Dao of Heaven weep, and the earth mourn! Remember the techniques of the Blood Immortal, the Nine Killing Magics!</p><br/><p>“Remember, the day your Dao is achieved, put on my mask and hoist the flag of three streamers. Defy the ancients, topple the Heavens!</p><br/><p>\"Without a face, a single word, the flames of war unify</p><br/><p>\"Sundered clouds, a bloody rain, seas that fill the sky</p><br/><p>\"Capture the gods, advance the troops, fire consumes the towers</p><br/><p>\"Forge all spirits and bloodlines into the 9 killing powers!\"</p><br/><p>Meng Hao’s body trembled and he opened his eyes. He was still flying through the sky, above a vast empty space, and barren mountains. His eyes continued to swim, and his mind echoed with the archaic voice.</p><br/><p>“Wrest away bloodline, achieve success. The strength of the bloodline is up to the glory of the Founder…. Wrested latent talent of the bloodline, can be refined into a body of blood… a body refined outside the body…</p><br/><p>“No one person can hold the power of an entire bloodline. The blood of three generations is required to refine even a minor blood clone. If six generations of bloodlines are congealed, then a magnificent blood spirit can be achieved. If nine generations of blood, then the Great Circle of the blood spirit can be completed!</p><br/><p>“The ancestors determine the strength of a bloodline. The stronger the past generations, the stronger the Blood Spirit!</p><br/><p>“Thus, it becomes death. Nine bloodlines, nine experts. They become the nine deaths, nine deaths fused into one. This is… the Blood Dao!” Meng Hao panted, his mouth dry. At the moment, he was no longer flying. He had landed onto a barren mountain, where he now sat cross-legged, feeling the Spirit Devouring Scripture pulsing through his head.</p><br/><p>This was the complete scripture, the full Legacy. But within the Legacy was something that filled Meng Hao with the reek of blood. He sat in thought for a long time before his eyes began to shine.</p><br/><p>\"Without a face, a single word, the flames of war unify</p><br/><p>\"Sundered clouds, a bloody rain, seas that fill the sky</p><br/><p>\"Capture the gods, advance the troops, fire consumes the towers</p><br/><p>\"Forge all spirits and bloodlines into the 9 killing powers!\"</p><br/><p>“There are four magics within….” Meng Hao was thoughtful for a while before looking down at the mask in his hand. The mask was completely featureless, with no eyes, nose, ears or mouth. As he looked at it, his hand began to grow warm, and his eyes shined. It seemed as if he were about to put the mask onto his face.</p><br/><p>As the mask neared his face, it grew warmer, and began to squirm. A bloody aura emanated from it. Just as Meng Hao was about to place it on his face, the copper mirror within his bag of holding suddenly let out a sharp sound that was like the call of a bird.</p><br/><p>The birdcall entered Meng Hao’s mind, and his heart trembled. The light in his eyes suddenly became clear, and he suddenly put the mask down. His eyes filled with a hard look.</p><br/><p>“Are you looking to die, you discarnate soul?!”</p><br/><p>-----</p><br/><p><em>This chapter was sponsored by Jonathan Murphy</em></p><br/>\n</div>"}