{"title": "Chapter 133: Do You Dare?!", "id": 133, "volume": 2, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-133-do-you-dare", "volume_title": "Volume 2", "body": "<h1>Chapter 133: Do You Dare?!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 133: Do You Dare?!</strong></p><br/><p>Once the mask came off, the corpse would hand it to the person standing in front of it. That person would be the winner of the Legacy. This mask was the Legacy treasure!</p><br/><p>The Blood Dragon next to Li Daoyi looked excited. It had waited for this day for four thousand years. Once it entered the mask, it would become the Weapon Spirit and would finally be able to leave this place and return to the Southern Domain.</p><br/><p>“The Legacy is mine!” said Li Daoyi, his eyes glittering. However, it was at this exact moment that Meng Hao stepped out of the ninth matrix. When he saw what was happening, he didn’t hesitate in the slightest. His body shot forward at high speed.</p><br/><p>After achieving the Perfect Foundation and then entering this place, a strange feeling had appeared inside Meng Hao. It was as if he was the lord of this Legacy zone. The feeling had grown even stronger after the destruction of the ninth matrix.</p><br/><p>Next to him, the three-hundred-meter long mastiff raised its head to the sky and roared. Thanks to its incredible speed, it had arrived here even before Meng Hao.</p><br/><p>“This is my Legacy,” said Meng Hao his eyes flashing. “If I feel like ignoring it, that’s my business. But if you think you can just steal it away, well, that will depend on your luck!” He had experience stealing Legacies, and that in itself didn’t make him angry. It was his opponent’s tactics that pissed him off.</p><br/><p>Meng Hao’s desire to slay Li Daoyi had reached epic heights; utilizing the full power of his Cultivation base, he strode forward, his hand flashing an incantation gesture. The Lightning Flag flew out, as well as two wooden swords which emanated a freezing pressure. They all shot toward Li Daoyi.</p><br/><p>In the same moment, the corpse lifted the mask off of its face, and instantly turned into drifting ash. As the ash drifted out, the hand that held the mask also dissolved. The mask floated toward Li Daoyi.</p><br/><p>Excitement filled Li Daoyi’s face. His right hand lifted up to grab the mask, but the instant he touched it, his hand was shoved away by the mask itself. It wasn’t that he couldn’t take it, but rather, before he could, it required a Weapon Spirit. Then it would become his.</p><br/><p>The instant his hand was shoved away, the Blood Dragon lifted its head in a roar and then shot toward the mask. Currently, the mask had no Weapon Spirit. Whoever entered and took over the mask would assume that role.</p><br/><p>As soon as he slammed into the mask, the mask became like a vortex. The Blood Dragon was half way into the mask when suddenly the mastiff roared. The roar created ripples in the entire area, and it sped forward. Ignoring the fact that the Blood Dragon was already in the process of taking over the mask, its three hundred meter long body slammed into it.</p><br/><p>The mastiff’s body was sucked in as soon as it touched the surface of the mask. Its fight with the Li Clan Patriarch for control of the mask had begun!</p><br/><p>“You don’t know your own limitations,” echoed out the voice of the Li Clan Patriarch. “When I become the Weapon Spirit, I shall consume you!” He had completely entered the mask, and yet, so had the mastiff.</p><br/><p>A blinding red light emanated from the mask. And yet, within the redness could also be seen violet! It was as if two brilliant colors were trying to swallow each other up!</p><br/><p>Because of this, the mask did not belong to Li Daoyi, and neither did it belong to Meng Hao. Which Blood Divinity took over the mask would determine the winner of the Legacy.</p><br/><p>Furthermore… a situation in which two Blood Divinities struggled to be the Weapon Spirit was something the Blood Immortal had never imagined could happen. This was completely unprecedented.</p><br/><p>There was one thing that was for sure…. Whoever won, mastiff or Blood Dragon, would experience an unimaginable increase in power. At the very least, the winner would break halfway through to Spirit Severing. With the proper Dao enlightenment, the winner could even reach full Spirit Severing!</p><br/><p>“It was useless to save that second-rate Blood spirit,” laughed Li Daoyi. “It will just help me to acquire the Legacy!” Meng Hao approached, and their eyes locked. Now that the Legacy zone was beginning to crumble, at long last the two of them were in the same world together.</p><br/><p>Meng Hao said one sentence: “Killing you will resolve all the issues.” He continued to move toward Li Daoyi.</p><br/><p>“That’s exactly what I was going to say!” laughed Li Daoyi. He lifted his right hand, and it blazed with light. In front of him appeared a shining golden war chariot which shot toward Meng Hao.</p><br/><p>Suddenly, a roaring sound filled the air and blood leaked out of Meng Hao’s mouth. He retreated backward. Li Daoyi’s face flickered, and he also retreated, blood spilling out of his mouth. He looked at Meng Hao, and it was at this moment that the entire Legacy zone began to crumble around them. Cracks appeared all over the surface of the dark green sacrificial altar.</p><br/><p>Everything began to split up. Popping sounds could be heard, and from the appearance of everything, it seemed the Blood Immortal would destroy itself and disappear.</p><br/><p>Anyone who didn’t leave, would be buried along with it!</p><br/><p>The struggle inside the mask between the mastiff and the Blood Dragon seemed to be escalating. Originally, the mastiff would never have been a match for the Blood Dragon. But it had been resurrected by absorbing blood from Meng Hao’s Perfect Foundation. This had changed it into something never before seen among Blood Divinities.</p><br/><p>The spiritual energy in the area rushed toward the mask, being absorbed by both the mastiff and the Blood Dragon. The difference was, however much the mastiff absorbed, it could use. None of it leaked out. With the Blood Dragon, this was not so.</p><br/><p>Amongst the two of them, although the Blood Dragon started out with the upper hand, after a short time had passed, it was still unable to get rid of the mastiff. It also had no way to take control of the Legacy mask.</p><br/><p>Seeing this, Li Daoyi’s expression changed, and he retreated. He flicked his wide sleeve in an attempt to snatch the mask, but was again rebuffed violently. With no Weapon Spirit in control of it, no one could dare to take it away!</p><br/><p>The Blood Immortal had never predicted such an unusual situation. Normally speaking, one person should arrive to take the mask. The Blood Divinity would be able to take control of the mask within the space of a few breaths, and would become the Weapon Spirit. Then the Legacy zone would begin to collapse, and the winner could take the mask and leave.</p><br/><p>Instead, something completely unexpected had occurred, and thus a shocking life-or-death crisis had come to be!</p><br/><p>The world was crumbling around them. Down below, a huge vortex had appeared which was swallowing up everything. Nothing that entered could ever come out again. The destruction all around was creating an empty world!</p><br/><p>Up above was a glowing shield, upon which ripples were beginning to form. It would only last for so long before it too shattered. This shield was the only exit to the outside world.</p><br/><p>Entering that shield was the only way to escape destruction.</p><br/><p>No one was in control of the mask. Both parties refused to budge. The mask could not be taken out, and the world was being destroyed. When Li Daoyi realized what was happening, his expression twisted.</p><br/><p>Meng Hao, on the other hand, was completely calm. He moved backward for a moment, wiping away the blood from his mouth. Then he advanced forward. His three Perfect Dao Pillars emitted a powerful spiritual power, and as he charged ahead, his right hand flickered in an incantation sign. Instantly, a three-hundred-meter long Flame Python roared into being and shot toward Li Daoyi.</p><br/><p>Actually, this was no python, it was a dragon! A roaring, gold dragon, enveloped in scorching flame. Behind it flew a Wind Blade thirty meters long. Burning wind filled the area, enveloping Li Daoyi.</p><br/><p>Up to now in his Cultivation, Meng Hao hadn’t learned very much magic techniques. All of his magical techniques were from the Qi Condensation stage, and he had none whatsoever from the Foundation Establishment stage. This was one of his weaknesses, and Meng Hao was well aware of it.</p><br/><p>“We will see who is more ruthless….” said Li Daoyi with a cruel laugh. He could clearly see that the magic being used was unconventional. But he had also already determined that it would be difficult to quickly achieve victory. The true key to victory, was who would stay the longest in this collapsing world. Whoever left first without the mask, would lose any qualification to be the winner of the Legacy.</p><br/><p>Li Daoyi’s face was grim. He was a Dao Child of the Li Clan. The title of Dao Child was something he had won through pure slaughter. He was out for himself, and would kill without hesitation. As far as stealing good fortune from others, this was something he had done before more than once. He had come from an unremarkable branch of the Li Clan to become a Dao Child, far above Chosen.</p><br/><p>This was all because of his personality. He arrogantly believed his stubborness to be one of his greatest assets. Suddenly, a fan appeared in his hand. It was a fan of four colors, and when he waved it, the colors expanded out, slamming into Meng Hao’s Fire Dragon and Wind Blade.</p><br/><p>A boom echoed out. The four colors swished out in four directions, transforming into four swords which stabbed toward Meng Hao.</p><br/><p>Li Daoyi laughed maniacally. His left hand slapped his bag of holding, and eighteen black pearls appeared in his palm. He tossed them toward Meng Hao, and as they approached, they unexpectedly exploded. Distortions rippled out along with the explosion, causing the crumbling environment to fall apart even faster.</p><br/><p>“Still think you’re more ruthless than me?” Li Daoyi’s expression was one of pure insanity.</p><br/><p>The four colored sword and the attacking distortion bore down upon Meng Hao’s lightning mist. A massive boom exploded out, and Meng Hao shot backwards several paces. His eyes were filled with a ruthless light. His right hand lifted up, and another three hundred meter long Flame Dragon appeared in the air and flew, not toward Li Daoyi, but toward the glowing door up above.</p><br/><p>“Making this place fall apart quicker isn’t ruthless,” he said coolly. “Destroying the exit… now that is ruthless. Do you dare to?” The Flame Dragon slammed directly into the glowing door, exploding. The already rippling door began to tear apart. Massive parts of it crumbled into nothing.</p><br/><p>Seeing this, Li Daoyi, who had claimed to be incredibly ruthless, went completely wide-eyed. His heart began to pound.</p><br/>\n</div>"}