{"title": "Chapter 138: Good Luck Charm", "id": 138, "volume": 2, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-138-good-luck-charm", "volume_title": "Volume 2", "body": "<h1>Chapter 138: Good Luck Charm</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 138: Good Luck Charm</strong></p><br/><p>As Meng Hao uttered the words, his left hand flickered in an incantation gesture. He pressed a finger onto his solar plexus, and some blood from his Cultivation base seeped out of his mouth. This blood was very precious; Cultivators could only produce so much of it. But Meng Hao didn’t hesitate. He wiped the Cultivation blood off of his lips with a finger, then pressed the finger onto the mask.</p><br/><p>According to the Spirit Devouring Scripture branded onto his mind, this was a simple method to take control of the mask.</p><br/><p>His finger sank inside, deep into the mask’s recesses. It pushed very far back, into a distant corner. There, face gloomy and uncooperative, was the Li Clan Patriarch.</p><br/><p>“Your will is weak!” cried the Li Clan Patriarch shrilly. “Therefore, the mask tried to bewitch you!”</p><br/><p>Meng Hao’s finger paused before the Li Clan Patriarch. His eyes were cold, and he said nothing. After a moment, he pushed down, causing the Li Clan Patriarch to let out a shrill, depressed groan. His body grew dim as he was pressed down; it seemed as he might fade away.</p><br/><p>“In the outside world, I could destroy you countless times over with a single finger!” roared the Li Clan Patriarch furiously. Filled with stubborness, he glared out with fading eyes. Meng Hao’s finger paused, then slowly moved back. But then, just when the Li Clan Patriarch was heaving a sigh of relief, it pushed back down onto him.</p><br/><p>Another miserable cry rang out, not depressed, but anguished. The Li Clan Patriarch’s body wasn’t just growing dim, it was now draining Blood Qi. He looked incredibly dismal. However, he continued to hold his head up and glare at Meng Hao’s finger.</p><br/><p>“Was I bewitched by the mask itself, or were you secretly guiding it?” asked Meng Hao coolly. “We’re both well aware of what happened. These two finger attacks are punishment, and the repercussions have not disappeared. If it happens again, then I, Meng Hao, will be forced to break our agreement and obliterate you from existence.” He pulled his finger back. The Li Clan Patriarch might look strong-willed on the surface, but was actually very perturbed on the inside. Fear lingered in his heart because of Meng Hao’s ruthless tactics.</p><br/><p>Just now, he really had taken advantage of Meng Hao’s period of enlightenment regarding the Spirit Devouring Scripture. He had secretly used some special methods to influence the mask and try to get Meng Hao to wear it. Just when he thought he had succeeded, Meng Hao had come to his senses.</p><br/><p>“This discarnate soul is very strange,” said Meng Hao, glancing at the mask. “It’s not because of the Blood Divinity, there must be some other reason.” Having removed his finger, he squeezed some blood to drop onto the spirit of the Li Clan Patriarch.</p><br/><p>As the blood descended, it turned into a blood mist, which then enveloped the Li Clan Patriarch. Miserable screams echoed out. Meng Hao’s expression was as usual. He pulled back his Spiritual Sense, allowing the Li Clan Patriarch to continuously wail inside the mask.</p><br/><p>A part of the Legacy Meng Hao had acquired was a warning from the Blood Immortal. Now he knew that he should not put the mask on casually. If he did, he might lose himself. The Blood Immortal hadn’t even explained the origin of the mask, and it seemed to have countless changes within it.</p><br/><p>However, wearing it had many advantages. Many of the techniques and magic of the Blood Immortal Legacy could only be used while wearing the mask. For example, the four great magics.</p><br/><p>Unfortunately, without a Core Foundation Cultivation base, the mask could not be worn under any circumstances.</p><br/><p>That having been said, the techniques created by the Blood Immortal after his three defeats—the Finger, the Palm, and the Death World—did not require the use of the mask. Instead, they had been branded onto Meng Hao’s mind.</p><br/><p>“Even though I’m the winner of the Legacy, I couldn’t control the power of the mask just now. And yet that discarnate soul could…. The mastiff clearly took over the mask and became the Weapon Spirit, so how could the discarnate soul have done it?” Meng Hao’s expression didn’t change, but this issue was certainly weighing on his heart. It was one of the reasons why he hadn’t simply slain the Li Clan Patriarch.</p><br/><p>Putting the mask back into his bag of the Cosmos, Meng Hao sat silently in thought. He looked around carefully, then took out the copper mirror. Holding it in his hands, he examined it carefully.</p><br/><p>If it weren’t for the noise from the mirror just now, Meng Hao most certainly would have put on the mask. He wasn’t sure what would have resulted, but considering the warning of the Blood Immortal, he couldn’t help but feel a bit of fear in his heart.</p><br/><p>“The sound just now was just like the call of a bird….” He looked at the copper mirror for a while, and even sent his Spiritual Sense into it. But nothing happened, so after some time passed, he put it back. Then, he lifted up the good luck charm he had acquired from Patriarch Reliance.</p><br/><p>He had studied it in the past to no avail. But this time, as he held it in his hand, he rotated his Cultivation base and sent some spiritual energy into. Suddenly, his eyes gleamed.</p><br/><p>“So, it does have a function…. I wonder how Elder Sister Xu is doing nowadays. I haven’t seen her for so many years, I wonder if she’ll remember me?” An image coalesced in Meng Hao’s mind of Xu Qing’s cold demeanor as she talked about the Cosmetic Enhancement Pill. A warm look appeared on his face.</p><br/><p>“It’s been so many years….” Meng Hao slowly raised his head and looked off into the distance. A long time passed before he rose to his feet and flew off of the barren mountain, heading off into the distance.</p><br/><p>Half a month later. A walled city within the Black Sieve Sect territory. A bustling city of Cultivators. A young man sat in an inn, dressed in long, black scholar’s robes. He sipped from a cup of alcohol he held in his in hand. Occasionally he would lift his head to look out the window toward the city center, and the towering black pagoda there that rose up into the sky.</p><br/><p>This young man’s skin was a bit dark, but his demeanor was scholarly and refined. He had delicately chiselled features that, coupled with his scholar’s clothes, truly gave him the air of a mortal intellectual.</p><br/><p>He had a simple but elegant gait, with bright eyes that were filled with intelligence. His lips were pursed in a way that seemed to indicate he was not easy to approach.</p><br/><p>This was none other than Meng Hao. He had arrived in this place a few days ago to confirm the widely spread rumours regarding the Black Sieve Sect.</p><br/><p>He wanted to go see Xu Qing, but obviously couldn’t just directly go looking for her. Instead, he figured he would take advantage of the gathering of rogue Foundation Establishment Cultivators called by the Black Sieve Sect. He wasn’t sure exactly when the gathering was to take place, but he’d decided to come ahead to gather some information before making any final decision.</p><br/><p>“I never imagined that there would actually be a Tower of Tang here….” he muttered to himself, his eyes sweeping over the black pagoda off in the distance. [1. If you're interested in previous appearances of the Tower of Tang, check out Chapter 1: Scholar Meng Hao and Chapter 59: Unable to See Chang'an]</p><br/><p>Before, he had assumed that Towers of Tang only existed in the cities of mortal. But here one was, right in this city of Cultivators.</p><br/><p>He looked quietly at the Tower of Tang for a while, then put down his cup of alcohol. In his hand appeared an ancient piece of jade, covered with cracks. It wasn’t the Demon Sealing jade, but rather the good luck charm Meng Hao had taken from Patriarch Reliance.</p><br/><p>He had studied it several times in the past but hadn’t been able to determine its use. After establishing a Perfect Foundation, however, he had been able to reach some conclusions based on various clues.</p><br/><p>“This good luck charm can actually shift a person’s location…. it’s like a random teleporter. Unfortunately, it’s covered with cracks, and can only be used a few times.” He turned the good luck charm over and over in his fingers. By casting his Spiritual Sense into, he could sense it emanating its teleportation ability.</p><br/><p>“There is no set teleportation destination. In other words, once used, the good luck charm could send me anywhere. I can’t just test it out randomly.” He glanced over the good luck charm again, then put it away. Considering his experience with the roc, he didn’t want to be taken anywhere beyond his control. Who knew what terrible situation he might find himself in?</p><br/><p>As he sat in thought, more and more Cultivators began to fill up the inn. This place only sold one type of alcohol, brewed from bamboo. It didn’t burn in the mouth, but upon sliding down the throat, it let off a burning heat. Once in the stomach, it burned even hotter, causing the whole body to heat up. Such a feeling is hard to describe. If you liked such a feeling, then you would end up loving it; if you didn’t like it, you wouldn’t be willing to drink a drop.</p><br/><p>Not far from Meng Hao, a group of Cultivators was conversing in low voices.</p><br/><p>“Everyone’s being a bit more cautious than usual. There’s a lot of unfamiliar Foundation Establishment Cultivators around lately….”</p><br/><p>“That’s right. They’re all rogue Cultivators, fishes and dragons mixed together. In fact, I saw a guy a few days ago who had intense killing intent. I think he must be a savage Cultivator from the Black Lands.”</p><br/><p>“They’re all here for the reward posted by the Black Sieve Sect. The Black Sieve Sect really didn’t hold anything back. They’re offering Sieve Earth Pills. Those are one of the five most effective pills for the Foundation Establishment stage. It’s even said that Grandmaster Pill Demon from the Violet Fate Sect sings its praises. No one outside of the Black Sieve Sect can concoct it.”</p><br/><p>“It’s not that they can’t, it’s that they’re not able. Each Sieve Earth Pill is inscribed with a talismanic seal. Regardless of person or Sect, if any attempts to concoct it, they will face the threat of extermination by the Black Sieve Sect.”</p><br/><p>From their tone, it was obvious that they coveted the Sieve Earth Pills. In the midst of their discussion, someone entered from outside. It was a young man wearing a black robe. His expression was ice cold, and as he stepped foot into the inn, his gaze swept the crowd before he took a seat in the corner. He produced a chip of iron about the size of a finger nail, which he fiddled with as he sat there thinking, occasionally looking around the room.</p><br/><p>Meng Hao’s expression was the same as ever. He lifted his cup to his mouth and took a drink.</p><br/><p>He had been sitting there an entire day. Outside, the sun filled the sky with its glow. He had heard quite a bit about about the Black Sieve Sect’s gathering of Foundation Establishment Cultivators.</p><br/><p>Anyone Cultivator of the Foundation Establishment stage could participate and receive a Sieve Earth Pill, regardless of background or heritage.</p><br/><p>“Anyway, back to the point. What exactly is the Black Sieve Sect trying to accomplish? They're one of the dignified five great Sects of the Southern domain. Why are they gathering so many Foundation Establishment Cultivators? There’s obviously something strange going on. To offer up Sieve Earth Pills shows that whatever it is, it’s obviously incredibly dangerous!”</p><br/><p>“Brother Sun, your information is a bit out of date. According to the rumors that I heard, the Black Sieve Sect discovered the site of an ancient battle field. They’ve already tried to search it a few times, but were resisted by some ancient spell. If they can get enough Foundation Establishment Cultivators to replace the eye of the spell, then they can break through. Obviously, it’s incredibly dangerous.”</p><br/><p>“All of the rumors are just hearsay. Ancient battlefields are always incredibly inauspicious. No wonder the Black Sieve Sect is offering up Sieve Earth Pills!”</p><br/><p>Although their voices were low, and not very clear within the inn, considering Meng Hao had three Perfect Dao Pillars and could hold his own against the late Foundation Establishment Stage, hearing the conversation of these individuals was not difficult.</p><br/><p>A Perfect Foundation was a legend that had not appeared for tens of thousands of years. Once he reached the mid Foundation Establishment stage, he would be a match for Dao Children of the various Sects and Clans.</p><br/><p>That having been said, having a Perfect Foundation was very dangerous. This danger came when it came time to pass into Core Formation. During that time, the Heavenly Tribulation would be incredibly powerful, far more powerful than that of the Foundation Establishment stage. Meng Hao wasn’t sure if he could pass through it. After all, if he hadn’t been assisted by the Blood Immortal and the Ancient Temple of Doom, then he surely would have perished under the Tribulation Lightning.</p><br/><p>“Well, Core Formation Tribulation is very far away. I can think about it now, but I shouldn’t worry too much.” Meng Hao took another drink from his glass. A warm, burning sensation filled his body. Meng Hao thought about the information from Shangguan Xiu’s turtle shell, which described the Perfect Foundation and the Perfect Gold Core.</p><br/><p>“I wonder, when I reach Core Formation, will I be able to refine a Perfect Gold Core? What will that be like?” He hesitated for a moment, then put the matter aside. However, he had decided that he would begin to gather the ingredients needed to refine a Perfect Gold Core.</p><br/><p>Dusk was approaching, and there were few Cultivators left in the inn. Meng Hao was just about to get up and leave, when suddenly his expression changed. He turned his head, looking further back into the inn. There in the corner, was the black-robed young man. He was no longer frowning, but instead, was staring coldly at Meng Hao. A killing aura slowly emanated from him, surrounding him and transforming into what seemed like a mountain of corpses and a sea of blood.</p><br/><p>“You have something I need,” he said coldly, his eyes fixed on Meng Hao.</p><br/>\n</div>"}