{"title": "Chapter 146: This is Ultimate Vexation!", "id": 146, "volume": 2, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-146-this-is-ultimate-vexation", "volume_title": "Volume 2", "body": "<h1>Chapter 146: This is Ultimate Vexation!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 146: This is Ultimate Vexation!</strong></p><br/><p>There was a hole between the eyebrows of the corpse, which appeared to be completely frozen. It was as if the rest of the corpse might decay, but this spot would exist for all eternity.</p><br/><p>Everyone stood stock still, gazing at the jellyfish as it slowly floated along. Its long tentacles drifted through the midst of the Feng Shui compasses, then proceeded on into the distance. Finally, Patriarch Violet Sieve let out a light sigh. He stood and faced the departing jellyfish. Clasping his hands together, he gave a deep, respectful bow.</p><br/><p>Then, his ancient voice slowly filled the air. “That was the third generation Ancestor of the Black Sieve Sect. His Cultivation base was at the peak of the Dao Seeking stage. As he was attempting to reach Immortal Ascension, a Patriarch of the Wang Clan mounted a sneak attack against him. He was not able to achieve Immortality, and fell to this path.</p><br/><p>“That year, our Sect and the Wang Clan fought a bloody war that lasted for three thousand years. Eventually, the hostilities ceased. However, all of you Black Sieve Sect disciples should take to heart this bit of Sect history.”</p><br/><p>It seemed that for many of the Black Sieve Sect disciples, this was their first time hearing of the matter. Their eyes glittered brightly as they listened. Meng Hao’s heart thumped as he silently watched the jellyfish depart.</p><br/><p>Soon, the group proceeded onward; they didn’t encounter any more strange phenomena like the jellyfish. They flew for about two days, until suddenly, the blinding glow of the Feng Shui compasses disappeared down a smaller branch of this path between Mountains.</p><br/><p>Meng Hao could now see an incredible mountain range that stretched out seemingly without end. Everything was gray as far as the eye could see, with no vegetation present whatsoever. Far in the distance was what appeared to be a massive, fissure-like canyon that formed a path.</p><br/><p>On either side of the path were cliffs that stretched down so far that the bottom wasn’t visible.</p><br/><p>Surprisingly, there were several hundred Cultivators sitting cross-legged outside of the canyon. Their faces were all pale, and they looked somewhat down and out. Forty or fifty of them were wearing random styles of clothing, and were obviously not Black Sieve Sect disciples. They were a group of rogue Foundation Establishment Cultivators who had arrived much earlier than the group Meng Hao was part of.</p><br/><p>The two groups exchanged glances.</p><br/><p>The rest of the Cultivators were Black Sieve Sect disciples. When they caught sight of the group led by Patriarch Violet Sieve, their expressions grew brighter. They all stood up, and from within their midst emerged a beautiful, middle-aged woman wearing resplendent clothing [1. If you forgot about the \"beautiful, middle-aged woman\" then you should re-read Chapter 42: Who Dares to Touch Him!?]. She emanated a mature grace, although her face was somewhat pale.</p><br/><p>When she saw Patriarch Violet Sieve, she let out a light sigh, and nodded.</p><br/><p>The woman didn’t notice Meng Hao, but he recognized her. She was the one who had taken Xu Qing away from the Reliance Sect all those years ago.</p><br/><p>“Together with Patriarch Violet Sieve, there are now two Nascent Soul Cultivators present,” thought Meng Hao. “…. Exactly what is this place? Is it really a Blessed Land?” He thought for a moment, then lifted his hand up to pat his bag of the Cosmos. He then held up the good luck charm and sent a bit of spiritual power into it. He still sensed the teleportation ability within, which lessened some of his anxiety.</p><br/><p>One of the main reasons he’d decided to come to the Black Sieve Sect was because of his ability to rely on the good luck charm’s teleportation. Patriarch Reliance had kept this object in his collection, which caused Meng Hao to be confident in it, even though he’d never tried it out.</p><br/><p>Out of the corner of his eyes, he caught sight of Xu Qing within the large group of Cultivators. Her brow was furrowed as the coquettish woman next to her ridiculed her.</p><br/><p>Meng Hao frowned. He could see that Elder Sister Xu was unhappy. He glanced at the coquettish woman, and the coldness in his eyes grew icier.</p><br/><p>It was at this moment that Patriarch Violet Sieve stood up, and the Feng Shui compass beneath him shrank down. He strode forward toward the beautiful woman, and they began to converse in low tones. An unsightly expression appeared on the face of Patriarch Violet Sieve as they continued to discuss some matter. Then, they turned together and walked toward the fissure-like canyon.</p><br/><p>Next, all of the Black Sieve Sect disciples left the Feng Shui compasses, transforming into beams of light as they shot into the fissure. The Cultivators sitting cross-legged outside of the fissure also rose to their feet and moved in.</p><br/><p>Xie Jie clasped hands toward the rogue Cultivators, including Meng Hao. “Ladies and gentleman, please, follow me.” The Feng Shui compass beneath them began to shrink. Everyone seemed to be considering what to do. However, no one retreated. Taking their various thoughts with them, the group turned into beams of light and shot into the fissure.</p><br/><p>Meng Hao’s expression was calm as he flew forward slowly. Behind him, the group containing Xu Qing began to follow. However, she was obviously not of Foundation Establishment; she couldn’t achieve true flight and instead flew along on top of a colorful mist.</p><br/><p>Meng Hao slowed down a bit, but then Xie Jie suddenly turned and looked at him, his eyes flashing like lightning. It seemed he was about to say something, but then didn’t, as a woman suddenly approaching Meng Hao from off to the side.</p><br/><p>“Fellow Daoist Meng, we meet again.” The woman wore a long, violet robe. She was beautiful and charming, and when she smiled, her teeth were were white. She flew along at Meng Hao’s side.</p><br/><p>“Ah, Fellow Daoist Han,” said Meng Hao, looking at her and nodding. This was the woman who had delivered the Sieve Earth Pill to him a few days ago.</p><br/><p>The group of people, nearly one thousand strong, whistled through the air into the fissure. Cliffs rose up on either side of them. Nothing was visible beneath them, as if the fissure was bottomless.</p><br/><p>“Fellow Daoist Meng,” Han Bei said suddenly, her voice light and pleasant, “you have a very refined style. Presumably, you come from an extraordinary family. Do you really need to participate in this event just to get a Sieve Earth Pill?”</p><br/><p>Meng Hao’s eyes flickered as he looked at her.</p><br/><p>“I’m afraid I don’t understand what you’re talking about, Fellow Daoist Han.” At this point, the group had flown quite a distance into the fissure. The cliff walls around them were gradually turning black in color. The rocks were now beginning to glitter.</p><br/><p>Before Han Bei could respond to him, the surrounding Cultivators began to speak excitedly.</p><br/><p>“This is… a crystal cliff!”</p><br/><p>“What is this place? There’s so much crystal! It’s even superior to high-grade Spirit Stones!”</p><br/><p>Some of the Cultivators flew up and struck the crystal cliff face, clearly intending to dig some out.</p><br/><p>However, the instant they struck the cliff wall, blood-curdling screams rang out as their bodies withered up. Their life force, flesh and blood were sucked away in an instant. In the blink of an eye, they were transformed into drifting ash, including their bags of holding. The places where they had touched the cliff walls now seemed to have grown a bit more crystal than before. It twinkled mysteriously.</p><br/><p>Seeing this, Meng Hao’s eyes narrowed. The surrounding rogue Cultivators sucked in their breaths. As for the Black Sieve Sect disciples, they didn’t even seem to notice. Apparently, they were already aware of what the crystal cliff wall could do.</p><br/><p>“Brother Meng,” said Han Bei with a deep, meaningful smile. “You’re being watched. Please look out for yourself. By the way… are you really surnamed Meng?” Before he could respond, she left his side.</p><br/><p>Suddenly, an enormous roaring sound could be heard. It filled the air, causing everything to shake. Then, just as suddenly, it disappeared. Meng Hao frowned as Han Bei flew away from him. Then his gaze fell onto an enormous stone door up ahead, which Patriarch Violet Sieve and the beautiful middle-aged woman had worked together to destroy.</p><br/><p>The stone door was refusing to stay in pieces. It seemed to have been congealed by some unusual power that caused it to grow back together.</p><br/><p>Past the broken the stone door, Meng Hao saw another group of two hundred cross-legged Cultivators. They stood up. In front of them was a pale-faced young man who held a pearl in his hands. The pearl let off a gentle glow which seemed to be slowing the recovery process of the stone door.</p><br/><p>“Junior Liu Wu extends greetings to the Patriarchs.” As he spoke, Patriarch Violet Sieve and the beautiful woman entered through the stone door. They flicked their sleeves, causing the door to repair itself even more slowly.</p><br/><p>Next, the group of a thousand Cultivators, including Meng Hao, shot quickly through. It didn’t matter whether or not they wanted to, because behind the group were the three Core Formation eccentrics. With them taking up the rear, no one would dare to retreat backward.</p><br/><p>The path beyond the stone door was even stranger. There were four similar doors in total that had to be destroyed, beyond each of which waited more Black Sieve Sect disciples.</p><br/><p>As they proceeded, Meng Hao grew more and more cautious. Obviously, the Black Sieve Sect had investigated this area more than once. In fact, they seemed to have done so many times.</p><br/><p>“These stone doors are like seals. This place….” Meng Hao looked ahead, his brow furrowed. Suddenly, he stopped moving. He wasn’t the only one; everyone stopped and stared ahead.</p><br/><p>There in front of them was a large black door. This door was not made of stone, but rather of some metallic substance. It was inset into both cliff walls, and emitted a black glow. On the surface of the door was an enormous face. The face’s eyes were closed, as if it were sleeping.</p><br/><p>As they approached, the eyes suddenly opened, and the face emitted a roar which caused everything to shake. Even Patriarch Violet Sieve couldn’t prevent himself from coughing up a mouthful of blood.</p><br/><p>Meng Hao did as well. The blood spit up by the group of people turned into a stream that the giant face sucked in. After gobbling up the blood, it let out a burp.</p><br/><p>The face’s voice was like the roar of thunder: “In accordance with the orders of my master, I guard Ultimate Vexation. Without the pendant, you may not enter the… Uh, what are you guys doing here again?”</p><br/><p>Patriarch Violet Sieve and the beautiful woman both clasped hands and bowed deeply, reverent looks on their faces. Patriarch Violet Sieve pulled out a bamboo tube, out from which flew a dilapidated hide.</p><br/><p>When he saw the hide, Meng Hao’s eyes narrowed. The feeling he got when looking at it was exactly the same as that from the strange figure that night.</p><br/><p>As the hide flew out, the indistinct image of an eye appeared. The eye stared at Meng Hao.</p><br/><p>Their gazes locked, and Meng Hao’s pupils constricted.</p><br/><p>The hide unfurled and came to rest in front of the face.</p><br/>\n</div>"}