{"title": "Chapter 148: Things Are About To Go Down", "id": 148, "volume": 2, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-148-things-are-about-to-go-down", "volume_title": "Volume 2", "body": "<h1>Chapter 148: Things Are About To Go Down</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 148: Things Are About To Go Down</strong></p><br/><p>After everyone entered the black door, the massive face began to warp. Three misty figures dissolved out of the face, which then transformed into three wizened old Cultivators. They looked as if they had just crawled out of the grave.</p><br/><p>Without hesitation, they head back toward the statue from which they had come. As they moved toward it, massive amounts of black aura emanated off of them, as if they were corroding.</p><br/><p>“What happened?” said the face. “Oh well. Anyway, without the authentication item, you cannot enter!” It looked confused for a moment, but then its eyes grew clear and it began to howl.</p><br/><p>Currently, there were only eleven people left within the fissure. In addition to Patriarch Violet Sieve and the beautiful middle-aged woman, there were nine others, all of them Core Formation Cultivators. They ignored the howls of the face in the door, sitting down cross-legged and closing their eyes. At the same time, their hands flickered with incantation gestures. In the middle of the group of nine appeared a Ginseng fruit, floating in the air.</p><br/><p>The fruit was glittering and translucent. Its interior roiled as if it contained good fortune from the Heavens inside.</p><br/><p>The Spirit fruit writhed along with the rotation of the nine Cultivation bases, and it looked as if it were beginning to grow a head and four limbs.</p><br/><p>Patriarch Violet Sieve and the beautiful middle-aged woman stood off to the side, their gazes fixed onto the Spirit fruit.</p><br/><p>“I went in once,” said the middle-aged woman with a frown. “But after the space of about thirty breaths, the expelling force within became very intense. Even with my Divine Sense, I was unable to locate the object. I can only hope that the Hundred Spirits Tower will be effective. It’s still not quite complete. Hopefully this time there will be enough.”</p><br/><p>Patriarch Violet Sieve was silent for a moment before coolly replying, “I personally prepared this Spirit Ginseng. With the Ginseng form, we can stay inside for the time it takes an incense stick to burn. Everything is prepared. If we cannot succeed this time, then in accord with the words of the Sect Leader and the Patriarchs, we will open the Blessed Land to the public. We will borrow the might of the entire Southern Domain to refine the object of legends. After all, to Cultivators like us, that object is the only hope we have other than the Rebirth Cave!”</p><br/><p>The beautiful woman hesitated for a moment and then said, “If that happens, though, we will be forced to share. Even if the Black Sieve Sect does the refining, the more people who are involved, the less of a chance we will get our turn…. I might have it a bit better off, but you and the others will be much more limited.”</p><br/><p>“True. Even if we have to sacrifice some of our own Sect’s disciples this time, we will not fail!” A dark violet color appeared within the birthmark on his face, giving him a very fierce appearance.</p><br/><p>**</p><br/><p>The world spun, making it impossible to determine which direction was which. Everything was murky. It wasn’t long, though, before everything began to grow clear. The dark sky grew a deep blue color. The earth below was filled with dark soil.</p><br/><p>Verdant foliage was everywhere, covering the hills, which rose and fell off into the distance. A large river snaked through mountains, and the gurgling sound of water could be heard.</p><br/><p>This was what Meng Hao saw when he appeared. No one else was visible, only him.</p><br/><p>“This place is pretty big….” he said, looking up into the sky. The sun was beginning to set, filling the sky with a beautiful red color.</p><br/><p>In fact, upon closer observation, Meng Hao was able to see evidence of an invisible moon.</p><br/><p>“The meeting place for our Classic of Time group is the place where the image of the sun and moon intersect.” Meng Hao’s eyes glittered as he strode forward, transforming into a beam of prismatic light.</p><br/><p>“And then there’s that supposed Hundred Spirits Tower. What’s that?” Meng Hao felt misgivings in his heart. As he moved forward, the first thing he did was retrieve the good luck charm from within his bag of the Cosmos. Probing it with Spiritual Sense, he felt a bit more at ease. He was really coming to value the good luck charm more and more.</p><br/><p>“No wonder Patriarch Reliance had this charm in his collection. It can even teleport out of this place.” He put the good luck charm back. This was now his life-saving treasure.</p><br/><p>“Elder Sister Xu was right behind me, but who knows where the Black Sieve Sect people appeared. Did they come out together, or were they sent in randomly? The latter is more likely. Well, in any case, I need to find her as quickly as possible.” A fierce glow appeared in his eyes as he thought of the cold laugh of the coquettish woman who had stood next to Elder Sister Xu, and of Xu Qing’s pale face.</p><br/><p>As he thought about her, he took out the jade slip distributed by the Black Sieve Sect. Imbuing it with some Spiritual Sense, he saw a list of names. He perused the list, retracted his Spiritual Sense, and then crushed the jade slip.</p><br/><p>Then he shot forward in search of Elder Sister Xu.</p><br/><p>Time passed, and soon evening fell. The sky grew dark, and the moon rose. Everything was dark. Meng Hao currently stood on a small hill, looking out at some ancient ruins not too far off in front of him.</p><br/><p>At the moment, the moon was covered by dark clouds, causing the ruins up ahead to be somewhat obscured. They seemed incredibly old, as if they had seen the passing of many ages. Meng Hao got the feeling that many, many years ago, it had been a bustling city.</p><br/><p>Now, though, it was half consumed by the land. Only a few structures were visible, and even they were falling apart. On this moonlit night, it seemed very lonely. The wind blew across the ruins, carrying strange sounds with it.</p><br/><p>It sounded like countless people murmuring softly. Meng Hao couldn’t make out what they were saying, but all of the voices combined together created a very bizarre feeling.</p><br/><p>In front of the ruins was a stone stele. Almost nothing remained of the characters that had once been carved into it, but now it was almost completely blank, and covered with cracks.</p><br/><p>He looked it over, and was about to turn and leave when suddenly his expression flickered. The dark clouds passed, and suddenly moonlight spilled down. Meng Hao caught sight of something in one of the cracks in the stone stele. There inside was a golden vine-like twig. It seemed to be squirming. It was covered with leaves that wrapped around tiny pieces of fruits the size of a thumb.</p><br/><p>He recognized this fruit from the jade slip he had just crushed; it was one of the items the Black Sieve Sect wanted, and was called a Moonstone fruit.</p><br/><p>His expression calm, Meng Hao did nothing. He simply sat on the hill cross-legged, looking out with cold eyes.</p><br/><p>Not too much time passed before a figure sped out from the nearby forest. It was a middle-aged man with a Cultivation base at the early Foundation Establishment stage. He shot directly toward the stone stele, arriving in front of it in the blink of an eye. He reached up to grab the Moonstone fruit.</p><br/><p>However, the instant he touched one of the fruits, a cold light sprang out from within the Stone Stele. The middle-aged Cultivator shot backward, a look of shock on his face. The cold light transformed into several beams, which swept toward him.</p><br/><p>Popping sounds rang out, and the man coughed up blood. Astonishment was written on his face as he attempted to defend himself. But before he could do anything, his body began to tremble. Suddenly, his head flew off of his shoulders, severed. At the same time, the golden vines in the cracks of the stele extended out, entwining around the headless body. One of the vines stabbed into the bloody flesh. It seemed to be swallowing something. Sure enough, in the space of a few breaths, the Cultivator’s body shriveled and withered.</p><br/><p>Meng Hao saw all of this happen. He continued to sit there quietly, a brilliant glow emanating from his eyes.</p><br/><p>“What are the vines consuming?” he thought.</p><br/><p>Even as he watched, the stone stele began to ripple and distort, and a grim-faced young man wearing a violet robe walked out of it. He was at the peak of the mid Foundation Establishment stage, close to the late stage. Wrapped around his arms were thick rattan vines, which stretched out like tentacles. He looked very fear inspiring.</p><br/><p>Meng Hao had seen him before. He was one of the Black Sieve Sect disciples that had traveled in the group with him to this place. He had been among the Chosen on the violet Feng Shui compass.</p><br/><p>The young man didn’t give a passing glance to the shriveled up corpse. Instead, he raised his head to look directly at the hill where Meng Hao was seated. His eyes flashed.</p><br/><p>Meng Hao sat there cross-legged, looking back at him. There was only a few hundred meters’ distance between them. They looked at each other for the space of a few breaths. Then, the young man dashed forward and leaped into the air, his body transforming into a prismatic beam that shot toward Meng Hao.</p><br/><p>Meanwhile, in a different location not too far away, Xu Qing sped along, her face pale. The colorful mist beneath her feet was on the verge of falling apart. Behind her was Elder Brother Zhao from the Black Sieve Sect. A smile covered his face. At his side was the coquettish woman, who was surnamed Xue. Together, they pursued Xu Qing in a leisurely fashion.</p><br/><p>“Junior Sister Xu, you were able to get away last time because you got lucky,” he said. He was quite handsome, this young man named Zhao. “This time, however, I paid off Elder Brother Xie. He issued a secret order for any disciple who caught sight of you to notify me. Look, we’ve only been here for a couple hours and I already found you.” He laughed, and the sound of his voice rang into Xu Qing’s ears, causing her face to grow even more pale. She gritted her teeth tightly. She said nothing, instead shooting forward as fast as possible. However, it didn’t really matter how fast she went. Zhao was a Foundation Establishment Cultivator, and there was really nothing she could do to evade him.</p><br/><p>“Junior Sister Xu, you’re lucky to have Elder Brother Zhao take a fancy to you. When it happened to me, I didn’t like either, but things are fine now. Just give in, and everything will be fine.” The coquettish woman did nothing as the young man named Zhao rubbed his hands across her body. She laughed.</p><br/><p>“I don’t want to make it hard on you,” said Zhao, the fire in his eyes growing stronger. “I just want your cherry. I have a Foundation Establishment Pill that I can offer in trade. It’s a fair price, but you just keep refusing me. You can’t blame me for taking it by force.” He lifted a finger on his right hand.</p><br/><p>The finger sent a stiff breeze flowing. It rushed past Xu Qing, causing her robes to lift up and reveal quite a bit of skin. Xu Qing trembled a bit, and some blood seeped out of the corners of her mouth. And yet, she just clenched her jaw and kept moving forward.</p><br/><p>The young man named Zhao just laughed a few times. His eyes burned as he lifted his hand again.</p><br/>\n</div>"}