{"title": "Chapter 140: Dont You Know the Rules?", "id": 140, "volume": 2, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-140-dont-you-know-the-rules", "volume_title": "Volume 2", "body": "<h1>Chapter 140: Dont You Know the Rules?</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 140: Don’t You Know the Rules?</strong></p><br/><p>Meng Hao approached the mansion, lifted his hand, and knocked three times on the door. The door open inwardly without a noise. Inside, everything was pitch black. There seemed to be some kind of black-colored shield in place.</p><br/><p>Looking at it, Meng Hao could see magical ripples on its surface, but nothing that indicated it would attack him. It was simply designed to control which Cultivators could enter. Meng Hao observed it for a moment, thinking back to the several people who had arrived before him. He quickly understood.</p><br/><p>“This prevents anyone other than Foundation Establishment Cultivators from entering.” His face calm but covered by the bamboo hat, he strode forward into the shield.</p><br/><p>Within the space of a few breaths, a soft glow appeared, shining into his eyes. He now stood outside of what appeared to be the palace of a mortal prince.</p><br/><p>The palace was grand and imposing, like some enormous creature lying prone on the earth. It had a very solemn air to it. Outside the palace stood an old man wearing a Daoist robe. His expression was placid, and his Cultivation Base was at the late Foundation Establishment stage. When he saw Meng Hao, he approached, eyes shining.</p><br/><p>He looked Meng Hao over and then quietly said, “Please produce your invitation slip, Fellow Daoist. If you have no invitation slip, then your Sect identification medallion will do.”</p><br/><p>Meng Hao’s eyes flickered beneath his bamboo hat. Without a word, he waved his hand and a medallion flew forward to land in the old man’s hand. The old man looked at it, and suddenly a look of respect appeared in his eyes. He handed the medallion back with two hands.</p><br/><p>“So, you’re from the Violet…”</p><br/><p>Meng Hao coughed, and the old man stopped talking. Without another word, he stepped back with a slight bow, allowing Meng Hao to continue.</p><br/><p>Meng Hao took the medallion back and strode past the old man into the palace. The medallion was the same one he had taken from Ding Xin. This was his second time going under an assumed name, and he was a bit more used to it this time. [1. If you forgot the first time Meng Hao impersonated Ding Xin, you can read about it in Chapter 69：Young Lord Ding]</p><br/><p>He knew that this place would be a jumble of dragons and fish, quite chaotic. If they were really strictly checking the identities of the participants, then how could it be called a secret meeting? Having observed the outside for some time to analyze the situation, he now felt calm and unhurried.</p><br/><p>Upon entering the palace, he saw ornamental rock displays and streams over which arched dark green, wooden bridges. Not too far away was a pavilion, surrounded by musicians playing stringed instruments. The sound they produced was remarkable. Seven people were seated within the pavilion. Most of them maintained quite a bit of space from the others. As could be expected, they sat silently, sizing each other up.</p><br/><p>When Meng Hao entered, their gazes all came to rest on him.</p><br/><p>Three of the seven people wore masks. One of them was Lu Tao, who was sitting there frowning. His gaze passed over Meng Hao briefly.</p><br/><p>Two others had not covered their faces. One was a woman who looked like a lady, and appeared to be about thirty years old. She wore splendid garments, and was quite good looking. She had an alluring look in her eyes that exuded charm. She looked at Meng Hao for a moment, then smiled and nodded.</p><br/><p>Last, was a middle-aged man wearing a long, yellow robe. A lonely expression covered his face, and he held a flagon of alcohol in hand, which he constantly drank from. He gave Meng Hao a quick glance with eyes heavy from alcohol.</p><br/><p>The features of the four others present were all concealed by masks. It wasn’t even possible to tell if they were men or women.</p><br/><p>Without batting an eyelid, Meng Hao entered the pavilion and selected a table to sit at. Looking around, he saw that there were only nine tables within the pavilion. Including his, eight of them were now occupied.</p><br/><p>Obviously, the final table was reserved for the host, and not any other Cultivator.</p><br/><p>After some time passed, a large man entered the palace from outside. He was at the mid Foundation Establishment stage. He was big and tall, so much so that it would have been useless for him to try to conceal his identity. He strode into the pavilion, cold and haughty.</p><br/><p>As soon as he entered, he stopped in his tracks. His brow furrowed as he looked around.</p><br/><p>“This is not the first time I, Xu, have joined this secret meeting,” he said coolly. “Today I came with an invitation, and yet, there’s no place for me. Which of you Fellow Daoists doesn’t understand the rules?” He smacked his bag of holding, and instantly a blue-colored jade slip appeared. Its surface was inscribed with a character: “Secret.”</p><br/><p>The jade slip glowed softly. With a smile, the young lady lifted her delicate hand to reveal her own jade slip, which she placed on the table in front of her.</p><br/><p>Next Lu Tao followed suit, along with some of the others. Soon, only Meng Hao and one of the other disguised Cultivators had not produced a jade slip.</p><br/><p>One of the other two was emanating the power of the late Foundation Establishment stage. This person sat there calmly, completely ignoring the large man. Not daring to say anything, the large man’s eyes came to rest on Meng Hao and the other person. Both of them were only at the Early Foundation Establishment stage. The large man’s eyes glittered coldly.</p><br/><p>“You two. If you can’t show me a jade slip, then you can just get the hell out of here. Give me a seat. If you don’t, then you won’t be leaving this place alive.” His voice was filled with killing intent, which transformed into a coldness that filled the area. The rest of the people in the pavilion continued to look on with various expressions. None of them seemed willing to interfere; apparently they had no qualms whatsoever about observing a magical battle to the death.</p><br/><p>Meng Hao said nothing, and neither did the other disguised person.</p><br/><p>Everything was quiet within the pavilion.</p><br/><p>The large man surnamed Xu snorted, and then strode, not toward Meng Hao, but to the other person, who happened to be a bit closer to where he stood.</p><br/><p>His eyes shining brightly, he was about to raise his right hand when suddenly, a light cough could be heard. It echoed throughout the pavilion, and as it did, everyone inside, including the hulking Xu, turned their heads.</p><br/><p>An old man wearing a long, yellow robe entered. His face was placid, and his body seemed to be somewhere in-between illusory and real. He didn’t seem to be moving quickly, yet within three or four steps was already inside the pavilion.</p><br/><p>“Salutations, Fellow Daoist Qingshan.”</p><br/><p>“Greetings, Fellow Daoist Qingshan.” The instant the old man appeared, everyone with the exception of Meng Hao, instantly stood up. Meng Hao’s expression flickered, and then he, too, stood and clasped hands in salute to the old man.</p><br/><p>“There’s no need to be so formal,” said the old man coolly. “All of you are heroes of the current generation in the Southern Domain. I am merely here to host this secret meeting. Please proceed.” He sat down at the ninth table and looked at the assembled people, his eyes bright and shining. Finally, they came to rest on the large fellow surnamed Xu.</p><br/><p>Being gazed upon by the old man caused him to lower his head respectfully. Meng Hao did the same. This old man was a Foundation Establishment Cultivator, but was clearly beyond the late Foundation Establishment stage. He was halfway to entering Core Formation, so he would be classified as a Pseudo Core Cultivator.</p><br/><p>A person like this in the State of Zhao would have a position higher than Grand Elder. His presence made Meng Hao a little bit nervous, but also led to some guesses about the whole thing.</p><br/><p>“Fellow Daoist Qingshan,” said the hulking Xu nervously. Bracing himself, he said, “I invite you to take charge of justice. I bear an invitation, and yet someone here has stolen my position.” He clasped hands and gave a deep, respectful bow.</p><br/><p>“Who stole your position?” asked the old man lightly. His gaze was like lightning as it casually fell onto Meng Hao.</p><br/><p>“This person!” cried the hulking Xu, raising his hand and pointing at the other disguised Cultivator.</p><br/><p>That cultivator gave a cold harrumph. From the clear ring of the voice, it was obviously a woman.</p><br/><p>“That is my personal guest,” said the old man, speaking neither fast nor slow, as if the affairs of these Cultivators was beneath his interest. “She could not have stolen your position.”</p><br/><p>Hearing this, the hulking Xu gaped for a moment. But then, his gaze swept over to Meng Hao. A cold light appeared in his eyes. Since one of the two people was invited, that left only one without a jade slip. This must be the person who stole his seat.</p><br/><p>Everyone was now looking at Meng Hao, even the woman who had just humphed coldly. She looked over at Meng Hao with icy eyes.</p><br/><p>Beneath his wide, bamboo hat, Meng Hao’s expression was the same as always.</p><br/><p>“Anyone who comes to this place has the qualifications to attend the meeting,” said the old man placidly. “However, if you do not have an invitation slip, then you must wait outside the pavilion. When the time comes to conduct business, you may only place bids if everyone inside the pavilion has renounced claim.”</p><br/><p>“So, it was you who stole my place,” said Xu. “You don’t know the difference between life and death! There’s no need to get up. If I don’t tear you to pieces today, then I’ll become a laughingstock.” Xu had an irritable personality to begin with. Having his seat taken away in front of everyone had long since stoked his killing intent. His body flashed as the power of the mid Foundation Establishment stage exploded out of him. He charged directly toward Meng Hao.</p><br/><p>No one moved to interfere. Even the old man just watched coolly.</p><br/><p>When he was about three meters away from Meng Hao, he lifted his hand, causing a massive magical palm to appear and descend toward Meng Hao. Meng Hao sat there just as before. He simply lifted his left hand and waved a finger toward the hulking man.</p><br/><p>When he waved his finger, the spiritual energy of heaven and earth within the entire palace was thrown into chaos. At the same time, the hulking man’s expression changed. He suddenly felt as if he had lost control of his Cultivation base, and was now completely suppressed.</p><br/><p>This caused the pupils of the surrounding Cultivators to constrict, including old man Qingshan. Meng Hao’s right hand waved, and instantly, a roaring, three hundred meter long Flame Dragon appeared. Xu screamed as it shot down into his body.</p><br/><p>His entire body shook violently. A look of disbelief and shock covered his face, and then despair. His skin burst into flame. A great wind buffeted him, slamming him into the ground. In the blink of an eye, his stalwart frame was reduced to bits of ash that drifted in the air.</p><br/><p>The only thing left was a bag of holding. It flew up and into Meng Hao’s hand. He patted it lightly, then produced a jade slip upon which was inscribed the character “Secret.” He placed it on the table.</p><br/><p>“Here is my invitation slip,” he said. The others couldn’t see his expression, as it was hidden by the bamboo hat. They could only hear his raspy voice coming out from underneath it.</p><br/>\n</div>"}