{"title": "Chapter 158: Coexist with Ji?!", "id": 158, "volume": 2, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-158-coexist-with-ji", "volume_title": "Volume 2", "body": "<h1>Chapter 158: Coexist with Ji?!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 158: Coexist with Ji?!</strong></p><br/><p>Han Bei took a deep breath, and a look of excitement flashed across her face. She lifted her right hand, and an ancient, crescent-shaped piece of jade flew out. It was a deep green color, almost black, and had a completely extraordinary appearance. It was not an object that a person would normally hold in their hand, but rather something that seemed as if it should be buried deep in an ancient tomb, never to see the light of day. Its color seemed to be the result of absorbing far too much sinister death aura.</p><br/><p>The crescent jade flew out and then shockingly emitted a bright glow which covered everything around. The glow rippled as it shot forward toward the crack on the surface of the massive cauldron, and then entered it.</p><br/><p>“This is where the final two volumes of the Classic of Time are!” said Han Bei. She flew forward, followed by Xie Jie, the Li woman, Xu Youdao and the man in the gray robe.</p><br/><p>Meng Hao proceeded along as well. Six beams of flashing light shot ahead, growing closer and closer to the enormous cauldron. As they grew near, they felt an enormous pressure spreading out from the cauldron, which continued to grow stronger and stronger.</p><br/><p>Soon, they were nearing the gigantic crack, which looked like an enormous canyon on the surface of the cauldron. They came to a stop in front of the crack. A mist floated around within, thin, but all-encompassing. Inside was nothing but blackness.</p><br/><p>Upon nearing the crack, Xie Jie slapped his bag of holding. A green light appeared that solidified into a furry green beast. Its body flashed as it shot directly toward the crack. The instant it touched the mist, however, it let out a miserable cry, and its body was torn to pieces.</p><br/><p>Caution filled the hearts of the onlookers.</p><br/><p>“Only someone with incredible Spiritual Sense can lift the mist and mend this crack,” said Han Bei. “Then we can enter.” She looked up at the sky again as if she were calculating something. Then she turned and looked at Meng Hao.</p><br/><p>It wasn’t just her. Xu Youdao’s gaze fell onto him as well. Meng Hao’s battle with the Li woman, and the intense power of his Spiritual Sense, had left a deep impression on the man.</p><br/><p>“Fellow Daoist Han, you must be joking,” said Meng Hao, somewhat impolitely. “This cauldron must have been cast innumerable years ago. It’s aura is beyond ordinary. I don’t think I can even touch that crack.”</p><br/><p>“Fellow Daoist Meng, you misunderstand,” she said hastily. “Of course I’m aware that this cauldron is not something people with Cultivation bases like ours can touch. I have a family heirloom treasure that can eradicate the crack. However, it must be guided by Spiritual Sense. Doing so will cause the crack to be healed.” As she spoke, she slapped her bag of holding to produce a small fan the size of a palm. It only had three feathers, each of which was covered with magical symbols.</p><br/><p>“Only one person can use the treasure, and your Spiritual Sense is the most powerful among our group. I truly hope to gain your assistance. Once we enter, there will be other areas where you will not be required to do anything. This item is a fan. When its spirit is pushed with Spiritual Sense, it will release a power that far supersedes our Cultivation bases. It is a treasure that the Han Clan specifically forged just for this location.”</p><br/><p>Meng Hao looked calmly at the fan for a moment, and then lifted his hand. The fan flew toward him. He examined it for a moment but didn’t touch it at first.</p><br/><p>Eventually, he gave a slight nod.</p><br/><p>Seeing him agree, Han Bei let out a sigh of relief. She then moved off to the side, away from Meng Hao, in order to prevent any sort of misunderstanding.</p><br/><p>His face was blank as he released his Spiritual Sense. As it emanated out, Han Bei and the others concentrated, sensing the immense power and comparing it to their own. All of them grew even more cautious.</p><br/><p>Meng Hao sent his Spiritual Sense into the fan to examine it. Sure enough, it was branded, linking it to Han Bei. Meng Hao lifted his head up to look at the crack in the enormous cauldron.</p><br/><p>A moment later he lifted his hand and thrust it forward. The fan suddenly erupted into flame. The three feathers began to wriggle in a bizarre fashion. A whirlwind sprung into being around Meng Hao.</p><br/><p>As his hand moved forward, the whirlwind shot toward the mist. A boom echoed out as it slammed into it. The mist immediately began to roil and seethe. At first it seemed as if the two would cancel each other out. However, the whirlwind wasn’t strong enough, and began to fade away.</p><br/><p>“The crack can be erased, but it’s somewhat draining.” Meng Hao watched the mist within the crack restoring itself, as if it were being reborn. He thought for a moment, and then lifted his right hand and released even more Spiritual Sense. This time, he used more than before, causing the flames on the fan to rise up even more awe-inspiringly. Now, the flames were filled with two colors!</p><br/><p>The onlookers’ pupils constricted as they felt the power of Meng Hao’s Spiritual Sense, which seemed to be over double their own. This shocked them to the core, especially Han Bei, whose eyes filled with fear as she watched him.</p><br/><p>It seemed as if the fan were sucking in Meng Hao’s Spiritual Sense as fast as possible. He proceeded with caution; if any signs appeared to indicate that he was losing control, he would instantly sever its connection to his Spiritual Sense.</p><br/><p>The whirlwind appeared again, even more powerful than last time. Within an instant, Meng Hao’s figure was almost impossible to see within its screaming winds. The onlookers could just barely make out the image of him waving his hand forward.</p><br/><p>As he did, the fan’s first feather instantly transformed into burning ash and the second feather began to fall apart. The wind grew stronger, roaring with power. It slammed into the mist, and as it did, the third feather of the fan disappeared into flaming ashes.</p><br/><p>The entire fan now fell apart, causing Han Bei’s heart to melt a bit. Then her gaze hardened; success or failure would occur at this juncture.</p><br/><p>Boom!</p><br/><p>A massive explosion ripped out as the enormous whirlwind collided with the mist. They ate at each other, and suddenly a gap appeared within the mist.</p><br/><p>At the same time, a sinister coldness erupted out from within the cauldron, shooting out through the mist and blasting across the group of Cultivators.</p><br/><p>It was as if a door had just opened which had been closed for ages. An aura that had been sealed up for countless years burst out, flowing across Meng Hao and the others. If that was all, it would not be a big deal. However, within the coldness of Time existed memories that swept across the six people. Suddenly, images appeared in front of them from countless ages ago.</p><br/><p>Within the vision could be seen an enormous, shocking bronze cauldron. It floated above the earth, underneath a red sky. Astonishing bolts of lightning descended onto its surface, slashing it constantly, as if they desired to crush it into nothing.</p><br/><p>However, the cauldron would not give in, and it rose up amidst the roar of the lightning. Up above in the red sky, a vortex appeared, beyond which could barely be made out the image of another world. The cauldron wished to defy the Heavens and pass through the vortex into the vague world beyond.</p><br/><p>Below on the ground were hundreds of thousands of figures. They prostrated themselves on the ground, chanting scriptures at the same time. The sounds of their voices merged together and echoed out. When the sound reached his ears, it made Meng Hao think of the the Black Sieve Sect disciples sitting cross-legged, chanting scriptures. It sounded… similar, even though he couldn’t make out the details of what they were chanting.</p><br/><p>Suddenly a voice boomed out from within the cauldron. “It was thy wish for your expanse to replace the starry sky, to cover my eyes with the dome of Heaven. The World Tree would not submit, and destroyed itself in the starry sky. My master may be sleeping, but can he still exist under the same sky as Ji?!” Lighting fell down constantly from the Heavens, seeking to obliterate the cauldron. Suddenly, the vision passed from the eyes of everyone except for Meng Hao. They exchanged shaken looks with each other.</p><br/><p>Meng Hao was a bit closer to the cauldron, however, and was the first to meet the blast of Time wind. His vision continued on a bit longer.</p><br/><p>He saw the massive bronze cauldron continuing to rise up. The lightning falling from the red sky began to merge together. It was impossible to tell how many lightning bolts congregated to form a gigantic spear. It looked like a tooth surrounded by fields of lightning that shot down toward the cauldron.</p><br/><p>A boom echoed out and the giant bronze cauldron trembled. A massive crack split down through it. It rose no more, and instead fell down. It slammed into the ground, and then another voice sounded out. It seemed to sigh.</p><br/><p>“You are unwilling to let me take this cauldron from this place. Then… I will lay in rest here forever, waiting for the day on which you fall.”</p><br/><p>It was at this point that the vision faded from Meng Hao’s eyes. He took a deep breath and then lifted his head to look at the cauldron. As of now, the mist and the crack caused by it, were disappearing.</p><br/><p>An anxious expression appeared on Han Bei’s face. Not hesitating in the slightest, she shot forward, flying toward the crack. Without a word, the rest of the group followed, their eyes flickering.</p><br/><p>Meng Hao flew along with them as they headed at top speed toward the crack. As soon as he entered the cauldron, Meng Hao felt the copper mirror in his bag of the Cosmos growing hot.</p><br/><p>Now was not the time to examine it, though. Meng Hao entered the cauldron to find himself in a world of lightning and thunder.</p><br/><p>The inside of the cauldron was a space of several tens of thousands of meters in size. It was completely filled with crashing lightning, almost like a river. The light created by so much lightning was as blinding as sunlight.</p><br/><p>However, there was no time for the group to gaze at the world within the cauldron. From within their midst, a blood-curdling scream rose up.</p><br/><p>The Li woman was the last to enter. The instant she did, a bolt of lightning descended with incredible speed. It slammed into her. She screamed as her body was transformed into flying ash. Even her bag of holding was incinerated into nothingness.</p><br/>\n</div>"}