{"title": "Chapter 160: No Meng in the Nine Families", "id": 160, "volume": 2, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-160-no-meng-in-the-nine-families", "volume_title": "Volume 2", "body": "<h1>Chapter 160: No Meng in the Nine Families</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 160: No Meng in the Nine Families</strong></p><br/><p>The outside was an enormous square cauldron, whereas inside there was a Heavenly circular cauldron. This circular cauldron was truly a Heavenly trend!</p><br/><p>Meng Hao’s mind buzzed as he saw this. Having experienced the world of the enormous cauldron, he felt as if it contained something cosmic.</p><br/><p>“Nine kneeling figures, nine pinnacles of the Heavens,” muttered the gray-robed man, beginning to tremble. “These kneeling figures are not people, they obviously are referring to the will of the Heavens!</p><br/><p>“No, no. How could the cauldron be reversed? It shouldn’t be like this. The heavens are circular and the earth is square. That’s a generally acknowledged truth from ancient times. It’s a law that was established tens and tens of thousands of year ago, a principle of heaven and earth.</p><br/><p>“The cauldron should be circular on the outside and square on the inside. That would be correct. In that case, it would be as they say, the Heavens on the outside, above, the earth on the inside, beneath….” The man’s body trembled even harder as he continued to mumble to himself. It seemed as if he just couldn’t comprehend the world of this cauldron which was square on the outside and circular on the inside.</p><br/><p>Xu Youdao stared blankly at the circular cauldron, his eyes radiating astonishment. It was impossible to tell what he was thinking.</p><br/><p>Xie Jie’s eyes narrowed. Despite his shock, he immediately produced a jade slip, within which he inscribed all of this.</p><br/><p>Han Bei seemed to be in shock as well. She looked at the massive fissure on the back of the statue, and then a brilliant glow appeared in her eyes that was obviously veneration for her ancestors.</p><br/><p>“I understand,” said the gray-robed man, his voice quavering. “The heavens are circular, the earth is square. A circular cauldron on the outside becomes the Heavens, the square cauldron on the inside becomes the earth. That would be in accord with the will of the Heavens, but this… This embodies evil! This represents the earth covering the Heavens. This is the same as burying the Heavens!!</p><br/><p>“This way, the circular cauldron is the Heavens, the square cauldron is the earth. This place…. is a tomb!!” Sharp astonishment filled his voice as he spoke. He slowly took three steps backward. He coughed up a mouthful of blood. His face was pale and his eyes shone brightly with astonishment. His hands flickered as if he were calculating something, and his voice began to grow louder.</p><br/><p>“These nine worshippers are definitely pinnacles of the Heavens! They’ve just been embodied into these statues, which obviously represent the legendary Nine Mystical Stars. The Nine Mystical Stars are worshiping the cauldron. The Heavenly trend is solidified here. A bronze square cauldron, within which is buried the heart of the Heavens!</p><br/><p>“How daring! How grand! A tomb in which the Heavens are buried inside the earth!! Just whose tomb is this? Willing to face death to steal good fortune from the Heavens! This is a coffin, and the Blessed Land outside is the tomb!</p><br/><p>“Put it all together, and this place is no Blessed Land. It’s a Cursed Land! It’s a tomb of defiance against the Heavens!”</p><br/><p>His words entered the ears of the others, and turned cold. Xie Jie's and Xu Youdao’s expressions changed. Meng Hao took in a deep breath to settle his shaking nerves. The gray-robed man’s words resonated inside of him, creating a sense of familiarity. Perhaps this place… really was a tomb.</p><br/><p>He thought back to the vision he had experienced outside of the cauldron, and of the man’s voice he had heard when the lightning struck it.</p><br/><p>“You are unwilling to let me take this cauldron from here. Then… I will lay in rest here forever, waiting for the day on which you fall.”</p><br/><p>Meng Hao took a deep breath and thought back to the other archaic voice he had heard from within the cauldron.</p><br/><p>“It was thy wish for your expanse to replace the starry sky, to cover my eyes with the dome of Heaven. The World Tree would not submit, and destroyed itself in the starry sky. My master may be sleeping, but can he still exist under the same sky as Ji?!?!”</p><br/><p>The voice seemed to echo in Meng Hao’s mind. His heart beat rapidly, and he thought back to the legend of the Spring and Autumn tree [1. If you want to a refresher on the legend of the Spring and Autumn tree, check out Chapter 109: The Legend of Doom], and how the World Tree had voluntary destroyed itself rather than acquiesce to the Heavens. He also thought of the destruction of the Ancient Doom Clan [2. If you want to review the Doom Clan info, check out chapter 19 (link above) and Chapter 128: Li Daoyi’s Sixth Matrix], as well as the flag of three streamers [3. If you forgot about the flag of three streamers, and the Ji information, check out Chapter 137: 10th Patriarch of the Wang Clan ], which was currently inside the Blood Immortal mask. That flag had the character Ji written on it!</p><br/><p>He also thought back to the requirement of the Blood Immortal to refine the bloodline of Ji!</p><br/><p>“Fellow Daoists,” said Han Bei, “there’s no need to be alarmed.” Her clear, bell-like voice echoed out. Although it couldn’t outmatch the sound of the thunder, everyone could hear her clearly. “I don’t know whether or not this place is a tomb, but as you all can see, the person holding those ancient scrolls is my ancestor. The statue has been cracked open by Heavenly Thunder. That was how the first volume of the Classic of Time came out of this place, and was eventually acquired by later generations.” She turned to look at Meng Hao and the others. “In fact, of all the treasures here, only these scriptures can be taken away. All the other statues are perfect and unharmed.</p><br/><p>“I’ve attended quite a few secret meetings; the fact that you all saw my message shows that you are destined to be here. You all have your own reasons for coming here, and are surely backed by powerful forces. Naturally, I am aware of that, and really don’t care who you represent.” She continued in a soft voice, “I only hope that for the sake of the Nine Mystical Stars, you will all keep your promises. Right now, we can only look, but when we draw near to the statues, I have a way to acquire the two scriptures. Then we can make copies for everyone.</p><br/><p>“Actually, my only real purpose in coming here is to pay my respects in front of the statue of my ancestor.” Her voice seemed to contain some strange power that made everyone calmer. The gray-robed man’s complexion slowly returned to normal. Now that Meng Hao thought about it, he began to wonder if the man had purposefully said such crazy things.</p><br/><p>He was also a bit skeptical of Han Bei’s words “for the sake of the Nine Mystical Stars.”</p><br/><p>“It’s not far now,” continued Han Bei. “However, next I must ask for help from Fellow Daoists Xu and Sima. There will be more lightning after this point, and the going will be more difficult. Originally, we should never have had the chance we do. But the year that the first volume of the classic flew out, it carved out a path. Inside the path, we will be much safer. More importantly, the power of the lightning will not be as strong.</p><br/><p>“Furthermore, it will have intermittent periods of weakness. Those times will be short, only about one hour. However, it should be plenty of time to get through safely. I picked the starting time of our mission to coincide with the lightning’s weak period!” Her gaze swept across them, and then she looked up, as if she were waiting for something.</p><br/><p>After about ten breaths, the lightning in the area began to grow dimmer. It was still dense, but the pressure that bore down on them from it was significantly less. It was definitely not as fearsome as before.</p><br/><p>“The lightning will be weak for one hour. Fellow Daoist Xu, Fellow Daoist Sima, hurry!” Her eyes shined as she lifted her right hand. A dark piece of ancient jade flew out and floated above them, seeming to point in a certain direction.</p><br/><p>Muttering to himself, Xu Youdao flew forward. The gray-robed Cultivator seemed to have completely returned to normal. He accompanied Xu Youdao. The power of late Foundation Establishment roiled out from them. One of them was clearly emanating Wood-type Qi. But then the gray-robed Cultivator began to emit a Dust-type Qi, which completely eclipsed the Wood-type Qi. As they walked forward, a yellowish brown glow rippled out.</p><br/><p>Both of them produced magical items, and Han Bei took in a deep breath. She waved her hand, and her ancient Time jade emitted a brilliant glow. Everyone proceeded cautiously.</p><br/><p>Because of the temporary reduction in lightning, they were able to fly forward relatively quickly.</p><br/><p>However, the closer they got to the statues, the more dense the lightning grew. Rumbling booms filled the sky. Lightning crashed down, some of it slamming into the ground very close to the group of five. Their hearts trembled as they proceeded.</p><br/><p>Xu Youdao and the gray-robed Cultivator proceeded together with seeming difficulty. Soon, cracks appeared on their treasured items. Without hesitation, they pulled out even more lightning-repelling items. Meng Hao’s expression was the same as ever, and he said nothing. He made no indication whatsoever that he would offer assistance. He had already accomplished his task, and from here on out, they would not likely be asking him to do anything.</p><br/><p>This place was dangerous, but all of the others had chosen to come here and were well-equipped.</p><br/><p>Within Meng Hao’s hand was the good luck charm. That was the trick he had up his sleeve.</p><br/><p>Time passed slowly, and gradually the group grew closer and closer to the statues. The faces of Xu Youdao and the gray-robed Cultivator grew ashen. They were reaching their limit. As the statues got closer and closer, the lightning grew more and more dense. They had already gone through multiple magical items, and were coughing up blood. They couldn’t proceed.</p><br/><p>Suddenly, a lightning bolt began to descend, heading directly toward their group. Seeing this, the faces of Xu Youdao and the others flickered. The ancient Time jade that Han Bei wielded suddenly emitted a bright shield. When the lightning bolt slammed into the shield, a massive explosion rippled out. Han Bei coughed up a mouthful of blood, as did all of the others. The glow of electricity surrounded them, and their faces drained of blood. This was especially true of Xu Youdao and the gray-robed man, whose bodies trembled.</p><br/><p>The lightning dissipated into curving sparks of electricity, and everyone heaved sighs of relief. They looked about, their faces filled with even more caution than before.</p><br/><p>“Fellow Daoist Han,” said Xu Youdao, turning to stare at Han Bei. “Didn’t you say that the lightning would become weaker? Why was that bolt now so powerful?!”</p><br/><p>Meng Hao wiped the blood from his mouth, but his eyes were shining. The fragments of lightning within his body were being sucked in by the lightning flag. It seemed to be changing again.</p><br/><p>Actually, though he looked injured, after coughing up the blood, he was fine. However, he continued to force his face to look pale.</p><br/><p>Wiping the blood from her mouth, Han Bei coldly replied, “You all chose to come here. There is no way you were unaware that this place is not suitable for Foundation Establishment Cultivators. Were it not for my understanding of this place, were it not for this ancient Time jade, were it not for some other things that we all know about, then we wouldn’t be walking through this place. We would not even have been able to enter the cauldron.</p><br/><p>“As far as the lightning, it is weakened at the moment. However, there still exists the possibility that bolts will fall that have not been weakened.” She turned to Xie Jie. “Elder Brother Xie, having come this far, we’ve now reached the point where you must act. This location also holds what the Black Sieve Sect seeks, which they plan to fish out with the Hundred Spirits Tower. They seem to be ignoring our activities in here, but undoubtedly they are keeping guard outside.</p><br/><p>“We both know that they don’t dare to enter this place. Other than descendants of the Nine Great Families, anyone who enters here will die. The Nine Great Families have experienced decline in the Southern Domain, to the extent that they can’t measure up to the current generation of Clans, and are mostly comprised of mortals. Ones who can practice Cultivation are usually herded up by various Sects. We have the appearance of elegance, but in fact we are little more than livestock. You and I are simply curious tools to the Black Sieve Sect.”</p><br/><p>Xie Jie was quiet for a moment, an then smiled. “Actually, what makes me the most curious is that the Nine Great Families do not include Meng. Furthermore, not one of these nine statues resembles Fellow Daoist Meng at all. So, how was he able to enter this place?” He gave Meng Hao a deeply meaningful look.</p><br/><p>-----</p><br/><p><em>This chapter was sponsored by Hein Haugeberg</em></p><br/>\n</div>"}