{"title": "Chapter 168: The Xiao Clan Gifts the Lake", "id": 168, "volume": 2, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-168-the-xiao-clan-gifts-the-lake", "volume_title": "Volume 2", "body": "<h1>Chapter 168: The Xiao Clan Gifts the Lake</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 168: The Xiao Clan Gifts the Lake</strong></p><br/><p>“You know, that’s wrong. That’s immoral. You can’t just throw things onto the ground. What if you hit a little kid? That would be a sin. Even if you didn’t hit a little kid, you might hit one of the fish in the lake, or maybe some shrimp. That would also be wrong. Listen. You should carefully take me off. You should….” The hat continued to talk non-stop with its preaching.</p><br/><p>Meng Hao frowned, and Xu Luodi stared in amazement. His surrounding Clansmen looked at Meng Hao’s hat in disbelief. After a moment, Xu Luodi’s face grew grim. He was getting the feeling that this early Foundation Establishment Cultivator was doing this on purpose.</p><br/><p>“Enough!” said Xu Luodi. “This isn’t a place where you can just come and go as you please. If you won’t tell the truth, then I’ll just grab you and force the truth out of you.” He couldn’t figure out whether or not this guy was here to help the Xiao Clan or not, but at the moment, Meng Hao was being very annoying. More importantly, Meng Hao’s Cultivation base was only at the early Foundation Establishment stage. He would be able to determine his purpose in coming here after capturing him.</p><br/><p>Before he even finished speaking, Xu Luodi walked forward. He lifted his right hand, and a dark red glow appeared, which coalesced into a red whip. The whip emitted cracking sounds as it screamed through the air and flicked back and forth. At the very end of the whip, a ferocious, fork-tongued snake head appeared. It shot directly toward Meng Hao.</p><br/><p>As Xu Luodi made his move, the members of the Xu Clan behind him all looked incredibly excited. Whenever the Clan Lord attacked, he achieved victory; that was what they had seen in their experience. They couldn’t wait to see their Clan Lord mop the floor with an early Foundation Establishment Cultivator.</p><br/><p>Meng Hao gave Xu Luodi a cool look. During his time protecting Xu Qing in the Black Sieve Sect’s Blessed Land, he had encountered many such Cultivators. He lifted his hand, which was holding a dark reddish fruit. He threw it toward the ground.</p><br/><p>As soon as the fruit hit the ground, it burrowed down. Instantly, the ground began to shake. Even as the dark red whip neared Meng Hao, a boom filled the air. The ground in front of Meng Hao erupted as a mass of dark red vines shot out. They rose a dozen or more meters into the air, emanating rippling power that matched that of the mid Foundation Establishment stage. The instant they appeared, they shot toward the whip.</p><br/><p>An explosion resonated out. The whip couldn’t withstand even one blow, and it collapsed into pieces. The ferocious vines opened their wide mouths and shot toward Xu Luodi.</p><br/><p>His face fell, and the Clan members behind him looked on in disbelief, even more astonished than him. He cried out in alarm as he saw the more than ten vines approaching. His eyes narrowed, and he suddenly pressed down on the pit of his stomach. He spat up a large mouthful of blood, which then transformed into a mist. The mist coalesced into a blood-colored head, which then slammed into the vines.</p><br/><p>An explosion echoed out, and the blood drained from Xu Luodi’s face. He staggered back several paces into his pale-faced Clansmen, who all coughed up mouthfuls of blood.</p><br/><p>“A Shaman Cultivator!” gasped Xu Luodi, retreating backward again.</p><br/><p>He wasn’t the only one to have such a reaction. Xiao Chang’en’s eyes suddenly went wide. The faces of the surrounded Xiao Clan members flickered. The young woman next to Xiao Chang’en began to breathe rapidly.</p><br/><p>“Even if you’re a Shaman Cultivator, your Spirit minion is only at the mid Foundation Establishment stage….” His eyes filled with killing intent. He was deeply aware that when dealing with Shaman Cultivators, the most important thing was their Spirit minion. Such Cultivators had weak bodies, and they feared decapitation. However, before he was able to complete his sentence, he stopped speaking, as if something had clamped down on his jaw.</p><br/><p>Up ahead of him, more earth showered up as another vine appeared. This vine was violet-colored, and twice as thick as the other vines. The instant it appeared, it emanated the power of the late Foundation Establishment stage.</p><br/><p>The vine wasn’t originally like this; however, because Meng Hao had branded it with his blood, it had mutated, and now had a trunk which had the strength of late Foundation Establishment.</p><br/><p>“Screw off!” said Meng Hao coolly. His expression didn’t change, and in fact, he wasn’t worried inwardly either. He had just escaped from the hands of Nascent Soul Cultivators in the Blessed land, so as far as he was concerned, even late Foundation Establishment stage Cultivators were too trivial to mention.</p><br/><p>Hearing his words, Xiao Chang’en’s face flickered, and he felt anxiety. He had been about to speak, but seeing Meng Hao’s smirk made him temporarily speechless.</p><br/><p>Xu Luodi’s expression flickered, and then he spun around. With the flick of a sleeve, he shot off into the distance with his Clansmen. His eyes were filled with venomous hatred. The object of his resentment, however, was not really Meng Hao, but the Xiao Clan. He was now convinced that Meng Hao had been called by the Xiao Clan to provide assistance.</p><br/><p>Meng Hao watched with the same expression as ever as Xu Luodi left. He didn’t call back the vines, either. He looked at Xiao Chang’en with the same smirk as before.</p><br/><p>“Fellow Daoist,” said Xiao Chang’en, “many thanks for your assistance. I, Xiao, was also pushed into a corner. Please accept my apology for causing you any trouble….” He clasped hands and bowed deeply to Meng Hao.</p><br/><p>Honest people don’t need to speak with hidden words. Xiao Chang’en spoke very directly, causing a smile to break out on Meng Hao’s face. Even though he wasn’t sure of all the details of the situation he had stepped into, he had picked up on some clues, especially the excitement that had appeared earlier on Xiao Chang’en’s face. Meng Hao could see clearly that he had been used to put some pressure on the Xu Clan.</p><br/><p>That was why he hadn’t killed anyone, but rather let Xu Luodi escape. This caused Xiao Chang’en to hesitate. Xu Luodi had left in a rage, angry not at Meng Hao, but at the Xiao Clan.</p><br/><p>Even though he was being used, he helped. He fixed the problem for the moment, but sooner or later, the Xu Clan would return. If Meng Hao was gone at that time, then Xiao Chang’en would have to pay the price. That price wouldn’t merely be a daughter and a lake.</p><br/><p>Xiao Chang’en laughed bitterly, and then bowed again to Meng Hao. Next to him, the young woman was silent, then seemed to come to a realization. She joined Xiao Chang’en in bowing toward Meng Hao.</p><br/><p>“Many thanks, benefactor,” she said, her voice crisp and melodious.</p><br/><p>At the moment, everything was quiet, except for the voice of the hat on Meng Hao’s head. “…. and then you should lightly pick me up. You mustn’t trample me underfoot.” Actually, the voice hadn’t stopped speaking this entire time. The word poured out in a steady flow.</p><br/><p>Meng Hao frowned.</p><br/><p>“Fellow Daoist, please forgive me,” said Xiao Chang’en. “I don’t care if the Xu Clan covets my Spirit lake, or even if they bully me because of my declining longevity. But they want to swallow up my entire Clan. Ai….” A bitter look appeared on his face. Suddenly he began to cough violently. The young woman stepped forward, her face covered with anxiety.</p><br/><p>Meng Hao looked at Xiao Chang’en, and the thick death aura which emanated from him.</p><br/><p>“What is this place?” he asked coolly.</p><br/><p>“Sir,” said the young woman, “we are on the border between the Blood Demon Sect and the Solitary Sword Sect.” Her voice was light, but her expression filled with nervousness as she looked at Meng Hao.</p><br/><p>Having heard this, Meng Hao slapped his bag of holding and retrieved a jade slip. He examined it for a moment, confirming his position with a frown. Xiao Chang’en continued to eye him and the ferocious vines that surrounded him. He gritted his teeth.</p><br/><p>“Fellow Daoist,” he said, “I would like to give you this Spirit lake as a gift!” All of the Xiao Clan members, except for the young woman, stared in shock.</p><br/><p>Meng Hao lifted his head and looked at Xiao Chang’en. He didn’t express any opinion whatsoever, nor did he speak.</p><br/><p>“I myself used to be a disciple of the Blood Demon Sect,” said Xiao Chang’en. “But I was injured, barely escaping with my life. My Cultivation base is incapable of advancement, and my longevity cannot be increased. I’m afraid I only have a few years of life left.</p><br/><p>“This Spirit lake was passed down to me from a member of the senior generation before he died. It’s become the only way to grow the Xiao Clan. However, more and more people have been casting eyes upon it lately. I’m not sure how to keep it within the Clan. The Spiritual energy in the lake might not seem very abundant, but it’s actually very beneficial for Spirit minions. Doing breathing exercises in this area is very good for them.</p><br/><p>“Fellow Daoist, please accept the lake.” His words were sincere. Although his heart was filled with bitterness, he couldn’t think of any other option than this. His relationship with the Blood Demon Sect had been severed, and he couldn’t participate in any of the struggles and fighting that went on amongst the Clans founded by former Blood Demon Sect disciples.</p><br/><p>His only option was this early Foundation Establishment Cultivator in front of him, who happened to have a Spirit minion at the late Foundation Establishment stage.</p><br/><p>“Furthermore,” continued Xiao Chang’en, “there has been friction lately between the Blood Demon Sect and the Solitary Sword Sect. Occasionally great battles erupt, but this place isn’t a battlefield, and with the exception of occasional disturbances from other local Clans, no one pays much attention to it….” He chose his words carefully as he tried to persuade Meng Hao to stay. Meng Hao smiled, and his eyes glittered.</p><br/><p>Although it wasn’t really what he had wanted, he ended up with the object the Black Sieve Sect had been seeking in the Blessed Land. He had no doubt aroused the ire of the Sect, and though they wouldn’t announce it publicly, they would no doubt be searching for him.</p><br/><p>“I wonder if Elder Sister Xu will be implicated…” he thought to himself. “I don’t think that's very likely.” Right now, his highest priority was to improve his Cultivation base. He needed to form his fourth Dao Pillar. That, coupled with his Perfect Foundation, would enable to him to stand toe-to-toe with Dao Children from the five Sects and three Clans.</p><br/><p>At that time, he would be above any Chosen, and would actually be in the top ten most powerful people in the Foundation Establishment stage in the Southern Domain. After he formed six Dao Pillars, he was confident that he could destroy any of the so-called Dao Children.</p><br/><p>“Unfortunately, now that I have a Perfect Foundation, I have no way to absorb the spiritual power of heaven and earth. Even if I could find a way to force the absorption process, it would still be just too difficult…. The only thing I can do is use medicinal pills. But that won’t work for long.” Meng Hao sighed inwardly. A Perfect Foundation was strong, but had its setbacks. That having been said, if he had to make his choice again, he would still chose the Perfect Foundation.</p><br/><p>“What if I can reach late Foundation Establishment…” he thought, his eyes shining with a barely detectable glow. He looked at Xiao Chang’en for a long moment, and then nodded.</p><br/><p>“We can talk about the lake later,” said Meng Hao coolly. “I’ll stay here for a few days in secluded meditation. Please don’t disturb me. Furthermore, please bring me all of the Spirit Stones you have in your clan.</p><br/><p>Xiao Chang’en spirits seemed to lift at first, and then a bitter smile covered his face. He gritted his teeth and nodded in agreement.</p><br/>\n</div>"}