{"title": "Chapter 174: Perfect Mid Foundation Establishment!", "id": 174, "volume": 2, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-174-perfect-mid-foundation-establishment", "volume_title": "Volume 2", "body": "<h1>Chapter 174: Perfect Mid Foundation Establishment!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 174: Perfect Mid Foundation Establishment!</strong></p><br/><p>Moonlight shone over the savage scene. It wasn’t just Xiao Chang’en whose heart was filled with icy dread; the rest of the Xiao Clan members looked at Meng Hao, terrified.</p><br/><p>The other surrounding Cultivators retreated as quickly as possible, knowing that the slightest hesitation could result in a horrifying death. However, Meng Hao was faster. He looked like a specter, his hair floating around his head as he pursued his quarry. He sucked in a Cultivation base and life force, then loosened his grip, dropping the shrivelled, trembling skeletal body to the ground.</p><br/><p>It wasn’t as if none of the Cultivators tried to fight back; unfortunately, their resistance was futile. To Meng Hao, they were like nothing. Even before the emergence of his fourth Dao Pillar, Meng Hao could easily battle the late Foundation Establishment stage. Now that his fourth Dao Pillar was almost complete, he was on the very threshold of the mid Foundation Establishment stage.</p><br/><p>What could these outcasts from the Blood Demon Sect possibly do to resist him?!</p><br/><p>It was their doom to be here today, a deadly choice on their part. They had chosen to destroy the lightning mist, and in doing so, had unleashed the spirit of death!</p><br/><p>Meng Hao was more than half recovered now. His hair was no longer white, nor was his skin withered. Everything that his Dao Pillar had sucked away from him was now restored.</p><br/><p>His fourth Dao Pillar emanated a demonic aura, as if it desired to plunder and consume all spiritual power!</p><br/><p>I am cut off from heaven and earth, so I will take it upon myself to plunder! This potency is Perfection!</p><br/><p>Boom!</p><br/><p>Meng Hao closed in on two early Foundation Establishment Cultivators. They turned around, roaring as they unleashed the full power of the might of their Cultivation bases. They used magical arts, they used magical treasures, going all out against Meng Hao.</p><br/><p>A booming echoed out, and then Meng Hao was standing directly in front of one of them. His palm pushed lightly against the man’s face. A dessicated corpse dropped to the ground.</p><br/><p>His body flickered; another miserable cry echoed out. Everyone who remained alive trembled as they watched a middle-aged man grow old. His hair became white and then fell out. His flesh and blood wilted away. His eyes clouded over as he took one last breath and then passed into death.</p><br/><p>Meng Hao sighed. He had no deep grudge against these people. However, they had appeared here and had attacked him with the intention of wiping him out and preventing him from making a breakthrough in his Cultivation. Although they were targeting him because of the Xiao Clan, the fact was: they were here. To suddenly be facing Meng Hao, was simply their fate.</p><br/><p>Meng Hao understood; his eyes flashed with enlightenment, and he continued to attack without hesitation.</p><br/><p>He sucked away the life force and Cultivation base of an old man of the mid Foundation Establishment stage, whereupon a loud roaring filled his body. It emanated out, filling the air, causing everyone to look on in shock.</p><br/><p>The fleeing Cultivators trembled in dread. Everything that was happening was like a horrible dream, a nightmare which they would never be able to forget for the rest of their lives.</p><br/><p>The image of Meng Hao had been branded indelibly onto their very souls, and would stay with them until their deaths.</p><br/><p>As the boom rang out, a tremor ran through Meng Hao’s body. He suddenly began to emit a golden light. It spread out, causing Meng Hao to appear as if he were covered with golden armor!</p><br/><p>At the same time, the fourth Dao Pillar appeared in full; the roaring was coming from the Dao Pillar itself. Up above in the sky, dark clouds began to congeal. It seemed as if within them, an invisible pair of eyes was staring down onto Meng Hao.</p><br/><p>A feeling like that of Tribulation Lightning suddenly appeared. It disappeared almost immediately, as if it were simply observing, waiting until Core Formation to unleash its destructive punishment!</p><br/><p>Though there was no wind, Meng Hao’s hair whipped about his head wildly. With the appearance of his fourth Dao Pillar, he had now broken through to the mid level of Foundation Establishment!</p><br/><p>With the power of the Perfect Foundation, Meng Hao was now the most powerful person of the Foundation Establishment stage among the five Sects and three Clans of the Southern Domain!</p><br/><p>The moment he broke through, the blood drained from the faces of the surrounding Cultivators, and their bodies trembled. The Dao Pillars within their bodies suddenly began to quiver. In fact, cracks appeared on the Dao Pillars of some of the Cultivators, causing them to cough up blood, faces filled with astonishment.</p><br/><p>It seemed like their Dao Pillars were ashamed to be in the presence of Meng Hao’s Perfect Dao Pillars. With his Perfect Foundation, he was a sovereign among the Foundation Establishment stage. His incredible might and power caused the hearts of all other Foundation Cultivators to tremble, and their Dao Pillars to become unstable.</p><br/><p>In fact, because of the influence of Meng Hao’s Dao Pillars, the trembling Cultivators began to prostrate themselves toward him. This was not their idea; it was veneration toward their sovereign from the Dao Pillars themselves!</p><br/><p>Their bodies were not even under their own control as they lowered their heads. Their minds were filled with roaring emptiness.</p><br/><p>This was true crushing pressure; this was a power that had reached such a level that it created a relationship like that between heaven and earth.</p><br/><p>In the Cultivation world, a crushing pressure is a power that exists because of the vast difference between different Cultivation levels. However, this crushing pressure emanating from Meng Hao came from the Dao Pillar itself!</p><br/><p>Perfect Dao Pillars can exhibit crushing pressure onto all other Dao Pillars. If a Cultivator who had completed the circle of Foundation Establishment had merely Fractured Dao Pillars, he could do nothing but tremble in front of Meng Hao.</p><br/><p>This… this was the power of four Perfect Dao Pillars. It would be hard to imagine the power Meng Hao could wield after he created his fifth, sixth, and even ninth Dao Pillars! What crushing pressure would he then be able to employ?!</p><br/><p>At that time, it wouldn’t matter if he faced a Cracked Foundation or even a Flawless Foundation; they would all be as weak as ants to Meng Hao. After completing nine Perfect Dao Pillars, then perhaps Meng Hao would be able to pass into Core Formation!</p><br/><p>Meng Hao had no way to predict what that would be like, but his heart filled with increasingly powerful anticipation nonetheless.</p><br/><p>It was at this time that just outside of the Xiao Clan, two beams of prismatic light shot through the air. One flickered with blue light, the other white as they flew forward and caught sight of Meng Hao.</p><br/><p>“So it turns out to be a Chosen!” said the white-robed youth. The Blood Demon Sect’s current Dao Child looked down, eyes glowing. They were filled with battle, seemingly kindled into burning. They flashed like lightning as they examined Meng Hao.</p><br/><p>To the side was the blue-robed young man, the brother of Sang Luo. As he gazed upon Meng Hao, his eyes narrowed and his heart filled with an indescribable sense of danger!</p><br/><p>At this same moment, in a location not too far away, but not too near, existed an enormous basin in the earth. There were actually ten such basins, each one filled with richly ornamented buildings and pagodas. Each basin also contained a lake.</p><br/><p>From a distance this place looked… mysterious and dark. This land… was none other than one of the five great Sects of the Southern Domain… the Blood Demon Sect!</p><br/><p>Within the center of the ten basins was a tree. One half of the tree was wilted and dry, the other half was lush and flourishing. It was a very bizarre sight, and clearly something beyond ordinary. This tree was a precious treasure of the Blood Demon Sect!</p><br/><p>Underneath the tree, an indistinct figure sat cross-legged. Suddenly, the figure raised its head. Its vision pierced through everything until it reached the Xiao Clan, and Meng Hao.</p><br/><p>A smile appeared on its face, and an indistinct murmuring could be heard.</p><br/><p>“So, it was not in vain that I helped you those three times,” the indistinct figure said, its voice husky. \"This kid has certainly grown up…. It seems Yu’er is there too. Perhaps this is the tribulation that violet-robed Cultivator spoke of the day she was born?” Thunder rumbled above in the sky.</p><br/><p>“The Dao of the Heavens is not dead, I shall not enter the yellow springs of the underworld!” The figure looked up into the sky, and its face suddenly emitted two beams of ferocious, red light. This was none other than… The blood-red figure who had appeared that year at the Reliance Sect!</p><br/><p>This was the blood-red Demon Lord who had flashed through the sky to save Meng Hao from obliteration at the hands of Lord Revelation. [1. If you want to review the two previous appearances of the Demon Lord, check out Chapter 34: Fame from 1,000 Years Ago! and Chapter 94: You Really Want Me To Come Out?]</p><br/><p>In the air above the Xiao Clan, a golden light glittered. The surrounding Cultivators trembled in fear. Meng Hao turned his head, his gaze sweeping to fall upon the white-robed Cultivator.</p><br/><p>He could only be described as beautiful. His body was covered with a voluminous white robe, and he emanated a demonic aura. However, in addition to the demonic aura, there was a refined and cultivated air. He floated there, and though he was accompanied by another Cultivator, all eyes were on him. Even if there were countless thousands upon thousands of people present, he would be the center of attention.</p><br/><p>His beauty, coupled with his demonic air, made it such that even most women would have trouble surpassing him. Were he wearing women’s clothing, he would be a beauty unmatched in his generation.</p><br/><p>As Meng Hao’s looked upon the white-robed youth, their gazes locked. Instantly, Meng Hao could sense the desire for battle within those eyes. Next to the beautiful Blood Demon Dao Child was a blue-robed Cultivator. His gaze immediately fell upon Sang Luo, who laid entangled in the black net on the ground not too far of. He was just about to spring into action when the white-robed youth held out a hand to stop him.</p><br/><p>“You’re not his match.” The white-robed youth smiled. “I find this person… very interesting.” His smile was warm and calm. Were this person to be wearing women’s clothing, this consummately elegant smile would make flowers grow dim!</p><br/><p>After smiling, the white-robed youth took a step forward. This step landed on air, but as it did, Meng Hao’s eyes narrowed. It felt as if the step had landed directly on his heart. His entire condition changed, as if he were suddenly under great pressure.</p><br/><p>A wave of power rippled out from the white-robed youth, clearly caused by a completed circle of late Foundation Establishment.</p><br/><p>“These are my Seven Demonic Lotus Steps. Each step is unbreakable. Take care, Fellow Daoist.” With a smile, the white-robed youth began to take a second step. His power suddenly surged to immense heights, as if the power itself contained his will. It spread out in all directions.</p><br/><p>Meng Hao’s eyes gleamed. As the white-robed youth approached, a strange aura seemed to be building up in the area. It circled around, emanating a mysterious aroma. It smelled pleasant; however, it could cause bewilderment which could lead to total loss of oneself.</p><br/><p>As the second step descended, Meng Hao began to shake, and the gleam in his eye grew sharper. Smiling, the white-robed youth began to take a third step. As it fell, the power in the area grew exponentially stronger. His body seemed to transform into something invincible. It was only the third step, but in Meng Hao’s perception, time itself seemed to suddenly whiz by. It was as if the entire world were being replaced by something else.</p><br/>\n</div>"}