{"title": "Chapter 175: Li Shiqi", "id": 175, "volume": 2, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-175-li-shiqi", "volume_title": "Volume 2", "body": "<h1>Chapter 175: Li Shiqi</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 175: Li Shiqi</strong></p><br/><p>A strong feeling filled Meng Hao. It was as if the area surrounding him was cut off from everything else. It felt like his Cultivation base was about to degrade and he would soon fall back to the early Foundation Establishment stage.</p><br/><p>At the same time, an incredibly realistic vision appeared in his mind. He returned to Mount Daqing, to Yunjie County, to the window of his room, underneath the moonlight. He saw himself sitting there reading.</p><br/><p>Meng Hao had never experienced a magical technique such as this. This was his first time. His eyes narrowed.</p><br/><p>The white-robed youth’s fourth step was just beginning!</p><br/><p>As it did, Meng Hao’s mind reeled, and more visions appeared. He suddenly realized that the state caused by his opponent would be impossible to break once the seventh step was reached. That was the pinnacle, and when that last step descended, his opponent would be able to employ a pressure so intense that he wouldn’t need to attack.</p><br/><p>That pressure contained a power that could sweep away the Foundation Establishment stage!</p><br/><p>“If the art is unbreakable, then I must break the situation!”</p><br/><p>Meng Hao’s eyes glittered, and his head tilted up. He lifted his right hand and pointed down toward the ground. The earth seemed to shake, and yet, what was shaking was not the earth, but Meng Hao. Ghost images appeared everywhere; the only thing that didn’t have a ghost image, was Meng Hao!</p><br/><p>“This is the Eighth Hex, Body-sealing Finger,” said Meng Hao coolly. “Take care, Fellow Daoist.” He lifted his hand and pointed forward.</p><br/><p>Suddenly, Meng Hao’s body stopped vibrating. The ghost images all overlapped and descended toward the white-robed youth. They merged into his body, and suddenly, a conspicuous ghost image of the young man himself appeared. The fifth step that he had been about to take could no longer be completed.</p><br/><p>The white-robed youth’s mind trembled; he looked at Meng Hao with eyes glowing, his expression dignified.</p><br/><p>Meng Hao didn’t attack. This battle was more of an exchange of techniques, not a battle to the death. Meng Hao stood there indifferently, calmly looking at the young man.</p><br/><p>After the space of a single breath, the white-robed youth recovered. However, the power caused by the overlapping momentum of his steps had dissipated, nullified by Meng Hao.</p><br/><p>The Seven Demonic Lotus Steps was an art that utilized the power of momentum. Once unleashed, even high-level Cultivation bases would have difficulty breaking it. From the time he had emerged as a figure in the Cultivation world until now, the white-robed youth had never encountered someone of the Foundation Establishment stage who could break the Seven Demonic Lotus Steps; not even Dao Children of the other Sects or Clans were able to.</p><br/><p>But today, in this place, he had witnessed an unprecedented occurrence. His eyes shined with a strange light as he gazed at Meng Hao. His face filled with respect; this was an esteem that only powerful experts of the same generation would feel for each other.</p><br/><p>“To receive without giving is not a principle by which I live,” said Meng Hao coolly. “I also have an attack to share. Please prepare.” He lifted his left hand, using the nail of his thumb to slice his middle finger. Blood flowed out, causing his middle finger to become crimson. His hand moved in a casual motion, but his eyes were filled with ferocity.</p><br/><p>As he attacked, observers could not see anything special happening. However, the white-robed youth’s pupils instantly constricted. From his perspective, everything had suddenly turned to the color of blood. His expression flickered slightly, and a sense of imminent, fatal danger welled up in him. His right hand shot up to slap his bag of holding. A branch appeared in his hand upon which grew three withered leaves and three luxuriant leaves. He waved it in front of him.</p><br/><p>No sound could be heard, but faint ripples circled out. Meng Hao gave a bored snort and retreated backward a three paces. As he did, his power began to decline, so he stopped and took a step forward.</p><br/><p>The step descended, seeming to trample directly on the heart of the white-robed youth, whose mind shook. His body swayed, as if a massive, invisible force were pushing down on it. He retreated backward a few paces, the blood draining from his face despite the aid of his magical item. As the color slowly returned to his face, he gave Meng Hao a deep look.</p><br/><p>“Senior, I am Li Shiqi.” It seemed this white-robed youth actually had a girl’s name [1. Li Shiqi’s name in Chinese is  lǐ shī qí - Li is a common family name. Shi means “poem.” Qi means “fine jade”]. He stared at Meng Hao as he asked in a soft voice, “Fellow Daoist, would it be possible for me to enquire as to your illustrious name?”</p><br/><p>Meng Hao got an odd feeling when looking at the white-robed youth. There was something strange about him. He thought for a moment, then replied, “Meng Hao.”</p><br/><p>“Brother Meng, the person you have in your custody is actually a blood relative of my Junior Brother. I hope you can release him. If he did anything to offend you, I offer my sincere apologies.”</p><br/><p>Meng Hao looked at blue-robed youth who stood by Li Shiqi. He was currently looking at Sang Luo off in the distance. Meng Hao raised his right hand, and the black net loosened. Sang Luo, face pale, shot away with all the power he could muster. Meng Hao’s hat pursued him at top speed.</p><br/><p>“Eee? Don’t run away. Meng Hao, how could you do such a thing?” The meat jelly roared angrily as it shot after Sang Luo. “You can’t do that, it’s immoral! You can’t just let him go. I haven’t rescued him from the path of evil yet….”</p><br/><p>Sang Luo’s body trembled as he raced to the side of the blue-robed Cultivator. His face was covered with terror as he clutched at his older brother’s clothes and stared in horror at the approaching hat.</p><br/><p>Li Shiqi stared in shock at the hat.</p><br/><p>The meat jelly’s voice suddenly sounded surprised. “Eee? What are you looking at? You’re a female? Heavens, you look like a guy, but you’re actually a girl. Strange, very strange. No rod, no rod!” It returned to Meng Hao, plopping down onto his head and once again changing color to bright green.</p><br/><p>Li Shiqi’s face suddenly looked extremely unsightly as she glared at the hat, and then Meng Hao. All the good feelings from moments before suddenly evaporated.</p><br/><p>Meng Hao made a wry smile. The meat jelly had suddenly made everything very clear. Meng Hao suddenly had an acute understanding of why people called the meat jelly Ultimate Vexation.</p><br/><p>Ignoring the looks on the faces of Meng Hao and Li Shiqi, it started to prattle on, apparently preparing to talk for at least three days and three nights without stopping. “Strange, so strange. You’re actually a female… huh?” In the midst of its excitement, the meat jelly seemed to have found something else interesting. It looked off into the distance.</p><br/><p>It was at this exact moment that off in the Blood Demon Sect, sitting cross-legged underneath the strange tree, the Demon Lord’s body suddenly quivered. He immediately retracted his vision, cutting off all connection to the outside world.</p><br/><p>“Dammit,” said the indistinct image of the Demon Lord, panting. “How could that abominable thing have appeared. Didn’t his excellency suppress it? And yet, there it is, attached to the body of a disciple of the Demon Sealing Sect!!</p><br/><p>“I cannot get entangled with it. According to the legends, there were many powerful experts in ancient times who were driven insane by it…. It looks weak though, it must not have been able to sense me….”</p><br/><p>Back in the Xiao Clan mountain village, the meat jelly hat gazed off into the distance. It seemed to be lost in thought for a moment, after which its body flickered, and it looked back at Li Shiqi.</p><br/><p>Li Shiqi gave a cold snort and then glared angrily at Meng Hao. Without another word, she spun and flew off. The blue-robed Cultivator gave a dry cough, then picked up Sang Luo and transformed into a colorful beam that shot off into the distance.</p><br/><p>“Eee? You’re leaving, little girl? Don’t leave! I haven’t finished talking….”</p><br/><p>Meng Hao’s face once again filled with a dark expression. The surrounding Cultivators wanted to leave. Unfortunately, their Dao Pillars trembled, and they were incapable of even moving. They stared nervously at Meng Hao.</p><br/><p>“From this day forward, none of you are permitted to step a foot into the Xiao Clan,” said Meng Hao coolly. He flicked his sleeve, unbinding the Cultivators. They immediately gave deep bows to Meng Hao, and pledged to follow his instructions. After that, they fled at top speed.</p><br/><p>When they were gone, pale-faced Xiao Chang’en approached. Clasping hands, he bowed deeply to Meng Hao.</p><br/><p>“Many thanks, benefactor!!”</p><br/><p>All of the Xiao Clan members approached and began kowtowing to Meng Hao. Xiao Caifeng stared at him blankly for a moment, and then nodded.</p><br/><p>Meng Hao looked around at the Xiao Clan. “I can’t stay here,” he said gently. “I must leave in a few days. The only help I can provide is what I’ve already done.”</p><br/><p>“It’s enough,” said Xiao Chang’en, bowing deeply. “Fear of benefactor will keep the Xiao Clan safe for dozens of years to come. Once the Xiao Clan produces another Foundation Establishment Cultivator, then our position will be secured permanently.” The death aura which emanated from his body had grown stronger. Most likely, he would reach the end of his life within a year.</p><br/><p>Meng Hao said nothing. After a long moment, he nodded, then returned into the lightning mist.</p><br/><p>Three days later, Meng Hao chose to leave. Before departing, he severed two vines and left them in the Spirit lake. He helped Xiao Caifeng to brand them to herself; in the future, they would belong to the Xiao Clan. Xiao Caifeng watched with a smile as Meng Hao left.</p><br/><p>Her eyes followed him as he disappeared into the distance. Who knew how long his shadow would rest on her heart? Her gaze rested on the spot where he had disappeared; she knew inside that there was no possibility of anything happening between the two of them.</p><br/><p>Xiao Chang’en looked at Xiao Caifeng and sighed. His body seemed even weaker in the early morning sun. He was only growing older and older.</p><br/><p>Several days later, Meng Hao sped through the sky, flying along the border territory between the Blood Demon Sect and the Solitary Sword Sect. A frown covered his face because of the incessant yammering of the meat jelly hat. It hadn’t stopped talking at all during the previous days.</p><br/><p>“A female. Wahaha! It turned out she was a girl. Meng Hao, don’t you think it’s strange? Hey, why aren’t you saying anything? You can’t do that, it’s immoral. It turns out you fought with a girl! Heavens…. You know, I’m an elder of the senior generation, with ever-changing forms. How can you treat me this way? Acting like this is very wrong, very immoral….”</p><br/><p>Veins of blood filled Meng Hao’s eyes, along with a look of despair. He really couldn’t deal with this type of torment. The hat’s endless chattering was enough to drive a person crazy. Meng Hao could feel his temper growing worse and worse.</p><br/><p>But attacking the meat jelly was useless. Cursing it did nothing. It couldn’t be thrown away. It was stuck to him like dog skin plaster, seemingly attached to him for life. Meng Hao couldn’t think of any other alternative than to simply go insane.</p><br/><p>He proceeded forward wearily. Suddenly, his eyes flickered as he caught sight of eight bright beams shooting toward him. They were all Cultivators of the Foundation Establishment stage. The beams of light were all the color of blood. Several of the Cultivators were maintaining a spell, within which was the indistinct image of some sort of enormous blood-colored beast. It floated above them as they proceeded forward.</p><br/><p>Seeing these eight Cultivators, Meng Hao’s eyes flashed, and he suddenly spoke to the meat jelly. “You say you have ever-changing forms? I don’t believe you.”</p><br/><p>“You don’t believe me!?” cried the meat jelly furiously. It seemed incapable of accepting this. Its dignity and honor had been trampled upon!</p><br/><p>-----</p><br/><p><em>This Chapter was sponsored by David Phan, Eric Archer, Robert Kunzi and Gary Cosby</em></p><br/>\n</div>"}