{"title": "Chapter 170: Lonely Sang Luo", "id": 170, "volume": 2, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-170-lonely-sang-luo", "volume_title": "Volume 2", "body": "<h1>Chapter 170: Lonely Sang Luo</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 170: Lonely Sang Luo</strong></p><br/><p>Meng Hao was filled with regret. He should never have asked that question. He’d had no clue the meat jelly would talk on and on at such length. He took a deep breath, but before he could speak, the meat jelly’s expression brightened.</p><br/><p>“Oh, I know. You haven’t reached Core Formation, so it can’t come out. Hahaha! It can’t come out….”</p><br/><p>Meng Hao lowered his head, filled with helplessness. He looked at the meat jelly with a bitter smile.</p><br/><p>He ground his teeth for a long moment before saying, “If you don’t shut up, I’m going to take you back to the Black Sieve Sect!” He really just wanted to give voice to the frustration caused by the constant droning in his ears.</p><br/><p>“That’s okay. In any case, I’ve bonded a master, so it would be useless. Refining me would require refining you. Eee?” A dumbfounded look filled the meat jelly’s face. It thought for a moment. “That’s a good idea! I wonder what it would feel like if we got refined together. Let me think.” A look of anticipation covered its face, causing Meng Hao too seem even more hopeless.</p><br/><p>“How exactly can I get you to leave?” he said with a bitter laugh. His voice was softer this time.</p><br/><p>Hearing this, the meat jelly instantly looked much more serious that before. Its voice solemn, it began to speak. Meng Hao ignored it, looking up into the air for the time it takes an incense stick to burn.</p><br/><p>“… in short, I will definitely never leave you! I need to convert that bird. Until I convert it, I’ll never leave!”</p><br/><p>Meng Hao had always thought of himself as very focused. Once he set his mind to something, he couldn’t be distracted. But now, he realized, that was before he had met the meat jelly.</p><br/><p>Be it he himself, or some other consummate expert, anyone who met this garrulous, long-winded thing would surely be driven crazy…. Meng Hao took a deep breath. He now had a much better understanding of the thing’s personality. It must not be given a conversation topic! He lowered his head, and after about an hour had reached a state in which he could somewhat ignore the chattering in his ear. Despite the meat jelly’s constant talking, Meng Hao took out the Sieve Earth Pill and began to examine it.</p><br/><p>An earnest expression filled his face, but it was very hard to ignore the endless rambling. That was especially true when the meat jelly flew off of his head and landed in front of him. It seemed that it felt humiliated to be ignored.</p><br/><p>“You can’t do that. It’s immoral!!” it cried, launching into another tirade.</p><br/><p>Soon, night approached, and Meng Hao’s face was covered with exhaustion. Buzzing filled his ears, and his eyes were bloodshot as he completely ignored the meat jelly. It was with despair that he had discovered that even if it wasn’t given a conversation topic, the meat jelly would still continue to talk.</p><br/><p>Until dawn. Until the next night. The moon hung brightly in the sky.</p><br/><p>And then, finally, it seemed as the meat jelly had run out of things to talk about it. Meng Hao let out a sigh, and as he did, the meat jelly flew out to the lake shore and… began to talk to the fish within the lake….</p><br/><p>Meng Hao let out another sigh of relief. He pulled out the copper mirror and the Spirit Stones given to him by the Xiao clan. He placed the Sieve Earth Pill onto the mirror and duplicated a single one. He thought for a moment, and then produced a jade slip. He branded it with Spiritual Sense, then flicked it out the window. Moments later, the young Xiao Clan woman approached nervously, leading a Spirit monkey with her.</p><br/><p>The monkey screeched as it approached. The young woman looked off toward the lake shore for a moment, at the meat jelly hat, which was currently shouting out toward the lake.</p><br/><p>“Xiao Caifeng [1. Xiao Caifeng’s name in Chinese is  xiào cǎi fèng - Xiao is a family name. Cai means “colorful.” Feng means “phoenix.”] greets the elder generation,” she said, pulling her gaze from the meat jelly back to Meng Hao and the lightning mist which surrounded him. She bowed in greeting, and then proffered the leash which bound the Spirit monkey. Meng Hao’s eyes opened. Without a word, he sent an Earth Sieve Pill flying toward the monkey. The monkey consumed it instantly.</p><br/><p>It let out a few screeches, and its eyes rolled about. Meng Hao’s eyes glittered as he observed, probing the monkey with his Spiritual Sense. Suddenly, the moonlight in the sky seemed to form threads which the monkey began to absorb. A contended look slowly filled the monkey’s eyes.</p><br/><p>About four hours passed in which Meng Hao observed the monkey, and Xiao Caifeng stood patiently off to the side.</p><br/><p>Finally, Meng Hao nodded.</p><br/><p>“Very good,” he said coolly. Xiao Caifeng let out a sigh of relief. Clasping hands and bowing to Meng Hao, she led the monkey away. It was obviously much more powerful than it had been before.</p><br/><p>Meng Hao lowered his head thoughtfully. Using the Spirit Stones provided by the Xiao Clan, he began to duplicate the pill. The pill’s full name was Moon Sieve Mother Earth Pill, and could only be consumed at night. It used the moonlight as nourishment, and provided excellent results.</p><br/><p>The cost to duplicate the pill was considerable, and the Xiao Clan was by no means a great Clan. They had not been able to provide many Spirit Stones, and soon, Meng Hao had already used half of them. The result was six duplicated Sieve Earth Pills.</p><br/><p>“I wasted one pill, but caution required that.” Dawn broke, and Meng Hao looked down at the six Sieve Earth Pills. He closed his eyes in thought, wondering how many of these pills it would take to develop his fourth Dao Pillar. Now that he had completed the circle of three Dao Pillars, it shouldn’t be long before his fourth Perfect Dao Pillar started to become visible.</p><br/><p>Time passed by slowly, and soon it was afternoon. The meat jelly was still at the lake shore, chatting with the lake waters. With his Spiritual Sense, Meng Hao was able to determine that all the fish had retreated to the bottom of the lake to hide. There was only one left, which was slamming its head against the shore, seemingly unable to take any more torment.</p><br/><p>Fear lingering in his heart, Meng Hao collected up the remaining Spirit Stones. He was very much afraid of attracting the attention of the meat jelly and its excited ramblings. The last thing he needed was for it to come up with a new topic to talk to him about.</p><br/><p>He retracted his Spiritual Sense, and then suddenly, his expression flickered. He looked past the lightning mist at the world outside.</p><br/><p>At this moment, two colorful beams of light appeared in the sky above the Xiao Clan mountain village, then shot down screaming toward the village. In the lead was a Cultivator wearing a black robe. He was very short, a midget in fact. His long robe covered his face and trailed behind him through the air. At first glance, you wouldn’t notice that there was a midget inside; you would only see a black robe flying through the air.</p><br/><p>Behind the midget was grim-faced Xu Luodi, whose eyes radiated killing intent. Of course, the midget was none other than Mr. Sang Luo, from whom Xu Luodi had requested help.</p><br/><p>The two of them were moving incredibly fast, and within moments had landed in the Xiao Clan mountain village. The midget spoke with a cruel, piercing voice that rolled out like thunder, covering the Xiao Clan. Xiao Caifeng’s face went pale, and Xiao Chang’en’s pupils constricted, and his eyes filled with fear.</p><br/><p>Before anyone could emerge, a roaring boom filled the air, and the Xiao Clan shook as its protective shield was smashed to pieces. The Xiao Clan main gate, just outside of the lake, immediately crumbled into dust. A gale force wind swept across the entire area.</p><br/><p>The Xiao Clan’s manor houses shook, and some collapsed. The Xiao Clan members who couldn’t practice Cultivation trembled when they heard the voice. Pale faced, Xiao Chang’en quickly led a group of people out. Xiao Chang’en’s face filled with astonishment when he saw the collapsed main gate, and the midget striding forward, his black robe trailing behind him. Xiao Chang’en staggered backward.</p><br/><p>“So, it’s this savage… Could it be that doomsday has arrived for the Xiao Clan….” Because of the midget’s presence, he wasn’t able to summon even the least bit of fighting spirit.</p><br/><p>Mr. Sang Luo [2. Sang Luo’s name in Chinese is  sàng luō - This is not a realistic name. Sang means “funeral” or “mourning.” Luo means “catch” or “net”] was quite famous in the region. Although he didn’t dare to rile the Blood Demon Sect, there was no one among the surrounding Cultivator Clans who dared to provoke him.</p><br/><p>His Cultivation base was extremely high, at the late Foundation Establishment stage, in fact. It wouldn’t be long before he could step into the Nascent Core stage. He was savage and cruel, and if even one word was spoken to him in the wrong way, he would attack with vicious cruelty. He really had earned a fearful reputation.</p><br/><p>Based on that alone, he might not necessarily be in such a good position. After all, the Cultivator Clans in this area were all filled with people who had connections to the Blood Demon Sect.</p><br/><p>However… this Sang Luo had once been a disciple of the current generation of the Blood Demon Sect. However, he had broken some Sect Rules, and was thus expelled. His Cultivation base had been left intact, and he had not been prevented from causing trouble outside. Xiao Chang’den had even heard that he had an older brother who wasn’t a midget, and had extraordinary latent talent. Apparently, he was a Chosen of the Blood Demon Sect.</p><br/><p>“I, Xiao Chang’en, extend greetings to Mr. Sang Luo,” said Xiao Chang’en, his face pale white as he watched Mr. Sang Luo approach, Xu Luodi at his side, radiating murder. Xu Luodi had a pleased expression in his eyes, causing Xiao Chang’en to sigh inwardly. He didn’t place much hope in Meng Hao now. Meng Hao’s Spirit minion was powerful, but his Cultivation base was simply too weak.</p><br/><p>Sang Luo let out a piercing snort as he approached the Xiao Clan with Xu Luodi. His eyes gazed about from within the robe.</p><br/><p>“Xiao Chang’en,” said Xu Luodi, “Call out that Shaman Cultivator you invited!” He laughed coldly. “Are you scared to show your face, Shaman boy? Get the hell out here!” His voice thundered out, causing Xiao Chang’en to stand there bitterly, not daring to say even a word. Behind him, his Clansmen trembled. Only Xiao Caifeng stood there motionless, face pale but eyes filled with fury.</p><br/><p>Sang Luo stood there, enjoying the looks of fear in the eyes of the Xiao Clan members. He also reveled in Xu Luodi’s words. He couldn’t help but sigh inwardly. To him, life was as desolate as snow. It was lonely at the top, and in his heart was the desire to find someone who could defeat him.</p><br/><p>What he didn’t know was that as soon as Xu Luodi’s voice passed through the lightning mist, Meng Hao stood up.</p><br/><p>Meng Hao also heard the meat jelly, and it seemed as if it was preparing to conclude its speech. In his estimation, it wouldn’t be long before it returned to pester him.</p><br/><p>“I really need to find someone to help free me from this torment,” he thought. “I’m really in agony!” Gritting his teeth, he strode out.</p><br/><p>The air around the lake rippled as a mist of thunder rolled out. Meng Hao looked somewhat bitter as he walked forward. Beneath him, the ground heaved as the vines shot up to sway back and forth and emit piercing shrieks.</p><br/><p>Meng Hao’s eyes were bloodshot, thanks to the torment of the meat jelly. He looked at Xu Luodi, and then the midget. He decided to target the late Foundation Establishment stage, in the hopes that the battle might last a bit longer.</p><br/><p>“Trifling early Foundation Establishment stage,” said Sang Luo coolly as he eyed Meng Hao approaching. “Xu Luodi, you’re equally as hopeless.” His eyes peered out of his robe, filled with pride and aloofness. Again, his heart filled with the powerful loneliness of snow.</p><br/><p>“Mr. Sang Luo, senior, you really can’t blame me,” said Xu Luodi hurriedly. “Just help me get rid of the Spirit minion. With that out of the way, I can easily smash this guy to pieces.” He glared ruthlessly at Meng Hao.</p><br/><p>What Xu Luodi didn’t know was that true cruelty would not come to bear upon Meng Hao, but rather Sang Luo, lonely as snow. Something would happen that Sang Luo would never forget for the rest of his life. It would give him nightmares for the rest of his days, and leave a shadow on his soul… and it would happen shortly.</p><br/><p>Perhaps afterwards, he would no longer feel as lonely as snow….</p><br/><p>-----</p><br/><p><em>This chapter was sponsored by Dehua, David White, Jose Lluberes, LN Lurker, Randall Bezant, Yu-Chiang Hsu, Maggie Lee, and David Phan</em></p><br/>\n</div>"}