{"title": "Chapter 171: Blood Demon Dao Child", "id": 171, "volume": 2, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-171-blood-demon-dao-child", "volume_title": "Volume 2", "body": "<h1>Chapter 171: Blood Demon Dao Child</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 171: Blood Demon Dao Child</strong></p><br/><p>Sang Luo gave an arrogant snort that was apparently a response to Xu Luodi. Xu Luodi seemed to glow with vitality as he gazed upon approaching Meng Hao. His eyes were thick with cruelty.</p><br/><p>“Today, Xu Luodi will help you to understand that when you help someone you shouldn’t, you will incur my wrath!” he said, his voice filled with crazed fervor. “And I will also help you to understand what Shaman Cultivators fear the most!”</p><br/><p>The various Xiao Clan members were all pale-faced. Xiao Change’en laughed a bitter laugh, well aware that he had no way to undo what had already been done. He took a deep breath, and strode forward, power from his Cultivation base suddenly exploding out. It was the power of the mid Foundation Establishment stage, but it seemed somewhat weak. He was reaching the end of his longevity, so his Qi passageways had long since begun to wither. With effort, he could display the power of the mid Foundation Establishment stage, but in doing so, would actually harm his life force.</p><br/><p>“The matter today has to do with the Xiao Clan, not any outsider,” he said, his entire body seeming to grow taller. “This person wasn't invited here by the Xiao Clan, he’s only passing through. If the disappearance of the Xiao Clan is the will of the Heavens, then take this Spirit lake! But if you intend to take any of my Clan members, then you must treat them well. Otherwise I’ll make you pay, even if I have to die in the process!” His words echoed out with great power, causing Xu Luodi’s brow to furrow.</p><br/><p>As for Sang Luo the midget, he emitted a shrieking laugh.</p><br/><p>Meng Hao looked over at Xiao Chang’en, and suddenly his feelings toward the man changed. He nodded, and then coolly said, “Fellow Daoist Xiao, didn’t you give this lake to me as a gift? In that case, it belongs to me. Does anyone here dare to attempt to take it away!?” The vines in front of him shot toward Sang Luo and Xu Luodi.</p><br/><p>Sang Luo let out an ear-piercing laugh which was filled with contempt and disdain. He flipped his sleeve grandly, and from within a black sealing stone flew out. It expanded as it shot forward, emitting a strong pressure that caused all of the vines to stop in their tracks. Only the main trunk vine continued onward, howling.</p><br/><p>Sang Luo’s piercing laughter accompanied him as he took a step forward. He lifted his right arm to reveal a hand much smaller than an average person’s. He waved it toward the approaching main trunk vine; a black wind sprang up and whistled toward the vine.</p><br/><p>At the same time, Xu Luodi’s laughter filled the air. His body flashed as he made a beeline toward Meng Hao, his eyes shining with fierce killing intent. The instant he took to motion, however, Xiao Chang’en suddenly leaped to obstruct his path. A look of disdain covering his face, Xu Luodi flicked his wide sleeve. A roaring sound filled the air, and Xiao Chang’en was pushed back.</p><br/><p>“I’m not going to kill you for now,” he laughed. “We’ll be relatives by marriage soon, and still have wedding wine to drink.” He shot toward Meng Hao. “And now I’ll help you to understand that what Shaman Cultivators fear most is being beheaded!” He laughed arrogantly.</p><br/><p>Meng Hao’s face, on the other hand, was the same as ever. It hadn’t changed even the slightest bit as he allowed Xu Luodi to approach.</p><br/><p>When Xu Luodi was roughly nine meters away, Meng Hao’s eyes suddenly shone with a cold light. He didn’t retreat, but instead flickered, and suddenly appeared directly in the path of Xu Luodi. He lifted his hand, and a billowing Flame Sea appeared along with a roaring, three hundred meter long Flame Dragon.</p><br/><p>When the Flame Dragon appeared, Xu Luodi’s expression suddenly changed to one of complete disbelief.</p><br/><p>“That... that....” It was almost as if he didn’t dare to believe what he was seeing. But he felt the intense pressure exuded by the Flame Dragon, which far exceeded that of the late Foundation Establishment stage.</p><br/><p>A sense of life-or-death danger filled his entire body, inundating his head with a booming drone. It was as if his body had been struck with countless lightning bolts. His face continued to be filled with disbelief.</p><br/><p>“Late Foundation Establishment!!” His body began to tremble, and intense dread shone from his eyes. How could he ever have imagined that the young man of the early Foundation Establishment stage could possibly erupt with the power of late Foundation Establishment? As for his so-called beheading, the person he thought he could so easily defeat had suddenly transformed into a violent beast who could slaughter him hundreds of thousands of times over!</p><br/><p>It wasn’t just him who was shocked. Xiao Chang’en gasped and stared, dumbstruck. He was literally incapable of reacting to what he was seeing. His mind filled with buzzing. And then, his eyes filled with wild joy.</p><br/><p>When the Flame Dragon appeared, the vines that had been suppressed by Sang Luo the midget suddenly shook and lifted up. Within the black robe, two eyes emanated shock.</p><br/><p>All of this takes some time to describe, but actually happened in an instant. Even as Xu Luodi’s voice could be heard, it was replaced by a blood-curdling scream which sounded out throughout the whole area. The three hundred meter long Flame Dragon slammed into him, instantly transforming his body into bits of ash which floated in the air. Only his scream remained behind, echoing through the air.</p><br/><p>His bag of holding flew into Meng Hao’s hand.</p><br/><p>As the scene played out in front of everyone, Xiao Chang’en’s expression grew excited. Next to him, Xiao Caifeng gazed at Meng Hao, her eyes filled with a strange glow.</p><br/><p>There is no need to even mention the rest of the Xiao Clansmen, who stared at Meng Hao with excited inspiration.</p><br/><p>Sang Luo’s expression was unsightly. Having witnessed Xu Luodi’s death, his heart now was now thumping. He was a cautious person by nature, so he immediately retreated. He was of the late Foundation Establishment stage, but he wasn’t the type to risk himself. His body flashed as he attempted to flee. In his mind, his opponent would most likely have some apprehensions, and wouldn’t pursue.</p><br/><p>If his opponent didn’t pursue, it would be evidence that he viewed himself as inferior. In that case, Sang Luo could make a sudden reverse attack to kill him. This was a tactic that he had frequently employed, and had practiced until the proverbial furnace flames burned blue. However, as soon as he began to fly off, Meng Hao gave off a cold harrumph and then leaped into the air, transforming into a prismatic beam that shot after Sang Luo.</p><br/><p>Seeing this, Sang Luo’s face immediately fell.</p><br/><p>“The fact that he’s chasing me proves that he thinks he can kill me. This can’t be right!” His heart trembled as he raced forward. He waved his right hand, causing the black sealing stone to emit a buzzing sound as it shot toward Meng Hao.</p><br/><p>Meng Hao could fight with late Foundation Establishment Cultivators who had nine Dao Pillars, although he couldn’t do so lightly. Sang Luo, however, only had a mere seven Dao Pillars. Meng Hao had the luxury of being able to look down on him. His right hand flickered with an incantation gesture and the two wooden swords appeared. One shot toward the black seal, the other became a colorful beam that shot in pursuit of Sang Luo.</p><br/><p>A boom filled the air as the black sealing stone was shattered into pieces. Sang Luo let out an angry howl. He eyed the approaching wooden sword, and his body trembled. He quickly snapped a jade slip between his fingers, and then made an incantation gesture with both hands, after which he waved the index of his right finger in the air in front of him.</p><br/><p>As he did, everything around him seemed to grow dark, as if his finger were sucking in some strange power from around him. His body began to emanate an annoying, prickly aura that caused Meng Hao to frown.</p><br/><p>The first time he had sensed a aura similar to this was back in the Black Sieve Sect [1. If you want to review the part where he sensed the aura in the Black Sieve Sect, check out Chapter 143: Ghost in the Night]. This aura, however, was much weaker, like a firefly compared to a full moon. Actually, now that he thought about it, he had experienced a similar reaction when he was in the cave in the mountain valley.</p><br/><p>A booming sound once again filled the air as the wooden sword came screeching to a stop in mid-air. A rushing wind blew back the midget’s robes, revealing an ugly, scarred face and two strange eyes filled with fear. Beads of sweat dripped down his face.</p><br/><p>“Fellow Daoist, let’s talk things through,” said Sang Luo nervously. He could tell that whereas he was using all the power he could muster, his opponent was acting casually.</p><br/><p>The differences between masters are usually instantly obvious!</p><br/><p>Meng Hao took a moment to sense the aura emanating off of the midget. His heart thumped. He had his speculations regarding this aura, and now that he had seen it once again, he lifted his hand and extended a finger.</p><br/><p>“Demon Sealing, Eighth Hex!”</p><br/><p>As his finger descended, everything grew dark. Sang Luo suddenly began to tremble, and his eyes shone with astonishment. He immediately sensed the Qi of heaven and earth changing. Suddenly, his Cultivation base was suppressed. A whizzing sound could be heard as the wooden sword in front of him shot forward; in the blink of an eye, it would plunge into his neck.</p><br/><p>His eyes filled with despair. However, at this exact moment, Meng Hao flicked his sleeve. The wooden sword, instead of ripping his head off, spun down and then carried Sang Luo with it back toward Meng Hao. Meng Hao reached out and grabbed Sang Luo by the neck.</p><br/><p>At this moment, Sang Luo’s Cultivation base was restored and he could move his body again. His face was pale, though, his eyes filled with terror. He didn’t dare to move even an inch. The hand which clamped down on his neck emanated a feeling of death that caused his heart to tremble. In fact, being this close to Meng Hao caused his entire person to shake.</p><br/><p>The feeling caused by the aura that emanated from Meng Hao caused his heart to seize with terror.</p><br/><p>His face was pale as he stammered, “You’re... you’re...”</p><br/><p>Meanwhile, elsewhere in the world, there was a mountain range that was covered in black clouds year round. Within a valley in this mountain range were two young people. They sat upright, gazing at the Go board which lay between them, seemingly lost in thought.</p><br/><p>One of the young people wore white clothing along with an indifferent expression. This youth’s features were beautiful to the extreme, almost otherworldly. The fan in his hand slowly waved back and forth.</p><br/><p>The other person wore a blue garment. He looked to be about thirty years of age. He held a Go piece in his hands as he stared down thoughtfully at the board. Hanging from his face was a jade pendant. Suddenly, a popping sound could be heard, and a crack appeared on its surface.</p><br/><p>When the crack appeared, the blue-robed young man frowned. He looked at the jade piece, and then back at the Go board.</p><br/><p>“Is something wrong?” asked the white-robed youth in a light, tender voice.</p><br/><p>“Nothing,” replied the blue-robed young man respectfully. “It’s just my good-for-nothing brother. He must have offended someone who he’s not a match for. He wants me to save him.”</p><br/><p>“That would be Sang Luo, correct...?” The white-robed youth smiled. “Go ahead and check out the situation. I don’t have anything else to do, I’ll tag along.”</p><br/><p>The blue-robed youth immediately stood up. “Your highness, your status as a Dao Child is so lofty, I don’t dare....”</p><br/><p>“There’s no harm.” This white-robed youth was none other than a Dao Child of the Blood Demon Sect!</p><br/>\n</div>"}