{"title": "Chapter 173: Rejected by the Heavens? Plunder!", "id": 173, "volume": 2, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-173-rejected-by-the-heavens-plunder", "volume_title": "Volume 2", "body": "<h1>Chapter 173: Rejected by the Heavens? Plunder!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 173: Rejected by the Heavens? Plunder!</strong></p><br/><p>Meng Hao was focused on breaking through to form his fourth Dao Pillar. However, regarding what was happening on the outside, it was no surprise to him. He had anticipated that such circumstances would come about. The cascading moonlight had focused attention on his increase in level. Although it hadn’t attracted universal attention, it had certainly caused quite a disturbance.</p><br/><p>Meng Hao was well aware that as more time passed, the situation would grow more volatile. The best method to bring matters to a conclusion was to finish breaking through as quickly as possible.</p><br/><p>However…. a Perfect Foundation could not absorb the spiritual energy of heaven and earth. He was only able to rely on the Sieve Earth Pills, and despite their extraordinariness, the process was becoming more difficult. He could clearly sense that they were losing their efficacy.</p><br/><p>Based on his current momentum, it didn’t seem they would be enough to complete the fourth Dao Pillar.</p><br/><p>As Meng Hao silently continued to Cultivate, outside, Xiao Chang’en’s words echoed out amidst the moonlight. Everything was silent for a moment afterward, and then cold laughter rang out. Three figures shot forward.</p><br/><p>Their features were indistinct within the darkness of night, but their Cultivation bases rippled, making it clear that one of their numbers was of the mid Foundation Establishment stage.</p><br/><p>In the surrounding Cultivation Clans, even the mid Foundation Establishment stage was considered quite powerful. Were it not so, the Xiao Clan would not have been able to occupy the Spirit Lake for so long. It was only now that Xiao Chang’en was reaching the end of his longevity that the current situation had come to be.</p><br/><p>The three figures whistled through the air toward Xiao Chang’en. A boom exploded out as the four people collided in battle. Xiao Chang’en coughed up a mouthful of blood. His face was pale as he flew backward like a kite with a broken string. The mid Foundation Establishment Cultivator laughed coldly and proceeded forward.</p><br/><p>The other two shot toward Meng Hao’s shield, laughing.</p><br/><p>It seemed to be a moment of crisis. Xiao Chang’en was torn; he knew that Meng Hao must be at a critical juncture; unfortunately, he was currently powerless to intervene. Even burning some of his life force to gain extra power would be useless.</p><br/><p>The two early Foundation Establishment Cultivators reached the shield; as soon as they touched it, a rumbling sound emerged. Within the space of two breaths, the shield collapsed.</p><br/><p>The shield had been created by Xiao Caifeng, who was only at the Qi Condensation stage; for it to hold up against the early Foundation Establishment stage for the space of three breaths testified to the outstanding latent talent of the one who had created the talisman.</p><br/><p>Booming echoed out as the shield was destroyed. As the two early Foundation Establishment stage Cultivators slammed into the lightning mist, miserable screams echoed out. In an instant, their bodies were surrounding by lightning; cracking sounds could be heard as they were thrown backward, blood spewing from their mouths. Expressions of shock covered their faces as their Dao Pillars trembled on the verge of collapse.</p><br/><p>The lightning mist roiled; its protection extended about thirty meters out from Meng Hao in all directions, creating a no-man’s land which no one could enter.</p><br/><p>Xiao Chang’en heaved a sigh of relief. The mid Foundation Establishment Cultivator with whom he had been battling paused, looking over his shoulder at the lightning mist, astonishment filling his eyes.</p><br/><p>Within the lightning mist, Meng Hao opened his eyes. They glowed brightly as he frowned and looked down at his last three Sieve Earth Pills. As for his fourth Dao Pillar, it was about ninety percent complete. These pills would be insufficient to complete the last ten percent.</p><br/><p>“These Sieve Earth Pills are only so effective…. Perhaps I won’t be able to reach the mid Foundation Establishment stage after all….” A stubborn look shone within his eyes. He knew that his path of Cultivation was different from that of others; he had acquired incredible battle prowess, but the Cultivation he practiced was much more challenging. Even as he thought of these things, a racket could be heard coming from the outside.</p><br/><p>“Fellow Daoists, this person’s Cultivation has stirred up such power, I’m afraid that once he emerges, all of our Cultivation Clans will be at his mercy. Let’s take advantage of this opportunity to destroy him now to prevent future troubles.”</p><br/><p>“Correct. The Xiao Clan is weak. Their existence is meaningless. The extermination of such Clans is the natural order, it can’t be changed!”</p><br/><p>“Let’s attack together. This lightning mist can’t hold up against all of us!”</p><br/><p>The ten or more Foundation Establishment Cultivators outside began attacking the lightning mist in unison.</p><br/><p>All of these people were from local Cultivator Clans; as they attacked, booming sounds lifted up to fill the sky. The lightning mist seethed violently.</p><br/><p>“An evil heart, is a useless life.” Meng Hao’s eyes sparkled icily as he looked out through the lightning mist. He quickly gathered up the remaining three pills and popped them into his mouth.</p><br/><p>They immediately dissolved, and the cascading moonlight grew stronger, as if a river were pouring down into Meng Hao’s body. Although their effectiveness was waning, his fourth Dao Pillar was now just a hair away from being complete.</p><br/><p>Just as the Dao Pillar was about to appear in full, Meng Hao’s suddenly sensed an inexplicable roaring within his body. His expression flickered as he realized that his body was starting to wither, as if his flesh and blood and life force, even his Cultivation base, were being sucked into the fourth Dao Pillar.</p><br/><p>He had just unlocked another of the secrets of the Perfect Foundation. It was with unbridled power that the fourth Dao Pillar began of its own will to suck in everything into it.</p><br/><p>It seemed that the fourth Dao Pillar would form at any cost, even if it caused the death of Meng Hao!</p><br/><p>His face flickered at this sudden turn of events. He had never imagined that something like this would happen. It was at this exact moment that the lightning mist finally collapsed under the attack of the ten Foundation Establishment Cultivators. They rushed in.</p><br/><p>Meng Hao eyed them approaching, his face grim. His body was withering, and his life force was trickling away. The hair on his head had already begun turning white. His Cultivation base was still there, though. Suddenly, an early Foundation Establishment Cultivator appeared in front of him. Before the man could react, Meng Hao’s hand shot out and grabbed him by the throat. He squeezed, and the Cultivator’s eyes filled with disbelief. The man’s neck shattered.</p><br/><p>Even as he died, Meng Hao’s body trembled, and his eyes filled with a strange light. The man’s corpse suddenly began to shrink and wither. Within the blink of an eye, it was a mere skeleton. The man’s Cultivation base rushed in through Meng Hao’s hand and entered the fourth Dao Pillar.</p><br/><p>“So that’s how it is!” Meng Hao’s eyes grew brighter. “I have a perfect Foundation, but when my first three Dao Pillars formed within the Blood Immortal Legacy tournament, there was more than enough spiritual energy to absorb, so I couldn’t even sense the potency of the Dao Pillars. But now, things are clear. After reaching a certain point, the fourth Dao Pillar reaches a phase in which only death can stop its progress. When this happens, it will even consume my own life force. The reason is because it can’t absorb spiritual energy from the outside world, only from my flesh and blood!</p><br/><p>“Perfection. Perfection is so potent! But such potency is also a weapon. I’ve been rejected by the Heavens. Therefore, I must plunder from the living! The bodies of Cultivators are filled with spiritual energy that does not belong to heaven and earth! Therefore, it can be pillaged away! Now I understand. It seems that in the future, it will be like this every time I form a new Dao Pillar!</p><br/><p>“Today… my fourth Dao Pillar will appear!”</p><br/><p>These thoughts ran through Meng Hao’s head in an instant. He loosened his grip, then looked around at the surrounding Cultivators, his eyes radiating icy cold. His body flashed as he shot toward them.</p><br/><p>Miserable screams rang out. All of these people had Cultivation bases at the mid Foundation Establishment level at the highest; most were at the early Foundation Establishment stage. Could they possibly match up against Meng Hao? As Meng Hao passed each person, his hand would snake out, and with no effort on his part, the fourth Dao Pillar would feed, thirstily sucking in energy.</p><br/><p>Body after body turned into bones. Before the death of each Cultivator, their Cultivation base would be sucked rapidly into Meng Hao, consumed by his Dao Pillar. Soon, Meng Hao was no longer withered, and his flesh and blood began to rebuild.</p><br/><p>As Xiao Chang’en observed this happening, dread appeared on his face. The Cultivators who had moments ago been charging forward, suddenly began to retreat at high speed.</p><br/><p>In their eyes, Meng Hao was no Cultivator; he had transformed into some type of evil demon. Wherever he passed, blood-curdling screams could be heard, and he left behind only ragged corpses. Their minds reeled, and expressions of unbridled horror appeared on their faces.</p><br/><p>“What magic is this!?!?”</p><br/><p>“What is he doing!?!?”</p><br/><p>“This guy… he’s sucking up the life and Cultivation bases of all those dead Fellow Daoists!?!?”</p><br/><p>The remaining twenty or so Cultivators were scared witless and retreated in chaos. Meng Hao caught up with one of them. As he placed his hand on the crown of the man’s head, a blood-curdling scream echoed out. His body began to shrivel, and then he died.</p><br/><p>Meng Hao’s face was no longer pale and bloodless; it was now ruddy and filled with life. He took a deep breath, and in his mind he suddenly recalled the scene in Patriarch Reliance’s Immortal’s cave, when Patriarch Reliance had absorbed the Core Formation Cultivators [1. To revisit the scene of Patriarch Reliance using the Great Art of Demonic Life, check out Chapter 82: The Great Art of Demonic Life].</p><br/><p>“The Great Art of Demonic Life?” thought Meng Hao, his eyes flickering. It seemed that what he was doing now was very similar indeed to the Great Art of Demonic Life that Patriarch Reliance had used. “Or perhaps this is some type of enlightenment that comes from being in a kill or be killed situation. The Great Art of Demonic Life. Demonic Life….” Meng Hao sighed inwardly as he suppressed his deeply-ingrained Confucian way of thinking. His body flickered with the power of the fourth Dao Pillar. He sighed as his hand clasped around the throat of another Cultivator. The fourth Dao Pillar sucked in the man’s Cultivation base. Soon, the fourth Dao Pillar would complete its circle and be complete.</p><br/><p>“The path of my Perfect Foundation will be strewn with mountains of corpses and seas of blood. I… understand.” He sighed again, and yet continued forward without hesitation. His heart did not grow soft. Confucianism would always exist within him, and he would never be truly merciless. However, when the circumstances required, he could act without mercy.</p><br/>\n</div>"}