{"title": "Chapter 172: Charging into mid Foundation Establishment!", "id": 172, "volume": 2, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-172-charging-into-mid-foundation-establishment", "volume_title": "Volume 2", "body": "<h1>Chapter 172: Charging into mid Foundation Establishment!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 172: Charging into mid Foundation Establishment!</strong></p><br/><p>Within the Xiao Clan mountain village, Xiao Chang’en’s face was filled with enthusiasm as he gazed at Meng Hao. His fellow clansmen stared with similar fanaticism. Meng Hao nodded toward them, but said nothing. He entered his shielded room next to the lake, holding Sang Luo by the neck. The lightning mist appeared.</p><br/><p>He sat down cross-legged and loosened his grip on Sang Luo. He didn’t fight back, but instead stood there pale-faced in front of Meng Hao, a look of respect shining in his eyes. Inside, however, he was nervously waiting for his older brother to arrive and save him. His tiny eyes darted around, eventually falling upon the hat, which still stood next to the lake. He heard the hat’s garrulous voice, but didn’t dare to stare. He suddenly got the feeling that this place was incredibly bizarre, even more ghastly than his own remote, lonely mountain.</p><br/><p>Meng Hao looked at Sang Luo for a moment, trying to decide what to do with him. Finally, he lifted his hand into the air and made a grasping motion. The aura emanating from Sang Luo’s body condensed into Meng Hao’s palm. It seemed invisible, but to Meng Hao, it was very prickly and irritating in nature.</p><br/><p>He frowned, looking closer at the aura. His eyes flickered.</p><br/><p>“Could this be Demonic Qi….?” he murmured to himself. He let the aura disperse, and then looked closely over Sang Luo. Sang Luo felt goosebumps underneath Meng Hao’s gaze.</p><br/><p>“Fellow Daoist….” he said, but was interrupted by Meng Hao.</p><br/><p>“There’s an evildoing Cultivator here who needs to be converted….” he said and then coughed lightly. Hearing this, Sang Luo gaped in astonishment. Suddenly, the meat jelly, which had been talking to the fish in the lake just now, leaped up and seemed to stare fixedly at Sang Luo.</p><br/><p>“Who? Who is it?” said the meat jelly excitedly, rushing over. “You? My poor evildoer, you can’t do that! It’s immoral. In the name of Justice, allow me to convert you….” Before Sang Luo could even react, Meng Hao flicked his sleeve, pushing him backward and snatching his bag of holding. At the same time, the black net shot out and wrapped up Sang Luo tightly.</p><br/><p>Then Meng Hao shot backward, putting some space between himself and Sang Luo, who watched stupefied as all of this happened. At that instant, the meat jelly hat landed onto Sang Luo’s head.</p><br/><p>It sighed. “Child, there’s no need to fear. Just behave, and allow the mighty embodiment of Justice to lead you back from the path of wickedness….” It seemed to be fairly leaping with excitement. “What a well-behaved little child. There’s no need to resist, no need fight back, no need to feel perplexed. I will help you. Listen, the first thing you need to do is….” As the meat jelly prattled on, Sang Luou’s body began to tremble. However, he didn’t dare to fight back.</p><br/><p>Meng Hao felt a bit sorry for Sang Luo. He erased the branding within Sang Luo’s bag of holding. When he opened it, his eyes shined brightly. There was quite an accumulation of Spirit Stones inside, many times more than that which had been given to him by the Xiao Clan.</p><br/><p>“This should be just about the amount I need for duplication purposes. Plus, I have a handful of bags of holding that I acquired in the Black Sieve Sect’s Blessed Land. There are a few Sieve Earth Pills in those. Not many, but a few.” He waved his hand, causing the lightning mist to condense so that no one in the area could see inside. Then, he pulled out the copper mirror and began to duplicate.</p><br/><p>Time passed, and soon dusk fell. From outside the lightning mist, enraged shouting could be heard coming out of Sang Luo’s mouth. It seemed to be filled with an indescribable torment and misery.</p><br/><p>“Be quiet! Let me go! Aaahhhhhh! You damned hat! Shut up!!”</p><br/><p>“Ai, don’t be like that, child. You know… you interrupted me. I forgot where I left off. Oh well, I’ll just start over. Listen well, okay? The path of evil is filled with thistles and thorns. But don’t worry, child, I’m here. I definitely will not allow the thistles and thorns to stab into your tender buttocks….”</p><br/><p>Meng Hao glanced outside, feeling a bit sympathetic for Sang Luo. Then he looked down at the several dozen or so Sieve Earth Pills in front of him. He took a deep breath, and then picked one up and placed it into his mouth.</p><br/><p>It dissolved as soon as it entered, turning into a wave of spiritual power that Meng Hao had not felt enter his body in a long time. His body was like a parched desert suddenly inundated with nourishing water; his face lit up, and he closed his eyes to begin doing breathing exercises.</p><br/><p>Slowly, he filtered out the sounds of the outside world and sank into Cultivation. One pill. Two pills. Three pills…. As he swallowed the pills, beams of moonlight in the night sky began to twist and turn. The descended down toward the earth, and onto Meng Hao.</p><br/><p>From a distance, it had the appearance of a massive sheet of silk descending upon the Xiao Clan.</p><br/><p>The Sieve Earth Pill really did deserve to be called a divine pill of the Black Sieve Sect, and one of the five most effective pills in the Southern Domain for the Foundation Establishment Stage. It was powerfully effective, much more so than Meng Hao had imagined. When he put the seventeenth pill into his mouth, his body instantly began to shake. The indistinct image of a rapidly congealing fourth Dao Pillar was suddenly visible inside him. When it was complete, Meng Hao’s Cultivation base would have broken through to the mid Foundation Establishment stage!</p><br/><p>He took a deep breath, frowning as he looked up at the shining waterfall of moonlight above him in the sky.</p><br/><p>“It’s really a bit too conspicuous. This is an amazing pill, but it’s definitely going to attract a lot of attention….” There was nothing to do about it, however. The only thing he could do was try to break through as quickly as possible, form the fourth Dao Pillar and reach mid Foundation Establishment. He took a deep breath and picked up the eighteenth Sieve Earth Pill. When he placed it into his mouth, his three Perfect Dao Pillars trembled, sucking in boundless spiritual power. The fourth Dao Pillar was rapidly becoming solid.</p><br/><p>Outside, in the darkness of the night, the sheets of moonlight had indeed attracted attention within the Xiao Clan. Xiao Chang’en might be nearing the end of his longevity, but his eyesight was sharp. His eyes narrowed, and he immediately moved over to the shielded area within which Meng Hao was practicing Cultivation. He sat down cross-legged to keep guard.</p><br/><p>Meng Hao had showed great kindness to the Xiao Clan. Xiao Chang’en knew that after his own death, the only chance for his clan to survive had to do with Meng Hao. Therefore, he had resolved that no matter what, he would not allow Meng Hao’s Cultivation to be disturbed.</p><br/><p>Meanwhile, outside the Xiao Clan, the sheets of moonlight had caused quite a stir in the various Cultivation Clans in the area. More than a few people flew up into the air to investigate the area where the moonlight was cascading onto.</p><br/><p>This was especially true of Sang Luo’s older brother, the blue-robed young man. He flew along together with the white-robed youth. They flew through the air unhurriedly. It seemed as if they weren’t going very fast, but in fact, they shot forward several hundred meters with each burst of flight.</p><br/><p>When they saw the falling sheets of moonlight, the white-robed youth’s eyes narrowed. The blue-robed young man frowned.</p><br/><p>“That appears to be the same place where Sang Luo is….”</p><br/><p>“Interesting. Someone in Blood Demon Sect territory is consuming a Sieve Earth Pill from the Black Sieve Sect. And from the look of it, more than one pill…”</p><br/><p>At this exact moment, deep in a forested region some distance from the Xiao Clan, was an enormous tree. Within the tree was a group of ten Cultivators sitting closed-eyed in meditation. Each member of this group had a sword strapped to his back, and they all wore identical clothing. It was very quiet; not a crow or sparrow could be heard. But when the sheets of moonlight appeared, the ten people opened their eyes to look at it.</p><br/><p>Chen Fan was among the group. He looked off into the distance, frowning. Hushed discussion immediately broke out among these Cultivators, all of whom were all disciples of the Solitary Sword Sect.</p><br/><p>“That area is near the border of the Blood Demon Sect. What is that phenomenon…?”</p><br/><p>“That’s the sign of someone consuming a Sieve Earth Pill from the Black Sieve Sect. It can’t be covered up. Someone in that area must be consuming medicinal pills.”</p><br/><p>“Just how many pills did that person consume? That amount of moonlight is shocking….”</p><br/><p>Within the Xiao Clan manor, Clan members all began to grow nervous, as if they were about to face up against a powerful foe. The past days had been a mixture of both pleasant surprises and horrifying dread. Once and again, they had faced extermination as a clan, and repeatedly had been saved. As of this moment, their hearts pounded. This was especially true when they saw the conspicuous cascading moonlight. It only served to cause them more anxiety and nervousness.</p><br/><p>Xiao Caifeng was pale faced. She had a talent for talismans, but was hindered by her Cultivation base, and couldn’t fully employ their power. She could only stand off to the side, silently watching Xiao Chang’en sitting cross-legged as he guarded over Meng Hao.</p><br/><p>Not much time passed before beams of multi-colored light filled the night sky, screaming toward the Xiao Clan from all directions. From the look of it, there were at least ten figures. They floated there in the sky, eyes glittering as their gazes fell onto the Xiao Clan, and Meng Hao’s secluded meditation area, upon which poured sheets of moonlight.</p><br/><p>An old man of the early Foundation Establishment stage approached, laughing loudly. “Interesting. I think I’ll just have to see who exactly is in secluded meditation, causing such a scene.” From his expression, it was clear he did not have good intentions. Greed flickered in his eyes. Obviously, he intended to disturb the meditation and snatch away the luck of whoever sat within.</p><br/><p>It seemed everyone in the area had similar plans; the Xiao Clan was by no means weak. However, the Xu Clan was not the only one in the area who had coveted the lake. Many of the surrounding clans had eyed it like a tiger eyeing its prey.</p><br/><p>The newly arrived Cultivators watched the old man as Xiao Chang’en looked up at him. The power of Xiao Chang’en’s Cultivation base suddenly exploded out. He took a deep breath and shot up into the sky.</p><br/><p>A boom rang out, and the old man spun backward out of control, coughing up some blood along the way. Xiao Chang’en’s face looked deathly pale as he hovered in the air, glaring around.</p><br/><p>“I, Xiao Chang’en, already have one foot in the coffin,” he said coolly. “Life and death mean little to me. Anyone who wishes to tread the path of death with me, please, step forward.” His Cultivation base was not incredibly high, but his words contained a powerful threat.</p><br/><p>Underneath the shield, the growth of Meng Hao’s Cultivation base had reached a critical juncture. As he continued to consume the Sieve Earth Pills, his fourth Dao Pillar was more than half solidified. It wouldn’t be long before it was complete. When that happened, Meng Hao would not be infinitely more powerful than before, but he would be able to sweep effortlessly across the Foundation Establishment stage!</p><br/><p>That was the power of a Perfect Foundation!</p><br/>\n</div>"}