{"title": "Chapter 184: Seven Exterminations", "id": 184, "volume": 2, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-184-seven-exterminations", "volume_title": "Volume 2", "body": "<h1>Chapter 184: Seven Exterminations</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 184: Seven Exterminations</strong></p><br/><p>This man named Li had no way to know how famous Meng Hao was in the State of Zhao, nor about the iron spear which was still located within the Violet Fate Sect….</p><br/><p>Meng Hao’s body flickered as he shot toward Li. He lifted his right hand and flashed an incantation sign; immediately, a Flame Dragon roared out.</p><br/><p>It wasn’t very large, only about thirty meters long, and its color was not normal. Instead of being the color of fire, it was dark, and had two flapping wings. This was obviously a Flying Rain-Dragon.</p><br/><p>Power from Meng Hao’s Cultivation base was congealed inside of it, and not a drop seeped out. Only someone significantly more powerful than Meng Hao, someone of a higher stage, would be able to sense the slight fluctuations of the Cultivation base power within it.</p><br/><p>From the look of it, it really did seem to be something that would be produced by the power of mid Foundation Establishment, or perhaps even inferior to that.</p><br/><p>Sneers filled the faces of the Cultivators outside the Battle Arena. They were clearly very amused by the whole scene.</p><br/><p>Chen Fan groaned inwardly. He didn’t say anything, but his eyes were dull as he thought, not about his flying dagger, but the fact that this was a Battle Arena, and there was no way to tell what deadly moves Li might use.</p><br/><p>Zhou Shanyue watched on, a smile covering his face. He looked exceedingly pleased. He had never liked Chen Fan, not from the very beginning when his father had brought him back to the Solitary Sword Sect. He felt that his father treated him far too well for the outsider that he was.</p><br/><p>As for the flying dagger that had been given to Chen Fan, Zhou Shanyue thought of it as his own. How could it be given to someone else? And how come he wasn’t a member of the current generation of the Seven Solitary Sword Sons?</p><br/><p>He didn’t understand, but also didn’t dare to complain to his father. This caused his enmity toward Chen Fan to grow stronger and stronger.</p><br/><p>“Finally I have a chance today!” he thought. “Chen Fan, ahh, Chen Fan, the flying dagger will finally belong to me. You trifling nobody. Do you really dare to contend with me?!” A smile broke out on his face, and he laughed.</p><br/><p>Back within the Battle Arena, Li also laughed. A haughty look covered his face as he watched Meng Hao’s Flame Dragon speeding toward him. He sneered.</p><br/><p>“A barbarian Cultivator from a backwater Sect,” he said loftily. “You don’t deserve to even be here. Your magic is so simple! You really dare to use a trifling Flame Dragon art? Even being restricted to the mid Foundation Establishment stage, I can still kill you with ease.” He flicked his sleeve, and the power of his mid Foundation Establishment stage boiled out. He raised his hand and the illusory image of a sun and a moon appeared on either side of his palm.</p><br/><p>The images of the sun and moon transformed into two gleaming sword auras. Li waved his hand and they shot screaming into the air, straight toward the incoming Flame Dragon.</p><br/><p>A cheer rose up from the surrounding Cultivators when they saw this.</p><br/><p>Of course, all of this takes some time to describe, but happened in an instant. The images of the sun and moon swords slammed into the Flame Dragon, and as they did, for some unknown reason, they began to twist and warp.</p><br/><p>A bang exploded out as the moon sword pushed up against the Flame Dragon. It seemed like it was trying to move a mountain. The sword instantly collapsed to pieces. Before the pieces could float away, they were transformed into ash by the heat of the Flame Dragon.</p><br/><p>At the same time, the sun sword also collapsed. The thirty meter long Flame Dragon didn’t even seem to have been scratched. Its momentum increased as it shot toward Li.</p><br/><p>As it shot forward, its body expanded. Thirty meters, ninety meters, one hundred and fifty meters… in the blink of an eye, it was three hundred meters long and growing!</p><br/><p>A mysterious power emanated out from the Flame Dragon, forming into a monstrous Flame Sea. This was the aura of the Flame Dragon. Its massive wings spread out to cover the sky, causing the Battle Arena to be submerged in flame.</p><br/><p>All of this occurred too quickly, and middle-aged Li could not possibly have predicted that it would happen. It was the same with Zhou Shanyue, as well as all the surrounding Solitary Sword Sect disciples, who watched on with stunned faces.</p><br/><p>A roaring sound filled the air, and the Battle Arena shook. The shield covering the Battle Arena rippled as it held back the power.</p><br/><p>At the same time as the roaring sounded out, Meng Hao suddenly shot forward, attacking as fast as lightning. Li’s face went white, and filled with an expression of disbelief. Nine jade slips appeared and floated around him, emanating a protective energy which defended him from the massive power of the Flame Sea.</p><br/><p>These nine jade slips were clearly extraordinary in their protective power. However, Meng Hao continued to shoot toward him like an arrow. In an instant, he slammed into the shield generated by the nine jade slips.</p><br/><p>Another boom resonated out, along with a miserable shout. The onlookers watched on, dumbstruck as the flames began to die out. Li spun backward like a kite with its string cut, blood shooting out of his mouth, his eyes filled with shock. He cut a sorry figure.</p><br/><p>Meng Hao emerged from the Flame Sea, his face calm. He smiled, and still had the shy look on his face.</p><br/><p>Zhou Shanyue gasped when this happened, and then stared in shock. Chen Fan blinked his eyes, looking at Meng Hao with disbelief.</p><br/><p>Amidst the silence of the shocked audience, middle-aged Li’s body stopped moving. A grim expression appeared on his face, and then he pushed down on his forehead.</p><br/><p>Suddenly, his body quivered and then filled with the power of the great circle of Foundation Establishment. Pseudo Core stage power immediately exploded out from him.</p><br/><p>This power was far, far beyond what he had exhibited moments ago. His eyes radiating killing intent as he watched Meng Hao striding out from within the Flame Sea. A haughty look once again filled his face.</p><br/><p>“You seem qualified to be slain by the true power of my Cultivation base!”</p><br/><p>Meng Hao’s expression was the same as ever. He smiled shyly, but said nothing. Seeing the smile, Li felt a strong feeling of abhorrence. He shot forward, his hand lifting toward his bag of holding and retrieving a sword.</p><br/><p>The azure-colored sword spun rapidly above his head, forming the shape of a whale. It sucked in the power of Li’s late Foundation Establishment stage power, whereupon a buzzing sound filled the air. Ghost images of the sword suddenly appeared, seven of them!</p><br/><p>The buzz of conversation filled the air.</p><br/><p>“Seven Exterminations! Elder Brother Li is using a killing move!!”</p><br/><p>“That’s one of the most powerful stances of Foundation Establishment, a profound magic of the Seven Solitary Sword Sons….”</p><br/><p>Chen Fan’s expression twisted. “Solitary Sword Seven Exterminations!” He was about to take a step forward when Zhou Shanyue laughed and stretched out his arm to block the way.</p><br/><p>“Junior Brother Chen, it’s prohibited to interfere with matches in the Battle Arena. You’re not going to break Sect rules are you?”</p><br/><p>As the observing Solitary Sword Sect disciples discussed the proceedings, within the Battle Arena, Li’s hair whipped about wildly. He flashed incantation gestures, causing a cyclone to spring up. The cyclone merged with the azure sword, and a roaring sound filled the air. A vicious expression appeared on his face as he waved a finger.</p><br/><p>The azure sword seemed to split the air as it shot with incredible speed toward Meng Hao.</p><br/><p>This attack was one of the most powerful moves from a Cultivator of the great circle of Foundation Establishment, as well as one of the most powerful arts of the Solitary Sword Sect. For Li to use it in this situation made it clear that he intended to strike a fatal blow!</p><br/><p>“I plan to use this magic to win a place among the Seven Sons. Today… I’ll christen it with your head!” His sinister voice echoed out as the sword screamed forward. The sword and its seven ghost images bore down onto the Meng Hao….</p><br/><p>A smile appeared in Meng Hao’s eyes.</p><br/><p>“In terms of magical techniques, I’m still a bit deficient….” he muttered to himself. He suddenly struck his hand forward. Immediately, everything began to shake, and the approaching sword suddenly stopped.</p><br/><p>Meng Hao then took a step forward and struck his hand out a second time, then a third and a fourth time. Each time he did, he took another step. By the time he reached the fifth strike, he was upon the sword. The ground quaked as the massive image of an illusory hand appeared in front of Meng Hao. It shot toward the sword. [1. In case you forgot the origin of the technique Meng Hao is using, you can check out Chapter 149: Killing Intent!, as well as the chapter after that.]</p><br/><p>At the same time, Meng Hao’s Spiritual Sense burst out. When he was in the early Foundation Establishment stage, his Spiritual Sense could shock late Foundation Establishment Cultivators. But now he had an additional Dao Pillar, which made him even more powerful. The Spiritual Sense merged into the giant illusory hand. When the hand slammed into the azure sword, a massive bang rang out.</p><br/><p>The azure sword shook. One by one, the ghost images surrounding it popped and disappeared. All of this takes some time to describe, but happened in an instant. The ghost images of the swords disintegrated, and then cracks began to cover the surface of the sword itself.</p><br/><p>The illusory hand passed through the sword and then continued on toward Li. There was no way for him to dodge it, so it slammed directly into his body.</p><br/><p>Blood sprayed from his mouth, and he staggered backward, his face pale. Meng Hao’s fifth step placed him directly next to the azure sword. He reached up and pushed against it.</p><br/><p>A cracking noise sounded out and the sword… split completely in half.</p><br/><p>“You lose… Now pay up,” said Meng Hao. He flicked his sleeve, sending the two pieces of the azure sword flying away to land at the feet of Li. Li’s face was deathly pale, and he coughed up another mouthful of blood. His aura seemed to have weakened. He looked at Meng Hao, a look of disbelief and bitter anguish covering his face.</p><br/><p>He… had lost!</p><br/><p>-----</p><br/><p><em>This chapter was sponsored by Hein Haugeberg</em></p><br/>\n</div>"}