{"title": "Chapter 187: Good Old Fatty", "id": 187, "volume": 2, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-187-good-old-fatty", "volume_title": "Volume 2", "body": "<h1>Chapter 187: Good Old Fatty</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 187: Good Old Fatty</strong></p><br/><p>“Meng Hao!” thought Wang Tengfei, his eyes instantly shining with a mysterious glow. He felt a sudden stab of pain from the index finger of his right hand. The finger was pitch black, and inside, a pulsating black aura could be seen.</p><br/><p>Seeing Meng Hao here was not something Wang Tengfei had ever imagined would happen. Many years had passed, but he recognized him immediately. This was that damned Cultivator from the State of Zhao who had stolen away his legacy and wrecked all of his meticulously laid plans!</p><br/><p>As soon as he saw Meng Hao, Wang Tengfei’s breath quickened. He had assumed that Meng Hao disappeared along with the State of Zhao. How could he have predicted that he would suddenly appear here? Furthermore, he was in a group from the Solitary Sword Sect. Many thoughts ran through his head during the space of a few breaths. Then he recovered his composure and looked away.</p><br/><p>“Since he’s here,” thought Wang Tengfei, “I’ll have to find an opportunity to sacrifice him to my poison finger.” His expression calm, he slowly began to exhibit the same disregard for Meng Hao that he had years ago. It was as if he would eternally be above Meng Hao. It didn’t matter if they were in the State of Zhao or the Southern Domain. He didn’t care at all about Meng Hao. He was a member of the Wang Clan. He was Chosen. He was superior, and as for Meng Hao, it didn’t matter what relationship he had with the Solitary Sword Sect. To him, Meng Hao was nothing more than an insect.</p><br/><p>He had perfect good looks and a flawless temperament. He stood there, slowly becoming the center of attention. He smiled lightly, his expression indifferent. The disregard for Meng Hao which existed in his heart slowly transformed in to scorn and arrogance. He tilted his head up, and it appeared, for all intents and purposes, that Meng Hao was nothing to him and could be crushed on a whim.</p><br/><p>At the same time, Wang Xifan frowned slightly. He looked at Meng Hao again, and a mysterious look appeared in his eyes. A smile tugged at the corners of his mouth. It was a smile similar to Wang Tengfei’s, filled with scorn in disregard.</p><br/><p>Now he remembered the scene from years ago. He remembered this ant that he almost crushed on the top of the East Mountain of the Reliance Sect, only to be stopped by He Luohua.</p><br/><p>“Interesting,” he said with a chuckle. His words did not echo out, and could only be heard by Wang Tengfei. “So, we once again run into this insolent kid. Tengfei, now is your chance to conclude matters from all those years ago. Kill him, and prove that everything I’ve told you is true. You are Chosen, and he is nothing more than an insect.”</p><br/><p>Wang Tengfei smiled. “I’ve long since stopped thinking about the things that happened that year,” he said coolly. “However, I really should take his head.” He looked at Meng Hao once again, and his eyes brimmed with confidence in his ability to kill him. It would be as easy as turning over his hand. He looked away, ignoring Meng Hao and staring off into the distance. He appeared thoughtful once again, as if he were wrestling with some matter in his heart.</p><br/><p>“Don’t overthink things,” said Wang Xifan, his voice low. “You need to trust Chu Yuyan.”</p><br/><p>Wang Tengfei was quiet for a long moment, then growled, “If I ever find out who it was, I’ll tear him into a thousand pieces!!” His eyes were filled with cold, callous hatred, as well as humiliation. Killing intent roiled out of him, much more intense than when he had seen Meng Hao. This matter was something he could not ignore, something he could not cool down from.</p><br/><p>Meng Hao’s expression was the same as ever. Seeing Wang Tengfei here wasn’t completely unexpected. However, it naturally caused various emotions to bubble up within him.</p><br/><p>The enmity between him and Wang Tengfei was not something he cared much about any more. Years had passed, and as of now, Meng Hao actually felt that he had been a bit too hot-blooded in his youth. There were definitely some areas in which he was in the wrong.</p><br/><p>Now, Meng Hao’s Cultivation base was at the mid Foundation Establishment stage, and his battle prowess put him in the same league as Dao Children, although few people knew that. In Meng Hao’s estimation, if he could defeat Wang Tengfei when in the Qi Condensation stage, then nowadays it wasn’t even worth thinking about.</p><br/><p>What concerned him most was the Song Clan’s search for a husband, and the Cubic Pearl that Eccentric Song had mentioned moments ago. It could dispel the strangest poisons in the world, and that made Meng Hao’s heart palpitate with eagerness.</p><br/><p>He wasn’t sure if the Cubic Pearl could dispel the poison of the Resurrection Lily, but considering the Song Clan was offering it up as a prize, it was surely no ordinary object.</p><br/><p>“I wonder if it really can dispel the poison…. If it can, then maybe I won’t need to infiltrate the Violet Fate Sect after all. Staying in the Solitary Sword Sect wouldn’t be bad.” His heart pounded in anticipation. As he traveled the path of Cultivation, his next big hurdle would be Core Formation. That was a difficult bridge to cross, and joining a powerful Sect would surely help.</p><br/><p>After a long moment of thought, his eyes filled with determination.</p><br/><p>Up above, Eccentric Song, Elder Fan, and the Nascent Soul Cultivator from the Wang Clan turned into beams of prismatic light that shot toward the darkness which surrounded the Song Clan.</p><br/><p>Two other Song Clan members had come out with Eccentric Song. They split, one walking toward the Solitary Sword Sect’s group, the other to the Wang Clan’s group.</p><br/><p>They clasped hands and bowed. Smiling, they said, “Fellow Daoists of the Solitary Sword Sect and Wang Clan, please follow us. We will enter the mountains of the Song Clan together.”</p><br/><p>Everyone flew up into the air. Various members of the Solitary Sword Sect and the Wang Clan were obviously acquainted. The two groups merged into a larger group. Talking and laughing could be heard as they transformed into beams of light and shot toward the Song Clan.</p><br/><p>Meng Hao and Chen Fan were on the edge of the group, some distance away from the Wang Clan Cultivators. Wang Tengfei flew along, expression cold. He frowned, apparently too busy being lost in thought to pay any attention to Meng Hao.</p><br/><p>They flew at high speed, and very soon reached the area where the brightness of the outside world gave way to the darkness of the Song Clan. The instant they entered, Meng Hao’s heart leaped. He had just discovered a major difference between the outside world, and the Song Clan. The spiritual energy here… could be felt and absorbed!!</p><br/><p>This unexpected turn of events shook Meng Hao’s mind and heart. Of course, after all his years of practicing Cultivation, he was able to prevent his feelings from showing on his face. His expression was the same as ever.</p><br/><p>“So it turns out… I can absorb spiritual energy in this place! This is the perfect location for me to practice Cultivation!” This discovery exceeded the entirety of Meng Hao’s imagination. He was just preparing to rotate his Cultivation base and begin to absorb spiritual energy when a thought flashed through his mind, and he stopped.</p><br/><p>One of the tools which Meng Hao had developed after escaping all the various snares and traps throughout the years, was caution. Therefore, he would be cautious here, too.</p><br/><p>He looked around and soon began to pick up on some clues. As the Solitary Sword Sect disciples flew forward, frowns appeared on their faces.</p><br/><p>“So, we can’t absorb the spiritual energy here…” Chen Fan whispered to him. “I heard before that the Song Clan is strange, and that certainly seems true. Apparently, only members of the Song Clan can do breathing exercises here to absorb spiritual energy. Other Sects and Clans are unable to. It’s not that spiritual energy is forbidden here, it’s that we can’t absorb it.”</p><br/><p>A bit more time passed. Seeing all the mountains and cities filled with Cultivators pass by beneath him, Meng Hao was filled with a sense of mystery. After passing scores of mountains, they reached the Song Clan’s capital city.</p><br/><p>Within the capital city was an enormous square. Already, many Cultivators from outside the Song Clan had arrived there. Present were members of the Golden Frost Sect and the Blood Demon Sect.</p><br/><p>The place was alive with activity, and the hubbub of conversations filled the air.</p><br/><p>Even before the Solitary Sword Sect and Wang Clan Cultivators could land, a loud voice drifted up into the air. “It’s absolutely, one hundred percent true. I, Zhou Daya [1. Zhou Daya, of course, is the guy who saw Meng Hao and Chu Yuyan together, which happened in Chapter 136: Zhou Daya!], saw everything with my own eyes. That day, Chu Yuyan wasn’t wearing proper clothing. She was wearing a man’s garment! Furthermore, she seemed to be on very intimate terms with the male Cultivator. You all don’t believe me? I, Zhou Daya, swear an oath that if my words are in any way false, you can gouge my eyes out!”</p><br/><p>The person talking was a young Cultivator. He was speaking so passionately that spit flew out of his mouth. He gazed at the surrounding Song Clan members with exuberant, shining eyes. As he spoke, he gesticulated wildly and jumped up and down. The dozens of surrounded Song Clan members watched on in astonishment.</p><br/><p>The Cultivators from the Blood Demon Sect were situated off to the side. They sat there quietly, cross-legged, and in their midst was a Li Shiqi [2. Li Shiqi is the Blood Demon Sect Dao Child who appeared in Chapter 175: Li Shiqi], dressed in a white robe!</p><br/><p>Sitting cross-legged next to Li Shiqi were two people. One was Sang Luo’s brother, and the other was none other than Wang Youcai [3. Wang Youcai was one of the group of four young people brought to the Reliance Sect in Chapter 1. The others in the group were Meng Hao, ‘Fatty’ Li Fugui, and ‘Little Tiger’ Dong Hu. Wang Youcai’s last appearance was in Chapter 130: The Perfect Foundation!!]!</p><br/><p>Wang Youcai was looking quietly at the group of people from the Golden Frost Sect. In their midst was a rather fat fellow whose face had a few pimples on it. He wasn’t very tall, and at the moment he was smiling complacently at Zhou Daya. This was none other than Li Fugui.</p><br/><p>When the two of them had run into each other earlier, Fatty found, to his surprise, that Wang Youcai responded coldly to his attempts to start a conversation and even pretended not to know him. At the moment, he wasn’t sure what to think, and could only sigh inwardly.</p><br/><p>“You simply can’t imagine the expression on Chu Yuyan’s face,” continued Zhou Daya. “I guess you can only say that it was wonderful. And that male Cultivator, well, he was extraordinarily handsome, a dragon amongst men. Really. They embraced each other and exchanged some sweet words. As their hands groped each other frantically, they began to pant….” As he spoke, Zhou Daya got more excited.</p><br/><p>Li Fugui suddenly cleared his throat and spoke out in a loud and clear voice. “I can bear witness to this,” he said, “as I was also present. Ai, at first I planned to go give them a piece of my mind. As all of you Fellow Daoists are well aware, Fellow Daoist Chu Yuyan is the beloved of Fellow Daoist Wang Tengfei. And of course, Fellow Daoist Wang Tengfei and I are the closest of friends.</p><br/><p>“Therefore, when I saw what was happening, I wanted to speak my mind. However…. Ai, you have no way to know how the two of them looked. It was clear that the feelings between them, were true love.” As his voice rang out, the faces of the Song Clan members all filled with strange expressions.</p><br/><p>They knew Fatty, of course. He was a member of the Golden Frost Sect that no one dared to provoke. He was a treasure of the Sect, and as such, his level of seniority was extremely high. Anyone who offended him would arouse the wrath of the entire Golden Frost Sect. To do so would be similar to rubbing a cat’s hair backward.</p><br/><p>This was because the Golden Frost Sect had eighteen bloodline legacies. By combining their power, the Sect could wield the power of a great Dao Reserve spell. According to the rumors, the power of this spell was so incredible that it could slay Immortals!</p><br/><p>However, for many years, the Sect only possessed seventeen of the bloodlines. The last one had disappeared, and no matter how hard the Golden Frost Sect searched, it could not be found. There was no one who the legacy could be passed onto. Therefore, for many years, the ultimate power of the Golden Frost Sect’s spell could not be unleashed. However, it turned out Li Fugui was perfectly suited to accept the legacy. Therefore, he was treated as a treasure of the Sect. Usually, the Sect Priest would treat him very amiably and was very protective of him. You could essentially say that the entire Sect was at his beck and call.</p><br/><p>Furthermore… Fatty didn’t like to practice Cultivation, nor did he want an assigned Dao Protector. So to protect him….</p><br/><p>Whenever he went out, a large group of Golden Frost Sect disciples would accompany him. The Sect was extremely worried that something might happen to him. The most extreme thing that had happened was that once after someone provoked Li Fugui, the Sect Priest personally slaughtered an entire Sect. Afterwards, he issued a proclamation in the Southern Domain that anyone who dared to even touch Li Fugui would provoke the unbridled fury of the entire Golden Frost Sect.</p><br/>\n</div>"}