{"title": "Chapter 217: Struggling for Plant Mastery", "id": 217, "volume": 3, "url": "http://boxnovel.org/i-shall-seal-the-heavens-chapter-217-struggling-for-plant-mastery", "volume_title": "Volume 3", "body": "<h1>Chapter 217: Struggling for Plant Mastery</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><span style=\"\"></span></p><br/><p><strong>Chapter 217: Struggling for Plant Mastery</strong></p><br/><p>All thirty thousand apprentice alchemists were respectful and solemn. Quite a few had full heads of white hair. Other than Meng Hao, not a one appeared to be under thirty years of age.</p><br/><p>They had all been apprentices for at least 10 years and had deep, profound understanding of medicinal plants. Practice had ingrained the knowledge so deeply that if they left the Sect for another on the outside, they would be rated as a medicinal plant Grandmaster.</p><br/><p>Right now, they solemnly filed forward toward the workstations. Meng Hao took a deep breath as he looked around at the workstations, selected one, and sat down.</p><br/><p>This was his first time participating in an examination for promotion from apprentice alchemist. However, the feeling was not strange to him. Actually… everything felt quite familiar.</p><br/><p>The scene around him was very much like the examinations he had taken part in back when he was a scholar in the State of Zhao. He had participated in the preliminary rounds of the Imperial examinations on multiple occasions, and although he had never scored top marks, he was still very familiar with the process.</p><br/><p>Meng Hao chuckled to himself. “There really are a lot of similarities between the two. This master alchemist promotion examination tests your knowledge of medicinal plants. The more plants you remember, the more details you recall, and the more accurately you do so, will determine how close to perfection your final score is. It’s not very different at all from the imperial examinations.” He felt like he was back in the imperial examination hall. Except this time, he was not aiming for a scholarly rank, but promotion in the Dao of alchemy.</p><br/><p>He took another deep breath and looked around at all the apprentice alchemists as they peered down at the jade slip in front of them. Suddenly, magical glowing screens appeared in front of them, upon which could be seen various medicinal plants.</p><br/><p>The task of all the apprentice alchemists was to identify the plants they recognized and then record their habits and characteristics, planting requirements, harvesting methods and any other details.</p><br/><p>Seeing that many of the participants had already started, Meng Hao tapped his jade slip, and immediately, a magical screen appeared. He stared thoughtfully at the medicinal plant which appeared, and then began to record the name of the plant, its characteristics, and some other details.</p><br/><p>Time passed. The square was quiet and peaceful. The eight old men who sat cross-legged by the pill furnace appeared to Meng Hao to be the test administrators. They looked around the examination square. Clearly, if anyone caused a disturbance, severe punishment would follow.</p><br/><p>Meng Hao soon fell into a rhythm of answering the questions. He quickly recorded the information about the plants that appeared in front of him. Many of them he had seen with his own eyes in the Celestial Land. Others, he had even held in his own hands when assisting Li Tao in pill concoction.</p><br/><p>Six hours quickly passed. Meng Hao was immersed in filling out his answers. His eyes shone with determination. He had discovered that this was an excellent method to verify how much he had learned. All of the information he had studied about medicinal plants during the better part of the year once again floated up in his mind.</p><br/><p>As he reached down into the depths of his memory, he began to experience the same feeling he had as a scholar all those years ago, the joy that can be found in the midst of hardship.</p><br/><p>Soon, it became apparent that some of the surrounding apprentice alchemists were wearing out. Some frowned, obviously wracking their brains for answers. More time went by, another four hours. Some of the apprentice alchemists were pale-faced. Many were clearly encountering unfamiliar medicinal plants, which they would skip past quickly. However, soon, they discovered that the unfamiliar plants became more and more frequent. Eventually, people began to abandon their struggles and bitterly leave the examination field. They moved off to the side to observe.</p><br/><p>Within a short time, more and more apprentice alchemists began to stare bitterly at the screens in front of them. They would stare blankly for a while, then stand and walk off to the side, heaving bitter sighs. Despite ten or more years of experience, many of these people had difficulty remembering so many medicinal plants. After all, there were one hundred thousand of them, with a million variations. If one’s Cultivation base was high enough, Divine Sense could be used to brand the information in one’s mind; without that ability, though, the only other method was rote memorization, which was incredibly difficult.</p><br/><p>Meng Hao, of course, was by nature a scholar and an intellectual. From the moment he had begun to tread the path of a scholar, each and every day had been devoted to memorizing things.</p><br/><p>His expression was calm, and his gaze was locked onto the screen in front of him. He zoned out everything else, focusing completely on the ever-changing medicinal plants. The more questions he answered, the happier he grew. His movements were like floating clouds and flowing water, natural and spontaneous. Soon, he began to attract the attention of some of the people who had given up, and were now observing the proceedings.</p><br/><p>More time passed. The examination had now been underway for twenty hours. Of the original thirty thousand participants, only twenty thousand continued to fill in answers. The surroundings were as quiet as ever. Those who had abandoned their efforts did not leave, they stood by quietly, watching on.</p><br/><p>By the time the thirtieth hour arrived, only seventy percent of the twenty thousand participants remained. The eyes of these more than ten thousand apprentice alchemists were bloodshot. Each and every one doggedly stared at their respective glowing screens, continuing to fill in information from their studies.</p><br/><p>Meng Hao was as calm as ever. The speed with which he answered the questions caused Wang Fanming and the other old men to cast sidelong glances at each other.</p><br/><p>By the fortieth hour, only thirty percent or so of the participants had not given up.</p><br/><p>By the sixtieth hour, only six thousand remained in the square, continuing on madly with the examination. Already, quite a few were obviously about to give up. If they looked around, they would see that their compatriots were madly going all out, jaws clenched as they pondered the images of the medicinal plants in front of them, attempting to recall their habits and characteristics.</p><br/><p>By the time eighty continuous hour of testing had passed, only three thousand participants remained. They had been answering questions for four days and four nights with no rest whatsoever. They were like mad devils who could remember everything.</p><br/><p>When the one hundredth hour arrived, an older man who appeared to be about fifty years old coughed up a mouthful of blood and then collapsed to the ground. His previously gray hair was now completely white. The scene caused quite a commotion, and quite a few of the surrounding apprentice alchemists immediately stood pale-faced and gave up.</p><br/><p>They knew that if they continued, they may very well die here this day. They walked off to the side, supported by fellow apprentice alchemists. Everyone was now watching the remaining thousand test takers, their eyes filled with fear and dread. They knew full well how fearsome these people were.</p><br/><p>Only incredibly extraordinary individuals could remember so many of the hundred thousand plants and one million variations.</p><br/><p>Meng Hao took a deep breath. His eyes felt gritty, so he closed them for a moment to rest. Then he opened them, focusing on the medicinal plants and continuing to fill out answers.</p><br/><p>Time passed by in a blur. The number of people who remained answering questions grew smaller and smaller. One thousand, eight hundred, five hundred, three hundred… By the time one hundred and eighty hours had passed, only eleven people remained!</p><br/><p>The eleven people all sat in different locations within the enormous square, competing with unbridled frenzy. Meng Hao was frowning. Some of the plants in front of him required a careful search of his memory to recall.</p><br/><p>This was especially true of the medicinal plants that were easily misidentified. These could only be correctly identified by carefully examining various tiny details. In fact, in some cases, they could only be distinguished by taste; unfortunately only images were available, which meant that even further examination was required before any information could be recorded.</p><br/><p>The other ten people all were pale-faced, and their eyes radiated with ferocity. Having endured all the way down to this point, they obviously were not willing to give up. This test was a trial by fire, and an unforgiving one at that. Only ten mistakes or oversights were allowed, and then, instant disqualification.</p><br/><p>In this test, no one could masquerade as having ability. The best among the apprentice alchemists would be visible in a single glance.</p><br/><p>Suddenly, one of the final eleven suddenly grew white as death. His expression changed as the screen in front of him suddenly disappeared. He stared mutely for a long moment, then staggered to his feet and laughed bitterly. A fellow apprentice alchemist held him by the arm as he left his workstation.</p><br/><p>The observing apprentice alchemists began to breathe heavily. There were now only ten participants left; these ten had already passed into the second round of the examination.</p><br/><p>However, not a single one stood up!</p><br/><p>Despite being assured a pass to the next round, all of these apprentice alchemists aspired to be master alchemists. Being so ambitious and proud, they possessed the spirit of competition; they naturally wanted to see who would be the first among them all!</p><br/><p>Each and every one of them possessed the same mentality. All of the surrounding thirty thousand apprentice alchemists were watching on with rapt attention. They were all wondering, in the end… who would place first?</p><br/><p>Wang Fanming and the seven other old men watched on wordlessly. They said nothing to end the examination, and instead watched on quietly.</p><br/><p>Time passed by. These ten people, including Meng Hao, were all well-known figures amongst the apprentice alchemists. All of them were clearly qualified to become master alchemists. Their eyes were completely bloodshot as they stared at the screens in front of them. None gave up.</p><br/><p>Meng Hao closed his eyes for a moment and took a deep breath. When he opened them, he found himself looking at a very rare medicinal plant. In fact, this was a plant that was not among the one hundred thousand medicinal plants, but rather, a hybrid grass that was one of the one million variations.</p><br/><p>Even those Cultivators in the Southern Domain who considered themselves experienced and knowledgeable, would only be able to stare in frustration at such a plant.</p><br/><p>“It’s getting harder and harder,” thought Meng Hao, sighing deeply. “But that only makes things more interesting.” His face radiated stubborness. As of now, the aura of a Cultivator had grown faint around him, to be replaced by the implacability of a scholar. This was the stubborness of someone who had repeatedly failed in the imperial examinations, and yet continued to participate.</p><br/><p>After joining the East Pill Division, Meng Hao realized that he really was innately inclined to practice alchemy!</p><br/><p>Perhaps in terms of Cultivation, his latent talent was not extraordinary. But when it came to alchemy, however, he possessed true genius! Whether it was memorizing medicinal plants, or catalyzing them, he stood head and shoulders above all others.</p><br/><p>In fact, you could say that this was not innate talent, this was nature talent! Nature talent regarding all plants and vegetation!</p><br/><p>Meng Hao suddenly recalled the words of Shui Dongliu [1. Shui Dongliu's words as referenced here are from only a few chapters ago, chapter 208 to be specific]. Gradually he came to realize that he didn’t always have nature talent. This nature talent came from the Resurrection Lily!</p><br/><p>Meng Hao wasn’t sure how much time had passed. Soon, one screen after another went dark among the final ten. They had clearly made more than ten mistakes, and were out.</p><br/><p>Soon the hour arrived in which only two people remained!</p><br/><p>One was Meng Hao, the other was a grim-faced, middle-aged man. As they continued with the examination, the middle aged man would look up from time to time at Meng Hao. His eyes slowly filled with crazed determination.</p><br/><p>-----</p><br/><p><em>This chapter was sponsored by Blake Zbikowski</em></p><br/>\n</div>"}